{
    "name": "Accordion FAQ with Category",
    "slug": "accordion-faq-for-elementor",
    "version": "1.4",
    "author": "<a href=\"http://www.wpmart.org/\">Sk. Abul Hasan</a>",
    "author_profile": "https://profiles.wordpress.org/wpmart/",
    "contributors": {
        "wpmart": {
            "profile": "https://profiles.wordpress.org/wpmart/",
            "avatar": "https://secure.gravatar.com/avatar/5bd3cca5436aad1e034da56926870e50?s=96&d=monsterid&r=g",
            "display_name": "wpmart"
        }
    },
    "requires": "5.6",
    "tested": "6.5.5",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 80,
    "ratings": {
        "5": 3,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 4,
    "support_url": "https://wordpress.org/support/plugin/accordion-faq-for-elementor/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 100,
    "downloaded": 3988,
    "last_updated": "2024-04-26 3:05am GMT",
    "added": "2021-02-07",
    "homepage": "https://wordpress.org/plugins/accordion-faq-for-elementor",
    "sections": {
        "description": "<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/92aD7c1ytmU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><a href=\"https://wpmart.org/faq-demo-01-05/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://wpmart.org/contact/\" rel=\"nofollow ugc\">Support</a> | <a href=\"https://wpmart.org/downloads/best-accordion-faq-with-category/\" rel=\"nofollow ugc\">Upgrade to Pro!</a></p>\n<p>The best FAQ and Accordion plugin that also works with Gutenberg blocks using the shortcode. Highly responsive and customizable FAQ builder for Elementor with Category.</p>\n<p>FAQ for Elementor with Category is the standard, lightweight FAQ plugin for WordPress which contains all of the responsive Accordion FAQ features you can think of while working on your next project in WordPress. With its excellence, the WpMart brought to you the exclusive FAQ plugin that works with all types of blocks for the Elementor page builder. The awesome toggle tab, accordion faq with custom category, and the fastest knowledge-based FAQ all are some exclusive features for the FAQ for Elementor WordPress FAQ plugins which every developer needs.</p>\n<p>The FAQ for Elementor with Category was designed to be the best way for adding dynamic accordion faq very easily within any professional website and knowledge-based sites. It is one of the responsive and highly efficient FAQ plugins in WordPress which works seamlessly within gutenberg blocks as well.</p>\n<p>This awesome Accordion FAQ with Category that has a sleek CSS3 code is one of the best FAQ plugins while creating responsive tabs, content toggle, knowledge-based FAW with dropdown and unlimited effects &amp; animation support. It is by far the most lightweight yet customizable FAQ plugin in WordPress with major page builder integration including the Elementor.</p>\n<h4>Multiple styles and layouts with 1600+ Free Font Awesome Icon</h4>\n<p>We provide a free <strong>1600+ font awesome icon</strong> with our FAQ for Elementor with Category plugin along with some cool features to play with. You can find so much flexibility with our plugin. With FAQ for Elementor with Category plugin, you can select your preferred style from multiple FAQ templates and FAQs styles. You can use either the toggle FAQs or Accordions style to display one expanded or collapsed FAQs answer on click. You can custom control the opening of your faqs.</p>\n<p>You can also choose to display all FAQs on the same page with the FAQs style optional list that offers a more traditional FAQs layout. Or you can set a particular FAQ tab to remain open on the first-page load. You can add categories and later, you can customize that category as you like, and then you can embed multiple categories into one FAQ item. Lots of things you can do with our plugin. There is no limit to customization.</p>\n<h4>FAQ for Elementor’s Key Features:</h4>\n<ul>\n<li>Responsive Pre-made FAQ Designs</li>\n<li>Dynamic FAQ building plugin works within any page builder</li>\n<li>Easily use via simple shortcodes</li>\n<li>Highly customized for User Experience</li>\n<li>Sleek Frontend and backend User interface</li>\n<li>Add and remove items from the backend</li>\n<li>Enable/disable the collapsible feature</li>\n<li>Multiple Advanced Custom Field Available</li>\n<li>Advanced typography</li>\n<li>All browser compatible</li>\n<li>20+ pro templates</li>\n<li>1600+ font awesome icons</li>\n<li>Unlimited font-family</li>\n<li>Add Interactivity: With faqs and tabs, you can make better use of the available space on the page. You can save some space and leave a lot more information for your visitors in the knowledge-based section.</li>\n<li>FAQ for Elementor with Category can help make your site look more professional and better polished than other sites.</li>\n<li>It can save a lot of space on the page making your website look less cluttered.</li>\n<li>Separating Content: Showing content only when required while the rest remains invisible dividing the content into parts.</li>\n<li>multiple types of background Overlay</li>\n<li>On Hover Accordion or FAQ</li>\n<li>Interactive Preview Option</li>\n<li>Limitless accordion and faq availability anywhere in the theme</li>\n<li>Awesome input field for faq accordion content</li>\n<li>Unlimited color option</li>\n<li>Bootstrap framework based FAQ plugin with Category</li>\n<li>Border Color Customization</li>\n<li>Font Awesome Icon Picker Integrated</li>\n<li>Multiple different styles Integrated</li>\n<li>Hide All Accordion on page load or display all with one click option</li>\n<li>Add Dynamic Tools: You can add some stunning dynamic functionality to your faq tabs like triggers, activator events, indicators, custom content type, and so on.</li>\n<li>Created with jQuery</li>\n<li>Supports multiple sets of faq tabs on the same page</li>\n<li>Uses Semantic header and Content markup</li>\n<li>Aria attributes and roles aid screen reader accessibility</li>\n<li>Tabs and content are accessible via keyboard/click/hover</li>\n<li>Easy to configure FAQs page</li>\n<li>Smooth Accordions and FAQs Accordion effect</li>\n<li>Smoothly integrates this FAQ for Elementor plugin into any theme</li>\n<li>CSS and JS file for the customization</li>\n<li>Search Engine Friendly </li>\n</ul>\n<p>FAQ for Elementor with Category WordPress plugin comes with an exclusive toolset that lets you create truly responsive websites in a whole new and visual way. From different font sizes per device, to reverse column ordering, this is the most powerful solution for creating perfect FAQs for mobile pages. You can develop your webpage with our plugin simply using your mobile device as well. This is very perfect for landing pages, coming soon pages, or knowledge-based FAQ pages of your website which needs so many FAQ tabs. Our developed canvas works on any theme and lets you get rid of the header area so you get a blank template to work on.</p>\n<h4>Exclusive Page Builder Integration</h4>\n<p>With the exclusive FAQ category along with the major page builder integration, now our FAQ plugin is even better than any other plugins in the WP market. FAQ for Elementor comes with major page builder integration technology which works seamlessly on any page. With the use of our well-organized Shortcode, page builder users can now find more flexibility to use our Accordion FAQ within their builder interface than they find in any other plugin in this category.</p>\n<blockquote>\n<p>Major Builder Supported FAQ for Elementor is totally compatible with all the page builders including Elementor, Beaver Builder, Divi, Visual Composer, SiteOrigin, and so on.</p>\n</blockquote>\n<h4>Best Choice for eCommerce Stores</h4>\n<p>Our top-notched design and development team created the FAQ for the Elementor plugin with the touch of their perfection which will give you maximum flexibility while designing FAQs with our collapsible FAQ plugin. With the ease of the FAQ category, users can create and customize their accordion tabs and FAQs with their own design preference with our FAQ plugins. The plugin works too perfectly to build any web store. With that, eCommerce webmasters can furnish their product page so easily with a professional and attractive touch so that your site can shine with tons of visitors and boost sales.</p>\n<h4>Custom FAQ with Category</h4>\n<p>With our FAQ for Elementor, users can easily add and style their specific FAQ category to work with more ease. It’s very simple to do that from the tab&#8217;s admin panel. While designing FAQ tabs for your WordPress sites, you can easily input your custom FAQ category within the accordion FAQ. And obviously, if you want to design your own style in the front-end and embed it within the page, you have that convenience as well.</p>\n<p>You’ll have both front-end and back-end tools to design the perfect tabs for your site. FAQ for Elementor is the only FAQ plugin in the market which offers that much flexibility to all users, whether it&#8217;s for the pro one or the dummies!</p>\n<h4>UltraFast Loading FAQ Pages</h4>\n<p>It is an important matter of concern while it comes to the FAQ loading speed. Most of the users suffer from the lazy page load and terminate that particular website right away. This would really be a disastrous incident for a webmaster, right? Our FAQ plugin comes with a lightning speed super fast FAQ loading page. This is a fast and simple plugin to be working with while considering zero in the speed issues.</p>\n<p>You can reduce your development time with FAQ for Elementor with Category as it is less complex and needs the least time to build FAQs and accordion to your webpage. And as we designed at the beginning, this plugin allows instant page load, which means you’ll never need to worry about loading extra pages to display your added FAQs or accordions. You can instantly see the preview of each and every change.</p>\n<h4>Some more of the major features includes:</h4>\n<ul>\n<li>Fully responsive Accordion/Toggle FAQ</li>\n<li>Responsive FAQ and Accordion blocks for Gutenberg</li>\n<li>Automatically adds FAQ Schema</li>\n<li>Simple basic Shortcode builder for all pages and posts </li>\n<li>WooCommerce and major page builder Integration including Elementor</li>\n<li>Inline FAQ search-bar</li>\n<li>Enable/Disable FAQ search-bar</li>\n<li>Enable/disable collapsible FAQ tabs</li>\n<li>Custom Trigger and Activator</li>\n<li>Heading- Add eye-catching headlines.</li>\n<li>Image- Add and customize the image size, opacity, and other settings.</li>\n<li>Text Editor- A custom text editor, just like the WordPress editor.</li>\n<li>Accordion- A collapsible display of content with a custom operator</li>\n<li>Toggle-Like Accordion, for FAQ pages.</li>\n<li>HTML- Insert custom code into the page.</li>\n<li>Shortcode- Easily add shortcodes from any plugin into the page.</li>\n<li>FAQ theme widget</li>\n<li>Limit number of FAQs displayed</li>\n<li>Light and Dark theme styling options</li>\n<li>Elementor integration </li>\n<li>Knowledge base and academic FAQ integration</li>\n<li>Custom categories for FAQs</li>\n<li>Display and set FAQs based on categories</li>\n<li>Adds URL attribute for FAQs</li>\n<li>Adds interactive buttons within FAQs</li>\n</ul>\n<h4>Seo-friendly and best eCommerce FAQ for Elementor with Category</h4>\n<p>Using FAQ for Elementor with Category WordPress plugin a developer can easily create <strong>SEO-friendly FAQs</strong> links to individual FAQs posts so that their viewers can simply reach exactly the right FAQs answer, right away they need. You can easily add links to your FAQs to popular social media, such as Facebook, Twitter, and Pinterest so that your customers can help you to spread the word about your FAQs to the world!</p>\n<p>For SEO, this functionality is really so essential. We designed the FAQ for Elementor with Category plugin including some exceptional features which would really helpful for the search engine optimization as your website always needs it whatever business you’re into. Our plugin is also much effective when you use this for any eCommerce website. With FAQ for Elementor with Category WordPress plugin, you can easily add a FAQs tab to each product page, so that your customers can see answers to common FAQs questions about the products they’re browsing. It’s the most comprehensive FAQ solution for every eCommerce site!</p>\n<h4>Sleek Designs yet Very Simple FAQ plugin</h4>\n<p>We developed FAQ for Elementor with Category by the smooth touch of design. Here you create accordions that have “the designer touch”, as we develop this plugin including unique and exceptional features like box shadows, background color, border radius, custom padding, advanced buttons, and much more. You’ll get more than 20 free pre-made templates to start working with. So if you have zero knowledge of setting up the FAQ or Accordion into a site, you still can get your job done without hiring any expensive WP professionals. Moreover, we do have well-made documentation and video tutorials for you to get started with the plugin. So no more worry with FAQ for Elementor with Category!</p>\n<p>We’ve added a Library to our plugin which includes a collection of beautiful templates. We left many tools to our plugin for the developer’s convenience as they can apply their genius brain by custom coding within FAQ for Elementor with Category. They can save their own created pages and sections here as they like, and reuse those on different pages, or export to whole different websites. We’ve also integrated multi-language support within the framework of our FAQ for Elementor tabs builder, so you get a translated panel out of the box.</p>\n<h4>Lightweight is yet Dynamic with Mobile Editing Canvas</h4>\n<p>FAQ for Elementor with Category was designed to be an easy and lightweight way to add responsive faqs and accordions to your content/post/products or knowledge-based faq pages. A developer can simply add unlimited faq tabs with accordions and decorate them with unlimited custom colors in an attractive and presentable fashion. FAQ for Elementor with Category also came up with some exclusive eCommerce features. And you can add and furnish your faq tabs and accordions within your website whether it’s for e-Commerce or any other professional websites.</p>\n<p>FAQ for Elementor with Category has the most customizable yet simple user interface which allows users to add and customize their faq tabs and faq contents very easily without having much trouble. With its widespread efficient settings and tools, you can easily build dynamic and effective faq sections for your knowledge, education, feature, or eCommerce-based pages.</p>\n<p>FAQ for Elementor with Category gives faq content tabs a unique look and beautiful design simultaneously not considering the quality. This is a very Powerful and Simple FAQ building WordPress Plugin that has interactive page builder compatibility. You can add multiple tabs with unique customization in each, also you can insert some color and shadow effect on the tabs content to get a better look. By using the WordPress backend you can create as much as you want and by using a short code, insert it into your posts and pages or directly embed it within a page builder like Elementor!</p>\n<h4>Easy to Use FAQ for Elementor with Category</h4>\n<p>Creating FAQs and customizing it for <strong>100% responsiveness</strong> with this plugin has never been harder. You can design your FAQ section and customize it with 100% responsiveness for every dimension as you have full control over height, width, padding, margin, and so on. Simply Add Title and content into the FAQ panel and set or customize them all from one page. You can also set the global condition to your tabs from our awesome interface. This plugin is very handy and comes with a 100% user-friendly track record.</p>\n<p>There is no complex admin panel within this awesome FAQ Plugin. FAQ for Elementor has a very lightweight and clean user interface that anyone can work with absolutely zero knowledge. It is a fully responsive faq tabs builder plugin with major extensions including Elementor.</p>\n<p>You can add your content by your own chosen source, whether it’s from category pages or your custom link. You’re now free to choose from different types and use the provided shortcode or template to easily embed FAQs in your Website. And within the tab’s content, you can put your custom shortcode from another plugin as well. That allows you to add more dynamic content within your faq tabs contents. It’s easy and effective.</p>\n<h4>Responsive FAQs Features</h4>\n<p>We develop FAQ for Elementor with Category WP plugin with a bunch of creative features including an exclusive live-customizable admin panel. You can easily add accordions or FAQs to your pages, customize the options and control the interface with ease of simplicity. We let the admin panel of the plugin-free in your hand so that you can design the content in your comfort settings.</p>\n<p>FAQ and Accordion tabs with different toggles or accordion effects are an important part while creating attractive, informative, and professional-looking FAQ sections. FAQ for Elementor with Category lets you reach your website at an apex  &hellip;</p>\n",
        "changelog": "<h4>1.4</h4>\n<ul>\n<li>FEATURE – CSS Fixing</li>\n<li>FEATURE – Bug fixing</li>\n</ul>\n<h4>1.3</h4>\n<ul>\n<li>FEATURE – CSS Fixing</li>\n<li>FEATURE – Bug fixing</li>\n</ul>\n<h4>1.2</h4>\n<ul>\n<li>FEATURE – CSS Fixing</li>\n<li>FEATURE – Bug fixing</li>\n</ul>\n<h4>1.1</h4>\n<ul>\n<li>FEATURE – CSS Fixing</li>\n<li>FEATURE – Bug fixing</li>\n</ul>\n<h4>1.0</h4>\n<ul>\n<li>Initial Release</li>\n<li>Added 20+ responsive layout</li>\n</ul>\n"
    },
    "short_description": "Responsive FAQ plugin with Accordion and Category for Elementor and page builders. Add FAQ with collapse and toggle activator easily.",
    "description": "<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/92aD7c1ytmU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><a href=\"https://wpmart.org/faq-demo-01-05/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://wpmart.org/contact/\" rel=\"nofollow ugc\">Support</a> | <a href=\"https://wpmart.org/downloads/best-accordion-faq-with-category/\" rel=\"nofollow ugc\">Upgrade to Pro!</a></p>\n<p>The best FAQ and Accordion plugin that also works with Gutenberg blocks using the shortcode. Highly responsive and customizable FAQ builder for Elementor with Category.</p>\n<p>FAQ for Elementor with Category is the standard, lightweight FAQ plugin for WordPress which contains all of the responsive Accordion FAQ features you can think of while working on your next project in WordPress. With its excellence, the WpMart brought to you the exclusive FAQ plugin that works with all types of blocks for the Elementor page builder. The awesome toggle tab, accordion faq with custom category, and the fastest knowledge-based FAQ all are some exclusive features for the FAQ for Elementor WordPress FAQ plugins which every developer needs.</p>\n<p>The FAQ for Elementor with Category was designed to be the best way for adding dynamic accordion faq very easily within any professional website and knowledge-based sites. It is one of the responsive and highly efficient FAQ plugins in WordPress which works seamlessly within gutenberg blocks as well.</p>\n<p>This awesome Accordion FAQ with Category that has a sleek CSS3 code is one of the best FAQ plugins while creating responsive tabs, content toggle, knowledge-based FAW with dropdown and unlimited effects &amp; animation support. It is by far the most lightweight yet customizable FAQ plugin in WordPress with major page builder integration including the Elementor.</p>\n<h4>Multiple styles and layouts with 1600+ Free Font Awesome Icon</h4>\n<p>We provide a free <strong>1600+ font awesome icon</strong> with our FAQ for Elementor with Category plugin along with some cool features to play with. You can find so much flexibility with our plugin. With FAQ for Elementor with Category plugin, you can select your preferred style from multiple FAQ templates and FAQs styles. You can use either the toggle FAQs or Accordions style to display one expanded or collapsed FAQs answer on click. You can custom control the opening of your faqs.</p>\n<p>You can also choose to display all FAQs on the same page with the FAQs style optional list that offers a more traditional FAQs layout. Or you can set a particular FAQ tab to remain open on the first-page load. You can add categories and later, you can customize that category as you like, and then you can embed multiple categories into one FAQ item. Lots of things you can do with our plugin. There is no limit to customization.</p>\n<h4>FAQ for Elementor’s Key Features:</h4>\n<ul>\n<li>Responsive Pre-made FAQ Designs</li>\n<li>Dynamic FAQ building plugin works within any page builder</li>\n<li>Easily use via simple shortcodes</li>\n<li>Highly customized for User Experience</li>\n<li>Sleek Frontend and backend User interface</li>\n<li>Add and remove items from the backend</li>\n<li>Enable/disable the collapsible feature</li>\n<li>Multiple Advanced Custom Field Available</li>\n<li>Advanced typography</li>\n<li>All browser compatible</li>\n<li>20+ pro templates</li>\n<li>1600+ font awesome icons</li>\n<li>Unlimited font-family</li>\n<li>Add Interactivity: With faqs and tabs, you can make better use of the available space on the page. You can save some space and leave a lot more information for your visitors in the knowledge-based section.</li>\n<li>FAQ for Elementor with Category can help make your site look more professional and better polished than other sites.</li>\n<li>It can save a lot of space on the page making your website look less cluttered.</li>\n<li>Separating Content: Showing content only when required while the rest remains invisible dividing the content into parts.</li>\n<li>multiple types of background Overlay</li>\n<li>On Hover Accordion or FAQ</li>\n<li>Interactive Preview Option</li>\n<li>Limitless accordion and faq availability anywhere in the theme</li>\n<li>Awesome input field for faq accordion content</li>\n<li>Unlimited color option</li>\n<li>Bootstrap framework based FAQ plugin with Category</li>\n<li>Border Color Customization</li>\n<li>Font Awesome Icon Picker Integrated</li>\n<li>Multiple different styles Integrated</li>\n<li>Hide All Accordion on page load or display all with one click option</li>\n<li>Add Dynamic Tools: You can add some stunning dynamic functionality to your faq tabs like triggers, activator events, indicators, custom content type, and so on.</li>\n<li>Created with jQuery</li>\n<li>Supports multiple sets of faq tabs on the same page</li>\n<li>Uses Semantic header and Content markup</li>\n<li>Aria attributes and roles aid screen reader accessibility</li>\n<li>Tabs and content are accessible via keyboard/click/hover</li>\n<li>Easy to configure FAQs page</li>\n<li>Smooth Accordions and FAQs Accordion effect</li>\n<li>Smoothly integrates this FAQ for Elementor plugin into any theme</li>\n<li>CSS and JS file for the customization</li>\n<li>Search Engine Friendly </li>\n</ul>\n<p>FAQ for Elementor with Category WordPress plugin comes with an exclusive toolset that lets you create truly responsive websites in a whole new and visual way. From different font sizes per device, to reverse column ordering, this is the most powerful solution for creating perfect FAQs for mobile pages. You can develop your webpage with our plugin simply using your mobile device as well. This is very perfect for landing pages, coming soon pages, or knowledge-based FAQ pages of your website which needs so many FAQ tabs. Our developed canvas works on any theme and lets you get rid of the header area so you get a blank template to work on.</p>\n<h4>Exclusive Page Builder Integration</h4>\n<p>With the exclusive FAQ category along with the major page builder integration, now our FAQ plugin is even better than any other plugins in the WP market. FAQ for Elementor comes with major page builder integration technology which works seamlessly on any page. With the use of our well-organized Shortcode, page builder users can now find more flexibility to use our Accordion FAQ within their builder interface than they find in any other plugin in this category.</p>\n<blockquote>\n<p>Major Builder Supported FAQ for Elementor is totally compatible with all the page builders including Elementor, Beaver Builder, Divi, Visual Composer, SiteOrigin, and so on.</p>\n</blockquote>\n<h4>Best Choice for eCommerce Stores</h4>\n<p>Our top-notched design and development team created the FAQ for the Elementor plugin with the touch of their perfection which will give you maximum flexibility while designing FAQs with our collapsible FAQ plugin. With the ease of the FAQ category, users can create and customize their accordion tabs and FAQs with their own design preference with our FAQ plugins. The plugin works too perfectly to build any web store. With that, eCommerce webmasters can furnish their product page so easily with a professional and attractive touch so that your site can shine with tons of visitors and boost sales.</p>\n<h4>Custom FAQ with Category</h4>\n<p>With our FAQ for Elementor, users can easily add and style their specific FAQ category to work with more ease. It’s very simple to do that from the tab&#8217;s admin panel. While designing FAQ tabs for your WordPress sites, you can easily input your custom FAQ category within the accordion FAQ. And obviously, if you want to design your own style in the front-end and embed it within the page, you have that convenience as well.</p>\n<p>You’ll have both front-end and back-end tools to design the perfect tabs for your site. FAQ for Elementor is the only FAQ plugin in the market which offers that much flexibility to all users, whether it&#8217;s for the pro one or the dummies!</p>\n<h4>UltraFast Loading FAQ Pages</h4>\n<p>It is an important matter of concern while it comes to the FAQ loading speed. Most of the users suffer from the lazy page load and terminate that particular website right away. This would really be a disastrous incident for a webmaster, right? Our FAQ plugin comes with a lightning speed super fast FAQ loading page. This is a fast and simple plugin to be working with while considering zero in the speed issues.</p>\n<p>You can reduce your development time with FAQ for Elementor with Category as it is less complex and needs the least time to build FAQs and accordion to your webpage. And as we designed at the beginning, this plugin allows instant page load, which means you’ll never need to worry about loading extra pages to display your added FAQs or accordions. You can instantly see the preview of each and every change.</p>\n<h4>Some more of the major features includes:</h4>\n<ul>\n<li>Fully responsive Accordion/Toggle FAQ</li>\n<li>Responsive FAQ and Accordion blocks for Gutenberg</li>\n<li>Automatically adds FAQ Schema</li>\n<li>Simple basic Shortcode builder for all pages and posts </li>\n<li>WooCommerce and major page builder Integration including Elementor</li>\n<li>Inline FAQ search-bar</li>\n<li>Enable/Disable FAQ search-bar</li>\n<li>Enable/disable collapsible FAQ tabs</li>\n<li>Custom Trigger and Activator</li>\n<li>Heading- Add eye-catching headlines.</li>\n<li>Image- Add and customize the image size, opacity, and other settings.</li>\n<li>Text Editor- A custom text editor, just like the WordPress editor.</li>\n<li>Accordion- A collapsible display of content with a custom operator</li>\n<li>Toggle-Like Accordion, for FAQ pages.</li>\n<li>HTML- Insert custom code into the page.</li>\n<li>Shortcode- Easily add shortcodes from any plugin into the page.</li>\n<li>FAQ theme widget</li>\n<li>Limit number of FAQs displayed</li>\n<li>Light and Dark theme styling options</li>\n<li>Elementor integration </li>\n<li>Knowledge base and academic FAQ integration</li>\n<li>Custom categories for FAQs</li>\n<li>Display and set FAQs based on categories</li>\n<li>Adds URL attribute for FAQs</li>\n<li>Adds interactive buttons within FAQs</li>\n</ul>\n<h4>Seo-friendly and best eCommerce FAQ for Elementor with Category</h4>\n<p>Using FAQ for Elementor with Category WordPress plugin a developer can easily create <strong>SEO-friendly FAQs</strong> links to individual FAQs posts so that their viewers can simply reach exactly the right FAQs answer, right away they need. You can easily add links to your FAQs to popular social media, such as Facebook, Twitter, and Pinterest so that your customers can help you to spread the word about your FAQs to the world!</p>\n<p>For SEO, this functionality is really so essential. We designed the FAQ for Elementor with Category plugin including some exceptional features which would really helpful for the search engine optimization as your website always needs it whatever business you’re into. Our plugin is also much effective when you use this for any eCommerce website. With FAQ for Elementor with Category WordPress plugin, you can easily add a FAQs tab to each product page, so that your customers can see answers to common FAQs questions about the products they’re browsing. It’s the most comprehensive FAQ solution for every eCommerce site!</p>\n<h4>Sleek Designs yet Very Simple FAQ plugin</h4>\n<p>We developed FAQ for Elementor with Category by the smooth touch of design. Here you create accordions that have “the designer touch”, as we develop this plugin including unique and exceptional features like box shadows, background color, border radius, custom padding, advanced buttons, and much more. You’ll get more than 20 free pre-made templates to start working with. So if you have zero knowledge of setting up the FAQ or Accordion into a site, you still can get your job done without hiring any expensive WP professionals. Moreover, we do have well-made documentation and video tutorials for you to get started with the plugin. So no more worry with FAQ for Elementor with Category!</p>\n<p>We’ve added a Library to our plugin which includes a collection of beautiful templates. We left many tools to our plugin for the developer’s convenience as they can apply their genius brain by custom coding within FAQ for Elementor with Category. They can save their own created pages and sections here as they like, and reuse those on different pages, or export to whole different websites. We’ve also integrated multi-language support within the framework of our FAQ for Elementor tabs builder, so you get a translated panel out of the box.</p>\n<h4>Lightweight is yet Dynamic with Mobile Editing Canvas</h4>\n<p>FAQ for Elementor with Category was designed to be an easy and lightweight way to add responsive faqs and accordions to your content/post/products or knowledge-based faq pages. A developer can simply add unlimited faq tabs with accordions and decorate them with unlimited custom colors in an attractive and presentable fashion. FAQ for Elementor with Category also came up with some exclusive eCommerce features. And you can add and furnish your faq tabs and accordions within your website whether it’s for e-Commerce or any other professional websites.</p>\n<p>FAQ for Elementor with Category has the most customizable yet simple user interface which allows users to add and customize their faq tabs and faq contents very easily without having much trouble. With its widespread efficient settings and tools, you can easily build dynamic and effective faq sections for your knowledge, education, feature, or eCommerce-based pages.</p>\n<p>FAQ for Elementor with Category gives faq content tabs a unique look and beautiful design simultaneously not considering the quality. This is a very Powerful and Simple FAQ building WordPress Plugin that has interactive page builder compatibility. You can add multiple tabs with unique customization in each, also you can insert some color and shadow effect on the tabs content to get a better look. By using the WordPress backend you can create as much as you want and by using a short code, insert it into your posts and pages or directly embed it within a page builder like Elementor!</p>\n<h4>Easy to Use FAQ for Elementor with Category</h4>\n<p>Creating FAQs and customizing it for <strong>100% responsiveness</strong> with this plugin has never been harder. You can design your FAQ section and customize it with 100% responsiveness for every dimension as you have full control over height, width, padding, margin, and so on. Simply Add Title and content into the FAQ panel and set or customize them all from one page. You can also set the global condition to your tabs from our awesome interface. This plugin is very handy and comes with a 100% user-friendly track record.</p>\n<p>There is no complex admin panel within this awesome FAQ Plugin. FAQ for Elementor has a very lightweight and clean user interface that anyone can work with absolutely zero knowledge. It is a fully responsive faq tabs builder plugin with major extensions including Elementor.</p>\n<p>You can add your content by your own chosen source, whether it’s from category pages or your custom link. You’re now free to choose from different types and use the provided shortcode or template to easily embed FAQs in your Website. And within the tab’s content, you can put your custom shortcode from another plugin as well. That allows you to add more dynamic content within your faq tabs contents. It’s easy and effective.</p>\n<h4>Responsive FAQs Features</h4>\n<p>We develop FAQ for Elementor with Category WP plugin with a bunch of creative features including an exclusive live-customizable admin panel. You can easily add accordions or FAQs to your pages, customize the options and control the interface with ease of simplicity. We let the admin panel of the plugin-free in your hand so that you can design the content in your comfort settings.</p>\n<p>FAQ and Accordion tabs with different toggles or accordion effects are an important part while creating attractive, informative, and professional-looking FAQ sections. FAQ for Elementor with Category lets you reach your website at an apex  &hellip;</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/accordion-faq-for-elementor.1.4.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/accordion-faq-for-elementor/assets/screenshot-1.jpg?rev=2470996",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/accordion-faq-for-elementor/assets/screenshot-2.jpg?rev=2470996",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/accordion-faq-for-elementor/assets/screenshot-3.jpg?rev=2470996",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/accordion-faq-for-elementor/assets/screenshot-4.jpg?rev=2470996",
            "caption": ""
        }
    ],
    "tags": {
        "accordion-faq": "accordion faq",
        "faq": "faq",
        "faq-for-elementor": "FAQ for elementor",
        "faq-with-category": "faq with category",
        "knowledge-based-faq": "knowledge based faq"
    },
    "stable_tag": "1.4",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/accordion-faq-for-elementor.1.0.zip",
        "1.1": "https://downloads.wordpress.org/plugin/accordion-faq-for-elementor.1.1.zip",
        "1.2": "https://downloads.wordpress.org/plugin/accordion-faq-for-elementor.1.2.zip",
        "1.3": "https://downloads.wordpress.org/plugin/accordion-faq-for-elementor.1.3.zip",
        "1.4": "https://downloads.wordpress.org/plugin/accordion-faq-for-elementor.1.4.zip",
        "trunk": "https://downloads.wordpress.org/plugin/accordion-faq-for-elementor.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/accordion-faq-for-elementor/assets/banner-772x250.png?rev=2470997",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/accordion-faq-for-elementor/assets/icon-256x256.png?rev=2470996",
        "2x": "https://ps.w.org/accordion-faq-for-elementor/assets/icon-256x256.png?rev=2470996"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 80,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}