{
    "name": "Admin Search",
    "slug": "admin-search",
    "version": "1.4.0",
    "author": "<a href=\"http://www.andrewstichbury.com\">Andrew Stichbury</a>",
    "author_profile": "https://profiles.wordpress.org/andrewstichbury/",
    "contributors": {
        "andrewstichbury": {
            "profile": "https://profiles.wordpress.org/andrewstichbury/",
            "avatar": "https://secure.gravatar.com/avatar/6e88f6bfc69234eeb026bb2d0a4196b0?s=96&d=monsterid&r=g",
            "display_name": "Andrew Stichbury"
        }
    },
    "requires": "4.9.2",
    "tested": "6.6.1",
    "requires_php": "5.2",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 88,
    "ratings": {
        "5": 13,
        "4": 0,
        "3": 1,
        "2": 1,
        "1": 1
    },
    "num_ratings": 16,
    "support_url": "https://wordpress.org/support/plugin/admin-search/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 14433,
    "last_updated": "2024-07-21 13:03:00",
    "added": "2020-03-18",
    "homepage": "",
    "sections": {
        "description": "<p>Admin Search makes searching your WordPress website easy by bringing results from all your post types, media, taxonomies, comments, users and admin pages together in a single, simple-to-use interface, seamlessly integrated into the WordPress admin interface.</p>\n<p>Choose which post types and taxonomies are searched and the number of results displayed for each. Admin Search also supports custom post types and taxonomies.</p>\n<p>Admin Search is a lightweight plugin with filter hooks for deep customization.</p>\n<h3>Features</h3>\n<ul>\n<li>Search everything on your WordPress site, anywhere</li>\n<li>Simple and easy to use</li>\n<li>Sources of search results are customizable</li>\n<li>Extend the search query with filter hooks</li>\n</ul>\n<h3>Configure &amp; Extend</h3>\n<p>Admin Search can be extended by using filter hooks. The following filters are available:</p>\n<ul>\n<li><code>admin_search_query</code> to modify the search query string. The filter argument supplied is a string containing the search query</li>\n<li><code>admin_search_sources</code> to modify the search sources. The filter argument supplied is an array of sources, add, remove or modify sources</li>\n<li><code>admin_search_posts_query</code> to modify the <a href=\"https://developer.wordpress.org/reference/classes/wp_query/\" rel=\"nofollow ugc\"><code>WP_Query</code></a> arguments array for all searched post types. The filter argument supplied is an array of <code>WP_Query</code> arguments, add, remove or modify supported arguments</li>\n<li><code>admin_search_{Post Type}_query</code> to modify the <a href=\"https://developer.wordpress.org/reference/classes/wp_query/\" rel=\"nofollow ugc\"><code>WP_Query</code></a> arguments array for a specific post type. The filter argument supplied is an array of <code>WP_Query</code> arguments, add, remove or modify supported arguments. Replace <em>{Post Type}</em> with the name of the post type to modify</li>\n<li><code>admin_search_terms_query</code> to modify the <a href=\"https://developer.wordpress.org/reference/functions/get_terms/\" rel=\"nofollow ugc\"><code>get_terms</code></a> arguments array for all searched terms (taxonomies). The filter argument supplied is an array of <code>get_terms</code> arguments, add, remove or modify supported arguments</li>\n<li><code>admin_search_{Term}_query</code> to modify the <a href=\"https://developer.wordpress.org/reference/functions/get_terms/\" rel=\"nofollow ugc\"><code>get_terms</code></a> arguments array for a specific term (taxonomy). The filter argument supplied is an array of <code>get_terms</code> arguments, add, remove or modify supported arguments. Replace <em>{Term}</em> with the name of the term to modify</li>\n<li><code>admin_search_comments_query</code> to modify the <a href=\"https://developer.wordpress.org/reference/classes/wp_comment_query/\" rel=\"nofollow ugc\"><code>WP_Comment_Query</code></a> arguments array for all searched comments. The filter argument supplied is an array of <code>WP_Comment_Query</code> arguments, add, remove or modify supported arguments</li>\n<li><code>admin_search_users_query</code> to modify the <a href=\"https://developer.wordpress.org/reference/classes/WP_User_Query/\" rel=\"nofollow ugc\"><code>WP_User_Query</code></a> arguments array for all searched users. The filter argument supplied is an array of <code>admin_search_users_query</code> arguments, add, remove or modify supported arguments</li>\n<li><code>admin_search_website_titles</code> to modify the labels array for external websites. The filter argument supplied is an array of predefined domains and titles, add, remove or modify domains and titles</li>\n<li><code>admin_search_pre_results</code> and <code>admin_search_post_results</code> to modify the results array before or after results are appended to the array. The filter argument supplied is an empty array for <code>admin_search_pre_results</code> or search results for a given query for <code>admin_search_post_results</code>, add, remove or modify result items</li>\n<li><code>admin_search_fields</code> to modify the searchable fields array. The filter argument supplied is an array of searchable fields (<code>post_title</code>, <code>post_name</code>, <code>post_excerpt</code> and <code>post_content</code>)</li>\n<li><code>admin_search_meta_queries</code> to add custom fields to the searchable fields array. The filter argument supplied is an empty array. Use this filter instead of <code>admin_search_fields</code> when adding custom fields</li>\n</ul>\n<p>Examples:</p>\n<p>Modify the query string before a search is initiated</p>\n<pre><code>// Correct the spelling of dog when searching\nadd_filter( 'admin_search_query', function( $query ) {\n    if ( 'dog' === $query ) {\n        $query = 'doggo';\n    }\n\n    return $query;\n} );\n</code></pre>\n<p>Modify the <code>WP_Query</code> parameters before a search is initiated</p>\n<pre><code>// Exclude post with the ID 96\nadd_filter( 'admin_search_posts_query', function( $query ) {\n    $query['post__not_in'] = array( 96 );\n\n    return $query;\n} );\n</code></pre>\n<p>Add a custom field to the searchable fields</p>\n<pre><code>// Add the price custom field to the searchable fields\nadd_filter( 'admin_search_meta_queries', function( $fields, $post_type ) {\n    if ( 'post' === $post_type ) {\n        $fields[] = 'price';\n    }\n\n    return $fields;\n}, 10, 2 );\n</code></pre>\n<p>Modify the search results after a search has initiated</p>\n<pre><code>// Add custom results from external API\nadd_filter( 'admin_search_post_results', function( $results, $q ) {\n    $results[ 'custom' ][ 'post_type' ] =&gt; array(\n        'name' =&gt; 'custom',\n        'label' =&gt; 'Custom'\n    );\n\n    $json = file_get_contents( 'https://example.com?search=' . $q );\n    $obj = json_decode( $json );\n\n    foreach ( $obj as $item ) {\n        $results[ 'custom' ][ 'posts' ][] = array(\n            …\n        );\n    }\n\n    return $results;\n}, 10, 2 );\n</code></pre>\n",
        "installation": "<ol>\n<li>Visit Plugins &gt; Add New</li>\n<li>Search for “Admin Search”</li>\n<li>Activate Admin Search from your Plugins page</li>\n<li>Go to Settings &gt; Admin Search and choose what to search on your WordPress website</li>\n</ol>\n",
        "changelog": "<h4>1.4.0</h4>\n<ul>\n<li>New Feature: Introducing search suggestions! Now, whenever you search using a term with 9 or more characters and it returns results, it will be added to a database. The more you search that term, the higher it will rank. When you start typing 3 or more characters into the search box, autocomplete will display if it matches a term in the database, hit the right arrow key to apply it. This feature is disabled by default, go to Settings &gt; Admin Search to enable it</li>\n<li>A new setting to enable or disable auto searching has been added. Typically, search results start displaying as you type, you can now disable this and only show results by hitting the enter key</li>\n<li>Many UI updates and some improvements to the mobile interface</li>\n<li>Fixed issues with hotkey handling. Navigating the results with the up and down keys is improved, hitting the right arrow key and the enter key behave better depending on what is in focus</li>\n<li>The search input has been switched from a traditional HTML input field and form to a contenteditable div, this shouldn&#8217;t affect most users but may affect OS or browser settings and extensions that alter the way inputs work. Testing is ongoing</li>\n<li>Added support for WP_Block post type</li>\n<li>Removed the user display as setting. Users will be displayed using their username from now on</li>\n<li>Reduced the default result count to 5. This can still be increased to show more results initially</li>\n<li>Disabled Ctrl + S and Cmmd + S keyboard shortcut due to conflicts with WordPress and browser functionality</li>\n<li>Fixed PHP8 related issues</li>\n<li>Fixed an issue where default settings weren&#8217;t applied when first installing and activating the plugin</li>\n<li>Fixed an issue where no message is displayed if there&#8217;re no results</li>\n<li>Fixed an issue where multiple results are focussed initially</li>\n<li>Fixed an issue with an undefined value displaying on the account setting page</li>\n<li>Tested on WordPress up to version 6.5.3</li>\n</ul>\n<h4>1.3.3</h4>\n<ul>\n<li>Fixed visual issues with media results</li>\n<li>Updated donation link</li>\n</ul>\n<h4>1.3.2</h4>\n<ul>\n<li>Tested on WordPress up to version 6.4.4a</li>\n<li>Added Woocommerce SKU field as searchable field</li>\n</ul>\n<h4>1.3.1</h4>\n<ul>\n<li>Minor fixes to broken text styles</li>\n</ul>\n<h4>1.3.0</h4>\n<ul>\n<li>Results can be previewed from within the search box</li>\n<li>Extended search to include post names (this is also known as the post slug, typically used in the post&#8217;s permalink)</li>\n<li>Added the <code>admin_search_fields</code> filter to include or exclude searchable fields. Current searchable fields include: post_title, post_name, post_excerpt and post_content</li>\n<li>Added the <code>admin_search_meta_queries</code> filter to include meta queries as searchable fields. This can be used to add custom fields to the list of searchable fields</li>\n<li>These changes necessitated the addition of a custom WP_Query parameter, replacing <code>s</code> with <code>as_s</code>. If you have previously added a filter which references or modifies the <code>s</code> parameter, it will need to be updated to <code>as_s</code> (as simple as replacing old with new)</li>\n<li>The Search Box is now moveable</li>\n</ul>\n<h4>1.2.3</h4>\n<ul>\n<li>Fixed an issue with alignment when viewing on the front end</li>\n<li>Fixed an issue where admin menus with no sub menus were not working correctly in the search results</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>Fixed an issue that could cause results not to be displayed if no post types are selected in settings</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Tested on WordPress 6.1.2</li>\n<li>Pressing the escape key with search results open will now clear the search rather than closing the search box. Hitting the escape key with no results will close the search box completely</li>\n<li>Fixed an issue that could cause an error to be displayed on the settings page if no post types are enabled</li>\n<li>Fixed an issue that could throw a 500 error if a taxonomy did not have an associated post type</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>New Feature: Additional search results can now be loaded within the search box. If a source has more results for a query than the Result Count limit, a load more button will appear below those results</li>\n<li>New Feature: An option has been added to the user profile page which allows users to hide their profile from searches. Admins and other users with the <code>edit_user</code> capability can toggle this option for other users</li>\n<li>New Feature: Search for items by their ID by typing a hashtag followed by the ID. Eg. Searching <em>#889</em> will list the item with that ID</li>\n<li>New Feature: A link to the native WordPress admin search page is displayed at the top of each results group</li>\n<li>New Feature: A shortcut to the Admin Search settings page now appears in the search box when hovering over the search bar</li>\n<li>New Feature: Add <em>status:</em> followed by a post status such as <em>published</em>, <em>draft</em> or <em>pending</em> after your search term to only see results with that status. This is limited to post type results</li>\n<li>Update: Tweaks to the design, including an increased width and height, larger typography and improvements to colors</li>\n<li>Update: External websites can now be labelled using a new filter. For example: <em>google.com</em> appears as <em>Google</em>. To add a label, use: <code>admin_search_website_titles</code>, learn more about this filter on the plugin page on WordPress.org</li>\n<li>Update: New filter hook <code>admin_search_sources</code> allows developers to add, modify or remove search sources</li>\n<li>Update: New filter hook <code>admin_search_{Post Type}_query</code> allows developers to add, modify or remove arguments from the WP_Query arguments for a specific post type. This is a dynamic filter, replace {Post Type} with the name of the post type you wish to filter</li>\n<li>Update: New filter hook <code>admin_search_{Term}_query</code> allows developers to add, modify or remove arguments from the WP_Query arguments for a specific term. This is a dynamic filter, replace {Term} with the name of the term you wish to filter</li>\n<li>Update: New filter hook <code>admin_search_pre_results</code> and <code>admin_search_post_results</code> allows developers to add or modify items in the results array before or after other results are appended to the array respectively</li>\n<li>Update: Links for plugin help and ways to support the plugin have been added to the footer on the plugin settings page</li>\n<li>Update: The Result Count options have been changed and the unlimited option removed entirely. The default Result Count value is now 10, your current Result Limit is unchanged until you update it on the settings page</li>\n<li>Update: The minimum query length has been decreased from 3 to 2 to accomodate ID searches</li>\n<li>Update: Users are now searchable by ID</li>\n<li>Fix: Addressed an issue causing post, page and attachment results to display in searches when all post types are disabled</li>\n<li>Fix: Addressed inconsistencies in the accessibility of the search box</li>\n<li>Fix: Started adding support for keyword highlighting on comments, users and admin page results. This is still WIP and may not show for every result, especially if the keyword is in the content but not in the title</li>\n<li>Fix: Improved user access. Eg. now only users who have the capability to edit other users&#8217; posts can use Admin Search</li>\n<li>Fix: The query string has been added to all filter hooks allowing developers to reference the search query in the filter hook callback</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Fix: Addressed an issue causing the search box to display when typing in an input</li>\n<li>Fix: Addressed an issue causing result titles to be hidden when a forward slash was used in the search query</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Update: Tested on version 5.9 of WordPress</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Update: Tested on version 5.8 of WordPress</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Update: The search UI is now centered and the scrim is removed. This makes it easier to access or view content on the page when the search UI is open</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>New Feature: Users are now searchable (by username, display name, email address or role)</li>\n<li>New Feature: Posts can now be searched for by author</li>\n<li>New Feature: Posts can now be searched for by date (year, month, or day posted, or posted before or after a date). This supports most date formats</li>\n<li>New Feature: External websites can be added to search results. When performing a search, links to the external websites will be displayed, this is useful for including links to search results on other websites</li>\n<li>New Feature: The Admin Search is now accessible on the front end of the website. This can be enabled or disabled in the Admin Search settings</li>\n<li>Update: Taxonomies are now individually selectable</li>\n<li>Update: Admin menu searches now search the actual admin menus rather than a static list. This is still in beta and is disabled by default, this does not currently work when searching from the front end of the website</li>\n<li>Update: A new filter has been added to modify the search query string: <code>admin_search_query</code></li>\n<li>Update: A new filter has been added to modify the users query:  <code>admin_search_users_query</code></li>\n<li>Update: The colors of the search UI have been updated to match the WordPress color update. Additionally, developers can customize the search UI colors using CSS variables</li>\n<li>Update: The search UI colors now match the current admin color scheme (except for the Light scheme)</li>\n<li>Update: General CSS updates (mostly for mobile and smaller browser sizes)</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Fix: Addressed javascript error thrown when Admin Search is disabled</li>\n<li>Update: Tested on version 5.7 of WordPress</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Fix: Added correct version number to stylesheet and script URLs</li>\n<li>Update: Tested on version 5.4 of WordPress</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Fix: Limit is now applied to each post type, not the total number of posts returned</li>\n<li>Update: Plugin has been tested back to WordPress 4.9.2</li>\n</ul>\n"
    },
    "short_description": "Admin Search adds a simple, easy-to-use interface to your WordPress admin site that gives you and your admin users the ability to search across multip &hellip;",
    "description": "<p>Admin Search makes searching your WordPress website easy by bringing results from all your post types, media, taxonomies, comments, users and admin pages together in a single, simple-to-use interface, seamlessly integrated into the WordPress admin interface.</p>\n<p>Choose which post types and taxonomies are searched and the number of results displayed for each. Admin Search also supports custom post types and taxonomies.</p>\n<p>Admin Search is a lightweight plugin with filter hooks for deep customization.</p>\n<h3>Features</h3>\n<ul>\n<li>Search everything on your WordPress site, anywhere</li>\n<li>Simple and easy to use</li>\n<li>Sources of search results are customizable</li>\n<li>Extend the search query with filter hooks</li>\n</ul>\n<h3>Configure &amp; Extend</h3>\n<p>Admin Search can be extended by using filter hooks. The following filters are available:</p>\n<ul>\n<li><code>admin_search_query</code> to modify the search query string. The filter argument supplied is a string containing the search query</li>\n<li><code>admin_search_sources</code> to modify the search sources. The filter argument supplied is an array of sources, add, remove or modify sources</li>\n<li><code>admin_search_posts_query</code> to modify the <a href=\"https://developer.wordpress.org/reference/classes/wp_query/\" rel=\"nofollow ugc\"><code>WP_Query</code></a> arguments array for all searched post types. The filter argument supplied is an array of <code>WP_Query</code> arguments, add, remove or modify supported arguments</li>\n<li><code>admin_search_{Post Type}_query</code> to modify the <a href=\"https://developer.wordpress.org/reference/classes/wp_query/\" rel=\"nofollow ugc\"><code>WP_Query</code></a> arguments array for a specific post type. The filter argument supplied is an array of <code>WP_Query</code> arguments, add, remove or modify supported arguments. Replace <em>{Post Type}</em> with the name of the post type to modify</li>\n<li><code>admin_search_terms_query</code> to modify the <a href=\"https://developer.wordpress.org/reference/functions/get_terms/\" rel=\"nofollow ugc\"><code>get_terms</code></a> arguments array for all searched terms (taxonomies). The filter argument supplied is an array of <code>get_terms</code> arguments, add, remove or modify supported arguments</li>\n<li><code>admin_search_{Term}_query</code> to modify the <a href=\"https://developer.wordpress.org/reference/functions/get_terms/\" rel=\"nofollow ugc\"><code>get_terms</code></a> arguments array for a specific term (taxonomy). The filter argument supplied is an array of <code>get_terms</code> arguments, add, remove or modify supported arguments. Replace <em>{Term}</em> with the name of the term to modify</li>\n<li><code>admin_search_comments_query</code> to modify the <a href=\"https://developer.wordpress.org/reference/classes/wp_comment_query/\" rel=\"nofollow ugc\"><code>WP_Comment_Query</code></a> arguments array for all searched comments. The filter argument supplied is an array of <code>WP_Comment_Query</code> arguments, add, remove or modify supported arguments</li>\n<li><code>admin_search_users_query</code> to modify the <a href=\"https://developer.wordpress.org/reference/classes/WP_User_Query/\" rel=\"nofollow ugc\"><code>WP_User_Query</code></a> arguments array for all searched users. The filter argument supplied is an array of <code>admin_search_users_query</code> arguments, add, remove or modify supported arguments</li>\n<li><code>admin_search_website_titles</code> to modify the labels array for external websites. The filter argument supplied is an array of predefined domains and titles, add, remove or modify domains and titles</li>\n<li><code>admin_search_pre_results</code> and <code>admin_search_post_results</code> to modify the results array before or after results are appended to the array. The filter argument supplied is an empty array for <code>admin_search_pre_results</code> or search results for a given query for <code>admin_search_post_results</code>, add, remove or modify result items</li>\n<li><code>admin_search_fields</code> to modify the searchable fields array. The filter argument supplied is an array of searchable fields (<code>post_title</code>, <code>post_name</code>, <code>post_excerpt</code> and <code>post_content</code>)</li>\n<li><code>admin_search_meta_queries</code> to add custom fields to the searchable fields array. The filter argument supplied is an empty array. Use this filter instead of <code>admin_search_fields</code> when adding custom fields</li>\n</ul>\n<p>Examples:</p>\n<p>Modify the query string before a search is initiated</p>\n<pre><code>// Correct the spelling of dog when searching\nadd_filter( 'admin_search_query', function( $query ) {\n    if ( 'dog' === $query ) {\n        $query = 'doggo';\n    }\n\n    return $query;\n} );\n</code></pre>\n<p>Modify the <code>WP_Query</code> parameters before a search is initiated</p>\n<pre><code>// Exclude post with the ID 96\nadd_filter( 'admin_search_posts_query', function( $query ) {\n    $query['post__not_in'] = array( 96 );\n\n    return $query;\n} );\n</code></pre>\n<p>Add a custom field to the searchable fields</p>\n<pre><code>// Add the price custom field to the searchable fields\nadd_filter( 'admin_search_meta_queries', function( $fields, $post_type ) {\n    if ( 'post' === $post_type ) {\n        $fields[] = 'price';\n    }\n\n    return $fields;\n}, 10, 2 );\n</code></pre>\n<p>Modify the search results after a search has initiated</p>\n<pre><code>// Add custom results from external API\nadd_filter( 'admin_search_post_results', function( $results, $q ) {\n    $results[ 'custom' ][ 'post_type' ] =&gt; array(\n        'name' =&gt; 'custom',\n        'label' =&gt; 'Custom'\n    );\n\n    $json = file_get_contents( 'https://example.com?search=' . $q );\n    $obj = json_decode( $json );\n\n    foreach ( $obj as $item ) {\n        $results[ 'custom' ][ 'posts' ][] = array(\n            …\n        );\n    }\n\n    return $results;\n}, 10, 2 );\n</code></pre>\n",
    "download_link": "https://downloads.wordpress.org/plugin/admin-search.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/admin-search/assets/screenshot-1.jpg?rev=2528643",
            "caption": "Search by keyword to find posts, pages, media and more with matching titles or content"
        },
        {
            "src": "https://ps.w.org/admin-search/assets/screenshot-2.jpg?rev=2528643",
            "caption": "Find media by title, alt text, caption or description"
        },
        {
            "src": "https://ps.w.org/admin-search/assets/screenshot-3.jpg?rev=2528643",
            "caption": "Choose result sources and more with settings to tailor your search experience"
        }
    ],
    "tags": {
        "admin": "admin",
        "advanced": "advanced",
        "search": "search"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/admin-search.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/admin-search.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/admin-search.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/admin-search.1.0.3.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/admin-search.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/admin-search.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/admin-search.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/admin-search.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/admin-search.1.1.4.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/admin-search.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/admin-search.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/admin-search.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/admin-search.1.2.3.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/admin-search.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/admin-search.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/admin-search.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/admin-search.1.3.3.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.buymeacoffee.com/andrewstichbury",
    "banners": {
        "low": "https://ps.w.org/admin-search/assets/banner-772x250.png?rev=2528643",
        "high": "https://ps.w.org/admin-search/assets/banner-1544x500.png?rev=2528643"
    },
    "icons": {
        "1x": "https://ps.w.org/admin-search/assets/icon.svg?rev=2263465",
        "svg": "https://ps.w.org/admin-search/assets/icon.svg?rev=2263465"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 88,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "admin-search",
            "language": "en_GB",
            "version": "1.4.0",
            "updated": "2024-02-19 14:48:51",
            "package": "http://downloads.wordpress.org/translation/plugin/admin-search/1.4.0/en_GB.zip"
        }
    ]
}