{
    "name": "ADFO – Custom data in admin dashboard",
    "slug": "admin-form",
    "version": "1.9.1",
    "author": "Giulio Pandolfelli",
    "author_profile": "https://profiles.wordpress.org/giuliopanda/",
    "contributors": {
        "giuliopanda": {
            "profile": "https://profiles.wordpress.org/giuliopanda/",
            "avatar": "https://secure.gravatar.com/avatar/2105f7bdc62ad77924ec606444bbcbd0?s=96&d=monsterid&r=g",
            "display_name": "giuliopanda"
        }
    },
    "requires": "5.9",
    "tested": "6.5.5",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 5,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 5,
    "support_url": "https://wordpress.org/support/plugin/admin-form/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 50,
    "downloaded": 2621,
    "last_updated": "2024-05-03 8:20pm GMT",
    "added": "2022-11-11",
    "homepage": "",
    "sections": {
        "description": "<p>If you&#8217;re a website developer and you need to extend the functionality of WordPress by creating new data structures, this plugin is for you.</p>\n<p>Admin Form allows you to create data collections by connecting directly to your WordPress database. With this plugin, you can easily create new data structures or manage and filter existing tables in the database. For instance, you can streamline the process of developing new plugins by automating the entire data entry administration section.</p>\n<p>Using shortcodes, you can quickly display HTML tables on your site with search results, column sorting, and page breakdowns. Alternatively, you can design your own HTML and use special shortcodes to input data. Admin Form also includes a complete template engine.</p>\n<p>Our comprehensive documentation provides clear and concise instructions on how to use the plugin to its fullest extent. Additionally, the plugin offers flexible customization options, so you can tailor it to your specific needs. Whether you need to manage existing data or create entirely new structures, our plugin can help you accomplish your goals quickly and efficiently.</p>\n<h3>Key Features</h3>\n<p>With Admin Form, you can:</p>\n<ul>\n<li>Create data tables for backend use, including forms with more than 20 data types and an advanced Excel-style search system</li>\n<li>Choose the fields to display and how to display them</li>\n<li>Delete selected data or choose to delete all filtered data (PRO version only)</li>\n<li>Download selected data or all filtered data (PRO version only)</li>\n<li>Choose the roles of who can edit the table</li>\n<li>Use LOOKUP field to show data from other tables (PRO version only)</li>\n<li>Create and edit complex data structures from MySQL queries (PRO version only)</li>\n<li>Publish data in tables with customizable colors, pagination, and search/sort fields</li>\n<li>Show details of single records in popups</li>\n<li>Customize data display using a powerful template engine with attributes, operators, and shortcodes</li>\n<li>Work with PHP hooks and filters, and use a class with functions to manage data from the code</li>\n<li>Create custom post types, generating new lists of data and detail pages</li>\n<li>Add custom fields to post, user, and comment tables, as well as other tables that have a linked &#8220;meta&#8221; table</li>\n<li>Enjoy advanced management in table creation with the PRO version<br />\nI- mport and export data in MySQL or CSV format with the PRO version</li>\n<li>Download the free PRO version at https://github.com/giuliopanda/admin-form-pro/releases/ to access even more features, such as calculated fields and the ability to create query forms.</li>\n<li>Choose the color, the type of pagination, whether to show the search or the ability to sort the fields.</li>\n<li>Show the detail of single records in popup.</li>\n<li>Customize the view through a custom template engine.</li>\n</ul>\n<p>We hope you find Admin Form to be a useful tool for your WordPress development needs!</p>\n<h3>TEMPLATE ENGINE</h3>\n<p>You have at your disposal a powerful template engine similar to wordpress shortcodes.<br />\nYou can customize the data display through attributes. For example to make text uppercase:</p>\n<pre><code>[%item.Title uppercase]\n</code></pre>\n<p>You can control data flows through the most used operators (if, for, break, while, math&#8230;)<br />\nFor example, to check if a user is logged in you can write:</p>\n<pre><code>[^IF [^user]==\"\"] you are not logged in\n[^else]  You are logged in [^endif]\n</code></pre>\n<p>Or pull the data directly into a post via the [adfo_tmpl] shortcode</p>\n<pre><code>[adfo_tmpl]\n&lt;ul&gt;\n    [^FOR EACH=[^POST TYPE=post]]\n        &lt;li&gt;[%item.title_link]&lt;/li&gt;\n    [^ENDFOR]\n&lt;/ul&gt;\n[/adfo_tmpl]\n</code></pre>\n<h3>PHP</h3>\n<p>Obviously you have a set of hooks and filters available for working in php, but you also have a class available with a set of functions to manage data from the code. You will find all the documentation inside the plugin.</p>\n<h3>POST TYPE SUPPORT</h3>\n<p>Custom post types can be created. These are handled with the plugin&#8217;s display and insertion system, thus focusing on data entry rather than content formatting. Using post_types, it is possible to generate not only new lists of data, but also the detail of individual content opened on new pages.</p>\n<h3>METADATA SUPPORT</h3>\n<p>For post, user, comment tables and all tables that have a linked &#8220;meta&#8221; table, Admin Form allows you to add custom fields to the table you are editing.</p>\n<h3>MULTI ROW FOR POST, USER, MEDIA AND LOOKUP SUPPORT</h3>\n<p>You can create fields that can save multiple data such as user lists, media or posts.</p>\n<h3>PRO VERSION</h3>\n<p>There is also a PRO version that you can download for free!</p>\n<p>The pro version adds:<br />\n&#8211; <a href=\"https://github.com/giuliopanda/admin-form-pro/wiki/Calculated-fields\" rel=\"nofollow ugc\">The calculated fields</a>.<br />\n&#8211; <a href=\"https://github.com/giuliopanda/admin-form-pro/wiki/LOOKUP\" rel=\"nofollow ugc\">The lookups fields</a>.<br />\n&#8211; A system for managing tables through mysql queries<br />\n&#8211; The ability to create query forms (LAB).<br />\n&#8211; Advanced management in the creation of tables<br />\n&#8211; <a href=\"https://github.com/giuliopanda/admin-form-pro/wiki/Import-Export\" rel=\"nofollow ugc\">Import and export of data in mysql / csv</a>.</p>\n<p>With the pro version you can directly manage the WordPress database by creating queries like on phpmyadmin or adminer.<br />\nSome differences are:<br />\n&#8211; Greater integration with WordPress allows you to avoid accidental changes to WordPress core tables.<br />\n&#8211; The replace system supports serialized fields<br />\n&#8211; You can edit the query with the help of a series of dedicated tools<br />\n&#8211; For each column you have a menu of options inspired by the Excel system<br />\n&#8211; The ability to edit multiple tables at the same time. in fact, it is possible to edit the fields extracted from the query independently of the tables to which it refers.<br />\nFor example:</p>\n<pre><code>SELECT post.post_title, m01.meta_value AS test, m02.meta_value AS test2 FROM wp_posts` post LEFT JOIN wp_postmeta m01 ON post.ID = m01.post_id AND m01.meta_key = 'test' LEFT JOIN wp_postmeta m02 ON post.ID = m02.post_id AND m02.meta_key = 'test2'\n</code></pre>\n<p>`</p>\n<p>Allows you to edit both the test field and the test2 field</p>\n<p>the link to the project:  <a href=\"https://github.com/giuliopanda/admin-form-pro/releases/\" rel=\"nofollow ugc\">https://github.com/giuliopanda/admin-form-pro/releases/</a></p>\n",
        "installation": "<p>Download the plugin and activate it.</p>\n",
        "changelog": "<h4>1.9.1 2024-05-03 &#8211; Security fix</h4>\n<ul>\n<li>FIXBUG: Security fix: adding nonce verification to the form.</li>\n<li>FIXBUG: Security fix: sanitizing and escaping the dbp_id value.<br />\nThanks to wordfence.com for the advice.</li>\n</ul>\n<h4>1.9.0 2024-03-03 &#8211; Multifields</h4>\n<ul>\n<li>NEW: Multifields have been developed for the post, user, lookup and mediagallery fields. These are saved in a json field.</li>\n<li>IMPROVEMENT: Added json attribute to the template engine</li>\n<li>IMPROVEMENT: csv download handles list data better, shows complete texts, correct html and does not show unnecessary links or added html in columns.</li>\n<li>IMPROVEMENT: Left join autocompletes now show only the actual values i.e. metavalues only show the values of the chosen metakey.</li>\n<li>IMPROVEMENT: Improved communication in the order field.</li>\n<li>FIXBUG: When you download or export it now extracts a series of useless columns (the val ones)!</li>\n<li>FIXBUG: Notice: Function register_post_type was called incorrectly.</li>\n<li>FIXBUG: Pagination on lists on the last page sometimes disappears (wp_posts_with_metakey)</li>\n<li>FIXBUG: in form-admin fix some Deprecated in php 8.x</li>\n<li>FIXBUG: in list-form if I create a new field the show wraps! layout bug </li>\n<li>FIXBUG pinacode [^USER] returned empty even if logged in</li>\n<li>FIXBUG [^IF [%a] == &#8220;&#8221; ] if [%a] was not set it did not return true</li>\n<li>FIXBUG [^IF [^user] == &#8220;&#8221;] if you were not logged in it didn&#8217;t return true</li>\n<li>FIXBUG export sql error in fields where there was a %</li>\n<li>FIXBUGS various deprecated notice</li>\n<li>FIXBUG creation field missing ORDER field</li>\n</ul>\n<h4>1.8.4 2023-11-27 &#8211; FIXBUG</h4>\n<ul>\n<li>In amministrazione se provi a collegare uno shortcode di una tabella in una colonna custom dava fatal error perché non trovava search</li>\n</ul>\n<h4>1.8.3 2023-04-14 &#8211; FIXBUG</h4>\n<ul>\n<li>BUGFIX: The saving of the fields of the form did not work</li>\n</ul>\n<h4>1.8.2 2023-03-15 &#8211; FIXBUG</h4>\n<ul>\n<li>BUGFIX: The pagination had disappeared, I apologize for the bug.</li>\n</ul>\n<h4>1.8.1 2023-03-13 &#8211; FIXBUG</h4>\n<ul>\n<li>BUGFIX: Input in list field</li>\n<li>BUGFIX: In the form, there was very limited number of metadata that could be entered without changing max_input_vars</li>\n<li>BUGFIX: PHP errors were being shown</li>\n</ul>\n<h4>1.8.0 2023-03-08 &#8211; Edit fields in a list</h4>\n<ul>\n<li>NEW: Editing fields directly in lists. It is now possible to edit data directly from the list through the Edit Field columns. The following have been implemented: checkboxes, input, select fields and a sort field.</li>\n<li>NEW Frontend Export. Now you can show a button for exporting data to the frontend. If you want to manage from code, ADFO:draw_export_btn function has been added which draws buttons to export a table in the frontend to csv or sql. The function [^BTN_EXPORT] has been added from the template engine.</li>\n<li>NEW: Adds the new functions for the template engine [^GET_SINGLE] and [^GET_DETAIL] [^GET_TOTAL]</li>\n<li>NEW: form field ORDER: the field is of numeric type. By default a number that is always higher than the previous one is proposed.  </li>\n<li>NEW: Added CODE TAB with examples related to the list in use.</li>\n<li>IMPROVEMENT: ADFO::get_data if not passed limit and order parameters takes default parameters.</li>\n<li>IMPROVEMENT: Improved page loading performance. The query to calculate the total number of records has been optimized.</li>\n<li>IMPROVEMENT: Ability to randomly sort table data.</li>\n<li>IMPROVEMENT: redesigned the sort buttons.</li>\n<li>BUGFIX: Loss of list settings when saving the frontend setting.</li>\n<li>BUGFIX: Inhibited the ability to create fields with only numbers.</li>\n<li>BUGFIX PRO: Always appear show all text even when query gives error.</li>\n<li>BUGFIX PRO: If a query gave error the double editor would appear!</li>\n<li>BUGFIX PRO: List export and subsequent import used to fail for complex queries or some types of fields, especially calculated fields which are now added to RAW export. </li>\n<li>BUGFIX: If a status field is present it could not be found in the frontend.</li>\n<li>BUGFIX: Default value for DATE, DATETIME and TIME now is converted to date in the correct format according to the field type.</li>\n<li>BUGFIX: Dates in javascript are now handled as timestamps. </li>\n<li>BUGFIX: The invalid fields already appeared red when you loaded the form (before you did the submit).</li>\n</ul>\n<h4>1.7.0 2023-02-16 &#8211; POST_TYPE</h4>\n<ul>\n<li>NEW: Post_type management. When creating a new form, a post_type can be created directly or a new form linked to the post table can be created by filtering directly for a post_type. Registration of a new post_type can be customized within the setting tab.<br />\nWhen a module is linked to a post_type the post_type filter is imposed directly in the query.</li>\n<li>NEW: Status field. The status field manages published, draft, and trash records. </li>\n<li>IMPROVEMENT: author field. Now if a field is set as author it is possible to manage roles to allow some users to see and edit only their own records.</li>\n<li>IMPROVEMENT: Optimization of saving settings.</li>\n<li>IMPROVEMENT: Default configuration for posts when creating a new list.</li>\n<li>IMPROVEMENT: IDs are hidden in the frontend detail by default.</li>\n<li>IMPROVEMENT: new php ADFO::get_single function to have the detail display of a record.</li>\n<li>IMPROVEMENT: of tab form and list view formatting display and sorting.</li>\n<li>REMOVE filter legacy mode. apply_filters( &#8216;dbp_ &#8230;</li>\n<li>BUGFIX the author field is overwritten when editing.</li>\n<li>BUGFIX: even if a list is put in trash the shortcodes work !!! [adfo_list id=xxx]</li>\n<li>BUGFIX: on sorting form fields within the same table. The preview of the field after you release is wrong it is like pasting in wrong nesting or carrying the wrong preview.</li>\n</ul>\n<h4>1.6.0 2023-22-01 &#8211; FIXBUG</h4>\n<ul>\n<li>NEW: Added Time field and template engine attributes: timenum-to-timestr, timestr-to-timenum and time-to-hour</li>\n<li>NEW (PRO) in the datapress main page added a box that shows the running queries and allows you to remove them</li>\n<li>FIXBUG (PRO) show table in import data list </li>\n<li>IMPROVEMENT: Limited metadata function. Metadata must be unique. There can be only one metadata for each meta_key. During the save if I find more metadata for the same key I delete them.</li>\n<li>IMPROVEMENT: (TAB FORM) the test of the calculated fields does not work with data which however works in production. Added an information box if using [%data.</li>\n<li>IMPROVEMENT: (TAB FORM) option in select: if there are no values I set them equal to the labels</li>\n<li>IMPROVEMENT: Changed the default setting of the frontend of the tables.</li>\n<li>IMPROVEMENT: Rebuild of post and user fields on lists. They now display the post title or the user&#8217;s nicename. Search now works on user title or name instead of IDs. However, it is not possible to sort the list by a post or user field. This will not be developed because if you change the data type of the list the query will give an error.</li>\n<li>IMPROVEMENT: (LIST view formatting) On post and user type columns I no longer choose which information to show, it&#8217;s always the title or username, but I&#8217;ve added the option to automatically create the link to the article or author&#8217;s page. Attention this change generates a small incompatibility with previous versions. If you are using the post or user field check out the new functionality. If you wanted to link to other fields, use the lookup field instead.</li>\n<li>FIXBUG Added checking on date fields when they are invalid.</li>\n<li>FIXBUG: (page action=list-sql-edit) When I save it hides the primary keys in the lists.</li>\n<li>FIXBUG: on import for user post and lookup fields</li>\n<li>FIXBUG: FRONTEND when you press enter and you have the focus on the search even if it is in ajax it sends the data in get</li>\n<li>FIXBUG: (TAB FORM) When you created a new field it didn&#8217;t allow dragging it to sort.</li>\n<li>FIXBUG: In frontend tables, filters with values populated by particular shortcodes (like [^current_post.id] ) were forgotten in ajax calls for paging, or searching.</li>\n</ul>\n<h4>1.5.0 2023-01-08</h4>\n<h4>1.4.0 2022-12-15</h4>\n<h4>1.3.0 2022-12-07</h4>\n<h4>1.2.0 2022-11-23</h4>\n<h4>1.1.0 2022-11-17</h4>\n<h4>1.0.1 2022-11-12</h4>\n"
    },
    "short_description": "Allow your customers to manage new data sets for your site.",
    "description": "<p>If you&#8217;re a website developer and you need to extend the functionality of WordPress by creating new data structures, this plugin is for you.</p>\n<p>Admin Form allows you to create data collections by connecting directly to your WordPress database. With this plugin, you can easily create new data structures or manage and filter existing tables in the database. For instance, you can streamline the process of developing new plugins by automating the entire data entry administration section.</p>\n<p>Using shortcodes, you can quickly display HTML tables on your site with search results, column sorting, and page breakdowns. Alternatively, you can design your own HTML and use special shortcodes to input data. Admin Form also includes a complete template engine.</p>\n<p>Our comprehensive documentation provides clear and concise instructions on how to use the plugin to its fullest extent. Additionally, the plugin offers flexible customization options, so you can tailor it to your specific needs. Whether you need to manage existing data or create entirely new structures, our plugin can help you accomplish your goals quickly and efficiently.</p>\n<h3>Key Features</h3>\n<p>With Admin Form, you can:</p>\n<ul>\n<li>Create data tables for backend use, including forms with more than 20 data types and an advanced Excel-style search system</li>\n<li>Choose the fields to display and how to display them</li>\n<li>Delete selected data or choose to delete all filtered data (PRO version only)</li>\n<li>Download selected data or all filtered data (PRO version only)</li>\n<li>Choose the roles of who can edit the table</li>\n<li>Use LOOKUP field to show data from other tables (PRO version only)</li>\n<li>Create and edit complex data structures from MySQL queries (PRO version only)</li>\n<li>Publish data in tables with customizable colors, pagination, and search/sort fields</li>\n<li>Show details of single records in popups</li>\n<li>Customize data display using a powerful template engine with attributes, operators, and shortcodes</li>\n<li>Work with PHP hooks and filters, and use a class with functions to manage data from the code</li>\n<li>Create custom post types, generating new lists of data and detail pages</li>\n<li>Add custom fields to post, user, and comment tables, as well as other tables that have a linked &#8220;meta&#8221; table</li>\n<li>Enjoy advanced management in table creation with the PRO version<br />\nI- mport and export data in MySQL or CSV format with the PRO version</li>\n<li>Download the free PRO version at https://github.com/giuliopanda/admin-form-pro/releases/ to access even more features, such as calculated fields and the ability to create query forms.</li>\n<li>Choose the color, the type of pagination, whether to show the search or the ability to sort the fields.</li>\n<li>Show the detail of single records in popup.</li>\n<li>Customize the view through a custom template engine.</li>\n</ul>\n<p>We hope you find Admin Form to be a useful tool for your WordPress development needs!</p>\n<h3>TEMPLATE ENGINE</h3>\n<p>You have at your disposal a powerful template engine similar to wordpress shortcodes.<br />\nYou can customize the data display through attributes. For example to make text uppercase:</p>\n<pre><code>[%item.Title uppercase]\n</code></pre>\n<p>You can control data flows through the most used operators (if, for, break, while, math&#8230;)<br />\nFor example, to check if a user is logged in you can write:</p>\n<pre><code>[^IF [^user]==\"\"] you are not logged in\n[^else]  You are logged in [^endif]\n</code></pre>\n<p>Or pull the data directly into a post via the [adfo_tmpl] shortcode</p>\n<pre><code>[adfo_tmpl]\n&lt;ul&gt;\n    [^FOR EACH=[^POST TYPE=post]]\n        &lt;li&gt;[%item.title_link]&lt;/li&gt;\n    [^ENDFOR]\n&lt;/ul&gt;\n[/adfo_tmpl]\n</code></pre>\n<h3>PHP</h3>\n<p>Obviously you have a set of hooks and filters available for working in php, but you also have a class available with a set of functions to manage data from the code. You will find all the documentation inside the plugin.</p>\n<h3>POST TYPE SUPPORT</h3>\n<p>Custom post types can be created. These are handled with the plugin&#8217;s display and insertion system, thus focusing on data entry rather than content formatting. Using post_types, it is possible to generate not only new lists of data, but also the detail of individual content opened on new pages.</p>\n<h3>METADATA SUPPORT</h3>\n<p>For post, user, comment tables and all tables that have a linked &#8220;meta&#8221; table, Admin Form allows you to add custom fields to the table you are editing.</p>\n<h3>MULTI ROW FOR POST, USER, MEDIA AND LOOKUP SUPPORT</h3>\n<p>You can create fields that can save multiple data such as user lists, media or posts.</p>\n<h3>PRO VERSION</h3>\n<p>There is also a PRO version that you can download for free!</p>\n<p>The pro version adds:<br />\n&#8211; <a href=\"https://github.com/giuliopanda/admin-form-pro/wiki/Calculated-fields\" rel=\"nofollow ugc\">The calculated fields</a>.<br />\n&#8211; <a href=\"https://github.com/giuliopanda/admin-form-pro/wiki/LOOKUP\" rel=\"nofollow ugc\">The lookups fields</a>.<br />\n&#8211; A system for managing tables through mysql queries<br />\n&#8211; The ability to create query forms (LAB).<br />\n&#8211; Advanced management in the creation of tables<br />\n&#8211; <a href=\"https://github.com/giuliopanda/admin-form-pro/wiki/Import-Export\" rel=\"nofollow ugc\">Import and export of data in mysql / csv</a>.</p>\n<p>With the pro version you can directly manage the WordPress database by creating queries like on phpmyadmin or adminer.<br />\nSome differences are:<br />\n&#8211; Greater integration with WordPress allows you to avoid accidental changes to WordPress core tables.<br />\n&#8211; The replace system supports serialized fields<br />\n&#8211; You can edit the query with the help of a series of dedicated tools<br />\n&#8211; For each column you have a menu of options inspired by the Excel system<br />\n&#8211; The ability to edit multiple tables at the same time. in fact, it is possible to edit the fields extracted from the query independently of the tables to which it refers.<br />\nFor example:</p>\n<pre><code>SELECT post.post_title, m01.meta_value AS test, m02.meta_value AS test2 FROM wp_posts` post LEFT JOIN wp_postmeta m01 ON post.ID = m01.post_id AND m01.meta_key = 'test' LEFT JOIN wp_postmeta m02 ON post.ID = m02.post_id AND m02.meta_key = 'test2'\n</code></pre>\n<p>`</p>\n<p>Allows you to edit both the test field and the test2 field</p>\n<p>the link to the project:  <a href=\"https://github.com/giuliopanda/admin-form-pro/releases/\" rel=\"nofollow ugc\">https://github.com/giuliopanda/admin-form-pro/releases/</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/admin-form.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/admin-form/assets/screenshot-1.png?rev=2816851",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/admin-form/assets/screenshot-2.png?rev=2816851",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/admin-form/assets/screenshot-3.png?rev=2816851",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/admin-form/assets/screenshot-4.png?rev=2816851",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/admin-form/assets/screenshot-5.png?rev=2816851",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/admin-form/assets/screenshot-6.png?rev=2816851",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/admin-form/assets/screenshot-7.jpg?rev=2876784",
            "caption": ""
        }
    ],
    "tags": {
        "data-table": "data table",
        "data-tables": "data tables",
        "database": "database",
        "datatables": "datatables",
        "template-engine": "template engine"
    },
    "stable_tag": "trunk",
    "versions": {
        "v.1.0.1": "https://downloads.wordpress.org/plugin/admin-form.v.1.0.1.zip",
        "v.1.2.0": "https://downloads.wordpress.org/plugin/admin-form.v.1.2.0.zip",
        "v.1.3.0": "https://downloads.wordpress.org/plugin/admin-form.v.1.3.0.zip",
        "v.1.4.0": "https://downloads.wordpress.org/plugin/admin-form.v.1.4.0.zip",
        "v.1.5.0": "https://downloads.wordpress.org/plugin/admin-form.v.1.5.0.zip",
        "v.1.6.0": "https://downloads.wordpress.org/plugin/admin-form.v.1.6.0.zip",
        "v.1.7.0": "https://downloads.wordpress.org/plugin/admin-form.v.1.7.0.zip",
        "v.1.8.0": "https://downloads.wordpress.org/plugin/admin-form.v.1.8.0.zip",
        "v.1.8.3": "https://downloads.wordpress.org/plugin/admin-form.v.1.8.3.zip",
        "v.1.9.0": "https://downloads.wordpress.org/plugin/admin-form.v.1.9.0.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/admin-form/assets/icon.svg?rev=2816851",
        "svg": "https://ps.w.org/admin-form/assets/icon.svg?rev=2816851"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}