{
    "name": "Conditional shipping &amp; Advanced Flat rate shipping rates / Flexible shipping for WooCommerce shipping",
    "slug": "advanced-free-flat-shipping-woocommerce",
    "version": "1.6.4.41",
    "author": "<a href=\"http://piwebsolution.com\">PI Websolution</a>",
    "author_profile": "https://profiles.wordpress.org/jyotsnasingh520/",
    "contributors": {
        "jyotsnasingh520": {
            "profile": "https://profiles.wordpress.org/jyotsnasingh520/",
            "avatar": "https://secure.gravatar.com/avatar/f4fffe1a3b258915d858ed94434dd6aa?s=96&d=monsterid&r=g",
            "display_name": "jyotsnasingh520"
        }
    },
    "requires": "3.0.1",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 44,
        "4": 1,
        "3": 0,
        "2": 1,
        "1": 0
    },
    "num_ratings": 46,
    "support_url": "https://wordpress.org/support/plugin/advanced-free-flat-shipping-woocommerce/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 2000,
    "downloaded": 108217,
    "last_updated": "2024-08-22 11:55:00",
    "added": "2019-10-28",
    "homepage": "http://piwebsolution.com/advanced-free-flat-shipping-woocommerce",
    "sections": {
        "description": "<h4>Using WooCommerce conditional shipping rates</h4>\n<p>With this WooCommerce Advanced flexible shipping plugin you can setup your own advanced rules to determine when a free shipping rate should be available for the customer.</p>\n<h4>Using Advanced Flat Rate Shipping for WooCommerce</h4>\n<p>With our Advanced Flat Rate Shipping Method for WooCommerce you can create your own rule. When this rules are satisfied the Advanced Flat rate shipping method will be available to the buyer</p>\n<p>This is highly flexible WooCommerce shipping plugin available, it even allows you to offer table rate shipping through additional charge just like woocommerce table rate shipping plugin does</p>\n<h4>You can apply specific custom shipping rates based on the below condition or combination of the below conditions:</h4>\n<p>Free rules</p>\n<ul>\n<li><strong>Country-based shipping rates</strong>: Assign a shipping rates for the customer of the specific country</li>\n<li><strong>Product-based shipping rates</strong>: Assign different shipping rates if the customer is purchasing a specific product, say if he is purchasing some very large item that needs different shipping rates then you can do that using this rule, this will even work with the variable product</li>\n<li><strong>Category based shipping method</strong>: Assign different shipping rates if the customer is purchasing a product from a specific category, say if he is purchasing furniture category product you will need a shipping rates that allows large-item shipping large items, whereas if he is buying from mobile category he can be shipped by normal shipping</li>\n<li><strong>Cart Sub Total based shipping rates</strong>: If the Cart total reaches some specific value then you can offer him a different shipping rates, E.g: if the user is buying 1000$ worth of product then you want to offer him fast shipping for free</li>\n<li><strong>Quantity based shipping rates</strong>: If you want to offer a different shipping method based on the number of units purchased by the customer then you can do that using this rule</li>\n<li><strong>User-based shipping rates</strong>: As the name suggests, you can offer some shipping method to some specific user on your site</li>\n<li><strong>Free shipping coupon support</strong>: You can make a shipping method free when user applies a free shipping coupon</li>\n<li>Show a different shipping method when there is a back order product present in the cart</li>\n<li>Give only single shipping method option to customer:  If you have several shipping options available at a time based on there conditions but prefer not to display them all, you can utilize this feature to present only one shipping method. This single shipping method can be selected from the available options based on either the maximum or minimum shipping charge.</li>\n<li>If you your site is multi-currency website then you can apply shipping method based on the currency selected by the customer</li>\n</ul>\n<h3>Package manager (Multiple shipping package for order)</h3>\n<p>Ability to effortlessly break down your orders into multiple shipping packages!<br />\nWith our plugin you can create rule to group product in one shipping package based on there category or shipping class. This will allow you to easily manage your order and also allow you to offer a different shipping method for different shipping package and charge different shipping cost for each package separately with in same order. In pro version you can create the package based on product, category, shipping class, attribute (WooCommerce registered attribute), product cost, product stock status (if in stock or on back order).</p>\n<p>Example Scenario:<br />\nYou want to charge a flat 20$ for each unit of fragile items and flat 10$ for each unit of non fragile items.<br />\nSo you will create a Package to group fragile items in a separate shipping package and non fragile items in a separate shipping package.<br />\nThen you will create a shipping method for fragile items and set the shipping cost to 20$ * quantity and then create a shipping method for non fragile items and set the shipping cost to 10$ * quantity.<br />\nso if a customer adds 2 unit of fragile items<br />\nand 3 unit of non fragile items in the cart<br />\nthen the customer will be shown 2 shipping package on his checkout page<br />\nwith one package consisting of fragile items and shipping method with cost 20<em>3 = 60$<br />\nand another shipping package for non fragile items with shipping method with cost 10</em>2 = 20$.</p>\n<p>Check out this video to know how to automatically split order in multiple shipping packages using package manager:</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/MVPPdukqLp0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Pro rules:</p>\n<ul>\n<li><strong>State-based shipping rates</strong>: Assign different flat-rate shipping method as per the State/County of your customer</li>\n<li><strong>Postcode/Zip code based shipping rates</strong>: If the user comes from a specific postcode, you can even assign rage of postcode like 9011&#8230;9090, this will assign the shipping method to all the customer whose postcode falls in 9011 to 9090</li>\n<li><strong>City/town</strong>: offer a shipping method based on the city/town selected by the customer. this does a string comparison to do the matching as city is a text field in the WooCommerce checkout process</li>\n<li><strong>Zone-based shipping rates</strong>: Assign different shipping method as per the Shipping zone of your customer</li>\n<li><strong>Cart Sub Total (after discount) based shipping rates</strong>: Some time the user add discount coupon so their subtotal reduces and if you want to consider those reduced total while deciding the flat rate shipping method you can do that using this rule (you have option to exclude virtual product from this total)</li>\n<li><strong>Weight-based shipping rates</strong>: If your want to offer different shipping rate based on the total weight of the product in the order or cart then you can do this using this rule, it calculates the total weight of the product in the cart and then based on the set value in the rule it assigns a shipping rates</li>\n<li><strong>Product Width based shipping rates</strong>: It finds the maximum width of the product in the cart and uses that as the width of the cart and compares with width value set by you in the rule and as per the logic set in the rule it assign a shipping method</li>\n<li><strong>Product Height based shipping method</strong>: It&#8217;s working is same as the Width working</li>\n<li><strong>Product Length based shipping method</strong>: It&#8217;s working is same as the Width working</li>\n<li><strong>Coupon based shipping method</strong>: Using this you can show a shipping method if the customer has applied some specific coupon code</li>\n<li><strong>Shipping class-based shipping method</strong>: Show a specific shipping method, if the user buys a product that belongs to some specific category of shipping class</li>\n<li><strong>Payment method based shipping method</strong>: Show a specific shipping method, if the user buys select a specific payment gateway, E.g: If you have a shipping method that also collects a payment, then you can show that shipping method when user select cash on the delivery payment method</li>\n<li><strong>User role-based shipping method</strong>: Using this you can assign a different shipping method as per the user role. E.g: you can offer a different shipping method to a registered customer and different shipping method to those who are doing a Guest checkout</li>\n<li><strong>User city based method</strong>: You can offer method based on user city, it is string comparison or city name</li>\n<li><strong>Shipping class total</strong> this rule applies when customer has purchased an x amount of product from specific shipping class</li>\n<li><strong>Shipping class total quantity of product in cart</strong> this rule applies when customer has added x unit of product from a specific shipping class in his cart</li>\n<li>Using our this flexible shipping method plugin you can have different <strong>Shipping method on specific time of the day:</strong> Show a shipping method on specif time of the day, <br />E.g: Show a shipping method between 10am to 1pm only</li>\n<li><strong>Shipping method based on Day of the week:</strong> Offer a shipping method based on the day of the week. <br />E.g: show a shipping method on Saturday and Sunday only</li>\n<li><strong>Shipping method based on Selected delivery day:</strong> show a different shipping method based on the delivery day selected by the customer in Delivery date selector added by the plugin <a href=\"https://www.piwebsolution.com/product/order-delivery-date-time-and-pickup-locations-for-woocommerce/\" rel=\"nofollow ugc\">Delivery date and time plugin</a><br /> E.g: Show a shipping method when customer is option for sunday as delivery date\n    </li>\n<li><strong>Shipping method based on Attribute:</strong> Offer a shipping method based on the variation Attribute selected, so you can offer a specific shipping method when user select Large size of the attribute Size in the variable product</li>\n<li><strong>First order free shipping:</strong> Offer free shipping to customer when they are placing first order on your website</li>\n<li><strong>Last order total:</strong> Offer free shipping to customer if they have purchased more then 100$ worth of product in there last order</li>\n<li><strong>Number of orders total:</strong> Offer free shipping to customer if they have placed more then 10 orders on your site in last 1 month</li>\n<li><strong>Total spend on your website:</strong> Offer free shipping to customer if they have spend more then 1000$ on your website in last 1 month of time</li>\n<li><strong>Exact set of product or set of category of product</strong> Show a shipping method when exact set of product or product belonging to exact set of category are present in the cart.</li>\n<li><strong>Exact set of product or set of category of product not present in the cart</strong> Show a shipping method when exact set of product or product belonging to exact set of category are <strong>NOT</strong> present in the cart.</li>\n<li>Charge $10 for every 100 unit of product in the cart</li>\n<li>Stop user from purchasing physical product based on conditions, as using this plugin you can hide all shipping method conditionally as well, so if there will be no shipping available then user wont be able to checkout</li>\n</ul>\n<ul>\n<li><strong>Remove all other shipping methods</strong> when a particular shipping method is activated (PRO)</li>\n<li><strong>Remove all other shipping methods of this plugin</strong>, when a particular shipping method is activated (PRO)</li>\n<li><strong>Remove all other shipping methods of low priority of this plugin</strong>, when a particular shipping method is activated (PRO)</li>\n</ul>\n<p><a href=\"https://websitemaintenanceservice.in/flat_shipping/\" rel=\"nofollow ugc\">Try Pro version Backend | Frontend demo</a></p>\n<h4>Custom charge in pro version</h4>\n<p>The Cost field allows you to charge a flat rate per item, a percentage based cost or a minimum fee.</p>\n<p>Available placeholders:<br />\n[qty] – Number of products in the cart<br />\n[fee] – An additional fee. This fee has two optional arguments.<br />\npercent – A percentage based on total order cost.<br />\nmin_fee – A minimum amount. Useful when using percentages.<br />\nmax_fee – A maximum amount. Useful when using percentages.<br />\nExamples<br />\n10 + ( 2 * [qty] ) – A base shipping cost of $10 plus $2 for each item in the cart.<br />\n20 + [fee percent=&#8221;10&#8243; min_fee=&#8221;4&#8243;] – A base shipping cost of $20 plus 10% of the order total, which is at least $4.</p>\n<p>similar To WooCommerce original flat rate shipping method</p>\n<h4>Virtual category</h4>\n<p>Virtual category allows you to create a group of product as per your shipping needs, this virtual category do not affect your site url structure this Virtual category is only used in our plugin shipping method.</p>\n<p>You can create a virtual category that is like a group of multiple category, and you can use this virtual category inside the Conditions of shipping method. This gives you fine control over the shipping method.<br />\n* You can even add some extra product or variation of product in this virtual group (PRO)<br />\n* You can exclude some product or variation of product from this virtual group (PRO)</p>\n<p>E.g: You create a virtual category that combines the category T-shirt and Caps, but you want to exclude T-shirt A from this Virtual category so you will add T-shirt A as excluded product, and say your want to make Jeans A as part of this group (although Jeans A do not belong to category T-shirt and cap) so you will add Jeans A as included product to be part of this Virtual category.</p>\n<h3>Additional charges (pro)</h3>\n<p>Using additional charges you can add/subtract charge from the base shipping charge, based on different conditions</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/oGE6daMXrOk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>This are the different conditions available:</p>\n<ul>\n<li>Cart Quantity: <a href=\"https://www.youtube.com/watch?v=0CTSrfgaKvc\" rel=\"nofollow ugc\">Video</a></li>\n<li>Cart Weight: <a href=\"https://www.youtube.com/watch?v=TriQypJAgYI\" rel=\"nofollow ugc\">Video</a></li>\n<li>Cart Subtotal: <a href=\"https://www.youtube.com/watch?v=30tS78nMk40\" rel=\"nofollow ugc\">Video</a></li>\n<li>Product Quantity: <a href=\"https://www.youtube.com/watch?v=lD7gm9PHkvE\" rel=\"nofollow ugc\">Video</a></li>\n<li>Category Quantity: <a href=\"https://www.youtube.com/watch?v=6S1eVLuR6b8\" rel=\"nofollow ugc\">Video</a></li>\n<li>Shipping Class Quantity: <a href=\"https://www.youtube.com/watch?v=DK04pdaB4u0\" rel=\"nofollow ugc\">Video</a></li>\n<li>Product Weight: <a href=\"https://www.youtube.com/watch?v=aOjKK5LfR04\" rel=\"nofollow ugc\">Video</a></li>\n<li>Category Weight: <a href=\"https://www.youtube.com/watch?v=gyhR2OvUDgw\" rel=\"nofollow ugc\">Video</a></li>\n<li>Shipping Class Weight: <a href=\"https://www.youtube.com/watch?v=qIZM7VUUy1c\" rel=\"nofollow ugc\">Video</a></li>\n<li>Product Subtotal: <a href=\"https://www.youtube.com/watch?v=sFdiwsoWvBw\" rel=\"nofollow ugc\">Video</a></li>\n<li>Category Subtotal: <a href=\"https://www.youtube.com/watch?v=XPNsq5U6FHA\" rel=\"nofollow ugc\">Video</a></li>\n<li>Shipping Class Subtotal: <a href=\"https://www.youtube.com/watch?v=GFuvQlEiELE\" rel=\"nofollow ugc\">Video</a></li>\n</ul>\n<h3>Combine multiple shipping method in to single shipping method (PRO)</h3>\n<p>Say your have shipping method A and B on the checkout page each shipping method costing 2 and 3 $ respectively and you want to combine them and show them as single shipping method then you can do that using our plugin so it will show combined shipping method as D whose shipping cost will be 5$ and if you want you can hide the method A and B when this combined method is been shown</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/xkL_YHwNcWo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Compatible with Multi currency plugin</h3>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/woo-multi-currency/\" rel=\"ugc\">CURCY – Multi Currency for WooCommerce – The best free currency exchange plugin – Run smoothly on WooCommerce 6.x</a></li>\n<li><a href=\"https://wordpress.org/plugins/woocommerce-currency-switcher/\" rel=\"ugc\">WOOCS – Currency Switcher for WooCommerce. Professional and Free multi currency plugin – Pay in selected currency</a></li>\n<li><a href=\"https://wpml.org/documentation/related-projects/woocommerce-multilingual/multi-currency-support-woocommerce/\" rel=\"nofollow ugc\">WPML Multi-Currency Support for WooCommerce</a></li>\n</ul>\n<p>Key features:</p>\n<ul>\n<li>improve shipping-related user experience,</li>\n<li>create custom shipping rules,</li>\n<li>offer the free shipping based on the price or products’ in the cart quantity,</li>\n<li>cost based shipping cost</li>\n<li>weight based shipping cost</li>\n<li>total order based shipping cost</li>\n<li>item count based shipping cost</li>\n<li>shipping class based shipping cost</li>\n<li>WooCommerce shipping cost rules</li>\n<li>WooCommerce shipping plugin</li>\n<li>WooCommerce table rate shipping.</li>\n<li>Highly flexible shipping rates</li>\n<li>Per Product Shipping for WooCommerce</li>\n<li>Conditional Payments</li>\n<li>Conditional Country</li>\n<li>Conditional States</li>\n<li>Conditional Shipping</li>\n<li>Variation Product Shipping</li>\n<li>Stand Alone Product Shipping</li>\n<li>WooCommerce Shipping</li>\n<li>Custom Shipping WooCommerce</li>\n<li>Per Product Shipping</li>\n<li>Multiple Product Shipping</li>\n<li>Easy Shipping</li>\n<li>Multi Shipping</li>\n<li>WooCommerce Addon Shipping</li>\n<li>Simple Product Shipping</li>\n<li>Per Product Shipping</li>\n<li>Per Product Shipping WooCommerce</li>\n<li>Table Rate Shipping</li>\n<li>Advanced Shipping</li>\n<li>Flexible Shipping</li>\n<li>Weight Based Shipping</li>\n<li>Free Shipping</li>\n<li>Flat Rate Shipping</li>\n<li>USPS Shipping</li>\n<li>UPS Shipping</li>\n<li>Local Pickup</li>\n<li>Hide Shipping Method</li>\n<li>Custom Shipping</li>\n<li>Bundle Shipping</li>\n<li>Fedex Shipping</li>\n<li>Ship Station Shipping</li>\n<li>Conditional Payment</li>\n<li>Ship by quantity</li>\n<li>Ship by weight</li>\n<li>Ship by order amount</li>\n<li>WooCommerce shipping</li>\n<li>WooCommerce shipping classes</li>\n<li>WooCommerce restrict shipping by postcode</li>\n<li>WooCommerce delivery plugin</li>\n<li>combine shipping method into one shipping method</li>\n<li>automatically split order in multiple shipping packages</li>\n</ul>\n",
        "faq": "\n<dt id='i%20want%20to%20offer%20flat%20rate%20shipping%20for%20specific%20county'>\nI want to offer flat rate shipping for specific county\n</h4>\n<p>\n<p>Yes you can do that using our country based rule</p>\n</p>\n<dt id='i%20want%20to%20offer%20flat%20rate%20shipping%20for%20specific%20country%20when%20there%20subtotal%20exceeds%20certain%20amount'>\nI want to offer flat rate shipping for specific country when there subtotal exceeds certain amount\n</h4>\n<p>\n<p>Yes you can do that by creating a shipping method and adding rule of country and subtotal in it, so when the subtotal will be grater then specified amount and the country selected is as per your rule it will apply this flat rate shipping</p>\n</p>\n<dt id='i%20want%20to%20set%20postal%20code%20range%20in%20the%20condition'>\nI want to set postal code range in the condition\n</h4>\n<p>\n<p>In the pro version you can set range of the postal code in the shipping method rule</p>\n</p>\n<dt id='i%20want%20to%20remove%20other%20shipping%20method%20when%20a%20particular%20shipping%20method%20is%20applied'>\nI want to remove other shipping method when a particular shipping method is applied\n</h4>\n<p>\n<p>You can do that in the pro version</p>\n</p>\n<dt id='i%20want%20to%20charge%20customer%20a%20different%20shipping%20rate%20on%20weekend%20then%20weekdays'>\nI want to charge customer a different shipping rate on Weekend then weekdays\n</h4>\n<p>\n<p>In the pro version we have a rule that allow you to offer a different shipping method based on the day of the week</p>\n</p>\n<dt id='i%20want%20to%20show%20a%20shipping%20method%20only%20on%20weekend'>\nI want to show a shipping method only on weekend\n</h4>\n<p>\n<p>Yes there is rule in the pro version that allows you to show shipping method based on the order placement day of the week</p>\n</p>\n<dt id='i%20want%20to%20show%20a%20shipping%20method%20during%20the%20specific%20time%20of%20the%20day'>\nI want to show a shipping method during the specific time of the day\n</h4>\n<p>\n<p>Yes you can do that in the pro version, there is option to specify the time range and that shipping method will be shown during that time of the day only</p>\n</p>\n<dt id='i%20want%20to%20show%20a%20shipping%20method%20based%20on%20the%20custom%20delivery%20date%20selected%20by%20the%20customer'>\nI want to show a shipping method based on the Custom delivery date selected by the customer\n</h4>\n<p>\n<p>Yes for this you will need our extra plugin <a href=\"https://www.piwebsolution.com/product/order-delivery-date-time-and-pickup-locations-for-woocommerce/\" rel=\"nofollow ugc\">Delivery date and time plugin</a> that allow customer to select delivery date they want, and then the pro version of this plugin will allow you to create rule based on the day user selected date falls, E.g: if you want to offer free shipping on Sundays, so when the customer will select a delivery date that is on Sunday then that shipping method will be shown to him</p>\n</p>\n<dt id='how%20do%20i%20set%20product%20based%20shipping%20method%3F%20%28if%20i%20want%20to%20apply%20shipping%20cost%20%2420%20if%20cart%20has%20particular%20product%29'>\nHow do I set product based shipping method? (If I want to apply shipping cost $20 if cart has particular product)\n</h4>\n<p>\n<p>You have to set a product rule like a cart contains product equal to Christmas cake then give shipping method of cost $20.</p>\n</p>\n<dt id='how%20do%20i%20set%20shipping%20method%20based%20on%20product%20category%20and%20country%3F'>\nHow do I set shipping method based on product category and country?\n</h4>\n<p>\n<p>You have select rule for cart contains category&#8217;s product equal to Halloween toy  and select country equal to UK then give shipping method of cost $30.</p>\n</p>\n<dt id='what%20happen%20when%20multiple%20shipping%20method%20rules%20matches%20%28pro%29'>\nWhat happen when multiple shipping method rules matches (PRO)\n</h4>\n<p>\n<p>Each shipping method gives you option to remove other shipping method of lower priority the options available are as:<br />\n* Hide all other methods<br />\n* Hide all other methods (excluding WC Local Pickup method)<br />\n* Hide all methods except the one added by this plugin<br />\n* Hide all methods except the one added by this plugin and WC Local pickup<br />\n* Hide all plugin methods with lower priority</p>\n</p>\n<dt id='how%20to%20charge%20shipping%20cost%20for%20total%20product%27s%20quantity%20of%20cart%20in%20woocommerce%20store%3F%20%28pro%29'>\nHow to charge shipping cost for total product&#8217;s quantity of cart in WooCommerce store? (PRO)\n</h4>\n<p>\n<p>If you want to charge $10 for total cart&#8217;s quantity then you have to set shipping charge like 10*[qty].</p>\n</p>\n<dt id='is%20it%20possible%20to%20create%20shipping%20methods%20based%20on%20different%20zones%3F%20%28pro%29'>\nIs it possible to create shipping methods based on different zones? (PRO)\n</h4>\n<p>\n<p>Yes, you can create different shipping zones in WooCommerce as per your requirements (based on countries/states/zip-codes), and then you can assign different shipping method to different zones by using shipping zone condition rule.</p>\n</p>\n<dt id='i%20want%20to%20offer%20a%20different%20shipping%20method%20based%20on%20the%20delivery%20day%20selected%20by%20the%20customer'>\nI want to offer a different shipping method based on the Delivery day selected by the customer\n</h4>\n<p>\n<p>You will need to install our <a href=\"https://wordpress.org/plugins/pi-woocommerce-order-date-time-and-type/\" rel=\"ugc\">Order date and time plugin</a> to take the delivery date from the customer and then based day selected by the customer you can show appropriate shipping method</p>\n</p>\n<dt id='offer%20shipping%20method%20based%20on%20attribute%20value'>\nOffer shipping method based on Attribute value\n</h4>\n<p>\n<p>In the PRO version you can offer a shipping method based on the attribute selected in the variation product</p>\n</p>\n<dt id='using%20woocommerce%20shipping%20classes%20weight'>\nUsing WooCommerce shipping classes weight\n</h4>\n<p>\n<p>In pro version you can restrict shipping method based on the weight of product from specific shipping class</p>\n</p>\n<dt id='woocommerce%20weight%20based%20shipping'>\nWooCommerce weight based shipping\n</h4>\n<p>\n<p>You can create a weight based shipping by using additional charge based on Cart weight</p>\n</p>\n<dt id='want%20shipping%20charge%20to%20become%20zero%20when%20free%20shipping%20coupon%20is%20applied'>\nWant shipping charge to become Zero when Free shipping coupon is applied\n</h4>\n<p>\n<p>There is option inside each shipping method to make that shipping method Free when user applies a free shipping coupon to the cart</p>\n</p>\n<dt id='do%20the%20plugin%20support%20free%20shipping%20coupon'>\nDo the plugin support Free shipping coupon\n</h4>\n<p>\n<p>Yes, plugin do support free shipping coupon. You can enable the option &#8220;Make free when free shipping coupon is applied&#8221; inside each of the shipping method to make them free when free shipping coupon is applied</p>\n</p>\n<dt id='combine%20multiple%20shipping%20carrier%20rates%20with%20different%20shipping%20methods%20into%20one%20rate'>\nCombine multiple shipping carrier rates with different shipping methods into one rate\n</h4>\n<p>\n<p>Yes you can do that in the PRO version of the plugin</p>\n</p>\n<dt id='will%20like%20show%20same%20day%20shipping%20method%20when%20all%20the%20product%20in%20the%20cart%20are%20in%20stock'>\nWill like show same day shipping method when all the product in the cart are in Stock\n</h4>\n<p>\n<p>Yes that can be done we have a rule &#8220;Stock status of product in cart&#8221; using this rule you can activate the shipping method when all the product in user cart are in stock</p>\n</p>\n<dt id='i%20want%20to%20charge%20shipping%20as%20percent%20of%20sub%20total%2C%20but%20i%20want%20the%20min%20shipping%20charge%20to%20be%2010%24%20and%20max%20shipping%20charge%20should%20not%20exceed%2050%24'>\nI want to charge shipping as percent of sub total, but I want the min shipping charge to be 10$ and max shipping charge should not exceed 50$\n</h4>\n<p>\n<p>You can do that in the pro version as there you can set the fees to be percent of subtotal and also set a min max range for shipping charge</p>\n</p>\n<dt id='i%20want%20to%20only%20show%20only%20one%20shipping%20method%20so%20customer%20don%27t%20have%20to%20chose%20from%20multiple%20shipping%20method%20and%20i%20want%20to%20show%20the%20most%20expensive%20of%20them'>\nI want to only show only one shipping method so customer don&#8217;t have to chose from multiple shipping method and i want to show the most expensive of them\n</h4>\n<p>\n<p>Yes you can do that, go to Extra settings tab there you will set &#8220;Give only single shipping method option to customer&#8221; to be &#8220;Maximum: Show the shipping method with highest shipping charge&#8221;</p>\n</p>\n<dt id='is%20it%20hpos%20compatible'>\nIs it HPOS compatible\n</h4>\n<p>\n<p>Yes the Free version and PRO version both are HPOS compatible</p>\n</p>\n<dt id='create%20multiple%20shipping%20package'>\ncreate multiple shipping package\n</h4>\n<p>\n<p>you can divide the products of an order to be delivered in multiple shipping package and then assign different shipping method to each package</p>\n</p>\n<dt id='how%20to%20automatically%20split%20order%20in%20multiple%20shipping%20packages'>\nHow to automatically split order in multiple shipping packages\n</h4>\n<p>\n<p>checkout this video https://www.youtube.com/watch?v=MVPPdukqLp0</p>\n</p>\n\n",
        "changelog": "<h4>1.6.4.41</h4>\n<ul>\n<li>Tested for WC 9.1.0</li>\n</ul>\n<h4>1.6.4.40</h4>\n<ul>\n<li>Tested for WP 6.6.1</li>\n</ul>\n<h4>1.6.4.39</h4>\n<ul>\n<li>Tested for WC 9.0.0</li>\n<li>Compatible with PHP 8.2</li>\n</ul>\n<h4>1.6.4.34</h4>\n<ul>\n<li>Tested for WC 8.9.0</li>\n</ul>\n<h4>1.6.4.32</h4>\n<ul>\n<li>Tested for WC 8.8.2</li>\n<li>Tested for WP 6.5.2</li>\n</ul>\n<h4>1.6.4.31</h4>\n<ul>\n<li>Tested for WC 8.7.0</li>\n<li>Tested for WP 6.5.0</li>\n</ul>\n<h4>1.6.4.29</h4>\n<ul>\n<li>Tested for WC 8.5.2</li>\n</ul>\n<h4>1.6.4.24</h4>\n<ul>\n<li>Package manager added</li>\n<li>Package support added in rule and additional charge</li>\n<li>short code support given in the additional charge</li>\n</ul>\n<h4>1.6.4.23</h4>\n<ul>\n<li>Shipping class cost bug fixed and now support shortcode [qty] in shipping class cost</li>\n</ul>\n<h4>1.6.4.22</h4>\n<ul>\n<li>Delete shipping method count transient on activation and deactivation of the plugin</li>\n</ul>\n<h4>1.6.4.20</h4>\n<ul>\n<li>Continents added in the country rule</li>\n</ul>\n<h4>1.6.4.19</h4>\n<ul>\n<li>Tested for WP 6.4.0</li>\n</ul>\n<h4>1.6.4.17</h4>\n<ul>\n<li>Tested for WP 6.3.1</li>\n</ul>\n<h4>1.6.4.11</h4>\n<ul>\n<li>Multi currency feature added</li>\n<li>Tested for WP 6.3.0</li>\n</ul>\n<h4>1.6.4</h4>\n<ul>\n<li>Tested for WC 7.6</li>\n</ul>\n<h4>1.6.3.99</h4>\n<ul>\n<li>Tested for WC 6.2.0</li>\n</ul>\n<h4>1.6.3.93</h4>\n<ul>\n<li>Compatible with HPOS database structure</li>\n</ul>\n"
    },
    "short_description": "WooCommerce conditional shipping &amp; WooCommerce Advanced Flat rate flexible shipping rates plugin to Create Advanced Flat rate shipping or Free shi &hellip;",
    "description": "<h4>Using WooCommerce conditional shipping rates</h4>\n<p>With this WooCommerce Advanced flexible shipping plugin you can setup your own advanced rules to determine when a free shipping rate should be available for the customer.</p>\n<h4>Using Advanced Flat Rate Shipping for WooCommerce</h4>\n<p>With our Advanced Flat Rate Shipping Method for WooCommerce you can create your own rule. When this rules are satisfied the Advanced Flat rate shipping method will be available to the buyer</p>\n<p>This is highly flexible WooCommerce shipping plugin available, it even allows you to offer table rate shipping through additional charge just like woocommerce table rate shipping plugin does</p>\n<h4>You can apply specific custom shipping rates based on the below condition or combination of the below conditions:</h4>\n<p>Free rules</p>\n<ul>\n<li><strong>Country-based shipping rates</strong>: Assign a shipping rates for the customer of the specific country</li>\n<li><strong>Product-based shipping rates</strong>: Assign different shipping rates if the customer is purchasing a specific product, say if he is purchasing some very large item that needs different shipping rates then you can do that using this rule, this will even work with the variable product</li>\n<li><strong>Category based shipping method</strong>: Assign different shipping rates if the customer is purchasing a product from a specific category, say if he is purchasing furniture category product you will need a shipping rates that allows large-item shipping large items, whereas if he is buying from mobile category he can be shipped by normal shipping</li>\n<li><strong>Cart Sub Total based shipping rates</strong>: If the Cart total reaches some specific value then you can offer him a different shipping rates, E.g: if the user is buying 1000$ worth of product then you want to offer him fast shipping for free</li>\n<li><strong>Quantity based shipping rates</strong>: If you want to offer a different shipping method based on the number of units purchased by the customer then you can do that using this rule</li>\n<li><strong>User-based shipping rates</strong>: As the name suggests, you can offer some shipping method to some specific user on your site</li>\n<li><strong>Free shipping coupon support</strong>: You can make a shipping method free when user applies a free shipping coupon</li>\n<li>Show a different shipping method when there is a back order product present in the cart</li>\n<li>Give only single shipping method option to customer:  If you have several shipping options available at a time based on there conditions but prefer not to display them all, you can utilize this feature to present only one shipping method. This single shipping method can be selected from the available options based on either the maximum or minimum shipping charge.</li>\n<li>If you your site is multi-currency website then you can apply shipping method based on the currency selected by the customer</li>\n</ul>\n<h3>Package manager (Multiple shipping package for order)</h3>\n<p>Ability to effortlessly break down your orders into multiple shipping packages!<br />\nWith our plugin you can create rule to group product in one shipping package based on there category or shipping class. This will allow you to easily manage your order and also allow you to offer a different shipping method for different shipping package and charge different shipping cost for each package separately with in same order. In pro version you can create the package based on product, category, shipping class, attribute (WooCommerce registered attribute), product cost, product stock status (if in stock or on back order).</p>\n<p>Example Scenario:<br />\nYou want to charge a flat 20$ for each unit of fragile items and flat 10$ for each unit of non fragile items.<br />\nSo you will create a Package to group fragile items in a separate shipping package and non fragile items in a separate shipping package.<br />\nThen you will create a shipping method for fragile items and set the shipping cost to 20$ * quantity and then create a shipping method for non fragile items and set the shipping cost to 10$ * quantity.<br />\nso if a customer adds 2 unit of fragile items<br />\nand 3 unit of non fragile items in the cart<br />\nthen the customer will be shown 2 shipping package on his checkout page<br />\nwith one package consisting of fragile items and shipping method with cost 20<em>3 = 60$<br />\nand another shipping package for non fragile items with shipping method with cost 10</em>2 = 20$.</p>\n<p>Check out this video to know how to automatically split order in multiple shipping packages using package manager:</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/MVPPdukqLp0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Pro rules:</p>\n<ul>\n<li><strong>State-based shipping rates</strong>: Assign different flat-rate shipping method as per the State/County of your customer</li>\n<li><strong>Postcode/Zip code based shipping rates</strong>: If the user comes from a specific postcode, you can even assign rage of postcode like 9011&#8230;9090, this will assign the shipping method to all the customer whose postcode falls in 9011 to 9090</li>\n<li><strong>City/town</strong>: offer a shipping method based on the city/town selected by the customer. this does a string comparison to do the matching as city is a text field in the WooCommerce checkout process</li>\n<li><strong>Zone-based shipping rates</strong>: Assign different shipping method as per the Shipping zone of your customer</li>\n<li><strong>Cart Sub Total (after discount) based shipping rates</strong>: Some time the user add discount coupon so their subtotal reduces and if you want to consider those reduced total while deciding the flat rate shipping method you can do that using this rule (you have option to exclude virtual product from this total)</li>\n<li><strong>Weight-based shipping rates</strong>: If your want to offer different shipping rate based on the total weight of the product in the order or cart then you can do this using this rule, it calculates the total weight of the product in the cart and then based on the set value in the rule it assigns a shipping rates</li>\n<li><strong>Product Width based shipping rates</strong>: It finds the maximum width of the product in the cart and uses that as the width of the cart and compares with width value set by you in the rule and as per the logic set in the rule it assign a shipping method</li>\n<li><strong>Product Height based shipping method</strong>: It&#8217;s working is same as the Width working</li>\n<li><strong>Product Length based shipping method</strong>: It&#8217;s working is same as the Width working</li>\n<li><strong>Coupon based shipping method</strong>: Using this you can show a shipping method if the customer has applied some specific coupon code</li>\n<li><strong>Shipping class-based shipping method</strong>: Show a specific shipping method, if the user buys a product that belongs to some specific category of shipping class</li>\n<li><strong>Payment method based shipping method</strong>: Show a specific shipping method, if the user buys select a specific payment gateway, E.g: If you have a shipping method that also collects a payment, then you can show that shipping method when user select cash on the delivery payment method</li>\n<li><strong>User role-based shipping method</strong>: Using this you can assign a different shipping method as per the user role. E.g: you can offer a different shipping method to a registered customer and different shipping method to those who are doing a Guest checkout</li>\n<li><strong>User city based method</strong>: You can offer method based on user city, it is string comparison or city name</li>\n<li><strong>Shipping class total</strong> this rule applies when customer has purchased an x amount of product from specific shipping class</li>\n<li><strong>Shipping class total quantity of product in cart</strong> this rule applies when customer has added x unit of product from a specific shipping class in his cart</li>\n<li>Using our this flexible shipping method plugin you can have different <strong>Shipping method on specific time of the day:</strong> Show a shipping method on specif time of the day, <br />E.g: Show a shipping method between 10am to 1pm only</li>\n<li><strong>Shipping method based on Day of the week:</strong> Offer a shipping method based on the day of the week. <br />E.g: show a shipping method on Saturday and Sunday only</li>\n<li><strong>Shipping method based on Selected delivery day:</strong> show a different shipping method based on the delivery day selected by the customer in Delivery date selector added by the plugin <a href=\"https://www.piwebsolution.com/product/order-delivery-date-time-and-pickup-locations-for-woocommerce/\" rel=\"nofollow ugc\">Delivery date and time plugin</a><br /> E.g: Show a shipping method when customer is option for sunday as delivery date\n    </li>\n<li><strong>Shipping method based on Attribute:</strong> Offer a shipping method based on the variation Attribute selected, so you can offer a specific shipping method when user select Large size of the attribute Size in the variable product</li>\n<li><strong>First order free shipping:</strong> Offer free shipping to customer when they are placing first order on your website</li>\n<li><strong>Last order total:</strong> Offer free shipping to customer if they have purchased more then 100$ worth of product in there last order</li>\n<li><strong>Number of orders total:</strong> Offer free shipping to customer if they have placed more then 10 orders on your site in last 1 month</li>\n<li><strong>Total spend on your website:</strong> Offer free shipping to customer if they have spend more then 1000$ on your website in last 1 month of time</li>\n<li><strong>Exact set of product or set of category of product</strong> Show a shipping method when exact set of product or product belonging to exact set of category are present in the cart.</li>\n<li><strong>Exact set of product or set of category of product not present in the cart</strong> Show a shipping method when exact set of product or product belonging to exact set of category are <strong>NOT</strong> present in the cart.</li>\n<li>Charge $10 for every 100 unit of product in the cart</li>\n<li>Stop user from purchasing physical product based on conditions, as using this plugin you can hide all shipping method conditionally as well, so if there will be no shipping available then user wont be able to checkout</li>\n</ul>\n<ul>\n<li><strong>Remove all other shipping methods</strong> when a particular shipping method is activated (PRO)</li>\n<li><strong>Remove all other shipping methods of this plugin</strong>, when a particular shipping method is activated (PRO)</li>\n<li><strong>Remove all other shipping methods of low priority of this plugin</strong>, when a particular shipping method is activated (PRO)</li>\n</ul>\n<p><a href=\"https://websitemaintenanceservice.in/flat_shipping/\" rel=\"nofollow ugc\">Try Pro version Backend | Frontend demo</a></p>\n<h4>Custom charge in pro version</h4>\n<p>The Cost field allows you to charge a flat rate per item, a percentage based cost or a minimum fee.</p>\n<p>Available placeholders:<br />\n[qty] – Number of products in the cart<br />\n[fee] – An additional fee. This fee has two optional arguments.<br />\npercent – A percentage based on total order cost.<br />\nmin_fee – A minimum amount. Useful when using percentages.<br />\nmax_fee – A maximum amount. Useful when using percentages.<br />\nExamples<br />\n10 + ( 2 * [qty] ) – A base shipping cost of $10 plus $2 for each item in the cart.<br />\n20 + [fee percent=&#8221;10&#8243; min_fee=&#8221;4&#8243;] – A base shipping cost of $20 plus 10% of the order total, which is at least $4.</p>\n<p>similar To WooCommerce original flat rate shipping method</p>\n<h4>Virtual category</h4>\n<p>Virtual category allows you to create a group of product as per your shipping needs, this virtual category do not affect your site url structure this Virtual category is only used in our plugin shipping method.</p>\n<p>You can create a virtual category that is like a group of multiple category, and you can use this virtual category inside the Conditions of shipping method. This gives you fine control over the shipping method.<br />\n* You can even add some extra product or variation of product in this virtual group (PRO)<br />\n* You can exclude some product or variation of product from this virtual group (PRO)</p>\n<p>E.g: You create a virtual category that combines the category T-shirt and Caps, but you want to exclude T-shirt A from this Virtual category so you will add T-shirt A as excluded product, and say your want to make Jeans A as part of this group (although Jeans A do not belong to category T-shirt and cap) so you will add Jeans A as included product to be part of this Virtual category.</p>\n<h3>Additional charges (pro)</h3>\n<p>Using additional charges you can add/subtract charge from the base shipping charge, based on different conditions</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/oGE6daMXrOk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>This are the different conditions available:</p>\n<ul>\n<li>Cart Quantity: <a href=\"https://www.youtube.com/watch?v=0CTSrfgaKvc\" rel=\"nofollow ugc\">Video</a></li>\n<li>Cart Weight: <a href=\"https://www.youtube.com/watch?v=TriQypJAgYI\" rel=\"nofollow ugc\">Video</a></li>\n<li>Cart Subtotal: <a href=\"https://www.youtube.com/watch?v=30tS78nMk40\" rel=\"nofollow ugc\">Video</a></li>\n<li>Product Quantity: <a href=\"https://www.youtube.com/watch?v=lD7gm9PHkvE\" rel=\"nofollow ugc\">Video</a></li>\n<li>Category Quantity: <a href=\"https://www.youtube.com/watch?v=6S1eVLuR6b8\" rel=\"nofollow ugc\">Video</a></li>\n<li>Shipping Class Quantity: <a href=\"https://www.youtube.com/watch?v=DK04pdaB4u0\" rel=\"nofollow ugc\">Video</a></li>\n<li>Product Weight: <a href=\"https://www.youtube.com/watch?v=aOjKK5LfR04\" rel=\"nofollow ugc\">Video</a></li>\n<li>Category Weight: <a href=\"https://www.youtube.com/watch?v=gyhR2OvUDgw\" rel=\"nofollow ugc\">Video</a></li>\n<li>Shipping Class Weight: <a href=\"https://www.youtube.com/watch?v=qIZM7VUUy1c\" rel=\"nofollow ugc\">Video</a></li>\n<li>Product Subtotal: <a href=\"https://www.youtube.com/watch?v=sFdiwsoWvBw\" rel=\"nofollow ugc\">Video</a></li>\n<li>Category Subtotal: <a href=\"https://www.youtube.com/watch?v=XPNsq5U6FHA\" rel=\"nofollow ugc\">Video</a></li>\n<li>Shipping Class Subtotal: <a href=\"https://www.youtube.com/watch?v=GFuvQlEiELE\" rel=\"nofollow ugc\">Video</a></li>\n</ul>\n<h3>Combine multiple shipping method in to single shipping method (PRO)</h3>\n<p>Say your have shipping method A and B on the checkout page each shipping method costing 2 and 3 $ respectively and you want to combine them and show them as single shipping method then you can do that using our plugin so it will show combined shipping method as D whose shipping cost will be 5$ and if you want you can hide the method A and B when this combined method is been shown</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/xkL_YHwNcWo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Compatible with Multi currency plugin</h3>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/woo-multi-currency/\" rel=\"ugc\">CURCY – Multi Currency for WooCommerce – The best free currency exchange plugin – Run smoothly on WooCommerce 6.x</a></li>\n<li><a href=\"https://wordpress.org/plugins/woocommerce-currency-switcher/\" rel=\"ugc\">WOOCS – Currency Switcher for WooCommerce. Professional and Free multi currency plugin – Pay in selected currency</a></li>\n<li><a href=\"https://wpml.org/documentation/related-projects/woocommerce-multilingual/multi-currency-support-woocommerce/\" rel=\"nofollow ugc\">WPML Multi-Currency Support for WooCommerce</a></li>\n</ul>\n<p>Key features:</p>\n<ul>\n<li>improve shipping-related user experience,</li>\n<li>create custom shipping rules,</li>\n<li>offer the free shipping based on the price or products’ in the cart quantity,</li>\n<li>cost based shipping cost</li>\n<li>weight based shipping cost</li>\n<li>total order based shipping cost</li>\n<li>item count based shipping cost</li>\n<li>shipping class based shipping cost</li>\n<li>WooCommerce shipping cost rules</li>\n<li>WooCommerce shipping plugin</li>\n<li>WooCommerce table rate shipping.</li>\n<li>Highly flexible shipping rates</li>\n<li>Per Product Shipping for WooCommerce</li>\n<li>Conditional Payments</li>\n<li>Conditional Country</li>\n<li>Conditional States</li>\n<li>Conditional Shipping</li>\n<li>Variation Product Shipping</li>\n<li>Stand Alone Product Shipping</li>\n<li>WooCommerce Shipping</li>\n<li>Custom Shipping WooCommerce</li>\n<li>Per Product Shipping</li>\n<li>Multiple Product Shipping</li>\n<li>Easy Shipping</li>\n<li>Multi Shipping</li>\n<li>WooCommerce Addon Shipping</li>\n<li>Simple Product Shipping</li>\n<li>Per Product Shipping</li>\n<li>Per Product Shipping WooCommerce</li>\n<li>Table Rate Shipping</li>\n<li>Advanced Shipping</li>\n<li>Flexible Shipping</li>\n<li>Weight Based Shipping</li>\n<li>Free Shipping</li>\n<li>Flat Rate Shipping</li>\n<li>USPS Shipping</li>\n<li>UPS Shipping</li>\n<li>Local Pickup</li>\n<li>Hide Shipping Method</li>\n<li>Custom Shipping</li>\n<li>Bundle Shipping</li>\n<li>Fedex Shipping</li>\n<li>Ship Station Shipping</li>\n<li>Conditional Payment</li>\n<li>Ship by quantity</li>\n<li>Ship by weight</li>\n<li>Ship by order amount</li>\n<li>WooCommerce shipping</li>\n<li>WooCommerce shipping classes</li>\n<li>WooCommerce restrict shipping by postcode</li>\n<li>WooCommerce delivery plugin</li>\n<li>combine shipping method into one shipping method</li>\n<li>automatically split order in multiple shipping packages</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.1.6.4.41.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/advanced-free-flat-shipping-woocommerce/assets/screenshot-1.png?rev=2181207",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/advanced-free-flat-shipping-woocommerce/assets/screenshot-2.png?rev=2251891",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/advanced-free-flat-shipping-woocommerce/assets/screenshot-3.png?rev=2182799",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/advanced-free-flat-shipping-woocommerce/assets/screenshot-4.png?rev=2264845",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/advanced-free-flat-shipping-woocommerce/assets/screenshot-6.png?rev=2513031",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/advanced-free-flat-shipping-woocommerce/assets/screenshot-7.png?rev=3014584",
            "caption": ""
        }
    ],
    "tags": {
        "flat-rate-shipping": "flat rate shipping",
        "flexible-shipping": "flexible shipping",
        "shipping-rates": "shipping rates",
        "table-rate": "table rate",
        "woocommerce-shipping": "woocommerce shipping"
    },
    "stable_tag": "1.6.4.41",
    "versions": {
        "1.6.4.10": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.1.6.4.10.zip",
        "1.6.4.23": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.1.6.4.23.zip",
        "1.6.4.30": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.1.6.4.30.zip",
        "1.6.4.31": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.1.6.4.31.zip",
        "1.6.4.32": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.1.6.4.32.zip",
        "1.6.4.33": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.1.6.4.33.zip",
        "1.6.4.34": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.1.6.4.34.zip",
        "1.6.4.36": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.1.6.4.36.zip",
        "1.6.4.37": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.1.6.4.37.zip",
        "1.6.4.39": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.1.6.4.39.zip",
        "1.6.4.40": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.1.6.4.40.zip",
        "1.6.4.41": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.1.6.4.41.zip",
        "trunk": "https://downloads.wordpress.org/plugin/advanced-free-flat-shipping-woocommerce.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://piwebsolution.com",
    "banners": {
        "low": "https://ps.w.org/advanced-free-flat-shipping-woocommerce/assets/banner-772x250.png?rev=2469945",
        "high": "https://ps.w.org/advanced-free-flat-shipping-woocommerce/assets/banner-1544x500.png?rev=2469945"
    },
    "icons": {
        "1x": "https://ps.w.org/advanced-free-flat-shipping-woocommerce/assets/icon.svg?rev=2700613",
        "svg": "https://ps.w.org/advanced-free-flat-shipping-woocommerce/assets/icon.svg?rev=2700613"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}