{
    "name": "Advanced Related Posts",
    "slug": "advanced-related-posts",
    "version": "1.4.8",
    "author": "<a href=\"https://ays-pro.com\">Advanced Related Posts Team</a>",
    "author_profile": "https://profiles.wordpress.org/ays-pro/",
    "contributors": {
        "ays-pro": {
            "profile": "https://profiles.wordpress.org/ays-pro/",
            "avatar": "https://secure.gravatar.com/avatar/687e43a4a0037eb881d2028efa919d9e?s=96&d=monsterid&r=g",
            "display_name": "ays-pro"
        }
    },
    "requires": "4.0",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 60,
    "ratings": {
        "5": 1,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 2,
    "support_url": "https://wordpress.org/support/plugin/advanced-related-posts/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 200,
    "downloaded": 5131,
    "last_updated": "2024-08-27 7:57am GMT",
    "added": "2021-04-27",
    "homepage": "https://ays-pro.com/wordpress/advanced-related-posts",
    "sections": {
        "description": "<h3>WordPress Related Posts plugin</h3>\n<ul>\n<li><a href=\"https://ays-pro.com/wordpress/advanced-related-posts\" rel=\"nofollow ugc\">Advanced Related Posts Premium</a></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/KLgGXMGSUTs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>The WordPress Related Posts plugin allows you to show a related posts list on your website after a post or via a widget. The plugin offers a range of features, including custom thumbnails, meta box settings, advanced styles, and more. The plugin is an essential tool to introduce your page visitors to other related content, <strong>boost site engagement</strong>, and <strong>increase pageviews</strong>. Furthermore, it allows you to fully customize your contextual related posts list without any need for tech skills.</p>\n<p>To activate the tool, select the post types after which you would like to display related posts. You can enable it for all post types or exclude some according to categories and IDs. Besides, you can decide the post relation type and the way of ordering the contextual related posts list. It&#8217;s possible to show excerpts of articles and give their length by characters or words. Last but not least, the plugin has a <strong>related post widget</strong> that enables you to show related articles in the most preferred place on your site. We have made sure that you can control your related post widget settings right inside the plugin for your convenience.</p>\n<p><em>What makes us different?</em>  The plugin is developed by professionals who have placed <strong>special importance on quality and customer satisfaction.</strong> With its intuitive interface, you don&#8217;t have to spend time getting acquainted with the functionality. Get straight to optimizing the tool to your preference and reach expected results. Allow your visitors to discover the amazing content on your page by displaying related content under articles.</p>\n<h4>RELATED POSTS PLUGIN KEY FEATURES</h4>\n<ul>\n<li><strong>Enable for all post types</strong>: Choose to display related articles regardless of the post type. By enabling the option, you cannot exclude similar articles for some categories or post IDs.</li>\n<li><strong>Enable for selected post types</strong>: It&#8217;s up to you to decide under which post types to show related content.</li>\n<li><strong>Exclude for categories and/or post IDs</strong>: Just enter the category name(s) and/or post ID(s) for exclusion. This way, you don&#8217;t display similar articles under the articles that belong to the mentioned categories or have those IDs.</li>\n<li><strong>Count of similar posts</strong>: You can decide the number of linked posts that should be displayed yourself.</li>\n<li><strong>Display on the front page</strong>: Similar articles can also be visible on the home page if you enable the corresponding option.</li>\n<li><strong>Display order results</strong>:  The order of similar posts can be based on one of the following.</li>\n<li><em>Default</em>: Similar articles will be listed according to the filtration that has taken place. No other changes will be made.</li>\n<li><em>Date</em>: The ordering is done according to when articles were created. According to what you choose, the oldest or the most recent posts will appear on the list.</li>\n<li><em>Title</em>: Items will be shown in an ascending or descending alphabetical order.</li>\n<li><strong>Show meta box</strong>: The meta box that appeared under a post on the Dashboard will allow you to give central control to the filtration of the articles. Changes made inside a meta box are higher in priority and thus are more powerful.</li>\n<li><strong>Limit post title length</strong>: You can shorten the titles of linked posts by entering a character or word count.</li>\n<li><strong>Show post excerpt</strong>: Lastly, you can show parts of popular posts and decide their length by entering a character or word count.</li>\n</ul>\n<h4>SIMILAR POSTS RELEVANCE</h4>\n<p>The Related Posts plugin for WordPress does all the hard work for you. It filters articles according to some options that you have chosen inside the plugin. The options that are responsible for filtration are on the <strong>Relevance</strong> tab. Let&#8217;s get acquainted with them.</p>\n<p>With the <strong>Order post query</strong> option, there are three ways you can filter your related content: by <em>relevance, randomly</em>, or by date. If chosen by relevance, the most trendy and popular posts will appear as similar articles. In the case of randomly, there&#8217;s no specified way of filtration, and random items will appear on your thumbnail-rich related posts list. Lastly, choose by date so that the system chooses the most recent posts, then proceeds with the older ones.</p>\n<p>The <strong>Only from the same</strong> option helps you decide whether to display related posts with the same type, tag, and/or format as the current article. You can select more than one of the presented ways for the similar articles list. You can also choose to display same category posts.</p>\n<p>With the <strong>Strongness of matching</strong> option, decide the way to filter your articles. The filtration can take place in one of the following ways.<br />\n&#8211; <em>Gradually weakening</em>: The system will consider all the options that are responsible for filtering and do the work. Imagine that you have ticked all the four suboptions of the <strong>Only from the same</strong> option and have defined the count of linked posts as ten. In this case, the system will first take the items that correspond to all those four suboptions. Then, if the number of articles is not enough, the system will ignore the last suboption (post format), then the second to last one (post tag), and continue the same way unless there are ten same category posts.<br />\n&#8211; <em>And</em>: It is a strict condition, and only those items that completely correspond to the chosen ways of filtration will be selected. Again, if you have ticked all the four suboptions of the Only from the same option and have also enabled the <strong>Limit to the same author</strong> option, the system will only take the articles that correspond to what you have chosen. Even if the numbers of found items (for instance, six) and the one that you predefined (ten) don&#8217;t correspond, it won&#8217;t matter: only six similar articles will be displayed.<br />\n&#8211; <em>Or</em>: It is a milder condition compared with the previous ones. It suggests that the system will first take the items corresponding to the options and suboptions you have enabled. But to find the remaining number of articles, it will then consider only one suboption and start to filter articles according to it. Afterwards, the system will pick another suboption for filtration unless there are as many articles as you wish to display.</p>\n<p>The <strong>Limit to the same author</strong> option allows you to show just the same author&#8217;s works as related.</p>\n<p>Lastly, the <strong>Display only posts from the past</strong> option refers to those similar articles that should be displayed. You need to specify the period of time so that filtration can take place within it. For instance, if you enter 12 in the field and choose Days, only the articles that have been created during the last 12 days will be visible.</p>\n<h4>ADVANCED STYLES</h4>\n<p>The Related Posts plugin for WordPress allows you to customize the design of your related content the way you wish to. Pick one of the layouts, a text color, and thumbnail size. The thumbnail usually takes the first image inside the post. Yet, you can upload a default image for the thumbnail yourself. The plugin also enables you to write your own Custom CSS code.</p>\n<h4>RESPONSIVE DESIGN</h4>\n<p>As the WordPress Related Posts plugin supports responsive design, your thumbnail-rich related posts list can be visible on any device &#8211; mobile phones, tablets, and so forth. The layout of related content won&#8217;t suffer, as it&#8217;s adjusted to different screen sizes. As the number of mobile users is on the rise, we have made sure our plugin helps you increase pageviews and traffic.</p>\n<h4>EASY TO USE</h4>\n<p>The <strong>user interface</strong> of the plugin is very easy to navigate through, making it suitable both for beginners and developers. Besides, <strong>tooltips</strong> will come for help while trying to figure out what an option is for.</p>\n<h4>CONTACT US</h4>\n<p>Do you still have queries about the WordPress Related Posts plugin that haven&#8217;t been answered here? Feel free to contact us via the <a href=\"https://wordpress.org/support/plugin/advanced-related-posts/\" rel=\"ugc\">free Support Forum</a>. Our customer care specialist will give comprehensive answers to your questions within a workday.</p>\n<p><strong>Other plugins from Ays Pro Team</strong></p>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/quiz-maker/\" rel=\"ugc\">Quiz Maker</a> for creating advanced quizzes and exams easily and quickly.</li>\n<li><a href=\"https://wordpress.org/plugins/survey-maker/\" rel=\"ugc\">Survey Maker</a> for collecting data and analyze it.  </li>\n<li><a href=\"https://wordpress.org/plugins/poll-maker/\" rel=\"ugc\">Poll Maker</a> for creating powerful and interactive polls. </li>\n<li><a href=\"https://wordpress.org/plugins/ays-popup-box/\" rel=\"ugc\">Popup Box</a>, an easy way to create eye-catching and engaging popups. </li>\n<li><a href=\"https://wordpress.org/plugins/secure-copy-content-protection/\" rel=\"ugc\">Secure Copy Content Protection</a> to protect web content from being plagiarized.</li>\n<li><a href=\"https://wordpress.org/plugins/chart-builder/\" rel=\"ugc\">Chartify</a> to build both static and dynamic charts, graphs and diagrams. </li>\n<li><a href=\"https://wordpress.org/plugins/easy-form/\" rel=\"ugc\">Easy Form</a> to create various forms for your website. </li>\n<li><a href=\"https://wordpress.org/plugins/ays-chatgpt-assistant/\" rel=\"ugc\">AI ChatBot</a> to generate high-quality content for your blog, and finding the answer to any questions in seconds.</li>\n<li><a href=\"https://wordpress.org/plugins/personal-dictionary/\" rel=\"ugc\">Personal Dictionary</a> to create and organize their vocabulary lists, study and memorize the words.</li>\n<li><a href=\"https://wordpress.org/plugins/faq-builder-ays/\" rel=\"ugc\">FAQ Builder</a> to display Frequently Asked Questions on your website with a beautiful accordion. </li>\n<li><a href=\"https://wordpress.org/plugins/ays-slider/\" rel=\"ugc\">Image Slider</a> give the aility to grab your audience&#8217;s attention with amazing and entertaining slideshows.</li>\n<li><a href=\"https://wordpress.org/plugins/ays-random-posts-and-pages/\" rel=\"ugc\">Random Posts and Pages Widget</a> for creating internal links and encouraging visitor engagement on your website.</li>\n<li><a href=\"https://wordpress.org/plugins/ays-facebook-popup-likebox/\" rel=\"ugc\">Popup Like box</a> to promote your Facebook page and add number of Likes.</li>\n<li><a href=\"https://wordpress.org/plugins/gallery-photo-gallery/\" rel=\"ugc\">Photo Gallery</a> for displaying responsive image gallery with awesome layout options.</li>\n<li><a href=\"https://wordpress.org/plugins/portfolio-responsive-gallery/\" rel=\"ugc\">Portfolio Responsive Gallery</a> to showcase beautiful image galleries on your WordPress websites.</li>\n</ul>\n",
        "installation": "<p>There are two ways to install Advanced Related Posts: the easy way, when you install Advanced Related Posts from your WordPress dashboard, and the not so easy way, when you install it from WordPress.org.</p>\n<ul>\n<li>1.1 The easiest way to enjoy Advanced Related Posts:</li>\n<li>1.1.1 Login to your WordPress dashboard</li>\n<li>1.1.2 Go to Plugins</li>\n<li>1.1.3 Add New</li>\n<li>1.1.4 Search for Advanced Related Posts</li>\n<li>1.1.5 Click to install</li>\n<li>1.2 The second way:</li>\n<li>1.2.1Download the zip file from https://wordpress.org/plugins/advanced-related-posts/</li>\n<li>1.2.2 Go to Plugins</li>\n<li>1.2.3 Add New</li>\n<li>1.2.4 Upload plugin</li>\n<li>1.2.5 Choose file ays advanced_related_posts.zip</li>\n<li>\n<p>1.2.6 Click to install</p>\n</li>\n<li>\n<p>1.3 In order to install the Advanced Related Posts from WordPress.org you must unzip the archive and copy the advanced-related-posts folder into your plugins folder (\\wp-content\\plugins).<br />\nAfter one ofthis steps you can activate the plugin from the Plugins menu.<br />\nOnce activated configure any options as desired and you can enjoy our Advanced Related Posts.</p>\n</li>\n</ul>\n",
        "changelog": "<h4>1.4.8</h4>\n<ul>\n<li>Changed: The banner style on the admin dashboard</li>\n<li>Improved: Styles on the admin dashboard</li>\n</ul>\n<h4>1.4.7</h4>\n<ul>\n<li>Improved: Some Styles on the admin dashboard</li>\n<li>Updated: POT and PO files</li>\n</ul>\n<h4>1.4.6</h4>\n<ul>\n<li>Added: General Settings tab</li>\n<li>Added: WP Editor height option on the general settings</li>\n</ul>\n<h4>1.4.5</h4>\n<ul>\n<li>Added: Description option for the Widgets section on the admin dashboard</li>\n</ul>\n<h4>1.4.4</h4>\n<ul>\n<li>Added: Description option for the Posts section on the admin dashboard</li>\n<li>Tested: Compatible up to 6.6.1</li>\n</ul>\n<h4>1.4.3</h4>\n<ul>\n<li>Fixed: The vulnerability issue on the admin dashboard</li>\n<li>Updated: POT and PO files</li>\n</ul>\n<h4>1.4.2</h4>\n<ul>\n<li>Added: Image border radius option for the Widgets section on the admin dashboard</li>\n<li>Tested: Compatible up to 6.6</li>\n</ul>\n<h4>1.4.1</h4>\n<ul>\n<li>Added: Image border radius option for the Posts section on the admin dashboard</li>\n</ul>\n<h4>1.4.0</h4>\n<ul>\n<li>Improved: Some Styles on the admin dashboard</li>\n</ul>\n<h4>1.3.9</h4>\n<ul>\n<li>Added: Automatic activation/installation of the plugin on the Products submenu</li>\n<li>Tested: Compatible up to 6.5.4</li>\n</ul>\n<h4>1.3.8</h4>\n<ul>\n<li>Added: Read more text option</li>\n</ul>\n<h4>1.3.7</h4>\n<ul>\n<li>Improved: Some changes on the admin dashboard</li>\n</ul>\n<h4>1.3.6</h4>\n<ul>\n<li>Fixed: Footer style issue on the admin dashboard</li>\n<li>Improved: Some changes on the admin dashboard</li>\n<li>Tested: Compatible up to 6.5.3</li>\n</ul>\n<h4>1.3.5</h4>\n<ul>\n<li>Improved: Some changes on the admin dashboard</li>\n</ul>\n<h4>1.3.4</h4>\n<ul>\n<li>Fixed: Some small bugs in admin dashboard</li>\n</ul>\n<h4>1.3.3</h4>\n<ul>\n<li>Improved: Pro Features submenu Interface design</li>\n<li>Updated: POT and PO files</li>\n</ul>\n<h4>1.3.2</h4>\n<ul>\n<li>Added: Help Tab on the Admin Dashboard</li>\n<li>Improved: Some changes on the admin dashboard</li>\n<li>Tested: Compatible up to 6.5.2</li>\n</ul>\n<h4>1.3.1</h4>\n<ul>\n<li>Added: Reset styles button for the Widgets section on the admin dashboard</li>\n</ul>\n<h4>1.3.0</h4>\n<ul>\n<li>Added: Reset styles button for the Posts section on the admin dashboard</li>\n</ul>\n<h4>1.2.9</h4>\n<ul>\n<li>Added: Russian language support</li>\n<li>Improved: CSS styles on admin dashboard</li>\n<li>Updated: POT and PO files</li>\n<li>Tested: Compatible up to 6.5</li>\n</ul>\n<h4>1.2.8</h4>\n<ul>\n<li>Added: Enable Related Posts option for the Widgets/Posts section on the front end</li>\n<li>Fixed: Enable for all post type option</li>\n<li>Tested: Compatible up to 6.4.2</li>\n</ul>\n<h4>1.2.7</h4>\n<ul>\n<li>Changed: The banner style on the admin dashboard</li>\n</ul>\n<h4>1.2.6</h4>\n<ul>\n<li>Improved: CSS styles on admin dashboard</li>\n<li>Updated: POT file</li>\n</ul>\n<h4>1.2.5</h4>\n<ul>\n<li>Added: New plugin logo in admin panel</li>\n<li>Improved: Banner timer </li>\n<li>Improved: CSS styles on admin dashboard</li>\n<li>Improved: Ask a question button style on the admin dashboard</li>\n<li>Tested: Compatible up to 6.4.1</li>\n</ul>\n<h4>1.2.4</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Tested: Compatible up to 6.3.1</li>\n</ul>\n<h4>1.2.3</h4>\n<ul>\n<li>Tested: Compatible up to PHP 8.2+</li>\n<li>Tested: Compatible up to 6.2.2</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>Updated: POT file</li>\n<li>Fixed responsive style issue on the admin dashboard</li>\n<li>Tested: Compatible up to 6.1</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Changed: Our products page design</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Changed: The banner style on the admin dashboard</li>\n<li>Tested: Compatible up to 6.0</li>\n</ul>\n<h4>1.1.9</h4>\n<ul>\n<li>Updated: POT file</li>\n<li>Tested: Compatible up to 5.9</li>\n</ul>\n<h4>1.1.8</h4>\n<ul>\n<li>Fixed: JS problem on the admin dashboard</li>\n</ul>\n<h4>1.1.7</h4>\n<ul>\n<li>Fixed: CSS issue on the admin dashboard</li>\n</ul>\n<h4>1.1.6</h4>\n<ul>\n<li>Fixed: Some issues on the admin dashboard</li>\n</ul>\n<h4>1.1.5</h4>\n<ul>\n<li>Updated: POT file</li>\n<li>Tested: Compatible up to 5.8.2</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Added: Image position option</li>\n<li>Tested: Compatible up to 5.8.1</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Added: Border radius option</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Fixed: CSS conflict with Elementor plugin on the dashboard</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Added: Border width option</li>\n<li>Added: Border style option</li>\n<li>Added: Border color option</li>\n<li>Tested: Compatible up to 5.8</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Fixed: JS issue on the admin dashboard</li>\n<li>Fixed: Saving issue on the admin dashboard</li>\n</ul>\n<h4>1.0.9</h4>\n<ul>\n<li>Added: Background color option</li>\n<li>Added: Background color on mousover option</li>\n</ul>\n<h4>1.0.8</h4>\n<ul>\n<li>Added: Image sizing option</li>\n<li>Fixed: Default thumbnail option issue</li>\n</ul>\n<h4>1.0.7</h4>\n<ul>\n<li>Fixed: Count option issue</li>\n<li>Fixed: Some issues on the admin dashboard</li>\n</ul>\n<h4>1.0.6</h4>\n<ul>\n<li>Added: Title font size option</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Added: Post Ids field in the metabox</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>Changed: Layouts selection style and added images for them</li>\n<li>Tested: Compatible up to 5.7.2</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Added: Ctrl+S saving combination option in the admin dashboard</li>\n<li>Fixed: Some CSS properties concerning responsiveness on the dashboard</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Added: Link on thumbnail</li>\n<li>Added: Enable author name link option</li>\n<li>Added: Tooltips for all options on the dashboard</li>\n<li>Changed: Some options default values</li>\n<li>Updated: POT file</li>\n<li>Fixed: CSS problem on the front-end</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Added: Ask a question icon</li>\n<li>Added: Temporary deactivation button within the deactivation popup</li>\n<li>Updated: PRO features page price list</li>\n<li>Changed: Order posts query option default value</li>\n<li>Changed: Menu item text</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>First release</li>\n</ul>\n"
    },
    "short_description": "This plugin allows you to display related posts with widget or under the post with advanced options.",
    "description": "<h3>WordPress Related Posts plugin</h3>\n<ul>\n<li><a href=\"https://ays-pro.com/wordpress/advanced-related-posts\" rel=\"nofollow ugc\">Advanced Related Posts Premium</a></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/KLgGXMGSUTs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>The WordPress Related Posts plugin allows you to show a related posts list on your website after a post or via a widget. The plugin offers a range of features, including custom thumbnails, meta box settings, advanced styles, and more. The plugin is an essential tool to introduce your page visitors to other related content, <strong>boost site engagement</strong>, and <strong>increase pageviews</strong>. Furthermore, it allows you to fully customize your contextual related posts list without any need for tech skills.</p>\n<p>To activate the tool, select the post types after which you would like to display related posts. You can enable it for all post types or exclude some according to categories and IDs. Besides, you can decide the post relation type and the way of ordering the contextual related posts list. It&#8217;s possible to show excerpts of articles and give their length by characters or words. Last but not least, the plugin has a <strong>related post widget</strong> that enables you to show related articles in the most preferred place on your site. We have made sure that you can control your related post widget settings right inside the plugin for your convenience.</p>\n<p><em>What makes us different?</em>  The plugin is developed by professionals who have placed <strong>special importance on quality and customer satisfaction.</strong> With its intuitive interface, you don&#8217;t have to spend time getting acquainted with the functionality. Get straight to optimizing the tool to your preference and reach expected results. Allow your visitors to discover the amazing content on your page by displaying related content under articles.</p>\n<h4>RELATED POSTS PLUGIN KEY FEATURES</h4>\n<ul>\n<li><strong>Enable for all post types</strong>: Choose to display related articles regardless of the post type. By enabling the option, you cannot exclude similar articles for some categories or post IDs.</li>\n<li><strong>Enable for selected post types</strong>: It&#8217;s up to you to decide under which post types to show related content.</li>\n<li><strong>Exclude for categories and/or post IDs</strong>: Just enter the category name(s) and/or post ID(s) for exclusion. This way, you don&#8217;t display similar articles under the articles that belong to the mentioned categories or have those IDs.</li>\n<li><strong>Count of similar posts</strong>: You can decide the number of linked posts that should be displayed yourself.</li>\n<li><strong>Display on the front page</strong>: Similar articles can also be visible on the home page if you enable the corresponding option.</li>\n<li><strong>Display order results</strong>:  The order of similar posts can be based on one of the following.</li>\n<li><em>Default</em>: Similar articles will be listed according to the filtration that has taken place. No other changes will be made.</li>\n<li><em>Date</em>: The ordering is done according to when articles were created. According to what you choose, the oldest or the most recent posts will appear on the list.</li>\n<li><em>Title</em>: Items will be shown in an ascending or descending alphabetical order.</li>\n<li><strong>Show meta box</strong>: The meta box that appeared under a post on the Dashboard will allow you to give central control to the filtration of the articles. Changes made inside a meta box are higher in priority and thus are more powerful.</li>\n<li><strong>Limit post title length</strong>: You can shorten the titles of linked posts by entering a character or word count.</li>\n<li><strong>Show post excerpt</strong>: Lastly, you can show parts of popular posts and decide their length by entering a character or word count.</li>\n</ul>\n<h4>SIMILAR POSTS RELEVANCE</h4>\n<p>The Related Posts plugin for WordPress does all the hard work for you. It filters articles according to some options that you have chosen inside the plugin. The options that are responsible for filtration are on the <strong>Relevance</strong> tab. Let&#8217;s get acquainted with them.</p>\n<p>With the <strong>Order post query</strong> option, there are three ways you can filter your related content: by <em>relevance, randomly</em>, or by date. If chosen by relevance, the most trendy and popular posts will appear as similar articles. In the case of randomly, there&#8217;s no specified way of filtration, and random items will appear on your thumbnail-rich related posts list. Lastly, choose by date so that the system chooses the most recent posts, then proceeds with the older ones.</p>\n<p>The <strong>Only from the same</strong> option helps you decide whether to display related posts with the same type, tag, and/or format as the current article. You can select more than one of the presented ways for the similar articles list. You can also choose to display same category posts.</p>\n<p>With the <strong>Strongness of matching</strong> option, decide the way to filter your articles. The filtration can take place in one of the following ways.<br />\n&#8211; <em>Gradually weakening</em>: The system will consider all the options that are responsible for filtering and do the work. Imagine that you have ticked all the four suboptions of the <strong>Only from the same</strong> option and have defined the count of linked posts as ten. In this case, the system will first take the items that correspond to all those four suboptions. Then, if the number of articles is not enough, the system will ignore the last suboption (post format), then the second to last one (post tag), and continue the same way unless there are ten same category posts.<br />\n&#8211; <em>And</em>: It is a strict condition, and only those items that completely correspond to the chosen ways of filtration will be selected. Again, if you have ticked all the four suboptions of the Only from the same option and have also enabled the <strong>Limit to the same author</strong> option, the system will only take the articles that correspond to what you have chosen. Even if the numbers of found items (for instance, six) and the one that you predefined (ten) don&#8217;t correspond, it won&#8217;t matter: only six similar articles will be displayed.<br />\n&#8211; <em>Or</em>: It is a milder condition compared with the previous ones. It suggests that the system will first take the items corresponding to the options and suboptions you have enabled. But to find the remaining number of articles, it will then consider only one suboption and start to filter articles according to it. Afterwards, the system will pick another suboption for filtration unless there are as many articles as you wish to display.</p>\n<p>The <strong>Limit to the same author</strong> option allows you to show just the same author&#8217;s works as related.</p>\n<p>Lastly, the <strong>Display only posts from the past</strong> option refers to those similar articles that should be displayed. You need to specify the period of time so that filtration can take place within it. For instance, if you enter 12 in the field and choose Days, only the articles that have been created during the last 12 days will be visible.</p>\n<h4>ADVANCED STYLES</h4>\n<p>The Related Posts plugin for WordPress allows you to customize the design of your related content the way you wish to. Pick one of the layouts, a text color, and thumbnail size. The thumbnail usually takes the first image inside the post. Yet, you can upload a default image for the thumbnail yourself. The plugin also enables you to write your own Custom CSS code.</p>\n<h4>RESPONSIVE DESIGN</h4>\n<p>As the WordPress Related Posts plugin supports responsive design, your thumbnail-rich related posts list can be visible on any device &#8211; mobile phones, tablets, and so forth. The layout of related content won&#8217;t suffer, as it&#8217;s adjusted to different screen sizes. As the number of mobile users is on the rise, we have made sure our plugin helps you increase pageviews and traffic.</p>\n<h4>EASY TO USE</h4>\n<p>The <strong>user interface</strong> of the plugin is very easy to navigate through, making it suitable both for beginners and developers. Besides, <strong>tooltips</strong> will come for help while trying to figure out what an option is for.</p>\n<h4>CONTACT US</h4>\n<p>Do you still have queries about the WordPress Related Posts plugin that haven&#8217;t been answered here? Feel free to contact us via the <a href=\"https://wordpress.org/support/plugin/advanced-related-posts/\" rel=\"ugc\">free Support Forum</a>. Our customer care specialist will give comprehensive answers to your questions within a workday.</p>\n<p><strong>Other plugins from Ays Pro Team</strong></p>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/quiz-maker/\" rel=\"ugc\">Quiz Maker</a> for creating advanced quizzes and exams easily and quickly.</li>\n<li><a href=\"https://wordpress.org/plugins/survey-maker/\" rel=\"ugc\">Survey Maker</a> for collecting data and analyze it.  </li>\n<li><a href=\"https://wordpress.org/plugins/poll-maker/\" rel=\"ugc\">Poll Maker</a> for creating powerful and interactive polls. </li>\n<li><a href=\"https://wordpress.org/plugins/ays-popup-box/\" rel=\"ugc\">Popup Box</a>, an easy way to create eye-catching and engaging popups. </li>\n<li><a href=\"https://wordpress.org/plugins/secure-copy-content-protection/\" rel=\"ugc\">Secure Copy Content Protection</a> to protect web content from being plagiarized.</li>\n<li><a href=\"https://wordpress.org/plugins/chart-builder/\" rel=\"ugc\">Chartify</a> to build both static and dynamic charts, graphs and diagrams. </li>\n<li><a href=\"https://wordpress.org/plugins/easy-form/\" rel=\"ugc\">Easy Form</a> to create various forms for your website. </li>\n<li><a href=\"https://wordpress.org/plugins/ays-chatgpt-assistant/\" rel=\"ugc\">AI ChatBot</a> to generate high-quality content for your blog, and finding the answer to any questions in seconds.</li>\n<li><a href=\"https://wordpress.org/plugins/personal-dictionary/\" rel=\"ugc\">Personal Dictionary</a> to create and organize their vocabulary lists, study and memorize the words.</li>\n<li><a href=\"https://wordpress.org/plugins/faq-builder-ays/\" rel=\"ugc\">FAQ Builder</a> to display Frequently Asked Questions on your website with a beautiful accordion. </li>\n<li><a href=\"https://wordpress.org/plugins/ays-slider/\" rel=\"ugc\">Image Slider</a> give the aility to grab your audience&#8217;s attention with amazing and entertaining slideshows.</li>\n<li><a href=\"https://wordpress.org/plugins/ays-random-posts-and-pages/\" rel=\"ugc\">Random Posts and Pages Widget</a> for creating internal links and encouraging visitor engagement on your website.</li>\n<li><a href=\"https://wordpress.org/plugins/ays-facebook-popup-likebox/\" rel=\"ugc\">Popup Like box</a> to promote your Facebook page and add number of Likes.</li>\n<li><a href=\"https://wordpress.org/plugins/gallery-photo-gallery/\" rel=\"ugc\">Photo Gallery</a> for displaying responsive image gallery with awesome layout options.</li>\n<li><a href=\"https://wordpress.org/plugins/portfolio-responsive-gallery/\" rel=\"ugc\">Portfolio Responsive Gallery</a> to showcase beautiful image galleries on your WordPress websites.</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.4.8.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/advanced-related-posts/assets/screenshot-1.jpg?rev=2525741",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/advanced-related-posts/assets/screenshot-2.jpg?rev=2525741",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/advanced-related-posts/assets/screenshot-3.jpg?rev=2525741",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/advanced-related-posts/assets/screenshot-4.jpg?rev=2525741",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/advanced-related-posts/assets/screenshot-5.jpg?rev=2525741",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/advanced-related-posts/assets/screenshot-6.jpg?rev=2525741",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/advanced-related-posts/assets/screenshot-7.jpg?rev=2525741",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/advanced-related-posts/assets/screenshot-8.jpg?rev=2525741",
            "caption": ""
        }
    ],
    "tags": {
        "popular-posts": "popular posts",
        "posts": "posts",
        "related": "related",
        "related-posts": "related posts",
        "similar-posts": "similar posts"
    },
    "stable_tag": "1.4.8",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.0.6.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.0.7.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.0.8.zip",
        "1.0.9": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.0.9.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.1.8.zip",
        "1.1.9": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.1.9.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.2.6.zip",
        "1.2.7": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.2.7.zip",
        "1.2.8": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.2.8.zip",
        "1.2.9": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.2.9.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.3.8.zip",
        "1.3.9": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.3.9.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.4.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.4.5.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.4.6.zip",
        "1.4.7": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.4.7.zip",
        "1.4.8": "https://downloads.wordpress.org/plugin/advanced-related-posts.1.4.8.zip",
        "trunk": "https://downloads.wordpress.org/plugin/advanced-related-posts.zip"
    },
    "business_model": "commercial",
    "repository_url": "",
    "commercial_support_url": "https://ays-pro.com/wordpress/advanced-related-posts",
    "donate_link": "https://ays-pro.com",
    "banners": {
        "low": "https://ps.w.org/advanced-related-posts/assets/banner-772x250.png?rev=3018831",
        "high": "https://ps.w.org/advanced-related-posts/assets/banner-1544x500.png?rev=3018831"
    },
    "icons": {
        "1x": "https://ps.w.org/advanced-related-posts/assets/icon-128x128.png?rev=2521870",
        "2x": "https://ps.w.org/advanced-related-posts/assets/icon-256x256.png?rev=2521870"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 60,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}