{
    "name": "Advanced Custom Fields: Font Awesome Field",
    "slug": "advanced-custom-fields-font-awesome",
    "version": "4.1.1",
    "author": "<a href=\"http://mattkeys.me/\">Matt Keys</a>",
    "author_profile": "https://profiles.wordpress.org/mattkeys/",
    "contributors": {
        "mattkeys": {
            "profile": "https://profiles.wordpress.org/mattkeys/",
            "avatar": "https://secure.gravatar.com/avatar/0341d02803f0f4a86e6a07b626ea1e76?s=96&d=monsterid&r=g",
            "display_name": "Matt Keys"
        }
    },
    "requires": "3.5",
    "tested": "6.5.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 33,
        "4": 1,
        "3": 1,
        "2": 0,
        "1": 0
    },
    "num_ratings": 35,
    "support_url": "https://wordpress.org/support/plugin/advanced-custom-fields-font-awesome/",
    "support_threads": 7,
    "support_threads_resolved": 6,
    "active_installs": 100000,
    "downloaded": 1312969,
    "last_updated": "2024-08-01 6:49pm GMT",
    "added": "2014-02-18",
    "homepage": "https://wordpress.org/plugins/advanced-custom-fields-font-awesome/",
    "sections": {
        "description": "<p>Add a <a href=\"http://fontawesome.io/\" rel=\"nofollow ugc\">Font Awesome</a> icon field type to Advanced Custom Fields.</p>\n<ul>\n<li>Specify which FontAwesome icon sets to use (Solid, Regular, Light, Thin, Duotone, Duotone Sharp, Brands, and Custom Upload Icons) (Some features only available with FontAwesome 5.x or 6.x icons)</li>\n<li>Create your own custom filtered list of FontAwesome icons to use with your fields. Use different custom icon sets with different fields</li>\n<li>Returns Icon Element, Icon Class, Icon Unicode, or an Object including the element, class, unicode value, and SVG data (if applicable)</li>\n<li>Optionally enqueues Font Awesome in footer where needed (when a FontAwesome field is being used on the page))</li>\n<li>Integrates with the <a href=\"https://fontawesome.com/v6.0/docs/apis/graphql/get-started\" rel=\"nofollow ugc\">FontAwesome GraphQL</a> for loading your <a href=\"https://fontawesome.com/v6.0/docs/web/setup/use-kit\" rel=\"nofollow ugc\">FontAwesome Kits</a>, searching for icons, and loading the latest version of FontAwesome</li>\n</ul>\n<p>Note: It is recommended to let this plugin enqueue the latest version of Font Awesome on your front-end; or include the latest version yourself using your <a href=\"https://fontawesome.com/v6.0/docs/web/setup/use-kit\" rel=\"nofollow ugc\">FontAwesome Kit</a>; so that available icons in the admin area will be displayed properly on your sites front-end.</p>\n<h4>Compatibility</h4>\n<p>This ACF field type is compatible with:<br />\n* ACF 5.7+<br />\n* FontAwesome 4.x and 5.x and 6.x fonts</p>\n<h3>Optional Configuration</h3>\n<h3>Filters</h3>\n<ul>\n<li><strong>ACFFA_always_enqueue_fa</strong>: Return true to always enqueue FontAwesome on the frontend, even if no ACF FontAwesome fields are in use on the page. This will enqueue FontAwesome in the header instead of the footer.</li>\n<li><strong>ACFFA_admin_enqueue_fa</strong>: Return false to stop enqueueing FontAwesome in the admin area. Useful if you already have FontAwesome enqueued by some other means.</li>\n<li><strong>ACFFA_get_icons</strong>: (Applies to FontAwesome 4.x and 5.x icons only) Filter the array of icons and icon details loaded from the database</li>\n<li><strong>ACFFA_get_fa_url</strong>: Filter the URL used for enqueuing FontAwesome in the frontend and admin areas of the site.</li>\n<li><strong>ACFFA_override_major_version</strong>: Filter to manually set the &#8216;major&#8217; version of FontAwesome to load (accepts either 4, 5, or 6). NOTE: This filter must be registered before any calls to ACF get_field() function are made.</li>\n<li><strong>ACFFA_fa_api_key</strong>: Filter to programmatically set the FontAwesome API key.</li>\n<li><strong>ACFFA_fa_kit_token</strong>: Filter to programmatically set the FontAwesome kit token.</li>\n</ul>\n",
        "installation": "<p>Typical Installation:</p>\n<ol>\n<li>Copy the <code>advanced-custom-fields-font-awesome</code> folder into your <code>wp-content/plugins</code> folder</li>\n<li>Activate the Font Awesome plugin via the plugins admin page</li>\n<li>Create a new field via ACF and select the Font Awesome type</li>\n</ol>\n<p>Theme Installation:</p>\n<p>If you are a theme author who wants to bundle this plugin with your theme, starting in version 4.0.1 this plugin has been designed to work from within a theme directory.</p>\n<p>It is still more ideal to use something like <a href=\"http://tgmpluginactivation.com/\" rel=\"nofollow ugc\">TGM Plugin Activation</a> to include required/recommended plugins with your theme. However if you choose to bundle this plugin please follow these instructions:</p>\n<ol>\n<li>Copy the &#8216;advanced-custom-fields-font-awesome&#8217; folder into your theme folder. Preferably into a path like &#8216;includes/advanced-custom-fields-font-awesome&#8217;</li>\n<li>Include the plugin from your theme functions.php. Example: <code>include_once( get_stylesheet_directory() . '/includes/advanced-custom-fields-font-awesome/acf-font-awesome.php' );</code></li>\n</ol>\n<p><strong><em>Plugins included this way are not able to receive regular plugin updates. It is up to theme developer to instead release these plugin updates to their users.</em></strong></p>\n<p>However this plugin does attempt to let the user know if they are on an out of date version of the plugin. Out of date theme installations show an admin notification message at the top of the WordPress admin plugins page. The message is as follows:</p>\n<blockquote>\n<p>There is a new version of Advanced Custom Fields: Font Awesome available. Installed Version: {current_version}, Latest Version: {latest_version}</p>\n<p>It looks like this plugin is bundled with your theme: ({theme_name}) and is not able to receive updates. It is recommended that you contact  your theme author for updates. Alternatively you can install this plugin through the WordPress Plugin Repository to get the latest version.</p>\n</blockquote>\n<p>If the user installs this plugin from the plugin repository, that version of the plugin will override the one installed in their theme directory.</p>\n<p>This notification message is filterable so you can customize it to better represent how you handle plugin updates for your theme users. See example below:</p>\n<pre><code>function my_acffa_update_message( $out_of_date_message, $current_version, $latest_version ) {\n    // Customize the message here\n    return $out_of_date_message;\n}\nadd_filter( 'ACFFA_theme_install_update_message', 'my_acffa_update_message', 10, 3 );\n</code></pre>\n",
        "changelog": "<h4>4.1.1</h4>\n<ul>\n<li>Bugfix icon sets not saving properly when editing FontAwesome icon field</li>\n</ul>\n<h4>4.1.0</h4>\n<ul>\n<li>Added support for Duotone Sharp icons</li>\n</ul>\n<h4>4.0.9</h4>\n<ul>\n<li>Bugfix certain SVG icons that were previously before 4.0.8 update not outputting properly.</li>\n<li>Bugfix certain custom icons that were previously selected before 4.0.8 update not outputting properly.</li>\n<li>Bugfix resolve potential PHP warning in admin post edit screens when downgrading from FontAwesome 6 to 5 icon sets.</li>\n</ul>\n<h4>4.0.8</h4>\n<ul>\n<li>Bugfix php warning when returning some custom icons as an object</li>\n<li>Added support for returning the FontAwesome formatted SVG on custom icons and duotone icons instead of generating it in the plugin. Previously selected icons must be reselected to use this enhanced SVG.</li>\n</ul>\n<h4>4.0.7</h4>\n<ul>\n<li>Added support for FontAwesome &#8220;Sharp&#8221; family icons</li>\n<li>Added support for user uploaded duotone icons in kits</li>\n<li>Updated icon initialization for better compatibility with REST API, and a variety of third party site builder plugins that integrate with ACF fields.</li>\n<li>Added filter (ACFFA_fa_api_key) to allow for the ability to programmatically set the FontAwesome API key.</li>\n<li>Added filter (ACFFA_fa_kit_token) to allow for the ability to programmatically set the FontAwesome kit token.</li>\n<li>Limited role of Select2 &#8216;dropdownCssClass&#8217; and &#8216;containerCssClass&#8217; arguments to avoid conflicts with other plugins using older/non full feature versions of Select2</li>\n</ul>\n<h4>4.0.6</h4>\n<ul>\n<li>Fixed php 8.2 related warning</li>\n</ul>\n<h4>4.0.5</h4>\n<ul>\n<li>Fixed compatibility issue with ACF 6.1+ causing this plugins settings page to break</li>\n<li>Fixed bug with logic for theme &#8216;bundling&#8217; of this plugin that caused issues loading assets in some environments</li>\n</ul>\n<h4>4.0.4</h4>\n<ul>\n<li>Fixed bug where queries to the FontAwesome API were timing out for some users, causing issues with searching for icons in the backend</li>\n</ul>\n<h4>4.0.3</h4>\n<ul>\n<li>Automatically refresh 4.x and 5.x icon caches when saving the settings</li>\n<li>Additional strings for translation</li>\n</ul>\n<h4>4.0.2</h4>\n<ul>\n<li>Fixed bug where FontAwesome 5.x icon data was improperly loading FontAwesome 6.x data</li>\n<li>Removed some dependancies on jsDelivr for FontAwesome 5.x icon data</li>\n</ul>\n<h4>4.0.1</h4>\n<ul>\n<li>Fixed bug where FontAwesome settings page would not properly load CSS/JS assets on internationalized WordPress installations.</li>\n<li>Added support for theme authors to bundle this plugin with a theme ( see install instructions )</li>\n<li>Increased &#8216;fallback&#8217; FontAwesome 6 version number to match the 6.0.0 release</li>\n</ul>\n<h4>4.0.0</h4>\n<ul>\n<li>Added support for FontAwesome 6 icons</li>\n<li>Added support for FontAwesome Kits including Custom Uploaded Icons</li>\n<li>Now utilizes the FontAwesome GraphQL API for quicker searching, fuzzy matching</li>\n<li>Added new compatibility mode to make updating from v4 and v5 icons easier</li>\n</ul>\n<h4>3.1.2</h4>\n<ul>\n<li>Fixed compatibility issue with ACF 5.10+</li>\n<li>Fixed deprecated warnings in PHP 8, thanks to Levi Cole for the pull request</li>\n</ul>\n<h4>3.1.1</h4>\n<ul>\n<li>Fixed bug where Duotone icons were not available to existing users of this plugin due to cached versions of the icons from before this plugin could properly parse the duotone icons.</li>\n</ul>\n<h4>3.1.0</h4>\n<ul>\n<li>Added support for new FontAwesome Duotone icons (FontAwesome Pro subscription required)</li>\n<li>Added support for ACF &#8216;acf/settings/capability&#8217; filter on the settings page</li>\n</ul>\n<h4>3.0.2</h4>\n<ul>\n<li>Fixed bug causing PHP warning of undefined constant</li>\n</ul>\n<h4>3.0.1</h4>\n<ul>\n<li>Fixed bug where the FontAwesome field would not successfully register on sites which force ACF to initialize itself early (usually by calling get_field function in the theme functions.php file)</li>\n</ul>\n<h4>3.0.0</h4>\n<ul>\n<li>NOTE: When upgrading from a previous version of this plugin, the FontAwesome &#8216;major version&#8217; will remain at v4 to stay compatible with existing integrations. <em>HOWEVER</em> if you are upgrading from a very old version of this plugin, it may not be possible to detect the former installation, and you will need to manually configure this plugin to use FontAwesome v4 in the new settings admin area.</li>\n<li>Added support for new FontAwesome 5.x free and pro icon sets</li>\n<li>Added new &#8216;custom icon set&#8217; builder which allows FontAwesome ACF fields to be created with a limited set of icons individually selected from the full list of FontAwesome icons. Example: Create a custom icon set limited to just the social media brand icons</li>\n<li>Added new field options to to limit which of the icon sets ( Brands, Regular, Lite, Solid ) you want to allow in the field (applies to FontAwesome v5 only)</li>\n<li>Adding new FontAwesome Settings admin menu under the ACF primary menu area for global configuration options.</li>\n<li>Page load performance improvements (don&#8217;t load icons in field constructor)</li>\n<li>Removing support for ACF v4 now that v5 is out with a free version</li>\n</ul>\n<h4>2.1.2</h4>\n<ul>\n<li>Fixed bug where ACFFA_get_icons filter was not used in wp-admin area when retrieving icons.</li>\n</ul>\n<h4>2.1.1</h4>\n<ul>\n<li>Fixed bug effecting any users who did not update to 2.1.0 before jsDelivr added FontAwesome 5.x to their CDN, where the 5.x icons would get loaded and break functionality</li>\n</ul>\n<h4>2.1.0</h4>\n<ul>\n<li>Preventing any automatic updates to version 5.x of FontAwesome that could break plugin functionality and result in broken icons on sites currently using 4.x FontAwesome icons.</li>\n</ul>\n<h4>2.0.9</h4>\n<ul>\n<li>Fixed bug effecting null value fields created in 1.x of this plugin would return a string of &#8216;null&#8217; instead of boolean false when used in 2.x versions of this plugin.</li>\n</ul>\n<h4>2.0.8</h4>\n<ul>\n<li>Fixed bug where fields marked to &#8216;allow null&#8217; in acf v5 did not show the (x) to remove the selected option on the field</li>\n</ul>\n<h4>2.0.7</h4>\n<ul>\n<li>Fixed bug with FA fields assigned to menu items + further refactoring of JS for ACF v5</li>\n</ul>\n<h4>2.0.6</h4>\n<ul>\n<li>Refactored JS to simplify codebase and fix bugs where Chosen or Select2 fields would not initialize in a variety of field/sub-field configurations and display options.</li>\n</ul>\n<h4>2.0.5</h4>\n<ul>\n<li>Fixed bug with ACF tabs + FontAwesome fields where Chosen/Select2 would not initialize beyond the first tab shown</li>\n</ul>\n<h4>2.0.4</h4>\n<ul>\n<li>Added filter (ACFFA_always_enqueue_fa) to allow FontAwesome to always be enqueued on your sites frontend, even if no ACF FontAwesome fields are in use on the page.</li>\n</ul>\n<h4>2.0.3</h4>\n<ul>\n<li>Fixed bug where a field set to return &#8216;Icon Object&#8217; would instead return an array</li>\n</ul>\n<h4>2.0.2</h4>\n<ul>\n<li>Fixed bug effecting Select fields when used along with a Font Awesome field in a repeater (ACF v5)</li>\n</ul>\n<h4>2.0.1</h4>\n<ul>\n<li>Fixed bug causing incompatibilities with ACF Clone fields (ACF v5)</li>\n<li>Fixed bug where default icons could not be unselected when creating FontAwesome fields (ACF v5)</li>\n</ul>\n<h4>2.0.0</h4>\n<ul>\n<li>Total rewrite of plugin to simplify codebase and better adhere to WordPress and Advanced Custom Fields coding standards and best practices</li>\n<li>Added option to disable the larger icon preview displayed with the FontAwesome select fields</li>\n</ul>\n<h4>1.7.4</h4>\n<ul>\n<li>Fixed incompatibilities with latest ACF 5 + Select2 v4.x</li>\n</ul>\n<h4>1.7.3</h4>\n<ul>\n<li>Updated Better Font Awesome library to latest version</li>\n<li>Updated &#8216;fallback&#8217; ACF font to 4.6.3</li>\n<li>Bugfix overly broad CSS rules effecting non font awesome field groups</li>\n<li>Bugfix select2 not loading on new fontawesome icons until after saving fields</li>\n</ul>\n<h4>1.7.2</h4>\n<ul>\n<li>Bugfix PHP Notice when trying to access property of &#8216;null&#8217; value</li>\n</ul>\n<h4>1.7.1</h4>\n<ul>\n<li>Updated Better Font Awesome Library for better compatibility with Better Font Awesome plugin</li>\n<li>Changed ACF 4/5 detection method for better integration with Better Font Awesome plugin</li>\n<li>Bugfix wrong preview icon appearing in ACF custom field creator area</li>\n</ul>\n<h4>1.7</h4>\n<ul>\n<li>Added ability to select no icon by default</li>\n<li>Better handling of &#8216;null&#8217; or &#8216;no selection&#8217; items</li>\n<li>Fixed bug where default icon would not display in admin area if &#8216;unicode&#8217; return type was selected </li>\n</ul>\n<h4>1.6.4</h4>\n<ul>\n<li>Misc JS performance improvements</li>\n<li>Fixed bug where select2 would not initialize on repeater items added mid-rows (using the plus icon at the end of a repeater row)</li>\n</ul>\n<h4>1.6.3</h4>\n<ul>\n<li>Fixed asset path errors when including this add-on from a theme instead of the plugins directory</li>\n</ul>\n<h4>1.6.2</h4>\n<ul>\n<li>Rolling back changes from 1.6.1 after a number of bugs were reported. Incompatibility issues with Better Font Awesome have been corrected in that plugins code.</li>\n</ul>\n<h4>1.6.1</h4>\n<ul>\n<li>Addressing incompatibility issues between this plugin and the Better Font Awesome plugin</li>\n</ul>\n<h4>1.6</h4>\n<ul>\n<li>Misc fixes to JS to properly target ACF fields in the DOM (based on changes to the ACF structure). This should resolve issues with duplicate, or missing select2 fields when picking font awesome icons.</li>\n</ul>\n<h4>1.5</h4>\n<ul>\n<li>New Feature: Integrated with the <a href=\"https://github.com/MickeyKay/better-font-awesome-library\" rel=\"nofollow ugc\">Better Font Awesome Library</a> to automatically use the latest version of the Font Awesome icons</li>\n</ul>\n<h4>1.4</h4>\n<ul>\n<li>Updated included FontAwesome to version 4.2</li>\n</ul>\n<h4>1.3</h4>\n<ul>\n<li>Added support for ACF version 5.x</li>\n</ul>\n<h4>1.2</h4>\n<ul>\n<li>Added support for new icons in FontAwesome 4.1</li>\n<li>Updated included FontAwesome to version 4.1</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Fixed overly specific JS selector which was causing font preview icons to not load when used on taxonomy term pages</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Fixed JS error which was breaking conditional field select boxes</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Added support for use in repeater fields</li>\n<li>Added support for use in flexible content fields</li>\n<li>Added live icon preview to field creation screen</li>\n<li>Fixed various bugs with Select2 initialization on dynamically added fields</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Initial Release.</li>\n</ul>\n"
    },
    "short_description": "Adds a new &#039;Font Awesome Icon&#039; field to the popular Advanced Custom Fields plugin.",
    "description": "<p>Add a <a href=\"http://fontawesome.io/\" rel=\"nofollow ugc\">Font Awesome</a> icon field type to Advanced Custom Fields.</p>\n<ul>\n<li>Specify which FontAwesome icon sets to use (Solid, Regular, Light, Thin, Duotone, Duotone Sharp, Brands, and Custom Upload Icons) (Some features only available with FontAwesome 5.x or 6.x icons)</li>\n<li>Create your own custom filtered list of FontAwesome icons to use with your fields. Use different custom icon sets with different fields</li>\n<li>Returns Icon Element, Icon Class, Icon Unicode, or an Object including the element, class, unicode value, and SVG data (if applicable)</li>\n<li>Optionally enqueues Font Awesome in footer where needed (when a FontAwesome field is being used on the page))</li>\n<li>Integrates with the <a href=\"https://fontawesome.com/v6.0/docs/apis/graphql/get-started\" rel=\"nofollow ugc\">FontAwesome GraphQL</a> for loading your <a href=\"https://fontawesome.com/v6.0/docs/web/setup/use-kit\" rel=\"nofollow ugc\">FontAwesome Kits</a>, searching for icons, and loading the latest version of FontAwesome</li>\n</ul>\n<p>Note: It is recommended to let this plugin enqueue the latest version of Font Awesome on your front-end; or include the latest version yourself using your <a href=\"https://fontawesome.com/v6.0/docs/web/setup/use-kit\" rel=\"nofollow ugc\">FontAwesome Kit</a>; so that available icons in the admin area will be displayed properly on your sites front-end.</p>\n<h4>Compatibility</h4>\n<p>This ACF field type is compatible with:<br />\n* ACF 5.7+<br />\n* FontAwesome 4.x and 5.x and 6.x fonts</p>\n<h3>Optional Configuration</h3>\n<h3>Filters</h3>\n<ul>\n<li><strong>ACFFA_always_enqueue_fa</strong>: Return true to always enqueue FontAwesome on the frontend, even if no ACF FontAwesome fields are in use on the page. This will enqueue FontAwesome in the header instead of the footer.</li>\n<li><strong>ACFFA_admin_enqueue_fa</strong>: Return false to stop enqueueing FontAwesome in the admin area. Useful if you already have FontAwesome enqueued by some other means.</li>\n<li><strong>ACFFA_get_icons</strong>: (Applies to FontAwesome 4.x and 5.x icons only) Filter the array of icons and icon details loaded from the database</li>\n<li><strong>ACFFA_get_fa_url</strong>: Filter the URL used for enqueuing FontAwesome in the frontend and admin areas of the site.</li>\n<li><strong>ACFFA_override_major_version</strong>: Filter to manually set the &#8216;major&#8217; version of FontAwesome to load (accepts either 4, 5, or 6). NOTE: This filter must be registered before any calls to ACF get_field() function are made.</li>\n<li><strong>ACFFA_fa_api_key</strong>: Filter to programmatically set the FontAwesome API key.</li>\n<li><strong>ACFFA_fa_kit_token</strong>: Filter to programmatically set the FontAwesome kit token.</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.4.1.1.zip",
    "upgrade_notice": {
        "4.1.1": "<ul>\n<li>Bugfix icon sets not saving properly when editing FontAwesome icon field</li>\n</ul>",
        "4.1.0": "<ul>\n<li>Added support for Duotone Sharp icons</li>\n</ul>",
        "4.0.9": "<ul>\n<li>Bugfix certain SVG icons that were previously before 4.0.8 update not outputting properly.</li>\n<li>Bugfix certain custom icons that were previously selected before 4.0.7 update not outputting properly.</li>\n<li>Bugfix resolve potential PHP warning in admin post edit screens when downgrading from FontAwesome 6 to 5 icon sets.</li>\n</ul>",
        "4.0.8": "<ul>\n<li>Bugfix php warning when returning some custom icons as an object</li>\n<li>Added support for returning the FontAwesome formatted SVG on custom icons and duotone icons instead of generating it in the plugin. Previously selected icons must be reselected to use this enhanced SVG.</li>\n</ul>",
        "4.0.7": "<ul>\n<li>Added support for FontAwesome &quot;Sharp&quot; family icons</li>\n<li>Added support for user uploaded duotone icons in kits</li>\n<li>Updated icon initialization for better compatibility with REST API, and a variety of third party site builder plugins that integrate with ACF fields.</li>\n<li>Added filter (ACFFA_fa_api_key) to allow for the ability to programmatically set the FontAwesome API key.</li>\n<li>Added filter (ACFFA_fa_kit_token) to allow for the ability to programmatically set the FontAwesome kit token.</li>\n<li>Limited role of Select2 &#039;dropdownCssClass&#039; and &#039;containerCssClass&#039; arguments to avoid conflicts with other plugins using older/non full feature versions of Select2</li>\n</ul>",
        "4.0.6": "<ul>\n<li>Fixed php 8.2 related warning</li>\n</ul>",
        "4.0.5": "<ul>\n<li>Fixed compatibility issue with ACF 6.1+ causing this plugins settings page to break</li>\n<li>Fixed bug with logic for theme &#039;bundling&#039; of this plugin that caused issues loading assets in some environments</li>\n</ul>",
        "4.0.4": "<ul>\n<li>Fixed bug where queries to the FontAwesome API were timing out for some users, causing issues with searching for icons in the backend</li>\n</ul>",
        "4.0.3": "<ul>\n<li>Automatically refresh 4.x and 5.x icon caches when saving the settings</li>\n<li>Additional strings for translation</li>\n</ul>",
        "4.0.2": "<ul>\n<li>Fixed bug where FontAwesome 5.x icon data was improperly loading FontAwesome 6.x data</li>\n<li>Removed some dependancies on jsDelivr for FontAwesome 5.x icon data</li>\n</ul>",
        "4.0.1": "<ul>\n<li>Fixed bug where FontAwesome settings page would not properly load CSS/JS assets on internationalized WordPress installations.</li>\n<li>Added support for theme authors to bundle this plugin with a theme ( see install instructions )</li>\n<li>Increased &#039;fallback&#039; FontAwesome 6 version number to match the 6.0.0 release</li>\n</ul>",
        "4.0.0": "<ul>\n<li>Added support for FontAwesome 6 icons</li>\n<li>Added support for FontAwesome Kits including Custom Uploaded Icons</li>\n<li>Now utilizes the FontAwesome GraphQL API for quicker searching, fuzzy matching</li>\n<li>Added new compatibility mode to make updating from v4 and v5 icons easier</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/advanced-custom-fields-font-awesome/assets/screenshot-1.png?rev=859936",
            "caption": "Set a default icon, and choose how you want icon data to be returned."
        },
        {
            "src": "https://ps.w.org/advanced-custom-fields-font-awesome/assets/screenshot-2.png?rev=859936",
            "caption": "Searchable list of all icons, including large live preview"
        },
        {
            "src": "https://ps.w.org/advanced-custom-fields-font-awesome/assets/screenshot-3.png?rev=2002542",
            "caption": ""
        }
    ],
    "tags": {
        "acf": "acf",
        "advanced-custom-fields": "advanced custom fields",
        "font-awesome": "Font Awesome",
        "fontawesome": "FontAwesome"
    },
    "stable_tag": "4.1.1",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.0.0.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.1.2.zip",
        "1.2": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.2.zip",
        "1.3": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.3.zip",
        "1.4": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.4.zip",
        "1.5": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.5.zip",
        "1.6": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.6.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.6.3.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.6.4.zip",
        "1.7": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.7.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.7.2.zip",
        "1.7.3": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.7.3.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.1.7.4.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.2.0.5.zip",
        "2.0.6": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.2.0.6.zip",
        "2.0.7": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.2.0.7.zip",
        "2.0.8": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.2.0.8.zip",
        "2.0.9": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.2.0.9.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.2.1.2.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.3.0.0.zip",
        "3.0.0-beta1": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.3.0.0-beta1.zip",
        "3.0.0-beta2": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.3.0.0-beta2.zip",
        "3.0.0-beta3": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.3.0.0-beta3.zip",
        "3.0.0-rc1": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.3.0.0-rc1.zip",
        "3.0.0-rc2": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.3.0.0-rc2.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.3.1.2.zip",
        "4.0.0": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.4.0.0.zip",
        "4.0.1": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.4.0.1.zip",
        "4.0.3": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.4.0.3.zip",
        "4.0.4": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.4.0.4.zip",
        "4.0.5": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.4.0.5.zip",
        "4.0.6": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.4.0.6.zip",
        "4.0.7": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.4.0.7.zip",
        "4.0.8": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.4.0.8.zip",
        "4.0.9": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.4.0.9.zip",
        "4.1.0": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.4.1.0.zip",
        "4.1.1": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.4.1.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/advanced-custom-fields-font-awesome.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/advanced-custom-fields-font-awesome/assets/banner-772x250.jpg?rev=859936",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/advanced-custom-fields-font-awesome/assets/icon-128x128.jpg?rev=1016227",
        "2x": "https://ps.w.org/advanced-custom-fields-font-awesome/assets/icon-256x256.jpg?rev=1016227"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}