{
    "name": "Advanced WordPress Reset &#8211; Debug, Recover &amp; Reset WP",
    "slug": "advanced-wp-reset",
    "version": "2.0.6",
    "author": "<a href=\"https://sigmaplugin.com/\">SigmaPlugin</a>",
    "author_profile": "https://profiles.wordpress.org/symptote/",
    "contributors": {
        "symptote": {
            "profile": "https://profiles.wordpress.org/symptote/",
            "avatar": "https://secure.gravatar.com/avatar/649a8aa00b2944f4d34daba9af31df95?s=96&d=monsterid&r=g",
            "display_name": "Younes JFR."
        },
        "owleads": {
            "profile": "https://profiles.wordpress.org/owleads/",
            "avatar": "https://secure.gravatar.com/avatar/85ebd5696ce0ac4fc4f7dfa89d239163?s=96&d=monsterid&r=g",
            "display_name": "owleads"
        }
    },
    "requires": "4.0",
    "tested": "6.6.1",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 1172,
        "4": 5,
        "3": 1,
        "2": 2,
        "1": 22
    },
    "num_ratings": 1202,
    "support_url": "https://wordpress.org/support/plugin/advanced-wp-reset/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 30000,
    "downloaded": 1194439,
    "last_updated": "2024-07-20 12:17:00",
    "added": "2016-03-20",
    "homepage": "https://sigmaplugin.com/",
    "sections": {
        "description": "<p><a href=\"https://awpreset.com?utm_source=wordpress_org&amp;utm_medium=link&amp;utm_campaign=ongoing&amp;utm_content=awr_homepage\" rel=\"nofollow ugc\">Advanced WordPress Reset</a> is the ultimate WordPress productivity and troubleshooting plugin for developers and enthusiasts.</p>\n<p>With this plugin, you can Reset, Debug, Recover, and Automate your WordPress like never before, all in one place!</p>\n<p>Whether you&#8217;re a seasoned developer or an ambitious beginner, our plugin will make your life easier and your workdays more productive.</p>\n<p>📢 For users looking primarily to clean up their database and delete orphaned items, we recommend using the <a href=\"https://wordpress.org/plugins/advanced-database-cleaner\" rel=\"ugc\">Advanced Database Cleaner</a> plugin.</p>\n<h3>Truly Advanced WordPress Reset</h3>\n<p>Whether you&#8217;re seeking simplicity or in-depth customization, this plugin offers you 3 powerful core Reset options that cater to most WordPress Reset needs:</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/IUDCZHBKRy4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>Site Reset</h4>\n<p>This is the most commonly used website Reset option as it preserves your data and focuses the Reset on the database and its content.</p>\n<p>Elements that are removed are:</p>\n<ul>\n<li>Pages, Posts and Comments</li>\n<li>Custom tables</li>\n<li>Users (except the current admin user)</li>\n<li>After the Reset, the following will remain untouched:</li>\n</ul>\n<p>Elements that are kept are:</p>\n<ul>\n<li>The current admin user</li>\n<li>Files, Uploads, Themes, Child themes, Plugins, etc.</li>\n<li>Basic WP settings like Site title, WP address, Site address, Time zone &amp; Language</li>\n<li>Non-WordPress Database Tables</li>\n</ul>\n<p>Site Reset is the ideal way to start over fresh without having to re-upload all your images &amp; videos, reconfigure user access, reinstall themes and plugins…</p>\n<h4>Nuclear Reset (Pro feature)</h4>\n<p>Choose this option for a total reboot. This in-depth reset removes almost everything, from files to custom settings and database tables. It&#8217;s the closest you’ll get to a fresh WordPress install without the hassle.</p>\n<p>The only things that are kept after a Nuclear Reset are:</p>\n<ul>\n<li>The current user for you to log in</li>\n<li>This plugin’s files and data</li>\n<li>Non-WordPress Database Tables</li>\n</ul>\n<h4>Custom Reset (Pro feature)</h4>\n<p>If none of the above “out of the box” options fits your needs, try the Custom Reset option for even more control and flexibility. Set exactly what you want to reset and what you want to keep untouched:</p>\n<ul>\n<li>Choose which themes to activate, deactivate, or delete after the Reset</li>\n<li>Choose which plugins to activate, deactivate, or delete after the Reset</li>\n<li>Decide which users to keep after the Reset</li>\n<li>Customize your blog info after the reset</li>\n<li>You can also choose to keep things are they are for each element</li>\n</ul>\n<p>Once you’re happy with your choices, you can save your preferences in a Custom reset for easy later use. Repeat this process as needed, and you’ll end up with your very own library of tailored Resets!</p>\n<p>As you can see, the Custom Reset feature provides you with full control over your Reset process.</p>\n<p>In addition to the 3 core options above, we also have numerous individual reset tools that can be used to conduct laser-targeted partial resets of specific parts of your WordPress site.</p>\n<p>For instance, you could choose to exclusively reset your menus and widgets while leaving the rest untouched.</p>\n<h3>Tools &amp; Collections for Partial Resets and Beyond</h3>\n<p>The Tools section is an extension of the 3 main Reset options above that enables you to perform laser-targeted and custom partial Resets.</p>\n<p>With an extensive library of Tools, you can have the most precise and granular control over what you want to reset using specific tools:</p>\n<ul>\n<li>Reset the ‘uploads’ folder (/wp-content/uploads) by deleting all its content. This includes images, videos, music, documents, subfolders, etc.</li>\n<li>Reset Themes by deleting all themes (the plugin uses WordPress core functions to delete themes). You can keep the currently active theme or delete it as well</li>\n<li>Delete all plugins (the plugin will deactivate them first then uninstall them using WordPress core functions)</li>\n<li>Reset “wp-content” folder. All files and folders inside ‘/wp-content’ directory will be deleted and reset, except ‘index.php’ and the following folders: ‘plugins’, ‘themes’, ‘uploads’, and ‘mu-plugins’</li>\n<li>Delete Must-use plugins. All MU plugins in ‘/wp-content/mu-plugins’ will be deleted. These are plugins that cannot be disabled except by removing their files from the must-use directory</li>\n<li>Delete “.htaccess” file. This is a critical WordPress core file used to enable or disable features of websites hosted on Apache. In some cases, you may need to delete it to do some tests</li>\n<li>Delete all comments. All types of comments including published, pending, spam, trashed… will be deleted. Comments meta will also be deleted</li>\n<li>Delete pingbacks. Pingbacks allow you to notify other website owners that you have linked to their article on your website</li>\n<li>Delete trackbacks. Although there are some minor technical differences, a trackback is the same thing as a pingback</li>\n<li>…</li>\n</ul>\n<p>The above Tools can also be used to clean up and optimize a WordPress site in order to save disk space, improve performance, or simply reduce security risks by getting rid of unsafe plugins, themes, and files. the possibilities are endless and the only limit is your creativity!</p>\n<p>To enable such advanced creative use cases, the Pro version of Advanced WordPress Reset lets you build <strong>Collections</strong> of tools where you can pick and choose the tools you want to include in a collection. Once a collection is built and saved, you will be able to run all the tools it contains with a single click of the mouse saving you valuable time and hassle.</p>\n<p>To take things even further and empower our power users, the Pro version of the plugin has powerful automation and scheduling features that let you choose the time and frequency at which a collection is executed automatically by the system without the need for you to log in and run it manually.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/aVJrKj9plpQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Whether it is a custom Partial Reset Collection, Cleanup Collection, or Optimization Collection… you’ll be able to automate and schedule its execution with unparalleled ease and control.</p>\n<p>When used together, Collections and Scheduling become powerful tools to improve productivity and save time on repetitive yet essential tasks like maintenance or recurring environment resets. We’ve listed a few real-world use cases below for your reference.</p>\n<h3>Snapshots and Restoration to the Rescue</h3>\n<p>Because Resets perform critical actions on your database and contents with potentially catastrophic consequences on your site, it was imperative to include additional safety mechanisms you could resort to if need be.</p>\n<p>Snapshots are a simple yet powerful way of taking full copies of your database to provide you with an invaluable safety net in case things go south. Simply restore your snapshot and you should be good to go.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/G3E9LbLa3QI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>In other words, Snapshots create an undo button for Resets as far as database data is concerned. That’s why we highly recommend that you systematically take a snapshot of your site’s database before any Reset.</p>\n<p>In fact, it’s always a good idea to take multiple snapshots at different points in time so you can have more than one option if you need to revert to a previous state of your site.</p>\n<p>Since snapshots are similar in a way to backups, they can also be used to restore a hacked or damaged database. However, please understand that Snapshots DO NOT replace backups as they don’t save a copy of your files. We thus recommend you use one of the numerous backup tools available.</p>\n<p>Even though taking a snapshot is free, quick and easy, our users are sometimes too busy or simply forget to do so. That’s why the plugin comes with a powerful scheduling Pro feature that automates the whole process for you. Just choose the options that best suit your needs and the system will take care of the rest for you.</p>\n<h3>WP Switcher for in-depth compatibility Testing (Pro feature)</h3>\n<p>Plugin and Theme developers rely on our plugin to speed up their tests and troubleshoot their creations. However, such tests are only as good as the version they are run on.</p>\n<p>With WP Switcher, a unique feature in Advanced WordPress Reset, we make switching from one WordPress version to another a breeze! Now, you can truly ensure the compatibility of your plugin or theme across different WordPress versions by proactively detecting and addressing any version-specific issues.</p>\n<p>WP Switcher offers a convenient one-click feature for changing versions, making it effortless to upgrade or downgrade your existing WordPress version.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/UjE6kDUJj5E?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>By utilizing the power of WP Switcher, you can expedite your testing workflow, making sure your projects operate flawlessly across all relevant WordPress versions.</p>\n<h3>Advanced WordPress Reset in Real-world Scenarios</h3>\n<p>Advanced WordPress Reset is designed to cater to a wide range of users and scenarios. From beginners using it to start over fresh to experienced developers getting creative in utilizing the plugin to automate maintenance or streamline new product testing. Let’s take a look at examples of both standard and advanced scenarios:</p>\n<p><strong>Efficient Site Maintenance &amp; Optimization:</strong> So you have a client and your contract is to maintain a perfectly working and optimized site for them. You could do this manually every now and then or turn on the autopilot thanks to the automation features included in the plugin. Start by composing the Collection of tools you want to run and decide on the frequency at which the system will execute them. That’s all, You have now saved yourself or your team countless hours going into the backend to remove or reset specific parts of the site on a weekly or monthly basis and you can even increase the frequency to daily execution if it’s a high traffic/content website.</p>\n<p><strong>Exploratory Theme and Layout Testing:</strong> Some clients have a hard time with PSD or PNG designs and need to see a minimal live version of their future website before they can make a choice. Using Advanced WordPress Reset, you can venture into creative explorations of themes and layouts without the fear of leaving traces behind or having to do things over countless times. Test different designs with confidence, knowing that your site can be reset to its default state swiftly without losing all the data you uploaded or the menus you’ve created.</p>\n<p><strong>Streamlined Debugging and Troubleshooting:</strong> So your site isn&#8217;t functioning as expected, and you&#8217;re left grappling with the frustration of not knowing where things went wrong. In collaborative environments, such as when multiple individuals contribute to the site, the source of the issue is never clear and it might even be a faulty plugin update, Who knows? Instead of banging your head against the wall or resorting to a complete reset that demands starting over from scratch, our solution allows you to reset specific site components that appear suspicious or have fallen into disuse. This targeted approach saves you the exasperation and significant time that would otherwise be spent in a complete redo, enabling you to swiftly identify the cause of the problem and get back on track.</p>\n<p><strong>Quick Theme and Plugin Testing:</strong> Simplify and speed up plugin and theme testing by resetting your site to its initial state as many times as you need. Test plugins and themes comprehensively, ensuring accurate results and smooth compatibility.</p>\n<p><strong>Hacked site Recovery:</strong> Picture this: It&#8217;s 6 a.m., and you are woken up by a frantic client reporting a site outage or worse, a ransom message on their homepage. With a sense of urgency, you navigate to the backend to locate the latest snapshot and swiftly restore it with a few clicks. Just like that, the site is back to normal, and you dial the client with reassuring news. As a developer or webmaster, you are well aware that attacks and technical glitches are much more frequent than we think, that’s why you had enabled the auto snapshot feature of advanced WordPress reset and scheduled it for run daily. While snapshots are not as comprehensive as backups, they are more reliable, faster to create, and take up less disk space making them a great alternative to backups.</p>\n<p><strong>Performance Benchmarking &amp; Troubleshooting:</strong> Your site is slow and you’re unsure if it’s the server, your site configuration, the theme, some plugins, PHP… By measuring the site speed in different states, the picture will become much clearer. Using Site Resets, Custom Resets, and Nuclear Resets, you can go as far as you need to until your performance issues disappear. This will help you quickly identify the root cause of the performance slump. Once the root cause is known, you can undo your actions and focus your efforts on fixing the exact problem causing the performance degradation. In this scenario, the smart combination of Resets and Snapshot restoration makes for a perfect toolset for performance benchmarking and troubleshooting.</p>\n<p><strong>WordPress Update Rollback:</strong> Like most WordPress users, it’s hard to resist that update WordPress button. However, it’s not uncommon for an update to break something in your site. Unfortunately, once that happens, your choices are limited as there is no cancel update button! You can either spend hours trying to identify the cause and fix it or restore a full backup of the site if you have one. With WP Switcher, you now have one more option, downgrading your WordPress version until you find a working version.</p>\n<p><strong>Client Site Recovery:</strong> It’s not uncommon for clients to mess things up and blame you for it. Whether your client&#8217;s site faces unexpected issues or requires a do-over, this plugin simplifies the recovery process. Quickly restore their site to its default state or rebuild it entirely, fostering efficient communication and client satisfaction.</p>\n<p><strong>Demo Site Automatic Reset:</strong> Imagine you have a demo site for people to test drive your plugin or theme. After a few hours or days, you’ll certainly end up with a few pages, posts, and customizations made by users who are trying to get a feel for your tools. Instead of reinstalling the whole system again every now and then or running through everything to clean up the mess, you can simply create automatic partial resets and cleanups using Collection automation and scheduling. In addition to saving you time, you’ll also be able to increase frequency to improve user experience. tracking what they do, you can just schedule a collection to clean everything up and reset the whole demo site as it should be every 2 hours for example.</p>\n<h3>Do more with Advanced WordPress Reset PRO</h3>\n<p>While the free version has all you need to simply and quickly Reset your website, the Pro version is 10 times more powerful with professional-focussed features designed to turbocharge your WordPress development:</p>\n<ul>\n<li>Nuclear Resets</li>\n<li>Custom Resets.</li>\n<li>37 Partial Reset Tools instead of 14</li>\n<li>Collections</li>\n<li>Automation &amp; Scheduling</li>\n<li>WP Switcher</li>\n<li>Priority access to new features</li>\n</ul>\n<h3>Get the #1 Top-Rated WP Reset Plugin</h3>\n<p>Whether you opt for the Free or Pro version, you can’t go wrong with Advanced WordPress Reset. The numbers speak for themselves:</p>\n<ul>\n<li>1 Million+ Downloads: A testament to our reliability and usefulness.</li>\n<li>Near Perfect Rating: Our 4.9 rating speaks to the quality and user satisfaction.</li>\n<li>1,183 ratings: A massive vote of confidence only top plugins can boast</li>\n</ul>\n<p>Download Advanced WordPress Reset today and see for yourself.</p>\n",
        "installation": "<p>This section describes how to install the plugin and get it working.</p>\n<h4>Single site installation</h4>\n<ul>\n<li>After extraction, upload the Plugin to your <code>/wp-content/plugins/</code> directory</li>\n<li>Go to &#8220;Dashboard&#8221; &raquo; &#8220;Plugins&#8221; and choose &#8216;Activate&#8217;</li>\n<li>The plugin page can be accessed via &#8220;Dashboard&#8221; &raquo; &#8220;Tools&#8221; &raquo; &#8220;Advanced WP reset&#8221;</li>\n</ul>\n",
        "faq": "\n<dt id='q1%3A%20is%20advanced%20wordpress%20reset%20suitable%20for%20beginners%3F'>\nQ1: Is Advanced WordPress Reset suitable for beginners?\n</h4>\n<p>\n<p>Yes, our plugin is designed to cater to both beginners and experienced users. It offers an intuitive solution for efficient site management, making it suitable for those new to WordPress as well as experienced developers. However, since this plugin interacts with critical aspects of WordPress that have the potential to cause lasting damage to your site and consume valuable work hours, we&#8217;ve implemented a series of failsafe measures within the plugin. These measures are designed to protect against unintentional human errors and unfortunate mishaps.</p>\n</p>\n<dt id='q2%3A%20will%20i%20lose%20my%20files%20and%20settings%20during%20a%20reset%3F'>\nQ2: Will I lose my files and settings during a reset?\n</h4>\n<p>\n<p>The outcome depends on the Reset option you choose. With a site reset, your files and settings remain intact. However, this is not the case with Nuclear Reset, where a more comprehensive reset occurs, affecting files and settings.</p>\n</p>\n<dt id='q3%3A%20how%20does%20the%20plugin%20help%20in%20recovery%20scenarios%3F'>\nQ3: How does the plugin help in recovery scenarios?\n</h4>\n<p>\n<p>The plugin&#8217;s primary function is to reset your site to its default state. This becomes a powerful tool for recovery purposes, especially in cases of hacks, corruption, or conflicts caused by plugins. By reverting to a clean slate, you can efficiently troubleshoot and resolve these issues.</p>\n</p>\n<dt id='q4%3A%20can%20i%20use%20this%20plugin%20for%20theme%20development%3F'>\nQ4: Can I use this plugin for theme development?\n</h4>\n<p>\n<p>Absolutely! Advanced WordPress Reset is an excellent asset for theme development. It allows you to revert your site to default settings, providing a fresh environment to work on themes without the need for a complete reinstallation. It also offers you a handy way of switching between versions so you can test drive your theme in different situations and uncover potential bugs and incompatibility issues.</p>\n</p>\n<dt id='q5%3A%20is%20this%20plugin%20a%20substitute%20for%20backup%20solutions%3F'>\nQ5: Is this plugin a substitute for backup solutions?\n</h4>\n<p>\n<p>While Advanced WordPress Reset is not intended as a primary backup solution, it offers efficient snapshots that can be helpful in quick site recovery in specific scenarios. However, it&#8217;s essential to understand that dedicated backup solutions are highly recommended to ensure comprehensive data protection and complement our snapshot feature.</p>\n</p>\n<dt id='q6%3A%20how%20frequently%20can%20i%20use%20the%20plugin%20for%20resets%3F'>\nQ6: How frequently can I use the plugin for resets?\n</h4>\n<p>\n<p>You can use the plugin as needed, and it&#8217;s particularly useful during the testing and development phases. However, exercise caution, especially when performing resets on live sites. Frequent resets are common in testing environments, allowing developers to iterate and improve their projects.</p>\n</p>\n<dt id='q7%3A%20can%20i%20reverse%20or%20undo%20a%20reset%3F'>\nQ7: Can I reverse or undo a reset?\n</h4>\n<p>\n<p>No, but you can achieve the same result using Snapshot restoration. By utilizing Snapshots or restoring from backups, you can effectively undo a reset and bring your site back to a previous state. That’s why we highly recommend taking a snapshot before any risky reset.</p>\n</p>\n<dt id='q8%3A%20will%20plugins%20and%20themes%20be%20deleted%3F'>\nQ8: Will plugins and themes be deleted?\n</h4>\n<p>\n<p>During a standard site reset, plugins and themes are preserved. However, in the case of a nuclear reset, they do not survive the reset process. This distinction ensures you have control over which elements you want to retain and which ones you&#8217;re comfortable letting go.</p>\n</p>\n<dt id='q9%3A%20how%20do%20snapshots%20help%20with%20troubleshooting%3F'>\nQ9: How do Snapshots help with troubleshooting?\n</h4>\n<p>\n<p>Snapshots provide a critical safety net for troubleshooting. By taking Snapshots at different stages of your site&#8217;s development, you can quickly revert to a previous state if issues arise. This enables you to compare changes, identify problematic areas, and efficiently resolve problems.</p>\n</p>\n<dt id='q10%3A%20is%20the%20pro%20version%20suitable%20for%20non-developers%3F'>\nQ10: Is the Pro version suitable for non-developers?\n</h4>\n<p>\n<p>Absolutely! The Pro version of Advanced WordPress Reset offers a wide range of advanced features that can benefit all users, regardless of their technical expertise. Whether you&#8217;re a developer seeking enhanced capabilities or a non-developer looking for efficient site management tools, the Pro version caters to your needs.</p>\n</p>\n<dt id='q11%3A%20does%20the%20free%20version%20include%20wp%20switcher%3F'>\nQ11: Does the free version include WP Switcher?\n</h4>\n<p>\n<p>No, WP Switcher is an exclusive feature available only in the Pro version of Advanced WordPress Reset. WP Switcher allows you to upgrade or downgrade your WordPress version with a single click, offering flexibility in testing your site&#8217;s compatibility.</p>\n</p>\n<dt id='q12%3A%20is%20wordpress%20multisite%20supported%3F'>\nQ12: Is WordPress multisite supported?\n</h4>\n<p>\n<p>Currently, Advanced WordPress Reset does not support WordPress multisite installations. The plugin is optimized for single-site setups and may not be suitable for use in multisite networks.</p>\n</p>\n<dt id='q13%3A%20do%20you%20support%20wp-cli%3F'>\nQ13: Do you support WP-CLI?\n</h4>\n<p>\n<p>At this time, support for WP-CLI (WordPress Command Line Interface) is not available within Advanced WordPress Reset. The plugin is primarily designed for user-friendly interaction through the WordPress dashboard.</p>\n</p>\n<dt id='q14%3A%20do%20you%20offer%20support%20in%20case%20of%20bugs%20or%20issues%3F'>\nQ14: Do you offer support in case of bugs or issues?\n</h4>\n<p>\n<p>Absolutely! We provide comprehensive support to assist you in resolving any bugs or issues you may encounter while using Advanced WordPress Reset. In addition to our support team, the plugin includes easy-to-follow video tutorials to help you quickly get started.</p>\n</p>\n<dt id='q15%3A%20can%20i%20use%20advanced%20wordpress%20reset%20alongside%20other%20plugins%3F'>\nQ15: Can I use Advanced WordPress Reset alongside other plugins?\n</h4>\n<p>\n<p>Yes, you can seamlessly use Advanced WordPress Reset alongside other plugins. The plugin is designed to integrate smoothly with various other plugins, allowing you to harness its power while benefiting from the functionalities of other tools.</p>\n</p>\n<dt id='q16%3A%20how%20often%20should%20i%20take%20snapshots%3F'>\nQ16: How often should I take Snapshots?\n</h4>\n<p>\n<p>The frequency of taking Snapshots depends on your specific usage scenario. If you&#8217;re actively experimenting with changes, consider taking multiple daily snapshots. For regularly updated sites or staging environments, a weekly snapshot might be sufficient. Snapshots provide you with a safety net for unexpected situations, ensuring you can easily restore your site to a known state.</p>\n</p>\n<dt id='q17%3A%20does%20this%20plugin%20enhance%20my%20website%27s%20security%3F'>\nQ17: Does this plugin enhance my website&#8217;s security?\n</h4>\n<p>\n<p>Advanced WordPress Reset contributes to improved security by allowing you to quickly revert your site to a clean state. If your site experiences security issues or hacks, you can reset it to its default configuration, eliminating potentially compromised files and settings. The tools and collections are also very useful in maintaining a clean website which in turn reduces the risk of successful attacks and hacks.</p>\n</p>\n<dt id='q18%3A%20can%20the%20plugin%20safeguard%20my%20data%3F'>\nQ18: Can the plugin safeguard my data?\n</h4>\n<p>\n<p>Yes, the plugin offers a reliable way to safeguard your data. By regularly taking automated Snapshots, you create backup points that enable you to revert to a previous state in case of data loss or corruption, providing an additional layer of data protection.</p>\n</p>\n\n",
        "changelog": "<h4>2.0.6 &#8211; 11/01/2024</h4>\n<ul>\n<li>Fix: the admin user is not created correctly when Elementor is active</li>\n<li>Tweak: few changes to the style</li>\n</ul>\n<h4>2.0.5 &#8211; 30/11/2023</h4>\n<ul>\n<li>Fix: banners warning fixed</li>\n</ul>\n<h4>2.0.4 &#8211; 18/11/2023</h4>\n<ul>\n<li>Fix: resolved conflicts between free and pro versions</li>\n<li>Tweak: enhancements to the code and style</li>\n<li>Compatibility: tested with wordpress 6.4.1</li>\n</ul>\n<h4>2.0.3 &#8211; 19/09/2023</h4>\n<ul>\n<li>New: snapshots are now available in the free version, allowing for the creation, download, restoration, and comparison of snapshots</li>\n<li>Tweak: eliminated default backup tables prefixed with awr_bkp_</li>\n<li>Tweak: changed the plugin banner on wordpress.org</li>\n</ul>\n<h4>2.0.2 &#8211; 13/09/2023</h4>\n<ul>\n<li>Tweak: introduction of demo videos</li>\n<li>Tweak: addition of useful links: FAQ, YouTube channel, and bug report</li>\n<li>Tweak: revisions and corrections to text</li>\n</ul>\n<h4>2.0.1 &#8211; 28/08/2023</h4>\n<ul>\n<li>Fix: session bug fixed now</li>\n<li>Tweak: CSS improvements</li>\n</ul>\n<h4>2.0 &#8211; 16/08/2023</h4>\n<ul>\n<li>Tweak: entire code and style refactored</li>\n<li>New: introducing our PRO version: https://awpreset.com</li>\n</ul>\n<h4>1.7 &#8211; 11/04/2023</h4>\n<ul>\n<li>Fix: admin user was not properly recreated in some cases, this has been fixed</li>\n<li>Tweak: enhancing the JS and CSS codes little bit</li>\n<li>Tweak: you are now logged in directly after the reset</li>\n<li>Security: improving the plugin&#8217;s security</li>\n</ul>\n<h4>1.6 &#8211; 01/07/2022</h4>\n<ul>\n<li>Security fix: enhancing the security of the plugin by escaping some URLs before outputting them</li>\n</ul>\n<h4>1.5 &#8211; 23/02/2022</h4>\n<ul>\n<li>New: feature to clean up &#8216;uploads&#8217; folder</li>\n<li>New: feature to delete all themes</li>\n<li>New: feature to delete all plugins</li>\n<li>New: feature to clean up &#8216;wp-content&#8217; folder</li>\n<li>New: feature to delete MU plugins</li>\n<li>New: feature to delete the &#8216;.htaccess&#8217; file</li>\n<li>New: feature to delete all comments</li>\n<li>New: feature to delete pending comments</li>\n<li>New: feature to delete spam comments</li>\n<li>New: feature to delete trashed comments</li>\n<li>New: feature to delete pingbacks</li>\n<li>New: feature to delete trackbacks</li>\n<li>Tweak: completely rewriting the JavaScript code</li>\n<li>Tweak: enhancing the CSS code</li>\n<li>Tweak: enhancing the PHP code</li>\n<li>Tested with WordPress 5.9</li>\n</ul>\n<h4>1.1.1 &#8211; 17/09/2020</h4>\n<ul>\n<li>Tweak: enhancing the JavaScript code</li>\n<li>Tweak: we are now using SweetAlert for all popup boxes</li>\n<li>Tweak: enhancing some blocks of code</li>\n<li>Tested with WordPress 5.5</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Some changes to CSS style</li>\n<li>Changing a direct text to _e() for localization</li>\n<li>Test the plugin with WP 5.1</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>The plugin is now Reactivated after the reset</li>\n<li>Adding &#8220;Successful Reset&#8221; message</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>First release: Hello world!</li>\n</ul>\n"
    },
    "short_description": "The ultimate solution for resetting your WordPress database or specific components to their default settings using the advanced reset features.",
    "description": "<p><a href=\"https://awpreset.com?utm_source=wordpress_org&amp;utm_medium=link&amp;utm_campaign=ongoing&amp;utm_content=awr_homepage\" rel=\"nofollow ugc\">Advanced WordPress Reset</a> is the ultimate WordPress productivity and troubleshooting plugin for developers and enthusiasts.</p>\n<p>With this plugin, you can Reset, Debug, Recover, and Automate your WordPress like never before, all in one place!</p>\n<p>Whether you&#8217;re a seasoned developer or an ambitious beginner, our plugin will make your life easier and your workdays more productive.</p>\n<p>📢 For users looking primarily to clean up their database and delete orphaned items, we recommend using the <a href=\"https://wordpress.org/plugins/advanced-database-cleaner\" rel=\"ugc\">Advanced Database Cleaner</a> plugin.</p>\n<h3>Truly Advanced WordPress Reset</h3>\n<p>Whether you&#8217;re seeking simplicity or in-depth customization, this plugin offers you 3 powerful core Reset options that cater to most WordPress Reset needs:</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/IUDCZHBKRy4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>Site Reset</h4>\n<p>This is the most commonly used website Reset option as it preserves your data and focuses the Reset on the database and its content.</p>\n<p>Elements that are removed are:</p>\n<ul>\n<li>Pages, Posts and Comments</li>\n<li>Custom tables</li>\n<li>Users (except the current admin user)</li>\n<li>After the Reset, the following will remain untouched:</li>\n</ul>\n<p>Elements that are kept are:</p>\n<ul>\n<li>The current admin user</li>\n<li>Files, Uploads, Themes, Child themes, Plugins, etc.</li>\n<li>Basic WP settings like Site title, WP address, Site address, Time zone &amp; Language</li>\n<li>Non-WordPress Database Tables</li>\n</ul>\n<p>Site Reset is the ideal way to start over fresh without having to re-upload all your images &amp; videos, reconfigure user access, reinstall themes and plugins…</p>\n<h4>Nuclear Reset (Pro feature)</h4>\n<p>Choose this option for a total reboot. This in-depth reset removes almost everything, from files to custom settings and database tables. It&#8217;s the closest you’ll get to a fresh WordPress install without the hassle.</p>\n<p>The only things that are kept after a Nuclear Reset are:</p>\n<ul>\n<li>The current user for you to log in</li>\n<li>This plugin’s files and data</li>\n<li>Non-WordPress Database Tables</li>\n</ul>\n<h4>Custom Reset (Pro feature)</h4>\n<p>If none of the above “out of the box” options fits your needs, try the Custom Reset option for even more control and flexibility. Set exactly what you want to reset and what you want to keep untouched:</p>\n<ul>\n<li>Choose which themes to activate, deactivate, or delete after the Reset</li>\n<li>Choose which plugins to activate, deactivate, or delete after the Reset</li>\n<li>Decide which users to keep after the Reset</li>\n<li>Customize your blog info after the reset</li>\n<li>You can also choose to keep things are they are for each element</li>\n</ul>\n<p>Once you’re happy with your choices, you can save your preferences in a Custom reset for easy later use. Repeat this process as needed, and you’ll end up with your very own library of tailored Resets!</p>\n<p>As you can see, the Custom Reset feature provides you with full control over your Reset process.</p>\n<p>In addition to the 3 core options above, we also have numerous individual reset tools that can be used to conduct laser-targeted partial resets of specific parts of your WordPress site.</p>\n<p>For instance, you could choose to exclusively reset your menus and widgets while leaving the rest untouched.</p>\n<h3>Tools &amp; Collections for Partial Resets and Beyond</h3>\n<p>The Tools section is an extension of the 3 main Reset options above that enables you to perform laser-targeted and custom partial Resets.</p>\n<p>With an extensive library of Tools, you can have the most precise and granular control over what you want to reset using specific tools:</p>\n<ul>\n<li>Reset the ‘uploads’ folder (/wp-content/uploads) by deleting all its content. This includes images, videos, music, documents, subfolders, etc.</li>\n<li>Reset Themes by deleting all themes (the plugin uses WordPress core functions to delete themes). You can keep the currently active theme or delete it as well</li>\n<li>Delete all plugins (the plugin will deactivate them first then uninstall them using WordPress core functions)</li>\n<li>Reset “wp-content” folder. All files and folders inside ‘/wp-content’ directory will be deleted and reset, except ‘index.php’ and the following folders: ‘plugins’, ‘themes’, ‘uploads’, and ‘mu-plugins’</li>\n<li>Delete Must-use plugins. All MU plugins in ‘/wp-content/mu-plugins’ will be deleted. These are plugins that cannot be disabled except by removing their files from the must-use directory</li>\n<li>Delete “.htaccess” file. This is a critical WordPress core file used to enable or disable features of websites hosted on Apache. In some cases, you may need to delete it to do some tests</li>\n<li>Delete all comments. All types of comments including published, pending, spam, trashed… will be deleted. Comments meta will also be deleted</li>\n<li>Delete pingbacks. Pingbacks allow you to notify other website owners that you have linked to their article on your website</li>\n<li>Delete trackbacks. Although there are some minor technical differences, a trackback is the same thing as a pingback</li>\n<li>…</li>\n</ul>\n<p>The above Tools can also be used to clean up and optimize a WordPress site in order to save disk space, improve performance, or simply reduce security risks by getting rid of unsafe plugins, themes, and files. the possibilities are endless and the only limit is your creativity!</p>\n<p>To enable such advanced creative use cases, the Pro version of Advanced WordPress Reset lets you build <strong>Collections</strong> of tools where you can pick and choose the tools you want to include in a collection. Once a collection is built and saved, you will be able to run all the tools it contains with a single click of the mouse saving you valuable time and hassle.</p>\n<p>To take things even further and empower our power users, the Pro version of the plugin has powerful automation and scheduling features that let you choose the time and frequency at which a collection is executed automatically by the system without the need for you to log in and run it manually.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/aVJrKj9plpQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Whether it is a custom Partial Reset Collection, Cleanup Collection, or Optimization Collection… you’ll be able to automate and schedule its execution with unparalleled ease and control.</p>\n<p>When used together, Collections and Scheduling become powerful tools to improve productivity and save time on repetitive yet essential tasks like maintenance or recurring environment resets. We’ve listed a few real-world use cases below for your reference.</p>\n<h3>Snapshots and Restoration to the Rescue</h3>\n<p>Because Resets perform critical actions on your database and contents with potentially catastrophic consequences on your site, it was imperative to include additional safety mechanisms you could resort to if need be.</p>\n<p>Snapshots are a simple yet powerful way of taking full copies of your database to provide you with an invaluable safety net in case things go south. Simply restore your snapshot and you should be good to go.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/G3E9LbLa3QI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>In other words, Snapshots create an undo button for Resets as far as database data is concerned. That’s why we highly recommend that you systematically take a snapshot of your site’s database before any Reset.</p>\n<p>In fact, it’s always a good idea to take multiple snapshots at different points in time so you can have more than one option if you need to revert to a previous state of your site.</p>\n<p>Since snapshots are similar in a way to backups, they can also be used to restore a hacked or damaged database. However, please understand that Snapshots DO NOT replace backups as they don’t save a copy of your files. We thus recommend you use one of the numerous backup tools available.</p>\n<p>Even though taking a snapshot is free, quick and easy, our users are sometimes too busy or simply forget to do so. That’s why the plugin comes with a powerful scheduling Pro feature that automates the whole process for you. Just choose the options that best suit your needs and the system will take care of the rest for you.</p>\n<h3>WP Switcher for in-depth compatibility Testing (Pro feature)</h3>\n<p>Plugin and Theme developers rely on our plugin to speed up their tests and troubleshoot their creations. However, such tests are only as good as the version they are run on.</p>\n<p>With WP Switcher, a unique feature in Advanced WordPress Reset, we make switching from one WordPress version to another a breeze! Now, you can truly ensure the compatibility of your plugin or theme across different WordPress versions by proactively detecting and addressing any version-specific issues.</p>\n<p>WP Switcher offers a convenient one-click feature for changing versions, making it effortless to upgrade or downgrade your existing WordPress version.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/UjE6kDUJj5E?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>By utilizing the power of WP Switcher, you can expedite your testing workflow, making sure your projects operate flawlessly across all relevant WordPress versions.</p>\n<h3>Advanced WordPress Reset in Real-world Scenarios</h3>\n<p>Advanced WordPress Reset is designed to cater to a wide range of users and scenarios. From beginners using it to start over fresh to experienced developers getting creative in utilizing the plugin to automate maintenance or streamline new product testing. Let’s take a look at examples of both standard and advanced scenarios:</p>\n<p><strong>Efficient Site Maintenance &amp; Optimization:</strong> So you have a client and your contract is to maintain a perfectly working and optimized site for them. You could do this manually every now and then or turn on the autopilot thanks to the automation features included in the plugin. Start by composing the Collection of tools you want to run and decide on the frequency at which the system will execute them. That’s all, You have now saved yourself or your team countless hours going into the backend to remove or reset specific parts of the site on a weekly or monthly basis and you can even increase the frequency to daily execution if it’s a high traffic/content website.</p>\n<p><strong>Exploratory Theme and Layout Testing:</strong> Some clients have a hard time with PSD or PNG designs and need to see a minimal live version of their future website before they can make a choice. Using Advanced WordPress Reset, you can venture into creative explorations of themes and layouts without the fear of leaving traces behind or having to do things over countless times. Test different designs with confidence, knowing that your site can be reset to its default state swiftly without losing all the data you uploaded or the menus you’ve created.</p>\n<p><strong>Streamlined Debugging and Troubleshooting:</strong> So your site isn&#8217;t functioning as expected, and you&#8217;re left grappling with the frustration of not knowing where things went wrong. In collaborative environments, such as when multiple individuals contribute to the site, the source of the issue is never clear and it might even be a faulty plugin update, Who knows? Instead of banging your head against the wall or resorting to a complete reset that demands starting over from scratch, our solution allows you to reset specific site components that appear suspicious or have fallen into disuse. This targeted approach saves you the exasperation and significant time that would otherwise be spent in a complete redo, enabling you to swiftly identify the cause of the problem and get back on track.</p>\n<p><strong>Quick Theme and Plugin Testing:</strong> Simplify and speed up plugin and theme testing by resetting your site to its initial state as many times as you need. Test plugins and themes comprehensively, ensuring accurate results and smooth compatibility.</p>\n<p><strong>Hacked site Recovery:</strong> Picture this: It&#8217;s 6 a.m., and you are woken up by a frantic client reporting a site outage or worse, a ransom message on their homepage. With a sense of urgency, you navigate to the backend to locate the latest snapshot and swiftly restore it with a few clicks. Just like that, the site is back to normal, and you dial the client with reassuring news. As a developer or webmaster, you are well aware that attacks and technical glitches are much more frequent than we think, that’s why you had enabled the auto snapshot feature of advanced WordPress reset and scheduled it for run daily. While snapshots are not as comprehensive as backups, they are more reliable, faster to create, and take up less disk space making them a great alternative to backups.</p>\n<p><strong>Performance Benchmarking &amp; Troubleshooting:</strong> Your site is slow and you’re unsure if it’s the server, your site configuration, the theme, some plugins, PHP… By measuring the site speed in different states, the picture will become much clearer. Using Site Resets, Custom Resets, and Nuclear Resets, you can go as far as you need to until your performance issues disappear. This will help you quickly identify the root cause of the performance slump. Once the root cause is known, you can undo your actions and focus your efforts on fixing the exact problem causing the performance degradation. In this scenario, the smart combination of Resets and Snapshot restoration makes for a perfect toolset for performance benchmarking and troubleshooting.</p>\n<p><strong>WordPress Update Rollback:</strong> Like most WordPress users, it’s hard to resist that update WordPress button. However, it’s not uncommon for an update to break something in your site. Unfortunately, once that happens, your choices are limited as there is no cancel update button! You can either spend hours trying to identify the cause and fix it or restore a full backup of the site if you have one. With WP Switcher, you now have one more option, downgrading your WordPress version until you find a working version.</p>\n<p><strong>Client Site Recovery:</strong> It’s not uncommon for clients to mess things up and blame you for it. Whether your client&#8217;s site faces unexpected issues or requires a do-over, this plugin simplifies the recovery process. Quickly restore their site to its default state or rebuild it entirely, fostering efficient communication and client satisfaction.</p>\n<p><strong>Demo Site Automatic Reset:</strong> Imagine you have a demo site for people to test drive your plugin or theme. After a few hours or days, you’ll certainly end up with a few pages, posts, and customizations made by users who are trying to get a feel for your tools. Instead of reinstalling the whole system again every now and then or running through everything to clean up the mess, you can simply create automatic partial resets and cleanups using Collection automation and scheduling. In addition to saving you time, you’ll also be able to increase frequency to improve user experience. tracking what they do, you can just schedule a collection to clean everything up and reset the whole demo site as it should be every 2 hours for example.</p>\n<h3>Do more with Advanced WordPress Reset PRO</h3>\n<p>While the free version has all you need to simply and quickly Reset your website, the Pro version is 10 times more powerful with professional-focussed features designed to turbocharge your WordPress development:</p>\n<ul>\n<li>Nuclear Resets</li>\n<li>Custom Resets.</li>\n<li>37 Partial Reset Tools instead of 14</li>\n<li>Collections</li>\n<li>Automation &amp; Scheduling</li>\n<li>WP Switcher</li>\n<li>Priority access to new features</li>\n</ul>\n<h3>Get the #1 Top-Rated WP Reset Plugin</h3>\n<p>Whether you opt for the Free or Pro version, you can’t go wrong with Advanced WordPress Reset. The numbers speak for themselves:</p>\n<ul>\n<li>1 Million+ Downloads: A testament to our reliability and usefulness.</li>\n<li>Near Perfect Rating: Our 4.9 rating speaks to the quality and user satisfaction.</li>\n<li>1,183 ratings: A massive vote of confidence only top plugins can boast</li>\n</ul>\n<p>Download Advanced WordPress Reset today and see for yourself.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/advanced-wp-reset.2.0.6.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/advanced-wp-reset/assets/screenshot-1.png?rev=2958972",
            "caption": "Reset"
        },
        {
            "src": "https://ps.w.org/advanced-wp-reset/assets/screenshot-2.png?rev=2958972",
            "caption": "Snapshots"
        },
        {
            "src": "https://ps.w.org/advanced-wp-reset/assets/screenshot-3.png?rev=2958972",
            "caption": "Tools"
        },
        {
            "src": "https://ps.w.org/advanced-wp-reset/assets/screenshot-4.png?rev=2958972",
            "caption": "Collections"
        },
        {
            "src": "https://ps.w.org/advanced-wp-reset/assets/screenshot-5.png?rev=2958972",
            "caption": "WP switcher"
        }
    ],
    "tags": {
        "clean": "clean",
        "database": "database",
        "reset": "reset",
        "reset-database": "reset database",
        "restore": "restore"
    },
    "stable_tag": "2.0.6",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/advanced-wp-reset.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/advanced-wp-reset.1.0.1.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/advanced-wp-reset.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/advanced-wp-reset.1.1.1.zip",
        "1.5": "https://downloads.wordpress.org/plugin/advanced-wp-reset.1.5.zip",
        "1.6": "https://downloads.wordpress.org/plugin/advanced-wp-reset.1.6.zip",
        "1.7": "https://downloads.wordpress.org/plugin/advanced-wp-reset.1.7.zip",
        "2.0": "https://downloads.wordpress.org/plugin/advanced-wp-reset.2.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/advanced-wp-reset.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/advanced-wp-reset.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/advanced-wp-reset.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/advanced-wp-reset.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/advanced-wp-reset.2.0.5.zip",
        "2.0.6": "https://downloads.wordpress.org/plugin/advanced-wp-reset.2.0.6.zip",
        "trunk": "https://downloads.wordpress.org/plugin/advanced-wp-reset.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/advanced-wp-reset/assets/banner-772x250.png?rev=2968494",
        "high": "https://ps.w.org/advanced-wp-reset/assets/banner-1544x500.png?rev=2968494"
    },
    "icons": {
        "1x": "https://ps.w.org/advanced-wp-reset/assets/icon-128x128.png?rev=1375283",
        "2x": "https://ps.w.org/advanced-wp-reset/assets/icon-256x256.png?rev=1375283"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "advanced-wp-reset",
            "language": "de_DE",
            "version": "2.0.6",
            "updated": "2024-03-17 15:23:24",
            "package": "https://downloads.wordpress.org/translation/plugin/advanced-wp-reset/2.0.6/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "advanced-wp-reset",
            "language": "de_DE_formal",
            "version": "2.0.6",
            "updated": "2024-03-17 15:24:05",
            "package": "https://downloads.wordpress.org/translation/plugin/advanced-wp-reset/2.0.6/de_DE_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "advanced-wp-reset",
            "language": "es_CO",
            "version": "2.0.6",
            "updated": "2020-09-18 01:02:15",
            "package": "https://downloads.wordpress.org/translation/plugin/advanced-wp-reset/2.0.6/es_CO.zip"
        },
        {
            "type": "plugin",
            "slug": "advanced-wp-reset",
            "language": "es_MX",
            "version": "2.0.6",
            "updated": "2020-09-18 16:19:53",
            "package": "https://downloads.wordpress.org/translation/plugin/advanced-wp-reset/2.0.6/es_MX.zip"
        },
        {
            "type": "plugin",
            "slug": "advanced-wp-reset",
            "language": "es_ES",
            "version": "2.0.6",
            "updated": "2023-11-21 13:13:22",
            "package": "https://downloads.wordpress.org/translation/plugin/advanced-wp-reset/2.0.6/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "advanced-wp-reset",
            "language": "es_VE",
            "version": "2.0.6",
            "updated": "2020-09-18 00:59:17",
            "package": "https://downloads.wordpress.org/translation/plugin/advanced-wp-reset/2.0.6/es_VE.zip"
        },
        {
            "type": "plugin",
            "slug": "advanced-wp-reset",
            "language": "fa_IR",
            "version": "2.0.6",
            "updated": "2021-05-10 06:52:06",
            "package": "https://downloads.wordpress.org/translation/plugin/advanced-wp-reset/2.0.6/fa_IR.zip"
        },
        {
            "type": "plugin",
            "slug": "advanced-wp-reset",
            "language": "fr_FR",
            "version": "2.0.6",
            "updated": "2023-04-11 09:57:00",
            "package": "https://downloads.wordpress.org/translation/plugin/advanced-wp-reset/2.0.6/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "advanced-wp-reset",
            "language": "it_IT",
            "version": "2.0.6",
            "updated": "2020-09-18 09:24:43",
            "package": "https://downloads.wordpress.org/translation/plugin/advanced-wp-reset/2.0.6/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "advanced-wp-reset",
            "language": "ja",
            "version": "2.0.6",
            "updated": "2024-03-22 13:34:01",
            "package": "https://downloads.wordpress.org/translation/plugin/advanced-wp-reset/2.0.6/ja.zip"
        },
        {
            "type": "plugin",
            "slug": "advanced-wp-reset",
            "language": "pt_BR",
            "version": "2.0.6",
            "updated": "2024-02-20 13:38:00",
            "package": "https://downloads.wordpress.org/translation/plugin/advanced-wp-reset/2.0.6/pt_BR.zip"
        },
        {
            "type": "plugin",
            "slug": "advanced-wp-reset",
            "language": "ru_RU",
            "version": "2.0.6",
            "updated": "2023-09-13 05:55:58",
            "package": "https://downloads.wordpress.org/translation/plugin/advanced-wp-reset/2.0.6/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "advanced-wp-reset",
            "language": "zh_TW",
            "version": "2.0.6",
            "updated": "2023-08-16 08:20:12",
            "package": "https://downloads.wordpress.org/translation/plugin/advanced-wp-reset/2.0.6/zh_TW.zip"
        }
    ]
}