{
    "name": "Riverty Payments for Woocommerce",
    "slug": "afterpay-payment-gateway-for-woocommerce",
    "version": "7.1.5",
    "author": "<a href=\"http://www.riverty.com\">Riverty</a>",
    "author_profile": "https://profiles.wordpress.org/afterpay/",
    "contributors": {
        "afterpay": {
            "profile": "https://profiles.wordpress.org/afterpay/",
            "avatar": "https://secure.gravatar.com/avatar/5082063b2e29de52c87b651c19e2f343?s=96&d=monsterid&r=g",
            "display_name": "Riverty"
        }
    },
    "requires": "4.5.0",
    "tested": "6.6.1",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 1,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 1,
    "support_url": "https://wordpress.org/support/plugin/afterpay-payment-gateway-for-woocommerce/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 300,
    "downloaded": 14648,
    "last_updated": "2024-08-21 9:06am GMT",
    "added": "2018-10-05",
    "homepage": "https://www.riverty.com",
    "sections": {
        "description": "<p>With a growing range of Buy now, pay later (BNPL) payment solutions, Riverty offers you and your online shoppers an outstanding webshop experience. You get simple and fast integration plus the guarantee of being paid, while your customers get more freedom, safety and security. It’s win-win for you and your customers.</p>\n<p>Riverty makes you be even more successful by optimizing your payment method mix and helping consumers complete their checkout. For example, Riverty’s Buy now, pay later offering meets a growing need, as 25% of European online shoppers have already used this payment solution, and 50% confirm they are considering doing so in the future.</p>\n<p><a href=\"https://www.riverty.com/en/business/products/get-started-riverty-buy-now-pay-later/\" rel=\"nofollow ugc\">Get started with Riverty Payments</a></p>\n<h4>Riverty is the new AfterPay</h4>\n<p>Riverty offers a totally new perspective on financial sustainability, as it now includes all our smart and contemporary payment and receivables management solutions. By starting from the real needs and financial wellbeing of consumers, we enable merchants, partners and consumers to live their best financial life in a rapidly changing world.</p>\n<h4>The benefits of choosing Riverty</h4>\n<h4>Fast &amp; easy set-up</h4>\n<p>Are you ready for Riverty payment solutions? Follow the straight-forward instructions and receive confirmation quickly. Follow our installation and setup guidelines to get started.</p>\n<h4>Payment solutions designed for you</h4>\n<p>Seamless integration with your webshop is guaranteed as our plugin is designed for your platform.</p>\n<h4>A direct connection to Riverty with no PSP in between</h4>\n<p>With a direct connection to Riverty, you have full control of the integration. You will also receive regular updates concerning support, functionality and security.</p>\n<h4>Lifetime support</h4>\n<p>If ever you need help, we’re there to help you. Got a question: get in touch and we will sort you out as fast as we can.</p>\n<h4>Easy order management (capturing &amp; refunding)</h4>\n<p>Riverty’s smart order management process makes it easy to manage payments and refunds of items paid with Riverty. By easily capturing previously authorized funds, voiding an unsettled transaction, or doing a full or partial refund of a settled transaction, Riverty’s order management system enables you to manage all transactions that happen for an order.</p>\n<h4>Always know what’s going on</h4>\n<p>Our merchant dashboard helps you keep track of orders, returns and invoices.</p>\n<h4>Your brand in the spotlight</h4>\n<p>While our consumer-focused tools; the Riverty app (Google Play Store and Apple App Store) &amp; MyRiverty offer more freedom and transparency to shoppers, they also ensure you as a merchant have more opportunities and touchpoints to interact with your shoppers as your brand remains in the spotlight.</p>\n<h4>A broad range of payment methods</h4>\n<p>With our seamless integration you can quickly get started with the payment options you want to offer (depending on the countries your webshop operates in).</p>\n<ul>\n<li><strong>14-day invoice</strong> &#8211; Available in every market, 14-day Invoice is the default payment method of Riverty. It is primary designed for business-to-consumer sales.</li>\n<li><strong>Instalments</strong> &#8211; This is a Part Payment invoice. The customer can split their purchase over multiple monthly payments.</li>\n<li><strong>Direct Debit</strong> &#8211; This is a Direct Debit version of the 14-day invoice payment method. The consumers IBAN is collected at time of purchase in the check-out and the purchase amount is then debited from the consumer&#8217;s bank account once the goods have been delivered.</li>\n<li><strong>Campaign invoice</strong> &#8211; During peak seasons, such as Christmas, Black Friday, etc, merchants may use campaign invoicing. This gives shoppers extended payment terms per purchase with either fixed date (such as: 15. January) or floating (such as: in 60 days).</li>\n<li><strong>B2B invoice</strong> &#8211; This is the the Business to Business (B2B) version of the default 14-day invoice payment method of Riverty.</li>\n<li><strong>Flex</strong> &#8211; Flex offers to spread payments to the customers’ desired pace. Giving customers the ultimate freedom of payment customization. With this payment option consumers can adjust at any moment how and when they pay.</li>\n<li><strong>Pay in 3</strong> &#8211; Particularly popular with younger, financially stable audiences buying premium value goods, Pay in 3 splits the check-out amount into 3 interest-free payment parts for completion within 90 days.</li>\n</ul>\n<p>Riverty Payments are available in the following markets:</p>\n<ul>\n<li>Germany</li>\n<li>Austria</li>\n<li>Switzerland</li>\n<li>Netherlands</li>\n<li>Belgium</li>\n<li>Denmark</li>\n<li>Sweden</li>\n<li>Norway</li>\n<li>Finland.</li>\n</ul>\n",
        "installation": "<ol>\n<li>Install directly through the WordPress Plugins screens or upload the plugin files to the <code>/wp-content/plugins/plugin-name</code> directory.</li>\n<li>Activate in the &#8216;Plugins&#8217; screen in WordPress.</li>\n<li>Go to Woocommerce-&gt;Settings-&gt;Checkout to configure the Riverty payment methods.</li>\n</ol>\n<p><a href=\"https://www.riverty.com/en/business/products/get-started-riverty-buy-now-pay-later/\" rel=\"nofollow ugc\">Contact us</a> to sign up and get your test and live credentials.</p>\n",
        "changelog": "<p>2024.08.21 &#8211; version 7.1.5</p>\n<ul>\n<li>Resolve issue with guzzlehttp fatal errors.</li>\n<li>We have added dynamic code of conduct text at netherlands to be retrieved from APM call instead of static text that was previously used.</li>\n<li>Furthermore did compatibility tests to ensure that the Riverty plugin is fully compatible with the most recent WordPress and Woocommerce versions.</li>\n</ul>\n<p>2024.08.07 &#8211; version 7.1.4</p>\n<ul>\n<li>Resolve issue with difference between billing and delivery address at B2B transactons.</li>\n<li>Updated Riverty PHP SDK to version 4.5.0.</li>\n</ul>\n<p>2024.07.10 &#8211; version 7.1.3</p>\n<ul>\n<li>Adjust Riverty logo style at checkout.</li>\n<li>Resolve issue with preloader icon not visible when triggering api key validation at the admin panel configuration.</li>\n<li>Furthermore did compatibility tests to ensure that the Riverty plugin is fully compatible with the most recent WordPress and Woocommerce versions.</li>\n</ul>\n<p>2024.05.13 &#8211; version 7.1.2</p>\n<ul>\n<li>Resolved issue with fatal error on plugin activation.</li>\n<li>Adjusted hiding and showing capture config settings</li>\n<li>Updated profile tracking text visible to users at checkout and profile tracking scripts subdomain for new installations.</li>\n<li>Updated Riverty PHP SDK to version 4.4.0.</li>\n<li>Furthermore did compatibility tests to ensure that the Riverty plugin is fully compatible with the most recent WordPress and Woocommerce versions.</li>\n</ul>\n<p>2024.01.13 &#8211; version 7.1.1</p>\n<ul>\n<li>Added code of conduct text to netherlands payment methods.</li>\n<li>Added support for Woocommerce High Performance Order Storage.</li>\n<li>Updated T&amp;C as well as privacy statements and links for netherlands payment methods.</li>\n<li>Updated profile tracking text visible to users at checkout.</li>\n<li>Updated Riverty PHP SDK to version 4.2.0.</li>\n<li>Furthermore did compatibility tests to ensure that the Riverty plugin is fully compatible with the most recent WordPress and Woocommerce versions.</li>\n</ul>\n<p>2023.11.01 &#8211; version 7.1.0</p>\n<ul>\n<li>In this release we have added Profile tracking to our Woocommerce plugin, and have an extra layer of security in the checkout.</li>\n<li>Furthermore did compatibility tests to ensure that the Riverty plugin is fully compatible with the most recent Woocommerce version.</li>\n</ul>\n<p>2023.06.21 &#8211; version 7.0.0</p>\n<ul>\n<li>Compatibility with WordPress 6.2.2 and WooCommerce 7.8.0 ensured.</li>\n<li>Improved support for the default local pickup point shipping method in WooCommerce.</li>\n<li>Updated Riverty PHP SDK to version 4.0.0.</li>\n</ul>\n<p>2023.05.09 &#8211; version 6.9.0</p>\n<p>New features for the Nordics (Sweden, Norway, Finland and Denmark):</p>\n<ul>\n<li>Added the &#8216;Campaign Invoice&#8217; payment method.</li>\n<li>Added the &#8216;Business 2 Business&#8217; payment method.</li>\n<li>Resolved an issue where some installment options were not visible.</li>\n</ul>\n<p>Compatibility testing:</p>\n<ul>\n<li>Tested compatibility with Woocommerce versions 7.4.1, 7.5.1, 7.6.0, and 7.6.1.</li>\n<li>Tested compatibility with WordPress version 6.2.</li>\n</ul>\n<p>Configuration improvements:</p>\n<ul>\n<li>Resolved a minor issue with advanced settings in the plugin.</li>\n<li>Added an explanation to the &#8216;Refund tax percentage&#8217; configuration field.</li>\n<li>Improved the explanation for the &#8216;Exclude shipping methods&#8217; configuration field.</li>\n</ul>\n<p>2023.05.08 &#8211; version 6.8.0</p>\n<ul>\n<li>Enhanced validation error messages in checkout for improved usability across all supported languages.</li>\n<li>Updated payment titles for B2B payment methods in the Netherlands and Germany to provide clearer payment identification.</li>\n<li>Tested and confirmed compatibility with Woocommerce version 7.4.0.</li>\n<li>Resolved deprecation issues for PHP version 8.1 to ensure the plugin is up to date with current standards.</li>\n<li>Improved the configuration of the payment method by adding more detailed explanations for enhanced user understanding.</li>\n</ul>\n<p>2023.02.24 &#8211; version 6.7.1</p>\n<ul>\n<li>We have fixed an issue with the configuration screen of legacy SOAP payment methods.</li>\n</ul>\n<p>2023.02.22 &#8211; version 6.7.0</p>\n<ul>\n<li>We have changed the terms and conditions text for the Pay-in-3 payment method. This is now retrieved from the Riverty API.</li>\n<li>We have added a button to check the validity of the API keys, to take away the doubt if an API key is working.</li>\n<li>We have fixed an issue with wrong currency signs being shown in the fixed installment payment method in Norway.</li>\n</ul>\n<p>2023.02.20 &#8211; version 6.6.2</p>\n<ul>\n<li>We have checked compatibility with the latest version of WordPress (6.1.1).</li>\n<li>We have checked compatibility with the latest version of WooCommerce (7.3.0).</li>\n<li>We have checked and fixed the compatibility and responsiveness of payment methods on mobile and tablet.</li>\n<li>We have updated the Riverty PHP SDK to version 3.9.0.</li>\n<li>We have updated the endpoints of the Riverty REST API.</li>\n<li>We have checked and fixed the compatibility with the Custom Order Numbers plugin (version 1.4.0 by Tyche Softwares).</li>\n<li>We have translated the descriptions for &#8216;Discount&#8217; and &#8216;Shipping&#8217; that are used in the order information of the transaction.</li>\n<li>We have changed AfterPay into Riverty on the Debug Email feature and into the plugin provider information.</li>\n<li>We have improved the error messages in the authentication process, especially when the SCA process is used.</li>\n<li>We have made the configuration of payment methods more user-friendly.</li>\n<li>We have fixed an issue with the installments payment method regarding links for more information.</li>\n<li>We have improved the user experience for the Pay-in-3 payment method by adding a Riverty element showing the offering.</li>\n</ul>\n<p>2022.11.18 &#8211; version 6.5.0</p>\n<ul>\n<li>DP-1253 &#8211; We have added the new Pay in 3 payment method for the Netherlands.</li>\n<li>DP-1330 &#8211; We have checked the compatibility with the latest version of WordPress 6.1</li>\n<li>DP-1341 &#8211; We have checked the compatibility with the latest version of Woocommerce 7.1</li>\n<li>DP-1356 &#8211; We have updated to the latest version of the Riverty PHP SDK 3.8.0.</li>\n<li>DP-1267 &#8211; We have updated the backend experience for the Riverty branding.</li>\n</ul>\n<p>2022.11.03 &#8211; version 6.4.3</p>\n<ul>\n<li>DP-1324 &#8211; We have fixed an issue with a validation error on the terms and conditions.</li>\n<li>DP-1323 &#8211; We have removed the functionality of the terms and conditions opening in a modal box.</li>\n<li>DP-1317 &#8211; We have removed the GuzzleHttp library from the vendor folder, to avoid compatibility issues.</li>\n<li>DP-1303 &#8211; We have updated the checkout experience for the Riverty branding.</li>\n</ul>\n<p>2022.10.26 &#8211; version 6.4.2</p>\n<ul>\n<li>DP-1308 &#8211; We have fixed an issue with the legal information shown in the checkout.</li>\n<li>DP-1304 &#8211; We have removed the checkboxes for the terms and conditions in NL and BE on legacy SOAP connections.</li>\n</ul>\n<p>2022.10.12 &#8211; version 6.4.1</p>\n<ul>\n<li>DP-1295 &#8211; We have fixed an issue with using PHP functions that are PHP 8 only.</li>\n</ul>\n<p>2022.10.05 &#8211; version 6.4.0</p>\n<ul>\n<li>DP-1254 &#8211; We have tested the compatibilty with Woocommerce 6.9.2</li>\n<li>DP-1238 &#8211; We now use the legal information (terms and conditions) from available payment methods API call</li>\n<li>DP-1233 &#8211; We have added the country code to the available payment methods call</li>\n<li>DP-1229 &#8211; We have updated the plugin to PHP Library version 3.7.0</li>\n<li>DP-1216 &#8211; We have fixed an javascript issue with WordPress version 6.0.1</li>\n<li>DP-1184   &#8211; We have fixed a translation issue for the Date of birth.</li>\n</ul>\n<p>2022.09.19 &#8211; version 6.3.0</p>\n<ul>\n<li>DP-1136 &#8211; Implementation of available payment methods for brand change in the checkout.</li>\n<li>DP-1194 &#8211; Brand change for SOAP payment methods.</li>\n<li>DP-1115 &#8211; Added plugin provider details to API calls.</li>\n<li>DP-1174 &#8211; Update translations.</li>\n<li>DP-1210 &#8211; Checked compatiblity with WordPress 6.0.2</li>\n</ul>\n<p>2022.09.12 &#8211; version 6.2.0</p>\n<ul>\n<li>DP-1205 &#8211; Checked compatibility with Woocommerce 6.8.2 and WordPress 6.0.1</li>\n<li>DP-1159 &#8211; Checked compatibility with Woocommerce 6.7.0</li>\n<li>DP-1099 &#8211; Updated the latest version of the PHP Library (3.6.0)</li>\n<li>DP-836  &#8211; Optimized compatibility with the One Page Checkout</li>\n</ul>\n<p>2022.07.12 &#8211; version 6.1.1</p>\n<ul>\n<li>DP-1039 &#8211; Disabled AfterPay Elements Tab</li>\n</ul>\n<p>2022.07.11 &#8211; version 6.1.0</p>\n<ul>\n<li>DP-959 &#8211; Checked compatibility with WordPress 6.0</li>\n<li>DP-857 &#8211; Updated to the latest version of the AfterPay PHP Library (3.5.1)</li>\n<li>DP-947 &#8211; Updated to the latest version of the AfterPay PHP Library (3.5.3)</li>\n<li>DP-961 &#8211; Checked compatibility with Woocommerce 6.6.1</li>\n<li>DP-962 &#8211; Changed the titles of the payment methods to uniform standard</li>\n<li>DP-1038 &#8211; Changed the order of the payment methods</li>\n<li>DP-963 &#8211; Added extra information to the order confirmation / &#8216;thank you&#8217; page</li>\n<li>DP-964 &#8211; Removed the gender fields</li>\n<li>DP-1042 &#8211; Changed the styling of the terms and conditions</li>\n<li>DP-1049 &#8211; The terms and conditions will now open in a modal window to improve the checkout proces.</li>\n<li>DP-965 &#8211; Added the possibility for merchant specific terms and conditions</li>\n<li>DP-968 &#8211; Added payment methods Direct Debit and Business 2 Business for the Netherlands.</li>\n<li>DP-1039 &#8211; Added support for AfterPay Elements.</li>\n<li>DP-1046 &#8211; Added a box with USP&#8217;s per payment method.</li>\n<li>DP-1047 &#8211; Added an intro text to guide the customer into the form fields.</li>\n<li>DP-1048 &#8211; Updated the bank account field, with field validation and feedback to improve the user experience.</li>\n</ul>\n<p>2022.03.08 &#8211; version 6.0.0</p>\n<ul>\n<li>DP-881 &#8211; Comply to requirements WordPress.</li>\n</ul>\n<p>2022.02.03 &#8211; version 5.9.0</p>\n<ul>\n<li>DP-832 &#8211; Fix issue with Flex payment methods in the Nordics.</li>\n<li>DP-871 &#8211; Checked compatibility with WordPress 5.9 and Woocommerce 6.1.1</li>\n</ul>\n<p>2022.01.17 &#8211; version 5.8.0</p>\n<ul>\n<li>DP-760 &#8211; Updated payment methods in DACH (installments + birthday field)</li>\n<li>DP-760 &#8211; Updated birthday field in the Netherlands and Belgium.</li>\n<li>DP-815 &#8211; Removed Digital Invoice Extra for Germany.</li>\n</ul>\n<p>2021.11.04 &#8211; version 5.7.0</p>\n<ul>\n<li>DP-800 &#8211; Fixed issue with conflicting GuzzleHttp libraries.</li>\n<li>DP-790 &#8211; Fixed issue with image urls using variables, which are not allowed by the AfterPay API.</li>\n<li>DP-793 &#8211; Fixed issue with frontend validation on birthdate, when nothing entered.</li>\n<li>DP-789 &#8211; Fixed issue with too much decimals in vatAmount.</li>\n</ul>\n<p>2021.11.01 &#8211; version 5.6.0</p>\n<ul>\n<li>DP-789 &#8211; Fixed issue with too much decimals in vatAmount.</li>\n</ul>\n<p>2021.09.30 &#8211; version 5.5.0</p>\n<ul>\n<li>DP-775 &#8211; Fixed issue with overwriting settings.</li>\n<li>DP-773 &#8211; Removed BIC from bank account validation, direct debit and installments.</li>\n<li>DP-773 &#8211; Updated PHP Library to version 3.4.0.</li>\n<li>DP-772 &#8211; Update styling to new logo.</li>\n<li>DP-786 &#8211; Added plugin data fields in the &#8216;authorize&#8217; and &#8216;available payment methods&#8217; calls.</li>\n<li>DP-782 &#8211; Added Date of Birth to all payment methods for DE, AT, CH, DK, NL and BE.</li>\n</ul>\n<p>2021.09.20 &#8211; version 5.4.0</p>\n<ul>\n<li>DP-681 &#8211; Add compatibility for NL Shipping methods to REST payment methods.</li>\n<li>DP-761 &#8211; Filter active payment methods on active countries.</li>\n<li>DP-772 &#8211; Updated payment logo of AfterPay.</li>\n</ul>\n<p>2021.06.01 &#8211; version 5.3.0</p>\n<ul>\n<li>DP-744 &#8211; Update PHP Library to version 3.2.0.</li>\n</ul>\n<p>2021.05.27 &#8211; version 5.2.0</p>\n<ul>\n<li>DP-736 &#8211; Allow addresses without housenumbers and remove housenumber and housenumber element when empty.</li>\n<li>DP-747 &#8211; Fixed issue with capturing orders because of order fees.</li>\n<li>DP-733 &#8211; Fixed issue with streetnames starting with number.</li>\n</ul>\n<p>2021.04.06 &#8211; version 5.1.0</p>\n<ul>\n<li>DP-728 &#8211; Fixed compatibility issue with MyParcel pickup points.</li>\n</ul>\n<p>2021.03.09 &#8211; version 5.0.0</p>\n<ul>\n<li>DP-699 &#8211; Checked compatibility with WordPress 5.6 and Woocommerce 5.0</li>\n<li>DP-701 &#8211; Fixed compatibility issue with MyParcel pickup points.</li>\n<li>DP-677 &#8211; Added AfterPay Strong Customer Authentication.</li>\n</ul>\n<p>2020.11.26 &#8211; version 4.9.0</p>\n<ul>\n<li>DP-511 &#8211; Use the store address when local pickup is used as shipping method.</li>\n<li>DP-454 &#8211; Fix deprecated function for canceling orders.</li>\n<li>DP-698 &#8211; Updated the AfterPay PHP Library to version 2.9.1</li>\n</ul>\n<p>2020.08.13 &#8211; version 4.8.0</p>\n<ul>\n<li>DP-663 &#8211; Updated and added payment methods for Norway, Sweden, Denmark and Finland.</li>\n<li>DP-662 &#8211; Tested compatibility with WordPress 5.5 and Woocommerce 4.3.2</li>\n</ul>\n<p>2020.07.09 &#8211; version 4.7.0</p>\n<ul>\n<li>DP-659 &#8211; Updated SOAP and REST endpoints.</li>\n</ul>\n<p>2020.05.27 &#8211; version 4.6.0</p>\n<ul>\n<li>DP-621 &#8211; Tested compatibility with WordPress 5.4.1 and WooCommerce 4.1.0.</li>\n<li>DP-638 &#8211; Updated the AfterPay PHP Library to version 2.4.</li>\n<li>DP-644 &#8211; Updated the AfterPay PHP Library to version 2.5.</li>\n<li>DP-657 &#8211; Updated the AfterPay PHP Library to version 2.6.</li>\n<li>DP-490 &#8211; Added French translations for supporting the french speaking part of Belgium.</li>\n<li>DP-295 &#8211; Exclude payment method based on shipping method.</li>\n<li>DP-201 &#8211; Terms and conditions should always be visible for the Netherlands and Belgium.</li>\n<li>DP-575 &#8211; Changed order of bank details fields for DACH.</li>\n<li>DP-545 &#8211; Support Dutch &#8216;formal&#8217; language.</li>\n<li>DP-544 &#8211; Support configured language to used in the authorization for Belgium and Switzerland.</li>\n<li>DP-427 &#8211; Added functionality to notify admin about new AfterPay order.</li>\n<li>DP-658 &#8211; Add privacy statement text to Danish payment method.</li>\n</ul>\n<p>2020.01.08 &#8211; version 4.5.0</p>\n<ul>\n<li>DP-468 &#8211; Remove pending functionality / push status for Belgium including order update mail</li>\n<li>DP-552 &#8211; Hide capture status field when automatisc capturing is selected</li>\n<li>DP-605 &#8211; Add warning to not adjust Capture/Refund settings</li>\n<li>DP-221 &#8211; Use logo from CDN</li>\n</ul>\n<p>2019.11.14 &#8211; version 4.4.0</p>\n<ul>\n<li>Tested with WordPress 5.3 and WooCommerce 3.8.0</li>\n<li>DP-604 &#8211; Update to new version of PHP Library 2.2.0</li>\n<li>DP-595 &#8211; Add AfterPay logo in SVG format</li>\n<li>DP-607 &#8211; Sent in full first name instead of initials for NL and BE requests</li>\n</ul>\n<p>2019.05.27 &#8211; version 4.3.0</p>\n<ul>\n<li>Fixed issue showing all configuration options at start.</li>\n<li>DP-580 &#8211; Add duplicates of payment methods NL open invoice, NL open invoice B2b and DE open invoice for more flexibility.</li>\n<li>Tested with alpha release of WordPress 5.2.2 and Woocommerce 3.6.3.</li>\n</ul>\n<p>2019.01.29 &#8211; version 4.2.1</p>\n<ul>\n<li>DP-527 &#8211; Updated option for Customer Individual Score to enable and sent default value.</li>\n</ul>\n<p>2019.01.29 &#8211; version 4.2.0</p>\n<ul>\n<li>DP-532 &#8211; Fixed issue with special characters. Description in SOAP is now only allowed on A-Z, a-z, 0-9, space, dash.</li>\n<li>DP-532 &#8211; Updated to version 2.0.0 of the AfterPay PHP Library</li>\n</ul>\n<p>2019.01.09 &#8211; version 4.1.1</p>\n<ul>\n<li>Changed copyright to 2018</li>\n<li>DP-538 &#8211; Adjustments for Dutch low vat class.</li>\n<li>DP-518 &#8211; Advanced settings should not be shown by default</li>\n<li>DP-541 &#8211; Base max order limit on whole cart including shipping and payment fee</li>\n<li>DP-533 &#8211; Fixed issue with housenumber addition</li>\n</ul>\n<p>2018.12.10 &#8211; version 4.1.0</p>\n<ul>\n<li>Tested with alpha release of WordPress 5.0.1.</li>\n<li>DP-516 &#8211; Upgraded to version 1.9 of the AfterPay PHP Library</li>\n<li>DP-493 &#8211; Add sandbox as extra webservice to communicate with</li>\n</ul>\n<p>2018.11.20 &#8211; version 4.0.3</p>\n<ul>\n<li>Tested with beta version of WordPress 5.0.-beta5</li>\n</ul>\n<p>2018.11.07 &#8211; version 4.0.2</p>\n<ul>\n<li>DP-504 &#8211; Fixed problem activating plugin in WordPress Multisite Network</li>\n<li>DP-506 &#8211; Test compatibility with Woocommerce version 3.5.1</li>\n</ul>\n<p>2018.10.18 &#8211; version 4.0.1</p>\n<ul>\n<li>DP-481 &#8211; Problem with address fields of MyParcel, seperate address fields for shipping were used, causing validation errors.</li>\n<li>DP-240 &#8211; Use address fields of pickup point location provided by MyParcel</li>\n<li>DP-329 &#8211; Minor translation updates for Norway open invoice and installments</li>\n</ul>\n<p>2018.09.27 &#8211; version 4.0.0</p>\n<ul>\n<li>DP-449 &#8211; Reworked module according to WordPress Coding Standards (New AfterPay Base and AfterPay Base Rest class where the payment methods are inherited on).</li>\n</ul>\n<p>2018.08.10 &#8211; version 3.8.0</p>\n<ul>\n<li>Compatible with WP 4.9.8 + Woocommerce 3.4.4</li>\n<li>DP-404 &#8211; Added compatibility for PostNL shipment and pickup point delivery address</li>\n<li>DP-384 &#8211; Added possibility to show or hide the gender in DACH</li>\n<li>DP-323 &#8211; Added profile tracking for DACH</li>\n<li>DP-321 &#8211; Added customer individual score for DACH</li>\n<li>DP-386 &#8211; Used new terms and conditions and privacy statement from CDN</li>\n<li>DP-141 &#8211; Added installments for Sweden</li>\n<li>DP-152 &#8211; Added installments for Finland</li>\n<li>DP-148 &#8211; Added installments for Norway</li>\n<li>DP-326 &#8211; Added &#8216;advanced configuration&#8217; to prevent mistakes or misconfigurations</li>\n<li>DP-325 &#8211; Used customerfacing message from webservice to show in case of address correction</li>\n<li>Cleaned up duplicate code in classes</li>\n<li>Updated coupon class to WordPress coding standards</li>\n</ul>\n<p>2018.06.26 &#8211; version 3.7.0</p>\n<ul>\n<li>DP-319 &#8211; All javascripts are loaded on all pages, even when AfterPay is not enabled</li>\n<li>DP-311 &#8211; Change Payment method description according to display guidelines</li>\n<li>DP-329 &#8211; Fixed correct conversation language for Norway, Sweden, Finland</li>\n<li>DP-396 &#8211; Default disable captures and refunds for NL and BE</li>\n<li>DP-141 and DP-152 &#8211; Added preparations for installments Sweden and Finland</li>\n<li>DP-308 &#8211; Enable StreetNumbers with additional letters</li>\n<li>DP-397 &#8211; Bug with Sendclound, when no shipping method is used</li>\n<li>DP-308 &#8211; Enable StreetNumbers with additional letters</li>\n<li>DP-140 &#8211; Add open invoice for Sweden</li>\n<li>DP-398 &#8211; Use correct payment terms and conditions for Dutch connections</li>\n<li>DP-399 &#8211; Fixed bug with order status when capturing is disabled</li>\n</ul>\n<p>2018.05.15 &#8211; version 3.6.0</p>\n<ul>\n<li>DP-226 &#8211; Added bankaccount validation</li>\n<li>DP-155 &#8211; Added direct debit for Germany</li>\n<li>DP-160 &#8211; Added direct debit for Austria</li>\n<li>DP-161 &#8211; Added direct debit for Switzerland</li>\n<li>DP-257 &#8211; Implemented new translations for Denmark</li>\n<li>DP-115 &#8211; Added compatibility with Sendcloud</li>\n<li>DP-256 &#8211; Woocommerce create option to capture based on status</li>\n<li>Updated to the latest AfterPay Library (1.7.0) + updated dependencies</li>\n<li>DP-269 &#8211; Postalcode plugin caused issue not sending shipping housenumber, build in check.</li>\n</ul>\n<p>2018.02.12 &#8211; version 3.5.1</p>\n<ul>\n<li>DP231 &#8211; Add check for product image to be filled with an url, otherwise sent empty string</li>\n<li>DP232 &#8211; Add check on vat calculation on product with a price of 0.</li>\n<li>Updated translations</li>\n</ul>\n<p>2018.02.07 &#8211; version 3.5.0</p>\n<ul>\n<li>Compatible with WP 4.9.4 + Woocommerce 3.3.1</li>\n<li>Updated to the latest AfterPay Library (1.6.0)</li>\n<li>DP-212 &#8211; Make address correction also respond on return code 200.101</li>\n<li>DP-135 &#8211; Added support for installments in Germany, Austria and Switzerland</li>\n<li>DP-135 &#8211; Added new transparent version of the logo</li>\n<li>DP-135 &#8211; Added new german translations for installments</li>\n<li>DP-135 &#8211; Fixed a bug with multiple items calculating the wrong tax amount for REST calls.</li>\n<li>DP-210 &#8211; Implement product images and product urls for OneAPI connections</li>\n<li>DP-140 &#8211; Add open invoice for Sweden (still disabled because of translations)</li>\n<li>DP-147 &#8211; Add open invoice for Denmark (still disabled because of translations)</li>\n<li>DP-149 &#8211; Add open invoice for Norway (still disabled because of translations)</li>\n<li>DP-150 &#8211; Add open invoice for Finland (still disabled because of translations)</li>\n</ul>\n<p>2017.10.20 &#8211; version 3.3.0</p>\n<ul>\n<li>DP-113 &#8211; Updated to the latest AfterPay Library (1.4.0)</li>\n<li>DP-109 &#8211; Checked compatibility WordPress 4.8.2</li>\n<li>DP-112 &#8211; Checked compatibility Woocommerce version 3.2.1</li>\n<li>DP-29 &#8211; Fixed IP Restriction Bug</li>\n<li>DP-96 &#8211; Added gender as optional field for payment methods NL Open Invoice, NL Direct Debit and BE Open Invoice</li>\n<li>DP-110 &#8211; Fields for housenumber and housenumber addition are now configurable</li>\n</ul>\n<p>2017.10.12 &#8211; version 3.2.0</p>\n<ul>\n<li>Compatible with WP 4.8.2 + Woocommerce 3.1.2</li>\n<li>Update to latest version of AfterPay Library 1.3.0</li>\n<li>Added configuration option to show or hide terms and conditions</li>\n<li>DE: Add a configurable information field to the checkout which can be used for extra information to the customer</li>\n<li>Compatible with Germanized Plugin version (1.9.1), compatible with gender selection and payment fee.</li>\n<li>DE: When an order is rejected the payment will be failed but the order will not be cancelled, to make new payment on the same order possible</li>\n<li>Tested compatibility with Pronamic Pay plugin (4.6.0)</li>\n<li>Placed disclaimer for capture and refund option in the configuration</li>\n<li>Added fallback to addressline 2 when housenumber is used in the second field for address</li>\n<li>Added code cleanup and PHP docblocks for release</li>\n<li>Add &#8216;Call to action&#8217; on payment methods to get in contact with the sales department</li>\n<li>Add AfterPay Austria as a payment method</li>\n<li>Add AfterPay Switserland as a payment method</li>\n<li>DE: Sending VAT amounts and percentage in the request</li>\n<li>Updated German translations</li>\n</ul>\n<p>2017.10.06 &#8211; version 3.1.1</p>\n<ul>\n<li>Hotfix: removed discount rule</li>\n</ul>\n<p>2017.09.12 &#8211; version 3.1.0</p>\n<ul>\n<li>compatible with WP 4.8.1 + Woocommerce 3.1.2</li>\n<li>Update to latest version of AfterPay Library (1.2.9)</li>\n<li>Added capture and refund functionality to all payment options</li>\n<li>Added small updates and bugfixes to AfterPay Germany as a result of intensive testing</li>\n<li>Show country under address in address correction (AfterPay DE)</li>\n<li>Code cleanup</li>\n</ul>\n<p>2017.07.26 &#8211; version 3.0.0</p>\n<ul>\n<li>compatible with WP 4.8 + Woocommerce 3.1.1</li>\n<li>Updated code to Woocommerce 3.0 standards, solved deprecation errors</li>\n<li>Fixed bug in overview of payment methods</li>\n<li>Removed merchantid and password check for availability</li>\n<li>Added availability check if not logged in as admin</li>\n<li>Update to latest version of AfterPay Library (1.2.8)</li>\n<li>NL: Check all dutch validation messages in dutch</li>\n<li>Remove text with amount limits in checkout</li>\n<li>Make it possible to restrict on multiple IP addresses (seperated by comma)</li>\n<li>Removed unneccesary javascript, composer files</li>\n<li>Added https to terms and conditions urls</li>\n</ul>\n<p>2017.06.19 &#8211; version 2.9.1</p>\n<ul>\n<li>Bugfix for problem with showing wordpress menus in combination with this extension</li>\n</ul>\n<p>2017.05.10 &#8211; version 2.9</p>\n<ul>\n<li>Used new version of the AfterPay Library (1.2.0 https://bitbucket.org/afterpay-plugins/afterpay-composer-package)</li>\n<li>Because of new AfterPay Library names with special characters can be used</li>\n<li>Removed gender from fields</li>\n<li>From this version it is mandatory for customers to agree to the terms and conditions of AfterPay</li>\n<li>compatible with WP 4.7.4 + WooCommerce 3.0.5</li>\n</ul>\n<p>2017.01.05 &#8211; version 2.8</p>\n<ul>\n<li>The year selectbox of the date of birth field are now starting at the current year minus 18 years and arranged from newest year to oldest year.</li>\n<li>Removed css from checkout and changed field order</li>\n<li>When a validation error occurs, than the order will not be cancelled</li>\n<li>Added new copyright notice</li>\n<li>Updated AfterPay core library to 1.1.8</li>\n<li>compatible with WP 4.7 + WooCommerce 2.6.11</li>\n</ul>\n<p>2016.09.05 &#8211; version 2.7</p>\n<ul>\n<li>fix for validations in Belgium</li>\n<li>used updated version of composer library</li>\n</ul>\n<p>2016.08-26 &#8211; version 2.6</p>\n<ul>\n<li>fix for default country, removed option to base housenumber on default country</li>\n<li>fix for calculation of tax rate for shipping based on tax amount</li>\n</ul>\n<p>2016.08.09 &#8211; version 2.5</p>\n<ul>\n<li>fix for housenumberaddition, now works with space (10 a), nospace (10a), special chars (- + , | )</li>\n<li>fix for vat category when rounding errors</li>\n<li>translation for validation problem with bankaccount numbers</li>\n</ul>\n<p>2016.06.13 &#8211; version 2.4</p>\n<ul>\n<li>fix for issue where housenumber and housenumberaddition are not send separately</li>\n<li>fix for issue where B2B orders fail due to missing gender field</li>\n<li>removed unneeded B2B fields</li>\n<li>fix for order status not updating on Belgium orders, using WP 4.5.3</li>\n<li>added Dutch translations for all error messages</li>\n<li>compatible with WP 4.5.3 + WooCommerce 2.6.2</li>\n</ul>\n<p>2016.04.05 &#8211; version 2.3</p>\n<ul>\n<li>Removed automatic update functionality to comply Woocommerce Standards</li>\n<li>Tested compatibility with Woocommerce 2.5.5</li>\n<li>Core AfterPay Class = Composer / Packagist class 1.0.8: https://packagist.org/packages/payintegrator/afterpay</li>\n<li>Changed naming and description of payment methods</li>\n<li>Removed changable option for description</li>\n<li>Removed OsPinto dBug Class</li>\n<li>Added most recent AfterPay Logo</li>\n</ul>\n<p>2016.02-09 &#8211; version 2.2</p>\n<ul>\n<li>Added AfterPay NL Business 2 Business</li>\n<li>Tested compatibility with Woocommerce 2.4.2</li>\n<li>Several small bugfixes</li>\n</ul>\n<p>2015.06.11 &#8211; version 2.1</p>\n<ul>\n<li>Added automatic update functionality</li>\n</ul>\n<p>2015.06.04 &#8211; version 2.0.2</p>\n<ul>\n<li>Added AfterPay Belgium</li>\n<li>Update validation errors</li>\n<li>Added posibility for showing phone number</li>\n<li>Added posibility for ip restriction in testing</li>\n<li>Added better way for requesting client IP address</li>\n<li>Tested compatibility with Woocommerce 2.3.0</li>\n<li>Several small bugfixes</li>\n</ul>\n<p>2015.04.22 &#8211; version 1.9.1</p>\n<ul>\n<li>Fixed add_error problems</li>\n<li>Fixed several php warning problems</li>\n</ul>\n<p>2015.04.13 &#8211; version 1.9</p>\n<ul>\n<li>Fixed add_error problems</li>\n</ul>\n<p>2015.01.19 &#8211; version 1.8</p>\n<ul>\n<li>Added compatibility with http://www.woothemes.com/products/sequential-order-numbers-pro/</li>\n</ul>\n<p>2014.10.07 &#8211; version 1.7</p>\n<ul>\n<li>Removed surcharge code, advice to use https://wordpress.org/plugins/woocommerce-add-extra-charges-option-to-payment-gateways/</li>\n<li>Fixed WP DEBUG messages</li>\n</ul>\n<p>2014.05.06 &#8211; version 1.6</p>\n<ul>\n<li>Code cleaned and set to WooCommerce standards. Also added default gateway to extend other payment methods. And payment fee added to cart.</li>\n</ul>\n<p>2014.04.30 &#8211; version 1.5</p>\n<ul>\n<li>Added AfterPay Direct Debit</li>\n<li>Fixed invoice fee, added as new surcharge method. Now visible in checkout.</li>\n</ul>\n<p>2014.04.24 &#8211; version 1.4</p>\n<ul>\n<li>Fixed issue with invoice fee, only added with AfterPay orders</li>\n<li>Correct response for validation errors</li>\n</ul>\n<p>2014.04.10 &#8211; version 1.3</p>\n<ul>\n<li>Added phone number format to AfterPay Library</li>\n</ul>\n<p>2014.04.10 &#8211; version 1.2</p>\n<ul>\n<li>Fixed return url problem</li>\n</ul>\n<p>2014.02.11 &#8211; version 1.1</p>\n<ul>\n<li>Removed bankaccount number for SEPA</li>\n</ul>\n<p>2013.06.19 &#8211; version 1.0</p>\n<ul>\n<li>First Release</li>\n</ul>\n"
    },
    "short_description": "Riverty is the most consumer-friendly BNPL payment method in Germany, Austria, Switzerland, the Nordics, Netherlands and Belgium.",
    "description": "<p>With a growing range of Buy now, pay later (BNPL) payment solutions, Riverty offers you and your online shoppers an outstanding webshop experience. You get simple and fast integration plus the guarantee of being paid, while your customers get more freedom, safety and security. It’s win-win for you and your customers.</p>\n<p>Riverty makes you be even more successful by optimizing your payment method mix and helping consumers complete their checkout. For example, Riverty’s Buy now, pay later offering meets a growing need, as 25% of European online shoppers have already used this payment solution, and 50% confirm they are considering doing so in the future.</p>\n<p><a href=\"https://www.riverty.com/en/business/products/get-started-riverty-buy-now-pay-later/\" rel=\"nofollow ugc\">Get started with Riverty Payments</a></p>\n<h4>Riverty is the new AfterPay</h4>\n<p>Riverty offers a totally new perspective on financial sustainability, as it now includes all our smart and contemporary payment and receivables management solutions. By starting from the real needs and financial wellbeing of consumers, we enable merchants, partners and consumers to live their best financial life in a rapidly changing world.</p>\n<h4>The benefits of choosing Riverty</h4>\n<h4>Fast &amp; easy set-up</h4>\n<p>Are you ready for Riverty payment solutions? Follow the straight-forward instructions and receive confirmation quickly. Follow our installation and setup guidelines to get started.</p>\n<h4>Payment solutions designed for you</h4>\n<p>Seamless integration with your webshop is guaranteed as our plugin is designed for your platform.</p>\n<h4>A direct connection to Riverty with no PSP in between</h4>\n<p>With a direct connection to Riverty, you have full control of the integration. You will also receive regular updates concerning support, functionality and security.</p>\n<h4>Lifetime support</h4>\n<p>If ever you need help, we’re there to help you. Got a question: get in touch and we will sort you out as fast as we can.</p>\n<h4>Easy order management (capturing &amp; refunding)</h4>\n<p>Riverty’s smart order management process makes it easy to manage payments and refunds of items paid with Riverty. By easily capturing previously authorized funds, voiding an unsettled transaction, or doing a full or partial refund of a settled transaction, Riverty’s order management system enables you to manage all transactions that happen for an order.</p>\n<h4>Always know what’s going on</h4>\n<p>Our merchant dashboard helps you keep track of orders, returns and invoices.</p>\n<h4>Your brand in the spotlight</h4>\n<p>While our consumer-focused tools; the Riverty app (Google Play Store and Apple App Store) &amp; MyRiverty offer more freedom and transparency to shoppers, they also ensure you as a merchant have more opportunities and touchpoints to interact with your shoppers as your brand remains in the spotlight.</p>\n<h4>A broad range of payment methods</h4>\n<p>With our seamless integration you can quickly get started with the payment options you want to offer (depending on the countries your webshop operates in).</p>\n<ul>\n<li><strong>14-day invoice</strong> &#8211; Available in every market, 14-day Invoice is the default payment method of Riverty. It is primary designed for business-to-consumer sales.</li>\n<li><strong>Instalments</strong> &#8211; This is a Part Payment invoice. The customer can split their purchase over multiple monthly payments.</li>\n<li><strong>Direct Debit</strong> &#8211; This is a Direct Debit version of the 14-day invoice payment method. The consumers IBAN is collected at time of purchase in the check-out and the purchase amount is then debited from the consumer&#8217;s bank account once the goods have been delivered.</li>\n<li><strong>Campaign invoice</strong> &#8211; During peak seasons, such as Christmas, Black Friday, etc, merchants may use campaign invoicing. This gives shoppers extended payment terms per purchase with either fixed date (such as: 15. January) or floating (such as: in 60 days).</li>\n<li><strong>B2B invoice</strong> &#8211; This is the the Business to Business (B2B) version of the default 14-day invoice payment method of Riverty.</li>\n<li><strong>Flex</strong> &#8211; Flex offers to spread payments to the customers’ desired pace. Giving customers the ultimate freedom of payment customization. With this payment option consumers can adjust at any moment how and when they pay.</li>\n<li><strong>Pay in 3</strong> &#8211; Particularly popular with younger, financially stable audiences buying premium value goods, Pay in 3 splits the check-out amount into 3 interest-free payment parts for completion within 90 days.</li>\n</ul>\n<p>Riverty Payments are available in the following markets:</p>\n<ul>\n<li>Germany</li>\n<li>Austria</li>\n<li>Switzerland</li>\n<li>Netherlands</li>\n<li>Belgium</li>\n<li>Denmark</li>\n<li>Sweden</li>\n<li>Norway</li>\n<li>Finland.</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.7.1.5.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/afterpay-payment-gateway-for-woocommerce/assets/screenshot-1.png?rev=2811844",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/afterpay-payment-gateway-for-woocommerce/assets/screenshot-2.png?rev=2811844",
            "caption": ""
        }
    ],
    "tags": {
        "afterpay": "afterpay",
        "bnpl": "bnpl",
        "payment": "payment",
        "riverty": "riverty",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "7.1.5",
    "versions": {
        "4.0.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.0.0.zip",
        "4.0.1": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.0.1.zip",
        "4.0.2": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.0.2.zip",
        "4.0.3": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.0.3.zip",
        "4.1.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.1.0.zip",
        "4.1.1": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.1.1.zip",
        "4.2.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.2.0.zip",
        "4.2.1": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.2.1.zip",
        "4.3.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.3.0.zip",
        "4.4.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.4.0.zip",
        "4.5.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.5.0.zip",
        "4.6.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.6.0.zip",
        "4.7.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.7.0.zip",
        "4.8.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.8.0.zip",
        "4.9.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.4.9.0.zip",
        "5.0.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.5.0.0.zip",
        "5.1.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.5.1.0.zip",
        "5.2.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.5.2.0.zip",
        "5.3.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.5.3.0.zip",
        "5.4.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.5.4.0.zip",
        "5.5.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.5.5.0.zip",
        "5.6.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.5.6.0.zip",
        "5.7.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.5.7.0.zip",
        "5.8.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.5.8.0.zip",
        "5.9.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.5.9.0.zip",
        "6.0.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.0.0.zip",
        "6.1.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.1.0.zip",
        "6.1.1": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.1.1.zip",
        "6.2.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.2.0.zip",
        "6.3.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.3.0.zip",
        "6.4.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.4.0.zip",
        "6.4.1": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.4.1.zip",
        "6.4.2": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.4.2.zip",
        "6.4.3": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.4.3.zip",
        "6.5.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.5.0.zip",
        "6.6.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.6.0.zip",
        "6.6.1": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.6.1.zip",
        "6.6.2": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.6.2.zip",
        "6.7.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.7.0.zip",
        "6.7.1": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.7.1.zip",
        "6.8.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.8.0.zip",
        "6.9.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.6.9.0.zip",
        "7.0.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.7.0.0.zip",
        "7.1.0": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.7.1.0.zip",
        "7.1.1": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.7.1.1.zip",
        "7.1.2": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.7.1.2.zip",
        "7.1.3": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.7.1.3.zip",
        "7.1.4": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.7.1.4.zip",
        "7.1.5": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.7.1.5.zip",
        "trunk": "https://downloads.wordpress.org/plugin/afterpay-payment-gateway-for-woocommerce.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/afterpay-payment-gateway-for-woocommerce/assets/banner-772x250.png?rev=2811844",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/afterpay-payment-gateway-for-woocommerce/assets/icon-128x128.png?rev=2811844",
        "2x": "https://ps.w.org/afterpay-payment-gateway-for-woocommerce/assets/icon-256x256.png?rev=2811844"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}