{
    "name": "AliExpress Dropshipping Plugin – AliNext",
    "slug": "ali2woo-lite",
    "version": "3.4.3",
    "author": "<a href=\"https://ali2woo.com/dropshipping-plugin/\">Ali2Woo Team</a>",
    "author_profile": "https://profiles.wordpress.org/ali2woo/",
    "contributors": {
        "ali2woo": {
            "profile": "https://profiles.wordpress.org/ali2woo/",
            "avatar": "https://secure.gravatar.com/avatar/ec2673230220f5b92c3ddf88e06502eb?s=96&d=monsterid&r=g",
            "display_name": "ali2woo"
        }
    },
    "requires": "5.9",
    "tested": "6.6.1",
    "requires_php": "8.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 78,
    "ratings": {
        "5": 24,
        "4": 0,
        "3": 0,
        "2": 1,
        "1": 8
    },
    "num_ratings": 33,
    "support_url": "https://wordpress.org/support/plugin/ali2woo-lite/",
    "support_threads": 2,
    "support_threads_resolved": 2,
    "active_installs": 3000,
    "downloaded": 140550,
    "last_updated": "2024-08-26 10:39:00",
    "added": "2019-03-16",
    "homepage": "https://ali2woo.com/pricing/",
    "sections": {
        "description": "<p>This AliExpress Dropshipping Plugin for WooCommerce: Import products with reviews from AliExpress and fulfill orders automatically! It&#8217;s integrated with the AliExpress Affiliate Program, allowing you to earn more by selling affiliate products.</p>\n<p><a href=\"https://ali2woo.com/codex/\" rel=\"nofollow ugc\">Knowledge Base</a> | <a href=\"https://ali2woo.com/codex/aliexpress-dropshipping-chrome-extension/\" rel=\"nofollow ugc\">Chrome extension</a> | <a href=\"https://ali2woo.com/\" rel=\"nofollow ugc\">AliNext official website</a> | <a href=\"https://ali2woo.com/dropshipping-plugin/\" rel=\"nofollow ugc\">Full Version</a></p>\n<h3>How To Import Products from AliExpress using the Chrome extension?</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Lbq-_3j4vwk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>How To Use Global Pricing Rules?</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/N-GZ3EpJYiw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>How To Fulfill AliExpress Orders in Bulk?</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/S5368Pvo_F0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Compatibility with Woocommerce HPOS</h3>\n<p>Starting from version 3.1.3, AliNext is compatible with HPOS.<br />\nTo activate HPOS, follow these steps: go to Woocommerce -&gt; Settings -&gt; Advanced -&gt; Order data storage and select the &#8220;High-performance order storage (recommended)&#8221; option. Additionally, ensure that you have enabled the &#8220;Enable compatibility mode (synchronizes orders to the posts table)&#8221; option. Save your Woocommerce settings and confirm that all orders are synchronized by Woocommerce. If some orders are pending synchronization, you will see information about it there. Please wait until all orders are synchronized before using the AliNext plugin normally. For further information about HPOS <a href=\"https://woocommerce.com/posts/platform-update-high-performance-order-storage-for-woocommerce/\" rel=\"nofollow ugc\">refer official woocommerce article</a></p>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>You have to generate the access token (aliexpress token) to place or sync orders. You don&#8217;t need the token to import products. Please <a href=\"https://help.ali2woo.com/codex/how-to-get-access-token-from-aliexpress/\" rel=\"nofollow ugc\">follow our instruction</a> in order to generate token.</p>\n</li>\n<li>\n<p>Your permalink structure must NOT be &#8220;Plain&#8221;</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES</h3>\n<p>&#9658; <strong>Import Products</strong>:</p>\n<p>This aliexpress dropshipping plugin imports products from AliExpress with several methods: via a built-in search module or through the free chrome extension. Additionally, it can pull products from selected categories or store pages on AliExpress. Also, if you want to import a specific product only, you can use AliExpress product ID or AliExpress product URL to do that.</p>\n<ul>\n<li>\n<p><strong>Import from single product page</strong></p>\n</li>\n<li>\n<p><strong>Import from category page</strong></p>\n</li>\n<li>\n<p><strong>Import from store page</strong></p>\n</li>\n</ul>\n<p>&#9658; <strong>Import All Products of specific AliExpress seller or store</strong>:</p>\n<p>The plugin has a separate page allowing you to search for products in specific AliExpress store or seller. Often it helps if you find some store on AliExpress and want to pull all items form the store.</p>\n<p>See a detailed guide on this topic <a href=\"https://help.ali2woo.com/codex/how-to-import-all-products-from-the-store/\" rel=\"nofollow ugc\">HERE.</a></p>\n<p>&#9658; <strong>Load product categories from AliExpress</strong>:</p>\n<p>The plugin has a feature to import product categories from AliExpress. It saves you time from having to build the category tree yourself. When the plugin imports the categories, it automatically assigns them to the appropriate imported products.</p>\n<p>For further information, please check our <a href=\"https://help.ali2woo.com/alinext-kb/how-to-set-category-for-imported-products/\" rel=\"nofollow ugc\">instruction.</a></p>\n<p>&#9658; <strong>Split product variants into separate products</strong>:</p>\n<p>The plugin allows splitting product variants. For example: a lot of products on AliExpress come with the &#8220;ShipFrom&#8221; attribute. Often dropshippers don&#8217;t want to show this variant for customers. With this feature it&#8217;s possible to split such a product by the &#8220;ShipFrom&#8221; attribute. As result you will get separate products without it.</p>\n<p>Please look through the <a href=\"https://ali2woo.com/codex/how-to-split-product-variants-video/\" rel=\"nofollow ugc\">this article</a> to understand clearly how splitting feature works.</p>\n<p>&#9658; <strong>Remove &#8220;Ship From&#8221; attribute automatically</strong>: save your time, you don’t need to edit the &#8220;Shipping From&#8221; attribute for each product one by one, AliNext will do that automatically for you!</p>\n<p>Check out an article from the plugin Knowledge Base to know <a href=\"https://help.ali2woo.com/codex/how-to-hide-the-ship-from-attribute-from-product-page/\" rel=\"nofollow ugc\">how to use this feature.</a></p>\n<p>&#9658; <strong>Override product supplier</strong>:</p>\n<p>The product override feature is very helpful if you get a new order for the out-of-stock product and want to fulfill the order from another supplier or vendor on AliExpress.<br />\nAlso it helps if you have a product that was loaded through other dropshipping tool or it was added manually in Woocommerce and you want to connect the product to some AliExpress item using AliNext</p>\n<p>Check out an article from the plugin Knowledge Base to know <a href=\"https://ali2woo.com/codex/how-to-change-the-product-supplier/\" rel=\"nofollow ugc\">how to use this feature.</a></p>\n<p>&#9658; <strong>Change product images through the built-in image editor</strong>:</p>\n<p>Have you ever noticed the most product images having seller’s logo on AliExpress? And when you import the products into your store, those watermarks are visible for your customers. We know about such a problem and added a built-in images editor to the plugin`s features. The image tool allows to adjust photos right in your WordPress Dashboard.</p>\n<p>It&#8217;s recommended to check a detailed article <a href=\"https://ali2woo.com/codex/how-to-hide-watermark-on-images-from-aliexpress/\" rel=\"nofollow ugc\">about the image editor tool.</a></p>\n<p>&#9658; <strong>Configure settings for all imported products</strong>:</p>\n<p>This set of settings apply to all products imported from AliExpress. Go to AliNext Settings &gt; Common Settings &gt; Import Settings.</p>\n<ul>\n<li>\n<p><strong>Language</strong>: Set language of product data such as title, description, variations, attributes, etc. Our plugin supports all languages which available on AliExpress.</p>\n</li>\n<li>\n<p><strong>Currency</strong>: Change the currency of products. AliNxt supports all currencies which AliExpress portal operates with.</p>\n</li>\n<li>\n<p><strong>Default product type</strong>: By default the plugin imports product as &#8220;Simple/Variable product&#8221;. In this case, shoppers will stay on your website when they make a purchase else choose the &#8220;External/Affiliate Product&#8221; option and your visitors will be redirected to AliExpress to finish the purchase.</p>\n</li>\n<li>\n<p><strong>Default product status</strong>: Choose the &#8220;Draft&#8221; option and imported products will not be visible on your website frontend.</p>\n</li>\n<li>\n<p><strong>Not import specifications</strong>: Turn this feature on if you&#8217;d NOT like to import product attributes from AliExpress. You can see these attributes in the &#8220;specifications&#8221; tab on the AliExpress website.</p>\n</li>\n<li>\n<p><strong>Not import description</strong>: Enable this feature if you don&#8217;t want to import product description from AliExpress.</p>\n</li>\n<li>\n<p><strong>Don&#8217;t import images from the description</strong>: If you want to skip images from the product description and don&#8217;t import them to the wordpress media library, use this option.</p>\n</li>\n<li>\n<p><strong>Use external image urls</strong>: By default, the plugin keeps product images on your server. If you want to save free space on your server,<br />\nactivate this option and the plugin will load an image using an external AliExpress URL. Please note: This feature works if the plugin is active only!</p>\n</li>\n<li>\n<p><strong>Use random stock value</strong>: By default the plugin imports the original stock level value. Some sellers on AliExpress set very high value and it doesn&#8217;t look natural. To solve the issue just enable the feature. It forces the plugin to generate stock level value automatically and choose it from a predefined range.</p>\n</li>\n<li>\n<p><strong>Import in the background</strong>: Enable this feature and allow the plugin to import products in a background mode. In this case, each product is loaded in several stages. First, the plugin imports main product data such as: title, description, and attributes, and in the second stage, it imports product images and variants. This feature speeds up the import process extremely. Please note: In the first stage a product is published with the &#8220;draft&#8221; status and then when all product data is loaded the product status is changed to &#8220;published&#8221;.</p>\n</li>\n<li>\n<p><strong>Allow product duplication</strong>: Allow the import of an already imported product. This can be useful when you want to override a product with the same product.</p>\n</li>\n<li>\n<p><strong>Convert case of attributes and their values</strong>: Products may come with different text case of attributes and their values. Enbale this feature to covert all texts to the same case.</p>\n</li>\n<li>\n<p><strong>Remove &#8220;Ship From&#8221; attribute</strong>: Use this feature to remove the &#8220;Ship From&#8221; attribute automatically during product import.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Set options related to the order fulfillment process</strong>:</p>\n<p>These settings allow changing an order status after the order is placed on AliExpress. Go to AliNext Settings &gt; Common Settings &gt; Order Fulfillment Settings.</p>\n<ul>\n<li>\n<p><strong>Delivered Order Status</strong>: Change order status when all order items have been delivered.</p>\n</li>\n<li>\n<p><strong>Shipped Order Status</strong>: Change order status when all order items have been shipped.</p>\n</li>\n<li>\n<p><strong>Placed Order Status</strong>: Change order status when order is placed.</p>\n</li>\n<li>\n<p><strong>Default shipping method</strong>: If possible, the extension auto-select the shipping method on AliExpress during an order fulfillment process.</p>\n</li>\n<li>\n<p><strong>Override phone number</strong>: The extension will use these phone code and number instead of the real phone provided by your customer.</p>\n</li>\n<li>\n<p><strong>Custom note</strong>: Set a note for a supplier on the AliExpress.</p>\n</li>\n<li>\n<p><strong>Transliteration</strong>: Enable the auto-transliteration of AliExpress order details such as first name, last name, address, etc.</p>\n</li>\n<li>\n<p><strong>Middle name field</strong>: Adds the Middle name field to WooCommerce checkout page in your store. The extension uses the field data during an order-fulfillment process on AliExpress.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Earn more with AliExpress Affiliate program</strong>:</p>\n<p>On this setting page, you can connect your store to AliExpress Affiliate program. You can connect to the program using your AliExpress, Admitad, or EPN account.<br />\nGo to AliNext Settings &gt; Account Settings.</p>\n<p>We have a detailed guide on how to connect to the AliExpress Affiliate program <a href=\"https://ali2woo.com/codex/account-settings/\" rel=\"nofollow ugc\">HERE</a></p>\n<p>&#9658; <strong>Set up global pricing rules for all products</strong>:</p>\n<p>These options allow setting markup over AliExpress prices. You can add separate markup formula for each pricing range. The formula is a rule of a price calculation that includes different math operators such as +, *, =. Pricing rules support three different modes that manage the calculation in your formulas. Additionally, you can add cents to your prices automatically. And even more, it&#8217;s easy to apply your pricing rules to already imported products.</p>\n<p>Go to AliNext Settings &gt; Pricing Rules.</p>\n<p>Also, read a detailed post about <a href=\"https://ali2woo.com/codex/pricing-markup-formula/\" rel=\"nofollow ugc\">global pricing rules.</a></p>\n<p>&#9658; <strong>Filter or delete unnecessary text from AliExpress product</strong>:</p>\n<p>Here you can filter all unwanted phrases and text from AliExpress product. It allows adding unlimited rules to filter the texts. These rules apply to the product title, description, attributes, and reviews. Please note the plugin checks your text in case-sensitive mode.</p>\n<p>Go to AliNext Settings &gt; Phrase Filtering.</p>\n<p>See a detailed guide on this topic <a href=\"https://ali2woo.com/codex/phrase-filtering/\" rel=\"nofollow ugc\">HERE.</a></p>\n<p>&#9658; <strong>Import reviews from AliExpress</strong>:</p>\n<p>Import product reviews quickly from AliExpress, skip unwanted reviews, import translated version of the reviews or reviews related to a paticular country.</p>\n<p>Go to AliNext Settings &gt; Reviews settings.</p>\n<p>Check out a detailed guide about <a href=\"https://ali2woo.com/codex/importing-reviews/\" rel=\"nofollow ugc\">reviews settings.</a></p>\n<p>Please note: in the lite plugin version all reviews options are available except &#8220;Import more reviews automatically&#8221;. That option is available in the Pro version (read below please).</p>\n<p>&#9658; <strong>Add Shipping cost to your pricing markup</strong>:</p>\n<p>Use this feature to increase your margin by including shipping cost to the product price.</p>\n<p>Go to AliNext Settings &gt; Pricing Rules &gt; Add shipping cost.</p>\n<p>See a detailed guide on this topic <a href=\"https://ali2woo.com/codex/pricing-markup-formula/#shipping\" rel=\"nofollow ugc\">HERE.</a></p>\n<p>&#9658; <strong>Automatically place orders on AliExpress through the AliExpress API</strong>:</p>\n<p>Go to AliNext Settings &gt; Account Settings and click &#8220;Get Access Token&#8221;. AliExpress portal will ask your permission to place orders via API. Accept it and then the feature will be activated! Go to your Woocomemrce orders list page and try to place your objects, you will see that now you can place it via API very fast.</p>\n<p>See a detailed guide on this topic <a href=\"https://help.ali2woo.com/codex/fulfill-orders-using-aliexpress-api/\" rel=\"nofollow ugc\">HERE.</a></p>\n<p>Please note: In the lite plugin version you have a limit of 20 orders operations per day. So you can place or sync 20 orders max per day. You can increase limit using Pro version.</p>\n<p>&#9658; <strong>Sync orders with AliExpress through the AliExpress API</strong>:<br />\nThis feature allow you to update shipping tracking information automatically.<br />\nPlease note: In the lite plugin version you have a limit of 10 orders operations per day. So you can place or sync 10 orders max per day. You can increase limit using Pro version.</p>\n<h3>PRO VERSION</h3>\n<ul>\n<li>\n<p><strong>All features from the free version</strong></p>\n</li>\n<li>\n<p><strong>6 months of Premium support</strong></p>\n</li>\n<li>\n<p><strong>Lifetime update</strong></p>\n</li>\n</ul>\n<p>&#9658; <strong>Find best products using built-in search tool</strong>:</p>\n<p><strong>[pro version feature]</strong> Get more search requests to find the best products for your store. In contrast to AliNext Lite allowing you to make only 100 operations per day.</p>\n<p>&#9658; <strong>Find all products of the specific store or seller on AliExpress</strong>:</p>\n<p><strong>[pro version feature]</strong> Get more search requests to find the best products of specific AliExpress store or seller. In contrast to AliNext Lite allowing you to make only 100 operations per day.</p>\n<p>&#9658; <strong>Load whole category tree from AliExpress</strong>:</p>\n<p><strong>[pro version feature]</strong> Get more category requests to load whole category tree from AliExpress. In contrast to AliNext Lite allowing you to make only 5 such requests per day.</p>\n<p>&#9658; <strong>Fast Order fulfillment using API</strong>:</p>\n<p><strong>[pro version feature]</strong> Place more orders on AliExpress through the AliExpress API. In contrast to AliNext Lite allowing you to place ONLY 10 orders using the API.</p>\n<p>&#9658; <strong>Sync Orders using API</strong>:</p>\n<p><strong>[pro version feature]</strong> Sync more orders with AliExpress through the AliExpress API. In contrast to AliNext Lite allowing you to sync ONLY 10 orders using the API.</p>\n<p>&#9658; <strong>Set options related to the product synchronization</strong>:</p>\n<p><strong>[pro version feature]</strong> This set of features allows synchronizing an imported product automatically with AliExpress. Also, you can set a specific action that applies to the product depending on change occurring on AliExpress.  Go to AliNext Settings &gt; Common Settings &gt; Schedule Settings.</p>\n<ul>\n<li>\n<p><strong>Aliexpress Sync</strong>: Enable product sync with AliExpress in your store. It can sync product price, quantity and variants.</p>\n</li>\n<li>\n<p><strong>When product is no longer available</strong>: Choose an action when some imported product is no longer available on AliExpress.</p>\n</li>\n<li>\n<p><strong>When variant is no longer available</strong>: Choose an action when some product variant becomes not available on AliExpress.</p>\n</li>\n<li>\n<p><strong>When a new variant has appeared</strong>: Choose an action when a new product variant appears on AliExpress.</p>\n</li>\n<li>\n<p><strong>When the price changes</strong>: Choose an action when the price of some imported product changes on AliExpress.</p>\n</li>\n<li>\n<p><strong>When inventory changes</strong>: Choose an action when the inventory level of some imported product changes on AliExress.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Get email alerts on product changes</strong>:</p>\n<p><strong>[pro version feature]</strong> Get email notification if product price, stock or availability change, also be alerted if new product variations appear on AliExpress.</p>\n<p>You can set email address for notifications and override the email template if needed. The plugin sends notification once per half-hour.</p>\n<p>&#9658; <strong>Sync reviews from AliExpress</strong>:</p>\n<p><strong>[pro version feature]</strong> Check for an appearance of new reviews in all imported products. Unlock &#8220;Import more reviews automatically&#8221; option in the review settings.</p>\n<p>&#9658; <strong>Import shipping methods from AliExpress and/or show shipping selection on your website frontend</strong>:</p>\n<p><strong>[pro version feature]</strong> Easily import delivery methods from AliExpress, set pricing rules to add your own margin over the original shipping cost, show shipping methods selection on the product page, cart page, checkout page.</p>\n<p>Go to AliNext Settings &gt; Shipping settings.</p>\n<p>See a detailed guide on this topic <a href=\"https://ali2woo.com/codex/shipping-settings/\" rel=\"nofollow ugc\">HERE.</a></p>\n<p><a href=\"https://ali2woo.com/dropshipping-plugin/\" rel=\"nofollow ugc\">GET PRO VERSION</a> or <a href=\"https://ali2woo.com/dropshipping-plugin/\" rel=\"nofollow ugc\">https://ali2woo.com/dropshipping-plugin/</a></p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"https://ali2woo.com/codex/\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h4>Minimum Requirements</h4>\n<ul>\n<li>PHP 8.0 or greater is recommended</li>\n<li>MySQL version 5.0 or greater</li>\n<li>WooCommerce 5.0.0+</li>\n</ul>\n<h4>Support</h4>\n<p>In case you have any questions or need technical assistance, get in touch with us through our <a href=\"https://support.ali2woo.com\" rel=\"nofollow ugc\">support center</a>.</p>\n<h4>Follow Us</h4>\n<ul>\n<li>The <a href=\"https://ali2woo.com/\" rel=\"nofollow ugc\">AliNext Plugin</a> official homepage.</li>\n<li>Follow AliNext on <a href=\"https://facebook.com/ali2woo\" rel=\"nofollow ugc\">Facebook</a> &amp; <a href=\"https://twitter.com/ali2woo\" rel=\"nofollow ugc\">Twitter</a>.</li>\n<li>Watch AliNext training videos on <a href=\"https://www.youtube.com/channel/UCmcs_NMPkHi0IE_x9UENsoA\" rel=\"nofollow ugc\">YouTube channel</a></li>\n<li>Other AliNext social pages: <a href=\"https://www.pinterest.ru/ali2woo/\" rel=\"nofollow ugc\">Pinterest</a>, <a href=\"https://www.instagram.com/ali2woo/\" rel=\"nofollow ugc\">Instagram</a>, <a href=\"https://www.linkedin.com/company/18910479\" rel=\"nofollow ugc\">LinkedIn</a></li>\n</ul>\n",
        "installation": "<h4>From within WordPress</h4>\n<ol>\n<li>Visit &#8216;Plugins &gt; Add New&#8217;</li>\n<li>Search for &#8216;AliNext Lite&#8217;</li>\n<li>Activate AliNext Lite from your Plugins page.</li>\n<li>Go to &#8220;after activation&#8221; below.</li>\n</ol>\n<h4>Manually</h4>\n<ol>\n<li>Upload the <code>alinext-lite</code> folder to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the Yoast SEO plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n<li>Go to &#8220;after activation&#8221; below.</li>\n</ol>\n",
        "changelog": "<h4>3.4.3 &#8211; 2024.08.26</h4>\n<ul>\n<li>Fix bug pricing rules type is not applied on choosing pricing set;</li>\n<li>Add compatibility with WooCommerce 9.2.*  </li>\n</ul>\n<h4>3.4.0 &#8211; 2024.08.01</h4>\n<ul>\n<li>Enhanced pricing rules module: ability to add a category to pricing rule (if category field is empty, then rule will apply to any category);</li>\n<li>Enhanced pricing rules module: ability to create Pricing rule sets. Set is a group of pricing rules and settings, you can create few sets and switch between then during sale. Don&#8217;t forget to use Apply pricing to exiting products feature after you switch to another pricing rule set;</li>\n<li>Fix image editor bug;</li>\n<li>Refactor legacy code and fix minor bugs; </li>\n</ul>\n<h4>3.3.9 &#8211; 2024.07.08</h4>\n<ul>\n<li>Enhanced plugin security by adding WordPress nonce to all Ajax methods</li>\n<li>Improved plugin security by checking user role in all plugin methods;</li>\n<li>Enhanced plugin security by escaping HTML input in template views;</li>\n<li>Improved plugin security by escaping SQL queries;</li>\n<li>Enhanced order fulfillment module to synchronize product shipping information when refreshing in the fulfillment popup;</li>\n<li>Fixed minor bugs and improve code style;</li>\n</ul>\n<h4>3.3.5 &#8211; 2024.06.13</h4>\n<ul>\n<li>Refactor import products from CSV.</li>\n<li>Enhance order fulfillment module; Now order is placed with country currency.</li>\n<li>Fix minor bugs.</li>\n</ul>\n<h4>3.3.3 &#8211; 2024.05.28</h4>\n<ul>\n<li>Fix plugin activation bug;</li>\n</ul>\n<h4>3.3.2 &#8211; 2024.05.27</h4>\n<ul>\n<li>Update background process library, add namespaces for the library;</li>\n<li>Fix bug with product last-update date;</li>\n<li>Add cancel button for all background processed;</li>\n<li>Add php max_execution_time check to system info page</li>\n<li>Fix minor bug, old code base refactor;</li>\n</ul>\n<h4>3.3.0 &#8211; 2024.05.20</h4>\n<ul>\n<li>Improve bulk price application script; Now you can close or refresh page when start the process;</li>\n<li>Add status bar for all backroud processes in order to make it more clear;</li>\n<li>Fix bug with product descriprtion images;</li>\n<li>Fix minor bug, old code base refactor;</li>\n</ul>\n<h4>3.2.8 &#8211; 2024.05.03</h4>\n<ul>\n<li>fix function saving images in image editor tool</li>\n<li>fix pricing rules bug in plugin backend</li>\n<li>fix product description loading</li>\n<li>update some plugin dependecies</li>\n<li>fix minor bugs</li>\n</ul>\n<h4>3.2.7 &#8211; 2024.04.10</h4>\n<ul>\n<li>add image type file check to built-in image editor</li>\n<li>add feature to load AliExpress category tree for imported product</li>\n<li>replace || with OR in sql queries as this format is  deprectated</li>\n<li>fix minor bugs</li>\n</ul>\n<h4>3.2.6 &#8211; 2024.04.04</h4>\n<ul>\n<li>fix built-in image editor</li>\n<li>fix chrome extension connection bug</li>\n<li>fix is-not-applied price bug</li>\n<li>fix minor bugs</li>\n</ul>\n<h4>3.2.4 &#8211; 2024.02.16</h4>\n<ul>\n<li>fix few deprecated (legacy) methods in code</li>\n<li>remove old Requests library from the code and use native Requests library from wordpress core</li>\n<li>fix Woocommerce 8.6.* compatibility bug</li>\n</ul>\n<h4>3.2.1 &#8211; 2024.01.13</h4>\n<ul>\n<li>fix chrome extension connection bug</li>\n<li>increase daily quota for order place and sync operations to 20 per day (for the lite plugin version)</li>\n</ul>\n<h4>3.2.0 &#8211; 2024.01.10</h4>\n<ul>\n<li>add feature to synchronize selected orders (see bulk actions)</li>\n<li>refactor plugin code to improve performance</li>\n<li>fix minor bugs and errors</li>\n</ul>\n<h4>3.1.4 &#8211; 2023.11.23</h4>\n<ul>\n<li>fix last update time on product update</li>\n<li>fix tracking_id param in aliexpress affiliate links</li>\n<li>fix some warnings related with old style function call</li>\n</ul>\n"
    },
    "short_description": "This AliExpress Dropshipping Plugin for WooCommerce: Import products with reviews from AliExpress and fulfill orders automatically! It&#039;s integrat &hellip;",
    "description": "<p>This AliExpress Dropshipping Plugin for WooCommerce: Import products with reviews from AliExpress and fulfill orders automatically! It&#8217;s integrated with the AliExpress Affiliate Program, allowing you to earn more by selling affiliate products.</p>\n<p><a href=\"https://ali2woo.com/codex/\" rel=\"nofollow ugc\">Knowledge Base</a> | <a href=\"https://ali2woo.com/codex/aliexpress-dropshipping-chrome-extension/\" rel=\"nofollow ugc\">Chrome extension</a> | <a href=\"https://ali2woo.com/\" rel=\"nofollow ugc\">AliNext official website</a> | <a href=\"https://ali2woo.com/dropshipping-plugin/\" rel=\"nofollow ugc\">Full Version</a></p>\n<h3>How To Import Products from AliExpress using the Chrome extension?</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Lbq-_3j4vwk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>How To Use Global Pricing Rules?</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/N-GZ3EpJYiw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>How To Fulfill AliExpress Orders in Bulk?</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/S5368Pvo_F0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Compatibility with Woocommerce HPOS</h3>\n<p>Starting from version 3.1.3, AliNext is compatible with HPOS.<br />\nTo activate HPOS, follow these steps: go to Woocommerce -&gt; Settings -&gt; Advanced -&gt; Order data storage and select the &#8220;High-performance order storage (recommended)&#8221; option. Additionally, ensure that you have enabled the &#8220;Enable compatibility mode (synchronizes orders to the posts table)&#8221; option. Save your Woocommerce settings and confirm that all orders are synchronized by Woocommerce. If some orders are pending synchronization, you will see information about it there. Please wait until all orders are synchronized before using the AliNext plugin normally. For further information about HPOS <a href=\"https://woocommerce.com/posts/platform-update-high-performance-order-storage-for-woocommerce/\" rel=\"nofollow ugc\">refer official woocommerce article</a></p>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>You have to generate the access token (aliexpress token) to place or sync orders. You don&#8217;t need the token to import products. Please <a href=\"https://help.ali2woo.com/codex/how-to-get-access-token-from-aliexpress/\" rel=\"nofollow ugc\">follow our instruction</a> in order to generate token.</p>\n</li>\n<li>\n<p>Your permalink structure must NOT be &#8220;Plain&#8221;</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES</h3>\n<p>&#9658; <strong>Import Products</strong>:</p>\n<p>This aliexpress dropshipping plugin imports products from AliExpress with several methods: via a built-in search module or through the free chrome extension. Additionally, it can pull products from selected categories or store pages on AliExpress. Also, if you want to import a specific product only, you can use AliExpress product ID or AliExpress product URL to do that.</p>\n<ul>\n<li>\n<p><strong>Import from single product page</strong></p>\n</li>\n<li>\n<p><strong>Import from category page</strong></p>\n</li>\n<li>\n<p><strong>Import from store page</strong></p>\n</li>\n</ul>\n<p>&#9658; <strong>Import All Products of specific AliExpress seller or store</strong>:</p>\n<p>The plugin has a separate page allowing you to search for products in specific AliExpress store or seller. Often it helps if you find some store on AliExpress and want to pull all items form the store.</p>\n<p>See a detailed guide on this topic <a href=\"https://help.ali2woo.com/codex/how-to-import-all-products-from-the-store/\" rel=\"nofollow ugc\">HERE.</a></p>\n<p>&#9658; <strong>Load product categories from AliExpress</strong>:</p>\n<p>The plugin has a feature to import product categories from AliExpress. It saves you time from having to build the category tree yourself. When the plugin imports the categories, it automatically assigns them to the appropriate imported products.</p>\n<p>For further information, please check our <a href=\"https://help.ali2woo.com/alinext-kb/how-to-set-category-for-imported-products/\" rel=\"nofollow ugc\">instruction.</a></p>\n<p>&#9658; <strong>Split product variants into separate products</strong>:</p>\n<p>The plugin allows splitting product variants. For example: a lot of products on AliExpress come with the &#8220;ShipFrom&#8221; attribute. Often dropshippers don&#8217;t want to show this variant for customers. With this feature it&#8217;s possible to split such a product by the &#8220;ShipFrom&#8221; attribute. As result you will get separate products without it.</p>\n<p>Please look through the <a href=\"https://ali2woo.com/codex/how-to-split-product-variants-video/\" rel=\"nofollow ugc\">this article</a> to understand clearly how splitting feature works.</p>\n<p>&#9658; <strong>Remove &#8220;Ship From&#8221; attribute automatically</strong>: save your time, you don’t need to edit the &#8220;Shipping From&#8221; attribute for each product one by one, AliNext will do that automatically for you!</p>\n<p>Check out an article from the plugin Knowledge Base to know <a href=\"https://help.ali2woo.com/codex/how-to-hide-the-ship-from-attribute-from-product-page/\" rel=\"nofollow ugc\">how to use this feature.</a></p>\n<p>&#9658; <strong>Override product supplier</strong>:</p>\n<p>The product override feature is very helpful if you get a new order for the out-of-stock product and want to fulfill the order from another supplier or vendor on AliExpress.<br />\nAlso it helps if you have a product that was loaded through other dropshipping tool or it was added manually in Woocommerce and you want to connect the product to some AliExpress item using AliNext</p>\n<p>Check out an article from the plugin Knowledge Base to know <a href=\"https://ali2woo.com/codex/how-to-change-the-product-supplier/\" rel=\"nofollow ugc\">how to use this feature.</a></p>\n<p>&#9658; <strong>Change product images through the built-in image editor</strong>:</p>\n<p>Have you ever noticed the most product images having seller’s logo on AliExpress? And when you import the products into your store, those watermarks are visible for your customers. We know about such a problem and added a built-in images editor to the plugin`s features. The image tool allows to adjust photos right in your WordPress Dashboard.</p>\n<p>It&#8217;s recommended to check a detailed article <a href=\"https://ali2woo.com/codex/how-to-hide-watermark-on-images-from-aliexpress/\" rel=\"nofollow ugc\">about the image editor tool.</a></p>\n<p>&#9658; <strong>Configure settings for all imported products</strong>:</p>\n<p>This set of settings apply to all products imported from AliExpress. Go to AliNext Settings &gt; Common Settings &gt; Import Settings.</p>\n<ul>\n<li>\n<p><strong>Language</strong>: Set language of product data such as title, description, variations, attributes, etc. Our plugin supports all languages which available on AliExpress.</p>\n</li>\n<li>\n<p><strong>Currency</strong>: Change the currency of products. AliNxt supports all currencies which AliExpress portal operates with.</p>\n</li>\n<li>\n<p><strong>Default product type</strong>: By default the plugin imports product as &#8220;Simple/Variable product&#8221;. In this case, shoppers will stay on your website when they make a purchase else choose the &#8220;External/Affiliate Product&#8221; option and your visitors will be redirected to AliExpress to finish the purchase.</p>\n</li>\n<li>\n<p><strong>Default product status</strong>: Choose the &#8220;Draft&#8221; option and imported products will not be visible on your website frontend.</p>\n</li>\n<li>\n<p><strong>Not import specifications</strong>: Turn this feature on if you&#8217;d NOT like to import product attributes from AliExpress. You can see these attributes in the &#8220;specifications&#8221; tab on the AliExpress website.</p>\n</li>\n<li>\n<p><strong>Not import description</strong>: Enable this feature if you don&#8217;t want to import product description from AliExpress.</p>\n</li>\n<li>\n<p><strong>Don&#8217;t import images from the description</strong>: If you want to skip images from the product description and don&#8217;t import them to the wordpress media library, use this option.</p>\n</li>\n<li>\n<p><strong>Use external image urls</strong>: By default, the plugin keeps product images on your server. If you want to save free space on your server,<br />\nactivate this option and the plugin will load an image using an external AliExpress URL. Please note: This feature works if the plugin is active only!</p>\n</li>\n<li>\n<p><strong>Use random stock value</strong>: By default the plugin imports the original stock level value. Some sellers on AliExpress set very high value and it doesn&#8217;t look natural. To solve the issue just enable the feature. It forces the plugin to generate stock level value automatically and choose it from a predefined range.</p>\n</li>\n<li>\n<p><strong>Import in the background</strong>: Enable this feature and allow the plugin to import products in a background mode. In this case, each product is loaded in several stages. First, the plugin imports main product data such as: title, description, and attributes, and in the second stage, it imports product images and variants. This feature speeds up the import process extremely. Please note: In the first stage a product is published with the &#8220;draft&#8221; status and then when all product data is loaded the product status is changed to &#8220;published&#8221;.</p>\n</li>\n<li>\n<p><strong>Allow product duplication</strong>: Allow the import of an already imported product. This can be useful when you want to override a product with the same product.</p>\n</li>\n<li>\n<p><strong>Convert case of attributes and their values</strong>: Products may come with different text case of attributes and their values. Enbale this feature to covert all texts to the same case.</p>\n</li>\n<li>\n<p><strong>Remove &#8220;Ship From&#8221; attribute</strong>: Use this feature to remove the &#8220;Ship From&#8221; attribute automatically during product import.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Set options related to the order fulfillment process</strong>:</p>\n<p>These settings allow changing an order status after the order is placed on AliExpress. Go to AliNext Settings &gt; Common Settings &gt; Order Fulfillment Settings.</p>\n<ul>\n<li>\n<p><strong>Delivered Order Status</strong>: Change order status when all order items have been delivered.</p>\n</li>\n<li>\n<p><strong>Shipped Order Status</strong>: Change order status when all order items have been shipped.</p>\n</li>\n<li>\n<p><strong>Placed Order Status</strong>: Change order status when order is placed.</p>\n</li>\n<li>\n<p><strong>Default shipping method</strong>: If possible, the extension auto-select the shipping method on AliExpress during an order fulfillment process.</p>\n</li>\n<li>\n<p><strong>Override phone number</strong>: The extension will use these phone code and number instead of the real phone provided by your customer.</p>\n</li>\n<li>\n<p><strong>Custom note</strong>: Set a note for a supplier on the AliExpress.</p>\n</li>\n<li>\n<p><strong>Transliteration</strong>: Enable the auto-transliteration of AliExpress order details such as first name, last name, address, etc.</p>\n</li>\n<li>\n<p><strong>Middle name field</strong>: Adds the Middle name field to WooCommerce checkout page in your store. The extension uses the field data during an order-fulfillment process on AliExpress.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Earn more with AliExpress Affiliate program</strong>:</p>\n<p>On this setting page, you can connect your store to AliExpress Affiliate program. You can connect to the program using your AliExpress, Admitad, or EPN account.<br />\nGo to AliNext Settings &gt; Account Settings.</p>\n<p>We have a detailed guide on how to connect to the AliExpress Affiliate program <a href=\"https://ali2woo.com/codex/account-settings/\" rel=\"nofollow ugc\">HERE</a></p>\n<p>&#9658; <strong>Set up global pricing rules for all products</strong>:</p>\n<p>These options allow setting markup over AliExpress prices. You can add separate markup formula for each pricing range. The formula is a rule of a price calculation that includes different math operators such as +, *, =. Pricing rules support three different modes that manage the calculation in your formulas. Additionally, you can add cents to your prices automatically. And even more, it&#8217;s easy to apply your pricing rules to already imported products.</p>\n<p>Go to AliNext Settings &gt; Pricing Rules.</p>\n<p>Also, read a detailed post about <a href=\"https://ali2woo.com/codex/pricing-markup-formula/\" rel=\"nofollow ugc\">global pricing rules.</a></p>\n<p>&#9658; <strong>Filter or delete unnecessary text from AliExpress product</strong>:</p>\n<p>Here you can filter all unwanted phrases and text from AliExpress product. It allows adding unlimited rules to filter the texts. These rules apply to the product title, description, attributes, and reviews. Please note the plugin checks your text in case-sensitive mode.</p>\n<p>Go to AliNext Settings &gt; Phrase Filtering.</p>\n<p>See a detailed guide on this topic <a href=\"https://ali2woo.com/codex/phrase-filtering/\" rel=\"nofollow ugc\">HERE.</a></p>\n<p>&#9658; <strong>Import reviews from AliExpress</strong>:</p>\n<p>Import product reviews quickly from AliExpress, skip unwanted reviews, import translated version of the reviews or reviews related to a paticular country.</p>\n<p>Go to AliNext Settings &gt; Reviews settings.</p>\n<p>Check out a detailed guide about <a href=\"https://ali2woo.com/codex/importing-reviews/\" rel=\"nofollow ugc\">reviews settings.</a></p>\n<p>Please note: in the lite plugin version all reviews options are available except &#8220;Import more reviews automatically&#8221;. That option is available in the Pro version (read below please).</p>\n<p>&#9658; <strong>Add Shipping cost to your pricing markup</strong>:</p>\n<p>Use this feature to increase your margin by including shipping cost to the product price.</p>\n<p>Go to AliNext Settings &gt; Pricing Rules &gt; Add shipping cost.</p>\n<p>See a detailed guide on this topic <a href=\"https://ali2woo.com/codex/pricing-markup-formula/#shipping\" rel=\"nofollow ugc\">HERE.</a></p>\n<p>&#9658; <strong>Automatically place orders on AliExpress through the AliExpress API</strong>:</p>\n<p>Go to AliNext Settings &gt; Account Settings and click &#8220;Get Access Token&#8221;. AliExpress portal will ask your permission to place orders via API. Accept it and then the feature will be activated! Go to your Woocomemrce orders list page and try to place your objects, you will see that now you can place it via API very fast.</p>\n<p>See a detailed guide on this topic <a href=\"https://help.ali2woo.com/codex/fulfill-orders-using-aliexpress-api/\" rel=\"nofollow ugc\">HERE.</a></p>\n<p>Please note: In the lite plugin version you have a limit of 20 orders operations per day. So you can place or sync 20 orders max per day. You can increase limit using Pro version.</p>\n<p>&#9658; <strong>Sync orders with AliExpress through the AliExpress API</strong>:<br />\nThis feature allow you to update shipping tracking information automatically.<br />\nPlease note: In the lite plugin version you have a limit of 10 orders operations per day. So you can place or sync 10 orders max per day. You can increase limit using Pro version.</p>\n<h3>PRO VERSION</h3>\n<ul>\n<li>\n<p><strong>All features from the free version</strong></p>\n</li>\n<li>\n<p><strong>6 months of Premium support</strong></p>\n</li>\n<li>\n<p><strong>Lifetime update</strong></p>\n</li>\n</ul>\n<p>&#9658; <strong>Find best products using built-in search tool</strong>:</p>\n<p><strong>[pro version feature]</strong> Get more search requests to find the best products for your store. In contrast to AliNext Lite allowing you to make only 100 operations per day.</p>\n<p>&#9658; <strong>Find all products of the specific store or seller on AliExpress</strong>:</p>\n<p><strong>[pro version feature]</strong> Get more search requests to find the best products of specific AliExpress store or seller. In contrast to AliNext Lite allowing you to make only 100 operations per day.</p>\n<p>&#9658; <strong>Load whole category tree from AliExpress</strong>:</p>\n<p><strong>[pro version feature]</strong> Get more category requests to load whole category tree from AliExpress. In contrast to AliNext Lite allowing you to make only 5 such requests per day.</p>\n<p>&#9658; <strong>Fast Order fulfillment using API</strong>:</p>\n<p><strong>[pro version feature]</strong> Place more orders on AliExpress through the AliExpress API. In contrast to AliNext Lite allowing you to place ONLY 10 orders using the API.</p>\n<p>&#9658; <strong>Sync Orders using API</strong>:</p>\n<p><strong>[pro version feature]</strong> Sync more orders with AliExpress through the AliExpress API. In contrast to AliNext Lite allowing you to sync ONLY 10 orders using the API.</p>\n<p>&#9658; <strong>Set options related to the product synchronization</strong>:</p>\n<p><strong>[pro version feature]</strong> This set of features allows synchronizing an imported product automatically with AliExpress. Also, you can set a specific action that applies to the product depending on change occurring on AliExpress.  Go to AliNext Settings &gt; Common Settings &gt; Schedule Settings.</p>\n<ul>\n<li>\n<p><strong>Aliexpress Sync</strong>: Enable product sync with AliExpress in your store. It can sync product price, quantity and variants.</p>\n</li>\n<li>\n<p><strong>When product is no longer available</strong>: Choose an action when some imported product is no longer available on AliExpress.</p>\n</li>\n<li>\n<p><strong>When variant is no longer available</strong>: Choose an action when some product variant becomes not available on AliExpress.</p>\n</li>\n<li>\n<p><strong>When a new variant has appeared</strong>: Choose an action when a new product variant appears on AliExpress.</p>\n</li>\n<li>\n<p><strong>When the price changes</strong>: Choose an action when the price of some imported product changes on AliExpress.</p>\n</li>\n<li>\n<p><strong>When inventory changes</strong>: Choose an action when the inventory level of some imported product changes on AliExress.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Get email alerts on product changes</strong>:</p>\n<p><strong>[pro version feature]</strong> Get email notification if product price, stock or availability change, also be alerted if new product variations appear on AliExpress.</p>\n<p>You can set email address for notifications and override the email template if needed. The plugin sends notification once per half-hour.</p>\n<p>&#9658; <strong>Sync reviews from AliExpress</strong>:</p>\n<p><strong>[pro version feature]</strong> Check for an appearance of new reviews in all imported products. Unlock &#8220;Import more reviews automatically&#8221; option in the review settings.</p>\n<p>&#9658; <strong>Import shipping methods from AliExpress and/or show shipping selection on your website frontend</strong>:</p>\n<p><strong>[pro version feature]</strong> Easily import delivery methods from AliExpress, set pricing rules to add your own margin over the original shipping cost, show shipping methods selection on the product page, cart page, checkout page.</p>\n<p>Go to AliNext Settings &gt; Shipping settings.</p>\n<p>See a detailed guide on this topic <a href=\"https://ali2woo.com/codex/shipping-settings/\" rel=\"nofollow ugc\">HERE.</a></p>\n<p><a href=\"https://ali2woo.com/dropshipping-plugin/\" rel=\"nofollow ugc\">GET PRO VERSION</a> or <a href=\"https://ali2woo.com/dropshipping-plugin/\" rel=\"nofollow ugc\">https://ali2woo.com/dropshipping-plugin/</a></p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"https://ali2woo.com/codex/\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h4>Minimum Requirements</h4>\n<ul>\n<li>PHP 8.0 or greater is recommended</li>\n<li>MySQL version 5.0 or greater</li>\n<li>WooCommerce 5.0.0+</li>\n</ul>\n<h4>Support</h4>\n<p>In case you have any questions or need technical assistance, get in touch with us through our <a href=\"https://support.ali2woo.com\" rel=\"nofollow ugc\">support center</a>.</p>\n<h4>Follow Us</h4>\n<ul>\n<li>The <a href=\"https://ali2woo.com/\" rel=\"nofollow ugc\">AliNext Plugin</a> official homepage.</li>\n<li>Follow AliNext on <a href=\"https://facebook.com/ali2woo\" rel=\"nofollow ugc\">Facebook</a> &amp; <a href=\"https://twitter.com/ali2woo\" rel=\"nofollow ugc\">Twitter</a>.</li>\n<li>Watch AliNext training videos on <a href=\"https://www.youtube.com/channel/UCmcs_NMPkHi0IE_x9UENsoA\" rel=\"nofollow ugc\">YouTube channel</a></li>\n<li>Other AliNext social pages: <a href=\"https://www.pinterest.ru/ali2woo/\" rel=\"nofollow ugc\">Pinterest</a>, <a href=\"https://www.instagram.com/ali2woo/\" rel=\"nofollow ugc\">Instagram</a>, <a href=\"https://www.linkedin.com/company/18910479\" rel=\"nofollow ugc\">LinkedIn</a></li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/ali2woo-lite.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/ali2woo-lite/assets/screenshot-1.png?rev=2051676",
            "caption": "The AliNext Lite dropshipping plugin build-in product search tool."
        },
        {
            "src": "https://ps.w.org/ali2woo-lite/assets/screenshot-2.png?rev=2051676",
            "caption": "The Import List page, here you can adjust the products before pushing them into WooCommerce store."
        },
        {
            "src": "https://ps.w.org/ali2woo-lite/assets/screenshot-3.png?rev=2051676",
            "caption": "Built-in image editor tool, easy way to remove supplier logos for the images."
        },
        {
            "src": "https://ps.w.org/ali2woo-lite/assets/screenshot-4.png?rev=2937468",
            "caption": "The AliNext Lite Setting page."
        },
        {
            "src": "https://ps.w.org/ali2woo-lite/assets/screenshot-5.png?rev=3129531",
            "caption": "Set up your pricing markups."
        },
        {
            "src": "https://ps.w.org/ali2woo-lite/assets/screenshot-6.png?rev=2937468",
            "caption": "Remove or replace unwanted text from the content imported from AliExpress"
        },
        {
            "src": "https://ps.w.org/ali2woo-lite/assets/screenshot-7.png?rev=2937468",
            "caption": "Feature to quick search for all products of the same seller/store from AliExpress"
        },
        {
            "src": "https://ps.w.org/ali2woo-lite/assets/screenshot-8.png?rev=2821434",
            "caption": ""
        }
    ],
    "tags": {
        "ali2woo": "ali2woo",
        "aliexpress-dropshipping": "aliexpress dropshipping",
        "dropship": "dropship",
        "dropshipping": "dropshipping"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/ali2woo-lite/assets/banner-772x250.jpg?rev=2937269",
        "high": "https://ps.w.org/ali2woo-lite/assets/banner-1544x500.jpg?rev=2469557"
    },
    "icons": {
        "1x": "https://ps.w.org/ali2woo-lite/assets/icon.svg?rev=2937269",
        "svg": "https://ps.w.org/ali2woo-lite/assets/icon.svg?rev=2937269"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 78,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}