{
    "name": "A.N.R.GHG Publishing Toolkit",
    "slug": "anrghg",
    "version": "1.16.5",
    "author": "<a href=\"https://anrghg.sunsite.fr\">ANRGHG</a>",
    "author_profile": "https://profiles.wordpress.org/anrghg/",
    "contributors": {
        "anrghg": {
            "profile": "https://profiles.wordpress.org/anrghg/",
            "avatar": "https://secure.gravatar.com/avatar/26e63c69bd3363a6dfc7db871ab59866?s=96&d=monsterid&r=g",
            "display_name": "ANRGHG"
        },
        "martinneumannat": {
            "profile": "https://profiles.wordpress.org/martinneumannat/",
            "avatar": "https://secure.gravatar.com/avatar/427924ad5ff5a7795d653c1dee787a08?s=96&d=monsterid&r=g",
            "display_name": "martinneumannat"
        },
        "milindmore22": {
            "profile": "https://profiles.wordpress.org/milindmore22/",
            "avatar": "https://secure.gravatar.com/avatar/96ed17b2c2030a6101119dfa6ed58b89?s=96&d=monsterid&r=g",
            "display_name": "Milind More"
        },
        "misfist": {
            "profile": "https://profiles.wordpress.org/misfist/",
            "avatar": "https://secure.gravatar.com/avatar/4c88de43757cff8eeed24564f5729541?s=96&d=monsterid&r=g",
            "display_name": "Pea Lutz"
        },
        "vyskoczilova": {
            "profile": "https://profiles.wordpress.org/vyskoczilova/",
            "avatar": "https://secure.gravatar.com/avatar/469b64229a3914c0f9317ffaf19f6191?s=96&d=monsterid&r=g",
            "display_name": "Karolina Vyskocilova"
        },
        "westonruter": {
            "profile": "https://profiles.wordpress.org/westonruter/",
            "avatar": "https://secure.gravatar.com/avatar/22ed378fbf1d918ef43a45b2a1f34634?s=96&d=monsterid&r=g",
            "display_name": "Weston Ruter"
        }
    },
    "requires": "5.5",
    "tested": "6.4.5",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/anrghg/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 0,
    "downloaded": 7231,
    "last_updated": "2023-12-29 4:38pm GMT",
    "added": "2021-06-03",
    "homepage": "https://anrghg.sunsite.fr/publishing-toolkit/",
    "sections": {
        "description": "<p>An AMP compatible toolbox to help complete WordPress. Core features include:</p>\n<ul>\n<li>Security</li>\n<li>Thank You and other messages</li>\n<li>Date information: published, updated, first published, meta tags</li>\n<li>Paragraph links and list item links</li>\n<li>Heading links</li>\n<li>Table of contents</li>\n<li>Notes and sources in two lists</li>\n<li>Reference lists, bibliographies</li>\n<li>Templates for messages, notes, sources, references</li>\n<li>Webfont loading</li>\n<li>HTML partial including</li>\n</ul>\n<p><em>Notice about <strong>Language support:</strong> While American English is supported natively, British English support is at 100% (generated). French and Spanish with all sublocales supported by WordPress benefit from internal translation, currently at 18% and 6% respectively. About one in four string instances are in sync with WordPress Core.</em></p>\n<p>The A.N.R.GHG Publishing Toolkit can load and filter HTML partials from the file system, and it addresses the challenge to do by HTML and CSS things that used to be done by JavaScript, which was one reason the internet loaded slowly on mobiles and consumed more resources than with <a href=\"https://wordpress.org/plugins/amp/\" rel=\"ugc\">AMP</a> technology. So far, the A.N.R.GHG Publishing Toolkit is not yet up to its full design goal, but it already can:</p>\n<h4>Security</h4>\n<ul>\n<li>Protect WordPress websites against password leak effectiveness, by hampering the login process depending on the value of a constant defined in a mini-plugin (editable on the hosting platform);</li>\n<li>Make that constant configurable so that in multisite networks, individual sites may be toggled independently;</li>\n<li>Extend authentication cookie lifespans to a configurable period of time, for example until the day after the next scheduled login rush;</li>\n<li>Display the login activation status with an icon in the Admin bar;</li>\n<li>Blank the login dialog out if it is convenient to access the WordPress Admin area through the hosting platform exclusively.</li>\n<li>CAUTION: Unless the hosting provider has set up VPS level security, shared hosting is prone to being hacked by web shell even if only a single one of the websites sharing the same server’s home directory is compromised. Therefore, the A.N.R.GHG Publishing Toolkit’s security feature is efficient only on websites hosted on a dedicated server, a Virtual Private Server (VPS), or shared hosting with VPS level security set up by the hosting provider.</li>\n</ul>\n<h4>HTML partials</h4>\n<ul>\n<li>Include locally stored HTML partials directly from the file system;</li>\n<li>Replace optional placeholders with CSS classes and a configurable value;</li>\n<li>Enable updating the partials in bulk by FTP, rather than individual Custom HTML blocks or reusable blocks;</li>\n<li>Solve the issue of size, since posts containing too much code cannot be saved.</li>\n</ul>\n<h4>Thank You message</h4>\n<ul>\n<li>Display a configurable message after posts and/or pages;</li>\n<li>Help with activating and configuring the message on a per-page basis in the Post Meta box;</li>\n<li>Make available a set of rich text messages configured in the Template editor;</li>\n<li>Provide a block to configure an unlimited number of messages right in the post or page.</li>\n</ul>\n<h4>Date information</h4>\n<ul>\n<li>Display the last modified date at post/page start or end;</li>\n<li>Display the published date at the start or end of pages where WordPress does not display it natively;</li>\n<li>Optionally add a freely configurable field about where the post was first published;</li>\n<li>Add date meta tags (may be useful if not already added by an SEO plugin).</li>\n</ul>\n<h4>Paragraph links</h4>\n<ul>\n<li>Add a fragment identifier in a configurable link prepended to every paragraph and list item;</li>\n<li>Use position independent identifiers derived from the content;</li>\n<li>Use the custom ‘HTML anchor’ for all paragraphs that it has been configured for, further improving identifier stability;</li>\n<li>Keep the identifiers fully localized also when using a non-Latin script, for legible display in the URL bar.</li>\n</ul>\n<h4>Heading links</h4>\n<ul>\n<li>Add localized and optionally stable fragment identifiers and hyperlinks to headings.</li>\n</ul>\n<h4>Table of contents</h4>\n<ul>\n<li>Number the headings by CSS in appended or prepended position with a backlink to the table of contents;</li>\n<li>Replace the appended number with a generic arrow if numbers are not desired next to headings;</li>\n<li>List the headings in a table of contents, that the heading numbers link back to;</li>\n<li>Optionally collapse and expand the table of contents from the label, also when JavaScript is off;</li>\n<li>Insert a table of contents automatically in all posts with a configurable minimum number of headings;</li>\n<li>Deactivate the table of contents for a particular post or page in the added Meta box;</li>\n<li>Add a table of contents if the Table of contents block is present;</li>\n<li>Use a configurable string as an alternative positioner in the Classic Editor to override the configured default position;</li>\n<li>Configure its label for all posts in the settings, and for a particular post in the Post Meta box or in the block, or by adding an argument in the code;</li>\n</ul>\n<h4>Notes and sources</h4>\n<ul>\n<li>Parse inline notes and sources and display them either as descriptive endnotes or as bibliographic endnotes depending on their delimiters;</li>\n<li>Process sources nested in notes;</li>\n<li>Show notes and sources in responsive, adaptative and configurable rich tooltips when hovering their inline anchor;</li>\n<li>Support six numbering systems including Eastern Arabic digits to help distinguish notes from sources;</li>\n<li>Register notes and sources on the fly for reuse across a post or page;</li>\n<li>Store notes and sources as templates for reuse across the website;</li>\n<li>Display additional text around reused notes and sources;</li>\n<li>Handle multiple notes and/or sources reused in a single instance;</li>\n<li>Parse the notes and sources delimiters as freely configured also using non-Latin script or punctuation only;</li>\n<li>Support switching complement delimiters midway, parsing older posts for the previous ones while the current ones are processed in posts from a configurable ID on;</li>\n<li>Save the current delimiters with each post, so that delimiters may be reconfigured at any time and are valid in new posts;</li>\n<li>Parse post-specific sets of delimiters configured in the Post Meta box;</li>\n<li>Display complements in a number of columns (up to three) configurable for notes and sources separately, and responsively with respect to mobiles;</li>\n<li>List complements section-wise at each instance of the block in the Block Editor, or alternatively, of a configurable positioner code in the Classic Editor;</li>\n<li>Defer complement lists to the footer of a particular post, or do so for all posts unless specified otherwise;</li>\n<li>Post-process the web page to move complement lists from the built-in WordPress default position below the footer to within the footer;</li>\n<li>Specify the writing direction in complement lists and anchor tooltips for notes and for sources separately on a per-post basis in the added Post Meta box, or per instance in the block (Block Editor) or the positioner code (Classic Editor);</li>\n<li>Display a complement in a new tab or window using its URL even when lists are collapsed by default;</li>\n<li>Keep complement lists collapsed except for the target item after clicking an anchor, so as to not distract from the other features and information;</li>\n<li>Optionally expand the full list on clicking any anchor as it is useful for ibid notation;</li>\n<li>Combine identical complements to a single item, and enumerate the related anchors in a tooltip shown on hovering its number in the list;</li>\n<li>Display a warning if an opening delimiter is unbalanced, quoting the context for easy location.</li>\n</ul>\n<h4>Reference lists</h4>\n<ul>\n<li>Display lists of references in the post or page;</li>\n<li>Optionally make them collapsible, and display them collapsed or expanded at page load;</li>\n<li>Help with configuring reference lists in the ‘Reference list’ block with settings for label, display and writing direction.</li>\n</ul>\n<h4>Web fonts</h4>\n<ul>\n<li>Load web fonts with preconnect after pasting their URL into a text area in the settings;</li>\n<li>The Google Web Fonts repository is linked from the Settings page;</li>\n<li>One example URL is provided out of the box, but the switch is off by default.</li>\n</ul>\n<h4>Category pages and taxonomies</h4>\n<ul>\n<li>Activate rich-text term descriptions.</li>\n</ul>\n<h4>Data</h4>\n<ul>\n<li>Help with editing and storing templates that can be used as messages, as notes and as sources, and in reference lists;</li>\n<li>Export and import templates, settings, and freely defined options;</li>\n<li>Automatically back up templates and settings both at accessing and saving these pages.</li>\n</ul>\n<h4>Anchors and slugs</h4>\n<ul>\n<li>Help with configuring the rules used to generate fragment identifiers, and optionally slugs, allowing for uppercase, custom conversions, configurable maximum length.</li>\n</ul>\n<h4>Excerpts</h4>\n<ul>\n<li>Mitigate the effect of not using shortcodes, but versatile and internationalized delimiters instead.</li>\n</ul>\n<h4>Interoperability</h4>\n<ul>\n<li>Integrate with Elementor;</li>\n<li>Integrate with Advanced Custom Fields.</li>\n</ul>\n<h4>Character conversions</h4>\n<ul>\n<li>Optionally deactivate WordPress default behavior based on WPTexturize, so that ASCII quotation marks stay as-is also outside code areas.</li>\n</ul>\n<h4>Scrolling</h4>\n<ul>\n<li>Use a configurable scroll offset and optional CSS smooth scrolling.</li>\n</ul>\n<h4>CSS</h4>\n<ul>\n<li>Add the post or page slug as a class to the <code>body</code> element to ease customizing the aspect of specific pages.</li>\n</ul>\n<h4>HTML</h4>\n<ul>\n<li>Clean up errand meta tags and remove stray meta elements on public pages.</li>\n</ul>\n<h4>User interface</h4>\n<ul>\n<li>Provide 4 Gutenberg blocks to help with configuring messages, reference lists, note and source lists, and the table of contents;</li>\n<li>Add a configurable Post Meta box for a more fine-grained configuration of various features;</li>\n<li>Display settings in a single, fully searchable page with three levels of verbosity;</li>\n<li>Add optional Admin submenu or menu items;</li>\n<li>Provide an internal header menu.</li>\n</ul>\n<h4>Planned features</h4>\n<ul>\n<li>A format converter for Markdown ➔ WordPress;</li>\n<li>A converter for .docx files;</li>\n<li>An accessible emoji feature.</li>\n</ul>\n<h4>Concept</h4>\n<p>The A.N.R.GHG Publishing Toolkit aims to be one more Swiss Army knife to help complete any WordPress installation while reducing greenhouse gas emissions in multiple ways:</p>\n<ul>\n<li>Thanks to <a href=\"https://wordpress.org/plugins/amp/\" rel=\"ugc\">AMP</a> compatibility for a faster, less resource consuming web;</li>\n<li>With streamlined processes at its end in a slim code base without external style sheets;</li>\n<li>Through its commitment to web hosting with renewable energy ever since the first months;</li>\n<li>By developing in a local WordPress stack on a laptop powered with 100% renewable energy from the local grid operator;</li>\n<li>Being developed by a vegetalian, because going vegan is the <a href=\"https://www.theguardian.com/environment/2018/may/31/avoiding-meat-and-dairy-is-single-biggest-way-to-reduce-your-impact-on-earth\" rel=\"nofollow ugc\">single biggest way to reduce our impact on planet Earth</a>, per <a href=\"https://science.sciencemag.org/content/360/6392/987\" rel=\"nofollow ugc\">Oxford University research</a> and helps terminate animal torture.</li>\n</ul>\n<p>Beyond being fully AMP compatible, the A.N.R.GHG Publishing Toolkit’s features for the public pages stay functional where JavaScript is turned off, with one limitation: Expanding the table of contents from a heading backlink requires one click more.</p>\n",
        "installation": "<h4>Security</h4>\n<p>Unless the hosting provider has set up VPS level security, shared hosting is prone to being hacked by web shell even if only a single one of the websites sharing the same server’s home directory is compromised. Therefore, the A.N.R.GHG Publishing Toolkit’s security feature is efficient only on websites hosted on a dedicated server, a Virtual Private Server (VPS), or shared hosting with VPS level security set up by the hosting provider.</p>\n<p>For an additional layer of security, it is recommended to deny access to the <code>wp-config.php</code> file, and to the <code>debug.log</code> file in case there is any. To achieve this, please add the code snippet provided for the purpose near the bottom of the <code>template-wp-config.php</code> file by copy-pasting it from this file in the <code>anrghg/</code> plugin folder to the <code>.htaccess</code> file in the WordPress base directory.</p>\n<h4>Requirements</h4>\n<p>Prior to installing the A.N.R.GHG Publishing Toolkit, please make sure that the PHP memory limit is configured appropriately in the web hosting. The large settings page requires more than 32MB. A too low memory limit results in the failure of important processes: theme updates, plugin updates, editing large posts and pages, and generally in a lot of malfunctioning and buggy behavior in WordPress and other systems.</p>\n<p>Safe is to set the PHP memory limit to 256M as a rule of thumb, but many hosting providers throttle it down to 128M. If your plan includes cPanel, more options such as 512M may be available in the “MultiPHP INI Editor” under “Software” in the “Tools” menu on the cPanel home page in your hosting account.</p>\n<h4>WordPress configuration</h4>\n<p>The memory limit defaults to 40 megabytes for a single site, 64 MB for a multisite, so it may be necessary to increase this limit, although the A.N.R.GHG Publishing Toolkit <a href=\"https://plugintests.com/plugins/wporg/anrghg/latest\" rel=\"nofollow ugc\">is not known</a> for being particularly memory-intensive. Options include 64M, 128M, 192M, 256M, 368M and 512M as the value should match the memory limit set in the website’s hosting. The file <code>template-wp-config.php</code> includes a template for this.</p>\n<h4>Install process</h4>\n<ul>\n<li>A. Standard process in the WordPress Admin area</li>\n</ul>\n<ol>\n<li>In the Admin menu, navigate to Plugins &gt; Add New;</li>\n<li>In the search bar, type &#8216;anrghg&#8217;;</li>\n<li>In the search results, spot the &#8216;A.N.R.GHG Publishing Toolkit&#8217;;</li>\n<li>Click the &#8216;Install Now&#8217; button next to it;</li>\n<li>Eventually click the &#8216;Activate&#8217; button showing after installation complete.</li>\n</ol>\n<ul>\n<li>B. Mixed process in the WordPress Admin area</li>\n</ul>\n<ol>\n<li>Download &#8216;A.N.R.GHG Publishing Toolkit&#8217; as a .zip file from the <a href=\"https://wordpress.org/plugins/anrghg/\" rel=\"ugc\">WordPress Plugin Directory</a>;</li>\n<li>In the Admin menu, navigate to Plugins &gt; Add New;</li>\n<li>Click the &#8216;Upload Plugin&#8217; button next to the page heading;</li>\n<li>Click the &#8216;Choose File&#8217; button;</li>\n<li>Choose the downloaded .zip file;</li>\n<li>Click the &#8216;Install Now&#8217; button;</li>\n<li>Eventually click the &#8216;Activate Plugin&#8217; button.</li>\n</ol>\n<ul>\n<li>C. By uploading via FTP</li>\n</ul>\n<ol>\n<li>Download &#8216;A.N.R.GHG Publishing Toolkit&#8217; as a .zip file from the <a href=\"https://wordpress.org/plugins/anrghg/\" rel=\"ugc\">WordPress Plugin Directory</a>;</li>\n<li>Uncompress the downloaded .zip file;</li>\n<li>Switch to an FTP client;</li>\n<li>Access the plugins directory;</li>\n<li>Make sure the same plugin is not already there, else delete the old one;</li>\n<li>Upload the folder <code>anrghg/</code> resulting from step 2;</li>\n<li>Refresh the Plugins list;</li>\n<li>Eventually click the &#8216;Activate&#8217; action link of the &#8216;A.N.R.GHG Publishing Toolkit&#8217;.</li>\n</ol>\n<h4>Plugin configuration</h4>\n<p>To activate the security feature, a constant needs to be defined in a mini-plugin. The code is already in the mini-plugin template <code>template-mini-plugin.php</code>. Please make sure this constant is always set to <code>false</code> unless somebody needs to log in. In that case, the constant needs to be set to <code>true</code>. But do not forget to set it back to <code>false</code> as soon as everybody is logged in.</p>\n<p>Once the A.N.R.GHG Publishing Toolkit is installed, it needs to be configured:</p>\n<ol>\n<li>Most features are deactivated by default and may be activated individually. To access the settings page, please click the <code>Settings</code> action link of the ‘A.N.R.GHG Publishing Toolkit’ entry in the Plugins list. No menu items and no Post Meta box are added by default. To activate any of these, or the ‘Thank You messages’ or ‘Reference lists’ block, please choose the desired UI elements in the ‘User interface’ section of the Settings page.</li>\n<li>Even if the setting to turn a feature on uses the glide-switch design with ON and OFF button symbolic, please be still sure to save the form clicking the <code>Save Changes</code> button at the bottom of the window. Unlike the behavior specified in <a href=\"https://material.io/components/switches\" rel=\"nofollow ugc\">Android Material Design</a> and <a href=\"https://experience.sap.com/fiori-design-web/switch/\" rel=\"nofollow ugc\">SAP Fiori Design</a>, changes require saving the form to become effective.</li>\n<li>Several headings or labels may need to be configured to your locale. That may be done on the Settings page, or in the ‘String translation’ pane of a multilingual plugin after saving the Settings page at least once to the database, or using configuration filters as provided in the file <code>template-filter-config.php</code>.</li>\n<li>The strings delimiting notes and sources are freely configurable and come also with two presets as suggestions. So do the inner delimiters. Codes needed to materialize positions are configurable too. Most of these configurations are versatile in that the plugin adapts to changes on the fly or mid-way.</li>\n<li>In the optionally added Post Meta box, every single section can be deactivated individually. After activating the Meta box, it displays with all elements by default just to make selection easier. Please be sure to switch elements in and out individually as desired in the settings page under ‘User interface’.</li>\n<li>Many features may be configured alternatively in a mini-plugin, easy to set up on the basis of the included template <code>template-mini-plugin.php</code>, or especially for theme-specific values, in your child theme’s <code>functions.php</code>, using configuration filters as documented in the file <code>template-filter-config.php</code>. That may be useful to help with adapting the configuration to theme-specific requirements while using multiple themes like in <a href=\"https://amp-wp.org/documentation/getting-started/reader/\" rel=\"nofollow ugc\">AMP Reader mode</a>.</li>\n<li>Configuration filters are currently the only means to configure some features, notably the previous complement delimiters, used in posts and pages with an ID that is less than a configurable number. These filters are documented in <code>template-filter-config.php</code> under ‘Previous delimiters’ and ‘Previous delimiters for tooltips’.</li>\n<li>When using a translation manager with a String Translation pane, please be sure to save the Settings page at least once to your database, because translation filters require retrieving the strings in the database.</li>\n<li>Adding more hooks is projected for the purpose of filtering the HTML output. Overriding the theme style rules by Custom CSS however is not supported, since in multisite networks, Custom CSS is prohibited by default. See more hints in the A.N.R.GHG Publishing Toolkit settings page Customization section.</li>\n</ol>\n<h4>Register templates post-wide</h4>\n<p>To reuse a complement already used in the same post, it may be given a name in the first instance like so: <code>[note]a_name[/name]The complement.[/note]</code>. In case of conflicts, post-wide names prevail over site-wide names.</p>\n<p>The name start delimiter (<code>[name]</code>) is not used for new complements. Its sole purpose is to delimit names in arbitrary positions.</p>\n<h4>Register templates site-wide</h4>\n<p>Complements become reusable site-wide when registered with the ‘Template editor’.</p>\n<p>The name of a template may be any Unicode string; the only constraint is to not contain ordinary space.</p>\n<p>In the list, existing complements are displayed full height with formatting, and HTML markup may be added directly too if JavaScript is on. If JavaScript is turned off, the source code is displayed, and new complements need to be written in source code as well.</p>\n<p>Changes to existing complements can be made directly by editing the list.</p>\n<p>Alternatively, a complement may be moved into the editor by clicking the &#8216;Move into editor&#8217; button next to it, but before doing so, please make sure that TinyMCE is in <strong>Visual</strong> mode (both methods to set the mode programmatically fail and the one to get/check the mode is missing), as else the <code>editor.setContent()</code> method fails, the content disappears, and the page will need to be refreshed to get the item back instantly.</p>\n<p>The &#8216;Move into editor&#8217; buttons are deactivated for safety when either TinyMCE or the new name text box is not empty.</p>\n<p>To help with choosing unique names, the names already in use are displayed in alphabetical order below the new name text box. The data is validated server-side, and if a problem is detected with missing, duplicate or invalid names, a warning will display and the cursor will be set to fix it.</p>\n<p>All templates are backed up in a time-stamped file on accessing the list and on saving the form, if this feature is not deactivated in the settings. The backups are located in a subfolder named <code>anrghg/</code> in the <code>uploads/</code> folder in your <code>wp-content/</code> directory.</p>\n<h4>Reuse complements</h4>\n<p><strong>Simple syntax:</strong> To reuse an already registered complement, put its name as the first, last, or only word in a note or source.</p>\n<p>To add more text like a page number, use a space as a separator between the complement name and the added text, like so, where <code>␣</code> stands for an ordinary space:</p>\n<p>Before (the prepended space is kept): <code>[src]</code>According to the explanation set out on page 10 of␣name1<code>[/src]</code></p>\n<p>After (the appended space is skipped): <code>[src]</code>name1␣, page 10.<code>[/src]</code> or <code>[src]</code>name1␣␣explains it on page 10.<code>[/src]</code> (To have the source followed by a space, two spaces need to be typed.)</p>\n<p><strong>Full syntax:</strong> Beyond this simple syntax, the full syntax brings the opportunity to add more text on both sides, and to reuse multiple complements in a single instance.</p>\n<p>Example: <code>[note]</code>See <code>[name]</code>reusable_one<code>[/name]</code>, page 31, and <code>[name]</code>reuse2<code>[/name]</code>, chapter 4.<code>[/note]</code></p>\n",
        "faq": "\n<dt id='what%20does%20a.n.r.ghg%20stand%20for%3F'>\nWhat does A.N.R.GHG stand for?\n</h4>\n<p>\n<p>A.N.R.GHG is the initialism of ‘Act now, reduce greenhouse gasses’.</p>\n<p>The dots have been added to help screenreaders spell it as an initialism rather than as an acronym.</p>\n<p>The climate crisis requires us to enroll all aspects of our work and lives so that our efforts converge towards addressing the crisis now as a top priority urgency.</p>\n<p>The AMP technology contributes to streamlining processes and making the internet less energy-consuming.</p>\n<p>Moreover, development and maintenance are powered with renewable energy as well since the developer subscribed to the green electricity option offered by the local grid operator to individual households at a monthly fee of about $2.</p>\n<p>Most importantly, the developer is a vegetalian, as avoiding meat and dairy, eggs and fish helps making an end of animal torture and is the scientifically recommended <a href=\"https://www.theguardian.com/environment/2018/may/31/avoiding-meat-and-dairy-is-single-biggest-way-to-reduce-your-impact-on-earth\" rel=\"nofollow ugc\">single biggest way</a> to reduce our impact on planet Earth, an <a href=\"https://science.sciencemag.org/content/360/6392/987\" rel=\"nofollow ugc\">Oxford University study</a> assessed.</p>\n</p>\n<dt id='why%20are%20multiple%20features%20crammed%20into%20a%20single%20plugin%3F'>\nWhy are multiple features crammed into a single plugin?\n</h4>\n<p>\n<p>A number of features like heading links and table of contents, notes and sources or last modified date and published date of pages are interrelated, and solutions using one plugin per feature are suboptimal because of inconsistent identifiers or presentation.</p>\n<p>Beyond consistency, among the reasons that further fueled the adoption of an “all”-in-one concept are efficiency and economies of scale, much like what <a href=\"https://wordpress.org/plugins/jetpack/\" rel=\"ugc\">Jetpack</a> is achieving at an incomparable magnitude.</p>\n<p>As a result, making individual plugins out of some of the features is not required and would be inefficient. Keeping them all together seems like the best option.</p>\n</p>\n<dt id='why%20are%20all%20settings%20crammed%20together%20on%20a%20single%20page%3F'>\nWhy are all settings crammed together on a single page?\n</h4>\n<p>\n<p>This way, the settings can be searched using the browser search functionality (Control + F), and all occurrences can be accessed directly. That would not be the case if the settings were grouped by topic under a number of tabs.</p>\n<p>The table of contents at the top of the settings page replaces the tab row or column, while allowing for longer, more explicit labels. It can be accessed by clicking the ‘Back to top’ button at the top of the window in a fixed position.</p>\n<p>Likewise, the ‘Save settings’ button is constantly visible at the bottom of the window. Clicking it does not require scrolling down to the bottom of the page.</p>\n</p>\n<dt id='why%20do%20processes%20fail%20when%20this%20plugin%20is%20active%3F'>\nWhy do processes fail when this plugin is active?\n</h4>\n<p>\n<p>This issue depends on the PHP memory limit. The large settings page requires more than 32MB. Safe is to set the PHP memory limit to 256M as a rule of thumb, but many hosting providers throttle it down to 128M. If your plan includes cPanel, more options such as 512M may be available in the “MultiPHP INI Editor” under “Software” in the “Tools” menu on the cPanel home page in your hosting account.</p>\n<p>The limitations involved by a low memory limit affect plugin updates, theme updates, as well as other actions performed by WordPress and its plugins, for example editing large posts in the Block Editor. Other content management systems are likewise impacted by low memory limits such as 32M, that may be the default settings value in shared hosting.</p>\n</p>\n<dt id='how%20about%20using%20jquery%3F'>\nHow about using jQuery?\n</h4>\n<p>\n<p>As the jQuery JavaScript library is not fully AMP compatible, features like tooltips, expand/collapse and scrolling back and forth do not use jQuery. Another reason is that when using jQuery, and JavaScript is turned off in a browser, these features are broken in that browser. Yet another reason is bad user experience as links to end notes are either unavailable, or available hard links cannot be opened while the relevant list is collapsed. Moreover, using jQuery prevents from saving a fully functional copy of a page. These frustrating issues outweigh the benefits of using jQuery.</p>\n<p>Regardless, for end notes there is another plugin out there that uses jQuery by default and <a href=\"https://wordpress.org/support/topic/making-it-amp-compatible/\" rel=\"ugc\">offers the ability to opt out</a>: The <a href=\"https://wordpress.org/plugins/footnotes/\" rel=\"ugc\">Footnotes</a> plugin, although closed since 2022-11-14, is consistently <a href=\"https://www.wpbeginner.com/plugins/how-to-add-simple-and-elegant-footnotes-in-your-wordpress-blog-posts/\" rel=\"nofollow ugc\">recommended</a> in 2023, and it is <a href=\"https://wordpress.org/support/topic/still-working-twenty-twenty-3/\" rel=\"ugc\">compatible</a> with the Twenty Twenty-Three theme. It can be installed as a .zip file following <a href=\"https://wordpress.org/plugins/anrghg/#installation\" rel=\"ugc\">process B</a> after downloading its latest version directly <a href=\"https://downloads.wordpress.org/plugin/footnotes.2.7.3.zip\" rel=\"nofollow ugc\">from the WordPress Plugin Directory</a>, as it is two or three times a day on average per current <a href=\"https://wordpress.org/plugins/footnotes/advanced/\" rel=\"ugc\">stats</a>, or from the <a href=\"https://web.archive.org/web/20221015055810/https://wordpress.org/plugins/footnotes/\" rel=\"nofollow ugc\">latest backup</a> of its full Plugin Directory page in the Web Archive.</p>\n<p>However, since the Footnotes plugin is unmaintained, it may basically become a target of exploiting security vulnerabilities. That is why reading the <a href=\"https://wordpress.org/support/topic/plugin-is-abandoned-3/\" rel=\"ugc\">abandonment statement</a> made by its last developer, or its <a href=\"https://web.archive.org/web/20220819113359/https://wordpress.org/support/topic/plugin-is-abandoned-3/\" rel=\"nofollow ugc\">archived version</a>, is strongly recommended.</p>\n</p>\n<dt id='can%20i%20use%20various%20themes%20alongside%3F'>\nCan I use various themes alongside?\n</h4>\n<p>\n<p>Yes, using configuration filters, that have precedence over settings values from the database, each theme can have specific settings values stored in its child theme’s <code>functions.php</code>, so that sensitive values may be fine-tuned in accordance with particular layout options, while values that are constant across themes may still be configured in the settings page and called from the database.</p>\n<p>The A.N.R.GHG Publishing Toolkit includes a template file called <code>template-filter-config.php</code> documenting all filters available so far (while process filters are being added as documented in <code>template-filter-output.php</code>).</p>\n</p>\n<dt id='how%20to%20keep%20configuration%20filters%20when%20switching%20themes%3F'>\nHow to keep configuration filters when switching themes?\n</h4>\n<p>\n<p>As a stable place to add configuration filters and process filters, a mini plugin is convenient. A mini plugin template is included in the plugin folder. To use it, please move it out of the folder, eventually rename it, optionally place it in a new folder, then make it a plugin by deleting the seven percent signs standing out in front of the <code>%%%%%%%Plugin Name:</code> field label, and activate it after refreshing the Plugins list.</p>\n</p>\n<dt id='why%20are%20the%20strings%20not%20in%20the%20translation%20pane%3F'>\nWhy are the strings not in the translation pane?\n</h4>\n<p>\n<p>For multilingual plugins to show the strings in the translation pane and to work effectively, the translation keys must be present in the database. To achieve this, please access the plugin’s settings page and click the ‘Save Settings’ button at the bottom of the window.</p>\n<p>After this, all translatable configuration values will show up in the translation pane, even those that are not yet configurable on the settings page.</p>\n</p>\n<dt id='are%20rich-text%20category%20pages%20supported%3F'>\nAre rich-text category pages supported?\n</h4>\n<p>\n<p>Yes, <a href=\"https://docs.woocommerce.com/document/allow-html-in-term-category-tag-descriptions/\" rel=\"nofollow ugc\">category pages</a> are supported through the <code>term_description</code> hook, so that all features are fully functional as configured.</p>\n<p>When using the A.N.R.GHG Publishing Toolkit, category pages are unaffected by the filter that would usually delete HTML markup, and may be drafted like pages in the Block Editor, kept as drafts, and copy-pasted from the Code Editor to the term description window. Eventual leftover block markup is removed at runtime.</p>\n</p>\n<dt id='are%20custom%20post%20types%20supported%3F'>\nAre custom post types supported?\n</h4>\n<p>\n<p>Yes, the A.N.R.GHG Publishing Toolkit supports all post types applying the filters hooked on the <code>the_content</code> hook; for example, custom post types of <a href=\"https://woocommerce.com\" rel=\"nofollow ugc\">WooCommerce</a> like product pages are supported through this hook. Additionally it supports popups from <a href=\"https://wordpress.org/plugins/popup-maker\" rel=\"ugc\">Popup Maker (Code Atlantic)</a> by hooking on <code>pum_popup_content</code>, and from <a href=\"https://wordpress.org/plugins/popup-builder\" rel=\"ugc\">Popup Builder (Sygnoos)</a> by hooking on <code>sgpbSubscriptionForm</code>.</p>\n<p>Beyond, it processes a configurable list of additional hooks. The only requirement for a content type is to apply filters on the content, using whatever hook. The name of that hook needs to be filled in an input field on the settings page, or in the configuration filter found among the templates under “Support alternative content hooks.” Multiple hook names are comma-separated.</p>\n<p>For convenience, a dedicated hook is also available, that the A.N.R.GHG Publishing Toolkit adds filters to for subsequent application to a given content by calling the WordPress <code>apply_filters()</code> function:</p>\n<pre><code>$content = apply_filters( 'anrghg_content_filter_hook', $content );\n</code></pre>\n</p>\n<dt id='are%20custom%20fields%20supported%3F'>\nAre custom fields supported?\n</h4>\n<p>\n<p>Wysiwyg fields added using <a href=\"https://wordpress.org/plugins/advanced-custom-fields/\" rel=\"ugc\">Advanced Custom Fields</a> are optionally processed for inline complements and other features as well, and complement lists are appended at the bottom of each field. That can be deactivated so that these fields would be processed as part of the post content if displayed accordingly.</p>\n<p>Alternatively, when the hook that the field applies filters to is known, its name may be added to the content hooks in the settings.</p>\n<p>The A.N.R.GHG Publishing Toolkit also adds numerous fields, among which the ‘first published date’ that will be displayed if its prefill has been changed in the Post Meta box.</p>\n</p>\n<dt id='can%20i%20use%20shortcodes%20instead%20of%20blocks%3F'>\nCan I use shortcodes instead of blocks?\n</h4>\n<p>\n<p>Yes, sort of. The A.N.R.GHG Publishing Toolkit does not rely on the WordPress Shortcodes API, because Shortcodes cannot be used to reliably process notes and sources. For example, the scheme is disabled in forms set up using the <a href=\"https://wordpress.org/plugins/wpforms-lite/\" rel=\"ugc\">WPForms plugin</a>. Also, available options are too restricted and may exclude your preferred ones; so, not being internationalized, the shortcode API fails on Non-Latin shortcodes; and not being versatile, it cannot process delimiters made of brackets, braces, parentheses or other punctuation characters only.</p>\n<p>Additionally, registered shortcodes are removed from other usages such as schema and meta descriptions for SEO. That is appropriate for most shortcodes, but may not be desirable for sources: Stripping off these complements may convey a misconception of the content as containing unsourced statements, and thus harm the website’s reputation.</p>\n<p>On the other hand, the A.N.R.GHG Publishing Toolkit is fully compatible with the Classic Editor relying on shortcodes: Instead of using the blocks, fully configurable strings like <code>[anrghg_toc]</code> and <code>[/anrghg_section]</code> may be manually inserted, both with optional arguments.</p>\n</p>\n<dt id='can%20the%20appended%20message%20be%20edited%20in%20rich%20text%3F'>\nCan the appended message be edited in rich text?\n</h4>\n<p>\n<p>Yes, by configuring it in the Template editor. Then insert its name in the input field on the settings page or as a return value in the configuration filter.</p>\n</p>\n<dt id='can%20i%20use%20the%20post%20title%20in%20the%20appended%20message%3F'>\nCan I use the post title in the appended message?\n</h4>\n<p>\n<p>Yes, to insert the title of the current post or page, please insert the placeholder %s in the template text.</p>\n</p>\n<dt id='why%20does%20the%20link%20to%20a%20code%20block%20not%20show%20up%20on%20hovering%20the%20code%3F'>\nWhy does the link to a code block not show up on hovering the code?\n</h4>\n<p>\n<p>As the code block is scrollable, its overflow is hidden, so any protruding elements like the paragraph link are cut off. To work around the issue, code blocks are wrapped into a paragraph, but this paragraph becomes two paragraphs due to the block level code block, and the first paragraph stops before the code. That is why the link shows up only when hovering the area in the margin before the start of the code.</p>\n</p>\n<dt id='does%20adding%20a%20paragraph%20break%20links%20to%20other%20paragraphs%3F'>\nDoes adding a paragraph break links to other paragraphs?\n</h4>\n<p>\n<p>In most cases not, because the identifiers that the A.N.R.GHG Publishing Toolkit assigns are content-based, both for Latin and for non-Latin scripts. These are URL-encoded, much like WordPress derives slugs from titles.</p>\n<p>The main case where numbering is added is to disambiguate identical headings.</p>\n<p>As paragraphs are unlikely to have identical beginnings spanning over more than 200 characters—the length that fragment identifiers are shortened to before cleaning up truncated last words—, every paragraph has a unique stable identifier, unless the underlying text is modified, resulting in the need to fix the fragment identifier.</p>\n<p>HTML anchors set in the WordPress block inspector’s “Advanced” section have precedence over content-derived anchors. Like these, they are prepended with the post number. The part after this and the separator may be copy-pasted into that field to make an existing paragraph link insensitive to further edits, provided that the resulting discrepancy is not an issue.</p>\n</p>\n<dt id='how%20to%20edit%20headings%20or%20paragraph%20starts%20without%20breaking%20links%3F'>\nHow to edit headings or paragraph starts without breaking links?\n</h4>\n<p>\n<p>By giving them an “HTML anchor” in the Block Inspector. For each heading, paragraph or list item, the A.N.R.GHG Publishing Toolkit uses its existing “HTML anchor” in the first place. Only if none is configured, it proceeds to derive a fragment identifier from the content.</p>\n<p>If a URL with a content-based fragment ID is in use prior to editing the underlying content, then the existing ID may be grabbed in preview mode and copy-pasted into the “HTML anchor” input field without the prepended post ID, as this number is always prepended automatically to any ID.</p>\n<p>Prepending the post number helps ensure that each ID is unique across the website, in support of the infinite scroll (AJAX autoload) feature.</p>\n</p>\n<dt id='how%20to%20position%20the%20table%20of%20contents%20without%20the%20block%3F'>\nHow to position the table of contents without the block?\n</h4>\n<p>\n<p>That is done by typing <code>[anrghg_toc]</code> or any bracketed string that this code is configured to.</p>\n<p>Arguments between the code name and the closing bracket are also supported, and both names and values are designed for ease of input. Argument names are preceded by a space and start with an underscore. Values are delimited by vertical bars. The equals sign may or may not be space-padded:</p>\n<ul>\n<li><code>Label tailored to the instance: _1=|Contents of ‘%s’|</code>, where <code>%s</code> is replaced with the post title (for tables after the post);</li>\n<li><code>Alignment: _2=|0|</code> or <code>_2=|center|</code>, or <code>_2=|-1|</code> or <code>|left|</code>, or <code>_2=|1|</code> or <code>|right|</code>;</li>\n<li><code>Collapsing behavior:</code>_3=|-1|<code>for expanded (and collapsible), or</code>_3=|1|<code>for collapsed (and expandable), or</code>_3=|0|` for uncollapsible.</li>\n</ul>\n</p>\n<dt id='why%20are%20level%C2%A01%20headings%20supported%3F'>\nWhy are level 1 headings supported?\n</h4>\n<p>\n<p>Stray level 1 headings do indeed have a negative impact on search engine rankings. Using H1 outside the post title is strongly discouraged. Also the heading formatting defaults to H2 in the Block Editor, while in the Classic Editor the shortcut Shift + Alt + 1 is deactivated. We are warned.</p>\n<p>Yet multiple level 1 headings are in current use outside the web, so the support for H1 is consistent with standard word processing user experience. And when the .docx or .odt formats are converted to WordPress, headings are usually not downgraded (despite they should be), to prevent H6 from being degraded to paragraph level, since custom H7 markup is not well supported by the web.</p>\n<p>The A.N.R.GHG Publishing Toolkit supports level 1 headings if they are present in an article body, because H1 formatting is available in WordPress, that inherits it from TinyMCE where it makes actual sense, as TinyMCE is also used in systems that may not feature an extra field for the page title.</p>\n</p>\n<dt id='do%20the%20added%20fragment%20ids%20interfere%20with%20my%20custom%20anchors%3F'>\nDo the added fragment IDs interfere with my custom anchors?\n</h4>\n<p>\n<p>No, because the “HTML anchor” configured in the Block Inspector is added right inside the element’s start tag, while the A.N.R.GHG Publishing Toolkit adds its IDs in an extra span.</p>\n</p>\n<dt id='can%20i%20have%20heading%20anchors%20also%20in%20a%20linked%20pdf%3F'>\nCan I have heading anchors also in a linked PDF?\n</h4>\n<p>\n<p>Yes if they are built-in; but these fragment identifiers are like scroll instructions. More universally, using URL parameters, scroll instructions may apply to any PDF opened in a browser:</p>\n<p>To scroll to the page, add a hash to the PDF’s file name in the URL, then <code>page=</code> and the page number:</p>\n<pre><code>domain.tld/folder/your-file.pdf#page=123\n</code></pre>\n<p>To scroll to a heading in the page, append an ampersand, then <code>zoom=</code> and three comma-separated numbers: first the zoom factor in per cent (a zero is interpreted as 100%), next the X offset in pixels, then the Y offset. Basically you only need the third number, a best-guess determined by trial-and-error or measuring pixels so that the target heading displays a little below the upper viewport edge:</p>\n<pre><code>domain.tld/folder/your-file.pdf#page=123&amp;zoom=0,0,700\n</code></pre>\n</p>\n<dt id='how%20is%20the%20table%20of%20contents%20expanded%3F'>\nHow is the table of contents expanded?\n</h4>\n<p>\n<p>The A.N.R.GHG Publishing Toolkit’s table of contents features a CSS-only transition when expanding or collapsing.</p>\n<p>For AMP compatibility, JavaScript is avoided on public pages when the same behavior is not implementable in the <a href=\"https://amp.dev/\" rel=\"nofollow ugc\">AMP framework</a>.</p>\n</p>\n<dt id='what%20is%20the%20lone%20heading%20after%20the%20table%20of%20contents%20label%3F'>\nWhat is the lone heading after the table of contents label?\n</h4>\n<p>\n<p>That happens after clicking a heading number while JavaScript is turned off, because expanding the table of contents from heading numbers relies on JavaScript (either in AMP or Vanilla); else, the scrolling wouldn’t work. So, without JavaScript, the target list item displays alone thanks to CSS, and the table of contents waits for its label or twistie being clicked to expand by CSS.</p>\n<p>There is a small likelihood for the same to happen while JavaScript is on. On AMP pages, the related style rule is always valid, but after clicking a heading number (which is when it would come into play) it is overridden by another one, activated using the AMP framework. Reloading the page in that state would result in a lone heading as pointed in the question.</p>\n</p>\n<dt id='how%20are%20complement%20lists%20expanded%3F'>\nHow are complement lists expanded?\n</h4>\n<p>\n<p>The A.N.R.GHG Publishing Toolkit’s complement lists are expanding or collapsing by CSS only, with a slight transition.</p>\n<p>For AMP compatibility, JavaScript is avoided on public pages when the same behavior is not implementable in the <a href=\"https://amp.dev/\" rel=\"nofollow ugc\">AMP framework</a>.</p>\n</p>\n<dt id='why%20are%20complements%20not%20soft-linked%3F'>\nWhy are complements not soft-linked?\n</h4>\n<p>\n<p>Compared to hard links, soft links have multiple downsides, while the disadvantage of using hard links is easily mitigated by hitting the backbutton instead of clicking backlinks. A configurable plain tooltip on hovering a backlink suggests this workaround, that will remove the anchor click from the browsing history.</p>\n<p>Moreover, hard links allow accessing complements from outside, as they are the precondition of using the <code>:target</code> CSS selector to display the desired complement only, without expanding the whole list. That scheme always helps your visitors not be distracted from the other features and contents often displayed after or before the complement lists, notably the social icons and related posts. Your visitors may see these features as soon as looking up a complement in the list, as an alternative to checking it out in its tooltip.</p>\n<p>Thanks to using hard links, no script is used, and since expanding and collapsing complement lists and tables of contents from their label is done without JavaScript likewise, the A.N.R.GHG Publishing Toolkit’s features are fully functional in browsers where JavaScript is turned off (and AMP actions won’t work either). Additionally, for convenience, CSS-based scroll offset as well as smooth scrolling are supported, too.</p>\n</p>\n<dt id='are%20identical%20complements%20combined%3F'>\nAre identical complements combined?\n</h4>\n<p>\n<p>Yes, optionally identical notes or sources are combined into a single item with a single number. Thanks to using hard links, scrolling back up is performed by using the backbutton. For reference, all links to the instances where the complement is used are enumerated in a tooltip on hovering the complement number in the list.</p>\n<p>Notes and sources are only combined section-wide. Identical complements occurring in several sections of a post or page appear once in every related list.</p>\n</p>\n<dt id='what%20are%20the%20numbering%20options%20for%20notes%20and%20sources%3F'>\nWhat are the numbering options for notes and sources?\n</h4>\n<p>\n<p>Beside the standard Western Arabic digits, notes and sources may be numbered using Eastern Arabic digits, or be numbered each in a distinctive manner among Roman and Latin numerals, both available in lowercase and uppercase.</p>\n</p>\n<dt id='are%20long%20complements%20truncated%20for%20display%20in%20tooltips%3F'>\nAre long complements truncated for display in tooltips?\n</h4>\n<p>\n<p>Never, because the tooltips are styled in a way that truncating is unnecessary. When exceeding a configurable number of characters, the tooltip displays full-width even on desktops, and if it would exceed a configurable maximum height, it becomes scrollable.</p>\n<p>That said, the A.N.R.GHG Publishing Toolkit supports a dedicated tooltip text, similar to WordPress’ manual excerpt feature. If the (configurable) <code>[/view]</code> delimiter is present in the complement, the text before is displayed as tooltip text, while the following text represents the complement in the list. This is linked to from the end of the tooltip, and from anywhere in the tooltip by delimiting the link text with <code>[link]</code> and <code>[/link]</code>, or any delimiters these are configured to.</p>\n</p>\n<dt id='can%20complements%20be%20nested%3F'>\nCan complements be nested?\n</h4>\n<p>\n<p>Yes, provided that the nested ones are sources, and those they are nested in are notes. Notes cannot be nested in sources, nor notes in notes, nor sources in sources. Only this nesting scheme is supported, but each note may include any number of nested sources:</p>\n<ul>\n<li><code>…[note]…[src]…[/src]…[/note]</code></li>\n</ul>\n</p>\n<dt id='can%20i%20start%20using%20other%20delimiters%20from%20now%20on%3F'>\nCan I start using other delimiters from now on?\n</h4>\n<p>\n<p>Yes, there is an option to configure the current delimiters separately along with the ID of the post where the new set of delimiters is used first. Currently this requires using configuration filters. Once that is done, new delimiters may be configured the usual way without affecting the older posts and pages.</p>\n</p>\n<dt id='can%20i%20delimit%20sections%20for%20complements%20without%20using%20the%20block%3F'>\nCan I delimit sections for complements without using the block?\n</h4>\n<p>\n<p>Yes, by ending the section with <code>[anrghg_section]</code> or any bracketed string that this code is configured to.</p>\n<p>Arguments between the code name and the closing bracket are also supported, and both names and values are designed for ease of input. Argument names are preceded by a space and start with an underscore. Values are delimited by vertical bars. The equals sign may or may not be space-padded:</p>\n<ul>\n<li>List labels tailored to the instance: <code>_11=|Notes of ‘%s’|</code> and _12=|Our sources|, where <code>%s</code> is replaced with the post title;</li>\n<li>Writing direction tailored to the instance: <code>_21=|-1|</code> in Note list, <code>_22=|-1|</code> in Source list, or <code>_20=|-1|</code> in both lists, where <code>-1</code> is right-to-left, and <code>1</code> is left-to-right;</li>\n<li>Collapsing behavior tailored to the instance: <code>_31=|-1|</code> for the Note list, <code>_32=|-1|</code> for the Source list, or <code>_30=|-1| for both lists, where</code>-1<code>is expanded (and collapsible),</code>1<code>is collapsed (and expandable), and</code>0` is uncollapsible;</li>\n<li>Footer deferral: <code>_40=|1|</code> or <code>_40=|0|</code> for whether this instance must be deferred to the footer, or must not be deferred.</li>\n</ul>\n</p>\n<dt id='could%20multipage%20posts%20display%20all%20notes%20at%20the%20end%3F'>\nCould multipage posts display all notes at the end?\n</h4>\n<p>\n<p>Multipage posts are <a href=\"https://wordpress.com/forums/topic/google-not-indexing-multi-page-posts-properly/\" rel=\"nofollow ugc\">reported not to be properly indexed</a>, and they are not properly navigatable either, with page numbers at the bottom only, and no distinctive head zone for the extra pages. Thus, ‘Page break’ is a bogus feature and should never be used.</p>\n<p>Being able to read the whole content merely by scrolling is much more user friendly. Consistently, implementing anything specifically for multipage posts would be wasting the time of all involved parties, which is why WordPress did not properly implement its multipage feature in the first place.</p>\n</p>\n<dt id='how%20to%20reset%20the%20settings%20to%20default%20values%3F'>\nHow to reset the settings to default values?\n</h4>\n<p>\n<p>The easiest way is to import an empty file.</p>\n<p>Alternatively, deleting the ‘anrghg’ row in the ‘wp-options’ table in the database has the same outcome.</p>\n</p>\n<dt id='why%20do%20setting%20descriptions%20not%20display%20in%20tooltips%20only%3F'>\nWhy do setting descriptions not display in tooltips only?\n</h4>\n<p>\n<p>Info hover buttons would cause issues for either accessibility or keyboard navigation.</p>\n<p>Thanks to the ‘Save settings’ button being constantly visible at the bottom of the window, the settings are not spatially constrained. If full tab navigation is active, the ‘Save settings’ button is active after each settings section.</p>\n<p>Although the settings page is mostly visited at setup while information is wanted, but less often later on, the settings page verbosity is configurable at three levels, one of which is with information expand buttons. Another option fully hides almost all explanatory information.</p>\n</p>\n<dt id='why%20is%20the%20database%20so%20heavy%3F'>\nWhy is the database so heavy?\n</h4>\n<p>\n<p>That is mainly due to WordPress documenting by default the full version history of every post and page.</p>\n<p>If this is too much information and ends up taking too much disk space, with backups getting bulky, and potentially restoring the database would be hard, then revisions may be deactivated by defining the constant <code>WP_POST_REVISIONS</code> as false.</p>\n<p>Another option is to limit the number of stored revisions as in the example provided in the file <code>template-wp-config.php</code>.</p>\n</p>\n\n",
        "changelog": "<h4>1.16.5 (2023-11-06)</h4>\n<ul>\n<li>Configuration filters: Debug filter application.</li>\n<li>Configuration filters: Clarify priority configuration.</li>\n<li>Internal CSS: Fix priority configuration.</li>\n<li>Priority configuration: Make WPautoP fix optional.</li>\n<li>Documentation: Changelog: Delete erroneous entry from the 1.16.4 changeset.</li>\n<li>Documentation: Streamline feature descriptions.</li>\n</ul>\n<h4>1.16.4 (2023-10-30)</h4>\n<ul>\n<li>Internal CSS: Move internal CSS from manually hard-coded style element to <code>wp_add_inline_style()</code>.</li>\n<li>Internal CSS: Add and enqueue an empty stylesheet for the purpose of getting the required handle.</li>\n<li>Internal CSS: Merge <code>stylesplit.php</code> into <code>styles.php</code> thanks to an infrastructure improvement.</li>\n</ul>\n<h4>1.16.3.1 (2023-10-29)</h4>\n<ul>\n<li>Documentation: Add the “Include HTML partial” feature to the short list.</li>\n<li>Documentation: Feature short list: Improve readability.</li>\n</ul>\n<h4>1.16.3 (2023-10-18)</h4>\n<ul>\n<li>Notes and sources: Lists: Correct number position in printed lists.</li>\n</ul>\n<h4>1.16.2 (2023-10-15)</h4>\n<ul>\n<li>Notes and sources: Lists: Fix display bug in collapsed state by removing row top margin since font size issue is fixed.</li>\n<li>Table of contents: Fix font size issue in collapsed state.</li>\n<li>Internationalization: Include partial: Block Inspector: Streamline informative texts.</li>\n<li>Documentation: FAQ item about database size and post revisions.</li>\n<li>Templates for wp-config.php: Suggest taking control of post revisions.</li>\n</ul>\n<h4>1.16.1 (2023-10-12)</h4>\n<ul>\n<li>Security: Add all ARIA attributes to the whitelist of the KSES filter.</li>\n<li>Blocks: Fix comments in JSON configuration files.</li>\n<li>Include partial: Block Inspector: Debug base directory display by overflow-wrap anywhere.</li>\n<li>Include partial: Block: Turn autocomplete on for the file path too.</li>\n</ul>\n<h4>1.16.0 (2023-10-10)</h4>\n<ul>\n<li>Include partial: Security: Apply KSES filter to the included partials, with opt-out for top-level Admins.</li>\n<li>Include partial: Add support for additional CSS classes, with new placeholder {{{anrghg-classes}}}.</li>\n<li>Include partial: Change existing placeholder name from {{{anrghg-placeholder}}} to {{{anrghg-value}}}.</li>\n<li>Include partial: Make both placeholder names configurable.</li>\n<li>Include partial: Setting for the base directory to enable relative paths in the path input.</li>\n</ul>\n<h4>1.15.0 (2023-10-07)</h4>\n<ul>\n<li>Include partial: New block in the “embed” category to include locally stored HTML partials.</li>\n<li>Notes and sources: Lists: Avoid widows and orphans instead of page breaks inside.</li>\n</ul>\n<h4>1.14.6 (2023-09-14)</h4>\n<ul>\n<li>Notes and sources: Prevent page breaks inside notes and sources in lists.</li>\n</ul>\n<h4>1.14.5 (2023-09-13)</h4>\n<ul>\n<li>Notes and sources: Debug font size of Note lists and Source lists.</li>\n<li>Notes and sources: Remove gap between Note list label and Source list label in collapsed state.</li>\n</ul>\n<h4>1.14.4 (2023-09-09)</h4>\n<ul>\n<li>Notes and sources: Debug number layout in print.</li>\n</ul>\n<h4>1.14.3 (2023-09-09)</h4>\n<ul>\n<li>Notes and sources: Remove list heading underline.</li>\n<li>Notes and sources: Debug printing.</li>\n<li>Reference lists: Debug printing.</li>\n</ul>\n<h4>1.14.2 (2023-09-08)</h4>\n<ul>\n<li>Reference lists: URL-encode configurable strings used in fragment identifiers.</li>\n<li>Table of contents: URL-encode configurable strings used in fragment identifiers.</li>\n<li>Notes and sources: URL-encode configurable strings used in fragment identifiers.</li>\n<li>Style rules: Correct identifier of the added internal CSS element.</li>\n</ul>\n<h4>1.14.1 (2023-09-07)</h4>\n<ul>\n<li>Slug body class: Escape sensitive characters in configurable strings.</li>\n<li>Table of contents: Escape sensitive characters in configurable strings.</li>\n<li>Reference lists: Escape sensitive characters in configurable strings.</li>\n<li>Notes and sources: Escape sensitive characters in configurable strings.</li>\n<li>Notes and sources: HTML parser: Debug inner HTML by admitting <code>&gt;</code> characters.</li>\n<li>Notes and sources: Lists: Priority: Set default to lowest for compatibility.</li>\n<li>Notes and sources: Lists: Disambiguate source IDs in note tooltips to debug nested backlinks.</li>\n<li>Notes and sources: Debug tooltip padding for right-to-left scripts.</li>\n<li>Notes and sources: Debug tooltip padding for nested sources in note lists.</li>\n<li>Notes and sources: Debug fullwidth tooltips of nested sources in note lists.</li>\n<li>Notes and sources: Stray meta tags: Move to dedicated feature.</li>\n<li>Stray meta tags: Complete removal algorithm.</li>\n<li>Stray meta tags: Make removal from public pages the default behavior.</li>\n<li>Settings: Priority: Add warning about block disappearance if higher than 9 (from 8 downwards) for Notes and sources.</li>\n<li>Settings: Priority: Display warnings in the first place as must-read information i.e. always uncollapsible.</li>\n<li>Settings: Priority: Turn radio button red for highest priority.</li>\n<li>Settings: Priority: Show safe range in the first place before possible range.</li>\n<li>Settings: Fix grammar issues in variable strings.</li>\n<li>Style rules: Add identifier to the added internal CSS element.</li>\n</ul>\n<h4>1.14.0 (2023-08-21)</h4>\n<ul>\n<li>Accessibility: Settings: Section headings: To the top functionality when full tab navigation is active.</li>\n<li>Accessibility: Settings: Save buttons: Correct tab navigation by moving buttons before.</li>\n<li>Accessibility: Settings: Save buttons: Display info in section headings on focus.</li>\n<li>Notes and sources: Tooltips: Debug display of scrollable tooltips.</li>\n<li>Notes and sources: Backlinks: Prevent backlink link texts from line-wrapping.</li>\n<li>Notes and sources: Output anchor tooltip style rules on the condition of tooltip activation.</li>\n<li>Notes and sources: Output backlink tooltip style rules on the condition of identical complement combination.</li>\n</ul>\n<h4>1.13.0 (2023-08-15)</h4>\n<ul>\n<li>Accessibility: Settings: Replicate Save button at section headings when full tab navigation is active.</li>\n</ul>\n<h4>1.12.0 (2023-08-11)</h4>\n<ul>\n<li>Accessibility: Settings: More fluid tab navigation by skipping the section headings.</li>\n<li>Accessibility: Settings: Backup: Fix tab navigation disturbance.</li>\n<li>Accessibility: Settings: Optionally have all links and expand buttons tab navigable.</li>\n<li>Settings: User interface: Option for full tab navigability.</li>\n</ul>\n<h4>1.11.0 (2023-08-08)</h4>\n<ul>\n<li>Notes and sources: Priority: Change default to highest.</li>\n<li>Settings: Notes and sources: Priority: Move to top of Lists subsection.</li>\n<li>Settings: Customization: Add link to the Theme Editor.</li>\n<li>Settings: Customization: Advice for Custom CSS on multisite.</li>\n<li>Reference lists: Block: Move help from input label to help text.</li>\n<li>Accessibility: Settings: More fluid tab navigation by skipping all of the links.</li>\n</ul>\n<h4>1.10.2 (2023-07-01)</h4>\n<ul>\n<li>User experience: Scroll offset: Prevent WordPress from hiding the scroll padding.</li>\n<li>Customization: URL slugs: Use fallback title if title is empty or false.</li>\n</ul>\n<h4>1.10.1 (2023-06-21)</h4>\n<ul>\n<li>Settings: Security: Modify the warning about shared hosting, after validation by a hosting company.</li>\n<li>Documentation: Security: Modify the warning about shared hosting, after validation by a hosting company.</li>\n</ul>\n<h4>1.10.0 (2023-05-27)</h4>\n<ul>\n<li>Settings: Security: Add a warning in the Security section introduction.</li>\n<li>Documentation: Security: Add a warning in the Security notice of the Installation section.</li>\n<li>Documentation: Security: Add a warning in the Security feature description.</li>\n<li>Documentation: Security: Add a warning in the “How about using jQuery?” FAQ item.</li>\n<li>Documentation: Change the plugin name from “A.N.R.GHG Publishing Helper” to “A.N.R.GHG Publishing Toolkit”.</li>\n<li>Documentation: Rename the template files from <code>tpl-*.php</code> to <code>template-*.php</code>.</li>\n<li>Documentation: Remove the sample <code>anrghg-thanks-block.json</code> file for now.</li>\n</ul>\n<h4>1.9.4 (2023-05-19)</h4>\n<ul>\n<li>Security: Provide code to deny access to <code>wp-config.php</code> alongside <code>debug.log</code>.</li>\n<li>Documentation: Add security recommendation in the Installation section.</li>\n<li>Documentation: Add the new webfont feature to the feature list.</li>\n</ul>\n<h4>1.9.3 (2023-05-17)</h4>\n<ul>\n<li>Performance: Web fonts: Preconnect only once even when multiple fonts are loaded.</li>\n</ul>\n<h4>1.9.2 (2023-05-17)</h4>\n<ul>\n<li>Customization: Web fonts: Add link to Google Fonts library.</li>\n<li>Performance: Web fonts: Preconnect to Google Fonts.</li>\n<li>Interoperability: Restore compatibility with PHP 5.6 lost in v1.9.1 due to fast-tracking a security fix.</li>\n</ul>\n<h4>1.9.1 (2023-05-17)</h4>\n<ul>\n<li>Security: Add recommendation and code to deny access to the debug.log file if any exists.</li>\n</ul>\n<h4>1.9.0.2 (2023-05-09)</h4>\n<ul>\n<li>Documentation: FAQ: Correct item about recommendation for jQuery using plugin.</li>\n</ul>\n<h4>1.9.0.1 (2023-05-08)</h4>\n<ul>\n<li>Documentation: Add server memory limit requirement.</li>\n<li>Documentation: FAQ: Add item about memory limit issues.</li>\n<li>Documentation: FAQ: Add recommendation for jQuery using plugin.</li>\n<li>Documentation: FAQ: Correct item about setting tooltips.</li>\n</ul>\n<h4>1.9.0 (2023-04-14)</h4>\n<ul>\n<li>Settings: Interoperability: Split off new section about Customization.</li>\n<li>Customization: Option to load web fonts.</li>\n<li>Notes and sources: Lists: Footer deferral: Fix algorithm.</li>\n<li>Slug body class: Class or ID sanitization: Fix algorithm.</li>\n<li>Localization: Include configuration for VSCode extension to process PO files for en_US, en_GB.</li>\n</ul>\n<h4>1.8.4 (2022-12-07)</h4>\n<ul>\n<li>Localization: IDs and slugs: Fragment identifiers: Debug dash and apostrophe conversion to hyphen-minus.</li>\n</ul>\n<h4>1.8.3 (2022-11-11)</h4>\n<ul>\n<li>Post Meta box: Table of contents: Debug fieldset legend.</li>\n<li>Settings: Improve user interface text strings.</li>\n<li>Translation: Continue French to 18%.</li>\n</ul>\n<h4>1.8.2 (2022-11-10)</h4>\n<ul>\n<li>Split <code>admin/includes/settings.php</code> into 8 files.</li>\n</ul>\n<h4>1.8.1 (2022-11-10)</h4>\n<ul>\n<li>Settings: Fix right-to-left position of To-the-top button.</li>\n<li>Template editor: Add pre-1.8.0 ‘Move into editor’ as an option.</li>\n<li>Settings: Template editor: Add option for moving into editor in text mode.</li>\n<li>Internationalization: Increase synergy with WordPress Core, adding context.</li>\n</ul>\n<h4>1.8.0 (2022-11-08)</h4>\n<ul>\n<li>Template editor: Debug ‘Move into editor’ buttons, reverting to v0.80.5.</li>\n<li>Template editor: Add warning not to use ‘Move into editor’ buttons in text mode.</li>\n<li>Template editor: Default-deactivate pointy bracket unescaping.</li>\n<li>Settings: Template editor: Unescape pointy brackets: Add switch.</li>\n<li>Settings: Template editor: Rich text list view: Add switch.</li>\n<li>Settings: Notes and sources: Tooltips: Position: Add subsection.</li>\n<li>Settings: Notes and sources: Tooltips: Position: Offset: Add settings.</li>\n<li>Settings: Notes and sources: Tooltips: Position: Max width: Reorder.</li>\n<li>Settings: Notes and sources: Tooltips: Scrollable: Add setting.</li>\n<li>Settings: Notes and sources: Tooltips: Length breakpoint: Rename setting.</li>\n<li>Settings: Notes and sources: Tooltips: Font size: Add setting.</li>\n<li>Settings: Notes and sources: Tooltips: Line height: Add setting.</li>\n<li>Translation: Continue French and Spanish translations up to 12% and 6% respectively.</li>\n</ul>\n<h4>1.7.8 (2022-11-05)</h4>\n<ul>\n<li>Templates: Debug when there are no templates.</li>\n<li>Settings: Security: Reorder information.</li>\n</ul>\n<h4>1.7.7 (2022-10-28)</h4>\n<ul>\n<li>Translation: Streamline strings consistently.</li>\n</ul>\n<h4>1.7.6 (2022-10-23)</h4>\n<ul>\n<li>Import: Clarify the various button semantics.</li>\n<li>Localization: Import: Increase synergy with WordPress Core.</li>\n<li>Settings: Thank You message: Margin: Add missing information.</li>\n<li>Date information: Support also category pages and date-based archives.</li>\n</ul>\n<h4>1.7.5 (2022-10-16)</h4>\n<ul>\n<li>Import: Debug error assessment.</li>\n<li>Import: Provide more fine-grained information about where the error may reside.</li>\n<li>Import: Include overwriting templates, by completing the control structure.</li>\n<li>Import: Stop dying on file errors, with error messages displayed on a white screen.</li>\n<li>Import: Display error messages normally, using the built-in WordPress feature.</li>\n<li>Settings: Streamline added information to “Its submenu contains at least Templates and Settings.”</li>\n</ul>\n<h4>1.7.4 (2022-10-15)</h4>\n<ul>\n<li>Import: Add pinning functionality to headings.</li>\n<li>Import: Make success message always visible no matter the scroll position.</li>\n<li>Import: Fix error handling.</li>\n<li>Settings: Highlight and advertise pinning functionality.</li>\n<li>Settings: Admin menu: Add missing information about “The main menu item submenu always contains Templates and Settings.”</li>\n</ul>\n<h4>1.7.3 (2022-10-09)</h4>\n<ul>\n<li>Settings: Menu level: Fix menu level transition bug occurring when changed.</li>\n<li>Settings: Menu level: Remove the checkbox configuring submenu item removal.</li>\n<li>Settings: Display the reworded success message independently of menu level.</li>\n<li>Settings: Prevent page from always scrolling to top on reloading after save.</li>\n<li>Settings: Make success message always visible no matter the scroll position.</li>\n</ul>\n<h4>1.7.2 (2022-10-08)</h4>\n<ul>\n<li>Admin pages: Debug current options page slug while settings are not saved or empty.</li>\n<li>Import: Fix red button style on hover and on active.</li>\n</ul>\n<h4>1.7.1 (2022-10-02)</h4>\n<ul>\n<li>Import: Debug display of success message.</li>\n<li>Import: Display error message instead of dying on problem in custom option name input field.</li>\n<li>Internationalization: Fix localization syncing with WordPress Core.</li>\n</ul>\n<h4>1.7.0 (2022-09-27)</h4>\n<ul>\n<li>Thank You message: Text align setting in the toolbar.</li>\n<li>Table of contents: Configurable backlink plain tooltips.</li>\n<li>Admin pages: Header menu: Display also when Export/Import not in submenu.</li>\n</ul>\n<h4>1.6.22 (2022-09-26)</h4>\n<ul>\n<li>Template editor: Move ‘Save Changes’ button away from Admin menu to fix submenu access.</li>\n<li>Templates: Remove empty elements coming in from saving empty editors.</li>\n<li>Import: Settings: Fix menu level transition bug.</li>\n</ul>\n<h4>1.6.21 (2022-09-22)</h4>\n<ul>\n<li>Localization: IDs and slugs: Fix independency of extra conversions.</li>\n<li>Settings: Localization: IDs and slugs: Reorder settings consistently.</li>\n<li>Settings: Localization: IDs and slugs: Update more descriptive texts.</li>\n</ul>\n<h4>1.6.20 (2022-09-20)</h4>\n<ul>\n<li>Date information: Prevent custom post types from causing variables to be undefined.</li>\n<li>Localization: IDs and slugs: Stop deleting percent signs, URL-encode them instead.</li>\n<li>Localization: IDs and slugs: Stop performing no-opt-out character conversions.</li>\n<li>Localization: IDs and slugs: Stop removing all ‘Symbols-other’ characters.</li>\n<li>Localization: IDs and slugs: Minimize risk of fixes being overridden.</li>\n<li>Localization: IDs and slugs: Warn about slug input fields not applying the full set of fixes.</li>\n<li>Localization: IDs and slugs: Leave punctuation unless accent removal is opted in for, as else dumbing down slugs would be pointless.</li>\n<li>Settings: Fix Admin submenu access by moving ‘Save Changes’ button to the opposite.</li>\n</ul>\n<h4>1.6.19 (2022-09-12)</h4>\n<ul>\n<li>Notes and sources: Anchor tooltips: Restore direct child combinators to debug nested tooltips.</li>\n<li>Settings: Notes and sources: Lists: Footer deferral: Output buffering: AMP: Advise to edit child theme footer instead.</li>\n</ul>\n<h4>1.6.18 (2022-09-07)</h4>\n<ul>\n<li>Localization: IDs and slugs: Fix sanitization by removing full classes.</li>\n<li>Notes and sources: Lists: Correct line top and bottom padding.</li>\n<li>Reference lists: Correct line top and bottom padding.</li>\n</ul>\n<h4>1.6.17 (2022-09-06)</h4>\n<ul>\n<li>Localization: IDs and slugs: Maintain plus sign instead of letting it turn into space then hyphen-minus.</li>\n<li>Localization: IDs and slugs: Stop always deleting acute, grave, circumflex accents, macron and hacek.</li>\n<li>Localization: IDs and slugs: Optionally remove the full set of combining diacritics.</li>\n<li>Localization: IDs and slugs: Remove the full set of format control characters.</li>\n<li>Localization: IDs and slugs: Convert Latin alphabetic abbreviation indicators.</li>\n</ul>\n<h4>1.6.16 (2022-09-05)</h4>\n<ul>\n<li>Localization: IDs and slugs: Debug portions starting with an ampersand and ending with a semicolon.</li>\n</ul>\n<h4>1.6.15 (2022-09-04)</h4>\n<ul>\n<li>Thank You message: Remove direct child combinator from CSS, for AMP compatibility.</li>\n<li>Notes and sources: Tooltips: Remove direct child combinators from CSS, for AMP compatibility.</li>\n<li>Slug body class: Debug CSS compliant class names without ASCII characters.</li>\n<li>Slug body class: Sanitize the “sanitized” plain ASCII class, for CSS compatibility.</li>\n<li>Slug body class: Add low priority to make sure it keeps working past WordPress v6.</li>\n</ul>\n<h4>1.6.14 (2022-09-04)</h4>\n<ul>\n<li>Localization: Extended page slugs: Force lowercase to prevent 404 errors.</li>\n</ul>\n<h4>1.6.13 (2022-09-03)</h4>\n<ul>\n<li>Slug body class: Make prefix configurable for test purposes.</li>\n</ul>\n<h4>1.6.12 (2022-09-03)</h4>\n<ul>\n<li>Settings: Localization: Streamline acknowledgements.</li>\n<li>Settings: Add or update acknowledgements.</li>\n<li>Settings: Slug body class: Prefix configuration setting.</li>\n</ul>\n<h4>1.6.11 (2022-09-02)</h4>\n<ul>\n<li>Slug body class: Fix bug occurring when class starts with a hyphen followed by a digit 0-9.</li>\n<li>Slug body class: Add simplified class based on post ID.</li>\n<li>Slug body class: URL-decode the page slug.</li>\n<li>Slug body class: Additional class based on non-sanitized slug.</li>\n</ul>\n<h4>1.6.10 (2022-09-01)</h4>\n<ul>\n<li>User experience: Scroll offset: Change CSS so it fits AMP.</li>\n</ul>\n<h4>1.6.9 (2022-08-31)</h4>\n<ul>\n<li>Paragraph links: Highlight target link character.</li>\n</ul>\n<h4>1.6.8 (2022-08-30)</h4>\n<ul>\n<li>Paragraph links: Debug links added to code blocks.</li>\n</ul>\n<h4>1.6.7 (2022-08-29)</h4>\n<ul>\n<li>Table of contents: Debug scroll offset in collapsible tables.</li>\n</ul>\n<h4>1.6.6 (2022-08-29)</h4>\n<ul>\n<li>Scroll behavior: Smooth scrolling: Enforce behavior when switch is off.</li>\n<li>Scroll behavior: Scroll offset: Make universal for consistent user experience.</li>\n<li>Table of contents: Set end padding from 0 to 7 pixels (awaiting setting).</li>\n</ul>\n<h4>1.6.5 (2022-08-27)</h4>\n<ul>\n<li>Localization: PO files: Debug language information.</li>\n<li>Internationalization: Option to switch between sync and proper.</li>\n</ul>\n<h4>1.6.4 (2022-08-26)</h4>\n<ul>\n<li>Localization: Debug translatable strings.</li>\n<li>Notes and sources: Not process code elements.</li>\n<li>Notes and sources: Effectively remove underline on anchors and backlinks.</li>\n<li>Date information: Published first: Support templates.</li>\n</ul>\n<h4>1.6.3 (2022-08-24)</h4>\n<ul>\n<li>Settings: Backup: Previews: Correct user experience.</li>\n<li>Template editor: Debug success message when in Admin submenu.</li>\n<li>Conversion: Debug success message when in Admin submenu.</li>\n<li>Import: Add nonce verification.</li>\n</ul>\n<h4>1.6.2 (2022-08-23)</h4>\n<ul>\n<li>Thank You message: Fix line breaks, emulate paragraph breaks.</li>\n<li>Settings: Notes and sources: Combine identical: Move from Lists to Anchors section.</li>\n</ul>\n<h4>1.6.1 (2022-08-22)</h4>\n<ul>\n<li>Settings: Backup: Templates: Debug preview toggle.</li>\n<li>Conversion: Debug editor tabs for localization.</li>\n<li>Settings: Streamline localization through Backlink tooltip aspect subsection.</li>\n</ul>\n<h4>1.6.0 (2022-08-21)</h4>\n<p>▶ The Thank You message template select configuration is required to change syntax. The only possible separators are space and newline. The previous separator, comma, is allowed in template names. We apologize for the disruption and the inconvenience.</p>\n<p>▶ Two added blocks need to change category: The “Thank You message” and “Reference list” blocks were previously in the Design section. As they are about writing and formatting text and lists, they should be moved to the Text section. Making the category configurable for all added blocks is projected. Thank you for your understanding.</p>\n<ul>\n<li>Settings: Expandable information: Fix accessibility.</li>\n<li>Blocks: Debug auto-generated preview of editor block.</li>\n<li>Thank You message: Debug template select configuration.</li>\n<li>Thank You message: Block: Correct category: “Text”, not “Design”.</li>\n<li>Reference list: Block: Correct category: “Text”, not “Design”.</li>\n<li>Reference list: Block: Correct name from plural to singular.</li>\n</ul>\n<h4>1.5.10 (2022-08-20)</h4>\n<ul>\n<li>Security: Debug authentication cookie duration configuration.</li>\n<li>Settings: To the top button: Debug on mobiles.</li>\n<li>Settings: Subsections: Leading label: Improve readability.</li>\n<li>Settings: Subsections: Remove excess padding above and below.</li>\n</ul>\n<h4>1.5.9 (2022-08-19)</h4>\n<ul>\n<li>Settings: Glide switches: Remove excess padding around.</li>\n<li>Date information: Chronological order: Set default to no throughout.</li>\n</ul>\n<h4>1.5.8 (2022-08-18)</h4>\n<ul>\n<li>Table of contents: List items: Make no underline more robust.</li>\n<li>Settings: Collapsing behavior: Reorder options for consistency.</li>\n<li>Options pages: Display top menu only if no top level Admin menu entry.</li>\n<li>Settings: Settings table of contents: Fix column break.</li>\n<li>Settings: Settings table of contents: Fix visibility of some features.</li>\n</ul>\n<h4>1.5.7 (2022-08-17)</h4>\n<ul>\n<li>Heading links: Debug prepended link text when there is no table of contents.</li>\n<li>Table of contents: Block: Fix design and textual information.</li>\n<li>Notes and sources: Backlinks: Fix upper padding.</li>\n<li>Notes and sources: Backlink tooltips: Debug in target-displayed rows.</li>\n<li>Notes and sources: Footer lists: Change default text color from blue to green.</li>\n</ul>\n<h4>1.5.6 (2022-08-16)</h4>\n<ul>\n<li>Post Meta box: Debug data saving by removing <code>wp_unslash()</code>, additionally to removing <code>sanitize_option()</code>.</li>\n<li>Notes and sources: Block: Add missing collapsing behavior implementation.</li>\n</ul>\n<h4>1.5.5 (2022-08-15)</h4>\n<ul>\n<li>Localization: Add four missing sublocale MO files.</li>\n<li>Settings: Protect must-read information against becoming invisible.</li>\n<li>Notes and sources: Lists: Remove excess spacing below due to collapsed lines.</li>\n</ul>\n<h4>1.5.4 (2022-08-14)</h4>\n<ul>\n<li>Localization: Streamline Gettext strings to alleviate workload.</li>\n<li>Localization: Inform translators about collapsible and hidden information.</li>\n<li>Notes and sources: Evaluate tooltip length on the basis of inner HTML.</li>\n</ul>\n<h4>1.5.3 (2022-08-13)</h4>\n<ul>\n<li>Table of contents: Remove excess spacing below due to collapsed lines.</li>\n<li>Import: Fix template overwrite button color for safety and legibility.</li>\n<li>Import: Improve submit button label readability.</li>\n<li>Notes and sources: Fix template resolution for CJK with localized space.</li>\n<li>Localization: Make space and dash localization available for public pages.</li>\n<li>Reference list: Block: Debug label input placeholder.</li>\n<li>Table of contents: Block: Fix undefined Gettext function bug.</li>\n</ul>\n<h4>1.5.2 (2022-08-12)</h4>\n<ul>\n<li>Notes and sources: Debug post-wide templates preceded by more text.</li>\n</ul>\n<h4>1.5.1 (2022-08-05)</h4>\n<ul>\n<li>Notes and sources: Block: Fix design of minimal display mode.</li>\n<li>Security: Admin bar: Move status icon at the very end of potentially added menus.</li>\n<li>Internationalization: Make sentence-separating space localizable.</li>\n<li>Internationalization: Improve context definition of sentence-separating dash.</li>\n</ul>\n<h4>1.5.0 (2022-08-01)</h4>\n<p>▶ Delimiter presets for easy input are changing. If easy default delimiters based on square brackets are in use, and this plugin’s Settings page was not saved since v1.4.7, please save it BEFORE UPGRADING, in order to not be disrupted. Thank you.</p>\n<ul>\n<li>Security: Display login status in Admin bar.</li>\n<li>Notes and sources: Delimiters: Ditch square brackets due to interference with Block Editor shortcut.</li>\n</ul>\n<h4>1.4.14 (2022-07-31)</h4>\n<ul>\n<li>Reference list: Fix CSS error in transition property after 1.4.13.</li>\n</ul>\n<h4>1.4.13 (2022-07-31)</h4>\n<ul>\n<li>Notes and sources: Lists: Fix insufficient spacing between heading and first list item.</li>\n<li>Reference list: Fix insufficient spacing between heading and first list item.</li>\n</ul>\n<h4>1.4.12 (2022-07-27)</h4>\n<ul>\n<li>Notes and sources: Tooltips: Debug fullwidth tooltip and its nested tooltips.</li>\n</ul>\n<h4>1.4.11 (2022-07-26)</h4>\n<ul>\n<li>Notes and sources: Tooltips: Debug tooltip of source nested in note.</li>\n</ul>\n<h4>1.4.10 (2022-07-25)</h4>\n<ul>\n<li>Notes and sources: Lists: Debug visibility of target item on clicking anchor.</li>\n</ul>\n<h4>1.4.9 (2022-07-24)</h4>\n<ul>\n<li>Notes and sources: Tooltips: Debug responsive layout for mobile.</li>\n</ul>\n<h4>1.4.8 (2022-07-20)</h4>\n<ul>\n<li>Notes and sources: Debug expansion functionality on clicking label.</li>\n<li>Reference list: Debug expansion functionality on clicking label.</li>\n<li>Reference list: Block: Correct label and design.</li>\n<li>Thank You message: Block: Correct label and design.</li>\n</ul>\n<h4>1.4.7 (2022-07-19)</h4>\n<ul>\n<li>Notes and sources: Centralize delimiter preset configuration.</li>\n<li>Notes and sources: Get delimiter presets saved to the DB.</li>\n</ul>\n<h4>1.4.6 (2022-07-18)</h4>\n<ul>\n<li>Backup: Fix uploads directory for multisite installations.</li>\n<li>Template editor: Remove backup preview and bulk upload advice.</li>\n<li>Import: Templates: Clarify label of ‘Import and Add’ button.</li>\n<li>Settings: Backup: Correct display of backup paths of templates, settings.</li>\n<li>Settings: Backup: Add hint about the bulk-upload of templates.</li>\n</ul>\n<h4>1.4.5 (2022-07-17)</h4>\n<ul>\n<li>Security: Remove security parameter configuration filters for security reasons.</li>\n</ul>\n<h4>1.4.4 (2022-07-15)</h4>\n<ul>\n<li>Thank You message: Debug Gutenberg block for multisite networks by fixing table of contents activation.</li>\n<li>Table of contents: Remove full deactivation option as useless and causing a bug in multisite networks.</li>\n<li>Table of contents: Change default to ‘Insert a table of contents if specified accordingly’, and fix legacy.</li>\n</ul>\n<h4>1.4.3 (2022-07-15)</h4>\n<ul>\n<li>Thank You message: Prevent last message from block from interfering with default message.</li>\n<li>Post Meta box: Debug saving data by removing <code>sanitize_option()</code>.</li>\n<li>Settings: Change background color of quoted code from gray to white.</li>\n</ul>\n<h4>1.4.2 (2022-07-14)</h4>\n<ul>\n<li>Export: Debug process by debugging .docx ➔ WordPress conversion process.</li>\n<li>Export: Make existing option name a requirement.</li>\n<li>Export: Add own heading to reordered templates.</li>\n<li>Settings: Move ‘Option to deactivate WPTexturize’ to ‘Localization’.</li>\n<li>Settings: Move ‘URL slug as a CSS selector’ to ‘Interoperability’.</li>\n<li>Settings: Clarify the relationship between the two ‘ID max length’ settings.</li>\n<li>Settings: Graceful error handling.</li>\n<li>Template editor: Graceful error handling.</li>\n<li>Export/import: Graceful error handling.</li>\n<li>Conversion: Graceful error handling.</li>\n</ul>\n<h4>1.4.1 (2022-07-11)</h4>\n<ul>\n<li>Security: Settings: Add missing nonce field.</li>\n<li>Security: Settings: Add nonce verification condition to settings saved message.</li>\n<li>Security: Conversion: Add dual nonce fields and verification.</li>\n<li>Heading links: Remove tooltips from heading numbers.</li>\n<li>Heading links: Make CSS more robust, cross-theme compatible.</li>\n<li>Localization: Allow uppercase in identifiers: Change default from yes to no.</li>\n</ul>\n<h4>1.4.0 (2022-07-10)</h4>\n<p>▶ The security feature’s login screen high and standard profiles should not be used unless the dialog is not useful any longer. Also it is recommended to define the constant in a mini-plugin using the included template, and to delete its definition in <code>wp-config.php</code>.</p>\n<ul>\n<li>Security: Discourage standard and high profile login screen options.</li>\n<li>Security: Recommend defining the login control constant in a mini-plugin.</li>\n</ul>\n<h4>1.3.1 (2022-06-29)</h4>\n<ul>\n<li>Conversion: Fix bug caused by ignoreFile comment added for linter.</li>\n</ul>\n<h4>1.3.0 (2022-06-28)</h4>\n<ul>\n<li>Upgrade notice: Debug and test display after escapement.</li>\n</ul>\n<h4>1.2.2 (2022-06-28)</h4>\n<ul>\n<li>Code: Improve online editability of Export, Import, Format conversion and Template editor pages.</li>\n</ul>\n<h4>1.2.1 (2022-06-27)</h4>\n<ul>\n<li>Import: Fix bug in exit statements.</li>\n</ul>\n<h4>1.2.0 (2022-06-27)</h4>\n<ul>\n<li>Import: Templates: Clarify the interface.</li>\n<li>Import: Custom: Check if provided option name does exist.</li>\n<li>Import: Fix bug in exit statement display.</li>\n</ul>\n<h4>1.1.1 (2022-06-27)</h4>\n<ul>\n<li>Template editor: Backup preview: Improve page searchability by adding the same display toggle as on Settings.</li>\n</ul>\n<h4>1.1.0 (2022-06-25)</h4>\n<ul>\n<li>Security: Internal style sheets: Escape style tag elements and arguments.</li>\n<li>Settings: Backup: Previews: Add scriptless display toggle.</li>\n<li>Settings: Improve page searchability by removing backup data preview display from default view.</li>\n<li>Settings: Backup: Make tab navigation more fluid by skipping how-to and preview items.</li>\n</ul>\n<h4>1.0.4 (2022-06-23)</h4>\n<ul>\n<li>Localization: Update translations to fix bugs in wording.</li>\n<li>Template editor: Improve fix of bug appearing at plugin activation.</li>\n</ul>\n<h4>1.0.3 (2022-06-22)</h4>\n<ul>\n<li>Notes and sources: Anchor tooltips: Fix display bug.</li>\n<li>Notes and sources: Backlink tooltips: Fix display bug.</li>\n</ul>\n<h4>1.0.2.1 (2022-06-22)</h4>\n<ul>\n<li>Documentation: Add screenshots.</li>\n</ul>\n<h4>1.0.2 (2022-06-22)</h4>\n<ul>\n<li>Security: Flush unsafe previous versions from the repository.</li>\n</ul>\n<h4>1.0.1 (2022-06-22)</h4>\n<ul>\n<li>Code: Split six files off <code>anrghg.php</code> to keep the code editable online.</li>\n</ul>\n<h4>1.0.0 (2022-06-22)</h4>\n<p>▶ Plugin re-listing: As of 2022-06-21, this plugin has been re-listed in the Plugin Directory.</p>\n<ul>\n<li>First production release.</li>\n</ul>\n<h4>0.81.9 (2022-06-20)</h4>\n<ul>\n<li>Template editor: Fix bug in form by using correct escapement function and whitelist.</li>\n</ul>\n<h4>0.81.8 (2022-06-20)</h4>\n<ul>\n<li>Code: Fix remaining formatting issues before submission.</li>\n</ul>\n<h4>0.81.7 (2022-06-20)</h4>\n<ul>\n<li>Security: KSES whitelist: Extend global attributes for a11y.</li>\n<li>Security: Escape Settings page, Templates editor, other Admin pages.</li>\n<li>Security: Stall unimplementable security patches.</li>\n<li>Notes and sources: Fix bug in deactivation setting in Post Meta box.</li>\n<li>Notes and sources: Replace checkbox with radio buttons in Post Meta box.</li>\n</ul>\n<h4>0.81.6 (2022-06-18)</h4>\n<ul>\n<li>Security: KSES whitelist: Fix bug in whitelist extension.</li>\n<li>Security: Stop trying to use a global KSES whitelist.</li>\n<li>Security: Date meta tags: Tailor KSES whitelists to the instance.</li>\n</ul>\n<h4>0.81.5 (2022-06-18)</h4>\n<ul>\n<li>Security: Internal style sheets: Secure output.</li>\n<li>Security: Internal style sheets: Restore direct child selectors.</li>\n<li>Security: KSES: Try implementing the whitelist with extensions.</li>\n</ul>\n<h4>0.81.4 (2022-06-17)</h4>\n<ul>\n<li>Revert to 0.81.0, fix broken plugin, remove KSES.</li>\n<li>Template files: Keep latest versions.</li>\n<li>Template editor: Fix alignment of ‘Move into editor’ buttons.</li>\n<li>Admin pages: Header menu: Add plain tooltips.</li>\n</ul>\n<h4>0.81.3 (2022-06-16)</h4>\n<ul>\n<li>Security: Settings: Escape UI elements and information.</li>\n<li>Security: Post Meta box: Escape UI elements.</li>\n<li>Template editor: Remove pointy bracket conversion.</li>\n<li>Template editor: Fix alignment of ‘Move into editor’ buttons.</li>\n<li>Admin pages: Header menu: Add plain tooltips.</li>\n</ul>\n<h4>0.81.2 (2022-06-15)</h4>\n<ul>\n<li>Security: Settings: Escaping output: Correct <code>wp_kses()</code> with custom whitelist POC.</li>\n</ul>\n<h4>0.81.1 (2022-06-15)</h4>\n<ul>\n<li>Security: Settings: Escaping output: <code>wp_kses()</code> with custom whitelist POC.</li>\n</ul>\n<h4>0.81.0 (2022-06-14)</h4>\n<ul>\n<li>Security: Remove Custom CSS feature and CSS configuration filters.</li>\n</ul>\n<h4>0.80.9 (2022-06-14)</h4>\n<ul>\n<li>Security: Make login deactivation profile global to fix bug in login deactivation screen.</li>\n<li>[Stalled: Security: Escape output on Settings page.]</li>\n</ul>\n<h4>0.80.8 (2022-06-12)</h4>\n<ul>\n<li>Security: CSS: Remove direct child selectors so as to be able to use <code>wp_kses_post()</code>.</li>\n<li>Security: Revert escaping JavaScript using <code>esc_js()</code> to prevent deactivating single quotes.</li>\n<li>Refactor: Shorten configuration keys to max 44 characters to avoid PHPCS alignment issues.</li>\n<li>Bugfix: Configuration arrays: Replace <code>+</code> with <code>array_merge()</code>.</li>\n<li>Bugfix: <code>sanitize_title</code> filter.</li>\n</ul>\n<h4>0.80.7 (2022-06-11)</h4>\n<ul>\n<li>Security: Escape minified JavaScript code using <code>esc_js()</code> for output as internal script.</li>\n<li>Security: Replace <code>json_encode()</code> with <code>wp_json_encode()</code>.</li>\n</ul>\n<h4>0.80.6 (2022-06-10)</h4>\n<ul>\n<li>Settings: Revert 0.80.5 sanitization of hexadecimal color codes with <code>sanitize_hex_color()</code>.</li>\n<li>Security: Sanitize all filtered configuration values using <code>wp_kses_post()</code>.</li>\n<li>Security: Export/import: Escape file name using <code>sanitize_file_name()</code>.</li>\n<li>Security: Export/import: Escape file contents using <code>wp_kses_post()</code>.</li>\n<li>Template editor: Debug &#8216;Move into editor&#8217; button: Make button functional in Text mode too.</li>\n<li>Template editor: Mitigate a bug occurring when clicking the ‘Move into editor’ button after switching to Text mode.</li>\n<li>[Stalled: Security: Escape minified JavaScript code using <code>esc_js()</code> for output as internal script.]</li>\n</ul>\n<h4>0.80.5 (2022-06-10)</h4>\n<ul>\n<li>Network Admin: Plugin action links: Revert wrong 0.80.3 edit.</li>\n<li>Admin pages: Sanitize page titles using <code>esc_html()</code> before output.</li>\n<li>Settings: Sanitize hexadecimal color codes using <code>sanitize_hex_color()</code> before output.</li>\n<li>Slug as body class: Sanitize the class name using <code>sanitize_html_class()</code>.</li>\n</ul>\n<h4>0.80.4 (2022-06-09)</h4>\n<ul>\n<li>Security: Export/import: Custom option: Sanitize the option name input field value.</li>\n<li>Security: Fix bug due to the auth cookie not being editable regardless what Boolean the constant is defined as.</li>\n</ul>\n<h4>0.80.3 (2022-06-07)</h4>\n<ul>\n<li>Network Admin: Plugin action links: Add a warning by lack of the <code>Delete</code> action.</li>\n</ul>\n<h4>0.80.2 (2022-06-07)</h4>\n<ul>\n<li>Settings: Fix bug causing the right-to-left page to x-scroll out of the viewport.</li>\n</ul>\n<h4>0.80.1 (2022-06-05)</h4>\n<ul>\n<li>Template editor: Fix bug appearing at plugin activation.</li>\n</ul>\n<h4>0.80.0 (2022-06-04)</h4>\n<ul>\n<li>Submission for re-review.</li>\n<li>Test in WordPress 6.0.</li>\n<li>Change license from ‘GPLv2’ to ‘GPLv2 or later’ with respect to the AMP-HTML framework.</li>\n<li>Meta box: Display in page editors too.</li>\n<li>Move NPM and Webpack configuration to admin/ next to the block source and production files.</li>\n</ul>\n<h4>0.79.0 (2022-06-02)</h4>\n<ul>\n<li>Documentation: Update contact information and home page address.</li>\n</ul>\n<h4>0.78.0 (2022-05-31)</h4>\n<ul>\n<li>Documentation: Comply with <a href=\"https://wordpress.org/support/guidelines/\" rel=\"ugc\">Forum guidelines</a> by not mentioning specific webhosts.</li>\n</ul>\n<h4>0.77.1 (2022-05-29)</h4>\n<ul>\n<li>Settings: Text align setting: Move the ‘Center’ option from ‘Writing direction sensitive’ to ‘Stable across locales’.</li>\n</ul>\n<h4>0.77.0 (2022-05-07)</h4>\n<ul>\n<li>Notes and sources: Adapt base-26 alphabetic Latin numbering system to 1-based numbering.</li>\n<li>Notes and sources: Delimiter syntax error warning (optionally hidden or deactivated).</li>\n<li>Notes and sources: Tooltips: Add transition timing function.</li>\n<li>Settings: Date information: Alignment, margins, font size and color for posts/pages at top/end.</li>\n<li>Settings: Notes and sources: Tooltip timing settings.</li>\n<li>Settings: Notes and sources: Lists: Backlink tooltips: Aspect configurable independently.</li>\n<li>Settings: Delete trailing commas in function arguments to restore compatibility with PHP 5.6.</li>\n</ul>\n<h4>0.76.0 (2022-04-30)</h4>\n<ul>\n<li>Settings: Padding and margin input field arrays.</li>\n<li>Reference list: Change transition timing for opacity at collapsing to improve aspect.</li>\n<li>Notes and sources: Change transition timing for opacity at collapsing lists to improve aspect.</li>\n<li>Conversion: Import section for upcoming format conversion .docx ➔ WordPress with inline complements.</li>\n</ul>\n<h4>0.75.0 (2022-04-28)</h4>\n<ul>\n<li>Thank You message: Debug styling of messages inserted by block following 0.73.0 CSS debugging.</li>\n<li>Thank You message: Setting in the Block Inspector to add one out of ten CSS classes.</li>\n<li>Thank You message: Headline in the block, hinting that templates are supported.</li>\n<li>Settings: Border radius setting in the border settings.</li>\n<li>Notes and sources: Stop transitioning opacity at collapsing lists to avoid ugly crowded overlay.</li>\n<li>Reference list: Stop transitioning opacity at collapsing to avoid ugly crowded overlay.</li>\n</ul>\n<h4>0.74.0 (2022-04-23)</h4>\n<ul>\n<li>Localization: Support titlecase in fragment identifiers.</li>\n<li>Localization: Maximum length of slugs and fragment IDs freely configurable.</li>\n<li>Localization: Optionally generate post/page slugs the alternative way, too.</li>\n<li>Settings: Paragraph links: Maximum length configurable separately.</li>\n<li>Settings: Reference lists: Bigger choice of bullets in the select box.</li>\n<li>Settings: Thank You message: Border and shadow.</li>\n<li>Settings: Notes and sources: Anchor tooltips: Colors, border and shadow.</li>\n<li>Settings: Get screen readers to read unicodes as prefixed hex numbers.</li>\n<li>Notes and sources: Clean up stray meta tags in the content.</li>\n<li>Export/import: Feature to freely configure an additional option name.</li>\n</ul>\n<h4>0.73.0 (2022-04-18)</h4>\n<ul>\n<li>Heading links: Optional, configurable tooltip ’Permalink to this heading’.</li>\n<li>Thank You message: Debug CSS in case of nested divs coming in from the template.</li>\n<li>Template editor: Display a warning when unable to move template into editor.</li>\n<li>Dates: Output inline CSS on the condition of activation only.</li>\n<li>Notes and sources: Tooltips: Add output hook.</li>\n<li>Output hooks: Collapse spaces in output.</li>\n</ul>\n<h4>0.72.0 (2022-04-17)</h4>\n<ul>\n<li>Reference list: Support 6 numbering systems and optionally a configurable bullet.</li>\n</ul>\n<h4>0.71.0 (2022-04-16)</h4>\n<ul>\n<li>Table of contents: Debug insertion.</li>\n<li>Settings: Anchor tooltips: Add missing callback function.</li>\n<li>Thank You message: Optionally display on home page.</li>\n<li>Thank You message: Comma-separated list in settings for message select dropdown in Post Meta box.</li>\n<li>Paragraph links: Optional, configurable tooltip ’Permalink to this fragment’.</li>\n<li>Settings: Move fragment ID max length setting from ‘Paragraph links’ to ‘Localization’.</li>\n</ul>\n<h4>0.70.0 (2022-04-13)</h4>\n<ul>\n<li>Settings: Thank You message: Foreground and background color settings.</li>\n<li>Settings: Debug composite adjacent radio button labels.</li>\n<li>Settings: Menu position: Display the full radio button labels.</li>\n<li>Settings: Security: Login screen profile: Fix layout of the radio button labels.</li>\n<li>Settings: Interoperability: Option to turn off URL line wrap anywhere.</li>\n<li>Settings: Notes and sources: Options to deactivate the ‘Read more’ link in dedicated tooltips for notes or for sources.</li>\n<li>Notes and sources: Fix bug in AMP full list expansion on clicking an anchor.</li>\n<li>Notes and sources: Tooltips: Optionally toggle display on tap to work around context menu interference on mobiles.</li>\n<li>Settings: Template editor: Option to choose TinyMCE behavior on Enter.</li>\n<li>Settings: Template editor: Option to choose between TinyMCE and plain textarea.</li>\n<li>Reference list: Label element and font size configurable.</li>\n</ul>\n<h4>0.69.0 (2022-04-07)</h4>\n<ul>\n<li>Thank You message: Add output hooks.</li>\n<li>Output hooks: Improve existing templates.</li>\n<li>Reference list: Print: Debug expanded display, hide twistie.</li>\n<li>Notes and sources: Optional numbering with Roman, Latin or Eastern Arabic digits.</li>\n<li>Notes and sources: Lists: Print: Debug expanded display, hide twistie.</li>\n<li>Settings: Reference lists: Make list item link optional.</li>\n<li>Settings: Header menu on admin pages to palliate the lack of admin menu items.</li>\n</ul>\n<h4>0.68.0 (2022-04-02)</h4>\n<ul>\n<li>Security: Authentication cookie duration: Hard-code the restriction to one year plus a week.</li>\n<li>Export/import: Import: Templates: Correct default behavior to merge, not overwrite.</li>\n<li>Export/import: Import: Templates: Add alternative form to import and overwrite templates.</li>\n<li>Export/import: Export: Templates: Show reordered data for convenience with explanation.</li>\n<li>Settings: New section about excerpts.</li>\n<li>Excerpts: Automatic excerpt generation redesign becomes optional and may be turned off.</li>\n<li>Excerpts: Application of ‘the_content’ filters to manual excerpts now optional.</li>\n<li>Excerpts: Option to apply ‘the_content’ filters to automatic excerpts.</li>\n<li>Notes and sources: Anchors: Fix line break in front of opening punctuation by prepending a word joiner.</li>\n<li>Notes and sources: Option to space out the anchor by (fixed-width) CSS or by (justifying) space character.</li>\n<li>Settings: Notes and sources: Anchors: Add glide switch to deactivate the prefixed word joiner.</li>\n</ul>\n<h4>0.67.0 (2022-03-29)</h4>\n<p>▶ Plugin closure: As of 2022-03-21, this plugin has been temporarily closed pending a full review. In this new setup, no urgent bug fixes nor upgrade notices are required any longer. We beg the Plugin Directory’s pardon for the unfinished state, as initial release was fast-tracked in response to user requests for AMP compatible endnotes. We are striving to get the A.N.R.GHG Publishing Helper completed as soon as possible. Thank you for your understanding.</p>\n<ul>\n<li>Template editor: Debug display of TinyMCE color pickers included in WordPress.</li>\n<li>Template editor: Remove TinyMCE Color Picker plugin internalized for security.</li>\n<li>Export/import: Import: Fix bug in redirect when the page is in the Tools submenu.</li>\n<li>Export/import: Support templates too.</li>\n<li>Export/import: Export: Display previews of the data.</li>\n<li>Notes and sources: Anchor separator: Fix formatting.</li>\n<li>Notes and sources: Anchor separator: Support mixed sequences.</li>\n<li>Reference list: Numbered list instead of bullet list.</li>\n<li>Reference list: Direct link to each list item in its number.</li>\n<li>Reference list: Transitioning expansion and collapsing.</li>\n<li>Settings: Reference lists: ARIA label for reference items configurable.</li>\n<li>Settings: Reference lists: Configurable plain tooltip on item numbers.</li>\n<li>Settings: Reference lists: URL ID prefix configurable.</li>\n</ul>\n<h4>0.66.0 (2022-03-24)</h4>\n<ul>\n<li>Settings: Security: Raise information and settings to top position on settings page.</li>\n<li>Paragraph links: Optional lower, configurable length limit on fragment identifiers.</li>\n<li>Notes and sources: Backlinks: Plain tooltip preset: Replace U+2B05 with ordinary left arrow.</li>\n<li>Interoperability: Additional content hooks: Change name from <code>anrghg_content_filter_hook</code> to <code>anrghg_the_content</code>.</li>\n<li>Settings: Interoperability: Add information about editing term descriptions, with links to plugin and issue.</li>\n<li>Settings: Interoperability: Link Elementor and Yoast SEO to the respective pages in the Plugin Directory.</li>\n<li>Settings: User interface: Clarify and rename the ‘Gutenberg blocks’ settings field.</li>\n<li>Settings: Add ‘Reference lists’ settings section.</li>\n<li>Settings: Reference lists: ARIA label, label, collapsible behavior, priority level configurable.</li>\n</ul>\n<h4>0.65.2 (2022-03-22)</h4>\n<ul>\n<li>Notes and sources: Lists: Fix bug in line height of target row.</li>\n</ul>\n<h4>0.65.1 (2022-03-22)</h4>\n<ul>\n<li>Notes and sources: Lists: Fix bug in backlink symbol.</li>\n<li>Settings: Notes and sources: Lists: Fix bug in backlink symbol select box.</li>\n</ul>\n<h4>0.65.0 (2022-03-22)</h4>\n<ul>\n<li>Localization: Add support for the remaining 4 English sublocales, copied from en_GB.</li>\n<li>Notes and sources: Lists: Lightweight transition by CSS when expanding and collapsing.</li>\n<li>Reference list: Lightweight transition by CSS when expanding and collapsing.</li>\n<li>Settings: Notes and sources: Lists: Backlink symbol select box and position settings.</li>\n<li>Settings: Notes and sources: List and group label elements optionally configurable.</li>\n</ul>\n<h4>0.64.0 (2022-03-21)</h4>\n<ul>\n<li>Localization: Set up language support for Spanish and all 9 sublocales supported in WordPress.</li>\n<li>Internationalization: Debug plugin short and long name localization.</li>\n<li>Notes and sources: Lists: Labels and group heading: Debug font size.</li>\n<li>Notes and sources: Anchor tooltips: Replace paragraph breaks and double line breaks with a paragraph break emulator span.</li>\n<li>Settings: Notes and sources: Group heading font size optionally configurable.</li>\n<li>Settings: Notes and sources: List label font size optionally configurable.</li>\n</ul>\n<h4>0.63.1 (2022-03-19)</h4>\n<ul>\n<li>Settings: Notes and sources: Dedicated tooltips: Sources: Fix index error.</li>\n<li>Settings: Notes and sources: Generic tooltips activatable and configurable.</li>\n</ul>\n<h4>0.63.0 (2022-03-19)</h4>\n<ul>\n<li>Interoperability: Optional support for Advanced Custom Fields.</li>\n<li>Notes and sources: Ability to process custom fields separately.</li>\n<li>Settings: Interoperability: Move Elementor test mode activation from <code>wp-config.php</code> to settings.</li>\n<li>Settings: Interoperability: Setting to control whether HTML is allowed in term descriptions.</li>\n<li>Settings: Localization: Fragment identifier separator configurable.</li>\n<li>Settings: Notes and sources: Adjacent anchor separator configurable, not mandatory any longer.</li>\n<li>Settings: Notes and sources: Anchor prefix and suffix configurable.</li>\n<li>Settings: Notes and sources: ARIA labels for anchors freely configurable.</li>\n<li>Settings: Notes and sources: Excluded posts and pages configurable by post IDs.</li>\n<li>Settings: Notes and sources: New section dedicated to anchors.</li>\n<li>Settings: Notes and sources: Reorder sections about lists and anchor tooltips.</li>\n<li>Settings: Notes and sources: Setting to configure the anchor ID prefix.</li>\n<li>Settings: Options to collapse textual information, expanded by default.</li>\n<li>Settings: Separate sections Localization, Interoperability.</li>\n<li>Settings: Table of contents: Fragment identifier priority level configurable.</li>\n<li>Settings: Table of contents: Heading URL ID prefix configurable.</li>\n<li>Settings: Table of contents: Optional heading level indentation configurable.</li>\n<li>Settings: Table of contents: Top level heading font weight configurable.</li>\n<li>Settings: User experience: Setting for generic mobile breakpoint.</li>\n<li>Settings: User experience: Settings for generic list top and bottom margins.</li>\n</ul>\n<h4>0.62.12.2 (2022-03-13)</h4>\n<ul>\n<li>Documentation: Updates.</li>\n</ul>\n<h4>0.62.12.1 (2022-03-13)</h4>\n<ul>\n<li>Settings: Complement list group heading font size unit.</li>\n<li>Documentation: Updates.</li>\n</ul>\n<h4>0.62.12 (2022-03-13)</h4>\n<ul>\n<li>Updates.</li>\n</ul>\n<h4>0.62.11 (2022-03-06)</h4>\n<ul>\n<li>Internationalization: Update configuration files.</li>\n<li>Localization: Add en_GB and en_US (as a minimum).</li>\n<li>Settings: Localization and interoperability: Fix spelling error.</li>\n<li>Blocks: Update plugin name after adding dots for 0.62.6.</li>\n<li>Blocks: Description: Internationalize plugin long name and ‘Notes and sources’ block name.</li>\n</ul>\n<h4>0.62.10 (2022-03-04)</h4>\n<ul>\n<li>Admin pages: Debug submenu items ‘Export’ and ‘Import’ when deactivated while menu level is top.</li>\n<li>Plugin list: Debug action links when submenu items ‘Export’ and ‘Import’ are deactivated while menu level is top.</li>\n<li>Export/import: Debug page titles when submenu items ‘Export’ and ‘Import’ are deactivated while menu level is top.</li>\n<li>Admin pages: Internationalization: Make space-padded em dash localizable for any eventuality.</li>\n<li>Settings: Settings table of contents: Get hover highlighting consistent with link area.</li>\n</ul>\n<h4>0.62.9 (2022-03-03)</h4>\n<ul>\n<li>Admin pages: Restore page title when no menu item (as is the default).</li>\n</ul>\n<h4>0.62.8 (2022-03-03)</h4>\n<ul>\n<li>Settings: Localization and interoperability: Increase identifier legibility: Fix typo in placeholder inserting anchor element end tag.</li>\n<li>Settings: Fix lack of whitespace in glide switch effect information display since 0.62.6.</li>\n<li>Configuration filters: Shorten file name <code>configuration-filters.php</code> to <code>tpl-filter-config.php</code>.</li>\n<li>Output filters: Rename <code>process-filters.php</code> to <code>tpl-filter-output.php</code>.</li>\n<li>WordPress configuration additions: Shorten template file name <code>wp-config-additions.php</code> to <code>tpl-wp-config.php</code>.</li>\n<li>Mini plugin template: Shorten file name <code>mini-plugin-template.php</code> to <code>tpl-mini-plugin.php</code>.</li>\n</ul>\n<h4>0.62.7 (2022-03-02)</h4>\n<ul>\n<li>Post Meta box: Correct Table of contents section label when block is not in the post.</li>\n<li>Settings: Add new name variable to the parameters passed to the callback functions.</li>\n<li>Settings: Remove a trailing comma after multiline arguments, for PHP backwards compatibility.</li>\n</ul>\n<h4>0.62.6 (2022-03-02)</h4>\n<ul>\n<li>Post Meta box: Debug the label with respect to accessibility and design.</li>\n<li>Post Meta box: Fix screen reader output by replacing the table captions with fieldset labels.</li>\n<li>Plugin initialism: Add dots for readability by screen readers.</li>\n<li>Plugin initialism: Add dots to prevent mistaking it as a misspelled interjection in all caps.</li>\n<li>Style sheets: Reduce CSS footprint by improving a minification algorithm for CSS.</li>\n</ul>\n<h4>0.62.5 (2022-02-27)</h4>\n<ul>\n<li>Term descriptions: Debug provisional option added for 0.62.4.</li>\n<li>Settings: Additional CSS: Debug i18n by using newline-free strings in the placeholder text.</li>\n<li>Settings: Gutenberg blocks: Activate by default blocks deactivated with the feature (‘Table of contents’, ‘Notes and sources’).</li>\n</ul>\n<h4>0.62.4 (2022-02-25)</h4>\n<ul>\n<li>Settings: Replace ‘Shared configuration’ with ‘User experience’.</li>\n</ul>\n<h4>0.62.3 (2022-02-23)</h4>\n<ul>\n<li>Export/import: Fix internationalization bug in ‘Export’ and ‘Import’ titles and submenu labels.</li>\n</ul>\n<h4>0.62.2 (2022-02-22)</h4>\n<ul>\n<li>Settings: Restore compatibility with PHP 5.6 by correcting four instances of novel syntax.</li>\n</ul>\n<h4>0.62.1 (2022-02-21)</h4>\n<ul>\n<li>Table of contents: Stop preventing long headings from line-wrapping.</li>\n</ul>\n<h4>0.62.0 (2022-02-21)</h4>\n<ul>\n<li>Admin menu: Debug submenu item removal checkbox.</li>\n<li>Export/import: New dedicated pages where the feature is functional for the settings.</li>\n</ul>\n<h4>0.61.5 (2022-02-20)</h4>\n<ul>\n<li>Settings: Fix bug in submit button.</li>\n<li>Notes and sources: Remove number and tooltip text from fragment identifiers also when processed at higher priority.</li>\n<li>Admin menu: Optional export page and import page for settings and templates (provisional).</li>\n</ul>\n<h4>0.61.4 (2022-02-20)</h4>\n<ul>\n<li>Internationalization: Fix warnings about multiple translator comments in WP CLI.</li>\n<li>Localization: Update folder name in translations <code>load_plugin_textdomain()</code> function.</li>\n<li>Localization: Provisional <code>anrghg-fr_FR.po</code> and <code>anrghg-fr_FR.mo</code> files for test purposes.</li>\n<li>Settings: Submit button: Prevent checkboxes from displaying over the ‘Save Changes’ button.</li>\n<li>Settings: Submit button: Position closer to the bottom viewport edge on mobiles.</li>\n<li>Settings: UI elements: Complete refactoring to improve scalability and maintainability.</li>\n</ul>\n<h4>0.61.3 (2022-02-19)</h4>\n<ul>\n<li>Settings: Fix error in function generating fieldset markup.</li>\n<li>Settings: Notes and sources: Debug internationalization of delimiter configuration UI elements.</li>\n<li>Settings: UI elements: Resume pending refactoring tasks to improve scalability and maintainability.</li>\n</ul>\n<h4>0.61.2 (2022-02-18)</h4>\n<ul>\n<li>Settings: Fix syntax for PHP 5.6 compatibility.</li>\n</ul>\n<h4>0.61.1 (2022-02-18)</h4>\n<ul>\n<li>Settings: Fix bug due to suspended refactoring.</li>\n</ul>\n<h4>0.61.0 (2022-02-18)</h4>\n<ul>\n<li>Reference list: Debug column number while waiting for separate configuration.</li>\n<li>Settings: URL slug as a CSS selector: Add missing placeholder text in the switch label.</li>\n<li>Admin menu: Internationalize submenu labels for synergy with WordPress Core.</li>\n<li>Reusable complement editor: Rename page to ‘Templates — Template editor’ for consistency with submenu label.</li>\n<li>Template editor: Save button: Internationalize label for synergy with WordPress Core.</li>\n<li>Template editor: Save button: Add plain tooltip hinting to edit the list fields directly.</li>\n<li>Settings: Save button: Internationalize label for synergy with WordPress Core.</li>\n<li>Localization: Add POT file (provisional).</li>\n<li>Localization: Fix and complete the placeholders and comments for Translators.</li>\n<li>Settings: Extend discrete radio button template to be fully versatile.</li>\n<li>Conversion: Save button: Internationalize label for synergy with WordPress Core.</li>\n</ul>\n<h4>0.60.7 (2022-02-16)</h4>\n<ul>\n<li>Settings: Dates: Reorder label configuration fields consistently with activation checkboxes.</li>\n<li>Settings: Avoid the word “Custom” as this is about configuration, not customization.</li>\n</ul>\n<h4>0.60.6 (2022-02-15)</h4>\n<ul>\n<li>Settings: Debug and correct UI labels and descriptions.</li>\n<li>Settings: Reimplement a select box function.</li>\n<li>Settings: Fix HTML markup.</li>\n</ul>\n<h4>0.60.5 (2022-02-14)</h4>\n<ul>\n<li>Settings: Security: Debug the section’s broken introductory text.</li>\n<li>Settings: Notes and sources: Lists: Rich backlink tooltips: Fix accessibility bug.</li>\n<li>Settings: Notes and sources: Lists: ARIA labels: Fix accessibility bug.</li>\n<li>Settings: Notes and sources: Lists: List link text: Fix accessibility bug.</li>\n<li>Settings: Notes and sources: Anchor tooltips string length breakpoint: Fix accessibility bug.</li>\n<li>Settings: Notes and sources: Lists: Rich backlink tooltips: Fix bug in the second input field.</li>\n<li>Settings: Notes and sources: Lists: Plain backlink tooltips: Fix bug in the input fields.</li>\n<li>Settings: Notes and sources: Tooltips: Mobile breakpoint: Add expected datalist for input of breakpoints as enumerated.</li>\n</ul>\n<h4>0.60.4 (2022-02-13)</h4>\n<ul>\n<li>Settings: Fix bug in screen reader text disturbing browser search scrolling.</li>\n<li>Settings: Fix bug in fieldset legend to remove screen reader text from browser search results.</li>\n<li>Settings: Adjacent radio buttons: Correct fieldset markup start and end tag positions.</li>\n</ul>\n<h4>0.60.3 (2022-02-11)</h4>\n<ul>\n<li>User interface: Plugin action links: Menu level: Fix bug causing PHP 7.4 to throw a notice.</li>\n<li>Settings: User interface: Properly internationalize strings with nested WordPress menu labels.</li>\n<li>Settings: User interface: Consistency of radio button labels with behavior and displayed strings.</li>\n<li>URL slug as a CSS selector: Fix bug appearing when the slug is empty.</li>\n</ul>\n<h4>0.60.2 (2022-02-10)</h4>\n<ul>\n<li>User interface: Plugin action links: Menu level: Fix PHP 7.4 Notice when adapting targets to configuration.</li>\n</ul>\n<h4>0.60.1 (2022-02-10)</h4>\n<ul>\n<li>Settings: Catch up missing refactorings of the settings page code.</li>\n</ul>\n<h4>0.60.0 (2022-02-10)</h4>\n<ul>\n<li>Settings: Add option to not add the Admin menu items at all, in the menu level setting.</li>\n<li>Admin menu: Change default from submenus to not adding any menu items at all, access from the Plugins list entry.</li>\n<li>Settings: Add checkboxes to individually deactivate Settings page, Template editor, Conversion (draft).</li>\n<li>Settings: Post Meta box: Change default to not adding the Meta box, and all elements to display by default once activated.</li>\n<li>Settings: Gutenberg blocks: Change default to not adding any blocks.</li>\n<li>Settings: Backup: Update the preview labels on clicking the switches.</li>\n<li>Reference list: Styles: Fix undefined variable and mobile breakpoint.</li>\n<li>Menu level: Fix array offset notice by changing strict to loose comparison.</li>\n</ul>\n<h4>0.59.1 (2022-02-05)</h4>\n<ul>\n<li>Settings: Table of contents: Hide screen reader fieldset legend by updating class name.</li>\n</ul>\n<h4>0.59.0 (2022-02-05)</h4>\n<p>▶ The setting for inclusion of generated list labels in the table of contents has been moved from ‘Notes and sources’ to ‘Table of contents’, and it now includes ‘Reference lists’. As a consequence, the key name needed to be changed and its meaning inverted. The feature has been redesigned and does not rely on priority levels any longer; these are now freely configurable and need to be monitored if those labels should actually be included in the table of contents. Hoping that the new design is more convenient, we apologize for the change.</p>\n<ul>\n<li>Reference list: Include in the generated lists for control of exclusion from table of contents.</li>\n<li>Table of contents: Replace setting key <code>anrghg_complement_lists_in_table_of_contents</code> with <code>anrghg_table_of_contents_exclude_generated</code> for consistency.</li>\n<li>Settings: Table of contents: Include Reference lists in the <code>Exclude from table of contents</code> setting.</li>\n<li>Settings: Notes and sources: Lists: Move the <code>Display in table of contents</code> setting to the <code>Table of contents</code> section and invert its meaning.</li>\n</ul>\n<h4>0.58.8 (2022-02-04)</h4>\n<ul>\n<li>Settings: Remove excessive spacing above glide switches by deleting CSS added for 0.58.7.</li>\n<li>Settings: Extend clickable area of radio button and checkbox labels to the maximum width.</li>\n<li>Settings: Notes and sources: Priority level: Correct error in for ID of one label to make it clickable.</li>\n<li>Settings: Priority level: Set in bold consistently the info about WPTexturize deactivation depending on priority level.</li>\n<li>Settings: Additional CSS: Restore text area height.</li>\n</ul>\n<h4>0.58.7 (2022-02-03)</h4>\n<ul>\n<li>Reusable complement editor: Fix display on mobiles.</li>\n<li>Settings: Fix display on mobiles.</li>\n<li>Settings: Fix input element visibility on hovering label with colored background.</li>\n</ul>\n<h4>0.58.6 (2022-02-02)</h4>\n<ul>\n<li>Plugins list: Debug action link targets.</li>\n<li>Settings: Thank You message: Debug Reusable complement editor link target.</li>\n</ul>\n<h4>0.58.5 (2022-02-02)</h4>\n<ul>\n<li>Reference list: Fix bottom spacing.</li>\n<li>Plugins list: Fix bugs in plugin’s list entry.</li>\n</ul>\n<h4>0.58.4 (2022-02-01)</h4>\n<ul>\n<li>Backups: Store backup files of configuration and reusable complements each in a distinct folder.</li>\n<li>Backups: Correct backup file names with respect to using only hyphens, no underscores.</li>\n<li>Backups: Correct non-date-stamped backup file name display by adding ‘-latest’.</li>\n<li>Post Meta box: Thank You message: Double input field height, append help text to the placeholder.</li>\n<li>Post Meta box: Published first information: Textareas instead of single line input fields.</li>\n<li>Settings: Update documentation by replacing underscores with hyphens (0.58.0) in CSS selectors.</li>\n<li>Settings: Fix glide switch label height property for display on mobiles without overlapping.</li>\n<li>Settings: Debug mobile display by fixing the Table of contents alignment input field set and the width of the glide switches.</li>\n<li>Settings: Thank You message: Fix link to the Reusables page, dead when the main menu item was active.</li>\n<li>Settings: Update UI texts following the 0.58 enhancements.</li>\n</ul>\n<h4>0.58.3 (2022-01-31)</h4>\n<ul>\n<li>Reference list: Debug label configuration placeholder and help.</li>\n<li>Table of contents: Change block output to discreet positioner not standing as garbage when feature is off.</li>\n<li>Table of contents: Stop escaping vertical bars, remove related browser alert and its deactivation setting.</li>\n<li>Notes and sources: Change block output to discreet positioner not standing as garbage when feature is off.</li>\n<li>Notes and sources: Stop escaping vertical bar, remove related browser alert and its deactivation setting.</li>\n<li>Notes and sources: Lists: Backlink symbol: Select box: Remove 41 confusable or less supported symbols from options (provisional).</li>\n</ul>\n<h4>0.58.2 (2022-01-30)</h4>\n<ul>\n<li>Reference list: Formatting effective.</li>\n</ul>\n<h4>0.58.1 (2022-01-29)</h4>\n<ul>\n<li>Thank You message: Fix reusables processing outage since 0.58.0 affecting messages added by block.</li>\n<li>Reference list: Add missing block markup processing to generate functional standalone Reference list (provisional).</li>\n<li>Notes and sources: Lists: Backlink symbol: Relabel and reorder select box option groups (provisional).</li>\n</ul>\n<h4>0.58.0 (2022-01-28)</h4>\n<p>▶ The CSS classes must use hyphens, not underscores. We apologize for having used underscores and hurried to replace all underscores with hyphens in CSS class names except those derived from setting keys on the settings page.</p>\n<ul>\n<li>Thank You message: New block to configure and position one or multiple messages.</li>\n<li>Reference list: Add block infrastructure to configure Reference lists (provisional).</li>\n<li>CSS selectors: Comply to standard usage by replacing underscores with hyphens in class names except those derived from setting keys.</li>\n</ul>\n<h4>0.57.0 (2022-01-26)</h4>\n<ul>\n<li>Notes and sources: Optional tail backlink appended to the complement text in the list.</li>\n<li>Notes and sources: Restore scroll offset by adding missing offset anchor class to complement list rows.</li>\n</ul>\n<h4>0.56.0 (2022-01-26)</h4>\n<p>▶ More setting keys required renaming to enhance intuitivity and consistency, after the renamings required by the 0.55.0 minor release. We apologize for the disruptions caused by these improvements.</p>\n<ul>\n<li>Security: Remove login constant customization from configuration filters.</li>\n<li>Notes and sources: Option to configure previous delimiters prior to a configurable post ID using filters.</li>\n<li>Notes and sources: Configuration filter to deactivate the delimiters configured in the Post Meta box.</li>\n<li>Documentation: Template file <code>mini-plugin-template.php</code> for easy setup of a mini plugin for filters.</li>\n<li>Documentation: Templates: WordPress configuration: Templates for debugging mode.</li>\n<li>Documentation: Rename <code>templates-for-configuration-filters.php</code> to <code>configuration-filters.php</code>.</li>\n<li>Documentation: Rename <code>templates-for-process-hooks.php</code> to <code>process-filters.php</code>.</li>\n<li>Documentation: Rename <code>templates-for-additions-to-wp-config.php</code> to <code>wp-config-additions.php</code>.</li>\n<li>Documentation: Rename <code>customized-documentation-schema.txt</code> to <code>documentation-schema.txt</code>.</li>\n</ul>\n<h4>0.55.8 (2022-01-24)</h4>\n<ul>\n<li>Compatibility: Elementor Integration: Check if test mode flag constant is defined.</li>\n</ul>\n<h4>0.55.7 (2022-01-24)</h4>\n<ul>\n<li>Compatibility: Elementor Integration: Restore effectiveness.</li>\n<li>Compatibility: Elementor Integration: Move test mode flag constant to <code>wp-config.php</code>.</li>\n<li>Date meta tags: Close quotation marks at tag end.</li>\n</ul>\n<h4>0.55.6 (2022-01-24)</h4>\n<ul>\n<li>Compatibility: Elementor Integration: Correct erroneous flag.</li>\n</ul>\n<h4>0.55.5 (2022-01-24)</h4>\n<ul>\n<li>Notes and sources: List heading margin top correction while configuration upcoming.</li>\n<li>Table of contents: Table heading margin top correction while configuration upcoming.</li>\n<li>Date information: Prevent isolated dates from being accessed by tab, to avoid screenreader output of technical information out of context.</li>\n<li>Date information: Underline on focus and on hover.</li>\n<li>Compatibility: Elementor Integration: Thank You message: infrastructure.</li>\n</ul>\n<h4>0.55.4 (2022-01-23)</h4>\n<ul>\n<li>Table of contents: Remove spacing before table heading.</li>\n<li>Notes and sources: Remove array shift to fix headings configured in block.</li>\n<li>Notes and sources: Remove spacing before list headings.</li>\n</ul>\n<h4>0.55.3 (2022-01-22)</h4>\n<ul>\n<li>Heading numbers: Debug style by adding the <code>:any-link</code> selector to remove unwanted underline.</li>\n<li>Date information: Remove unwanted underline by using appropriate style rules like for heading numbers.</li>\n</ul>\n<h4>0.55.2 (2022-01-22)</h4>\n<ul>\n<li>Notes and sources: Debug list group heading level.</li>\n</ul>\n<h4>0.55.1 (2022-01-21)</h4>\n<ul>\n<li>Notes and sources: Block: Data: Fix bug by updating two missed instances of a variable name.</li>\n<li>Notes and sources: Change <code>anrghg_source_url_id_prefix</code> default value from <code>ref</code> to <code>source</code>.</li>\n<li>Settings: Notes and sources: Lists: Collapsing behavior: Update a variable name for consistency.</li>\n</ul>\n<h4>0.55.0 (2022-01-20)</h4>\n<p>▶ In expectation of the oncoming Reference list block that may be used to configure collapsible Reference lists as well as short bibilographies and ‘Further reading’ boxes, the word ‘References’ is now being avoided when referring to ‘Notes and sources’. For consistency, intuitivity and ease of maintenance also with respect to users of configuration filters, all related setting keys need to be changed, and the code name of the related block should also be updated since it appears in the post source text and may be used in an automatically added class name, and block-internal attribute names because of their output in markup for storage purposes. Existing blocks keep working but are not editable. Legacy notes-and-references blocks may be converted to HTML by clicking ‘Keep as HTML’ in order to copy the values to a new instance of the block. We apologize for the disruptions, underscoring that the plugin is still declared as in development.</p>\n<ul>\n<li>Notes and sources: Change &#8216;ref&#8217; and &#8216;reference&#8217; to &#8216;source&#8217;, &#8216;references&#8217; to &#8216;sources&#8217; in setting keys, Post Meta keys, block attribute names and the block name.</li>\n<li>Notes and sources: In the process, improve more Post Meta key names.</li>\n<li>Settings: Security: Debug display value of the login control constant end input field for input by copy-paste, autocomplete, or with turned-off JavaScript support.</li>\n<li>Configuration filters: Notes and sources: Debug prefill in list link delimiter configuration filter templates.</li>\n</ul>\n<h4>0.54.5 (2022-01-19)</h4>\n<ul>\n<li>Thank You message: Add missing support for post title placeholder in messages inserted by block (provisional).</li>\n<li>Thank You message: Add missing mention of the post title placeholder below the text area in the Post Meta box.</li>\n<li>Notes and sources: Correct suboptimal ‘References’ to ‘Sources’ in prefills and documentation about complements.</li>\n<li>Settings: Add subsection for complement lists.</li>\n</ul>\n<h4>0.54.4 (2022-01-18)</h4>\n<ul>\n<li>Thank You message: Eliminate failure to parse for reusable complements the messages added by block (provisional).</li>\n</ul>\n<h4>0.54.3 (2022-01-17)</h4>\n<ul>\n<li>Settings: Eliminate multiple accessibility bugs affecting input fields, labels or descriptions.</li>\n</ul>\n<h4>0.54.2 (2022-01-17)</h4>\n<ul>\n<li>Settings: Debug accessibility of the collapsible behavior and collapsed state settings.</li>\n</ul>\n<h4>0.54.1 (2022-01-17)</h4>\n<ul>\n<li>Settings: Debug accessibility of three checkboxes by removing erroneous argument from markup.</li>\n</ul>\n<h4>0.54.0 (2022-01-17)</h4>\n<ul>\n<li>Thank You message: Debug effectiveness of styles by removing the activation condition.</li>\n<li>Settings: Options to remove any of the three added blocks from the block library Design section.</li>\n<li>Settings: Debug complement tooltips section by updating changed function name.</li>\n<li>Settings: Correct section headings, section fragment identifiers, some wording and markup.</li>\n<li>Settings: Correct markup of checkbox fields and labels for consistency with radio buttons.</li>\n</ul>\n<h4>0.53.0 (2022-01-15)</h4>\n<ul>\n<li>Thank You message: Configurable in Post Meta box, never fully deactivated.</li>\n<li>Notes and sources: Deactivation per post as configured in the Post Meta box.</li>\n<li>Paragraph links: Complete the preset options list for the link character.</li>\n<li>Settings: New section ‘Shared configuration’ for settings used in several features.</li>\n<li>Settings: Debug page display on mobiles by fixing the two backup previews.</li>\n<li>Settings: Display direct links to settings sections in two columns except on mobiles.</li>\n</ul>\n<h4>0.52.0 (2022-01-13)</h4>\n<ul>\n<li>Paragraph links: Fix configuration user interface by adding a select box.</li>\n<li>Paragraph links: Include link character configuration in <code>wpml.config</code> for localization.</li>\n</ul>\n<h4>0.51.0 (2022-01-12)</h4>\n<p>▶ The format of the complement block configuration data output has been upgraded due to the addition of settings for collapsible property and collapsed state of lists. Support for the initial format is maintained, and the data storage remains unchanged. When reopening a post in the Block Editor: Please click ‘Attempt Block Recovery’, and everything will be as configured. We apologize for the inconvenience.</p>\n<ul>\n<li>Notes and sources: Block Inspector: Configuration settings for collapsible property and collapsed state.</li>\n<li>Notes and sources: Settings page: Rich and plain backlink tooltip configuration.</li>\n</ul>\n<h4>0.50.2 (2022-01-10)</h4>\n<ul>\n<li>Settings: Rename two keys again for consistency with the naming pattern used for other keys.</li>\n<li>Upgrade Notice: Update 0.50.0 notice accordingly.</li>\n</ul>\n<h4>0.50.1 (2022-01-09)</h4>\n<ul>\n<li>Upgrade Notice: Add notice at 0.50.0 about renamed setting keys.</li>\n<li>Settings: Rename several keys to rectify misleading or incomplete names and improve intuitivity and user experience with string translation panes and configuration filters.</li>\n<li>Multilingual: Support localizable setting keys ahead of implementing the related settings on the settings page.</li>\n<li>Multilingual: Debug <code>anrghg_note_list_label_aria_label</code> and <code>anrghg_reference_list_label_aria_label</code> by updating key names in file <code>wpml-config.xml</code>.</li>\n<li>Configuration filters: Debug <code>anrghg_note_list_label_aria_label</code> and <code>anrghg_reference_list_label_aria_label</code> by updating key names in file <code>wpml-config.xml</code>.</li>\n<li>Documentation: Mention configuration filters for anchor and number ARIA labels, anchor pre- and suffixes and separator, ID elements, and backlink tooltips.</li>\n</ul>\n<h4>0.50.0 (2022-01-07)</h4>\n<p>▶ Two setting keys needed to be renamed because their names were confusing, while they may be read by users of string translation panes or configuration filters: <code>anrghg_list_aria_label_notes</code> to <code>anrghg_list_label_aria_notes</code>, and <code>anrghg_list_aria_label_references</code> to <code>anrghg_list_label_aria_references</code>. For 0.50.1, as this notice is added—apologies for delay—, two other keys need to be renamed because their names were misleading: <code>anrghg_tooltip_read_more_link_text_note</code> to <code>anrghg_complement_tooltip_list_link_text_note</code>, and <code>anrghg_tooltip_read_more_link_text_reference</code> to <code>anrghg_complement_tooltip_list_link_text_reference</code>. In the same move, several keys used in the ‘Notes and sources’ feature, including the first two, are renamed for consistency and completeness to improve intuitivity and user experience with configuration filters. For 0.50.2, <code>_complement</code> in the two keys above is replaced with the moved <code>_note</code> or <code>_reference</code>. We apologize for the inconvenience and hope that the improvements outweigh the trouble of reconfiguring existing installations.</p>\n<ul>\n<li>Priority configuration: Deactivate <code>wpautop()</code> if priority is less (higher) than 11.</li>\n<li>Notes and sources: Remove raw instances from form field values for easier processing.</li>\n<li>Notes and sources: Anchors: ARIA hidden for screenreaders to read ARIA label instead.</li>\n<li>Notes and sources: Anchors: Remove screenreader text spans.</li>\n<li>Notes and sources: Anchors: Streamline ARIA label configuration with %d placeholder.</li>\n<li>Notes and sources: Option for full list display from anchor click if JavaScript is on (AMP compatible).</li>\n<li>Notes and sources: Settings for list collapsing behavior on settings page.</li>\n<li>Notes and sources: Settings for list collapsing behavior in Post Meta box.</li>\n<li>Scroll behavior: Scroll offset: Use CSS scroll-margin-top property.</li>\n</ul>\n<h4>0.49.2 (2022-01-06)</h4>\n<ul>\n<li>Notes and sources: Footer deferral of lists: Debug effectiveness of configuration per instance.</li>\n</ul>\n<h4>0.49.1 (2022-01-05)</h4>\n<ul>\n<li>Date information: Published first information: Debug the feature for robustness across changing prefill configuration.</li>\n<li>Post Meta box: Reduce sometimes too big font sizes through fixed style rules.</li>\n<li>Post Meta box: Table of contents: Collapsing: Reorder radio buttons.</li>\n<li>Post Meta box: Notes and sources: Lists: Footer deferral: Reorder radio buttons.</li>\n<li>Block Inspector: Table of contents: Collapsing: Reorder radio buttons.</li>\n<li>Block Inspector: Notes and sources: Lists: Footer deferral: Reorder radio buttons.</li>\n</ul>\n<h4>0.49.0 (2022-01-05)</h4>\n<p>▶ The setting keys <code>anrghg_meta_box_complements_dir</code> and <code>anrghg_meta_box_list_footer_deferral</code> needed to be renamed to <code>anrghg_meta_box_complements_writing_direction</code> and <code>anrghg_meta_box_complement_list_footer_deferral</code> respectively, for clarity, to improve maintainability. Since their default value is <code>0</code>, the eventually checked checkboxes will be unchecked again, and the settings disappear from the meta box, and conversely for <code>anrghg_meta_box_list_labels</code> renamed to <code>anrghg_meta_box_complement_list_labels</code>. We apologize for the inconvenience.</p>\n<ul>\n<li>Notes and sources: Debug arrays of parsed block or positioner arguments.</li>\n<li>Notes and sources: Add footer deferral argument array to debug parsed argument array initialization.</li>\n<li>Notes and sources: Correct precedence of configuration levels to debug footer deferral effectiveness.</li>\n<li>Notes and sources: Debug footer output by removing the condition about the general setting.</li>\n<li>Notes and sources: Delimiter configuration in Post Meta box.</li>\n<li>Paragraph links, heading links: Use existing ID if configured as HTML anchor in the Block Inspector.</li>\n</ul>\n<h4>0.48.5 (2022-01-03)</h4>\n<ul>\n<li>Settings: Better sync sentences across different settings to simplify oncoming localization.</li>\n<li>Settings: Table of contents: Label: Add information about configuration per instance.</li>\n<li>Settings: Table of contents: Alignment: Move setting down to come before position setting.</li>\n<li>Settings: Table of contents: Depth: Move setting up to come after number setting.</li>\n<li>Settings: Typography: Add description and source.</li>\n<li>Configuration filters: Typography: Add source.</li>\n<li>Configuration filters: Notes and sources: Improve documentation.</li>\n<li>Configuration filters: Notes and sources: Tooltips: Move related filters into this new section.</li>\n</ul>\n<h4>0.48.4 (2022-01-03)</h4>\n<ul>\n<li>Configuration filters: Argument documentation mistake correction.</li>\n<li>Settings: Table of contents: Move up collapsible behavior setting for consistency.</li>\n</ul>\n<h4>0.48.3 (2022-01-02)</h4>\n<ul>\n<li>Settings: Paragraph links: Add feature description under the section title.</li>\n<li>Settings: Table of contents: Add or change descriptions of some settings.</li>\n<li>Configuration filters: Update docblocks in sync with settings.</li>\n<li>Documentation: Add FAQ item ‘Why do setting descriptions not display in tooltips only?’</li>\n</ul>\n<h4>0.48.2 (2022-01-02)</h4>\n<ul>\n<li>Settings: Date information: Debug preview by redesigning the script.</li>\n<li>Settings: Date information: Add description under section title.</li>\n<li>Settings: Date information: Move ordering settings up.</li>\n<li>Settings: Better sync with configuration filter templates.</li>\n<li>Configuration filters: Improve documentation.</li>\n</ul>\n<h4>0.48.1 (2022-01-01)</h4>\n<ul>\n<li>Settings: Corrections, updates and improvements to user interface texts.</li>\n<li>Configuration filters: Sync with settings page.</li>\n</ul>\n<h4>0.48.0 (2021-12-31)</h4>\n<ul>\n<li>Settings: Dedicate an extra section to complement tooltips with respect to upcoming styling options.</li>\n<li>Settings: Move all existing settings related to complement tooltips into the new section.</li>\n<li>Notes and sources: Differentiate tooltip read complement link text depending on whether it links to a note or a reference.</li>\n<li>Notes and sources: Configuration of tooltip read note/reference link text.</li>\n</ul>\n<h4>0.47.0 (2021-12-27)</h4>\n<ul>\n<li>Security: Debug localization of deactivated login screen message.</li>\n<li>Security: Add process hook to change the message.</li>\n<li>Table of contents: Document manual positioner arguments on the settings page.</li>\n<li>Table of contents: Support space padding around equals signs and inside brackets in manual positioner codes.</li>\n<li>Notes and sources: Remove leading slash from configurable manual section end code default, consistently with code inserted by block.</li>\n<li>Notes and sources: Add arguments for note and reference list collapsing behavior tailored to the instance.</li>\n<li>Notes and sources: Document manual section end code arguments on the settings page.</li>\n<li>Notes and sources: Support space padding around equals signs and inside brackets in manual positioner codes.</li>\n</ul>\n<h4>0.46.0 (2021-12-21)</h4>\n<ul>\n<li>Security: Update demo template based on configurable login control constant in real time.</li>\n<li>Settings: Interoperability: Add missing placeholder text in hook names input field.</li>\n<li>Settings: Move Interoperability section up, after General options and before Security.</li>\n<li>Settings: Separate General options section into Backups and User interface sections.</li>\n</ul>\n<h4>0.45.0 (2021-12-18)</h4>\n<ul>\n<li>Security: Multisite support through configurable login action deactivation control constant.</li>\n<li>Configuration filters: Correct typo in <code>anrghg_table_of_contents_collapsing</code> hook name.</li>\n<li>Configuration filters: Add support for table of contents alignment.</li>\n<li>Configuration filters: Update default value of table of contents manual positioner.</li>\n<li>Configuration filters: Add support for complement section manual end delimiter.</li>\n<li>Configuration filters: Update easy input suggestion for complement tooltip end delimiter.</li>\n<li>Configuration filters: Add support for multiline Custom CSS added in a theme’s <code>functions.php</code>.</li>\n<li>Configuration filters: Document unsupported hooks so as not to be considered missing.</li>\n</ul>\n<h4>0.44.1 (2021-12-14)</h4>\n<ul>\n<li>Thank You message: Add demo for placeholder and markup in prefill.</li>\n</ul>\n<h4>0.44.0 (2021-12-14)</h4>\n<p>▶ Apologies for current delays in development, due to urgent investigation on food transition.</p>\n<ul>\n<li>Thank You message: Message configurable in Template editor, same syntax.</li>\n<li>Thank You message: Placeholder %s to insert the post title.</li>\n</ul>\n<h4>0.43.2 (2021-12-12)</h4>\n<ul>\n<li>Settings: Correct text color for higher contrast throughout.</li>\n</ul>\n<h4>0.43.1 (2021-11-27)</h4>\n<ul>\n<li>Security: Debug optional authentication cookie lifespan editing. Apologies for the late debugging.</li>\n</ul>\n<h4>0.43.0 (2021-11-10)</h4>\n<p>▶ The easy preset dedicated tooltip text end delimiter <code>\\\\</code> is replaced with <code>||</code>. We apologize for this change, that is about preferring consistency and intuitivity over ease of input on a US-QWERTY. If you are using <code>\\\\</code>, please input it in the free configuration field and switch to <code>freely configured</code>.</p>\n<ul>\n<li>Notes and sources: Replace easy preset dedicated tooltip text end delimiter <code>\\\\</code> with <code>||</code>.</li>\n</ul>\n<h4>0.42.3 (2021-11-05)</h4>\n<ul>\n<li>Reusable complement editor: Reactivate the tab stop on ‘Move into editor’ buttons for accessibility (deactivated in 0.20.1).</li>\n</ul>\n<h4>0.42.2 (2021-11-03)</h4>\n<ul>\n<li>Table of contents: Provide alternative input for left, center, right as -1, 0, 1.</li>\n<li>Notes and sources: Correct values for footer deferral tailored to the instance: 1 for yes, 0 for no.</li>\n</ul>\n<h4>0.42.1 (2021-10-31)</h4>\n<ul>\n<li>Complement anchor tooltips: Add a left and right margin of 6% to the fullwide tooltips.</li>\n<li>Documentation: Urge to increase the WordPress memory limit (a template is included).</li>\n</ul>\n<h4>0.42.0 (2021-10-29)</h4>\n<ul>\n<li>Table of contents: Collapsing behavior configurable also in the Block Inspector.</li>\n<li>Documentation: Notes and sources: Terminology: Use common ‘anchor’ instead of rare ‘referrer’.</li>\n</ul>\n<h4>0.41.3 (2021-10-22)</h4>\n<ul>\n<li>Table of contents: Collapsing: Take configuration into account from Post Meta box.</li>\n<li>Notes and sources: Fix bug in writing direction value when writing direction setting in Post Meta box is unset.</li>\n<li>Heading links: Fix synergy bug in complement list labels by restricting added markup.</li>\n<li>Post Meta box ‘Complements’: The ‘Published first’, writing direction, and footer deferral settings now deactivated by default.</li>\n</ul>\n<h4>0.41.2 (2021-10-22)</h4>\n<ul>\n<li>Table of contents block: Take into account the new label setting in the Post Meta box.</li>\n</ul>\n<h4>0.41.1 (2021-10-22)</h4>\n<ul>\n<li>Table of contents: Shorten the labels of the collapsing behavior configuration UI elements.</li>\n</ul>\n<h4>0.41.0 (2021-10-21)</h4>\n<ul>\n<li>Notes and sources: Support added text on both sides of a reused complement simultaneously.</li>\n<li>Notes and sources: Support multiple reusable complements nested in a single complement.</li>\n</ul>\n<h4>0.40.1 (2021-10-21)</h4>\n<ul>\n<li>Documentation: Updates.</li>\n<li>Notes and sources: Nest reusable complements: Define missing feature.</li>\n</ul>\n<h4>0.40.0 (2021-10-20)</h4>\n<p>▶ The <code>[/excerpt]</code> delimiter ending a dedicated tooltip text was a misnomer and needs to be replaced with <code>[/view]</code>. If <code>[/excerpt]</code> is already in use, the tooltip end delimiter may be configured accordingly when choosing the <code>free</code> option rather than a preset. We apologize for the inconvenience of not keeping it as the default (&#8216;safe&#8217;) configuration.</p>\n<ul>\n<li>Settings: Notes and sources: Double preset plus free configuration scheme for names, tooltip text and list links.</li>\n<li>Dedicated content filter hook available.</li>\n<li>Login deactivation: High profile screen message customizable using the new process hook.</li>\n<li>Output filters: Start documenting in new file <code>templates-for-process-hooks.php</code>.</li>\n</ul>\n<h4>0.39.0 (2021-10-19)</h4>\n<ul>\n<li>Table of contents: Alignment configuration in meta box.</li>\n<li>Table of contents: Alignment configuration in settings page.</li>\n<li>Table of contents: Collapsing behavior configuration in meta box.</li>\n</ul>\n<h4>0.38.0 (2021-10-18)</h4>\n<ul>\n<li>‘Support alternative content hooks’ configuration setting and filter template.</li>\n<li>Table of contents: Label: The placeholder %s inserts the post title.</li>\n<li>Table of contents: Label configurable also in Post Meta box.</li>\n<li>Fix bug in meta box UI element selection checkboxes.</li>\n<li>Notes and sources: Settings: Configuration of the name end delimiter.</li>\n<li>Notes and sources: Settings: Configuration of the tooltip text end delimiter.</li>\n<li>Notes and sources: Settings: Configuration of the list link start and end delimiters.</li>\n</ul>\n<h4>0.37.0 (2021-10-17)</h4>\n<ul>\n<li>Settings: Localization: Fragment identifiers: Switch to control whether or not to remove diacritics from Latin letters.</li>\n<li>Settings: Localization: Fragment identifiers: Option to add some more letter conversions.</li>\n<li>Settings: Localization: Fragment identifiers: Text area (and configuration filter template) to configure additional conversions.</li>\n<li>Post Meta box: Activate by default as its collapsed state is stored and it remains deactivatable.</li>\n</ul>\n<h4>0.36.0 (2021-10-16)</h4>\n<p>▶ The last modified and published date labels have now a placeholder for the date. That is required for internationalization, but we overlooked it up to now. Our apologies for missing out on this requirement, and for the inconvenience of editing the labels already saved. Please add a per cent sign followed by the letter s where the date shall display.</p>\n<ul>\n<li>Date information: Fix internationalization bug in labels by using <code>%s</code> placeholder.</li>\n<li>Date information: Post Meta box: Input fields to manually add ‘Published first’ information at the top or bottom.</li>\n<li>Settings: Configuration of the ‘Published first’ information prefills in the Post Meta box.</li>\n<li>Notes and sources: Switch to include or exclude the list labels in/from the table of contents.</li>\n<li>Notes and sources: Fix bug in heading level of last list (group) label.</li>\n<li>Notes and sources: Configuration of the priority level for relative list positioning.</li>\n</ul>\n<h4>0.35.2 (2021-10-15)</h4>\n<ul>\n<li>Fix automatic excerpt generation.</li>\n<li>Notes and sources: Process complements in manual excerpts.</li>\n<li>Table of contents: Block: Toolbar: Alignment buttons: Style reflecting state.</li>\n</ul>\n<h4>0.35.1 (2021-10-14)</h4>\n<ul>\n<li>Notes and sources: Fix bug in heading level in the presence of a group heading.</li>\n<li>Category pages: Apply fix provided by WooCommerce to allow rich descriptions.</li>\n<li>Paragraph links: Remove complements from fragment identifiers.</li>\n<li>Table of contents: Remove complements from headings as list items.</li>\n<li>Notes and sources: Debug tooltips on anchors in headings with heading link.</li>\n<li>Heading links: Fix the design in the presence of complement anchors.</li>\n</ul>\n<h4>0.35.0 (2021-10-14)</h4>\n<ul>\n<li>Table of contents: Setting in the block to tailor the label to the instance.</li>\n<li>Table of contents: Switch alignment in the block toolbar with left/center/right/unset buttons.</li>\n<li>Table of contents: Fix text alignment bug due to novel CSS not supported in all browsers.</li>\n<li>Heading numbering: Support position before, as well as generic arrow after without number.</li>\n<li>Notes and sources: New setting for alternative display style of optionally expanded URLs in lists.</li>\n<li>Notes and sources: Tooltips: Automatically enters full-width layout on desktop depending on length.</li>\n<li>Notes and sources: Tooltips: Scrollable tooltips to contain long complements without exceeding the page.</li>\n<li>Notes and sources: Tooltips: Layout threshold values configurable.</li>\n<li>Notes and sources: Setting to deactivate collapsing identicals as depending on the citation style.</li>\n<li>Notes and sources: Setting to deactivate processing widgets separately, as widgets may occur in the post.</li>\n<li>Notes and sources: Option to cut the post into sections based on top-level subheadings.</li>\n</ul>\n<h4>0.34.3 (2021-10-11)</h4>\n<ul>\n<li>Support the content of popups from Popup Builder (Sygnoos).</li>\n<li>Complement list labels: ARIA label only if a given label is definitely empty.</li>\n<li>Complement list labels: Outline on focus on display toggle for keyboard navigation.</li>\n<li>Complement list group heading: Make keyboard navigatable for consistency,</li>\n<li>Settings: Fix input field layout by adding outline not border on focus.</li>\n<li>Reusable complement editor: Names in use list height to adapt to varying toolbar height.</li>\n</ul>\n<h4>0.34.2 (2021-10-10)</h4>\n<ul>\n<li>Support the content of popups from Popup Maker (Code Atlantic).</li>\n<li>Settings: Notes and sources: Lists: Label for the group heading input field.</li>\n</ul>\n<h4>0.34.1 (2021-10-10)</h4>\n<ul>\n<li>Settings: Fix excessive spacing in some instances of glide switches.</li>\n<li>Settings: Fix vertical spacing around text input fields and labels.</li>\n</ul>\n<h4>0.34.0 (2021-10-09)</h4>\n<p>▶ The date meta tags have 4 new option key names for greater flexibility. Please review the setting if you are using it. Our apologies for the disruption.</p>\n<ul>\n<li>Settings: Date meta tags: Flexible configuration with 4 checkboxes and dynamic preview replacing 2 radio buttons.</li>\n<li>Settings: Notes and sources: Lists: Configuration for the labels and ARIA labels.</li>\n<li>Settings: Complement section block UI elements configuration.</li>\n</ul>\n<h4>0.33.0 (2021-10-08)</h4>\n<p>▶ The name and format of the configurable table of contents positioner have changed. Please review the setting if you are using it.</p>\n<ul>\n<li>Paragraph links: Support also code blocks and other preformatted blocks.</li>\n<li>Notes and sources: New (soon optional) Wikipedia-style list group heading.</li>\n<li>Complement list labels: Programmatically determine the accurate heading level.</li>\n<li>Complement list labels: Limit the increased top margin to small screens.</li>\n<li>Complement list labels: Add bottom margin in expanded state.</li>\n<li>Notes and sources: Fix (previously hidden) bug due to an array with undefined offsets.</li>\n<li>Conversion: Activate the form for demo while still in development.</li>\n<li>Settings: Table of contents depth: More intuitive UI element.</li>\n<li>Settings: Complement delimiters: More intuitive UI elements.</li>\n</ul>\n<h4>0.32.1 (2021-10-06)</h4>\n<ul>\n<li>License: Compliance and updates with respect to header notices and the license filename.</li>\n<li>Documentation: Update to account for the internalized TinyMCE Color Pickers.</li>\n<li>Documentation: More precision in the reusable complements syntax by using the space symbol <code>␣</code>.</li>\n</ul>\n<h4>0.32.0 (2021-10-06)</h4>\n<ul>\n<li>Reusable complement editor: Internalize the TinyMCE Color Picker plugin for security.</li>\n</ul>\n<h4>0.31.5 (2021-10-04)</h4>\n<ul>\n<li>Complement section block: Update build after reverting attempt to replace square brackets with comment tag.</li>\n</ul>\n<h4>0.31.4 (2021-10-04)</h4>\n<ul>\n<li>Table of contents: Debug deactivated state.</li>\n<li>Table of contents: Correct the depth setting UI.</li>\n</ul>\n<h4>0.31.3 (2021-09-28)</h4>\n<ul>\n<li>Table of contents: Add dedicated class on AMP pages to cancel unwrapped <code>noscript</code> rules.</li>\n</ul>\n<h4>0.31.2 (2021-09-28)</h4>\n<ul>\n<li>Table of contents: Fix unexpected behavior due to unwrapping <code>noscript</code> style rule on AMP pages.</li>\n</ul>\n<h4>0.31.1 (2021-09-28)</h4>\n<ul>\n<li>Table of contents: Reactivate inserting <code>noscript</code> style rule on AMP pages.</li>\n</ul>\n<h4>0.31.0 (2021-09-27)</h4>\n<ul>\n<li>Notes and sources: Combine identical instances.</li>\n<li>Notes and sources: Fix bug preventing tooltip display at the bottom of the post on mobiles.</li>\n<li>Table of contents: Mitigate a flaw in scroll target when expanding from heading backlink.</li>\n<li>Table of contents: Deactivate inserting <code>noscript</code> style rule on AMP pages.</li>\n</ul>\n<h4>0.30.1 (2021-09-25)</h4>\n<ul>\n<li>Notes and sources: Block: Fix loss of focus in text input fields.</li>\n<li>Notes and sources: Lists: Debug list labels.</li>\n<li>Settings: Correct misnamed keys.</li>\n<li>Settings: Improve radio button and checkbox element identifiers for clarity and expectedness.</li>\n</ul>\n<h4>0.30.0 (2021-09-21)</h4>\n<p>▶ The hook names <code>anrghg_ref_start</code> and <code>anrghg_ref_end</code> are changed to unabridged forms using <code>_reference_</code>. Also, the columns list layout is now configurable individually with keys changing by using <code>_note_</code> or <code>_reference_</code> respectively instead of <code>_complement_</code>. We apologize for the disruption, and for the initial abbreviation. — As links to the options pages are added here to the plugin&#8217;s entry in the Plugins list, the default menu level is changing from Admin main menu to submenus, and the submenu labels are now &#8216;Reusables&#8217; under &#8216;Tools&#8217;, and &#8216;Complements&#8217; under &#8216;Settings&#8217;.</p>\n<ul>\n<li>Compatibility: Elementor Integration to automatically fix layout of appended complement lists.</li>\n<li>Table of contents: Post Meta box setting for activation on a per-post basis.</li>\n<li>Notes and sources: The number of list layout columns configurable separately for notes and for references.</li>\n<li>Notes and sources: Optionally replicate link URL as parenthesized visible text after anchor elements in lists.</li>\n<li>Notes and sources: Block settings to configure list labels and writing direction per instance and per complement type.</li>\n<li>Notes and sources: Block Inspector setting with the effect that complement lists of the section may be deferred to the footer.</li>\n<li>Notes and sources: Post Meta box settings to configure list labels on a per-post and per-complement-type basis.</li>\n<li>Notes and sources: Post Meta box setting to defer to the footer the complement lists of a particular post or page.</li>\n<li>Notes and sources: Change the footer deferral setting to display two options only (not overriding post settings).</li>\n<li>Admin: Fix bug occurring after switching menu level from Settings submenu to Admin main menu.</li>\n<li>Admin: Move the Reusable complement editor’s submenu entry from Settings to Tools.</li>\n<li>Admin: Change the menu entries’ default position from Admin main to Tools and Settings, respectively, with submenu labels ‘Reusables’ under ‘Tools’, and ‘Complements’ under ‘Settings’.</li>\n<li>Admin: Add links to ‘Settings’ and ‘Reusables’ to the plugin’s entry in the Plugins list.</li>\n<li>Settings: Options to control the Post Meta box’ display and displayed configuration items.</li>\n<li>Configuration filters: Change hook names <code>anrghg_ref_start</code> and <code>anrghg_ref_end</code> to unabridged forms using <code>_reference_</code>.</li>\n</ul>\n<h4>0.29.3 (2021-09-06)</h4>\n<ul>\n<li>Get options ahead of schedule to fix undefined variable notice.</li>\n<li>Reimplement conditions in Post Meta box for the process to be able to handle them.</li>\n</ul>\n<h4>0.29.2 (2021-09-06)</h4>\n<ul>\n<li>Rectify erroneous settings key in condition to display the Post Meta box added in 0.29.0.</li>\n</ul>\n<h4>0.29.1 (2021-09-06)</h4>\n<ul>\n<li>Correct (refactor) new 0.29.0 editor Post Meta box code.</li>\n<li>Move writing direction feature request attribution to its place.</li>\n<li>Apply the 0.29.0 writing direction fix to table of contents twistie.</li>\n</ul>\n<h4>0.29.0 (2021-09-05)</h4>\n<ul>\n<li>Notes and sources: Increased syntactic versatility as of completing items either before (new) or after.</li>\n<li>Notes and sources: Post Meta box for the writing direction in complement lists and anchor tooltips for notes and for references separately.</li>\n<li>Fix bug in twisties of collapsible lists due to mirrored CSS rotation in right-to-left writing direction.</li>\n</ul>\n<h4>0.28.1 (2021-09-04)</h4>\n<ul>\n<li>Notes and sources: Debug three-column and two-column list layouts in target mode.</li>\n<li>Notes and sources: Lists: Invert checked property of the prepended display toggle.</li>\n<li>Notes and sources: Debug accessibility of display toggle versus list label.</li>\n<li>Complement anchors: Debug screen reader prefixes.</li>\n<li>Complement anchors: Add affixes for screen readers.</li>\n</ul>\n<h4>0.28.0 (2021-09-03)</h4>\n<ul>\n<li>Notes and sources: Optional three-column and two-column list layouts.</li>\n</ul>\n<h4>0.27.5 (2021-09-02)</h4>\n<ul>\n<li>Settings: Fix two overlooked PHP notices in Security &gt; Login page profile (by deleting forgotten trial code).</li>\n</ul>\n<h4>0.27.4 (2021-09-02)</h4>\n<ul>\n<li>Heading links: New name of the option key, disunified from the table of contents.</li>\n<li>Table of contents: Has now its own option key for a more fine-grained configuration.</li>\n<li>Notes and sources: Process in manual excerpts to display anchors and tooltips.</li>\n<li>Notes and sources: Remove inline complements from automatically generated excerpts.</li>\n<li>Settings: Debug accessibility of radio buttons by adding fieldset and legend elements.</li>\n<li>Settings: Streamline access to settings sections by removing the CSS smooth scrolling.</li>\n<li>Settings: Invert glide switch appearance to make it consistent with the radio buttons.</li>\n<li>Settings: Tune On and Off colors, for consistency with Material Design glide switches.</li>\n<li>Settings: Textarea to input additional CSS rules, helping palliate on-coming settings.</li>\n<li>Upgrade notice: Hide trailing empty element triggering additional icon instance below.</li>\n</ul>\n<h4>0.27.3 (2021-08-31)</h4>\n<ul>\n<li>Add missing setting to activate complement processing as this feature is already deactivated by default.</li>\n</ul>\n<h4>0.27.2 (2021-08-31)</h4>\n<ul>\n<li>Replace Latin strings with numbers as settings values for easy input in Non-Latin writing systems.</li>\n<li>Add missing prefixes to the codes inserted by the blocks to avoid conflicts with other codes.</li>\n<li>Add part of the missing settings in the options page: Security, Paragraph links, Table of contents.</li>\n<li>Deactivate features by default as projected after their settings have been added to the options page.</li>\n<li>Display the Upgrade Notice in its traditional place under the plugin’s entry on the plugins page.</li>\n</ul>\n<h4>0.27.1 (2021-08-30)</h4>\n<ul>\n<li>Parameter for table of contents minimum number of headings present in the page.</li>\n</ul>\n<h4>0.27.0 (2021-08-30)</h4>\n<ul>\n<li>Two blocks for the Block Editor as a more intuitive way to easily position the table of contents or delimit sections for multiple reference lists.</li>\n<li>Add bottom margin below reference lists between sections.</li>\n</ul>\n<h4>0.26.0 (2021-08-27)</h4>\n<ul>\n<li>Setting to activate output of complement lists below (by default; eventually in) the footer globally or per post.</li>\n<li>Setting for complement lists to activate output buffering with notice that PHP 7.3 requires zlib extension.</li>\n<li>Ensure valid CSS class names by prepending an underscore to post or page slugs starting with a digit.</li>\n<li>Fix duplicate fallback style rules on AMP pages.</li>\n<li>More intuitive configuration values for date meta tag formats: <code>common</code> and <code>og</code> for Open Graph, instead of <code>0</code> and <code>1</code>.</li>\n<li>Overhaul the configuration filter templates file.</li>\n<li>Support moving lists into footers of older themes repurposing non-<code>&lt;footer&gt;</code> elements to mark up the footer.</li>\n</ul>\n<h4>0.25.3 (2021-08-26)</h4>\n<ul>\n<li>Fix bug present since 0.25.0 by closing table of contents p tag intersperse preventer division on AMP pages too.</li>\n</ul>\n<h4>0.25.2 (2021-08-25)</h4>\n<ul>\n<li>Update name of upcoming new AMP action <code>toggleChecked()</code>.</li>\n</ul>\n<h4>0.25.1 (2021-08-25)</h4>\n<ul>\n<li>Try to prevent table of contents expand/collapse transition from interfering with backlink scroll offset while in scriptless mode.</li>\n<li>Debug backlinking heading number positional animation so as to prevent the chattering observed in edge cases.</li>\n</ul>\n<h4>0.25.0 (2021-08-24)</h4>\n<ul>\n<li>Use new AMP action <code>toggleCheckboxState</code> to make table of contents collapsible also when JavaScript is turned off.</li>\n<li>Add template file for optional additions to <code>wp-config.php</code>.</li>\n<li>Remove border from collapsed table of contents, is to become optional.</li>\n</ul>\n<h4>0.24.15 (2021-08-13)</h4>\n<ul>\n<li>Debug collapsed height of the table of contents.</li>\n<li>Unset collapsed width while not configurable.</li>\n</ul>\n<h4>0.24.14 (2021-08-13)</h4>\n<ul>\n<li>Debug line height in collapsible table of contents for almost all themes.</li>\n<li>Debug line height in collapsible table of contents for themes where the general fix does not work.</li>\n<li>Set a (soon optional) collapsed width of the table of contents for use with most themes.</li>\n<li>Add FAQ item about using CSS transitions, not JavaScript, for animations.</li>\n</ul>\n<h4>0.24.13 (2021-08-12)</h4>\n<ul>\n<li>Fix the table of contents for AMP.</li>\n<li>Change table of contents default position to before the first heading; start and end positions will become optional.</li>\n<li>Add support for table of contents depth, although incomplete tables are usually suboptimal and disappointing.</li>\n<li>Debug table of contents list item indentation when level 1 headings are present in the article body.</li>\n<li>Add FAQ item about H1 usage and support.</li>\n</ul>\n<h4>0.24.12 (2021-08-12)</h4>\n<ul>\n<li>Revert AMP style tag argument from <code>amp-boilerplate</code> to <code>amp-custom</code> to debug AMP style rules.</li>\n<li>Deactivate format conversion page again while under construction.</li>\n</ul>\n<h4>0.24.11 (2021-08-12)</h4>\n<ul>\n<li>Fix bug in fragment identifier disambiguation numbers. Our apologies for this bug present since 0.24.0.</li>\n<li>Equalize font size across table of contents entries.</li>\n<li>Animation of expand/collapse for table of contents with CSS transitions in synchrony with twistie rotation.</li>\n<li>Prevent long titles from wrapping in table of contents and add simple tooltips to display the full wording.</li>\n<li>Add a prefix to on/off switches’ second label to make clear it describes the effect of the current state.</li>\n<li>Add alert to on/off switches in a changed state to remind that the change won’t be effective unless the settings are saved.</li>\n<li>Make backup file preview frames resizable.</li>\n<li>In script invoked on saving the provisional format conversion page: Fix bug due to variable type ambiguity.</li>\n<li>Fix bug in provisional format conversion script itself due to variable type ambiguity.</li>\n</ul>\n<h4>0.24.10 (2021-08-09)</h4>\n<ul>\n<li>Swap colors and position of the on/off switch knob to match the effect of clicking, not the state.</li>\n<li>Add On and Off symbolic on the switch knobs in the color where the symbol matches the effect of clicking.</li>\n<li>Display the effect of the current switch state in clear text using the empty space below the label.</li>\n<li>Re-add label to on/off switch for the slug-as-CSS-selector feature, removed for v0.24.9.</li>\n<li>Display reusable complements backup sample file below the related switch.</li>\n</ul>\n<h4>0.24.9 (2021-08-07)</h4>\n<ul>\n<li>Correct on/off switch labels by removing the OFF state label, or both ON and OFF if obvious.</li>\n<li>Debug new on/off switch for right-to-left scripts by mirroring 3 writing-direction-unresponsive CSS rules.</li>\n<li>Add shadow and border on focus for a more realistic and intuitive on/off switch knob design.</li>\n<li>Exclude links in the settings page from tab navigation if unexpected or irrelevant for the purpose.</li>\n<li>Fix duplicate message displayed on saving options pages when they are in the Settings submenu.</li>\n<li>Revert class name abbreviations as almost insignificant for CSS budget control for AMP, while screwing up customization.</li>\n</ul>\n<h4>0.24.8 (2021-08-06)</h4>\n<ul>\n<li>Change the URL of the cited <a href=\"https://science.sciencemag.org/content/360/6392/987\" rel=\"nofollow ugc\">Oxford University study</a> following a <a href=\"https://www.theguardian.com/lifeandstyle/2021/aug/04/queen-vegan-cheese-plan-change-dairy-industry?utm_term=429eecc8711b096386f10fec1a88a690&amp;utm_campaign=GreenLight&amp;utm_source=esp&amp;utm_medium=Email&amp;CMP=greenlight_email\" rel=\"nofollow ugc\">new article</a> in The Guardian, pointing to the magazine rather than to the DOI.</li>\n<li>For simple on/off settings, replace two-radio-buttons UI elements with a vertical, checkbox equivalent glide switch design.</li>\n<li>Move the backup file preview frame of the settings from the bottom of the table of contents to the setting where it is configured.</li>\n<li>Refactor settings section callback functions.</li>\n<li>Move settings backup generation and display below the related switch.</li>\n</ul>\n<h4>0.24.7 (2021-08-05)</h4>\n<ul>\n<li>Reorder, refactor and add settings.</li>\n</ul>\n<h4>0.24.6 (2021-08-04)</h4>\n<ul>\n<li>Complete the Customized Documentation Schema with an asterisk markup to account for indirect contributions.</li>\n<li>Set up optional format conversion page aimed at making hard-coded complements automation ready.</li>\n</ul>\n<h4>0.24.5 (2021-07-31)</h4>\n<ul>\n<li>Configuration filters: Document the 0.24.4 additions.</li>\n<li>Simplify the path of the backup, changing from <code>wp-content/uploads/anrghg-backup/</code> to <code>wp-content/uploads/anrghg/</code>.</li>\n</ul>\n<h4>0.24.4 (2021-07-30)</h4>\n<ul>\n<li>Prefix all setting keys with <code>anrghg_</code> to easier retrieve all strings by filtering string translation panes on <code>anrghg</code>.</li>\n<li>Compatibility with translation managers: Add a <code>wpml-config.xml</code> configuration file; adjust process timing to the requirements of configuration value filtering.</li>\n</ul>\n<h4>0.24.3 (2021-07-24)</h4>\n<ul>\n<li>Redesign the configuration options for fragment IDs and table of contents in a more straightforward way.</li>\n<li>Remove the table of contents label twistie and link element when the table is expanded by default.</li>\n</ul>\n<h4>0.24.2 (2021-07-23)</h4>\n<ul>\n<li>Debug the heading 1 level counter for support of errand h1 tags in the article.</li>\n<li>Keep adding missing configuration filters, now for fragment IDs and table of contents.</li>\n</ul>\n<h4>0.24.1 (2021-07-22)</h4>\n<ul>\n<li>Security: Switch to a more fine-grained authentication cookie duration configuration in days instead of weeks.</li>\n<li>Security: Low profile deactivated login screen as default behavior if login deactivation is active, by blocking the authentication cookie sending without any visual changes.</li>\n</ul>\n<h4>0.24.0 (2021-07-21)</h4>\n<ul>\n<li>Security enhancement: Deactivate or reactivate the login dialog by setting a Boolean in <code>wp-config.php</code>.</li>\n<li>Conditionally available feature to edit the duration after which authentication cookies expire.</li>\n<li>Introducing filters to set configuration values in the child theme’s <code>functions.php</code>.</li>\n</ul>\n<h4>0.23.1 (2021-07-13)</h4>\n<ul>\n<li>Fully expand the table of contents on accessing it from a heading backlink, too (if JavaScript is not turned off).</li>\n<li>Complete <code>sanitize_title_with_dashes()</code> with typographic dashes and hyphens U+2010..U+2012, U+2015.</li>\n</ul>\n<h4>0.23.0 (2021-07-05)</h4>\n<ul>\n<li>Define post-level complement names on the fly using the <code>[/name]</code> delimiter (or any string it shall be configurable to).</li>\n</ul>\n<h4>0.22.0 (2021-07-01)</h4>\n<ul>\n<li>Add superscript and subscript, underline formatting buttons in the TinyMCE editor toolbar.</li>\n<li>Add copy, cut, paste action buttons in the TinyMCE editor toolbar.</li>\n<li>Correct configuration settings for unified date metadata labels.</li>\n<li>Raise internal CSS priority level from PHP_INT_MAX to 100 so Theme Custom CSS overrides plugin settings.</li>\n<li>Streamline CSS selectors to reduce impact on CSS budget for AMP compatibility.</li>\n</ul>\n<h4>0.21.1 (2021-06-29)</h4>\n<ul>\n<li>Get backlinks to table of contents to work also when table is collapsed by default.</li>\n</ul>\n<h4>0.21.0 (2021-06-28)</h4>\n<ul>\n<li>Settings to configure the delimiters for inline complements as notes and references.</li>\n<li>Debug page layout when a message is appended to either posts or pages but not to both.</li>\n<li>Remove erroneous case conversion from table of contents, a bug introduced in 0.17.2.</li>\n</ul>\n<h4>0.20.2 (2021-06-27)</h4>\n<ul>\n<li>Autofocus in the relevant name text box at loading the reusable complements page.</li>\n<li>Switch off reliance on wpautop to get TinyMCE insert <code>&lt;br /&gt;</code> tags on Shift+Enter.</li>\n<li>Swap default behavior in TinyMCE to insert <code>&lt;br /&gt;</code> tags on Enter.</li>\n<li>Replace paragraph breaks in tooltips with 2 line breaks because inline CSS tooltips don’t support block level elements.</li>\n<li>Restrict Reusable complement editor toolbar to functionalities working with typical inline complements.</li>\n<li>Default display complements full height in editable divs rather than source code in textareas.</li>\n</ul>\n<h4>0.20.1.1 (update 2021-06-26)</h4>\n<ul>\n<li>Advise to install the TinyMCE Color Picker plugin to enable fore- and background color formatting.</li>\n</ul>\n<h4>0.20.1 (2021-06-25)</h4>\n<ul>\n<li>Streamline tabbing through list by making focus on buttons optional.</li>\n<li>Streamline move-into-editor buttons script, now single with argument.</li>\n</ul>\n<h4>0.20.0 (2021-06-25)</h4>\n<ul>\n<li>Buttons to move any existing complement into TinyMCE as an alternative to editing the complements list.</li>\n</ul>\n<h4>0.19.0 (2021-06-23)</h4>\n<ul>\n<li>Add new complements in the Tiny Moxiecode Content Editor (TinyMCE) as integrated.</li>\n</ul>\n<h4>0.18.0 (2021-06-22)</h4>\n<ul>\n<li>Support for wysiwyg content in reusable new complement editor.</li>\n<li>Complete compatibility with PHP 5.6 in line with <a href=\"https://wordpress.org/about/requirements/\" rel=\"ugc\">WordPress’ policy</a>.</li>\n</ul>\n<h4>0.17.3 (2021-06-20)</h4>\n<ul>\n<li>Support for Swedish fragment identifiers.</li>\n<li>Not start output buffer by default, to avoid notice about missing zlib extension in PHP 7.3.</li>\n<li>Remove return type declarations from function definitions, for compatibility with PHP 5.6.</li>\n</ul>\n<h4>0.17.2 (2021-06-18)</h4>\n<ul>\n<li>Identifier derivation supports more alternative polygraphs like &#8216;č&#8217; <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> &#8216;cz&#8217;, &#8216;ř&#8217; <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> &#8216;rz&#8217;, &#8216;ä&#8217; <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> &#8216;ae&#8217;.</li>\n<li>Convert &#8216;ö&#8217; to &#8216;oe&#8217; and &#8216;ü&#8217; to &#8216;ue&#8217; if language is German.</li>\n</ul>\n<h4>0.17.1 (2021-06-17)</h4>\n<ul>\n<li>Fix bug in last modified and published labels display.</li>\n<li>Update settings values to fix bug in menu position setting.</li>\n<li>Adjust tooltip position.</li>\n</ul>\n<h4>0.17.0 (2021-06-15)</h4>\n<ul>\n<li>Add missing CSS rule <code>user-select: all;</code> to the div displaying the backup in JSON format.</li>\n<li>Use non-Latin—Greek and Cyrillic for instance—scripts for the configurable delimiters’ default values.</li>\n<li>Use clear values for menu position configuration options instead of color names referring to the template.</li>\n</ul>\n<h4>0.16.2 (2021-06-14)</h4>\n<ul>\n<li>Simplify default note anchor prependix as &#8216;N&#8217; instead of &#8216;note &#8217;.</li>\n<li>Remove simplified CSV backup as superfluous while we have JSON format.</li>\n</ul>\n<h4>0.16.1 (2021-06-11)</h4>\n<ul>\n<li>Supply <code>shortcode_unautop()</code> functionality for <code>[/section]</code> positioner as the Shortcode API is not used.</li>\n<li>Discard brackets and parentheses as default anchor pre- and appendices to account for inadequate Unicode Line Breaking Algorithm.</li>\n<li>Debug theme link color application to anchors.</li>\n<li>Add fragment identifiers with scroll offset also to all main field labels in the settings page.</li>\n<li>Correct settings page layout while completion is starting.</li>\n</ul>\n<h4>0.16.0 (2021-06-10)</h4>\n<ul>\n<li>Add automatic link to full note after manual tooltip text.</li>\n<li>Restore support for list links in tooltip text, now using <code>[listlink]</code> and <code>[/listlink]</code> delimiters instead of PHP <code>sprintf()</code> placeholders.</li>\n</ul>\n<h4>0.15.0 (2021-06-10)</h4>\n<ul>\n<li>Add scope property to collapsible property of complement lists for inclusion in settings.</li>\n<li>Support heading level 1, discouraged beyond post title, if present in the article body.</li>\n<li>Fix display bug in table of contents list items not line wrapping.</li>\n<li>Add condition to complement list in footer output buffer algorithm to fix bug.</li>\n</ul>\n<h4>0.14.1 (2021-06-09)</h4>\n<ul>\n<li>Fix syntax and line breaks in HTML output.</li>\n<li>Move administration pages code into separate file.</li>\n</ul>\n<h4>0.14.0 (2021-06-09)</h4>\n<ul>\n<li>Backlink tooltips suggesting the use of the backbutton to scroll up from a complement list number.</li>\n</ul>\n<h4>0.13.1 (2021-06-09)</h4>\n<ul>\n<li>Get list positioning in the footer to work also for AMP requests.</li>\n</ul>\n<h4>0.13.0 (2021-06-08)</h4>\n<ul>\n<li>Convert expand/collapse functionality to pure HTML+CSS without JavaScript.</li>\n<li>Add expand/collapse feature to table of contents.</li>\n<li>Switch to AMP compatible footer output.</li>\n</ul>\n<h4>0.12.3 (2021-06-06)</h4>\n<ul>\n<li>Improve algorithm of footer positioning for complement lists.</li>\n<li>Define better default styles (shall be configurable) for lists in the footer.</li>\n<li>Prefix the global variables of the settings and the reusable complements.</li>\n</ul>\n<h4>0.12.2 (2021-06-05)</h4>\n<ul>\n<li>Correct output of complement lists in the footer top if position is set to footer.</li>\n</ul>\n<h4>0.12.1 (2021-06-05)</h4>\n<ul>\n<li>Use a more reliable method to retrieve the post slug.</li>\n</ul>\n<h4>0.12.0 (2021-06-04)</h4>\n<ul>\n<li>Line-wrap long URLs by adapting code contributed to another plugin.</li>\n</ul>\n<h4>0.11.0 (2021-06-03)</h4>\n<ul>\n<li>Output of complement lists in the footer if the <code>[complement_list_in_footer]</code> code is in a page.</li>\n</ul>\n<h4>0.10.1 (2021-06-03)</h4>\n<ul>\n<li>Remove <code>sprintf()</code> function from tooltip text processing as it may cause an inadvertent argument count error.</li>\n</ul>\n<h4>0.10.0 (2021-06-03)</h4>\n<ul>\n<li>Complement list headings in singular and dual forms as appropriate.</li>\n</ul>\n<h4>0.9.0 (2021-06-03)</h4>\n<ul>\n<li>Initial release (submitted 2021-06-02).</li>\n<li>Table of contents in sync with heading fragment ids.</li>\n<li>CSS-generated heading numbers.</li>\n</ul>\n<p>‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾<br />\nNOTE: The versions lower than 0.9.0 are not used to inform the @since tags.</p>\n<h4>0.8.0 (submitted 2021-05-29)</h4>\n<ul>\n<li>Reversal to initial short slug.</li>\n<li>CSS and class name fixes.</li>\n</ul>\n<h4>0.7.0 (submitted 2021-05-27)</h4>\n<ul>\n<li>Store backups in the uploads directory, not in the plugins directory.</li>\n<li>Add support for references nested in notes (but not conversely).</li>\n<li>Add twisties next to collapsed complement list headings.</li>\n</ul>\n<h4>0.6.0 (submitted 2021-05-25)</h4>\n<ul>\n<li>Properly generate content and plugin folder names for display.</li>\n<li>Prefix function names throughout.</li>\n</ul>\n<h4>0.5.0 (submitted 2021-05-23)</h4>\n<ul>\n<li>Initial submission.</li>\n</ul>\n<h4>0.0.0 (2021-04-26)</h4>\n<ul>\n<li>Start of development.</li>\n</ul>\n"
    },
    "short_description": "Among the Swiss Army knives completing WordPress, this one helps reduce GHG. AMP compatible. Table of contents, fragment IDs for paragraphs, notes and &hellip;",
    "description": "<p>An AMP compatible toolbox to help complete WordPress. Core features include:</p>\n<ul>\n<li>Security</li>\n<li>Thank You and other messages</li>\n<li>Date information: published, updated, first published, meta tags</li>\n<li>Paragraph links and list item links</li>\n<li>Heading links</li>\n<li>Table of contents</li>\n<li>Notes and sources in two lists</li>\n<li>Reference lists, bibliographies</li>\n<li>Templates for messages, notes, sources, references</li>\n<li>Webfont loading</li>\n<li>HTML partial including</li>\n</ul>\n<p><em>Notice about <strong>Language support:</strong> While American English is supported natively, British English support is at 100% (generated). French and Spanish with all sublocales supported by WordPress benefit from internal translation, currently at 18% and 6% respectively. About one in four string instances are in sync with WordPress Core.</em></p>\n<p>The A.N.R.GHG Publishing Toolkit can load and filter HTML partials from the file system, and it addresses the challenge to do by HTML and CSS things that used to be done by JavaScript, which was one reason the internet loaded slowly on mobiles and consumed more resources than with <a href=\"https://wordpress.org/plugins/amp/\" rel=\"ugc\">AMP</a> technology. So far, the A.N.R.GHG Publishing Toolkit is not yet up to its full design goal, but it already can:</p>\n<h4>Security</h4>\n<ul>\n<li>Protect WordPress websites against password leak effectiveness, by hampering the login process depending on the value of a constant defined in a mini-plugin (editable on the hosting platform);</li>\n<li>Make that constant configurable so that in multisite networks, individual sites may be toggled independently;</li>\n<li>Extend authentication cookie lifespans to a configurable period of time, for example until the day after the next scheduled login rush;</li>\n<li>Display the login activation status with an icon in the Admin bar;</li>\n<li>Blank the login dialog out if it is convenient to access the WordPress Admin area through the hosting platform exclusively.</li>\n<li>CAUTION: Unless the hosting provider has set up VPS level security, shared hosting is prone to being hacked by web shell even if only a single one of the websites sharing the same server’s home directory is compromised. Therefore, the A.N.R.GHG Publishing Toolkit’s security feature is efficient only on websites hosted on a dedicated server, a Virtual Private Server (VPS), or shared hosting with VPS level security set up by the hosting provider.</li>\n</ul>\n<h4>HTML partials</h4>\n<ul>\n<li>Include locally stored HTML partials directly from the file system;</li>\n<li>Replace optional placeholders with CSS classes and a configurable value;</li>\n<li>Enable updating the partials in bulk by FTP, rather than individual Custom HTML blocks or reusable blocks;</li>\n<li>Solve the issue of size, since posts containing too much code cannot be saved.</li>\n</ul>\n<h4>Thank You message</h4>\n<ul>\n<li>Display a configurable message after posts and/or pages;</li>\n<li>Help with activating and configuring the message on a per-page basis in the Post Meta box;</li>\n<li>Make available a set of rich text messages configured in the Template editor;</li>\n<li>Provide a block to configure an unlimited number of messages right in the post or page.</li>\n</ul>\n<h4>Date information</h4>\n<ul>\n<li>Display the last modified date at post/page start or end;</li>\n<li>Display the published date at the start or end of pages where WordPress does not display it natively;</li>\n<li>Optionally add a freely configurable field about where the post was first published;</li>\n<li>Add date meta tags (may be useful if not already added by an SEO plugin).</li>\n</ul>\n<h4>Paragraph links</h4>\n<ul>\n<li>Add a fragment identifier in a configurable link prepended to every paragraph and list item;</li>\n<li>Use position independent identifiers derived from the content;</li>\n<li>Use the custom ‘HTML anchor’ for all paragraphs that it has been configured for, further improving identifier stability;</li>\n<li>Keep the identifiers fully localized also when using a non-Latin script, for legible display in the URL bar.</li>\n</ul>\n<h4>Heading links</h4>\n<ul>\n<li>Add localized and optionally stable fragment identifiers and hyperlinks to headings.</li>\n</ul>\n<h4>Table of contents</h4>\n<ul>\n<li>Number the headings by CSS in appended or prepended position with a backlink to the table of contents;</li>\n<li>Replace the appended number with a generic arrow if numbers are not desired next to headings;</li>\n<li>List the headings in a table of contents, that the heading numbers link back to;</li>\n<li>Optionally collapse and expand the table of contents from the label, also when JavaScript is off;</li>\n<li>Insert a table of contents automatically in all posts with a configurable minimum number of headings;</li>\n<li>Deactivate the table of contents for a particular post or page in the added Meta box;</li>\n<li>Add a table of contents if the Table of contents block is present;</li>\n<li>Use a configurable string as an alternative positioner in the Classic Editor to override the configured default position;</li>\n<li>Configure its label for all posts in the settings, and for a particular post in the Post Meta box or in the block, or by adding an argument in the code;</li>\n</ul>\n<h4>Notes and sources</h4>\n<ul>\n<li>Parse inline notes and sources and display them either as descriptive endnotes or as bibliographic endnotes depending on their delimiters;</li>\n<li>Process sources nested in notes;</li>\n<li>Show notes and sources in responsive, adaptative and configurable rich tooltips when hovering their inline anchor;</li>\n<li>Support six numbering systems including Eastern Arabic digits to help distinguish notes from sources;</li>\n<li>Register notes and sources on the fly for reuse across a post or page;</li>\n<li>Store notes and sources as templates for reuse across the website;</li>\n<li>Display additional text around reused notes and sources;</li>\n<li>Handle multiple notes and/or sources reused in a single instance;</li>\n<li>Parse the notes and sources delimiters as freely configured also using non-Latin script or punctuation only;</li>\n<li>Support switching complement delimiters midway, parsing older posts for the previous ones while the current ones are processed in posts from a configurable ID on;</li>\n<li>Save the current delimiters with each post, so that delimiters may be reconfigured at any time and are valid in new posts;</li>\n<li>Parse post-specific sets of delimiters configured in the Post Meta box;</li>\n<li>Display complements in a number of columns (up to three) configurable for notes and sources separately, and responsively with respect to mobiles;</li>\n<li>List complements section-wise at each instance of the block in the Block Editor, or alternatively, of a configurable positioner code in the Classic Editor;</li>\n<li>Defer complement lists to the footer of a particular post, or do so for all posts unless specified otherwise;</li>\n<li>Post-process the web page to move complement lists from the built-in WordPress default position below the footer to within the footer;</li>\n<li>Specify the writing direction in complement lists and anchor tooltips for notes and for sources separately on a per-post basis in the added Post Meta box, or per instance in the block (Block Editor) or the positioner code (Classic Editor);</li>\n<li>Display a complement in a new tab or window using its URL even when lists are collapsed by default;</li>\n<li>Keep complement lists collapsed except for the target item after clicking an anchor, so as to not distract from the other features and information;</li>\n<li>Optionally expand the full list on clicking any anchor as it is useful for ibid notation;</li>\n<li>Combine identical complements to a single item, and enumerate the related anchors in a tooltip shown on hovering its number in the list;</li>\n<li>Display a warning if an opening delimiter is unbalanced, quoting the context for easy location.</li>\n</ul>\n<h4>Reference lists</h4>\n<ul>\n<li>Display lists of references in the post or page;</li>\n<li>Optionally make them collapsible, and display them collapsed or expanded at page load;</li>\n<li>Help with configuring reference lists in the ‘Reference list’ block with settings for label, display and writing direction.</li>\n</ul>\n<h4>Web fonts</h4>\n<ul>\n<li>Load web fonts with preconnect after pasting their URL into a text area in the settings;</li>\n<li>The Google Web Fonts repository is linked from the Settings page;</li>\n<li>One example URL is provided out of the box, but the switch is off by default.</li>\n</ul>\n<h4>Category pages and taxonomies</h4>\n<ul>\n<li>Activate rich-text term descriptions.</li>\n</ul>\n<h4>Data</h4>\n<ul>\n<li>Help with editing and storing templates that can be used as messages, as notes and as sources, and in reference lists;</li>\n<li>Export and import templates, settings, and freely defined options;</li>\n<li>Automatically back up templates and settings both at accessing and saving these pages.</li>\n</ul>\n<h4>Anchors and slugs</h4>\n<ul>\n<li>Help with configuring the rules used to generate fragment identifiers, and optionally slugs, allowing for uppercase, custom conversions, configurable maximum length.</li>\n</ul>\n<h4>Excerpts</h4>\n<ul>\n<li>Mitigate the effect of not using shortcodes, but versatile and internationalized delimiters instead.</li>\n</ul>\n<h4>Interoperability</h4>\n<ul>\n<li>Integrate with Elementor;</li>\n<li>Integrate with Advanced Custom Fields.</li>\n</ul>\n<h4>Character conversions</h4>\n<ul>\n<li>Optionally deactivate WordPress default behavior based on WPTexturize, so that ASCII quotation marks stay as-is also outside code areas.</li>\n</ul>\n<h4>Scrolling</h4>\n<ul>\n<li>Use a configurable scroll offset and optional CSS smooth scrolling.</li>\n</ul>\n<h4>CSS</h4>\n<ul>\n<li>Add the post or page slug as a class to the <code>body</code> element to ease customizing the aspect of specific pages.</li>\n</ul>\n<h4>HTML</h4>\n<ul>\n<li>Clean up errand meta tags and remove stray meta elements on public pages.</li>\n</ul>\n<h4>User interface</h4>\n<ul>\n<li>Provide 4 Gutenberg blocks to help with configuring messages, reference lists, note and source lists, and the table of contents;</li>\n<li>Add a configurable Post Meta box for a more fine-grained configuration of various features;</li>\n<li>Display settings in a single, fully searchable page with three levels of verbosity;</li>\n<li>Add optional Admin submenu or menu items;</li>\n<li>Provide an internal header menu.</li>\n</ul>\n<h4>Planned features</h4>\n<ul>\n<li>A format converter for Markdown ➔ WordPress;</li>\n<li>A converter for .docx files;</li>\n<li>An accessible emoji feature.</li>\n</ul>\n<h4>Concept</h4>\n<p>The A.N.R.GHG Publishing Toolkit aims to be one more Swiss Army knife to help complete any WordPress installation while reducing greenhouse gas emissions in multiple ways:</p>\n<ul>\n<li>Thanks to <a href=\"https://wordpress.org/plugins/amp/\" rel=\"ugc\">AMP</a> compatibility for a faster, less resource consuming web;</li>\n<li>With streamlined processes at its end in a slim code base without external style sheets;</li>\n<li>Through its commitment to web hosting with renewable energy ever since the first months;</li>\n<li>By developing in a local WordPress stack on a laptop powered with 100% renewable energy from the local grid operator;</li>\n<li>Being developed by a vegetalian, because going vegan is the <a href=\"https://www.theguardian.com/environment/2018/may/31/avoiding-meat-and-dairy-is-single-biggest-way-to-reduce-your-impact-on-earth\" rel=\"nofollow ugc\">single biggest way to reduce our impact on planet Earth</a>, per <a href=\"https://science.sciencemag.org/content/360/6392/987\" rel=\"nofollow ugc\">Oxford University research</a> and helps terminate animal torture.</li>\n</ul>\n<p>Beyond being fully AMP compatible, the A.N.R.GHG Publishing Toolkit’s features for the public pages stay functional where JavaScript is turned off, with one limitation: Expanding the table of contents from a heading backlink requires one click more.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/anrghg.1.16.5.zip",
    "upgrade_notice": {
        "1.6.0": "<p>▶ The Thank You message template select configuration is required to change syntax. The only possible separators are space and newline. The previous separator, comma, is allowed in template names. We apologize for the disruption and the inconvenience.</p>\n\n<p>▶ Two added blocks need to change category: The “Thank You message” and “Reference list” blocks were previously in the Design section. As they are about writing and formatting text and lists, they should be moved to the Text section. Making the category configurable for all added blocks is projected. Thank you for your understanding.</p>",
        "1.5.0": "<p>▶ Delimiter presets for easy input are changing. If easy default delimiters based on square brackets are in use, and this plugin’s Settings page was not saved since v1.4.7, please save it BEFORE UPGRADING, in order to not be disrupted. Thank you.</p>",
        "1.4.0": "<p>▶ The security feature’s login screen high and standard profiles should not be used unless the dialog is not useful any longer. Also it is recommended to define the constant in a mini-plugin using the included template, and to delete its definition in <code>wp-config.php</code>.</p>",
        "1.0.0": "<p>▶ Plugin re-listing: As of 2022-06-21, this plugin has been re-listed in the Plugin Directory.</p>",
        "0.67.0": "<p>▶ Plugin closure: As of 2022-03-21, this plugin has been temporarily closed pending a full review. In this new setup, no urgent bug fixes nor upgrade notices are required any longer. We beg the Plugin Directory’s pardon for the unfinished state, as initial release was fast-tracked in response to user requests for AMP compatible endnotes. We are striving to get the A.N.R.GHG Publishing Helper completed as soon as possible. Thank you for your understanding.</p>",
        "0.59.0": "<p>▶ The setting for inclusion of generated list labels in the table of contents has been moved from ‘Notes and sources’ to ‘Table of contents’, and it now includes ‘Reference lists’. As a consequence, the key name needed to be changed and its meaning inverted. The feature has been redesigned and does not rely on priority levels any longer; these are now freely configurable and need to be monitored if those labels should actually be included in the table of contents. Hoping that the new design is more convenient, we apologize for the change.</p>",
        "0.58.0": "<p>▶ The CSS classes must use hyphens, not underscores. We apologize for having used underscores and hurried to replace all underscores with hyphens in CSS class names except those derived from setting keys on the settings page.</p>",
        "0.56.0": "<p>▶ More setting keys required renaming to enhance intuitivity and consistency, after the renamings required by the 0.55.0 minor release. We apologize for the disruptions caused by these improvements.</p>",
        "0.55.0": "<p>▶ In expectation of the oncoming Reference list block that may be used to configure collapsible Reference lists as well as short bibilographies and ‘Further reading’ boxes, the word ‘References’ is now being avoided when referring to ‘Notes and sources’. For consistency, intuitivity and ease of maintenance also with respect to users of configuration filters, all related setting keys need to be changed, and the code name of the related block should also be updated since it appears in the post source text and may be used in an automatically added class name, and block-internal attribute names because of their output in markup for storage purposes. Existing blocks keep working but are not editable. Legacy notes-and-references blocks may be converted to HTML by clicking ‘Keep as HTML’ in order to copy the values to a new instance of the block. We apologize for the disruptions, underscoring that the plugin is still declared as in development.</p>",
        "0.51.0": "<p>▶ The format of the complement block configuration data output has been upgraded due to the addition of settings for collapsible property and collapsed state of lists. Support for the initial format is maintained, and the data storage remains unchanged. When reopening a post in the Block Editor: Please click ‘Attempt Block Recovery’, and everything will be as configured. We apologize for the inconvenience.</p>",
        "0.50.0": "<p>▶ Two setting keys needed to be renamed because their names were confusing, while they may be read by users of string translation panes or configuration filters: <code>anrghg_list_aria_label_notes</code> to <code>anrghg_list_label_aria_notes</code>, and <code>anrghg_list_aria_label_references</code> to <code>anrghg_list_label_aria_references</code>. For 0.50.1, as this notice is added—apologies for delay—, two other keys need to be renamed because their names were misleading: <code>anrghg_tooltip_read_more_link_text_note</code> to <code>anrghg_complement_tooltip_list_link_text_note</code>, and <code>anrghg_tooltip_read_more_link_text_reference</code> to <code>anrghg_complement_tooltip_list_link_text_reference</code>. In the same move, several keys used in the ‘Notes and sources’ feature, including the first two, are renamed for consistency and completeness to improve intuitivity and user experience with configuration filters. For 0.50.2, <code>_complement</code> in the two keys above is replaced with the moved <code>_note</code> or <code>_reference</code>. We apologize for the inconvenience and hope that the improvements outweigh the trouble of reconfiguring existing installations.</p>",
        "0.49.0": "<p>▶ The setting keys <code>anrghg_meta_box_complements_dir</code> and <code>anrghg_meta_box_list_footer_deferral</code> needed to be renamed to <code>anrghg_meta_box_complements_writing_direction</code> and <code>anrghg_meta_box_complement_list_footer_deferral</code> respectively, for clarity, to improve maintainability. Since their default value is <code>0</code>, the eventually checked checkboxes will be unchecked again, and the settings disappear from the meta box, and conversely for <code>anrghg_meta_box_list_labels</code> renamed to <code>anrghg_meta_box_complement_list_labels</code>. We apologize for the inconvenience.</p>",
        "0.44.0": "<p>▶ Apologies for current delays in development, due to urgent investigation on food transition.</p>",
        "0.43.0": "<p>▶ The easy preset dedicated tooltip text end delimiter <code>\\\\</code> is replaced with <code>||</code>. We apologize for this change, that is about preferring consistency and intuitivity over ease of input on a US-QWERTY. If you are using <code>\\\\</code>, please input it in the free configuration field and switch to <code>freely configured</code>.</p>",
        "0.40.0": "<p>▶ The <code>[/excerpt]</code> delimiter ending a dedicated tooltip text was a misnomer and needs to be replaced with <code>[/view]</code>. If <code>[/excerpt]</code> is already in use, the tooltip end delimiter may be configured accordingly when choosing the <code>free</code> option rather than a preset. We apologize for the inconvenience of not keeping it as the default (&#039;safe&#039;) configuration.</p>",
        "0.36.0": "<p>▶ The last modified and published date labels have now a placeholder for the date. That is required for internationalization, but we overlooked it up to now. Our apologies for missing out on this requirement, and for the inconvenience of editing the labels already saved. Please add a per cent sign followed by the letter s where the date shall display.</p>",
        "0.34.0": "<p>▶ The date meta tags have 4 new option key names for greater flexibility. Please review the setting if you are using it. Our apologies for the disruption.</p>",
        "0.33.0": "<p>▶ The name and format of the configurable table of contents positioner have changed. Please review the setting if you are using it.</p>",
        "0.30.0": "<p>▶ The hook names <code>anrghg_ref_start</code> and <code>anrghg_ref_end</code> are changed to unabridged forms using <code>_reference_</code>. Also, the columns list layout is now configurable individually with keys changing by using <code>_note_</code> or <code>_reference_</code> respectively instead of <code>_complement_</code>. We apologize for the disruption, and for the initial abbreviation. — As links to the options pages are added here to the plugin&#039;s entry in the Plugins list, the default menu level is changing from Admin main menu to submenus, and the submenu labels are now &#039;Reusables&#039; under &#039;Tools&#039;, and &#039;Complements&#039; under &#039;Settings&#039;.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/anrghg/assets/screenshot-1.png?rev=2746634",
            "caption": "Thank You message configuration settings and select box configuration."
        },
        {
            "src": "https://ps.w.org/anrghg/assets/screenshot-2.png?rev=2746634",
            "caption": "Message and tooltip configured on the settings page; added dates."
        },
        {
            "src": "https://ps.w.org/anrghg/assets/screenshot-3.png?rev=2746634",
            "caption": "Single note display on clicking its anchor, with optional URL display."
        },
        {
            "src": "https://ps.w.org/anrghg/assets/screenshot-4.png?rev=2746634",
            "caption": "A rich scriptless source tooltip on desktop."
        },
        {
            "src": "https://ps.w.org/anrghg/assets/screenshot-5.png?rev=2746634",
            "caption": "Anchor typography with optional commas, parentheses."
        },
        {
            "src": "https://ps.w.org/anrghg/assets/screenshot-6.png?rev=2746634",
            "caption": "Notes and sources backlink tooltip configuration settings."
        },
        {
            "src": "https://ps.w.org/anrghg/assets/screenshot-7.png?rev=2746634",
            "caption": "Rich and plain backlink tooltips of combined sources."
        },
        {
            "src": "https://ps.w.org/anrghg/assets/screenshot-8.png?rev=2746634",
            "caption": "A responsive anchor tooltip."
        },
        {
            "src": "https://ps.w.org/anrghg/assets/screenshot-9.png?rev=2746634",
            "caption": "Optional warning about a delimiter syntax error."
        },
        {
            "src": "https://ps.w.org/anrghg/assets/screenshot-10.png?rev=2746634",
            "caption": "Shadow, padding and margin configuration settings."
        },
        {
            "src": "https://ps.w.org/anrghg/assets/screenshot-11.png?rev=2746634",
            "caption": "References list optional bullet configuration select box."
        },
        {
            "src": "https://ps.w.org/anrghg/assets/screenshot-12.png?rev=2746634",
            "caption": "Thank You message priority level setting, browser’s color picker, last modified date display configuration."
        }
    ],
    "tags": {
        "amp": "amp",
        "metadata": "metadata",
        "reusable": "reusable",
        "security": "security",
        "table-of-contents": "table of contents"
    },
    "stable_tag": "1.16.5",
    "versions": {
        "1.10.0": "https://downloads.wordpress.org/plugin/anrghg.1.10.0.zip",
        "1.10.1": "https://downloads.wordpress.org/plugin/anrghg.1.10.1.zip",
        "1.10.2": "https://downloads.wordpress.org/plugin/anrghg.1.10.2.zip",
        "1.11.0": "https://downloads.wordpress.org/plugin/anrghg.1.11.0.zip",
        "1.12.0": "https://downloads.wordpress.org/plugin/anrghg.1.12.0.zip",
        "1.13.0": "https://downloads.wordpress.org/plugin/anrghg.1.13.0.zip",
        "1.14.0": "https://downloads.wordpress.org/plugin/anrghg.1.14.0.zip",
        "1.14.1": "https://downloads.wordpress.org/plugin/anrghg.1.14.1.zip",
        "1.14.2": "https://downloads.wordpress.org/plugin/anrghg.1.14.2.zip",
        "1.14.3": "https://downloads.wordpress.org/plugin/anrghg.1.14.3.zip",
        "1.14.4": "https://downloads.wordpress.org/plugin/anrghg.1.14.4.zip",
        "1.14.5": "https://downloads.wordpress.org/plugin/anrghg.1.14.5.zip",
        "1.14.6": "https://downloads.wordpress.org/plugin/anrghg.1.14.6.zip",
        "1.15.0": "https://downloads.wordpress.org/plugin/anrghg.1.15.0.zip",
        "1.16.0": "https://downloads.wordpress.org/plugin/anrghg.1.16.0.zip",
        "1.16.1": "https://downloads.wordpress.org/plugin/anrghg.1.16.1.zip",
        "1.16.2": "https://downloads.wordpress.org/plugin/anrghg.1.16.2.zip",
        "1.16.3": "https://downloads.wordpress.org/plugin/anrghg.1.16.3.zip",
        "1.16.4": "https://downloads.wordpress.org/plugin/anrghg.1.16.4.zip",
        "1.16.5": "https://downloads.wordpress.org/plugin/anrghg.1.16.5.zip",
        "1.6.14": "https://downloads.wordpress.org/plugin/anrghg.1.6.14.zip",
        "1.6.15": "https://downloads.wordpress.org/plugin/anrghg.1.6.15.zip",
        "1.6.16": "https://downloads.wordpress.org/plugin/anrghg.1.6.16.zip",
        "1.6.17": "https://downloads.wordpress.org/plugin/anrghg.1.6.17.zip",
        "1.6.18": "https://downloads.wordpress.org/plugin/anrghg.1.6.18.zip",
        "1.8.2": "https://downloads.wordpress.org/plugin/anrghg.1.8.2.zip",
        "1.8.3": "https://downloads.wordpress.org/plugin/anrghg.1.8.3.zip",
        "1.8.4": "https://downloads.wordpress.org/plugin/anrghg.1.8.4.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/anrghg.1.9.0.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/anrghg.1.9.1.zip",
        "1.9.2": "https://downloads.wordpress.org/plugin/anrghg.1.9.2.zip",
        "1.9.3": "https://downloads.wordpress.org/plugin/anrghg.1.9.3.zip",
        "1.9.4": "https://downloads.wordpress.org/plugin/anrghg.1.9.4.zip",
        "trunk": "https://downloads.wordpress.org/plugin/anrghg.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/anrghg/assets/banner-772x250.png?rev=2710810",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/anrghg/assets/icon-128x128.png?rev=2710810",
        "2x": "https://ps.w.org/anrghg/assets/icon-256x256.png?rev=2711253"
    },
    "blocks": {
        "anrghg/thank-you-message": {
            "name": "anrghg/thank-you-message",
            "title": "Thank You message"
        },
        "anrghg/table-of-contents": {
            "name": "anrghg/table-of-contents",
            "title": "Table of contents"
        },
        "anrghg/notes-and-sources": {
            "name": "anrghg/notes-and-sources",
            "title": "Notes and sources"
        },
        "anrghg/references": {
            "name": "anrghg/references",
            "title": "Reference list"
        },
        "anrghg/include": {
            "name": "anrghg/include",
            "title": "Include partial"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}