{
    "name": "appful Mobile App Plugin [OLD &#8211; NEW VERSION BELOW]",
    "slug": "appful",
    "version": "1.1.2",
    "author": "<a href=\"https://appful.io/\">appful GmbH</a>",
    "author_profile": "https://profiles.wordpress.org/oskarn97/",
    "contributors": {
        "appful": {
            "profile": "https://profiles.wordpress.org/appful/",
            "avatar": "https://secure.gravatar.com/avatar/c90cc709165c75a92f0f70a5a7c536ef?s=96&d=monsterid&r=g",
            "display_name": "appful"
        },
        "mobileappappful": {
            "profile": "https://profiles.wordpress.org/mobileappappful/",
            "avatar": "https://secure.gravatar.com/avatar/2db6e1ffc661dd685cad130d3bb5ba29?s=96&d=monsterid&r=g",
            "display_name": "mobileappappful"
        }
    },
    "requires": "5.2",
    "tested": "5.8.10",
    "requires_php": "5.6.20",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 84,
    "ratings": {
        "5": 4,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 5,
    "support_url": "https://wordpress.org/support/plugin/appful/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 80,
    "downloaded": 51283,
    "last_updated": "2023-06-16 9:44am GMT",
    "added": "2015-08-09",
    "homepage": "https://appful.io/",
    "sections": {
        "description": "<p><strong>This version of the appful plugin is old and will not be supported in the future. Please use our new plugin that can be found here: <a href=\"https://wordpress.org/plugins/appful-app\" rel=\"ugc\">https://wordpress.org/plugins/appful-app</a></strong></p>\n<p><strong><a href=\"https://appful.io/\" title=\"Create mobile iPhone &amp; iPad Apps\" rel=\"nofollow ugc\">appful</a>® is a SaaS company focused on enterprise software. Our mission is to help companies, publishers &amp; magazines to reach their customers, employees &amp; users with their content &#8211; through one of the most powerful content channel: mobile apps.</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/qix0SjXjb-M?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>Why is appful different?</h4>\n<p>Forget monotonous mobile App Builder with one or two cheap-looking templates and a range of unnecessary functions, because they will never have a chance against native mobile apps from professional app agencies. However, agencies are slow, offer a weak background system in most cases, and are extremely expensive.</p>\n<p><strong>So we thought, there needs to be another, better way</strong> &#8211; so here we are: appful represents the golden mean between mobile App Builders and agencies. We offer a selection of different <strong>Top-Notch mobile App Designs for a fair price</strong>. In the case that you would like to have a <strong>completely custom design</strong>, we are happy to do that for you. You are still not convinced yet? Try it yourself for free as long as you like. Only as soon as you like to publish your mobile app to the App Store, we charge affordable fees.</p>\n<p>For any questions, don’t hesitate to <strong><a href=\"https://appful.io/contact/\" title=\"Get in touch!\" rel=\"nofollow ugc\">get in touch</a>.</strong> We would love to help make your dreams a reality!</p>\n<h4>Core Features of our native mobile Apps</h4>\n<ul>\n<li>Read Later</li>\n<li>Comments</li>\n<li>Native Social Media Sharing</li>\n<li>Offline Reading</li>\n<li>YouTube Support</li>\n<li>Logo Placement</li>\n<li>Own Advertisement</li>\n</ul>\n<h4>Benefits of a mobile App</h4>\n<ul>\n<li><strong>More traffic</strong> &#8211; Users who love your mobile app, will use it regularly </li>\n<li><strong>Provide great user experience on mobile devices</strong> &#8211; A mobile app feels better than a HTML mobile site</li>\n<li><strong>Stronger connection to your community</strong> &#8211; User will NOT only click at one article and leave again</li>\n<li><strong>Earn more money</strong> &#8211; AdBlockers can&#8217;t block the ads inside of your mobile app (Especially on iOS) </li>\n<li><strong>Android app</strong> &#8211; We offer both an mobile Android app and an mobile iOS App for your blog</li>\n</ul>\n<h4>What our customers say about us</h4>\n<blockquote>\n<p>&#8220;My company was looking for a quick solution for launching a native mobile app for our WordPress site. We chose Appful because they offered the most beautiful app themes I found across the web. [&#8230;] The team has been extremely helpful and responsive in walking us through the process to get our app into the app store. [&#8230;] They truly go above and beyond to help you create a great app.&#8221;</p>\n</blockquote>\n<p>Jordan Lejuwaan &#8211; futurism.com</p>\n<blockquote>\n<p>&#8220;We searched for a possibility to create an own mobile app for a long time. With appful this desire was more than satisfied! Top Service, super easy and above all a great mobile app!&#8221;</p>\n</blockquote>\n<p>Niclas Schmidt &#8211; iOSPilot.de</p>\n<blockquote>\n<p>&#8220;The solution of appful.io is easy to use, has a modern and attractive design and offers all the features you might need. In addition, appful.io has the best value for money, not only for bloggers and YouTuber!&#8221;</p>\n</blockquote>\n<p>Renato Mitra &#8211; ApfelBlog.ch</p>\n<blockquote>\n<p><strong>What problem do we solve?</strong></p>\n<p>As soon as publisher decide on setting up an mobile app they face the choice between monotonous low-quality “mobile app builders” lacking the opportunity to create custom designs, because they will never have a chance against mobile apps from professional mobile app agencies. However, agencies and freelancer are slow, changes can be implemented only by the developer and are tremendously expensive. We are a solution to this problem.</p>\n<p><strong>What is your solution?</strong></p>\n<p>We combine all advantages of mobile app builders, freelancers and agencies and additionally clear up all disadvantages. Sounds great, but let us explain how we achieve this: We offer a sophisticated system allowing publishers to create their very own top-notch <strong>native mobile app</strong> for their WordPress blog or YouTube channel for ios and android. In addition to that we only charge a small monthly fee and take over the hosting and general technical care. Furthermore, if requested, we develop a completely distinct and exclusive own custom mobile app design hand in hand with our customers &#8211; the same applies to specific desired functions. appful represents the golden mean between mobile app builders and agencies.</p>\n</blockquote>\n<h4>All Features</h4>\n<ul>\n<li>PUSH &#8211; Unlimited Push Notification</li>\n<li>LIVE EDITING &#8211; Edit your mobile app live, when and where you like</li>\n<li>CACHING &#8211; Caching provides fantastic speed</li>\n<li>ADS &#8211; Place your own Advertisement inside your mobile app</li>\n<li>NATIVE COMMENTS &#8211; Top-notch mobile app comment system</li>\n<li>READ LATER &#8211; Save posts for later</li>\n<li>SOCIAL SHARING &#8211; Native Social Sharing Button</li>\n<li>TWITTER &#8211; Integrate Twitter profile page into your mobile app</li>\n<li>YOUTUBE &#8211; Automatic YouTube Video Import</li>\n<li>OFFLINE READING &#8211; Even offline, posts stay available in the mobile app</li>\n<li>IPAD &#8211; All our native mobile apps are iPad optimized</li>\n<li>APPLE WATCH &#8211; All our native mobile apps run on the Apple Watch</li>\n<li>GOOGLE ANALYTICS &#8211; Use Google Analytics to analyze your mobile app traffic</li>\n<li>SEARCH &#8211; Super fast search</li>\n</ul>\n<p><strong>High performance content caching</strong><br />\nOur sophisticated, redundant high-performance network acquires a real-time cache of your whole blog content in order to provide the best user-experience possible for your mobile app. Multiple servers balance the load and traffic generated by users through our system and make sure that your WordPress blog will not experience any traffic peaks because of your content app. Therefore, your WordPress blog app will seamlessly integrate into your existing eco-system and lift the heavy load from your blog installation so you can focus on what is really important: Making an impact with content publishing. Adding to that, your readers or customers can enjoy the full power and speed of your native content app.</p>\n<p><strong>Native comments in your mobile app</strong><br />\nAn elaborated native commenting system empowers you to integrate the best social interaction experience possible, right inside your mobile app on the user’s phone. Multiple solutions such as a native Disqus app integration or a native WordPress comment app integration make sure that users can interact and discuss with your whole community.</p>\n<blockquote>\n<p><strong>How the magic works</strong></p>\n<p><strong>1. Install and activate the appful plugin</strong></p>\n<p>The plugin enables us to import your blog content into your mobile app. Moreover, the mobile blog plugin of us makes it possible that changes to your content sync live with your mobile app.</p>\n<p><strong>2. Sign up at <a href=\"https://appful.io/\" title=\"Create mobile Blog Apps for iOS and Android\" rel=\"nofollow ugc\">appful.io</a> and create your mobile app</strong></p>\n<p>From your dashboard you can create your first mobile app for ios and android, choose a beautiful design and upload your logo to customise your mobile app. You&#8217;ll be able to add an icon and launch image later on in the process.</p>\n<p><strong>3. Preview &amp; Test your mobile app</strong></p>\n<p>As soon as you are finished with your mobile app, you can download our <code>appful</code>-App from the App Store or Play Store in order to test your mobile app on your own mobile devices (iPhone, iPad and Android phones and tablets).</p>\n<p><strong>4. Choose one of our plans and go live!</strong></p>\n<p>Finally, you click <code>Test &amp; Publish</code> at the top of our Dashboard. Follow the final mobile app setup, choose one of our plans and place the order. In a matter of days we&#8217;ll submit your mobile app to App Store and Google Play Store.</p>\n</blockquote>\n<p><strong>Custom mobile App Design</strong></p>\n<p>A huge advantage of our <strong>mobile app</strong> solution is the option of a Custom-Design. In case, you wish to go live with a fully unique mobile app design, contact us, we can make this possible. We even can realize custom function for your mobile app.</p>\n<p><strong>Enterprise mobile app</strong></p>\n<p>Since we have got great feedback of enterprise customers, we offer your company special enterpise plans in order to get your mobile app to the next level. Simply contact us!</p>\n<p><strong>Ads in the mobile app</strong></p>\n<p>With a mobile app you have the full control about the displayed ads in your native mobile app. A Mobile app in our &#8220;Starter&#8221; plan is completely ad-free. With our plus and Business plan you can start earning money with your mobile app.</p>\n<p><strong>Thanks for your aweseome feedback. We have got surprising much and helpful suggestions regarding our mobile app system, our appful Dashboard and our mobile app. Keep on sending us your thoughts!</strong></p>\n<p><strong>Mobile app for iOS and Android</strong></p>\n<p>In addition, we provide you with an own appful test-app. The mobile app for iOS and Android allows you to preview your just created mobile app on your own device. So use this opportunity to test your mobile app. You can adjust every detail and preview it right on your phone. This way, before you submit your mobile app into the store, you can make sure that everything works exactly like you want it to &#8211; no surpises. In addition to that, we provide exact statisticts on the use of your mobile app to create highest transperancy. Our aim is to make both our customers and their readers happy. Your mobile app will build brand cognizance. A mobile app for your business can greatly contribute to your brand vigilance.</p>\n<p><strong>Why we started</strong></p>\n<p>Mobile apps became one of the driving forces of modern civilization. Studies recently discovered that we spend more than 80% of our time on our mobile devices in mobile apps. As a result, bloggers are required to follow this trend and create a mobile app &#8211; otherwise they are not able to reach their audience. The most important feature of a mobile app is push notifications. Through them, bloggers can directly reach their audience. A mobile app has many advantages, however it is usually very expensive in development. Our aim was to create a real alternative and set a new standard in the process of creating a mobile app and we think that we succeeded. All of this thanks to a mobile app built in a couple of seconds utilizing our astonishing mobile app plugin for WordPress.</p>\n<p><strong>Who we are</strong></p>\n<p>Two years ago, one member ran a blog and was desperatly looking for somebody that would develop him an mobile app for his blog. For the same reasons metioned above, he insisted on trying an mobile app in the form of an ios and android app because he was sure that a mobile app makes a huge difference in comparison to browsers. At first he did not find anybody who was able to develop his mobile app as an android app until he found the developer of our current team. We developed the mobile app together and it had tremendous success. We were so proud of our work and discovered a whole new world and everything that was possible in it &#8211; the world of mobile apps. What started as a little idea soon became a passion. We planned to build a company that provides the tools for bloggers to do the same. appful has been in development for 2 years and we are now very close friends. The love to mobile apps for ios and android and our passion is what keeps the company running. The times where you have to go to an agency and pay thousands of dollars to get a middle-class looking mobile app for ios and android are over. We provide you with a very affordable, stunning app for android and ios that can easily keep up with competitiors &#8211; more over your chances are good to get a very successful mobile app. We only take little fees to keep your app updated and running. Our mobile app company is now based in Germany and has a great success. We are very proud of what we already accomplished and looking forward to seeing what is going to follow. Be part of our story an try us free and get your own mobile app for your blog!</p>\n<p><strong>Differences between mobile apps and mobile sites</strong></p>\n<p>In every area of our lives we recognize the trend to mobiles devices and smartphones. Mobile Devices (Android Apps and iOS Apps) are everywhere and they are talking over task by task. We use a mobile app for communication, a mobile app for entertainment, a mobile app for booking, a mobile app for eating, a mobile app photos, a mobile app for meeting new people and especially a mobile app for getting informations and news on both android and ios.<br />\nA mobile app accommodate many functions: they can provide general info, contact prices, reserve forms, search engines, utilizer accounts, heralds, news victuals, events, special deals and even more. Thanks to push notifications you can get even more proximate and directly interact from your mobile app to your client.<br />\nMake it facile for your readers or customers to contact you &#8211; your mobile app plugin will avail you build better customer cognations.<br />\nHaving a mobile app for is still quite recherche, this can give you a leap in advance against your competition.<br />\nmobile App vs. mobile Web App vs. mobile site</p>\n<p>In every area of our lives we recognize the trend to mobiles devices and smartphones. Mobile Devices (Android Apps and iOS Apps) are everywhere and they are talking over task by task. We use a mobile app for communication, a mobile app for entertainment, a mobile app for booking, a mobile app for eating, a mobile app photos, a mobile app for meeting new people and especially a mobile app for getting informations and news on both android and ios.</p>\n<p>Did you know that we spend more than 80% in native mobile apps when we use our android and ios devices? As a result, less than 20% of our smartphone use time is spend in browsers where people read your blog, and the trend is growing towards a mobile app.</p>\n<p>If you are a publisher with a large audience and do not have a mobile app yet, your readers have no possibility to be up-to-date with your news. Only through a native mobile app you can unfilteredly reach your target group through push notifications. In addition to that, a native mobile app creates a whole different feeling when using it. It can use the core advantages of native software and access powerful frameworks and offer tremendous features.</p>\n<p>Since you are on our page, chances are that you have already tried out different mobile app builder solutions. You may have also noticed that a vast majority of mobile app builders are complex to use, look unprofessional and unclean and are very limited in both function and design. Furthermore, they are very expensive and often require a developer account that also costs more than 100$/year. On top of that, they limit push notifications for your mobile app.</p>\n<p>We are bloggers ourselves and also discovered these issues when trying to create a mobile app. You can either use an overpriced mobile app builder or offer a professional agency that takes very long and is very expensive as well.</p>\n<p>So we thought there has to be a better way and we invented appful &#8211; the golden mean between mobile app builders and agencies for an android app and an ios app. We offer a strong background system, take care of the whole process of publishing, managing and updating your mobile app for ios and android and offer affordable prices. Furthermore we enable you to better monetize your mobile app for android and ios and earn more money. We do not limit push notifications. Once set up, you never have to worry about your mobile app again. Push notifications are sent completly automatically &#8211; no action required. In our strong analytics system you can watch your mobile app growing.</p>\n<p>The best thing is that we want you to be happy with your app so we decided not to charge any money until you are 100% satisfied and decide to release your mobile app for ios to the app store and your android app to the play store. You can try and experiment with every function and design your mobile app as long as you like for free and test your android app and ios app on your devices.</p>\n<p>Once you are content with your mobile app you can hand it over to us and we will take care of the remaining process. We will hand your iOS App over to Apple and your Android App to Google and offer strong servers that process the content of your mobile app. Your site does not have to struggle with an extra amount of traffic.</p>\n",
        "installation": "<p>Setting up a mobile App with appful is surprisingly simple &#8211; trust us!</p>\n<ol>\n<li>Sign up at <a href=\"https://appful.io/\" title=\"Create a mobile App for WordPress\" rel=\"nofollow ugc\">appful.io</a></li>\n<li>Create your first native mobile app for ios and android</li>\n<li>Download and install the appful mobile app plugin</li>\n<li>Move to the &#8220;appful&#8221; section in the WordPress menu</li>\n<li>There enter your appful user information from the account you previously created</li>\n<li>Navigate in the <a href=\"https://my.appful.io/\" title=\"appful mobile app Dashboard\" rel=\"nofollow ugc\">my.appful</a> Dashboard to INFO &gt; Connect and activate your blog</li>\n</ol>\n",
        "faq": "\n<dt id='where%20can%20i%20find%20more%20information%20about%20your%20native%20mobile%20apps%3F'>\nWhere can I find more information about your native mobile Apps?\n</h4>\n<p>\n<p>At <a href=\"https://appful.io/\" title=\"Create mobile iPhone &amp; Android Apps\" rel=\"nofollow ugc\">appful.io</a> you will find more information about our plans and our features.</p>\n</p>\n<dt id='the%20mobile%20app%20are%20runs%20on%20ios%20and%20android%20%2F%20iphone%2C%20ipad%20and%20android%3F'>\nThe mobile App are runs on iOS and Android / iPhone, iPad and Android?\n</h4>\n<p>\n<p>Yes, at the moment our mobile App are running on all iOS devices (including Apple Watch) and on Android Devices as well.</p>\n</p>\n<dt id='how%20can%20i%20create%20an%20own%20mobile%20app%20for%20my%20wordpress%20blog%3F'>\nHow can I create an own mobile App for my WordPress Blog?\n</h4>\n<p>\n<ol>\n<li>Sign up at <a href=\"https://appful.io/\" title=\"Create mobile Blog Apps for iOS and Android\" rel=\"nofollow ugc\">appful.io</a></li>\n<li>Create your first mobile app for ios and android</li>\n<li>Download and install the appful mobile app plugin</li>\n<li>Move to the &#8220;appful&#8221; section in the WordPress menu</li>\n<li>There enter your appful user information from the account you previously created</li>\n<li>Navigate in the <a href=\"https://my.appful.io/\" title=\"appful Dashboard\" rel=\"nofollow ugc\">my.appful</a> Dashboard to INFO &gt; Connect and activate your blog</li>\n</ol>\n</p>\n<dt id='is%20your%20service%20really%20free%3F'>\nIs your service really free?\n</h4>\n<p>\n<p>You can create and test your mobile app for ios and android as long as you want completly free. Only if you are 100% content and you intend to share your mobile app with your audience you need to upgrade to a low-priced paid solution that offers you the best perfomance.</p>\n</p>\n<dt id='are%20your%20mobile%20apps%20native%3F'>\nAre your mobile apps native?\n</h4>\n<p>\n<p>Yes, we put a great focus on quality, performance and user experience. Our specialists developed many distinct stunning templates you can choose from. That way we can make sure that you only get the best out of your mobile app that is possible.</p>\n</p>\n<dt id='how%20is%20your%20mobile%20app%20service%20different%20from%20other%20app%20builders%3F'>\nHow is your mobile app service different from other app builders?\n</h4>\n<p>\n<p>Unlike other mobile app builders, we made our service from the perspective of a blogger. Every template and every feature was specially designed to fit your all your needs. Our technology is in no way comparable to low-quality mobile app builders.</p>\n</p>\n<dt id='how%20long%20does%20it%20take%20to%20publish%20a%20mobile%20app%20with%20appful%3F'>\nHow long does it take to publish a mobile app with appful?\n</h4>\n<p>\n<p>From the day you submit your order it takes about 7 days for Apple to review your mobile app, for the Android App in the Google Play Store that is about 1-2 days until your mobile app is public.</p>\n<p>*Do I need an own developer account?**<br />\nNo, we take care of the whole publishing process of your mobile app for both ios android. Unlike on other mobile app services, you do not need an developer account which is 100$/year. However, if you are a company and intend to use your own account, that is possible of course. Just contact us in advance.</p>\n</p>\n<dt id='where%20is%20your%20company%20based%3F'>\nWhere is your company based?\n</h4>\n<p>\n<p>Our company is based in germany.</p>\n</p>\n<dt id='what%20languages%20do%20you%20support%3F'>\nWhat languages do you support?\n</h4>\n<p>\n<p>An appful mobile app currently supports english, arabic and german for system texts. However, if you need any other language to be integrated, that is no problem &#8211; just go ahead and ask us.</p>\n</p>\n<dt id='i%20have%20some%20more%20questions%20about%20creating%20a%20native%20mobile%20app%20with%20your%20service...'>\nI have some more questions about creating a native mobile App with your service&#8230;\n</h4>\n<p>\n<p>..Then please <strong><a href=\"https://appful.io/contact/\" title=\"Get in touch!\" rel=\"nofollow ugc\">get in touch</a></strong>! Thanks 🙂</p>\n</p>\n\n",
        "changelog": "<h4>appful Mobile App Plugin 1.0.88</h4>\n<ul>\n<li>prepare for cdn</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.78</h4>\n<ul>\n<li>improved app push</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.70</h4>\n<ul>\n<li>fixed an issue with push notifications</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.60</h4>\n<ul>\n<li>adding support for crazy lazy plugin</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.58</h4>\n<ul>\n<li>improved commenting</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.53</h4>\n<ul>\n<li>introducing overlay banner</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.52</h4>\n<ul>\n<li>general improvements</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.51</h4>\n<ul>\n<li>added android deep linking</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.46</h4>\n<ul>\n<li>adding multi language support</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.45</h4>\n<ul>\n<li>better taxonomy sync</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.44</h4>\n<ul>\n<li>added universal links for android</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.43</h4>\n<ul>\n<li>added facebook deeplinking</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.42</h4>\n<ul>\n<li>added taxonomy images</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.41</h4>\n<ul>\n<li>fixing redirect bug</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.40</h4>\n<ul>\n<li>performance improvements</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.39</h4>\n<ul>\n<li>performance improvements</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.38</h4>\n<ul>\n<li>performance improvements</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.37</h4>\n<ul>\n<li>performance improvements</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.36</h4>\n<ul>\n<li>performance improvements</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.36</h4>\n<ul>\n<li>automatically import wordpress menu into your mobile app</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.35</h4>\n<ul>\n<li>performance improvements</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.34</h4>\n<ul>\n<li>added deeplinking</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.32</h4>\n<ul>\n<li>added play store button in widget</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.31</h4>\n<ul>\n<li>support for rocket lazyload</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.30</h4>\n<ul>\n<li>support for custom post types</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.29</h4>\n<ul>\n<li>compatibility update for php 5.2</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.11</h4>\n<ul>\n<li>app security improvements</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.10</h4>\n<ul>\n<li>fixed read more</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.9</h4>\n<ul>\n<li>custom post types</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.6</h4>\n<ul>\n<li>added author thumbnail</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.4</h4>\n<ul>\n<li>Multiple Server implementation</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.3</h4>\n<ul>\n<li>Enable/Disable Push-Notifications for each Post</li>\n<li>Fixed Slider-Checkbox</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.2</h4>\n<ul>\n<li>Bugfixes at mobile App</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0.1</h4>\n<ul>\n<li>Added App Smart-Banner</li>\n</ul>\n<h4>appful Mobile App Plugin 1.0</h4>\n<ul>\n<li>Release</li>\n</ul>\n"
    },
    "short_description": "Create a stunning native mobile App in 5 minutes. Mobile App for iPhone &amp; Android. Try us for free!",
    "description": "<p><strong>This version of the appful plugin is old and will not be supported in the future. Please use our new plugin that can be found here: <a href=\"https://wordpress.org/plugins/appful-app\" rel=\"ugc\">https://wordpress.org/plugins/appful-app</a></strong></p>\n<p><strong><a href=\"https://appful.io/\" title=\"Create mobile iPhone &amp; iPad Apps\" rel=\"nofollow ugc\">appful</a>® is a SaaS company focused on enterprise software. Our mission is to help companies, publishers &amp; magazines to reach their customers, employees &amp; users with their content &#8211; through one of the most powerful content channel: mobile apps.</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/qix0SjXjb-M?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>Why is appful different?</h4>\n<p>Forget monotonous mobile App Builder with one or two cheap-looking templates and a range of unnecessary functions, because they will never have a chance against native mobile apps from professional app agencies. However, agencies are slow, offer a weak background system in most cases, and are extremely expensive.</p>\n<p><strong>So we thought, there needs to be another, better way</strong> &#8211; so here we are: appful represents the golden mean between mobile App Builders and agencies. We offer a selection of different <strong>Top-Notch mobile App Designs for a fair price</strong>. In the case that you would like to have a <strong>completely custom design</strong>, we are happy to do that for you. You are still not convinced yet? Try it yourself for free as long as you like. Only as soon as you like to publish your mobile app to the App Store, we charge affordable fees.</p>\n<p>For any questions, don’t hesitate to <strong><a href=\"https://appful.io/contact/\" title=\"Get in touch!\" rel=\"nofollow ugc\">get in touch</a>.</strong> We would love to help make your dreams a reality!</p>\n<h4>Core Features of our native mobile Apps</h4>\n<ul>\n<li>Read Later</li>\n<li>Comments</li>\n<li>Native Social Media Sharing</li>\n<li>Offline Reading</li>\n<li>YouTube Support</li>\n<li>Logo Placement</li>\n<li>Own Advertisement</li>\n</ul>\n<h4>Benefits of a mobile App</h4>\n<ul>\n<li><strong>More traffic</strong> &#8211; Users who love your mobile app, will use it regularly </li>\n<li><strong>Provide great user experience on mobile devices</strong> &#8211; A mobile app feels better than a HTML mobile site</li>\n<li><strong>Stronger connection to your community</strong> &#8211; User will NOT only click at one article and leave again</li>\n<li><strong>Earn more money</strong> &#8211; AdBlockers can&#8217;t block the ads inside of your mobile app (Especially on iOS) </li>\n<li><strong>Android app</strong> &#8211; We offer both an mobile Android app and an mobile iOS App for your blog</li>\n</ul>\n<h4>What our customers say about us</h4>\n<blockquote>\n<p>&#8220;My company was looking for a quick solution for launching a native mobile app for our WordPress site. We chose Appful because they offered the most beautiful app themes I found across the web. [&#8230;] The team has been extremely helpful and responsive in walking us through the process to get our app into the app store. [&#8230;] They truly go above and beyond to help you create a great app.&#8221;</p>\n</blockquote>\n<p>Jordan Lejuwaan &#8211; futurism.com</p>\n<blockquote>\n<p>&#8220;We searched for a possibility to create an own mobile app for a long time. With appful this desire was more than satisfied! Top Service, super easy and above all a great mobile app!&#8221;</p>\n</blockquote>\n<p>Niclas Schmidt &#8211; iOSPilot.de</p>\n<blockquote>\n<p>&#8220;The solution of appful.io is easy to use, has a modern and attractive design and offers all the features you might need. In addition, appful.io has the best value for money, not only for bloggers and YouTuber!&#8221;</p>\n</blockquote>\n<p>Renato Mitra &#8211; ApfelBlog.ch</p>\n<blockquote>\n<p><strong>What problem do we solve?</strong></p>\n<p>As soon as publisher decide on setting up an mobile app they face the choice between monotonous low-quality “mobile app builders” lacking the opportunity to create custom designs, because they will never have a chance against mobile apps from professional mobile app agencies. However, agencies and freelancer are slow, changes can be implemented only by the developer and are tremendously expensive. We are a solution to this problem.</p>\n<p><strong>What is your solution?</strong></p>\n<p>We combine all advantages of mobile app builders, freelancers and agencies and additionally clear up all disadvantages. Sounds great, but let us explain how we achieve this: We offer a sophisticated system allowing publishers to create their very own top-notch <strong>native mobile app</strong> for their WordPress blog or YouTube channel for ios and android. In addition to that we only charge a small monthly fee and take over the hosting and general technical care. Furthermore, if requested, we develop a completely distinct and exclusive own custom mobile app design hand in hand with our customers &#8211; the same applies to specific desired functions. appful represents the golden mean between mobile app builders and agencies.</p>\n</blockquote>\n<h4>All Features</h4>\n<ul>\n<li>PUSH &#8211; Unlimited Push Notification</li>\n<li>LIVE EDITING &#8211; Edit your mobile app live, when and where you like</li>\n<li>CACHING &#8211; Caching provides fantastic speed</li>\n<li>ADS &#8211; Place your own Advertisement inside your mobile app</li>\n<li>NATIVE COMMENTS &#8211; Top-notch mobile app comment system</li>\n<li>READ LATER &#8211; Save posts for later</li>\n<li>SOCIAL SHARING &#8211; Native Social Sharing Button</li>\n<li>TWITTER &#8211; Integrate Twitter profile page into your mobile app</li>\n<li>YOUTUBE &#8211; Automatic YouTube Video Import</li>\n<li>OFFLINE READING &#8211; Even offline, posts stay available in the mobile app</li>\n<li>IPAD &#8211; All our native mobile apps are iPad optimized</li>\n<li>APPLE WATCH &#8211; All our native mobile apps run on the Apple Watch</li>\n<li>GOOGLE ANALYTICS &#8211; Use Google Analytics to analyze your mobile app traffic</li>\n<li>SEARCH &#8211; Super fast search</li>\n</ul>\n<p><strong>High performance content caching</strong><br />\nOur sophisticated, redundant high-performance network acquires a real-time cache of your whole blog content in order to provide the best user-experience possible for your mobile app. Multiple servers balance the load and traffic generated by users through our system and make sure that your WordPress blog will not experience any traffic peaks because of your content app. Therefore, your WordPress blog app will seamlessly integrate into your existing eco-system and lift the heavy load from your blog installation so you can focus on what is really important: Making an impact with content publishing. Adding to that, your readers or customers can enjoy the full power and speed of your native content app.</p>\n<p><strong>Native comments in your mobile app</strong><br />\nAn elaborated native commenting system empowers you to integrate the best social interaction experience possible, right inside your mobile app on the user’s phone. Multiple solutions such as a native Disqus app integration or a native WordPress comment app integration make sure that users can interact and discuss with your whole community.</p>\n<blockquote>\n<p><strong>How the magic works</strong></p>\n<p><strong>1. Install and activate the appful plugin</strong></p>\n<p>The plugin enables us to import your blog content into your mobile app. Moreover, the mobile blog plugin of us makes it possible that changes to your content sync live with your mobile app.</p>\n<p><strong>2. Sign up at <a href=\"https://appful.io/\" title=\"Create mobile Blog Apps for iOS and Android\" rel=\"nofollow ugc\">appful.io</a> and create your mobile app</strong></p>\n<p>From your dashboard you can create your first mobile app for ios and android, choose a beautiful design and upload your logo to customise your mobile app. You&#8217;ll be able to add an icon and launch image later on in the process.</p>\n<p><strong>3. Preview &amp; Test your mobile app</strong></p>\n<p>As soon as you are finished with your mobile app, you can download our <code>appful</code>-App from the App Store or Play Store in order to test your mobile app on your own mobile devices (iPhone, iPad and Android phones and tablets).</p>\n<p><strong>4. Choose one of our plans and go live!</strong></p>\n<p>Finally, you click <code>Test &amp; Publish</code> at the top of our Dashboard. Follow the final mobile app setup, choose one of our plans and place the order. In a matter of days we&#8217;ll submit your mobile app to App Store and Google Play Store.</p>\n</blockquote>\n<p><strong>Custom mobile App Design</strong></p>\n<p>A huge advantage of our <strong>mobile app</strong> solution is the option of a Custom-Design. In case, you wish to go live with a fully unique mobile app design, contact us, we can make this possible. We even can realize custom function for your mobile app.</p>\n<p><strong>Enterprise mobile app</strong></p>\n<p>Since we have got great feedback of enterprise customers, we offer your company special enterpise plans in order to get your mobile app to the next level. Simply contact us!</p>\n<p><strong>Ads in the mobile app</strong></p>\n<p>With a mobile app you have the full control about the displayed ads in your native mobile app. A Mobile app in our &#8220;Starter&#8221; plan is completely ad-free. With our plus and Business plan you can start earning money with your mobile app.</p>\n<p><strong>Thanks for your aweseome feedback. We have got surprising much and helpful suggestions regarding our mobile app system, our appful Dashboard and our mobile app. Keep on sending us your thoughts!</strong></p>\n<p><strong>Mobile app for iOS and Android</strong></p>\n<p>In addition, we provide you with an own appful test-app. The mobile app for iOS and Android allows you to preview your just created mobile app on your own device. So use this opportunity to test your mobile app. You can adjust every detail and preview it right on your phone. This way, before you submit your mobile app into the store, you can make sure that everything works exactly like you want it to &#8211; no surpises. In addition to that, we provide exact statisticts on the use of your mobile app to create highest transperancy. Our aim is to make both our customers and their readers happy. Your mobile app will build brand cognizance. A mobile app for your business can greatly contribute to your brand vigilance.</p>\n<p><strong>Why we started</strong></p>\n<p>Mobile apps became one of the driving forces of modern civilization. Studies recently discovered that we spend more than 80% of our time on our mobile devices in mobile apps. As a result, bloggers are required to follow this trend and create a mobile app &#8211; otherwise they are not able to reach their audience. The most important feature of a mobile app is push notifications. Through them, bloggers can directly reach their audience. A mobile app has many advantages, however it is usually very expensive in development. Our aim was to create a real alternative and set a new standard in the process of creating a mobile app and we think that we succeeded. All of this thanks to a mobile app built in a couple of seconds utilizing our astonishing mobile app plugin for WordPress.</p>\n<p><strong>Who we are</strong></p>\n<p>Two years ago, one member ran a blog and was desperatly looking for somebody that would develop him an mobile app for his blog. For the same reasons metioned above, he insisted on trying an mobile app in the form of an ios and android app because he was sure that a mobile app makes a huge difference in comparison to browsers. At first he did not find anybody who was able to develop his mobile app as an android app until he found the developer of our current team. We developed the mobile app together and it had tremendous success. We were so proud of our work and discovered a whole new world and everything that was possible in it &#8211; the world of mobile apps. What started as a little idea soon became a passion. We planned to build a company that provides the tools for bloggers to do the same. appful has been in development for 2 years and we are now very close friends. The love to mobile apps for ios and android and our passion is what keeps the company running. The times where you have to go to an agency and pay thousands of dollars to get a middle-class looking mobile app for ios and android are over. We provide you with a very affordable, stunning app for android and ios that can easily keep up with competitiors &#8211; more over your chances are good to get a very successful mobile app. We only take little fees to keep your app updated and running. Our mobile app company is now based in Germany and has a great success. We are very proud of what we already accomplished and looking forward to seeing what is going to follow. Be part of our story an try us free and get your own mobile app for your blog!</p>\n<p><strong>Differences between mobile apps and mobile sites</strong></p>\n<p>In every area of our lives we recognize the trend to mobiles devices and smartphones. Mobile Devices (Android Apps and iOS Apps) are everywhere and they are talking over task by task. We use a mobile app for communication, a mobile app for entertainment, a mobile app for booking, a mobile app for eating, a mobile app photos, a mobile app for meeting new people and especially a mobile app for getting informations and news on both android and ios.<br />\nA mobile app accommodate many functions: they can provide general info, contact prices, reserve forms, search engines, utilizer accounts, heralds, news victuals, events, special deals and even more. Thanks to push notifications you can get even more proximate and directly interact from your mobile app to your client.<br />\nMake it facile for your readers or customers to contact you &#8211; your mobile app plugin will avail you build better customer cognations.<br />\nHaving a mobile app for is still quite recherche, this can give you a leap in advance against your competition.<br />\nmobile App vs. mobile Web App vs. mobile site</p>\n<p>In every area of our lives we recognize the trend to mobiles devices and smartphones. Mobile Devices (Android Apps and iOS Apps) are everywhere and they are talking over task by task. We use a mobile app for communication, a mobile app for entertainment, a mobile app for booking, a mobile app for eating, a mobile app photos, a mobile app for meeting new people and especially a mobile app for getting informations and news on both android and ios.</p>\n<p>Did you know that we spend more than 80% in native mobile apps when we use our android and ios devices? As a result, less than 20% of our smartphone use time is spend in browsers where people read your blog, and the trend is growing towards a mobile app.</p>\n<p>If you are a publisher with a large audience and do not have a mobile app yet, your readers have no possibility to be up-to-date with your news. Only through a native mobile app you can unfilteredly reach your target group through push notifications. In addition to that, a native mobile app creates a whole different feeling when using it. It can use the core advantages of native software and access powerful frameworks and offer tremendous features.</p>\n<p>Since you are on our page, chances are that you have already tried out different mobile app builder solutions. You may have also noticed that a vast majority of mobile app builders are complex to use, look unprofessional and unclean and are very limited in both function and design. Furthermore, they are very expensive and often require a developer account that also costs more than 100$/year. On top of that, they limit push notifications for your mobile app.</p>\n<p>We are bloggers ourselves and also discovered these issues when trying to create a mobile app. You can either use an overpriced mobile app builder or offer a professional agency that takes very long and is very expensive as well.</p>\n<p>So we thought there has to be a better way and we invented appful &#8211; the golden mean between mobile app builders and agencies for an android app and an ios app. We offer a strong background system, take care of the whole process of publishing, managing and updating your mobile app for ios and android and offer affordable prices. Furthermore we enable you to better monetize your mobile app for android and ios and earn more money. We do not limit push notifications. Once set up, you never have to worry about your mobile app again. Push notifications are sent completly automatically &#8211; no action required. In our strong analytics system you can watch your mobile app growing.</p>\n<p>The best thing is that we want you to be happy with your app so we decided not to charge any money until you are 100% satisfied and decide to release your mobile app for ios to the app store and your android app to the play store. You can try and experiment with every function and design your mobile app as long as you like for free and test your android app and ios app on your devices.</p>\n<p>Once you are content with your mobile app you can hand it over to us and we will take care of the remaining process. We will hand your iOS App over to Apple and your Android App to Google and offer strong servers that process the content of your mobile app. Your site does not have to struggle with an extra amount of traffic.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/appful.1.1.2.zip",
    "upgrade_notice": {
        "appful Mobile App Plugin 1.0": "<p>Release</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/appful/assets/screenshot-1.jpg?rev=1334655",
            "caption": "That's the appful.io Dashboard. There you create your mobile app for ios and android, fill in your mobile App details, choose your preferred WordPress App Design."
        },
        {
            "src": "https://ps.w.org/appful/assets/screenshot-2.jpg?rev=1334655",
            "caption": "One of our mobile App Designs for the iPhone and iPad."
        },
        {
            "src": "https://ps.w.org/appful/assets/screenshot-3.jpg?rev=1334655",
            "caption": "Another example for a appful mobile App."
        },
        {
            "src": "https://ps.w.org/appful/assets/screenshot-4.jpg?rev=1334655",
            "caption": "This is our appful Test App for our customers. The mobile App contains stats and the ability to test you App before publishing it to the App Store."
        },
        {
            "src": "https://ps.w.org/appful/assets/screenshot-5.jpg?rev=1334655",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/appful/assets/screenshot-6.jpg?rev=1334655",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/appful/assets/screenshot-7.jpg?rev=1334655",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/appful/assets/screenshot-8.jpg?rev=1334655",
            "caption": ""
        }
    ],
    "tags": {
        "android": "android",
        "app": "app",
        "ios": "ios",
        "mobile": "mobile",
        "mobile-app": "Mobile App"
    },
    "stable_tag": "1.1.2",
    "versions": {
        "1.1.0": "https://downloads.wordpress.org/plugin/appful.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/appful.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/appful.1.1.2.zip",
        "trunk": "https://downloads.wordpress.org/plugin/appful.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://appful.io/",
    "banners": {
        "low": "https://ps.w.org/appful/assets/banner-772x250.jpg?rev=1227575",
        "high": "https://ps.w.org/appful/assets/banner-1544x500.jpg?rev=1227575"
    },
    "icons": {
        "1x": "https://ps.w.org/appful/assets/icon-128x128.jpg?rev=1227575",
        "2x": "https://ps.w.org/appful/assets/icon-256x256.jpg?rev=1227575"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 84,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}