{
    "name": "Visual Website Collaboration, Feedback &amp; Project Management &#8211; Atarim",
    "slug": "atarim-visual-collaboration",
    "version": "4.0.4",
    "author": "<a href=\"https://atarim.io/\">Atarim</a>",
    "author_profile": "https://profiles.wordpress.org/wpfeedback/",
    "contributors": {
        "wpfeedback": {
            "profile": "https://profiles.wordpress.org/wpfeedback/",
            "avatar": "https://secure.gravatar.com/avatar/e78ae153aa24c4b588ca8d9f2d85eb12?s=96&d=monsterid&r=g",
            "display_name": "Vito Peleg"
        },
        "pratapdungrani": {
            "profile": "https://profiles.wordpress.org/pratapdungrani/",
            "avatar": "https://secure.gravatar.com/avatar/bfcdc84bfeb542ccc7586eddbdbef839?s=96&d=monsterid&r=g",
            "display_name": "Pratap Dungrani"
        }
    },
    "requires": "5.0",
    "tested": "6.6.1",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 123,
        "4": 1,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 126,
    "support_url": "https://wordpress.org/support/plugin/atarim-visual-collaboration/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 2000,
    "downloaded": 77197,
    "last_updated": "2024-08-20 12:06:00",
    "added": "2022-09-21",
    "homepage": "",
    "sections": {
        "description": "<p><strong>An easy to use visual collaboration tool that clients LOVE! Atarim allows you to collect feedback on your WordPress websites and making design project management a breeze.</strong></p>\n<p>Atarim Visual Collaboration makes it easy and efficient to collaborate on websites with your clients, internal team, contractors…anyone! It&#8217;s used by nearly 10,000 agencies and freelancers worldwide on over 120,000 websites.</p>\n<p>Need to submit some feedback? Do it straight on the front-end (or back-end) of your WordPress websites without the need to create a task on your project management tool, take a screenshot, upload it, rename it, annotate it, notify your team&#8230;and all the other steps required!</p>\n<h3>🚀 What is Atarim &amp; how do I get started?</h3>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Yyydw1OM4vI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span><br />\nAtarim consistently reduces project and task completion time by more than half, saving literally HOURS from every single day per team member, and removes the agency owner from being the bottleneck of their own business by automating most of the day-to-day work, follow-ups, back-and-forth with clients and internal collaboration within the team.</p>\n<h3>👩‍🏭👷‍♂️ Who Is This For?</h3>\n<p><strong>If you are working on a WordPress website with clients, your team, contractors, your partner&#8230;anyone, then this plugin is for you.</strong></p>\n<p>Whether you are a freelancer, a huge agency, or running your own website – our plugin makes collaboration easy.</p>\n<p>Atarim can replace project management tools you&#8217;re already using, eliminating the disorganization that occurs when your feedback, requests, and tasks are all fragmented between 10 different tools &#8211; as well as the need to take constant screenshots for annotation and sharing.</p>\n<p>This visual feedback tool slots easily into your workflow, and it automatically takes screenshots, saves user information, minifies images shared by your clients&#8230;and so much more!</p>\n<h3>🤯 Start using now for free &#8211; forever!</h3>\n<p>Visually collaborate on as many websites as you want. Our free plan is FREE FOREVER &#8211; if it suits your needs you&#8217;ll never need to pay a penny, log credit card details or watch a single ad!</p>\n<p><strong>Empower everyone by delivering the ability to leave post-it note like feedback on your live WordPress websites</strong>, getting rid of outdated, time consuming and wasteful forms of communication like emails, Zoom, Slack and the 10 other tools you’re using for project management.</p>\n<p>Atarim is a cloud-based app where you can manage all requests that are made on your WordPress websites from one platform, making it the most efficient WordPress website project management platform to use.</p>\n<p>Manage your website projects visually with your clients and team on live, staging and even development websites! And even after the project is finished, Atarim will help get everyone involved on the same page (literally) for your ongoing internal communications around the website.</p>\n<p><strong>Get rid of the crazy long back and forth to get to project completion in a fraction of the time it usually takes and efficiently dealing with post-launch, ongoing requests and feedback!</strong></p>\n<h3>✅ What Atarim can do for you and your team:</h3>\n<ul>\n<li>\n<p><strong>Visually Collaborate</strong>: Enable everyone to leave you visual requests and feedback on live WordPress websites, making tasks like bug tracking and content updates a breeze.</p>\n</li>\n<li>\n<p><strong>Urgency</strong>: Update the urgency of requests, letting everyone know how quickly they need to be completed.</p>\n</li>\n<li>\n<p><strong>Status</strong>: Change the status of a request from “Open” to “In Progress”, “Pending Review” or “Complete” which will be included in a grouped email notification, so you don’t have to ping team members or clients on Slack!</p>\n</li>\n<li>\n<p><strong>Comments Feed</strong>: Requests contain all updates in the comments feed, so everyone knows what’s happening! Updates contain what was changed and who changed it.</p>\n</li>\n<li>\n<p><strong>Automated Screenshots</strong>: Requests automatically generate a screenshot with the current view. See exactly what they see and debug problems easier.</p>\n</li>\n<li>\n<p><strong>File Uploads</strong> : Upload images, PDF&#8217;s and all file types to a request that can then be pushed to the Media Folder with one click, keeping your Media Folder clean.</p>\n</li>\n<li>\n<p><strong>Push To Media Folder</strong>: Automatically optimise images for web and push to the WordPress media folder with one click.</p>\n</li>\n<li>\n<p><strong>Technical Info</strong>: Requests contain technical information like the browser version, screen resolution and the exact page URL about the request creator. So you spend less time debugging and figuring out what the request creator meant.</p>\n</li>\n<li>\n<p><strong>Guest Mode</strong>: Enable anyone visiting your WordPress website to leave requests, perfect for staging websites or the build stage of a project.</p>\n</li>\n<li>\n<p><strong>Auto-login</strong>: Automatically login to all WordPress websites you have installed from the centralised Atarim Dashboard, making project management even easier!</p>\n</li>\n<li>\n<p><strong>One Platform</strong>: Manage all requests from one inbox inside the Atarim Dashboard so you can quickly tackle requests and complex revisions rounds at scale.</p>\n</li>\n<li>\n<p><strong>Grouped Email Notifications</strong>: Instead of filling up your email inbox with many notifications, Atarim groups notifications into easy-to-read and beautiful reports.</p>\n</li>\n<li>\n<p><strong>Back-end Collaboration</strong>: Create requests on any of your WP admin screens, perfect for pointing out things and teaching your clients how to use the WP Dashboard, or having discussions with your internal team.</p>\n</li>\n<li>\n<p><strong>Request Sidebar</strong>: Use the Atarim sidebar to click on requests, taking you directly to them, making feedback easy to find.</p>\n</li>\n<li>\n<p><strong>Request Filter</strong>: Filter the Atarim sidebar to show requests that have a certain status or urgency.</p>\n</li>\n<li>\n<p><strong>Assign WP Users</strong>: Assign WordPress users to requests so they receive notifications about changes.</p>\n</li>\n<li>\n<p><strong>Share Links</strong>: Share requests via link to send to others, which will take them directly to that request on the relevant page, on the WordPress website.</p>\n</li>\n<li>\n<p><strong>Front-end Login</strong>: Use a custom front-end login pop-up when sharing request links on any page. Once logged in, it will keep you on the page, as opposed to the standard WP login which confusingly takes you to the WP Admin Dashboard screen.</p>\n</li>\n<li>\n<p><strong>Additional Email Notifications</strong>: If you need someone to receive grouped notifications outside of the WP website, you can add as many additional email addresses you need.</p>\n</li>\n<li>\n<p><strong>Request Visibility</strong>: Control default request visibility on the website to hide requests if you ever need to.</p>\n</li>\n<li>\n<p><strong>WP User Role Permissions</strong>: Decide which user roles inside your WP website should have access to using visual collaboration.</p>\n</li>\n<li>\n<p><strong>Default Users</strong>: Assign default main client and main webmaster users for automated related workflows.</p>\n</li>\n</ul>\n<h3>🤷‍♂️🤷‍♀️ Why Should You Use Atarim??</h3>\n<p>One of the biggest problems we face when working on a website is the constant back and forth that occurs from outdated methods of communication when trying to manage projects.</p>\n<p><strong>78% of website teams and digital agencies confirmed that constant back and forth and confusing communication as being the most common roadblock</strong> when trying to get a project to the finish line, or when generally collaborating on website-related work.</p>\n<p>Atarim makes it the easiest it’s ever been to collaborate on a website. Stop using emails and Slack to discuss a website, and start using visual collaboration to make task management a breeze.</p>\n<p>Over the past few years Atarim has served thousands of teams and agencies that are collaborating with hundreds of thousands of collaborators, team members, clients, and stakeholders through our platform.</p>\n<p>We are now excited to offer our solution for free, to help you and your team get the benefits of visual collaboration, and take your project management and task management to the next level.</p>\n<h3>🌍 What Our Users Say:</h3>\n<p>&#8220;This has saved me so much time and confusion, my clients now simply send me feedback and I have all of the information I need to get the work done”</p>\n<p><strong>Sarah Crawford &#8211; A Lined Design</strong></p>\n<p>&#8220;Unbelievably powerful project management tool, along with outstanding service from the support team”</p>\n<p><strong>John Comley</strong></p>\n<p>&#8220;A must-have for any WordPress consultant or designer working with clients.”</p>\n<p><strong>Fanny Veldmeyer &#8211; So Pressed</strong></p>\n<p>&#8220;One of the biggest time saver for me in years. Working with clients is now really simple, fast and intuitive for me.”</p>\n<p><strong>Patrik Čada – Patrik Čada Web Design</strong></p>\n<h3>🙌 Let’s see what you get with the Atarim Plugin</h3>\n<p>OR <a href=\"https://atarim.io/pricing\" rel=\"nofollow ugc\">check out our Premium Plans here</a></p>\n<p><strong>ATARIM VISUAL COLLABORATION PLUGIN</strong></p>\n<ul>\n<li>\n<p><strong>Unlimited Websites</strong><br />\nInstall the plugin on as many WordPress websites as you want, there is no limit.</p>\n</li>\n<li>\n<p><strong>Unlimited Collaborators Within WordPress</strong><br />\nVisual collaboration can be used by everyone who has a WordPress account on a website (subject to which user roles are active).</p>\n</li>\n<li>\n<p><strong>Front-End Visual Collaboration</strong><br />\nCreate post-it note like requests and feedback on the front-end of the live website.</p>\n</li>\n<li>\n<p><strong>Status</strong><br />\nUpdate the status of requests to let your clients and team know when they are complete.</p>\n</li>\n<li>\n<p><strong>Urgency</strong><br />\nSet how urgent a task is to set the priority of a request so critical work gets done first.</p>\n</li>\n<li>\n<p><strong>Auto-screenshot</strong><br />\nA screenshot of the request creator&#8217;s view is generated for every request, making it easy to debug issues.</p>\n</li>\n<li>\n<p><strong>Detailed Info</strong><br />\nSee the browser and screen size of the request creator, enabling you to cut down on back-and-forth with your clients.</p>\n</li>\n<li>\n<p><strong>WordPress Admin Visual Collaboration</strong><br />\nCreate requests on the back-end to teach your clients how to use their website.</p>\n</li>\n<li>\n<p><strong>File Uploads</strong><br />\nUpload files to requests, including images, PDF&#8217;s, zips and more&#8230;</p>\n</li>\n<li>\n<p><strong>1 Click &#8220;Push To Media Folder&#8221;</strong><br />\nMinify and push images straight to the WordPress media library with one click.</p>\n</li>\n<li>\n<p><strong>Grouped Email Notifications&#8221;</strong><br />\nAssign users to requests so they receive grouped notifications about changes, including status/urgency updates, new comments and more.</p>\n</li>\n<li>\n<p><strong>Guest Mode</strong><br />\nNo login or registration needed to use Atarim on the front-end, perfect for staging sites.</p>\n</li>\n<li>\n<p><strong>Task Centre [PREMIUM]</strong><br />\nView and manage all requests from an internal task centre inside the WordPress admin, making project management so much easier.</p>\n</li>\n<li>\n<p><strong>White Label [PREMIUM]</strong><br />\nCustomise the logo, icon and colour of the entire plugin, making it your own.</p>\n</li>\n<li>\n<p><strong>Compact Mode [PREMIUM]</strong><br />\nCreate a more compact experience by replacing the bottom bar with a small widget, making it clearer for everyone involved to use.</p>\n</li>\n<li>\n<p><strong>Approve Pages [PREMIUM]</strong><br />\nApprove pages with the click of a button and have the option to change the status of all requests on that page to complete.</p>\n</li>\n<li>\n<p><strong>Internal Tasks [PREMIUM]</strong><br />\nCreate internal tasks which are hidden from user roles with less permissions, perfect for collaborating with your team on things others don’t need to see.</p>\n</li>\n<li>\n<p><strong>Task Centre [PREMIUM]</strong><br />\nView and manage all requests from an internal task centre inside the WordPress admin.</p>\n</li>\n<li>\n<p><strong>User Permissions [PREMIUM]</strong><br />\nFully customise what each user role can do with the plugin, giving you full control.</p>\n</li>\n<li>\n<p><strong>Automated Reports [PREMIUM]</strong><br />\nSend 24 hour, and 7 day reports containing all requests created and updates to those requests.</p>\n</li>\n<li>\n<p><strong>Edit/Delete Comments[PREMIUM]</strong><br />\nMade a mistake in your comment? Simply edit or delete it!</p>\n</li>\n<li>\n<p><strong>Global Settings [PREMIUM]</strong><br />\nTurning global settings on will apply the settings configured inside your Dashboard, making it super quick and easy to setup your projects.</p>\n</li>\n<li>\n<p><strong>Remove Mention Atarim [PREMIUM]</strong><br />\nCompletely remove the mention of Atarim inside the plugin, making it your own (especially combined with white labelling).</p>\n</li>\n</ul>\n<p><strong>ATARIM DASHBOARD</strong></p>\n<ul>\n<li>\n<p><strong>Unlimited Websites</strong><br />\nActive assets within your Atarim Dashboard, you can add/archive assets freely. Archived sites are not counted.</p>\n</li>\n<li>\n<p><strong>Visual Collaboration on ANY Website</strong><br />\nAdd &#8220;Stickers&#8221; to annotate any website visually. From WordPress, to cloud applications like Shopify or WebFlow, and even custom builds.</p>\n</li>\n<li>\n<p><strong>Image-Based Collaboration</strong><br />\nMake it easy to work together with your clients and team by visually collaborating on that beautiful new mockup you made, or a new logo!</p>\n</li>\n<li>\n<p><strong>Email-Based Support Desk</strong><br />\nSend and receive emails that will automatically filter incoming clients requests into their respective websites.</p>\n</li>\n<li>\n<p><strong>Productivity KPIs</strong><br />\nUnlock your profits by becoming a data-driven agency &#8211; Seeing statistics, benchmarks, and KPIs.</p>\n</li>\n<li>\n<p><strong>Kanban Boards</strong><br />\nDrag &amp; drop boards where requests become to-do lists for your team, creating an amazing workflow for project and task management.</p>\n</li>\n<li>\n<p><strong>Image Optimisations</strong><br />\nEvery image uploaded is automatically optimised for web, no need for TinyPNG, Imagify, ShortPixel, Optimole or WP Smush!</p>\n</li>\n<li>\n<p><strong>Track Time [PREMIUM]</strong><br />\nAdd estimations on how long a request will take to complete and create timers, giving you accurate data on how long things are taking to complete.</p>\n</li>\n<li>\n<p><strong>Export Time Reports [PREMIUM]</strong><br />\nExport white labelled reports that contain all time that has been tracked.</p>\n</li>\n<li>\n<p><strong>Team Management [PREMIUM]</strong><br />\nSee all activity that has been done by your entire team, giving you a full overview of all work done inside the Dashboard.</p>\n</li>\n<li>\n<p><strong>Basic Integrations [PREMIUM]</strong><br />\nGet access to webhooks and an API key to integrate Atarim with platforms like Zapier, Integromat and Pabbly.</p>\n</li>\n<li>\n<p><strong>Deep Integrations [PREMIUM]</strong><br />\nFully integrate with platforms like Slack, MainWP, Rocket.net and more. To embed Atarim into your workflow even further.</p>\n</li>\n</ul>\n<h3>👩‍💻 Atarim Integrations Available:</h3>\n<ul>\n<li>\n<p><strong>Zapier, Pabbly and Integromat</strong>: Connect Atarim to 5000+ apps. Create triggers from visual collaboration like request creation and status changes and push them to apps like ClickUp and Trello</p>\n</li>\n<li>\n<p><strong>ClickUp</strong>: Automatically push all requests created to a specific task list inside ClickUp and deploy full task lists from ClickUp into a website inside Atarim.</p>\n</li>\n<li>\n<p><strong>Slack</strong>: Connect Atarim to a Slack bot to automatically post new requests, request changes and more to a specific Slack channel.</p>\n</li>\n<li>\n<p><strong>Bertha.ai</strong>: With both plugins installed, you can use Bertha to generate copy directly into task pop-overs, making create amazing content for your sites easy!</p>\n</li>\n<li>\n<p><strong>Asana</strong>: Automatically push all requests created to a specific project inside Asana, and pull in full task lists from Asana to a website inside your Atarim Dashboard.</p>\n</li>\n<li>\n<p><strong>Jira</strong>: Automatically push all requests created to a specific list inside Jira, and pull in full task lists from Asana to a website inside your Atarim Dashboard.</p>\n</li>\n<li>\n<p><strong>MainWP</strong>: Add websites from your MainWP Dashboard to Atarim with one click, manage all requests from your MainWP Dashboard created inside Atarim and get an overview of a website’s health inside your Atarim Dashboard.</p>\n</li>\n<li>\n<p><strong>Rocket</strong>: Create Rocket staging websites and automatically install the Visual Collaboration plugin inside your Atarim Dashboard, and manage the Rocket hosting settings of your websites from your Atarim Dashboard.</p>\n</li>\n<li>\n<p><strong>Trello</strong>: Automatically add requests created on your WordPress websites to a board inside Trello, ensuring that nothing is ever missed when using both platforms.</p>\n</li>\n<li>\n<p><strong>Basecamp</strong>: Automatically add requests created on your WordPress websites to your Basecamp Task Lists, keeping all of your work synchronized.</p>\n</li>\n<li>\n<p><strong>Webhooks</strong>: Create your own integrations with any app you want by using webhooks for pushing new requests, status/urgency changes and more…</p>\n</li>\n</ul>\n<h3>📆 Atarim Integrations Coming Soon:</h3>\n<ul>\n<li><strong>TeamWork</strong></li>\n<li><strong>Zendesk</strong></li>\n<li><strong>Figma</strong></li>\n<li><strong>Adobe XD</strong></li>\n<li><strong>RunCloud</strong></li>\n<li><strong>Monday</strong></li>\n<li><strong>Notion</strong></li>\n<li><strong>Airtable</strong></li>\n</ul>\n<p><em>(You can already integrate with all these via Zapier, but we are working on developing deeper integrations, which we&#8217;ll start launching in 2023. Stay tuned to hear when they go live!)</em></p>\n<h3>🔥 Atarim works with all the major page builders, SEO, Ecom and LMS plugins on the market:</h3>\n<ul>\n<li><strong>WordPress Blocks Editor (Gutenberg)</strong></li>\n<li><strong>Divi Theme</strong></li>\n<li><strong>Elementor</strong></li>\n<li><strong>Visual Composer</strong></li>\n<li><strong>Beaver Builder</strong></li>\n<li><strong>Oxygen Builder</strong></li>\n<li><strong>Thrive Architect</strong><br />\nand more&#8230;</li>\n</ul>\n<h3>🚀 Learn how to use Atarim</h3>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/AS9p-mHoAuM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent&#038;listType=playlist&#038;list=PLFonzSqznz8en-x_MEnuLsnnh0gdg1qrs\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span><br />\n<strong><a href=\"https://www.youtube.com/c/Atarim-io\" rel=\"nofollow ugc\">Check out our YouTube channel for full capabilities </a></strong></p>\n",
        "faq": "\n<dt id='is%20it%20free%3F'>\nIs it free?\n</h4>\n<p>\n<p>Absolutely! The free version of the Atarim can be used with as many websites as you want, with some of the more advanced features of benefit to larger agencies being offered on our premium plans.</p>\n</p>\n<dt id='why%20do%20i%20need%20to%20register%3F'>\nWhy do I need to register?\n</h4>\n<p>\n<p>Registering creates a free account on the Atarim Dashboard.</p>\n<p>The reason for this is to stop your WordPress Database being cluttered with all of the requests being made. We store all information securely off-site, very much like Slack, support desks and project management systems.</p>\n<p>Your free account acts as the central hub for your communications on as many websites as you want. The registration (or login process if you already have an account with us) allows us to connect this website to your Atarim account.</p>\n<p>This will give you access to the entire platform, where you can see all of the websites that currently have the Atarim Visual Collaboration Plugin installed.</p>\n<p>One click login, assign team members to requests, reply to requests and a whole lot more&#8230;</p>\n</p>\n<dt id='how%20and%20why%20is%20this%20free%3F'>\nHow and why is this free?\n</h4>\n<p>\n<p>Atarim as a whole platform offers some advanced functionality for digital agencies and website teams who are trying to really up their game in project management.</p>\n<p>However, the free version gives you everything you need to visually collaborate and start cutting out the crazy back-and-forth that happens when working on a website.</p>\n<p>The premium plans just give you a lot more functionality to take it a few steps further!</p>\n</p>\n<dt id='how%20is%20this%20reducing%2080%25%20of%20the%20time%20it%20takes%20to%20get%20work%20done%3F'>\nHow is this reducing 80% of the time it takes to get work done?\n</h4>\n<p>\n<p>An average basic website project takes between 4-6 weeks (if all goes well), yet we all know that if we have everything we need, building a website on our own takes between 3-5 days.</p>\n<p>Where did the extra 2-4 weeks go (84% of the time)?</p>\n<p><strong>We’re tackling the 84% by providing you the clarity that you need to run a successful website team or agency, with each request and empowering the client with a single intuitive tool that they enjoy using.</strong></p>\n</p>\n<dt id='how%20simple%20is%20it%20to%20use%3F'>\nHow simple is it to use?\n</h4>\n<p>\n<p>Atarim is designed to be so easy and intuitive that even your grandma would get it.</p>\n<p>You can train your client, team and colleagues with 1 sentence “Please click the + icon and make a request/add your content/give your feedback”.</p>\n<p>We even provide swipe copy and video tutorials that you can send your client directly to teach them in 5 minutes how to use our platform.</p>\n<p>Also, the first time a WordPress user visits the website after installation, they are shown a pop-up with a tutorial that lasts a few seconds to train them.</p>\n</p>\n<dt id='will%20this%20work%20with%20my%20theme%20%26%20page%20builder%3F'>\nWill this work with my theme &amp; page builder?\n</h4>\n<p>\n<p>Yes. Atarim is designed to work with any theme or page builder available on the market.</p>\n</p>\n<dt id='will%20this%20work%20with%20any%20website%3F'>\nWill this work with any website?\n</h4>\n<p>\n<p>The Atarim Visual Collaboration Plugin will only work on WordPress websites.</p>\n<p>However, from the web-based Atarim Dashboard you can use visual collaboration on ANY website, all you need to do is add the URL. Instead of this being on the live website itself, visual collaboration will happen inside the Dashboard!</p>\n</p>\n<dt id='what%20if%20my%20clients%20start%20adding%20hundreds%20of%20requests%3F'>\nWhat if my clients start adding hundreds of requests?\n</h4>\n<p>\n<p>Great! Charge them for it 💪<br />\nThis is the ultimate upsell tool.</p>\n<p>What we find is that this will increase your engagement and satisfaction level with your clients but you can expect similar behaviour from them.</p>\n<p>Those that reach out often will reach out more, it will take you 20-30% of the time it took before to handle the requests, those that rarely reached out will probably stay the same.</p>\n</p>\n<dt id='should%20i%20only%20use%20atarim%20on%20new%20websites%3F'>\nShould I only use Atarim on new websites?\n</h4>\n<p>\n<p>We strongly encourage you to add every single website you are working on, regardless of which stage you are at.</p>\n<p>For example, use it to work internally with your team on your ecomm website, when gathering content from a client on their brand new project, taking support requests on your care plans etc. It’s perfect for all stages.</p>\n</p>\n<dt id='will%20you%20provide%20support%3F'>\nWill you provide support?\n</h4>\n<p>\n<p>Yes! For free users, you can request support through the WordPress forum, OR <a href=\"https://www.atarim.io/facebook\" rel=\"nofollow ugc\">join our community on Facebook to get the answers you need</a></p>\n<p>Once you join Atarim on a premium plan, you’re practically part of the family!</p>\n<p>You can reach out to us via email or on our live chat with any questions you may have and our team of support engineers and customer care experts will be delighted to provide advice.</p>\n</p>\n<dt id='i%20want%20to%20test%20with%20a%20premium%20plan%2C%20can%20i%20upgrade%20after%3F'>\nI want to test with a premium plan, can I upgrade after?\n</h4>\n<p>\n<p>Of course. You can upgrade to any plan at any time, whatever works for you.</p>\n</p>\n<dt id='where%20do%20i%20report%20security%20bugs%3F'>\nWhere do I report security bugs?\n</h4>\n<p>\n<p>You can report any security bugs found in the source code of this plugin through the <a href=\"https://patchstack.com/database/vdp\" rel=\"nofollow ugc\">Patchstack Vulnerability Disclosure Program</a>. The Patchstack team will assist you with verification, CVE assignment and take care of notifying the developers of this plugin.</p>\n</p>\n\n",
        "changelog": "<h4>4.0.4</h4>\n<ul>\n<li><strong>Task Center Attachment Issue</strong> &#8211; Fixed issue with uploading attachments in the task center.</li>\n<li><strong>Elementor Compatibility</strong> &#8211; Added support for the latest Elementor structure changes to the collaboration tool.</li>\n<li><strong>Menu Cleanup</strong> &#8211; Removed unnecessary plugin menus: Integration and Support.</li>\n<li><strong>Responsive Sidebar Issue</strong> &#8211; Fixed issue with closing the sidebar in responsive mode.</li>\n<li><strong>Frontend Task Loading Issue</strong> &#8211; Fixed issue with tasks not loading on the frontend for some projects.</li>\n<li><strong>Performance Optimization</strong> &#8211; Optimized plugin setting code to enhance performance and speed.</li>\n</ul>\n<h4>4.0.3</h4>\n<ul>\n<li><strong>Improved Auto Screenshot Accuracy</strong> &#8211; Resolved an issue where the Auto Screenshot feature sometimes failed to highlight the correct section due to mouse movement.</li>\n<li><strong>Fixed White Label Color Display</strong> &#8211; Addressed a problem where the white label color was not reflecting correctly on the front side.</li>\n<li><strong>Enhanced Security for Settings</strong> &#8211; Strengthened security when saving settings to prevent Cross-Site Request Forgery (CSRF) attacks.</li>\n<li><strong>API Call Optimization</strong> &#8211; Reduced the number of API calls to optimize performance for certain actions.</li>\n</ul>\n<h4>4.0.2</h4>\n<ul>\n<li><strong>User list</strong> &#8211; Collaborator user list was available for guest user in the bottom bar. We are no longer showing them as a part of enhancing security.</li>\n<li><strong>Admin notice</strong> &#8211; Secured admin notice action to make sure it can be only triggered by logged in user.</li>\n<li><strong>Code Cleanup</strong> &#8211; Removed code that is not needed after UX changes.</li>\n</ul>\n<h4>4.0.1</h4>\n<ul>\n<li><strong>Task Center Notification Issue</strong> &#8211; Fixed notify user was not reflecting the change on the Task center.</li>\n<li><strong>HTML Task List Filter</strong> &#8211; Fixed broken HTML of the task list when using filter on Task center.</li>\n<li><strong>HTTP Token/Reshare Link Issue</strong> &#8211; Copy token or reshare link action was not working for site with http has been fixed.</li>\n<li><strong>Share Modal UI for Invited Users</strong> &#8211; Fixed UI for invited user on the share modal.</li>\n<li><strong>Sidebar Page Tab UI</strong> &#8211; Fixed Page tab UI in the sidebar when the page image is not available.</li>\n<li><strong>Access Control Vulnerability</strong> &#8211; Fixed access control vulnerability for adding/deleting/editing comment.</li>\n<li><strong>Task Tab Information Overflow</strong> &#8211; Fixed information overflow in the task tab for each task element.</li>\n<li><strong>Sidebar Pagination</strong> &#8211; Fixed pagination not working for &#8216;All page&#8217; filter in the sidebar.</li>\n</ul>\n<h4>v4.0</h4>\n<ul>\n<li><strong>Optimization</strong> &#8211; Modified page tab integration to optimize the page loading speed.</li>\n<li><strong>Compatibility</strong> &#8211; Added support to resolve Bootstrap conflict with Woodmart themes.</li>\n<li><strong>Code Cleanup</strong> &#8211; Removed code that was not needed after UX changes.</li>\n<li><strong>Feature Enhancements</strong>\n<ul>\n<li>Implemented auto-closing of open task popup on creation of a new one.</li>\n<li>Auto login is now enabled by default instead of disabled.</li>\n</ul>\n</li>\n<li><strong>Bug Fixes</strong>\n<ul>\n<li>Fixed an issue where remapping a task was triggering the open task action.</li>\n<li>Resolved the issue where users were unable to delete new tasks without a page refresh.</li>\n</ul>\n</li>\n<li><strong>Security</strong> &#8211; Improved overall security of the plugin.</li>\n<li><strong>Other Changes</strong> &#8211; Removed EDD license key dependency from the code.</li>\n</ul>\n<h4>v3.32</h4>\n<ul>\n<li><strong>XSS vulnerability</strong> &#8211; A Cross-Site Scripting (XSS) vulnerability was identified for tag integration in our plugin, this is now fixed.</li>\n</ul>\n<h4>v3.31</h4>\n<ul>\n<li><strong>XSS vulnerability</strong> &#8211; A Cross-Site Scripting (XSS) vulnerability was identified in a previous version of our plugin, this is now fixed.</li>\n</ul>\n<h4>v3.30</h4>\n<ul>\n<li><strong>License key</strong> &#8211; We have removed license key dependency for better security and compatibility with our platform.</li>\n<li><strong>Plugin check</strong> &#8211; Implemented recommended changes suggested by the plugin check plugin.</li>\n</ul>\n<h4>v3.22.6</h4>\n<ul>\n<li><strong>Subfolder Support</strong> &#8211; Our plugin now supports subfolder structures, enabling you to activate our plugin and collaborate on site with the subfolder structure.</li>\n</ul>\n<h4>v3.22.4</h4>\n<ul>\n<li><strong>Removed models</strong> &#8211; We have removed a few restriction models that were not relevant to the current integration.</li>\n</ul>\n<h4>v3.22.3</h4>\n<ul>\n<li><strong>Activation error</strong> &#8211; Upon plugin activation on plugin-install.php page, it was throwing an error due to the inability to redirect after activation. This is fixed.</li>\n</ul>\n<h4>v3.22.2</h4>\n<ul>\n<li><strong>Animation</strong> &#8211; Added animation for task completion action.</li>\n<li><strong>Priority reflection</strong> &#8211; Fixed issue where changing priority on a new task did not reflect in the sidebar.</li>\n<li><strong>Image preview</strong> &#8211; Resolved issue where deleting a previewed image inside popover did not remove the last one.</li>\n<li><strong>Broken UI</strong> &#8211; Fixed file upload problem in edit page mode.</li>\n<li><strong>Guest link</strong> &#8211; Addressed a bug related to guest token link cookies.</li>\n<li><strong>Sidebar view</strong> &#8211; Sidebar task text now clips to a single line for better display.</li>\n</ul>\n<h4>v3.22</h4>\n<ul>\n<li><strong>New sidebar</strong> &#8211; Redesigned the sidebar with a modern layout and improved functionality, enhancing user navigation and accessibility to tasks and pages in the collaboration interface.</li>\n<li><strong>New bottombar</strong> &#8211; Revamped the bottom bar design to provide a sleek and intuitive user experience, offering quick access to essential functions and options while minimizing screen clutter and maximizing workspace efficiency.</li>\n<li><strong>Collaboration mode</strong> &#8211; Introduced a collaboration mode feature, enabling users to collaborate more effectively by toggling between different modes:\n<ul>\n<li><strong>Comment Mode</strong>: Users can provide feedback and comments on shared tasks in real-time.</li>\n<li><strong>Browse Mode</strong>: Users can browse and view content, ensuring uninterrupted naviagtion and focus.</li>\n</ul>\n</li>\n<li><strong>Page tab</strong> &#8211; Integrated a page tab functionality, allowing users to organize and switch between different pages or sections seamlessly, improving overall user experience and navigation.</li>\n<li><strong>Popover design</strong> &#8211; Redesigned the popover interface with modern aesthetics and improved usability, providing users with contextual information and actions in a visually appealing manner.</li>\n<li><strong>Bulk upload</strong> &#8211; Added support for bulk uploading multiple files simultaneously, saving users time and effort when importing large amounts of content into the task/comment interface.</li>\n<li><strong>Image preview</strong> &#8211; Implemented an image preview feature, enabling users to preview uploaded images directly within the task/comment interface, facilitating easier content accessibility.</li>\n<li><strong>File download</strong> &#8211; Enhanced file management capabilities by enabling users to download files directly from the task/comment interface, streamlining the process of accessing and sharing documents.</li>\n<li><strong>Instant task</strong> &#8211; Introduced instant task creation functionality, allowing users to quickly add new tasks or action items without navigating away from the current page, improving productivity.</li>\n<li><strong>Instant comment</strong> &#8211; Implemented instant comment feature, enabling users to provide feedback or collaborate on specific items, fostering effective collaboration.</li>\n<li><strong>Instant update</strong> &#8211; Enhanced real-time updating capabilities, allowing users to instantly update task statuses and priorities, ensuring that changes are reflected instantly in the task, providing a seamless user experience.</li>\n<li><strong>Code optimization</strong> &#8211; Conducted comprehensive code optimization and refactoring to improve overall performance, stability, and maintainability of the plugin, resulting in smoother operation and reduced resource consumption.</li>\n<li><strong>Default user</strong> &#8211; Fixed issue with setting default user for new task upon plugin activation.</li>\n</ul>\n<h4>v3.19</h4>\n<ul>\n<li><strong>Theme conflict</strong> &#8211; Beaver Builder Bootstrap had a conflict with our plugin.</li>\n<li><strong>Code optimization</strong> &#8211; We have optimized some APIs to improve response time.</li>\n</ul>\n<h4>v3.18</h4>\n<ul>\n<li><strong>Auto login</strong> &#8211; We have integrated option to enable/disable auto login to site from app.</li>\n<li><strong>Image optimization</strong> &#8211; To reduce the plugin size, many images have been optimized.</li>\n</ul>\n<h4>v3.17</h4>\n<ul>\n<li><strong>GeneratePress theme JS/CSS</strong> &#8211; The theme had JS and CSS conflict with our plugin which is now fixed.</li>\n<li><strong>Beaver Child theme JS</strong> &#8211; The theme had JS and CSS conflict with our plugin which is now fixed.</li>\n<li><strong>Guest URL token</strong> &#8211; For the old plugin versions, we have added support for guest URL with token.</li>\n</ul>\n<h4>v3.16</h4>\n<ul>\n<li><strong>ePress theme JS/CSS</strong> &#8211; The ePress theme had JS and CSS conflict with our plugin which is now fixed.</li>\n<li><strong>CSS changes</strong> &#8211; We have made some small CSS changes to improve some element alignments.</li>\n</ul>\n<h4>v3.15</h4>\n<ul>\n<li><strong>JS/CSS exclusion</strong> &#8211; We have integrated a way to auto-exclude our JS and CSS from blocking inside the WP Rocket plugin.</li>\n<li><strong>Guest mode</strong> &#8211; Allowing collaboration on-site via sharing URL with token has been integrated to provide quick and easy guest invitations.</li>\n</ul>\n<h4>v3.14</h4>\n<ul>\n<li><strong>Conflict with Block editor</strong> &#8211; Js conflict with Block editor was detected, this is now fixed.</li>\n<li><strong>CSS override</strong> &#8211; CSS of certain themes was overriding a few elements, this is now fixed.</li>\n<li><strong>Password strength</strong> &#8211; Password validation during user registration has been upgraded to allow the user to set a strong password.</li>\n<li><strong>License activation</strong> &#8211; There was an issue updating database value during license reactivation on some sites, this is now fixed.</li>\n</ul>\n<h4>v3.13</h4>\n<ul>\n<li><strong>XSS vulnerability</strong> &#8211; A Cross-Site Scripting (XSS) vulnerability was identified in a previous version of our plugin, this is now fixed.</li>\n<li><strong>Js conflict with ACF</strong> &#8211; Date selection on the date field was not working due to js conflict, this is now fixed.</li>\n<li><strong>User Avatar</strong> &#8211; Due to the changes on the Gravatar API data response, comment author images were not loading, this is now fixed.</li>\n</ul>\n<h4>v3.12</h4>\n<ul>\n<li><strong>Comment overflow</strong> &#8211; On certain themes, there was a problem with comment box overflow which cut off the comment, this is now fixed.</li>\n<li><strong>CSS conflict with Springfield theme</strong> &#8211; Springfield theme CSS was overriding Comment box CSS, this is now fixed.</li>\n<li><strong>Default permission for users</strong> &#8211; We have modified the default permission for users when the user type is not selected.</li>\n</ul>\n<h4>v3.11</h4>\n<ul>\n<li><strong>Screenshot issue with Bricks Theme</strong> &#8211; There was a problem with automatic screenshots with Bricks Theme, this is now fixed.</li>\n<li><strong>Push To Media</strong> &#8211;  There was an issue with pushing media from the Atarim Dashboard to WordPress websites, this is now fixed.</li>\n<li><strong>CSS Fixes</strong> &#8211; There were a few CSS fixes required inside the Atarim interface, these have been fixed.</li>\n</ul>\n<h4>v3.10</h4>\n<ul>\n<li><strong>Activation Flow</strong> &#8211; We have stripped loads from the activation flow to make it super fast to get started, no more wizard and no more role selection on the front-end.</li>\n<li><strong>Automatically assigning roles</strong> &#8211; When you invite users via the front-end share, they will be automatically assigned as a client inside the plugin.</li>\n<li><strong>Removal of graphics</strong> &#8211; Graphic feedback has now been completely removed from the plugin, you can collaborate visually on designs inside the Atarim Dashboard. <a href=\"https://atarim.io/help/dashboard/image-based-collaboration/\" rel=\"nofollow ugc\"> More info on that here. </a> </li>\n<li><strong>Reduced triggers on page load</strong> &#8211; We&#8217;ve reduced the number of action triggers on page load when collaboration is enabled, to make everything faster!</li>\n<li><strong>CSS fixes</strong> &#8211; Some minor CSS fixes across the board.</li>\n</ul>\n<h4>v3.9.6</h4>\n<ul>\n<li><strong>Task pop-up design update</strong> &#8211; We&#8217;ve improved the design of the task pop-over, making it nicer to use.</li>\n<li><strong>Date and time</strong> &#8211; The plugin now uses the time inside your browser, to ensure you see the correct timings on tasks.</li>\n<li><strong>Tag CSS</strong> &#8211; The alignment of tags were not pretty, we&#8217;ve fixed the CSS.</li>\n<li><strong>Task center CSS</strong> &#8211; There were some issues with image alignment and size control on the task center, this is now fixed.</li>\n<li><strong>PhP errors</strong> &#8211; On some websites, php errors were showing, this is now fixed.</li>\n<li><strong>User invite security</strong> &#8211; To increase security, we&#8217;ve sanitized the values used when inviting users.</li>\n<li><strong>Login pop-up</strong> &#8211; Added proper validation and message on the pop-up when logging into a WordPress website using the Atarim modal.</li>\n<li><strong>Variable names</strong> &#8211; We&#8217;ve changed variable names to make them visibly relevant in some places.</li>\n<li><strong>Optimizing loading</strong> &#8211; To decrease load times, we&#8217;ve optimized some API calls.</li>\n<li><strong>Inviting from the back-end</strong> &#8211; When inviting from the back-end of the website, the invite link has been changed to the homepage of the website.</li>\n<li><strong>Uploaded files</strong> &#8211; Sometimes the uploaded files were not rendering properly inside the task popup, this is now fixed.</li>\n</ul>\n<h4>v3.9.3</h4>\n<ul>\n<li><strong>Task center author</strong> &#8211; Sometimes the author name of comments inside the task center was incorrect, this is now fixed.</li>\n<li><strong>Theme css conflict</strong> &#8211; There was an issue where theme CSS was overriding the comment box CSS, this is now fixed.</li>\n<li><strong>Text domain support</strong> &#8211; We&#8217;ve added text domain support for many strings that were missing for translation.</li>\n<li><strong>French translation</strong> &#8211; The plugin is now fully translated into French.</li>\n<li><strong>Reorder post conflict</strong> &#8211; There was a conflict with the reorder post plugin, this is now fixed.</li>\n</ul>\n<h4>v3.9.2</h4>\n<ul>\n<li><strong>CSS Fix</strong> &#8211; Some theme styles were conflicting with the new &#8220;Invite to Collaborate&#8221; feature. This is now fixed.</li>\n<li><strong>Security</strong> &#8211; There was a security risk (not abused) that needed to be fixed which was spotted by one of our users. Was fixed with priority.</li>\n<li><strong>Language support</strong> &#8211; Added plugin translation for French(France), Spanish(Spain), and Portuguese(Brazil) languages.</li>\n</ul>\n<h4>v3.9.1</h4>\n<ul>\n<li><strong>Menu Bar</strong> &#8211; We have now added the option to open the Atarim Dashboard menu bar, to give Admins quick access.</li>\n<li><strong>White Label Invite</strong> &#8211; Previously if you had the white label on, the invitation email was not displaying it, this is now fixed.</li>\n<li><strong>PHP Notices</strong> &#8211; A warning was showing because of PHP, this is now fixed.</li>\n<li><strong>Post-Type Taxonomy</strong> &#8211; Tasks were not loading correctly on custom taxonomy pages, this is now fixed.</li>\n</ul>\n<h4>v3.9</h4>\n<ul>\n<li><strong>Bottom bar conflict</strong> &#8211; There was a JS conflict happening with our new bottom bar, this has been fixed.</li>\n<li><strong>Red overlay</strong> &#8211;  When a task was being created, sometimes a red overlay would show, this has been fixed.</li>\n<li><strong>Task complete validation</strong> &#8211; You could mark a task as complete before creation, this has been fixed. </li>\n<li><strong>Saving settings</strong> &#8211; Sometimes when saving settings, an error would occur, this has been fixed.</li>\n<li><strong>Task center filter</strong> &#8211; When filtering inside the task center, an error was triggering, this has been fixed.</li>\n<li><strong>VC cookie issue</strong> &#8211; There was an issue with VC cookies on sites hosted on 20i, this has been fixed.</li>\n<li><strong>JS validation with username</strong> &#8211; We&#8217;ve added validation to fix tasks not listing when a username was not present.</li>\n<li><strong>Formidable forms</strong> &#8211; We fixed a conflict that was occurring when Formidable Forms was installed along with Atarim.</li>\n</ul>\n<h4>v3.8</h4>\n<ul>\n<li><strong>Bottom bar</strong> &#8211; We&#8217;ve redesigned the bottom bar of the Atarim plugin to make it more in line with the Atarim Dashboard.</li>\n<li><strong>Skip wizard</strong> &#8211; You now have the option to skip the initial wizard, making installation even faster.</li>\n<li><strong>Sharing version 2</strong> &#8211; The share function inside your websites has been updated in a variety of ways to increase the speed of collaboration with your clients. By inviting them, you generate and send a unique link to their email, enabling them to see the Atarim plugin on their website without being logged in.</li>\n<li><strong>Popover conflict</strong> &#8211; There was a conflict that was stopping the pop-over from being closed, this has now been fixed.</li>\n<li><strong>CSS fix</strong> &#8211; There were some font css conflicts causing text not to show correctly, this has now been fixed.</li>\n<li><strong>Autologin error</strong> &#8211; Auto logging was not working with all websites, this has now been fixed.</li>\n</ul>\n<h4>v3.7</h4>\n<ul>\n<li><strong>Links in comments</strong> &#8211; There was an issue with links not working in comments when some tasks load, this is now fixed</li>\n<li><strong>CSS in Task Center</strong> &#8211; When the author of a comment&#8217;s name was too long, it broke the design, this is now fixed.</li>\n<li><strong>Comments container</strong> &#8211; When a link was too long it would break the design, this is now fixed.</li>\n<li><strong>Schema pro plugin</strong> &#8211; There was a JS conflict with the Schema pro plugin, this is now fixed.</li>\n<li><strong>Sites disconnecting</strong> &#8211; Sometimes sites would become disconnected and you&#8217;d have to re-activate, this is now fixed.</li>\n<li><strong>Woocommerce function</strong> &#8211; A function inside Woocommerce became deprecated, this is now replaced. </li>\n</ul>\n<h4>v3.6.1</h4>\n<ul>\n<li><strong>White label</strong> &#8211; Fixed white label integration not working sometimes.</li>\n</ul>\n<h4>v3.6</h4>\n<ul>\n<li><strong>Main file name</strong> &#8211; We have changed the main file name as per the WordPress standard.</li>\n<li><strong>Updraft conflict</strong> &#8211; Fixed a JS conflict with the Updraft plugin.</li>\n<li><strong>Loading Icon</strong> &#8211; Moved the loading icon to local storage to prevent a CORS error.</li>\n</ul>\n<h4>v3.5.1</h4>\n<ul>\n<li><strong>Non-English Characters</strong> &#8211; Non English characters were causing some comments to load incorrectly, this is now fixed.</li>\n<li><strong>Auto-login from the dashboard</strong> &#8211; Auto-logging in from the dashboard was not working in some cases, this is now fixed.</li>\n<li><strong>Alt-text on images</strong> &#8211; Added alt text to all image tags to make them SEO friendly.</li>\n<li><strong>Support for The Theme</strong> &#8211; Added support for the theme to adjust the dashed box on the front side.</li>\n</ul>\n<h4>v3.5</h4>\n<ul>\n<li><strong>One click activation</strong> &#8211; You can now activate with one click, speeding up with the setup process for the Atarim plugin.</li>\n<li><strong>Added a password field when creating an account</strong> &#8211; You can now create your password for brand new accounts inside the plugin, making it faster!</li>\n<li><strong>Bottom bar during installation</strong> &#8211; The bottom bar was showing during the wizard, this has now been removed.</li>\n<li><strong>Default state of bottom bar</strong> &#8211; The bottom bar was closed by default after installation, this has been changed to be open by default.</li>\n<li><strong>Images not loading</strong> &#8211; Images inside tasks were not loading correctly due to a conflict in an API, this has been fixed.</li>\n<li><strong>Global Elementor color</strong> &#8211; The global Elementor color was overriding the color on the Atarim login pop-up, this is now fixed.</li>\n<li><strong>Edit comments</strong> &#8211; Editing a comment was not showing the comment inside the box, this is now fixed.</li>\n<li><strong>Added support for the Black Bros theme</strong> &#8211; The selection box had an alignment issue on the front end when the Black Bros theme was installed.</li>\n</ul>\n<h4>v3.4.3</h4>\n<ul>\n<li><strong>Blocked interface on Bricks theme editor mode</strong> &#8211; The plugin was showing when using the Bricks theme editor mode, this has now been fixed.</li>\n<li><strong>Conflict with Bricks quill classes</strong> &#8211; There was a class conflict with Bricks quill classes, this has now been fixed.</li>\n<li><strong>Mark as complete</strong> &#8211; We changed &#8220;Mark as complete&#8221; on the task pop-over to &#8220;Complete&#8221;, to clear up some space.</li>\n<li><strong>Youtube video preview</strong> &#8211; Youtube video previews were not showing correctly inside tasks, this is now fixed.</li>\n<li><strong>Internal task icon toggle</strong> &#8211; There was an issue with the internal task icon on the pop-over, this has been fixed.</li>\n<li><strong>FluentCRM issue</strong> &#8211; There was an issue where the plugin was not loading inside FluentCRM, this is now fixed.</li>\n<li><strong>General CSS fixes</strong> &#8211; We fixed a few CSS issues and made some small changes to improve design</li>\n</ul>\n<h4>v3.4.2</h4>\n<ul>\n<li><strong>Skipped a version</strong> &#8211; The plugin was one version behind the dashboard, so we have gone straight to 3.4.3</li>\n</ul>\n<h4>v3.4.1</h4>\n<ul>\n<li><strong>General task icon</strong> &#8211; We have changed the icon on the general task icon to make it more pleasing to the eye!</li>\n<li><strong>Comment text font size</strong> &#8211; We have updated the font size on comments to make it more readable.</li>\n<li><strong>CSS changes</strong> &#8211; Multiple small CSS updates and changes to make the design of the plugin more consistent.</li>\n<li><strong>Task center layout</strong> &#8211; We&#8217;ve changed the layout of comments inside the task center to match the new pop-over design comment feed.</li>\n<li><strong>Internal task icon toggle</strong> &#8211; There was an issue with the internal task icon on the pop-over, this has been fixed.</li>\n<li><strong>Author name alignment</strong> &#8211; Fixed an issue where the length of the author name could break the design if too long.</li>\n</ul>\n<h4>v3.4</h4>\n<ul>\n<li><strong>Pop-over design update</strong> &#8211; We&#8217;ve slightly updated the pop-over design for tasks, including the order of icons and color of the comment button.</li>\n<li><strong>Comments feed design update</strong> &#8211; We&#8217;ve changed the layout of the comments feed to make it more of a chat, by adding author images and aligning everything to the left.</li>\n<li><strong>Notes issue:</strong> Previously you could create a task with the first comment being a note, this has now been fixed.</li>\n<li><strong>Divi add-on conflict:</strong> There was a conflict with a Divi add-on that made page ID&#8217;s incorrect, this is now fixed.</li>\n<li><strong>Warnings generated by plugin code:</strong> A warning was showing in the WP admin due to some code inconsistencies, this has now been fixed.</li>\n</ul>\n<h4>v3.3.3</h4>\n<ul>\n<li><strong>Secured SQL Query:</strong> Fixed an edgecase security vulnerability inside the plugin.</li>\n<li><strong>General Tasks:</strong> In some cases, you could not add text to a general task, this is now fixed.</li>\n<li><strong>Formidable Forms Plugin Conflict:</strong> When this plugin was installed alongside Atarim, it was causing issues, this has now been fixed.</li>\n<li><strong>Uncode Theme Conflict:</strong> Some styling issues with the Uncode Theme, which are now fixed.</li>\n<li><strong>Bootstrap JS conflict:</strong> There were a few conflicts that have now been fixed with the JS.</li>\n<li><strong>Bootstrap CSS conflict:</strong> There were a few conflicts that have now been fixed with the CSS.</li>\n</ul>\n<h4>v3.3.2</h4>\n<ul>\n<li><strong>Tablet View:</strong> Tablet view was not showing correctly due to the width being too small, this has now been fixed.</li>\n</ul>\n<h4>v3.3.1</h4>\n<ul>\n<li><strong>Filter issue:</strong> There was previously an issue with the sticker color of task status in the task center, this is now fixed. </li>\n<li><strong>Empty comments:</strong> It was possible to add empty comments due to rich text, we have added more validation to stop this from happening.</li>\n<li><strong>Graphic Feedback Notice:</strong> The notice we added in our last update kept showing, now when you close it you&#8217;ll never see it again.</li>\n</ul>\n<h4>v3.3</h4>\n<ul>\n<li>For the full list of what was included in this update, <a href=\"https://headwayapp.co/atarim-changelog/atarim-3-3-merge-sites-integrations-permissions-more-245450\" rel=\"nofollow ugc\">check out our changelog here!</a></li>\n<li><strong>Google signup:</strong> When you install the plugin on a WordPress website, you now have the option to sign up for a new free account with Google, making the signup process even shorter!</li>\n<li><strong>Graphic FeedBack Notice:</strong> We are planning to move the graphic feedback tool from the plugin to the dashboard, with this update you’ll see a notice to let you know about this.Plugin</li>\n<li><strong>Internal Task Icon:</strong> Alignment on the internal task icon was a bit off, this has been fixed.</li>\n<li><strong>Internal Task Icon Colour:</strong> There were some issues with the color of the icon, this has also been fixed.</li>\n<li><strong>Bottom bar:</strong> On some websites, the bottom bar had a problem with its width, this is now fixed.</li>\n<li><strong>CSS Conflict:</strong> There were some CSS conflicts on specific websites, this has been fixed.</li>\n</ul>\n<h4>V3.2</h4>\n<ul>\n<li><strong>Rich Text:</strong> You can now highlight your comments while adding to add rich text. You can also edit previous comments and add it too!</li>\n<li><strong>Tag Creation:</strong> Previously, you could not add tags to a task after creating it, you needed to refresh, this has been fixed.</li>\n<li><strong>Tasks At The Bottom Of A Page:</strong> Sometimes tasks at the bottom of the page caused the comment button to be hidden, this has been fixed.</li>\n<li><strong>Arrow On Pop-Over:</strong>After we removed bootstrap, we lost the arrow on pop-overs that connected the sticker, this has been fixed.</li>\n<li><strong>Removing Stickers:</strong> Previously, if you tried to create a task, and then create another one without finishing the first, you&#8217;d have two stickers. This has been fixed.</li>\n<li><strong>Automatic Screenshots Not Showing Images or Gradient:</strong> Sometimes images and gradients inside automatic screenshots were not showing, this has now been fixed.</li>\n</ul>\n"
    },
    "short_description": "Speed up the projects with fast feedback and a better workflow. Collect, triage, and action tasks on your projects like sticky notes on a webpage.",
    "description": "<p><strong>An easy to use visual collaboration tool that clients LOVE! Atarim allows you to collect feedback on your WordPress websites and making design project management a breeze.</strong></p>\n<p>Atarim Visual Collaboration makes it easy and efficient to collaborate on websites with your clients, internal team, contractors…anyone! It&#8217;s used by nearly 10,000 agencies and freelancers worldwide on over 120,000 websites.</p>\n<p>Need to submit some feedback? Do it straight on the front-end (or back-end) of your WordPress websites without the need to create a task on your project management tool, take a screenshot, upload it, rename it, annotate it, notify your team&#8230;and all the other steps required!</p>\n<h3>🚀 What is Atarim &amp; how do I get started?</h3>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Yyydw1OM4vI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span><br />\nAtarim consistently reduces project and task completion time by more than half, saving literally HOURS from every single day per team member, and removes the agency owner from being the bottleneck of their own business by automating most of the day-to-day work, follow-ups, back-and-forth with clients and internal collaboration within the team.</p>\n<h3>👩‍🏭👷‍♂️ Who Is This For?</h3>\n<p><strong>If you are working on a WordPress website with clients, your team, contractors, your partner&#8230;anyone, then this plugin is for you.</strong></p>\n<p>Whether you are a freelancer, a huge agency, or running your own website – our plugin makes collaboration easy.</p>\n<p>Atarim can replace project management tools you&#8217;re already using, eliminating the disorganization that occurs when your feedback, requests, and tasks are all fragmented between 10 different tools &#8211; as well as the need to take constant screenshots for annotation and sharing.</p>\n<p>This visual feedback tool slots easily into your workflow, and it automatically takes screenshots, saves user information, minifies images shared by your clients&#8230;and so much more!</p>\n<h3>🤯 Start using now for free &#8211; forever!</h3>\n<p>Visually collaborate on as many websites as you want. Our free plan is FREE FOREVER &#8211; if it suits your needs you&#8217;ll never need to pay a penny, log credit card details or watch a single ad!</p>\n<p><strong>Empower everyone by delivering the ability to leave post-it note like feedback on your live WordPress websites</strong>, getting rid of outdated, time consuming and wasteful forms of communication like emails, Zoom, Slack and the 10 other tools you’re using for project management.</p>\n<p>Atarim is a cloud-based app where you can manage all requests that are made on your WordPress websites from one platform, making it the most efficient WordPress website project management platform to use.</p>\n<p>Manage your website projects visually with your clients and team on live, staging and even development websites! And even after the project is finished, Atarim will help get everyone involved on the same page (literally) for your ongoing internal communications around the website.</p>\n<p><strong>Get rid of the crazy long back and forth to get to project completion in a fraction of the time it usually takes and efficiently dealing with post-launch, ongoing requests and feedback!</strong></p>\n<h3>✅ What Atarim can do for you and your team:</h3>\n<ul>\n<li>\n<p><strong>Visually Collaborate</strong>: Enable everyone to leave you visual requests and feedback on live WordPress websites, making tasks like bug tracking and content updates a breeze.</p>\n</li>\n<li>\n<p><strong>Urgency</strong>: Update the urgency of requests, letting everyone know how quickly they need to be completed.</p>\n</li>\n<li>\n<p><strong>Status</strong>: Change the status of a request from “Open” to “In Progress”, “Pending Review” or “Complete” which will be included in a grouped email notification, so you don’t have to ping team members or clients on Slack!</p>\n</li>\n<li>\n<p><strong>Comments Feed</strong>: Requests contain all updates in the comments feed, so everyone knows what’s happening! Updates contain what was changed and who changed it.</p>\n</li>\n<li>\n<p><strong>Automated Screenshots</strong>: Requests automatically generate a screenshot with the current view. See exactly what they see and debug problems easier.</p>\n</li>\n<li>\n<p><strong>File Uploads</strong> : Upload images, PDF&#8217;s and all file types to a request that can then be pushed to the Media Folder with one click, keeping your Media Folder clean.</p>\n</li>\n<li>\n<p><strong>Push To Media Folder</strong>: Automatically optimise images for web and push to the WordPress media folder with one click.</p>\n</li>\n<li>\n<p><strong>Technical Info</strong>: Requests contain technical information like the browser version, screen resolution and the exact page URL about the request creator. So you spend less time debugging and figuring out what the request creator meant.</p>\n</li>\n<li>\n<p><strong>Guest Mode</strong>: Enable anyone visiting your WordPress website to leave requests, perfect for staging websites or the build stage of a project.</p>\n</li>\n<li>\n<p><strong>Auto-login</strong>: Automatically login to all WordPress websites you have installed from the centralised Atarim Dashboard, making project management even easier!</p>\n</li>\n<li>\n<p><strong>One Platform</strong>: Manage all requests from one inbox inside the Atarim Dashboard so you can quickly tackle requests and complex revisions rounds at scale.</p>\n</li>\n<li>\n<p><strong>Grouped Email Notifications</strong>: Instead of filling up your email inbox with many notifications, Atarim groups notifications into easy-to-read and beautiful reports.</p>\n</li>\n<li>\n<p><strong>Back-end Collaboration</strong>: Create requests on any of your WP admin screens, perfect for pointing out things and teaching your clients how to use the WP Dashboard, or having discussions with your internal team.</p>\n</li>\n<li>\n<p><strong>Request Sidebar</strong>: Use the Atarim sidebar to click on requests, taking you directly to them, making feedback easy to find.</p>\n</li>\n<li>\n<p><strong>Request Filter</strong>: Filter the Atarim sidebar to show requests that have a certain status or urgency.</p>\n</li>\n<li>\n<p><strong>Assign WP Users</strong>: Assign WordPress users to requests so they receive notifications about changes.</p>\n</li>\n<li>\n<p><strong>Share Links</strong>: Share requests via link to send to others, which will take them directly to that request on the relevant page, on the WordPress website.</p>\n</li>\n<li>\n<p><strong>Front-end Login</strong>: Use a custom front-end login pop-up when sharing request links on any page. Once logged in, it will keep you on the page, as opposed to the standard WP login which confusingly takes you to the WP Admin Dashboard screen.</p>\n</li>\n<li>\n<p><strong>Additional Email Notifications</strong>: If you need someone to receive grouped notifications outside of the WP website, you can add as many additional email addresses you need.</p>\n</li>\n<li>\n<p><strong>Request Visibility</strong>: Control default request visibility on the website to hide requests if you ever need to.</p>\n</li>\n<li>\n<p><strong>WP User Role Permissions</strong>: Decide which user roles inside your WP website should have access to using visual collaboration.</p>\n</li>\n<li>\n<p><strong>Default Users</strong>: Assign default main client and main webmaster users for automated related workflows.</p>\n</li>\n</ul>\n<h3>🤷‍♂️🤷‍♀️ Why Should You Use Atarim??</h3>\n<p>One of the biggest problems we face when working on a website is the constant back and forth that occurs from outdated methods of communication when trying to manage projects.</p>\n<p><strong>78% of website teams and digital agencies confirmed that constant back and forth and confusing communication as being the most common roadblock</strong> when trying to get a project to the finish line, or when generally collaborating on website-related work.</p>\n<p>Atarim makes it the easiest it’s ever been to collaborate on a website. Stop using emails and Slack to discuss a website, and start using visual collaboration to make task management a breeze.</p>\n<p>Over the past few years Atarim has served thousands of teams and agencies that are collaborating with hundreds of thousands of collaborators, team members, clients, and stakeholders through our platform.</p>\n<p>We are now excited to offer our solution for free, to help you and your team get the benefits of visual collaboration, and take your project management and task management to the next level.</p>\n<h3>🌍 What Our Users Say:</h3>\n<p>&#8220;This has saved me so much time and confusion, my clients now simply send me feedback and I have all of the information I need to get the work done”</p>\n<p><strong>Sarah Crawford &#8211; A Lined Design</strong></p>\n<p>&#8220;Unbelievably powerful project management tool, along with outstanding service from the support team”</p>\n<p><strong>John Comley</strong></p>\n<p>&#8220;A must-have for any WordPress consultant or designer working with clients.”</p>\n<p><strong>Fanny Veldmeyer &#8211; So Pressed</strong></p>\n<p>&#8220;One of the biggest time saver for me in years. Working with clients is now really simple, fast and intuitive for me.”</p>\n<p><strong>Patrik Čada – Patrik Čada Web Design</strong></p>\n<h3>🙌 Let’s see what you get with the Atarim Plugin</h3>\n<p>OR <a href=\"https://atarim.io/pricing\" rel=\"nofollow ugc\">check out our Premium Plans here</a></p>\n<p><strong>ATARIM VISUAL COLLABORATION PLUGIN</strong></p>\n<ul>\n<li>\n<p><strong>Unlimited Websites</strong><br />\nInstall the plugin on as many WordPress websites as you want, there is no limit.</p>\n</li>\n<li>\n<p><strong>Unlimited Collaborators Within WordPress</strong><br />\nVisual collaboration can be used by everyone who has a WordPress account on a website (subject to which user roles are active).</p>\n</li>\n<li>\n<p><strong>Front-End Visual Collaboration</strong><br />\nCreate post-it note like requests and feedback on the front-end of the live website.</p>\n</li>\n<li>\n<p><strong>Status</strong><br />\nUpdate the status of requests to let your clients and team know when they are complete.</p>\n</li>\n<li>\n<p><strong>Urgency</strong><br />\nSet how urgent a task is to set the priority of a request so critical work gets done first.</p>\n</li>\n<li>\n<p><strong>Auto-screenshot</strong><br />\nA screenshot of the request creator&#8217;s view is generated for every request, making it easy to debug issues.</p>\n</li>\n<li>\n<p><strong>Detailed Info</strong><br />\nSee the browser and screen size of the request creator, enabling you to cut down on back-and-forth with your clients.</p>\n</li>\n<li>\n<p><strong>WordPress Admin Visual Collaboration</strong><br />\nCreate requests on the back-end to teach your clients how to use their website.</p>\n</li>\n<li>\n<p><strong>File Uploads</strong><br />\nUpload files to requests, including images, PDF&#8217;s, zips and more&#8230;</p>\n</li>\n<li>\n<p><strong>1 Click &#8220;Push To Media Folder&#8221;</strong><br />\nMinify and push images straight to the WordPress media library with one click.</p>\n</li>\n<li>\n<p><strong>Grouped Email Notifications&#8221;</strong><br />\nAssign users to requests so they receive grouped notifications about changes, including status/urgency updates, new comments and more.</p>\n</li>\n<li>\n<p><strong>Guest Mode</strong><br />\nNo login or registration needed to use Atarim on the front-end, perfect for staging sites.</p>\n</li>\n<li>\n<p><strong>Task Centre [PREMIUM]</strong><br />\nView and manage all requests from an internal task centre inside the WordPress admin, making project management so much easier.</p>\n</li>\n<li>\n<p><strong>White Label [PREMIUM]</strong><br />\nCustomise the logo, icon and colour of the entire plugin, making it your own.</p>\n</li>\n<li>\n<p><strong>Compact Mode [PREMIUM]</strong><br />\nCreate a more compact experience by replacing the bottom bar with a small widget, making it clearer for everyone involved to use.</p>\n</li>\n<li>\n<p><strong>Approve Pages [PREMIUM]</strong><br />\nApprove pages with the click of a button and have the option to change the status of all requests on that page to complete.</p>\n</li>\n<li>\n<p><strong>Internal Tasks [PREMIUM]</strong><br />\nCreate internal tasks which are hidden from user roles with less permissions, perfect for collaborating with your team on things others don’t need to see.</p>\n</li>\n<li>\n<p><strong>Task Centre [PREMIUM]</strong><br />\nView and manage all requests from an internal task centre inside the WordPress admin.</p>\n</li>\n<li>\n<p><strong>User Permissions [PREMIUM]</strong><br />\nFully customise what each user role can do with the plugin, giving you full control.</p>\n</li>\n<li>\n<p><strong>Automated Reports [PREMIUM]</strong><br />\nSend 24 hour, and 7 day reports containing all requests created and updates to those requests.</p>\n</li>\n<li>\n<p><strong>Edit/Delete Comments[PREMIUM]</strong><br />\nMade a mistake in your comment? Simply edit or delete it!</p>\n</li>\n<li>\n<p><strong>Global Settings [PREMIUM]</strong><br />\nTurning global settings on will apply the settings configured inside your Dashboard, making it super quick and easy to setup your projects.</p>\n</li>\n<li>\n<p><strong>Remove Mention Atarim [PREMIUM]</strong><br />\nCompletely remove the mention of Atarim inside the plugin, making it your own (especially combined with white labelling).</p>\n</li>\n</ul>\n<p><strong>ATARIM DASHBOARD</strong></p>\n<ul>\n<li>\n<p><strong>Unlimited Websites</strong><br />\nActive assets within your Atarim Dashboard, you can add/archive assets freely. Archived sites are not counted.</p>\n</li>\n<li>\n<p><strong>Visual Collaboration on ANY Website</strong><br />\nAdd &#8220;Stickers&#8221; to annotate any website visually. From WordPress, to cloud applications like Shopify or WebFlow, and even custom builds.</p>\n</li>\n<li>\n<p><strong>Image-Based Collaboration</strong><br />\nMake it easy to work together with your clients and team by visually collaborating on that beautiful new mockup you made, or a new logo!</p>\n</li>\n<li>\n<p><strong>Email-Based Support Desk</strong><br />\nSend and receive emails that will automatically filter incoming clients requests into their respective websites.</p>\n</li>\n<li>\n<p><strong>Productivity KPIs</strong><br />\nUnlock your profits by becoming a data-driven agency &#8211; Seeing statistics, benchmarks, and KPIs.</p>\n</li>\n<li>\n<p><strong>Kanban Boards</strong><br />\nDrag &amp; drop boards where requests become to-do lists for your team, creating an amazing workflow for project and task management.</p>\n</li>\n<li>\n<p><strong>Image Optimisations</strong><br />\nEvery image uploaded is automatically optimised for web, no need for TinyPNG, Imagify, ShortPixel, Optimole or WP Smush!</p>\n</li>\n<li>\n<p><strong>Track Time [PREMIUM]</strong><br />\nAdd estimations on how long a request will take to complete and create timers, giving you accurate data on how long things are taking to complete.</p>\n</li>\n<li>\n<p><strong>Export Time Reports [PREMIUM]</strong><br />\nExport white labelled reports that contain all time that has been tracked.</p>\n</li>\n<li>\n<p><strong>Team Management [PREMIUM]</strong><br />\nSee all activity that has been done by your entire team, giving you a full overview of all work done inside the Dashboard.</p>\n</li>\n<li>\n<p><strong>Basic Integrations [PREMIUM]</strong><br />\nGet access to webhooks and an API key to integrate Atarim with platforms like Zapier, Integromat and Pabbly.</p>\n</li>\n<li>\n<p><strong>Deep Integrations [PREMIUM]</strong><br />\nFully integrate with platforms like Slack, MainWP, Rocket.net and more. To embed Atarim into your workflow even further.</p>\n</li>\n</ul>\n<h3>👩‍💻 Atarim Integrations Available:</h3>\n<ul>\n<li>\n<p><strong>Zapier, Pabbly and Integromat</strong>: Connect Atarim to 5000+ apps. Create triggers from visual collaboration like request creation and status changes and push them to apps like ClickUp and Trello</p>\n</li>\n<li>\n<p><strong>ClickUp</strong>: Automatically push all requests created to a specific task list inside ClickUp and deploy full task lists from ClickUp into a website inside Atarim.</p>\n</li>\n<li>\n<p><strong>Slack</strong>: Connect Atarim to a Slack bot to automatically post new requests, request changes and more to a specific Slack channel.</p>\n</li>\n<li>\n<p><strong>Bertha.ai</strong>: With both plugins installed, you can use Bertha to generate copy directly into task pop-overs, making create amazing content for your sites easy!</p>\n</li>\n<li>\n<p><strong>Asana</strong>: Automatically push all requests created to a specific project inside Asana, and pull in full task lists from Asana to a website inside your Atarim Dashboard.</p>\n</li>\n<li>\n<p><strong>Jira</strong>: Automatically push all requests created to a specific list inside Jira, and pull in full task lists from Asana to a website inside your Atarim Dashboard.</p>\n</li>\n<li>\n<p><strong>MainWP</strong>: Add websites from your MainWP Dashboard to Atarim with one click, manage all requests from your MainWP Dashboard created inside Atarim and get an overview of a website’s health inside your Atarim Dashboard.</p>\n</li>\n<li>\n<p><strong>Rocket</strong>: Create Rocket staging websites and automatically install the Visual Collaboration plugin inside your Atarim Dashboard, and manage the Rocket hosting settings of your websites from your Atarim Dashboard.</p>\n</li>\n<li>\n<p><strong>Trello</strong>: Automatically add requests created on your WordPress websites to a board inside Trello, ensuring that nothing is ever missed when using both platforms.</p>\n</li>\n<li>\n<p><strong>Basecamp</strong>: Automatically add requests created on your WordPress websites to your Basecamp Task Lists, keeping all of your work synchronized.</p>\n</li>\n<li>\n<p><strong>Webhooks</strong>: Create your own integrations with any app you want by using webhooks for pushing new requests, status/urgency changes and more…</p>\n</li>\n</ul>\n<h3>📆 Atarim Integrations Coming Soon:</h3>\n<ul>\n<li><strong>TeamWork</strong></li>\n<li><strong>Zendesk</strong></li>\n<li><strong>Figma</strong></li>\n<li><strong>Adobe XD</strong></li>\n<li><strong>RunCloud</strong></li>\n<li><strong>Monday</strong></li>\n<li><strong>Notion</strong></li>\n<li><strong>Airtable</strong></li>\n</ul>\n<p><em>(You can already integrate with all these via Zapier, but we are working on developing deeper integrations, which we&#8217;ll start launching in 2023. Stay tuned to hear when they go live!)</em></p>\n<h3>🔥 Atarim works with all the major page builders, SEO, Ecom and LMS plugins on the market:</h3>\n<ul>\n<li><strong>WordPress Blocks Editor (Gutenberg)</strong></li>\n<li><strong>Divi Theme</strong></li>\n<li><strong>Elementor</strong></li>\n<li><strong>Visual Composer</strong></li>\n<li><strong>Beaver Builder</strong></li>\n<li><strong>Oxygen Builder</strong></li>\n<li><strong>Thrive Architect</strong><br />\nand more&#8230;</li>\n</ul>\n<h3>🚀 Learn how to use Atarim</h3>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/AS9p-mHoAuM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent&#038;listType=playlist&#038;list=PLFonzSqznz8en-x_MEnuLsnnh0gdg1qrs\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span><br />\n<strong><a href=\"https://www.youtube.com/c/Atarim-io\" rel=\"nofollow ugc\">Check out our YouTube channel for full capabilities </a></strong></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.4.0.4.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/atarim-visual-collaboration/assets/screenshot-1.png?rev=2790791",
            "caption": "<strong>Comment Mode</strong>: Enable the comment mode on the front end of the website to highlight a section of the page and leave a request."
        },
        {
            "src": "https://ps.w.org/atarim-visual-collaboration/assets/screenshot-2.png?rev=2790791",
            "caption": "<strong>Creating Requests</strong>: Add your first comment and create the request in the section."
        },
        {
            "src": "https://ps.w.org/atarim-visual-collaboration/assets/screenshot-3.png?rev=2790791",
            "caption": "<strong>Task Pop-Over</strong>: You can assign users, change status/urgency, or take a screenshot when creating a request."
        },
        {
            "src": "https://ps.w.org/atarim-visual-collaboration/assets/screenshot-4.png?rev=2790791",
            "caption": "<strong>The Atarim Sidebar</strong>: All requests can be found inside the sidebar, by clicking a request it will scroll to where it is and open it."
        },
        {
            "src": "https://ps.w.org/atarim-visual-collaboration/assets/screenshot-5.png?rev=2790791",
            "caption": "<strong>Back-end Requests</strong>: Create requests on the WordPress Dashboard, perfect for collaborating with your team or showing your client something."
        },
        {
            "src": "https://ps.w.org/atarim-visual-collaboration/assets/screenshot-6.png?rev=2790791",
            "caption": "<strong>Atarim Dashboard</strong>: Manage all requests across all of your websites from one platform."
        },
        {
            "src": "https://ps.w.org/atarim-visual-collaboration/assets/screenshot-7.png?rev=2790791",
            "caption": "<strong>Auto-login</strong>: Automatically get logged into your WordPress websites and get taken straight to a request with the click of a button."
        }
    ],
    "tags": {
        "bug-tracking": "bug-tracking",
        "collaboration": "collaboration",
        "feedback": "feedback",
        "project-management": "project management",
        "website-feedback": "website feedback"
    },
    "stable_tag": "4.0.4",
    "versions": {
        "3.10": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.10.zip",
        "3.11": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.11.zip",
        "3.12": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.12.zip",
        "3.13": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.13.zip",
        "3.14": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.14.zip",
        "3.15": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.15.zip",
        "3.16": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.16.zip",
        "3.17": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.17.zip",
        "3.18": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.18.zip",
        "3.19": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.19.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.2.1.zip",
        "3.22": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.22.zip",
        "3.22.1": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.22.1.zip",
        "3.22.2": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.22.2.zip",
        "3.22.3": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.22.3.zip",
        "3.22.4": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.22.4.zip",
        "3.22.5": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.22.5.zip",
        "3.22.6": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.22.6.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.3.0.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.3.1.zip",
        "3.3.2": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.3.2.zip",
        "3.3.2.1": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.3.2.1.zip",
        "3.3.2.2": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.3.2.2.zip",
        "3.3.3": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.3.3.zip",
        "3.30": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.30.zip",
        "3.31": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.31.zip",
        "3.32": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.32.zip",
        "3.4": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.4.zip",
        "3.4.1": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.4.1.zip",
        "3.4.3": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.4.3.zip",
        "3.4.4": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.4.4.zip",
        "3.5": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.5.zip",
        "3.5.1": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.5.1.zip",
        "3.6": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.6.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.6.1.zip",
        "3.7": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.7.zip",
        "3.8": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.8.zip",
        "3.9": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.9.zip",
        "3.9.1": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.9.1.zip",
        "3.9.2": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.9.2.zip",
        "3.9.3": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.9.3.zip",
        "3.9.4": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.9.4.zip",
        "3.9.6": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.9.6.zip",
        "3.9.6.1": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.3.9.6.1.zip",
        "4.0": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.4.0.zip",
        "4.0.1": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.4.0.1.zip",
        "4.0.2": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.4.0.2.zip",
        "4.0.3": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.4.0.3.zip",
        "4.0.4": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.4.0.4.zip",
        "trunk": "https://downloads.wordpress.org/plugin/atarim-visual-collaboration.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/atarim-visual-collaboration/assets/banner-772x250.png?rev=3047608",
        "high": "https://ps.w.org/atarim-visual-collaboration/assets/banner-1544x500.png?rev=3034947"
    },
    "icons": {
        "1x": "https://ps.w.org/atarim-visual-collaboration/assets/icon-256x256.gif?rev=2826031",
        "2x": "https://ps.w.org/atarim-visual-collaboration/assets/icon-256x256.gif?rev=2826031"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}