{
    "name": "Autoship Cloud for WooCommerce Subscription Products",
    "slug": "autoship-cloud",
    "version": "2.6.6",
    "author": "<a href=\"https://qpilot.cloud\">Patterns In the Cloud LLC</a>",
    "author_profile": "https://profiles.wordpress.org/patternsinthecloud/",
    "contributors": {
        "patternsinthecloud": {
            "profile": "https://profiles.wordpress.org/patternsinthecloud/",
            "avatar": "https://secure.gravatar.com/avatar/d94669e1adff296ca15942c1f32a997c?s=96&d=monsterid&r=g",
            "display_name": "patternsinthecloud"
        },
        "crispdesign": {
            "profile": "https://profiles.wordpress.org/crispdesign/",
            "avatar": "https://secure.gravatar.com/avatar/87da3204d29c004d289c039e2c55c1d8?s=96&d=monsterid&r=g",
            "display_name": "Crisp Design Co"
        }
    },
    "requires": "4.6",
    "tested": "6.6.1",
    "requires_php": "7.3",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 90,
    "ratings": {
        "5": 25,
        "4": 1,
        "3": 0,
        "2": 1,
        "1": 3
    },
    "num_ratings": 30,
    "support_url": "https://wordpress.org/support/plugin/autoship-cloud/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 400,
    "downloaded": 31700,
    "last_updated": "2024-08-27 15:17:00",
    "added": "2018-01-08",
    "homepage": "https://autoship.cloud",
    "sections": {
        "description": "<p><strong>Upgrade your subscribe and save, product subscriptions, and repeat deliveries with Autoship Cloud for WooCommerce Subscription products</strong> &#8211; a flexible and scalable program that customers love! The <a href=\"https://autoship.cloud\" rel=\"nofollow ugc\"><strong>Autoship Cloud plugin</strong></a> powered by QPilot is <strong>free to connect and test.</strong></p>\n<p>This is a <strong>single plugin</strong> that allows you to enable any of your WooCommerce products for subscriptions, subscribe and save, repeat ordering, and delivery. Once enabled, the &#8220;Autoship and Save&#8221; or &#8220;Subscribe and Save&#8221; <strong>automatically appears on your products and variations</strong>, and can also be displayed in your cart!</p>\n<p>WooCommerce subscriptions are quick to launch, so you can start offering your customers an <strong>incredibly flexible subscription portal</strong> where they can manage their upcoming repeat deliveries in My Account.</p>\n<p>Seamlessly supports recurring payments with over 10+ popular payment gateways including <a href=\"http://authorize.net/\" rel=\"nofollow ugc\">Authorize.net</a>, Stripe, Braintree, PayPal and more!</p>\n<p>Automate your business with <strong><a href=\"https://support.autoship.cloud/category/451-notifications\" rel=\"nofollow ugc\">notifications</a></strong> (powered by SendGrid), repeat order processing, and shipping rules with carrier integrations. Autoship Cloud automatically syncs with your inventory to make things easy.</p>\n<p>Offer dynamic coupons on recurring orders, automate shipping, sync inventory &amp; stock status, upsell products into orders, and keep on top of everything with our incredible reporting and forecasting suite.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ncPrmTAI3pI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Have a question about how you can operate your subscribe and save program at scale with Autoship Cloud? <a href=\"https://autoship.cloud/contact-us/\" rel=\"nofollow ugc\"><strong>Ask us here.</strong></a></p>\n<h3><strong>Live Demo Stores</strong></h3>\n<ul>\n<li><a href=\"https://beautyloop.wpengine.com/\" rel=\"nofollow ugc\">&#8220;Subscribe and Save&#8221; Demo Store</a>: see how quickly you can add subscription options to your existing products)</li>\n<li><a href=\"https://weeklyfresh.co/\" rel=\"nofollow ugc\">&#8220;Meal Delivery&#8221; Demo Store</a>: see how Meal and Food Delivery sites can customize WooCommerce and the Autoship Cloud plugin to craft the best customer experience.  Includes a <a href=\"https://autoship.cloud/tutorials/meal-subscription-boxes-customer-journey/\" rel=\"nofollow ugc\">full tutorial</a> &#8211; with code examples for developers &#8211; for <a href=\"https://autoship.cloud/tutorials/meal-subscription-boxes-customer-journey/\" rel=\"nofollow ugc\">how we designed and developed this store here</a>.</li>\n<li><a href=\"https://traderjoeys.com/\" rel=\"nofollow ugc\">&#8220;Autoship&#8221; B2B Demo Store</a>: see how Autoship Cloud makes it easy to automate repeat ordering by offering Autoship for raw materials &amp; food supplies</li>\n</ul>\n<h3><strong>★★★★★ 5 Star Support for Merchants and Developers</strong></h3>\n<p>Launch &amp; scale with confidence!  All of our 5 star plugin reviews mention our excellent support.</p>\n<ul>\n<li>Fully documented Install &amp; Launch Guide</li>\n<li>Detailed Documentation for Features, FAQ&#8217;s and Plugin Code</li>\n<li>Fast and Responsive Online Support</li>\n<li>Backed by a team of experts in WooCommerce, Autoship, Advanced Integrations and Business Automation!</li>\n</ul>\n<h3>Fully Documented Help Guides for Merchants and Plugin Code Docs for Developers</h3>\n<p>See the full <a href=\"https://support.autoship.cloud\" rel=\"nofollow ugc\">documentation and support site for the Autoship Cloud plugin here.</a></p>\n<ul>\n<li>Tested with the latest versions of WooCommerce &#8211; see our plugin changelog (<a href=\"https://wordpress.org/plugins/autoship-cloud/#developers\" rel=\"ugc\">https://wordpress.org/plugins/autoship-cloud/#developers</a>)</li>\n<li>Fully illustrated Install &amp; Launch Guide</li>\n<li>Plugin documentation for templates, filters actions and hooks (<a href=\"https://support.autoship.cloud/collection/598-developers\" rel=\"nofollow ugc\">https://support.autoship.cloud/collection/598-developers</a>)</li>\n<li>API and Webhook documentation for QPilot, the hosted service that powers the Autoship Cloud plugin (<a href=\"https://docs.qpilot.cloud/reference/introduction\" rel=\"nofollow ugc\">https://docs.qpilot.cloud/reference/introduction</a>)</li>\n</ul>\n<h3><strong>Customer Reviews with Examples</strong></h3>\n<p>&#8220;QPilot has been extremely helpful &amp; supportive throughout the various stages of support.&#8221;</p>\n<ul>\n<li><a href=\"https://iheartdogs.com/\" rel=\"nofollow ugc\">iHeartDogs</a></li>\n</ul>\n<p>&#8220;They are there for you, don’t matter how small or large your issue is. They are attentive, effective and will follow up with you. And they do provide customizations! We couldn’t be happier! Highly recommended!&#8221; &#8211; <a href=\"https://bluemoonhemp.com/\" rel=\"nofollow ugc\">BlueMoonHemp</a></p>\n<p>&#8220;Autoship Cloud and the Qpilot team provide an amazing plugin with some of the best support I have ever received. They have developers in the USA that write amazing, fast, and clean code and they will continue to support your custom modifications after its been paid for. These guys are top notch, you will not regret this plugin.&#8221; &#8211; <a href=\"https://www.algaebarn.com/\" rel=\"nofollow ugc\">AlgaeBarn</a></p>\n<p>This is how <a href=\"https://nuleafnaturals.com\" rel=\"nofollow ugc\">Nuleaf Naturals</a> used the Autoship Cloud plugin powered by QPilot to add 2,000 repeat orders in their first 2 months:</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/WgkPWbWiBT4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3><strong>Customer Subscription Portal that is Easy and Flexible</strong></h3>\n<p>&#8220;It’s easy for customers to choose autoship options at checkout and manage their autoship shipments (including adding and removing products).&#8221; &#8211; <a href=\"https://www.mintunmedia.com/\" rel=\"nofollow ugc\">Mintun Media</a></p>\n<p>Your customers can quickly view &amp; manage upcoming Autoship orders in My Account.  Managing upcoming repeat orders is easy, intuitive, and beautifully branded to match the shopping experience of your online store.</p>\n<p>You control which products your customers can add to their repeat orders. Automatically disable out of stock products, allow backorders, or simply select which products should not be allowed to be added to repeat orders.</p>\n<p>Display upcoming orders using WordPress Templates (which can be further styled and customized), or use one of our embedded display portals that we host for you!</p>\n<ul>\n<li>Change products &amp; future order dates/frequencies</li>\n<li>Change shipping &amp; delivery locations</li>\n<li>Update saved payment methods</li>\n<li>Customers can pause or cancel orders</li>\n<li>Customers can easily see and fix failed scheduled orders (like a payment failure)</li>\n</ul>\n<p>See our documentation on <strong><a href=\"https://support.autoship.cloud/article/461-how-customers-manage-scheduled-orders\" rel=\"nofollow ugc\">How Customers Manage Scheduled Orders</a></strong>.</p>\n<h3>Quickly Launch Subscribe and Save and Repeat Deliveries</h3>\n<p>Autoship syncs with your existing WooCommerce product inventory, so all you have to do is choose what products you want to turn on for Autoship. No additional plugins or setup needed to launch product subscriptions and repeat delivery options</p>\n<ul>\n<li>Enable only specific products and variations</li>\n<li>Bulk enable all products &amp; variants globally</li>\n<li>Option to offer pricing discounts at checkout, recurring orders, or both</li>\n<li>Sync product prices in real-time and optionally update product prices for existing Scheduled Orders and product subscriptions</li>\n</ul>\n<p>See how easy this is to do with our <a href=\"https://support.autoship.cloud/article/448-7-enabling-products-for-autoship\" rel=\"nofollow ugc\"><strong>Install and Launch Guide</strong></a></p>\n</p>\n<p>Once a product is enabled for Autoship, you will see options on the product page for your customers to select &#8220;Autoship&#8221; (or another label you choose) and pick their repeat order frequency.</p>\n<p>You can also choose to display the same options in your Cart as an &#8220;upsell&#8221; option before customers checkout. Use our preset templates that match your theme&#8217;s styling, or customize it for the buying experience you want!</p>\n<p><strong>Autoship in the Cart:</strong></p>\n</p>\n<h3><strong>Customer Email Notifications <a href=\"https://sendgrid.com/\" rel=\"nofollow ugc\">powered by SendGrid®</a></strong></h3>\n<p>Send customers detailed email notifications about their repeat orders and subscription products.  Easily customize to your brand using our free template customizer and excellent deliverability rates thanks to our built-in integration with SendGrid® &#8211; included free with your subscription to Autoship Cloud&#8217;s hosted service, QPilot.</p>\n</p>\n<ul>\n<li><strong>Advanced Notices for Upcoming Orders:</strong> Send customers email notifications about upcoming order (Option to add 10-Day, 2-day, 1-day and Custom Day advance email notifications.)</li>\n<li><strong>Failed Orders and Payments:</strong> Let customers know about issues with payments, products or shipments so they can self-service their repeat orders.  Our customer email notifications even include steps in each message to help customers solve their own issues!</li>\n<li>&#8216;<strong>Changeable Before&#8217; Order Notices:</strong> Let customers know how many days they have to make changes to upcoming orders.  This feature is for site&#8217;s using the advanced order processing option for &#8220;Lock Duration&#8221;.</li>\n<li><strong>Option to BCC your support team on Customer Emails:</strong> want to keep track of customer email messages yourself?  Enter a BCC email to include your support team&#8217;s email with each notification!</li>\n</ul>\n<h3>Automate Payments seamlessly with WooCommerce</h3>\n<p>Connect the same payment gateways that you use for WooCommerce Checkout to offer Autoship Customers a seamless payment experience.</p>\n<p>Autoship Customers can save payment methods to pay for future orders at checkout automatically as well as add new payment methods saved in My Account whenever they need to update their upcoming Autoship Scheduled Orders.</p>\n<ul>\n<li>Over 10+ Popular Payment Gateways Supported (Stripe, Authorize.Net, CIM, Square, PayPal Express Checkout, Braintree, and NMI)</li>\n<li>Automated Customer Email Notifications</li>\n<li>Deep knowledgebase of support articles to help customers and merchants solve payment issues</li>\n<li>Manual Payment Method Entry Supported</li>\n</ul>\n<p>See our documentation on the <a href=\"https://support.autoship.cloud/article/334-payment-integrations\" rel=\"nofollow ugc\"><strong>Payment Integrations</strong></a> we support and how we manage them.</p>\n<h3>Automated Shipping and Delivery for the Best Customer Experience</h3>\n<p>Automate shipping &amp; delivery for Autoship Customers!   With Autoship Cloud, customers always receive the best shipping rate for their shipping address or delivery location automatically.  If an Autoship Customer&#8217;s repeat order is changed, their shipping rate is automatically recalculated and applied for them.</p>\n<ul>\n<li>Flat Rates, Table Rates, and carrier integrations</li>\n<li>Shipping zones and multi-postcode support</li>\n<li>Product shipping classes</li>\n<li>New! Use ShipperHQ to integrate over 50+ global carriers</li>\n<li>Merchant can update available shipping method at any time</li>\n<li>Any order or address changes recalculate shipping every time</li>\n</ul>\n<p>Please visit our documentation for more information on <a href=\"https://docs.qpilot.cloud/docs/shipping-rates\" rel=\"nofollow ugc\"><strong>How Shipping Rates Work</strong></a>.</p>\n<h3>Zapier Integration &amp; Webhooks</h3>\n<ul>\n<li>Zapier Integration &#8211; <a href=\"https://autoship.cloud/news/automate-your-win-back-campaigns-using-klaviyo-and-qpilots-zapier-app/\" rel=\"nofollow ugc\">see how to power amazing email campaigns</a> in Klaviyo using Autoship Cloud + Zapier.</li>\n<li>Extend Automations and Integrations using the QPilot API and over 12 Webhook Triggers\n<ul>\n<li><a href=\"https://docs.QPilot.cloud\" rel=\"nofollow ugc\">API</a></li>\n<li><a href=\"https://docs.qpilot.cloud/reference/annex-d-working-with-webhooks\" rel=\"nofollow ugc\">Webhooks</a>\n<ul>\n<li>For example: fire Webhook whenever a Scheduled Order is Created, or when an item on a Scheduled Order is updated</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h3>How Autoship Processes Repeat Orders: Advanced Automation</h3>\n<p>The Autoship Cloud plugin&#8217;s hosted service, QPilot, processes orders using your site&#8217;s the WooCommerce REST API (link to WC REST API). This enables repeat order processing to take place in the cloud so that your site doesn&#8217;t get bogged down running tons of code and cron jobs just to process repeat orders. It&#8217;s also a really nice backup just in case your site has any issues &#8211; your repeat orders are still hosted &amp; protected in the cloud!</p>\n<p>When a repeat order is due to process, the order shows up in your WooCommerce Orders just like an order that came through the checkout &#8211; process, fulfill and track repeat orders just as you normally do.</p>\n<ul>\n<li>Notify customers (n) days before their order processes</li>\n<li>Only a few functions on the checkout page to keep your site load speed fast!</li>\n<li>Set time of day to process repeat orders daily</li>\n<li>Start processing orders in advance of their next occurrence date.  Great for business that need a day or two to fulfill and ship orders.</li>\n<li>Set a custom &#8220;changeable before&#8221; option for your site to prevent changes to upcoming orders X days before they ship.  Includes a feature to send a custom email notification to let your customers know how much time they have to make changes!</li>\n<li>Orders processed via the <a href=\"https://docs.woocommerce.com/document/woocommerce-rest-api/\" rel=\"nofollow ugc\">WooCommerce REST API</a> means that your site can easily scale to process many repeat orders without stressing your WordPress site or hosting!  No more headaches with the WordPress Cron or Action Schedulers dragging your site performance.</li>\n</ul>\n<p>It&#8217;s easy to view and track checkout orders that originate Autoship and Product Subscriptions as well as orders created (via the WooCommerce REST API) from processing repeat Scheduled Orders. See an explanation of that in-depth on our documentation: <a href=\"https://support.autoship.cloud/article/463-how-scheduled-orders-are-linked-to-woocommerce-orders\" rel=\"nofollow ugc\"><strong>How Scheduled Orders are Linked to WooCommerce Orders</strong></a>.</p>\n<p>For detailed and technical information on how Autoship Cloud&#8217;s hosted service, QPilot, processes orders with WooCommerce, please see our full documentation here: <a href=\"https://support.autoship.cloud/article/535-how-an-autoship-scheduled-order-is-processed\" rel=\"nofollow ugc\"><strong>How an Autoship Scheduled Order is Processed</strong></a>.</p>\n<h3>Customizable Order Scheduling &amp; Repeat Frequency Options</h3>\n<p>Craft the subscriber experience you want for repeat orders and deliveries with standard or customized order dates and frequency options. Control what customers see at checkout or what is available to be changed through the customer portal.</p>\n<p>Customer can change their upcoming order dates or frequency to get products delivered on their schedule. Lower your subscription order churn by letting customers use the frequencies that best match their need.</p>\n<p>With Autoship Cloud, your customers have complete control &amp; flexibility within the rules that you set for repeat ordering dates &amp; frequencies.</p>\n<ul>\n<li>Customer can update at any time</li>\n<li>Daily, weekly, or monthly options</li>\n<li>Customize the frequencies you offer</li>\n<li>Limit options or leave them wide open</li>\n<li>Options by specific products, category, or storewide</li>\n</ul>\n<h3>Product &amp; Inventory Sync</h3>\n<p>Autoship Cloud automatically syncs with your WooCommerce product data, stock status &amp; inventory so that you can offer Autoship options and product subscriptions for the products you already sell.</p>\n<p>Product data is synchronized with your WooCommerce store in real-time, so you have full control over which products are available to Autoship Customers on your product pages and on future scheduled orders.</p>\n<ul>\n<li>Real-Time sync for stock status and Inventory Count</li>\n<li>Out-of-stock products automatically excluded from repeat order processing</li>\n<li>Allow Backorders? We support that too!</li>\n<li>Enable specific products or variations for Autoship and exclude others</li>\n</ul>\n<h3>Coupons for Repeat Customers and Ordering</h3>\n<p>Incentivize the buying behavior you want with coupons created by Autoship Cloud. Increase conversions, average order value, and reward repeat customers in the ways that match your business needs.</p>\n<p>Whether you want to win a new customer or reward your best ones, Autoship Cloud makes coupons flexible and easy.</p>\n<p>See all of the ways <a href=\"https://docs.qpilot.cloud/docs/coupon-reference-guide\" rel=\"nofollow ugc\"><strong>coupons can be configured</strong></a> with Autoship Cloud.</p>\n<ul>\n<li>Apply to subtotal, shipping, or individual products</li>\n<li>Discounts can be one-time or repeat, and limited by use</li>\n<li>Give flat amount or percentage coupons</li>\n<li>Set minimums on item count, price, or weight</li>\n<li>Coupons created in Autoship only apply to Autoship items</li>\n</ul>\n<h3>Marketing Tools to Upsell &amp; Retain Repeat Customers</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/wWRrU_-J3Kc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;start=5&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Increase the value of repeat customers with Autoship&#8217;s upsell capabilities. A no-code solution that lets you create a link to any product in your store. When customers click that link, that product is added to their upcoming scheduled order.</p>\n<p>Send the link via email, text, or chat. Make it one-click easy to upsell your existing customers.</p>\n<ul>\n<li>Offer single-use or subscription items</li>\n<li>Increase average order size with a single click</li>\n<li>Gift loyal customers one-time products</li>\n<li>Reduce friction on upsells for repeat customers: Add products subscriptions right to the cart with frequencies already applied</li>\n<li>Add products on repeat to existing subscription orders</li>\n<li>And more&#8230; get creative with how you upsell to your Autoship Customers!</li>\n</ul>\n<h3>Reports &amp; Forecasting So You Can Plan for Repeat Customers</h3>\n<p>Growing repeat revenue and managing customer relationships requires effective reporting. Autoship Cloud makes it possible to see the following:</p>\n<ul>\n<li>Inventory Forecasting &#8211; see what items are upcoming on scheduled orders</li>\n<li>See which products have high Total Scheduled quantities that are Active versus products with high Total Scheduled quantities that are paused or failed</li>\n<li>Customer metrics like LTV, when an order was first created, order count, and more!</li>\n<li>Event logs to see when scheduled orders are changed and by whom</li>\n<li>Total revenue dashboard</li>\n</ul>\n<p><strong>See all the <a href=\"https://docs.qpilot.cloud/docs/introduction-to-reports\" rel=\"nofollow ugc\">reports and information</a> available on Autoship Cloud.</strong></p>\n",
        "faq": "\n<dt id='what%20plugins%20does%20autoship%20cloud%20replace%3F'>\nWhat plugins does Autoship Cloud replace?\n</h4>\n<p>\n<p>The Autoship Cloud plugin replaces:</p>\n<ul>\n<li>WooCommerce Subscriptions</li>\n<li>All Products for WooCommerce Subscriptions</li>\n<li>WooCommerce Product Bundles</li>\n</ul>\n</p>\n<dt id='what%20is%20the%20difference%20between%20autoship%20and%20qpilot%3F'>\nWhat is the difference between Autoship and QPilot?\n</h4>\n<p>\n<p>QPilot is a service provider designed for scheduled commerce. It is the engine powering the Autoship Cloud plugin. See more information at <a href=\"https://qpilot.cloud/\" rel=\"nofollow ugc\">QPilot.cloud</a> Both are created and managed by the same company.</p>\n</p>\n<dt id='what%20payment%20integrations%20do%20you%20support%3F'>\nWhat payment integrations do you support?\n</h4>\n<p>\n<p>Stripe, <a href=\"http://authorize.net/\" rel=\"nofollow ugc\">Authorize.Net</a> CIM, PayPal Express Checkout, Braintree, and NMI are pre-configured to work with Autoship Cloud, but do need to be setup and tested. We support many more. If you don&#8217;t see yours listed, please contact us: customers@qpilot.cloud.</p>\n<p>See our docs for more information about <a href=\"https://support.autoship.cloud/article/334-payment-integrations#payments\" rel=\"nofollow ugc\">payment integrations.</a></p>\n</p>\n<dt id='what%20shipping%20integrations%20do%20you%20support%3F'>\nWhat shipping integrations do you support?\n</h4>\n<p>\n<p>We currently integrate with the United States Postal Service directly. We support flat rate, table rate, and shipping rules as well. You can also access 30+ carrier integrations via our partner ShipperHQ.</p>\n</p>\n<dt id='do%20you%20work%20with%20zapier%3F'>\nDo you work with Zapier?\n</h4>\n<p>\n<p>Yes! Autoship Cloud integrates with Zapier for custom triggers around important subscription events.</p>\n</p>\n<dt id='can%20i%20migrate%20from%20my%20current%20subscription%20software%3F'>\nCan I migrate from my current subscription software?\n</h4>\n<p>\n<p>Yes! Most migrations can easily be managed using a CSV upload. Our support team is very experienced at doing this and we are happy to help get it done for you.</p>\n<p>launch product subscriptions and repeat delivery options!</p>\n<p>Offer dynamic coupons on recurring orders, automate shipping, sync inventory &amp; stock status.</p>\n</p>\n\n",
        "changelog": "<h4>2.6.6 &#8211;  2024-08-27</h4>\n<ul>\n<li>Improved: Credit Cards saved as payment methods by the <a href=\"https://woocommerce.com/products/woocommerce-paypal-payments/\" rel=\"nofollow ugc\">WooCommerce PayPal Payments plugin</a> now display a description of the Credit Card to customers in the format [Brand] ending in [Last Four Digts] (expires MM/YY).  For example: <em>Visa ending in 4321 (expires 12/29)</em>.</li>\n<li>Fixed: Critical error that would occur when the <a href=\"https://wordpress.org/plugins/woocommerce-payments/\" rel=\"ugc\">WooPayments plugin</a> was active.</li>\n</ul>\n<h4>2.6.5 &#8211;  2024-08-22</h4>\n<ul>\n<li><strong>New!</strong> Support for the plugin <a href=\"https://woocommerce.com/products/woocommerce-paypal-payments/\" rel=\"nofollow ugc\">WooCommerce PayPal Payments by Woo</a> is now available.  This integration features support for Vaulting PayPal Standard Accounts and Debit and Credit Card processing, integrated Order Item Details when Scheduled Orders are processed via PayPal, and support for customers adding new saved payment methods in My Account &gt; Payment Methods.\n<ul>\n<li>Merchants using the PayPal Checkout plugin should refer to our documentation and follow the steps for <a href=\"https://support.autoship.cloud/article/1114-woocommerce-paypal-payments\" rel=\"nofollow ugc\">How to Transition to PayPal Payments from PayPal Checkout</a>.  </li>\n</ul>\n</li>\n<li><strong>New!</strong> Retain &amp; Grow features including surveys &amp; offers that can be automatically triggered when subscribers select to &#8220;Cancel&#8221; or &#8220;Pause&#8221; their Scheduled Order are now available.</li>\n<li>Improved: The WordPress Admin menu for Autoship Cloud in <em>WP-Admin &gt; Autoship Cloud</em> has been organized to provide a better admin experience and includes access to new reports available in <em>WP-Admin &gt; Autoship Cloud &gt; Reports</em></li>\n<li>Improved: Developers can now filter the URL for scripts used by the v2 Portal\n<ul>\n<li>Functions updated:</li>\n<li><strong>autoship_enqueue_scripts</strong> &#8211; Uses function to get URL instead of hardcoded value</li>\n<li>Functions created:</li>\n<li><strong>autoship_get_v2_portal_scripts_url</strong> &#8211; Function that returns URL for V2 scripts</li>\n</ul>\n</li>\n</ul>\n<h4>2.6.4 &#8211;  2024-07-03</h4>\n<ul>\n<li>\n<p>Improved: The URL for the WooCommerce Store&#8217;s Payment Methods page in My Account ( <em>My Account &gt; Payment Methods</em> ) is now dynamically updated in its Connected QPilot Site&#8217;s Properties.  This improves the ability for customer notifications and subscriber portals to send customers to the correct page when directing them to update their payment method.</p>\n</li>\n<li>\n<p>Functions updated:</p>\n<ul>\n<li><strong>autoship_enqueue_scripts</strong> &#8211; Gets the URL instead of a hardcoded value</li>\n</ul>\n</li>\n</ul>\n<h4>2.6.3 &#8211;  2024-06-20</h4>\n<ul>\n<li><strong>New! v2 Subscriber Portal:</strong> The v2 Portal is a new option for displaying Scheduled Orders to customers in <em>My Account &gt; Scheduled Orders</em> and offers the most flexible subscriber experience of Autoship ever.  The v2 Portal is an application that is securely embedded in the <em>My Account &gt; Scheduled Orders</em> page without the use of an iFrame, and its display and style can be completely customized within your connected <a href=\"https://docs.qpilot.cloud/docs/v2-subscriber-portal\" rel=\"nofollow ugc\">QPilot Site&#8217;s settings</a>.  To display the v2 Portal in your WooCommerce store, navigate within your WordPress Admin to <em>WP-Admin &gt; Autoship Cloud &gt; Settings &gt;&gt; Options (tab)</em> and then scroll to &#8220;Displaying Scheduled Orders in My Account&#8221;.</li>\n</ul>\n<h4>2.6.2 &#8211;  2024-06-10</h4>\n<ul>\n<li><strong>New! Product Upsell Carousel:</strong> Sites using the Native UI to display Scheduled Orders to customers in <em>My Account &gt; Scheduled Orders</em> can now enable a new template that displays one or more Upsell Products within a Carousel that are linked to items already included in each Scheduled Order.  This new option called the &#8220;Product Upsell Carousel&#8221; can be enabled in the WordPress Admin ( <em>WP-Admin &gt; Autoship Cloud &gt;&gt; Settings &gt;&gt; Options (tab)</em> ) and will populate with any Products that are linked in WooCommerce ( <em>Products &gt; Edit Product &gt; Product Data (tab) &gt;&gt;&gt; Linked Products &gt;&gt;&gt; Upsell</em> ) and enabled for Autoship.</li>\n<li>Improved: The options for <strong>Displaying Scheduled Orders in My Account</strong> are now better organized so that additional options related to each display option are easier to identify and enable/disable.\n<ul>\n<li>Functions updated:</li>\n<li><strong>autoship_get_scheduled_order_item_add_url</strong> &#8211; Added redirect param</li>\n<li><strong>autoship_add_to_scheduled_order_endpoint_wrapper</strong>&#8211; Added redirect param</li>\n<li><strong>autoship_get_scheduled_order_link_params</strong> &#8211; Added redirect param</li>\n<li><strong>autoship_enqueue_scripts</strong> &#8211; Includes new JS scripts for Carousel and v2 Portal display Option</li>\n<li><strong>autoship_options_section</strong> &#8211; Added HTML for new v2 Portal display option</li>\n<li>Functions created:</li>\n<li><strong>autoship_scheduled_order_upsell_products_template_display</strong> &#8211; Displays the Upsell products widget</li>\n<li><strong>autoship_scheduled_order_upsell_products_template_heading</strong> &#8211; Filters Woo product upsells section heading</li>\n<li><strong>autoship_scheduled_order_upsell_products_template_loop_add_to_cart</strong>&#8211; Filters Woo After Shop loop item</li>\n<li><strong>autoship_scheduled_orders_v2_portal_display</strong> &#8211; Function for displaying v2 Portal template</li>\n</ul>\n</li>\n</ul>\n<h4>2.6.1 &#8211;  2024-05-09</h4>\n<ul>\n<li>Improved: The loading page speed is now about 25%-30% faster for the My Account &gt; Scheduled Order page when using the Native UI Display option.  This decrease in load time was achieved by improving the code that fetches product variations shown in the Add Products dropdown.</li>\n<li>Fixed: a styling issue with the &#8220;Add product&#8221; dropdown in the Native UI Display option where the dropdown list was not displaying to the full width of the screen size when including a product or variation with a very long title. This was causing a display issue with the responsive layout on smaller screens.\n<ul>\n<li>Functions updated:</li>\n<li><strong>autoship_activate_sync_bulk_action_handler &#8211; Added code that updates variants metadata for **_autoship_sync_active_enabled</strong></li>\n<li><strong>autoship_deactivate_sync_bulk_action_handler</strong> &#8211; Added code that updates variants metadata for <strong>_autoship_sync_active_enabled</strong></li>\n<li><strong>autoship_get_available_schedulable_variations</strong> &#8211; Updates code for querying variants</li>\n<li><strong>autoship_save_product_custom_fields</strong> &#8211; Added code that updates variants metadata</li>\n<li>Functions created:</li>\n<li><strong>autoship_handle_dissable_schedule_order_options_meta_query</strong> &#8211; Adds new metadata key for custom query</li>\n<li><strong>autoship_update_product_variants_sync_active_flag</strong> &#8211; Handles updating product variants metadata for <strong>_autoship_sync_active_enabled</strong> meta</li>\n<li><strong>autoship_update_product_add_to_scheduled_order_flag</strong> &#8211; Handles updating product variants metadata for <strong>_autoship_schedule_order_enabled</strong></li>\n</ul>\n</li>\n</ul>\n<h4>2.6.0 &#8211;  2024-04-04</h4>\n<ul>\n<li>\n<p>New!  Support for Cart and Checkout Blocks has been added.  Now sites can use Block elements to display the Cart or Checkout on their storefront work with Autoship Checkout.  There is a limitation for displaying Autoship Options for products in the Cart Block, and more options will be included in the future as additional properties are available for WooCommerce Block elements.</p>\n<ul>\n<li>Functions updated:</li>\n<li><strong>autoship_checkout_create_order_line_item</strong> &#8211; Updated logic for checking where the order was created</li>\n<li><strong>autoship_create_scheduled_orders_on_checkout</strong> &#8211; Updated logic for checking where the order was created</li>\n<li><strong>autoship_create_scheduled_orders_on_payment_status_changed</strong> &#8211; Updated logic for checking where the was order created</li>\n<li><strong>autoship_create_scheduled_orders_on_payment_captured_hook</strong> &#8211; Updated logic for checking where the order was created</li>\n<li><strong>autoship_get_scheduled_order_data</strong> &#8211; Updated logic for checking where the order was created</li>\n<li><strong>autoship_woocommerce_hpos_compatibility</strong> &#8211; Added blocks compatibility</li>\n<li>Functions created:</li>\n<li><strong>autoship_woocommerce_uses_blocks</strong> &#8211; Utility function that checks if cart and checkout pages are using blocks</li>\n<li><strong>autoship_get_cart_item_data</strong> &#8211; Adds information about the Autoship Item Schedule and Next Order into the Cart Item Data so that information displays in the Cart and Checkout blocks</li>\n</ul>\n</li>\n<li>\n<p>New: Added support for the <strong>BackordersAllowed</strong> property to the product data synced with QPilot.  This enables QPilot to use its improved support for avoiding unwanted Backorders when processing Autoship Scheduled Orders by checking if the Quantity In Stock for a Product or Variation is lower than the Quantity for an Item included in an upcoming Scheduled Order.</p>\n<ul>\n<li>Functions updated:</li>\n<li><strong>autoship_generate_product_upsert_data</strong> &#8211; Added BackordersAllowed property</li>\n</ul>\n</li>\n</ul>\n<h4>2.5.3 &#8211;  2024-02-29</h4>\n<ul>\n<li>Improved: The endpoint for retrieving Scheduled Order Metrics has been updated in the plugin to use the latest version of the Scheduled Order Metrics report in the WordPress Admin <em>WP-Admin &gt; Autoship Cloud &gt;&gt; Reports &gt;&gt;&gt; Scheduled Order Metrics (tab)</em>\n<ul>\n<li>Functions updated:</li>\n<li><strong>autoship_admin_reports_tabs_content</strong> &#8211; Updated endpoint used</li>\n</ul>\n</li>\n<li>Fixed: Restored the ability to use the function that retrieves product data from QPilot and returns an array.  This function was changed in Verison 2.5.2 to retrieve product data from WooCommerce.    A new filter has been added for developers to use when they want to return product data from QPilot, and a new setting option has been added to <em>WP-Admin &gt; Autoship Cloud &gt;&gt; Settings</em> that a WordPress Admin can enable in order to retrieve product data from QPilot without the need to change the filter directly with code.\n<ul>\n<li>Functions updated:</li>\n<li><strong>autoship_get_schedulable_products_script_data</strong> &#8211; Updated with the logic that checks if <strong>autoship_filter_schedulable_products_use_wc_data</strong> filter is true or false and depending on that pulls data from WooCommerce or QPilot</li>\n<li><strong>autoship_get_schedulable_products_display_labels</strong> &#8211; Updated with the logic that checks if <strong>autoship_filter_schedulable_products_use_wc_data</strong> filter is true or false and, depending on that, passes proper data to filter</li>\n<li><strong>autoship_filter_schedulable_products_data</strong> &#8211; Updated with the logic that checks if <strong>autoship_filter_schedulable_products_use_wc_data</strong> filter is true or false and depending on that handles accessing data in a proper way</li>\n<li><strong>autoship_filter_schedulable_products_data_skip_variable</strong> &#8211; Updated with the logic that checks if <strong>autoship_filter_schedulable_products_use_wc_data</strong> filter is true or false and, depending on that, handles accessing data in a proper way</li>\n<li><strong>register_autoship_settings</strong> &#8211; Added new setting key</li>\n<li><strong>autoship_get_settings_fields</strong> &#8211; Added new setting key</li>\n<li><strong>autoship_get_legacy_support_qpilot_products_data</strong> &#8211; New function that retrieves setting for whether to enable QPilot data usage</li>\n<li><strong>autoship_legacy_qpilot_products_data_default_init</strong> &#8211; New function that sets the default value for setting</li>\n<li><strong>autoship_filter_schedulable_products_use_wc_data</strong> &#8211; New function that defines <strong>autoship_filter_schedulable_products_use_wc_data</strong> with the value based on the settings</li>\n<li><strong>autoship_get_schedulable_products_from_qpilot</strong> &#8211; New function that contains code for pulling data from QPilot</li>\n<li><strong>autoship_get_schedulable_products_from_wc</strong> &#8211; New function that contains code for pulling data from WC</li>\n</ul>\n</li>\n<li>Fixed: A case where a recursion error would occur when refreshing a product page that had previously selected the &#8220;Autoship and Save&#8221; option was reloaded. To fix the issue, the code that adds the &#8220;active&#8221; class to the &#8220;Autoship and Save&#8221; option runs first in the &#8220;triggerVariation&#8221; function.</li>\n</ul>\n<h4>2.5.2 &#8211;  2024-01-30</h4>\n<ul>\n<li>\n<p>Improved: Products now load faster with the Native UI Display Option which displays Scheduled Orders to Customers that are logged in to <em>My Account &gt; Scheduled Orders</em> using WordPress templates.  This improvement is due to Product Data now being loaded directly from WooCommerce instead of the QPilot API.</p>\n<ul>\n<li>Functions Updated:</li>\n<li><strong>autoship_get_schedulable_products_script_data</strong> &#8211; Updated code to query products from WooCommerce store</li>\n<li><strong>autoship_get_schedulable_products_display_labels</strong> &#8211; Updated code to use <strong>WC_Product</strong> object getters</li>\n<li><strong>autoship_filter_schedulable_products_data</strong> &#8211; Updated code to <strong>WC_Product object</strong> getters and skip converting to array</li>\n<li><strong>autoship_filter_schedulable_products_data_skip_variable</strong> &#8211; Updated code to <strong>WC_Product</strong> object getters</li>\n<li>New Functions Added:</li>\n<li><strong>autoship_get_available_schedulable_variations</strong> &#8211; Gets product variations that are enabled for Scheduled Orders.</li>\n</ul>\n</li>\n<li>\n<p>Improved: Better handling of displaying Scheduled Orders when they are entered directly via URL and do not belong to the site specifically with the Native UI Display Option.  Now, an appropriate &#8220;Not Found&#8221; error is displayed to the user when they attempt to view a Scheduled Order that is not assigned to them as a Customer.</p>\n</li>\n<li>\n<p>Fixed: Issue that was causing a fatal error when editing a user account in the WordPres Admin ( <em>WP-Admin &gt; Users</em> ) page.</p>\n<ul>\n<li>Functions Updated</li>\n<li><strong>autoship_after_update_customer_autoship_action</strong> &#8211; Updated with to check if the code is running in the  WP-Admin and, if so, use the <strong>WC_Admin_Notices</strong> function to display the notice.</li>\n</ul>\n</li>\n</ul>\n<h4>2.5.01 &#8211; 2023-12-05</h4>\n<ul>\n<li>Fixed: Issue where sites extending WooCommerce Coupon functionality encountered an error when attempting to run functions related to WooCommerce Coupons or access Coupons in the WordPress Admin ( WP-Admin &gt; Marketing &gt;&gt; Coupons )</li>\n<li>Fixed: Issue that was preventing the re-activation of Autoship Sync for variable products with QPilot. Previously, an error would occur when a WordPress Administrator would use the action to &#8220;Activate Autoship Sync&#8221; for a variable product after using the action to &#8220;Deactivate Autoship Sync&#8221; when updating Products in the WordPress Admin (WP-Admin &gt; Products).</li>\n</ul>\n<h4>2.5.0 &#8211;  2023-11-27</h4>\n<ul>\n<li>New!  Compatibility for High Performance Order Storage (HPOS) has been added.\n<ul>\n<li>HPOS introduces significant changes to how eCommerce data is managed in your WordPress Site, so we strongly suggest that sites enabling HPOS for the first time <a href=\"https://woo.com/document/high-performance-order-storage/\" rel=\"nofollow ugc\">learn more about HPOS</a> and carefully test this change before enabling HPOS with their Live Site.</li>\n</ul>\n</li>\n<li>New!  Support for Upzelo integration has been added to the Native UI Display Option.  Now, any connected QPilot Site that has enabled the Upzelo Retention Platform can display Upzelo Cancelation Popups, Cancelation Challenges, and Surveys without manual code changes.</li>\n</ul>\n<h4>2.4.3 &#8211;  2023-10-26</h4>\n<ul>\n<li>Improved: Removed a function that would convert order dates to be formatted in ISO 8601 for use in WooCommerce REST API responses, and that was causing compatibility issues with the WooCommerce mobile app for iOS.</li>\n<li>Removed Functions!  The following functions have been removed from the plugin:\n<ul>\n<li><strong>autoship_woocommerce_rest_fix_data</strong> &#8211; Removed the call to the <strong>&#8216;autoship_woocommerce_rest_fix_dates&#8217;</strong> function that converts date formats.</li>\n<li><strong>autoship_woocommerce_rest_fix_dates</strong> &#8211; Removed the function because it is legacy code and no longer in use</li>\n</ul>\n</li>\n</ul>\n<h4>2.4.2 &#8211;  2023-10-11</h4>\n<ul>\n<li>Improved: All QPilot Coupon discount types will now render as Virtual Coupons on WooCommerce Orders created from processing Scheduled Orders.  Previously, only some coupon discount types would be rendered as Virtual Coupons on WooCommerce Orders.</li>\n<li>Fixed: The Bulk Update Utility to Enable Autoship Options has been fixed to update the options for Variable Products to enable or disable the display of Autoship Options on Product Pages for Variable Products and their Variations.  Previously, the Bulk Utility would not update this option on Product Variations.</li>\n<li>Fixed: The Tax amount is now included in Order Total Calculation for Scheduled Orders in the Native UI display option.</li>\n<li>Fixed: The pricing and discounts for items displayed in the Native UI display option now display correctly when Items are discounted by valid QPilot Coupons that disable the discounting of a Scheduled Order Item&#8217;s Sale Price.</li>\n<li>Fixed: The Shipping Line Subtotal now displays &#8216;No Shipping Options Found&#8217; when no Shipping Rate is applied to a Scheduled Order and &#8216;Free&#8217; when a Shipping Rate is applied to the Scheduled Order in the amount of 0.00.</li>\n<li>Fixed: Coupons that apply their discount to the Items in a Scheduled Order now correctly apply their discount to their corresponding Item(s) in WooCommerce Orders created from processing Scheduled Orders.</li>\n<li>Fixed: Coupons that apply their discount to Item(s) that belong to a QPilot Product Group coupon now apply their discount to their corresponding to all Item(s) in WooCommerce Orders created from processing Scheduled Orders.</li>\n<li>Fixed: The Native UI display option has been updated so that a Scheduled Order can still be updated when a Scheduled Order Item contains a &#8220;Max Cycle&#8221; value.  Previously, when a Scheduled Order contained an item with a value for Max Cycle (Example: a &#8220;one-time purchase&#8221; item), the Scheduled Order would not update.</li>\n<li>Fixed: An issue that would cause the Embedded App Display Option to not load due to a 404 error.</li>\n</ul>\n<h4>2.4.1 &#8211;  2023-06-16</h4>\n<ul>\n<li>New!  A new option for Merchants has been added to the Autoship Settings that enables Merchants that accept Cash On Delivery (COD) payments to easily add support for COD during Autoship Checkouts ( <em>WP-Admin &gt; Autoship Cloud &gt;&gt; Settings &gt;&gt;&gt; Options (tab)</em> ).  This new option is Disabled by default for all Merchants.</li>\n<li>Improved: We&#8217;ve optimized the loading speed of The Native UI Display Option, that displays upcoming Scheduled Orders to Customers using WordPress templates so that Autoship Customers can quickly view and make changes to their Scheduled Orders.</li>\n<li>Improved: Additional translation filters have been added to include the Frequency Display Name referenced by the Native UI Display Option in the <em>My Account &gt; Scheduled Orders</em> view.</li>\n<li>Fixed: Autoship Orders paid for with Braintree Credit Cards and Braintree PayPal saved payment methods now successfully refund from the WooCommerce Edit Order page.  This fix addresses updates to the Braintree for WooCommerce plugin by WooCommerce.</li>\n<li>Fixed: The Native UI Display Option has been updated to correctly display the Regular Price of items when no Sale Price is applied.  Previously, when an item on a Scheduled Order was discounted by a Sale Price, but a coupon conditionally disabled the Sale Price for that item, the Sale Price would still be displayed to the Customer.</li>\n<li>Fixed: The Native UI Display Option has been updated to accurately display a Subtotal that accounts for discounts applied to items in the Scheduled Order by Coupons that apply discounting to a Product&#8217;s or Product Group&#8217;s price. </li>\n<li>Fixed: The Embedded App Display option has been updated to enable customers to make changes to Scheduled Orders that have a Next Occurrence Date and Time that after the connected QPilot Site&#8217;s Processing Time.</li>\n</ul>\n<p>= 2.4.0 &#8211;  2023-03-21</p>\n<ul>\n<li>Fixed: &#8220;Square Refund Failed: Invalid API error&#8221; error when trying to refund SO via Square</li>\n<li>Fixed: Edit Schedule native UI Datepicker now respects Lock Window and Processing offset days set in the Site settings and doesn&#8217;t allow selecting earlier days.</li>\n</ul>\n<p>= 2.3.9 &#8211; 2023-01-25</p>\n<ul>\n<li>Improved: Autoship Product Sync error notices for WordPress Admins displayed on the <em>WooCommerce &gt; Products &gt; Edit Product</em> screen when a variation is saved via AJAX will now be cleared when the page is refreshed in the browser.</li>\n<li>\n<p>Improved: A check has been added for returned errors and a notice is now displayed in the <em>WooCommerce &gt; Products &gt; Edit Product</em> page if an error occurs for one or more Product Variations during the Autoship Product Sync process.</p>\n</li>\n<li>\n<p>Fixed: The Add to Cart action shown on the Shop Catalog now supports WooCommerce themes that do not include a Quick View.  Previously, WooCommerce Themes that do not include a Quick View would add duplicate items to the cart when a product was added from the Shop Catalog and from the Single Product page with the One-Time Purchase option selected.</p>\n</li>\n</ul>\n<p>= 2.3.8 &#8211; 2022-11-16</p>\n<ul>\n<li>Fixed: the check for invalid products in the WordPress admin page(s) when a site is first connected to Qpilot.  Previously, starting in v2.3.7, a fatal error would occur when the Autoship Cloud plugin is first activated on a new site.</li>\n</ul>\n<p>= 2.3.7 &#8211;  2022-11-09</p>\n<ul>\n<li>\n<p>New! We&#8217;ve added a new notice for WordPress Admins that will now be displayed on the WooCommerce Edit Product screen whenever a product that is enabled for Autoship Cloud is saved or updated and an error occurs when attempting to sync the WooCommerce Product or Variation with QPilot.</p>\n</li>\n<li>\n<p>Improved: A warning notice will now be displayed at the top of the Autoship Cloud Products page ( <em>WP-Admin &gt; Autoship Cloud &gt; Products</em> ) when one or more invalid products exist in QPilot.</p>\n</li>\n<li>\n<p>Fixed: the &#8220;API Health Check&#8221; ( displayed in <em>WP-Admin &gt; Autoship Cloud &gt;&gt; Settings</em> ) will now display the &#8220;Unhealthy&#8221; badge warning in the WordPress Admin in both the Autoship Cloud main menu item and the Autoship Cloud &gt; Products sub-menu item when one or more invalid products exist in QPilot.</p>\n</li>\n<li>\n<p>Fixed: the Bulk utilities found in the <em>WP-Admin &gt; Autoship Cloud &gt; Settings &gt;&gt; Utilities ( tab )</em>  so that all default options are correctly selected.</p>\n</li>\n</ul>\n<p>= 2.3.6 &#8211;  2022-10-03</p>\n<ul>\n<li>\n<p>Improved! Product data synchronization between WooCommerce Products and QPilot has been improved by removing redundant synchronization calls sent to QPilot when a product is saved.</p>\n</li>\n<li>\n<p>Fixed: the link offered in the alert notification for &#8220;No Autoship Payment Gateways Enabled&#8221; has been updated to a new URL</p>\n</li>\n</ul>\n<p>= 2.3.5 &#8211;  2022-09-20</p>\n<ul>\n<li>\n<p>Improved: Support for Product-Level Discount Coupons has been improved for the Native UI Display Option ( for displaying Scheduled Orders to customers in <em>My Account &gt; Scheduled Orders</em>  using native WordPress / WooCommerce templates ). The individual item price and subtotals will now reflect any discount applied to the Scheduled Order using a &#8220;Reduce Product By Amount&#8221; or &#8220;Reduce Product By Percentage&#8221; discount type for coupons assigned to one or more products.</p>\n</li>\n<li>\n<p>Improved: Support for the <em>WooCommerce PayPal Payments</em> plugin has been improved by changing when the Autoship Cloud plugin triggers the <strong>&#8216;woocommerce_subscription_payment_complete&#8217;</strong> action &#8212; which is how the <em>WooCommerce PayPal Payments</em> plugin tokenizes the payment method used during the WooCommerce Checkout.</p>\n</li>\n<li>\n<p>Improved: A new option has been added to the Update Product Synchronization bulk utility that can be checked to enable the Add to Scheduled Order and Enable Schedule Options options for all products synchronized with QPilot.</p>\n</li>\n<li>\n<p>Improved! Product data synchronization between WooCommerce Products and connected QPilot Sites has been improved by automatically enabling the options for &#8220;Add to Scheduled Order&#8221; and &#8220;Enable Schedule Options&#8221; when a product&#8217;s &#8220;Activate Product Sync&#8221; setting is enabled in the <em>WooCommerce &gt; Edit Product</em> screen.</p>\n</li>\n<li>\n<p>Fixed: starting in version 2.3.2, Scheduled Order data could be inadvertently removed from cart items when the scheduled item was updated in the cart and the option for &#8220;Enable to Display Autoship Options&#8221; &#8212; located in  <em>WP-Admin &gt; Autoship Cloud &gt; Settings &gt;&gt; Options ( tab )</em>  &#8212; for each product in the cart was unchecked.</p>\n</li>\n<li>\n<p>New Filters! The following new filters have been added to the plugin:</p>\n<ul>\n<li>A new <strong>&#8216;autoship_exclude_product_coupon_discounts_in_saleprice&#8217;</strong> filter has been added to the <strong>autoship_get_calculated_scheduled_order_item_sale_price()</strong> function in the <em>src/scheduled-orders.php</em> file and passes a single boolean parameter which can be used to disable the inclusion of product-level coupon discounts in the displayed product price in the Native UI Display Option ( for displaying Scheduled Orders to customers in <em>My Account &gt; Scheduled Orders</em> )</li>\n</ul>\n</li>\n</ul>\n<p>= 2.3.4 &#8211;  2022-08-09</p>\n<ul>\n<li>Improved: the Checkout.com Payment gateway integration has been updated to create Scheduled Orders after completing a checkout using the <strong>&#8216;checkout_com_payment_captured&#8217;</strong> action which was newly added to the Checkout.com Payment Gateway plugin.</li>\n<li>Improved: the <strong>autoship.pot</strong> file has been updated to include all new versions of the text strings displayed in the My Account, Product, and Cart pages.</li>\n<li>\n<p>Improved: the Authorize.net refund metadata assigned to WooCommerce orders generated by QPilot has been updated to now include the charge captured value (&#8216;yes&#8217;) as well as all of the gateway response field names.</p>\n</li>\n<li>\n<p>Fixed: Updated to load Autoship Cloud&#8217;s translated strings when the plugins loaded action fires.  Previously, starting in v1.2.38 a minimum version requirement check was added which inadvertently changed the load order of the plugin files and prevented the translated strings from being loaded.</p>\n</li>\n</ul>\n<p>= 2.3.3 &#8211;  2022-07-06</p>\n<ul>\n<li>Fixed: Updated to include the new order-shipping-rate-form.php file for the selectable Shipping Rates support that was added in v2.3.2.</li>\n</ul>\n<p>= 2.3.2 &#8211;  2022-06-28</p>\n<ul>\n<li>New! Added support for selectable Shipping Rates in the Native UI, Cart, and Checkout. A new option to <strong>Enable Selectable Shipping Rates</strong> can be selected in the WordPress Admin that allows customers to change the assigned Default Shipping Rate for their Scheduled Order when using the <strong>Native UI Display Option</strong> to display Scheduled Orders to Customers in <em>My Account &gt; Scheduled Orders</em> to a Preferred Shipping Rate. This new option is disabled by default and can be enabled in the WordPress Admin ( <em>WP-Admin &gt; Autoship Cloud &gt; Settings &gt;&gt; Options ( tab )</em> ).\n<ul>\n<li>When a Scheduled Order is viewed by a Customer in the <em>My Account &gt; Edit Scheduled Order</em> screen, and the Scheduled Order has more than one available Shipping Rate option, a new <strong>Edit</strong> link will be displayed next to the Shipping total line. When the link is selected, a new <strong>Preferred Shipping Rate</strong> modal is displayed with a select drop-down menu displaying all of the available Shipping Rates and associated cost as well as the following options:</li>\n<li>a. <strong>Refresh Rates</strong> &#8211; When clicked, the Scheduled Order is re-freshed via the API to see if any new Shipping Rates are available for the Scheduled Order</li>\n<li>b. <strong>Cancel</strong> &#8211; When clicked, no changes are made to the Scheduled Order and the modal is closed</li>\n<li>c. <strong>Update Shipping Method</strong> &#8211; When clicked, the new selected Shipping Rate will be assigned to the Scheduled Order as the Preferred Shipping Rate</li>\n<li>When a Scheduled Order is viewed by a Customer in the <em>My Account &gt; Edit Scheduled Order</em> screen, and the Scheduled Order has only one available Shipping Rate option, a new <strong>Refresh Rates</strong> link will be displayed next to the Shipping total line. When selected, the Scheduled Order will be refreshed and all of the available Shipping Rates will be re-loaded into the <em>My Account &gt; Edit Scheduled Order</em> screen.</li>\n</ul>\n</li>\n<li>Improved: the <a href=\"https://wordpress.org/plugins/checkout-com-unified-payments-api/\" rel=\"ugc\">Checkout.com Payment Gateway</a> integration has been updated to support version 4.4.0+ of the Checkuot.com Payment Gateway plugin. Previously, starting in Checkout.com Payment Gateway version 4.4.0 a PHP Fatal error message could occur after checkout and prevent the corresponding Scheduled Order(s) and saved Payment Method from being created successfully in QPilot.</li>\n<li>BETA: Added support for the new <a href=\"https://wordpress.org/plugins/woocommerce-paypal-payments/\" rel=\"ugc\">WooCommerce PayPal Payments plugin</a>. Support for the WooCommerce PayPal Payments plugin is only enabled when a new <strong>(Beta) Experimental Support for WooCommerce PayPal Payments</strong> settings option, found in the new Experimental ( Beta ) Options section in <em>WP-Admin &gt; Autoship Cloud &gt; Settings &gt;&gt; Options ( tab )</em> is checked.  The option is unchecked by default and, when checked, the following functionality is enabled:\n<ul>\n<li>The <strong>Autoship Cloud Supported Payment Gateways</strong> icon is displayed next to the <strong>PayPal</strong> and <strong>PayPal Card Processing</strong> gateways in the <em>WooCommerce &gt; Settings &gt; Payments ( Tab )</em></li>\n<li>If 1 or more products scheduled for Autoship are in the cart, and <strong>PayPal</strong> and/or <strong>PayPal Card Processing</strong> are enabled as gateways in the <em>WooCommerce &gt; Settings &gt; Payments ( Tab )</em>, then PayPal checkout will be enabled for the cart.</li>\n<li>When the customer checks out, and 1 or more products scheduled for Autoship are in the cart, and they selected the <strong>PayPal | Credit Card</strong> option, the <strong>Save Your Credit Card</strong> checkbox will be checked by default and can not be unchecked by the customer unless all items scheduled for Autoship are removed from the cart.</li>\n<li>When the customer places their order and selects either the <strong>PayPal</strong> or <strong>PayPal Card Processing</strong> gateways, the payment method used will be tokenized and saved in the WooCommerce Order Metadata under the value <strong>payment_token_id</strong></li>\n<li>The Scheduled Oder data sent to QPilot will include the new <strong>PayPal</strong> or <strong>PayPal Credit Card</strong> token and either a <strong>gatewayPaymentType</strong> set to &#8217;25&#8217; ( PaypalFundingPaypal ) or &#8217;26&#8217; ( PaypalFundingCard )</li>\n<li>Scheduled Orders can be processed by QPilot with these tokenized saved payments, and the resulting WooCommerce Order will include the payment method set to <em>ppcp-gateway</em></li>\n<li>IMPORTANT NOTE: The WooCommerce PayPal Payments plugin does not support the creation of new saved payment methods by Customers in <em>My Account &gt; Payment Methods</em></li>\n</ul>\n</li>\n</ul>\n<p>= 2.3.1 &#8211;  2022-06-21</p>\n<ul>\n<li>Fixed: starting in v2.3.0, a Fatal Error that could occur in the My Account &gt; Payment Method screen when adding a new payment method for one of the following Payment Gateways; Authorize.Net, Square, Braintree, and NMI.</li>\n</ul>\n<p>= 2.3.0 &#8211;  2022-05-04</p>\n<ul>\n<li>Improved: We enhanced the Update Product Data Retrieval Functions to check for invalid products.  Previously a fatal error would occur when 1+ products were invalid, and now a log entry is added to the Autoship Cloud Logs when a product is being retrieved but is invalid.</li>\n<li>Improved: We updated the <strong>autoship_scheduled_order_quantity_input()</strong> function found in <em>src/scheduled-orders.php</em> to avoid a PHP 8.0 deprecation notice that was being added to the debug log.</li>\n<li>Improved: We Added a check for Coupons that use Product Groups instead of Products to avoid a PHP Warning when customers are accessing the <em>My Account &gt; Scheduled Order</em> and <em>My Account &gt; Scheduled Orders</em> screens.</li>\n<li>\n<p>Improved: We updated our integration with Stripe to handle and record data (including Fees) that is returned by the Stripe Payment Intents API for WooCommerce Orders generated by QPilot when a Scheduled Order processes.</p>\n</li>\n<li>\n<p>Fixed: The subtotal and totals displayed in the <strong>Native UI Scheduled Order</strong> display option under <em>My Account &gt; Scheduled Orders</em> to correctly include discounts applied to a Scheduled Order when using a coupon set to Reduce Product Price By Amount as the discount type.</p>\n</li>\n</ul>\n<p>= 2.2.9 &#8211;  2022-03-29</p>\n<ul>\n<li>\n<p>New! <strong>Checkout.com</strong> is now available as a supported payment integration.  Merchants using the <em>Checkout.com Payment Gateway plugin by Checkout.com</em> (<a href=\"https://wordpress.org/plugins/checkout-com-unified-payments-api/\" rel=\"ugc\">https://wordpress.org/plugins/checkout-com-unified-payments-api/</a>) can now add this integration for their connected QPilot Site via <em>WP-Admin &gt; Autoship Cloud &gt; Payment Integrations</em>.</p>\n</li>\n<li>\n<p>Improved! Accessibility to the Autoship Cloud plugin in the Plugins page ( <em>WP-Admin &gt; Plugins</em> ) has been improved by adding links in the Autoship Cloud plugin&#8217;s description.</p>\n</li>\n<li>Improved! Product data synchronization between WooCommerce Products and QPilot has been improved by including the Parent Product Id for WooCommerce Product Variations in the data sent to QPilot.</li>\n<li>\n<p>Improved! Support for the legacy QPilot Scheduled Order processing version has been improved by including a new &#8220;downgrade option&#8221; via a link that allows for the Autoship Cloud plugin stored processing version to be rolled back as a method for merchants that need to downgrade the plugin to versions that use older processing versions.</p>\n</li>\n<li>\n<p>New Filters! The following new filters have been added to the plugin:</p>\n<ul>\n<li>A new <strong>&#8216;autoship_checkout_supported_payment_gateway_save_method_ids&#8217;</strong> filter has been added to the <strong>autoship_force_save_card()</strong> function in the <em>src/checkout.php</em> file and can be used to filter the id&#8217;s of the save payment method checkout in the checkout form.</li>\n</ul>\n</li>\n</ul>\n<p>= 2.2.8 &#8211; 2022-02-09</p>\n<ul>\n<li>Fixed: the Embedded App Display option has been updated to resolve an error that would occur when a customer would attempt to update a Scheduled Order and no timezone (UTC offset) was selected in the connected QPilot Site.</li>\n<li>Fixed: the Embedded App Display option has been updated to resolve a 400 error that would occur when a customer would attempt to update the Next Occurrence Date on a Scheduled Order after the Processing End Time (defined on the connected QPilot Site) had already passed.</li>\n</ul>\n<p>= 2.2.7 &#8211; 2022-01-28</p>\n<ul>\n<li>Fixed: the Embedded App Display option has been updated to work with the new Date/Time format used by version 2.2.5+</li>\n</ul>\n<p>= 2.2.6 &#8211; 2022-01-18</p>\n<ul>\n<li>Improved: the display of customer-facing notifications in the Native UI Display Option has been updated to use the customer-friendly version of the failure messages supplied by the QPilot API for lock window and order processing window validation errors.  This makes it easy for customers to understand that they cannot make changes to a Scheduled Order while it is being processed.</li>\n<li>Improved: the checkout page integration has been updated to use the <strong>wp_doing_ajax()</strong> function instead of the deprecated <strong>is_ajax()</strong> function.</li>\n<li>Improved: currency support has been added to the creation of new Scheduled Orders that are created when using the Native UI Display Option by setting the currency associated with the new Scheduled Order to the same currency selected in the WooCommerce Site Settings (found in <em>WP-Admin &gt; WooCommerce &gt; Settings &gt;&gt; General (tab)</em>)</li>\n<li>Improved: the option labels used in the &#8220;Displaying Scheduled Orders in My Account&#8221; section (found in <em>WP-Admin &gt; Autoship Cloud &gt; Settings &gt;&gt; Options ( tab )</em>) to be more descriptive.</li>\n<li>Improved: The minimum required version of PHP has been changed from 5.6 to 7.3 in order to help reduce risks of security vulnerabilities possible with older versions of  &hellip;</li>\n</ul>\n"
    },
    "short_description": "Use one plugin to automate repeat orders, product subscriptions, and scheduled deliveries for your WooCommerce subscriptions products.",
    "description": "<p><strong>Upgrade your subscribe and save, product subscriptions, and repeat deliveries with Autoship Cloud for WooCommerce Subscription products</strong> &#8211; a flexible and scalable program that customers love! The <a href=\"https://autoship.cloud\" rel=\"nofollow ugc\"><strong>Autoship Cloud plugin</strong></a> powered by QPilot is <strong>free to connect and test.</strong></p>\n<p>This is a <strong>single plugin</strong> that allows you to enable any of your WooCommerce products for subscriptions, subscribe and save, repeat ordering, and delivery. Once enabled, the &#8220;Autoship and Save&#8221; or &#8220;Subscribe and Save&#8221; <strong>automatically appears on your products and variations</strong>, and can also be displayed in your cart!</p>\n<p>WooCommerce subscriptions are quick to launch, so you can start offering your customers an <strong>incredibly flexible subscription portal</strong> where they can manage their upcoming repeat deliveries in My Account.</p>\n<p>Seamlessly supports recurring payments with over 10+ popular payment gateways including <a href=\"http://authorize.net/\" rel=\"nofollow ugc\">Authorize.net</a>, Stripe, Braintree, PayPal and more!</p>\n<p>Automate your business with <strong><a href=\"https://support.autoship.cloud/category/451-notifications\" rel=\"nofollow ugc\">notifications</a></strong> (powered by SendGrid), repeat order processing, and shipping rules with carrier integrations. Autoship Cloud automatically syncs with your inventory to make things easy.</p>\n<p>Offer dynamic coupons on recurring orders, automate shipping, sync inventory &amp; stock status, upsell products into orders, and keep on top of everything with our incredible reporting and forecasting suite.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ncPrmTAI3pI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Have a question about how you can operate your subscribe and save program at scale with Autoship Cloud? <a href=\"https://autoship.cloud/contact-us/\" rel=\"nofollow ugc\"><strong>Ask us here.</strong></a></p>\n<h3><strong>Live Demo Stores</strong></h3>\n<ul>\n<li><a href=\"https://beautyloop.wpengine.com/\" rel=\"nofollow ugc\">&#8220;Subscribe and Save&#8221; Demo Store</a>: see how quickly you can add subscription options to your existing products)</li>\n<li><a href=\"https://weeklyfresh.co/\" rel=\"nofollow ugc\">&#8220;Meal Delivery&#8221; Demo Store</a>: see how Meal and Food Delivery sites can customize WooCommerce and the Autoship Cloud plugin to craft the best customer experience.  Includes a <a href=\"https://autoship.cloud/tutorials/meal-subscription-boxes-customer-journey/\" rel=\"nofollow ugc\">full tutorial</a> &#8211; with code examples for developers &#8211; for <a href=\"https://autoship.cloud/tutorials/meal-subscription-boxes-customer-journey/\" rel=\"nofollow ugc\">how we designed and developed this store here</a>.</li>\n<li><a href=\"https://traderjoeys.com/\" rel=\"nofollow ugc\">&#8220;Autoship&#8221; B2B Demo Store</a>: see how Autoship Cloud makes it easy to automate repeat ordering by offering Autoship for raw materials &amp; food supplies</li>\n</ul>\n<h3><strong>★★★★★ 5 Star Support for Merchants and Developers</strong></h3>\n<p>Launch &amp; scale with confidence!  All of our 5 star plugin reviews mention our excellent support.</p>\n<ul>\n<li>Fully documented Install &amp; Launch Guide</li>\n<li>Detailed Documentation for Features, FAQ&#8217;s and Plugin Code</li>\n<li>Fast and Responsive Online Support</li>\n<li>Backed by a team of experts in WooCommerce, Autoship, Advanced Integrations and Business Automation!</li>\n</ul>\n<h3>Fully Documented Help Guides for Merchants and Plugin Code Docs for Developers</h3>\n<p>See the full <a href=\"https://support.autoship.cloud\" rel=\"nofollow ugc\">documentation and support site for the Autoship Cloud plugin here.</a></p>\n<ul>\n<li>Tested with the latest versions of WooCommerce &#8211; see our plugin changelog (<a href=\"https://wordpress.org/plugins/autoship-cloud/#developers\" rel=\"ugc\">https://wordpress.org/plugins/autoship-cloud/#developers</a>)</li>\n<li>Fully illustrated Install &amp; Launch Guide</li>\n<li>Plugin documentation for templates, filters actions and hooks (<a href=\"https://support.autoship.cloud/collection/598-developers\" rel=\"nofollow ugc\">https://support.autoship.cloud/collection/598-developers</a>)</li>\n<li>API and Webhook documentation for QPilot, the hosted service that powers the Autoship Cloud plugin (<a href=\"https://docs.qpilot.cloud/reference/introduction\" rel=\"nofollow ugc\">https://docs.qpilot.cloud/reference/introduction</a>)</li>\n</ul>\n<h3><strong>Customer Reviews with Examples</strong></h3>\n<p>&#8220;QPilot has been extremely helpful &amp; supportive throughout the various stages of support.&#8221;</p>\n<ul>\n<li><a href=\"https://iheartdogs.com/\" rel=\"nofollow ugc\">iHeartDogs</a></li>\n</ul>\n<p>&#8220;They are there for you, don’t matter how small or large your issue is. They are attentive, effective and will follow up with you. And they do provide customizations! We couldn’t be happier! Highly recommended!&#8221; &#8211; <a href=\"https://bluemoonhemp.com/\" rel=\"nofollow ugc\">BlueMoonHemp</a></p>\n<p>&#8220;Autoship Cloud and the Qpilot team provide an amazing plugin with some of the best support I have ever received. They have developers in the USA that write amazing, fast, and clean code and they will continue to support your custom modifications after its been paid for. These guys are top notch, you will not regret this plugin.&#8221; &#8211; <a href=\"https://www.algaebarn.com/\" rel=\"nofollow ugc\">AlgaeBarn</a></p>\n<p>This is how <a href=\"https://nuleafnaturals.com\" rel=\"nofollow ugc\">Nuleaf Naturals</a> used the Autoship Cloud plugin powered by QPilot to add 2,000 repeat orders in their first 2 months:</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/WgkPWbWiBT4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3><strong>Customer Subscription Portal that is Easy and Flexible</strong></h3>\n<p>&#8220;It’s easy for customers to choose autoship options at checkout and manage their autoship shipments (including adding and removing products).&#8221; &#8211; <a href=\"https://www.mintunmedia.com/\" rel=\"nofollow ugc\">Mintun Media</a></p>\n<p>Your customers can quickly view &amp; manage upcoming Autoship orders in My Account.  Managing upcoming repeat orders is easy, intuitive, and beautifully branded to match the shopping experience of your online store.</p>\n<p>You control which products your customers can add to their repeat orders. Automatically disable out of stock products, allow backorders, or simply select which products should not be allowed to be added to repeat orders.</p>\n<p>Display upcoming orders using WordPress Templates (which can be further styled and customized), or use one of our embedded display portals that we host for you!</p>\n<ul>\n<li>Change products &amp; future order dates/frequencies</li>\n<li>Change shipping &amp; delivery locations</li>\n<li>Update saved payment methods</li>\n<li>Customers can pause or cancel orders</li>\n<li>Customers can easily see and fix failed scheduled orders (like a payment failure)</li>\n</ul>\n<p>See our documentation on <strong><a href=\"https://support.autoship.cloud/article/461-how-customers-manage-scheduled-orders\" rel=\"nofollow ugc\">How Customers Manage Scheduled Orders</a></strong>.</p>\n<h3>Quickly Launch Subscribe and Save and Repeat Deliveries</h3>\n<p>Autoship syncs with your existing WooCommerce product inventory, so all you have to do is choose what products you want to turn on for Autoship. No additional plugins or setup needed to launch product subscriptions and repeat delivery options</p>\n<ul>\n<li>Enable only specific products and variations</li>\n<li>Bulk enable all products &amp; variants globally</li>\n<li>Option to offer pricing discounts at checkout, recurring orders, or both</li>\n<li>Sync product prices in real-time and optionally update product prices for existing Scheduled Orders and product subscriptions</li>\n</ul>\n<p>See how easy this is to do with our <a href=\"https://support.autoship.cloud/article/448-7-enabling-products-for-autoship\" rel=\"nofollow ugc\"><strong>Install and Launch Guide</strong></a></p>\n</p>\n<p>Once a product is enabled for Autoship, you will see options on the product page for your customers to select &#8220;Autoship&#8221; (or another label you choose) and pick their repeat order frequency.</p>\n<p>You can also choose to display the same options in your Cart as an &#8220;upsell&#8221; option before customers checkout. Use our preset templates that match your theme&#8217;s styling, or customize it for the buying experience you want!</p>\n<p><strong>Autoship in the Cart:</strong></p>\n</p>\n<h3><strong>Customer Email Notifications <a href=\"https://sendgrid.com/\" rel=\"nofollow ugc\">powered by SendGrid®</a></strong></h3>\n<p>Send customers detailed email notifications about their repeat orders and subscription products.  Easily customize to your brand using our free template customizer and excellent deliverability rates thanks to our built-in integration with SendGrid® &#8211; included free with your subscription to Autoship Cloud&#8217;s hosted service, QPilot.</p>\n</p>\n<ul>\n<li><strong>Advanced Notices for Upcoming Orders:</strong> Send customers email notifications about upcoming order (Option to add 10-Day, 2-day, 1-day and Custom Day advance email notifications.)</li>\n<li><strong>Failed Orders and Payments:</strong> Let customers know about issues with payments, products or shipments so they can self-service their repeat orders.  Our customer email notifications even include steps in each message to help customers solve their own issues!</li>\n<li>&#8216;<strong>Changeable Before&#8217; Order Notices:</strong> Let customers know how many days they have to make changes to upcoming orders.  This feature is for site&#8217;s using the advanced order processing option for &#8220;Lock Duration&#8221;.</li>\n<li><strong>Option to BCC your support team on Customer Emails:</strong> want to keep track of customer email messages yourself?  Enter a BCC email to include your support team&#8217;s email with each notification!</li>\n</ul>\n<h3>Automate Payments seamlessly with WooCommerce</h3>\n<p>Connect the same payment gateways that you use for WooCommerce Checkout to offer Autoship Customers a seamless payment experience.</p>\n<p>Autoship Customers can save payment methods to pay for future orders at checkout automatically as well as add new payment methods saved in My Account whenever they need to update their upcoming Autoship Scheduled Orders.</p>\n<ul>\n<li>Over 10+ Popular Payment Gateways Supported (Stripe, Authorize.Net, CIM, Square, PayPal Express Checkout, Braintree, and NMI)</li>\n<li>Automated Customer Email Notifications</li>\n<li>Deep knowledgebase of support articles to help customers and merchants solve payment issues</li>\n<li>Manual Payment Method Entry Supported</li>\n</ul>\n<p>See our documentation on the <a href=\"https://support.autoship.cloud/article/334-payment-integrations\" rel=\"nofollow ugc\"><strong>Payment Integrations</strong></a> we support and how we manage them.</p>\n<h3>Automated Shipping and Delivery for the Best Customer Experience</h3>\n<p>Automate shipping &amp; delivery for Autoship Customers!   With Autoship Cloud, customers always receive the best shipping rate for their shipping address or delivery location automatically.  If an Autoship Customer&#8217;s repeat order is changed, their shipping rate is automatically recalculated and applied for them.</p>\n<ul>\n<li>Flat Rates, Table Rates, and carrier integrations</li>\n<li>Shipping zones and multi-postcode support</li>\n<li>Product shipping classes</li>\n<li>New! Use ShipperHQ to integrate over 50+ global carriers</li>\n<li>Merchant can update available shipping method at any time</li>\n<li>Any order or address changes recalculate shipping every time</li>\n</ul>\n<p>Please visit our documentation for more information on <a href=\"https://docs.qpilot.cloud/docs/shipping-rates\" rel=\"nofollow ugc\"><strong>How Shipping Rates Work</strong></a>.</p>\n<h3>Zapier Integration &amp; Webhooks</h3>\n<ul>\n<li>Zapier Integration &#8211; <a href=\"https://autoship.cloud/news/automate-your-win-back-campaigns-using-klaviyo-and-qpilots-zapier-app/\" rel=\"nofollow ugc\">see how to power amazing email campaigns</a> in Klaviyo using Autoship Cloud + Zapier.</li>\n<li>Extend Automations and Integrations using the QPilot API and over 12 Webhook Triggers\n<ul>\n<li><a href=\"https://docs.QPilot.cloud\" rel=\"nofollow ugc\">API</a></li>\n<li><a href=\"https://docs.qpilot.cloud/reference/annex-d-working-with-webhooks\" rel=\"nofollow ugc\">Webhooks</a>\n<ul>\n<li>For example: fire Webhook whenever a Scheduled Order is Created, or when an item on a Scheduled Order is updated</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h3>How Autoship Processes Repeat Orders: Advanced Automation</h3>\n<p>The Autoship Cloud plugin&#8217;s hosted service, QPilot, processes orders using your site&#8217;s the WooCommerce REST API (link to WC REST API). This enables repeat order processing to take place in the cloud so that your site doesn&#8217;t get bogged down running tons of code and cron jobs just to process repeat orders. It&#8217;s also a really nice backup just in case your site has any issues &#8211; your repeat orders are still hosted &amp; protected in the cloud!</p>\n<p>When a repeat order is due to process, the order shows up in your WooCommerce Orders just like an order that came through the checkout &#8211; process, fulfill and track repeat orders just as you normally do.</p>\n<ul>\n<li>Notify customers (n) days before their order processes</li>\n<li>Only a few functions on the checkout page to keep your site load speed fast!</li>\n<li>Set time of day to process repeat orders daily</li>\n<li>Start processing orders in advance of their next occurrence date.  Great for business that need a day or two to fulfill and ship orders.</li>\n<li>Set a custom &#8220;changeable before&#8221; option for your site to prevent changes to upcoming orders X days before they ship.  Includes a feature to send a custom email notification to let your customers know how much time they have to make changes!</li>\n<li>Orders processed via the <a href=\"https://docs.woocommerce.com/document/woocommerce-rest-api/\" rel=\"nofollow ugc\">WooCommerce REST API</a> means that your site can easily scale to process many repeat orders without stressing your WordPress site or hosting!  No more headaches with the WordPress Cron or Action Schedulers dragging your site performance.</li>\n</ul>\n<p>It&#8217;s easy to view and track checkout orders that originate Autoship and Product Subscriptions as well as orders created (via the WooCommerce REST API) from processing repeat Scheduled Orders. See an explanation of that in-depth on our documentation: <a href=\"https://support.autoship.cloud/article/463-how-scheduled-orders-are-linked-to-woocommerce-orders\" rel=\"nofollow ugc\"><strong>How Scheduled Orders are Linked to WooCommerce Orders</strong></a>.</p>\n<p>For detailed and technical information on how Autoship Cloud&#8217;s hosted service, QPilot, processes orders with WooCommerce, please see our full documentation here: <a href=\"https://support.autoship.cloud/article/535-how-an-autoship-scheduled-order-is-processed\" rel=\"nofollow ugc\"><strong>How an Autoship Scheduled Order is Processed</strong></a>.</p>\n<h3>Customizable Order Scheduling &amp; Repeat Frequency Options</h3>\n<p>Craft the subscriber experience you want for repeat orders and deliveries with standard or customized order dates and frequency options. Control what customers see at checkout or what is available to be changed through the customer portal.</p>\n<p>Customer can change their upcoming order dates or frequency to get products delivered on their schedule. Lower your subscription order churn by letting customers use the frequencies that best match their need.</p>\n<p>With Autoship Cloud, your customers have complete control &amp; flexibility within the rules that you set for repeat ordering dates &amp; frequencies.</p>\n<ul>\n<li>Customer can update at any time</li>\n<li>Daily, weekly, or monthly options</li>\n<li>Customize the frequencies you offer</li>\n<li>Limit options or leave them wide open</li>\n<li>Options by specific products, category, or storewide</li>\n</ul>\n<h3>Product &amp; Inventory Sync</h3>\n<p>Autoship Cloud automatically syncs with your WooCommerce product data, stock status &amp; inventory so that you can offer Autoship options and product subscriptions for the products you already sell.</p>\n<p>Product data is synchronized with your WooCommerce store in real-time, so you have full control over which products are available to Autoship Customers on your product pages and on future scheduled orders.</p>\n<ul>\n<li>Real-Time sync for stock status and Inventory Count</li>\n<li>Out-of-stock products automatically excluded from repeat order processing</li>\n<li>Allow Backorders? We support that too!</li>\n<li>Enable specific products or variations for Autoship and exclude others</li>\n</ul>\n<h3>Coupons for Repeat Customers and Ordering</h3>\n<p>Incentivize the buying behavior you want with coupons created by Autoship Cloud. Increase conversions, average order value, and reward repeat customers in the ways that match your business needs.</p>\n<p>Whether you want to win a new customer or reward your best ones, Autoship Cloud makes coupons flexible and easy.</p>\n<p>See all of the ways <a href=\"https://docs.qpilot.cloud/docs/coupon-reference-guide\" rel=\"nofollow ugc\"><strong>coupons can be configured</strong></a> with Autoship Cloud.</p>\n<ul>\n<li>Apply to subtotal, shipping, or individual products</li>\n<li>Discounts can be one-time or repeat, and limited by use</li>\n<li>Give flat amount or percentage coupons</li>\n<li>Set minimums on item count, price, or weight</li>\n<li>Coupons created in Autoship only apply to Autoship items</li>\n</ul>\n<h3>Marketing Tools to Upsell &amp; Retain Repeat Customers</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/wWRrU_-J3Kc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;start=5&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Increase the value of repeat customers with Autoship&#8217;s upsell capabilities. A no-code solution that lets you create a link to any product in your store. When customers click that link, that product is added to their upcoming scheduled order.</p>\n<p>Send the link via email, text, or chat. Make it one-click easy to upsell your existing customers.</p>\n<ul>\n<li>Offer single-use or subscription items</li>\n<li>Increase average order size with a single click</li>\n<li>Gift loyal customers one-time products</li>\n<li>Reduce friction on upsells for repeat customers: Add products subscriptions right to the cart with frequencies already applied</li>\n<li>Add products on repeat to existing subscription orders</li>\n<li>And more&#8230; get creative with how you upsell to your Autoship Customers!</li>\n</ul>\n<h3>Reports &amp; Forecasting So You Can Plan for Repeat Customers</h3>\n<p>Growing repeat revenue and managing customer relationships requires effective reporting. Autoship Cloud makes it possible to see the following:</p>\n<ul>\n<li>Inventory Forecasting &#8211; see what items are upcoming on scheduled orders</li>\n<li>See which products have high Total Scheduled quantities that are Active versus products with high Total Scheduled quantities that are paused or failed</li>\n<li>Customer metrics like LTV, when an order was first created, order count, and more!</li>\n<li>Event logs to see when scheduled orders are changed and by whom</li>\n<li>Total revenue dashboard</li>\n</ul>\n<p><strong>See all the <a href=\"https://docs.qpilot.cloud/docs/introduction-to-reports\" rel=\"nofollow ugc\">reports and information</a> available on Autoship Cloud.</strong></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/autoship-cloud.2.6.6.zip",
    "upgrade_notice": {
        "1.0.0": "<p>Limited release has been deprecated. Users should upgrade to the latest stable release.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/autoship-cloud/assets/screenshot-1.png?rev=1799183",
            "caption": "“Subscribe and Save” is quick to offer for any product or variation. Offer discounts for subscribing to products at checkout and an future repeat orders."
        },
        {
            "src": "https://ps.w.org/autoship-cloud/assets/screenshot-2.gif?rev=1799183",
            "caption": "Product subscriptions can be displayed in your cart.  Upsell repeat orders with scheduling choices to customers about to checkout."
        }
    ],
    "tags": {
        "repeat-delivery": "repeat delivery",
        "subscribe-and-save": "subscribe and save",
        "subscription-box": "subscription Box",
        "subscriptions": "subscriptions",
        "woocommerce-subscriptions": "woocommerce subscriptions"
    },
    "stable_tag": "2.6.6",
    "versions": {
        "1.0.10": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.10.zip",
        "1.0.11": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.11.zip",
        "1.0.12": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.12.zip",
        "1.0.13": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.13.zip",
        "1.0.14": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.14.zip",
        "1.0.15": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.15.zip",
        "1.0.16": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.16.zip",
        "1.0.17": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.17.zip",
        "1.0.18": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.18.zip",
        "1.0.18-6-g38f451f": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.18-6-g38f451f.zip",
        "1.0.19": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.19.zip",
        "1.0.20": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.20.zip",
        "1.0.21": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.21.zip",
        "1.0.22": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.22.zip",
        "1.0.23": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.23.zip",
        "1.0.24": "https://downloads.wordpress.org/plugin/autoship-cloud.1.0.24.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/autoship-cloud.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/autoship-cloud.1.1.1.zip",
        "2..2": "https://downloads.wordpress.org/plugin/autoship-cloud.2..2.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/autoship-cloud.2.4.1.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/autoship-cloud.2.4.2.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/autoship-cloud.2.4.3.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/autoship-cloud.2.5.0.zip",
        "2.5.01": "https://downloads.wordpress.org/plugin/autoship-cloud.2.5.01.zip",
        "2.5.3": "https://downloads.wordpress.org/plugin/autoship-cloud.2.5.3.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/autoship-cloud.2.6.0.zip",
        "2.6.1": "https://downloads.wordpress.org/plugin/autoship-cloud.2.6.1.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/autoship-cloud.2.6.2.zip",
        "2.6.3": "https://downloads.wordpress.org/plugin/autoship-cloud.2.6.3.zip",
        "2.6.4": "https://downloads.wordpress.org/plugin/autoship-cloud.2.6.4.zip",
        "2.6.5": "https://downloads.wordpress.org/plugin/autoship-cloud.2.6.5.zip",
        "2.6.6": "https://downloads.wordpress.org/plugin/autoship-cloud.2.6.6.zip",
        "trunk": "https://downloads.wordpress.org/plugin/autoship-cloud.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://autoship.cloud",
    "banners": {
        "low": "https://ps.w.org/autoship-cloud/assets/banner-772x250.png?rev=2232500",
        "high": "https://ps.w.org/autoship-cloud/assets/banner-1544x500.png?rev=2232500"
    },
    "icons": {
        "1x": "https://ps.w.org/autoship-cloud/assets/icon.svg?rev=2232500",
        "svg": "https://ps.w.org/autoship-cloud/assets/icon.svg?rev=2232500"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 90,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}