{
    "name": "AwareID &#8211; Biometric Identity Authentication",
    "slug": "awareid-wc-integration",
    "version": "2.1.5",
    "author": "Aware",
    "author_profile": "https://profiles.wordpress.org/jhicksaware/",
    "contributors": {
        "jhicksaware": {
            "profile": "https://profiles.wordpress.org/jhicksaware/",
            "avatar": "https://secure.gravatar.com/avatar/3721e44a0c7d4d72f34099ad0c68f90c?s=96&d=monsterid&r=g",
            "display_name": "jhicksaware"
        }
    },
    "requires": "5.0",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/awareid-wc-integration/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 0,
    "downloaded": 0,
    "last_updated": "2024-08-30 23:16:00",
    "added": "2024-08-30",
    "homepage": "",
    "sections": {
        "description": "<p>Integrate AwareID&#8217;s Identity Verification plugin into your WordPress environment for robust, multi-layered security. Our solution verifies user identities using AI-powered facial biometrics and document authentication, ensuring compliance and fraud prevention from login to checkout. Tailored to meet your specific business requirements, AwareID provides account protection while maintaining a seamless, frictionless experience for your users.</p>\n<h3>Strenthen Security and Compliance</h3>\n<p>Designed for WooCommerce implementations that demand high-security identity verification, this plugin uses biometric technology to ensure that only verified individuals can complete purchases.</p>\n<p>AwareID (https://www.aware.com/biometric-identity-management-as-a-service/) integrates seamlessly with WooCommerce, offering:</p>\n<ul>\n<li>KYC Compliance</li>\n<li>ID Document Verification </li>\n<li>Multi-Modal Biometric Authentication</li>\n<li>Biometric Face Matching &amp; Face Liveness</li>\n<li>Geofencing, Device Risk, and Fraud Prevention </li>\n</ul>\n<p>Create customizable workflows, intuitive point-and-click configuration, and advanced biometric security settings. This plugin empowers you to tailor verification processes to align with your specific business needs, ensuring safe and compliant transactions.</p>\n<h3>Why Aware?</h3>\n<p><strong>Trusted by Industry Leaders</strong>: Our technology safeguards critical systems for clients such as NASA, government agencies, and over 150 law enforcement agencies worldwide.</p>\n<p><strong>30 Years of Trusted Innovation</strong>: Established over three decades ago, Aware has been a trusted leader in biometric security, relied upon by top organizations globally.</p>\n<p><strong>In-House Expertise, Developed in the USA</strong>: All solutions are developed by Aware’s expert team in the United States, ensuring the highest standards of quality, security, and innovation.</p>\n<h3>Prerequisites</h3>\n<p>Before installing the plugin, ensure you meet the following requirements:<br />\n&#8211; An active WooCommerce installation on your WordPress site.<br />\n– An active AwareID account with appropriate credentials.</p>\n<p>Please reach out to <a href=\"https://www.aware.com/contact/\" rel=\"nofollow ugc\">Aware</a> or email us (sales@aware.com) if you have not registered with our organization for biometric authentication. This is crucial as the plugin will not be able to operate without an AwareID login.</p>\n<h3>Configuring AwareID into WooCommerce</h3>\n<p>To set up the plugin, configure it with your AwareID account details to enable authentication requests.</p>\n<p><strong>Note</strong>: This section will detail configuration of AwareID into WooCommerce only and will serve to make sure your WordPress site can connect to AwareID to authenticate consumers when configured. When you become an Aware customer, your Customer Onboarding includes configuration of the AwareID product to meet your use case and business objectives. This is a critical step to receiving successful authentication results  and should be done prior to configuring AwareID on your WordPress site.</p>\n<p>Once you are logged into your AwareID Admin Account, navigate to the AwareID Settings Panel, then to the WordPress Admin section. On this menu page, please input the following details:</p>\n<ol>\n<li><strong>AwareID Domain</strong>: Input the base URL for your AwareID service.<br />\nExample: https://awareid-yourdomain.aware-apis.com</li>\n<li><strong>AwareID Account</strong>: Specify the account name associated with your AwareID environment. </li>\n<li><strong>Client Secret</strong>: Enter the client secret key provided by AwareID. Note: This key is unique to your configuration and a vital component of securing your instance and the sensitive personal information of your customers. Please keep it confidential.  </li>\n<li><strong>API Key</strong>: Enter the API key which is another critical credential for connecting with AwareID. Note: This key is unique to your configuration and a vital component of securing your instance and the sensitive personal information of your customers. Please keep it confidential. </li>\n<li><strong>GeoCode Earth API Key</strong>: If your configuration will be utilizing Aware’s GeoFencing feature, you need to have a GeoCode earth API key. This will be supplied to you by our Customer Onboarding Team if you are using this functionality. </li>\n<li><strong>IP Info API Key</strong>: If your configuration will be utilizing Aware’s GeoFencing feature, and you wish to utilize the geolocation functionality, you need to have a IpInfo API Key. This will be supplied to you by our Customer Onboarding Team if you are utilizing this functionality. </li>\n<li><strong>Update Public Key</strong>: Press update public key button to update public key for encrypted face capture.</li>\n</ol>\n<h3>Features</h3>\n<ul>\n<li><strong>Secure Customer Authentication</strong>: Integrates with the WooCommerce cart or checkout flow to add an enhanced layer of security. </li>\n<li><strong>Seamless Checkout</strong>: Enable identity verification via face and document for both guests and registered users. </li>\n<li><strong>Age Restriction &amp; ID Document Verification</strong>: Set age restrictions to prevent access to the site with sophisticated document reading capabilities.  </li>\n<li><strong>Location-based Security</strong>: Set states from which the customer will be denied access to checkout and logging in depending on geographic location.</li>\n</ul>\n<h3>User Workflow</h3>\n<ul>\n<li><strong>Guest Checkout</strong>: Guests are prompted to verify their identity via face and document recognition during their first checkout. This verification may not be required on subsequent visits, depending on the settings.  </li>\n<li><strong>Registered User Checkout</strong>: Users logged in but not verified are required to verify their identity before proceeding with checkout. Restrictions based on age and geographic location are enforced.</li>\n</ul>\n<h3>Admin Functionality</h3>\n<p>Through the AwareID Settings panel, you can configure:</p>\n<ul>\n<li><strong>GeoFencing Settings</strong>: Define states or regions where access should be restricted.</li>\n<li><strong>Age Restrictions</strong>: Set a minimum age requirement for checkout.</li>\n<li><strong>ReValidation Settings</strong>: Choose intervals at which users must revalidate their identity.</li>\n<li><strong>Identity Verification</strong>: Confirm user identities through multimodal biometrics or document checks.</li>\n</ul>\n<h3>Detailed Service Integration Points</h3>\n<p>This section provides specific details about the integration points where our plugin communicates with external services, particularly the AwareID SaaS platform. Understanding these points will help users ensure compliance with relevant legal and data protection standards.</p>\n<h3>Authentication with AwareID using OpenID Connect</h3>\n<p>Purpose: Utilizes OpenID Connect protocol to authenticate users securely by generating JSON Web Tokens (JWTs). This method verifies user identities with high integrity.<br />\nEndpoint Usage: The plugin constructs $openid_url for token generation, essential for user sessions:</p>\n<p>Examples:<br />\n$openid_url = $awareIDConfig[&#8216;domain&#8217;] . &#8216;auth/realms/&#8217; . $awareIDConfig[&#8216;realm&#8217;] . &#8216;/protocol/openid-connect/token&#8217;<br />\n$openid_url = $domain . &#8216;auth/realms/&#8217; . $realm . &#8216;/protocol/openid-connect/token&#8217;;</p>\n<p>Security Note: URLs and realm identifiers are set during configuration to ensure custom, secure environments per customer.</p>\n<h3>Third-Party Services and Libraries</h3>\n<p>This plugin uses a hybrid architecture, combining WordPress functionality with external services and client-side components for enhanced security and performance. It relies on the following third-party services and libraries:</p>\n<p><strong>Server-Side Processing</strong>:<br />\nAwareID (Managed by Final Customers)</p>\n<p>This plugin utilizes AwareID, a SaaS platform developed by Aware, Inc., which facilitates bbiometric verification. Below, you’ll find general details about Aware, Inc. and a note on the AwareID platform’s specific usage.</p>\n<p>Purpose: AwareID is used to accurately and securely process biometrics including face, document, voice, and device profiling.</p>\n<p><strong>General Website</strong>: https://aware.com/<br />\n<strong>General Terms of Service</strong>: https://www.aware.com/terms-and-conditions/<br />\n<strong>General Privacy Policy</strong>: https://www.aware.com/dataprivacy/</p>\n<p>– Note: The specific terms of service and privacy policies for AwareID services are managed and provided by each Aware Business Client. Users of this plugin must consult the specific AwareID environment managed by the service provider they are interacting with to review applicable terms and privacy policies.</p>\n<p><strong>GeoCode Earth</strong></p>\n<p><strong>Purpose</strong>: Used for geofencing functionality to determine user location.<br />\n<strong>Website: https</strong>://geocode.earth/<br />\n<strong>Terms of Service</strong>: https://geocode.earth/terms/<br />\n<strong>Privacy Policy</strong>: https://geocode.earth/privacy/</p>\n<p><strong>IPInfo.io</strong></p>\n<p><strong>Purpose</strong>: Used as a fallback for geolocation when HTML5 geolocation is unavailable or denied.<br />\n<strong>Website</strong>: https://ipinfo.io/<br />\n<strong>Terms of Service</strong>: https://ipinfo.io/terms-of-service<br />\n<strong>Privacy Policy</strong>: https://ipinfo.io/privacy-policy</p>\n<p><strong>Client-Side Components</strong>:<br />\n<strong>KnomiWeb</strong> (Non-GPL)</p>\n<p><strong>Purpose</strong>: Used for face capture during the biometric verification process.<br />\n<strong>Hosting</strong>: Hosted on Aware Inc.&#8217;s CDN<br />\n<strong>License</strong>: Proprietary (non-GPL)<br />\n<strong>Note</strong>: This library is loaded from our CDN and is not included in the plugin files.</p>\n<p><strong>Regula Document Reader SDK</strong> (Non-GPL)</p>\n<p><strong>Purpose</strong>: Used for document capture and verification during the authentication process.<br />\n<strong>License</strong>: Proprietary (non-GPL)<br />\n<strong>Website</strong>: https://regulaforensics.com/products/document-reader-sdk/</p>\n<p>This architecture allows us to leverage secure cloud processing while maintaining the responsiveness needed for biometric capture and initial verification.</p>\n<h3>User Consent and Control</h3>\n<p>We are committed to transparency in our use of biometric authentication:</p>\n<p>Consent: Clear user consent is required before any biometric data is collected in most jurisdictions. The Aware Business Client is required to obtain these consents from consumers in advance of biometric data collection and ensure users are fully informed about the data collection process before they proceed.<br />\nCore Functionality: Biometric verification is an integral part of this plugin&#8217;s security measures. Users who do not wish to use biometric verification should not install or should uninstall this plugin.<br />\nData Deletion: Users can request complete deletion of their biometric data by contacting the site administrator.<br />\nTransparency: We provide clear information about data collection, processing, and storage practices in our privacy policy.</p>\n<h3>Support</h3>\n<p>For technical support or further assistance, please contact support@aware.com.</p>\n<h3>Data Handling and Privacy</h3>\n<p>Our plugin facilitates the secure authentication process by connecting your WordPress site with AwareID&#8217;s backend services. It&#8217;s important to note that this plugin does not store sensitive data itself:</p>\n<ul>\n<li>Data Processed: The plugin helps collect facial biometrics, document images, and geolocation data for verification purposes.</li>\n<li>Data Transmission: Collected data is securely transmitted to AwareID&#8217;s servers for processing.</li>\n<li>Backend Processing and Storage: All data processing and storage occur on AwareID&#8217;s secure servers, not within WordPress or this plugin.</li>\n<li>Data Policies: Retention periods, user rights, and compliance measures are managed by the individual AwareID service provider (your company or contracted service).</li>\n<li>Plugin&#8217;s Role: This plugin acts as a facilitator, enabling the connection between your WordPress site and the AwareID backend. It does not store or manage the sensitive data itself.</li>\n</ul>\n<p>Important Note: Important Note: As the site administrator and as the Aware Business Client, you are responsible for ensuring that your use of AwareID services, including data handling and retention policies, complies with relevant regulations such as GDPR and CCPA. Please review your internal policies and procedures to ensure appropriate consult with your specific AwareID service provider for details on their data handling practices and to set up appropriate privacy policies for your users.</p>\n",
        "changelog": "<h4>2.2.0</h4>\n<ul>\n<li>Enhancement: Full support for block based WooCommerce.</li>\n<li>Fix: Fixed issue with email not being sent on automatic account creation.</li>\n</ul>\n<h4>2.1.5</h4>\n<ul>\n<li>Enhancement: Removed lottie, using base gif.</li>\n<li>Fix: Various bug fixes.</li>\n</ul>\n<h4>2.1.4</h4>\n<ul>\n<li>Fix: Fixed issue with DotLottie player hosted locally.</li>\n</ul>\n<h4>2.1.3</h4>\n<ul>\n<li>Functionality: Updated initial checkout logic to include a consent and information dialog.</li>\n<li>Security: Unescaped nonce fixed.</li>\n<li>Enhancement: Removed CDN links for Lottie images and Regula.</li>\n<li>Fix: Updated more function names.</li>\n<li>Fix: Changed Lottie .mjs to .js.</li>\n</ul>\n<h4>2.1.2</h4>\n<ul>\n<li>Security: Fixed unescaped function &#8211; awareid_ts_custom_checkout_button()</li>\n</ul>\n<h4>2.1.1</h4>\n<ul>\n<li>Security: Added nonce to search and pagination.</li>\n<li>Testing: Tested with WordPress 6.6</li>\n</ul>\n<h4>2.1.0</h4>\n<ul>\n<li>Security: Updated IP Info API Key to no longer be hard coded.</li>\n<li>Security: Improved escaping throughout the plugin.</li>\n<li>Enhancement: Removed CDN links for Bootstrap, Font Awesome, Select2, and Lottie Player, now using local files.</li>\n<li>Enhancement: Hosted KnomiWeb on CDN as it is a non-GPL service.</li>\n<li>Fix: Corrected text domain issues for better internationalization.</li>\n<li>\n<p>Fix: Updated generic function names to be more specific to the plugin.</p>\n</li>\n<li>\n<p>2.0.0 Initial release.</p>\n</li>\n</ul>\n"
    },
    "short_description": "Short Description: Boost WooCommerce security via AwareID integration, offering advanced authentication through seamless biometric verification.",
    "description": "<p>Integrate AwareID&#8217;s Identity Verification plugin into your WordPress environment for robust, multi-layered security. Our solution verifies user identities using AI-powered facial biometrics and document authentication, ensuring compliance and fraud prevention from login to checkout. Tailored to meet your specific business requirements, AwareID provides account protection while maintaining a seamless, frictionless experience for your users.</p>\n<h3>Strenthen Security and Compliance</h3>\n<p>Designed for WooCommerce implementations that demand high-security identity verification, this plugin uses biometric technology to ensure that only verified individuals can complete purchases.</p>\n<p>AwareID (https://www.aware.com/biometric-identity-management-as-a-service/) integrates seamlessly with WooCommerce, offering:</p>\n<ul>\n<li>KYC Compliance</li>\n<li>ID Document Verification </li>\n<li>Multi-Modal Biometric Authentication</li>\n<li>Biometric Face Matching &amp; Face Liveness</li>\n<li>Geofencing, Device Risk, and Fraud Prevention </li>\n</ul>\n<p>Create customizable workflows, intuitive point-and-click configuration, and advanced biometric security settings. This plugin empowers you to tailor verification processes to align with your specific business needs, ensuring safe and compliant transactions.</p>\n<h3>Why Aware?</h3>\n<p><strong>Trusted by Industry Leaders</strong>: Our technology safeguards critical systems for clients such as NASA, government agencies, and over 150 law enforcement agencies worldwide.</p>\n<p><strong>30 Years of Trusted Innovation</strong>: Established over three decades ago, Aware has been a trusted leader in biometric security, relied upon by top organizations globally.</p>\n<p><strong>In-House Expertise, Developed in the USA</strong>: All solutions are developed by Aware’s expert team in the United States, ensuring the highest standards of quality, security, and innovation.</p>\n<h3>Prerequisites</h3>\n<p>Before installing the plugin, ensure you meet the following requirements:<br />\n&#8211; An active WooCommerce installation on your WordPress site.<br />\n– An active AwareID account with appropriate credentials.</p>\n<p>Please reach out to <a href=\"https://www.aware.com/contact/\" rel=\"nofollow ugc\">Aware</a> or email us (sales@aware.com) if you have not registered with our organization for biometric authentication. This is crucial as the plugin will not be able to operate without an AwareID login.</p>\n<h3>Configuring AwareID into WooCommerce</h3>\n<p>To set up the plugin, configure it with your AwareID account details to enable authentication requests.</p>\n<p><strong>Note</strong>: This section will detail configuration of AwareID into WooCommerce only and will serve to make sure your WordPress site can connect to AwareID to authenticate consumers when configured. When you become an Aware customer, your Customer Onboarding includes configuration of the AwareID product to meet your use case and business objectives. This is a critical step to receiving successful authentication results  and should be done prior to configuring AwareID on your WordPress site.</p>\n<p>Once you are logged into your AwareID Admin Account, navigate to the AwareID Settings Panel, then to the WordPress Admin section. On this menu page, please input the following details:</p>\n<ol>\n<li><strong>AwareID Domain</strong>: Input the base URL for your AwareID service.<br />\nExample: https://awareid-yourdomain.aware-apis.com</li>\n<li><strong>AwareID Account</strong>: Specify the account name associated with your AwareID environment. </li>\n<li><strong>Client Secret</strong>: Enter the client secret key provided by AwareID. Note: This key is unique to your configuration and a vital component of securing your instance and the sensitive personal information of your customers. Please keep it confidential.  </li>\n<li><strong>API Key</strong>: Enter the API key which is another critical credential for connecting with AwareID. Note: This key is unique to your configuration and a vital component of securing your instance and the sensitive personal information of your customers. Please keep it confidential. </li>\n<li><strong>GeoCode Earth API Key</strong>: If your configuration will be utilizing Aware’s GeoFencing feature, you need to have a GeoCode earth API key. This will be supplied to you by our Customer Onboarding Team if you are using this functionality. </li>\n<li><strong>IP Info API Key</strong>: If your configuration will be utilizing Aware’s GeoFencing feature, and you wish to utilize the geolocation functionality, you need to have a IpInfo API Key. This will be supplied to you by our Customer Onboarding Team if you are utilizing this functionality. </li>\n<li><strong>Update Public Key</strong>: Press update public key button to update public key for encrypted face capture.</li>\n</ol>\n<h3>Features</h3>\n<ul>\n<li><strong>Secure Customer Authentication</strong>: Integrates with the WooCommerce cart or checkout flow to add an enhanced layer of security. </li>\n<li><strong>Seamless Checkout</strong>: Enable identity verification via face and document for both guests and registered users. </li>\n<li><strong>Age Restriction &amp; ID Document Verification</strong>: Set age restrictions to prevent access to the site with sophisticated document reading capabilities.  </li>\n<li><strong>Location-based Security</strong>: Set states from which the customer will be denied access to checkout and logging in depending on geographic location.</li>\n</ul>\n<h3>User Workflow</h3>\n<ul>\n<li><strong>Guest Checkout</strong>: Guests are prompted to verify their identity via face and document recognition during their first checkout. This verification may not be required on subsequent visits, depending on the settings.  </li>\n<li><strong>Registered User Checkout</strong>: Users logged in but not verified are required to verify their identity before proceeding with checkout. Restrictions based on age and geographic location are enforced.</li>\n</ul>\n<h3>Admin Functionality</h3>\n<p>Through the AwareID Settings panel, you can configure:</p>\n<ul>\n<li><strong>GeoFencing Settings</strong>: Define states or regions where access should be restricted.</li>\n<li><strong>Age Restrictions</strong>: Set a minimum age requirement for checkout.</li>\n<li><strong>ReValidation Settings</strong>: Choose intervals at which users must revalidate their identity.</li>\n<li><strong>Identity Verification</strong>: Confirm user identities through multimodal biometrics or document checks.</li>\n</ul>\n<h3>Detailed Service Integration Points</h3>\n<p>This section provides specific details about the integration points where our plugin communicates with external services, particularly the AwareID SaaS platform. Understanding these points will help users ensure compliance with relevant legal and data protection standards.</p>\n<h3>Authentication with AwareID using OpenID Connect</h3>\n<p>Purpose: Utilizes OpenID Connect protocol to authenticate users securely by generating JSON Web Tokens (JWTs). This method verifies user identities with high integrity.<br />\nEndpoint Usage: The plugin constructs $openid_url for token generation, essential for user sessions:</p>\n<p>Examples:<br />\n$openid_url = $awareIDConfig[&#8216;domain&#8217;] . &#8216;auth/realms/&#8217; . $awareIDConfig[&#8216;realm&#8217;] . &#8216;/protocol/openid-connect/token&#8217;<br />\n$openid_url = $domain . &#8216;auth/realms/&#8217; . $realm . &#8216;/protocol/openid-connect/token&#8217;;</p>\n<p>Security Note: URLs and realm identifiers are set during configuration to ensure custom, secure environments per customer.</p>\n<h3>Third-Party Services and Libraries</h3>\n<p>This plugin uses a hybrid architecture, combining WordPress functionality with external services and client-side components for enhanced security and performance. It relies on the following third-party services and libraries:</p>\n<p><strong>Server-Side Processing</strong>:<br />\nAwareID (Managed by Final Customers)</p>\n<p>This plugin utilizes AwareID, a SaaS platform developed by Aware, Inc., which facilitates bbiometric verification. Below, you’ll find general details about Aware, Inc. and a note on the AwareID platform’s specific usage.</p>\n<p>Purpose: AwareID is used to accurately and securely process biometrics including face, document, voice, and device profiling.</p>\n<p><strong>General Website</strong>: https://aware.com/<br />\n<strong>General Terms of Service</strong>: https://www.aware.com/terms-and-conditions/<br />\n<strong>General Privacy Policy</strong>: https://www.aware.com/dataprivacy/</p>\n<p>– Note: The specific terms of service and privacy policies for AwareID services are managed and provided by each Aware Business Client. Users of this plugin must consult the specific AwareID environment managed by the service provider they are interacting with to review applicable terms and privacy policies.</p>\n<p><strong>GeoCode Earth</strong></p>\n<p><strong>Purpose</strong>: Used for geofencing functionality to determine user location.<br />\n<strong>Website: https</strong>://geocode.earth/<br />\n<strong>Terms of Service</strong>: https://geocode.earth/terms/<br />\n<strong>Privacy Policy</strong>: https://geocode.earth/privacy/</p>\n<p><strong>IPInfo.io</strong></p>\n<p><strong>Purpose</strong>: Used as a fallback for geolocation when HTML5 geolocation is unavailable or denied.<br />\n<strong>Website</strong>: https://ipinfo.io/<br />\n<strong>Terms of Service</strong>: https://ipinfo.io/terms-of-service<br />\n<strong>Privacy Policy</strong>: https://ipinfo.io/privacy-policy</p>\n<p><strong>Client-Side Components</strong>:<br />\n<strong>KnomiWeb</strong> (Non-GPL)</p>\n<p><strong>Purpose</strong>: Used for face capture during the biometric verification process.<br />\n<strong>Hosting</strong>: Hosted on Aware Inc.&#8217;s CDN<br />\n<strong>License</strong>: Proprietary (non-GPL)<br />\n<strong>Note</strong>: This library is loaded from our CDN and is not included in the plugin files.</p>\n<p><strong>Regula Document Reader SDK</strong> (Non-GPL)</p>\n<p><strong>Purpose</strong>: Used for document capture and verification during the authentication process.<br />\n<strong>License</strong>: Proprietary (non-GPL)<br />\n<strong>Website</strong>: https://regulaforensics.com/products/document-reader-sdk/</p>\n<p>This architecture allows us to leverage secure cloud processing while maintaining the responsiveness needed for biometric capture and initial verification.</p>\n<h3>User Consent and Control</h3>\n<p>We are committed to transparency in our use of biometric authentication:</p>\n<p>Consent: Clear user consent is required before any biometric data is collected in most jurisdictions. The Aware Business Client is required to obtain these consents from consumers in advance of biometric data collection and ensure users are fully informed about the data collection process before they proceed.<br />\nCore Functionality: Biometric verification is an integral part of this plugin&#8217;s security measures. Users who do not wish to use biometric verification should not install or should uninstall this plugin.<br />\nData Deletion: Users can request complete deletion of their biometric data by contacting the site administrator.<br />\nTransparency: We provide clear information about data collection, processing, and storage practices in our privacy policy.</p>\n<h3>Support</h3>\n<p>For technical support or further assistance, please contact support@aware.com.</p>\n<h3>Data Handling and Privacy</h3>\n<p>Our plugin facilitates the secure authentication process by connecting your WordPress site with AwareID&#8217;s backend services. It&#8217;s important to note that this plugin does not store sensitive data itself:</p>\n<ul>\n<li>Data Processed: The plugin helps collect facial biometrics, document images, and geolocation data for verification purposes.</li>\n<li>Data Transmission: Collected data is securely transmitted to AwareID&#8217;s servers for processing.</li>\n<li>Backend Processing and Storage: All data processing and storage occur on AwareID&#8217;s secure servers, not within WordPress or this plugin.</li>\n<li>Data Policies: Retention periods, user rights, and compliance measures are managed by the individual AwareID service provider (your company or contracted service).</li>\n<li>Plugin&#8217;s Role: This plugin acts as a facilitator, enabling the connection between your WordPress site and the AwareID backend. It does not store or manage the sensitive data itself.</li>\n</ul>\n<p>Important Note: Important Note: As the site administrator and as the Aware Business Client, you are responsible for ensuring that your use of AwareID services, including data handling and retention policies, complies with relevant regulations such as GDPR and CCPA. Please review your internal policies and procedures to ensure appropriate consult with your specific AwareID service provider for details on their data handling practices and to set up appropriate privacy policies for your users.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/awareid-wc-integration.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "authentication": "authentication",
        "awareid": "awareid",
        "biometric": "biometric",
        "security": "security",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/awareid-wc-integration/assets/banner-772x250.jpg?rev=3144505",
        "high": "https://ps.w.org/awareid-wc-integration/assets/banner-1544x500.jpg?rev=3144503"
    },
    "icons": {
        "1x": "https://ps.w.org/awareid-wc-integration/assets/icon-128x128.png?rev=3144503",
        "2x": "https://ps.w.org/awareid-wc-integration/assets/icon-256x256.png?rev=3144503"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}