{
    "name": "BAAP Mobile Version",
    "slug": "baap-mobile-version",
    "version": "2.0",
    "author": "<a href=\"http://http://howtoinstallwordpressplugin.com/wpmobile_plugin\">BAAP</a>",
    "author_profile": "https://profiles.wordpress.org/muthukumarnm/",
    "contributors": {
        "muthukumarnm": {
            "profile": "https://profiles.wordpress.org/muthukumarnm/",
            "avatar": "https://secure.gravatar.com/avatar/0c7817e34ad0ef482f2c31e2cd75bf20?s=96&d=monsterid&r=g",
            "display_name": "muthukumarnm"
        }
    },
    "requires": "2.5",
    "tested": "3.1.4",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/baap-mobile-version/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 70,
    "downloaded": 33607,
    "last_updated": "2011-04-06 2:37am GMT",
    "added": "2011-02-17",
    "homepage": "http://wordpress.org/extend/plugins/baap-mobile-version/",
    "sections": {
        "description": "<p>The BAAP Mobile Version is a complete toolkit to help mobilize your WordPress site and blog.</p>\n<p>It includes a mobile switcher to select themes based on the type of user that is visiting the site, a selection of mobile themes, extra widgets, device adaptation and a mobile administration panel to allow users to edit the site or write new posts when out and about.</p>\n<p>Features include:</p>\n<ul>\n<li>\n<p><strong>A mobile switcher</strong> which automatically suggests desktop or mobile presentation, but lets users switch to the other if required (and remembers their choice).</p>\n</li>\n<li>\n<p><strong>A set of advanced themes for Nokia and WebKit devices</strong>, designed by <a href=\"http://www.forum.nokia.com/Technology_Topics/Web_Technologies/Browsing/Web_Templates/\" title=\"Forum Nokia\" rel=\"nofollow ugc\">Forum Nokia</a>. These also look beautiful on Android, iPhone and Palm devices.</p>\n</li>\n<li>\n<p><strong>Device adaptation</strong>, including the rescaling of images, intelligent splitting of articles and posts into multiple pages, the simplifaction styles, and the removal of non-supported media.</p>\n</li>\n<li>\n<p><strong>A mobile admin panel</strong>, that allows the blog managers to access the admin interface via a mobile device, with simplified access to the most common features such as editing a post or approving comments.</p>\n</li>\n</ul>\n<p>Enjoying your site and blog in mobile.</p>\n<h3>Documentation</h3>\n<p>The pack is so-called because it contains a number of discrete pieces of functionality. In theory it is possible to individually enable or disable the components (through editing the registrations at the top of the main plugin file), but the vast majority of users are expected to install the pack en masse.</p>\n<p>The pack contains the following functionality:</p>\n<h4>Mobile switcher</h4>\n<p>The mobile switcher identifies whether the visitor to the site is mobile or not, and switches between the primary WordPress theme (for desktop users) and a mobile theme (of the site owner&#8217;s choice) accordingly.</p>\n<p>It can use two approaches to identify the user as mobile. Firstly, it can try to identify if they have a mobile device based on the headers sent when a page is requested. Alternatively, it can identify whether the user has requested the site on a &#8216;desktop domain&#8217; (such as yoursite.com) or a &#8216;mobile domain&#8217; (such as yoursite.mobi) and deduce their intent from that.</p>\n<p>The recommended approach is a third, combined, approach that uses both techniques, and also allows users to switch between sites if the choice is not appropriate by providing a link in the themes&#8217; footers or a widget.</p>\n<p>In this combined mode, the switcher will provide interstitial warning pages if a mobile user accesses the desktop domain or vice-versa. It will also remember their choice of preferred site through the use of a cookie.</p>\n<p>Settings for the switcher are found under the &#8216;Mobile Switcher&#8217; admin page, and are self-explanatory.</p>\n<p>More detail on these switching algorithms is available in a series of articles published by <a href=\"mobiForge\" rel=\"nofollow ugc\">http://mobiforge.com</a>.</p>\n<h4>Base mobile theme</h4>\n<p>The pack contains an extensible theme that is ready for display on mobile devices. The theme is XHTML-MP compliant and scores highly on dotMobi&#8217;s ready.mobi site tester.</p>\n<p>The base theme supports all standard WordPress content, including indexes, posts, pages, archives, search results, comments and widgets. If configured, it also invokes the device adaptation process (detailed below) that ensures the posts themselves are formatted suitable for mobile devices.</p>\n<p>There are a number of simple settings that can be used to adapt the way in which lists of posts appear on the mobile theme. These are found under the &#8216;Mobile Theme&#8217; admin page, which appears when the switcher component is installed (or when the mobile theme is selected as the main WordPress theme). It is possible to set how many posts appear on the home page and in archives, and how verbosely they display.</p>\n<p>Away from the posts themselves, the theme does not provide a &#8216;hard-coded&#8217; sidebar and relies wholly on the WordPress widget framework. Widgets that are selected in the WordPress admin pages (and then selected to show for the mobile theme) will appear in a &#8216;sidebar&#8217; below the main part of the mobile page.</p>\n<p>Since each widget adds size to the overall page, it is recommended that no more than 5 desktop widgets are enabled for the mobile theme. The &#8216;Mobile Widgets&#8217; admin page also appears when the switcher component is installed (or when the mobile theme is selected as the main WordPress theme).</p>\n<p>Any standard WordPress widgets that are known not to be XHTML-compliant are slightly rewritten by the theme to make them so. However, the theme does not currently correct arbitrary widget content and the use of third-party widgets (that were designed for desktop use) may easily push the overall page out of XHTML-MP compliance and affect the user&#8217;s experience.</p>\n<p>Large widgets are not currently split or paged for small mobile devices. This may increase the load time, cost to the user, or even make the page unreadable on a limited capability device. Be aware of this when enabling large widgets on the mobile theme.</p>\n<h4>Extended mobile themes</h4>\n<p>Simply by extending the base theme, it is very easy and quick to customise the mobile theme to fit existing requirements or brand.</p>\n<p>The easiest way to do this is to re-tint the theme&#8217;s colour scheme. The colour specifications for the base theme are all defined at the top of its stylesheet. Site owners can override this palette with their own colours, named DARKEST, DARK, MID, LIGHT, LIGHTEST and so on.</p>\n<p>To demonstrate, three extended themes are available within this pack: blue, green and red. Note how they use the &#8216;Template:&#8217; directive at the top of the stylesheet (and the CSS @import statement) to indicate that they extend the base theme.</p>\n<p>Of course it is also easy to extend the theme in other, more structural ways, and even adapt the template&#8217;s PHP files. However, if such changes should be done carefully to preserve XHTML-MP compliance within the markup.</p>\n<h4>Transcoding and device adaptation</h4>\n<p>When the base theme, or a theme that extends it, it used, the pack provides some features to adapt the content of the posts and pages of the blog to make them more suitable for mobile use.</p>\n<p>There are four major stages to this process, and each may be enabled or disabled independently on the &#8216;Mobile Theme&#8217; admin page. These are:</p>\n<ol>\n<li><strong>Remove media</strong> &#8211; This will remove interactivity and media elements (such as script, Flash, movies, and embedded frames) from the posts and pages. Unless it is certain that users have high-capability handsets, these types of content will stretch the abilities of their mobile devices. The HTML tags removed are object, embed, marquee, script, frame and iframe. This process also removes any event attributes (such as onClick) from the page.</li>\n<li><strong>Partition large pages</strong> &#8211; This will break large blog posts or pages into smaller pieces more suitable for mobile devices. The length of each piece depends on the known memory limitations of the visitor&#8217;s device (if DeviceAtlas integration is enabled), or will default to approximately 5K in size. Contiguous sections such as lists will not be broken, and a pager will appear at the bottom of each post to allow the user to page through the post.</li>\n<li><strong>Shrink images</strong> &#8211; This will shrink large images within posts or pages to fit on smaller screens. The width or height constraints of the device (if DeviceAtlas integration is enabled) are used to determine the new dimensions, or they will default to 124 pixels. This functionality relies on the server having the PHP graphics library LibGD installed (as it will be for PHP 4.3 or greater). Both the original and resized images are cached locally for performance, and site owners have an option to clear this cache on the admin page.</li>\n<li><strong>Simplify styling</strong> &#8211; This will remove styling elements from the posts and pages to ensure mobile compatibility. The HTML attributes removed are: align, background, bgcolor, border, cellpadding, cellspacing, class, color, height, style and width. It removes the following tags: center, font, and span (although note that the inner content of those tags remains). Finally it removes any empty, non-singleton tags that do not have attributes, such as, for example, <code>&amp;lt;div&amp;gt;&amp;lt;/div&amp;gt;</code>.</li>\n</ol>\n<h4>Mobile admin panel</h4>\n<p>A user identified as mobile by the switcher will receive a mobilised version of the WordPress administration interface. The link to the dashboard is available in the standard &#8216;Meta&#8217; widget, or it can be reached directly at <code>http://your.site/wp-admin</code></p>\n<p>Only users with administrator status are allowed to access the mobile administration pages. Note this makes it more restrictive than the desktop dashboard, but this prevents less-authorised users from accessing it and making changes to important site settings.</p>\n<p>The following pages are available in the mobile administration interface:</p>\n<ol>\n<li><strong>Overview</strong> &#8211; Like the desktop dashboard, this details how many pages, posts, categories and tags site owners have on the site. It also highlights how many comments currently await moderation.</li>\n<li><strong>New post</strong> &#8211; Administrators may write a new post to appear on the site. They can specify the title and the body of the post, and whether they want it to remain draft, pending review, or published. It is not currently possible to specify tags, categories or other advanced properties of the post in the mobile interface.</li>\n<li><strong>Edit post</strong> &#8211; This page lists all of the current posts and allows administrators to edit them. As for the &#8216;New post&#8217; page, they can edit title, status, and body. It is not possible to edit the categories or tags and so on, although existing values for such properties of the post will remain set after editing in the mobile interface. Depending on the theme, a link to this edit panel may also be available on the site itself when administrators are logged in.</li>\n<li><strong>Comments</strong> &#8211; This page lists extracts of all of the comments awaiting moderation on the site. From this list, administrators can click on the commentator&#8217;s name to see the whole comment, and, by clicking the appropriate links, set the comment to be published or marked as spam. Editing, de-approving or deleting a comment cannot be performed in this interface.</li>\n<li><strong>Switcher</strong> &#8211; It is possible to change the mobile switching mode in case the site-owner needs to reset the configuration.</li>\n<li><strong>Settings</strong> &#8211; This page lists all the settings for the site which are simple enough to edit with this mobile interface. Complex settings, such as which plugins are installed, are not available. However, text- and number-based settings can be easily edited. Note that no descriptions are available for each setting and the meanings of the values, so it is advisable to only edit them cautiously.</li>\n</ol>\n<p>It is also possible to log-out of the admin panel. Since the login is stored persistently on the mobile device, this is advisable if the site is sensitive and administrators want to protect against the impact of handset theft.</p>\n<p>The mobile administration panel uses the same URL structure as the desktop version, so in most cases, the administration links sent to administrators in emails (such as when a comment needs moderation) can be followed regardess of whether they are using a mobile device or a desktop.</p>\n<h4>Mobile ad widget</h4>\n<p>This provides the ability to place a new widget into the site containing either AdMob or Google mobile ads. Administrators will see the &#8216;Mobile Ads&#8217; in the &#8216;Widget&#8217; admin page, and it allows them to specify which provider to use, and the publisher ID.</p>\n<p>The widget can also be configured to attempt to disable itself when shown on a desktop theme. This is recommended, since the quality of mobile ads presented in response to a desktop user context is lower, and relevant conversion rates may be negatively affected.</p>\n<p>Google supports both single-ad and double-ad modes. Administrators can select which to use from the same publisher dropdown.</p>\n<h4>Barcode widget</h4>\n<p>Site owners can place a two-dimensional QR-code widget on the desktop site that users can use to quickly navigate to the mobile version of the site. If their phones have a camera and QR-code reader capabilities, they can simply snap the barcode off their desktop screen and navigate directly to the mobile equivalent.</p>\n<p>If a URL is specified, the QR-code is fixed to that address. If it is left blank, it will correspond to the page it is being displayed upon.</p>\n<p>Within the widget site owners can specify the link to provide, and the size of the square barcode to show. Site owners should ensure it fits well into the desktop theme.</p>\n<p>Site owners can also indicate whether they want the widget to show some instructions to the users about the purpose of the barcode, as well as a list of well-known readers they can download for their devices if they are not already installed.</p>\n",
        "installation": "<p><a href=\"http://howtoinstallwordpressplugin.com/wpmobile_plugin\" rel=\"nofollow ugc\">For Detailed step by step instructions for installtion please Click Here</a></p>\n<h4>Simple installation for WordPress v2.7 and later</h4>\n<ol>\n<li>Go to the &#8216;Plugins&#8217; / &#8216;Add new&#8217; menu</li>\n<li>Upload baap-mobile-version.zip then press &#8216;Install now&#8217;.</li>\n<li>Activate the switcher plugin. Change its settings as required.</li>\n<li>Select which desktop widgets are to appear on the mobile theme.</li>\n<li>Enable your site to be listed on mpexo.</li>\n<li>Enjoy.</li>\n</ol>\n<h4>Simple installation for WordPress v2.5 and v2.6</h4>\n<p>Here, the installation is very slightly different:</p>\n<ol>\n<li>Locate your WordPress install on the file system</li>\n<li>Extract the contents of baap-mobile-version.zip into wp-content/plugins</li>\n<li>Activate the switcher plugin. Change its settings as required.</li>\n<li>Select which desktop widgets are to appear on the mobile theme.</li>\n<li>Enable your site to be listed on mpexo.</li>\n<li>Enjoy.</li>\n</ol>\n<h4>Make the cache writable</h4>\n<p><strong>NB:</strong> the web server needs to have write-access to the image cache folder <code>wp-content/plugins/wordpress-mobile-pack/plugins/wpmp_transcoder/c</code>. If you have installed the plugin with WordPress 2.7, this should already be the case. Otherwise, or if you see errors when the plugin tries to resize images, you will need to set the permissions on that folder appropriately.</p>\n<p>Ensure that the <code>c</code> directory flags are <code>rwxrwxrwx</code>, or whatever you choose in order to be web-server-writable:</p>\n<pre><code>wordpress $&gt; cd wp-content/plugins\nplugins $&gt; cd wordpress-mobile-pack/plugins/wpmp_transcoder\nwpmp_transcoder $&gt; sudo chmod 777 c\nwpmp_transcoder $&gt; ls -al\n-----------------------------------------------------------------\ndrwxrwxrwx  3 root  staff    102 20 Apr 10:08 c\n-rwxrwxrwx  1 root  staff  13003 20 Apr 10:43 wpmp_transcoder.php&lt;/pre&gt;\n</code></pre>\n<h4>Make the themes directory writable</h4>\n<p><strong>NB:</strong> the web server also needs to have write-access to the themes folder <code>wp-content/themes</code>, as it installs themes in that directory as part of the plugin activation. If you have installed the plugin with WordPress 2.7, this may already be the case. Otherwise, or if you see errors when activating the plugin, you will need to set the permissions on that folder appropriately.</p>\n<p>Ensure that the <code>themes</code> flags are <code>rwxrwxrwx</code>, or whatever you choose in order to be web-server-writable, using a similar technique to that above.</p>\n<h4>Comprehensive setup</h4>\n<p>A more comprehensive setup process and guide to configuration is as follows. If you are installing the plugin through the admin dashboard, you&#8217;ll be able to skip most of the early steps.</p>\n<ol>\n<li>Locate your WordPress install on the file system</li>\n<li>Extract the contents of <code>baap-mobile-version.zip</code> into <code>wp-content/plugins</code></li>\n<li>In <code>wp-content/plugins</code> you should now see a directory named <code>baap-mobile-version</code></li>\n<li>Ensure the <code>wp-content/themes</code> directory and <code>wpmp_transcoder/c</code> cache directory are web-server-writable, as described above.</li>\n<li>Login to the WordPress admin panel at <code>http://yoursite.com/wp-admin</code></li>\n<li>Go to the &#8216;Plugins&#8217; menu.`</li>\n<li>You should see &#8216;Mobile Switcher&#8217; in the list. If not, check steps 2 and 3.`</li>\n<li>Click &#8216;Activate&#8217; for that plugin.`</li>\n<li>In <code>wp-content/themes</code> you should now see a selection of new directories including <code>mobile_pack_base</code>, <code>mobile_pack_blue</code> etc.</li>\n<li>Go to the &#8216;Themes&#8217; page in the &#8216;Appearance&#8217; menu (or &#8216;Design&#8217; in WordPress v2.6 or earlier)</li>\n<li>You should see a number of mobile themes in the list. If not, check steps 8 and the permissions on the theme directory. <strong>NB</strong> do NOT select one of these themes. If you do so, even your desktop users will receive a mobile theme. The selected theme here should reflect what you want your desktop users to continue to see, and you&#8217;ll configure the mobile theme choice separately in the switcher settings.</li>\n<li>Go to the &#8216;Mobile Switcher&#8217; page in the &#8216;Appearance&#8217; menu (or &#8216;Design&#8217; in WordPress v2.6 or earlier)</li>\n<li>Choose a switcher mode:\n<ul>\n<li>&#8216;Disabled&#8217; removes switching and all users receive the desktop theme</li>\n<li>&#8216;Browser detection&#8217; means that the switcher will try to identify if your user has a mobile device</li>\n<li>&#8216;Domain mapping&#8217; requires you to provide a different domain for your mobile users to access the site</li>\n<li>&#8216;BOTH&#8217; (recommended) enables a combined algorithm that uses recognition and domain usage for the best user experience</li>\n</ul>\n</li>\n<li>If you are using &#8216;domain mapping&#8217; (or the combined approach), ensure all your relevant domains are resolving to this single WordPress installation. This may require you to configure your DNS and web server configurations.</li>\n<li>Choose the theme to be used for your mobile users.</li>\n<li>Users can choose whether to toggle between sites. Decide whether you want this link to appear in the theme footer. Alternatively, you can enable the &#8216;Mobile Switcher Link&#8217; widget in the &#8216;Widgets&#8217; admin menu.</li>\n<li>Go to the &#8216;Widgets&#8217; menu and select which of the currently enabled desktop widgets you wish to have displaying on your mobile theme.</li>\n<li>Enable your blog for inclusion in the mpexo mobile blog directory.</li>\n<li>Take a quick look at the other mobile admin settings and widgets available.</li>\n<li>You&#8217;re all done!</li>\n</ol>\n",
        "faq": "\n<h4>Where are my widgets?</h4>\n<p>\n<p>You need to select which of your desktop widgets you want to have appear on the mobile theme. Go to the &#8216;Mobile Widgets&#8217; admin page to do so.</p>\n</p>\n<h4>Are shrinked images cached?</h4>\n<p>\n<p>Yes, all images, once rescaled, are cached locally.</p>\n</p>\n<h4>I need more help!</h4>\n<p>\n<p>You are welcome to comment about the pack, suggest new features and ask for help on our public forums, available on <a href=\"https://www.wordpress.org/tags/baap-mobile-version\" rel=\"nofollow ugc\">WordPress</a>.</p>\n</p>\n<h4>How can I help on the project?</h4>\n<p>\n<p>We run the development of the plugin over at <a href=\"http://http://howtoinstallwordpressplugin.com/wpmobile_plugin\" rel=\"nofollow ugc\">baaptechnologies</a>. You can track issues and development progress there.</p>\n</p>\n<h4>Is it compatible with WP Super Cache?</h4>\n<p>\n<p>YES! You have to make sure your settings are correct though. Follow these simple steps:</p>\n<ol>\n<li>Install both plugins</li>\n<li>Activate WP Super Cache</li>\n<li>Go to the WP Super Cache settings page</li>\n<li>Check the radio button &#8220;ON&#8221; to activate the cache</li>\n<li>Click on &#8220;Update status&#8221;</li>\n<li>Scroll down and click on the &#8220;Update Mod_Rewrite Rules&#8221; button</li>\n<li>Go back to the plugins page, activate WPMP and configure it</li>\n</ol>\n</p>\n\n",
        "changelog": "<h4>2.0</h4>\n<ul>\n<li>Fixed image transcoder callback bug</li>\n</ul>\n"
    },
    "short_description": "The BAAP Mobile Version is a complete toolkit to help mobilize your WordPress site. It has a mobile switcher, themes, widgets, and mobile admin panel.",
    "description": "<p>The BAAP Mobile Version is a complete toolkit to help mobilize your WordPress site and blog.</p>\n<p>It includes a mobile switcher to select themes based on the type of user that is visiting the site, a selection of mobile themes, extra widgets, device adaptation and a mobile administration panel to allow users to edit the site or write new posts when out and about.</p>\n<p>Features include:</p>\n<ul>\n<li>\n<p><strong>A mobile switcher</strong> which automatically suggests desktop or mobile presentation, but lets users switch to the other if required (and remembers their choice).</p>\n</li>\n<li>\n<p><strong>A set of advanced themes for Nokia and WebKit devices</strong>, designed by <a href=\"http://www.forum.nokia.com/Technology_Topics/Web_Technologies/Browsing/Web_Templates/\" title=\"Forum Nokia\" rel=\"nofollow ugc\">Forum Nokia</a>. These also look beautiful on Android, iPhone and Palm devices.</p>\n</li>\n<li>\n<p><strong>Device adaptation</strong>, including the rescaling of images, intelligent splitting of articles and posts into multiple pages, the simplifaction styles, and the removal of non-supported media.</p>\n</li>\n<li>\n<p><strong>A mobile admin panel</strong>, that allows the blog managers to access the admin interface via a mobile device, with simplified access to the most common features such as editing a post or approving comments.</p>\n</li>\n</ul>\n<p>Enjoying your site and blog in mobile.</p>\n<h3>Documentation</h3>\n<p>The pack is so-called because it contains a number of discrete pieces of functionality. In theory it is possible to individually enable or disable the components (through editing the registrations at the top of the main plugin file), but the vast majority of users are expected to install the pack en masse.</p>\n<p>The pack contains the following functionality:</p>\n<h4>Mobile switcher</h4>\n<p>The mobile switcher identifies whether the visitor to the site is mobile or not, and switches between the primary WordPress theme (for desktop users) and a mobile theme (of the site owner&#8217;s choice) accordingly.</p>\n<p>It can use two approaches to identify the user as mobile. Firstly, it can try to identify if they have a mobile device based on the headers sent when a page is requested. Alternatively, it can identify whether the user has requested the site on a &#8216;desktop domain&#8217; (such as yoursite.com) or a &#8216;mobile domain&#8217; (such as yoursite.mobi) and deduce their intent from that.</p>\n<p>The recommended approach is a third, combined, approach that uses both techniques, and also allows users to switch between sites if the choice is not appropriate by providing a link in the themes&#8217; footers or a widget.</p>\n<p>In this combined mode, the switcher will provide interstitial warning pages if a mobile user accesses the desktop domain or vice-versa. It will also remember their choice of preferred site through the use of a cookie.</p>\n<p>Settings for the switcher are found under the &#8216;Mobile Switcher&#8217; admin page, and are self-explanatory.</p>\n<p>More detail on these switching algorithms is available in a series of articles published by <a href=\"mobiForge\" rel=\"nofollow ugc\">http://mobiforge.com</a>.</p>\n<h4>Base mobile theme</h4>\n<p>The pack contains an extensible theme that is ready for display on mobile devices. The theme is XHTML-MP compliant and scores highly on dotMobi&#8217;s ready.mobi site tester.</p>\n<p>The base theme supports all standard WordPress content, including indexes, posts, pages, archives, search results, comments and widgets. If configured, it also invokes the device adaptation process (detailed below) that ensures the posts themselves are formatted suitable for mobile devices.</p>\n<p>There are a number of simple settings that can be used to adapt the way in which lists of posts appear on the mobile theme. These are found under the &#8216;Mobile Theme&#8217; admin page, which appears when the switcher component is installed (or when the mobile theme is selected as the main WordPress theme). It is possible to set how many posts appear on the home page and in archives, and how verbosely they display.</p>\n<p>Away from the posts themselves, the theme does not provide a &#8216;hard-coded&#8217; sidebar and relies wholly on the WordPress widget framework. Widgets that are selected in the WordPress admin pages (and then selected to show for the mobile theme) will appear in a &#8216;sidebar&#8217; below the main part of the mobile page.</p>\n<p>Since each widget adds size to the overall page, it is recommended that no more than 5 desktop widgets are enabled for the mobile theme. The &#8216;Mobile Widgets&#8217; admin page also appears when the switcher component is installed (or when the mobile theme is selected as the main WordPress theme).</p>\n<p>Any standard WordPress widgets that are known not to be XHTML-compliant are slightly rewritten by the theme to make them so. However, the theme does not currently correct arbitrary widget content and the use of third-party widgets (that were designed for desktop use) may easily push the overall page out of XHTML-MP compliance and affect the user&#8217;s experience.</p>\n<p>Large widgets are not currently split or paged for small mobile devices. This may increase the load time, cost to the user, or even make the page unreadable on a limited capability device. Be aware of this when enabling large widgets on the mobile theme.</p>\n<h4>Extended mobile themes</h4>\n<p>Simply by extending the base theme, it is very easy and quick to customise the mobile theme to fit existing requirements or brand.</p>\n<p>The easiest way to do this is to re-tint the theme&#8217;s colour scheme. The colour specifications for the base theme are all defined at the top of its stylesheet. Site owners can override this palette with their own colours, named DARKEST, DARK, MID, LIGHT, LIGHTEST and so on.</p>\n<p>To demonstrate, three extended themes are available within this pack: blue, green and red. Note how they use the &#8216;Template:&#8217; directive at the top of the stylesheet (and the CSS @import statement) to indicate that they extend the base theme.</p>\n<p>Of course it is also easy to extend the theme in other, more structural ways, and even adapt the template&#8217;s PHP files. However, if such changes should be done carefully to preserve XHTML-MP compliance within the markup.</p>\n<h4>Transcoding and device adaptation</h4>\n<p>When the base theme, or a theme that extends it, it used, the pack provides some features to adapt the content of the posts and pages of the blog to make them more suitable for mobile use.</p>\n<p>There are four major stages to this process, and each may be enabled or disabled independently on the &#8216;Mobile Theme&#8217; admin page. These are:</p>\n<ol>\n<li><strong>Remove media</strong> &#8211; This will remove interactivity and media elements (such as script, Flash, movies, and embedded frames) from the posts and pages. Unless it is certain that users have high-capability handsets, these types of content will stretch the abilities of their mobile devices. The HTML tags removed are object, embed, marquee, script, frame and iframe. This process also removes any event attributes (such as onClick) from the page.</li>\n<li><strong>Partition large pages</strong> &#8211; This will break large blog posts or pages into smaller pieces more suitable for mobile devices. The length of each piece depends on the known memory limitations of the visitor&#8217;s device (if DeviceAtlas integration is enabled), or will default to approximately 5K in size. Contiguous sections such as lists will not be broken, and a pager will appear at the bottom of each post to allow the user to page through the post.</li>\n<li><strong>Shrink images</strong> &#8211; This will shrink large images within posts or pages to fit on smaller screens. The width or height constraints of the device (if DeviceAtlas integration is enabled) are used to determine the new dimensions, or they will default to 124 pixels. This functionality relies on the server having the PHP graphics library LibGD installed (as it will be for PHP 4.3 or greater). Both the original and resized images are cached locally for performance, and site owners have an option to clear this cache on the admin page.</li>\n<li><strong>Simplify styling</strong> &#8211; This will remove styling elements from the posts and pages to ensure mobile compatibility. The HTML attributes removed are: align, background, bgcolor, border, cellpadding, cellspacing, class, color, height, style and width. It removes the following tags: center, font, and span (although note that the inner content of those tags remains). Finally it removes any empty, non-singleton tags that do not have attributes, such as, for example, <code>&amp;lt;div&amp;gt;&amp;lt;/div&amp;gt;</code>.</li>\n</ol>\n<h4>Mobile admin panel</h4>\n<p>A user identified as mobile by the switcher will receive a mobilised version of the WordPress administration interface. The link to the dashboard is available in the standard &#8216;Meta&#8217; widget, or it can be reached directly at <code>http://your.site/wp-admin</code></p>\n<p>Only users with administrator status are allowed to access the mobile administration pages. Note this makes it more restrictive than the desktop dashboard, but this prevents less-authorised users from accessing it and making changes to important site settings.</p>\n<p>The following pages are available in the mobile administration interface:</p>\n<ol>\n<li><strong>Overview</strong> &#8211; Like the desktop dashboard, this details how many pages, posts, categories and tags site owners have on the site. It also highlights how many comments currently await moderation.</li>\n<li><strong>New post</strong> &#8211; Administrators may write a new post to appear on the site. They can specify the title and the body of the post, and whether they want it to remain draft, pending review, or published. It is not currently possible to specify tags, categories or other advanced properties of the post in the mobile interface.</li>\n<li><strong>Edit post</strong> &#8211; This page lists all of the current posts and allows administrators to edit them. As for the &#8216;New post&#8217; page, they can edit title, status, and body. It is not possible to edit the categories or tags and so on, although existing values for such properties of the post will remain set after editing in the mobile interface. Depending on the theme, a link to this edit panel may also be available on the site itself when administrators are logged in.</li>\n<li><strong>Comments</strong> &#8211; This page lists extracts of all of the comments awaiting moderation on the site. From this list, administrators can click on the commentator&#8217;s name to see the whole comment, and, by clicking the appropriate links, set the comment to be published or marked as spam. Editing, de-approving or deleting a comment cannot be performed in this interface.</li>\n<li><strong>Switcher</strong> &#8211; It is possible to change the mobile switching mode in case the site-owner needs to reset the configuration.</li>\n<li><strong>Settings</strong> &#8211; This page lists all the settings for the site which are simple enough to edit with this mobile interface. Complex settings, such as which plugins are installed, are not available. However, text- and number-based settings can be easily edited. Note that no descriptions are available for each setting and the meanings of the values, so it is advisable to only edit them cautiously.</li>\n</ol>\n<p>It is also possible to log-out of the admin panel. Since the login is stored persistently on the mobile device, this is advisable if the site is sensitive and administrators want to protect against the impact of handset theft.</p>\n<p>The mobile administration panel uses the same URL structure as the desktop version, so in most cases, the administration links sent to administrators in emails (such as when a comment needs moderation) can be followed regardess of whether they are using a mobile device or a desktop.</p>\n<h4>Mobile ad widget</h4>\n<p>This provides the ability to place a new widget into the site containing either AdMob or Google mobile ads. Administrators will see the &#8216;Mobile Ads&#8217; in the &#8216;Widget&#8217; admin page, and it allows them to specify which provider to use, and the publisher ID.</p>\n<p>The widget can also be configured to attempt to disable itself when shown on a desktop theme. This is recommended, since the quality of mobile ads presented in response to a desktop user context is lower, and relevant conversion rates may be negatively affected.</p>\n<p>Google supports both single-ad and double-ad modes. Administrators can select which to use from the same publisher dropdown.</p>\n<h4>Barcode widget</h4>\n<p>Site owners can place a two-dimensional QR-code widget on the desktop site that users can use to quickly navigate to the mobile version of the site. If their phones have a camera and QR-code reader capabilities, they can simply snap the barcode off their desktop screen and navigate directly to the mobile equivalent.</p>\n<p>If a URL is specified, the QR-code is fixed to that address. If it is left blank, it will correspond to the page it is being displayed upon.</p>\n<p>Within the widget site owners can specify the link to provide, and the size of the square barcode to show. Site owners should ensure it fits well into the desktop theme.</p>\n<p>Site owners can also indicate whether they want the widget to show some instructions to the users about the purpose of the barcode, as well as a list of well-known readers they can download for their devices if they are not already installed.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/baap-mobile-version.zip",
    "upgrade_notice": {
        "2.0": "<ul>\n<li>Includes advanced themes for Nokia and WebKit devices, and mobile analytics and integration with <a href=\"http://percentmobile.com\">PercentMobile</a></li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/baap-mobile-version/trunk/screenshot-1.png?rev=1566869",
            "caption": "Blog post listing with teasers, shown in both Nokia/WebKit and default themes."
        },
        {
            "src": "https://ps.w.org/baap-mobile-version/trunk/screenshot-2.png?rev=1566869",
            "caption": "Single blog post, shown in both Nokia/WebKit and default themes."
        },
        {
            "src": "https://ps.w.org/baap-mobile-version/trunk/screenshot-3.png?rev=1566869",
            "caption": "Editing a post in the mobile admin dashboard, shown in both Nokia/WebKit and default themes."
        },
        {
            "src": "https://ps.w.org/baap-mobile-version/trunk/screenshot-4.png?rev=1566869",
            "caption": "WebKit theme on an iPhone, showing teaser-less post listing and collapsible widgets."
        },
        {
            "src": "https://ps.w.org/baap-mobile-version/trunk/screenshot-5.png?rev=1566869",
            "caption": "Admin panel for mobile switcher."
        },
        {
            "src": "https://ps.w.org/baap-mobile-version/trunk/screenshot-6.png?rev=1566869",
            "caption": "Admin panel for the mobile theme and device adaptation."
        },
        {
            "src": "https://ps.w.org/baap-mobile-version/trunk/screenshot-7.png?rev=1566869",
            "caption": "Admin panel for enabling and disabling widgets on the mobile theme."
        },
        {
            "src": "https://ps.w.org/baap-mobile-version/trunk/screenshot-8.png?rev=1566869",
            "caption": "Admin panel for configuring analytics."
        },
        {
            "src": "https://ps.w.org/baap-mobile-version/trunk/screenshot-9.png?rev=1566869",
            "caption": "Admin panel for enabling mpexo support."
        },
        {
            "src": "https://ps.w.org/baap-mobile-version/trunk/screenshot-10.png?rev=1566869",
            "caption": "A desktop theme showing a barcode widget and switcher link."
        }
    ],
    "tags": {
        "mobile": "mobile",
        "mobile-internet": "mobile internet",
        "mobile-web": "mobile web",
        "pda": "pda",
        "wireless": "wireless"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/baap-mobile-version.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}