{
    "name": "Private groups",
    "slug": "bbp-private-groups",
    "version": "3.9.6",
    "author": "<a href=\"http://www.rewweb.co.uk\">Robin Wilson</a>",
    "author_profile": "https://profiles.wordpress.org/robin-w/",
    "contributors": {
        "robin-w": {
            "profile": "https://profiles.wordpress.org/robin-w/",
            "avatar": "https://secure.gravatar.com/avatar/059df81c7f47976a795fb23dd2f69ade?s=96&d=monsterid&r=g",
            "display_name": "Robin W"
        }
    },
    "requires": false,
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 45,
        "4": 0,
        "3": 3,
        "2": 0,
        "1": 0
    },
    "num_ratings": 48,
    "support_url": "https://wordpress.org/support/plugin/bbp-private-groups/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 2000,
    "downloaded": 145740,
    "last_updated": "2024-08-14 4:59pm GMT",
    "added": "2014-05-16",
    "homepage": "http://www.rewweb.co.uk/bbp-private-groups/",
    "sections": {
        "description": "<p>An add-on to the bbPress forum plugin &#8211; creates private forum groups</p>\n<p>This Plugin creates unlimited private forum groups.</p>\n<p>Forums are then allocated to one or more groups, and users allocated to one or more groups.</p>\n<p>What this achieves<br />\nunlimited private groups<br />\nEach user is set to a group or groups, and each forum can have any or all the groups associated with it<br />\nAny number of public forums combined with any number of group forums.  The group forums can be individually set to public or private.<br />\nForum title and description (but not topics or replies) can be set to be visible to non-group users, allowing people to see that a forum exists but not access it<br />\nSeparate pages can be set to allow redirection of non group users for sign-up or information<br />\nTopic Permissions<br />\nTopic Permissions is designed for sites where users need to have different permissions to different forums.<br />\nFor instance the ability for users to contribute to one forum whilst only being able to view another, or only start topics in one forum, or only reply to topics in another.</p>\n<p>Example</p>\n<p>So if<br />\nUser a belongs to group 1<br />\nUser b belongs to group 2<br />\nUser c belongs to group 3</p>\n<p>and<br />\nForum x is set to allow group 2<br />\nForum y is set to allow group 2 and group 3<br />\nForum z is set to allow group 1 and group 3</p>\n<p>Then<br />\nUser a can access only forum z<br />\nUser b can access forum x and forum y<br />\nUser c can access forum y and forum z</p>\n<p>Restrictions/warnings</p>\n<p>The widgets (bbpress) forums list, (bbpress) recent replies, and (bbpress) recent topics SHOULD NOT BE USED, as they will show topics headings and author names for all forums.  Replacement widgets called (private groups) forums list, (private groups) recent replies, and (private groups) recent topics are available instead</p>\n<p>Works with bbpress 2.5.3 or higher</p>\n",
        "installation": "<p>To install this plugin :</p>\n<ol>\n<li>Go to Dashboard&gt;plugins&gt;add new</li>\n<li>Search for &#8216;private groups&#8217;</li>\n<li>Click install</li>\n<li>and then activate</li>\n<li>go into settings and set up as required.</li>\n</ol>\n<p><strong>Settings</strong></p>\n<p>Go to Dashboard&gt;settings&gt;Private Groups</p>\n<p>There are 4 settings tabs and 2 management tags.</p>\n<p><em><strong>Forum Visibility tab.</strong></em></p>\n<p>This tab allows you to set forum visibility.</p>\n<p>By default where the forum has groups set, then these are only visible to authorised users.  However you may want users to see that forums exist (to attract new forum users), but not to see content.</p>\n<p>For instance on a cookery site you might have a cake group, who exchange recipes and advice on cakes.  You might want people to sign up before being able to contribute, but if they don&#8217;t know the forum exists, they won&#8217;t join.</p>\n<p>So by listing the forums (and optionally the description &#8211; see tab below) users can see they exist, and if they click the forum or freshness links, they can be taken to any url or wordpress page you wish.  Typically this might be a sign-up page, or a &#8216;you can&#8217;t access&#8217; page. For instance you page might say</p>\n<p>Sorry, you need to be a member to see this area. To join click here Login if need-be [bbp-login]</p>\n<p>In this tab, you can set whether non-group members can see the forums in the indexes (but not access).  If the forum is set to public, then both non-logged in and logged in users will see this.  If the forum is set to private, then only logged in users will see the existence of these forums. this gives a highly granular approach to what forums are displayed for different groups.</p>\n<p>If visibility is set, then  there are options for redirecting, and what freshness messages are displayed.</p>\n<p><em><strong>General Settings</strong></em></p>\n<p>In general settings, you have the ability to hide topic and reply counts, show sub-forum descriptions, and remove the &#8216;private&#8217; prefix from the forum displays.</p>\n<p><em><strong>Group Name Settings</strong></em></p>\n<p>Here you set &#8216;friendly&#8217; names for the groups, to help you remember.  These names do not affect how the restrictions work, group 1 will remain group 1 whatever you name it.</p>\n<p><strong>To set forums</strong></p>\n<p>For each restricted forum</p>\n<ol>\n<li>Go in to Dashboard&gt;forums and select the forum you wish to restrict.</li>\n<li>Under the text you’ll see a box called ‘Forum Groups’ – select the group or groups you wish to allow to access this forum</li>\n<li>If you wish to have a custom error message, you can set one here.</li>\n</ol>\n<p><strong> Setting Widgets</strong></p>\n<p>The bbPress topics and replies widgets will still at this stage show all topic and reply titles etc. If a topic/reply is selected this will give an error message, but titles and authors will be visible, which might be embarrassing !</p>\n<p>So you will probably not want people to see these subjects, so there are 3 new widgets that the plugin has added that filter this to only show appropriate content.</p>\n<p>Go in to Dashboard&gt;appearance&gt;widgets</p>\n<ol>\n<li>You will see three new widgets starting with (private groups) and covering topics, replies and Topics lists.</li>\n<li>If you are using the standard bbPress topic, reply or forum list widgets, you should remove these from your sidebar and replace them with the (private groups) ones</li>\n</ol>\n<p><strong> </strong></p>\n<p><em><strong>Management Information</strong></em><br />\nThis tab lists the groups, what forums are allocated to them, and the number of users each group has</p>\n<p><em><strong>User Management</strong></em><br />\nThis tab allows for the bulk change of users between (and to and from) the groups, and via user edit allows multiple group allocation</p>\n<p><em><strong>Assign groups to roles</strong></em><br />\nThis tab allow those of you who use membership plugins etc. to assign a group against a wordpress or custom role.</p>\n<p>To set forums</p>\n<p>For each restricted forum<br />\n1.Go in to Dashboard&gt;forums and select the forum you wish to restrict.<br />\n2.Under the text you’ll see a box called ‘Forum Groups’ – select the group or groups you wish to allow to access this forum</p>\n<p>Setting Widgets</p>\n<p>The bbPress topics and replies widgets will still at this stage show all topic and reply titles etc. If a topic/reply is selected this will give an error message (see below).</p>\n<p>However you will probably not want people to see these subjects, so there are two widgets that the plugins have added that filter this to only show appropriate content.</p>\n<p>Go in to Dashboard&gt;appearance&gt;widgets<br />\n1.You will see three new widgets starting with &#8216;(Private Groups)&#8217; and covering topics, replies and forum list.<br />\n2.If you are using the standard bbPress topic, reply or forum list widgets, you should remove these from your sidebar and replace them with the ‘private group’ ones.</p>\n<p>Shortcode</p>\n<p>A shortcode to list users either across all groups or per group</p>\n<p>[list-pg-users ]  lists all groups and their users</p>\n<p>[list-pg-users group=$group] lists users of a single group name eg [list-pg-users group=&#8217;developers&#8217;]</p>\n",
        "changelog": "<p>3.9.6 Amendments to the processing of topics and replies in profiles to prevent issues for large sites</p>\n<p>3.9.5 minor change to a link to ensure it correctly runs if site is in a sub directory</p>\n<p>3.9.4 minor change to allow redirect to be filterable</p>\n<p>3.9.3 fix for metabox undefined variable</p>\n<p>3.9.2 amended tested up to value</p>\n<p>3.9.1  amend enforce permissions test in functions.php to add !empty argument (line 184 &amp; 194), and amend disable_groups to only search users where private groups are set (line 38)</p>\n<p>3.9.0  allow for nil groups under php 8.0 to prevent fatal count error</p>\n<p>3.8.9  Hide forums in menus if visibility switched off</p>\n<p>3.8.8  revised filter for bsp-display-topic-index to deal with situation where forum= not used</p>\n<p>3.8.6  amended user view forum check.  If  no group is set for a forum, then the private_groups_can_user_view_post function did set $can_view as true even if post was hidden or private.  This function now checks if user is allowed to see the forum if no group set and sets $can_view correctly</p>\n<p>3.8.5  amended filter for style pack pg_display_forum_query_filter to allow for forum visibility</p>\n<p>3.8.4  wordpress 5.5 tested version</p>\n<p>3.8.3  Correction to 3.8.2 to fix loading order</p>\n<p>3.8.2 Revised forum descriptions to match bbpress 2.6.x, revised sub forum filter to cope with 2.5.x and 2.6.x versions, amended bbp_filter to take account of multipgaed and date filters</p>\n<p>3.8.1 change to forum desciption and last activity to cater for sub forums</p>\n<p>3.8.0 minor chnage to meta-box to prevent non critical error if non logged in empty</p>\n<p>3.7.9 improved plugin information layout</p>\n<p>3.7.8 Admin warning limited to display 10 times</p>\n<p>3.7.8 Admin warning added for bbpress 2.6 users</p>\n<p>3.7.7 filter added to private_groups_list_forums</p>\n<p>3.7.6 bug fix to 3.7.5 to ensure save when topic permissions not set</p>\n<p>3.7.5 prevent settings being lost on bulk forum update</p>\n<p>3.7.4 User managament changed to display the no.users in the selection</p>\n<p>3.7.3 minor change to private_groups_get_permitted_subforums to correctly pass $args</p>\n<p>3.7.2 minor change to prevent php version 5 errors</p>\n<p>3.7.1 minor change to ensure &#8216;no group set&#8217; users show correctly in user management tab</p>\n<p>3.7.0 Updated fr. pot and files</p>\n<p>3.6.9 minor change to forum private groups metabox to correctly display if no groups set up</p>\n<p>3.6.8 checkall for user management added</p>\n<p>3.6.7 Action hooks added to user management to allow for custom columns. Add groups to roles improved to allow for multiple roles</p>\n<p>3.6.6 Warning if using bbpress notify added. Fix for max(): Array must contain at least one element where own topics set by no topics yet</p>\n<p>3.6.5 fix for post_id error in pg_check_profile where topic is supersticky, but no other topics in forum</p>\n<p>3.6.4 added filter to ensure at the backend moderators only see their own forum topics and replies</p>\n<p>3.6.3 Improvements to freshness display for &#8216;access own topic&#8217; users.</p>\n<p>3.6.2 amended functions and topic_filters to prevent topics being seen for &#8216;access own topic&#8217; users.</p>\n<p>3.6.1 unreleased version</p>\n<p>3.6.0 amended forum metabox to better display non-logged in options, added filter for rss2 feed single item</p>\n<p>3.5.9 added ability where anonymous posting allowed to set forum permissions for anon users as per group settings</p>\n<p>3.5.8 added ability to show a forum to non-logged in users when topic permissions activated. Fixed forum dropdown list when topic permissions not set</p>\n<p>3.5.7 remove space from start of pg_forum_widgets.php</p>\n<p>3.5.6 Amendment to pg replies widget to correctly set args[&#8216;after&#8217;]</p>\n<p>3.5.5 amendments to $allowed_forums to set to -1 if null.  amendment to pg forums list widget to correctly set args[&#8216;before&#8217;]</p>\n<p>3.5.4 correction to forum visibility if freshness message set</p>\n<p>3.5.3 corrected to fix headers sent message</p>\n<p>3.5.2 temporary revert to 3.5.1</p>\n<p>3.5.1 Amended topic permissions to add Create/Edit/view OWN Topics to allow for say a help desk private forum</p>\n<p>3.5.0 Amended meta-box.php to only fire on forum changes</p>\n<p>3.4.9 assign groups on login filtered at add_action level to prevent errors</p>\n<p>3.4.8 disable_groups added, forum ID added to forum lists in dashboard, groups added to forum lists in dashboard</p>\n<p>3.4.7 addition to assign groups to roles to assign on every visit.</p>\n<p>3.4.6 minor fix to pg latest activity widget to show latest reply if no author shown</p>\n<p>3.4.5 added improved subscription filtering to remove subscriptions if as a result of group changes user can no longer see forum or topics from that forum</p>\n<p>3.4.4 improved styling capability on pg activity widget</p>\n<p>3.4.3 improved styling capability on pg activity widget</p>\n<p>3.4.2 further corection to PF forums widget for forum lists</p>\n<p>3.4.1 further corection to PF forums widget for forum lists</p>\n<p>3.4.0 minor correction to role_assignment and Settings to correct undefined index</p>\n<p>3.3.9 correction to PF forums widget for forum lists</p>\n<p>3.3.8 correction to user-profile.php for current user when being amended by admin</p>\n<p>3.3.7 Additional functioinality to PF forums widget to allow for forum visibility</p>\n<p>3.3.6 Added ability for programmers to add and delete groups</p>\n<p>3.3.5 Change to forum and activity widget to improve output order and consistency. Revised rpg_get_forum_last_active_id function</p>\n<p>3.3.4 Improved code for 3.3.3 functionality</p>\n<p>3.3.3 add parameters to add_filter(&#8216;bbp_get_forum_freshness_link&#8217;) to allow for direct filtering</p>\n<p>3.3.2 correction to fix user avatar where a category or forum has sub forums, some of which the user is not permitted to see</p>\n<p>3.3.1 correction to fix topic/reply counts where a category or forum has sub forums, some of which the user is not permitted to see</p>\n<p>3.3.0 correction to prevent freshness for a sub forum being incorrectly displayed on a category</p>\n<p>3.2.10 correction to prevent reply form being shown on closed topics</p>\n<p>3.2.9 minor correction to forum-filter</p>\n<p>3.2.8 correction to ensure that user favorites displays filtered favorites</p>\n<p>3.2.7 correction to text domain for meta-box.php and plugin-info.php</p>\n<p>3.2.6 minor big fix valuecheck in functions.php</p>\n<p>3.2.5 minor fix to user-profile.php to remove undefined index line 73 and minor correction to functions to ensure valuecheck = 0 if not set in topic permissions, re-order of tabs and additional help text</p>\n<p>3.2.4 Role filter added to user management</p>\n<p>3.2.3 Correction to Topic Permissions for certain themes</p>\n<p>3.2.2 Topic Permissions tab added</p>\n<p>3.2.0 Plugin information tab added</p>\n<p>3.1.9 add filter to allow bbp-style-pack widgets to work with private groups</p>\n<p>3.1.8 fix undefined error in meta-box.php, add shortcodes plugin to work with private groups, add filter to allow for which capability can access the settings page</p>\n<p>3.1.7 add filter to allow bbp-style-pack shortcodes to work with private groups</p>\n<p>3.1.6  Tidy-up of error in 3.1.5</p>\n<p>3.1.5  Multilanguage version for change in 3.1.4 !</p>\n<p>3.1.4 added function to functions.php for &#8216;Private:&#8217; removal in widgets</p>\n<p>3.1.3 correct registration and login to allow for varying table prefixes</p>\n<p>3.1.2 addition of wp_link_query filter to prevent unallowed topic titles being displayed during link action in topic and reply forms</p>\n<p>3.1.1 Correction to latest activity widget to prevent fatal error (parse settings)</p>\n<p>3.1.0 Forums widget amended to allow multiple forums</p>\n<p>3.0.9 latest activity widget amended to allow multiple forums</p>\n<p>3.0.8 Additional shortcodes added to replace bbp single forum, topics and replies shortcodes<br />\nLine 21 added to replies.php to set null for $allowed_posts</p>\n<p>3.0.7 fix issue with forum visibility forum-filters.php lines 28 &amp; 119<br />\ncorrected unitinitilased offset in forum-filters.php line 256 and functions.php line 235</p>\n<p>3.0.6 minor undefined index errors fixed in settings pages</p>\n<p>3.0.5 minor undefined index errors fixed in forum-filters.php</p>\n<p>3.0.4 fix issue with widgets showing activity&#8217; if post__in no allowed_posts array is blank<br />\nInternationalisation added for pg_forum_widgets.php<br />\n$user_id added to is_keymaster($user_id) line 48 in user-view-post.php to allow for compatibility with other plugins</p>\n<p>3.0.3 fix issue with 404&#8217;s showing in functions file</p>\n<p>3.0.2 fix foreach error in functions line 300</p>\n<p>3.0.1 fix issue with assign groups to roles, and add login assignation to plugin role_assignment.php functions.php, change replies.php to set $limit in all cases</p>\n<p>2.5.6 change to forum_filters.php and topics.php to correct minor syntax errors https://wordpress.org/support/topic/couple-of-warnings-in-latest-version?replies=6 and https://wordpress.org/support/topic/bbp_list_forums-filter-bug?replies=2</p>\n<p>2.5.5 add latest activity widget, corrected sub-forum display and added column option</p>\n<p>2.5.4 remove author link filter as not required</p>\n<p>2.5.3 fix search pagnination</p>\n<p>2.5.2 correction to moderator role to prevent moderators seeing other private forums</p>\n<p>2.5.1 minor error fix for &#8216;remove private prefix&#8217; casuing illegal offset</p>\n<p>2.5 updated to allow internationalization</p>\n<p>2.4 Correction to management information user count</p>\n<p>2.3 Minor correction</p>\n<p>2.2 Multiple groups for users added</p>\n<p>2.1  Optional assign users to roles added to settings</p>\n<p>2.0.1 list user shortcode added<br />\nUser Management (bulk change of users) added<br />\nManagement information &#8211; list of forums added</p>\n<p>1.9.2 Fix for array error on forum visibility<br />\nimproved filter for topic subscriptions</p>\n<p>1.9.1  Fix for moderator role in group views</p>\n<p>1.9 fix to forum subscription display in profile</p>\n<p>1.8.1  bug fix for search function returning incorrect data when allowed posts was nil</p>\n<p>1.8 bug fix where forum is top level forum<br />\ntopic/reply/forum types implemented throughout</p>\n<p>1.7 Moderators can now be set to moderate all forums or just their group ones (plus any open forums)<br />\nImproved topic filtering to speed performance<br />\nallow Super sticky topics to be seen by all forums</p>\n<p>1.6 Shortcode [bbp-topic-form] now only shows allowed forums</p>\n<p>1.5 Amended to have unlimited groups</p>\n<p>1.4.1 compatibility with &#8216;mark as read&#8217; plugin</p>\n<p>1.3 topics and replies paging fixed</p>\n<p>1.2 Author and replies issues fixed</p>\n<p>1.1 Minor changes</p>\n<p>1.0 Version 1</p>\n"
    },
    "short_description": "For bbPress - Creates private forum groups",
    "description": "<p>An add-on to the bbPress forum plugin &#8211; creates private forum groups</p>\n<p>This Plugin creates unlimited private forum groups.</p>\n<p>Forums are then allocated to one or more groups, and users allocated to one or more groups.</p>\n<p>What this achieves<br />\nunlimited private groups<br />\nEach user is set to a group or groups, and each forum can have any or all the groups associated with it<br />\nAny number of public forums combined with any number of group forums.  The group forums can be individually set to public or private.<br />\nForum title and description (but not topics or replies) can be set to be visible to non-group users, allowing people to see that a forum exists but not access it<br />\nSeparate pages can be set to allow redirection of non group users for sign-up or information<br />\nTopic Permissions<br />\nTopic Permissions is designed for sites where users need to have different permissions to different forums.<br />\nFor instance the ability for users to contribute to one forum whilst only being able to view another, or only start topics in one forum, or only reply to topics in another.</p>\n<p>Example</p>\n<p>So if<br />\nUser a belongs to group 1<br />\nUser b belongs to group 2<br />\nUser c belongs to group 3</p>\n<p>and<br />\nForum x is set to allow group 2<br />\nForum y is set to allow group 2 and group 3<br />\nForum z is set to allow group 1 and group 3</p>\n<p>Then<br />\nUser a can access only forum z<br />\nUser b can access forum x and forum y<br />\nUser c can access forum y and forum z</p>\n<p>Restrictions/warnings</p>\n<p>The widgets (bbpress) forums list, (bbpress) recent replies, and (bbpress) recent topics SHOULD NOT BE USED, as they will show topics headings and author names for all forums.  Replacement widgets called (private groups) forums list, (private groups) recent replies, and (private groups) recent topics are available instead</p>\n<p>Works with bbpress 2.5.3 or higher</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.9.6.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/bbp-private-groups/assets/screenshot-1.jpg?rev=1407951",
            "caption": "A sample forum setup screen"
        },
        {
            "src": "https://ps.w.org/bbp-private-groups/assets/screenshot-2.jpg?rev=1407959",
            "caption": "Setting a user to a group"
        }
    ],
    "tags": {
        "bbp": "bbp",
        "bbpress": "bbPress",
        "forum": "forum",
        "groups": "groups",
        "private": "private"
    },
    "stable_tag": "3.9.6",
    "versions": {
        "1.5": "https://downloads.wordpress.org/plugin/bbp-private-groups.1.5.zip",
        "1.6": "https://downloads.wordpress.org/plugin/bbp-private-groups.1.6.zip",
        "1.7": "https://downloads.wordpress.org/plugin/bbp-private-groups.1.7.zip",
        "1.8": "https://downloads.wordpress.org/plugin/bbp-private-groups.1.8.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/bbp-private-groups.1.8.1.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/bbp-private-groups.1.9.1.zip",
        "1.9.2": "https://downloads.wordpress.org/plugin/bbp-private-groups.1.9.2.zip",
        "2.0": "https://downloads.wordpress.org/plugin/bbp-private-groups.2.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/bbp-private-groups.2.0.1.zip",
        "2.2": "https://downloads.wordpress.org/plugin/bbp-private-groups.2.2.zip",
        "2.3": "https://downloads.wordpress.org/plugin/bbp-private-groups.2.3.zip",
        "2.4": "https://downloads.wordpress.org/plugin/bbp-private-groups.2.4.zip",
        "2.5": "https://downloads.wordpress.org/plugin/bbp-private-groups.2.5.zip",
        "2.5.2": "https://downloads.wordpress.org/plugin/bbp-private-groups.2.5.2.zip",
        "2.5.3": "https://downloads.wordpress.org/plugin/bbp-private-groups.2.5.3.zip",
        "2.5.4": "https://downloads.wordpress.org/plugin/bbp-private-groups.2.5.4.zip",
        "2.5.5": "https://downloads.wordpress.org/plugin/bbp-private-groups.2.5.5.zip",
        "2.5.6": "https://downloads.wordpress.org/plugin/bbp-private-groups.2.5.6.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.0.1.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.0.4.zip",
        "3.0.5": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.0.5.zip",
        "3.0.6": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.0.6.zip",
        "3.0.7": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.0.7.zip",
        "3.0.8": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.0.8.zip",
        "3.0.9": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.0.9.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.1.0.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.1.1.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.1.2.zip",
        "3.1.3": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.1.3.zip",
        "3.1.4": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.1.4.zip",
        "3.1.5": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.1.5.zip",
        "3.1.6": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.1.6.zip",
        "3.1.7": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.1.7.zip",
        "3.1.8": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.1.8.zip",
        "3.1.9": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.1.9.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.2.0.zip",
        "3.2.10": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.2.10.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.2.2.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.2.3.zip",
        "3.2.4": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.2.4.zip",
        "3.2.5": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.2.5.zip",
        "3.2.6": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.2.6.zip",
        "3.2.7": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.2.7.zip",
        "3.2.8": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.2.8.zip",
        "3.2.9": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.2.9.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.3.0.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.3.1.zip",
        "3.3.2": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.3.2.zip",
        "3.3.3": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.3.3.zip",
        "3.3.4": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.3.4.zip",
        "3.3.5": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.3.5.zip",
        "3.3.6": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.3.6.zip",
        "3.3.7": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.3.7.zip",
        "3.3.8": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.3.8.zip",
        "3.3.9": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.3.9.zip",
        "3.4.0": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.4.0.zip",
        "3.4.1": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.4.1.zip",
        "3.4.2": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.4.2.zip",
        "3.4.3": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.4.3.zip",
        "3.4.4": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.4.4.zip",
        "3.4.5": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.4.5.zip",
        "3.4.6": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.4.6.zip",
        "3.4.7": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.4.7.zip",
        "3.4.8": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.4.8.zip",
        "3.4.9": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.4.9.zip",
        "3.5.0": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.5.0.zip",
        "3.5.1": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.5.1.zip",
        "3.5.2": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.5.2.zip",
        "3.5.3": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.5.3.zip",
        "3.5.4": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.5.4.zip",
        "3.5.5": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.5.5.zip",
        "3.5.6": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.5.6.zip",
        "3.5.7": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.5.7.zip",
        "3.5.8": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.5.8.zip",
        "3.5.9": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.5.9.zip",
        "3.6.0": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.6.0.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.6.1.zip",
        "3.6.2": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.6.2.zip",
        "3.6.3": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.6.3.zip",
        "3.6.4": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.6.4.zip",
        "3.6.5": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.6.5.zip",
        "3.6.6": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.6.6.zip",
        "3.6.7": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.6.7.zip",
        "3.6.8": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.6.8.zip",
        "3.6.9": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.6.9.zip",
        "3.7.0": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.7.0.zip",
        "3.7.1": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.7.1.zip",
        "3.7.2": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.7.2.zip",
        "3.7.3": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.7.3.zip",
        "3.7.4": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.7.4.zip",
        "3.7.5": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.7.5.zip",
        "3.7.6": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.7.6.zip",
        "3.7.7": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.7.7.zip",
        "3.7.8": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.7.8.zip",
        "3.7.9": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.7.9.zip",
        "3.8.0": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.8.0.zip",
        "3.8.1": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.8.1.zip",
        "3.8.2": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.8.2.zip",
        "3.8.3": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.8.3.zip",
        "3.8.4": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.8.4.zip",
        "3.8.5": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.8.5.zip",
        "3.8.6": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.8.6.zip",
        "3.8.7": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.8.7.zip",
        "3.8.8": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.8.8.zip",
        "3.8.9": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.8.9.zip",
        "3.9.0": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.9.0.zip",
        "3.9.1": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.9.1.zip",
        "3.9.2": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.9.2.zip",
        "3.9.3": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.9.3.zip",
        "3.9.4": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.9.4.zip",
        "3.9.5": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.9.5.zip",
        "3.9.6": "https://downloads.wordpress.org/plugin/bbp-private-groups.3.9.6.zip",
        "trunk": "https://downloads.wordpress.org/plugin/bbp-private-groups.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://www.rewweb.co.uk/donate",
    "banners": [],
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/bbp-private-groups.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}