{
    "name": "Bebop",
    "slug": "bebop",
    "version": "1.3.2",
    "author": "<a href=\"http://www.dalemckeown.co.uk\">Dale Mckeown</a>",
    "author_profile": "https://profiles.wordpress.org/dalemac/",
    "contributors": {
        "dalemac": {
            "profile": "https://profiles.wordpress.org/dalemac/",
            "avatar": "https://secure.gravatar.com/avatar/48faca74b559ffc99737d5589c9d6306?s=96&d=monsterid&r=g",
            "display_name": "Dale Mckeown"
        }
    },
    "requires": false,
    "tested": false,
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 80,
    "ratings": {
        "5": 3,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 4,
    "support_url": "https://wordpress.org/support/plugin/bebop/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 10,
    "downloaded": 6756,
    "last_updated": "2013-03-13 13:59:00",
    "added": "2012-08-28",
    "homepage": "http://bebop.blogs.lincoln.ac.uk/",
    "sections": {
        "description": "<p>Bebop is a BuddyPress plugin which allows you to connect your BuddyPress profile to other social media platforms such as Twitter, Flickr, Slideshare, Youtube and Vimeo. Bebop is an aggregator and curatorial tool, pulling content from other web services into your BuddyPress activity timeline. It will also pull in content from RSS/Atom feeds, so will work with sites like Tumblr, WordPress and Blogger.<br />\nBebop gives you control over exactly what items of content appear in your activity stream and works on WordPress network installs, too.<br />\nBebop was developed by the University of Lincoln for a JISC-funded &#8216;Open Educational Resources&#8217; project, to allow teachers to select and aggregate teaching resources they have shared on third-party sites into their BuddyPress profile. BuddyPress and Bebop are being used at the University of Lincoln to power staff and student profiles.</p>\n<p>German (de_DE) Language pack courtesy of HansRuedi Keller (http://www.info.ch)</p>\n<h3>Licence</h3>\n<p>Released under the GNU General Public Licence &#8211; https://www.gnu.org/copyleft/gpl.html<br />\nCopyright 2013 The University of Lincoln &#8211; http://www.lincoln.ac.uk.</p>\n<h3></h3>\n<h3></h3>\n",
        "installation": "<p>Requirements.<br />\n&#8211; PHP 5.2.1+</p>\n<p>Instructions:<br />\n1. Upload this plugin to your &#8216;/wp-content/plugins/&#8217; directory.<br />\n2. Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress.</p>\n<p>OR</p>\n<p>Install via the &#8216;Add New&#8217; button on your plugins page.</p>\n<p>THEN</p>\n<p>Configure extensions in the &#8216;OER Provider&#8217; admin menu.</p>\n<p>Please read the documentation on Github: http://github.com/lncd/bebop/wiki</p>\n<p>Please report any bugs or issues on Github: http://github.com/lncd/bebop/issues</p>\n",
        "changelog": "<p>v1.3.2 Final &#8211; Minor release<br />\n* Fixed not being able to see other peoples content. BuddyPress has changed the functionality of hide_sitewide so it is now impossible to show hidden activity of another user under the activity tab. This content can still be viewed under the resources tab.<br />\n* This will be the final release of Bebop for the foresable future &#8211; Even if WP/BP breaks or changes anything I will be unable to provide fixes and support. Feel free to open ut Tickets on Github but do not expect a timely response.</p>\n<p>v1.3.1 &#8211; 11.03.2013 &#8211; Minor release, but please backup your database before upgrading!<br />\n* Fixed the upgrade error in 1.3.0.<br />\n* Rewrote database checks for checking secondary ids.<br />\n* added twitter developer link.<br />\n* Fixed multiple spelling mistakes and language file inconsistencies.</p>\n<p>v1.3.0 &#8211; 07.03.2013 &#8211; Major release &#8211; Please backup your database before upgrading!<br />\n* Rewrote all secondary id&#8217;s to be universal. Also fixed icompatability issues with 32bit operating systems.<br />\n* Fixed some minor WP 3.5.1 and BP 1.6.4 compatability issues.<br />\n* Better garbage collection on PHP 5.3<br />\n* Added &#8216;Resources&#8217; tab to the wp-buddypress admin bar.<br />\n* Added tutorials for obtaining and installing API keys.</p>\n<p>v1.2.2 &#8211; 21.12.2012 &#8211; Minor Release</p>\n<ul>\n<li>Fixed WP 3.5 compatability issues.</li>\n</ul>\n<p>v1.2.1 &#8211; 08.11.2012 &#8211; Minor Release</p>\n<ul>\n<li>This update addresses an issue which accidentally allowed hidden content from groups to be displayed on the activity stream.</li>\n</ul>\n<p>v1.2 &#8211; 02.11.2012 &#8211; Major Release</p>\n<p>This is a Major release, providing a new Facebook extension, and adding pagination where required. This release also fixes bugs with RSS feeds, user removal, and corrects many spelling mistakes. Enjoy!</p>\n<p>Feature Updates:<br />\n* A brand new Facebook extension is added in this release, allowing content from facebook to be displayed in the activity stream.<br />\n* Increased RSS output limit from 250 to 500.<br />\n* Moved the user verification option from the general settings to the extension settings, allowing content from certain extensions to be posted to the activity stream automatically, while other extensions can still be verified.<br />\n* Added admin option in each extension to hide content for that extension form the sitewide activity stream.<br />\n* Added pagination to all admin and user content where needed, such as admin backend logs, content, and user content manager.<br />\n* Added German (de_DE) languae pack, courtesy of HansRuedi Keller (http://www.info.ch)</p>\n<p>Bug Fixes:<br />\n* RSS &#8211; Fixed a bug which only allowed 20 items to be returned at a time fro RSS feeds.<br />\n* RSS &#8211; Redefined pubDate in the RSS feeds as the date the item was uploaded to the original source.<br />\n* RSS &#8211; Added wpPubDate the the RSS feeds and defined it as the date it was added to BuddyPress.<br />\n* Content Stream &#8211; had to allow bebop-core-user.php to be included on every page so the new &#8216;hide_sitewide&#8217; feature works as expected.<br />\n* Admin Area &#8211; forced checkboxes in forms to be on same line as text.<br />\n* Admin Area &#8211; Fixed the user removal bug, so admins can actually remove users from extensions now&#8230;</p>\n<p>Other:<br />\n* Corrected various spelling mistakes.</p>\n<p>v1.1.1 &#8211; 25.09.2012 &#8211; Minor Release</p>\n<p>This is a minor update which fixes some bugs found in version 1.1.</p>\n<p>Feature Updates:<br />\n* Made RSS feed link buttons only visible when the user is importing content. Prevents clutter of buttons when a user is not actively using an extension.</p>\n<p>Bug Fixes:<br />\n* Fixed a bug which was overriding the custom bebop activity feed query when first loaded, which caused all content to be displayed, not just Bebop generated content.<br />\n* Fixed an issue with updating the main WordPress cron time.<br />\n* Stopped admin secondary buttons from having an underline link.<br />\n* Fixed a page redirection error which was redirecting to the site URL when trying to access another users resources.</p>\n<p>Other:<br />\n* Fixed an issue with with strange log messages of no consumer key is set for an extension.<br />\n* Added some padding to admin secondary buttons.<br />\n* .gitignore&#8217;d a few other unnecessary files and folders.<br />\n* Updated the readme.txt file.<br />\n* Changed feed back to RSS<br />\n* Changes some admin terminology so that it suites our social media users a little better.</p>\n<p>v1.1 &#8211; 24.09.2012 &#8211; Major Release</p>\n<p>This version changes some fundamental aspects of the plugin source code. See features for details.</p>\n<p>Feature Updates:<br />\n* When a new account is added to an extension, an initial import is fired to allow content to become available in the unverified resources without having to wait for the cron import to do its magic.<br />\n* Introduced a secondary cron which scans a new database table every 15 seconds to detect feeds which are due an initial import. This means the default cron can be ran less often, while new users/feeds can still import content.<br />\n* Changed default cron time to 10 minutes to support the above feature.<br />\n* Updated all extension import scripts to allow processing of the new cron.<br />\n* Changed the logo for the plugin.<br />\n* Improved RSS atom compatibility.<br />\n* Added some hooks in relevant places to allow further extensions to be developed and easily hooked into bebop&#8217;s functionality.<br />\n* Moved RSS links to top of the Teaching Resources home tab, to prevent repetition and to make feeds visible even with no-one logged in.<br />\n* Made it easier for extensions to hook into bebop.<br />\n* Separated admin functions from normal functions to increase performance.<br />\n* Placed buttons in the admin general settings which can automatically fire a cron. This could aid problem solving with users if they cannot get content to import.<br />\n* Added another general settings option which allows content to be either verified automatically, or be verified by the user through the OER manager.</p>\n<p>Bug Fixes:<br />\n* Removed importer queue as it was no longer required.<br />\n* Fixed a rather complexed quote escaping problem in user feeds.<br />\n* Fixed a bug which displayed the user&#8217;s activity stream if no OER extensions are active.<br />\n* Fixed an issue which forced the RSS feeds generator to always output results for &#8216;all_oers&#8217; regardless of what content supposed to display.<br />\n* Prefixed some functions to prevent some possible name conflicts with other possible plugins.<br />\n* Fixed a Flickr import bug which accidentally removed data from the OER manager table.<br />\n* Fixed a bug which made it difficult to remove a users feed from a regular extension.<br />\n* Fixed a bug which threw a fatal error if BuddyPress is not active when Bebop is activated.<br />\n* Fixed a bug which overwrote standard  WordPress CSS rules.</p>\n<p>Other:<br />\n* Made a few import error/log messages a bit more clear.</p>\n<p>v1.0.1 &#8211; 11.09.2012 &#8211; minor release.</p>\n<p>This version adds a couple of extra features, but more importantly fixes a major bug regarding import limits and importing items.</p>\n<p>Feature Updates:<br />\n* RSS feeds are not shown for bebop content in the activity streams. The extension RSS feed for the user is shown, and the &#8220;all OER&#8221; feed is shown if more than one feed is active.<br />\n* The Twitter extension has been updated to conform with the new Twitter API.<br />\n* The admin interface has been replaced by standard WordPress and BuddyPress markup, resulting in a more &#8220;WordPressy&#8221; feel.<br />\n* The user interface has been replaced by standard WordPress and BuddyPress markup, resulting in a more &#8220;WordPressy&#8221; feel.<br />\n* Import scripts that require an API key now log to the general log instead of the error log incase a API key is not found. Changed because it is not specifically a Bebop error, but a user error.<br />\n* Changed admin settings link in OER providers to a button.<br />\n* Changed &#8216;Generic RSS&#8217; extension to &#8216;Feed&#8217; Extension.</p>\n<p>Bug Fixes:<br />\n* A bug was fixed which made the OER filter tab display the wrong text.<br />\n* RSS feeds are closer to validating properly.<br />\n* Fixed deactivation bug where &#8220;bebop_tables()&#8221; class is not found.<br />\n* Fixed import twitter bug where no username is specified.<br />\n* Fixed error log not displaying properly.<br />\n* Fixed a user settings bug where edit options were available but no API key is set in the admin panel.<br />\n* Fixed bug where the same content is loaded when the &#8216;load more&#8217; button is clicked.<br />\n* Fixed a bug where the OER filter is displaying extra content filters from other plugins.<br />\n* Fixed a bug that stopped OER content from being imported if no import limit was set for an extension.<br />\n* Fixed a bug where admin error messages were showing the &#8220;settings saved&#8221; when they should return an error.<br />\n* Fixes a bug where additional filters from other plugins were being added to the OER filters.<br />\n* Fixed bug where it is not possible to reset a deleted OER.</p>\n<p>Other:<br />\n* Support email changed to Github wiki.<br />\n* Removed the &#8220;break;&#8221; from import scripts &#8211; to retrieve older data if an import limit is removed.<br />\n* Changed some terminology here and there.</p>\n<p>v1.0 &#8211; 30.08.2012 &#8211; Initial release.</p>\n"
    },
    "short_description": "Bebop is a BuddyPress plugin which allows you to connect your BuddyPress profile to other social media platforms such as Twitter, Flickr, Slideshare,  &hellip;",
    "description": "<p>Bebop is a BuddyPress plugin which allows you to connect your BuddyPress profile to other social media platforms such as Twitter, Flickr, Slideshare, Youtube and Vimeo. Bebop is an aggregator and curatorial tool, pulling content from other web services into your BuddyPress activity timeline. It will also pull in content from RSS/Atom feeds, so will work with sites like Tumblr, WordPress and Blogger.<br />\nBebop gives you control over exactly what items of content appear in your activity stream and works on WordPress network installs, too.<br />\nBebop was developed by the University of Lincoln for a JISC-funded &#8216;Open Educational Resources&#8217; project, to allow teachers to select and aggregate teaching resources they have shared on third-party sites into their BuddyPress profile. BuddyPress and Bebop are being used at the University of Lincoln to power staff and student profiles.</p>\n<p>German (de_DE) Language pack courtesy of HansRuedi Keller (http://www.info.ch)</p>\n<h3>Licence</h3>\n<p>Released under the GNU General Public Licence &#8211; https://www.gnu.org/copyleft/gpl.html<br />\nCopyright 2013 The University of Lincoln &#8211; http://www.lincoln.ac.uk.</p>\n<h3></h3>\n<h3></h3>\n",
    "download_link": "https://downloads.wordpress.org/plugin/bebop.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "buddypress": "buddypress",
        "oer": "OER",
        "open-educational-resources": "Open Educational Resources",
        "ukeor": "ukeor",
        "wordpress": "WordPress"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/bebop.1.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/bebop.1.0.1.zip",
        "1.1": "https://downloads.wordpress.org/plugin/bebop.1.1.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/bebop.1.1.1.zip",
        "1.2": "https://downloads.wordpress.org/plugin/bebop.1.2.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/bebop.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/bebop.1.2.2.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/bebop.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/bebop.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/bebop.1.3.2.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/bebop.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 80,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}