{
    "name": "WordPress Robots.txt optimizer (+ XML Sitemap) – Boost SEO, Traffic &amp; Rankings",
    "slug": "better-robots-txt",
    "version": "2.0.0",
    "author": "<a href=\"https://pagup.ca/\">Pagup</a>",
    "author_profile": "https://profiles.wordpress.org/pagup/",
    "contributors": {
        "the-rock": {
            "profile": "https://profiles.wordpress.org/the-rock/",
            "avatar": "https://secure.gravatar.com/avatar/95c7565a5bebedc6033117ac98fd3bc5?s=96&d=monsterid&r=g",
            "display_name": "Sajjad Ali"
        },
        "pagup": {
            "profile": "https://profiles.wordpress.org/pagup/",
            "avatar": "https://secure.gravatar.com/avatar/eabee9fb50c97026fee93da8967dc2a1?s=96&d=monsterid&r=g",
            "display_name": "Pagup"
        },
        "freemius": {
            "profile": "https://profiles.wordpress.org/freemius/",
            "avatar": "https://secure.gravatar.com/avatar/3ac33da92186a78937b307bdd9e906ee?s=96&d=monsterid&r=g",
            "display_name": "Freemius"
        }
    },
    "requires": "4.1",
    "tested": "6.6.1",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 90,
    "ratings": {
        "5": 86,
        "4": 2,
        "3": 2,
        "2": 2,
        "1": 10
    },
    "num_ratings": 102,
    "support_url": "https://wordpress.org/support/plugin/better-robots-txt/",
    "support_threads": 1,
    "support_threads_resolved": 1,
    "active_installs": 9000,
    "downloaded": 269081,
    "last_updated": "2024-07-30 8:35pm GMT",
    "added": "2018-05-16",
    "homepage": "",
    "sections": {
        "description": "<p>Better Robots.txt generates a virtual robots.txt for WordPress, enhancing your website&#8217;s SEO (indexation capabilities, Google ranking, etc.) and its loading performance. Our plugin is compatible with Yoast SEO, Rank Math, Google Merchant, WooCommerce, and directory-based network sites (MULTISITE) and features now (2023) exclusive Artificial Intelligence (OpenAI) optimization settings for greater performance.</p>\n<p>With Better Robots.txt, you can specify which search engines are permitted to crawl your website and provide clear directives about their allowed activities. You can also set a crawl-delay to shield your hosting server from aggressive scrapers. Better Robots.txt empowers you with complete control over your WordPress robots.txt content through the custom setting box.</p>\n<p>Minimize <a href=\"https://better-robots.com/how-to-save-the-planet-with-your-website/\" rel=\"nofollow ugc\">your site&#8217;s ecological footprint and the production of greenhouse gas</a> (CO2) associated with its online presence.</p>\n<p>According to ChatGPT (OpenAI), the robots.txt produced by the PRO version of Better-Robots.txt is the most sophisticated and comprehensive available on the WEB for a WordPress site.</p>\n<p><strong>A quick overview:</strong></p>\n<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/306589027\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p><strong>SUPPORTED IN 7 LANGUAGES</strong></p>\n<p>Better Robots.txt plugins are available and translated into the following languages: Chinese –汉语/漢語, English, French – Français, Russian –Руссɤɢɣ, Portuguese – Português, Spanish – Español, German – Deutsch.</p>\n<p>Did you know that…</p>\n<ul>\n<li>The robots.txt file is a straightforward text file positioned on your web server that instructs web crawlers (like Googlebot) on whether they should access a file or not.</li>\n<li>The robots.txt file governs how search engine spiders perceive and engage with your web pages;</li>\n<li>This file and the bots it communicates with, are integral components of how search engines operate;</li>\n<li>The initial thing a search engine crawler examines when it visits a page is the robots.txt file;</li>\n</ul>\n<p><strong>The robots.txt is a reservoir of SEO potential that&#8217;s ready to be tapped into. Give Better Robots.txt a try!</strong></p>\n<p><strong>About the Pro version (additional features):</strong></p>\n<p><strong>1. Enhance your content visibility on search engines with your sitemap!</strong></p>\n<p>Ensure your pages, articles, and products, even the most recent ones, are recognized by search engines!</p>\n<p>The Better Robots.txt plugin is designed to integrate with the Yoast SEO plugin and Rank Math (arguably the best SEO Plugin for WordPress websites). It will automatically detect if you are using Yoast SEO / Rank Math and if the sitemap feature is enabled. If so, it will automatically add instructions to the Robots.txt file directing bots/crawlers to review your sitemap for recent changes on your website (allowing search engines to crawl any new content).</p>\n<p>If you wish to add your own sitemap (or if you are using a different SEO plugin), you simply need to copy and paste your Sitemap URL, and Better Robots.txt will incorporate it into your WordPress Robots.txt.</p>\n<p><strong>2. Safeguard your data and content</strong></p>\n<p>Prevent harmful bots from scraping your website and exploiting your data.</p>\n<p>The Better Robots.txt plugin assists in blocking most common malicious bots from crawling and scraping your data.</p>\n<p>There are both beneficial and harmful bots that crawl your site. Beneficial bots, like Google bot, crawl your site to index it for search engines. However, others crawl your site for more malicious reasons such as repurposing your content (text, price, etc.) for republishing, downloading entire archives of your site, or extracting your images. Some bots have even been reported to crash entire websites due to excessive bandwidth usage.</p>\n<p>The Better Robots.txt plugin shields your website against spiders/scrapers identified as harmful bots by Distil Networks.</p>\n<p><strong>3. Conceal &amp; safeguard your backlinks</strong></p>\n<p>Prevent competitors from discovering your profitable backlinks.</p>\n<p>Backlinks, also known as &#8220;inbound links&#8221; or &#8220;incoming links,&#8221; are created when one website links to another. The link to an external website is called a backlink. Backlinks are particularly valuable for SEO as they signify a &#8220;vote of confidence&#8221; from one site to another. Essentially, backlinks to your website signal to search engines that others endorse your content.</p>\n<p>If numerous sites link to the same webpage or website, search engines can deduce that the content is link-worthy, and therefore worth displaying on a SERP. Thus, earning these backlinks can positively impact a site&#8217;s ranking position or search visibility. In the SEM industry, it&#8217;s common for specialists to identify the sources of these backlinks (competitors) to select the best ones and generate high-quality backlinks for their own clients.</p>\n<p>Given that creating highly profitable backlinks for a company is time-consuming (time + energy + budget), allowing your competitors to identify and replicate them so easily is a significant loss of efficiency.</p>\n<p><strong>Better Robots.txt aids in blocking all SEO crawlers (aHref, Majestic, Semrush) to keep your backlinks hidden.</strong></p>\n<p><strong>4. Prevent Spam Backlinks</strong></p>\n<p>Bots that populate your website&#8217;s comment forms with messages like &#8216;great article,&#8217; &#8216;love the info,&#8217; &#8216;hope you can elaborate more on the topic soon&#8217; or even personalized comments, including the author&#8217;s name, are widespread. Spambots are becoming increasingly sophisticated over time, and unfortunately, comment spam links can seriously damage your backlink profile.</p>\n<p>Better Robots.txt assists in preventing these comments from being indexed by search engines.</p>\n<p><strong>5. Artificial Intelligence at the service of Robots.txt</strong></p>\n<p>In 2023, we added a robots.txt optimization feature based on OpenAI&#8217;s (ChatGPT) recommendations for any WordPress site. These settings maximize the efficiency of robots.txt for search engines to streamline the crawling of a website. More improvements are on the way&#8230;</p>\n<p>In 2023, ChatGPT 4, after auditing several million robots.txt files available on the WEB, assessed that the robots.txt deployed by the PRO version of the Better-Robots.txt plugin was the most advanced, comprehensive, and sophisticated configuration currently available for WordPress environments. A point of pride for our team!</p>\n<p><strong>6. SEO Tools</strong></p>\n<p>In the process of enhancing our plugin, we&#8217;ve incorporated shortcut links to two crucial tools for those concerned about their search engine rankings: Google Search Console &amp; Bing Webmaster Tool. If you&#8217;re not already utilizing them, you can now manage your website&#8217;s indexing while optimizing your robots.txt! We&#8217;ve also provided direct access to a Mass Ping tool, enabling you to ping your links on over 70 search engines.</p>\n<p>Additionally, we&#8217;ve created four shortcut links to some of the best Online SEO Tools, directly accessible through Better Robots.txt SEO PRO. This means you can now check your site&#8217;s loading performance, analyze your SEO score, identify your current SERP rankings with keywords &amp; traffic, and even scan your entire website for dead links (404, 503 errors, etc.) directly from the plugin.</p>\n<p><strong>7. Stand Out</strong></p>\n<p>We thought we could add a unique touch to Better Robots.txt by introducing a feature that lets you &#8220;customize&#8221; your WordPress robots.txt with your own distinctive &#8220;signature.&#8221; Many major companies worldwide have personalized their robots.txt by adding proverbs (https://www.yelp.com/robots.txt), slogans (https://www.youtube.com/robots.txt), or even drawings (https://store.nike.com/robots.txt – at the bottom). Why not do the same? That&#8217;s why we&#8217;ve dedicated a specific area on the settings page where you can write or draw anything you want (really) without affecting your robots.txt efficiency.</p>\n<p><strong>8. Prevent Crawling of Redundant WooCommerce Links</strong></p>\n<p>We&#8217;ve introduced a unique feature that blocks specific links (&#8220;add-to-cart&#8221;, &#8220;orderby&#8221;, &#8220;filter&#8221;, cart, account, checkout, etc.) from being crawled by search engines. Most of these links demand a significant amount of CPU, memory &amp; bandwidth usage (on the hosting server) as they are not cacheable and/or create &#8220;infinite&#8221; crawling loops (while they are unnecessary).</p>\n<p>By optimizing your WordPress robots.txt for WooCommerce when running an online store, you can allocate more processing power to the pages that truly matter and enhance your loading performance.</p>\n<p><strong>9. Dodge Crawler Traps</strong></p>\n<p>&#8220;Crawler traps&#8221; are structural issues within a website that lead crawlers to discover a virtually infinite number of irrelevant URLs. In theory, crawlers could get stuck in one part of a website and never finish crawling these irrelevant URLs.</p>\n<p>Better Robots.txt aids in preventing crawler traps, which can harm crawl budget and result in duplicate content.</p>\n<p><strong>10. Growth Hacking Tools</strong></p>\n<p>Today&#8217;s fastest-growing companies, including Amazon, Airbnb, and Facebook, have all achieved breakout growth by aligning their teams around a high-velocity testing/learning process. This is referred to as Growth Hacking. Growth hacking is a process of rapidly experimenting with and implementing marketing and promotional strategies that are solely focused on efficient and rapid business growth. Better Robots.txt provides a list of over 150+ tools available online to propel your growth.</p>\n<p><strong>11. Robots.txt Post Meta Box for Manual Exclusions</strong></p>\n<p>This Post Meta Box allows you to manually set if a page should be visible (or not) on search engines by injecting a dedicated &#8220;disallow&#8221; + &#8220;noindex&#8221; rule inside your WordPress robots.txt. Why is this beneficial for your ranking on search engines? Simply because some pages are not meant to be crawled/indexed.</p>\n<p>Thank you pages, landing pages, pages containing exclusively forms are useful for visitors but not for crawlers, and you don&#8217;t need them to be visible on search engines. Also, some pages containing dynamic calendars (for online booking) should NEVER be accessible to crawlers because they tend to trap them into infinite crawling loops which directly impacts your crawl budget (and your ranking).</p>\n<p><strong>12. Ads.txt &amp; App-ads.txt Crawlability</strong></p>\n<p>To ensure that ads.txt &amp; app-ads.txt can be crawled by search engines, the Better Robots.txt plugin ensures they are by default allowed in the Robots.txt file regardless of your configuration. For your information, Authorized Digital Sellers for Web, or ads.txt, is an IAB initiative to improve transparency in programmatic advertising.</p>\n<p>You can create your own ads.txt files to identify who is authorized to sell your inventory. The files are publicly available and crawlable by exchanges, Supply-Side Platforms (SSP), and other buyers and third-party vendors. Authorized Sellers for Apps, or app-ads.txt, is an extension to the Authorized Digital Sellers standard. It expands compatibility to support ads shown in mobile apps.</p>\n<p><strong>More enhancements are always on the way&#8230;</strong></p>\n",
        "changelog": "<h4>1.0.0</h4>\n<ul>\n<li>Initial release.</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>fixed plugin directory url issue</li>\n<li>some text improvements</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>fixed some minor issues with styling</li>\n<li>improved text and translation</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>added some major improvements</li>\n<li>allow/off option changed with allow/disallow/off</li>\n<li>improved overall text and french translation</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>fixed a bug and improved code</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>added new feature &#8220;Spam Backlink Blocker&#8221;</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>fixed a bug</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>added new &#8220;personalize your robots.txt&#8221; feature to add custom signature</li>\n<li>added recommended seo tools to improve search engine optimization</li>\n</ul>\n<h4>1.1.5</h4>\n<ul>\n<li>added feature to detect physical robots.txt file and delete it if server permissions allows</li>\n</ul>\n<h4>1.1.6</h4>\n<ul>\n<li>added russian and chinese (simplified) languages</li>\n<li>fixed bug causing redirection to better robots.txt settings page upon activating other plugins</li>\n</ul>\n<h4>1.1.7</h4>\n<ul>\n<li>added new feature: Top plugins for SEO performance</li>\n<li>fixed plugin notices issue to dismiss for define period of time after being closed</li>\n<li>fixed stylesheet issue to get proper updated file after plugin update (cache buster)</li>\n<li>added spanish and portuguese languages</li>\n</ul>\n<h4>1.1.8</h4>\n<ul>\n<li>added new feature: xml sitemap detection</li>\n<li>fixed translations</li>\n</ul>\n<h4>1.1.9</h4>\n<ul>\n<li>added new feature: loading performance for woocommerce</li>\n</ul>\n<h4>1.1.9.1</h4>\n<ul>\n<li>fixed a bug in disallow rules for woocommerce</li>\n</ul>\n<h4>1.1.9.2</h4>\n<ul>\n<li>boost your site with alt tags</li>\n</ul>\n<h4>1.1.9.3</h4>\n<ul>\n<li>fixed readability issues</li>\n</ul>\n<h4>1.1.9.4</h4>\n<ul>\n<li>fixed default robots.txt file issue upon plugin activation for first time</li>\n<li>fixed php error upon saving settings and permalinks</li>\n<li>refactored code</li>\n</ul>\n<h4>1.1.9.5</h4>\n<ul>\n<li>added clean-param for yandex bot</li>\n<li>ask backlinks feature for pro users</li>\n<li>avoid crawler traps feature for pro users</li>\n<li>improved default robots.txt rules</li>\n</ul>\n<h4>1.1.9.6</h4>\n<ul>\n<li>added 150+ growth hacking tools</li>\n<li>fixed layout bug</li>\n<li>updated default rules</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Added Post Meta Box to Disable Indivdual post, pages and products (woocommerce pro only). It will add Disallow and Noindex rule in robots.txt for any page you choose to disallow from post meta box options.</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Added multisite feature for directory based network sites (pro only). it can duplicate all default rules, yoast sitemap, woocommerce rules, bad bots, pinterest bot blocker, backlinks blocker etc with a single click for all directory based network sites.</li>\n<li>Added version timestamp for wp_register_script &#8216;assets/rt-script.js&#8217;</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>Fixed some bugs creating error in google search console</li>\n<li>Text improvement</li>\n</ul>\n<h4>1.2.3</h4>\n<ul>\n<li>Added &#8220;Hide your robots.txt from SERPs&#8221; feature</li>\n<li>Text improvements</li>\n</ul>\n<h4>1.2.4</h4>\n<ul>\n<li>Fixed a bug</li>\n<li>Text improvements</li>\n</ul>\n<h4>1.2.5</h4>\n<ul>\n<li>Fixed crawl-delay issue</li>\n<li>Updated translations</li>\n</ul>\n<h4>1.2.5.1</h4>\n<ul>\n<li>Fixed a minor issue</li>\n</ul>\n<h4>1.2.6</h4>\n<ul>\n<li>Security patched in freemius sdk</li>\n</ul>\n<h4>1.2.6.1</h4>\n<ul>\n<li>Fixed Multisite Issue for pro users</li>\n</ul>\n<h4>1.2.6.2</h4>\n<ul>\n<li>Fixed Yoast sitemap issue for Multisite users</li>\n</ul>\n<h4>1.2.6.3</h4>\n<ul>\n<li>Fixed some text</li>\n</ul>\n<h4>1.2.7</h4>\n<ul>\n<li>Added Baidu/Sogou/Soso/Youdao &#8211; Chinese search engines features for pro users</li>\n<li>Added social media crawl feature for pro users</li>\n</ul>\n<h4>1.2.8</h4>\n<ul>\n<li>Notification will be disabled for 4 months. Fixed some other minor stuff</li>\n</ul>\n<h4>1.2.9.2</h4>\n<ul>\n<li>Updated Freemius SDK v2.3.0</li>\n<li>BIGTA recommendation</li>\n</ul>\n<h4>1.2.9.3</h4>\n<ul>\n<li>Fixed Undefined index error while saving MENUS for some sites</li>\n<li>Removed &#8220;noindex&#8221; rule for individual posts as Google will stop supprting it from Sep 01 2019</li>\n</ul>\n<h4>1.3.0</h4>\n<ul>\n<li>Added 5 new rules to default config. Removed 4 old default rules which were cuasing some issues with WPML</li>\n<li>Added a search rule to Avoid crawling traps</li>\n<li>Added several new rules to Spam Backlink Blocker</li>\n<li>Fixed security issues</li>\n</ul>\n<h4>1.3.0.1</h4>\n<ul>\n<li>VidSEO recommendation</li>\n</ul>\n<h4>1.3.0.2</h4>\n<ul>\n<li>Fixed some security issues</li>\n<li>Added new rules to Backlink Protector (Pro only)</li>\n<li>Multisite notification will be disabled permenantly once dismissed</li>\n</ul>\n<h4>1.3.0.3</h4>\n<ul>\n<li>Fixed php notice (in php log) for $host_url variable</li>\n</ul>\n<h4>1.3.0.4</h4>\n<ul>\n<li>Fixed php notice (in php log) for $active_tab variable</li>\n<li>Fixed some typos</li>\n</ul>\n<h4>1.3.0.5</h4>\n<ul>\n<li>Added option to Be part of our worldwide Movement against CoronaVirus (Covid-19)</li>\n<li>Fixed several php undefined index notices (in php log) related to Step 7 and 8 options</li>\n</ul>\n<h4>1.3.0.6</h4>\n<ul>\n<li>👌 IMPROVE: Updated freemius to latest version 2.3.2</li>\n<li>🐛 FIX: Some minor issues</li>\n</ul>\n<h4>1.3.0.7</h4>\n<ul>\n<li>🔥 NEW: WP Google Street View promotion</li>\n<li>🐛 FIX: Some minor text issues</li>\n</ul>\n<h4>1.3.1.0</h4>\n<ul>\n<li>👌 IMPROVE: Admin Notices are set to permenantly dismissed based on user.</li>\n<li>👌 IMPROVE: Top level menu for Better Robots.txt Settings</li>\n<li>🐛 FIX: Styling conflict with Norebro Theme.</li>\n<li>🐛 FIX: Undefined variables php errors for some options</li>\n</ul>\n<h4>1.3.2.0</h4>\n<ul>\n<li>🐛 FIXED: XSS vulnerability.</li>\n<li>🐛 FIX: Non-static method errors</li>\n<li>👌 IMPROVE: Tested up to WordPress v5.5</li>\n</ul>\n<h4>1.3.2.1</h4>\n<ul>\n<li>🐛 FIXED: Call to undefined method error.</li>\n</ul>\n<h4>1.3.2.2</h4>\n<ul>\n<li>👌 IMPROVE: Update Freemius to v2.4.1</li>\n</ul>\n<h4>1.3.2.3</h4>\n<ul>\n<li>👌 IMPROVE: Tested up to WordPress v5.6</li>\n<li>🐛 FIX: Get Pro URL</li>\n</ul>\n<h4>1.3.2.4</h4>\n<ul>\n<li>👌 IMPROVE: Added some more rules for Woocommerce performance</li>\n<li>👌 IMPROVE: Update Freemius to v2.4.2</li>\n</ul>\n<h4>1.3.2.5</h4>\n<ul>\n<li>🔥 NEW: Meta Tags for SEO promotion</li>\n</ul>\n<h4>1.4.0</h4>\n<ul>\n<li>👌 IMPROVE: Refactored code to MVC</li>\n<li>👌 IMPROVE: New clean design</li>\n<li>👌 IMPROVE: Many small improvements</li>\n</ul>\n<h4>1.4.0.1</h4>\n<ul>\n<li>🐛 FIX: Added trailing backslash for using trait</li>\n</ul>\n<h4>1.4.1</h4>\n<ul>\n<li>🔥 NEW: Search engine visibility feature (Pro version)</li>\n<li>🔥 NEW: Image Crawlability feature (Pro version)</li>\n</ul>\n<h4>1.4.1.1</h4>\n<ul>\n<li>🐛 FIX: Sitemap issue</li>\n</ul>\n<h4>1.4.2</h4>\n<ul>\n<li>🐛 FIX: Bugs and improvements</li>\n<li>🔥 NEW: Option to add default WordPress Sitemap (Pro Version)</li>\n<li>🔥 NEW: Option to add All in One SEO Sitemap (Pro Version)</li>\n</ul>\n<h4>1.4.3</h4>\n<ul>\n<li>🐛 FIX: Text issues</li>\n</ul>\n<h4>1.4.4</h4>\n<ul>\n<li>🐛 FIX: Security fix</li>\n</ul>\n<h4>1.4.5</h4>\n<ul>\n<li>🐛 FIX: PHP warning undefined index</li>\n</ul>\n<h4>1.4.6</h4>\n<ul>\n<li>🐛 FIX: SECURITY PATCH. Verify nonce for CSRF attack.</li>\n<li>🐛 FIX: PHP 8.2 warning undefined index</li>\n</ul>\n<h4>1.4.7</h4>\n<ul>\n<li>🐛 FIX: Removed Be part of movement against CoronaVirus (Covid-19) option</li>\n</ul>\n<h4>1.5.0</h4>\n<ul>\n<li>🐛 FIX: Moved Moz bots from Bad bots list to Backlink Protector list.</li>\n<li>🔥 NEW: You can select and exclude bots in Backlink Protector list (Pro Version)</li>\n<li>🔥 NEW: Bad Bots &#8211; &#8220;AI recommended setting&#8221; by ChatGPT-4 (Pro Version)</li>\n<li>🐛 FIX: Security fix</li>\n</ul>\n<h4>1.5.1</h4>\n<ul>\n<li>🔥 NEW: ChatGPT Bot Blocker &#8211; Block ChatGPT Bot from scrapping your content (Pro Version)</li>\n<li>👌 IMPROVE: Encapsulation of Radio Switch Buttons and code refactoring.</li>\n</ul>\n<h4>1.5.2</h4>\n<ul>\n<li>🐛 FIX: Class initialization</li>\n</ul>\n<h4>2.0.0</h4>\n<ul>\n<li>🔥 NEW: UI/UX with better experience</li>\n<li>🔥 NEW: ChatGPT Bot Blocker &#8211; Block ChatGPT Bot supported in free version</li>\n<li>🔥 NEW: Ads.txt and App-ads.txt support for free version</li>\n<li>🐛 FIX: Personalization line break issue</li>\n<li>🐛 FIX: Other fixed and improvements</li>\n</ul>\n"
    },
    "short_description": "All-in-One SEO plugin for Wordpress Robots.txt optimization with XML Sitemap detection (Yoast, Rank Math, ...), Woocommerce booster, Robots.",
    "description": "<p>Better Robots.txt generates a virtual robots.txt for WordPress, enhancing your website&#8217;s SEO (indexation capabilities, Google ranking, etc.) and its loading performance. Our plugin is compatible with Yoast SEO, Rank Math, Google Merchant, WooCommerce, and directory-based network sites (MULTISITE) and features now (2023) exclusive Artificial Intelligence (OpenAI) optimization settings for greater performance.</p>\n<p>With Better Robots.txt, you can specify which search engines are permitted to crawl your website and provide clear directives about their allowed activities. You can also set a crawl-delay to shield your hosting server from aggressive scrapers. Better Robots.txt empowers you with complete control over your WordPress robots.txt content through the custom setting box.</p>\n<p>Minimize <a href=\"https://better-robots.com/how-to-save-the-planet-with-your-website/\" rel=\"nofollow ugc\">your site&#8217;s ecological footprint and the production of greenhouse gas</a> (CO2) associated with its online presence.</p>\n<p>According to ChatGPT (OpenAI), the robots.txt produced by the PRO version of Better-Robots.txt is the most sophisticated and comprehensive available on the WEB for a WordPress site.</p>\n<p><strong>A quick overview:</strong></p>\n<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/306589027\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p><strong>SUPPORTED IN 7 LANGUAGES</strong></p>\n<p>Better Robots.txt plugins are available and translated into the following languages: Chinese –汉语/漢語, English, French – Français, Russian –Руссɤɢɣ, Portuguese – Português, Spanish – Español, German – Deutsch.</p>\n<p>Did you know that…</p>\n<ul>\n<li>The robots.txt file is a straightforward text file positioned on your web server that instructs web crawlers (like Googlebot) on whether they should access a file or not.</li>\n<li>The robots.txt file governs how search engine spiders perceive and engage with your web pages;</li>\n<li>This file and the bots it communicates with, are integral components of how search engines operate;</li>\n<li>The initial thing a search engine crawler examines when it visits a page is the robots.txt file;</li>\n</ul>\n<p><strong>The robots.txt is a reservoir of SEO potential that&#8217;s ready to be tapped into. Give Better Robots.txt a try!</strong></p>\n<p><strong>About the Pro version (additional features):</strong></p>\n<p><strong>1. Enhance your content visibility on search engines with your sitemap!</strong></p>\n<p>Ensure your pages, articles, and products, even the most recent ones, are recognized by search engines!</p>\n<p>The Better Robots.txt plugin is designed to integrate with the Yoast SEO plugin and Rank Math (arguably the best SEO Plugin for WordPress websites). It will automatically detect if you are using Yoast SEO / Rank Math and if the sitemap feature is enabled. If so, it will automatically add instructions to the Robots.txt file directing bots/crawlers to review your sitemap for recent changes on your website (allowing search engines to crawl any new content).</p>\n<p>If you wish to add your own sitemap (or if you are using a different SEO plugin), you simply need to copy and paste your Sitemap URL, and Better Robots.txt will incorporate it into your WordPress Robots.txt.</p>\n<p><strong>2. Safeguard your data and content</strong></p>\n<p>Prevent harmful bots from scraping your website and exploiting your data.</p>\n<p>The Better Robots.txt plugin assists in blocking most common malicious bots from crawling and scraping your data.</p>\n<p>There are both beneficial and harmful bots that crawl your site. Beneficial bots, like Google bot, crawl your site to index it for search engines. However, others crawl your site for more malicious reasons such as repurposing your content (text, price, etc.) for republishing, downloading entire archives of your site, or extracting your images. Some bots have even been reported to crash entire websites due to excessive bandwidth usage.</p>\n<p>The Better Robots.txt plugin shields your website against spiders/scrapers identified as harmful bots by Distil Networks.</p>\n<p><strong>3. Conceal &amp; safeguard your backlinks</strong></p>\n<p>Prevent competitors from discovering your profitable backlinks.</p>\n<p>Backlinks, also known as &#8220;inbound links&#8221; or &#8220;incoming links,&#8221; are created when one website links to another. The link to an external website is called a backlink. Backlinks are particularly valuable for SEO as they signify a &#8220;vote of confidence&#8221; from one site to another. Essentially, backlinks to your website signal to search engines that others endorse your content.</p>\n<p>If numerous sites link to the same webpage or website, search engines can deduce that the content is link-worthy, and therefore worth displaying on a SERP. Thus, earning these backlinks can positively impact a site&#8217;s ranking position or search visibility. In the SEM industry, it&#8217;s common for specialists to identify the sources of these backlinks (competitors) to select the best ones and generate high-quality backlinks for their own clients.</p>\n<p>Given that creating highly profitable backlinks for a company is time-consuming (time + energy + budget), allowing your competitors to identify and replicate them so easily is a significant loss of efficiency.</p>\n<p><strong>Better Robots.txt aids in blocking all SEO crawlers (aHref, Majestic, Semrush) to keep your backlinks hidden.</strong></p>\n<p><strong>4. Prevent Spam Backlinks</strong></p>\n<p>Bots that populate your website&#8217;s comment forms with messages like &#8216;great article,&#8217; &#8216;love the info,&#8217; &#8216;hope you can elaborate more on the topic soon&#8217; or even personalized comments, including the author&#8217;s name, are widespread. Spambots are becoming increasingly sophisticated over time, and unfortunately, comment spam links can seriously damage your backlink profile.</p>\n<p>Better Robots.txt assists in preventing these comments from being indexed by search engines.</p>\n<p><strong>5. Artificial Intelligence at the service of Robots.txt</strong></p>\n<p>In 2023, we added a robots.txt optimization feature based on OpenAI&#8217;s (ChatGPT) recommendations for any WordPress site. These settings maximize the efficiency of robots.txt for search engines to streamline the crawling of a website. More improvements are on the way&#8230;</p>\n<p>In 2023, ChatGPT 4, after auditing several million robots.txt files available on the WEB, assessed that the robots.txt deployed by the PRO version of the Better-Robots.txt plugin was the most advanced, comprehensive, and sophisticated configuration currently available for WordPress environments. A point of pride for our team!</p>\n<p><strong>6. SEO Tools</strong></p>\n<p>In the process of enhancing our plugin, we&#8217;ve incorporated shortcut links to two crucial tools for those concerned about their search engine rankings: Google Search Console &amp; Bing Webmaster Tool. If you&#8217;re not already utilizing them, you can now manage your website&#8217;s indexing while optimizing your robots.txt! We&#8217;ve also provided direct access to a Mass Ping tool, enabling you to ping your links on over 70 search engines.</p>\n<p>Additionally, we&#8217;ve created four shortcut links to some of the best Online SEO Tools, directly accessible through Better Robots.txt SEO PRO. This means you can now check your site&#8217;s loading performance, analyze your SEO score, identify your current SERP rankings with keywords &amp; traffic, and even scan your entire website for dead links (404, 503 errors, etc.) directly from the plugin.</p>\n<p><strong>7. Stand Out</strong></p>\n<p>We thought we could add a unique touch to Better Robots.txt by introducing a feature that lets you &#8220;customize&#8221; your WordPress robots.txt with your own distinctive &#8220;signature.&#8221; Many major companies worldwide have personalized their robots.txt by adding proverbs (https://www.yelp.com/robots.txt), slogans (https://www.youtube.com/robots.txt), or even drawings (https://store.nike.com/robots.txt – at the bottom). Why not do the same? That&#8217;s why we&#8217;ve dedicated a specific area on the settings page where you can write or draw anything you want (really) without affecting your robots.txt efficiency.</p>\n<p><strong>8. Prevent Crawling of Redundant WooCommerce Links</strong></p>\n<p>We&#8217;ve introduced a unique feature that blocks specific links (&#8220;add-to-cart&#8221;, &#8220;orderby&#8221;, &#8220;filter&#8221;, cart, account, checkout, etc.) from being crawled by search engines. Most of these links demand a significant amount of CPU, memory &amp; bandwidth usage (on the hosting server) as they are not cacheable and/or create &#8220;infinite&#8221; crawling loops (while they are unnecessary).</p>\n<p>By optimizing your WordPress robots.txt for WooCommerce when running an online store, you can allocate more processing power to the pages that truly matter and enhance your loading performance.</p>\n<p><strong>9. Dodge Crawler Traps</strong></p>\n<p>&#8220;Crawler traps&#8221; are structural issues within a website that lead crawlers to discover a virtually infinite number of irrelevant URLs. In theory, crawlers could get stuck in one part of a website and never finish crawling these irrelevant URLs.</p>\n<p>Better Robots.txt aids in preventing crawler traps, which can harm crawl budget and result in duplicate content.</p>\n<p><strong>10. Growth Hacking Tools</strong></p>\n<p>Today&#8217;s fastest-growing companies, including Amazon, Airbnb, and Facebook, have all achieved breakout growth by aligning their teams around a high-velocity testing/learning process. This is referred to as Growth Hacking. Growth hacking is a process of rapidly experimenting with and implementing marketing and promotional strategies that are solely focused on efficient and rapid business growth. Better Robots.txt provides a list of over 150+ tools available online to propel your growth.</p>\n<p><strong>11. Robots.txt Post Meta Box for Manual Exclusions</strong></p>\n<p>This Post Meta Box allows you to manually set if a page should be visible (or not) on search engines by injecting a dedicated &#8220;disallow&#8221; + &#8220;noindex&#8221; rule inside your WordPress robots.txt. Why is this beneficial for your ranking on search engines? Simply because some pages are not meant to be crawled/indexed.</p>\n<p>Thank you pages, landing pages, pages containing exclusively forms are useful for visitors but not for crawlers, and you don&#8217;t need them to be visible on search engines. Also, some pages containing dynamic calendars (for online booking) should NEVER be accessible to crawlers because they tend to trap them into infinite crawling loops which directly impacts your crawl budget (and your ranking).</p>\n<p><strong>12. Ads.txt &amp; App-ads.txt Crawlability</strong></p>\n<p>To ensure that ads.txt &amp; app-ads.txt can be crawled by search engines, the Better Robots.txt plugin ensures they are by default allowed in the Robots.txt file regardless of your configuration. For your information, Authorized Digital Sellers for Web, or ads.txt, is an IAB initiative to improve transparency in programmatic advertising.</p>\n<p>You can create your own ads.txt files to identify who is authorized to sell your inventory. The files are publicly available and crawlable by exchanges, Supply-Side Platforms (SSP), and other buyers and third-party vendors. Authorized Sellers for Apps, or app-ads.txt, is an extension to the Authorized Digital Sellers standard. It expands compatibility to support ads shown in mobile apps.</p>\n<p><strong>More enhancements are always on the way&#8230;</strong></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/better-robots-txt.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/better-robots-txt/assets/screenshot-1.png?rev=2334850",
            "caption": "Better Robots.txt Settings Page"
        },
        {
            "src": "https://ps.w.org/better-robots-txt/assets/screenshot-2.jpg?rev=2334850",
            "caption": "Better Robots.txt Settings Page"
        },
        {
            "src": "https://ps.w.org/better-robots-txt/assets/screenshot-3.jpg?rev=2334850",
            "caption": "Better Robots.txt Settings Page"
        },
        {
            "src": "https://ps.w.org/better-robots-txt/assets/screenshot-4.jpg?rev=2334850",
            "caption": "Better Robots.txt Settings Page"
        },
        {
            "src": "https://ps.w.org/better-robots-txt/assets/screenshot-5.jpg?rev=2334850",
            "caption": "Robots.txt file output"
        },
        {
            "src": "https://ps.w.org/better-robots-txt/assets/screenshot-6.jpg?rev=2334850",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/better-robots-txt/assets/screenshot-7.jpg?rev=2334850",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/better-robots-txt/assets/screenshot-8.jpg?rev=2334850",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/better-robots-txt/assets/screenshot-9.jpg?rev=2334850",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/better-robots-txt/assets/screenshot-10.jpg?rev=2334850",
            "caption": ""
        }
    ],
    "tags": {
        "crawler": "crawler",
        "robots": "robots",
        "robots-txt": "robots.txt",
        "search-engines": "search engines",
        "seo": "seo"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/better-robots-txt.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/better-robots-txt.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/better-robots-txt.1.0.2.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/better-robots-txt.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/better-robots-txt.1.1.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/better-robots-txt.1.5.2.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/better-robots-txt/assets/banner-772x250.jpg?rev=1941286",
        "high": "https://ps.w.org/better-robots-txt/assets/banner-1544x500.jpg?rev=1941286"
    },
    "icons": {
        "1x": "https://ps.w.org/better-robots-txt/assets/icon-128x128.png?rev=1941286",
        "2x": "https://ps.w.org/better-robots-txt/assets/icon-256x256.png?rev=1941286"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 90,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "better-robots-txt",
            "language": "en_CA",
            "version": "2.0.0",
            "updated": "2022-02-11 01:40:46",
            "package": "http://downloads.wordpress.org/translation/plugin/better-robots-txt/2.0.0/en_CA.zip"
        },
        {
            "type": "plugin",
            "slug": "better-robots-txt",
            "language": "es_MX",
            "version": "2.0.0",
            "updated": "2020-01-31 22:12:13",
            "package": "http://downloads.wordpress.org/translation/plugin/better-robots-txt/2.0.0/es_MX.zip"
        },
        {
            "type": "plugin",
            "slug": "better-robots-txt",
            "language": "fr_FR",
            "version": "2.0.0",
            "updated": "2022-08-16 17:19:37",
            "package": "http://downloads.wordpress.org/translation/plugin/better-robots-txt/2.0.0/fr_FR.zip"
        }
    ]
}