{
    "name": "Official Integration for Billingo",
    "slug": "billingo",
    "version": "3.6.4",
    "author": "<a href=\"https://billingo.hu\">Billingo Zrt. </a>",
    "author_profile": "https://profiles.wordpress.org/billingo/",
    "contributors": {
        "billingo": {
            "profile": "https://profiles.wordpress.org/billingo/",
            "avatar": "https://secure.gravatar.com/avatar/81290552cb89a6f20f9f0d285822f733?s=96&d=monsterid&r=g",
            "display_name": "billingo"
        }
    },
    "requires": "5.3",
    "tested": "6.6.2",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 92,
    "ratings": {
        "5": 10,
        "4": 1,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 12,
    "support_url": "https://wordpress.org/support/plugin/billingo/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 3000,
    "last_updated": "2024-09-24 12:44:00",
    "added": "2016-04-20",
    "homepage": "",
    "sections": {
        "description": "<h4>FUNKCIÓK</h4>\n<p>A hivatalos Billingo plugin használata a Billingo előfizetési csomagokkal rendelkező felhasználók számára funkciókorlátozások nélkül elérhető.</p>\n<p>Bővítményünk a 2.0.0-ás verziót követően már a V3-as Billingo API kapcsolatot használja, amelynek köszönhetően még jobbá tehetjük a pluginünket.</p>\n<p>Korábbi verzió használata esetén átállási segédletünket itt találod: https://support.billingo.hu/content/797736961</p>\n<ul>\n<li>Manuális számla kiállítás &#8211; Amennyiben szereted ellenőrizni a rendeléseid a számla kiállítás előtt, lehetőséged van a számlák kiállítására egyesével. Minden beérkező rendelésnél a megjelenik majd a számlakészítés opció, ahol módosíthatsz a beállításokon is.</li>\n<li>Díjbekérő készítés &#8211; Pluginünk segítségével dönthetsz úgy, hogy díjbekérőt küldesz a vásárlóidnak első körben. Ebben az esetben, a függőben lévő rendelési állapotban egy díjbekérőt küldünk ki, majd a befizetést követően egy számlát tudsz kiállítani a rendelésről. A díjbekérő készítést fizetési módonként is beállíthatod.</li>\n<li>Automata számlakészítés &#8211; Az automatizmusok nagyban segíthetik az adminisztratív teendőid, emellett rengeteg időt spórolhatsz. A beállítási lehetőségek között megadhatod, hogy milyen rendelési állapotban kerüljenek kiállításra a számláid. Természetesen dönthetsz úgy, hogy elsőre csak piszkozatot készítesz, így lesz egy ellenőrzési lehetőséged is</li>\n<li>Automatikus sztornózási lehetőség &#8211; Abban az esetben, ha a vásárlód visszamondja a rendelését, viszont már kiállítottad a számlát, lehetőséged van a felületről sztornózást indítani. Megadhatod, hogy melyik rendelési állapotban készítsünk neked sztornó számlát.</li>\n<li>Számla típus választás &#8211; Kiválaszthatod, hogy vásárlóid számára hagyományos, vagy elektronikus számlát szeretnél kiállítani a webshopodból. Természetesen bármikor módosíthatsz, ha esetleg változtatni szeretnél.</li>\n<li>Nyelvesítési opciók &#8211; Számláid Magyar, Angol, Német, Francia, Horvát, Olasz, Román és Szlovák nyelven egyaránt kiállíthatod. Ezen felül bekapcsolhatod azt is, hogy ha valaki a weboldaladtól eltérő nyelven használja a böngészőjét, az adott nyelven kerüljön kiállításra a számla. Ehhez az opcióhoz WPML és Woocommerce Multilingual bővítményre is szükség van.</li>\n<li>Megjegyzések kezelése &#8211; Van lehetőséged arra, hogy globálisan adj megjegyzést a számláidhoz, de természetesen egyesével is tudod módosítani a kiállított számlák megjegyzéseit. Ezen felül hozzáadhatod a Barion tranzakciós fizetési azonosítót és a termékeid cikkszámát hozzáadhatod a tételek megjegyzéseihez is.</li>\n<li>Adószámmal kapcsolatos funkciók &#8211; Bizonyos vásárlási esetekben előfordul, hogy az adószámot fel kell tüntetni a kiállított számlákon. Ennek a megadását a WooCommerce alapvetően nem teszi lehetővé, viszont bővítményünk segítségével a rendeléseknél bekérheted a vásárló adószámát, majd ezt a kiállított számlán könnyedén, automatikusan megjelenítjük számodra.</li>\n<li>ÁFA beállítások &#8211; Nem a szokványos ÁFA beállításokat kell használnod? Esetlegesen vannak olyan tételek a termékeid között, amelyeket 0%-os ÁFA helyett AM vagy egyéb más jelöléssel helyettesítenél? Semmi gond, mert erre is tudunk megoldást nyújtani számodra. A beállításaidnál megadhatod, hogy az ÁFA felülírás a teljes termékpalettádra érvényes legyen, vagy csupán a 0%-os termékekre, ezen felül megadhatod azt is, hogy a szállítási díjakra vonatkozzon e a felülírás vagy sem. Természtesen, felsoroltuk neked azokat a választási lehetőségeket is a felületen, amellyel felülírhatod az alapértékeket.</li>\n<li>Fizetési módok és kapcsolódó funkciók &#8211; A WooCommerceben telepített fizetési módok megjelennek a Billingo modulban. Minden fizetési módod mellett kiválaszthatod azt, hogy mi jelenjen meg a kiállított számlán. Tehát, ha például közvetlen banki utalással fizet valaki, beállíthatod, hogy a számlán a fizetés módja átutalás legyen. Ezen felül minden fizetési mód esetén beállíthatod azt is, hogy hozzunk e létre díjbekérőt, vagy ha az adott rendelés sikeres volt, fizetettnek jelöljük e a kiállított számlát/díjbekérőt. Tehát, ha online bankkártyával fizet a vásárlód, és sikeres a vásárlás, az automatikusan kiállított számla egyből fizetettként kerül kiállításra.</li>\n<li>Kuponok használata &#8211; Abban az esetben, ha webáruházadban kuponokat is használsz, a kiállított számláidon ezek a kedvezmények is meg fognak jelenni. Ehhez csupán engedélyezned kell a webshopban a kuponhasználatot, majd a Billingo bővítmény ezt automatikusan feltünteti a számláidon.</li>\n<li>Számla értesítő rendszer &#8211; A vásárlók tájékoztatása mindig elsődleges szempont a rendelésekkel kapcsolatosan. Ebből nem maradhat ki a számlázás sem. Az általunk készített bővítmény segítségével automatikusan e-mailben elküldheted a felhasználóidnak a kiállított díjbekérőket és számlákat egyaránt.</li>\n<li>Rendelések kezelése &#8211; A rendelésektől kiállított számlák közvetlenül a rendeléskezelőből is megnyithatók. A PDF fájl letölthető a rendelési adatlapról. Minden számla készítésénél létrehozunk egy megjegyzést a rendeléshez, amin láthatod, hogy mikor és milyen sorszámmal készült el az adott számla.</li>\n<li>Támogatás és hibakezelés &#8211; Bővítményünk fejlesztése során törekszünk arra, hogy minden jelzést megfelelően tudjunk kezelni. Ahhoz, hogy a bejelentéseknek könnyedén utána tudjunk járni, elhelyeztünk egy hibakereső kódot a pluginünkben. Ennek a kódnak és a naplófájloknak köszönhetően, kérdés esetén azonnali segítséget tudunk nyújtani számodra kollégáinkkal.</li>\n</ul>\n<h4>HASZNÁLAT</h4>\n<p>Az összekötés a két felület között rendkívül egyszerű. Folyamatosan frissítjük felhasználói kézikönyvünkben az összekötésre vonatkozó segédletünket is, ahol lépésről lépésre mutatjuk be a bővítmény használatát.</p>\n<p>A segédletet ide kattintva érheted el: https://support.billingo.hu/content/97255646</p>\n<p>Pár kiemelt pont a működéssel kapcsolatosan:<br />\n*   Telepítést követően a WooCommerce/Beállítások menüpontban a Billingo fülön add meg a fiókodból kinyert API kulcsokat, majd ments rá a felületre.<br />\n*   Állítsd be a számodra megfelelő opciókat a funkciólistában.<br />\n*   Ezt követően a rendeléseidnél megjelenik jobboldalon egy számla szerkesztésre vonatkozó felület, itt manuálisan is ki tudod állítani a számláid rendelésenként.<br />\n*   Amennyiben az automatikus számla készítést választottad, a rendelés megfelelő állapotba állítását követően (pl.: Teljesítve) kiállítjuk a számlát.<br />\n*   Bizonyos rendelésenként az opciók gombra kattintva kikapcsolhatod a számlázást és adhatsz hozzá egyéni megjegyzést is.<br />\n*   Választhatsz ki sztornó állapotot is, így, ha a megadott rendelési állapotra állítod a rendelés státuszát (Pl.: visszamondva), a sztornó számla automatikusan elkészül.</p>\n<h4>EGYÉB INFORMÁCIÓK</h4>\n<p>A számla tételek és információk generálás előtt módosíthatók a wc_billingo_clientdata és wc_billingo_invoicedata filterekkel. Előbbi az ügyfél adatokat módosítja, utóbbi a számlán lévő tételeket. Ez minden esetben az éppen aktív téma functions.php fájlban történjen, hogy az esetleges plugin frissítés ne törölje ki a módosításokat!</p>\n<p>Például:</p>\n<pre><code>&lt;?php\n// Számlanyelv változtatás\nadd_filter('wc_billingo_invoicedata', 'wc_billingo_lang', 10, 2);\nfunction wc_billingo_lang($data, $order) {\n    $data['template_lang_code'] = 'en';\n    return $data;\n}\n</code></pre>\n",
        "installation": "<ol>\n<li>Töltsd le a bővítményt vagy telepítsd bel a Bővítmények menüpontban</li>\n<li>WooCommerce / Beállítások oldal alján megjelennek a Billingo beállítások, ezeket be kell állítani</li>\n<li>Beállíátsok elmentése után lehetőség van a fizetési módok összepárosítására a billingo rendszerében megfelelővel</li>\n</ol>\n",
        "changelog": "<p>= 3.6.2<br />\n* Fejlesztés: Adattörlőkód integrálása</p>\n<p>= 3.6.1<br />\n* Fejlesztés: Support folyamat és hibakeresés javítása</p>\n<p>= 3.6.0<br />\n* Fejlesztés: WooCommerce High-Performance Order Storage kompatibilitás</p>\n<p>= 3.5.0<br />\n* Fejlesztés: Hiányzó számlatömb vagy bankszámla automatikus eltávolítása<br />\n* Fejlesztés: Kerekítés optimalizálása</p>\n<p>= 3.4.7<br />\n* Javítés: Termék árak kerekítéséből adódó netto/bruttó eltérés hiba javítva</p>\n<p>= 3.4.6<br />\n* Fejlesztés: Adószám kinyerés optimalizálása, vendég vásárlónál felhasználó figyelmen kívül hagyása</p>\n<p>= 3.4.5<br />\n* Fejlesztés: Opció a manuális számlakészítésnél használt típus alapértelmezett beállítására</p>\n<p>= 3.4.4<br />\n* Javítás: ÁFA Jogcím speciális esetben beragadt</p>\n<p>= 3.4.3<br />\n* Fejlesztés: Szállítási adóknál az extra üres ÁFA kulcsok kihagyása.</p>\n<p>= 3.4.2<br />\n* Fejlesztés: &lt;0.5 sor adó számítás javítás</p>\n<p>= 3.4.1<br />\n* Fejlesztés: PHP verzió kompatibilitás javítása</p>\n<p>= 3.4.0<br />\n* Fejlesztés: Biztonsági frissítés</p>\n<p>= 3.3.9<br />\n* Fejlesztés: Piszkozatnál &#8220;Küldés Billingon keresztül&#8221; opció bekapcsolható</p>\n<p>= 3.3.8<br />\n* Fejlesztés: Mennyiségi egység felülírási lehetőség</p>\n<p>= 3.3.7<br />\n* Fejlesztés: Frissítés közbeni Woocommerce hiány által okozott rendszerhiba megszüntetése</p>\n<p>= 3.3.6<br />\n* Javítás: Új telepítésnél hiányzó napló mappa automatikus létrehozása</p>\n<p>= 3.3.5<br />\n* Fejlesztés: Többszörös számlagenerálás kizárása, ha a rendelés több lapon is nyitva van</p>\n<p><h4>3.3.4</h4>\n</p>\n<ul>\n<li>Fejlesztés: Manuális számlakészítéskor korábbi díjbekérő figyelmen kívül hagyására opció (rendelés módosítás esetén szükséges)</li>\n</ul>\n<h4>3.3.3</h4>\n<ul>\n<li>Javítás: -0% áfakulcs megoldva kedvezményeknél</li>\n</ul>\n<h4>3.3.2</h4>\n<ul>\n<li>Javítás: jogcím mező elállítódás</li>\n</ul>\n<h4>3.3.1</h4>\n<ul>\n<li>Fejlesztés: Javított szállító ÁFA lekérés</li>\n<li>Fejlesztés: Cégnévre whitespace szűrés, hogy ne fogadja el a &#8221; &#8220;-t cégnévnek</li>\n</ul>\n<h4>3.3.0</h4>\n<ul>\n<li>Fejlesztés: Bankszámla választás opció</li>\n<li>Fejlesztés: &#8220;Pénzügyi teljesítést nem igényel&#8221; jelölés</li>\n<li>Fejlesztés: Piszkozat is lehet fizetettnek jelölt (éles számla beállításai alapján)</li>\n</ul>\n<h4>3.2.7</h4>\n<ul>\n<li>Fejlesztés: WordPress dátum függvényre váltás, hogy elkerüljük az időzónák miatti gondokat</li>\n<li>Fejlesztés: Log áthelyezve wp_content/uploads/billingo mappába, hogy ne törlődjön plugin frissítéskor</li>\n</ul>\n<h4>3.2.6</h4>\n<ul>\n<li>Fejlesztés: WooCommerce Subscriptions email csatolmány kompatibilitás</li>\n</ul>\n<h4>3.2.5</h4>\n<ul>\n<li>Javítás: hiányzó get_plugin_data() függvény hiba</li>\n</ul>\n<h4>3.2.4</h4>\n<ul>\n<li>Fejlesztés: 9.5% ÁFA kulcs támogatása</li>\n</ul>\n<h4>3.2.3</h4>\n<ul>\n<li>Javítás: Admin rendelés lista proforma ikon mutatása új rendeléseknél</li>\n</ul>\n<h4>3.2.2</h4>\n<ul>\n<li>Fejlesztés: Termék variáns hozzáadása a termék névhez</li>\n</ul>\n<h4>3.2.1</h4>\n<ul>\n<li>Javítás: Adatbázis tábla hiány önjavítás</li>\n</ul>\n<h4>3.2.0</h4>\n<ul>\n<li>Fejlesztés: Manuálisan is lehet piszkotatot létrehozni</li>\n<li>Javítás: Automatikusan éles számla készült piszkozat helyett is</li>\n</ul>\n<h4>3.1.0</h4>\n<ul>\n<li>Javítás: Partner tárolás API Kulcs függőség bevezetése</li>\n<li>Fejlesztés: Opcionális alrendelés számlázás tiltás</li>\n</ul>\n<h4>3.0.0</h4>\n<ul>\n<li>Fejlesztés: Billingo SDK csere konfliktus mentes megoldásra</li>\n<li>Javítás: Adó kulcs lekérés pontosítása</li>\n</ul>\n<h4>2.6.0</h4>\n<ul>\n<li>Fejlesztés: Létező díjbekérő esetén számlagenerálás a díjbekérő alapján</li>\n</ul>\n<h4>2.5.1</h4>\n<ul>\n<li>Javítás: Fee adó típus</li>\n</ul>\n<h4>2.5.0</h4>\n<ul>\n<li>Fejlesztés: Billingo API frissítve 3.0.13-ra</li>\n<li>Fejlesztés: ÁFA kulcsok és jogcímek felvétele</li>\n</ul>\n<h4>2.4.0</h4>\n<ul>\n<li>Fejlesztés: Billingo API frissítve 3.0.12-re</li>\n<li>Javítás: Partner duplikáció</li>\n</ul>\n<h4>2.3.2</h4>\n<ul>\n<li>Javítás: Teljesítés dátum felülíródott</li>\n<li>Javítás: Egyedi rendelési státuszoknál számla generálás indítás</li>\n</ul>\n<h4>2.3.1</h4>\n<ul>\n<li>Fejlesztés: Hiányzó fordítások pótlása</li>\n</ul>\n<h4>2.3.0</h4>\n<ul>\n<li>Javítás: E-mail küldés átdolgozva, megoldva a duplikált küldés, és a hiányzó gomb</li>\n<li>Javítás: Storno számla generáláskor hiba javítva</li>\n</ul>\n<h4>2.2.0</h4>\n<ul>\n<li>Fejlesztés: Opció a szállítás megjelenítésére akkor is, ha 0 összegű</li>\n<li>Fejlesztés: Billingo API frissítve 3.0.10-re</li>\n<li>Fejlesztés: V2 számla konvertálása V3 API-s sztornózáskor</li>\n<li>Javítás: Fallback fizetési mód hiba megszüntetve</li>\n<li>Fejlesztés: Választható fallback fizetési mód</li>\n<li>Javítás: Nullával osztás nulla értékű díjak esetén kizárva</li>\n<li>Javítás: Számla link hiba az AJAX válaszban (generáláskor)</li>\n</ul>\n<h4>2.1.1</h4>\n<ul>\n<li>Fejlesztés: Cikkszám átadás &#8220;variable product&#8221; esetén is</li>\n</ul>\n<h4>2.1.0</h4>\n<ul>\n<li>Fejlesztés: E-mail beállítások egységesítve, díjbekérő és sztornó is küldhető automatikusan</li>\n<li>Fejlesztés: Kompatibilitás rendelés sorszámozó pluginokkal</li>\n</ul>\n<h4>2.0.4</h4>\n<ul>\n<li>Fejlesztés: Javított HuCommerce compatibilitás (adószám mező használata)</li>\n</ul>\n<h4>2.0.2</h4>\n<ul>\n<li>Módosítás: Nem egész mennyiségek engedélyezve</li>\n</ul>\n<h4>2.0.1</h4>\n<ul>\n<li>Javítás: ÁFA felülírás hiba javítva</li>\n</ul>\n<h4>2.0.0</h4>\n<ul>\n<li>Fejlesztés: API átírva 3-as verzióra</li>\n<li>Módosítás: Adószám mező és figyelmeztetés megjelenítési határ módosítás</li>\n<li>!!! A frissítés telepítése után újra konfigurálni kell a Billingo Plugin beállításait! Új (v3) API kulcs igénylése is szükséges (https://app.billingo.hu/api-key [Hatáskör: Olvasás, Írás]).</li>\n</ul>\n<h4>1.10.0</h4>\n<ul>\n<li>Fejlesztés: Jobb szállító adó felismerés</li>\n</ul>\n<h4>1.9.9</h4>\n<ul>\n<li>Javítás: Log mappa külső hozzáférés megakadályozása</li>\n</ul>\n<h4>1.9.8</h4>\n<ul>\n<li>Javítás: Számla letöltése gomb az e-mailekben completed állapotra váltás esetén</li>\n</ul>\n<h4>1.9.7</h4>\n<ul>\n<li>Fejlesztés: Adószám mező mindig látható (nem csak 100e felett)</li>\n<li>Fejlesztés: Tizedes érték engedélyezése mennyiségben</li>\n<li>Javítás: Fizetési mód alapértelmezés, ha nincs párosítva.</li>\n<li>Fejlesztés: Link a beállításokhoz a plugin lista oldalon</li>\n</ul>\n<h4>1.9.6</h4>\n<ul>\n<li>Fejlesztés: HuCommerce plugin adószám mezőjének automatikus kezelése</li>\n</ul>\n<h4>1.9.5</h4>\n<ul>\n<li>Fejlesztés: cím második sor átadása</li>\n</ul>\n<h4>1.9.4</h4>\n<ul>\n<li>Javítás: Magyarország kihagyása EU/EUK felülírásból</li>\n</ul>\n<h4>1.9.3</h4>\n<ul>\n<li>Fejlesztés: Email gomb szöveg módosítható beállításokból</li>\n</ul>\n<h4>1.9.2</h4>\n<ul>\n<li>Javítás: E-mail gomb fordíthatóság</li>\n</ul>\n<h4>1.9.1</h4>\n<ul>\n<li>Javítás: termék ÁFA lekérés módszer csere</li>\n</ul>\n<h4>1.9.0</h4>\n<ul>\n<li>Fejlesztés: Sztornózási képesség, manuálisan és automatikusan</li>\n<li>Fejlesztés: Állítható mely rendelésállapotban jöjjön létre a számla</li>\n</ul>\n<h4>1.8.8</h4>\n<ul>\n<li>Fejlesztés: Díjbekérő számlák fizetettre állításának külön kezelése</li>\n</ul>\n<h4>1.8.7</h4>\n<ul>\n<li>Javítás: Kompatibilitás egy országos beállítással</li>\n</ul>\n<h4>1.8.6</h4>\n<ul>\n<li>Fejlesztés: Cikkszám hozzáadható a termék megjegyzéshez</li>\n</ul>\n<h4>1.8.5</h4>\n<ul>\n<li>Javítás: ÁFA % float pontatlanság</li>\n<li>Javítás: számla linkek új tabon nyitása</li>\n<li>Javítás: kupon lekérdezés hiba Woo 3.7 előtt</li>\n<li>Fejlesztés: prefix mentése a számlaszámmal</li>\n<li>Javítás: Manuális számlakészítésnél teljesítés dátuma és megjegyzés csak akkor került be, ha volt beállítva határidő is.</li>\n<li>Javítás: Hiányzó mennyiségi egység az extra díjaknál, pl utánvét.</li>\n</ul>\n<h4>1.8.4</h4>\n<ul>\n<li>Frissítés: WordPress biztonsági előírásaihoz alkalmazkodás.</li>\n</ul>\n<h4>1.8.3</h4>\n<ul>\n<li>Javítás: Ingyenes szállítás esetén 27%-os ÁFA kulcs.</li>\n</ul>\n<h4>1.8.2</h4>\n<ul>\n<li>API kérések kikapcsolása, amíg nincsenek megadva a kulcsok</li>\n</ul>\n<h4>1.8.1</h4>\n<ul>\n<li>hibajavítások</li>\n<li>adószám mező használható a rendelésből is</li>\n</ul>\n<h4>1.8.0</h4>\n<ul>\n<li>ÁFA kulcs javítások</li>\n</ul>\n<h4>1.7.0</h4>\n<ul>\n<li>Kuponkedvezmények javítás</li>\n</ul>\n<h4>1.6.8</h4>\n<ul>\n<li>hibajavítások</li>\n</ul>\n<h4>1.6.7</h4>\n<ul>\n<li>hibajavítások</li>\n</ul>\n<h4>1.6.6</h4>\n<ul>\n<li>official release</li>\n</ul>\n<h4>1.3.7</h4>\n<ul>\n<li>hibajavítások</li>\n</ul>\n<h4>1.3.6</h4>\n<ul>\n<li>hibajavítások</li>\n</ul>\n<h4>1.3.5</h4>\n<ul>\n<li>hibajavítások</li>\n</ul>\n<h4>1.3.4</h4>\n<ul>\n<li>hibajavítások</li>\n</ul>\n<h4>1.3.3</h4>\n<ul>\n<li>nem készülhet duplikált dokumentum akkor sem, ha új kérés fut, de a régi még nem tért vissza</li>\n<li>teljesített rendelés woocommerce e-mailbe bekerült a számla letöltése gomb</li>\n<li>nem készülhet duplán díjbekérő a státuszok változtatásakor</li>\n<li>fizetési módok &#8220;Díjbekérő&#8221; opciója, ha nincs bepipálva (pl. azonnali online fizetési módoknál), nem fog díjbekérő készülni</li>\n</ul>\n<h4>1.3.2</h4>\n<ul>\n<li>Hibajavítások</li>\n</ul>\n<h4>1.3.1</h4>\n<ul>\n<li>Kapcsolható, hogy csak a cégnév vagy cégnév és a teljes név kerüljön megjelenésre.</li>\n</ul>\n<h4>1.3.0</h4>\n<ul>\n<li>Vezetéknév Keresztnév felcserélése opció</li>\n<li>Fizetési módoknál pénzügyi teljesítést nem igényel opció</li>\n<li>Külön Billingo menü, optimalizálás</li>\n</ul>\n<h4>1.2.5</h4>\n<ul>\n<li>Az áfa kulcsokat lehet párosítani</li>\n</ul>\n<h4>1.2.4</h4>\n<ul>\n<li>Kerekítési lehetőség hozzáadása a billingo konfigurációs oldalhoz / adding rounding option to billingo config</li>\n</ul>\n<h4>1.2.3</h4>\n<ul>\n<li>a számla a kosár devizanemében kerül kiállításra kódoptimalizálás</li>\n</ul>\n<h4>1.1.9</h4>\n<ul>\n<li>Removed duplicated array item assignment to fix shipping unit value</li>\n</ul>\n<h4>1.1.8</h4>\n<ul>\n<li>Shipping unit added</li>\n</ul>\n<h4>1.1.7</h4>\n<ul>\n<li>Calculation changes: rounds removed, billingo gets brutto values to calculate the position prices</li>\n</ul>\n<h4>1.1.6</h4>\n<ul>\n<li>Hibajavítások</li>\n</ul>\n<h4>1.1.5</h4>\n<ul>\n<li>Hibajavítás: utánvét esetén nem készül díbekérő; szállítási költség számolási javítás (bruttó, nettó)</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Hibajavítások</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Fizetési határidő fizetési módonként</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Hibajavítások</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>WooCommerce 3.0 kompatibilitás</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>Megadható az adószám, 100e ft feletti áfatartalomnál a vásárlás oldalon megjelenik az adószám mező(opcionális) és egy figyelmeztetés, hogy kötelező megadni, ha van.</li>\n<li>Ha nem sikerült létrehozni számlát, akkor a rendelés megjegyzéseibe bekerül, hogy mi volt a hiba</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Ingyenes szállítás javítása, forrás: https://www.facebook.com/groups/wpcsoport/permalink/1415346541816505/</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Számlatömb ID megadható a beállításokban</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>WordPress.org-ra feltöltött plugin első verziója</li>\n</ul>\n"
    },
    "short_description": "Hivatalos Billingo összeköttetés WooCommerce-hez.",
    "description": "<h4>FUNKCIÓK</h4>\n<p>A hivatalos Billingo plugin használata a Billingo előfizetési csomagokkal rendelkező felhasználók számára funkciókorlátozások nélkül elérhető.</p>\n<p>Bővítményünk a 2.0.0-ás verziót követően már a V3-as Billingo API kapcsolatot használja, amelynek köszönhetően még jobbá tehetjük a pluginünket.</p>\n<p>Korábbi verzió használata esetén átállási segédletünket itt találod: https://support.billingo.hu/content/797736961</p>\n<ul>\n<li>Manuális számla kiállítás &#8211; Amennyiben szereted ellenőrizni a rendeléseid a számla kiállítás előtt, lehetőséged van a számlák kiállítására egyesével. Minden beérkező rendelésnél a megjelenik majd a számlakészítés opció, ahol módosíthatsz a beállításokon is.</li>\n<li>Díjbekérő készítés &#8211; Pluginünk segítségével dönthetsz úgy, hogy díjbekérőt küldesz a vásárlóidnak első körben. Ebben az esetben, a függőben lévő rendelési állapotban egy díjbekérőt küldünk ki, majd a befizetést követően egy számlát tudsz kiállítani a rendelésről. A díjbekérő készítést fizetési módonként is beállíthatod.</li>\n<li>Automata számlakészítés &#8211; Az automatizmusok nagyban segíthetik az adminisztratív teendőid, emellett rengeteg időt spórolhatsz. A beállítási lehetőségek között megadhatod, hogy milyen rendelési állapotban kerüljenek kiállításra a számláid. Természetesen dönthetsz úgy, hogy elsőre csak piszkozatot készítesz, így lesz egy ellenőrzési lehetőséged is</li>\n<li>Automatikus sztornózási lehetőség &#8211; Abban az esetben, ha a vásárlód visszamondja a rendelését, viszont már kiállítottad a számlát, lehetőséged van a felületről sztornózást indítani. Megadhatod, hogy melyik rendelési állapotban készítsünk neked sztornó számlát.</li>\n<li>Számla típus választás &#8211; Kiválaszthatod, hogy vásárlóid számára hagyományos, vagy elektronikus számlát szeretnél kiállítani a webshopodból. Természetesen bármikor módosíthatsz, ha esetleg változtatni szeretnél.</li>\n<li>Nyelvesítési opciók &#8211; Számláid Magyar, Angol, Német, Francia, Horvát, Olasz, Román és Szlovák nyelven egyaránt kiállíthatod. Ezen felül bekapcsolhatod azt is, hogy ha valaki a weboldaladtól eltérő nyelven használja a böngészőjét, az adott nyelven kerüljön kiállításra a számla. Ehhez az opcióhoz WPML és Woocommerce Multilingual bővítményre is szükség van.</li>\n<li>Megjegyzések kezelése &#8211; Van lehetőséged arra, hogy globálisan adj megjegyzést a számláidhoz, de természetesen egyesével is tudod módosítani a kiállított számlák megjegyzéseit. Ezen felül hozzáadhatod a Barion tranzakciós fizetési azonosítót és a termékeid cikkszámát hozzáadhatod a tételek megjegyzéseihez is.</li>\n<li>Adószámmal kapcsolatos funkciók &#8211; Bizonyos vásárlási esetekben előfordul, hogy az adószámot fel kell tüntetni a kiállított számlákon. Ennek a megadását a WooCommerce alapvetően nem teszi lehetővé, viszont bővítményünk segítségével a rendeléseknél bekérheted a vásárló adószámát, majd ezt a kiállított számlán könnyedén, automatikusan megjelenítjük számodra.</li>\n<li>ÁFA beállítások &#8211; Nem a szokványos ÁFA beállításokat kell használnod? Esetlegesen vannak olyan tételek a termékeid között, amelyeket 0%-os ÁFA helyett AM vagy egyéb más jelöléssel helyettesítenél? Semmi gond, mert erre is tudunk megoldást nyújtani számodra. A beállításaidnál megadhatod, hogy az ÁFA felülírás a teljes termékpalettádra érvényes legyen, vagy csupán a 0%-os termékekre, ezen felül megadhatod azt is, hogy a szállítási díjakra vonatkozzon e a felülírás vagy sem. Természtesen, felsoroltuk neked azokat a választási lehetőségeket is a felületen, amellyel felülírhatod az alapértékeket.</li>\n<li>Fizetési módok és kapcsolódó funkciók &#8211; A WooCommerceben telepített fizetési módok megjelennek a Billingo modulban. Minden fizetési módod mellett kiválaszthatod azt, hogy mi jelenjen meg a kiállított számlán. Tehát, ha például közvetlen banki utalással fizet valaki, beállíthatod, hogy a számlán a fizetés módja átutalás legyen. Ezen felül minden fizetési mód esetén beállíthatod azt is, hogy hozzunk e létre díjbekérőt, vagy ha az adott rendelés sikeres volt, fizetettnek jelöljük e a kiállított számlát/díjbekérőt. Tehát, ha online bankkártyával fizet a vásárlód, és sikeres a vásárlás, az automatikusan kiállított számla egyből fizetettként kerül kiállításra.</li>\n<li>Kuponok használata &#8211; Abban az esetben, ha webáruházadban kuponokat is használsz, a kiállított számláidon ezek a kedvezmények is meg fognak jelenni. Ehhez csupán engedélyezned kell a webshopban a kuponhasználatot, majd a Billingo bővítmény ezt automatikusan feltünteti a számláidon.</li>\n<li>Számla értesítő rendszer &#8211; A vásárlók tájékoztatása mindig elsődleges szempont a rendelésekkel kapcsolatosan. Ebből nem maradhat ki a számlázás sem. Az általunk készített bővítmény segítségével automatikusan e-mailben elküldheted a felhasználóidnak a kiállított díjbekérőket és számlákat egyaránt.</li>\n<li>Rendelések kezelése &#8211; A rendelésektől kiállított számlák közvetlenül a rendeléskezelőből is megnyithatók. A PDF fájl letölthető a rendelési adatlapról. Minden számla készítésénél létrehozunk egy megjegyzést a rendeléshez, amin láthatod, hogy mikor és milyen sorszámmal készült el az adott számla.</li>\n<li>Támogatás és hibakezelés &#8211; Bővítményünk fejlesztése során törekszünk arra, hogy minden jelzést megfelelően tudjunk kezelni. Ahhoz, hogy a bejelentéseknek könnyedén utána tudjunk járni, elhelyeztünk egy hibakereső kódot a pluginünkben. Ennek a kódnak és a naplófájloknak köszönhetően, kérdés esetén azonnali segítséget tudunk nyújtani számodra kollégáinkkal.</li>\n</ul>\n<h4>HASZNÁLAT</h4>\n<p>Az összekötés a két felület között rendkívül egyszerű. Folyamatosan frissítjük felhasználói kézikönyvünkben az összekötésre vonatkozó segédletünket is, ahol lépésről lépésre mutatjuk be a bővítmény használatát.</p>\n<p>A segédletet ide kattintva érheted el: https://support.billingo.hu/content/97255646</p>\n<p>Pár kiemelt pont a működéssel kapcsolatosan:<br />\n*   Telepítést követően a WooCommerce/Beállítások menüpontban a Billingo fülön add meg a fiókodból kinyert API kulcsokat, majd ments rá a felületre.<br />\n*   Állítsd be a számodra megfelelő opciókat a funkciólistában.<br />\n*   Ezt követően a rendeléseidnél megjelenik jobboldalon egy számla szerkesztésre vonatkozó felület, itt manuálisan is ki tudod állítani a számláid rendelésenként.<br />\n*   Amennyiben az automatikus számla készítést választottad, a rendelés megfelelő állapotba állítását követően (pl.: Teljesítve) kiállítjuk a számlát.<br />\n*   Bizonyos rendelésenként az opciók gombra kattintva kikapcsolhatod a számlázást és adhatsz hozzá egyéni megjegyzést is.<br />\n*   Választhatsz ki sztornó állapotot is, így, ha a megadott rendelési állapotra állítod a rendelés státuszát (Pl.: visszamondva), a sztornó számla automatikusan elkészül.</p>\n<h4>EGYÉB INFORMÁCIÓK</h4>\n<p>A számla tételek és információk generálás előtt módosíthatók a wc_billingo_clientdata és wc_billingo_invoicedata filterekkel. Előbbi az ügyfél adatokat módosítja, utóbbi a számlán lévő tételeket. Ez minden esetben az éppen aktív téma functions.php fájlban történjen, hogy az esetleges plugin frissítés ne törölje ki a módosításokat!</p>\n<p>Például:</p>\n<pre><code>&lt;?php\n// Számlanyelv változtatás\nadd_filter('wc_billingo_invoicedata', 'wc_billingo_lang', 10, 2);\nfunction wc_billingo_lang($data, $order) {\n    $data['template_lang_code'] = 'en';\n    return $data;\n}\n</code></pre>\n",
    "download_link": "https://downloads.wordpress.org/plugin/billingo.3.6.4.zip",
    "upgrade_notice": {
        "2.0": "<p>A 2.0-ás verzió egy nagyszabású frissítés. A frissítés telepítése után újra kell konfigurálni a Billingo Plugin beállításait! <a href=\"https://app.billingo.hu/api-key\">Új (v3) API kulcs igénylése is szükséges</a>.</p>"
    },
    "screenshots": [],
    "tags": {
        "billingo": "billingo",
        "billingo-hu": "billingo.hu",
        "magyar": "magyar",
        "szamlazas": "szamlazas",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "3.6.4",
    "versions": {
        "0.0.2": "https://downloads.wordpress.org/plugin/billingo.0.0.2.zip",
        "1.0.0": "https://downloads.wordpress.org/plugin/billingo.1.0.0.zip",
        "2.0": "https://downloads.wordpress.org/plugin/billingo.2.0.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/billingo.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/billingo.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/billingo.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/billingo.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/billingo.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/billingo.2.0.5.zip",
        "2.0.6": "https://downloads.wordpress.org/plugin/billingo.2.0.6.zip",
        "2.0.7": "https://downloads.wordpress.org/plugin/billingo.2.0.7.zip",
        "2.0.8": "https://downloads.wordpress.org/plugin/billingo.2.0.8.zip",
        "2.0.9": "https://downloads.wordpress.org/plugin/billingo.2.0.9.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/billingo.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/billingo.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/billingo.2.1.2.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/billingo.2.1.3.zip",
        "2.1.4": "https://downloads.wordpress.org/plugin/billingo.2.1.4.zip",
        "2.1.5": "https://downloads.wordpress.org/plugin/billingo.2.1.5.zip",
        "2.1.6": "https://downloads.wordpress.org/plugin/billingo.2.1.6.zip",
        "2.1.7": "https://downloads.wordpress.org/plugin/billingo.2.1.7.zip",
        "2.1.8": "https://downloads.wordpress.org/plugin/billingo.2.1.8.zip",
        "2.1.9": "https://downloads.wordpress.org/plugin/billingo.2.1.9.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/billingo.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/billingo.2.2.1.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/billingo.2.2.2.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/billingo.2.2.3.zip",
        "2.2.4": "https://downloads.wordpress.org/plugin/billingo.2.2.4.zip",
        "2.2.5": "https://downloads.wordpress.org/plugin/billingo.2.2.5.zip",
        "2.2.6": "https://downloads.wordpress.org/plugin/billingo.2.2.6.zip",
        "2.2.8": "https://downloads.wordpress.org/plugin/billingo.2.2.8.zip",
        "2.2.9": "https://downloads.wordpress.org/plugin/billingo.2.2.9.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/billingo.2.3.0.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/billingo.2.4.0.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/billingo.2.5.0.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/billingo.2.6.0.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/billingo.2.7.0.zip",
        "2.8.0": "https://downloads.wordpress.org/plugin/billingo.2.8.0.zip",
        "2.9.0": "https://downloads.wordpress.org/plugin/billingo.2.9.0.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/billingo.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/billingo.3.0.1.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/billingo.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/billingo.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/billingo.3.0.4.zip",
        "3.0.5": "https://downloads.wordpress.org/plugin/billingo.3.0.5.zip",
        "3.0.8": "https://downloads.wordpress.org/plugin/billingo.3.0.8.zip",
        "3.0.9": "https://downloads.wordpress.org/plugin/billingo.3.0.9.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/billingo.3.1.0.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/billingo.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/billingo.3.2.1.zip",
        "3.2.5": "https://downloads.wordpress.org/plugin/billingo.3.2.5.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/billingo.3.3.0.zip",
        "3.3.2": "https://downloads.wordpress.org/plugin/billingo.3.3.2.zip",
        "3.3.4": "https://downloads.wordpress.org/plugin/billingo.3.3.4.zip",
        "3.3.6": "https://downloads.wordpress.org/plugin/billingo.3.3.6.zip",
        "3.3.8": "https://downloads.wordpress.org/plugin/billingo.3.3.8.zip",
        "3.4.0": "https://downloads.wordpress.org/plugin/billingo.3.4.0.zip",
        "3.4.6": "https://downloads.wordpress.org/plugin/billingo.3.4.6.zip",
        "3.6.0": "https://downloads.wordpress.org/plugin/billingo.3.6.0.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/billingo.3.6.1.zip",
        "3.6.2": "https://downloads.wordpress.org/plugin/billingo.3.6.2.zip",
        "3.6.3": "https://downloads.wordpress.org/plugin/billingo.3.6.3.zip",
        "3.6.4": "https://downloads.wordpress.org/plugin/billingo.3.6.4.zip",
        "trunk": "https://downloads.wordpress.org/plugin/billingo.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/billingo/assets/icon.svg?rev=2268314",
        "svg": "https://ps.w.org/billingo/assets/icon.svg?rev=2268314"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 92,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}