{
    "name": "BirdSeed",
    "slug": "birdseed",
    "version": "2.2.0",
    "author": "BirdSeed",
    "author_profile": "https://profiles.wordpress.org/birdseedapp/",
    "contributors": {
        "birdseed": {
            "profile": "https://profiles.wordpress.org/birdseed/",
            "avatar": "https://secure.gravatar.com/avatar/05c5315dd3cea9b6d8b32a610014a065?s=96&d=monsterid&r=g",
            "display_name": "Birdseed"
        }
    },
    "requires": "3.0.1",
    "tested": "6.1.7",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 68,
    "ratings": {
        "5": 3,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 5,
    "support_url": "https://wordpress.org/support/plugin/birdseed/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 100,
    "downloaded": 4858,
    "last_updated": "2022-12-12 19:03:00",
    "added": "2018-10-26",
    "homepage": "https://www.birdseed.io",
    "sections": {
        "description": "<p><em>BirdSeed is a full-featured live chat and all-in-one engagement tool, engineered to increase your revenue.</em></p>\n<p><strong>BirdSeed is the best website tool</strong> to raise your conversion rate without even changing a single <em>pixel</em> of the website you’ve worked so hard on.</p>\n<p>We approached the problem of <strong>increasing conversions</strong> by considering website visitors as <em>people</em> and what they want. Visitors to your website want to be engaged, and BirdSeed is designed to give them the exact kind of engagement they want exactly when they need it.</p>\n<h3>The Sky Is The Limit With BirdSeed’s Live Chat</h3>\n<p>Your first live chat with a customer could be minutes away! Install BirdSeed to bring your website engagement to the next level.</p>\n<ul>\n<li>Used on over 10,000+ websites</li>\n<li>Connect with website visitors one-on-one</li>\n<li>BirdSeed is incredibly easy to install on your website</li>\n<li>Install the iOS or Android app to respond to website visitors &#8211; whenever and wherever</li>\n<li>Completely customizable, no coding required</li>\n<li>Mobile responsive</li>\n<li>Instant video responses to customers</li>\n<li>Connects seamlessly with Zapier</li>\n<li>Multiple agents can chat with a single customer to resolve complicated issues fast</li>\n<li>Chat logs and history</li>\n<li>Assign chats to specific groups or agents</li>\n<li>Add your picture to your BirdSeed Live Chat window</li>\n<li>View missed chats</li>\n<li>Share chats with your team to discuss successes and opportunities</li>\n<li>Choose what pages your Live Chat displays on</li>\n</ul>\n<p><strong><em>The Live Chat features are just the start of what BirdSeed offers.</em></strong> <strong>BirdSeed has 12 tools, all rich with features and built to increase your conversions!</strong></p>\n<p><strong>Get BirdSeed and start growing your revenue today. Click ‘Download’ on the upper right of the page to get started!</strong></p>\n<h3>Easy Customization &amp; Endless Possibilities</h3>\n<p>We’ve made <strong>BirdSeed fully customizable</strong> because <em>you</em> have the most knowledge of your customers and their needs. You’ll have the opportunity to use your BirdSeed as a suite of tools that appears on every page (think Live Chat) or to target individual pages of your website with videos, FAQs, email capture, and more to help your visitors convert.</p>\n<p><strong>Managing your BirdSeed is as simple</strong> for you as using the tools is <strong>intuitive for your customers</strong>. In addition, BirdSeed can be integrated with Zapier or connection to over 5,000 other applications.</p>\n<p><strong>Track &amp; analyze</strong> all your visitor interactions with BirdSeed so you can continuously optimize what is working to turn visitors into customers.</p>\n<p><strong>Treat visitors like people</strong>, not numbers: offer live chat and other opportunities for them to get to know you, your team, products, and services. Personal connection with visitors, whether it happens through pre-recorded video messages, live chat, or phone calls is a powerful incentive for visitors to become loyal, satisfied customers.</p>\n<h3>Effortless Live Chat Is Just The Beginning</h3>\n<p>Our Live Chat feature is so excellent that many of our users are satisfied when they’ve implemented the Live Chat alone. BirdSeed has a whole suite of features that complement and enhance our Live Chat tool to increase visitor engagement, conversions, and customer connection to name a few.</p>\n<p>Proactive messaging is a groundbreaking feature that can make all the difference in engaging and connecting with your customers.</p>\n<h3>What’s Proactive Messaging?</h3>\n<p>BirdSeed’s Proactive Messaging gets your message noticed without getting in the way. Think of it as a greeter welcoming people as they enter a store. This could include a video introduction of your team, products, detailing your services, telling your customers how happy they chose your website and how eager you are to help them, or any of the other infinite possibilities.</p>\n<h3>Unlimited Options with Proactive Messaging</h3>\n<p>Anything you can put in text or video, you can put into your proactive message. Website owners often go to great lengths to set a specific tone for their website, obsessing over colors, fonts, and designs. With BirdSeed, you can quickly and directly set the tone you want for your website with a video and embed it in your BirdSeed within minutes. It really is that simple!</p>\n<p>You can have BirdSeed as a small, unobtrusive icon on each page of your website, or you can proactively greet every visitor with customized messages optimized to enhance the user experience on one specific page or across your whole website!</p>\n<h3>Help Customers Through the Checkout Process</h3>\n<p>If you’ve noticed that many people add items to their cart but fail to convert, you can set a video explaining the checkout and shipping options out of the way but immediately visible for confused or hesitant customers.</p>\n<h3>Connect and Convert</h3>\n<p>You can create short videos explaining your business and vision, which puts a human face on your business and connects with your waffling potential customer without forcing them to go to your “About Us” page in order to learn about you.</p>\n<p>Creating that personal connection increases trust, customer retention, and how much that connected customer is willing to spend.</p>\n<h3>Proactive Messaging Is Complementary to Live Chat</h3>\n<p>Who’s more likely to use a Live Chat feature?<br />\n&#8211; The customer that already saw a friendly face in your brief video?<br />\n&#8211; Or a customer who has to hunt for a small icon in the corner when they’re already confused?</p>\n<p>Proactive messages help you stay ahead of customers’ engagement and informational needs by connecting with them <strong><em>before</em></strong> they become frustrated or confused.</p>\n<p>BirdSeed’s natural and appealing live chat is our most popular tool, but the real advantage of BirdSeed lies in the synergy of all the tools, customized and tailored to your website and demographics:</p>\n<h3>Informational Tools</h3>\n<blockquote>\n<h3>Knowledge Base</h3>\n<p>Our knowledge base (AKA knowledge library) tool is easy to set up &amp; even easier for visitors to use.</p>\n</blockquote>\n<p>No need to learn how to code in order to quickly create functional knowledge bases. BirdSeed provides the user interface and experience you and your customers need. Knowledge bases <em>have</em> to be intuitive to use because they are designed for visitors to use even if they are unfamiliar with your website.</p>\n<p>BirdSeed shows your tools to the visitor, striking a balance between obvious and annoying. It’s always key to satisfy confused users quickly before they leave your website in frustration. Our knowledge base tool provides the answers your visitors need faster than any other possible method.</p>\n<p>Knowledge bases can also be targeted and customized to specific pages: for example ‘When will my order be shipped?’ on your product or checkout pages. Or you could show off an infographic detailing how an order moves from payment to shipping.</p>\n<p>You know the questions your customers want to have answered. Our tool can provide those answers to them before they ask!</p>\n<h4>Saving you &amp; your customers time</h4>\n<p>Having an effective knowledge base saves time for both you and your visitors. And saving your visitors time means they can move from landing page to checkout that much faster, increasing your conversions.</p>\n<p>Reducing customer confusion and frustration with a knowledge base directly increases customer satisfaction. That can go a long way to converting visitors who are on the fence about completing a transaction.</p>\n<h4>Using knowledge bases with live chat</h4>\n<p>Knowledge bases can’t beat live chat when it comes to providing customers with a personal connection and personalized information. But every customer who has their questions answered through your knowledge base is one you don’t have to spend time engaging through live chat.</p>\n<p>In addition, knowledge bases can save time on the customer side. It may take several minutes (or hours, if your business is closed) for your customer service representative to begin chatting with the user. Even a few minutes can be too much for some impatient visitors who will leave and never come back.</p>\n<p>But if their question is available and accessible in your knowledge base, that helps keep your visitor engaged and on your site without requiring them to wait for an answer.</p>\n<blockquote>\n<h3>Video Showcase</h3>\n<p>Get face-to-face with clients the first time they visit your site</p>\n</blockquote>\n<p>BirdSeed’s Video Showcase tool displays the videos you want your customers to see. These can be given custom names different than their Youtube or Vimeo titles and organized into custom sections.</p>\n<p>Videos can be directly embedded from Youtube or Vimeo, recorded and uploaded on the spot, or show off an image or GIF to introduce your website’s video showcase.</p>\n<p>Users have become increasingly likely to interact with videos compared to other forms of media. Providing videos that explain, introduce, or entertain gives customers the connection and engagement they expect from a top-of-the-line website.</p>\n<p>You could show off videos of client testimonials, put a face to your organization with a video introduction, give them a quick virtual tour of your website, or do all three!</p>\n<p>A great user experience isn’t likely to occur just through reading text. The standards of interactivity have been raised much higher than that. Take the next step in engagement with BirdSeed and use your videos to create a personal connection and increase your conversions.</p>\n<blockquote>\n<h3>Link Launcher</h3>\n<p>Direct users to your most important links with ease &amp; visual appeal</p>\n</blockquote>\n<p>With BirdSeed’s Link Launcher tool, it’s easy to direct users to the important, conversion-generating pages of your website that make you money. These can be customized to every page individually.</p>\n<p>For example, if a kitchen remodeling company has a blog post about “Best Kitchen Counters for Your Home” then they can use BirdSeed to link directly to their kitchen remodeling materials and services. Links are how your visitors navigate through your website.</p>\n<p>Make it easy for users to find your most important pages to keep them engaged and encourage conversion.</p>\n<h3>Authority Building Tools</h3>\n<blockquote>\n<h3>Event Announcement</h3>\n<p>Make sure the right people see your upcoming events</p>\n</blockquote>\n<p>The Event Announcement tool will show the user a quick snapshot of your upcoming events. This isn’t just to inform and engage the visitor, but also can be used to collect user emails.</p>\n<p>That will help you to follow up with those interested users later and even allow you to email them with a recording of the event afterward. You can also collect upvotes or gather feedback on coming events.</p>\n<p>Inside the event announcement tool you can attach embedded videos, GIFs, or custom embeds to each event individually. This could be a quick video explanation of the upcoming event, a teaser for the event, or a simple GIF form of the announcement to help catch the user’s attention and encourage email signup.</p>\n<blockquote>\n<h3>User Feedback</h3>\n<p>Gain valuable data about users by asking them quick questions</p>\n</blockquote>\n<p>On the spot user feedback can be a critical part of pleasing your customers, optimizing your website or service, or keeping them engaged and interested in your website.</p>\n<p>BirdSeed’s User Feedback tool allows you to customize both the questions and the possible answers your customers can provide. You can easily float new ideas in your website survey to determine beforehand if your target audience has any interest. For example, you could ask if your visitors would sign up for a newsletter, if you started one.</p>\n<p>But the possibilities go far beyond that. You can ask any question you want, and make the answer multiple choice, a free form text response, or emotional reactions you can customize.</p>\n<p>Again, no coding or complicated settings need to be changed to customize your user feedback survey. The setup on the back end is completely natural and easy to use.</p>\n<blockquote>\n<h3>Client Testimonials</h3>\n<p>Proudly display what your satisfied customers have to say</p>\n</blockquote>\n<p>The importance of customer testimonials has increased over the years. Now customers may expect you to have testimonials on your website regardless of your industry. Visitors may even fail to convert without compelling testimonials.</p>\n<p>If you have a great product or service, chances are you have some very happy customers. Don’t let that go to waste! Show your visitors that they can trust you by displaying your customer testimonials prominently.</p>\n<p>Displaying testimonials helps build on your previous work and success. Building a relationship with your customers is extremely important. This is especially true when you provide a recurring service or a  consumable product people will want again and again.</p>\n<p>Showing your customer testimonials helps new customers take the first step in trusting you and your business.</p>\n<blockquote>\n<h3>Live Chat</h3>\n<p>Humanize your website &amp; instantly connect with users in real-time</p>\n</blockquote>\n<p>Offering Live Chat gives your visitors a convenient and no-pressure way to engage with you about anything that’s on their minds.</p>\n<p>Answer questions about products, services, shipping times, and so on. Chatbots are often proposed as a viable alternative to live chat, but chatbots often frustrate customers. Keep Live Chat and complement it with a knowledge base of Frequently Asked Questions to answer FAQs that you know a lot of visitors ask before converting. Both of these tools can be paired up side by side in your BirdSeed.</p>\n<p>No one is frustrated by a well-designed knowledge base, but having a chatbot simulate an interaction is at best a disguised knowledge base and link launcher tool put together; at worst, they can be extremely frustrating.</p>\n<p>It’s easy to get started with BirdSeed in just a few minutes and give your customers a pleasant live chat experience that’s fully customizable to your website and visitors.</p>\n<blockquote>\n<h3>Phone Contact &amp; Call Request</h3>\n<p>Generate leads &amp; direct outreach from customers with call requests</p>\n</blockquote>\n<p>Getting started with our Call Request tool is extremely easy. Simply take your phone number and put it into your BirdSeed! People can begin to call or request a call back right away.</p>\n<p>In some industries, especially ones that offer highly customized services and products, it’s necessary to have a client call in order to generate a conversion. But even when you don’t need visitors to call in order to convert, they’ll call for plenty of other reasons. They might be confused, need personal help, or simply want to connect with you in a more personalized way. As far as generating a personal connection goes, phone calls are second only to face-to-face conversations.</p>\n<p>Calls have a more natural, conversational feel than other forms of communication such as email. In some ways, phone calls even beat out their main competitor, live chat. Live chat is highly versatile from both a customer and business standpoint, but phone calls are one of the best ways to engage with and sell to a customer.</p>\n<p>Phone contact isn’t just for phone calls. It’s also to ensure the customer has easy access any other contact information you want to provide: your physical address, email address, and so on.</p>\n<p>As with the knowledge base tool, it’s always best to answer customer questions before they ask them. Don’t make them ask for your phone number or address. Make sure your customers can always find your address or call you in a flash.</p>\n<h3>Direct Conversion Tools</h3>\n<blockquote>\n<h3>Schedule Meeting</h3>\n<p>Start booking appointments efficiently with our scheduling tool</p>\n</blockquote>\n<p>Service industries often need to schedule meetings in order to serve their clientele. Booking appointments is necessary for businesses from hair salons to medical providers. But handling all those booking requests manually is unnecessary and wastes time that should really be spent on other aspects of your business.</p>\n<p>The less time you spend scheduling appointments, the more time you actually have to serve your customers. In addition, not all customers are willing to call you over the phone in order to book their appointment. Providing a quick and convenient way to schedule their appointment can bring more visitors through your door with less work.</p>\n<p>There are plenty of other stand-alone appointment booking plugins out there, but for us, this is just one tool in BirdSeed’s entire suite. You can use the booking tool in parallel with other tools like live chat to encourage and guide visitors through the booking process if necessary. Or you could provide a video showcasing your facility and giving a quick guide to what they will experience when they actually come to the appointment.</p>\n<p>Regardless of your industry, if you need your customers to be able to book appointments quickly and easily from any page of your website, BirdSeed is the tool for you. The Schedule Meeting tool can be added to any page of your website in minutes, even if you are totally new to BirdSeed.</p>\n<p>Once your customer books an appointment, the meeting will display in your Schedule Dashboard. You can view all your future appointments or simply the ones booked for today, this week, or this month. It’s simple to keep all your meetings visible so you never miss an appointment.</p>\n<blockquote>\n<h3>Email Capture</h3>\n<p>Capture user information exactly when they&#8217;re ready to provide it</p>\n</blockquote>\n<p>Email lists are one of the most effective and powerful ways to engage your future customers and bring them back to your website. Offering value through a coupon, newsletter, blog, etc gives your visitors a reason to subscribe to your email list.</p>\n<p>BirdSeed can keep your email signup form obvious and accessible on every page of your website. It pairs well with a standard popup email capture form. If you don’t capture the user’s email at first, BirdSeed will remind and allow them to subscribe immediately from any page of your website. You can also target individual pages differently, either removing the email capture form or making it more prominent.</p>\n<p>Unlike other tools which lack customization options, BirdSeed enables you to completely change the email capture form to gather any customer information you need. You could capture their phone number, email address, name, birthday, or anything else. The possibilities are endless, and no programming is required to quickly and easily customize your form.</p>\n<blockquote>\n<h3>Contact Form</h3>\n<p>Collect responses from your users &amp; organize the info for later use.</p>\n</blockquote>\n<p>With our customizable contact form, you can immediately get started helping customers or following up on leads. These contact forms can be tailored to any industries needs, but as an example: You can assist customers who are experiencing an issue with your product or service, have them describe the problem, and their availability to receive a callback.</p>\n<p>Having a contact form guides the visitor through the path that you need them to take in order to help them. They could email you, but might not provide any details that would allow you to take the next step. This lengthens the process and delays the resolution.</p>\n<p>Asking them for the necessary information through your BirdSeed contact form helps the customer feel heard and understood before you even talk to them. That helps set the tone for future interactions as friendly and helpful, even if the customer is complaining or frustrated.</p>\n<p>Your contact form can also appear after business hours when your live chat is not available. Staffing live chat services 24/7 is not cost-effective for most small businesses. Substituting chat with contact forms when your business is closed helps ensure that those customers also are helped as soon as possible once you open the next day.</p>\n",
        "installation": "<p>It&#8217;s fast and easy to install the plugin and connect</p>\n<ol>\n<li>Install the plugin using the WordPress Plugins interface</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n<li>Navigate to &#8216;BirdSeed&#8217; from the WordPress admin</li>\n<li>Follow the onscreen instructions</li>\n</ol>\n",
        "changelog": "<h4>1.0</h4>\n<ul>\n<li>First version published</li>\n</ul>\n<h4>1.1</h4>\n<ul>\n<li>compatibility up to 5.6.1</li>\n</ul>\n<h4>1.2</h4>\n<ul>\n<li>compatibility up to 5.9.2</li>\n</ul>\n<h4>2.0</h4>\n<ul>\n<li>Complete rewrite to provide dynamic control over Birdseed and the platform</li>\n</ul>\n<h4>2.0.1</h4>\n<ul>\n<li>Fixed caching issue within the backend</li>\n</ul>\n"
    },
    "short_description": "This plugin allows you to easily add your BirdSeed widget from birdseed.io to your Wordpress website.",
    "description": "<p><em>BirdSeed is a full-featured live chat and all-in-one engagement tool, engineered to increase your revenue.</em></p>\n<p><strong>BirdSeed is the best website tool</strong> to raise your conversion rate without even changing a single <em>pixel</em> of the website you’ve worked so hard on.</p>\n<p>We approached the problem of <strong>increasing conversions</strong> by considering website visitors as <em>people</em> and what they want. Visitors to your website want to be engaged, and BirdSeed is designed to give them the exact kind of engagement they want exactly when they need it.</p>\n<h3>The Sky Is The Limit With BirdSeed’s Live Chat</h3>\n<p>Your first live chat with a customer could be minutes away! Install BirdSeed to bring your website engagement to the next level.</p>\n<ul>\n<li>Used on over 10,000+ websites</li>\n<li>Connect with website visitors one-on-one</li>\n<li>BirdSeed is incredibly easy to install on your website</li>\n<li>Install the iOS or Android app to respond to website visitors &#8211; whenever and wherever</li>\n<li>Completely customizable, no coding required</li>\n<li>Mobile responsive</li>\n<li>Instant video responses to customers</li>\n<li>Connects seamlessly with Zapier</li>\n<li>Multiple agents can chat with a single customer to resolve complicated issues fast</li>\n<li>Chat logs and history</li>\n<li>Assign chats to specific groups or agents</li>\n<li>Add your picture to your BirdSeed Live Chat window</li>\n<li>View missed chats</li>\n<li>Share chats with your team to discuss successes and opportunities</li>\n<li>Choose what pages your Live Chat displays on</li>\n</ul>\n<p><strong><em>The Live Chat features are just the start of what BirdSeed offers.</em></strong> <strong>BirdSeed has 12 tools, all rich with features and built to increase your conversions!</strong></p>\n<p><strong>Get BirdSeed and start growing your revenue today. Click ‘Download’ on the upper right of the page to get started!</strong></p>\n<h3>Easy Customization &amp; Endless Possibilities</h3>\n<p>We’ve made <strong>BirdSeed fully customizable</strong> because <em>you</em> have the most knowledge of your customers and their needs. You’ll have the opportunity to use your BirdSeed as a suite of tools that appears on every page (think Live Chat) or to target individual pages of your website with videos, FAQs, email capture, and more to help your visitors convert.</p>\n<p><strong>Managing your BirdSeed is as simple</strong> for you as using the tools is <strong>intuitive for your customers</strong>. In addition, BirdSeed can be integrated with Zapier or connection to over 5,000 other applications.</p>\n<p><strong>Track &amp; analyze</strong> all your visitor interactions with BirdSeed so you can continuously optimize what is working to turn visitors into customers.</p>\n<p><strong>Treat visitors like people</strong>, not numbers: offer live chat and other opportunities for them to get to know you, your team, products, and services. Personal connection with visitors, whether it happens through pre-recorded video messages, live chat, or phone calls is a powerful incentive for visitors to become loyal, satisfied customers.</p>\n<h3>Effortless Live Chat Is Just The Beginning</h3>\n<p>Our Live Chat feature is so excellent that many of our users are satisfied when they’ve implemented the Live Chat alone. BirdSeed has a whole suite of features that complement and enhance our Live Chat tool to increase visitor engagement, conversions, and customer connection to name a few.</p>\n<p>Proactive messaging is a groundbreaking feature that can make all the difference in engaging and connecting with your customers.</p>\n<h3>What’s Proactive Messaging?</h3>\n<p>BirdSeed’s Proactive Messaging gets your message noticed without getting in the way. Think of it as a greeter welcoming people as they enter a store. This could include a video introduction of your team, products, detailing your services, telling your customers how happy they chose your website and how eager you are to help them, or any of the other infinite possibilities.</p>\n<h3>Unlimited Options with Proactive Messaging</h3>\n<p>Anything you can put in text or video, you can put into your proactive message. Website owners often go to great lengths to set a specific tone for their website, obsessing over colors, fonts, and designs. With BirdSeed, you can quickly and directly set the tone you want for your website with a video and embed it in your BirdSeed within minutes. It really is that simple!</p>\n<p>You can have BirdSeed as a small, unobtrusive icon on each page of your website, or you can proactively greet every visitor with customized messages optimized to enhance the user experience on one specific page or across your whole website!</p>\n<h3>Help Customers Through the Checkout Process</h3>\n<p>If you’ve noticed that many people add items to their cart but fail to convert, you can set a video explaining the checkout and shipping options out of the way but immediately visible for confused or hesitant customers.</p>\n<h3>Connect and Convert</h3>\n<p>You can create short videos explaining your business and vision, which puts a human face on your business and connects with your waffling potential customer without forcing them to go to your “About Us” page in order to learn about you.</p>\n<p>Creating that personal connection increases trust, customer retention, and how much that connected customer is willing to spend.</p>\n<h3>Proactive Messaging Is Complementary to Live Chat</h3>\n<p>Who’s more likely to use a Live Chat feature?<br />\n&#8211; The customer that already saw a friendly face in your brief video?<br />\n&#8211; Or a customer who has to hunt for a small icon in the corner when they’re already confused?</p>\n<p>Proactive messages help you stay ahead of customers’ engagement and informational needs by connecting with them <strong><em>before</em></strong> they become frustrated or confused.</p>\n<p>BirdSeed’s natural and appealing live chat is our most popular tool, but the real advantage of BirdSeed lies in the synergy of all the tools, customized and tailored to your website and demographics:</p>\n<h3>Informational Tools</h3>\n<blockquote>\n<h3>Knowledge Base</h3>\n<p>Our knowledge base (AKA knowledge library) tool is easy to set up &amp; even easier for visitors to use.</p>\n</blockquote>\n<p>No need to learn how to code in order to quickly create functional knowledge bases. BirdSeed provides the user interface and experience you and your customers need. Knowledge bases <em>have</em> to be intuitive to use because they are designed for visitors to use even if they are unfamiliar with your website.</p>\n<p>BirdSeed shows your tools to the visitor, striking a balance between obvious and annoying. It’s always key to satisfy confused users quickly before they leave your website in frustration. Our knowledge base tool provides the answers your visitors need faster than any other possible method.</p>\n<p>Knowledge bases can also be targeted and customized to specific pages: for example ‘When will my order be shipped?’ on your product or checkout pages. Or you could show off an infographic detailing how an order moves from payment to shipping.</p>\n<p>You know the questions your customers want to have answered. Our tool can provide those answers to them before they ask!</p>\n<h4>Saving you &amp; your customers time</h4>\n<p>Having an effective knowledge base saves time for both you and your visitors. And saving your visitors time means they can move from landing page to checkout that much faster, increasing your conversions.</p>\n<p>Reducing customer confusion and frustration with a knowledge base directly increases customer satisfaction. That can go a long way to converting visitors who are on the fence about completing a transaction.</p>\n<h4>Using knowledge bases with live chat</h4>\n<p>Knowledge bases can’t beat live chat when it comes to providing customers with a personal connection and personalized information. But every customer who has their questions answered through your knowledge base is one you don’t have to spend time engaging through live chat.</p>\n<p>In addition, knowledge bases can save time on the customer side. It may take several minutes (or hours, if your business is closed) for your customer service representative to begin chatting with the user. Even a few minutes can be too much for some impatient visitors who will leave and never come back.</p>\n<p>But if their question is available and accessible in your knowledge base, that helps keep your visitor engaged and on your site without requiring them to wait for an answer.</p>\n<blockquote>\n<h3>Video Showcase</h3>\n<p>Get face-to-face with clients the first time they visit your site</p>\n</blockquote>\n<p>BirdSeed’s Video Showcase tool displays the videos you want your customers to see. These can be given custom names different than their Youtube or Vimeo titles and organized into custom sections.</p>\n<p>Videos can be directly embedded from Youtube or Vimeo, recorded and uploaded on the spot, or show off an image or GIF to introduce your website’s video showcase.</p>\n<p>Users have become increasingly likely to interact with videos compared to other forms of media. Providing videos that explain, introduce, or entertain gives customers the connection and engagement they expect from a top-of-the-line website.</p>\n<p>You could show off videos of client testimonials, put a face to your organization with a video introduction, give them a quick virtual tour of your website, or do all three!</p>\n<p>A great user experience isn’t likely to occur just through reading text. The standards of interactivity have been raised much higher than that. Take the next step in engagement with BirdSeed and use your videos to create a personal connection and increase your conversions.</p>\n<blockquote>\n<h3>Link Launcher</h3>\n<p>Direct users to your most important links with ease &amp; visual appeal</p>\n</blockquote>\n<p>With BirdSeed’s Link Launcher tool, it’s easy to direct users to the important, conversion-generating pages of your website that make you money. These can be customized to every page individually.</p>\n<p>For example, if a kitchen remodeling company has a blog post about “Best Kitchen Counters for Your Home” then they can use BirdSeed to link directly to their kitchen remodeling materials and services. Links are how your visitors navigate through your website.</p>\n<p>Make it easy for users to find your most important pages to keep them engaged and encourage conversion.</p>\n<h3>Authority Building Tools</h3>\n<blockquote>\n<h3>Event Announcement</h3>\n<p>Make sure the right people see your upcoming events</p>\n</blockquote>\n<p>The Event Announcement tool will show the user a quick snapshot of your upcoming events. This isn’t just to inform and engage the visitor, but also can be used to collect user emails.</p>\n<p>That will help you to follow up with those interested users later and even allow you to email them with a recording of the event afterward. You can also collect upvotes or gather feedback on coming events.</p>\n<p>Inside the event announcement tool you can attach embedded videos, GIFs, or custom embeds to each event individually. This could be a quick video explanation of the upcoming event, a teaser for the event, or a simple GIF form of the announcement to help catch the user’s attention and encourage email signup.</p>\n<blockquote>\n<h3>User Feedback</h3>\n<p>Gain valuable data about users by asking them quick questions</p>\n</blockquote>\n<p>On the spot user feedback can be a critical part of pleasing your customers, optimizing your website or service, or keeping them engaged and interested in your website.</p>\n<p>BirdSeed’s User Feedback tool allows you to customize both the questions and the possible answers your customers can provide. You can easily float new ideas in your website survey to determine beforehand if your target audience has any interest. For example, you could ask if your visitors would sign up for a newsletter, if you started one.</p>\n<p>But the possibilities go far beyond that. You can ask any question you want, and make the answer multiple choice, a free form text response, or emotional reactions you can customize.</p>\n<p>Again, no coding or complicated settings need to be changed to customize your user feedback survey. The setup on the back end is completely natural and easy to use.</p>\n<blockquote>\n<h3>Client Testimonials</h3>\n<p>Proudly display what your satisfied customers have to say</p>\n</blockquote>\n<p>The importance of customer testimonials has increased over the years. Now customers may expect you to have testimonials on your website regardless of your industry. Visitors may even fail to convert without compelling testimonials.</p>\n<p>If you have a great product or service, chances are you have some very happy customers. Don’t let that go to waste! Show your visitors that they can trust you by displaying your customer testimonials prominently.</p>\n<p>Displaying testimonials helps build on your previous work and success. Building a relationship with your customers is extremely important. This is especially true when you provide a recurring service or a  consumable product people will want again and again.</p>\n<p>Showing your customer testimonials helps new customers take the first step in trusting you and your business.</p>\n<blockquote>\n<h3>Live Chat</h3>\n<p>Humanize your website &amp; instantly connect with users in real-time</p>\n</blockquote>\n<p>Offering Live Chat gives your visitors a convenient and no-pressure way to engage with you about anything that’s on their minds.</p>\n<p>Answer questions about products, services, shipping times, and so on. Chatbots are often proposed as a viable alternative to live chat, but chatbots often frustrate customers. Keep Live Chat and complement it with a knowledge base of Frequently Asked Questions to answer FAQs that you know a lot of visitors ask before converting. Both of these tools can be paired up side by side in your BirdSeed.</p>\n<p>No one is frustrated by a well-designed knowledge base, but having a chatbot simulate an interaction is at best a disguised knowledge base and link launcher tool put together; at worst, they can be extremely frustrating.</p>\n<p>It’s easy to get started with BirdSeed in just a few minutes and give your customers a pleasant live chat experience that’s fully customizable to your website and visitors.</p>\n<blockquote>\n<h3>Phone Contact &amp; Call Request</h3>\n<p>Generate leads &amp; direct outreach from customers with call requests</p>\n</blockquote>\n<p>Getting started with our Call Request tool is extremely easy. Simply take your phone number and put it into your BirdSeed! People can begin to call or request a call back right away.</p>\n<p>In some industries, especially ones that offer highly customized services and products, it’s necessary to have a client call in order to generate a conversion. But even when you don’t need visitors to call in order to convert, they’ll call for plenty of other reasons. They might be confused, need personal help, or simply want to connect with you in a more personalized way. As far as generating a personal connection goes, phone calls are second only to face-to-face conversations.</p>\n<p>Calls have a more natural, conversational feel than other forms of communication such as email. In some ways, phone calls even beat out their main competitor, live chat. Live chat is highly versatile from both a customer and business standpoint, but phone calls are one of the best ways to engage with and sell to a customer.</p>\n<p>Phone contact isn’t just for phone calls. It’s also to ensure the customer has easy access any other contact information you want to provide: your physical address, email address, and so on.</p>\n<p>As with the knowledge base tool, it’s always best to answer customer questions before they ask them. Don’t make them ask for your phone number or address. Make sure your customers can always find your address or call you in a flash.</p>\n<h3>Direct Conversion Tools</h3>\n<blockquote>\n<h3>Schedule Meeting</h3>\n<p>Start booking appointments efficiently with our scheduling tool</p>\n</blockquote>\n<p>Service industries often need to schedule meetings in order to serve their clientele. Booking appointments is necessary for businesses from hair salons to medical providers. But handling all those booking requests manually is unnecessary and wastes time that should really be spent on other aspects of your business.</p>\n<p>The less time you spend scheduling appointments, the more time you actually have to serve your customers. In addition, not all customers are willing to call you over the phone in order to book their appointment. Providing a quick and convenient way to schedule their appointment can bring more visitors through your door with less work.</p>\n<p>There are plenty of other stand-alone appointment booking plugins out there, but for us, this is just one tool in BirdSeed’s entire suite. You can use the booking tool in parallel with other tools like live chat to encourage and guide visitors through the booking process if necessary. Or you could provide a video showcasing your facility and giving a quick guide to what they will experience when they actually come to the appointment.</p>\n<p>Regardless of your industry, if you need your customers to be able to book appointments quickly and easily from any page of your website, BirdSeed is the tool for you. The Schedule Meeting tool can be added to any page of your website in minutes, even if you are totally new to BirdSeed.</p>\n<p>Once your customer books an appointment, the meeting will display in your Schedule Dashboard. You can view all your future appointments or simply the ones booked for today, this week, or this month. It’s simple to keep all your meetings visible so you never miss an appointment.</p>\n<blockquote>\n<h3>Email Capture</h3>\n<p>Capture user information exactly when they&#8217;re ready to provide it</p>\n</blockquote>\n<p>Email lists are one of the most effective and powerful ways to engage your future customers and bring them back to your website. Offering value through a coupon, newsletter, blog, etc gives your visitors a reason to subscribe to your email list.</p>\n<p>BirdSeed can keep your email signup form obvious and accessible on every page of your website. It pairs well with a standard popup email capture form. If you don’t capture the user’s email at first, BirdSeed will remind and allow them to subscribe immediately from any page of your website. You can also target individual pages differently, either removing the email capture form or making it more prominent.</p>\n<p>Unlike other tools which lack customization options, BirdSeed enables you to completely change the email capture form to gather any customer information you need. You could capture their phone number, email address, name, birthday, or anything else. The possibilities are endless, and no programming is required to quickly and easily customize your form.</p>\n<blockquote>\n<h3>Contact Form</h3>\n<p>Collect responses from your users &amp; organize the info for later use.</p>\n</blockquote>\n<p>With our customizable contact form, you can immediately get started helping customers or following up on leads. These contact forms can be tailored to any industries needs, but as an example: You can assist customers who are experiencing an issue with your product or service, have them describe the problem, and their availability to receive a callback.</p>\n<p>Having a contact form guides the visitor through the path that you need them to take in order to help them. They could email you, but might not provide any details that would allow you to take the next step. This lengthens the process and delays the resolution.</p>\n<p>Asking them for the necessary information through your BirdSeed contact form helps the customer feel heard and understood before you even talk to them. That helps set the tone for future interactions as friendly and helpful, even if the customer is complaining or frustrated.</p>\n<p>Your contact form can also appear after business hours when your live chat is not available. Staffing live chat services 24/7 is not cost-effective for most small businesses. Substituting chat with contact forms when your business is closed helps ensure that those customers also are helped as soon as possible once you open the next day.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/birdseed.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/birdseed/assets/screenshot-1.png?rev=1963788",
            "caption": ""
        }
    ],
    "tags": {
        "birdseed": "birdseed",
        "live-chat": "live chat",
        "website-engagement": "website engagement"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/birdseed.1.0.0.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://birdseed.io",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/birdseed/assets/icon-128x128.png?rev=1963788",
        "2x": "https://ps.w.org/birdseed/assets/icon-256x256.png?rev=1963788"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 68,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}