{
    "name": "BlueSnap Payment Gateway for WooCommerce",
    "slug": "bluesnap-payment-gateway-for-woocommerce",
    "version": "3.1.0",
    "author": "<a href=\"https://saucal.com\">SAU/CAL</a>",
    "author_profile": "https://profiles.wordpress.org/bluesnap/",
    "contributors": {
        "bluesnap": {
            "profile": "https://profiles.wordpress.org/bluesnap/",
            "avatar": "https://secure.gravatar.com/avatar/41f950fb4521ec36e1654bfe0b1143f3?s=96&d=monsterid&r=g",
            "display_name": "Scott Ring"
        },
        "harmz": {
            "profile": "https://profiles.wordpress.org/harmz/",
            "avatar": "https://secure.gravatar.com/avatar/fb96a8eb8cb6868801d9c6dcee050682?s=96&d=monsterid&r=g",
            "display_name": "SAU/CAL"
        }
    },
    "requires": "5.2.4",
    "tested": "6.4.5",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 46,
    "ratings": {
        "5": 1,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 3,
    "support_url": "https://wordpress.org/support/plugin/bluesnap-payment-gateway-for-woocommerce/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 200,
    "downloaded": 7567,
    "last_updated": "2024-03-20 11:38am GMT",
    "added": "2019-09-19",
    "homepage": "https://bluesnap.com/",
    "sections": {
        "description": "<p>Why use the BlueSnap Payment Gateway for WooCommerce</p>\n<ul>\n<li>Accept all major debit and credit cards as well as Apple Pay, Google Pay and ACH</li>\n<li>Simplify your PCI compliance using our built-in Hosted Payment Fields. Your shoppers never leave your site while you maintain easy PCI compliance.</li>\n<li>Supports Strong Customer Authentication (SCA) with 3D Secure</li>\n<li>Identify and prevent fraud with built-in fraud protection from Kount</li>\n<li>Sell in 100 currencies </li>\n<li>Support for WooCommerce pre-orders</li>\n<li>Support recurring payments via WooCommerce Subscriptions</li>\n</ul>\n<p>A secure and frictionless checkout flow</p>\n<p>The BlueSnap Payment Gateway for WooCommerce uses our Hosted Payment Fields to provide you with a seamless, PCI-compliant checkout experience that works within any browser or device.  Our Hosted Payment Fields silently collect your shopper’s sensitive payment data on BlueSnap servers without interrupting the checkout flow.</p>\n<p>Sell and settle in multiple currencies</p>\n<p>A simple way to help your shoppers complete their purchase is to offer your products in the currency of your shoppers. The BlueSnap Payment Gateway allows your shoppers to checkout in 100 different currencies and, as an added benefit, using the BlueSnap Payment Gateway gets you access to our connections to 30 global banks. When your shopper completes their purchase, BlueSnap paves the most efficient path to payment success by routing the transaction to the most appropriate local bank for your shopper, minimizing decline rates and maximizing revenue gains.</p>\n<p>Once the sale is complete and you need to get paid, BlueSnap works with you by offering the option to get money into your account in one of our 17 like-for-like payout currencies.</p>\n<p>Fraud Protection and 3D Secure</p>\n<p>The BlueSnap Payment Gateway offers Kount Fraud protection right from the plugin to best optimize the checkout flow. We also provide the option to select advanced fraud options if you want to customize your level of fraud screening.<br />\nIn addition, as you sell to shoppers around the world, you will likely run into a location where you are required to support a 3D Secure checkout experience.  The BlueSnap Payment Gateway has built-in support for 3DS so you aren&#8217;t out of compliance in the regions where this is mandatory.</p>\n<p>Full support for Subscriptions and Pre-Orders</p>\n<p>The BlueSnap Payment Gateway provides support for <strong>WooCommerce Subscriptions</strong>, offering support for all of subscription features, including payment date changes, subscription date changes, and more. The gateway also fully supports <strong>WooCommerce Pre-Orders</strong>, so you can take customer’s payment information upfront and then automatically charge their payment method once the pre-order is released.</p>\n<h3>Recommended Versions</h3>\n<p>We recommend that you use the following versions when using the BlueSnap plugin for WooCommerce. The plugin may work when using older versions of PHP and MySQL as well; however, the following versions have been tested to ensure compatibility.<br />\n* PHP: 7.4 or later<br />\n* MySQL: 5.6 or later<br />\n* WordPress: 5.2.4 or later<br />\n* WooCommerce: 3.7 or later<br />\n* WooCommerce Pre-Orders: 1.5.16 or later<br />\n* WooCommerce Subscriptions: 3.0 or later</p>\n<h3>Software</h3>\n<p>This guide assumes that you have:<br />\n* A working WordPress platform<br />\nWooCommerce is a WordPress plugin that is installed on top of the WordPress platform. If you do not yet have a working WordPress installation, you may want to contact your website hosting provider, as many of them supply a quick-install process for WordPress.</p>\n<ul>\n<li>\n<p>WooCommerce software installed and uploaded to your server.<br />\nIf you need the plugin, go to: https://wordpress.org/plugins/woocommerce/ or to http://www.woothemes.com/woocommerce/ to download the WooCommerce plugin.</p>\n</li>\n<li>\n<p>If you want to use the Pre-Orders or Subscription functionalities, make sure that the respective plugins are also installed in your WordPress website:</p>\n<ul>\n<li>Pre-Orders:  http://www.woothemes.com/products/woocommerce-pre-orders/ </li>\n<li>Subscriptions:  http://www.woothemes.com/products/woocommerce-subscriptions/</li>\n</ul>\n</li>\n</ul>\n<h3>PCI compliance</h3>\n<p>A PCI compliance of SAQ-A is required.</p>\n<p>Setup Steps</p>\n<h3>Step 1: Configure your BlueSnap account settings</h3>\n<p>Before you install the BlueSnap extension, complete these steps in your BlueSnap account:<br />\n1. Set up your BlueSnap API Credentials(https://developers.bluesnap.com/v8976-Basics/docs/api-credentials). Make note of your API username and password; you need them in later steps.</p>\n<ol>\n<li>\n<p>Define the authorized IP address for your server.</p>\n</li>\n<li>\n<p>Configure your payout settings (https://support.bluesnap.com/docs/payout-method).</p>\n</li>\n</ol>\n<h3>Step 2: Install the plugin</h3>\n<p>Install the BlueSnap Payment Gateway plugin, as follows:<br />\n1. In WordPress, click <strong>Plugins &gt; Add New</strong> in the left menu.</p>\n<ol>\n<li>\n<p>Search for <code>BlueSnap</code> in the search box in the top-right side.</p>\n</li>\n<li>\n<p>Click the <strong>BlueSnap Payment Gateway for WooCommerce</strong> plugin and install it.</p>\n</li>\n<li>\n<p>Click <strong>Plugins &gt; Installed Plugins</strong> in the left menu.</p>\n</li>\n<li>\n<p>In the installed plugin screen, <strong>activate</strong> the following plugins, in this order:</p>\n<ul>\n<li>WooCommerce </li>\n<li>WooCommerce Subscriptions (optional) </li>\n<li>WooCommerce Pre-Orders (optional) </li>\n<li>BlueSnap Payment Gateway for WooCommerce </li>\n</ul>\n</li>\n</ol>\n<p><strong>Important</strong><br />\nIf these are not activated in the specified order, the installation will not complete properly.</p>\n<h3>Step 3: Set the Default Currency</h3>\n<p>Configure the default currency settings for WooCommerce by completing the following steps:<br />\n1. Go to <strong>WooCommerce &gt; Settings &gt; General</strong>.</p>\n<ol>\n<li>\n<p>Scroll down to <strong>Currency Options</strong> and set the values as necessary.</p>\n</li>\n<li>\n<p>Click Save Changes.</p>\n</li>\n</ol>\n<h3>Step 4: Configure the plugin</h3>\n<p>Configure the BlueSnap plugin using the following steps:<br />\n1. Click the <strong>Settings</strong> link below the BlueSnap plugin. The BlueSnap page opens.</p>\n<ol>\n<li>Configure the following settings. </li>\n</ol>\n<blockquote>\n<p><strong>Note</strong>: You can find your BlueSnap information (API credentials, Merchant ID, and more) for the following settings in your BlueSnap Merchant Console in <strong>Settings &gt; API Settings</strong>.</p>\n</blockquote>\n<ul>\n<li><strong>Enable/Disable</strong> &mdash; Select Enable BlueSnap. This means that BlueSnap appears as a payment option during checkout. </li>\n<li><strong>Test mode</strong> &mdash; Select Enable Test Mode to use your BlueSnap Sandbox account, select the Enable Test Mode option. Leave the option cleared to use your BlueSnap Production account. </li>\n<li><strong>IPN configuration</strong> &mdash; Copy the URL from this section and use it for the IPN Setup section below. </li>\n<li><strong>Title</strong> &mdash; By default, this is Credit/Debit Cards. This label is presented to the shopper when they choose a payment option during checkout. </li>\n<li><strong>Description</strong> &mdash; By default, this is Pay using your Credit/Debit Card. This describes the payment method during checkout. </li>\n<li><strong>API Username and API Password</strong> &mdash; Enter your API Username and Password for your BlueSnap account. Use your sandbox credentials if you chose Enable Test Mode above. Use your production credentials if you did not chose Enable Test Mode above. </li>\n<li><strong>Merchant ID</strong> &mdash; Enter your Merchant ID number from your BlueSnap merchant account. <br /> <strong>Note</strong>: Use the Merchant ID from you sandbox or production environment, as applicable. They are different. </li>\n<li><strong>Soft Descriptor</strong> &mdash; Enter a string, no more than 20 characters in length. This descriptor appears on the shopper&#8217;s billing statement to help them identify the purchase. You should use the same soft descriptor set in your BlueSnap Console. </li>\n<li><strong>Capture</strong> &mdash; Whether or not to immediately capture the charge. When unchecked, the charge issues an authorization and will need to be captured later. This setting has no effect on subscriptions. Charges on orders related to subscriptions are always captured. </li>\n<li><strong>3D Secure</strong> &mdash; If you want to offer 3-D Secure, contact BlueSnap Merchant Support and ask for 3-D Secure to be enabled for your account. After that is done, you can select this option to activate 3-D Secure. For more information on 3-D Secure, refer to our 3-D Secure Guide (https://support.bluesnap.com/docs/3d-secure).  </li>\n<li><strong>Saved Cards</strong> &mdash; Select this if you want to give logged-in shoppers the option to store their credit card details for future purchases. They can manage their information from their My Account area. </li>\n<li><strong>BlueSnap currency converter</strong> &mdash; BlueSnap works with many currencies (see a complete list at https://support.bluesnap.com/docs/currencies). The BlueSnap plugin for WooCommerce includes a built-in currency converter that you must configure in order to enable successful purchasing via BlueSnap. <br />Select this option to use the converter. </li>\n<li><strong>Select the currencies to display in your shop</strong> &mdash; Select all the currencies your WooCommerce store supports. </li>\n<li><strong>Google Pay Wallet</strong> &mdash; If you want to offer Google Pay as a payment method for your shoppers, contact BlueSnap <a href=\"https://bluesnap.zendesk.com/hc/en-us/requests/new?ticket_form_id=360000127087\" rel=\"nofollow ugc\">Merchant Support</a> and ask for Google Pay to be enabled for your account. After that is done, you can select this option to allow shoppers to pay with Google Pay. </li>\n<li><strong>Google Merchant ID</strong> &mdash; Enter your Google Business Merchant ID. Request for Google Pay production access [here]. Google Pay won&#8217;t be available in production mode until you enter the merchant ID. </li>\n<li><strong>Apple Pay Wallet</strong> &mdash; If you want to offer Apple Pay as a payment method for your shoppers, contact BlueSnap <a href=\"https://bluesnap.zendesk.com/hc/en-us/requests/new?ticket_form_id=360000127087\" rel=\"nofollow ugc\">Merchant Support</a> and ask for Apple Pay to be enabled for your account. After that is done, you can select this option to allow shoppers to pay with Apple Pay. </li>\n<li><strong>Logging</strong> &mdash; Select the Log debug messages option to have communications between WooCommerce and BlueSnap recorded in the process log files. We recommend using this option during the development of your site or if you are experiencing any problems. <br />To access process logs for the BlueSnap plugin, go to <strong>WooCommerce &gt; Status</strong> and click the <strong>Logs</strong> tab. </li>\n</ul>\n<ol>\n<li>Click Save Changes. </li>\n<li>If you would like to accept ACH payments, enable this feature by going to <strong>WooCommerce &gt; Settings &gt; Payments</strong> and setting the <strong>BlueSnap ACH</strong> toggle to <strong>enable.</strong></li>\n<li>Click Save Changes.<br />\n<strong>Important</strong><br />\nIf you plan to offer ACH as a payment method for subscriptions, please note:<br />\nYou will need to contact Merchant Support to have this feature enabled.<br />\nACH is not supported for subscriptions with daily billing, as banks take several days to authorize these charges.</li>\n</ol>\n<h3>Step 5: Secure checkout</h3>\n<p>Ensure that you are using secure checkout by completing the following steps.<br />\n1. Go to <strong>WordPress &gt; Settings &gt; General</strong>.</p>\n<ol>\n<li>In the following URL fields, make sure that the URL begins with <code>https://</code>:\n<ul>\n<li><strong>WordPress Address (URL)</strong></li>\n<li><strong>Site Address (URL)</strong></li>\n</ul>\n</li>\n</ol>\n<h3>Step 6. IPN Setup</h3>\n<p>Instant Payment Notifications (IPNs) are webhooks that trigger an HTTP POST message to your WooCommerce account when an important event occurs. Follow the steps below to set up IPNs.</p>\n<ol>\n<li>\n<p>Log in to your BlueSnap account and go to <strong>Settings &gt; IPN Settings</strong>.</p>\n</li>\n<li>\n<p>Select the <strong>Receive Instant Payment Notifications</strong> check box.</p>\n</li>\n<li>\n<p>Update the <strong>IPN URL(s)</strong> field. The format of the URL should follow this pattern:<br />\n  https://www.yourdomain.com/?wc-api=bluesnap</p>\n</li>\n<li>\n<p>To enable specific IPNs, click <strong>Select IPNs</strong>. In the section that opens, toggle the button next to the IPN to select it. We recommend enabling the following IPN types:</p>\n<ul>\n<li>AUTH_ONLY</li>\n<li>CANCEL_ON_RENEWAL</li>\n<li>CANCELLATION</li>\n<li>CANCELLATION_REFUND</li>\n<li>CHARGE</li>\n<li>CHARGEBACK</li>\n<li>CHARGEBACK_STATUS_CHANGED</li>\n<li>CONTRACT_CHANGE</li>\n<li>DECLINE</li>\n<li>FAILED_PAYOUT_TRANSFER</li>\n<li>RECURRING</li>\n<li>REFUND</li>\n<li>SUBSCRIPTION_REMINDER</li>\n</ul>\n</li>\n<li>\n<p>If you plan to offer ACH as a payment method for subscriptions, make sure to select the <strong>Send Subscription Charge Failure IPN</strong>.</p>\n</li>\n<li>\n<p>Click <strong>Submit</strong>.</p>\n</li>\n</ol>\n<p>For more information on IPNs, refer to our <a href=\"https://support.bluesnap.com/docs/about-ipns\" rel=\"nofollow ugc\">IPN documentation</a>.</p>\n<h3>Step 7: Crontab Setup</h3>\n<p>We recommend that you add a line to your crontab. The crontab is an application that runs in the server operating the WordPress application, and is in charge of periodic actions. It ensures that subscriptions continue to charge on time even if your WooCommerce store has no traffic, stores automatic renewals, and handles pre-orders.<br />\nThe crontab file is available to you in most UNIX/Linux based machines, and often can be found in <code>/var/spool/cron</code>. If you are not sure where your crontab file is, reach out to your IT team or hosting provider for more details.<br />\nYou should add the following line to your crontab file:<br />\n    */15 * * * * {wget path} -q -O – {Web domain of your WooCommerce Store}/ wp-cron.php?doing_wp_cron<br />\nFor example: <code>*/15 * * * * /usr/bin/wget -q -O - http://shoppingcarts.bluesnap.com/wordpress/wp-cron.php?doing_wp_cron</code><br />\nIf you have multiple WooCommerce Stores running on the same server, you should add this line for each one of them.<br />\n<strong>Note</strong>:  <code>*/15</code> makes the crontab run every 15 minutes. You can use this to change the cron frequency.<br />\nFor additional help, contact BlueSnap Merchant Support (https://bluesnap.zendesk.com/hc/en-us/requests/new?ticket_form_id=360000127087).<br />\n<strong>Styling your payment form</strong><br />\nBlueSnap supports the ability to customize the card elements (such as text color or font size) of the payment form. To do this, edit the BlueSnap plugin&#8217;s JavaScript by creating a bluesnapStyleOverrides object that contains your styling. See Supported selectors and Supported CSS properties for details https://developers.bluesnap.com/v8976-Tools/docs/hosted-payment-fields#section-supported-css-properties. Use the code below as a starting point.</p>\n<pre><code>const bluesnapStyleOverrides = {\n  '.invalid': {\n    //style all invalid elements\n    color: 'red'\n  },\n  '.valid': {\n    //style all valid elements\n    color: 'green'\n  },\n  ':focus': {\n    //style all elements on the focus event\n    color: 'orange'\n  },\n  '#ccn': {\n    //style only the card number element\n    color: 'blue'\n  },\n  '#cvv': {\n    //style only the CVV element\n    'font-size': '30px'\n  }\n};\n</code></pre>\n<p><strong>Customizing error messages</strong><br />\nBlueSnap allows you to customize the messages of any errors that occur, giving you full control over the error descriptions that display in the UI or in error logs. To use this feature, you will need to add custom code to your WooCommerce account. We recommend using a plugin such as Code Snippets to accomplish this.<br />\nUse the code sample below as a starting point. You can change error descriptions and add/remove errors from the code below.</p>\n<pre><code>add_filter(\n  'wc_gateway_bluesnap_api_errors',\n  function ( $errors ) {\n      $errors = array(\n          '10000|INVALID_API_VERSION'        =&gt; __( 'API version is not correct...', 'woocommerce-bluesnap-gateway' ),\n          '10001|VALIDATION_GENERAL_FAILURE' =&gt; __( 'This is a val.gen. failure error.', 'woocommerce-bluesnap-gateway' ),\n          '14002'                            =&gt; __( 'This is the new error message for 14002', 'woocommerce-bluesnap-gateway' ),\n          '14002|SYSTEM_TECHNICAL_ERROR'     =&gt; __( 'This is the new error message for 14002|SYSTEM_TECHNICAL_ERROR', 'woocommerce-bluesnap-gateway' ),\n          '14016'                            =&gt; __( 'This is the new error message for 14016', 'woocommerce-bluesnap-gateway' ),\n      );\n      return $errors;\n  }\n);\n</code></pre>\n<p><strong>Managing orders</strong><br />\nIf card charges are not automatically captured, they will result in authorizations that need to be captured later. For example, if you sell physical goods, you will need to capture the authorization when the items are ready to be shipped out. Orders can be conveniently managed from your WooCommerce account by following these steps:<br />\n1. Go to <strong>WooCommerce &gt; Orders</strong> and click the order that you want to manage. The order&#8217;s status will be <strong>On hold.</strong></p>\n<p><strong>Note:</strong> ACH charges will also have a status of <strong>On hold.</strong> You don&#8217;t need to capture these charges.<br />\n2. In the <strong>Status</strong> dropdown, select one of the following:<br />\nIf you want to capture the authorization, select <strong>Processing</strong> or <strong>Completed.</strong><br />\nIf you want to cancel the authorization, select <strong>Cancelled.</strong></p>\n",
        "installation": "<p>For the most recent version of these instructions, refer to https://support.bluesnap.com/docs/woocommerce</p>\n<p>Requirements</p>\n",
        "changelog": "<h4>3.1.0</h4>\n<ul>\n<li>Added HPOS compatibility.</li>\n<li>Added plugin&#8217;s review prompt.</li>\n<li>Updated tested up to WordPress v6.4 and WooCommerce 8.5.2.</li>\n</ul>\n<h4>3.0.1</h4>\n<ul>\n<li>Updated tested up to WordPress v6.3 and WooCommerce 8.0.1.</li>\n</ul>\n<h4>3.0.0</h4>\n<ul>\n<li>Added support for Google Pay</li>\n<li>Fix consistency with the submit button&#8217;s attribute &#8220;data-bluesnap&#8221;</li>\n<li>Improve the support for Apple Pay</li>\n<li>General improvements and bug fixes</li>\n</ul>\n<h4>2.6.3</h4>\n<ul>\n<li>Updated tested up to WordPress v6.2 and WooCommerce 7.5.</li>\n</ul>\n<h4>2.6.2</h4>\n<ul>\n<li>Updated required WordPress to v5.2.4 and tested up to WordPress v6.1 and WooCommerce 7.1.</li>\n</ul>\n<h4>2.6.1</h4>\n<ul>\n<li>Updated tested up to WordPress v6.0 and WooCommerce 6.6.</li>\n</ul>\n<h4>2.6.0</h4>\n<ul>\n<li>Updated Hosted Payment Fields from v3 to v4.</li>\n<li>Added support for 3DS and returning shopper.</li>\n<li>Fix error with jQuery deprecated function.</li>\n<li>Fix Issue with Tax calculation on a currency different than the default one.</li>\n<li>Fix handling of cases where the HPF token is expired.</li>\n<li>Fix compatibility with WooCommerce Price Based on Country plugin.</li>\n<li>Fix Payment process, sometimes gets stuck after pressing ApplePay button.</li>\n<li>Fix CC logos appear blurry on payment form.</li>\n</ul>\n<h4>2.5.3</h4>\n<ul>\n<li>Fix &#8211; Issue related with expiring BlueSnap HPF tokens</li>\n<li>Fix &#8211; Issue related with not showing a notification that the token had expired.</li>\n<li>Fix &#8211; Issue related to Pay for Order flow for registered users.</li>\n<li>Updated &#8211; IPN section of the Readme file.</li>\n</ul>\n<h4>2.5.2</h4>\n<ul>\n<li>Fix &#8211; Issue related to Pay for Order flow for registered users.</li>\n<li>Fix &#8211; JavaScript error causing 3rd party code to not work in cart.</li>\n<li>Fix &#8211; Wrong notification when cancelling a PayPal subscription.</li>\n<li>Fix &#8211; Adjust order status when a split Auth/Capture order is not captured.</li>\n<li>Updated &#8211; Visa logo updated to new version.</li>\n</ul>\n<h4>2.5.1</h4>\n<ul>\n<li>Fix &#8211; Issue reported by merchants using non-default decimal separators.</li>\n<li>Fix &#8211; Issues related to labeling of Apple Pay paid orders.</li>\n<li>Fix &#8211; Updated deprecated WooCommerce Subscription functions</li>\n<li>Fix – Improvements to avoid specific PHP notices</li>\n</ul>\n<h4>2.5.0</h4>\n<ul>\n<li>Updated to add ACH, split auth and capture, hosted payment field styling, custom error messages.</li>\n</ul>\n"
    },
    "short_description": "Accept cards, ACH, Apple Pay and Google Pay, along with support for WooCommerce Subscriptions and Pre-orders on a global payments gateway.",
    "description": "<p>Why use the BlueSnap Payment Gateway for WooCommerce</p>\n<ul>\n<li>Accept all major debit and credit cards as well as Apple Pay, Google Pay and ACH</li>\n<li>Simplify your PCI compliance using our built-in Hosted Payment Fields. Your shoppers never leave your site while you maintain easy PCI compliance.</li>\n<li>Supports Strong Customer Authentication (SCA) with 3D Secure</li>\n<li>Identify and prevent fraud with built-in fraud protection from Kount</li>\n<li>Sell in 100 currencies </li>\n<li>Support for WooCommerce pre-orders</li>\n<li>Support recurring payments via WooCommerce Subscriptions</li>\n</ul>\n<p>A secure and frictionless checkout flow</p>\n<p>The BlueSnap Payment Gateway for WooCommerce uses our Hosted Payment Fields to provide you with a seamless, PCI-compliant checkout experience that works within any browser or device.  Our Hosted Payment Fields silently collect your shopper’s sensitive payment data on BlueSnap servers without interrupting the checkout flow.</p>\n<p>Sell and settle in multiple currencies</p>\n<p>A simple way to help your shoppers complete their purchase is to offer your products in the currency of your shoppers. The BlueSnap Payment Gateway allows your shoppers to checkout in 100 different currencies and, as an added benefit, using the BlueSnap Payment Gateway gets you access to our connections to 30 global banks. When your shopper completes their purchase, BlueSnap paves the most efficient path to payment success by routing the transaction to the most appropriate local bank for your shopper, minimizing decline rates and maximizing revenue gains.</p>\n<p>Once the sale is complete and you need to get paid, BlueSnap works with you by offering the option to get money into your account in one of our 17 like-for-like payout currencies.</p>\n<p>Fraud Protection and 3D Secure</p>\n<p>The BlueSnap Payment Gateway offers Kount Fraud protection right from the plugin to best optimize the checkout flow. We also provide the option to select advanced fraud options if you want to customize your level of fraud screening.<br />\nIn addition, as you sell to shoppers around the world, you will likely run into a location where you are required to support a 3D Secure checkout experience.  The BlueSnap Payment Gateway has built-in support for 3DS so you aren&#8217;t out of compliance in the regions where this is mandatory.</p>\n<p>Full support for Subscriptions and Pre-Orders</p>\n<p>The BlueSnap Payment Gateway provides support for <strong>WooCommerce Subscriptions</strong>, offering support for all of subscription features, including payment date changes, subscription date changes, and more. The gateway also fully supports <strong>WooCommerce Pre-Orders</strong>, so you can take customer’s payment information upfront and then automatically charge their payment method once the pre-order is released.</p>\n<h3>Recommended Versions</h3>\n<p>We recommend that you use the following versions when using the BlueSnap plugin for WooCommerce. The plugin may work when using older versions of PHP and MySQL as well; however, the following versions have been tested to ensure compatibility.<br />\n* PHP: 7.4 or later<br />\n* MySQL: 5.6 or later<br />\n* WordPress: 5.2.4 or later<br />\n* WooCommerce: 3.7 or later<br />\n* WooCommerce Pre-Orders: 1.5.16 or later<br />\n* WooCommerce Subscriptions: 3.0 or later</p>\n<h3>Software</h3>\n<p>This guide assumes that you have:<br />\n* A working WordPress platform<br />\nWooCommerce is a WordPress plugin that is installed on top of the WordPress platform. If you do not yet have a working WordPress installation, you may want to contact your website hosting provider, as many of them supply a quick-install process for WordPress.</p>\n<ul>\n<li>\n<p>WooCommerce software installed and uploaded to your server.<br />\nIf you need the plugin, go to: https://wordpress.org/plugins/woocommerce/ or to http://www.woothemes.com/woocommerce/ to download the WooCommerce plugin.</p>\n</li>\n<li>\n<p>If you want to use the Pre-Orders or Subscription functionalities, make sure that the respective plugins are also installed in your WordPress website:</p>\n<ul>\n<li>Pre-Orders:  http://www.woothemes.com/products/woocommerce-pre-orders/ </li>\n<li>Subscriptions:  http://www.woothemes.com/products/woocommerce-subscriptions/</li>\n</ul>\n</li>\n</ul>\n<h3>PCI compliance</h3>\n<p>A PCI compliance of SAQ-A is required.</p>\n<p>Setup Steps</p>\n<h3>Step 1: Configure your BlueSnap account settings</h3>\n<p>Before you install the BlueSnap extension, complete these steps in your BlueSnap account:<br />\n1. Set up your BlueSnap API Credentials(https://developers.bluesnap.com/v8976-Basics/docs/api-credentials). Make note of your API username and password; you need them in later steps.</p>\n<ol>\n<li>\n<p>Define the authorized IP address for your server.</p>\n</li>\n<li>\n<p>Configure your payout settings (https://support.bluesnap.com/docs/payout-method).</p>\n</li>\n</ol>\n<h3>Step 2: Install the plugin</h3>\n<p>Install the BlueSnap Payment Gateway plugin, as follows:<br />\n1. In WordPress, click <strong>Plugins &gt; Add New</strong> in the left menu.</p>\n<ol>\n<li>\n<p>Search for <code>BlueSnap</code> in the search box in the top-right side.</p>\n</li>\n<li>\n<p>Click the <strong>BlueSnap Payment Gateway for WooCommerce</strong> plugin and install it.</p>\n</li>\n<li>\n<p>Click <strong>Plugins &gt; Installed Plugins</strong> in the left menu.</p>\n</li>\n<li>\n<p>In the installed plugin screen, <strong>activate</strong> the following plugins, in this order:</p>\n<ul>\n<li>WooCommerce </li>\n<li>WooCommerce Subscriptions (optional) </li>\n<li>WooCommerce Pre-Orders (optional) </li>\n<li>BlueSnap Payment Gateway for WooCommerce </li>\n</ul>\n</li>\n</ol>\n<p><strong>Important</strong><br />\nIf these are not activated in the specified order, the installation will not complete properly.</p>\n<h3>Step 3: Set the Default Currency</h3>\n<p>Configure the default currency settings for WooCommerce by completing the following steps:<br />\n1. Go to <strong>WooCommerce &gt; Settings &gt; General</strong>.</p>\n<ol>\n<li>\n<p>Scroll down to <strong>Currency Options</strong> and set the values as necessary.</p>\n</li>\n<li>\n<p>Click Save Changes.</p>\n</li>\n</ol>\n<h3>Step 4: Configure the plugin</h3>\n<p>Configure the BlueSnap plugin using the following steps:<br />\n1. Click the <strong>Settings</strong> link below the BlueSnap plugin. The BlueSnap page opens.</p>\n<ol>\n<li>Configure the following settings. </li>\n</ol>\n<blockquote>\n<p><strong>Note</strong>: You can find your BlueSnap information (API credentials, Merchant ID, and more) for the following settings in your BlueSnap Merchant Console in <strong>Settings &gt; API Settings</strong>.</p>\n</blockquote>\n<ul>\n<li><strong>Enable/Disable</strong> &mdash; Select Enable BlueSnap. This means that BlueSnap appears as a payment option during checkout. </li>\n<li><strong>Test mode</strong> &mdash; Select Enable Test Mode to use your BlueSnap Sandbox account, select the Enable Test Mode option. Leave the option cleared to use your BlueSnap Production account. </li>\n<li><strong>IPN configuration</strong> &mdash; Copy the URL from this section and use it for the IPN Setup section below. </li>\n<li><strong>Title</strong> &mdash; By default, this is Credit/Debit Cards. This label is presented to the shopper when they choose a payment option during checkout. </li>\n<li><strong>Description</strong> &mdash; By default, this is Pay using your Credit/Debit Card. This describes the payment method during checkout. </li>\n<li><strong>API Username and API Password</strong> &mdash; Enter your API Username and Password for your BlueSnap account. Use your sandbox credentials if you chose Enable Test Mode above. Use your production credentials if you did not chose Enable Test Mode above. </li>\n<li><strong>Merchant ID</strong> &mdash; Enter your Merchant ID number from your BlueSnap merchant account. <br /> <strong>Note</strong>: Use the Merchant ID from you sandbox or production environment, as applicable. They are different. </li>\n<li><strong>Soft Descriptor</strong> &mdash; Enter a string, no more than 20 characters in length. This descriptor appears on the shopper&#8217;s billing statement to help them identify the purchase. You should use the same soft descriptor set in your BlueSnap Console. </li>\n<li><strong>Capture</strong> &mdash; Whether or not to immediately capture the charge. When unchecked, the charge issues an authorization and will need to be captured later. This setting has no effect on subscriptions. Charges on orders related to subscriptions are always captured. </li>\n<li><strong>3D Secure</strong> &mdash; If you want to offer 3-D Secure, contact BlueSnap Merchant Support and ask for 3-D Secure to be enabled for your account. After that is done, you can select this option to activate 3-D Secure. For more information on 3-D Secure, refer to our 3-D Secure Guide (https://support.bluesnap.com/docs/3d-secure).  </li>\n<li><strong>Saved Cards</strong> &mdash; Select this if you want to give logged-in shoppers the option to store their credit card details for future purchases. They can manage their information from their My Account area. </li>\n<li><strong>BlueSnap currency converter</strong> &mdash; BlueSnap works with many currencies (see a complete list at https://support.bluesnap.com/docs/currencies). The BlueSnap plugin for WooCommerce includes a built-in currency converter that you must configure in order to enable successful purchasing via BlueSnap. <br />Select this option to use the converter. </li>\n<li><strong>Select the currencies to display in your shop</strong> &mdash; Select all the currencies your WooCommerce store supports. </li>\n<li><strong>Google Pay Wallet</strong> &mdash; If you want to offer Google Pay as a payment method for your shoppers, contact BlueSnap <a href=\"https://bluesnap.zendesk.com/hc/en-us/requests/new?ticket_form_id=360000127087\" rel=\"nofollow ugc\">Merchant Support</a> and ask for Google Pay to be enabled for your account. After that is done, you can select this option to allow shoppers to pay with Google Pay. </li>\n<li><strong>Google Merchant ID</strong> &mdash; Enter your Google Business Merchant ID. Request for Google Pay production access [here]. Google Pay won&#8217;t be available in production mode until you enter the merchant ID. </li>\n<li><strong>Apple Pay Wallet</strong> &mdash; If you want to offer Apple Pay as a payment method for your shoppers, contact BlueSnap <a href=\"https://bluesnap.zendesk.com/hc/en-us/requests/new?ticket_form_id=360000127087\" rel=\"nofollow ugc\">Merchant Support</a> and ask for Apple Pay to be enabled for your account. After that is done, you can select this option to allow shoppers to pay with Apple Pay. </li>\n<li><strong>Logging</strong> &mdash; Select the Log debug messages option to have communications between WooCommerce and BlueSnap recorded in the process log files. We recommend using this option during the development of your site or if you are experiencing any problems. <br />To access process logs for the BlueSnap plugin, go to <strong>WooCommerce &gt; Status</strong> and click the <strong>Logs</strong> tab. </li>\n</ul>\n<ol>\n<li>Click Save Changes. </li>\n<li>If you would like to accept ACH payments, enable this feature by going to <strong>WooCommerce &gt; Settings &gt; Payments</strong> and setting the <strong>BlueSnap ACH</strong> toggle to <strong>enable.</strong></li>\n<li>Click Save Changes.<br />\n<strong>Important</strong><br />\nIf you plan to offer ACH as a payment method for subscriptions, please note:<br />\nYou will need to contact Merchant Support to have this feature enabled.<br />\nACH is not supported for subscriptions with daily billing, as banks take several days to authorize these charges.</li>\n</ol>\n<h3>Step 5: Secure checkout</h3>\n<p>Ensure that you are using secure checkout by completing the following steps.<br />\n1. Go to <strong>WordPress &gt; Settings &gt; General</strong>.</p>\n<ol>\n<li>In the following URL fields, make sure that the URL begins with <code>https://</code>:\n<ul>\n<li><strong>WordPress Address (URL)</strong></li>\n<li><strong>Site Address (URL)</strong></li>\n</ul>\n</li>\n</ol>\n<h3>Step 6. IPN Setup</h3>\n<p>Instant Payment Notifications (IPNs) are webhooks that trigger an HTTP POST message to your WooCommerce account when an important event occurs. Follow the steps below to set up IPNs.</p>\n<ol>\n<li>\n<p>Log in to your BlueSnap account and go to <strong>Settings &gt; IPN Settings</strong>.</p>\n</li>\n<li>\n<p>Select the <strong>Receive Instant Payment Notifications</strong> check box.</p>\n</li>\n<li>\n<p>Update the <strong>IPN URL(s)</strong> field. The format of the URL should follow this pattern:<br />\n  https://www.yourdomain.com/?wc-api=bluesnap</p>\n</li>\n<li>\n<p>To enable specific IPNs, click <strong>Select IPNs</strong>. In the section that opens, toggle the button next to the IPN to select it. We recommend enabling the following IPN types:</p>\n<ul>\n<li>AUTH_ONLY</li>\n<li>CANCEL_ON_RENEWAL</li>\n<li>CANCELLATION</li>\n<li>CANCELLATION_REFUND</li>\n<li>CHARGE</li>\n<li>CHARGEBACK</li>\n<li>CHARGEBACK_STATUS_CHANGED</li>\n<li>CONTRACT_CHANGE</li>\n<li>DECLINE</li>\n<li>FAILED_PAYOUT_TRANSFER</li>\n<li>RECURRING</li>\n<li>REFUND</li>\n<li>SUBSCRIPTION_REMINDER</li>\n</ul>\n</li>\n<li>\n<p>If you plan to offer ACH as a payment method for subscriptions, make sure to select the <strong>Send Subscription Charge Failure IPN</strong>.</p>\n</li>\n<li>\n<p>Click <strong>Submit</strong>.</p>\n</li>\n</ol>\n<p>For more information on IPNs, refer to our <a href=\"https://support.bluesnap.com/docs/about-ipns\" rel=\"nofollow ugc\">IPN documentation</a>.</p>\n<h3>Step 7: Crontab Setup</h3>\n<p>We recommend that you add a line to your crontab. The crontab is an application that runs in the server operating the WordPress application, and is in charge of periodic actions. It ensures that subscriptions continue to charge on time even if your WooCommerce store has no traffic, stores automatic renewals, and handles pre-orders.<br />\nThe crontab file is available to you in most UNIX/Linux based machines, and often can be found in <code>/var/spool/cron</code>. If you are not sure where your crontab file is, reach out to your IT team or hosting provider for more details.<br />\nYou should add the following line to your crontab file:<br />\n    */15 * * * * {wget path} -q -O – {Web domain of your WooCommerce Store}/ wp-cron.php?doing_wp_cron<br />\nFor example: <code>*/15 * * * * /usr/bin/wget -q -O - http://shoppingcarts.bluesnap.com/wordpress/wp-cron.php?doing_wp_cron</code><br />\nIf you have multiple WooCommerce Stores running on the same server, you should add this line for each one of them.<br />\n<strong>Note</strong>:  <code>*/15</code> makes the crontab run every 15 minutes. You can use this to change the cron frequency.<br />\nFor additional help, contact BlueSnap Merchant Support (https://bluesnap.zendesk.com/hc/en-us/requests/new?ticket_form_id=360000127087).<br />\n<strong>Styling your payment form</strong><br />\nBlueSnap supports the ability to customize the card elements (such as text color or font size) of the payment form. To do this, edit the BlueSnap plugin&#8217;s JavaScript by creating a bluesnapStyleOverrides object that contains your styling. See Supported selectors and Supported CSS properties for details https://developers.bluesnap.com/v8976-Tools/docs/hosted-payment-fields#section-supported-css-properties. Use the code below as a starting point.</p>\n<pre><code>const bluesnapStyleOverrides = {\n  '.invalid': {\n    //style all invalid elements\n    color: 'red'\n  },\n  '.valid': {\n    //style all valid elements\n    color: 'green'\n  },\n  ':focus': {\n    //style all elements on the focus event\n    color: 'orange'\n  },\n  '#ccn': {\n    //style only the card number element\n    color: 'blue'\n  },\n  '#cvv': {\n    //style only the CVV element\n    'font-size': '30px'\n  }\n};\n</code></pre>\n<p><strong>Customizing error messages</strong><br />\nBlueSnap allows you to customize the messages of any errors that occur, giving you full control over the error descriptions that display in the UI or in error logs. To use this feature, you will need to add custom code to your WooCommerce account. We recommend using a plugin such as Code Snippets to accomplish this.<br />\nUse the code sample below as a starting point. You can change error descriptions and add/remove errors from the code below.</p>\n<pre><code>add_filter(\n  'wc_gateway_bluesnap_api_errors',\n  function ( $errors ) {\n      $errors = array(\n          '10000|INVALID_API_VERSION'        =&gt; __( 'API version is not correct...', 'woocommerce-bluesnap-gateway' ),\n          '10001|VALIDATION_GENERAL_FAILURE' =&gt; __( 'This is a val.gen. failure error.', 'woocommerce-bluesnap-gateway' ),\n          '14002'                            =&gt; __( 'This is the new error message for 14002', 'woocommerce-bluesnap-gateway' ),\n          '14002|SYSTEM_TECHNICAL_ERROR'     =&gt; __( 'This is the new error message for 14002|SYSTEM_TECHNICAL_ERROR', 'woocommerce-bluesnap-gateway' ),\n          '14016'                            =&gt; __( 'This is the new error message for 14016', 'woocommerce-bluesnap-gateway' ),\n      );\n      return $errors;\n  }\n);\n</code></pre>\n<p><strong>Managing orders</strong><br />\nIf card charges are not automatically captured, they will result in authorizations that need to be captured later. For example, if you sell physical goods, you will need to capture the authorization when the items are ready to be shipped out. Orders can be conveniently managed from your WooCommerce account by following these steps:<br />\n1. Go to <strong>WooCommerce &gt; Orders</strong> and click the order that you want to manage. The order&#8217;s status will be <strong>On hold.</strong></p>\n<p><strong>Note:</strong> ACH charges will also have a status of <strong>On hold.</strong> You don&#8217;t need to capture these charges.<br />\n2. In the <strong>Status</strong> dropdown, select one of the following:<br />\nIf you want to capture the authorization, select <strong>Processing</strong> or <strong>Completed.</strong><br />\nIf you want to cancel the authorization, select <strong>Cancelled.</strong></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.3.1.0.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/bluesnap-payment-gateway-for-woocommerce/assets/screenshot-1.png?rev=2442457",
            "caption": "Top half of the screen for configuring the BlueSnap plugin in WooCommerce."
        },
        {
            "src": "https://ps.w.org/bluesnap-payment-gateway-for-woocommerce/assets/screenshot-2.png?rev=2442457",
            "caption": "Bottom half of the screen for configuring the BlueSnap plugin in WooCommerce."
        }
    ],
    "tags": {
        "apple-pay": "apple pay",
        "bluesnap": "bluesnap",
        "gateway": "gateway",
        "payment": "payment",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "3.1.0",
    "versions": {
        "1.3.4.1": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.1.3.4.1.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.2.5.0.zip",
        "2.5.1": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.2.5.1.zip",
        "2.5.2": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.2.5.2.zip",
        "2.5.3": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.2.5.3.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.2.6.0.zip",
        "2.6.1": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.2.6.1.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.2.6.2.zip",
        "2.6.3": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.2.6.3.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.3.0.1.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.3.1.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/bluesnap-payment-gateway-for-woocommerce.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://saucal.com",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/bluesnap-payment-gateway-for-woocommerce/assets/icon-128x128.png?rev=2161537",
        "2x": "https://ps.w.org/bluesnap-payment-gateway-for-woocommerce/assets/icon-256x256.png?rev=2161533"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 46,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}