{
    "name": "BotPenguin &#8211; Generative AI Chatbot with Live Chat &amp; ChatGPT",
    "slug": "botpenguinbot",
    "version": "1.5.1",
    "author": "<a href=\"https://botpenguin.com\">BotPenguin</a>",
    "author_profile": "https://profiles.wordpress.org/botpenguinbot/",
    "contributors": {
        "botpenguin": {
            "profile": "https://profiles.wordpress.org/botpenguin/",
            "avatar": "https://secure.gravatar.com/avatar/581befff2ef61bf6684f81ccdd55034d?s=96&d=monsterid&r=g",
            "display_name": "botpenguin"
        }
    },
    "requires": "4.2",
    "tested": "6.5.5",
    "requires_php": "5.2.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/botpenguinbot/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 500,
    "downloaded": 10955,
    "last_updated": "2024-05-23 12:03:00",
    "added": "2019-09-27",
    "homepage": "https://botpenguin.com",
    "sections": {
        "description": "<p>BotPenguin is a leading AI Chatbot maker platform that enables you to create AI chatbots for WordPress websites. It also offers a range of chatbot solutions for WhatsApp, Websites, Facebook Messenger, Microsoft Teams, Telegram, and Shopify – all 100% FREE!</p>\n<p><strong>30,000+ Users | 60+ Integrations | ChatGPT Chatbot | 40+ Use Case Templates</strong></p>\n<p>Elevate your business with powerful features such as lead generation, appointment booking, customer support, marketing automation, and more. Build no-code AI chatbots effortlessly with Live Chat and ChatGPT Integration.</p>\n<p>Take customer interactions to the next level with generative AI capabilities, such as website &amp; data set scraping, contextual conversations, auto-language translation, FAQs file upload, and more. You can train your chatbot on your own data and instantly help visitors anytime.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ZRtAz78LSOI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>You can make your WordPress chatbot more powerful by connecting it to 60 tools, including Salesforce, HubSpot, Google Calendar, SimplyBook, Zoho, GoHighLevel, Google Suite, and ChatGPT. The best part is connecting custom applications from your tech stack with BotPenguin.</p>\n<p>BotPenguin is the best chatbot platform to create AI chatbot for WordPress &amp; various other platforms, allowing you to reach your customers at every touch point.</p>\n<p><strong>WooCommerce | WhatsApp | Microsoft Teams | Telegram | Facebook</strong></p>\n<p>You can use our AI chatbot for your diverse business use cases, such as Healthcare, Fitness, Skin Care, Apparel Stores, Entertainment, E-Learning, &amp; more. It automates your business communications completely for higher engagement &amp; revenue.</p>\n<h3>PLANS:</h3>\n<ul>\n<li>Baby — Free</li>\n<li>King- starts at $5 a month or $50 for a year</li>\n<li>Emperor(Contact)</li>\n</ul>\n<p><a href=\"https://botpenguin.com/chatbot-pricing\" rel=\"nofollow ugc\">Explore Pricing</a> | <a href=\"https://meetings.hubspot.com/anmol22\" rel=\"nofollow ugc\">Request a Demo</a> | <a href=\"https://help.botpenguin.com/\" rel=\"nofollow ugc\">Access Documentation</a></p>\n<h3>Key Features</h3>\n<p><strong>1. Generative AI Chatbot</strong><br />\nBotPenguin offers chatbots for WordPress with ChatGPT integration. You can train your AI bot on websites &amp; custom data sets, FAQ files, and previous interactions. It can also talk contextually based on chat history and make users feel valued.</p>\n<p><strong>2. Live Chat</strong><br />\nConnect instantly with visitors. Real-time assistance enhances user experience, resolving queries promptly and fostering meaningful interactions on your WordPress site.</p>\n<p><strong>3. Drag-and-Drop Builder</strong><br />\nEffortlessly design your chatbot interface and condition flow with drag-and-drop elements. Simplify customization, saving time and ensuring a seamless user experience for your WordPress website.</p>\n<p><strong>4. Train on Your Own Data</strong><br />\nYou can Customize your WordPress AI chatbot&#8217;s knowledge base. Train it on your data using PDF &amp; Docx files for accurate and context-aware responses, making interactions on your WordPress site more engaging.</p>\n<p><strong>5. Integrate Ticketing System</strong><br />\nIntegrate a ticketing system like Groove, Zendesk, Freshdesk, and more to manage customer inquiries effortlessly. Automatically create tickets during chats, enhancing support efficiency and issue resolution on your WordPress platform.</p>\n<p><strong>6. Configure Chatbot Personality</strong><br />\nInfuse character into your WordPress AI chatbot by customizing answer length, formatting, and language. You can also enable it to add sources in the responses and tailor its tone and style to match your brand, creating a unique and personable interaction on your website.</p>\n<p><strong>7. Integrate With Your CRM</strong><br />\nIntegrate your WordPress AI chatbot with popular CRMs like Salesforce, HubSpot, Zoho, GoHighLevel, and more, ensuring efficient data access for enhanced customer relationship management on your website.</p>\n<p><strong>8. Chat Routing</strong><br />\nOptimize support operations by assigning conversations to available agents through the chat routing feature, ensuring swift and effective query resolution.</p>\n<p><strong>9. Team Creation</strong><br />\nCreate your team of live agents to handle complex queries. Let AI handle the routine questions and take over the live chat when customers require dedicated assistance.</p>\n<p><strong>10. Conversation History and Tags</strong><br />\nThrough the conversation history feature, you can effortlessly access past conversations and use tags for efficient tracking, marketing automation, and lead segmentation.</p>\n<p><strong>11. Conversational Landing Page</strong><br />\nElevate your landing page with impressive chatbots that effortlessly collect leads and conduct surveys for an engaging visitor experience.</p>\n<p><strong>12. Platform-Specific Chatbot</strong><br />\nDeploy tailored chatbots for Facebook Messenger, WhatsApp, Telegram, and your website through the versatile generative AI chatbot maker.</p>\n<p><strong>13. Human and Bot Handover</strong><br />\nFacilitate smooth transitions between bot and human interactions, offering a seamless experience based on business requirements.</p>\n<p><strong>14. Unified Chat Inbox</strong><br />\nStreamline communication by receiving customer questions and visitor queries in one intuitive, user-friendly console. You can access and reply to any users from the unified chatbot interface.</p>\n<p><strong>15. Rich Media Options</strong><br />\nYou can easily share files with users through WordPress Chatbots and enrich user interaction using GIFs, emojis, docs, and images, providing an immersive and enjoyable chatbot experience for your audience.</p>\n<p><strong>16. Saved Replies</strong><br />\nSave time with an extensive library of pre-built replies, streamlining responses and enhancing efficiency for both users and agents.</p>\n<p><strong>17. Visitor List and Details</strong><br />\nEnhance customer data by collecting and managing visitor details such as page history, location, device, email, social handles, phone number, etc., enabling your WordPress ChatGPT Chatbots to lead personalized and targeted engagement strategies for optimal results.</p>\n<p><strong>18. Role-Based Access</strong><br />\nStreamline support operations by assigning specific roles to teams, ensuring efficient and secure access to chatbot functionalities based on responsibilities.</p>\n<p><strong>17. Multilingual Support</strong><br />\nBreak language barriers by conducting conversations in over 20+ languages, including English, Spanish, Portuguese, Arabic, Chinese, Danish, Dutch, French, German, Hebrew, Hindi, Italian, Japanese, Korean, Persian, Polish, Romanian, Russian, and Swedish, ensuring global accessibility and inclusivity.</p>\n<p><strong>18. Visitor Status</strong><br />\nQuickly identify visitors&#8217; online, offline, or away status, allowing for real-time adjustments and proactive engagement strategies.</p>\n<p><strong>19. Brand-Tailored Chatbot</strong><br />\nYou can customize your WordPress chatbot&#8217;s tone, avatar, chat window, and message lengths to match your website&#8217;s theme and personality. Plus, you can add a chatbot anywhere on your WordPress website.</p>\n<p><strong>20. Teams’ Availability</strong><br />\nOptimize chat routing and support flow by creating effective time slots for your teams, ensuring efficient and timely responses.</p>\n<p><strong>21. User Insights</strong><br />\nWith detailed visitor profiles, you can attain a deeper understanding of users, providing valuable insights like open rates, leads generated, response rates, etc.</p>\n<p><strong>22. Leads on Email</strong><br />\nAcquire valuable leads and receive notifications via email, ensuring prompt follow-up and engagement with potential customers.</p>\n<p><strong>23. Typing Indicator</strong><br />\nGain insights into customer intent by monitoring real-time typing indicators, improving the overall chatbot interaction and response accuracy.</p>\n<p><strong>24. Trigger Timer</strong><br />\nSet trigger times for website chatbot responses, aligning chatbot interactions with optimal user engagement periods for enhanced effectiveness.</p>\n<p>The list of features goes on. You can <a href=\"https://botpenguin.com/chatbot-features\" rel=\"nofollow ugc\">click here</a> to learn more about our WordPress Chatbot’s features.</p>\n<h3>Create Your WordPress Chatbot in 2 Minutes</h3>\n<p>Follow these steps for a code-free WordPress chatbot integration and elevate your website experience.</p>\n<p><strong>1. Craft Your Bot &amp; Design Flows:</strong> Personalize your chatbot and design engaging flows with templates to suit your business needs.</p>\n<p><strong>2. Download WordPress Plugin:</strong> Access and download the latest WordPress chatbot plugin directly from your dashboard.</p>\n<p><strong>3. Integrate Smoothly:</strong> To integrate with WordPress seamlessly, activate your chatbot by pasting the API key from the BotPenguin Menu.</p>\n<p><strong>4. Test Chatbot Impact:</strong> Head to the BotPenguin dashboard, launch your chatbot, integrate with ChatGPT, and experience AI-driven interactions in action. Optimize for success!</p>\n<p><strong>Install the WordPress Chatbot Plugin for Seamless Integration and Smarter Conversations on Your Website.</strong></p>\n<p><a href=\"https://downloads.wordpress.org/plugin/botpenguinbot.zip\" rel=\"nofollow ugc\">Download Now</a></p>\n<h3>Web and Social Media Platforms</h3>\n<p>Want to grow beyond WordPress?BotPenguin has you covered:</p>\n<p><strong>WordPress Websites:</strong> Be it WordPress, Shopify, Squarespace, or your own custom website, equip it with BotPenguin’s ChatGPT chatbot. Automate interactions and bring your website to life with 24*7 chatbots that generate leads and handle queries.</p>\n<p><strong>WooCommerce Chatbot:</strong> Integrate our WordPress Chatbot with WooCommerce to keep customers informed with order updates, handle return/refund/exchange notifications, showcase product catalogs, track orders, integrate payment gateways, and leverage ChatGPT for intelligent conversations.</p>\n<p><strong>WhatsApp:</strong> Expand your reach and engage with users using WhatsApp marketing with BotPenguin&#8217;s AI chatbot. Send notifications, accept payments, track orders, organize broadcasts &amp; drips, enable bookings, and more.</p>\n<p><strong>Facebook:</strong> Enhance your Facebook presence with BotPenguin&#8217;s AI chatbots that can auto-reply to comments &amp; DMs, automate marketing broadcasts &amp; drip campaigns, answer FAQs with generative AI, and generate leads.</p>\n<p><strong>Telegram:</strong> Connect with your audience on Telegram using BotPenguin&#8217;s chatbot, providing instant assistance with FAQs, appointment bookings, personalized content suggestions, and broadcast &amp; drip campaigns.</p>\n<p><strong>Instagram:</strong> Make your Instagram profile interactive and engaging by integrating BotPenguin&#8217;s chatbot to answer FAQs, reply to comments, send broadcasts, organize drip campaigns, and show product catalogs.</p>\n<p><strong>Microsoft Teams:</strong> Boost productivity and streamline collaboration in Microsoft Teams with BotPenguin. Your Teams chatbot with generative AI can automate tasks, give permissions, share resources, create cards to assign tasks, manage workflows, and enhance team communication.</p>\n<p><strong>Other CMS:</strong> BotPenguin seamlessly integrates with other CMS, such as Shopify, Squarespace, Wix, and more. Elevate your digital presence across the spectrum of content management systems.</p>\n<p>To make things better, all these AI chatbots integrate with ChatGPT models to provide a truly conversational experience to your customers across channels.</p>\n<h3>Key Native Integrations</h3>\n<p><strong>Customer Relationship Management:</strong> HubSpot, GoHighLevel, Zoho, Salesforce, and more! Seamlessly integrate your WordPress ChatGPT chatbot with leading CRMs for efficient data management and streamlined customer interactions.</p>\n<p><strong>Appointment Booking:</strong> Utilize Google Calendar, Calendly, and Simplybook to streamline appointment scheduling. Integrate these booking platforms with your WordPress AI chatbots for automated booking and efficient calendar management.</p>\n<p><strong>Marketing Automation:</strong> Grove, HelpDocs, ZingTree, and GetResponse—integrate seamlessly with your WordPress Chatbot driven by ChatGPT for powerful marketing automation. Enhance campaigns, engage users, and track results effortlessly.</p>\n<p><strong>Google Integration:</strong> Connect BotPenguin Chatbot to enhance the Google Sheets experience! No more manual imports. Connect your favorite Bot with Google Sheets to auto-import data from multiple channels.</p>\n<p><strong>ChatGPT:</strong> Leverage ChatGPT integration for advanced conversational AI. Combine BotPenguin with ChatGPT for enhanced natural language understanding and intelligent chatbot responses—transforming user interactions.</p>\n<p><strong>Pabbly &amp; Zapier:</strong> Empower your business with Pabbly and Zapier integrations. Seamlessly connect BotPenguin to 1000+ apps for efficient data flow, automation, and streamlined processes—maximize productivity effortlessly.</p>\n<p>And many more (60+ Integrations). On top of that, you can integrate with any third-party application of your choice and add custom LLM models to enhance the generative AI powers of your WordPress chatbots.</p>\n<h3>What Our Users Say</h3>\n<p>I was thoroughly impressed by the effortless configuration process of the chatbot. The platform offers a myriad of customization options, empowering us to craft a sophisticated chatbot, leverage templates, and delve into various enriching add-ons. – Vedant</p>\n<p>BotPenguin highly recommended. Great product with really great tech service. Used across our apps. B2B customer service and product feature available.  – Twana D.</p>\n<p>We have empowered many successful businesses across industries with our generative AI chatbots, rendering features like WhatsApp marketing automation, eCommerce integrations, automated lead capture, AI-powered customer support, custom ChatGPT integration, &amp; more.</p>\n<p>Our top clients include <strong>EcoPooling, Store My Goods, ModWash, Cyboard, MedoPlus, Chathoot, Amazing India, Intervue, Enventure, TBWAdvertising,</strong> and more.</p>\n<h3>Why Choose Us</h3>\n<ul>\n<li>Drag &amp; Drop Builder – Build, design, and deploy chatbot in under 10 minutes with its drag-and-drop builder and exceptional UI.</li>\n<li>FREE Forever plan allows you to use and test it without cost and worries.</li>\n<li>Exceptional UX – It provides an excellent user interface experience through tip tools, help texts, tutorials, and guides.</li>\n<li>Multiple Platforms – Integrates with Websites, <a href=\"https://botpenguin.com/platform/chatbot-for-facebook\" rel=\"nofollow ugc\">Facebook Messenger</a>, <a href=\"https://botpenguin.com/platform/chatbot-for-whatsapp\" rel=\"nofollow ugc\">WhatsApp</a>, Telegram, Microsoft Teams, and Instagram Promotional Pages.</li>\n<li>Multi-Lingual</li>\n<li>Ready-to-Use Templates – Choose more than 40+ available chatbot templates that suit your business use case and ease up the way of having your own WordPress chatbot.</li>\n<li>Live Chat Plugin – Interact with your customers online in real time for seamless communication support.</li>\n<li>Chat Widgets – Live Chat Widget can be connected to any promotional pages or ads to capture visitors’ attention and route them to Chatbots. </li>\n<li>Exceptional Customer Support – In case of any issue, we provide multiple-channel support via email, live chat, or WhatsApp messaging.</li>\n<li>Expert Technical Support – Free support to guide you on creating, customizing, and using BotPenguin for your business.</li>\n</ul>\n<h3>Chatbot Agency &amp; Partnership Program Options</h3>\n<p>Using our WordPress ChatGPT chatbots is a good deal. What’s even better? You can easily become an AI chatbot reseller with BotPenguin. If it piques your curiosity, dive into a world of BotPenguin’s partner possibilities!</p>\n<p><strong>Affiliate Partner Program:</strong> Join our Affiliate Partner Program and hop on the success train with zero fees! Earn a cool 20% in commissions, plus give your referrals a sweet 10% discount. No limits on what you can earn, a generous 110-day cookie period, and a handy dashboard to keep it all hassle-free.</p>\n<p><strong>Implementation Partnership Program:</strong> Embark on a partnership journey without breaking the bank! Our Implementation Partnership Program comes with unlimited commissions. You get your own Partner Panel for smooth client management, customizable plans, tech experts on speed dial, and top-notch onboarding.</p>\n<p><strong>White Label Chatbot Partner Program:</strong> Ever dreamt of having your own chatbot business? Well, dream no more! Our White Label Chatbot Partner Program lets you fully brand your business – your domain, your logo, your brand! With custom pricing, bulk message packs, and seamless subscriber management.</p>\n<h3>Integration</h3>\n<p>Our plugin serves as a bridge to connect your WordPress website with BotPenguin&#8217;s chatbot services. Utilizing CDN JS files, we fetch the user interface from BotPenguin to integrate the chatbot seamlessly into your site. Activating the chatbot&#8217;s services is achieved by inputting the secret key provided by BotPenguin.<br />\nPlease note that all chatbot services provided through our plugin are exclusively owned and operated by BotPenguin. We are the sole owners of this network and do not rely on any third-party service providers.<br />\nFor more information on privacy and usage policies, please refer to BotPenguin&#8217;s privacy policy and terms of use.<br />\nWe value transparency and encourage users to review these policies for a comprehensive understanding of how their data is handled and the terms governing the use of BotPenguin&#8217;s services.</p>\n",
        "installation": "<p>It just takes 5 minutes to install the BotPenguin plugin to your WordPress Website in a few simple steps:<br />\n<strong>1. Log in to the [BotPenguin App] (app.botpenguin.com) and copy the WordPress API key.</strong><br />\n&#8211; Go to app.botpenguin.com &amp; log in to your BotPenguin account.<br />\n&#8211; Select the Chatbot you wish to connect to the WordPress website from the ‘Bots’ tab in the left side panel.<br />\n&#8211; Click on the ‘Install Your Chat Bot’ tab.<br />\n&#8211; Select WordPress, copy the API key/code, and save it safely.</p>\n<p><strong>2. Install the BotPenguin chat plugin from the WordPress plugin center.</strong><br />\n&#8211; Now, go to the WordPress site admin dashboard.<br />\n&#8211; Find the WordPress plugin center and search for the BotPenguin in the search box.<br />\n&#8211; Once you find the BotPenguin Plugin, install the same.<br />\n&#8211; Upon installation, you will see the ‘Activate’ tab. Click on the activate button to activate the plugin.</p>\n<p><strong>3. Paste WordPress API Code/key and make the Bot live.</strong><br />\n&#8211; Once the BotPenguin plugin is activated, search for the ‘tools’ in the left-side panel.<br />\n&#8211; Under the tools menu, you will find ‘BotPenguin’.<br />\n&#8211; Click on BotPenguin to see the option to paste the BotPenguin API key/code you copied in step 1.<br />\n&#8211; Paste the API key/code, and proceed by saving the key.</p>\n<p><strong>4. Test your Chatbot now.</strong><br />\n&#8211; Open your website in private mode (Incognito window) to avoid any cache issues<br />\nand you will find BotPenguin Chatbot on your website.</p>\n<p>You can see the demo video <span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ZRtAz78LSOI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n",
        "faq": "<p>Here are the few very frequently asked questions and their answers as<br />\nfollows:</p>\n\n<dt id='what%20is%20the%20chatbot%20pricing%20structure%3F'>\nWhat is the chatbot pricing structure?\n</h4>\n<p>\n<p>BotPenguin offers 3 easy plans for you based on your business needs.<br />\nBaby<br />\n– It offers you a free chatbot that has basic features.<br />\nKing<br />\n&#8211; It offers you unlimited bots and 3000 interactions every month.<br />\nEmperor<br />\n– It offers you unlimited bots and unlimited interactions every month.</p>\n<p>All these plans have different pricing. <a href=\"https://botpenguin.com/pricing-table\" rel=\"nofollow ugc\">Click here</a> to know the chatbot pricing details, and you can also compare the features available in different plans.</p>\n</p>\n<dt id='does%20your%20wordpress%20chatbot%20with%20chatgpt%20offer%20a%20free%20plan%3F'>\nDoes your WordPress Chatbot With ChatGPT offer a free plan?\n</h4>\n<p>\n<p>We offer a free chatbot in our Baby plan; there is no need to pay or provide card details; you can simply use it by signing up. You can use up to 100 conversations with ChatGPT with AI features for website scraping, custom data sets, previous interactions, &amp; uploading FAQs. For further use, you must integrate your OpenAI’s ChatGPT account with BotPenguin.</p>\n</p>\n<dt id='does%20wordpress%20have%20a%20chatbot%3F'>\nDoes WordPress have a chatbot?\n</h4>\n<p>\n<p>Yes, BotPenguin offers a powerful AI chatbot for WordPress with ChatGPT integration, providing seamless interactions and various features like lead generation, appointment booking, and more.</p>\n</p>\n<dt id='can%20you%20use%20chatgpt%20with%20wordpress%3F'>\nCan you use ChatGPT with WordPress?\n</h4>\n<p>\n<p>Absolutely! BotPenguin&#8217;s ChatGPT-integrated chatbot is designed for WordPress, allowing you to enhance user engagement and automate interactions on your website 24/7. You can integrate the ChatGPT model of your choice and train the GPT bot on your data to fit your use case.</p>\n</p>\n<dt id='how%20do%20i%20add%20a%20chatbot%20to%20my%20wordpress%20site%20for%20free%3F'>\nHow do I add a chatbot to my WordPress site for free?\n</h4>\n<p>\n<p>BotPenguin offers a free forever plan. Craft your chatbot using the drag-and-drop builder, download the WordPress plugin, and seamlessly integrate it for a code-free experience. The free plan offers 2000 monthly messages, ChatGPT integration, Live Chat, and unlimited contacts.</p>\n</p>\n<dt id='how%20do%20i%20add%20an%20ai%20chatbot%20to%20wordpress%3F'>\nHow do I add an AI chatbot to WordPress?\n</h4>\n<p>\n<p>Follow these steps to create an AI chatbot on WordPress:<br />\nStep 1: Create a new chatbot with BotPenguin.<br />\nStep 2: Configure the avatar and name of your bot.<br />\nStep 3: After creating the bot, go to 3rd party integrations.<br />\nStep 4: Search for ChatGPT and open it from the integration list.<br />\nStep 5: Enter your OpenAI’s account API key and click Done.<br />\nStep 6: Download our WordPress Chatbot plugin and install it on your site.<br />\nStep 7: Go to your Chatbot &gt; Install Your Chatbo &gt; WordPress and copy the BotPenguin API key.<br />\nStep 8: Paste the API key in the WordPress &amp; you are done.</p>\n</p>\n<dt id='what%20is%20chatgpt%20wordpress%3F'>\nWhat is ChatGPT WordPress?\n</h4>\n<p>\n<p>ChatGPT WordPress refers to integrating ChatGPT with BotPenguin&#8217;s chatbot on WordPress, providing advanced natural language understanding and intelligent responses for user interactions.</p>\n</p>\n<dt id='how%20do%20i%20create%20an%20ai%20tool%20in%20wordpress%3F'>\nHow do I create an AI tool in WordPress?\n</h4>\n<p>\n<p>Craft your AI chatbot on BotPenguin, leveraging AI-driven features like ChatGPT. Download the WordPress plugin and integrate it seamlessly to add an AI tool to your website.</p>\n</p>\n<dt id='how%20to%20install%20chatgpt%20on%20a%20website%3F'>\nHow to install ChatGPT on a website?\n</h4>\n<p>\n<p>Install ChatGPT on your website by creating a chatbot on BotPenguin, integrating the WordPress plugin, and activating the chatbot for AI-driven interactions and enhanced user engagement.</p>\n</p>\n<dt id='how%20do%20i%20create%20a%20chat%20app%20in%20wordpress%3F'>\nHow do I create a chat app in WordPress?\n</h4>\n<p>\n<p>Use BotPenguin&#8217;s drag-and-drop builder and WordPress plugin to create and customize your chat app easily. Craft engaging flows and integrate them seamlessly for a code-free experience.</p>\n</p>\n<dt id='is%20there%20a%20whatsapp%20plugin%20for%20wordpress%3F'>\nIs there a WhatsApp plugin for WordPress?\n</h4>\n<p>\n<p>While BotPenguin doesn&#8217;t have a specific WhatsApp plugin, it seamlessly integrates with WhatsApp, providing marketing automation, drip &amp; broadcast campaigns, notifications, bookings, and more for a comprehensive WhatsApp chatbot experience.</p>\n</p>\n<dt id='can%20i%20change%20my%20billing%20system%20from%20annually%20to%20monthly%3F'>\nCan I change my billing system from annually to monthly?\n</h4>\n<p>\n<p>Yes, you can change your billing system from annually to monthly by switching to the monthly option. In such a case, you will be charged monthly prices.</p>\n</p>\n<dt id='do%20you%20offer%20discounts%20on%20annual%20payments%3F'>\nDo You offer discounts on annual payments?\n</h4>\n<p>\n<p>Yes, the prices offered for the annual billing system are discounted<br />\nprices. When you subscribe to a yearly plan, you pay for only 10 months. 2 months are on us!</p>\n</p>\n<dt id='which%20plan%20is%20suitable%20for%20my%20business%3F'>\nWhich Plan is suitable for my business?\n</h4>\n<p>\n<p>We suggest you choose a plan based on your business needs.<br />\nFor more information, you can reach out to us at contact@botpenguin.com</p>\n</p>\n<dt id='do%20you%20offer%20white%20labeling%3F'>\nDo you offer White labeling?\n</h4>\n<p>\n<p>Yes, we offer White Labelling to agencies for Websites and WhatsApp Chatbots. You can completely customize your platforms, be it pricing, branding, logos, subscription plans, features, integrations, and more. Please write to us at partners@botpenguin.com</p>\n</p>\n<dt id='what%20are%20some%20of%20the%20things%20i%20can%20do%20with%20this%20bot%3F'>\nWhat are some of the things I can do with this bot?\n</h4>\n<p>\n<ul>\n<li>Integrate with the Email list</li>\n<li>Connect with Newsletters</li>\n<li>Track your calls &amp; appointments</li>\n<li>Accounting chatbot</li>\n<li>Ads and Analytics Bot</li>\n<li>Chatbot for Apps</li>\n<li>Appointment setting Chatbot</li>\n<li>Customer Appreciation and re-engagement chatbot</li>\n<li>Customer Relationship Management (CRM)</li>\n<li>Customer Support chatbot</li>\n<li>Databases management chatbot</li>\n<li>E-commerce chatbot</li>\n<li>Education chatbot</li>\n<li>Team Collaboration chatbot</li>\n<li>Time Tracking chatbot</li>\n<li>Make To-do Lists with the chatbot</li>\n<li>Reminders chatbot</li>\n<li>Scheduling chatbot</li>\n<li>Payment Processing chatbot</li>\n<li>Phone &amp; SMS Bot</li>\n<li>Survey chatbot, and; many more.</li>\n</ul>\n</p>\n<dt id='what%20are%20some%20of%20the%20ready-to-use%20templates%20that%20come%20with%20this%20bot%3F'>\nWhat are some of the ready-to-use templates that come with this bot?\n</h4>\n<p>\n<ul>\n<li>Chatbots for Travel Agency</li>\n<li>Chatbots for Hotel Booking</li>\n<li>Chatbots for Restaurant Table Booking</li>\n<li>Chatbots for Coworking Space</li>\n<li>Chatbots for Legal Services</li>\n<li>Chatbots for Real Estate</li>\n<li>Chatbots for Dental Clinic</li>\n<li>Chatbots for Solar Panels</li>\n<li>Chatbots for Car Rentals</li>\n<li>Chatbots for Overseas Education Consultancy</li>\n<li>Chatbots for HR Consultancy</li>\n<li>Chatbots for E-Commerce</li>\n<li>Chatbots for E-Commerce Product Catalogues</li>\n<li>Chatbots for E-Learning Bot</li>\n<li>Chatbots for Children&#8217;s School and Admissions</li>\n<li>Chatbots for Food or Pizza Delivery</li>\n<li>Chatbots for Eatery Order</li>\n<li>Chatbots for Personal Trainer</li>\n<li>Chatbots for Dietician Chatbot</li>\n<li>Chatbots for SAAS Enquiry</li>\n<li>Chatbots for Webinar Registration</li>\n<li>Chatbots for Coaching Institute</li>\n<li>Chatbots for University/College </li>\n<li>Chatbots for Doctor Appointments</li>\n<li>Chatbots for Digital Marketing</li>\n<li>Chatbots for Events Planners</li>\n<li>Chatbots for Hospital Booking</li>\n</ul>\n<p>For more guides, visit (https://help.botpenguin.com/)</p>\n</p>\n\n"
    },
    "short_description": "WordPress AI Chatbot with Live Chat &amp; ChatGPT for your website. It automates Customer Support, Lead Generation, Bookings, Marketing, eCommerce, etc.",
    "description": "<p>BotPenguin is a leading AI Chatbot maker platform that enables you to create AI chatbots for WordPress websites. It also offers a range of chatbot solutions for WhatsApp, Websites, Facebook Messenger, Microsoft Teams, Telegram, and Shopify – all 100% FREE!</p>\n<p><strong>30,000+ Users | 60+ Integrations | ChatGPT Chatbot | 40+ Use Case Templates</strong></p>\n<p>Elevate your business with powerful features such as lead generation, appointment booking, customer support, marketing automation, and more. Build no-code AI chatbots effortlessly with Live Chat and ChatGPT Integration.</p>\n<p>Take customer interactions to the next level with generative AI capabilities, such as website &amp; data set scraping, contextual conversations, auto-language translation, FAQs file upload, and more. You can train your chatbot on your own data and instantly help visitors anytime.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ZRtAz78LSOI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>You can make your WordPress chatbot more powerful by connecting it to 60 tools, including Salesforce, HubSpot, Google Calendar, SimplyBook, Zoho, GoHighLevel, Google Suite, and ChatGPT. The best part is connecting custom applications from your tech stack with BotPenguin.</p>\n<p>BotPenguin is the best chatbot platform to create AI chatbot for WordPress &amp; various other platforms, allowing you to reach your customers at every touch point.</p>\n<p><strong>WooCommerce | WhatsApp | Microsoft Teams | Telegram | Facebook</strong></p>\n<p>You can use our AI chatbot for your diverse business use cases, such as Healthcare, Fitness, Skin Care, Apparel Stores, Entertainment, E-Learning, &amp; more. It automates your business communications completely for higher engagement &amp; revenue.</p>\n<h3>PLANS:</h3>\n<ul>\n<li>Baby — Free</li>\n<li>King- starts at $5 a month or $50 for a year</li>\n<li>Emperor(Contact)</li>\n</ul>\n<p><a href=\"https://botpenguin.com/chatbot-pricing\" rel=\"nofollow ugc\">Explore Pricing</a> | <a href=\"https://meetings.hubspot.com/anmol22\" rel=\"nofollow ugc\">Request a Demo</a> | <a href=\"https://help.botpenguin.com/\" rel=\"nofollow ugc\">Access Documentation</a></p>\n<h3>Key Features</h3>\n<p><strong>1. Generative AI Chatbot</strong><br />\nBotPenguin offers chatbots for WordPress with ChatGPT integration. You can train your AI bot on websites &amp; custom data sets, FAQ files, and previous interactions. It can also talk contextually based on chat history and make users feel valued.</p>\n<p><strong>2. Live Chat</strong><br />\nConnect instantly with visitors. Real-time assistance enhances user experience, resolving queries promptly and fostering meaningful interactions on your WordPress site.</p>\n<p><strong>3. Drag-and-Drop Builder</strong><br />\nEffortlessly design your chatbot interface and condition flow with drag-and-drop elements. Simplify customization, saving time and ensuring a seamless user experience for your WordPress website.</p>\n<p><strong>4. Train on Your Own Data</strong><br />\nYou can Customize your WordPress AI chatbot&#8217;s knowledge base. Train it on your data using PDF &amp; Docx files for accurate and context-aware responses, making interactions on your WordPress site more engaging.</p>\n<p><strong>5. Integrate Ticketing System</strong><br />\nIntegrate a ticketing system like Groove, Zendesk, Freshdesk, and more to manage customer inquiries effortlessly. Automatically create tickets during chats, enhancing support efficiency and issue resolution on your WordPress platform.</p>\n<p><strong>6. Configure Chatbot Personality</strong><br />\nInfuse character into your WordPress AI chatbot by customizing answer length, formatting, and language. You can also enable it to add sources in the responses and tailor its tone and style to match your brand, creating a unique and personable interaction on your website.</p>\n<p><strong>7. Integrate With Your CRM</strong><br />\nIntegrate your WordPress AI chatbot with popular CRMs like Salesforce, HubSpot, Zoho, GoHighLevel, and more, ensuring efficient data access for enhanced customer relationship management on your website.</p>\n<p><strong>8. Chat Routing</strong><br />\nOptimize support operations by assigning conversations to available agents through the chat routing feature, ensuring swift and effective query resolution.</p>\n<p><strong>9. Team Creation</strong><br />\nCreate your team of live agents to handle complex queries. Let AI handle the routine questions and take over the live chat when customers require dedicated assistance.</p>\n<p><strong>10. Conversation History and Tags</strong><br />\nThrough the conversation history feature, you can effortlessly access past conversations and use tags for efficient tracking, marketing automation, and lead segmentation.</p>\n<p><strong>11. Conversational Landing Page</strong><br />\nElevate your landing page with impressive chatbots that effortlessly collect leads and conduct surveys for an engaging visitor experience.</p>\n<p><strong>12. Platform-Specific Chatbot</strong><br />\nDeploy tailored chatbots for Facebook Messenger, WhatsApp, Telegram, and your website through the versatile generative AI chatbot maker.</p>\n<p><strong>13. Human and Bot Handover</strong><br />\nFacilitate smooth transitions between bot and human interactions, offering a seamless experience based on business requirements.</p>\n<p><strong>14. Unified Chat Inbox</strong><br />\nStreamline communication by receiving customer questions and visitor queries in one intuitive, user-friendly console. You can access and reply to any users from the unified chatbot interface.</p>\n<p><strong>15. Rich Media Options</strong><br />\nYou can easily share files with users through WordPress Chatbots and enrich user interaction using GIFs, emojis, docs, and images, providing an immersive and enjoyable chatbot experience for your audience.</p>\n<p><strong>16. Saved Replies</strong><br />\nSave time with an extensive library of pre-built replies, streamlining responses and enhancing efficiency for both users and agents.</p>\n<p><strong>17. Visitor List and Details</strong><br />\nEnhance customer data by collecting and managing visitor details such as page history, location, device, email, social handles, phone number, etc., enabling your WordPress ChatGPT Chatbots to lead personalized and targeted engagement strategies for optimal results.</p>\n<p><strong>18. Role-Based Access</strong><br />\nStreamline support operations by assigning specific roles to teams, ensuring efficient and secure access to chatbot functionalities based on responsibilities.</p>\n<p><strong>17. Multilingual Support</strong><br />\nBreak language barriers by conducting conversations in over 20+ languages, including English, Spanish, Portuguese, Arabic, Chinese, Danish, Dutch, French, German, Hebrew, Hindi, Italian, Japanese, Korean, Persian, Polish, Romanian, Russian, and Swedish, ensuring global accessibility and inclusivity.</p>\n<p><strong>18. Visitor Status</strong><br />\nQuickly identify visitors&#8217; online, offline, or away status, allowing for real-time adjustments and proactive engagement strategies.</p>\n<p><strong>19. Brand-Tailored Chatbot</strong><br />\nYou can customize your WordPress chatbot&#8217;s tone, avatar, chat window, and message lengths to match your website&#8217;s theme and personality. Plus, you can add a chatbot anywhere on your WordPress website.</p>\n<p><strong>20. Teams’ Availability</strong><br />\nOptimize chat routing and support flow by creating effective time slots for your teams, ensuring efficient and timely responses.</p>\n<p><strong>21. User Insights</strong><br />\nWith detailed visitor profiles, you can attain a deeper understanding of users, providing valuable insights like open rates, leads generated, response rates, etc.</p>\n<p><strong>22. Leads on Email</strong><br />\nAcquire valuable leads and receive notifications via email, ensuring prompt follow-up and engagement with potential customers.</p>\n<p><strong>23. Typing Indicator</strong><br />\nGain insights into customer intent by monitoring real-time typing indicators, improving the overall chatbot interaction and response accuracy.</p>\n<p><strong>24. Trigger Timer</strong><br />\nSet trigger times for website chatbot responses, aligning chatbot interactions with optimal user engagement periods for enhanced effectiveness.</p>\n<p>The list of features goes on. You can <a href=\"https://botpenguin.com/chatbot-features\" rel=\"nofollow ugc\">click here</a> to learn more about our WordPress Chatbot’s features.</p>\n<h3>Create Your WordPress Chatbot in 2 Minutes</h3>\n<p>Follow these steps for a code-free WordPress chatbot integration and elevate your website experience.</p>\n<p><strong>1. Craft Your Bot &amp; Design Flows:</strong> Personalize your chatbot and design engaging flows with templates to suit your business needs.</p>\n<p><strong>2. Download WordPress Plugin:</strong> Access and download the latest WordPress chatbot plugin directly from your dashboard.</p>\n<p><strong>3. Integrate Smoothly:</strong> To integrate with WordPress seamlessly, activate your chatbot by pasting the API key from the BotPenguin Menu.</p>\n<p><strong>4. Test Chatbot Impact:</strong> Head to the BotPenguin dashboard, launch your chatbot, integrate with ChatGPT, and experience AI-driven interactions in action. Optimize for success!</p>\n<p><strong>Install the WordPress Chatbot Plugin for Seamless Integration and Smarter Conversations on Your Website.</strong></p>\n<p><a href=\"https://downloads.wordpress.org/plugin/botpenguinbot.zip\" rel=\"nofollow ugc\">Download Now</a></p>\n<h3>Web and Social Media Platforms</h3>\n<p>Want to grow beyond WordPress?BotPenguin has you covered:</p>\n<p><strong>WordPress Websites:</strong> Be it WordPress, Shopify, Squarespace, or your own custom website, equip it with BotPenguin’s ChatGPT chatbot. Automate interactions and bring your website to life with 24*7 chatbots that generate leads and handle queries.</p>\n<p><strong>WooCommerce Chatbot:</strong> Integrate our WordPress Chatbot with WooCommerce to keep customers informed with order updates, handle return/refund/exchange notifications, showcase product catalogs, track orders, integrate payment gateways, and leverage ChatGPT for intelligent conversations.</p>\n<p><strong>WhatsApp:</strong> Expand your reach and engage with users using WhatsApp marketing with BotPenguin&#8217;s AI chatbot. Send notifications, accept payments, track orders, organize broadcasts &amp; drips, enable bookings, and more.</p>\n<p><strong>Facebook:</strong> Enhance your Facebook presence with BotPenguin&#8217;s AI chatbots that can auto-reply to comments &amp; DMs, automate marketing broadcasts &amp; drip campaigns, answer FAQs with generative AI, and generate leads.</p>\n<p><strong>Telegram:</strong> Connect with your audience on Telegram using BotPenguin&#8217;s chatbot, providing instant assistance with FAQs, appointment bookings, personalized content suggestions, and broadcast &amp; drip campaigns.</p>\n<p><strong>Instagram:</strong> Make your Instagram profile interactive and engaging by integrating BotPenguin&#8217;s chatbot to answer FAQs, reply to comments, send broadcasts, organize drip campaigns, and show product catalogs.</p>\n<p><strong>Microsoft Teams:</strong> Boost productivity and streamline collaboration in Microsoft Teams with BotPenguin. Your Teams chatbot with generative AI can automate tasks, give permissions, share resources, create cards to assign tasks, manage workflows, and enhance team communication.</p>\n<p><strong>Other CMS:</strong> BotPenguin seamlessly integrates with other CMS, such as Shopify, Squarespace, Wix, and more. Elevate your digital presence across the spectrum of content management systems.</p>\n<p>To make things better, all these AI chatbots integrate with ChatGPT models to provide a truly conversational experience to your customers across channels.</p>\n<h3>Key Native Integrations</h3>\n<p><strong>Customer Relationship Management:</strong> HubSpot, GoHighLevel, Zoho, Salesforce, and more! Seamlessly integrate your WordPress ChatGPT chatbot with leading CRMs for efficient data management and streamlined customer interactions.</p>\n<p><strong>Appointment Booking:</strong> Utilize Google Calendar, Calendly, and Simplybook to streamline appointment scheduling. Integrate these booking platforms with your WordPress AI chatbots for automated booking and efficient calendar management.</p>\n<p><strong>Marketing Automation:</strong> Grove, HelpDocs, ZingTree, and GetResponse—integrate seamlessly with your WordPress Chatbot driven by ChatGPT for powerful marketing automation. Enhance campaigns, engage users, and track results effortlessly.</p>\n<p><strong>Google Integration:</strong> Connect BotPenguin Chatbot to enhance the Google Sheets experience! No more manual imports. Connect your favorite Bot with Google Sheets to auto-import data from multiple channels.</p>\n<p><strong>ChatGPT:</strong> Leverage ChatGPT integration for advanced conversational AI. Combine BotPenguin with ChatGPT for enhanced natural language understanding and intelligent chatbot responses—transforming user interactions.</p>\n<p><strong>Pabbly &amp; Zapier:</strong> Empower your business with Pabbly and Zapier integrations. Seamlessly connect BotPenguin to 1000+ apps for efficient data flow, automation, and streamlined processes—maximize productivity effortlessly.</p>\n<p>And many more (60+ Integrations). On top of that, you can integrate with any third-party application of your choice and add custom LLM models to enhance the generative AI powers of your WordPress chatbots.</p>\n<h3>What Our Users Say</h3>\n<p>I was thoroughly impressed by the effortless configuration process of the chatbot. The platform offers a myriad of customization options, empowering us to craft a sophisticated chatbot, leverage templates, and delve into various enriching add-ons. – Vedant</p>\n<p>BotPenguin highly recommended. Great product with really great tech service. Used across our apps. B2B customer service and product feature available.  – Twana D.</p>\n<p>We have empowered many successful businesses across industries with our generative AI chatbots, rendering features like WhatsApp marketing automation, eCommerce integrations, automated lead capture, AI-powered customer support, custom ChatGPT integration, &amp; more.</p>\n<p>Our top clients include <strong>EcoPooling, Store My Goods, ModWash, Cyboard, MedoPlus, Chathoot, Amazing India, Intervue, Enventure, TBWAdvertising,</strong> and more.</p>\n<h3>Why Choose Us</h3>\n<ul>\n<li>Drag &amp; Drop Builder – Build, design, and deploy chatbot in under 10 minutes with its drag-and-drop builder and exceptional UI.</li>\n<li>FREE Forever plan allows you to use and test it without cost and worries.</li>\n<li>Exceptional UX – It provides an excellent user interface experience through tip tools, help texts, tutorials, and guides.</li>\n<li>Multiple Platforms – Integrates with Websites, <a href=\"https://botpenguin.com/platform/chatbot-for-facebook\" rel=\"nofollow ugc\">Facebook Messenger</a>, <a href=\"https://botpenguin.com/platform/chatbot-for-whatsapp\" rel=\"nofollow ugc\">WhatsApp</a>, Telegram, Microsoft Teams, and Instagram Promotional Pages.</li>\n<li>Multi-Lingual</li>\n<li>Ready-to-Use Templates – Choose more than 40+ available chatbot templates that suit your business use case and ease up the way of having your own WordPress chatbot.</li>\n<li>Live Chat Plugin – Interact with your customers online in real time for seamless communication support.</li>\n<li>Chat Widgets – Live Chat Widget can be connected to any promotional pages or ads to capture visitors’ attention and route them to Chatbots. </li>\n<li>Exceptional Customer Support – In case of any issue, we provide multiple-channel support via email, live chat, or WhatsApp messaging.</li>\n<li>Expert Technical Support – Free support to guide you on creating, customizing, and using BotPenguin for your business.</li>\n</ul>\n<h3>Chatbot Agency &amp; Partnership Program Options</h3>\n<p>Using our WordPress ChatGPT chatbots is a good deal. What’s even better? You can easily become an AI chatbot reseller with BotPenguin. If it piques your curiosity, dive into a world of BotPenguin’s partner possibilities!</p>\n<p><strong>Affiliate Partner Program:</strong> Join our Affiliate Partner Program and hop on the success train with zero fees! Earn a cool 20% in commissions, plus give your referrals a sweet 10% discount. No limits on what you can earn, a generous 110-day cookie period, and a handy dashboard to keep it all hassle-free.</p>\n<p><strong>Implementation Partnership Program:</strong> Embark on a partnership journey without breaking the bank! Our Implementation Partnership Program comes with unlimited commissions. You get your own Partner Panel for smooth client management, customizable plans, tech experts on speed dial, and top-notch onboarding.</p>\n<p><strong>White Label Chatbot Partner Program:</strong> Ever dreamt of having your own chatbot business? Well, dream no more! Our White Label Chatbot Partner Program lets you fully brand your business – your domain, your logo, your brand! With custom pricing, bulk message packs, and seamless subscriber management.</p>\n<h3>Integration</h3>\n<p>Our plugin serves as a bridge to connect your WordPress website with BotPenguin&#8217;s chatbot services. Utilizing CDN JS files, we fetch the user interface from BotPenguin to integrate the chatbot seamlessly into your site. Activating the chatbot&#8217;s services is achieved by inputting the secret key provided by BotPenguin.<br />\nPlease note that all chatbot services provided through our plugin are exclusively owned and operated by BotPenguin. We are the sole owners of this network and do not rely on any third-party service providers.<br />\nFor more information on privacy and usage policies, please refer to BotPenguin&#8217;s privacy policy and terms of use.<br />\nWe value transparency and encourage users to review these policies for a comprehensive understanding of how their data is handled and the terms governing the use of BotPenguin&#8217;s services.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/botpenguinbot.1.5.1.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-1.png?rev=3073649",
            "caption": "BotPenguin Dashboard"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-2.png?rev=3073649",
            "caption": "Create Your Chatflow"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-3.png?rev=3073649",
            "caption": "Train Your AI Chatbot"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-4.png?rev=3073649",
            "caption": "Configure Fallbacks"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-5.png?rev=3073649",
            "caption": "Install Your Chatbot"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-6.png?rev=3073649",
            "caption": "Copy the Chatbot Script Code"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-7.png?rev=3073649",
            "caption": "Paste the Script Code in BotPenguin WordPress Plugin"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-8.png?rev=3073649",
            "caption": "WordPress Website Chatbot"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-9.png?rev=3073649",
            "caption": "Select the ChatGPT Model for Integration"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-10.png?rev=3073649",
            "caption": "Add Agents to Your Team"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-11.png?rev=3073649",
            "caption": "Call Your Contacts from the App"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-12.png?rev=3073649",
            "caption": "Assign Roles &amp; Permissions To Your Agents"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-13.png?rev=3073649",
            "caption": "Add Tags To Orders &amp; Contacts"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-14.png?rev=3073649",
            "caption": "Customize Your Bot’s Looks"
        },
        {
            "src": "https://ps.w.org/botpenguinbot/assets/screenshot-15.png?rev=3073649",
            "caption": "Integrate With 60+ Apps"
        }
    ],
    "tags": {
        "ai": "AI",
        "chatbot": "chatbot",
        "chatbotmaker": "Chatbotmaker",
        "chatgpt": "ChatGPT",
        "live-chat": "live chat"
    },
    "stable_tag": "1.5.1",
    "versions": {
        "1.2": "https://downloads.wordpress.org/plugin/botpenguinbot.1.2.zip",
        "1.3": "https://downloads.wordpress.org/plugin/botpenguinbot.1.3.zip",
        "1.4": "https://downloads.wordpress.org/plugin/botpenguinbot.1.4.zip",
        "1.5": "https://downloads.wordpress.org/plugin/botpenguinbot.1.5.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/botpenguinbot.1.5.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/botpenguinbot.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://botpenguin.com/",
    "banners": {
        "low": "https://ps.w.org/botpenguinbot/assets/banner-772x250.png?rev=2901599",
        "high": "https://ps.w.org/botpenguinbot/assets/banner-1544x500.png?rev=2901137"
    },
    "icons": {
        "1x": "https://ps.w.org/botpenguinbot/assets/icon-128x128.png?rev=2901137",
        "2x": "https://ps.w.org/botpenguinbot/assets/icon-256x256.png?rev=2901599"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}