{
    "name": "Broken Link Checker",
    "slug": "broken-link-checker",
    "version": "2.3.0",
    "author": "<a href=\"https://wpmudev.com/\">WPMU DEV</a>",
    "author_profile": "https://profiles.wordpress.org/wpmudev/",
    "contributors": {
        "managewp": {
            "profile": "https://profiles.wordpress.org/managewp/",
            "avatar": "https://secure.gravatar.com/avatar/c14a92e0aea4a99a28ebc0a86dc9a060?s=96&d=monsterid&r=g",
            "display_name": "ManageWP"
        },
        "wpmudev": {
            "profile": "https://profiles.wordpress.org/wpmudev/",
            "avatar": "https://secure.gravatar.com/avatar/77e8c4a1ea73dce293f2bacbdd2f915d?s=96&d=monsterid&r=g",
            "display_name": "WPMU DEV - Your All-in-One WordPress Platform"
        }
    },
    "requires": "5.2",
    "tested": "6.6.1",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 76,
    "ratings": {
        "5": 338,
        "4": 43,
        "3": 20,
        "2": 38,
        "1": 118
    },
    "num_ratings": 557,
    "support_url": "https://wordpress.org/support/plugin/broken-link-checker/",
    "support_threads": 21,
    "support_threads_resolved": 16,
    "active_installs": 600000,
    "downloaded": 17978014,
    "last_updated": "2024-07-17 05:02:00",
    "added": "2007-10-08",
    "homepage": "https://wordpress.org/plugins/broken-link-checker/",
    "sections": {
        "description": "<p>The fastest and most accurate broken link checker for WordPress. Join over 700K people who use Broken Link Checker to monitor and detect broken links 20x faster than other plugins, with pinpoint accuracy. No page limits, no ads, no upsells. Enjoy effortless, unlimited, and automated broken link checking from the get-go.</p>\n<p><strong>Broken links can kill your SEO, user experience, and site health… Broken Link Checker helps you find and resolve them faster than similar plugins.</strong></p>\n<p>Finding and staying on top of broken links can feel like a never-ending battle, especially if you&#8217;re dealing with large sites or managing multiple.</p>\n<p>Using a link checking tool can save you from having to find links manually, or avoid the frustration of discovering missed broken links months later (oops!).</p>\n<p>But not every broken link checker was created equal…</p>\n<p>You need a tool that not only automates the process, but also detects broken links quickly, thoroughly, and accurately.</p>\n<p><strong>That’s where Broken Link Checker comes in…</strong></p>\n<p>BLC doesn’t <em>just</em> scan your sites faster than other solutions, it scans deeply and frequently to ensure no broken links are missed.</p>\n<p>Scan every inch of your sites, including external and internal links within your posts, pages, comments, blogroll, even custom fields, helping to ensure your site&#8217;s SEO and user experience are not compromised in any way. And if that isn&#8217;t enough, you’ll also receive detection reports via email so you can quickly take corrective action.</p>\n<p><strong>Choose from two different link checking engines:</strong></p>\n<p>Broken Link Checker gives you the option of using two unique engines based on your needs. You can also easily switch between local and cloud broken link checking <strong>without losing your saved settings.</strong></p>\n<p><strong>1.Cloud-based link checker</strong></p>\n<p>This engine is 100% cloud-based and built directly on WPMU DEV’s servers (the owners of BLC), harnessing their powerful API.</p>\n<p><em>Note that our cloud-based engine is still in beta. We’re working around the clock to make this new version even better. As mentioned, if it’s missing a feature you need, simply switch back to the local version.</em></p>\n<p>This cloud-based engine gives you several advantages, including:</p>\n<ul>\n<li>\n<p><strong>20x more speed</strong> &#8211; Being cloud-based eliminates any dependence on the performance of your server, giving you a massive speed increase.</p>\n</li>\n<li>\n<p><strong>Unlimited page &amp; URL checker</strong> &#8211; Enjoy limitless scanning for pages and URLs, ideal if you’re working with multiple sites or large sites with a lot of content.</p>\n</li>\n<li>\n<p><strong>Edit/unlink broken links (coming soon)</strong> &#8211; Effortlessly resolve all detected links right from your BLC dashboard.</p>\n</li>\n<li>\n<p><strong>Crawl it all</strong> &#8211; Standard pages and posts, menus, category pages&#8230; BLC ensures no URL is missed.</p>\n</li>\n<li>\n<p><strong>Any site, any size</strong> &#8211; Unlike plugin-based solutions, BLC is server-independent, making it capable of checking sites of any size and type.</p>\n</li>\n<li>\n<p><strong>Fewer errors</strong> &#8211; BLC’s cloud-based nature eliminates the occurrence of WP Errors, Fatal Errors, DB Errors, and PHP Errors often present with other plugins.</p>\n</li>\n<li>\n<p><strong>Less chance of being blocked</strong> &#8211; The cloud-based engine doesn&#8217;t use your site&#8217;s IP address to check external URLs, meaning you’re less likely to be blocked due to frequent requests.</p>\n</li>\n</ul>\n<p><strong>Plus, manage broken links for unlimited sites from one place</strong></p>\n<p>Since the cloud-based engine connects you to WPMU DEV, you have the luxury of free access to their suite of powerful web development tools &#8211; including a convenient site management interface where you can manage broken links on multiple sites, rather than just one.</p>\n<p><strong>2. Local link checker</strong></p>\n<p>The main difference of our local link checker compared to the cloud engine, is that it uses your site/server resources to fetch and analyze site content and check the status of links.</p>\n<p>It also uses your site&#8217;s IP address, which as mentioned above, increases your risk of being blocked by some external links, resulting in incomplete or inaccurate scan results.</p>\n<p><strong>Here are the standout features of the local link checking engine:</strong></p>\n<ul>\n<li>Monitors external links and internal links in your posts, pages, comments, the blogroll, and custom fields (optional).</li>\n<li>Detects broken links and redirects.</li>\n<li>Receive notifications via your dashboard or email.</li>\n<li>Make broken links display differently in posts (optional).</li>\n<li>Prevent search engines from following broken links (optional).</li>\n<li>Search and filter links by URL, anchor text and more.</li>\n<li>Edit links directly from your interface, without manually updating each post.</li>\n</ul>\n<p>Whether you choose local or cloud-based, BLC’s user-friendly dashboard and powerful features makes staying on top of broken links as easy and automated as possible.</p>\n<h3>The best scanning &amp; detection features on one dashboard:</h3>\n<p><strong>Run manual scans or set an automatic schedule</strong></p>\n<p>Enjoy the flexibility to run scans manually, or schedule automatic daily, weekly, and monthly scans to suit your preference and the sites you manage.</p>\n<p><strong>Edit or unlink broken links (coming soon to cloud-based)</strong></p>\n<p>After BLC detects broken links, it gives you the option to edit or unlink them with a click from your main dashboard. It couldn’t be easier or faster.</p>\n<p><strong>Detailed broken link reports</strong></p>\n<p>After each scan you get a comprehensive summary of any broken links detected, along with the status of the links so you can instantly know how to resolve the issue.</p>\n<p><strong>Detection notifications via email</strong></p>\n<p>Stay on top of your link health and fix issues as fast as possible with broken link reports sent straight to an email address of your choice.</p>\n<p><strong>Advanced search filtering</strong></p>\n<p>BLC’s search and filtering tools make it faster and easier to find specific URLs or filter by status or error type.</p>\n<p><strong>Export report lists for further analysis</strong></p>\n<p>Export your broken link lists as a CSV file for greater analysis inside of Google Sheets, Microsoft Excel, and other spreadsheet/data software.</p>\n<h3>HELP KEEP BLC SECURE</h3>\n<p>We take plugin security incredibly seriously; if you have a bug or vulnerability to report, you can do so through the Patchstack Vulnerability Disclosure Program. It’s fast, easy, and you will be notified when the issue is fixed. <a href=\"https://patchstack.com/database/vdp/broken-link-checker\" rel=\"nofollow ugc\">Report a vulnerability</a>.</p>\n<h3>ABOUT US</h3>\n<p>The developers of BLC, WPMU DEV is an all-in-one WordPress platform that has helped millions of web developers worldwide run and grow their businesses for over 15 years.</p>\n<p>Our WordPress offerings include site management tools, dedicated hosting, reseller domains, and 12 popular WP plugins totalling more than 80 million downloads. Check out our website: <a href=\"https://wpmudev.com/\" rel=\"nofollow ugc\">https://wpmudev.com/</a></p>\n<p>Oh, and one more thing… we hope you enjoy our free offerings as much as we’ve loved making them for you!</p>\n",
        "changelog": "<h4>2.3.0</h4>\n<ul>\n<li>New: Connect to the Cloud Engine API directly without installing the Dashboard plugin.</li>\n<li>Fix: PHP8 Deprecation message.</li>\n<li>Fix: Recipient confirmation link from scheduled scan email not working.</li>\n<li>Fix: User role conflict with Solidwp</li>\n</ul>\n<h4>2.2.4</h4>\n<ul>\n<li>Enhance: Code stability improvements.</li>\n</ul>\n<h4>2.2.3</h4>\n<ul>\n<li>Enhance: Optimize local db tables.</li>\n<li>Fix: Rare but possible Fatal error when unlinking a link.</li>\n<li>Fix: Removed deprecated Defender hooks.</li>\n</ul>\n<h4>2.2.2</h4>\n<ul>\n<li>Fix: Exclusions list spacing in Local settings.</li>\n<li>Fix: Database error Illegal mix of collations.</li>\n<li>Enhance: Use WP_HTML_Tag_Processor and DOMDocument instead of regex in Cloud Edit/Unlink.</li>\n</ul>\n<h4>2.2.1</h4>\n<ul>\n<li>Fix: Youtube playlist show as not found (Local engine).</li>\n<li>Fix: In Scheduled scan, users can be added twice in list.</li>\n<li>Fix: PHP8 Deprecation messages.</li>\n<li>Fix: Callback missing from Local cron jobs.</li>\n<li>Enhance: Added BLC bot UA in Defender&#8217;s bot allowlist.</li>\n</ul>\n<h4>2.2.0</h4>\n<ul>\n<li>New: Edit and Unlink broken links in Cloud Engine.</li>\n<li>Fix: Editor access blocked in Local Engine.</li>\n<li>Enhance: PHP 8.1 and 8.2 compatibility.</li>\n</ul>\n<h4>2.1.0</h4>\n<ul>\n<li>Improved admin menus, so they are separated to Cloud and Local Engine.</li>\n<li>Fix multiple emails issue.</li>\n<li>Fix Dashboard fonts.</li>\n<li>Fix insisting line-through text decoration on links in front end.</li>\n</ul>\n<h4>2.0.0</h4>\n<ul>\n<li>Version 2 release</li>\n<li>Added connection to free Hub features for cloud based Broken Link Checker.</li>\n</ul>\n<h4>1.11.21</h4>\n<ul>\n<li>Fix strict comparison causing db queries</li>\n</ul>\n<h4>1.11.20</h4>\n<ul>\n<li>Fix XSS vulnerability</li>\n</ul>\n<h4>1.11.19</h4>\n<ul>\n<li>Enhance compatibility with WordPress 6.1</li>\n<li>Fix deprecated sanitization filter FILTER_SANITIZE_STRING</li>\n</ul>\n<h4>1.11.18</h4>\n<ul>\n<li>Updated UA string</li>\n</ul>\n<h4>1.11.16</h4>\n<ul>\n<li>Enhance compatibility with PHP 8</li>\n<li>Enhance compatibility with WordPress 5.8</li>\n<li>Remove donation links and adds</li>\n</ul>\n<h4>1.11.15</h4>\n<ul>\n<li>Added integration with WP External Links plugin</li>\n</ul>\n<h4>1.11.14</h4>\n<ul>\n<li>Added compatibility for WP 5.5.</li>\n</ul>\n<h4>1.11.13</h4>\n<ul>\n<li>Added filter for disabling email notifications.</li>\n<li>Added filter to use GET requests. (Thanks to <a href=\"https://github.com/Pathduck\" rel=\"nofollow ugc\">Stian Lund</a>)</li>\n<li>Added option to disable last updated time on post types.</li>\n<li>Added option to check post excerpts.</li>\n<li>Added a confirmation box when unlinking.</li>\n<li>Added basic multisite support.</li>\n<li>Added proper error messages on YouTube video errors.</li>\n<li>Fixed bulk recheck option.</li>\n<li>Fixed minor database errors.</li>\n<li>Improved performance.</li>\n<li>Removed default YouTube API key.</li>\n<li>Removed usage of depricated WP Snoopy.</li>\n</ul>\n<h4>1.11.12</h4>\n<ul>\n<li>Added an interface to use personal YouTube API Key</li>\n<li>Fixed database errors on installation for some hosts.</li>\n<li>Fixed link editor not working with elementor.</li>\n<li>Fixed custom field key with multiple keys not rendering.</li>\n<li>Fixed compatibility issues with Business Directory plugin.</li>\n<li>Fixed bulk actions not working properly for some actions.</li>\n<li>Updated the owner on repository.</li>\n</ul>\n<h4>1.11.11</h4>\n<ul>\n<li>Fixed SQL errors caused on some hosts.</li>\n<li>Fixed search filters &amp; pagination.</li>\n<li>Fixed link table design in mobile devices.</li>\n<li>Fixed deprecated functions on PHP 7.4</li>\n<li>Fixed filter_var deprecated notices.</li>\n<li>Improved code with WPCS.</li>\n<li>Added a new API key for the YouTube API.</li>\n</ul>\n<h4>1.11.10</h4>\n<ul>\n<li>Fixed create_function deprecated notices.</li>\n<li>Fixed missing license information.</li>\n<li>Fixed table prefix on delete post action (Thanks to <a href=\"https://github.com/gboudreau\" rel=\"nofollow ugc\">Guillaume Boudreau</a>)</li>\n<li>Merges cron schedules into 1 hook (Thanks to <a href=\"https://github.com/mundschenk-at\" rel=\"nofollow ugc\">Der Mundschenk &amp; Compagnie</a>)</li>\n<li>Add escaping to search params.</li>\n<li>Tested up to WordPress 5.3</li>\n<li>Updated laguage files</li>\n</ul>\n<h4>1.11.9</h4>\n<ul>\n<li>Fixed Reflected XSS (Thanks to <a href=\"https://github.com/sbaresearch/advisories/tree/public/2019/SBA-ADV-20190913-02_WordPress_Plugin_Broken_Link_Checker\" rel=\"nofollow ugc\">Tobias Fink</a> for the report)</li>\n<li>Fixed param escaping to avoid possible XSS attack.</li>\n</ul>\n<h4>1.11.8</h4>\n<ul>\n<li>Various fixes.</li>\n</ul>\n<h4>1.11.7</h4>\n<ul>\n<li>Fixed a PHP 7.2 compatibility issue</li>\n</ul>\n<h4>1.11.6</h4>\n<ul>\n<li>Fixed link check not saving</li>\n</ul>\n<h4>1.11.5</h4>\n<ul>\n<li>Fixed a PHP 5.2 compatibility issue</li>\n</ul>\n<h4>1.11.4</h4>\n<ul>\n<li>Fixed a few more PHP 7.x/5.6 compatibility issues</li>\n</ul>\n<h4>1.11.3</h4>\n<ul>\n<li>Updated plugin information</li>\n</ul>\n<h4>1.11.2</h4>\n<ul>\n<li>Fixed a compatibility issue</li>\n</ul>\n<h4>1.11.1</h4>\n<ul>\n<li>Major performance improvement. Database queries reduced up to 10x in some cases.</li>\n<li>Feel free to contribute to the plugin on <a href=\"https://github.com/wpmudev/broken-link-checker\" rel=\"nofollow ugc\">GitHub</a>. Pull requests welcome!</li>\n</ul>\n<h4>1.10.11</h4>\n<ul>\n<li>Fixed the issue with HTTPS (Thanks to <a href=\"https://wordpress.org/support/profile/gmcinnes\" rel=\"ugc\">gmcinnes</a>)</li>\n<li>Broken Link Checker is now on <a href=\"https://github.com/wpmudev/broken-link-checker\" rel=\"nofollow ugc\">GitHub</a>. Pull Requests welcome.</li>\n</ul>\n<h4>1.10.10</h4>\n<ul>\n<li>New plugin image that was long overdue.</li>\n</ul>\n<h4>1.10.9</h4>\n<ul>\n<li>Fixed a security vulnerability where part of the log data visibile in the &#8220;Details&#8221; view was not properly sanitized.</li>\n<li>Updated French translation.</li>\n<li>Updated Portuguese translation.</li>\n<li>Removed an advertising banner.</li>\n</ul>\n<h4>1.10.8</h4>\n<ul>\n<li>Added a Swedish translation.</li>\n<li>Fixed an encoding-related bug that caused some translated text on the &#8220;Broken Links&#8221; page to show up as gibberish.</li>\n<li>Fixed a potential security vulnerability where the &#8220;Final URL&#8221; field was not sanitized.</li>\n<li>Fixed link text being truncated to 250 characters.</li>\n<li>Fixed the &#8220;Edit URL&#8221; function updating the link text even when the user left that field unchanged.</li>\n<li>Tested up to 4.2.1.</li>\n</ul>\n<h4>1.10.7</h4>\n<ul>\n<li>Tested up to WordPress 4.2.</li>\n</ul>\n<h4>1.10.6</h4>\n<ul>\n<li>Fixed a serious CSRF/XSS vulnerability.</li>\n<li>Switched to YouTube API v3. The old API version will be shut down on April 20, so the plugin needs to be updated to continue checking links to YouTube videos.</li>\n<li>Fixed long URLs overflowing into adjacent table columns.</li>\n<li>Fixed a few minor PHP strict-mode notices.</li>\n<li>Added database character set to the &#8220;Show debug info&#8221; table.</li>\n</ul>\n<h4>1.10.5</h4>\n<ul>\n<li>Security: Fixed an XSS vulnerability that could be used by Editors and Administrators to inject arbitrary HTML/JS code in the &#8220;Tools -&gt; Broken Links&#8221; page.</li>\n<li>Other minor security fixes.</li>\n<li>Tested on WordPress 4.2 beta.</li>\n</ul>\n<h4>1.10.4</h4>\n<ul>\n<li>Tested on WordPress 4.1.</li>\n<li>Fixed a &#8220;Use of undefined constant ENT_HTML401&#8221; notice showing up on sites running PHP 5.3 or older.</li>\n<li>Fixed a double-escaping bug that could cause some link URLs to be displayed incorrectly.</li>\n<li>Updated French translation.</li>\n<li>Updated Dutch translation.</li>\n</ul>\n<h4>1.10.3</h4>\n<ul>\n<li>Security: Filter link URLs before displaying them on the &#8220;Broken Links&#8221; page.</li>\n<li>Security: Prevent Editors and Administrators who don&#8217;t have the &#8220;unfiltered_html&#8221; capability from creating &#8220;javascript:&#8221; URLs by editing existing links.</li>\n</ul>\n<h4>1.10.2</h4>\n<ul>\n<li>Fixed an XSS vulnerability on the link checker settings page.</li>\n<li>Fixed old YouTube embed code parsing &#8211; now it should pick up self-closing embed tags without an <code>&lt;object&gt;</code> wrapper.</li>\n<li>Updated German translation.</li>\n<li>Updated Simplified Chinese translation.</li>\n<li>Link actions will now wrap properly on small screens.</li>\n</ul>\n<h4>1.10.1</h4>\n<ul>\n<li>Fixed a database versioning issue that would cause multiple errors when upgrading from 1.9.5 to 1.10.</li>\n</ul>\n<h4>1.10</h4>\n<ul>\n<li>Added a way to hide individual link actions like &#8220;Dismiss&#8221; and &#8220;Unlink&#8221;.</li>\n<li>Added a &#8220;Fix redirect&#8221; link action. It replaces a redirect with a direct link. It is hidden by default and can be enabled through the settings page.</li>\n<li>Added a &#8220;Recheck&#8221; link action. Unlike the bulk action by the same name, it checks a link immediately and displays the results without having to refresh the page.</li>\n<li>Added a &#8220;Dismiss&#8221; bulk action.</li>\n<li>Added a note below the &#8220;link tweaks&#8221; settings explaining that they only apply to the contents of posts (and pages, and CPTs), not comments or custom fields.</li>\n<li>Made the &#8220;Redirect URL&#8221; column sortable.</li>\n<li>Added a &#8220;Details&#8221; link to the &#8220;Status&#8221; column.</li>\n<li>Added a &#8220;Warnings&#8221; section to Tools -&gt; Broken Links. It shows problems that might be temporary or false positives. Warnings can be disabled through the settings page.</li>\n<li>Fixed a conflict with plugins that use PHP sessions.</li>\n<li>Fixed the &#8220;post statuses&#8221; option. Now disabling a post status (e.g. &#8220;Draft&#8221;) should take effect immediately.</li>\n<li>Fixed the Mediafire link checker.</li>\n<li>Fixed the text in the &#8220;Status&#8221; column being slightly offset vertically when compared to other columns.</li>\n<li>Fixed search box position in WP 4.1-alpha.</li>\n<li>Added a few workarounds for situations where a custom post type is removed without first removing the posts.</li>\n<li>Removed the screen icon. WordPress has deprecated it.</li>\n<li>Other minor fixes.</li>\n</ul>\n<h4>1.9.5</h4>\n<ul>\n<li>Fixed missing YouTube videos not being detected when the video URL starts with https instead of http.</li>\n<li>Enabled the YouTube video checker by default on new installations.</li>\n<li>Made the &#8220;dismiss link&#8221; option more permanent. Instead of restoring a dismissed link if the redirect URL changes even a little bit, the plugin will now ignore query string changes. This should fix many of the reports about dismissed links reappearing for no apparent reason.</li>\n<li>Updated Portuguese, German and Dutch translations.</li>\n<li>Other minor fixes.</li>\n</ul>\n<h4>1.9.4.2</h4>\n<ul>\n<li>Updated Dutch translation again.</li>\n<li>Removed Bulgarian translation because it was poor quality and outdated.</li>\n</ul>\n<h4>1.9.4.1</h4>\n<ul>\n<li>Updated Dutch translation.</li>\n<li>Updated POT file.</li>\n</ul>\n<h4>1.9.4</h4>\n<ul>\n<li>Tested on WP 4.0 beta.</li>\n<li>Added a Serbo-Croatian translation.</li>\n<li>Added a Slovakian translation.</li>\n<li>Replaced the old Japanese translation with a new and more up-to-date version from a different translator.</li>\n<li>Updated Dutch, German, Polish, Hebrew and other translations.</li>\n<li>Fixed a notice about undefined index &#8220;status_text&#8221;.</li>\n<li>Fixed a &#8220;doing it wrong&#8221; warning related to screen options.</li>\n<li>Fixed spurious false positives on links copied from Word or similar editors.</li>\n<li>Fixed view switcher appearance in WP 4.0.</li>\n<li>Replaced the deprecated like_esc() function with $wpdb-&gt;esc_like() where available.</li>\n<li>Fixed plaintext URLs not being detected if they&#8217;re the very first thing in a post.</li>\n<li>Fixed a bug that caused quotes and other special characters in the broken link CSS and removed link CSS fields to be auto-escaped with a slash, potentially breaking the CSS.</li>\n<li>Fixed a bug that caused the &#8220;check custom fields&#8221; feature work inconsistently or not at all on custom post types.</li>\n<li>Fixed duplicate custom field links showing up when the user creates a revision with different field values.</li>\n<li>Fixed a specific type of false positive where some links would get flagged as &#8220;Unknown Error&#8221; and the log message would be &#8220;Empty reply from server&#8221;.</li>\n<li>Fixed a bug where only the first enabled post type would be resynchronized during plugin activation.</li>\n<li>Added more logging.</li>\n<li>Removed Megavideo and MegaUpload modules. These sites no longer exist.</li>\n</ul>\n<h4>1.9.3</h4>\n<ul>\n<li>Tested on WP 3.8.1 and WP 3.9-beta2.</li>\n<li>Added an option to sort links by link text. May produce unexpected results for links that have multiple copies with different anchor text.</li>\n<li>Added a Vietnamese translation.</li>\n<li>Added file-based logging for debugging purposes. Logging can be enabled in the &#8220;Advanced&#8221; section of the plugin settings page.</li>\n<li>Added a &#8220;Auto-Submitted: auto-generated&#8221; header to notification emails sent by the plugin. This should prevent &#8220;out-of-office&#8221; auto-responders and similar software from responding to these emails.</li>\n<li>Added domain-based rate limiting to the HTTP checker module.</li>\n<li>Throttled background parsing by about 40% to reduce overall resource usage.</li>\n<li>Fixed (probably) a long-standing bug related to encoding international characters in link URLs.</li>\n<li>Fixed a typo in the Polish translation.</li>\n<li>Made the error message that&#8217;s displayed when trying to network-activate the plugin more useful.</li>\n</ul>\n<h4>1.9.2</h4>\n<ul>\n<li>Fixed several UI/layout issues related to the new WP 3.8 admin style.</li>\n<li>Fixed HTML entity codes showing up in confirmation messages in when running a localized version of WP (only affects some languages).</li>\n<li>Fixed the &#8220;dismiss this notice&#8221; link URL not being HTML-escaped.</li>\n<li>Fixed a couple of cross-site scripting vulnerabilities related to the sort direction query argument not being properly validated and the bulk action form not escaping the current URL.</li>\n<li>Updated Hebrew translation.</li>\n<li>Updated French translation.</li>\n<li>When you dismiss a link, the dismissed link counter is now updated right away instead of on page reload.</li>\n</ul>\n<h4>1.9.1</h4>\n<ul>\n<li>Updated Dutch, German, Chinese and Portuguese translations.</li>\n<li>Fixed suggestions not working on sites that force HTTPS in the WordPress admin.</li>\n<li>Tested on WordPress 3.7.</li>\n</ul>\n<h4>1.9</h4>\n<ul>\n<li>Added the ability to edit link text from inside the plugin. This features is only available for certain types of links.</li>\n<li>Added a &#8220;suggestions&#8221; feature. When you go to edit a broken link, the plugin will now suggest replacing it with an archived page from the Wayback Machine (if available). You can disable suggestions in Settings -&gt; Link Checker -&gt; General.</li>\n<li>Added a Hebrew translation.</li>\n<li>Added support for HTML code in custom fields. To make the plugin treat a field as HTML, prefix its name with &#8220;html:&#8221; in BLC settings. For example, if you have a custom field named &#8220;foo&#8221; that contains HTML, enter it as &#8220;html:foo&#8221;.</li>\n<li>Fixed: The &#8220;Status&#8221; column is now properly updated when editing a link.</li>\n<li>Fixed: Visual feedback when a link is successfully edited. Basically, it briefly changes the row background to green.</li>\n<li>Fixed: Email notifications will only include the &#8220;see all broken links here&#8221; link if the recipient can actually access that link.</li>\n<li>Fixed some UI labels not being localizable.</li>\n<li>The &#8220;Undismiss&#8221; action is now displayed in all views instead of only the &#8220;Dismissed&#8221; view. This way you can tell if a broken link has been dismissed without having to search the &#8220;Dismissed&#8221; list.</li>\n<li>Added information about the last email notification sent to debug info. It&#8217;s accessible by clicking &#8220;show debug info&#8221; on the plugin settings page.</li>\n</ul>\n<h4>1.8.3</h4>\n<ul>\n<li>Added a Hungarian translation.</li>\n<li>Fixed a bunch of &#8220;deprecated function&#8221; notices that showed up due to wpdb::escape() becoming deprecated in WP 3.6.</li>\n<li>Fixed a vulnerability that would allow users with the ability to bulk-edit links to execute arbitrary PHP code by using a specially crafted regex as the search string.</li>\n<li>Updated German translation.</li>\n<li>Replaced the old Dutch translation with a new and more complete translation by Robin Roelofsen.</li>\n</ul>\n<h4>1.8.2</h4>\n<ul>\n<li>Removed one of the translator credits links because Google flagged it as &#8220;suspicious&#8221;.</li>\n<li>Updated French translation.</li>\n<li>Updated Polish translation.</li>\n<li>Fixed several field size and layout issues that made the search form display incorrectly in Firefox.</li>\n</ul>\n<h4>1.8.1</h4>\n<ul>\n<li>Updated the Polish and Simplified Chinese translations.</li>\n<li>Updated the German translation.</li>\n<li>Added translation strings for two modules that were missing them.</li>\n<li>Replaced a number of icons with GPL-compatible alternatives from Font Awesome.</li>\n<li>Removed some unused images.</li>\n</ul>\n<h4>1.8</h4>\n<ul>\n<li>Added an option to only show the dashboard widget for users with the Administrator role, or to disable it completely.</li>\n<li>Added a way to change the notification email address.</li>\n<li>Added support for Smart YouTube &#8220;httpv://&#8221; links.</li>\n<li>Added support for protocol-relative URLs (for example, &#8220;//example.com/&#8221;).</li>\n<li>Added support for checking YouTube playlists.</li>\n<li>Added a Brazilian Portuguese (pt-BR) translation.</li>\n<li>Updated Chinese (Traditional) translation.</li>\n<li>Switched over to storing plugin settings as JSON instead of serialized PHP arrays.</li>\n<li>Improved error reporting in situations where the plugin can not load settings from the database.</li>\n<li>Fixed: Display a more specific error message than just &#8220;update failed&#8221; when the plugin fails to modify a post. This only applies to WP 3.5+.</li>\n<li>Fixed: Display the right URL for embedded YouTube playlists. Previously the plugin would show the same (incorrect) URL for all playlists.</li>\n</ul>\n<h4>1.7.1</h4>\n<ul>\n<li>Added an Arabic translation.</li>\n<li>Updated Portuguese translation.</li>\n<li>Updated French translation.</li>\n<li>Fixed MySQL errors caused by the plugin converting table names to lowercase.</li>\n<li>Fixed a bug where the plugin would sometimes report broken Twitter links as working.</li>\n<li>Fixed the plugin author URL.</li>\n</ul>\n<h4>1.7</h4>\n<ul>\n<li>Added support for youtu.be shortlinks.</li>\n<li>Added a Finnish translation.</li>\n<li>Fixed a graphical bug where the currently selected settings tab would not be highlighted in WordPress 3.5.</li>\n<li>Removed the &#8220;Blogroll items&#8221; module from the list of link containers enabled by default. The WordPress developer team is planning to remove Link Manager from core, and the &#8220;Links&#8221; menu will be hidden by default in new WP 3.5 installs.</li>\n<li>Removed the Admin Menu Editor Pro ad from the &#8220;Settings -&gt; Link Checker&#8221; and the &#8220;Tools -&gt; Broken Links&#8221; pages.</li>\n<li>Disabled the news link (if any) for users who have donated.</li>\n<li>Removed support for pre-WP 2.9 post meta actions.</li>\n<li>Minor styling changes of screen meta links.</li>\n<li>Updated Danish, Germa, Italian, French and Simplified Chinese translations.</li>\n<li>Tested on WordPress 3.5.</li>\n</ul>\n<h4>1.6.2</h4>\n<ul>\n<li>Another attempt to fix the &#8220;database not up to date&#8221; that some users are still experiencing even with 1.6.1.</li>\n</ul>\n<h4>1.6.1</h4>\n<ul>\n<li>Fixed the &#8220;database not up to date&#8221; bug. Now the plugin should properly upgrade the DB.</li>\n</ul>\n<h4>1.6</h4>\n<ul>\n<li>Added a way to dismiss links. Dismissed links don&#8217;t show up in the &#8220;Broken&#8221; and &#8220;Redirects&#8221; lists, but are still checked as normal and get the normal link styles (e.g. strike-through for broken links). Useful if you want to, for example, acknowledge that a link is broken and leave it be.</li>\n<li>Added a &#8220;Redirect URL&#8221; column. For redirects this will display the URL that the link redirects to. For normal, non-redirected links, it will be empty. This column is hidden by default. You can enable it in the &#8220;Screen Options&#8221; panel.</li>\n<li>Updated French translation.</li>\n<li>Tested on WP 3.4.1.</li>\n<li>Replace the &#8220;More plugins&#8230;&#8221; link on the &#8220;Broken Links&#8221; page with a link to the Admin Menu Editor page. This link will be hidden for users who have donated.</li>\n<li>A number of minor fixes.</li>\n</ul>\n<h4>1.5.5</h4>\n<ul>\n<li>Fix broken image on the settings page.</li>\n</ul>\n<h4>1.5.3</h4>\n<ul>\n<li>Fixed a bug that would cause the donation flag to be recorded incorrectly. Apologies to everyone who donated.</li>\n</ul>\n<h4>1.5.2</h4>\n<ul>\n<li>A few minor comment fixes.</li>\n<li>Move certain styles to a separate CSS file, which is where they belong.</li>\n<li>Replace the ThemeFuse banner with one from ManageWP (will go live on June 5).</li>\n<li>Instead of displaying several plugins in the &#8220;More plugins by Janis Elsts&#8221; box, sometimes display just one plugin (AME).</li>\n</ul>\n<h4>1.5.1</h4>\n<ul>\n<li>Updated Portuguese translation.</li>\n<li>Updated German translation.</li>\n<li>Fixed the donation link to properly return to the Dashboard upon completion.</li>\n<li>Do not display ads to users who have donated.</li>\n</ul>\n<h4>1.5</h4>\n<ul>\n<li>Added a FileServe checker.</li>\n<li>Added Turkish translation.</li>\n<li>Added GoogleVideo and Megavideo embed support.</li>\n<li>Fixed Megaupload links being reported with an &#8220;Unknown error&#8221; message when it should be &#8220;Not found&#8221;.</li>\n<li>Fixed a couple of bugs in the Rapidshare and MediaFire checkers.</li>\n<li>Updated German translation.</li>\n<li>Updated Italian translation.</li>\n<li>Updated Portuguese translation.</li>\n<li>The explanatory text for the broken link CSS and removed link CSS inputs can now be translated.</li>\n<li>Tested on WP 3.4-alpha-20291.</li>\n</ul>\n<h4>1.4</h4>\n<ul>\n<li>Added an option to send post authors notifications about broken links in their posts.</li>\n<li>Added the ability to sort links by URL (click the column header).</li>\n<li>Added YouTube API throttling to avoid going over the request quota, which could result in false positives on blogs with lots of YouTube videos.</li>\n<li>Added a Bulgarian translation.</li>\n<li>Updated Italian, German and Persian translations.</li>\n<li>Fixed a bug where the &#8220;Feedback&#8221; and other screen meta links wouldn&#8217;t show up in WP 3.3.</li>\n<li>Fixed the tab CSS for the plugin settings page. Now they should be the right size and look the same in all modern browsers (tested in IE, Firefox, Chrome and Opera).</li>\n<li>Fixed drop-down arrows showing up on meta links that don&#8217;t actually have dropdowns.</li>\n<li>Tested on WP 3.3 (RC2).</li>\n</ul>\n<h4>1.3.1</h4>\n<ul>\n<li>Added support for the new YouTube embed code style. It needs to be explicitly enabled in options.</li>\n<li>Added credits link for the Persian language translator.</li>\n<li>Updated Portuguese translation.</li>\n<li>Updated German translation.</li>\n<li>Partial fix for Mediafire checker failing with a fatal error in some situations.</li>\n</ul>\n<h4>1.3</h4>\n<ul>\n<li>Dropped PHP 4 support.</li>\n<li>Fixed a whole lot of PHP 5 related notices and strict-mode warnings.</li>\n<li>Fixed some inconsistent method declarations.</li>\n<li>Fixed a long-standing bug in the ver. 0.9.5 upgrade routine.</li>\n<li>Fixed the look and behavior of the &#8220;Feedback&#8221; and &#8220;Go to Broken Links/Go to Settings&#8221; links to be consistent with other WP screen meta links.</li>\n<li>Updated Chinese (TW) translation.</li>\n<li>Updated Portuguese translation.</li>\n<li>Updated Italian translation (minor fix).</li>\n<li>Replaced the link to FindBroken with a short list of (some of) my other plugins.</li>\n</ul>\n<h4>1.2.5</h4>\n<ul>\n<li>Added Irish translation.</li>\n<li>Added Persian translation.</li>\n<li>Added Korean translation.</li>\n<li>Added Chinese Traditional translation.</li>\n<li>Updated German translation.</li>\n<li>Fixed (probably) missing diacritics in the Romanian translation.</li>\n<li>Fixed a crash bug caused by class-json.php no longer being present in the latest WP. Luckily, the plugin only really needed that class for backwards compatibility.</li>\n<li>Made the &#8220;database not up to date&#8221; error message a bit more helpful.</li>\n<li>Shortcodes in image URLs should work now.</li>\n<li>The Dashboard widget is no longer visible to non-privileged users.</li>\n<li>Replaced multiple instances of get_option(&#8216;home&#8217;) and get_option(&#8216;siteurl&#8217;) &#8211; both now deprecated &#8211; with home_url().</li>\n</ul>\n<h4>1.2.4</h4>\n<ul>\n<li>Fixed a very stupid bug where links would be checked very slowly or not at all.</li>\n<li>Fixed the display of the news link.</li>\n<li>Updated Italian translation.</li>\n</ul>\n<h4>1.2.3</h4>\n<ul>\n<li>Updated Portuguese translation.</li>\n<li>Updated German translation.</li>\n<li>Switched to a simpler, MySQL-based locking mechanism. Note: This may cause trouble for people who&#8217;ve hacked their WP install to use persistent database connections.</li>\n<li>Added a poll asking for feedback on a new BLC-related web application idea.</li>\n<li>Minor wording change in the debug info table.</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>All Pro features now included in the free version!</li>\n<li>Updated Japanese translation.</li>\n<li>Updated Polish translation.</li>\n<li>Updated Portuguese translation.</li>\n<li>Added Romanian translation.</li>\n<li>Fixed a tab layout bug in IE 7.</li>\n<li>Fixed UTF-8 characters outside the domain name being encoded incorrectly (may only work with Curl).</li>\n<li>Fixed a missing translation in email notifications.</li>\n<li>Fixed a rare &#8220;only variables can be returned by reference&#8221; notice.</li>\n<li>Added a donation button and a MaxCDN ad to the Settings page.</li>\n<li>Added a &#8220;Go to Settings&#8221; button to the Broken Links page, and a &#8220;Go to Broken Links&#8221; button to the Settings page.</li>\n<li>Settings page now looks better on small screens.</li>\n<li>Email notifications are now enabled by default.</li>\n<li>&#8220;Link status&#8221; in the search form no longer defaults to the currently displayed filter/view.</li>\n<li>Made the &#8220;installation failed&#8221; message a bit more helpful.</li>\n</ul>\n<h4>0.9.7.2</h4>\n<ul>\n<li>Added Polish translation.</li>\n<li>Updated Danish translation.</li>\n<li>Updated Italian translation.</li>\n<li>Fixed an uncommon &#8220;Cannot break/continue 1 level&#8221; error.</li>\n<li>Added a new user feedback survey (the link only shows up after you&#8217;ve used this version for at least two weeks).</li>\n</ul>\n<h4>0.9.7.1</h4>\n<ul>\n<li>Updated German translation and fixed the corresponding credits link.</li>\n</ul>\n<h4>0.9.7</h4>\n<ul>\n<li>Allow custom field names with spaces.</li>\n<li>Updated German translation.</li>\n<li>Updated Portuguese translation</li>\n<li>Made the &#8220;Current load&#8221; label localizeable.</li>\n<li>Fixed a translation-related bug where the various checkboxes in the &#8220;Link types&#8221; and &#8220;Look for links in&#8221; sections would appear in English even when a valid translation was available.</li>\n<li>Fixed non-ASCII URLs being mangled when links are automatically marked with the &#8220;broken_link&#8221; CSS class.</li>\n<li>Fixed blog names that include quotes being displayed incorrectly in email notifications.</li>\n<li>When removing a link via the &#8220;Unlink&#8221; action, add the old URL as the title attribute of the now-unlinked anchor text.</li>\n<li>When resolving relative URLs posted in comments, use the comment&#8217;s permalink as the base (previously the blog&#8217;s homepage URL was used).</li>\n</ul>\n<h4>0.9.6</h4>\n<ul>\n<li>Updated Danish translation.</li>\n<li>Updated Italian translation.</li>\n<li>Updated Portuguese translation</li>\n<li>Fixed incorrect parsing of relative URLs that consist solely of a query string or &#035;fragment.</li>\n<li>Fixed superfluous resynchronization requests being issued when the plugin is re-activated.</li>\n<li>Fixed only one of character set and collation being specified for the plugin&#8217;s tables.</li>\n<li>Added default status text for HTTP codes 509 and 510.</li>\n<li>Added the installation log to debug info output.</li>\n<li>Added lots of logging to routines called on activation.</li>\n<li>Added an &#8220;Upgrade to Pro&#8221; button to the plugin&#8217;s pages.</li>\n<li>Removed the highlight on the &#8220;Feedback&#8221; button.</li>\n<li>Fail fast if trying to activate on an unsupported version of WordPress.</li>\n<li>Ensure PHP and browser timeouts don&#8217;t prematurely terminate the installation/upgrade script.</li>\n<li>Plugin JavaScript and CSS files are now loaded using HTTPS when FORCE_ADMIN_SSL is on.</li>\n</ul>\n<h4>0.9.5</h4>\n<ul>\n<li>Added the ability to check scheduled, draft and private posts.</li>\n<li>Added a way to individually enable/disable the monitoring of posts, pages, comments, the blogroll, and so on.</li>\n<li>New &#8220;Status&#8221; column in the &#8220;Broken Links&#8221; table.</li>\n<li>Visible table columns and the number of links per page can now be selected in the &#8220;Screen Options&#8221; panel.</li>\n<li>Replaced the &#8220;Delete sources&#8221; action with &#8220;Move sources to Trash&#8221; (except on blogs where Trash is disabled).</li>\n<li>New URL editor interface, now more consistent with the look-n-feel of the inline editor for posts.</li>\n<li>New status icon to help distinguish &#8220;maybe broken&#8221; and &#8220;definitely broken&#8221; links.</li>\n<li>Tweaked table layout &#8211; links first, posts/etc last.</li>\n<li>Added &#8220;Compact&#8221; and &#8220;Detailed&#8221; table views (for now, the differences are quite minor).</li>\n<li>Split the settings page into several tabs.</li>\n<li>Removed the &#8220;Details&#8221; links as redundant. To display link details, click the contents of the &#8220;Status&#8221; or &#8220;Link text&#8221; columns instead.</li>\n<li>Added a way to individually enable/disable the monitoring of various link types, e.g. HTML links, images, etc.</li>\n</ul>\n<h4>0.9.4.4</h4>\n<ul>\n<li>Fixed &#8220;Edit URL&#8221; and &#8220;Unlink&#8221; not working on PHP4 servers.</li>\n</ul>\n<h4>0.9.4.3</h4>\n<ul>\n<li>Another PHP 4 fix. Considering dropping support for PHP4 in light of the counterintuitive workarounds required to make perfectly valid PHP5 code work in that ghastly thing.</li>\n<li>Added a partial workaround for sites that have use strange DB&#095;CHARSET settings.</li>\n</ul>\n<h4>0.9.4.2</h4>\n<ul>\n<li>Added more debugging data to the &#8220;Show debug info&#8221; table.</li>\n<li>Added missing indexes to the instance table.</li>\n<li>Yet more PHP4 compatibility fixes.</li>\n<li>Added a notification bubble with the current number of broken links to the Tools -&gt; Broken Links menu item.</li>\n</ul>\n<h4>0.9.4.1</h4>\n<ul>\n<li>Fixed PHP 4 incompatibilities introduced in the previous release.</li>\n<li>Fixed bulk unlink.</li>\n<li>Updated Italian translation.</li>\n<li>Updated Danish translation.</li>\n</ul>\n<h4>0.9.4</h4>\n<ul>\n<li>Fixed missing post and comment edit links in email notifications.</li>\n<li>Updated Danish translation.</li>\n<li>Added Japanese translation.</li>\n<li>Added a Hindi translation.</li>\n<li>Added a Portuguese translation.</li>\n<li>Slightly improved DB error reporting.</li>\n<li>Added the ability to disable comment link checking.</li>\n<li>Fixed a couple of minor bugs that made some of the UI text impossible to translate.</li>\n<li>The plugin&#8217;s tables are now created with the same character set and collation settings as native WP tables (previously they used the database defaults instead).</li>\n<li>Automatically clean up and optimize the plugin&#8217;s tables twice per month.</li>\n<li>Instead of displaying a zero response time for timed out links, now it shows how long the plugin waited before assuming that the link has timed out.</li>\n<li>Added the default PHP script execution time limit to the &#8220;Debug info&#8221; table.</li>\n<li>Added a &#8220;Mark as not broken&#8221; bulk action.</li>\n<li>Links that make the plugin crash are no longer assumed to be broken.</li>\n</ul>\n<h4>0.9.3</h4>\n<ul>\n<li>Fixed a JS error that only happened in IE by removing a superfluous comma from an object literal.</li>\n<li>Fixed load limiting not being completely disabled on servers that don&#8217;t support it.</li>\n<li>Fixed a mishandling of new comments that would occur when CAPTCHA verification was enabled and someone entered an incorrect code.</li>\n<li>Added installation/update logging.</li>\n<li>Fixed a crash that would occur when the user tried to permanently delete a trashed post that has comments.</li>\n</ul>\n<h4>0.9.2</h4>\n<ul>\n<li>In Tools -&gt; Broken Links, highlight links that have been broken for a long time (off by default).</li>\n<li>Fixed an invalid parameter bug in the HTTP link checking routine.</li>\n<li>Added nofollow to broken links (optional, only works for links in posts).</li>\n<li>Fixed some PHP notices and a bunch of deprecated function calls.</li>\n<li>Fixed &#8220;Trash&#8221; links for comments.</li>\n</ul>\n<h4>0.9.1</h4>\n<ul>\n<li>Fixed the &#8220;syntax error: unexpected $end&#8221; problem caused by a unintentional PHP shorttag.</li>\n<li>Eliminated a bunch of false positives by adding a workaround for buggy servers that incorrectly respond with 404 to HEAD requests.</li>\n<li>Increased the default server load limit to 4.0 to prevent the plugin from idling endlessly on weakling servers.</li>\n</ul>\n<h4>0.9</h4>\n<ul>\n<li>Masquerade as IE 7 when using the Snoopy library to check links. Should prevent some false positives.</li>\n<li>Fixed relative URL handling (yet again). It&#8217;ll work this time, honest 😉</li>\n<li>Fixed post titles being displayed incorrectly on multilingual blogs (props Konstanin Zhilenko)</li>\n<li>Misc fixes/comments.</li>\n<li>&#8220;Unlink&#8221; works properly now.</li>\n<li>Additional source code comments.</li>\n<li>Don&#8217;t try to display icons in email notifications. It didn&#8217;t work anyway.</li>\n<li>Use AJAX nonces for additional security.</li>\n<li>General code cleanup.</li>\n<li>Email notifications about broken links.</li>\n<li>&#8220;Recheck&#8221; bulk action.</li>\n<li>Check comment links.</li>\n<li>Suspend checking if the server is overloaded (on by default).</li>\n<li>Icons for broken links and redirects.</li>\n<li>Fixed some UI glitches.</li>\n<li>&#8220;Discard&#8221; gone, replaced by &#8220;Not broken&#8221;.</li>\n<li>&#8220;Exclude&#8221; gone from action links.</li>\n<li>Better handling of false positives.</li>\n<li>FTP, mailto:, javascript: and other links with unsupported protocols now show up in the �All links� list.</li>\n</ul>\n<h4>0.8.1</h4>\n<ul>\n<li>Updated Italian translation.</li>\n<li>Removed the survey link.</li>\n</ul>\n<h4>0.8</h4>\n<ul>\n<li>Initial support for performing some action on multiple links at once.</li>\n<li>Added a &#8220;Delete sources&#8221; bulk action that lets you delete all posts (or blogroll entries) that contain any of the selected links. Doing this in WP 2.9 and up this will instead move the posts to the trash, not delete them permanently.</li>\n<li>New bulk action : Unlink. Removes all  &hellip;</li>\n</ul>\n"
    },
    "short_description": "Check posts, pages &amp; all content for broken links to improve SEO. Get notified when bad links are found.",
    "description": "<p>The fastest and most accurate broken link checker for WordPress. Join over 700K people who use Broken Link Checker to monitor and detect broken links 20x faster than other plugins, with pinpoint accuracy. No page limits, no ads, no upsells. Enjoy effortless, unlimited, and automated broken link checking from the get-go.</p>\n<p><strong>Broken links can kill your SEO, user experience, and site health… Broken Link Checker helps you find and resolve them faster than similar plugins.</strong></p>\n<p>Finding and staying on top of broken links can feel like a never-ending battle, especially if you&#8217;re dealing with large sites or managing multiple.</p>\n<p>Using a link checking tool can save you from having to find links manually, or avoid the frustration of discovering missed broken links months later (oops!).</p>\n<p>But not every broken link checker was created equal…</p>\n<p>You need a tool that not only automates the process, but also detects broken links quickly, thoroughly, and accurately.</p>\n<p><strong>That’s where Broken Link Checker comes in…</strong></p>\n<p>BLC doesn’t <em>just</em> scan your sites faster than other solutions, it scans deeply and frequently to ensure no broken links are missed.</p>\n<p>Scan every inch of your sites, including external and internal links within your posts, pages, comments, blogroll, even custom fields, helping to ensure your site&#8217;s SEO and user experience are not compromised in any way. And if that isn&#8217;t enough, you’ll also receive detection reports via email so you can quickly take corrective action.</p>\n<p><strong>Choose from two different link checking engines:</strong></p>\n<p>Broken Link Checker gives you the option of using two unique engines based on your needs. You can also easily switch between local and cloud broken link checking <strong>without losing your saved settings.</strong></p>\n<p><strong>1.Cloud-based link checker</strong></p>\n<p>This engine is 100% cloud-based and built directly on WPMU DEV’s servers (the owners of BLC), harnessing their powerful API.</p>\n<p><em>Note that our cloud-based engine is still in beta. We’re working around the clock to make this new version even better. As mentioned, if it’s missing a feature you need, simply switch back to the local version.</em></p>\n<p>This cloud-based engine gives you several advantages, including:</p>\n<ul>\n<li>\n<p><strong>20x more speed</strong> &#8211; Being cloud-based eliminates any dependence on the performance of your server, giving you a massive speed increase.</p>\n</li>\n<li>\n<p><strong>Unlimited page &amp; URL checker</strong> &#8211; Enjoy limitless scanning for pages and URLs, ideal if you’re working with multiple sites or large sites with a lot of content.</p>\n</li>\n<li>\n<p><strong>Edit/unlink broken links (coming soon)</strong> &#8211; Effortlessly resolve all detected links right from your BLC dashboard.</p>\n</li>\n<li>\n<p><strong>Crawl it all</strong> &#8211; Standard pages and posts, menus, category pages&#8230; BLC ensures no URL is missed.</p>\n</li>\n<li>\n<p><strong>Any site, any size</strong> &#8211; Unlike plugin-based solutions, BLC is server-independent, making it capable of checking sites of any size and type.</p>\n</li>\n<li>\n<p><strong>Fewer errors</strong> &#8211; BLC’s cloud-based nature eliminates the occurrence of WP Errors, Fatal Errors, DB Errors, and PHP Errors often present with other plugins.</p>\n</li>\n<li>\n<p><strong>Less chance of being blocked</strong> &#8211; The cloud-based engine doesn&#8217;t use your site&#8217;s IP address to check external URLs, meaning you’re less likely to be blocked due to frequent requests.</p>\n</li>\n</ul>\n<p><strong>Plus, manage broken links for unlimited sites from one place</strong></p>\n<p>Since the cloud-based engine connects you to WPMU DEV, you have the luxury of free access to their suite of powerful web development tools &#8211; including a convenient site management interface where you can manage broken links on multiple sites, rather than just one.</p>\n<p><strong>2. Local link checker</strong></p>\n<p>The main difference of our local link checker compared to the cloud engine, is that it uses your site/server resources to fetch and analyze site content and check the status of links.</p>\n<p>It also uses your site&#8217;s IP address, which as mentioned above, increases your risk of being blocked by some external links, resulting in incomplete or inaccurate scan results.</p>\n<p><strong>Here are the standout features of the local link checking engine:</strong></p>\n<ul>\n<li>Monitors external links and internal links in your posts, pages, comments, the blogroll, and custom fields (optional).</li>\n<li>Detects broken links and redirects.</li>\n<li>Receive notifications via your dashboard or email.</li>\n<li>Make broken links display differently in posts (optional).</li>\n<li>Prevent search engines from following broken links (optional).</li>\n<li>Search and filter links by URL, anchor text and more.</li>\n<li>Edit links directly from your interface, without manually updating each post.</li>\n</ul>\n<p>Whether you choose local or cloud-based, BLC’s user-friendly dashboard and powerful features makes staying on top of broken links as easy and automated as possible.</p>\n<h3>The best scanning &amp; detection features on one dashboard:</h3>\n<p><strong>Run manual scans or set an automatic schedule</strong></p>\n<p>Enjoy the flexibility to run scans manually, or schedule automatic daily, weekly, and monthly scans to suit your preference and the sites you manage.</p>\n<p><strong>Edit or unlink broken links (coming soon to cloud-based)</strong></p>\n<p>After BLC detects broken links, it gives you the option to edit or unlink them with a click from your main dashboard. It couldn’t be easier or faster.</p>\n<p><strong>Detailed broken link reports</strong></p>\n<p>After each scan you get a comprehensive summary of any broken links detected, along with the status of the links so you can instantly know how to resolve the issue.</p>\n<p><strong>Detection notifications via email</strong></p>\n<p>Stay on top of your link health and fix issues as fast as possible with broken link reports sent straight to an email address of your choice.</p>\n<p><strong>Advanced search filtering</strong></p>\n<p>BLC’s search and filtering tools make it faster and easier to find specific URLs or filter by status or error type.</p>\n<p><strong>Export report lists for further analysis</strong></p>\n<p>Export your broken link lists as a CSV file for greater analysis inside of Google Sheets, Microsoft Excel, and other spreadsheet/data software.</p>\n<h3>HELP KEEP BLC SECURE</h3>\n<p>We take plugin security incredibly seriously; if you have a bug or vulnerability to report, you can do so through the Patchstack Vulnerability Disclosure Program. It’s fast, easy, and you will be notified when the issue is fixed. <a href=\"https://patchstack.com/database/vdp/broken-link-checker\" rel=\"nofollow ugc\">Report a vulnerability</a>.</p>\n<h3>ABOUT US</h3>\n<p>The developers of BLC, WPMU DEV is an all-in-one WordPress platform that has helped millions of web developers worldwide run and grow their businesses for over 15 years.</p>\n<p>Our WordPress offerings include site management tools, dedicated hosting, reseller domains, and 12 popular WP plugins totalling more than 80 million downloads. Check out our website: <a href=\"https://wpmudev.com/\" rel=\"nofollow ugc\">https://wpmudev.com/</a></p>\n<p>Oh, and one more thing… we hope you enjoy our free offerings as much as we’ve loved making them for you!</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/broken-link-checker.2.3.0.zip",
    "upgrade_notice": {
        "1.10.5": "<p>Fixes a significant security issue.</p>",
        "1.9.2": "<p>Fixes UI issues related to the new WP 3.8 admin style and a few security vulnerabilities.</p>",
        "1.6.2": "<p>Attempts to fix the &quot;database not up to date&quot; bug that some users are still experiencing with 1.6.1. If you have not encountered this bug, you can skip this update.</p>",
        "1.4": "<p>Adds an option to send post authors notifications about broken links in their posts and the the ability to sort links by URL, as well as a number of other updates and fixes.</p>",
        "0.9.4.2": "<p>Fixes a major PHP4 compatibility problem introduced in version 0.9.4 and adds a notification bubble with the current broken link count to the &quot;Broken Links&quot; menu.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/broken-link-checker/assets/screenshot-1.png?rev=2912988",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/broken-link-checker/assets/screenshot-2.png?rev=2912988",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/broken-link-checker/assets/screenshot-3.png?rev=2912988",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/broken-link-checker/assets/screenshot-4.png?rev=2912988",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/broken-link-checker/assets/screenshot-5.png?rev=2912988",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/broken-link-checker/assets/screenshot-6.png?rev=2912988",
            "caption": ""
        }
    ],
    "tags": {
        "broken-images": "broken images",
        "broken-links": "broken links",
        "external-link": "external link",
        "internal-link": "internal link",
        "links": "links"
    },
    "stable_tag": "2.3.0",
    "versions": {
        "0.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.1.zip",
        "0.2": "https://downloads.wordpress.org/plugin/broken-link-checker.0.2.zip",
        "0.2.2": "https://downloads.wordpress.org/plugin/broken-link-checker.0.2.2.zip",
        "0.2.2.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.2.2.1.zip",
        "0.2.3": "https://downloads.wordpress.org/plugin/broken-link-checker.0.2.3.zip",
        "0.2.4": "https://downloads.wordpress.org/plugin/broken-link-checker.0.2.4.zip",
        "0.2.5": "https://downloads.wordpress.org/plugin/broken-link-checker.0.2.5.zip",
        "0.3": "https://downloads.wordpress.org/plugin/broken-link-checker.0.3.zip",
        "0.3.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.3.1.zip",
        "0.3.2": "https://downloads.wordpress.org/plugin/broken-link-checker.0.3.2.zip",
        "0.3.3": "https://downloads.wordpress.org/plugin/broken-link-checker.0.3.3.zip",
        "0.3.4": "https://downloads.wordpress.org/plugin/broken-link-checker.0.3.4.zip",
        "0.3.5": "https://downloads.wordpress.org/plugin/broken-link-checker.0.3.5.zip",
        "0.3.6": "https://downloads.wordpress.org/plugin/broken-link-checker.0.3.6.zip",
        "0.3.7": "https://downloads.wordpress.org/plugin/broken-link-checker.0.3.7.zip",
        "0.3.8": "https://downloads.wordpress.org/plugin/broken-link-checker.0.3.8.zip",
        "0.3.9": "https://downloads.wordpress.org/plugin/broken-link-checker.0.3.9.zip",
        "0.4": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.zip",
        "0.4-i8n": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4-i8n.zip",
        "0.4.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.1.zip",
        "0.4.10": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.10.zip",
        "0.4.11": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.11.zip",
        "0.4.12": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.12.zip",
        "0.4.13": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.13.zip",
        "0.4.14": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.14.zip",
        "0.4.2": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.2.zip",
        "0.4.3": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.3.zip",
        "0.4.4": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.4.zip",
        "0.4.5": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.5.zip",
        "0.4.6": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.6.zip",
        "0.4.7": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.7.zip",
        "0.4.8": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.8.zip",
        "0.4.9": "https://downloads.wordpress.org/plugin/broken-link-checker.0.4.9.zip",
        "0.5": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.zip",
        "0.5.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.1.zip",
        "0.5.10": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.10.zip",
        "0.5.10.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.10.1.zip",
        "0.5.11": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.11.zip",
        "0.5.12": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.12.zip",
        "0.5.13": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.13.zip",
        "0.5.14": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.14.zip",
        "0.5.15": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.15.zip",
        "0.5.16": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.16.zip",
        "0.5.16.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.16.1.zip",
        "0.5.17": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.17.zip",
        "0.5.18": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.18.zip",
        "0.5.2": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.2.zip",
        "0.5.3": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.3.zip",
        "0.5.4": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.4.zip",
        "0.5.5": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.5.zip",
        "0.5.6": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.6.zip",
        "0.5.7": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.7.zip",
        "0.5.8": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.8.zip",
        "0.5.8.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.8.1.zip",
        "0.5.9": "https://downloads.wordpress.org/plugin/broken-link-checker.0.5.9.zip",
        "0.6": "https://downloads.wordpress.org/plugin/broken-link-checker.0.6.zip",
        "0.6.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.6.1.zip",
        "0.6.2": "https://downloads.wordpress.org/plugin/broken-link-checker.0.6.2.zip",
        "0.6.3": "https://downloads.wordpress.org/plugin/broken-link-checker.0.6.3.zip",
        "0.6.4": "https://downloads.wordpress.org/plugin/broken-link-checker.0.6.4.zip",
        "0.6.5": "https://downloads.wordpress.org/plugin/broken-link-checker.0.6.5.zip",
        "0.7": "https://downloads.wordpress.org/plugin/broken-link-checker.0.7.zip",
        "0.7.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.7.1.zip",
        "0.7.2": "https://downloads.wordpress.org/plugin/broken-link-checker.0.7.2.zip",
        "0.7.3": "https://downloads.wordpress.org/plugin/broken-link-checker.0.7.3.zip",
        "0.7.4": "https://downloads.wordpress.org/plugin/broken-link-checker.0.7.4.zip",
        "0.8": "https://downloads.wordpress.org/plugin/broken-link-checker.0.8.zip",
        "0.8.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.8.1.zip",
        "0.9": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.zip",
        "0.9.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.1.zip",
        "0.9.2": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.2.zip",
        "0.9.3": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.3.zip",
        "0.9.4": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.4.zip",
        "0.9.4.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.4.1.zip",
        "0.9.4.2": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.4.2.zip",
        "0.9.4.3": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.4.3.zip",
        "0.9.4.4": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.4.4.zip",
        "0.9.4.4-last-non-modular": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.4.4-last-non-modular.zip",
        "0.9.5": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.5.zip",
        "0.9.6": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.6.zip",
        "0.9.7": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.7.zip",
        "0.9.7.1": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.7.1.zip",
        "0.9.7.2": "https://downloads.wordpress.org/plugin/broken-link-checker.0.9.7.2.zip",
        "1.10": "https://downloads.wordpress.org/plugin/broken-link-checker.1.10.zip",
        "1.10.1": "https://downloads.wordpress.org/plugin/broken-link-checker.1.10.1.zip",
        "1.10.10": "https://downloads.wordpress.org/plugin/broken-link-checker.1.10.10.zip",
        "1.10.11": "https://downloads.wordpress.org/plugin/broken-link-checker.1.10.11.zip",
        "1.10.2": "https://downloads.wordpress.org/plugin/broken-link-checker.1.10.2.zip",
        "1.10.3": "https://downloads.wordpress.org/plugin/broken-link-checker.1.10.3.zip",
        "1.10.4": "https://downloads.wordpress.org/plugin/broken-link-checker.1.10.4.zip",
        "1.10.5": "https://downloads.wordpress.org/plugin/broken-link-checker.1.10.5.zip",
        "1.10.6": "https://downloads.wordpress.org/plugin/broken-link-checker.1.10.6.zip",
        "1.10.7": "https://downloads.wordpress.org/plugin/broken-link-checker.1.10.7.zip",
        "1.10.8": "https://downloads.wordpress.org/plugin/broken-link-checker.1.10.8.zip",
        "1.10.9": "https://downloads.wordpress.org/plugin/broken-link-checker.1.10.9.zip",
        "1.11.1": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.1.zip",
        "1.11.10": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.10.zip",
        "1.11.11": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.11.zip",
        "1.11.12": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.12.zip",
        "1.11.13": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.13.zip",
        "1.11.14": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.14.zip",
        "1.11.15": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.15.zip",
        "1.11.17": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.17.zip",
        "1.11.18": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.18.zip",
        "1.11.19": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.19.zip",
        "1.11.2": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.2.zip",
        "1.11.20": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.20.zip",
        "1.11.21": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.21.zip",
        "1.11.3": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.3.zip",
        "1.11.4": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.4.zip",
        "1.11.5": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.5.zip",
        "1.11.8": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.8.zip",
        "1.11.9": "https://downloads.wordpress.org/plugin/broken-link-checker.1.11.9.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/broken-link-checker.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/broken-link-checker.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/broken-link-checker.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/broken-link-checker.1.2.5.zip",
        "1.3": "https://downloads.wordpress.org/plugin/broken-link-checker.1.3.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/broken-link-checker.1.3.1.zip",
        "1.4": "https://downloads.wordpress.org/plugin/broken-link-checker.1.4.zip",
        "1.5": "https://downloads.wordpress.org/plugin/broken-link-checker.1.5.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/broken-link-checker.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/broken-link-checker.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/broken-link-checker.1.5.3.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/broken-link-checker.1.5.4.zip",
        "1.5.5": "https://downloads.wordpress.org/plugin/broken-link-checker.1.5.5.zip",
        "1.6": "https://downloads.wordpress.org/plugin/broken-link-checker.1.6.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/broken-link-checker.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/broken-link-checker.1.6.2.zip",
        "1.7": "https://downloads.wordpress.org/plugin/broken-link-checker.1.7.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/broken-link-checker.1.7.1.zip",
        "1.8": "https://downloads.wordpress.org/plugin/broken-link-checker.1.8.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/broken-link-checker.1.8.1.zip",
        "1.8.2": "https://downloads.wordpress.org/plugin/broken-link-checker.1.8.2.zip",
        "1.8.3": "https://downloads.wordpress.org/plugin/broken-link-checker.1.8.3.zip",
        "1.9": "https://downloads.wordpress.org/plugin/broken-link-checker.1.9.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/broken-link-checker.1.9.1.zip",
        "1.9.2": "https://downloads.wordpress.org/plugin/broken-link-checker.1.9.2.zip",
        "1.9.3": "https://downloads.wordpress.org/plugin/broken-link-checker.1.9.3.zip",
        "1.9.4": "https://downloads.wordpress.org/plugin/broken-link-checker.1.9.4.zip",
        "1.9.4.1": "https://downloads.wordpress.org/plugin/broken-link-checker.1.9.4.1.zip",
        "1.9.4.2": "https://downloads.wordpress.org/plugin/broken-link-checker.1.9.4.2.zip",
        "1.9.5": "https://downloads.wordpress.org/plugin/broken-link-checker.1.9.5.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/broken-link-checker.2.0.0.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/broken-link-checker.2.1.0.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/broken-link-checker.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/broken-link-checker.2.2.1.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/broken-link-checker.2.2.2.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/broken-link-checker.2.2.3.zip",
        "2.2.4": "https://downloads.wordpress.org/plugin/broken-link-checker.2.2.4.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/broken-link-checker.2.3.0.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/broken-link-checker.2.3.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/broken-link-checker.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/broken-link-checker/assets/banner-772x250.png?rev=2900471",
        "high": "https://ps.w.org/broken-link-checker/assets/banner-1544x500.png?rev=2900471"
    },
    "icons": {
        "1x": "https://ps.w.org/broken-link-checker/assets/icon-128x128.png?rev=2900468",
        "2x": "https://ps.w.org/broken-link-checker/assets/icon-256x256.png?rev=2900468"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 76,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "ar",
            "version": "2.3.0",
            "updated": "2021-10-19 06:47:27",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/ar.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "ca",
            "version": "2.3.0",
            "updated": "2023-11-10 08:11:33",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/ca.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "cs_CZ",
            "version": "2.3.0",
            "updated": "2023-12-30 20:46:58",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/cs_CZ.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "da_DK",
            "version": "2.3.0",
            "updated": "2021-06-05 21:29:03",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/da_DK.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "de_DE_formal",
            "version": "2.3.0",
            "updated": "2024-08-07 02:21:45",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/de_DE_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "de_DE",
            "version": "2.3.0",
            "updated": "2024-08-07 02:20:57",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "de_CH_informal",
            "version": "2.3.0",
            "updated": "2017-09-10 08:28:37",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/de_CH_informal.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "de_AT",
            "version": "2.3.0",
            "updated": "2022-07-18 13:05:44",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/de_AT.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "de_CH",
            "version": "2.3.0",
            "updated": "2023-11-10 08:12:01",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/de_CH.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "en_CA",
            "version": "2.3.0",
            "updated": "2021-03-13 17:54:04",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/en_CA.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "en_NZ",
            "version": "2.3.0",
            "updated": "2020-02-26 01:20:10",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/en_NZ.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "en_GB",
            "version": "2.3.0",
            "updated": "2021-08-02 14:46:09",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/en_GB.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "en_AU",
            "version": "2.3.0",
            "updated": "2020-02-26 01:21:03",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/en_AU.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "es_VE",
            "version": "2.3.0",
            "updated": "2021-03-16 22:05:50",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/es_VE.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "es_CO",
            "version": "2.3.0",
            "updated": "2021-03-16 22:42:11",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/es_CO.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "es_ES",
            "version": "2.3.0",
            "updated": "2023-11-10 16:45:39",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "fi",
            "version": "2.3.0",
            "updated": "2017-06-12 12:42:55",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/fi.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "fr_FR",
            "version": "2.3.0",
            "updated": "2024-02-03 00:51:44",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "gl_ES",
            "version": "2.3.0",
            "updated": "2021-05-18 17:45:11",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/gl_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "hu_HU",
            "version": "2.3.0",
            "updated": "2023-11-10 08:12:08",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/hu_HU.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "it_IT",
            "version": "2.3.0",
            "updated": "2023-05-07 09:27:26",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "ja",
            "version": "2.3.0",
            "updated": "2021-03-27 14:14:45",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/ja.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "ko_KR",
            "version": "2.3.0",
            "updated": "2024-04-09 06:38:18",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/ko_KR.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "nl_NL",
            "version": "2.3.0",
            "updated": "2024-02-11 15:23:00",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "nl_BE",
            "version": "2.3.0",
            "updated": "2024-02-15 16:39:48",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/nl_BE.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "nl_NL_formal",
            "version": "2.3.0",
            "updated": "2024-02-11 16:04:27",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/nl_NL_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "pl_PL",
            "version": "2.3.0",
            "updated": "2024-06-12 09:31:10",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/pl_PL.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "pt_PT",
            "version": "2.3.0",
            "updated": "2022-09-14 12:29:13",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/pt_PT.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "ru_RU",
            "version": "2.3.0",
            "updated": "2023-11-10 08:12:37",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "sv_SE",
            "version": "2.3.0",
            "updated": "2024-03-06 10:03:31",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/sv_SE.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "vi",
            "version": "2.3.0",
            "updated": "2016-12-05 01:45:30",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/vi.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "zh_CN",
            "version": "2.3.0",
            "updated": "2020-06-22 20:00:45",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/zh_CN.zip"
        },
        {
            "type": "plugin",
            "slug": "broken-link-checker",
            "language": "zh_TW",
            "version": "2.3.0",
            "updated": "2021-05-07 04:25:24",
            "package": "https://downloads.wordpress.org/translation/plugin/broken-link-checker/2.3.0/zh_TW.zip"
        }
    ]
}