{
    "name": "BuddyPress Group Email Subscription",
    "slug": "buddypress-group-email-subscription",
    "version": "4.2.4",
    "author": "Deryk Wenaus, boonebgorges, r-a-y",
    "author_profile": "https://profiles.wordpress.org/boonebgorges/",
    "contributors": {
        "dwenaus": {
            "profile": "https://profiles.wordpress.org/dwenaus/",
            "avatar": "https://secure.gravatar.com/avatar/630eee9bb31878e181d272e4981540f4?s=96&d=monsterid&r=g",
            "display_name": "Dwenaus"
        },
        "boonebgorges": {
            "profile": "https://profiles.wordpress.org/boonebgorges/",
            "avatar": "https://secure.gravatar.com/avatar/9cf7c4541a582729a5fc7ae484786c0c?s=96&d=monsterid&r=g",
            "display_name": "Boone Gorges"
        },
        "r-a-y": {
            "profile": "https://profiles.wordpress.org/r-a-y/",
            "avatar": "https://secure.gravatar.com/avatar/3bfa556a62b5bfac1012b6ba5f42ebfa?s=96&d=monsterid&r=g",
            "display_name": "r-a-y"
        }
    },
    "requires": "3.2",
    "tested": "6.6.2",
    "requires_php": "5.3",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 80,
    "ratings": {
        "5": 23,
        "4": 1,
        "3": 1,
        "2": 0,
        "1": 7
    },
    "num_ratings": 32,
    "support_url": "https://wordpress.org/support/plugin/buddypress-group-email-subscription/",
    "support_threads": 4,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "last_updated": "2024-10-04 14:35:00",
    "added": "2010-03-22",
    "homepage": "http://wordpress.org/extend/plugins/buddypress-group-email-subscription/",
    "sections": {
        "description": "<p>This powerful plugin allows users to receive email notifications of group activity. Weekly or daily digests are available. Each user can choose how they want to subscribe to their groups.</p>\n<p>Please note that this plugin requires BuddyPress, as well as the BuddyPress Groups and Activity components.</p>\n<p>EMAIL SUBSCRIPTION LEVELS<br />\nThere are 5 levels of email subscription options:</p>\n<ol>\n<li>No Email &#8211; Read this group on the web</li>\n<li>Weekly Summary Email &#8211; A summary of new topics each week</li>\n<li>Daily Digest Email &#8211; All the day&#8217;s activity bundled into a single email</li>\n<li>New Topics Email &#8211; Send new topics as they arrive (but don&#8217;t send replies)</li>\n<li>All Email &#8211; Send all group activity as it arrives</li>\n</ol>\n<p>DEFAULT SUBSCRIPTION STATUS<br />\nGroup admins can choose one of the 5 subscription levels as a default that gets applied when new members join.</p>\n<p>DIGEST AND SUMMARY EMAILS<br />\nThe daily digest email is sent every morning and contains all the emails from all the groups a user is subscribed to. The digest begins with a helpful topic summary. The weekly summary email contains the topic titles from the past week by default. Summary and digest timing can be configured in the back end. (The admin can view a sample of the digests and summaries in the queue by going adding this to your url: mydomain.com/sum=1. This won&#8217;t send emails just show what will be sent)</p>\n<p>HTML EMAILS<br />\nThe digest and summary emails are sent out in multipart HTML and plain text email format. This makes the digest much more readable with better links. The email is multipart so users who need only plain text will get plain text.</p>\n<p>EMAILS FOR TOPICS I&#8217;VE STARTED OR COMMENTED ON (only available with BuddyPress legacy discussion forums)<br />\nUsers receive email notifications when someone replies to a topic they create or comment on (similar to Facebook). This happens whether they are subscribed or not. Users can control this behaviour in their notifications page.</p>\n<p>TOPIC FOLLOW AND MUTE (only available with BuddyPress legacy discussion forums)<br />\nUsers who are not fully subscribed to a group (ie. maybe they are on digest) can choose to get immediate email updates for specific topic threads. Any subsequent replies to that thread will be emailed to them. In an opposite way, users who are fully subscribed to a group but want to stop getting emails from a specific (perhaps annoying) thread can choose to mute that topic.  bbPress plugin users can utilize the &#8220;Subscribe&#8221; / &#8220;Notify me of follow-up replies via email&#8221; option.</p>\n<p>ADMIN NOTIFICATION<br />\nGroup admins can send out an email to all group members from the group&#8217;s admin section. This feature is helpful to quickly communicate to the whole group, but it should be used with caution.</p>\n<p>GROUP ADMINS CAN SET SUBSCRIPTION LEVEL<br />\nGroup admins can set the subscription level for existing users on the group&#8217;s &#8220;Admin &gt; Manage Members&#8221; page &#8211; either one by one or all at once.</p>\n<p>SPAM PROTECTION<br />\nTo protect against spam, you can set a minimum number of days users need to be registered before their group activity will be emailed to other users. This feature is off by default, but can be enabled in the admin.</p>\n<p>TRANSLATORS</p>\n<ul>\n<li>Brazilian Portuguese &#8211; www.about.me/dennisaltermann (or www.congregacao.net)</li>\n<li>Catalan &#8211; Sara Arjona Téllez</li>\n<li>Danish &#8211; Morten Nalholm</li>\n<li>Dutch &#8211; Anja werkgroepen.net/wordpress, Tim de Hoog</li>\n<li>Farsi &#8211; Vahid Masoomi http://www.AzUni.ir</li>\n<li>French &#8211; http://www.claudegagne-photo.com, Sylvain Ghysens</li>\n<li>German &#8211; Peter Peterson, Thorsten Wollenhöfer, Jörg Lohrer</li>\n<li>Hebrew &#8211; Iggy Pritzker</li>\n<li>Italian &#8211; Stefano Russo</li>\n<li>Japanese &#8211; https://buddypress.org/community/members/chestnut_jp/</li>\n<li>Lithuanian &#8211; Vincent G http://www.Host1Free.com</li>\n<li>Russian &#8211; http://www.viaestvita.net/groups/</li>\n<li>Spanish &#8211; Williams Castillo, Gregor Gimmy</li>\n<li>Swedish &#8211; Thomas Schneider, Joakim Hising</li>\n</ul>\n<p>NOTE TO PLUGIN AUTHORS<br />\nIf your plugin posts updates to the standard BuddyPress activity stream, then group members who are subscribed via 3. Daily Digest and 5. All Email will get your updates automatically. However people subscribed as 2. Weekly Summary and 4. New Topic will not. If you feel some of your plugin&#8217;s updates are very important and want to make sure all subscribed members receive them, you can filter &#8216;ass_this_activity_is_important&#8217; and return TRUE when $type matches your activity. See the ass_this_activity_is_important() function in bp-activity-subscription-functions.phpfor more info.</p>\n<p>PLUGIN SUPPORTERS:<br />\nMajor supporters: shambhalanetwork.org &amp; commons.gc.cuny.edu<br />\nOther supporters: bluedotproductions.com</p>\n<p>PLUGIN DEVELOPMENT<br />\nFor bug reports or to add patches or translation files, please visit the <a href=\"https://github.com/boonebgorges/buddypress-group-email-subscription/\" rel=\"nofollow ugc\">GES Github page</a>.  Contributions are definitely welcome!</p>\n",
        "installation": "<ol>\n<li>Install plugin</li>\n<li>Go to the front end and set your email options for each of your groups</li>\n<li>On the group admin settings, set the default subscription status of existing groups</li>\n<li>For groups with existing members, go to the bottom of the manage members tab to set all members to the default subscription</li>\n<li>If emails are not being sent ensure that the activity component is turned on</li>\n</ol>\n",
        "changelog": "<h4>4.2.4</h4>\n<ul>\n<li>Fix regression in 4.2.3 that caused certain tokens not to be replaced in Welcome emails.</li>\n</ul>\n<h4>4.2.3</h4>\n<ul>\n<li>Security hardening</li>\n<li>Internal code improvements, including localization and accessibility improvements</li>\n<li>New filter for content sent to <code>wp_mail()</code>.</li>\n</ul>\n<h4>4.2.2</h4>\n<ul>\n<li>Update BP 12.0 polyfills library for improved compatibility with older versions of BP and old forks.</li>\n<li>Fix URL construction bug that caused the &#8216;change all members&#8217; subscription level&#8217; link to be broken in some cases.</li>\n<li>Improve encoding of characters in notification emails.</li>\n</ul>\n<h4>4.2.1</h4>\n<ul>\n<li>Update BP 12.0 polyfills to fix some redirect issues.</li>\n</ul>\n<h4>4.2.0</h4>\n<ul>\n<li>Compatibility with BuddyPress 12.0+ and its new system for building URLs using WP&#8217;s Rewrites API.</li>\n<li>Dropped support for versions of BuddyPress older than 2.1.</li>\n<li>Improved readability of single-item email templates by removing an extraneous colon when there&#8217;s no user-provided content related to the activity item.</li>\n<li>Fixed bug that caused replies to group-linked activity comments to be misattributed in some cases.</li>\n</ul>\n<h4>4.1.1</h4>\n<ul>\n<li>Fixed bug introduced in 4.1.0 that broke AJAX subscription level changes.</li>\n</ul>\n<h4>4.1.0</h4>\n<ul>\n<li>Introduced interface where site admin can set the global default subscription level.</li>\n<li>Introduced new filters that make it easier to disable subscription levels globally.</li>\n<li>Removed the stripping of links in user-generated portions of outgoing emails.</li>\n<li>Internationalization improvements.</li>\n<li>Adjustments to Dashboard panel to deemphasize legacy &#8220;migration&#8221; tasks.</li>\n<li>Fixed bug that caused <code>restore_current_blog()</code> to be called when unavailable.</li>\n<li>Improved the triggering of the immediate send queue, to avoid unnecessary runs.</li>\n<li>Only install BPGES email templates if they don&#8217;t exist. This prevents duplicates on update.</li>\n<li>Improved the way that URLs are escaped when generating unsubscribe links.</li>\n<li>Added <code>$group_id</code> parameter to <code>ass_group_unsubscribe_links()</code> that allow for greater customization.</li>\n</ul>\n<h4>4.0.4</h4>\n<ul>\n<li>Fixed regression in 4.0.3 that caused activity action to be blank in outgoing emails.</li>\n</ul>\n<h4>4.0.3</h4>\n<ul>\n<li>Improved PHP 8+ compatibility.</li>\n<li>Improved handling of &#8220;action&#8221; strings when generating email text.</li>\n<li>Improved handling of click events when using group-header subscription interface.</li>\n</ul>\n<h4>4.0.2</h4>\n<ul>\n<li>Migrated subscription options markup to a template file that can be overridden in a child theme, for greater customizability.</li>\n<li>Improved filters for values used when generating email text and sendng emails.</li>\n<li>Fixed bug that caused BP email templates to be reinstalled during some upgrades.</li>\n</ul>\n<h4>4.0.1</h4>\n<ul>\n<li>Improved cleanup when a WP user is deleted.</li>\n<li>Avoid duplicate notifications when a bbPress topic or reply is reapproved by the admin.</li>\n<li>Timezone improvements.</li>\n<li>Improved compatibility with jQuery 3.x.</li>\n<li>Fix bug that could cause certain translatable strings not to be loaded in time.</li>\n<li>Improvements to avoid timeouts and other issues during async send batches.</li>\n<li>Improved formatting for digest content.</li>\n</ul>\n<h4>4.0.0</h4>\n<ul>\n<li>Overhaul markup for subscription settings panel, for better responsiveness and accessibility.</li>\n<li>Fix bug that could cause incorrect information to be pulled for bp-groupblog activity items.</li>\n<li>Fix bug that can cause empty upload directories to be created in some cases.</li>\n<li>Allow BP email_type to be filtered.</li>\n<li>Introduce <code>bpges_force_immediate_admin_notice()</code>, allowing plugins to force admin-sent emails to go out to all members regardles of their subscription setting.</li>\n<li>Fix bug that caused duplicate notices in the case of updated group details.</li>\n<li>Improved handling of local times when building digest.</li>\n<li>Ensure that all non-public links in digest emails are wrapped in a login URL.</li>\n<li>Add ability to modify content-cleanup routine on a per-activity basis.</li>\n<li>Remove duplicate content filtering when sending admin notice.</li>\n<li>Improved compatibility with latest versions of BuddyPress.</li>\n<li>Add filter for just-in-time filtering of digest items on a per-user basis.</li>\n<li>Remove legacy bp-forums function checks.</li>\n<li>Improve CSS selectors in group settings radio buttons.</li>\n<li>Some hardening against potential CSRF attacks.</li>\n<li>Improved stylability for View links in digests.</li>\n</ul>\n<h4>3.9.4</h4>\n<ul>\n<li>Fix bug that could trigger fatal errors in some upgrade situations.</li>\n</ul>\n<h4>3.9.3</h4>\n<ul>\n<li>Improvements to the way that the 3.9 update admin notice is shown on Multisite.</li>\n<li>Improvements to user domain caching.</li>\n<li>Improved data cleanup when a user leaves a group or when user account is deleted.</li>\n<li>Improved behavior of email queue so that {ges.subject} tokens work properly in async send batches.</li>\n<li>Ensure that bp-groupblog emails can be sent with HTML content.</li>\n<li>Updated nl_NL translation.</li>\n</ul>\n<h4>3.9.2</h4>\n<ul>\n<li>Improvements to CLI 3.9 migration tools.</li>\n<li>Improvements to the way that 3.9 migration admin notices are displayed</li>\n<li>Avoid fatal errors during activation when required BP components are not activated</li>\n</ul>\n<h4>3.9.1</h4>\n<ul>\n<li>Improvements to 3.9 migration routine.</li>\n<li>Updated nl_NL translation.</li>\n</ul>\n<h4>3.9.0</h4>\n<ul>\n<li>Move to a new system for storing subscription and digest data, for improved performance and scalability</li>\n<li>Improve the ?sum=1 debugging tool, with support for <code>user_ids</code> and <code>user_count</code> URL paramaters.</li>\n<li>Add the ability to log debugging information about outgoing messages, using the <code>BPGES_DEBUG</code> constant. See https://github.com/boonebgorges/buddypress-group-email-subscription/wiki/How-to-troubleshoot-missing-emails</li>\n<li>Require a form submission when clicking on the Unsubscribe link in email footers.</li>\n<li>Move to the wordpress.org translation infrastructure.</li>\n<li>Improve compatibility with new versions of PHP.</li>\n<li>Improve admin-facing notices when minimum requirements (BP components, PHP version) are not met.</li>\n<li>Localization improvements.</li>\n<li>Accessibility improvements for user settings interface.</li>\n<li>Fix bug that could prevent hidden activity items from being fetched when generating digest text.</li>\n</ul>\n<h4>3.8.2</h4>\n<ul>\n<li>Improve logic in activation routine, to avoid fatal errors in cases where load order is non-standard.</li>\n</ul>\n<h4>3.8.0</h4>\n<ul>\n<li>Drop support for PHP 5.2, and improve support for PHP 7.2.</li>\n<li>Allow group admin sections to be customized via theme templates.</li>\n<li>Add attachment links when generated by GD bbPress Attachments.</li>\n<li>Improved digest queue cleanup, so that items are only removed from the queue when they&#8217;re actually added to a digest.</li>\n<li>Improved unsubscription on group leave/remove for better functionality with third-party automated group membership tools.</li>\n<li>Fix bug that caused users to be subscribed to groups when being banned.</li>\n<li>Improved filters for controlling digest vs immediate notifications on a per-user basis.</li>\n<li>Ensure that users set up to receive bbPress self-notifications receive notifications that match their digest preferences.</li>\n<li>Improved filters for login redirect URL.</li>\n<li>Improved filters for group subscriptions.</li>\n<li>Improvements to &#8216;ass_digest_format_item_group&#8217; filter.</li>\n</ul>\n<h4>3.7.2</h4>\n<ul>\n<li>Fix bug that could cause fatal errors when activating without BuddyPress.</li>\n<li>Improve data passed to filters.</li>\n<li>Fix invalid form markup.</li>\n<li>Introduce new filters for disabling &#8220;Email Notice&#8221; and &#8220;Welcome Email&#8221; sections</li>\n<li>Add CSS clases to HTML elements in digests.</li>\n<li>Improve handling of deleted activity items when generating digests.</li>\n<li>Fix some spelling errors.</li>\n<li>Improve handling of default subscription level filters.</li>\n</ul>\n<h4>3.7.1</h4>\n<ul>\n<li>Fix incorrect activity comment permalinks in digest emails.</li>\n<li>Use login redirect links in digest emails, for improved navigation when not logged in.</li>\n<li>Improve compatibility with non-standard Multisite configurations.</li>\n<li>Improve compatibility with PHP 7.1+.</li>\n<li>Improve compatibility with BP 2.5+ function signatures.</li>\n<li>Improve HTML character encoding in digests.</li>\n</ul>\n<h4>3.7.0</h4>\n<ul>\n<li>Add support for BuddyPress HTML emails, available since BuddyPress 2.5. (View the accompanying wiki article for more info &#8211; https://github.com/boonebgorges/buddypress-group-email-subscription/wiki/Email-Tokens)</li>\n<li>Reduce the amount of code loaded by GES on any given page.</li>\n<li>Fix issue with the email options popup being displayed automatically when changing the group filter or when clicking on a paginated link.</li>\n<li>Do not send email to a banned group member.</li>\n<li>Improve JavaScript event binding for better compatibility with AJAX page loading</li>\n<li>Pass user information to &#8216;ass_welcome_email&#8217; filter.</li>\n<li>Add Catalan translation</li>\n<li>Admin menu moved to &#8220;Settings &gt; BP Group Email Options&#8221; for those using BP 1.6+.</li>\n<li>Drop support for BuddyPress 1.2.</li>\n</ul>\n<h4>3.6.1</h4>\n<ul>\n<li>Fix bug that could cause fatal error when sending digests in some cases.</li>\n<li>Improve appearance of &#8220;Get email updates&#8221; link in directories when using Twenty* themes.</li>\n<li>Add filter that enables JS/CSS assets to be loaded in custom locations.</li>\n<li>Update Swedish translation.</li>\n<li>Update German translation.</li>\n</ul>\n<h4>3.6.0</h4>\n<ul>\n<li>Introduce <code>ass_generate_notification()</code>, a generic handler for sending notifications.</li>\n<li>Add Hebrew translation.</li>\n</ul>\n<h4>3.5.2</h4>\n<ul>\n<li>Adds a filter to control whether a specific user should receive immediate email notification of a given item.</li>\n<li>Fixes bug that prevented users from saving the &#8220;No email&#8221; setting in some cases.</li>\n<li>Reorders the way the group extension is bootstrapped.</li>\n<li>Removes hardcoded reference to default group setting, in case this value is filtered by a plugin.</li>\n<li>Fix incorrect group link in digest emails.</li>\n</ul>\n<h4>3.5.1</h4>\n<ul>\n<li>Localization improvements</li>\n<li>Fixes bug that could cause fatal error in some bbPress configurations</li>\n<li>Fixes bug that caused incorrect links in some digest emails</li>\n<li>Fixes bug that caused some email subscription settings not to be saved in some cases</li>\n</ul>\n<h4>3.5</h4>\n<ul>\n<li>Fixes bug so that user no longer gets an email for their own group activity update</li>\n<li>Improved email content parsing, so that the URLs contained in links are not completely removed from the email</li>\n<li>Improved JavaScript and CSS asset loading, for better cache busting</li>\n<li>Fixed bug that caused email footer to be repeated multiple times in certain cases</li>\n<li>Better support for plugin white labelling &amp; changed directory names</li>\n<li>Improved compatibility with the WP Better Emails plugin</li>\n<li>Update JS not to use deprecated jQuery.live()</li>\n<li>Improved compatibility with BuddyPress 2.2</li>\n<li>Better filters for customizing the format of digest emails, nav item visibility, and redirect URLs</li>\n</ul>\n<h4>3.4</h4>\n<ul>\n<li>Reinstate bbPress &#8220;Subscribe&#8221; option in forum threads for group members not subscribed to &#8220;All Mail&#8221;</li>\n<li>Performance improvements in daily and weekly digests</li>\n<li>Add support to manage each group member&#8217;s subscription in the WP admin dashboard&#8217;s &#8220;Groups&#8221; backend interface (only in BP 1.8+)</li>\n<li>Improves redirect behavior for group notification links</li>\n<li>Use native BP user meta functions for better multi-network compatibility</li>\n<li>Fixes bug where users may have received other user&#8217;s digests</li>\n<li>Fixes bug where group creator was not subscribed to the email setting selected during group creation</li>\n<li>Fixes bug where self-notifications may not have worked in some instances</li>\n<li>Fixes bug with quotes and apostrophes not being stripped from admin notices and welcome emails</li>\n</ul>\n<h4>3.3.3</h4>\n<ul>\n<li>Updated nl_NL translation</li>\n</ul>\n<h4>3.3.2</h4>\n<ul>\n<li>Updated nl_NL translation</li>\n<li>Updated de_DE translation</li>\n<li>Fixed some textdomains</li>\n</ul>\n<h4>3.3.1</h4>\n<ul>\n<li>Fixes a bug that caused duplicate bbPress 2.x digest notifications</li>\n<li>Improved compatibility with PHP 5.4 and WP 3.5</li>\n</ul>\n<h4>3.3</h4>\n<ul>\n<li>Better support for bbPress 2.x group forums</li>\n<li>Fixes Weekly Summary emails</li>\n<li>Improves redirect behavior in View links related to forum topics in private/hidden groups</li>\n<li>Added filters to digest content for improved customizability</li>\n<li>Improved behavior with BP_ENABLE_MULTIBLOG mode</li>\n</ul>\n<h4>3.2.3</h4>\n<ul>\n<li>Fixes lame duplicate bug reintroduced in 3.2.2</li>\n<li>Updates Danish translation</li>\n</ul>\n<h4>3.2.2</h4>\n<ul>\n<li>Fixes main site link in digest emails</li>\n<li>Breaks up email content cleanup for better control by plugins</li>\n<li>Abstracts activity_type checking into a separate function, for greater control by plugins and themes</li>\n<li>Disables topic subscription in bbPress 2.x when inside of a group, to avoid duplicate messages</li>\n</ul>\n<h4>3.2.1</h4>\n<ul>\n<li>Fixes bug in the implementation of forum post digests</li>\n<li>Fixes backward compatibility issue with filters in forum reply and topic functions</li>\n</ul>\n<h4>3.2</h4>\n<ul>\n<li>Rewrote digest emailer to use wp_mail(), for better compatibility with WP SMTP plugins</li>\n<li>Better compatibility with BP 1.5+ native functions</li>\n<li>Refactored forum notification function, to work around bugs related to double posts. Many thanks to r-a-y for his work on this</li>\n</ul>\n<h4>3.1.2</h4>\n<ul>\n<li>Corrected a bug in the way digest links are constructed</li>\n<li>Added Lithuanian translation</li>\n</ul>\n<h4>3.1.1</h4>\n<ul>\n<li>Improved styling of subscription settings popup on My Groups pages</li>\n<li>More attempts at improving the loading of JS and CSS across BP versions</li>\n</ul>\n<h4>3.1</h4>\n<ul>\n<li>Added the ability to unsubscribe from single group notifications directly from the email without needing to be logged in. This is on by default. * Also added the ability to unsubscribe from all group email notifications. This feature needs to be enabled in the plugin admin page.</li>\n<li>Added a new group welcome email that gets sent out the moment someone joins a group &#8211; regardless of the email subscription setting. Edit this in the group admin -&gt; email options.</li>\n</ul>\n<h4>3.0.1</h4>\n<ul>\n<li>Fixes bug that may have caused deleted activity items to appear in digests in some cases</li>\n<li>Fixes some notices</li>\n</ul>\n<h4>3.0</h4>\n<ul>\n<li>Adds filter for email digest CSS</li>\n<li>Rewrites digest logic for fewer bugs and greater efficiency</li>\n</ul>\n<h4>2.9.9</h4>\n<ul>\n<li>Added Danish translation, new subject filters</li>\n</ul>\n<h4>2.9.8</h4>\n<ul>\n<li>Fixes bug that prevented admin/manage-members/ action links from working</li>\n</ul>\n<h4>2.9.7</h4>\n<ul>\n<li>More fixes for 1.5+ compatibility. Props king76</li>\n</ul>\n<h4>2.9.6</h4>\n<ul>\n<li>Fixed a number of PHP notices</li>\n<li>Fixed the admin Send To Group functionality in BP 1.5+</li>\n</ul>\n<h4>2.9.5</h4>\n<ul>\n<li>Added Farsi translation. Thanks, Vahid!</li>\n</ul>\n<h4>2.9.4</h4>\n<ul>\n<li>Added additional filters to digest builder</li>\n</ul>\n<h4>2.9.3</h4>\n<ul>\n<li>Added updated Spanish translation</li>\n</ul>\n<h4>2.9.2</h4>\n<ul>\n<li>Fixed some syntax errors that may have caused problems with digest formatting</li>\n</ul>\n<h4>2.9.1</h4>\n<ul>\n<li>Fixed bug that may have caused scripts and styles not to be loaded on BP 1.2.x</li>\n<li>Fixed some PHP notices</li>\n<li>Fixed bug that might have caused BPGES javascript to load before jQuery in some cases</li>\n</ul>\n<h4>2.9</h4>\n<ul>\n<li>Full support for BuddyPress 1.5</li>\n<li>Code cleanup and normalization</li>\n</ul>\n<h4>2.8.7</h4>\n<ul>\n<li>Tweaked email text so that contentless notifications don&#8217;t get empty quotation marks</li>\n</ul>\n<h4>2.8.6</h4>\n<ul>\n<li>Added simple activity item caching to digests to reduce database queries at digest time</li>\n<li>Fixed bug that caused hidden items not to be sent in digests</li>\n</ul>\n<h4>2.8.5</h4>\n<ul>\n<li>Added better brazilian portuguese translation, improved error checking to see if user has email before emailing them</li>\n</ul>\n<h4>2.8.5</h4>\n<ul>\n<li>Fixed bug introduced in latest BP version where when an group admin manually removes a group member in Group Admin -&gt; Manage Members -&gt; Remove from group, the user kept getting emails</li>\n<li>Added translation strings for the javascript mute/follow</li>\n<li>Minor code cleanup to how digest/summaries are stored</li>\n<li>Added Russian translation</li>\n<li>Added filter to digest subject line</li>\n<li>Fixed error where only site admins could send out instant emails and not group admins</li>\n</ul>\n<h4>2.8.4</h4>\n<ul>\n<li>Added German Translation</li>\n</ul>\n<h4>2.8.3</h4>\n<ul>\n<li>Fixed issue where activity updates had html in the email subject line</li>\n</ul>\n<h4>2.8.2</h4>\n<ul>\n<li>Fixes Dashboard panel to be compatible with WP 3.1/BP 1.2.8 multisite. Also adds a helpful &#8220;settings saved&#8221; message to dashboard panel.</li>\n</ul>\n<h4>2.8.1</h4>\n<ul>\n<li>Fixed issue when plugin was hiding new group activity update comments</li>\n</ul>\n<h4>2.8</h4>\n<ul>\n<li>Group activity replies are now registered in the plugin and emailed/digested accordingly</li>\n<li>Users can now choose to get emails for posts they make (in their settings page)</li>\n<li>Useful filters were added &#8211; you can now add a header or footer to the digest emails</li>\n<li>Fixed a bug where group names were sometimes missing for private groups in the digest</li>\n<li>Fixed minor bug where people on weekly digest who followed a single topic don&#8217;t get any emails</li>\n<li>Added swedish translation.</li>\n</ul>\n<h4>2.7.9</h4>\n<ul>\n<li>Now translated in japanese, spanish, french, portuguese, italian and dutch. no changes to the code on this update.</li>\n</ul>\n<h4>2.7.8</h4>\n<ul>\n<li>Internationalization bug finally fixed. Spanish and Italian now included. &#8216;Email Options&#8217; is now translatable</li>\n</ul>\n<h4>2.7.7</h4>\n<ul>\n<li>Internationalization bug fixed.</li>\n</ul>\n<h4>2.7.6</h4>\n<ul>\n<li>The cron schedule is now fully fixed, thanks to gvvaughan. plus the plugin is now fully internationalized thanks to chestnut_jp.</li>\n</ul>\n<h4>2.7.5</h4>\n<ul>\n<li>The plugin is now fully internationalized thanks to chestnut_jp! Please send other language po and mo files to deryk@bluemandala.com and i&#8217;ll include them.</li>\n<li>load_plugin_textdomain is used also. NOTE: due to a bug in buddypress 1.2.6 users will not be able to see their notifications page (see here for a fix https://trac.buddypress.org/changeset/3375)</li>\n</ul>\n<h4>2.7.3</h4>\n<ul>\n<li>Fixed bug where hidden groups would not have names in digest, added link to view digest queue in back end (add ?sum=1 to your url to see queue)</li>\n</ul>\n<h4>2.7.2</h4>\n<ul>\n<li>Fixed bug causing wp_cron to misbehave</li>\n</ul>\n<h4>2.7.1</h4>\n<ul>\n<li>Fixed bug where digests were not fired &#8211; the next digest will combine all missed ones.</li>\n<li>Fixed bug where edited topics were removed from digest, added note and link at end of users&#8217; notification settings pointing them to place they can edit their group subscriptions</li>\n</ul>\n<h4>2.7</h4>\n<ul>\n<li>Major re-write to the digest code, implemented caching and drastically sped up processing, other minor changes.</li>\n<li>See (but not send) what is in the digest queue by visiting mydomain.com/sum=1</li>\n</ul>\n<h4>2.6.4</h4>\n<ul>\n<li>Added &#8216;change email options&#8217; link under each group in digest</li>\n</ul>\n<h4>2.6.3</h4>\n<ul>\n<li>Rewrote the email sending so digest emails are read properly in Outlook.</li>\n<li>Added a link at bottom of digests to go to my groups to edit notification settings.</li>\n</ul>\n<h4>2.6.2</h4>\n<ul>\n<li>Fixed sneaky bug where people who requested access to a private group were subscribed to default setting.</li>\n</ul>\n<h4>2.6.1</h4>\n<ul>\n<li>Improves wording of join pull down menu, fix bad follow/mute link.</li>\n</ul>\n<h4>2.6</h4>\n<ul>\n<li>Allow site admins to set the subscription level for all current users of a group (in manage members)</li>\n</ul>\n<h4>2.5.5</h4>\n<ul>\n<li>Put back text domain, added more translation hooks</li>\n</ul>\n<h4>2.5.4</h4>\n<ul>\n<li>Added css class names, fixed duplication in email display when sending New Topics email</li>\n</ul>\n<h4>2.5.2</h4>\n<ul>\n<li>Fixed class name</li>\n</ul>\n<h4>2.5.1</h4>\n<ul>\n<li>Fixed silly bug where &#8220;th&#8221; tag was not showing up in group forum directory to match the extra td tag for follow/mute. sorry for the delay.</li>\n</ul>\n<h4>2.5</h4>\n<ul>\n<li>Fixed a bug where digest emails were cumulative. fixed bug where editing an item would resend the notification email.</li>\n<li>Added filter hooks to digest section</li>\n</ul>\n<h4>2.4.4</h4>\n<ul>\n<li>Improved the &#8220;Follow this topic&#8221; text in New Topic subscription emails so the user knows they won&#8217;t get replies and gives them instructions if they do.</li>\n</ul>\n<h4>2.4.3</h4>\n<ul>\n<li>Added ability for group admins to change the subscription settings for users in their group. Added backend options to enable or disable this function.</li>\n<li>Also added backend options to enable group admin override emails.</li>\n</ul>\n<h4>2.4.2</h4>\n<ul>\n<li>Fixed minor bug about leaving groups your not subscribed to</li>\n</ul>\n<h4>2.4.1</h4>\n<ul>\n<li>Made daily digests and weekly summaries HTML/Plain text multipart emails</li>\n</ul>\n<h4>2.3.4</h4>\n<ul>\n<li>Added quotes around topic name in emails and added setting status at bottom of emails</li>\n</ul>\n<h4>2.3.2</h4>\n<ul>\n<li>Javascript fix for subscribe options. removed beta notice.</li>\n</ul>\n<h4>2.3</h4>\n<ul>\n<li>Plugin finished and ready for public usage.</li>\n</ul>\n<h4>2.2</h4>\n<ul>\n<li>Plugin complete re-write finished.</li>\n<li>Digest function added, plus too many features to list here.</li>\n</ul>\n<h4>2.1</h4>\n<ul>\n<li>Group admins can set default subscription level</li>\n</ul>\n<h4>2.0</h4>\n<ul>\n<li>Plugin totally re-written by Deryk Wenaus, with new structure and name</li>\n</ul>\n<h4>1.3</h4>\n<ul>\n<li>Added support for topic-by-topic settings for forum notifications</li>\n</ul>\n<h4>1.2</h4>\n<ul>\n<li>Tagged stable release.</li>\n<li>Added Boone Gorges as an author.</li>\n<li>Made &#8220;do a dance&#8221; installation step optional.</li>\n</ul>\n<h4>1.1</h4>\n<ul>\n<li>Fixed directory rename causing white screen of death.</li>\n</ul>\n<h4>1.0</h4>\n<ul>\n<li>Initial release.  Please test and provide feedback.  Not recommended for production sites.</li>\n</ul>\n"
    },
    "short_description": "This powerful plugin allows users to receive email notifications of group activity. Weekly or daily digests are available.",
    "description": "<p>This powerful plugin allows users to receive email notifications of group activity. Weekly or daily digests are available. Each user can choose how they want to subscribe to their groups.</p>\n<p>Please note that this plugin requires BuddyPress, as well as the BuddyPress Groups and Activity components.</p>\n<p>EMAIL SUBSCRIPTION LEVELS<br />\nThere are 5 levels of email subscription options:</p>\n<ol>\n<li>No Email &#8211; Read this group on the web</li>\n<li>Weekly Summary Email &#8211; A summary of new topics each week</li>\n<li>Daily Digest Email &#8211; All the day&#8217;s activity bundled into a single email</li>\n<li>New Topics Email &#8211; Send new topics as they arrive (but don&#8217;t send replies)</li>\n<li>All Email &#8211; Send all group activity as it arrives</li>\n</ol>\n<p>DEFAULT SUBSCRIPTION STATUS<br />\nGroup admins can choose one of the 5 subscription levels as a default that gets applied when new members join.</p>\n<p>DIGEST AND SUMMARY EMAILS<br />\nThe daily digest email is sent every morning and contains all the emails from all the groups a user is subscribed to. The digest begins with a helpful topic summary. The weekly summary email contains the topic titles from the past week by default. Summary and digest timing can be configured in the back end. (The admin can view a sample of the digests and summaries in the queue by going adding this to your url: mydomain.com/sum=1. This won&#8217;t send emails just show what will be sent)</p>\n<p>HTML EMAILS<br />\nThe digest and summary emails are sent out in multipart HTML and plain text email format. This makes the digest much more readable with better links. The email is multipart so users who need only plain text will get plain text.</p>\n<p>EMAILS FOR TOPICS I&#8217;VE STARTED OR COMMENTED ON (only available with BuddyPress legacy discussion forums)<br />\nUsers receive email notifications when someone replies to a topic they create or comment on (similar to Facebook). This happens whether they are subscribed or not. Users can control this behaviour in their notifications page.</p>\n<p>TOPIC FOLLOW AND MUTE (only available with BuddyPress legacy discussion forums)<br />\nUsers who are not fully subscribed to a group (ie. maybe they are on digest) can choose to get immediate email updates for specific topic threads. Any subsequent replies to that thread will be emailed to them. In an opposite way, users who are fully subscribed to a group but want to stop getting emails from a specific (perhaps annoying) thread can choose to mute that topic.  bbPress plugin users can utilize the &#8220;Subscribe&#8221; / &#8220;Notify me of follow-up replies via email&#8221; option.</p>\n<p>ADMIN NOTIFICATION<br />\nGroup admins can send out an email to all group members from the group&#8217;s admin section. This feature is helpful to quickly communicate to the whole group, but it should be used with caution.</p>\n<p>GROUP ADMINS CAN SET SUBSCRIPTION LEVEL<br />\nGroup admins can set the subscription level for existing users on the group&#8217;s &#8220;Admin &gt; Manage Members&#8221; page &#8211; either one by one or all at once.</p>\n<p>SPAM PROTECTION<br />\nTo protect against spam, you can set a minimum number of days users need to be registered before their group activity will be emailed to other users. This feature is off by default, but can be enabled in the admin.</p>\n<p>TRANSLATORS</p>\n<ul>\n<li>Brazilian Portuguese &#8211; www.about.me/dennisaltermann (or www.congregacao.net)</li>\n<li>Catalan &#8211; Sara Arjona Téllez</li>\n<li>Danish &#8211; Morten Nalholm</li>\n<li>Dutch &#8211; Anja werkgroepen.net/wordpress, Tim de Hoog</li>\n<li>Farsi &#8211; Vahid Masoomi http://www.AzUni.ir</li>\n<li>French &#8211; http://www.claudegagne-photo.com, Sylvain Ghysens</li>\n<li>German &#8211; Peter Peterson, Thorsten Wollenhöfer, Jörg Lohrer</li>\n<li>Hebrew &#8211; Iggy Pritzker</li>\n<li>Italian &#8211; Stefano Russo</li>\n<li>Japanese &#8211; https://buddypress.org/community/members/chestnut_jp/</li>\n<li>Lithuanian &#8211; Vincent G http://www.Host1Free.com</li>\n<li>Russian &#8211; http://www.viaestvita.net/groups/</li>\n<li>Spanish &#8211; Williams Castillo, Gregor Gimmy</li>\n<li>Swedish &#8211; Thomas Schneider, Joakim Hising</li>\n</ul>\n<p>NOTE TO PLUGIN AUTHORS<br />\nIf your plugin posts updates to the standard BuddyPress activity stream, then group members who are subscribed via 3. Daily Digest and 5. All Email will get your updates automatically. However people subscribed as 2. Weekly Summary and 4. New Topic will not. If you feel some of your plugin&#8217;s updates are very important and want to make sure all subscribed members receive them, you can filter &#8216;ass_this_activity_is_important&#8217; and return TRUE when $type matches your activity. See the ass_this_activity_is_important() function in bp-activity-subscription-functions.phpfor more info.</p>\n<p>PLUGIN SUPPORTERS:<br />\nMajor supporters: shambhalanetwork.org &amp; commons.gc.cuny.edu<br />\nOther supporters: bluedotproductions.com</p>\n<p>PLUGIN DEVELOPMENT<br />\nFor bug reports or to add patches or translation files, please visit the <a href=\"https://github.com/boonebgorges/buddypress-group-email-subscription/\" rel=\"nofollow ugc\">GES Github page</a>.  Contributions are definitely welcome!</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.4.2.4.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/buddypress-group-email-subscription/assets/screenshot-1.png?rev=1832535",
            "caption": "Email Options on settings page"
        },
        {
            "src": "https://ps.w.org/buddypress-group-email-subscription/assets/screenshot-2.png?rev=1832535",
            "caption": "Email Options on other group pages"
        },
        {
            "src": "https://ps.w.org/buddypress-group-email-subscription/assets/screenshot-3.png?rev=1832535",
            "caption": "Email Options in Group Directory"
        },
        {
            "src": "https://ps.w.org/buddypress-group-email-subscription/assets/screenshot-4.png?rev=1832535",
            "caption": "Sample Email (HTML emails in future versions)"
        },
        {
            "src": "https://ps.w.org/buddypress-group-email-subscription/assets/screenshot-5.png?rev=1832535",
            "caption": "Follow and mute links in group forum (only available with BuddyPress legacy discussion forums)"
        },
        {
            "src": "https://ps.w.org/buddypress-group-email-subscription/assets/screenshot-6.png?rev=1832535",
            "caption": "Send Email Notice to entire group (admin only)"
        },
        {
            "src": "https://ps.w.org/buddypress-group-email-subscription/assets/screenshot-7.png?rev=1832535",
            "caption": "Admin Settings"
        }
    ],
    "tags": {
        "activities": "activities",
        "activity": "activity",
        "bp": "bp",
        "buddypress": "buddypress",
        "groups": "groups"
    },
    "stable_tag": "4.2.4",
    "versions": {
        "2.1b": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.1b.zip",
        "2.1b2": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.1b2.zip",
        "2.5.3": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.5.3.zip",
        "2.7.3": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.7.3.zip",
        "2.8": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.8.zip",
        "2.8.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.8.1.zip",
        "2.8.2": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.8.2.zip",
        "2.8.6": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.8.6.zip",
        "2.8.6.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.8.6.1.zip",
        "2.9": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.9.zip",
        "2.9.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.9.1.zip",
        "2.9.2": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.9.2.zip",
        "2.9.3": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.9.3.zip",
        "2.9.4": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.9.4.zip",
        "2.9.5": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.9.5.zip",
        "2.9.6": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.9.6.zip",
        "2.9.7": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.9.7.zip",
        "2.9.8": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.2.9.8.zip",
        "3.0": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.0.zip",
        "3.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.1.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.1.1.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.1.2.zip",
        "3.2": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.2.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.2.1.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.2.2.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.2.3.zip",
        "3.3": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.3.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.3.1.zip",
        "3.3.2": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.3.2.zip",
        "3.4": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.4.zip",
        "3.5": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.5.zip",
        "3.5.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.5.1.zip",
        "3.5.2": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.5.2.zip",
        "3.6.0": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.6.0.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.6.1.zip",
        "3.7.0": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.7.0.zip",
        "3.7.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.7.1.zip",
        "3.7.2": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.7.2.zip",
        "3.8.0": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.8.0.zip",
        "3.8.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.8.1.zip",
        "3.8.2": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.8.2.zip",
        "3.9.0": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.9.0.zip",
        "3.9.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.9.1.zip",
        "3.9.2": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.9.2.zip",
        "3.9.3": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.9.3.zip",
        "3.9.4": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.3.9.4.zip",
        "4.0.0": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.4.0.0.zip",
        "4.0.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.4.0.1.zip",
        "4.0.2": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.4.0.2.zip",
        "4.0.3": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.4.0.3.zip",
        "4.0.4": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.4.0.4.zip",
        "4.1.0": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.4.1.0.zip",
        "4.1.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.4.1.1.zip",
        "4.2.0": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.4.2.0.zip",
        "4.2.1": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.4.2.1.zip",
        "4.2.2": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.4.2.2.zip",
        "4.2.3": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.4.2.3.zip",
        "4.2.4": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.4.2.4.zip",
        "trunk": "https://downloads.wordpress.org/plugin/buddypress-group-email-subscription.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/buddypress-group-email-subscription.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 80,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "buddypress-group-email-subscription",
            "language": "el",
            "version": "4.2.3",
            "updated": "2023-11-02 10:46:46",
            "package": "https://downloads.wordpress.org/translation/plugin/buddypress-group-email-subscription/4.2.3/el.zip"
        }
    ]
}