{
    "name": "Canalplan",
    "slug": "canalplan-ac",
    "version": "5.31",
    "author": "<a href=\"https://steve.tty.org.uk\">Steve Atty</a>",
    "author_profile": "https://profiles.wordpress.org/steveatty/",
    "contributors": {
        "steveatty": {
            "profile": "https://profiles.wordpress.org/steveatty/",
            "avatar": "https://secure.gravatar.com/avatar/b80d0539e0fd817467a24e6a1429bda4?s=96&d=monsterid&r=g",
            "display_name": "Steve"
        }
    },
    "requires": "5.0",
    "tested": "6.4.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/canalplan-ac/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 10,
    "downloaded": 4758,
    "last_updated": "2024-04-28 10:19am GMT",
    "added": "2011-07-11",
    "homepage": "https://blogs.tty.org.uk/canalplan-plug-in/",
    "sections": {
        "description": "<p>This plugin allows you link your self hosted WordPress blog to the Canalplan AC website. You can import routes from the route planner and link your blog posts to the canalplan  gazetteer.</p>\n<h3>IMPORTANT</h3>\n<p>This plugin creates 9 tables in your database which occupy about 50MB of space.</p>\n<p>Due to changes in Google&#8217;s Maps API you need to have an API key to use the maps functionality of the plugin. Instructions on how to obtain an API key from Google can be found here:<br />\nhttps://developers.google.com/maps/documentation/javascript/get-api-key#get-an-api-key</p>\n<p>GoogleMaps are no longer supported as I do no have a key</p>\n<p>This plugin DOES NOT support BLOCKS</p>\n<h3>Features</h3>\n<ul>\n<li>Imports data from the Canalplan AC website so you have an up to date list of all canalplan locations / features etc.</li>\n<li>Easy linking to Canalplan AC Gazetteer entries.</li>\n<li>Easy inclusion of Googlemaps related to Canalplan AC locations.</li>\n<li>Easy inclusion of maps of complete waterways or sections of waterways based on Canalplan AC Data.</li>\n<li>Import Planned routes from Canalplan AC and create a &#8220;Cruising Log&#8221; of blog entries for the trip.</li>\n<li>Supports a &#8220;Trips&#8221; page which summarises all the sets of &#8220;Cruising Log&#8221; entries. This page also displays a map and a list of individual posts for a specific &#8220;Cruising Log&#8221;</li>\n<li>Bulk export of links to Canalplan AC Gazetteer entries for when you publish cruising log. </li>\n<li>Export of links to Canalplan AC Gazetteer entries when you publish / update a blog post.</li>\n<li>Crontab job to bulk export links once a week. Needed as referrer urls are ignored on HTTPS sites.</li>\n<li>Canalplan AC website automatically links back to relevant blog entries from Gazetteer pages.</li>\n<li>Works in &#8220;Classic&#8221; (Single blog) and Networked Blogs mode. Can be Network activated.</li>\n<li>Common set of Tables for Networked Blogs mode &#8211; so 1 set of tables per Networked Blogs install, not per blog.</li>\n<li>Global configuration for Networked blog installs can be done through a special multisite.php file.</li>\n</ul>\n",
        "installation": "<ol>\n<li>Install through the standard WordPress Plugin process.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress.</li>\n<li>Navigate to <code>Options</code> &rarr; <code>Canalplan AC</code> for configuration and follow the on-screen prompts.</li>\n</ol>\n",
        "changelog": "<h4>Version 5.31 (28/04/2024)</h4>\n<ul>\n<li>More changes to support Maplibre 4.x</li>\n<li>Code tidy up </li>\n</ul>\n<h4>Version 5.30 (24/03/2024)</h4>\n<ul>\n<li>Removed some obsolete code</li>\n<li>Changes to support Maplibre 4.x </li>\n</ul>\n<h4>Version 5.24 (24/03/2024)</h4>\n<ul>\n<li>plugin directory structure changes</li>\n<li>Adjustments to how file paths are determined</li>\n</ul>\n<h4>Version 5.23 (24/03/2024)</h4>\n<ul>\n<li>Changes to Map rendering javascript to solve missing variable error</li>\n<li>Removal of obsolete JS code and graphics</li>\n</ul>\n<h4>Version 5.22 (24/03/2024)</h4>\n<ul>\n<li>Changes to CP Data update processing to improve empty file handling</li>\n</ul>\n<h4>Version 5.21 (24/03/2024)</h4>\n<ul>\n<li>Changes to Place Map handling where nothing used as code</li>\n</ul>\n<h4>Version 5.20 (23/03/2024)</h4>\n<ul>\n<li>Major chages to CP Data update processing</li>\n</ul>\n<h4>Version 5.12 (23/03/2024)</h4>\n<ul>\n<li>Fixes broken update of canalplan_codes table which broke maps</li>\n</ul>\n<h4>Version 5.11 (23/03/2024)</h4>\n<ul>\n<li>Removes redundant files left over by accident</li>\n</ul>\n<h4>Version 5.10 (23/03/2024)</h4>\n<ul>\n<li>Significant changes to Canalplan AC Map rendering</li>\n<li>Location lookup loop back changed to async fetch</li>\n<li>Start Date calendar re-engineered</li>\n<li>Database Schema changes </li>\n<li>Additional configuration parameters in multisite config file to allow complete standalone version</li>\n</ul>\n<h4>Version 5.02 (17/03/2024)</h4>\n<ul>\n<li>Minor fixes to the Canalplan AC Map handling to fix load before style complete errors.</li>\n</ul>\n<h4>Version 5.01 (27/12/2023)</h4>\n<ul>\n<li>Minor fixes to the Canalplan AC Map handling</li>\n</ul>\n<h4>Version 5.00 (08/04/2023)</h4>\n<ul>\n<li>Adds Support for Canalplan AC Maps.</li>\n</ul>\n<h4>Version 4.32 (05/09/2021)</h4>\n<ul>\n<li>Fixes a problem with maintain routes.</li>\n</ul>\n<h4>Version 4.31 (10/07/2021)</h4>\n<ul>\n<li>Remove logic for handling different map servers.</li>\n</ul>\n<h4>Version 4.30 (10/07/2021)</h4>\n<ul>\n<li>Remove logic for handling different map servers.</li>\n</ul>\n<h4>Version 4.29 (110/07/2021)</h4>\n<ul>\n<li>Changes to data load to work round some timeout issues.</li>\n</ul>\n<h4>Version 4.28 (14/02/2021)</h4>\n<ul>\n<li>Changes to MySQL Geo commands.</li>\n</ul>\n<h4>Version 4.27 (02/11/2020)</h4>\n<ul>\n<li>Changes to MySQL Geo commands.</li>\n</ul>\n<h4>Version 4.26 (02/09/2019)</h4>\n<ul>\n<li>Adjustment to Location Widget</li>\n</ul>\n<h4>Version 4.25 (30/07/2019)</h4>\n<ul>\n<li>Minor tweaks to location page.</li>\n</ul>\n<h4>Version 4.24 (30/07/2019)</h4>\n<ul>\n<li>Changes to handle structural changes in the data coming from Canalplan</li>\n<li>Adjustments to Route Importing and Route Management to fix a long standing bug to do with overnight stops</li>\n<li>Adds support for new Android GPS app.</li>\n</ul>\n<h4>Version 4.23 (12/05/2019)</h4>\n<ul>\n<li>Adjustment to tbe absolute difference check for lat / lon to avoid rogue lines on maps</li>\n<li>Fixed some logic pulling places back from the database when adding tags into a post.</li>\n</ul>\n<h4>Version 4.22 (02/03/2019)</h4>\n<ul>\n<li>Minor tweak to the Diagnostics page</li>\n<li>Minor tweak to the get new data functionality</li>\n</ul>\n<h4>Version 4.21 (18/02/2019)</h4>\n<ul>\n<li>Fixed bug where Canalplan names with &amp; in them lost their IDs when being pulled from the database.</li>\n</ul>\n<h4>Version 4.20 (17/02/2019)</h4>\n<ul>\n<li>Tidied up code removing a lot of commented out obsolete code</li>\n<li>Fixed a lot of undefined index and other errors when error reporting set to everything</li>\n<li>Added uninstall functionality to remove tables when plugin deleted</li>\n<li>Added Delete All functionality to Favourites and Manage Routes</li>\n</ul>\n<h4>Version 4.10 (16/02/2019)</h4>\n<ul>\n<li>Moved the Data pull from a single sqlite file to multiple JSON files.  This should get round problems where CURL execution time is limited and the connection is slow.</li>\n</ul>\n<h4>Version 4.03 (16/02/2019)</h4>\n<ul>\n<li>More tweaks to the curl timeout parameters.</li>\n</ul>\n<h4>Version 4.02 (16/02/2019)</h4>\n<ul>\n<li>More tweaks to the curl timeout parameters.</li>\n</ul>\n<h4>Version 4.01 (16/02/2019)</h4>\n<ul>\n<li>Added some set_time_limit calls to try to work round timeouts when loading the main data.</li>\n<li>Data age check commented out to allow repeated attempts to reload.</li>\n</ul>\n<h4>Version 4.00 (11/02/2019)</h4>\n<ul>\n<li>Following all the curl tweaks and code changes it seemed only right to move to version 4.00.</li>\n</ul>\n<h4>Version 3.67 (02/02/2019)</h4>\n<ul>\n<li>Adjustments to CURL parameters.</li>\n</ul>\n<h4>Version 3.66 (02/02/2019)</h4>\n<ul>\n<li>HTTP Header size and contents added to diagnostics page.</li>\n</ul>\n<h4>Version 3.65 28/01/2019</h4>\n<ul>\n<li>Change code where we use the uploads directory</li>\n<li>Moved hardcoded upload relative paths to ones based off ABSPATH</li>\n<li>Add upload directory details and exist check to diagnostics</li>\n</ul>\n<h4>Version 3.64 28/01/2019</h4>\n<ul>\n<li>More debug round wp_remote_get and my new fuction.</li>\n</ul>\n<h4>Version 3.63 28/01/2019</h4>\n<ul>\n<li>New standardised procedure which basically wraps wp_remote_get to simplify coding.    </li>\n<li>Complete removal of remote calls not using wp_remote_get</li>\n<li>More diagnostics added to the diagnostics screen</li>\n<li>Fix to longstanding error when rendering multiple maps on a single page</li>\n</ul>\n<h4>Version 3.62 27/01/2019</h4>\n<ul>\n<li>Commented out the data age override which I use for testing and had left enabled.</li>\n<li>Removes lots of old tag versions from SVN.</li>\n<li>Adds Assets folder with new screen shots and application Icon.</li>\n<li>Fixed Location Fetch from Canalplan to use wp_remote_get</li>\n<li>Fixed Curl override which wasn&#8217;t working.</li>\n<li>Fixed release date &#8211; what can I say&#8230; worrying too much about things at work!</li>\n</ul>\n<h4>Version 3.61 29/01/2019</h4>\n<ul>\n<li>Moved some more calls to wp_remote_get</li>\n<li>Added CURL override parameters to see if it fixes a curl timeout issue</li>\n<li>Revised documentation </li>\n</ul>\n<h4>Version 3.60 28/01/2019</h4>\n<ul>\n<li>Confirmed working against WordPress 5.x</li>\n<li>Added support for Gutenberg (Plugin or native). Only works in Classic blocks or Code Edit mode. Inserts at END of block not at current cursor position</li>\n<li>Works if Gutenberg disabled using the Classic Editor plugin</li>\n<li>Works on WordPress &lt; 5 when Gutenberg is not installed</li>\n<li>Changed Polyline data collection as Canalplan no longer uses Polylines but plugin does </li>\n<li>Moved all remote calls to use wp_remote_get and added some error handling round the call</li>\n<li>Fixed missing overnight markers in summary maps.</li>\n</ul>\n<h4>Version 3.50 30/06/2018</h4>\n<ul>\n<li>Minor bug fixes and code tweaks.</li>\n</ul>\n<h4>Version 3.49 22/09/2017</h4>\n<ul>\n<li>Fixed problem with re-importing routes where it kept overwriting the updated route</li>\n<li>More fixes to remove undefined indexes and variables.</li>\n</ul>\n<h4>Version 3.48 22/09/2017</h4>\n<ul>\n<li>Updated Location Widget to use new method and changed depricated PHP code</li>\n<li>Multiple changes to remove errors on undefined array indexes.</li>\n</ul>\n<h4>Version 3.47 21/09/2017</h4>\n<ul>\n<li>Removed some old code as part of a tidy up process</li>\n<li>Fixed an obscure bug in the google map rendering code.</li>\n</ul>\n<h4>Version 3.46 21/09/2017</h4>\n<ul>\n<li>Confirmed OK with 4.8.2</li>\n<li>Fixed a problem with the DB upgrade process.</li>\n<li>Moved to HTTPS for Canalplan URLs</li>\n<li>Moved gazetteer to place in canalplan URLs</li>\n</ul>\n<h4>Version 3.45 21/05/2017</h4>\n<ul>\n<li>fixed a typo in an admin url</li>\n</ul>\n<h4>Version 3.44 11/03/2017</h4>\n<ul>\n<li>fixed a typo in one of the create table scripts.</li>\n</ul>\n<h4>Version 3.43 11/03/2017</h4>\n<ul>\n<li>Moved Google Maps calls to HTTPS to stop mixed content warnings on HTTPS sites</li>\n<li>Added Google Maps API key support (Maps will run without it but it complains). See https://developers.google.com/maps/documentation/javascript/get-api-key for more details. </li>\n<li>Added an extra OG tag handler so the trip pages give a better summary.</li>\n</ul>\n<h4>Version 3.42 05/02/2017</h4>\n<ul>\n<li>Database Schema to version 2.</li>\n<li>Added support for mutiple bloggedroute pages per blog &#8211; uses a new route tag field on the Manage Route page</li>\n<li>Fixed some multi-site only option calls that had got missed somewhere along the line</li>\n<li>Fixed a long standing problem with routeslugs in single blog mode.</li>\n<li>Route page when viewing a single route will replace the page title with the route title when theme supports it.</li>\n<li>Added extra parameter to the interface to Canalplan so that HTTPS sites can use the route planner import functions</li>\n<li>Added an &#8220;Update Canalplan on Publish&#8221; checkbox to the Canalplan box on the Edit Post Screen : This allows you to push an update of the canalplan location in a post when you publish it</li>\n<li>Added a daily cron task to do a bulk update to Canalplan. This is because HTTPS sites don&#8217;t pass referrer urls so the entries get aged out of canalplan.</li>\n</ul>\n<h4>Version 3.41 08/09/2016</h4>\n<ul>\n<li>Added an is_tag() check so that we don&#8217;t try to render maps on tag display pages &#8211; it breaks the location widget.</li>\n<li>Tweaks to the data updated time code</li>\n</ul>\n<h4>Version 3.40 17/04/2016</h4>\n<ul>\n<li>Looks like I messed up something on 3.30 so I&#8217;ve upped the version to 3.4 even though there aren&#8217;t any really differences.</li>\n</ul>\n<h4>Version 3.30 17/04/2016</h4>\n<ul>\n<li>Fixes silly mistake in versioning !!!</li>\n</ul>\n<h4>Version 3.3.1 17/04/2016</h4>\n<ul>\n<li>Removed some debug statements left in the DB update code.</li>\n</ul>\n<h4>Version 3.3 16/04/2016</h4>\n<ul>\n<li>Added DB maintenance code</li>\n<li>Added co-ordinates strings for each day in a route. Speeds up route rendering and gets round problems with Pling Points being re-used</li>\n<li>Changed Data Pull process to pull major to major place links as well as major to minor points. Gets round problems re-calculating distances.</li>\n<li>Added dates to information on Data updated times.</li>\n<li>Conformed 4.5 compatible.</li>\n<li>Added code to remove &#8220;rogue&#8221; co-ordinates from line plotting.</li>\n</ul>\n<h4>Version 3.22 06/10/2015</h4>\n<ul>\n<li>Removed some short PHP tags which had crept in somewhere along the line</li>\n</ul>\n<h4>Version 3.21 08/09/2015</h4>\n<ul>\n<li>Added Reference Table row counts to the diagnostics page.</li>\n<li>Added &#8220;Last Updated&#8221; detail to the diagnostics page</li>\n<li>Fixed an issue with the overnight marker code.</li>\n</ul>\n<h4>Version 3.20 05/09/2015</h4>\n<ul>\n<li>Fixed typo in mobile check</li>\n<li>Added ability to push updates to Canalplan when a post is published or updated.</li>\n</ul>\n<h4>Version 3.19 05/09/2015</h4>\n<ul>\n<li>Confirmed 4.3 compatible</li>\n<li>Added the ability to map imported route posts to existing posts ( but requires manual editing of posts to add summary tags</li>\n<li>Added Roue ID to the Route management page to make it easier to work out which route is which.</li>\n<li>Added Trip and Post details to the Diagnostics &#8211; displays post titles and links for each day of each trip.</li>\n</ul>\n<h4>Version 3.18 28/03/2015</h4>\n<ul>\n<li>Confirmed 4.2.2 compatible</li>\n<li>Changes to the Location Configuration Page so that None Backitude location updates propogate to Canalplan if selected</li>\n<li>Changes to the Location Configuration Page and location handling page to force a wp-supercache refresh if the plugin in installed. </li>\n<li>Adds support for mobile devices &#8211; on these the map width is always 100% of the view port. None mobile devices will use the user defined width.</li>\n<li>Change to the Bulk Notify so that it picks up the start and finish locations for the day.</li>\n<li>Moved some javascript to the footer to help improve page load times.</li>\n<li>Added Filters so that Jetpack creates OG:Description tags with place names in them instead of the [[CP tags</li>\n<li>Changes to the Map generation code to solve intermittent issues with map and &#8220;where are we&#8221; widget rendering.</li>\n</ul>\n<h4>Version 3.17 22/11/2014</h4>\n<ul>\n<li>Confirmed 4.0.1 compatible</li>\n<li>Fixed a bug where Posts in the WPMU site-search results picked up the containing page url rather than the actual post url</li>\n<li>Changes to short codes to include summary post in list of available posts</li>\n</ul>\n<h4>Version 3.16 17/08/2014</h4>\n<ul>\n<li>Changes to route import to include the summary post (if created) in the posts for that trip</li>\n<li>Changes to short codes to include summary post in list of available posts</li>\n<li>Unpublished posts were shown in the short codes if a route was published. Now only published Posts are shown as links</li>\n<li>Marker Places hidden from route management &#8211; unless they were set as an overnight when Importing the route.</li>\n<li>Fixed long standing bug relating to lock counts where flights are involved</li>\n<li>Fixed long standing bugs relating to stopping before or after lock flights</li>\n<li>Changes to route recalculation code to handle missing links (caused by importing a route using data points not in the local copy) which caused skewed values</li>\n</ul>\n<h4>Version 3.15 21/07/2014</h4>\n<ul>\n<li>Changes to Location Widget to stop missing values from blowing up all the googlemaps on the page</li>\n<li>Fixes to the location setting page to handle odd time differences appearing in Multisite installs</li>\n<li>Fixes to the location settings page to try to stop odd results when selecting one update option but using another.</li>\n</ul>\n<h4>Version 3.14 20/07/2014</h4>\n<ul>\n<li>Minor bug fixes to resolve some issues with the WPMUDEV global search plugin</li>\n<li>Minor bug fixes to the location screen to get rid of rogue slash characters appearing when manually setting location</li>\n<li>Remove diagnostic log writes from location code.</li>\n</ul>\n<h4>Version 3.13 19/07/2014</h4>\n<ul>\n<li>Location Updating now links through to Canalplan. So if you&#8217;ve liked and marked a boat for tracking on there then you can update your blog and canalplan at the same time</li>\n<li>Added New Short Code to link to Trip blog posts</li>\n<li>Other minor tweaks made.</li>\n</ul>\n<h4>Version 3.12 17/05/2014</h4>\n<ul>\n<li>Introduces Location updating using Backitude (an Android App) &#8211; allows you to automatically update your location using your mobile phone.</li>\n<li>Caches location so that the &#8220;where am I widget&#8221; doesn&#8217;t have to keep doing the intensive distance look ups.</li>\n</ul>\n<h4>Version 3.11 25/01/2014</h4>\n<ul>\n<li>Confirms WordPress 3.8.1 Compatibility</li>\n</ul>\n<h4>Version 3.10 15/12/2013</h4>\n<ul>\n<li>Confirms WordPress 3.8 Compatibility</li>\n</ul>\n<h4>Version 3.9 27/10/2013</h4>\n<ul>\n<li>Tidied up the links to use the Canalplan shorter urls (/waterway /gazetteer )</li>\n<li>Added code to support Features</li>\n</ul>\n<h4>Version 3.8 05/10/2013</h4>\n<ul>\n<li>Added better support for RSS feeds &#8211; CP Links now work in RSS feeds</li>\n<li>Added better support for WPMU&#8217;s Global Posts / Network RSS Feed</li>\n<li>Added New Short Codes to support Trip Summaries and Trip Maps</li>\n</ul>\n<h4>Version 3.7 17/08/2013</h4>\n<ul>\n<li>Added Location Options screen to the page menu</li>\n<li>Added the ability to re-import a route from canalplan.</li>\n</ul>\n<h4>Version 3.6 17/08/2013</h4>\n<ul>\n<li>New Location Options screen</li>\n<li>Location Widget recoded to use Location Options Screen</li>\n<li>API Key was not being saved properly.</li>\n<li>Minor tweaks to the Day Stats code</li>\n<li>Minor changes to the format of draft posts created during route importing.</li>\n</ul>\n<h4>Version 3.5 04/05/2013</h4>\n<ul>\n<li>Restored favourites per blog which had got lost somewhere (only affects multiblog installs)</li>\n<li>Added new linkify function to just return raw text.</li>\n</ul>\n<h4>Version 3.4 28/04/2013</h4>\n<ul>\n<li>Fixed a couple of bugs in the Manage Route page.</li>\n</ul>\n<h4>Version 3.3 28/04/2013</h4>\n<ul>\n<li>Found a bug in the midpoint logic for maps.</li>\n</ul>\n<h4>Version 3.2 10/02/2013</h4>\n<ul>\n<li>Tidied up a lot of the array index references</li>\n<li>Found some more mysql_ calls</li>\n<li>Fixed obsolescent menu constructs</li>\n<li>Confirmed WordPress 3.5.1 compatible</li>\n</ul>\n<h4>Version 3.1 22/01/2013</h4>\n<ul>\n<li>Missing ARRAY_A broke a setting</li>\n</ul>\n<h4>Version 3.0 20/01/2013</h4>\n<ul>\n<li>Recoded all DB calls to use $wpdb calls</li>\n<li>Recoded all functions using mysql_ functions</li>\n<li>Recoded Google Map functions to make them work with JetPack</li>\n<li>Removed a lot of old commented out code.</li>\n</ul>\n<h4>Version 2.8 13/10/2012</h4>\n<ul>\n<li>Changed a couple of fixed URLS to use constants to make url changes easier.</li>\n<li>Added a couple of conditional checks to make things tidy.</li>\n<li>Moved Data Pull from Canalplan to use wp_get &#8211; so fopen is not needed any more which makes things better.</li>\n</ul>\n<h4>Version 2.7 21/07/2012</h4>\n<ul>\n<li>Server work to reduce DB download size.</li>\n<li>Recode data loader to use smaller fetch requests</li>\n<li>Fixed a rogue 500 error in the place matching routine.</li>\n<li>Changed all javascript urls to be relative rather than absolute to fix issue with running blog in a subdirectory</li>\n<li>Changed Where Am I widget to need full Google ID (i.e including the -) rather than just assuming it.</li>\n<li>Added before and after widget calls to the Widget so that it picks up theme formatting for widgets.</li>\n<li>Changed more hard coded Canalplan URLs to use the constants defined in the main file.</li>\n</ul>\n<h4>Version 2.6 14/07/2012</h4>\n<ul>\n<li>Found a few incorrect urls which would have caused some unwanted 404s</li>\n</ul>\n<h4>Version 2.5 03/07/2012</h4>\n<ul>\n<li>Rebuilding the blog revealed a glitch when a place vanished from the database which messed up the maps. Now fixed.</li>\n<li>Database moved on live server &#8211; so local data wasn&#8217;t updating.</li>\n</ul>\n<h4>Version 2.4 17/06/2012</h4>\n<ul>\n<li>Fixed a problem with blogged routes. Was coded to expect a .htaccess re-write rule. No-one seems to have noticed though!</li>\n<li>Checked 3.4 compatability</li>\n</ul>\n<h4>Version 2.3 12/06/2012</h4>\n<ul>\n<li>Fixed the paths for lots of script and http references. Serves me right for developing in a folder with the wrong name!</li>\n</ul>\n<h4>Version 2.2 03/05/2012</h4>\n<ul>\n<li>Fixed the paths in the admin page so that the menus worked properly. Serves me right for developing in a folder with the wrong name!</li>\n</ul>\n<h4>Version 2.1 29/04/2012</h4>\n<ul>\n<li>Fixed an incorrect header in the widget plugin which confused the WordPress SVN which reported the plugin as Version 1.0 rather than 2.0</li>\n<li>Latitude Widget no longer shows ! places as nearest locations.</li>\n</ul>\n<h4>Version 2.0 28/04/2012</h4>\n<ul>\n<li>Checked for WordPress 3.3.2 compatability</li>\n<li>Removed Google Map API key code</li>\n<li>Recoded Google Maps to use Version 3 of the Maps API</li>\n<li>Added a Latitude Widget which links to Canalplan locations</li>\n<li>Added a Maps options page</li>\n<li>Recoded tag handling code to incorporate map customisation options.</li>\n<li>Re-wrote the user guide.</li>\n<li>Removed lots of commented out code left over from original development.</li>\n</ul>\n<h4>Version 1.0 22/12/2011</h4>\n<ul>\n<li>Checked for WP 3.3 compatability.</li>\n<li>Minor tweaks in some of the refresh logic</li>\n</ul>\n<h4>Version 0.9.1 12/07/2011</h4>\n<ul>\n<li>Added PDF user guide and added links to it</li>\n<li>Moved Calendar javascript into its own file</li>\n<li>Removed a lot of commented out code that wasn&#8217;t needed any more</li>\n<li>Added Code revision tag for version checking of live installations</li>\n<li>Changed Bulk load limit back to 20 from 2 (left in by accident during testing)</li>\n</ul>\n<h4>Version 0.9  04/07/2011</h4>\n<ul>\n<li>Initial Beta release</li>\n</ul>\n"
    },
    "short_description": "This plugin allows you link your self hosted Wordpress blog to the Canalplan AC website. You can import routes from the route planner and link your bl &hellip;",
    "description": "<p>This plugin allows you link your self hosted WordPress blog to the Canalplan AC website. You can import routes from the route planner and link your blog posts to the canalplan  gazetteer.</p>\n<h3>IMPORTANT</h3>\n<p>This plugin creates 9 tables in your database which occupy about 50MB of space.</p>\n<p>Due to changes in Google&#8217;s Maps API you need to have an API key to use the maps functionality of the plugin. Instructions on how to obtain an API key from Google can be found here:<br />\nhttps://developers.google.com/maps/documentation/javascript/get-api-key#get-an-api-key</p>\n<p>GoogleMaps are no longer supported as I do no have a key</p>\n<p>This plugin DOES NOT support BLOCKS</p>\n<h3>Features</h3>\n<ul>\n<li>Imports data from the Canalplan AC website so you have an up to date list of all canalplan locations / features etc.</li>\n<li>Easy linking to Canalplan AC Gazetteer entries.</li>\n<li>Easy inclusion of Googlemaps related to Canalplan AC locations.</li>\n<li>Easy inclusion of maps of complete waterways or sections of waterways based on Canalplan AC Data.</li>\n<li>Import Planned routes from Canalplan AC and create a &#8220;Cruising Log&#8221; of blog entries for the trip.</li>\n<li>Supports a &#8220;Trips&#8221; page which summarises all the sets of &#8220;Cruising Log&#8221; entries. This page also displays a map and a list of individual posts for a specific &#8220;Cruising Log&#8221;</li>\n<li>Bulk export of links to Canalplan AC Gazetteer entries for when you publish cruising log. </li>\n<li>Export of links to Canalplan AC Gazetteer entries when you publish / update a blog post.</li>\n<li>Crontab job to bulk export links once a week. Needed as referrer urls are ignored on HTTPS sites.</li>\n<li>Canalplan AC website automatically links back to relevant blog entries from Gazetteer pages.</li>\n<li>Works in &#8220;Classic&#8221; (Single blog) and Networked Blogs mode. Can be Network activated.</li>\n<li>Common set of Tables for Networked Blogs mode &#8211; so 1 set of tables per Networked Blogs install, not per blog.</li>\n<li>Global configuration for Networked blog installs can be done through a special multisite.php file.</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/canalplan-ac.5.31.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/canalplan-ac/assets/screenshot-1.png?rev=2020030",
            "caption": "Main Canalplan Menu Page."
        },
        {
            "src": "https://ps.w.org/canalplan-ac/assets/screenshot-2.png?rev=2020030",
            "caption": "Route Management Page."
        },
        {
            "src": "https://ps.w.org/canalplan-ac/assets/screenshot-3.png?rev=2020030",
            "caption": "Canalplan Tag entry box on editor screen."
        },
        {
            "src": "https://ps.w.org/canalplan-ac/assets/screenshot-4.png?rev=2020030",
            "caption": "Trips summary Page."
        },
        {
            "src": "https://ps.w.org/canalplan-ac/assets/screenshot-5.png?rev=2020030",
            "caption": "Single Trip Overview Page showing start / turnround / end locations."
        },
        {
            "src": "https://ps.w.org/canalplan-ac/assets/screenshot-6.png?rev=2020030",
            "caption": "Single Trip Summary Page showing overnight stops."
        },
        {
            "src": "https://ps.w.org/canalplan-ac/assets/screenshot-7.png?rev=2020767",
            "caption": "Blog Post showing summary details (with links back to canalplan) plus embedded map for the day"
        }
    ],
    "tags": {
        "canalplan-ac": "Canalplan AC",
        "crosspost": "crosspost"
    },
    "stable_tag": "5.31",
    "versions": {
        "3.49": "https://downloads.wordpress.org/plugin/canalplan-ac.3.49.zip",
        "3.50": "https://downloads.wordpress.org/plugin/canalplan-ac.3.50.zip",
        "3.60": "https://downloads.wordpress.org/plugin/canalplan-ac.3.60.zip",
        "3.61": "https://downloads.wordpress.org/plugin/canalplan-ac.3.61.zip",
        "3.62": "https://downloads.wordpress.org/plugin/canalplan-ac.3.62.zip",
        "3.63": "https://downloads.wordpress.org/plugin/canalplan-ac.3.63.zip",
        "3.64": "https://downloads.wordpress.org/plugin/canalplan-ac.3.64.zip",
        "3.65": "https://downloads.wordpress.org/plugin/canalplan-ac.3.65.zip",
        "3.66": "https://downloads.wordpress.org/plugin/canalplan-ac.3.66.zip",
        "3.67": "https://downloads.wordpress.org/plugin/canalplan-ac.3.67.zip",
        "4.00": "https://downloads.wordpress.org/plugin/canalplan-ac.4.00.zip",
        "4.01": "https://downloads.wordpress.org/plugin/canalplan-ac.4.01.zip",
        "4.02": "https://downloads.wordpress.org/plugin/canalplan-ac.4.02.zip",
        "4.03": "https://downloads.wordpress.org/plugin/canalplan-ac.4.03.zip",
        "4.10": "https://downloads.wordpress.org/plugin/canalplan-ac.4.10.zip",
        "4.20": "https://downloads.wordpress.org/plugin/canalplan-ac.4.20.zip",
        "4.21": "https://downloads.wordpress.org/plugin/canalplan-ac.4.21.zip",
        "4.22": "https://downloads.wordpress.org/plugin/canalplan-ac.4.22.zip",
        "4.23": "https://downloads.wordpress.org/plugin/canalplan-ac.4.23.zip",
        "4.24": "https://downloads.wordpress.org/plugin/canalplan-ac.4.24.zip",
        "4.25": "https://downloads.wordpress.org/plugin/canalplan-ac.4.25.zip",
        "4.26": "https://downloads.wordpress.org/plugin/canalplan-ac.4.26.zip",
        "4.27": "https://downloads.wordpress.org/plugin/canalplan-ac.4.27.zip",
        "4.28": "https://downloads.wordpress.org/plugin/canalplan-ac.4.28.zip",
        "4.29": "https://downloads.wordpress.org/plugin/canalplan-ac.4.29.zip",
        "4.30": "https://downloads.wordpress.org/plugin/canalplan-ac.4.30.zip",
        "4.31": "https://downloads.wordpress.org/plugin/canalplan-ac.4.31.zip",
        "4.32": "https://downloads.wordpress.org/plugin/canalplan-ac.4.32.zip",
        "5.0": "https://downloads.wordpress.org/plugin/canalplan-ac.5.0.zip",
        "5.01": "https://downloads.wordpress.org/plugin/canalplan-ac.5.01.zip",
        "5.02": "https://downloads.wordpress.org/plugin/canalplan-ac.5.02.zip",
        "5.10": "https://downloads.wordpress.org/plugin/canalplan-ac.5.10.zip",
        "5.11": "https://downloads.wordpress.org/plugin/canalplan-ac.5.11.zip",
        "5.12": "https://downloads.wordpress.org/plugin/canalplan-ac.5.12.zip",
        "5.20": "https://downloads.wordpress.org/plugin/canalplan-ac.5.20.zip",
        "5.21": "https://downloads.wordpress.org/plugin/canalplan-ac.5.21.zip",
        "5.22": "https://downloads.wordpress.org/plugin/canalplan-ac.5.22.zip",
        "5.23": "https://downloads.wordpress.org/plugin/canalplan-ac.5.23.zip",
        "5.24": "https://downloads.wordpress.org/plugin/canalplan-ac.5.24.zip",
        "5.30": "https://downloads.wordpress.org/plugin/canalplan-ac.5.30.zip",
        "5.31": "https://downloads.wordpress.org/plugin/canalplan-ac.5.31.zip",
        "trunk": "https://downloads.wordpress.org/plugin/canalplan-ac.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/canalplan-ac/assets/icon-256x256.png?rev=2020030",
        "2x": "https://ps.w.org/canalplan-ac/assets/icon-256x256.png?rev=2020030"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}