{
    "name": "CC Child Pages",
    "slug": "cc-child-pages",
    "version": "1.45",
    "author": "<a href=\"https://caterhamcomputing.net/\">Caterham Computing</a>",
    "author_profile": "https://profiles.wordpress.org/caterhamcomputing/",
    "contributors": {
        "caterhamcomputing": {
            "profile": "https://profiles.wordpress.org/caterhamcomputing/",
            "avatar": "https://secure.gravatar.com/avatar/885275a2ac0b286713096b71d4c84991?s=96&d=monsterid&r=g",
            "display_name": "caterhamcomputing"
        }
    },
    "requires": "4.0",
    "tested": "6.1.7",
    "requires_php": "5.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 45,
        "4": 2,
        "3": 0,
        "2": 1,
        "1": 0
    },
    "num_ratings": 48,
    "support_url": "https://wordpress.org/support/plugin/cc-child-pages/",
    "support_threads": 2,
    "support_threads_resolved": 0,
    "active_installs": 10000,
    "downloaded": 127089,
    "last_updated": "2023-03-15 16:06:00",
    "added": "2014-10-20",
    "homepage": "http://ccchildpages.ccplugins.co.uk/",
    "sections": {
        "description": "<p>CC Child Pages is a simple plugin to show links to child pages via a shortcode.</p>\n<p>Child Pages are displayed in responsive boxes, and include the page title, an excerpt and a &#8220;Read more&#8230;&#8221; link.</p>\n<p>You can choose between 1, 2, 3 &amp; 4 column layouts.</p>\n<p>3 &amp; 4 column layouts will resize to a 2 column layout on small devices to ensure that they remain readable.</p>\n<h4>CC Child Pages editor button</h4>\n<p><strong>CC Child Pages now adds a button to the WordPress text editor, allowing you to quickly insert the shortcode and select many common options</strong></p>\n<h4>CC Child Pages widget</h4>\n<p>CC Child Pages also includes a widget for displaying child pages within your sidebars.</p>\n<p>The widget can be set to show the children of the current page or a specific page, or to show all pages.</p>\n<p>Pages can be sorted by their menu order, title or ID. You can also select the depth of pages to be displayed.</p>\n<p>You can now also tick the checkbox to show all pages, in which case the widget will behave much like the standard Pages widget but with additional options.</p>\n<h4>Using the shortcode</h4>\n<p>The simplest usage would be to use the shortcode with no parameters:</p>\n<pre><code>[child_pages]\n</code></pre>\n<p>This would show the Child Pages for the current page in 2 columns.</p>\n<p>You can add the <code>cols</code> parameter to choose the number of columns:</p>\n<pre><code>[child_pages cols=\"1\"]\n[child_pages cols=\"2\"]\n[child_pages cols=\"3\"]\n[child_pages cols=\"4\"]\n</code></pre>\n<p>&#8230; if <code>cols</code> is set to anything other than 1, 2, 3 or 4 the value will be ignored.</p>\n<p>You can also show the child pages of a specific page by adding the <code>ID</code> of the page as follows:</p>\n<pre><code>[child_pages id=\"42\"]\n</code></pre>\n<p>&#8230; or you can specify multiple IDs in a comma-separated list (does not work when using <code>list=\"true\"</code>)</p>\n<pre><code>[child_pages id=\"42,53,76\"]\n</code></pre>\n<p>To exclude pages, use the <code>exclude</code> parameter. This allows you to specify a comma separated list of Page IDs to be exclude from the output of the shortcode.</p>\n<pre><code>[child_pages exclude=\"5,33,45\"]\n</code></pre>\n<p>To display only specific pages, you can use the <code>page_ids</code> paremeter. This accepts a comma separated list of IDs. If this parameter is used, the <code>id</code> and <code>exclude</code> parameters are ignored.</p>\n<pre><code>[child_pages page_ids=\"3,7,10,35\"]\n</code></pre>\n<p>The above code will display only the listed pages.</p>\n<p>If you want to prefer to use text other than the standard &#8220;Read more &#8230;&#8221; to link to the pages, this can be specified with the <code>more</code> parameter:</p>\n<pre><code>[child_pages more=\"More...\"]\n</code></pre>\n<p>You may also hide the &#8220;Read more &#8230;&#8221; link altogether by setting the <code>hide_more</code> parameter to <code>\"true\"</code>:</p>\n<pre><code>[child_pages hide_more=\"true\"]\n</code></pre>\n<p>Since there is no other way for the visitor to link to the child page, you can choose to make the page titles link to the child page by setting the <code>link_titles</code> parameter to <code>\"true\"</code>:</p>\n<pre><code>[child_pages link_titles=\"true\"]\n</code></pre>\n<p>(This is mainly designed to be used with the <code>hide_more</code> parameter, but can be used independently if you want to have both the titles and &#8220;Read more &#8230;&#8221; text link to the child page.)</p>\n<p>When specifying <code>link_titles=\"true\"</code>, you may wish to apply your own styling to the links. To do so, you can specify a style using the <code>title_link_class</code> parameter:</p>\n<pre><code>[child_pages link_titles=\"true\" title_link_class=\"my_title_link_class\"]\n</code></pre>\n<p>You may also hide the titles altogether by setting the <code>hide_title</code> parameter to <code>\"true\"</code>:</p>\n<pre><code>[child_pages hide_title=\"true\"]\n</code></pre>\n<p>You can display a thumbnail of the featured image for each page (if set) by setting the <code>thumbs</code> parameter to <code>\"true\"</code>:</p>\n<pre><code>[child_pages thumbs=\"true\"]\n</code></pre>\n<p>You can now also display thumbnails at different sizes to the default (&#8216;medium&#8217;) size. Simply specify the thumbnail size in the <code>thumbs</code> parameter. You can even specify custom image sizes.</p>\n<pre><code>[child_pages thumbs='large']\n</code></pre>\n<p>You can make thumbnails link to the related child page by setting the <code>link_thumbs</code> to <code>\"true\"</code>:</p>\n<pre><code>[child_pages thumbs='large' link_thumbs=\"true\"]\n</code></pre>\n<p>&#8230; note that specifying the <code>link_thumbs</code> parameter will have no effect unless the <code>thumbs</code> parameter is set to either <code>true</code> or a thumbnail size.</p>\n<p>You can specify a target for the links added by the plugin by setting the <code>link_target</code> parameter. This will work exactly the same as setting the <code>target</code> parameter for the HTML <code>&lt;a&gt;</code> tag:</p>\n<pre><code>[child_pages link_target=\"_blank\"]\n</code></pre>\n<p>You can limit the length of the excerpt by specifying the <code>words</code> parameter:</p>\n<pre><code>[child_pages words=\"10\"]\n</code></pre>\n<p>You can hide the excerpt altogether by setting the <code>hide_excerpt</code> parameter to <code>\"true\"</code>:</p>\n<pre><code>[child_pages hide_excerpt=\"true\"]\n</code></pre>\n<p>You can stop Custom Excerpts from being truncated by setting the <code>truncate_excerpt</code> parameter to &#8220;false&#8221;:</p>\n<pre><code>[child_pages truncate_excerpt=\"false\"]\n</code></pre>\n<p>&#8230; this will display custom excerpts exactly as entered without being shortened. (Especially useful if using the Rich Text Excerpts plugin, in which case all styling will be preserved.)</p>\n<p>When <code>truncate_excerpt</code> is set to <code>true</code>, excerpts will be truncated only if they exceed the specified word count (default 55). When custom excerpts are truncated, any HTML will be removed.</p>\n<p>If you have inserted <code>more</code> tags into your posts/pages, you may find that the <code>Continue reading</code> message is included in the excerpt. To hide this, set the <code>hide_wp_more</code> parameter to <code>true</code>:</p>\n<pre><code>[child_pages hide_wp_more=\"true\"]\n</code></pre>\n<p>IF you wish to display the full contents of the listed pages, you can set the <code>show_page_content</code> parameter to <code>true</code>:</p>\n<pre><code>[child_pages show_page_content=\"true\"]\n</code></pre>\n<p>To change the order in which the child pages are listed, you can use the <code>orderby</code> and <code>order</code> parameters:</p>\n<pre><code>[child_pages orderby=\"title\" order=\"ASC\"]\n</code></pre>\n<p>The <code>orderby</code> parameter can have one of the following values:<br />\n    menu_order (the default value) &#8211; shows the pages sorted by the order in which they appear within the WordPress admin</p>\n<pre><code>id sorts the pages according to the ID of the page\ntitle sorts the pages alphabetically by the title\nslug sorts the pages alphabetically according to the slug (page_name) of the page\nauthor sorts the pages by author\ndate sorts the pages by the date they were created\nmodified sorts the pages by the date they were modified\nrand shows the pages in a random order\n</code></pre>\n<p>The <code>order</code> parameter can be set to:</p>\n<pre><code>ASC shows the pages in ascending order, sorted by the value of `orderby`\nDESC shows the pages in descending order, sorted by the value of `orderby`\n</code></pre>\n<p>You can now also use the <code>skin</code> parameter to choose a colour scheme for the Child Pages as follows:</p>\n<pre><code>[child_pages skin=\"simple\"] (the default colour scheme)\n[child_pages skin=\"red\"]\n[child_pages skin=\"green\"]\n[child_pages skin=\"blue\"]\n</code></pre>\n<p>If you want to style the child page boxes yourself, you can also specify the <code>class</code> parameter. If used, this overrides the <code>span</code> parameter and adds the specified class name to the generated HTML:</p>\n<pre><code>[child_pages class=\"myclass\"]\n</code></pre>\n<p>If you are not using the provided skins, you can prevent the CSS file for the skins from being loaded from the CC Child Pages options under the Settings menu.</p>\n<p>Finally, you can also display just an unordered list (<code>&lt;ul&gt;</code>) of child pages by adding the <code>list</code> parameter. In this case, all other parameters are ignored <strong>except for <code>class</code>, <code>cols</code>, <code>exclude</code>, <code>orderby</code>, <code>order</code> and <code>id</code></strong>.</p>\n<pre><code>[child_pages list=\"true\"]\n</code></pre>\n<p>When using the <code>list</code> parameter, you can also specify the <code>depth</code> parameter to specify how many levels in the hierarchy of pages are to be included in the list.</p>\n<p>The <code>depth</code> parameter accepts the following values:</p>\n<ul>\n<li>0 (default) Displays pages at any depth and arranges them hierarchically in nested lists </li>\n<li>-1 Displays pages at any depth and arranges them in a single, flat list </li>\n<li>1 Displays top-level Pages only </li>\n<li>\n<p>2, 3 … Displays Pages to the given depth</p>\n<p>[child_pages list=&#8221;true&#8221; depth=&#8221;4&#8243;]</p>\n</li>\n</ul>\n<p>Specifying the <code>cols</code> parameter with <code>list=\"true\"</code> will show the child pages as an unordered list ordered into a number of columns (I would recommend avoiding the use of the <code>depth</code> parameter when listing child pages within columns &#8211; the results are likely to be fairly unreadable!).</p>\n<pre><code>[child_pages list=\"true\" cols=\"3\"]\n</code></pre>\n<p>The columns are responsive, and should adjust according to the browser being re-sized or the size of the screen being used.</p>\n<p><strong>N.B. Because the shortcode uses the WordPress <code>wp_list_pages</code> function to output the list, columns are acheived by applying CSS styling to the functions standard output. This CSS should work fine in modern browsers, but in older browsers (such as Internet Explorer 8) the list will not be split into columns</strong></p>\n<p>The <code>depth</code> parameter can now also be used with the shortcode when <code>list</code> is not set or is is set to <code>\"false\"</code>.</p>\n<p>If <code>depth</code> is set, the sub-pages for each child page will be shown as an ordered list. You can specify a title for this element by setting the <code>subpage_title</code> parameter:</p>\n<pre><code>[child_pages depth=\"3\" subpage_title=\"Sub-pages\"]\n</code></pre>\n<h4>Private Pages</h4>\n<p>By default the shortcode (as of verion 1.36) will show pages that have their visibility set to <code>publish</code>, with pages with a visibility of <code>private</code> added for logged in users that have access to these pages.</p>\n<p>You can specify which pages to show by using the <code>post_status</code> parameter, which can take the following values:</p>\n<ul>\n<li><code>publish</code> &#8211; published, publicly viewable pages</li>\n<li><code>pending</code> &#8211; pages which are pending review</li>\n<li><code>draft</code> &#8211; pages which have not yet been published and have the draft status</li>\n<li><code>auto-draft</code> &#8211; newly created pages with no content</li>\n<li><code>future</code> &#8211; pages with the publish date set in the future</li>\n<li><code>private</code> &#8211; pages which are not visible to users who are not logged in</li>\n<li><code>inherit</code> &#8211; revisions</li>\n<li><code>trash</code> &#8211; pages which have been moved to the trash awaiting deletion</li>\n<li><code>any</code> &#8211; pages with  any status except those from post statuses with &#8216;exclude_from_search&#8217; set to true (i.e. <code>trash</code> and <code>auto-draft</code>)</li>\n</ul>\n<p>Some of these values are unlikely to be helpful in everyday use.</p>\n<p>For example:</p>\n<pre><code>[child_pages post_status=\"publish\"]\n</code></pre>\n<p>To specify a number of statuses, provide a comma-separated list:</p>\n<pre><code>[child_pages post_status=\"publish,private\"]\n</code></pre>\n<h4>Post Meta</h4>\n<p>You can show the author, date created and/or date modified for a post by using <code>show_author</code>, <code>show_date_created</code> and <code>show_date_modified</code> parameters. If set to <code>true</code>, they will show the corresponding information:</p>\n<pre><code>[child_pages show_author=\"true\" show_date_created=\"true\"]\n</code></pre>\n<h4>Sibling Pages</h4>\n<p>The shortcode also allows you to display sibling pages (those at the same level as the current page within the hierarchy).</p>\n<p>To do this, set the <code>siblings</code> parameter to <code>true</code>.</p>\n<p>This will override the <code>id</code> parameter and will append the current page to the <code>exclude</code> parameter.</p>\n<pre><code>[child_pages siblings=\"true\"]\n</code></pre>\n<p>This can also be used with the <code>list</code> parameter</p>\n<pre><code>[child_pages siblings=\"true\" list=\"true\"]\n</code></pre>\n<p>By default, the shortcode will not display the current page when <code>siblings</code> is set to <code>true</code>. If you wish to include the current page, set the <code>show_current_page</code> parameter to <code>true</code>:</p>\n<pre><code>[child_pages siblings=\"true\" show_current_page=\"true\"]\n\n[child_pages siblings=\"true\" list=\"true\" show_current_page=\"true\"]\n</code></pre>\n<h4>Limits</h4>\n<p>You can limit the number of child pages displayed using the <code>limit</code> parameter (unless the <code>list</code> parameter has been set to <code>\"true\"</code>).</p>\n<p>For example:</p>\n<pre><code>[child_pages limit=\"5\"] will display only the first 5 child pages.\n</code></pre>\n<h4>Offset</h4>\n<p>When not using <code>list=\"true\"</code>, you can specify a value for <code>offset</code> to skip a set number of results. For example:</p>\n<pre><code>[child_pages offset=\"2\"]\n</code></pre>\n<p>&#8230; will skip the first 2 pages.</p>\n<h4>Custom Fields</h4>\n<p>You may wish to show a different title, excerpt, &#8220;Read more&#8230;&#8221; message or thumbnail on certain pages. To achieve this, you can set values in custom fields on specific pages &#8211; to tell the shortcode to use the custom value, set the <code>use_custom_excerpt</code>, <code>use_custom_title</code>, <code>use_custom_more</code> or <code>use_custom_thumbs</code> parameter to the name of the custom field to be used.</p>\n<p>If the field used is set for a page, its value will be used instead of the default excerpt/title/&#8221;Read more&#8230;&#8221;. Pages on which the custom field is not populated will use the default value.</p>\n<pre><code>[child_pages use_custom_excerpt=\"custom_cc_excerpt\"]\n</code></pre>\n<p>&#8230; will replace the standard excerpt with the value of the custom field <code>custom_cc_excerpt</code> (if it is set)</p>\n<pre><code>[child_pages use_custom_title=\"custom_cc_title\"]\n</code></pre>\n<p>&#8230; will replace the standard title with the value of the custom field <code>custom_cc_title</code> (if it is set)</p>\n<pre><code>[child_pages use_custom_thumbs=\"custom_cc_thumnail\"]\n</code></pre>\n<p>&#8230; will replace the standard thumbnail with one specified in the value of the custom field <code>custom_cc_thumnail</code> (if it is set). The value of the <code>custom_cc_thumnail</code> custom field can either be set to the ID of the image attachment (using the <a href=\"https://wordpress.org/plugins/advanced-custom-fields/\" rel=\"ugc\">Advanced Custom Fields</a> plugin can make this much easier to use) or to the full URL of the image.</p>\n<pre><code>[child_pages use_custom_more=\"custom_cc_more\"]\n</code></pre>\n<p>&#8230; will replace the standard &#8220;Read more&#8230;&#8221; message with the value of the custom field <code>custom_cc_more</code> (if it is set)</p>\n<pre><code>[child_pages use_custom_link=\"custom_cc_link\"]\n</code></pre>\n<p>&#8230; will replace URL link for the page with the URL specified in the value of the custom field <code>custom_cc_link</code> (if it is set). (The default value of <code>use_custom_link</code> is <code>\"cc_child_pages_link\"</code>, so that this field can be set without the need to specify the parameter. To disable this functionality, set <code>use_custom_link=\"\"</code>.)</p>\n<pre><code>[child_pages use_custom_link_target=\"custom_cc_link_target\"]\n</code></pre>\n<p>&#8230; will replace the link target for titles, thumbnails and the &#8220;Read more&#8230;&#8221; text with the value specified in the custom field <code>custom_cc_link_target</code> (if it is set). (The default value of <code>use_custom_link_target</code> is <code>\"cc_child_pages_link_target\"</code>, so that this field can be set without the need to specify the parameter. To disable this functionality, set <code>use_custom_link_target=\"\"</code>.)</p>\n<p><strong>N.B.</strong> <code>use_custom_excerpt</code>, <code>use_custom_title</code>, <code>use_custom_more</code>, <code>use_custom_link</code> <code>use_custom_link_target</code> and <code>use_custom_thumbs</code> will not work when <code>list=\"true\"</code></p>\n<h4>Pagination</h4>\n<p>CC Child Pages now includes basic support for pagination.</p>\n<p>You can set the number of child pages to be displayed on each page by specifying the <code>posts_per_page</code> parameter, e.g.:</p>\n<pre><code>[child_pages posts_per_page=\"6\"]\n</code></pre>\n<p>The above code will display 6 child pages on each page, and if there are more than 6 child pages found navigation links will be displayed.</p>\n<p>You can also specify the <code>page</code> parameter to display a specific page. For example:</p>\n<pre><code>[child_pages posts_per_page=\"3\" page=\"2\"]\n</code></pre>\n<p>The above code will show the second page of results (item 4 onwards, up to 3 items). <strong>N.B.</strong> when the <code>page</code> parameter is specified, no pagination links are displayed.</p>\n<p>The <code>page</code> parameter has no effect unless <code>posts_per_page</code> is specified.</p>\n<p><strong>Pagination functionality is limited on a static front page</strong></p>\n<p><strong>N.B.</strong> The pagination parameters are ignored when <code>list=\"true\"</code></p>\n<h4>Sticky Posts</h4>\n<p>By default, sticky posts are not shown &#8230; however, if you want them to be displayed you can set the <code>ignore_sticky_posts</code> parameter to be <code>false</code>:</p>\n<pre><code>[child_pages ignore_sticky_posts=\"false\"]\n</code></pre>\n",
        "installation": "<ol>\n<li>Upload the plugin to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "changelog": "<h4>1.45</h4>\n<ul>\n<li>Maintenance release- minor bug fix to setting page.</li>\n</ul>\n<h4>1.44</h4>\n<ul>\n<li>Maintenance release with security improvements to legacy widget.</li>\n</ul>\n<h4>1.43</h4>\n<ul>\n<li>Maintenance release with security improvements.</li>\n</ul>\n<h4>1.42</h4>\n<ul>\n<li>\n<p>Bug fix for <code>hide_titles</code> function to stop it breaking custom templates.</p>\n<p>1.41 =</p>\n</li>\n<li>Added <code>hide_titles</code> option. Small bug fix for widget.</li>\n</ul>\n<h4>1.40</h4>\n<ul>\n<li>Maintenance release. Added Exclude Tree option to widget</li>\n</ul>\n<h4>1.39</h4>\n<ul>\n<li>Small fix to CC Child Pages Widget</li>\n</ul>\n<h4>1.38</h4>\n<ul>\n<li>Small fix to CSS for page navigation links</li>\n</ul>\n<h4>1.37</h4>\n<ul>\n<li>Small changes to try to prevent problems interacting with other plugins that may not return correct values in their filters</li>\n</ul>\n<h4>1.36</h4>\n<ul>\n<li>Bug fix &#8211; by default private pages will be visible or hidden depending on whether the user is logged in</li>\n<li>Added <code>post_status</code> parameter to show child pages with specific statuses</li>\n<li>Added button to the settings page to disable loading of Skins CSS file if not being used (for performance)</li>\n<li>Added additional classes to child page elements to allow styling of elements with parent pages (and even specific parent pages)</li>\n<li>Added <code>use_custom_thumbs</code> parameter &#8211; specify the name of a custom field that will specify the ID or URL of an image to use as a thumbnail</li>\n</ul>\n<h4>1.35</h4>\n<ul>\n<li>Bug fix &#8211; implemented code to remove <code>[child_pages]</code> shortcode from pages before generating excerpts to avoid getting stuck in an infinite loop under some circumstances</li>\n<li>Added <code>show_page_content</code> parameter to show complete page content</li>\n<li>Added <code>link_target</code> and <code>use_custom_link_target</code> parameters to allow control of how links open</li>\n<li><code>depth</code> now works with the shortcode when not using <code>list</code> mode. Added <code>subpage_title</code> parameter to display a title for sub-pages whe <code>depth</code> is greater than 1 and <code>list=\"true\"</code> is NOT specified</li>\n<li>Added <code>show_author</code>, <code>show_date_created</code> and <code>show_date_modified</code> parameters to allow display of post information</li>\n<li><code>order</code> can now be set to <code>rand</code> to show items in a random order</li>\n</ul>\n<h4>1.34</h4>\n<ul>\n<li>Added <code>ignore_sticky_posts</code> parameter</li>\n<li>Added <code>limit</code> parameter to limit the number of pages displayed</li>\n<li>Added <code>offset</code> parameter to allow skipping a number of pages</li>\n</ul>\n<h4>1.33</h4>\n<ul>\n<li>Added <code>posts_per_page</code> and <code>page</code> parameters for basic pagination</li>\n<li>Added <code>page_ids</code> parameter to allow display of specific pages</li>\n<li>Added <code>use_custom_link</code> parameter to allow the over-riding of the link target on a per page basis</li>\n<li>Added new CSS IDs to help make styling more flexible</li>\n</ul>\n<h4>1.32</h4>\n<ul>\n<li>Bug fix &#8211; widget was displaying sibling pages instead of child pages under certain circumstances</li>\n</ul>\n<h4>1.31</h4>\n<ul>\n<li>Added <code>siblings</code> option to the widget</li>\n<li>Added <code>show_current_page</code> option for use with the shortcode when <code>siblings</code> is set to <code>true</code></li>\n<li>Added <code>hide_wp_more</code> to remove the standard &#8220;Continue reading&#8230;&#8221; message from excerpts</li>\n<li>Added <code>use_custom_excerpt</code>, <code>use_custom_title</code> and <code>use_custom_more</code> to the shortcode</li>\n<li>Added more filters and actions to widget and shortcode to allow extension of plugin</li>\n</ul>\n<h4>1.30</h4>\n<ul>\n<li>Bug fix &#8211; internationalization now works correctly (translations need work though &#8211; currently only French, which is known to be poor)</li>\n<li>Added more filters to widget, list and shortcode to allow extension of plugin</li>\n</ul>\n<h4>1.29</h4>\n<ul>\n<li>Bug fix &#8211; widget will now show on all pages/posts if &#8220;All Pages&#8221; or a specific parent page is selected</li>\n<li>Bug fix &#8211; shortcode now closes query correctly (was causing issues with some themes)</li>\n<li>The shortcode will now work with custom post types</li>\n<li>You can now specify multiple parent page IDs (when using <code>list=\"true\"</code>, only a single parent ID can be specified)</li>\n</ul>\n<h4>1.28</h4>\n<ul>\n<li>Further improvements to integration when used with Video Thumbnails plugin</li>\n</ul>\n<h4>1.27</h4>\n<ul>\n<li>Added the <code>siblings</code> parameter to show siblings of current page</li>\n<li>Improved integration when used with Video Thumbnails plugin</li>\n<li>Minor bug fixes for CC Child Pages Widget</li>\n</ul>\n<h4>1.26</h4>\n<ul>\n<li>The CSS for displaying child pages has been re-written to allow for custom CSS to be more easily written &#8211; for example, specifying a border should no longer cause problems in the responsive layout. Fallbacks have been put in place for older versions of Internet Explorer.</li>\n<li>The handling of Custom CSS from the settings page has been improved.</li>\n<li>The loading of the plugin CSS has been returned to the default manner. While this means that CSS is loaded on pages where the shortcode is not used, it means that the CSS can be correctly minified by other plugins and ensures that valid HTML is generated.</li>\n</ul>\n<h4>1.25</h4>\n<ul>\n<li>New option added to widget to show all top-level pages and their children. This can now be used as a complete replacement for the standard Pages widget</li>\n<li>New option added to the plugins settings page allowing custom CSS code to be specified from within the plugin. This feature has been requested several times. This functionality will be expanded on in the future.</li>\n</ul>\n<h4>1.24</h4>\n<ul>\n<li>Further enhancements to CSS when using both the <code>list</code> and <code>cols</code> parameters</li>\n</ul>\n<h4>1.23</h4>\n<ul>\n<li>Minor fix for CSS when using both the <code>list</code> and <code>cols</code> parameters</li>\n</ul>\n<h4>1.22</h4>\n<ul>\n<li>Changes to how excerpts are generated from content when no custom excerpt is specified.</li>\n<li>Changed how CSS is queued &#8211; the CSS file will now only be included in the page if the shortcode is specified, helping to keep page sizes to a minimum.</li>\n</ul>\n<h4>1.21</h4>\n<ul>\n<li>Change to allow <code>cols</code> parameter to be used when <code>list</code> parameter is set to <code>true</code>.</li>\n<li>Changed <code>.ccpages_excerpt</code> container to <code>&lt;div&gt;</code> (was <code>&lt;p&gt;</code>) to avoid potentially invalid HTML when HTML excerpts are used.</li>\n</ul>\n<h4>1.20</h4>\n<ul>\n<li>Change to improve efficiency when the plugin attempts to force thumbnail creation via Video Thumbnails plugin</li>\n<li>Minor change to avoid output of empty links when applying links to thumbnails and no thumbnail is present</li>\n<li>Minor change to escaping special characters in <code>more</code> parameter</li>\n</ul>\n<h4>1.19</h4>\n<ul>\n<li>Small change to how the plugin works with thumbnails. It will now use thumbnails generated by the Video Thumbnails plugin if it is installed.</li>\n<li>Added <code>link_thumbs</code> parameter. If set to <code>\"true\"</code>, thumbnails will link to the child page.</li>\n<li>CSS is no longer minified, in order to make it easier to view existing CSS when defining your own custom styles. The CSS can be minified by other plugins if required. </li>\n</ul>\n<h4>1.18</h4>\n<ul>\n<li>Added settings page to allow disabing of button in Visual Editor (TinyMCE)</li>\n<li>Added the <code>truncate_excerpt</code> parameter to the shortcode, defaults to <code>true</code> but setting to <code>false</code> stops custom excerpts from being shortened (where no custom excerpt exists, page content will still be truncated)</li>\n</ul>\n<h4>1.17</h4>\n<ul>\n<li>Small change to how custom excerpts are handled for interoperability with Rich Text Excerpts plugin. </li>\n</ul>\n<h4>1.16</h4>\n<ul>\n<li>Added the <code>hide_excerpt</code> parameter</li>\n</ul>\n<h4>1.15</h4>\n<ul>\n<li>Added <code>hide_more</code> parameter to hide &#8220;Read more &#8230;&#8221; links.</li>\n<li>Added <code>link_titles</code> parameter to make titles link to pages.</li>\n<li>Added <code>title_link_class</code> parameter for styling links in page titles.</li>\n</ul>\n<h4>1.14</h4>\n<ul>\n<li>Bug fix: Corrected missing <code>&lt;ul&gt;</code> tags in widget</li>\n<li>Minor CSS changes to improve compatibility with certain themes</li>\n</ul>\n<h4>1.13</h4>\n<ul>\n<li>Bug fix: Corrected problem with titles including special characters</li>\n<li>Added orderby and order parameters to control the display order of child pages</li>\n</ul>\n<h4>1.12</h4>\n<ul>\n<li>Bug fix: Corrected problem when automatic excerpt returns value including a shortcode</li>\n</ul>\n<h4>1.11</h4>\n<ul>\n<li>Bug fix: Corrected small bug introduced in version 1.10 when using <code>list=\"true\"</code></li>\n</ul>\n<h4>1.10</h4>\n<ul>\n<li>Added <code>exclude</code> parameter</li>\n<li>Added <code>depth</code> parameter (only used if <code>list</code> is set to <code>\"true\"</code>)</li>\n</ul>\n<h4>1.9</h4>\n<ul>\n<li>Added editor button</li>\n<li>Added custom excerpt capability to pages by default</li>\n<li>Refined generation of page excerpt where no custom excerpt exists</li>\n<li>Enhanced functionality of the <code>thumbs</code> option &#8211; you can now set this to the desired thumbnail size e.g. <code>thumbs=\"large\"</code>, <code>thumbs=\"full\"</code>, <code>thumbs=\"my-custom-size\"</code>, etc.</li>\n</ul>\n<h4>1.8</h4>\n<ul>\n<li>CC Child Pages widget enhanced to allow display of children of current page or a specific page</li>\n<li>CC Child Pages widget enhanced to allow depth to be specified</li>\n</ul>\n<h4>1.7</h4>\n<ul>\n<li>Changed plugin author to show business name (Caterham Computing)</li>\n<li>Added CC Child Pages widget</li>\n<li>Added various new classes to help with custom CSS styling</li>\n</ul>\n<h4>1.6</h4>\n<ul>\n<li>Added the <code>words</code> parameter. When set to a value greater than 0, the number of words in the excerpt will be trimmed if greater than the specified value.</li>\n</ul>\n<h4>1.5</h4>\n<ul>\n<li>Added the <code>thumbs</code> parameter. If set to <code>\"true\"</code>, the featured image (if set) of a page will be shown.</li>\n</ul>\n<h4>1.4</h4>\n<ul>\n<li>Added <code>more</code> parameter to override standard &#8220;Read more &#8230;&#8221; text</li>\n<li>Internationalisation &#8230;</li>\n</ul>\n<h4>1.3</h4>\n<ul>\n<li>Corrected small error when using <code>list</code> parameter</li>\n</ul>\n<h4>1.2</h4>\n<ul>\n<li>Added the <code>list</code> parameter</li>\n</ul>\n<h4>1.1</h4>\n<ul>\n<li>Added the <code>skin</code> parameter</li>\n<li>Added the <code>class</code> parameter</li>\n</ul>\n<h4>1.0</h4>\n<ul>\n<li>Initial Release</li>\n</ul>\n"
    },
    "short_description": "Adds a responsive shortcode to list child and sibling pages. Pre-styled or specify your own CSS class for custom styling. Includes child pages widget.",
    "description": "<p>CC Child Pages is a simple plugin to show links to child pages via a shortcode.</p>\n<p>Child Pages are displayed in responsive boxes, and include the page title, an excerpt and a &#8220;Read more&#8230;&#8221; link.</p>\n<p>You can choose between 1, 2, 3 &amp; 4 column layouts.</p>\n<p>3 &amp; 4 column layouts will resize to a 2 column layout on small devices to ensure that they remain readable.</p>\n<h4>CC Child Pages editor button</h4>\n<p><strong>CC Child Pages now adds a button to the WordPress text editor, allowing you to quickly insert the shortcode and select many common options</strong></p>\n<h4>CC Child Pages widget</h4>\n<p>CC Child Pages also includes a widget for displaying child pages within your sidebars.</p>\n<p>The widget can be set to show the children of the current page or a specific page, or to show all pages.</p>\n<p>Pages can be sorted by their menu order, title or ID. You can also select the depth of pages to be displayed.</p>\n<p>You can now also tick the checkbox to show all pages, in which case the widget will behave much like the standard Pages widget but with additional options.</p>\n<h4>Using the shortcode</h4>\n<p>The simplest usage would be to use the shortcode with no parameters:</p>\n<pre><code>[child_pages]\n</code></pre>\n<p>This would show the Child Pages for the current page in 2 columns.</p>\n<p>You can add the <code>cols</code> parameter to choose the number of columns:</p>\n<pre><code>[child_pages cols=\"1\"]\n[child_pages cols=\"2\"]\n[child_pages cols=\"3\"]\n[child_pages cols=\"4\"]\n</code></pre>\n<p>&#8230; if <code>cols</code> is set to anything other than 1, 2, 3 or 4 the value will be ignored.</p>\n<p>You can also show the child pages of a specific page by adding the <code>ID</code> of the page as follows:</p>\n<pre><code>[child_pages id=\"42\"]\n</code></pre>\n<p>&#8230; or you can specify multiple IDs in a comma-separated list (does not work when using <code>list=\"true\"</code>)</p>\n<pre><code>[child_pages id=\"42,53,76\"]\n</code></pre>\n<p>To exclude pages, use the <code>exclude</code> parameter. This allows you to specify a comma separated list of Page IDs to be exclude from the output of the shortcode.</p>\n<pre><code>[child_pages exclude=\"5,33,45\"]\n</code></pre>\n<p>To display only specific pages, you can use the <code>page_ids</code> paremeter. This accepts a comma separated list of IDs. If this parameter is used, the <code>id</code> and <code>exclude</code> parameters are ignored.</p>\n<pre><code>[child_pages page_ids=\"3,7,10,35\"]\n</code></pre>\n<p>The above code will display only the listed pages.</p>\n<p>If you want to prefer to use text other than the standard &#8220;Read more &#8230;&#8221; to link to the pages, this can be specified with the <code>more</code> parameter:</p>\n<pre><code>[child_pages more=\"More...\"]\n</code></pre>\n<p>You may also hide the &#8220;Read more &#8230;&#8221; link altogether by setting the <code>hide_more</code> parameter to <code>\"true\"</code>:</p>\n<pre><code>[child_pages hide_more=\"true\"]\n</code></pre>\n<p>Since there is no other way for the visitor to link to the child page, you can choose to make the page titles link to the child page by setting the <code>link_titles</code> parameter to <code>\"true\"</code>:</p>\n<pre><code>[child_pages link_titles=\"true\"]\n</code></pre>\n<p>(This is mainly designed to be used with the <code>hide_more</code> parameter, but can be used independently if you want to have both the titles and &#8220;Read more &#8230;&#8221; text link to the child page.)</p>\n<p>When specifying <code>link_titles=\"true\"</code>, you may wish to apply your own styling to the links. To do so, you can specify a style using the <code>title_link_class</code> parameter:</p>\n<pre><code>[child_pages link_titles=\"true\" title_link_class=\"my_title_link_class\"]\n</code></pre>\n<p>You may also hide the titles altogether by setting the <code>hide_title</code> parameter to <code>\"true\"</code>:</p>\n<pre><code>[child_pages hide_title=\"true\"]\n</code></pre>\n<p>You can display a thumbnail of the featured image for each page (if set) by setting the <code>thumbs</code> parameter to <code>\"true\"</code>:</p>\n<pre><code>[child_pages thumbs=\"true\"]\n</code></pre>\n<p>You can now also display thumbnails at different sizes to the default (&#8216;medium&#8217;) size. Simply specify the thumbnail size in the <code>thumbs</code> parameter. You can even specify custom image sizes.</p>\n<pre><code>[child_pages thumbs='large']\n</code></pre>\n<p>You can make thumbnails link to the related child page by setting the <code>link_thumbs</code> to <code>\"true\"</code>:</p>\n<pre><code>[child_pages thumbs='large' link_thumbs=\"true\"]\n</code></pre>\n<p>&#8230; note that specifying the <code>link_thumbs</code> parameter will have no effect unless the <code>thumbs</code> parameter is set to either <code>true</code> or a thumbnail size.</p>\n<p>You can specify a target for the links added by the plugin by setting the <code>link_target</code> parameter. This will work exactly the same as setting the <code>target</code> parameter for the HTML <code>&lt;a&gt;</code> tag:</p>\n<pre><code>[child_pages link_target=\"_blank\"]\n</code></pre>\n<p>You can limit the length of the excerpt by specifying the <code>words</code> parameter:</p>\n<pre><code>[child_pages words=\"10\"]\n</code></pre>\n<p>You can hide the excerpt altogether by setting the <code>hide_excerpt</code> parameter to <code>\"true\"</code>:</p>\n<pre><code>[child_pages hide_excerpt=\"true\"]\n</code></pre>\n<p>You can stop Custom Excerpts from being truncated by setting the <code>truncate_excerpt</code> parameter to &#8220;false&#8221;:</p>\n<pre><code>[child_pages truncate_excerpt=\"false\"]\n</code></pre>\n<p>&#8230; this will display custom excerpts exactly as entered without being shortened. (Especially useful if using the Rich Text Excerpts plugin, in which case all styling will be preserved.)</p>\n<p>When <code>truncate_excerpt</code> is set to <code>true</code>, excerpts will be truncated only if they exceed the specified word count (default 55). When custom excerpts are truncated, any HTML will be removed.</p>\n<p>If you have inserted <code>more</code> tags into your posts/pages, you may find that the <code>Continue reading</code> message is included in the excerpt. To hide this, set the <code>hide_wp_more</code> parameter to <code>true</code>:</p>\n<pre><code>[child_pages hide_wp_more=\"true\"]\n</code></pre>\n<p>IF you wish to display the full contents of the listed pages, you can set the <code>show_page_content</code> parameter to <code>true</code>:</p>\n<pre><code>[child_pages show_page_content=\"true\"]\n</code></pre>\n<p>To change the order in which the child pages are listed, you can use the <code>orderby</code> and <code>order</code> parameters:</p>\n<pre><code>[child_pages orderby=\"title\" order=\"ASC\"]\n</code></pre>\n<p>The <code>orderby</code> parameter can have one of the following values:<br />\n    menu_order (the default value) &#8211; shows the pages sorted by the order in which they appear within the WordPress admin</p>\n<pre><code>id sorts the pages according to the ID of the page\ntitle sorts the pages alphabetically by the title\nslug sorts the pages alphabetically according to the slug (page_name) of the page\nauthor sorts the pages by author\ndate sorts the pages by the date they were created\nmodified sorts the pages by the date they were modified\nrand shows the pages in a random order\n</code></pre>\n<p>The <code>order</code> parameter can be set to:</p>\n<pre><code>ASC shows the pages in ascending order, sorted by the value of `orderby`\nDESC shows the pages in descending order, sorted by the value of `orderby`\n</code></pre>\n<p>You can now also use the <code>skin</code> parameter to choose a colour scheme for the Child Pages as follows:</p>\n<pre><code>[child_pages skin=\"simple\"] (the default colour scheme)\n[child_pages skin=\"red\"]\n[child_pages skin=\"green\"]\n[child_pages skin=\"blue\"]\n</code></pre>\n<p>If you want to style the child page boxes yourself, you can also specify the <code>class</code> parameter. If used, this overrides the <code>span</code> parameter and adds the specified class name to the generated HTML:</p>\n<pre><code>[child_pages class=\"myclass\"]\n</code></pre>\n<p>If you are not using the provided skins, you can prevent the CSS file for the skins from being loaded from the CC Child Pages options under the Settings menu.</p>\n<p>Finally, you can also display just an unordered list (<code>&lt;ul&gt;</code>) of child pages by adding the <code>list</code> parameter. In this case, all other parameters are ignored <strong>except for <code>class</code>, <code>cols</code>, <code>exclude</code>, <code>orderby</code>, <code>order</code> and <code>id</code></strong>.</p>\n<pre><code>[child_pages list=\"true\"]\n</code></pre>\n<p>When using the <code>list</code> parameter, you can also specify the <code>depth</code> parameter to specify how many levels in the hierarchy of pages are to be included in the list.</p>\n<p>The <code>depth</code> parameter accepts the following values:</p>\n<ul>\n<li>0 (default) Displays pages at any depth and arranges them hierarchically in nested lists </li>\n<li>-1 Displays pages at any depth and arranges them in a single, flat list </li>\n<li>1 Displays top-level Pages only </li>\n<li>\n<p>2, 3 … Displays Pages to the given depth</p>\n<p>[child_pages list=&#8221;true&#8221; depth=&#8221;4&#8243;]</p>\n</li>\n</ul>\n<p>Specifying the <code>cols</code> parameter with <code>list=\"true\"</code> will show the child pages as an unordered list ordered into a number of columns (I would recommend avoiding the use of the <code>depth</code> parameter when listing child pages within columns &#8211; the results are likely to be fairly unreadable!).</p>\n<pre><code>[child_pages list=\"true\" cols=\"3\"]\n</code></pre>\n<p>The columns are responsive, and should adjust according to the browser being re-sized or the size of the screen being used.</p>\n<p><strong>N.B. Because the shortcode uses the WordPress <code>wp_list_pages</code> function to output the list, columns are acheived by applying CSS styling to the functions standard output. This CSS should work fine in modern browsers, but in older browsers (such as Internet Explorer 8) the list will not be split into columns</strong></p>\n<p>The <code>depth</code> parameter can now also be used with the shortcode when <code>list</code> is not set or is is set to <code>\"false\"</code>.</p>\n<p>If <code>depth</code> is set, the sub-pages for each child page will be shown as an ordered list. You can specify a title for this element by setting the <code>subpage_title</code> parameter:</p>\n<pre><code>[child_pages depth=\"3\" subpage_title=\"Sub-pages\"]\n</code></pre>\n<h4>Private Pages</h4>\n<p>By default the shortcode (as of verion 1.36) will show pages that have their visibility set to <code>publish</code>, with pages with a visibility of <code>private</code> added for logged in users that have access to these pages.</p>\n<p>You can specify which pages to show by using the <code>post_status</code> parameter, which can take the following values:</p>\n<ul>\n<li><code>publish</code> &#8211; published, publicly viewable pages</li>\n<li><code>pending</code> &#8211; pages which are pending review</li>\n<li><code>draft</code> &#8211; pages which have not yet been published and have the draft status</li>\n<li><code>auto-draft</code> &#8211; newly created pages with no content</li>\n<li><code>future</code> &#8211; pages with the publish date set in the future</li>\n<li><code>private</code> &#8211; pages which are not visible to users who are not logged in</li>\n<li><code>inherit</code> &#8211; revisions</li>\n<li><code>trash</code> &#8211; pages which have been moved to the trash awaiting deletion</li>\n<li><code>any</code> &#8211; pages with  any status except those from post statuses with &#8216;exclude_from_search&#8217; set to true (i.e. <code>trash</code> and <code>auto-draft</code>)</li>\n</ul>\n<p>Some of these values are unlikely to be helpful in everyday use.</p>\n<p>For example:</p>\n<pre><code>[child_pages post_status=\"publish\"]\n</code></pre>\n<p>To specify a number of statuses, provide a comma-separated list:</p>\n<pre><code>[child_pages post_status=\"publish,private\"]\n</code></pre>\n<h4>Post Meta</h4>\n<p>You can show the author, date created and/or date modified for a post by using <code>show_author</code>, <code>show_date_created</code> and <code>show_date_modified</code> parameters. If set to <code>true</code>, they will show the corresponding information:</p>\n<pre><code>[child_pages show_author=\"true\" show_date_created=\"true\"]\n</code></pre>\n<h4>Sibling Pages</h4>\n<p>The shortcode also allows you to display sibling pages (those at the same level as the current page within the hierarchy).</p>\n<p>To do this, set the <code>siblings</code> parameter to <code>true</code>.</p>\n<p>This will override the <code>id</code> parameter and will append the current page to the <code>exclude</code> parameter.</p>\n<pre><code>[child_pages siblings=\"true\"]\n</code></pre>\n<p>This can also be used with the <code>list</code> parameter</p>\n<pre><code>[child_pages siblings=\"true\" list=\"true\"]\n</code></pre>\n<p>By default, the shortcode will not display the current page when <code>siblings</code> is set to <code>true</code>. If you wish to include the current page, set the <code>show_current_page</code> parameter to <code>true</code>:</p>\n<pre><code>[child_pages siblings=\"true\" show_current_page=\"true\"]\n\n[child_pages siblings=\"true\" list=\"true\" show_current_page=\"true\"]\n</code></pre>\n<h4>Limits</h4>\n<p>You can limit the number of child pages displayed using the <code>limit</code> parameter (unless the <code>list</code> parameter has been set to <code>\"true\"</code>).</p>\n<p>For example:</p>\n<pre><code>[child_pages limit=\"5\"] will display only the first 5 child pages.\n</code></pre>\n<h4>Offset</h4>\n<p>When not using <code>list=\"true\"</code>, you can specify a value for <code>offset</code> to skip a set number of results. For example:</p>\n<pre><code>[child_pages offset=\"2\"]\n</code></pre>\n<p>&#8230; will skip the first 2 pages.</p>\n<h4>Custom Fields</h4>\n<p>You may wish to show a different title, excerpt, &#8220;Read more&#8230;&#8221; message or thumbnail on certain pages. To achieve this, you can set values in custom fields on specific pages &#8211; to tell the shortcode to use the custom value, set the <code>use_custom_excerpt</code>, <code>use_custom_title</code>, <code>use_custom_more</code> or <code>use_custom_thumbs</code> parameter to the name of the custom field to be used.</p>\n<p>If the field used is set for a page, its value will be used instead of the default excerpt/title/&#8221;Read more&#8230;&#8221;. Pages on which the custom field is not populated will use the default value.</p>\n<pre><code>[child_pages use_custom_excerpt=\"custom_cc_excerpt\"]\n</code></pre>\n<p>&#8230; will replace the standard excerpt with the value of the custom field <code>custom_cc_excerpt</code> (if it is set)</p>\n<pre><code>[child_pages use_custom_title=\"custom_cc_title\"]\n</code></pre>\n<p>&#8230; will replace the standard title with the value of the custom field <code>custom_cc_title</code> (if it is set)</p>\n<pre><code>[child_pages use_custom_thumbs=\"custom_cc_thumnail\"]\n</code></pre>\n<p>&#8230; will replace the standard thumbnail with one specified in the value of the custom field <code>custom_cc_thumnail</code> (if it is set). The value of the <code>custom_cc_thumnail</code> custom field can either be set to the ID of the image attachment (using the <a href=\"https://wordpress.org/plugins/advanced-custom-fields/\" rel=\"ugc\">Advanced Custom Fields</a> plugin can make this much easier to use) or to the full URL of the image.</p>\n<pre><code>[child_pages use_custom_more=\"custom_cc_more\"]\n</code></pre>\n<p>&#8230; will replace the standard &#8220;Read more&#8230;&#8221; message with the value of the custom field <code>custom_cc_more</code> (if it is set)</p>\n<pre><code>[child_pages use_custom_link=\"custom_cc_link\"]\n</code></pre>\n<p>&#8230; will replace URL link for the page with the URL specified in the value of the custom field <code>custom_cc_link</code> (if it is set). (The default value of <code>use_custom_link</code> is <code>\"cc_child_pages_link\"</code>, so that this field can be set without the need to specify the parameter. To disable this functionality, set <code>use_custom_link=\"\"</code>.)</p>\n<pre><code>[child_pages use_custom_link_target=\"custom_cc_link_target\"]\n</code></pre>\n<p>&#8230; will replace the link target for titles, thumbnails and the &#8220;Read more&#8230;&#8221; text with the value specified in the custom field <code>custom_cc_link_target</code> (if it is set). (The default value of <code>use_custom_link_target</code> is <code>\"cc_child_pages_link_target\"</code>, so that this field can be set without the need to specify the parameter. To disable this functionality, set <code>use_custom_link_target=\"\"</code>.)</p>\n<p><strong>N.B.</strong> <code>use_custom_excerpt</code>, <code>use_custom_title</code>, <code>use_custom_more</code>, <code>use_custom_link</code> <code>use_custom_link_target</code> and <code>use_custom_thumbs</code> will not work when <code>list=\"true\"</code></p>\n<h4>Pagination</h4>\n<p>CC Child Pages now includes basic support for pagination.</p>\n<p>You can set the number of child pages to be displayed on each page by specifying the <code>posts_per_page</code> parameter, e.g.:</p>\n<pre><code>[child_pages posts_per_page=\"6\"]\n</code></pre>\n<p>The above code will display 6 child pages on each page, and if there are more than 6 child pages found navigation links will be displayed.</p>\n<p>You can also specify the <code>page</code> parameter to display a specific page. For example:</p>\n<pre><code>[child_pages posts_per_page=\"3\" page=\"2\"]\n</code></pre>\n<p>The above code will show the second page of results (item 4 onwards, up to 3 items). <strong>N.B.</strong> when the <code>page</code> parameter is specified, no pagination links are displayed.</p>\n<p>The <code>page</code> parameter has no effect unless <code>posts_per_page</code> is specified.</p>\n<p><strong>Pagination functionality is limited on a static front page</strong></p>\n<p><strong>N.B.</strong> The pagination parameters are ignored when <code>list=\"true\"</code></p>\n<h4>Sticky Posts</h4>\n<p>By default, sticky posts are not shown &#8230; however, if you want them to be displayed you can set the <code>ignore_sticky_posts</code> parameter to be <code>false</code>:</p>\n<pre><code>[child_pages ignore_sticky_posts=\"false\"]\n</code></pre>\n",
    "download_link": "https://downloads.wordpress.org/plugin/cc-child-pages.1.45.zip",
    "upgrade_notice": {
        "1.45": "<ul>\n<li>Maintenance release- minor bug fix to setting page.</li>\n</ul>",
        "1.44": "<ul>\n<li>Maintenance release with security improvements to legacy widget.</li>\n</ul>",
        "1.43": "<ul>\n<li>Maintenance release with security improvements.</li>\n</ul>",
        "1.42": "<ul>\n<li>Bug fix for <code>hide_titles</code> function to stop it breaking custom templates.</li>\n</ul>",
        "1.41": "<ul>\n<li>Added <code>hide_titles</code> option. Small bug fix for widget.</li>\n</ul>",
        "1.40": "<ul>\n<li>Maintenance release. Added Exclude Tree option to widget</li>\n</ul>",
        "1.39": "<ul>\n<li>Small fix to CC Child Pages Widget</li>\n</ul>",
        "1.38": "<ul>\n<li>Small fix to CSS for page navigation links</li>\n</ul>",
        "1.37": "<ul>\n<li>Small changes to try to prevent problems interacting with other plugins that may not return correct values in their filters</li>\n</ul>",
        "1.36": "<ul>\n<li>Bug fix - by default private pages will be visible or hidden depending on whether the user is logged in</li>\n<li>Added <code>post_status</code> parameter to show child pages with specific statuses</li>\n<li>Added button to the settings page to disable loading of Skins CSS file if not being used (for performance)</li>\n<li>Added additional classes to child page elements to allow styling of elements with parent pages (and even specific parent pages)</li>\n<li>Added <code>use_custom_thumbs</code> parameter - specify the name of a custom field that will specify the ID or URL of an image to use as a thumbnail</li>\n</ul>",
        "1.35": "<ul>\n<li>Bug fix - implemented code to remove <code>[child_pages]</code> shortcode from pages before generating excerpts to avoid getting stuck in an infinite loop under some circumstances</li>\n<li>Added <code>show_page_content</code> parameter to show complete page content</li>\n<li>Added <code>link_target</code> and <code>use_custom_link_target</code> parameters to allow control of how links open</li>\n<li><code>depth</code> now works with the shortcode when not using <code>list</code> mode. Added <code>subpage_title</code> parameter to display a title for sub-pages whe <code>depth</code> is greater than 1 and <code>list=&amp;quot;true&amp;quot;</code> is NOT specified</li>\n<li>Added <code>show_author</code>, <code>show_date_created</code> and <code>show_date_modified</code> parameters to allow display of post information</li>\n<li><code>order</code> can now be set to <code>rand</code> to show items in a random order</li>\n</ul>",
        "1.34": "<ul>\n<li>Added <code>ignore_sticky_posts</code> parameter</li>\n<li>Added <code>limit</code> parameter to limit the number of pages displayed</li>\n<li>Added <code>offset</code> parameter to allow skipping a number of pages</li>\n</ul>",
        "1.33": "<ul>\n<li>Added <code>posts_per_page</code> and <code>page</code> parameters for basic pagination</li>\n<li>Added <code>page_ids</code> parameter to allow display of specific pages</li>\n<li>Added <code>use_custom_link</code> parameter to allow the over-riding of the link target on a per page basis</li>\n<li>Added new CSS IDs to help make styling more flexible</li>\n</ul>",
        "1.32": "<ul>\n<li>Bug fix - widget was displaying sibling pages instead of child pages under certain circumstances</li>\n</ul>",
        "1.31": "<ul>\n<li>Added <code>siblings</code> option to the widget</li>\n<li>Added <code>show_current_page</code> option for use with the shortcode when <code>siblings</code> is set to <code>true</code></li>\n<li>Added <code>hide_wp_more</code> to remove the standard &quot;Continue reading...&quot; message from excerpts</li>\n<li>Added <code>use_custom_excerpt</code>, <code>use_custom_title</code> and <code>use_custom_more</code> to the shortcode</li>\n<li>Added more filters and actions to widget and shortcode to allow extension of plugin</li>\n</ul>",
        "1.30": "<ul>\n<li>Bug fix - internationalization now works correctly (translations need work though - currently only French, which is known to be poor)</li>\n<li>Added more filters to widget, list and shortcode to allow extension of plugin</li>\n</ul>",
        "1.29": "<ul>\n<li>Bug fix - widget will now show on all pages/posts if &quot;All Pages&quot; or a specific parent page is selected</li>\n<li>Bug fix - shortcode now closes query correctly (was causing issues with some themes)</li>\n<li>The shortcode will now work with custom post types</li>\n<li>You can now specify multiple parent page IDs (when using <code>list=&amp;quot;true&amp;quot;</code>, only a single parent ID can be specified)</li>\n</ul>",
        "1.28": "<ul>\n<li>Further improvements to integration when used with Video Thumbnails plugin</li>\n</ul>",
        "1.27": "<ul>\n<li>Added the <code>siblings</code> parameter to show siblings of current page</li>\n<li>Improved integration when used with Video Thumbnails plugin</li>\n<li>Minor bug fixes for CC Child Pages Widget</li>\n</ul>",
        "1.26": "<ul>\n<li>The CSS for displaying child pages has been re-written to allow for custom CSS to be more easily written - for example, specifying a border should no longer cause problems in the responsive layout. Fallbacks have been put in place for older versions of Internet Explorer.</li>\n<li>The handling of Custom CSS from the settings page has been improved.</li>\n<li>The loading of the plugin CSS has been returned to the default manner. While this means that CSS is loaded on pages where the shortcode is not used, it means that the CSS can be correctly minified by other plugins and ensures that valid HTML is generated.</li>\n</ul>",
        "1.25": "<ul>\n<li>New option added to widget to show all top-level pages and their children. This can now be used as a complete replacement for the standard Pages widget</li>\n<li>New option added to the plugins settings page allowing custom CSS code to be specified from within the plugin. This feature has been requested several times. This functionality will be expanded on in the future.</li>\n</ul>",
        "1.23": "<ul>\n<li>Minor fix for CSS when using both the <code>list</code> and <code>cols</code> parameters</li>\n</ul>",
        "1.22": "<ul>\n<li>Changes to how excerpts are generated from content when no custom excerpt is specified.</li>\n<li>Changed how CSS is queued - the CSS file will now only be included in the page if the shortcode is specified, helping to keep page sizes to a minimum.</li>\n</ul>",
        "1.21": "<ul>\n<li>Change to allow <code>cols</code> parameter to be used when <code>list</code> parameter is set to <code>true</code>.</li>\n<li>Changed <code>.ccpages_excerpt</code> container to <code>(was</code>) to avoid potentially invalid HTML when HTML excerpts are used.</li>\n</ul>",
        "1.20": "<ul>\n<li>Change to improve efficiency when the plugin attempts to force thumbnail creation via Video Thumbnails plugin</li>\n<li>Minor change to avoid output of empty links when applying links to thumbnails and no thumbnail is present</li>\n<li>Minor change to escaping special characters in <code>more</code> parameter</li>\n</ul>",
        "1.19": "<ul>\n<li>Small change to how the plugin works with thumbnails. It will now use thumbnails generated by the Video Thumbnails plugin if it is installed.</li>\n<li>Added <code>link_thumbs</code> parameter. If set to <code>&amp;quot;true&amp;quot;</code>, thumbnails will link to the child page.</li>\n<li>CSS is no longer minified, in order to make it easier to view existing CSS when defining your own custom styles. The CSS can be minified by other plugins if required.</li>\n</ul>",
        "1.18": "<ul>\n<li>Added settings page to allow disabing of button in Visual Editor (TinyMCE)</li>\n<li>Added the <code>truncate_excerpt</code> parameter to the shortcode, defaults to <code>true</code> but setting to <code>false</code> stops custom excerpts from being shortened (where no custom excerpt exists, page content will still be truncated)</li>\n</ul>",
        "1.17": "<ul>\n<li>Small change to how custom excerpts are handled for interoperability with Rich Text Excerpts plugin.</li>\n</ul>",
        "1.16": "<ul>\n<li>Added the <code>hide_excerpt</code> parameter</li>\n</ul>",
        "1.15": "<ul>\n<li>Added <code>hide_more</code> parameter to hide &quot;Read more ...&quot; links.</li>\n<li>Added <code>link_titles</code> parameter to make titles link to pages.</li>\n<li>Added <code>title_link_class</code> parameter for styling links in page titles.</li>\n</ul>",
        "1.14": "<ul>\n<li>Bug fix: Corrected missing `` tags in widget</li>\n<li>Minor CSS changes to improve compatibility with certain themes</li>\n</ul>",
        "1.13": "<p>Bug fix: Corrected problem with titles including special characters\nAdded orderby and order parameters to control the display order of child pages</p>",
        "1.12": "<p>Bug fix: Corrected problem when automatic excerpt returns value including a shortcode</p>",
        "1.11": "<p>Bug fix: Corrected small bug introduced in version 1.10 when using <code>list=&amp;quot;true&amp;quot;</code></p>",
        "1.10": "<p>Added exclude parameter for shortcode, and depth parameter for shortcode when list output is selected.</p>",
        "1.9": "<p>Added editor button, added custom excerpt capability to pages, enhanced thumbnail options and refined excerpt generation from page content</p>",
        "1.8": "<p>CC Child Pages widget enhanced to allow display of children of current page or a specific page. Depth can also be specified.</p>",
        "1.7": "<p>Added new CC Child Pages Widget. Added lots of new classes to help with custom CSS styling.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/cc-child-pages/assets/screenshot-1.png?rev=1012694",
            "caption": "One column: <code>[child_pages cols=\"1\"]</code>"
        },
        {
            "src": "https://ps.w.org/cc-child-pages/assets/screenshot-2.png?rev=1012694",
            "caption": "Two columns (default): <code>[child_pages]</code> or <code>[child_pages cols=\"2\"]</code>"
        },
        {
            "src": "https://ps.w.org/cc-child-pages/assets/screenshot-3.png?rev=1012694",
            "caption": "Three columns: <code>[child_pages cols=\"3\"]</code>"
        },
        {
            "src": "https://ps.w.org/cc-child-pages/assets/screenshot-4.png?rev=1012694",
            "caption": "Four columns: <code>[child_pages cols=\"4\"]</code>"
        },
        {
            "src": "https://ps.w.org/cc-child-pages/assets/screenshot-5.png?rev=1012694",
            "caption": "Skin for Red colour schemes: <code>[child_pages skin=\"red\"]</code>"
        },
        {
            "src": "https://ps.w.org/cc-child-pages/assets/screenshot-6.png?rev=1012694",
            "caption": "Skin for Green colour schemes: <code>[child_pages skin=\"green\"]</code>"
        },
        {
            "src": "https://ps.w.org/cc-child-pages/assets/screenshot-7.png?rev=1012694",
            "caption": "Skin for Blue colour schemes: <code>[child_pages skin=\"blue\"]</code>"
        },
        {
            "src": "https://ps.w.org/cc-child-pages/assets/screenshot-8.png?rev=1012694",
            "caption": "Custom class defined for custom styling: <code>[child_pages class=\"myclass\"]</code>"
        },
        {
            "src": "https://ps.w.org/cc-child-pages/assets/screenshot-9.png?rev=1020056",
            "caption": "Show child pages as a list: <code>[child_pages list=\"true\"]</code>"
        },
        {
            "src": "https://ps.w.org/cc-child-pages/assets/screenshot-10.png?rev=1029304",
            "caption": "Using featured images as thumbnails: <code>[child_pages thumbs=\"true\"]</code>"
        },
        {
            "src": "https://ps.w.org/cc-child-pages/assets/screenshot-11.png?rev=1022891",
            "caption": "Limit word count of excerpt: <code>[child_pages words=\"10\"]</code>"
        },
        {
            "src": "https://ps.w.org/cc-child-pages/assets/screenshot-12.png?rev=1125753",
            "caption": "CC Child Pages widget options"
        }
    ],
    "tags": {
        "child-page": "child page",
        "child-pages": "child pages",
        "child-pages-shortcode": "child pages shortcode",
        "child-pages-widget": "child pages widget",
        "shortcode": "shortcode"
    },
    "stable_tag": "1.45",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/cc-child-pages.1.0.zip",
        "1.1": "https://downloads.wordpress.org/plugin/cc-child-pages.1.1.zip",
        "1.10": "https://downloads.wordpress.org/plugin/cc-child-pages.1.10.zip",
        "1.11": "https://downloads.wordpress.org/plugin/cc-child-pages.1.11.zip",
        "1.12": "https://downloads.wordpress.org/plugin/cc-child-pages.1.12.zip",
        "1.13": "https://downloads.wordpress.org/plugin/cc-child-pages.1.13.zip",
        "1.14": "https://downloads.wordpress.org/plugin/cc-child-pages.1.14.zip",
        "1.15": "https://downloads.wordpress.org/plugin/cc-child-pages.1.15.zip",
        "1.16": "https://downloads.wordpress.org/plugin/cc-child-pages.1.16.zip",
        "1.17": "https://downloads.wordpress.org/plugin/cc-child-pages.1.17.zip",
        "1.18": "https://downloads.wordpress.org/plugin/cc-child-pages.1.18.zip",
        "1.19": "https://downloads.wordpress.org/plugin/cc-child-pages.1.19.zip",
        "1.2": "https://downloads.wordpress.org/plugin/cc-child-pages.1.2.zip",
        "1.20": "https://downloads.wordpress.org/plugin/cc-child-pages.1.20.zip",
        "1.21": "https://downloads.wordpress.org/plugin/cc-child-pages.1.21.zip",
        "1.22": "https://downloads.wordpress.org/plugin/cc-child-pages.1.22.zip",
        "1.23": "https://downloads.wordpress.org/plugin/cc-child-pages.1.23.zip",
        "1.24": "https://downloads.wordpress.org/plugin/cc-child-pages.1.24.zip",
        "1.25": "https://downloads.wordpress.org/plugin/cc-child-pages.1.25.zip",
        "1.26": "https://downloads.wordpress.org/plugin/cc-child-pages.1.26.zip",
        "1.27": "https://downloads.wordpress.org/plugin/cc-child-pages.1.27.zip",
        "1.28": "https://downloads.wordpress.org/plugin/cc-child-pages.1.28.zip",
        "1.29": "https://downloads.wordpress.org/plugin/cc-child-pages.1.29.zip",
        "1.3": "https://downloads.wordpress.org/plugin/cc-child-pages.1.3.zip",
        "1.30": "https://downloads.wordpress.org/plugin/cc-child-pages.1.30.zip",
        "1.31": "https://downloads.wordpress.org/plugin/cc-child-pages.1.31.zip",
        "1.32": "https://downloads.wordpress.org/plugin/cc-child-pages.1.32.zip",
        "1.33": "https://downloads.wordpress.org/plugin/cc-child-pages.1.33.zip",
        "1.34": "https://downloads.wordpress.org/plugin/cc-child-pages.1.34.zip",
        "1.35": "https://downloads.wordpress.org/plugin/cc-child-pages.1.35.zip",
        "1.36": "https://downloads.wordpress.org/plugin/cc-child-pages.1.36.zip",
        "1.37": "https://downloads.wordpress.org/plugin/cc-child-pages.1.37.zip",
        "1.38": "https://downloads.wordpress.org/plugin/cc-child-pages.1.38.zip",
        "1.39": "https://downloads.wordpress.org/plugin/cc-child-pages.1.39.zip",
        "1.4": "https://downloads.wordpress.org/plugin/cc-child-pages.1.4.zip",
        "1.40": "https://downloads.wordpress.org/plugin/cc-child-pages.1.40.zip",
        "1.41": "https://downloads.wordpress.org/plugin/cc-child-pages.1.41.zip",
        "1.42": "https://downloads.wordpress.org/plugin/cc-child-pages.1.42.zip",
        "1.43": "https://downloads.wordpress.org/plugin/cc-child-pages.1.43.zip",
        "1.44": "https://downloads.wordpress.org/plugin/cc-child-pages.1.44.zip",
        "1.45": "https://downloads.wordpress.org/plugin/cc-child-pages.1.45.zip",
        "1.5": "https://downloads.wordpress.org/plugin/cc-child-pages.1.5.zip",
        "1.6": "https://downloads.wordpress.org/plugin/cc-child-pages.1.6.zip",
        "1.7": "https://downloads.wordpress.org/plugin/cc-child-pages.1.7.zip",
        "1.8": "https://downloads.wordpress.org/plugin/cc-child-pages.1.8.zip",
        "1.9": "https://downloads.wordpress.org/plugin/cc-child-pages.1.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/cc-child-pages.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://ccchildpages.ccplugins.co.uk/donate/",
    "banners": {
        "low": "https://ps.w.org/cc-child-pages/assets/banner-772x250.jpg?rev=1011302",
        "high": "https://ps.w.org/cc-child-pages/assets/banner-1544x500.jpg?rev=1011302"
    },
    "icons": {
        "1x": "https://ps.w.org/cc-child-pages/assets/icon-128x128.png?rev=1011343",
        "2x": "https://ps.w.org/cc-child-pages/assets/icon-256x256.png?rev=1011343"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "cc-child-pages",
            "language": "de_DE",
            "version": "1.45",
            "updated": "2024-08-01 08:47:56",
            "package": "http://downloads.wordpress.org/translation/plugin/cc-child-pages/1.45/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "cc-child-pages",
            "language": "de_DE_formal",
            "version": "1.45",
            "updated": "2024-08-01 08:48:47",
            "package": "http://downloads.wordpress.org/translation/plugin/cc-child-pages/1.45/de_DE_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "cc-child-pages",
            "language": "de_CH",
            "version": "1.45",
            "updated": "2024-08-01 08:49:36",
            "package": "http://downloads.wordpress.org/translation/plugin/cc-child-pages/1.45/de_CH.zip"
        },
        {
            "type": "plugin",
            "slug": "cc-child-pages",
            "language": "de_CH_informal",
            "version": "1.45",
            "updated": "2024-08-01 08:46:02",
            "package": "http://downloads.wordpress.org/translation/plugin/cc-child-pages/1.45/de_CH_informal.zip"
        },
        {
            "type": "plugin",
            "slug": "cc-child-pages",
            "language": "pt_BR",
            "version": "1.45",
            "updated": "2019-05-24 10:17:36",
            "package": "http://downloads.wordpress.org/translation/plugin/cc-child-pages/1.45/pt_BR.zip"
        },
        {
            "type": "plugin",
            "slug": "cc-child-pages",
            "language": "ru_RU",
            "version": "1.45",
            "updated": "2023-09-13 06:56:03",
            "package": "http://downloads.wordpress.org/translation/plugin/cc-child-pages/1.45/ru_RU.zip"
        }
    ]
}