{
    "name": "AI ChatBot for WordPress &#8211; WPBot",
    "slug": "chatbot",
    "version": "5.8.8",
    "author": "<a href=\"https://www.wpbot.pro/\">ChatBot for WordPress - WPBot</a>",
    "author_profile": "https://profiles.wordpress.org/quantumcloud/",
    "contributors": {
        "quantumcloud": {
            "profile": "https://profiles.wordpress.org/quantumcloud/",
            "avatar": "https://secure.gravatar.com/avatar/97d6007ecaef11f5d151452d87e5c479?s=96&d=monsterid&r=g",
            "display_name": "QuantumCloud"
        }
    },
    "requires": "4.6",
    "tested": "6.6.2",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 94,
    "ratings": {
        "5": 102,
        "4": 0,
        "3": 1,
        "2": 1,
        "1": 7
    },
    "num_ratings": 111,
    "support_url": "https://wordpress.org/support/plugin/chatbot/",
    "support_threads": 1,
    "support_threads_resolved": 1,
    "active_installs": 5000,
    "last_updated": "2024-10-16 08:23:00",
    "added": "2018-08-30",
    "homepage": "https://wordpress.org/plugins/chatbot/",
    "sections": {
        "description": "<h4>ChatBot for WordPress with AI &#8211; WPBot</h4>\n<p>WPBot is an easy to use, Native, No coding required, <strong>AI ChatBot for WordPress</strong> websites to provide <strong>automated Live Chat Support</strong>, <strong>Lead Generation</strong> and collecting information from your users. Best AI ChatBot for automated 24/7 customer support.</p>\n<p>This ChatBot can be also be powered by <strong>OpenAI ChatGPT</strong>, <strong>DialogFlow</strong>, or simply use the <strong>built-in features</strong> to provide Live Support, Lead Generation and collect data without <strong>any extra cost</strong>. Own and Manage this Native WordPress ChatBot directly from your WordPress Dashboard for improving customer support efficiency and user conversions.</p>\n<blockquote>\n<p>🚀 <a href=\"https://www.wpbot.pro/free-support/\" rel=\"nofollow ugc\">Support, Bug Report, Feature Requests</a> | <a href=\"https://www.wpbot.pro/\" rel=\"nofollow ugc\">ChatBot for WordPress</a> Demo | <strong> for Advanced Features Upgrade to <a href=\"https://www.wpbot.pro/\" rel=\"nofollow ugc\">WPBot Pro Now!</a></strong></p>\n<p>++ Get the <a href=\"https://wordpress.org/plugins/conversational-forms/\" rel=\"ugc\">Free Conversational Forms</a> chatbot addon for <strong>Lead Generation</strong>, Collecting Data from users, <strong>Booking</strong>, Appointments, Scheduling etc.</p>\n<p>++ Upgrade to <a href=\"https://www.wpbot.pro/\" rel=\"nofollow ugc\">WPBot Pro</a> to power your WPBot ChatBot with OpenAI (ChatGPT) fine tuning and GPT Assistant features.</p>\n<p>++ <strong>OpenAI ChatGPT</strong> latest models are supported in this ChatBot. OpenAI’s API provides access to ChatGPT for a wide variety of natural language tasks. You can limit the ChatBot&#8217;s OpenAI responses based on keywords inclusion or exclusion to reduce token cost</p>\n<p>++ WPBot ChatBot is compatible with DialogFlow V2.</p>\n<p>++ WPBot ChatBot free and pro versions can display links to the relevant web pages on your website with all GPT responses.</p>\n<p>++ The WPBot ChatBot Pro versions can also support Tavily Search API, Zapier, Web Hooks, Fluent CRM, Hubspot CRM and more options like <strong>Generate and Upload website contents</strong> as JSON file to your GPT Assistant for AI training. GPT Assistant also support <strong>uploading PDF or Word File </strong>to analyze and answer any user questions through the ChatBot.</p>\n</blockquote>\n<p>This ChatBot can work both in <strong>Natural Language Processing Mode</strong> and <strong>Button Menu Driven</strong> Mode. WPBot also works with <strong>any language</strong> by customizing the texts used by the WPBot from the Dashboard. AI-powered chatbot for online customer service, to answer user questions about your product or services and also for Lead Generation and <strong>collecting data</strong> from the users using <strong>conversational forms</strong> addon for WPBot.</p>\n<p>Change all the WPBOT live chat bot responses and make this work in <strong>any language</strong> with very little effort. <strong>RTL</strong> is supported. Use this handy ChatBot as a practical means for your website users to save time, improve engagement, generate leads, handle FAQs, showcase your stuff! It is also great as a HelpDesk, Contact Bot, FAQ ChatBot or feedback bot to increase user conversions and customer leads.</p>\n<p>WPBot pro is available with advanced features like <strong>Onsite Retargeting</strong> by showing special offers and coupons on <strong>Exit Intent</strong>, time interval or page scroll-down. <strong>Embed the WPBot on any website</strong>, integrated <strong>Live Chat </strong>Support, Messenger Bot, Instagram Bot, Whatsapp Bot, White label chatbot, Chat history logs, Extended site search, MailChimp, <strong>Zapier, Webhook Integration</strong> and more! With the WPBot Professional and Master licenses you can generate a <strong>JSON training file</strong> with your own <strong>website data</strong> that you can upload to your GPT Assistant so that the AI can provide customized ChatBot responses.</p>\n<h4>How does the ChatBot work?</h4>\n<p>Please check this article for more info on <a href=\"https://www.wpbot.pro/how-it-works/\" rel=\"nofollow ugc\">how the ChatBot works</a>.</p>\n<h4>How to train AI with your website data using ChatBot</h4>\n<p>You can train an OpenAI model for the ChatBot with your data using one of the two methods (requires WPBot Pro Professional or Master License): Fine Tuning or GPT Assistant</p>\n<p>We suggest using GPT Assistant as this is easier, quicker, and more flexible. Our ChatBot for WordPress WPBot allows you to easily generate a JSON file containing all your website data that you can upload to your GPT Assistant. Here is a guideline for <a href=\"https://wpbot.pro/docs/knowledgebase/how-to-train-ai-with-your-website-data-using-chatbot/\" rel=\"nofollow ugc\">How to train AI with your website data using WPBot</a></p>\n<h4>How to save money and reduce OpenAI API cost for your ChatBot</h4>\n<p>You can <strong>dramatically decrease</strong> the OpenAI API cost by using chatbot for WordPress’s default features (which are free) in combination with OpenAI.<br />\nHere is a short guideline for <a href=\"https://wpbot.pro/docs/knowledgebase/how-to-save-money-and-reduce-openai-api-cost-for-your-chatbot/\" rel=\"nofollow ugc\">How to reduce OpenAI API cost for your ChatBot</a></p>\n<h4>WPBot ChatBot free version features</h4>\n<p>WPBot provides the following ChatBot features:</p>\n<ul>\n<li>Built-in, plugin n play ChatBot features</li>\n<li>Supports any languages like French, Spanish etc. including RTL</li>\n<li>Create simple <strong>text responses</strong> easily from your WordPress backend.</li>\n<li>Add hyperlinks in response message content using HTML markup.</li>\n<li>Set on which pages the chat bot will display</li>\n<li>Fine tune the floating icon position</li>\n<li>Upload Custom Icons</li>\n<li>Show a List of FAQ or Frequently Asked Questions defined by you</li>\n<li>Let users email you any question or feedback they may have</li>\n<li>Let users leave their phone number so you can call them back</li>\n<li>Option to display Start Menu After Greetings</li>\n<li>Create Conversational drag and drop forms with a free AddOn</li>\n<li>Integrate with Google&#8217;s Dialogflow Agent API or Tavily Search API to process natural language queries.</li>\n<li>Integrate with OpenAI ChatGPT for responses based on keywords you define</li>\n<li>Display links to the relevant web pages on your website with all the GPT responses.</li>\n</ul>\n<h4>What can you do with this ChatBot?</h4>\n<p>⭐ Use the best chatbot for customer service 24/7<br />\n⭐ Use this chatbot for lead generation with conversational forms<br />\n⭐ Use this chatbot for scheduling appointments or booking<br />\n⭐ Use this chatbot for lead generation and qualification<br />\n⭐ Use as a FAQ chatbot for websites<br />\n⭐ AI-powered chatbot with natural language processing<br />\n⭐ Use as scalable customer support system and personalized customer support experiences<br />\n⭐ Use this ChatBot for reducing customer support response time<br />\n⭐ Multilingual chatbot for international customers (Pro feature)<br />\n⭐ Lower webpage bounce rate<br />\n⭐ Longer user time on site<br />\n⭐ Voice-enabled chatbot for customer service (Pro feature)<br />\n⭐ Collect information and data from the website users</p>\n<h4>Who can benefit from WPBot ChatBot?</h4>\n<p>Chatbots can provide valuable benefits to a wide range of businesses by improving customer service, increasing efficiency, and enhancing user engagement. Here are some specific types of businesses that can significantly benefit from implementing chatbots:</p>\n<ol>\n<li>\n<p><strong>ChatBot for E-commerce and Retail</strong>:</p>\n<ul>\n<li><strong>Customer Support</strong>: Provide 24/7 assistance, answer FAQs, track orders, and handle returns.</li>\n<li><strong>Sales Assistance</strong>: Offer product recommendations, show featured products, and support during the purchasing process.</li>\n<li><strong>Abandoned Cart Recovery</strong>: Engage customers who have abandoned their shopping carts with personalized messages and offers.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Healthcare Industry</strong>:</p>\n<ul>\n<li><strong>Appointment Scheduling</strong>: Automate the booking of appointments.</li>\n<li><strong>Patient Information</strong>: Provide initial information on symptoms, treatments, and healthcare services.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Financial Services and Banking</strong>:</p>\n<ul>\n<li><strong>Customer Service</strong>: Handle frequently asked questions, provide information on products and services, and assist with troubleshooting.</li>\n<li><strong>Loan and Credit Applications</strong>: Guide users through loan applications.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Real Estate</strong>:</p>\n<ul>\n<li><strong>Lead Generation</strong>: Qualify leads by answering property queries and scheduling viewings.</li>\n<li><strong>Customer Support with ChatBot</strong>: Provide information on property listings, market conditions, and financing options.</li>\n<li><strong>Virtual Property Tours</strong>: Offer virtual tours and answer questions about properties.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Travel and Hospitality Industry</strong>:</p>\n<ul>\n<li><strong>Booking Services</strong>: Automate booking of flights, hotels, and vacation packages.</li>\n<li><strong>Customer Support</strong>: Assist with cancellations, and provide travel information.</li>\n<li><strong>Personalized Recommendations</strong>: Offer travel tips, destination information, and personalized vacation packages.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Education</strong>:</p>\n<ul>\n<li><strong>Student Support</strong>: Provide information on courses, application procedures, and campus life.</li>\n<li><strong>Tutoring</strong>: Offer automated tutoring sessions and study resources.</li>\n<li><strong>Administrative Assistance</strong>: Help with enrollment, scheduling</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Human Resources (HR)</strong>:</p>\n<ul>\n<li><strong>Recruitment</strong>: Screen candidates, schedule interviews, and answer job-related questions.</li>\n<li><strong>Employee Support</strong>: Assist with onboarding, provide HR policy information, and handle employee queries.</li>\n<li><strong>Performance Reviews</strong>: Automate the collection of feedback and performance reviews.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Customer Service-oriented Businesses</strong>:</p>\n<ul>\n<li><strong>Telecommunications</strong>: Handle billing inquiries, technical support, and service issues.</li>\n<li><strong>Utilities</strong>: Manage service requests, provide outage updates, and assist with billing inquiries.</li>\n<li><strong>Insurance</strong>: Help with policy information, claim processing, and provide quotes.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Marketing and Advertising</strong>:</p>\n<ul>\n<li><strong>Lead Generation</strong>: Qualify leads and collect customer information.</li>\n<li><strong>Engagement</strong>: Run interactive campaigns, quizzes, and promotions.</li>\n<li><strong>Customer Feedback</strong>: Collect feedback and conduct surveys to improve services.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Event Management</strong>:</p>\n<ul>\n<li><strong>Event Registration</strong>: Streamline the registration process for events, conferences, and webinars.</li>\n<li><strong>Attendee Engagement</strong>: Provide event schedules, speaker information, and answer attendee questions.</li>\n<li><strong>Feedback Collection</strong>: Gather feedback and reviews from event participants.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Restaurants and Food Services</strong>:</p>\n<ul>\n<li><strong>Order Placement</strong>: Automate the ordering process and provide menu recommendations.</li>\n<li><strong>Reservations</strong>: Handle table reservations.</li>\n<li><strong>Customer Feedback</strong>: Collect reviews and feedback from customers.</li>\n</ul>\n</li>\n</ol>\n<p>Take advantage of OpenAI GPT Assistant or Google&#8217;s AI and Natural Language Processing with this ChatBot<br />\n🚀 Outstanding chatbot conversational experience<br />\n🚀 Fully automated. Extremely simple to use, No coding required Plug n&#8217; play Bot</p>\n<h4>WPBOT Pro Version</h4>\n<p>WPBot Pro version is a multi-language supported chatbot. It is an affordable chatbot services for SMEs to provide multilingual chatbot for international customers.</p>\n<h4>WPBot Pro feature highlights</h4>\n<p><strong>Interactions</strong></p>\n<ul>\n<li>Create simple <strong>text responses</strong> easily from your WordPress backend.</li>\n<li>Create <strong>FAQ area</strong> with multiple questions and answers with Categories (supports html)</li>\n<li>Send <strong>eMail</strong>, <strong>Call Me Back</strong> &amp; <strong>Feedback</strong> Collection</li>\n<li>Collect <strong>User eMail </strong>for <strong>newsletter Subscription</strong></li>\n<li>Automatically supports images (jpgs, animated gifs) and <strong>Youtube Videos</strong> from WPBot Language Settings Responses</li>\n<li>Add <strong>video in Support area</strong> just by pasting Youtube link</li>\n<li>Option to <strong>Skip Greeting</strong> and Asking Name and eMail</li>\n<li>Option to show the ChatBot for Logged in users only</li>\n<li><strong>Skip</strong> Greetings and <strong>Trigger an Intent</strong> (like a Custom Form)</li>\n<li>Option to enable/disable<strong> asking for eMail</strong> address after asking name</li>\n<li>Enable <strong>Asking for Phone Number</strong></li>\n<li><strong>Quick Help for commands</strong> that can be used in-chat</li>\n<li><strong>Keyboard shortcuts</strong> (Ctrl+B to open bot, Esc to close)</li>\n</ul>\n<p><strong>OpenAI ChatGPT Integration</strong><br />\n* Integrate with OpenAI so the WPBot can answer any questions<br />\n* Train and Fine Tune OpenAI ChatGPT<br />\n* Fine tune with your Website data (pages, posts and custom post types)<br />\n* GPT Assistant support. Upload ChatBot Generated Website data, PDF  or any document to train ChatGPT<br />\n* Generate and Upload website contents as JSON file to your GPT Assistant for AI training<br />\n* OpenAI Content Writer and AI Content Generatror<br />\n* Open AI Image Generator</p>\n<p><strong>DialogFlow Integration</strong></p>\n<ul>\n<li>Full integration with Google Artificial Intelligence, Machine Learning or <strong>AI Engine DialogFlow</strong></li>\n<li>Supports <strong>DialogFlow ES &#8211; Essential</strong> and <strong>DialogFlow CX</strong></li>\n<li>Use DialogFlow CX as <strong>visual workflow builder</strong> to create conversations that are easier to design, <strong>enhance</strong>, and maintain.</li>\n<li>Supports <strong>Rich Message Response &amp; Card Responses</strong> from Dialogflow as FaceBook messenger app</li>\n<li><strong>Sample DialogFlow Agent </strong>for <strong>quick import</strong></li>\n</ul>\n<p><strong>Customization Options</strong></p>\n<ul>\n<li>Enable <strong>Extended Home</strong> Interface to present different interactive options to users</li>\n<li><strong>Enable</strong> or disable <strong>Different Sections</strong> and <strong>Buttons</strong> to show on the <strong>Extended Home</strong> interface</li>\n<li>Option to<strong> choose on which pages WPBot </strong>should <strong>load</strong></li>\n<li>Option to <strong>disable WPBot on Mobile Devices</strong></li>\n<li>Option to <strong>Auto Open WPBot Window For First Time</strong> Page Load</li>\n<li>Upload<strong> custom WPBot</strong> icon</li>\n<li>Upload custom <strong>Agent icon</strong></li>\n<li>Customize <strong>primary colors to match your site</strong></li>\n<li>Customize bot <strong>response</strong> time</li>\n<li>Option to Keep ChatBot window open when browsing</li>\n<li><strong>Hide/Show</strong> <strong>Icons </strong>at the bottom of WPBot window<strong><br />\n</strong></li>\n</ul>\n<p><strong>User Conversions &amp; Retargeting</strong></p>\n<ul>\n<li>Onsite<strong> retargeting and remarketing</strong> to increase customer conversion rate.</li>\n<li>Show <strong>retargeting</strong> messages for customer on <strong>Exit Intent, After Scrolling Down “X” Percent, Or after “X” seconds.</strong></li>\n<li>Create <strong>different Reargeting messages</strong> for different pages</li>\n<li>Collect <strong>User eMail </strong>for <strong>newsletter Subscription</strong></li>\n<li><strong>Prompt User </strong>for <strong>eMail subscription </strong>with <strong>Retargeting Message</strong></li>\n<li>Export <strong>eMail Addresses as CSV</strong></li>\n<li>Out of focus <strong>Browser tab flashing</strong> with custom message</li>\n</ul>\n<p><strong>Notification Builder</strong></p>\n<ul>\n<li>Add<strong> multiple notifications</strong> to show above the WPBot icon</li>\n<li>Select an <strong>Intent</strong> for Click Action</li>\n<li><strong>Add links</strong> to any Intent in the Notification area so user can directly browse to the useful parts</li>\n</ul>\n<p><strong>Start Menu</strong></p>\n<ul>\n<li>Manage the <strong>Start Menu </strong>buttons with <strong>Drag and Drop</strong></li>\n<li>Option to <strong>Enable/Disable</strong> all ready intents like Site Search, Call Me, eMail, FAQ, newsletter subscription etc.</li>\n<li><strong>Rearrange</strong> the Start Menu Items</li>\n<li>Add Custom Menu Button with <strong>Link</strong></li>\n<li>Option to set after how many failed attempt to show Start Menu</li>\n</ul>\n<p><strong>Interactive Forms</strong><br />\nExtend the Start Menu with the <strong>powerful Conversational Forms</strong>. It is a visual,<strong> drag and drop</strong> form builder. You can create:</p>\n<ul>\n<li>Conditional <strong>Menu Driven Conversations</strong></li>\n<li>Standard Contact Forms</li>\n<li>Job <strong>Application Forms</strong></li>\n<li><strong>Lead Capture</strong> Forms</li>\n<li>Various types of <strong>Calculators</strong></li>\n<li>Feedback <strong>Survey</strong> Forms etc.</li>\n</ul>\n<p><strong>Language Support</strong></p>\n<ul>\n<li>Works with <strong>any language</strong> (multi language support is available with WPBot Pro Master license).</li>\n<li><strong>Advanced Language Center t</strong>o edit and change every WPBot responses, System languages, stop words and info messages!</li>\n<li><strong>Stop Words</strong> dictionary included and editable by admin. Bot will automatically exclude stop words from search criteria and chat commands</li>\n<li>Add <strong>multiple variations</strong> of <strong>WPBot responses</strong> for each node. They will be used randomly and give an appearance of more human like responses.</li>\n<li>mo/pot file included so you can translate backend to any language</li>\n<li><strong>RTL support</strong></li>\n<li><strong>Multi Language support. Multilingual chatbot for international customers </strong> </li>\n</ul>\n<p><strong>Embedding Features</strong></p>\n<ul>\n<li><strong>Embed code to use the ChatBot</strong> on any other websites including static HTML website</li>\n<li><strong> Widget Shortcode</strong> to show the ChatBot on a page or post instead of Floating icon</li>\n<li>Shortcode for <strong>Click to Chat</strong> Button with the possibility to <strong>Trigger Specific Intent</strong> (<strong>forms</strong> etc.) on a page or post</li>\n</ul>\n<p><strong>Button Integrations</strong></p>\n<ul>\n<li>Integration with<strong> FaceBook Messenger for Customer Live Chat </strong>as a floating button<strong><br />\n</strong></li>\n<li>Lite Integration with <strong>Skype, WhatsApp, Viber, Web Link &amp; Phone Call</strong></li>\n<li><strong>Integrate with 3rd party Live Chat services</strong> that provides a stand alone chat page link like Tawk.to</li>\n</ul>\n<p><strong>Misc. Features</strong></p>\n<ul>\n<li><strong>Persistent chat history</strong> over user session on website</li>\n<li>Option to <strong>Disable persistent chat history</strong> (Chat history is reset in every page)</li>\n<li>Remember chat history in browser local storage and <strong>greet returning users</strong></li>\n<li>Option to Open pages in new or same window from search results</li>\n<li><strong>GDPR</strong> compliance (message with link to Privacy page)</li>\n<li><strong>Schedule day and time when WPBot will run</strong>. Make WPBot work with other Live chat software.</li>\n<li><strong>Priority Support</strong></li>\n</ul>\n<p><strong>Useful <a href=\"https://www.wpbot.pro/wpbot-modules/\" rel=\"nofollow ugc\">WPBot Modules</a></strong> for WPBot Pro</p>\n<ul>\n<li><strong>Conversational Forms</strong> Pro </li>\n<li><strong>Live Chat</strong> </li>\n<li>Chat <strong>Sessions &amp; Histories</strong> </li>\n<li>FacebBook <strong>Messenger</strong> </li>\n<li><strong>WhatApp WPBot</strong> Integration through Twilio</li>\n<li><strong>Extended Search</strong> </li>\n<li><strong>White Label ChatBot</strong> </li>\n<li><strong>Mailing List</strong> Integration </li>\n<li><strong>Extended</strong> UI (2 additional templates)</li>\n<li><strong>Settings Import/Export</strong></li>\n<li><strong>Multi Language support. Multilingual chatbot for international customers </strong> </li>\n<li><strong>Voice Message</strong> </li>\n<li><strong>Simple text Response</strong>s Pro </li>\n<li><strong>Woocommerce</strong> </li>\n<li><strong>Voice</strong> </li>\n<li><strong>Telegram Bot</strong> </li>\n</ul>\n<blockquote>\n<p>++ Download <a href=\"https://github.com/qcloud/chatbot\" rel=\"nofollow ugc\">Free WPBot</a> from GITHUB</p>\n<p>++ <a href=\"https://www.wpbot.pro/\" rel=\"nofollow ugc\">View Demo of the WPBot</a></p>\n<p>++ Upgrade to <a href=\"https://www.wpbot.pro/\" rel=\"nofollow ugc\">WPBot Pro Now!</a></p>\n</blockquote>\n",
        "installation": "<ol>\n<li>Download the ChatBot plugin zip file. Extract and upload in your wp-content/plugins folder.</li>\n<li>From the wp-admin panel go to plugins and activate &#8220;WPBot&#8221;</li>\n<li>You are done.</li>\n</ol>\n",
        "faq": "\n<dt id='does%20the%20chatbot%20support%20openai%20chatgpt%3F'>\nDoes the ChatBot support OpenAI ChatGPT?\n</h4>\n<p>\n<p>OpenAI is now supported with all WPBot WPBot packages. For advanced OpenAI features like fine tuning and GPT Assistants you need the WPBot pro Professional and Master licenses.</p>\n</p>\n<dt id='how%20to%20train%20ai%20with%20your%20website%20data%20using%20chatbot'>\nHow to train AI with your website data using ChatBot\n</h4>\n<p>\n<p>You can train an OpenAI model with your data using one of the two methods (requires WPBot Pro Professional or Master License): Fine Tuning or GPT Assistant</p>\n<p>We suggest using GPT Assistant as this is easier, quicker, and more flexible. Our ChatBot for WordPress WPBot allows you to easily generate a JSON file containing all your website data that you can upload to your GPT Assistant. Here is the step by step process guideline for <a href=\"https://wpbot.pro/docs/knowledgebase/how-to-train-ai-with-your-website-data-using-chatbot/\" rel=\"nofollow ugc\">How to train AI with your website data using WPBot ChatBot</a></p>\n</p>\n<dt id='how%20to%20save%20money%20and%20reduce%20openai%20api%20cost%20for%20your%20chatbot'>\nHow to save money and reduce OpenAI API cost for your ChatBot\n</h4>\n<p>\n<p>You can <strong>dramatically decrease</strong> the OpenAI API cost by using chatbot for WordPress’s default features (which are free) in combination with OpenAI.<br />\nHere is a short guideline for <a href=\"https://wpbot.pro/docs/knowledgebase/how-to-save-money-and-reduce-openai-api-cost-for-your-chatbot/\" rel=\"nofollow ugc\">How to reduce OpenAI API cost for your ChatBot</a></p>\n</p>\n<dt id='getting%20started%20with%20openai'>\nGetting Started with OpenAI\n</h4>\n<p>\n<p>Once you add the OpenAI API key, the WPBot should already start working for generic questions. Open a new browser window in Incognito mode and test by asking &#8220;What is the capital of Japan?&#8221;</p>\n<p>Please make sure DialogFlow is Disabled if you want OpenAI to work with the WPBot.</p>\n</p>\n<dt id='openai%20not%20working.%20wpbot%20keeps%20loading'>\nOpenAI not working. WPBot Keeps loading\n</h4>\n<p>\n<p>If OpenAI is not responding back and the bot is just loading, then likely you hit your OpenAI API usage limit or need to add credit. Please <strong></strong></p>\n<p>&lt;</p>\n<p>pre-purchase credit to use OpenAI API and increase the Usage limit. You can add credits to your API account from here: https://platform.openai.com/account/billing</p>\n</p>\n<dt id='how%20to%20get%20an%20openai%20api%20key%20for%20the%20wpbot%3F'>\nHow to get an OpenAI API Key for the WPBot?\n</h4>\n<p>\n<p>Visit your OpenAI API Keys page to retrieve the API key. You can grab the API key for the WPBot from this page: https://platform.openai.com/api-keys</p>\n</p>\n<dt id='can%20i%20use%20both%20dialogflow%20and%20openai%20gpt3%20with%20the%20wpbot%3F'>\nCan I use both DialogFlow and OpenAI GPT3 with the WPBot?\n</h4>\n<p>\n<p>No. They will both NOT work together. Please disable DialogFlow if you want OpenAI to work for the WPBot.</p>\n</p>\n<dt id='is%20my%20language%20supported%3F'>\nIs my language supported?\n</h4>\n<p>\n<p>WPBot can work with ANY language. Just change the language texts from the WPBot Settings-&gt;Change Language to your preferred one.</p>\n</p>\n<dt id='does%20this%20chatbot%20support%20multi%20language%3F'>\nDoes this ChatBot support multi language?\n</h4>\n<p>\n<p>MultiLanguage is supported with the WPBot Pro Master License. For a multilingual ChatBot for international users grab the WPBot.Pro Master License</p>\n</p>\n<dt id='i%20am%20not%20getting%20emails%20from%20the%20wpbot'>\nI am not getting emails from the WPBot\n</h4>\n<p>\n<p>The WPBot WPBot uses the WordPress&#8217; default email function. If you are not getting emails from the WPBot&#8217;s email feature, it is likely that no emails are getting through from your WordPress site or they are ending up in the Spam box. Try using an SMTP mailer plugin. Also, try changing the to and from email addresses in the WPBot&#8217;s general settings area.</p>\n</p>\n<dt id='i%20cannot%20connect%20the%20wpbot%20to%20dialogflow'>\nI cannot connect the WPBot to DialogFlow\n</h4>\n<p>\n<p>Please Follow the steps in this tutorial correctly: https://www.wpbot.pro/dialogflow-integration/</p>\n</p>\n<dt id='simple%20text%20responses%20are%20not%20working%20or%20getting%20an%20error'>\nSimple text responses are not working or getting an error\n</h4>\n<p>\n<p>WPBot requires mysql version 5.6+ for the simple text responses to work. If your server has a version below that, you might see some PHP error or the Simple Text Responses will not work at all. Please request your hosting support to update the mysql version on your server.</p>\n</p>\n<dt id='i%20changed%20language%20or%20some%20other%20settings%20but%20do%20not%20see%20them%20when%20testing'>\nI changed language or some other settings but do not see them when testing\n</h4>\n<p>\n<p>Please clear the browser cache and <strong>cookies</strong> to see any change you have made. Alternatively, you can open a fresh browser window in incognito mode (Ctrl+Shift+N in chrome) to test your changes. Also, you may need to purge any cache plugin and CDN caching.</p>\n</p>\n<dt id='the%20wpbot%20is%20not%20working%20in%20the%20front%20end.'>\nThe WPBot is NOT working in the front end.\n</h4>\n<p>\n<p>The most common reason for this is if the theme is coded incorrectly and jQuery is loaded from external source. jQuery is included with WordPress core and according to WordPress standard, jQuery must be included using wp_enqueue_script. https://developer.wordpress.org/reference/functions/wp_enqueue_script/ . Please make sure if that is the case in your theme.</p>\n<p>Please contact us if you need <a href=\"https://www.wpbot.pro/free-support/\" rel=\"nofollow ugc\">further help</a>. We take all user feedback sriously.</p>\n</p>\n<dt id='the%20wpbot%20is%20stuck%20on%20typing%20or%20loading'>\nThe WPBot is stuck on typing or loading\n</h4>\n<p>\n<p>This usually happens if you enabled DialogFlow but did not complete the set up.</p>\n</p>\n<dt id='how%20do%20i%20add%20new%20conversations%20to%20the%20wpbot%3F'>\nHow do I add new conversations to the WPBot?\n</h4>\n<p>\n<p>You can use WPBot to both answer user questions and collect information from the users.<br />\nTo create answers to user questions you can use:<br />\nSimple Text Responses (built-in), FAQ(built-in), Site search(built-in), Product search(built-in Pro feature), DialogFlow(3rd Party) or OpenAI(3rd Party)<br />\nTo collect information from your users you can use:<br />\nConversational forms(built-in), Mail us(built-in), Call me back(built-in), Collect feedback features(built-in)<br />\nThe built-in features are all free.</p>\n</p>\n<dt id='how%20do%20i%20add%20line%20breaks%3F'>\nHow do I add Line Breaks?\n</h4>\n<p>\n<p>Please use the br html tag for line breaks.</p>\n</p>\n<dt id='are%20html%20tags%20supported%3F'>\nAre HTML tags supported?\n</h4>\n<p>\n<p>Yes, common HTML tags link link href, strong, br etc. are supported.</p>\n</p>\n<dt id='does%20the%20wpbot%20support%20images%2C%20gifs%2C%20videos'>\nDoes the WPBot support images, GIFs, Videos\n</h4>\n<p>\n<p>Images, GIFs and Youtube Videos are supprted in the pro version. Pro version also includes a handy giphy floating search for easy embed in the language center.</p>\n</p>\n\n",
        "changelog": "<h4>5.8.8</h4>\n<p>UI update</p>\n<h4>5.8.7</h4>\n<p>UX update</p>\n<h4>5.8.6</h4>\n<p>Updated OpenAI API key field</p>\n<h4>5.8.5</h4>\n<p>Updated OpenAI Settings</p>\n<h4>5.8.4</h4>\n<p>GPT 4o Mini Support added</p>\n<h4>5.8.3</h4>\n<p>UI update</p>\n<h4>5.8.1</h4>\n<p>UI update</p>\n<h4>5.8.0</h4>\n<p>UI update</p>\n<h4>5.7.9</h4>\n<p>Fixed FAQ buttons</p>\n<h4>5.7.8</h4>\n<p>Fixed an issue with empty FAQ</p>\n<h4>5.7.7</h4>\n<p>Small UI Update</p>\n<h4>5.7.6</h4>\n<p>Fixed a CSS issue send message bar</p>\n<h4>5.7.5</h4>\n<p>Fixed a CSS issue in admin settings</p>\n<h4>5.7.4</h4>\n<p>End sale</p>\n<h4>5.7.3</h4>\n<p>Updated Start menu settings</p>\n<h4>5.7.2</h4>\n<p>Fixed issue with Start Menu settings</p>\n<h4>5.7.1</h4>\n<p>Updated admin settings UI</p>\n<h4>5.7.0</h4>\n<p>Labor day sale</p>\n<h4>5.6.9</h4>\n<p>Updated OpenAI settings page and Start menu behavior</p>\n<h4>5.6.7</h4>\n<p>Fixed a new line issue in conversational form</p>\n<h4>5.6.6</h4>\n<p>Fixed support page loading issue</p>\n<h4>5.6.4</h4>\n<p>Updated a link</p>\n<h4>5.6.3</h4>\n<p>Updated OpenAI Help</p>\n<h4>5.6.2</h4>\n<p>Removed an unneeded field</p>\n<h4>5.6.1</h4>\n<p>Basic HTML tag support for the language center</p>\n<h4>5.6.0</h4>\n<p>Updated a function name to avoid conflict</p>\n<h4>5.5.9</h4>\n<p>Updated support page with AJAX</p>\n<h4>5.5.8</h4>\n<p>Improved security</p>\n<h4>5.5.7</h4>\n<p>Updated the menu label</p>\n<h4>5.5.6</h4>\n<p>Fixed an issue with conversational forms for ChatBot</p>\n<h4>5.5.5</h4>\n<p>End sale</p>\n<h4>5.5.4</h4>\n<p>Updated some text</p>\n<h4>5.5.3</h4>\n<p>4th of July Sale</p>\n<h4>5.5.2</h4>\n<p>Fixed an issue with DialogFlow WPBot</p>\n<h4>5.5.1</h4>\n<p>Fixed some text and UI</p>\n<h4>5.5.0</h4>\n<p>Added some text about custom Icons</p>\n<h4>5.4.9</h4>\n<p>Updated some text about GPT Assistant</p>\n<h4>5.4.8</h4>\n<p>Fixed an issue with a setting not getting saved</p>\n<h4>5.4.7</h4>\n<p>Added relevant page links feature to GPT responses</p>\n<h4>5.4.6</h4>\n<p>Removed conversation continuity option for now</p>\n<h4>5.4.5</h4>\n<p>Fixed an error with the Horizontal template</p>\n<h4>5.4.4</h4>\n<p>Updated the support section</p>\n<h4>5.4.3</h4>\n<p>Default template UI update</p>\n<h4>5.4.2</h4>\n<p>Improved Site Search result display</p>\n<h4>5.4.1</h4>\n<p>Cleaned up UI and some spelling mistakes</p>\n<h4>5.3.9</h4>\n<p>Added GPT 4o support</p>\n<p>Fixed an issue with FAQ</p>\n<h4>5.3.8</h4>\n<p>Improved security</p>\n<h4>5.3.7</h4>\n<p>Improved security</p>\n<h4>5.3.6</h4>\n<p>Removed unnecessary functions</p>\n<p>Improved security</p>\n<h4>5.3.4</h4>\n<p>Text Update</p>\n<h4>5.3.3</h4>\n<p>UI Update</p>\n<h4>5.3.2</h4>\n<p>Fixed a PHP error for downgrading</p>\n<h4>5.3.1</h4>\n<p>Updated some text</p>\n<h4>5.3.0</h4>\n<p>Updated some text</p>\n<h4>5.2.9</h4>\n<p>Conversational form builder</p>\n<h4>5.2.8</h4>\n<p>GPT Assistant</p>\n<h4>5.2.7</h4>\n<p>UI Update</p>\n<h4>5.2.6</h4>\n<p>Remove Eid sale</p>\n<h4>5.2.5</h4>\n<p>UI update</p>\n<h4>5.2.4</h4>\n<p>Eid sale for WPBot</p>\n<h4>5.2.3</h4>\n<p>Fixed a link</p>\n<h4>5.2.2</h4>\n<p>Added instructions</p>\n<h4>5.2.1</h4>\n<p>Text update</p>\n<h4>5.2.0</h4>\n<p>UI update</p>\n<h4>5.1.9</h4>\n<p>UI update</p>\n<h4>5.1.8</h4>\n<p>Hide the button for conversational form builder</p>\n<h4>5.1.7</h4>\n<p>Updated some instruction text</p>\n<h4>5.1.6</h4>\n<p>Select default OpenAI model</p>\n<h4>5.1.5</h4>\n<p>Improved the reset option</p>\n<h4>5.1.4</h4>\n<p>Removed unnecessary field from WPBot OpenAI settings</p>\n<h4>5.1.3</h4>\n<p>WPBot UI improvement for STR</p>\n<h4>5.1.2</h4>\n<p>Removed NY sale banner for WPBot</p>\n<h4>5.1.1</h4>\n<p>Updated cookies in WPBot openAI</p>\n<p>Removed WPBot openAIs&#8217; old models</p>\n<h4>5.1.0</h4>\n<p>Fixed an image path</p>\n<h4>5.0.9</h4>\n<p>New Year Sale</p>\n<h4>5.0.7</h4>\n<p>Christmas Sale</p>\n<h4>5.0.6</h4>\n<p>When WPBot OpenAI is enabled create a popup and ask if we should disable Site Search.</p>\n<h4>5.0.5</h4>\n<p>Removed BF Sale</p>\n<h4>5.0.4</h4>\n<p>Fixed a PHP error</p>\n<h4>5.0.3</h4>\n<p>Fixed a PHP warning</p>\n<h4>5.0.2</h4>\n<p>BF Sale</p>\n<h4>5.0.1</h4>\n<p>BF Sale</p>\n<h4>4.9.9</h4>\n<p>Fixed custom CSS loading</p>\n<h4>4.9.8</h4>\n<p>Removed Halloween sale</p>\n<h4>4.9.7</h4>\n<p>Improved security for FAQ</p>\n<h4>4.9.6</h4>\n<p>Halloween sale</p>\n<h4>4.9.5</h4>\n<p>Fixed custom icon issue</p>\n<h4>4.9.4</h4>\n<p>WPBot Fixed a broken image issue</p>\n<h4>4.9.3</h4>\n<p>Removed OpenAI unnessary functions</p>\n<p>fixed a php7.2 syntex error</p>\n<h4>4.9.2</h4>\n<p>Added Visual Editor for STR</p>\n<p>OpenAI keyword Case fixed</p>\n<h4>4.9.1</h4>\n<p>Improved security</p>\n<p>Removed unnecessary functions</p>\n<h4>4.8.9</h4>\n<p>Minor UI Update</p>\n<h4>4.8.8</h4>\n<p>Fixed a PHP warning</p>\n<h4>4.8.7</h4>\n<p>Fixed FAQ fatal error</p>\n<h4>4.8.6</h4>\n<p>Fixed HTML issue in FAQ</p>\n<h4>4.8.5</h4>\n<p>Removed admin notice</p>\n<h4>4.8.4</h4>\n<p>Added admin notice</p>\n<h4>4.8.3</h4>\n<p>UI update</p>\n<h4>4.8.2</h4>\n<p>Added Site Search feature</p>\n<h4>4.8.1</h4>\n<p>Small UI update</p>\n<h4>4.8.0</h4>\n<p>Fixed an issue with OpenAI settings save</p>\n<h4>4.7.9</h4>\n<p>Improved security for STR indexing as admin</p>\n<h4>4.7.8</h4>\n<p>Improved security for FAQ saving as admin</p>\n<h4>4.7.7</h4>\n<p>UI Update for WPBot</p>\n<h4>4.7.6</h4>\n<p>Fixed slash issue in language center</p>\n<h4>4.7.5</h4>\n<p>Fixed JS issue on the dialogflow page</p>\n<h4>4.7.4</h4>\n<p>Removed notice about new template</p>\n<h4>4.7.3</h4>\n<p>Fixed FAQ issue</p>\n<h4>4.7.2</h4>\n<p>Fixed a conflict with FluentSMTP</p>\n<h4>4.7.1</h4>\n<p>Removed Sale notice</p>\n<h4>4.7.0</h4>\n<p>Sale notice</p>\n<h4>4.6.9</h4>\n<p>WPBot UI Changes</p>\n<h4>4.6.8</h4>\n<p>WPBot Fixed horizontal template mobile display issue</p>\n<h4>4.6.7</h4>\n<p>WPBot Fixed duplicate notice on the Start Menu page</p>\n<h4>4.6.6</h4>\n<p>Fixed empty keyword issue on OpenAI settings</p>\n<h4>4.6.5</h4>\n<p>Updated UI</p>\n<p>Fixed OpenAI include/Exclude keyword issue</p>\n<h4>4.6.3</h4>\n<p>added horizontal chat template</p>\n<p>change openAI settings page text</p>\n<h4>4.6.2</h4>\n<p>Fixed custom post type exclude not saving issue</p>\n<h4>4.6.1</h4>\n<p>Exclude include keyword option for openAI</p>\n<p>Fix the exclude custom post</p>\n<p>Security check on admin settings</p>\n<h4>4.6.0</h4>\n<p>Improved UI</p>\n<h4>4.5.9</h4>\n<p>Minor UX improvements</p>\n<h4>4.5.8</h4>\n<p>Fixed issue with Dialogflow connection button</p>\n<h4>4.5.7</h4>\n<p>Fixed show start menu after greetings option chekcing</p>\n<h4>4.5.6</h4>\n<p>Fixed back to start button</p>\n<p>Sanitization for WPBot keywords area for admin user role</p>\n<h4>4.5.5</h4>\n<p>Sanitization for STR area for admin user role</p>\n<h4>4.5.4</h4>\n<p>back to start button button for fixed for different language</p>\n<p>reset command fixed</p>\n<h4>4.5.3</h4>\n<p>Fixed issues with STR</p>\n<h4>4.5.2</h4>\n<p>Added WPBot in a Nutshell</p>\n<p>fix no answer found message</p>\n<p>fix search field filter on STR</p>\n<h4>4.5.1</h4>\n<p>Improved security for Settings</p>\n<h4>3.8.1</h4>\n<p>Fixed the issue with Call me intent getting stuck</p>\n<h4>3.8.0</h4>\n<p>Improved responsiveness</p>\n<h4>3.7.9</h4>\n<p>Improved responsiveness</p>\n<h4>3.7.8</h4>\n<p>Fixed a database table name issue</p>\n<h4>3.7.7</h4>\n<p>Removed some test code/text</p>\n<h4>3.7.6</h4>\n<p>Added more debugging info</p>\n<p>Re-indexing button added.</p>\n<h4>3.7.5</h4>\n<p>Improved the Help section</p>\n<h4>3.7.4</h4>\n<p>Added Custom CSS option</p>\n<h4>3.7.3</h4>\n<p>option Save issue fixed.</p>\n<p>Tested with wp 5.7</p>\n<p>Email us intent json issue fixed.</p>\n<p>Button design issue fixed.</p>\n<h4>3.7.2</h4>\n<p>Uncaught Error: Call to a member function close() on bool &#8211; fixed.</p>\n<h4>3.7.1</h4>\n<p>Refactored and improved code</p>\n<p>Remove Unused Files</p>\n<p>Make WPBot Fulscreen on Mobile option default</p>\n<p>Fix Close icon on Mobile</p>\n<h4>3.7.0</h4>\n<p>Improved default template button design</p>\n<p>Added help notice</p>\n<h4>3.6.9</h4>\n<p>Improved close button</p>\n<p>Improved loading issue</p>\n<h4>3.6.8</h4>\n<p>Fixed close button</p>\n<p>Fixed loading issue</p>\n<h4>3.6.7</h4>\n<p>Improved mobile view</p>\n<h4>3.6.6</h4>\n<p>MYsql version notice issue fixed.</p>\n<h4>3.6.5</h4>\n<p>Added required mysql version notice</p>\n<h4>3.6.4</h4>\n<p>WP 5.6, PHP 8 Cpmpatible</p>\n<h4>3.6.3</h4>\n<p>Removed sale notice</p>\n<h4>3.6.2</h4>\n<p>Text box block issue for iphone 6 &#8211; fixed.</p>\n<h4>3.6.1</h4>\n<p>Improved STR</p>\n<p>Fixed an issue on iphone</p>\n<h4>3.6.0</h4>\n<p>Fixed duplicate notice</p>\n<h4>3.5.9</h4>\n<p>Improved UX</p>\n<h4>3.5.8</h4>\n<p>Updated Support Link Notice</p>\n<h4>3.5.7</h4>\n<p>Rating request added.</p>\n<p>Dialogfow Project ID &amp; Language field is marked required now.</p>\n<p>New tutorial link added.</p>\n<h4>3.5.6</h4>\n<p>Improved responsiveness</p>\n<h4>3.5.5</h4>\n<p>Set default response delay to 0.5 sec</p>\n<h4>3.5.4</h4>\n<p>Chat window size increased like the pro version.</p>\n<p>WPBot logo removed from chat window background.</p>\n<h4>3.5.3</h4>\n<p>Disable a default feature will automatically remove the item from the Start Menu</p>\n<p>Bot Response Delay option added.</p>\n<p>Bottom icons title added.</p>\n<p>Help Section updated.</p>\n<p>From email address field added in general settings.</p>\n<h4>3.5.2</h4>\n<p>Improved Help page UI</p>\n<h4>3.5.1</h4>\n<p>Added more info on how to use the WPBot WPBot</p>\n<h4>3.5.0</h4>\n<p>Improved Help and Tips</p>\n<h4>3.4.9</h4>\n<p>Recfactored code for more stability</p>\n<h4>3.4.8</h4>\n<p>Fixed a conflict with FooBox plugin</p>\n<h4>3.4.7</h4>\n<p>Add mysql version requirement message</p>\n<h4>3.4.6</h4>\n<p>wc_setcookie function is exists check added.</p>\n<h4>3.4.5</h4>\n<p>Dialogflow Test Connection Error message added.</p>\n<h4>3.4.4</h4>\n<p>Full screen support under 1024px &#8211; done.</p>\n<p>Backslash issue fixed for language center</p>\n<h4>3.4.3</h4>\n<p>DF Tutorial link updated.</p>\n<h4>3.4.2</h4>\n<p>DF Tutorial link updated.</p>\n<p>Button design updated</p>\n<p>Dialogflow owner permission required notice added.</p>\n<h4>3.4.1</h4>\n<p>Typing area block issue on mobile fixed.</p>\n<h4>3.4.0</h4>\n<p>Improved Simple Text Responses</p>\n<h4>3.3.9</h4>\n<p>Fixed a conflict with the oxygen page builder</p>\n<h4>3.3.8</h4>\n<p>Multiple back to start button issue fixed</p>\n<h4>3.3.7</h4>\n<p>Improved Simple Text responses</p>\n<h4>3.3.6</h4>\n<p>Fixed an error with full text search &#8211; too many keys specified.</p>\n<h4>3.3.5</h4>\n<p>Added notice for Df section and Start menu</p>\n<h4>3.3.4</h4>\n<p>Don&#8217;t load resources globally when loaded Selected page only</p>\n<h4>3.3.3</h4>\n<p>Show on pages &gt; Selected page only &#8211; undefined function issue fixed.</p>\n<h4>3.3.2</h4>\n<p>Fixed bug with page specific WPBot loading</p>\n<h4>3.3.1</h4>\n<p>Simple text response search improved and bug fixed</p>\n<h4>3.2.9</h4>\n<p>Added new feature &#8211; Simple text response</p>\n<h4>3.2.8</h4>\n<p>Admin area language changed &#8211; System Keyword-&gt;WPBot Keyword.</p>\n<p>New template added</p>\n<p>Disable WPbot on Mobile Device option added in general settings.</p>\n<h4>3.2.7</h4>\n<p>Fixed timezone issue</p>\n<h4>3.2.6</h4>\n<p>Dialogflow Connection test button added</p>\n<p>Form Builder first response html &#8211; issue fixed.</p>\n<h4>3.2.5</h4>\n<p>Improved Start Menu Options</p>\n<h4>3.2.3</h4>\n<p>Improved deactivation module</p>\n<h4>3.2.2</h4>\n<p>Compatible with Messenger WPBot addon free.</p>\n<p>Custom rest api endpoind created for Dialogflow api</p>\n<h4>3.2.1</h4>\n<p>DF v2 client download script updated.</p>\n<p>WPBot panel updated.</p>\n<p>Addon page updated.</p>\n<h4>3.2.0</h4>\n<p>Improved Admin UI</p>\n<p>Added option Show Start Menu after Greetings</p>\n<p>Mobile fullscreen mode close icon issue fixed.</p>\n<p>Call to undefined function wc_get_product() &#8211; issue fixed.</p>\n<h4>3.1.0</h4>\n<p>DialogFlow V2 compatibility added</p>\n<h4>3.0.1</h4>\n<p>Improved some CSS and button styles</p>\n<h4>3.0.0</h4>\n<p>Added support for conversational forms WPBot addon</p>\n<h4>2.9.6</h4>\n<p>Added support for multiple responses from dialogflow</p>\n<h4>2.9.5</h4>\n<p>Fixed some conflict with a custom theme</p>\n<h4>2.9.4</h4>\n<p>Fixed the support icon in the front end WPBot</p>\n<h4>2.9.3</h4>\n<p>Improved Support area.</p>\n<h4>2.9.2</h4>\n<p>Improved Help area.</p>\n<h4>2.9.1</h4>\n<p>Custom Agent image upload option added.</p>\n<h4>2.9.0</h4>\n<p>Added custom admin email option</p>\n<h4>2.8.0</h4>\n<p>Notice: Undefined index issue fixed.</p>\n<h4>2.6.0</h4>\n<p>More Notice: Undefined index issue fixed.</p>\n<h4>2.5.0</h4>\n<p>Notice: Undefined index issue fixed.</p>\n<h4>2.4.0</h4>\n<p>Notice: Undefined index issue fixed.</p>\n<p>Free support link added.</p>\n<h4>2.3.0</h4>\n<p>WPBot open full screen in mobile option added.</p>\n<h4>2.2.0</h4>\n<p>Added addon section</p>\n<h4>2.1.0</h4>\n<p>Added a banner</p>\n<h4>2.0.0</h4>\n<p>Fixed a PHP warning</p>\n<h4>1.9.0</h4>\n<p>Improved deactivation survey</p>\n<h4>1.8.0</h4>\n<p>Conflict with woowbot fixed.</p>\n<p>Agent download issue fixed.</p>\n<p>Deactivate feedback updated.</p>\n<h4>1.7.0</h4>\n<p>Introducing the pro version</p>\n<h4>1.6.0</h4>\n<p>Removed site search feature</p>\n<p>Added DialogFlow Integration</p>\n<h4>1.5.0</h4>\n<p>Added site search feature</p>\n<h4>1.3.0</h4>\n<p>Added call me back feature</p>\n<p>Upload custom bot icon</p>\n<h4>1.2.0</h4>\n<p>Improved User input text sanitization added.</p>\n<h4>1.0.0</h4>\n<p>Default message updated.</p>\n<p>New icon added as agent &amp; WPBot icon.</p>\n<p>Support changed to FAQ</p>\n<h4>0.9.0</h4>\n<p>*Inception</p>\n"
    },
    "short_description": "AI ChatBot for WordPress - Automated 24/7 Live Chat Customer Support. NATIVE, Lead Generation, Conversational forms, ChatGPT, DialogFlow, HelpDesk",
    "description": "<h4>ChatBot for WordPress with AI &#8211; WPBot</h4>\n<p>WPBot is an easy to use, Native, No coding required, <strong>AI ChatBot for WordPress</strong> websites to provide <strong>automated Live Chat Support</strong>, <strong>Lead Generation</strong> and collecting information from your users. Best AI ChatBot for automated 24/7 customer support.</p>\n<p>This ChatBot can be also be powered by <strong>OpenAI ChatGPT</strong>, <strong>DialogFlow</strong>, or simply use the <strong>built-in features</strong> to provide Live Support, Lead Generation and collect data without <strong>any extra cost</strong>. Own and Manage this Native WordPress ChatBot directly from your WordPress Dashboard for improving customer support efficiency and user conversions.</p>\n<blockquote>\n<p>🚀 <a href=\"https://www.wpbot.pro/free-support/\" rel=\"nofollow ugc\">Support, Bug Report, Feature Requests</a> | <a href=\"https://www.wpbot.pro/\" rel=\"nofollow ugc\">ChatBot for WordPress</a> Demo | <strong> for Advanced Features Upgrade to <a href=\"https://www.wpbot.pro/\" rel=\"nofollow ugc\">WPBot Pro Now!</a></strong></p>\n<p>++ Get the <a href=\"https://wordpress.org/plugins/conversational-forms/\" rel=\"ugc\">Free Conversational Forms</a> chatbot addon for <strong>Lead Generation</strong>, Collecting Data from users, <strong>Booking</strong>, Appointments, Scheduling etc.</p>\n<p>++ Upgrade to <a href=\"https://www.wpbot.pro/\" rel=\"nofollow ugc\">WPBot Pro</a> to power your WPBot ChatBot with OpenAI (ChatGPT) fine tuning and GPT Assistant features.</p>\n<p>++ <strong>OpenAI ChatGPT</strong> latest models are supported in this ChatBot. OpenAI’s API provides access to ChatGPT for a wide variety of natural language tasks. You can limit the ChatBot&#8217;s OpenAI responses based on keywords inclusion or exclusion to reduce token cost</p>\n<p>++ WPBot ChatBot is compatible with DialogFlow V2.</p>\n<p>++ WPBot ChatBot free and pro versions can display links to the relevant web pages on your website with all GPT responses.</p>\n<p>++ The WPBot ChatBot Pro versions can also support Tavily Search API, Zapier, Web Hooks, Fluent CRM, Hubspot CRM and more options like <strong>Generate and Upload website contents</strong> as JSON file to your GPT Assistant for AI training. GPT Assistant also support <strong>uploading PDF or Word File </strong>to analyze and answer any user questions through the ChatBot.</p>\n</blockquote>\n<p>This ChatBot can work both in <strong>Natural Language Processing Mode</strong> and <strong>Button Menu Driven</strong> Mode. WPBot also works with <strong>any language</strong> by customizing the texts used by the WPBot from the Dashboard. AI-powered chatbot for online customer service, to answer user questions about your product or services and also for Lead Generation and <strong>collecting data</strong> from the users using <strong>conversational forms</strong> addon for WPBot.</p>\n<p>Change all the WPBOT live chat bot responses and make this work in <strong>any language</strong> with very little effort. <strong>RTL</strong> is supported. Use this handy ChatBot as a practical means for your website users to save time, improve engagement, generate leads, handle FAQs, showcase your stuff! It is also great as a HelpDesk, Contact Bot, FAQ ChatBot or feedback bot to increase user conversions and customer leads.</p>\n<p>WPBot pro is available with advanced features like <strong>Onsite Retargeting</strong> by showing special offers and coupons on <strong>Exit Intent</strong>, time interval or page scroll-down. <strong>Embed the WPBot on any website</strong>, integrated <strong>Live Chat </strong>Support, Messenger Bot, Instagram Bot, Whatsapp Bot, White label chatbot, Chat history logs, Extended site search, MailChimp, <strong>Zapier, Webhook Integration</strong> and more! With the WPBot Professional and Master licenses you can generate a <strong>JSON training file</strong> with your own <strong>website data</strong> that you can upload to your GPT Assistant so that the AI can provide customized ChatBot responses.</p>\n<h4>How does the ChatBot work?</h4>\n<p>Please check this article for more info on <a href=\"https://www.wpbot.pro/how-it-works/\" rel=\"nofollow ugc\">how the ChatBot works</a>.</p>\n<h4>How to train AI with your website data using ChatBot</h4>\n<p>You can train an OpenAI model for the ChatBot with your data using one of the two methods (requires WPBot Pro Professional or Master License): Fine Tuning or GPT Assistant</p>\n<p>We suggest using GPT Assistant as this is easier, quicker, and more flexible. Our ChatBot for WordPress WPBot allows you to easily generate a JSON file containing all your website data that you can upload to your GPT Assistant. Here is a guideline for <a href=\"https://wpbot.pro/docs/knowledgebase/how-to-train-ai-with-your-website-data-using-chatbot/\" rel=\"nofollow ugc\">How to train AI with your website data using WPBot</a></p>\n<h4>How to save money and reduce OpenAI API cost for your ChatBot</h4>\n<p>You can <strong>dramatically decrease</strong> the OpenAI API cost by using chatbot for WordPress’s default features (which are free) in combination with OpenAI.<br />\nHere is a short guideline for <a href=\"https://wpbot.pro/docs/knowledgebase/how-to-save-money-and-reduce-openai-api-cost-for-your-chatbot/\" rel=\"nofollow ugc\">How to reduce OpenAI API cost for your ChatBot</a></p>\n<h4>WPBot ChatBot free version features</h4>\n<p>WPBot provides the following ChatBot features:</p>\n<ul>\n<li>Built-in, plugin n play ChatBot features</li>\n<li>Supports any languages like French, Spanish etc. including RTL</li>\n<li>Create simple <strong>text responses</strong> easily from your WordPress backend.</li>\n<li>Add hyperlinks in response message content using HTML markup.</li>\n<li>Set on which pages the chat bot will display</li>\n<li>Fine tune the floating icon position</li>\n<li>Upload Custom Icons</li>\n<li>Show a List of FAQ or Frequently Asked Questions defined by you</li>\n<li>Let users email you any question or feedback they may have</li>\n<li>Let users leave their phone number so you can call them back</li>\n<li>Option to display Start Menu After Greetings</li>\n<li>Create Conversational drag and drop forms with a free AddOn</li>\n<li>Integrate with Google&#8217;s Dialogflow Agent API or Tavily Search API to process natural language queries.</li>\n<li>Integrate with OpenAI ChatGPT for responses based on keywords you define</li>\n<li>Display links to the relevant web pages on your website with all the GPT responses.</li>\n</ul>\n<h4>What can you do with this ChatBot?</h4>\n<p>⭐ Use the best chatbot for customer service 24/7<br />\n⭐ Use this chatbot for lead generation with conversational forms<br />\n⭐ Use this chatbot for scheduling appointments or booking<br />\n⭐ Use this chatbot for lead generation and qualification<br />\n⭐ Use as a FAQ chatbot for websites<br />\n⭐ AI-powered chatbot with natural language processing<br />\n⭐ Use as scalable customer support system and personalized customer support experiences<br />\n⭐ Use this ChatBot for reducing customer support response time<br />\n⭐ Multilingual chatbot for international customers (Pro feature)<br />\n⭐ Lower webpage bounce rate<br />\n⭐ Longer user time on site<br />\n⭐ Voice-enabled chatbot for customer service (Pro feature)<br />\n⭐ Collect information and data from the website users</p>\n<h4>Who can benefit from WPBot ChatBot?</h4>\n<p>Chatbots can provide valuable benefits to a wide range of businesses by improving customer service, increasing efficiency, and enhancing user engagement. Here are some specific types of businesses that can significantly benefit from implementing chatbots:</p>\n<ol>\n<li>\n<p><strong>ChatBot for E-commerce and Retail</strong>:</p>\n<ul>\n<li><strong>Customer Support</strong>: Provide 24/7 assistance, answer FAQs, track orders, and handle returns.</li>\n<li><strong>Sales Assistance</strong>: Offer product recommendations, show featured products, and support during the purchasing process.</li>\n<li><strong>Abandoned Cart Recovery</strong>: Engage customers who have abandoned their shopping carts with personalized messages and offers.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Healthcare Industry</strong>:</p>\n<ul>\n<li><strong>Appointment Scheduling</strong>: Automate the booking of appointments.</li>\n<li><strong>Patient Information</strong>: Provide initial information on symptoms, treatments, and healthcare services.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Financial Services and Banking</strong>:</p>\n<ul>\n<li><strong>Customer Service</strong>: Handle frequently asked questions, provide information on products and services, and assist with troubleshooting.</li>\n<li><strong>Loan and Credit Applications</strong>: Guide users through loan applications.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Real Estate</strong>:</p>\n<ul>\n<li><strong>Lead Generation</strong>: Qualify leads by answering property queries and scheduling viewings.</li>\n<li><strong>Customer Support with ChatBot</strong>: Provide information on property listings, market conditions, and financing options.</li>\n<li><strong>Virtual Property Tours</strong>: Offer virtual tours and answer questions about properties.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Travel and Hospitality Industry</strong>:</p>\n<ul>\n<li><strong>Booking Services</strong>: Automate booking of flights, hotels, and vacation packages.</li>\n<li><strong>Customer Support</strong>: Assist with cancellations, and provide travel information.</li>\n<li><strong>Personalized Recommendations</strong>: Offer travel tips, destination information, and personalized vacation packages.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Education</strong>:</p>\n<ul>\n<li><strong>Student Support</strong>: Provide information on courses, application procedures, and campus life.</li>\n<li><strong>Tutoring</strong>: Offer automated tutoring sessions and study resources.</li>\n<li><strong>Administrative Assistance</strong>: Help with enrollment, scheduling</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Human Resources (HR)</strong>:</p>\n<ul>\n<li><strong>Recruitment</strong>: Screen candidates, schedule interviews, and answer job-related questions.</li>\n<li><strong>Employee Support</strong>: Assist with onboarding, provide HR policy information, and handle employee queries.</li>\n<li><strong>Performance Reviews</strong>: Automate the collection of feedback and performance reviews.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Customer Service-oriented Businesses</strong>:</p>\n<ul>\n<li><strong>Telecommunications</strong>: Handle billing inquiries, technical support, and service issues.</li>\n<li><strong>Utilities</strong>: Manage service requests, provide outage updates, and assist with billing inquiries.</li>\n<li><strong>Insurance</strong>: Help with policy information, claim processing, and provide quotes.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Marketing and Advertising</strong>:</p>\n<ul>\n<li><strong>Lead Generation</strong>: Qualify leads and collect customer information.</li>\n<li><strong>Engagement</strong>: Run interactive campaigns, quizzes, and promotions.</li>\n<li><strong>Customer Feedback</strong>: Collect feedback and conduct surveys to improve services.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Event Management</strong>:</p>\n<ul>\n<li><strong>Event Registration</strong>: Streamline the registration process for events, conferences, and webinars.</li>\n<li><strong>Attendee Engagement</strong>: Provide event schedules, speaker information, and answer attendee questions.</li>\n<li><strong>Feedback Collection</strong>: Gather feedback and reviews from event participants.</li>\n</ul>\n</li>\n<li>\n<p><strong>ChatBot for Restaurants and Food Services</strong>:</p>\n<ul>\n<li><strong>Order Placement</strong>: Automate the ordering process and provide menu recommendations.</li>\n<li><strong>Reservations</strong>: Handle table reservations.</li>\n<li><strong>Customer Feedback</strong>: Collect reviews and feedback from customers.</li>\n</ul>\n</li>\n</ol>\n<p>Take advantage of OpenAI GPT Assistant or Google&#8217;s AI and Natural Language Processing with this ChatBot<br />\n🚀 Outstanding chatbot conversational experience<br />\n🚀 Fully automated. Extremely simple to use, No coding required Plug n&#8217; play Bot</p>\n<h4>WPBOT Pro Version</h4>\n<p>WPBot Pro version is a multi-language supported chatbot. It is an affordable chatbot services for SMEs to provide multilingual chatbot for international customers.</p>\n<h4>WPBot Pro feature highlights</h4>\n<p><strong>Interactions</strong></p>\n<ul>\n<li>Create simple <strong>text responses</strong> easily from your WordPress backend.</li>\n<li>Create <strong>FAQ area</strong> with multiple questions and answers with Categories (supports html)</li>\n<li>Send <strong>eMail</strong>, <strong>Call Me Back</strong> &amp; <strong>Feedback</strong> Collection</li>\n<li>Collect <strong>User eMail </strong>for <strong>newsletter Subscription</strong></li>\n<li>Automatically supports images (jpgs, animated gifs) and <strong>Youtube Videos</strong> from WPBot Language Settings Responses</li>\n<li>Add <strong>video in Support area</strong> just by pasting Youtube link</li>\n<li>Option to <strong>Skip Greeting</strong> and Asking Name and eMail</li>\n<li>Option to show the ChatBot for Logged in users only</li>\n<li><strong>Skip</strong> Greetings and <strong>Trigger an Intent</strong> (like a Custom Form)</li>\n<li>Option to enable/disable<strong> asking for eMail</strong> address after asking name</li>\n<li>Enable <strong>Asking for Phone Number</strong></li>\n<li><strong>Quick Help for commands</strong> that can be used in-chat</li>\n<li><strong>Keyboard shortcuts</strong> (Ctrl+B to open bot, Esc to close)</li>\n</ul>\n<p><strong>OpenAI ChatGPT Integration</strong><br />\n* Integrate with OpenAI so the WPBot can answer any questions<br />\n* Train and Fine Tune OpenAI ChatGPT<br />\n* Fine tune with your Website data (pages, posts and custom post types)<br />\n* GPT Assistant support. Upload ChatBot Generated Website data, PDF  or any document to train ChatGPT<br />\n* Generate and Upload website contents as JSON file to your GPT Assistant for AI training<br />\n* OpenAI Content Writer and AI Content Generatror<br />\n* Open AI Image Generator</p>\n<p><strong>DialogFlow Integration</strong></p>\n<ul>\n<li>Full integration with Google Artificial Intelligence, Machine Learning or <strong>AI Engine DialogFlow</strong></li>\n<li>Supports <strong>DialogFlow ES &#8211; Essential</strong> and <strong>DialogFlow CX</strong></li>\n<li>Use DialogFlow CX as <strong>visual workflow builder</strong> to create conversations that are easier to design, <strong>enhance</strong>, and maintain.</li>\n<li>Supports <strong>Rich Message Response &amp; Card Responses</strong> from Dialogflow as FaceBook messenger app</li>\n<li><strong>Sample DialogFlow Agent </strong>for <strong>quick import</strong></li>\n</ul>\n<p><strong>Customization Options</strong></p>\n<ul>\n<li>Enable <strong>Extended Home</strong> Interface to present different interactive options to users</li>\n<li><strong>Enable</strong> or disable <strong>Different Sections</strong> and <strong>Buttons</strong> to show on the <strong>Extended Home</strong> interface</li>\n<li>Option to<strong> choose on which pages WPBot </strong>should <strong>load</strong></li>\n<li>Option to <strong>disable WPBot on Mobile Devices</strong></li>\n<li>Option to <strong>Auto Open WPBot Window For First Time</strong> Page Load</li>\n<li>Upload<strong> custom WPBot</strong> icon</li>\n<li>Upload custom <strong>Agent icon</strong></li>\n<li>Customize <strong>primary colors to match your site</strong></li>\n<li>Customize bot <strong>response</strong> time</li>\n<li>Option to Keep ChatBot window open when browsing</li>\n<li><strong>Hide/Show</strong> <strong>Icons </strong>at the bottom of WPBot window<strong><br />\n</strong></li>\n</ul>\n<p><strong>User Conversions &amp; Retargeting</strong></p>\n<ul>\n<li>Onsite<strong> retargeting and remarketing</strong> to increase customer conversion rate.</li>\n<li>Show <strong>retargeting</strong> messages for customer on <strong>Exit Intent, After Scrolling Down “X” Percent, Or after “X” seconds.</strong></li>\n<li>Create <strong>different Reargeting messages</strong> for different pages</li>\n<li>Collect <strong>User eMail </strong>for <strong>newsletter Subscription</strong></li>\n<li><strong>Prompt User </strong>for <strong>eMail subscription </strong>with <strong>Retargeting Message</strong></li>\n<li>Export <strong>eMail Addresses as CSV</strong></li>\n<li>Out of focus <strong>Browser tab flashing</strong> with custom message</li>\n</ul>\n<p><strong>Notification Builder</strong></p>\n<ul>\n<li>Add<strong> multiple notifications</strong> to show above the WPBot icon</li>\n<li>Select an <strong>Intent</strong> for Click Action</li>\n<li><strong>Add links</strong> to any Intent in the Notification area so user can directly browse to the useful parts</li>\n</ul>\n<p><strong>Start Menu</strong></p>\n<ul>\n<li>Manage the <strong>Start Menu </strong>buttons with <strong>Drag and Drop</strong></li>\n<li>Option to <strong>Enable/Disable</strong> all ready intents like Site Search, Call Me, eMail, FAQ, newsletter subscription etc.</li>\n<li><strong>Rearrange</strong> the Start Menu Items</li>\n<li>Add Custom Menu Button with <strong>Link</strong></li>\n<li>Option to set after how many failed attempt to show Start Menu</li>\n</ul>\n<p><strong>Interactive Forms</strong><br />\nExtend the Start Menu with the <strong>powerful Conversational Forms</strong>. It is a visual,<strong> drag and drop</strong> form builder. You can create:</p>\n<ul>\n<li>Conditional <strong>Menu Driven Conversations</strong></li>\n<li>Standard Contact Forms</li>\n<li>Job <strong>Application Forms</strong></li>\n<li><strong>Lead Capture</strong> Forms</li>\n<li>Various types of <strong>Calculators</strong></li>\n<li>Feedback <strong>Survey</strong> Forms etc.</li>\n</ul>\n<p><strong>Language Support</strong></p>\n<ul>\n<li>Works with <strong>any language</strong> (multi language support is available with WPBot Pro Master license).</li>\n<li><strong>Advanced Language Center t</strong>o edit and change every WPBot responses, System languages, stop words and info messages!</li>\n<li><strong>Stop Words</strong> dictionary included and editable by admin. Bot will automatically exclude stop words from search criteria and chat commands</li>\n<li>Add <strong>multiple variations</strong> of <strong>WPBot responses</strong> for each node. They will be used randomly and give an appearance of more human like responses.</li>\n<li>mo/pot file included so you can translate backend to any language</li>\n<li><strong>RTL support</strong></li>\n<li><strong>Multi Language support. Multilingual chatbot for international customers </strong> </li>\n</ul>\n<p><strong>Embedding Features</strong></p>\n<ul>\n<li><strong>Embed code to use the ChatBot</strong> on any other websites including static HTML website</li>\n<li><strong> Widget Shortcode</strong> to show the ChatBot on a page or post instead of Floating icon</li>\n<li>Shortcode for <strong>Click to Chat</strong> Button with the possibility to <strong>Trigger Specific Intent</strong> (<strong>forms</strong> etc.) on a page or post</li>\n</ul>\n<p><strong>Button Integrations</strong></p>\n<ul>\n<li>Integration with<strong> FaceBook Messenger for Customer Live Chat </strong>as a floating button<strong><br />\n</strong></li>\n<li>Lite Integration with <strong>Skype, WhatsApp, Viber, Web Link &amp; Phone Call</strong></li>\n<li><strong>Integrate with 3rd party Live Chat services</strong> that provides a stand alone chat page link like Tawk.to</li>\n</ul>\n<p><strong>Misc. Features</strong></p>\n<ul>\n<li><strong>Persistent chat history</strong> over user session on website</li>\n<li>Option to <strong>Disable persistent chat history</strong> (Chat history is reset in every page)</li>\n<li>Remember chat history in browser local storage and <strong>greet returning users</strong></li>\n<li>Option to Open pages in new or same window from search results</li>\n<li><strong>GDPR</strong> compliance (message with link to Privacy page)</li>\n<li><strong>Schedule day and time when WPBot will run</strong>. Make WPBot work with other Live chat software.</li>\n<li><strong>Priority Support</strong></li>\n</ul>\n<p><strong>Useful <a href=\"https://www.wpbot.pro/wpbot-modules/\" rel=\"nofollow ugc\">WPBot Modules</a></strong> for WPBot Pro</p>\n<ul>\n<li><strong>Conversational Forms</strong> Pro </li>\n<li><strong>Live Chat</strong> </li>\n<li>Chat <strong>Sessions &amp; Histories</strong> </li>\n<li>FacebBook <strong>Messenger</strong> </li>\n<li><strong>WhatApp WPBot</strong> Integration through Twilio</li>\n<li><strong>Extended Search</strong> </li>\n<li><strong>White Label ChatBot</strong> </li>\n<li><strong>Mailing List</strong> Integration </li>\n<li><strong>Extended</strong> UI (2 additional templates)</li>\n<li><strong>Settings Import/Export</strong></li>\n<li><strong>Multi Language support. Multilingual chatbot for international customers </strong> </li>\n<li><strong>Voice Message</strong> </li>\n<li><strong>Simple text Response</strong>s Pro </li>\n<li><strong>Woocommerce</strong> </li>\n<li><strong>Voice</strong> </li>\n<li><strong>Telegram Bot</strong> </li>\n</ul>\n<blockquote>\n<p>++ Download <a href=\"https://github.com/qcloud/chatbot\" rel=\"nofollow ugc\">Free WPBot</a> from GITHUB</p>\n<p>++ <a href=\"https://www.wpbot.pro/\" rel=\"nofollow ugc\">View Demo of the WPBot</a></p>\n<p>++ Upgrade to <a href=\"https://www.wpbot.pro/\" rel=\"nofollow ugc\">WPBot Pro Now!</a></p>\n</blockquote>\n",
    "download_link": "https://downloads.wordpress.org/plugin/chatbot.5.8.8.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/chatbot/assets/screenshot-1.jpg?rev=3100556",
            "caption": "WordPress Chatbot hard at work"
        },
        {
            "src": "https://ps.w.org/chatbot/assets/screenshot-2.jpg?rev=3100556",
            "caption": "WPBot window Template 1"
        },
        {
            "src": "https://ps.w.org/chatbot/assets/screenshot-3.jpg?rev=3100556",
            "caption": "WPBot window Template 2"
        },
        {
            "src": "https://ps.w.org/chatbot/assets/screenshot-4.jpg?rev=3100556",
            "caption": "WPBot window Template 3"
        },
        {
            "src": "https://ps.w.org/chatbot/assets/screenshot-5.png?rev=3100556",
            "caption": "WPBot General Settings"
        },
        {
            "src": "https://ps.w.org/chatbot/assets/screenshot-6.png?rev=3100556",
            "caption": "WPBot Language Settings"
        },
        {
            "src": "https://ps.w.org/chatbot/assets/screenshot-7.png?rev=3100556",
            "caption": "WPBot Icons and Templates"
        },
        {
            "src": "https://ps.w.org/chatbot/assets/screenshot-8.png?rev=3100556",
            "caption": "WPBot FAQ Builder"
        },
        {
            "src": "https://ps.w.org/chatbot/assets/screenshot-9.png?rev=3100556",
            "caption": "WPBot Start Menu Builder"
        },
        {
            "src": "https://ps.w.org/chatbot/assets/screenshot-10.png?rev=3100556",
            "caption": "WPBot DialogFlow Settings"
        },
        {
            "src": "https://ps.w.org/chatbot/assets/screenshot-11.png?rev=3100556",
            "caption": "WPBot OpenAI Settings"
        },
        {
            "src": "https://ps.w.org/chatbot/assets/screenshot-12.png?rev=3100556",
            "caption": "WPBot Simple Text Responses"
        },
        {
            "src": "https://ps.w.org/chatbot/assets/screenshot-13.png?rev=3100556",
            "caption": "WPBot Conversational Form Builder"
        }
    ],
    "tags": {
        "ai": "AI",
        "chatbot": "chatbot",
        "chatgpt": "ChatGPT",
        "live-chat": "live chat",
        "live-support": "live support"
    },
    "stable_tag": "5.8.8",
    "versions": {
        "0.9.0": "https://downloads.wordpress.org/plugin/chatbot.0.9.0.zip",
        "1.0.0": "https://downloads.wordpress.org/plugin/chatbot.1.0.0.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/chatbot.1.1.0.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/chatbot.1.1.5.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/chatbot.1.2.0.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/chatbot.1.3.0.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/chatbot.1.5.0.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/chatbot.1.6.0.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/chatbot.1.7.0.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/chatbot.1.8.0.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/chatbot.1.9.0.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/chatbot.2.0.0.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/chatbot.2.1.0.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/chatbot.2.2.0.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/chatbot.2.3.0.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/chatbot.2.4.0.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/chatbot.2.5.0.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/chatbot.2.6.0.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/chatbot.2.7.0.zip",
        "2.8.0": "https://downloads.wordpress.org/plugin/chatbot.2.8.0.zip",
        "2.9.0": "https://downloads.wordpress.org/plugin/chatbot.2.9.0.zip",
        "2.9.1": "https://downloads.wordpress.org/plugin/chatbot.2.9.1.zip",
        "2.9.2": "https://downloads.wordpress.org/plugin/chatbot.2.9.2.zip",
        "2.9.3": "https://downloads.wordpress.org/plugin/chatbot.2.9.3.zip",
        "2.9.4": "https://downloads.wordpress.org/plugin/chatbot.2.9.4.zip",
        "2.9.5": "https://downloads.wordpress.org/plugin/chatbot.2.9.5.zip",
        "2.9.6": "https://downloads.wordpress.org/plugin/chatbot.2.9.6.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/chatbot.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/chatbot.3.0.1.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/chatbot.3.1.0.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/chatbot.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/chatbot.3.2.1.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/chatbot.3.2.2.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/chatbot.3.2.3.zip",
        "3.2.5": "https://downloads.wordpress.org/plugin/chatbot.3.2.5.zip",
        "3.2.6": "https://downloads.wordpress.org/plugin/chatbot.3.2.6.zip",
        "3.2.7": "https://downloads.wordpress.org/plugin/chatbot.3.2.7.zip",
        "3.2.8": "https://downloads.wordpress.org/plugin/chatbot.3.2.8.zip",
        "3.2.9": "https://downloads.wordpress.org/plugin/chatbot.3.2.9.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/chatbot.3.3.0.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/chatbot.3.3.1.zip",
        "3.3.2": "https://downloads.wordpress.org/plugin/chatbot.3.3.2.zip",
        "3.3.3": "https://downloads.wordpress.org/plugin/chatbot.3.3.3.zip",
        "3.3.4": "https://downloads.wordpress.org/plugin/chatbot.3.3.4.zip",
        "3.3.5": "https://downloads.wordpress.org/plugin/chatbot.3.3.5.zip",
        "3.3.6": "https://downloads.wordpress.org/plugin/chatbot.3.3.6.zip",
        "3.3.7": "https://downloads.wordpress.org/plugin/chatbot.3.3.7.zip",
        "3.3.8": "https://downloads.wordpress.org/plugin/chatbot.3.3.8.zip",
        "3.3.9": "https://downloads.wordpress.org/plugin/chatbot.3.3.9.zip",
        "3.4.0": "https://downloads.wordpress.org/plugin/chatbot.3.4.0.zip",
        "3.4.1": "https://downloads.wordpress.org/plugin/chatbot.3.4.1.zip",
        "3.4.2": "https://downloads.wordpress.org/plugin/chatbot.3.4.2.zip",
        "3.4.3": "https://downloads.wordpress.org/plugin/chatbot.3.4.3.zip",
        "3.4.4": "https://downloads.wordpress.org/plugin/chatbot.3.4.4.zip",
        "3.4.5": "https://downloads.wordpress.org/plugin/chatbot.3.4.5.zip",
        "3.4.6": "https://downloads.wordpress.org/plugin/chatbot.3.4.6.zip",
        "3.4.7": "https://downloads.wordpress.org/plugin/chatbot.3.4.7.zip",
        "3.4.8": "https://downloads.wordpress.org/plugin/chatbot.3.4.8.zip",
        "3.4.9": "https://downloads.wordpress.org/plugin/chatbot.3.4.9.zip",
        "3.5.0": "https://downloads.wordpress.org/plugin/chatbot.3.5.0.zip",
        "3.5.1": "https://downloads.wordpress.org/plugin/chatbot.3.5.1.zip",
        "3.5.2": "https://downloads.wordpress.org/plugin/chatbot.3.5.2.zip",
        "3.5.3": "https://downloads.wordpress.org/plugin/chatbot.3.5.3.zip",
        "3.5.4": "https://downloads.wordpress.org/plugin/chatbot.3.5.4.zip",
        "3.5.5": "https://downloads.wordpress.org/plugin/chatbot.3.5.5.zip",
        "3.5.6": "https://downloads.wordpress.org/plugin/chatbot.3.5.6.zip",
        "3.5.7": "https://downloads.wordpress.org/plugin/chatbot.3.5.7.zip",
        "3.5.8": "https://downloads.wordpress.org/plugin/chatbot.3.5.8.zip",
        "3.5.9": "https://downloads.wordpress.org/plugin/chatbot.3.5.9.zip",
        "3.6.0": "https://downloads.wordpress.org/plugin/chatbot.3.6.0.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/chatbot.3.6.1.zip",
        "3.6.2": "https://downloads.wordpress.org/plugin/chatbot.3.6.2.zip",
        "3.6.3": "https://downloads.wordpress.org/plugin/chatbot.3.6.3.zip",
        "3.6.4": "https://downloads.wordpress.org/plugin/chatbot.3.6.4.zip",
        "3.6.5": "https://downloads.wordpress.org/plugin/chatbot.3.6.5.zip",
        "3.6.6": "https://downloads.wordpress.org/plugin/chatbot.3.6.6.zip",
        "3.6.7": "https://downloads.wordpress.org/plugin/chatbot.3.6.7.zip",
        "3.6.8": "https://downloads.wordpress.org/plugin/chatbot.3.6.8.zip",
        "3.6.9": "https://downloads.wordpress.org/plugin/chatbot.3.6.9.zip",
        "3.7.0": "https://downloads.wordpress.org/plugin/chatbot.3.7.0.zip",
        "3.7.1": "https://downloads.wordpress.org/plugin/chatbot.3.7.1.zip",
        "3.7.2": "https://downloads.wordpress.org/plugin/chatbot.3.7.2.zip",
        "3.7.3": "https://downloads.wordpress.org/plugin/chatbot.3.7.3.zip",
        "3.7.4": "https://downloads.wordpress.org/plugin/chatbot.3.7.4.zip",
        "3.7.5": "https://downloads.wordpress.org/plugin/chatbot.3.7.5.zip",
        "3.7.6": "https://downloads.wordpress.org/plugin/chatbot.3.7.6.zip",
        "3.7.7": "https://downloads.wordpress.org/plugin/chatbot.3.7.7.zip",
        "3.7.8": "https://downloads.wordpress.org/plugin/chatbot.3.7.8.zip",
        "3.7.9": "https://downloads.wordpress.org/plugin/chatbot.3.7.9.zip",
        "3.8.0": "https://downloads.wordpress.org/plugin/chatbot.3.8.0.zip",
        "3.8.1": "https://downloads.wordpress.org/plugin/chatbot.3.8.1.zip",
        "3.8.2": "https://downloads.wordpress.org/plugin/chatbot.3.8.2.zip",
        "3.8.3": "https://downloads.wordpress.org/plugin/chatbot.3.8.3.zip",
        "3.8.5": "https://downloads.wordpress.org/plugin/chatbot.3.8.5.zip",
        "3.8.9": "https://downloads.wordpress.org/plugin/chatbot.3.8.9.zip",
        "3.9.0": "https://downloads.wordpress.org/plugin/chatbot.3.9.0.zip",
        "3.9.1": "https://downloads.wordpress.org/plugin/chatbot.3.9.1.zip",
        "3.9.2": "https://downloads.wordpress.org/plugin/chatbot.3.9.2.zip",
        "3.9.3": "https://downloads.wordpress.org/plugin/chatbot.3.9.3.zip",
        "3.9.4": "https://downloads.wordpress.org/plugin/chatbot.3.9.4.zip",
        "3.9.5": "https://downloads.wordpress.org/plugin/chatbot.3.9.5.zip",
        "3.9.6": "https://downloads.wordpress.org/plugin/chatbot.3.9.6.zip",
        "3.9.7": "https://downloads.wordpress.org/plugin/chatbot.3.9.7.zip",
        "3.9.8": "https://downloads.wordpress.org/plugin/chatbot.3.9.8.zip",
        "3.9.9": "https://downloads.wordpress.org/plugin/chatbot.3.9.9.zip",
        "4.0.1": "https://downloads.wordpress.org/plugin/chatbot.4.0.1.zip",
        "4.0.2": "https://downloads.wordpress.org/plugin/chatbot.4.0.2.zip",
        "4.0.3": "https://downloads.wordpress.org/plugin/chatbot.4.0.3.zip",
        "4.0.4": "https://downloads.wordpress.org/plugin/chatbot.4.0.4.zip",
        "4.0.5": "https://downloads.wordpress.org/plugin/chatbot.4.0.5.zip",
        "4.0.6": "https://downloads.wordpress.org/plugin/chatbot.4.0.6.zip",
        "4.0.7": "https://downloads.wordpress.org/plugin/chatbot.4.0.7.zip",
        "4.0.8": "https://downloads.wordpress.org/plugin/chatbot.4.0.8.zip",
        "4.0.9": "https://downloads.wordpress.org/plugin/chatbot.4.0.9.zip",
        "4.1.0": "https://downloads.wordpress.org/plugin/chatbot.4.1.0.zip",
        "4.1.1": "https://downloads.wordpress.org/plugin/chatbot.4.1.1.zip",
        "4.1.2": "https://downloads.wordpress.org/plugin/chatbot.4.1.2.zip",
        "4.1.3": "https://downloads.wordpress.org/plugin/chatbot.4.1.3.zip",
        "4.1.4": "https://downloads.wordpress.org/plugin/chatbot.4.1.4.zip",
        "4.1.5": "https://downloads.wordpress.org/plugin/chatbot.4.1.5.zip",
        "4.1.8": "https://downloads.wordpress.org/plugin/chatbot.4.1.8.zip",
        "4.1.9": "https://downloads.wordpress.org/plugin/chatbot.4.1.9.zip",
        "4.2.0": "https://downloads.wordpress.org/plugin/chatbot.4.2.0.zip",
        "4.2.1": "https://downloads.wordpress.org/plugin/chatbot.4.2.1.zip",
        "4.2.2": "https://downloads.wordpress.org/plugin/chatbot.4.2.2.zip",
        "4.2.3": "https://downloads.wordpress.org/plugin/chatbot.4.2.3.zip",
        "4.2.4": "https://downloads.wordpress.org/plugin/chatbot.4.2.4.zip",
        "4.2.5": "https://downloads.wordpress.org/plugin/chatbot.4.2.5.zip",
        "4.2.6": "https://downloads.wordpress.org/plugin/chatbot.4.2.6.zip",
        "4.2.7": "https://downloads.wordpress.org/plugin/chatbot.4.2.7.zip",
        "4.2.8": "https://downloads.wordpress.org/plugin/chatbot.4.2.8.zip",
        "4.2.9": "https://downloads.wordpress.org/plugin/chatbot.4.2.9.zip",
        "4.3.0": "https://downloads.wordpress.org/plugin/chatbot.4.3.0.zip",
        "4.3.1": "https://downloads.wordpress.org/plugin/chatbot.4.3.1.zip",
        "4.3.2": "https://downloads.wordpress.org/plugin/chatbot.4.3.2.zip",
        "4.3.3": "https://downloads.wordpress.org/plugin/chatbot.4.3.3.zip",
        "4.3.4": "https://downloads.wordpress.org/plugin/chatbot.4.3.4.zip",
        "4.3.7": "https://downloads.wordpress.org/plugin/chatbot.4.3.7.zip",
        "4.3.8": "https://downloads.wordpress.org/plugin/chatbot.4.3.8.zip",
        "4.3.9": "https://downloads.wordpress.org/plugin/chatbot.4.3.9.zip",
        "4.4.0": "https://downloads.wordpress.org/plugin/chatbot.4.4.0.zip",
        "4.4.1": "https://downloads.wordpress.org/plugin/chatbot.4.4.1.zip",
        "4.4.2": "https://downloads.wordpress.org/plugin/chatbot.4.4.2.zip",
        "4.4.3": "https://downloads.wordpress.org/plugin/chatbot.4.4.3.zip",
        "4.4.4": "https://downloads.wordpress.org/plugin/chatbot.4.4.4.zip",
        "4.4.5": "https://downloads.wordpress.org/plugin/chatbot.4.4.5.zip",
        "4.4.6": "https://downloads.wordpress.org/plugin/chatbot.4.4.6.zip",
        "4.4.7": "https://downloads.wordpress.org/plugin/chatbot.4.4.7.zip",
        "4.4.8": "https://downloads.wordpress.org/plugin/chatbot.4.4.8.zip",
        "4.4.9": "https://downloads.wordpress.org/plugin/chatbot.4.4.9.zip",
        "4.5.1": "https://downloads.wordpress.org/plugin/chatbot.4.5.1.zip",
        "4.5.2": "https://downloads.wordpress.org/plugin/chatbot.4.5.2.zip",
        "4.5.3": "https://downloads.wordpress.org/plugin/chatbot.4.5.3.zip",
        "4.5.4": "https://downloads.wordpress.org/plugin/chatbot.4.5.4.zip",
        "4.5.5": "https://downloads.wordpress.org/plugin/chatbot.4.5.5.zip",
        "4.5.6": "https://downloads.wordpress.org/plugin/chatbot.4.5.6.zip",
        "4.5.7": "https://downloads.wordpress.org/plugin/chatbot.4.5.7.zip",
        "4.5.8": "https://downloads.wordpress.org/plugin/chatbot.4.5.8.zip",
        "4.5.9": "https://downloads.wordpress.org/plugin/chatbot.4.5.9.zip",
        "4.6.0": "https://downloads.wordpress.org/plugin/chatbot.4.6.0.zip",
        "4.6.1": "https://downloads.wordpress.org/plugin/chatbot.4.6.1.zip",
        "4.6.2": "https://downloads.wordpress.org/plugin/chatbot.4.6.2.zip",
        "4.6.3": "https://downloads.wordpress.org/plugin/chatbot.4.6.3.zip",
        "4.6.5": "https://downloads.wordpress.org/plugin/chatbot.4.6.5.zip",
        "4.6.6": "https://downloads.wordpress.org/plugin/chatbot.4.6.6.zip",
        "4.6.7": "https://downloads.wordpress.org/plugin/chatbot.4.6.7.zip",
        "4.6.8": "https://downloads.wordpress.org/plugin/chatbot.4.6.8.zip",
        "4.6.9": "https://downloads.wordpress.org/plugin/chatbot.4.6.9.zip",
        "4.7.0": "https://downloads.wordpress.org/plugin/chatbot.4.7.0.zip",
        "4.7.1": "https://downloads.wordpress.org/plugin/chatbot.4.7.1.zip",
        "4.7.2": "https://downloads.wordpress.org/plugin/chatbot.4.7.2.zip",
        "4.7.3": "https://downloads.wordpress.org/plugin/chatbot.4.7.3.zip",
        "4.7.4": "https://downloads.wordpress.org/plugin/chatbot.4.7.4.zip",
        "4.7.5": "https://downloads.wordpress.org/plugin/chatbot.4.7.5.zip",
        "4.7.6": "https://downloads.wordpress.org/plugin/chatbot.4.7.6.zip",
        "4.7.7": "https://downloads.wordpress.org/plugin/chatbot.4.7.7.zip",
        "4.7.8": "https://downloads.wordpress.org/plugin/chatbot.4.7.8.zip",
        "4.7.9": "https://downloads.wordpress.org/plugin/chatbot.4.7.9.zip",
        "4.8.0": "https://downloads.wordpress.org/plugin/chatbot.4.8.0.zip",
        "4.8.1": "https://downloads.wordpress.org/plugin/chatbot.4.8.1.zip",
        "4.8.2": "https://downloads.wordpress.org/plugin/chatbot.4.8.2.zip",
        "4.8.3": "https://downloads.wordpress.org/plugin/chatbot.4.8.3.zip",
        "4.8.4": "https://downloads.wordpress.org/plugin/chatbot.4.8.4.zip",
        "4.8.5": "https://downloads.wordpress.org/plugin/chatbot.4.8.5.zip",
        "4.8.6": "https://downloads.wordpress.org/plugin/chatbot.4.8.6.zip",
        "4.8.7": "https://downloads.wordpress.org/plugin/chatbot.4.8.7.zip",
        "4.8.8": "https://downloads.wordpress.org/plugin/chatbot.4.8.8.zip",
        "4.8.9": "https://downloads.wordpress.org/plugin/chatbot.4.8.9.zip",
        "4.9.1": "https://downloads.wordpress.org/plugin/chatbot.4.9.1.zip",
        "4.9.2": "https://downloads.wordpress.org/plugin/chatbot.4.9.2.zip",
        "4.9.3": "https://downloads.wordpress.org/plugin/chatbot.4.9.3.zip",
        "4.9.4": "https://downloads.wordpress.org/plugin/chatbot.4.9.4.zip",
        "4.9.5": "https://downloads.wordpress.org/plugin/chatbot.4.9.5.zip",
        "4.9.6": "https://downloads.wordpress.org/plugin/chatbot.4.9.6.zip",
        "4.9.7": "https://downloads.wordpress.org/plugin/chatbot.4.9.7.zip",
        "4.9.8": "https://downloads.wordpress.org/plugin/chatbot.4.9.8.zip",
        "4.9.9": "https://downloads.wordpress.org/plugin/chatbot.4.9.9.zip",
        "5.0.1": "https://downloads.wordpress.org/plugin/chatbot.5.0.1.zip",
        "5.0.2": "https://downloads.wordpress.org/plugin/chatbot.5.0.2.zip",
        "5.0.3": "https://downloads.wordpress.org/plugin/chatbot.5.0.3.zip",
        "5.0.4": "https://downloads.wordpress.org/plugin/chatbot.5.0.4.zip",
        "5.0.5": "https://downloads.wordpress.org/plugin/chatbot.5.0.5.zip",
        "5.0.6": "https://downloads.wordpress.org/plugin/chatbot.5.0.6.zip",
        "5.0.7": "https://downloads.wordpress.org/plugin/chatbot.5.0.7.zip",
        "5.0.9": "https://downloads.wordpress.org/plugin/chatbot.5.0.9.zip",
        "5.1.0": "https://downloads.wordpress.org/plugin/chatbot.5.1.0.zip",
        "5.1.1": "https://downloads.wordpress.org/plugin/chatbot.5.1.1.zip",
        "5.1.2": "https://downloads.wordpress.org/plugin/chatbot.5.1.2.zip",
        "5.1.3": "https://downloads.wordpress.org/plugin/chatbot.5.1.3.zip",
        "5.1.4": "https://downloads.wordpress.org/plugin/chatbot.5.1.4.zip",
        "5.1.5": "https://downloads.wordpress.org/plugin/chatbot.5.1.5.zip",
        "5.1.6": "https://downloads.wordpress.org/plugin/chatbot.5.1.6.zip",
        "5.1.7": "https://downloads.wordpress.org/plugin/chatbot.5.1.7.zip",
        "5.1.8": "https://downloads.wordpress.org/plugin/chatbot.5.1.8.zip",
        "5.1.9": "https://downloads.wordpress.org/plugin/chatbot.5.1.9.zip",
        "5.2.0": "https://downloads.wordpress.org/plugin/chatbot.5.2.0.zip",
        "5.2.1": "https://downloads.wordpress.org/plugin/chatbot.5.2.1.zip",
        "5.2.2": "https://downloads.wordpress.org/plugin/chatbot.5.2.2.zip",
        "5.2.3": "https://downloads.wordpress.org/plugin/chatbot.5.2.3.zip",
        "5.2.4": "https://downloads.wordpress.org/plugin/chatbot.5.2.4.zip",
        "5.2.5": "https://downloads.wordpress.org/plugin/chatbot.5.2.5.zip",
        "5.2.6": "https://downloads.wordpress.org/plugin/chatbot.5.2.6.zip",
        "5.2.7": "https://downloads.wordpress.org/plugin/chatbot.5.2.7.zip",
        "5.2.8": "https://downloads.wordpress.org/plugin/chatbot.5.2.8.zip",
        "5.2.9": "https://downloads.wordpress.org/plugin/chatbot.5.2.9.zip",
        "5.3.0": "https://downloads.wordpress.org/plugin/chatbot.5.3.0.zip",
        "5.3.1": "https://downloads.wordpress.org/plugin/chatbot.5.3.1.zip",
        "5.3.2": "https://downloads.wordpress.org/plugin/chatbot.5.3.2.zip",
        "5.3.3": "https://downloads.wordpress.org/plugin/chatbot.5.3.3.zip",
        "5.3.4": "https://downloads.wordpress.org/plugin/chatbot.5.3.4.zip",
        "5.3.6": "https://downloads.wordpress.org/plugin/chatbot.5.3.6.zip",
        "5.3.7": "https://downloads.wordpress.org/plugin/chatbot.5.3.7.zip",
        "5.3.8": "https://downloads.wordpress.org/plugin/chatbot.5.3.8.zip",
        "5.3.9": "https://downloads.wordpress.org/plugin/chatbot.5.3.9.zip",
        "5.4.1": "https://downloads.wordpress.org/plugin/chatbot.5.4.1.zip",
        "5.4.2": "https://downloads.wordpress.org/plugin/chatbot.5.4.2.zip",
        "5.4.3": "https://downloads.wordpress.org/plugin/chatbot.5.4.3.zip",
        "5.4.4": "https://downloads.wordpress.org/plugin/chatbot.5.4.4.zip",
        "5.4.5": "https://downloads.wordpress.org/plugin/chatbot.5.4.5.zip",
        "5.4.6": "https://downloads.wordpress.org/plugin/chatbot.5.4.6.zip",
        "5.4.7": "https://downloads.wordpress.org/plugin/chatbot.5.4.7.zip",
        "5.4.8": "https://downloads.wordpress.org/plugin/chatbot.5.4.8.zip",
        "5.4.9": "https://downloads.wordpress.org/plugin/chatbot.5.4.9.zip",
        "5.5.0": "https://downloads.wordpress.org/plugin/chatbot.5.5.0.zip",
        "5.5.1": "https://downloads.wordpress.org/plugin/chatbot.5.5.1.zip",
        "5.5.2": "https://downloads.wordpress.org/plugin/chatbot.5.5.2.zip",
        "5.5.3": "https://downloads.wordpress.org/plugin/chatbot.5.5.3.zip",
        "5.5.4": "https://downloads.wordpress.org/plugin/chatbot.5.5.4.zip",
        "5.5.5": "https://downloads.wordpress.org/plugin/chatbot.5.5.5.zip",
        "5.5.6": "https://downloads.wordpress.org/plugin/chatbot.5.5.6.zip",
        "5.5.7": "https://downloads.wordpress.org/plugin/chatbot.5.5.7.zip",
        "5.5.8": "https://downloads.wordpress.org/plugin/chatbot.5.5.8.zip",
        "5.5.9": "https://downloads.wordpress.org/plugin/chatbot.5.5.9.zip",
        "5.6.0": "https://downloads.wordpress.org/plugin/chatbot.5.6.0.zip",
        "5.6.1": "https://downloads.wordpress.org/plugin/chatbot.5.6.1.zip",
        "5.6.2": "https://downloads.wordpress.org/plugin/chatbot.5.6.2.zip",
        "5.6.3": "https://downloads.wordpress.org/plugin/chatbot.5.6.3.zip",
        "5.6.4": "https://downloads.wordpress.org/plugin/chatbot.5.6.4.zip",
        "5.6.6": "https://downloads.wordpress.org/plugin/chatbot.5.6.6.zip",
        "5.6.7": "https://downloads.wordpress.org/plugin/chatbot.5.6.7.zip",
        "5.6.9": "https://downloads.wordpress.org/plugin/chatbot.5.6.9.zip",
        "5.7.0": "https://downloads.wordpress.org/plugin/chatbot.5.7.0.zip",
        "5.7.1": "https://downloads.wordpress.org/plugin/chatbot.5.7.1.zip",
        "5.7.2": "https://downloads.wordpress.org/plugin/chatbot.5.7.2.zip",
        "5.7.3": "https://downloads.wordpress.org/plugin/chatbot.5.7.3.zip",
        "5.7.4": "https://downloads.wordpress.org/plugin/chatbot.5.7.4.zip",
        "5.7.5": "https://downloads.wordpress.org/plugin/chatbot.5.7.5.zip",
        "5.7.6": "https://downloads.wordpress.org/plugin/chatbot.5.7.6.zip",
        "5.7.7": "https://downloads.wordpress.org/plugin/chatbot.5.7.7.zip",
        "5.7.8": "https://downloads.wordpress.org/plugin/chatbot.5.7.8.zip",
        "5.7.9": "https://downloads.wordpress.org/plugin/chatbot.5.7.9.zip",
        "5.8.0": "https://downloads.wordpress.org/plugin/chatbot.5.8.0.zip",
        "5.8.1": "https://downloads.wordpress.org/plugin/chatbot.5.8.1.zip",
        "5.8.3": "https://downloads.wordpress.org/plugin/chatbot.5.8.3.zip",
        "5.8.4": "https://downloads.wordpress.org/plugin/chatbot.5.8.4.zip",
        "5.8.5": "https://downloads.wordpress.org/plugin/chatbot.5.8.5.zip",
        "5.8.6": "https://downloads.wordpress.org/plugin/chatbot.5.8.6.zip",
        "5.8.7": "https://downloads.wordpress.org/plugin/chatbot.5.8.7.zip",
        "5.8.8": "https://downloads.wordpress.org/plugin/chatbot.5.8.8.zip",
        "trunk": "https://downloads.wordpress.org/plugin/chatbot.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.wpbot.pro/",
    "banners": {
        "low": "https://ps.w.org/chatbot/assets/banner-772x250.jpg?rev=2861400",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/chatbot/assets/icon-256x256.png?rev=1990923",
        "2x": "https://ps.w.org/chatbot/assets/icon-256x256.png?rev=1990923"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 94,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "chatbot",
            "language": "nl_NL",
            "version": "5.8.7",
            "updated": "2024-05-17 21:04:26",
            "package": "https://downloads.wordpress.org/translation/plugin/chatbot/5.8.7/nl_NL.zip"
        }
    ]
}