{
    "name": "UpsellWP &#8211; WooCommerce Upsell, Cross Sell, Order Bumps, One Click Upsell, Frequently Bought Together, Next Order Coupons, Product Recommendations",
    "slug": "checkout-upsell-and-order-bumps",
    "version": "2.1.2",
    "author": "<a href=\"https://upsellwp.com\">UpsellWP</a>",
    "author_profile": "https://profiles.wordpress.org/flycart/",
    "contributors": {
        "flycart": {
            "profile": "https://profiles.wordpress.org/flycart/",
            "avatar": "https://secure.gravatar.com/avatar/086ee96a3d86e88e7a3a52238cfc1bda?s=96&d=monsterid&r=g",
            "display_name": "flycart"
        }
    },
    "requires": "5.3",
    "tested": "6.6.1",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 96,
    "ratings": {
        "5": 30,
        "4": 1,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 32,
    "support_url": "https://wordpress.org/support/plugin/checkout-upsell-and-order-bumps/",
    "support_threads": 1,
    "support_threads_resolved": 1,
    "active_installs": 2000,
    "downloaded": 16944,
    "last_updated": "2024-08-27 07:22:00",
    "added": "2023-05-18",
    "homepage": "https://upsellwp.com",
    "sections": {
        "description": "<p>Boost your WooCommerce store&#8217;s sales with our All-in-One <strong>#1 WooCommerce Upsell Plugin</strong>. It lets you create one-click upsell offers in the store, helping you to increase the Average Order Value and boost sales easily.</p>\n<p><a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">The WooCommerce Upsell plugin</a> facilitates store owners to make special offers exclusively on their checkout page, enabling them to increase their conversions and Average Order Value. The offer gets added to the customer’s existing order in just a single click.<br />\nShow your customers an exclusive offer deal at an unbelievable price at the very moment that they are checking out.</p>\n<p>Relevant offers can be set for specific targets with WooCommerce Order Bump Plugin which ensures customer satisfaction and thus result in improved sales improvements.</p>\n<p><strong>Watch a Video on best ways to upsell in WooCommerce</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"754\" height=\"424\" src=\"https://www.youtube.com/embed/JUCFEhmrHSY?version=3&#038;rel=0&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><a href=\"https://demo.upsellwp.net/quick-demo?utm_source=upsell-wp-repo-view-demo&amp;utm_medium=wprepo&amp;utm_campaign=checkout-upsell-pro\" rel=\"nofollow ugc\">View Demo</a> | <a href=\"https://docs.upsellwp.com/\" rel=\"nofollow ugc\">Documentation with real examples</a> | <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">PRO version</a></p>\n<h3>The Free version of UpsellWP comes with the following upsell features:</h3>\n<p>The Lite version of the WooCommerce Upsell, Cross Sell and Order Bumps plugin can help you get started upsell offers at Checkout and increase the average order value.</p>\n<p>The WooCommerce Order Bump feature allows you to strategically position additional, high-value or relevant items at checkout, driving increased order values.</p>\n<p>Let’s explore the standout features the plugin brings to your WooCommerce store.</p>\n<ul>\n<li><strong>Checkout Upsells</strong> &#8211; displays upsell offers at the checkout. These are one-click upsell offers in WooCommerce.</li>\n<li><strong>Cart Upsells</strong> &#8211; displays WooCommerce Upsell offers at the cart page.</li>\n<li><strong>Frequently Bought Together</strong> &#8211; displays the related products &amp; upsell products on the product detail page just like in Amazon&#8217;s &#8220;People also bought these together&#8221;. Best for selling products in bundles.</li>\n<li><strong>Next Order Coupons</strong> &#8211; generate and display unique coupons for the next order after a customers makes a purchase.</li>\n<li><strong>One-click upsell offers</strong> &#8211; with just a single click, customers can add attractive upsell offers to their carts.</li>\n<li><strong>Conditional upsell offers</strong> &#8211; displays based on conditions like items in the cart, cart subtotal, user role and more.</li>\n<li><strong>Customizable offer templates</strong> &#8211; make each offer uniquely yours by altering headings, backgrounds, text, calls to action, and more using our ready-to-use, customizable templates.</li>\n<li><strong>Offer display locations</strong> &#8211; take control of your Upsell’s placement on the cart / checkout page.</li>\n<li><strong>Simple setup</strong> &#8211; simply install the plugin, set up your upsell offers and order bumps, and let it do the magic.</li>\n<li><strong>Product types</strong> &#8211; supports all the default product types of WooCommerce and subscription product.</li>\n<li><strong>Compatibilities</strong> &#8211; compatible with the WooCommerce Cart and Checkout blocks, WPML for multi-lingual offers, LocoTranslate, Discount Rules for WooCommerce and more.</li>\n<li><strong>Reports &amp; Analytics</strong> &#8211; gain valuable insights from your upsell campaigns performance and tweak your strategies to drive sales and revenue.</li>\n<li>Scheduled upsell campaigns</li>\n<li>Limited number of upsell campaigns</li>\n</ul>\n<p>Looking to add advanced features like One-click Post Purchase Upsell offers and more? Check out the <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">PRO version</a></p>\n<h3>The PRO version of UpsellWP comes with the following upsell features:</h3>\n<p>Turbocharge your sales with our <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">UpsellWP PRO</a>.</p>\n<p>The PRO version of the plugin comes with an array of WooCommerce upsell offer types, all designed to send your store’s average order value soaring. Get access to our smart product recommendations engine, which can help create upsell &amp; cross-sell offers automatically based on rules &amp; conditions.</p>\n<p>Choosing the PRO version means upgrading your sales game. Not only do you get all the great features of the free version, but you also gain access to a powerhouse of advanced functionalities:</p>\n<ul>\n<li><strong>Smart Product Recommendations</strong> &#8211; generate automated, smarter product recommendations for your upsell, cross-sell, frequently bought together campaigns. Build smart recommendation engines and save time. Use smart rules and conditions to generate product recommendations / upsells and display at every stage of the customer journey.</li>\n<li><strong>Post purchase upsells</strong> &#8211; displays one-click WooCommerce Post Purchase upsell offers after placing the order.</li>\n<li><strong>Added to Cart Popup / Upsell Popups</strong> &#8211; Shows upsell offers in a popup after a customer added an item to cart, when a customer clicks on the Proceed to Checkout button. Also called, Add to cart upsell product recommendations.</li>\n<li><strong>Thank you page upsell offers</strong> &#8211; displays the upsell offers at the thank you page based on the items purchased by the customer.</li>\n<li><strong>Double the order</strong> &#8211; Allows customers to double thier order quantity with one-click at the checkout page.</li>\n<li><strong>Next order coupons</strong> &#8211; In addition to generating and showing the coupon for the next order, the coupon can be included in the order confirmation email as well.</li>\n<li><strong>Product add-ons</strong> &#8211; shows upsell items as add-ons on the product page.</li>\n<li><strong>Cart add-ons</strong> &#8211; shows upsell items as add-ons on the cart page &#8211; Example: a Gift wrapper</li>\n<li><strong>Advanced conditions for campaigns</strong> &#8211; you can target &amp; personalize the upsell offers based on advanced conditions like purchase history, customers, categories and more.</li>\n<li>Offers with <strong>A/B testing</strong> for better conversions</li>\n<li>Unlimited upsell offer campaigns</li>\n</ul>\n<p><a href=\"https://demo.upsellwp.net/quick-demo?utm_source=upsell-wp-repo-view-demo&amp;utm_medium=wprepo&amp;utm_campaign=checkout-upsell-pro\" rel=\"nofollow ugc\">View Demo</a> | <a href=\"https://docs.upsellwp.com/\" rel=\"nofollow ugc\">Documentation with real examples</a> | <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">PRO version</a></p>\n<p>Unleash the power of targeted marketing with just one WooCommerce Upsell and Order Bump Plugin.</p>\n<p>With all WooCommerce Upsell features, you can strategically position tempting offers at every step of the customer journey – shop, product, cart, checkout &amp; thank you pages.</p>\n<p><strong>A WooCommerce Upsell Plugin can help you with multiple types of Upsell and Cross-sell opportunities</strong></p>\n<p>The following is a list of upsell and cross-sell opportunities, which can help skyrocket the sales and boost the average order value.</p>\n<ul>\n<li>Checkout Upsell &#8211; displayed at the checkout page</li>\n<li>Post purchase upsell &#8211; displayed after placing the order</li>\n<li>Cart Upsell &#8211; displayed at the cart page</li>\n<li>Frequently Bought Together offers &#8211; displayed at the product page</li>\n<li>Double the order &#8211; displayed at the checkout page</li>\n<li>Added to Cart Popup / Upsell Popups &#8211; can be triggered when adding an item to cart, clicking the &#8220;proceed to checkout button&#8221;, placing the order, at the thank you page</li>\n<li>Product Add-ons &#8211; displayed at the product page, right above the add to cart button</li>\n<li>Cart Add-ons &#8211; displayed at the cart page, right next to each cart item (Example: a gift wrapper option)</li>\n<li>Thank you page Upsells &#8211; displayed at the thank you page &#8211; after a customer placed the order</li>\n<li>Next Order Coupons &#8211; displayed at the thank you page and can be included in order confirmation emails.</li>\n</ul>\n<blockquote>\n<p>With our <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">PRO version</a>, you can unleash the power of upselling and cross-selling, all bundled into one versatile plugin! Say goodbye to the hassle of juggling multiple plugins – our comprehensive solution provides you with an all-in-one tool, paving the way for maximum revenue growth with minimal effort.</p>\n</blockquote>\n<p><strong>Best WooCommerce Upsell &amp; Cross Sell strategies</strong></p>\n<ol>\n<li>\n<p><strong>Checkout Upsell &#8211; Displayed at the checkout page:</strong></p>\n<p>This is an effective Upselling strategy where an upsell offer is displayed on the checkout page before the customer places an order.</p>\n<p>Store owners can show attractive and relevant upsell offers to customers on the checkout page, encourage them to quickly add more items to their cart, and increase the average order value.</p>\n<p><strong>Example,</strong></p>\n<ul>\n<li>When a customer purchases an iPhone, you can offer an iPhone cover at 30% off.</li>\n</ul>\n</li>\n<li>\n<p><strong>Post-Purchase Upsell &#8211; Displayed after the purchase but before the thank you page:</strong></p>\n<p>With this Upsell offer, you can show additional products to customers immediately after their checkout process.You can prioritize and show relevant products based on your customer behavior and encourage customers to make additional purchases in your store with just one click, it will be added instantly to the order.</p>\n<p>This is a great marketing strategy to improve customer engagement, encourage customers to make repeat purchases, and increase the store’s revenue.</p>\n<p><strong>Example,</strong></p>\n<ul>\n<li>When a customer purchases a Mobile phone, after placing the order, you can suggest a charger with a $10 Fixed discount as an upsell offer after checkout.</li>\n</ul>\n</li>\n<li>\n<p><strong>Frequently Bought Together &#8211; Displayed at the product page</strong></p>\n<p>This is another popular Upselling strategy.<br />\nThe customers are presented with products that are often purchased in combination with the item currently viewed or added to their cart. These offers work by analyzing past customer purchases and using that data to suggest complementary products.</p>\n<p>Examples of “Frequently Bought Together” offers could be:</p>\n<ul>\n<li>A laptop, a laptop case, and a wireless mouse.</li>\n<li>A novel, a bookmark, and a book light.</li>\n</ul>\n</li>\n<li>\n<p><strong>Cart Upsell &#8211; Displayed at the cart page</strong></p>\n<p>The Cart Upsells feature is a powerful tool designed to increase the average order value by recommending complementary or higher value products to customers at the crucial point of checkout.</p>\n<p>For example, if a customer is purchasing a digital camera, the plugin might suggest buying an extra memory card, a carrying case, or even a higher-end camera that includes additional features.</p>\n<p>Examples of “Cart Upsell” offers could be:</p>\n<ul>\n<li>When customer purchases a T-shirt, recommend matching accessories such as jewelry, shoes, or a handbag.</li>\n</ul>\n</li>\n<li>\n<p><strong>Double the order – Displayed at the checkout page</strong></p>\n<p>The “Double the Order” feature acts as an effective strategy to boost sales by encouraging customers to double their current order, finalize their cart and proceed to checkout, the plugin shows a banner offering them a chance to double their order  with just one click, often with a discount.</p>\n</li>\n<li>\n<p><strong>Thank you page Upsells – Displayed at the thank you page</strong></p>\n<p>Maximize your sales with our WooCommerce Upsell plugin’s “Thank You Page Upsell” feature. After a customer makes a purchase, they’re presented with a tailored offer on the ‘Thank You’ page.</p>\n<p>For instance, buy a blender and instantly get an offer for eco-friendly glass straws at a discount.</p>\n<p>You can customize the Upsell offer and show relevant products or items from categories based on the items ordered by the customer. You can also offer a percentage or a flat discount on the Upsell products.</p>\n</li>\n<li>\n<p><strong>Next Order Coupons – Displayed at the thank you page and also sent in the order confirmation emails</strong></p>\n<p>Boost your sales with our WooCommerce Next Order Coupons feature. After a purchase, generate a unique coupon code for the next purchase and display the coupon code in the Thank you page.<br />\nAlso, you can include the coupon code in the order confirmation email to drive repeat purchases.</p>\n</li>\n<li>\n<p><strong>Upsell Popups for WooCommerce – Shows Upsell offers in a popup after customers add items to cart &amp; when customers click on the proceed to checkout button</strong></p>\n<p>Boost your sales effortlessly with our WooCommerce Upsell Popup feature. The moment a customer adds an item to their cart, a popup appears not only confirming the addition but also showcasing targeted upsell product recommendations.</p>\n<p>Here are some examples:</p>\n<ul>\n<li>Add a smartphone to the cart, and a WooCommerce Upsell Popup suggests compatible phone cases or screen protectors.</li>\n<li>Buy a coffee maker, and a WooCommerce Upsell Popup recommends specialty coffee beans.</li>\n</ul>\n</li>\n<li>\n<p><strong>Added to Cart Popup for WooCommerce – Shows Upsell offers in a popup after customers add items to cart</strong></p>\n<p>The Added to Cart Popup for WooCommerce shows a success message in a popup along with upsell product recommendations. Customers can see how many items they have got in the cart and the total so far. Plus, there’s a button to view the cart if they are ready to checkout.<br />\nBut wait, there’s more! Our one-click upsell offers make it a breeze to add recommended products without having to refresh the page. And guess what? Customers will even see how much they are saving with these special deals.</p>\n</li>\n<li>\n<p><strong>Product Add-on Upsell – Displayed at the product page</strong></p>\n<p>The “Product Add-ons” feature allows woocommerce store owners to offer additional options and customizations for their products, which customers can select directly from the product page. Options can include things like gift wrapping, custom messages, special finishes, or extended warranties.</p>\n<p>Examples of “Product Add-ons” offers could be:</p>\n<ul>\n<li>Extended warranties</li>\n<li>When customer purchases a T-shirt, recommend matching accessories such as jewelry, shoes, or a handbag.</li>\n</ul>\n</li>\n<li>\n<p><strong>Cart Add-on Upsell &#8211; Displayed at the product page</strong></p>\n<p>The “Cart Add-ons” feature allows store owners to suggest additional products or services to customers at the crucial moment when they are reviewing their shopping cart before checkout.</p>\n<p>As customers view their cart, they are presented with a selection of related items or complementary products, encouraging them to make further purchases. These suggestions can be tailored based on the contents of the customer’s current cart, past purchasing behavior, or popular products in the store.</p>\n<p>Examples of “Cart Add-ons” offers could be:</p>\n<ul>\n<li>A Gift Wrap add-on</li>\n<li>Related products or accessories</li>\n</ul>\n</li>\n</ol>\n<p><a href=\"https://demo.upsellwp.net/quick-demo?utm_source=upsell-wp-repo-view-demo&amp;utm_medium=wprepo&amp;utm_campaign=checkout-upsell-pro\" rel=\"nofollow ugc\">View Demo</a> | <a href=\"https://docs.upsellwp.com/\" rel=\"nofollow ugc\">Documentation with real examples</a> | <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">PRO version</a></p>\n<h3>Smart Product Recommendations Engine</h3>\n<p>Create highly targeted, personalized product recommendations for every shopper in your store and skyrocket your sales.</p>\n<p>Let our algorithm generate the smart recommendations for you, instead of manually creating the upsells &amp; cross-sells.</p>\n<p>Make every shopper feel like your store was made just for them. Watch your sales take off when your products find their perfect match with every customer. It’s not about pushing products anymore; it’s about making smart, personalized suggestions that feel right.</p>\n<p>Forget the heavy lifting of manual upsells and cross-sells. Our algorithm’s got this. It works its magic behind the scenes, using a few straightforward rules, filters, and conditions. It looks at what your customers are buying, what they’re browsing, what’s sitting in their carts, where they’re shopping from, what’s hot right now, and even the date. Then, bam—personalized offers that hit the mark every time.</p>\n<p>And the best part? It all happens on your turf. Your data never has to leave your site. There’s no need to play it risky with third-party services. Keep it close, keep it safe.</p>\n<p>Here some of the examples:<br />\n– Recently viewed products<br />\n– Top selling products in a category<br />\n– New arrivals</p>\n<h4>Video Tutorials</h4>\n<p>Explore our <a href=\"https://www.youtube.com/@UpsellWP/videos\" rel=\"nofollow ugc\">Video Tutorials on YouTube</a> for helpful insights on our Upsell plugin.</p>\n<h4>Documentation</h4>\n<p>We have created step-by-step guides to create order bumps in WooCommerce. <a href=\"https://docs.upsellwp.com/\" rel=\"nofollow ugc\">Check out our documentation</a></p>\n<h4>Support</h4>\n<p>Experiencing any issues or have any questions? Our dedicated support team is here to help! Please reach out to us through our <a href=\"https://upsellwp.com//support\" rel=\"nofollow ugc\">support request form</a>. We are happy to help you and guide you with the setup.</p>\n<h4>Website</h4>\n<p>Visit our <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-website&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">WooCommerce Upsell, Cross Sell and Order Bumps PRO</a> page to learn more.</p>\n",
        "installation": "<ol>\n<li>Download the Upsell for WooCommerce by UpsellWP plugin.</li>\n<li>Upload the plugin files to your /wp-content/plugins/ directory, or install the plugin through the WordPress dashboard -&gt; Plugins -&gt; Add New section directly (search for UpsellWP&#8221;).</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; screen in WordPress.</li>\n<li>Navigate to your WordPress dashboard -&gt; UpsellWP</li>\n<li>Here, you can add your upsell offers and order bumps and configure your settings as per your needs.</li>\n</ol>\n<h4>Minimum Requirements</h4>\n<ul>\n<li>WordPress 5.3 or greater</li>\n<li>WooCommerce 4.3 or greater</li>\n<li>PHP version 7.0 or greater</li>\n<li>MySQL version 5.0 or greater</li>\n</ul>\n",
        "faq": "\n<dt id='how%20to%20setup%20woocommerce%20order%20bumps'>\nHow to setup WooCommerce Order Bumps\n</h4>\n<p>\n<p>Please follow the steps below to create a WooCommerce Order Bump:<br />\n1. Install and activate the Upsell for WooCommerce by UpsellWP plugin<br />\n2. Create a Checkout upsells campaign<br />\n3. Choose the offer product and configure the offer<br />\n4. Choose the offer display location<br />\n5. Save and set live.<br />\nNow your customers will see the order bump at the WooCommerce Checkout</p>\n</p>\n<dt id='how%20to%20create%20a%20woocommerce%20one-click%20upsell%20offer'>\nHow to create a WooCommerce One-click Upsell offer\n</h4>\n<p>\n<p>Please following the steps below to create a WooCommerce One-click Upsell offer:<br />\n1. Install and activate the Upsell for WooCommerce by UpsellWP plugin<br />\n2. Create a Checkout upsells campaign<br />\n3. Choose the offer product<br />\n4. Set up the conditions to display the offer<br />\n4. Choose the offer display location<br />\n5. Save and set live (You can also schedule it for specific period as well).<br />\nNow your customers will see the order bump at the WooCommerce Checkout</p>\n</p>\n<dt id='can%20i%20customize%20the%20offer%20templates%3F'>\nCan I customize the offer templates?\n</h4>\n<p>\n<p>Yes. You can customize the template, change the text, background, colors, images and more to fit your branding.</p>\n</p>\n<dt id='how%20to%20create%20an%20order%20bump%20based%20on%20the%20items%20in%20the%20cart%3F'>\nHow to create an order bump based on the items in the cart?\n</h4>\n<p>\n<p>When creating an upsell campaign, choose the &#8220;Items in the cart&#8221; condition and choose the products. Now, the order bump will show only when the selected products are found in the cart.</p>\n</p>\n<dt id='how%20to%20show%20more%20than%20one%20order%20bump%20on%20the%20checkout%20page%3F'>\nHow to show more than one order bump on the checkout page?\n</h4>\n<p>\n<p>The PRO version allows you to show more than one order bump on the checkout page.</p>\n</p>\n<dt id='how%20to%20a%2Fb%20test%20the%20order%20bump%20offers%3F'>\nHow to A/B test the order bump offers?\n</h4>\n<p>\n<p>The PRO version allows you to create multiple offers in the same campaign and choose the &#8220;A/B testing&#8221; mode to measure the performance of the offers.</p>\n</p>\n<dt id='how%20to%20change%20the%20location%20of%20the%20order%20bumps%20in%20woocommerce%3F'>\nHow to change the location of the order bumps in WooCommerce?\n</h4>\n<p>\n<p>The plugin currently supports displaying the offers in 4 different places in the checkout &#8211; Before the Place order button, after the place order button, bottom of the checkout page or before the payment methods. You can change the location in your upsell campaign settings.</p>\n</p>\n\n",
        "changelog": "<h4>2.1.2 &#8211; 27/08/2024</h4>\n<ul>\n<li>Add &#8211; Compatibility for WooCommerce 9.2</li>\n<li>Add &#8211; Cart Upsells display locations for Cart Blocks</li>\n<li>Add &#8211; Checkout Upsells display locations for Checkout Blocks</li>\n<li>Fix &#8211; Bugs</li>\n</ul>\n<h4>2.1.1 &#8211; 24/07/2024</h4>\n<ul>\n<li>Add &#8211; Compatibility for WordPress 6.6</li>\n<li>Add &#8211; Compatibility for WooCommerce 9.1</li>\n<li>Add &#8211; Compatibility for Speed Optimizer plugin by SiteGround</li>\n<li>Add &#8211; Change upsell product variant select template option in Settings</li>\n<li>Add &#8211; Choose upsell product variant by attributes template for all the campaigns</li>\n<li>Add &#8211; Cart Upsell Minimal templates (offer/cart-template-5-mini and offer/cart-template-6-mini)</li>\n<li>Add &#8211; Checkout Upsell Minimal templates (offer/template-7-mini and offer/template-8-mini)</li>\n<li>Improve &#8211; Upsell product details popup (common/product-details-popup)</li>\n<li>Improve &#8211; WooCommerce Subscriptions plugin compatibility</li>\n<li>Improve &#8211; Update some campaign templates (HTML)</li>\n<li>Fix &#8211; Bugs</li>\n</ul>\n<h4>2.1.0 &#8211; 19/06/2024</h4>\n<ul>\n<li>Add &#8211; Add-ons section with 2 add-ons</li>\n<li>Add &#8211; Compatibility for WooCommerce 9.0</li>\n<li>Improve &#8211; WooCommerce Subscriptions plugin compatibility</li>\n<li>Improve &#8211; Shoptimizer theme compatibility</li>\n<li>Fix &#8211; Bugs</li>\n</ul>\n<h4>2.0.4 &#8211; 13/06/2024</h4>\n<ul>\n<li>Add &#8211; Compatibility for WooCommerce 8.9</li>\n<li>Add &#8211; Weekly digest email type option</li>\n<li>Fix &#8211; Bugs</li>\n</ul>\n<h4>2.0.3 &#8211; 14/05/2024</h4>\n<ul>\n<li>Add &#8211; Compatibility for Shoptimizer theme</li>\n<li>Add &#8211; Checkout Upsells Always display offer option</li>\n<li>Add &#8211; Some dynamic translation stings by default</li>\n<li>Add &#8211; Tutorials (Videos &amp; Documentation) section in Campaign edit view</li>\n<li>Improve &#8211; Plugin performance by reducing save order meta method calling</li>\n<li>Improve &#8211; Backend UI (Accordion indicators, border colors)</li>\n<li>Fix &#8211; Bugs</li>\n</ul>\n<h4>2.0.2 &#8211; 24/04/2024</h4>\n<ul>\n<li>Add &#8211; Support for WooCommerce 8.8</li>\n<li>Add &#8211; New Next Order Coupon template (noc/template-3-classic)</li>\n<li>Add &#8211; Next Order Coupon message display option in template edit section</li>\n<li>Improve &#8211; Next Order Coupon validation while applying coupon</li>\n<li>Fix &#8211; Unable to save conditions or filters in some sites due to conflict</li>\n<li>Fix &#8211; Bugs</li>\n</ul>\n<h4>2.0.1 &#8211; 04/04/2024</h4>\n<ul>\n<li>Add &#8211; Support for WordPress 6.5</li>\n<li>Add &#8211; Support for WooCommerce 8.7</li>\n<li>Add &#8211; Flatsome and Woodmart theme compatibility</li>\n<li>Add &#8211; Frequently bought together added to cart redirection option</li>\n<li>Add &#8211; Frequently bought together advanced template customization section</li>\n<li>Improve &#8211; Frequently bought together and Cart upsells templates</li>\n<li>Improve &#8211; Increased maximum number of products display limit selection (up to 12) in settings</li>\n<li>Improve &#8211; Backend UI (notifications, review notice)</li>\n</ul>\n<h4>2.0.0 &#8211; 12/03/2024</h4>\n<ul>\n<li>Add &#8211; New backend UI</li>\n<li>Add &#8211; Weekly digest mail</li>\n<li>Add &#8211; Support for PHP 8.3</li>\n<li>Add &#8211; Support for WooCommerce 8.6</li>\n<li>Add &#8211; Upsell Products data tab in product create or edit page</li>\n<li>Improve &#8211; Settings (generalize some settings and remove campaign display location options)</li>\n<li>Improve &#8211; Templates (change variant image while changing variant and price display)</li>\n<li>Improve &#8211; Next Order Coupons campaign Expires after option (input days manually instead of selecting)</li>\n<li>Improve &#8211; Plugin performance and stability</li>\n<li>Remove &#8211; $cuw_app global variable (use the CUW function instead)</li>\n<li>Remove &#8211; Use global setting from the campaign display location</li>\n<li>Remove &#8211; Support for PHP 5.6</li>\n<li>Fix &#8211; Bugs</li>\n</ul>\n<h4>1.4.5 &#8211; 30/01/2024</h4>\n<ul>\n<li>Add &#8211; Compatibility for WooCommerce 8.5</li>\n<li>Add &#8211; Next Order Coupon CTA redirect URL option</li>\n<li>Add &#8211; cuw_show_upsell_item_text hook</li>\n<li>Improve &#8211; Next Order Coupons campaign create/edit section</li>\n</ul>\n<h4>1.4.4 &#8211; 21/12/2023</h4>\n<ul>\n<li>Add &#8211; Frequently Bought Together campaign</li>\n<li>Add &#8211; Compatibility for WooCommerce 8.4</li>\n<li>Improve &#8211; Avoid third-party plugin confilcts on admin page (Backend UI)</li>\n<li>Fix &#8211; Bugs</li>\n</ul>\n<h4>1.4.3 &#8211; 06/12/2023</h4>\n<ul>\n<li>Add &#8211; Compatibility for WordPress 6.4</li>\n<li>Add &#8211; Compatibility for WooCommerce 8.3</li>\n<li>Add &#8211; Next Order Coupons campaign &#8220;Usage limit per customer&#8221; option</li>\n<li>Improve &#8211; Next Order Coupons campaign coupons generation and display</li>\n<li>Improve &#8211; Allow to change offer quantity in cart when offer quantity is not fixed</li>\n<li>Fix &#8211; Bugs</li>\n</ul>\n<h4>1.4.2 &#8211; 01/11/2023</h4>\n<ul>\n<li>Add &#8211; Extra Action and Filter hooks</li>\n<li>Improve &#8211; Loading animation (show instantly when click CTA button or text)</li>\n<li>Improve &#8211; Help panel and Plugins page links</li>\n<li>Fix &#8211; Bugs</li>\n</ul>\n<h4>1.4.1 &#8211; 11/10/2023</h4>\n<ul>\n<li>Add &#8211; Compatibility for CURCY – Multi Currency for WooCommerce by VillaTheme</li>\n<li>Add &#8211; Compatibility for Currency Switcher for WooCommerce by WP Wham</li>\n<li>Add &#8211; Compatibility for WooCommerce Multilingual &amp; Multicurrency with WPML by OnTheGoSystems</li>\n<li>Add &#8211; Compatibility for WooCommerce 8.2</li>\n<li>Add &#8211; Review notice (appears after 60 days of use)</li>\n<li>Add &#8211; New Next Order Coupons campaign template (noc/template-2)</li>\n<li>Add &#8211; New Checkout Upsells campaign display locations (Before Billing section and After Order notes)</li>\n<li>Add &#8211; Product details popup (shows when click offer product title or image)</li>\n<li>Add &#8211; Show product details option in Settings</li>\n<li>Add &#8211; Dynamic offer display option in Settings</li>\n<li>Add &#8211; Exclude offers from coupon discounts option in Settings</li>\n<li>Add &#8211; Offer added notice position option in Settings</li>\n<li>Add &#8211; Offer added notice message option in Settings</li>\n<li>Improve &#8211; Applied Coupons in the Cart condition (add Any Coupon and No Coupons methods)</li>\n<li>Remove &#8211; Enable permalink on product title and image option from Settings (use Show product details option instead)</li>\n<li>Fix &#8211; Bugs</li>\n</ul>\n<h4>1.4.0 &#8211; 27/09/2023</h4>\n<ul>\n<li>Add &#8211; Dashboard and Help tabs</li>\n<li>Add &#8211; Compatibility for WooCommerce 8.1</li>\n<li>Add &#8211; Compatibility for FOX &#8211; Currency Switcher (formally WOOCS) plugin</li>\n<li>Rename &#8211; pre_purchase to checkout_upsells internally (in database and files)</li>\n<li>Improve &#8211; Backend UI (Right-to-Left and Mobile view)</li>\n<li>Improve &#8211; Frontend templates (Right-to-Left and Mobile view) and its customization</li>\n<li>Improve &#8211; Discount Rules for WooCommerce plugin compatibility</li>\n<li>Improve &#8211; Compatibility and Reports sections</li>\n<li>Improve &#8211; Plugin stability and performance</li>\n<li>Fix &#8211; Bugs</li>\n</ul>\n<h4>1.3.1 &#8211; 05/09/2023</h4>\n<ul>\n<li>Add &#8211; Campaign filters on campaign create section</li>\n<li>Add &#8211; coupon_id, coupon_code and revenue_with_tax columns in stats table</li>\n<li>Improve &#8211; Show a confirmation modal when deleting multiple campaigns</li>\n<li>Fix &#8211; Offer texts are not saved when text contains double quotes (&#8220;)</li>\n<li>Fix &#8211; Offer description line spacing is not reflected correctly</li>\n</ul>\n<h4>1.3.0 &#8211; 24/08/2023</h4>\n<ul>\n<li>Add &#8211; Next Order Coupons campaign</li>\n<li>Add &#8211; WPML language condition</li>\n<li>Add &#8211; Upsell revenue column on Woocommerce Orders page</li>\n<li>Add &#8211; Compatibility for WooCommerce 8.0</li>\n<li>Improve &#8211; Cart upsell template styles</li>\n</ul>\n<h4>1.2.1 &#8211; 09/08/2023</h4>\n<ul>\n<li>Add &#8211; Compatibility for WordPress 6.3</li>\n<li>Fix &#8211; Offer title permalink is not working when enabled permalink option in settings</li>\n</ul>\n<h4>1.2.0 &#8211; 02/08/2023</h4>\n<ul>\n<li>Add &#8211; Cart Upsells campaign</li>\n<li>Add &#8211; User Logged In condition</li>\n<li>Rename &#8211; Pre-purchase campaign to Checkout Upsells campaign</li>\n<li>Deprecate &#8211; [cuw_offers] shortcode, Use [cuw_checkout_upsells] shortcode instread</li>\n<li>Improve &#8211; Settings section</li>\n<li>Improve &#8211; Translation</li>\n</ul>\n<h4>1.1.2 &#8211; 26/07/2023</h4>\n<ul>\n<li>Fix &#8211; Displaying an offer price is not based on the WooCommerce tax settings</li>\n</ul>\n<h4>1.1.1 &#8211; 21/07/2023</h4>\n<ul>\n<li>Fix &#8211; Fatal error in PHP 8 while updating page with [cuw_offers] shortcode</li>\n</ul>\n<h4>1.1.0 &#8211; 06/07/2023</h4>\n<ul>\n<li>Add &#8211; Pre-purchase offer display mode option</li>\n<li>Add &#8211; Pre-purchase smart offer display option</li>\n<li>Improvement &#8211; Campaign create section UI</li>\n<li>Improvement &#8211; Database schema and migration</li>\n<li>Fix &#8211; Some language offer texts are displayed as Unicode characters</li>\n</ul>\n<h4>1.0.1 &#8211; 31/05/2023</h4>\n<ul>\n<li>Fix &#8211; JS error while clicking the offer CTA text or button</li>\n</ul>\n<h4>1.0.0 &#8211; 18/05/2023</h4>\n<ul>\n<li>Initial release</li>\n</ul>\n"
    },
    "short_description": "Boost AOV with WooCommerce Upsell and Cross-sell offers, Checkout Upsells, Cart Upsells, Next Order Coupons, Product Recommendations and more.",
    "description": "<p>Boost your WooCommerce store&#8217;s sales with our All-in-One <strong>#1 WooCommerce Upsell Plugin</strong>. It lets you create one-click upsell offers in the store, helping you to increase the Average Order Value and boost sales easily.</p>\n<p><a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">The WooCommerce Upsell plugin</a> facilitates store owners to make special offers exclusively on their checkout page, enabling them to increase their conversions and Average Order Value. The offer gets added to the customer’s existing order in just a single click.<br />\nShow your customers an exclusive offer deal at an unbelievable price at the very moment that they are checking out.</p>\n<p>Relevant offers can be set for specific targets with WooCommerce Order Bump Plugin which ensures customer satisfaction and thus result in improved sales improvements.</p>\n<p><strong>Watch a Video on best ways to upsell in WooCommerce</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"754\" height=\"424\" src=\"https://www.youtube.com/embed/JUCFEhmrHSY?version=3&#038;rel=0&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><a href=\"https://demo.upsellwp.net/quick-demo?utm_source=upsell-wp-repo-view-demo&amp;utm_medium=wprepo&amp;utm_campaign=checkout-upsell-pro\" rel=\"nofollow ugc\">View Demo</a> | <a href=\"https://docs.upsellwp.com/\" rel=\"nofollow ugc\">Documentation with real examples</a> | <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">PRO version</a></p>\n<h3>The Free version of UpsellWP comes with the following upsell features:</h3>\n<p>The Lite version of the WooCommerce Upsell, Cross Sell and Order Bumps plugin can help you get started upsell offers at Checkout and increase the average order value.</p>\n<p>The WooCommerce Order Bump feature allows you to strategically position additional, high-value or relevant items at checkout, driving increased order values.</p>\n<p>Let’s explore the standout features the plugin brings to your WooCommerce store.</p>\n<ul>\n<li><strong>Checkout Upsells</strong> &#8211; displays upsell offers at the checkout. These are one-click upsell offers in WooCommerce.</li>\n<li><strong>Cart Upsells</strong> &#8211; displays WooCommerce Upsell offers at the cart page.</li>\n<li><strong>Frequently Bought Together</strong> &#8211; displays the related products &amp; upsell products on the product detail page just like in Amazon&#8217;s &#8220;People also bought these together&#8221;. Best for selling products in bundles.</li>\n<li><strong>Next Order Coupons</strong> &#8211; generate and display unique coupons for the next order after a customers makes a purchase.</li>\n<li><strong>One-click upsell offers</strong> &#8211; with just a single click, customers can add attractive upsell offers to their carts.</li>\n<li><strong>Conditional upsell offers</strong> &#8211; displays based on conditions like items in the cart, cart subtotal, user role and more.</li>\n<li><strong>Customizable offer templates</strong> &#8211; make each offer uniquely yours by altering headings, backgrounds, text, calls to action, and more using our ready-to-use, customizable templates.</li>\n<li><strong>Offer display locations</strong> &#8211; take control of your Upsell’s placement on the cart / checkout page.</li>\n<li><strong>Simple setup</strong> &#8211; simply install the plugin, set up your upsell offers and order bumps, and let it do the magic.</li>\n<li><strong>Product types</strong> &#8211; supports all the default product types of WooCommerce and subscription product.</li>\n<li><strong>Compatibilities</strong> &#8211; compatible with the WooCommerce Cart and Checkout blocks, WPML for multi-lingual offers, LocoTranslate, Discount Rules for WooCommerce and more.</li>\n<li><strong>Reports &amp; Analytics</strong> &#8211; gain valuable insights from your upsell campaigns performance and tweak your strategies to drive sales and revenue.</li>\n<li>Scheduled upsell campaigns</li>\n<li>Limited number of upsell campaigns</li>\n</ul>\n<p>Looking to add advanced features like One-click Post Purchase Upsell offers and more? Check out the <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">PRO version</a></p>\n<h3>The PRO version of UpsellWP comes with the following upsell features:</h3>\n<p>Turbocharge your sales with our <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">UpsellWP PRO</a>.</p>\n<p>The PRO version of the plugin comes with an array of WooCommerce upsell offer types, all designed to send your store’s average order value soaring. Get access to our smart product recommendations engine, which can help create upsell &amp; cross-sell offers automatically based on rules &amp; conditions.</p>\n<p>Choosing the PRO version means upgrading your sales game. Not only do you get all the great features of the free version, but you also gain access to a powerhouse of advanced functionalities:</p>\n<ul>\n<li><strong>Smart Product Recommendations</strong> &#8211; generate automated, smarter product recommendations for your upsell, cross-sell, frequently bought together campaigns. Build smart recommendation engines and save time. Use smart rules and conditions to generate product recommendations / upsells and display at every stage of the customer journey.</li>\n<li><strong>Post purchase upsells</strong> &#8211; displays one-click WooCommerce Post Purchase upsell offers after placing the order.</li>\n<li><strong>Added to Cart Popup / Upsell Popups</strong> &#8211; Shows upsell offers in a popup after a customer added an item to cart, when a customer clicks on the Proceed to Checkout button. Also called, Add to cart upsell product recommendations.</li>\n<li><strong>Thank you page upsell offers</strong> &#8211; displays the upsell offers at the thank you page based on the items purchased by the customer.</li>\n<li><strong>Double the order</strong> &#8211; Allows customers to double thier order quantity with one-click at the checkout page.</li>\n<li><strong>Next order coupons</strong> &#8211; In addition to generating and showing the coupon for the next order, the coupon can be included in the order confirmation email as well.</li>\n<li><strong>Product add-ons</strong> &#8211; shows upsell items as add-ons on the product page.</li>\n<li><strong>Cart add-ons</strong> &#8211; shows upsell items as add-ons on the cart page &#8211; Example: a Gift wrapper</li>\n<li><strong>Advanced conditions for campaigns</strong> &#8211; you can target &amp; personalize the upsell offers based on advanced conditions like purchase history, customers, categories and more.</li>\n<li>Offers with <strong>A/B testing</strong> for better conversions</li>\n<li>Unlimited upsell offer campaigns</li>\n</ul>\n<p><a href=\"https://demo.upsellwp.net/quick-demo?utm_source=upsell-wp-repo-view-demo&amp;utm_medium=wprepo&amp;utm_campaign=checkout-upsell-pro\" rel=\"nofollow ugc\">View Demo</a> | <a href=\"https://docs.upsellwp.com/\" rel=\"nofollow ugc\">Documentation with real examples</a> | <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">PRO version</a></p>\n<p>Unleash the power of targeted marketing with just one WooCommerce Upsell and Order Bump Plugin.</p>\n<p>With all WooCommerce Upsell features, you can strategically position tempting offers at every step of the customer journey – shop, product, cart, checkout &amp; thank you pages.</p>\n<p><strong>A WooCommerce Upsell Plugin can help you with multiple types of Upsell and Cross-sell opportunities</strong></p>\n<p>The following is a list of upsell and cross-sell opportunities, which can help skyrocket the sales and boost the average order value.</p>\n<ul>\n<li>Checkout Upsell &#8211; displayed at the checkout page</li>\n<li>Post purchase upsell &#8211; displayed after placing the order</li>\n<li>Cart Upsell &#8211; displayed at the cart page</li>\n<li>Frequently Bought Together offers &#8211; displayed at the product page</li>\n<li>Double the order &#8211; displayed at the checkout page</li>\n<li>Added to Cart Popup / Upsell Popups &#8211; can be triggered when adding an item to cart, clicking the &#8220;proceed to checkout button&#8221;, placing the order, at the thank you page</li>\n<li>Product Add-ons &#8211; displayed at the product page, right above the add to cart button</li>\n<li>Cart Add-ons &#8211; displayed at the cart page, right next to each cart item (Example: a gift wrapper option)</li>\n<li>Thank you page Upsells &#8211; displayed at the thank you page &#8211; after a customer placed the order</li>\n<li>Next Order Coupons &#8211; displayed at the thank you page and can be included in order confirmation emails.</li>\n</ul>\n<blockquote>\n<p>With our <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">PRO version</a>, you can unleash the power of upselling and cross-selling, all bundled into one versatile plugin! Say goodbye to the hassle of juggling multiple plugins – our comprehensive solution provides you with an all-in-one tool, paving the way for maximum revenue growth with minimal effort.</p>\n</blockquote>\n<p><strong>Best WooCommerce Upsell &amp; Cross Sell strategies</strong></p>\n<ol>\n<li>\n<p><strong>Checkout Upsell &#8211; Displayed at the checkout page:</strong></p>\n<p>This is an effective Upselling strategy where an upsell offer is displayed on the checkout page before the customer places an order.</p>\n<p>Store owners can show attractive and relevant upsell offers to customers on the checkout page, encourage them to quickly add more items to their cart, and increase the average order value.</p>\n<p><strong>Example,</strong></p>\n<ul>\n<li>When a customer purchases an iPhone, you can offer an iPhone cover at 30% off.</li>\n</ul>\n</li>\n<li>\n<p><strong>Post-Purchase Upsell &#8211; Displayed after the purchase but before the thank you page:</strong></p>\n<p>With this Upsell offer, you can show additional products to customers immediately after their checkout process.You can prioritize and show relevant products based on your customer behavior and encourage customers to make additional purchases in your store with just one click, it will be added instantly to the order.</p>\n<p>This is a great marketing strategy to improve customer engagement, encourage customers to make repeat purchases, and increase the store’s revenue.</p>\n<p><strong>Example,</strong></p>\n<ul>\n<li>When a customer purchases a Mobile phone, after placing the order, you can suggest a charger with a $10 Fixed discount as an upsell offer after checkout.</li>\n</ul>\n</li>\n<li>\n<p><strong>Frequently Bought Together &#8211; Displayed at the product page</strong></p>\n<p>This is another popular Upselling strategy.<br />\nThe customers are presented with products that are often purchased in combination with the item currently viewed or added to their cart. These offers work by analyzing past customer purchases and using that data to suggest complementary products.</p>\n<p>Examples of “Frequently Bought Together” offers could be:</p>\n<ul>\n<li>A laptop, a laptop case, and a wireless mouse.</li>\n<li>A novel, a bookmark, and a book light.</li>\n</ul>\n</li>\n<li>\n<p><strong>Cart Upsell &#8211; Displayed at the cart page</strong></p>\n<p>The Cart Upsells feature is a powerful tool designed to increase the average order value by recommending complementary or higher value products to customers at the crucial point of checkout.</p>\n<p>For example, if a customer is purchasing a digital camera, the plugin might suggest buying an extra memory card, a carrying case, or even a higher-end camera that includes additional features.</p>\n<p>Examples of “Cart Upsell” offers could be:</p>\n<ul>\n<li>When customer purchases a T-shirt, recommend matching accessories such as jewelry, shoes, or a handbag.</li>\n</ul>\n</li>\n<li>\n<p><strong>Double the order – Displayed at the checkout page</strong></p>\n<p>The “Double the Order” feature acts as an effective strategy to boost sales by encouraging customers to double their current order, finalize their cart and proceed to checkout, the plugin shows a banner offering them a chance to double their order  with just one click, often with a discount.</p>\n</li>\n<li>\n<p><strong>Thank you page Upsells – Displayed at the thank you page</strong></p>\n<p>Maximize your sales with our WooCommerce Upsell plugin’s “Thank You Page Upsell” feature. After a customer makes a purchase, they’re presented with a tailored offer on the ‘Thank You’ page.</p>\n<p>For instance, buy a blender and instantly get an offer for eco-friendly glass straws at a discount.</p>\n<p>You can customize the Upsell offer and show relevant products or items from categories based on the items ordered by the customer. You can also offer a percentage or a flat discount on the Upsell products.</p>\n</li>\n<li>\n<p><strong>Next Order Coupons – Displayed at the thank you page and also sent in the order confirmation emails</strong></p>\n<p>Boost your sales with our WooCommerce Next Order Coupons feature. After a purchase, generate a unique coupon code for the next purchase and display the coupon code in the Thank you page.<br />\nAlso, you can include the coupon code in the order confirmation email to drive repeat purchases.</p>\n</li>\n<li>\n<p><strong>Upsell Popups for WooCommerce – Shows Upsell offers in a popup after customers add items to cart &amp; when customers click on the proceed to checkout button</strong></p>\n<p>Boost your sales effortlessly with our WooCommerce Upsell Popup feature. The moment a customer adds an item to their cart, a popup appears not only confirming the addition but also showcasing targeted upsell product recommendations.</p>\n<p>Here are some examples:</p>\n<ul>\n<li>Add a smartphone to the cart, and a WooCommerce Upsell Popup suggests compatible phone cases or screen protectors.</li>\n<li>Buy a coffee maker, and a WooCommerce Upsell Popup recommends specialty coffee beans.</li>\n</ul>\n</li>\n<li>\n<p><strong>Added to Cart Popup for WooCommerce – Shows Upsell offers in a popup after customers add items to cart</strong></p>\n<p>The Added to Cart Popup for WooCommerce shows a success message in a popup along with upsell product recommendations. Customers can see how many items they have got in the cart and the total so far. Plus, there’s a button to view the cart if they are ready to checkout.<br />\nBut wait, there’s more! Our one-click upsell offers make it a breeze to add recommended products without having to refresh the page. And guess what? Customers will even see how much they are saving with these special deals.</p>\n</li>\n<li>\n<p><strong>Product Add-on Upsell – Displayed at the product page</strong></p>\n<p>The “Product Add-ons” feature allows woocommerce store owners to offer additional options and customizations for their products, which customers can select directly from the product page. Options can include things like gift wrapping, custom messages, special finishes, or extended warranties.</p>\n<p>Examples of “Product Add-ons” offers could be:</p>\n<ul>\n<li>Extended warranties</li>\n<li>When customer purchases a T-shirt, recommend matching accessories such as jewelry, shoes, or a handbag.</li>\n</ul>\n</li>\n<li>\n<p><strong>Cart Add-on Upsell &#8211; Displayed at the product page</strong></p>\n<p>The “Cart Add-ons” feature allows store owners to suggest additional products or services to customers at the crucial moment when they are reviewing their shopping cart before checkout.</p>\n<p>As customers view their cart, they are presented with a selection of related items or complementary products, encouraging them to make further purchases. These suggestions can be tailored based on the contents of the customer’s current cart, past purchasing behavior, or popular products in the store.</p>\n<p>Examples of “Cart Add-ons” offers could be:</p>\n<ul>\n<li>A Gift Wrap add-on</li>\n<li>Related products or accessories</li>\n</ul>\n</li>\n</ol>\n<p><a href=\"https://demo.upsellwp.net/quick-demo?utm_source=upsell-wp-repo-view-demo&amp;utm_medium=wprepo&amp;utm_campaign=checkout-upsell-pro\" rel=\"nofollow ugc\">View Demo</a> | <a href=\"https://docs.upsellwp.com/\" rel=\"nofollow ugc\">Documentation with real examples</a> | <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-pro-version&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">PRO version</a></p>\n<h3>Smart Product Recommendations Engine</h3>\n<p>Create highly targeted, personalized product recommendations for every shopper in your store and skyrocket your sales.</p>\n<p>Let our algorithm generate the smart recommendations for you, instead of manually creating the upsells &amp; cross-sells.</p>\n<p>Make every shopper feel like your store was made just for them. Watch your sales take off when your products find their perfect match with every customer. It’s not about pushing products anymore; it’s about making smart, personalized suggestions that feel right.</p>\n<p>Forget the heavy lifting of manual upsells and cross-sells. Our algorithm’s got this. It works its magic behind the scenes, using a few straightforward rules, filters, and conditions. It looks at what your customers are buying, what they’re browsing, what’s sitting in their carts, where they’re shopping from, what’s hot right now, and even the date. Then, bam—personalized offers that hit the mark every time.</p>\n<p>And the best part? It all happens on your turf. Your data never has to leave your site. There’s no need to play it risky with third-party services. Keep it close, keep it safe.</p>\n<p>Here some of the examples:<br />\n– Recently viewed products<br />\n– Top selling products in a category<br />\n– New arrivals</p>\n<h4>Video Tutorials</h4>\n<p>Explore our <a href=\"https://www.youtube.com/@UpsellWP/videos\" rel=\"nofollow ugc\">Video Tutorials on YouTube</a> for helpful insights on our Upsell plugin.</p>\n<h4>Documentation</h4>\n<p>We have created step-by-step guides to create order bumps in WooCommerce. <a href=\"https://docs.upsellwp.com/\" rel=\"nofollow ugc\">Check out our documentation</a></p>\n<h4>Support</h4>\n<p>Experiencing any issues or have any questions? Our dedicated support team is here to help! Please reach out to us through our <a href=\"https://upsellwp.com//support\" rel=\"nofollow ugc\">support request form</a>. We are happy to help you and guide you with the setup.</p>\n<h4>Website</h4>\n<p>Visit our <a href=\"https://upsellwp.com/?utm_source=upsell-wp-repo-website&amp;utm_medium=wprepo&amp;utm_campaign=upsell-pro\" rel=\"nofollow ugc\">WooCommerce Upsell, Cross Sell and Order Bumps PRO</a> page to learn more.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.2.1.2.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/checkout-upsell-and-order-bumps/assets/screenshot-1.png?rev=3049702",
            "caption": "Frequently Bought Together on the Product page"
        },
        {
            "src": "https://ps.w.org/checkout-upsell-and-order-bumps/assets/screenshot-2.png?rev=3049702",
            "caption": "Cart Upsells on the Cart page"
        },
        {
            "src": "https://ps.w.org/checkout-upsell-and-order-bumps/assets/screenshot-3.png?rev=3049702",
            "caption": "Checkout Upsells on the Checkout page"
        },
        {
            "src": "https://ps.w.org/checkout-upsell-and-order-bumps/assets/screenshot-4.png?rev=3049702",
            "caption": "Next Order Coupon on the Thank you page"
        },
        {
            "src": "https://ps.w.org/checkout-upsell-and-order-bumps/assets/screenshot-5.png?rev=3049702",
            "caption": "Dashboard page"
        },
        {
            "src": "https://ps.w.org/checkout-upsell-and-order-bumps/assets/screenshot-6.png?rev=3049702",
            "caption": "Campaigns page"
        },
        {
            "src": "https://ps.w.org/checkout-upsell-and-order-bumps/assets/screenshot-7.png?rev=3049702",
            "caption": "Campaign edit page"
        },
        {
            "src": "https://ps.w.org/checkout-upsell-and-order-bumps/assets/screenshot-8.png?rev=3049702",
            "caption": "Campaign offer edit page"
        }
    ],
    "tags": {
        "boost-sales": "boost sales",
        "order-bump": "order bump",
        "upsell": "upsell",
        "woocommerce": "woocommerce",
        "woocommerce-upsell": "woocommerce upsell"
    },
    "stable_tag": "2.1.2",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.0.1.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.1.2.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.2.1.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.3.1.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.4.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.1.4.5.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.2.0.4.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.2.1.2.zip",
        "trunk": "https://downloads.wordpress.org/plugin/checkout-upsell-and-order-bumps.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://upsellwp.com",
    "banners": {
        "low": "https://ps.w.org/checkout-upsell-and-order-bumps/assets/banner-772x250.gif?rev=3049702",
        "high": "https://ps.w.org/checkout-upsell-and-order-bumps/assets/banner-1544x500.gif?rev=3049702"
    },
    "icons": {
        "1x": "https://ps.w.org/checkout-upsell-and-order-bumps/assets/icon.svg?rev=3049702",
        "svg": "https://ps.w.org/checkout-upsell-and-order-bumps/assets/icon.svg?rev=3049702"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 96,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}