{
    "name": "Child Theme Configurator",
    "slug": "child-theme-configurator",
    "version": "2.6.6",
    "author": "<a href=\"http://www.lilaeamedia.com\">Lilaea Media</a>",
    "author_profile": "https://profiles.wordpress.org/lilaeamedia/",
    "contributors": {
        "lilaeamedia": {
            "profile": "https://profiles.wordpress.org/lilaeamedia/",
            "avatar": "https://secure.gravatar.com/avatar/1f3b20f610bb982470a93af0f0306fa9?s=96&d=monsterid&r=g",
            "display_name": "lilaeamedia"
        }
    },
    "requires": "4.0",
    "tested": false,
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 94,
    "ratings": {
        "5": 246,
        "4": 9,
        "3": 2,
        "2": 2,
        "1": 17
    },
    "num_ratings": 276,
    "support_url": "https://wordpress.org/support/plugin/child-theme-configurator/",
    "support_threads": 3,
    "support_threads_resolved": 0,
    "active_installs": 300000,
    "downloaded": 6385806,
    "last_updated": "2024-03-23 4:56pm GMT",
    "added": "2013-11-29",
    "homepage": "http://www.childthemeplugin.com",
    "sections": {
        "description": "<p>Child Theme Configurator is a fast and easy to use utility that allows you to analyze any theme for common problems, create a child theme and customize it beyond the options of the Customizer. Designed for WordPress users who want to be able to customize child theme stylesheets directly, Child Theme Configurator lets you easily identify and override the exact CSS attributes you want to customize. The Analyzer scans the rendered theme and automatically configures your child theme. It correctly enqueues theme and font stylesheets for optimum performance and handles vendor-specific syntax, giving you unlimited control over the Child Theme look and feel while leaving your Parent Theme untouched. <a href=\"http://www.childthemeplugin.com\" rel=\"nofollow ugc\">Learn more about how to create a child theme</a>.</p>\n<h4>Take Control of Your Child Themes</h4>\n<p>Child Theme Configurator parses and indexes your stylesheets so that every CSS media query, selector, property and value are at your fingertips. Second, it shows you how each customization you make will look before you commit it to the child theme. Finally, it saves your work so that you can customize styles in your child themes without the risk of losing your edits.</p>\n<p>You can create any number of child themes from your existing Parent Themes. Child Theme Configurator lets you choose from your installed themes (even existing child themes) and save the results in your Themes directory.</p>\n<p>When you are ready, just activate the Child Theme and your WordPress site takes on the custom styles automatically.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/xL0YmieF6d0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h4>Why create child themes and customize styles using Child Theme Configurator?</h4>\n<ol>\n<li>\n<p>Some things cannot be changed using the Customizer.</p>\n</li>\n<li>\n<p>Unless you use a child theme, you will lose any changes you made to templates and stylesheets when you update.</p>\n</li>\n<li>\n<p>Child Theme Configurator automatically determines the correct way to set up a child theme based on the theme you are using.</p>\n</li>\n<li>\n<p>You can find the exact style selectors your theme uses and change properties quickly.</p>\n</li>\n<li>\n<p>You can locate, copy and edit theme templates from the admin.</p>\n</li>\n<li>\n<p>Much more:</p>\n<ul>\n<li>Update themes without losing customizations</li>\n<li>Smart Theme Analyzer determines correct settings to use</li>\n<li>Resolve common child theme issues with almost any parent theme</li>\n<li>Copy existing widgets, menus and Customizer options to child theme</li>\n<li>Use web fonts in your child theme</li>\n<li>Enqueue (link) stylesheets instead of using @import</li>\n<li>Quickly locate and edit theme CSS.</li>\n<li>Customize @media queries for responsive design</li>\n<li>Select hex, RGBA (transparent) and named colors using Spectrum color picker</li>\n<li>Add fallback styles (multiple values per property)</li>\n<li>Save hours of development time</li>\n<li>Multisite compatible</li>\n<li>Make modifications unavailable to the Customizer</li>\n<li>Export child themes as Zip Archive</li>\n<li>Identify and override exact selectors from the parent theme</li>\n<li>Change specific colors, backgrounds, font styles, etc., without changing other elements</li>\n<li>Automatically generate cross-browser and vendor-prefixed properties and CSS gradients</li>\n<li>Preview custom styles before committing to them</li>\n<li>Uses WP Filesystem API – will not create files you cannot remove</li>\n</ul>\n</li>\n</ol>\n<h4>Child Theme Configurator PRO</h4>\n<p>Apply the CSS customizing power of Child Theme Configurator to any WordPress Plugin installed on your website. Child Theme Configurator PRO scans your plugins and lets you customize their stylesheets. We’ve added more features to make customizing styles quicker and easier with PRO.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/fktwCk43a8c?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Learn more at http://www.childthemeplugin.com/child-theme-configurator-pro</p>\n<h4>Unlimited Widget Content With a Single Plugin</h4>\n<p>IntelliWidget is a versatile widget manager that does the work of multiple plugins by combining custom page menus, featured posts, sliders and other dynamic content features that can display on a per-page or site-wide basis.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Ttw1xIZ2b-g?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Learn more at https://www.lilaeamedia.com/plugins/intelliwidget</p>\n<h4>Hook Highlighter</h4>\n<p>Hook Highlighter provides Administrators insight into the internal program flow of WordPress when activated on any front-facing page of a website.</p>\n<p>Display action and filter hooks, program files and backtrace information inline for the current page.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/fyeroaJK_xw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Learn more at https://www.lilaeamedia.com/product/hook-highlighter</p>\n<h3>Query/Selector Tab</h3>\n<p>There are two ways to identify and customize baseline (parent) styles. Child Theme Configurator lets you search styles by CSS selector and by property. If you wish to customize a specific CSS selector (e.g., h1), use the &#8220;Query/Selector&#8221; tab. If you have a specific CSS value you wish to customize site-wide (e.g., the color of the type), use the &#8220;Property/Value&#8221; tab.</p>\n<p>The Query/Selector tab lets you find specific CSS selectors and edit them. First, find the query that contains the CSS selector you wish to edit by typing in the Query autoselect box. Select by clicking with the mouse or by pressing the &#8220;Enter&#8221; or &#8220;Tab&#8221; keys. CSS selectors are in the base query by default.<br />\nNext, find the CSS selector by typing in the &#8220;Selector&#8221; autoselect box. Select by clicking with the mouse or by pressing the &#8220;Enter&#8221; or &#8220;Tab&#8221; keys.</p>\n<p>This will load all of the properties for that CSS selector with the Original values on the left and the child theme values inputs on the right. Any existing child theme values will be automatically populated. There is also a Sample preview that displays the combination of Parent and Child overrides. Note that the border and background-image get special treatment.</p>\n<p>The &#8220;Order&#8221; field contains the original sequence of the CSS selector in the parent theme stylesheet. You can change the CSS selector order sequence by entering a lower or higher number in the &#8220;Order&#8221; field. You can also force style overrides (so called &#8220;!important&#8221; flag) by checking the &#8220;!&#8221; box next to each input. Please use judiciously.</p>\n<p>Click &#8220;Save&#8221; to update the child theme stylesheet and save your changes to the WordPress admin.</p>\n<h3>Adding Raw CSS</h3>\n<p>If you wish to add additional properties to a given CSS selector, first load the selector using the Query/Selector tab. Then find the property you wish to override by typing in the New Property autoselect box. Select by clicking with the mouse or by pressing the &#8220;Enter&#8221; or &#8220;Tab&#8221; keys. This will add a new input row to the selector inputs.</p>\n<p>If you wish to add completely new CSS selectors, or even new @media queries, you can enter free-form CSS in the &#8220;Raw CSS&#8221; textarea. Be aware that your syntax must be correct (i.e., balanced curly braces, etc.) for the parser to load the new custom styles. You will know it is invalid because a red &#8220;X&#8221; will appear next to the save button.</p>\n<p>If you prefer to use shorthand syntax for properties and values instead of the inputs provided by Child Theme Configurator, you can enter them here as well. The parser will convert your input into normalized CSS code automatically.</p>\n<h3>Property/Value Tab</h3>\n<p>The Property/Value tab lets you find specific values for a given property and then edit that value for individual CSS selectors that use that property/value combination. First, find the property you wish to override by typing in the Property autoselect box. Select by clicking with the mouse or by pressing the &#8220;Enter&#8221; or &#8220;Tab&#8221; keys.</p>\n<p>This will load all of the unique values that exist for that property in the parent theme stylesheet with a Sample preview for that value. If there are values that exist in the child theme stylesheet that do not exist in the parent stylesheet, they will be displayed as well.</p>\n<p>For each unique value, click the &#8220;Selectors&#8221; link to view a list of CSS selectors that use that property/value combination, grouped by query with a Sample preview of the value and inputs for the child theme value. Any existing child theme values will be automatically populated.</p>\n<p>Click &#8220;Save&#8221; to update the child theme stylesheet and save your changes to the WordPress admin.</p>\n<p>If you want to edit all of the properties for the CSS selector you can click the “Edit” link and the CSS selector will automatically load in the Query/Selector Tab.</p>\n<h3>Web Fonts Tab</h3>\n<p>You can add additional stylesheets and web fonts by typing @import rules into the textarea on the Web Fonts tab. <strong>Important: do not import the parent theme stylesheet here.</strong> Use the &#8220;Parent stylesheet handling&#8221; option from the Parent/Child tab.</p>\n<h3>Files Tab</h3>\n<h4>Parent Templates</h4>\n<p>You can copy PHP template files from the parent theme by checking the boxes. Click &#8220;Copy Selected to Child Theme&#8221; and the templates will be added to the child theme&#8217;s directory.</p>\n<p>CAUTION: If your child theme is active, the child theme&#8217;s version of the file will be used instead of the parent immediately after it is copied. The functions.php file is generated separately and cannot be copied here.</p>\n<h4>Child Theme Files</h4>\n<p>Templates copied from the parent are listed here. These can be edited using the Theme Editor in the Appearance Menu. Remove child theme images by checking the boxes and clicking &#8220;Delete Selected.&#8221;</p>\n<h4>Child Theme Images</h4>\n<p>Theme images reside under the <code>images</code> directory in your child theme and are meant for stylesheet use only. Use the media gallery for content images. You can upload new images using the image upload form.</p>\n<h4>Child Theme Screenshot</h4>\n<p>You can upload a custom screenshot for the child theme here. The theme screenshot should be a 4:3 ratio (eg., 880px x 660px) JPG, PNG or GIF. It will be renamed &#8220;screenshot&#8221;.</p>\n<h4>Export Child Theme as Zip Archive</h4>\n<p>You can download your child theme for use on another WordPress site by clicking &#8220;Export&#8221;.</p>\n<h3>Preview and Activate</h3>\n<p><strong>IMPORTANT: Test child themes before activating!</strong></p>\n<p>Some themes (particularly commercial themes) do not correctly load parent template files or automatically load child theme stylesheets or php files.</p>\n<p><strong>In the worst cases they will break your website when you activate the child theme.</strong></p>\n<ol>\n<li>Navigate to Appearance &gt; Themes in the WordPress Admin. You will now see the new Child Theme as one of the installed Themes.</li>\n<li>Click &#8220;Live Preview&#8221; (theme customizer) below the new Child Theme to see it in action.</li>\n<li>When you are ready to take the Child Theme live, click &#8220;Activate.&#8221;</li>\n</ol>\n<p><strong>MULTISITE USERS:</strong> You must Network Enable your child theme before you can use Live Preview. Go to &#8220;Themes&#8221; in the Network Admin.</p>\n<h3>Caveats</h3>\n<ul>\n<li>Arbitrary comments are not supported. Providing a high level of flexibility for previewing and modifying custom styles requires a sophisticated parsing system. Maintaining comments that are bound to any particular element in the stylesheet is prohibitively expensive compared to the value it would add. Although we are working to include this as an option in the future, currently all comments are stripped from the child theme stylesheet code.</li>\n<li>No @keyframes or @font-face rules. Child Theme Configurator only supports @media and @import. If you need other @rules, put them in a separate stylesheet and import them into the Child Theme stylesheet.</li>\n<li>Only two-color gradients. Child Theme Configurator is powerful, but we have simplified the gradient interface. You can use any gradient you want as long as it has two colors and no intermediate stops.</li>\n<li>CSS properties are auto-discovered. Child Theme Configurator loads the properties that exist in the Parent stylesheet. You can always add new properties using the “Raw CSS” text area.</li>\n<li>Legacy gradient syntax is not supported. Child Theme Configurator does not support the MS filter gradient or legacy webkit gradient. These will continue to work if they are used in the parent theme, but will not be written to the child theme stylesheet. If there is a demand, we may add it in a future release, but most users should have upgraded by now.</li>\n</ul>\n<h3>Documentation</h3>\n<p>Go to http://www.childthemeplugin.com/</p>\n<p>Serbo-Croatian translation courtesy of Borisa Djuraskovic borisad@webhostinghub.com http://www.webhostinghub.com</p>\n<p>Copyright: (C) 2014-2018 Lilaea Media</p>\n",
        "installation": "<ol>\n<li>\n<p>To install from the Plugins repository:</p>\n<ul>\n<li>In the WordPress Admin, go to &#8220;Plugins &gt; Add New.&#8221;</li>\n<li>Type &#8220;child theme&#8221; in the &#8220;Search&#8221; box and click &#8220;Search Plugins.&#8221;</li>\n<li>Locate &#8220;Child Theme Configurator&#8221; in the list and click &#8220;Install Now.&#8221;</li>\n</ul>\n</li>\n<li>\n<p>To install manually:</p>\n<ul>\n<li>Download the Child Theme Configurator from https://wordpress.org/plugins/child-theme-configurator</li>\n<li>In the WordPress Admin, go to &#8220;Plugins &gt; Add New.&#8221;</li>\n<li>Click the &#8220;Upload&#8221; link at the top of the page.</li>\n<li>Browse for the zip file, select and click &#8220;Install.&#8221;</li>\n</ul>\n</li>\n<li>\n<p>In the WordPress Admin, go to &#8220;Plugins &gt; Installed Plugins.&#8221; Locate &#8220;Child Theme Configurator&#8221; in the list and click &#8220;Activate.&#8221;</p>\n</li>\n<li>\n<p>Navigate to Tools &gt; Child Themes (multisite users go to Network Admin &gt; Themes &gt; Child Themes).</p>\n</li>\n</ol>\n<h4>The Parent/Child Tab: 10 Easy Steps to Create a Child Theme</h4>\n<ol>\n<li>\n<p>Select an action:</p>\n<ul>\n<li>CREATE a new Child Theme &#8211; Install a new customizable child theme using an installed theme as a parent.</li>\n<li>CONFIGURE an existing Child Theme &#8211; Set up a previously installed child theme for use with the Configurator or to modify current settings.</li>\n<li>DUPLICATE an existing Child Theme &#8211; Make a complete copy of an existing Child Theme in a new directory, including any menus, widgets and other Customizer settings. The option to copy the Parent Theme settings (step 8, below) is disabled with this action.</li>\n<li>RESET an existing Child Theme (this will destroy any work you have done in the Configurator) &#8211; Revert the Child theme stylesheet and functions files to their state before the initial configuration or last reset.</li>\n</ul>\n</li>\n<li>\n<p>Select a Parent Theme if creating a new Child Theme; select a Child Theme if configuring, duplicating or resetting.</p>\n</li>\n<li>\n<p>Analyze Child Theme &#8211; Click &#8220;Analyze&#8221; to determine stylesheet dependencies and other potential issues.</p>\n</li>\n<li>\n<p>If creating a new Child Theme, name the new theme directory; otherwise verify it the directory is correct. &#8211; This is NOT the name of the Child Theme. You can customize the name, description, etc. in step 7, below.</p>\n</li>\n<li>\n<p>Select where to save new styles:</p>\n<ul>\n<li>Primary Stylesheet (style.css) &#8211; Save new custom styles directly to the Child Theme primary stylesheet, replacing the existing values. The primary stylesheet will load in the order set by the theme.</li>\n<li>Separate Stylesheet &#8211; Save new custom styles to a separate stylesheet and use any existing child theme styles as a baseline. Select this option if you want to preserve the original child theme styles instead of overwriting them. This option also allows you to customize stylesheets that load after the primary stylesheet.</li>\n</ul>\n</li>\n<li>\n<p>Select Parent Theme stylesheet handling:</p>\n<ul>\n<li>Use the WordPress style queue. &#8211; Let the Configurator determine the appropriate actions and dependencies and update the functions file automatically.</li>\n<li>Use @import in the child theme stylesheet. &#8211; Only use this option if the parent stylesheet cannot be loaded using the WordPress style queue. Using @import is not recommended.</li>\n<li>Do not add any parent stylesheet handling. &#8211; Select this option if this theme already handles the parent theme stylesheet or if the parent theme&#8217;s style.css file is not used for its appearance.</li>\n</ul>\n</li>\n<li>\n<p>Customize the Child Theme Name, Description, Author, Version, etc.: (Click to toggle form)</p>\n</li>\n<li>\n<p>Copy Parent Theme Menus, Widgets and other Customizer Settings to Child Theme: &#8211; NOTE: This will overwrite any child theme options you may have already set.</p>\n</li>\n<li>\n<p>Click the button to run the Configurator.</p>\n</li>\n<li>\n<p>IMPORTANT: Always test child themes with Live Preview (theme customizer) before activating!</p>\n</li>\n</ol>\n",
        "faq": "\n<dt id='how%20do%20i%20move%20changes%20i%20have%20already%20made%20to%20my%20theme%20into%20a%20child%20theme%3F'>\nHow do I move changes I have already made to my theme into a Child Theme?\n</h4>\n<p>\n<p>Follow these steps: http://www.childthemeplugin.com/how-to-use/#child_from_modified_parent</p>\n</p>\n<dt id='when%20i%20run%20the%20analyzer%20i%20get%20%22constants%20already%20defined%22%20notice%20in%20php%20debug%20output'>\nWhen I run the analyzer I get &#8220;Constants Already Defined&#8221; notice in PHP Debug Output\n</h4>\n<p>\n<p>This is a misconfiguration created by the Bluehost auto-installer. http://www.childthemeplugin.com/child-theme-faqs/#constants&#8221; class=&#8221;scroll-to&#8221;&gt;How to fix.</p>\n</p>\n<dt id='is%20there%20a%20tutorial%3F'>\nIs there a tutorial?\n</h4>\n<p>\n<p>There are videos under the &#8220;Help&#8221; tab at the top right of the page. You can also view them at http://www.childthemeplugin.com/tutorial-videos</p>\n</p>\n<dt id='if%20the%20parent%20theme%20changes%20%28e.g.%2C%20upgrade%29%2C%20do%20i%20have%20to%20update%20the%20child%20theme%3F'>\nIf the parent theme changes (e.g., upgrade), do I have to update the child theme?\n</h4>\n<p>\n<p>No. This is the point of using child themes. Changes to the parent theme are automatically inherited by the child theme.</p>\n<p>A child theme is not a &#8220;copy&#8221; of the parent theme. It is a special feature of WordPress that let&#8217;s you override specific styles and functions leaving the rest of the theme intact. Quality themes should identify any deprecated functions or styles in the upgrade notes so that child theme users can make adjustments accordingly.</p>\n</p>\n<dt id='if%20i%20uninstall%20child%20theme%20configurator%20are%20child%20themes%20affected%3F'>\nIf I uninstall Child Theme Configurator are child themes affected?\n</h4>\n<p>\n<p>No. Child Theme Configurator is designed to work independently of themes and plugins. Just remember that if you re-install, you must rebuild the configuration data using the Parent/Child tab.</p>\n</p>\n<dt id='how%20do%20i%20add%20comments%3F'>\nHow do I add comments?\n</h4>\n<p>\n<p>Arbitrary comments are not supported. Providing a high level of flexibility for previewing and modifying custom styles requires sophisticated parsing and data structures. Maintaining comments that are bound to any particular element in the stylesheet is prohibitively expensive compared to the value it would add. Although we are working to include this as an option in the future, currently all comments are stripped from the child theme stylesheet code.</p>\n</p>\n<dt id='does%20it%20work%20with%20multisite%3F'>\nDoes it work with Multisite?\n</h4>\n<p>\n<p>Yes. Go to &#8220;Network Admin &gt; Themes &gt; Child Themes.&#8221; Child themes must be &#8220;Network enabled&#8221; to preview and activate for Network sites.</p>\n</p>\n<dt id='does%20it%20work%20with%20plugins%3F'>\nDoes it work with plugins?\n</h4>\n<p>\n<p>Child Theme Configurator PRO brings the CSS editing power of Child Theme Configurator to any WordPress Plugin installed on your website by scanning your plugins and creating custom CSS in your Child Themes. Learn more at http://www.childthemeplugin.com/child-theme-configurator-pro</p>\n</p>\n<dt id='why%20doesn%27t%20this%20work%20with%20my%20%5Binsert%20vendor%20here%5D%20theme%3F'>\nWhy doesn&#8217;t this work with my [insert vendor here] theme?\n</h4>\n<p>\n<p>Some themes (particularly commercial themes) do not correctly load parent template files or automatically load child theme stylesheets or php files.</p>\n<p>This is unfortunate, because in the best case they effectively prohibit the webmaster from adding any customizations (other than those made through the admin theme options) that will survive past an upgrade. <strong>In the worst case they will break your website when you activate the child theme.</strong></p>\n<p>Contact the vendor directly to ask for this core functionality. It is our opinion that ALL themes (especially commercial ones) must pass the Theme Unit Tests outlined by WordPress.org and ALWAYS TEST CHILD THEMES BEFORE ACTIVATING (See &#8220;Preview and Activate&#8221;).</p>\n</p>\n<dt id='will%20this%20slow%20down%20my%20site%3F'>\nWill this slow down my site?\n</h4>\n<p>\n<p>Child Theme Configurator is designed to add the minimum amount of additional overhead possible and can actually improve performance. <strong>For example:</strong></p>\n<ul>\n<li>Child Theme Configurator creates or updates files that are already being read by the system. On the front-end, there are no database calls so WordPress can run independent of the plugin. In fact, you can remove Child Theme Configurator when you are finished setting up your child themes.</li>\n<li>Custom styles are applied to a stylesheet file that can be cached by the browser and/or cached and minimized by a performance caching plugin. Because the editor creates mostly &#8220;overrides&#8221; to existing styles, the file is typically smaller than other stylesheets.</li>\n<li>The code that drives the editor interface only loads when the tool is being used from the WordPress Admin, including Javascript and CSS. This means that it will not get in the way of other admin pages.</li>\n<li>The biggest performance hit occurs when you generate the Child Theme files from the Parent/Child tab, but this is a one-time event and only occurs from the WordPress Admin.</li>\n</ul>\n</p>\n<dt id='help%21%20i%20changed%20a%20file%20and%20now%20i%20am%20unable%20to%20access%20my%20website%20or%20login%20to%20wp-admin%20to%20fix%20it%21'>\nHELP! I changed a file and now I am unable to access my website or login to wp-admin to fix it!\n</h4>\n<p>\n<p>To back out of a broken child theme you have to manually rename the offending theme directory name (via FTP, SSH or your web host control panel file manager) so that WordPress can’t find it. WordPress will then throw an error and revert back to the default theme (currently twenty-fifteen).</p>\n<p>The child theme is in your themes folder, usually</p>\n<p>[wordpress]/wp-content/themes/[child-theme]</p>\n<p>To prevent this in the future, always test child themes with Live Preview (theme customizer) before activating.</p>\n</p>\n<dt id='why%20are%20my%20menus%20displaying%20incorrectly%20when%20i%20activate%20new%20child%20themes%3F'>\nWhy are my menus displaying incorrectly when I activate new child themes?\n</h4>\n<p>\n<p>&#8230;or&#8230;</p>\n</p>\n<dt id='why%20is%20my%20custom%20header%20missing%20when%20i%20activate%20new%20child%20themes%3F'>\nWhy is my custom header missing when I activate new child themes?\n</h4>\n<p>\n<p>&#8230;or&#8230;</p>\n</p>\n<dt id='why%20does%20my%20custom%20background%20go%20back%20to%20the%20default%20when%20i%20activate%20new%20child%20themes%3F'>\nWhy does my custom background go back to the default when I activate new child themes?\n</h4>\n<p>\n<p>&#8230;or&#8230;</p>\n</p>\n<dt id='why%20do%20my%20theme%20options%20disappear%20when%20i%20activate%20new%20child%20themes%3F'>\nWhy do my theme options disappear when I activate new child themes?\n</h4>\n<p>\n<p>These options are specific to each theme and are saved separately in the database. When you create new child themes, their options are blank.</p>\n<p>Many of these options can be copied over to the child theme by checking &#8220;Copy Parent Theme Menus, Widgets and other Options&#8221; when you generate the child theme files on the Parent/Child tab.</p>\n<p>If you want to set different options you can either apply them after you activate the child theme using the theme customizer, or by using the &#8220;Live Preview&#8221; under Appearance &gt; Themes.</p>\n<p>Every theme handles options in its own way. Most often, they will create a set of options and store them in the WordPress database. Some options are specific to the active theme (or child theme), and some are specific to the parent theme only (meaning the child theme CANNOT customize them). You will have to find out from the theme author which are which.</p>\n</p>\n<dt id='where%20is%20child%20theme%20configurator%20in%20the%20admin%3F'>\nWhere is Child Theme Configurator in the Admin?\n</h4>\n<p>\n<p>For most users Child Theme Configurator can be found under &#8220;Tools &gt; Child Themes.&#8221;</p>\n<p>WordPress Multisite (Network) users go to &#8220;Network Admin &gt; Themes &gt; Child Themes.&#8221;</p>\n<p>NOTE: Only users with &#8220;install_themes&#8221; capability will have access to Child Theme Configurator.</p>\n<p>Click the &#8220;Help&#8221; tab at the top right for a quick reference.</p>\n</p>\n<dt id='how%20do%20i%20add%20web%20fonts%3F'>\nHow do I add Web Fonts?\n</h4>\n<p>\n<p>The easiest method is to paste the @import code provided by Google, Font Squirrel or any other Web Font site into the Web Fonts tab. The fonts will then be available to use as a value of the font-family property. Be sure you understand the license for any embedded fonts.</p>\n<p>You can also create a secondary stylesheet that contains @font-face rules and import it using the Web Fonts tab.</p>\n</p>\n<dt id='why%20doesn%27t%20the%20parent%20theme%20have%20any%20styles%20when%20i%20%22view%20parent%20css%22%3F'>\nWhy doesn&#8217;t the Parent Theme have any styles when I &#8220;View Parent CSS&#8221;?\n</h4>\n<p>\n<p>Check the appropriate additional stylesheets under &#8220;Parse additional stylesheets&#8221; on the Parent/Child tab and load the Child Theme again. CTC tries to identify these files by fetching a page from the parent theme, but you may need to set them manually.</p>\n</p>\n<dt id='where%20are%20the%20styles%3F%20the%20configurator%20doesn%27t%20show%20anything%21'>\nWhere are the styles? The configurator doesn&#8217;t show anything!\n</h4>\n<p>\n<p>All of the styles are loaded dynamically. You must start typing in the text boxes to select styles to edit.<br />\n&#8220;Base&#8221; is the query group that contains styles that are not associated with any particular &#8220;At-rule.&#8221;</p>\n<p>Start by clicking the &#8220;Query/Selector&#8221; tab and typing &#8220;base&#8221; in the first box. You can then start typing in the second box to retrieve the style selectors to edit.</p>\n</p>\n<dt id='why%20do%20the%20preview%20tabs%20return%20%22stylesheet%20could%20not%20be%20displayed%22%3F'>\nWhy do the preview tabs return &#8220;Stylesheet could not be displayed&#8221;?\n</h4>\n<p>\n<p>You have to load a child theme from the Parent/Child tab for the preview to display. This can also happen when your WP_CONTENT_URL is different than $bloginfo(&#8216;site_url&#8217;). Ajax cannot make cross-domain requests by default. Check that your Settings &gt; General &gt; &#8220;WordPress Address (URL)&#8221; value is correct. (Often caused by missing &#8220;www&#8221; in the domain.)</p>\n</p>\n<dt id='can%20i%20edit%20the%20child%20theme%20stylesheet%20manually%20offline%20or%20by%20using%20the%20editor%20or%20do%20i%20have%20to%20use%20the%20configurator%3F'>\nCan I edit the Child Theme stylesheet manually offline or by using the Editor or do I have to use the Configurator?\n</h4>\n<p>\n<p>You can make any manual customizations you wish to the stylesheet. Just make sure you import the revised stylesheet using the Parent/Child panel or the Configurator will overwrite your customizations the next time you use it. Just follow the steps as usual but select the &#8220;Use Existing Child Theme&#8221; radio button as the &#8220;Child Theme&#8221; option. The Configurator will automatically update its internal data from the new stylesheet.</p>\n</p>\n<dt id='where%20are%20the%20child%20theme%20.php%20files%3F'>\nWhere are the child theme .php files?\n</h4>\n<p>\n<p>Child Theme Configurator automatically adds a blank functions.php file to the child theme&#8217;s directory. You can copy parent theme template files using the Files tab. If you want to create new templates and directories you will have to create/upload them manually via FTP or SSH. Remember that a child theme will automatically inherit the parent theme&#8217;s templates unless they also exist in the child theme&#8217;s directory. Only copy templates that you intend to customize.</p>\n</p>\n<dt id='how%20do%20i%20customize%20a%20specific%20color%2Ffont%20style%2Fbackground%3F'>\nHow do I customize a specific color/font style/background?\n</h4>\n<p>\n<p>You can override a specific CSS value globally using the Property/Value tab. See Property/Value, above.</p>\n</p>\n<dt id='how%20do%20i%20add%20custom%20styles%20that%20aren%27t%20in%20the%20parent%20theme%3F'>\nHow do I add custom styles that aren&#8217;t in the Parent Theme?\n</h4>\n<p>\n<p>You can add queries and selectors using the &#8220;Raw CSS&#8221; textarea on the Query/Selector tab. See Query/Selector, above.</p>\n</p>\n<dt id='how%20do%20i%20remove%20a%20style%20from%20the%20parent%20theme%3F'>\nHow do I remove a style from the Parent Theme?\n</h4>\n<p>\n<p>You shouldn&#8217;t really &#8220;remove&#8221; a style from the Parent. You can, however, set the property to &#8220;inherit,&#8221; &#8220;none,&#8221; or zero (depending on the property). This will negate the Original value. Some experimentation may be necessary.</p>\n</p>\n<dt id='how%20do%20i%20remove%20a%20style%20from%20the%20child%20theme%3F'>\nHow do I remove a style from the Child Theme?\n</h4>\n<p>\n<p>Delete the value from the input for the property you wish to remove. Child Theme Configurator only adds overrides for properties that contain values.</p>\n</p>\n<dt id='how%20do%20i%20set%20the%20%21important%20flag%3F'>\nHow do I set the !important flag?\n</h4>\n<p>\n<p>We always recommend relying on good cascading design over global overrides. To that end, you have ability to change the load order of child theme custom styles by entering a value in the &#8220;Order&#8221; field. And yes, you can now set properties as important by checking the &#8220;!&#8221; box next to each input. Please use judiciously.</p>\n</p>\n<dt id='how%20do%20i%20create%20cross-browser%20gradients%3F'>\nHow do I create cross-browser gradients?\n</h4>\n<p>\n<p>Child Theme Configurator uses a standardized syntax for gradients and only supports two-color gradients without intermediate stops. The inputs consist of origin (e.g., top, left, 135deg, etc.), start color and end color. The browser-specific syntax is generated automatically when you save these values. See Caveats, below, for more information.</p>\n</p>\n<dt id='how%20do%20i%20make%20my%20theme%20responsive%3F'>\nHow do I make my Theme responsive?\n</h4>\n<p>\n<p>The short answer is to use a responsive Parent Theme. Some common characteristics of responsive design are:</p>\n<ul>\n<li>Avoiding fixed width and height values. Using max- and min-height values and percentages are ways to make your designs respond to the viewer&#8217;s browser size.</li>\n<li>Combining floats and clears with inline and relative positions allow the elements to adjust gracefully to their container&#8217;s width.</li>\n<li>Showing and hiding content with Javascript.</li>\n</ul>\n<p>For more information view &#8220;Make a Theme Responsive&#8221;:</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/iBiiAgsK4G4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n</p>\n\n",
        "changelog": "<h4>2.6.6</h4>\n<ul>\n<li>Fixed bug in DE translation module</li>\n</ul>\n<h4>2.6.5</h4>\n<ul>\n<li>Fixed deprecation notice for utf8_encode</li>\n</ul>\n<h4>2.6.4</h4>\n<ul>\n<li>Fixed deprecation notices in Packer.php and CSS.php</li>\n</ul>\n<h4>2.6.2/2.6.3</h4>\n<ul>\n<li>Version updates only.</li>\n</ul>\n<h4>2.6.1</h4>\n<ul>\n<li>Fixed ui-active-state selector where select menu was not being highlighted</li>\n</ul>\n<h4>2.5.8</h4>\n<ul>\n<li>Fixed some stylesheet issues</li>\n</ul>\n<h4>2.5.7</h4>\n<ul>\n<li>Updated for WP 5.6</li>\n</ul>\n<h4>2.5.6</h4>\n<ul>\n<li>WP 5.5 update removed commonL10n &#8211; causing scripts to break &#8211; replaced with CTC getxt value.</li>\n</ul>\n<h4>2.5.5</h4>\n<ul>\n<li>Removed curly brace syntax from substring argument in Packer class.</li>\n</ul>\n<h4>2.5.4</h4>\n<ul>\n<li>Fixed case where registered styles not showing in queue during analysis.</li>\n</ul>\n<h4>2.5.3</h4>\n<ul>\n<li>Fixes to stylesheet. Updates to help tabs.</li>\n</ul>\n<h4>2.5.2</h4>\n<ul>\n<li>Logic to prevent malformed style properties</li>\n<li>Minor cosmetic changes</li>\n</ul>\n<h4>2.5.0</h4>\n<ul>\n<li>Preview class now evaluates stylesheet hooks as they fire instead of calling them again to prevent function exists errors.</li>\n<li>Tested for PHP version 7.1</li>\n<li>Modified input parser to allow multi-stop background gradients.</li>\n</ul>\n<h4>2.4.x</h4>\n<ul>\n<li>Analyzer now saves all signals on successful child theme regardless of analysis results. </li>\n<li>This fixes a bug in some themes where the enqueue hooks were being rewitten incorrectly after adding web fonts.</li>\n<li>Fixed a serious regression bug created by version 2.4.2.</li>\n<li>Added call to customizer.php to initialize theme mods prior to analyzing child theme</li>\n<li>Deferred copy_theme_mods until after child theme analysis. This allows hooks in Preview to initialize custom theme mods</li>\n<li>Added mpriority (max priority) to CSS object to accommodate multiple irregular stylesheet hooks</li>\n<li>Restored original (pre 2.4.1) version filter hook style_loader_src to child theme stylesheets to prevent caching</li>\n<li>Strip closing php tag from functions.php to prevent premature response header</li>\n<li>Fixed localization issues (thanks @alexclassroom for identifying these)</li>\n<li>Modified style_loader_src hook to only add timestamp under certain conditions to prevent loading delay for most requests. (thanks @anthony750)</li>\n<li>Automatically add action parent RTL stylesheet when child theme does not have one.</li>\n<li>Handle case where parent theme changes queue action incorrectly points to non-existent child theme stylesheet.</li>\n<li>Correctly copies customizer css to child theme.</li>\n<li>Fixed PHP 7.3 compatability issue (thanks @forest-skills for identifying this)</li>\n</ul>\n<h4>2.3.x</h4>\n<ul>\n<li>strip scripts during template scan to prevent false positives</li>\n<li>check file size during template scan to prevent timeout</li>\n<li>changed syntax of statement that was being flagged by WP Defender</li>\n<li>Fixed bug in screenshot copy.</li>\n<li>Fixed incorrect reference to errors array in UI.</li>\n<li>Added ability to rename @media query </li>\n<li>Added height/Width for theme images on Files Tab</li>\n<li>Added test for RTL in Analyzer</li>\n<li>Added test cases for WP Rocket and AutOptimize plugins in Analyzer</li>\n<li>Added redirect for error condition after configurator POST</li>\n<li>Clarified descriptions for certain Analyzer signal conditions</li>\n<li>Set priority of child theme css hook to force load after parent</li>\n<li>Remove pruned selectors from menu</li>\n</ul>\n<h4>2.2.x</h4>\n<ul>\n<li>Modified preview to include all registered stylesheets in queue</li>\n<li>Disable Autoptimize in preview</li>\n<li>Added support for General Sibling Selector (~)</li>\n<li>Fixed CSS class loading FALSE for dictionaries on fresh install</li>\n<li>Fixed using wrong nonce for plugin mode preview (Pro)</li>\n<li>Fixed error thrown when packing negative integers (Pro)</li>\n<li>Disable Pagespeed in preview</li>\n<li>Fixed Preview and Analyzer for some child theme configurations by removing nonce requirement </li>\n<li>Fixed header not being repaired on first pass with &#8220;Repair Header&#8221; selected</li>\n<li>Fixed styles being pruned before new &#8220;Raw CSS&#8221; styles are added</li>\n<li>Fix bug in parent dependencies</li>\n<li>Fix bug where stylesheet dependency arrays are not being initialized</li>\n<li>Add action hook to extend copy theme settings feature</li>\n<li>Display non active tabs, enable upgrade/register before config data is created</li>\n<li>Show raw results after Analysis to help debugging</li>\n<li>Fix javascript not escaping quotes in input fields</li>\n<li>Restored original ajax preview and added fallback method for cross-domain preview</li>\n<li>Fix in javascript affecting Pro users</li>\n<li>Cross domain Parse error</li>\n<li>Showing &#8220;reconfigure&#8221; message on new install</li>\n<li>Manual upgrade Pro from plugin</li>\n<li>Add pre_option stylesheet and template filters to Preview class</li>\n<li>Use child theme name on duplicate</li>\n<li>Ability to force/unforce dependency</li>\n<li>Identify and handle imported stylesheets, convert to links</li>\n<li>Fixes related to testing if CTC Pro is installed</li>\n</ul>\n<h4>2.1.x</h4>\n<ul>\n<li>change packer class to use standard &lt; 5.4 array syntax</li>\n<li>Loading dictionaries on demand</li>\n<li>Reversed key/value dictionary structure for huge memory improvement</li>\n<li>Added packer class to flatten multidim arrays for huge memory improvement</li>\n<li>Reduced key name lengths throughout </li>\n<li>Improved data validation on inputs</li>\n<li>Require minimum Pro version ( Pro users only )</li>\n<li>Move html output to separate view includes</li>\n<li>Move theme mod routines to own functions</li>\n</ul>\n<h4>2.0.x</h4>\n<ul>\n<li>Fix: preview not parsing parent styles correctly when minimized.</li>\n<li>Fix: cast argument to array in sort functions.</li>\n<li>Updated Child Theme Configurator language template.</li>\n<li>Updated child theme preview class to use is_theme_active and other methods to eliminate conflicts with Jetpack and any other plugin that references the customize manager.</li>\n<li>Updated child theme preview class to send origin headers and run customize_preview_init action along with some other actions.</li>\n<li>Added logic conditions in preview class to help prevent Analyzer from failing in some cases</li>\n<li>Enabled theme zip file export for any selected theme independent of theme currently loaded in Configurator</li>\n<li>Fixed bugs present with servers not running Apache with SuExec</li>\n<li>Fixed issue with Windows servers that do not return C: with filesystem paths</li>\n<li>Automatically set priority of enqueue hook based on value from parent theme</li>\n<li>Made file scan routine more efficient</li>\n<li>Support for background-image as base64 data</li>\n<li>Tweaked analyzer signals </li>\n<li>Updated language template and de_DE files</li>\n<li>Fix: case where child stylesheet link was not being added resulting in &#8220;This child theme does not load a Configurator stylesheet&#8221; notice</li>\n<li>Fix: fatal error in debug mode</li>\n<li>Minor bug fixes</li>\n<li>New Theme Analyzer automatically checks for issues and determines correct settings</li>\n<li>Step by step setup of Parent/Child settings</li>\n<li>Simplified parent stylesheet handling options</li>\n<li>Option to write new child theme styles to a separate stylesheet</li>\n<li>Uses WordPress style dependencies to ensure correct child theme stylesheet load order</li>\n<li>Automatically repairs themes that use outdated stylesheet handling methods</li>\n<li>Parses parent theme files and only displays templates that can be be overridden by child themes</li>\n<li>Numerous minor bug fixes </li>\n</ul>\n<h4>1.7.x</h4>\n<ul>\n<li>Fix: regression bug in 1.7.9 causing new property menu to fail</li>\n<li>Fix: use nonce when retrieving front-end html to parse default additional stylesheets</li>\n<li>Refactored classes to make Child Theme Configurator more lightweight on front end</li>\n<li>Fix: disable autoload on configuration data options</li>\n<li>Fix: normalize media query and add to menu when added via raw css</li>\n<li>Fix: Margin and Padding shorthand generated incorrectly.</li>\n<li>Addressed case where parent or child theme is in subdirectory.</li>\n<li>Minimized admin CSS.</li>\n<li>Sanitize child theme slug</li>\n<li>Remove cascade load order comments from generated CSS</li>\n<li>Set admin background to prevent theme override</li>\n<li>Refactored background normalization function to better follow CSS specification.</li>\n<li>Check child theme exists function case-insensitive.</li>\n<li>Changed chldthmcfg.init() call to fire on load instead of .ready() to prevent JS conflicts</li>\n<li>Uses spectrum color picker to support transparency and named colors.</li>\n<li>Refactored entire system to support fallback values for any property.</li>\n<li>Fix path when duplicating child theme on first run</li>\n<li>New Feature: &#8220;delete child values&#8221; button &#8211; easily revert custom styles in child theme stylesheet</li>\n<li>Will not write child theme stylesheet if error detected in functions.php </li>\n<li>Fixed minified JS </li>\n<li>Restored multisite admin menu link under Tools by popular demand</li>\n<li>Automatically Network enables new child theme on creation</li>\n<li>Fix for FTP notice &#8211; now uses PHP_OS constant to detect win vs nix</li>\n<li>Added duplicate child theme feature </li>\n<li>added dismiss option to warnings by popular demand.</li>\n<li>Changed @import tab to &#8220;Web Fonts.&#8221; @import statements are automatically converted to enqueued external links.</li>\n<li>Added &#8220;Enqueue both parent and child stylesheets&#8221; option to enable child theme overrides without using @import.</li>\n<li>Added checks for hard-coded link tags in header template to help resolve incorrect stylesheet load order.</li>\n<li>Fix: &#8220;Enqueue child stylesheet&#8221; now passes correct value.</li>\n<li>Fix: hide called before iris init</li>\n<li>Fix: @import not being written on rebuild/configure</li>\n<li>Fix: min height on property/value panel</li>\n<li>Only prune child theme selectors on rename</li>\n<li>Removed conflicting wistia javascript link</li>\n<li>New Feature: Enqueue child theme stylesheet option for themes that do not load it.</li>\n<li>New Feature: Child Theme and Author website, description and tag fields.</li>\n<li>Fix: Redesigned UI Javascript using jQuery objects for better browser memory management.</li>\n<li>Fix: Child Theme Stylesheet version is timestamped to force browser reload after changes.</li>\n</ul>\n<h4>1.6.x</h4>\n<ul>\n<li>Fix: Empty functions file created causing inserted markers to be output to browser.</li>\n<li>Fix: check for closed PHP tag in functions file prior to inserting markers</li>\n<li>Fix: undefined constant LILAEAMEDIA_URL</li>\n<li>Fix: logic to determine whether to display config notice</li>\n<li>Fix: incorrect path generation and validation on Windows servers</li>\n<li>Added error handling and notification to prevent jQuery conflicts and out of memory conditions</li>\n<li>Fix: removed max-height on property/value overlay</li>\n<li>Added debug option</li>\n<li>New Feature: Copy selector button for Raw CSS textarea on Query/Selector tab.</li>\n<li>Fix: Menus rendering incorrectly for RTL locales</li>\n<li>Fix: Border-top etc. not being written correctly to stylesheet</li>\n<li>Fix: Refactored ajax semaphore logic and flow</li>\n<li>New Feature: Better child theme handling for multisite. Moved interface to Themes menu and check for network enabled.</li>\n<li>Fix: Restrict child theme configurator access to install_themes capability</li>\n<li>Fix: Preview links to Themes admin if not network enabled to prevent &#8216;Cheatin, uh?&#8217; error.</li>\n<li>Fix: only users with &#8220;install_themes&#8221; capability have access to Child Theme Configurator. This resolves permission issues with both multisite and single site installs. <strong>MULTISITE USERS:</strong> The Admin HAS MOVED to Network Admin &gt; Themes &gt; Child Themes for better handling for multisite (network) installs.</li>\n<li>Fix: Regular expression introduced in version 1.6.2 parses selectors incorrectly.</li>\n<li>Fix: replaced wp_normalize_path with class method to support legacy WP versions</li>\n<li>Fix: support for multiple layered background images</li>\n<li>Fix: background:none being parsed into gradient origin parameter</li>\n<li>Fix: support for data URIs</li>\n<li>Fix: support for *= and ^= notation in selectors </li>\n<li>Fix: add check if theme uses hard-wired stylesheet link and alert to use @import instead of link option</li>\n<li>Fix: conflicts with using jQuery UI from CDN &#8211; using local version of 1.11.2 Widget/Menu/Selectmenu instead</li>\n<li>Fix: using wp-color-picker handle instead of iris as dependency to make sure wpColorPicker() methods are loaded</li>\n<li>Fix: copy parent theme widgets logic is different when child theme is active</li>\n<li>New Feature: option to load parent stylesheet using wp_enqueue_style (link), @import or none. </li>\n<li>Thanks to cmwwebfx and Shapeshifter3 for pushing me on this </li>\n<li>New Feature: automatically-generated slug and name</li>\n<li>New Feature: restore from backup and reset options</li>\n<li>New Feature: backup files to &#8220;Child Theme Files&#8221; on Files Tab so they can be deleted</li>\n<li>New Feature: Added new theme chooser select menu with screenshot, theme info and link to live preview.</li>\n<li>Fix: Admin scripts now only load when CTC page is being viewed.</li>\n<li>Fix: parent CSS preview to correctly display all parsed parent stylesheets in sequence</li>\n<li>Fix: Refactored throughout for maintainability</li>\n</ul>\n<h4>1.5.x</h4>\n<ul>\n<li>New Feature: Load imported stylesheets into the CTC admin so web fonts can be previewed.</li>\n<li>Set preview swatch to z-index -1 to prevent it from covering up the controls</li>\n<li>Spread config data across multiple option records to prevent out of memory errors with large stylesheets.</li>\n<li>Do not automatically select Bootstrap CSS files as additional stylesheets to (greatly) reduce overhead.</li>\n<li>Add jQuery UI styles that are no longer being loaded by default in the WP admin (autoselect menus).</li>\n<li>Fixed a bug in the way zero values are handled that was breaking css output in certain situations</li>\n<li>Added regex filter for non-printable (e.g., null) characters in input strings</li>\n<li>Fixed a bug introduced in v1.5.2(.1) that copied all of the parent styles to the child theme stylesheet. This should only be an issue for &#8216;background-image&#8217; styles that reference images in the parent theme and do not have child theme overrides.</li>\n<li>Rolled back changes to the javascript controller that introduced a number of type errors.</li>\n<li>Tweaked preview ajax call to handle ssl.</li>\n<li>Automatically set additional stylesheets to parse based on parent theme links in head.</li>\n<li>Render parent CSS including additional stylesheets </li>\n<li>Added copy option to Parent/Child tab to assign menu locations, sidebars/widgets, custom header, background, and other options to new Child Themes. </li>\n<li>Refactored CTC to use the WP_Filesystem API. </li>\n<li>Non suExec configurations will now require user credentials to add, remove or update Child Theme files. </li>\n<li>Added the ability for you to make the files writable while editing and then make them read-only when you are done.</li>\n<li>You can also set your credentials in wp-config.php: https://codex.wordpress.org/Editing_wp-config.php#WordPress_Upgrade_Constants</li>\n</ul>\n<h4>1.4.x</h4>\n<ul>\n<li>Removed backreference in main CSS parser regex due to high memory usage.</li>\n<li>Fixed uninitialized variable in files UI.</li>\n<li>Feature: export child themes as zip archive</li>\n<li>Added transform to list of vendor properties</li>\n<li>Bug fixed: parser not loading multiple instances of same @media rulesets</li>\n<li>Refactored uploader to use wp core functions for compatibility and security</li>\n<li>Increased CHLD_THM_CFG_MAX_RECURSE_LOOPS to 1000 to accommodate complex parent frameworks</li>\n<li>Fix: javascript bug</li>\n<li>Fix: regression bug &#8211; sanitizing broke raw input selectors</li>\n<li>Fix: escape quotes in text inputs. This has bugged me for a while now.</li>\n<li>Fix: Escape backslash for octal content values. Thanks Laurent for reporting this.</li>\n<li>Fix: Normalize colors to lowercase and short form when possible to prevent duplicate entries in the data</li>\n<li>Refactored the way CTC caches updates and returns them to the UI controller to reduce memory consumption. </li>\n<li>Prevent out of memory fatals when generating new child themes.</li>\n<li>Changed &#8220;Scan Parent for Additional Stylesheets&#8221; to individual checkbox options for each file with a toggle to show/hide in the Parent/Child tab.</li>\n<li>Added automatic update of form when Parent Theme is changed.</li>\n<li>Pre-populate Parent/Child form when parent slug is passed to CTC options.</li>\n<li>updated parser to match selectors containing parentheses and empty media rulesets</li>\n<li>Tweaked the Files tab options and added check for DISALLOW_FILE_EDIT</li>\n<li>Removed automatic @import rules for additional stylesheets that are loaded.</li>\n<li>Fixed bug caused by new jQuery .css function handling of empty css values (preview swatch).</li>\n<li>New Feature: Theme Files tab: </li>\n<li>Copy parent templates to child themes to be edited using the Theme Editor.</li>\n<li>Remove child theme templates. </li>\n<li>Upload child theme images.</li>\n<li>Remove child theme images.</li>\n<li>Upload child theme screenshot.</li>\n</ul>\n<h4>1.3.x</h4>\n<ul>\n<li>Fixes a bug with the way the @import data is stored that threw errors on php 5.3 and corrupted v1.3.2 @import data.</li>\n<li>New Feature: option to scan parent theme for additional stylesheets. This allows CTC to be used with themes such as &#8220;Responsive&#8221; by CyberChimps.</li>\n<li>New Feature: automatically copies parent theme screenshot to child. </li>\n<li>Fixed unquoted regex pattern in file path security check function. Thanks to buzcuz for reporting this.</li>\n<li>Updated help tab content. Added additional sanitization of source and target file paths.</li>\n<li>Changed CSS preview to retrieve directly from WordPress Admin instead of remote http GET to prevent caching issues.</li>\n<li>Added loading icon for CSS preview.</li>\n<li>Fixed JS type error on backup toggle.</li>\n<li>Improved extensibility throughout.</li>\n</ul>\n<h4>1.2.x</h4>\n<ul>\n<li>Replace PHP short tags with standard codes.</li>\n<li>New Features: You can now rename selectors in place from the Query/Selector panel. Made stylesheet backup optional. Bugs fixed: Incorrect parsing of background position when &#8216;0&#8217;, fixed type error when background image url value is removed.</li>\n<li>Bugs fixed: &#8220;star hack&#8221; properties no longer throwing js error. Important flag now works on borders and gradients.</li>\n<li>New features: Link to Query/Selector tab from specific Property/Value selector, new property focus on adding new property. Bugs fixed: clear Query/Selector inputs when loaded selector is empty, use latest min.js script.</li>\n</ul>\n<h4>1.1.x</h4>\n<ul>\n<li>Added check for writability before attempting to create child theme files to avoid fatal error on servers not running suEXEC. Fixed a bug in the ctc_update_cache function that was throwing a fatal JS error when new media queries were saved via the Raw CSS input. Configurator now adds functions.php file to child theme when it does not exist.</li>\n<li>Added reorder sequence and important flag functionality. Fixed bug where multiple inputs with same selector/property combo were assigned the same id. Fixed bug in the shorthand encoding routine. </li>\n<li>Added tutorial video to help tabs.</li>\n<li>Added call to reset_updates() before update_option() to prevent serialization errors.</li>\n<li>Query/Selector panel now defaults to &#8216;base&#8217;</li>\n<li>Fixed bug causing background-image with full urls (http://) to be parsed as gradients</li>\n<li>Fixed bug causing property menu to throw error when selector has no properties</li>\n<li>Fixed sort bug in shorthand parser that was returning properties in wrong order</li>\n<li>Fixed bug that assumed lowercase only for theme slugs. (Thanks to timk)</li>\n<li>Fixed update redirect to execute on first run</li>\n<li>Small bug fix to javascript (casting number to string)</li>\n<li>Fixed major bug where inputs containing &#8216;0&#8217; were being ignored</li>\n<li>Removed &#8220;no leading digits&#8221; requirement for theme slug</li>\n<li>Change query sort function to keep parent order of queries without device width rules</li>\n<li>Fixed gettext calls to use static namespace parameter</li>\n<li>Auto populate child theme inputs when existing theme is selected</li>\n<li>Correctly remove border when values are blanked</li>\n<li>Fixed duplicate &#8220;new property&#8221; bug on Query/Selector panel</li>\n<li>added timestamp to backup file </li>\n<li>Added encode_shorthand function to recombine margin/padding values when all 4 sides are present</li>\n<li>Corrected parsing for certain backgrounds and gradients (e.g., supports hsla color syntax)</li>\n<li>Handle empty selectors</li>\n<li>Ajax load for menus and updates</li>\n<li>Clean up Parent/Child form UI and validation</li>\n<li>Streamlined UI overall</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Initial release.</li>\n</ul>\n"
    },
    "short_description": "When using the Customizer is not enough - Create a child theme from your installed themes and customize styles, templates, functions and more.",
    "description": "<p>Child Theme Configurator is a fast and easy to use utility that allows you to analyze any theme for common problems, create a child theme and customize it beyond the options of the Customizer. Designed for WordPress users who want to be able to customize child theme stylesheets directly, Child Theme Configurator lets you easily identify and override the exact CSS attributes you want to customize. The Analyzer scans the rendered theme and automatically configures your child theme. It correctly enqueues theme and font stylesheets for optimum performance and handles vendor-specific syntax, giving you unlimited control over the Child Theme look and feel while leaving your Parent Theme untouched. <a href=\"http://www.childthemeplugin.com\" rel=\"nofollow ugc\">Learn more about how to create a child theme</a>.</p>\n<h4>Take Control of Your Child Themes</h4>\n<p>Child Theme Configurator parses and indexes your stylesheets so that every CSS media query, selector, property and value are at your fingertips. Second, it shows you how each customization you make will look before you commit it to the child theme. Finally, it saves your work so that you can customize styles in your child themes without the risk of losing your edits.</p>\n<p>You can create any number of child themes from your existing Parent Themes. Child Theme Configurator lets you choose from your installed themes (even existing child themes) and save the results in your Themes directory.</p>\n<p>When you are ready, just activate the Child Theme and your WordPress site takes on the custom styles automatically.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/xL0YmieF6d0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h4>Why create child themes and customize styles using Child Theme Configurator?</h4>\n<ol>\n<li>\n<p>Some things cannot be changed using the Customizer.</p>\n</li>\n<li>\n<p>Unless you use a child theme, you will lose any changes you made to templates and stylesheets when you update.</p>\n</li>\n<li>\n<p>Child Theme Configurator automatically determines the correct way to set up a child theme based on the theme you are using.</p>\n</li>\n<li>\n<p>You can find the exact style selectors your theme uses and change properties quickly.</p>\n</li>\n<li>\n<p>You can locate, copy and edit theme templates from the admin.</p>\n</li>\n<li>\n<p>Much more:</p>\n<ul>\n<li>Update themes without losing customizations</li>\n<li>Smart Theme Analyzer determines correct settings to use</li>\n<li>Resolve common child theme issues with almost any parent theme</li>\n<li>Copy existing widgets, menus and Customizer options to child theme</li>\n<li>Use web fonts in your child theme</li>\n<li>Enqueue (link) stylesheets instead of using @import</li>\n<li>Quickly locate and edit theme CSS.</li>\n<li>Customize @media queries for responsive design</li>\n<li>Select hex, RGBA (transparent) and named colors using Spectrum color picker</li>\n<li>Add fallback styles (multiple values per property)</li>\n<li>Save hours of development time</li>\n<li>Multisite compatible</li>\n<li>Make modifications unavailable to the Customizer</li>\n<li>Export child themes as Zip Archive</li>\n<li>Identify and override exact selectors from the parent theme</li>\n<li>Change specific colors, backgrounds, font styles, etc., without changing other elements</li>\n<li>Automatically generate cross-browser and vendor-prefixed properties and CSS gradients</li>\n<li>Preview custom styles before committing to them</li>\n<li>Uses WP Filesystem API – will not create files you cannot remove</li>\n</ul>\n</li>\n</ol>\n<h4>Child Theme Configurator PRO</h4>\n<p>Apply the CSS customizing power of Child Theme Configurator to any WordPress Plugin installed on your website. Child Theme Configurator PRO scans your plugins and lets you customize their stylesheets. We’ve added more features to make customizing styles quicker and easier with PRO.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/fktwCk43a8c?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Learn more at http://www.childthemeplugin.com/child-theme-configurator-pro</p>\n<h4>Unlimited Widget Content With a Single Plugin</h4>\n<p>IntelliWidget is a versatile widget manager that does the work of multiple plugins by combining custom page menus, featured posts, sliders and other dynamic content features that can display on a per-page or site-wide basis.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Ttw1xIZ2b-g?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Learn more at https://www.lilaeamedia.com/plugins/intelliwidget</p>\n<h4>Hook Highlighter</h4>\n<p>Hook Highlighter provides Administrators insight into the internal program flow of WordPress when activated on any front-facing page of a website.</p>\n<p>Display action and filter hooks, program files and backtrace information inline for the current page.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/fyeroaJK_xw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Learn more at https://www.lilaeamedia.com/product/hook-highlighter</p>\n<h3>Query/Selector Tab</h3>\n<p>There are two ways to identify and customize baseline (parent) styles. Child Theme Configurator lets you search styles by CSS selector and by property. If you wish to customize a specific CSS selector (e.g., h1), use the &#8220;Query/Selector&#8221; tab. If you have a specific CSS value you wish to customize site-wide (e.g., the color of the type), use the &#8220;Property/Value&#8221; tab.</p>\n<p>The Query/Selector tab lets you find specific CSS selectors and edit them. First, find the query that contains the CSS selector you wish to edit by typing in the Query autoselect box. Select by clicking with the mouse or by pressing the &#8220;Enter&#8221; or &#8220;Tab&#8221; keys. CSS selectors are in the base query by default.<br />\nNext, find the CSS selector by typing in the &#8220;Selector&#8221; autoselect box. Select by clicking with the mouse or by pressing the &#8220;Enter&#8221; or &#8220;Tab&#8221; keys.</p>\n<p>This will load all of the properties for that CSS selector with the Original values on the left and the child theme values inputs on the right. Any existing child theme values will be automatically populated. There is also a Sample preview that displays the combination of Parent and Child overrides. Note that the border and background-image get special treatment.</p>\n<p>The &#8220;Order&#8221; field contains the original sequence of the CSS selector in the parent theme stylesheet. You can change the CSS selector order sequence by entering a lower or higher number in the &#8220;Order&#8221; field. You can also force style overrides (so called &#8220;!important&#8221; flag) by checking the &#8220;!&#8221; box next to each input. Please use judiciously.</p>\n<p>Click &#8220;Save&#8221; to update the child theme stylesheet and save your changes to the WordPress admin.</p>\n<h3>Adding Raw CSS</h3>\n<p>If you wish to add additional properties to a given CSS selector, first load the selector using the Query/Selector tab. Then find the property you wish to override by typing in the New Property autoselect box. Select by clicking with the mouse or by pressing the &#8220;Enter&#8221; or &#8220;Tab&#8221; keys. This will add a new input row to the selector inputs.</p>\n<p>If you wish to add completely new CSS selectors, or even new @media queries, you can enter free-form CSS in the &#8220;Raw CSS&#8221; textarea. Be aware that your syntax must be correct (i.e., balanced curly braces, etc.) for the parser to load the new custom styles. You will know it is invalid because a red &#8220;X&#8221; will appear next to the save button.</p>\n<p>If you prefer to use shorthand syntax for properties and values instead of the inputs provided by Child Theme Configurator, you can enter them here as well. The parser will convert your input into normalized CSS code automatically.</p>\n<h3>Property/Value Tab</h3>\n<p>The Property/Value tab lets you find specific values for a given property and then edit that value for individual CSS selectors that use that property/value combination. First, find the property you wish to override by typing in the Property autoselect box. Select by clicking with the mouse or by pressing the &#8220;Enter&#8221; or &#8220;Tab&#8221; keys.</p>\n<p>This will load all of the unique values that exist for that property in the parent theme stylesheet with a Sample preview for that value. If there are values that exist in the child theme stylesheet that do not exist in the parent stylesheet, they will be displayed as well.</p>\n<p>For each unique value, click the &#8220;Selectors&#8221; link to view a list of CSS selectors that use that property/value combination, grouped by query with a Sample preview of the value and inputs for the child theme value. Any existing child theme values will be automatically populated.</p>\n<p>Click &#8220;Save&#8221; to update the child theme stylesheet and save your changes to the WordPress admin.</p>\n<p>If you want to edit all of the properties for the CSS selector you can click the “Edit” link and the CSS selector will automatically load in the Query/Selector Tab.</p>\n<h3>Web Fonts Tab</h3>\n<p>You can add additional stylesheets and web fonts by typing @import rules into the textarea on the Web Fonts tab. <strong>Important: do not import the parent theme stylesheet here.</strong> Use the &#8220;Parent stylesheet handling&#8221; option from the Parent/Child tab.</p>\n<h3>Files Tab</h3>\n<h4>Parent Templates</h4>\n<p>You can copy PHP template files from the parent theme by checking the boxes. Click &#8220;Copy Selected to Child Theme&#8221; and the templates will be added to the child theme&#8217;s directory.</p>\n<p>CAUTION: If your child theme is active, the child theme&#8217;s version of the file will be used instead of the parent immediately after it is copied. The functions.php file is generated separately and cannot be copied here.</p>\n<h4>Child Theme Files</h4>\n<p>Templates copied from the parent are listed here. These can be edited using the Theme Editor in the Appearance Menu. Remove child theme images by checking the boxes and clicking &#8220;Delete Selected.&#8221;</p>\n<h4>Child Theme Images</h4>\n<p>Theme images reside under the <code>images</code> directory in your child theme and are meant for stylesheet use only. Use the media gallery for content images. You can upload new images using the image upload form.</p>\n<h4>Child Theme Screenshot</h4>\n<p>You can upload a custom screenshot for the child theme here. The theme screenshot should be a 4:3 ratio (eg., 880px x 660px) JPG, PNG or GIF. It will be renamed &#8220;screenshot&#8221;.</p>\n<h4>Export Child Theme as Zip Archive</h4>\n<p>You can download your child theme for use on another WordPress site by clicking &#8220;Export&#8221;.</p>\n<h3>Preview and Activate</h3>\n<p><strong>IMPORTANT: Test child themes before activating!</strong></p>\n<p>Some themes (particularly commercial themes) do not correctly load parent template files or automatically load child theme stylesheets or php files.</p>\n<p><strong>In the worst cases they will break your website when you activate the child theme.</strong></p>\n<ol>\n<li>Navigate to Appearance &gt; Themes in the WordPress Admin. You will now see the new Child Theme as one of the installed Themes.</li>\n<li>Click &#8220;Live Preview&#8221; (theme customizer) below the new Child Theme to see it in action.</li>\n<li>When you are ready to take the Child Theme live, click &#8220;Activate.&#8221;</li>\n</ol>\n<p><strong>MULTISITE USERS:</strong> You must Network Enable your child theme before you can use Live Preview. Go to &#8220;Themes&#8221; in the Network Admin.</p>\n<h3>Caveats</h3>\n<ul>\n<li>Arbitrary comments are not supported. Providing a high level of flexibility for previewing and modifying custom styles requires a sophisticated parsing system. Maintaining comments that are bound to any particular element in the stylesheet is prohibitively expensive compared to the value it would add. Although we are working to include this as an option in the future, currently all comments are stripped from the child theme stylesheet code.</li>\n<li>No @keyframes or @font-face rules. Child Theme Configurator only supports @media and @import. If you need other @rules, put them in a separate stylesheet and import them into the Child Theme stylesheet.</li>\n<li>Only two-color gradients. Child Theme Configurator is powerful, but we have simplified the gradient interface. You can use any gradient you want as long as it has two colors and no intermediate stops.</li>\n<li>CSS properties are auto-discovered. Child Theme Configurator loads the properties that exist in the Parent stylesheet. You can always add new properties using the “Raw CSS” text area.</li>\n<li>Legacy gradient syntax is not supported. Child Theme Configurator does not support the MS filter gradient or legacy webkit gradient. These will continue to work if they are used in the parent theme, but will not be written to the child theme stylesheet. If there is a demand, we may add it in a future release, but most users should have upgraded by now.</li>\n</ul>\n<h3>Documentation</h3>\n<p>Go to http://www.childthemeplugin.com/</p>\n<p>Serbo-Croatian translation courtesy of Borisa Djuraskovic borisad@webhostinghub.com http://www.webhostinghub.com</p>\n<p>Copyright: (C) 2014-2018 Lilaea Media</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.6.6.zip",
    "upgrade_notice": {
        "": "<ul>\n<li>Preview class now evaluates stylesheet hooks as they fire instead of calling them again to prevent function exists errors.</li>\n<li>Tested for PHP version 7.1</li>\n<li>See changelog for details.</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/child-theme-configurator/trunk/screenshot-1.jpg?rev=3057440",
            "caption": "Parent/Child tab"
        },
        {
            "src": "https://ps.w.org/child-theme-configurator/trunk/screenshot-2.jpg?rev=3057440",
            "caption": "Parent/Child tab with parent theme menu open"
        },
        {
            "src": "https://ps.w.org/child-theme-configurator/trunk/screenshot-3.jpg?rev=3057440",
            "caption": "Query/Selector tab"
        },
        {
            "src": "https://ps.w.org/child-theme-configurator/trunk/screenshot-4.jpg?rev=3057440",
            "caption": "Property/Value tab"
        },
        {
            "src": "https://ps.w.org/child-theme-configurator/trunk/screenshot-5.jpg?rev=3057440",
            "caption": "Web Fonts tab"
        },
        {
            "src": "https://ps.w.org/child-theme-configurator/trunk/screenshot-6.jpg?rev=3057440",
            "caption": "Parent CSS tab"
        },
        {
            "src": "https://ps.w.org/child-theme-configurator/trunk/screenshot-7.jpg?rev=3057440",
            "caption": "Files tab"
        }
    ],
    "tags": {
        "child": "child",
        "child-theme": "child theme",
        "child-themes": "child themes",
        "custom-styles": "custom-styles",
        "theme": "theme"
    },
    "stable_tag": "2.6.6",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.0.1.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.1.8.zip",
        "1.1.9": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.1.9.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.2.3.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.3.5.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.4.1.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.4.5.zip",
        "1.4.5.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.4.5.1.zip",
        "1.4.5.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.4.5.2.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.4.6.zip",
        "1.4.7": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.4.7.zip",
        "1.4.8": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.4.8.zip",
        "1.4.8.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.4.8.1.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.5.2.zip",
        "1.5.2.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.5.2.1.zip",
        "1.5.2.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.5.2.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.5.3.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.5.4.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.6.2.zip",
        "1.6.2.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.6.2.1.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.6.3.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.6.5.zip",
        "1.6.5.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.6.5.1.zip",
        "1.6.5.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.6.5.2.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.0.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.2.zip",
        "1.7.2.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.2.1.zip",
        "1.7.3": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.3.zip",
        "1.7.3.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.3.1.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.4.zip",
        "1.7.4.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.4.1.zip",
        "1.7.4.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.4.2.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.5.zip",
        "1.7.5.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.5.1.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.6.zip",
        "1.7.6.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.6.1.zip",
        "1.7.7": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.7.zip",
        "1.7.8": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.8.zip",
        "1.7.9": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.9.zip",
        "1.7.9.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.1.7.9.1.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.0.5.zip",
        "2.0.6": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.0.6.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.1.2.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.2.1.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.2.2.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.2.3.zip",
        "2.2.4": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.2.4.zip",
        "2.2.4.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.2.4.1.zip",
        "2.2.5": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.2.5.zip",
        "2.2.6": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.2.6.zip",
        "2.2.7": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.2.7.zip",
        "2.2.8": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.2.8.zip",
        "2.2.8.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.2.8.1.zip",
        "2.2.9": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.2.9.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.3.0.zip",
        "2.3.0.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.3.0.1.zip",
        "2.3.0.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.3.0.2.zip",
        "2.3.0.3": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.3.0.3.zip",
        "2.3.0.4": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.3.0.4.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.4.0.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.4.1.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.4.2.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.4.3.zip",
        "2.4.4": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.4.4.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.5.0.zip",
        "2.5.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.5.1.zip",
        "2.5.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.5.2.zip",
        "2.5.3": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.5.3.zip",
        "2.5.4": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.5.4.zip",
        "2.5.5": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.5.5.zip",
        "2.5.6": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.5.6.zip",
        "2.5.8": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.5.8.zip",
        "2.5.9": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.5.9.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.6.0.zip",
        "2.6.1": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.6.1.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.6.2.zip",
        "2.6.3": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.6.3.zip",
        "2.6.4": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.6.4.zip",
        "2.6.5": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.6.5.zip",
        "2.6.6": "https://downloads.wordpress.org/plugin/child-theme-configurator.2.6.6.zip",
        "trunk": "https://downloads.wordpress.org/plugin/child-theme-configurator.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&hosted_button_id=8QE5YJ8WE96AJ",
    "banners": {
        "low": "https://ps.w.org/child-theme-configurator/assets/banner-772x250.jpg?rev=1557885",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/child-theme-configurator/assets/icon-128x128.png?rev=1557885"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 94,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "child-theme-configurator",
            "language": "es_VE",
            "version": "2.6.6",
            "updated": "2022-07-03 03:51:48",
            "package": "http://downloads.wordpress.org/translation/plugin/child-theme-configurator/2.6.6/es_VE.zip"
        },
        {
            "type": "plugin",
            "slug": "child-theme-configurator",
            "language": "es_ES",
            "version": "2.6.6",
            "updated": "2022-03-21 23:58:07",
            "package": "http://downloads.wordpress.org/translation/plugin/child-theme-configurator/2.6.6/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "child-theme-configurator",
            "language": "es_CO",
            "version": "2.6.6",
            "updated": "2022-07-03 03:53:07",
            "package": "http://downloads.wordpress.org/translation/plugin/child-theme-configurator/2.6.6/es_CO.zip"
        },
        {
            "type": "plugin",
            "slug": "child-theme-configurator",
            "language": "fr_FR",
            "version": "2.6.6",
            "updated": "2022-03-21 20:28:03",
            "package": "http://downloads.wordpress.org/translation/plugin/child-theme-configurator/2.6.6/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "child-theme-configurator",
            "language": "gl_ES",
            "version": "2.6.6",
            "updated": "2022-03-23 21:58:46",
            "package": "http://downloads.wordpress.org/translation/plugin/child-theme-configurator/2.6.6/gl_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "child-theme-configurator",
            "language": "nl_NL",
            "version": "2.6.6",
            "updated": "2024-07-21 14:39:13",
            "package": "http://downloads.wordpress.org/translation/plugin/child-theme-configurator/2.6.6/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "child-theme-configurator",
            "language": "nl_NL_formal",
            "version": "2.6.6",
            "updated": "2024-02-05 20:19:26",
            "package": "http://downloads.wordpress.org/translation/plugin/child-theme-configurator/2.6.6/nl_NL_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "child-theme-configurator",
            "language": "pl_PL",
            "version": "2.6.6",
            "updated": "2023-07-05 07:32:33",
            "package": "http://downloads.wordpress.org/translation/plugin/child-theme-configurator/2.6.6/pl_PL.zip"
        },
        {
            "type": "plugin",
            "slug": "child-theme-configurator",
            "language": "ru_RU",
            "version": "2.6.6",
            "updated": "2022-11-06 15:02:29",
            "package": "http://downloads.wordpress.org/translation/plugin/child-theme-configurator/2.6.6/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "child-theme-configurator",
            "language": "zh_TW",
            "version": "2.6.6",
            "updated": "2024-05-30 07:20:17",
            "package": "http://downloads.wordpress.org/translation/plugin/child-theme-configurator/2.6.6/zh_TW.zip"
        }
    ]
}