{
    "name": "ChinaDS – Tmall-Taobao Dropshipping for WooCommerce",
    "slug": "chinads-dropshipping-taobao-woocommerce",
    "version": "2.0.5",
    "author": "<a href=\"https://villatheme.com\">VillaTheme</a>",
    "author_profile": "https://profiles.wordpress.org/villatheme/",
    "contributors": {
        "villatheme": {
            "profile": "https://profiles.wordpress.org/villatheme/",
            "avatar": "https://secure.gravatar.com/avatar/973d0ef458adb8a3c527f196b9529909?s=96&d=monsterid&r=g",
            "display_name": "VillaTheme"
        },
        "mrt3vn": {
            "profile": "https://profiles.wordpress.org/mrt3vn/",
            "avatar": "https://secure.gravatar.com/avatar/cb8ecbc2ffe02a20ea2f5d1da26d3a22?s=96&d=monsterid&r=g",
            "display_name": "Andy Ha"
        }
    },
    "requires": "5.0",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [
        "woocommerce"
    ],
    "compatibility": [],
    "rating": 60,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 1,
        "2": 0,
        "1": 0
    },
    "num_ratings": 1,
    "support_url": "https://wordpress.org/support/plugin/chinads-dropshipping-taobao-woocommerce/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 100,
    "downloaded": 4873,
    "last_updated": "2024-05-21 4:21am GMT",
    "added": "2022-06-06",
    "homepage": "https://villatheme.com/extensions/chinads-taobao-dropshipping-for-woocommerce/",
    "sections": {
        "description": "<p><strong>Why should you choose Tmall – Taobao Dropshipping?</strong></p>\n<p>You may be familiar with dropshipping or have explored the idea of dropshipping with AliExpress. If you’re searching for a more cost-effective marketplace to supply products for your store, consider Tmall – Taobao dropshipping, often referred to as the “Chinese eBay.” Tmall – Taobao dropshipping is a renowned e-commerce platform, recognized as China’s largest online shopping destination.</p>\n<p><strong>Tmall and Taobao?</strong></p>\n<p>Tmall and Taobao boast a vast catalog of over one billion products, attracting millions of daily shoppers. Taobao and Tmall are both prominent online shopping platforms owned by the Alibaba Group.</p>\n<p>–  Taobao is a versatile platform that primarily caters to individual sellers and small businesses. It offers an extensive and diverse range of products, including unique and handmade items, and is known for its competitive prices.</p>\n<p>– Tmall, also known as Taobao Mall, targets businesses and larger retailers. It provides a premium shopping experience, featuring high-quality products and trusted brands. Tmall is recognized for its stringent product quality standards and is a preferred choice for Chinese consumers seeking authentic goods.</p>\n<p>Both platforms contribute significantly to Alibaba’s dominance in the e-commerce industry, offering distinct shopping experiences to a wide range of consumers and businesses.</p>\n<p>Why is <strong>ChinaDS – WooCommerce Tmall – Taobao Dropshipping</strong> fit for you?</p>\n<p>ChinaDS – WooCommerce Tmall and Taobao Dropshipping is a fantastic tool for getting started with dropshipping on taobao.com and tmall.com.  With just some simple steps, you can connect the Taobao page and WooCommerce store using the extension.</p>\n<p>The ChinaDS – WooCommerce Tmall and Taobao Dropshipping plugin masters importing products from taobao.com and tmall.com to WooCommerce, allowing you to save a significant amount of time migrating product data from Taobao and Tmall to WooCommerce and earn money from online businesses through Taobao dropshipping.</p>\n<blockquote>\n<p><a href=\"https://new2new.com/?item=chinads\" title=\"Demo ChinaDS – Taobao Dropshipping for WooCommerce\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"https://docs.villatheme.com/chinads-taobao-dropshipping-for-woocommerce\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/PyAWE6\" title=\"Premium Version\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://downloads.villatheme.com/?download=chinads-extension\" title=\"Download extension\" rel=\"nofollow ugc\">Download extension</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<p>Register account guide<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/kO9KxF4DNXE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Install and use<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/V0WyiJnx8IQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>Your site need use SSL certificates to connect with chrome extension</p>\n</li>\n<li>\n<p>Your permalink structure must NOT be &#8220;Plain&#8221;</p>\n</li>\n<li>\n<p>We make no guarantees about the raw information imported from Taobao provided by our plugin and will not be held liable if it is not accurate, complete, or up to date, or if it does not otherwise satisfy your specific needs. All risks regarding to raw information and the material may not be excepted and will not be our responsibility.</p>\n</li>\n<li>\n<p>There may be instances when information provided through the plugin contains typographical mistakes, inaccuracies, or omissions come from Taobao such as product descriptions, promotions, offers, pricing, shipping fee, availability, and delivery timeframes. Apart from official laws require, we make no commitment to correct, update, alter, or clarify such material.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES</h3>\n<p>&#9658; <strong>Connect Taobao, Tmall and WooCommerce store</strong>: You can connect these 2 platforms WooCommerce and Taobao using the ChinaDS – WooCommerce Taobao Dropshipping extension.</p>\n<p>&#9658; <strong>Import Tmall and Taobao products with ChinaDS – WooCommerce Taobao Dropshipping</strong>: allows you to import products from Taobao and Tmall to your WooCommerce store on the Taobao or Tmall single product pages.</p>\n<p>&#9658; <strong>Configure rules for all imported products</strong>:</p>\n<p>You can set general rules for all imported products in the product setting.</p>\n<ul>\n<li>\n<p><strong>Language for translation</strong>: Support converting to the site’s language, just choose your site’s language in the list.</p>\n</li>\n<li>\n<p><strong>Global product attributes</strong>: By default, the variations of variable products imported from Taobao are custom attributes. If you want to convert these variations to global attributes, enable the Convert to global attributes option.</p>\n</li>\n<li>\n<p><strong>Products Status</strong>: Choose a default status of the imported product after they are imported to WooCommerce. The product status of the imported products can be automatically set: As publish, Pending, or Draft.</p>\n</li>\n<li>\n<p><strong>Catalog visibility</strong>: This setting determines which shop pages products will be listed on.</p>\n</li>\n<li>\n<p><strong>Product description</strong>: Select to display product description and/or item specifics or not show this info in the imported product.</p>\n</li>\n<li>\n<p><strong>Import description images</strong>: Enable this option to allow importing images in the product description if they are available.</p>\n</li>\n<li>\n<p><strong>Default select product images</strong>: Enable it, the First image will be selected as the product image, and other images (except images from the product description) are selected in the gallery when adding the product to the import list.</p>\n</li>\n<li>\n<p><strong>Disable background process</strong>: When importing products, instead of letting their images download in the background, the main product image will be downloaded directly, gallery and variation images (if any) will be added to Failed images pages so that you can go there to download them manually.</p>\n</li>\n<li>\n<p><strong>Default categories</strong>: Fill in the category titles, imported products will be added to these categories.</p>\n</li>\n<li>\n<p><strong>Default product tags</strong>: Fill in the tag titles, imported products will be added to these tags.</p>\n</li>\n<li>\n<p><strong>Default shipping class</strong>: The shipping class chosen here will also be selected by default in the Import list.</p>\n</li>\n<li>\n<p><strong>Product variations is visible on product page</strong>: Enable to make variations of imported products visible on the product page.</p>\n</li>\n<li>\n<p><strong>Manage stock</strong>: Enable to manage stocks and import product inventories. if you disable this option, the product stock status will be set to “Instock” and product inventory will not be imported.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Set up rules for the price of all products</strong>:</p>\n<p>These rules will apply in the Import list section before migrating into your WooCommerce store.</p>\n<ul>\n<li>\n<p><strong>Exchange rate</strong>: Taobao’s product prices are defined in CNY (¥), if you want to convert to your country’s currency or another currency, let’s configure the exchange rate.</p>\n</li>\n<li>\n<p><strong>Setup product price rule</strong> for multi-quantity ranges. In particular, you can set a quantity range respectively with an action type.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Product overriding</strong>: The feature helps you save time to replace an imported product with a new product on Taobao. There are rules for you to choose which product properties remain or remove when overriding a product.</p>\n<p>&#9658; <strong>Manage Tmall and Taobao products in the Import List</strong>: This section allows customizations for all individual products before importing them to WooCommerce products.</p>\n<p>&#9658; <strong>Manage Tmall and Taobao products in Imported</strong>: quickly observe Tmall and Taobao products that are imported to WooCommerce products, and also do product overriding products</p>\n<h3>PRO VERSION</h3>\n<ul>\n<li>\n<p><strong>All features from the free version</strong>: All your settings/imported products/product overriding are remained after upgrading</p>\n</li>\n<li>\n<p><strong>Import products from category page</strong></p>\n</li>\n<li>\n<p><strong>Product video</strong>: This plugin supports importing product video, you can configure the options in the Product video tab to import videos, customize and display videos.</p>\n</li>\n<li>\n<p><strong>Product splitting</strong>: This feature allows splitting variations of a variable product into single products. Particularly, you can split into single products with a number of variations available in an attribute or assign a certain variation to split.</p>\n</li>\n<li>\n<p><strong>Product sync</strong>: Product Sync allows you to update the price and quantity of imported products on your WooCommerce store whenever these values change on the Taobao store. Go to the Product Sync tab to configure the relevant options.</p>\n</li>\n<li>\n<p><strong>Fulfill the orders to Taobao</strong>: A separated page to manage all your AliExpress orders where you can bulk fulfill orders or fulfill orders with extension</p>\n</li>\n</ul>\n<p><a href=\"https://1.envato.market/PyAWE6\" rel=\"nofollow ugc\">GET PRO VERSION</a> or <a href=\"https://1.envato.market/PyAWE6\" rel=\"nofollow ugc\">http://codecanyon.net/item/chinads-woocommerce-taobao-dropshipping/48291170</a></p>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Customers can order and pay before it&#8217;s intended release date to guarantee a copy.</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Documentation</h3>\n<p>&#9658; <a href=\"https://docs.villatheme.com/?item=chinads-taobao-dropshipping-for-woocommerce\" rel=\"nofollow ugc\">Getting Started</a></p>\n<h3>Plugin Links</h3>\n<p>&#9658; <a href=\"https://villatheme.com\" rel=\"nofollow ugc\">Project Page</a><br />\n&#9658; <a href=\"https://docs.villatheme.com/chinads-taobao-dropshipping-for-woocommerce\" rel=\"nofollow ugc\">Documentation</a><br />\n&#9658; <a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></p>\n",
        "installation": "<ol>\n<li>Unzip the download package</li>\n<li>Upload <code>chinads-taobao-dropshipping-for-woocommerce</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "changelog": "<p>/<strong>2.0.5 &#8211; 2024.05.20</strong>/<br />\n– Updated: Update support class</p>\n<p>/<strong>2.0.4 &#8211; 2024.04.13</strong>/<br />\n– Updated: Compatible with WP 6.5 and  WC 8.7<br />\n– Updated: Update support class</p>\n<p>/<strong>2.0.2 &#8211; 2023.09.27</strong>/<br />\n&#8211; Updated: Premium version url</p>\n<p>/<strong>2.0.1 &#8211; 2023.09.26</strong>/<br />\n&#8211; Added: Premium version url</p>\n<p>/<strong>2.0.0 &#8211; 2023.09.13</strong>/<br />\n– Updated: Move Taobao product to new table</p>\n<p>/<strong>1.0.3 &#8211; 2023.04.29</strong>/<br />\n&#8211; Fix: Load textdomain</p>\n<p>/<strong>1.0.2 &#8211; 2022.12.08</strong>/<br />\n&#8211; Fix: Enqueue scripts</p>\n<p>/<strong>1.0.1 &#8211; 2022.08.29</strong>/<br />\n&#8211; Update: Add register account video guide</p>\n<p>/<strong>1.0.0 &#8211; 2022.06.06</strong>/<br />\n~ The first released.</p>\n"
    },
    "short_description": "Transfer data from Taobao products to WooCommerce effortlessly.",
    "description": "<p><strong>Why should you choose Tmall – Taobao Dropshipping?</strong></p>\n<p>You may be familiar with dropshipping or have explored the idea of dropshipping with AliExpress. If you’re searching for a more cost-effective marketplace to supply products for your store, consider Tmall – Taobao dropshipping, often referred to as the “Chinese eBay.” Tmall – Taobao dropshipping is a renowned e-commerce platform, recognized as China’s largest online shopping destination.</p>\n<p><strong>Tmall and Taobao?</strong></p>\n<p>Tmall and Taobao boast a vast catalog of over one billion products, attracting millions of daily shoppers. Taobao and Tmall are both prominent online shopping platforms owned by the Alibaba Group.</p>\n<p>–  Taobao is a versatile platform that primarily caters to individual sellers and small businesses. It offers an extensive and diverse range of products, including unique and handmade items, and is known for its competitive prices.</p>\n<p>– Tmall, also known as Taobao Mall, targets businesses and larger retailers. It provides a premium shopping experience, featuring high-quality products and trusted brands. Tmall is recognized for its stringent product quality standards and is a preferred choice for Chinese consumers seeking authentic goods.</p>\n<p>Both platforms contribute significantly to Alibaba’s dominance in the e-commerce industry, offering distinct shopping experiences to a wide range of consumers and businesses.</p>\n<p>Why is <strong>ChinaDS – WooCommerce Tmall – Taobao Dropshipping</strong> fit for you?</p>\n<p>ChinaDS – WooCommerce Tmall and Taobao Dropshipping is a fantastic tool for getting started with dropshipping on taobao.com and tmall.com.  With just some simple steps, you can connect the Taobao page and WooCommerce store using the extension.</p>\n<p>The ChinaDS – WooCommerce Tmall and Taobao Dropshipping plugin masters importing products from taobao.com and tmall.com to WooCommerce, allowing you to save a significant amount of time migrating product data from Taobao and Tmall to WooCommerce and earn money from online businesses through Taobao dropshipping.</p>\n<blockquote>\n<p><a href=\"https://new2new.com/?item=chinads\" title=\"Demo ChinaDS – Taobao Dropshipping for WooCommerce\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"https://docs.villatheme.com/chinads-taobao-dropshipping-for-woocommerce\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/PyAWE6\" title=\"Premium Version\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://downloads.villatheme.com/?download=chinads-extension\" title=\"Download extension\" rel=\"nofollow ugc\">Download extension</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<p>Register account guide<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/kO9KxF4DNXE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Install and use<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/V0WyiJnx8IQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>Your site need use SSL certificates to connect with chrome extension</p>\n</li>\n<li>\n<p>Your permalink structure must NOT be &#8220;Plain&#8221;</p>\n</li>\n<li>\n<p>We make no guarantees about the raw information imported from Taobao provided by our plugin and will not be held liable if it is not accurate, complete, or up to date, or if it does not otherwise satisfy your specific needs. All risks regarding to raw information and the material may not be excepted and will not be our responsibility.</p>\n</li>\n<li>\n<p>There may be instances when information provided through the plugin contains typographical mistakes, inaccuracies, or omissions come from Taobao such as product descriptions, promotions, offers, pricing, shipping fee, availability, and delivery timeframes. Apart from official laws require, we make no commitment to correct, update, alter, or clarify such material.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES</h3>\n<p>&#9658; <strong>Connect Taobao, Tmall and WooCommerce store</strong>: You can connect these 2 platforms WooCommerce and Taobao using the ChinaDS – WooCommerce Taobao Dropshipping extension.</p>\n<p>&#9658; <strong>Import Tmall and Taobao products with ChinaDS – WooCommerce Taobao Dropshipping</strong>: allows you to import products from Taobao and Tmall to your WooCommerce store on the Taobao or Tmall single product pages.</p>\n<p>&#9658; <strong>Configure rules for all imported products</strong>:</p>\n<p>You can set general rules for all imported products in the product setting.</p>\n<ul>\n<li>\n<p><strong>Language for translation</strong>: Support converting to the site’s language, just choose your site’s language in the list.</p>\n</li>\n<li>\n<p><strong>Global product attributes</strong>: By default, the variations of variable products imported from Taobao are custom attributes. If you want to convert these variations to global attributes, enable the Convert to global attributes option.</p>\n</li>\n<li>\n<p><strong>Products Status</strong>: Choose a default status of the imported product after they are imported to WooCommerce. The product status of the imported products can be automatically set: As publish, Pending, or Draft.</p>\n</li>\n<li>\n<p><strong>Catalog visibility</strong>: This setting determines which shop pages products will be listed on.</p>\n</li>\n<li>\n<p><strong>Product description</strong>: Select to display product description and/or item specifics or not show this info in the imported product.</p>\n</li>\n<li>\n<p><strong>Import description images</strong>: Enable this option to allow importing images in the product description if they are available.</p>\n</li>\n<li>\n<p><strong>Default select product images</strong>: Enable it, the First image will be selected as the product image, and other images (except images from the product description) are selected in the gallery when adding the product to the import list.</p>\n</li>\n<li>\n<p><strong>Disable background process</strong>: When importing products, instead of letting their images download in the background, the main product image will be downloaded directly, gallery and variation images (if any) will be added to Failed images pages so that you can go there to download them manually.</p>\n</li>\n<li>\n<p><strong>Default categories</strong>: Fill in the category titles, imported products will be added to these categories.</p>\n</li>\n<li>\n<p><strong>Default product tags</strong>: Fill in the tag titles, imported products will be added to these tags.</p>\n</li>\n<li>\n<p><strong>Default shipping class</strong>: The shipping class chosen here will also be selected by default in the Import list.</p>\n</li>\n<li>\n<p><strong>Product variations is visible on product page</strong>: Enable to make variations of imported products visible on the product page.</p>\n</li>\n<li>\n<p><strong>Manage stock</strong>: Enable to manage stocks and import product inventories. if you disable this option, the product stock status will be set to “Instock” and product inventory will not be imported.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Set up rules for the price of all products</strong>:</p>\n<p>These rules will apply in the Import list section before migrating into your WooCommerce store.</p>\n<ul>\n<li>\n<p><strong>Exchange rate</strong>: Taobao’s product prices are defined in CNY (¥), if you want to convert to your country’s currency or another currency, let’s configure the exchange rate.</p>\n</li>\n<li>\n<p><strong>Setup product price rule</strong> for multi-quantity ranges. In particular, you can set a quantity range respectively with an action type.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Product overriding</strong>: The feature helps you save time to replace an imported product with a new product on Taobao. There are rules for you to choose which product properties remain or remove when overriding a product.</p>\n<p>&#9658; <strong>Manage Tmall and Taobao products in the Import List</strong>: This section allows customizations for all individual products before importing them to WooCommerce products.</p>\n<p>&#9658; <strong>Manage Tmall and Taobao products in Imported</strong>: quickly observe Tmall and Taobao products that are imported to WooCommerce products, and also do product overriding products</p>\n<h3>PRO VERSION</h3>\n<ul>\n<li>\n<p><strong>All features from the free version</strong>: All your settings/imported products/product overriding are remained after upgrading</p>\n</li>\n<li>\n<p><strong>Import products from category page</strong></p>\n</li>\n<li>\n<p><strong>Product video</strong>: This plugin supports importing product video, you can configure the options in the Product video tab to import videos, customize and display videos.</p>\n</li>\n<li>\n<p><strong>Product splitting</strong>: This feature allows splitting variations of a variable product into single products. Particularly, you can split into single products with a number of variations available in an attribute or assign a certain variation to split.</p>\n</li>\n<li>\n<p><strong>Product sync</strong>: Product Sync allows you to update the price and quantity of imported products on your WooCommerce store whenever these values change on the Taobao store. Go to the Product Sync tab to configure the relevant options.</p>\n</li>\n<li>\n<p><strong>Fulfill the orders to Taobao</strong>: A separated page to manage all your AliExpress orders where you can bulk fulfill orders or fulfill orders with extension</p>\n</li>\n</ul>\n<p><a href=\"https://1.envato.market/PyAWE6\" rel=\"nofollow ugc\">GET PRO VERSION</a> or <a href=\"https://1.envato.market/PyAWE6\" rel=\"nofollow ugc\">http://codecanyon.net/item/chinads-woocommerce-taobao-dropshipping/48291170</a></p>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Customers can order and pay before it&#8217;s intended release date to guarantee a copy.</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Documentation</h3>\n<p>&#9658; <a href=\"https://docs.villatheme.com/?item=chinads-taobao-dropshipping-for-woocommerce\" rel=\"nofollow ugc\">Getting Started</a></p>\n<h3>Plugin Links</h3>\n<p>&#9658; <a href=\"https://villatheme.com\" rel=\"nofollow ugc\">Project Page</a><br />\n&#9658; <a href=\"https://docs.villatheme.com/chinads-taobao-dropshipping-for-woocommerce\" rel=\"nofollow ugc\">Documentation</a><br />\n&#9658; <a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/chinads-dropshipping-taobao-woocommerce.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/chinads-dropshipping-taobao-woocommerce/assets/screenshot-1.jpg?rev=2737795",
            "caption": "Button import on taobao.com,tmall.com"
        },
        {
            "src": "https://ps.w.org/chinads-dropshipping-taobao-woocommerce/assets/screenshot-2.jpg?rev=2737795",
            "caption": "Connection between your WooCommerce Store and taobao"
        },
        {
            "src": "https://ps.w.org/chinads-dropshipping-taobao-woocommerce/assets/screenshot-3.jpg?rev=2737795",
            "caption": "List taobao products, tmall products are waitting for import"
        },
        {
            "src": "https://ps.w.org/chinads-dropshipping-taobao-woocommerce/assets/screenshot-4.jpg?rev=2737795",
            "caption": "List taobao products, tmall products are imported to WooCommerce"
        }
    ],
    "tags": {
        "dropship": "dropship",
        "taobao": "taobao",
        "taobao-dropshiping": "taobao dropshiping",
        "taobaodropship": "taobaodropship",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://www.villatheme.com/donate",
    "banners": {
        "low": "https://ps.w.org/chinads-dropshipping-taobao-woocommerce/assets/banner-772x250.jpg?rev=3080868",
        "high": "https://ps.w.org/chinads-dropshipping-taobao-woocommerce/assets/banner-1544x500.jpg?rev=3080868"
    },
    "icons": {
        "1x": "https://ps.w.org/chinads-dropshipping-taobao-woocommerce/assets/icon-128x128.gif?rev=3080868",
        "2x": "https://ps.w.org/chinads-dropshipping-taobao-woocommerce/assets/icon-256x256.gif?rev=3080868"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 60,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/chinads-dropshipping-taobao-woocommerce/blueprint.json?rev=3103875"
        }
    ],
    "preview_link": "",
    "language_packs": []
}