{
    "name": "Civist &#8211; Petitions and Fundraising",
    "slug": "civist",
    "version": "7.6.6",
    "author": "<a href=\"https://civist.com\">Civist</a>",
    "author_profile": "https://profiles.wordpress.org/civist/",
    "contributors": {
        "civist": {
            "profile": "https://profiles.wordpress.org/civist/",
            "avatar": "https://secure.gravatar.com/avatar/bc44f82b0749949bebc872a3b5d4d3c0?s=96&d=monsterid&r=g",
            "display_name": "Civist"
        }
    },
    "requires": "4.4",
    "tested": "6.6.1",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 92,
    "ratings": {
        "5": 17,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 19,
    "support_url": "https://wordpress.org/support/plugin/civist/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 22111,
    "last_updated": "2024-07-15 12:34:00",
    "added": "2017-08-09",
    "homepage": "",
    "sections": {
        "description": "<p>Create and configure your petition directly in your own WordPress. Publish them in a page or post and you are ready to go! Your supporters sign the petition right there, embedded in your website.</p>\n<p>Just add a donation form to your petitions to collect SEPA and credit card donations in compliance with EU legislation.</p>\n<p>With Civist, you manage your supporters directly in WordPress. Contacts are automatically saved in your mailing list manager. Simple!</p>\n<p>Export your contacts and signatures as CSV-files for further processing.</p>\n",
        "installation": "<p>The easiest way of installing the Civist WordPress plugin is to use the built in plugin search of WordPress. Just search for Civist and click the &#8220;Install Now&#8221; button.</p>\n<p>Downloading the plugin and installing it from the ZIP-file is another option. You can always find the current version at <a href=\"https://wordpress.org/plugins/civist/\" rel=\"ugc\">WordPress Plugin Directory</a>. To install it:</p>\n<ul>\n<li>Download the <a href=\"https://downloads.wordpress.org/plugin/civist.zip\" rel=\"nofollow ugc\">ZIP file</a></li>\n<li>Go to the &#8220;Plugins&#8221; menu in the WordPress dashboard</li>\n<li>Upload the civist.zip file</li>\n<li>Activate the plugin</li>\n</ul>\n",
        "changelog": "<h3>Release 7.6.6 – 2024-07-15 &#8211; Update recommended</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>The plugin is ready for WordPress 6.6</li>\n</ul>\n<h4>Bug Fixes</h4>\n<ul>\n<li>Fixed: The Civist Gutenberg blocks did not work in WordPress 6.6</li>\n</ul>\n<h3>Release 7.6.5 &#8211; 2024-03-05</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>The plugin is ready for WordPress 6.4</li>\n<li>Petitions and donation forms are now available in Turkish / Türkçe (TR)</li>\n<li>Verification emails are now available in Turkish / Türkçe (TR)</li>\n</ul>\n<h3>Release 7.6.1 – 2023-08-24</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>The plugin is ready for WordPress 6.3</li>\n<li>Petitions and donation forms are now available in Svenska (SV)</li>\n<li>Verification emails are now available in Svenska (SV)</li>\n</ul>\n<h3>Release 7.6.0 – 2023-03-27</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>The plugin is ready for WordPress 6.2</li>\n<li>Four new currencies are now available in the currency selection of the donation form: Czech Koruna (CZK), Hungarian Forint (HUF), Romanian Leu (RON), South African Rand (ZAR)</li>\n</ul>\n<h4>Bug Fixes</h4>\n<ul>\n<li>Fixed: The link to the help page on the Civist dashboard led to a 404 page when users used Civist with the German language set in WordPress.</li>\n<li>Fixed: Under certain circumstances, the support widget built into the Civist plugin would not load and display at the bottom right of the screen.</li>\n</ul>\n<h3>Release 7.5.4 &#8211; 2022-09-06</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>Some translations got an update</li>\n</ul>\n<h4>Bug Fixes</h4>\n<ul>\n<li>A bug was fixed that prevented the country field of the donation form from opening when using the Safari browser on macOS or iOS.</li>\n</ul>\n<h3>Release 7.5.0 – 2022-05-24</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>The plugin is ready for WordPress 6.0</li>\n<li>Petitions and donation forms are now available in Lithuanian (LT)</li>\n<li>Verification emails are now available in Lithuanian (LT)</li>\n</ul>\n<h3>Release 7.4.0</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>The plugin is ready for WordPress 5.9</li>\n<li>Updated Civist dashboard</li>\n</ul>\n<h4>Privacy</h4>\n<ul>\n<li>Updated list of sub-processors in the Privacy Policy of the plugin</li>\n</ul>\n<h3>Release 7.3.12</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>The plugin is ready for WordPress 5.8</li>\n<li>Technical improvements to increase the plugin&#8217;s performance</li>\n<li>Verification emails are now available in French and Polish</li>\n<li>Some translations got an update and new ones were added</li>\n<li>UX improvements</li>\n</ul>\n<h4>Bug Fixes</h4>\n<ul>\n<li>A bug was fixed that caused incorrect values of linked petitions to be displayed in the list of donation forms</li>\n<li>A link on the Civist dashboard was added (&#8220;Rate this plugin&#8221;)</li>\n<li>A link on the Civist dashboard was fixed (&#8220;Learn more about online activism with Civist&#8221;)</li>\n</ul>\n<h3>Release 7.3.0 &#8211; 2020-11-03</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>Fundraising registration now has distinct choices for &#8220;Company&#8221; and &#8220;Nonprofit&#8221; instead of the previously used generic &#8220;Organisation&#8221;, which reduces the likelihood of the identity verification performed by Stripe to fail. Nonprofit organisations who already registered for fundraising with the &#8220;Organisation&#8221; setting should reach out to our support.</li>\n<li>Confirmation emails for petitions are now available in french.</li>\n</ul>\n<h4>Bug Fixes</h4>\n<ul>\n<li>A layout problem on the Civist dashboard in the WordPress admin on WordPress 5.5 was fixed.</li>\n</ul>\n<h3>Release 7.2.0 &#8211; 2020-06-24</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>[Closed Beta] Petitions can now be configured to have an initials field.</li>\n<li>Some missing translations were added.</li>\n</ul>\n<h4>Bug Fixes</h4>\n<ul>\n<li>A bug was fixed that caused an error while signing a petition due to a technical incompatibility with the plugin &#8220;Instant Articles for WP&#8221;.</li>\n</ul>\n<h3>Release 7.1.1 &#8211; 2020-04-07</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>Petitions and donation forms are now available in Croatian (HR).</li>\n</ul>\n<h3>Release 7.1.0 – 2020-03-27</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>The fundraising setup and account settings are now using pages provided by Stripe for collecting personal and business information</li>\n</ul>\n<h4>Removed Features</h4>\n<ul>\n<li>Fundraising is no longer available for users based in Malaysia (MY).</li>\n</ul>\n<h3>Release 7.0.5 &#8211; 2020-03-17</h3>\n<h4>Bug Fixes</h4>\n<ul>\n<li>A bug was fixed that caused radio buttons&#8217; outline to appear cropped.</li>\n</ul>\n<h3>Release 7.0.2 &#8211; 2020-01-10</h3>\n<h4>Bug Fixes</h4>\n<ul>\n<li>A bug was fixed that caused fundraising registration to fail for some countries.</li>\n</ul>\n<h3>Release 7.0.0 &#8211; 2019-09-11 &#8211; Update highly recommended</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>The fundraising feature is now compliant with the new EU regulations for financial transactions (PSD2/SCA).</li>\n<li>The fundraising feature now supports additional countries:\n<ul>\n<li>Estonia (EE)</li>\n<li>Greece (GR)</li>\n<li>Latvia (LV)</li>\n<li>Lithuania (LT)</li>\n<li>Malaysia (MY)</li>\n<li>Poland (PL)</li>\n<li>Slovakia (SK)</li>\n<li>Slovenia (SI)</li>\n</ul>\n</li>\n<li>All translations got an update and some new were added.</li>\n</ul>\n<h4>Removed Features</h4>\n<ul>\n<li>Customers in the Czech Republic cannot register for fundraising anymore.</li>\n</ul>\n<h4>Bug Fixes</h4>\n<ul>\n<li>A bug was fixed that caused the cursor to jump to the first field of the next available payment method in a donation form while pressing the tabulator key in the last field of the actual used payment method.</li>\n<li>A bug was fixed that caused notifications in the petition and donation forms to not be fully visible.</li>\n<li>A bug was fixed that made it impossible to set the start or end time of a petition.</li>\n</ul>\n<h3>Release 6.9.0 &#8211; 2019-07-25</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>Preparing the plugin for upcoming changes in EU regulations for financial transactions (PSD2/SCA).</li>\n<li>Petitions and donation forms are now available in Romanian (RO).</li>\n<li>Spanish translations got an update and some new were added.</li>\n</ul>\n<h4>Bug Fixes</h4>\n<ul>\n<li>A bug was fixed that caused an error while signing a petition in very rare cases.</li>\n<li>Minor fixes for visual problems of the donation form.</li>\n<li>The donation form shows the amount correctly in a donation form.</li>\n<li>Using the arrow keys in edge to change the amount no longer causes the value changes to be lost when leaving the field.</li>\n</ul>\n<h3>Release 6.8.0 &#8211; 2019-05-22</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>Mailchimp is now available as a mailing list provider</li>\n<li>The Civist Plugin is now available in Spanish (ES)</li>\n</ul>\n<h3>Release 6.7.0 &#8211; 2019-04-25</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>EU and US customers can now collect donations from supporters in Austria, Belgium, Germany, Italy, Netherlands and Spain with the new payment service KLARNA Pay now (SOFORT).</li>\n<li>The donation table in the Civist supporter overview now shows the address of the donor for all payment methods that ask for it.</li>\n<li>A new Civist block for the Gutenberg editor was released. This block makes available four different styling options for your petition forms and new alignment possibilities for all forms.</li>\n</ul>\n<h4>Bug Fixes</h4>\n<ul>\n<li>A bug was fixed that made it impossible to sign the petition form without reloading it in some rare cases.</li>\n</ul>\n<h3>Release 6.6.0 &#8211; 2019-04-15</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>EU and US customers can now collect donations from their supporters with P24, a payment service from Poland.</li>\n<li>Petitions and donation forms are now available in English (GB)</li>\n</ul>\n<h4>Bug Fixes</h4>\n<ul>\n<li>The shortcode creation after updating a donation form would show a blank screen in some cases</li>\n<li>Navigating away from the donation form edit page after updating it would show a blank screen in some cases</li>\n</ul>\n<h3>Release 6.5.0 &#8211; 2019-04-10</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>You can now collect donations from your supporters with Multibanco, a payment service from Portugal.</li>\n</ul>\n<h3>Release 6.4.2 &#8211; 2019-04-04</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>Improved synchronisation with Mailjet mailing lists</li>\n<li>[Closed Beta] Improved handling of contact fields for mailing list management with CleverReach</li>\n</ul>\n<h3>Release 6.4.1 &#8211; 2019-03-20</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>Petitions and donation forms are now available in Norsk Bokmål (NB).</li>\n</ul>\n<h3>Release 6.4.0 &#8211; 2019-03-11 &#8211; Update recommended</h3>\n<h4>Feature Additions</h4>\n<ul>\n<li>[Closed Beta] The Civist Widget got a new &#8220;Kiosk Mode&#8221; that makes it possible to use the petition form for collecting signatures in public places.</li>\n</ul>\n<h4>Bug Fixes</h4>\n<ul>\n<li>The petition form shows the error message for invalid email addresses again.</li>\n<li>The value of the donation amount is set to zero if the field is cleared.</li>\n<li>The signature table in the supporter overview shows 25 signatures per page again, instead of one.</li>\n</ul>\n<h4>Bug Fixes</h4>\n<ul>\n<li>The donation form shortcode creation after updating the donation form would show a blank screen in some cases</li>\n<li>Navigating away from the donation form edit page would show a blank screen in some cases</li>\n</ul>\n<h3>v6.3.0</h3>\n<ul>\n<li>The plugin is ready for WordPress 5.1</li>\n<li>Fundraising is now available in 22 countries, including the US, CA, AU, NZ, CH, HK, SG</li>\n<li>Donation forms got shorter and have a drastically improved user experience</li>\n<li>Better localisations and translations for all supported countries</li>\n</ul>\n<h3>v6.2.3</h3>\n<ul>\n<li>Petitions and donation forms are now available in Czech</li>\n</ul>\n<h3>v6.2.0</h3>\n<ul>\n<li>Supporters overview tables UI Improvements for a better experience on smaller screens</li>\n<li>Petitions can now be configured to hide the &#8220;Sign this petition. Become a supporter.&#8221; text</li>\n<li>Petition&#8217;s organisation field is now optional and placed after the name fields</li>\n<li>Translations and wording improvements</li>\n<li>Fixed an issue where changing payment methods for a donation form would make the preview stop working</li>\n<li>Fixed an issue where Chrome autocomplete would overlay the country and nationality fields</li>\n</ul>\n<h3>v6.1.0</h3>\n<ul>\n<li>Petitions can now be configured to have an organisation name field</li>\n<li>Petitions can now be configured to have a phone number field</li>\n<li>The petition&#8217;s comment field is now available to everyone</li>\n<li>Some UI issues were fixed in the donations table</li>\n<li>In the supporter&#8217;s detailed view, the petition&#8217;s link was fixed</li>\n<li>The petition&#8217;s progress bar now respects the configured language</li>\n</ul>\n<h3>v6.0.0</h3>\n<ul>\n<li>Petitions and donation forms can now be embedded using WordPress&#8217;s new Block Editor and Gutenberg plugin</li>\n</ul>\n<h3>v5.3.0</h3>\n<ul>\n<li>CleverReach is now available as a mailing list provider in a closed beta</li>\n<li>Petitions can now be configured to have an optional comment field</li>\n<li>Improved status indication for identity verification with Stripe fundraising</li>\n<li>A bug causing the list of supporters to be empty when there are more than 25 supporters on Edge 17 was fixed</li>\n<li>A bug causing several tables to be empty after changing filters on Edge 17 was fixed</li>\n</ul>\n<h3>v5.2.0</h3>\n<ul>\n<li>Petitions and donation forms are now available in English (United States)</li>\n<li>Improved setup and configuration of Civist Fundraising</li>\n</ul>\n<h3>v5.1.2</h3>\n<ul>\n<li>A bug preventing changing pages in tables is now fixed</li>\n</ul>\n<h3>v5.1.0</h3>\n<ul>\n<li>Petitions and donation forms can now optionally be configured to use a specific supported language instead of automatically choosing the language based on the browser settings.</li>\n</ul>\n<h3>v5.0.3</h3>\n<ul>\n<li>Civist plugin now requires PHP version 5.6 or newer</li>\n<li>New and improved setup flow for Civist Fundraising</li>\n<li>Stripe is now available as a Payment Service for Civist Fundraising as a closed beta</li>\n<li>The list of all collected donations is now directly accessible from the Civist dashboard</li>\n<li>Improved shortcode creation for a Petition or Donation form</li>\n<li>Improved live updates of the petition progress bar</li>\n<li>Improved handling of the Escape key inside the country field in the petition and donation forms</li>\n<li>Improved tooltips on touch devices</li>\n<li>Improved accessibility for the petition and donation forms</li>\n<li>A bug preventing the petition to load after clicking the confirmation link in rare cases is now fixed</li>\n<li>A bug preventing Safari users from signing a petition while surfing in private mode is now fixed</li>\n</ul>\n<h3>v4.5.17</h3>\n<ul>\n<li>Petitions and donation forms are now available in Slovak</li>\n<li>Improved compatibility with uncommon encoding configurations</li>\n</ul>\n<h3>v4.5.11</h3>\n<ul>\n<li>Fixed an issue where users using Safari with the latest iOS version were unable to sign a petition</li>\n</ul>\n<h3>v4.5.10</h3>\n<ul>\n<li>You can now find GDPR related information in the plugin settings</li>\n<li>Prepare plugin for Civist v5.0.0</li>\n</ul>\n<h3>v4.5.9</h3>\n<ul>\n<li>Fixed a compatibility issue with some older PHP versions</li>\n</ul>\n<h3>v4.5.8</h3>\n<ul>\n<li>Prepare plugin for Civist v5.0.0</li>\n</ul>\n<h3>v4.5.6</h3>\n<ul>\n<li>Fixed an issue that prevented the plugin from working with some WordPress database configurations</li>\n</ul>\n<h3>v4.5.3</h3>\n<ul>\n<li>Fixed an issue where signing a petition would fail with some WordPress themes</li>\n</ul>\n<h3>v4.5.1</h3>\n<ul>\n<li>Petitions and donation forms now available in Korean</li>\n<li>Fixed an issue where the goal and progress bar of a petition would be visible when a goal for the petition wasn&#8217;t defined</li>\n<li>Fixed an issue that would prevent removing a previously configured goal for a petition</li>\n</ul>\n<h3>v4.5.0</h3>\n<ul>\n<li>You can now insert petitions and donation forms into a post or page using a shortcode</li>\n</ul>\n<h3>v4.4.3</h3>\n<ul>\n<li>Fixed a bug where clicking the Civist button in the post/page editor would do nothing in Internet Explorer 11</li>\n<li>Fixed a bug where embedding a petition or donation form into a post or page would fail in Internet Explorer 11</li>\n<li>Fixed a compatibility issue with some plugins that use Webpack</li>\n</ul>\n<h3>v4.4.2</h3>\n<ul>\n<li>Fixed a bug that, in certain cases, had prevented supporters from signing a petition, making a donation, or subscribing</li>\n</ul>\n<h3>v4.4.0</h3>\n<ul>\n<li>Country fields now get pre-filled with the user&#8217;s location on petitions and donation forms</li>\n<li>Fixed a bug while editing a petition or donation form that prevented the preview to update after a previously assigned cover image was removed</li>\n<li>Fixed a bug that stalled the UI when an error occurred while setting up the fundraising on the WordPress plugin</li>\n</ul>\n<h3>v4.3.5</h3>\n<ul>\n<li>Fix compatibility issue with WordPress 4.9</li>\n</ul>\n<h3>v4.2.9</h3>\n<ul>\n<li>Fix theme incompatibility issue that would prevent a supporter from signing or donating</li>\n<li>Fix issue where exported signees/subscribers would not be filtered by petition</li>\n<li>Add missing translation</li>\n</ul>\n<h3>v4.2.8</h3>\n<ul>\n<li>Fixed an issue where inserting petitions and donation forms was not possible if WordPress was not installed on the site root</li>\n<li>Fixed an UI issue in the insert petition dialog for some specific screen sizes</li>\n<li>UX improvements</li>\n</ul>\n<h3>v4.2.0</h3>\n<ul>\n<li>Searchable list of all donations now available in the plugin&#8217;s supporter management section</li>\n<li>Donation forms can now be embedded directly into a page or post (independently from a petition)</li>\n<li>Donation edit screen now has a list of all petitions that the donation form is associated with</li>\n<li>Petition lists display the associated donation form of a petition</li>\n<li>Petition lists can be filtered by associated donation forms</li>\n<li>Petitions and donation forms translated to Dutch, French, Italian, Catalan, Basque and Polish</li>\n<li>Reconnect function for trouble shouting problems with plugin settings</li>\n<li>Minor UI improvements</li>\n</ul>\n<h3>v4.1.3</h3>\n<ul>\n<li>Mailjet Integration: bug fix for newsletter subscriptions</li>\n</ul>\n<h3>v4.1.2</h3>\n<ul>\n<li>Translations: German petition and fundraising forms use &#8220;Sie&#8221; instead of &#8220;Du&#8221;</li>\n</ul>\n<h3>v4.1.1</h3>\n<ul>\n<li>Update translations</li>\n</ul>\n<h3>v4.1.0</h3>\n<ul>\n<li>New feature: save newsletter subscribers directly to your Mailjet contact lists</li>\n</ul>\n<h3>v4.0.3</h3>\n<ul>\n<li>Petition and donation forms in Spanish and Portuguese</li>\n</ul>\n<h3>v4.0.2</h3>\n<ul>\n<li>Improve compatibility with other plugins</li>\n<li>UX improvements</li>\n</ul>\n<h3>v4.0.1</h3>\n<ul>\n<li>Fix &#8220;connection lost&#8221; issue when registering with Civist</li>\n</ul>\n<h3>v4.0.0</h3>\n<ul>\n<li>The initial release (petitions, SEPA / CC fundraising and supporter management)</li>\n</ul>\n"
    },
    "short_description": "With Civist you create petitions directly in WordPress, raise funds and build strong supporter networks.",
    "description": "<p>Create and configure your petition directly in your own WordPress. Publish them in a page or post and you are ready to go! Your supporters sign the petition right there, embedded in your website.</p>\n<p>Just add a donation form to your petitions to collect SEPA and credit card donations in compliance with EU legislation.</p>\n<p>With Civist, you manage your supporters directly in WordPress. Contacts are automatically saved in your mailing list manager. Simple!</p>\n<p>Export your contacts and signatures as CSV-files for further processing.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/civist.zip",
    "upgrade_notice": {
        "": "<p>We recommend that you always use the latest version of Civist to omit any problems for you and your supporters.</p>"
    },
    "screenshots": [],
    "tags": {
        "activism": "activism",
        "donation": "donation",
        "fundraising": "fundraising",
        "petition": "petition"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/civist/assets/banner-772x250.png?rev=1711459",
        "high": "https://ps.w.org/civist/assets/banner-1544x500.png?rev=1711459"
    },
    "icons": {
        "1x": "https://ps.w.org/civist/assets/icon.svg?rev=1711459",
        "svg": "https://ps.w.org/civist/assets/icon.svg?rev=1711459"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 92,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "civist",
            "language": "en_GB",
            "version": "7.6.6",
            "updated": "2019-02-16 00:51:02",
            "package": "http://downloads.wordpress.org/translation/plugin/civist/7.6.6/en_GB.zip"
        },
        {
            "type": "plugin",
            "slug": "civist",
            "language": "en_CA",
            "version": "7.6.6",
            "updated": "2019-02-20 01:44:57",
            "package": "http://downloads.wordpress.org/translation/plugin/civist/7.6.6/en_CA.zip"
        },
        {
            "type": "plugin",
            "slug": "civist",
            "language": "en_AU",
            "version": "7.6.6",
            "updated": "2019-02-19 18:03:11",
            "package": "http://downloads.wordpress.org/translation/plugin/civist/7.6.6/en_AU.zip"
        },
        {
            "type": "plugin",
            "slug": "civist",
            "language": "es_ES",
            "version": "7.6.6",
            "updated": "2019-01-24 18:12:58",
            "package": "http://downloads.wordpress.org/translation/plugin/civist/7.6.6/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "civist",
            "language": "nl_BE",
            "version": "7.6.6",
            "updated": "2022-09-30 13:30:30",
            "package": "http://downloads.wordpress.org/translation/plugin/civist/7.6.6/nl_BE.zip"
        },
        {
            "type": "plugin",
            "slug": "civist",
            "language": "nl_NL",
            "version": "7.6.6",
            "updated": "2019-12-06 11:31:46",
            "package": "http://downloads.wordpress.org/translation/plugin/civist/7.6.6/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "civist",
            "language": "ro_RO",
            "version": "7.6.6",
            "updated": "2024-02-29 14:24:55",
            "package": "http://downloads.wordpress.org/translation/plugin/civist/7.6.6/ro_RO.zip"
        }
    ]
}