{
    "name": "Classified Listing – Classified ads &amp; Business Directory Plugin",
    "slug": "classified-listing",
    "version": "3.1.7",
    "author": "<a href=\"https://radiustheme.com\">RadiusTheme</a>",
    "author_profile": "https://profiles.wordpress.org/techlabpro1/",
    "contributors": {
        "techlabpro1": {
            "profile": "https://profiles.wordpress.org/techlabpro1/",
            "avatar": "https://secure.gravatar.com/avatar/f2aa611890a071ea507b74848a91b1d5?s=96&d=monsterid&r=g",
            "display_name": "RadiusTheme"
        }
    },
    "requires": "5.6",
    "tested": "6.6.1",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 96,
    "ratings": {
        "5": 73,
        "4": 3,
        "3": 2,
        "2": 1,
        "1": 2
    },
    "num_ratings": 81,
    "support_url": "https://wordpress.org/support/plugin/classified-listing/",
    "support_threads": 25,
    "support_threads_resolved": 23,
    "active_installs": 10000,
    "downloaded": 404349,
    "last_updated": "2024-08-26 6:57am GMT",
    "added": "2018-08-29",
    "homepage": "https://radiustheme.com/demo/wordpress/classified",
    "sections": {
        "description": "<p><a href=\"https://www.radiustheme.com/downloads/classified-listing-pro-wordpress/\" rel=\"nofollow ugc\">Classified Listing</a> classified ads Business Directory plugin comes with all the features necessary for building a classified listing website. This classified ads WordPress plugin boasts a plethora of backend admin settings and an excellent frontend posting management system. It lets you create as many ad listing categories as you want so that each ad listing page will be as clean as possible.</p>\n<p>👉 <a href=\"https://radiustheme.net/publicdemo/classified-listing/\" rel=\"nofollow ugc\">Demo</a> | <a href=\"https://www.radiustheme.com/docs/classified-listing/\" rel=\"nofollow ugc\">Documentation</a> | <a href=\"https://www.radiustheme.com/classified-listing-addons/\" rel=\"nofollow ugc\">Extensions</a> | <a href=\"https://radiustheme.com/classified-listing-roadmaps/\" rel=\"nofollow ugc\">RoadMaps</a> |<a href=\"https://www.radiustheme.com/downloads/classified-listing-pro-wordpress/?utm_source=WordPress&amp;utm_medium=Listing&amp;utm_campaign=pro_click'\" rel=\"nofollow ugc\">Get Pro</a> 👈</p>\n<h3>🏆 Demo access of Classified ads Plugin</h3>\n<blockquote>\n<p>URL: <a href=\"https://radiustheme.net/publicdemo/classified-listing/\" rel=\"nofollow ugc\">Demo</a><br />\n  username: demo || password: demo</p>\n</blockquote>\n<h3>Classified ads Plugin for WordPress</h3>\n<p>Classified ads &amp; Business Directory WordPress Plugin can use to create a Classified ads, Business Directory and Members Directory website easily. This plugin has both Elementor and Gutenberg blocks so you can build the classified site easily with the default Gutenberg block editor and most popular Elementor page builder.</p>\n<h3>🔥 Free Classified WordPress Theme 🔥</h3>\n<blockquote>\n<p><a href=\"https://www.radiustheme.com/downloads/clclassified-classified-ads-wordpress-theme/\" rel=\"nofollow ugc\">CLClassified – Free Classified WordPress Theme</a></p>\n</blockquote>\n<h3>🔥 Free Directory WordPress Theme 🔥</h3>\n<blockquote>\n<p><a href=\"https://www.radiustheme.com/downloads/radius-directory-directory-wordpress-theme/\" rel=\"nofollow ugc\">RadiusDirectory – Free Directory WordPress Theme</a></p>\n</blockquote>\n<h3>Classified ads Premium Themes</h3>\n<ul>\n<li>\n<p><a href=\"https://1.envato.market/2944O\" rel=\"nofollow ugc\">Classima – Classified Ads WordPress Theme using Classified Listing Pro &amp; Store plugin</a></p>\n</li>\n<li>\n<p><a href=\"https://1.envato.market/e4YKZ1\" rel=\"nofollow ugc\">Listygo – Directory &amp; Listing WordPress Theme using Classified Listing Pro &amp; Store Plugin</a></p>\n</li>\n<li>\n<p><a href=\"https://www.radiustheme.com/downloads/classilist-classified-ads-wordpress-theme/\" rel=\"nofollow ugc\">ClassiList – Classified ads WordPress Theme using Classified Listing Pro &amp; Store plugin</a></p>\n</li>\n<li>\n<p><a href=\"https://www.radiustheme.com/classified-listing-mobile-apps/\" rel=\"nofollow ugc\">Mobile App – Classified ads iOS &amp; Android mobile app</a></p>\n</li>\n</ul>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/RiXdDGk_XCU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>🏆 WordPress Business Directory Plugin:</h3>\n<p>This WordPress Business Directory plugin makes it incredibly easy to build a business directory website. The price fields can be controlled from the front end so that users can add prices, price ranges or leave out prices for their listings. We included business hours as well as social profile features on the listing submission page.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/main-settings/general-settings/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Business Hours for Business Directory</h3>\n<p>The Business Hours allows you to set the hours of operation for your business. This feature is very important for Business Directory website. You can set the hours for each day of the week, and you can also set special hours for holidays.</p>\n<h3>🏆 Social Profile for Business Directory</h3>\n<p>User can add there social profiles in there directory listing. There are many social profiles that can be used for directory listings. The most popular ones are LinkedIn, Facebook, and Twitter.</p>\n<h3>🏆 UNLIMITED CUSTOM FIELDS</h3>\n<p>You can create unlimited custom fields and set them category-wise. Alternatively, you can create groups and fields under these groups.</p>\n<ul>\n<li>Text Box</li>\n<li>Text Area</li>\n<li>URL</li>\n<li>Number</li>\n<li>Select</li>\n<li>Radio</li>\n<li>Checkbox</li>\n<li><strong>Date &amp; Date Range [Pro]</strong></li>\n</ul>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/LTnCkt5K64M?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Classified Listing plugin offers extensive admin control over the fields that your pages will display in the listing page of all your ads. What’s more, you’ll also have control over the fields visible in the detail view of the ads. It is in each detail page of your ads that you will have the main descriptions. With Classified Listing Pro, you can display the custom fields in the list view. Your custom fields will even appear in the search filters if you want.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/listing-management-admin/custom-fields/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 User Friendly</h3>\n<p>Classified Listing is crafted to provide the possible user experience to all users, including the admins, buyers, and sellers of ad listings. All your users will enjoy a smooth interface on any device since this plugin is fully responsive. This classified listing WordPress plugin makes your elements look great on all devices, whether they’re using desktops, tablets, or mobile phones.</p>\n<p>Classified Listing supports the use of maps to showcase the location of listings. Whether you prefer Google Maps, this plugin has you covered. What’s more, it comes with a radius search function, which makes such searches more straightforward.</p>\n<h3>🏆 Search and Filter Functions</h3>\n<p>The search and filter functions of this plugin are incredibly powerful. The Ajax search and filter functions accommodate multiple search options. You can even filter your search results by custom fields, category, location, and price. The Ajax autocomplete function that makes the search process even smoother. The premium version of Classified Listing has the radius search function, which enables users to find listing items near them.</p>\n<h3>Review from WordPress Community expert Darrel Wilson</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/kt4Sbb1fkL8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>🏆 Frontend User Dashboard Options</h3>\n<p>Each of your users can control their own data and listings from your website’s front end. Users can manage their own ad listings by editing, deleting, and promoting them. Classified Listing allows them to manage the ads they want to be their favorites.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/listing-management-front-end/my-account-menu/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Admin Ad Control Options</h3>\n<p>This classified ads WordPress plugin gives the site admin immense control over various elements and features. Since it grants you Permalink control over links in your listing detail page, you can easily modify the links you want.</p>\n<p>Images play a significant part in an ad listing website; having control over them ensures that they remain your protagonist. With Classified Listing, the admin has control over the maximum number of images that can be used in each listing. With this classified ads, WordPress plugin enables you to set a maximum image size threshold for image uploads. The sizes of images on your gallery and thumbnails are also in your control.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/main-settings/moderation/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Ad Control</h3>\n<p>This classified ads WordPress plugin gives you a choice between automatic and manual approval of your listings. On the other hand, manually approving listings help screen ads in detail before posting them.</p>\n<p>With Classified Listing, you will have immense control over the ad listings. You can set the number of days for which a listing should last before being removed. This ad directory WordPress plugin allows you to set the threshold of days within when a listing will be marked as ‘new’ and given prominence.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/main-settings/moderation/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Location</h3>\n<p>With Classified Listing, you can set up to a maximum of 3 location levels. The default location types include state, city, and tow; however, you can set your own custom levels.</p>\n<p>This classified listing WordPress plugin lets you import location. The import option for locations is via CSV; therefore, you can import bulk location data easily.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/listing-management-admin/locations/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Payment Options</h3>\n<p>The payment options on your site should depend mainly on your location and that of your users. You can receive payments on your site via</p>\n<ul>\n<li>Offline methods</li>\n<li><a href=\"https://www.paypal.com/\" rel=\"nofollow ugc\">PayPal</a> payment system</li>\n<li><a href=\"https://www.authorize.net/\" rel=\"nofollow ugc\">Authorize.net</a> [PRO]</li>\n<li><a href=\"https://stripe.com/\" rel=\"nofollow ugc\">Stripe</a> [PRO]</li>\n<li>WooCommerce payment system [PRO]</li>\n</ul>\n<h3>🏆 Earning From Your Listings</h3>\n<p>You can make money from posting ads where users pay for each ad or for ad promotions, such as</p>\n<ul>\n<li><strong>Featured ads –</strong> Featured ads highlighted with a special background color so this ads get<br />\nmore view</li>\n<li><strong>Pay Per Ads –</strong> You can set pay per ad option so after post ads user need to pay.</li>\n<li><strong>Top ads [Pro] –</strong> Top ads display top of archive page and search page with a special highlighted color so this ads get mote view</li>\n<li><strong>Bumpup ads [Pro] –</strong> Bumpup ads changes the ads data daily so it show top of list in archive page and search page.</li>\n<li><strong>Membership [Pro]:</strong> Classified Listing comes with the Store and Membership addon, which allows you to enable membership packages for sellers. You can offer an ad promotion option along with the membership packages.</li>\n</ul>\n<h3>🏆 Elementor Addon</h3>\n<p>This Classified ads and Business Directory plugin has multiple Elementor addons to display ads in different layouts. The Pro version support archive builder also single ads builder. Sp you can easily arrange the archive page and single ads page how your want the ads will display.</p>\n<h3>🏆 GutenBerg Blocks</h3>\n<p>This Classifieds ads plugins has multiple Gutenberg blocks. So you can easily use the block in WordPress default Gutenberg builder.</p>\n<h3>🏆 Email Notification Options</h3>\n<p><strong>Admin Notifications</strong><br />\nClassified Listing – Classified ads WordPress plugin gives you complete control over the email notifications that you receive.</p>\n<ul>\n<li>New Listings Submission</li>\n<li>Listing Edited</li>\n<li>Listing Expired</li>\n<li>Order Created</li>\n<li>Payment Received/ Order Completed</li>\n<li>Contact message is sent to a Listing owner</li>\n</ul>\n<p>You will receive email notifications each time an order is created for a listing. The plugin will also ensure that you’re notified when you receive a payment or upon the completion of an order. When a contact message is sent to the owner of a listing, you will also receive a notification.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/main-settings/email-settings/general-settings-email/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 User Notification</h3>\n<p>With Classified Listing, your users can receive various email notifications as they interact with you, your site, and other users. Sellers of ad listings will be notified of any communication that comes from you and other users. Every time a listing submission is successful, they will be notified when it’s approved and upon its publishing. User get following email notifications</p>\n<ul>\n<li>Listing Submission</li>\n<li>Listing approved/ Published</li>\n<li>Listing about to expire (reached renewal email threshold)</li>\n<li>Listing expired</li>\n<li>Listing expired &amp; reached renewal reminder email threshold</li>\n<li>Order Created</li>\n<li>Order Completed</li>\n</ul>\n<p>Classified Listing notifies users when their listings are about to expire and have reached their renewal email threshold. It also notifies them when a listing has expired and when it has expired and reached the threshold for a renewal reminder email. As the admin is notified about order creation and completion, the users are also notified.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/main-settings/email-settings/general-settings-email/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Multiple GoogleMap Option</h3>\n<p>Location search is one of most important feature for Directory website as well as Classified ads website. Classified as plugin has multiple GoogleMap source. We included both Google GoogleMap and Open Street GoogleMap.</p>\n<p><strong>Google GoogleMap and Location</strong><br />\nThis Classified ads and directory plugin enables the display of Google Maps in the ad detail views. You can showcase Google Locations using Google place API.</p>\n<p><strong>OpenStreetMap</strong><br />\nOpenStreet GoogleMap is a free platform to display location and use the map features.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/main-settings/misc-settings/#google-map\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Radius Search</h3>\n<p>This plugin allows radius searches using Google place API &amp; OpenStreet GoogleMap so that users can search for listings close to them.</p>\n<h3>🏆 Ad Publishing Control</h3>\n<p>Classified Listing – Business directory plugin allows you to choose whether you want ads to pass by you for approval or have them automatically approved and published by the system. If you choose to approve ads manually, you will have to publish them yourself after that. The users will be notified upon approval and publishing anyway—the same control applies when users edit their listings. You can allow them to publish them automatically after editing or approve them manually yourself.</p>\n<h3>🏆 Widgets and Shortcodes</h3>\n<p>Classified Listing is a widget-ready plugin. It works seamlessly with any widgets that your site already has. What’s more, it comes with some widgets of its own. You’ll have 4 widgets for categories, filters, listings, and the search function. Support following 4 widgets</p>\n<ul>\n<li>Classified Listing – Categories</li>\n<li>Classified Listing – Filter</li>\n<li>Classified Listing – Listings</li>\n<li>Classified Listing – Search</li>\n</ul>\n<p>This directory WordPress plugin is also shortcode-ready. If you’re already using shortcodes on your website, you should find it incredibly easy to handle the ones that come with Classified Listing. Among the shortcodes that come with it include one for use on the ‘my account’ page, checkout page, and a few others.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/shortcodes/my-account-page/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Translatability</h3>\n<p>Classified Listing is fully translatable. However, it comes with a ready translation for Spanish. Still, you can translate it into whichever language you want using simple WordPress translation plugins, such as Loco Translate and the WPML plugin.</p>\n<h3>🏆 Some Pro Features</h3>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/classified-listing-store-membership-addon-for-wordpress/\" rel=\"nofollow ugc\">Store &amp; Membership Addon</a>:</strong> You can utilize the Store and Membership Addon to let ad sellers open stores within your website so that all their ads can appear within their own stores. The membership options also allow you to let sellers become members in different packages. You can have them displaying free ads, give them some categories at no charge, or have them pay for other categories. You can set memberships to go with paid categories and allow members to do ad promotions.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/classified-listing-elementor-builder/\" rel=\"nofollow ugc\">Elementor Builder Addon</a>:</strong> You can easily customize the listing archive page and single page using drag &amp; drop in Elementor page builder.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/classified-listing-mobile-no-verification/\" rel=\"nofollow ugc\">Mobile No Verification Addon</a>:</strong> Mobile number verification is an OTP( One time password ) based security addon for Classified Listing Pro. This addon helps verify a real user by sending an OTP verification code during registration, login, and contact form submissions. Sometimes spammers added listings and tricks the buyer.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/classified-listing-multi-currency-addon/\" rel=\"nofollow ugc\">MultiCurrency Addon</a>:</strong> Make your business experience hassle free with the Classified Listing – Multi Currency add-ons. It is a convenient add-on for Classified Ads and the business directory WordPress plugin.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/razorpay-payment-addon-for-classified-listing/\" rel=\"nofollow ugc\">Razorpay Payment Addon</a>:</strong> Razorpay Payment one of popular payment gateway in India. So from India site owner can easily receive payment via Razorpay Payment.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/docs/listing-management-admin/custom-fields/#conditional-fields\" rel=\"nofollow ugc\">Custom Conditional FieldList</a>:</strong> You can create conditional fields. For instance, when you have car make, model, and year of release, the model depends on the make, while the year depends on the model.</p>\n<p>👉 <strong>MAP View:</strong> The PRO version allows GoogleMap View using Google place API &amp; OpenStreet GoogleMap. You can display your ads with GoogleMap. So that your can easily view the ads location wise in MAP.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/docs/faqs/enable-mark-as-sold/\" rel=\"nofollow ugc\">Mark As Sold</a>:</strong> If any items are sold out, but you feel the need to keep them active on the site for SEO purposes, you can mark them as sold. In this case, such ads will show in the front end, but communication on them will be disabled.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/docs/main-settings/chat-settings/\" rel=\"nofollow ugc\">Live chat</a>:</strong> Another important feature is communication between sellers and buyers via live chat. This eliminates the need for sharing contact information. They can communicate via live chat about the ad items.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/docs/faqs/how-to-add-compare/\" rel=\"nofollow ugc\">Quick View &amp; Compare</a>:</strong> The PRO version facilitates quick view, enabling users to view brief details of ad listings without going to the ad details. They can even compare ad listings quickly for differences in prices and other details easily.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/classified-listing-multilingual-addon/\" rel=\"nofollow ugc\">WPML addon</a>:</strong> If you want a multilingual website, you can get it quickly since the pro version supports WPML. For translation, you may need WPML Plugin and our WPML addon. By WPML plugin and Our WPML addon you can translate all ads, category, locations, custom fields.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/classima-classified-ads-android-app/\" rel=\"nofollow ugc\">Mobile APP</a>:</strong> If you want to build mobile app for your classified ads or directory then you need the Pro version of the plugin, By using the Pro version you can build both Android &amp; IOS apps.</p>\n<h3>Need Any Help?</h3>\n<ul>\n<li>For any bug, support or suggestion please submit your ticket <a href=\"https://www.radiustheme.com/ticket-support/\" rel=\"nofollow ugc\">here</a>.</li>\n</ul>\n<h3>Liked RadiusTheme</h3>\n<ul>\n<li>Join our <a href=\"https://www.facebook.com/groups/radiustheme\" rel=\"nofollow ugc\">Facebook Group</a>.</li>\n<li>Learn from our tutorials on <a href=\"https://www.youtube.com/@RadiusTheme\" rel=\"nofollow ugc\">YouTube Channel</a>.</li>\n</ul>\n<h3>🔥 WHAT’S NEXT</h3>\n<p>If you like The Post Grid Plugin, then consider checking out our other WordPress Plugins:</p>\n<ul>\n<li>\n<p><a href=\"https://wordpress.org/plugins/the-post-grid/\" rel=\"ugc\">The Post Grid</a> – Shortcode, Gutenberg Blocks and Elementor Addon for Post Grid.</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/plugins/woo-product-variation-swatches/\" rel=\"ugc\">Variation Swatches</a> &#8211; Woocommerce Variation Swatches plugin converts the product variation select fields into radio, images, colors, and labels.</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/plugins/woo-product-variation-gallery/\" rel=\"ugc\">Variation Gallery</a> &#8211; Woocommerce Variation Gallery plugin allows to add UNLIMITED additional images for each variation of product.</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/plugins/shopbuilder/\" rel=\"ugc\">ShopBuilder</a> &#8211; Elementor WooCommerce Builder Addons with 84+ widgets and 10+ modules.</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/plugins/tlp-food-menu/\" rel=\"ugc\">Food Menu</a> – Restaurant Menu &amp; Online Ordering using WooCommerce.</p>\n</li>\n</ul>\n<h3>Translation</h3>\n<ul>\n<li>Español by <a href=\"https://wordpress.org/support/users/4aiur/\" rel=\"ugc\">4aiur</a></li>\n</ul>\n",
        "installation": "<h4>Using The WordPress Dashboard</h4>\n<ol>\n<li>Navigate to the &#8216;Add New&#8217; in the plugins dashboard</li>\n<li>Search for &#8216;Classified Listing&#8217;</li>\n<li>Click &#8216;Install Now&#8217;</li>\n<li>Activate the plugin on the Plugin dashboard</li>\n</ol>\n<h4>Uploading in WordPress Dashboard</h4>\n<ol>\n<li>Navigate to the &#8216;Add New&#8217; in the plugins dashboard</li>\n<li>Navigate to the &#8216;Upload&#8217; area</li>\n<li>Select <code>classified-listing.zip</code> from your computer</li>\n<li>Click &#8216;Install Now&#8217;</li>\n<li>Activate the plugin in the Plugin dashboard</li>\n</ol>\n<h4>Using FTP</h4>\n<ol>\n<li>Download <code>classified-listing.zip</code></li>\n<li>Extract the <code>classified-listing</code> directory to your computer</li>\n<li>Upload the <code>classified-listing</code> directory to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin in the Plugin dashboard</li>\n</ol>\n",
        "faq": "\n<dt id='is%20this%20classified%20ads%20plugin%20allow%20front%20end%20submission%3F'>\nIs this Classified ads plugin allow front end submission?\n</h4>\n<p>\n<ul>\n<li>Yes ads can be submitted from front end.</li>\n</ul>\n</p>\n<dt id='is%20user%20submit%20listing%20free%3F'>\nIs user submit listing free?\n</h4>\n<p>\n<ul>\n<li>Yes we have settings if you want full free or pay for featured listing can enable that.</li>\n</ul>\n</p>\n<dt id='can%20i%20make%20renew%20from%20ad%20listing%3F'>\nCan I make renew from ad listing?\n</h4>\n<p>\n<ul>\n<li>Yes can enable payment for featured listing.</li>\n</ul>\n</p>\n<dt id='is%20this%20plugin%20has%20custom%20fields%3F'>\nIs this plugin has custom fields?\n</h4>\n<p>\n<ul>\n<li>Yes unlimited custom fields can created and set as category wise?</li>\n</ul>\n</p>\n<dt id='is%20this%20plugin%20allow%20nested%20category%3F'>\nIs this plugin allow nested category?\n</h4>\n<p>\n<ul>\n<li>Yes</li>\n</ul>\n</p>\n<dt id='is%20this%20plugin%20allow%20country%20-%20city%20-%20state%3F'>\nIs this plugin allow Country &#8211; City &#8211; State?\n</h4>\n<p>\n<ul>\n<li>Yes it support 3 level of location you can the level as your need.</li>\n</ul>\n</p>\n<dt id='is%20admin%20end%20email%20notification%3F'>\nIs admin end email notification?\n</h4>\n<p>\n<ul>\n<li>Yes we have different setting so admin get notification for different action.</li>\n</ul>\n</p>\n<dt id='can%20admin%20send%20email%20notification%20to%20ad%20posting%3F'>\nCan admin send email notification to ad posting?\n</h4>\n<p>\n<ul>\n<li>Yes admin can send email notification to ad poster.</li>\n</ul>\n</p>\n<dt id='is%20listing%20auto%20approve%3F'>\nIs listing auto approve?\n</h4>\n<p>\n<ul>\n<li>We have settings if you want to approve or manual approve you can change it.</li>\n</ul>\n</p>\n<dt id='can%20i%20change%20email%20notification%20text%3F'>\nCan I change email notification text?\n</h4>\n<p>\n<ul>\n<li>Yes all email notification text can changeable from admin end.</li>\n</ul>\n</p>\n\n",
        "changelog": "<h4>3.1.7 ( Aug 26, 2024 )</h4>\n<ul>\n<li>Fixed: Hide custom field menu for form builder from admin menu</li>\n<li>Added: From builder: Icon feature to from, section, fields, options (Dropdown, Checkbox, Radio) </li>\n<li>Added: Default FormBuilder enable for first installation </li>\n<li>Added: Demo importer compatibility</li>\n</ul>\n<h4>3.1.6 ( Aug 16, 2024 )</h4>\n<ul>\n<li>Fixed: Email header responsive issue</li>\n<li>Fixed: Form Builder &#8211; Email required issue</li>\n<li>Added: Form Builder &#8211; Multi currency support</li>\n<li>Added: Form Builder &#8211; support WPML form title field</li>\n<li>Added: Form Builder &#8211; Support Classified Listing Multilingual</li>\n<li>Added: BridgeCore Plugin Support</li>\n<li>Added: Tax feature at billing</li>\n</ul>\n<h4>3.1.5 ( Jul 29, 2024 )</h4>\n<ul>\n<li>Fixed: Booking field added at Form builder</li>\n<li>Fixed: Image edit option at form builder </li>\n</ul>\n<h4>3.1.4 ( Jul 10, 2024 )</h4>\n<ul>\n<li>Fixed: Form builder unknown order index issue </li>\n<li>Fixed: Form builder file field required</li>\n<li>Fixed: Form builder WPML translation issue at frontend</li>\n<li>Fixed: User related other fields default value issue</li>\n<li>Fixed: Field Placeholder text </li>\n<li>Fixed: Form builder issue with preset field not display </li>\n<li>Fixed: Form builder After remove filed need to remove from preset immediate</li>\n<li>Fixed: Elementor builder Error (Post Type Check) </li>\n<li>Added: New HOOK added <code>wp_rtcl_session_allow_guest_user</code> </li>\n</ul>\n<h4>3.1.3 ( Jul 02, 2024 )</h4>\n<ul>\n<li>Added: Form builder custom field display order</li>\n<li>Fixed: Ajax filter price range step issue</li>\n<li>Fixed: Controller Query array index not found   </li>\n<li>Fixed: Email template translation issue</li>\n<li>Added: Hook for upload directory disable</li>\n<li>Fixed: responsive status color issue</li>\n<li>Fixed: Post id not found issue</li>\n<li>Fixed: Email footer css issue</li>\n<li>Fixed: Admin end Dialog popup window css issue</li>\n<li>Update: Ajax filter template security</li>\n</ul>\n<h4>3.1.2 ( Jun 13, 2024 )</h4>\n<ul>\n<li>Fixed: Webp feature image set issue</li>\n<li>Fixed: Astra theme pagination issue</li>\n<li>Fixed: String translation issue</li>\n<li>Fixed: Form builder admin end notification overlap</li>\n<li>Fixed: Form builder Textarea line break and html issue</li>\n<li>Fixed: Author listing issue</li>\n<li>Fixed: Ajax Filter taxonomy selection issue at tax archive page</li>\n<li>Added: Ajax Filter scroll to top at pagination</li>\n<li>Updated: Ajax Filter more less option</li>\n</ul>\n<h4>3.1.1 ( Jun 05, 2024 )</h4>\n<ul>\n<li>Fixed: Listing action View load issue</li>\n<li>Fixed: Reports style issue</li>\n<li>Updated: Theme addon list</li>\n</ul>\n<h4>3.1.0 ( Jun 03, 2024 )</h4>\n<ul>\n<li>Added: Add some hook</li>\n<li>Added: Statistic Report revenue </li>\n<li>Added: Dynamic ajax filter widget</li>\n<li>Fixed: Pagination</li>\n<li>Added: Add some hook</li>\n<li>Fixed: Listing status issue</li>\n<li>Fixed: Update some template files</li>\n</ul>\n<h4>3.0.12 ( April 23, 2024 )</h4>\n<ul>\n<li>Fixed: Listing title escaping issue at email</li>\n<li>Fixed: Listing showcase addon description limit issue</li>\n</ul>\n<h4>3.0.11 ( April 19, 2024 )</h4>\n<ul>\n<li>Fixed: Listing contact form visibility issue for owner</li>\n<li>Fixed: Report Abuse – Set Reply-To as Reporter name and email</li>\n<li>Fixed: Images not shown in search results</li>\n<li>Fixed: Promotion description in order details email template</li>\n<li>Fixed: Filter widget query parameter issue at taxonomy link</li>\n<li>Fixed: Email html escaping issue</li>\n<li>Fixed: Email log folder write permission</li>\n<li>Fixed: Html escaping issue at Import menu</li>\n<li>Added: Capability check at the rtcl_fb_gallery_image_delete AJAX action </li>\n</ul>\n<h4>3.0.10.3 ( April 13, 2024 )</h4>\n<ul>\n<li>Fixed: Password reset issue</li>\n<li>Fixed: Image edit issue</li>\n</ul>\n<h4>3.0.10.2 ( April 09, 2024 )</h4>\n<ul>\n<li>Fixed: Add new listing Location selection issue</li>\n</ul>\n<h4>3.0.10.1 ( April 08, 2024 )</h4>\n<ul>\n<li>Fixed: Add new listing Admin end Category selection issue</li>\n</ul>\n<h4>3.0.10 ( April 07, 2024 )</h4>\n<ul>\n<li>Fixed: Posting new listing issue</li>\n<li>Fixed: Html escaping issue</li>\n</ul>\n<h4>3.0.9 ( April 07, 2024 )</h4>\n<ul>\n<li>Fixed: Vulnerability Security issue fixed</li>\n</ul>\n<h4>3.0.8 ( April 04, 2024 )</h4>\n<ul>\n<li>Fixed: Taxonomy rendering issue</li>\n<li>Fixed: Draft -&gt; Published – No email being sent</li>\n</ul>\n<h4>3.0.7 ( April 03, 2024 )</h4>\n<ul>\n<li>Fixed: Payment history HTML escaping issue </li>\n<li>Fixed: Email HTML escaping issue</li>\n<li>Fixed: Overall HTML escaping issue</li>\n</ul>\n<h4>3.0.6 ( April 02, 2024 )</h4>\n<ul>\n<li>Fixed: Publish button issue at admin edit page</li>\n<li>Fixed: Email localized problem</li>\n</ul>\n<h4>3.0.5 ( April 01, 2024 )</h4>\n<ul>\n<li>Fixed: Fix business hour Edit issue</li>\n<li>Fixed: Vulnerability issue fixed</li>\n<li>Fixed: Business hours update</li>\n<li>Updated: Security updated</li>\n</ul>\n<h4>3.0.4 ( March 15, 2024 )</h4>\n<ul>\n<li>Fixed: Form builder Open state map error at edit screen</li>\n<li>Fixed: Multiple image upload create temp post</li>\n<li>Fixed: PHP Notice: Function wpdb::prepare was called incorrectly.</li>\n</ul>\n<h4>3.0.3 ( February 22, 2024 )</h4>\n<ul>\n<li>Fixed: Pay per ad pending listing publish issue</li>\n<li>Fixed: Category disappear issue after promotion</li>\n</ul>\n<h4>3.0.2 ( February 21, 2024 )</h4>\n<ul>\n<li>Fixed: MAP render issue on listing form</li>\n<li>Fixed: PHP 8 compatibility issue</li>\n<li>Fixed: Custom checkbox fields issue</li>\n<li>Fixed: Title and breadcrumb issue</li>\n<li>Fixed: Zero payment gateway selection issue</li>\n<li>Added: Option to publish promotion listing automatically</li>\n<li>Added: Ad type sortable</li>\n<li>Added: Listing RSS feed</li>\n</ul>\n<h4>3.0.2 ( February 07, 2024 )</h4>\n<ul>\n<li>Fixed: Admin end from builder issue</li>\n<li>Added: From builder Function</li>\n</ul>\n<h4>3.0.0 ( January 31, 2024 )</h4>\n<ul>\n<li>Added: Listing Form Builder</li>\n<li>Updated: Settings</li>\n<li>Updated: User profile</li>\n<li>Fixed: Favourite listings pagination issue</li>\n<li>Fixed: Payment pagination issue</li>\n<li>Fixed: Pagination issue during filter</li>\n</ul>\n<h4>2.6.7 ( January 04, 2024 )</h4>\n<ul>\n<li>Fixed: My-listings pagination issue</li>\n<li>Fixed: Gallery popup sequence issue</li>\n<li>Fixed: Gallery image edit/delete issue on mobile</li>\n<li>Fixed: Listings page password protected issue</li>\n<li>Fixed: Price range search issue</li>\n<li>Fixed: Dashboard listing count issue</li>\n<li>Fixed: Payment history date issue</li>\n<li>Updated: My-listings design</li>\n<li>Added: Telegram contact number</li>\n</ul>\n<h4>2.6.6 ( November 28, 2023 )</h4>\n<ul>\n<li>Fixed: Listing count issue</li>\n<li>Fixed: Gutenberg category block hide empty issue</li>\n<li>Fixed: Expires, Business hour text translate issue</li>\n<li>Fixed: Listing search form slug translation issue</li>\n<li>Updated: Twitter icon</li>\n<li>Added: TikTok social profile</li>\n</ul>\n<h4>2.6.5 ( November 21, 2023 )</h4>\n<ul>\n<li>Fixed: Permission issue to edit/delete listing at my-listings</li>\n</ul>\n<h4>2.6.4 ( November 20, 2023 )</h4>\n<ul>\n<li>Fixed: Add to favourite text issue</li>\n<li>Fixed: Zero pricing offline payment issue</li>\n<li>Fixed: Bootstrap script issue on My-account</li>\n<li>Fixed: My-account different template set issue</li>\n<li>Fixed: Remove force offline payment if amount is 0</li>\n</ul>\n<h4>2.6.3 ( November 13, 2023 )</h4>\n<ul>\n<li>Fixed: Category, Location combine URL pagination issue</li>\n</ul>\n<h4>2.6.2 ( November 13, 2023 )</h4>\n<ul>\n<li>Updated: My-listings table information</li>\n</ul>\n<h4>2.6.1 ( November 08, 2023 )</h4>\n<ul>\n<li>Fixed: GEO query default radius issue</li>\n<li>Added: My-account backward compatibility</li>\n</ul>\n<h4>2.6.0 ( November 06, 2023 )</h4>\n<ul>\n<li>Updated: Filter query string</li>\n<li>Improved: My-account dashboard design</li>\n<li>Fixed: PHP warning</li>\n</ul>\n<h4>2.5.5.1 ( October 13, 2023 )</h4>\n<ul>\n<li>Updated: Dismissible admin notice</li>\n</ul>\n<h4>2.5.5 ( October 12, 2023 )</h4>\n<ul>\n<li>Fixed: Category and location link issue</li>\n<li>Fixed: Gallery image sorting issue on mobile</li>\n<li>Fixed: Space separate word issue in tag</li>\n<li>Fixed: Map view zoom change issue</li>\n<li>Fixed: Renew link issue in E-mail</li>\n<li>Fixed: Meta query relation issue</li>\n<li>Added: Website and WhatsApp hints text</li>\n</ul>\n<h4>2.5.4 ( September 29, 2023 )</h4>\n<ul>\n<li>Fixed: Listing form textarea line break issue</li>\n</ul>\n<h4>2.5.3 ( September 19, 2023 )</h4>\n<ul>\n<li>Fixed: Gutenberg block not working</li>\n<li>Fixed: Gutenberg block meta data not found</li>\n</ul>\n<h4>2.5.2 ( September 19, 2023 )</h4>\n<ul>\n<li>Fixed: Pricing update issue</li>\n<li>Fixed: Layout width issue</li>\n</ul>\n<h4>2.5.1 ( September 18, 2023 )</h4>\n<ul>\n<li>Added: Popular in promotion filter</li>\n<li>Update: Pricing admin options</li>\n<li>Fixed: Block preview ready</li>\n<li>Update: Block convert api version 2</li>\n</ul>\n<h4>2.5.0 ( September 05, 2023 )</h4>\n<ul>\n<li>Added: Listing Tag</li>\n</ul>\n<h4>2.4.9 ( August 24, 2023 )</h4>\n<ul>\n<li>Fixed: tinyMCE javascript uncaught error</li>\n</ul>\n<h4>2.4.8 ( August 23, 2023 )</h4>\n<ul>\n<li>Fixed: Description limit issue</li>\n<li>Fixed: Thousands separator payment settings issue</li>\n<li>Fixed: Lost password link issue</li>\n<li>Fixed: Repeater field PHP warning</li>\n<li>Added: Title &amp; Description limit counter</li>\n</ul>\n<h4>2.4.7 ( July 25, 2023 )</h4>\n<ul>\n<li>Fixed: Payment history paid date</li>\n<li>Added: Add hook for ad type membership restriction</li>\n<li>Added: Add i18n loading text at rtcl localized</li>\n<li>Added: Phone number field at contact email</li>\n<li>Update: Add nonce remove filter hook</li>\n</ul>\n<h4>2.4.6 ( July 14, 2023 )</h4>\n<ul>\n<li>Fixed: Vulnerable to Cross Site Request Forgery (CSRF) [Function: rtcl_ajax_thumbnail_delete]</li>\n<li>Fixed: username generator</li>\n<li>Fixed: Global post variable for gallery template</li>\n<li>Fixed: Date range filter issue</li>\n</ul>\n<h4>2.4.5 ( Jun 23, 2023 )</h4>\n<ul>\n<li>Fixed: Quick view issue</li>\n</ul>\n<h4>2.4.4 ( Jun 23, 2023 )</h4>\n<ul>\n<li>Fixed: Listing image alter attribute title issue</li>\n<li>Fixed: Renew email link issue when disable payment</li>\n<li>Fixed: WhatsApp label issue</li>\n<li>Added: Hook to disable popup search on click submission</li>\n<li>Added: Seller verification support in Elementor widget</li>\n<li>Added: Country empty state required issue</li>\n</ul>\n<h4>2.4.3 ( Jun 02, 2023 )</h4>\n<ul>\n<li>Fixed: Lost password URL issue</li>\n<li>Fixed: Fix some conflicted with PHP 8.2</li>\n<li>Added: Promotion sync with WPML</li>\n<li>Added: Add some Hook for extend functionality</li>\n</ul>\n<h4>2.4.2 ( May 08, 2023 )</h4>\n<ul>\n<li>Fixed: Method not found issue error log</li>\n<li>Fixed: Unregister user session error while posting new listing</li>\n</ul>\n<h4>2.4.1 ( Apr 28, 2023 )</h4>\n<ul>\n<li>Updated: Update states for Zimbabwe &amp; Saint Lucia</li>\n<li>Added: PHP 8.2 compatibility</li>\n</ul>\n<h4>2.4.0 ( Apr 06, 2023 )</h4>\n<ul>\n<li>Fixed: Security Problem Fake Account Setups</li>\n<li>Updated: Improve sanitization and escaping</li>\n<li>Added: Add query for escaping Blocked users and listings</li>\n</ul>\n<h4>2.3.11 ( Mar 22, 2023 )</h4>\n<ul>\n<li>Added: Claim compatibility</li>\n<li>Added: Phone required settings for registration form</li>\n<li>Added: Listing or User block functionality</li>\n</ul>\n<h4>2.3.10 ( Mar 22, 2023 )</h4>\n<ul>\n<li>Added: Admin note option for all users</li>\n<li>Added: Hook to show/hide email in user listing page</li>\n<li>Fixed: Elementor addon pagination issue</li>\n<li>Fixed: Custom field (textarea) html entity issue</li>\n</ul>\n<h4>2.3.9 ( Mar 01, 2023 )</h4>\n<ul>\n<li>Fixed: Billing email address issue</li>\n<li>Fixed: Custom field order issue</li>\n<li>Fixed: Waring at VStore class data retrieve</li>\n<li>Updated: Removed favourite link button class</li>\n</ul>\n<h4>2.3.8 ( Feb 10, 2023 )</h4>\n<ul>\n<li>Added: Confirm password field during registration</li>\n<li>Added: Separate option to hide name and phone field</li>\n<li>Added: Reset button to clear filter</li>\n<li>Fixed: Gallery image display issue when disable slider</li>\n<li>Fixed: Single listing map zoom issue during page scroll</li>\n</ul>\n<h4>2.3.7 ( Jan 31, 2023 )</h4>\n<ul>\n<li>Added: New user registration email settings</li>\n<li>Fixed: WooCommerce rating conflict issue</li>\n<li>Fixed: Listing Category widget issue</li>\n</ul>\n<h4>2.3.6 ( Jan 13, 2023 )</h4>\n<ul>\n<li>Added: Renew Feature</li>\n<li>Fixed: Add hook for Elementor</li>\n</ul>\n<h4>2.3.5 ( Jan 10, 2023 )</h4>\n<ul>\n<li>Fixed: Elementor deprecated notice issue</li>\n<li>Fixed: Namibian dollar symbol issue</li>\n</ul>\n<h4>2.3.4 ( Jan 02, 2023 )</h4>\n<ul>\n<li>Updated: Title and alt attribute are supported at listing images.</li>\n<li>Updated: Disable specific date for daterangepicker.</li>\n</ul>\n<h4>2.3.3 ( Dec 19, 2022 )</h4>\n<ul>\n<li>Updated: Price formatting filter hook</li>\n</ul>\n<h4>2.3.2 ( Dec 12, 2022 )</h4>\n<ul>\n<li>Fixed: Notice button vulnerability (CSRF)</li>\n</ul>\n<h4>2.3.1 ( Dec 02, 2022 )</h4>\n<ul>\n<li>Fixed: Default page creation issue</li>\n<li>Updated: WordPress Hook functionality </li>\n</ul>\n<h4>2.3.0 ( Nov 25, 2022 )</h4>\n<ul>\n<li>Added: Checkout billing information</li>\n<li>Added: Store and Pro hook for synchronization</li>\n</ul>\n<h4>2.2.25 ( Nov 18, 2022 )</h4>\n<ul>\n<li>Fixed: Post status issue after promotion</li>\n</ul>\n<h4>2.2.24 ( Nov 14, 2022 )</h4>\n<ul>\n<li>Fixed: Robots no index issue</li>\n<li>Fixed: is_page function return</li>\n</ul>\n<h4>2.2.23 ( Nov 08, 2022 )</h4>\n<ul>\n<li>Fixed: Related listing price show issue</li>\n<li>Fixed: Gutenberg dimension control break issue</li>\n</ul>\n<h4>2.2.22 ( Oct 31, 2022 )</h4>\n<ul>\n<li>Fixed: PHP error</li>\n</ul>\n<h4>2.2.21 ( Oct 24, 2022 )</h4>\n<ul>\n<li>Fixed: Price hide issue on change price type</li>\n</ul>\n<h4>2.2.20 ( Oct 05, 2022 )</h4>\n<ul>\n<li>Fixed: Sidebar responsive issue</li>\n<li>Fixed: WhatsApp icon color issue</li>\n<li>Fixed: Conditional custom field issue</li>\n</ul>\n<h4>2.2.19 ( Sep 21, 2022 )</h4>\n<ul>\n<li>Fixed: Responsive issue with Divi theme</li>\n<li>Added: Webp format support for gallery image</li>\n</ul>\n<h4>2.2.18 ( Sep 13, 2022 )</h4>\n<ul>\n<li>Added: Updated Static multi currency compatibility</li>\n</ul>\n<h4>2.2.17 ( Sep 12, 2022 )</h4>\n<ul>\n<li>Added: Add Multi Currency static support functionality</li>\n<li>Fixed: WPML translation issue at payment history page</li>\n</ul>\n<h4>2.2.16 ( Aug 24, 2022 )</h4>\n<ul>\n<li>Fixed: PHP fatal error</li>\n</ul>\n<h4>2.2.15 ( Aug 17, 2022 )</h4>\n<ul>\n<li>Added: Settings to separate registration page</li>\n<li>Fixed: Cache clear error issue</li>\n</ul>\n<h4>2.2.14 ( Aug 12, 2022 )</h4>\n<ul>\n<li>Fixed: Session error log</li>\n<li>Fixed: Single listing sidebar spacing issue</li>\n<li>Updated: Security &amp; sanitization</li>\n<li>Updated: Coupon addon compatibility</li>\n</ul>\n<h4>2.2.13 ( July 25, 2022 )</h4>\n<ul>\n<li>Added: Coupon addon compatibility</li>\n<li>Improved: Query optimize and Performance update</li>\n</ul>\n<h4>2.2.12 ( July 18, 2022 )</h4>\n<ul>\n<li>Fixed: Theme support conflict issue with elementor</li>\n</ul>\n<h4>2.2.11 ( July 15, 2022 )</h4>\n<ul>\n<li>Fixed: Child category hide issue in Listing Category Box elementor addon</li>\n</ul>\n<h4>2.2.10 ( July 06, 2022 )</h4>\n<ul>\n<li>Fixed: Business Hour time issue</li>\n</ul>\n<h4>2.2.9 ( Jun 29, 2022 )</h4>\n<ul>\n<li>Added: &#8216;No Listing Found&#8217; text change option in Elementor</li>\n<li>Added: Website field hints</li>\n<li>Added: Compatibility to disable default WP registration</li>\n<li>Added: Seller Verification addon compatibility</li>\n</ul>\n<h4>2.2.8 ( Jun 15, 2022 )</h4>\n<ul>\n<li>Added: Listing link with name as WhatsApp default message</li>\n</ul>\n<h4>2.2.7 ( Jun 10, 2022 )</h4>\n<ul>\n<li>Fixed: WhatsApp preview thumbnail issue</li>\n<li>Fixed: Session table cleanup using cron</li>\n<li>Added: Telegram in listing social share</li>\n<li>Added: Sidebar for listing archive and details page</li>\n<li>Added: BuddyBoss integration compatibility</li>\n</ul>\n<h4>2.2.6 ( May 30, 2022 )</h4>\n<ul>\n<li>Fixed: HTML span tag issue in location</li>\n<li>Fixed: Button text change issue in checkout page</li>\n<li>Added: Search by listing ID and payment ID</li>\n</ul>\n<h4>2.2.5.1 ( May 20, 2022 )</h4>\n<ul>\n<li>Added: Mobile Number Verification addon compatibility [Pro]</li>\n<li>Added: TranslatePress Multilingual addon compatibility [Pro]</li>\n</ul>\n<h4>2.2.5 ( May 18, 2022 )</h4>\n<ul>\n<li>Updated: Layout Style</li>\n<li>Added: Container class in settings</li>\n<li>Added: Default listing title to WhatsApp message</li>\n<li>Added: TranslatePress Multilingual addon compatibility [Pro]</li>\n</ul>\n<h4>2.2.4 ( May 10, 2022 )</h4>\n<ul>\n<li>Updated: Plugin Information</li>\n</ul>\n<h4>2.2.3 ( April 20, 2022 )</h4>\n<ul>\n<li>Added: Elementor listing widget custom CustomizerField control Added</li>\n<li>Added: Update some functionality</li>\n<li>Supported: Astra sidebar settings for listing page</li>\n<li>Added: Mobile Number Verification addon compatibility</li>\n</ul>\n<h4>2.2.3 (March 22, 2022)</h4>\n<ul>\n<li>Language issue</li>\n</ul>\n<h4>2.2.2 (March 22, 2022)</h4>\n<ul>\n<li>Add Multi currency support</li>\n<li>Fixed: Padding and Margin block controller default value empty set</li>\n<li>Fixed: Block category show top position</li>\n<li>Fixed: Captcha(v2) issue when linking from expired listing from email</li>\n<li>Fixed: Custom CustomizerField Checkbox Filter issue</li>\n<li>Fixed: Listing form phone field required issue</li>\n<li>Fixed: Manual bump up issue by admin</li>\n<li>Added: User listing page</li>\n<li>Added: Social Profile for user</li>\n</ul>\n<h4>2.2.1.1 (March 02, 2022)</h4>\n<ul>\n<li>Fixed: Icon issue</li>\n<li>Fixed: Abuse report mail issue</li>\n</ul>\n<h4>2.2.1 (March 01, 2022)</h4>\n<ul>\n<li>Fixed: Vimeo video invalid issue</li>\n<li>Fixed: Unregister User post ad mailing issue Send user password to user at email (Generated password)</li>\n<li>Fixed: Quick Edit multiple category selection issue</li>\n<li>Added: Listing Search Form Gutenberg block</li>\n</ul>\n<h4>2.2.0 (February 16, 2022)</h4>\n<ul>\n<li>Added: Gutenberg Block for Listings</li>\n<li>Added: Gutenberg Block for Listing Categories</li>\n<li>Added: Gutenberg Block for Listing Location</li>\n<li>Fixed: Gallery image height issue</li>\n<li>Fixed: Slider issue on Elementor Editor</li>\n<li>Fixed: Listing table column issue</li>\n</ul>\n<h4>2.1.1 (February 2, 2022)</h4>\n<ul>\n<li>Fixed: At Settings Misc page: ID undefined Error in fresh install</li>\n<li>Fixed: At My account page image_allowed_type giving null in fresh install</li>\n<li>Fixed: PHP Notice: Undefined index: new_listing_threshold in</li>\n<li>Fixed: Double slug at Classified Listing Categories Widget</li>\n<li>Update: Add dynamic validation and field at seller contact form</li>\n<li>Update: Add dynamic validation at Report abuse form</li>\n</ul>\n<h4>2.1.0 (January 20, 2022)</h4>\n<ul>\n<li>Fixed: Listing auto publish when update</li>\n<li>Fixed: Remove password from email to new registration</li>\n<li>Added: New Elementor widget</li>\n<li>Added: Ad type option is added to moderation settings at display settings</li>\n<li>Added: Terms &amp; conditions at registration form </li>\n</ul>\n<h4>2.0.14 (January 04, 2022)</h4>\n<ul>\n<li>Fixed: Classified Listing Filter widget radius search issue</li>\n<li>Fixed: Classified Listing Search radius text translation issue</li>\n<li>Fixed: Listing category and location archive ad showing issue</li>\n</ul>\n<h4>2.0.13 (December 31, 2021)</h4>\n<ul>\n<li>Fix: rtcl_listing shortcode search issue</li>\n<li>Fix: Open Street map fitBounds issue</li>\n</ul>\n<h4>2.0.12 (December 24, 2021)</h4>\n<ul>\n<li>Fix: Pricing max limit check with min limit</li>\n<li>Fix: Misc Settings Error</li>\n</ul>\n<h4>2.0.11 (December 23, 2021)</h4>\n<ul>\n<li>Remove unused comment related code</li>\n</ul>\n<h4>2.0.10 (December 15, 2021)</h4>\n<ul>\n<li>Fix checkout page issue </li>\n</ul>\n<h4>2.0.9.2 (December 13, 2021)</h4>\n<ul>\n<li>Fix map zoom variable</li>\n<li>Remove php undefined variable</li>\n</ul>\n<h4>2.0.9.1 (December 11, 2021)</h4>\n<ul>\n<li>Fix from submission Recaptcha issue</li>\n</ul>\n<h4>2.0.9 (December 09, 2021)</h4>\n<ul>\n<li>Add Google GoogleMap</li>\n<li>Add OpenStreetMap</li>\n<li>Google recaptcha v3 </li>\n<li>Fix some functional issue </li>\n</ul>\n<h4>2.0.8 (November 24, 2021)</h4>\n<ul>\n<li>Add Promotions filter at admin end ad listing</li>\n</ul>\n<h4>2.0.7 (November 15, 2021)</h4>\n<ul>\n<li>Ajax Multilingual bug fix</li>\n<li>Change RTCL log folder path to upload directory</li>\n</ul>\n<h4>2.0.6.6 (October 27, 2021)</h4>\n<ul>\n<li>Inline search multilingual bug fix</li>\n<li>order history search issue fixed</li>\n</ul>\n<h4>2.0.6.5 (October 08, 2021)</h4>\n<ul>\n<li>Category duplicate issue fix while loading via ajax</li>\n</ul>\n<h4>2.0.6.4 (September 28, 2021)</h4>\n<ul>\n<li>Keyword search issue fix for apostrophe and others special character</li>\n<li>Update payment coding structure to Order</li>\n<li>Update Oder hook </li>\n<li>Fix Order Note issue</li>\n</ul>\n<h4>2.0.6.3 (September 13, 2021)</h4>\n<ul>\n<li>Ad new endpoint for payment confirm (rtcl-api)</li>\n<li>Update Email order printing format </li>\n<li>Widget support for WordPress 5.8 </li>\n</ul>\n<h4>2.0.6.2</h4>\n<ul>\n<li>Add post type at rest API</li>\n<li>Fix call to undefined function is_user_logged_in function call</li>\n<li>Fix widget checkbox data save issue</li>\n</ul>\n<h4>2.0.6.1</h4>\n<ul>\n<li>Add No listing hook for shortcode listing</li>\n<li>Add offline instruction to API</li>\n</ul>\n<h4>2.0.6</h4>\n<ul>\n<li>Fix WPML Page id issue</li>\n<li>Fix Filter widget taxonomy js issue</li>\n<li>Compatible for WordPress 5.8 version</li>\n</ul>\n"
    },
    "short_description": "A Classified Ads and Business Directory Plugin for WordPress, designed to create Classified ads website, job directory, local business directory.",
    "description": "<p><a href=\"https://www.radiustheme.com/downloads/classified-listing-pro-wordpress/\" rel=\"nofollow ugc\">Classified Listing</a> classified ads Business Directory plugin comes with all the features necessary for building a classified listing website. This classified ads WordPress plugin boasts a plethora of backend admin settings and an excellent frontend posting management system. It lets you create as many ad listing categories as you want so that each ad listing page will be as clean as possible.</p>\n<p>👉 <a href=\"https://radiustheme.net/publicdemo/classified-listing/\" rel=\"nofollow ugc\">Demo</a> | <a href=\"https://www.radiustheme.com/docs/classified-listing/\" rel=\"nofollow ugc\">Documentation</a> | <a href=\"https://www.radiustheme.com/classified-listing-addons/\" rel=\"nofollow ugc\">Extensions</a> | <a href=\"https://radiustheme.com/classified-listing-roadmaps/\" rel=\"nofollow ugc\">RoadMaps</a> |<a href=\"https://www.radiustheme.com/downloads/classified-listing-pro-wordpress/?utm_source=WordPress&amp;utm_medium=Listing&amp;utm_campaign=pro_click'\" rel=\"nofollow ugc\">Get Pro</a> 👈</p>\n<h3>🏆 Demo access of Classified ads Plugin</h3>\n<blockquote>\n<p>URL: <a href=\"https://radiustheme.net/publicdemo/classified-listing/\" rel=\"nofollow ugc\">Demo</a><br />\n  username: demo || password: demo</p>\n</blockquote>\n<h3>Classified ads Plugin for WordPress</h3>\n<p>Classified ads &amp; Business Directory WordPress Plugin can use to create a Classified ads, Business Directory and Members Directory website easily. This plugin has both Elementor and Gutenberg blocks so you can build the classified site easily with the default Gutenberg block editor and most popular Elementor page builder.</p>\n<h3>🔥 Free Classified WordPress Theme 🔥</h3>\n<blockquote>\n<p><a href=\"https://www.radiustheme.com/downloads/clclassified-classified-ads-wordpress-theme/\" rel=\"nofollow ugc\">CLClassified – Free Classified WordPress Theme</a></p>\n</blockquote>\n<h3>🔥 Free Directory WordPress Theme 🔥</h3>\n<blockquote>\n<p><a href=\"https://www.radiustheme.com/downloads/radius-directory-directory-wordpress-theme/\" rel=\"nofollow ugc\">RadiusDirectory – Free Directory WordPress Theme</a></p>\n</blockquote>\n<h3>Classified ads Premium Themes</h3>\n<ul>\n<li>\n<p><a href=\"https://1.envato.market/2944O\" rel=\"nofollow ugc\">Classima – Classified Ads WordPress Theme using Classified Listing Pro &amp; Store plugin</a></p>\n</li>\n<li>\n<p><a href=\"https://1.envato.market/e4YKZ1\" rel=\"nofollow ugc\">Listygo – Directory &amp; Listing WordPress Theme using Classified Listing Pro &amp; Store Plugin</a></p>\n</li>\n<li>\n<p><a href=\"https://www.radiustheme.com/downloads/classilist-classified-ads-wordpress-theme/\" rel=\"nofollow ugc\">ClassiList – Classified ads WordPress Theme using Classified Listing Pro &amp; Store plugin</a></p>\n</li>\n<li>\n<p><a href=\"https://www.radiustheme.com/classified-listing-mobile-apps/\" rel=\"nofollow ugc\">Mobile App – Classified ads iOS &amp; Android mobile app</a></p>\n</li>\n</ul>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/RiXdDGk_XCU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>🏆 WordPress Business Directory Plugin:</h3>\n<p>This WordPress Business Directory plugin makes it incredibly easy to build a business directory website. The price fields can be controlled from the front end so that users can add prices, price ranges or leave out prices for their listings. We included business hours as well as social profile features on the listing submission page.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/main-settings/general-settings/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Business Hours for Business Directory</h3>\n<p>The Business Hours allows you to set the hours of operation for your business. This feature is very important for Business Directory website. You can set the hours for each day of the week, and you can also set special hours for holidays.</p>\n<h3>🏆 Social Profile for Business Directory</h3>\n<p>User can add there social profiles in there directory listing. There are many social profiles that can be used for directory listings. The most popular ones are LinkedIn, Facebook, and Twitter.</p>\n<h3>🏆 UNLIMITED CUSTOM FIELDS</h3>\n<p>You can create unlimited custom fields and set them category-wise. Alternatively, you can create groups and fields under these groups.</p>\n<ul>\n<li>Text Box</li>\n<li>Text Area</li>\n<li>URL</li>\n<li>Number</li>\n<li>Select</li>\n<li>Radio</li>\n<li>Checkbox</li>\n<li><strong>Date &amp; Date Range [Pro]</strong></li>\n</ul>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/LTnCkt5K64M?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Classified Listing plugin offers extensive admin control over the fields that your pages will display in the listing page of all your ads. What’s more, you’ll also have control over the fields visible in the detail view of the ads. It is in each detail page of your ads that you will have the main descriptions. With Classified Listing Pro, you can display the custom fields in the list view. Your custom fields will even appear in the search filters if you want.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/listing-management-admin/custom-fields/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 User Friendly</h3>\n<p>Classified Listing is crafted to provide the possible user experience to all users, including the admins, buyers, and sellers of ad listings. All your users will enjoy a smooth interface on any device since this plugin is fully responsive. This classified listing WordPress plugin makes your elements look great on all devices, whether they’re using desktops, tablets, or mobile phones.</p>\n<p>Classified Listing supports the use of maps to showcase the location of listings. Whether you prefer Google Maps, this plugin has you covered. What’s more, it comes with a radius search function, which makes such searches more straightforward.</p>\n<h3>🏆 Search and Filter Functions</h3>\n<p>The search and filter functions of this plugin are incredibly powerful. The Ajax search and filter functions accommodate multiple search options. You can even filter your search results by custom fields, category, location, and price. The Ajax autocomplete function that makes the search process even smoother. The premium version of Classified Listing has the radius search function, which enables users to find listing items near them.</p>\n<h3>Review from WordPress Community expert Darrel Wilson</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/kt4Sbb1fkL8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>🏆 Frontend User Dashboard Options</h3>\n<p>Each of your users can control their own data and listings from your website’s front end. Users can manage their own ad listings by editing, deleting, and promoting them. Classified Listing allows them to manage the ads they want to be their favorites.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/listing-management-front-end/my-account-menu/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Admin Ad Control Options</h3>\n<p>This classified ads WordPress plugin gives the site admin immense control over various elements and features. Since it grants you Permalink control over links in your listing detail page, you can easily modify the links you want.</p>\n<p>Images play a significant part in an ad listing website; having control over them ensures that they remain your protagonist. With Classified Listing, the admin has control over the maximum number of images that can be used in each listing. With this classified ads, WordPress plugin enables you to set a maximum image size threshold for image uploads. The sizes of images on your gallery and thumbnails are also in your control.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/main-settings/moderation/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Ad Control</h3>\n<p>This classified ads WordPress plugin gives you a choice between automatic and manual approval of your listings. On the other hand, manually approving listings help screen ads in detail before posting them.</p>\n<p>With Classified Listing, you will have immense control over the ad listings. You can set the number of days for which a listing should last before being removed. This ad directory WordPress plugin allows you to set the threshold of days within when a listing will be marked as ‘new’ and given prominence.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/main-settings/moderation/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Location</h3>\n<p>With Classified Listing, you can set up to a maximum of 3 location levels. The default location types include state, city, and tow; however, you can set your own custom levels.</p>\n<p>This classified listing WordPress plugin lets you import location. The import option for locations is via CSV; therefore, you can import bulk location data easily.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/listing-management-admin/locations/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Payment Options</h3>\n<p>The payment options on your site should depend mainly on your location and that of your users. You can receive payments on your site via</p>\n<ul>\n<li>Offline methods</li>\n<li><a href=\"https://www.paypal.com/\" rel=\"nofollow ugc\">PayPal</a> payment system</li>\n<li><a href=\"https://www.authorize.net/\" rel=\"nofollow ugc\">Authorize.net</a> [PRO]</li>\n<li><a href=\"https://stripe.com/\" rel=\"nofollow ugc\">Stripe</a> [PRO]</li>\n<li>WooCommerce payment system [PRO]</li>\n</ul>\n<h3>🏆 Earning From Your Listings</h3>\n<p>You can make money from posting ads where users pay for each ad or for ad promotions, such as</p>\n<ul>\n<li><strong>Featured ads –</strong> Featured ads highlighted with a special background color so this ads get<br />\nmore view</li>\n<li><strong>Pay Per Ads –</strong> You can set pay per ad option so after post ads user need to pay.</li>\n<li><strong>Top ads [Pro] –</strong> Top ads display top of archive page and search page with a special highlighted color so this ads get mote view</li>\n<li><strong>Bumpup ads [Pro] –</strong> Bumpup ads changes the ads data daily so it show top of list in archive page and search page.</li>\n<li><strong>Membership [Pro]:</strong> Classified Listing comes with the Store and Membership addon, which allows you to enable membership packages for sellers. You can offer an ad promotion option along with the membership packages.</li>\n</ul>\n<h3>🏆 Elementor Addon</h3>\n<p>This Classified ads and Business Directory plugin has multiple Elementor addons to display ads in different layouts. The Pro version support archive builder also single ads builder. Sp you can easily arrange the archive page and single ads page how your want the ads will display.</p>\n<h3>🏆 GutenBerg Blocks</h3>\n<p>This Classifieds ads plugins has multiple Gutenberg blocks. So you can easily use the block in WordPress default Gutenberg builder.</p>\n<h3>🏆 Email Notification Options</h3>\n<p><strong>Admin Notifications</strong><br />\nClassified Listing – Classified ads WordPress plugin gives you complete control over the email notifications that you receive.</p>\n<ul>\n<li>New Listings Submission</li>\n<li>Listing Edited</li>\n<li>Listing Expired</li>\n<li>Order Created</li>\n<li>Payment Received/ Order Completed</li>\n<li>Contact message is sent to a Listing owner</li>\n</ul>\n<p>You will receive email notifications each time an order is created for a listing. The plugin will also ensure that you’re notified when you receive a payment or upon the completion of an order. When a contact message is sent to the owner of a listing, you will also receive a notification.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/main-settings/email-settings/general-settings-email/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 User Notification</h3>\n<p>With Classified Listing, your users can receive various email notifications as they interact with you, your site, and other users. Sellers of ad listings will be notified of any communication that comes from you and other users. Every time a listing submission is successful, they will be notified when it’s approved and upon its publishing. User get following email notifications</p>\n<ul>\n<li>Listing Submission</li>\n<li>Listing approved/ Published</li>\n<li>Listing about to expire (reached renewal email threshold)</li>\n<li>Listing expired</li>\n<li>Listing expired &amp; reached renewal reminder email threshold</li>\n<li>Order Created</li>\n<li>Order Completed</li>\n</ul>\n<p>Classified Listing notifies users when their listings are about to expire and have reached their renewal email threshold. It also notifies them when a listing has expired and when it has expired and reached the threshold for a renewal reminder email. As the admin is notified about order creation and completion, the users are also notified.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/main-settings/email-settings/general-settings-email/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Multiple GoogleMap Option</h3>\n<p>Location search is one of most important feature for Directory website as well as Classified ads website. Classified as plugin has multiple GoogleMap source. We included both Google GoogleMap and Open Street GoogleMap.</p>\n<p><strong>Google GoogleMap and Location</strong><br />\nThis Classified ads and directory plugin enables the display of Google Maps in the ad detail views. You can showcase Google Locations using Google place API.</p>\n<p><strong>OpenStreetMap</strong><br />\nOpenStreet GoogleMap is a free platform to display location and use the map features.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/main-settings/misc-settings/#google-map\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Radius Search</h3>\n<p>This plugin allows radius searches using Google place API &amp; OpenStreet GoogleMap so that users can search for listings close to them.</p>\n<h3>🏆 Ad Publishing Control</h3>\n<p>Classified Listing – Business directory plugin allows you to choose whether you want ads to pass by you for approval or have them automatically approved and published by the system. If you choose to approve ads manually, you will have to publish them yourself after that. The users will be notified upon approval and publishing anyway—the same control applies when users edit their listings. You can allow them to publish them automatically after editing or approve them manually yourself.</p>\n<h3>🏆 Widgets and Shortcodes</h3>\n<p>Classified Listing is a widget-ready plugin. It works seamlessly with any widgets that your site already has. What’s more, it comes with some widgets of its own. You’ll have 4 widgets for categories, filters, listings, and the search function. Support following 4 widgets</p>\n<ul>\n<li>Classified Listing – Categories</li>\n<li>Classified Listing – Filter</li>\n<li>Classified Listing – Listings</li>\n<li>Classified Listing – Search</li>\n</ul>\n<p>This directory WordPress plugin is also shortcode-ready. If you’re already using shortcodes on your website, you should find it incredibly easy to handle the ones that come with Classified Listing. Among the shortcodes that come with it include one for use on the ‘my account’ page, checkout page, and a few others.</p>\n<p>👉 <a href=\"https://www.radiustheme.com/docs/shortcodes/my-account-page/\" rel=\"nofollow ugc\">Check Documentation</a></p>\n<h3>🏆 Translatability</h3>\n<p>Classified Listing is fully translatable. However, it comes with a ready translation for Spanish. Still, you can translate it into whichever language you want using simple WordPress translation plugins, such as Loco Translate and the WPML plugin.</p>\n<h3>🏆 Some Pro Features</h3>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/classified-listing-store-membership-addon-for-wordpress/\" rel=\"nofollow ugc\">Store &amp; Membership Addon</a>:</strong> You can utilize the Store and Membership Addon to let ad sellers open stores within your website so that all their ads can appear within their own stores. The membership options also allow you to let sellers become members in different packages. You can have them displaying free ads, give them some categories at no charge, or have them pay for other categories. You can set memberships to go with paid categories and allow members to do ad promotions.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/classified-listing-elementor-builder/\" rel=\"nofollow ugc\">Elementor Builder Addon</a>:</strong> You can easily customize the listing archive page and single page using drag &amp; drop in Elementor page builder.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/classified-listing-mobile-no-verification/\" rel=\"nofollow ugc\">Mobile No Verification Addon</a>:</strong> Mobile number verification is an OTP( One time password ) based security addon for Classified Listing Pro. This addon helps verify a real user by sending an OTP verification code during registration, login, and contact form submissions. Sometimes spammers added listings and tricks the buyer.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/classified-listing-multi-currency-addon/\" rel=\"nofollow ugc\">MultiCurrency Addon</a>:</strong> Make your business experience hassle free with the Classified Listing – Multi Currency add-ons. It is a convenient add-on for Classified Ads and the business directory WordPress plugin.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/razorpay-payment-addon-for-classified-listing/\" rel=\"nofollow ugc\">Razorpay Payment Addon</a>:</strong> Razorpay Payment one of popular payment gateway in India. So from India site owner can easily receive payment via Razorpay Payment.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/docs/listing-management-admin/custom-fields/#conditional-fields\" rel=\"nofollow ugc\">Custom Conditional FieldList</a>:</strong> You can create conditional fields. For instance, when you have car make, model, and year of release, the model depends on the make, while the year depends on the model.</p>\n<p>👉 <strong>MAP View:</strong> The PRO version allows GoogleMap View using Google place API &amp; OpenStreet GoogleMap. You can display your ads with GoogleMap. So that your can easily view the ads location wise in MAP.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/docs/faqs/enable-mark-as-sold/\" rel=\"nofollow ugc\">Mark As Sold</a>:</strong> If any items are sold out, but you feel the need to keep them active on the site for SEO purposes, you can mark them as sold. In this case, such ads will show in the front end, but communication on them will be disabled.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/docs/main-settings/chat-settings/\" rel=\"nofollow ugc\">Live chat</a>:</strong> Another important feature is communication between sellers and buyers via live chat. This eliminates the need for sharing contact information. They can communicate via live chat about the ad items.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/docs/faqs/how-to-add-compare/\" rel=\"nofollow ugc\">Quick View &amp; Compare</a>:</strong> The PRO version facilitates quick view, enabling users to view brief details of ad listings without going to the ad details. They can even compare ad listings quickly for differences in prices and other details easily.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/classified-listing-multilingual-addon/\" rel=\"nofollow ugc\">WPML addon</a>:</strong> If you want a multilingual website, you can get it quickly since the pro version supports WPML. For translation, you may need WPML Plugin and our WPML addon. By WPML plugin and Our WPML addon you can translate all ads, category, locations, custom fields.</p>\n<p>👉 <strong><a href=\"https://www.radiustheme.com/downloads/classima-classified-ads-android-app/\" rel=\"nofollow ugc\">Mobile APP</a>:</strong> If you want to build mobile app for your classified ads or directory then you need the Pro version of the plugin, By using the Pro version you can build both Android &amp; IOS apps.</p>\n<h3>Need Any Help?</h3>\n<ul>\n<li>For any bug, support or suggestion please submit your ticket <a href=\"https://www.radiustheme.com/ticket-support/\" rel=\"nofollow ugc\">here</a>.</li>\n</ul>\n<h3>Liked RadiusTheme</h3>\n<ul>\n<li>Join our <a href=\"https://www.facebook.com/groups/radiustheme\" rel=\"nofollow ugc\">Facebook Group</a>.</li>\n<li>Learn from our tutorials on <a href=\"https://www.youtube.com/@RadiusTheme\" rel=\"nofollow ugc\">YouTube Channel</a>.</li>\n</ul>\n<h3>🔥 WHAT’S NEXT</h3>\n<p>If you like The Post Grid Plugin, then consider checking out our other WordPress Plugins:</p>\n<ul>\n<li>\n<p><a href=\"https://wordpress.org/plugins/the-post-grid/\" rel=\"ugc\">The Post Grid</a> – Shortcode, Gutenberg Blocks and Elementor Addon for Post Grid.</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/plugins/woo-product-variation-swatches/\" rel=\"ugc\">Variation Swatches</a> &#8211; Woocommerce Variation Swatches plugin converts the product variation select fields into radio, images, colors, and labels.</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/plugins/woo-product-variation-gallery/\" rel=\"ugc\">Variation Gallery</a> &#8211; Woocommerce Variation Gallery plugin allows to add UNLIMITED additional images for each variation of product.</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/plugins/shopbuilder/\" rel=\"ugc\">ShopBuilder</a> &#8211; Elementor WooCommerce Builder Addons with 84+ widgets and 10+ modules.</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/plugins/tlp-food-menu/\" rel=\"ugc\">Food Menu</a> – Restaurant Menu &amp; Online Ordering using WooCommerce.</p>\n</li>\n</ul>\n<h3>Translation</h3>\n<ul>\n<li>Español by <a href=\"https://wordpress.org/support/users/4aiur/\" rel=\"ugc\">4aiur</a></li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/classified-listing.3.1.7.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/classified-listing/assets/screenshot-01.png?rev=2920528",
            "caption": "Listing layout and filtering"
        },
        {
            "src": "https://ps.w.org/classified-listing/assets/screenshot-02.png?rev=2920528",
            "caption": "Widget"
        },
        {
            "src": "https://ps.w.org/classified-listing/assets/screenshot-03.png?rev=2920528",
            "caption": "New listing form"
        },
        {
            "src": "https://ps.w.org/classified-listing/assets/screenshot-04.png?rev=2920528",
            "caption": "User backend"
        },
        {
            "src": "https://ps.w.org/classified-listing/assets/screenshot-05.png?rev=2920528",
            "caption": "Payment History"
        },
        {
            "src": "https://ps.w.org/classified-listing/assets/screenshot-06.png?rev=2920528",
            "caption": "User account settings"
        },
        {
            "src": "https://ps.w.org/classified-listing/assets/screenshot-07.png?rev=2920528",
            "caption": "Elementor Widget List"
        },
        {
            "src": "https://ps.w.org/classified-listing/assets/screenshot-08.png?rev=2920528",
            "caption": "Elementor Listing Widget"
        },
        {
            "src": "https://ps.w.org/classified-listing/assets/screenshot-09.png?rev=2920528",
            "caption": "GutenBerg Listing Block"
        }
    ],
    "tags": {
        "business-directory": "business directory",
        "classifieds": "classifieds",
        "classifieds-ads": "classifieds ads",
        "directory-plugin": "directory plugin",
        "listings": "listings"
    },
    "stable_tag": "3.1.7",
    "versions": {
        "2.0.10": "https://downloads.wordpress.org/plugin/classified-listing.2.0.10.zip",
        "2.0.11": "https://downloads.wordpress.org/plugin/classified-listing.2.0.11.zip",
        "2.0.12": "https://downloads.wordpress.org/plugin/classified-listing.2.0.12.zip",
        "2.0.13": "https://downloads.wordpress.org/plugin/classified-listing.2.0.13.zip",
        "2.0.14": "https://downloads.wordpress.org/plugin/classified-listing.2.0.14.zip",
        "2.0.7": "https://downloads.wordpress.org/plugin/classified-listing.2.0.7.zip",
        "2.0.8": "https://downloads.wordpress.org/plugin/classified-listing.2.0.8.zip",
        "2.0.9": "https://downloads.wordpress.org/plugin/classified-listing.2.0.9.zip",
        "2.0.9.1": "https://downloads.wordpress.org/plugin/classified-listing.2.0.9.1.zip",
        "2.0.9.2": "https://downloads.wordpress.org/plugin/classified-listing.2.0.9.2.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/classified-listing.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/classified-listing.2.1.1.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/classified-listing.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/classified-listing.2.2.1.zip",
        "2.2.1.1": "https://downloads.wordpress.org/plugin/classified-listing.2.2.1.1.zip",
        "2.2.10": "https://downloads.wordpress.org/plugin/classified-listing.2.2.10.zip",
        "2.2.11": "https://downloads.wordpress.org/plugin/classified-listing.2.2.11.zip",
        "2.2.12": "https://downloads.wordpress.org/plugin/classified-listing.2.2.12.zip",
        "2.2.13": "https://downloads.wordpress.org/plugin/classified-listing.2.2.13.zip",
        "2.2.14": "https://downloads.wordpress.org/plugin/classified-listing.2.2.14.zip",
        "2.2.15": "https://downloads.wordpress.org/plugin/classified-listing.2.2.15.zip",
        "2.2.16": "https://downloads.wordpress.org/plugin/classified-listing.2.2.16.zip",
        "2.2.17": "https://downloads.wordpress.org/plugin/classified-listing.2.2.17.zip",
        "2.2.18": "https://downloads.wordpress.org/plugin/classified-listing.2.2.18.zip",
        "2.2.19": "https://downloads.wordpress.org/plugin/classified-listing.2.2.19.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/classified-listing.2.2.2.zip",
        "2.2.20": "https://downloads.wordpress.org/plugin/classified-listing.2.2.20.zip",
        "2.2.21": "https://downloads.wordpress.org/plugin/classified-listing.2.2.21.zip",
        "2.2.22": "https://downloads.wordpress.org/plugin/classified-listing.2.2.22.zip",
        "2.2.23": "https://downloads.wordpress.org/plugin/classified-listing.2.2.23.zip",
        "2.2.24": "https://downloads.wordpress.org/plugin/classified-listing.2.2.24.zip",
        "2.2.25": "https://downloads.wordpress.org/plugin/classified-listing.2.2.25.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/classified-listing.2.2.3.zip",
        "2.2.4": "https://downloads.wordpress.org/plugin/classified-listing.2.2.4.zip",
        "2.2.5": "https://downloads.wordpress.org/plugin/classified-listing.2.2.5.zip",
        "2.2.5.1": "https://downloads.wordpress.org/plugin/classified-listing.2.2.5.1.zip",
        "2.2.6": "https://downloads.wordpress.org/plugin/classified-listing.2.2.6.zip",
        "2.2.7": "https://downloads.wordpress.org/plugin/classified-listing.2.2.7.zip",
        "2.2.8": "https://downloads.wordpress.org/plugin/classified-listing.2.2.8.zip",
        "2.2.9": "https://downloads.wordpress.org/plugin/classified-listing.2.2.9.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/classified-listing.2.3.0.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/classified-listing.2.3.1.zip",
        "2.3.10": "https://downloads.wordpress.org/plugin/classified-listing.2.3.10.zip",
        "2.3.11": "https://downloads.wordpress.org/plugin/classified-listing.2.3.11.zip",
        "2.3.2": "https://downloads.wordpress.org/plugin/classified-listing.2.3.2.zip",
        "2.3.3": "https://downloads.wordpress.org/plugin/classified-listing.2.3.3.zip",
        "2.3.4": "https://downloads.wordpress.org/plugin/classified-listing.2.3.4.zip",
        "2.3.5": "https://downloads.wordpress.org/plugin/classified-listing.2.3.5.zip",
        "2.3.6": "https://downloads.wordpress.org/plugin/classified-listing.2.3.6.zip",
        "2.3.7": "https://downloads.wordpress.org/plugin/classified-listing.2.3.7.zip",
        "2.3.8": "https://downloads.wordpress.org/plugin/classified-listing.2.3.8.zip",
        "2.3.9": "https://downloads.wordpress.org/plugin/classified-listing.2.3.9.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/classified-listing.2.4.0.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/classified-listing.2.4.1.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/classified-listing.2.4.2.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/classified-listing.2.4.3.zip",
        "2.4.4": "https://downloads.wordpress.org/plugin/classified-listing.2.4.4.zip",
        "2.4.5": "https://downloads.wordpress.org/plugin/classified-listing.2.4.5.zip",
        "2.4.6": "https://downloads.wordpress.org/plugin/classified-listing.2.4.6.zip",
        "2.4.7": "https://downloads.wordpress.org/plugin/classified-listing.2.4.7.zip",
        "2.4.8": "https://downloads.wordpress.org/plugin/classified-listing.2.4.8.zip",
        "2.4.9": "https://downloads.wordpress.org/plugin/classified-listing.2.4.9.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/classified-listing.2.5.0.zip",
        "2.5.1": "https://downloads.wordpress.org/plugin/classified-listing.2.5.1.zip",
        "2.5.2": "https://downloads.wordpress.org/plugin/classified-listing.2.5.2.zip",
        "2.5.3": "https://downloads.wordpress.org/plugin/classified-listing.2.5.3.zip",
        "2.5.4": "https://downloads.wordpress.org/plugin/classified-listing.2.5.4.zip",
        "2.5.5": "https://downloads.wordpress.org/plugin/classified-listing.2.5.5.zip",
        "2.5.5.1": "https://downloads.wordpress.org/plugin/classified-listing.2.5.5.1.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/classified-listing.2.6.0.zip",
        "2.6.1": "https://downloads.wordpress.org/plugin/classified-listing.2.6.1.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/classified-listing.2.6.2.zip",
        "2.6.3": "https://downloads.wordpress.org/plugin/classified-listing.2.6.3.zip",
        "2.6.4": "https://downloads.wordpress.org/plugin/classified-listing.2.6.4.zip",
        "2.6.5": "https://downloads.wordpress.org/plugin/classified-listing.2.6.5.zip",
        "2.6.6": "https://downloads.wordpress.org/plugin/classified-listing.2.6.6.zip",
        "2.6.7": "https://downloads.wordpress.org/plugin/classified-listing.2.6.7.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/classified-listing.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/classified-listing.3.0.1.zip",
        "3.0.10": "https://downloads.wordpress.org/plugin/classified-listing.3.0.10.zip",
        "3.0.10.1": "https://downloads.wordpress.org/plugin/classified-listing.3.0.10.1.zip",
        "3.0.10.2": "https://downloads.wordpress.org/plugin/classified-listing.3.0.10.2.zip",
        "3.0.10.3": "https://downloads.wordpress.org/plugin/classified-listing.3.0.10.3.zip",
        "3.0.11": "https://downloads.wordpress.org/plugin/classified-listing.3.0.11.zip",
        "3.0.12": "https://downloads.wordpress.org/plugin/classified-listing.3.0.12.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/classified-listing.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/classified-listing.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/classified-listing.3.0.4.zip",
        "3.0.5": "https://downloads.wordpress.org/plugin/classified-listing.3.0.5.zip",
        "3.0.6": "https://downloads.wordpress.org/plugin/classified-listing.3.0.6.zip",
        "3.0.7": "https://downloads.wordpress.org/plugin/classified-listing.3.0.7.zip",
        "3.0.8": "https://downloads.wordpress.org/plugin/classified-listing.3.0.8.zip",
        "3.0.9": "https://downloads.wordpress.org/plugin/classified-listing.3.0.9.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/classified-listing.3.1.0.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/classified-listing.3.1.1.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/classified-listing.3.1.2.zip",
        "3.1.3": "https://downloads.wordpress.org/plugin/classified-listing.3.1.3.zip",
        "3.1.4": "https://downloads.wordpress.org/plugin/classified-listing.3.1.4.zip",
        "3.1.5": "https://downloads.wordpress.org/plugin/classified-listing.3.1.5.zip",
        "3.1.6": "https://downloads.wordpress.org/plugin/classified-listing.3.1.6.zip",
        "3.1.7": "https://downloads.wordpress.org/plugin/classified-listing.3.1.7.zip",
        "trunk": "https://downloads.wordpress.org/plugin/classified-listing.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/classified-listing/assets/banner-772x250.png?rev=3004167",
        "high": "https://ps.w.org/classified-listing/assets/banner-1544x500.png?rev=3004167"
    },
    "icons": {
        "1x": "https://ps.w.org/classified-listing/assets/icon-128x128.gif?rev=3004059",
        "2x": "https://ps.w.org/classified-listing/assets/icon-256x256.gif?rev=3004059"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 96,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "classified-listing",
            "language": "el",
            "version": "3.1.7",
            "updated": "2024-02-14 12:37:28",
            "package": "http://downloads.wordpress.org/translation/plugin/classified-listing/3.1.7/el.zip"
        }
    ]
}