{
    "name": "Clearfy Cache – WordPress optimization plugin, Minify HTML, CSS &amp; JS, Defer",
    "slug": "clearfy",
    "version": "2.2.3",
    "author": "<a href=\"https://cm-wp.com\">Creative Motion </a>",
    "author_profile": "https://profiles.wordpress.org/creativemotion/",
    "contributors": {
        "creativemotion": {
            "profile": "https://profiles.wordpress.org/creativemotion/",
            "avatar": "https://secure.gravatar.com/avatar/321e1d460ea6c842144d6fbf90feb653?s=96&d=monsterid&r=g",
            "display_name": "Creativemotion"
        },
        "webcraftic": {
            "profile": "https://profiles.wordpress.org/webcraftic/",
            "avatar": "https://secure.gravatar.com/avatar/d1b8a5ab9b2efe6018824893ccba1b81?s=96&d=monsterid&r=g",
            "display_name": "webcraftic"
        },
        "alexkovalevv": {
            "profile": "https://profiles.wordpress.org/alexkovalevv/",
            "avatar": "https://secure.gravatar.com/avatar/5e5a5d9d4993c8f1532a976a0df903f6?s=96&d=monsterid&r=g",
            "display_name": "Alexander Kovalev"
        }
    },
    "requires": "5.2",
    "tested": "6.6.1",
    "requires_php": "7.2",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 94,
    "ratings": {
        "5": 289,
        "4": 12,
        "3": 15,
        "2": 4,
        "1": 12
    },
    "num_ratings": 332,
    "support_url": "https://wordpress.org/support/plugin/clearfy/",
    "support_threads": 2,
    "support_threads_resolved": 0,
    "active_installs": 70000,
    "downloaded": 2117891,
    "last_updated": "2024-07-17 5:21am GMT",
    "added": "2017-09-07",
    "homepage": "https://clearfy.pro",
    "sections": {
        "description": "<p>Thousands of users already optimized their WordPress sites with <strong>Clearfy plugin</strong>. It’s multipurpose and free tool with tons of settings. Combine it with other plugins and you’ll get better optimized and secure WordPress website.</p>\n<h3>Optimize SEO and SPEED of your website in 5 minutes</h3>\n<ol>\n<li><strong>Clear website code from trash;</strong></li>\n<li><strong>Eliminate the WordPress vulnerabilities;</strong></li>\n<li><strong>Speed up search engine indexing;</strong></li>\n<li><strong>Fix another plugin’s bugs;</strong></li>\n<li><strong>Make your WordPress easier, more convenient and faster.</strong></li>\n</ol>\n<p>You’ll get <strong>50+</strong> useful functions for your WordPress website optimization, mixed and packed into the only one Clearfy plugin. In addition, we have quality video lessons and tutorials that will help you to understand plugin settings. But don&#8217;t hurry to <strong>download Clearfy</strong> until you know its history and strengths.</p>\n<h4>WordPress optimization plugin Clearfy — the beginning</h4>\n<p>We create plugins, themes and customer’s projects more than 8 years. Every time, we faced the same problem — each project is unique and do not need all WordPress functions which continued to consume hosting resources, make SEO problems and interfered with daily work. To fix this we used our prepared code snippets and wasted many time for theirs testing and revisions. Therefore, we decided to create universal plugin to speed up our work. Using all of our skills, we collected them into one WordPress plugin called <strong>Clearfy</strong>. Initially we used optimization plugin for customer’s projects and ours but later we understood that problem is global so we shared plugin for you absolutely free.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/TtrX7YKdalY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Maybe you know the situations when you need to remove extra code, widget or delete duplicate pages on your website. Sometimes you inserted code snippets, which you have found in web by yourself or spent big money with freelancers. Now you have excellent opportunity to optimize WordPress with Clarify plugin and not waste your time at specialists or use doubtful solutions.</p>\n<h4>How Clearfy will improve WordPress SEO</h4>\n<p>Based on users’ feedback, who optimized WordPress with Clearfy plugin, there is good performance growth at the Pingdom, GTmetrix, Google PageSpeed Insights and YSlow services.</p>\n<p>In addition, we observed important features:</p>\n<ul>\n<li>the page indexing of websites, blogs and online stores has improved;</li>\n<li>the pages became better ranking by search engines after duplicates deletion;</li>\n<li>websites became cleaner for search engines that was improved SEO and traffic.</li>\n</ul>\n<p>Do you want the same or better? <strong>Download Clearfy for free</strong> and see for yourself! Configuring the plugin takes only 5-10 minutes. Just think how long it would be take you to find and configure all optimization scripts, plugins, if you had not the all in one solution Clearfy.</p>\n<h3>More than 50 Clearfy plugin features for WordPress optimization</h3>\n<h4>PAGE CACHING</h4>\n<p>Clearfy Cache is a simple, yet powerful WordPress caching plugin that is easy to use, needs minimal configuration, and best of all helps improve site performance for a faster load time. It creates static HTML files of frontend pages and stores them on the server’s disk. This allows the static HTML files to be delivered instead of generating pages on the fly, avoiding resource intensive backend processes from the WordPress core, plugins, and database.</p>\n<p>HOW DOES THE CACHING WORK? Clearfy Cache captures page contents and saves it as a static HTML file on the server’s disk. The static HTML file created can be one of several possible cache versions depending on the plugin settings and HTTP request. Accepted static HTML files are then delivered without any database queries or on the fly compression, allowing for a quicker page load.</p>\n<ul>\n<li>**Enable Cache</li>\n<li>**Browser Caching (PRO)</li>\n<li>**Mobile Cache (PRO)</li>\n<li>**Widget Cache (PRO)</li>\n</ul>\n<h4>PERFORMANCE OPTIMIZATION</h4>\n<ul>\n<li><strong>Minify HTML</strong> — compresses the code, speeds up the website loading.</li>\n<li><strong>Minify CSS</strong> — you can decrease the size of css files</li>\n<li><strong>Minify JS</strong> — you can decrease the size of css files</li>\n<li><strong>Critical CSS</strong> — Add CSS files or CSS code to the critical section so that it connects at the very beginning of the page.</li>\n<li>**Defer JS &amp; CSS</li>\n</ul>\n<h4>Code cleanup</h4>\n<ul>\n<li><strong>Disable RSS Feeds</strong> — disables RSS if you using WordPress for website only, not for blog.</li>\n<li><strong>Disable Emojis</strong> — emojis generates extra code and slow down the site, even if you did not put any smiley.</li>\n<li><strong>Remove jQuery Migrate</strong> — if you use several popular plugins that are regularly updates, then you can safely delete jQuery Migrate.</li>\n<li><strong>Disable Embeds</strong> — if you do not insert videos into the posts or pages, turn embeds off.</li>\n<li><strong>Remove dns-prefetch</strong> — may improve image loading in some cases.</li>\n<li><strong>Remove RSD link</strong> — if you create posts and pages inside WordPress then you do not need the Real Simple Discovery function.</li>\n<li><strong>Remove wlwmanifest Link</strong> — if you publish posts and pages via WordPress interface, 99% this function is not necessary for you.</li>\n<li><strong>Remove Shortlink</strong> — if you use permalinks, you do not need the shortlinks.</li>\n<li><strong>Remove Previous/Next Post Link in HEAD</strong> — delete previous and next post links if you do not use the blog.</li>\n<li><strong>Remove .recentcomments Styles</strong> — remove if you want to change the &#8220;Related posts&#8221; widget styles.</li>\n</ul>\n<h4>WordPress SEO optimization</h4>\n<ul>\n<li><strong>Automatically insert the alt attribute</strong> — sets the alt attribute for all images in posts and pages, if alt is absent.</li>\n<li><strong>Create the Correct robots.txt</strong> — helps to create the perfect Robots.txt to improve the indexing or close that would not be indexed.</li>\n<li><strong>Insert the Last Modified Header Automatically</strong> — it helps search engines to understand which posts and pages are modified last and index them first.</li>\n<li><strong>Return If-Modified-Since Header</strong> — improves indexing telling to search engines that pages and posts have changed.</li>\n<li><strong>Remove Post Title from Yoast SEO Breadcrumbs</strong> — cuts out the title from breadcrumbs at pages or posts.</li>\n<li><strong>Remove image:image tag from the Yoast SEO XML Sitemap</strong> — eliminates the site map errors at the Yandex Webmaster.</li>\n<li><strong>Disable Schema JSON-LD</strong> — forbids Google to generate advanced search snippet with website page links.</li>\n<li><strong>Disable SEO Yoast&#8217;s Structured Data</strong> — disables structured company data generated by Yoast SEO.</li>\n<li><strong>Remove Yoast SEO Comments from Head Section</strong> — removes data from the code, which tells that your website is optimized by Yoast SEO plugin.</li>\n</ul>\n<h4>Remove WordPress page duplicates</h4>\n<ul>\n<li><strong>Remove Date Archives</strong> — completely removes the date archives and sets the redirect to front-page. </li>\n<li><strong>Remove Author Archives</strong> — completely removes the author archives and sets the redirect to front-page. It is useful if the site&#8217;s author is single.</li>\n<li><strong>Remove Tags Archives</strong> — removes tag archives and redirects to front-page.</li>\n<li><strong>Remove Attachment’s Pages</strong> — by default, each media file has its own page. Clearfy removes them and redirects to the page or post into which this media file was inserted.</li>\n<li><strong>Remove Posts Pagination</strong> — page navigation is not needed with a single post. It is better to delete it and make some posts.</li>\n<li><strong>Remove ?replytocom</strong> — eliminates the posts comments duplicates.</li>\n</ul>\n<h4>WordPress privacy settings</h4>\n<ul>\n<li><strong>Remove Generator Meta Tag</strong> — version info remove.</li>\n<li><strong>Remove Style Files Version</strong> — complicates the process if someone wants to hack your site.</li>\n<li><strong>Remove Javascript Files Version</strong> — it is more difficult to determine the version of installed plugins and hack the site.</li>\n<li><strong>Remove Querystrings</strong> — helps with the caching of JS and CSS and increase the speed of website load.</li>\n<li><strong>Remove HTML Comments</strong> — hacker cannot determine versions of themes and plugins by comments in the code.</li>\n</ul>\n<h4>WordPress defense</h4>\n<ul>\n<li><strong>Hide Author’s Login</strong> — complicates the hacking process. It&#8217;s more difficult to find out your login for hacker.</li>\n<li><strong>Hide WordPress Login Error Messages</strong> — the attacker does not understand what he entered incorrectly, login or password.</li>\n<li><strong>Disable XML-RPC</strong> — disable pingbacks and trackbacks.</li>\n<li><strong>Disable X-Pingback Link</strong> — removes the link and the ability to spam with pingbacks.</li>\n</ul>\n<h4>WordPress widgets</h4>\n<ul>\n<li><strong>WP Widgets Disable</strong> — removes WordPress widgets, all or selectively (Links, Archives, Meta, Search, etc.)</li>\n</ul>\n<h4>WordPress updates: core, plugins, themes</h4>\n<ul>\n<li><strong>Automatic Plugins Updates</strong> — turn it on and you no longer need to think about plugins updates.</li>\n<li><strong>Disable Plugins Updates</strong> — disables plugins updates and updates notices. You can disable updates of all plugins or each individually.</li>\n<li><strong>Automatic Themes Updates</strong> — all of your themes will update automatically.</li>\n<li><strong>Disable Themes Updates</strong> — all of your themes will stop to update and notify about updates.</li>\n<li><strong>Disable Translation Updates</strong> — disables automatic translation updates for themes and plugins.</li>\n<li><strong>WordPress Automatic Updates</strong> — your WordPress will be update automatically.</li>\n<li><strong>Disable WordPress Updates</strong> — completely disables WordPress updates.</li>\n<li><strong>Disable Update Notifications</strong> — users without permissions to update themes, plugins and WordPress will not receive updates notifications.</li>\n</ul>\n<h4>WordPress comments</h4>\n<ul>\n<li><strong>Disable Comments</strong> — allows you to completely disable WordPress comments overall or for selected post types.</li>\n<li><strong>Remove Comments / Delete Comments</strong> — completely removes WordPress comments.</li>\n<li><strong>Close Comments</strong> — completely closes WordPress comments and removes the &#8220;Comments&#8221; section from the left menu.</li>\n<li><strong>Remove URL / Website Field from Comment Form</strong> — removes a comment author Website field.</li>\n<li><strong>Replace Outbound Links in Comments with Javascript</strong> — all external links in comments are reliably closes from search engines indexing.</li>\n<li><strong>Replace Outbound Links of Comment Authors with Javascript</strong> — search engines no longer index links to the comment author&#8217;s site.</li>\n</ul>\n<h4>Admin notices, WordPress updates notifications</h4>\n<ul>\n<li><strong>Disable Admin Notices</strong> — hides all or selected notifications of the WordPress admin.</li>\n</ul>\n<h4>Heartbeat API optimization</h4>\n<ul>\n<li><strong>Disable WordPress Heartbeat API</strong> — completely disables the Heartbeat API WordPress function.</li>\n<li><strong>Limit WordPress Heartbeat API</strong> — limit the frequency of Heartbeat API requests.</li>\n</ul>\n<h4>WordPress admin bar optimization</h4>\n<ul>\n<li><strong>Remove, Hide or Disable top Admin Bar</strong> — completely disables Admin Bar when browsing the website.</li>\n<li><strong>Remove WP Logo from Admin Bar</strong> — removes the WordPress logo, eliminates accidentally clicking on it.</li>\n<li><strong>Replace “Howdy” with “Welcome”</strong> — changes the text of the greetings WordPress for greater presentability and respectful treatment.</li>\n</ul>\n<h4>WordPress posts optimization</h4>\n<ul>\n<li><strong>Disable Revisions</strong> — completely disables posts/pages revisions.</li>\n<li><strong>Limit Revisions</strong> — limits the number of revisions per post/page.</li>\n<li><strong>Disable Autosave</strong> — disables autosaves when editing posts and pages.</li>\n<li><strong>Remove Smart Quotes</strong> — disables automatic insertion of &#8220;typographic quotes&#8221;.</li>\n<li><strong>Remove Auto Paragraph (Wpautop)</strong> — disables texts auto-formatting.</li>\n</ul>\n<h4>WordPress scripts and styles manager (assets manager)</h4>\n<ul>\n<li><strong>Disable Unused Styles of Plugins and Themes</strong> — you can selectively disable styles where they are not need and speed up the website.</li>\n<li><strong>Disable Unused Scripts of Plugins and Themes</strong> — disable scripts wholly or partly and optimize the loading of your website.</li>\n</ul>\n<h4>New useful tools and opportunities for WordPress optimization</h4>\n<p><strong>WP Asset CleanUp Manager (Gonzales)</strong>, <strong>Disable Comments and remove comments in database</strong>, <strong>Heartbeat Control</strong>, <strong>Disable updates and enable automatic plugins and themes updates</strong></p>\n<h3>One click to WordPress optimization</h3>\n<p>As you can see, the Clearfy plugin has a tremendous set of functions for WordPress optimization. In addition, you can turn off any unnecessary function in one click.</p>\n<p>You can forget about opening <code>functions.php</code>, insertion kilometers of code and, in the end, getting critical errors on the website. Also, remember that WordPress is regularly updates and at one not the perfect moment, your site will break, because the manually inserted code has not been updated by anyone. Better, use the Clearfy plugin, which is updates and supports by WordPress professionals and, in addition, does not load your site.</p>\n<p>Of course, there are many similar solutions, but to replace Clearfy, you will need to install about 30 plugins, each of which performs only a small role in WordPress optimization.</p>\n<p>Thus, the Clearfy plugin, amazing with its functions, will be your indispensable assistant to improve:</p>\n<ul>\n<li>security;</li>\n<li>promotion and SEO;</li>\n<li>speed of the website, blog and online store.</li>\n</ul>\n<blockquote>\n<p><strong>Important notice!</strong> Clearfy does not replace defense, promotion and acceleration plugins, it&#8217;s only complements them.</p>\n</blockquote>\n<p>This plugin should be on every WordPress website. Feel free to install this must-have plugin, share it with friends and colleagues to make their sites better and simplify their life!</p>\n<h4>Thanks the authors of plugins</h4>\n<p>We used some useful functions from plugins <strong>WP Asset CleanUp (Gonzales)</strong>, <strong>bicycles by falbar</strong>, <strong>wp disable</strong>, <strong>easy updates manager</strong>, <strong>Disabler</strong>, <strong>Admin Bar Disabler</strong>, <strong>Cerber Security &amp; Antispam</strong>, <strong>Admin Tweaks</strong>, <strong>Autoptimize</strong>, <strong>Fast Velocity Minify</strong>, <strong>Minify HTML</strong>, <strong>Hummingbird Page Speed Optimization</strong>, <strong>WP Super Minify</strong>.</p>\n<h4>Recommended separate add-ons</h4>\n<p>If you think that you do not need all Clearfy features, you can pick up a mini plugin in the list below. Each of these plugins solves only one specific task. All of them are already part of the Clearfy plugin:</p>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/gonzales/\" title=\"WP Asset CleanUp Manager (Gonzales)\" rel=\"ugc\">WordPress Assets manager, dequeue scripts, dequeue styles</a></li>\n<li><a href=\"https://wordpress.org/plugins/comments-plus/\" title=\"Disable Comments for Any Post Types (Disable XML-RPC, Disable Self Pingbacks, Remove Comments)\" rel=\"ugc\">Disable Comments for Any Post Types (Disable XML-RPC, Disable Self Pingbacks, Remove Comments)</a></li>\n<li><a href=\"https://wordpress.org/plugins/webcraftic-updates-manager/\" title=\"Disable updates, Updates manager, Disable automatic updates\" rel=\"ugc\">Disable updates, Updates manager, Disable automatic updates</a></li>\n<li><a href=\"https://wordpress.org/plugins/disable-admin-notices/\" title=\"Disable admin notices individually\" rel=\"ugc\">Disable admin notices individually</a></li>\n<li><a href=\"https://wordpress.org/plugins/cyrlitera/\" rel=\"ugc\">Cyrlitera – transliteration of links and file names</a></li>\n</ul>\n<h4>Translations</h4>\n<ul>\n<li>English (default), always included</li>\n<li>Russian big thanks to <a href=\"http://alexkovalev.me\" title=\"Full stack WordPress developer\" rel=\"nofollow ugc\">Alexander Kovalev</a></li>\n<li>French — big thanks to @kingteamdunet, @fchaussin users</li>\n<li>Italian (70%)</li>\n<li>Chinese — big thanks to @idoog and @robertsky_</li>\n<li>German — big thanks to @moviemaster8</li>\n<li>Dutch (Belgium) — big thanks to sensuelas</li>\n<li>Portuguese (Brazil) &#8211; big thanks to @rdsfelipe</li>\n</ul>\n<p>We are very need for your help with <a href=\"https://translate.wordpress.org/projects/wp-plugins/clearfy\" rel=\"nofollow ugc\">translating the Clearfy plugin</a> into your native language. We want to make it international and understandable for everyone. Please contact us via email inside the plugin, or create a topic on our <a href=\"https://wordpress.org/support/plugin/clearfy\" rel=\"ugc\">support forum</a> if you can help with the translations. In exchange for your help, we will give you better support and our premium plugins absolutely free!</p>\n",
        "installation": "<p>This section describes how to install the plugin and get it working.</p>\n<ol>\n<li>Upload the plugin files to the <code>/wp-content/plugins/plugin-name</code> directory, or install the plugin through the WordPress plugins screen directly.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; screen in WordPress</li>\n<li>Use the Settings-&gt;Clearfy &#8211; disable unused features screen to configure the plugin</li>\n</ol>\n",
        "faq": "\n<dt id='i%20activated%20the%20plugin%20%28or%20individual%20functions%29%20and%20now%20nothing%20works%20%2F%20there%20is%20an%20500%20error%20%2F%20blank%20white%20screen%21'>\nI activated the plugin (or individual functions) and now nothing works / there is an 500 error / blank white screen!\n</h4>\n<p>\n<p>If you have access to the WordPress admin dashboard, just deactivate the plugin. If you do not have access, then remove the plugin via FTP using <a href=\"http://www.wpbeginner.com/plugins/how-to-deactivate-all-plugins-when-not-able-to-access-wp-admin/\" rel=\"nofollow ugc\">this instruction</a>. If you cannot to solve the problem by yourself, do not hurry to write negative feedback. Contact us on the <a href=\"https://wordpress.org/support/plugin/clearfy\" rel=\"ugc\">support forum</a>, and we will solve the problem as quickly as possible.</p>\n</p>\n<dt id='i%27m%20using%20a%20plugin%20that%20has%20some%20of%20clearfy%27s%20functions.%20will%20they%20conflict%20with%20each%20other%3F'>\nI&#8217;m using a plugin that has some of Clearfy&#8217;s functions. Will they conflict with each other?\n</h4>\n<p>\n<p>Similar functions can conflict with each other, but Clearfy is a very flexible tool. Try to disable another plugin and check does the Clearfy satisfy your needs. If does not, just disable the Clearfy functions which intersecting with other plugin and tell us about the missing option on the <a href=\"https://wordpress.org/support/plugin/clearfy\" rel=\"ugc\">support forum</a> or by email, which you can find in the plugin console. We will add them in the following updates.</p>\n<p><em>Example 1</em>. You use Autoptimize for combine and minify. Clearfy perfectly complements this plugin. Simply disable Html Compression in Clearfy and everything will work flawlessly.</p>\n<p><em>Example 2</em>. To control the Heatbeat API, you use the Heartbeat Control plugin. There is a Heartbeat control in Clearfy too. If this is not enough for some reason, just temporarily disable Heartbeat in Clearfy. Then contact us at the <a href=\"https://wordpress.org/support/plugin/clearfy\" rel=\"ugc\">support forum</a> or email, which you will find in the plugin console, and we will add the desired functions in the following updates.</p>\n</p>\n<dt id='do%20i%20need%20to%20remove%20seo%20plugins%20such%20as%20yoast%20seo%2C%20all%20in%20one%20seo%20pack%3F'>\nDo I need to remove SEO plugins such as Yoast SEO, All in One SEO Pack?\n</h4>\n<p>\n<p>No. The Clearfy plugin only complements them, but does not replace.</p>\n</p>\n<dt id='should%20i%20uninstall%20wordpress%20defence%20plugins%20wordfence%20security%20-%20firewall%20%26%20malware%20scan%2C%20all%20in%20one%20wp%20security%20%26%20firewall%2C%20cerber%20security%20%26%20antispam%2C%20ithemes%20security%20and%20others%3F'>\nShould I uninstall WordPress defence plugins Wordfence Security &#8211; Firewall &amp; Malware Scan, All In One WP Security &amp; Firewall, Cerber Security &amp; Antispam, iThemes Security and others?\n</h4>\n<p>\n<p>Absolutely not. On the contrary, we recommend you to install one of them with Clearfy and improve the protection of your website, blog or online store.</p>\n</p>\n<dt id='do%20i%20need%20acceleration%20and%20caching%20plugins%20like%20wp%20super%20cache%2C%20wp%20fastest%20cache%2C%20w3%20total%20cache%2C%20autoptimize%2C%20wp%20rocket%3F'>\nDo I need acceleration and caching plugins like WP Super Cache, WP Fastest Cache, W3 Total Cache, Autoptimize, WP Rocket?\n</h4>\n<p>\n<p>Of course you do. Clearfy helps you with better site caching. If you have <a href=\"https://clearfy.pro/pricing/\" rel=\"nofollow ugc\">Clearfy premium</a> installed, you will not need additional installation of caching plugins. The page caching function is included in the premium Clearfy package.</p>\n</p>\n<dt id='i%20turned%20on%20the%20option%20to%20create%20robots.txt%2C%20but%20nothing%20happens.'>\nI turned on the option to create robots.txt, but nothing happens.\n</h4>\n<p>\n<p>It looks like that there is already has a <code>robots.txt</code> file at the root folder of your website. Delete it and activate the option to create <code>robots.txt</code> again.</p>\n</p>\n<dt id='does%20clearfy%20support%20a%20multisite%20%28network%29%3F'>\nDoes Clearfy support a multisite (network)?\n</h4>\n<p>\n<p>Plugin has support for multisite only in the premium version <a href=\"https://clearfy.pro/pricing/\" rel=\"nofollow ugc\">learn more</a>.</p>\n</p>\n<dt id='can%20i%20ask%20questions%20if%20i%20have%3F'>\nCan I ask questions if I have?\n</h4>\n<p>\n<p>Yes! Email us with address from the Clearfy console or on the <a href=\"https://wordpress.org/support/plugin/clearfy\" rel=\"ugc\">support forum</a>. We will answer your questions. In addition, we will help you to understand the problem and listen to all the wishes for improving the plugin.</p>\n</p>\n<dt id='can%20i%20suggest%20my%20function%3F'>\nCan I suggest my function?\n</h4>\n<p>\n<p>Of course! To do this, email us your wishes with address, which you will find in the plugin console, or create topic on the <a href=\"https://wordpress.org/support/plugin/clearfy\" rel=\"ugc\">support forum</a>.</p>\n</p>\n\n",
        "changelog": "<h4>2.2.3 (17.07.2024)</h4>\n<ul>\n<li>Added: Compatibility with WordPress 6.6</li>\n<li>Fixed: Minor bugs</li>\n</ul>\n<h4>2.2.0 (25.03.2024)</h4>\n<ul>\n<li>Added: Compatibility with php 8.3</li>\n<li>Added: Compatibility with WordPress 6.5</li>\n</ul>\n<h4>2.2.0 (21.11.2023)</h4>\n<ul>\n<li>Added: Compatibility with php 8.2</li>\n<li>Added: Compatibility with WordPress 6.4</li>\n</ul>\n<h4>2.1.9 (26.05.2023)</h4>\n<ul>\n<li>Added: Compatibility with php 8.1</li>\n<li>Fixed: Minor bugs.</li>\n</ul>\n<h4>2.1.5 (22.03.2023)</h4>\n<ul>\n<li>Fixed: Freemius framework conflict</li>\n<li>Added: Compatibility with WordPress 6.2</li>\n</ul>\n<h4>2.1.4 (30.01.2023)</h4>\n<ul>\n<li>Fixed: Minor bugs.</li>\n</ul>\n<h4>2.1.3 (25.12.2022)</h4>\n<ul>\n<li>Added new caching features.</li>\n</ul>\n<h4>2.1.2 (16.11.2022)</h4>\n<ul>\n<li>The caching module is unlocked and now all caching functions are available for free.</li>\n</ul>\n<h4>2.0.6 (29.10.2022)</h4>\n<ul>\n<li>Fixed: Minor bugs.</li>\n</ul>\n<h4>2.0.5 (02.06.2022)</h4>\n<ul>\n<li>Fixed: Security issue</li>\n</ul>\n<h4>2.0.4 (27.05.2022)</h4>\n<ul>\n<li>Added: Compatibility with WordPress 6.0</li>\n</ul>\n<h4>2.0.2 (24.03.2022)</h4>\n<ul>\n<li>Removed code causing rest api blocking for unauthenticated users.</li>\n</ul>\n<h4>2.0.1 (24.03.2022)</h4>\n<ul>\n<li>Added: Compatibility with WordPress 5.9</li>\n</ul>\n<h4>2.0.0 (24.11.2021)</h4>\n<ul>\n<li>Added: Page caching. It creates static HTML files of frontend pages and stores them on the server’s disk. This allows the static HTML files to be delivered instead of generating pages on the fly, avoiding resource intensive backend processes from the WordPress core, plugins, and database.</li>\n<li>Improved: Compatibility with premium plugin</li>\n</ul>\n<h4>1.9.6 (15.09.2021)</h4>\n<ul>\n<li>Fixed: Minor bugs.</li>\n<li>Improved: Compatibility with WordPress 5.8</li>\n</ul>\n<h4>1.9.4 (01.07.2021)</h4>\n<ul>\n<li>Fixed: Bug https://wordpress.org/support/topic/php-fatal-error-261/</li>\n<li>Fixed: Bug https://forum.webcraftic.com/threads/php-notice-undefined-index-path-in.792/</li>\n<li>Added compatibility with premium plugin 1.3.6</li>\n</ul>\n<h4>1.9.3 (31.05.2021)</h4>\n<ul>\n<li>Fixed: Bug https://wordpress.org/support/topic/pagespeed-api-quote-exceeded/</li>\n<li>Fixed: Bug https://wordpress.org/support/topic/random-fatal-error/</li>\n<li>Fixed: Bug https://wordpress.org/support/topic/php-fatal-error-254/</li>\n<li>Fixed: Minor bugs.</li>\n</ul>\n<h4>1.9.1 (12.05.2021)</h4>\n<ul>\n<li>Fixed: Bug with connecting old google analytics. Removed unnecessary Facebook pixel and Google analytics connections.</li>\n<li>[Minify and combine] Now script and style optimization is disabled by default for administrators and authorized users. If you want to enable optimization, you can do so by checking the &#8220;Also optimize JS/CSS for logged in editors/administrators?&#8221;</li>\n</ul>\n<h4>1.9.0 (08.05.2021)</h4>\n<p>In this update, the plugin interface has been simplified, some options have received more automation. In this update, the plugin interface has been simplified, some options have received more automation. Fixed some bugs in the plugin.</p>\n<h4>1.8.9 (06.04.2021)</h4>\n<ul>\n<li>Fixed: Clearfy was blocking htaccess file overwriting in some cases, now the problem is fixed.</li>\n</ul>\n<h4>1.8.8 (05.04.2021)</h4>\n<ul>\n<li>Added: Compatibility with the new version of the premium plugin</li>\n<li>[Minify and Combine] When you aggregate css files into one, the site design can be destroyed, now this bug has been fixed.</li>\n<li>Improved: Compatibility the option &#8220;Remove html comments&#8221; with Gutenberg</li>\n<li>[Assets Manager] Added new &#8220;Query string&#8221; conditional logic. Now you can disable scripts if the query string contains certain variables.</li>\n</ul>\n<h4>1.8.7 (17.03.2021)</h4>\n<ul>\n<li>The plugin now requires php 7 and wordpress 5.2 to work properly.</li>\n</ul>\n<h4>1.8.6 (03.03.2021)</h4>\n<ul>\n<li>Improved: Compatibility with WordPress 5.7</li>\n</ul>\n<h4>1.8.5 (08.02.2021)</h4>\n<ul>\n<li>Fixed: Minor bugs.</li>\n</ul>\n<h4>1.8.4 (08.02.2021)</h4>\n<ul>\n<li>Fixed: Minor bugs in the plugin interface.</li>\n<li>Improved: compatibility with php 8.</li>\n<li>Improved: compatibility with premium plugin.</li>\n<li>Improved: [Disable admin notices] compatibility with Google SiteKit plugin.</li>\n</ul>\n<h4>1.8.3 (25.01.2021)</h4>\n<ul>\n<li>Added: wp rocket compatibility</li>\n<li>Fixed: minor bugs</li>\n</ul>\n<h4>1.8.2 (22.12.2020)</h4>\n<ul>\n<li>Updated: subscription form will disappear from this moment if you have already subscribed.</li>\n<li>Fixed: [Assets manager component] duplicate templates and scripts error when rendering html views of Assets manager.</li>\n</ul>\n<h4>1.8.1 (15.12.2020)</h4>\n<ul>\n<li>Added: Subscribe form</li>\n<li>Fixed: Minor bugs.</li>\n</ul>\n<h4>1.8.0 (20.10.2020)</h4>\n<ul>\n<li>Сompatible with premium plugin 1.1.6. Added page caching feature to premium plugin.</li>\n<li>Fixed: Minor bugs.</li>\n</ul>\n<h4>1.7.4 (16.09.2020)</h4>\n<ul>\n<li>Fixed: Cannot declare class Minify_HTML (Conflict with WP-Optimize).</li>\n</ul>\n<h4>1.7.3 (7.09.2020)</h4>\n<ul>\n<li>Fixed: Critical error in the Gutenberg editor</li>\n</ul>\n<h4>1.7.2 (4.09.2020)</h4>\n<ul>\n<li>Fixed: Error with white screen</li>\n</ul>\n<h4>1.7.1 (4.09.2020)</h4>\n<ul>\n<li>Added: Setup wizard.</li>\n<li>Fixed: Minor bugs.</li>\n</ul>\n<h4>1.7.0</h4>\n<ul>\n<li>Added: Compatibility with WordPress 5.5</li>\n</ul>\n<h4>1.6.9</h4>\n<ul>\n<li>Added: Critical CSS options</li>\n</ul>\n<h4>1.6.8 (3.06.2020)</h4>\n<ul>\n<li>Fixed: critical bug</li>\n</ul>\n<h4>1.6.7 (3.06.2020)</h4>\n<ul>\n<li>Added: options search in the plugin interface. You can enter the option name, the plugin will automatically redirect you to the desired page where the option is located.</li>\n<li>Updated: main navigation menu.</li>\n<li>Fixed: Minor bugs</li>\n</ul>\n<h4>1.6.6 (29.04.2020)</h4>\n<ul>\n<li>Fixed: Minor bugs</li>\n</ul>\n<h4>1.6.5 (28.04.2020)</h4>\n<ul>\n<li>Fixed: The license was activated during synchronization with the server, but the license has not expired yet and was active.</li>\n<li>Fixed: The notification “Please, install premium plugin” no longer appears if the plugin was installed manually.</li>\n<li>Added: Сompatibility with php 7.4</li>\n<li>Added: Сompatibility with WordPress 5.4</li>\n<li>Fixed: [Webcraftic Disable Admin Notices Individually] Conflicts with plugins 404page, Lara’s Google Analytics, YITH WooCommerce Gift Cards</li>\n<li>Fixed: [Minify and combine] Minor bugs.</li>\n</ul>\n<h4>1.6.4 (12.02.2020)</h4>\n<ul>\n<li>Fixed: Minor bugs.</li>\n</ul>\n<h4>1.6.3 (21.01.2020)</h4>\n<ul>\n<li>Fixed: Minor bugs.</li>\n<li>Fixed: Compatibility with Robin image optimizer 1.4.2</li>\n<li>Fixed: Broken links in plugin interface.</li>\n<li>Fixed: Bug with translations of components.</li>\n<li>Fixed: [Minify and combine] compatibility php 7.4</li>\n</ul>\n<h4>1.6.2 (20.11.2019)</h4>\n<ul>\n<li>Fixed: Minor bugs.</li>\n</ul>\n<h4>1.6.1 (13.11.2019)</h4>\n<ul>\n<li>Fixed: Compatibility with WordPress 5.3</li>\n<li>Fixed: [Assets manager component] Minor bugs. Added an admin notice about great release.</li>\n<li>Fixed: [Assets manager component] Conditional logic in the premium plugin didn&#8217;t work in previous version due an error.</li>\n<li>Added: [Assets manager component] You can control asset requires. Now if you disabled asset and it required for which other asset, you will get prompt with warning.</li>\n<li>Added: [Assets manager component] If you click on the &#8220;requires&#8221; tag, you will be gone to the asset for which require the current asset.</li>\n<li>Added: Restored plugin Hide my wp for premium build. And added compatibility Clearfy with Hide my wp.</li>\n</ul>\n<h4>1.6.0 (12.10.2019)</h4>\n<ul>\n<li>Fixed: [Google analytic cache] a bug with creating a local copy of the Google analytics library.</li>\n<li>Fixed: [Assets manager component] fatal error with &#8220;Call to undefined function wp_scripts_get_suffix&#8221;</li>\n<li>Fixed: [Assets manager component] bugs with jquery library and improved compatibility with other optimization plugins.&#8221;</li>\n<li>Fixed: [Robin image optimizer] a bug with converting webp in image optimizer. Under the Clearfy license images weren&#8217;t converted.</li>\n<li>Fixed: Removed ads for premium users</li>\n</ul>\n<h4>1.5.9 (04.10.2019)</h4>\n<ul>\n<li>Fixed: [Assets manager component] fatal error with &#8220;Call to undefined function wbcr_gnz_deploy_mu_plugin()&#8221;</li>\n<li>Fixed: [Assets manager component] fatal error with &#8220;Use of undefined constant WGZ_PLUGIN_DIR&#8221;</li>\n<li>Fixed: Minor bugs with uninstall plugin</li>\n</ul>\n<h4>1.5.7 (04.10.2019)</h4>\n<ul>\n<li>Fixed: [Cyrlitera component] fatal error with &#8220;class &#8216;WCTR_Helper&#8217; not found&#8221;</li>\n</ul>\n<h4>1.5.6 (04.10.2019)</h4>\n<ul>\n<li>[Assets manager component]: The interface has become more compact and friendly.</li>\n<li>[Assets manager component]: The speed and productivity of the editor is increased, it loads faster and does not freeze, as it was before.</li>\n<li>[Assets manager component]: Extended conditional logic has been added, now you can create complex conditions for disabling assets.</li>\n<li>[Assets manager component]: An additional mode has appeared to completely disable the plugin (you can disable not only scripts, but also stop executing plugin scripts).</li>\n<li>[Assets manager component]: Known bugs in the previous version are fixed.</li>\n</ul>\n<h4>1.5.3</h4>\n<ul>\n<li>Fixed: Bug with Elementor plugin. If you enable options &#8220;remove query strings for static resources&#8221;, elementor plugin stopped its work</li>\n<li>Fixed: [Update manager component]: When you disable WordPress core updates, you still see an update notification for version 5.x.x</li>\n<li>Fixed: [Update manager component]: Clearfy compatibility error. Namely, when the component was activated, the cron tasks for checking for updates were not runned.</li>\n<li>Fixed: [Update manager component]: PHP Notice &#8220;Undefined property: stdClass::$plugin&#8221;</li>\n<li>Fixed: [Assets manager component]: Php error &#8220;Cannot use string offset as an array&#8221;</li>\n<li>Fixed: [Assets manager component]: Broken interface and some javascript errors</li>\n<li>Fixed: [Assets manager component]: PHP Notice &#8220;Trying to get property &#8216;taxonomy&#8217; of non-object&#8221;</li>\n<li>Fixed: When you enable the remove meta generator option, meta tag viewport can also be removed.</li>\n<li>Fixed: After enabling the Google Fonts asynchronous option, you could see php notice &#8220;Notice: Trying to get property of non-object&#8221;</li>\n<li>Fixed: Disabling revisions in WordPress 5.0 does not work (Gutenberg).</li>\n<li>Fixed: Compatible with Robin Image Optimizer 1.3.6</li>\n</ul>\n<h4>1.5.0</h4>\n<ul>\n<li>Fixed: Bug when disabling embeds, in WordPress 5.0 did not work editor gutenberg</li>\n</ul>\n<h4>1.4.9</h4>\n<ul>\n<li>Fixed: Bug with Woocommerce Memberships</li>\n<li>Fixed: Bug with License manager</li>\n<li>Fixed: [Cyrlitera component]: when using transliteration on frontend, duplicate pages were created.</li>\n<li>Fixed: [Update manager component]: no longer disables plugin update checking.</li>\n<li>Fixed: [Update manager component]: inverted switches to disable auto-updates.</li>\n<li>Fixed: [Update manager component]: removed the &#8220;Update Manager&#8221; button on the plugin and themes page.</li>\n<li>Fixed: Bug with wbcr_factory_409_imppage_after_form_save: you will no longer see the PHP notification.</li>\n</ul>\n<h4>1.4.6</h4>\n<ul>\n<li>Fixed: Bug when license activated [Call to undefined function mime_content_type].</li>\n<li>Fixed: Disable comments component: [Uncaught Error: Class &#8216;WCTR_Plugin&#8217; not found].</li>\n<li>Fixed: Removed notifications that cannot be dismissed.</li>\n<li>Fixed: Update manager component: [Notice: Trying to get property of non-object].</li>\n<li>Fixed: Update manager component: [Warning: Invalid argument supplied].</li>\n</ul>\n<h4>1.4.5</h4>\n<ul>\n<li>Fixed: Update manager: [Undefined index: clearfy]</li>\n</ul>\n<h4>1.4.4</h4>\n<ul>\n<li>Fixed: Added compatibility with ithemes sync</li>\n<li>Fixed: Assets manager: A bug when the interface did not open on the frontend.</li>\n<li>Fixed: Unlocked multisite support for individual sites. Network management mode, still remained only for premium.</li>\n</ul>\n<h4>1.4.3</h4>\n<ul>\n<li>Fixed: Compatibility with W3 total cache</li>\n<li>Fixed: Compatibility with External Media without Import</li>\n<li>Fixed: Fatal error when activating plugin</li>\n<li>Fixed: Removed tab on the page to get premium for free.</li>\n</ul>\n<h4>1.4.2</h4>\n<ul>\n<li>Fixed: Errors in the plugin on user requests</li>\n<li>New: The Updates Manager component has been completely redesigned, many additional functions have been added.</li>\n<li>New: The Assets Manager component has been completely redesigned, many additional functions have been added.</li>\n<li>New: Friendly interface</li>\n<li>New: Step to php 5.3 and above</li>\n<li>New: Import/export has been moved to the Clearfy Settings page.</li>\n<li>Added: Multisite support for most components.</li>\n<li>Added: Compatibility with external components</li>\n<li>Added: Additional hooks and filters for white label.</li>\n<li>Added: New components.</li>\n</ul>\n<h4>1.3.184</h4>\n<ul>\n<li>Fixed: Critical error with WCL_Helper::minifyHtml()</li>\n<li>Fixed: Disable rest api</li>\n<li>Fixed: Disable emojis</li>\n<li>Fixed: Translations</li>\n<li>Fixed: Bug when loading components with Clearfy business</li>\n<li>Fixed: Added compatibility with Learndash</li>\n</ul>\n<h4>1.3.183</h4>\n<ul>\n<li>Fixed: Critical error when plugin activate</li>\n<li>Fixed: Conflict due to the jsMin library</li>\n<li>Fixed: Crush of the markup for the additional Clearfy menu in the adminbar</li>\n<li>Added: Option to disable the extra Clearfy menu in the adminbar</li>\n</ul>\n<h4>1.3.182</h4>\n<ul>\n<li>Fixed: Critical error when plugin update</li>\n</ul>\n<h4>1.3.181</h4>\n<ul>\n<li>Fixed: Fatal error when plugin update</li>\n</ul>\n<h4>1.3.18</h4>\n<ul>\n<li>Added: new component for image optimization. We’ve created a 100% free solution for image optimization, which is as good as the paid products. The plugin optimizes your images automatically, reducing their weight with no quality loss.</li>\n<li>Added: new component for scripts &amp; styles optimization &#8211; this component combines all your scripts and styles in one file, compresses &amp; caches it.</li>\n<li>Added: new component for HTML compression &#8211; we’ve completely redesigned HTML compression of the pages and added these features to another component. It’s more stable and reliable solution for HTML code optimization of your pages.</li>\n<li>Added: new [premium] component for Hide WordPress &#8211; this premium component helps in hiding your WordPress from hackers and bots. Basically, it disables identification of your CMS by changing directories and files names, removing meta data and replacing HTML content which can provide all information about the platform you use. Most websites can be hacked easily, as hackers and bots know all security flaws in plugins, themes and the WordPress core. You can secure the website from the attack by hiding the information the hackers will need.</li>\n<li>Added: updated the robots.txt layout (like in Yoast studio)</li>\n<li>Fixed: compatibility problems with PHP 7.0 in helpers.php</li>\n<li>Fixed: malfunctioned transliteration in frontend and several custom posts.</li>\n<li>Fixed: php error instead of the warning message, when a user has already had other webcraftic plugins and tried to add Clearfy.</li>\n<li>Fixed: some users had problems with the “Remove post pagination” feature – now this option is marked with grey.</li>\n<li>Fixed: recommended mode for the quick plugin setup has been removed. This has been done because users couldn’t figure out what features they were activating and why.</li>\n<li>Fixed: problems with editing pages in such popular plugins as elementor and visual composer with enabled “Remove versions from request lines” feature. We’ve decided to keep the version in the request line for authorized users.</li>\n<li>Added: you can exclude sending the If-Modified-Since header for the main page, because main pages update really rare.</li>\n<li>Fixed: conflict with the Divi theme – some users were missing the settings panel when the “Hide Admin notification” component was used.</li>\n<li>Fixed: problem with displaying the Font Awesome icons with enabled asynchronous font loading.</li>\n<li>The “Hide login page” module turned into the separate component. It is no longer enabled by default. Attention! If you’ve ever used features associated with hiding login page, then, please, re-activate this component.</li>\n<li>Improvements in activation and deactivation of components.</li>\n<li>Added: premium version support, licensing page and ability to install paid components.</li>\n<li>Donate widget has been removed. Now if you want to support our project, you can switch to the premium version and get the best support &amp; extra features.</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Fixed: Bug with Buddypress (forum issue BUG. Blank Edit buddypress page)</li>\n<li>Fixed: In version 1.2.0, changes were lost 1.9.1 and 1.9.2</li>\n<li>Fixed: Did not work function to remove XFN profiler</li>\n<li>Fixed: Changed the redirect type from 302 to 301 when you try go to through of page navigation.</li>\n<li>Fixed: Problems with translations</li>\n<li>Fixed: Remove comments function kill the tags <!--noindex--><!--/noindex--></li>\n<li>Fixed: [Cyrlitera component] bug with transliteration of file names</li>\n<li>Added: [Cyrlitera component] &#8211; transliteration of cyrillic symbols into Latin alphabet, normalization of file names.</li>\n<li>Added: [Cyrlitera component] Forced transliteration for file names</li>\n<li>Added: [Cyrlitera component] Function of converting files to lowercase</li>\n<li>Added: [Cyrlitera component] Forced transliteration function</li>\n<li>Added: [Cyrlitera component] The function of redirecting old records to new ones</li>\n<li>Added: [Cyrlitera component] Ability to change the base of symbols of transliteration</li>\n<li>Added: [Cyrlitera component] Button for converting old posts, categories, tags</li>\n<li>Added: [Cyrlitera component] Button to restore old links</li>\n<li>Added: Compatibility with PHP 7.2</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Fixed: Google fonts dns-prefetch erroneous deletion</li>\n<li>Fixed: Importing and saving settings issues</li>\n<li>Fixed: The &#8220;Recent Comments&#8221; widget does not deleted</li>\n<li>Fixed: Redirection for rss feeds did not work</li>\n<li>Fixed: urlspan.js was loaded when it was not necessary</li>\n<li>Fixed: &#8220;Disable All WordPress Updates&#8221; deleted notifications in the adminbar</li>\n<li>Fixed: Clearfy and DeliPress сonflict on php 7.1</li>\n<li>Fixed: The gravatars didn&#8217;t turned off when disable comments</li>\n<li>Fixed: Slowing down the plugins page when updates were disabled</li>\n<li>Fixed: Issues with setting alt attributes for images</li>\n<li>Fixed: The plugin interface did not work and the styles were not loaded due to security settings</li>\n<li>ADDED: Plugin options caching to reduce database queries for 90%. Clearfy became lighter and faster.</li>\n<li>ADDED: Compress and cache the plugin core files, to reduce the load on the admin panel</li>\n<li>ADDED: Google Analytics cache</li>\n<li>ADDED: Google Fonts asynchronous</li>\n<li>ADDED: Font Awesome asynchronous</li>\n<li>ADDED: Google Fonts disabling</li>\n<li>ADDED: Google Maps disabling</li>\n<li>ADDED: Dashicons disabling</li>\n<li>ADDED: XFN (XHTML Friends Network) Profile Link disabling</li>\n<li>ADDED: Gravatars disabling</li>\n<li>ADDED: html minification settings was enhanced</li>\n<li>ADDED: Transliteration of Cyrillic alphabet for URLs and filenames</li>\n<li>ADDED: Login page protection (you can rename the login page)</li>\n<li>ADDED: Warnings about plugin conflicts. You can see the warnings if you have plugins&#8217; options which can intersect with Clearfy and cause conflicts.</li>\n</ul>\n<h4>1.1.92</h4>\n<ul>\n<li>Fixed bug: admin area loads slower – when theme and plugin updates: disabled</li>\n<li>Fixed bug: hide errors when logging into the site – breaks login</li>\n</ul>\n<h4>1.1.91</h4>\n<ul>\n<li>Fixed forum issue: [Issue or error caused backend delay] A non-existent style file was called.</li>\n<li>Fixed forum issue: [Error filling Alt, if at the end of the space] Php error prevented the import of goods into Woocomerce, when the option &#8220;Automatically set the alt attribute&#8221; was turned on.</li>\n<li>Fixed bug in tab styles of the plugin control panel</li>\n<li>Fixed bug: don&#8217;t inserted alt attribute text in WooCommerce</li>\n<li>Fixed bug: there were javascript errors when the &#8220;Remove html comments&#8221; option and the nextgen gallery plugin were enabled.</li>\n<li>Fixed bug: plugin doesn&#8217;t change sitemap link in Robots.txt after settings import</li>\n<li>Plugin components settings are now available for export</li>\n<li>The &#8220;Heartbeat frequency&#8221; time range has been increased up to 500 seconds</li>\n</ul>\n<h4>1.1.9</h4>\n<ul>\n<li>Fixed forum issue: [Plugin conflict with “Disable admin top bar”]</li>\n<li>Fixed forum issue: [WooCommerce Order Notes!]</li>\n<li>Fixed forum issue: [Remove html comments DOUBLE setting]</li>\n<li>Fixed: Export/import. Now doesn&#8217;t contain a hidden notification options</li>\n<li>Fixed: Translation</li>\n<li>Fixed: Deleted dangerous options from quick settings</li>\n<li>Fixed: We have moved the plugin menu to the general settings for your comfort. There are new plugin features. Please go to the plugin page to learn more!</li>\n<li>Added a new feature: To restore hidden admin notices individually</li>\n<li>Added a new feature: We have divided plugin features into components. You can turn off unused plugin functions.</li>\n<li>Added a new feature: Added page for cleaning comments</li>\n</ul>\n<h4>1.1.8</h4>\n<ul>\n<li>Added new feature <strong>You will see the link &#8220;Hide notification forever&#8221; in each notice. Push it and they will not bother you anymore.</strong></li>\n<li>Added new feature <strong>Disable/Enable plugin updates individually.</strong></li>\n<li>Added new feature <strong>Disable/Enable plugin auto updates individually.</strong></li>\n<li>Added new feature <strong>Updates nags only for Admin. This plugin allows you to hide the update WordPress reminder from all users that are not assumed Administrators (cannot upgrade plugins).</strong></li>\n<li>Translation into Italian</li>\n<li>Fixed quick mode</li>\n<li>Updated interface style</li>\n<li>Fixed a problem with the fonts in the update manager</li>\n<li>Fixed problem with auto update of plugins and themes</li>\n</ul>\n<h4>1.1.7</h4>\n<ul>\n<li>Fixed bug with disable embeds option</li>\n<li>Fixed bug with core update</li>\n<li>Fixed plugin translation</li>\n<li>Removed CDN package</li>\n</ul>\n<h4>1.1.6</h4>\n<ul>\n<li>Fixed bug reduced plugin weight.</li>\n<li>Fixed JS error with external links option.</li>\n<li>Fixed bug woocommerce with if-modified-since option.</li>\n<li>Fixed bug with loading exists style files with factory bootsrap.</li>\n<li>Upadated design, improved availability for mobile devices.</li>\n<li>Add French translation</li>\n<li>Added assets manager in beta mode. This is a very useful and convenient tool for enabling and disabling file scripts.</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Fixed a bug where you selected the recommended mode, on some pages you see a white screen. Now you will not encounter this error.</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Fixed bug for tag image:image from XML site map in Yoast SEO</li>\n<li>A platform for writing add-ons has been deployed.</li>\n<li>Rename plugin options</li>\n<li>Added new features <strong>Remove html comments</strong></li>\n<li>Added new features <strong>Disable comments, remove comments and close comments</strong></li>\n<li>Added new features <strong>Enable Sanitization of WordPress</strong></li>\n<li>Added new features <strong>Disable admin notice</strong></li>\n<li>Added new features <strong>Disable adminbar</strong></li>\n<li>Added new features <strong>Remove admin bar WP logo</strong></li>\n<li>Added new features <strong>Replace &#8220;Howdy&#8221; text with &#8220;Welcome&#8221;</strong></li>\n<li>Added new features <strong>Disable autosave</strong></li>\n<li>Added new features <strong>Disable capitalization in WordPress branding</strong></li>\n<li>Added new features <strong>Disable WPautop</strong></li>\n<li>Added new features <strong>Disable Heartbeat</strong></li>\n<li>Added new features <strong>Heartbeat frequency</strong></li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Redesigned plugin interface design</li>\n<li>Updated quick setup assistant, now it provides you with information about disabled functions.</li>\n<li>Added plugin import and export settings</li>\n<li>Added new features &#8220;Remove default widgets settings and quick mode&#8221;</li>\n<li>Added new features &#8220;Disable and enable automatic updates of plugin or themes&#8221;</li>\n<li>Added new features &#8220;Disable and enable auto core updates&#8221;</li>\n<li>Added new features &#8220;Disable all updates qick mode&#8221;</li>\n<li>Added donate button</li>\n<li>Update readme.txt</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Fixed caching of styles and scripts</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Hide description for checkbox control</li>\n<li>Added new feature &#8220;Remove Version from Stylesheets&#8221;</li>\n<li>Added new feature &#8220;Remove Version from Scripts&#8221;</li>\n<li>Added new feature &#8220;Marking of safe and warning settings&#8221;</li>\n<li>Added tooltips, instead of short descriptions.</li>\n</ul>\n<h4>1.0.9</h4>\n<ul>\n<li>Added quick start assistant</li>\n<li>Added new feature &#8220;Right robots.txt&#8221;</li>\n<li>Added new feature &#8220;Html minify&#8221;</li>\n<li>Update core functions</li>\n<li>Added new feature &#8220;Redirect Http to Https&#8221;</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Updated readmy.txt file</li>\n<li>Updated translation</li>\n<li>Added new feature &#8220;Disable Embeds&#8221;</li>\n<li>Added new feature &#8220;jQuery Migrate&#8221;</li>\n<li>Added uninstall.php</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Updated readme.txt file</li>\n<li>Translated the plugin into Russian</li>\n</ul>\n"
    },
    "short_description": "Optimize and tweak WordPress by disable unused features. Improve performance, SEO and security using Clearfy — super easy, fast and zero code.",
    "description": "<p>Thousands of users already optimized their WordPress sites with <strong>Clearfy plugin</strong>. It’s multipurpose and free tool with tons of settings. Combine it with other plugins and you’ll get better optimized and secure WordPress website.</p>\n<h3>Optimize SEO and SPEED of your website in 5 minutes</h3>\n<ol>\n<li><strong>Clear website code from trash;</strong></li>\n<li><strong>Eliminate the WordPress vulnerabilities;</strong></li>\n<li><strong>Speed up search engine indexing;</strong></li>\n<li><strong>Fix another plugin’s bugs;</strong></li>\n<li><strong>Make your WordPress easier, more convenient and faster.</strong></li>\n</ol>\n<p>You’ll get <strong>50+</strong> useful functions for your WordPress website optimization, mixed and packed into the only one Clearfy plugin. In addition, we have quality video lessons and tutorials that will help you to understand plugin settings. But don&#8217;t hurry to <strong>download Clearfy</strong> until you know its history and strengths.</p>\n<h4>WordPress optimization plugin Clearfy — the beginning</h4>\n<p>We create plugins, themes and customer’s projects more than 8 years. Every time, we faced the same problem — each project is unique and do not need all WordPress functions which continued to consume hosting resources, make SEO problems and interfered with daily work. To fix this we used our prepared code snippets and wasted many time for theirs testing and revisions. Therefore, we decided to create universal plugin to speed up our work. Using all of our skills, we collected them into one WordPress plugin called <strong>Clearfy</strong>. Initially we used optimization plugin for customer’s projects and ours but later we understood that problem is global so we shared plugin for you absolutely free.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/TtrX7YKdalY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Maybe you know the situations when you need to remove extra code, widget or delete duplicate pages on your website. Sometimes you inserted code snippets, which you have found in web by yourself or spent big money with freelancers. Now you have excellent opportunity to optimize WordPress with Clarify plugin and not waste your time at specialists or use doubtful solutions.</p>\n<h4>How Clearfy will improve WordPress SEO</h4>\n<p>Based on users’ feedback, who optimized WordPress with Clearfy plugin, there is good performance growth at the Pingdom, GTmetrix, Google PageSpeed Insights and YSlow services.</p>\n<p>In addition, we observed important features:</p>\n<ul>\n<li>the page indexing of websites, blogs and online stores has improved;</li>\n<li>the pages became better ranking by search engines after duplicates deletion;</li>\n<li>websites became cleaner for search engines that was improved SEO and traffic.</li>\n</ul>\n<p>Do you want the same or better? <strong>Download Clearfy for free</strong> and see for yourself! Configuring the plugin takes only 5-10 minutes. Just think how long it would be take you to find and configure all optimization scripts, plugins, if you had not the all in one solution Clearfy.</p>\n<h3>More than 50 Clearfy plugin features for WordPress optimization</h3>\n<h4>PAGE CACHING</h4>\n<p>Clearfy Cache is a simple, yet powerful WordPress caching plugin that is easy to use, needs minimal configuration, and best of all helps improve site performance for a faster load time. It creates static HTML files of frontend pages and stores them on the server’s disk. This allows the static HTML files to be delivered instead of generating pages on the fly, avoiding resource intensive backend processes from the WordPress core, plugins, and database.</p>\n<p>HOW DOES THE CACHING WORK? Clearfy Cache captures page contents and saves it as a static HTML file on the server’s disk. The static HTML file created can be one of several possible cache versions depending on the plugin settings and HTTP request. Accepted static HTML files are then delivered without any database queries or on the fly compression, allowing for a quicker page load.</p>\n<ul>\n<li>**Enable Cache</li>\n<li>**Browser Caching (PRO)</li>\n<li>**Mobile Cache (PRO)</li>\n<li>**Widget Cache (PRO)</li>\n</ul>\n<h4>PERFORMANCE OPTIMIZATION</h4>\n<ul>\n<li><strong>Minify HTML</strong> — compresses the code, speeds up the website loading.</li>\n<li><strong>Minify CSS</strong> — you can decrease the size of css files</li>\n<li><strong>Minify JS</strong> — you can decrease the size of css files</li>\n<li><strong>Critical CSS</strong> — Add CSS files or CSS code to the critical section so that it connects at the very beginning of the page.</li>\n<li>**Defer JS &amp; CSS</li>\n</ul>\n<h4>Code cleanup</h4>\n<ul>\n<li><strong>Disable RSS Feeds</strong> — disables RSS if you using WordPress for website only, not for blog.</li>\n<li><strong>Disable Emojis</strong> — emojis generates extra code and slow down the site, even if you did not put any smiley.</li>\n<li><strong>Remove jQuery Migrate</strong> — if you use several popular plugins that are regularly updates, then you can safely delete jQuery Migrate.</li>\n<li><strong>Disable Embeds</strong> — if you do not insert videos into the posts or pages, turn embeds off.</li>\n<li><strong>Remove dns-prefetch</strong> — may improve image loading in some cases.</li>\n<li><strong>Remove RSD link</strong> — if you create posts and pages inside WordPress then you do not need the Real Simple Discovery function.</li>\n<li><strong>Remove wlwmanifest Link</strong> — if you publish posts and pages via WordPress interface, 99% this function is not necessary for you.</li>\n<li><strong>Remove Shortlink</strong> — if you use permalinks, you do not need the shortlinks.</li>\n<li><strong>Remove Previous/Next Post Link in HEAD</strong> — delete previous and next post links if you do not use the blog.</li>\n<li><strong>Remove .recentcomments Styles</strong> — remove if you want to change the &#8220;Related posts&#8221; widget styles.</li>\n</ul>\n<h4>WordPress SEO optimization</h4>\n<ul>\n<li><strong>Automatically insert the alt attribute</strong> — sets the alt attribute for all images in posts and pages, if alt is absent.</li>\n<li><strong>Create the Correct robots.txt</strong> — helps to create the perfect Robots.txt to improve the indexing or close that would not be indexed.</li>\n<li><strong>Insert the Last Modified Header Automatically</strong> — it helps search engines to understand which posts and pages are modified last and index them first.</li>\n<li><strong>Return If-Modified-Since Header</strong> — improves indexing telling to search engines that pages and posts have changed.</li>\n<li><strong>Remove Post Title from Yoast SEO Breadcrumbs</strong> — cuts out the title from breadcrumbs at pages or posts.</li>\n<li><strong>Remove image:image tag from the Yoast SEO XML Sitemap</strong> — eliminates the site map errors at the Yandex Webmaster.</li>\n<li><strong>Disable Schema JSON-LD</strong> — forbids Google to generate advanced search snippet with website page links.</li>\n<li><strong>Disable SEO Yoast&#8217;s Structured Data</strong> — disables structured company data generated by Yoast SEO.</li>\n<li><strong>Remove Yoast SEO Comments from Head Section</strong> — removes data from the code, which tells that your website is optimized by Yoast SEO plugin.</li>\n</ul>\n<h4>Remove WordPress page duplicates</h4>\n<ul>\n<li><strong>Remove Date Archives</strong> — completely removes the date archives and sets the redirect to front-page. </li>\n<li><strong>Remove Author Archives</strong> — completely removes the author archives and sets the redirect to front-page. It is useful if the site&#8217;s author is single.</li>\n<li><strong>Remove Tags Archives</strong> — removes tag archives and redirects to front-page.</li>\n<li><strong>Remove Attachment’s Pages</strong> — by default, each media file has its own page. Clearfy removes them and redirects to the page or post into which this media file was inserted.</li>\n<li><strong>Remove Posts Pagination</strong> — page navigation is not needed with a single post. It is better to delete it and make some posts.</li>\n<li><strong>Remove ?replytocom</strong> — eliminates the posts comments duplicates.</li>\n</ul>\n<h4>WordPress privacy settings</h4>\n<ul>\n<li><strong>Remove Generator Meta Tag</strong> — version info remove.</li>\n<li><strong>Remove Style Files Version</strong> — complicates the process if someone wants to hack your site.</li>\n<li><strong>Remove Javascript Files Version</strong> — it is more difficult to determine the version of installed plugins and hack the site.</li>\n<li><strong>Remove Querystrings</strong> — helps with the caching of JS and CSS and increase the speed of website load.</li>\n<li><strong>Remove HTML Comments</strong> — hacker cannot determine versions of themes and plugins by comments in the code.</li>\n</ul>\n<h4>WordPress defense</h4>\n<ul>\n<li><strong>Hide Author’s Login</strong> — complicates the hacking process. It&#8217;s more difficult to find out your login for hacker.</li>\n<li><strong>Hide WordPress Login Error Messages</strong> — the attacker does not understand what he entered incorrectly, login or password.</li>\n<li><strong>Disable XML-RPC</strong> — disable pingbacks and trackbacks.</li>\n<li><strong>Disable X-Pingback Link</strong> — removes the link and the ability to spam with pingbacks.</li>\n</ul>\n<h4>WordPress widgets</h4>\n<ul>\n<li><strong>WP Widgets Disable</strong> — removes WordPress widgets, all or selectively (Links, Archives, Meta, Search, etc.)</li>\n</ul>\n<h4>WordPress updates: core, plugins, themes</h4>\n<ul>\n<li><strong>Automatic Plugins Updates</strong> — turn it on and you no longer need to think about plugins updates.</li>\n<li><strong>Disable Plugins Updates</strong> — disables plugins updates and updates notices. You can disable updates of all plugins or each individually.</li>\n<li><strong>Automatic Themes Updates</strong> — all of your themes will update automatically.</li>\n<li><strong>Disable Themes Updates</strong> — all of your themes will stop to update and notify about updates.</li>\n<li><strong>Disable Translation Updates</strong> — disables automatic translation updates for themes and plugins.</li>\n<li><strong>WordPress Automatic Updates</strong> — your WordPress will be update automatically.</li>\n<li><strong>Disable WordPress Updates</strong> — completely disables WordPress updates.</li>\n<li><strong>Disable Update Notifications</strong> — users without permissions to update themes, plugins and WordPress will not receive updates notifications.</li>\n</ul>\n<h4>WordPress comments</h4>\n<ul>\n<li><strong>Disable Comments</strong> — allows you to completely disable WordPress comments overall or for selected post types.</li>\n<li><strong>Remove Comments / Delete Comments</strong> — completely removes WordPress comments.</li>\n<li><strong>Close Comments</strong> — completely closes WordPress comments and removes the &#8220;Comments&#8221; section from the left menu.</li>\n<li><strong>Remove URL / Website Field from Comment Form</strong> — removes a comment author Website field.</li>\n<li><strong>Replace Outbound Links in Comments with Javascript</strong> — all external links in comments are reliably closes from search engines indexing.</li>\n<li><strong>Replace Outbound Links of Comment Authors with Javascript</strong> — search engines no longer index links to the comment author&#8217;s site.</li>\n</ul>\n<h4>Admin notices, WordPress updates notifications</h4>\n<ul>\n<li><strong>Disable Admin Notices</strong> — hides all or selected notifications of the WordPress admin.</li>\n</ul>\n<h4>Heartbeat API optimization</h4>\n<ul>\n<li><strong>Disable WordPress Heartbeat API</strong> — completely disables the Heartbeat API WordPress function.</li>\n<li><strong>Limit WordPress Heartbeat API</strong> — limit the frequency of Heartbeat API requests.</li>\n</ul>\n<h4>WordPress admin bar optimization</h4>\n<ul>\n<li><strong>Remove, Hide or Disable top Admin Bar</strong> — completely disables Admin Bar when browsing the website.</li>\n<li><strong>Remove WP Logo from Admin Bar</strong> — removes the WordPress logo, eliminates accidentally clicking on it.</li>\n<li><strong>Replace “Howdy” with “Welcome”</strong> — changes the text of the greetings WordPress for greater presentability and respectful treatment.</li>\n</ul>\n<h4>WordPress posts optimization</h4>\n<ul>\n<li><strong>Disable Revisions</strong> — completely disables posts/pages revisions.</li>\n<li><strong>Limit Revisions</strong> — limits the number of revisions per post/page.</li>\n<li><strong>Disable Autosave</strong> — disables autosaves when editing posts and pages.</li>\n<li><strong>Remove Smart Quotes</strong> — disables automatic insertion of &#8220;typographic quotes&#8221;.</li>\n<li><strong>Remove Auto Paragraph (Wpautop)</strong> — disables texts auto-formatting.</li>\n</ul>\n<h4>WordPress scripts and styles manager (assets manager)</h4>\n<ul>\n<li><strong>Disable Unused Styles of Plugins and Themes</strong> — you can selectively disable styles where they are not need and speed up the website.</li>\n<li><strong>Disable Unused Scripts of Plugins and Themes</strong> — disable scripts wholly or partly and optimize the loading of your website.</li>\n</ul>\n<h4>New useful tools and opportunities for WordPress optimization</h4>\n<p><strong>WP Asset CleanUp Manager (Gonzales)</strong>, <strong>Disable Comments and remove comments in database</strong>, <strong>Heartbeat Control</strong>, <strong>Disable updates and enable automatic plugins and themes updates</strong></p>\n<h3>One click to WordPress optimization</h3>\n<p>As you can see, the Clearfy plugin has a tremendous set of functions for WordPress optimization. In addition, you can turn off any unnecessary function in one click.</p>\n<p>You can forget about opening <code>functions.php</code>, insertion kilometers of code and, in the end, getting critical errors on the website. Also, remember that WordPress is regularly updates and at one not the perfect moment, your site will break, because the manually inserted code has not been updated by anyone. Better, use the Clearfy plugin, which is updates and supports by WordPress professionals and, in addition, does not load your site.</p>\n<p>Of course, there are many similar solutions, but to replace Clearfy, you will need to install about 30 plugins, each of which performs only a small role in WordPress optimization.</p>\n<p>Thus, the Clearfy plugin, amazing with its functions, will be your indispensable assistant to improve:</p>\n<ul>\n<li>security;</li>\n<li>promotion and SEO;</li>\n<li>speed of the website, blog and online store.</li>\n</ul>\n<blockquote>\n<p><strong>Important notice!</strong> Clearfy does not replace defense, promotion and acceleration plugins, it&#8217;s only complements them.</p>\n</blockquote>\n<p>This plugin should be on every WordPress website. Feel free to install this must-have plugin, share it with friends and colleagues to make their sites better and simplify their life!</p>\n<h4>Thanks the authors of plugins</h4>\n<p>We used some useful functions from plugins <strong>WP Asset CleanUp (Gonzales)</strong>, <strong>bicycles by falbar</strong>, <strong>wp disable</strong>, <strong>easy updates manager</strong>, <strong>Disabler</strong>, <strong>Admin Bar Disabler</strong>, <strong>Cerber Security &amp; Antispam</strong>, <strong>Admin Tweaks</strong>, <strong>Autoptimize</strong>, <strong>Fast Velocity Minify</strong>, <strong>Minify HTML</strong>, <strong>Hummingbird Page Speed Optimization</strong>, <strong>WP Super Minify</strong>.</p>\n<h4>Recommended separate add-ons</h4>\n<p>If you think that you do not need all Clearfy features, you can pick up a mini plugin in the list below. Each of these plugins solves only one specific task. All of them are already part of the Clearfy plugin:</p>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/gonzales/\" title=\"WP Asset CleanUp Manager (Gonzales)\" rel=\"ugc\">WordPress Assets manager, dequeue scripts, dequeue styles</a></li>\n<li><a href=\"https://wordpress.org/plugins/comments-plus/\" title=\"Disable Comments for Any Post Types (Disable XML-RPC, Disable Self Pingbacks, Remove Comments)\" rel=\"ugc\">Disable Comments for Any Post Types (Disable XML-RPC, Disable Self Pingbacks, Remove Comments)</a></li>\n<li><a href=\"https://wordpress.org/plugins/webcraftic-updates-manager/\" title=\"Disable updates, Updates manager, Disable automatic updates\" rel=\"ugc\">Disable updates, Updates manager, Disable automatic updates</a></li>\n<li><a href=\"https://wordpress.org/plugins/disable-admin-notices/\" title=\"Disable admin notices individually\" rel=\"ugc\">Disable admin notices individually</a></li>\n<li><a href=\"https://wordpress.org/plugins/cyrlitera/\" rel=\"ugc\">Cyrlitera – transliteration of links and file names</a></li>\n</ul>\n<h4>Translations</h4>\n<ul>\n<li>English (default), always included</li>\n<li>Russian big thanks to <a href=\"http://alexkovalev.me\" title=\"Full stack WordPress developer\" rel=\"nofollow ugc\">Alexander Kovalev</a></li>\n<li>French — big thanks to @kingteamdunet, @fchaussin users</li>\n<li>Italian (70%)</li>\n<li>Chinese — big thanks to @idoog and @robertsky_</li>\n<li>German — big thanks to @moviemaster8</li>\n<li>Dutch (Belgium) — big thanks to sensuelas</li>\n<li>Portuguese (Brazil) &#8211; big thanks to @rdsfelipe</li>\n</ul>\n<p>We are very need for your help with <a href=\"https://translate.wordpress.org/projects/wp-plugins/clearfy\" rel=\"nofollow ugc\">translating the Clearfy plugin</a> into your native language. We want to make it international and understandable for everyone. Please contact us via email inside the plugin, or create a topic on our <a href=\"https://wordpress.org/support/plugin/clearfy\" rel=\"ugc\">support forum</a> if you can help with the translations. In exchange for your help, we will give you better support and our premium plugins absolutely free!</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/clearfy.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/clearfy/assets/screenshot-1.png?rev=1964257",
            "caption": "Control panel quick start"
        },
        {
            "src": "https://ps.w.org/clearfy/assets/screenshot-2.png?rev=1964257",
            "caption": "Image optimizer"
        },
        {
            "src": "https://ps.w.org/clearfy/assets/screenshot-3.png?rev=1964257",
            "caption": "Plugin components"
        },
        {
            "src": "https://ps.w.org/clearfy/assets/screenshot-4.png?rev=1964257",
            "caption": "Update manager"
        },
        {
            "src": "https://ps.w.org/clearfy/assets/screenshot-5.png?rev=1964257",
            "caption": "Assets manager"
        }
    ],
    "tags": {
        "cache": "cache",
        "minify": "minify",
        "optimize": "Optimize",
        "pagespeed": "pagespeed",
        "performance": "performance"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.9": "https://downloads.wordpress.org/plugin/clearfy.1.0.9.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/clearfy.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/clearfy.1.1.2.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/clearfy.1.1.4.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/clearfy.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/clearfy.1.1.8.zip",
        "1.1.92": "https://downloads.wordpress.org/plugin/clearfy.1.1.92.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/clearfy.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/clearfy.1.2.1.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/clearfy.1.3.1.zip",
        "1.3.184": "https://downloads.wordpress.org/plugin/clearfy.1.3.184.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/clearfy.1.4.6.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/clearfy.1.5.0.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/clearfy.1.5.3.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/clearfy.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/clearfy.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/clearfy.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/clearfy.1.6.3.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/clearfy.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/clearfy.1.6.5.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/clearfy.1.6.6.zip",
        "1.6.8": "https://downloads.wordpress.org/plugin/clearfy.1.6.8.zip",
        "1.6.9": "https://downloads.wordpress.org/plugin/clearfy.1.6.9.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/clearfy.1.7.0.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/clearfy.1.7.4.zip",
        "1.8.2": "https://downloads.wordpress.org/plugin/clearfy.1.8.2.zip",
        "1.8.5": "https://downloads.wordpress.org/plugin/clearfy.1.8.5.zip",
        "1.8.7": "https://downloads.wordpress.org/plugin/clearfy.1.8.7.zip",
        "1.8.9": "https://downloads.wordpress.org/plugin/clearfy.1.8.9.zip",
        "1.9.3": "https://downloads.wordpress.org/plugin/clearfy.1.9.3.zip",
        "1.9.6": "https://downloads.wordpress.org/plugin/clearfy.1.9.6.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/clearfy.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/clearfy.2.0.1.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/clearfy.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/clearfy.2.0.5.zip",
        "2.0.6": "https://downloads.wordpress.org/plugin/clearfy.2.0.6.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/clearfy.2.1.2.zip",
        "2.1.4": "https://downloads.wordpress.org/plugin/clearfy.2.1.4.zip",
        "2.1.6": "https://downloads.wordpress.org/plugin/clearfy.2.1.6.zip",
        "2.1.9": "https://downloads.wordpress.org/plugin/clearfy.2.1.9.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/clearfy.2.2.1.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://clearfy.pro/pricing/?utm_source=wordpress.org&utm_campaign=wbcr_clearfy&utm_content=repo",
    "banners": {
        "low": "https://ps.w.org/clearfy/assets/banner-772x250.jpg?rev=2395892",
        "high": "https://ps.w.org/clearfy/assets/banner-1544x500.jpg?rev=2395892"
    },
    "icons": {
        "1x": "https://ps.w.org/clearfy/assets/icon-128x128.gif?rev=2392119",
        "2x": "https://ps.w.org/clearfy/assets/icon-256x256.gif?rev=2392119"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 94,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "clearfy",
            "language": "de_DE",
            "version": "2.2.3",
            "updated": "2024-07-28 11:47:51",
            "package": "http://downloads.wordpress.org/translation/plugin/clearfy/2.2.3/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "clearfy",
            "language": "it_IT",
            "version": "2.2.3",
            "updated": "2024-08-26 04:38:32",
            "package": "http://downloads.wordpress.org/translation/plugin/clearfy/2.2.3/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "clearfy",
            "language": "pt_BR",
            "version": "2.2.3",
            "updated": "2020-03-03 13:14:23",
            "package": "http://downloads.wordpress.org/translation/plugin/clearfy/2.2.3/pt_BR.zip"
        },
        {
            "type": "plugin",
            "slug": "clearfy",
            "language": "ru_RU",
            "version": "2.2.3",
            "updated": "2023-10-04 07:58:39",
            "package": "http://downloads.wordpress.org/translation/plugin/clearfy/2.2.3/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "clearfy",
            "language": "tr_TR",
            "version": "2.2.3",
            "updated": "2021-03-24 12:43:57",
            "package": "http://downloads.wordpress.org/translation/plugin/clearfy/2.2.3/tr_TR.zip"
        },
        {
            "type": "plugin",
            "slug": "clearfy",
            "language": "zh_TW",
            "version": "2.2.3",
            "updated": "2024-05-14 06:44:17",
            "package": "http://downloads.wordpress.org/translation/plugin/clearfy/2.2.3/zh_TW.zip"
        },
        {
            "type": "plugin",
            "slug": "clearfy",
            "language": "zh_CN",
            "version": "2.2.3",
            "updated": "2021-04-01 05:37:17",
            "package": "http://downloads.wordpress.org/translation/plugin/clearfy/2.2.3/zh_CN.zip"
        }
    ]
}