{
    "name": "Official CleverReach® Plugin for WooCommerce",
    "slug": "cleverreach-wc",
    "version": "3.3.2",
    "author": "<a href=\"https://www.cleverreach.com\">CleverReach GmbH & Co. KG</a>",
    "author_profile": "https://profiles.wordpress.org/cleverreach43/",
    "contributors": {
        "cleverreach43": {
            "profile": "https://profiles.wordpress.org/cleverreach43/",
            "avatar": "https://secure.gravatar.com/avatar/afc18921c250c7880b0bb7ce9bf17b87?s=96&d=monsterid&r=g",
            "display_name": "CleverReach®"
        }
    },
    "requires": "4.7",
    "tested": "6.4.5",
    "requires_php": "5.3",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 86,
    "ratings": {
        "5": 3,
        "4": 0,
        "3": 0,
        "2": 1,
        "1": 0
    },
    "num_ratings": 4,
    "support_url": "https://wordpress.org/support/plugin/cleverreach-wc/",
    "support_threads": 2,
    "support_threads_resolved": 0,
    "active_installs": 500,
    "downloaded": 19761,
    "last_updated": "2024-02-13 16:03:00",
    "added": "2019-02-27",
    "homepage": "https://wordpress.org/plugins/cleverreach-wc/",
    "sections": {
        "description": "<p>Spotify, Levi‘s, BMW and DHL create &amp; send their newsletters with CleverReach®. Why? Because it’s simply clever. Do the same with your WooCommerce online shop! Easily and quickly design professional newsletters for your customers with the CleverReach® email marketing software – you don’t need any programming skills. Discover the extensive benefits of our integration solution for your WooCommerce online shop.<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/AR-nGU6OjjM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h4>Advantages of the CleverReach® newsletter plugin</h4>\n<p>The plugin directly connects our CleverReach® Email Marketing Tool with your WooCommerce online shop and creates a recipient list with your newsletter recipients, buyers or other contacts &#8211; you can also select all of them.<br />\nAll your important „WooCommerce“ data is instantly and continuously updated and added to the CleverReach® newsletter tool. The synchronization saves you valuable time and trouble. At the same time, you avoid errors that occur during a manual import or export.</p>\n<p>The following data are continuously synchronized and updated:</p>\n<ul>\n<li>Newsletter subscriptions and unsubscribes</li>\n<li>First and last name, interests, gender, age, date of birth, address details…</li>\n<li>Purchased products, turnover, frequency of purchases, average shopping cart, order number, item number, product name, price, currency, amount…</li>\n<li>Details “Number of orders”, “Total expenses of all orders”, “Last order date“ are automatically saved in your recipient’s dataset and can be used for email marketing automation</li>\n<li>Product details of your WooCommerce products such as image, text, price, size, materials…</li>\n</ul>\n<h4>MORE FEATURES FOR YOUR EMAIL MARKETING</h4>\n<p>Additionally, you can:</p>\n<ul>\n<li>Using segments and tags: segments and tags are automatically created during the synchronization and attached to your recipients. Use e.g., tags to send your customers the latest products and offers via newsletter</li>\n<li>DOI signup forms: add and use a GDPR-compliant CleverReach Double-Opt-in signup forms in the checkout and registration area of your WooCommerce shop</li>\n<li>Abandoned cart emails: Remind customers and guest buyers of their filled shopping carts, if they didn’t complete the purchase process. In addition, you have an overview with the abandoned carts and can e.g. individually manage the emails.</li>\n</ul>\n<p>Because it’s that simple</p>\n<p>Make use of these valuable data to create personal offers your customers really want. Benefit from <strong>more opens, more clicks</strong> and <strong>more conversions!</strong> This is your key to more revenue: Your customers buy more stuff more frequently.</p>\n<h4>THE KEY FEATURES OF CLEVERREACH</h4>\n<ul>\n<li>Simply create and send email newsletters in our multifunctional newsletter editors (e.g. newsletter or classic editor)</li>\n<li>Responsive, free templates for every industry and occasion</li>\n<li>Autoresponders, abandoned cart emails, follow-up emails and much more: easily create automated newsletter workflows with our automation tool THEA</li>\n<li>Analyze your success with our extensive reporting &amp; tracking options and optimize your newsletters.</li>\n<li>Individually segment your recipients with tags and customer details</li>\n<li>Double-Opt-In signup and unsubscribe forms &#8211; GDPR compliant</li>\n<li>Highest security standards, GDPR-compliant, Email Marketing made in Germany</li>\n<li>Free Support</li>\n<li>Always the right price plan: customized, changeable at any time, no contract term &#8211; Scales for small and big contact lists: flex for occasional senders, essential for regular senders or enterprise for big players</li>\n</ul>\n<p>Lots of additional features: Blacklist Check, A/B Split Tests, Design &amp; Spam Tests, image processing RSS-Feeds, dynamic content, Import options, automatic bounce and unsubscribe management, personalized newsletter delivery, Social Media Integration, Reporting &amp; Tracking (open, click and unsubscribe rates), Google Analytics Integration, Conversion Tracking, Lifecycle Email Marketing, Whitelisting, CSA &#8211; Certified Senders Alliance, Newsletter Client Testing, SPF, Senders Policy Framework, Email Authentication, SSL-encryption, surveys, CleverReach Plugin for WordPress (https://wordpress.org/plugins/cleverreach-wp/) and many more!</p>\n<p>If you have any questions, contact our <a href=\"https://support.cleverreach.de/hc/en-us/requests/new\" rel=\"nofollow ugc\">support team</a> &#8211; they’ll be happy to assist you.</p>\n<h4>Exclusively for WooCommerce customers</h4>\n<p>Get a 10% discount off your CleverReach® rate for 12 months! Simply awesome: discount will automatically be provided when creating a new account.</p>\n<h4>About CleverReach®</h4>\n<p>CleverReach® was founded in 2007 and today is one of the internationally leading solution providers for email and newsletter marketing with more than 300,000 customers in 170 countries. A big plus of the German company based in Rastede, besides the user-friendly menu navigation of the software, is the competent customer service and the very fair price-performance ratio. CleverReach® complies with the highest privacy standards exceeding legal requirements.</p>\n",
        "installation": "<ol>\n<li>Upload the plugin folder to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the <code>Plugins</code> menu in WordPress</li>\n</ol>\n",
        "changelog": "<h4>3.3.2 &#8211; February 13, 2024</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Fix push link in plugin dashboard page</li>\n</ul>\n<h4>3.3.1 &#8211; January 17, 2024</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Add compatibility with WooCommerce 8.3</li>\n</ul>\n<h4>3.3.0 &#8211; December 20, 2023</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Optimization: Avoidance of duplicate events during data exchange &#8211; Implementation of task-specific changes</li>\n<li>Optimization: In certain constellations, the integration deleted segments in CR. This behavior has been fixed.</li>\n<li>New blocklisting feature: Before importing, certain email addresses/domains can be excluded via a configuration window in the plugin. Example: Non-valid e-mail addresses generated at the POS (anonymous-customer-100000@example.com) &#8211; More information: https://support.cleverreach.de/hc/en-us/articles/14920866742418</li>\n</ul>\n<h4>3.2.3 &#8211; December 05, 2023</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Fix broken layout on checkout page</li>\n</ul>\n<h4>3.2.2 &#8211; October 23, 2023</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Bug fix when retrieving plugin log files</li>\n<li>Fix send email settings overview on the Abandoned cart page</li>\n</ul>\n<h4>3.2.1 &#8211; August 07, 2023</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Fix problem with tag service &#8211; Due to an earlier update regarding user roles, a fatal php error occurs in some constellations during the payment process</li>\n<li>Add compatibility with php &gt;= 8.0 for initial sync</li>\n</ul>\n<h4>3.2.0 &#8211; July 25, 2023</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Add compatibility with High Performance Order Storage</li>\n</ul>\n<h4>3.1.13 &#8211; July 17, 2023</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Fix problem with updating role capabilities.</li>\n<li>Mark compatibility with WooCommerce 7.8.2.</li>\n</ul>\n<h4>3.1.12 &#8211; March 20, 2023</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Fix enqueuing jquery on checkout.</li>\n</ul>\n<h4>3.1.11 &#8211; January 11, 2023</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Fix alignment of text next to &#8220;Subscribe&#8221; button on checkout.</li>\n</ul>\n<h4>3.1.10 &#8211; November 17, 2022</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Fix enqueue jquery.</li>\n</ul>\n<h4>3.1.9 &#8211; September 27, 2022</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Changed product search image width size to width=600px.</li>\n</ul>\n<h4>3.1.8 &#8211; August 15, 2022</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Add missing translations.</li>\n</ul>\n<h4>3.1.7 &#8211; July 19, 2022</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Fixed the issue with the plugin database installation in SnapshotService.</li>\n</ul>\n<h4>3.1.6 &#8211; July 18, 2022</h4>\n<p><strong>Rebranding</strong></p>\n<ul>\n<li>Updated the CleverReach icon and logo.</li>\n</ul>\n<h4>3.1.5 &#8211; March 16, 2022</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Optimization: Update translation for initial synchronization status.</li>\n</ul>\n<h4>3.1.4 &#8211; March 7, 2022</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Fix: Fixed dynamic content search.</li>\n</ul>\n<h4>3.1.3 &#8211; February 9, 2022</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Optimization: Increased column data size for initial synchronization.</li>\n</ul>\n<h4>3.1.2 &#8211; December 20, 2021</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Optimization: Increased product search image size in the new email editor.</li>\n<li>Optimization: Optimized database queries for fetching the data.</li>\n<li>Enhancement: Added async request option through support console.</li>\n</ul>\n<h4>3.1.1 &#8211; November 16, 2021</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Updating ///PUSH blog links on plugin dashboard page.</li>\n</ul>\n<h4>3.1.0 &#8211; October 25, 2021</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>New feature: Send abandoned cart emails automatically with our Marketing Automation. The new plugin tab “Abandoned Cart” is available for you. You can create your own automation per store and increase your sales with this reminder email. You can find instructions on how to do this here: <a href=\"https://support.cleverreach.de/hc/en-us/articles/4404430325266\" rel=\"nofollow ugc\">https://support.cleverreach.de/hc/en-us/articles/4404430325266</a> &#8211; Note: The prerequisite for receiving abandoned cart emails is a double opt-in &#8211; This ensures complete DSGVO compliance.</li>\n<li>Additionally an overview of abandoned carts (If the abandoned cart feature is enabled in the CleverReach plugin). In the WooCommerce backend, the overview can be found via &#8220;Orders -&gt; Abandoned Carts&#8221;. Here you can view all open or completed shopping carts and the status of CleverReach &#8220;Abandoned cart emails&#8221; sent via our THEA Marketing Automation. The overview includes scheduled time, sender time, amount, email address, store, recovery status, and other features. In addition, the direct and immediate sending of an abandoned cart email can be started, or the sending can be canceled. A search &amp; filter function can also be used to filter directly by email addresses or time periods.</li>\n</ul>\n<h4>3.0.1 &#8211; July 27, 2021</h4>\n<p><strong>Optimization</strong></p>\n<ul>\n<li>Added more security validations.</li>\n</ul>\n<h4>3.0.0 &#8211; June 23, 2021</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Complete UI redesign based on the WooCommerce CI.</li>\n<li>The user can decide for himself who will be actively transferred. Before the initial import of the data, the user can select whether only newsletter recipients, purchasing customers or other contacts should be transferred. Of course, everything can be selected. The data are created in CleverReach as active recipients in the &#8220;WooCommerce&#8221; group. Detailed instructions on the new procedure can be found at <a href=\"https://support.cleverreach.de/hc/de/articles/360013571280\" rel=\"nofollow ugc\">https://support.cleverreach.de/hc/de/articles/360013571280</a> &#8211; The initial synchronization can also be changed again later in the plugin via the plugin settings.</li>\n<li>Complete bidirectional synchronization (WooCommerce  CleverReach). The data is synchronized in both directions. If the address in the record at CleverReach changes, this is also transferred to WooCommerce. Unsubscribes in CleverReach system will also be transferred to WooCommerce, as usual, and set the customer in WooCommerce to &#8220;email status = inactive&#8221;. Example: If the recipient added, updated, signed up for newsletter or unsubscribed in CleverReach, these changes will be passed to WooCommerce. The other way around from WooCommerce to CleverReach as well, of course.</li>\n<li>Tag based email creation process in the old CleverReach editor is available.</li>\n<li>New data fields: Number of orders &amp; total spend across all orders. Example: Using the &#8220;Number of Orders&#8221; data field, I can filter by how many orders a KD has placed to specifically target KDs that have placed more than 50 orders. With the field &#8220;Total orders spent&#8221; I can, for example, write to all KDs who have spent more than 1000 euros in my store.</li>\n<li>For new customers, an email draft is automatically created to facilitate onboarding.</li>\n<li>Use of product categories, product tags, product attributes &amp; product manufacturer as tags. Example: A customer has bought a black Adidas shoe from the category Shoes &#8211; This results in the following tags in CR for this recipient: WooCommerce-Category.Shoes // WooCommerce-Color.Black // WooCommerce-Manufacturer.Adidas &#8211; These tags can be used for a more targeted segmentation.</li>\n<li>Migration from v2 users to v3. Existing CleverReach users using the WooCommerce integration will be easily migrated to the new version without the need to re-register. Within the migration process, all WooCommerce customers who have activated the newsletter will be automatically transferred to CleverReach as active recipients. Other recipient groups (purchase customers or contacts) are neither synchronized nor deleted in CleverReach. The merchant can activate the synchronization of contacts or purchase customers under the &#8220;Sync Settings&#8221; tab at any time after the migration.</li>\n</ul>\n<h4>1.4.8 &#8211; January 13, 2021</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>New feature: Newsletter checkbox in checkout can be disabled.</li>\n<li>New feature: The text for the checkbox can be set by yourself via the new tab in the plugin “Settings.</li>\n</ul>\n<h4>1.4.7 &#8211; August 12, 2020</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Optimization: Compatibility with WordPress 5.5 and WooCommerce 4.3.2.</li>\n<li>Optimization: Fix issue with session close.</li>\n</ul>\n<h4>1.4.6 &#8211; July 9, 2020</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Optimization: Compatibility for WooCommerce 4.2.2.</li>\n<li>Optimization: Fix issue with session read and close.</li>\n</ul>\n<h4>1.4.5 &#8211; Jun 2, 2020</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Optimization: Compatibility with WooCommerce 4.1.1 and WordPress 5.4.</li>\n</ul>\n<h4>1.4.4 &#8211; May 20, 2020</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Optimization: Remove subscribe checkbox from checkout when user already subscribed to newsletter.</li>\n<li>Optimization: Added notification if connection with the CleverReach is lost.</li>\n</ul>\n<h4>1.4.3 &#8211; April 06, 2020</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Optimization: The message “Account ID is null” was fixed. When the connection between WooCommerce and CleverReach is lost. The account ID is cached so that the login works correctly again.</li>\n<li>Optimization: Compatibility with WooCommerce 4.0.1</li>\n</ul>\n<h4>1.4.2 &#8211; Feb 20, 2020</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>Optimization: Compatibility for WooCommerce 3.9.2</li>\n</ul>\n<h4>1.4.1 &#8211; Dec 11, 2019</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>New feature: Products can be searched by ID in CleverReach emails.</li>\n</ul>\n<h4>1.4.0 &#8211; Nov 14, 2019</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>New feature: A new data field with the name &#8220;Last order date&#8221; is automatically created in CleverReach. The last order date of a customer is automatically stored in the data field if a new order has been made placed. For example, you can create a segment in CleverReach and trigger an automation chain for all those who have not bought anything for 90 days.</li>\n<li>New feature: If the import of customer data takes longer than 30 seconds, a message is displayed that the import will continue in the background. In the meantime, you can already create your mailing.</li>\n<li>Optimization: A verification was added to check whether the connection from WooCommerce to CleverReach still exists. As soon as the plugin is loaded, the plugin checks in the background whether the connection is still established. If the connection was lost, a message appears to reconnect to your CleverReach account.</li>\n<li>Optimization: When the connection with CleverReach is lost, all changes in the system will be tracked in the background. As soon as CleverReach user reconnect again, all changes will be synchronized to CleverReach.</li>\n<li>Optimization: Compatibility for WordPress 5.3 and WooCommerce 3.8.0</li>\n</ul>\n<h4>1.2.0 &#8211; Sep 16, 2019</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>New feature: New CleverReach customers will get personalized dashboard in CleverReach. Example: &#8220;Hello John &#8211; Welcome to CleverReach&#8221;.</li>\n<li>Optimization: CleverReach Log-in screen will be displayed as an iframe now.</li>\n</ul>\n<h4>1.1.0 &#8211; May 27, 2019</h4>\n<p><strong>Updates</strong></p>\n<ul>\n<li>New function: Single-Sign-On (one-time login) has been added. After the data transfer you will be logged in directly to CleverReach and can create your e-mails</li>\n<li>Optimization: Faster transfer of data</li>\n<li>Optimization: Existing address data fields remain unchanged and are not overwritten with an empty data set</li>\n<li>Optimization: Import and use of order information within CleverReach improved</li>\n</ul>\n<h4>1.0.1 &#8211; March 18, 2019</h4>\n<p><strong>Fixes</strong></p>\n<ul>\n<li>Fixed problem with getting WooCommerce plugin information.</li>\n</ul>\n"
    },
    "short_description": "Connect your WooCommerce store to our email software and say hello to successful and simple newsletter marketing – just like Spotify, Bugatti &amp; DHL!",
    "description": "<p>Spotify, Levi‘s, BMW and DHL create &amp; send their newsletters with CleverReach®. Why? Because it’s simply clever. Do the same with your WooCommerce online shop! Easily and quickly design professional newsletters for your customers with the CleverReach® email marketing software – you don’t need any programming skills. Discover the extensive benefits of our integration solution for your WooCommerce online shop.<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/AR-nGU6OjjM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h4>Advantages of the CleverReach® newsletter plugin</h4>\n<p>The plugin directly connects our CleverReach® Email Marketing Tool with your WooCommerce online shop and creates a recipient list with your newsletter recipients, buyers or other contacts &#8211; you can also select all of them.<br />\nAll your important „WooCommerce“ data is instantly and continuously updated and added to the CleverReach® newsletter tool. The synchronization saves you valuable time and trouble. At the same time, you avoid errors that occur during a manual import or export.</p>\n<p>The following data are continuously synchronized and updated:</p>\n<ul>\n<li>Newsletter subscriptions and unsubscribes</li>\n<li>First and last name, interests, gender, age, date of birth, address details…</li>\n<li>Purchased products, turnover, frequency of purchases, average shopping cart, order number, item number, product name, price, currency, amount…</li>\n<li>Details “Number of orders”, “Total expenses of all orders”, “Last order date“ are automatically saved in your recipient’s dataset and can be used for email marketing automation</li>\n<li>Product details of your WooCommerce products such as image, text, price, size, materials…</li>\n</ul>\n<h4>MORE FEATURES FOR YOUR EMAIL MARKETING</h4>\n<p>Additionally, you can:</p>\n<ul>\n<li>Using segments and tags: segments and tags are automatically created during the synchronization and attached to your recipients. Use e.g., tags to send your customers the latest products and offers via newsletter</li>\n<li>DOI signup forms: add and use a GDPR-compliant CleverReach Double-Opt-in signup forms in the checkout and registration area of your WooCommerce shop</li>\n<li>Abandoned cart emails: Remind customers and guest buyers of their filled shopping carts, if they didn’t complete the purchase process. In addition, you have an overview with the abandoned carts and can e.g. individually manage the emails.</li>\n</ul>\n<p>Because it’s that simple</p>\n<p>Make use of these valuable data to create personal offers your customers really want. Benefit from <strong>more opens, more clicks</strong> and <strong>more conversions!</strong> This is your key to more revenue: Your customers buy more stuff more frequently.</p>\n<h4>THE KEY FEATURES OF CLEVERREACH</h4>\n<ul>\n<li>Simply create and send email newsletters in our multifunctional newsletter editors (e.g. newsletter or classic editor)</li>\n<li>Responsive, free templates for every industry and occasion</li>\n<li>Autoresponders, abandoned cart emails, follow-up emails and much more: easily create automated newsletter workflows with our automation tool THEA</li>\n<li>Analyze your success with our extensive reporting &amp; tracking options and optimize your newsletters.</li>\n<li>Individually segment your recipients with tags and customer details</li>\n<li>Double-Opt-In signup and unsubscribe forms &#8211; GDPR compliant</li>\n<li>Highest security standards, GDPR-compliant, Email Marketing made in Germany</li>\n<li>Free Support</li>\n<li>Always the right price plan: customized, changeable at any time, no contract term &#8211; Scales for small and big contact lists: flex for occasional senders, essential for regular senders or enterprise for big players</li>\n</ul>\n<p>Lots of additional features: Blacklist Check, A/B Split Tests, Design &amp; Spam Tests, image processing RSS-Feeds, dynamic content, Import options, automatic bounce and unsubscribe management, personalized newsletter delivery, Social Media Integration, Reporting &amp; Tracking (open, click and unsubscribe rates), Google Analytics Integration, Conversion Tracking, Lifecycle Email Marketing, Whitelisting, CSA &#8211; Certified Senders Alliance, Newsletter Client Testing, SPF, Senders Policy Framework, Email Authentication, SSL-encryption, surveys, CleverReach Plugin for WordPress (https://wordpress.org/plugins/cleverreach-wp/) and many more!</p>\n<p>If you have any questions, contact our <a href=\"https://support.cleverreach.de/hc/en-us/requests/new\" rel=\"nofollow ugc\">support team</a> &#8211; they’ll be happy to assist you.</p>\n<h4>Exclusively for WooCommerce customers</h4>\n<p>Get a 10% discount off your CleverReach® rate for 12 months! Simply awesome: discount will automatically be provided when creating a new account.</p>\n<h4>About CleverReach®</h4>\n<p>CleverReach® was founded in 2007 and today is one of the internationally leading solution providers for email and newsletter marketing with more than 300,000 customers in 170 countries. A big plus of the German company based in Rastede, besides the user-friendly menu navigation of the software, is the competent customer service and the very fair price-performance ratio. CleverReach® complies with the highest privacy standards exceeding legal requirements.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.3.2.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/cleverreach-wc/assets/screenshot-1.png?rev=2758238",
            "caption": "Automatically transfer your contacts to a recipient list"
        },
        {
            "src": "https://ps.w.org/cleverreach-wc/assets/screenshot-2.png?rev=2758238",
            "caption": "Get started after just a couple of seconds!"
        },
        {
            "src": "https://ps.w.org/cleverreach-wc/assets/screenshot-3.png?rev=2758238",
            "caption": "Get to know your customers better and send them newsletters based on their interests"
        },
        {
            "src": "https://ps.w.org/cleverreach-wc/assets/screenshot-4.png?rev=2758238",
            "caption": "Always be on the legally secure side with our GDPR-compliant signup forms"
        },
        {
            "src": "https://ps.w.org/cleverreach-wc/assets/screenshot-5.png?rev=2758238",
            "caption": "Insert your products in a free email template via drag &amp; drop with just one click"
        },
        {
            "src": "https://ps.w.org/cleverreach-wc/assets/screenshot-6.png?rev=2758238",
            "caption": "Send out discount, transactional emails and more to your customers with email automation"
        },
        {
            "src": "https://ps.w.org/cleverreach-wc/assets/screenshot-7.png?rev=2758238",
            "caption": "All newsletter KPIs at a glance: track your success with email marketing key figures"
        },
        {
            "src": "https://ps.w.org/cleverreach-wc/assets/screenshot-8.png?rev=2758238",
            "caption": "Welcome to our Email Marketing Solution!"
        }
    ],
    "tags": {
        "email": "email",
        "email-marketing-tool": "email marketing tool",
        "newsletter": "newsletter",
        "newsletter-marketing": "newsletter marketing",
        "software": "software"
    },
    "stable_tag": "3.3.2",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.0.1.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.1.0.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.2.0.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.3.1.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.4.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.4.5.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.4.6.zip",
        "1.4.7": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.4.7.zip",
        "1.4.8": "https://downloads.wordpress.org/plugin/cleverreach-wc.1.4.8.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.0.1.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.0.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.1.zip",
        "3.1.10": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.10.zip",
        "3.1.11": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.11.zip",
        "3.1.12": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.12.zip",
        "3.1.13": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.13.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.2.zip",
        "3.1.3": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.3.zip",
        "3.1.4": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.4.zip",
        "3.1.5": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.5.zip",
        "3.1.6": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.6.zip",
        "3.1.7": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.7.zip",
        "3.1.8": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.8.zip",
        "3.1.9": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.1.9.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.2.1.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.2.2.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.2.3.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.3.0.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.3.1.zip",
        "3.3.2": "https://downloads.wordpress.org/plugin/cleverreach-wc.3.3.2.zip",
        "trunk": "https://downloads.wordpress.org/plugin/cleverreach-wc.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/cleverreach-wc/assets/banner-772x250.png?rev=2758238",
        "high": "https://ps.w.org/cleverreach-wc/assets/banner-1544x500.png?rev=2758238"
    },
    "icons": {
        "1x": "https://ps.w.org/cleverreach-wc/assets/icon-256x256.png?rev=2758238",
        "2x": "https://ps.w.org/cleverreach-wc/assets/icon-256x256.png?rev=2758238"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 86,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "cleverreach-wc",
            "language": "es_VE",
            "version": "3.3.2",
            "updated": "2021-06-27 08:55:02",
            "package": "http://downloads.wordpress.org/translation/plugin/cleverreach-wc/3.3.2/es_VE.zip"
        },
        {
            "type": "plugin",
            "slug": "cleverreach-wc",
            "language": "es_ES",
            "version": "3.3.2",
            "updated": "2021-06-23 16:45:03",
            "package": "http://downloads.wordpress.org/translation/plugin/cleverreach-wc/3.3.2/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "cleverreach-wc",
            "language": "es_MX",
            "version": "3.3.2",
            "updated": "2021-12-11 21:33:33",
            "package": "http://downloads.wordpress.org/translation/plugin/cleverreach-wc/3.3.2/es_MX.zip"
        }
    ]
}