{
    "name": "Google Maps CP",
    "slug": "codepeople-post-map",
    "version": "1.1.7",
    "author": "<a href=\"http://wordpress.dwbooster.com/content-tools/codepeople-post-map\">CodePeople</a>",
    "author_profile": "https://profiles.wordpress.org/codepeople/",
    "contributors": {
        "codepeople": {
            "profile": "https://profiles.wordpress.org/codepeople/",
            "avatar": "https://secure.gravatar.com/avatar/c0662edcefb5a4e2ab12803856ba2358?s=96&d=monsterid&r=g",
            "display_name": "codepeople"
        }
    },
    "requires": "3.0.5",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 82,
    "ratings": {
        "5": 22,
        "4": 3,
        "3": 0,
        "2": 1,
        "1": 6
    },
    "num_ratings": 32,
    "support_url": "https://wordpress.org/support/plugin/codepeople-post-map/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 5000,
    "downloaded": 419652,
    "last_updated": "2024-07-04 12:00pm GMT",
    "added": "2012-10-01",
    "homepage": "http://wordpress.dwbooster.com/content-tools/codepeople-post-map",
    "sections": {
        "description": "<p>Google Map features:</p>\n<p>► Insert a Google map in the best position within your blog<br />\n► Deal with large volumes of dots or markers on the Google Maps<br />\n► Uses Google Maps to discover additional entries related to the post<br />\n► The location can be defined by physical address and point coordinates<br />\n► Map markers customization<br />\n► Allows to embed Google Maps in multiple languages<br />\n► Allows several Google Maps controls and configuration options</p>\n<p><strong>Google Maps CP</strong> allows to insert a Google Maps in a post or in any of the WordPress templates that display multiple posts.</p>\n<p>The Google Maps inserted in a single post displays a marker at the position indicated by the geolocation information pertaining to the post, but also shows markers of the last posts published in related categories. The number of markers to display on the Google Maps can be set in the plugin&#8217;s settings.</p>\n<p>The Google Maps inserted into a template displaying multiple posts will contain as many markers as posts making up the page with the associated geolocation info. When the mouse is hovered over the marker, the post to which it belongs gets highlighted.</p>\n<p><strong>Google Maps</strong> has a wide range of settings to make your maps more versatile and adaptable.</p>\n<p><strong>More about the Main Features of Google Maps CP:</strong></p>\n<ul>\n<li>The plugin is capable of dealing with <strong>large volumes of dots or markers</strong>.</li>\n<li>Another way for users to discover <strong>additional entries related</strong> to the post.</li>\n<li>The <strong>location information</strong> can be defined by physical address and point coordinates.</li>\n<li>Allows to <strong>insert the Google Maps</strong> in the best position within your blog or simply <strong>associate the geolocation information</strong> to the post but without displaying the Google maps.</li>\n<li>Markers <strong>customization</strong>.</li>\n<li>Display or hide the bubbles with markers information.</li>\n<li>Allows to display a bubble opened by default.</li>\n<li>Based on <strong>Google Maps Javascript API Version 3</strong>.</li>\n<li>Allows to embed Google maps in <strong>multiple languages</strong>.</li>\n<li>Displays <strong>markers</strong> belonging to posts of the same categories.</li>\n<li><strong>Several customization options</strong> are available: initial zoom, width, height, margins, alignment, map type, map language, the way the map is displayed in a single post (either fully deployed or icon to display the Google maps), enable or disable map controls, the number of points plotted on a Google map, as well as the class that will be assigned to the post when the mouse hovers over the marker associated with the post.</li>\n</ul>\n<p><strong>Premium Features of Google Maps CP:</strong></p>\n<ul>\n<li>Load points belonging to specific pages or posts.</li>\n<li>Load in a same map all points that belong to a specific category.</li>\n<li>Load in a same map the points associated to all posts.</li>\n<li>Display the points that belong to the posts with a specific tag.</li>\n<li>The location information and description may be used in posts search.</li>\n<li>Allows to associate multiple Google maps points to each post/page.</li>\n<li>Allows to draw routes through points in the same post.</li>\n<li>Include a search box on the map for searching additional places.</li>\n<li>Draw shapes on the Google Maps.</li>\n<li>Allows to create a legend with categories, tags, or custom taxonomies, and display or hide the points, checking or unchecking legend items.</li>\n<li>Include a link to get directions to the point from Google Maps.</li>\n<li>Include a link to open the point directly on Google Maps.</li>\n<li>Include a link to display directly the street view in the specific point.</li>\n<li>Allows to display multiple Google Maps in the same post/page (but displays the same points in all maps on page).</li>\n<li>Allows to insert the map as widget on sidebars.</li>\n<li>Allows to styling the map.</li>\n<li>Allows grouping multiple markers in a cluster.</li>\n<li>Allows to display the user location on map.</li>\n<li>Allows to refresh the user location on map in the time interval defined in the map&#8217;s settings.</li>\n<li>Generates dynamic points from the geolocation information, stored in the image&#8217;s metadata when it is uploaded to WordPress, and includes a button for processing all previous images.</li>\n<li>Generates dynamic points on map, relative to the geolocation information, assigned to the posts from WordPress App.</li>\n<li>Allows to associate the Google maps with any public post_type in WordPress.</li>\n<li>In non singular webpages, Google Maps display a map for each post.</li>\n<li>Allows to export all points defined in the website to a CSV file.</li>\n<li>Allows to import the points from a CSV or KML file.</li>\n<li>Allows to load a KML layer on the map from a KML file.</li>\n</ul>\n<p>The third, and most extended version of the plugin is the &#8220;Developer Version&#8221;. The Developer version of the Google Maps CP plugin includes all features of the Premium version, and the features listed below:</p>\n<p><strong>Developer Features of Google Maps CP</strong></p>\n<ul>\n<li>Allows design a Contact Form, and associate it with the points in the map.</li>\n<li>Send notification emails with the information collected by the form.</li>\n<li>Associate an email address to the points, to contact a different person by each point, or a global email address to be notified from all points.</li>\n<li>Supports Contact Form 7 plugin&#8217;s forms in the points&#8217; descriptions by inserting their shortcodes ( [contact-form-7 id=&#8221;1&#8243; title=&#8221;Contact Form&#8221; label=&#8221;Click Here&#8221;] )</li>\n<li>Allows to use the image associated with the point as the point&#8217;s icon on map.</li>\n</ul>\n<p><strong>Demo of the Developer Version of Google Maps CP Plugin</strong></p>\n<p><a href=\"https://demos.dwbooster.com/cp-google-maps/wp-login.php\" title=\"Click to access the administration area demo\" rel=\"nofollow ugc\">https://demos.dwbooster.com/cp-google-maps/wp-login.php</a></p>\n<p><a href=\"https://demos.dwbooster.com/cp-google-maps/\" title=\"Click to access the Public Page\" rel=\"nofollow ugc\">https://demos.dwbooster.com/cp-google-maps/</a></p>\n<p>Note 1: To display all points that belong to a specific category in the same Google Map, it is required to insert the following shortcode <code>[codepeople-post-map cat=\"3\"]</code>. The number 3 represent the category ID, replace this number by the corresponding category&#8217;s ID. To insert the code directly in a template, the snippet of code would be:</p>\n<pre><code>&lt;?php echo do_shortcode('[codepeople-post-map cat=\"3\"]'); ?&gt;\n</code></pre>\n<p>Note 2: To display all points that belong to more than one category in a same Google Map, separate the categories IDs with the comma symbol <code>[codepeople-post-map cat=\"3,5\"]</code>. The numbers 3 y 5 are the categories IDs, replace these numbers by the corresponding categories IDs. To insert the code directly in a template, the snippet of code would be:</p>\n<pre><code>&lt;?php echo do_shortcode('[codepeople-post-map cat=\"3,5\"]'); ?&gt;\n</code></pre>\n<p>Note 3: To display all points defined in the website in a same Google Map, use -1 as the category&#8217;s ID:</p>\n<pre><code>[codepeople-post-map cat=\"-1\"]\n</code></pre>\n<p>or</p>\n<pre><code>&lt;?php echo do_shortcode('[codepeople-post-map cat=\"-1\"]'); ?&gt; for template.\n</code></pre>\n<p>Note 4: To display all points that belong to the posts with a specific tag assigned in a same Google Map, for example the tag name &#8220;mytag&#8221;, use the shortcode&#8217;s attribute &#8220;tag&#8221;, as follows: <code>[codepeople-post-map tag=\"mytag\"]</code>. To insert the code directly in a template, the snippet of code would be:</p>\n<pre><code>&lt;?php echo do_shortcode('[codepeople-post-map tag=\"mytag\"]'); ?&gt;\n</code></pre>\n<p>Note 5: To display the points belonging to specific posts or pages in a same Google Map, enter their ids separated by comma through the &#8220;id&#8221; attribute in the shortcode as follows: <code>[codepeople-post-map id=\"123\"]</code>. To insert the code directly in a template, the snippet of code would be:</p>\n<pre><code>&lt;?php echo do_shortcode('[codepeople-post-map id=\"123\"]'); ?&gt;\n</code></pre>\n<p>The &#8220;id&#8221; attribute has preference over the rest of the filtering attributes.</p>\n<p>If you prefer configure your map directly from the shortcode, then you must enter an attribute for each map feature to specify. For example:</p>\n<pre><code>[codepeople-post-map width=\"500\" height=\"500\"]\n</code></pre>\n<p>The complete list of allowed attributes are:</p>\n<p>Very Important. Some of attributes are available only in the premium and developer versions of the plugin.</p>\n<p>width:  Values allowed, number or percentage. Defines the map&#8217;s width:</p>\n<pre><code>[codepeople-post-map width=\"300\"]\n</code></pre>\n<p>or</p>\n<pre><code>[codepeople-post-map width=\"100%\"]\n</code></pre>\n<p>height:  Values allowed, number or percentage (In the web&#8217;s development, the height in percentage is effective only if the parent element has a height defined). Defines the map&#8217;s height:</p>\n<pre><code>[codepeople-post-map height=\"300\"]\n</code></pre>\n<p>align:  Values allowed, left, right, center. Aligns the map&#8217;s container to the left, right or center:</p>\n<pre><code>[codepeople-post-map align=\"center\"]\n</code></pre>\n<p>dynamic_zoom:  Values allowed, 1 or 0. Adjust the zoom of map dynamically to display all points on map at the same time:</p>\n<pre><code>[codepeople-post-map dynamic_zoom=\"1\"]\n</code></pre>\n<p>zoom:  Accepts a number to define the map&#8217;s zoom. To apply a zoom to the map, the dynamic zoom should be 0:</p>\n<pre><code>[codepeople-post-map dynamic_zoom=\"0\" zoom=\"5\"]\n</code></pre>\n<p>type:  Values allowed, SATELLITE, ROADMAP, TERRAIN and HYBRID. Select the type of map to display:</p>\n<pre><code>[codepeople-post-map type=\"ROADMAP\"]\n</code></pre>\n<p>language:  Values allowed, en for English, es for Spanish, pt for Portuguese, etc. (for the complete list, check the Google Maps documentation). Select a language to display on map:</p>\n<pre><code>[codepeople-post-map language=\"en\"]\n</code></pre>\n<p>route:  Values allowed, 0 or 1. Draw or not the route between points in a same post or page:</p>\n<pre><code>[codepeople-post-map route=\"1\"]\n</code></pre>\n<p>mode:  Values allowed, DRIVING, BICYCLING and WALKING. Define the type of route:</p>\n<pre><code>[codepeople-post-map route=\"1\" mode=\"DRIVING\"]\n</code></pre>\n<p>show_window:  Values allowed, 0 or 1. To enable or disable the infowindows:</p>\n<pre><code>[codepeople-post-map show_window=\"1\" ]\n</code></pre>\n<p>show_default:  Values allowed, 0 or 1. Display or not an infowindow expanded by default:</p>\n<pre><code>[codepeople-post-map show_window=\"1\" show_default=\"1\"]\n</code></pre>\n<p>markerclusterer:  Values allowed, 0 or 1. Displays a cluster with the number of points in an area:</p>\n<pre><code>[codepeople-post-map markerclusterer=\"1\"]\n</code></pre>\n<p>mousewheel:  Values allowed, 0 or 1. Enables the map&#8217;s zoom with the mouse wheel:</p>\n<pre><code>[codepeople-post-map mousewheel=\"1\"]\n</code></pre>\n<p>zoompancontrol:  Values allowed, 0 or 1. Displays or hide the zoom controls in the Google Maps:</p>\n<pre><code>[codepeople-post-map zoompancontrol=\"1\"]\n</code></pre>\n<p>typecontrol:  Values allowed, 0 or 1. Displays or hide the type control in the Google Map:</p>\n<pre><code>[codepeople-post-map typecontrol=\"1\"]\n</code></pre>\n<p>streetviewcontrol:  Values allowed, 0 or 1. Displays or hide the street-view control in the Google Map:</p>\n<pre><code>[codepeople-post-map streetviewcontrol=\"1\"]\n</code></pre>\n<p>defaultpost: Defines the post ID, for centring the map, and display by default the infowindow corresponding to the first point associated to this post:</p>\n<pre><code>[codepeople-post-map defaultpost=\"396\"]\n</code></pre>\n<p>center: To define the center of the map, but if the infowindows are configured to be opened by default, the map will be centered in the point with the infowindow opened:</p>\n<pre><code>[codepeople-post-map center=\"40.7127837,-74.00594130000002\"]\n</code></pre>\n<p>legend:  Accepts a taxonomy name as value. Some common taxonomies names are:  category and post_tag, for the categories and tags, respectively. Displays the legend with the list of elements that belong to the taxonomy and are assigned to the posts associated with the points:</p>\n<pre><code>[codepeople-post-map legend=\"category\"]\n</code></pre>\n<p>legend_title:  Text to be used as legend title:</p>\n<pre><code>[codepeople-post-map legend=\"category\" legend_title=\"Select the categories to display on map\"]\n</code></pre>\n<p>legend_class:  Class name to be assigned to the legend. The legend design may be modified through CSS styles. Creates a class name, with the styles definition, and associates the new class name to the legend through the legend_class attribute:</p>\n<pre><code>[codepeople-post-map legend=\"category\" legend_class=\"my-legend-class\"]\n</code></pre>\n<p>tag:  Tags slugs separated by &#8220;,&#8221;. Displays on map the points whose posts have assigned the tags:</p>\n<pre><code>[codepeople-post-map tag=\"tag1,tag2,tag3\"]\n</code></pre>\n<p>cat:  Categories IDs separated by &#8220;,&#8221; or -1. Displays on map the points whose posts belong to the categories. The special value -1, allows display on map all points defined in the website:</p>\n<pre><code>[codepeople-post-map cat=\"2,4,56\"]\n\n[codepeople-post-map cat=\"-1\"]\n</code></pre>\n<p>excludecat:  Categories IDs to exclude, separated by &#8220;,&#8221;. From points to be displayed on map, the plugin excludes the points whose posts belong to the categories to exclude:</p>\n<pre><code>[codepeople-post-map tag=\"tag1,tag2\" excludecat=\"4\"]\n</code></pre>\n<p>excludepost:  Posts IDs to exclude separated by &#8220;,&#8221;:</p>\n<pre><code>[codepeople-post-map cat=\"-1\" excludepost=\"235,260\"]\n</code></pre>\n<p>excludetag:  Tags IDs to exclude separated by &#8220;,&#8221;:</p>\n<pre><code>[codepeople-post-map excludetag=\"2,13\"]\n</code></pre>\n<p>taxonomy:  The taxonomy is a special attribute that should be combined with other attributes, depending of taxonomies to use for points filtering. Suppose the website includes two new taxonomies:  taxonomyA and taxonomyB, and the map should display all points that belong to the posts with the value T1 for taxonomyA, and T3,T4 for taxonomyB, the shortcode would be:</p>\n<pre><code>[codepeople-post-map taxonomy=\"taxonomyA,taxonomyB\" taxonomyA=\"T1\" taxonomyB=\"t2,t3\"]\n</code></pre>\n<p>Note 5: The geolocation information is stored in image&#8217;s metadata from mobiles or cameras with GPS devices.</p>\n<p>Note 6: Some plugins interfere with the shortcodes replacements, and provokes that maps don&#8217;t be loaded correctly, in this case should be passed a new parameter through the shortcode print=1</p>\n<p>Passing the parameter print=1, displays the map at beginning of page/post content.</p>\n<p>Note 7: To display  in the Google Map all points in posts with a specific taxonomy assigned, or multiple taxonomies, should be used the &#8220;taxonomy&#8221; attribute in the shortcode, with the list of all taxonomies separated by the comma symbol, for example: taxonomy=&#8221;taxonomy1,taxonomy2&#8243;, and a new attribute for each taxonomy with the values corresponding. For example if you want select the points that belong to the posts with the values: &#8220;value1&#8221; for &#8220;taxonomy1&#8221;, the shortcode would be:</p>\n<pre><code>[codepeople-post-map taxonomy=\"taxonomy1\" taxonomy1=\"value1\"]\n</code></pre>\n<p>for multiple taxonomies:</p>\n<pre><code>[codepeople-post-map taxonomy=\"taxonomy1,taxonomy2\" taxonomy1=\"value1\" taxonomy2=\"value2,value3\"].\n</code></pre>\n<p>post_type: In combination with other attributes like: cat, tag or taxonomy, it is possible to load on map only the points that belong to the post types in the list:</p>\n<pre><code>[codepeople-post-map cat=\"-1\" post_type=\"post,page\"]\n</code></pre>\n<p>excludepost_type: In combination with other attributes like: cat, tag or taxonomy, it is possible to load on map only the points that do not belong to the post types in the list:</p>\n<pre><code>[codepeople-post-map cat=\"-1\" excludepost_type=\"post\"]\n</code></pre>\n<p>kml: Absolute URL (http://&#8230;) to a KML file with the Keyhole Markup Language:</p>\n<pre><code>[codepeople-post-map kml=\"http://www.yourwebsite.com/your-file.kml\"]\n</code></pre>\n<p>If you want more information about this plugin or another one don&#8217;t doubt to visit my website:</p>\n<p><a href=\"http://wordpress.dwbooster.com/content-tools/codepeople-post-map\" title=\"Google Maps CP\" rel=\"nofollow ugc\">http://wordpress.dwbooster.com/content-tools/codepeople-post-map</a></p>\n<h3>Interface</h3>\n<p><strong>Google Maps</strong> offers several setting options and is highly flexible. Options can be set up in the Settings page (and will become the <strong>default setup</strong> for all maps added to posts in the future), or may be <strong>specific to each post</strong> to be associated with the Google maps (in this case the values are entered in the editing screen of the post in question.)</p>\n<p>The settings are divided into two main groups, those belonging to the Google maps and those belonging to the geolocation point.</p>\n<p><strong>Google Maps configuration options:</strong></p>\n<ul>\n<li>Map zoom: Initial map zoom.</li>\n<li>Dynamic zoom: Allows to adjust the map&#8217;s zoom dynamically to display all points at the same time.</li>\n<li>Map width: Width of the map.</li>\n<li>Map height: Height of the map.</li>\n<li>Map margin: Margin of the map.</li>\n<li>Map align: Aligns the map at left, center or right of area.</li>\n<li>Map type: Select one of the possible types of maps to load (roadmap, satellite, terrain, hybrid).</li>\n<li>Map language: a large number of languages is available to be used on maps, select the one that matches your blog&#8217;s language.</li>\n<li>Allow drag the map: allows drag the map to see other places.</li>\n<li>Map route: Draws the route through the points that belong to the same post (available only in the premium and developer versions of plugin)</li>\n<li>Travel Mode: Travel mode used in route drawing (available only in the premium and developer versions of plugin)</li>\n<li>Include Traffic Layer: Displays a traffic layer over the map.</li>\n<li>Show info bubbles: display or hide the bubbles with the information associated to the points.</li>\n<li>Display a bubble by default: display  a bubble opened by default.</li>\n<li>Display map in post / page: When the Google maps are inserted in a post you can select whether to display the Google maps or display an icon, which displays the map, when pressed (if the Google maps are inserted into a template that allows multiple posts, this option does not apply)</li>\n<li>Options: This setting allows you to select which map controls should be available.</li>\n<li>Display a  &hellip;</li>\n</ul>\n",
        "installation": "<p><strong>To install Google Maps CP, follow these steps:</strong></p>\n<ol>\n<li>Download and unzip the plugin</li>\n<li>Upload the entire codepeople-post-map/ directory to the /wp-content/plugins/ directory</li>\n<li>Activate the plugin through the Plugins menu in WordPress</li>\n</ol>\n",
        "faq": "\n<dt id='q%3A%20why%20the%20google%20map%20shortcode%20is%20not%20inserted%20on%20page%20content%3F'>\nQ: Why the Google Map shortcode is not inserted on page content?\n</h4>\n<p>\n<p>A: There are some content editors, available as WordPress plugins, that provoke some compatibility issues with WordPress, in this case you should type the shortcode manually:</p>\n<pre><code>[codepeople-post-map]\n</code></pre>\n</p>\n<dt id='q%3A%20how%20many%20google%20maps%20i%20can%20insert%20into%20a%20post%3F'>\nQ: How many Google Maps I can insert into a post?\n</h4>\n<p>\n<p>A: In the free version of plugin only one map with only one point associated in each post/page. In the premium version of plugin it is possible associate multiple points to the post and insert multiple shortcodes ( if there are multiple maps included in the same post/page, all of them will display the same points)</p>\n</p>\n<dt id='q%3A%20how%20to%20insert%20google%20maps%20into%20a%20template%3F'>\nQ: How to insert Google Maps into a template?\n</h4>\n<p>\n<p>A: Load the template in which you want to place the map in the text editor of your choice and place the following code in the position where you want to display the Google maps:</p>\n<pre><code>&lt;?php echo do_shortcode ('[codepeople-post-map]'); ?&gt;\n</code></pre>\n</p>\n<dt id='q%3A%20is%20possible%20to%20load%20all%20points%20that%20belong%20to%20the%20posts%20with%20a%20tag%20assigned%20in%20a%20same%20google%20map%3F'>\nQ: Is possible to load all points that belong to the posts with a tag assigned in a same Google Map?\n</h4>\n<p>\n<p>A:  To display all points that belong to the posts with a specific tag assigned, for example the tag name &#8220;mytag&#8221;, use the shortcode&#8217;s attribute &#8220;tag&#8221;, as follows:</p>\n<pre><code>[codepeople-post-map tag=\"mytag\"]\n</code></pre>\n<p>To insert the code directly in a template, the snippet of code would be:</p>\n<pre><code>&lt;?php echo do_shortcode('[codepeople-post-map tag=\"mytag\"]'); ?&gt;\n</code></pre>\n</p>\n<dt id='q%3A%20how%20to%20know%20the%20id%20of%20a%20category%3F'>\nQ: How to know the ID of a category?\n</h4>\n<p>\n<p>A: The explanation to determine the ID of a category is applied to other taxonomies.</p>\n<p>Access to the categories through the menu option: &#8220;Posts/Categories&#8221;. After accessing to the categories page, click the &#8220;Edit&#8221; link corresponding to the category, and pays special attention to the parameter &#8220;tag_ID&#8221;, in the URL on browser. The value in this parameter correspond to the ID of the category.</p>\n</p>\n<dt id='q%3A%20is%20possible%20to%20load%20all%20points%20in%20a%20category%20in%20a%20same%20google%20map%3F'>\nQ: Is possible to load all points in a category in a same Google Map?\n</h4>\n<p>\n<p>A: To display all points that belong to a specific category, it is required to insert the following shortcode</p>\n<pre><code>[codepeople-post-map cat=\"3\"]\n</code></pre>\n<p>The number 3 represent the category ID, replace this number by the corresponding category&#8217;s ID. To insert the code directly in a template, the snippet of code would be:</p>\n<pre><code>&lt;?php echo do_shortcode ('[codepeople-post-map cat=\"3\"]'); ?&gt;\n</code></pre>\n</p>\n<dt id='q%3A%20how%20to%20exclude%20the%20points%20in%20a%20category%3F'>\nQ: How to exclude the points in a category?\n</h4>\n<p>\n<p>A: To exclude the points that belong to a specific category, or various categories, inserts the attribute excludecat in the shortcode:</p>\n<pre><code>[codepeople-post-map excludecat=\"3,4\"]\n</code></pre>\n<p>The number 3 and 4 represent the categories IDs.</p>\n</p>\n<dt id='q%3A%20how%20to%20exclude%20the%20points%20in%20a%20post%3F'>\nQ: How to exclude the points in a post?\n</h4>\n<p>\n<p>A: To exclude the points that belong to a post, or various posts, inserts the attribute excludepos in the shortcode:</p>\n<pre><code>[codepeople-post-map excludepost=\"3,4\"]\n</code></pre>\n<p>The number 3 and 4 represent the posts IDs.</p>\n</p>\n<dt id='q%3A%20how%20to%20exclude%20the%20points%20in%20posts%20with%20tag%3F'>\nQ: How to exclude the points in posts with tag?\n</h4>\n<p>\n<p>A: To exclude the points that belong to the post with a specific tag, or various tags, inserts the attribute excludetag in the shortcode:</p>\n<pre><code>[codepeople-post-map excludetag=\"3,4\"]\n</code></pre>\n<p>The number 3 and 4 represent the tags IDs.</p>\n</p>\n<dt id='q%3A%20is%20possible%20to%20load%20all%20points%20in%20more%20than%20one%20category%20in%20a%20same%20google%20map%3F'>\nQ: Is possible to load all points in more than one category in a same Google Map?\n</h4>\n<p>\n<p>A: To display all points that belong to multiple categories, it is required separate the categories IDs with comma &#8220;,&#8221;</p>\n<pre><code>[codepeople-post-map cat=\"3,5\"]\n</code></pre>\n<p>The numbers 3 and 5 are the categories IDs, replace these numbers with the corresponding categories IDs. To insert the code directly in a template, the snippet of code would be:</p>\n<pre><code>&lt;?php echo do_shortcode ('[codepeople-post-map cat=\"3,5\"]'); ?&gt;\n</code></pre>\n</p>\n<dt id='q%3A%20is%20possible%20to%20load%20all%20points%20in%20the%20website%20in%20a%20same%20google%20map%3F'>\nQ: Is possible to load all points in the website in a same Google Map?\n</h4>\n<p>\n<p>A: To display all points in the website use -1 as the category ID:</p>\n<pre><code>[codepeople-post-map cat=\"-1\"]\n</code></pre>\n<p>or</p>\n<pre><code>&lt;?php echo do_shortcode ('[codepeople-post-map cat=\"-1\"]'); ?&gt;\n</code></pre>\n<p>for template.</p>\n</p>\n<dt id='q%3A%20if%20i%20link%20geolocation%20information%20to%20a%20post%20but%20do%20not%20insert%20a%20google%20map%20in%20it%2C%20will%20the%20geolocation%20information%20be%20available%3F'>\nQ: If I link geolocation information to a post but do not insert a Google map in it, will the geolocation information be available?\n</h4>\n<p>\n<p>A: If you have inserted a Google map into a template where multiple posts are displayed, then the geolocation information associated with posts is displayed on the map.</p>\n</p>\n<dt id='q%3A%20how%20can%20i%20disable%20the%20information%20window%20of%20point%20opened%20by%20default%3F'>\nQ: How can I disable the information window of point opened by default?\n</h4>\n<p>\n<p>A: Go to the settings of map (the settings page of plugin for settings of all maps, or the settings of a particular map), and uncheck the option &#8220;Display a bubble by default&#8221;</p>\n</p>\n<dt id='q%3A%20how%20can%20i%20disable%20all%20information%20windows%20of%20points%3F'>\nQ: How can I disable all information windows of points?\n</h4>\n<p>\n<p>A: Go to the settings of map (the settings page of plugin for settings of all maps, or the settings of a particular map), and uncheck the option &#8220;Show info bubbles&#8221;</p>\n</p>\n<dt id='q%3A%20how%20can%20i%20stylize%20the%20google%20maps%3F'>\nQ: How can I stylize the Google Maps?\n</h4>\n<p>\n<p>A: In the premium version of plugin is possible define a JSON object to stylize the maps: the maps&#8217; colors, labels, etc.</p>\n<p>To generate the styles used on maps, I personally recommend to visit the following link that publishes a visual generator of styles, and get the JSON object, to be use in our plugin:</p>\n<p><a href=\"http://gmaps-samples-v3.googlecode.com/svn/trunk/styledmaps/wizard/index.html\" title=\"How to use the Styled Maps Wizard\" rel=\"nofollow ugc\">http://gmaps-samples-v3.googlecode.com/svn/trunk/styledmaps/wizard/index.html</a></p>\n</p>\n<dt id='q%3A%20how%20can%20i%20use%20different%20icons%2C%20in%20the%20points%20markers%3F'>\nQ: How can I use different icons, in the points markers?\n</h4>\n<p>\n<p>A: To use your own icons, you only should to upload the icons images to the following location: &#8220;/wp-content/plugins/codepeople-post-map/images/icons/&#8221;, and then select the image from the list in the point&#8217;s definition.</p>\n</p>\n<dt id='q%3A%20how%20can%20i%20use%20particular%20settings%20in%20a%20map%3F'>\nQ: How can I use particular settings in a map?\n</h4>\n<p>\n<p>A: You may use a particular settings in a map, defining the options directly as attributes of shortcode:</p>\n<pre><code>[codepeople-post-map width=\"100%\"]\n</code></pre>\n<p>If you are inserting the map in a particular page/post, you may check the field named &#8220;Use particular settings for this map&#8221;, and then entering the particular values in the settings options.</p>\n</p>\n<dt id='q%3A%20is%20possible%20to%20display%20the%20map%20as%20responsive%20design%3F'>\nQ: Is possible to display the map as responsive design?\n</h4>\n<p>\n<p>A: Yes, that is possible, you only should to define the width of map with values in percent. For example: 100%<br />\nPay attention the height definition with percent is not recommended, because it is only possible if the map&#8217;s container has a fixed height.</p>\n</p>\n<dt id='q%3A%20how%20to%20get%20the%20directions%20to%20the%20point%3F'>\nQ: How to get the directions to the point?\n</h4>\n<p>\n<p>A: Go to the settings page of plugin and check the box to display the &#8220;Get directions&#8221; link in the infowindow. The &#8220;Get directions&#8221; link will be displayed in the infowindow.</p>\n</p>\n<dt id='q%3A%20is%20possible%20to%20include%20multiple%20taxonomies%20in%20the%20maps%27%20legends%3F'>\nQ: Is possible to include multiple taxonomies in the maps&#8217; legends?\n</h4>\n<p>\n<p>A: In the shortcode can be defined the attribute &#8220;legend&#8221; for selecting the taxonomy to  use in the legend of map:</p>\n<pre><code>[codepeople-post-map legend=\"category\"]\n</code></pre>\n<p>but from the version 5.0.6 of the plugin it is possible to define in the legend multiple taxonomies separated by comma, to include all of them in the map&#8217;s legend:</p>\n<pre><code>[codepeople-post-map legend=\"category,post_tag\"]\n</code></pre>\n</p>\n<dt id='q%3A%20how%20to%20open%20the%20point%20on%20google%20maps%3F'>\nQ: How to open the point on Google Maps?\n</h4>\n<p>\n<p>A: If you want to display a link to open the point directly on Google Maps, go to the settings page of plugin, and checks the box to display the link in the infowindow.</p>\n</p>\n<dt id='q%3A%20could%20i%20insert%20the%20map%20as%20widget%3F'>\nQ: Could I insert the map as widget?\n</h4>\n<p>\n<p>A: Yes, you can. Go to the menu option: &#8220;Appearance / Widgets&#8221; and insert the &#8220;CP Google Maps&#8221; widget on side bar.</p>\n</p>\n<dt id='q%3A%20my%20images%20include%20geolocation%20information.%20is%20possible%20use%20the%20geolocaion%20information%20stored%20in%20the%20image%20to%20generate%20points%20on%20map%3F'>\nQ: My images include geolocation information. Is possible use the geolocaion information stored in the image to generate points on map?\n</h4>\n<p>\n<p>A: Go to the settings page of plugin and select the corresponding option to allow processing the information stored on image&#8217;s metadata, and then if an image uploaded to WordPress, includes geolocation information, will be generated a point with this information dynamically, that will be displayed on map.</p>\n</p>\n<dt id='q%3A%20why%20the%20maps%20are%20not%20showing%20on%20website%3F'>\nQ: Why the maps are not showing on website?\n</h4>\n<p>\n<p>A: Some plugins interfere with the shortcodes replacements, and provokes that maps don&#8217;t be loaded correctly, in this case should be passed a new parameter through the shortcode print=1<br />\nPassing the parameter print=1, displays the map at beginning of page/post content.</p>\n</p>\n<dt id='q%3A%20it%20is%20possible%20to%20draw%20routes%20for%20flights%20between%20countries%3F'>\nQ: It is possible to draw routes for flights between countries?\n</h4>\n<p>\n<p>A: By default Google draws routes between points connected by cars, bus, trains, etc, but not for flights. So, in this case should be used polylines. To connect points with polylines, tick the attribute: &#8220;Connect the points with polylines, even if there is not a route between points&#8221;, in the settings page of maps.</p>\n</p>\n<dt id='q%3A%20how%20can%20i%20change%20the%20route%20between%20address%3F'>\nQ: How can I change the route between address?\n</h4>\n<p>\n<p>A: The route depends on the order of the points. If you want change the route, you should change the order of point. Takes the point by the handle&#8217;s icon, and drag it to its correct position in the points list.</p>\n</p>\n<dt id='q%3A%20what%20are%20the%20differences%20between%20routes%20and%20polylines%3F'>\nQ: What are the differences between routes and polylines?\n</h4>\n<p>\n<p>A: The routes are drawn on maps, only if there are known routes between the locations, based in the travelling mode (driving, walking), but if Google unknown a way between both address, is not able to draw the route. The polylines are straight lines connecting two addresses, even if there is not  a route. It is main difference between both concepts, and  why the polylines are preferred for representing flights.</p>\n</p>\n<dt id='q%3A%20is%20possible%20create%20routes%20between%20points%20in%20different%20posts%3F'>\nQ: Is possible create routes between points in different posts?\n</h4>\n<p>\n<p>A: Yes, it&#8217;s possible to draw a route including points belonging to different posts/pages, but in the current version of the plugin would be needed duplicate some points. Visit the following link to our technical blog with detailed instructions:</p>\n<p><a href=\"http://blog.net-factor.com/how-connecting-multiple-posts-on-a-route/\" title=\"How connecting multiple posts on a route?\" rel=\"nofollow ugc\">http://blog.net-factor.com/how-connecting-multiple-posts-on-a-route/</a></p>\n</p>\n<dt id='q%3A%20how%20can%20i%20centring%20the%20map%20in%20a%20point%20defined%20a%20specific%20post%2C%20and%20display%20its%20infowindow%3F'>\nQ: How can I centring the map in a point defined a specific post, and display its infowindow?\n</h4>\n<p>\n<p>A: Use the &#8220;defaultpost&#8221; attribute, in the map&#8217;s shortcode, as follows:</p>\n<pre><code>[codepeople-post-map defaultpost=\"231\"]\n</code></pre>\n<p>The number is the post&#8217;s ID</p>\n</p>\n<dt id='q%3A%20i%27ve%20configured%20the%20sizes%20of%20the%20map%20to%20be%20displayed%20with%20a%20responsive%20design%2C%20but%20the%20map%20is%20not%20showing'>\nQ: I&#8217;ve configured the sizes of the map to be displayed with a responsive design, but the map is not showing\n</h4>\n<p>\n<p>A: To display the maps with a responsive design, you should define the map&#8217;s width with percentages (for example 100% if you want that the map width be the same that its container), but PAY ATTENTION, in web development the treatment of the width and height is different. The page width is limited by the browser&#8217;s width, but with the height it is not apply. So, you should enter a fixed height(for example 320px).</p>\n<p>The only way to define the map&#8217;s height in percentages, is if the element that contain the map has defined a fixed height.</p>\n</p>\n<dt id='q%3A%20can%20be%20inserted%20a%20link%20in%20the%20infowindow%3F'>\nQ: Can be inserted a link in the infowindow?\n</h4>\n<p>\n<p>A: It is possible insert links, and any other HTML element in the infowindow. You only should insert HTML tags directly in the point description. For example, to insert a link to our web page: &lt;a href=&quot;http://wordpress.dwbooster.com&quot;&gt;Click Here&lt;/a&gt;</p>\n</p>\n<dt id='q%3A%20after%20entering%20an%20address%2C%20and%20to%20press%20the%20verify%20button%2C%20the%20address%20is%20modified%2C%20and%20the%20pin%20is%20displayed%20in%20a%20different%20location%20of%20the%20map'>\nQ: After entering an address, and to press the verify button, the address is modified, and the pin is displayed in a different location of the map\n</h4>\n<p>\n<p>A: If after pressing the &#8220;verify&#8221; button, the address is modified dynamically, and the pin is displayed in another location, the cause is simple. If Google Maps does not recognize an address, it uses the nearest known address, and displays the pin on this location.</p>\n<p>To solve the issue, you simply should drag and drop the pin in the correct location, and type the address again, but this time &#8220;DON&#8217;T PRESS AGAIN THE VERIFY BUTTON&#8221;.</p>\n</p>\n<dt id='q%3A%20i%27ve%20inserted%20an%20image%20in%20the%20page%2C%20but%20have%20not%20been%20generated%20a%20new%20point%20in%20the%20map'>\nQ: I&#8217;ve inserted an image in the page, but have not been generated a new point in the map\n</h4>\n<p>\n<p>A: First, be sure you have checked the option &#8220;Generate points dynamically from geolocation information included on images, when images are uploaded to WordPress&#8221;, from the settings page of the plugin.</p>\n<p>Second, be sure the image includes the Exif tags with the geolocation information (latitude and longitude)</p>\n<p>Finally, you should upload the image from the &#8220;Add Media&#8221; button of the page or post, and not from the media library.</p>\n</p>\n<dt id='q%3A%20can%20be%20generated%20a%20point%20from%20the%20page%20publication%2C%20with%20the%20location%20of%20the%20author%3F'>\nQ: Can be generated a point from the page publication, with the location of the author?\n</h4>\n<p>\n<p>A: Yes, that is possible but only from the WordPress App, available for iPhone, iPad and Android, with the option for sharing the location enabled in the application. Furthermore, from the settings page of the plugin, should be checked the option: &#8220;Generate points dynamically from geolocation information included on posts&#8221;</p>\n</p>\n<dt id='q%3A%20how%20to%20display%20a%20map%20in%20the%20search%20results%20page%2C%20with%20the%20points%20defined%20in%20the%20resulting%20posts%20and%20pages%3F'>\nQ: How to display a map in the search results page, with the points defined in the resulting posts and pages?\n</h4>\n<p>\n<p>A: To insert a map in the results page with the points defined in the resulting posts and pages, you simply should identify the template file, in the active theme on your WordPress, that is used in the search page (usually it is called search.php), and inserts the map&#8217;s shortcode directly in the file&#8217;s content:</p>\n<pre><code>&lt;?php echo do_shortcode( '[codepeople-post-map]' ); ?&gt;\n</code></pre>\n</p>\n<dt id='q%3A%20can%20be%20searched%20in%20the%20website%20by%20the%20points%20information%3F'>\nQ: Can be searched in the website by the points information?\n</h4>\n<p>\n<p>A: If was checked the option &#8220;Use points information in search results&#8221;, from the settings page of the plugin. The searching process will consider the points information too, and the posts and pages resulting could be selected by its points.</p>\n<p>Pay attention, the results of search will be the posts and pages that include the points, not the point directly.</p>\n</p>\n<dt id='q%3A%20what%20styles%20are%20used%20in%20the%20infowindows%3F'>\nQ: What styles are used in the infowindows?\n</h4>\n<p>\n<p>A: The design of infowindows is defined through styles in the cpm-styles.css file, located in &#8220;/wp-content/plugins/codepeople-post-map/styles/cpm-styles.css&#8221;, specifically with the styles:</p>\n<pre><code>    .cpm-infowindow {margin:0; padding:0px; min-height:80px; font-size:11px; clear:both;}\n    .cpm-infowindow .cpm-content {float:left;width:100%; color:black;}\n    .cpm-infowindow .cpm-content .title {font-size:12px; line-height: 18px; font-weight:bold; color:black;}\n    .cpm-infowindow .cpm-content .address {font-weight:bold; font-size:9px;}\n    .cpm-infowindow .cpm-content .description {font-size:10px;}\n</code></pre>\n</p>\n<dt id='q%3A%20can%20be%20hidden%20the%20local%20listings%20from%20google%20maps%20api%3F'>\nQ: Can be hidden the local listings from Google Maps API?\n</h4>\n<p>\n<p>A: Yes of course, if you want hide the local listings from Google Maps API, open the settings page of plugin, select the &#8220;Allow stylize the maps&#8221; attribute, and finally, paste the following code in the textarea:</p>\n<pre><code>[\n    {\n        featureType: \"poi\",\n        stylers: [\n          { visibility: \"off\" }\n        ]\n    }\n]\n</code></pre>\n</p>\n<dt id='q%3A%20can%20be%20highlighted%20the%20post%20or%20page%20related%20with%20the%20point%20on%20map%3F'>\nQ: Can be highlighted the post or page related with the point on map?\n</h4>\n<p>\n<p>A: From the settings page of the plugin, there are two options:</p>\n<ul>\n<li>Highlight post when mouse move over related point on map</li>\n<li>Highlight class</li>\n</ul>\n<p>If you check the option: &#8220;Highlight post when mouse move over related point on map&#8221;, and enter a class name in the &#8220;Highlight class&#8221; attribute, in the maps inserted on pages with multiple entries, the class name will be applied to the post, or page, when the mouse is moved over a point associated in the corresponding page or post.</p>\n</p>\n<dt id='q%3A%20how%20can%20be%20created%20shapes%20on%20map%3F'>\nQ: How can be created shapes on map?\n</h4>\n<p>\n<p>A: In the map&#8217;s definition, directly in the page or post where the map is being inserted, there is the checkbox: &#8220;Do you want display a shape on map?&#8221;, please, tick the checkbox to expand the shape&#8217;s section.</p>\n<p>The shape&#8217;s section includes some options like: the stroke weight (if you don&#8217;t want to display an stroke around the shape, set its value to zero), the fill colour (the colour code with the format: #FFFFFF, to select the shape colour), and the opacity to be applied to the shape, take into consideration than zero is transparent and 1 is opaque. Remember, the shape is displayed over the map, if you set the opacity to 1, won&#8217;t be possible to see the map&#8217;s area.</p>\n<p>Now the most important part create the shape&#8217;s area. To create the shape&#8217;s area is sufficient with click in the map at right (Don&#8217;t worry, the pins are not included in the final map, are inserted in the preview map to allow modify the shape&#8217;s area). Through the pins at right map it is possible modify the shape&#8217;s area, click on the pin to delete it, or drag the pin to another location to vary the shape.</p>\n</p>\n\n",
        "changelog": "<h4>1.1.7</h4>\n<ul>\n<li>Load Google Maps APIs asynchronously so as not to affect website performance.</li>\n</ul>\n<h4>1.1.6</h4>\n<ul>\n<li>Fixes a conflict in the activation process with WP6.5.</li>\n</ul>\n<h4>1.1.5</h4>\n<ul>\n<li>Implements the integration with new Borlabs Cookie version.</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Improves the integration with third-party plugins.</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Removes deprecated JS code.</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Hides the map gray background color on zoom out.</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Fixes an issue in default variables.</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Improves the plugin interface.</li>\n<li>Implements the WCML integration to display points from active language.</li>\n</ul>\n<h4>1.0.44</h4>\n<ul>\n<li>Improves the plugin security.</li>\n</ul>\n<h4>1.0.43</h4>\n<ul>\n<li>Modifies the Google Maps loading process to avoid conflicts with third-party themes.</li>\n</ul>\n<h4>1.0.42</h4>\n<ul>\n<li>Modifies the plugin configuration making it easier to use.</li>\n</ul>\n<h4>1.0.41</h4>\n<ul>\n<li>Fixes a conflict with third-party plugins.</li>\n</ul>\n<h4>1.0.40</h4>\n<ul>\n<li>Implements the integration with Borlabs Cookie to block Google Maps until the cookies are accepted.</li>\n</ul>\n<h4>1.0.39</h4>\n<ul>\n<li>Includes three new filters, cmp-point, cpm-point-infowindow-template, and cpm-point-infowindow, to edit the attributes of the point, modify the infowindows template, and edit the generated infowindows, respectively.</li>\n</ul>\n<h4>1.0.38</h4>\n<ul>\n<li>Allows the use of shortcodes into the points&#8217; descriptions.</li>\n</ul>\n<h4>1.0.37</h4>\n<ul>\n<li>Modifies the interaction with the Google APIs to prevent the limits on Google requests, affect our plugin.</li>\n</ul>\n<h4>1.0.36</h4>\n<ul>\n<li>Modifies the plugin&#8217;s settings.</li>\n</ul>\n<h4>1.0.35</h4>\n<ul>\n<li>Includes a video tutorial in the plugin&#8217;s interface to improve the users&#8217; experience.</li>\n</ul>\n<h4>1.0.34</h4>\n<ul>\n<li>Includes new validation rules to prevent possible errors and warnings&#8217; messages, and removes unnecessary blocks of code.</li>\n</ul>\n<h4>1.0.33</h4>\n<ul>\n<li>Fixes some notice messages.</li>\n</ul>\n<h4>1.0.32</h4>\n<ul>\n<li>Modifies the Mouse Wheel behavior, to make it less intrusive.</li>\n</ul>\n<h4>1.0.31</h4>\n<ul>\n<li>Fixes an encoding issue in some ampersand symbols on generated URLs.</li>\n</ul>\n<h4>1.0.30</h4>\n<ul>\n<li>Assigns a class name to the points&#8217; thumbnails, to allow exclude them from the lazy loading of third party plugin that break the javascript blocks of code.</li>\n</ul>\n<h4>1.0.29</h4>\n<ul>\n<li>Improves the detection of misconfigured Google Maps Projects.</li>\n</ul>\n<h4>1.0.28</h4>\n<ul>\n<li>Includes some modifications in the infowindows styles.</li>\n<li>Fixes an issue to determine the featured images associated to the posts.</li>\n<li>Allows generating points from images when teh posts are published by email (Advanced and Developer versions of the plugin)</li>\n</ul>\n<h4>1.0.27</h4>\n<ul>\n<li>Fixes an issue with the &#8220;cpm-complete-structured-query&#8221; filter.</li>\n</ul>\n<h4>1.0.26</h4>\n<ul>\n<li>Includes new filters to allow the integration with third party plugins, or information stored in custom fields:</li>\n</ul>\n<p>cpm-complete-structured-query<br />\ncpm-post-latitude<br />\ncpm-post-longitude<br />\ncpm-post-address<br />\ncpm-point-image<br />\ncpm-point-description<br />\ncpm-point-address</p>\n<h4>1.0.25</h4>\n<ul>\n<li>Modifies the access to the demos.</li>\n</ul>\n<h4>1.0.24</h4>\n<ul>\n<li>Fixes an issue processing the maps settings.</li>\n</ul>\n<h4>1.0.23</h4>\n<ul>\n<li>Improves the plugin performance and the maps generation.</li>\n</ul>\n<h4>1.0.22</h4>\n<ul>\n<li>Modifies the blocks for the Gutenberg editor,  preparing the plugin for WordPress 5.1</li>\n</ul>\n<h4>1.0.21</h4>\n<ul>\n<li>Modifies the integration with the Gutenberg editor, loading the maps directly in the editor.</li>\n</ul>\n<h4>1.0.20</h4>\n<ul>\n<li>Implements the integration with the latest version of the Gutenberg editor.</li>\n</ul>\n<h4>1.0.19</h4>\n<ul>\n<li>Solves a conflict with the &#8220;Speed Booster Pack&#8221; plugin.</li>\n</ul>\n<h4>1.0.18</h4>\n<ul>\n<li>Modifies the integration with the Gutenberg editor to includes the new features of Gutenberg.</li>\n</ul>\n<h4>1.0.17</h4>\n<ul>\n<li>Modifies the activation/deactivation process.</li>\n<li>Solves an issue with the maps&#8217; sizes (width and height)</li>\n</ul>\n<h4>1.0.16</h4>\n<ul>\n<li>Solves a conflict with the new styles of Google Maps.</li>\n</ul>\n<h4>1.0.15</h4>\n<ul>\n<li>Modifies the instructions in the interface of the plugin.</li>\n</ul>\n<h4>1.0.14</h4>\n<ul>\n<li>Fixes a javascript parser error when the user leave in blank the zoom attribute in the map&#8217;s  settings.</li>\n</ul>\n<h4>1.0.13</h4>\n<ul>\n<li>Fixes the issue in the plugin that clears the general settings when the updates are installed.</li>\n</ul>\n<h4>1.0.12</h4>\n<ul>\n<li>Allows to select the information to display in the tooltips associated to the pins (the point location name, the address, or none).</li>\n</ul>\n<h4>1.0.11</h4>\n<ul>\n<li>Fixes an issue processing the latitudes and longitudes.</li>\n</ul>\n<h4>1.0.10</h4>\n<ul>\n<li>Removes the invalid characters from the points&#8217; latitudes and longitudes.</li>\n</ul>\n<h4>1.0.9</h4>\n<ul>\n<li>Uses correct protocol in the markers&#8217; urls.</li>\n</ul>\n<h4>1.0.8</h4>\n<ul>\n<li>Allows the integration with the Gutenberg Editor, the text editor that will be distributed with the next versions of WordPress.</li>\n</ul>\n<h4>1.0.7</h4>\n<ul>\n<li>Replaces the maps&#8217; shortcodes into the WordPress &#8220;Text&#8221; widget.</li>\n<li>Fixes an issue in the javascript code.</li>\n</ul>\n<h4>1.0.6</h4>\n<ul>\n<li>Modifies the plugin to use the new controls of Google Maps like the fullscreen control.</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Checks if the get_post_meta does not unserialize the result, and applies the unserialize it if corresponds.</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>Fixes a Cross Site Scripting vulnerability modifying the form&#8217;s action, in the settings page of the plugin. Fortunately, this vulnerability can be exploded only by users with access to the settings page of the plugin that is restricted only to the website&#8217;s administrators. The vulnerability was Discovered with DefenseCode WebScanner Security Analyzer by Neven Biruski.</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Includes a &#8220;Troubleshoot Section&#8221; in the settings page of the plugin to load the resources used by the plugin in the body or footer of webpage to prevent conflicts with other plugins.</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Allows to display a traffic layer over the map.</li>\n<li>Fixes some errors.</li>\n<li>Modifies the menu options to improve the access to the plugin documentation.</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Allows to get the latitude and longitude of points from the point definition</li>\n<li>Corrects some conflicts with styles defined in some themes that interfere  with the Google Maps styles.</li>\n<li>Allows display the maps, in themes that use AJAX to load the posts and pages.</li>\n<li>Corrects some issues related with the update in the version of jQuery Framework, and force the inclusion of jQuery if it is not loaded by the website.</li>\n<li>Improves the plugin interface to allow modify the maps settings easily.</li>\n<li>Allows controlling the maps settings directly through attributes in the shortcode.</li>\n<li>Corrects an issue with the insertion of maps with a responsive design.</li>\n<li>Allows insert links in the points description.</li>\n<li>Include online demos.</li>\n<li>Change the icons URL to preserve the references with domain changes.</li>\n<li>Allows display and hide map when is inserted like an icon in page.</li>\n<li>Allows the selection of point images as thumbnail to optimize the page load.</li>\n<li>Changes the HTML generated to meet the W3C validation</li>\n<li>Include the use of nonce fields to protect the maps settings form.</li>\n<li>The Google Api is loaded with the same schema of webpage, and use https if it is required.</li>\n</ul>\n<h4>1.0</h4>\n<ul>\n<li>Insert a Google Map in template files page with multiple entries.</li>\n<li>Improves of meta-boxes calling.</li>\n<li>Correct some bugs in Internet Explorer 8.</li>\n<li>Integrate the Google Map with non-standard WordPress themes.</li>\n<li>Allows the use of language files in the plugin</li>\n<li>Allows set an icon by default in the points of map.</li>\n<li>Uses Google Maps to discover additional entries related to the post</li>\n<li>The location can be defined by physical address and point coordinates</li>\n<li>Allows the map markers customization</li>\n<li>Allows to embed Google Maps in multiple languages</li>\n<li>Allows several Google Maps controls and configuration options</li>\n</ul>\n<h4>0.9b</h4>\n<ul>\n<li>First stable version released</li>\n</ul>\n"
    },
    "short_description": "Google Maps CP allows to associate geolocation information to your posts and to integrate your blog with Google Maps in an easy and natural way.",
    "description": "<p>Google Map features:</p>\n<p>► Insert a Google map in the best position within your blog<br />\n► Deal with large volumes of dots or markers on the Google Maps<br />\n► Uses Google Maps to discover additional entries related to the post<br />\n► The location can be defined by physical address and point coordinates<br />\n► Map markers customization<br />\n► Allows to embed Google Maps in multiple languages<br />\n► Allows several Google Maps controls and configuration options</p>\n<p><strong>Google Maps CP</strong> allows to insert a Google Maps in a post or in any of the WordPress templates that display multiple posts.</p>\n<p>The Google Maps inserted in a single post displays a marker at the position indicated by the geolocation information pertaining to the post, but also shows markers of the last posts published in related categories. The number of markers to display on the Google Maps can be set in the plugin&#8217;s settings.</p>\n<p>The Google Maps inserted into a template displaying multiple posts will contain as many markers as posts making up the page with the associated geolocation info. When the mouse is hovered over the marker, the post to which it belongs gets highlighted.</p>\n<p><strong>Google Maps</strong> has a wide range of settings to make your maps more versatile and adaptable.</p>\n<p><strong>More about the Main Features of Google Maps CP:</strong></p>\n<ul>\n<li>The plugin is capable of dealing with <strong>large volumes of dots or markers</strong>.</li>\n<li>Another way for users to discover <strong>additional entries related</strong> to the post.</li>\n<li>The <strong>location information</strong> can be defined by physical address and point coordinates.</li>\n<li>Allows to <strong>insert the Google Maps</strong> in the best position within your blog or simply <strong>associate the geolocation information</strong> to the post but without displaying the Google maps.</li>\n<li>Markers <strong>customization</strong>.</li>\n<li>Display or hide the bubbles with markers information.</li>\n<li>Allows to display a bubble opened by default.</li>\n<li>Based on <strong>Google Maps Javascript API Version 3</strong>.</li>\n<li>Allows to embed Google maps in <strong>multiple languages</strong>.</li>\n<li>Displays <strong>markers</strong> belonging to posts of the same categories.</li>\n<li><strong>Several customization options</strong> are available: initial zoom, width, height, margins, alignment, map type, map language, the way the map is displayed in a single post (either fully deployed or icon to display the Google maps), enable or disable map controls, the number of points plotted on a Google map, as well as the class that will be assigned to the post when the mouse hovers over the marker associated with the post.</li>\n</ul>\n<p><strong>Premium Features of Google Maps CP:</strong></p>\n<ul>\n<li>Load points belonging to specific pages or posts.</li>\n<li>Load in a same map all points that belong to a specific category.</li>\n<li>Load in a same map the points associated to all posts.</li>\n<li>Display the points that belong to the posts with a specific tag.</li>\n<li>The location information and description may be used in posts search.</li>\n<li>Allows to associate multiple Google maps points to each post/page.</li>\n<li>Allows to draw routes through points in the same post.</li>\n<li>Include a search box on the map for searching additional places.</li>\n<li>Draw shapes on the Google Maps.</li>\n<li>Allows to create a legend with categories, tags, or custom taxonomies, and display or hide the points, checking or unchecking legend items.</li>\n<li>Include a link to get directions to the point from Google Maps.</li>\n<li>Include a link to open the point directly on Google Maps.</li>\n<li>Include a link to display directly the street view in the specific point.</li>\n<li>Allows to display multiple Google Maps in the same post/page (but displays the same points in all maps on page).</li>\n<li>Allows to insert the map as widget on sidebars.</li>\n<li>Allows to styling the map.</li>\n<li>Allows grouping multiple markers in a cluster.</li>\n<li>Allows to display the user location on map.</li>\n<li>Allows to refresh the user location on map in the time interval defined in the map&#8217;s settings.</li>\n<li>Generates dynamic points from the geolocation information, stored in the image&#8217;s metadata when it is uploaded to WordPress, and includes a button for processing all previous images.</li>\n<li>Generates dynamic points on map, relative to the geolocation information, assigned to the posts from WordPress App.</li>\n<li>Allows to associate the Google maps with any public post_type in WordPress.</li>\n<li>In non singular webpages, Google Maps display a map for each post.</li>\n<li>Allows to export all points defined in the website to a CSV file.</li>\n<li>Allows to import the points from a CSV or KML file.</li>\n<li>Allows to load a KML layer on the map from a KML file.</li>\n</ul>\n<p>The third, and most extended version of the plugin is the &#8220;Developer Version&#8221;. The Developer version of the Google Maps CP plugin includes all features of the Premium version, and the features listed below:</p>\n<p><strong>Developer Features of Google Maps CP</strong></p>\n<ul>\n<li>Allows design a Contact Form, and associate it with the points in the map.</li>\n<li>Send notification emails with the information collected by the form.</li>\n<li>Associate an email address to the points, to contact a different person by each point, or a global email address to be notified from all points.</li>\n<li>Supports Contact Form 7 plugin&#8217;s forms in the points&#8217; descriptions by inserting their shortcodes ( [contact-form-7 id=&#8221;1&#8243; title=&#8221;Contact Form&#8221; label=&#8221;Click Here&#8221;] )</li>\n<li>Allows to use the image associated with the point as the point&#8217;s icon on map.</li>\n</ul>\n<p><strong>Demo of the Developer Version of Google Maps CP Plugin</strong></p>\n<p><a href=\"https://demos.dwbooster.com/cp-google-maps/wp-login.php\" title=\"Click to access the administration area demo\" rel=\"nofollow ugc\">https://demos.dwbooster.com/cp-google-maps/wp-login.php</a></p>\n<p><a href=\"https://demos.dwbooster.com/cp-google-maps/\" title=\"Click to access the Public Page\" rel=\"nofollow ugc\">https://demos.dwbooster.com/cp-google-maps/</a></p>\n<p>Note 1: To display all points that belong to a specific category in the same Google Map, it is required to insert the following shortcode <code>[codepeople-post-map cat=\"3\"]</code>. The number 3 represent the category ID, replace this number by the corresponding category&#8217;s ID. To insert the code directly in a template, the snippet of code would be:</p>\n<pre><code>&lt;?php echo do_shortcode('[codepeople-post-map cat=\"3\"]'); ?&gt;\n</code></pre>\n<p>Note 2: To display all points that belong to more than one category in a same Google Map, separate the categories IDs with the comma symbol <code>[codepeople-post-map cat=\"3,5\"]</code>. The numbers 3 y 5 are the categories IDs, replace these numbers by the corresponding categories IDs. To insert the code directly in a template, the snippet of code would be:</p>\n<pre><code>&lt;?php echo do_shortcode('[codepeople-post-map cat=\"3,5\"]'); ?&gt;\n</code></pre>\n<p>Note 3: To display all points defined in the website in a same Google Map, use -1 as the category&#8217;s ID:</p>\n<pre><code>[codepeople-post-map cat=\"-1\"]\n</code></pre>\n<p>or</p>\n<pre><code>&lt;?php echo do_shortcode('[codepeople-post-map cat=\"-1\"]'); ?&gt; for template.\n</code></pre>\n<p>Note 4: To display all points that belong to the posts with a specific tag assigned in a same Google Map, for example the tag name &#8220;mytag&#8221;, use the shortcode&#8217;s attribute &#8220;tag&#8221;, as follows: <code>[codepeople-post-map tag=\"mytag\"]</code>. To insert the code directly in a template, the snippet of code would be:</p>\n<pre><code>&lt;?php echo do_shortcode('[codepeople-post-map tag=\"mytag\"]'); ?&gt;\n</code></pre>\n<p>Note 5: To display the points belonging to specific posts or pages in a same Google Map, enter their ids separated by comma through the &#8220;id&#8221; attribute in the shortcode as follows: <code>[codepeople-post-map id=\"123\"]</code>. To insert the code directly in a template, the snippet of code would be:</p>\n<pre><code>&lt;?php echo do_shortcode('[codepeople-post-map id=\"123\"]'); ?&gt;\n</code></pre>\n<p>The &#8220;id&#8221; attribute has preference over the rest of the filtering attributes.</p>\n<p>If you prefer configure your map directly from the shortcode, then you must enter an attribute for each map feature to specify. For example:</p>\n<pre><code>[codepeople-post-map width=\"500\" height=\"500\"]\n</code></pre>\n<p>The complete list of allowed attributes are:</p>\n<p>Very Important. Some of attributes are available only in the premium and developer versions of the plugin.</p>\n<p>width:  Values allowed, number or percentage. Defines the map&#8217;s width:</p>\n<pre><code>[codepeople-post-map width=\"300\"]\n</code></pre>\n<p>or</p>\n<pre><code>[codepeople-post-map width=\"100%\"]\n</code></pre>\n<p>height:  Values allowed, number or percentage (In the web&#8217;s development, the height in percentage is effective only if the parent element has a height defined). Defines the map&#8217;s height:</p>\n<pre><code>[codepeople-post-map height=\"300\"]\n</code></pre>\n<p>align:  Values allowed, left, right, center. Aligns the map&#8217;s container to the left, right or center:</p>\n<pre><code>[codepeople-post-map align=\"center\"]\n</code></pre>\n<p>dynamic_zoom:  Values allowed, 1 or 0. Adjust the zoom of map dynamically to display all points on map at the same time:</p>\n<pre><code>[codepeople-post-map dynamic_zoom=\"1\"]\n</code></pre>\n<p>zoom:  Accepts a number to define the map&#8217;s zoom. To apply a zoom to the map, the dynamic zoom should be 0:</p>\n<pre><code>[codepeople-post-map dynamic_zoom=\"0\" zoom=\"5\"]\n</code></pre>\n<p>type:  Values allowed, SATELLITE, ROADMAP, TERRAIN and HYBRID. Select the type of map to display:</p>\n<pre><code>[codepeople-post-map type=\"ROADMAP\"]\n</code></pre>\n<p>language:  Values allowed, en for English, es for Spanish, pt for Portuguese, etc. (for the complete list, check the Google Maps documentation). Select a language to display on map:</p>\n<pre><code>[codepeople-post-map language=\"en\"]\n</code></pre>\n<p>route:  Values allowed, 0 or 1. Draw or not the route between points in a same post or page:</p>\n<pre><code>[codepeople-post-map route=\"1\"]\n</code></pre>\n<p>mode:  Values allowed, DRIVING, BICYCLING and WALKING. Define the type of route:</p>\n<pre><code>[codepeople-post-map route=\"1\" mode=\"DRIVING\"]\n</code></pre>\n<p>show_window:  Values allowed, 0 or 1. To enable or disable the infowindows:</p>\n<pre><code>[codepeople-post-map show_window=\"1\" ]\n</code></pre>\n<p>show_default:  Values allowed, 0 or 1. Display or not an infowindow expanded by default:</p>\n<pre><code>[codepeople-post-map show_window=\"1\" show_default=\"1\"]\n</code></pre>\n<p>markerclusterer:  Values allowed, 0 or 1. Displays a cluster with the number of points in an area:</p>\n<pre><code>[codepeople-post-map markerclusterer=\"1\"]\n</code></pre>\n<p>mousewheel:  Values allowed, 0 or 1. Enables the map&#8217;s zoom with the mouse wheel:</p>\n<pre><code>[codepeople-post-map mousewheel=\"1\"]\n</code></pre>\n<p>zoompancontrol:  Values allowed, 0 or 1. Displays or hide the zoom controls in the Google Maps:</p>\n<pre><code>[codepeople-post-map zoompancontrol=\"1\"]\n</code></pre>\n<p>typecontrol:  Values allowed, 0 or 1. Displays or hide the type control in the Google Map:</p>\n<pre><code>[codepeople-post-map typecontrol=\"1\"]\n</code></pre>\n<p>streetviewcontrol:  Values allowed, 0 or 1. Displays or hide the street-view control in the Google Map:</p>\n<pre><code>[codepeople-post-map streetviewcontrol=\"1\"]\n</code></pre>\n<p>defaultpost: Defines the post ID, for centring the map, and display by default the infowindow corresponding to the first point associated to this post:</p>\n<pre><code>[codepeople-post-map defaultpost=\"396\"]\n</code></pre>\n<p>center: To define the center of the map, but if the infowindows are configured to be opened by default, the map will be centered in the point with the infowindow opened:</p>\n<pre><code>[codepeople-post-map center=\"40.7127837,-74.00594130000002\"]\n</code></pre>\n<p>legend:  Accepts a taxonomy name as value. Some common taxonomies names are:  category and post_tag, for the categories and tags, respectively. Displays the legend with the list of elements that belong to the taxonomy and are assigned to the posts associated with the points:</p>\n<pre><code>[codepeople-post-map legend=\"category\"]\n</code></pre>\n<p>legend_title:  Text to be used as legend title:</p>\n<pre><code>[codepeople-post-map legend=\"category\" legend_title=\"Select the categories to display on map\"]\n</code></pre>\n<p>legend_class:  Class name to be assigned to the legend. The legend design may be modified through CSS styles. Creates a class name, with the styles definition, and associates the new class name to the legend through the legend_class attribute:</p>\n<pre><code>[codepeople-post-map legend=\"category\" legend_class=\"my-legend-class\"]\n</code></pre>\n<p>tag:  Tags slugs separated by &#8220;,&#8221;. Displays on map the points whose posts have assigned the tags:</p>\n<pre><code>[codepeople-post-map tag=\"tag1,tag2,tag3\"]\n</code></pre>\n<p>cat:  Categories IDs separated by &#8220;,&#8221; or -1. Displays on map the points whose posts belong to the categories. The special value -1, allows display on map all points defined in the website:</p>\n<pre><code>[codepeople-post-map cat=\"2,4,56\"]\n\n[codepeople-post-map cat=\"-1\"]\n</code></pre>\n<p>excludecat:  Categories IDs to exclude, separated by &#8220;,&#8221;. From points to be displayed on map, the plugin excludes the points whose posts belong to the categories to exclude:</p>\n<pre><code>[codepeople-post-map tag=\"tag1,tag2\" excludecat=\"4\"]\n</code></pre>\n<p>excludepost:  Posts IDs to exclude separated by &#8220;,&#8221;:</p>\n<pre><code>[codepeople-post-map cat=\"-1\" excludepost=\"235,260\"]\n</code></pre>\n<p>excludetag:  Tags IDs to exclude separated by &#8220;,&#8221;:</p>\n<pre><code>[codepeople-post-map excludetag=\"2,13\"]\n</code></pre>\n<p>taxonomy:  The taxonomy is a special attribute that should be combined with other attributes, depending of taxonomies to use for points filtering. Suppose the website includes two new taxonomies:  taxonomyA and taxonomyB, and the map should display all points that belong to the posts with the value T1 for taxonomyA, and T3,T4 for taxonomyB, the shortcode would be:</p>\n<pre><code>[codepeople-post-map taxonomy=\"taxonomyA,taxonomyB\" taxonomyA=\"T1\" taxonomyB=\"t2,t3\"]\n</code></pre>\n<p>Note 5: The geolocation information is stored in image&#8217;s metadata from mobiles or cameras with GPS devices.</p>\n<p>Note 6: Some plugins interfere with the shortcodes replacements, and provokes that maps don&#8217;t be loaded correctly, in this case should be passed a new parameter through the shortcode print=1</p>\n<p>Passing the parameter print=1, displays the map at beginning of page/post content.</p>\n<p>Note 7: To display  in the Google Map all points in posts with a specific taxonomy assigned, or multiple taxonomies, should be used the &#8220;taxonomy&#8221; attribute in the shortcode, with the list of all taxonomies separated by the comma symbol, for example: taxonomy=&#8221;taxonomy1,taxonomy2&#8243;, and a new attribute for each taxonomy with the values corresponding. For example if you want select the points that belong to the posts with the values: &#8220;value1&#8221; for &#8220;taxonomy1&#8221;, the shortcode would be:</p>\n<pre><code>[codepeople-post-map taxonomy=\"taxonomy1\" taxonomy1=\"value1\"]\n</code></pre>\n<p>for multiple taxonomies:</p>\n<pre><code>[codepeople-post-map taxonomy=\"taxonomy1,taxonomy2\" taxonomy1=\"value1\" taxonomy2=\"value2,value3\"].\n</code></pre>\n<p>post_type: In combination with other attributes like: cat, tag or taxonomy, it is possible to load on map only the points that belong to the post types in the list:</p>\n<pre><code>[codepeople-post-map cat=\"-1\" post_type=\"post,page\"]\n</code></pre>\n<p>excludepost_type: In combination with other attributes like: cat, tag or taxonomy, it is possible to load on map only the points that do not belong to the post types in the list:</p>\n<pre><code>[codepeople-post-map cat=\"-1\" excludepost_type=\"post\"]\n</code></pre>\n<p>kml: Absolute URL (http://&#8230;) to a KML file with the Keyhole Markup Language:</p>\n<pre><code>[codepeople-post-map kml=\"http://www.yourwebsite.com/your-file.kml\"]\n</code></pre>\n<p>If you want more information about this plugin or another one don&#8217;t doubt to visit my website:</p>\n<p><a href=\"http://wordpress.dwbooster.com/content-tools/codepeople-post-map\" title=\"Google Maps CP\" rel=\"nofollow ugc\">http://wordpress.dwbooster.com/content-tools/codepeople-post-map</a></p>\n<h3>Interface</h3>\n<p><strong>Google Maps</strong> offers several setting options and is highly flexible. Options can be set up in the Settings page (and will become the <strong>default setup</strong> for all maps added to posts in the future), or may be <strong>specific to each post</strong> to be associated with the Google maps (in this case the values are entered in the editing screen of the post in question.)</p>\n<p>The settings are divided into two main groups, those belonging to the Google maps and those belonging to the geolocation point.</p>\n<p><strong>Google Maps configuration options:</strong></p>\n<ul>\n<li>Map zoom: Initial map zoom.</li>\n<li>Dynamic zoom: Allows to adjust the map&#8217;s zoom dynamically to display all points at the same time.</li>\n<li>Map width: Width of the map.</li>\n<li>Map height: Height of the map.</li>\n<li>Map margin: Margin of the map.</li>\n<li>Map align: Aligns the map at left, center or right of area.</li>\n<li>Map type: Select one of the possible types of maps to load (roadmap, satellite, terrain, hybrid).</li>\n<li>Map language: a large number of languages is available to be used on maps, select the one that matches your blog&#8217;s language.</li>\n<li>Allow drag the map: allows drag the map to see other places.</li>\n<li>Map route: Draws the route through the points that belong to the same post (available only in the premium and developer versions of plugin)</li>\n<li>Travel Mode: Travel mode used in route drawing (available only in the premium and developer versions of plugin)</li>\n<li>Include Traffic Layer: Displays a traffic layer over the map.</li>\n<li>Show info bubbles: display or hide the bubbles with the information associated to the points.</li>\n<li>Display a bubble by default: display  a bubble opened by default.</li>\n<li>Display map in post / page: When the Google maps are inserted in a post you can select whether to display the Google maps or display an icon, which displays the map, when pressed (if the Google maps are inserted into a template that allows multiple posts, this option does not apply)</li>\n<li>Options: This setting allows you to select which map controls should be available.</li>\n<li>Display a  &hellip;</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/codepeople-post-map.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/codepeople-post-map/assets/screenshot-1.jpg?rev=1355353",
            "caption": "Maps in action"
        },
        {
            "src": "https://ps.w.org/codepeople-post-map/assets/screenshot-2.jpg?rev=801307",
            "caption": "Styling the maps"
        },
        {
            "src": "https://ps.w.org/codepeople-post-map/assets/screenshot-3.jpg?rev=1195848",
            "caption": "Map with user's location"
        },
        {
            "src": "https://ps.w.org/codepeople-post-map/assets/screenshot-4.jpg?rev=1195848",
            "caption": "Map with shape"
        },
        {
            "src": "https://ps.w.org/codepeople-post-map/assets/screenshot-5.jpg?rev=1688212",
            "caption": "Global maps settings"
        },
        {
            "src": "https://ps.w.org/codepeople-post-map/assets/screenshot-6.jpg?rev=1195848",
            "caption": "Point insertion's form"
        },
        {
            "src": "https://ps.w.org/codepeople-post-map/assets/screenshot-7.jpg?rev=1195848",
            "caption": "Inserting map on sidebars"
        },
        {
            "src": "https://ps.w.org/codepeople-post-map/assets/screenshot-8.jpg?rev=1195848",
            "caption": "Generates points, from the geolocation information stored on image's metadata"
        },
        {
            "src": "https://ps.w.org/codepeople-post-map/assets/screenshot-9.jpg?rev=1195848",
            "caption": "Contact Form Builder (only available in the Developer version of the plugin)"
        },
        {
            "src": "https://ps.w.org/codepeople-post-map/assets/screenshot-10.jpg?rev=1195848",
            "caption": "Associate the contact form with the point, and define an email address between the point's data (only available in the Developer version of the plugin)"
        },
        {
            "src": "https://ps.w.org/codepeople-post-map/assets/screenshot-11.jpg?rev=1195848",
            "caption": "Export/Import section (only available in the Developer version of the plugin)"
        },
        {
            "src": "https://ps.w.org/codepeople-post-map/assets/screenshot-12.jpg?rev=1434152",
            "caption": ""
        }
    ],
    "tags": {
        "gmap": "gmap",
        "google-maps": "Google Maps",
        "maps": "maps",
        "marker": "marker",
        "places": "places"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.44": "https://downloads.wordpress.org/plugin/codepeople-post-map.1.0.44.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/codepeople-post-map.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/codepeople-post-map.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/codepeople-post-map.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/codepeople-post-map.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/codepeople-post-map.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/codepeople-post-map.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/codepeople-post-map.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/codepeople-post-map.1.1.7.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://wordpress.dwbooster.com/content-tools/codepeople-post-map",
    "banners": {
        "low": "https://ps.w.org/codepeople-post-map/assets/banner-772x250.png?rev=1624847",
        "high": "https://ps.w.org/codepeople-post-map/assets/banner-1544x500.png?rev=1624847"
    },
    "icons": {
        "1x": "https://ps.w.org/codepeople-post-map/assets/icon-128x128.jpg?rev=980165",
        "2x": "https://ps.w.org/codepeople-post-map/assets/icon-256x256.jpg?rev=980165"
    },
    "blocks": {
        "cpgm/map": {
            "name": "cpgm/map",
            "title": "CP Google Maps"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 82,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "codepeople-post-map",
            "language": "nl_NL",
            "version": "1.1.7",
            "updated": "2024-07-21 03:05:23",
            "package": "http://downloads.wordpress.org/translation/plugin/codepeople-post-map/1.1.7/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "codepeople-post-map",
            "language": "ru_RU",
            "version": "1.1.7",
            "updated": "2022-01-07 20:21:31",
            "package": "http://downloads.wordpress.org/translation/plugin/codepeople-post-map/1.1.7/ru_RU.zip"
        }
    ]
}