{
    "name": "Comment Mail",
    "slug": "comment-mail",
    "version": "161213",
    "author": "<a href=\"http://comment-mail.com/\">WP Sharks</a>",
    "author_profile": "https://profiles.wordpress.org/clavaque/",
    "contributors": {
        "clavaque": {
            "profile": "https://profiles.wordpress.org/clavaque/",
            "avatar": "https://secure.gravatar.com/avatar/1681dcdbe3bf7d1a209fb6de739e14f8?s=96&d=monsterid&r=g",
            "display_name": "Cristián Lávaque"
        }
    },
    "requires": "4.4",
    "tested": "5.2.21",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 88,
    "ratings": {
        "5": 8,
        "4": 3,
        "3": 1,
        "2": 1,
        "1": 0
    },
    "num_ratings": 13,
    "support_url": "https://wordpress.org/support/plugin/comment-mail/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 100,
    "downloaded": 11626,
    "last_updated": "2019-05-20 02:22:00",
    "added": "2015-07-10",
    "homepage": "http://comment-mail.com/",
    "sections": {
        "description": "<p>Comment Mail is a powerhouse plugin that allows commenters to sign up for email notifications whenever they leave a comment on your site. Or, they can also subscribe without commenting—the choice is theirs.</p>\n<h4>Core Plugin Features</h4>\n<p>See also: <a href=\"http://comment-mail.com/features/\" rel=\"nofollow ugc\">http://comment-mail.com/features/</a></p>\n<ul>\n<li>\n<p><strong>Comment Subscriptions</strong><br />\nNotify comment authors whenever a new comment is added to a specific post (of any kind) in WordPress. Comment authors can be notified about &#8220;all&#8221; new comments, or only about replies to their own comment (most popular). This functionality is missing from WordPress, but Comment Mail fills this role beautifully with its primary focus being on comment-related email notifications. Powerful!</p>\n</li>\n<li>\n<p><strong>Nifty Post Meta Box in WordPress</strong><br />\nWhen you create or edit a WordPress post, Comment Mail is right there with you! This is a feature that you never knew you wanted, but <em>cannot</em> live without once you try it on for size. Every WordPress post becomes a new mailing list of sorts, with every comment being a potential subscriber. With each new comment, others in the thread may be updated too, which brings your site to life with a vibrant discussion.</p>\n<p>The Post Meta Box widget provided by Comment Mail gives you a quick look at the activity on any given WordPress Post. It includes counters that link over to a more detailed look at your list of subscribers. This is easy to configure, and you can choose to exclude this for certain types of WordPress posts if you want to. e.g., portfolios or snippets you might want to exclude as they generally do not receive comments.</p>\n</li>\n<li>\n<p><strong>Comment Form Subscription Options</strong><br />\nUsing the Comment Mail dashboard panel you can customize all of the options that are presented whenever someone leaves a comment on your WordPress posts. For example; the template file itself, JavaScript, CSS, the default option selected by commenters (e.g., do not subscribe, replies only, or subscribe to everything), and much more.</p>\n<p>Comment Mail integrates with just about any WordPress theme you select. Your theme only needs to support the standard WordPress hook for comment form additions. For most theme developers that&#8217;s a no-brainer, and it&#8217;s easy to add yourself if you happen to be an exception to the rule; i.e., in cases where your theme perhaps does not have support for the default WordPress hook yet. We provide instructions.</p>\n</li>\n<li>\n<p><strong>Subscribe Without Commenting</strong><br />\nOrdinarily, Comment Mail subscriptions are associated with commenters; i.e., people that have something to say, and they want to be notified via email whenever a reply to their comment is posted. However, not everyone has something they want to post right away. So, perhaps they&#8217;ll enjoy monitoring the conversation via email. Comment Mail makes it easy for these spectators to subscribe. They can simply choose to subscribe without leaving a comment 🙂</p>\n</li>\n<li>\n<p><strong>Asynchronous Email Delivery</strong><br />\nDo you have thousands of comments? No problem! Comment Mail is built to handle large sites with a <em>lot</em> of users. Or, with a <em>lot</em> of comments, perhaps even on a single WordPress post. Comment Mail enqueues every notification that is to be delivered. Comment Mail uses its own dedicated asynchronous mail queue, which is processed quietly and efficiently behind-the-scenes. This eliminates any delay in processing of the comment and enqueuing process itself, so that Comment Mail will have nothing but a positive impact on your community overall.</p>\n</li>\n<li>\n<p><strong>Custom Email Message Headers</strong><br />\nYou can adjust the <code>Return-Path:</code>, the <code>From:</code> name and email address, the <code>Reply-To:</code> email address, and even test all of your current email configuration options right inside the WordPress Dashboard using the Comment Mail interface—it&#8217;s built right into WordPress with a seamless integration.</p>\n</li>\n<li>\n<p><strong>CAN-SPAM Compliant</strong><br />\nAll emails sent by Comment Mail are CAN-SPAM compliant. Comment Mail makes it easy for you to customize the postal address that is associated with your organization, and you can attach a privacy policy URL also. These are both requirements for your site to remain CAN-SPAM compliant; i.e., these components help you avoid problems with email being delivered to the spam/bulk folder in popular email clients.</p>\n</li>\n<li>\n<p><strong>Auto-Subscribe</strong><br />\nWith Comment Mail you can automatically subscribe the author of a WordPress post (of any kind) whenever it is published. This is optional, but highly recommended. You can also add a list of additional email addresses that should be subscribed automatically, choose the default email delivery option for Auto-Subscribe recipients, and even narrow this down to a specific list of Post Types in WordPress where Auto-Subscribe functionality should be applied; or where it should not be.</p>\n</li>\n<li>\n<p><strong>Auto-Confirm</strong><br />\nBy default, each subscriber is asked to confirm their subscription via email. However, Comment Mail can be configured to auto-confirm subscribers who have subscribed to other posts on your blog already. Nice!</p>\n<p>Or, if you like, it is also possible to force an auto-confirm for every subscriber; i.e., bypass the email confirmation message entirely. This is helpful for sites that restrict access already in some way, or in cases where a comment is associated with an already-authenticated user.</p>\n</li>\n<li>\n<p><strong>Front-End Subscription Management</strong><br />\nComment Mail exposes a powerful UI on the front-end of your site, which allows each comment author to review a list of their current subscriptions on your site, add new subscriptions on their own, or unsubscribe from one (or all) of their subscriptions easily.</p>\n</li>\n<li>\n<p><strong>Back-End Subscription Management</strong><br />\nFrom your WordPress Dashboard you can list all subscribers by post, by email address, by comment, search the list with custom criteria, and even filter and sort the results. The Comment Mail dashboard also makes it easy to perform bulk actions. For instance, to delete many subscribers, suspend them, reconfirm them, or just to review a list of those who signed up but never actually followed through on the confirmation process.</p>\n<p>In addition to a list of subscriptions, Comment Mail also maintains an event log, which exposes a lot of useful information that happens along the way. If you&#8217;re ever confused about why a particular user is subscribed (or not), the event log comes in handy. Not just for you, but if you ever need to explain something to a user this is handy.</p>\n</li>\n<li>\n<p><strong>Customizable Templates</strong><br />\nThe lite version of Comment Mail includes a basic set of templates that you can customize to match the theme of your site. Customize them all! Or, perhaps you simply want to tweak Comment Mail in ways that perfect the design in a particular WordPress theme of your choosing. That&#8217;s fine too!</p>\n<p>Comment Mail templates are all right in your Dashboard, ready to edit, with instructions to help you out. You can edit templates used for the on-site display of certain components, and you can also edit the email-related templates that are associated with comment notifications sent to subscribers; e.g., the email confirmation request, or the list of comment updates that subscribers receive when a new reply is posted by a user.</p>\n</li>\n<li>\n<p><strong>StCR (Subscribe to Comments Reloaded) Compat.</strong><br />\nComment Mail is a highly evolved plugin that is based on the original StCR (Subscribe to Comments Reloaded) plugin for WordPress. StCR gained enormous popularity in the WordPress community over a span of several years. This new improved version of StCR (now referred to as Comment Mail™) is backward compatible with most features provided by StCR.</p>\n<p>If you were previously running StCR, you can upgrade to Comment Mail right away. Many of your existing StCR options are automatically interpreted by Comment Mail whenever you activate it from the WordPress Dashboard. This saves you time and makes the transition much easier.</p>\n<p>In addition, if you were previously running StCR, you will be prompted by Comment Mail upon activation. Comment Mail will ask you to begin an import of all of your existing StCR subscribers so that you won&#8217;t lose any of those important people that establish your fan base.</p>\n</li>\n<li>\n<p><strong>Data Safeguards</strong><br />\nBy default, if you delete Comment Mail using the plugins menu in WordPress, no data is lost; i.e., Comment Mail will safeguard your configuration and all subscribers. However, if you want to completely uninstall Comment Mail you can turn Safeguards off, and <em>then</em> deactivate &amp; delete Comment Mail from the plugins menu in WordPress. This way Comment Mail will erase your options for the plugin, erase database tables created by the plugin, remove subscriptions, terminate CRON jobs, etc. In short, when Safeguards are off, Comment Mail erases itself from existence completely when you delete it.</p>\n</li>\n</ul>\n<h4>Enhanced / Pro-Only Features</h4>\n<p>See also: <a href=\"http://comment-mail.com/features/\" rel=\"nofollow ugc\">http://comment-mail.com/features/</a></p>\n<p><em><strong>TIP:</strong> you can preview Pro features in the free version by clicking the &#8220;Preview Pro Features&#8221; link at the top of your Comment Options options panel.</em></p>\n<ul>\n<li>\n<p><strong>SMTP Server Integration</strong><br />\nComment Mail Pro makes it possible for you to configure a dedicated SMTP server that is specifically for comment-related emails. For instance, many pro users use this feature to integrate Comment Mail with services like Mandrill or Amazon SES. This can dramatically improve your email delivery rate when it comes to email notifications that subscribers receive.</p>\n<p>Of course, it also has the side benefit of reducing load on your own server by moving email delivery to a more capable service that is specifically designed for such a thing.</p>\n</li>\n<li>\n<p><strong>RVE (Replies Via Email)</strong><br />\nComment Mail Pro makes it very easy for subscribers to reply to a notification they receive via email—<em>with</em> an email! In short, instead of a subscriber (i.e., someone that receives an update via email) being forced to return to your site, they can simply reply via email. Their response magically ends up on your site in the proper comment thread—just as if they <em>had</em> taken the time to return to your site.</p>\n<p>The best part about this feature is that it requires no special server requirements, and very little configuration. This is because Comment Mail Pro has been integrated with both Mandrill and SparkPost for RVE service. So all you need to do is follow the simple instructions to setup a Mandrill or SparkPost account. Then supply Comment Mail with the email address that you configure there.</p>\n</li>\n<li>\n<p><strong>SSO (Single Sign-On) Integration</strong><br />\nThis powerful functionality in Comment Mail Pro attracts <em>many</em> more comments (thus, subscribers). With SSO enabled a commenter can be identified by simply logging into your site with Facebook, Twitter, Google+, or LinkedIn.</p>\n<p>These popular social networks were integrated with Comment Mail Pro, because many visitors actually <em>prefer</em> to be identified using their social profile instead of being forced to register again and again on every site they want to leave a comment on.</p>\n<p>This feature also has the side benefit of turning commenters into registered users; i.e., users are first identified (quickly) by their Facebook, Twitter, Google+, or LinkedIn account, but then Comment Mail <em>also</em> quietly creates an account for them on your site too. This way you acquire a new user in the process; i.e., you collect a new subscriber and also a new registered user.</p>\n</li>\n<li>\n<p><strong>Impressive Statistics/Charts</strong><br />\nComment Mail Pro adds a new menu option which links to a set of advanced reporting tools that can be used to generate statistical charts/graphs. Yay! ~ You can review and compare total subscribers, most popular posts, least popular posts, confirmation percentages, suspension percentages, subscriptions by post ID, by country, by region, and more. This information is critical when you need to  better understand your subscribers, and it&#8217;s a unique component of your site that only Comment Mail can accurately report on.</p>\n</li>\n<li>\n<p><strong>Email Blacklisting</strong><br />\nComment Mail Pro makes it possible for a site owner to configure a list of patterns that will be used to blacklist certain email addresses. For instance, it is a good idea to blacklist role-based email addresses like <code>admin@*</code>, <code>webmaster@*</code>, <code>postmaster@*</code>, etc. With Comment Mail Pro you gain complete control over the blacklist that is applied internally.</p>\n</li>\n<li>\n<p><strong>Geo IP Region/Country Tracking</strong><br />\nComment Mail Pro can post user IP addresses to a remote geoPlugin API behind-the-scenes, asking for geographic data associated with each subscription. Comment Mail will store this information locally in your WP database so that the data can be exported easily, and even used in statistical reporting by Comment Mail itself.</p>\n</li>\n<li>\n<p><strong>Advanced PHP-Based Templates</strong><br />\nComment Mail Pro comes with two different template options. The default template set is a very basic shortcode-like syntax that is easy for novice site owners to work with. However, developers might prefer to switch to the advanced template mode, where they gain complete and total control over all of Comment Mail&#8217;s PHP-based templates.</p>\n<p>In either case (simple or advanced) all of Comment Mail&#8217;s template files are easily modified using the Comment Mail dashboard; i.e., from within WordPress, where instructions are provided, along with dynamic replacement codes and documented variables that are used in each template file.</p>\n</li>\n<li>\n<p><strong>Misc. UI-Related Settings</strong><br />\nIn Comment Mail Pro, you can tune-in 7-10 different UI-related options that impact users on both the front and back end of Comment Mail in different ways. For instance, you can alter the number of subscriptions that appear on each page in a summary that subscribers see when they view a list of their subscriptions. You can also adjust the way WordPress post/comment dropdown menus are presented when people choose to subscribe without commenting.</p>\n</li>\n<li>\n<p><strong>Import and/or Mass Update</strong><br />\nWith Comment Mail Pro you can import and/or mass update subscribers from the WordPress dashboard. Comment Mail&#8217;s importer will accept direct CSV input in a textarea, or you can choose to upload a prepared CSV file. This allows you to bring existing subscribers (from any platform) into a WordPress blog and keep users up-to-date with comments that occur on your site.</p>\n</li>\n<li>\n<p><strong>Subscriber Export</strong><br />\nComment Mail Pro makes it easy to export some (or all) of your subscribers into one (or more) downloadable CSV files. This feature ensures that your subscribers remain portable; should you decide to change platforms or move subscribers to another site in the future.</p>\n</li>\n<li>\n<p><strong>Import/Export Config. Options</strong><br />\nThis feature is a <em>huge</em> time-saver if you run more than one site where Comment Mail is being used. You can import your options from another WordPress installation where you&#8217;ve already configured Comment Mail before; i.e., you can easily duplicate an established configuration and save time setting up the new site.</p>\n</li>\n<li>\n<p><strong>Subscription Cleaner Tuning</strong><br />\nComment Mail automatically deletes unconfirmed and trashed subscriptions after X number of hours/minutes/days. It runs automatically via WP-Cron, and the subscription cleaner can be configured in a number of ways. Comment Mail Pro makes it possible for you to tune-in this feature (i.e., customize your configuration)—or even disable it entirely if prefer.</p>\n</li>\n<li>\n<p><strong>Log Cleaner Adjustments</strong><br />\nComment Mail automatically deletes very old event log entries after X number of hours/minutes/days. It runs automatically via WP-Cron, and the log cleaner can be configured in a number of ways. Comment Mail Pro makes it possible for you to tune-in this feature (i.e., customize your configuration)—or even disable it entirely if prefer.</p>\n</li>\n<li>\n<p><strong>Queue Processor Adjustments</strong><br />\nPerformance tuning Comment Mail can be important on very large sites. With Comment Mail Pro you&#8217;ll have full control over the asynchronous email notification processing queue. For instance, you can control how often Comment Mail&#8217;s queue processor runs, how long it will run each time, the max number of emails it will process in each run, and more.</p>\n</li>\n<li>\n<p><strong>MailChimp Integration</strong><br />\nIntegrate with MailChimp to give users the option of subscribing to your site-wide mailing list whenever they leave a comment or post a new reply. In addition to subscribing to comment reply notifications they can also choose to join your MailChimp mailing list.</p>\n</li>\n</ul>\n<h3>Enhanced / Pro-Only Features</h3>\n<p>See also: <a href=\"http://comment-mail.com/features/\" rel=\"nofollow ugc\">http://comment-mail.com/features/</a></p>\n<p><em><strong>TIP:</strong> you can preview Pro features in the free version by clicking the &#8220;Preview Pro Features&#8221; link at the top of your Comment Options options panel.</em></p>\n<ul>\n<li>\n<p><strong>SMTP Server Integration</strong><br />\nComment Mail Pro makes it possible for you to configure a dedicated SMTP server that is specifically for comment-related emails. For instance, many pro users use this feature to integrate Comment Mail with services like Mandrill or Amazon SES. This can dramatically improve your email delivery rate when it comes to email notifications that subscribers receive.</p>\n<p>Of course, it also has the side benefit of reducing load on your own server by moving email delivery to a more capable service that is specifically designed for such a thing.</p>\n</li>\n<li>\n<p><strong>RVE (Replies Via Email)</strong><br />\nComment Mail Pro makes it very easy for subscribers to reply to a notification they receive via email—<em>with</em> an email! In short, instead of a subscriber (i.e., someone that receives an update via email) being forced to return to your site, they can simply reply via email. Their response magically ends up on your site in the proper comment thread—just as if they <em>had</em> taken the time to return to your site.</p>\n<p>The best part about this feature is that it requires no special server requirements, and very little configuration. This is because Comment Mail Pro has been integrated with both Mandrill and SparkPost for RVE service. So all you need to do is follow the simple instructions to setup a Mandrill or SparkPost account. Then supply Comment Mail with the email address that you configure there.</p>\n</li>\n<li>\n<p><strong>SSO (Single Sign-On) Integration</strong><br />\nThis powerful functionality in Comment Mail Pro attracts <em>many</em> more comments (thus, subscribers). With SSO enabled a commenter can be identified by simply logging into your site with Facebook, Twitter, Google+, or LinkedIn.</p>\n<p>These popular social networks were integrated with Comment Mail Pro, because many visitors actually <em>prefer</em> to be identified using their social profile instead of being forced to register again and again on every site they want to leave a comment on.</p>\n<p>This feature also has the side benefit of turning commenters into registered users; i.e., users are first identified (quickly) by their Facebook, Twitter, Google+, or LinkedIn account, but then Comment Mail <em>also</em> quietly creates an account for them on your site too. This way you acquire a new user in the process; i.e., you collect a new subscriber and also a new registered user.</p>\n</li>\n<li>\n<p><strong>Impressive Statistics/Charts</strong><br />\nComment Mail Pro adds a new menu option which links to a set of advanced reporting tools that can be used to generate statistical charts/graphs. Yay! ~ You can review and compare total subscribers, most popular posts, least popular posts, confirmation percentages, suspension percentages, subscriptions by post ID, by country, by region, and more. This information is critical when you need to  better understand your subscribers, and it&#8217;s a unique component of your site that only Comment Mail can accurately report on.</p>\n</li>\n<li>\n<p><strong>Email Blacklisting</strong><br />\nComment Mail Pro makes it possible for a site owner to configure a list of patterns that will be used to blacklist certain email addresses. For instance, it is a good idea to blacklist role-based email addresses like <code>admin@*</code>, <code>webmaster@*</code>, <code>postmaster@*</code>, etc. With Comment Mail Pro you gain complete control over the blacklist that is applied internally.</p>\n</li>\n<li>\n<p><strong>Geo IP Region/Country Tracking</strong><br />\nComment Mail Pro can post user IP addresses to a remote geoPlugin API behind-the-scenes, asking for geographic data associated with each subscription. Comment Mail will store this information locally in your WP database so that the data can be exported easily, and even used in statistical reporting by Comment Mail itself.</p>\n</li>\n<li>\n<p><strong>Advanced PHP-Based Templates</strong><br />\nComment Mail Pro comes with two different template options. The default template set is a very basic shortcode-like syntax that is easy for novice site owners to work with. However, developers might prefer to switch to the advanced template mode, where they gain complete and total control over all of Comment Mail&#8217;s PHP-based templates.</p>\n<p>In either case (simple or advanced) all of Comment Mail&#8217;s template files are easily modified using the Comment Mail dashboard; i.e., from within WordPress, where instructions are provided, along with dynamic replacement codes and documented variables that are used in each template file.</p>\n</li>\n<li>\n<p><strong>Misc. UI-Related Settings</strong><br />\nIn Comment Mail Pro, you can tune-in 7-10 different UI-related options that impact users on both the front and back end of Comment Mail in different ways. For instance, you can alter the number of subscriptions that appear on each page in a summary that subscribers see when they view a list of their subscriptions. You can also adjust the way WordPress post/comment dropdown menus are presented when people choose to subscribe without commenting.</p>\n</li>\n<li>\n<p><strong>Import and/or Mass Update</strong><br />\nWith Comment Mail Pro you can import and/or mass update subscribers from the WordPress dashboard. Comment Mail&#8217;s importer will accept direct CSV input in a textarea, or you can choose to upload a prepared CSV file. This allows you to bring existing subscribers (from any platform) into a WordPress blog and keep users up-to-date with comments that occur on your site.</p>\n</li>\n<li>\n<p><strong>Subscriber Export</strong><br />\nComment Mail Pro makes it easy to export some (or all) of your subscribers into one (or more) downloadable CSV files. This feature ensures that your subscribers remain portable; should you decide to change platforms or move subscribers to another site in the future.</p>\n</li>\n<li>\n<p><strong>Import/Export Config. Options</strong><br />\nThis feature is a <em>huge</em> time-saver if you run more than one site where Comment Mail is being used. You can import your options from another WordPress installation where you&#8217;ve already configured Comment Mail before; i.e., you can easily duplicate an established configuration and save time setting up the new site.</p>\n</li>\n<li>\n<p><strong>Subscription Cleaner Tuning</strong><br />\nComment Mail automatically deletes unconfirmed and trashed subscriptions after X number of hours/minutes/days. It runs automatically via WP-Cron, and the subscription cleaner can be configured in a number of ways. Comment Mail Pro makes it possible for you to tune-in this feature (i.e., customize your configuration)—or even disable it entirely if prefer.</p>\n</li>\n<li>\n<p><strong>Log Cleaner Adjustments</strong><br />\nComment Mail automatically deletes very old event log entries after X number of hours/minutes/days. It runs automatically via WP-Cron, and the log cleaner can be configured in a number of ways. Comment Mail Pro makes it possible for you to tune-in this feature (i.e., customize your configuration)—or even disable it entirely if prefer.</p>\n</li>\n<li>\n<p><strong>Queue Processor Adjustments</strong><br />\nPerformance tuning Comment Mail can be important on very large sites. With Comment Mail Pro you&#8217;ll have full control over the asynchronous email notification processing queue. For instance, you can control how often Comment Mail&#8217;s queue processor runs, how long it will run each time, the max number of emails it will process in each run, and more.</p>\n</li>\n<li>\n<p><strong>MailChimp Integration</strong><br />\nIntegrate with MailChimp to give users the option of subscribing to your site-wide mailing list whenever they leave a comment or post a new reply. In addition to subscribing to comment reply notifications they can also choose to join your MailChimp mailing list.</p>\n</li>\n</ul>\n<h3>Software Requirements</h3>\n<p>In addition to the <a href=\"https://wordpress.org/about/requirements/\" rel=\"ugc\">WordPress Requirements</a>, Comment Mail™ requires the following minimum versions:</p>\n<ul>\n<li>PHP 5.4+</li>\n<li>Apache 2.1+</li>\n</ul>\n<h3>License</h3>\n<p>Copyright: © 2013 <a href=\"http://www.websharks-inc.com/bizdev/\" rel=\"nofollow ugc\">WebSharks, Inc.</a> (coded in the USA)</p>\n<p>Released under the terms of the <a href=\"http://www.gnu.org/licenses/gpl-2.0.html\" rel=\"nofollow ugc\">GNU General Public License</a>.</p>\n<h4>Credits / Additional Acknowledgments</h4>\n<ul>\n<li>Software designed for WordPress®.\n<ul>\n<li>GPL License <a href=\"https://codex.wordpress.org/GPL\" rel=\"nofollow ugc\">https://codex.wordpress.org/GPL</a></li>\n<li>WordPress® <a href=\"http://wordpress.org\" rel=\"ugc\">http://wordpress.org</a></li>\n</ul>\n</li>\n<li>Some JavaScript extensions require jQuery.\n<ul>\n<li>GPL-Compatible License <a href=\"http://jquery.org/license\" rel=\"nofollow ugc\">http://jquery.org/license</a></li>\n<li>jQuery <a href=\"http://jquery.com/\" rel=\"nofollow ugc\">http://jquery.com/</a></li>\n</ul>\n</li>\n<li>CSS framework and some JavaScript functionality provided by Bootstrap.\n<ul>\n<li>GPL-Compatible License <a href=\"http://getbootstrap.com/getting-started/#license-faqs\" rel=\"nofollow ugc\">http://getbootstrap.com/getting-started/#license-faqs</a></li>\n<li>Bootstrap <a href=\"http://getbootstrap.com/\" rel=\"nofollow ugc\">http://getbootstrap.com/</a></li>\n</ul>\n</li>\n<li>Icons provided by Font Awesome.\n<ul>\n<li>GPL-Compatible License <a href=\"http://fortawesome.github.io/Font-Awesome/license/\" rel=\"nofollow ugc\">http://fortawesome.github.io/Font-Awesome/license/</a></li>\n<li>Font Awesome <a href=\"http://fortawesome.github.io/Font-Awesome/\" rel=\"nofollow ugc\">http://fortawesome.github.io/Font-Awesome/</a></li>\n</ul>\n</li>\n</ul>\n",
        "installation": "<h4>Comment Mail™ is very easy to install&#8230;</h4>\n<p>See also: <a href=\"http://comment-mail.com/installation/\" rel=\"nofollow ugc\">http://comment-mail.com/installation/</a></p>\n<ol>\n<li>Upload the <code>/comment-mail</code> folder to your <code>/wp-content/plugins/</code> directory.</li>\n<li>Activate the plugin through the Plugins menu in WordPress®.</li>\n<li>Navigate to the <strong>Comment Mail</strong> panel &amp; enable.</li>\n</ol>\n",
        "faq": "<ul>\n<li>Please see: <a href=\"http://comment-mail.com/kb/kb-tag/pre-sale-faqs/\" rel=\"nofollow ugc\">http://comment-mail.com/kb/kb-tag/pre-sale-faqs/</a></li>\n</ul>\n",
        "changelog": "<h4>v161213</h4>\n<ul>\n<li><strong>Bug Fix:</strong> Prevent browser autocomplete in Comment Mail options. See <a href=\"https://github.com/websharks/comment-mail/issues/319\" rel=\"nofollow ugc\">Issue #319</a>.</li>\n<li><strong>Bug Fix:</strong> Searching by email address alone should always narrow to the search to that specific email address and not result in any fuzzy or fulltext matching. See <a href=\"https://github.com/websharks/comment-mail/issues/226\" rel=\"nofollow ugc\">Issue #226</a>.</li>\n<li><strong>Bug Fix:</strong> The conflict check for &#8216;Subscribe to Comments Reloaded&#8217; was not working in the previous release; i.e., if you attempt to activate both Comment Mail and the &#8216;Subscribe to Comments Reloaded&#8217; plugin at the same, this should result in a Dashboard warning. Fixed in this release. See <a href=\"https://github.com/websharks/comment-mail/issues/315\" rel=\"nofollow ugc\">Issue #315</a>.</li>\n<li><strong>Bug Fix:</strong> Notify &#8216;Subscribe to Comments Reloaded&#8217; users about the comment form template being disabled under certain scenarios. See <a href=\"https://github.com/websharks/comment-mail/issues/314\" rel=\"nofollow ugc\">Issue #314</a>.</li>\n<li><strong>Bug Fix:</strong> Do not attempt to import &#8216;Subscribe to Comments Reloaded&#8217; (StCR) settings if StCR is no longer installed, even if old StCR options exist in the database. See <a href=\"https://github.com/websharks/comment-mail/issues/294\" rel=\"nofollow ugc\">Issue #294</a>.</li>\n<li><strong>Bug Fix</strong> (Pro): Do not show SparkPost partner image when Mandrill is selected as the RVE handler. See <a href=\"https://github.com/websharks/comment-mail/issues/318\" rel=\"nofollow ugc\">Issue #318</a>.</li>\n<li><strong>Bug Fix</strong> (Pro): Conflict checks between lite and pro corrected. This was not working properly in the previous release; i.e., installing Comment Mail Pro when Comment Mail Lite is already running should result in Comment Mail Lite being deactivated automatically. See <a href=\"https://github.com/websharks/comment-mail/issues/270\" rel=\"nofollow ugc\">Issue #270</a>.</li>\n<li><strong>New Feature:</strong> It is now possible to manually process the outgoing mail queue. See: <strong>WP Dashboard <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Comment Mail <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Mail Queue</strong>. See also <a href=\"https://github.com/websharks/comment-mail/issues/282\" rel=\"nofollow ugc\">Issue #282</a>.</li>\n<li><strong>New Feature</strong> (Pro): In Comment Mail Pro it is now possible to enable/disable comment content clipping entirely; e.g., if you prefer that email notifications include the full original comment content in raw HTML instead of being clipped and displayed in the email as plain text. See: <strong>WP Dashboard <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Comment Mail <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Config. Options <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Email Notification Clips</strong>. See also: <a href=\"https://github.com/websharks/comment-mail/issues/281\" rel=\"nofollow ugc\">Issue #281</a>.</li>\n<li><strong>Accessibility:</strong> This release improves screen reader accessibility by adding <code>aria-hidden=\"true\"</code> to all FontAwesome icons. See <a href=\"https://github.com/websharks/comment-mail/issues/304\" rel=\"nofollow ugc\">Issue #304</a>.</li>\n<li><strong>Accessibility:</strong> This release improves screen reader accessibility by offering a new setting that allows a site owner to enable or disable select menu option enhancement via jQuery. Disabling select menu option enhancement has the benefit of improving accessibility for screen readers whenever accessibility is of more concern than presentation. See: <strong>Dashboard <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Comment Mail <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Config Options <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Misc. UI-Related Settings</strong>. See also <a href=\"https://github.com/websharks/comment-mail/issues/304\" rel=\"nofollow ugc\">Issue #304</a>.</li>\n</ul>\n<h4>v161129</h4>\n<ul>\n<li>\n<p><strong>Bug Fix:</strong> This release corrects a nasty bug that was first introduced in the previous release, resulting in the loss of template modifications when/if any Comment Mail options were edited after having upgraded to the previous release. See <a href=\"https://github.com/websharks/comment-mail/issues/322\" rel=\"nofollow ugc\">Issue #322</a>. In short, please avoid v161118 (the previous release).</p>\n<p><em><strong>Note:</strong> If you already upgraded to v161118, but you have not edited your Comment Mail options yet (or had no template modifications anyway), there is no cause for alarm.</em></p>\n<p><em>However, if you upgraded to v161118 and <strong>did</strong> edit your Comment Mail options after updating, and if you also modified Comment Mail templates, you may have experienced a loss of template data; i.e., the changes you made to the default templates may have been lost as a result of this bug. We are very sorry about this. Please see <a href=\"https://github.com/websharks/comment-mail/issues/322\" rel=\"nofollow ugc\">Issue #322</a> for additional details.</em></p>\n</li>\n</ul>\n<h4>v161118</h4>\n<ul>\n<li><strong>Bug Fix:</strong> Exclude unapproved comments from the dropdown menu on the &#8216;Subscribe Without Commenting&#8217; form. See <a href=\"https://github.com/websharks/comment-mail/issues/299\" rel=\"nofollow ugc\">Issue #299</a>.</li>\n<li><strong>Enhancement:</strong> When parsing templates, this release uses <code>include()</code> instead of <code>eval()</code> whenever possible. This improves compatibility with shared hosting providers and makes it easier to debug template parsing issues should they occur. See <a href=\"https://github.com/websharks/comment-mail/issues/192\" rel=\"nofollow ugc\">Issue #192</a>.</li>\n<li><strong>Enhancement:</strong> When parsing templates, this release uses <code>include()</code> instead of <code>eval()</code> whenever possible. This improves compatibility with shared hosting providers and makes it easier to debug template parsing issues should they occur. See <a href=\"https://github.com/websharks/comment-mail/issues/192\" rel=\"nofollow ugc\">Issue #192</a>.</li>\n<li><strong>PHP v7 Compatibility:</strong> After further testing, it was found that while Comment Mail is compatible with PHP v7.0, you must be running PHP v7.0.9+. Starting with this release of Comment Mail if you&#8217;re running PHP v7 &lt; 7.0.9 a warning is displayed in the WordPress Dashboard asking the site owner to upgrade to PHP v7.0.9 or higher. Note: While PHP v7.0.9 is adequate, PHP v7.0.10 is strongly recommended. See <a href=\"https://github.com/websharks/comment-mail/issues/272\" rel=\"nofollow ugc\">Issue #272</a>.</li>\n<li><strong>New SparkPost Integration</strong> (Pro):  It is now possible to use SparkPost for Replies-via-Email (RVE) instead of Mandrill. Note that SparkPost is now the suggested RVE Handler for Comment Mail because Mandrill changed its pricing structure a while back. In short, Mandrill requires a fee, whereas SparkPost (recommended) offers Relay Webhooks as a part of their free plan. See <a href=\"https://github.com/websharks/comment-mail/issues/265\" rel=\"nofollow ugc\">Issue #265</a>.</li>\n<li><strong>New Feature</strong> (Pro): Adding support for MailChimp integration. It is now possible to give users the option of subscribing to your site-wide mailing list whenever they leave a comment or reply; i.e., in addition to subscribing to comment reply notifications they can also join your MailChimp mailing list. See <a href=\"https://github.com/websharks/comment-mail/issues/114\" rel=\"nofollow ugc\">Issue #114</a>.</li>\n</ul>\n<h4>v160824</h4>\n<ul>\n<li><strong>Bug Fix</strong>: Fixed a bug that was generating a fatal error when replying to comments. This bug only affected the Lite version of Comment Mail and was introduced by the previous release (v160818) where <a href=\"https://github.com/websharks/comment-mail/issues/285\" rel=\"nofollow ugc\">work</a> was done to strip out unused Pro-only code from the Lite codebase. A few references to Pro-only functions were missed and that resulted in fatal errors for the Lite version in some scenarios. See <a href=\"https://github.com/websharks/comment-mail/issues/297\" rel=\"nofollow ugc\">Issue #297</a>.</li>\n</ul>\n<h4>v160818</h4>\n<ul>\n<li><strong>Bug Fix</strong>: Fixed a bug where the &#8220;My Comment Subscriptions&#8221; link would appear on the Add New Subscription page (when Subscribing without Commenting) and would lead to a page that displayed an error message stating that there were no subscriptions to list. That link is now hidden when there are no subscriptions to list. Props @Reedyseth @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/229\" rel=\"nofollow ugc\">Issue #229</a>.</li>\n<li><strong>Bug Fix</strong> (Pro): Removed an erroneous anchor tag in the Advanced Template for Comment Notification Message Body. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/287\" rel=\"nofollow ugc\">Issue #287</a>.</li>\n<li><strong>UI Enhancement:</strong> Improved the nav bar at the top of the options pages to reduce unnecessary whitespace. Also moved the Restore button to the nav bar so that it&#8217;s not so prominent. Props @renzms. See <a href=\"https://github.com/websharks/comment-mail/issues/284\" rel=\"nofollow ugc\">Issue #284</a>.</li>\n<li><strong>UI Enhancement:</strong> Added links to the Comment Mail <a href=\"http://twitter.com/CommentMail\" rel=\"nofollow ugc\">Twitter</a> and <a href=\"https://www.facebook.com/Comment-Mail-565683256946855/\" rel=\"nofollow ugc\">Facebook</a> pages to the nav bar on the options page. Props @renzms. See <a href=\"https://github.com/websharks/comment-mail/issues/286\" rel=\"nofollow ugc\">Issue #286</a>.</li>\n<li><strong>UX Enhancement:</strong> Removed IP address information from email notification templates to better comply with data protection laws in certain countries. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/288\" rel=\"nofollow ugc\">Issue #288</a>.</li>\n<li><strong>SEO Improvement:</strong> Added <code>rel=\"nofollow\"</code> to the &#8220;Subscribe without Commenting&#8221; link and &#8220;Manage Subscriptions&#8221; link on the comment subscription form to avoid indexing or transferring PageRank. Props @IvanRF. See <a href=\"https://github.com/websharks/comment-mail-pro/pull/80\" rel=\"nofollow ugc\">Issue #80</a>.</li>\n<li>Removed several development-only files from the distributable that were inadvertently included during the build process. See <a href=\"https://github.com/websharks/comment-mail/issues/285\" rel=\"nofollow ugc\">Issue #285</a>.</li>\n<li>Added Renz Sevilla (<code>renzms</code>) to the contributors list.</li>\n</ul>\n<h4>v160618</h4>\n<ul>\n<li><strong>Restructured Codebase</strong>: The codebase has been completely restructured to improve performance, enhance flexibility, and make it easier to build in new features! Props @jaswsinc. See <a href=\"https://github.com/websharks/comment-mail/issues/150\" rel=\"nofollow ugc\">Issue #150</a>.</li>\n<li>\n<p><strong>Comment Mail Pro Upgrade Notice: Incompatible Advanced Templates.</strong> This version of Comment Mail includes a rewritten and improved codebase. This rewrite, however, came with the unfortunate side effect of breaking backwards compatibility with Advanced Templates that were customized in a previous version of Comment Mail Pro.</p>\n<p>If you are currently using Comment Mail Pro and you&#8217;ve customized your Advanced Templates, all of your customized Advanced Templates will be backed up and the templates will then be reset to their new defaults. You will find the backup of your old customized template appended to the bottom of the new template, separated with a  <code>Legacy Template Backup</code> PHP comment. See <a href=\"https://github.com/websharks/comment-mail/issues/238#issuecomment-225029042\" rel=\"nofollow ugc\">example screenshots</a>.</p>\n<p>Note: This change has no effect on Simple templates—only Advanced Templates are affected. Advanced Templates are a Pro-only feature, so this notice only applies to Comment Mail Pro. See <a href=\"https://github.com/websharks/comment-mail/issues/238\" rel=\"nofollow ugc\">Issue #238</a>.</p>\n</li>\n<li><strong>Bug Fix</strong>: Fixed a bug where <code>esc_html()</code> was being used where <code>esc_sql()</code> should&#8217;ve been used. Props @jaswsinc @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/268\" rel=\"nofollow ugc\">Issue #268</a>.</li>\n<li><strong>Bug Fix</strong>: Fixed a bug that in some scenarios resulted in a &#8220;DB table creation failure&#8221; error when activating the plugin. Props @thienhaxanh2405, @PanNovak, @kristineds, and @jaswsinc. See <a href=\"https://github.com/websharks/comment-mail/issues/260\" rel=\"nofollow ugc\">Issue #260</a>.</li>\n<li><strong>Bug Fix</strong>: Fixed a bug where &#8220;New reply&#8221; notification emails were not being parsed properly by some Hotmail accounts and were showing up as blank. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/259\" rel=\"nofollow ugc\">Issue #259</a>.</li>\n<li><strong>Bug Fix</strong>: Fixed a bug that allowed spam comments to create subscriptions in Comment Mail when using Akismet. Props @IvanRF. See <a href=\"https://github.com/websharks/comment-mail/issues/250\" rel=\"nofollow ugc\">Issue #250</a>.</li>\n<li><strong>Bug Fix</strong> (Pro): When Chrome or Firefox Autofill Username/Password was enabled, the Comment Mail Pro Updater fields would incorrectly be autofilled by the browser with invalid credentials. This has been fixed. Props @renzms. <a href=\"https://github.com/websharks/comment-mail/issues/274\" rel=\"nofollow ugc\">Issue #274</a>.</li>\n<li><strong>Bug Fix</strong>: Fixed a bug where the cron job for the Queue Processor could get deleted and never recreated, which would result in notifications getting stuck in the Mail Queue and not being sent out. If you ever installed Comment Mail and then deleted it (without first disabling Data Safeguards), and then installed Comment Mail again, you were probably affected by this issue. This release fixes the issue and makes the cron setup more robust. Props @kristineds, @renzms, @jaswsinc, and @IvanRF for help testing. See <a href=\"https://github.com/websharks/comment-mail/issues/194\" rel=\"nofollow ugc\">Issue #194</a> and <a href=\"https://github.com/websharks/comment-mail/issues/173\" rel=\"nofollow ugc\">Issue #173</a>.</li>\n<li><strong>Bug Fix:</strong> Fixed a bug where a subscriber who selected Hourly Digest and who had never been notified before could, in some scenarios, have their subscription treated instead as a Weekly Digest. This bug was found and fixed during the codebase restructuring. Props @jaswsinc. See <a href=\"https://github.com/websharks/comment-mail/issues/150\" rel=\"nofollow ugc\">Issue #150</a> and additional discussion in <a href=\"https://github.com/websharks/comment-mail/issues/173#issuecomment-225215333\" rel=\"nofollow ugc\">Issue #173</a>.</li>\n<li><strong>Bug Fix:</strong> Fixed a bug where in some scenarios Mail Queue entries for Digest Notifications that should have been held for sending later were not being held and were also not being sent. They also would not have shown up in the Mail Queue Event Log. This bug was found and fixed during the codebase restructuring. Props @jaswsinc. See <a href=\"https://github.com/websharks/comment-mail/issues/150\" rel=\"nofollow ugc\">Issue #150</a> and additional discussion in <a href=\"https://github.com/websharks/comment-mail/issues/173#issuecomment-225215333\" rel=\"nofollow ugc\">Issue #173</a>.</li>\n<li><strong>Enhancement</strong>: Minor improvements to the Options Page menu links and positioning of the Pro Preview link. Props @renzms. See <a href=\"https://github.com/websharks/comment-mail/issues/227\" rel=\"nofollow ugc\">Issue #227</a>.</li>\n<li><strong>Enhancement</strong>: It&#8217;s now possible to use the following shortcodes in the Email Footer Tag for Email Footer Templates: <code>[home_url]</code>, <code>[blog_name_clip]</code>, and <code>[current_host_path]</code>. Props @kristineds and @IvanRF. See <a href=\"https://github.com/websharks/comment-mail/issues/246\" rel=\"nofollow ugc\">Issue #246</a>.</li>\n<li><strong>Enhancement</strong>: Improved the Subscriptions meta box that appears on the Post Edit screen. For each subscription, the meta box now lists the full name and email address, the date the subscription was created, and a view link that allows you to view/edit the subscription. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/231\" rel=\"nofollow ugc\">Issue #231</a>.</li>\n<li><strong>UX Enhancement (Pro)</strong>: Improved the Dashboard notice that appears when you try to enable the Pro version of Comment Mail when the Lite version is currently enabled. Props @kristineds @jaswsinc. See <a href=\"https://github.com/websharks/comment-mail/issues/230\" rel=\"nofollow ugc\">Issue #230</a>.</li>\n<li><strong>UX Enhancement</strong>: When Subscribing Without Commenting, the Add New Subscription form now pre-populates the Name and Email address fields whenever possible. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/204\" rel=\"nofollow ugc\">Issue #204</a>.</li>\n<li><strong>UI Enhancement</strong>: Dashboard notices generated by Comment Mail now use the WordPress-style dismiss button to keep things consistent. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/193\" rel=\"nofollow ugc\">Issue #193</a>.</li>\n</ul>\n<h4>v160213</h4>\n<ul>\n<li><strong>Minor Fix</strong>: Fixed a spelling mistake in one of the default email templates. Props @kristineds  @RealDavidoff. See <a href=\"https://github.com/websharks/comment-mail/issues/208\" rel=\"nofollow ugc\">Issue #208</a>.</li>\n<li><strong>Enhancement</strong>: Moved the default location for the Subscriptions Meta Box on the Post Edit screen so that it shows up underneath the post editing area instead of above the Publish box. See <a href=\"https://github.com/websharks/comment-mail/issues/57#issuecomment-174482908\" rel=\"nofollow ugc\">Issue #57</a>.</li>\n<li><strong>Enhancement</strong>: Removed an irrelevant and confusing note from the Add New Subscription page. Props @kristineds @RealDavidoff. See <a href=\"https://github.com/websharks/comment-mail/issues/207\" rel=\"nofollow ugc\">Issue #207</a>.</li>\n<li><strong>Enhancement</strong>: Improved the front-end Edit Subscription form and removed the &#8220;x&#8221; in on the Status and Deliver fields that allowed clearing those fields, which did not make sense since both of those fields are required. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/195\" rel=\"nofollow ugc\">Issue #195</a>.</li>\n<li><strong>Enhancement</strong>: Improved the way some links work by opening on-site links in current tab, and external links in new tab. Props @RealDavidoff @kristineds @renzms. See <a href=\"https://github.com/websharks/comment-mail/issues/202\" rel=\"nofollow ugc\">Issue #202</a>.</li>\n<li><strong>Enhancement</strong>: Improved front-end pages by using <code>&lt;em&gt;</code> (emphasis) tags instead of quotation marks in various areas. Props @RealDavidoff @renzms. See <a href=\"https://github.com/websharks/comment-mail/issues/201\" rel=\"nofollow ugc\">Issue #201</a>.</li>\n<li><strong>Enhancement</strong>: Improved email templates by simplifying the subject lines by using <code>[</code> and <code>]</code> brackets around the meta information in the subject. See <a href=\"https://github.com/websharks/comment-mail/issues/232\" rel=\"nofollow ugc\">Issue #232</a>.</li>\n<li><strong>Enhancement</strong>: When Subscribing Without Commenting, the Add New Subscription form now pre-populates the Name and Email address fields whenever possible. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/204\" rel=\"nofollow ugc\">Issue #204</a>.</li>\n<li><strong>Enhancement</strong>: Improved the consistency of how we refer to the &#8220;instant&#8221; delivery option by replacing any occurrences of &#8220;asap&#8221; with &#8220;instantly&#8221;. These names were previously being mixed. We now use &#8220;instantly&#8221;. Props @RealDavidoff @renzms @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/206\" rel=\"nofollow ugc\">Issue #206</a>.</li>\n<li><strong>Enhancement</strong>: Added the installed version number to the plugin options pages. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/187\" rel=\"nofollow ugc\">Issue #187</a>.</li>\n<li><strong>Enhancement</strong>: Improved the organization of navigation links on the plugin options pages. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/187\" rel=\"nofollow ugc\">Issue #187</a>.</li>\n</ul>\n<h4>v151224</h4>\n<ul>\n<li><strong>Bug Fix</strong> (Multisite): Fixed a Multisite uninstallation bug that was preventing Comment Mail from taking Child Blogs into consideration when uninstalling, which was resulting in an incomplete uninstallation. See <a href=\"https://github.com/websharks/comment-mail/issues/136\" rel=\"nofollow ugc\">Issue #136</a>.</li>\n<li><strong>Bug Fix</strong> (StCR Import): This release corrects an StCR importation bug. The bug was causing an existing StCR subscription with a <code>Y</code> status (i.e., one for all comments/replies) to be imported into Comment Mail on a per-comment basis. Therefore, a symptom of this bug was to find that you had multiple subscriptions imported for users who wanted <em>all</em> comments, instead of them just having one subscription imported which would automatically cover the entire post. See also <a href=\"https://github.com/websharks/comment-mail/issues/162\" rel=\"nofollow ugc\">Issue #162</a>.</li>\n<li><strong>Bug Fix</strong> (StCR Import): Fixed a bug with the StCR Import routine that was preventing subscriptions for comments awaiting approval from being imported. See <a href=\"https://github.com/websharks/comment-mail/issues/182\" rel=\"nofollow ugc\">Issue #182</a>.</li>\n<li><strong>Bug Fix</strong> (StCR Import): Fixed a bug in how the Subscribe to Comments Reloaded Import routine counts imported subscriptions. Comment Mail was previously reporting the number of subscriptions that it created during the import as the total number imported, however due to a difference in how Comment Mail and StCR store subscriptions, the total number of StCR subscriptions imported is almost always going to be different from the number of subscriptions that Comment Mail creates. This difference resulted in confusion about why the total StCR subscriptions did not match the total reported by Comment Mail as &#8220;imported&#8221;. This has been fixed by adjusting what is reported as &#8216;total imported&#8217; and including two new pieces of information: &#8216;total skipped&#8217; and &#8216;total created&#8217;. When you add the &#8216;total imported&#8217; and &#8216;total skipped&#8217; numbers together, that number should equal the number of subscriptions reported in StCR. Props @Reedyseth @jaswsinc. See <a href=\"https://github.com/websharks/comment-mail/issues/166\" rel=\"nofollow ugc\">Issue #166</a>.</li>\n<li><strong>Bug Fix</strong>: Removed a UTF-8 &#8220;Branch Icon&#8221; in the default email templates that was not showing up properly in some email clients. Props @renzms @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/116\" rel=\"nofollow ugc\">Issue #116</a>.</li>\n<li><strong>Bug Fix</strong>: Fixed an email template bug that was forcing an ellipsis to show even when the length of the comment content was shorter than the max length. See <a href=\"https://github.com/websharks/comment-mail/commit/80aab562fb1fe3cdcdb4f10eda7e74c8ea21aa61\" rel=\"nofollow ugc\">this commit</a> for details.</li>\n<li><strong>Bug Fix</strong>: Fixed an email template bug that was not linking the &#8220;add reply&#8221; link directly to the comment form for replying to the comment (it was just linking to the comment itself). See <a href=\"https://github.com/websharks/comment-mail/commit/686b2737e708dc4a70ede129b7f4a9151c150907#commitcomment-14925636\" rel=\"nofollow ugc\">this commit</a> for details.</li>\n<li><strong>Bug Fix</strong>: Fixed a bug with &#8220;Restore Default Options&#8221; that was introducing a browser quirk that was preventing the default options from being restored. Props @renzms. See <a href=\"https://github.com/websharks/comment-mail/issues/181\" rel=\"nofollow ugc\">Issue #181</a>.</li>\n<li><strong>Bug Fix</strong>: Fixed a bug where certain icons would not appear, or the wrong icon would appear, when Comment Mail was installed alongside the ZenCache plugin. Both plugins use the same Sharkicons library, but were using different versions, which introduced a conflict. Comment Mail has been updated to use the latest version of the Sharkicons library. Props @Reedyseth. See <a href=\"https://github.com/websharks/comment-mail/issues/87#issuecomment-166458711\" rel=\"nofollow ugc\">Issue #87</a>.</li>\n<li><strong>Bug Fix</strong>: Fixed a UI bug where some of the Dashboard notices generated by Comment Mail were either misaligned or were clashing with the Subscribe to Comments Reloaded options menu. Props @renzms. See <a href=\"https://github.com/websharks/comment-mail/issues/186\" rel=\"nofollow ugc\">Issue #186</a>.</li>\n<li><strong>Enhancement (Pro)</strong>: Added a &#8220;Pro&#8221; label to the plugin name to clearly indicate when the Pro version of Comment Mail is installed. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/131\" rel=\"nofollow ugc\">Issue #131</a>.</li>\n<li><strong>Enhancement (Pro)</strong>: Added a note to the default email templates when RVE (Replies via Email) is enabled, warning email readers that &#8220;Your reply will be posted publicly and immediately.&#8221; Props @Reedyseth. See <a href=\"https://github.com/websharks/comment-mail/issues/123\" rel=\"nofollow ugc\">Issue #123</a>.</li>\n<li><strong>Enhancement (Pro):</strong> If you have Comment Mail&#8217;s SSO integration enabled and have users who are registering an account via Facebook, Twitter, LinkedIn, or Google+, the SSO service that a particular user (or commenter) signed up with is now shown in the list of Users. Props @kristineds See <a href=\"https://github.com/websharks/comment-mail/issues/73\" rel=\"nofollow ugc\">Issue #73</a>.</li>\n<li><strong>Enhancement (Pro):</strong> Theme Syntax Highlighting: This release makes it possible for the color-scheme used in template file syntax highlighting to be changed to any one of 30+ options. See: <em>Dashboard <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Comment Mail <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Config. Options <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Template-Related Settings</em>. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/147\" rel=\"nofollow ugc\">Issue #147</a>.</li>\n<li><strong>Enhancement</strong> (StCR Import): Moved the Import Status box (for importing Subscribe to Comments Reloaded subscriptions) up underneath the &#8220;Begin StCR Auto-Importation&#8221; button to improve visibility when importing subscriptions. See <a href=\"https://github.com/websharks/comment-mail/issues/172\" rel=\"nofollow ugc\">Issue #172</a>.</li>\n<li><strong>Enhancement</strong> (StCR Import): The &#8220;Upgrading from Subscribe to Comments Reloaded&#8221; notice, which appears when installing Comment Mail on a site running the StCR plugin, is now automatically hidden once you run the StCR import process. See <a href=\"https://github.com/websharks/comment-mail/issues/169\" rel=\"nofollow ugc\">Issue #169</a>.</li>\n<li><strong>Enhancement</strong> (StCR Import): During the import process, Comment Mail now keeps track of and reports total number of StCR subscriptions skipped and total number of Comment Mail subscriptions created. Skipped subscriptions are the number of StCR subscriptions that were not imported for one of several possible reasons. See <a href=\"https://github.com/websharks/comment-mail/issues/166\" rel=\"nofollow ugc\">Issue #166</a>.</li>\n<li><strong>Enhancement</strong> (StCR Import): The StCR importer now generates a log file in <code>comment-mail-pro/stcr-import-failures.log</code> that includes reports of any failures or skipped subscriptions, along with information about why they failed or why they were skipped. Note that this file is only created if there were failures or skipped subscriptions during import. See <a href=\"https://github.com/websharks/comment-mail/issues/166\" rel=\"nofollow ugc\">Issue #166</a>.</li>\n<li><strong>Enhancement</strong>: Removed references to &#8220;CAN-SPAM Act&#8221;, which is a United States law that may not be understood or applicable to Comment Mail users outside of the United States. Props @Li-An and @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/122\" rel=\"nofollow ugc\">Issue #122</a>.</li>\n<li><strong>Enhancement</strong>: Added the default translation file. Translators can now build translations using the default translation file located in <code>includes/translations/</code>. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/118\" rel=\"nofollow ugc\">Issue #118</a>.</li>\n<li><strong>Enhancement</strong>: Improved the on-hover color when hovering the mouse over Option Panels in the Comment Mail Options by changing it from green to dark blue. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/117\" rel=\"nofollow ugc\">Issue #117</a>.</li>\n<li><strong>Enhancement</strong>: Improved the Subscriptions table and the Event Log UI by using proper case for Status and Event values. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/72\" rel=\"nofollow ugc\">Issue #72</a>.</li>\n<li><strong>Enhancement</strong>: Comment Mail is now only enabled for the standard <code>post</code> Post Type by default and there&#8217;s a new &#8220;Enable for Post Types&#8221; option inside <em>Comment Mail <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Config. Options <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Enable/Disable</em> that allows you to specify a comma-delimited list of Post Types that Comment Mail should be enabled for. It&#8217;s also possible to enable Comment Mail on all Post Types that support comments by leaving the field empty (this was the previous behavior). Props to @bonest. See <a href=\"https://github.com/websharks/comment-mail/issues/149\" rel=\"nofollow ugc\">Issue #149</a>.</li>\n<li><strong>Enhancement</strong>: Improved Dashboard notices. The &#8220;Upgrading from Subscribe to Comments Reloaded&#8221; message has been improved and a new Dashboard notice lets you know when Comment Mail is disabled. Props @kristineds. See <a href=\"https://github.com/websharks/comment-mail/issues/163\" rel=\"nofollow ugc\">Issue #163</a>.</li>\n<li><strong>Enhancement</strong>: Many improvements the default email templates. The templates are now fully responsive and look much better on mobile devices. The wording in several places was also cleaned up for clarity and consistency and any references to an ID# (which is generally useless for readers) have been removed. The default templates also use a single font style now instead of mixing font styles and the email templates no longer use tables (this improves responsiveness). If you&#8217;ve modified the default Comment Mail email templates on your site, your changes will not be overwritten by updating, however if you&#8217;ve modified the templates and you want to get these changes, you&#8217;ll need to reset to the default email templates and make your changes again (you can do this by emptying the email template fields completely and saving your options). See <a href=\"https://github.com/websharks/comment-mail/issues/77\" rel=\"nofollow ugc\">Issue #77</a>.</li>\n<li><strong>Enhancement</strong>: Ellipses (<code>...</code>) in email templates are now surrounded by square brackets (i.e., <code>[...]</code>) to avoid confusion about whether or not the ellipsis was part of the comment content. See <a href=\"https://github.com/websharks/comment-mail/issues/77\" rel=\"nofollow ugc\">Issue #77</a>.</li>\n<li><strong>Enhancement</strong>: In the email templates, the &#8220;Add Reply&#8221; links have been changed to &#8220;Reply&#8221; and when the reply is in response to someone and we have the authors name, the link includes the authors name (e.g., &#8220;Reply to &#8220;). See <a href=\"https://github.com/websharks/comment-mail/issues/77\" rel=\"nofollow ugc\">Issue #77</a>.</li>\n<li><strong>Enhancement</strong>: Updated email templates to use <code>\\WP_Comment</code> instead of <code>\\stdClass</code> where appropriate. See <a href=\"https://github.com/websharks/comment-mail/issues/77\" rel=\"nofollow ugc\">Issue #77</a>.</li>\n<li><strong>Enhancement</strong>: The manual &#8220;Add New Subscription&#8221; functionality has been hidden from the front-end of the site (i.e., hidden from the &#8220;My Comment Subscriptions&#8221; page that subscribers use to manage their subscriptions, and from email templates). Note that this change has no effect on the subscription options that appear on the comment form itself. See discussion in <a href=\"https://github.com/websharks/comment-mail/issues/108#issuecomment-161462209\" rel=\"nofollow ugc\">Issue #108</a>.</li>\n<li><strong>WordPress v4.4 Compatibility:</strong> Fixed a compatibility bug with WordPress v4.4. Props @jaswsinc. See <a href=\"https://github.com/websharks/comment-mail/issues/170\" rel=\"nofollow ugc\">Issue #170</a>.</li>\n<li><strong>Jetpack Compatibility:</strong> This release fixes a bug in the automatic Jetpack conflict detection; i.e., if you enable Jetpack Subscriptions w/ Follow Comments enabled together with Comment Mail at the same, a warning is displayed to notify you of a possible conflict in your configuration. See <a href=\"https://github.com/websharks/comment-mail/issues/113\" rel=\"nofollow ugc\">Issue #113</a>.</li>\n</ul>\n<h4>v150709</h4>\n<ul>\n<li>Initial release.</li>\n</ul>\n"
    },
    "short_description": "License: GPLv3 or later License URI: http://www.gnu.org/licenses/gpl-3.0.html Author: WP Sharks Author URI: http://comment-mail.",
    "description": "<p>Comment Mail is a powerhouse plugin that allows commenters to sign up for email notifications whenever they leave a comment on your site. Or, they can also subscribe without commenting—the choice is theirs.</p>\n<h4>Core Plugin Features</h4>\n<p>See also: <a href=\"http://comment-mail.com/features/\" rel=\"nofollow ugc\">http://comment-mail.com/features/</a></p>\n<ul>\n<li>\n<p><strong>Comment Subscriptions</strong><br />\nNotify comment authors whenever a new comment is added to a specific post (of any kind) in WordPress. Comment authors can be notified about &#8220;all&#8221; new comments, or only about replies to their own comment (most popular). This functionality is missing from WordPress, but Comment Mail fills this role beautifully with its primary focus being on comment-related email notifications. Powerful!</p>\n</li>\n<li>\n<p><strong>Nifty Post Meta Box in WordPress</strong><br />\nWhen you create or edit a WordPress post, Comment Mail is right there with you! This is a feature that you never knew you wanted, but <em>cannot</em> live without once you try it on for size. Every WordPress post becomes a new mailing list of sorts, with every comment being a potential subscriber. With each new comment, others in the thread may be updated too, which brings your site to life with a vibrant discussion.</p>\n<p>The Post Meta Box widget provided by Comment Mail gives you a quick look at the activity on any given WordPress Post. It includes counters that link over to a more detailed look at your list of subscribers. This is easy to configure, and you can choose to exclude this for certain types of WordPress posts if you want to. e.g., portfolios or snippets you might want to exclude as they generally do not receive comments.</p>\n</li>\n<li>\n<p><strong>Comment Form Subscription Options</strong><br />\nUsing the Comment Mail dashboard panel you can customize all of the options that are presented whenever someone leaves a comment on your WordPress posts. For example; the template file itself, JavaScript, CSS, the default option selected by commenters (e.g., do not subscribe, replies only, or subscribe to everything), and much more.</p>\n<p>Comment Mail integrates with just about any WordPress theme you select. Your theme only needs to support the standard WordPress hook for comment form additions. For most theme developers that&#8217;s a no-brainer, and it&#8217;s easy to add yourself if you happen to be an exception to the rule; i.e., in cases where your theme perhaps does not have support for the default WordPress hook yet. We provide instructions.</p>\n</li>\n<li>\n<p><strong>Subscribe Without Commenting</strong><br />\nOrdinarily, Comment Mail subscriptions are associated with commenters; i.e., people that have something to say, and they want to be notified via email whenever a reply to their comment is posted. However, not everyone has something they want to post right away. So, perhaps they&#8217;ll enjoy monitoring the conversation via email. Comment Mail makes it easy for these spectators to subscribe. They can simply choose to subscribe without leaving a comment 🙂</p>\n</li>\n<li>\n<p><strong>Asynchronous Email Delivery</strong><br />\nDo you have thousands of comments? No problem! Comment Mail is built to handle large sites with a <em>lot</em> of users. Or, with a <em>lot</em> of comments, perhaps even on a single WordPress post. Comment Mail enqueues every notification that is to be delivered. Comment Mail uses its own dedicated asynchronous mail queue, which is processed quietly and efficiently behind-the-scenes. This eliminates any delay in processing of the comment and enqueuing process itself, so that Comment Mail will have nothing but a positive impact on your community overall.</p>\n</li>\n<li>\n<p><strong>Custom Email Message Headers</strong><br />\nYou can adjust the <code>Return-Path:</code>, the <code>From:</code> name and email address, the <code>Reply-To:</code> email address, and even test all of your current email configuration options right inside the WordPress Dashboard using the Comment Mail interface—it&#8217;s built right into WordPress with a seamless integration.</p>\n</li>\n<li>\n<p><strong>CAN-SPAM Compliant</strong><br />\nAll emails sent by Comment Mail are CAN-SPAM compliant. Comment Mail makes it easy for you to customize the postal address that is associated with your organization, and you can attach a privacy policy URL also. These are both requirements for your site to remain CAN-SPAM compliant; i.e., these components help you avoid problems with email being delivered to the spam/bulk folder in popular email clients.</p>\n</li>\n<li>\n<p><strong>Auto-Subscribe</strong><br />\nWith Comment Mail you can automatically subscribe the author of a WordPress post (of any kind) whenever it is published. This is optional, but highly recommended. You can also add a list of additional email addresses that should be subscribed automatically, choose the default email delivery option for Auto-Subscribe recipients, and even narrow this down to a specific list of Post Types in WordPress where Auto-Subscribe functionality should be applied; or where it should not be.</p>\n</li>\n<li>\n<p><strong>Auto-Confirm</strong><br />\nBy default, each subscriber is asked to confirm their subscription via email. However, Comment Mail can be configured to auto-confirm subscribers who have subscribed to other posts on your blog already. Nice!</p>\n<p>Or, if you like, it is also possible to force an auto-confirm for every subscriber; i.e., bypass the email confirmation message entirely. This is helpful for sites that restrict access already in some way, or in cases where a comment is associated with an already-authenticated user.</p>\n</li>\n<li>\n<p><strong>Front-End Subscription Management</strong><br />\nComment Mail exposes a powerful UI on the front-end of your site, which allows each comment author to review a list of their current subscriptions on your site, add new subscriptions on their own, or unsubscribe from one (or all) of their subscriptions easily.</p>\n</li>\n<li>\n<p><strong>Back-End Subscription Management</strong><br />\nFrom your WordPress Dashboard you can list all subscribers by post, by email address, by comment, search the list with custom criteria, and even filter and sort the results. The Comment Mail dashboard also makes it easy to perform bulk actions. For instance, to delete many subscribers, suspend them, reconfirm them, or just to review a list of those who signed up but never actually followed through on the confirmation process.</p>\n<p>In addition to a list of subscriptions, Comment Mail also maintains an event log, which exposes a lot of useful information that happens along the way. If you&#8217;re ever confused about why a particular user is subscribed (or not), the event log comes in handy. Not just for you, but if you ever need to explain something to a user this is handy.</p>\n</li>\n<li>\n<p><strong>Customizable Templates</strong><br />\nThe lite version of Comment Mail includes a basic set of templates that you can customize to match the theme of your site. Customize them all! Or, perhaps you simply want to tweak Comment Mail in ways that perfect the design in a particular WordPress theme of your choosing. That&#8217;s fine too!</p>\n<p>Comment Mail templates are all right in your Dashboard, ready to edit, with instructions to help you out. You can edit templates used for the on-site display of certain components, and you can also edit the email-related templates that are associated with comment notifications sent to subscribers; e.g., the email confirmation request, or the list of comment updates that subscribers receive when a new reply is posted by a user.</p>\n</li>\n<li>\n<p><strong>StCR (Subscribe to Comments Reloaded) Compat.</strong><br />\nComment Mail is a highly evolved plugin that is based on the original StCR (Subscribe to Comments Reloaded) plugin for WordPress. StCR gained enormous popularity in the WordPress community over a span of several years. This new improved version of StCR (now referred to as Comment Mail™) is backward compatible with most features provided by StCR.</p>\n<p>If you were previously running StCR, you can upgrade to Comment Mail right away. Many of your existing StCR options are automatically interpreted by Comment Mail whenever you activate it from the WordPress Dashboard. This saves you time and makes the transition much easier.</p>\n<p>In addition, if you were previously running StCR, you will be prompted by Comment Mail upon activation. Comment Mail will ask you to begin an import of all of your existing StCR subscribers so that you won&#8217;t lose any of those important people that establish your fan base.</p>\n</li>\n<li>\n<p><strong>Data Safeguards</strong><br />\nBy default, if you delete Comment Mail using the plugins menu in WordPress, no data is lost; i.e., Comment Mail will safeguard your configuration and all subscribers. However, if you want to completely uninstall Comment Mail you can turn Safeguards off, and <em>then</em> deactivate &amp; delete Comment Mail from the plugins menu in WordPress. This way Comment Mail will erase your options for the plugin, erase database tables created by the plugin, remove subscriptions, terminate CRON jobs, etc. In short, when Safeguards are off, Comment Mail erases itself from existence completely when you delete it.</p>\n</li>\n</ul>\n<h4>Enhanced / Pro-Only Features</h4>\n<p>See also: <a href=\"http://comment-mail.com/features/\" rel=\"nofollow ugc\">http://comment-mail.com/features/</a></p>\n<p><em><strong>TIP:</strong> you can preview Pro features in the free version by clicking the &#8220;Preview Pro Features&#8221; link at the top of your Comment Options options panel.</em></p>\n<ul>\n<li>\n<p><strong>SMTP Server Integration</strong><br />\nComment Mail Pro makes it possible for you to configure a dedicated SMTP server that is specifically for comment-related emails. For instance, many pro users use this feature to integrate Comment Mail with services like Mandrill or Amazon SES. This can dramatically improve your email delivery rate when it comes to email notifications that subscribers receive.</p>\n<p>Of course, it also has the side benefit of reducing load on your own server by moving email delivery to a more capable service that is specifically designed for such a thing.</p>\n</li>\n<li>\n<p><strong>RVE (Replies Via Email)</strong><br />\nComment Mail Pro makes it very easy for subscribers to reply to a notification they receive via email—<em>with</em> an email! In short, instead of a subscriber (i.e., someone that receives an update via email) being forced to return to your site, they can simply reply via email. Their response magically ends up on your site in the proper comment thread—just as if they <em>had</em> taken the time to return to your site.</p>\n<p>The best part about this feature is that it requires no special server requirements, and very little configuration. This is because Comment Mail Pro has been integrated with both Mandrill and SparkPost for RVE service. So all you need to do is follow the simple instructions to setup a Mandrill or SparkPost account. Then supply Comment Mail with the email address that you configure there.</p>\n</li>\n<li>\n<p><strong>SSO (Single Sign-On) Integration</strong><br />\nThis powerful functionality in Comment Mail Pro attracts <em>many</em> more comments (thus, subscribers). With SSO enabled a commenter can be identified by simply logging into your site with Facebook, Twitter, Google+, or LinkedIn.</p>\n<p>These popular social networks were integrated with Comment Mail Pro, because many visitors actually <em>prefer</em> to be identified using their social profile instead of being forced to register again and again on every site they want to leave a comment on.</p>\n<p>This feature also has the side benefit of turning commenters into registered users; i.e., users are first identified (quickly) by their Facebook, Twitter, Google+, or LinkedIn account, but then Comment Mail <em>also</em> quietly creates an account for them on your site too. This way you acquire a new user in the process; i.e., you collect a new subscriber and also a new registered user.</p>\n</li>\n<li>\n<p><strong>Impressive Statistics/Charts</strong><br />\nComment Mail Pro adds a new menu option which links to a set of advanced reporting tools that can be used to generate statistical charts/graphs. Yay! ~ You can review and compare total subscribers, most popular posts, least popular posts, confirmation percentages, suspension percentages, subscriptions by post ID, by country, by region, and more. This information is critical when you need to  better understand your subscribers, and it&#8217;s a unique component of your site that only Comment Mail can accurately report on.</p>\n</li>\n<li>\n<p><strong>Email Blacklisting</strong><br />\nComment Mail Pro makes it possible for a site owner to configure a list of patterns that will be used to blacklist certain email addresses. For instance, it is a good idea to blacklist role-based email addresses like <code>admin@*</code>, <code>webmaster@*</code>, <code>postmaster@*</code>, etc. With Comment Mail Pro you gain complete control over the blacklist that is applied internally.</p>\n</li>\n<li>\n<p><strong>Geo IP Region/Country Tracking</strong><br />\nComment Mail Pro can post user IP addresses to a remote geoPlugin API behind-the-scenes, asking for geographic data associated with each subscription. Comment Mail will store this information locally in your WP database so that the data can be exported easily, and even used in statistical reporting by Comment Mail itself.</p>\n</li>\n<li>\n<p><strong>Advanced PHP-Based Templates</strong><br />\nComment Mail Pro comes with two different template options. The default template set is a very basic shortcode-like syntax that is easy for novice site owners to work with. However, developers might prefer to switch to the advanced template mode, where they gain complete and total control over all of Comment Mail&#8217;s PHP-based templates.</p>\n<p>In either case (simple or advanced) all of Comment Mail&#8217;s template files are easily modified using the Comment Mail dashboard; i.e., from within WordPress, where instructions are provided, along with dynamic replacement codes and documented variables that are used in each template file.</p>\n</li>\n<li>\n<p><strong>Misc. UI-Related Settings</strong><br />\nIn Comment Mail Pro, you can tune-in 7-10 different UI-related options that impact users on both the front and back end of Comment Mail in different ways. For instance, you can alter the number of subscriptions that appear on each page in a summary that subscribers see when they view a list of their subscriptions. You can also adjust the way WordPress post/comment dropdown menus are presented when people choose to subscribe without commenting.</p>\n</li>\n<li>\n<p><strong>Import and/or Mass Update</strong><br />\nWith Comment Mail Pro you can import and/or mass update subscribers from the WordPress dashboard. Comment Mail&#8217;s importer will accept direct CSV input in a textarea, or you can choose to upload a prepared CSV file. This allows you to bring existing subscribers (from any platform) into a WordPress blog and keep users up-to-date with comments that occur on your site.</p>\n</li>\n<li>\n<p><strong>Subscriber Export</strong><br />\nComment Mail Pro makes it easy to export some (or all) of your subscribers into one (or more) downloadable CSV files. This feature ensures that your subscribers remain portable; should you decide to change platforms or move subscribers to another site in the future.</p>\n</li>\n<li>\n<p><strong>Import/Export Config. Options</strong><br />\nThis feature is a <em>huge</em> time-saver if you run more than one site where Comment Mail is being used. You can import your options from another WordPress installation where you&#8217;ve already configured Comment Mail before; i.e., you can easily duplicate an established configuration and save time setting up the new site.</p>\n</li>\n<li>\n<p><strong>Subscription Cleaner Tuning</strong><br />\nComment Mail automatically deletes unconfirmed and trashed subscriptions after X number of hours/minutes/days. It runs automatically via WP-Cron, and the subscription cleaner can be configured in a number of ways. Comment Mail Pro makes it possible for you to tune-in this feature (i.e., customize your configuration)—or even disable it entirely if prefer.</p>\n</li>\n<li>\n<p><strong>Log Cleaner Adjustments</strong><br />\nComment Mail automatically deletes very old event log entries after X number of hours/minutes/days. It runs automatically via WP-Cron, and the log cleaner can be configured in a number of ways. Comment Mail Pro makes it possible for you to tune-in this feature (i.e., customize your configuration)—or even disable it entirely if prefer.</p>\n</li>\n<li>\n<p><strong>Queue Processor Adjustments</strong><br />\nPerformance tuning Comment Mail can be important on very large sites. With Comment Mail Pro you&#8217;ll have full control over the asynchronous email notification processing queue. For instance, you can control how often Comment Mail&#8217;s queue processor runs, how long it will run each time, the max number of emails it will process in each run, and more.</p>\n</li>\n<li>\n<p><strong>MailChimp Integration</strong><br />\nIntegrate with MailChimp to give users the option of subscribing to your site-wide mailing list whenever they leave a comment or post a new reply. In addition to subscribing to comment reply notifications they can also choose to join your MailChimp mailing list.</p>\n</li>\n</ul>\n<h3>Enhanced / Pro-Only Features</h3>\n<p>See also: <a href=\"http://comment-mail.com/features/\" rel=\"nofollow ugc\">http://comment-mail.com/features/</a></p>\n<p><em><strong>TIP:</strong> you can preview Pro features in the free version by clicking the &#8220;Preview Pro Features&#8221; link at the top of your Comment Options options panel.</em></p>\n<ul>\n<li>\n<p><strong>SMTP Server Integration</strong><br />\nComment Mail Pro makes it possible for you to configure a dedicated SMTP server that is specifically for comment-related emails. For instance, many pro users use this feature to integrate Comment Mail with services like Mandrill or Amazon SES. This can dramatically improve your email delivery rate when it comes to email notifications that subscribers receive.</p>\n<p>Of course, it also has the side benefit of reducing load on your own server by moving email delivery to a more capable service that is specifically designed for such a thing.</p>\n</li>\n<li>\n<p><strong>RVE (Replies Via Email)</strong><br />\nComment Mail Pro makes it very easy for subscribers to reply to a notification they receive via email—<em>with</em> an email! In short, instead of a subscriber (i.e., someone that receives an update via email) being forced to return to your site, they can simply reply via email. Their response magically ends up on your site in the proper comment thread—just as if they <em>had</em> taken the time to return to your site.</p>\n<p>The best part about this feature is that it requires no special server requirements, and very little configuration. This is because Comment Mail Pro has been integrated with both Mandrill and SparkPost for RVE service. So all you need to do is follow the simple instructions to setup a Mandrill or SparkPost account. Then supply Comment Mail with the email address that you configure there.</p>\n</li>\n<li>\n<p><strong>SSO (Single Sign-On) Integration</strong><br />\nThis powerful functionality in Comment Mail Pro attracts <em>many</em> more comments (thus, subscribers). With SSO enabled a commenter can be identified by simply logging into your site with Facebook, Twitter, Google+, or LinkedIn.</p>\n<p>These popular social networks were integrated with Comment Mail Pro, because many visitors actually <em>prefer</em> to be identified using their social profile instead of being forced to register again and again on every site they want to leave a comment on.</p>\n<p>This feature also has the side benefit of turning commenters into registered users; i.e., users are first identified (quickly) by their Facebook, Twitter, Google+, or LinkedIn account, but then Comment Mail <em>also</em> quietly creates an account for them on your site too. This way you acquire a new user in the process; i.e., you collect a new subscriber and also a new registered user.</p>\n</li>\n<li>\n<p><strong>Impressive Statistics/Charts</strong><br />\nComment Mail Pro adds a new menu option which links to a set of advanced reporting tools that can be used to generate statistical charts/graphs. Yay! ~ You can review and compare total subscribers, most popular posts, least popular posts, confirmation percentages, suspension percentages, subscriptions by post ID, by country, by region, and more. This information is critical when you need to  better understand your subscribers, and it&#8217;s a unique component of your site that only Comment Mail can accurately report on.</p>\n</li>\n<li>\n<p><strong>Email Blacklisting</strong><br />\nComment Mail Pro makes it possible for a site owner to configure a list of patterns that will be used to blacklist certain email addresses. For instance, it is a good idea to blacklist role-based email addresses like <code>admin@*</code>, <code>webmaster@*</code>, <code>postmaster@*</code>, etc. With Comment Mail Pro you gain complete control over the blacklist that is applied internally.</p>\n</li>\n<li>\n<p><strong>Geo IP Region/Country Tracking</strong><br />\nComment Mail Pro can post user IP addresses to a remote geoPlugin API behind-the-scenes, asking for geographic data associated with each subscription. Comment Mail will store this information locally in your WP database so that the data can be exported easily, and even used in statistical reporting by Comment Mail itself.</p>\n</li>\n<li>\n<p><strong>Advanced PHP-Based Templates</strong><br />\nComment Mail Pro comes with two different template options. The default template set is a very basic shortcode-like syntax that is easy for novice site owners to work with. However, developers might prefer to switch to the advanced template mode, where they gain complete and total control over all of Comment Mail&#8217;s PHP-based templates.</p>\n<p>In either case (simple or advanced) all of Comment Mail&#8217;s template files are easily modified using the Comment Mail dashboard; i.e., from within WordPress, where instructions are provided, along with dynamic replacement codes and documented variables that are used in each template file.</p>\n</li>\n<li>\n<p><strong>Misc. UI-Related Settings</strong><br />\nIn Comment Mail Pro, you can tune-in 7-10 different UI-related options that impact users on both the front and back end of Comment Mail in different ways. For instance, you can alter the number of subscriptions that appear on each page in a summary that subscribers see when they view a list of their subscriptions. You can also adjust the way WordPress post/comment dropdown menus are presented when people choose to subscribe without commenting.</p>\n</li>\n<li>\n<p><strong>Import and/or Mass Update</strong><br />\nWith Comment Mail Pro you can import and/or mass update subscribers from the WordPress dashboard. Comment Mail&#8217;s importer will accept direct CSV input in a textarea, or you can choose to upload a prepared CSV file. This allows you to bring existing subscribers (from any platform) into a WordPress blog and keep users up-to-date with comments that occur on your site.</p>\n</li>\n<li>\n<p><strong>Subscriber Export</strong><br />\nComment Mail Pro makes it easy to export some (or all) of your subscribers into one (or more) downloadable CSV files. This feature ensures that your subscribers remain portable; should you decide to change platforms or move subscribers to another site in the future.</p>\n</li>\n<li>\n<p><strong>Import/Export Config. Options</strong><br />\nThis feature is a <em>huge</em> time-saver if you run more than one site where Comment Mail is being used. You can import your options from another WordPress installation where you&#8217;ve already configured Comment Mail before; i.e., you can easily duplicate an established configuration and save time setting up the new site.</p>\n</li>\n<li>\n<p><strong>Subscription Cleaner Tuning</strong><br />\nComment Mail automatically deletes unconfirmed and trashed subscriptions after X number of hours/minutes/days. It runs automatically via WP-Cron, and the subscription cleaner can be configured in a number of ways. Comment Mail Pro makes it possible for you to tune-in this feature (i.e., customize your configuration)—or even disable it entirely if prefer.</p>\n</li>\n<li>\n<p><strong>Log Cleaner Adjustments</strong><br />\nComment Mail automatically deletes very old event log entries after X number of hours/minutes/days. It runs automatically via WP-Cron, and the log cleaner can be configured in a number of ways. Comment Mail Pro makes it possible for you to tune-in this feature (i.e., customize your configuration)—or even disable it entirely if prefer.</p>\n</li>\n<li>\n<p><strong>Queue Processor Adjustments</strong><br />\nPerformance tuning Comment Mail can be important on very large sites. With Comment Mail Pro you&#8217;ll have full control over the asynchronous email notification processing queue. For instance, you can control how often Comment Mail&#8217;s queue processor runs, how long it will run each time, the max number of emails it will process in each run, and more.</p>\n</li>\n<li>\n<p><strong>MailChimp Integration</strong><br />\nIntegrate with MailChimp to give users the option of subscribing to your site-wide mailing list whenever they leave a comment or post a new reply. In addition to subscribing to comment reply notifications they can also choose to join your MailChimp mailing list.</p>\n</li>\n</ul>\n<h3>Software Requirements</h3>\n<p>In addition to the <a href=\"https://wordpress.org/about/requirements/\" rel=\"ugc\">WordPress Requirements</a>, Comment Mail™ requires the following minimum versions:</p>\n<ul>\n<li>PHP 5.4+</li>\n<li>Apache 2.1+</li>\n</ul>\n<h3>License</h3>\n<p>Copyright: © 2013 <a href=\"http://www.websharks-inc.com/bizdev/\" rel=\"nofollow ugc\">WebSharks, Inc.</a> (coded in the USA)</p>\n<p>Released under the terms of the <a href=\"http://www.gnu.org/licenses/gpl-2.0.html\" rel=\"nofollow ugc\">GNU General Public License</a>.</p>\n<h4>Credits / Additional Acknowledgments</h4>\n<ul>\n<li>Software designed for WordPress®.\n<ul>\n<li>GPL License <a href=\"https://codex.wordpress.org/GPL\" rel=\"nofollow ugc\">https://codex.wordpress.org/GPL</a></li>\n<li>WordPress® <a href=\"http://wordpress.org\" rel=\"ugc\">http://wordpress.org</a></li>\n</ul>\n</li>\n<li>Some JavaScript extensions require jQuery.\n<ul>\n<li>GPL-Compatible License <a href=\"http://jquery.org/license\" rel=\"nofollow ugc\">http://jquery.org/license</a></li>\n<li>jQuery <a href=\"http://jquery.com/\" rel=\"nofollow ugc\">http://jquery.com/</a></li>\n</ul>\n</li>\n<li>CSS framework and some JavaScript functionality provided by Bootstrap.\n<ul>\n<li>GPL-Compatible License <a href=\"http://getbootstrap.com/getting-started/#license-faqs\" rel=\"nofollow ugc\">http://getbootstrap.com/getting-started/#license-faqs</a></li>\n<li>Bootstrap <a href=\"http://getbootstrap.com/\" rel=\"nofollow ugc\">http://getbootstrap.com/</a></li>\n</ul>\n</li>\n<li>Icons provided by Font Awesome.\n<ul>\n<li>GPL-Compatible License <a href=\"http://fortawesome.github.io/Font-Awesome/license/\" rel=\"nofollow ugc\">http://fortawesome.github.io/Font-Awesome/license/</a></li>\n<li>Font Awesome <a href=\"http://fortawesome.github.io/Font-Awesome/\" rel=\"nofollow ugc\">http://fortawesome.github.io/Font-Awesome/</a></li>\n</ul>\n</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/comment-mail.161213.zip",
    "upgrade_notice": {
        "v150709": "<p>Requires PHP v5.4+.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/comment-mail/assets/screenshot-1.png?rev=1196725",
            "caption": "Screenshot #1"
        },
        {
            "src": "https://ps.w.org/comment-mail/assets/screenshot-2.png?rev=1196725",
            "caption": "Screenshot #2"
        },
        {
            "src": "https://ps.w.org/comment-mail/assets/screenshot-3.png?rev=1196725",
            "caption": "Screenshot #3"
        },
        {
            "src": "https://ps.w.org/comment-mail/assets/screenshot-4.png?rev=1196725",
            "caption": "Screenshot #4"
        },
        {
            "src": "https://ps.w.org/comment-mail/assets/screenshot-5.png?rev=1196725",
            "caption": "Screenshot #5"
        }
    ],
    "tags": [],
    "stable_tag": "161213",
    "versions": {
        "150709": "https://downloads.wordpress.org/plugin/comment-mail.150709.zip",
        "151224": "https://downloads.wordpress.org/plugin/comment-mail.151224.zip",
        "160213": "https://downloads.wordpress.org/plugin/comment-mail.160213.zip",
        "160618": "https://downloads.wordpress.org/plugin/comment-mail.160618.zip",
        "160818": "https://downloads.wordpress.org/plugin/comment-mail.160818.zip",
        "160824": "https://downloads.wordpress.org/plugin/comment-mail.160824.zip",
        "161118": "https://downloads.wordpress.org/plugin/comment-mail.161118.zip",
        "161129": "https://downloads.wordpress.org/plugin/comment-mail.161129.zip",
        "161213": "https://downloads.wordpress.org/plugin/comment-mail.161213.zip",
        "trunk": "https://downloads.wordpress.org/plugin/comment-mail.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/comment-mail/assets/banner-772x250.png?rev=1477442",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/comment-mail/assets/icon-128x128.png?rev=1210411",
        "2x": "https://ps.w.org/comment-mail/assets/icon-256x256.png?rev=1210411"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 88,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}