{
    "name": "CP Image Store with Slideshow",
    "slug": "cp-image-store",
    "version": "1.1.5",
    "author": "<a href=\"http://wordpress.dwbooster.com/content-tools/image-store\">CodePeople</a>",
    "author_profile": "https://profiles.wordpress.org/codepeople/",
    "contributors": {
        "codepeople": {
            "profile": "https://profiles.wordpress.org/codepeople/",
            "avatar": "https://secure.gravatar.com/avatar/c0662edcefb5a4e2ab12803856ba2358?s=96&d=monsterid&r=g",
            "display_name": "codepeople"
        }
    },
    "requires": "3.5.0",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 60,
    "ratings": {
        "5": 2,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 4,
    "support_url": "https://wordpress.org/support/plugin/cp-image-store/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 30,
    "downloaded": 35118,
    "last_updated": "2024-07-04 3:33pm GMT",
    "added": "2013-07-12",
    "homepage": "http://wordpress.dwbooster.com/content-tools/image-store#download",
    "sections": {
        "description": "<p>CP Image Store with Slideshow features:</p>\n<p>§ Allows selling image files via PayPal. Payments are SCA ready (Strong Customer Authentication), compatible with the new Payment services (PSD 2) &#8211; Directive (EU)<br />\n§ Allows selling various resolution versions of the image at tiered prices<br />\n§ Multiple online store settings:display a search box, filter by author,<br />\n  color scheme, image type and categories. Set the number of columns in the<br />\n  image store. Pagination, and sorting of results by title, popularity and<br />\n  publication date<br />\n§ Associate various features to pictures: author, type of image,<br />\n  color scheme, and categories<br />\n§ Allows select an alternative layout of the store design<br />\n§ Allows to insert a particular image in posts or pages, and as widget<br />\n  on website&#8217;s sidebars<br />\n§ Allows sharing image pages in social networks (ex: Facebook, Twitter, Google+)<br />\n§ Shows a carousel with the top 10 images obtained with the filter values<br />\n§ Includes a module to track sales statistics.<br />\n  Displays animated charts for specific sales reports<br />\n§ Allows exporting the sales reports to a CSV file<br />\n§ Includes an experimental module to import the products and their data.</p>\n<p>CP Image Store with Slideshow is an online store for the sale of image files: images, predefined pictures, clipart, drawings, vector images. For payment processing, CP Image Store with Slideshow uses PayPal, which is the most widely used payment gateway, safe and easy to use.</p>\n<p>The &#8220;Image Store&#8221; plugin allows the specific integration with the following editors:</p>\n<ul>\n<li>Classic WordPress Editor.</li>\n<li>Gutenberg Editor.</li>\n<li>Elementor.</li>\n<li>Page Builder by SiteOrigin.</li>\n<li>For other editors, the shortcodes should be inserted using other controls of general purpose, like the controls for inserting HTML or shortcodes.</li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Irf8jxVcUKQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Inserting and using the basic &#8220;Image Store width Slideshow&#8221; plugin.</p>\n<p>The premium version of CP Image Store with Slideshow allows to create a preview of your images with a watermark, to protect against malicious users or unauthorized downloads.</p>\n<p>The base plugin, available for free from the WordPress Plugin Directory has all the features you need to create an CP Image Store with Slideshow on your website.</p>\n<p><strong>Premium Features</strong></p>\n<ul>\n<li>Includes a shopping cart to buy multiple products in a single purchase</li>\n<li>Allows to insert list of products filtered by top selling or newest products</li>\n<li>Allows including a watermark on image previews</li>\n<li>Allows to set discounts to promote sales</li>\n<li>Allows to set discount coupons to promote sales from specific sources</li>\n<li>Allows to group all purchased items in one compacted download</li>\n</ul>\n<p><strong>Demo of Premium Version of Plugin</strong></p>\n<p><a href=\"https://demos.dwbooster.com/image-store/wp-login.php\" title=\"Click to access the administration area demo\" rel=\"nofollow ugc\">https://demos.dwbooster.com/image-store/wp-login.php</a></p>\n<p><a href=\"https://demos.dwbooster.com/image-store/\" title=\"Click to access the Image Store\" rel=\"nofollow ugc\">https://demos.dwbooster.com/image-store/</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/92PMxQPeVFM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Inserting and using the premium version of &#8220;Image Store width Slideshow&#8221; plugin.</p>\n<p>If you want more information about this plugin or another one don&#8217;t doubt to visit my website:<br />\n<a href=\"http://wordpress.dwbooster.com\" title=\"CodePeople WordPress Repository\" rel=\"nofollow ugc\">http://wordpress.dwbooster.com</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/HfFGGsCBNp8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Inserting a products list, and products, in pages or sidebars of website (only available in the premium version of plugin).</p>\n<p><strong>Are safe the downloads links?</strong></p>\n<p>The security in the access to products files is determined in different ways.</p>\n<ul>\n<li>The products files can&#8217;t be accessed directly. The purchased files are stored in a special directory called downloads, the downloads directory includes a .htaccess file that forbid the access from browser. The files can be accessed only through a server side script that validates the purchase.</li>\n<li>The Store determines the validity of  download links based in three options, available in the settings page of plugin.<br />\nIt is possible define a time period, in days, where a download link is considered valid. If a user tries to download a purchased product, the Store checks the date of purchasing.<br />\nIt is possible define a limit of downloads by purchase. If a user tries to download a product, the Image Store checks how many downloads have been made.<br />\nThe  Store may be configured to request the email address used in the purchasing to check the validity of download link.</li>\n</ul>\n<h3>Interface</h3>\n<p><strong>Setting up the CP Image Store with Slideshow</strong></p>\n<p>CP Image Store with Slideshow is configured through the menu: &#8220;Image Store / Store Settings&#8221;. The setup window allows configuring the Image Store&#8217;s General data, PayPal data for sales processing and data used for notifications of sales. In the Premium version of the plugin you can also set discounts and coupons.</p>\n<p><strong>Settings Interface</strong></p>\n<p>The setup interface includes the following fields:</p>\n<p><strong>Store Page Setup</strong></p>\n<p>This section contains the setup options for the CP Image Store with Slideshow.</p>\n<ul>\n<li>URL of Store page: Enter the URL of the web page where the CP Image Store with Slideshow was inserted. The URL of the store will be used to enable return from the product page to the store page.</li>\n<li>Store layout: Allows select the layout to use in the stores page.</li>\n<li>Display a search box: Inserts a search box in the web page of the CP Image Store with Slideshow to search images by texts</li>\n<li>Allow filtering by type: Inserts a field in the web page of the CP Image Store with Slideshow to filter images by type (possible types of images: Clip Art, Photo, Draws, Vectors, etc.)</li>\n<li>Allow filtering by color: Inserts a field in the web page of the CP Image Store with Slideshow to filter the products by their color scheme (color schemes possible: Full color, Black and White, Sepia, etc.).</li>\n<li>Allow filtering by authors: Inserts a field in the web page of the CP Image Store with Slideshow to filter products by their author.</li>\n<li>Allow filtering by category: Inserts a field in the web page of the CP Image Store with Slideshow to filter products by their category.</li>\n<li>Allow pagination: Allows pagination in the CP Image Store with Slideshow.</li>\n<li>Items for page: Defines the number of products per page in the CP Image Store with Slideshow.</li>\n<li>Share in social networks: Display a group of buttons for sharing the products in the social networks(like Facebook, Twitter and Google+)</li>\n<li>Facebook app id for sharing in Facebook: App id for sharing the website&#8217;s links in Facebook.</li>\n</ul>\n<p><strong>Images Setup</strong></p>\n<p>This section includes setup options for each of the images.</p>\n<ul>\n<li>Units: Unit of measure for the images to be displayed in the CP Image Store with Slideshow and on the page of the image.</li>\n<li>Set watermark: Mark this checkbox if you want to display a watermark on image previews.</li>\n<li>Watermark text: Enter the text for the watermark.</li>\n<li>Watermark position: Allows display the watermark at bottom or middle of the images previews.</li>\n<li>Thumbnail width: Width of the thumbnail in pixels.</li>\n<li>Thumbnail height: Height of the thumbnail in pixels.</li>\n<li>Intermediate width: Width of the image preview in pixels.</li>\n<li>Intermediate height: Height of the image preview in pixels.</li>\n<li>Image License title: Enter a title for the license of the images sold through the CP Image Store with Slideshow. The title of the license is used as a link to display the license.</li>\n<li>Image License description: Enter the text of the license.</li>\n</ul>\n<p><strong>Images Effects</strong></p>\n<ul>\n<li>Show caroussel of related images: Shows a carousel with the top 10 images given the filter values in the CP Image Store with Slideshow, and displays the carousel on the image page with the top 10 images that belong to the same category.</li>\n<li>Set caroussel autorun: Starts moving carousel dynamically by default.</li>\n<li>Carousel transition time: Number of seconds before the rotation of each image in the carousel.</li>\n<li>Display preview on mouse over: Shows the image information, buy buttons,  and the image preview when the mouse is hovered over the thumbnail.</li>\n</ul>\n<p><strong>PayPal Payments Setup</strong></p>\n<p>This section defines the options for the payment gateway.</p>\n<ul>\n<li>Enable PayPal Payments: Allows the sale of products through PayPal.</li>\n<li>PayPal Sandbox Enable: Enables Paypal’s Sandbox to test the payment system before publishing the CP Image Store with Slideshow.</li>\n<li>PayPal email: Enter the email address associated with your PayPal account.</li>\n<li>Currency: The currency in which payments are accepted and the prices shown in the CP Image Store with Slideshow.</li>\n<li>Currency Symbol: Symbol of the currency in which payments are accepted and prices shown in the CP Image Store with Slideshow.</li>\n<li>PayPal Language: Language in which PayPal will be loaded.</li>\n<li>Use shopping cart: Activate the shopping cart to allow purchase of several products at once.</li>\n<li>Download link valid for: Enter the number of days during which the generated download link will be valid;  past this number of days the download link will expire.</li>\n<li>Number of downloads allowed by purchase: Enter the number of downloads allowed by purchased product.</li>\n<li>Use safe downloads: Requires that the customer type the email address used to purchase the products before download them.</li>\n<li>Pack all Purchased image files as a single ZIP file: You can group all products purchased in one compacted file.</li>\n</ul>\n<p><strong>Discount Settings (Available only in the Premium version)</strong></p>\n<p>This section allows to set up discounts in your CP Image Store with Slideshow.</p>\n<ul>\n<li>Display discount promotions in the image store page: Allows to display the text of the promotion on the store page.</li>\n<li>Scheduled Discounts: List of defined discounts. Here you can edit or delete existing discounts.</li>\n<li>Percent of discount: Percentage of the price that will be discounted.</li>\n<li>Valid for sales over than: The discount will apply to sales where the total amount exceeds the number entered in this field.</li>\n<li>Valid from: Starting date of the promotion.</li>\n<li>Valid to: End date of the promotion.</li>\n<li>Promotional text: Promotional text that will be shown on the store page.</li>\n</ul>\n<p><strong>Coupons Settings (Available only in the Premium version)</strong></p>\n<p>This section allows to set up a discount coupon system for your CP Image Store with Slideshow.</p>\n<ul>\n<li>Coupons List: List of coupons that you already created. Here you can edit or delete existing coupons.</li>\n<li>Percent of discount: Percentage of the price that will be discounted.</li>\n<li>Coupon: Enter the discount code here.</li>\n<li>Valid from: Starting date of the promotion.</li>\n<li>Valid to: End date of the promotion.</li>\n</ul>\n<p><strong>Notification Settings</strong></p>\n<p>This section contains data necessary for notifications: for buyers when a payment is completed, and to the store manager to inform you of a new sale.</p>\n<ul>\n<li>Notification &#8220;from&#8221; email: E-mail address to be shown as the Sender of notifications.</li>\n<li>Send notification to email: Email address where a notification is sent after each sale.</li>\n<li>Subject of user confirmation message: Subject of the confirmation message sent to the customer after each purchase.</li>\n<li>Email confirmation to user: Contents of the email message sent to the customer after a purchase is made. The content must include % INFORMATION% text that will be replaced by the purchase data.</li>\n<li>Subject of notification message to admin: Subject of the notification email sent to the administrator when a purchase is made.</li>\n<li>Email notification to admin: Contents of the message sent to the administrator when a purchase is made. Email content must maintain % INFORMATION% text that will be replaced by the purchase data.</li>\n</ul>\n<p><strong>Importing Area</strong></p>\n<p>This module is experimental and allows to import all products and their data at the same time.</p>\n<p>Simply upload to your server a directory with all images and a XML file to define the products, with their data and attributes. The directory should be accessible and it can be deleted after completing the importing process. After upload the directory with the data, enter in the field above, the absolute URL to the XML file, and press the &#8220;Import&#8221; button.</p>\n<p>The structure of the XML file is:</p>\n<p>&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;<br />\n&lt;products&gt;<br />\n    &lt;product&gt;<br />\n        &lt;title&gt;Title of the first product&lt;/title&gt;<br />\n        &lt;description&gt;Description of the first product&lt;/description&gt;<br />\n        &lt;author&gt;Name of the first product author&lt;/author&gt;<br />\n        &lt;type&gt;Type of product (Clip art, Line drawing, etc.)&lt;/type&gt;<br />\n        &lt;color&gt;Scheme color (Full color, Black and white, etc.)&lt;/color&gt;<br />\n        &lt;thumbnail&gt;first_thumbnail.jpg&lt;/thumbnail&gt;<br />\n        &lt;image width=&quot;number&quot; height=&quot;number&quot; price=&quot;number&quot;&gt;first_image_for_selling.jpg&lt;/image&gt;<br />\n        &lt;image width=&quot;number&quot; height=&quot;number&quot; price=&quot;number&quot;&gt;second_image_for_selling.jpg&lt;/image&gt;<br />\n        &lt;image width=&quot;number&quot; height=&quot;number&quot; price=&quot;number&quot;&gt;third_image_for_selling.jpg&lt;/image&gt;<br />\n    &lt;/product&gt;<br />\n    &lt;product&gt;<br />\n        &lt;title&gt;Title of the second product&lt;/title&gt;<br />\n        &lt;description&gt;Description of the second product&lt;/description&gt;<br />\n        &lt;author&gt;Name of the second product author&lt;/author&gt;<br />\n        &lt;type&gt;Type of product (Clip art, Line drawing, etc.)&lt;/type&gt;<br />\n        &lt;color&gt;Scheme color (Full color, Black and white, etc.)&lt;/color&gt;<br />\n        &lt;thumbnail&gt;second_thumbnail.jpg&lt;/thumbnail&gt;<br />\n        &lt;image width=&quot;number&quot; height=&quot;number&quot; price=&quot;number&quot;&gt;first_image_for_selling.jpg&lt;/image&gt;<br />\n        &lt;image width=&quot;number&quot; height=&quot;number&quot; price=&quot;number&quot;&gt;second_image_for_selling.jpg&lt;/image&gt;<br />\n        &lt;image width=&quot;number&quot; height=&quot;number&quot; price=&quot;number&quot;&gt;third_image_for_selling.jpg&lt;/image&gt;<br />\n    &lt;/product&gt;<br />\n&lt;/products&gt;</p>\n<ul>\n<li>Each &lt;product&gt;&lt;/product&gt; node represents a product in the store.</li>\n<li>The URLs to the thumbnails and images must be relative to the XML file.</li>\n<li>The nodes: author, type, and color will generate new terms associated to the products.</li>\n<li>There are multiple image nodes associated to a same product, because it is possible to sell different formats of an image from a same product, the width, height and price are the attributes of the images displayed in the public website, and its corresponding price.</li>\n</ul>\n<p><strong>Creating content</strong></p>\n<p><strong>Inserting a new image in the store</strong></p>\n<p>To insert an image in the store,  press the menu option &#8220;Image Store / Images for Sale&#8221; which will show a list of previously entered images and associated data.</p>\n<p>To enter a new image, press the &#8220;Add New&#8221; button.</p>\n<p>The interface for entering data of an image is as follows:</p>\n<ul>\n<li>Enter Title Here: Enter the title of the image.</li>\n<li>Description: Enter the description of the picture. This field is optional, but many users take advantage of it when they want to give additional information about the image.</li>\n<li>Authors: Select the author or authors of the image. You can also add new authors.</li>\n<li>Type of Image: Select the type or types of image. You can also add a new image type.</li>\n<li>Scheme color: Select the color scheme of the image. You can also add a new color scheme.</li>\n<li>Images categories: Select a category or categories to which the image belongs or enter new categories. Categories can have a hierarchy.</li>\n<li>Select image for preview: Select the image to be edited to create its thumbnail and a preview image. If your version of the CP Image Store with Slideshow allows the use of watermark, it will be applied to the image.</li>\n<li>Image files: list of files associated with the image. If you wish to sell more than one version of the same image, add a new file for each of these images. This option allows the sale of the same image  in different resolutions at different prices.</li>\n</ul>\n<p>For each image file you can enter its width, height and price.</p>\n<p><strong>Publishing the CP Image Store with Slideshow</strong></p>\n<p>The CP Image Store with Slideshow can be posted on a page or post in WordPress. To insert the CP Image Store with Slideshow, go to the appropriate section (page or post) and create a new page / post.</p>\n<p>The image store adds two new icons on the post / page content editor. The first of the icons serves to insert the CP Image Store with Slideshow, the second &#8211; to insert a particular image.</p>\n<p>The button for the insertion of the CP Image Store with Slideshow creates a shortcode in the content of the post / page in the form:</p>\n<pre><code>[codepeople-image-store]\n</code></pre>\n<p>The shortcode accepts a group of  &hellip;</p>\n",
        "installation": "<p><strong>To install CP Image Store with Slideshow, follow these steps:</strong></p>\n<ol>\n<li>Download and unzip the plugin</li>\n<li>Upload the entire &#8220;cp-image-store/&#8221; directory to the &#8220;/wp-content/plugins/&#8221; directory</li>\n<li>Activate the plugin through the &#8220;Plugins&#8221; menu in WordPress</li>\n<li>Set up your store via &#8220;Image Store/ Store Settings&#8221;</li>\n</ol>\n",
        "faq": "\n<dt id='q%3A%20why%20the%20sales%20button%20doesn%27t%20display%3F'>\nQ: Why the sales button doesn&#8217;t display?\n</h4>\n<p>\n<p>A: First, go to the settings page of CP Image Store with Slideshow and be sure the PayPal checkbox is checked, and has defined the seller&#8217;s email. Second, be sure the image has files associated.</p>\n</p>\n<dt id='q%3A%20why%20the%20watermark%20doesn%27t%20show%20on%20images%3F'>\nQ: Why the watermark doesn&#8217;t show on images?\n</h4>\n<p>\n<p>A: Be sure the GD Library is enabled in the PHP script on web server.</p>\n</p>\n<dt id='q%3A%20how%20to%20insert%20a%20product%20or%20products%20list%20on%20sidebar%3F'>\nQ: How to insert a product or products list on sidebar?\n</h4>\n<p>\n<p>A: Go to the widgets section and insert the &#8220;Image Store Product&#8221;, or the &#8220;Image Store Product List&#8221; on sidebar.</p>\n</p>\n<dt id='q%3A%20how%20can%20i%20to%20know%20the%20id%20of%20image%3F'>\nQ: How can I to know the ID of image?\n</h4>\n<p>\n<p>A: Go to the image page in WordPress and pay attention to the URL, the parameter &#8220;post&#8221; contains the image&#8217;s ID.</p>\n<p>The image&#8217;s ID is required to insert the image on sidebars or pages.</p>\n</p>\n<dt id='q%3A%20how%20can%20i%20search%20an%20image%20by%20the%20image%27s%20content%20or%20title%3F'>\nQ: How can I search an image by the image&#8217;s content or title?\n</h4>\n<p>\n<p>A: Type the word you are searching in the search box (available in the store&#8217;s page), and press the &#8220;enter&#8221; key.</p>\n</p>\n<dt id='q%3A%20is%20possible%20to%20hide%20the%20image%20preview%20window%3F'>\nQ: Is possible to hide the image preview window?\n</h4>\n<p>\n<p>A: To hide the image preview window, go to the settings of Image Store, and uncheck the option &#8220;Display preview on mouse over&#8221;.</p>\n</p>\n<dt id='q%3A%20is%20there%20another%20payment%20gateway%20other%20than%20paypal%3F'>\nQ: Is there another payment gateway other than PayPal?\n</h4>\n<p>\n<p>A: The current version of plugin allows only PayPal as payment gateway.</p>\n</p>\n<dt id='q%3A%20why%20after%20press%20the%20%22buy%20now%22%20button%20the%20page%20is%20not%20redirected%20to%20paypal%3F'>\nQ: Why after press the &#8220;Buy Now&#8221; button the page is not redirected to PayPal?\n</h4>\n<p>\n<p>A: Please, go to the settings page of Image Store, and be sure that email associated to the PayPal account was entered. If the email associated to the PayPal account was typed, go to the product&#8217;s page, and be sure that image&#8217;s price is non zero.</p>\n</p>\n<dt id='q%3A%20why%20i%20can%27t%20get%20the%20purchased%20images%20as%20a%20zip%20file%3F'>\nQ: Why I can&#8217;t get the purchased images as a zip file?\n</h4>\n<p>\n<p>A: To use this feature be sure the libraries to create ZIP files are available in the PHP script installed in your web server. Furthermore, if the customers bought multiple files at same time, and the sum of size of all files purchased is bigger than memory assigned to the PHP, then is not possible to create the zip file.</p>\n</p>\n<dt id='q%3A%20how%20can%20be%20selected%20the%20images%20to%20display%20in%20the%20store%20by%20default%3F'>\nQ: How can be selected the images to display in the store by default?\n</h4>\n<p>\n<p>A: The images store is inserted in a page through the shortcode: <code>[codepeople-image-store]</code>, but it is possible define some parameters in the shortcode for filtering the images that will be displayed by default in the store:</p>\n<p>type: allows display in the store the images with the &#8220;type&#8221; defined as attribute of the shortcode. The &#8220;type&#8221; attribute accepts the slug of the type or its ID.</p>\n<pre><code>        [codepeople-image-store type=\"clip-art\"]\n</code></pre>\n<p>author: allows display in the store the images crated by the &#8220;author&#8221; defined as attribute of the shortcode. The &#8220;author&#8221; attribute accepts the slug of the author or its ID.</p>\n<pre><code>        [codepeople-image-store author=\"author-name\"]\n</code></pre>\n<p>color: allows display in the store the images with the colour schema defined by the &#8220;color&#8221; attribute. The &#8220;color&#8221; attribute accepts the slug of the color or its ID.</p>\n<pre><code>        [codepeople-image-store author=\"full-color\"]\n</code></pre>\n<p>category: allows display in the store the images belonging to the category defined as attribute of the shortcode. The &#8220;category&#8221; attribute accepts the slug of the category or its ID.</p>\n<pre><code>        [codepeople-image-store category=\"category-name\"]\n</code></pre>\n</p>\n\n",
        "changelog": "<h4>1.0</h4>\n<ul>\n<li>First version released.</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Improves the plugin documentation.</li>\n<li>Corrects an issue with language files.</li>\n<li>Displays the carousel with any number of images.</li>\n<li>Corrects a compatibility issue with the &#8220;Search in place&#8221; plugin.</li>\n<li>Includes a search box in the store&#8217;s page.</li>\n<li>Corrects an issue in the creation of thumbnails from images in PNG format.</li>\n<li>Increases the security in the store.</li>\n<li>Includes the use of charts in the sales reports.</li>\n<li>Includes the product ID in the list of images for selling.</li>\n<li>Corrects the store&#8217;s design in themes with responsive designs.</li>\n<li>Allows limit the number of downloads by download link.</li>\n<li>Allows reset the number of downloads, and the download interval.</li>\n<li>Changes the location of the upload files.</li>\n<li>Includes alternative layouts.</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Allows to distribute images for free. The images without a price defined, or if the PayPal option is disabled in the store&#8217;s settings, appear download links beside the images,</li>\n<li>Uses functions included since WordPress 3.5.0, that modifies the requirements.</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Modifies the interface of the store&#8217;s settings.</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>Modifies the carousel with the top ten images, to correct an issue in Safari browser.</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Includes a new button in the sales reports, for exporting all of them to a CSV file.</li>\n<li>Allows apply to the products, the permalinks structure used in by WordPress.</li>\n<li>Modifies the styles applied to the store.</li>\n<li>Corrects the selection of home page&#8217;s URL in a WordPress multisite.</li>\n</ul>\n<h4>1.0.6</h4>\n<ul>\n<li>Security update for the download process of purchased files(vulnerability was found by Joaquin Ramirez Martinez)</li>\n</ul>\n<h4>1.0.7</h4>\n<ul>\n<li>Security update to prevent the use of brute force to identify the purchase IDs (thanks to Joaquin Ramirez Martinez to detect this vulnerability)</li>\n</ul>\n<h4>1.0.8</h4>\n<ul>\n<li>Corrects a conflict in the action of deleting images.</li>\n</ul>\n<h4>1.0.9</h4>\n<ul>\n<li>Allows activate/deactivate the use of friendly URLs for the store&#8217;s products.</li>\n</ul>\n<h4>1.0.10</h4>\n<ul>\n<li>Uses the classes constructor of PHP5 in the widgets.</li>\n</ul>\n<h4>1.0.11</h4>\n<ul>\n<li>Modifies the taxonomies to prevent a conflict with complex structures for permalinks.</li>\n</ul>\n<h4>1.0.12</h4>\n<ul>\n<li>Takes into account the taxes in the IPN script.</li>\n</ul>\n<h4>1.0.13</h4>\n<ul>\n<li>Modifies the download process to improve the performance and save the server&#8217;s resources.</li>\n</ul>\n<h4>1.0.14</h4>\n<ul>\n<li>Escape the tags attributes and the queries parameters to prevent vulnerabilities.</li>\n</ul>\n<h4>1.0.15</h4>\n<ul>\n<li>Modifies some texts and corrects a simple issue.</li>\n</ul>\n<h4>1.0.16</h4>\n<ul>\n<li>Changes the order that resources are loaded to prevent conflicts with themes that are not prepared for WP4.5</li>\n</ul>\n<h4>1.0.17</h4>\n<ul>\n<li>Corrects an issue for filtering the images by the slug of the category.</li>\n</ul>\n<h4>1.0.18</h4>\n<ul>\n<li>Includes the Importing module.</li>\n<li>Adds to the products&#8217; pages tags like: og:image, og:title, og:description, and og:url.</li>\n<li>Corrects an issue with the friendly URLs.</li>\n</ul>\n<h4>1.0.19</h4>\n<ul>\n<li>Includes try/catch blocks to prevent fatal errors with emails bad configured.</li>\n</ul>\n<h4>1.0.20</h4>\n<ul>\n<li>Allows to enter the Facebook App id for sharing the website&#8217;s links in Facebook.</li>\n</ul>\n<h4>1.0.21</h4>\n<ul>\n<li>Fixes a warning message accessing to QUERY_STRING in the store&#8217;s pages, in stores with multiple pages.</li>\n</ul>\n<h4>1.0.22</h4>\n<ul>\n<li>Modifies the IPN script to satisfy the new PayPal requirements.</li>\n</ul>\n<h4>1.0.23</h4>\n<ul>\n<li>Allows the integration with Affiliate Royale.</li>\n<li>Improves the accesses to the plugin&#8217;s documentation.</li>\n</ul>\n<h4>1.0.24</h4>\n<ul>\n<li>Fixes an issue loading the CSS and JS files in websites protected with SSL.</li>\n</ul>\n<h4>1.0.25</h4>\n<ul>\n<li>Applies the same charset used by the database to the plugin&#8217;s tables.</li>\n</ul>\n<h4>1.0.26</h4>\n<ul>\n<li>Includes a new filter for the &#8220;get_the_excerpt&#8221; hook.</li>\n</ul>\n<h4>1.0.27</h4>\n<ul>\n<li>Includes the integration with Gutenberg the editor that will be distributed with the next versions of WordPress.</li>\n</ul>\n<h4>1.0.28</h4>\n<ul>\n<li>Allows the access to reports, the importing section, and the store&#8217;s settings only to the websites administrators.</li>\n</ul>\n<h4>1.0.29</h4>\n<ul>\n<li>Fixes an issue with the loopback requests when are being edited the code of plugins or themes in the WordPress editor.</li>\n</ul>\n<h4>1.0.30</h4>\n<ul>\n<li>Removes the invalid characters from the products&#8217; names before redirect the buyer to the payment gateway.</li>\n</ul>\n<h4>1.0.31</h4>\n<ul>\n<li>Modifies the way the client&#8217;s side scripts are executed to prevent the uncaught javascript errors on page affect the Store.</li>\n</ul>\n<h4>1.0.32</h4>\n<ul>\n<li>Removes and optimize some queries to increase the plugin&#8217;s performance.</li>\n</ul>\n<h4>1.0.33</h4>\n<ul>\n<li>Improves the store configuration.</li>\n<li>Modifies the deactivation process to allow the users find easier the solution to the usual issues.</li>\n</ul>\n<h4>1.0.34</h4>\n<ul>\n<li>Fixes an issue with indices in the database tables.</li>\n<li>Improves the database queries.</li>\n</ul>\n<h4>1.0.35</h4>\n<ul>\n<li>Modifies the integration with the Gutenberg editor (the next editor in WordPress) to use the new objects and methods.</li>\n<li>Hides the promotion banner for the majority of roles and fixes a conflict between the promotion banner and the Gutenberg editor.</li>\n</ul>\n<h4>1.0.36</h4>\n<ul>\n<li>Fixes a conflict with the latest update of the Gutenberg editor.</li>\n<li>Fixes a conflict with the &#8220;Speed Booster Pack&#8221; plugin.</li>\n</ul>\n<h4>1.0.37</h4>\n<ul>\n<li>Fixes an issue between the Promote Banner and the official distribution of WP5.0</li>\n</ul>\n<h4>1.0.38</h4>\n<ul>\n<li>Modifies the language file and the plugin header.</li>\n</ul>\n<h4>1.0.39</h4>\n<ul>\n<li>Improves the integration with the Gutenberg editor displaying a preview of the store and products.</li>\n<li>The plugin is compatible with WordPress 5.1</li>\n</ul>\n<h4>1.0.40</h4>\n<ul>\n<li>Includes some changes in the download process of purchased products.</li>\n<li>Includes some changes in the notification process.</li>\n<li>Modifies the integration with the Gutenberg editor.</li>\n<li>Implements the integration with the Elementor editor.</li>\n<li>Implements the integration with Page Builder by SiteOrigin.</li>\n</ul>\n<h4>1.0.41</h4>\n<ul>\n<li>Improves the module that protects the store.</li>\n<li>Fixes some notices in the download process of purchased files.</li>\n</ul>\n<h4>1.0.42</h4>\n<ul>\n<li>Improves the identification of the special pages, like the download page, and the shopping cart page in the commercial version of the plugin.</li>\n</ul>\n<h4>1.0.43</h4>\n<ul>\n<li>Allows to define taxes from the store&#8217;s settings.</li>\n</ul>\n<h4>1.0.44</h4>\n<ul>\n<li>Fixes some minor errors.</li>\n</ul>\n<h4>1.0.45</h4>\n<ul>\n<li>Improves the plugin security sanitizing and escaping every value entered from browser.</li>\n</ul>\n<h4>1.0.46</h4>\n<ul>\n<li>Fixes a conflict with third party plugins.</li>\n</ul>\n<h4>1.0.47</h4>\n<ul>\n<li>Includes two new constant that can be included in the notification emails: %DATETIME% that would be replaced by the purchase date/time, and &#8220;%BUYERNAME%&#8221; that would be replaced by the first name and last name of the buyer, if there is an user in the website with payer&#8217;s email.</li>\n</ul>\n<h4>1.0.48</h4>\n<ul>\n<li>Includes a new section in the store&#8217;s settings to make easier the debugging of payments notifications.</li>\n</ul>\n<h4>1.0.49</h4>\n<ul>\n<li>Modifies the access to the demos.</li>\n</ul>\n<h4>1.0.50</h4>\n<ul>\n<li>Includes a new module to prevent the WP Super Cache plugin cached the download page, and other particular pages of the store.</li>\n</ul>\n<h4>1.0.51</h4>\n<ul>\n<li>Improves the access to the currency and language codes from the store settings.</li>\n</ul>\n<h4>1.0.52</h4>\n<ul>\n<li>Adapts the plugin&#8217;s blocks to the latest update of the Gutenberg editor.</li>\n</ul>\n<h4>1.0.53</h4>\n<ul>\n<li>Fixes an issue escaping the ampersand symbols in some URLs.</li>\n</ul>\n<h4>1.0.54</h4>\n<ul>\n<li>Fixes some notices.</li>\n<li>Includes a new option to allow only registered users to download the free images.</li>\n</ul>\n<h4>1.0.55</h4>\n<ul>\n<li>Includes a new option in the store&#8217;s settings to prevent the products pages, download page, cart etc. be cached.</li>\n</ul>\n<h4>1.0.56</h4>\n<h4>1.0.57</h4>\n<ul>\n<li>Modifies the management of the session&#8217;s variables.</li>\n</ul>\n<h4>1.0.58</h4>\n<ul>\n<li>Loads the different images&#8217; alternatives selected by default. This modification reduces the number of steps to purchase the store&#8217;s products, minimizing buyers&#8217; friction.</li>\n</ul>\n<h4>1.0.59</h4>\n<ul>\n<li>Modifies the code that generates the download and cart pages.</li>\n</ul>\n<h4>1.0.60</h4>\n<ul>\n<li>Modifies the scripts blocks to prevent the uncaught errors in other plugins affect to the Store.</li>\n</ul>\n<h4>1.0.61</h4>\n<ul>\n<li>Improves the Gutenberg integration.</li>\n</ul>\n<h4>1.0.62</h4>\n<ul>\n<li>Modifies the Elementor widget.</li>\n</ul>\n<h4>1.0.63</h4>\n<ul>\n<li>Fixes the issue of the invalid characters into the products&#8217; names in the integration with PayPal.</li>\n</ul>\n<h4>1.0.64</h4>\n<ul>\n<li>Fixes a CSS conflict with some WordPress themes.</li>\n</ul>\n<h4>1.0.65</h4>\n<ul>\n<li>Modifies the Elementor widget.</li>\n</ul>\n<h4>1.0.66</h4>\n<ul>\n<li>Improves the buttons&#8217; appearance on small screens.</li>\n</ul>\n<h4>1.0.67</h4>\n<ul>\n<li>Modifies functions deprecated in the latest Elementor update.</li>\n</ul>\n<h4>1.0.68</h4>\n<ul>\n<li>Fixes a SQL Injection vulnerability. Many thanks to Daniel Krohmer (Fraunhofer IESE institute)</li>\n</ul>\n<h4>1.0.69</h4>\n<ul>\n<li>Implements additional validation rules to improves the security.</li>\n</ul>\n<h4>1.0.70</h4>\n<ul>\n<li>Fixes an issue displaying the images lists in the admin section.</li>\n</ul>\n<h4>1.0.71</h4>\n<ul>\n<li>Fixes a minor issue in the integration with the payment gateways.</li>\n</ul>\n<h4>1.0.72</h4>\n<ul>\n<li>Improves the plugin code and security.</li>\n<li>Removes calls to a deprecated function.</li>\n</ul>\n<h4>1.0.73</h4>\n<ul>\n<li>Modifies the integration with Elementor to ensure compatibility with the latest version of Elementor.</li>\n</ul>\n<h4>1.0.74</h4>\n<ul>\n<li>Clear session variables when editing the Music Store page.</li>\n</ul>\n<h4>1.0.75</h4>\n<ul>\n<li>Modifies the banner module.</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Fixes deprecated notices in the latest version of PHP.</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Modifies the URLs to the IPN documentation.</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Implements minor changes in the product interface to improve the entry data.</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Modifies the integration with the paytment gateways.</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Fixes a conflict in the activation process with WP6.5.</li>\n</ul>\n<h4>1.1.5</h4>\n<ul>\n<li>Modifies the &#8216;group by&#8217; processing in the sales reports.</li>\n</ul>\n"
    },
    "short_description": "CP Image Store with Slideshow is an online store for the sale of image files: images, predefined pictures, clipart, drawings, vector images.",
    "description": "<p>CP Image Store with Slideshow features:</p>\n<p>§ Allows selling image files via PayPal. Payments are SCA ready (Strong Customer Authentication), compatible with the new Payment services (PSD 2) &#8211; Directive (EU)<br />\n§ Allows selling various resolution versions of the image at tiered prices<br />\n§ Multiple online store settings:display a search box, filter by author,<br />\n  color scheme, image type and categories. Set the number of columns in the<br />\n  image store. Pagination, and sorting of results by title, popularity and<br />\n  publication date<br />\n§ Associate various features to pictures: author, type of image,<br />\n  color scheme, and categories<br />\n§ Allows select an alternative layout of the store design<br />\n§ Allows to insert a particular image in posts or pages, and as widget<br />\n  on website&#8217;s sidebars<br />\n§ Allows sharing image pages in social networks (ex: Facebook, Twitter, Google+)<br />\n§ Shows a carousel with the top 10 images obtained with the filter values<br />\n§ Includes a module to track sales statistics.<br />\n  Displays animated charts for specific sales reports<br />\n§ Allows exporting the sales reports to a CSV file<br />\n§ Includes an experimental module to import the products and their data.</p>\n<p>CP Image Store with Slideshow is an online store for the sale of image files: images, predefined pictures, clipart, drawings, vector images. For payment processing, CP Image Store with Slideshow uses PayPal, which is the most widely used payment gateway, safe and easy to use.</p>\n<p>The &#8220;Image Store&#8221; plugin allows the specific integration with the following editors:</p>\n<ul>\n<li>Classic WordPress Editor.</li>\n<li>Gutenberg Editor.</li>\n<li>Elementor.</li>\n<li>Page Builder by SiteOrigin.</li>\n<li>For other editors, the shortcodes should be inserted using other controls of general purpose, like the controls for inserting HTML or shortcodes.</li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Irf8jxVcUKQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Inserting and using the basic &#8220;Image Store width Slideshow&#8221; plugin.</p>\n<p>The premium version of CP Image Store with Slideshow allows to create a preview of your images with a watermark, to protect against malicious users or unauthorized downloads.</p>\n<p>The base plugin, available for free from the WordPress Plugin Directory has all the features you need to create an CP Image Store with Slideshow on your website.</p>\n<p><strong>Premium Features</strong></p>\n<ul>\n<li>Includes a shopping cart to buy multiple products in a single purchase</li>\n<li>Allows to insert list of products filtered by top selling or newest products</li>\n<li>Allows including a watermark on image previews</li>\n<li>Allows to set discounts to promote sales</li>\n<li>Allows to set discount coupons to promote sales from specific sources</li>\n<li>Allows to group all purchased items in one compacted download</li>\n</ul>\n<p><strong>Demo of Premium Version of Plugin</strong></p>\n<p><a href=\"https://demos.dwbooster.com/image-store/wp-login.php\" title=\"Click to access the administration area demo\" rel=\"nofollow ugc\">https://demos.dwbooster.com/image-store/wp-login.php</a></p>\n<p><a href=\"https://demos.dwbooster.com/image-store/\" title=\"Click to access the Image Store\" rel=\"nofollow ugc\">https://demos.dwbooster.com/image-store/</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/92PMxQPeVFM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Inserting and using the premium version of &#8220;Image Store width Slideshow&#8221; plugin.</p>\n<p>If you want more information about this plugin or another one don&#8217;t doubt to visit my website:<br />\n<a href=\"http://wordpress.dwbooster.com\" title=\"CodePeople WordPress Repository\" rel=\"nofollow ugc\">http://wordpress.dwbooster.com</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/HfFGGsCBNp8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Inserting a products list, and products, in pages or sidebars of website (only available in the premium version of plugin).</p>\n<p><strong>Are safe the downloads links?</strong></p>\n<p>The security in the access to products files is determined in different ways.</p>\n<ul>\n<li>The products files can&#8217;t be accessed directly. The purchased files are stored in a special directory called downloads, the downloads directory includes a .htaccess file that forbid the access from browser. The files can be accessed only through a server side script that validates the purchase.</li>\n<li>The Store determines the validity of  download links based in three options, available in the settings page of plugin.<br />\nIt is possible define a time period, in days, where a download link is considered valid. If a user tries to download a purchased product, the Store checks the date of purchasing.<br />\nIt is possible define a limit of downloads by purchase. If a user tries to download a product, the Image Store checks how many downloads have been made.<br />\nThe  Store may be configured to request the email address used in the purchasing to check the validity of download link.</li>\n</ul>\n<h3>Interface</h3>\n<p><strong>Setting up the CP Image Store with Slideshow</strong></p>\n<p>CP Image Store with Slideshow is configured through the menu: &#8220;Image Store / Store Settings&#8221;. The setup window allows configuring the Image Store&#8217;s General data, PayPal data for sales processing and data used for notifications of sales. In the Premium version of the plugin you can also set discounts and coupons.</p>\n<p><strong>Settings Interface</strong></p>\n<p>The setup interface includes the following fields:</p>\n<p><strong>Store Page Setup</strong></p>\n<p>This section contains the setup options for the CP Image Store with Slideshow.</p>\n<ul>\n<li>URL of Store page: Enter the URL of the web page where the CP Image Store with Slideshow was inserted. The URL of the store will be used to enable return from the product page to the store page.</li>\n<li>Store layout: Allows select the layout to use in the stores page.</li>\n<li>Display a search box: Inserts a search box in the web page of the CP Image Store with Slideshow to search images by texts</li>\n<li>Allow filtering by type: Inserts a field in the web page of the CP Image Store with Slideshow to filter images by type (possible types of images: Clip Art, Photo, Draws, Vectors, etc.)</li>\n<li>Allow filtering by color: Inserts a field in the web page of the CP Image Store with Slideshow to filter the products by their color scheme (color schemes possible: Full color, Black and White, Sepia, etc.).</li>\n<li>Allow filtering by authors: Inserts a field in the web page of the CP Image Store with Slideshow to filter products by their author.</li>\n<li>Allow filtering by category: Inserts a field in the web page of the CP Image Store with Slideshow to filter products by their category.</li>\n<li>Allow pagination: Allows pagination in the CP Image Store with Slideshow.</li>\n<li>Items for page: Defines the number of products per page in the CP Image Store with Slideshow.</li>\n<li>Share in social networks: Display a group of buttons for sharing the products in the social networks(like Facebook, Twitter and Google+)</li>\n<li>Facebook app id for sharing in Facebook: App id for sharing the website&#8217;s links in Facebook.</li>\n</ul>\n<p><strong>Images Setup</strong></p>\n<p>This section includes setup options for each of the images.</p>\n<ul>\n<li>Units: Unit of measure for the images to be displayed in the CP Image Store with Slideshow and on the page of the image.</li>\n<li>Set watermark: Mark this checkbox if you want to display a watermark on image previews.</li>\n<li>Watermark text: Enter the text for the watermark.</li>\n<li>Watermark position: Allows display the watermark at bottom or middle of the images previews.</li>\n<li>Thumbnail width: Width of the thumbnail in pixels.</li>\n<li>Thumbnail height: Height of the thumbnail in pixels.</li>\n<li>Intermediate width: Width of the image preview in pixels.</li>\n<li>Intermediate height: Height of the image preview in pixels.</li>\n<li>Image License title: Enter a title for the license of the images sold through the CP Image Store with Slideshow. The title of the license is used as a link to display the license.</li>\n<li>Image License description: Enter the text of the license.</li>\n</ul>\n<p><strong>Images Effects</strong></p>\n<ul>\n<li>Show caroussel of related images: Shows a carousel with the top 10 images given the filter values in the CP Image Store with Slideshow, and displays the carousel on the image page with the top 10 images that belong to the same category.</li>\n<li>Set caroussel autorun: Starts moving carousel dynamically by default.</li>\n<li>Carousel transition time: Number of seconds before the rotation of each image in the carousel.</li>\n<li>Display preview on mouse over: Shows the image information, buy buttons,  and the image preview when the mouse is hovered over the thumbnail.</li>\n</ul>\n<p><strong>PayPal Payments Setup</strong></p>\n<p>This section defines the options for the payment gateway.</p>\n<ul>\n<li>Enable PayPal Payments: Allows the sale of products through PayPal.</li>\n<li>PayPal Sandbox Enable: Enables Paypal’s Sandbox to test the payment system before publishing the CP Image Store with Slideshow.</li>\n<li>PayPal email: Enter the email address associated with your PayPal account.</li>\n<li>Currency: The currency in which payments are accepted and the prices shown in the CP Image Store with Slideshow.</li>\n<li>Currency Symbol: Symbol of the currency in which payments are accepted and prices shown in the CP Image Store with Slideshow.</li>\n<li>PayPal Language: Language in which PayPal will be loaded.</li>\n<li>Use shopping cart: Activate the shopping cart to allow purchase of several products at once.</li>\n<li>Download link valid for: Enter the number of days during which the generated download link will be valid;  past this number of days the download link will expire.</li>\n<li>Number of downloads allowed by purchase: Enter the number of downloads allowed by purchased product.</li>\n<li>Use safe downloads: Requires that the customer type the email address used to purchase the products before download them.</li>\n<li>Pack all Purchased image files as a single ZIP file: You can group all products purchased in one compacted file.</li>\n</ul>\n<p><strong>Discount Settings (Available only in the Premium version)</strong></p>\n<p>This section allows to set up discounts in your CP Image Store with Slideshow.</p>\n<ul>\n<li>Display discount promotions in the image store page: Allows to display the text of the promotion on the store page.</li>\n<li>Scheduled Discounts: List of defined discounts. Here you can edit or delete existing discounts.</li>\n<li>Percent of discount: Percentage of the price that will be discounted.</li>\n<li>Valid for sales over than: The discount will apply to sales where the total amount exceeds the number entered in this field.</li>\n<li>Valid from: Starting date of the promotion.</li>\n<li>Valid to: End date of the promotion.</li>\n<li>Promotional text: Promotional text that will be shown on the store page.</li>\n</ul>\n<p><strong>Coupons Settings (Available only in the Premium version)</strong></p>\n<p>This section allows to set up a discount coupon system for your CP Image Store with Slideshow.</p>\n<ul>\n<li>Coupons List: List of coupons that you already created. Here you can edit or delete existing coupons.</li>\n<li>Percent of discount: Percentage of the price that will be discounted.</li>\n<li>Coupon: Enter the discount code here.</li>\n<li>Valid from: Starting date of the promotion.</li>\n<li>Valid to: End date of the promotion.</li>\n</ul>\n<p><strong>Notification Settings</strong></p>\n<p>This section contains data necessary for notifications: for buyers when a payment is completed, and to the store manager to inform you of a new sale.</p>\n<ul>\n<li>Notification &#8220;from&#8221; email: E-mail address to be shown as the Sender of notifications.</li>\n<li>Send notification to email: Email address where a notification is sent after each sale.</li>\n<li>Subject of user confirmation message: Subject of the confirmation message sent to the customer after each purchase.</li>\n<li>Email confirmation to user: Contents of the email message sent to the customer after a purchase is made. The content must include % INFORMATION% text that will be replaced by the purchase data.</li>\n<li>Subject of notification message to admin: Subject of the notification email sent to the administrator when a purchase is made.</li>\n<li>Email notification to admin: Contents of the message sent to the administrator when a purchase is made. Email content must maintain % INFORMATION% text that will be replaced by the purchase data.</li>\n</ul>\n<p><strong>Importing Area</strong></p>\n<p>This module is experimental and allows to import all products and their data at the same time.</p>\n<p>Simply upload to your server a directory with all images and a XML file to define the products, with their data and attributes. The directory should be accessible and it can be deleted after completing the importing process. After upload the directory with the data, enter in the field above, the absolute URL to the XML file, and press the &#8220;Import&#8221; button.</p>\n<p>The structure of the XML file is:</p>\n<p>&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;<br />\n&lt;products&gt;<br />\n    &lt;product&gt;<br />\n        &lt;title&gt;Title of the first product&lt;/title&gt;<br />\n        &lt;description&gt;Description of the first product&lt;/description&gt;<br />\n        &lt;author&gt;Name of the first product author&lt;/author&gt;<br />\n        &lt;type&gt;Type of product (Clip art, Line drawing, etc.)&lt;/type&gt;<br />\n        &lt;color&gt;Scheme color (Full color, Black and white, etc.)&lt;/color&gt;<br />\n        &lt;thumbnail&gt;first_thumbnail.jpg&lt;/thumbnail&gt;<br />\n        &lt;image width=&quot;number&quot; height=&quot;number&quot; price=&quot;number&quot;&gt;first_image_for_selling.jpg&lt;/image&gt;<br />\n        &lt;image width=&quot;number&quot; height=&quot;number&quot; price=&quot;number&quot;&gt;second_image_for_selling.jpg&lt;/image&gt;<br />\n        &lt;image width=&quot;number&quot; height=&quot;number&quot; price=&quot;number&quot;&gt;third_image_for_selling.jpg&lt;/image&gt;<br />\n    &lt;/product&gt;<br />\n    &lt;product&gt;<br />\n        &lt;title&gt;Title of the second product&lt;/title&gt;<br />\n        &lt;description&gt;Description of the second product&lt;/description&gt;<br />\n        &lt;author&gt;Name of the second product author&lt;/author&gt;<br />\n        &lt;type&gt;Type of product (Clip art, Line drawing, etc.)&lt;/type&gt;<br />\n        &lt;color&gt;Scheme color (Full color, Black and white, etc.)&lt;/color&gt;<br />\n        &lt;thumbnail&gt;second_thumbnail.jpg&lt;/thumbnail&gt;<br />\n        &lt;image width=&quot;number&quot; height=&quot;number&quot; price=&quot;number&quot;&gt;first_image_for_selling.jpg&lt;/image&gt;<br />\n        &lt;image width=&quot;number&quot; height=&quot;number&quot; price=&quot;number&quot;&gt;second_image_for_selling.jpg&lt;/image&gt;<br />\n        &lt;image width=&quot;number&quot; height=&quot;number&quot; price=&quot;number&quot;&gt;third_image_for_selling.jpg&lt;/image&gt;<br />\n    &lt;/product&gt;<br />\n&lt;/products&gt;</p>\n<ul>\n<li>Each &lt;product&gt;&lt;/product&gt; node represents a product in the store.</li>\n<li>The URLs to the thumbnails and images must be relative to the XML file.</li>\n<li>The nodes: author, type, and color will generate new terms associated to the products.</li>\n<li>There are multiple image nodes associated to a same product, because it is possible to sell different formats of an image from a same product, the width, height and price are the attributes of the images displayed in the public website, and its corresponding price.</li>\n</ul>\n<p><strong>Creating content</strong></p>\n<p><strong>Inserting a new image in the store</strong></p>\n<p>To insert an image in the store,  press the menu option &#8220;Image Store / Images for Sale&#8221; which will show a list of previously entered images and associated data.</p>\n<p>To enter a new image, press the &#8220;Add New&#8221; button.</p>\n<p>The interface for entering data of an image is as follows:</p>\n<ul>\n<li>Enter Title Here: Enter the title of the image.</li>\n<li>Description: Enter the description of the picture. This field is optional, but many users take advantage of it when they want to give additional information about the image.</li>\n<li>Authors: Select the author or authors of the image. You can also add new authors.</li>\n<li>Type of Image: Select the type or types of image. You can also add a new image type.</li>\n<li>Scheme color: Select the color scheme of the image. You can also add a new color scheme.</li>\n<li>Images categories: Select a category or categories to which the image belongs or enter new categories. Categories can have a hierarchy.</li>\n<li>Select image for preview: Select the image to be edited to create its thumbnail and a preview image. If your version of the CP Image Store with Slideshow allows the use of watermark, it will be applied to the image.</li>\n<li>Image files: list of files associated with the image. If you wish to sell more than one version of the same image, add a new file for each of these images. This option allows the sale of the same image  in different resolutions at different prices.</li>\n</ul>\n<p>For each image file you can enter its width, height and price.</p>\n<p><strong>Publishing the CP Image Store with Slideshow</strong></p>\n<p>The CP Image Store with Slideshow can be posted on a page or post in WordPress. To insert the CP Image Store with Slideshow, go to the appropriate section (page or post) and create a new page / post.</p>\n<p>The image store adds two new icons on the post / page content editor. The first of the icons serves to insert the CP Image Store with Slideshow, the second &#8211; to insert a particular image.</p>\n<p>The button for the insertion of the CP Image Store with Slideshow creates a shortcode in the content of the post / page in the form:</p>\n<pre><code>[codepeople-image-store]\n</code></pre>\n<p>The shortcode accepts a group of  &hellip;</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/cp-image-store.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/cp-image-store/assets/screenshot-01.jpg?rev=2051885",
            "caption": "Image Store"
        },
        {
            "src": "https://ps.w.org/cp-image-store/assets/screenshot-02.jpg?rev=2051885",
            "caption": "Images List"
        },
        {
            "src": "https://ps.w.org/cp-image-store/assets/screenshot-03.jpg?rev=2051885",
            "caption": "Image Edition Interface"
        },
        {
            "src": "https://ps.w.org/cp-image-store/assets/screenshot-04.jpg?rev=2051885",
            "caption": "Insertion Buttons for Image Store and Image Store Product"
        },
        {
            "src": "https://ps.w.org/cp-image-store/assets/screenshot-05.jpg?rev=2051885",
            "caption": "Insertion Product's Dialog"
        },
        {
            "src": "https://ps.w.org/cp-image-store/assets/screenshot-06.jpg?rev=2051885",
            "caption": "Dialog to Insert Images Lists"
        },
        {
            "src": "https://ps.w.org/cp-image-store/assets/screenshot-07.jpg?rev=2051885",
            "caption": "Gutenberg Editor"
        },
        {
            "src": "https://ps.w.org/cp-image-store/assets/screenshot-08.jpg?rev=2051885",
            "caption": "Elementor Editor"
        },
        {
            "src": "https://ps.w.org/cp-image-store/assets/screenshot-09.jpg?rev=2051885",
            "caption": "Page Builder by SiteOrigin"
        },
        {
            "src": "https://ps.w.org/cp-image-store/assets/screenshot-10.jpg?rev=2051885",
            "caption": "Available Widgets to Insert an Image or Image List on Website's Sidebars"
        },
        {
            "src": "https://ps.w.org/cp-image-store/assets/screenshot-11.jpg?rev=2051885",
            "caption": "Sales Reports"
        },
        {
            "src": "https://ps.w.org/cp-image-store/assets/screenshot-12.jpg?rev=2051885",
            "caption": "Filtering Sales Report"
        },
        {
            "src": "https://ps.w.org/cp-image-store/assets/screenshot-13.jpg?rev=2051885",
            "caption": "Alternative layout"
        }
    ],
    "tags": {
        "galleries": "galleries",
        "gallery": "gallery",
        "image-store": "image store",
        "paypal": "paypal",
        "sell-pictures": "sell pictures"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.72": "https://downloads.wordpress.org/plugin/cp-image-store.1.0.72.zip",
        "1.0.73": "https://downloads.wordpress.org/plugin/cp-image-store.1.0.73.zip",
        "1.0.74": "https://downloads.wordpress.org/plugin/cp-image-store.1.0.74.zip",
        "1.0.75": "https://downloads.wordpress.org/plugin/cp-image-store.1.0.75.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/cp-image-store.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/cp-image-store.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/cp-image-store.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/cp-image-store.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/cp-image-store.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/cp-image-store.1.1.5.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://wordpress.dwbooster.com/content-tools/image-store",
    "banners": {
        "low": "https://ps.w.org/cp-image-store/assets/banner-772x250.png?rev=739664",
        "high": "https://ps.w.org/cp-image-store/assets/banner-1544x500.png?rev=1624837"
    },
    "icons": {
        "1x": "https://ps.w.org/cp-image-store/assets/icon-128x128.jpg?rev=1058802",
        "2x": "https://ps.w.org/cp-image-store/assets/icon-256x256.jpg?rev=1058802"
    },
    "blocks": {
        "cpis/images-store": {
            "name": "cpis/images-store",
            "title": "Images Store"
        },
        "cpis/image-store-product": {
            "name": "cpis/image-store-product",
            "title": "Product"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 60,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}