{
    "name": "Custom API for WP",
    "slug": "custom-api-for-wp",
    "version": "4.0.0",
    "author": "<a href=\"https://www.miniorange.com\">miniOrange</a>",
    "author_profile": "https://profiles.wordpress.org/cyberlord92/",
    "contributors": {
        "cyberlord92": {
            "profile": "https://profiles.wordpress.org/cyberlord92/",
            "avatar": "https://secure.gravatar.com/avatar/6ac8b2dd895f4bb4a16ed786997dd9dd?s=96&d=monsterid&r=g",
            "display_name": "miniOrange"
        }
    },
    "requires": "3.0.1",
    "tested": "6.6.1",
    "requires_php": "5.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 96,
    "ratings": {
        "5": 31,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 33,
    "support_url": "https://wordpress.org/support/plugin/custom-api-for-wp/",
    "support_threads": 1,
    "support_threads_resolved": 1,
    "active_installs": 1000,
    "downloaded": 41485,
    "last_updated": "2024-08-01 13:09:00",
    "added": "2020-07-23",
    "homepage": "http://custom-api-for-wp",
    "sections": {
        "description": "<p><a href=\"https://plugins.miniorange.com/custom-api-for-wordpress\" rel=\"nofollow ugc\">Connect to external APIs | Create Custom API in WP</a> plugin formerly known as <strong>Custom API for WP plugin</strong> which helps you to <em>create no code custom REST endpoints/ Custom APIs</em> into WordPress directly with an interactive <strong>Graphical User Interface (GUI)</strong> to fetch any type of data from any WordPress database tables like <strong>users, posts, custom tables or any 3rd-party plugin&#8217;s table</strong>. You can also use HTTP request methods like <strong>GET, POST, PUT, DELETE (Insert, Update, Delete)</strong> data with these created Custom endpoint / Custom REST routes.</p>\n<p>This plugin also helps you <strong>connect to your external APIs</strong> and platforms to <strong>fetch the data and display via shortcode or template</strong> as per your design (custom HTML, CSS and JS), post data on third-party platforms on any WordPress events (user creation, Woocommerce events, form submission, membership purchase etc) via WordPress hooks.</p>\n<p>This plugin has an interactive and simple UI that will allow you to interact with data by creating Custom REST API endpoints. It means you can easily interact with the WordPress database to perform <strong>CRUD operations on data using the custom endpoints created (generated) using <a href=\"https://plugins.miniorange.com/custom-api-for-wordpress\" rel=\"nofollow ugc\">Connect to external APIs | Custom endpoints for WP</a></strong>.</p>\n<p><a href=\"https://plugins.miniorange.com/custom-api-for-wordpress\" rel=\"nofollow ugc\">Connect to external APIs | Custom endpoints for WP</a> takes care of writing the <strong>complex SQL queries</strong> to fetch/update data and provides you with a very simple User Interface to create or generate custom REST endpoints.<br />\nThis plugin also provides the <strong>filter operations in which you can filter the data</strong> you want to show in the API endpoint response.</p>\n<p><a href=\"https://plugins.miniorange.com/custom-api-for-wordpress\" rel=\"nofollow ugc\">Connect to external APIs | Custom endpoints for WP</a> also adds a <strong>layer of security by providing authentication methods</strong>  to these custom-generated API endpoints. The authentication methods which are compatible with the plugin are:</p>\n<h3></h3>\n<ul>\n<li><a href=\"https://developers.miniorange.com/docs/rest-api-authentication/wordpress/api-key-authentication\" rel=\"nofollow ugc\">API Key Authentication</a> </li>\n<li><a href=\"https://developers.miniorange.com/docs/rest-api-authentication/wordpress/jwt-authentication\" rel=\"nofollow ugc\">JWT Authentication</a></li>\n<li><a href=\"https://developers.miniorange.com/docs/rest-api-authentication/wordpress/basic-authentication\" rel=\"nofollow ugc\">Basic Authentication</a> </li>\n<li><a href=\"https://developers.miniorange.com/docs/rest-api-authentication/wordpress/oauth-authentication\" rel=\"nofollow ugc\">OAuth 2.0 Authentication</a></li>\n</ul>\n<p>You will also be able to <strong>control the visibility</strong> and customize the metadata attached to the Custom endpoint response. This plugin also <strong>eliminates the risk of unauthorized access</strong> to these custom endpoints that you created as it only gives access after successful user validation.</p>\n<h3>Third-party/External API Integration into WordPress</h3>\n<ul>\n<li>\n<p>This plugin allows you to <strong>integrate any external or third-party REST API endpoints into WordPress</strong> very easily with the help of our interactive and simple GUI within seconds. With this function of our plugin, you can fetch data to your WordPress (<a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a>) site or you can use it to fetch data and process it according to your needs.</p>\n</li>\n<li>\n<p>These integrations can also be done on third-party plugin events like form submission using Elementor, <a href=\"https://wpforms.com/\" rel=\"nofollow ugc\">Wpforms</a>, <a href=\"https://www.gravityforms.com/\" rel=\"nofollow ugc\">Gravityforms</a> etc. and also payment status or subscription status based on transactions done via payment gateways like that provided by <a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a>, <a href=\"https://wpforms.com/\" rel=\"nofollow ugc\">Wpforms</a>, <a href=\"https://www.gravityforms.com/\" rel=\"nofollow ugc\">Gravityforms</a> or any other services.</p>\n</li>\n<li>\n<p>External API integrations can be done on any event of WordPress like user registration, user membership level change or any other using plugin hooks.</p>\n</li>\n<li>\n<p><a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a> product data can be synced with any external/third-party API provider(Supplier) on a real-time basis with our plugin.</p>\n</li>\n<li>\n<p>This feature also provides the capability to register or login users to third-party platforms by making an API request to the third-party platforms.</p>\n</li>\n<li>\n<p><strong>Data display on front end using shortcode or template tag</strong> fetched from external API endpoints.</p>\n</li>\n<li>\n<p>Any kind of external APIs supporting <strong>JSON</strong>, <strong>XML</strong>, <strong>SOAP</strong>, <strong>GraphQL</strong> can be connected with authentication methods like <strong>OAuth</strong>, <strong>JWT</strong>, <strong>Bearer</strong>, <strong>API Key</strong> or even <strong>custom API authentication</strong>.</p>\n</li>\n</ul>\n<h3>Use Cases</h3>\n<ul>\n<li>Access custom data of the WordPress site into your mobile application or web clients via custom REST API Endpoints.</li>\n<li>Create easy <strong>Custom REST Routes to Create, Read, Update and Delete (CRUD)</strong> WordPress content from client-side JavaScript or external applications.</li>\n<li><strong>Interact with any standard database</strong> schema/ table or your custom-built schema/ table to fetch/ update/ delete data using the custom API endpoints.</li>\n<li><strong>Connect two WordPress sites</strong> or connect your WordPress site with a website built in any framework and Get/Update/Insert/Delete (CRUD) data of one website to another website with the help of Custom API and feasibility of connection with External APIs / Custom Endpoints developed in the external Website.</li>\n<li><strong>Connect with External Rest API Routes to display data on your website</strong> or process the data received from External Endpoint.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/integrate-external-third-party-rest-api-endpoints-into-wordpress\" rel=\"nofollow ugc\">Integrate External/third-party REST API endpoints with third-party plugin&#8217;s payment gateways</a></strong> like that of <a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a>, <a href=\"https://wpforms.com/\" rel=\"nofollow ugc\">Wpforms</a>or any other custom gateway such that the API can be called automatically based on the payment status.</li>\n<li><strong>Integrate External/ third-party REST API endpoints with custom/ third-party plugins&#8217; forms</strong> like that of <a href=\"https://wpforms.com/\" rel=\"nofollow ugc\">Wpforms</a>, Elementor, <a href=\"https://www.gravityforms.com/\" rel=\"nofollow ugc\">Gravityforms</a> etc such that the external APIs can be called on these forms submission or any related events to perform fetch/update/delete operation based on API endpoints.</li>\n<li><strong>Sync third-party/external API provider&#8217;s (Supplier&#8217;s) API Inventory data into <a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a></strong> and display them in the product feed on a real-time basis. <a href=\"https://plugins.miniorange.com/woocommerce-api-product-sync-with-woocommerce-rest-apis\" rel=\"nofollow ugc\">[More detials]</a></li>\n<li><strong>Integrate external APIs into WooCommerce</strong> &#8211; If you have a Woocommerce store and want to update the data like order creation, order status, and user profile update on a third-party platform in real-time, then a solution can be provided using our plugin.</li>\n<li><strong>Data display using shortcode</strong> &#8211; Fetch data from external API with security and display that on WordPress front-end pages using the shortcodes with customized design.</li>\n</ul>\n<h3>Add-Ons</h3>\n<h3>WooCommerce Products sync via External API | Import products in WooCommerce using Supplier APIs</h3>\n<ul>\n<li>If you have a <a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a> store and want to <strong>sync</strong> (add/update/delete) the products from the external inventory warehouse/  store&#8217;s platform via APIs then it can be using the CUSTOM API plugin along with our <strong><a href=\"https://plugins.miniorange.com/woocommerce-api-product-sync-with-woocommerce-rest-apis\" rel=\"nofollow ugc\">Woocommerce products sync from external APIs</a></strong>.</li>\n<li>\n<p><em>Following are the key features</em> &#8211;</p>\n<ol>\n<li><strong>Data can be synced automatically</strong> after a certain specified period. (For example, every 4 hours a day).</li>\n<li>All the product details like SKU, name, description, price, stock status, images, custom attributes and variant productions can be updated along with other custom attributes as well.</li>\n<li><strong>Sync can be done in the background</strong> such that customers using your WP site are not affected.</li>\n<li><strong>Data syncing can also be done by clicking on the sync button manually</strong> in the User Interface.</li>\n<li><strong><a href=\"https://wordpress.org/plugins/woocommerce/\" rel=\"ugc\">WooCommerce</a> product images can also be added</strong> or updated with ease based on external API data.</li>\n<li><strong>No extra work to import and export CSV/ TXT files manually</strong>. API Integration will do the job automatically.</li>\n</ol>\n</li>\n<li>\n<p>This plugin supports complete integrations for the following &#8211;</p>\n<ol>\n<li>Sync <strong>Amrod</strong> catalogue to WooCommerce </li>\n<li>Sync <strong>S&amp;S Activewear</strong> products to WooCommerce</li>\n<li>Sync products and orders from <strong>Shopify</strong> to WooCommerce</li>\n<li>Import products from <strong>Parts Unlimited</strong> to WooCommerce</li>\n<li>Import products from <strong>Parts Canada</strong> to WooCommerce</li>\n<li>Import products from <strong>Barron</strong> to WooCommerce</li>\n</ol>\n</li>\n</ul>\n<h3>Google Merchant Center</h3>\n<ul>\n<li>\n<p>Sync Products between <strong>WordPress and <a href=\"https://www.google.com/retail/solutions/merchant-center/\" rel=\"nofollow ugc\">Google Merchant Center feed</a></strong> (Integrate WordPress/ WooCommerce Store with Google Merchant Center)</p>\n</li>\n<li>\n<p>If you have a WordPress/ WooCommerce store or third-party dropshipping plugins like <a href=\"https://alidropship.com/plugin/\" rel=\"nofollow ugc\">Alidropship</a> and want to sync the products between the WordPress site and <a href=\"https://www.google.com/retail/solutions/merchant-center/\" rel=\"nofollow ugc\">Google Merchant Center feed</a> feed via APIs then it can be achieved using our solution.</p>\n</li>\n<li>\n<p><em>Following are key features</em> &#8211;</p>\n<ol>\n<li><strong>Real-time data sync</strong> between the WordPress and Google Merchant Centre platforms.</li>\n<li><strong>CSV or TXT files import and export are not required</strong>. Everything will be handled automatically via REST APIs.</li>\n<li>Any attribute like Image, pricing, variations, quantity, stock status, and description can be <strong>updated easily</strong>.</li>\n<li>Solution can be made <strong>compatible with WordPress as WooCommerce store, <a href=\"https://alidropship.com/plugin/\" rel=\"nofollow ugc\">Alidropship</a> store</strong> or any third-party plugin which manages the products in WordPress.</li>\n</ol>\n</li>\n</ul>\n<h3>Connect multiple WordPress/Woocommerce sites</h3>\n<ul>\n<li>WooCommerce API Product Sync with Multiple WooCommerce Stores.</li>\n<li>We do provide the solution in which the product data stored in one WooCommerce store can also be synced with other <a href=\"https://wordpress.org/plugins/woocommerce/\" rel=\"ugc\">WooCommerce</a> stores using the REST APIs such that the WC stores will be updated on a real-time basis.</li>\n<li>Sync all the Woocommerce data between multiple stores on updating in any one store in real-time.</li>\n</ul>\n<h3>Zoho Integration with WordPress</h3>\n<ul>\n<li>If you have a WordPress site and want to connect it to your <a href=\"https://www.zoho.com/\" rel=\"nofollow ugc\">Zoho</a> applications like <a href=\"https://www.zoho.com/in/crm/\" rel=\"nofollow ugc\">Zoho CRM</a>, <a href=\"https://www.zoho.com/connect/\" rel=\"nofollow ugc\">Zoho connect</a>, <a href=\"https://www.zoho.com/in/subscriptions/\" rel=\"nofollow ugc\">Zoho Subscription</a>, <a href=\"https://www.zoho.com/in/inventory/\" rel=\"nofollow ugc\">Zoho Inventory</a> etc to perform operations like sync real-time data between these platforms, which involves user profile sync, operate on WordPress or assign membership to the user based on his Zoho subscription etc. With this integration, any Zoho APIs and webhooks can be integrated to perform real-time sync.</li>\n</ul>\n<h3>Sync Advance Custom Fields (ACF) Posts in WordPress using external API data</h3>\n<ul>\n<li>This plugin helps to connect external and third-party APIs to sync the data from external platforms into WordPress Posts and ACF fields.</li>\n</ul>\n<h3>Google Sheet Integration</h3>\n<ul>\n<li>If you have a WordPress/Woocommerce site and want to connect it to Google Sheets, then our plugin can help you achieve that with our Google Sheets integrator. It provides both ways to sync the data. So, if you update or create any row in the google sheet, then that data will be synced in WordPress and similarly, if you perform any operation or event in WordPress, then that data can be synced as per your need in the Google sheet on a real-time basis.</li>\n</ul>\n<h3>WordPress Automate using Webhooks</h3>\n<ul>\n<li>This plugin can be made compatible to automate WordPress events with external API and webhook to synchronize data between WordPress and external applications.<br />\nFor example &#8211; If you have a WordPress/Woocommerce site and want to sync the user data, product data, posts, and membership data with external platforms, inventories and CRM like Zoho, Hubspot etc., then this plugin can be extended with an add-on to achieve this.</li>\n</ul>\n<p>These solutions can be used additionally along with the plugin. To know more details, contact us at <em>apisupport@xecurify.com</em> and let us know your requirements.</p>\n<h3>Free Version Features</h3>\n<ul>\n<li><em><strong>Unlimited Custom REST</strong> APIs (endpoints) can be created for the HTTP GET method.</em></li>\n<li><em>Name Custom Endpoints/Custom REST routes as per our wish and need.</em></li>\n<li><em><strong>Build custom REST routes for all tables</strong> within WordPress.</em></li>\n<li><em>Build custom REST routes for fetching posts and taxonomies.</em></li>\n<li><em><strong>Fetch any type of data</strong> available in WordPress via custom REST API endpoints.</em></li>\n<li><em><strong>Full control of Custom REST API responses</strong> without writing a single line of PHP code.</em></li>\n<li><em>Fetch operation available with single WHERE condition.</em></li>\n<li><em>Integrate with <strong>all types of applications</strong>.</em></li>\n<li><em>Create one API connection based on <strong>simple and advanced SQL queries</strong> on the WordPress database.</em></li>\n<li><em>Create one external API connection for all the standard third-party REST API endpoints to fetch/update between WordPress and 3rd party platforms.</em></li>\n</ul>\n<h3>Premium Version Features</h3>\n<ul>\n<li><em>Create/ Register custom namespaces and routes.</em></li>\n<li><em>Multiple endpoints allowed per REST route.</em></li>\n<li><em><strong>Create (generate) Custom API routes for posts</strong> and taxonomy creation, modification, and deletion.</em></li>\n<li><em>Supports <strong>all kinds of HTTP Methods</strong> (GET, PUT, POST, DELETE).</em></li>\n<li><em><strong>Filters</strong> included to alter and extend default functionality .</em></li>\n<li><em>Fetch operation available with <strong>multiple custom conditions</strong>.</em></li>\n<li><em>Limit the number of responses you get as a result of Custom Endpoints (API).</em></li>\n<li><em>Pass the data in application/JSON or application/x-www-formurlencode for HTTP POST and PUT API endpoints.</em></li>\n<li><em><strong>Complex queries</strong> formation with an Advance mechanism.</em></li>\n<li><em><strong>Restrict public access</strong> to all Custom REST API Routes with API KEY Authentication method (default) and some other Authentication methods can also be provided as ADD-ON as per requirement like</em>\n<ol>\n<li>REST API endpoints authentication using <strong>OAuth 2.0</strong></li>\n<li>REST API endpoints authentication using <strong>JWT Tokens</strong></li>\n<li><strong>Basic Authorization</strong> with Username and Password</li>\n<li>Authentication from <strong>external OAuth/OIDC provider&#8217;s token</strong> for REST API endpoints </li>\n</ol>\n</li>\n<li><em>Create unlimited API endpoints with custom <strong>SQL-based query</strong> on an easy-to-use GUI without any code.</em></li>\n<li><em>Create one API connection based on <strong>simple and advanced SQL queries</strong> on the WordPress database.</em></li>\n<li><em>Create one external API connection for all the standard third-party REST API endpoints to fetch/update between WordPress and 3rd party platforms.</em></li>\n</ul>\n<h3>Enterprise Version Features</h3>\n<ul>\n<li><em><strong>All</strong> Premium Version Features.</em></li>\n<li><em>Create (generate) unlimited Custom API endpoints with <strong>custom SQL Query</strong> to create a custom API with your complex SQL query.</em></li>\n<li><em><strong>Connect with External REST API/ External Endpoints</strong>, also known as third-party REST API endpoints.</em></li>\n<li><em><strong>External API integration to fetch data in the WordPress</strong>, update data on the External API provider side.</em></li>\n<li><em><strong>Supports all kinds of HTTP(GET/POST/PUT/UPDATE) Methods.</strong></em></li>\n<li><em>Supports <strong>integration with Custom API / Custom Endpoints</strong> of External Website or Platform.</em></li>\n<li><em><strong>Dynamic WordPress hooks</strong> for each External API / Endpoint connection to perform operations on external data.</em></li>\n<li><em><strong>Compatibility with Third-Party Plugin Events</strong> like WooCommerce, WPForms, <a href=\"https://www.gravityforms.com/\" rel=\"nofollow ugc\">Gravityforms</a>, Membership Plugins, etc.</em></li>\n<li><em><strong>Support for calling External / Custom Endpoints</strong> on third-party plugin events.</em></li>\n<li><em><strong>Compatibility with third-party plugin’s payment gateways</strong> provided by WooCommerce, Wpforms, PayPal, Stripe or any custom payment gateway.</em></li>\n<li><em><strong>Support for connection with Custom API / Custom Endpoints</strong> developed in any framework like Java, PHP, NodeJS, .NET, etc.</em></li>\n<li><em><strong>Support of Dynamic headers</strong> for the External REST APIs / Custom APIs request</em> </li>\n<li><em><strong>Securely access External Endpoints</strong> by passing the required authentication parameter either in the Header or Body.</em></li>\n<li>_<strong>Display data fetched from external API using shortcode</strong> as per your styling (custom HTML, CSS and JS).</li>\n<li>Both JSON and XML response formats are supported.</li>\n<li>Supports OAuth 2.0 authentication, Basic Authentication, API Key authentication and Bearer token/JWT token API endpoint authentication for External API Integration feature.</li>\n<li>Supports execution of multiple APIs at once which are interdependent.</li>\n</ul>\n<p>Authentication-related information can be sent by any suitable REST client for eg-  You can use CURL calls to send HTTP Requests or even any IDE like PHPSTORM or you can go with POSTMAN to send an authentication key.</p>\n<h4>Type of APIs supported</h4>\n<ul>\n<li>‘HTTP GET` (This can be used to retrieve data from your WordPress)</li>\n<li>‘HTTP POST’ (This can be used to insert data in your WordPress)</li>\n<li>‘HTTP PUT’ (This can be used to update data in your WordPress)</li>\n<li>‘HTTP DELETE’ (This can be used to delete data in your WordPress)</li>\n</ul>\n<h3>Type of Data which you can retrieve with Custom Endpoints</h3>\n<ul>\n<li>WP Users and User Meta.</li>\n<li>WP Roles and Capabilities.</li>\n<li>WP Posts, Pages and custom post types.</li>\n<li>WP Options.</li>\n<li>WP Taxonomy.</li>\n<li><a href=\"https://wordpress.org/plugins/woocommerce/\" rel=\"ugc\">WooCommerce</a>products, WordPress Membership plugins data.</li>\n<li>Custom data, Custom posts, Custom parameters, Custom fields and many more.</li>\n<li>Any third-party plugins or custom table data can be fetched/updated using these custom API endpoints.</li>\n</ul>\n",
        "installation": "<h4>From your WordPress dashboard</h4>\n<ol>\n<li>Visit <code>Plugins &gt; Add New</code></li>\n<li>Search for <code>Custom API for WP</code>. Find and Install the <code>Custom API for WP</code> plugin by miniOrange</li>\n<li>Activate the plugin</li>\n</ol>\n<h4>From WordPress.org</h4>\n<ol>\n<li>Download the <code>Custom API for WP</code> plugin</li>\n<li>Unzip and upload the <code>custom-api-for-wp</code> directory to your <code>/wp-content/plugins/</code> directory.</li>\n<li>Activate the miniOrange API plugin from your Plugins page.</li>\n</ol>\n<h4>Once Activated</h4>\n<ol>\n<li>Go to the <code>Settings-&gt; Custom API</code> menu</li>\n<li>Click on the <code>Create API</code> button</li>\n<li>Choose data that you want to retrieve with API and conditions to retrieve data</li>\n<li>Save the configuration and your API will be ready to use.</li>\n</ol>\n",
        "faq": "\n<dt id='can%20i%20fetch%20data%20from%20an%20external%20api%20endpoint%20and%20display%20it%20on%20my%20wordpress%20pages%3F'>\nCan I fetch data from an external API endpoint and display it on my WordPress pages?\n</h4>\n<p>\n<p>Yes, the plugin provides a feature to connect to any external endpoint and display the data using the <strong>WordPress shortcode</strong> or <strong>template tag</strong>. More details can be found <strong><a href=\"https://plugins.miniorange.com/display-data-on-wordpress-using-shortcode\" rel=\"nofollow ugc\">here</a></strong>.</p>\n</p>\n<dt id='can%20this%20plugin%20be%20used%20to%20create%20api%20for%20any%20third-party%20plugin%3F'>\nCan this plugin be used to create API for any third-party plugin?\n</h4>\n<p>\n<p>Yes, this plugin can help you perform any Database Operation for any plugin&#8217;s table in the WordPress database based on various filters that you want to apply.</p>\n</p>\n<dt id='can%20i%20write%20create%20or%20generate%20api%20endpoints%20in%20wordpress%20using%20my%20own%20complex%20custom%20sql%20query%3F'>\nCan I write create or generate API endpoints in WordPress using my own complex custom SQL Query?\n</h4>\n<p>\n<p>Yes, the plugin provides this functionality so that any custom endpoints can be created or generated based on your self-defined custom SQL query with any complexity, so SQL query can be used to perform operations even using multiple WP database tables.</p>\n</p>\n<dt id='how%20to%20integrate%20external%2Fthird-party%20side%28non-wordpress%29%20rest%20api%20endpoints%20into%20wordpress%3F'>\nHow to integrate External/third-party side(Non-WordPress) REST API endpoints into WordPress?\n</h4>\n<p>\n<p>The plugin provides the Graphical User Interface-based feature to integrate or connect to any external API endpoints easily within WordPress and these connections can be used to fetch/update data via these external API endpoints on any WordPress events on a real-time basis.</p>\n</p>\n<dt id='how%20to%20create%20api%20endpoints%20in%20wordpress'>\nHow to create API endpoints in WordPress\n</h4>\n<p>\n<p>This plugin is exactly meant to do that in which you can easily create any APIs to interact with the WordPress database and perform any operations like GET, POST, PUT, and DELETE within seconds along with security.</p>\n</p>\n<dt id='how%20to%20import%2Fsync%20products%20from%20an%20external%20inventory%2Fsupplier%20to%20my%20woocommerce%20store%3F'>\nHow to import/sync products from an external inventory/supplier to my WooCommerce store?\n</h4>\n<p>\n<p>The plugin can be with our other add-on <strong><a href=\"https://plugins.miniorange.com/woocommerce-api-product-sync-with-woocommerce-rest-apis\" rel=\"nofollow ugc\">Woocommerce product sync from external API</a></strong> to sync all the products including adding, updating, and deleting products based on what is available on the inventory/supplier’s end.</p>\n</p>\n<dt id='can%20this%20plugin%20be%20connected%20to%20zoho%20for%20integration%20with%20wordpress%3F'>\nCan this plugin be connected to Zoho for integration with WordPress?\n</h4>\n<p>\n<p>Yes, the plugin’s Connect to External API feature can be used to connect the Zoho platforms with WordPress and sync data in real-time using developer hooks or on-demand end-to-end integration.</p>\n</p>\n\n",
        "changelog": "<h4>1.1.1</h4>\n<ul>\n<li>Initial version</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Added UI changes and contact form bug fix</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Added feedback form at deactivation</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Improved SEO and added compatibility with WP 5.5</li>\n</ul>\n<h4>1.1.5</h4>\n<ul>\n<li>Showing all premium features and Added customer registration tab</li>\n</ul>\n<h4>1.1.6</h4>\n<ul>\n<li>Bugs and UI fixes </li>\n</ul>\n<h4>1.1.7</h4>\n<ul>\n<li>Bugs and UI fixes </li>\n</ul>\n<h4>1.1.8</h4>\n<ul>\n<li>Added compatibility with WordPress v5.6</li>\n</ul>\n<h4>1.1.9</h4>\n<ul>\n<li>Bugfix &#8211; Added support for LIKE condition</li>\n</ul>\n<h4>2.1.0</h4>\n<ul>\n<li>Bug Fixes, Compatibility with WordPress v5.7 and integration with external APIs</li>\n</ul>\n<h4>2.1.1</h4>\n<ul>\n<li>UI Updates, Bug Fixes</li>\n</ul>\n<h4>2.1.2</h4>\n<ul>\n<li>Bug Fixes, Usability improvements, WordPress 5.8 compatibility</li>\n</ul>\n<h4>2.1.3</h4>\n<ul>\n<li>Security Fixes, UI improvements, WordPress 5.8.2 compatibility </li>\n</ul>\n<h4>2.1.4</h4>\n<ul>\n<li>UI bug Fixes and Security Fixes</li>\n</ul>\n<h4>2.2.0</h4>\n<ul>\n<li>Compatibility with WordPress 5.9</li>\n<li>Fix for _ (underscore) issue with custom endpoints</li>\n<li>Minor UI Fixes</li>\n</ul>\n<h4>2.3.0</h4>\n<ul>\n<li>Major UI Updates and usability improvements</li>\n<li>Feature to View created custom API connections</li>\n<li>Support for Custom SQL APIs and External API Integration feature</li>\n<li>Bug &amp; Security Fixes</li>\n</ul>\n<h4>2.4.0</h4>\n<ul>\n<li>Compatibility with WordPress 6.0</li>\n<li>Minor Bug Fixes</li>\n</ul>\n<h4>2.5.0</h4>\n<ul>\n<li>UI Updates and usability improvements</li>\n<li>Bug Fixes</li>\n</ul>\n<h4>2.5.1</h4>\n<ul>\n<li>Compatibility with WordPress 6.1</li>\n</ul>\n<h4>2.6.0</h4>\n<ul>\n<li>Compatibility with WordPress 6.2 and PHP 8.2</li>\n<li>Major Bug and usability fixes</li>\n<li>UI Updates </li>\n</ul>\n<h4>2.7.0</h4>\n<ul>\n<li>UI Updates</li>\n</ul>\n<h4>2.8.0</h4>\n<ul>\n<li>WordPress 6.3 compatilbity</li>\n<li>Bug Fix for Multiple headers in External API Integration</li>\n<li>UI Updates</li>\n</ul>\n<h4>2.9.0</h4>\n<ul>\n<li>WordPress 6.4 compatibility</li>\n<li>Introduced the feature for external API data display via shortcode or hook</li>\n<li>UI improvements</li>\n</ul>\n<h4>3.0.0</h4>\n<ul>\n<li>WordPress 6.5 compatibility</li>\n<li>UI improvements</li>\n</ul>\n<h4>3.1.0</h4>\n<ul>\n<li>UI improvements</li>\n</ul>\n<h4>4.0.0</h4>\n<ul>\n<li>Major UI Updates</li>\n<li>Introduced new easy to use features</li>\n<li>WordPress 6.6 compatibility</li>\n</ul>\n"
    },
    "short_description": "Connect WordPress with External APIs and create no-code custom WordPress REST API endpoints to interact with the WordPress database to perform SQL ope &hellip;",
    "description": "<p><a href=\"https://plugins.miniorange.com/custom-api-for-wordpress\" rel=\"nofollow ugc\">Connect to external APIs | Create Custom API in WP</a> plugin formerly known as <strong>Custom API for WP plugin</strong> which helps you to <em>create no code custom REST endpoints/ Custom APIs</em> into WordPress directly with an interactive <strong>Graphical User Interface (GUI)</strong> to fetch any type of data from any WordPress database tables like <strong>users, posts, custom tables or any 3rd-party plugin&#8217;s table</strong>. You can also use HTTP request methods like <strong>GET, POST, PUT, DELETE (Insert, Update, Delete)</strong> data with these created Custom endpoint / Custom REST routes.</p>\n<p>This plugin also helps you <strong>connect to your external APIs</strong> and platforms to <strong>fetch the data and display via shortcode or template</strong> as per your design (custom HTML, CSS and JS), post data on third-party platforms on any WordPress events (user creation, Woocommerce events, form submission, membership purchase etc) via WordPress hooks.</p>\n<p>This plugin has an interactive and simple UI that will allow you to interact with data by creating Custom REST API endpoints. It means you can easily interact with the WordPress database to perform <strong>CRUD operations on data using the custom endpoints created (generated) using <a href=\"https://plugins.miniorange.com/custom-api-for-wordpress\" rel=\"nofollow ugc\">Connect to external APIs | Custom endpoints for WP</a></strong>.</p>\n<p><a href=\"https://plugins.miniorange.com/custom-api-for-wordpress\" rel=\"nofollow ugc\">Connect to external APIs | Custom endpoints for WP</a> takes care of writing the <strong>complex SQL queries</strong> to fetch/update data and provides you with a very simple User Interface to create or generate custom REST endpoints.<br />\nThis plugin also provides the <strong>filter operations in which you can filter the data</strong> you want to show in the API endpoint response.</p>\n<p><a href=\"https://plugins.miniorange.com/custom-api-for-wordpress\" rel=\"nofollow ugc\">Connect to external APIs | Custom endpoints for WP</a> also adds a <strong>layer of security by providing authentication methods</strong>  to these custom-generated API endpoints. The authentication methods which are compatible with the plugin are:</p>\n<h3></h3>\n<ul>\n<li><a href=\"https://developers.miniorange.com/docs/rest-api-authentication/wordpress/api-key-authentication\" rel=\"nofollow ugc\">API Key Authentication</a> </li>\n<li><a href=\"https://developers.miniorange.com/docs/rest-api-authentication/wordpress/jwt-authentication\" rel=\"nofollow ugc\">JWT Authentication</a></li>\n<li><a href=\"https://developers.miniorange.com/docs/rest-api-authentication/wordpress/basic-authentication\" rel=\"nofollow ugc\">Basic Authentication</a> </li>\n<li><a href=\"https://developers.miniorange.com/docs/rest-api-authentication/wordpress/oauth-authentication\" rel=\"nofollow ugc\">OAuth 2.0 Authentication</a></li>\n</ul>\n<p>You will also be able to <strong>control the visibility</strong> and customize the metadata attached to the Custom endpoint response. This plugin also <strong>eliminates the risk of unauthorized access</strong> to these custom endpoints that you created as it only gives access after successful user validation.</p>\n<h3>Third-party/External API Integration into WordPress</h3>\n<ul>\n<li>\n<p>This plugin allows you to <strong>integrate any external or third-party REST API endpoints into WordPress</strong> very easily with the help of our interactive and simple GUI within seconds. With this function of our plugin, you can fetch data to your WordPress (<a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a>) site or you can use it to fetch data and process it according to your needs.</p>\n</li>\n<li>\n<p>These integrations can also be done on third-party plugin events like form submission using Elementor, <a href=\"https://wpforms.com/\" rel=\"nofollow ugc\">Wpforms</a>, <a href=\"https://www.gravityforms.com/\" rel=\"nofollow ugc\">Gravityforms</a> etc. and also payment status or subscription status based on transactions done via payment gateways like that provided by <a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a>, <a href=\"https://wpforms.com/\" rel=\"nofollow ugc\">Wpforms</a>, <a href=\"https://www.gravityforms.com/\" rel=\"nofollow ugc\">Gravityforms</a> or any other services.</p>\n</li>\n<li>\n<p>External API integrations can be done on any event of WordPress like user registration, user membership level change or any other using plugin hooks.</p>\n</li>\n<li>\n<p><a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a> product data can be synced with any external/third-party API provider(Supplier) on a real-time basis with our plugin.</p>\n</li>\n<li>\n<p>This feature also provides the capability to register or login users to third-party platforms by making an API request to the third-party platforms.</p>\n</li>\n<li>\n<p><strong>Data display on front end using shortcode or template tag</strong> fetched from external API endpoints.</p>\n</li>\n<li>\n<p>Any kind of external APIs supporting <strong>JSON</strong>, <strong>XML</strong>, <strong>SOAP</strong>, <strong>GraphQL</strong> can be connected with authentication methods like <strong>OAuth</strong>, <strong>JWT</strong>, <strong>Bearer</strong>, <strong>API Key</strong> or even <strong>custom API authentication</strong>.</p>\n</li>\n</ul>\n<h3>Use Cases</h3>\n<ul>\n<li>Access custom data of the WordPress site into your mobile application or web clients via custom REST API Endpoints.</li>\n<li>Create easy <strong>Custom REST Routes to Create, Read, Update and Delete (CRUD)</strong> WordPress content from client-side JavaScript or external applications.</li>\n<li><strong>Interact with any standard database</strong> schema/ table or your custom-built schema/ table to fetch/ update/ delete data using the custom API endpoints.</li>\n<li><strong>Connect two WordPress sites</strong> or connect your WordPress site with a website built in any framework and Get/Update/Insert/Delete (CRUD) data of one website to another website with the help of Custom API and feasibility of connection with External APIs / Custom Endpoints developed in the external Website.</li>\n<li><strong>Connect with External Rest API Routes to display data on your website</strong> or process the data received from External Endpoint.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/integrate-external-third-party-rest-api-endpoints-into-wordpress\" rel=\"nofollow ugc\">Integrate External/third-party REST API endpoints with third-party plugin&#8217;s payment gateways</a></strong> like that of <a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a>, <a href=\"https://wpforms.com/\" rel=\"nofollow ugc\">Wpforms</a>or any other custom gateway such that the API can be called automatically based on the payment status.</li>\n<li><strong>Integrate External/ third-party REST API endpoints with custom/ third-party plugins&#8217; forms</strong> like that of <a href=\"https://wpforms.com/\" rel=\"nofollow ugc\">Wpforms</a>, Elementor, <a href=\"https://www.gravityforms.com/\" rel=\"nofollow ugc\">Gravityforms</a> etc such that the external APIs can be called on these forms submission or any related events to perform fetch/update/delete operation based on API endpoints.</li>\n<li><strong>Sync third-party/external API provider&#8217;s (Supplier&#8217;s) API Inventory data into <a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a></strong> and display them in the product feed on a real-time basis. <a href=\"https://plugins.miniorange.com/woocommerce-api-product-sync-with-woocommerce-rest-apis\" rel=\"nofollow ugc\">[More detials]</a></li>\n<li><strong>Integrate external APIs into WooCommerce</strong> &#8211; If you have a Woocommerce store and want to update the data like order creation, order status, and user profile update on a third-party platform in real-time, then a solution can be provided using our plugin.</li>\n<li><strong>Data display using shortcode</strong> &#8211; Fetch data from external API with security and display that on WordPress front-end pages using the shortcodes with customized design.</li>\n</ul>\n<h3>Add-Ons</h3>\n<h3>WooCommerce Products sync via External API | Import products in WooCommerce using Supplier APIs</h3>\n<ul>\n<li>If you have a <a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a> store and want to <strong>sync</strong> (add/update/delete) the products from the external inventory warehouse/  store&#8217;s platform via APIs then it can be using the CUSTOM API plugin along with our <strong><a href=\"https://plugins.miniorange.com/woocommerce-api-product-sync-with-woocommerce-rest-apis\" rel=\"nofollow ugc\">Woocommerce products sync from external APIs</a></strong>.</li>\n<li>\n<p><em>Following are the key features</em> &#8211;</p>\n<ol>\n<li><strong>Data can be synced automatically</strong> after a certain specified period. (For example, every 4 hours a day).</li>\n<li>All the product details like SKU, name, description, price, stock status, images, custom attributes and variant productions can be updated along with other custom attributes as well.</li>\n<li><strong>Sync can be done in the background</strong> such that customers using your WP site are not affected.</li>\n<li><strong>Data syncing can also be done by clicking on the sync button manually</strong> in the User Interface.</li>\n<li><strong><a href=\"https://wordpress.org/plugins/woocommerce/\" rel=\"ugc\">WooCommerce</a> product images can also be added</strong> or updated with ease based on external API data.</li>\n<li><strong>No extra work to import and export CSV/ TXT files manually</strong>. API Integration will do the job automatically.</li>\n</ol>\n</li>\n<li>\n<p>This plugin supports complete integrations for the following &#8211;</p>\n<ol>\n<li>Sync <strong>Amrod</strong> catalogue to WooCommerce </li>\n<li>Sync <strong>S&amp;S Activewear</strong> products to WooCommerce</li>\n<li>Sync products and orders from <strong>Shopify</strong> to WooCommerce</li>\n<li>Import products from <strong>Parts Unlimited</strong> to WooCommerce</li>\n<li>Import products from <strong>Parts Canada</strong> to WooCommerce</li>\n<li>Import products from <strong>Barron</strong> to WooCommerce</li>\n</ol>\n</li>\n</ul>\n<h3>Google Merchant Center</h3>\n<ul>\n<li>\n<p>Sync Products between <strong>WordPress and <a href=\"https://www.google.com/retail/solutions/merchant-center/\" rel=\"nofollow ugc\">Google Merchant Center feed</a></strong> (Integrate WordPress/ WooCommerce Store with Google Merchant Center)</p>\n</li>\n<li>\n<p>If you have a WordPress/ WooCommerce store or third-party dropshipping plugins like <a href=\"https://alidropship.com/plugin/\" rel=\"nofollow ugc\">Alidropship</a> and want to sync the products between the WordPress site and <a href=\"https://www.google.com/retail/solutions/merchant-center/\" rel=\"nofollow ugc\">Google Merchant Center feed</a> feed via APIs then it can be achieved using our solution.</p>\n</li>\n<li>\n<p><em>Following are key features</em> &#8211;</p>\n<ol>\n<li><strong>Real-time data sync</strong> between the WordPress and Google Merchant Centre platforms.</li>\n<li><strong>CSV or TXT files import and export are not required</strong>. Everything will be handled automatically via REST APIs.</li>\n<li>Any attribute like Image, pricing, variations, quantity, stock status, and description can be <strong>updated easily</strong>.</li>\n<li>Solution can be made <strong>compatible with WordPress as WooCommerce store, <a href=\"https://alidropship.com/plugin/\" rel=\"nofollow ugc\">Alidropship</a> store</strong> or any third-party plugin which manages the products in WordPress.</li>\n</ol>\n</li>\n</ul>\n<h3>Connect multiple WordPress/Woocommerce sites</h3>\n<ul>\n<li>WooCommerce API Product Sync with Multiple WooCommerce Stores.</li>\n<li>We do provide the solution in which the product data stored in one WooCommerce store can also be synced with other <a href=\"https://wordpress.org/plugins/woocommerce/\" rel=\"ugc\">WooCommerce</a> stores using the REST APIs such that the WC stores will be updated on a real-time basis.</li>\n<li>Sync all the Woocommerce data between multiple stores on updating in any one store in real-time.</li>\n</ul>\n<h3>Zoho Integration with WordPress</h3>\n<ul>\n<li>If you have a WordPress site and want to connect it to your <a href=\"https://www.zoho.com/\" rel=\"nofollow ugc\">Zoho</a> applications like <a href=\"https://www.zoho.com/in/crm/\" rel=\"nofollow ugc\">Zoho CRM</a>, <a href=\"https://www.zoho.com/connect/\" rel=\"nofollow ugc\">Zoho connect</a>, <a href=\"https://www.zoho.com/in/subscriptions/\" rel=\"nofollow ugc\">Zoho Subscription</a>, <a href=\"https://www.zoho.com/in/inventory/\" rel=\"nofollow ugc\">Zoho Inventory</a> etc to perform operations like sync real-time data between these platforms, which involves user profile sync, operate on WordPress or assign membership to the user based on his Zoho subscription etc. With this integration, any Zoho APIs and webhooks can be integrated to perform real-time sync.</li>\n</ul>\n<h3>Sync Advance Custom Fields (ACF) Posts in WordPress using external API data</h3>\n<ul>\n<li>This plugin helps to connect external and third-party APIs to sync the data from external platforms into WordPress Posts and ACF fields.</li>\n</ul>\n<h3>Google Sheet Integration</h3>\n<ul>\n<li>If you have a WordPress/Woocommerce site and want to connect it to Google Sheets, then our plugin can help you achieve that with our Google Sheets integrator. It provides both ways to sync the data. So, if you update or create any row in the google sheet, then that data will be synced in WordPress and similarly, if you perform any operation or event in WordPress, then that data can be synced as per your need in the Google sheet on a real-time basis.</li>\n</ul>\n<h3>WordPress Automate using Webhooks</h3>\n<ul>\n<li>This plugin can be made compatible to automate WordPress events with external API and webhook to synchronize data between WordPress and external applications.<br />\nFor example &#8211; If you have a WordPress/Woocommerce site and want to sync the user data, product data, posts, and membership data with external platforms, inventories and CRM like Zoho, Hubspot etc., then this plugin can be extended with an add-on to achieve this.</li>\n</ul>\n<p>These solutions can be used additionally along with the plugin. To know more details, contact us at <em>apisupport@xecurify.com</em> and let us know your requirements.</p>\n<h3>Free Version Features</h3>\n<ul>\n<li><em><strong>Unlimited Custom REST</strong> APIs (endpoints) can be created for the HTTP GET method.</em></li>\n<li><em>Name Custom Endpoints/Custom REST routes as per our wish and need.</em></li>\n<li><em><strong>Build custom REST routes for all tables</strong> within WordPress.</em></li>\n<li><em>Build custom REST routes for fetching posts and taxonomies.</em></li>\n<li><em><strong>Fetch any type of data</strong> available in WordPress via custom REST API endpoints.</em></li>\n<li><em><strong>Full control of Custom REST API responses</strong> without writing a single line of PHP code.</em></li>\n<li><em>Fetch operation available with single WHERE condition.</em></li>\n<li><em>Integrate with <strong>all types of applications</strong>.</em></li>\n<li><em>Create one API connection based on <strong>simple and advanced SQL queries</strong> on the WordPress database.</em></li>\n<li><em>Create one external API connection for all the standard third-party REST API endpoints to fetch/update between WordPress and 3rd party platforms.</em></li>\n</ul>\n<h3>Premium Version Features</h3>\n<ul>\n<li><em>Create/ Register custom namespaces and routes.</em></li>\n<li><em>Multiple endpoints allowed per REST route.</em></li>\n<li><em><strong>Create (generate) Custom API routes for posts</strong> and taxonomy creation, modification, and deletion.</em></li>\n<li><em>Supports <strong>all kinds of HTTP Methods</strong> (GET, PUT, POST, DELETE).</em></li>\n<li><em><strong>Filters</strong> included to alter and extend default functionality .</em></li>\n<li><em>Fetch operation available with <strong>multiple custom conditions</strong>.</em></li>\n<li><em>Limit the number of responses you get as a result of Custom Endpoints (API).</em></li>\n<li><em>Pass the data in application/JSON or application/x-www-formurlencode for HTTP POST and PUT API endpoints.</em></li>\n<li><em><strong>Complex queries</strong> formation with an Advance mechanism.</em></li>\n<li><em><strong>Restrict public access</strong> to all Custom REST API Routes with API KEY Authentication method (default) and some other Authentication methods can also be provided as ADD-ON as per requirement like</em>\n<ol>\n<li>REST API endpoints authentication using <strong>OAuth 2.0</strong></li>\n<li>REST API endpoints authentication using <strong>JWT Tokens</strong></li>\n<li><strong>Basic Authorization</strong> with Username and Password</li>\n<li>Authentication from <strong>external OAuth/OIDC provider&#8217;s token</strong> for REST API endpoints </li>\n</ol>\n</li>\n<li><em>Create unlimited API endpoints with custom <strong>SQL-based query</strong> on an easy-to-use GUI without any code.</em></li>\n<li><em>Create one API connection based on <strong>simple and advanced SQL queries</strong> on the WordPress database.</em></li>\n<li><em>Create one external API connection for all the standard third-party REST API endpoints to fetch/update between WordPress and 3rd party platforms.</em></li>\n</ul>\n<h3>Enterprise Version Features</h3>\n<ul>\n<li><em><strong>All</strong> Premium Version Features.</em></li>\n<li><em>Create (generate) unlimited Custom API endpoints with <strong>custom SQL Query</strong> to create a custom API with your complex SQL query.</em></li>\n<li><em><strong>Connect with External REST API/ External Endpoints</strong>, also known as third-party REST API endpoints.</em></li>\n<li><em><strong>External API integration to fetch data in the WordPress</strong>, update data on the External API provider side.</em></li>\n<li><em><strong>Supports all kinds of HTTP(GET/POST/PUT/UPDATE) Methods.</strong></em></li>\n<li><em>Supports <strong>integration with Custom API / Custom Endpoints</strong> of External Website or Platform.</em></li>\n<li><em><strong>Dynamic WordPress hooks</strong> for each External API / Endpoint connection to perform operations on external data.</em></li>\n<li><em><strong>Compatibility with Third-Party Plugin Events</strong> like WooCommerce, WPForms, <a href=\"https://www.gravityforms.com/\" rel=\"nofollow ugc\">Gravityforms</a>, Membership Plugins, etc.</em></li>\n<li><em><strong>Support for calling External / Custom Endpoints</strong> on third-party plugin events.</em></li>\n<li><em><strong>Compatibility with third-party plugin’s payment gateways</strong> provided by WooCommerce, Wpforms, PayPal, Stripe or any custom payment gateway.</em></li>\n<li><em><strong>Support for connection with Custom API / Custom Endpoints</strong> developed in any framework like Java, PHP, NodeJS, .NET, etc.</em></li>\n<li><em><strong>Support of Dynamic headers</strong> for the External REST APIs / Custom APIs request</em> </li>\n<li><em><strong>Securely access External Endpoints</strong> by passing the required authentication parameter either in the Header or Body.</em></li>\n<li>_<strong>Display data fetched from external API using shortcode</strong> as per your styling (custom HTML, CSS and JS).</li>\n<li>Both JSON and XML response formats are supported.</li>\n<li>Supports OAuth 2.0 authentication, Basic Authentication, API Key authentication and Bearer token/JWT token API endpoint authentication for External API Integration feature.</li>\n<li>Supports execution of multiple APIs at once which are interdependent.</li>\n</ul>\n<p>Authentication-related information can be sent by any suitable REST client for eg-  You can use CURL calls to send HTTP Requests or even any IDE like PHPSTORM or you can go with POSTMAN to send an authentication key.</p>\n<h4>Type of APIs supported</h4>\n<ul>\n<li>‘HTTP GET` (This can be used to retrieve data from your WordPress)</li>\n<li>‘HTTP POST’ (This can be used to insert data in your WordPress)</li>\n<li>‘HTTP PUT’ (This can be used to update data in your WordPress)</li>\n<li>‘HTTP DELETE’ (This can be used to delete data in your WordPress)</li>\n</ul>\n<h3>Type of Data which you can retrieve with Custom Endpoints</h3>\n<ul>\n<li>WP Users and User Meta.</li>\n<li>WP Roles and Capabilities.</li>\n<li>WP Posts, Pages and custom post types.</li>\n<li>WP Options.</li>\n<li>WP Taxonomy.</li>\n<li><a href=\"https://wordpress.org/plugins/woocommerce/\" rel=\"ugc\">WooCommerce</a>products, WordPress Membership plugins data.</li>\n<li>Custom data, Custom posts, Custom parameters, Custom fields and many more.</li>\n<li>Any third-party plugins or custom table data can be fetched/updated using these custom API endpoints.</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/custom-api-for-wp.4.0.0.zip",
    "upgrade_notice": {
        "1.0.0": "<ul>\n<li>First release of the plugin</li>\n<li>Create REST endpoints in WordPress</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/custom-api-for-wp/assets/screenshot-1.png?rev=2713376",
            "caption": "List all created APIs"
        },
        {
            "src": "https://ps.w.org/custom-api-for-wp/assets/screenshot-2.png?rev=2713376",
            "caption": "Create API UI"
        },
        {
            "src": "https://ps.w.org/custom-api-for-wp/assets/screenshot-3.png?rev=2713376",
            "caption": "View API"
        },
        {
            "src": "https://ps.w.org/custom-api-for-wp/assets/screenshot-4.PNG?rev=2713376",
            "caption": "Response to API calls"
        },
        {
            "src": "https://ps.w.org/custom-api-for-wp/assets/screenshot-5.PNG?rev=2713376",
            "caption": "Create REST API using custom SQL"
        }
    ],
    "tags": {
        "api": "api",
        "custom-api": "custom api",
        "custom-endpoints": "Custom Endpoints",
        "external-api": "external api",
        "rest-api": "rest-api"
    },
    "stable_tag": "4.0.0",
    "versions": {
        "1.1.1": "https://downloads.wordpress.org/plugin/custom-api-for-wp.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/custom-api-for-wp.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/custom-api-for-wp.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/custom-api-for-wp.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/custom-api-for-wp.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/custom-api-for-wp.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/custom-api-for-wp.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/custom-api-for-wp.1.1.8.zip",
        "1.1.9": "https://downloads.wordpress.org/plugin/custom-api-for-wp.1.1.9.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.1.2.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.1.3.zip",
        "2.1.4": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.1.4.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.2.0.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.3.0.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.4.0.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.5.0.zip",
        "2.5.1": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.5.1.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.6.0.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.7.0.zip",
        "2.8.0": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.8.0.zip",
        "2.9.0": "https://downloads.wordpress.org/plugin/custom-api-for-wp.2.9.0.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/custom-api-for-wp.3.0.0.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/custom-api-for-wp.3.1.0.zip",
        "4.0.0": "https://downloads.wordpress.org/plugin/custom-api-for-wp.4.0.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/custom-api-for-wp.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/custom-api-for-wp/assets/banner-772x250.png?rev=2345284",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/custom-api-for-wp/assets/icon-128x128.png?rev=2345284"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 96,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}