{
    "name": "Contact Forms 7 Digital Signature Add-On",
    "slug": "digital-signature-contact-form-7-addon",
    "version": "1.8.2",
    "author": "<a href=\"https://www.approveme.com/contact-form-7-signature-plugin/?utm_source=wprepo&utm_medium=link&utm_campaign=contact-form-7\">ApproveMe.com</a>",
    "author_profile": "https://profiles.wordpress.org/approveme/",
    "contributors": {
        "approveme": {
            "profile": "https://profiles.wordpress.org/approveme/",
            "avatar": "https://secure.gravatar.com/avatar/620cf850230b2d03a2cf5763c9727998?s=96&d=monsterid&r=g",
            "display_name": "approveme"
        }
    },
    "requires": "4.5",
    "tested": "6.5.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 52,
    "ratings": {
        "5": 2,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 3
    },
    "num_ratings": 5,
    "support_url": "https://wordpress.org/support/plugin/digital-signature-contact-form-7-addon/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 400,
    "downloaded": 22022,
    "last_updated": "2024-05-21 4:32pm GMT",
    "added": "2017-03-07",
    "homepage": "",
    "sections": {
        "description": "<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/oUQKP6i-ukU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Try Contact Form 7 Signature Demo Here</a></strong></p>\n<p><em>Please note you will need the following plugins installed to completely automate the process of collection of contracts using Contact Form 7 and WP E-Signature.</em></p>\n<ol>\n<li>\n<p><a href=\"https://wordpress.org/plugins/contact-form-7\" rel=\"ugc\">Contact Form 7</a></p>\n</li>\n<li>\n<p><a href=\"https://www.approveme.com/contact-form-7-signature-plugin/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">WP E-Signature</a> (Lifetime or Elite license)</p>\n</li>\n<li>\n<p><a href=\"https://www.approveme.com/wpesign-features/stand-alone-documents/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Stand Alone Document</a> (comes with above licenses)</p>\n</li>\n</ol>\n<p>*An Elite or Lifetime license is required and can be purchased at <a href=\"https://www.approveme.com/contact-form-7-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">www.approveme.com</a></p>\n<p><strong>Imagine trying to defend yourself in front a judge with nothing but a non-legally binding contract.  Your estranged client is claiming that they should not have to pay their invoice, even though you did all the work, and there is a document with their name on it.</strong></p>\n<p>“Sorry.  There’s nothing I can do.  This contract is not valid.”</p>\n<p>Something like this can <strong>ruin your business</strong>, even though you have done absolutely nothing wrong.</p>\n<p>The E-Signing industry has a long set of strict rules and regulations that all documents must follow.  That goes for all invoices, contracts, and agreements that your business may use.</p>\n<p>Instead of guessing whether or not your documents are valid, take the steps to guarantee that they are.</p>\n<p><strong>The ApproveMe WP E-Signature Plugin for Contact Form 7 turns your website into a court recognized legal document signing application.</strong></p>\n<p>There’s no doubt that Contact Form 7 is a fantastic plugin.  It’s able to automate tasks on your site and make gathering user data quite simple.  However, it’s important to note that signing legally binding contracts is NOT what they specialize in.  That’s where we step in.</p>\n<p>The WP E-Signature Plugin for Contact Form 7 ensures that every single contract, form or invoice submitted through Contact Form 7 is 100% UETA/ESIGN compliant.</p>\n<p>No more questioning whether or not your forms are legal.  Plus, you’ll never need to pay another third-party signing service ever again.</p>\n<p>Our team has put a lot of time into building a system that follows all of the rules and regulations of the e-signing industry, not just in the United States, but all over the world.</p>\n<p>You have the right to control your user experience.</p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Click Here to Try a Contact Form 7 Signature Demo</a></strong></p>\n<p><strong>Most Signature Plugins &amp; Add-Ons</strong> only record the details of signatures and send them to your FTP server as image files.</p>\n<p>These image files (of your client’s legal signature) are made EASILY accessible to FTP intruders.  Other E-sign plugins are not legally binding (and certainly not UETA/ESIGN compliant) because <strong>they fail to address most of the industry’s laws and regulations.</strong></p>\n<p>Any dispute over your contracts would not be in your favor.  If you or a client ever fell victim to fraud or identity theft, you would not have much to stand on.  Why risk it?</p>\n<p><strong>Some of the Powerful Features of ApproveMe’s E-Sign Plugin for Contact Form 7:</strong></p>\n<p><em>UETA/ESIGN Compliance</em></p>\n<p>We keep our plugin 100% compliant with the most current e-signing laws.  Rest easy knowing that any form or document signed with this plugin will stand up in court.</p>\n<p><em>Unique Signer Downloads</em></p>\n<p>Secure your PDF downloads.  Only when the sender is logged in and when the signer uses their unique download invitation can a contract be downloaded.</p>\n<p><em>Encrypted Data Storage</em></p>\n<p>Unlike other plugins, we never store data on easily accessible FTP servers.  We encrypt and store data in different strategic locations in your database.  Everything is fully secure.</p>\n<p>In fact, if a hacker were to even attempt to unencrpyt you data, the entire file would destroy itself.  We invested heavily into the security of this plugin so that your documents will be completely safe.</p>\n<p><em>Instant Trigger Redirects</em></p>\n<p>Redirect your signers to their contracts immediately after filling out a form.  This will help move your clients down the funnel without forgetting any steps or getting confused by directions.  It will be much easier to get your contracts signed.</p>\n<p><em>Responsive Design</em></p>\n<p>Get your contracts signed from anywhere.  Our plugin works with all desktop and mobile browsers for both Android and iOS devices including Chrome, Firefox, Safari, and Opera.</p>\n<p><em>Dynamic Form Fields</em></p>\n<p>Take sections on info from your forms and dynamically insert them into your contracts.  Now all of your contracts will be customized for your clients.</p>\n<p><em>Signing Reminder Emails</em></p>\n<p>Having trouble getting your client’s signature?  Set up automatic reminder emails to make sure they sign.  You choose the trigger date and frequency.  The plugin does the rest.</p>\n<p><em>Zero Monthly Fees Per User + Unlimited Users</em></p>\n<p>There are no limits to how many contracts you can create.  Everyone on your team can have access to the plugin.  We simply don’t believe in limits, or hidden fees.</p>\n<p><strong>Secure your contracts and rest easy. <a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">click here for a demo</a></strong></p>\n<h3>Need Customer Support?</h3>\n<p>To prevent support tickets from getting lost in the abyss, we created a full support resource on our website.  (There is no support offered on the wordpress.org forum.)</p>\n<p>Simply log into your account and submit a support ticket <a href=\"https://www.approveme.com/support/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">www.approveme.com/support</a> and we’ll do our best to help you out.</p>\n<p>Have non-support related questions?  Feel free to contact us on our <a href=\"https://www.approveme.com/letschat/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">contact form page</a>.</p>\n<p>As an extra bonus for getting this far, here’s a resource we created to show you the importance of contract security:</p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p>To see Contact Form 7 to WP E-Signature in action see the demo video below:<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/oUQKP6i-ukU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Try Contact Form 7 + WP E-Signature Demo Here</a></strong></p>\n<p>*Although the WP E-Signature Plugin will meet the requirements of the vast majority of e-signature laws, it is up to the end user to verify legality in their country of business.</p>\n<h3>Additional Info</h3>\n<h3>Additional important PDF capabilities and workflows for Contact Form 7 Signature Add-On</h3>\n<ul>\n<li>Fully automate the signature collection procedure for your individual or small company</li>\n<li>Download a copy of the signed document from your website as a PDF</li>\n<li>Sync your Dropbox account with a Signed PDF </li>\n<li>Email yourself and the signer a copy of the PDF which is UETA/ESIGN compliant</li>\n</ul>\n<p><strong>Your own WordPress website stores and encrypts all documents (not a random third party site)</strong></p>\n<p>Find out more details about document security of the WP E-Signature here: <a href=\"https://www.approveme.com/ueta-and-esign-act?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Security UETA/E SIGN Protection</a></p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a><br />\n<em>An active WP E-Signature business license is necessary for the Contact Form 7 Signature plugin to function. To get yours, you can simply buy a copy at (www.approveme.com)</em><br />\n<strong>Zero Monthly Expenses • UETA &amp; ESIGN Compliant • Legally Binding • 100% Money Back Guarantee</strong></p>\n<h3>INSTALLATION COMPLETE!</h3>\n<p>Every signed document could be saved as a PDF, placed in an email, instantly synced to a Dropbox account and much more! You choose exactly how you want it to work!</p>\n<p><em>An up to date <a href=\"https://www.approveme.com/contact-form-7-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Lifetime or Elite license</a> is needed for ApproveMe’s Contact Form 7 Signature plugin to run smoothly</em></p>\n<p><strong><a href=\"https://www.approveme.com/contact-form-7-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Get Your ApproveMe Business License Now</a></strong></p>\n<h4>Where do I go for help on additional pre-sale questions?</h4>\n<p>Please feel free to contact us at anytime with any additional questions you might have at our <a href=\"https://www.approveme.com/letschat/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">contact form page</a>.</p>\n",
        "installation": "<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/oUQKP6i-ukU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>How it Works:</h3>\n<p>*The plugin for Contact Form 7 is easy to setup. With an active ApproveMe Elite or Lifetime license, you can instantly produce legally binding (court accepted) contracts utilizing completed Contact Form 7 data and require your Contact Form 7 submitter to add their signature to your WP E Signature generated contract.</p>\n<p>This plugin is perfect for Freelancers, Web Designers, Photographers and Small Business owners who want to simplify and secure their contract generation process.*</p>\n<p>This plugin is amazing for Freelancers, Web Designers, Photographers and Small Business owners who want to simplify their contract generation process.</p>\n<h3>Get started by following these steps to set up your Contact Form 7 Signature Plugin</h3>\n<p><strong>Step 1:</strong><br />\nApproveMe&#8217;s WP E-Signature requires a few more plugins/add-ons to help you release the full power and automate Contact Form 7 as well as Digital Signatures that are legally binding. The following plugins are required:</p>\n<ol>\n<li><a href=\"https://wordpress.org/plugins/contact-form-7/\" rel=\"ugc\">Contact Form 7</a></li>\n<li><a href=\"https://www.approveme.com/contact-form-7-signature-plugin/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">WP E Signature</a> (Elite or Lifetime license)</li>\n<li><a href=\"https://www.approveme.com/contact-form-7-signature-plugin/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">E-Signature Add-ons Pack</a> (comes with your license above)</li>\n<li>[Signature Add-On by ApproveMe](this plugin)</li>\n</ol>\n<p><strong>Step 2:</strong><br />\n<em>Input your ApproveMe license</em><br />\nAfter buying a license from ApproveMe, you must input your new license key to launch upgrades and access technical support.<br />\nLog into your account to download your license key <a href=\"https://www.approveme.com/purchase-history?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">ApproveMe account</a> here (your password is included in the receipt emailed to you)</p>\n<p><strong>Step 3:</strong><br />\n<em>Set up a blank WordPress page</em><br />\nOnce the WP E-Signature plugins and add-ons have been installed and your configurations are saved, you must set up a blank WordPress webpage for every Stand Alone Document (or contract) you will be producing/sending to your form submitters.<br />\nDiscover more about Stand Alone Documents by visiting this <a href=\"https://wpe.approveme.com/article/156-basic-document-vs-stand-alone-document?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">helpful article</a></p>\n<p><strong>Step 4:</strong></p>\n<p><em>Set up a Stand Alone Document</em><br />\nUsing your new blank WordPress page, you will then need to produce a Stand Alone Document and then connect the WordPress page to our Stand Alone Document.<br />\nFind out more about Stand Alone Documents by visiting <a href=\"https://wpe.approveme.com/article/137-stand-alone-documents-add-on?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">documentation page</a> for this add-on.</p>\n<p><strong>Step 5:</strong><br />\n<em>(optional) Input Contact User Details into a Contract</em></p>\n<p>This step will change depending on what you want for the desired outcome.  WP E-Signature is triggered once a Contact Form is submitted. You’ve got the power to incorporate Contact Form user info (which was inputted from the customer once the form was submitted) into a brand new custom contract form which will either be emailed to the customer or shown to the customer after they submit the form.</p>\n<p><strong>How to use Contact Form 7 to add form fields details into a contract</strong></p>\n<p>Go to the Signer Input Fields/Custom Fields symbol and choose &#8220;Contact Form Data&#8221;.</p>\n<p>Choose the Contact Form that you’ve already made (and want to link with your contract form) using the drop down option list.</p>\n<p>Pick the field info you want to include in your new contract.</p>\n<p>A shortcode is created using this data. Don’t worry — your customer will only see the real field value when signing your contract.</p>\n<p>You can easily transfer the shortcode to any place in your contract form.  It will show the customer’s provided info anywhere the shortcode is found.</p>\n<p><strong>Step 6:</strong></p>\n<p><em>Select your document preferences and save settings</em></p>\n<p>Once you’ve inserted all the required contract text and linked your WP form fields to your Stand Alone Document, it’s time to choose your document settings.</p>\n<p>Important note: Before you can post your contract form, you must link your Stand Alone Document to the blank WordPress webpage you made previously for your contract. Do this by looking for and choosing the webpage from the &#8220;Display on this page&#8221; drop down option list found under the &#8220;Document Options&#8221; area.</p>\n<p>We decided NOT to include this page in your nav menu since it will be connected to a Contact Form and will not work properly unless it has the field values of that submitted Contact Form.</p>\n<p><strong>Step 7:</strong></p>\n<p><em>Almost there… (halfway done)</em></p>\n<p>Once you&#8217;ve published your Stand Alone Document, you’re halfway done. In the next step you have to pick your &#8220;trigger&#8221; and &#8220;action&#8221; selections for this document in Contact Form 7.</p>\n<p>Select LET&#8217;S GO NOW! to establish those final Contact Form 7 preferences.</p>\n<p><strong>Step 8:</strong></p>\n<p><em>Finalize creating the Contact Form 7 workflow/trigger</em></p>\n<p>Almost there!  Now all you need to do is select your contract and your preferred actions once the workflow is activated.</p>\n<p>Go to the &#8220;Forms&#8221; tab located in the WordPress control panel.</p>\n<p>Select the form you attached to the Stand Alone Document.</p>\n<p>Choose the &#8220;E-Signature&#8221; choice within the form options and specify the remaining options.</p>\n<p>Now You&#8217;re done!</p>\n<p>To see a live demo of the Contact Form 7 to WP E-Signature visit:</p>\n<p><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7s\" rel=\"nofollow ugc\">Try Contact Form 7 + WP E-Signature Demo Here</a></p>\n",
        "changelog": "<p>Version 1.8.2<br />\nFIX: Some minor bugs</p>\n<p>Version 1.8.1<br />\nADDED : PHP 8.2 compatibility<br />\nFIX: Some minor bugs</p>\n<p>Version 1.8.0<br />\nFIX: Date field display issue<br />\nFIX: Underline display issue<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.9<br />\nADDED: Php 8.1 support<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.8<br />\nFIX: Reminder interval validation issue<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.7<br />\nFIX: Signer name field issue<br />\nFIX: Date field display issue<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.6<br />\nADDED: Ability to populate different form data with a filter<br />\nFIX: Uploaded files is not displaying issue<br />\nFIX:Multi Step add-on conflict<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.4<br />\nFIX: Iframe issue<br />\nFIX: Cache display issue<br />\nFIX: Other form data display issue<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.3<br />\nFIX : Document title shortcode display issue</p>\n<p>Version 1.7.2<br />\nFIX: Radio and Checkbox field display issue<br />\nFIX: Some minor bugs</p>\n<p>Version 1.6.9<br />\nFIX: Some minor bugs</p>\n<p>Version 1.6.8<br />\nADDED : Rating widget<br />\nFIX : Multiple file upload display issue<br />\nFIX : Some other minor bugs.</p>\n<p>Version 1.6.7<br />\nADDED: javascript minification support.<br />\nFIX : Image location issue<br />\nFIX : Some other minor bugs.</p>\n<p>Version 1.6.6<br />\nADDED: License information updated.</p>\n<p>Version 1.6.5<br />\nFIX: E-mail field not clickable issue<br />\nFIX: Fix underline display issue<br />\nFIX: Some other minor issue</p>\n<p>Version 1.6.4<br />\nADDED: Bulk field shortcode insert option<br />\nFIX: Reminder javascript console error.</p>\n<p>Version 1.5.7.5<br />\nFIX: Dropdown field linebreak issue<br />\nFIX: Blank reminder settings issue<br />\nFIX: WP Rocket plugin conflict<br />\nFIX: Some other minor bugs.</p>\n<p>Version 1.5.7.1 &#8211; Merch 17, 2021<br />\nFIX: Displaying zero in agreement contract.</p>\n<p>Version 1.5.6.9 &#8211; February 01, 2021<br />\nADDED : New landing page added after activating plugin</p>\n<p>Version 1.5.6.5 &#8211; January 04, 2021<br />\nADDED : Line break support for textarea field.<br />\nFIX : Duplicate agreement issue.<br />\nFIX : Cookie conflict .<br />\nFIX : Some other minor issues.</p>\n<p>Version 1.5.6.5 &#8211; November 10, 2020<br />\nFIX:  Fatal error resolved when core and business pack inactive.<br />\nFIX : Cf7 almost done screen redirect issue.<br />\nFIX: After submit &#8220;Contact form&#8221; it is stuck on &#8220;Loading&#8221; page<br />\nFIX : Undefined index bug<br />\nFIX : Deprecated Cod while adding cf7 shortcode</p>\n<p>Version 1.5.6.0 &#8211; September 1, 2020<br />\nFIX:  Icon display issue.<br />\nFIX : some minor bugs.</p>\n<p>Version 1.5.5.8 &#8211; June 2, 2020<br />\nADDED: Support snippet in about page.</p>\n<p>Version 1.5.5.3 &#8211; January 14, 2020<br />\nFIX: cf7 checkbox list value display issue<br />\nFIX: Contact Form 7 MailChimp Extension conflict</p>\n<p>Version 1.5.3.6 &#8211; June 25, 2018<br />\nFIX: Demo video for plugins is not getting start after click on Play icon</p>\n<p>Version 1.5.3.4 &#8211; April 19, 2018<br />\nFIX: Improved CSS<br />\nADDED: Multiple field value adding into document title</p>\n<p>Version 1.5.3.0 &#8211; January 31, 2018<br />\nFIX: showing value bug fixed in case of disabling cf7 core<br />\nFIX: undefined form issue fixed</p>\n<p>Version 1.5.2.0 &#8211; October 9, 2017<br />\nADDED: Validation message when Signer name &amp; Signer Email address is missing</p>\n<p>Version 1.5.1.1 &#8211; Septemeber 12, 2017<br />\nFIX: Added compatibility with contact form 7 ajax submission</p>\n<p>Version 1.5.1 &#8211; August 10, 2017<br />\nADDED: Ability to be able to insert data in the title of a Stand alone document<br />\nFIX: Notice message display after submit form<br />\nFIX: Storing data in e-signature with form integrations</p>\n<p>March 13, 2017 &#8211; FIX: Bug with contact form custom field used as signature legal name and e-mail address.</p>\n<p>March 9, 2017 &#8211; FIX: Fatal Error Bug</p>\n<p>March 7, 2017 &#8211; Live version released on WordPress.org</p>\n"
    },
    "short_description": "Instantly produce a legally enforceable &amp; court recognized contract from a Contact Form 7 submission. Legal contracts. UETA/ESIGN Compliant.",
    "description": "<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/oUQKP6i-ukU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Try Contact Form 7 Signature Demo Here</a></strong></p>\n<p><em>Please note you will need the following plugins installed to completely automate the process of collection of contracts using Contact Form 7 and WP E-Signature.</em></p>\n<ol>\n<li>\n<p><a href=\"https://wordpress.org/plugins/contact-form-7\" rel=\"ugc\">Contact Form 7</a></p>\n</li>\n<li>\n<p><a href=\"https://www.approveme.com/contact-form-7-signature-plugin/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">WP E-Signature</a> (Lifetime or Elite license)</p>\n</li>\n<li>\n<p><a href=\"https://www.approveme.com/wpesign-features/stand-alone-documents/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Stand Alone Document</a> (comes with above licenses)</p>\n</li>\n</ol>\n<p>*An Elite or Lifetime license is required and can be purchased at <a href=\"https://www.approveme.com/contact-form-7-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">www.approveme.com</a></p>\n<p><strong>Imagine trying to defend yourself in front a judge with nothing but a non-legally binding contract.  Your estranged client is claiming that they should not have to pay their invoice, even though you did all the work, and there is a document with their name on it.</strong></p>\n<p>“Sorry.  There’s nothing I can do.  This contract is not valid.”</p>\n<p>Something like this can <strong>ruin your business</strong>, even though you have done absolutely nothing wrong.</p>\n<p>The E-Signing industry has a long set of strict rules and regulations that all documents must follow.  That goes for all invoices, contracts, and agreements that your business may use.</p>\n<p>Instead of guessing whether or not your documents are valid, take the steps to guarantee that they are.</p>\n<p><strong>The ApproveMe WP E-Signature Plugin for Contact Form 7 turns your website into a court recognized legal document signing application.</strong></p>\n<p>There’s no doubt that Contact Form 7 is a fantastic plugin.  It’s able to automate tasks on your site and make gathering user data quite simple.  However, it’s important to note that signing legally binding contracts is NOT what they specialize in.  That’s where we step in.</p>\n<p>The WP E-Signature Plugin for Contact Form 7 ensures that every single contract, form or invoice submitted through Contact Form 7 is 100% UETA/ESIGN compliant.</p>\n<p>No more questioning whether or not your forms are legal.  Plus, you’ll never need to pay another third-party signing service ever again.</p>\n<p>Our team has put a lot of time into building a system that follows all of the rules and regulations of the e-signing industry, not just in the United States, but all over the world.</p>\n<p>You have the right to control your user experience.</p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Click Here to Try a Contact Form 7 Signature Demo</a></strong></p>\n<p><strong>Most Signature Plugins &amp; Add-Ons</strong> only record the details of signatures and send them to your FTP server as image files.</p>\n<p>These image files (of your client’s legal signature) are made EASILY accessible to FTP intruders.  Other E-sign plugins are not legally binding (and certainly not UETA/ESIGN compliant) because <strong>they fail to address most of the industry’s laws and regulations.</strong></p>\n<p>Any dispute over your contracts would not be in your favor.  If you or a client ever fell victim to fraud or identity theft, you would not have much to stand on.  Why risk it?</p>\n<p><strong>Some of the Powerful Features of ApproveMe’s E-Sign Plugin for Contact Form 7:</strong></p>\n<p><em>UETA/ESIGN Compliance</em></p>\n<p>We keep our plugin 100% compliant with the most current e-signing laws.  Rest easy knowing that any form or document signed with this plugin will stand up in court.</p>\n<p><em>Unique Signer Downloads</em></p>\n<p>Secure your PDF downloads.  Only when the sender is logged in and when the signer uses their unique download invitation can a contract be downloaded.</p>\n<p><em>Encrypted Data Storage</em></p>\n<p>Unlike other plugins, we never store data on easily accessible FTP servers.  We encrypt and store data in different strategic locations in your database.  Everything is fully secure.</p>\n<p>In fact, if a hacker were to even attempt to unencrpyt you data, the entire file would destroy itself.  We invested heavily into the security of this plugin so that your documents will be completely safe.</p>\n<p><em>Instant Trigger Redirects</em></p>\n<p>Redirect your signers to their contracts immediately after filling out a form.  This will help move your clients down the funnel without forgetting any steps or getting confused by directions.  It will be much easier to get your contracts signed.</p>\n<p><em>Responsive Design</em></p>\n<p>Get your contracts signed from anywhere.  Our plugin works with all desktop and mobile browsers for both Android and iOS devices including Chrome, Firefox, Safari, and Opera.</p>\n<p><em>Dynamic Form Fields</em></p>\n<p>Take sections on info from your forms and dynamically insert them into your contracts.  Now all of your contracts will be customized for your clients.</p>\n<p><em>Signing Reminder Emails</em></p>\n<p>Having trouble getting your client’s signature?  Set up automatic reminder emails to make sure they sign.  You choose the trigger date and frequency.  The plugin does the rest.</p>\n<p><em>Zero Monthly Fees Per User + Unlimited Users</em></p>\n<p>There are no limits to how many contracts you can create.  Everyone on your team can have access to the plugin.  We simply don’t believe in limits, or hidden fees.</p>\n<p><strong>Secure your contracts and rest easy. <a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">click here for a demo</a></strong></p>\n<h3>Need Customer Support?</h3>\n<p>To prevent support tickets from getting lost in the abyss, we created a full support resource on our website.  (There is no support offered on the wordpress.org forum.)</p>\n<p>Simply log into your account and submit a support ticket <a href=\"https://www.approveme.com/support/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">www.approveme.com/support</a> and we’ll do our best to help you out.</p>\n<p>Have non-support related questions?  Feel free to contact us on our <a href=\"https://www.approveme.com/letschat/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">contact form page</a>.</p>\n<p>As an extra bonus for getting this far, here’s a resource we created to show you the importance of contract security:</p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p>To see Contact Form 7 to WP E-Signature in action see the demo video below:<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/oUQKP6i-ukU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Try Contact Form 7 + WP E-Signature Demo Here</a></strong></p>\n<p>*Although the WP E-Signature Plugin will meet the requirements of the vast majority of e-signature laws, it is up to the end user to verify legality in their country of business.</p>\n<h3>Additional Info</h3>\n<h3>Additional important PDF capabilities and workflows for Contact Form 7 Signature Add-On</h3>\n<ul>\n<li>Fully automate the signature collection procedure for your individual or small company</li>\n<li>Download a copy of the signed document from your website as a PDF</li>\n<li>Sync your Dropbox account with a Signed PDF </li>\n<li>Email yourself and the signer a copy of the PDF which is UETA/ESIGN compliant</li>\n</ul>\n<p><strong>Your own WordPress website stores and encrypts all documents (not a random third party site)</strong></p>\n<p>Find out more details about document security of the WP E-Signature here: <a href=\"https://www.approveme.com/ueta-and-esign-act?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Security UETA/E SIGN Protection</a></p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a><br />\n<em>An active WP E-Signature business license is necessary for the Contact Form 7 Signature plugin to function. To get yours, you can simply buy a copy at (www.approveme.com)</em><br />\n<strong>Zero Monthly Expenses • UETA &amp; ESIGN Compliant • Legally Binding • 100% Money Back Guarantee</strong></p>\n<h3>INSTALLATION COMPLETE!</h3>\n<p>Every signed document could be saved as a PDF, placed in an email, instantly synced to a Dropbox account and much more! You choose exactly how you want it to work!</p>\n<p><em>An up to date <a href=\"https://www.approveme.com/contact-form-7-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Lifetime or Elite license</a> is needed for ApproveMe’s Contact Form 7 Signature plugin to run smoothly</em></p>\n<p><strong><a href=\"https://www.approveme.com/contact-form-7-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">Get Your ApproveMe Business License Now</a></strong></p>\n<h4>Where do I go for help on additional pre-sale questions?</h4>\n<p>Please feel free to contact us at anytime with any additional questions you might have at our <a href=\"https://www.approveme.com/letschat/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\" rel=\"nofollow ugc\">contact form page</a>.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.8.2.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-1.png?rev=1710554",
            "caption": "<p><strong>Add New Document:</strong> After installing the WP E-Signature, you will need to draft up a new “Stand Alone Document”</p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-2.jpg?rev=1710554",
            "caption": "<p><strong>Contact Form 7 Data</strong> If you click the Signer Input Fields icon you will see the option “Contact Form 7 Data.” Click this to connect a WP Form to this contract.</p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-3.png?rev=1710554",
            "caption": "<p><strong>Select Your Contact Form:</strong>  If you already have your Contact Form created you can easily insert dynamic field data (from the form that is being submitted/triggering this contract) by selecting the Contact Form.</p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-4.png?rev=1710554",
            "caption": "<p><strong>Choose Your Contact Form 7 Fields:</strong> After selecting your Contact Form you will see the available field options from this particular Contact Form. You can easily insert dynamic data from your form anywhere in this new contract.</p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-5.png?rev=1710554",
            "caption": "<p><strong>Document Signing Options (optional):</strong> The powerful WP E-Signature tool by ApproveMe features plenty of customizable options including: Signing reminder Emails, Attach PDF to emails, Dropbox Sync, Auto Register WordPress Users, and TONS more. To read all about the available add-on features (which come with the business license) please see: <a href=\"https://www.approveme.com/esign-integrations/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\">https://www.approveme.com/esign-integrations</a></p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-6.png?rev=1710554",
            "caption": "<p><strong>Connect Your Document to a Page:</strong>Once you’re satisfied with your contract, you will need to select a BLANK WordPress page to attach this document to.</p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-7.png?rev=1710554",
            "caption": "<p><strong>Click “LET’S GO NOW”:</strong>After you have published your contract, you just need to connect your Stand Alone Document to your Contact Form. This is pretty straight forward. Just click the “LET’S GO NOW!” button to be redirected to the actions/trigger tab for your specific form.</p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-8.png?rev=1710554",
            "caption": "<p><strong>Define Your Signing Logic:</strong> This is the page (inside of Contact Form 7) that needs to be customized. Please choose the Signer’s Full Name and the Signer’s Email address along with any other additional e-signature settings you’d like to include with your contract.</p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-9.png?rev=1710554",
            "caption": "<p><strong>User Submits a Contact Form 7</strong> Once a user submits the Contact Form that you connected to your e-signature contract, they will either be immediately redirected to the contract or emailed an unique invitation to sign their contract.  All submitted details from Contact Form 7 will be included.</p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-10.png?rev=1710554",
            "caption": "<p><strong>Review &amp; eSign:</strong> With their e-signature, the customers agree to the terms of the document.</p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-11.png?rev=1710554",
            "caption": "<p><strong>Select a Digital Signature:</strong>Signers can choose a typed or digital signature</p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-12.png?rev=1710554",
            "caption": "<p><strong>Agree &amp; eSign:</strong> With their e-signature, the customers agree to the terms of the document.</p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-13.png?rev=1710554",
            "caption": "<p><strong>View Signed Document Email:</strong>Signers will be sent an email that includes the link to the document (and a PDF version of the contract if you opted for this method).</p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-14.png?rev=1710554",
            "caption": "<p><strong>Save as PDF:</strong>Customers can either view, print or download their signed document from the website. To do this, they need to click “View Signed Document” in the email that was sent to them upon signing. (With the “Attach as PDF” add-on installed, you can also automatically include the signed contract as a PDF attachment in this email.)</p>"
        },
        {
            "src": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/screenshot-15.png?rev=1710554",
            "caption": "<p><strong>WordPress Audit Trail e-signature Certificate:</strong>  Proving signer intent is a very important component to signing electronic documents. Every contract that is signed using WP E-Signature includes a detailed Signature Certificate. You can <a href=\"https://www.approveme.com/wordpress-audit-trail-e-signature-certificate/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=contact-form-7\">read all about the security of this report here</a>.</p>"
        }
    ],
    "tags": {
        "contact-form-7": "contact form 7",
        "contact-forms-7": "Contact Forms 7",
        "forms-plugin": "forms plugin"
    },
    "stable_tag": "1.8.2",
    "versions": {
        "1.5.0": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.0.zip",
        "1.5.0.1": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.0.1.zip",
        "1.5.0.2": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.0.2.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.2.zip",
        "1.5.3.0": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.3.0.zip",
        "1.5.3.4": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.3.4.zip",
        "1.5.3.6": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.3.6.zip",
        "1.5.4.9": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.4.9.zip",
        "1.5.5.3": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.5.3.zip",
        "1.5.5.8": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.5.8.zip",
        "1.5.6.0": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.6.0.zip",
        "1.5.6.5": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.6.5.zip",
        "1.5.6.8": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.6.8.zip",
        "1.5.6.9": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.6.9.zip",
        "1.5.7.1": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.7.1.zip",
        "1.5.7.5": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.5.7.5.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.6.5.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.6.6.zip",
        "1.6.7": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.6.7.zip",
        "1.6.8": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.6.8.zip",
        "1.6.9": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.6.9.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.7.2.zip",
        "1.7.3": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.7.3.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.7.4.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.7.6.zip",
        "1.7.7": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.7.7.zip",
        "1.7.8": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.7.8.zip",
        "1.7.9": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.7.9.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.8.0.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.8.1.zip",
        "1.8.2": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.1.8.2.zip",
        "trunk": "https://downloads.wordpress.org/plugin/digital-signature-contact-form-7-addon.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/banner-772x250.png?rev=1610134",
        "high": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/banner-1544x500.png?rev=1610134"
    },
    "icons": {
        "1x": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/icon-128x128.png?rev=1610134",
        "2x": "https://ps.w.org/digital-signature-contact-form-7-addon/assets/icon-256x256.png?rev=1610134"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 52,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}