{
    "name": "Directorist &#8211; WordPress Business Directory Plugin with Classified Ads Listings",
    "slug": "directorist",
    "version": "7.11.0",
    "author": "<a href=\"https://wpwax.com\">wpWax - WP Business Directory Plugin and Classified Listings Directory</a>",
    "author_profile": "https://profiles.wordpress.org/wpwax/",
    "contributors": {
        "wpwax": {
            "profile": "https://profiles.wordpress.org/wpwax/",
            "avatar": "https://secure.gravatar.com/avatar/91c2563ea233aba40ffa02923777f889?s=96&d=monsterid&r=g",
            "display_name": "wpWax"
        }
    },
    "requires": "4.6",
    "tested": "6.6.1",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 94,
    "ratings": {
        "5": 535,
        "4": 17,
        "3": 14,
        "2": 5,
        "1": 25
    },
    "num_ratings": 596,
    "support_url": "https://wordpress.org/support/plugin/directorist/",
    "support_threads": 30,
    "support_threads_resolved": 30,
    "active_installs": 10000,
    "downloaded": 613195,
    "last_updated": "2024-08-17 04:27:00",
    "added": "2017-08-27",
    "homepage": "https://wpwax.com",
    "sections": {
        "description": "<p><a href=\"https://userdemo.wpwax.com/directorist/\" rel=\"nofollow ugc\">Try Admin Demo</a> | <a href=\"https://directorist.com/demos/\" rel=\"nofollow ugc\">Demos</a> | <a href=\"https://directorist.com/documentation/directorist/\" rel=\"nofollow ugc\">Docs</a> | <a href=\"https://directorist.com/themes/\" rel=\"nofollow ugc\">Themes</a> | <a href=\"https://directorist.com/extensions/\" rel=\"nofollow ugc\">Extensions</a> | <a href=\"https://directorist.com/roadmap/\" rel=\"nofollow ugc\">Roadmap</a></p>\n<p>Are you ready to embark on the journey of creating your own online directory and classified ads listing site?</p>\n<p>If the answer is a resounding YES, then look no further! Directorist Business Directory Plugin is your ultimate companion, making the process not only seamless but also exciting. With Directorist, you&#8217;ll unlock the power to craft dynamic and impactful business directories and classified websites of any kind, setting the stage for endless possibilities and opportunities. Let&#8217;s dive in and unleash your creativity!</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/28gUzfsGmuk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Using Directorist, the potential of a directory site is boundless. It serves as a multifaceted platform, offering avenues for generating income, providing community service, supporting business operations, enhancing existing ventures, and more. With thousands of individuals already embarking on this journey, what stands in your way? Take the leap and discover the vast opportunities it presents.</p>\n<p>🎉 Use <a href=\"https://wordpress.org/themes/best-listing/\" rel=\"ugc\">Best Listing</a> FREE multi-purpose directory theme for a quick start.</p>\n<h3>THE ONLY WORDPRESS BUSINESS DIRECTORY PLUGIN YOU NEED</h3>\n<p>Meet our powerful Directorist Business Directory plugin, highly optimized that can scale to millions of listings ensuring the most dynamic experience of managing online directory business. Using Directorist, you can create lists of directories based on the location, category, and other interests without writing a single line of code.</p>\n<p>🔥🔥🔥 <strong>Directorist Mobile App for Android &amp; iOS</strong> 🔥🔥🔥</p>\n<p>If you want to make your directory website better accessible, highly interactive, and turn your visitors into paying customers, the Directorist mobile app is the one to take you to the rescue!</p>\n<p>📱 <a href=\"https://directorist.com/mobile-app/\" rel=\"nofollow ugc\">Launch Your Mobile App Now</a></p>\n<h3>TYPES OF WEBSITES YOU CAN BUILD</h3>\n<p>Using Directorist Business Directory plugin you can create classifieds websites and listing directories like a local business directory, car directory, booking directory, land selling directory, classified ads, team directory, job portal, directory portal, staff directory, medical directory, doctor directory, address book, review sites, restaurant directory, real estate, and many more!</p>\n<p>👉 Join Our FB Community : <a href=\"https://www.facebook.com/groups/directorist\" rel=\"nofollow ugc\">Directorist Community</a><br />\n👉 Official Facebook Page : <a href=\"https://www.facebook.com/directorist\" rel=\"nofollow ugc\">Like and Follow on Facebook</a><br />\n👉 Official Twitter Handle : <a href=\"https://twitter.com/wpdirectorist\" rel=\"nofollow ugc\">Follow on Twitter</a><br />\n👉 Official YouTube Channel : <a href=\"https://www.youtube.com/c/wpWax\" rel=\"nofollow ugc\">Follow on YouTube</a><br />\n👉 Official Support : <a href=\"https://directorist.com/dashboard/\" rel=\"nofollow ugc\">Contact</a></p>\n<p>Directorist Business Directory &amp; Classified Listings is one of the leading and fast-growing business directory plugins in WordPress. It’s fully compatible with popular WordPress themes that allow you to transform your existing website into a personalized business directory with tons of advanced features.</p>\n<h3>WHY SHOULD YOU USE DIRECTORIST &#8211; THE BUSINESS DIRECTORY PLUGIN?</h3>\n<p>👉 <strong>Multi Directory:</strong> Boost your business directory possibilities by creating multiple directory types within the same directory.</p>\n<p>👉 <strong>Custom Form and Layout Builder:</strong> Directorist form and layout builder allows you to build custom add listing and search form using drag and drop technology.</p>\n<p>👉 <strong>Listing CSV Import/Export with Custom Field:</strong> The new Directorist allows you to import listings with custom fields from the CSV file for no cost.</p>\n<p>👉 <strong>Beginner Friendly:</strong> Thoughtfully designed user interface lets users operate the plugin with zero coding skills and get the most compelling user experience.</p>\n<p>👉 <strong>Monetize and Earn:</strong> Expand your business with amazing monetization features that allow you to create an additional income stream and generate unlimited revenue flow.</p>\n<p>👉 <strong>Highly Extensible and Customizable:</strong> Enhance the functionalities of your directory site with robust extensions and customize using the most popular page builder— Elementor.</p>\n<p>👉 <strong>Booking System*:</strong> Develop a service or event-oriented booking directory with scheduling functionality to hoist the possibilities of your directory business.</p>\n<p>👉 <strong>Live Chat*:</strong> Integrate a private messaging system on your directory listing website that allows users to have a real-time private conversation with business owners.</p>\n<p>👉 <strong>Gutenberg Blocks:</strong> Directorist offers 16 blocks/widgets for the Gutenberg editor, which is the default visual interface for editing WordPress posts and pages.</p>\n<p>Let’s take a look at some of the core features that make this WordPress directory plugin exclusive from others:</p>\n<h3>CORE DIRECTORIST FEATURES AT A GLANCE</h3>\n<ul>\n<li>Compatible with all themes including popular ones such as Avada, Divi, Astra, and OceanWP.</li>\n<li>CSV Import/Export (listing, category, location, tag, media, etc.).</li>\n<li>Highly optimized and rocket-fast performance to ensure scalability.</li>\n<li>25+ Elementor Page Builder widgets.</li>\n<li>Gutenberg support and 16 Gutenberg blocks.</li>\n<li>Advanced search filters with custom filter.</li>\n<li>Front-end and Back-end listing submission.</li>\n<li>Front-end user dashboard to manage listings.</li>\n<li>Open Street Map and Google Map Integration.</li>\n<li>Unlimited custom fields on the listing form.</li>\n<li>100% responsive and modern-day design.</li>\n<li>WooCommerce multi-vendor plugin compatible [Exclusive].</li>\n<li>Built-in SEO optimization system as well as Yoast SEO compatibility.</li>\n<li>Personalize the directory using a wide range of shortcodes.</li>\n<li>GDPR compliant.</li>\n<li>Ajax-powered listing and review submission.</li>\n<li>Listing owner contact form.</li>\n<li>Bulk or individual user announcement</li>\n<li>Listing image slider.</li>\n<li>Listing and Review submission without login (Guest Submission).</li>\n<li>Listing reviews and ratings.</li>\n<li>Google reCAPTCHA</li>\n<li>Custom sidebar for single listing page.</li>\n<li>Custom user Registration and Login.</li>\n<li>New, Popular, Featured, and Open/Close badges.</li>\n<li>Create an Unlimited listing based on location and category.</li>\n<li>List and grid view for categories, locations, and listings pages.</li>\n<li>Translate to any language effortlessly using Loco Translate plugin.</li>\n<li>Sustainable for long-term use.</li>\n<li>Updated regularly for flawless operation.</li>\n<li>And many more!</li>\n</ul>\n<h3>Scalable Listing Platform with Lightning-Speed Performance</h3>\n<p>Swift loading times are vital for user experiences and search engine performance. The Directorist Business Directory plugin ensures lightning-fast loading with industry-standard optimization, scaling effortlessly to millions of listings while maintaining low memory consumption and efficient query execution.</p>\n<h3>Beautiful Modern Design and 100% Responsive Attire</h3>\n<p>Directorist features contemporary responsive designs with versatile grid, list, and map views. Compatible with popular themes such as Astra, Avada, and Divi, kickstart your Business Directory with trending designs instantly.</p>\n<h3>Easy Translation, RTL &amp; Built-in SEO Solution</h3>\n<p>Translate your business directory or classifieds website to any language effortlessly using the Loco Translate plugin that provides in-browser editing of the translation files and get your directory listing website optimized for SEO.</p>\n<p>👉 <strong>Multilingual Facility:</strong> Directory listing websites created by Directorist Business Directory are 100% translatable and can be translated into multiple languages.</p>\n<p>👉 <strong>Built-in SEO:</strong> Directorist Business Directory plugin lets you set custom meta titles and descriptions on every directory page. It is also compatible with the Yoast SEO plugin.</p>\n<p>👉 <strong>RTL (Right to Left):</strong> Directorist Business Directory plugin is fully compatible with RTL languages like Arabic, Aramaic, Hebrew, etc.</p>\n<h3>Powerful Ajax Powered Instant Search and Advanced Filters</h3>\n<p>The Directorist Business Directory &amp; Classified Listings advanced filter lets your users search listings based on numerous criteria like custom fields, tags, price range, etc. along with default text field, category, and location fields to elevate the search experience to a greater level.</p>\n<ul>\n<li>Filtering using numerous fields to yield accurate results.</li>\n<li>Geolocation and nearby listings.</li>\n<li>Radius search based on address and zip.</li>\n<li>Use custom fields as search filters.</li>\n<li>Search widgets with 14 different filters.</li>\n</ul>\n<h3>CSV Import/Export</h3>\n<p>Get a compelling user-friendly system that simplifies the migration process by letting you import thousands of listings from a CSV file.</p>\n<ul>\n<li>Complete migration to Directorist Business Directory in just a few clicks.</li>\n<li>Import thousands of listings or more in no time.</li>\n<li>Map any field types to Directory listing fields.</li>\n</ul>\n<h3>Unlimited Custom Fields</h3>\n<p>Add unlimited custom fields to accommodate custom requirements on the listing form also, you can use custom fields as search filters to get the best search results. You can add fields like select, file, URL, radio, checkbox, and many more</p>\n<ul>\n<li>Create unlimited custom fields for the listing form.</li>\n<li>Create custom fields by choosing from 11 different field types.</li>\n<li>Search using custom fields for accurate search results.</li>\n</ul>\n<h3>Extensive Monetization Facility</h3>\n<p>Directorist Business Directory &amp; Classified Listings allows you to monetize your business directory website in various ways. Let’s take a look at them:</p>\n<p>👉 <strong>Featured Listing:</strong> Earn money by featuring each of the listings of your site users according to their purchase. In this process, you make listings featured and promote them that are displayed at the top of the listing page.<br />\n👉 <strong>Paid Listing*:</strong> Get paid for each listing your users submit! You can create unlimited pricing plans by providing different sets of values to get paid by listing the submissions. To make it happen requires a cost-effective premium extension.<br />\n👉 <strong>Claim Listing*:</strong> Make money by allowing business owners to claim their listing and get verified.<br />\n👉 <strong>Pay Per Submit*:</strong> Earn by charging users to create a listing on your site.</p>\n<blockquote>\n<p>*Requires Additional Purchase</p>\n</blockquote>\n<h3>Frontend Listing Submission and Listing Management</h3>\n<p>Directorist Business Directory &amp; Classified Listings allows users to submit and manage listings from the front end of the site without having to log in to the admin panel.</p>\n<ul>\n<li>Add listings using the frontend listing form.</li>\n<li>Renew/Change plan from the frontend.</li>\n<li>Intuitive user dashboard for managing the listings.</li>\n</ul>\n<h3>Multiple Mapping Source</h3>\n<p>Location or address search is an important aspect of a business directory and classified ads site. Directorist Business Directory provides a flexible mapping source offering Google Maps and OpenStreetMap to help users to find their desired service.</p>\n<h3>Robust Payment Gateways</h3>\n<p>More options for getting paid means more ways to earn revenue. By default, Directorist Business Directory allows you to use an offline payment method for free.</p>\n<p>If you want to scale up your payment gateway using an online payment method, and you can use <a href=\"https://directorist.com/product/directorist-paypal/\" rel=\"nofollow ugc\">PayPal</a> , <a href=\"https://directorist.com/product/directorist-stripe/\" rel=\"nofollow ugc\">Stripe</a> or <a href=\"https://directorist.com/product/directorist-authorize-net/\" rel=\"nofollow ugc\">Authorize.Net</a> by purchasing cost-effective extensions. Using this WordPress directory plugin, taxes and recurring options can be added into your online payment system respectively.</p>\n<h3>Developer Friendly</h3>\n<p>🎉 <strong>Templating:</strong>  Directorist offers a robust templating system that allows you to override all the Directorist default template files without amending any of the plugin codes.</p>\n<p>WordPress developers can extend the plugin functionalities infinitely using available hooks and filters.</p>\n<p><strong>OTHER AMAZING PRODUCTS FROM WPWAX</strong></p>\n<p>👉  <a href=\"https://wordpress.org/plugins/helpgent/\" rel=\"ugc\">HelpGent</a> – Your Ultimate Help Agent for Video, Voice, and Text Messaging with Screen Record Facility</p>\n<p>👉  <a href=\"https://wordpress.org/plugins/legal-pages/\" rel=\"ugc\">Legal Pages</a> – Privacy Policy, Terms &amp; Conditions, GDPR, CCPA, and Cookie Notice Generator</p>\n<p>👉  <a href=\"https://wordpress.org/plugins/post-grid-carousel-ultimate/\" rel=\"ugc\">Post Grid, Slider &amp; Carousel Ultimate</a> – The easiest and most useful plugin to display blog posts, pages, or custom posts in beautiful post layouts like post grid, post carousel &amp; post slider</p>\n<p>👉  <a href=\"https://wordpress.org/plugins/woo-product-carousel-slider-and-grid-ultimate/\" rel=\"ugc\">Product Carousel Slider &amp; Grid Ultimate for WooCommerce</a> – The most intuitive solution to make your eCommerce site visually appealing by creating WooCommerce product carousel, sliders, or grids easily</p>\n<p>👉  <a href=\"https://wordpress.org/plugins/post-grid-carousel-ultimate/\" rel=\"ugc\">Logo Showcase Ultimate</a> – Ultimate logo showcase plugin to create responsive logo carousel, logo slider &amp; logo grid and display unlimited clients, partners, sponsors logos</p>\n<h3>Extensive Extensions</h3>\n<p>Directorist Business Directory offers cost-effective premium <a href=\"https://directorist.com/extensions/\" rel=\"nofollow ugc\">Extensions</a> to extend the functionalities of your directory listing website.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-pricing-plans/\" rel=\"nofollow ugc\">Pricing Plans</a></strong> &#8211; This feature extension allows you to create unlimited pricing plans with no time. Create private plans and set up recurring payments to your system which enhances your pricing plans on your directory listing website.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-woocommerce-pricing-plans/\" rel=\"nofollow ugc\">WooCommerce Pricing Plans</a></strong> &#8211; This extension enables you to use all the payment gateway supported by WooCommerce itself.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-paypal/\" rel=\"nofollow ugc\">PayPal Payment Gateway</a></strong> &#8211; Get paid through the PayPal payment gateway on your directory listing website.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-stripe/\" rel=\"nofollow ugc\">Stripe Payment Gateway</a></strong> &#8211; This extension is used to accept payment through Credit Cards. Debit Cards, Visa Card, MasterCard, Apple Pay, Google Pay, AliPay, and many more. This 3D secured extension supports 135 currencies all through the world.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-authorize-net/\" rel=\"nofollow ugc\">Authorize.Net Payment Gateway</a></strong> &#8211; A secured payment solution that accepts a great number of payment options for Directorist Pricing Plan like Visa, MasterCard, Discover, AmEx, JCB, PayPal, and more.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-booking/\" rel=\"nofollow ugc\">Booking(Reservation &amp; Appointment)</a></strong> &#8211; Set up a system for booking online shows, consultations, seminar, wedding invitations, training classes, restaurant, saloon reservations, doctor appointment, lawyer, consultancy firm, and so on.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-claim-listing/\" rel=\"nofollow ugc\">Claim Listing</a></strong> &#8211; This add-on allows business owners to visit your site and pay to get the ownership of their specific listing just like Foursquare and Yelp with a few clicks.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-post-your-need/\" rel=\"nofollow ugc\">Post Your Need</a></strong> &#8211; You can hardly find this unique feature extension in any other directory listing plugins. It supports business owners to communicate with consumers and solve their problems on a personal level.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-listings-with-map/\" rel=\"nofollow ugc\">Listing With Map</a></strong> &#8211; If you want to add a new layout that will show your listings with the map side by side bearing advanced filtering options, this feature extension would be the best bet for you. In this case, when you filter the listings, the search results will be updated without even loading the page.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-live-chat/\" rel=\"nofollow ugc\">Live Chat</a></strong> &#8211; Integrate private messaging system on your directory listing website and make your business more credible by ensuring customer satisfaction.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-image-gallery/\" rel=\"nofollow ugc\">Image Gallery</a></strong> &#8211; This feature extension allows you to add unlimited images for your gallery on your directory listing website. You can use a lightbox with an image cropping facility on your website.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-mark-as-sold/\" rel=\"nofollow ugc\">Mark as Sold</a></strong> &#8211; This allows the listing authors an opportunity to let their visitors know if a particular item is sold or not on their directory listing website.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/google-recaptcha/\" rel=\"nofollow ugc\">Google ReCAPTCHA</a></strong> &#8211; If you want to protect your directory listing website from fake/spam user registration, this feature extension is the right choice to ensure spam protection. This will stop all the auto-generated bots from submitting by setting up a Google reCAPTCHA challenge while registering users.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-listings-slider-carousel/\" rel=\"nofollow ugc\">Listing Slider &amp; Carousel</a></strong> &#8211; Display your listings with beautiful sliders and carousels. This highly customizable tool will allow you to display sliders and carousel on any pages, posts, and even in widgets. There are 18 shortcode attributes for sliders and 28 shortcode attributes for Carousel.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-business-hours/\" rel=\"nofollow ugc\">Business Hours</a></strong> &#8211; This feature extension is used to inform the customers when the business is open and when to close. It shows the opening and closing duration of your business hours. You can customize the timezone with a badge system.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-listing-faqs/\" rel=\"nofollow ugc\">Listing FAQs</a></strong> &#8211; Set up an <strong>FAQ</strong> section on your directory listing website to satisfy your visitors and convert them into your loyal customers.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-social-login/\" rel=\"nofollow ugc\">Social Login</a></strong> &#8211; Allow you users to register and login to your directory listing website using their social media channels. In this process, the registration process becomes faster and handy without waiting for the validation process.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-rank-featured-listings/\" rel=\"nofollow ugc\">Rank Featured Listings</a></strong> &#8211; To rank your featured listing items on your directory website. Sometimes you may need to rank all your featured listings if it happens on a larger scale. Using this extension, you will get complete and the most affordable solution out there you needed.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-compare-listings/\" rel=\"nofollow ugc\">Compare Listings</a></strong> &#8211; Allows visitors to add a set of listings in a list and compare its features by viewing in a comparison table.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-oxygen-integration/\" rel=\"nofollow ugc\">Oxygen Builder Integration</a></strong> &#8211; It combines all the functionalities needed to create a complete WordPress directory website using Oxygen Builder.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-buddyboss-integration/\" rel=\"nofollow ugc\">BuddyBoss Integration</a></strong> &#8211; It is used to integrate the giant Directorist with the popular BuddyBoss plugin. It combines all the functionalities needed to create a complete community based WordPress directory website using Directorist plugin and BuddyBoss platform.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-buddypress-integration/\" rel=\"nofollow ugc\">BuddyPress Integration</a></strong> &#8211; Directorist &#8211; BuddyPress Integration is a premium extension which makes Direcorist and BuddyPress work as a single integrated app, allowing you to build a hybrid listings directory  &hellip;</p>\n",
        "installation": "<ol>\n<li>Unzip the downloaded zip file and upload the plugin folder into the <code>wp-content/plugins/</code> directory. Alternatively, upload from Plugins &gt;&gt; Add New &gt;&gt; Upload Plugin.</li>\n<li>Activate the plugin from the Plugins page.</li>\n</ol>\n<h4>Usage</h4>\n<p><a href=\"https://directorist.com/documentation/directorist/\" rel=\"nofollow ugc\">Click here</a> for the Documentation.</p>\n",
        "faq": "\n<dt id='is%20directorist%20-%20wordpress%20business%20directory%20plugin%20with%20classified%20ads%20listings%20freemium%20in%20type%3F'>\nIs Directorist &#8211; WordPress Business Directory Plugin with Classified Ads Listings freemium in type?\n</h4>\n<p>\n<p>Directorist is a free business directory plugin that offers a number of paid extensions to extend the functionalities of your directory listing website.</p>\n</p>\n<dt id='how%20to%20make%20a%20listing%20featured%3F'>\nHow to make a listing featured?\n</h4>\n<p>\n<p>You can make a listing featured according to the respective pricing plans.</p>\n</p>\n<dt id='is%20there%20any%20widget%20facility%20with%20directorist%20business%20directory%20plugin%3F'>\nIs there any widget facility with Directorist Business Directory plugin?\n</h4>\n<p>\n<p>Absolutely, you will get 35+ custom widgets using this awesome plugin.</p>\n</p>\n<dt id='is%20directorist%20-%20wordpress%20business%20directory%20plugin%20with%20classified%20ads%20listings%20compatible%20with%20any%20themes%20out%20there%20in%20the%20market%3F'>\nIs Directorist &#8211; WordPress Business Directory Plugin with Classified Ads Listings compatible with any themes out there in the market?\n</h4>\n<p>\n<p>Yes, Directorist is built in such a way that it works smoothly with all the major themes in the market.</p>\n</p>\n<dt id='can%20i%20translate%20the%20directorist%20-%20wordpress%20business%20directory%20plugin%20with%20classified%20ads%20listings%20to%20my%20language%20and%20make%20it%20multi-lingual%3F'>\nCan I translate the Directorist &#8211; WordPress Business Directory Plugin with Classified Ads Listings to my language and make it multi-lingual?\n</h4>\n<p>\n<p>Yes, you can use the Loco Translate plugin or Poedit tool to translate your directory into your language. You can also make it multi-lingual using the gTranslate or Polylang plugin. For more information and guidelines refer to the blog post <a href=\"https://directorist.com/blog/how-to-make-directorist-multi-lingual\" rel=\"nofollow ugc\">here</a>.</p>\n</p>\n<dt id='what%20types%20of%20directories%20can%20i%20build%3F'>\nWhat types of directories can I build?\n</h4>\n<p>\n<p>Directorist is a complete directory solution and in combination with its advanced extensions, you can build directories of any kind. For example:</p>\n<ul>\n<li>Booking directory</li>\n<li>Classifieds directory</li>\n<li>Service-based directory</li>\n<li>Hotel directory</li>\n<li>Local directory</li>\n<li>Restaurant directory</li>\n<li>Professional directory</li>\n<li>Car directory</li>\n<li>Member directory</li>\n<li>Real-estate directory and many more</li>\n</ul>\n</p>\n\n",
        "changelog": "<p>7.11.0 &#8211; Aug 14, 2024</p>\n<ul>\n<li>Add &#8211; Support Google reCAPTCHA on contact listing owner form (#1777)</li>\n<li>Merge &#8211; User Dashboard, Login &amp; Registration pages (#1677)</li>\n<li>Refactor &#8211; Directorist service api with caching and unification (#1766)</li>\n<li>Fix &#8211; Data deletion issue on uninstall in multi-site installation (#1765)</li>\n<li>Fix &#8211; jQuery 3 compatibility issue (#1784)</li>\n<li>Fix &#8211; Listing meta empty field saving from backend (#1364)</li>\n</ul>\n<p>7.10.3 &#8211; Jun 13, 2024</p>\n<ul>\n<li>Fix &#8211; Renewal email sending issue</li>\n<li>Fix &#8211; Extension update issue</li>\n</ul>\n<p>7.10.2 &#8211; Jun 13, 2024</p>\n<ul>\n<li>Fix &#8211; Extension update issue</li>\n<li>Fix &#8211; Directory type specification issue Listings page</li>\n</ul>\n<p>7.10.0 &#8211; Jun 9, 2024</p>\n<ul>\n<li>Add &#8211; Listing edit status filter hook directorist_listing_edit_status (#1731)</li>\n<li>Update &#8211; Performance improvement: Listing status migrated to native status from post meta (#1606)</li>\n<li>Update &#8211; Performance improvement: Never expire listings query (#1625)</li>\n<li>Update &#8211; Twitter(X) Logo (#1706)</li>\n<li>Update &#8211; Dynamic Value for Maximum Radius Distance (#1730)</li>\n<li>Update &#8211; Default value of delete_expired_listing is set to false (#1732)</li>\n<li>Update &#8211; atbdp_insert_attachment_from_url function (#1704)</li>\n<li>Fix &#8211; HTML ID conflict on registration and add listing page (#1623)</li>\n<li>Fix &#8211; Open Street Map zipcode radius search (#1701)</li>\n<li>Fix &#8211; Dashboard nav width update (#1676)</li>\n<li>Fix &#8211; Remove empty space from the url parameter (#1739)</li>\n<li>Fix &#8211; Image upload with gallery extension (#1741)</li>\n<li>Fix &#8211; Related listing template on single listing page (#1738)</li>\n<li>Fix &#8211; Warning when no widget pass (#1733)</li>\n</ul>\n<p><a href=\"https://github.com/sovware/directorist/wiki/Changelogs\" rel=\"nofollow ugc\">Full Changelog</a></p>\n"
    },
    "short_description": "A user-centric yet powerful WordPress Business Directory Plugin to create a local business directory, job directory, &amp; Classified Ads Listing",
    "description": "<p><a href=\"https://userdemo.wpwax.com/directorist/\" rel=\"nofollow ugc\">Try Admin Demo</a> | <a href=\"https://directorist.com/demos/\" rel=\"nofollow ugc\">Demos</a> | <a href=\"https://directorist.com/documentation/directorist/\" rel=\"nofollow ugc\">Docs</a> | <a href=\"https://directorist.com/themes/\" rel=\"nofollow ugc\">Themes</a> | <a href=\"https://directorist.com/extensions/\" rel=\"nofollow ugc\">Extensions</a> | <a href=\"https://directorist.com/roadmap/\" rel=\"nofollow ugc\">Roadmap</a></p>\n<p>Are you ready to embark on the journey of creating your own online directory and classified ads listing site?</p>\n<p>If the answer is a resounding YES, then look no further! Directorist Business Directory Plugin is your ultimate companion, making the process not only seamless but also exciting. With Directorist, you&#8217;ll unlock the power to craft dynamic and impactful business directories and classified websites of any kind, setting the stage for endless possibilities and opportunities. Let&#8217;s dive in and unleash your creativity!</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/28gUzfsGmuk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Using Directorist, the potential of a directory site is boundless. It serves as a multifaceted platform, offering avenues for generating income, providing community service, supporting business operations, enhancing existing ventures, and more. With thousands of individuals already embarking on this journey, what stands in your way? Take the leap and discover the vast opportunities it presents.</p>\n<p>🎉 Use <a href=\"https://wordpress.org/themes/best-listing/\" rel=\"ugc\">Best Listing</a> FREE multi-purpose directory theme for a quick start.</p>\n<h3>THE ONLY WORDPRESS BUSINESS DIRECTORY PLUGIN YOU NEED</h3>\n<p>Meet our powerful Directorist Business Directory plugin, highly optimized that can scale to millions of listings ensuring the most dynamic experience of managing online directory business. Using Directorist, you can create lists of directories based on the location, category, and other interests without writing a single line of code.</p>\n<p>🔥🔥🔥 <strong>Directorist Mobile App for Android &amp; iOS</strong> 🔥🔥🔥</p>\n<p>If you want to make your directory website better accessible, highly interactive, and turn your visitors into paying customers, the Directorist mobile app is the one to take you to the rescue!</p>\n<p>📱 <a href=\"https://directorist.com/mobile-app/\" rel=\"nofollow ugc\">Launch Your Mobile App Now</a></p>\n<h3>TYPES OF WEBSITES YOU CAN BUILD</h3>\n<p>Using Directorist Business Directory plugin you can create classifieds websites and listing directories like a local business directory, car directory, booking directory, land selling directory, classified ads, team directory, job portal, directory portal, staff directory, medical directory, doctor directory, address book, review sites, restaurant directory, real estate, and many more!</p>\n<p>👉 Join Our FB Community : <a href=\"https://www.facebook.com/groups/directorist\" rel=\"nofollow ugc\">Directorist Community</a><br />\n👉 Official Facebook Page : <a href=\"https://www.facebook.com/directorist\" rel=\"nofollow ugc\">Like and Follow on Facebook</a><br />\n👉 Official Twitter Handle : <a href=\"https://twitter.com/wpdirectorist\" rel=\"nofollow ugc\">Follow on Twitter</a><br />\n👉 Official YouTube Channel : <a href=\"https://www.youtube.com/c/wpWax\" rel=\"nofollow ugc\">Follow on YouTube</a><br />\n👉 Official Support : <a href=\"https://directorist.com/dashboard/\" rel=\"nofollow ugc\">Contact</a></p>\n<p>Directorist Business Directory &amp; Classified Listings is one of the leading and fast-growing business directory plugins in WordPress. It’s fully compatible with popular WordPress themes that allow you to transform your existing website into a personalized business directory with tons of advanced features.</p>\n<h3>WHY SHOULD YOU USE DIRECTORIST &#8211; THE BUSINESS DIRECTORY PLUGIN?</h3>\n<p>👉 <strong>Multi Directory:</strong> Boost your business directory possibilities by creating multiple directory types within the same directory.</p>\n<p>👉 <strong>Custom Form and Layout Builder:</strong> Directorist form and layout builder allows you to build custom add listing and search form using drag and drop technology.</p>\n<p>👉 <strong>Listing CSV Import/Export with Custom Field:</strong> The new Directorist allows you to import listings with custom fields from the CSV file for no cost.</p>\n<p>👉 <strong>Beginner Friendly:</strong> Thoughtfully designed user interface lets users operate the plugin with zero coding skills and get the most compelling user experience.</p>\n<p>👉 <strong>Monetize and Earn:</strong> Expand your business with amazing monetization features that allow you to create an additional income stream and generate unlimited revenue flow.</p>\n<p>👉 <strong>Highly Extensible and Customizable:</strong> Enhance the functionalities of your directory site with robust extensions and customize using the most popular page builder— Elementor.</p>\n<p>👉 <strong>Booking System*:</strong> Develop a service or event-oriented booking directory with scheduling functionality to hoist the possibilities of your directory business.</p>\n<p>👉 <strong>Live Chat*:</strong> Integrate a private messaging system on your directory listing website that allows users to have a real-time private conversation with business owners.</p>\n<p>👉 <strong>Gutenberg Blocks:</strong> Directorist offers 16 blocks/widgets for the Gutenberg editor, which is the default visual interface for editing WordPress posts and pages.</p>\n<p>Let’s take a look at some of the core features that make this WordPress directory plugin exclusive from others:</p>\n<h3>CORE DIRECTORIST FEATURES AT A GLANCE</h3>\n<ul>\n<li>Compatible with all themes including popular ones such as Avada, Divi, Astra, and OceanWP.</li>\n<li>CSV Import/Export (listing, category, location, tag, media, etc.).</li>\n<li>Highly optimized and rocket-fast performance to ensure scalability.</li>\n<li>25+ Elementor Page Builder widgets.</li>\n<li>Gutenberg support and 16 Gutenberg blocks.</li>\n<li>Advanced search filters with custom filter.</li>\n<li>Front-end and Back-end listing submission.</li>\n<li>Front-end user dashboard to manage listings.</li>\n<li>Open Street Map and Google Map Integration.</li>\n<li>Unlimited custom fields on the listing form.</li>\n<li>100% responsive and modern-day design.</li>\n<li>WooCommerce multi-vendor plugin compatible [Exclusive].</li>\n<li>Built-in SEO optimization system as well as Yoast SEO compatibility.</li>\n<li>Personalize the directory using a wide range of shortcodes.</li>\n<li>GDPR compliant.</li>\n<li>Ajax-powered listing and review submission.</li>\n<li>Listing owner contact form.</li>\n<li>Bulk or individual user announcement</li>\n<li>Listing image slider.</li>\n<li>Listing and Review submission without login (Guest Submission).</li>\n<li>Listing reviews and ratings.</li>\n<li>Google reCAPTCHA</li>\n<li>Custom sidebar for single listing page.</li>\n<li>Custom user Registration and Login.</li>\n<li>New, Popular, Featured, and Open/Close badges.</li>\n<li>Create an Unlimited listing based on location and category.</li>\n<li>List and grid view for categories, locations, and listings pages.</li>\n<li>Translate to any language effortlessly using Loco Translate plugin.</li>\n<li>Sustainable for long-term use.</li>\n<li>Updated regularly for flawless operation.</li>\n<li>And many more!</li>\n</ul>\n<h3>Scalable Listing Platform with Lightning-Speed Performance</h3>\n<p>Swift loading times are vital for user experiences and search engine performance. The Directorist Business Directory plugin ensures lightning-fast loading with industry-standard optimization, scaling effortlessly to millions of listings while maintaining low memory consumption and efficient query execution.</p>\n<h3>Beautiful Modern Design and 100% Responsive Attire</h3>\n<p>Directorist features contemporary responsive designs with versatile grid, list, and map views. Compatible with popular themes such as Astra, Avada, and Divi, kickstart your Business Directory with trending designs instantly.</p>\n<h3>Easy Translation, RTL &amp; Built-in SEO Solution</h3>\n<p>Translate your business directory or classifieds website to any language effortlessly using the Loco Translate plugin that provides in-browser editing of the translation files and get your directory listing website optimized for SEO.</p>\n<p>👉 <strong>Multilingual Facility:</strong> Directory listing websites created by Directorist Business Directory are 100% translatable and can be translated into multiple languages.</p>\n<p>👉 <strong>Built-in SEO:</strong> Directorist Business Directory plugin lets you set custom meta titles and descriptions on every directory page. It is also compatible with the Yoast SEO plugin.</p>\n<p>👉 <strong>RTL (Right to Left):</strong> Directorist Business Directory plugin is fully compatible with RTL languages like Arabic, Aramaic, Hebrew, etc.</p>\n<h3>Powerful Ajax Powered Instant Search and Advanced Filters</h3>\n<p>The Directorist Business Directory &amp; Classified Listings advanced filter lets your users search listings based on numerous criteria like custom fields, tags, price range, etc. along with default text field, category, and location fields to elevate the search experience to a greater level.</p>\n<ul>\n<li>Filtering using numerous fields to yield accurate results.</li>\n<li>Geolocation and nearby listings.</li>\n<li>Radius search based on address and zip.</li>\n<li>Use custom fields as search filters.</li>\n<li>Search widgets with 14 different filters.</li>\n</ul>\n<h3>CSV Import/Export</h3>\n<p>Get a compelling user-friendly system that simplifies the migration process by letting you import thousands of listings from a CSV file.</p>\n<ul>\n<li>Complete migration to Directorist Business Directory in just a few clicks.</li>\n<li>Import thousands of listings or more in no time.</li>\n<li>Map any field types to Directory listing fields.</li>\n</ul>\n<h3>Unlimited Custom Fields</h3>\n<p>Add unlimited custom fields to accommodate custom requirements on the listing form also, you can use custom fields as search filters to get the best search results. You can add fields like select, file, URL, radio, checkbox, and many more</p>\n<ul>\n<li>Create unlimited custom fields for the listing form.</li>\n<li>Create custom fields by choosing from 11 different field types.</li>\n<li>Search using custom fields for accurate search results.</li>\n</ul>\n<h3>Extensive Monetization Facility</h3>\n<p>Directorist Business Directory &amp; Classified Listings allows you to monetize your business directory website in various ways. Let’s take a look at them:</p>\n<p>👉 <strong>Featured Listing:</strong> Earn money by featuring each of the listings of your site users according to their purchase. In this process, you make listings featured and promote them that are displayed at the top of the listing page.<br />\n👉 <strong>Paid Listing*:</strong> Get paid for each listing your users submit! You can create unlimited pricing plans by providing different sets of values to get paid by listing the submissions. To make it happen requires a cost-effective premium extension.<br />\n👉 <strong>Claim Listing*:</strong> Make money by allowing business owners to claim their listing and get verified.<br />\n👉 <strong>Pay Per Submit*:</strong> Earn by charging users to create a listing on your site.</p>\n<blockquote>\n<p>*Requires Additional Purchase</p>\n</blockquote>\n<h3>Frontend Listing Submission and Listing Management</h3>\n<p>Directorist Business Directory &amp; Classified Listings allows users to submit and manage listings from the front end of the site without having to log in to the admin panel.</p>\n<ul>\n<li>Add listings using the frontend listing form.</li>\n<li>Renew/Change plan from the frontend.</li>\n<li>Intuitive user dashboard for managing the listings.</li>\n</ul>\n<h3>Multiple Mapping Source</h3>\n<p>Location or address search is an important aspect of a business directory and classified ads site. Directorist Business Directory provides a flexible mapping source offering Google Maps and OpenStreetMap to help users to find their desired service.</p>\n<h3>Robust Payment Gateways</h3>\n<p>More options for getting paid means more ways to earn revenue. By default, Directorist Business Directory allows you to use an offline payment method for free.</p>\n<p>If you want to scale up your payment gateway using an online payment method, and you can use <a href=\"https://directorist.com/product/directorist-paypal/\" rel=\"nofollow ugc\">PayPal</a> , <a href=\"https://directorist.com/product/directorist-stripe/\" rel=\"nofollow ugc\">Stripe</a> or <a href=\"https://directorist.com/product/directorist-authorize-net/\" rel=\"nofollow ugc\">Authorize.Net</a> by purchasing cost-effective extensions. Using this WordPress directory plugin, taxes and recurring options can be added into your online payment system respectively.</p>\n<h3>Developer Friendly</h3>\n<p>🎉 <strong>Templating:</strong>  Directorist offers a robust templating system that allows you to override all the Directorist default template files without amending any of the plugin codes.</p>\n<p>WordPress developers can extend the plugin functionalities infinitely using available hooks and filters.</p>\n<p><strong>OTHER AMAZING PRODUCTS FROM WPWAX</strong></p>\n<p>👉  <a href=\"https://wordpress.org/plugins/helpgent/\" rel=\"ugc\">HelpGent</a> – Your Ultimate Help Agent for Video, Voice, and Text Messaging with Screen Record Facility</p>\n<p>👉  <a href=\"https://wordpress.org/plugins/legal-pages/\" rel=\"ugc\">Legal Pages</a> – Privacy Policy, Terms &amp; Conditions, GDPR, CCPA, and Cookie Notice Generator</p>\n<p>👉  <a href=\"https://wordpress.org/plugins/post-grid-carousel-ultimate/\" rel=\"ugc\">Post Grid, Slider &amp; Carousel Ultimate</a> – The easiest and most useful plugin to display blog posts, pages, or custom posts in beautiful post layouts like post grid, post carousel &amp; post slider</p>\n<p>👉  <a href=\"https://wordpress.org/plugins/woo-product-carousel-slider-and-grid-ultimate/\" rel=\"ugc\">Product Carousel Slider &amp; Grid Ultimate for WooCommerce</a> – The most intuitive solution to make your eCommerce site visually appealing by creating WooCommerce product carousel, sliders, or grids easily</p>\n<p>👉  <a href=\"https://wordpress.org/plugins/post-grid-carousel-ultimate/\" rel=\"ugc\">Logo Showcase Ultimate</a> – Ultimate logo showcase plugin to create responsive logo carousel, logo slider &amp; logo grid and display unlimited clients, partners, sponsors logos</p>\n<h3>Extensive Extensions</h3>\n<p>Directorist Business Directory offers cost-effective premium <a href=\"https://directorist.com/extensions/\" rel=\"nofollow ugc\">Extensions</a> to extend the functionalities of your directory listing website.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-pricing-plans/\" rel=\"nofollow ugc\">Pricing Plans</a></strong> &#8211; This feature extension allows you to create unlimited pricing plans with no time. Create private plans and set up recurring payments to your system which enhances your pricing plans on your directory listing website.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-woocommerce-pricing-plans/\" rel=\"nofollow ugc\">WooCommerce Pricing Plans</a></strong> &#8211; This extension enables you to use all the payment gateway supported by WooCommerce itself.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-paypal/\" rel=\"nofollow ugc\">PayPal Payment Gateway</a></strong> &#8211; Get paid through the PayPal payment gateway on your directory listing website.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-stripe/\" rel=\"nofollow ugc\">Stripe Payment Gateway</a></strong> &#8211; This extension is used to accept payment through Credit Cards. Debit Cards, Visa Card, MasterCard, Apple Pay, Google Pay, AliPay, and many more. This 3D secured extension supports 135 currencies all through the world.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-authorize-net/\" rel=\"nofollow ugc\">Authorize.Net Payment Gateway</a></strong> &#8211; A secured payment solution that accepts a great number of payment options for Directorist Pricing Plan like Visa, MasterCard, Discover, AmEx, JCB, PayPal, and more.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-booking/\" rel=\"nofollow ugc\">Booking(Reservation &amp; Appointment)</a></strong> &#8211; Set up a system for booking online shows, consultations, seminar, wedding invitations, training classes, restaurant, saloon reservations, doctor appointment, lawyer, consultancy firm, and so on.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-claim-listing/\" rel=\"nofollow ugc\">Claim Listing</a></strong> &#8211; This add-on allows business owners to visit your site and pay to get the ownership of their specific listing just like Foursquare and Yelp with a few clicks.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-post-your-need/\" rel=\"nofollow ugc\">Post Your Need</a></strong> &#8211; You can hardly find this unique feature extension in any other directory listing plugins. It supports business owners to communicate with consumers and solve their problems on a personal level.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-listings-with-map/\" rel=\"nofollow ugc\">Listing With Map</a></strong> &#8211; If you want to add a new layout that will show your listings with the map side by side bearing advanced filtering options, this feature extension would be the best bet for you. In this case, when you filter the listings, the search results will be updated without even loading the page.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-live-chat/\" rel=\"nofollow ugc\">Live Chat</a></strong> &#8211; Integrate private messaging system on your directory listing website and make your business more credible by ensuring customer satisfaction.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-image-gallery/\" rel=\"nofollow ugc\">Image Gallery</a></strong> &#8211; This feature extension allows you to add unlimited images for your gallery on your directory listing website. You can use a lightbox with an image cropping facility on your website.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-mark-as-sold/\" rel=\"nofollow ugc\">Mark as Sold</a></strong> &#8211; This allows the listing authors an opportunity to let their visitors know if a particular item is sold or not on their directory listing website.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/google-recaptcha/\" rel=\"nofollow ugc\">Google ReCAPTCHA</a></strong> &#8211; If you want to protect your directory listing website from fake/spam user registration, this feature extension is the right choice to ensure spam protection. This will stop all the auto-generated bots from submitting by setting up a Google reCAPTCHA challenge while registering users.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-listings-slider-carousel/\" rel=\"nofollow ugc\">Listing Slider &amp; Carousel</a></strong> &#8211; Display your listings with beautiful sliders and carousels. This highly customizable tool will allow you to display sliders and carousel on any pages, posts, and even in widgets. There are 18 shortcode attributes for sliders and 28 shortcode attributes for Carousel.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-business-hours/\" rel=\"nofollow ugc\">Business Hours</a></strong> &#8211; This feature extension is used to inform the customers when the business is open and when to close. It shows the opening and closing duration of your business hours. You can customize the timezone with a badge system.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-listing-faqs/\" rel=\"nofollow ugc\">Listing FAQs</a></strong> &#8211; Set up an <strong>FAQ</strong> section on your directory listing website to satisfy your visitors and convert them into your loyal customers.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-social-login/\" rel=\"nofollow ugc\">Social Login</a></strong> &#8211; Allow you users to register and login to your directory listing website using their social media channels. In this process, the registration process becomes faster and handy without waiting for the validation process.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-rank-featured-listings/\" rel=\"nofollow ugc\">Rank Featured Listings</a></strong> &#8211; To rank your featured listing items on your directory website. Sometimes you may need to rank all your featured listings if it happens on a larger scale. Using this extension, you will get complete and the most affordable solution out there you needed.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-compare-listings/\" rel=\"nofollow ugc\">Compare Listings</a></strong> &#8211; Allows visitors to add a set of listings in a list and compare its features by viewing in a comparison table.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-oxygen-integration/\" rel=\"nofollow ugc\">Oxygen Builder Integration</a></strong> &#8211; It combines all the functionalities needed to create a complete WordPress directory website using Oxygen Builder.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-buddyboss-integration/\" rel=\"nofollow ugc\">BuddyBoss Integration</a></strong> &#8211; It is used to integrate the giant Directorist with the popular BuddyBoss plugin. It combines all the functionalities needed to create a complete community based WordPress directory website using Directorist plugin and BuddyBoss platform.</p>\n<p>👉 <strong><a href=\"https://directorist.com/product/directorist-buddypress-integration/\" rel=\"nofollow ugc\">BuddyPress Integration</a></strong> &#8211; Directorist &#8211; BuddyPress Integration is a premium extension which makes Direcorist and BuddyPress work as a single integrated app, allowing you to build a hybrid listings directory  &hellip;</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/directorist.7.11.0.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-1.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-2.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-3.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-4.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-5.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-6.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-7.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-8.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-9.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-10.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-11.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-12.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-13.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-14.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-15.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-16.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-17.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-18.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-19.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-20.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-21.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-22.gif?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-24.gif?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-25.gif?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-26.gif?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-27.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-28.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-29.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-30.jpg?rev=2801619",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/directorist/assets/screenshot-31.jpg?rev=2801619",
            "caption": ""
        }
    ],
    "tags": {
        "business-directory": "business directory",
        "classifieds": "classifieds",
        "directory-plugin": "directory plugin",
        "listing": "listing",
        "member-directory": "member directory"
    },
    "stable_tag": "7.11.0",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/directorist.1.0.0.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/directorist.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/directorist.1.1.1.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/directorist.2.0.0.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/directorist.3.0.0.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/directorist.3.1.0.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/directorist.3.1.1.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/directorist.3.1.2.zip",
        "3.1.3": "https://downloads.wordpress.org/plugin/directorist.3.1.3.zip",
        "3.1.4": "https://downloads.wordpress.org/plugin/directorist.3.1.4.zip",
        "3.1.5": "https://downloads.wordpress.org/plugin/directorist.3.1.5.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/directorist.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/directorist.3.2.1.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/directorist.3.2.2.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/directorist.3.3.0.zip",
        "4.0.0": "https://downloads.wordpress.org/plugin/directorist.4.0.0.zip",
        "4.0.1": "https://downloads.wordpress.org/plugin/directorist.4.0.1.zip",
        "4.0.2": "https://downloads.wordpress.org/plugin/directorist.4.0.2.zip",
        "4.0.3": "https://downloads.wordpress.org/plugin/directorist.4.0.3.zip",
        "4.1.0": "https://downloads.wordpress.org/plugin/directorist.4.1.0.zip",
        "4.2.0": "https://downloads.wordpress.org/plugin/directorist.4.2.0.zip",
        "4.3.0": "https://downloads.wordpress.org/plugin/directorist.4.3.0.zip",
        "4.3.1": "https://downloads.wordpress.org/plugin/directorist.4.3.1.zip",
        "4.4.0": "https://downloads.wordpress.org/plugin/directorist.4.4.0.zip",
        "4.5.0": "https://downloads.wordpress.org/plugin/directorist.4.5.0.zip",
        "4.5.1": "https://downloads.wordpress.org/plugin/directorist.4.5.1.zip",
        "4.6.0": "https://downloads.wordpress.org/plugin/directorist.4.6.0.zip",
        "4.7.0": "https://downloads.wordpress.org/plugin/directorist.4.7.0.zip",
        "4.7.1": "https://downloads.wordpress.org/plugin/directorist.4.7.1.zip",
        "4.7.2": "https://downloads.wordpress.org/plugin/directorist.4.7.2.zip",
        "4.7.3": "https://downloads.wordpress.org/plugin/directorist.4.7.3.zip",
        "4.7.4": "https://downloads.wordpress.org/plugin/directorist.4.7.4.zip",
        "4.7.5": "https://downloads.wordpress.org/plugin/directorist.4.7.5.zip",
        "4.7.6": "https://downloads.wordpress.org/plugin/directorist.4.7.6.zip",
        "5.0.0": "https://downloads.wordpress.org/plugin/directorist.5.0.0.zip",
        "5.0.1": "https://downloads.wordpress.org/plugin/directorist.5.0.1.zip",
        "5.0.2": "https://downloads.wordpress.org/plugin/directorist.5.0.2.zip",
        "5.0.3": "https://downloads.wordpress.org/plugin/directorist.5.0.3.zip",
        "5.0.4": "https://downloads.wordpress.org/plugin/directorist.5.0.4.zip",
        "5.0.5": "https://downloads.wordpress.org/plugin/directorist.5.0.5.zip",
        "5.0.6": "https://downloads.wordpress.org/plugin/directorist.5.0.6.zip",
        "5.0.7": "https://downloads.wordpress.org/plugin/directorist.5.0.7.zip",
        "5.0.8": "https://downloads.wordpress.org/plugin/directorist.5.0.8.zip",
        "5.1.0": "https://downloads.wordpress.org/plugin/directorist.5.1.0.zip",
        "5.2.0": "https://downloads.wordpress.org/plugin/directorist.5.2.0.zip",
        "5.3.0": "https://downloads.wordpress.org/plugin/directorist.5.3.0.zip",
        "5.4.0": "https://downloads.wordpress.org/plugin/directorist.5.4.0.zip",
        "5.4.1": "https://downloads.wordpress.org/plugin/directorist.5.4.1.zip",
        "5.4.2": "https://downloads.wordpress.org/plugin/directorist.5.4.2.zip",
        "5.4.3": "https://downloads.wordpress.org/plugin/directorist.5.4.3.zip",
        "5.5.0": "https://downloads.wordpress.org/plugin/directorist.5.5.0.zip",
        "5.5.1": "https://downloads.wordpress.org/plugin/directorist.5.5.1.zip",
        "5.5.2": "https://downloads.wordpress.org/plugin/directorist.5.5.2.zip",
        "5.5.3": "https://downloads.wordpress.org/plugin/directorist.5.5.3.zip",
        "5.6.0": "https://downloads.wordpress.org/plugin/directorist.5.6.0.zip",
        "5.6.1": "https://downloads.wordpress.org/plugin/directorist.5.6.1.zip",
        "5.6.2": "https://downloads.wordpress.org/plugin/directorist.5.6.2.zip",
        "5.6.3": "https://downloads.wordpress.org/plugin/directorist.5.6.3.zip",
        "5.7.0": "https://downloads.wordpress.org/plugin/directorist.5.7.0.zip",
        "5.8.0": "https://downloads.wordpress.org/plugin/directorist.5.8.0.zip",
        "5.9.0": "https://downloads.wordpress.org/plugin/directorist.5.9.0.zip",
        "5.9.1": "https://downloads.wordpress.org/plugin/directorist.5.9.1.zip",
        "5.9.2": "https://downloads.wordpress.org/plugin/directorist.5.9.2.zip",
        "6.0.0": "https://downloads.wordpress.org/plugin/directorist.6.0.0.zip",
        "6.0.1": "https://downloads.wordpress.org/plugin/directorist.6.0.1.zip",
        "6.0.2": "https://downloads.wordpress.org/plugin/directorist.6.0.2.zip",
        "6.1.0": "https://downloads.wordpress.org/plugin/directorist.6.1.0.zip",
        "6.2.0": "https://downloads.wordpress.org/plugin/directorist.6.2.0.zip",
        "6.2.1": "https://downloads.wordpress.org/plugin/directorist.6.2.1.zip",
        "6.2.2": "https://downloads.wordpress.org/plugin/directorist.6.2.2.zip",
        "6.3.0": "https://downloads.wordpress.org/plugin/directorist.6.3.0.zip",
        "6.3.1": "https://downloads.wordpress.org/plugin/directorist.6.3.1.zip",
        "6.3.2": "https://downloads.wordpress.org/plugin/directorist.6.3.2.zip",
        "6.3.3": "https://downloads.wordpress.org/plugin/directorist.6.3.3.zip",
        "6.3.4": "https://downloads.wordpress.org/plugin/directorist.6.3.4.zip",
        "6.4.0": "https://downloads.wordpress.org/plugin/directorist.6.4.0.zip",
        "6.4.1": "https://downloads.wordpress.org/plugin/directorist.6.4.1.zip",
        "6.4.2": "https://downloads.wordpress.org/plugin/directorist.6.4.2.zip",
        "6.4.3": "https://downloads.wordpress.org/plugin/directorist.6.4.3.zip",
        "6.5.0": "https://downloads.wordpress.org/plugin/directorist.6.5.0.zip",
        "6.5.1": "https://downloads.wordpress.org/plugin/directorist.6.5.1.zip",
        "6.5.2": "https://downloads.wordpress.org/plugin/directorist.6.5.2.zip",
        "6.5.3": "https://downloads.wordpress.org/plugin/directorist.6.5.3.zip",
        "6.5.4": "https://downloads.wordpress.org/plugin/directorist.6.5.4.zip",
        "6.5.5": "https://downloads.wordpress.org/plugin/directorist.6.5.5.zip",
        "6.5.6": "https://downloads.wordpress.org/plugin/directorist.6.5.6.zip",
        "6.5.7": "https://downloads.wordpress.org/plugin/directorist.6.5.7.zip",
        "6.5.8": "https://downloads.wordpress.org/plugin/directorist.6.5.8.zip",
        "7.0": "https://downloads.wordpress.org/plugin/directorist.7.0.zip",
        "7.0.1": "https://downloads.wordpress.org/plugin/directorist.7.0.1.zip",
        "7.0.2": "https://downloads.wordpress.org/plugin/directorist.7.0.2.zip",
        "7.0.3": "https://downloads.wordpress.org/plugin/directorist.7.0.3.zip",
        "7.0.3.1": "https://downloads.wordpress.org/plugin/directorist.7.0.3.1.zip",
        "7.0.3.2": "https://downloads.wordpress.org/plugin/directorist.7.0.3.2.zip",
        "7.0.3.3": "https://downloads.wordpress.org/plugin/directorist.7.0.3.3.zip",
        "7.0.4": "https://downloads.wordpress.org/plugin/directorist.7.0.4.zip",
        "7.0.4.1": "https://downloads.wordpress.org/plugin/directorist.7.0.4.1.zip",
        "7.0.5": "https://downloads.wordpress.org/plugin/directorist.7.0.5.zip",
        "7.0.5.1": "https://downloads.wordpress.org/plugin/directorist.7.0.5.1.zip",
        "7.0.5.2": "https://downloads.wordpress.org/plugin/directorist.7.0.5.2.zip",
        "7.0.5.3": "https://downloads.wordpress.org/plugin/directorist.7.0.5.3.zip",
        "7.0.5.4": "https://downloads.wordpress.org/plugin/directorist.7.0.5.4.zip",
        "7.0.5.5": "https://downloads.wordpress.org/plugin/directorist.7.0.5.5.zip",
        "7.0.5.6": "https://downloads.wordpress.org/plugin/directorist.7.0.5.6.zip",
        "7.0.6": "https://downloads.wordpress.org/plugin/directorist.7.0.6.zip",
        "7.0.6.1": "https://downloads.wordpress.org/plugin/directorist.7.0.6.1.zip",
        "7.0.6.2": "https://downloads.wordpress.org/plugin/directorist.7.0.6.2.zip",
        "7.0.6.3": "https://downloads.wordpress.org/plugin/directorist.7.0.6.3.zip",
        "7.0.7": "https://downloads.wordpress.org/plugin/directorist.7.0.7.zip",
        "7.0.8": "https://downloads.wordpress.org/plugin/directorist.7.0.8.zip",
        "7.1.0": "https://downloads.wordpress.org/plugin/directorist.7.1.0.zip",
        "7.1.1": "https://downloads.wordpress.org/plugin/directorist.7.1.1.zip",
        "7.1.2": "https://downloads.wordpress.org/plugin/directorist.7.1.2.zip",
        "7.10.0": "https://downloads.wordpress.org/plugin/directorist.7.10.0.zip",
        "7.10.1": "https://downloads.wordpress.org/plugin/directorist.7.10.1.zip",
        "7.10.2": "https://downloads.wordpress.org/plugin/directorist.7.10.2.zip",
        "7.10.3": "https://downloads.wordpress.org/plugin/directorist.7.10.3.zip",
        "7.11.0": "https://downloads.wordpress.org/plugin/directorist.7.11.0.zip",
        "7.2.0": "https://downloads.wordpress.org/plugin/directorist.7.2.0.zip",
        "7.2.1": "https://downloads.wordpress.org/plugin/directorist.7.2.1.zip",
        "7.2.2": "https://downloads.wordpress.org/plugin/directorist.7.2.2.zip",
        "7.2.3": "https://downloads.wordpress.org/plugin/directorist.7.2.3.zip",
        "7.3.0": "https://downloads.wordpress.org/plugin/directorist.7.3.0.zip",
        "7.3.1": "https://downloads.wordpress.org/plugin/directorist.7.3.1.zip",
        "7.3.1.1": "https://downloads.wordpress.org/plugin/directorist.7.3.1.1.zip",
        "7.3.1.2": "https://downloads.wordpress.org/plugin/directorist.7.3.1.2.zip",
        "7.3.2": "https://downloads.wordpress.org/plugin/directorist.7.3.2.zip",
        "7.3.3": "https://downloads.wordpress.org/plugin/directorist.7.3.3.zip",
        "7.3.4": "https://downloads.wordpress.org/plugin/directorist.7.3.4.zip",
        "7.4.0": "https://downloads.wordpress.org/plugin/directorist.7.4.0.zip",
        "7.4.1": "https://downloads.wordpress.org/plugin/directorist.7.4.1.zip",
        "7.4.1.1": "https://downloads.wordpress.org/plugin/directorist.7.4.1.1.zip",
        "7.4.2": "https://downloads.wordpress.org/plugin/directorist.7.4.2.zip",
        "7.4.2.1": "https://downloads.wordpress.org/plugin/directorist.7.4.2.1.zip",
        "7.4.2.2": "https://downloads.wordpress.org/plugin/directorist.7.4.2.2.zip",
        "7.4.3": "https://downloads.wordpress.org/plugin/directorist.7.4.3.zip",
        "7.4.4": "https://downloads.wordpress.org/plugin/directorist.7.4.4.zip",
        "7.4.5": "https://downloads.wordpress.org/plugin/directorist.7.4.5.zip",
        "7.4.6": "https://downloads.wordpress.org/plugin/directorist.7.4.6.zip",
        "7.5.0": "https://downloads.wordpress.org/plugin/directorist.7.5.0.zip",
        "7.5.1": "https://downloads.wordpress.org/plugin/directorist.7.5.1.zip",
        "7.5.2": "https://downloads.wordpress.org/plugin/directorist.7.5.2.zip",
        "7.5.3": "https://downloads.wordpress.org/plugin/directorist.7.5.3.zip",
        "7.5.4": "https://downloads.wordpress.org/plugin/directorist.7.5.4.zip",
        "7.5.5": "https://downloads.wordpress.org/plugin/directorist.7.5.5.zip",
        "7.6.0": "https://downloads.wordpress.org/plugin/directorist.7.6.0.zip",
        "7.6.1": "https://downloads.wordpress.org/plugin/directorist.7.6.1.zip",
        "7.6.2": "https://downloads.wordpress.org/plugin/directorist.7.6.2.zip",
        "7.7.0": "https://downloads.wordpress.org/plugin/directorist.7.7.0.zip",
        "7.7.1": "https://downloads.wordpress.org/plugin/directorist.7.7.1.zip",
        "7.7.2": "https://downloads.wordpress.org/plugin/directorist.7.7.2.zip",
        "7.7.3": "https://downloads.wordpress.org/plugin/directorist.7.7.3.zip",
        "7.7.4": "https://downloads.wordpress.org/plugin/directorist.7.7.4.zip",
        "7.8.0": "https://downloads.wordpress.org/plugin/directorist.7.8.0.zip",
        "7.8.1": "https://downloads.wordpress.org/plugin/directorist.7.8.1.zip",
        "7.8.2": "https://downloads.wordpress.org/plugin/directorist.7.8.2.zip",
        "7.8.3": "https://downloads.wordpress.org/plugin/directorist.7.8.3.zip",
        "7.8.4": "https://downloads.wordpress.org/plugin/directorist.7.8.4.zip",
        "7.8.5": "https://downloads.wordpress.org/plugin/directorist.7.8.5.zip",
        "7.8.6": "https://downloads.wordpress.org/plugin/directorist.7.8.6.zip",
        "7.9.0": "https://downloads.wordpress.org/plugin/directorist.7.9.0.zip",
        "release7.10.0": "https://downloads.wordpress.org/plugin/directorist.release7.10.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/directorist.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://directorist.com/extensions/",
    "banners": {
        "low": "https://ps.w.org/directorist/assets/banner-772x250.jpg?rev=3111016",
        "high": "https://ps.w.org/directorist/assets/banner-1544x500.jpg?rev=3111016"
    },
    "icons": {
        "1x": "https://ps.w.org/directorist/assets/icon-128x128.gif?rev=3111016",
        "2x": "https://ps.w.org/directorist/assets/icon-256x256.gif?rev=3111016"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 94,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/directorist/blueprint.json?rev=3136903"
        }
    ],
    "preview_link": "https://wordpress.org/plugins/directorist/?preview=1",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "directorist",
            "language": "es_ES",
            "version": "7.11.0",
            "updated": "2024-04-02 06:45:50",
            "package": "https://downloads.wordpress.org/translation/plugin/directorist/7.11.0/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "directorist",
            "language": "es_CO",
            "version": "7.11.0",
            "updated": "2024-06-10 03:36:45",
            "package": "https://downloads.wordpress.org/translation/plugin/directorist/7.11.0/es_CO.zip"
        },
        {
            "type": "plugin",
            "slug": "directorist",
            "language": "nl_NL",
            "version": "7.11.0",
            "updated": "2024-06-24 21:25:44",
            "package": "https://downloads.wordpress.org/translation/plugin/directorist/7.11.0/nl_NL.zip"
        }
    ]
}