{
    "name": "Duzz Portal &#8211; Stripe Custom Customer Payments",
    "slug": "duzz-custom-portal",
    "version": "1.2.1",
    "author": "<a href=\"https://duzzportal.com/about-us/\">Streater Kelley</a>",
    "author_profile": "https://profiles.wordpress.org/streater3000/",
    "contributors": {
        "streater3000": {
            "profile": "https://profiles.wordpress.org/streater3000/",
            "avatar": "https://secure.gravatar.com/avatar/812603e90f106473bbaa0b59f16f95a0?s=96&d=monsterid&r=g",
            "display_name": "Streater Kelley"
        },
        "dannycooper": {
            "profile": "https://profiles.wordpress.org/dannycooper/",
            "avatar": "https://secure.gravatar.com/avatar/2260398601fbc394af0089ad47721b58?s=96&d=monsterid&r=g",
            "display_name": "DannyCooper"
        }
    },
    "requires": "5.7",
    "tested": "6.4.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/duzz-custom-portal/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 10,
    "downloaded": 1353,
    "last_updated": "2024-07-15 9:39pm GMT",
    "added": "2023-11-28",
    "homepage": "https://duzzportal.com",
    "sections": {
        "description": "<p>Let your contact form work for you! Now when your potential customers submit a contact form, it will redirect to their portal page where you can start working for them.</p>\n<p><a href=\"https://duzzportal.com/\" rel=\"nofollow ugc\">Duzz Custom Portal </a> is designed to help small service-based businesses dynamically interact with their customers right from their website. Our Stripe payments integration does what no other plugin can do: make customized payments on a project by project basis.</p>\n<p>Let your website work for you. Engage in real-time chats, foster stronger customer relationships, and enhance your revenue potential, all in one unified platform. With Duzz Custom Portal, you&#8217;re not just waiting around for contact form inquiries – you&#8217;re proactively reaching out, and most importantly, offering a payment flexibility that no other plugin currently offers.</p>\n<p>Distinctively standing apart from other Stripe-integrated platforms, Duzz Custom Portal pioneers a dynamic payment system. Instead of restricting businesses to fixed product prices or generic donation sums, our portal is the first of its kind to empower businesses with per-project invoicing. Tailor your charges, adding line items for every project facet, and presenting your clients with a clear, customized invoice.</p>\n<p>This powerful, highly customizable plugin comes ready to use out of the box, transforming your website from a static display into a customer outreach and connection tool.</p>\n<p><a href=\"https://youtu.be/82_qGgxGiqU\" rel=\"nofollow ugc\">How to Use the Portal Tutorial </a></p>\n<p><strong>Features</strong></p>\n<ul>\n<li>Stripe payments integration</li>\n<li>Status Feed for customers to track their project progress like tracking a FedEx Package</li>\n<li>Progress Bar showing each stage as the project progresses</li>\n<li>Data connections between Advanced Custom Fields (ACF) and WPForms</li>\n<li>Tag customers in the feed to send them email updates</li>\n<li>Invite customers to the project</li>\n<li>Bot updates when project is updated</li>\n<li>Auto welcome message for website visitors</li>\n</ul>\n<p><strong>Security</strong><br />\nDuzz Custom Portal operates on a zero trust system, so your customers aren&#8217;t logging into the WordPress backend, which could be a security vulnerability. Customers don&#8217;t create an account or password, a factor that often leads to a 30% loss in sales as customers don&#8217;t want to create an account. Instead, they get a unique tracking number and link, just like a FedEx Package. The plugin is designed to allow the addition of a password system if needed in the future.</p>\n<p>For security purposes, limited data is included on the page your customers view. But it is possible to update the code if you know PHP so that fields and data are viewable by the customer. That’s not currently included in the plugin. Duzz is only as secure as your hosting provider and WordPress security plugins. Avoid storing sensitive customer information. Do not collect social security numbers or other personal ID numbers.</p>\n<p><strong>Requirements</strong></p>\n<p>While Duzz Custom Portal works out of the box, for full functionality, we suggest the following:<br />\n&#8211; Advanced Custom Fields (ACF) basic version from WordPress repository<br />\n&#8211; WPForms basic for simple fields for Name and Email<br />\n&#8211; WPForms Plus for fancy fields that allow full Duzz functionality<br />\n&#8211; Hosting provider should allow PHP emails as Duzz does not currently use SMTP. -Hosting provider that allows you to turn off server side caching.</p>\n<h3>WEB HOSTING REQUIREMENTS</h3>\n<p>Because of these extra requirements for Duzz Custom Portal, many hosting providers might not be compatible. Your site will become more dynamic and increase the usage the CPU usage of your site as your site will get more usage with all the customer interactions.</p>\n<p>The main issue though is that since Duzz Custom Portal makes your site more dynamic and interactive, any hosting provider with heavy server side caching could prevent customer pages from updating. Avoid GoDaddy Managed WordPress as they have the most heavy server side caching. GoDaddy Managed WordPress does not allow you to turn off server side caching.</p>\n<p>We recommend Siteground as they allow you to turn off server side caching with their SG Optimizer plugin. They also allow for 300 PHP emails per hour. And they are recommended for security purposes.</p>\n<p>If you plan to use Siteground, support us with our REFERRAL LINK:<br />\n<a href=\"https://www.siteground.com/index.htm?afcode=5140527bb15b2e0193acb4f4b6051009\" rel=\"nofollow ugc\">Click here for our referral</a></p>\n<h3>External Libraries</h3>\n<p>This plugin utilizes Composer for dependency management, which means an autoloader is in place for handling PHP classes and libraries. If you&#8217;re a developer wanting to understand the structure or extend the functionality, be aware of this setup.</p>\n<p><strong>Composer</strong>:<br />\n&#8211; Used For: Dependency management for PHP.<br />\n&#8211; Source: <a href=\"https://getcomposer.org/\" rel=\"nofollow ugc\">https://getcomposer.org/</a><br />\n&#8211; Autoloader Path: <code>duzz-custom-portal/vendor/autoload.php</code></p>\n<p><strong>Featherlight</strong>:<br />\n&#8211; Used For: Lightweight jQuery lightbox.<br />\n&#8211; Source: <a href=\"https://github.com/noelboss/featherlight\" rel=\"nofollow ugc\">https://github.com/noelboss/featherlight</a><br />\n&#8211; Included Version: <code>duzz-custom-portal/js/featherlight.js</code></p>\n<p><strong>Stripe</strong>:<br />\n&#8211; Used For: Handling online payments.<br />\n&#8211; Source: <a href=\"https://github.com/stripe/stripe-php\" rel=\"nofollow ugc\">https://github.com/stripe/stripe-php</a><br />\n&#8211; Included Version: <code>duzz-custom-portal/vendor/stripe/stripe-php</code></p>\n<p><strong>Select2</strong>:<br />\n&#8211; Used For: Making long dropdowns more user-friendly.<br />\n&#8211; Source: <a href=\"https://github.com/select2/select2\" rel=\"nofollow ugc\">https://github.com/select2/select2</a><br />\n&#8211; Included Version: <code>duzz-custom-portal/vendor/select2/select2</code></p>\n<p>Feel free to review the original, non-altered source on the provided links. These libraries are included in this plugin in good faith, with the intention of enhancing functionality, and all rights and credits belong to their respective authors.</p>\n<h3>Third-Party Service Integration</h3>\n<p><strong>Stripe</strong></p>\n<p>Our plugin integrates with Stripe to provide enhanced payment functionalities. This means that some data might be transmitted to Stripe&#8217;s servers when using the payment features of our plugin.</p>\n<p><em>Service Provider:</em> Stripe</p>\n<p><em>Service Link:</em> <a href=\"https://stripe.com/\" rel=\"nofollow ugc\">Stripe</a></p>\n<p><em>Purpose of Integration:</em> Our plugin uses Stripe to handle payments and payment-related functionalities, ensuring secure and efficient transactions for users.</p>\n<p><em>Data Shared:</em> The plugin sends payment-related data, such as transaction details and card information, to Stripe. No personal data is stored by our plugin; all sensitive data is handled by Stripe directly.</p>\n<p><em>Terms of Use:</em> You can review Stripe&#8217;s terms of service <a href=\"https://stripe.com/legal\" rel=\"nofollow ugc\">here</a>.</p>\n<p><em>Privacy Policy:</em> For more details on how Stripe handles your data, please refer to their privacy policy <a href=\"https://stripe.com/privacy\" rel=\"nofollow ugc\">here</a>.</p>\n<p>We encourage all users to review Stripe&#8217;s terms and privacy policy to fully understand how your data is used and protected. By using the payment features of our plugin, you agree to Stripe&#8217;s terms of service and privacy policy.</p>\n<h3>Legal &amp; Security Notice Regarding Stripe Integration</h3>\n<p><strong>Integration Permission:</strong></p>\n<p>Stripe provides a robust API and encourages developers to integrate its services with their applications, plugins, or platforms. Our integration with Stripe in the Duzz Custom Portal plugin is based on the permissions and guidelines provided by Stripe for such integrations.</p>\n<p><strong>No Direct Association with Stripe:</strong></p>\n<p>While we have integrated Stripe&#8217;s services into our plugin for enhanced payment functionalities, it&#8217;s essential to clarify that we have no direct association, partnership, or endorsement from Stripe. Any questions, concerns, or issues related to Stripe&#8217;s services should be directed to Stripe&#8217;s official support channels.</p>\n<p><strong>Security Assurance:</strong></p>\n<p>Stripe is known for its rigorous security standards, and we&#8217;re committed to adhering to them. Here&#8217;s how we ensure the security of your transactions:</p>\n<ol>\n<li>\n<p><strong>Credit Card Information:</strong> At no point does our plugin or any component of your WordPress site store credit card details. When a user inputs their credit card information, it&#8217;s directly processed by Stripe. This ensures the highest level of security, as all sensitive data is managed directly by Stripe, which employs state-of-the-art security measures.</p>\n</li>\n<li>\n<p><strong>Compliance with Stripe&#8217;s Security Guidelines:</strong> Our integration with Stripe strictly follows their security guidelines. This means that any updates or security practices recommended by Stripe are implemented in our plugin to ensure consistent security.</p>\n</li>\n<li>\n<p><strong>Data Handling:</strong> While our plugin facilitates the payment process, all the crucial transaction data and processing are handled directly by Stripe. This means that we do not have access to sensitive transaction details, adding an additional layer of privacy and security for the end-users.</p>\n</li>\n</ol>\n<p>We always encourage users and administrators to keep plugins updated and periodically review and ensure the security of their website.</p>\n",
        "installation": "<p>Watch an installation tutorial video here:<br />\n<a href=\"https://www.youtube.com/watch?v=uzneAjUN_dY\" rel=\"nofollow ugc\">How to install</a></p>\n<p>And you can find the full documentation here:<br />\n<a href=\"https://duzzportal.com/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<p>The instructions below have since been updated</p>\n<p><strong>STEP BY STEP INSTALLATION INSTRUCTIONS</strong></p>\n<ol>\n<li>Install Duzz. You’ll click Install and then Activate.</li>\n<li>Once you click Activate, be patient as it takes about 10-20 seconds to activate.</li>\n<li>Go to the Duzz Portal settings tab in the admin dashboard to view the main settings page which is just called ‘Duzz Portal’.</li>\n<li>You’ll notice a few different settings sections on this page. First is ‘List Projects’ where you choose which columns you’ll want to display when viewing your projects list. The default choices are‘customer_email’, ‘website’, and ‘customer_name’. You can select any data you want to change the columns. <strong><em>NOTE: You may notice I have prevented some choices such as &#8216;customer_address&#8217; in the table for formatting and technical purposes. But you&#8217;ll be able to edit these when you view an individual project.</em></strong></li>\n<li>In the Email Settings section, add your business email, your name, and company name. This affects auto messages and auto emails that Duzz uses so make sure that is updated before use.</li>\n<li>Next, in the Welcome Message textarea box, create a welcome message for your customers. This will display in the feed when a site visitor creates a project so you instantly connect with them. Don’t write Hi to start it off because the auto message already says ‘Hi {customer_name}’ when they create a project.</li>\n<li>Finally, the Project Page sections allows you to choose which data and fields to display on the admin view when viewing a customer project. Main Data should be the data you want to identify your project by. While it allows you to choose up to 4 for each of these, Main Data should only have one selection. If you have four selections for Main Data it won’t look good on the page. So add any other data you want to display in Header Data. Then the last three fields: Info Tab Fields, Updates Tab Fields and Funds Tab Fields you are selecting which fields you can edit data in. These fields are added to each tab. </li>\n<li>Click ‘Save Changes’.</li>\n<li>Now you are ready.</li>\n</ol>\n<p><strong>INSTRUCTIONS TO START USING DUZZ</strong></p>\n<ol>\n<li>\n<p>Now if you are ready to create a test project, go to Duzz Workspace by clicking Duzz Workspace on the WordPress admin top menu bar. You&#8217;ll see a table with fields at the top for adding &#8216;Projects&#8217;. Enter information for a client and click &#8216;Add&#8217;. If you enter an email for a client, this will not send them any emails until you later invite them.</p>\n</li>\n<li>\n<p>Once the project is added, you&#8217;ll notice there is a column that says the project is &#8216;new&#8217;. These are automatic status updates that only work if ACF is installed according to the ACF instructions below.</p>\n</li>\n<li>\n<p>Click on the project. You’ll then be able to view that project. You can click Invite at the top of the page if you are ready to invite your client to view the project.</p>\n</li>\n<li>\n<p>Review the project data first. You can type comments/messages into the feed and add to the feed. And update any fields.</p>\n</li>\n<li>\n<p>When you post a message in the feed, a client will only receive email updates if they have been invited.</p>\n</li>\n<li>\n<p>If you go to the &#8216;Funds&#8217; section, you&#8217;ll be able to create an estimate with line items. You&#8217;ll notice as you enter data here it automatically calculates the costs and totals. The price is per unit, so add the number of units, and it will calculate the total.</p>\n</li>\n<li>\n<p>When you click to send the Estimate, it will not email this to the client. It will just post it to the feed. So tag the customer in a new comment message if you want to update them. You can update the estimate too. And when your project is finished, you can change it to an invoice.</p>\n</li>\n<li>\n<p>When you change the estimate to an invoice, it will add a button to the invoice that your customers can click to make a payment. Once your client makes the payment, it will note that in the feed and you&#8217;ll no longer be able to update the funds tab.</p>\n</li>\n<li>\n<p>Now if your project is complete and Advanced Custom Fields is installed, update the &#8216;project_status&#8217; to the final stage which should be &#8216;Completed&#8217; and update the &#8216;approved_status&#8217; to No, Closed &#8211; Lost, or Closed &#8211; Won and the project will be archived.</p>\n</li>\n<li>\n<p>You can view all archived projects in the archive tab on the Duzz Workspace sidebar.</p>\n</li>\n</ol>\n<p><strong>INSTRUCTIONS TO SYNC WITH ACF</strong></p>\n<p>Duzz Custom Portal works out of the box without Advanced Custom Fields, but we recommend integration for full capabilities that allow for a progress bar and project status.</p>\n<p>Here are the steps to integrate.</p>\n<ol>\n<li>\n<p>You can have the ACF installed before or after Duzz is installed. But once they are both installed, go to the Duzz Portal settings and go to ACF Keys.</p>\n</li>\n<li>\n<p>You&#8217;ll notice it says &#8216;Error: Duplicate field number found.&#8217; Below all the fields. This is because all the fields are installed as empty, so it would give a duplication error.</p>\n</li>\n<li>\n<p>Now scroll to the bottom and look for &#8216;Generate ACF Keys&#8217; and click &#8216;Generate&#8217; which will generate random unique ACF keys for each field.</p>\n</li>\n<li>\n<p>Now go to the very bottom and click &#8216;Save&#8217; and this will save all your keys to ACF.</p>\n</li>\n<li>\n<p>Now go to your ACF plugin and you&#8217;ll notice it created the &#8216;Duzz Fields&#8217; group with all your saved keys.</p>\n</li>\n<li>\n<p>If you want to change any fields from the ones added automatically by Duzz to ACF, in ACF you&#8217;ll have to get the ACF &#8216;Field Keys&#8217;. Go to ACF and click on the field group where you are adding a field, click Screen Options at the top and then check &#8216;Field Keys&#8217;. Now it will display a new column with all the keys. This is how you link ACF fields to Duzz fields. Then copy those keys and go to the Duzz settings &#8216;ACF Keys&#8217; tab and paste that key into any field. Currently you can&#8217;t add new fields in Duzz here so pick one you aren&#8217;t using if you need to, or contact us for an update.</p>\n</li>\n<li>\n<p>There are two ACF fields that Duzz is dependent on. The progress bar operates using the ‘project_status’ field and then &#8216;approved_status&#8217;. These features do not work without ACF but Duzz will continue to function otherwise and you won&#8217;t notice these features are missing either.</p>\n</li>\n<li>\n<p>Do make &#8216;approved_status&#8217; work, go back to ACF fields list in the My Group list. First, look for the field name ‘approved_status’. Click to edit ‘approved_status’ and then switch the field type to ‘Select’ and copy these four selections below:<br />\nUnder Review<br />\nYes<br />\nNo<br />\nClosed &#8211; Lost<br />\nClosed &#8211; Won<br />\nAnd add paste these into Choices.</p>\n</li>\n<li>\n<p>Then to make the progress bar work, find the field name ‘project_status’ and click edit. You will also switch this field type to ‘Select’. This field controls your progress bar on customer project pages. If this is not updated, the progress bar will show an error. Unlike ‘approved_status’ though, you can customize ‘project_status’ a little more. You’ll be adding the steps in your process here. But you can add as many steps as you want. You should have 2 at the minimum. You can name your steps however you like. But it needs to be formatted like this: (number)(colon)(space)(name) so that it looks like this:<br />\n1: Welcome<br />\n2: Consultation<br />\n3: Working<br />\n4: Done<br />\n5: Payment<br />\n6: Completed<br />\nCopy and paste this into Choices if you want for guidance.</p>\n</li>\n<li>\n<p>Now on the main Duzz settings page, in the section Acf Group, this is optional you can leave it as is if you don’t want to use. But if you want the bot to update the status feed when you update fields, you’ll need to get the ACF group name. If you go to ACF and hover over the group name, at the bottom of your browser, you’ll see a URL popup in tiny text. Inside it will say post= and whatever that number is, is the group number. Add this group number to the ACF Group ID 1 field in Duzz Settings.</p>\n</li>\n<li>\n<p>If there is a field you do not want added by the bot by the status feed, create a new ACF group and move a field to it and don’t include that group number in the Duzz settings Acf Group. As you begin to use Duzz you’ll probably see Bot messages you don’t want added, you can do it like that. Step 21 shows an alternative.</p>\n</li>\n<li>\n<p>So alternatively, in the Remove Keys section in the Duzz Portal settings, you can add field keys from ACF that you do not want added by the Bot to the Duzz feed. This is easier if you only have a few fields you don’t want the Bot to update.</p>\n</li>\n</ol>\n<p><strong>INSTRUCTIONS TO SYNC WITH WPForms</strong></p>\n<ol>\n<li>\n<p>You&#8217;ll want to install WPForms if you want customers who visit your site to create a project themselves. Otherwise you&#8217;ll have to create a project in the Duzz Workspace table and then invite your customers.</p>\n</li>\n<li>\n<p>You can also create a more detailed admin form if the table fields are not enough when you create a project. On the Duzz Workspace page, if you created all the settings properly, you should see the sidebar menu with the ‘add project’ button. This will take you to the admin WP Form to create a project. Once you add it, it will redirect you back to Duzz Workspace where it will list all the projects.</p>\n</li>\n<li>\n<p>Once WPForms is installed, create two forms in WPForms. One for your site visitors which should be named something like Clients Form. And then another form for you, the admin. The form number is displayed in the shortcode. For example: [wpforms id=&#8221;9959”]. Now you will take that id “9959” or whatever it is, and go to the Duzz Portal tab at the top of the admin sidebar.</p>\n</li>\n<li>\n<p>You’ll notice that there are two sub-menus: WPForms Client and WPForms Admin. At the top of each of those pages, there is a field ‘form_id’. You’ll paste your WPForms form ids in there. This is how you’ll connect WPForms to Duzz. If there are any problems with accessing a WP Form on the front end or a form submitting info to create a project, you may have made a mistake in connecting your forms here.</p>\n</li>\n<li>\n<p>Each WPForms field within a form also has an ID. If you click on each field you’ve added to your forms, you’ll see each field ID. You’ll add each of these field IDs to connect the fields to Duzz in the WPForms Client and WPForms Admin submenus. Again, if you have the Plus version of WPForms, you can save some time by going to our website and requesting a a forms file you can upload that will automatically add fields with the default field numbers already added.</p>\n</li>\n<li>\n<p>Click Save Changes for each submenu page to save your field numbers whether you did it manually or uploaded our pre-created form.</p>\n</li>\n</ol>\n<p><strong>INSTRUCTIONS TO SYNC WITH STRIPE</strong></p>\n<p>Our plugin offers a seamless integration with Stripe for improved payment functionalities. To integrate Stripe with the Duzz Custom Portal plugin, follow these steps:</p>\n<ol>\n<li>\n<p>Access the Duzz Custom Portal Admin Menu:<br />\nNavigate to your WordPress dashboard.<br />\nClick on the &#8220;Duzz Custom Portal&#8221; option in the admin menu.</p>\n</li>\n<li>\n<p>Navigate to the Stripe Keys Tab:<br />\nWithin the Duzz Custom Portal menu, select the &#8220;Stripe Keys&#8221; tab.</p>\n</li>\n<li>\n<p>Configuring Live Keys:<br />\n<strong>API Secret Key Live:</strong><br />\nVisit your Stripe Dashboard to retrieve your live API secret key.<br />\nCopy this key and paste it into the &#8220;API Secret Key Live&#8221; field in the &#8220;Stripe Keys&#8221; metabox.<br />\n<strong>API Publishable Key Live:</strong><br />\nIn your Stripe Dashboard, find the live API publishable key.<br />\nCopy and paste it into the &#8220;API Publishable Key Live&#8221; field in the &#8220;Stripe Keys&#8221; metabox.</p>\n</li>\n<li>\n<p>Configuring Stripe Testing (Optional):<br />\n<strong>Toggle Testing:</strong><br />\nLocate the metabox with the testing toggle in the &#8220;Stripe Keys&#8221; tab.<br />\nTurn testing &#8220;On&#8221; if you wish to use Stripe&#8217;s testing environment. By default, this is set to &#8220;Off&#8221;.<br />\n<strong>API Secret Key Test:</strong><br />\nIn your Stripe Dashboard, locate your test API secret key.<br />\nCopy this key and paste it into the &#8220;API Secret Key Test&#8221; field in the &#8220;Stripe Test&#8221; metabox.<br />\n<strong>API Publishable Key Test:</strong><br />\nIn your Stripe Dashboard, locate the test API publishable key.<br />\nCopy and paste it into the &#8220;API Publishable Key Test&#8221; field in the &#8220;Stripe Test&#8221; metabox.</p>\n</li>\n<li>\n<p>Save Changes:<br />\nEnsure all changes are saved to finalize the Stripe integration with the Duzz Custom Portal plugin.</p>\n</li>\n</ol>\n<p>By completing these steps, you&#8217;ve successfully set up Stripe integration with the Duzz Custom Portal plugin. This allows you to manage payments efficiently and offer a superior user experience.</p>\n<p><strong>Stripe Integration Guide: Advanced Features</strong></p>\n<p><strong>Sending an invoice to customers for a Stripe payment</strong></p>\n<p>To facilitate payments via Stripe, it&#8217;s essential to send your customers an invoice. Here&#8217;s a step-by-step guide on how to do this using Duzz Custom Portal:</p>\n<ol>\n<li>\n<p>Prerequisites:<br />\nA WordPress post type of &#8220;Project&#8221; (a custom post type created by the Duzz Custom Portal) must exist for a customer. This post type should also have an associated &#8220;project_id&#8221;.</p>\n</li>\n<li>\n<p>Accessing Project Details:<br />\nNavigate to the Duzz Workspace in your dashboard.<br />\nClick on the desired project from the list to view its details.</p>\n</li>\n<li>\n<p>Navigating to Funds Tab:<br />\nInside the project details, you will notice three tabs.<br />\nClick on the &#8220;Funds&#8221; tab.</p>\n</li>\n<li>\n<p>Creating an Estimate or Invoice:<br />\nUnder the &#8220;Funds&#8221; tab, look for the dropdown select titled &#8220;type&#8221;.<br />\nChoose either &#8220;Estimate&#8221; or &#8220;Invoice&#8221; based on your preference.<br />\n<strong>Note:</strong> It&#8217;s recommended to initially create an &#8220;Estimate&#8221; to send to your customers for approval. Once approved, you can convert this &#8220;Estimate&#8221; into an &#8220;Invoice&#8221;. Alternatively, you can directly create an &#8220;Invoice&#8221;.<br />\nThe appearance of both &#8220;Estimate&#8221; and &#8220;Invoice&#8221; is similar to the customer. However, the &#8220;Invoice&#8221; has a crucial &#8220;Pay Now&#8221; button.</p>\n</li>\n<li>\n<p>Customer Payment:<br />\nWhen the customer clicks the &#8220;Pay Now&#8221; button on an Invoice, a popup will appear.<br />\nThe popup provides fields for the customer to enter their credit card details.<br />\n<strong>Important:</strong> Credit card information is not stored on your website or within the Duzz Custom Portal. All transactions strictly adhere to Stripe&#8217;s guidelines, ensuring the utmost security and reliability. Stripe manages the entire transaction process.</p>\n</li>\n<li>\n<p>Payment Notification:<br />\nUpon a successful payment, your Stripe account will reflect the transaction.<br />\nStripe sends a payment notification to the Duzz Custom Portal. This notification indicates a payment has been made, but it only displays the amount you entered in your Estimate/Invoice. Duzz or your website will not receive any other transaction details from Stripe.</p>\n</li>\n</ol>\n<p><strong>Creating and Managing a Stripe Account</strong></p>\n<p>If you don&#8217;t have a Stripe account yet, you&#8217;ll need one to  &hellip;</p>\n",
        "faq": "\n<dt id='does%20this%20plugin%20require%20any%20additional%20plugins%3F'>\nDoes this plugin require any additional plugins?\n</h4>\n<p>\n<p>No, this plugin works out of the box but works best with WPForms and Advanced Custom Fields (ACF). When the plugin is installed, it automatically creates ACF fields if ACF is already installed.</p>\n</p>\n<dt id='do%20i%20need%20the%20pro%20versions%20of%20these%20plugins%3F'>\nDo I need the Pro versions of these plugins?\n</h4>\n<p>\n<p>Only if you need the advanced capabilities of these plugins. Duzz works with the basic versions from the WordPress repository.</p>\n</p>\n<dt id='what%20kind%20of%20forms%20should%20i%20add%20in%20wpforms%3F'>\nWhat kind of forms should I add in WPForms?\n</h4>\n<p>\n<p>Once Duzz Custom Portal is installed, you should add two forms within WPForms &#8211; one for customers to create a project, and one for you to create a project.</p>\n</p>\n<dt id='duzz%20creates%20acf%20fields%20on%20installation%20but%20does%20it%20create%20wpforms%20on%20installation%3F'>\nDuzz creates ACF fields on installation but does it create WPForms on installation?\n</h4>\n<p>\n<p>WPForms backend makes it much more difficult to programmatically add forms and fields on plugin activation. You will either have to add the forms and fields manually. However, the WPForms Plus version does allow you to transfer forms and fields created from one site to another. If you go to our website, we have a WPForms file we can send you for free upon request and you can upload it to your site. It adds 2 forms, one for the customer and one for the admin that were created to atomically integrate with the Duzz Plugin so it can save you some time.</p>\n</p>\n<dt id='can%20i%20create%20accounts%20for%20my%20employees%3F'>\nCan I create accounts for my employees?\n</h4>\n<p>\n<p>Duzz basic from the WordPress repository creates only one employee type called &#8216;duzz_admin&#8217; that has full capabilities with no restrictions. So be careful who you trust to add to this. We want to give you everything we can for free and make it open source. However, this is a basic version of Duzz which does not include other employee types. You could add multiple ‘administrators’ or &#8216;duzz_admin&#8217; but this is not recommended for security purposes.</p>\n</p>\n<dt id='is%20this%20just%20a%20chatbot%3F'>\nIs this just a chatbot?\n</h4>\n<p>\n<p>No, chatbots aren’t good at keeping the conversation going after a conversation is finished. They are only really useful for urgent one time conversations. Duzz is more for connecting after a contact form has been submitted and to keep a customer updated over time. I have experimented with integrating with Intercom on my site which allows for both types of conversations, but I am not currently using Intercom and will only offer the integration if there is interest.</p>\n</p>\n<dt id='do%20you%20have%20any%20other%20integrations%3F'>\nDo you have any other integrations?\n</h4>\n<p>\n<p>We plan to offer many integrations. Some have been tested. But our first offering we are keeping it simple to see what users want. We created a very modular approach on the backend with the code so it should be fairly easy to add anything.</p>\n<p>We are focused on creating the best customer interactive software available: the perfect WordPress Customer Portal. We will add features based on demand but we really want to open it up to other WordPress developers to add their features so we can focus on the core product. We want to hear from you though as we navigate the direction going forward.</p>\n</p>\n<dt id='why%20is%20the%20duzz%20workspace%20on%20the%20front%20end%20pages%20and%20not%20the%20backend%20wordpress%20admin%20pages%3F'>\nWhy is the Duzz Workspace on the front end pages and not the backend WordPress admin pages?\n</h4>\n<p>\n<p>For a few reasons. First, the customer facing page has a similar URL so that you can change the URL to see what they see. It is not possible to link to the customer pages from the backend.</p>\n<p>Second, in the future if you decide to add our multi-role / user add-on, your employees won&#8217;t have access to your WordPress backend with a password-less zero trust system. So why not just have the same visual they will have so you know what you are getting?</p>\n</p>\n<dt id='will%20duzz%20only%20support%20a%20password-less%20system%3F'>\nWill Duzz only support a password-less system?\n</h4>\n<p>\n<p>No, it would be very easy to add passwords for Duzz customer and employee accounts. The original system was built with login passwords. But this opens your site up to security vulnerabilities with users using the same login system as your admin backend. We believe our password-less system is more secure. We recommend a hosting provider that has a proven security record. Customers also don&#8217;t like creating accounts. Think about how much easier a FedEx tracking number is. Now you&#8217;ll have the same type of project tracking system.</p>\n</p>\n<dt id='can%20customers%20view%20these%20admin%20pages%3F'>\nCan customers view these admin pages?\n</h4>\n<p>\n<p>No, they are password protected and redirect to the login page. However, make sure to remove the pages from the site index with an SEO plugin.</p>\n</p>\n<dt id='is%20duzz%20mobile%20friendly%3F'>\nIs Duzz mobile friendly?\n</h4>\n<p>\n<p>Yes, we designed it for all devices. It has a mobile view for you and your customers.</p>\n</p>\n\n",
        "changelog": "<h4>1.2.1 &#8211; 2024-02-12</h4>\n<ul>\n<li>duzz_add_custom_post in Duzz_Processes updated</li>\n<li>filters added to duzz_list_posts_table in Duzz_List_Factory</li>\n<li>hidden fields added to duzz_addColumn in Duzz_Table_Factory</li>\n<li>duzz_add_list_args updated in Duzz_List_Pages to allow searches that contain values</li>\n</ul>\n<h4>1.2.0 &#8211; 2024-02-12</h4>\n<ul>\n<li>Updated duzz_addChild in Duzz_Return_HTML to add hooks and filters for every HTML element throughout the plugin</li>\n<li>Updated container names to &#8216;duzz-page-content-flex-container&#8217; &#8216;duzz-outer-sidebar-container&#8217; and &#8216;duzz-outer-content-container&#8217; in Duzz_Layout</li>\n<li>Updated classes &#8216;duzz-page-content-flex-container&#8217; &#8216;duzz-outer-sidebar-container&#8217; and &#8216;duzz-outer-content-container&#8217; in Duzz_Class_Factory</li>\n</ul>\n<h4>1.1.91 &#8211; 2024-01-23</h4>\n<ul>\n<li>For some reason Duzz_List_Pages.php and Duzz_List_Factory were missing in the most recent push. They have been added back in</li>\n</ul>\n<h4>1.1.9.1 &#8211; 2024-01-23</h4>\n<ul>\n<li>For some reason Duzz_List_Pages.php and Duzz_List_Factory were missing in the most recent push. They have been added back in</li>\n</ul>\n<h4>1.1.9 &#8211; 2024-01-23</h4>\n<ul>\n<li>Fixed the Archived page by adding new Duzz_List_Pages.php file and moving Duzz_List_Factory.php to the Factory folder in the src/Shared/Layout folder. This solution is a return to the code before the 1.1.7 – 2024-01-11 update. But it keeps the List and Comments functionality separate which was the point of the 1.1.7 – 2024-01-11 update</li>\n<li>Updated Duzz_Layout.php to call Duzz_List_Pages instead of Duzz_List_Factory</li>\n</ul>\n<h4>1.1.8 &#8211; 2024-01-21</h4>\n<ul>\n<li>Fixed duzz_create_invoice_info_wrapper in Duzz_Send_Payment to add readonly when payment is made</li>\n<li>Updated duzz_create_invoice_totals in Duzz_Send_Payment with invoice-total-border-red styling</li>\n<li>Added styling in Duzz_Class_Factory for invoice-total-border-red</li>\n</ul>\n<h4>1.1.7 &#8211; 2024-01-11</h4>\n<ul>\n<li>Removed Duzz_Entity_List_Factory and moved functionality to Duzz_List_Factory</li>\n<li>Updated Duzz_Comment_List_Factory so it can be called directly</li>\n<li>Updated Duzz_Layout with Duzz_List_Factory replacing Duzz_Entity_List_Factory with Duzz_List_Factory and Duzz_Comment_List_Factory</li>\n</ul>\n<h4>1.1.6 &#8211; 2024-01-09</h4>\n<ul>\n<li>Updated duzz_create_table_row in Duzz_Send_Payment and script in Duzz_ProjectTabs to better format numbers with commas and dollar sign and added invoice-total-border-green-container in Duzz_Class_Factory for styling</li>\n<li>Updated duzz_check_for_payment_success in Duzz_Stripe_Checkout to format cash amounts with a dollar sign and commas for large numbers</li>\n<li>Updated stripe.js to format amount with commas for large numbers</li>\n</ul>\n<h4>1.1.5 &#8211; 2023-12-19</h4>\n<ul>\n<li>Fixed styling of customer welcome message by adding styling for p.field-customer_first_name in Duzz_Class_Factory</li>\n<li>Removed &#8216;Project List&#8217; on backend in duzz_register_project_post_type in Duzz_Base since all Project controls are within Duzz Workspace</li>\n</ul>\n<h4>1.1.5 &#8211; 2023-12-18</h4>\n<ul>\n<li>Changed duzz_client_settings to wp_forms_client_settings and duzz_admin_settings to wp_forms_admin_settings in Duzz_Admin_Menu_Items</li>\n<li>Changed DuzzClientPortal to &#8216;Duzz Portal Settings&#8217; in Duzz_Admin</li>\n<li>Removed &nbsp; in Duzz_Popup_Invite</li>\n<li>Added spacing styling to .customer-email-shortcode.left-account in Duzz_Class_Factory for the popup in Duzz_Popup_Invite</li>\n<li>Updated installation instructions in readme.txt and fixed changelog</li>\n<li>Added the TGMPA plugin activation library with the folder &#8216;tgm&#8217; in the main plugin folder</li>\n<li>Added code to duzz-custom-portal.php to customize TGMPA menu so it is displayed on the Duzz Portal admin menu</li>\n<li>Updated Duzz_Admin and duzz-custom-portal.php with the constant DUZZ_MENU_SLUG</li>\n<li>Fixed duzz_get_field_names in Duzz_Get_Data to properly retrieve data for Duzz_Processes</li>\n<li>Updated duzz_staff_add_project and duzz_customer_add_project in Duzz_Processes to add two parameters when calling duzz_get_field_names</li>\n</ul>\n<h4>1.1.3 &#8211; 2023-12-17</h4>\n<ul>\n<li>Bot email corrected in Duzz_Activation</li>\n<li>Updated styling in Duzz_Class_Factory and Duzz_ProjectTabs for the payments section to improve mobile experience and so styling works on all themes</li>\n<li>Duzz_Send_Payment updated for mobile and Duzz_ProjectTabs script updated to help do this</li>\n<li>Added new function duzz_get_saved_acf_key in Duzz_Keys that is called in Duzz_ACF_Field</li>\n<li>Fixed Duzz_Project_Update switch statement</li>\n<li>Fixed payment calculation in duzz_get_line_items in Duzz_Processes and duzz_create_invoice_line_items in Duzz_Send_Payment</li>\n<li>Fixed permalinks on activation by adding call to duzz_register_rewrite_rules in Duzz_Activation</li>\n<li>Creating new dynamic admin settings creation system in Duzz_Admin_Menu_Items which is called in Duzz_Admin which changed all options names</li>\n<li>Updated all hardcoded options names for the final time in: Duzz_ACF_Sync, Duzz_Activation, Duzz_Email, Duzz_Helpers, Duzz_Keys, Duzz_Processes, Duzz_Stripe_Checkout, Duzz_Stripe_Enqueue, Duzz_WP_Forms</li>\n</ul>\n<h4>1.1.2 &#8211; 2023-12-13</h4>\n<ul>\n<li>Updated Duzz_ACF_Sync</li>\n<li>Duzz_Admin_Settings_Sections</li>\n<li>and Duzz_Keys so that ACF keys can be generated with a button on the ACF Keys settings page in the Duzz settings</li>\n</ul>\n<h4>1.1.1 &#8211; 2023-12-08</h4>\n<ul>\n<li>Fixed admin_form_id and client_form_id data names in Duzz_Admin_Menu_Items.php so WPForms integration with portal is fixed</li>\n</ul>\n<h4>1.1.0 &#8211; 2023-12-07</h4>\n<ul>\n<li>Portal ready to use on installation without saving settings</li>\n<li>Updated Duzz_Activation.php to add duzz_save_default_connector_settings for portal settings activation</li>\n<li>Updated duzz_create_forms_connectors to change all Duzz_Forms_Connector parameters to duzz_settings</li>\n<li>Updated duzz_settings_list_data from switch statements to an array to work with new portal settings</li>\n</ul>\n<h4>1.0.80 &#8211; 2023-11-30</h4>\n<ul>\n<li>Fixes function duzz_create_invoice_line_items in Duzz_Send_Payment.php</li>\n<li>Addeed margin bottom to comment__content in Duzz_Class_Factory.php</li>\n</ul>\n<h4>1.0.79 &#8211; 2023-11-29 (First Release on WordPress Repository)</h4>\n<ul>\n<li>fixed customer_message in Duzz_Processes</li>\n<li>Fixed Duzz Admin settings backend duplicate error message HTML in Duzz_Admin_Settings_Sections and styling in Duzz_Class_Factory</li>\n</ul>\n<h4>1.0.78 – 2023-11-02</h4>\n<ul>\n<li>Added customer message by Updating Duzz_Admin_Menu_Items,Duzz_Keys, and Duzz_Processes.</li>\n<li>Duzz_ACF_Sync fixed so it doesn’t create duplicate ACF groups</li>\n</ul>\n<h4>1.0.77 – 2023-11-01</h4>\n<ul>\n<li>CSS updated.</li>\n<li>HTML/CSS classes added to Duzz_Send_Payment.php</li>\n</ul>\n<h4>1.0.76 – 2023-10-31</h4>\n<ul>\n<li>minified featherlight file removed</li>\n</ul>\n<h4>1.0.75 – 2023-10-31</h4>\n<ul>\n<li>Updated duzz_generate_invoice_table in Duzz_Processes to use Duzz_Invoice_Table to construct the invoice table.</li>\n<li>Updated Duzz_Invoice_Table to properly construct the invoice table.</li>\n<li>Updated generatePayNowButton in Duzz_Stripe_Checkout to use Duzz_Invoice_Table to construct the button.</li>\n<li>Updated button styling in Duzz_Class_Factory</li>\n</ul>\n<h4>1.0.73 – 2023-10-25</h4>\n<ul>\n<li>Added Check for existing projects in duzz_check_for_existing_project function in src/Core/Duzz_Processes.php file</li>\n<li>Fixed URL formatting with add_rewrite_rule and add_rewrite_tag in src/Shared/Layout/Duzz_Layout.php file</li>\n<li>Removed clipboard.min.js file from select2 using composer.json file.</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Initial release.</li>\n<li>Modifications based on WordPress review.</li>\n</ul>\n"
    },
    "short_description": "Instantly connect with your customers and keep the conversation going with Duzz Custom Portal.",
    "description": "<p>Let your contact form work for you! Now when your potential customers submit a contact form, it will redirect to their portal page where you can start working for them.</p>\n<p><a href=\"https://duzzportal.com/\" rel=\"nofollow ugc\">Duzz Custom Portal </a> is designed to help small service-based businesses dynamically interact with their customers right from their website. Our Stripe payments integration does what no other plugin can do: make customized payments on a project by project basis.</p>\n<p>Let your website work for you. Engage in real-time chats, foster stronger customer relationships, and enhance your revenue potential, all in one unified platform. With Duzz Custom Portal, you&#8217;re not just waiting around for contact form inquiries – you&#8217;re proactively reaching out, and most importantly, offering a payment flexibility that no other plugin currently offers.</p>\n<p>Distinctively standing apart from other Stripe-integrated platforms, Duzz Custom Portal pioneers a dynamic payment system. Instead of restricting businesses to fixed product prices or generic donation sums, our portal is the first of its kind to empower businesses with per-project invoicing. Tailor your charges, adding line items for every project facet, and presenting your clients with a clear, customized invoice.</p>\n<p>This powerful, highly customizable plugin comes ready to use out of the box, transforming your website from a static display into a customer outreach and connection tool.</p>\n<p><a href=\"https://youtu.be/82_qGgxGiqU\" rel=\"nofollow ugc\">How to Use the Portal Tutorial </a></p>\n<p><strong>Features</strong></p>\n<ul>\n<li>Stripe payments integration</li>\n<li>Status Feed for customers to track their project progress like tracking a FedEx Package</li>\n<li>Progress Bar showing each stage as the project progresses</li>\n<li>Data connections between Advanced Custom Fields (ACF) and WPForms</li>\n<li>Tag customers in the feed to send them email updates</li>\n<li>Invite customers to the project</li>\n<li>Bot updates when project is updated</li>\n<li>Auto welcome message for website visitors</li>\n</ul>\n<p><strong>Security</strong><br />\nDuzz Custom Portal operates on a zero trust system, so your customers aren&#8217;t logging into the WordPress backend, which could be a security vulnerability. Customers don&#8217;t create an account or password, a factor that often leads to a 30% loss in sales as customers don&#8217;t want to create an account. Instead, they get a unique tracking number and link, just like a FedEx Package. The plugin is designed to allow the addition of a password system if needed in the future.</p>\n<p>For security purposes, limited data is included on the page your customers view. But it is possible to update the code if you know PHP so that fields and data are viewable by the customer. That’s not currently included in the plugin. Duzz is only as secure as your hosting provider and WordPress security plugins. Avoid storing sensitive customer information. Do not collect social security numbers or other personal ID numbers.</p>\n<p><strong>Requirements</strong></p>\n<p>While Duzz Custom Portal works out of the box, for full functionality, we suggest the following:<br />\n&#8211; Advanced Custom Fields (ACF) basic version from WordPress repository<br />\n&#8211; WPForms basic for simple fields for Name and Email<br />\n&#8211; WPForms Plus for fancy fields that allow full Duzz functionality<br />\n&#8211; Hosting provider should allow PHP emails as Duzz does not currently use SMTP. -Hosting provider that allows you to turn off server side caching.</p>\n<h3>WEB HOSTING REQUIREMENTS</h3>\n<p>Because of these extra requirements for Duzz Custom Portal, many hosting providers might not be compatible. Your site will become more dynamic and increase the usage the CPU usage of your site as your site will get more usage with all the customer interactions.</p>\n<p>The main issue though is that since Duzz Custom Portal makes your site more dynamic and interactive, any hosting provider with heavy server side caching could prevent customer pages from updating. Avoid GoDaddy Managed WordPress as they have the most heavy server side caching. GoDaddy Managed WordPress does not allow you to turn off server side caching.</p>\n<p>We recommend Siteground as they allow you to turn off server side caching with their SG Optimizer plugin. They also allow for 300 PHP emails per hour. And they are recommended for security purposes.</p>\n<p>If you plan to use Siteground, support us with our REFERRAL LINK:<br />\n<a href=\"https://www.siteground.com/index.htm?afcode=5140527bb15b2e0193acb4f4b6051009\" rel=\"nofollow ugc\">Click here for our referral</a></p>\n<h3>External Libraries</h3>\n<p>This plugin utilizes Composer for dependency management, which means an autoloader is in place for handling PHP classes and libraries. If you&#8217;re a developer wanting to understand the structure or extend the functionality, be aware of this setup.</p>\n<p><strong>Composer</strong>:<br />\n&#8211; Used For: Dependency management for PHP.<br />\n&#8211; Source: <a href=\"https://getcomposer.org/\" rel=\"nofollow ugc\">https://getcomposer.org/</a><br />\n&#8211; Autoloader Path: <code>duzz-custom-portal/vendor/autoload.php</code></p>\n<p><strong>Featherlight</strong>:<br />\n&#8211; Used For: Lightweight jQuery lightbox.<br />\n&#8211; Source: <a href=\"https://github.com/noelboss/featherlight\" rel=\"nofollow ugc\">https://github.com/noelboss/featherlight</a><br />\n&#8211; Included Version: <code>duzz-custom-portal/js/featherlight.js</code></p>\n<p><strong>Stripe</strong>:<br />\n&#8211; Used For: Handling online payments.<br />\n&#8211; Source: <a href=\"https://github.com/stripe/stripe-php\" rel=\"nofollow ugc\">https://github.com/stripe/stripe-php</a><br />\n&#8211; Included Version: <code>duzz-custom-portal/vendor/stripe/stripe-php</code></p>\n<p><strong>Select2</strong>:<br />\n&#8211; Used For: Making long dropdowns more user-friendly.<br />\n&#8211; Source: <a href=\"https://github.com/select2/select2\" rel=\"nofollow ugc\">https://github.com/select2/select2</a><br />\n&#8211; Included Version: <code>duzz-custom-portal/vendor/select2/select2</code></p>\n<p>Feel free to review the original, non-altered source on the provided links. These libraries are included in this plugin in good faith, with the intention of enhancing functionality, and all rights and credits belong to their respective authors.</p>\n<h3>Third-Party Service Integration</h3>\n<p><strong>Stripe</strong></p>\n<p>Our plugin integrates with Stripe to provide enhanced payment functionalities. This means that some data might be transmitted to Stripe&#8217;s servers when using the payment features of our plugin.</p>\n<p><em>Service Provider:</em> Stripe</p>\n<p><em>Service Link:</em> <a href=\"https://stripe.com/\" rel=\"nofollow ugc\">Stripe</a></p>\n<p><em>Purpose of Integration:</em> Our plugin uses Stripe to handle payments and payment-related functionalities, ensuring secure and efficient transactions for users.</p>\n<p><em>Data Shared:</em> The plugin sends payment-related data, such as transaction details and card information, to Stripe. No personal data is stored by our plugin; all sensitive data is handled by Stripe directly.</p>\n<p><em>Terms of Use:</em> You can review Stripe&#8217;s terms of service <a href=\"https://stripe.com/legal\" rel=\"nofollow ugc\">here</a>.</p>\n<p><em>Privacy Policy:</em> For more details on how Stripe handles your data, please refer to their privacy policy <a href=\"https://stripe.com/privacy\" rel=\"nofollow ugc\">here</a>.</p>\n<p>We encourage all users to review Stripe&#8217;s terms and privacy policy to fully understand how your data is used and protected. By using the payment features of our plugin, you agree to Stripe&#8217;s terms of service and privacy policy.</p>\n<h3>Legal &amp; Security Notice Regarding Stripe Integration</h3>\n<p><strong>Integration Permission:</strong></p>\n<p>Stripe provides a robust API and encourages developers to integrate its services with their applications, plugins, or platforms. Our integration with Stripe in the Duzz Custom Portal plugin is based on the permissions and guidelines provided by Stripe for such integrations.</p>\n<p><strong>No Direct Association with Stripe:</strong></p>\n<p>While we have integrated Stripe&#8217;s services into our plugin for enhanced payment functionalities, it&#8217;s essential to clarify that we have no direct association, partnership, or endorsement from Stripe. Any questions, concerns, or issues related to Stripe&#8217;s services should be directed to Stripe&#8217;s official support channels.</p>\n<p><strong>Security Assurance:</strong></p>\n<p>Stripe is known for its rigorous security standards, and we&#8217;re committed to adhering to them. Here&#8217;s how we ensure the security of your transactions:</p>\n<ol>\n<li>\n<p><strong>Credit Card Information:</strong> At no point does our plugin or any component of your WordPress site store credit card details. When a user inputs their credit card information, it&#8217;s directly processed by Stripe. This ensures the highest level of security, as all sensitive data is managed directly by Stripe, which employs state-of-the-art security measures.</p>\n</li>\n<li>\n<p><strong>Compliance with Stripe&#8217;s Security Guidelines:</strong> Our integration with Stripe strictly follows their security guidelines. This means that any updates or security practices recommended by Stripe are implemented in our plugin to ensure consistent security.</p>\n</li>\n<li>\n<p><strong>Data Handling:</strong> While our plugin facilitates the payment process, all the crucial transaction data and processing are handled directly by Stripe. This means that we do not have access to sensitive transaction details, adding an additional layer of privacy and security for the end-users.</p>\n</li>\n</ol>\n<p>We always encourage users and administrators to keep plugins updated and periodically review and ensure the security of their website.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/duzz-custom-portal.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/duzz-custom-portal/assets/screenshot-1.gif?rev=3050066",
            "caption": "<p>Contact form redirect to portal</p>"
        },
        {
            "src": "https://ps.w.org/duzz-custom-portal/assets/screenshot-2.gif?rev=3050066",
            "caption": "<p>Make Payment</p>"
        },
        {
            "src": "https://ps.w.org/duzz-custom-portal/assets/screenshot-3.gif?rev=3050066",
            "caption": "<p>Create Invoice</p>"
        },
        {
            "src": "https://ps.w.org/duzz-custom-portal/assets/screenshot-4.gif?rev=3050066",
            "caption": "<p>Create Project</p>"
        },
        {
            "src": "https://ps.w.org/duzz-custom-portal/assets/screenshot-5.png?rev=3050066",
            "caption": "<p>Project Status Feed</p>"
        },
        {
            "src": "https://ps.w.org/duzz-custom-portal/assets/screenshot-6.png?rev=3050066",
            "caption": "<p>Projects List</p>"
        },
        {
            "src": "https://ps.w.org/duzz-custom-portal/assets/screenshot-7.png?rev=3050066",
            "caption": "<p>Sent Invoice</p>"
        },
        {
            "src": "https://ps.w.org/duzz-custom-portal/assets/screenshot-8.gif?rev=3050066",
            "caption": "<p>Send Invite</p>"
        },
        {
            "src": "https://ps.w.org/duzz-custom-portal/assets/screenshot-9.png?rev=3050066",
            "caption": "<p>Stripe Settings Dashboard</p>"
        },
        {
            "src": "https://ps.w.org/duzz-custom-portal/assets/screenshot-10.png?rev=3050066",
            "caption": "<p>Update Project</p>"
        },
        {
            "src": "https://ps.w.org/duzz-custom-portal/assets/screenshot-11.png?rev=3050066",
            "caption": "<p>Duzz Settings Dashboard</p>"
        }
    ],
    "tags": {
        "chat": "chat",
        "customer-service": "customer service",
        "interaction": "interaction",
        "project-management": "project management",
        "stripe": "stripe"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.76": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.0.76.zip",
        "1.0.79": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.0.79.zip",
        "1.0.80": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.0.80.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.1.8.zip",
        "1.1.9": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.1.9.zip",
        "1.1.91": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.1.91.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/duzz-custom-portal.1.2.0.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/duzz-custom-portal/assets/icon.svg?rev=3020661",
        "svg": "https://ps.w.org/duzz-custom-portal/assets/icon.svg?rev=3020661"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}