{
    "name": "Easy Form Builder &#8211; WordPress plugin form builder: contact form, survey form, payment form, and custom form builder",
    "slug": "easy-form-builder",
    "version": "3.8.4",
    "author": "<a href=\"https://whitestudio.team\">WhiteStudio</a>",
    "author_profile": "https://profiles.wordpress.org/hassantafreshi/",
    "contributors": {
        "hassantafreshi": {
            "profile": "https://profiles.wordpress.org/hassantafreshi/",
            "avatar": "https://secure.gravatar.com/avatar/99a72de762392a5a5efbf36a4367f793?s=96&d=monsterid&r=g",
            "display_name": "hassantafreshi"
        },
        "mostafas1990": {
            "profile": "https://profiles.wordpress.org/mostafas1990/",
            "avatar": "https://secure.gravatar.com/avatar/e3631726d155eac3e02f76ce86675b5e?s=96&d=monsterid&r=g",
            "display_name": "Mostafa Soufi"
        },
        "mrlast": {
            "profile": "https://profiles.wordpress.org/mrlast/",
            "avatar": "https://secure.gravatar.com/avatar/ce1cfeaaddef8117afbba2291a3b4121?s=96&d=monsterid&r=g",
            "display_name": "Farshid"
        },
        "aminkhadivar": {
            "profile": "https://profiles.wordpress.org/aminkhadivar/",
            "avatar": "https://secure.gravatar.com/avatar/b9c9acc919b3fb4411075c450e7212a7?s=96&d=monsterid&r=g",
            "display_name": "Amin Khadivar"
        },
        "presskopp": {
            "profile": "https://profiles.wordpress.org/presskopp/",
            "avatar": "https://secure.gravatar.com/avatar/0d89595a2366c744253a42ba2e371f17?s=96&d=monsterid&r=g",
            "display_name": "Presskopp"
        }
    },
    "requires": "4.7",
    "tested": "6.6.1",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 21,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 21,
    "support_url": "https://wordpress.org/support/plugin/easy-form-builder/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 2000,
    "downloaded": 59719,
    "last_updated": "2024-08-03 2:52pm GMT",
    "added": "2021-02-21",
    "homepage": "https://whitestudio.team",
    "sections": {
        "description": "<p><strong>Easy Form Builder</strong> is a drag &amp; drop and user-friendly form creator that allows you to create  multistep professional forms or contact-us forms within minutes.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/AnkhmZ5Cz9w?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>If you&#8217;re looking to create custom multi-step forms without any coding skills, Easy Form Builder is the plugin for you. With over 40 field types and a simple drag-and-drop interface, building a custom form has never been easier. Easy Form Builder also includes a unique confirmation code (tracking ID) for each submission, allowing you to connect each submission to an individual request.</p>\n<p>Easy Form Builder offers numerous features to make your life easier, including:</p>\n<p><strong>Free features of Easy Form Builder:</strong></p>\n<ul>\n<li>\n<p>+40 field types for building forms</p>\n</li>\n<li>\n<p>Simple drag and drop functionality</p>\n</li>\n<li>\n<p>Build Multi-step forms</p>\n</li>\n<li>\n<p>Email notification</p>\n</li>\n<li>\n<p>Confirmation code</p>\n</li>\n<li>\n<p>Form validation</p>\n</li>\n<li>\n<p>Easily Localization</p>\n</li>\n<li>\n<p>Offline Forms</p>\n</li>\n<li>\n<p>Build Forms with ReCAPTCHA.</p>\n</li>\n<li>\n<p>Instant reply functionality</p>\n</li>\n<li>\n<p>Support LTR and RTL languages</p>\n</li>\n<li>\n<p>Mobile-friendly form builder plugin</p>\n</li>\n<li>\n<p>Create an Email Template for Email notification</p>\n</li>\n<li>\n<p>Easy to embed forms to WordPress page and post</p>\n</li>\n<li>\n<p>Easy to use and no coding skills are required to build forms</p>\n</li>\n<li>\n<p>New Contact us templates &amp; Examples for creating a contact-us form in less than 1 minute</p>\n</li>\n<li>\n<p>New Support and Feedback template &amp; Example for build support form in 1 minute</p>\n</li>\n<li>\n<p>Easily build any kind of form like contact-us form, survey form, payment form, private form</p>\n</li>\n<li>\n<p>Easy Form Builder is a mobile-friendly form builder and you can easily build forms with Android or iPhone, smartphones or tablets</p>\n</li>\n<li>\n<p>Unlimited form creation</p>\n</li>\n<li>\n<p>Unlimited responses or messages forms</p>\n</li>\n<li>\n<p>Multistep form creation (limited steps)</p>\n</li>\n<li>\n<p>Sample file upload form</p>\n</li>\n<li>\n<p>Create Support forms</p>\n</li>\n<li>\n<p>Create subscription or newsletters forms</p>\n</li>\n<li>\n<p>Create Login (sign-in) forms</p>\n</li>\n<li>\n<p>Create Registration (sign-up) forms</p>\n</li>\n<li>\n<p>Create Surveys (polls) and analyze</p>\n</li>\n<li>\n<p>Build Private forms (lock forms) or Public forms</p>\n</li>\n<li>\n<p>Export subscribers list to CSV format file</p>\n</li>\n<li>\n<p>Mobile-friendly form builder plugin</p>\n</li>\n<li>\n<p>Easy to embed forms to WordPress page and post</p>\n</li>\n<li>\n<p>Sample file upload form</p>\n</li>\n<li>\n<p>Email notification when a form has been submitted</p>\n</li>\n<li>\n<p>Showing a unique confirmation code after filled forms</p>\n</li>\n<li>\n<p>User-friendly and feature-rich panel to manage your forms and their responses</p>\n</li>\n<li>\n<p>Shown Form notification on entry management when having a new response or message</p>\n</li>\n<li>\n<p>Entry Management able to show response messages of forms and edit forms or delete forms</p>\n</li>\n<li>\n<p>Reliable spam protection through Google’s reCAPTCHA v2 and localized automatically to your language</p>\n</li>\n<li>\n<p>Add custom email template for form notification emails</p>\n</li>\n<li>\n<p>Confirmation code (tracking ID) finder form</p>\n</li>\n<li>\n<p>Show survey (poll) results in Pie Chart</p>\n</li>\n<li>\n<p>Easily Localization Easy Form Builder to your language</p>\n</li>\n<li>\n<p>Email notification automatically sends email messages every time a respondent submits your built form on Easy form Builder</p>\n</li>\n<li>\n<p>Professional panel for managing user-filled forms and responses</p>\n</li>\n<li>\n<p><em>Spam Protection</em> : Google ReCaptcha validation added to your forms for enhanced security against spam. for <strong>free</strong>.</p>\n</li>\n<li>\n<p>Download individual filled-out form (messages)</p>\n</li>\n</ul>\n<p><strong>Advanced Forms Field of Easy Form Builder</strong></p>\n<ul>\n<li>\n<p>SMS notification</p>\n</li>\n<li>\n<p>Multiple Select (Multi Selection Dropdown list) field used to select multiple options in a support form or any kind of form</p>\n</li>\n<li>\n<p>Change or Build Email Template for Email notification of forms</p>\n</li>\n<li>\n<p>Forms Templates for creating contact-us or support forms</p>\n</li>\n<li>\n<p>Customizable the thank you message in forms</p>\n</li>\n<li>\n<p>Create any kind of form you want</p>\n</li>\n<li>\n<p>Slide Range Field for building Modern forms <strong>for free</strong></p>\n</li>\n<li>\n<p>With Easy Form Builder, you can use 2 customizable email templates for sending form submission notifications at no cost.</p>\n</li>\n<li>\n<p><em>Create Custom Email Template</em>: with this free feature on Easy Form Builder you can create or add custom email templates for forms. for add custom email template on Easy Form Builder go to “Easy Form Builder” <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> “Settings” <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span>   “Email Template”.</p>\n</li>\n<li>\n<p><em>Spam Protection</em> : Google ReCaptcha validation added to your forms for enhanced security against spam. for <strong>free</strong>.</p>\n</li>\n<li>\n<p><em>Stripe payment</em> : Easily integrate Stripe payment gateway to create payment forms for accepting online payments for various purposes such as order forms, booking forms, and donation forms.</p>\n</li>\n<li>\n<p><em>5 Points Scale</em> : The 5-point scale is a popular method for creating survey forms and poll forms. With Easy Form Builder&#8217;s 5 Points Scale fields, you can easily create beautiful forms, collect responses, and analyze results.</p>\n</li>\n<li>\n<p><em>Net Promoter Score</em> : The Net Promoter Score (NPS) question is a powerful tool for creating effective survey forms and poll forms in Easy Form Builder.</p>\n</li>\n<li>\n<p>With Easy Form Builder, you get a free feature that sends you an email when someone fills out a form on your website. It includes a link to see the response, helping you communicate, engage users, and improve your site&#8217;s search engine rankings.</p>\n</li>\n<li>\n<p>Build secure and integrated Stripe payment forms</p>\n</li>\n<li>\n<p>Create customizable drag and drop file upload forms</p>\n</li>\n<li>\n<p>Design multi-step forms with unlimited steps for better user experience</p>\n</li>\n<li>\n<p>Export survey results to CSV format for easy analysis</p>\n</li>\n<li>\n<p>Export form responses or messages to CSV format for data management</p>\n</li>\n<li>\n<p>Easily create any kind of payment order or service form with customizable payment fields such as  single-choice, selection choose</p>\n</li>\n<li>\n<p>Create advanced forms with specialized fields including location picker (maps), Esign (e-signature), Yes/No question, Star rating, Switch button, and more</p>\n</li>\n<li>\n<p>Customize the thank you page that users are redirected to after completing the form for better engagement and conversion rates.</p>\n</li>\n<li>\n<p>Professional panel for managing user-filled forms and responses</p>\n</li>\n<li>\n<p>Countries list field &amp; States / Provinces list field &amp; Cities list field Easily Create your forms</p>\n</li>\n</ul>\n<p><strong>New Forms Field of Easy Form Builder</strong></p>\n<p><em>SMS Notification</em>: Easy Form Builder offers a robust SMS notification (Text message) feature, enabling real-time communication with your users upon form submission. Ideal for businesses seeking to enhance customer engagement, SMS notification addon of Easy Form Builder allows you to send customized SMS alerts to your clients. You can personalize the message content, ensuring it aligns with your brand voice, and even include a link to the submitted form for easy access. Leverage Easy Form Builder&#8217;s SMS notification or Text message feature to keep your customers informed and engaged.</p>\n<p><em>Drag and Drop file upload</em>: Our user-friendly drag and drop file upload feature makes it easy to add images, videos, audio files, compressed files, and documents (including popular formats like Doc, MS Word, MS Powerpoint, MS Excel, and more) to your online forms. Streamline your support form and enhance your form-building experience with our intuitive file upload function.</p>\n<p><em>Signature Forms</em>: Make your contact forms stand out by adding signature fields for your users to sign. Signature forms can be used for a variety of purposes, such as contracts or agreements. By including this feature in your forms, you can improve user engagement and increase the likelihood of form completion.</p>\n<p><em>Location picker (Geolocation)</em>: Using the WordPress plugin Easy Form Builder, easily add a Geolocation feature to your form, including the Contact Us form. This effective tool allows users to swiftly select one or more points with a location picker using LeafletJs and OpenStreetMap, enabling you to build your forms with a location picker.</p>\n<p><em>Countries list</em>: Make it easy for your users to select their country with the Easy Form Builder&#8217;s country list select field. This drop-down field includes the local names of all countries, making it more user-friendly and accessible. Add it to your Contact Us form or country form today.</p>\n<p><em>States / Provinces</em>: With Easy Form Builder, you can easily add a States / Provinces list select field (drop-down field of states / provinces list) to your form. Our state/province list includes the local names of each region, so you can easily display the state names in any language. Plus, you can easily switch between countries to display the states/provinces of any desired location.</p>\n<p><em>Cities dropdown</em>: With the dropdown city list in the Easy Form Builder, you can include the list of cities for a province in three language modes: English, local language, and English along with the local language in your form. This feature is perfect for creating forms that require users to select their city of residence.</p>\n<p><em>Multiple Select</em>:Add the ability for users to make multiple selections with the Multi-Select (or Multi-Select Dropdown) field. This field is fully customizable and even includes a searchable dropdown list. Easily add this feature to your WordPress form for <strong>free</strong> and improve your user experience.</p>\n<p><em>Heading</em>: With Easy Form Builder, you can add heading fields to your forms, just like H tags, without any coding skills. Customize the size and color of your headings to match your form&#8217;s style and design.</p>\n<p><em>Link</em>: With Easy Form Builder, you can easily add a link field to your WP forms. This feature enables users to include clickable links on their forms for enhanced user experience and improved conversion rates. With Easy Form Builder, you can customize the link field&#8217;s appearance and make it stand out with a variety of text sizes and colors to match your branding.</p>\n<p><em>Secure forms submitting</em>: With Easy Form Builder, you can ensure secure online form submissions. Our validation fields automatically check form data on the client-side before submission and then validate it again on the server-side for added security, all at no additional cost.</p>\n<p><em>Secure File uploads</em>: With Easy Form Builder, you can enjoy secure uploading methods for files and media through your contact forms or other forms. Our platform ensures that the files are safely and privately collected, giving your users peace of mind. Plus, with our <strong>free</strong> service.</p>\n<p><em>Open/Closed responses</em>: You can mark responses or tickets as open or closed directly from the platform. This feature enables you to track the status of your form submissions, ensuring that you provide timely and effective customer support. With Easy Form Builder&#8217;s open/closed responses, you can improve your customer service and increase customer satisfaction rates.</p>\n<p><em>Hijri Date Picker</em> : You can add a Hijri or Arabic Date Picker field to your forms. This feature is perfect for creating forms that require Arabic or Islamic date selection. The Hijri Date Picker is easy to use and allows your users to select a date from the Islamic calendar with ease. With Easy Form Builder, you can customize the appearance of the Hijri Date Picker field to match your form&#8217;s design and branding.</p>\n<p><em>Jalali Date Picker</em> : With Easy Form Builder&#8217;s Shamsi Date Picker, you can easily create forms that include Persian or Jalali date fields. This feature is perfect for users who need to collect dates according to the Persian calendar system.</p>\n<p><em>Cell Phone Input Field</em> :you can easily add a cell phone input field to your forms, allowing users to input their phone number with ease. Additionally, this feature includes the option to limit the input to specific countries, ensuring that users provide phone numbers in the correct format for your needs. With this powerful tool included in our form builder, you can create a wide range of forms, from contact forms to registration forms and beyond, all with the ability to collect cell phone numbers in a hassle-free manner.</p>\n<p>For more information, check out our comprehensive documentation <a href=\"https://whitestudio.team/documents\" rel=\"nofollow ugc\">Click Here</a></p>\n<p><strong>Notice</strong>: Avoid adding more than one form per page..</p>\n<p>Report bugs and improve Easy Form Builder by <a href=\"https://github.com/hassantafreshi/easy-form-builder/issues\" rel=\"nofollow ugc\">create a ticket on GitHub</a> or contact us on <a href=\"https://whitestudio.team/contact-us/\" rel=\"nofollow ugc\">whitestudio.team</a></p>\n<p>The country, state/province, and city information in the Easy Form Builder is sourced from cdn.jsdelivr.net. If there are any inaccuracies or mistakes in the city or country names, please <a href=\"https://github.com/hassantafreshi/Json-List-of-countries-states-and-cities-in-the-world\" rel=\"nofollow ugc\">report here on GitHub</a>.</p>\n<p>Easy Form Builder offers a variety of templates and examples to help you create customized forms for your website, whether it&#8217;s for contact, survey, payment, or private purposes. Its easy-to-use drag-and-drop interface allows you to create forms in minutes and seamlessly embed them into any WordPress page or post. With no coding skills required, you can create professional-looking forms that meet your specific needs.</p>\n",
        "installation": "<p><strong>Notice</strong> : If your template base on bootstrap then go to “Easy Form Builder” <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> “Settings” <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> checked “My template have used BootStrap framework” <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Save</p>\n<ol>\n<li>Download <a href=\"https://downloads.wordpress.org/plugin/easy-form-builder.zip\" rel=\"nofollow ugc\"><em>Easy Form Builder</em></a></li>\n<li>Navigate to Dashboard <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> “Plugins” <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> “Add New” <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> “Upload Plugin” <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> select  <em>Easy Form Builder</em> zip file then “Activate”.</li>\n<li>In the menu bar, navigate to “Easy Form Builder” <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> “Settings&#8221; <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> “Add Google recaptcha keys”</li>\n<li>For local testing environments, you may use the key and secret below. For online websites, <a href=\"https://www.google.com/recaptcha\" rel=\"nofollow ugc\">click here to obtain the API keys for reCAPTCHA v2</a>.</li>\n</ol>\n<h4>Development Google captcha Keys for LOCALHOST</h4>\n<p><strong>Site key:</strong> <code>6LeIxAcTAAAAAJcZVRqyHh71UMIEGNQ_MXjiZKhI</code><br />\n<strong>Secret key:</strong> <code>6LeIxAcTAAAAAGG-vFI1TnRWxMZNFuojJ4WifJWe</code></p>\n<p><strong>The following links demonstrate how to use Easy Form Builder correctly:</strong></p>\n<ol>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-set-up-form-notification-emails-in-easy-form-builder/#settingUp-Notification\" rel=\"nofollow ugc\">How to configure <em>Easy Form Builder</em></a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-get-google-recaptcha-and-implement-it-into-easy-form-builder/\" rel=\"nofollow ugc\">How to get Google reCAPTCHA and implement it into <em>Easy Form Builder</em></a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-set-up-form-notification-emails-in-easy-form-builder/#email-notification\" rel=\"nofollow ugc\">How to activate the alert email (Notification email) for new form submissions</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-create-your-first-form-with-easy-form-builder/\" rel=\"nofollow ugc\">How to create and add a form with <em>Easy Form Builder</em></a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-activate-confirmation-code-in-easy-form-builder/\" rel=\"nofollow ugc\">How to activate a Confirmation Code in <em>Easy Form Builder</em></a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/complete-guide-of-form-entries-and-mange-forms/\" rel=\"nofollow ugc\">How to work with panels in <em>Easy Form Builder</em></a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-add-the-confirmation-code-finder/\" rel=\"nofollow ugc\">How to add The Confirmation Code Finder to a post, page, or custom post type</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-find-a-response-through-a-confirmation-code/\" rel=\"nofollow ugc\">How to find a response through a Confirmation Code</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-customize-the-email-template-in-easy-form-builder/#readyTemplate\" rel=\"nofollow ugc\">How use ready Email templates on Easy Form Builder</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/complete-guide-of-form-entries-and-mange-forms/\" rel=\"nofollow ugc\">Complete Guide to Managing Form Entries with Easy Form Builder</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-do-not-show-progress-bar-on-a-form/\" rel=\"nofollow ugc\">How to Hide the Progress Bar on a Form Using Easy Form Builder Plugin</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-change-step-names-and-icons-of-step-name-forms/\" rel=\"nofollow ugc\">How to Customize Step Names and Icons in Your Forms</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/blog/how-to-edit-thank-you-message-of-forms-on-easy-form-builder/\" rel=\"nofollow ugc\">How to Edit the Thank You Message of Forms with Easy Form Builder</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-change-label-name-and-inputs-of-easy-form-builder/\" rel=\"nofollow ugc\">How to Customize Label Names and Inputs of a form in Easy Form Builder for a Seamless User Experience</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-create-a-private-form-with-easy-form-builder-2/\" rel=\"nofollow ugc\">How to Create a Private Form with Easy Form Builder</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-customize-the-submit-button/\" rel=\"nofollow ugc\">Customize the Form Submit Button in Easy Form Builder: Step-by-Step Guide</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-setup-and-use-the-stripe-on-easy-form-builder/\" rel=\"nofollow ugc\">Setting Up and Using Stripe on Forms with Easy Form Builder</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-create-a-payment-form-in-easy-form-builder/\" rel=\"nofollow ugc\">How to Create a Payment Form with Easy Form Builder</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/blog/how-to-activate-pro-version-easy-form-builder-plugin/\" rel=\"nofollow ugc\">How to activate the pro version of Easy Form Builder</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-edit-a-redirect-pagethank-you-page-of-forms-on-easy-form-builder/\" rel=\"nofollow ugc\">How To Edit A Redirect Page (Thank you Page) Of Forms On Easy Form Builder</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-create-a-file-upload-form-in-easy-form-builder/\" rel=\"nofollow ugc\">How to Create a File Upload Form in WordPress</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/how-to-add-cell-phone-number-input-to-easy-form-builder/\" rel=\"nofollow ugc\">How to add cell phone number input to Easy Form Builder</a></p>\n</li>\n<li>\n<p><a href=\"https://whitestudio.team/document/guide-advanced-file-upload-forms-wordpress/\" rel=\"nofollow ugc\">The Ultimate Guide to Advanced File Upload Forms with Easy Form Builder</a></p>\n</li>\n</ol>\n",
        "faq": "\n<dt id='why%20should%20i%20use%20easy%20form%20builder%3F'>\nWhy should I use Easy Form Builder?\n</h4>\n<p>\n<p>According to users, Easy Form Builder&#8217;s support is the top choice. Creating various forms is super easy with Easy Form Builder, rated 5 stars by users. With over 40 field types, you can make lots of different forms. One cool thing is Easy Form Builder&#8217;s confirmation code feature, making it easy to interact with users and keeping everything on your site.</p>\n</p>\n<dt id='what%20is%20the%20competitive%20advantage%20of%20easy%20form%20builder%3F'>\nWhat is the competitive advantage of Easy Form Builder?\n</h4>\n<p>\n<p>The competitive advantage of the Easy Form Builder Plugin lies in its straightforward design and user-friendly setup and form builder. By providing a tool that is simple and requires minimal learning, Admins can streamline their processes and boost efficiency. This user-friendly approach not only speeds up the form creation process but also encourages widespread use among individuals with various levels of technical know-how. In the end, the simplicity of a form builder contributes to increased productivity and an overall improved user experience, making it a valuable asset in the competitive landscape.</p>\n</p>\n<dt id='is%20coding%20knowledge%20required%20to%20build%20forms%20using%20easy%20form%20builder%3F'>\nIs Coding knowledge required to build forms using Easy Form Builder?\n</h4>\n<p>\n<p>No, you don&#8217;t need any programming knowledge to create a form with Easy Form Builder. Simply drag and drop the elements you want onto the form builder, and use its user-friendly interface to easily customize each element through its settings. Create your desired form effortlessly.</p>\n</p>\n<dt id='what%20types%20of%20forms%20can%20i%20create%20using%20easy%20form%20builder%3F'>\nWhat types of forms can I create using Easy Form Builder?\n</h4>\n<p>\n<p>Easy Form Builder enables you to effortlessly create a wide variety of forms, including contact forms, support forms, payment forms, survey forms, poll forms, feedback forms, registration forms, login forms, and many others to suit your needs. Here are some examples of forms that Easy Form Builder can create:<br />\n* Contact form<br />\n* Multi-step contact form<br />\n* Multi-step Recurring form<br />\n* event payment form<br />\n* Multi-step event payment form<br />\n* Recurring form or Job Application Contact form<br />\n* Support contact form<br />\n* Multi-step support form<br />\n* Feedback contact form<br />\n* Multi step support form<br />\n* Feedback survey form<br />\n* Multi step feedback survey form<br />\n* Request contact form<br />\n* Multi step requst contact form<br />\n* Subscribe contact form<br />\n* Multi step subscribe contact form<br />\n* Multi step offline contact form<br />\n* Simple upload file form<br />\n* Multi step upload file form<br />\n* Drag and drop upload file form<br />\n* Poll form or survey form<br />\n* Download form<br />\n* Multi step download form<br />\n* Payment form<br />\n* Multi step payment form<br />\n* Newsletter Signup form<br />\n* Multi-step Newsletter Signup form<br />\n* Order form<br />\n* Multi-step Order form<br />\n* Registration form<br />\n* Multi-step Registration Form<br />\n* Login form<br />\n* Volunteer application form<br />\n* Multi-step Volunteer application form<br />\n* Sales contact form</p>\n</p>\n<dt id='does%20easy%20form%20builder%20have%20a%20system%20for%20managing%20filled-out%20forms%3F'>\nDoes Easy Form Builder have a system for managing filled-out forms?\n</h4>\n<p>\n<p>Yes, Easy Form Builder has a system to manage filled-out forms and received messages. Through the Easy Form Builder panel, accessible via the website, you can interact with your audience on-site. This integrated communication and ticketing system encourages users to stay longer on your site to view responses. This engagement boost positively impacts your site ranking, as users tend to linger to read your responses on-site. The ticketing system and form tracking offer a more efficient alternative to sending forms via email, facilitating continued communication within the website environment.</p>\n</p>\n<dt id='what%20form%20fields%20does%20easy%20form%20builder%20provide%3F'>\nWhat Form Fields does Easy Form Builder provide?\n</h4>\n<p>\n<p>Easy Form Builder offers over 40 field types, categorized into three main sections within the form builder for ease of use: Basic, Payment, and Advanced. The list of Easy Form Builder field types includes:</p>\n<p>Basic Field Types:<br />\n* Text<br />\n* Name<br />\n* Email<br />\n* Password<br />\n* Number<br />\n* Long Text (Textarea)<br />\n* Checkbox<br />\n* Radio Button<br />\n* Select<br />\n* Telephone<br />\n* Range<br />\n* Date<br />\n* Simple File Upload<br />\n* URL<br />\n* Color Picker</p>\n<p>Payment Field Types:<br />\n* Payment Multi-Choose<br />\n* Payment Single Choose<br />\n* Price Field<br />\n* Total Price<br />\n* Stripe Payment</p>\n<p>Advanced Field Types:<br />\n* Step<br />\n* Multiple Select<br />\n* Mobile<br />\n* Drag and Drop File Upload<br />\n* Address<br />\n* Countries Drop-Down List<br />\n* State/Province Drop-Down List<br />\n* Cities Drop-Down List<br />\n* Signature<br />\n* Switch Button<br />\n* Box Checkbox<br />\n* Heading<br />\n* Rating Star<br />\n* Yes/No Button<br />\n* Link<br />\n* HTML Code<br />\n* Point Scale 5<br />\n* Net Promoter Score<br />\n* Image Picker<br />\n* NPS Table Matrix<br />\n* Jalali Date<br />\n* Hijra Date<br />\n* Location Picker</p>\n</p>\n<dt id='is%20easy%20form%20builder%20spam-protected%3F'>\nIs Easy Form Builder spam-protected?\n</h4>\n<p>\n<p>Yes, in Easy Form Builder, we use Google reCAPTCHA version 2 checkbox technology to make forms more user-friendly. This helps improve the form interface, making it easier for users to interact with.</p>\n</p>\n<dt id='does%20easy%20form%20builder%20have%20the%20capability%20to%20send%20emails%3F'>\nDoes Easy Form builder have the capability to send emails?\n</h4>\n<p>\n<p>Yes, Easy Form Builder features the capability of sending email notifications after form submission or receiving new responses. With just a few clicks in its settings, you can configure the forms you create to send email notifications.</p>\n</p>\n<dt id='is%20easy%20form%20builder%20gdpr%20compliant%3F'>\nIS Easy Form Builder GDPR compliant?\n</h4>\n<p>\n<p>Easy Form Builder is GDPR compliant, considering this aspect both during form creation and forms management. It especially ensures the administrator&#8217;s right to delete forms and submitted entries is preserved. Most importantly, all this data is stored exclusively on your website.</p>\n</p>\n<dt id='is%20easy%20form%20builder%20wcag%28ada%29%20compliant%3F'>\nIs Easy Form Builder WCAG(ADA) compliant?\n</h4>\n<p>\n<p>Form Builder has tried to add necessary standards to the forms, making them accessible to individuals with disabilities during form display.</p>\n</p>\n<dt id='which%20languages%20are%20the%20documentation%20for%20the%20easy%20form%20builder%20available%20in%3F'>\nWhich languages are the documentation for the Easy Form Builder available in?\n</h4>\n<p>\n<p>The Documentation for the Easy Form Builder is fully available in English and German, covering form creation, form management, form settings, and more. Additionally, documentation in Arabic is currently being completed.</p>\n</p>\n<dt id='where%20should%20i%20report%20a%20bug%20for%20easy%20form%20builder%3F'>\nWhere should I report a bug for Easy Form Builder?\n</h4>\n<p>\n<p>Report bugs and improve Easy Form Builder by <a href=\"https://github.com/hassantafreshi/easy-form-builder/issues\" rel=\"nofollow ugc\">create a ticket on GitHub</a> or contact us on <a href=\"https://whitestudio.team/contact-us/\" rel=\"nofollow ugc\">whitestudio.team</a></p>\n</p>\n<dt id='what%20type%20of%20support%20is%20available%20for%20easy%20form%20builder%3F'>\nWhat type of support is available for Easy Form Builder?\n</h4>\n<p>\n<p>We&#8217;ve got a dedicated team ready to support you with any form-related questions or issues you may come across. Our assistance is available every day, and we&#8217;re committed to addressing all customer form requests within 24 hours.</p>\n</p>\n<dt id='does%20the%20wordpress%20plugin%20easy%20form%20builder%20support%20creating%20forms%20to%20capture%20geolocation%20data%20without%20needing%20a%20map%20api%20key%3F'>\nDoes the WordPress plugin Easy Form Builder support creating forms to capture Geolocation data without needing a map API key?\n</h4>\n<p>\n<p>Yes, the WordPress plugin Easy Form Builder allows you to create a single form to capture Geolocation without requiring an API key for map usage. This form integrates a location picker, enabling users to specify points using LeafletJs and OpenStreetMap, making it simple and convenient. Each form, such as a Contact Us form, can feature a location picker to precisely gather user coordinates on your WordPress site without the need for additional map keys.</p>\n</p>\n\n",
        "changelog": "<h4>3.8.4</h4>\n<ul>\n<li>Fixed issues of UI Easy Form Builder</li>\n</ul>\n<h4>3.8.3</h4>\n<ul>\n<li>\n<p>Fixed issues</p>\n</li>\n<li>\n<p>Fixed issues of UI Easy Form Builder</p>\n</li>\n</ul>\n<h4>3.8.2</h4>\n<h4>3.8.1</h4>\n<ul>\n<li>Fixed issues</li>\n</ul>\n<h4>3.8.0</h4>\n<ul>\n<li>\n<p>Improvement of the location Picker feature for the form and changing the service provider to OpenStreetMap.</p>\n</li>\n<li>\n<p>Fixed issues</p>\n</li>\n</ul>\n<h4>3.7.35</h4>\n<ul>\n<li>\n<p>Fixed issues of loading time of Easy Form Builder</p>\n</li>\n<li>\n<p>Fixed issues</p>\n</li>\n</ul>\n<h4>3.7.34</h4>\n<ul>\n<li>Fixed issues of loading time of Easy Form Builder</li>\n<li>Fixed issues</li>\n</ul>\n<h4>3.7.33</h4>\n<ul>\n<li>Fixed issues</li>\n</ul>\n<h4>3.7.31</h4>\n<ul>\n<li>Resolved issues related to sending email notifications for forms.</li>\n</ul>\n<h4>3.7.30</h4>\n<ul>\n<li>Improved Security of Easy Form Builder</li>\n<li>Change the default response state by the admin to require admin login.</li>\n</ul>\n<h4>3.7.29</h4>\n<h4>3.7.28</h4>\n<ul>\n<li>Resolved issues related to sending email notifications for forms.</li>\n</ul>\n<h4>3.7.27</h4>\n<ul>\n<li>Resolved issues related to sending email notifications for forms.</li>\n</ul>\n<h4>3.7.26</h4>\n<ul>\n<li>Fixed issues of UI Easy Form Builder</li>\n<li>Added new feature: &#8216;terms input field&#8217; to form builder.</li>\n</ul>\n<h4>3.7.25</h4>\n<ul>\n<li>Fixed issues of UI Easy Form Builder</li>\n</ul>\n<h4>3.7.24</h4>\n<ul>\n<li>Fixed issues of UI Easy Form Builder</li>\n<li>Resolved Google ReCaptcha loading issues in Easy Form Builder&#8217;s forms.</li>\n</ul>\n<h4>3.7.21</h4>\n<ul>\n<li>CAPTCHA Issue Present Resolved on Edit Form on Easy Form Builder Panel page</li>\n<li>Admins Can Now Add Responses Without Logging In</li>\n<li>&#8220;Select All&#8221; Checkbox Added for Messages Section on Easy Form Builder Panel </li>\n<li>Delete Button Added to Message Section on Easy Form Builder Panel </li>\n<li>&#8220;Read&#8221; Button Added to Message Section on Easy Form Builder Panel </li>\n<li>Resolved issues with changing phone number in settings.</li>\n<li>Fixed issues of UI Easy Form Builder</li>\n</ul>\n<h4>3.7.20</h4>\n<ul>\n<li>Fixed issues of UI Easy Form Builder</li>\n</ul>\n<h4>3.7.19</h4>\n<ul>\n<li>Fixed issues of UI Easy Form Builder</li>\n</ul>\n<h4>3.7.18</h4>\n<ul>\n<li>\n<p>Fixed issues of UI Easy Form Builder</p>\n</li>\n<li>\n<p>Resolved issues related to sending email notifications for forms.</p>\n</li>\n</ul>\n<h4>3.7.17</h4>\n<ul>\n<li>Fixed issues of UI Easy Form Builder</li>\n</ul>\n<h4>3.7.16</h4>\n<ul>\n<li>Fixed issues of UI Easy Form Builder</li>\n</ul>\n<h4>3.7.15</h4>\n<ul>\n<li>\n<p>Improved Email notification configuration in Easy Form Builder.</p>\n</li>\n<li>\n<p>Added total price and input price fields for building payment forms.</p>\n</li>\n<li>\n<p>Updated readme.</p>\n</li>\n</ul>\n<h4>3.7.14</h4>\n<h4>3.7.13</h4>\n<ul>\n<li>\n<p>Resolved issues related to sending email notifications for forms.</p>\n</li>\n<li>\n<p>Fixed issues of performance conflicts with popular cache plugins.</p>\n</li>\n</ul>\n<h4>3.7.11</h4>\n<ul>\n<li>Fixed issues</li>\n</ul>\n<h4>3.7.10</h4>\n<ul>\n<li>\n<p>The link to documents in German and Arabic has been added to the Easy Form Builder.</p>\n</li>\n<li>\n<p>Fixed issues</p>\n</li>\n</ul>\n<h4>3.7.9</h4>\n<ul>\n<li>\n<p>Fixed issues of performance conflicts with popular cache plugins.</p>\n</li>\n<li>\n<p>Enhance the user interface for loading forms.</p>\n</li>\n<li>\n<p>Fixed issues</p>\n</li>\n</ul>\n<h4>3.7.8</h4>\n<h4>3.7.7</h4>\n<h4>3.7.6</h4>\n<ul>\n<li>\n<p>Fixed issues with validation forms.</p>\n</li>\n<li>\n<p>Fixed issues of performance conflicts with popular cache plugins.</p>\n</li>\n<li>\n<p>Enhance the user interface for loading forms.</p>\n</li>\n</ul>\n<h4>3.7.5</h4>\n<ul>\n<li>\n<p>Improved Security of Easy Form Builder</p>\n</li>\n<li>\n<p>Fixed issues</p>\n</li>\n</ul>\n<h4>3.7.4</h4>\n<ul>\n<li>\n<p>Fixed issues</p>\n</li>\n<li>\n<p>Remove dependency on jQuery</p>\n</li>\n<li>\n<p>Fixed File Uploads issues and improve security of file upload forms of Easy Form Builder</p>\n</li>\n</ul>\n<h4>3.7.3</h4>\n<ul>\n<li>Resolved issues related to sending email notifications for forms.</li>\n</ul>\n<h4>3.7.2</h4>\n<ul>\n<li>\n<p>Improved install addons  of Easy Form Builder</p>\n</li>\n<li>\n<p>Fixed issues</p>\n</li>\n</ul>\n<h4>3.7.1</h4>\n<ul>\n<li>\n<p>Resolved issues related to sending email notifications for forms.</p>\n</li>\n<li>\n<p>Fixed issues</p>\n</li>\n</ul>\n<h4>3.7.0</h4>\n<ul>\n<li>\n<p>Added new features of SMS (Text message) notification  for forms</p>\n</li>\n<li>\n<p>Bootstrap Icons v1.11.2 added to Easy Form Builder</p>\n</li>\n<li>\n<p>Added new features, including smart city dropdowns, to the Easy Form Builder.</p>\n</li>\n<li>\n<p>Fixed UI bugs of State/Province Drop Down list in Easy Form Builder</p>\n</li>\n<li>\n<p>&#8220;Removed size file limitations for file uploads in Easy Form Builder.</p>\n</li>\n<li>\n<p>Resolved the issue of sanitizing links in responses submitted through forms in non-Latin languages</p>\n</li>\n<li>\n<p>Optimized the loading speed of forms.</p>\n</li>\n<li>\n<p>Resolved issues related to sending email notifications for forms.</p>\n</li>\n</ul>\n<p>=3.6.16=</p>\n<ul>\n<li>Fixed issues</li>\n</ul>\n<p>=3.6.15=</p>\n<p>The Easy Form Builder plugin now includes a new email content selector feature, allowing admin to choose whether to send tracking codes or completed forms to the admin&#8217;s email.</p>\n<p>=3.6.14=</p>\n<ul>\n<li>Fixed issues</li>\n</ul>\n<p>=3.6.13=</p>\n<ul>\n<li>Resolved Google ReCaptcha loading issues in Easy Form Builder&#8217;s forms.</li>\n</ul>\n<p>=3.6.12=</p>\n<ul>\n<li>\n<p>Fixed issues</p>\n</li>\n<li>\n<p>Improved UX of Easy Form Builder</p>\n</li>\n</ul>\n<p>=3.6.11=</p>\n<ul>\n<li>Fixed issues</li>\n</ul>\n<p>=3.6.10=</p>\n<ul>\n<li>Fixed issues</li>\n</ul>\n<p>=3.6.9=</p>\n<ul>\n<li>\n<p>Improved UX of Easy Form Builder</p>\n</li>\n<li>\n<p>Fixed issues of UI Easy Form Builder</p>\n</li>\n</ul>\n<p>=3.6.8=</p>\n<ul>\n<li>Improved UX of Easy Form Builder</li>\n</ul>\n<p>=3.6.7=</p>\n<ul>\n<li>\n<p>email structer of easy form builder is improved</p>\n</li>\n<li>\n<p>Improved UX of Easy Form Builder</p>\n</li>\n</ul>\n<p>=3.6.6=</p>\n<ul>\n<li>Resolved Google ReCaptcha loading issues in Easy Form Builder&#8217;s forms.</li>\n</ul>\n<p>=3.6.4=</p>\n<ul>\n<li>\n<p>Improved Security of form builder of WordPress Plugin</p>\n</li>\n<li>\n<p>Fixed issues of UI Easy Form Builder</p>\n</li>\n</ul>\n<p>=3.6.3=</p>\n<ul>\n<li>Improved Security of form builder of WordPress Plugin</li>\n</ul>\n<p>=3.6.2=</p>\n<ul>\n<li>\n<p>Fixed issues of UI Easy Form Builder</p>\n</li>\n<li>\n<p>Improved Security of form builder of WordPress Plugin</p>\n</li>\n</ul>\n<p>=3.6.1=</p>\n<ul>\n<li>\n<p>Improved UX of Easy Form Builder</p>\n</li>\n<li>\n<p>Remove dependency on jQuery</p>\n</li>\n</ul>\n<p>=3.5.33=</p>\n<ul>\n<li>Fixed issues</li>\n</ul>\n<p>=3.5.32=</p>\n<ul>\n<li>\n<p>Fixed issues</p>\n</li>\n<li>\n<p>Fixed issues of UI Easy Form Builder</p>\n</li>\n</ul>\n<p>=3.5.31=</p>\n<ul>\n<li>Fixed issues</li>\n</ul>\n<p>=3.5.30=<br />\n* Fixed issues of UI Easy Form Builder</p>\n<ul>\n<li>Fixed issues</li>\n</ul>\n<p>=3.5.28=<br />\n* Added new feature image picker field to form builder</p>\n<ul>\n<li>Fixed issues of UI Easy Form Builder</li>\n</ul>\n<p>=3.5.26=<br />\n* Fixed issues of UI Easy Form Builder</p>\n<p>=3.5.24=<br />\n* Fixed issues of UI Easy Form Builder</p>\n<ul>\n<li>\n<p>Improved UX of Easy Form Builder</p>\n</li>\n<li>\n<p>Added international telephone picker to admin WP form builder</p>\n</li>\n</ul>\n<p>=3.5.23=<br />\n=3.5.22=</p>\n<ul>\n<li>Improved UX of Easy Form Builder</li>\n</ul>\n<p>=3.5.21=</p>\n<ul>\n<li>Improved install addons  of Easy Form Builder</li>\n</ul>\n<p>=3.5.18=</p>\n<ul>\n<li>\n<p>Improved UX of Easy Form Builder</p>\n</li>\n<li>\n<p>Improved Security of form builder of WordPress Plugin</p>\n</li>\n<li>\n<p>Fixed issues</p>\n</li>\n</ul>\n<p>=3.5.17=<br />\n=3.5.16=</p>\n<ul>\n<li>Improve UX of Easy Form Builder</li>\n<li>Fixed issues</li>\n<li>Added Jalali date Input for create Persian date form</li>\n<li>Added Hijri date  input for create Arabic or Islamic date form</li>\n</ul>\n<p>=3.5.13=</p>\n<ul>\n<li>Improved UX of Easy Form Builder</li>\n</ul>\n<p>=3.5.12=<br />\n* Improved UX of Easy Form Builder<br />\n* Improved UI of Easy Form Builder<br />\n* Fixed issues of UI Easy Form Builder<br />\n* Added backward features for forms and Easy Form Builder Plugin.</p>\n<p>=3.5.11=<br />\n* Fixed issues of loading time of Easy Form Builder</p>\n<p>=3.5.10=<br />\n* Improved UX of Easy Form Builder<br />\n* Fixed issues of UI Easy Form Builder</p>\n"
    },
    "short_description": "Create multi-step and any other forms with Easy Form Builder – the user-friendly drag-and-drop Form Builder. The Form Builder for all your needs.",
    "description": "<p><strong>Easy Form Builder</strong> is a drag &amp; drop and user-friendly form creator that allows you to create  multistep professional forms or contact-us forms within minutes.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/AnkhmZ5Cz9w?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>If you&#8217;re looking to create custom multi-step forms without any coding skills, Easy Form Builder is the plugin for you. With over 40 field types and a simple drag-and-drop interface, building a custom form has never been easier. Easy Form Builder also includes a unique confirmation code (tracking ID) for each submission, allowing you to connect each submission to an individual request.</p>\n<p>Easy Form Builder offers numerous features to make your life easier, including:</p>\n<p><strong>Free features of Easy Form Builder:</strong></p>\n<ul>\n<li>\n<p>+40 field types for building forms</p>\n</li>\n<li>\n<p>Simple drag and drop functionality</p>\n</li>\n<li>\n<p>Build Multi-step forms</p>\n</li>\n<li>\n<p>Email notification</p>\n</li>\n<li>\n<p>Confirmation code</p>\n</li>\n<li>\n<p>Form validation</p>\n</li>\n<li>\n<p>Easily Localization</p>\n</li>\n<li>\n<p>Offline Forms</p>\n</li>\n<li>\n<p>Build Forms with ReCAPTCHA.</p>\n</li>\n<li>\n<p>Instant reply functionality</p>\n</li>\n<li>\n<p>Support LTR and RTL languages</p>\n</li>\n<li>\n<p>Mobile-friendly form builder plugin</p>\n</li>\n<li>\n<p>Create an Email Template for Email notification</p>\n</li>\n<li>\n<p>Easy to embed forms to WordPress page and post</p>\n</li>\n<li>\n<p>Easy to use and no coding skills are required to build forms</p>\n</li>\n<li>\n<p>New Contact us templates &amp; Examples for creating a contact-us form in less than 1 minute</p>\n</li>\n<li>\n<p>New Support and Feedback template &amp; Example for build support form in 1 minute</p>\n</li>\n<li>\n<p>Easily build any kind of form like contact-us form, survey form, payment form, private form</p>\n</li>\n<li>\n<p>Easy Form Builder is a mobile-friendly form builder and you can easily build forms with Android or iPhone, smartphones or tablets</p>\n</li>\n<li>\n<p>Unlimited form creation</p>\n</li>\n<li>\n<p>Unlimited responses or messages forms</p>\n</li>\n<li>\n<p>Multistep form creation (limited steps)</p>\n</li>\n<li>\n<p>Sample file upload form</p>\n</li>\n<li>\n<p>Create Support forms</p>\n</li>\n<li>\n<p>Create subscription or newsletters forms</p>\n</li>\n<li>\n<p>Create Login (sign-in) forms</p>\n</li>\n<li>\n<p>Create Registration (sign-up) forms</p>\n</li>\n<li>\n<p>Create Surveys (polls) and analyze</p>\n</li>\n<li>\n<p>Build Private forms (lock forms) or Public forms</p>\n</li>\n<li>\n<p>Export subscribers list to CSV format file</p>\n</li>\n<li>\n<p>Mobile-friendly form builder plugin</p>\n</li>\n<li>\n<p>Easy to embed forms to WordPress page and post</p>\n</li>\n<li>\n<p>Sample file upload form</p>\n</li>\n<li>\n<p>Email notification when a form has been submitted</p>\n</li>\n<li>\n<p>Showing a unique confirmation code after filled forms</p>\n</li>\n<li>\n<p>User-friendly and feature-rich panel to manage your forms and their responses</p>\n</li>\n<li>\n<p>Shown Form notification on entry management when having a new response or message</p>\n</li>\n<li>\n<p>Entry Management able to show response messages of forms and edit forms or delete forms</p>\n</li>\n<li>\n<p>Reliable spam protection through Google’s reCAPTCHA v2 and localized automatically to your language</p>\n</li>\n<li>\n<p>Add custom email template for form notification emails</p>\n</li>\n<li>\n<p>Confirmation code (tracking ID) finder form</p>\n</li>\n<li>\n<p>Show survey (poll) results in Pie Chart</p>\n</li>\n<li>\n<p>Easily Localization Easy Form Builder to your language</p>\n</li>\n<li>\n<p>Email notification automatically sends email messages every time a respondent submits your built form on Easy form Builder</p>\n</li>\n<li>\n<p>Professional panel for managing user-filled forms and responses</p>\n</li>\n<li>\n<p><em>Spam Protection</em> : Google ReCaptcha validation added to your forms for enhanced security against spam. for <strong>free</strong>.</p>\n</li>\n<li>\n<p>Download individual filled-out form (messages)</p>\n</li>\n</ul>\n<p><strong>Advanced Forms Field of Easy Form Builder</strong></p>\n<ul>\n<li>\n<p>SMS notification</p>\n</li>\n<li>\n<p>Multiple Select (Multi Selection Dropdown list) field used to select multiple options in a support form or any kind of form</p>\n</li>\n<li>\n<p>Change or Build Email Template for Email notification of forms</p>\n</li>\n<li>\n<p>Forms Templates for creating contact-us or support forms</p>\n</li>\n<li>\n<p>Customizable the thank you message in forms</p>\n</li>\n<li>\n<p>Create any kind of form you want</p>\n</li>\n<li>\n<p>Slide Range Field for building Modern forms <strong>for free</strong></p>\n</li>\n<li>\n<p>With Easy Form Builder, you can use 2 customizable email templates for sending form submission notifications at no cost.</p>\n</li>\n<li>\n<p><em>Create Custom Email Template</em>: with this free feature on Easy Form Builder you can create or add custom email templates for forms. for add custom email template on Easy Form Builder go to “Easy Form Builder” <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> “Settings” <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span>   “Email Template”.</p>\n</li>\n<li>\n<p><em>Spam Protection</em> : Google ReCaptcha validation added to your forms for enhanced security against spam. for <strong>free</strong>.</p>\n</li>\n<li>\n<p><em>Stripe payment</em> : Easily integrate Stripe payment gateway to create payment forms for accepting online payments for various purposes such as order forms, booking forms, and donation forms.</p>\n</li>\n<li>\n<p><em>5 Points Scale</em> : The 5-point scale is a popular method for creating survey forms and poll forms. With Easy Form Builder&#8217;s 5 Points Scale fields, you can easily create beautiful forms, collect responses, and analyze results.</p>\n</li>\n<li>\n<p><em>Net Promoter Score</em> : The Net Promoter Score (NPS) question is a powerful tool for creating effective survey forms and poll forms in Easy Form Builder.</p>\n</li>\n<li>\n<p>With Easy Form Builder, you get a free feature that sends you an email when someone fills out a form on your website. It includes a link to see the response, helping you communicate, engage users, and improve your site&#8217;s search engine rankings.</p>\n</li>\n<li>\n<p>Build secure and integrated Stripe payment forms</p>\n</li>\n<li>\n<p>Create customizable drag and drop file upload forms</p>\n</li>\n<li>\n<p>Design multi-step forms with unlimited steps for better user experience</p>\n</li>\n<li>\n<p>Export survey results to CSV format for easy analysis</p>\n</li>\n<li>\n<p>Export form responses or messages to CSV format for data management</p>\n</li>\n<li>\n<p>Easily create any kind of payment order or service form with customizable payment fields such as  single-choice, selection choose</p>\n</li>\n<li>\n<p>Create advanced forms with specialized fields including location picker (maps), Esign (e-signature), Yes/No question, Star rating, Switch button, and more</p>\n</li>\n<li>\n<p>Customize the thank you page that users are redirected to after completing the form for better engagement and conversion rates.</p>\n</li>\n<li>\n<p>Professional panel for managing user-filled forms and responses</p>\n</li>\n<li>\n<p>Countries list field &amp; States / Provinces list field &amp; Cities list field Easily Create your forms</p>\n</li>\n</ul>\n<p><strong>New Forms Field of Easy Form Builder</strong></p>\n<p><em>SMS Notification</em>: Easy Form Builder offers a robust SMS notification (Text message) feature, enabling real-time communication with your users upon form submission. Ideal for businesses seeking to enhance customer engagement, SMS notification addon of Easy Form Builder allows you to send customized SMS alerts to your clients. You can personalize the message content, ensuring it aligns with your brand voice, and even include a link to the submitted form for easy access. Leverage Easy Form Builder&#8217;s SMS notification or Text message feature to keep your customers informed and engaged.</p>\n<p><em>Drag and Drop file upload</em>: Our user-friendly drag and drop file upload feature makes it easy to add images, videos, audio files, compressed files, and documents (including popular formats like Doc, MS Word, MS Powerpoint, MS Excel, and more) to your online forms. Streamline your support form and enhance your form-building experience with our intuitive file upload function.</p>\n<p><em>Signature Forms</em>: Make your contact forms stand out by adding signature fields for your users to sign. Signature forms can be used for a variety of purposes, such as contracts or agreements. By including this feature in your forms, you can improve user engagement and increase the likelihood of form completion.</p>\n<p><em>Location picker (Geolocation)</em>: Using the WordPress plugin Easy Form Builder, easily add a Geolocation feature to your form, including the Contact Us form. This effective tool allows users to swiftly select one or more points with a location picker using LeafletJs and OpenStreetMap, enabling you to build your forms with a location picker.</p>\n<p><em>Countries list</em>: Make it easy for your users to select their country with the Easy Form Builder&#8217;s country list select field. This drop-down field includes the local names of all countries, making it more user-friendly and accessible. Add it to your Contact Us form or country form today.</p>\n<p><em>States / Provinces</em>: With Easy Form Builder, you can easily add a States / Provinces list select field (drop-down field of states / provinces list) to your form. Our state/province list includes the local names of each region, so you can easily display the state names in any language. Plus, you can easily switch between countries to display the states/provinces of any desired location.</p>\n<p><em>Cities dropdown</em>: With the dropdown city list in the Easy Form Builder, you can include the list of cities for a province in three language modes: English, local language, and English along with the local language in your form. This feature is perfect for creating forms that require users to select their city of residence.</p>\n<p><em>Multiple Select</em>:Add the ability for users to make multiple selections with the Multi-Select (or Multi-Select Dropdown) field. This field is fully customizable and even includes a searchable dropdown list. Easily add this feature to your WordPress form for <strong>free</strong> and improve your user experience.</p>\n<p><em>Heading</em>: With Easy Form Builder, you can add heading fields to your forms, just like H tags, without any coding skills. Customize the size and color of your headings to match your form&#8217;s style and design.</p>\n<p><em>Link</em>: With Easy Form Builder, you can easily add a link field to your WP forms. This feature enables users to include clickable links on their forms for enhanced user experience and improved conversion rates. With Easy Form Builder, you can customize the link field&#8217;s appearance and make it stand out with a variety of text sizes and colors to match your branding.</p>\n<p><em>Secure forms submitting</em>: With Easy Form Builder, you can ensure secure online form submissions. Our validation fields automatically check form data on the client-side before submission and then validate it again on the server-side for added security, all at no additional cost.</p>\n<p><em>Secure File uploads</em>: With Easy Form Builder, you can enjoy secure uploading methods for files and media through your contact forms or other forms. Our platform ensures that the files are safely and privately collected, giving your users peace of mind. Plus, with our <strong>free</strong> service.</p>\n<p><em>Open/Closed responses</em>: You can mark responses or tickets as open or closed directly from the platform. This feature enables you to track the status of your form submissions, ensuring that you provide timely and effective customer support. With Easy Form Builder&#8217;s open/closed responses, you can improve your customer service and increase customer satisfaction rates.</p>\n<p><em>Hijri Date Picker</em> : You can add a Hijri or Arabic Date Picker field to your forms. This feature is perfect for creating forms that require Arabic or Islamic date selection. The Hijri Date Picker is easy to use and allows your users to select a date from the Islamic calendar with ease. With Easy Form Builder, you can customize the appearance of the Hijri Date Picker field to match your form&#8217;s design and branding.</p>\n<p><em>Jalali Date Picker</em> : With Easy Form Builder&#8217;s Shamsi Date Picker, you can easily create forms that include Persian or Jalali date fields. This feature is perfect for users who need to collect dates according to the Persian calendar system.</p>\n<p><em>Cell Phone Input Field</em> :you can easily add a cell phone input field to your forms, allowing users to input their phone number with ease. Additionally, this feature includes the option to limit the input to specific countries, ensuring that users provide phone numbers in the correct format for your needs. With this powerful tool included in our form builder, you can create a wide range of forms, from contact forms to registration forms and beyond, all with the ability to collect cell phone numbers in a hassle-free manner.</p>\n<p>For more information, check out our comprehensive documentation <a href=\"https://whitestudio.team/documents\" rel=\"nofollow ugc\">Click Here</a></p>\n<p><strong>Notice</strong>: Avoid adding more than one form per page..</p>\n<p>Report bugs and improve Easy Form Builder by <a href=\"https://github.com/hassantafreshi/easy-form-builder/issues\" rel=\"nofollow ugc\">create a ticket on GitHub</a> or contact us on <a href=\"https://whitestudio.team/contact-us/\" rel=\"nofollow ugc\">whitestudio.team</a></p>\n<p>The country, state/province, and city information in the Easy Form Builder is sourced from cdn.jsdelivr.net. If there are any inaccuracies or mistakes in the city or country names, please <a href=\"https://github.com/hassantafreshi/Json-List-of-countries-states-and-cities-in-the-world\" rel=\"nofollow ugc\">report here on GitHub</a>.</p>\n<p>Easy Form Builder offers a variety of templates and examples to help you create customized forms for your website, whether it&#8217;s for contact, survey, payment, or private purposes. Its easy-to-use drag-and-drop interface allows you to create forms in minutes and seamlessly embed them into any WordPress page or post. With no coding skills required, you can create professional-looking forms that meet your specific needs.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/easy-form-builder.3.8.4.zip",
    "upgrade_notice": {
        "3.7.13": "<p>Starting from version 3.7.13, if you are using the Pro package of Easy Form Builder, all addons will be downloaded automatically. For free users of Easy Form Builder, all updates will be provided by wordpress.org.</p>",
        "1.29": "<p>This is the first release of Easy Form Builder. Download it to make building forms a breeze!</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-1.gif?rev=2744527",
            "caption": "Form Builder"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-2.png?rev=2744527",
            "caption": "Create a form"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-3.png?rev=2727795",
            "caption": "Preview a form"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-4.png?rev=2727795",
            "caption": "Panel of Easy Form Builder"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-5.png?rev=2618751",
            "caption": "List of responses"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-6.png?rev=3015183",
            "caption": "Setting of Easy Form Builder"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-7.png?rev=2618751",
            "caption": "Present chart of poll"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-8.png?rev=2618751",
            "caption": "Form submitted and Confirmation Code (tracking pixels)"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-9.png?rev=2906054",
            "caption": "Create a contact-us form"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-10.png?rev=2644056",
            "caption": "Localization Easy Form Builder to your language"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-11.png?rev=2696701",
            "caption": "Email template Editor of Easy Form Builder"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-12.png?rev=2727795",
            "caption": "Order payment forms"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-13.png?rev=3096103",
            "caption": "configuration Response box of Easy Form Builder"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-14.png?rev=3096103",
            "caption": "Email Setting of Easy Form Builder"
        },
        {
            "src": "https://ps.w.org/easy-form-builder/assets/screenshot-15.png?rev=3096103",
            "caption": "SMS configuration of Easy From Builder"
        }
    ],
    "tags": {
        "contact-form": "contact form",
        "form-builder": "form builder",
        "form-creator": "form creator",
        "subscribe-form": "subscribe form",
        "support-form": "support form"
    },
    "stable_tag": "3.8.4",
    "versions": {
        "1.30": "https://downloads.wordpress.org/plugin/easy-form-builder.1.30.zip",
        "1.31": "https://downloads.wordpress.org/plugin/easy-form-builder.1.31.zip",
        "1.31.1": "https://downloads.wordpress.org/plugin/easy-form-builder.1.31.1.zip",
        "1.31.2": "https://downloads.wordpress.org/plugin/easy-form-builder.1.31.2.zip",
        "1.31.3": "https://downloads.wordpress.org/plugin/easy-form-builder.1.31.3.zip",
        "1.31.4": "https://downloads.wordpress.org/plugin/easy-form-builder.1.31.4.zip",
        "1.31.5": "https://downloads.wordpress.org/plugin/easy-form-builder.1.31.5.zip",
        "1.31.6": "https://downloads.wordpress.org/plugin/easy-form-builder.1.31.6.zip",
        "1.31.7": "https://downloads.wordpress.org/plugin/easy-form-builder.1.31.7.zip",
        "1.31.8": "https://downloads.wordpress.org/plugin/easy-form-builder.1.31.8.zip",
        "1.31.9": "https://downloads.wordpress.org/plugin/easy-form-builder.1.31.9.zip",
        "1.32.0": "https://downloads.wordpress.org/plugin/easy-form-builder.1.32.0.zip",
        "1.32.1": "https://downloads.wordpress.org/plugin/easy-form-builder.1.32.1.zip",
        "1.32.2": "https://downloads.wordpress.org/plugin/easy-form-builder.1.32.2.zip",
        "1.32.3": "https://downloads.wordpress.org/plugin/easy-form-builder.1.32.3.zip",
        "1.32.4": "https://downloads.wordpress.org/plugin/easy-form-builder.1.32.4.zip",
        "1.32.5": "https://downloads.wordpress.org/plugin/easy-form-builder.1.32.5.zip",
        "1.32.6": "https://downloads.wordpress.org/plugin/easy-form-builder.1.32.6.zip",
        "1.32.7": "https://downloads.wordpress.org/plugin/easy-form-builder.1.32.7.zip",
        "1.32.8": "https://downloads.wordpress.org/plugin/easy-form-builder.1.32.8.zip",
        "1.32.9": "https://downloads.wordpress.org/plugin/easy-form-builder.1.32.9.zip",
        "1.33.0": "https://downloads.wordpress.org/plugin/easy-form-builder.1.33.0.zip",
        "1.33.1": "https://downloads.wordpress.org/plugin/easy-form-builder.1.33.1.zip",
        "1.33.2": "https://downloads.wordpress.org/plugin/easy-form-builder.1.33.2.zip",
        "1.33.3": "https://downloads.wordpress.org/plugin/easy-form-builder.1.33.3.zip",
        "1.33.4": "https://downloads.wordpress.org/plugin/easy-form-builder.1.33.4.zip",
        "1.33.5": "https://downloads.wordpress.org/plugin/easy-form-builder.1.33.5.zip",
        "1.33.6": "https://downloads.wordpress.org/plugin/easy-form-builder.1.33.6.zip",
        "1.33.7": "https://downloads.wordpress.org/plugin/easy-form-builder.1.33.7.zip",
        "1.34": "https://downloads.wordpress.org/plugin/easy-form-builder.1.34.zip",
        "1.34.1": "https://downloads.wordpress.org/plugin/easy-form-builder.1.34.1.zip",
        "1.34.2": "https://downloads.wordpress.org/plugin/easy-form-builder.1.34.2.zip",
        "1.34.3": "https://downloads.wordpress.org/plugin/easy-form-builder.1.34.3.zip",
        "1.34.5": "https://downloads.wordpress.org/plugin/easy-form-builder.1.34.5.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.1.zip",
        "2.0.10": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.10.zip",
        "2.0.11": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.11.zip",
        "2.0.12": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.12.zip",
        "2.0.13": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.13.zip",
        "2.0.14": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.14.zip",
        "2.0.15": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.15.zip",
        "2.0.16": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.16.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.5.zip",
        "2.0.6": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.6.zip",
        "2.0.7": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.7.zip",
        "2.0.8": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.8.zip",
        "2.0.9": "https://downloads.wordpress.org/plugin/easy-form-builder.2.0.9.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/easy-form-builder.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/easy-form-builder.2.1.1.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.1.zip",
        "2.2.10": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.10.zip",
        "2.2.11": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.11.zip",
        "2.2.12": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.12.zip",
        "2.2.13": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.13.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.2.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.3.zip",
        "2.2.4": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.4.zip",
        "2.2.5": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.5.zip",
        "2.2.6": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.6.zip",
        "2.2.7": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.7.zip",
        "2.2.8": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.8.zip",
        "2.2.9": "https://downloads.wordpress.org/plugin/easy-form-builder.2.2.9.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.0.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.1.zip",
        "2.3.10": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.10.zip",
        "2.3.11": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.11.zip",
        "2.3.12": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.12.zip",
        "2.3.13": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.13.zip",
        "2.3.14": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.14.zip",
        "2.3.15": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.15.zip",
        "2.3.16": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.16.zip",
        "2.3.17": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.17.zip",
        "2.3.18": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.18.zip",
        "2.3.19": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.19.zip",
        "2.3.2": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.2.zip",
        "2.3.20": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.20.zip",
        "2.3.21": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.21.zip",
        "2.3.22": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.22.zip",
        "2.3.3": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.3.zip",
        "2.3.4": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.4.zip",
        "2.3.5": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.5.zip",
        "2.3.6": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.6.zip",
        "2.3.7": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.7.zip",
        "2.3.8": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.8.zip",
        "2.3.9": "https://downloads.wordpress.org/plugin/easy-form-builder.2.3.9.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/easy-form-builder.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/easy-form-builder.3.0.1.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/easy-form-builder.3.1.0.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/easy-form-builder.3.1.1.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/easy-form-builder.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/easy-form-builder.3.2.1.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/easy-form-builder.3.2.2.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/easy-form-builder.3.2.3.zip",
        "3.2.4": "https://downloads.wordpress.org/plugin/easy-form-builder.3.2.4.zip",
        "3.2.5": "https://downloads.wordpress.org/plugin/easy-form-builder.3.2.5.zip",
        "3.2.6": "https://downloads.wordpress.org/plugin/easy-form-builder.3.2.6.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/easy-form-builder.3.3.0.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/easy-form-builder.3.3.1.zip",
        "3.3.2": "https://downloads.wordpress.org/plugin/easy-form-builder.3.3.2.zip",
        "3.3.3": "https://downloads.wordpress.org/plugin/easy-form-builder.3.3.3.zip",
        "3.3.4": "https://downloads.wordpress.org/plugin/easy-form-builder.3.3.4.zip",
        "3.3.5": "https://downloads.wordpress.org/plugin/easy-form-builder.3.3.5.zip",
        "3.3.6": "https://downloads.wordpress.org/plugin/easy-form-builder.3.3.6.zip",
        "3.3.7": "https://downloads.wordpress.org/plugin/easy-form-builder.3.3.7.zip",
        "3.3.8": "https://downloads.wordpress.org/plugin/easy-form-builder.3.3.8.zip",
        "3.4.0": "https://downloads.wordpress.org/plugin/easy-form-builder.3.4.0.zip",
        "3.4.1": "https://downloads.wordpress.org/plugin/easy-form-builder.3.4.1.zip",
        "3.4.2": "https://downloads.wordpress.org/plugin/easy-form-builder.3.4.2.zip",
        "3.5.0": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.0.zip",
        "3.5.1": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.1.zip",
        "3.5.10": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.10.zip",
        "3.5.11": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.11.zip",
        "3.5.12": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.12.zip",
        "3.5.13": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.13.zip",
        "3.5.14": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.14.zip",
        "3.5.15": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.15.zip",
        "3.5.16": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.16.zip",
        "3.5.17": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.17.zip",
        "3.5.18": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.18.zip",
        "3.5.19": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.19.zip",
        "3.5.2": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.2.zip",
        "3.5.20": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.20.zip",
        "3.5.21": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.21.zip",
        "3.5.22": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.22.zip",
        "3.5.23": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.23.zip",
        "3.5.24": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.24.zip",
        "3.5.25": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.25.zip",
        "3.5.26": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.26.zip",
        "3.5.27": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.27.zip",
        "3.5.28": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.28.zip",
        "3.5.29": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.29.zip",
        "3.5.3": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.3.zip",
        "3.5.30": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.30.zip",
        "3.5.31": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.31.zip",
        "3.5.32": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.32.zip",
        "3.5.33": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.33.zip",
        "3.5.34": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.34.zip",
        "3.5.4": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.4.zip",
        "3.5.5": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.5.zip",
        "3.5.6": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.6.zip",
        "3.5.7": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.7.zip",
        "3.5.8": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.8.zip",
        "3.5.9": "https://downloads.wordpress.org/plugin/easy-form-builder.3.5.9.zip",
        "3.6.0": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.0.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.1.zip",
        "3.6.10": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.10.zip",
        "3.6.11": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.11.zip",
        "3.6.12": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.12.zip",
        "3.6.13": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.13.zip",
        "3.6.14": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.14.zip",
        "3.6.15": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.15.zip",
        "3.6.16": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.16.zip",
        "3.6.2": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.2.zip",
        "3.6.3": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.3.zip",
        "3.6.4": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.4.zip",
        "3.6.5": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.5.zip",
        "3.6.6": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.6.zip",
        "3.6.7": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.7.zip",
        "3.6.8": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.8.zip",
        "3.6.9": "https://downloads.wordpress.org/plugin/easy-form-builder.3.6.9.zip",
        "3.7.1": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.1.zip",
        "3.7.10": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.10.zip",
        "3.7.11": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.11.zip",
        "3.7.12": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.12.zip",
        "3.7.13": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.13.zip",
        "3.7.14": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.14.zip",
        "3.7.15": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.15.zip",
        "3.7.16": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.16.zip",
        "3.7.17": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.17.zip",
        "3.7.18": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.18.zip",
        "3.7.19": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.19.zip",
        "3.7.2": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.2.zip",
        "3.7.20": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.20.zip",
        "3.7.21": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.21.zip",
        "3.7.22": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.22.zip",
        "3.7.23": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.23.zip",
        "3.7.24": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.24.zip",
        "3.7.25": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.25.zip",
        "3.7.26": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.26.zip",
        "3.7.27": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.27.zip",
        "3.7.28": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.28.zip",
        "3.7.29": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.29.zip",
        "3.7.3": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.3.zip",
        "3.7.30": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.30.zip",
        "3.7.31": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.31.zip",
        "3.7.32": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.32.zip",
        "3.7.33": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.33.zip",
        "3.7.34": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.34.zip",
        "3.7.35": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.35.zip",
        "3.7.4": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.4.zip",
        "3.7.5": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.5.zip",
        "3.7.6": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.6.zip",
        "3.7.7": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.7.zip",
        "3.7.8": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.8.zip",
        "3.7.9": "https://downloads.wordpress.org/plugin/easy-form-builder.3.7.9.zip",
        "3.8.0": "https://downloads.wordpress.org/plugin/easy-form-builder.3.8.0.zip",
        "3.8.1": "https://downloads.wordpress.org/plugin/easy-form-builder.3.8.1.zip",
        "3.8.2": "https://downloads.wordpress.org/plugin/easy-form-builder.3.8.2.zip",
        "3.8.3": "https://downloads.wordpress.org/plugin/easy-form-builder.3.8.3.zip",
        "3.8.4": "https://downloads.wordpress.org/plugin/easy-form-builder.3.8.4.zip",
        "trunk": "https://downloads.wordpress.org/plugin/easy-form-builder.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://whitestudio.team/donate-easy-form-builder/",
    "banners": {
        "low": "https://ps.w.org/easy-form-builder/assets/banner-772x250.png?rev=3015183",
        "high": "https://ps.w.org/easy-form-builder/assets/banner-1544x500.png?rev=3015183"
    },
    "icons": {
        "1x": "https://ps.w.org/easy-form-builder/assets/icon-128x128.gif?rev=2906054",
        "2x": "https://ps.w.org/easy-form-builder/assets/icon-256x256.gif?rev=2906054"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "easy-form-builder",
            "language": "ar",
            "version": "3.8.4",
            "updated": "2024-07-26 16:08:01",
            "package": "http://downloads.wordpress.org/translation/plugin/easy-form-builder/3.8.4/ar.zip"
        },
        {
            "type": "plugin",
            "slug": "easy-form-builder",
            "language": "da_DK",
            "version": "3.8.4",
            "updated": "2021-06-25 10:57:53",
            "package": "http://downloads.wordpress.org/translation/plugin/easy-form-builder/3.8.4/da_DK.zip"
        },
        {
            "type": "plugin",
            "slug": "easy-form-builder",
            "language": "de_DE_formal",
            "version": "3.8.4",
            "updated": "2024-08-18 14:08:12",
            "package": "http://downloads.wordpress.org/translation/plugin/easy-form-builder/3.8.4/de_DE_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "easy-form-builder",
            "language": "de_DE",
            "version": "3.8.4",
            "updated": "2024-08-18 14:08:03",
            "package": "http://downloads.wordpress.org/translation/plugin/easy-form-builder/3.8.4/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "easy-form-builder",
            "language": "fa_IR",
            "version": "3.8.4",
            "updated": "2024-08-03 23:39:14",
            "package": "http://downloads.wordpress.org/translation/plugin/easy-form-builder/3.8.4/fa_IR.zip"
        },
        {
            "type": "plugin",
            "slug": "easy-form-builder",
            "language": "hi_IN",
            "version": "3.8.4",
            "updated": "2024-06-09 12:23:19",
            "package": "http://downloads.wordpress.org/translation/plugin/easy-form-builder/3.8.4/hi_IN.zip"
        },
        {
            "type": "plugin",
            "slug": "easy-form-builder",
            "language": "nl_NL_formal",
            "version": "3.8.4",
            "updated": "2024-07-12 15:30:43",
            "package": "http://downloads.wordpress.org/translation/plugin/easy-form-builder/3.8.4/nl_NL_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "easy-form-builder",
            "language": "nl_NL",
            "version": "3.8.4",
            "updated": "2024-07-12 11:47:57",
            "package": "http://downloads.wordpress.org/translation/plugin/easy-form-builder/3.8.4/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "easy-form-builder",
            "language": "ru_RU",
            "version": "3.8.4",
            "updated": "2024-03-15 14:21:25",
            "package": "http://downloads.wordpress.org/translation/plugin/easy-form-builder/3.8.4/ru_RU.zip"
        }
    ]
}