{
    "name": "EasyfullsearchWP",
    "slug": "easyfullsearch",
    "version": "1.0",
    "author": "<a href=\"http://jarleton.com\">Michel Jarleton</a>",
    "author_profile": "https://profiles.wordpress.org/mjarleton/",
    "contributors": {
        "mjarleton": {
            "profile": "https://profiles.wordpress.org/mjarleton/",
            "avatar": "https://secure.gravatar.com/avatar/849a6bb33304cd71bd934706946d1507?s=96&d=monsterid&r=g",
            "display_name": "mjarleton"
        }
    },
    "requires": "3.0.1",
    "tested": "4.6.29",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/easyfullsearch/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 0,
    "downloaded": 973,
    "last_updated": "2016-12-01 18:35:00",
    "added": "2016-11-30",
    "homepage": "",
    "sections": {
        "description": "<p>EasyfullsearchWP replaces the native WordPress search engine to improve the effectiveness and relevance of all searches.<br />\nIt lets you manage posts an/or pages, to choose the fields you want to use in the searches (including comments, author, custom fields, categories, taxonomy &#8230;).<br />\nBy giving you predefined values, it helps you to easyly improve your user&#8217;s experience.</p>\n<p>As the easyfullsearch engine is more powerful than the basic wordpress search mechanism. it allows administrator and developer to use the wide range of features of the easyfullsearch engine.</p>\n<p>This version is the free version of EasyfullsearchWP. Presently, easyfullsearchWP is managing main user&#8217;s searches coming from the search widget or administation&#8217;s pages.</p>\n<p>Easyfullsearch has a companion tool, called Efsmyadmin. This tool gives you access to a large amount of functions to manage the index. It is available on the Easyfullsearch&#8217;s web site (http://www.easyfullsearch.com).</p>\n<h4>Key features</h4>\n<ul>\n<li>Results are sorted in the order of relevance according to configurable weights.</li>\n<li>A very fast retrieving process.</li>\n<li>You can choose to have a strict matching (all the words) or flexible (at least one of them.) This may be an automatic option.</li>\n<li>The fuzzy logic may be used to match results (never, always or only if the strict match is not fruitful). The fuzzy words are extracted from the content itself.</li>\n<li>The date can be used as complement of the sort algorithm.</li>\n<li>You can decide to use search for posts and/or pages. </li>\n<li>You can choose to search in different fields : title, content, comments, tags, categories and custom fields.</li>\n<li>You give your own weight to each fields</li>\n<li>A full documentation is available directly through the settings menu.</li>\n<li>You can highlight the relevant terms</li>\n</ul>\n<h4>Advanced features</h4>\n<ul>\n<li>A very fast indexing process. </li>\n<li>You can search only in fields which are pertinent for you (for example you can exclude the comments or the title !).</li>\n<li>You can choose to use the Easyfullsearch for the users&#8217; searches or administration&#8217;s searches. </li>\n<li>You can choose the types of posts to search  (post and/or pages)</li>\n<li>The search on each types can be easyly turned &#8220;on&#8221; or &#8220;off&#8221;.</li>\n<li>You can choose the weighting for all types of fields. You don&#8217;t need to rebuild the index after changing them.</li>\n<li>You can optimize the index for the most used words.</li>\n<li>You can log the users&#8217; requests, and see what exactly happened in your site.</li>\n<li>Custom post types and custom taxonomies can be used and weigthed as the others fields.</li>\n<li>EaysfullsearchWP supports the polylang plugin</li>\n<li>Easyfullsearch supports site with huge base and hundreds of thousands of posts.</li>\n<li>EaysfullsearchWP lets you easyly manage the stop words (create, suppress, add a language &#8230;)</li>\n<li>The plugin automaticaly limits the disk space used for logs</li>\n<li>EasyfullsearchWP uses queued inserts to protect the index against  inconsistency.</li>\n</ul>\n<h4>Coming</h4>\n<ul>\n<li>Enhance statistics</li>\n<li>Manage automatic suggestion. The autocomplete is already part of the engine.</li>\n</ul>\n<h3>Translations</h3>\n<ul>\n<li>English &#8211; default, always included</li>\n<li>French &#8211; toujours disponible</li>\n</ul>\n<h3>Settings</h3>\n<p>The plugin&#8217;s settings are managed through an unique administration page. This page is part of the &#8220;settings&#8221; menu, in administration interface of the site.  The administration page is nammed &#8220;Easy Full Search&#8221;.</p>\n<p>This page is composed of different sections (all these points are discussed in later sections  :</p>\n<ul>\n<li>&#8220;<strong>Main actions</strong>&#8221;  : Contains the basic actions to set up the plugin</li>\n<li>&#8220;<strong>Index values</strong>&#8221; : Gives informations about state and values of the index</li>\n<li>&#8220;<strong>Search : post types</strong>&#8221; : Allows to choose which types of elements are to be included in the search results</li>\n<li>&#8220;<strong>Search : fields and sort</strong>&#8221; : Lets choose  weight and sort&#8217;s order of each elements in the search result</li>\n<li>&#8220;<strong>Search : sort with date</strong>&#8220;: Lets choose the way that the dates are used as criteria in the results</li>\n<li>&#8220;<strong>Search : operators</strong>&#8221; : Lets you decide the operators used in the regular search</li>\n<li>&#8220;<strong>Stop words</strong>&#8221; : Manages the list of stop words according to the language</li>\n<li>&#8220;<strong>Change current user</strong>&#8221; : Lets you change the current user and its password. </li>\n<li>&#8220;<strong>Miscellaneous</strong>&#8221; : Others actions</li>\n</ul>\n<p>This part describes in detail all the setting sections.</p>\n<h3>Main concepts</h3>\n<p>In order to understand options and actions available in the setting page, some concepts of Easyfullsearch should  be explained .</p>\n<p>Easyfullsearch (also called EFS) is a generic search engine for full text and faceting searches. It is written in php language. Its goal is to have a modern and powerful search engine, fully integrated in the php environment. Easyfullsearch is self sufficient. It doesn&#8217;t use any external database.</p>\n<p>Easyfullsearch uses some basic concepts :</p>\n<ul>\n<li>\n<p>&#8220;<strong>index</strong>&#8221; : the place where Easyfullsearch stores all the data used to deliver the service<br />\nEasyfullsearch manages its own index (a collection of files). It doesn&#8217;t use generic databases (such as mysql). An index contains all files needed to manage queries.<br />\nThe index is a subdirectory of the &#8220;efs_data&#8221; directory (which is directly under the easyfullsearchWp directory). Easyfullsearch could manage multiple index. in the case of wordpress, only one index is created. The name of the index (the directory itself) is based on the name of the site.</p>\n<p>It means that if you remove the plugin, the index will be also remove. It also means that you can save all the index by saving its directory. You also could move the index from one server to another by simply moving this directory. In this case you must also be sure that wordpress&#8217; references (posts&#8217; ids ) are unchanged. The index uses the wordpress&#8217; ids as item references.</p>\n</li>\n<li>\n<p>&#8220;<strong>item</strong>&#8221; : All entities stored in an index are called item. An item is a collection of fields. This generic term is use to show that an item could be a set of words, posts, pages, classified &#8230; and can be more complex than a simple document. In the case of wordpress, an item is a post or a page. This means results may contain post or page references.</p>\n</li>\n<li>\n<p>&#8220;<strong>Item id</strong>&#8221; : A unique id to identify an item. In the case of wordpress the item id is directly the wordress id associated to the post or the page.</p>\n</li>\n<li>\n<p>&#8220;<strong>Field</strong>&#8221; : The fileds are the different parts of an item (such as title, content, date &#8230;). Fields are containing terms. In the case of wordpress mains fields associated to an item are : title, content, comments, author, attached files, dates &#8230;</p>\n</li>\n<li>\n<p>&#8220;<strong>Term</strong>&#8221; : The basic element in a field (in general a word, a date &#8230;)</p>\n</li>\n</ul>\n<p>Basically, in the wordpress usage, the &#8220;items&#8221; are posts or pages, the &#8220;fields&#8221; are the different parts of the item (such as post_title, post_content &#8230;), and the &#8220;terms&#8221; are words extracted from the fields.</p>\n<p>That&#8217;s enough for concepts. More explanation can be found in the easyfullsearch website (http://www.easyfullsearch.com)</p>\n<h3>Section : &#8220;Main actions&#8221;</h3>\n<p>This section contains the most useful actions to manage the plugin. In most of cases, you only need these.</p>\n<h4>Button :  &#8220;Update the index&#8221;</h4>\n<ul>\n<li>\n<p>This button is useful if your web site contains items befoe you install the easyfullsearchWP plugin. As the index is empty at the activation, you have to index all already existing items (pots, pages). It&#8217;s also the case if you remove all items from the index (button &#8220;Empty the index&#8221; ).</p>\n<p>This action will search in the wordpress base all the items (posts, pages &#8230;) to index. You can give a large amount of items to index in one pass. A default value is generated according to the capability of your server to process the operation. The suggested value is &#8220;safe&#8221;. Easyfullsearch has a great capability of fast indexing.</p>\n<p>easyfullsearchWP memorise the last id indexed (see informations section). If all item are not indexed, the process continue from the last indexed item. If all items can&#8217;t be indexed in one pass, you need to repeat the operation. The value suggested will be zero if Easyfullsearch finds that all items are indexed. in general site with less than 20 000 ietms will take few minutes to index all the base. If you have very large bases and need some help, let me know.</p>\n<p>All posts and pages created or modified after the activation of the plugin will be automatically indexed.</p>\n<p>If your wordpress site have no page and no post awhen you activate the plugin, you have nothing to do. All pages or posts will be automatically added to the index when they will be published.</p>\n</li>\n</ul>\n<h4>Option : &#8220;Use easyfullsearch for users&#8217;s searches&#8221;</h4>\n<ul>\n<li>\n<p>When you activate the plugin, easyfullsearch will not automaticaly replace the standard wordperss search mechanism. As discussed before, some posts or pages may be not indexed at that time. To use actually the plugin in user&#8217;s searches you have to activate it by checking the check box of this option.</p>\n<p>It allows you to temporary use the standard wordpress search. You don&#8217;t have to desactivate the plugin to do that. Even if this option is not checked, Easyfullsearch continues to index all the created or modified items.</p>\n</li>\n</ul>\n<h4>Option : &#8220;Use search for admin&#8221;</h4>\n<ul>\n<li>\n<p>When you activate the plugin, easyfullsearch will not automaticaly replace the standard wordperss search mechanism in the administration menu. As for users&#8217; searches, some posts or pages may be not indexed at that time. To use actually the plugin in the administration menu, you have to activate it by checking the check box of this option.</p>\n<p>It allows you to temporary use the standard wordpress search. You don&#8217;t have to desactivate the plugin to do that. Even if this option is not checked, Easyfullsearch continues to index all the created or modified items.</p>\n</li>\n</ul>\n<h4>Button : &#8220;save options&#8221;</h4>\n<ul>\n<li>This button will save main options. (see above).</li>\n</ul>\n<h3>Section : &#8220;Index values&#8221;</h3>\n<p>This section gives basic useful information about the index. All information is given to help or satisfy curiosity. In general you doesn&#8217;t really need them.</p>\n<h4>Information : &#8220;Index name&#8221;</h4>\n<ul>\n<li>The name of the index. It have been generated during the installation. It is composed with the prefix WP and the name of your website. The result is something like &#8220;WPmysite&#8221;. </li>\n</ul>\n<h4>Information : &#8220;Index Dir&#8221;</h4>\n<ul>\n<li>\n<p>The path of the directory containing the index. All files of the index are stored in this directory (with subdirectories). The regular name is : mysite\\wp-content\\plugins\\easyfullsearchWP/efs_data/index_WPmysite.</p>\n<p>As you see easyfullsearchWP created a subdirectory called efs_data. The actual directory of the index is &#8220;index_WPmysite&#8221;.</p>\n</li>\n</ul>\n<h4>Information : &#8220;Created date&#8221;</h4>\n<ul>\n<li>The date of creation of the index. Actually it is the first activation of the plugin. </li>\n</ul>\n<h4>Information : &#8220;Last update&#8221;</h4>\n<ul>\n<li>The last time the index have been updated (means an item has been created, updated or deleted).</li>\n</ul>\n<h4>Information : &#8220;Estimated indexed items (posts,pages)&#8221;</h4>\n<ul>\n<li>This is the estimated number of items in the index. In some cases this can be different from the reality of a few units)</li>\n</ul>\n<h3>Section : &#8220;Search : post type&#8221;</h3>\n<p>This section lets you manage the type of elements to include in the search.</p>\n<p>The list of indexed elements, associated to checkbox, allows you to manage each of them. The fact to check or not a type doesn&#8217;t means you need to rebuild the index.<br />\nYou can manage the fields used in the search itself in the next part of the options.</p>\n<h4>Option : &#8220;Post&#8221;</h4>\n<ul>\n<li>If checked, queries will search in posts&#8217; content.</li>\n</ul>\n<h4>Option : &#8220;Page&#8221;</h4>\n<ul>\n<li>If checked, queries will search in pages&#8217;s content</li>\n</ul>\n<h3>Section : &#8220;Search : fields and sort&#8221;</h3>\n<p>This section is important. Default values have been defined to insure the maximum quality of results. A more precise tuning may be usefull depending the content itself. To correctly manage this part, you need to understand how results are sorted.</p>\n<p>When you change the weight of fields, the next searches will be execute according to these values. It&#8217;s not necessary to rebuild the index. So you can try different options to find the best values.<br />\nTo present how easyfullsearch sorts the results, you have to consider two axes. The first is the weight of each field in the sort. The second is the fact to separate different fields.</p>\n<p>In general search engines combine both by only using a weight attached to each field, the common manner is to give a higher weight to the most important field. But this way introduced a few unexpected sorting results or required to have a smaller range of values for less important fields, giving sometimes confusing results.</p>\n<p>The approach used by easyfullsearch is more powerful, even if we only use a part of it in this plugin. Basically, we have two &#8220;sorting methods&#8221;.</p>\n<p>The first is an associated calculation of occurrence and fields. For each selected field, the number of occurrence is multiplied by the weight associated to the field. This mechanism lets you decide the combination of weight. If you want to favour one field, you just have to give it a large weight. If you want to have more mixed results, you can give a narrower range of weight. The default values are set up to give priority to the title (weight of 10000) but if another item contains a lot of occurrences in the content field (weight of 1000, it can have the same final weight.</p>\n<p>The second one is the date (day/month or year) of the last updated of the post or the page. The value of the date is managed by wordpress. The choose of &#8220;day&#8221; as smaller value have been done to limit the effect of date in the result. The use of date may be more time consuming if you have a large amount of results. You must consider the fact that this option in unnecessary in general.</p>\n<p>This section contains the list of fields which could be used or not, and the weight associated to each of them. Let consider the first column</p>\n<p><strong>The first column</strong> lets you choose which fields will be used in the search proccess. You could change it as you like without re-indexing. This will be directly use in the next search (user or admin).</p>\n<p>The fields are applicable as well to the posts or pages</p>\n<ul>\n<li><strong>title</strong> : search, or not, in the title of item</li>\n<li><strong>content</strong> : search, or not, in the content of item</li>\n<li><strong>comments</strong> : search, or not, in the comments associated to an item. The EasyfullsearchWp plugin aggregates all comments text as only  one. This new created field is part of the element</li>\n<li><strong>author</strong> : search, or not, in the author name associated to the item        </li>\n<li><strong>tags</strong>  : search, or not, in the tags associated to the item</li>\n<li><strong>taxonomy</strong>  : search, or not, in the taxonomy values associated to the item</li>\n<li><strong>custom_content</strong> : If custom fields are are defined, search, or not, in their content. The EasyfullsearchWp plugin aggregates all these contents as only  one. This new created field is part of the element.</li>\n<li><strong>attachment_text</strong> : search, or not, in the text associated to item&#8217;s attachment (such as the name of a file). Presently, this doesn&#8217;t allow to search in the attachment content itself (may be next &#8230;).</li>\n</ul>\n<p><strong>The second column</strong> gives the weight associated to each field. If you want to change default values.You need to understand how the results are sorted to well manage this part. See explanations above.</p>\n<p>If you give a value of 0 to a field, it just give it a null weight. This doesn&#8217;t mean that the field is not used in the search. It means that this field is not important in the sorting process. So, a post could be part of the result even if one occurence have been found only in this field. It will simply placed at the end of results. To exclude a field, use the previous options in the first column.</p>\n<p>You could change the weights as you like. The next searches will be executed according to these values ( without rebuilding the index). In general, you have to try different options. As next searches will use the new values, you can directly test them. Easyfullsearch offers you a large liberty to establish your own balance.</p>\n<h3>Section : &#8220;Search : sort with date&#8221;</h3>\n<p>After establishing the use and the weight of each field, you could choose to also considering the date in the sort process. In this case you can choose to give priority to the date compared to the fields. the date could be used <em>before</em> (means the newer item will be classified first) or <em>after</em> (means that if two items have the same weight, the newer one will be classified first).</p>\n<h4>Option : &#8220;Use the date as a sorting criterion&#8221;</h4>\n<ul>\n<li>If checked the date is part of the sorting process. The use of date may be more time consuming if you have a large amount of results</li>\n</ul>\n<h4>Option : &#8220;Use the date criterion before the weights&#8221;</h4>\n<ul>\n<li>As described above, if checked, results will be sorted using date criterion before those of weights associated to the fields.</li>\n</ul>\n<h4>Option : &#8220;Choose the period of the date for sorting&#8221;</h4>\n<ul>\n<li>This option lets you manage the date period used as criterion. The avalaible periods are day, month and year.</li>\n</ul>\n<h3>Section : &#8220;Search : operators&#8221;</h3>\n<h4>Option : &#8220;Use AND as default operator&#8221;</h4>\n<ul>\n<li>\n<p>This options lets you to choose the default operator if the search string contains more than one term (&#8220;AND&#8221; or &#8220;OR&#8221;). The alternative is to search all of the terms (the AND operator, the default value), or at least one of them (the OR operator). Lets consider the &#8220;Vinci code film&#8221; search.</p>\n<p>If you check the AND option , the query will be interpreted as  &#8220;Vinci AND code AND film&#8221;. This way may be more natural, but it is also more restrictive. You could be desapointed not seeing some results.</p>\n<p>If you let the option unchecked,the &#8220;OR&#8221; operator will be used. In this case the query will be interpreted as &#8220;Vinci OR code OR film&#8221;. On one hand, you will have more results, on the other hand the results may  contain posts or pages less relevant.</p>\n</li>\n</ul>\n<h4>Option : &#8220;Use OR operator if no results&#8221;</h4>\n<ul>\n<li>If you choose the &#8216;AND&#8217; operator as default, you can check this option to indicate to EasyfullsearchWP to try the &#8216;OR&#8217; operator if no results are returned after the search. In fact if no posts or pages contain &#8220;Vinci AND code AND film&#8221;, Easyfullsearch will try to find some results for &#8220;Vinci OR code OR film&#8221;.</li>\n</ul>\n<h4>Option : &#8220;Use fuzzy query &#8220;</h4>\n<ul>\n<li>Easyfullsearch engine is able to generate &#8220;fuzzy&#8221; searches. The terms are taken from the dictionnary of the actual content of the index (not from the requests). According to the last generation of dictionnaries, easyfullesearch try to find approching terms and to include them in the search. This option is powerful but it could be time consuming. if many &#8220;fuzzy&#8221; terms are used. This could slow your site.<br />\nit needs that the the dictionnary have been generated. The more recent it is, the more relevant may be the fuzzy logic.</li>\n</ul>\n<h4>Option : &#8220;Default language&#8221;</h4>\n<ul>\n<li>\n<p>The default language is used by Easyfullsearch when a new item is indexed. During the terms extraction, Easyfullsearch will use a stop words list to exclude some terms (words) from the index. These terms will not be found in searches later. The index will be less space consuming, faster during the inserts and the searches. You can manage different lists of stop words according to the language. This option gives you the way to choose the language used.</p>\n<p>Some stop words list are embedded within the plugin (typically French and English). If you need to add another language you have first to set up the new language (the next option field named &#8220;New language&#8221;. <strong>You must save options before changing the new list of stop words</strong>.</p>\n<p>If a language is associated to the item to index (such as a post), it will be used as language for the indexing operation. The default language is only used if no language is associated to an item. The language is supposed to be associated with the taxonomy field.</p>\n<p>As language is used in the index operation to take the correct list of stop words, it is not necessary to distinguish different use of the same language, such as French in Belgium, Canada or France, or English in UK or USA. This is useful for translation, but not really for stop words.</p>\n</li>\n</ul>\n<h4>Entry : &#8220;New language&#8221;</h4>\n<ul>\n<li>If you need to add a new language to support a new list of stop words, you can define it here. It must be saved before updating the list. In fact the value can be any (no syntax associated to the language). It means you also could define your own space of words to manage different behaviours.</li>\n</ul>\n<h4>Button : &#8220;Save search options&#8221;</h4>\n<ul>\n<li>The button <strong>Save search options</strong> saves all options related to the search, from &#8220;post types&#8221; to &#8220;search operators&#8221;. Some values are updated in the wordpress context only (like the posts type). Some others  values are directly update in the configuration of the Easyfullsearch engine (such as logging users&#8217;s requests).</li>\n</ul>\n<h3>Section : &#8220;Stop words&#8221;</h3>\n<p>In every language, some words are useless for the search relevance. The list of stop words allows you to exclude them. It makes the insert/update operations faster as well as the searches itself.</p>\n<ul>\n<li>This section allows you to manage the lists of stop words. The default language associated to the current list ofstop words is indicated just after the section&#8217;s title. For example Stop words (en) means the current list is related to the English language.</li>\n</ul>\n<h4>List of stop words</h4>\n<ul>\n<li>All stop words are listed in the text area. They are sorted by alphabetic order. Stop words are separated by the character &#8220;-&#8220;. Spaces are just added to facilitate the read. If you want to suppress a word from the list of stop words, remove it directly. If you want to add one or more words, insert them in the list separated by the &#8220;-&#8221; character. No space is necessary. You can insert them anywhere  (no sort needed).</li>\n</ul>\n<h4>Button :  &#8220;List of stop words&#8221;</h4>\n<ul>\n<li>\n<p>This button will updates the list of stop words inside the Easyfullsearch engin. The page will be updated and the list will take account your changes (words are sorted again). All new publishing of posts or pages will use this new list of stop words, but all previously inserted items are not updated.</p>\n<p>All futur search are using the new list. It means that words in the list of stop words will be excluded from the search. In the other hand, it means that all previoulsy inserted items can&#8217;t be retrieve if they contain a word newly excluded from the list. In this case you may have to empty the index and rebuild it.</p>\n<h3>Section : &#8220;Change current user&#8221;</h3>\n</li>\n</ul>\n<h4>Entry : &#8220;Current user&#8221;</h4>\n<ul>\n<li>The current login/password is mandatory to make any change. By default, the current user is &#8220;Admin&#8221;, completed by a six digits random number. The default password is &#8220;efswp&#8221;. As this user/password are easy to find inside the plugin, it may be a good thing to change it. On the other hand, this username has a random part and it is used to access to the index which contains only informations also published.</li>\n</ul>\n<h4>Entry : &#8220;Current password&#8221;</h4>\n<ul>\n<li>The password associated to the current user.</li>\n</ul>\n<h4>Entry : &#8220;New user&#8221;</h4>\n<ul>\n<li>If you want to change the current user, you can define a new one by giving its name/login here. If this entry is empty, you can change the current password with the next entries. If you want to have more than one user to access to the index, you must use the efsmyadmin tool.</li>\n</ul>\n<h4>Entry : &#8220;New password&#8221;</h4>\n<ul>\n<li>The value of this entry will be the new password of the current user. If no value is given in the &#8220;new user&#8221; entry, this will chnage the password of the existing current user.</li>\n</ul>\n<h4>Entry : &#8220;Confirm new password&#8221;</h4>\n<ul>\n<li>The entry to confirm the value of the new password.</li>\n</ul>\n<h3>Section : &#8220;Others actions&#8221;</h3>\n<p>This section lets you act in the Easyfullsearch index and get some additional infomations</p>\n<h4>Button :  &#8220;Optimize the index&#8221;</h4>\n<ul>\n<li>\n<p>If your site is often updated, the index can be optimized to ensure a faster answer. In this case, the most often requested terms will be optimized. In most of case you will not have to do that. During this action, publishing may be slowed.</p>\n<p>That&#8217;s why the use of this button is protected by the entry field. It demands you to enter a random generated code.</p>\n</li>\n</ul>\n<h4>Button &#8220;Empty the index&#8221;</h4>\n<ul>\n<li>\n<p>This button lets you remove all items from the index. In general you have not to do that. But you have to do if you want to rebuild all the index. This can also be useful if your items are very frequently modified and you want to shrunk the index.</p>\n<p>The use of this button is protected by the entry field after. It demands you to enter a random generated code.</p>\n</li>\n</ul>\n<h4>Button &#8220;Generate the dictionnary&#8221;</h4>\n<ul>\n<li>\n<p>If you want to use the fuzzy logic in the search (see section &#8220;Use fuzzy query&#8221;), you must generate the dictionnary. The dictionnary is generated from the content of the index. Easyfullsearch will generate &#8220;fuzzy&#8221; terms from a requests according the nearer terms present in the dictionnary.</p>\n<p>All the whole content of the index is not analyse. Easyfullsearcjh optimizes this action. it will be done in an incremental process. EasyfullsearchWp give you the information how much content is waiting to be to be includes in the dictionnary.</p>\n</li>\n</ul>\n<h4>Button &#8220;Log / Stop logging requests&#8221;</h4>\n<ul>\n<li>Easyfullsearch allows you to log the user&#8217;s requests. It can be temporarily give you interesting informations. The logs will be available by using the next button &#8220;Show log of requests&#8221;. This option doesn&#8217;t really slow requests. Easyfullsearch has an internal mechanism to limit the amount of data in the log. Older values may be lost.</li>\n</ul>\n<h4>Button &#8220;Show logs of requests&#8221;</h4>\n<ul>\n<li>If you have logged the users&#8217; requests, you can see them using this button. The next page will show you the list of requests, with :\n<ul>\n<li>The date of the request</li>\n<li>The duration of the requests (only for the Easyfullsearch part)</li>\n<li>The actual search query (may be reused in Efsmyadmin)</li>\n<li>The number of results returned</li>\n<li>If any, the part of the query with no results</li>\n<li>The tool used (the wordpress plugin is nammed : EasyfullsearchWP), the login The tool used (the wordpress plugin is nammed : EasyfullsearchWP), the login of the user (the wordpress username first, then the easyfullsearch username ) and its IP address.of the user and its IP address.</li>\n</ul>\n</li>\n</ul>\n<h4>Button &#8220;See the documentation&#8221;</h4>\n<ul>\n<li>This button gives you a direct acceess to the plugin&#8217;s documentation.</li>\n</ul>\n<h3>Plugin&#8217;s hooks</h3>\n<p>The easyfullsearch plugin has several hooks letting developers add functionalities. if you need more explanation on their actual use, please let me know.</p>\n<h3>The list of the hooks</h3>\n<ul>\n<li>easyfullsearchWP_init : Initialize  the variables of the plugin.</li>\n<li>easyfullsearchWP_post_save : Insert/modify a post or page in the index.</li>\n<li>easyfullsearchWP_search_istosearch : Determine if the search is to be processed, or not, by the Easyfullsearch engine.</li>\n<li>easyfullsearchWP_search_fieldslist : Change the list of the fields used in the search.</li>\n<li>easyfullsearchWP_search_weightlist : Change the weight associated to each field in order to sort the results.</li>\n<li>easyfullsearchWP_search_posttypes : Change the types of element to search for (post and page)</li>\n<li>easyfullsearchWP_search_optfuzzy : Use, or not, the fuzzy logic in the search process.</li>\n<li>easyfullsearchWP_search_loguserdata : Add some user&#8217;s data in the log of the requests.</li>\n<li>easyfullsearchWP_search_results : Modify the results of the search.</li>\n<li>easyfullsearchWP_index_update : Introduce new items in the index.</li>\n<li>easyfullsearchWP_index_add : Create Actually the index.</li>\n<li>easyfullsearchWP_index_model : Set the Easyfullsearch model to use within the plugin.</li>\n</ul>\n<p>Documentation of EasyfullsearchWP&#8217;s plugin &#8211; Version 1.0 &#8211; October 2016 &#8211; Author M Jarleton &#8211; All rights reserved &#8211; Copyright Easyfullsearch 2016</p>\n",
        "installation": "<h4>Instructions</h4>\n<p>EasyfullsearchWP is available on the standard wordpress plugins directory.</p>\n<ol>\n<li>Install the plugin through the WordPress &#8220;Plugins&#8221; menu directly.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress.</li>\n<li>Go to the &#8216;Easy Full Search&#8217; settings page and configure it.</li>\n</ol>\n<p>You can also download the plugin in zip format and extract files to the &#8220;/wp-content/plugins/easyfullsearchWP&#8221; directory. Then follow the step 2.  (not recommanded)</p>\n<p>To update your installation, simply install the new version. You don&#8217;t need to rebuild the index.</p>\n<h4>Activation</h4>\n<p>In the wordpress plugins page the user must activate the easyfullsearchWP plugin. When activated, the easyfullsearchWP plugin manages several actions :</p>\n<p>At this moment, it will not replace the wordpress search, because the index is empty and your users will have no answers to their requests. Before using Easyfullsearch to actually manage the users&#8217;s requests,  you must fill the index. EasyfullsearchWP lets you decide when you begin to use it as search engine.</p>\n<p>After activating, all new posts or pages, as all updates, will be automaticaly indexed by easyfullsearch. All data created before the activation have to be indexed if you want that your users could access them.</p>\n<p>So, in order to have the search fully operating, you have to fill the index (see the &#8220;Main actions&#8221; section of this guide).</p>\n<h4>Requirements</h4>\n<ul>\n<li>WordPress 3.1 </li>\n<li>PHP 5.4. Go faster ! : EasyfullsearchWP is php7 compliant.</li>\n</ul>\n<h4>Deactivation</h4>\n<p>If you deactivate easyfullsearchWP, it will no more replace the standard search of wordpress. The index itself is not delete and all the  data are still present, but any additional updates or creations will not be indexed. So, if you want to activate it again, after creation or update in your posts or pages, the best way is to empty the index and rebuild it again.</p>\n",
        "faq": "\n<h4>I have no results in the search.</h4>\n<p>\n<ul>\n<li>\n<p>If you just have activate the plugin, easyfullsearcWP has just created an empty index. So, it cannot find any results for your queries. The good news is that if you have no results, it means the plugin is correctly activated.</p>\n<ul>\n<li>To fill up the index go to the Settings (Easy Full Search page in administration) and use the button  &#8220;Update the index&#8221;  to fill up the index. While the index is not totaly filled up; you can unchecked the option &#8220;Use easyfullsearch for users&#8217;s searches&#8221;.</li>\n<li>Check the fields included in the search (&#8220;Search : fields and sort&#8221; section). May be have you excluded some important fields such as content or title. </li>\n<li>Check if post type is correctly selected in the section &#8220;Search : post types&#8221; . You also could try to manually index one post, containing a specific pattern, in order to test the indexing and the search process.</li>\n<li>You can also try to empty the index and rebuild its.</li>\n<li>If the problem is still there, after trying these actions, let me know.</li>\n</ul>\n</li>\n</ul>\n</p>\n<h4>Which posts or pages are stored in the index ?</h4>\n<p>\n<ul>\n<li>All published posts and pages are stored in the index, even if you don&#8217;t use them in the search. By this way, if you want to use them later, no rebuild action is needed.</li>\n</ul>\n</p>\n<h4>How many posts could the easyfullsearch support ?</h4>\n<p>\n<ul>\n<li>The Easyfullsearch engine can manage millions of items. The default index of the plugin does support more than 50 000 different terms. this is more than thousands of posts or pages. It will be automatically extended if necessary, but the search may be less efficient. There is no problem to have a larger index. In this case, let me know.</li>\n</ul>\n</p>\n<h4>Is easyfullsearchWP supporting multisites wordpress ?</h4>\n<p>\n<ul>\n<li>Presently the plugin is not designed to support the multisite wordpress. This could be done later.</li>\n</ul>\n</p>\n<h4>Where is stored the index ?</h4>\n<p>\n<ul>\n<li>The index is stored in a subdirectory (efs_data) of the easyfullsearchWP directory ( Ex. mysite/wp-content/plugins/easyfullsearchWP/efs_data)</li>\n</ul>\n</p>\n<h4>Is easyfullsearchWp php7 compliant ?</h4>\n<p>\n<ul>\n<li>Yes &#8211; The code of Easyfullsearch is designed to be php 7 compliant. Many tests have been done under php7. The present developments are all done with a php7 version.</li>\n</ul>\n</p>\n<h4>if I change the fields that I want to include in the search&#8217;s result, do I have to re-index all items ?</h4>\n<p>\n<ul>\n<li>No &#8211; all items are stored in the index. You have nothing to do if you choose to use them or not as fields for the searches. The Easyfullsearch index is able manage large index.</li>\n</ul>\n</p>\n<h4>Can I put the index on an external server ?</h4>\n<p>\n<ul>\n<li>Easyfullsearch engine is not designed like this in the use of this plugin. We consider than having the index in the same server is more efficient (no network latence, more consistency ..). This is one of the added value of the Easyfullsearch engine. And you have no charges to add for an index server !</li>\n</ul>\n</p>\n<h4>Is EasyfullsearchWP managing users&#8217;s rights ?</h4>\n<p>\n<ul>\n<li>Easyfullsearch engine includes a users&#8217;s rights management. The easyfullsearchWP plugin create its own user to access the index. There is no need to have a link between the wordpress&#8217;s users and the easyfullsearchWP one. You can manage this user through the plugin settings.</li>\n</ul>\n</p>\n<h4>Is the plugin secured ?</h4>\n<p>\n<ul>\n<li>The plugin respects some good practices for wordpress. Administration page is protected, and rights are checked. Security is an important matter. easyfullsearchWP plugin is delivered &#8220;as is&#8221;. If you have any suggestion, please let me known.</li>\n</ul>\n</p>\n<h4>Is the index crypted ?</h4>\n<p>\n<ul>\n<li>No &#8211; Easyfullsearch doesn&#8217;t protect specifically the content of the index. The wordpress&#8217;s administor have to take security actions to protect it (secured access to the files, for example). Even if the content of the index is not crypted, informations in it are not useful.</li>\n</ul>\n</p>\n\n",
        "changelog": "<h4>1.0</h4>\n<ul>\n<li>The first version of the plugin</li>\n</ul>\n"
    },
    "short_description": "EasyfullsearchWP is the best way to improve searches, providing more relevant results by controlling many features. Most of fields can be indexed.",
    "description": "<p>EasyfullsearchWP replaces the native WordPress search engine to improve the effectiveness and relevance of all searches.<br />\nIt lets you manage posts an/or pages, to choose the fields you want to use in the searches (including comments, author, custom fields, categories, taxonomy &#8230;).<br />\nBy giving you predefined values, it helps you to easyly improve your user&#8217;s experience.</p>\n<p>As the easyfullsearch engine is more powerful than the basic wordpress search mechanism. it allows administrator and developer to use the wide range of features of the easyfullsearch engine.</p>\n<p>This version is the free version of EasyfullsearchWP. Presently, easyfullsearchWP is managing main user&#8217;s searches coming from the search widget or administation&#8217;s pages.</p>\n<p>Easyfullsearch has a companion tool, called Efsmyadmin. This tool gives you access to a large amount of functions to manage the index. It is available on the Easyfullsearch&#8217;s web site (http://www.easyfullsearch.com).</p>\n<h4>Key features</h4>\n<ul>\n<li>Results are sorted in the order of relevance according to configurable weights.</li>\n<li>A very fast retrieving process.</li>\n<li>You can choose to have a strict matching (all the words) or flexible (at least one of them.) This may be an automatic option.</li>\n<li>The fuzzy logic may be used to match results (never, always or only if the strict match is not fruitful). The fuzzy words are extracted from the content itself.</li>\n<li>The date can be used as complement of the sort algorithm.</li>\n<li>You can decide to use search for posts and/or pages. </li>\n<li>You can choose to search in different fields : title, content, comments, tags, categories and custom fields.</li>\n<li>You give your own weight to each fields</li>\n<li>A full documentation is available directly through the settings menu.</li>\n<li>You can highlight the relevant terms</li>\n</ul>\n<h4>Advanced features</h4>\n<ul>\n<li>A very fast indexing process. </li>\n<li>You can search only in fields which are pertinent for you (for example you can exclude the comments or the title !).</li>\n<li>You can choose to use the Easyfullsearch for the users&#8217; searches or administration&#8217;s searches. </li>\n<li>You can choose the types of posts to search  (post and/or pages)</li>\n<li>The search on each types can be easyly turned &#8220;on&#8221; or &#8220;off&#8221;.</li>\n<li>You can choose the weighting for all types of fields. You don&#8217;t need to rebuild the index after changing them.</li>\n<li>You can optimize the index for the most used words.</li>\n<li>You can log the users&#8217; requests, and see what exactly happened in your site.</li>\n<li>Custom post types and custom taxonomies can be used and weigthed as the others fields.</li>\n<li>EaysfullsearchWP supports the polylang plugin</li>\n<li>Easyfullsearch supports site with huge base and hundreds of thousands of posts.</li>\n<li>EaysfullsearchWP lets you easyly manage the stop words (create, suppress, add a language &#8230;)</li>\n<li>The plugin automaticaly limits the disk space used for logs</li>\n<li>EasyfullsearchWP uses queued inserts to protect the index against  inconsistency.</li>\n</ul>\n<h4>Coming</h4>\n<ul>\n<li>Enhance statistics</li>\n<li>Manage automatic suggestion. The autocomplete is already part of the engine.</li>\n</ul>\n<h3>Translations</h3>\n<ul>\n<li>English &#8211; default, always included</li>\n<li>French &#8211; toujours disponible</li>\n</ul>\n<h3>Settings</h3>\n<p>The plugin&#8217;s settings are managed through an unique administration page. This page is part of the &#8220;settings&#8221; menu, in administration interface of the site.  The administration page is nammed &#8220;Easy Full Search&#8221;.</p>\n<p>This page is composed of different sections (all these points are discussed in later sections  :</p>\n<ul>\n<li>&#8220;<strong>Main actions</strong>&#8221;  : Contains the basic actions to set up the plugin</li>\n<li>&#8220;<strong>Index values</strong>&#8221; : Gives informations about state and values of the index</li>\n<li>&#8220;<strong>Search : post types</strong>&#8221; : Allows to choose which types of elements are to be included in the search results</li>\n<li>&#8220;<strong>Search : fields and sort</strong>&#8221; : Lets choose  weight and sort&#8217;s order of each elements in the search result</li>\n<li>&#8220;<strong>Search : sort with date</strong>&#8220;: Lets choose the way that the dates are used as criteria in the results</li>\n<li>&#8220;<strong>Search : operators</strong>&#8221; : Lets you decide the operators used in the regular search</li>\n<li>&#8220;<strong>Stop words</strong>&#8221; : Manages the list of stop words according to the language</li>\n<li>&#8220;<strong>Change current user</strong>&#8221; : Lets you change the current user and its password. </li>\n<li>&#8220;<strong>Miscellaneous</strong>&#8221; : Others actions</li>\n</ul>\n<p>This part describes in detail all the setting sections.</p>\n<h3>Main concepts</h3>\n<p>In order to understand options and actions available in the setting page, some concepts of Easyfullsearch should  be explained .</p>\n<p>Easyfullsearch (also called EFS) is a generic search engine for full text and faceting searches. It is written in php language. Its goal is to have a modern and powerful search engine, fully integrated in the php environment. Easyfullsearch is self sufficient. It doesn&#8217;t use any external database.</p>\n<p>Easyfullsearch uses some basic concepts :</p>\n<ul>\n<li>\n<p>&#8220;<strong>index</strong>&#8221; : the place where Easyfullsearch stores all the data used to deliver the service<br />\nEasyfullsearch manages its own index (a collection of files). It doesn&#8217;t use generic databases (such as mysql). An index contains all files needed to manage queries.<br />\nThe index is a subdirectory of the &#8220;efs_data&#8221; directory (which is directly under the easyfullsearchWp directory). Easyfullsearch could manage multiple index. in the case of wordpress, only one index is created. The name of the index (the directory itself) is based on the name of the site.</p>\n<p>It means that if you remove the plugin, the index will be also remove. It also means that you can save all the index by saving its directory. You also could move the index from one server to another by simply moving this directory. In this case you must also be sure that wordpress&#8217; references (posts&#8217; ids ) are unchanged. The index uses the wordpress&#8217; ids as item references.</p>\n</li>\n<li>\n<p>&#8220;<strong>item</strong>&#8221; : All entities stored in an index are called item. An item is a collection of fields. This generic term is use to show that an item could be a set of words, posts, pages, classified &#8230; and can be more complex than a simple document. In the case of wordpress, an item is a post or a page. This means results may contain post or page references.</p>\n</li>\n<li>\n<p>&#8220;<strong>Item id</strong>&#8221; : A unique id to identify an item. In the case of wordpress the item id is directly the wordress id associated to the post or the page.</p>\n</li>\n<li>\n<p>&#8220;<strong>Field</strong>&#8221; : The fileds are the different parts of an item (such as title, content, date &#8230;). Fields are containing terms. In the case of wordpress mains fields associated to an item are : title, content, comments, author, attached files, dates &#8230;</p>\n</li>\n<li>\n<p>&#8220;<strong>Term</strong>&#8221; : The basic element in a field (in general a word, a date &#8230;)</p>\n</li>\n</ul>\n<p>Basically, in the wordpress usage, the &#8220;items&#8221; are posts or pages, the &#8220;fields&#8221; are the different parts of the item (such as post_title, post_content &#8230;), and the &#8220;terms&#8221; are words extracted from the fields.</p>\n<p>That&#8217;s enough for concepts. More explanation can be found in the easyfullsearch website (http://www.easyfullsearch.com)</p>\n<h3>Section : &#8220;Main actions&#8221;</h3>\n<p>This section contains the most useful actions to manage the plugin. In most of cases, you only need these.</p>\n<h4>Button :  &#8220;Update the index&#8221;</h4>\n<ul>\n<li>\n<p>This button is useful if your web site contains items befoe you install the easyfullsearchWP plugin. As the index is empty at the activation, you have to index all already existing items (pots, pages). It&#8217;s also the case if you remove all items from the index (button &#8220;Empty the index&#8221; ).</p>\n<p>This action will search in the wordpress base all the items (posts, pages &#8230;) to index. You can give a large amount of items to index in one pass. A default value is generated according to the capability of your server to process the operation. The suggested value is &#8220;safe&#8221;. Easyfullsearch has a great capability of fast indexing.</p>\n<p>easyfullsearchWP memorise the last id indexed (see informations section). If all item are not indexed, the process continue from the last indexed item. If all items can&#8217;t be indexed in one pass, you need to repeat the operation. The value suggested will be zero if Easyfullsearch finds that all items are indexed. in general site with less than 20 000 ietms will take few minutes to index all the base. If you have very large bases and need some help, let me know.</p>\n<p>All posts and pages created or modified after the activation of the plugin will be automatically indexed.</p>\n<p>If your wordpress site have no page and no post awhen you activate the plugin, you have nothing to do. All pages or posts will be automatically added to the index when they will be published.</p>\n</li>\n</ul>\n<h4>Option : &#8220;Use easyfullsearch for users&#8217;s searches&#8221;</h4>\n<ul>\n<li>\n<p>When you activate the plugin, easyfullsearch will not automaticaly replace the standard wordperss search mechanism. As discussed before, some posts or pages may be not indexed at that time. To use actually the plugin in user&#8217;s searches you have to activate it by checking the check box of this option.</p>\n<p>It allows you to temporary use the standard wordpress search. You don&#8217;t have to desactivate the plugin to do that. Even if this option is not checked, Easyfullsearch continues to index all the created or modified items.</p>\n</li>\n</ul>\n<h4>Option : &#8220;Use search for admin&#8221;</h4>\n<ul>\n<li>\n<p>When you activate the plugin, easyfullsearch will not automaticaly replace the standard wordperss search mechanism in the administration menu. As for users&#8217; searches, some posts or pages may be not indexed at that time. To use actually the plugin in the administration menu, you have to activate it by checking the check box of this option.</p>\n<p>It allows you to temporary use the standard wordpress search. You don&#8217;t have to desactivate the plugin to do that. Even if this option is not checked, Easyfullsearch continues to index all the created or modified items.</p>\n</li>\n</ul>\n<h4>Button : &#8220;save options&#8221;</h4>\n<ul>\n<li>This button will save main options. (see above).</li>\n</ul>\n<h3>Section : &#8220;Index values&#8221;</h3>\n<p>This section gives basic useful information about the index. All information is given to help or satisfy curiosity. In general you doesn&#8217;t really need them.</p>\n<h4>Information : &#8220;Index name&#8221;</h4>\n<ul>\n<li>The name of the index. It have been generated during the installation. It is composed with the prefix WP and the name of your website. The result is something like &#8220;WPmysite&#8221;. </li>\n</ul>\n<h4>Information : &#8220;Index Dir&#8221;</h4>\n<ul>\n<li>\n<p>The path of the directory containing the index. All files of the index are stored in this directory (with subdirectories). The regular name is : mysite\\wp-content\\plugins\\easyfullsearchWP/efs_data/index_WPmysite.</p>\n<p>As you see easyfullsearchWP created a subdirectory called efs_data. The actual directory of the index is &#8220;index_WPmysite&#8221;.</p>\n</li>\n</ul>\n<h4>Information : &#8220;Created date&#8221;</h4>\n<ul>\n<li>The date of creation of the index. Actually it is the first activation of the plugin. </li>\n</ul>\n<h4>Information : &#8220;Last update&#8221;</h4>\n<ul>\n<li>The last time the index have been updated (means an item has been created, updated or deleted).</li>\n</ul>\n<h4>Information : &#8220;Estimated indexed items (posts,pages)&#8221;</h4>\n<ul>\n<li>This is the estimated number of items in the index. In some cases this can be different from the reality of a few units)</li>\n</ul>\n<h3>Section : &#8220;Search : post type&#8221;</h3>\n<p>This section lets you manage the type of elements to include in the search.</p>\n<p>The list of indexed elements, associated to checkbox, allows you to manage each of them. The fact to check or not a type doesn&#8217;t means you need to rebuild the index.<br />\nYou can manage the fields used in the search itself in the next part of the options.</p>\n<h4>Option : &#8220;Post&#8221;</h4>\n<ul>\n<li>If checked, queries will search in posts&#8217; content.</li>\n</ul>\n<h4>Option : &#8220;Page&#8221;</h4>\n<ul>\n<li>If checked, queries will search in pages&#8217;s content</li>\n</ul>\n<h3>Section : &#8220;Search : fields and sort&#8221;</h3>\n<p>This section is important. Default values have been defined to insure the maximum quality of results. A more precise tuning may be usefull depending the content itself. To correctly manage this part, you need to understand how results are sorted.</p>\n<p>When you change the weight of fields, the next searches will be execute according to these values. It&#8217;s not necessary to rebuild the index. So you can try different options to find the best values.<br />\nTo present how easyfullsearch sorts the results, you have to consider two axes. The first is the weight of each field in the sort. The second is the fact to separate different fields.</p>\n<p>In general search engines combine both by only using a weight attached to each field, the common manner is to give a higher weight to the most important field. But this way introduced a few unexpected sorting results or required to have a smaller range of values for less important fields, giving sometimes confusing results.</p>\n<p>The approach used by easyfullsearch is more powerful, even if we only use a part of it in this plugin. Basically, we have two &#8220;sorting methods&#8221;.</p>\n<p>The first is an associated calculation of occurrence and fields. For each selected field, the number of occurrence is multiplied by the weight associated to the field. This mechanism lets you decide the combination of weight. If you want to favour one field, you just have to give it a large weight. If you want to have more mixed results, you can give a narrower range of weight. The default values are set up to give priority to the title (weight of 10000) but if another item contains a lot of occurrences in the content field (weight of 1000, it can have the same final weight.</p>\n<p>The second one is the date (day/month or year) of the last updated of the post or the page. The value of the date is managed by wordpress. The choose of &#8220;day&#8221; as smaller value have been done to limit the effect of date in the result. The use of date may be more time consuming if you have a large amount of results. You must consider the fact that this option in unnecessary in general.</p>\n<p>This section contains the list of fields which could be used or not, and the weight associated to each of them. Let consider the first column</p>\n<p><strong>The first column</strong> lets you choose which fields will be used in the search proccess. You could change it as you like without re-indexing. This will be directly use in the next search (user or admin).</p>\n<p>The fields are applicable as well to the posts or pages</p>\n<ul>\n<li><strong>title</strong> : search, or not, in the title of item</li>\n<li><strong>content</strong> : search, or not, in the content of item</li>\n<li><strong>comments</strong> : search, or not, in the comments associated to an item. The EasyfullsearchWp plugin aggregates all comments text as only  one. This new created field is part of the element</li>\n<li><strong>author</strong> : search, or not, in the author name associated to the item        </li>\n<li><strong>tags</strong>  : search, or not, in the tags associated to the item</li>\n<li><strong>taxonomy</strong>  : search, or not, in the taxonomy values associated to the item</li>\n<li><strong>custom_content</strong> : If custom fields are are defined, search, or not, in their content. The EasyfullsearchWp plugin aggregates all these contents as only  one. This new created field is part of the element.</li>\n<li><strong>attachment_text</strong> : search, or not, in the text associated to item&#8217;s attachment (such as the name of a file). Presently, this doesn&#8217;t allow to search in the attachment content itself (may be next &#8230;).</li>\n</ul>\n<p><strong>The second column</strong> gives the weight associated to each field. If you want to change default values.You need to understand how the results are sorted to well manage this part. See explanations above.</p>\n<p>If you give a value of 0 to a field, it just give it a null weight. This doesn&#8217;t mean that the field is not used in the search. It means that this field is not important in the sorting process. So, a post could be part of the result even if one occurence have been found only in this field. It will simply placed at the end of results. To exclude a field, use the previous options in the first column.</p>\n<p>You could change the weights as you like. The next searches will be executed according to these values ( without rebuilding the index). In general, you have to try different options. As next searches will use the new values, you can directly test them. Easyfullsearch offers you a large liberty to establish your own balance.</p>\n<h3>Section : &#8220;Search : sort with date&#8221;</h3>\n<p>After establishing the use and the weight of each field, you could choose to also considering the date in the sort process. In this case you can choose to give priority to the date compared to the fields. the date could be used <em>before</em> (means the newer item will be classified first) or <em>after</em> (means that if two items have the same weight, the newer one will be classified first).</p>\n<h4>Option : &#8220;Use the date as a sorting criterion&#8221;</h4>\n<ul>\n<li>If checked the date is part of the sorting process. The use of date may be more time consuming if you have a large amount of results</li>\n</ul>\n<h4>Option : &#8220;Use the date criterion before the weights&#8221;</h4>\n<ul>\n<li>As described above, if checked, results will be sorted using date criterion before those of weights associated to the fields.</li>\n</ul>\n<h4>Option : &#8220;Choose the period of the date for sorting&#8221;</h4>\n<ul>\n<li>This option lets you manage the date period used as criterion. The avalaible periods are day, month and year.</li>\n</ul>\n<h3>Section : &#8220;Search : operators&#8221;</h3>\n<h4>Option : &#8220;Use AND as default operator&#8221;</h4>\n<ul>\n<li>\n<p>This options lets you to choose the default operator if the search string contains more than one term (&#8220;AND&#8221; or &#8220;OR&#8221;). The alternative is to search all of the terms (the AND operator, the default value), or at least one of them (the OR operator). Lets consider the &#8220;Vinci code film&#8221; search.</p>\n<p>If you check the AND option , the query will be interpreted as  &#8220;Vinci AND code AND film&#8221;. This way may be more natural, but it is also more restrictive. You could be desapointed not seeing some results.</p>\n<p>If you let the option unchecked,the &#8220;OR&#8221; operator will be used. In this case the query will be interpreted as &#8220;Vinci OR code OR film&#8221;. On one hand, you will have more results, on the other hand the results may  contain posts or pages less relevant.</p>\n</li>\n</ul>\n<h4>Option : &#8220;Use OR operator if no results&#8221;</h4>\n<ul>\n<li>If you choose the &#8216;AND&#8217; operator as default, you can check this option to indicate to EasyfullsearchWP to try the &#8216;OR&#8217; operator if no results are returned after the search. In fact if no posts or pages contain &#8220;Vinci AND code AND film&#8221;, Easyfullsearch will try to find some results for &#8220;Vinci OR code OR film&#8221;.</li>\n</ul>\n<h4>Option : &#8220;Use fuzzy query &#8220;</h4>\n<ul>\n<li>Easyfullsearch engine is able to generate &#8220;fuzzy&#8221; searches. The terms are taken from the dictionnary of the actual content of the index (not from the requests). According to the last generation of dictionnaries, easyfullesearch try to find approching terms and to include them in the search. This option is powerful but it could be time consuming. if many &#8220;fuzzy&#8221; terms are used. This could slow your site.<br />\nit needs that the the dictionnary have been generated. The more recent it is, the more relevant may be the fuzzy logic.</li>\n</ul>\n<h4>Option : &#8220;Default language&#8221;</h4>\n<ul>\n<li>\n<p>The default language is used by Easyfullsearch when a new item is indexed. During the terms extraction, Easyfullsearch will use a stop words list to exclude some terms (words) from the index. These terms will not be found in searches later. The index will be less space consuming, faster during the inserts and the searches. You can manage different lists of stop words according to the language. This option gives you the way to choose the language used.</p>\n<p>Some stop words list are embedded within the plugin (typically French and English). If you need to add another language you have first to set up the new language (the next option field named &#8220;New language&#8221;. <strong>You must save options before changing the new list of stop words</strong>.</p>\n<p>If a language is associated to the item to index (such as a post), it will be used as language for the indexing operation. The default language is only used if no language is associated to an item. The language is supposed to be associated with the taxonomy field.</p>\n<p>As language is used in the index operation to take the correct list of stop words, it is not necessary to distinguish different use of the same language, such as French in Belgium, Canada or France, or English in UK or USA. This is useful for translation, but not really for stop words.</p>\n</li>\n</ul>\n<h4>Entry : &#8220;New language&#8221;</h4>\n<ul>\n<li>If you need to add a new language to support a new list of stop words, you can define it here. It must be saved before updating the list. In fact the value can be any (no syntax associated to the language). It means you also could define your own space of words to manage different behaviours.</li>\n</ul>\n<h4>Button : &#8220;Save search options&#8221;</h4>\n<ul>\n<li>The button <strong>Save search options</strong> saves all options related to the search, from &#8220;post types&#8221; to &#8220;search operators&#8221;. Some values are updated in the wordpress context only (like the posts type). Some others  values are directly update in the configuration of the Easyfullsearch engine (such as logging users&#8217;s requests).</li>\n</ul>\n<h3>Section : &#8220;Stop words&#8221;</h3>\n<p>In every language, some words are useless for the search relevance. The list of stop words allows you to exclude them. It makes the insert/update operations faster as well as the searches itself.</p>\n<ul>\n<li>This section allows you to manage the lists of stop words. The default language associated to the current list ofstop words is indicated just after the section&#8217;s title. For example Stop words (en) means the current list is related to the English language.</li>\n</ul>\n<h4>List of stop words</h4>\n<ul>\n<li>All stop words are listed in the text area. They are sorted by alphabetic order. Stop words are separated by the character &#8220;-&#8220;. Spaces are just added to facilitate the read. If you want to suppress a word from the list of stop words, remove it directly. If you want to add one or more words, insert them in the list separated by the &#8220;-&#8221; character. No space is necessary. You can insert them anywhere  (no sort needed).</li>\n</ul>\n<h4>Button :  &#8220;List of stop words&#8221;</h4>\n<ul>\n<li>\n<p>This button will updates the list of stop words inside the Easyfullsearch engin. The page will be updated and the list will take account your changes (words are sorted again). All new publishing of posts or pages will use this new list of stop words, but all previously inserted items are not updated.</p>\n<p>All futur search are using the new list. It means that words in the list of stop words will be excluded from the search. In the other hand, it means that all previoulsy inserted items can&#8217;t be retrieve if they contain a word newly excluded from the list. In this case you may have to empty the index and rebuild it.</p>\n<h3>Section : &#8220;Change current user&#8221;</h3>\n</li>\n</ul>\n<h4>Entry : &#8220;Current user&#8221;</h4>\n<ul>\n<li>The current login/password is mandatory to make any change. By default, the current user is &#8220;Admin&#8221;, completed by a six digits random number. The default password is &#8220;efswp&#8221;. As this user/password are easy to find inside the plugin, it may be a good thing to change it. On the other hand, this username has a random part and it is used to access to the index which contains only informations also published.</li>\n</ul>\n<h4>Entry : &#8220;Current password&#8221;</h4>\n<ul>\n<li>The password associated to the current user.</li>\n</ul>\n<h4>Entry : &#8220;New user&#8221;</h4>\n<ul>\n<li>If you want to change the current user, you can define a new one by giving its name/login here. If this entry is empty, you can change the current password with the next entries. If you want to have more than one user to access to the index, you must use the efsmyadmin tool.</li>\n</ul>\n<h4>Entry : &#8220;New password&#8221;</h4>\n<ul>\n<li>The value of this entry will be the new password of the current user. If no value is given in the &#8220;new user&#8221; entry, this will chnage the password of the existing current user.</li>\n</ul>\n<h4>Entry : &#8220;Confirm new password&#8221;</h4>\n<ul>\n<li>The entry to confirm the value of the new password.</li>\n</ul>\n<h3>Section : &#8220;Others actions&#8221;</h3>\n<p>This section lets you act in the Easyfullsearch index and get some additional infomations</p>\n<h4>Button :  &#8220;Optimize the index&#8221;</h4>\n<ul>\n<li>\n<p>If your site is often updated, the index can be optimized to ensure a faster answer. In this case, the most often requested terms will be optimized. In most of case you will not have to do that. During this action, publishing may be slowed.</p>\n<p>That&#8217;s why the use of this button is protected by the entry field. It demands you to enter a random generated code.</p>\n</li>\n</ul>\n<h4>Button &#8220;Empty the index&#8221;</h4>\n<ul>\n<li>\n<p>This button lets you remove all items from the index. In general you have not to do that. But you have to do if you want to rebuild all the index. This can also be useful if your items are very frequently modified and you want to shrunk the index.</p>\n<p>The use of this button is protected by the entry field after. It demands you to enter a random generated code.</p>\n</li>\n</ul>\n<h4>Button &#8220;Generate the dictionnary&#8221;</h4>\n<ul>\n<li>\n<p>If you want to use the fuzzy logic in the search (see section &#8220;Use fuzzy query&#8221;), you must generate the dictionnary. The dictionnary is generated from the content of the index. Easyfullsearch will generate &#8220;fuzzy&#8221; terms from a requests according the nearer terms present in the dictionnary.</p>\n<p>All the whole content of the index is not analyse. Easyfullsearcjh optimizes this action. it will be done in an incremental process. EasyfullsearchWp give you the information how much content is waiting to be to be includes in the dictionnary.</p>\n</li>\n</ul>\n<h4>Button &#8220;Log / Stop logging requests&#8221;</h4>\n<ul>\n<li>Easyfullsearch allows you to log the user&#8217;s requests. It can be temporarily give you interesting informations. The logs will be available by using the next button &#8220;Show log of requests&#8221;. This option doesn&#8217;t really slow requests. Easyfullsearch has an internal mechanism to limit the amount of data in the log. Older values may be lost.</li>\n</ul>\n<h4>Button &#8220;Show logs of requests&#8221;</h4>\n<ul>\n<li>If you have logged the users&#8217; requests, you can see them using this button. The next page will show you the list of requests, with :\n<ul>\n<li>The date of the request</li>\n<li>The duration of the requests (only for the Easyfullsearch part)</li>\n<li>The actual search query (may be reused in Efsmyadmin)</li>\n<li>The number of results returned</li>\n<li>If any, the part of the query with no results</li>\n<li>The tool used (the wordpress plugin is nammed : EasyfullsearchWP), the login The tool used (the wordpress plugin is nammed : EasyfullsearchWP), the login of the user (the wordpress username first, then the easyfullsearch username ) and its IP address.of the user and its IP address.</li>\n</ul>\n</li>\n</ul>\n<h4>Button &#8220;See the documentation&#8221;</h4>\n<ul>\n<li>This button gives you a direct acceess to the plugin&#8217;s documentation.</li>\n</ul>\n<h3>Plugin&#8217;s hooks</h3>\n<p>The easyfullsearch plugin has several hooks letting developers add functionalities. if you need more explanation on their actual use, please let me know.</p>\n<h3>The list of the hooks</h3>\n<ul>\n<li>easyfullsearchWP_init : Initialize  the variables of the plugin.</li>\n<li>easyfullsearchWP_post_save : Insert/modify a post or page in the index.</li>\n<li>easyfullsearchWP_search_istosearch : Determine if the search is to be processed, or not, by the Easyfullsearch engine.</li>\n<li>easyfullsearchWP_search_fieldslist : Change the list of the fields used in the search.</li>\n<li>easyfullsearchWP_search_weightlist : Change the weight associated to each field in order to sort the results.</li>\n<li>easyfullsearchWP_search_posttypes : Change the types of element to search for (post and page)</li>\n<li>easyfullsearchWP_search_optfuzzy : Use, or not, the fuzzy logic in the search process.</li>\n<li>easyfullsearchWP_search_loguserdata : Add some user&#8217;s data in the log of the requests.</li>\n<li>easyfullsearchWP_search_results : Modify the results of the search.</li>\n<li>easyfullsearchWP_index_update : Introduce new items in the index.</li>\n<li>easyfullsearchWP_index_add : Create Actually the index.</li>\n<li>easyfullsearchWP_index_model : Set the Easyfullsearch model to use within the plugin.</li>\n</ul>\n<p>Documentation of EasyfullsearchWP&#8217;s plugin &#8211; Version 1.0 &#8211; October 2016 &#8211; Author M Jarleton &#8211; All rights reserved &#8211; Copyright Easyfullsearch 2016</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/easyfullsearch.zip",
    "upgrade_notice": {
        "1.0": "<ul>\n<li>New plugin to enhance the wordpress search</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/easyfullsearch/assets/screenshot-1.png?rev=1543947",
            "caption": "Section : Main actions"
        },
        {
            "src": "https://ps.w.org/easyfullsearch/assets/screenshot-2.png?rev=1543947",
            "caption": "Section : Index values"
        },
        {
            "src": "https://ps.w.org/easyfullsearch/assets/screenshot-3.png?rev=1543947",
            "caption": "Section : Search : post type"
        },
        {
            "src": "https://ps.w.org/easyfullsearch/assets/screenshot-4.png?rev=1543947",
            "caption": "Section : Search : fields and sort"
        },
        {
            "src": "https://ps.w.org/easyfullsearch/assets/screenshot-5.png?rev=1543947",
            "caption": "Section : Search : sort with date"
        },
        {
            "src": "https://ps.w.org/easyfullsearch/assets/screenshot-6.png?rev=1543948",
            "caption": "Section : Search : operators"
        },
        {
            "src": "https://ps.w.org/easyfullsearch/assets/screenshot-7.png?rev=1543948",
            "caption": "Section : Stop words"
        },
        {
            "src": "https://ps.w.org/easyfullsearch/assets/screenshot-8.png?rev=1543948",
            "caption": "Section : Highlight results"
        },
        {
            "src": "https://ps.w.org/easyfullsearch/assets/screenshot-9.png?rev=1543948",
            "caption": "Section : Change current user"
        },
        {
            "src": "https://ps.w.org/easyfullsearch/assets/screenshot-10.png?rev=1543948",
            "caption": "Section : Others actions"
        }
    ],
    "tags": {
        "advanced": "advanced",
        "better-search": "better search",
        "filter-weighted": "filter weighted",
        "relevance": "relevance",
        "search": "search"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/easyfullsearch.1.0.0.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://www.easyfullsearch.com",
    "banners": {
        "low": "https://ps.w.org/easyfullsearch/assets/banner-772x250.png?rev=1543526",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/easyfullsearch/assets/icon-128x128.png?rev=1543526",
        "2x": "https://ps.w.org/easyfullsearch/assets/icon-256x256.png?rev=1543526"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "easyfullsearch",
            "language": "fr_FR",
            "version": "1.0",
            "updated": "2018-08-06 12:27:22",
            "package": "http://downloads.wordpress.org/translation/plugin/easyfullsearch/1.0/fr_FR.zip"
        }
    ]
}