{
    "name": "Ultimate Editorial Rating &#8211; Best Product Review Plugin With Star Rating System (WooCommerce Support)",
    "slug": "editorial-rating",
    "version": "4.0.2",
    "author": "<a href=\"https://wpqode.com/\">PLUGINIC</a>",
    "author_profile": "https://profiles.wordpress.org/wpqode/",
    "contributors": {
        "wpqode": {
            "profile": "https://profiles.wordpress.org/wpqode/",
            "avatar": "https://secure.gravatar.com/avatar/854c022a40c5e06880e2211139e55817?s=96&d=monsterid&r=g",
            "display_name": "Pluginic"
        },
        "nazmulfeni4": {
            "profile": "https://profiles.wordpress.org/nazmulfeni4/",
            "avatar": "https://secure.gravatar.com/avatar/7f046997a5368d4808c1f0bf37cded54?s=96&d=monsterid&r=g",
            "display_name": "nazmulfeni4"
        },
        "frohadpro": {
            "profile": "https://profiles.wordpress.org/frohadpro/",
            "avatar": "https://secure.gravatar.com/avatar/1c6019d26dd3b23a626a8f9c39d5be21?s=96&d=monsterid&r=g",
            "display_name": "WP Forhad"
        }
    },
    "requires": "4.5",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 90,
    "ratings": {
        "5": 8,
        "4": 1,
        "3": 2,
        "2": 0,
        "1": 0
    },
    "num_ratings": 11,
    "support_url": "https://wordpress.org/support/plugin/editorial-rating/",
    "support_threads": 1,
    "support_threads_resolved": 1,
    "active_installs": 300,
    "downloaded": 3599,
    "last_updated": "2024-08-07 09:01:00",
    "added": "2021-10-02",
    "homepage": "https://wpqode.com/plugins/editorial_rating",
    "sections": {
        "description": "<p>Add product reviews effortlessly to your WordPress product posts or pages with our Ultimate Editorial Rating WordPress Free product review plugin.</p>\n<p>Now you can add multi-criteria product rating &amp; reviews for any WordPress post using WordPress product review plugin &#8211; Ultimate Editorial Rating. It’s easy to install and has an advanced dashboard that works seamlessly with any WordPress website.</p>\n<p>✨ <a href=\"https://demo.pluginic.com/editorial-rating/\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>Live Demo</strong></a> | 📚<a href=\"https://pluginic.com/docs/editorial-rating/\" title=\"Editorial Rating - Documentation\" rel=\"nofollow ugc\"><strong>Documentation</strong></a> | 💬<a href=\"https://pluginic.com/support/\" title=\"Editorial Review System - Support\" rel=\"nofollow ugc\"><strong>Support Forum &raquo;</strong></a> | 🌟<a href=\"https://pluginic.com/plugins/editorial-rating/\" title=\"Premium Features\" rel=\"nofollow ugc\"><strong>Premium Features</strong></a> | 🔥<a href=\"https://pluginic.com/plugins/editorial-rating/\" title=\"Get Pro (30% OFF)\" rel=\"nofollow ugc\"><strong>Get Pro (30% OFF)&raquo;</strong></a></p>\n<p>By using our plugin, you can create multiple review criteria for your WordPress product posts or pages, including product quality, features, service aspects, price, pros, cons, and more. These multiple review criteria help users make wise decisions effortlessly. Additionally, users can rate products through comment reviews and visitor star ratings.</p>\n<p>The free version allows you to set limited criteria for your product reviews. To add more criteria, you’ll need to upgrade to the premium version of the Ultimate Editorial Rating plugin.</p>\n<p>Watch The Official Video For Install, How To Install and Use Editorial Rating WordPress Product Review Plugin</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8eE-sZ2GQds?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Best Product Review Plugin With Star Rating (WooCommerce Support)</h3>\n<p>The #1 Best WordPress product review plugin helps you add multi criteria product rating, increase engagement, build loyalty, improve SEO, and get more sales with social proof also.</p>\n<p>The Ultimate Editorial Rating is a FREE WordPress product review plugin that enhances WordPress and eCommerce sites with a bundle of awesome features: Multi-criteria star Ratings, Total Score Calculation, Review Schema, Pros and Cons Highlights, and more. Amplify your website’s potential with expert Editorial Ratings and insightful Customer Reviews. Plus, you can  enjoy the added flair of Pros and Cons showcases and eye-catching Rating Widgets to captivate your visitors.</p>\n<h3>Key Features Of Ultimate Editorial Product Rating Plugin</h3>\n<p>Have a quick scan at the core features you can get with our plugin-</p>\n<ul>\n<li>Multi-Criteria Rating and Reviews on single posts/pages.</li>\n<li>Shortcode System</li>\n<li>9+ Ready made Review Layout (For Free 1)</li>\n<li>7+ Cross / Compare Rating layout  (Pro)</li>\n<li>Customer Rating options   (Pro)</li>\n<li>Visitor Rating options    (Pro)</li>\n<li>Pros and Cons Option</li>\n<li>Show/hide score on the post.</li>\n<li>WooCommerce Compatibility (Pro)</li>\n<li>Review Schema Support</li>\n<li>Total Score calculation of each point / total rating category.</li>\n<li>Editorial Rating on the sidebar.</li>\n<li>Sticky Editorial Rating Sidebar.</li>\n<li>Rating Widget</li>\n<li>No coding required</li>\n</ul>\n<p>Still not convinced? Allow us to break down these exceptional features for you.</p>\n<h3>⭐️  9+ Ready Made Review Layout Design</h3>\n<p>The Ultimate Editorial Rating plugin offers over 9 stunning, ready-made review layout designs to make your product reviews stand out. These layouts are carefully crafted to enhance readability and visual appeal, ensuring your reviews look professional and engaging. Whether you prefer a simple star rating or a detailed multi-criteria review, you can easily choose and apply a layout that suits your website&#8217;s style, making it easy for visitors to digest and appreciate your reviews.  <a href=\"https://demo.pluginic.com/editorial-rating//\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>See Live Demo</strong></a></p>\n<h3>✨  <a href=\"\" title=\"https://pluginic.com/docs/editorial-cross-rating/&quot;7+ Ready Made Cross Rating/Compare Layout Design  (7+ Ready Made Cross Rating/Compare Layout Design )\" rel=\"nofollow ugc\">7+ Ready Made Cross Rating/Compare Layout Design </a></h3>\n<p>Our plugin also includes more than 7 pre-designed cross-rating and compare layout options, perfect for comparing multiple products side by side. These layouts allow you to present detailed comparisons with clear, attractive visuals, helping your audience quickly identify the strengths and weaknesses of different products. By using these comparison layouts, you can provide your visitors with valuable insights, facilitating informed purchasing decisions and enhancing user engagement. <a href=\"https://demo.pluginic.com/editorial-rating/\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>See Live Demo</strong></a></p>\n<h3>🌟 Multi-Criteria Rating And Reviews</h3>\n<p>Multi-criteria ratings and reviews help users provide feedback based on various aspects of the product or service. You can set all the criteria from WordPress, which reviewers will see on display. With this feature, you can engage visitors to interact with the product on review and gain trust from future visitors. Your path to building strong relationships with visitors starts here!   <a href=\"https://demo.pluginic.com/editorial-rating/editorial-rating-demo-1/\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>See Live Demo</strong></a></p>\n<h3>📝 Editorial Rating System:</h3>\n<p>The Editorial Rating System allows you to rate the products on multiple criteria. Whether you&#8217;re an industry expert or a satisfied customer, your firsthand experience brings an impartial perspective, guiding potential buyers toward informed choices. Editorial ratings are crucial to grow audience trust and send professional feedback to businesses addressing areas of improvement.</p>\n<h3>👥 Customer Review:</h3>\n<p>Customer reviews are a cornerstone for any brand to outshine its competitors and solidify the brand&#8217;s reputation. Ultimate Editorial Rating lets genuine product users leave a constructive review on your site. For SEO, this will increase customer engagement on your site, and the visitors can make informed decisions based on previous customers’ experiences. <a href=\"https://demo.pluginic.com/editorial-rating/editorial-rating-demo-3/\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>See Live Demo</strong></a></p>\n<h3>⭐️ <a href=\"https://pluginic.com/docs/setting-review-rating-widgets/\" title=\"Rating Widget (Rating Widget:)\" rel=\"nofollow ugc\"><strong>Rating Widget:</strong></a></h3>\n<p>With hundreds of affiliate sites reviewing similar products, it&#8217;s difficult to outrank your competition without a visual appeal. Our plugin will help you add captivating Rating Widgets in the sidebar or footer of your website’s pages. Representing Editorial Product Ratings, these colorful widgets quickly catch the reader’s attention, increase click-through rate, and pursue them to stay on your site longer.  <a href=\"https://demo.pluginic.com/editorial-rating/editorial-rating-demo-4/\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>See Live Demo</strong></a></p>\n<h3>⭐️<a href=\"https://pluginic.com/docs/star-rating/\" title=\"Visitor Star Rating: (Visitor Star Rating:)\" rel=\"nofollow ugc\"><strong>Visitor Star Rating:</strong></a></h3>\n<p>The &#8220;Star Rating&#8221; feature in Editorial Rating Blocks allows you to easily add customizable star ratings to your WordPress website. You can adjust the star appearance, size, color, alignment, and more. To use it, add a new page, select the Star Rating block from the Editorial Rating options, customize your settings, and publish. This feature enhances your site&#8217;s visual appeal and engages visitors by showcasing reviews and ratings.</p>\n<h3>⭐️<a href=\"https://pluginic.com/docs/review-info-box/\" title=\"Review Info Box (Review Info Box:)\" rel=\"nofollow ugc\"><strong>Review Info Box:</strong></a></h3>\n<p>The Review Info Box feature in the Editorial Rating plugin allows you to add a detailed review summary to your WordPress posts or pages. It includes customizable fields such as review title, rating, summary, and pros and cons. This feature helps highlight key information about the product or service, making it easier for visitors to grasp essential details at a glance.</p>\n<h3>📝<a href=\"https://pluginic.com/docs/pricing-table/\" title=\"Pricing Table (Pricing Table:)\" rel=\"nofollow ugc\"><strong>Pricing Table:</strong></a></h3>\n<p>The Pricing Table block in the Editorial Rating plugin enables you to create visually appealing and functional pricing tables for your WordPress website. You can customize various aspects such as colors, icons, and content, making it easy to present different pricing options for products or services.</p>\n<h3>📊<a href=\"https://pluginic.com/docs/freemium-table/\" title=\"Freemium Table: (Freemium Table:)\" rel=\"nofollow ugc\"><strong>Freemium Table:</strong></a></h3>\n<p>The Freemium Table feature allows you to display a comparison of free and premium features of your product or service. This helps potential customers understand the benefits of upgrading to a premium plan and make informed decisions.</p>\n<h3>🌟<a href=\"https://pluginic.com/docs/review-summary/\" title=\"Review Summary: (Review Summary:)\" rel=\"nofollow ugc\"><strong>Review Summary:</strong></a></h3>\n<p>The Review Summary feature in the Editorial Rating plugin provides a concise overview of the product or service review. It includes ratings, a brief summary, and key points, helping visitors quickly understand the main aspects of the review.</p>\n<h3>🔍 Google Rich Schema</h3>\n<p>Adding product review schema with the Editorial Rating Review plugin helps your product page get noticed by search engines. This boosts your visibility on Google Search Results Pages (SERP), improving your SEO ranking and making it easier for customers to find your products.  <a href=\"https://demo.pluginic.com/editorial-rating/editorial-rating-demo-4/\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>See Live Demo</strong></a></p>\n<h3>🔍 <a href=\"https://pluginic.com/docs/pros-and-cons/\" title=\"Editorial Review System (Highlight Pros And Cons:)\" rel=\"nofollow ugc\"><strong>Highlight Pros And Cons:</strong></a></h3>\n<p>Ultimate Editorial Rating lets you create a list of pros and cons for the product under review. This remarkable feature empowers visitors to swiftly navigate through the product&#8217;s strengths and limitations, enabling seamless comparisons between options. In addition to elevating user experience, the feature also boosts SEO by providing structured, search-engine-friendly pros and cons lists.</p>\n<h3>🔘 <a href=\"https://pluginic.com/docs/product-link-button/\" title=\"Product Button (Product Button:)\" rel=\"nofollow ugc\"><strong>Product Button:</strong></a></h3>\n<p>A product review is incomplete without a proper call to action. Our plugin lets you add product buttons to your review boxes, redirecting visitors to key product pages like Amazon, Best Buy, Walmart, etc., through affiliate links. Design your site as an enticing journey for your audience, connecting them directly to the products they desire.</p>\n<h3>🔗 <a href=\"https://pluginic.com/docs/pros-and-cons/\" title=\"Wordpress And Woocommerce Compatibility (WordPress And Woocommerce Compatibility:)\" rel=\"nofollow ugc\"><strong>WordPress And Woocommerce Compatibility:</strong></a></h3>\n<p>The ultimate editorial rating plugin is compatible with both wordpress and WooCommerce as well as almost all the latest and popular website themes. For affiliate and blog sites, our plugin will ensure authority and trust and increase traffic with better SEO metrics. eCommerce sites can also get a boost in sales and increased conversion rates with additional ranking benefits.</p>\n<h3>🔄 Regular Updates:</h3>\n<p>Our plugin is regularly updated to ensure optimal performance and high responsiveness. We highly recommend you update the plugin for better integration with WordPress, WooCommerce as well as the website theme.</p>\n<h3>🌟 Premium support:</h3>\n<p>A dedicated team of experts provides premium support for the plugin. You can rely on their assistance to address any questions, issues, or concerns you may have. The support team is available year-round, ensuring that you receive timely and comprehensive assistance when needed.</p>\n<h3>Why Choose Ultimate Editorial Ratings WordPress Plugin?</h3>\n<p>If you&#8217;re looking for ways to enhance your website&#8217;s user experience, build authority and trust, and boost SEO through genuine ratings and reviews, the Ultimate Editorial Ratings is all you need. With our plugin, you get-</p>\n<h3>High-Quality &amp; Secured Coding</h3>\n<p>We designed the plugin to ensure optimum performance, high security, and extreme stability. You don’t need any coding knowledge to use this plugin. We ensure delivering a seamless user experience by employing JavaScript and PHP.</p>\n<h3>24/7 Support Team</h3>\n<p>We have a dedicated team of experts providing premium support for all users- 24 hours a day, 7 days a week! Any questions you have or any problem you face, you can reach out to our support team to receive timely and comprehensive assistance.</p>\n<h3>Enhance User Experience</h3>\n<p>Incorporating editorial ratings with customer reviews and rating widgets, we have developed a system that takes user experience to the next level. Visitors can instantly access expert opinions, user reviews, pros and cons, and other relevant information from your website before buying a product.</p>\n<h3>Boost In SEO And Search Rankings</h3>\n<p>The plugin supports Review Schema, which helps structure your website’s reviews and ratings in a way that search engines understand and present in SERP. Skimmable data boost search engine rankings, increase visibility in search results, and potentially increase click-through rates.</p>\n<h3>Gain Credibility And Trust</h3>\n<p>Product reviews and ratings play a crucial role in establishing trust and credibility among your audience. By showcasing genuine customer feedback and expert editorial ratings, you create a sense of authenticity and reliability, encouraging users to engage more with your products or services.</p>\n<h3>Enhanced Conversion Rates</h3>\n<p>Positive reviews and higher ratings combined with appealing widgets play a direct impact on conversion rates. Adding the Product Button will likely convert your audience into potential buyers, helping you earn from affiliate links.</p>\n<h3>User Engagement And Interactivity</h3>\n<p>The plugin fosters user engagement by allowing customers to leave their reviews and ratings. This promotes user interaction, creating a sense of community and providing valuable insights for other potential buyers.</p>\n<h3>Customization And Flexibility Of Use</h3>\n<p>The plugin offers customization options and multiple layouts, allowing you to tailor the review system to match your website’s design and branding. You can choose from various display options and colors, review categories and highlight specific product features. This flexibility ensures that the review system seamlessly integrates with your website’s aesthetics and overall user interface.</p>\n<h3>User-Friendly Interface</h3>\n<p>The plugin provides a user-friendly interface that simplifies managing and displaying reviews on your website. You can easily add, edit, and moderate reviews through the WordPress dashboard, saving time and effort in managing the review system.</p>\n<h3>Smart Product Review Features</h3>\n<p>The plugin includes Smart Product Review features, enabling you to create dynamic and engaging review content. These features allow you to highlight specific product attributes, showcase customer testimonials, and provide in-depth insights into the products, enhancing the overall user experience.</p>\n<h3>WordPress Review Integration</h3>\n<p>With seamless integration into wordpress, the plugin simplifies the process of posting and managing reviews from wordpress. It seamlessly integrates with the wordpress dashboard, providing familiar and streamlined content creation and review management workflow.</p>\n<h3>Support And Updates</h3>\n<p>By using the Editorial Review System plugin, you gain access to ongoing support and updates. The Ultimate Editorial Ratings team is committed to providing regular updates, bug fixes, and improvements to ensure optimal performance and compatibility with the latest WordPress versions. Additionally, the dedicated support team is available to assist you if you encounter any issues or have questions.</p>\n<p>🚀 How To Enable User Rating Review With The Editorial Rating Plugin<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8eE-sZ2GQds?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>🚀 How To Enable Product Review Schema With The Editorial Rating Plugin<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/0LH4mRtjaMo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>🚀 How to Add Cross Rating or Comparison List With Editorial Rating WordPress Product Review Plugin<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/VRlYw3IndZw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n",
        "installation": "<h4>AUTOMATIC INSTALLATION (EASIEST WAY)</h4>\n<p>To do an automatic install <strong>Ultimate Editorial Rating &#8211; Rating &amp; Review plugin</strong> plugin, log in to your dashboard, navigate to the Plugins menu and<br />\nclick Add New. In the search field type &#8220;Editorial Review System&#8221;. Once you have found it you can install it by simply<br />\nclicking &#8220;Install Now&#8221; and then &#8220;Activate&#8221;.</p>\n<h4>MANUAL INSTALLATION</h4>\n<ul>\n<li>Download the <strong>Ultimate Editorial Rating &#8211; Rating &amp; Review plugin</strong>  plugin</li>\n<li>Navigate to the <strong>Add New</strong> in the plugins dashboard</li>\n<li>Navigate to the <strong>Upload</strong> area</li>\n<li>Select the plugin from your computer</li>\n<li>Click <strong>Install Now</strong></li>\n<li>Activate the plugin in the Plugin dashboard</li>\n</ul>\n",
        "faq": "\n<dt id='the%20plugin%20doesn%27t%20work%3F'>\nThe Plugin Doesn&#8217;t Work?\n</h4>\n<p>\n<p>Simply uninstall the plugin, then reinstall and activate it again. Maximum time this technique works to solve any issue. If you find that the plugin is still not working, feel free to contact us.</p>\n</p>\n<dt id='is%20this%20compatible%20with%20my%20theme%3F'>\nIs This Compatible With My Theme?\n</h4>\n<p>\n<p>Yes, this plugin is fully compatible with almost all the latest and updated themes to ensure the best ever experience for you.</p>\n</p>\n<dt id='do%20you%20support%20google%C3%A2%E2%82%AC%E2%84%A2s%20rich-snippets%3F'>\nDo You Support Googleâ€™s Rich-Snippets?\n</h4>\n<p>\n<p>Yes, definitely! This plugin is integrated with rich-snippet schema.org metadata. By following Googleâ€™s best practices, we make constant updates so that your page can pass Googleâ€™s official rich snippets testing tools.</p>\n</p>\n<dt id='how%20does%20schema%20help%20with%20seo%3F'>\nHow Does Schema Help With Seo?\n</h4>\n<p>\n<p>Generally, the schema includes ratings, products, services, and others that appear directly on SERPs. It helps search engines like Google, Bing, and Yahoo to interpret the information they receive and to display the information on your website in an ideal way. Besides that, schema enables Google to display or showcase your site&#8217;s product and content ideally and in the best possible way for the relevant search queries.</p>\n</p>\n<dt id='how%20can%20i%20get%20the%20widget%3F'>\nHow Can I Get the Widget?\n</h4>\n<p>\n<p>Go to Appearance &gt; Widgets in the Administration Screens. Search &#8220;Editorial Rating&#8221; and select the widget. Choose this Widget and either drag it to the sidebar where you wish it to appear or click the widget (select a destination sidebar if your theme has more than one) and click the Add Widget button.</p>\n</p>\n<dt id='i%20need%20special%20customization%3B%20how%20can%20i%20contact%20you%3F'>\nI Need Special Customization; How Can I Contact You?\n</h4>\n<p>\n<p>You can contact us regarding your customization request <a href=\"https://pluginic.com/contact-us/\" title=\"PLUGINIC - Contact Us\" rel=\"nofollow ugc\"><strong>here</strong></a></p>\n</p>\n<dt id='will%20i%20get%20any%20support%3F'>\nWill I Get Any Support?\n</h4>\n<p>\n<p>Of course, our expert team members are 24/7 available to help you out with any issues. So, you can <a href=\"https://pluginic.com/contact-us/\" title=\"PLUGINIC - Contact Us\" rel=\"nofollow ugc\">contact us</a> with any sort of queries or problems.</p>\n</p>\n<dt id='does%20this%20plugin%20support%20classic%20editor%C3%A2%E2%82%AC%C2%9D%3F'>\nDoes This Plugin Support Classic Editorâ€?\n</h4>\n<p>\n<p>Yes, it works with â€œClassic Editorâ€ as the maximum content publisher uses this page builder.</p>\n</p>\n<dt id='can%20i%20use%20the%20plugin%20free%20without%20subscribing%3F'>\nCan I Use the Plugin Free Without Subscribing?\n</h4>\n<p>\n<p>Yes, the Google Reviews Widget plugin is completely free to download for all users.</p>\n</p>\n<dt id='can%20i%20suggest%20new%20features%3F'>\nCan I Suggest New Features?\n</h4>\n<p>\n<p>You are most welcome to <a href=\"https://pluginic.com/contact-us/\" title=\"PLUGINIC - Contact Us\" rel=\"nofollow ugc\">submit ideas</a> for new features that youâ€™d like to see in the plugin for more convenience.</p>\n</p>\n<dt id='is%20the%20ultimate%20editorial%20rating%20plugin%20compatible%20with%20woocommerce%3F'>\nIs the Ultimate Editorial Rating plugin compatible with WooCommerce?\n</h4>\n<p>\n<p>Yes, the Ultimate Editorial Rating plugin is fully compatible with WooCommerce. It allows customers and editors to leave product reviews and star ratings specifically for WooCommerce products.</p>\n</p>\n<dt id='does%20the%20plugin%20support%20review%20schema%20for%20seo%3F'>\nDoes the plugin support Review Schema for SEO?\n</h4>\n<p>\n<p>Yes, the Ultimate Editorial Rating plugin supports Review Schema. By providing structured data to search engines, it helps improve your website&#8217;s visibility and click-through rates in search engine results, potentially boosting your SEO strategy.</p>\n</p>\n<dt id='can%20customers%20leave%20reviews%20and%20ratings%20for%20products%20using%20this%20plugin%3F'>\nCan customers leave reviews and ratings for products using this plugin?\n</h4>\n<p>\n<p>Absolutely! The Ultimate Editorial Rating plugin enables customers to leave their reviews and feedback on products. This feature encourages customer engagement and helps prospective buyers make informed decisions based on previous customers&#8217; experiences.</p>\n</p>\n<dt id='does%20the%20plugin%20offer%20customization%20options%20for%20review%20display%3F'>\nDoes the plugin offer customization options for review display?\n</h4>\n<p>\n<p>Yes, the Ultimate Editorial Rating plugin provides customization options. You can tailor the review system to match your website&#8217;s design and branding. It allows you to choose from various display options, customize review categories, and highlight specific product features.</p>\n</p>\n<dt id='is%20coding%20knowledge%20required%20to%20use%20this%20plugin%3F'>\nIs coding knowledge required to use this plugin?\n</h4>\n<p>\n<p>No coding knowledge is required to use the Ultimate Editorial Rating plugin. It has a user-friendly interface and provides simple copy-and-paste shortcodes, making it easy for anyone to display review boxes on desired pages without any coding expertise.</p>\n</p>\n\n",
        "changelog": "<h4>1.0.0</h4>\n<ul>\n<li>Fix: Conflict with Twenty Twenty &#8211; theme.</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Update: Post edit page options updated.</li>\n</ul>\n<h4>2.0.0</h4>\n<ul>\n<li>Add: Shortcode System.</li>\n<li>Add: Product image.</li>\n<li>Update: Automatic shortcode generate through post ID.</li>\n<li>Fix: Duplicate rating conflict on same post.</li>\n</ul>\n<h4>2.1.0</h4>\n<ul>\n<li>Add: Schema markup.</li>\n<li>Fix: Duplicating schema (JSON-LD).</li>\n<li>Fix: Responsive issue with product images.</li>\n</ul>\n<h4>2.1.1</h4>\n<ul>\n<li>Add: Nofollow attribute on button link.</li>\n<li>Add: Product image options into widget.</li>\n<li>Fix: Hide widget on tab/mobile.</li>\n<li>Fix: Sticky stuck on mobile.</li>\n</ul>\n<h4>2.1.2</h4>\n<ul>\n<li>Add: Sticky disable on footer touch.</li>\n<li>Add: On/Off pros cons area.</li>\n<li>Fix: Sidebar rating not found on Astra theme.</li>\n</ul>\n<h4>3.0.0</h4>\n<ul>\n<li>Add: Dashboard Menu.</li>\n<li>Add: ER in any custom post types.</li>\n<li>Fix: Sanitization &amp; Validation.</li>\n</ul>\n<h4>3.1.0</h4>\n<ul>\n<li>Fix: WP Editor conflicts.</li>\n<li>Fix: Compatible with WP-6.4</li>\n</ul>\n<h4>4.0.0</h4>\n<ul>\n<li>New: Editorial Rating related blocks.</li>\n<li>New: Unlimited reviews from dashboard by Shortcode.</li>\n<li>New: Publish date time.</li>\n<li>New: Custom date.</li>\n<li>New: Date label.</li>\n<li>New: Option for linked up the product name.</li>\n<li>New: Option for linked up the product image.</li>\n<li>Improved: Admin UI/UX.</li>\n<li>Improved: User reviews.</li>\n<li>Improved: Schema markup.</li>\n<li>Tested: WordPress 6.5 compatibility.</li>\n<li>Fix: Compatible with PHP 8.3</li>\n</ul>\n<h4>4.0.1</h4>\n<ul>\n<li>Added: Legacy mode support.</li>\n<li>Tested: WordPress 6.6 compatibility.</li>\n</ul>\n<h4>4.0.2</h4>\n<ul>\n<li>Update: Help section.</li>\n<li>Improved: Admin UI/UX.</li>\n</ul>\n"
    },
    "short_description": "Editorial Rating is the best WordPress product review plugin, adding multi-criteria star ratings, boosting engagement, SEO, and increasing sales.",
    "description": "<p>Add product reviews effortlessly to your WordPress product posts or pages with our Ultimate Editorial Rating WordPress Free product review plugin.</p>\n<p>Now you can add multi-criteria product rating &amp; reviews for any WordPress post using WordPress product review plugin &#8211; Ultimate Editorial Rating. It’s easy to install and has an advanced dashboard that works seamlessly with any WordPress website.</p>\n<p>✨ <a href=\"https://demo.pluginic.com/editorial-rating/\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>Live Demo</strong></a> | 📚<a href=\"https://pluginic.com/docs/editorial-rating/\" title=\"Editorial Rating - Documentation\" rel=\"nofollow ugc\"><strong>Documentation</strong></a> | 💬<a href=\"https://pluginic.com/support/\" title=\"Editorial Review System - Support\" rel=\"nofollow ugc\"><strong>Support Forum &raquo;</strong></a> | 🌟<a href=\"https://pluginic.com/plugins/editorial-rating/\" title=\"Premium Features\" rel=\"nofollow ugc\"><strong>Premium Features</strong></a> | 🔥<a href=\"https://pluginic.com/plugins/editorial-rating/\" title=\"Get Pro (30% OFF)\" rel=\"nofollow ugc\"><strong>Get Pro (30% OFF)&raquo;</strong></a></p>\n<p>By using our plugin, you can create multiple review criteria for your WordPress product posts or pages, including product quality, features, service aspects, price, pros, cons, and more. These multiple review criteria help users make wise decisions effortlessly. Additionally, users can rate products through comment reviews and visitor star ratings.</p>\n<p>The free version allows you to set limited criteria for your product reviews. To add more criteria, you’ll need to upgrade to the premium version of the Ultimate Editorial Rating plugin.</p>\n<p>Watch The Official Video For Install, How To Install and Use Editorial Rating WordPress Product Review Plugin</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8eE-sZ2GQds?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Best Product Review Plugin With Star Rating (WooCommerce Support)</h3>\n<p>The #1 Best WordPress product review plugin helps you add multi criteria product rating, increase engagement, build loyalty, improve SEO, and get more sales with social proof also.</p>\n<p>The Ultimate Editorial Rating is a FREE WordPress product review plugin that enhances WordPress and eCommerce sites with a bundle of awesome features: Multi-criteria star Ratings, Total Score Calculation, Review Schema, Pros and Cons Highlights, and more. Amplify your website’s potential with expert Editorial Ratings and insightful Customer Reviews. Plus, you can  enjoy the added flair of Pros and Cons showcases and eye-catching Rating Widgets to captivate your visitors.</p>\n<h3>Key Features Of Ultimate Editorial Product Rating Plugin</h3>\n<p>Have a quick scan at the core features you can get with our plugin-</p>\n<ul>\n<li>Multi-Criteria Rating and Reviews on single posts/pages.</li>\n<li>Shortcode System</li>\n<li>9+ Ready made Review Layout (For Free 1)</li>\n<li>7+ Cross / Compare Rating layout  (Pro)</li>\n<li>Customer Rating options   (Pro)</li>\n<li>Visitor Rating options    (Pro)</li>\n<li>Pros and Cons Option</li>\n<li>Show/hide score on the post.</li>\n<li>WooCommerce Compatibility (Pro)</li>\n<li>Review Schema Support</li>\n<li>Total Score calculation of each point / total rating category.</li>\n<li>Editorial Rating on the sidebar.</li>\n<li>Sticky Editorial Rating Sidebar.</li>\n<li>Rating Widget</li>\n<li>No coding required</li>\n</ul>\n<p>Still not convinced? Allow us to break down these exceptional features for you.</p>\n<h3>⭐️  9+ Ready Made Review Layout Design</h3>\n<p>The Ultimate Editorial Rating plugin offers over 9 stunning, ready-made review layout designs to make your product reviews stand out. These layouts are carefully crafted to enhance readability and visual appeal, ensuring your reviews look professional and engaging. Whether you prefer a simple star rating or a detailed multi-criteria review, you can easily choose and apply a layout that suits your website&#8217;s style, making it easy for visitors to digest and appreciate your reviews.  <a href=\"https://demo.pluginic.com/editorial-rating//\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>See Live Demo</strong></a></p>\n<h3>✨  <a href=\"\" title=\"https://pluginic.com/docs/editorial-cross-rating/&quot;7+ Ready Made Cross Rating/Compare Layout Design  (7+ Ready Made Cross Rating/Compare Layout Design )\" rel=\"nofollow ugc\">7+ Ready Made Cross Rating/Compare Layout Design </a></h3>\n<p>Our plugin also includes more than 7 pre-designed cross-rating and compare layout options, perfect for comparing multiple products side by side. These layouts allow you to present detailed comparisons with clear, attractive visuals, helping your audience quickly identify the strengths and weaknesses of different products. By using these comparison layouts, you can provide your visitors with valuable insights, facilitating informed purchasing decisions and enhancing user engagement. <a href=\"https://demo.pluginic.com/editorial-rating/\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>See Live Demo</strong></a></p>\n<h3>🌟 Multi-Criteria Rating And Reviews</h3>\n<p>Multi-criteria ratings and reviews help users provide feedback based on various aspects of the product or service. You can set all the criteria from WordPress, which reviewers will see on display. With this feature, you can engage visitors to interact with the product on review and gain trust from future visitors. Your path to building strong relationships with visitors starts here!   <a href=\"https://demo.pluginic.com/editorial-rating/editorial-rating-demo-1/\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>See Live Demo</strong></a></p>\n<h3>📝 Editorial Rating System:</h3>\n<p>The Editorial Rating System allows you to rate the products on multiple criteria. Whether you&#8217;re an industry expert or a satisfied customer, your firsthand experience brings an impartial perspective, guiding potential buyers toward informed choices. Editorial ratings are crucial to grow audience trust and send professional feedback to businesses addressing areas of improvement.</p>\n<h3>👥 Customer Review:</h3>\n<p>Customer reviews are a cornerstone for any brand to outshine its competitors and solidify the brand&#8217;s reputation. Ultimate Editorial Rating lets genuine product users leave a constructive review on your site. For SEO, this will increase customer engagement on your site, and the visitors can make informed decisions based on previous customers’ experiences. <a href=\"https://demo.pluginic.com/editorial-rating/editorial-rating-demo-3/\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>See Live Demo</strong></a></p>\n<h3>⭐️ <a href=\"https://pluginic.com/docs/setting-review-rating-widgets/\" title=\"Rating Widget (Rating Widget:)\" rel=\"nofollow ugc\"><strong>Rating Widget:</strong></a></h3>\n<p>With hundreds of affiliate sites reviewing similar products, it&#8217;s difficult to outrank your competition without a visual appeal. Our plugin will help you add captivating Rating Widgets in the sidebar or footer of your website’s pages. Representing Editorial Product Ratings, these colorful widgets quickly catch the reader’s attention, increase click-through rate, and pursue them to stay on your site longer.  <a href=\"https://demo.pluginic.com/editorial-rating/editorial-rating-demo-4/\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>See Live Demo</strong></a></p>\n<h3>⭐️<a href=\"https://pluginic.com/docs/star-rating/\" title=\"Visitor Star Rating: (Visitor Star Rating:)\" rel=\"nofollow ugc\"><strong>Visitor Star Rating:</strong></a></h3>\n<p>The &#8220;Star Rating&#8221; feature in Editorial Rating Blocks allows you to easily add customizable star ratings to your WordPress website. You can adjust the star appearance, size, color, alignment, and more. To use it, add a new page, select the Star Rating block from the Editorial Rating options, customize your settings, and publish. This feature enhances your site&#8217;s visual appeal and engages visitors by showcasing reviews and ratings.</p>\n<h3>⭐️<a href=\"https://pluginic.com/docs/review-info-box/\" title=\"Review Info Box (Review Info Box:)\" rel=\"nofollow ugc\"><strong>Review Info Box:</strong></a></h3>\n<p>The Review Info Box feature in the Editorial Rating plugin allows you to add a detailed review summary to your WordPress posts or pages. It includes customizable fields such as review title, rating, summary, and pros and cons. This feature helps highlight key information about the product or service, making it easier for visitors to grasp essential details at a glance.</p>\n<h3>📝<a href=\"https://pluginic.com/docs/pricing-table/\" title=\"Pricing Table (Pricing Table:)\" rel=\"nofollow ugc\"><strong>Pricing Table:</strong></a></h3>\n<p>The Pricing Table block in the Editorial Rating plugin enables you to create visually appealing and functional pricing tables for your WordPress website. You can customize various aspects such as colors, icons, and content, making it easy to present different pricing options for products or services.</p>\n<h3>📊<a href=\"https://pluginic.com/docs/freemium-table/\" title=\"Freemium Table: (Freemium Table:)\" rel=\"nofollow ugc\"><strong>Freemium Table:</strong></a></h3>\n<p>The Freemium Table feature allows you to display a comparison of free and premium features of your product or service. This helps potential customers understand the benefits of upgrading to a premium plan and make informed decisions.</p>\n<h3>🌟<a href=\"https://pluginic.com/docs/review-summary/\" title=\"Review Summary: (Review Summary:)\" rel=\"nofollow ugc\"><strong>Review Summary:</strong></a></h3>\n<p>The Review Summary feature in the Editorial Rating plugin provides a concise overview of the product or service review. It includes ratings, a brief summary, and key points, helping visitors quickly understand the main aspects of the review.</p>\n<h3>🔍 Google Rich Schema</h3>\n<p>Adding product review schema with the Editorial Rating Review plugin helps your product page get noticed by search engines. This boosts your visibility on Google Search Results Pages (SERP), improving your SEO ranking and making it easier for customers to find your products.  <a href=\"https://demo.pluginic.com/editorial-rating/editorial-rating-demo-4/\" title=\"Editorial Review System (Live Demo Link)\" rel=\"nofollow ugc\"><strong>See Live Demo</strong></a></p>\n<h3>🔍 <a href=\"https://pluginic.com/docs/pros-and-cons/\" title=\"Editorial Review System (Highlight Pros And Cons:)\" rel=\"nofollow ugc\"><strong>Highlight Pros And Cons:</strong></a></h3>\n<p>Ultimate Editorial Rating lets you create a list of pros and cons for the product under review. This remarkable feature empowers visitors to swiftly navigate through the product&#8217;s strengths and limitations, enabling seamless comparisons between options. In addition to elevating user experience, the feature also boosts SEO by providing structured, search-engine-friendly pros and cons lists.</p>\n<h3>🔘 <a href=\"https://pluginic.com/docs/product-link-button/\" title=\"Product Button (Product Button:)\" rel=\"nofollow ugc\"><strong>Product Button:</strong></a></h3>\n<p>A product review is incomplete without a proper call to action. Our plugin lets you add product buttons to your review boxes, redirecting visitors to key product pages like Amazon, Best Buy, Walmart, etc., through affiliate links. Design your site as an enticing journey for your audience, connecting them directly to the products they desire.</p>\n<h3>🔗 <a href=\"https://pluginic.com/docs/pros-and-cons/\" title=\"Wordpress And Woocommerce Compatibility (WordPress And Woocommerce Compatibility:)\" rel=\"nofollow ugc\"><strong>WordPress And Woocommerce Compatibility:</strong></a></h3>\n<p>The ultimate editorial rating plugin is compatible with both wordpress and WooCommerce as well as almost all the latest and popular website themes. For affiliate and blog sites, our plugin will ensure authority and trust and increase traffic with better SEO metrics. eCommerce sites can also get a boost in sales and increased conversion rates with additional ranking benefits.</p>\n<h3>🔄 Regular Updates:</h3>\n<p>Our plugin is regularly updated to ensure optimal performance and high responsiveness. We highly recommend you update the plugin for better integration with WordPress, WooCommerce as well as the website theme.</p>\n<h3>🌟 Premium support:</h3>\n<p>A dedicated team of experts provides premium support for the plugin. You can rely on their assistance to address any questions, issues, or concerns you may have. The support team is available year-round, ensuring that you receive timely and comprehensive assistance when needed.</p>\n<h3>Why Choose Ultimate Editorial Ratings WordPress Plugin?</h3>\n<p>If you&#8217;re looking for ways to enhance your website&#8217;s user experience, build authority and trust, and boost SEO through genuine ratings and reviews, the Ultimate Editorial Ratings is all you need. With our plugin, you get-</p>\n<h3>High-Quality &amp; Secured Coding</h3>\n<p>We designed the plugin to ensure optimum performance, high security, and extreme stability. You don’t need any coding knowledge to use this plugin. We ensure delivering a seamless user experience by employing JavaScript and PHP.</p>\n<h3>24/7 Support Team</h3>\n<p>We have a dedicated team of experts providing premium support for all users- 24 hours a day, 7 days a week! Any questions you have or any problem you face, you can reach out to our support team to receive timely and comprehensive assistance.</p>\n<h3>Enhance User Experience</h3>\n<p>Incorporating editorial ratings with customer reviews and rating widgets, we have developed a system that takes user experience to the next level. Visitors can instantly access expert opinions, user reviews, pros and cons, and other relevant information from your website before buying a product.</p>\n<h3>Boost In SEO And Search Rankings</h3>\n<p>The plugin supports Review Schema, which helps structure your website’s reviews and ratings in a way that search engines understand and present in SERP. Skimmable data boost search engine rankings, increase visibility in search results, and potentially increase click-through rates.</p>\n<h3>Gain Credibility And Trust</h3>\n<p>Product reviews and ratings play a crucial role in establishing trust and credibility among your audience. By showcasing genuine customer feedback and expert editorial ratings, you create a sense of authenticity and reliability, encouraging users to engage more with your products or services.</p>\n<h3>Enhanced Conversion Rates</h3>\n<p>Positive reviews and higher ratings combined with appealing widgets play a direct impact on conversion rates. Adding the Product Button will likely convert your audience into potential buyers, helping you earn from affiliate links.</p>\n<h3>User Engagement And Interactivity</h3>\n<p>The plugin fosters user engagement by allowing customers to leave their reviews and ratings. This promotes user interaction, creating a sense of community and providing valuable insights for other potential buyers.</p>\n<h3>Customization And Flexibility Of Use</h3>\n<p>The plugin offers customization options and multiple layouts, allowing you to tailor the review system to match your website’s design and branding. You can choose from various display options and colors, review categories and highlight specific product features. This flexibility ensures that the review system seamlessly integrates with your website’s aesthetics and overall user interface.</p>\n<h3>User-Friendly Interface</h3>\n<p>The plugin provides a user-friendly interface that simplifies managing and displaying reviews on your website. You can easily add, edit, and moderate reviews through the WordPress dashboard, saving time and effort in managing the review system.</p>\n<h3>Smart Product Review Features</h3>\n<p>The plugin includes Smart Product Review features, enabling you to create dynamic and engaging review content. These features allow you to highlight specific product attributes, showcase customer testimonials, and provide in-depth insights into the products, enhancing the overall user experience.</p>\n<h3>WordPress Review Integration</h3>\n<p>With seamless integration into wordpress, the plugin simplifies the process of posting and managing reviews from wordpress. It seamlessly integrates with the wordpress dashboard, providing familiar and streamlined content creation and review management workflow.</p>\n<h3>Support And Updates</h3>\n<p>By using the Editorial Review System plugin, you gain access to ongoing support and updates. The Ultimate Editorial Ratings team is committed to providing regular updates, bug fixes, and improvements to ensure optimal performance and compatibility with the latest WordPress versions. Additionally, the dedicated support team is available to assist you if you encounter any issues or have questions.</p>\n<p>🚀 How To Enable User Rating Review With The Editorial Rating Plugin<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8eE-sZ2GQds?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>🚀 How To Enable Product Review Schema With The Editorial Rating Plugin<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/0LH4mRtjaMo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>🚀 How to Add Cross Rating or Comparison List With Editorial Rating WordPress Product Review Plugin<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/VRlYw3IndZw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/editorial-rating.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-1.jpg?rev=2648899",
            "caption": "Product Review Plugin (Demo)."
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-2.jpg?rev=2928571",
            "caption": "Smart Product Review"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-3.jpg?rev=2928571",
            "caption": "Multi-criteria Rating &amp; Reviews"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-4.jpg?rev=2928571",
            "caption": "Pros and Cons Plugin WordPress"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-5.jpg?rev=2928571",
            "caption": "User Rating and Review"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-6.jpg?rev=2928571",
            "caption": "Star Rating Plugin"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-7.jpg?rev=2928571",
            "caption": "Review Schema Sample\n8.Product Review Demo - 1 (Most Popular)"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-8.png?rev=3127080",
            "caption": "Star Rating Demo - 2 (Based on Categories)"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-9.png?rev=3127080",
            "caption": "Affiliate Product Review Demo - 3 (Author Mentioned)"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-10.png?rev=3127080",
            "caption": "Product review for WooCommerce Demo - 4 (Rating Position)"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-11.png?rev=3127080",
            "caption": "Reviews for WooCommerce Demo - 5 (Dark Mood)"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-12.png?rev=3127080",
            "caption": "Review for Custom Post Demo - 6 (Feature List)"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-13.png?rev=3127080",
            "caption": "Google Rating Layout Demo - 7 (Google Recommended Layout)"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-14.png?rev=3127080",
            "caption": "Review with Produt Gallery Demo - 8 (Product Gallery)"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-15.png?rev=3127080",
            "caption": "Review Autho Demo - 9 (Highlight Author)"
        },
        {
            "src": "https://ps.w.org/editorial-rating/assets/screenshot-16.png?rev=3127080",
            "caption": ""
        }
    ],
    "tags": {
        "customer-review": "customer review",
        "product-review": "product review",
        "rating": "rating",
        "review-schema": "Review Schema",
        "star-rating": "star rating"
    },
    "stable_tag": "trunk",
    "versions": {
        "4.0.0": "https://downloads.wordpress.org/plugin/editorial-rating.4.0.0.zip",
        "4.0.1": "https://downloads.wordpress.org/plugin/editorial-rating.4.0.1.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/editorial-rating/assets/banner-772x250.jpg?rev=3130630",
        "high": "https://ps.w.org/editorial-rating/assets/banner-1544x500.jpg?rev=3130630"
    },
    "icons": {
        "1x": "https://ps.w.org/editorial-rating/assets/icon-128x128.gif?rev=2757360"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 90,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}