{
    "name": "Educare &#8211; Students &amp; Result Management System",
    "slug": "educare",
    "version": "1.4.9",
    "author": "<a href=\"http://fixbd.net\">FixBD</a>",
    "author_profile": "https://profiles.wordpress.org/fixbd/",
    "contributors": {
        "fixbd": {
            "profile": "https://profiles.wordpress.org/fixbd/",
            "avatar": "https://secure.gravatar.com/avatar/90803539cb85895d3ed7b6bb49ff9a61?s=96&d=monsterid&r=g",
            "display_name": "FixBD"
        }
    },
    "requires": "3.8",
    "tested": "6.5.5",
    "requires_php": "5.2.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 92,
    "ratings": {
        "5": 15,
        "4": 0,
        "3": 0,
        "2": 1,
        "1": 1
    },
    "num_ratings": 17,
    "support_url": "https://wordpress.org/support/plugin/educare/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 16013,
    "last_updated": "2024-04-18 9:40am GMT",
    "added": "2021-10-23",
    "homepage": "http://github.com/fixbd/educare",
    "sections": {
        "description": "<p><strong>No. 1 Academic Result Management Plugin For WordPress Users.</strong></p>\n<p>Educare is a online Students &amp; Results management system developed by FixBD. This powerful results management plugin is built to easily manage institute, academy, or student results online. Designed to be universally adaptable, this solution seamlessly integrates with result systems across the world. No matter the format, Educare supports diverse result systems, making it your go-to choice for streamlined and efficient management.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/U29ZoNDBiDU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Educare is free and always will be, but it has a premium version that is even more functional and powerful.</p>\n<p>Please note: This is an old video. We are updating Educare regularly. More features have been added in the updated version. We will upload it soon.</p>\n<h3>Features</h3>\n<p>We are constantly working on discovering new features and (Add-Ons) for templates to make Educare better and smoother. Also, you can build your own template based on your requirements. Let&#8217;s see why Educare is so special &#8211;</p>\n<h3>Custom Add-Ons For Enhanced Functionality (*):</h3>\n<ol>\n<li>Search Form: You can add custom templates and beautify your search Form, simplifying results searches and enhancing user experience.</li>\n<li>Result Card: Explore our robust results system! Result card Add-Ons help you adjust Educare with your result system easily.</li>\n<li>Certificate Template: Customize Educare to match your requirements for online certificate provision and improve the certification process.</li>\n<li>Also, Educare supports custom Import System Add-Ons. You can build custom import systems to adjust Educare to your results system.</li>\n</ol>\n<p>So as you can see &#8211; You have complete control over your system. Now we will discuss some more important features of it. Let&#8217;s explore!</p>\n<h3>Key Features:</h3>\n<p><strong>Powerful Results Management &#8211;</strong></p>\n<ul>\n<li>Manage unlimited results, students, or teacher records.</li>\n<li>Auto/manual results calculations.</li>\n<li>Certificate adding facility (with auto generated based on results) (*).</li>\n<li>Custom Add-Ons for Results Card, Certificate, Search Form, or Import system (*).</li>\n<li>Password or PIN-based results access (*).</li>\n</ul>\n<p><strong>Flexible Class and Subject Management &#8211;</strong></p>\n<ul>\n<li>Manage unlimited Class, Group, Subject Rating scale, Exam, Year and Extra fields.</li>\n<li>Class/group-wise subject management.</li>\n<li>Individually marks added facilities (*).</li>\n<li>Multi-student and multi-subject marks added facilities (*).</li>\n</ul>\n<p><strong>Comprehensive User Roles (*)</strong></p>\n<ul>\n<li>Three roles: Admin, Teacher, and Student.</li>\n<li>Detailed student profiles and dashboards.</li>\n<li>Teachers profile and dashboard.</li>\n<li>Support for importing students and results via .csv files.</li>\n<li>Support for importing students, teachers, and results via Excel files with the extensions (.xlsx, .xlsm or .xls).</li>\n</ul>\n<p><strong>Robust Grading and Reporting &#8211;</strong></p>\n<ul>\n<li>Auto calculate and display various result metrics.</li>\n<li>Auto grading system with customizable rules.</li>\n<li>Rich result card and report customization options.</li>\n</ul>\n<p><strong>Professional Certificate System (*)</strong></p>\n<ul>\n<li>Customizable certificate templates.</li>\n<li>Automatically generate certificates based on results.</li>\n<li>Support for embed variables for custom certificate content.</li>\n<li>Useful shortcode system.</li>\n</ul>\n<p><strong>Manage any type of result with &#8211;</strong></p>\n<ul>\n<li>Powerful Settings and Dashboard.</li>\n<li>Everything is Ajax compatibility (Back-End and Front-End).</li>\n<li>It&#8217;s as simple as it looks, just as powerful also useful!.</li>\n</ul>\n<p>After reading this feature list, you can probably imagine Educare is the best plugin in the market. So, do you want to unlock the advanced features? <a href=\"https://fixbd.net/educare\" rel=\"nofollow ugc\">Upgrade to our Pro version</a>.</p>\n<ul>\n<li><a href=\"https://educare.fixbd.net/results\" rel=\"nofollow ugc\">Check the Demos</a></li>\n</ul>\n<h3>Explain With More Details</h3>\n<p>Educare helps you easily control over your institute students and results online. You can easily Add/Edit/Delete Teachers, Students, Results, Class, Group, Rating Scale, Exam, Year, Extra Field, Custom Result Rules, Auto result calculations and much more&#8230; Also, you can add student attendance, single or multiple student marks (with single or multiple subjects), promote students, import unlimited students, teacher, or results just one click! Now I will explain more about these features &#8211;</p>\n<h4>Admin Can &#8211;</h4>\n<ul>\n<li>Admin can access Educare all menu or settings.</li>\n<li>Add or manage students, teachers, and results.</li>\n<li>Add/Update/Delete Class, Subject, Group, Exam, Rating Scale, Year, Extra (Custom) Field.</li>\n<li>Customize result rules (grading systems) based on country or requirements.</li>\n<li>Admin can add class or subject-wise multiple student results at the same time.</li>\n<li>Import unlimited students, teachers, and results.</li>\n<li>Filter and view all teachers, students, results (Like &#8211; class, exam, year, group, subject with Asc/Desc mode and more&#8230;).</li>\n<li>Modify default students&#8217; photos.</li>\n<li>Also, you can find many features while using it.</li>\n</ul>\n<h4>Teachers (*) &#8211;</h4>\n<ul>\n<li>Teachers can add marks (based on subject or class).</li>\n<li>Fill attendance.</li>\n<li>Promote students.</li>\n</ul>\n<h4>Students or Parents &#8211;</h4>\n<ul>\n<li>Students or Parents can find results or certificates by name, registration number, roll number, exam, passing year (based on Educare settings).</li>\n<li>Students can log in to their profiles (*).</li>\n<li>View attendance (*).</li>\n<li>View results.</li>\n<li>Get Certificate (*).</li>\n<li>Print or save results and certificates.</li>\n</ul>\n<h4>Certificate System (*) &#8211;</h4>\n<ul>\n<li>Educare Certificate Template, designed for easy customization and a professional finish.</li>\n<li>Everything is customizable.</li>\n<li>Automatically generated certificate based on results.</li>\n<li>Support embed variables. So, you can easily customize certificate content.</li>\n<li>Custom background for the certificate.</li>\n<li>Supports Add-Ons for the certificate system.</li>\n</ul>\n<h4>Results System &#8211;</h4>\n<ul>\n<li>You can add additional marks terms (e.g., Practical Marks, Exam Marks, CA1, CA2&#8230; and more) (*).</li>\n<li>Auto combine marks (like: ca1 + ca2 + ca1 = combined marks).</li>\n<li>Auto position in subject.</li>\n<li>Auto subject-wise class average.</li>\n<li>Auto highest and lowest in class.</li>\n<li>Auto position in class (every single student).</li>\n<li>Auto Grading system (Letter grade or number points).</li>\n<li>Password or PIN-based results access (*).</li>\n</ul>\n<p>Note: Everything is customizable like &#8211; anable or disable specific terms/fields , auto or manual data input&#8230;</p>\n<h4>Result Card &#8211;</h4>\n<ul>\n<li>Everything is customizable.</li>\n<li>Support custom Add-Ons for the results system.</li>\n</ul>\n<h4>Rating system (*) &#8211;</h4>\n<p>You can add unlimited ratings groups or terms. Example:</p>\n<p>Effective Development<br />\n1. Activeness<br />\n2. Attendance<br />\n3. Punctuality</p>\n<p>Psychomotor Skills<br />\n1. Handwriting<br />\n2. Fluency<br />\n3. And more&#8230;</p>\n<h4>Others &#8211;</h4>\n<ul>\n<li>Auto number of subjects.</li>\n<li>Auto calculate and show total marks obtainable.</li>\n<li>Auto calculate and show marks obtained.</li>\n<li>Auto calculate marks average.</li>\n<li>Auto position in class (e.g., 1 out of 50).</li>\n<li>Auto passed/failed status.</li>\n</ul>\n<h4>Remarks (*) &#8211;</h4>\n<ul>\n<li>Teachers&#8217;, principal&#8217;s remarks.</li>\n<li>Names of commenters.</li>\n<li>Date or signature.</li>\n</ul>\n<h4>Print &#8211;</h4>\n<ul>\n<li>Print with actual data, nothing to miss.</li>\n<li>Students&#8217; details, rating scale, remarks section, signature, date, and more.</li>\n<li>Support for all (format) paper sizes (A4, A3, Letter, Legal&#8230;).</li>\n</ul>\n<p>Overall Educare is a completely full-featured result management system. Another thing, we are working on making Educare fully usable as an institute or academy management system a part of that, we are already added some extra features like:</p>\n<h3>Additional features</h3>\n<ul>\n<li>Attendance system (*)</li>\n<li>Users roles and capabilities (*)</li>\n<li>Profiles or Dashboard for students and teachers (*)</li>\n</ul>\n<p><strong>Note:</strong> Only Pro users can use the features marked with (*). If you&#8217;re not a Pro user, those features are off-limits to you.</p>\n<p>The premium version of Educare comes with more powerful, user-friendly and useful functionality. Most Important thing is that, now it&#8217;s possible to manage any type of result system in the world using Educare! Let&#8217;s see how it&#8217;s possible &rarr;</p>\n<h3>Student Management</h3>\n<p>Admin can add single and import unlimited students via Exel file. Once, student details are added then no need to fill student details again while adding or publishing any results. Also, Student can login and access their data. Exp: View results, See attendance, Get notice, Explore old (class) data and much more.</p>\n<h3>Results Management</h3>\n<p>Educare provide powerful results management functionality. Admin can publish single and import unlimited results via .csv (Excel) files. Educare help to process and automatically calculate the results. When the result is published, the student can view result by roll number, registration number, class, examination or year. Also, student can save or print the results.</p>\n<h3>Educare Marksheet Systems</h3>\n<p>Using this features admin (teacher) can add subject or class wise multiple student results at a same time. So, it&#8217;s most useful for (single) teacher. There are different teachers for each subject. Teachers can add marks for their specific subject using this feature. After, the mark addition is done for all the subjects, students can view and print their results when admin publish it as results. Also, teacher can print all student marks as a marksheet. (We call it &#8211; THE GOLDEN FEATURES FOR TEACHER!).</p>\n<h3>Performance or Promote Students</h3>\n<p>Admin or authorized person can conditionally promote or change class, year, group of multiple students with just one click! Most useful when students need to be promoted (from one class to another class) or when multiple students need to be updated. Also, educare help you to apply conditions when promote the students.</p>\n<h3>Grading Systems</h3>\n<p>Using this feature you (admin or authorized person) can add, modify, manage or automatically calculate any type of result GPA or CGPA based on requirements. E.g. India, Bangladesh, Nigeria or US result GPA (CGPA) and calculation methods/rules are different. So, maintaining a defined result using one rule is a bit tricky. The result rule feature solves this problem. If you manage results for Indian students, you can add Indian grading system or rules. Also, you can add Bangladesh, Nigeria or US grading system in the same way. Also, Educare support custom add-ons for results system to adjust your results format.</p>\n<h3>Office Management</h3>\n<p>Admin can add class or group wise subject, ratings scale, exam, session/year, extra (custom) fields and more.</p>\n<h3>Strong Security</h3>\n<p>Educare come with powerful and strong security system. Apart from that, Educare support Google Re-Captcha security system. By using these features Educare keep your system safe and secure.</p>\n<ul>\n<li>If you discover any security-related issues, please let us know. We will take immediate action.</li>\n</ul>\n<h3>Protected Result</h3>\n<p>When it comes to password or PIN-based authentication systems, the primary goal is to ensure that only specific users with the correct PIN or password can access specific results. By implementing this process, Educare helps protect result information and prevent unauthorized access. Moreover, this feature enables authorities to restrict access for specific or multiple students, such as in cases of non-payment or similar issues, ensuring effective control over students and security.</p>\n<h3>Users Roles and Permission &#8211;</h3>\n<p>Educare User Roles and Permissions allows the administrator to grant users appropriate access to various functionalities, based on their roles and capabilities.</p>\n<h3>User&#8217;s Profile and Dashboard</h3>\n<p>Educare provides custom user dashboards for students, parents and teachers. Also, there is a dashboard for admin! Students and teachers can access data by login their profiles. Here students can view attendance, results, performance, account balance, routine, notices, upcoming events and more. Also, teachers can add marks or attendance.</p>\n<h3>Attendance System &#8211;</h3>\n<p>The teacher or authorized person can fill in attendance based on class or subject. Once the attendance is completed, Parents can view this attendance status from specific student profile dashboard.</p>\n<h3>Individually marks added facilities &#8211;</h3>\n<p>With educare premium version, it&#8217;s possible to add single or multiple students marks at a same time. So, you don&#8217;t need to compose results using excel and import it. you can do this process directly using Educare. Also, only authorized teacher can add marks based on subject, class and roles.</p>\n<h3>Template Management &#8211;</h3>\n<p>You can customize result card or search form, results card or certificate and easily switch one template to others. Also, you can build, add or install your custom template. We are constantly working on discovering new template to make Educare better and smoother. You can check template list on our official website.</p>\n<h3>Everything Is Auto Calculated &#8211;</h3>\n<p>Powerful results management system with auto calculation facilities, ratings system and more. For example, Educare help to auto calculate class average, position in class, highest and lowest in class, GPA, letter grade. We have explained this bellow also in a video. The link is given in the description box, you can watch this video for more details about this.</p>\n<p>Educare is a 100% mobile responsive, So educare will always look great on all devices (mobile, tablet, laptop, and desktop). And everything is Ajax compatibility (Back-End and Front-End).</p>\n<p>Just install and manage your institute, school, college, coaching center &amp; personal website with powerful features of Educare. Remember, You can manage any type of results system using Educare.</p>\n<h3>Shortcodes</h3>\n<p>Copy and paste these shortcodes in your editor, template, or any shortcode-ready area to display the front-end results system:</p>\n<ul>\n<li><code>[educare_results]</code>: Display results system.</li>\n<li><code>[educare_results certificate=\"true\" results=\"false\"]</code>: Display certificate system (*).</li>\n<li><code>[educare_results certificate=\"true\"]</code>: Display both (Results and Certificate) system (*).</li>\n<li><code>[educare_user_profiles]</code>: Show user profiles and dashboards (*).</li>\n<li><code>[educare_attendance]</code>: Display attendance status (*).</li>\n</ul>\n<p>More detailed instructions are included in the plugin&#8217;s <code>README.md</code> files.</p>\n<h3>Why You Should Choose Educare?</h3>\n<ul>\n<li>Powerful functionality that we need to manage students or results.</li>\n<li>Everything is Ajax compatibility (Back-End and Front-End).</li>\n<li>Everything is customizable.</li>\n<li>Custom add-ons facilities.</li>\n<li>Suitable for any themes.</li>\n<li>Import or Export facilities.</li>\n<li>Support all types of results systems.</li>\n<li>Strong community support.</li>\n<li>Always up to date.</li>\n</ul>\n<p>Please share your requirements, experience (feedback) while using Educare. For more details, please visit the <a href=\"https://youtube.com/@FixBD-LLC\" rel=\"nofollow ugc\">Educare on YouTube</a>.</p>\n<h3>Why Users Like Educare?</h3>\n<ol>\n<li>Useful features.</li>\n<li>Suitable for any themes.</li>\n<li>Easy to use (Everything is simple).</li>\n<li>Support all types of devices (Responsive UI).</li>\n<li>Powerful student and results management facilities.</li>\n<li>The best results management plugin for WordPress users.</li>\n<li>Features are added based on user feedback.</li>\n<li>Always up to date.</li>\n</ol>\n<p><strong>Like this plugin?</strong></p>\n<ul>\n<li>We&#8217;re glad to say that we have given lots of features for free, which is useful for many users.</li>\n<li>Educare is a massive project, and a major update can take weeks or months of work, requiring time and money to maintain.</li>\n<li>Please consider helping:\n<ul>\n<li><a href=\"https://wordpress.org/support/plugin/educare/reviews/?filter=5#new-post\" rel=\"ugc\">Rating Educare</a>: Your ratings inspire us to discover more features!</li>\n<li>Send Coffee or Purchase Educare Premium.</li>\n<li>Become a Partner.</li>\n</ul>\n</li>\n</ul>\n<h3>Feedback and Support</h3>\n<p>Features are added based on user feedback because Educare is built for the users. If it doesn&#8217;t work for the people it&#8217;s made for, it&#8217;s useless. Educare authorities value user feedback. You can share your feedback <a href=\"https://wordpress.org/support/plugin/educare/reviews\" rel=\"ugc\">here</a>.</p>\n<p>If you face any problems, please discuss them in our <a href=\"https://wordpress.org/support/plugin/educare/\" rel=\"ugc\">support forum</a>. If there is no solution and you need our support (Totally Free!), contact us through email or WhatsApp using the details given below. Our support team is always happy to assist.</p>\n<h3>Professional Support</h3>\n<p>We can do anything based on your requirements. So, if you need help or professional plugin support from us, please contact with us by:</p>\n<ul>\n<li>WhatsApp Number: <a href=\"tel:+8801303727214\" rel=\"nofollow ugc\">+8801303727214</a></li>\n<li>Email: <a href=\"mailto:&#x66;&#105;&#x78;&#x62;&#100;&#046;&#x6f;&#114;&#103;&#x40;&#x67;&#109;&#x61;&#x69;&#108;&#046;&#x63;&#111;&#109;\" rel=\"nofollow ugc\">fixbd.org@gmail.com</a></li>\n</ul>\n",
        "installation": "<h3>INSTALL EDUCARE FROM WITHIN WORDPRESS</h3>\n<ol>\n<li>Visit the plugins page within your dashboard and select ‘Add New’.</li>\n<li>Search for ‘Educare’,</li>\n<li>Activate Educare from your Plugins page,</li>\n<li>Go to ‘After Activation’ below.</li>\n</ol>\n<h3>INSTALL EDUCARE MANUALLY</h3>\n<ol>\n<li>Download <code>Educare</code> from the <a href=\"https://wordpress.org/plugins/educare/\" rel=\"ugc\">WordPress</a> plugin directory.</li>\n<li>In your WordPress administration panel, go to <strong>Plugins &gt; Add New</strong> and click the <strong>Upload Plugin</strong> button at the top of the page. (For manual installation, upload Educare to the <code>/wp-content/plugins/</code> directory.)</li>\n<li>Activate the plugin (Educare) through the <strong>Plugins</strong> menu in WordPress.</li>\n<li>Go to ‘After Activation’ below.</li>\n</ol>\n<h3>AFTER ACTIVATION</h3>\n<ol>\n<li>Now, you can see the Educare icon appears in the menu bar.</li>\n<li>Go to <strong>Educare &gt; Settings</strong> to configure the plugin.</li>\n<li>Go to <strong>Educare &gt; Management</strong> to configure Class, Group, Subject, Rating Scale, Exam, Year, and Extra Fields.</li>\n<li><strong>One more step:</strong> You need to add Educare shortcode in WP post editor, templates, or any shortcode-ready area to display the front-end results system.</li>\n<li>You’re done!</li>\n</ol>\n",
        "faq": "\n<dt id='why%20was%20this%20plugin%20created%3F'>\nWhy was this plugin created?\n</h4>\n<p>\n<p>Currently, there are no alternative way to manage students and publish results in WordPress by default.<br />\nI wasn&#8217;t satisfied with some educational plugins available in WP plugins directory. Yes, some of them are good, but nothing fit what I had in mind perfectly. And all of this requred a lot of money to use there premium features.</p>\n<p>So, I just built something that I actually enjoyed and used lots of powerful features without any charge!.</p>\n</p>\n<dt id='does%20it%20work%20with%20any%20wordpress%20theme%3F'>\nDoes it work with any WordPress theme?\n</h4>\n<p>\n<p>Yes, Educare will work with any standard WordPress theme.</p>\n</p>\n<dt id='how%20to%20show%20result%20on%20%28front%20end%29%20page%3F'>\nHow to show result on (Front End) page?\n</h4>\n<p>\n<p>[educare_results]</p>\n<p>You need to add <code>[educare_results]</code> shortcode into WP post editor, template or any shortcode-ready area for front end results system. This shortcode display search form and results. So, users/students can easily find and view there results.</p>\n</p>\n<dt id='can%20i%20use%20it%20for%20school%20management%3F'>\nCan I use it for school management?\n</h4>\n<p>\n<p>Yes, Educare has exactly the features you want. So, feel free to use Educare on your website.</p>\n</p>\n<dt id='can%20i%20publish%20single%20subject%20results%3F'>\nCan I publish single subject results?\n</h4>\n<p>\n<p>Yes. Educare has a features called &#8216;Add Marks&#8217;. Using these features admin (teacher) can add or publish subject wise multiple student results at a same time. So, it&#8217;s most usefull for (single) teacher and subject.</p>\n</p>\n<dt id='can%20the%20result%20card%20be%20custom%20designed%3F'>\nCan the result card be custom designed?\n</h4>\n<p>\n<p>Yes, In Educare v1.2.2+ you (admin) can customize results card, search results forms. Everything on the front end is customizable. Please <a href=\"https://github.com/FixBD/Educare/wiki/Customize-Educare\" rel=\"nofollow ugc\">Follow this topics</a>.</p>\n</p>\n<dt id='how%20do%20i%20use%20it%3F'>\nHow do I use it?\n</h4>\n<p>\n<p>Most things of Educare fairly straight-forward, but we&#8217;ve included an in-depth guide in the plugin download.  It&#8217;s a file called <code>readme.md</code> in the plugin folder.</p>\n<p>You can also <a href=\"https://github.com/FixBD/Educare/blob/FixBD/README.md\" rel=\"nofollow ugc\">view the readme</a> online.</p>\n</p>\n<dt id='is%20there%20youtube%20video%20tutorial%3F'>\nIs there YouTube video tutorial?\n</h4>\n<p>\n<p>Yes, you can find some video tutorial on your official YouTube channel (<a href=\"https://youtube.com/@FixBD-LLC\" rel=\"nofollow ugc\">FixBD</a>). However, more video tutorials will be added very soon.</p>\n<p>But there is nothing to despair about. Because, Educare has a feature called (Smart Guidelines). In this feature, the necessary details of each topic and what to do, how it works, how to use it all have been discussed. So, through this feature you will learn to use Educare easily.</p>\n</p>\n<dt id='is%20there%20any%20dashboard%20for%20super%20admins%2C%20admins%2C%20teachers%2C%20or%20students%3F'>\nIs there any dashboard for super admins, admins, teachers, or students?\n</h4>\n<p>\n<p>Yes, this feature is supported in the Educare premium package.</p>\n</p>\n<dt id='how%20to%20get%20premium%20version%3F'>\nHow to get premium version?\n</h4>\n<p>\n<p>Please contact with email or WhatsApp number given bellow:<br />\nWebsite: <a href=\"https://fixbd.net\" rel=\"nofollow ugc\">FixBD</a><br />\nWhatsApp: +8801303737314<br />\nEmail: fixbd.org@gmail.com</p>\n</p>\n\n",
        "changelog": "<p>Here are the highlights of the last four updates:</p>\n<h4>[1.4.9]</h4>\n<ul>\n<li>Sets the WordPress tested up to version to 6.5.2</li>\n</ul>\n<h4>[1.4.8]</h4>\n<ul>\n<li>Sets the WordPress tested up to version to 6.4.2</li>\n<li>Resolved backslash issues when add extra fields with character (&#8216;).</li>\n</ul>\n<h4>[1.4.7]</h4>\n<ul>\n<li>Improved security measures</li>\n<li>Added a new security layer for Admin Ajax</li>\n<li>Fixed well-known errors</li>\n</ul>\n<h4>[1.4.6]</h4>\n<ul>\n<li>Removed unnecessary code and comments.</li>\n<li>Sets the WordPress tested up to version to 6.3.1</li>\n</ul>\n<h4>[1.4.5]</h4>\n<h4>Stable &#8211; Security Release</h4>\n<ul>\n<li>Enhanced security measures.</li>\n<li>It is crucial to update Educare to version 1.4.5 immediately.</li>\n<li>Please see the changelog v1.4.4 for list of previous updates.</li>\n</ul>\n<p><strong>Note:</strong> Sometimes users may need to clear browsing data to load the updated script (After update).</p>\n<p><strong>EARLIER VERSIONS</strong></p>\n<p>The (full) change log is located in the <code>changelog.md</code> file in the plugin folder. You may also <a href=\"https://github.com/FixBD/Educare/blob/FixBD/changelog.md\" rel=\"nofollow ugc\">view the change log</a> for every single update online.</p>\n"
    },
    "short_description": "No. 1 Academic Students &amp; Result Management solutions For WordPress. Educare Help You To Easily Publish And Manage Any Type Of Results At Online.",
    "description": "<p><strong>No. 1 Academic Result Management Plugin For WordPress Users.</strong></p>\n<p>Educare is a online Students &amp; Results management system developed by FixBD. This powerful results management plugin is built to easily manage institute, academy, or student results online. Designed to be universally adaptable, this solution seamlessly integrates with result systems across the world. No matter the format, Educare supports diverse result systems, making it your go-to choice for streamlined and efficient management.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/U29ZoNDBiDU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Educare is free and always will be, but it has a premium version that is even more functional and powerful.</p>\n<p>Please note: This is an old video. We are updating Educare regularly. More features have been added in the updated version. We will upload it soon.</p>\n<h3>Features</h3>\n<p>We are constantly working on discovering new features and (Add-Ons) for templates to make Educare better and smoother. Also, you can build your own template based on your requirements. Let&#8217;s see why Educare is so special &#8211;</p>\n<h3>Custom Add-Ons For Enhanced Functionality (*):</h3>\n<ol>\n<li>Search Form: You can add custom templates and beautify your search Form, simplifying results searches and enhancing user experience.</li>\n<li>Result Card: Explore our robust results system! Result card Add-Ons help you adjust Educare with your result system easily.</li>\n<li>Certificate Template: Customize Educare to match your requirements for online certificate provision and improve the certification process.</li>\n<li>Also, Educare supports custom Import System Add-Ons. You can build custom import systems to adjust Educare to your results system.</li>\n</ol>\n<p>So as you can see &#8211; You have complete control over your system. Now we will discuss some more important features of it. Let&#8217;s explore!</p>\n<h3>Key Features:</h3>\n<p><strong>Powerful Results Management &#8211;</strong></p>\n<ul>\n<li>Manage unlimited results, students, or teacher records.</li>\n<li>Auto/manual results calculations.</li>\n<li>Certificate adding facility (with auto generated based on results) (*).</li>\n<li>Custom Add-Ons for Results Card, Certificate, Search Form, or Import system (*).</li>\n<li>Password or PIN-based results access (*).</li>\n</ul>\n<p><strong>Flexible Class and Subject Management &#8211;</strong></p>\n<ul>\n<li>Manage unlimited Class, Group, Subject Rating scale, Exam, Year and Extra fields.</li>\n<li>Class/group-wise subject management.</li>\n<li>Individually marks added facilities (*).</li>\n<li>Multi-student and multi-subject marks added facilities (*).</li>\n</ul>\n<p><strong>Comprehensive User Roles (*)</strong></p>\n<ul>\n<li>Three roles: Admin, Teacher, and Student.</li>\n<li>Detailed student profiles and dashboards.</li>\n<li>Teachers profile and dashboard.</li>\n<li>Support for importing students and results via .csv files.</li>\n<li>Support for importing students, teachers, and results via Excel files with the extensions (.xlsx, .xlsm or .xls).</li>\n</ul>\n<p><strong>Robust Grading and Reporting &#8211;</strong></p>\n<ul>\n<li>Auto calculate and display various result metrics.</li>\n<li>Auto grading system with customizable rules.</li>\n<li>Rich result card and report customization options.</li>\n</ul>\n<p><strong>Professional Certificate System (*)</strong></p>\n<ul>\n<li>Customizable certificate templates.</li>\n<li>Automatically generate certificates based on results.</li>\n<li>Support for embed variables for custom certificate content.</li>\n<li>Useful shortcode system.</li>\n</ul>\n<p><strong>Manage any type of result with &#8211;</strong></p>\n<ul>\n<li>Powerful Settings and Dashboard.</li>\n<li>Everything is Ajax compatibility (Back-End and Front-End).</li>\n<li>It&#8217;s as simple as it looks, just as powerful also useful!.</li>\n</ul>\n<p>After reading this feature list, you can probably imagine Educare is the best plugin in the market. So, do you want to unlock the advanced features? <a href=\"https://fixbd.net/educare\" rel=\"nofollow ugc\">Upgrade to our Pro version</a>.</p>\n<ul>\n<li><a href=\"https://educare.fixbd.net/results\" rel=\"nofollow ugc\">Check the Demos</a></li>\n</ul>\n<h3>Explain With More Details</h3>\n<p>Educare helps you easily control over your institute students and results online. You can easily Add/Edit/Delete Teachers, Students, Results, Class, Group, Rating Scale, Exam, Year, Extra Field, Custom Result Rules, Auto result calculations and much more&#8230; Also, you can add student attendance, single or multiple student marks (with single or multiple subjects), promote students, import unlimited students, teacher, or results just one click! Now I will explain more about these features &#8211;</p>\n<h4>Admin Can &#8211;</h4>\n<ul>\n<li>Admin can access Educare all menu or settings.</li>\n<li>Add or manage students, teachers, and results.</li>\n<li>Add/Update/Delete Class, Subject, Group, Exam, Rating Scale, Year, Extra (Custom) Field.</li>\n<li>Customize result rules (grading systems) based on country or requirements.</li>\n<li>Admin can add class or subject-wise multiple student results at the same time.</li>\n<li>Import unlimited students, teachers, and results.</li>\n<li>Filter and view all teachers, students, results (Like &#8211; class, exam, year, group, subject with Asc/Desc mode and more&#8230;).</li>\n<li>Modify default students&#8217; photos.</li>\n<li>Also, you can find many features while using it.</li>\n</ul>\n<h4>Teachers (*) &#8211;</h4>\n<ul>\n<li>Teachers can add marks (based on subject or class).</li>\n<li>Fill attendance.</li>\n<li>Promote students.</li>\n</ul>\n<h4>Students or Parents &#8211;</h4>\n<ul>\n<li>Students or Parents can find results or certificates by name, registration number, roll number, exam, passing year (based on Educare settings).</li>\n<li>Students can log in to their profiles (*).</li>\n<li>View attendance (*).</li>\n<li>View results.</li>\n<li>Get Certificate (*).</li>\n<li>Print or save results and certificates.</li>\n</ul>\n<h4>Certificate System (*) &#8211;</h4>\n<ul>\n<li>Educare Certificate Template, designed for easy customization and a professional finish.</li>\n<li>Everything is customizable.</li>\n<li>Automatically generated certificate based on results.</li>\n<li>Support embed variables. So, you can easily customize certificate content.</li>\n<li>Custom background for the certificate.</li>\n<li>Supports Add-Ons for the certificate system.</li>\n</ul>\n<h4>Results System &#8211;</h4>\n<ul>\n<li>You can add additional marks terms (e.g., Practical Marks, Exam Marks, CA1, CA2&#8230; and more) (*).</li>\n<li>Auto combine marks (like: ca1 + ca2 + ca1 = combined marks).</li>\n<li>Auto position in subject.</li>\n<li>Auto subject-wise class average.</li>\n<li>Auto highest and lowest in class.</li>\n<li>Auto position in class (every single student).</li>\n<li>Auto Grading system (Letter grade or number points).</li>\n<li>Password or PIN-based results access (*).</li>\n</ul>\n<p>Note: Everything is customizable like &#8211; anable or disable specific terms/fields , auto or manual data input&#8230;</p>\n<h4>Result Card &#8211;</h4>\n<ul>\n<li>Everything is customizable.</li>\n<li>Support custom Add-Ons for the results system.</li>\n</ul>\n<h4>Rating system (*) &#8211;</h4>\n<p>You can add unlimited ratings groups or terms. Example:</p>\n<p>Effective Development<br />\n1. Activeness<br />\n2. Attendance<br />\n3. Punctuality</p>\n<p>Psychomotor Skills<br />\n1. Handwriting<br />\n2. Fluency<br />\n3. And more&#8230;</p>\n<h4>Others &#8211;</h4>\n<ul>\n<li>Auto number of subjects.</li>\n<li>Auto calculate and show total marks obtainable.</li>\n<li>Auto calculate and show marks obtained.</li>\n<li>Auto calculate marks average.</li>\n<li>Auto position in class (e.g., 1 out of 50).</li>\n<li>Auto passed/failed status.</li>\n</ul>\n<h4>Remarks (*) &#8211;</h4>\n<ul>\n<li>Teachers&#8217;, principal&#8217;s remarks.</li>\n<li>Names of commenters.</li>\n<li>Date or signature.</li>\n</ul>\n<h4>Print &#8211;</h4>\n<ul>\n<li>Print with actual data, nothing to miss.</li>\n<li>Students&#8217; details, rating scale, remarks section, signature, date, and more.</li>\n<li>Support for all (format) paper sizes (A4, A3, Letter, Legal&#8230;).</li>\n</ul>\n<p>Overall Educare is a completely full-featured result management system. Another thing, we are working on making Educare fully usable as an institute or academy management system a part of that, we are already added some extra features like:</p>\n<h3>Additional features</h3>\n<ul>\n<li>Attendance system (*)</li>\n<li>Users roles and capabilities (*)</li>\n<li>Profiles or Dashboard for students and teachers (*)</li>\n</ul>\n<p><strong>Note:</strong> Only Pro users can use the features marked with (*). If you&#8217;re not a Pro user, those features are off-limits to you.</p>\n<p>The premium version of Educare comes with more powerful, user-friendly and useful functionality. Most Important thing is that, now it&#8217;s possible to manage any type of result system in the world using Educare! Let&#8217;s see how it&#8217;s possible &rarr;</p>\n<h3>Student Management</h3>\n<p>Admin can add single and import unlimited students via Exel file. Once, student details are added then no need to fill student details again while adding or publishing any results. Also, Student can login and access their data. Exp: View results, See attendance, Get notice, Explore old (class) data and much more.</p>\n<h3>Results Management</h3>\n<p>Educare provide powerful results management functionality. Admin can publish single and import unlimited results via .csv (Excel) files. Educare help to process and automatically calculate the results. When the result is published, the student can view result by roll number, registration number, class, examination or year. Also, student can save or print the results.</p>\n<h3>Educare Marksheet Systems</h3>\n<p>Using this features admin (teacher) can add subject or class wise multiple student results at a same time. So, it&#8217;s most useful for (single) teacher. There are different teachers for each subject. Teachers can add marks for their specific subject using this feature. After, the mark addition is done for all the subjects, students can view and print their results when admin publish it as results. Also, teacher can print all student marks as a marksheet. (We call it &#8211; THE GOLDEN FEATURES FOR TEACHER!).</p>\n<h3>Performance or Promote Students</h3>\n<p>Admin or authorized person can conditionally promote or change class, year, group of multiple students with just one click! Most useful when students need to be promoted (from one class to another class) or when multiple students need to be updated. Also, educare help you to apply conditions when promote the students.</p>\n<h3>Grading Systems</h3>\n<p>Using this feature you (admin or authorized person) can add, modify, manage or automatically calculate any type of result GPA or CGPA based on requirements. E.g. India, Bangladesh, Nigeria or US result GPA (CGPA) and calculation methods/rules are different. So, maintaining a defined result using one rule is a bit tricky. The result rule feature solves this problem. If you manage results for Indian students, you can add Indian grading system or rules. Also, you can add Bangladesh, Nigeria or US grading system in the same way. Also, Educare support custom add-ons for results system to adjust your results format.</p>\n<h3>Office Management</h3>\n<p>Admin can add class or group wise subject, ratings scale, exam, session/year, extra (custom) fields and more.</p>\n<h3>Strong Security</h3>\n<p>Educare come with powerful and strong security system. Apart from that, Educare support Google Re-Captcha security system. By using these features Educare keep your system safe and secure.</p>\n<ul>\n<li>If you discover any security-related issues, please let us know. We will take immediate action.</li>\n</ul>\n<h3>Protected Result</h3>\n<p>When it comes to password or PIN-based authentication systems, the primary goal is to ensure that only specific users with the correct PIN or password can access specific results. By implementing this process, Educare helps protect result information and prevent unauthorized access. Moreover, this feature enables authorities to restrict access for specific or multiple students, such as in cases of non-payment or similar issues, ensuring effective control over students and security.</p>\n<h3>Users Roles and Permission &#8211;</h3>\n<p>Educare User Roles and Permissions allows the administrator to grant users appropriate access to various functionalities, based on their roles and capabilities.</p>\n<h3>User&#8217;s Profile and Dashboard</h3>\n<p>Educare provides custom user dashboards for students, parents and teachers. Also, there is a dashboard for admin! Students and teachers can access data by login their profiles. Here students can view attendance, results, performance, account balance, routine, notices, upcoming events and more. Also, teachers can add marks or attendance.</p>\n<h3>Attendance System &#8211;</h3>\n<p>The teacher or authorized person can fill in attendance based on class or subject. Once the attendance is completed, Parents can view this attendance status from specific student profile dashboard.</p>\n<h3>Individually marks added facilities &#8211;</h3>\n<p>With educare premium version, it&#8217;s possible to add single or multiple students marks at a same time. So, you don&#8217;t need to compose results using excel and import it. you can do this process directly using Educare. Also, only authorized teacher can add marks based on subject, class and roles.</p>\n<h3>Template Management &#8211;</h3>\n<p>You can customize result card or search form, results card or certificate and easily switch one template to others. Also, you can build, add or install your custom template. We are constantly working on discovering new template to make Educare better and smoother. You can check template list on our official website.</p>\n<h3>Everything Is Auto Calculated &#8211;</h3>\n<p>Powerful results management system with auto calculation facilities, ratings system and more. For example, Educare help to auto calculate class average, position in class, highest and lowest in class, GPA, letter grade. We have explained this bellow also in a video. The link is given in the description box, you can watch this video for more details about this.</p>\n<p>Educare is a 100% mobile responsive, So educare will always look great on all devices (mobile, tablet, laptop, and desktop). And everything is Ajax compatibility (Back-End and Front-End).</p>\n<p>Just install and manage your institute, school, college, coaching center &amp; personal website with powerful features of Educare. Remember, You can manage any type of results system using Educare.</p>\n<h3>Shortcodes</h3>\n<p>Copy and paste these shortcodes in your editor, template, or any shortcode-ready area to display the front-end results system:</p>\n<ul>\n<li><code>[educare_results]</code>: Display results system.</li>\n<li><code>[educare_results certificate=\"true\" results=\"false\"]</code>: Display certificate system (*).</li>\n<li><code>[educare_results certificate=\"true\"]</code>: Display both (Results and Certificate) system (*).</li>\n<li><code>[educare_user_profiles]</code>: Show user profiles and dashboards (*).</li>\n<li><code>[educare_attendance]</code>: Display attendance status (*).</li>\n</ul>\n<p>More detailed instructions are included in the plugin&#8217;s <code>README.md</code> files.</p>\n<h3>Why You Should Choose Educare?</h3>\n<ul>\n<li>Powerful functionality that we need to manage students or results.</li>\n<li>Everything is Ajax compatibility (Back-End and Front-End).</li>\n<li>Everything is customizable.</li>\n<li>Custom add-ons facilities.</li>\n<li>Suitable for any themes.</li>\n<li>Import or Export facilities.</li>\n<li>Support all types of results systems.</li>\n<li>Strong community support.</li>\n<li>Always up to date.</li>\n</ul>\n<p>Please share your requirements, experience (feedback) while using Educare. For more details, please visit the <a href=\"https://youtube.com/@FixBD-LLC\" rel=\"nofollow ugc\">Educare on YouTube</a>.</p>\n<h3>Why Users Like Educare?</h3>\n<ol>\n<li>Useful features.</li>\n<li>Suitable for any themes.</li>\n<li>Easy to use (Everything is simple).</li>\n<li>Support all types of devices (Responsive UI).</li>\n<li>Powerful student and results management facilities.</li>\n<li>The best results management plugin for WordPress users.</li>\n<li>Features are added based on user feedback.</li>\n<li>Always up to date.</li>\n</ol>\n<p><strong>Like this plugin?</strong></p>\n<ul>\n<li>We&#8217;re glad to say that we have given lots of features for free, which is useful for many users.</li>\n<li>Educare is a massive project, and a major update can take weeks or months of work, requiring time and money to maintain.</li>\n<li>Please consider helping:\n<ul>\n<li><a href=\"https://wordpress.org/support/plugin/educare/reviews/?filter=5#new-post\" rel=\"ugc\">Rating Educare</a>: Your ratings inspire us to discover more features!</li>\n<li>Send Coffee or Purchase Educare Premium.</li>\n<li>Become a Partner.</li>\n</ul>\n</li>\n</ul>\n<h3>Feedback and Support</h3>\n<p>Features are added based on user feedback because Educare is built for the users. If it doesn&#8217;t work for the people it&#8217;s made for, it&#8217;s useless. Educare authorities value user feedback. You can share your feedback <a href=\"https://wordpress.org/support/plugin/educare/reviews\" rel=\"ugc\">here</a>.</p>\n<p>If you face any problems, please discuss them in our <a href=\"https://wordpress.org/support/plugin/educare/\" rel=\"ugc\">support forum</a>. If there is no solution and you need our support (Totally Free!), contact us through email or WhatsApp using the details given below. Our support team is always happy to assist.</p>\n<h3>Professional Support</h3>\n<p>We can do anything based on your requirements. So, if you need help or professional plugin support from us, please contact with us by:</p>\n<ul>\n<li>WhatsApp Number: <a href=\"tel:+8801303727214\" rel=\"nofollow ugc\">+8801303727214</a></li>\n<li>Email: <a href=\"mailto:&#x66;&#105;&#x78;&#x62;&#100;&#046;&#x6f;&#114;&#103;&#x40;&#x67;&#109;&#x61;&#x69;&#108;&#046;&#x63;&#111;&#109;\" rel=\"nofollow ugc\">fixbd.org@gmail.com</a></li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/educare.1.4.9.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/educare/assets/screenshot-1.png?rev=2924070",
            "caption": "Front-End Search Form"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-2.png?rev=2924070",
            "caption": "Results Table (Details)"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-3.png?rev=2924070",
            "caption": "Results Table (Grade sheet)"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-4.png?rev=2924070",
            "caption": "Print Or Save Results"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-5.png?rev=2924070",
            "caption": "Student Profiles"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-6.png?rev=2924070",
            "caption": "Students List"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-7.png?rev=2924070",
            "caption": "Add Results"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-8.png?rev=2924070",
            "caption": "Update Results"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-9.png?rev=2924070",
            "caption": "Import Results"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-10.png?rev=2924070",
            "caption": "Students Attendance"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-11.png?rev=2924070",
            "caption": "Add Marks (Multiple Subject)"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-12.png?rev=2924070",
            "caption": "Add Marks (Single Subject)"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-13.png?rev=2924070",
            "caption": "Promote Students"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-14.png?rev=2924070",
            "caption": "Class Management"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-15.png?rev=2924070",
            "caption": "Ratting Scale Terms"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-16.png?rev=2924066",
            "caption": "Educare Settings"
        },
        {
            "src": "https://ps.w.org/educare/assets/screenshot-17.png?rev=2924066",
            "caption": "Customize Grading System"
        }
    ],
    "tags": {
        "academic": "academic",
        "education": "education",
        "result-management": "result management",
        "results": "results",
        "students": "students"
    },
    "stable_tag": "1.4.9",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/educare.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/educare.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/educare.1.0.2.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/educare.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/educare.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/educare.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/educare.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/educare.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/educare.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/educare.1.2.6.zip",
        "1.2.7": "https://downloads.wordpress.org/plugin/educare.1.2.7.zip",
        "1.2.8": "https://downloads.wordpress.org/plugin/educare.1.2.8.zip",
        "1.2.9": "https://downloads.wordpress.org/plugin/educare.1.2.9.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/educare.1.3.0.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/educare.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/educare.1.4.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/educare.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/educare.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/educare.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/educare.1.4.5.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/educare.1.4.6.zip",
        "1.4.7": "https://downloads.wordpress.org/plugin/educare.1.4.7.zip",
        "1.4.8": "https://downloads.wordpress.org/plugin/educare.1.4.8.zip",
        "1.4.9": "https://downloads.wordpress.org/plugin/educare.1.4.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/educare.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/educare/assets/banner-772×250.png?rev=2619025",
        "high": "https://ps.w.org/educare/assets/banner-1544×500.png?rev=2618721"
    },
    "icons": {
        "1x": "https://ps.w.org/educare/assets/icon-128x128.png?rev=2618721",
        "2x": "https://ps.w.org/educare/assets/icon-256×256.png?rev=2618721"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 92,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}