{
    "name": "EncycloShare",
    "slug": "encycloshare",
    "version": "1.0",
    "author": "Knowledge Standards Foundation",
    "author_profile": "https://profiles.wordpress.org/ksfound/",
    "contributors": {
        "encyclosphere": {
            "profile": "https://profiles.wordpress.org/encyclosphere/",
            "avatar": "https://secure.gravatar.com/avatar/ef3f5f6c4b85d2a555b84534ef63f3a3?s=96&d=monsterid&r=g",
            "display_name": "encyclosphere"
        },
        "psqr": {
            "profile": "https://profiles.wordpress.org/psqr/",
            "avatar": "https://secure.gravatar.com/avatar/c0c3d52f7e4a075f558377a6c7447f8d?s=96&d=monsterid&r=g",
            "display_name": "psqr"
        }
    },
    "requires": "5.4",
    "tested": "6.2.6",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/encycloshare/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 0,
    "downloaded": 290,
    "last_updated": "2023-10-25 4:25pm GMT",
    "added": "2023-10-25",
    "homepage": "https://encyclosphere.org/",
    "sections": {
        "installation": "<p>You <strong>must</strong> complete two steps in order to use this plugin.</p>\n",
        "description": "<p>Write encyclopedia articles for the world from your blog! Plugin makes adding your articles to encyclosphere aggregators as easy as pressing a button.</p>\n<h3>Step One: Set up your blog&#8217;s digital identity.</h3>\n<p>First, simply install <a href=\"https://wordpress.org/plugins/virtual-public-square/\" rel=\"ugc\">the Virtual Public Square plugin</a>, as you would any WordPress plugin.</p>\n<p>Next, set up the did:psqr identity keys from the users list display. You have two options on how to generate your DID: EITHER (a) let the plugin create keys for you automatically (this is easy) OR (b) create them yourself offline and upload them to your blog (this is harder).</p>\n<p>Again, EITHER (a) <strong>Use the plugin:</strong> go to your Users list, and search for the account(s) you would like to create DIDs for. Admins will see buttons to allow generation, upload, or delete signature files for each user. Creating a DID for a user is simply a matter of pressing &#8220;Generate&#8221; and then filling out the form:</p>\n<p>OR (b) <strong>Use the command line tool:</strong> first, <a href=\"https://public-square.github.io/cli/\" rel=\"nofollow ugc\">follow the directions</a> to create a specialized did:psqr identity; then again navigate to the Users list and press &#8220;Upload&#8221; to upload the file.</p>\n</p>\n<p><strong>Note:</strong> the only difference between option (a) and (b) is that the code that creates your DID runs either on your blog server or by you, somewhere else. The same sorts of DID files will end up in the same place, on your blog.)</p>\n<h3>Step Two: Configure the EncycloShare plugin.</h3>\n<p>After installing the EncycloShare plugin (this one), you must configure your options at Settings &gt; EncycloShare. There are inline instructions there. Pay close attention to <strong>all</strong> sections. They are all important (especially the password and the license!).</p>\n<p><strong>Important note:</strong> at present, you will have to get in touch with an aggregator in order to obtain a password and to verify a publisher code.</p>\n</p>\n<h3>Important</h3>\n<p>The 100% free (OSS) EncycloShare plugin adds the encyclopedic articles on your blog to the Encyclosphere. This means submitting your articles to various aggregators, so that your article(s) will (if accepted) appear on <a href=\"https://encyclosearch.org/\" rel=\"nofollow ugc\">EncycloSearch</a>, <a href=\"https://encycloreader.org/\" rel=\"nofollow ugc\">EncycloReader</a>, <a href=\"https://encyclopedia.dara.global/#\" rel=\"nofollow ugc\">DARA</a>, the <a href=\"https://chrome.google.com/webstore/detail/encyclosphere/olhghbhocpjleboiiigeljhimfilkfnn\" rel=\"nofollow ugc\">Encyclosphere Chrome plugin</a>, and soon others. This is a rapidly growing open, shared, and censorship-resistant database of publicly-available encyclopedia articles, and guarantees that your article will live on long after you are gone.</p>\n<p>Contribute to the global encyclopedia network, while retaining total control and licensing over your work, and bypassing Wikipedia.</p>\n<p><strong>Important:</strong> this plugin will not work without setup. Follow the instructions in the <strong>Installation</strong> section.</p>\n<p>The plugin provides three pages/widgets:<br />\n1. a &#8220;Publish to Encyclosphere&#8221; button with per-article settings, located at <strong>the bottom</strong> of each blog post and page;<br />\n2. a Settings page, with global settings; and<br />\n3. a Dashboard panel, listing of all encyclopedia posts (ZWI files) that you submit.</p>\n<p>The plugin (and its required digital identity plugin) does the following for you, <em>after the required setup</em>:<br />\n1. allows you to submit articles to Encyclosphere aggregators (see above), including all your text, images, and probably other data as well, preserving your basic formatting;<br />\n2. for each submitted article, creates a ZWI file (&#8220;zipped wiki&#8221;: the standard encyclopedia article file format), deposited in a directory that you can make public if you like <em><strong>DOUBLECHECK THIS</strong></em>;<br />\n3. creates a digital identity associated with your blog (which you can use for many purposes), which follows the <em>entirely self-owned</em> digital identity standard did:psqr (see below);<br />\n4. digitally signs your article, using your did:psqr digital identity;<br />\n5. allows you to configure basic data about your encyclopedia collection (such as license and language); and<br />\n6. allows you to tag your submitted ZWI files with categories, by tying in with the WordPress category system.</p>\n<p>NOTE: this <strong>requires</strong> the <a href=\"https://wordpress.org/plugins/virtual-public-square/\" rel=\"ugc\">Virtual Public Square (VPS) plugin</a>. <strong>Install the 100% free-and-OSS VPS plugin before attempting to use EncycloShare!</strong></p>\n<h3>DISCLAIMERS</h3>\n<p><strong><em>You</em> are the sole determiner of what license you publish under.</strong></p>\n<blockquote>\n<p>While there is a default Creative Commons license selected, you <em>do not</em> have to use that license. There is a long list of licenses for you to choose a license from. <em>If you do not want to permit any other websites to make use of your content, then do not use this plugin!</em></p>\n</blockquote>\n<p><strong>Aggregation of your article is <em>not</em> guaranteed.</strong></p>\n<blockquote>\n<p>Using this plugin does not guarantee your article will appear in any aggregator. Neither the plugin nor the Knowledge Standards Foundation (KSF) determines whether your content will be accepted for inclusion in any particular aggregator. The programmers that run the two KSF-affiliated aggregators, EncycloReader and EncycloSearch, make these determinations independently of the KSF Board. Other aggregators in the broader Encyclosphere network are entirely legally independent and separate, and make their own decisions.</p>\n</blockquote>\n<p><strong>Depending on your license, your article might be published in places you did not know about or explicitly agree to.</strong></p>\n<blockquote>\n<p>If you do not understand this, do not use this plugin. <em>Anyone</em> might set up an aggregator and, depending on your license, they might legally republish your content. It is <em>your decision</em> to permit them to do so. But open content projects like Wikipedia and MIT OpenCourseWare have wisely decided to make their content very widely available. The KSF commends this practice and hopes you decide to follow it.</p>\n</blockquote>\n<p><strong>Article publishing is <em>not</em> tracked (at present).</strong></p>\n<blockquote>\n<p>The plugin does not display information about whether your publishing has been accepted. You must click through yourself in order to make that determination.</p>\n</blockquote>\n<p><strong>Articles can <em>not</em> be removed/unpublished with this plugin.</strong></p>\n<blockquote>\n<p>There is no &#8220;unpublish&#8221; feature at present (we cannot say whether there ever will be one). But two notes on this. (1) You can contact individual aggregators and request that they remove your post. Whether they are legally obligated to do so depends on the license you have chosen; most permissions granted by open content licenses are permanent and irrevocable. (2) You can try replacing the text of an article with a blank page and then submit that. It is possible (not guaranteed) that the aggregator you have chosen will interpret this as an intention to remove your article.</p>\n</blockquote>\n<h3>In more detail</h3>\n<p><strong>The standard file format</strong> for encyclopedia articles, the <a href=\"https://docs.encyclosphere.org/#/zwi-format\" rel=\"nofollow ugc\">ZWI file format</a>, has many requirements (specified by the <a href=\"https://encyclosphere.org/\" rel=\"nofollow ugc\">Knowledge Standards Foundation</a>). The EncycloShare plugin makes your posts fit these requirements. The plugin takes your encyclopedia post, uses it to prepare all necessary files (such as images) and directories following the ZWI standard, and finally compresses the result in a single ZWI file. A ZWI file is a a kind of ZIP file, so you can use any ZIP reader to view the contents, if you like.</p>\n<p><strong>The plugin then posts the ZWI file to an aggregator</strong> or aggregators of your choosing, when you instruct it to do so. Depending on your license, the ZWI file might then (eventually) propagate to other aggregators. Each aggregator is responsible for maintaining its own database. Because Encyclosphere aggregators are developing a shared database standard as well, they can easily share articles, including yours. (We cannot guarantee that your work will be accepted by any given aggregator. Developers can set up their own aggregators, by installing the KSF&#8217;s free aggregator engine, <a href=\"https://gitlab.com/ks_found/encycloengine\" rel=\"nofollow ugc\">EncycloEngine</a>.)</p>\n<p><strong>All ZWI files are stored</strong> in a <code>/zwifiles</code> subdirectory of the standard WordPress <code>/uploads</code> directory. So an article might be found, for example, at <code>https://YOURDOMAIN.COM/wp-content/uploads/zwifiles/YOUR-ARTICLE-12345.zwi</code>.</p>\n<p><strong>Publishing</strong>, or submission to the Encyclosphere, happens when you press the &#8220;Publish to Encyclosphere&#8221; button at the bottom of every WordPress post and page. You cannot, at this time, &#8220;unsubmit&#8221; an article, so make sure you really want to submit it. If you want to make edits and resubmit, you can. Probably a good way to <em>delete</em> an article from the encyclosphere would be to simply make your page blank, and then submit the blank page. That is sure to be rejected, and the rejected ZWI will probably overwrite the old article, depending on circumstances.</p>\n<p><strong>The Dashboard Panel</strong> shows any ZWI files that have been created. For now, you will have to follow the links provided in the panel to determine whether your submission has been accepted. You can also follow links to download, edit, and view articles in your collection.</p>\n<h3>About Digital Signatures</h3>\n<p><strong>Your ZWI files are digitally signed</strong> and therefore can be authenticated as yours, wherever they eventually can be found on the internet. These digital signatures follow the <a href=\"https://vpsqr.com/\" rel=\"nofollow ugc\">did:psqr</a> &#8220;Virtual Public Square&#8221; digital identity standard. The KSF chose this standard because it allows you to declare and maintain your own identity on your own domain—so it is robustly self-owned. A digital signature is essential to maintaining your credit and claim to ownership in a wide-open network like the Encyclosphere. Aggregators will cryptographically validate your ZWI submissions (EncycloShare handles this for you automatically); such validation is required for acceptance by these network aggregators. All this is why you must install the (equally 100% free) Virtual Public Square plugin to utilize EncycloShare.</p>\n<p><strong>Your digital identity takes the form of a Decentalized Identifier (DID) file.</strong> DID files contain identifying information you wish to share with the public and public keys used to verify your content. Your DID, when it is created, will be accessible at <code>https://YOURDOMAIN.COM/.well-known/psqr</code>. The Virtual Public Square plugin uses the W3C&#8217;s DID standard, and particularly the <code>did:psqr</code> specification, to attach proof of provenance to your content for distribution; further information on this specification is available at <code>https://vpsqr.com</code>.</p>\n<p><strong>Users are required to generate or upload their keys</strong> before they can publish.<br />\nThe Virtual Public Square plugin automatically creates, uploads, and stores the relevant identity files according to the did:psqr digital identity standards. Instructions on how to do this (it is not hard) can be found under &#8220;Installation.&#8221;</p>\n<h3>Usage</h3>\n<p>Load a post or a page in edit mode. Some settings for the EncycloShare widget can be found below the text of your post. You can change a few values for each article you publish in ZWI format; these features and additions will expand. Any WordPress categories you add to a post or page will be added to the ZWI file format. Push the &#8220;Publish to Encyclosphere&#8221; button to publish your article to your selected aggregators.</p>\n<p>This button is visible for these user classes: editor, admin, author, and contributor. A toggle hidden response returns the results of your submission; these server responses are shown once and not saved.</p>\n<p>Go to https://encycloreader.org or https://encyclosearch.org/ to check whether your articles have been accepted. You can also find relevant links in the Dashboard Panel:</p>\n</p>\n<p>A Dashboard Panel (the Admin Area home page found at <code>/wp-admin/index.php</code>) will list any ZWI files found in the uploads directory.</p>\n<h3>Changelog/Terms</h3>\n<h3>1.0</h3>\n<ul>\n<li>Initial release</li>\n</ul>\n<h3>Support</h3>\n<ul>\n<li><a href=\"https://encyclosphere.org/\" rel=\"nofollow ugc\">Knowledge Standards Foundation</a></li>\n<li><a href=\"https://encycloreader.org/\" rel=\"nofollow ugc\">EncycloReader</a></li>\n<li><a href=\"https://encyclosearch.org/\" rel=\"nofollow ugc\">EncycloSearch</a></li>\n</ul>\n<h3>Terms of Use</h3>\n<p><strong>See DISCLAIMERS under &#8220;Important&#8221; tab. Users understand that their work will be shared over an open network under a license or licenses that they solely determine.</strong></p>\n<p>Open Source Warranty. The Software includes certain Open Source Software. Open Source Software is governed solely by the applicable open source licensing terms, if any, and is provided “AS IS”. Other than as provided in the license, the Knowledge Standards Foundation makes no other warranties, express or implied, and hereby disclaims all implied warranties, including any warranty of merchantability and warranty of fitness for a particular purpose.</p>\n<p>Knowledge Standards Foundation provides no warranty specifically related to any Open Source Software or any applicable Open Source Software licensing terms.</p>\n<p>The foregoing language is not intended to limit Knowledge Standards Foundation’s warranty obligation for the Solution pursuant to Section 12.1. “Open Source Software” means software with its source code made available pursuant to a license by which, at a minimum, the copyright holder provides anyone the rights to study, change, and/or distribute the software to anyone and for any purpose.</p>\n"
    },
    "short_description": "Write encyclopedia articles for the world from your blog! Plugin makes adding your articles to encyclosphere aggregators as easy as pressing a button.",
    "description": "<p>Write encyclopedia articles for the world from your blog! Plugin makes adding your articles to encyclosphere aggregators as easy as pressing a button.</p>\n<h3>Step One: Set up your blog&#8217;s digital identity.</h3>\n<p>First, simply install <a href=\"https://wordpress.org/plugins/virtual-public-square/\" rel=\"ugc\">the Virtual Public Square plugin</a>, as you would any WordPress plugin.</p>\n<p>Next, set up the did:psqr identity keys from the users list display. You have two options on how to generate your DID: EITHER (a) let the plugin create keys for you automatically (this is easy) OR (b) create them yourself offline and upload them to your blog (this is harder).</p>\n<p>Again, EITHER (a) <strong>Use the plugin:</strong> go to your Users list, and search for the account(s) you would like to create DIDs for. Admins will see buttons to allow generation, upload, or delete signature files for each user. Creating a DID for a user is simply a matter of pressing &#8220;Generate&#8221; and then filling out the form:</p>\n<p>OR (b) <strong>Use the command line tool:</strong> first, <a href=\"https://public-square.github.io/cli/\" rel=\"nofollow ugc\">follow the directions</a> to create a specialized did:psqr identity; then again navigate to the Users list and press &#8220;Upload&#8221; to upload the file.</p>\n</p>\n<p><strong>Note:</strong> the only difference between option (a) and (b) is that the code that creates your DID runs either on your blog server or by you, somewhere else. The same sorts of DID files will end up in the same place, on your blog.)</p>\n<h3>Step Two: Configure the EncycloShare plugin.</h3>\n<p>After installing the EncycloShare plugin (this one), you must configure your options at Settings &gt; EncycloShare. There are inline instructions there. Pay close attention to <strong>all</strong> sections. They are all important (especially the password and the license!).</p>\n<p><strong>Important note:</strong> at present, you will have to get in touch with an aggregator in order to obtain a password and to verify a publisher code.</p>\n</p>\n<h3>Important</h3>\n<p>The 100% free (OSS) EncycloShare plugin adds the encyclopedic articles on your blog to the Encyclosphere. This means submitting your articles to various aggregators, so that your article(s) will (if accepted) appear on <a href=\"https://encyclosearch.org/\" rel=\"nofollow ugc\">EncycloSearch</a>, <a href=\"https://encycloreader.org/\" rel=\"nofollow ugc\">EncycloReader</a>, <a href=\"https://encyclopedia.dara.global/#\" rel=\"nofollow ugc\">DARA</a>, the <a href=\"https://chrome.google.com/webstore/detail/encyclosphere/olhghbhocpjleboiiigeljhimfilkfnn\" rel=\"nofollow ugc\">Encyclosphere Chrome plugin</a>, and soon others. This is a rapidly growing open, shared, and censorship-resistant database of publicly-available encyclopedia articles, and guarantees that your article will live on long after you are gone.</p>\n<p>Contribute to the global encyclopedia network, while retaining total control and licensing over your work, and bypassing Wikipedia.</p>\n<p><strong>Important:</strong> this plugin will not work without setup. Follow the instructions in the <strong>Installation</strong> section.</p>\n<p>The plugin provides three pages/widgets:<br />\n1. a &#8220;Publish to Encyclosphere&#8221; button with per-article settings, located at <strong>the bottom</strong> of each blog post and page;<br />\n2. a Settings page, with global settings; and<br />\n3. a Dashboard panel, listing of all encyclopedia posts (ZWI files) that you submit.</p>\n<p>The plugin (and its required digital identity plugin) does the following for you, <em>after the required setup</em>:<br />\n1. allows you to submit articles to Encyclosphere aggregators (see above), including all your text, images, and probably other data as well, preserving your basic formatting;<br />\n2. for each submitted article, creates a ZWI file (&#8220;zipped wiki&#8221;: the standard encyclopedia article file format), deposited in a directory that you can make public if you like <em><strong>DOUBLECHECK THIS</strong></em>;<br />\n3. creates a digital identity associated with your blog (which you can use for many purposes), which follows the <em>entirely self-owned</em> digital identity standard did:psqr (see below);<br />\n4. digitally signs your article, using your did:psqr digital identity;<br />\n5. allows you to configure basic data about your encyclopedia collection (such as license and language); and<br />\n6. allows you to tag your submitted ZWI files with categories, by tying in with the WordPress category system.</p>\n<p>NOTE: this <strong>requires</strong> the <a href=\"https://wordpress.org/plugins/virtual-public-square/\" rel=\"ugc\">Virtual Public Square (VPS) plugin</a>. <strong>Install the 100% free-and-OSS VPS plugin before attempting to use EncycloShare!</strong></p>\n<h3>DISCLAIMERS</h3>\n<p><strong><em>You</em> are the sole determiner of what license you publish under.</strong></p>\n<blockquote>\n<p>While there is a default Creative Commons license selected, you <em>do not</em> have to use that license. There is a long list of licenses for you to choose a license from. <em>If you do not want to permit any other websites to make use of your content, then do not use this plugin!</em></p>\n</blockquote>\n<p><strong>Aggregation of your article is <em>not</em> guaranteed.</strong></p>\n<blockquote>\n<p>Using this plugin does not guarantee your article will appear in any aggregator. Neither the plugin nor the Knowledge Standards Foundation (KSF) determines whether your content will be accepted for inclusion in any particular aggregator. The programmers that run the two KSF-affiliated aggregators, EncycloReader and EncycloSearch, make these determinations independently of the KSF Board. Other aggregators in the broader Encyclosphere network are entirely legally independent and separate, and make their own decisions.</p>\n</blockquote>\n<p><strong>Depending on your license, your article might be published in places you did not know about or explicitly agree to.</strong></p>\n<blockquote>\n<p>If you do not understand this, do not use this plugin. <em>Anyone</em> might set up an aggregator and, depending on your license, they might legally republish your content. It is <em>your decision</em> to permit them to do so. But open content projects like Wikipedia and MIT OpenCourseWare have wisely decided to make their content very widely available. The KSF commends this practice and hopes you decide to follow it.</p>\n</blockquote>\n<p><strong>Article publishing is <em>not</em> tracked (at present).</strong></p>\n<blockquote>\n<p>The plugin does not display information about whether your publishing has been accepted. You must click through yourself in order to make that determination.</p>\n</blockquote>\n<p><strong>Articles can <em>not</em> be removed/unpublished with this plugin.</strong></p>\n<blockquote>\n<p>There is no &#8220;unpublish&#8221; feature at present (we cannot say whether there ever will be one). But two notes on this. (1) You can contact individual aggregators and request that they remove your post. Whether they are legally obligated to do so depends on the license you have chosen; most permissions granted by open content licenses are permanent and irrevocable. (2) You can try replacing the text of an article with a blank page and then submit that. It is possible (not guaranteed) that the aggregator you have chosen will interpret this as an intention to remove your article.</p>\n</blockquote>\n<h3>In more detail</h3>\n<p><strong>The standard file format</strong> for encyclopedia articles, the <a href=\"https://docs.encyclosphere.org/#/zwi-format\" rel=\"nofollow ugc\">ZWI file format</a>, has many requirements (specified by the <a href=\"https://encyclosphere.org/\" rel=\"nofollow ugc\">Knowledge Standards Foundation</a>). The EncycloShare plugin makes your posts fit these requirements. The plugin takes your encyclopedia post, uses it to prepare all necessary files (such as images) and directories following the ZWI standard, and finally compresses the result in a single ZWI file. A ZWI file is a a kind of ZIP file, so you can use any ZIP reader to view the contents, if you like.</p>\n<p><strong>The plugin then posts the ZWI file to an aggregator</strong> or aggregators of your choosing, when you instruct it to do so. Depending on your license, the ZWI file might then (eventually) propagate to other aggregators. Each aggregator is responsible for maintaining its own database. Because Encyclosphere aggregators are developing a shared database standard as well, they can easily share articles, including yours. (We cannot guarantee that your work will be accepted by any given aggregator. Developers can set up their own aggregators, by installing the KSF&#8217;s free aggregator engine, <a href=\"https://gitlab.com/ks_found/encycloengine\" rel=\"nofollow ugc\">EncycloEngine</a>.)</p>\n<p><strong>All ZWI files are stored</strong> in a <code>/zwifiles</code> subdirectory of the standard WordPress <code>/uploads</code> directory. So an article might be found, for example, at <code>https://YOURDOMAIN.COM/wp-content/uploads/zwifiles/YOUR-ARTICLE-12345.zwi</code>.</p>\n<p><strong>Publishing</strong>, or submission to the Encyclosphere, happens when you press the &#8220;Publish to Encyclosphere&#8221; button at the bottom of every WordPress post and page. You cannot, at this time, &#8220;unsubmit&#8221; an article, so make sure you really want to submit it. If you want to make edits and resubmit, you can. Probably a good way to <em>delete</em> an article from the encyclosphere would be to simply make your page blank, and then submit the blank page. That is sure to be rejected, and the rejected ZWI will probably overwrite the old article, depending on circumstances.</p>\n<p><strong>The Dashboard Panel</strong> shows any ZWI files that have been created. For now, you will have to follow the links provided in the panel to determine whether your submission has been accepted. You can also follow links to download, edit, and view articles in your collection.</p>\n<h3>About Digital Signatures</h3>\n<p><strong>Your ZWI files are digitally signed</strong> and therefore can be authenticated as yours, wherever they eventually can be found on the internet. These digital signatures follow the <a href=\"https://vpsqr.com/\" rel=\"nofollow ugc\">did:psqr</a> &#8220;Virtual Public Square&#8221; digital identity standard. The KSF chose this standard because it allows you to declare and maintain your own identity on your own domain—so it is robustly self-owned. A digital signature is essential to maintaining your credit and claim to ownership in a wide-open network like the Encyclosphere. Aggregators will cryptographically validate your ZWI submissions (EncycloShare handles this for you automatically); such validation is required for acceptance by these network aggregators. All this is why you must install the (equally 100% free) Virtual Public Square plugin to utilize EncycloShare.</p>\n<p><strong>Your digital identity takes the form of a Decentalized Identifier (DID) file.</strong> DID files contain identifying information you wish to share with the public and public keys used to verify your content. Your DID, when it is created, will be accessible at <code>https://YOURDOMAIN.COM/.well-known/psqr</code>. The Virtual Public Square plugin uses the W3C&#8217;s DID standard, and particularly the <code>did:psqr</code> specification, to attach proof of provenance to your content for distribution; further information on this specification is available at <code>https://vpsqr.com</code>.</p>\n<p><strong>Users are required to generate or upload their keys</strong> before they can publish.<br />\nThe Virtual Public Square plugin automatically creates, uploads, and stores the relevant identity files according to the did:psqr digital identity standards. Instructions on how to do this (it is not hard) can be found under &#8220;Installation.&#8221;</p>\n<h3>Usage</h3>\n<p>Load a post or a page in edit mode. Some settings for the EncycloShare widget can be found below the text of your post. You can change a few values for each article you publish in ZWI format; these features and additions will expand. Any WordPress categories you add to a post or page will be added to the ZWI file format. Push the &#8220;Publish to Encyclosphere&#8221; button to publish your article to your selected aggregators.</p>\n<p>This button is visible for these user classes: editor, admin, author, and contributor. A toggle hidden response returns the results of your submission; these server responses are shown once and not saved.</p>\n<p>Go to https://encycloreader.org or https://encyclosearch.org/ to check whether your articles have been accepted. You can also find relevant links in the Dashboard Panel:</p>\n</p>\n<p>A Dashboard Panel (the Admin Area home page found at <code>/wp-admin/index.php</code>) will list any ZWI files found in the uploads directory.</p>\n<h3>Changelog/Terms</h3>\n<h3>1.0</h3>\n<ul>\n<li>Initial release</li>\n</ul>\n<h3>Support</h3>\n<ul>\n<li><a href=\"https://encyclosphere.org/\" rel=\"nofollow ugc\">Knowledge Standards Foundation</a></li>\n<li><a href=\"https://encycloreader.org/\" rel=\"nofollow ugc\">EncycloReader</a></li>\n<li><a href=\"https://encyclosearch.org/\" rel=\"nofollow ugc\">EncycloSearch</a></li>\n</ul>\n<h3>Terms of Use</h3>\n<p><strong>See DISCLAIMERS under &#8220;Important&#8221; tab. Users understand that their work will be shared over an open network under a license or licenses that they solely determine.</strong></p>\n<p>Open Source Warranty. The Software includes certain Open Source Software. Open Source Software is governed solely by the applicable open source licensing terms, if any, and is provided “AS IS”. Other than as provided in the license, the Knowledge Standards Foundation makes no other warranties, express or implied, and hereby disclaims all implied warranties, including any warranty of merchantability and warranty of fitness for a particular purpose.</p>\n<p>Knowledge Standards Foundation provides no warranty specifically related to any Open Source Software or any applicable Open Source Software licensing terms.</p>\n<p>The foregoing language is not intended to limit Knowledge Standards Foundation’s warranty obligation for the Solution pursuant to Section 12.1. “Open Source Software” means software with its source code made available pursuant to a license by which, at a minimum, the copyright holder provides anyone the rights to study, change, and/or distribute the software to anyone and for any purpose.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/encycloshare.zip",
    "upgrade_notice": {
        "": "<p>Initial Release May 26, 2023, 1.0</p>"
    },
    "screenshots": [],
    "tags": {
        "decentralization": "decentralization",
        "encyclopedia": "encyclopedia",
        "encycloreader": "encycloreader",
        "encyclosphere": "encyclosphere",
        "publishing": "publishing"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://encyclosphere.org/",
    "banners": [],
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/encycloshare.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}