{
    "name": "Enter Addons &#8211; Ultimate Template Builder for Elementor",
    "slug": "enteraddons",
    "version": "2.1.8",
    "author": "<a href=\"https://themelooks.com\">ThemeLooks</a>",
    "author_profile": "https://profiles.wordpress.org/themelooks/",
    "contributors": {
        "themelooks": {
            "profile": "https://profiles.wordpress.org/themelooks/",
            "avatar": "https://secure.gravatar.com/avatar/fe77fb1b3ffc7dc5d76279e88a8389aa?s=96&d=monsterid&r=g",
            "display_name": "themelooks"
        },
        "rahi6039": {
            "profile": "https://profiles.wordpress.org/rahi6039/",
            "avatar": "https://secure.gravatar.com/avatar/31f2f5cf714c299aed4fd1a49c310790?s=96&d=monsterid&r=g",
            "display_name": "Rahi Saiful"
        },
        "faruqahmed190": {
            "profile": "https://profiles.wordpress.org/faruqahmed190/",
            "avatar": "https://secure.gravatar.com/avatar/c1743bceca525577efeae45ec06aceb9?s=96&d=monsterid&r=g",
            "display_name": "Faruq Ahmed"
        },
        "looksweb": {
            "profile": "https://profiles.wordpress.org/looksweb/",
            "avatar": "https://secure.gravatar.com/avatar/1d26c335331fe27465605d25e261a2ab?s=96&d=monsterid&r=g",
            "display_name": "looksweb"
        },
        "linkonomayer": {
            "profile": "https://profiles.wordpress.org/linkonomayer/",
            "avatar": "https://secure.gravatar.com/avatar/11607ed067871e7231c607ce7b2c94b3?s=96&d=monsterid&r=g",
            "display_name": "linkonomayer"
        }
    },
    "requires": "6.5",
    "tested": "6.6.1",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 3,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 3,
    "support_url": "https://wordpress.org/support/plugin/enteraddons/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 20889,
    "last_updated": "2024-08-22 12:21pm GMT",
    "added": "2022-06-25",
    "homepage": "https://themelooks.org/demo/enteraddons",
    "sections": {
        "description": "<p>Take your Elementor page-building experience to the next level with Enteraddons&#8217; 63+ free widgets. Enteraddons will be the ultimate addon for your Elementor Page Builder. The add-on includes 100+ ready blocks, 20+ ready templates, 4+ ready Header/Footer templates, and many more. As a result, you can create any site with ease.</p>\n<p>The modular-based, lightweight, and completely customizable add-on will surely blow your mind. The addons provide you with a quick template import system and a live Elementor Widget library. So, instead of using multiple plugins, get everything under one roof. Enteraddons could be the only solution available to add powers to your page builder.</p>\n<h3>USEFUL LINKS 👇</h3>\n<p><strong><a href=\"https://enteraddons.com/\" rel=\"nofollow ugc\">Live Demo</a></strong> | <strong><a href=\"https://enteraddons.com/documentation/\" rel=\"nofollow ugc\">Documentation</a></strong> | <strong><a href=\"https://www.youtube.com/@EnterAddons/videos\" rel=\"nofollow ugc\">Video Tutorial</a></strong> | <strong><a href=\"https://enteraddons.com/pricing/\" rel=\"nofollow ugc\">Upgrade Pro</a></strong> | <strong><a href=\"https://support.themelooks.com/\" rel=\"nofollow ugc\">Need Support?</a></strong></p>\n<h4>Key Features:</h4>\n<ul>\n<li>63+ Free Advanced Widgets</li>\n<li>100+ Free Ready Sections</li>\n<li>10+ Free Ready Pages Template</li>\n<li>4+ Free Ready Header/Footer Template</li>\n<li>Header &amp; Footer Builder</li>\n<li>WooCommerce Widgets</li>\n<li>Post Widgets</li>\n<li>Ready Template Import</li>\n<li>Section Sticky</li>\n<li>CSS Transform</li>\n<li>Floating Effects</li>\n<li>Column, Widgets Equal Height</li>\n<li>On-demand Asset Loading</li>\n<li>Cross-Browser Compatible</li>\n<li>Lightweight and Fast Loading</li>\n<li>24/7 SUPPORT</li>\n<li>Easy settings options</li>\n<li>Compatibility with WordPress 6+</li>\n<li>Translation ready</li>\n<li>Ready for translation ( .pot files included )</li>\n<li>Free Updates</li>\n<li>Error-free code</li>\n<li>Well Documented</li>\n</ul>\n<h4>63+ FREE ADVANCED WIDGETS:</h4>\n<ul>\n<li><a href=\"https://widgets.enteraddons.com/accordion-widget/\" rel=\"nofollow ugc\"><strong>Accordion</strong></a> It’s time to display your Elementor FAQ with EnterAddons’ Accordion widget. You can display your FAQ text answers in a foldable and precise way. Using this Elementor Accordion addon you can make your web page shorten and concise with all required information. Regardless of pages, posts, or anywhere on your website, you can use this widget with custom color, style, icon, and many more effects.</li>\n<li><a href=\"https://widgets.enteraddons.com/button/\" rel=\"nofollow ugc\"><strong>Button</strong></a> EnterAddons’ Elementor Button Widget allows you to make stunning Elementor buttons with text, color, hover effects, and other effects. You can also use this Elementor button widget to create call-to-action buttons.</li>\n<li><a href=\"https://widgets.enteraddons.com/counter/\" rel=\"nofollow ugc\"><strong>Counter</strong></a> With this animated number counter Elementor addon, your number counter can be customized by selecting your background, icon, and format. There are many different types of counters, such as the animated number counter on WordPress stats, the social media fans counter on Elementor, the product counter style on Elementor addons, and the followers counter style on Elementor addons.</li>\n<li><a href=\"https://widgets.enteraddons.com/call-to-action/\" rel=\"nofollow ugc\"><strong>Call to Action</strong></a>  With this Elementor page builder widget, you can create audience engaging call to action with plenty of styling options including buttons, images, and content features. Plenty of widget presets are available in it. You can make your call-to-action section more attractive than ever before.</li>\n<li><a href=\"https://widgets.enteraddons.com/card-carousel/\" rel=\"nofollow ugc\"><strong>Card Carousel</strong></a> An extremely powerful widget for displaying your goods, blog posts, headlines, and creative posts through a beautiful combination of text messages, links, badges, and images. You can start creating eye-candy styles with a twist by using built-in positioning and offset features. Simply put, creating amazing card items using this Elementor card widget is a breeze.</li>\n<li><a href=\"https://widgets.enteraddons.com/countdown-timer/\" rel=\"nofollow ugc\"><strong>Countdown Timer</strong></a> Using this countdown timer widget of ours, you can apply and enable a countdown timer on your Elementor website. There are lots of styling options, special effects, and formatting available in this Elementor countdown timer addon.</li>\n<li><a href=\"https://widgets.enteraddons.com/contact-form/\" rel=\"nofollow ugc\"><strong>Contact Form 7</strong></a> Creating different types of contact forms is not a tough task anymore. Our Contact Form 7 widget allows you to create this easily. So, you can design your contact form container, fields, and the format you like using this Contact Form 7 addon for Elementor.</li>\n<li><a href=\"https://widgets.enteraddons.com/events-card/\" rel=\"nofollow ugc\"><strong>Events Card</strong></a> Using this Widget on Elementor, you can showcase the ongoing or upcoming events of your site. You can add the location, time, event image, and subscription free on the card using this Widget. It’s up to you which design you would like to go with because there are quite a few available.</li>\n<li><a href=\"https://widgets.enteraddons.com/team/\" rel=\"nofollow ugc\"><strong>Team</strong></a> Showcase your team members including their name, bio, position, social media links, and images using this Team widget of EnterAddons. Use Elementor team member addon to customize all things as you like. This widget offers plenty of customizing options for displaying your team members.</li>\n<li><a href=\"https://widgets.enteraddons.com/feature-card/\" rel=\"nofollow ugc\"><strong>Feature Card</strong></a> Using this widget of EnterAddons, you can showcase your item will all its features, and images, texts in a graphical presentation. There are several designs being added to this widget. You can choose whatever you prefer the most.</li>\n<li><a href=\"https://widgets.enteraddons.com/heading/\" rel=\"nofollow ugc\"><strong>Heading</strong></a> The heading widget allows to create attractive headlines. Not only just the headings, but also heading subtitles, and separate heading descriptions. You can customize these fancy heading styles as you like. This widget has more to offer: Elementor heading title with background color text title, image style, subheading title, and many more.</li>\n<li><a href=\"https://widgets.enteraddons.com/service-card/\" rel=\"nofollow ugc\"><strong>Service Card</strong></a> Make a visual presentation of the services you’re offering with this amazing Service Card widget. Your users can easily get a full insight from this section about all the services you have. The widgets have multiple designs and styling options.</li>\n<li><a href=\"https://widgets.enteraddons.com/social-icon/\" rel=\"nofollow ugc\"><strong>Social Icon</strong></a> Exhibit your social icons, such as Facebook, Instagram, Twitter, and Linkedin, on your WordPress website using our Social Icons Widget for Elementor. Furthermore, using this addon you can customize the social icons with various shapes, colors, designs, text, borders, and so on.</li>\n<li><a href=\"https://widgets.enteraddons.com/timeline-widget/\" rel=\"nofollow ugc\"><strong>Timeline</strong></a> By using this beautiful tool Elemntor timeline widget, you can share your story in the most concise and intelligent way possible. This Elementor timeline widget will assist you in creating an amazing design for your Elementor website. If you use the EnterAddons timeline widget for Elementor, your visitors will learn everything they want to know about the history of your company or product from a bird’s-eye view. With this timeline Elementor addon, you can quickly build a stunning timeline.</li>\n<li><a href=\"https://widgets.enteraddons.com/testimonial-widget/\" rel=\"nofollow ugc\"><strong>Testimonial</strong></a> Using the EnterAddons Testimonial widget, you can create amazing and stunning testimonial sections with a variety of styles. The Elementor testimonial widget will assist you in building trust with your users. This Elementor Testimonial widget allows for numerous customizations. To display a testimonial on your website, you do not need to start creating any custom post types. It can be controlled from the Elementor editor panel. You can also add testimonial providers’ avatars and designations to increase their credibility for your users. It’s an intelligent testimonial widget for Elementor. To create a dependable product or website, use Elementor Testimonial Widget.</li>\n<li><a href=\"https://widgets.enteraddons.com/testimonial-multi-rows/\" rel=\"nofollow ugc\"><strong>Testimonial Multi Rows</strong></a> Using an Elementor testimonial Addon is a great way to show off your client’s feedback, but what about multi-row testimonials? Interesting, huh? We offer a widget that allows you to make this happen using multiple rows of testimonials. Multiple Elementor testimonial options, including layout, wrapper content style, description, title separator, and client, are all customizable.</li>\n<li><a href=\"https://widgets.enteraddons.com/pricing-table/\" rel=\"nofollow ugc\"><strong>Pricing Table</strong></a> Using this Elementor Pricing table widget, you can produce stunning pricing tables with plenty of customization options and a sleek look and feel. Forget the conventional way of creating a pricing table. However, now that we have Elementor page builder in our WordPress Ecosystems, we have a tremendous chance to create spectacular pricing tables to handle our best pricing pages. Besides,  if you wish to create a pricing table with Elementor, you must use a large number of Elementor columns and inner sections. You can create a stunning pricing table menu by using the EnterAddons Pricing table widget instead of generating so many dom demands.</li>\n<li><a href=\"https://widgets.enteraddons.com/pricing-table-tab/\" rel=\"nofollow ugc\"><strong>Pricing Table Tab</strong></a> Using the Elementor Pricing table tab widget, you can create beautiful pricing tables with lots of customizations. Previously, we usually created such pricing tables using table plugins. Now, we have a huge opportunity to manage our products’ pricing pages with stunning pricing tables after integrating Elementor page builder into our WordPress Ecosystems. Elementor, however, requires so many columns and inner sections if you want to create a pricing table. But, with the EnterAddons Pricing table tab widget, you can easily create an eye-catching pricing table without requiring so many DOM requests.</li>\n<li><a href=\"https://widgets.enteraddons.com/progressbar/\" rel=\"nofollow ugc\"><strong>Progressbar</strong></a> With our Elementor progress bar widget, you can see how far your project has come. Using our Elementor progress bar addon, you can highlight skill sets, rate of success, future goal forecasts, or project status in a variety of designs and control options.</li>\n<li><a href=\"https://widgets.enteraddons.com/post-grid/\" rel=\"nofollow ugc\"><strong>Post Grid</strong></a> The Elementor post grid widget allows you to showcase your content, picture, write-up, item, and so on in a group with varying styles. It includes the option for customizing categories, post count with grid styles, motion effects, and much more.</li>\n<li><a href=\"https://widgets.enteraddons.com/product-carousel/\" rel=\"nofollow ugc\"><strong>Product Carousel</strong></a> Do you want to grab the attention of your customers to your products but don’t know how? Well, the answer is, the EnterAddons Product Carousel widget. Using this widget for Elementor, you can showcase your WooCommerce product in a customer-engaging way.</li>\n<li><a href=\"https://widgets.enteraddons.com/info-box/\" rel=\"nofollow ugc\"><strong>Info Box</strong></a> You’re in good hands with EnterAddons! In just a couple of minutes, you’ll have beautiful and slick information boxes with the help of creative icons, links, and a text editor. Its straightforward interface allows you to easily create headings, descriptions, and buttons. Furthermore, your info box can be customized to suit your tastes.</li>\n<li><a href=\"https://widgets.enteraddons.com/image-gallery/\" rel=\"nofollow ugc\"><strong>Image Gallery</strong></a> The Image Gallery widget for Elementor allows you to showcase recent photos, company environment, events, and other information to your visitors. With our Elementor Image Gallery widget, you can style content, layout, thumbnails, overlays, filters, sequences, alignment, filter labels, and ordering in a variety of ways.</li>\n<li><a href=\"https://widgets.enteraddons.com/image-compare/\" rel=\"nofollow ugc\"><strong>Image Compare</strong></a> Are you a photo editor, agency, or product designer who frequently needs to show off your work in the form of a before and after slider? For this task, the Elementor Image compare widget is ideal. Furthermore, built-in styling options, as well as horizontal and vertical orientation features, can assist you in designing these before-and-after sections with greater creativity. Our image compares Elementor widget will assist you in comparing your two product images Old Vs New in a spectacular manner.  Prepare to use the EnterAddons EnterAddons Elementor Image Compare widget to entirely display your product comparison.</li>\n<li><a href=\"https://widgets.enteraddons.com/logo-carousel/\" rel=\"nofollow ugc\"><strong>Logo Carousel</strong></a> With this lovely logo carousel Elementor widget, you can display your collaborators and product lines in a vertical or horizontal motion, thanks to EnterAddons Elementor Addons. This Elementor Logo carousel widget will assist you in displaying your clients’ or product logos on your Elementor website in a variety of ways.</li>\n<li><a href=\"https://widgets.enteraddons.com/newsletter/\" rel=\"nofollow ugc\"><strong>Newsletter</strong></a> With the Elementor Free version, you can easily create a newsletter subscribe form or newsletter subscribe bar for your Elementor site. Then what’s the need for our Newsletter widget? The answer is that the EnterAddons Newsletter widget for Elementor comes with plenty of styling and customization options, and important it’s also FREE!</li>\n<li><a href=\"https://widgets.enteraddons.com/google-map/\" rel=\"nofollow ugc\"><strong>Google Map</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/advanced-list/\" rel=\"nofollow ugc\"><strong>Advanced List</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/photo-stack/\" rel=\"nofollow ugc\"><strong>Photo Stack</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/photo-hanger/\" rel=\"nofollow ugc\"><strong>Photo Hanger</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/title-reveal-animation/\" rel=\"nofollow ugc\"><strong>Title Reveal Animation</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/photo-reveal-animation/\" rel=\"nofollow ugc\"><strong>Photo Reveal Animation</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/image-zoom-magnifier/\" rel=\"nofollow ugc\"><strong>Image Zoom Magnifier</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/image-icon-card/\" rel=\"nofollow ugc\"><strong>Image Icon Card</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/collection-box/\" rel=\"nofollow ugc\"><strong>Collection Box</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/content-ticker/\" rel=\"nofollow ugc\"><strong>Content Ticker</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/flip-card/\" rel=\"nofollow ugc\"><strong>Flip Card</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/business-hours\" rel=\"nofollow ugc\"><strong>Business Hours</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/image-hotspot\" rel=\"nofollow ugc\"><strong>Image Hotspot</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/vertical-testimonial/\" rel=\"nofollow ugc\"><strong>Vertical Testimonial</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/profile-card/\" rel=\"nofollow ugc\"><strong>Profile Card</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/nav-logo-nav-menu-nav-search/\" rel=\"nofollow ugc\"><strong>Nav Menu</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/nav-logo-nav-menu-nav-search/\" rel=\"nofollow ugc\"><strong>OffCanvas Nav Menu</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/nav-logo-nav-menu-nav-search/\" rel=\"nofollow ugc\"><strong>Nav Logo</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/nav-logo-nav-menu-nav-search/\" rel=\"nofollow ugc\"><strong>Nav Search</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/breadcrumbs/\" rel=\"nofollow ugc\"><strong>Breadcrumbs</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/coupon-code/\" rel=\"nofollow ugc\"><strong>Coupon Code</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/accordion-gallery/\" rel=\"nofollow ugc\"><strong>Accordion Gallery</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/color-scheme/\" rel=\"nofollow ugc\"><strong>Color Scheme</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/food-menu-list/\" rel=\"nofollow ugc\"><strong>Food Menu List</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/horizontal-pricing-table/\" rel=\"nofollow ugc\"><strong>Horizontal Pricing Table</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/travel-gallery/\" rel=\"nofollow ugc\"><strong>Travel Gallery</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/recent-post/\" rel=\"nofollow ugc\"><strong>Recent Post</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/single-testimonial/\" rel=\"nofollow ugc\"><strong>Single Testimonial</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/type-animation/\" rel=\"nofollow ugc\"><strong>Type Animation</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/data-table/\" rel=\"nofollow ugc\"><strong>Data Table</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/advance-tabs/\" rel=\"nofollow ugc\"><strong>Advance Tabs</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/animation-title/\" rel=\"nofollow ugc\"><strong>Animation Title</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/lottie-animation/\" rel=\"nofollow ugc\"><strong>Lottie Animation</strong></a></li>\n</ul>\n<h4>Pro Features:</h4>\n<ul>\n<li>83+ Advance Widgets ( Free 63 +, Pro 20+ )</li>\n<li>8 Modules ( More are coming soon )</li>\n<li>Section Nesting</li>\n<li>Cross Domain Copy Paste</li>\n<li>54+ Ready Template ( More are coming soon )</li>\n<li>300+ Section Blocks ( More are coming soon )</li>\n<li>39+ Header,Footer Ready Template ( More are coming soon )</li>\n</ul>\n<pre><a href=\"https://enteraddons.com/feature/\" rel=\"nofollow ugc\">View All Features</a></pre>\n<pre><a href=\"https://enteraddons.com/pricing/\" rel=\"nofollow ugc\">Buy Now</a></pre>\n",
        "installation": "<p><strong>The easy way.</strong></p>\n<p>Go to your WordPress Dashboard. Navigate to Plugins &gt; Add New and then search for &#8220;EnterAddons&#8221;. Click on Install and then Activate the Plugin.</p>\n<p>That&#8217;s it, EnterAddons Plugin is now activated on your site!</p>\n<p><strong>The hard way..</strong></p>\n<p>Download &#8220;EnterAddons WordPress Plugin&#8221;  and then extract the zip file and just drop the contents in the wp-content/plugins/ directory of your WordPress installation and then activate the Plugin from Plugins page.</p>\n",
        "faq": "\n<dt id='is%20this%20plugin%20compatible%20with%20the%20latest%20wordpress%20%3F'>\nIs this plugin compatible with the latest WordPress ?\n</h4>\n<p>\n<p>Yes</p>\n</p>\n\n",
        "changelog": "<h4>2.1.8</h4>\n<ul>\n<li>Fixed Security Issues</li>\n<li>Fixed Escaping Issues</li>\n</ul>\n<h4>2.1.7</h4>\n<ul>\n<li>Fixed some core Issues</li>\n</ul>\n<h4>2.1.6</h4>\n<ul>\n<li>Fixed Security Issues </li>\n<li>Fixed Escaping Issues</li>\n<li>Check WordPress 6.5.3 compatibility</li>\n</ul>\n<h4>2.1.5</h4>\n<ul>\n<li>Added category option in Post grid widget </li>\n<li>Added category option in Recent Posts widget </li>\n<li>Added Submenu Arrow/Icon Hide option</li>\n<li>Check WordPress 6.5 compatibility</li>\n</ul>\n<h4>2.1.4</h4>\n<ul>\n<li>Fixed admin promotional notice error issue</li>\n<li>Update POT file</li>\n<li>Fixed some other issue</li>\n</ul>\n<h4>2.1.3</h4>\n<ul>\n<li>Added WYSIWYG editor instead of TEXTAREA control in Infobox widget</li>\n<li>Fixed some CSS Issue</li>\n</ul>\n<h4>2.1.2</h4>\n<ul>\n<li>Fixed WordPress 6.4.1 Compatibility issue</li>\n</ul>\n<h4>2.1.1</h4>\n<ul>\n<li>Fixed Advance List widget Text font size not working issue</li>\n<li>Fixed Advance List widget Text color not working issue</li>\n<li>Added Social Icon widget Icon hover border color option</li>\n<li>Fixed some other issue</li>\n</ul>\n<h4>2.1.0</h4>\n<ul>\n<li>Fixed CSS Not found console error</li>\n<li>Added post excerpt option in post grid widget</li>\n<li>Fixed long title issue in post grid widget</li>\n<li>Fixed font size and color option not working issue in advance list widget</li>\n<li>Fixed some CSS issue</li>\n</ul>\n<h4>2.0.9</h4>\n<ul>\n<li>Fixed Heading widget unexpected content issue</li>\n</ul>\n<h4>2.0.8</h4>\n<ul>\n<li>Fixed OffCanvas Nav menu widget CSS issue</li>\n<li>Improved all widgets default style</li>\n<li>Fixed some other issues</li>\n</ul>\n<h4>2.0.7</h4>\n<ul>\n<li>Added OffCanvas Nav menu widget</li>\n<li>Fixed compatibility issue</li>\n<li>Fixed some minor issues</li>\n</ul>\n<h4>2.0.6</h4>\n<ul>\n<li>Added Flex container support</li>\n<li>Fixed Sticky option not working on Flexbox Container layout</li>\n<li>Fixed Equal height option not working on Flexbox Container layout</li>\n</ul>\n<h4>2.0.5</h4>\n<ul>\n<li>Added Animation Title widget</li>\n<li>Added Lottie Animation</li>\n<li>Fixed some other issue</li>\n</ul>\n<h4>2.0.4</h4>\n<ul>\n<li>Added Header, Footer Template Insert option in editor</li>\n<li>Fixed some widgets CSS Issue</li>\n<li>Fixed collections box widget CSS not work issue</li>\n<li>Fixed some other issue</li>\n</ul>\n<h4>2.0.3</h4>\n<ul>\n<li>Fixed Template import background not working issue</li>\n<li>Added column widgets Equal height option</li>\n<li>Added widget Floating Effects Option</li>\n<li>Fixed Some CSS Issue</li>\n</ul>\n<h4>2.0.2</h4>\n<ul>\n<li>Fixed plugin update infobox widget design broken issue</li>\n</ul>\n<h4>2.0.1</h4>\n<ul>\n<li>Added missing file</li>\n</ul>\n<h4>2.0.0</h4>\n<ul>\n<li>Added more options in widgets</li>\n<li>Added widgets CSS Transform options</li>\n<li>Improved user experience</li>\n<li>Fixed some other issues</li>\n</ul>\n<h4>1.0.9</h4>\n<ul>\n<li>Fixed PHP error issue</li>\n<li>Added more options in widgets</li>\n<li>Added more responsive control instead of regular control</li>\n</ul>\n<h4>1.0.8</h4>\n<ul>\n<li>Fixed Info box widgets Default ribbon active issue</li>\n</ul>\n<h4>1.0.7</h4>\n<ul>\n<li>Added more options in various widgets</li>\n<li>Fixed some issues</li>\n</ul>\n<h4>1.0.6</h4>\n<ul>\n<li>Added 5 new widgets</li>\n<li>Improved the plugin</li>\n<li>Fixed some issues</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Fixed $control_id argument is deprecated error issue</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>Added 7 new widgets</li>\n<li>Added breadcrumb widget</li>\n<li>Added more options</li>\n<li>Fixed some issues</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Added 3 new widgets</li>\n<li>Added Header &amp; Footer Builder</li>\n<li>Added more options</li>\n<li>Fixed some issues</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Added 15 new widgets</li>\n<li>Improved the performance</li>\n<li>Add more options</li>\n<li>Fixed some issues</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Fixed video button popup not work issue</li>\n<li>Added template and section preset library</li>\n<li>Added template and section preset import option</li>\n<li>Fixed some other issues</li>\n</ul>\n<h4>1.0.0</h4>\n<p>This is initial Release for EnterAddons</p>\n"
    },
    "short_description": "EnterAddons | Ultimate Addons For WordPress And Elementor",
    "description": "<p>Take your Elementor page-building experience to the next level with Enteraddons&#8217; 63+ free widgets. Enteraddons will be the ultimate addon for your Elementor Page Builder. The add-on includes 100+ ready blocks, 20+ ready templates, 4+ ready Header/Footer templates, and many more. As a result, you can create any site with ease.</p>\n<p>The modular-based, lightweight, and completely customizable add-on will surely blow your mind. The addons provide you with a quick template import system and a live Elementor Widget library. So, instead of using multiple plugins, get everything under one roof. Enteraddons could be the only solution available to add powers to your page builder.</p>\n<h3>USEFUL LINKS 👇</h3>\n<p><strong><a href=\"https://enteraddons.com/\" rel=\"nofollow ugc\">Live Demo</a></strong> | <strong><a href=\"https://enteraddons.com/documentation/\" rel=\"nofollow ugc\">Documentation</a></strong> | <strong><a href=\"https://www.youtube.com/@EnterAddons/videos\" rel=\"nofollow ugc\">Video Tutorial</a></strong> | <strong><a href=\"https://enteraddons.com/pricing/\" rel=\"nofollow ugc\">Upgrade Pro</a></strong> | <strong><a href=\"https://support.themelooks.com/\" rel=\"nofollow ugc\">Need Support?</a></strong></p>\n<h4>Key Features:</h4>\n<ul>\n<li>63+ Free Advanced Widgets</li>\n<li>100+ Free Ready Sections</li>\n<li>10+ Free Ready Pages Template</li>\n<li>4+ Free Ready Header/Footer Template</li>\n<li>Header &amp; Footer Builder</li>\n<li>WooCommerce Widgets</li>\n<li>Post Widgets</li>\n<li>Ready Template Import</li>\n<li>Section Sticky</li>\n<li>CSS Transform</li>\n<li>Floating Effects</li>\n<li>Column, Widgets Equal Height</li>\n<li>On-demand Asset Loading</li>\n<li>Cross-Browser Compatible</li>\n<li>Lightweight and Fast Loading</li>\n<li>24/7 SUPPORT</li>\n<li>Easy settings options</li>\n<li>Compatibility with WordPress 6+</li>\n<li>Translation ready</li>\n<li>Ready for translation ( .pot files included )</li>\n<li>Free Updates</li>\n<li>Error-free code</li>\n<li>Well Documented</li>\n</ul>\n<h4>63+ FREE ADVANCED WIDGETS:</h4>\n<ul>\n<li><a href=\"https://widgets.enteraddons.com/accordion-widget/\" rel=\"nofollow ugc\"><strong>Accordion</strong></a> It’s time to display your Elementor FAQ with EnterAddons’ Accordion widget. You can display your FAQ text answers in a foldable and precise way. Using this Elementor Accordion addon you can make your web page shorten and concise with all required information. Regardless of pages, posts, or anywhere on your website, you can use this widget with custom color, style, icon, and many more effects.</li>\n<li><a href=\"https://widgets.enteraddons.com/button/\" rel=\"nofollow ugc\"><strong>Button</strong></a> EnterAddons’ Elementor Button Widget allows you to make stunning Elementor buttons with text, color, hover effects, and other effects. You can also use this Elementor button widget to create call-to-action buttons.</li>\n<li><a href=\"https://widgets.enteraddons.com/counter/\" rel=\"nofollow ugc\"><strong>Counter</strong></a> With this animated number counter Elementor addon, your number counter can be customized by selecting your background, icon, and format. There are many different types of counters, such as the animated number counter on WordPress stats, the social media fans counter on Elementor, the product counter style on Elementor addons, and the followers counter style on Elementor addons.</li>\n<li><a href=\"https://widgets.enteraddons.com/call-to-action/\" rel=\"nofollow ugc\"><strong>Call to Action</strong></a>  With this Elementor page builder widget, you can create audience engaging call to action with plenty of styling options including buttons, images, and content features. Plenty of widget presets are available in it. You can make your call-to-action section more attractive than ever before.</li>\n<li><a href=\"https://widgets.enteraddons.com/card-carousel/\" rel=\"nofollow ugc\"><strong>Card Carousel</strong></a> An extremely powerful widget for displaying your goods, blog posts, headlines, and creative posts through a beautiful combination of text messages, links, badges, and images. You can start creating eye-candy styles with a twist by using built-in positioning and offset features. Simply put, creating amazing card items using this Elementor card widget is a breeze.</li>\n<li><a href=\"https://widgets.enteraddons.com/countdown-timer/\" rel=\"nofollow ugc\"><strong>Countdown Timer</strong></a> Using this countdown timer widget of ours, you can apply and enable a countdown timer on your Elementor website. There are lots of styling options, special effects, and formatting available in this Elementor countdown timer addon.</li>\n<li><a href=\"https://widgets.enteraddons.com/contact-form/\" rel=\"nofollow ugc\"><strong>Contact Form 7</strong></a> Creating different types of contact forms is not a tough task anymore. Our Contact Form 7 widget allows you to create this easily. So, you can design your contact form container, fields, and the format you like using this Contact Form 7 addon for Elementor.</li>\n<li><a href=\"https://widgets.enteraddons.com/events-card/\" rel=\"nofollow ugc\"><strong>Events Card</strong></a> Using this Widget on Elementor, you can showcase the ongoing or upcoming events of your site. You can add the location, time, event image, and subscription free on the card using this Widget. It’s up to you which design you would like to go with because there are quite a few available.</li>\n<li><a href=\"https://widgets.enteraddons.com/team/\" rel=\"nofollow ugc\"><strong>Team</strong></a> Showcase your team members including their name, bio, position, social media links, and images using this Team widget of EnterAddons. Use Elementor team member addon to customize all things as you like. This widget offers plenty of customizing options for displaying your team members.</li>\n<li><a href=\"https://widgets.enteraddons.com/feature-card/\" rel=\"nofollow ugc\"><strong>Feature Card</strong></a> Using this widget of EnterAddons, you can showcase your item will all its features, and images, texts in a graphical presentation. There are several designs being added to this widget. You can choose whatever you prefer the most.</li>\n<li><a href=\"https://widgets.enteraddons.com/heading/\" rel=\"nofollow ugc\"><strong>Heading</strong></a> The heading widget allows to create attractive headlines. Not only just the headings, but also heading subtitles, and separate heading descriptions. You can customize these fancy heading styles as you like. This widget has more to offer: Elementor heading title with background color text title, image style, subheading title, and many more.</li>\n<li><a href=\"https://widgets.enteraddons.com/service-card/\" rel=\"nofollow ugc\"><strong>Service Card</strong></a> Make a visual presentation of the services you’re offering with this amazing Service Card widget. Your users can easily get a full insight from this section about all the services you have. The widgets have multiple designs and styling options.</li>\n<li><a href=\"https://widgets.enteraddons.com/social-icon/\" rel=\"nofollow ugc\"><strong>Social Icon</strong></a> Exhibit your social icons, such as Facebook, Instagram, Twitter, and Linkedin, on your WordPress website using our Social Icons Widget for Elementor. Furthermore, using this addon you can customize the social icons with various shapes, colors, designs, text, borders, and so on.</li>\n<li><a href=\"https://widgets.enteraddons.com/timeline-widget/\" rel=\"nofollow ugc\"><strong>Timeline</strong></a> By using this beautiful tool Elemntor timeline widget, you can share your story in the most concise and intelligent way possible. This Elementor timeline widget will assist you in creating an amazing design for your Elementor website. If you use the EnterAddons timeline widget for Elementor, your visitors will learn everything they want to know about the history of your company or product from a bird’s-eye view. With this timeline Elementor addon, you can quickly build a stunning timeline.</li>\n<li><a href=\"https://widgets.enteraddons.com/testimonial-widget/\" rel=\"nofollow ugc\"><strong>Testimonial</strong></a> Using the EnterAddons Testimonial widget, you can create amazing and stunning testimonial sections with a variety of styles. The Elementor testimonial widget will assist you in building trust with your users. This Elementor Testimonial widget allows for numerous customizations. To display a testimonial on your website, you do not need to start creating any custom post types. It can be controlled from the Elementor editor panel. You can also add testimonial providers’ avatars and designations to increase their credibility for your users. It’s an intelligent testimonial widget for Elementor. To create a dependable product or website, use Elementor Testimonial Widget.</li>\n<li><a href=\"https://widgets.enteraddons.com/testimonial-multi-rows/\" rel=\"nofollow ugc\"><strong>Testimonial Multi Rows</strong></a> Using an Elementor testimonial Addon is a great way to show off your client’s feedback, but what about multi-row testimonials? Interesting, huh? We offer a widget that allows you to make this happen using multiple rows of testimonials. Multiple Elementor testimonial options, including layout, wrapper content style, description, title separator, and client, are all customizable.</li>\n<li><a href=\"https://widgets.enteraddons.com/pricing-table/\" rel=\"nofollow ugc\"><strong>Pricing Table</strong></a> Using this Elementor Pricing table widget, you can produce stunning pricing tables with plenty of customization options and a sleek look and feel. Forget the conventional way of creating a pricing table. However, now that we have Elementor page builder in our WordPress Ecosystems, we have a tremendous chance to create spectacular pricing tables to handle our best pricing pages. Besides,  if you wish to create a pricing table with Elementor, you must use a large number of Elementor columns and inner sections. You can create a stunning pricing table menu by using the EnterAddons Pricing table widget instead of generating so many dom demands.</li>\n<li><a href=\"https://widgets.enteraddons.com/pricing-table-tab/\" rel=\"nofollow ugc\"><strong>Pricing Table Tab</strong></a> Using the Elementor Pricing table tab widget, you can create beautiful pricing tables with lots of customizations. Previously, we usually created such pricing tables using table plugins. Now, we have a huge opportunity to manage our products’ pricing pages with stunning pricing tables after integrating Elementor page builder into our WordPress Ecosystems. Elementor, however, requires so many columns and inner sections if you want to create a pricing table. But, with the EnterAddons Pricing table tab widget, you can easily create an eye-catching pricing table without requiring so many DOM requests.</li>\n<li><a href=\"https://widgets.enteraddons.com/progressbar/\" rel=\"nofollow ugc\"><strong>Progressbar</strong></a> With our Elementor progress bar widget, you can see how far your project has come. Using our Elementor progress bar addon, you can highlight skill sets, rate of success, future goal forecasts, or project status in a variety of designs and control options.</li>\n<li><a href=\"https://widgets.enteraddons.com/post-grid/\" rel=\"nofollow ugc\"><strong>Post Grid</strong></a> The Elementor post grid widget allows you to showcase your content, picture, write-up, item, and so on in a group with varying styles. It includes the option for customizing categories, post count with grid styles, motion effects, and much more.</li>\n<li><a href=\"https://widgets.enteraddons.com/product-carousel/\" rel=\"nofollow ugc\"><strong>Product Carousel</strong></a> Do you want to grab the attention of your customers to your products but don’t know how? Well, the answer is, the EnterAddons Product Carousel widget. Using this widget for Elementor, you can showcase your WooCommerce product in a customer-engaging way.</li>\n<li><a href=\"https://widgets.enteraddons.com/info-box/\" rel=\"nofollow ugc\"><strong>Info Box</strong></a> You’re in good hands with EnterAddons! In just a couple of minutes, you’ll have beautiful and slick information boxes with the help of creative icons, links, and a text editor. Its straightforward interface allows you to easily create headings, descriptions, and buttons. Furthermore, your info box can be customized to suit your tastes.</li>\n<li><a href=\"https://widgets.enteraddons.com/image-gallery/\" rel=\"nofollow ugc\"><strong>Image Gallery</strong></a> The Image Gallery widget for Elementor allows you to showcase recent photos, company environment, events, and other information to your visitors. With our Elementor Image Gallery widget, you can style content, layout, thumbnails, overlays, filters, sequences, alignment, filter labels, and ordering in a variety of ways.</li>\n<li><a href=\"https://widgets.enteraddons.com/image-compare/\" rel=\"nofollow ugc\"><strong>Image Compare</strong></a> Are you a photo editor, agency, or product designer who frequently needs to show off your work in the form of a before and after slider? For this task, the Elementor Image compare widget is ideal. Furthermore, built-in styling options, as well as horizontal and vertical orientation features, can assist you in designing these before-and-after sections with greater creativity. Our image compares Elementor widget will assist you in comparing your two product images Old Vs New in a spectacular manner.  Prepare to use the EnterAddons EnterAddons Elementor Image Compare widget to entirely display your product comparison.</li>\n<li><a href=\"https://widgets.enteraddons.com/logo-carousel/\" rel=\"nofollow ugc\"><strong>Logo Carousel</strong></a> With this lovely logo carousel Elementor widget, you can display your collaborators and product lines in a vertical or horizontal motion, thanks to EnterAddons Elementor Addons. This Elementor Logo carousel widget will assist you in displaying your clients’ or product logos on your Elementor website in a variety of ways.</li>\n<li><a href=\"https://widgets.enteraddons.com/newsletter/\" rel=\"nofollow ugc\"><strong>Newsletter</strong></a> With the Elementor Free version, you can easily create a newsletter subscribe form or newsletter subscribe bar for your Elementor site. Then what’s the need for our Newsletter widget? The answer is that the EnterAddons Newsletter widget for Elementor comes with plenty of styling and customization options, and important it’s also FREE!</li>\n<li><a href=\"https://widgets.enteraddons.com/google-map/\" rel=\"nofollow ugc\"><strong>Google Map</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/advanced-list/\" rel=\"nofollow ugc\"><strong>Advanced List</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/photo-stack/\" rel=\"nofollow ugc\"><strong>Photo Stack</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/photo-hanger/\" rel=\"nofollow ugc\"><strong>Photo Hanger</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/title-reveal-animation/\" rel=\"nofollow ugc\"><strong>Title Reveal Animation</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/photo-reveal-animation/\" rel=\"nofollow ugc\"><strong>Photo Reveal Animation</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/image-zoom-magnifier/\" rel=\"nofollow ugc\"><strong>Image Zoom Magnifier</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/image-icon-card/\" rel=\"nofollow ugc\"><strong>Image Icon Card</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/collection-box/\" rel=\"nofollow ugc\"><strong>Collection Box</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/content-ticker/\" rel=\"nofollow ugc\"><strong>Content Ticker</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/flip-card/\" rel=\"nofollow ugc\"><strong>Flip Card</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/business-hours\" rel=\"nofollow ugc\"><strong>Business Hours</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/image-hotspot\" rel=\"nofollow ugc\"><strong>Image Hotspot</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/vertical-testimonial/\" rel=\"nofollow ugc\"><strong>Vertical Testimonial</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/profile-card/\" rel=\"nofollow ugc\"><strong>Profile Card</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/nav-logo-nav-menu-nav-search/\" rel=\"nofollow ugc\"><strong>Nav Menu</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/nav-logo-nav-menu-nav-search/\" rel=\"nofollow ugc\"><strong>OffCanvas Nav Menu</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/nav-logo-nav-menu-nav-search/\" rel=\"nofollow ugc\"><strong>Nav Logo</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/nav-logo-nav-menu-nav-search/\" rel=\"nofollow ugc\"><strong>Nav Search</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/breadcrumbs/\" rel=\"nofollow ugc\"><strong>Breadcrumbs</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/coupon-code/\" rel=\"nofollow ugc\"><strong>Coupon Code</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/accordion-gallery/\" rel=\"nofollow ugc\"><strong>Accordion Gallery</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/color-scheme/\" rel=\"nofollow ugc\"><strong>Color Scheme</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/food-menu-list/\" rel=\"nofollow ugc\"><strong>Food Menu List</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/horizontal-pricing-table/\" rel=\"nofollow ugc\"><strong>Horizontal Pricing Table</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/travel-gallery/\" rel=\"nofollow ugc\"><strong>Travel Gallery</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/recent-post/\" rel=\"nofollow ugc\"><strong>Recent Post</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/single-testimonial/\" rel=\"nofollow ugc\"><strong>Single Testimonial</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/type-animation/\" rel=\"nofollow ugc\"><strong>Type Animation</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/data-table/\" rel=\"nofollow ugc\"><strong>Data Table</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/advance-tabs/\" rel=\"nofollow ugc\"><strong>Advance Tabs</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/animation-title/\" rel=\"nofollow ugc\"><strong>Animation Title</strong></a></li>\n<li><a href=\"https://widgets.enteraddons.com/lottie-animation/\" rel=\"nofollow ugc\"><strong>Lottie Animation</strong></a></li>\n</ul>\n<h4>Pro Features:</h4>\n<ul>\n<li>83+ Advance Widgets ( Free 63 +, Pro 20+ )</li>\n<li>8 Modules ( More are coming soon )</li>\n<li>Section Nesting</li>\n<li>Cross Domain Copy Paste</li>\n<li>54+ Ready Template ( More are coming soon )</li>\n<li>300+ Section Blocks ( More are coming soon )</li>\n<li>39+ Header,Footer Ready Template ( More are coming soon )</li>\n</ul>\n<pre><a href=\"https://enteraddons.com/feature/\" rel=\"nofollow ugc\">View All Features</a></pre>\n<pre><a href=\"https://enteraddons.com/pricing/\" rel=\"nofollow ugc\">Buy Now</a></pre>\n",
    "download_link": "https://downloads.wordpress.org/plugin/enteraddons.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/enteraddons/assets/screenshot-1.png?rev=2789625",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/enteraddons/assets/screenshot-2.png?rev=2892639",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/enteraddons/assets/screenshot-3.png?rev=2768175",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/enteraddons/assets/screenshot-4.png?rev=2901124",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/enteraddons/assets/screenshot-5.png?rev=2901124",
            "caption": ""
        }
    ],
    "tags": {
        "addons": "addons",
        "elementor": "elementor",
        "elementor-addons": "elementor addons",
        "elementor-widget": "elementor widget",
        "elements": "elements"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://themelooks.com/",
    "banners": {
        "low": "https://ps.w.org/enteraddons/assets/banner-772x250.png?rev=2865101",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/enteraddons/assets/icon-128x128.gif?rev=2747889",
        "2x": "https://ps.w.org/enteraddons/assets/icon-256x256.gif?rev=2747889"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}