{
    "name": "EntryWizard",
    "slug": "entrywizard",
    "version": "1.3.27",
    "author": "Josie Stauffer",
    "author_profile": "https://profiles.wordpress.org/joanne123/",
    "contributors": {
        "joanne123": {
            "profile": "https://profiles.wordpress.org/joanne123/",
            "avatar": "https://secure.gravatar.com/avatar/854f2a59a9c606c3ffa7c821311bd2e7?s=96&d=monsterid&r=g",
            "display_name": "Josie Stauffer"
        },
        "teskeyn": {
            "profile": "https://profiles.wordpress.org/teskeyn/",
            "avatar": "https://secure.gravatar.com/avatar/24bedcd006fd805756777decfea22ba0?s=96&d=monsterid&r=g",
            "display_name": "teskeyn"
        }
    },
    "requires": "5.0",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 17,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 17,
    "support_url": "https://wordpress.org/support/plugin/entrywizard/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 100,
    "downloaded": 9897,
    "last_updated": "2024-04-22 9:47pm GMT",
    "added": "2013-08-02",
    "homepage": "http:",
    "sections": {
        "description": "<p>EntryWizard was developed to cater to the needs of camera club competitions.  In these competitions members may submit multiple images with titles and other data attached.</p>\n<ul>\n<li>\n<p>Administrators use the software to design web forms, asking for information as text inputs and/or drop-down menu items as well as image files.</p>\n</li>\n<li>\n<p>They may set up any number of different &#8220;layouts&#8221; ( specifications of what information to ask for and what limits to enforce ), assigning an identifier to each.</p>\n</li>\n<li>\n<p>Here is <strong>one example</strong> of the sort of rules a layout is able to specify:</p>\n<ul>\n<li>Each image must have:\n<ol>\n<li>a short title;</li>\n<li>a &#8220;Category&#8221;, which must be one of &#8220;Nature&#8221;, &#8220;Photojournalism&#8221;, &#8220;Still Life&#8221; or &#8220;Portrait&#8221;;</li>\n<li>a &#8220;Format&#8221;, which must be one of &#8220;Digital&#8221;, &#8220;Slide&#8221; or &#8220;Print&#8221;</li>\n</ol>\n</li>\n<li>Up to 6 entries may be submitted, each with or without a digital version</li>\n<li>Any image of type &#8220;Digital&#8221; must have an uploaded digital version</li>\n<li>At most 2 of the 6 images may be in the &#8220;Nature&#8221; category.</li>\n<li>The images must be in jpeg format, with maximum dimensions of 1280 x 1024 pixels, longest dimension no less than 900 pixels, and size no greater than 1M.</li>\n</ul>\n</li>\n<li>\n<p>Each webform is given a unique alphanumeric identifier, and this identifier is used within a shortcode to insert the webform in a page or post. Any number of different webforms may be created, and one of the layouts is assigned to each one. Multiple webforms may appear on one page, although currently they have to be submitted individually.</p>\n</li>\n<li>\n<p>Each webform separately may be set as &#8220;open for upload&#8221; or &#8220;closed&#8221;.  If it is open, the shortcode is replaced by the upload form.  If it is closed, the shortcode is replaced by a message saying that the upload is closed.  A closed webform may also be opened temporarily to specified members only, and an open webform may be set to close automatically at a specified time.</p>\n</li>\n<li>\n<p>When items have been uploaded, the administrator may either view the items online, or download them. The downloaded image files may be renamed in various ways.  A spreadsheet (in comma-separated .csv format) showing the uploaded data together with some optional information about the users, may also be downloaded.</p>\n</li>\n<li>\n<p>The uploaded images may be attached to pre-existing pages for display in a gallery.</p>\n</li>\n<li>\n<p>There is a fine-grained permissions system allowing administrators to grant an individual user various levels of control over the webforms and layouts.<br />\nOnly logged-in users may see the webform.</p>\n</li>\n<li>\n<p>Users of this plugin may also be interested in using Flexishow (https://sourceforge.net/projects/flexishow/) to run a slideshow  using the information in the spreadsheet to select the images displayed.</p>\n</li>\n<li>\n<p>EntryWizard has a companion plugin called Ewz-Rating (https://wordpress.org/plugins/ewz-rating/). It is designed for display and online judging of items uploaded via EntryWizard.</p>\n</li>\n</ul>\n<h4>Privacy</h4>\n<p>This plugin does not send any data to external servers. It does store in the wordpress database whatever data is requested in the forms designed by the administrator. Viewing of such data using the plugin&#8217;s shortcodes is always restricted to logged-in users, and is usually further restricted by the administrator.</p>\n",
        "installation": "<ul>\n<li>\n<p>Either</p>\n<ul>\n<li>Go to Plugins -&gt; Install New and search for EntryWizard.  Click &#8220;Install Now&#8221;.<br />\nOr</li>\n<li>Download and unzip the file into your plugins folder.</li>\n</ul>\n</li>\n<li>\n<p>In the administration area, go to Plugins, look for &#8220;EntryWizard&#8221;, and click &#8220;activate&#8221;.</p>\n</li>\n<li>\n<p>The &#8220;EntryWizard&#8221; links should appear on the administration sidebar.</p>\n</li>\n<li>\n<p><strong>Use With Caching Plugins</strong>: Caching plugins may need to be configured so they do not cache EntryWizard data.  For example, if you are using the &#8220;DB Cache Reloaded Fix&#8221; plugin, you need to add &#8220;EWZ_|ewz_&#8221; to the cache filter (where it says &#8220;Do not cache queries that contains this input contents&#8221;).  If you don&#8217;t do this, users will not get immediate feedback when they upload, but will have to wait for the cache to expire.</p>\n</li>\n</ul>\n<h4>Usage</h4>\n<ul>\n<li>\n<p>The initial setup comes with two sample layouts and one sample webform.  The sample webform has been assigned the identifier &#8220;example&#8221;.<br />\nTo show the sample webform on your page, simply include the shortcode</p>\n<p><strong>[ewz_show_webform identifier=&#8221;example&#8221;]</strong></p>\n<p>in the page or post where you wish the form to appear.</p>\n</li>\n<li>\n<p>Quickstart for the impatient:</p>\n<ol>\n<li>\n<p>In the EntryWizard-&gt;Layouts admin page, click &#8220;Add a new layout&#8221; with options copied from the sample.</p>\n</li>\n<li>\n<p>Give it a new title and save it.</p>\n</li>\n<li>\n<p>In the EntryWizard-&gt;Webforms admin page, click &#8220;Add a new Webform&#8221;.  In the new webform:<br />\n     * give it a name and an identifier<br />\n     * select your newly-created layout<br />\n     * click &#8220;Open for Uploads&#8221;<br />\n     * save the webform</p>\n</li>\n<li>\n<p>Create a new test page, containing<br />\n    [ewz_show_webform identifier=&#8221;xxx&#8221;]<br />\nwhere xxx is the identifier you just created for your new webform.</p>\n</li>\n<li>\n<p>Now you can experiment, changing the settings for your own layout and webform and checking the effect by reloading your test page. If it turns out badly, delete that layout and start over with a fresh copy of the sample one.  Once you have a layout that makes a good starting point for you, you may delete the sample ones.</p>\n</li>\n</ol>\n</li>\n<li>\n<p>If you are using a plugin such as Cimy User Extra Fields, or S2Member, and wish your spreadsheet to contain some of the extra member information they create,  edit the file &#8220;ewz-extra.txt&#8221;.  Save the result as &#8220;ewz-extra.php&#8221; in your plugins folder, and activate the new &#8216;EWZ_EXTRA&#8217; plugin that it creates.  ( Do not make any changes to ewz-custom-data.php ).  Your code will then not be overwritten by subsequent upgrades to EntryWizard.</p>\n</li>\n<li>\n<p>Most items in the EntryWizard admin pages have &#8220;help&#8221; icons beside them.  Clicking one of these should pop up a window with more detailed information.</p>\n</li>\n<li>\n<p>The &#8220;layout&#8221; governs the appearance of the form in the page. To change the layout of a form, go to the &#8220;webforms&#8221; page, open the relevant webform and select a different layout.</p>\n</li>\n<li>\n<p>To change a layout, or create a new one, go to the &#8220;layouts&#8221; page. To save you the work of filling out all the details every time, new layouts are first created as copies of existing ones, to be modified as required. It is suggested that you keep the sample layouts for reference until you are comfortable with the software, and then modify the first one to be your &#8220;base&#8221; layout.</p>\n</li>\n<li>\n<p>To open a new webform for upload, go to EntryWizard-&gt;Webforms in the WordPress Admin menu, click on the webform and check &#8220;open for uploads&#8221;.  To open a closed webform for selected individuals only, click &#8220;Show user selection list&#8221;, and select the users.  Then click &#8220;Save Changes&#8221;.</p>\n</li>\n<li>\n<p>Logged-in users may now upload images by navigating to the page containing the &#8220;ewz_show_webform&#8221; shortcode.</p>\n</li>\n<li>\n<p>Administrators may download images and/or spreadsheet by going to EntryWizard-&gt;Webforms in the WordPress Admin menu, clicking on the webform and selecting the preferred download option.  Or clicking &#8220;Manage Items&#8221; takes you to a list of all the images, which you may view, delete, or attach to a page for display in a wordpress gallery.</p>\n</li>\n<li>\n<p>EntryWizard saves the images in a special subfolder of the wordpress &#8220;uploads&#8221; folder.  The image filenames are derived from the user&#8217;s original filenames in the following way:</p>\n<ol>\n<li>All characters except letters, digits, underscores, dashes,  and all periods except the last,  are replaced by &#8216;_&#8217; ( In the Settings page you may change this to &#8216;-&#8216;, &#8216;X&#8217; or &#8216;x&#8217;). This ensures the filename is acceptable on most systems.</li>\n<li>If the base filename then ends with a digit, another &#8216;_&#8217; is appended.  This makes extra digits added by WordPress in the case of duplicate filenames more legible. It also ensures that no filename is totally numeric &#8211; WordPress handles files with completely numeric names differently in some cases.<br />\nAdministrators may, if required, add a prefix to this filename, or even generate it entirely from information stored on the server.</li>\n</ol>\n</li>\n</ul>\n<h4>How one site makes use of EntryWizard and Ewz-Rating</h4>\n<p>* Image Upload</p>\n<p>Images are uploaded using EntryWizard. If we are planning to print the images, they are required to have one dimension at least 2560 px, otherwise the images are required to fit within 1280&#215;1024, which is (was when this was written!) an adequate size for both judging on most monitors and for projecting at meetings.</p>\n<p>The layout contains a single-line text input for the title, a drop-down for the category, and usually a checkbox to be checked if a comment is requested.  We get up to 200 images in a competition, so to save work for the judges a maximum of 2 out of the 4 allowed entries may ask for comments.</p>\n<p>A prefix containing the user id and the webform identifier is  set to be applied on upload.  This ensures that all image files for the current year have unique names.</p>\n<p>* Download and Preparation</p>\n<p>Because the number of images is large, using the webform download sometimes times out. So the images are usually downloaded using ftp, and the webform download is only used for the spreadsheet itself.</p>\n<p>If we are planning to print, the large versions of the images on the server are copied to another place.  The downloaded copies are resized to 1280&#215;1024 and re-uploaded to the upload folder, overwriting the originals. Otherwise, if we are not planning to print, the images are simply downloaded for eventual display at a club meeting.</p>\n<p>The rating scheme is set up to show the judges the title and the category, with both using &#8220;append to previous column&#8221;. This helps keep the form narrow enough to display side-by-side with the image on a 1920&#215;1200 monitor.</p>\n<p>If there was a &#8220;comment requested&#8221; checkbox in the original upload, that field is divided among the judges. ( If there was no &#8220;comment requested&#8221; checkbox, a new &#8220;fixed text&#8221; field with the text &#8220;Comment Required&#8221; is created and divided  among the judges. ) The comment input field ( which is a multi-line text input ) is then appended to this field, so &#8220;Comment Required&#8221; appears immediately above it if a comment is required.  The effect of this is that on any image all judges may add a comment if they wish, and one judge is required to do so.</p>\n<p>* Judging</p>\n<p>Each judge is given a (temporary) user account on our website.  We use a &#8220;Page Security &amp; Membership&#8221; plugin to assign the judges to a group that has access to the page containing the relevant judging form, plus the public  parts of our site, but not to the private sections.</p>\n<p>After the main judging has taken place, if tie-breaking is required, a new page is created.  For each set of tied images, an ewz-rating shortcode is added like this:<br />\n[ewz_rating view = &#8220;secondary&#8221;  identifier=&#8221;sampleform&#8221; item_ids=&#8221;I1,I2,I3&#8243;], where I1,I2,I3 are the wordpress id&#8217;s of the tied images.<br />\n Any extra inputs required for tiebreaking are added to the rating scheme as &#8220;secondary&#8221;, so they do not display on the main judging page.</p>\n<p>* Presentation</p>\n<p>All scores and comments are downloaded to a spreadsheet.  For presentation at a club meeting, this spreadsheet is used with Flexishow (https://sourceforge.net/projects/flexishow/) to drive a slideshow.</p>\n<p>After the presentation, a new .csv file is generated from the spreadsheet and uploaded back to EntryWizard using the Webforms-&gt;Data Management-&gt;Upload Extra Per-Image Data.  The &#8220;content&#8221; includes the scores and comments for the image.</p>\n<p>A new page is created that is limited to logged-in members and contains a &#8220;[gallery]&#8221; shortcode. Using the Manage Items link on the webform, the images are &#8220;attached&#8221; to this page, with comments allowed.  This creates an image gallery displaying all the images, with their scores and comments, to which logged-in members may add their own comments.</p>\n<p>( The winning images are also displayed in a public gallery that is a little nicer-looking, using other software. )</p>\n<p>* For Developers Only</p>\n<p>There are two hooks you may wish to make use of:<br />\n      1. ewz_after_upload, which runs on completion of a successful upload. Arguments passed are<br />\n         webform_title, user_id, number of new items uploaded, number of existing items updated.<br />\n   and<br />\n      2. ewz_after_delete_item, which runs after each individual item deletion. Arguments are webform_title and user_id.</p>\n<p>Here is some very basic example code:</p>\n<pre><code>function my_after_upload_function( $webform_title, $user_id, $created_count, $updated_count ){\n    $userdata = get_userdata( $user_id );\n    $email = $userdata-&gt;user_email;\n    $name = $userdata-&gt;display_name;\n    error_log(\"Uploaded to $webform_title by $name ( $email ), $created_count items created, $updated_count items updated\");\n\n}\nadd_action('ewz_after_upload', 'my_after_upload_function', 10, 4);\n    ( See WordPress documentation for add_action for the meanings of the last two arguments )\n\n\nfunction my_after_delete_function( $webform_title, $user_id ){\n    error_log(\"1 item Deleted from $webform_title: $user_id\");\n}\nadd_action('ewz_after_delete_item', 'my_after_delete_function', 10, 2 );\n</code></pre>\n<p>( Also, hooks ewz_before_delete_field, ewz_before_delete_item, ewz_before_delete_layout, ewz_before_delete_webform act are designed for use with Ewz_Rating.  Changes to these may not always be documented. )</p>\n",
        "changelog": "<h4>1.3.27</h4>\n<ul>\n<li>Fix required for new  block themes to make the javascript used in shortcodes work properly.  Not needed for classic themes</li>\n</ul>\n<h4>1.3.26</h4>\n<ul>\n<li>Allow viewing/editing of user permissions on the Permissions page with edit_users capability.</li>\n</ul>\n<h4>1.3.25</h4>\n<ul>\n<li>fixed a problem with auto-opening and auto-closing of new, unsaved webforms.</li>\n</ul>\n<h4>1.3.24</h4>\n<ul>\n<li>Make compatible with PHP7.0. Update not required if you are running PHP7.4</li>\n</ul>\n<h4>1.3.23</h4>\n<ul>\n<li>fixed some error messages in the Permissions section.</li>\n</ul>\n<h4>1.3.22</h4>\n<ul>\n<li>Fixed an issue with multi-line text boxes not displaying properly</li>\n</ul>\n<h4>1.3.21</h4>\n<ul>\n<li>Code cleanup and documentation.</li>\n<li>Only list hidden webforms that the user has permission to see.</li>\n<li>Set width and height of image during batch upload.</li>\n<li>Return to the previous page after editing items in the admin item-list view.</li>\n</ul>\n<h4>1.3.20</h4>\n<ul>\n<li>made the addition of a terminal underscore to a filename optional</li>\n<li>made compatible with the new version of jquery used by latest wordpress</li>\n</ul>\n<h4>1.3.19</h4>\n<ul>\n<li>fixed problem with random numbers in prefix when set on download.</li>\n<li>improved view of permissions page on small screens.</li>\n</ul>\n<h4>1.3.18</h4>\n<ul>\n<li>Fixed: admin can&#8217;t edit optional data if it was not entered by the user.</li>\n<li>Fixed: an all-items field is uneditable by the user if used in a prefix applied on upload.</li>\n<li>Fixed: &#8220;all-items&#8221; fields disappear after delete or clear.</li>\n<li>Disabled checking &#8220;Apply to all items&#8221; for image fields in layouts.</li>\n<li>Minor code improvements and changes to help items</li>\n</ul>\n<h4>1.3.17</h4>\n<ul>\n<li>own permission instead of list_users</li>\n<li>minor changes to support WordPress 5.5 and PHP 7.4</li>\n<li>minor code improvements</li>\n</ul>\n<h4>1.3.16</h4>\n<ul>\n<li>Covert entrywizard tables to UTF8 if thwy do not already support it</li>\n<li>Improved handling of invalid characters.</li>\n</ul>\n<h4>1.3.15</h4>\n<ul>\n<li>Automatic opening of webforms</li>\n<li>Allow any field in the prefix if not applying it on upload</li>\n<li>Improved timezone handling to conform with WordPress 5.3 recommendations</li>\n</ul>\n<h4>1.3.14</h4>\n<ul>\n<li>In Manage Items view, allow admin to edit data entered by users.</li>\n<li>In Manage Items view, the larger views seen by clicking on the thumbnails all open in the same window.</li>\n</ul>\n<h4>1.3.13</h4>\n<ul>\n<li>front-end only ready for translation</li>\n<li>option to show title if webform is closed</li>\n<li>optional random number as part of prefix</li>\n<li>fixed possible permission errors on files created</li>\n</ul>\n<h4>1.3.12</h4>\n<ul>\n<li>Allow a checkbox to be required</li>\n<li>If zip files are being created for downloads, show a &#8220;Clean up folders&#8221; option on the webforms page bulk options</li>\n<li>optionally set the text for blank selection in a dropdown</li>\n<li>optionally title, caption, content from entrywizard fields when attaching images to pages</li>\n<li>optionally warn when uploading an image that is not sRGB according to it&#8217;s exif data</li>\n<li>several other minor bugfixes and improvements</li>\n</ul>\n<h4>1.3.11</h4>\n<ul>\n<li>Fixed initial value of no-selection text in a new field</li>\n</ul>\n<h4>1.3.10</h4>\n<ul>\n<li>allow an extra &#8220;tag&#8221; field to be added to an image via a csv upload</li>\n<li>allow setting custom text for the no-selection item in option list</li>\n<li>show a toggle indicator on all postboxes</li>\n<li>css changes that may help with some plugin conflicts</li>\n</ul>\n"
    },
    "short_description": "Uploading by logged-in users of sets of image files and associated data. Administrators design the upload form, and download the images and data.",
    "description": "<p>EntryWizard was developed to cater to the needs of camera club competitions.  In these competitions members may submit multiple images with titles and other data attached.</p>\n<ul>\n<li>\n<p>Administrators use the software to design web forms, asking for information as text inputs and/or drop-down menu items as well as image files.</p>\n</li>\n<li>\n<p>They may set up any number of different &#8220;layouts&#8221; ( specifications of what information to ask for and what limits to enforce ), assigning an identifier to each.</p>\n</li>\n<li>\n<p>Here is <strong>one example</strong> of the sort of rules a layout is able to specify:</p>\n<ul>\n<li>Each image must have:\n<ol>\n<li>a short title;</li>\n<li>a &#8220;Category&#8221;, which must be one of &#8220;Nature&#8221;, &#8220;Photojournalism&#8221;, &#8220;Still Life&#8221; or &#8220;Portrait&#8221;;</li>\n<li>a &#8220;Format&#8221;, which must be one of &#8220;Digital&#8221;, &#8220;Slide&#8221; or &#8220;Print&#8221;</li>\n</ol>\n</li>\n<li>Up to 6 entries may be submitted, each with or without a digital version</li>\n<li>Any image of type &#8220;Digital&#8221; must have an uploaded digital version</li>\n<li>At most 2 of the 6 images may be in the &#8220;Nature&#8221; category.</li>\n<li>The images must be in jpeg format, with maximum dimensions of 1280 x 1024 pixels, longest dimension no less than 900 pixels, and size no greater than 1M.</li>\n</ul>\n</li>\n<li>\n<p>Each webform is given a unique alphanumeric identifier, and this identifier is used within a shortcode to insert the webform in a page or post. Any number of different webforms may be created, and one of the layouts is assigned to each one. Multiple webforms may appear on one page, although currently they have to be submitted individually.</p>\n</li>\n<li>\n<p>Each webform separately may be set as &#8220;open for upload&#8221; or &#8220;closed&#8221;.  If it is open, the shortcode is replaced by the upload form.  If it is closed, the shortcode is replaced by a message saying that the upload is closed.  A closed webform may also be opened temporarily to specified members only, and an open webform may be set to close automatically at a specified time.</p>\n</li>\n<li>\n<p>When items have been uploaded, the administrator may either view the items online, or download them. The downloaded image files may be renamed in various ways.  A spreadsheet (in comma-separated .csv format) showing the uploaded data together with some optional information about the users, may also be downloaded.</p>\n</li>\n<li>\n<p>The uploaded images may be attached to pre-existing pages for display in a gallery.</p>\n</li>\n<li>\n<p>There is a fine-grained permissions system allowing administrators to grant an individual user various levels of control over the webforms and layouts.<br />\nOnly logged-in users may see the webform.</p>\n</li>\n<li>\n<p>Users of this plugin may also be interested in using Flexishow (https://sourceforge.net/projects/flexishow/) to run a slideshow  using the information in the spreadsheet to select the images displayed.</p>\n</li>\n<li>\n<p>EntryWizard has a companion plugin called Ewz-Rating (https://wordpress.org/plugins/ewz-rating/). It is designed for display and online judging of items uploaded via EntryWizard.</p>\n</li>\n</ul>\n<h4>Privacy</h4>\n<p>This plugin does not send any data to external servers. It does store in the wordpress database whatever data is requested in the forms designed by the administrator. Viewing of such data using the plugin&#8217;s shortcodes is always restricted to logged-in users, and is usually further restricted by the administrator.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/entrywizard.1.3.27.zip",
    "upgrade_notice": {
        "1.3.27": "<ul>\n<li>Fix required for new  block themes only.</li>\n</ul>",
        "1.3.26": "<ul>\n<li>Permissions page viewing.</li>\n</ul>",
        "1.3.25": "<ul>\n<li>fixed a problem with auto-opening and auto-closing of new, unsaved webforms.</li>\n</ul>",
        "1.3.24": "<ul>\n<li>Make compatible with PHP7.0. Update not required if you are running PHP7.4</li>\n</ul>",
        "1.3.23": "<ul>\n<li>fixed some error messages in the Permissions section.</li>\n</ul>",
        "1.3.22": "<ul>\n<li>Fixed an issue with multi-line text boxes not displaying properly</li>\n</ul>",
        "1.3.21": "<ul>\n<li>Code cleanup, minor changes to hidden webforms, admin batch upload, admin editing of items.</li>\n</ul>",
        "1.3.20": "<ul>\n<li>fixed issues with random numbers in prefix and with addition of a terminal underscore to filenames.</li>\n</ul>",
        "1.3.19": "<ul>\n<li>fixed problem with random numbers in prefix when set on download.</li>\n</ul>",
        "1.3.18": "<ul>\n<li>Improved handling of all-items fields, several other minor improvements.</li>\n</ul>",
        "1.3.17": "<ul>\n<li>Support WordPress 5.5 and PHP 7.4, grant own permission to see user data.</li>\n</ul>",
        "1.3.16": "<ul>\n<li>Covert entrywizard tables to UTF8 if thwy do not already support it. Improved handling of invalid characters.</li>\n</ul>",
        "1.3.15": "<ul>\n<li>Auto-open, allow any field in  prefix if not applying it on upload</li>\n</ul>",
        "1.3.14": "<ul>\n<li>Improvements in Manage Items admin view.</li>\n</ul>",
        "1.3.13": "<ul>\n<li>front-end translation-ready, random number in prefix, option to show title for closed webform.</li>\n</ul>",
        "1.3.12": "<ul>\n<li>allow required checkboxes, check for sRGB, caption setting when attaching, blank-selection text in dropdown</li>\n</ul>",
        "1.3.11": "<ul>\n<li>Fixed initial value of no-selection text in a new field</li>\n</ul>",
        "1.3.10": "<ul>\n<li>Add an optional extra field to an image, possible resolution of some plugin conflicts.</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/entrywizard/assets/screenshot-1.png?rev=756470",
            "caption": "Setting up the fields for the webform."
        },
        {
            "src": "https://ps.w.org/entrywizard/assets/screenshot-2.png?rev=756472",
            "caption": "The webform in action."
        },
        {
            "src": "https://ps.w.org/entrywizard/assets/screenshot-3.png?rev=756470",
            "caption": "Error message shown to user ( in a recent version of Firefox )."
        },
        {
            "src": "https://ps.w.org/entrywizard/assets/screenshot-4.png?rev=756472",
            "caption": "Downloading the images and spreadsheet."
        }
    ],
    "tags": {
        "camera-club": "camera club",
        "competition": "competition",
        "image": "image",
        "spreadsheet": "spreadsheet",
        "upload": "upload"
    },
    "stable_tag": "1.3.27",
    "versions": {
        "0.9.1": "https://downloads.wordpress.org/plugin/entrywizard.0.9.1.zip",
        "0.9.2": "https://downloads.wordpress.org/plugin/entrywizard.0.9.2.zip",
        "0.9.3": "https://downloads.wordpress.org/plugin/entrywizard.0.9.3.zip",
        "0.9.4": "https://downloads.wordpress.org/plugin/entrywizard.0.9.4.zip",
        "0.9.5": "https://downloads.wordpress.org/plugin/entrywizard.0.9.5.zip",
        "0.9.6": "https://downloads.wordpress.org/plugin/entrywizard.0.9.6.zip",
        "0.9.7": "https://downloads.wordpress.org/plugin/entrywizard.0.9.7.zip",
        "0.9.8": "https://downloads.wordpress.org/plugin/entrywizard.0.9.8.zip",
        "1.0.0": "https://downloads.wordpress.org/plugin/entrywizard.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/entrywizard.1.0.1.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/entrywizard.1.1.0.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/entrywizard.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/entrywizard.1.2.1.zip",
        "1.2.10": "https://downloads.wordpress.org/plugin/entrywizard.1.2.10.zip",
        "1.2.11": "https://downloads.wordpress.org/plugin/entrywizard.1.2.11.zip",
        "1.2.12": "https://downloads.wordpress.org/plugin/entrywizard.1.2.12.zip",
        "1.2.13": "https://downloads.wordpress.org/plugin/entrywizard.1.2.13.zip",
        "1.2.14": "https://downloads.wordpress.org/plugin/entrywizard.1.2.14.zip",
        "1.2.15": "https://downloads.wordpress.org/plugin/entrywizard.1.2.15.zip",
        "1.2.16": "https://downloads.wordpress.org/plugin/entrywizard.1.2.16.zip",
        "1.2.17": "https://downloads.wordpress.org/plugin/entrywizard.1.2.17.zip",
        "1.2.18": "https://downloads.wordpress.org/plugin/entrywizard.1.2.18.zip",
        "1.2.19": "https://downloads.wordpress.org/plugin/entrywizard.1.2.19.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/entrywizard.1.2.2.zip",
        "1.2.20": "https://downloads.wordpress.org/plugin/entrywizard.1.2.20.zip",
        "1.2.21": "https://downloads.wordpress.org/plugin/entrywizard.1.2.21.zip",
        "1.2.22": "https://downloads.wordpress.org/plugin/entrywizard.1.2.22.zip",
        "1.2.23": "https://downloads.wordpress.org/plugin/entrywizard.1.2.23.zip",
        "1.2.24": "https://downloads.wordpress.org/plugin/entrywizard.1.2.24.zip",
        "1.2.25": "https://downloads.wordpress.org/plugin/entrywizard.1.2.25.zip",
        "1.2.26": "https://downloads.wordpress.org/plugin/entrywizard.1.2.26.zip",
        "1.2.27": "https://downloads.wordpress.org/plugin/entrywizard.1.2.27.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/entrywizard.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/entrywizard.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/entrywizard.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/entrywizard.1.2.6.zip",
        "1.2.7": "https://downloads.wordpress.org/plugin/entrywizard.1.2.7.zip",
        "1.2.8": "https://downloads.wordpress.org/plugin/entrywizard.1.2.8.zip",
        "1.2.9": "https://downloads.wordpress.org/plugin/entrywizard.1.2.9.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/entrywizard.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/entrywizard.1.3.1.zip",
        "1.3.10": "https://downloads.wordpress.org/plugin/entrywizard.1.3.10.zip",
        "1.3.11": "https://downloads.wordpress.org/plugin/entrywizard.1.3.11.zip",
        "1.3.12": "https://downloads.wordpress.org/plugin/entrywizard.1.3.12.zip",
        "1.3.13": "https://downloads.wordpress.org/plugin/entrywizard.1.3.13.zip",
        "1.3.14": "https://downloads.wordpress.org/plugin/entrywizard.1.3.14.zip",
        "1.3.15": "https://downloads.wordpress.org/plugin/entrywizard.1.3.15.zip",
        "1.3.16": "https://downloads.wordpress.org/plugin/entrywizard.1.3.16.zip",
        "1.3.17": "https://downloads.wordpress.org/plugin/entrywizard.1.3.17.zip",
        "1.3.18": "https://downloads.wordpress.org/plugin/entrywizard.1.3.18.zip",
        "1.3.19": "https://downloads.wordpress.org/plugin/entrywizard.1.3.19.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/entrywizard.1.3.2.zip",
        "1.3.20": "https://downloads.wordpress.org/plugin/entrywizard.1.3.20.zip",
        "1.3.21": "https://downloads.wordpress.org/plugin/entrywizard.1.3.21.zip",
        "1.3.22": "https://downloads.wordpress.org/plugin/entrywizard.1.3.22.zip",
        "1.3.23": "https://downloads.wordpress.org/plugin/entrywizard.1.3.23.zip",
        "1.3.24": "https://downloads.wordpress.org/plugin/entrywizard.1.3.24.zip",
        "1.3.25": "https://downloads.wordpress.org/plugin/entrywizard.1.3.25.zip",
        "1.3.26": "https://downloads.wordpress.org/plugin/entrywizard.1.3.26.zip",
        "1.3.27": "https://downloads.wordpress.org/plugin/entrywizard.1.3.27.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/entrywizard.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/entrywizard.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/entrywizard.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/entrywizard.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/entrywizard.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/entrywizard.1.3.8.zip",
        "1.3.9": "https://downloads.wordpress.org/plugin/entrywizard.1.3.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/entrywizard.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/entrywizard.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}