{
    "name": "Event Tickets with Ticket Scanner",
    "slug": "event-tickets-with-ticket-scanner",
    "version": "2.3.10",
    "author": "<a href=\"https://vollstart.com\">Saso Nikolov</a>",
    "author_profile": "https://profiles.wordpress.org/sasonikolov/",
    "contributors": {
        "sasonikolov": {
            "profile": "https://profiles.wordpress.org/sasonikolov/",
            "avatar": "https://secure.gravatar.com/avatar/55bd4476786f4c78e024ed96ee8914bb?s=96&d=monsterid&r=g",
            "display_name": "Saso"
        }
    },
    "requires": false,
    "tested": "6.6.1",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 18,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 18,
    "support_url": "https://wordpress.org/support/plugin/event-tickets-with-ticket-scanner/",
    "support_threads": 5,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 40230,
    "last_updated": "2024-08-14 17:57:00",
    "added": "2022-08-05",
    "homepage": "https://vollstart.com/event-tickets-with-ticket-scanner/docs/",
    "sections": {
        "description": "<p>Selling event or party tickets, member entrance with any expiration date, multipass tickets, family tickets and more. Selling different kind of tickets and redeeming them was never so easy.<br />\nOptional create your own ticket look and feel with the ticket designer. The built-in anti-double-redeem-protection protects you for fake tickets beeing used.<br />\nUse the built-in browser-based ticket scanner or your own ticket scanner. Hand out badges as PDF to your customers and much more.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/uWSdKdOyn70?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><a href=\"https://youtu.be/KKLp1Lwqj_U\" rel=\"nofollow ugc\">Whats in for you</a></p>\n<p>Sell tickets for your event or party and redeem the ticket at the entrance with the free Tickets with WooCommerce plugin, from the team behind the Serial Code Validator in WordPress.</p>\n<p>You can make your tickets look unique by adding a banner, logo and background image. The same applies also for the event or party flyer.<br />\nYou can offer event badges for your event. So your customer can wear them during the event. With the badge editor you can controll the look and fell.</p>\n<p>The QR code on the ticket can be customized, so that you can use your own ticket scanner and software if needed.<br />\nYour third party solution can be informed once a ticket is redeemed by a webhook.<br />\nYou can give other person access to your ticket scanner with Auth Token System.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/KKLp1Lwqj_U?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><a href=\"https://youtu.be/KKLp1Lwqj_U\" rel=\"nofollow ugc\">Quick start video</a></p>\n<p>This plugin makes it easy to sell tickets and redeem them at the event location entrance for you in-person or virtual events. It integrates easely with your WooCommerce products.</p>\n<p>Install the plugin and set your products to be a event ticket product. That&#8217;s it.</p>\n<p>The plugin will generate a secure ticket number and add them to the mail to your clients. It will also generate a PDF with the ticket information and QR code. The built-in ticket scanner allows you and your team to redeem the tickets by scanning the QR-code. You can also use an external keyboard scanner by using the text input field on the ticket scanner page.</p>\n<p>You can even import your own ticket numbers, but it will generate them also on the fly. The freedom is in your hands.</p>\n<p>The best is to try it out. So many options. Don&#8217;t be shy, give it a try &#8211; you have nothing to loose 😀</p>\n<p><strong>Shop:</strong> Sell event and party tickets with your normal products. The plugin will create the ticket number on the fly or use unused ticket numbers from your ticket number list for each sold item.</p>\n<p><strong>Validation of ticket numbers:</strong> You customer can validate a ticket number on your page. The ticket number generator gives you a flexible pattern to generate ticket numbers upfront. You can also <strong>import your existing codes</strong>.</p>\n<p><strong>Validation of tickets:</strong> You customer will get a link to a detail page and a PDF for each sold ticket.</p>\n<p><strong>Build your own stolen ticket number database:</strong> Support your customer and yourself to protect stolen ticket numbers to be sold or used to others. Mark reported ticket numbers as stolen and let others check the ticket numbers with the ticket number validator.</p>\n<p><strong>How can you setup the ticket numbers?</strong><br />\nThe ticket numbers will be generated by the plugin automatically, if you do not set up ticket numbers upfront.<br />\nYou can enter your ticket numbers within the WP admin area in the ticket number section (a new menu point in the wordpress amdin area).<br />\nYou can generate your own ticket numbers manually using the ticket number generator or import existing ticket numbers.<br />\nAnd you are also able to add your own ticket numbers by just entering them to the generated ticket numbers below the ticket number generator.<br />\nIf needed you can assign the ticket (numbers) to a list which helps you to organize the tickets. The ticket list need to be assigned to a WooCommerce product.<br />\nCreate one or more ticket lists to use the WooCommerce functionality.<br />\nCreate bundle products &#8211; determine how many ticket numbers should be created with the sale of one product.</p>\n<p><strong>How the ticket number works</strong><br />\nYou define your look and feel for your ticket numbers. The generated ticket numbers will be unique. After you are satisfied with the generated ticket numbers, you can start the adding step.<br />\nThe ticket adding step will check if the ticket number is unique on the server before adding it.<br />\nIf the ticket number exists already on the server, it will not be added.</p>\n<h4>The ticket number generator provides a lot of features:</h4>\n<ul>\n<li>Ticket number prefix &#8211; you can enter a fixed prefix to each ticket number</li>\n<li>Length of ticket number</li>\n<li>Only letters</li>\n<li>Uppercase, Lowercase or both</li>\n<li>Exclusion of letters that are easy to missread (i,l,o,q,p)</li>\n<li>Delimiter possible: [None, -, :, SPACE] &#8211; you decide after how many letters within the ticket number</li>\n<li>CVV code generation (only numbers)</li>\n</ul>\n<p>Yes, this is a fork of the serial code validator plugin. We decided to make it an own plugin out of it. So to add more and more features that are not related to serial codes but to event tickets.</p>\n<h3>Features</h3>\n<p>At the bottom of this page you will find a complete list of all features.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ls_Lkf08n9I?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<ul>\n<li>Sell event tickets as PDF with WooCommerce</li>\n<li>Single entrance, mulitpass, family pass, member card with expiration date and more</li>\n<li>Add QR, tickets, badges, additional PDF pages to the purchase order emails.</li>\n<li>Download PDF of ticket to print it as a badge for your customers</li>\n<li>Attach your own PDF to the ticket PDF (will be added as additional pages)</li>\n<li>Also for professional usage &#8211; use your QR and barcode scanner to verify the tickets</li>\n<li>WooCommerce product variants supported</li>\n<li>Generate flyer for your party or event</li>\n<li>Redeem event tickets at the entrance using the included ticket scanner page (mobile ready)</li>\n<li>Add ICS calendar file or a ticket to the purhcase email and ticket detail page</li>\n<li>Store WooCommerce orderid, itemid and productid to a ticket that was generated or used for a product sale</li>\n<li>You can now set a unique ticket number format for all WooCommerce product that are using a ticket number</li>\n<li>You can now set the ticket number format directly also on the WooCommerce product detail page if needed</li>\n<li>Use your codes to restrict purchases that allow a purchase of this product only if the buyer has a code for it (purchase allowance code)</li>\n<li>Add your own messages for the ticket number validation form for your customers</li>\n<li>Add your own message for the &#8220;product stolen&#8221; validation message</li>\n<li>Disable the validation form for not logged in wordpress user</li>\n<li>User can register to a ticket (with the wordpress user id if needed) after the ticket number is checked &#8211; this makes your code one-time usable</li>\n<li>Display registered user information of a ticket number during the validation if you need this</li>\n<li>One time check can have a maximum check amount based on ticket list or based on the global settings</li>\n<li>The user can be forwared (redirected) to an URL after the ticket number was checked &#8211; to show more details</li>\n<li>Webhooks &#8211; you can inform other systems about ticket redeemed status and validation steps</li>\n<li>Display assigned tickets to your user with a shortcode [sasoEventTickets_code]</li>\n<li>Add images to the ticket (header, background and Footer)</li>\n<li>Adopt font size for the PDF ticket</li>\n<li>Forcing responsive design for the ticket scanner for better experience</li>\n<li>Allow multiple redeem times for multi usage tickets</li>\n<li>Ticket badge designer for maximum control of the look and feel</li>\n</ul>\n<h3>GETTING STARTED</h3>\n<p>A Quick start is shown in this <a href=\"https://vollstart.com/event-tickets-with-ticket-scanner/docs/#quickstart\" rel=\"nofollow ugc\">video</a>.<br />\nA good first start is to open the event ticket admin area and create a list first, if not already done or if you do not want to use the default ticket list.<br />\nGo to your WooCommerce product and activate the ticket sale option and set the list.<br />\nCheck out all the possible options in the event ticket admin area to understand, how to tweak your usages of plugin.<br />\nOptional: Then add your ticket number by importing (add button at the ticket table) or assign the ticket list to your products.<br />\nOptional: If you need a validation form for your users, to check the ticket number, then please add the shortcode <strong>[sasoEventTicketsValidator]</strong> to a page.</p>\n<h4>Steps to start</h4>\n<ul>\n<li>Go to the admin area and click on menu &#8220;Event Tickets&#8221;.</li>\n<li>Click on button &#8220;Add&#8221; next to the heading &#8220;List&#8221;.</li>\n<li>Go to your &#8220;ticket&#8221; product and set the option with in the product settings &#8220;Event Tickets&#8221;<br />\n<em>To scan the QR code of the sold tickets at the entrance:</em></li>\n<li>Go to the admin area and click on menu &#8220;Event Tickets&#8221;.</li>\n<li>Click on the button &#8220;Ticket Scanner&#8221; at the top area</li>\n<li>Scan tickets and redeem them</li>\n</ul>\n<p>Try it out first, before you go Premium! <a href=\"https://vollstart.com/event-tickets-with-ticket-scanner\" rel=\"nofollow ugc\">&#8220;Here you can find the premium plugin&#8221;</a>.</p>\n<h3>Build your own Stolen products database</h3>\n<p>You can set the status of a ticket number to be marked as stolen. This way you can offer your customers a way to report a stolen product. Other buyers of used products can validate the ticket number on your website and will be notified with a &#8220;Product is stolen&#8221; warning.<br />\nThis could increase sales and help reducing theft of your products.<br />\nThe check behaviour will be like &#8220;inactive codes&#8221; but with the stolen message. You can change the stolen message within the options area of the serial code admin.</p>\n<h3>Protection with CVV</h3>\n<p>You can set a code verification value (CVV) to protect your tickets. The validation check will ask the user to enter both for a valid check.<br />\nThat way you increase the security of your ticket numbers and prevent stealing the numbers (If you are able hide the CVV on your packaging).<br />\nIf you use a CVV on a ticket number, then the user will be asked to enter this CVV too during the validation. If the CVV on your ticket number is not set or empty it will be ignored and your customer is not asked for it.</p>\n<h3>Woocommerce support for auto-generating tickets</h3>\n<p><strong>Supports version 6+</strong><br />\n<strong>You can use this plugin to auto-generate tickets and codes for your woocommerce products</strong><br />\n* Create a code list<br />\n* Go to your WooCommerce product and edit the product which should receive a ticket<br />\n* Go to your WooCommerce product and edit the product which should receive a code &#8211; if needed<br />\n* Click on &#8220;Event Tickets&#8221; in the attribute area of your product<br />\n* Choose the &#8220;List&#8221; that will be used for this product</p>\n<p>Everytime this product is sold, it will get a new generated ticket number/code or use an unused one within your list (This need to be activated within the option settings). The new code will be added to the code list you set on your WooCommerce product and to the product sale too.<br />\nIf the sold product quantity in the order is more than 1, then a ticket number/code will be generated for each element. The code will be generated after the purchase. In case of a refund the code will be recovered and marked as unused, so that it can be reused.</p>\n<p><em>E.g.: Your customer bought 2 of the same product within one order, then 2 tickets will be generated and stored to the product item within this order.</em></p>\n<h4>WooCommerce Ticket Features</h4>\n<ul>\n<li>Automatically create and assign tickets for physical products and digital products</li>\n<li>Recover tickets assigned to refunded orders</li>\n<li>Option to reuse the recovered tickets with the latest orders</li>\n<li>Automatically deliver the tickets with the complete order email</li>\n<li>Automatically a ticket as PDF for download and add the download link to the complete order email.</li>\n<li>Automatically deliver the tickets and download URL with the optional PDF invoice &#8220;WooCommerce PDF Invoices&#8221;</li>\n<li>Download a flyer for your event or party</li>\n</ul>\n<h4>WooCommerce Code Features</h4>\n<ul>\n<li>Automatically create and assign codes for physical products and digital products</li>\n<li>Recover code assigned to refunded orders</li>\n<li>Option to reuse the recovered codes with the latest orders</li>\n<li>Automatically deliver the codes with the complete order email</li>\n<li>Automatically deliver the codes with the optional PDF invoice &#8220;WooCommerce PDF Invoices&#8221;</li>\n</ul>\n<p><strong>Please note:</strong><br />\nIf you exceed your limit (<em>no limits for premium user</em>) of the amount of possible tickets/codes, then the ticket/code added to the sold product will be a text information: <strong>&#8220;Please contact our support for the code&#8221;</strong>.<br />\nThis way your business is not harmed and your customer can contact you to get a code manually. The format of the code will be <strong>12345-12345-12345-12345</strong> if you do not set a generation format within the options.</p>\n<h3>WooCommerce PDF Invoices support to display the ticket numbers on the PDFs</h3>\n<p>If you use <a href=\"https://en-gb.wordpress.org/plugins/woocommerce-pdf-invoices-packing-slips/\" rel=\"nofollow ugc\">&#8220;WooCommerce PDF Invoices&#8221;</a>, then the generated ticket numbers/codes are displayed on the generated PDFs too!<br />\nThe supported PDF plugin is from Ewout Fernhout.</p>\n<h3>WooCommer Ticket Sale</h3>\n<p>You can add a list to your product and sell tickets. The ticket will be added to the sale informations for you and your client.<br />\nThe client will also have a link to check the ticket and mark the ticket as used, only if the order is set to completed. This will mark the ticket as redeemed.<br />\nYou can check the entrance by letting your customer show the confirmation page and hit on the &#8220;redeem&#8221;-button.<br />\nOr you scan the QR code of the ticket with the ticket scanner (included). The ticket is also available as PDF for download to your customers.<br />\n<a href=\"https://vollstart.com/event-tickets-with-ticket-scanner/docs/#ticket\" rel=\"nofollow ugc\">Checkout the video, how it works</a></p>\n<h3>Frontend</h3>\n<p>We have different frontend elements. Just to sell tickets and scan them, you do not need to add any shortcodes to your pages.</p>\n<h4>Frontend event tickets</h4>\n<p>Your customer will receive a specific URL to the ticket detail page. You can control which information to display. additional they can download the ticket as a PDF.<br />\nThe ticket will contain a QR code, that can be scanned by you or your team (no loggin to WordPress needed) and redeem the ticket.<br />\n<a href=\"https://vollstart.com/event-tickets-with-ticket-scanner/docs/#quickstart\" rel=\"nofollow ugc\">Watch the video for it</a></p>\n<h4>Frontent to validate the ticket number</h4>\n<ul>\n<li>Use the shortcode <strong>[sasoEventTicketsValidator]</strong></li>\n<li>Create a page or use an existing one and add the shortcode to the page</li>\n<li>The shortcode will be replaced for your users by a form to enter the ticket number and a button to validate the ticket. This allows you to surround the form with your own heading and instruction.</li>\n<li>Each ticket number has a display version (e.g. XYZXYZ -&gt; XYZ-XYZ), so it is easier for your user to read the ticket number.</li>\n<li>The check will remove the display delimiter &#8220;-&#8220;, &#8220;:&#8221;, &#8221; &#8221; for the check automatically.</li>\n<li>So your user can enter the ticket number with or without delimiters.</li>\n</ul>\n<p>If you use CVV on a code and the user enter the ticket number that requires a cvv, then your user will be ask to enter the CVV.<br />\nThe user could enter the CVV immediately with the code. Separate the value with a &#8220;:&#8221;. E.g: XYZXYZ:1234.</p>\n<p>&hellip;</p>\n",
        "installation": "<ul>\n<li>WordPress 5.0 or greater</li>\n<li>PHP version 7.0 or greater</li>\n<li>MySQL version 5.0 or greater</li>\n</ul>\n<h4>Installation</h4>\n<ol>\n<li>Install the pluging using the WordPress built-in Plugin installer.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress.</li>\n<li>Click on the menu &#8220;Event Tickets&#8221; and browse the options &#8211; optional.</li>\n<li>Edit your product to generate a event ticket.</li>\n</ol>\n<h4>Quick Setup</h4>\n<p>This plugin extend WooCommerce to be able to setup your product as a ticket. Go to the product. Open the Event Tickets tab and activate the checkbox. Set the ticket list and fill out the other details if needed.<br />\nThe default is to generate the ticket if the order is &#8220;completed&#8221;. For automatically order status set to &#8220;completed&#8221; set up the ticket as a virtual product and/or download product &#8211; add a flyer or so as a download.<br />\nTo test the ticket. Create an order within the order backend, set the order status to &#8220;completed&#8221; &#8211; this will assign the ticket numbers. Check the order email. Click on the ticket detail link to check the ticket detail page.<br />\nCreate a real test purchase (with coupon code or wire transfer), check the order email.<br />\nIf you have a 404 page for ticket detail page or ticket scanner page, then set up the compatibility options.</p>\n<p><strong>For more help and your first steps, please <a href=\"https://vollstart.com/event-tickets-with-ticket-scanner/docs/\" rel=\"nofollow ugc\">visit our website</a></strong></p>\n",
        "changelog": "<h4>2.3.10 &#8211; 2024-08-14</h4>\n<ul>\n<li>Fix max redeem amount display after the redeem operation within the admin backend</li>\n<li>Add ACF support for the TWIG editor &#8211; you can use get_field to retrieve ACF field values</li>\n<li>Changed the default value for option wcTicketPDFStripHTML to remove unsupported HTML &#8211; it caused too many issues with new users</li>\n<li>Adopt the way the file location of the images for PDFs are adjusted. It will now use the URL as fallback if the file location cannot be accessed</li>\n<li>Fix ticket display view for the reload option</li>\n<li>Fix the expiration message on the ticket detail view</li>\n<li>Fix expiration check on the redeem operation and ticket scanner</li>\n</ul>\n<h4>2.3.9 &#8211; 2024-07-31</h4>\n<ul>\n<li>Adjustment of the twig ticket templates &#8211; not using the date check but a new ticket property &#8220;is_event_over&#8221;</li>\n<li>Add new ticket property for twig editor to provide the premium value for expiration &#8220;is_expired&#8221;</li>\n<li>Bug fix for the redeem time check on the ticket scanner &#8211; I know again, and I am very sorry</li>\n<li>Added check for user redeem operation for event already ended option</li>\n<li>Bug fix for the redeem button on the ticket view for your customer. It will be not shown after the event ended</li>\n<li>Using now the woocommerce date format to display the event date and time on the product view</li>\n<li>Added the check for the redeem button on the ticket detail view, so that it cannot be self-redeemed before the start and its offset &#8211; if activated</li>\n<li>Added new properties to the ticket variable for the twig template editor</li>\n<li>Added hidden option for the ticket scanner to display the times from the server and product. Attache to the URL the parameter &#8220;displaytime&#8221; if needed</li>\n<li>Small fix for the auth name display &#8211; removing HTML tags from the name</li>\n<li>Extended the shortcode for my codes. You can now add the shortcode with parameter, to get the objects as json. Then you can use own Javascript code to display the values. More about it at the bottom of the admin page.</li>\n</ul>\n<h4>2.3.8 &#8211; 2024-07-17</h4>\n<ul>\n<li>Bug fix for XSS on the auth token name and description</li>\n</ul>\n<h4>2.3.7 &#8211; 2024-07-09</h4>\n<ul>\n<li>Adjusted the text for width and height description</li>\n<li>Bug fix for customer name search &#8211; if the name do not match then no tickets are returned</li>\n<li>Small optical improvements</li>\n</ul>\n<h4>2.3.6 &#8211; 2024-06-19</h4>\n<ul>\n<li>Adjustment to make the access to the admin page working according to the choosen role and not rights. But the acces right &#8220;read&#8221; is needed.</li>\n<li>Enhanced the search for tickets. You add now a text search value if you filter for a ticket list or other information.</li>\n<li>Force the text color for headings on the ticket scanner to use the assigned color and not use the CSS information, so that the information can be read even if you theme design is dark</li>\n<li>Bug fix for option wcTicketSetOrderToCompleteIfAllOrderItemsAreTickets &#8211; it will not overwrite the item_id and item in the function anymore &#8211; resulted in the wrong ticket number in the email</li>\n</ul>\n<h4>2.3.5 &#8211; 2024-05-27</h4>\n<ul>\n<li>Fix domain to the new domain vollstart.com</li>\n<li>Bug fix for the user role access to the admin area</li>\n<li>Bug fix auth token redeem operation with one ticket number and/or variant products</li>\n<li>Removed small typos in the option area</li>\n</ul>\n<h4>2.3.4 &#8211; 2024-05-20</h4>\n<ul>\n<li>Fixed the deprecated warning for the float conversion to int on the PDF library</li>\n<li>Fixed the auth token QR code content for the one with ticket scanner URL</li>\n<li>Fix for the attachment error with PHP8</li>\n<li>Revert new behaviour for the input fields at the cart &#8211; not stored automatically again &#8211; till the issues are fixed</li>\n</ul>\n<h4>2.3.3 &#8211; 2024-05-14</h4>\n<ul>\n<li>Fix bug for option wcTicketUserProfileDisplayBoughtNumbers</li>\n<li>Fix bug to display only the price of one item to the ticket instead the sum of order item &#8211; what is wrong if you purchase more than 1 of the same item</li>\n<li>FAQ entry added &#8211; for own ticket scanner with full URL in QR code</li>\n<li>Auth code QR code is using now the full qualified URL to the ticket scanner</li>\n<li>Fix the ticket badge creation null pointer exception</li>\n<li>Added auto save for text inputs on the cart</li>\n<li>Added useful video links for use cases and which option could be helpful</li>\n</ul>\n<h4>2.3.2 &#8211; 2024-05-07</h4>\n<ul>\n<li>Order view is not showning empty name or dropdown value anymore to prevent confusion</li>\n<li>Order view is not showning the location prefix anymore if the location value is empty</li>\n<li>Order view is shown captured value or dropwdown value in seperated lines if both are filled out</li>\n<li>Default end time 23:59 will not be shown anymore if no start time was added</li>\n<li>Bug fix for wcTicketSetOrderToCompleteIfAllOrderItemsAreTickets. Now only orders in processing are set to completed, if all products are tickets</li>\n<li>Bug fix for the missing customer name on the tickets table view</li>\n<li>Bug fix for ticket scanner url within the QR code with option ticketQRUseURLToTicketScanner</li>\n<li>Warning: Bug fix for the QR code with url to the ticket scanner &#8211; the template was adjusted. The code {{ TICKET.qrCodeContent|escape(&#8216;html_attr&#8217;)|raw }} is now {{ TICKET.qrCodeContent|raw }}</li>\n<li>The order view qr code is also evaluating now the option ticketQRUseURLToTicketScanner</li>\n<li>The QR code images for the email attachments are now also evaluating the option ticketQRUseURLToTicketScanner</li>\n</ul>\n<h4>2.3.1 &#8211; 2024-04-30</h4>\n<ul>\n<li>Bug fix for removing tickets from refunded orders</li>\n<li>Bug fix for non existing date while creating ICS file to be attached to email &#8211; log entry removed if date is missing</li>\n</ul>\n<h4>2.3.0 &#8211; 2024-04-22</h4>\n<ul>\n<li>Bug fix for mixed up options wcTicketDisplayProductAddons and wcTicketDisplayProductAddons</li>\n<li>Added option to display the addons of a product &#8211; wcTicketDisplayProductAddons</li>\n<li>Bug fix for the validator if the option value is missing</li>\n<li>New FAQ entry added &#8211; How to display meta information of the purchased item?</li>\n<li>Added a lot of filter and action hooks for implementation partners and plugin developers</li>\n<li>Moved premium feature wcTicketAddToOrderOnlyWithOrderStatus to premium plugin</li>\n<li>New option to set the error message for the missing user value and dropdown &#8211; wcTicketLabelCartForName, wcTicketLabelCartForValue</li>\n</ul>\n"
    },
    "short_description": "Selling event or party tickets, member entrance with any expiration date, multipass tickets, family tickets and more. Selling different kind of ticket &hellip;",
    "description": "<p>Selling event or party tickets, member entrance with any expiration date, multipass tickets, family tickets and more. Selling different kind of tickets and redeeming them was never so easy.<br />\nOptional create your own ticket look and feel with the ticket designer. The built-in anti-double-redeem-protection protects you for fake tickets beeing used.<br />\nUse the built-in browser-based ticket scanner or your own ticket scanner. Hand out badges as PDF to your customers and much more.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/uWSdKdOyn70?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><a href=\"https://youtu.be/KKLp1Lwqj_U\" rel=\"nofollow ugc\">Whats in for you</a></p>\n<p>Sell tickets for your event or party and redeem the ticket at the entrance with the free Tickets with WooCommerce plugin, from the team behind the Serial Code Validator in WordPress.</p>\n<p>You can make your tickets look unique by adding a banner, logo and background image. The same applies also for the event or party flyer.<br />\nYou can offer event badges for your event. So your customer can wear them during the event. With the badge editor you can controll the look and fell.</p>\n<p>The QR code on the ticket can be customized, so that you can use your own ticket scanner and software if needed.<br />\nYour third party solution can be informed once a ticket is redeemed by a webhook.<br />\nYou can give other person access to your ticket scanner with Auth Token System.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/KKLp1Lwqj_U?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><a href=\"https://youtu.be/KKLp1Lwqj_U\" rel=\"nofollow ugc\">Quick start video</a></p>\n<p>This plugin makes it easy to sell tickets and redeem them at the event location entrance for you in-person or virtual events. It integrates easely with your WooCommerce products.</p>\n<p>Install the plugin and set your products to be a event ticket product. That&#8217;s it.</p>\n<p>The plugin will generate a secure ticket number and add them to the mail to your clients. It will also generate a PDF with the ticket information and QR code. The built-in ticket scanner allows you and your team to redeem the tickets by scanning the QR-code. You can also use an external keyboard scanner by using the text input field on the ticket scanner page.</p>\n<p>You can even import your own ticket numbers, but it will generate them also on the fly. The freedom is in your hands.</p>\n<p>The best is to try it out. So many options. Don&#8217;t be shy, give it a try &#8211; you have nothing to loose 😀</p>\n<p><strong>Shop:</strong> Sell event and party tickets with your normal products. The plugin will create the ticket number on the fly or use unused ticket numbers from your ticket number list for each sold item.</p>\n<p><strong>Validation of ticket numbers:</strong> You customer can validate a ticket number on your page. The ticket number generator gives you a flexible pattern to generate ticket numbers upfront. You can also <strong>import your existing codes</strong>.</p>\n<p><strong>Validation of tickets:</strong> You customer will get a link to a detail page and a PDF for each sold ticket.</p>\n<p><strong>Build your own stolen ticket number database:</strong> Support your customer and yourself to protect stolen ticket numbers to be sold or used to others. Mark reported ticket numbers as stolen and let others check the ticket numbers with the ticket number validator.</p>\n<p><strong>How can you setup the ticket numbers?</strong><br />\nThe ticket numbers will be generated by the plugin automatically, if you do not set up ticket numbers upfront.<br />\nYou can enter your ticket numbers within the WP admin area in the ticket number section (a new menu point in the wordpress amdin area).<br />\nYou can generate your own ticket numbers manually using the ticket number generator or import existing ticket numbers.<br />\nAnd you are also able to add your own ticket numbers by just entering them to the generated ticket numbers below the ticket number generator.<br />\nIf needed you can assign the ticket (numbers) to a list which helps you to organize the tickets. The ticket list need to be assigned to a WooCommerce product.<br />\nCreate one or more ticket lists to use the WooCommerce functionality.<br />\nCreate bundle products &#8211; determine how many ticket numbers should be created with the sale of one product.</p>\n<p><strong>How the ticket number works</strong><br />\nYou define your look and feel for your ticket numbers. The generated ticket numbers will be unique. After you are satisfied with the generated ticket numbers, you can start the adding step.<br />\nThe ticket adding step will check if the ticket number is unique on the server before adding it.<br />\nIf the ticket number exists already on the server, it will not be added.</p>\n<h4>The ticket number generator provides a lot of features:</h4>\n<ul>\n<li>Ticket number prefix &#8211; you can enter a fixed prefix to each ticket number</li>\n<li>Length of ticket number</li>\n<li>Only letters</li>\n<li>Uppercase, Lowercase or both</li>\n<li>Exclusion of letters that are easy to missread (i,l,o,q,p)</li>\n<li>Delimiter possible: [None, -, :, SPACE] &#8211; you decide after how many letters within the ticket number</li>\n<li>CVV code generation (only numbers)</li>\n</ul>\n<p>Yes, this is a fork of the serial code validator plugin. We decided to make it an own plugin out of it. So to add more and more features that are not related to serial codes but to event tickets.</p>\n<h3>Features</h3>\n<p>At the bottom of this page you will find a complete list of all features.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ls_Lkf08n9I?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<ul>\n<li>Sell event tickets as PDF with WooCommerce</li>\n<li>Single entrance, mulitpass, family pass, member card with expiration date and more</li>\n<li>Add QR, tickets, badges, additional PDF pages to the purchase order emails.</li>\n<li>Download PDF of ticket to print it as a badge for your customers</li>\n<li>Attach your own PDF to the ticket PDF (will be added as additional pages)</li>\n<li>Also for professional usage &#8211; use your QR and barcode scanner to verify the tickets</li>\n<li>WooCommerce product variants supported</li>\n<li>Generate flyer for your party or event</li>\n<li>Redeem event tickets at the entrance using the included ticket scanner page (mobile ready)</li>\n<li>Add ICS calendar file or a ticket to the purhcase email and ticket detail page</li>\n<li>Store WooCommerce orderid, itemid and productid to a ticket that was generated or used for a product sale</li>\n<li>You can now set a unique ticket number format for all WooCommerce product that are using a ticket number</li>\n<li>You can now set the ticket number format directly also on the WooCommerce product detail page if needed</li>\n<li>Use your codes to restrict purchases that allow a purchase of this product only if the buyer has a code for it (purchase allowance code)</li>\n<li>Add your own messages for the ticket number validation form for your customers</li>\n<li>Add your own message for the &#8220;product stolen&#8221; validation message</li>\n<li>Disable the validation form for not logged in wordpress user</li>\n<li>User can register to a ticket (with the wordpress user id if needed) after the ticket number is checked &#8211; this makes your code one-time usable</li>\n<li>Display registered user information of a ticket number during the validation if you need this</li>\n<li>One time check can have a maximum check amount based on ticket list or based on the global settings</li>\n<li>The user can be forwared (redirected) to an URL after the ticket number was checked &#8211; to show more details</li>\n<li>Webhooks &#8211; you can inform other systems about ticket redeemed status and validation steps</li>\n<li>Display assigned tickets to your user with a shortcode [sasoEventTickets_code]</li>\n<li>Add images to the ticket (header, background and Footer)</li>\n<li>Adopt font size for the PDF ticket</li>\n<li>Forcing responsive design for the ticket scanner for better experience</li>\n<li>Allow multiple redeem times for multi usage tickets</li>\n<li>Ticket badge designer for maximum control of the look and feel</li>\n</ul>\n<h3>GETTING STARTED</h3>\n<p>A Quick start is shown in this <a href=\"https://vollstart.com/event-tickets-with-ticket-scanner/docs/#quickstart\" rel=\"nofollow ugc\">video</a>.<br />\nA good first start is to open the event ticket admin area and create a list first, if not already done or if you do not want to use the default ticket list.<br />\nGo to your WooCommerce product and activate the ticket sale option and set the list.<br />\nCheck out all the possible options in the event ticket admin area to understand, how to tweak your usages of plugin.<br />\nOptional: Then add your ticket number by importing (add button at the ticket table) or assign the ticket list to your products.<br />\nOptional: If you need a validation form for your users, to check the ticket number, then please add the shortcode <strong>[sasoEventTicketsValidator]</strong> to a page.</p>\n<h4>Steps to start</h4>\n<ul>\n<li>Go to the admin area and click on menu &#8220;Event Tickets&#8221;.</li>\n<li>Click on button &#8220;Add&#8221; next to the heading &#8220;List&#8221;.</li>\n<li>Go to your &#8220;ticket&#8221; product and set the option with in the product settings &#8220;Event Tickets&#8221;<br />\n<em>To scan the QR code of the sold tickets at the entrance:</em></li>\n<li>Go to the admin area and click on menu &#8220;Event Tickets&#8221;.</li>\n<li>Click on the button &#8220;Ticket Scanner&#8221; at the top area</li>\n<li>Scan tickets and redeem them</li>\n</ul>\n<p>Try it out first, before you go Premium! <a href=\"https://vollstart.com/event-tickets-with-ticket-scanner\" rel=\"nofollow ugc\">&#8220;Here you can find the premium plugin&#8221;</a>.</p>\n<h3>Build your own Stolen products database</h3>\n<p>You can set the status of a ticket number to be marked as stolen. This way you can offer your customers a way to report a stolen product. Other buyers of used products can validate the ticket number on your website and will be notified with a &#8220;Product is stolen&#8221; warning.<br />\nThis could increase sales and help reducing theft of your products.<br />\nThe check behaviour will be like &#8220;inactive codes&#8221; but with the stolen message. You can change the stolen message within the options area of the serial code admin.</p>\n<h3>Protection with CVV</h3>\n<p>You can set a code verification value (CVV) to protect your tickets. The validation check will ask the user to enter both for a valid check.<br />\nThat way you increase the security of your ticket numbers and prevent stealing the numbers (If you are able hide the CVV on your packaging).<br />\nIf you use a CVV on a ticket number, then the user will be asked to enter this CVV too during the validation. If the CVV on your ticket number is not set or empty it will be ignored and your customer is not asked for it.</p>\n<h3>Woocommerce support for auto-generating tickets</h3>\n<p><strong>Supports version 6+</strong><br />\n<strong>You can use this plugin to auto-generate tickets and codes for your woocommerce products</strong><br />\n* Create a code list<br />\n* Go to your WooCommerce product and edit the product which should receive a ticket<br />\n* Go to your WooCommerce product and edit the product which should receive a code &#8211; if needed<br />\n* Click on &#8220;Event Tickets&#8221; in the attribute area of your product<br />\n* Choose the &#8220;List&#8221; that will be used for this product</p>\n<p>Everytime this product is sold, it will get a new generated ticket number/code or use an unused one within your list (This need to be activated within the option settings). The new code will be added to the code list you set on your WooCommerce product and to the product sale too.<br />\nIf the sold product quantity in the order is more than 1, then a ticket number/code will be generated for each element. The code will be generated after the purchase. In case of a refund the code will be recovered and marked as unused, so that it can be reused.</p>\n<p><em>E.g.: Your customer bought 2 of the same product within one order, then 2 tickets will be generated and stored to the product item within this order.</em></p>\n<h4>WooCommerce Ticket Features</h4>\n<ul>\n<li>Automatically create and assign tickets for physical products and digital products</li>\n<li>Recover tickets assigned to refunded orders</li>\n<li>Option to reuse the recovered tickets with the latest orders</li>\n<li>Automatically deliver the tickets with the complete order email</li>\n<li>Automatically a ticket as PDF for download and add the download link to the complete order email.</li>\n<li>Automatically deliver the tickets and download URL with the optional PDF invoice &#8220;WooCommerce PDF Invoices&#8221;</li>\n<li>Download a flyer for your event or party</li>\n</ul>\n<h4>WooCommerce Code Features</h4>\n<ul>\n<li>Automatically create and assign codes for physical products and digital products</li>\n<li>Recover code assigned to refunded orders</li>\n<li>Option to reuse the recovered codes with the latest orders</li>\n<li>Automatically deliver the codes with the complete order email</li>\n<li>Automatically deliver the codes with the optional PDF invoice &#8220;WooCommerce PDF Invoices&#8221;</li>\n</ul>\n<p><strong>Please note:</strong><br />\nIf you exceed your limit (<em>no limits for premium user</em>) of the amount of possible tickets/codes, then the ticket/code added to the sold product will be a text information: <strong>&#8220;Please contact our support for the code&#8221;</strong>.<br />\nThis way your business is not harmed and your customer can contact you to get a code manually. The format of the code will be <strong>12345-12345-12345-12345</strong> if you do not set a generation format within the options.</p>\n<h3>WooCommerce PDF Invoices support to display the ticket numbers on the PDFs</h3>\n<p>If you use <a href=\"https://en-gb.wordpress.org/plugins/woocommerce-pdf-invoices-packing-slips/\" rel=\"nofollow ugc\">&#8220;WooCommerce PDF Invoices&#8221;</a>, then the generated ticket numbers/codes are displayed on the generated PDFs too!<br />\nThe supported PDF plugin is from Ewout Fernhout.</p>\n<h3>WooCommer Ticket Sale</h3>\n<p>You can add a list to your product and sell tickets. The ticket will be added to the sale informations for you and your client.<br />\nThe client will also have a link to check the ticket and mark the ticket as used, only if the order is set to completed. This will mark the ticket as redeemed.<br />\nYou can check the entrance by letting your customer show the confirmation page and hit on the &#8220;redeem&#8221;-button.<br />\nOr you scan the QR code of the ticket with the ticket scanner (included). The ticket is also available as PDF for download to your customers.<br />\n<a href=\"https://vollstart.com/event-tickets-with-ticket-scanner/docs/#ticket\" rel=\"nofollow ugc\">Checkout the video, how it works</a></p>\n<h3>Frontend</h3>\n<p>We have different frontend elements. Just to sell tickets and scan them, you do not need to add any shortcodes to your pages.</p>\n<h4>Frontend event tickets</h4>\n<p>Your customer will receive a specific URL to the ticket detail page. You can control which information to display. additional they can download the ticket as a PDF.<br />\nThe ticket will contain a QR code, that can be scanned by you or your team (no loggin to WordPress needed) and redeem the ticket.<br />\n<a href=\"https://vollstart.com/event-tickets-with-ticket-scanner/docs/#quickstart\" rel=\"nofollow ugc\">Watch the video for it</a></p>\n<h4>Frontent to validate the ticket number</h4>\n<ul>\n<li>Use the shortcode <strong>[sasoEventTicketsValidator]</strong></li>\n<li>Create a page or use an existing one and add the shortcode to the page</li>\n<li>The shortcode will be replaced for your users by a form to enter the ticket number and a button to validate the ticket. This allows you to surround the form with your own heading and instruction.</li>\n<li>Each ticket number has a display version (e.g. XYZXYZ -&gt; XYZ-XYZ), so it is easier for your user to read the ticket number.</li>\n<li>The check will remove the display delimiter &#8220;-&#8220;, &#8220;:&#8221;, &#8221; &#8221; for the check automatically.</li>\n<li>So your user can enter the ticket number with or without delimiters.</li>\n</ul>\n<p>If you use CVV on a code and the user enter the ticket number that requires a cvv, then your user will be ask to enter the CVV.<br />\nThe user could enter the CVV immediately with the code. Separate the value with a &#8220;:&#8221;. E.g: XYZXYZ:1234.</p>\n<p>&hellip;</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.zip",
    "upgrade_notice": {
        "2.0.5": "<p>Attention, the option wcTicketShowRedeemBtnOnTicket is added and replace the old wcTicketDontShowRedeemBtnOnTicket.\nThe template for the ticket designer is adjusted for this!\nIn the future the template code part with the buttons will be removed from the ticket designer.</p>",
        "1.3.0": "<p>Attention, the translation forced bigger chunk of code to be changed.</p>",
        "1.2.0": "<p>To update the old sold tickets, please execute the &quot;repair table&quot; button within the support area. From now on we will store also the user id of the ticket purchase.</p>",
        "1.0.11": "<p>Default value is changed to true for the option ro reuse not used ticket numbers within a ticket list assigned to a product</p>",
        "1.0.9": "<p>New option to add the amount of purchased tickets per sold item on the PDF. Database updated. You can see now the redeemed ticket information within the admin area on the data table.</p>",
        "1.0.5": "<p>Serial code options are removed. They do not fit with the event and party tickets approach.</p>",
        "1.0.4": "<p>Activate in the options the new feature to attach the calendar entry (ICS file) to your purchase emails.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/screenshot-1.jpg?rev=2766953",
            "caption": "<strong>Ticket Details Mobile</strong> The ticket details are also optimized for mobile devices."
        },
        {
            "src": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/screenshot-2.jpg?rev=2766953",
            "caption": "<strong>Ticket Details Desktop</strong> You can define what will be shown on the ticket."
        },
        {
            "src": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/screenshot-3.jpg?rev=2766953",
            "caption": "<strong>Ticket PDF</strong> Your customer can download the ticket as a PDF."
        },
        {
            "src": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/screenshot-4.jpg?rev=2908320",
            "caption": "<strong>Ticket scanner</strong> Scan and redeem the tickets at the entrance on mobile and desktop devices."
        },
        {
            "src": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/screenshot-5.jpg?rev=2908320",
            "caption": "<strong>Ticket Badge</strong> Print out your ticket badge with customer name on it."
        },
        {
            "src": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/screenshot-6.jpg?rev=2908320",
            "caption": "<strong>Options 1</strong> Ticket options."
        },
        {
            "src": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/screenshot-7.jpg?rev=2908320",
            "caption": "<strong>Options 3</strong> Created tickets backend admin area."
        },
        {
            "src": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/screenshot-8.jpg?rev=2908320",
            "caption": "<strong>Options 4</strong> Ticket numbers can be pre generated if needed."
        },
        {
            "src": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/screenshot-9.jpg?rev=2771780",
            "caption": "<strong>Flyer example</strong> You can also adjust your event or party flyer."
        },
        {
            "src": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/screenshot-10.jpg?rev=2908320",
            "caption": "<strong>Ticket example</strong> You can adjust different areas of the PDF ticket."
        },
        {
            "src": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/screenshot-11.jpg?rev=2771780",
            "caption": "<strong>Product settings</strong> You overwrite the format of the ticket number and activate the ticket sale."
        },
        {
            "src": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/screenshot-12.jpg?rev=2908320",
            "caption": "<strong>Options 5</strong> Adjust the information on the flyer."
        },
        {
            "src": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/screenshot-13.jpg?rev=2952631",
            "caption": "<strong>Order Ticket Detail View</strong> Quick ticket scan possible with the order ticket detail view."
        }
    ],
    "tags": {
        "event-ticketing": "event ticketing",
        "party-tickets": "party tickets",
        "redeem-tickets": "redeem tickets",
        "ticket-scanner": "ticket scanner",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.5.10": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.1.5.10.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.0.5.zip",
        "2.0.6": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.0.6.zip",
        "2.0.7": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.0.7.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.1.1.zip",
        "2.1.10": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.1.10.zip",
        "2.1.11": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.1.11.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.1.2.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.1.3.zip",
        "2.1.4": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.1.4.zip",
        "2.1.5": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.1.5.zip",
        "2.1.6": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.1.6.zip",
        "2.1.7": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.1.7.zip",
        "2.1.8": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.1.8.zip",
        "2.1.9": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.1.9.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.2.1.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.2.2.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.2.3.zip",
        "2.2.4": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.2.4.zip",
        "2.2.5": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.2.5.zip",
        "2.2.6": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.2.6.zip",
        "2.2.7": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.2.7.zip",
        "2.2.8": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.2.8.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.3.0.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.3.1.zip",
        "2.3.2": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.3.2.zip",
        "2.3.3": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.3.3.zip",
        "2.3.5": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.3.5.zip",
        "2.3.6": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.3.6.zip",
        "2.3.7": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.3.7.zip",
        "2.3.8": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.3.8.zip",
        "2.3.9": "https://downloads.wordpress.org/plugin/event-tickets-with-ticket-scanner.2.3.9.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/banner-772x250.jpg?rev=3093431",
        "high": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/banner-1544x500.jpg?rev=3093431"
    },
    "icons": {
        "1x": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/icon.svg?rev=2935725",
        "svg": "https://ps.w.org/event-tickets-with-ticket-scanner/assets/icon.svg?rev=2935725"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}