{
    "name": "EWZ-Rating",
    "slug": "ewz-rating",
    "version": "1.1.24",
    "author": "Josie Stauffer",
    "author_profile": "https://profiles.wordpress.org/joanne123/",
    "contributors": {
        "joanne123": {
            "profile": "https://profiles.wordpress.org/joanne123/",
            "avatar": "https://secure.gravatar.com/avatar/854f2a59a9c606c3ffa7c821311bd2e7?s=96&d=monsterid&r=g",
            "display_name": "Josie Stauffer"
        }
    },
    "requires": "3.5",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 5,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 5,
    "support_url": "https://wordpress.org/support/plugin/ewz-rating/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 80,
    "downloaded": 4798,
    "last_updated": "2024-04-22 21:53:00",
    "added": "2015-12-06",
    "homepage": "http:",
    "sections": {
        "description": "<p>This plugin requires that the EntryWizard plugin is installed.  It generates forms for displaying and judging images that were uploaded via EntryWizard ( either using its regular individual upload or using its batch entry upload facility ).</p>\n<p>The data displayed in the forms, the judges allowed to see it, and the selection of images shown may all be configured by the administrators.</p>\n<p>Judges may sort the forms by most columns, including any scores they have entered.</p>\n<p>Selected information about each image and/or maker may optionally be displayed in read-only fashion.</p>\n<p>The judges must be logged-in users of the site who have been assigned a special role. Or the administrator may make the images and data visible to all logged-in users, or only to the image owners.</p>\n<h4>Privacy</h4>\n<p>This plugin does not send any data to external servers. It does store in the wordpress database whatever data is requested in the forms designed by the administrator. Viewing of such data using the plugin&#8217;s shortcodes is always restricted to logged-in users, and is usually further restricted by the administrator.</p>\n",
        "installation": "<ul>\n<li>\n<p>Either</p>\n<ul>\n<li>Go to Plugins -&gt; Install New and search for EWZ-Rating.  Click &#8220;Install Now&#8221;.<br />\nOr</li>\n<li>Download and unzip the file into your plugins folder.</li>\n</ul>\n</li>\n<li>\n<p>In the administration area, go to Plugins, look for &#8220;EWZ-Rating&#8221;, and click &#8220;activate&#8221;.</p>\n</li>\n<li>\n<p>The &#8220;Rating Forms&#8221; and &#8220;Rating Schemes&#8221; links should appear on the administration sidebar in the EntryWizard menu.</p>\n</li>\n</ul>\n<h4>Usage</h4>\n<ul>\n<li>\n<p>As with EntryWizard, most inputs in the administration area have popup help displays describing their use.</p>\n</li>\n<li>\n<p>A rating-scheme is quite similar to an EntryWizard layout &#8212; it specifies the format of the form generated by the ewz_show_rating shortcode.</p>\n</li>\n<li>\n<p>Because it may use some of the layout fields for displaying read-only data, each rating-scheme applies to just one layout. Thus to create a rating-scheme you first have to select a layout.</p>\n</li>\n<li>\n<p>A rating-form is analagous to an EntryWizard webform.  It specifies a form to be displayed by the ewz_show_rating shortcode.  For each form, you may specify which images are displayed, and which judges have access.</p>\n</li>\n<li>\n<p>Once the judging is complete, the administrators may download a spreadsheet containing the entered scores/comments in one of two possible forms &#8211; either one line per rating, or one line per image.</p>\n</li>\n<li>\n<p>If needed, further forms for tiebreaking, etc, may be generated that contain only specified images, and are visible only to specified judges.</p>\n</li>\n<li>\n<p>Quickstart for the impatient ( for further details, click on the information buttons ):</p>\n<ol>\n<li>\n<p>Assign the &#8220;EntryWizard Judge&#8221; role to your judges ( it may be helpful to have a plugin installed that allows users to have multiple roles ).</p>\n</li>\n<li>\n<p>In the EntryWizard &#8220;Rating Schemes&#8221; page, select the layout you wish to use and click &#8220;Add a New Scheme&#8221;.</p>\n</li>\n<li>\n<p>Give the scheme a name. Drag the fields you wish to display to the judges into the right-hand column.</p>\n</li>\n<li>\n<p>Add any fields you wish the judges to fill out ( works like EntryWizard fields ).</p>\n</li>\n<li>\n<p>Set the image size, background color and text color, and save the scheme.</p>\n</li>\n<li>\n<p>In the EntryWizard &#8220;Rating Forms&#8221; page, select your scheme and click &#8220;Add a New Rating Form&#8221;.<br />\nAll webforms with your selected layout should display in the &#8220;Item Selection&#8221; list.<br />\nAll your members with &#8220;EntryWizard Judge&#8221; role should display in the &#8220;Access Control&#8221; list.</p>\n</li>\n<li>\n<p>Fill out the name, identifier,  webform(s) and judges, open the rating form and save.</p>\n</li>\n<li>\n<p>Create a page containing the shortcode [ewz_show_rating identifier=&#8221;.. your identifier here ..&#8221;].<br />\nClicking on a thumbnail in the page should open a new window containing a larger version of the image.<br />\nSubsequent clicks on other thumbnails should cause the selected image to display in the same window.<br />\n( If you normally have new windows open in tabs, you may need to drag the tab out of the browser window ).</p>\n</li>\n<li>\n<p>Once the judging is over, download the results in a spreadsheet.</p>\n</li>\n<li>\n<p>If further information is required about specific images, or ties need to be broken, create a new page with<br />\n[ewz_show_rating &#8230;.] shortcodes tailored to your needs ( see the help item at the top of the Rating Forms page ).</p>\n</li>\n</ol>\n</li>\n</ul>\n",
        "changelog": "<h4>1.1.24</h4>\n<ul>\n<li>Fix required for new  block themes to make the javascript used in shortcodes work properly.  Not needed for classic themes</li>\n</ul>\n<h4>1.1.23</h4>\n<ul>\n<li>Some extra buttons on the admin pages, to improve handling of large number of schemes and webforms.</li>\n</ul>\n<h4>1.1.22</h4>\n<ul>\n<li>Fixed a bug in saving a rating scheme that only occurs when using PHP 8.</li>\n</ul>\n<h4>1.1.21</h4>\n<ul>\n<li>Fixed very slow behaviour if both &#8220;Show drop-down selections as buttons&#8221; and &#8220;Go to next item after &#8221; are set on a large judging.</li>\n</ul>\n<h4>1.1.20</h4>\n<ul>\n<li>Fixed error handling if shortcode is invalid</li>\n</ul>\n<h4>1.1.19</h4>\n<ul>\n<li>Option to show a chart of the judge&#8217;s values for a dropdown field</li>\n<li>Option to download only the thumbnails, not the larger images</li>\n<li>Some minor display changes and bugfixes</li>\n</ul>\n<h4>1.1.18</h4>\n<ul>\n<li>Fixed some issues with the option for judges to see buttons instead of dropdowns.</li>\n<li>Added a thumbnail-only option to the shortcode, to avoid big downloads if they are not needed.</li>\n</ul>\n<h4>1.1.17</h4>\n<ul>\n<li>Possible fix for a problem some users running older versions of php had with 1.1.16</li>\n</ul>\n<h4>1.1.16</h4>\n<ul>\n<li>Added a &#8220;Force Finish&#8221; button for each judge to the rating form admin area.</li>\n<li>Tried to give more feedback if a scheme failed to save.</li>\n<li>Added judge option to automatically go to next image after setting a chosen option or checkbox.</li>\n<li>Save the judge page display options for each judge.</li>\n<li>For a rating form, warn if a webform layout does not match the scheme layout.</li>\n</ul>\n<h4>1.1.15</h4>\n<ul>\n<li>Fixed an issue with the &#8220;buttons for dropdown&#8221; option if the dropdown was used in a restriction.</li>\n</ul>\n<h4>1.1.14</h4>\n<ul>\n<li>Use the new EntryWizard permission to allow downloading of user data.</li>\n<li>Disable dragging of images being judged.</li>\n<li>Some code cleanup.</li>\n</ul>\n<h4>1.1.13</h4>\n<ul>\n<li>Fixed an error in some cases when a user was deleted by someone without full EntryWizard permission.</li>\n<li>When showing ratings from other judges, ignore blank ones if there are more than 5 judges.</li>\n<li>Hide the &#8220;buttons for dropdown&#8221; option in judge views with no dropdown visible.</li>\n</ul>\n<h4>1.1.12</h4>\n<ul>\n<li>judge option to display buttons instead of dropdowns</li>\n<li>update tables to utf8</li>\n</ul>\n<h4>1.1.11</h4>\n<ul>\n<li>fixed a bug that stopped &#8220;User&#8217;s Own Images Only&#8221; from working in the rating form Item Selection</li>\n<li>updated some code to comply with the latest WordPress changes to timezone handling</li>\n<li>improvement to positioning of the judge help popup</li>\n<li>minor help-text adjustments</li>\n</ul>\n<h4>1.1.10</h4>\n<ul>\n<li>Allow required checkboxes</li>\n<li>Allow a rating form to be created with no judges</li>\n<li>Allow arrow keys to navigate between items on the judging form</li>\n<li>Option to report variance between judges on drop-down fields</li>\n<li>Option to allow a secondary field to override another field in the downloaded spreadsheet</li>\n<li>Warn when saving a scheme with no required field</li>\n</ul>\n<h4>1.1.9</h4>\n<ul>\n<li>requires EntryWizard version 1.3.11</li>\n<li>fixed a bug that allowed changes in the rating_form to lose the &#8220;finished&#8221; status of judges</li>\n<li>allow setting custom text for no-selection item in option list</li>\n<li>better positioning of error popup near relevant item</li>\n<li>new &#8216;finish&#8217; parameter in shortcode to control display of &#8220;finished&#8221; button</li>\n<li>show a toggle indicator on all postboxes</li>\n<li>css changes that may help with some plugin conflicts</li>\n</ul>\n<h4>1.1.8</h4>\n<ul>\n<li>Fix for a problem with the &#8220;Finished&#8221; button in some cases</li>\n</ul>\n<h4>1.1.7</h4>\n<ul>\n<li>Make the &#8220;read&#8221; view without &#8220;others&#8221; parameter show only the judge&#8217;s own ratings (NB: to get the original behaviour of the &#8220;read&#8221; view add &#8216; others=&#8221;true&#8221;&#8216; to the shortcode).</li>\n</ul>\n<h4>1.1.6</h4>\n<ul>\n<li>Allow &#8220;Finished&#8221; and &#8220;Help&#8221; buttons in all views</li>\n<li>Fix for secondary view sometimes not showing some items to all judges</li>\n<li>Increased allowed length of &#8220;disqualified items&#8221; list</li>\n<li>Keep the &#8220;Next&#8221; and &#8220;Previous&#8221; buttons aligned even if the image is resized</li>\n</ul>\n<h4>1.1.5</h4>\n<ul>\n<li>Fix for issues with &#8220;Finished&#8221; button on judge page</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>New &#8220;edit rating form&#8221; permissions on individual rating forms.</li>\n<li>Allow saving a rating form with no judge so long as it is not open.</li>\n<li>In a new Rating Scheme, the dimensions of the test image now default to the dimensions of the layout&#8217;s first image field.</li>\n<li>Display to a user only the rating forms they can edit.</li>\n<li>Several minor code improvements.</li>\n<li>NB: requires version 1.3.8 of EntryWizard</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Fixed a bug in the display of the admin Rating Forms page that appeared in some cases.</li>\n<li>New parameter &#8216;others&#8217;. If &#8220;true&#8221;, will display ratings from other judges as well as the viewing judge, in all views.</li>\n<li>IMPORTANT: to get the old behavior for view=&#8221;read&#8221;  you will now need view=&#8221;read&#8221; others=&#8221;true&#8221;.</li>\n<li>Several other minor tweaks to the user interface.</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Added personal data exporter</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Fixed some issues arising when an item contains more than one image</li>\n<li>When image is downsized, allow the judge to toggle between the full-size view with scrollbars and the resized view</li>\n<li>Allow sorting on columns containing multiple fields</li>\n<li>Some database changes to allow for larger numbers of users and images</li>\n<li>Copy restrictions when copying a scheme</li>\n<li>New interface for selecting judges in the rating form admin area</li>\n<li>In admin areas, use firstname, lastname instead of display_name</li>\n<li>Updated to work with JQuery version 3.0</li>\n<li>Several small tweaks to improve speed and/or user feedback.</li>\n<li>Some changes to improve the view on small devices.</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>IMPORTANT: The first time a judge clicks a thumbnail, show them the test image to make sure the window is big enough.</li>\n<li>IMPORTANT: The test image MUST now have the correct dimensions.</li>\n<li>Generate a test image if one is not provided</li>\n<li>Option to allow the judge to resize the image (to a limited extent) in the browser.</li>\n<li>Changes to help text on image sizing.</li>\n</ul>\n<h4>1.0.14</h4>\n<ul>\n<li>Fixed a bug in judge counts when &#8220;All Logged-in Users&#8221; is selected</li>\n<li>Fixed an issue in the shortcode with the new-item border color</li>\n<li>Fixed scheme creation as copy of existing scheme</li>\n<li>Optional list of disqualified items not to be shown to judges</li>\n<li>Changed user lists to sort by lastname, firstname</li>\n<li>Discourage browsers from using cached images</li>\n<li>Speed up load of admin pages with many rating forms</li>\n<li>Removed the &#8220;formatted text&#8221; option for text inputs in ratings</li>\n<li>More emphasis in help files on image size and space needed</li>\n<li>Improved feedback in case of missing image files</li>\n<li>Requires EntryWizard version 1.3.3.</li>\n</ul>\n<h4>1.0.13</h4>\n<ul>\n<li>Fixed a possible problem with divided fields if a judge&#8217;s name is changed. If you divide fields between judges, DO NOT UPDATE TO THIS VERSION WHILE A RATING FORM IS INCOMPLETE.  It may change the allocation of the field to the judges.</li>\n<li>Do not require judge status when allowing &#8220;all logged-in users&#8221;.</li>\n<li>Made behaviour more consistent on saves of rating forms and schemes.</li>\n<li>In the judge&#8217;s help window, more emphasis  on reloading the page if anything seems wrong.</li>\n</ul>\n<h4>1.0.12</h4>\n<ul>\n<li>Added batch rating form delete capability</li>\n<li>Saving individual rating forms and schemes no longer completely reloads the page</li>\n<li>Fixed some incompatibilities with the latest version of jquery-ui</li>\n<li>Help text &#8211; greater emphasis on ensuring the test image is fully visible in the judge&#8217;s window</li>\n<li>Multiple save buttons in rating schemes</li>\n<li>Button to sort rating forms alphabetically</li>\n<li>Judge lists sort by name instead of login</li>\n<li>Earlier versions are not supported with EntryWizard version 1.3.0</li>\n</ul>\n<h4>1.0.11</h4>\n<ul>\n<li>Remind judges if they dont save often enough ( trying to save too much at once can cause data loss )</li>\n<li>Fixed too many characters allowed in identifier input</li>\n</ul>\n<h4>1.0.10</h4>\n<ul>\n<li>Fixed a typo in the documentation re a shortcode parameter name</li>\n</ul>\n<h4>1.0.9</h4>\n<ul>\n<li>Fixed a bug that appeared when a custom display was used for a checkbox or radio layout field that was used in a rating restriction</li>\n</ul>\n<h4>1.0.8</h4>\n<ul>\n<li>Fixed downloaded spreadsheet showing a row for every item in the webform, even if it did not match the item selection criteria</li>\n<li>Show the color-picker properly in a newly-created scheme</li>\n<li>&#8220;Read&#8221; view now shows &#8220;divided&#8221; fields to all judges</li>\n<li>New Help page showing all the help popup texts together</li>\n<li>Judges can delete a rating</li>\n<li>Admins can delete a rating if the associated setting is checked</li>\n<li>More checking of shortcode parameters for errors</li>\n<li>Warn on leaving a rating scheme admin page with unsaved changes</li>\n</ul>\n<h4>1.0.7</h4>\n<ul>\n<li>Fixed a problem with the &#8220;User&#8217;s own images only&#8221; option in rating forms under the &#8220;read&#8221; view.</li>\n</ul>\n<h4>1.0.6</h4>\n<ul>\n<li>Fixed a bug in use of fixed fields in restrictions.</li>\n<li>Fixed validation so a value of &#8220;0&#8221; is allowed for required items.</li>\n<li>Warn if a non-secondary field is appended to a secondary one.</li>\n<li>Show the save button, etc at the top of the rating scheme as well as at the bottom.</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Fixed a bug that sometimes caused issues when deleting restrictions</li>\n<li>Code cleanup. NOTE: this version requires at least version 1.2.22 of EntryWizard.</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>Fixed an issue with sorting in the shortcode.</li>\n<li>Fixed a situation where some admin operations could remove the &#8220;Finished&#8221; status from a judge.</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Fixed a possible issue with some restriction checking</li>\n<li>Fixed a problem with background colours when there are multiple ewz-rating shortcodes in a page/post</li>\n<li>Added a facility for an admin to see the shortcode (almost) as a judge would see it, without having to log in as the judge.</li>\n<li>Added a choice to the scheme as to whether or not the &#8220;Using the Rating Form&#8221; button is displayed, and shortened the text of it for the &#8220;read&#8221; view</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Fixed a bug introduced in 1.0.1 that stopped the image from displaying on a read-only rating page</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Added a facility to create a new scheme as a copy of an existing one.</li>\n<li>Added a facility to change some colours in the shortcode display.</li>\n<li>Fixed a bug that stopped the Rating Shortcodes menu from displaying in a new post or page.</li>\n<li>Use of a color-selection popup instead of a drop-down list.</li>\n<li>Fixed a few other small bugs.</li>\n<li>A number of code changes to facilitate the generation of automated tests.  These changes should not have any visible effect.</li>\n</ul>\n"
    },
    "short_description": "Companion plugin to EntryWizard, for display and judging of the uploaded images.",
    "description": "<p>This plugin requires that the EntryWizard plugin is installed.  It generates forms for displaying and judging images that were uploaded via EntryWizard ( either using its regular individual upload or using its batch entry upload facility ).</p>\n<p>The data displayed in the forms, the judges allowed to see it, and the selection of images shown may all be configured by the administrators.</p>\n<p>Judges may sort the forms by most columns, including any scores they have entered.</p>\n<p>Selected information about each image and/or maker may optionally be displayed in read-only fashion.</p>\n<p>The judges must be logged-in users of the site who have been assigned a special role. Or the administrator may make the images and data visible to all logged-in users, or only to the image owners.</p>\n<h4>Privacy</h4>\n<p>This plugin does not send any data to external servers. It does store in the wordpress database whatever data is requested in the forms designed by the administrator. Viewing of such data using the plugin&#8217;s shortcodes is always restricted to logged-in users, and is usually further restricted by the administrator.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.24.zip",
    "upgrade_notice": {
        "1.1.24": "<ul>\n<li>Fix required for new  block themes only.</li>\n</ul>",
        "1.1.23": "<ul>\n<li>Minor admin gui improvements</li>\n</ul>",
        "1.1.22": "<ul>\n<li>Fixed a bug in saving a rating scheme that only occurs when using PHP 8.</li>\n</ul>",
        "1.1.21": "<ul>\n<li>Fixed very slow behaviour if both &quot;Show drop-down selections as buttons&quot; and &quot;Go to next item after &quot; are set on a large judging.</li>\n</ul>",
        "1.1.20": "<ul>\n<li>Fixed error handling if shortcode is invalid</li>\n</ul>",
        "1.1.19": "<ul>\n<li>Options for displaying a chart and to download only thumbnails</li>\n</ul>",
        "1.1.18": "<ul>\n<li>Bugfix re option for judges to see buttons instead of dropdowns, new thumbnail-only option for the shortcode.</li>\n</ul>",
        "1.1.17": "<ul>\n<li>Possible fix for a problem some users running older versions of php had with 1.1.16</li>\n</ul>",
        "1.1.16": "<ul>\n<li>Improved options to reduce the number of clicks required for a big judging.</li>\n</ul>",
        "1.1.15": "<ul>\n<li>Fixed an issue with the &quot;buttons for dropdown&quot; option if the dropdown was used in a restriction.</li>\n</ul>",
        "1.1.14": "<ul>\n<li>Disallow dragging of images. Use EntryWizard permission to allow downloading of user data.</li>\n</ul>",
        "1.1.13": "<ul>\n<li>Fixed occasional bug when a user was deleted, better handling of large number of judges.</li>\n</ul>",
        "1.1.12": "<ul>\n<li>update tables to utf8, judge option to display buttons instead of dropdowns</li>\n</ul>",
        "1.1.11": "<ul>\n<li>bugfix for &quot;User&#039;s Own Images Only&quot; option in the rating form Item Selection</li>\n</ul>",
        "1.1.10": "<ul>\n<li>Arrow keys for judging page, new reporting functions.</li>\n</ul>",
        "1.1.9": "<ul>\n<li>Allow setting text for no-selection item in option list, control display of &quot;finished&quot; button in shortcode.</li>\n</ul>",
        "1.1.7": "<ul>\n<li>Changed the &quot;read&quot; view without &quot;others&quot; parameter to show only the judge&#039;s own ratings.</li>\n</ul>",
        "1.1.6": "<ul>\n<li>Several minor fixes and improvements</li>\n</ul>",
        "1.1.5": "<ul>\n<li>Fix for issues with &quot;Finished&quot; button on judge page</li>\n</ul>",
        "1.1.4": "<ul>\n<li>New &quot;edit rating form&quot; permissions, other minor improvements. Requires EntryWizard 1.3.8</li>\n</ul>",
        "1.1.3": "<ul>\n<li>Bugfix for Rating Forms page in some cases. Option to display ratings from other judges as well as the viewing judge.</li>\n</ul>",
        "1.1.2": "<ul>\n<li>Added personal data exporter</li>\n</ul>",
        "1.1.1": "<ul>\n<li>Several improvements to the user interface.</li>\n</ul>",
        "1.1.0": "<ul>\n<li>Allow some resizing of the image in the judging view, auto-generate a test image.</li>\n</ul>",
        "1.0.14": "<ul>\n<li>Small bug fixes, hide disqualified items from judges, sort user lists by name. Requires EntryWizard version 1.3.3.</li>\n</ul>",
        "1.0.13": "<ul>\n<li>Bugfix release. If you divide a field between judges, DO NOT UPDATE TO THIS VERSION WHILE A RATING FORM IS OPEN.  It may change the allocation of the field to the judges.</li>\n</ul>",
        "1.0.12": "<ul>\n<li>Earlier versions are not supported with EntryWizard version 1.3.0</li>\n</ul>",
        "1.0.11": "<ul>\n<li>Reminder popup for judges to save, fix for incorrect length in identifier input.</li>\n</ul>",
        "1.0.10": "<ul>\n<li>Fixed a typo in the documentation re a shortcode parameter name</li>\n</ul>",
        "1.0.9": "<ul>\n<li>Fixed a bug that appeared when a custom display was used for a checkbox or radio layout field that was used in a rating restriction</li>\n</ul>",
        "1.0.8": "<ul>\n<li>Help page, bugfixes. Judges can delete a rating. Setting to allow admins to delete individual ratings.</li>\n</ul>",
        "1.0.7": "<ul>\n<li>Fixed a problem with the &quot;User&#039;s own images only&quot; option in rating forms under the &quot;read&quot; view.</li>\n</ul>",
        "1.0.6": "<ul>\n<li>Fixed a bug in use of fixed fields in restrictions, minor improvements.</li>\n</ul>",
        "1.0.5": "<ul>\n<li>Fixed possible issue with deleting restrictions. NOTE: this version requires at least version 1.2.22 of EntryWizard.</li>\n</ul>",
        "1.0.4": "<ul>\n<li>Fixed issues with sorting on the judge page, and with correctly reporting a judge&#039;s &quot;Finished&quot; status.</li>\n</ul>",
        "1.0.3": "<ul>\n<li>Some minor bugfixes, new facility for an admin to see (almost) what a judge would see, without having to log in as the judge.</li>\n</ul>",
        "1.0.2": "<ul>\n<li>Fixed a bug introduced in 1.0.1 that stopped the image from displaying on a read-only rating page</li>\n</ul>",
        "1.0.1": "<ul>\n<li>Two new functions: copy one Rating Scheme to another, and customize some of the colors on the front-end.</li>\n</ul>"
    },
    "screenshots": [],
    "tags": {
        "camera-club": "camera club",
        "competition": "competition",
        "image": "image",
        "spreadsheet": "spreadsheet",
        "upload": "upload"
    },
    "stable_tag": "1.1.24",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.1.zip",
        "1.0.10": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.10.zip",
        "1.0.11": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.11.zip",
        "1.0.12": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.12.zip",
        "1.0.13": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.13.zip",
        "1.0.14": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.14.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.6.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.7.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.8.zip",
        "1.0.9": "https://downloads.wordpress.org/plugin/ewz-rating.1.0.9.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.1.zip",
        "1.1.10": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.10.zip",
        "1.1.11": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.11.zip",
        "1.1.12": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.12.zip",
        "1.1.13": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.13.zip",
        "1.1.14": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.14.zip",
        "1.1.15": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.15.zip",
        "1.1.16": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.16.zip",
        "1.1.17": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.17.zip",
        "1.1.18": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.18.zip",
        "1.1.19": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.19.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.2.zip",
        "1.1.20": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.20.zip",
        "1.1.21": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.21.zip",
        "1.1.22": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.22.zip",
        "1.1.23": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.23.zip",
        "1.1.24": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.24.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.8.zip",
        "1.1.9": "https://downloads.wordpress.org/plugin/ewz-rating.1.1.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/ewz-rating.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/ewz-rating.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}