{
    "name": "XPlainer &#8211; Product FAQs for WooCommerce &amp; AI FAQ Generator",
    "slug": "faq-for-woocommerce",
    "version": "1.7.5",
    "author": "<a href=\"https://optemiz.com/\">Optemiz</a>",
    "author_profile": "https://profiles.wordpress.org/optemiz/",
    "contributors": {
        "optemiz": {
            "profile": "https://profiles.wordpress.org/optemiz/",
            "avatar": "https://secure.gravatar.com/avatar/10fc5aa81d3c4c64289c744d8d1de8e4?s=96&d=monsterid&r=g",
            "display_name": "Optemiz"
        },
        "happydevs": {
            "profile": "https://profiles.wordpress.org/happydevs/",
            "avatar": "https://secure.gravatar.com/avatar/aac7bbd9618679665b215272f6088224?s=96&d=monsterid&r=g",
            "display_name": "HappyDevs"
        },
        "nayanchamp7": {
            "profile": "https://profiles.wordpress.org/nayanchamp7/",
            "avatar": "https://secure.gravatar.com/avatar/513e7b32c86ce6366af735e55cc2280c?s=96&d=monsterid&r=g",
            "display_name": "Nazrul Islam Nayan"
        },
        "azha18": {
            "profile": "https://profiles.wordpress.org/azha18/",
            "avatar": "https://secure.gravatar.com/avatar/a17fba2576f7ed2a2211e0dbe45bc06a?s=96&d=monsterid&r=g",
            "display_name": "Azharul Islam Ashiq"
        }
    },
    "requires": "4.4",
    "tested": "6.6.2",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 18,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 18,
    "support_url": "https://wordpress.org/support/plugin/faq-for-woocommerce/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "last_updated": "2024-10-22 18:25:00",
    "added": "2020-10-27",
    "homepage": "https://wordpress.org/plugins/faq-for-woocommerce/",
    "sections": {
        "description": "<p>XPlainer is a feature-packed, flexible, and robust product FAQ plugin for WooCommerce. It might be your best shot if you want to increase sales by answering your customer’s most commonly asked questionnaires smartly.</p>\n<p>👉 <a href=\"https://optemiz.com/xplainer\" rel=\"nofollow ugc\"><strong>Upgrade to PRO</strong></a><br />\n👉 <a href=\"https://optemiz.com/docs/faq-for-woocommerce/overview/\" rel=\"nofollow ugc\"><strong>Documentation</strong></a><br />\n👉 <a href=\"https://wordpress.org/support/plugin/faq-for-woocommerce/\" rel=\"ugc\"><strong>Support</strong></a><br />\n👉 <a href=\"https://www.youtube.com/watch?v=oGLDl0GKh-k&amp;list=PLrEy7YvtgxPhl75Cjd8JeGMeiv_knlPgA\" rel=\"nofollow ugc\"><strong>Tutorials</strong></a></p>\n<p>The main purpose of this FAQ plugin for <a href=\"https://wordpress.org/plugins/woocommerce\" rel=\"ugc\"><strong>WooCommerce</strong></a> is to generate product FAQs and display those in an eye-pleasing way. While displaying the product FAQ list, you get multiple templates with relative designs. Right now, there are 5 templates (free version), and more are cooking up.</p>\n<p>The product FAQ generated by XPlainer templates is compatible with any theme. So, no more worries about plugin or theme compatibility if you choose XPlainer &#8211; the Product FAQ for WooCommerce WordPress plugin.</p>\n<blockquote>\n<p>This advanced WooCommerce Question Answer plugin can skyrocket your sales and increase your business’s online visibility. Indeed, a tool that should not be missed for any product site.</p>\n</blockquote>\n<p>This WordPress Accordion Plugin makes sure to enhance more productive support for your eCommerce store. You can use this plugin to showcase your product information, aka the customer knowledge base, without using any Advanced FAQ Manager. So, utilize the XPlainer &#8211; Product FAQ for WooCommerce plugin to generate FAQs quickly.</p>\n<h3>🔥 VIDEO INTRODUCTION TO THE FAQ FOR WOOCOMMERCE PLUGIN</h3>\n<p>Check the video below to understand the ins and outs of XPlainer -the best WordPress FAQ plugin. By the way, this tutorial is based on the 1.3.0 version. We already added a lot more features after that. So, install the latest version and grow your eCommerce business by utilizing the newly added features.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/oGLDl0GKh-k?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Now, let’s get into the freshly baked features of the XPlainer &#8211; Product FAQ for WooCommerce plugin.</p>\n<h3>⭐ TOP FEATURES</h3>\n<p>Here’s a glimpse of the top features of this ultimate FAQ plugin for <a href=\"https://wordpress.org/plugins/woocommerce\" rel=\"ugc\"><strong>WooCommerce</strong></a>:</p>\n<ul>\n<li>Unlimited FAQs</li>\n<li>FAQs by Product Categories</li>\n<li>FAQs by Product Tags</li>\n<li>AI FAQs Generator (since 1.7.0)</li>\n<li>Individual product FAQ</li>\n<li>Gutenberg Editor support</li>\n<li>Classic Editor support</li>\n<li>FAQ Post support</li>\n<li>Product FAQ comment</li>\n<li>Schema support</li>\n<li>Sorting FAQs</li>\n<li>Shortcode support</li>\n<li>Custom style support</li>\n<li>Fully responsive</li>\n<li>FAQ block support</li>\n<li>Media/Image support in FAQ answer</li>\n<li>Adding content before and after the FAQ list</li>\n<li>HTML content – write answers in HTML</li>\n<li>Multiple Layout – standard templates for front view</li>\n<li>WP Editor for HTML markup, supports WYSIWYG editor</li>\n<li>WooCommerce compatible style for product information tab</li>\n<li>FAQ layout preview</li>\n<li>FAQ tab reorder setting</li>\n<li>Show/hide FAQ answers on page load</li>\n<li>Option of Expand/Collapse All FAQs</li>\n<li>💎 Variation Product FAQs (PRO)</li>\n<li>💎 More Beautiful FAQs Templates (PRO)</li>\n<li>💎 Display Location [display anywhere on Product page] (PRO)</li>\n<li>💎 DYNAMIC PRODUCT ATTRIBUTE (PRO)</li>\n<li>💎 Global FAQS (PRO)</li>\n<li>💎 RTL Support (PRO)</li>\n<li>💎 SEARCH FAQs (PRO)</li>\n<li>💎 Multi Column Support (PRO)</li>\n<li>💎 Many More Features (PRO)</li>\n</ul>\n<p>Let’s explain these features one by one.</p>\n<h3>♾️ UNLIMITED FAQS</h3>\n<p>The XPlainer Product FAQ for WooCommerce plugin allows you to add unlimited FAQs to your eCommerce store. It doesn’t matter how many products you have in your online store, this WooCommerce FAQ plugin got you covered. You can even add global FAQs for your products.</p>\n<h3>🎨 INDIVIDUAL PRODUCT FAQ</h3>\n<p>Every product is special. So, it’s very common for customers to have specific questions about specific products. As an owner, it’s your sole duty to convert those product visitors into probable buyers by answering their custom questions with this FAQ accordion plugin.</p>\n<h3>📭 FAQ POST SUPPORT</h3>\n<p>Besides adding the specific product FAQs, you can also create FAQ posts, aka a WordPress FAQ page with a unique permalink.</p>\n<h3>🗣️ PRODUCT FAQ COMMENT</h3>\n<p>To enable comment support, please go through “<strong>XPlainer &gt; Settings &gt; Comment</strong>” and select enable. The comments and comment forms are fully customizable. Besides, you can also update the comment font, color, design, button styling, etc.</p>\n<p>Customers or visitors can submit their comments to every product FAQ. After that, Admin can either approve or delete comments. The approved comments will be displayed on the front. This commenting feature helps you get customer feedback on your WooCommerce products and the product FAQs.</p>\n<p><a href=\"https://optemiz.com/xplainer\" rel=\"nofollow ugc\"><strong>Upgrade to PRO</strong></a> | <a href=\"https://optemiz.com/docs/faq-for-woocommerce/overview/\" rel=\"nofollow ugc\"><strong>Documentation</strong></a> | <a href=\"https://wordpress.org/support/plugin/faq-for-woocommerce/\" rel=\"ugc\"><strong>Support</strong></a></p>\n<h3>🤖 SCHEMA SUPPORT</h3>\n<p>Increasing search engine visibility is one of the best ways to grow your business. The better ranking you have, the more traffic you will get from the search engines. If you want to rank your product page, then you must use the FAQ schema.</p>\n<h3>🔀 SORTING FAQS</h3>\n<p>The XPlainer WooCommerce FAQ plugin works in a more advanced way than the other FAQ accordion plugins. This FAQ sorting feature might be a great example to support this statement.</p>\n<p>XPlainer allows the users to sort the FAQs under different parameters like ‘<strong>order</strong>’ and ‘<strong>order_by</strong>’. You can also implement this sorting feature by using shortcodes. Check the following feature to learn about using the shortcode feature.</p>\n<h3>🚀 SHORTCODE SUPPORT</h3>\n<p>A smart representation of WooCommerce product FAQs impacts sales directly. That’s why you must display the product FAQs wherever needed. That’s why this WordPress FAQ plugin comes with the shortcode feature.</p>\n<p>ℹ️ You can display <strong>all FAQs</strong> for a random product having FAQs with the default template:</p>\n<pre><code>[ffw_template]\n</code></pre>\n<p>ℹ️ To <strong>display all FAQs for a specific product</strong>, use the following shortcode:</p>\n<pre><code>[ffw_template id=20]\n</code></pre>\n<p>💡 Here, 20 is the product id. Replace it with your desired product id.</p>\n<p>ℹ️ To <strong>display FAQs for specific FAQ categories</strong>, use the following shortcode:</p>\n<pre><code>[ffw_template cat_ids=\"32, 33\"]\n</code></pre>\n<p>💡 If the cat_ids exist, then the product id will be ignored. Here 32 &amp; 33 are FAQ categories id. Please use the comma separator while inputting the data.</p>\n<p>If you want to sort the product FAQs using shortcodes, you can do it by using ‘order’ and ‘order_by’ parameters.</p>\n<p>The supported values for ‘order’ (Default Value: ‘ASC’)<br />\n– ‘DESC’, ‘ASC’</p>\n<p>The supported values for ‘order_by’ (Default Value: ‘ID’)<br />\n– ‘ID’, ‘date’, ‘title’, ‘name’, ‘date’, ‘modified’, ‘comment_count’, ‘author’.</p>\n<p>ℹ️ Use the shortcode below to display FAQs for a current product ID (for the single product page):</p>\n<pre><code>[ffw_template dynamic_post=true]\n</code></pre>\n<p>💡 This shortcode is appropriate for single product pages.</p>\n<p>ℹ️ Use the following shortcode to display all FAQs for a specific product with a specific template by this easy accordion FAQ plugin.</p>\n<pre><code>[ffw_template template=1 id=20]\n</code></pre>\n<p>💡 Use the following template ids to show FAQs</p>\n<ul>\n<li>For Classic Template – 1</li>\n<li>For Whitish Template – 2</li>\n<li>For Trip Template – 3</li>\n<li>For Pop Template – 4</li>\n<li>For Basic Template – 5</li>\n<li>For Glow Template (Pro) – 6</li>\n<li>For Smart Template (Pro) – 7</li>\n<li>For Wow Template (Pro) – 8</li>\n<li>For Zoom Template (Pro) – 9</li>\n</ul>\n<h3>🔎 CUSTOM STYLE SUPPORT</h3>\n<p>To design the product FAQs even better, the XPlainer WooCommerce FAQ plugin comes with custom styling support. By implementing this feature, you can control lots of parameters. Here is the list of those &#8211;</p>\n<ul>\n<li>FAQ wrapper width</li>\n<li>Question text color</li>\n<li>Question background color</li>\n<li>Question background Secondary color (applicable for pop layout)</li>\n<li>Question border color</li>\n<li>Question font size</li>\n<li>Answer text color</li>\n<li>Answer background color</li>\n<li>Answer border color &amp;</li>\n<li>Custom CSS</li>\n</ul>\n<p>💡 The <strong>custom CSS</strong> is the most prioritized CSS. Adding custom CSS will override the default styling.</p>\n<h3>🎯 FULLY RESPONSIVE</h3>\n<p>Like the FAQ schema, the responsiveness of a website doesn&#8217;t affect only the website’s ranking on the search engines. Besides that, it improves the user experience too. Fortunately, this XPlainer FAQ accordion plugin is compatible with almost all third-party themes.</p>\n<p>Hence, this FAQ WordPress plugin can display the questions and answers on every product page by maintaining responsiveness. So, no more worrying about presenting the product information on multiple devices. XPlainer FAQ plugin will maintain your website&#8217;s responsiveness on every page.</p>\n<h3>🎦 MEDIA/IMAGE SUPPORT IN FAQ ANSWER</h3>\n<p>A picture is worth a thousand words. While answering the questions, you might need to use some images or videos to explain the answer better. To help you in this situation, XPlainer allows the insertion of digital media in the answers.</p>\n<p>It not only helps to answer the questions better but also answers them more appropriately. You can insert every media file that is supported by WordPress.</p>\n<h3>🔁 ADDING CONTENT BEFORE AND AFTER THE FAQ LIST</h3>\n<p>The XPlainer FAQ plugin doesn&#8217;t only add FAQ questions and answers. Besides that, you can also add a heading and footer within the FAQ wrapper. You can update these contents by navigating to <strong>XPlainer &gt; Settings page</strong>. Then select the <strong>General</strong> tab and scroll down. The WYSIWYG text editor for adding content before and after the FAQs is at the bottom of the <strong>General</strong> tab.</p>\n<h3>🎢 MULTIPLE LAYOUTS – STANDARD TEMPLATES FOR FRONT VIEW</h3>\n<p>This Product FAQ for WooCommerce has five built-in templates to choose from. These are &#8211;</p>\n<ul>\n<li>Classic Template</li>\n<li>Whitish Template</li>\n<li>Trip Template</li>\n<li>Pop Template</li>\n<li>Basic Template (since 1.4.5)</li>\n<li>Glow Template (Pro)</li>\n<li>Smart Template (Pro)</li>\n<li>Wow Template (Pro)</li>\n<li>Zoom Template (Pro)</li>\n</ul>\n<h3>🔗 WOOCOMMERCE COMPATIBLE STYLE FOR PRODUCT INFORMATION TAB</h3>\n<p>The XPlainer Product FAQ plugin is totally compatible with WooCommerce. From the coding standard to optimization and designing, XPlainer blends with WooCommerce perfectly. So, when you create your WooCommerce FAQ questions and answers with the XPlainer plugin, it will properly adjust with WooCommerce.</p>\n<h3>💻 FAQ LAYOUT PREVIEW IN SETTING PAGE</h3>\n<p>The XPlainer FAQ plugins come with multiple colorful and SEO-friendly FAQ layouts. Right now, there are 4 different layouts to choose from. You can check these layouts by navigating to <strong>Woo FAQ &gt; Settings</strong> page. Then select the General tab and select your desired design from the <strong>Layout</strong> option.</p>\n<h3>📐 FAQ TAB REORDER SETTING</h3>\n<p>By default, the FAQs you have added will be displayed in the last tab. But, you can control the tab position from the XPlainer settings page if needed. To do that, go to <strong>XPlainer &gt; Settings</strong> page and then find the <strong>Tab Priority</strong> option under the <strong>General</strong> tab.</p>\n<h3>🎬 SHOW/HIDE FAQ ANSWERS ON PAGE LOAD</h3>\n<p>By default, the product FAQs are listed just like a simple FAQ accordion style. If you want to read the answer to a specific question, you have to click on that question, and it will show the answer.</p>\n<p>But, XPlainer is designed to offer something extra than others. So, you can set whether you want to show or hide the answers while the product page loads initially.</p>\n<h3>👨‍💻 OPTION TO EXPAND/COLLAPSE ALL FAQS</h3>\n<p>Besides controlling the FAQs visibility from the dashboard panel, the XPlainer WooCommerce FAQ manager plugin lets the customer control it from the front-end interface.</p>\n<h3>⚡ Maximize the efficiency of your WooCommerce FAQ creation process</h3>\n<p>You will get a lot of effort minimizing features from the free version of this WooCommerce faq accordion plugin. But you will definitely enjoy the pro version since it saves your time and resources more efficiently.</p>\n<p>With XPlainer Pro, your sales will increase dramatically because it will enhance the standard of your WooCommerce products by making them more informative.</p>\n<h3>Pro Features of XPlainer:</h3>\n<h3>👕 FAQs by Product Categories</h3>\n<p>Assign product categories to FAQs. It will minimize your time to connect FAQs with products.</p>\n<h3>👕 FAQs by Product Tags</h3>\n<p>Assign product tags to FAQs. It will minimize your time to connect FAQs with products.</p>\n<h3>👕 Variation Product FAQs (PRO FEATURE)</h3>\n<p>Easily create FAQs for variation products and easily engage with your customers by answering their variation queries about the child products.</p>\n<h3>📑 More Beautiful Templates (PRO FEATURE)</h3>\n<p>With premium FAQ templates, you can display standard product FAQs and boost your sales.</p>\n<h3>🟦 Display Location (PRO FEATURE)</h3>\n<p>Display faqs anywhere on the product page, it will give you the flexibility to adjust faqs with your design theme interface.</p>\n<h3>⚛️ DYNAMIC PRODUCT ATTRIBUTE (PRO FEATURE)</h3>\n<p>Reduce your effort by assigning a particular FAQ to any number of products in your WooCommerce store. Yes, with XPlainer PRO, it&#8217;s that easy to create and display FAQs accordion based on product attributes. Simply place the product attribute on the answer of your FAQ and display that attribute-based answer.</p>\n<p>Let’s say there is a FAQ assigned for thousands of products on your online store. You can set the product attribute in answer to show product-specific responses for numerous products. So, you don’t need to create the same FAQ for different products individually. Instead, specify a product attribute in answer to obtain a Dynamic product value of each product for the same FAQ.</p>\n<h3>🌐 Global FAQs (PRO FEATURE)</h3>\n<p>There must be some common FAQs that you want to set for all your WooCommere products. However creating the identical FAQ individually for all your products makes the FAQ creation process tedious. Thus, Xplainer offers the ultimate FAQ creation experience with this feature that minimizes effort.</p>\n<p>No matter how many products you have, you can set the same FAQ for your entire <a href=\"https://wordpress.org/plugins/woocommerce\" rel=\"ugc\"><strong>WooCommerce</strong></a> store. Simply create one FAQ using XPlainer and set it as a Global FAQ, and that&#8217;s it. Your Global FAQ will appear on every product FAQ section of your online store.</p>\n<h3>⬅️ RTL SUPPORT (PRO FEATURE)</h3>\n<p>XPlainer already supports several languages, but it transcends all boundaries with RTL support. RTL languages such as Arabic, Aramaic, Azeri, Hebrew, Kurdish, Persian, etc, are supported in XPlainer PRO.</p>\n<h3>🔍 SEARCH FAQs (PRO FEATURE)</h3>\n<p>XPlainer is indeed one of the best WordPress accordion plugins for WooCommerce. You’ll be able to find the exact FAQ within seconds using this FAQ accordion tool.It offers a flexible search option for your WooCommerce product FAQs. The comprehensive search functionality in the FAQ area will allow you to search out the FAQ you are looking for.</p>\n<h3>☲ MULTI-COLUMN SUPPORT (PRO FEATURE)</h3>\n<p>Typically a FAQ section comes with a simple outlook that contains questions, answers, and a faq dropdown option. Using XPlainer PRO, you can generate FAQs with unique viewing experiences for the users. It allows you to personalize the FAQ area with Multi-column support.</p>\n<p>Users can now see more FAQs and access them without even scrolling the screen. You can simply enable or disable multi-column FAQs using this amazing tool. For user convenience, this feature displays more FAQs inside a relatively compact viewing area.</p>\n<p><a href=\"https://optemiz.com/xplainer\" rel=\"nofollow ugc\"><strong>Upgrade to PRO</strong></a> | <a href=\"https://optemiz.com/docs/faq-for-woocommerce/overview/\" rel=\"nofollow ugc\"><strong>Documentation</strong></a> | <a href=\"https://wordpress.org/support/plugin/faq-for-woocommerce/\" rel=\"ugc\"><strong>Support</strong></a></p>\n<p>💚 Satisfied with our XPlainer FAQ plugin?<br />\n👉 <a href=\"https://www.facebook.com/optemiz\" rel=\"nofollow ugc\"><strong>Join our Facebook Page</strong></a><br />\n⭐ <a href=\"https://wordpress.org/support/plugin/faq-for-woocommerce/reviews/?filter=5\" rel=\"ugc\"><strong>Rate us on WordPress</strong></a> [Your Review, Our Inspiration]</p>\n",
        "installation": "<p>Before installing the plugin please make sure that</p>\n<ul>\n<li>Your php version is 5.4 or greater</li>\n<li>WordPress version is 3.6 or greater</li>\n<li>WooCommerce version is 2.4 or greater</li>\n</ul>\n<p>This section describes how to install the plugin and get it working.</p>\n<h4>Search Way:</h4>\n<ol>\n<li>Go to the WordPress Dashboard &#8220;Add New Plugin&#8221; section.</li>\n<li>Search For &#8220;Product FAQ&#8221;.</li>\n<li>Install, then Activate it.</li>\n</ol>\n<h4>Manual Way:</h4>\n<ol>\n<li>Upload <code>faq-for-woocommerce</code> folder to the <code>/wp-content/plugins/</code> directory.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress.</li>\n<li>Go through menu like <code>XPlainer &gt; Settings</code>.</li>\n<li>In product tab section you will find a menu called <code>FAQs</code>, click it, click <code>Add new</code> and a popup will come.</li>\n<li>Add question and add answer.</li>\n<li>Done!</li>\n</ol>\n",
        "faq": "<p>Our plugin is user friendly, but here you can see some frequently asked<br />\nquestions that can help you.</p>\n\n<dt id='does%20it%20work%20with%20any%20theme%3F'>\nDoes it work with any theme?\n</h4>\n<p>\n<p>Yes, it will work with any standard WordPress theme.</p>\n</p>\n<dt id='can%20product%20categories%20be%20assigned%20with%20faqs%3F'>\nCan product categories be assigned with FAQs?\n</h4>\n<p>\n<p>Yes, You can assign product categories with the FAQs. However, the feature is not for the free version. Although, you can assign products to the FAQs in free version to create unlimited FAQs.</p>\n</p>\n<dt id='is%20this%20plugin%20responsible%3F'>\nIs this plugin responsible?\n</h4>\n<p>\n<p>Yes, this awesome Faq WooCommerce Questions and Answers plugin is responsive with any media devices.</p>\n</p>\n<dt id='can%20we%20write%20html%20content%3F'>\nCan we write html content?\n</h4>\n<p>\n<p>Yes, you can write html markup for answers with wp editor.</p>\n</p>\n<dt id='can%20i%20sort%20faq%20list%3F'>\nCan I sort faq list?\n</h4>\n<p>\n<p>Yes,You can sort faq list easily. We have added the support since version 1.3.0</p>\n</p>\n<dt id='is%20it%20support%20schema%3F'>\nIs it support Schema?\n</h4>\n<p>\n<p>Yes,We have Google Rich Schema support since version 1.2.2</p>\n</p>\n<dt id='can%20we%20use%20media%3F'>\nCan we use media?\n</h4>\n<p>\n<p>Yes, you can use media in the content.We have media support since version 1.1.5</p>\n</p>\n<dt id='can%20we%20use%20custom%20style%3F'>\nCan we use custom style?\n</h4>\n<p>\n<p>Yes, you can customize with your own styles.We have style support since version 1.2.0</p>\n</p>\n<dt id='does%20it%20support%20comments%3F'>\nDoes it support comments?\n</h4>\n<p>\n<p>Yes, Visitors or Customers can comment on per product faqs. Admin can customize the full comments and product questions answers comment forms. We have comment support since version 1.3.18</p>\n</p>\n<dt id='how%20many%20template%20can%20we%20use%3F'>\nHow many template can we use?\n</h4>\n<p>\n<p>Currently we provide five standard templates, more beautiful FAQ templates exists in our premium version.</p>\n</p>\n<dt id='can%20i%20use%20shortcode%20to%20show%20faqs%3F'>\nCan I use shortcode to show faqs?\n</h4>\n<p>\n<p>Absolutely yes! You can use [ffw_template] to show faqs, for details please see shortcode description above.</p>\n</p>\n\n",
        "changelog": "<h4>1.7.5</h4>\n<ul>\n<li>Added: FAQs by Product Tags &#8211; controls added.</li>\n<li>Added: FAQs by Product Categories &#8211; controls added.</li>\n</ul>\n<h4>1.7.4</h4>\n<ul>\n<li>Added: AppSero latest version compatability.</li>\n</ul>\n<h4>1.7.3</h4>\n<ul>\n<li>Fixed: Search input html broken &#8211; issue fixed.</li>\n<li>Fixed: ffw_template shortcode not fetching correct faqs &#8211; issue fixed.</li>\n</ul>\n<h4>1.7.2</h4>\n<ul>\n<li>Enhancement: Template page has been separated from setting submenu.</li>\n</ul>\n<h4>1.7.1</h4>\n<ul>\n<li>Added: WordPress 6.6 compatibility added.</li>\n<li>Added: WooCommerce 9.0 compatibility added.</li>\n<li>Fixed: New faqs can not be added for the &#8216;shop manager&#8217; role &#8211; issue has been fixed.</li>\n<li>Fixed: FAQs schema generated null faqs &#8211; issue has been fixed.</li>\n</ul>\n<h4>1.7.0</h4>\n<ul>\n<li>Added: Introducing &#8216;AI FAQs Generator&#8217;.</li>\n<li>Added: Global FAQs appearance option to set global faqs displaying first or last of other faqs.</li>\n</ul>\n<h4>1.6.4</h4>\n<ul>\n<li>Fixed: Broken UI in product page when empty faqs &#8211; issue has been fixed.</li>\n</ul>\n<h4>1.6.3</h4>\n<ul>\n<li>Enhancement: Removed extra buttons when faqs are published.</li>\n<li>Enhancement: Dashboard UI improvement and more user-friendly.</li>\n</ul>\n<h4>1.6.2</h4>\n<ul>\n<li>Fixed: FAQs fetching from the advanced version previous setup issue has been fixed.</li>\n</ul>\n<h4>1.6.1</h4>\n<ul>\n<li>Added: Filter for Global FAQs [Pro Feature].</li>\n</ul>\n<h4>1.6.0</h4>\n<ul>\n<li>Added: Assign product categories to FAQs compatibility [Pro Feature].</li>\n<li>Fixed: Removing products from the FAQs not working, The issue is fixed.</li>\n</ul>\n<h4>1.5.1</h4>\n<ul>\n<li>Updated: AppSero SDK updated.</li>\n</ul>\n<h4>1.5.0</h4>\n<ul>\n<li>Added: Variation product support (Premium version).</li>\n<li>Added: WordPress 6.4 compatability added.</li>\n<li>Fixed: Bulk faqs causing issue has been fixed.</li>\n<li>Enhancement: Query speedup.</li>\n</ul>\n<h4>1.4.14</h4>\n<ul>\n<li>Added: HPOS (High Performance Order Storage) compatability added.</li>\n</ul>\n<h4>1.4.13</h4>\n<ul>\n<li>Added: Display location to display faqs anywhere on product page [Advanced Version].</li>\n</ul>\n<h4>1.4.12</h4>\n<ul>\n<li>Fixed: Hiding menu issue fixed.</li>\n</ul>\n<h4>1.4.11</h4>\n<ul>\n<li>Added: Advanced FAQs templates support.</li>\n<li>Fixed: Basic template with custom styling issue fixed.</li>\n<li>Fixed: FAQs templates not be displayed after activation issue fixed.</li>\n</ul>\n<h4>1.4.10</h4>\n<ul>\n<li>Added: Dashboard page added.</li>\n</ul>\n<h4>1.4.8</h4>\n<ul>\n<li>Updated: Admin assets version updated.</li>\n</ul>\n<h4>1.4.7</h4>\n<ul>\n<li>Added: Gutenberg editor support.</li>\n</ul>\n<h4>1.4.6</h4>\n<ul>\n<li>Fixed: XPlainer admin menu hide issue has been fixed.</li>\n</ul>\n<h4>1.4.5</h4>\n<ul>\n<li>Added: New template added (Basic template).</li>\n<li>Added: Introduced template page.</li>\n<li>Updated: New settings UI.</li>\n<li>Tested: WordPress 6.3 version compatibility tested.</li>\n</ul>\n<h4>1.4.4</h4>\n<ul>\n<li>Fixed: Clear search input at product edit page.</li>\n<li>Updated: Settings priority input text to number.</li>\n<li>Updated: Settings UI updated to new UI.</li>\n</ul>\n<h4>1.4.3</h4>\n<ul>\n<li>Added: WooCommerce 7.9.0 version compatibility tested.</li>\n<li>Added: WordPress 6.2.0 version compatibility tested.</li>\n</ul>\n<h4>1.4.2</h4>\n<ul>\n<li>Fixed: FAQ Count style broken issue fixed.</li>\n</ul>\n<h4>1.4.1</h4>\n<ul>\n<li>Added: WordPress 6.1.0 version compatibility tested.</li>\n<li>Added: WooCommerce 7.0.0 version compatibility tested.</li>\n<li>Fixed: Undefined index <code>post_type</code> issue has been fixed.</li>\n<li>Fixed: Undefined index <code>ffw_faq_products</code> issue has been fixed.</li>\n<li>Fixed: Deleted FAQ shows in the product issue has been fixed.</li>\n</ul>\n<h4>1.4.0</h4>\n<ul>\n<li>Added: Product selector metabox in FAQ edit page.</li>\n<li>Fixed: Can&#8217;t declare FS_Storage class issue has been fixed.</li>\n</ul>\n<h4>1.3.35</h4>\n<ul>\n<li>Fixed: After deleting all the faqs, new insertion does not work properly has been fixed.</li>\n<li>Updated: Performance boosted.</li>\n</ul>\n<h4>1.3.34</h4>\n<ul>\n<li>Fixed: Question and border color doesn&#8217;t work for classic template has been fixed.</li>\n<li>Updated: Classic template UI updated.</li>\n</ul>\n<h4>1.3.33</h4>\n<ul>\n<li>Fixed: Setting page design broken issue has been fixed.</li>\n</ul>\n<h4>1.3.32</h4>\n<ul>\n<li>Added: WordPress Tested upto 6.0 version.</li>\n</ul>\n<h4>1.3.31</h4>\n<ul>\n<li>Added: Expand/Collapse all faqs settings.</li>\n<li>Added: Dashboard new UI.</li>\n</ul>\n<h4>1.3.30</h4>\n<ul>\n<li>Added: FAQ post type pages index/noindex settings.</li>\n</ul>\n<h4>1.3.29</h4>\n<ul>\n<li>Added: FAQ schema support for faq shortcode.</li>\n</ul>\n<h4>1.3.28</h4>\n<ul>\n<li>Fixed: FAQ tab shows empty faq &#8211; issue has been fixed.</li>\n</ul>\n<h4>1.3.27</h4>\n<ul>\n<li>Added: Order and sorting feature for shortcode, order and orderby parameter added.</li>\n</ul>\n<h4>1.3.26</h4>\n<ul>\n<li>Fixed: Woocommerce Tested upto 6.3 version.</li>\n</ul>\n<h4>1.3.25</h4>\n<ul>\n<li>Fixed: WordPress Tested upto 5.9.2 version.</li>\n</ul>\n<h4>1.3.24</h4>\n<ul>\n<li>Fixed: Fatal Error about Too few arguments has been solved.</li>\n</ul>\n<h4>1.3.23</h4>\n<ul>\n<li>Added: FAQs by categories shortcode added, please see description to know how to add specific categories faqs by shortcode.</li>\n</ul>\n<h4>1.3.22</h4>\n<ul>\n<li>Added: WordPress 5.9 version compatibility added.</li>\n</ul>\n<h4>1.3.21</h4>\n<ul>\n<li>Added: Woocommerce 6.0.0 version compatibility added.</li>\n<li>Fixed: Undefined before &amp; after output for fresh installation &#8211; issue has been fixed.</li>\n</ul>\n<h4>1.3.20</h4>\n<ul>\n<li>Fixed: Undefined function for schema does not work &#8211; issue has been fixed.</li>\n</ul>\n<h4>1.3.19</h4>\n<ul>\n<li>Added: Schema description type options and schema settings. Now user can choose to add description with HTML and without HTML.</li>\n<li>Fixed: New product adding page has faq broken markup &#8211; issue has been fixed.</li>\n</ul>\n<h4>1.3.18</h4>\n<ul>\n<li>Added: Product FAQs Comments support has been added. You just have to enable the comment support from &#8220;Woo FAQs &gt; Settings &gt; Comment&#8221; page.</li>\n</ul>\n<h4>1.3.17</h4>\n<ul>\n<li>Added: Show or Hide FAQs Counter in front with faqs tab. By default, the counter option is hide, you need to enable it from the settings and faqs counter will show for the current product page.</li>\n<li>Fixed: Performance enhancement.</li>\n</ul>\n<h4>1.3.16</h4>\n<ul>\n<li>Added: Extra form submit button added in setting page at the top.</li>\n<li>Added: Documentation page link has been added in the plugin page.</li>\n</ul>\n<h4>1.3.15</h4>\n<ul>\n<li>Fixed: During FAQ search clear an extra faq added in product edit page, the issue has been fixed.</li>\n<li>Fixed: Deleting the extra FAQ not working, the issue has been fixed.</li>\n</ul>\n<h4>1.3.14</h4>\n<ul>\n<li>Added: FAQ answer text color style setting has been added.</li>\n<li>Added: WooCommerce 5.7.1 compatibility added.</li>\n</ul>\n<h4>1.3.13</h4>\n<ul>\n<li>Fixed: Ajax issue of the faqs adding from search in product page has been fixed.</li>\n</ul>\n<h4>1.3.12</h4>\n<ul>\n<li>Improved: Manages boring review notice.</li>\n<li>Improved: WordPress 5.8.1 compatibility tested.</li>\n</ul>\n<h4>1.3.11</h4>\n<ul>\n<li>Added: New Settings for general and dynamic shortcode preview.</li>\n</ul>\n<h4>1.3.10</h4>\n<ul>\n<li>Added: Dynamic product id feature for shortcode to use in single product page has been added.</li>\n</ul>\n<h4>1.3.9</h4>\n<ul>\n<li>Added: WordPress 5.8 version compatibility tested.</li>\n</ul>\n<h4>1.3.8</h4>\n<ul>\n<li>Fixed: FAQ sorting does not work after insert from search and quick add form &#8211; issue has been solved.</li>\n<li>Added: Loader added after adding faq from search options.</li>\n</ul>\n<h4>1.3.7</h4>\n<ul>\n<li>Added: Demo and Documentation link added in readme.</li>\n<li>Fixed: Classic template spacing issue has been fixed.</li>\n</ul>\n<h4>1.3.6</h4>\n<ul>\n<li>Fixed: FAQ answer page load issue fixed.</li>\n<li>Fixed: Code enhancement.</li>\n</ul>\n<h4>1.3.5</h4>\n<ul>\n<li>Added: FAQ Reorder settings added.</li>\n<li>Added: FAQ Answers on page load settings added.</li>\n</ul>\n<h4>1.3.4</h4>\n<ul>\n<li>Fixed: Post content as faq answer showing issue has been fixed.</li>\n</ul>\n<h4>1.3.3</h4>\n<ul>\n<li>Fixed: Trip template Iframe issue has been solved. Thanks to @gao9099 to inform us.</li>\n</ul>\n<h4>1.3.2</h4>\n<ul>\n<li>Fixed: Select2 undefined issue has been solved.</li>\n</ul>\n<h4>1.3.1</h4>\n<ul>\n<li>Added: FAQs counter in product list table, counter show/hide options in settings page.</li>\n<li>Added: FAQs settings instruction has been added, every options are instructed.</li>\n<li>Added: FAQs post type access roles, admin can set roles to access ffw post type.</li>\n</ul>\n<h4>1.3.0</h4>\n<ul>\n<li>Added: FAQs post feature.</li>\n<li>Added: FAQs sortable feature.</li>\n<li>Added: FAQs translation file.</li>\n</ul>\n<h4>1.2.8</h4>\n<ul>\n<li>Added: FAQs width control in style.</li>\n<li>Added: FAQs tab label is now dynamic.</li>\n<li>Fixed: FAQs Schema mainEntity issue solved.</li>\n</ul>\n<h4>1.2.7</h4>\n<ul>\n<li>Tweak: WordPress 5.7 compatibility tested.</li>\n</ul>\n<h4>1.2.6</h4>\n<ul>\n<li>Added: Minified all the assets files.</li>\n</ul>\n<h4>1.2.5</h4>\n<ul>\n<li>Tweak: Admin setting preview templates in apple monitor look.</li>\n</ul>\n<h4>1.2.4</h4>\n<ul>\n<li>Fixed: Popup position wrong has been solved.</li>\n</ul>\n<h4>1.2.3</h4>\n<ul>\n<li>Added: Setting link added as action link.</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>Added: Schema support added.</li>\n<li>Fixed: Global bootstrap file loaded issue solved.</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Fixed: Setting page design broken issue solved.</li>\n<li>Fixed: Undefined function issue solved.</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Added: Custom styling options.</li>\n<li>Fixed: Popup wrong position solved.</li>\n</ul>\n<h4>1.1.7</h4>\n<ul>\n<li>Fixed: Junk file cleaned.</li>\n<li>Tweak: Performance enhancement.</li>\n</ul>\n<h4>1.1.6</h4>\n<ul>\n<li>Added: Plugin compatibility test with wordpress 5.6.</li>\n</ul>\n<h4>1.1.5</h4>\n<ul>\n<li>Added: Media/Image support for faq answer.</li>\n<li>Added: Media/Image support for before/after content.</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Fix: Speed Optimization.</li>\n<li>Fix: Clean junks.</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Added: Shortcode support.</li>\n<li>Fix: Label showing when faqs empty, solved.</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Tweak: Admin panel preview new look.</li>\n<li>Fix: After insert faq answer as html.</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Tweak: Textdomain updated.</li>\n<li>Fix: Pop template animation.</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Added: Pop template.</li>\n</ul>\n<h4>1.0.9</h4>\n<ul>\n<li>Fix: Setting page escaping issues.</li>\n<li>Tweak: Performance enhancement.</li>\n</ul>\n<h4>1.0.8</h4>\n<ul>\n<li>Added: Trip template.</li>\n<li>Fix: Junk cleaned.</li>\n</ul>\n<h4>1.0.7</h4>\n<ul>\n<li>Fix: Coding Standard solved.</li>\n<li>Tweak: Cleaning and enhancement.</li>\n</ul>\n<h4>1.0.6</h4>\n<ul>\n<li>Tweak: Runtime template preview.</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Added: Whitish front template.</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>Added: Product metabox loader.</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Tweak: FAQ options header button new style.</li>\n<li>Fix: FAQ options static line to dynamic.</li>\n<li>Fix: Junk clean up.</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Added: Update faq feature.</li>\n<li>Tweak: DOM manipulation in faq list.</li>\n<li>Fix: Code enhancement.</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Fix: Add or delete faq issue.</li>\n<li>Tweak: Rename Labels.</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>First Release.</li>\n</ul>\n"
    },
    "short_description": "WooCommerce Product FAQs and accordion plugin create FAQs with Google FAQ schema, AI Generator, responsive, comment and customization support.",
    "description": "<p>XPlainer is a feature-packed, flexible, and robust product FAQ plugin for WooCommerce. It might be your best shot if you want to increase sales by answering your customer’s most commonly asked questionnaires smartly.</p>\n<p>👉 <a href=\"https://optemiz.com/xplainer\" rel=\"nofollow ugc\"><strong>Upgrade to PRO</strong></a><br />\n👉 <a href=\"https://optemiz.com/docs/faq-for-woocommerce/overview/\" rel=\"nofollow ugc\"><strong>Documentation</strong></a><br />\n👉 <a href=\"https://wordpress.org/support/plugin/faq-for-woocommerce/\" rel=\"ugc\"><strong>Support</strong></a><br />\n👉 <a href=\"https://www.youtube.com/watch?v=oGLDl0GKh-k&amp;list=PLrEy7YvtgxPhl75Cjd8JeGMeiv_knlPgA\" rel=\"nofollow ugc\"><strong>Tutorials</strong></a></p>\n<p>The main purpose of this FAQ plugin for <a href=\"https://wordpress.org/plugins/woocommerce\" rel=\"ugc\"><strong>WooCommerce</strong></a> is to generate product FAQs and display those in an eye-pleasing way. While displaying the product FAQ list, you get multiple templates with relative designs. Right now, there are 5 templates (free version), and more are cooking up.</p>\n<p>The product FAQ generated by XPlainer templates is compatible with any theme. So, no more worries about plugin or theme compatibility if you choose XPlainer &#8211; the Product FAQ for WooCommerce WordPress plugin.</p>\n<blockquote>\n<p>This advanced WooCommerce Question Answer plugin can skyrocket your sales and increase your business’s online visibility. Indeed, a tool that should not be missed for any product site.</p>\n</blockquote>\n<p>This WordPress Accordion Plugin makes sure to enhance more productive support for your eCommerce store. You can use this plugin to showcase your product information, aka the customer knowledge base, without using any Advanced FAQ Manager. So, utilize the XPlainer &#8211; Product FAQ for WooCommerce plugin to generate FAQs quickly.</p>\n<h3>🔥 VIDEO INTRODUCTION TO THE FAQ FOR WOOCOMMERCE PLUGIN</h3>\n<p>Check the video below to understand the ins and outs of XPlainer -the best WordPress FAQ plugin. By the way, this tutorial is based on the 1.3.0 version. We already added a lot more features after that. So, install the latest version and grow your eCommerce business by utilizing the newly added features.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/oGLDl0GKh-k?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Now, let’s get into the freshly baked features of the XPlainer &#8211; Product FAQ for WooCommerce plugin.</p>\n<h3>⭐ TOP FEATURES</h3>\n<p>Here’s a glimpse of the top features of this ultimate FAQ plugin for <a href=\"https://wordpress.org/plugins/woocommerce\" rel=\"ugc\"><strong>WooCommerce</strong></a>:</p>\n<ul>\n<li>Unlimited FAQs</li>\n<li>FAQs by Product Categories</li>\n<li>FAQs by Product Tags</li>\n<li>AI FAQs Generator (since 1.7.0)</li>\n<li>Individual product FAQ</li>\n<li>Gutenberg Editor support</li>\n<li>Classic Editor support</li>\n<li>FAQ Post support</li>\n<li>Product FAQ comment</li>\n<li>Schema support</li>\n<li>Sorting FAQs</li>\n<li>Shortcode support</li>\n<li>Custom style support</li>\n<li>Fully responsive</li>\n<li>FAQ block support</li>\n<li>Media/Image support in FAQ answer</li>\n<li>Adding content before and after the FAQ list</li>\n<li>HTML content – write answers in HTML</li>\n<li>Multiple Layout – standard templates for front view</li>\n<li>WP Editor for HTML markup, supports WYSIWYG editor</li>\n<li>WooCommerce compatible style for product information tab</li>\n<li>FAQ layout preview</li>\n<li>FAQ tab reorder setting</li>\n<li>Show/hide FAQ answers on page load</li>\n<li>Option of Expand/Collapse All FAQs</li>\n<li>💎 Variation Product FAQs (PRO)</li>\n<li>💎 More Beautiful FAQs Templates (PRO)</li>\n<li>💎 Display Location [display anywhere on Product page] (PRO)</li>\n<li>💎 DYNAMIC PRODUCT ATTRIBUTE (PRO)</li>\n<li>💎 Global FAQS (PRO)</li>\n<li>💎 RTL Support (PRO)</li>\n<li>💎 SEARCH FAQs (PRO)</li>\n<li>💎 Multi Column Support (PRO)</li>\n<li>💎 Many More Features (PRO)</li>\n</ul>\n<p>Let’s explain these features one by one.</p>\n<h3>♾️ UNLIMITED FAQS</h3>\n<p>The XPlainer Product FAQ for WooCommerce plugin allows you to add unlimited FAQs to your eCommerce store. It doesn’t matter how many products you have in your online store, this WooCommerce FAQ plugin got you covered. You can even add global FAQs for your products.</p>\n<h3>🎨 INDIVIDUAL PRODUCT FAQ</h3>\n<p>Every product is special. So, it’s very common for customers to have specific questions about specific products. As an owner, it’s your sole duty to convert those product visitors into probable buyers by answering their custom questions with this FAQ accordion plugin.</p>\n<h3>📭 FAQ POST SUPPORT</h3>\n<p>Besides adding the specific product FAQs, you can also create FAQ posts, aka a WordPress FAQ page with a unique permalink.</p>\n<h3>🗣️ PRODUCT FAQ COMMENT</h3>\n<p>To enable comment support, please go through “<strong>XPlainer &gt; Settings &gt; Comment</strong>” and select enable. The comments and comment forms are fully customizable. Besides, you can also update the comment font, color, design, button styling, etc.</p>\n<p>Customers or visitors can submit their comments to every product FAQ. After that, Admin can either approve or delete comments. The approved comments will be displayed on the front. This commenting feature helps you get customer feedback on your WooCommerce products and the product FAQs.</p>\n<p><a href=\"https://optemiz.com/xplainer\" rel=\"nofollow ugc\"><strong>Upgrade to PRO</strong></a> | <a href=\"https://optemiz.com/docs/faq-for-woocommerce/overview/\" rel=\"nofollow ugc\"><strong>Documentation</strong></a> | <a href=\"https://wordpress.org/support/plugin/faq-for-woocommerce/\" rel=\"ugc\"><strong>Support</strong></a></p>\n<h3>🤖 SCHEMA SUPPORT</h3>\n<p>Increasing search engine visibility is one of the best ways to grow your business. The better ranking you have, the more traffic you will get from the search engines. If you want to rank your product page, then you must use the FAQ schema.</p>\n<h3>🔀 SORTING FAQS</h3>\n<p>The XPlainer WooCommerce FAQ plugin works in a more advanced way than the other FAQ accordion plugins. This FAQ sorting feature might be a great example to support this statement.</p>\n<p>XPlainer allows the users to sort the FAQs under different parameters like ‘<strong>order</strong>’ and ‘<strong>order_by</strong>’. You can also implement this sorting feature by using shortcodes. Check the following feature to learn about using the shortcode feature.</p>\n<h3>🚀 SHORTCODE SUPPORT</h3>\n<p>A smart representation of WooCommerce product FAQs impacts sales directly. That’s why you must display the product FAQs wherever needed. That’s why this WordPress FAQ plugin comes with the shortcode feature.</p>\n<p>ℹ️ You can display <strong>all FAQs</strong> for a random product having FAQs with the default template:</p>\n<pre><code>[ffw_template]\n</code></pre>\n<p>ℹ️ To <strong>display all FAQs for a specific product</strong>, use the following shortcode:</p>\n<pre><code>[ffw_template id=20]\n</code></pre>\n<p>💡 Here, 20 is the product id. Replace it with your desired product id.</p>\n<p>ℹ️ To <strong>display FAQs for specific FAQ categories</strong>, use the following shortcode:</p>\n<pre><code>[ffw_template cat_ids=\"32, 33\"]\n</code></pre>\n<p>💡 If the cat_ids exist, then the product id will be ignored. Here 32 &amp; 33 are FAQ categories id. Please use the comma separator while inputting the data.</p>\n<p>If you want to sort the product FAQs using shortcodes, you can do it by using ‘order’ and ‘order_by’ parameters.</p>\n<p>The supported values for ‘order’ (Default Value: ‘ASC’)<br />\n– ‘DESC’, ‘ASC’</p>\n<p>The supported values for ‘order_by’ (Default Value: ‘ID’)<br />\n– ‘ID’, ‘date’, ‘title’, ‘name’, ‘date’, ‘modified’, ‘comment_count’, ‘author’.</p>\n<p>ℹ️ Use the shortcode below to display FAQs for a current product ID (for the single product page):</p>\n<pre><code>[ffw_template dynamic_post=true]\n</code></pre>\n<p>💡 This shortcode is appropriate for single product pages.</p>\n<p>ℹ️ Use the following shortcode to display all FAQs for a specific product with a specific template by this easy accordion FAQ plugin.</p>\n<pre><code>[ffw_template template=1 id=20]\n</code></pre>\n<p>💡 Use the following template ids to show FAQs</p>\n<ul>\n<li>For Classic Template – 1</li>\n<li>For Whitish Template – 2</li>\n<li>For Trip Template – 3</li>\n<li>For Pop Template – 4</li>\n<li>For Basic Template – 5</li>\n<li>For Glow Template (Pro) – 6</li>\n<li>For Smart Template (Pro) – 7</li>\n<li>For Wow Template (Pro) – 8</li>\n<li>For Zoom Template (Pro) – 9</li>\n</ul>\n<h3>🔎 CUSTOM STYLE SUPPORT</h3>\n<p>To design the product FAQs even better, the XPlainer WooCommerce FAQ plugin comes with custom styling support. By implementing this feature, you can control lots of parameters. Here is the list of those &#8211;</p>\n<ul>\n<li>FAQ wrapper width</li>\n<li>Question text color</li>\n<li>Question background color</li>\n<li>Question background Secondary color (applicable for pop layout)</li>\n<li>Question border color</li>\n<li>Question font size</li>\n<li>Answer text color</li>\n<li>Answer background color</li>\n<li>Answer border color &amp;</li>\n<li>Custom CSS</li>\n</ul>\n<p>💡 The <strong>custom CSS</strong> is the most prioritized CSS. Adding custom CSS will override the default styling.</p>\n<h3>🎯 FULLY RESPONSIVE</h3>\n<p>Like the FAQ schema, the responsiveness of a website doesn&#8217;t affect only the website’s ranking on the search engines. Besides that, it improves the user experience too. Fortunately, this XPlainer FAQ accordion plugin is compatible with almost all third-party themes.</p>\n<p>Hence, this FAQ WordPress plugin can display the questions and answers on every product page by maintaining responsiveness. So, no more worrying about presenting the product information on multiple devices. XPlainer FAQ plugin will maintain your website&#8217;s responsiveness on every page.</p>\n<h3>🎦 MEDIA/IMAGE SUPPORT IN FAQ ANSWER</h3>\n<p>A picture is worth a thousand words. While answering the questions, you might need to use some images or videos to explain the answer better. To help you in this situation, XPlainer allows the insertion of digital media in the answers.</p>\n<p>It not only helps to answer the questions better but also answers them more appropriately. You can insert every media file that is supported by WordPress.</p>\n<h3>🔁 ADDING CONTENT BEFORE AND AFTER THE FAQ LIST</h3>\n<p>The XPlainer FAQ plugin doesn&#8217;t only add FAQ questions and answers. Besides that, you can also add a heading and footer within the FAQ wrapper. You can update these contents by navigating to <strong>XPlainer &gt; Settings page</strong>. Then select the <strong>General</strong> tab and scroll down. The WYSIWYG text editor for adding content before and after the FAQs is at the bottom of the <strong>General</strong> tab.</p>\n<h3>🎢 MULTIPLE LAYOUTS – STANDARD TEMPLATES FOR FRONT VIEW</h3>\n<p>This Product FAQ for WooCommerce has five built-in templates to choose from. These are &#8211;</p>\n<ul>\n<li>Classic Template</li>\n<li>Whitish Template</li>\n<li>Trip Template</li>\n<li>Pop Template</li>\n<li>Basic Template (since 1.4.5)</li>\n<li>Glow Template (Pro)</li>\n<li>Smart Template (Pro)</li>\n<li>Wow Template (Pro)</li>\n<li>Zoom Template (Pro)</li>\n</ul>\n<h3>🔗 WOOCOMMERCE COMPATIBLE STYLE FOR PRODUCT INFORMATION TAB</h3>\n<p>The XPlainer Product FAQ plugin is totally compatible with WooCommerce. From the coding standard to optimization and designing, XPlainer blends with WooCommerce perfectly. So, when you create your WooCommerce FAQ questions and answers with the XPlainer plugin, it will properly adjust with WooCommerce.</p>\n<h3>💻 FAQ LAYOUT PREVIEW IN SETTING PAGE</h3>\n<p>The XPlainer FAQ plugins come with multiple colorful and SEO-friendly FAQ layouts. Right now, there are 4 different layouts to choose from. You can check these layouts by navigating to <strong>Woo FAQ &gt; Settings</strong> page. Then select the General tab and select your desired design from the <strong>Layout</strong> option.</p>\n<h3>📐 FAQ TAB REORDER SETTING</h3>\n<p>By default, the FAQs you have added will be displayed in the last tab. But, you can control the tab position from the XPlainer settings page if needed. To do that, go to <strong>XPlainer &gt; Settings</strong> page and then find the <strong>Tab Priority</strong> option under the <strong>General</strong> tab.</p>\n<h3>🎬 SHOW/HIDE FAQ ANSWERS ON PAGE LOAD</h3>\n<p>By default, the product FAQs are listed just like a simple FAQ accordion style. If you want to read the answer to a specific question, you have to click on that question, and it will show the answer.</p>\n<p>But, XPlainer is designed to offer something extra than others. So, you can set whether you want to show or hide the answers while the product page loads initially.</p>\n<h3>👨‍💻 OPTION TO EXPAND/COLLAPSE ALL FAQS</h3>\n<p>Besides controlling the FAQs visibility from the dashboard panel, the XPlainer WooCommerce FAQ manager plugin lets the customer control it from the front-end interface.</p>\n<h3>⚡ Maximize the efficiency of your WooCommerce FAQ creation process</h3>\n<p>You will get a lot of effort minimizing features from the free version of this WooCommerce faq accordion plugin. But you will definitely enjoy the pro version since it saves your time and resources more efficiently.</p>\n<p>With XPlainer Pro, your sales will increase dramatically because it will enhance the standard of your WooCommerce products by making them more informative.</p>\n<h3>Pro Features of XPlainer:</h3>\n<h3>👕 FAQs by Product Categories</h3>\n<p>Assign product categories to FAQs. It will minimize your time to connect FAQs with products.</p>\n<h3>👕 FAQs by Product Tags</h3>\n<p>Assign product tags to FAQs. It will minimize your time to connect FAQs with products.</p>\n<h3>👕 Variation Product FAQs (PRO FEATURE)</h3>\n<p>Easily create FAQs for variation products and easily engage with your customers by answering their variation queries about the child products.</p>\n<h3>📑 More Beautiful Templates (PRO FEATURE)</h3>\n<p>With premium FAQ templates, you can display standard product FAQs and boost your sales.</p>\n<h3>🟦 Display Location (PRO FEATURE)</h3>\n<p>Display faqs anywhere on the product page, it will give you the flexibility to adjust faqs with your design theme interface.</p>\n<h3>⚛️ DYNAMIC PRODUCT ATTRIBUTE (PRO FEATURE)</h3>\n<p>Reduce your effort by assigning a particular FAQ to any number of products in your WooCommerce store. Yes, with XPlainer PRO, it&#8217;s that easy to create and display FAQs accordion based on product attributes. Simply place the product attribute on the answer of your FAQ and display that attribute-based answer.</p>\n<p>Let’s say there is a FAQ assigned for thousands of products on your online store. You can set the product attribute in answer to show product-specific responses for numerous products. So, you don’t need to create the same FAQ for different products individually. Instead, specify a product attribute in answer to obtain a Dynamic product value of each product for the same FAQ.</p>\n<h3>🌐 Global FAQs (PRO FEATURE)</h3>\n<p>There must be some common FAQs that you want to set for all your WooCommere products. However creating the identical FAQ individually for all your products makes the FAQ creation process tedious. Thus, Xplainer offers the ultimate FAQ creation experience with this feature that minimizes effort.</p>\n<p>No matter how many products you have, you can set the same FAQ for your entire <a href=\"https://wordpress.org/plugins/woocommerce\" rel=\"ugc\"><strong>WooCommerce</strong></a> store. Simply create one FAQ using XPlainer and set it as a Global FAQ, and that&#8217;s it. Your Global FAQ will appear on every product FAQ section of your online store.</p>\n<h3>⬅️ RTL SUPPORT (PRO FEATURE)</h3>\n<p>XPlainer already supports several languages, but it transcends all boundaries with RTL support. RTL languages such as Arabic, Aramaic, Azeri, Hebrew, Kurdish, Persian, etc, are supported in XPlainer PRO.</p>\n<h3>🔍 SEARCH FAQs (PRO FEATURE)</h3>\n<p>XPlainer is indeed one of the best WordPress accordion plugins for WooCommerce. You’ll be able to find the exact FAQ within seconds using this FAQ accordion tool.It offers a flexible search option for your WooCommerce product FAQs. The comprehensive search functionality in the FAQ area will allow you to search out the FAQ you are looking for.</p>\n<h3>☲ MULTI-COLUMN SUPPORT (PRO FEATURE)</h3>\n<p>Typically a FAQ section comes with a simple outlook that contains questions, answers, and a faq dropdown option. Using XPlainer PRO, you can generate FAQs with unique viewing experiences for the users. It allows you to personalize the FAQ area with Multi-column support.</p>\n<p>Users can now see more FAQs and access them without even scrolling the screen. You can simply enable or disable multi-column FAQs using this amazing tool. For user convenience, this feature displays more FAQs inside a relatively compact viewing area.</p>\n<p><a href=\"https://optemiz.com/xplainer\" rel=\"nofollow ugc\"><strong>Upgrade to PRO</strong></a> | <a href=\"https://optemiz.com/docs/faq-for-woocommerce/overview/\" rel=\"nofollow ugc\"><strong>Documentation</strong></a> | <a href=\"https://wordpress.org/support/plugin/faq-for-woocommerce/\" rel=\"ugc\"><strong>Support</strong></a></p>\n<p>💚 Satisfied with our XPlainer FAQ plugin?<br />\n👉 <a href=\"https://www.facebook.com/optemiz\" rel=\"nofollow ugc\"><strong>Join our Facebook Page</strong></a><br />\n⭐ <a href=\"https://wordpress.org/support/plugin/faq-for-woocommerce/reviews/?filter=5\" rel=\"ugc\"><strong>Rate us on WordPress</strong></a> [Your Review, Our Inspiration]</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.7.5.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/faq-for-woocommerce/assets/screenshot-1.png?rev=2955633",
            "caption": "FAQ settings from 'XPlainer &gt; Settings' menu"
        },
        {
            "src": "https://ps.w.org/faq-for-woocommerce/assets/screenshot-2.png?rev=2955633",
            "caption": "FAQ Templates"
        },
        {
            "src": "https://ps.w.org/faq-for-woocommerce/assets/screenshot-3.png?rev=3173861",
            "caption": "Add products from 'Add New FAQ'"
        },
        {
            "src": "https://ps.w.org/faq-for-woocommerce/assets/screenshot-4.png?rev=2955633",
            "caption": "Trip Template"
        },
        {
            "src": "https://ps.w.org/faq-for-woocommerce/assets/screenshot-5.png?rev=2955633",
            "caption": "Classic Template"
        },
        {
            "src": "https://ps.w.org/faq-for-woocommerce/assets/screenshot-6.png?rev=2955633",
            "caption": "Whitish Template"
        },
        {
            "src": "https://ps.w.org/faq-for-woocommerce/assets/screenshot-7.png?rev=2955633",
            "caption": "Pop Template"
        },
        {
            "src": "https://ps.w.org/faq-for-woocommerce/assets/screenshot-8.png?rev=2955633",
            "caption": "Basic Template (since 1.4.5)"
        },
        {
            "src": "https://ps.w.org/faq-for-woocommerce/assets/screenshot-9.png?rev=2955633",
            "caption": "In product tab in edit page, faq options"
        }
    ],
    "tags": {
        "faq": "faq",
        "faqs": "faqs",
        "product-faq": "Product FAQ.",
        "question-and-answer": "Question and Answer",
        "woocommerce-faqs": "woocommerce faqs"
    },
    "stable_tag": "1.7.5",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.0.6.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.0.7.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.0.8.zip",
        "1.0.9": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.0.9.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.1.7.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.2.6.zip",
        "1.2.7": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.2.7.zip",
        "1.2.8": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.2.8.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.1.zip",
        "1.3.10": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.10.zip",
        "1.3.11": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.11.zip",
        "1.3.12": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.12.zip",
        "1.3.13": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.13.zip",
        "1.3.14": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.14.zip",
        "1.3.15": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.15.zip",
        "1.3.16": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.16.zip",
        "1.3.17": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.17.zip",
        "1.3.18": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.18.zip",
        "1.3.19": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.19.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.2.zip",
        "1.3.20": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.20.zip",
        "1.3.21": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.21.zip",
        "1.3.22": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.22.zip",
        "1.3.23": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.23.zip",
        "1.3.24": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.24.zip",
        "1.3.25": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.25.zip",
        "1.3.26": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.26.zip",
        "1.3.27": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.27.zip",
        "1.3.28": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.28.zip",
        "1.3.29": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.29.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.3.zip",
        "1.3.30": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.30.zip",
        "1.3.31": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.31.zip",
        "1.3.32": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.32.zip",
        "1.3.33": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.33.zip",
        "1.3.34": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.34.zip",
        "1.3.35": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.35.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.8.zip",
        "1.3.9": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.3.9.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.1.zip",
        "1.4.10": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.10.zip",
        "1.4.11": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.11.zip",
        "1.4.12": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.12.zip",
        "1.4.13": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.13.zip",
        "1.4.14": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.14.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.5.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.6.zip",
        "1.4.7": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.7.zip",
        "1.4.8": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.8.zip",
        "1.4.9": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.4.9.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.5.1.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.6.3.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.6.4.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.7.0.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.7.2.zip",
        "1.7.3": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.7.3.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.7.4.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.1.7.5.zip",
        "trunk": "https://downloads.wordpress.org/plugin/faq-for-woocommerce.zip"
    },
    "business_model": "commercial",
    "repository_url": "",
    "commercial_support_url": "https://optemiz.com/xplainer/",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/faq-for-woocommerce/assets/banner-772x250.png?rev=2714646",
        "high": "https://ps.w.org/faq-for-woocommerce/assets/banner-1544x500.png?rev=2714620"
    },
    "icons": {
        "1x": "https://ps.w.org/faq-for-woocommerce/assets/icon-128x128.png?rev=2955591"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}