{
    "name": "FA Lite &#8211; WP responsive slider plugin",
    "slug": "featured-articles-lite",
    "version": "3.1.10",
    "author": "<a href=\"http://www.codeflavors.com\">CodeFlavors</a>",
    "author_profile": "https://profiles.wordpress.org/constantinboiangiu/",
    "contributors": {
        "codeflavors": {
            "profile": "https://profiles.wordpress.org/codeflavors/",
            "avatar": "https://secure.gravatar.com/avatar/cb731278d8a118d5d8f44aad6ba6327d?s=96&d=monsterid&r=g",
            "display_name": "CodeFlavors"
        },
        "constantinboiangiu": {
            "profile": "https://profiles.wordpress.org/constantinboiangiu/",
            "avatar": "https://secure.gravatar.com/avatar/d99cb95f86b1d8d428a213859cddbbad?s=96&d=monsterid&r=g",
            "display_name": "Constantin Boiangiu"
        }
    },
    "requires": "5.5",
    "tested": "6.5.5",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 74,
    "ratings": {
        "5": 8,
        "4": 0,
        "3": 1,
        "2": 1,
        "1": 3
    },
    "num_ratings": 13,
    "support_url": "https://wordpress.org/support/plugin/featured-articles-lite/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 800,
    "downloaded": 169338,
    "last_updated": "2024-04-02 9:07am GMT",
    "added": "2010-10-25",
    "homepage": "http://www.codeflavors.com/featured-articles-pro/",
    "sections": {
        "description": "<p><strong>Featured Articles</strong> is a <a href=\"http://www.codeflavors.com/featured-articles-pro/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"Best WordPress slider plugin\" rel=\"nofollow ugc\">WordPress slider plugin</a> that allows you to create sliders in your blog pages directly from your already written content, be it posts or pages.<br />\nFor a quick tutorial see <a href=\"http://www.codeflavors.com/documentation/featured-articles-pro-3/creating-sliders/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"Best WordPress slider plugin\" rel=\"nofollow ugc\">How to create a WordPress slider with Featured Articles</a>.</p>\n<p>Coming with multiple, configurable WordPress slider themes and the possibility to extend it with new themes and slider scripts, Featured Articles is the best WordPress slider plugin available.</p>\n<p>Lite version features:</p>\n<ul>\n<li>Responsive and mobile ready;</li>\n<li>Allows you to create sliders based on <strong>Nivo slider</strong> by implementing a slider theme compatible with Nivo slider;</li>\n<li>Post and page sliders;</li>\n<li>Navigation arrows and pagination;</li>\n<li>Multiple slider themes;</li>\n<li>Third party slider scripts implementation;</li>\n<li>Preloading functionality on page load;</li>\n<li>Lots of actions and filters for customizing output and functionality;</li>\n<li>SEO friendly;</li>\n<li>Packed with layout and animation options;</li>\n<li>Various slider publishing methods: shortcodes, widgets, automatic placement, PHP code that can be used in templates.</li>\n<li>&#8230; and more.</li>\n</ul>\n<p>With the ability to change any slider aspect by making use of slider themes that are delivered with the plugin, almost anything is possible.</p>\n<p>Also, it offers the possibility to create additional themes (with some PHP, CSS and JavaScript knowledge) that can have custom written animations by extending the base functionality of the main slider script.</p>\n<p><strong>Please note that the video presents PRO features not available in Lite version.</strong><br />\nhttps://vimeo.com/113921051</p>\n<p>Sliders can be published in WordPress by any of these ways (or all at the same time):</p>\n<ul>\n<li>manual placement directly into your WordPress theme template files (requires editing the template file you want to place a slider in and add a small piece of code);</li>\n<li>shortcode placement directly into a post or page content;</li>\n<li>widget placement into any widget areas your theme has;</li>\n<li>automatic placement in any page just above the page loop.</li>\n</ul>\n<p>While Lite version of Featured Articles provides all the neccessary tools for creating a beautiful WordPress slider, PRO version comes in addition with:</p>\n<ul>\n<li>more slider themes, all video enabled and responsive;</li>\n<li><strong>video enabled</strong> custom slides for <strong>YouTube and Vimeo</strong> that can embed videos in your WordPress sliders;</li>\n<li>custom slides that can be created using the visual editor;</li>\n<li>sliders can be created from any post type (including custom post type) registered on your WordPress website;</li>\n<li>for posts and custom post types, selection of posts by taxonomies;</li>\n<li>mixing of posts, custom posts, pages and custom slides into the same slider;</li>\n<li>visual color scheme editor that allows you to blend-in slideshows into your overall blog design without having to write a single line of CSS;</li>\n<li>priority support and debugging for 3&#8217;rd party plugins and themes conflicts;</li>\n<li>cached sliders for faster page loading time;</li>\n<li>possibility to attach videos to any slide (post, custom post, page or custom slide);</li>\n<li>possibility to import video title, description and image as slide title, content and slide image or featured image;</li>\n<li>dynamic slider areas management that allow slider publishing in your WordPress website by simple drag and drop;</li>\n<li>sliders created from WordPress Gallery images;</li>\n<li>and more&#8230;</li>\n</ul>\n<p><strong>Important links:</strong></p>\n<ul>\n<li><a href=\"http://www.codeflavors.com/documents/featured-articles-pro-3/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"Featured Articles for WordPress documentation\" rel=\"nofollow ugc\">Documentation</a> on plugin usage and slider theme structure;</li>\n<li><a href=\"http://www.codeflavors.com/codeflavors-forums/forum/featured-articles-3-0/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"CodeFlavors Community Forums\" rel=\"nofollow ugc\">Forums</a> (while we try to keep up with the forums here, please post any requests on our forums for a faster response);</li>\n<li><a href=\"http://www.codeflavors.com/featured-articles-pro/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"Best WordPress slider plugin\" rel=\"nofollow ugc\">WordPress slider plugin homepage</a></li>\n<li><a href=\"http://www.codeflavors.com/news/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"CodeFlavors news on Featured Articles for WordPress plugin\" rel=\"nofollow ugc\">CodeFlavors News</a> &#8211; <a href=\"http://www.codeflavors.com/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"CodeFlavors - devoted to WordPress\" rel=\"nofollow ugc\">CodeFlavors</a> is our new home.</li>\n</ul>\n<p>These are just a few of the things this plugin can do so just go on and try it for yourself!</p>\n<p>The plugin can be used to display your fresh content on your homepage, display related posts on single post pages, put special offers into sliders to create attention and any other way you see fit.</p>\n<h3>Troubleshooting</h3>\n<p>Plugin is guaranteed to work on a clean WordPress install. Since themes and other plugins don&#8217;t always play nice, there are a few things you could check if sliders won&#8217;t work in your pages:</p>\n<ol>\n<li>Check that only one jquery file is loaded. Most times, a manually loaded jQuery version in theme header or by a plugin may be the cause. Look in your page source in browser and see if that&#8217;s the problem.</li>\n<li>Plugins merging JavaScript and CSS files may also cause problems. In this case, it&#8217;s all about god intentions with bad results.</li>\n<li>Use the proper WordPress version (4 +).</li>\n<li>See if your theme footer.php file calls wp_footer().</li>\n</ol>\n<p>If all options are exhausted, you can always ask for help on our forums at <a href=\"http://www.codeflavors.com/codeflavors-forums/forum/featured-articles-3-0/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"Featured Articles 3 for WordPress forum\" rel=\"nofollow ugc\">CodeFlavors Featured Articles WP forum</a>. We&#8217;ll help you figure out things.</p>\n",
        "installation": "<p><strong>Before updating, make sure you back-up all your custom made themes.</strong></p>\n<p>Version 3.0 is a complete plugin rewrite. Previous slider themes won&#8217;t be compatible by default with this version. You will be able to choose the previous themes but they will issue PHP errors when used.</p>\n<p>Sliders created with Featured Articles 2.X will be converted to current version automatically when activating Featured Articles Lite 3.0.</p>\n<p>Now, here are the update instructions (automatic update will also work):</p>\n<p>If you are upgrading to the current version, make sure you backup all the files of the previous installation. After you backup, make sure that under plugin Setting page, the option to completely unistall the plugin (including content) is unchecked since version 3.X will automatically convert your existing sliders to current version when activating.</p>\n<p>Next, either update version 3.X from WordPress admin page Plugins or by FTP. If updatng by FTP, make sure that you first remove the previous plugin version completely before uploading version 3.X.</p>\n",
        "changelog": "<h4>3.1.10</h4>\n<ul>\n<li>Solved accidental bugs introduced in version 3.1.9;</li>\n<li>Used PHP Code Beautifier and Fixer to fix (some) issues with code.</li>\n</ul>\n<h4>3.1.9</h4>\n<ul>\n<li>Solved deprecation notices in PHP 8.3.3;</li>\n<li>Checked compatibility with WordPress 6.5.</li>\n</ul>\n<h4>3.1.8</h4>\n<ul>\n<li>Compatibility with WordPress 6.3.1.</li>\n</ul>\n<h4>3.1.7</h4>\n<ul>\n<li>Solved a few compatibility issues with WordPress 4.7.</li>\n</ul>\n<h4>3.1.6</h4>\n<ul>\n<li>Solved a bug that on some occasions prevented WP redirect when saving a slider by issuing several undefined index notices as reported <a href=\"https://wordpress.org/support/topic/not-working-1478/\" title=\"Bug report\" rel=\"ugc\">here</a>.</li>\n</ul>\n<h4>3.1.5</h4>\n<ul>\n<li>Solved a bug that was displaying the slider even if no content was found.</li>\n</ul>\n<h4>3.1.4</h4>\n<ul>\n<li>Implemented alternate text for slider images to make sliders ASA compliant. By default alternate text will be taken from the media image.</li>\n<li>Implemented a new filter &#8220;the_fa_image_alt_text&#8221; that allows developers to override the default media alternate text. Passes as parameters the attachment image ID, the slide post ID and the slider post ID.</li>\n</ul>\n<h4>3.1.3</h4>\n<ul>\n<li>Solved taxonomy pagination bug when choosing slider content</li>\n<li>Renamed text domain to &#8220;featured-articles-lite&#8221; to allow translations</li>\n<li>Implemented 2 new filters: _fa_slider_posts_query_args and _fa_slider_mixed_content_query_args that can be used to modify slides query</li>\n<li>If slider theme can&#8217;t be found when displaying a slider, if current user is admin, an error will be displayed to signal that the theme is missing </li>\n</ul>\n<h4>3.1.2</h4>\n<ul>\n<li>Solved a bug that was preventing slide custom image from being displayed when image(s) were found in post content.</li>\n</ul>\n<h4>3.1.1</h4>\n<ul>\n<li>Plugin compatible with WordPress 4.3 (scheduled for release on August 18th, 2015);</li>\n<li>Modified default slider image size option when using WP sizes from &#8220;thumbnail&#8221; to &#8220;full&#8221;;</li>\n<li>Modified default slide option &#8220;Allow slide editing on post edit&#8221; from false to true; this will display the slide edit metabox when editing posts;</li>\n<li>Added image autodetection in post content even when displaying sliders in front-end;</li>\n<li>Added new option in plugin Settings page to prevent image autodetect when displaying sliders;</li>\n<li>Refined image detection regexp to include images having only src attribute;</li>\n<li>Prevent &#8216;Auto Draft&#8217; titles to be set when slide editing is set on posts and pages (from plugin Settings page).</li>\n</ul>\n<h4>3.1</h4>\n<ul>\n<li>New slider theme based on <strong>Nivo Slider</strong> script; combines the Nivo Slider script with the powerful plugin slider settings;</li>\n<li>Modified back-end slider editing functionality to accomodate Nivo Slider theme options;</li>\n<li>Modified slider class to allow selective script enqueue from slider theme functions file;</li>\n<li>Added new option in plugin Settings page that allows removal of PRO pages from plugin admin menu;</li>\n<li>New meta panel on slider editing screen with links directing to different tutorials for plugin usage;</li>\n<li>New option for theme <strong>Simple</strong> to adjust the height to each slide content while navigating slides (in panel <strong>Slider Output</strong>, tab <strong>Layout</strong>);</li>\n<li>Solved a CSS bug for slider themes that wasn&#8217;t applying styling to paragraphs.</li>\n</ul>\n<h4>3.0.4</h4>\n<ul>\n<li>Solved a bug that was preventing a redirect when saving plugin settings on some installations.</li>\n</ul>\n<h4>3.0.3</h4>\n<ul>\n<li>New option under plugin Settings that allow you to display slide settings on post/page edit;</li>\n<li>Solved a display bug for sliders published above the loop that wasn&#8217;t displayign correctly the pages where the slider is published in sliders admin table;</li>\n<li>Solved a bug in WP versions prior to 4 that was preventing the editor from working correctly.</li>\n</ul>\n<h4>3.0.2</h4>\n<ul>\n<li>Solved a bug in slider script that was displaying only a part of the image;</li>\n<li>Solved a bug in admin slide edit modal screen that wasn&#8217;t removing the slide image when action was initiated;</li>\n<li>Introduced a new option for theme Simple that controls if the bar timer should be displayed or not when autoslide is on.</li>\n</ul>\n<h4>3.0.1</h4>\n<ul>\n<li>Added new metabox in Slider edit page that displays the PHP code that can be used to display a slider directly into WP theme files;</li>\n<li>Solved a bug related to manual slider placement by using the PHP code that was generating a PHP warning.</li>\n</ul>\n<h4>3.0</h4>\n<ul>\n<li>Complete plugin rewrite and internal functionality</li>\n</ul>\n<h4>2.5.4</h4>\n<ul>\n<li>Solves compatibility with qTranslate plugin (slide text not being translated).</li>\n</ul>\n<h4>2.5.3</h4>\n<ul>\n<li>New option to remove credits from sliders;</li>\n<li>Credit image is self hosted;</li>\n<li>HTTPS enabled;</li>\n<li>Solves small bugs related to display tables in administration.</li>\n</ul>\n<h4>2.5.2</h4>\n<ul>\n<li>Solved issue in slider themes that was causing second slide to show for an instant when page was loading. Modified files: all display.php files in all slider themes.</li>\n</ul>\n<h4>2.5.1</h4>\n<ul>\n<li>Solved WordPress 3.5 error fatal error related to $wpdb-&gt;prepare()</li>\n</ul>\n<h4>2.5</h4>\n<ul>\n<li>Multibyte string support.</li>\n<li>Image preloaders for featured images in slides.</li>\n<li>Function to retrieve slider settings ( FA_get_option() ) can now take arrays as well as string as argument.</li>\n<li>WP Touch PRO compatibility.</li>\n<li>Template function ( the_fa_author() ) and options to display author name in sliders.</li>\n<li>New option to link author name to author posts page.</li>\n<li>Image resize in sliders to exact dimensions entered by user (uses default WordPress functionality; images will be cropped if bigger).</li>\n<li>New responsive theme ( Classic Responsive ) adapted from theme Classic.</li>\n</ul>\n<h4>2.4.9.2</h4>\n<ul>\n<li>resolved podPress related bug that was displaying raw podPress player code into slides. Instead of applying all the_content filters, it applies only the default WordPress filters (wptexturize, convert_smilies, convert_chars, wpautop, shortcode_unautop).</li>\n</ul>\n<h4>2.4.9.1</h4>\n<ul>\n<li>Solved bug that was causing remote images not to be displayed into the slider.</li>\n</ul>\n<h4>2.4.9</h4>\n<ul>\n<li>New options to hide title, text, date and read more link in slides when editing or creating a slider.</li>\n<li>Re-designed automatic placement options in pages and categories.</li>\n<li>WordPress editor button to easily place slider shortcode in post or page.</li>\n<li>Solved bug that was displaying order of pages wrong when creating/editing a slider.</li>\n<li>Images in sliders now have width and height set on them for increased overall page performance.</li>\n<li>New template function to display the date in slides ( the_fa_date() ).</li>\n<li>New template function that will hide any wrapping element if all other elements are hidden ( title, text, date &#8230; ).</li>\n<li>New option to allow all tags in slide description.</li>\n</ul>\n<h4>2.4.8</h4>\n<ul>\n<li>Compatibility with WPtouch plugin by verifying if WPtouch Restricted Mode option is on and preventing any sliders from displaying. A new option under Settings can also prevent any sliders from displaying in WPtouch mobile themes but if Restricted Mode is on, even if allowed from Featured Articles Lite, no sliders will display.</li>\n<li>Compatibility with qTranslate plugin. No action needed to enable it.</li>\n</ul>\n<h4>2.4.7</h4>\n<ul>\n<li>Solves problem of post/page text and title not being replaced by custom ones specified in post/page editing.</li>\n</ul>\n<h4>2.4.6</h4>\n<ul>\n<li>Solves the problem of multiple sliders displayed into the same page that have same slider theme but different color schemes in settings.</li>\n</ul>\n<h4>2.4.5</h4>\n<ul>\n<li>Solved small bug related to linked slide titles target attribute value not being between double quotes.</li>\n</ul>\n<h4>2.4.4</h4>\n<ul>\n<li>Compatibility with jQuery 1.7 from WordPress 3.3 for mouse wheel navigation in front-end sliders.</li>\n<li>Automatic placement enabled by default when installing/updating the plugin (previously set disabled and could be enabled from plugin Settings page).</li>\n<li>WordPress 3.3 compatibility for gallery uploaded images with the new flash uploader.</li>\n</ul>\n<h4>2.4.3</h4>\n<ul>\n<li>Backwards compatibility for old Light and Dark themes. Current version merged these 2 themes into a single one called Classic that uses color scheme option to change between Light and Dark. If in FeaturedArticles 2.3 you were using the default Light and/or Dark themes, on update they will get deleted and no longer available. This update solves the problem by automatically assigning Light and Dark to Classic with the appropriate color scheme.</li>\n</ul>\n<h4>2.4.2</h4>\n<ul>\n<li>Repaired dead/wrong links from WordPress admin plugin pages.</li>\n</ul>\n<h4>2.4.1</h4>\n<ul>\n<li>Option to change the default slider themes folder from within the plugin contents to anywhere into wp_content folder. Option is available in plugin menu-&gt;Settings page.</li>\n<li>Solved bug that was keeping dark color palette selected by default for all themes making Classic Light unavailable.</li>\n<li>Solved bug that was removing the link that places custom featured image on posts/pages in WordPress gallery when search of filtering was performed.</li>\n</ul>\n<h4>2.4</h4>\n<ul>\n<li>Image attachment to slide is made using the default WordPress Media Gallery</li>\n<li>Templating functions for themes to display information in sliders</li>\n<li>Themes can extend the default slider script to create custom animations (requires jQuery knowledge)</li>\n<li>Themes can add custom fields to slider editing form that are unique for them (options that apply only to a theme)</li>\n<li>Custom written slides that can be created with the default WordPress editor (PRO)</li>\n<li>Slideshows created from pages or featured content (mix of pages, posts and custom slides) have slides ordering option by drag-and-drop</li>\n<li>Custom titles, text and read-more link texts individual for every post/page or custom slide</li>\n<li>Themes can have multiple color palette stylesheets to allow a better blending with the website without having to change the main theme stylesheet</li>\n<li>And probably many other things that we forgot during all this time 🙂</li>\n</ul>\n<h4>2.3.7</h4>\n<ul>\n<li>Solved bug that disabled custom image placement on post/page when Google Analyticator plugin was installed</li>\n<li>\n<p>Solved bug that caused automatic image detection within post content not to be performed because of plugin stripping HTML from post content. Please note that you need to do a small change if you display the slider with a custom theme made by you or others. In display.php inside your theme folder change</p>\n<p>post_content, $image ? $options[&#8216;desc_truncate&#8217;] : $options[&#8216;desc_truncate_noimg&#8217;]);?&gt;</li>\n</ul>\n<p>into</p>\n<pre><code>&lt;?php echo FA_truncate_text($post-&gt;FA_post_content, $image ? $options['desc_truncate'] : $options['desc_truncate_noimg']);?&gt;\n</code></pre>\n<h4>2.3.6</h4>\n<ul>\n<li>Solved shortcode bug that caused the slider not to be displayed into the exact place the shortcode was placed in post content (changes made in file: featured_articles.php)</li>\n<li>Solved stylesheet issue not being loaded for developer link at the bottom of the slider (changes made in file: featured_articles.php)</li>\n</ul>\n<h4>2.3.5</h4>\n<ul>\n<li>Solved IE8 bug that caused autoslide not to start (error message: Message: &#8216;currentKey&#8217; is null or not an object)</li>\n<li>Solved issue with autoslide that wasn&#8217;t correctly reset when navigation was clicked</li>\n<li>Made links in article description have the same color as the text</li>\n</ul>\n<h4>2.3.4</h4>\n<ul>\n<li>Created shortcode support to display sliders inside post/page content.</li>\n</ul>\n<h4>2.3.3</h4>\n<ul>\n<li>Solved Allowed tags option bug that wasn&#8217;t taken into account by the plugin when displaying posts in slider.</li>\n</ul>\n<h4>2.3.2</h4>\n<ul>\n<li>Solved z-index issue in themes causing side navigation not to be able to be clicked </li>\n</ul>\n<h4>2.3.1</h4>\n<ul>\n<li>Solved JavaScript bug that made only the first post clickable.</li>\n</ul>\n<h4>2.3</h4>\n<ul>\n<li>Slider script developed with jQuery (this solves the conflict between different JavaScript frameworks)</li>\n<li>Creation/management and placement of multiple sliders into the same page or all over your blog</li>\n<li>Widget support provided (go to Appearance-&gt;Widgets and look for FA Lite Slider)</li>\n<li>Easy manual placement with code to be implemented provided for each slider created</li>\n<li>Slightly modified themes to make it work with multiple sliders</li>\n</ul>\n<h4>2.2</h4>\n<ul>\n<li>User specified HTML tags allowed into featured post description displayed into the slider</li>\n<li>Meta box to ease the way custom images and featured posts are inserted into the slider</li>\n<li>Possibility to display posts or pages in random order into the slider</li>\n<li>Featured articles slider resizable from administration area ( default values get specified into stylesheet )</li>\n<li>Author link ( if you want to support the plugin ) that can be disabled from administration</li>\n<li>Slider settings access is restricted to administrators only with the possibility to give access to any other group of users available in wordpress</li>\n<li>Menu no longer available under Settings-&gt;Featured articles but directly in WordPress admin sidebar ( look for FA Lite )</li>\n<li>Themes modified to support featured posts slider resizing ( both CSS files and display files have changed a little ). If you update the plugin and you made custom themes, back-up first your themes folder.</li>\n<li>Custom post/pages images improved usage and interface</li>\n<li>Easy setting for featured posts and pages to be displayed into the slider</li>\n<li>Image detection improved even more. Currently there are 2 ways to set an image for a certain post: by setting the image as a custom field and second by detecting the image from post content. For images detected in post content, the plugin tries to identify the exact attachment from the database and if found, it automatically sets the image into the custom field. The only thing it needs is for the image to have the width and height attributes set in HTML.</li>\n<li>New theme available (Smoke).</li>\n</ul>\n<h4>2.1</h4>\n<ul>\n<li>Date format in featured post short description displays according to blog date format option setting</li>\n<li>Editable text for read more link</li>\n<li>New option to set featured post title as link</li>\n<li>Image detection no more made inside theme but done by function ( less code in slider theme )</li>\n<li>New option to display the slider manually by adding a function to theme files ( function is FA_display_slider &#8211; see installation for instructions ) </li>\n<li>Slider mouse wheel navigation can be enabled/disabled from wp admin</li>\n<li>Links in featured posts text allowed </li>\n<li>For automatic placement, option to choose loop to display on top of </li>\n</ul>\n<h4>2.0</h4>\n<p>Initial release for the new redesigned WordPress Featured Articles</p>\n"
    },
    "short_description": "WordPress slider plugin for Featured Content that can create responsive, video enabled sliders from your existing WordPress content.",
    "description": "<p><strong>Featured Articles</strong> is a <a href=\"http://www.codeflavors.com/featured-articles-pro/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"Best WordPress slider plugin\" rel=\"nofollow ugc\">WordPress slider plugin</a> that allows you to create sliders in your blog pages directly from your already written content, be it posts or pages.<br />\nFor a quick tutorial see <a href=\"http://www.codeflavors.com/documentation/featured-articles-pro-3/creating-sliders/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"Best WordPress slider plugin\" rel=\"nofollow ugc\">How to create a WordPress slider with Featured Articles</a>.</p>\n<p>Coming with multiple, configurable WordPress slider themes and the possibility to extend it with new themes and slider scripts, Featured Articles is the best WordPress slider plugin available.</p>\n<p>Lite version features:</p>\n<ul>\n<li>Responsive and mobile ready;</li>\n<li>Allows you to create sliders based on <strong>Nivo slider</strong> by implementing a slider theme compatible with Nivo slider;</li>\n<li>Post and page sliders;</li>\n<li>Navigation arrows and pagination;</li>\n<li>Multiple slider themes;</li>\n<li>Third party slider scripts implementation;</li>\n<li>Preloading functionality on page load;</li>\n<li>Lots of actions and filters for customizing output and functionality;</li>\n<li>SEO friendly;</li>\n<li>Packed with layout and animation options;</li>\n<li>Various slider publishing methods: shortcodes, widgets, automatic placement, PHP code that can be used in templates.</li>\n<li>&#8230; and more.</li>\n</ul>\n<p>With the ability to change any slider aspect by making use of slider themes that are delivered with the plugin, almost anything is possible.</p>\n<p>Also, it offers the possibility to create additional themes (with some PHP, CSS and JavaScript knowledge) that can have custom written animations by extending the base functionality of the main slider script.</p>\n<p><strong>Please note that the video presents PRO features not available in Lite version.</strong><br />\nhttps://vimeo.com/113921051</p>\n<p>Sliders can be published in WordPress by any of these ways (or all at the same time):</p>\n<ul>\n<li>manual placement directly into your WordPress theme template files (requires editing the template file you want to place a slider in and add a small piece of code);</li>\n<li>shortcode placement directly into a post or page content;</li>\n<li>widget placement into any widget areas your theme has;</li>\n<li>automatic placement in any page just above the page loop.</li>\n</ul>\n<p>While Lite version of Featured Articles provides all the neccessary tools for creating a beautiful WordPress slider, PRO version comes in addition with:</p>\n<ul>\n<li>more slider themes, all video enabled and responsive;</li>\n<li><strong>video enabled</strong> custom slides for <strong>YouTube and Vimeo</strong> that can embed videos in your WordPress sliders;</li>\n<li>custom slides that can be created using the visual editor;</li>\n<li>sliders can be created from any post type (including custom post type) registered on your WordPress website;</li>\n<li>for posts and custom post types, selection of posts by taxonomies;</li>\n<li>mixing of posts, custom posts, pages and custom slides into the same slider;</li>\n<li>visual color scheme editor that allows you to blend-in slideshows into your overall blog design without having to write a single line of CSS;</li>\n<li>priority support and debugging for 3&#8217;rd party plugins and themes conflicts;</li>\n<li>cached sliders for faster page loading time;</li>\n<li>possibility to attach videos to any slide (post, custom post, page or custom slide);</li>\n<li>possibility to import video title, description and image as slide title, content and slide image or featured image;</li>\n<li>dynamic slider areas management that allow slider publishing in your WordPress website by simple drag and drop;</li>\n<li>sliders created from WordPress Gallery images;</li>\n<li>and more&#8230;</li>\n</ul>\n<p><strong>Important links:</strong></p>\n<ul>\n<li><a href=\"http://www.codeflavors.com/documents/featured-articles-pro-3/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"Featured Articles for WordPress documentation\" rel=\"nofollow ugc\">Documentation</a> on plugin usage and slider theme structure;</li>\n<li><a href=\"http://www.codeflavors.com/codeflavors-forums/forum/featured-articles-3-0/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"CodeFlavors Community Forums\" rel=\"nofollow ugc\">Forums</a> (while we try to keep up with the forums here, please post any requests on our forums for a faster response);</li>\n<li><a href=\"http://www.codeflavors.com/featured-articles-pro/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"Best WordPress slider plugin\" rel=\"nofollow ugc\">WordPress slider plugin homepage</a></li>\n<li><a href=\"http://www.codeflavors.com/news/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"CodeFlavors news on Featured Articles for WordPress plugin\" rel=\"nofollow ugc\">CodeFlavors News</a> &#8211; <a href=\"http://www.codeflavors.com/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"CodeFlavors - devoted to WordPress\" rel=\"nofollow ugc\">CodeFlavors</a> is our new home.</li>\n</ul>\n<p>These are just a few of the things this plugin can do so just go on and try it for yourself!</p>\n<p>The plugin can be used to display your fresh content on your homepage, display related posts on single post pages, put special offers into sliders to create attention and any other way you see fit.</p>\n<h3>Troubleshooting</h3>\n<p>Plugin is guaranteed to work on a clean WordPress install. Since themes and other plugins don&#8217;t always play nice, there are a few things you could check if sliders won&#8217;t work in your pages:</p>\n<ol>\n<li>Check that only one jquery file is loaded. Most times, a manually loaded jQuery version in theme header or by a plugin may be the cause. Look in your page source in browser and see if that&#8217;s the problem.</li>\n<li>Plugins merging JavaScript and CSS files may also cause problems. In this case, it&#8217;s all about god intentions with bad results.</li>\n<li>Use the proper WordPress version (4 +).</li>\n<li>See if your theme footer.php file calls wp_footer().</li>\n</ol>\n<p>If all options are exhausted, you can always ask for help on our forums at <a href=\"http://www.codeflavors.com/codeflavors-forums/forum/featured-articles-3-0/?utm_source=wordpressorg&amp;utm_medium=readme&amp;utm_campaign=fa_lite\" title=\"Featured Articles 3 for WordPress forum\" rel=\"nofollow ugc\">CodeFlavors Featured Articles WP forum</a>. We&#8217;ll help you figure out things.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/featured-articles-lite.3.1.10.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/featured-articles-lite/assets/screenshot-1.png?rev=1185960",
            "caption": "Slider theme \"Simple\" - slide without image"
        },
        {
            "src": "https://ps.w.org/featured-articles-lite/assets/screenshot-2.png?rev=1185960",
            "caption": "Slider theme \"Simple\" - slide with image"
        },
        {
            "src": "https://ps.w.org/featured-articles-lite/assets/screenshot-3.png?rev=1185960",
            "caption": "Slider theme \"Nivo Slider\""
        },
        {
            "src": "https://ps.w.org/featured-articles-lite/assets/screenshot-4.png?rev=1185960",
            "caption": "Create new slider screen"
        },
        {
            "src": "https://ps.w.org/featured-articles-lite/assets/screenshot-5.png?rev=1185960",
            "caption": "Plugin Settings page"
        }
    ],
    "tags": {
        "custom-post-slider": "custom post slider",
        "responsive-slider": "responsive slider",
        "wordpress-slider": "wordpress slider",
        "wordpress-slider-plugin": "wordpress slider plugin"
    },
    "stable_tag": "3.1.10",
    "versions": {
        "2.0": "https://downloads.wordpress.org/plugin/featured-articles-lite.2.0.zip",
        "2.1": "https://downloads.wordpress.org/plugin/featured-articles-lite.2.1.zip",
        "2.2": "https://downloads.wordpress.org/plugin/featured-articles-lite.2.2.zip",
        "2.3": "https://downloads.wordpress.org/plugin/featured-articles-lite.2.3.zip",
        "2.4.7": "https://downloads.wordpress.org/plugin/featured-articles-lite.2.4.7.zip",
        "2.4.8": "https://downloads.wordpress.org/plugin/featured-articles-lite.2.4.8.zip",
        "2.4.9.1": "https://downloads.wordpress.org/plugin/featured-articles-lite.2.4.9.1.zip",
        "2.4.9.2": "https://downloads.wordpress.org/plugin/featured-articles-lite.2.4.9.2.zip",
        "2.5": "https://downloads.wordpress.org/plugin/featured-articles-lite.2.5.zip",
        "2.5.2": "https://downloads.wordpress.org/plugin/featured-articles-lite.2.5.2.zip",
        "2.5.4": "https://downloads.wordpress.org/plugin/featured-articles-lite.2.5.4.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/featured-articles-lite.3.0.1.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/featured-articles-lite.3.0.2.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/featured-articles-lite.3.0.4.zip",
        "3.1": "https://downloads.wordpress.org/plugin/featured-articles-lite.3.1.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/featured-articles-lite.3.1.1.zip",
        "3.1.10": "https://downloads.wordpress.org/plugin/featured-articles-lite.3.1.10.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/featured-articles-lite.3.1.2.zip",
        "3.1.3": "https://downloads.wordpress.org/plugin/featured-articles-lite.3.1.3.zip",
        "3.1.9": "https://downloads.wordpress.org/plugin/featured-articles-lite.3.1.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/featured-articles-lite.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/featured-articles-lite/assets/banner-772x250.jpg?rev=1045864",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/featured-articles-lite/assets/icon-128x128.jpg?rev=1045881"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 74,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/featured-articles-lite/blueprint.json?rev=3064355"
        }
    ],
    "preview_link": "https://wordpress.org/plugins/featured-articles-lite/?preview=1",
    "language_packs": []
}