{
    "name": "FeedWordPress",
    "slug": "feedwordpress",
    "version": "2024.0511",
    "author": "<a href=\"https://feedwordpress.radgeek.com/contact/\">C. Johnson</a>",
    "author_profile": "https://profiles.wordpress.org/radgeek/",
    "contributors": {
        "radgeek": {
            "profile": "https://profiles.wordpress.org/radgeek/",
            "avatar": "https://secure.gravatar.com/avatar/4993f53ef6c496a1e873396fc50cbbcd?s=96&d=monsterid&r=g",
            "display_name": "C. Johnson"
        }
    },
    "requires": "4.5",
    "tested": "6.5.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 86,
    "ratings": {
        "5": 41,
        "4": 7,
        "3": 2,
        "2": 3,
        "1": 6
    },
    "num_ratings": 59,
    "support_url": "https://wordpress.org/support/plugin/feedwordpress/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 10000,
    "downloaded": 1292429,
    "last_updated": "2024-05-11 20:09:00",
    "added": "2007-11-21",
    "homepage": "http://feedwordpress.radgeek.com/",
    "sections": {
        "description": "<ul>\n<li>Author: <a href=\"http://feedback.radgeek.com/contact\" rel=\"nofollow ugc\">C. Johnson</a></li>\n<li>Project URI: <a href=\"http://feedwordpress.radgeek.com/\" rel=\"nofollow ugc\">http://feedwordpress.radgeek.com/</a></li>\n<li>License: GPL 2. See License below for copyright jots and tittles.</li>\n</ul>\n<p>FeedWordPress is an Atom/RSS aggregator for WordPress. It syndicates content from feeds that you choose into your WordPress weblog, and then the content it syndicates appears as a series of special posts in your WordPress posts database. If you syndicate several feeds then you can use WordPress&#8217;s posts database and templating engine as the back-end of an aggregation (&#8220;planet&#8221;) website. It was developed, originally, as a utility/hobby project, because I needed a more flexible replacement for <a href=\"https://web.archive.org/web/20051029095046/http://www.planetplanet.org/\" rel=\"nofollow ugc\">Planet</a> for aggregator sites that I administered.</p>\n<p>FeedWordPress is designed with flexibility, ease of use, and ease of configuration in mind. You&#8217;ll need a working installation of WordPress (version <a href=\"https://codex.wordpress.org/Version_4.5\" rel=\"nofollow ugc\">4.5</a> or later), and it helps to have SFTP or FTP access to your web host. The ability to create cron jobs on your web host is helpful but not required.</p>\n<h3>Using and Customizing FeedWordPress</h3>\n<p>FeedWordPress has many options which can be accessed through the WordPress Dashboard, and a lot of functionality accessible programmatically through WordPress templates or plugins. For further documentation of the ins and outs, see the documentation at the <a href=\"http://feedwordpress.radgeek.com/\" rel=\"nofollow ugc\">FeedWordPress project homepage</a>.</p>\n<h3>License</h3>\n<p>The FeedWordPress plugin is copyright © 2005-2021 by Charles Johnson. It uses code derived or translated from:</p>\n<ul>\n<li><a href=\"http://laughingmeme.org/archives/002203.html\" rel=\"nofollow ugc\">wp-rss-aggregate.php</a> by <a href=\"kellan@protest.net\" rel=\"nofollow ugc\">Kellan Elliot-McCrea</a></li>\n<li><a href=\"http://www.simplepie.org/\" rel=\"nofollow ugc\">SimplePie</a> feed parser by Ryan Parman, Geoffrey Sneddon, Ryan McCue, et al.</li>\n<li><a href=\"http://magpierss.sourceforge.net/\" rel=\"nofollow ugc\">MagpieRSS</a> feed parser by <a href=\"kellan@protest.net\" rel=\"nofollow ugc\">Kellan Elliot-McCrea</a></li>\n<li><a href=\"http://diveintomark.org/projects/feed_finder/\" rel=\"nofollow ugc\">Ultra-Liberal Feed Finder</a> by <a href=\"mark@diveintomark.org\" rel=\"nofollow ugc\">Mark Pilgrim</a></li>\n<li><a href=\"https://wordpress.org/\" rel=\"ugc\">WordPress Blog Tool and Publishing Platform</a></li>\n</ul>\n<p>according to the terms of the <a href=\"http://www.gnu.org/copyleft/gpl.html\" rel=\"nofollow ugc\">GNU General Public License</a>.</p>\n<p>This program is free software; you can redistribute it and/or modify it under the terms of the <a href=\"http://www.gnu.org/copyleft/gpl.html\" rel=\"nofollow ugc\">GNU General Public License</a> as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.</p>\n<p>This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.</p>\n",
        "installation": "<p>To use FeedWordPress, you will need:</p>\n<ul>\n<li>\n<p>an installed and configured copy of <a href=\"https://wordpress.org/\" rel=\"ugc\">WordPress</a> (version 4.5 or later).</p>\n</li>\n<li>\n<p>the ability to install new plugins on your site using either WordPress&#8217;s Plugins Repository, SFTP, FTP or shell access to your web host</p>\n</li>\n</ul>\n<h4>New Installations</h4>\n<ol>\n<li>\n<p>Download the FeedWordPress installation package and extract the files on your computer.</p>\n</li>\n<li>\n<p>Create a new directory named <code>feedwordpress</code> in the <code>wp-content/plugins</code> directory of your WordPress installation. Use an FTP or SFTP client to upload the contents of your FeedWordPress archive to the new directory that you just created on your web host.</p>\n</li>\n<li>\n<p>Log in to the WordPress Dashboard and activate the FeedWordPress plugin.</p>\n</li>\n<li>\n<p>Once the plugin is activated, a new <strong>Syndication</strong> section should appear in your WordPress admin menu. Click here to add new syndicated feeds, set up configuration options, and determine how FeedWordPress will check for updates. For help, see the <a href=\"http://feedwordpress.radgeek.com/wiki/quick-start\" rel=\"nofollow ugc\">FeedWordPress Quick Start</a> page.</p>\n</li>\n</ol>\n<h4>Upgrades</h4>\n<p>To <em>upgrade</em> an existing installation of FeedWordPress to the most recent release:</p>\n<ol>\n<li>\n<p>Download the FeedWordPress installation package and extract the files on your computer.</p>\n</li>\n<li>\n<p>Upload the new PHP files to <code>wp-content/plugins/feedwordpress</code>, overwriting any existing FeedWordPress files that are there.</p>\n</li>\n<li>\n<p>Log in to your WordPress administrative interface immediately in order to see whether there are any further tasks that you need to perform to complete the upgrade.</p>\n</li>\n<li>\n<p>Enjoy your newer and hotter installation of FeedWordPress!</p>\n</li>\n</ol>\n",
        "changelog": "<h4>2024.0511</h4>\n<ul>\n<li>COMPATIBILITY FIX FOR &#8220;Uncaught TypeError: in_array()&#8221; ERROR: This version includes a fix to a fatal error that some users encountered with some versions of PHP 8. If after upgrading to a recent version of FeedWordPress, you encountered a message about a &#8220;critical error&#8221; or error messages indicating something like &#8220;Uncaught TypeError: in_array() Argument #2&#8221;, then a couple of code changes in this version should hopefully resolve that error for you.</li>\n</ul>\n<h4>2024.0428</h4>\n<ul>\n<li>\n<p>IMPORTANT SECURITY FIX: This version includes an important fix for a security vulnerability reported to me through Wordfence and WordPress support channels.</p>\n<p>Vulnerability CVE-2024-0839 allowed for an insecure Direct Object Reference which could allow contents of Private, Pending, or otherwise non-Published post objects to be accessed by an attacker possessing or generating the internal guid URI of the post object. This vulnerability has been eliminated in the current version; to protect your site&#8217;s security PLEASE BE SURE TO UPGRADE AS SOON AS POSSIBLE to version 2024.0428 or later, via the WordPress Plugin Repository or via Github.</p>\n</li>\n<li>\n<p>ADDITIONAL COMPATIBILITY FIXES AND CODE CLEANUP: This version includes numerous fixes to improve compatibility fixes for ongoing new releases of PHP, and does some additional code clean-up to remove some obsolete methods of generating output, and to do a better job of sanitizing input and escaping output in the FeedWordPress administrative dashboard. It features numerous fixes and improvements contributed by user @GwynethLlewelyn and several new hooks allowing for translation of interface elements.</p>\n</li>\n</ul>\n<h4>2022.0222</h4>\n<ul>\n<li>ADDITIONAL CODE CLEANUP: This version does some additional code clean-up to remove some obsolete methods of generating output, and to do a better job of sanitizing input and escaping output in the FeedWordPress administrative dashboard.</li>\n</ul>\n<h4>2022.0204</h4>\n<ul>\n<li>ADDITIONAL CODE CLEANUP: This version does some additional code clean-up to remove some obsolete methods of generating output, and to do a better job of sanitizing input and escaping output in the FeedWordPress administrative dashboard.</li>\n</ul>\n<h4>2022.0123</h4>\n<ul>\n<li>\n<p>IMPORTANT SECURITY FIX: This version includes an important fix for a security vulnerability reported to me through WPScan and WordPress support channels.</p>\n<p>Vulnerability CVE-2021-25055 allowed for an XSS (Cross-Site Scripting) attack using a specially crafted URL for a page within the FeedWordPress admin interface. (To be exploited, an existing user with login credentials that allow them to access the FeedWordPress dashboard would have to follow the malicious URL and log in.) This vulnerability has been corrected in the current version; to protect your site&#8217;s security PLEASE BE SURE TO UPGRADE AS SOON AS POSSIBLE to version 2022.0123 or later, via the WordPress Plugin Repository or via Github.</p>\n</li>\n<li>\n<p>BUG FIXES: Fixes a number of small possible bugs when creating new syndicated posts under unusual conditions &#8212; a sanity check is built in to avoid infinite loops in case of certain unexpected error outcomes when creating new users; some more possible sources of PHP 8 &#8220;Countable&#8221; warnings are eliminated, etc.</p>\n</li>\n</ul>\n<h4>2021.0713</h4>\n<ul>\n<li>\n<p>WORDPRESS 5.6, 5.7.x COMPATIBILITY FIXES. This release introduces fixes to annoying or worse warnings resulting from<br />\nthe deprecation of WordPress&#8217;s built-in WP_Feed_Cache class. This should resolve the problem if you are encountering<br />\nannoying, worrying, or breaking problems related to the PHP warnings: &#8220;Deprecated: class-wp-feed-cache.php is<br />\n<strong>deprecated</strong> since version 5.6.0&#8243;, and/or &#8220;Message: ./cache is not writable. Make sure you&#8217;ve set the<br />\ncorrect relative or absolute path, and that the location is server-writable.&#8221;</p>\n</li>\n<li>\n<p>Fixes PHP warning for &#8220;count(): Parameter must be an array or an object that implements Countable in<br />\n&#8230;/wp-content/plugins/feedwordpress/feedwordpress.php on line 1566&#8221;</p>\n</li>\n<li>\n<p>Miscellaneous fixes for other missing variable and global warnings.</p>\n</li>\n<li>\n<p>Code cleanup and reorganization to allow better modularization of error messages, warning dialogs, and extended text.</p>\n</li>\n</ul>\n<h4>2020.0818</h4>\n<ul>\n<li>\n<p>WORDPRESS 5.5 COMPATIBILITY FIXES, RESOLVES WARNING NOTICES OR WP-ADMIN LOCKOUT. WordPress 5.5 incorporated a newer release of SimplePie, version 1.5.5, which is pretty rad, but FeedWordPress classes that relied on SimplePie 1.3.1&#8217;s method signatures would then produce PHP warning notices. That should be pretty innocuous, but depending on web server configurations, some users could get locked out of their own wp-admin interface by the display of error notices in the browser at inopportune times. In any case, I have added code to switch between backward-compatible modules for SimplePie 1.3.1 or updated modules compatible with SimplePie 1.5.5, based on the version available in your WordPress installation; so these notices and their untoward effects should be eliminated.</p>\n</li>\n<li>\n<p>PHP 7.4 COMPATIBILITY FIX: Magic quotes were deprecated and then removed back in PHP 5.x, and in PHP 7.4 the vestigial <code>get_magic_quotes_gpc()</code> function has been deprecated. We don&#8217;t need to worry about it anymore for versions of PHP still supported by WordPress. The reference to the function in the MyPHP utility class caused PHP warnings in more recent versions of PHP; so it has now been removed.</p>\n</li>\n<li>\n<p>DIVERS BUG FIXES AND PHP WARNING NOTICES RESOLVED, thanks to @oppiansteve&#8217;s fixes and pull requests. (Thanks!)</p>\n</li>\n<li>\n<p>JQUERY COMPATIBILITY FIXES, RESOLVES MYSTERIOUS VANISHING FEED SELECTOR IN WP-ADMIN. An upgrade to WordPress&#8217;s packaged jQuery caused the drop-down box for feed settings (in Syndication &gt; Feeds &amp; Updates, Syndication &gt; Posts &amp; Links, etc.) to vanish shortly after pageload. That was awkward, so I disabled the now-incompatible interface chrome that was causing it to vanish.</p>\n</li>\n</ul>\n<h4>2020.0118</h4>\n<ul>\n<li>\n<p>WORDPRESS COMPATIBILITY TESTING. It&#8217;s been some time since a public release of FeedWordPress; so I have tested the plugin functionality with recent versions of WordPress and incorporated a number of PHP 7-compatibility related tweaks.</p>\n</li>\n<li>\n<p>FEED PARSING FAULT TOLERANCE. If FeedWordPress fails to parse a feed using normal XML functions, it will attempt to convert any named entities that may be causing a problem, and then try to parse again. Props to @inanimatt for utility functions that help make the code go.</p>\n</li>\n<li>\n<p>PAUSING UPDATES. In Syndication &gt; Feeds &amp; Updates, you can now instruct FeedWordPress to temporarily pause or resume updating feeds &#8212; whatever update method you are using, you can put new updates on hold for a while so that you can fiddle with setings, run tests, or do whatever you need to do before allowing updates to resume.</p>\n</li>\n<li>\n<p>CODE MODERNIZATION, PHP 7.x COMPATIBILITY AND CLEANUP AND REORGANIZATION. I have been dusting out nooks and crannies in the code and hiving more functionality off into discrete modules. A number of FeedWordPress users have also offered pull requests to eliminate bothersome PHP notices and warnings related to PHP 7.x compatibility &#8212; in particular removing uses of deprecated <code>each()</code> functions, and avoiding use of <code>count()</code> on null values &#8212; which I have rolled into the main branch release. Props to @manzoorwanijk, @tristanleboss, @martinburchell and @oppiansteve</p>\n</li>\n</ul>\n<h4>2017.1020</h4>\n<ul>\n<li>\n<p>ADD BOILERPLATE / CREDITS FEATURE AVAILABLE IN POSTS &amp; LINKS SETTINGS PANEL. I have added a new settings panel to the off-the-shelf features of FeedWordPress, under Syndication &gt; Posts &amp; Links (or under the Posts settings page for any individual feed), which allows you to define boilerplate text that should appear in connection with every syndicated post, or with every post syndicated from a particular feed. So, for example, if you want each syndicated post to include a byline reading &#8220;This is a syndicated post, reprinted from (LINK TO ORIGINAL SOURCE WEBSITE).&#8221;, you could set up this byline from within the FeedWordPress settings interface, by going to the Boilerplate / Credits panel, and adding a line to appear BEFORE the CONTENT of each syndicated post, using the text and shortcode &#8220;This is a syndicated post, reprinted from [source].&#8221; For those of you who have corresponded with me about this feature before, you may be familiar with it from the long-standing &#8220;experimental&#8221; add-on, FWP+: Add Attribution; I&#8217;ve decided that it&#8217;s been enough years, and I&#8217;ve had enough requests, that the Add Attribution feature may as well be included in the main FeedWordPress code.</p>\n<p>Back when FeedWordPress was first created, the assumption was that a well-behaved aggregator would include boilerplate text to indicate the source of syndicated posts, but that the best way to do this was to provide a set of syndication-specific template tags so that the administrator setting up the site could edit their Theme template files with constructs like:</p>\n<pre><code>&lt;?php if (is_syndicated()) : ?&gt;\n&lt;p class=\"byline\"&gt;This post by &lt;?php the_author(); ?&gt; originally\nappeared at &lt;a href=\"&lt;?php the_syndication_source_link(); ?&gt;\"&gt;&lt;?php\nthe_syndication_source(); ?&gt;&lt;/a&gt;.&lt;/p&gt;\n&lt;?php else : ?&gt;\n&lt;p class=\"byline\"&gt;By &lt;?php the_author(); ?&gt;.&lt;/p&gt;\n&lt;?php endif; ?&gt;\n</code></pre>\n<p>You can still do this, of course, and for maximum expressive power and flexibility, it is certainly the best way to do it. Template Tags are documented here: <a href=\"http://feedwordpress.radgeek.com/wiki/templates/\" rel=\"nofollow ugc\">http://feedwordpress.radgeek.com/wiki/templates/</a> However, (1) it requires writing PHP code, which not everyone is comfortable doing; and (2) it requires altering template files within your Theme, which is not always possible, especially given the increasing role that prepackaged commercial themes have come to play in the WordPress ecosystem. So, now, you can get some basic features for adding boilerplate text and attribution credits even without touching your template files, and without having to add custom add-ons for FeedWordPress. Enjoy!</p>\n</li>\n<li>\n<p>MINOR CODE MODERNIZATION, PHP 7.1 COMPATIBILITY AND BUG FIXES. This project is now 12+ years old (good lord), and there are still some places where code was written at a time when PHP was a very different language from what it is now. Props to @david-robinson-practiceweb for pointing out and sending a pull request to fix some instances where obsolete PHP reference notation (<code>&amp;$q</code> on parameters and so on) created a compatibility problem for PHP 7.1. Props to an email correspondent for pointing out a place in SyndicatedPost where excerpts should be generated from post content using encoding-aware mb_substr(), instead of naively running them through substr(). I&#8217;ve begun making some efforts throughout to begin auditing some of the creakiest old code in the project, to update what needs updating and improve documentation throughout.</p>\n</li>\n</ul>\n<h4>2017.0913</h4>\n<ul>\n<li>\n<p>PARTIAL FIX FOR 2X DUPLICATE POSTS APPEARING ON DUAL HTTP/HTTPS SITES: Some users reported an issue in which their FeedWordPress sites, which are over both insecure HTTP and over HTTPS, would pick up exactly 2 copies of every post or almost every post from certain feeds, and where the guids for each of the pair of duplicate posts would look exactly alike, except for a difference in the protocol, for example:</p>\n<pre><code>http://www.example.com/?guid=c1cd28da39e8d7babcf6499983aca545\nhttps://www.example.com/?guid=c1cd28da39e8d7babcf6499983aca545\n</code></pre>\n<p>&#8230; where www.example.com is the server that your own copy of FeedWordPress is installed. This release of FeedWordPress normalizes post guid prefixes so as to avoid or limit the scope of this problem.</p>\n</li>\n<li>\n<p>PHP 7 Compatibility: eliminate remaining sources of PHP 7 compatibility-check failures &#8212; remove the use of depreciated mysql_error() function, and make sure all classes make use of __construct() convention for constructors.</p>\n</li>\n<li>\n<p>AVOID &#8220;PHP Warning: shell_exec() has been disabled for security reasons in [&#8230;]/feedwordpress/feeds-page.php on line 197&#8221;: FeedWordPress uses the PHP shell_exec() function in a very narrowly limited way for information gathering, trying to find the real path to curl or wget on your system, so that it can give as realistic as possible a recommendation for the sample crontab line displayed in Syndication &gt; Feeds &amp; Updates. Some web hosting environments disable shell_exec for security reasons (since it could in theory be used to do a lot more stuff than the very limited information gathering FWP uses it for); in which case, this part of the code in FeedWordPress could spit out a nasty-looking and potentially worrisome-looking error message. So, now this code is fenced with checks to make sure that shell_exec is available, before FWP attempts to make use of it.</p>\n</li>\n</ul>\n<h4>2016.1213</h4>\n<ul>\n<li>\n<p>WORDPRESS BACKWARD COMPATIBILITY FOR VERSIONS [4.5, 4.7]: This change fixes a fatal PHP error (on some web server configurations you&#8217;d see the message &#8220;Fatal error: require_once(): Failed opening required &#8216;[&#8230;]/wp-includes/class-wp-feed-cache.php'&#8221; on others, you might just see an HTTP 500 Internal Server Error or a blank page) when using FeedWordPress with versions of WordPress before 4.7. A    change that I introduced to avoid a code module that had been deprecated in version 4.7 ended up relying on code modules that were only introduced as of version 4.7; so now, instead, FeedWordPress attempts to detect which modules the current version of the WordPress core makes available, and load the right modules depending on your WordPress version.</p>\n<p>In theory, up to this point, FeedWordPress supported any version of WordPress from version 3.0 onward. In practice, version 3.0 was released over 6 years ago, and I can realistically commit only to testing out new   releases of FeedWordPress with a few prior versions of WordPress; so I&#8217;ve updated the &#8220;Requires at least&#8221; field to version 4.5, the first major release issued in 2016. If you&#8217;ve really got to use FeedWordPress with older versions of WordPress, it will probably still work with any moderately modern release of WordPress, but I won&#8217;t promise to keep it working with releases of WordPress that are more than about a year old.</p>\n</li>\n</ul>\n<h4>2016.1211</h4>\n<ul>\n<li>\n<p>WORDPRESS COMPATIBILITY: Tested with new versions of WordPress up to 4.7.</p>\n</li>\n<li>\n<p>PHP WARNINGS UNDER WP 4.7: Eliminated cause of a PHP warning under WP 4.7 &#8220;Parameter 1 to FeedWordPressHTTPAuthenticator::set_auth_options expected to be reference&#8221; Warnings were due to a change in how http_api_curl hook is sometimes called in WP 4.7; so I changed the signature of the event handling method to avoid the notice. Props to @cogdog, @froomkin, @gwynethllewelyn et al. for flagging the issue and @garymarkfuller for suggesting a preliminary fix to the issue that was fairly similar to the solution I ended up adopting.</p>\n</li>\n<li>\n<p>PHP 7 and PHP Strict Standards compatibility changes: @alexiskulash @daidais and @zoul0813 all sent pull requests through Github to fix some issues from a very old code base that has made its way from PHP 3.x through 5.x to the roll-out of PHP 7. Class methods should now fare better under modern versions of PHP and generate fewer &#8220;Deprecated&#8221; notices.</p>\n</li>\n<li>\n<p>IMPROVEMENTS TO SCHEDULED AND AUTOMATIC UPDATES:  use wp_loaded hook to check for magic URL parameters and to execute updates, to do pageload-based automatic updates, etc. Ensures that anything plugins or themes need to do in init to set up custom post types, taxonomies, etc. will be done before the update_feedwordpress updates are attempted. If you saw posts not getting put into the correct custom post type or custom taxonomies or similar problems when performing scheduled updates, but the problem seemed to go away when you manually performed updates through the wp-admin interface, then you might be able to solve those problems with this update.</p>\n</li>\n</ul>\n<h4>2016.0420</h4>\n<ul>\n<li>\n<p>WORDPRESS COMPATIBILITY: Tested with new versions of WordPress up to 4.5.</p>\n</li>\n<li>\n<p>FILTERS AND ADD-ONS: Allow filters and add-ons to filter terms and taxonomy (categories, tags, custom taxonomies, etc.) more thoroughly and more fine-grainedly using syndicated_post_terms_match, syndicated_post_terms_match_{taxonomy},  syndicated_post_terms_unfamiliar, syndicated_post_terms_mapping, syndicated_item_feed_terms, and syndicated_item_preset_terms filters.</p>\n</li>\n<li>\n<p>FILTERS AND ADD-ONS: Globals $fwp_channel and $fwp_feedmeta REMOVED. These global variables, originally introduced to allow filters access to information about the source feed in <code>syndicated_item</code> filters were deprecated 6+ years ago. If you have any filters or add-ons which still depend on these global variables, you&#8217;ve been using obsolete techniques and you should see about fixing them to access data about the source feed using the SyndicatedPost::link element instead. For documentation, see  the FeedWordPress documentation wiki at <a href=\"http://feedwordpress.radgeek.com/wiki/syndicatedpost\" rel=\"nofollow ugc\">http://feedwordpress.radgeek.com/wiki/syndicatedpost</a> and <a href=\"http://feedwordpress.radgeek.com/wiki/syndicatedlink\" rel=\"nofollow ugc\">http://feedwordpress.radgeek.com/wiki/syndicatedlink</a>.</p>\n</li>\n<li>\n<p>BUGFIX: Syndication &gt; Diagnostics HTTP diagnostic test widget was broken due to a dumb error on my part. Now fixed.</p>\n</li>\n<li>\n<p>SMALL CODING CHANGES: Lots of small changes to code organization, incorporation of some PHP 5.x coding conventions, etc.</p>\n</li>\n</ul>\n<h4>2015.0514</h4>\n<ul>\n<li>\n<p>IMPORTANT SECURITY UPDATE: This version includes two important fixes for potential security vulnerabilities reported to me through support channels.</p>\n<p>The first is a common problem across several plugins due to an ambiguity in the WordPress documentation and a change in the behavior of WordPress&#8217;s built-in add_query_arg() and remove_query_arg() functions which could, under certain low-probability conditions, allow for potential XSS attack vectors. This fixes issue # 39 reported at <a href=\"https://github.com/radgeek/feedwordpress/issues/39\" rel=\"nofollow ugc\">https://github.com/radgeek/feedwordpress/issues/39</a> Thanks to github.com/quassy</p>\n<p>The second fixes a security vulnerability that was reported to me privately (thanks to Adrián M. F.) which, under other low-probability conditions, could allow for SQL insertion attacks by a malicious user with access to login credentials, which would compromise data security.</p>\n<p>It is <em>IMPORTANT</em> and worth your while to upgrade FeedWordPress as soon as possible in order to eliminate these vulnerabilities. If you have any questions or if there is something blocking you from making the upgrade which you need my help with, don&#8217;t hesitate to get in touch.</p>\n</li>\n<li>\n<p>ADMIN UI BUGFIX: &#8220;Update Now&#8221; button in feeds setting pages should now work once again instead of causing a PHP fatal error. See <a href=\"https://github.com/radgeek/feedwordpress/issues/46\" rel=\"nofollow ugc\">https://github.com/radgeek/feedwordpress/issues/46</a></p>\n</li>\n<li>\n<p>SEVERAL OTHER SMALL BUG FIXES. See <a href=\"https://github.com/radgeek/feedwordpress/issues/32\" rel=\"nofollow ugc\">https://github.com/radgeek/feedwordpress/issues/32</a> <a href=\"https://github.com/radgeek/feedwordpress/issues/30\" rel=\"nofollow ugc\">https://github.com/radgeek/feedwordpress/issues/30</a> <a href=\"https://github.com/radgeek/feedwordpress/issues/29\" rel=\"nofollow ugc\">https://github.com/radgeek/feedwordpress/issues/29</a> etc.</p>\n</li>\n</ul>\n<h4>2014.0805</h4>\n<ul>\n<li>\n<p>FILTERS AND ADD-ONS: A number of new hooks for filters and add-ons to further customize the behavior of FWP have been added.</p>\n</li>\n<li>\n<p>COMPATIBILITY/BUGFIX: Many users saw odd characters, especially &#8220;n,&#8221; appearing in posts in versions of WordPress from 3.6 on, due to a change in when the API expects HTML data for posts to be slashed and when it does not. This has been fixed, so that the junk characters should no longer appear, regardless of your version of WordPress.</p>\n</li>\n<li>\n<p>BUGFIX: A bug preventing FWP from saving categories assigned under Syndication &gt; Categories &amp; Tags has been fixed.</p>\n</li>\n<li>\n<p>BUGFIX: Post-editing related metaboxes should now show up when you edit items of any post type, including custom types, not only normal WordPress   posts.</p>\n</li>\n<li>\n<p>BUGFIX: A bug in the admin UI that caused the &#8220;Alternative Feeds&#8221; / &#8220;Find Feeds&#8221; box to throw a permissions error has been fixed.</p>\n</li>\n<li>\n<p>BUGFIX: A bug preventing proper mapping of categories and other terms in 2013.0504 has been fixed.</p>\n</li>\n<li>\n<p>BUGFIX: A number of small fixes contributed through Github by Flynsarmy should eliminate PHP warnings for many users on several methods that are    called as static methods within FeedWordPress.</p>\n</li>\n</ul>\n<h4>2013.0504</h4>\n<ul>\n<li>\n<p>BUGFIX: PHP 5.4 compatibility &#8212; includes some more extensive fixes to compatibility issues with PHP 5.4&#8217;s handling of global variables</p>\n</li>\n<li>\n<p>DIAGNOSTICS: New diagnostics settings added to help track behavior of terms (categories, post tags, etc.) for syndicated posts.</p>\n</li>\n</ul>\n<h4>2012.0504</h4>\n<ul>\n<li>MODULE REORGANIZATION: Should ensure that all needed submodules will be properly included regardless of whether you are installing from github, from SVN, or from the WordPress plugins page. If you&#8217;ve been getting fatal errors about required modules not being found, this release should hopefully resolve the issue.</li>\n</ul>\n<h4>2012.0503</h4>\n<ul>\n<li>\n<p>BUGFIX: Works properly again with WordPress installations that use a MySQL table name prefix other than the default <code>wp_</code> prefix.</p>\n</li>\n<li>\n<p>BUGFIX: Includes a couple of significant PHP 5.4 compatibility fixes. Now that PHP 5.4 is more widely deployed, Diagnostics will now also show PHP version and some other potentially useful troubleshooting    information.</p>\n</li>\n<li>\n<p>ADMIN UI: Better indicates your options when deleting a syndicated post so as to let you know whether it will be Trashed (and thus not resyndicated) or Erased (and thus potentially resyndicated)</p>\n</li>\n<li>\n<p>ADMIN UI: Adds an AJAXy Test Expression button to allow live testing of sample results from expressions in Custom Post Settings.</p>\n</li>\n</ul>\n<h4>2012.1218</h4>\n<ul>\n<li>\n<p>WORDPRESS VISUAL EDITOR FIXED. There was an unlisted change in the 2012.1212 release which had the effect of disabling the WordPress Visual Editor for all posts syndicated by FeedWordPress. Many users reported this as a bug. It was actually a deliberate decision &#8212; a crappy way to try to deal with a crappy situation. (Many users had previously reported a &#8220;bug&#8221; in which all the paragraph or line breaks seemed to be stripped out of their syndicated posts; the issue turned out to be that the Visual Editor was stripping out <code>&lt;p&gt;</code> and <code>&lt;br/&gt;</code> tags on the assumption that the resulting post would be sent through standard WordPress formatting filters. But under default settings, posts syndicated by FWP deliberately bypass WordPress formatting filters.) In any case, this version adopts a more flexible compromise. <em>If</em> FeedWordPress is set up to bypass WordPress formatting filters (as it is by default), <em>then</em> the Visual Editor will be disabled for syndicated posts (since using it would produce incorrect results). If on the other hand FeedWordPress is set up to expose syndicated posts to WordPress formatting filters (as it usually is for those using the Visual Editor to manually edit posts), then the Visual Editor tab will be re-enabled for syndicated posts.</p>\n</li>\n<li>\n<p>BUG FIX: PERMALINKS REWRITTEN FOR CUSTOM POST TYPES AS WELL AS NORMAL<br />\nWORDPRESS POSTS. If you had WordPress set up to syndicate incoming posts<br />\nto a custom post type (under Syndication &gt; Posts &amp; Links), and asked<br />\nFeedWordPress to make &#8220;permalinks point to the original site&#8221;, then<br />\nprevious versions of FeedWordPress would fail to do the rewriting &#8212;<br />\npermalinks would only be rewritten to point to the original source for<br />\nnormal WordPress posts, not for custom post types. In 2012.1218 this bug<br />\nhas been fixed: all post types will now have permalinks rewritten unless<br />\nyou request for permalinks to point to the local copy on your aggregator<br />\nsite.</p>\n</li>\n<li>\n<p>BUG FIX: ELIMINATES &#8220;PHP Fatal error: Call to a member function<br />\nsetting() on a non-object&#8230;.&#8221; Some changes to the in-memory caching of<br />\ninformation about feed subscriptions could result in a fatal PHP error<br />\nin cases where you have de-activated one of your subscriptions, but<br />\nposts from that subscription were still in the archive. This would<br />\nnormally show up through half-completed feeds or half-completed pages<br />\nthat suddenly broke off in the middle, and displayed or logged an error<br />\nmessage like: &#8220;PHP Fatal error: Call to a member function setting() on a<br />\nnon-object in {&#8230;}/wp-content/plugins/feedwordpress/feedwordpress.php<br />\non line 615&#8221;. This bug has been eliminated, so affected feeds and pages<br />\nshould now render correctly, and the error message should no longer<br />\nappear.</p>\n</li>\n<li>\n<p>BUG FIX: CATEGORY BOXES IN SYNDICATION &gt; CATEGORIES &amp; TAGS. Some minor<br />\nbugs in the appearance and animation of category checkboxes (for<br />\nexample, the checkbox used to select categories for syndicated posts on<br />\nthe Syndication &gt; Categories &amp; Tags settings page) have been fixed.</p>\n</li>\n</ul>\n<h4>2012.1212</h4>\n<ul>\n<li>\n<p>WORDPRESS 3.5 COMPATIBILITY: This release has been tested for compatibility<br />\nwith new releases of WordPress, up to version 3.5, and any documented<br />\ncompatibility issues have been cleared &#8212; in particular, if you were seeing<br />\nerror pages stating that you don&#8217;t have permission to access the<br />\nFeedWordPress Syndication page within the WordPress admin interface, then<br />\nupgrading to this release should fix the problem.</p>\n<p>As always, if you encounter any compatibility problems after upgrading your<br />\nversion of WordPress and your version of FeedWordPress to the most recent<br />\nversions, please contact me with as detailed a description as possible of<br />\nthe issue you are encountering, the circumstances you&#8217;re encountering it<br />\nunder, what you expect to see happening, and what is happening instead.</p>\n</li>\n<li>\n<p>PHP 5.4 COMPATIBILITY: This release has been audited to fix potential<br />\nproblems with deprecation notices or fatal errors under recent versions<br />\nof PHP. In particular, all uses of run-time pass-by-reference have been<br />\neliminated from the code; if you were seeing a fatal error reading<br />\n&#8220;Call-time pass-by-reference has been removed &#8230;&#8221; then upgrading to<br />\nthis release should fix the problem.</p>\n</li>\n<li>\n<p>CUSTOMIZATION FRAMEWORK: A great deal of work has been done to make the<br />\nunderlying framework more flexible, so that PHP add-ons can be written<br />\nto adapt FeedWordPress to handle custom XML vocabularies, expiration of<br />\nposts under specified conditions, and other custom behavior.</p>\n</li>\n<li>\n<p>BUGFIX: MANUALLY EDITED POST SLUGS NOT OVERWRITTEN. Thanks to a report<br />\nby Chris Fritz, I&#8217;ve identified some code that causes post slugs for the<br />\nposts generated by FWP to be rewritten with every update, even if the<br />\nuser has manually updated the slug from within the WordPress editing<br />\ninterface. This has been fixed: FWP will continue to generate new slugs<br />\nfor syndicated posts, but when syndicated posts are updated, they will<br />\nretain the slug that they had at the time of the update; any manual<br />\nchanges to the post slug should be preserved.</p>\n</li>\n<li>\n<p>USER-AGENT STRING: FeedWordPress now sends a distinctive User-Agent<br />\nstring identifying itself, and noting that it is a feed aggregator.</p>\n</li>\n<li>\n<p>MISCELLANEOUS PERFORMANCE IMPROVEMENTS: A number of changes have been<br />\nmade to try to reduce the intensity and expense in terms of both<br />\ndatabase performance and web server memory consumption.</p>\n</li>\n<li>\n<p>DIAGNOSTICS IMPROVEMENTS: A number of new and improved diagnostics have<br />\nbeen added which should aid in understanding and troubleshooting issues<br />\nthat may arise.</p>\n</li>\n</ul>\n<h4>2011.1019</h4>\n<ul>\n<li>\n<p>BUGFIX: &#8220;THERE ARE NO HTTP TRANSPORTS AVAILABLE&#8221; ERROR FIXED: The initial<br />\nsupport for HTTP Basic and Digest authentication in version 2011.1018<br />\ncontained a bug that could cause HTTP requests for feeds or for other<br />\nWordPress resources to break down if you do not have the PHP curl module<br />\ninstalled. This bug has been fixed, and these errors should no longer<br />\nappear.</p>\n</li>\n<li>\n<p>IMPROVED HTTP AUTHENTICATION SUPPORT: In addition, the HTTP Authentication<br />\nsupport in FeedWordPress has been extended, to ensure that Basic<br />\nauthentication is available in many web host configurations, and to allow<br />\nyou to add a username and password for a feed immediately when you<br />\nsubscribe to it.</p>\n</li>\n</ul>\n<h4>2011.1018</h4>\n<ul>\n<li>\n<p>HTTP BASIC AND DIGEST AUTHENTICATION SUPPORT: FeedWordPress now offers<br />\nimproved support for syndicating feeds that make use of HTTP Basic or HTTP<br />\nDigest authentication methods. In order to set up authentication on one of<br />\nyour feeds, just go to its Settings &gt; Feed page, and click on the &#8220;Uses<br />\nUsername/Password&#8221; link underneath the Feed URL. Enter the username and<br />\npassword for accessing the feed, then select the authentication method. (If<br />\nyou&#8217;re not sure which method your feed provider uses, try Basic first.)<br />\nSave Changes, and syndicate away.</p>\n<p>NOTE: HTTP Digest support requires the curl module for PHP. If you are not<br />\nsure whether this module has been installed, contact your web hosting<br />\nprovider to check.</p>\n</li>\n<li>\n<p>WP 3.3 (BETA) COMPATIBILITY: This version fixes an init-sequence bug that<br />\ncould cause intrusive warning messages or fatal errors in WP 3.3 beta<br />\nversions.</p>\n</li>\n<li>\n<p>BUGFIX: FIXES LONG DELAYS IN UPDATES SCHEDULES IN LARGE INSTALLATIONS. A<br />\nperformance feature introduced in version 2011.0721 had some flaws in its<br />\nimplementation, which tended to create serious delays (on the order of<br />\nseveral hours) in FeedWordPress&#8217;s attempts to schedule updates for feeds,<br />\nwhen users had a very large number of feeds (several dozen or more) in their<br />\nFeedWordPress installation. This feature has been reconfigured to adjust<br />\ndynamically to the number of feeds in Syndicated Sources and the frequency<br />\nwith which they are updated. If you&#8217;ve seen a lot of ready-to-update feeds<br />\npiling up, several hours after they were supposed to get updated, then this<br />\nupgrade should better ensure that your feeds get updated in a timely fashion.</p>\n</li>\n<li>\n<p>BUGFIX: syndicated_item_guid FILTERS FIXED. Previous versions of<br />\nFeedWordPress theoretically allowed for filters on the syndicated_item_guid<br />\nhook, which was intended to filter the globally-unique identifier element<br />\n(rss:guid or atom:id) &#8212; useful if you need to convince FeedWordPress to use<br />\ndifferent guids, or to recognize two or more incoming posts as versions of<br />\nthe same post rather than as distinct items. However, while the hook<br />\naffected the guid stored in the WordPress database, it did not affect the<br />\nguid used to check whether an incoming feed item had already been syndicated<br />\nor was a new item &#8212; which greatly limited the practical usefulness of the<br />\nfilter. This bug has been fixed: syndicated_item_guid filters should now<br />\nproperly control not only the final database record, but also the initial<br />\nuniqueness test applied to posts.</p>\n</li>\n</ul>\n<h4>2011.0721</h4>\n<ul>\n<li>\n<p>BUGFIX: SERIOUS BUG CAUSING RARE UNEXPECTED DELETION OF PAGES AND OTHER<br />\nCONTENT. A bug in the guid-checking code for some rare kinds of guids could<br />\ncause content in the wp_posts table to seemingly disappear at random after<br />\nFeedWordPress updates.This most frequently but not exclusively affected<br />\nstatic pages. What actually happened is that in these rare cases the<br />\nexisting static page was mistaken for an older version of the new incoming<br />\nsyndicated post, which was then stored as a new revision of the original<br />\npage. The bug that caused these mistaken identities has been fixed.</p>\n</li>\n<li>\n<p>BUGFIX: UNWANTED AUTOMATIC PAGE-LOAD-BASED UPDATES NO LONGER A NUISANCE.<br />\nSome users encountered a bug in which FeedWordPress would adopt an automatic<br />\npage-load-based update method, even if they had requested that it not do<br />\nso, and that it use a manual or cron job update method instead. The bug<br />\ncausing this has been fixed, and page-load-based updates should no longer<br />\ntrigger unless explicitly turned on.</p>\n</li>\n<li>\n<p>WP 3.2 USER INTERFACE COMPATIBILITY: POST TAGS BOX NOW WORKS AGAIN. The<br />\nrelease of WordPress 3.2 caused a breakage in the tags box which prevented<br />\nyou from adding or removing tags under Syndication &#8211;&gt; Categories &amp; Tags.<br />\n(The breakage was the result of an incompatibility introduced by the new<br />\nrelease of jQuery.) This breakage has now been fixed, and the tags box<br />\nshould work correctly again.</p>\n</li>\n<li>\n<p>FEED UPDATE SCHEDULING IMPROVEMENTS: UI. The Syndicated Sources table now<br />\nprovides considerably more data to understand update scheduling, when<br />\nspecific scheduling decisions are made because of, e.g., requests from the<br />\nfeed producer.</p>\n</li>\n<li>\n<p>FEED UPDATE SCHEDULING IMPROVEMENTS: ENFORCEABLE &#8220;MINIMUM INTERVAL&#8221; SETTING<br />\nTO SPACE OUT UPDATES. Some feeds request specific update schedules, using<br />\nstandard elements such as sy:updateFrequency and rss:ttl. Normally,<br />\nFeedWordPress respects any scheduling requests that a feed makes &#8212; if it<br />\nrequests a longer gap between polls than what FWP would normally adopt, then<br />\nFWP slows down to meet the request. If it indicates a shorter gap than what<br />\nFWP would normally adopt, FWP speeds up and checks that feed for updates<br />\nmore often than it normally would. Now, there should not be any way for user<br />\nsettings to override an explicit slow-down request from the feed producer &#8212;<br />\nif producers indicate a particular update schedule, then polling the feed<br />\nmore frequently than they request is considered abusive behavior. But<br />\nthere&#8217;s no reason why users should not be able &#8212; if they so desire &#8212; to<br />\noverride speed-up requests, and poll a feed <em>less</em> frequently than the<br />\nindicated update schedule, if the FWP user wants to space update checkins<br />\nover a longer  &hellip;</p>\n</li>\n</ul>\n"
    },
    "short_description": "FeedWordPress syndicates content from feeds you choose into your WordPress weblog.",
    "description": "<ul>\n<li>Author: <a href=\"http://feedback.radgeek.com/contact\" rel=\"nofollow ugc\">C. Johnson</a></li>\n<li>Project URI: <a href=\"http://feedwordpress.radgeek.com/\" rel=\"nofollow ugc\">http://feedwordpress.radgeek.com/</a></li>\n<li>License: GPL 2. See License below for copyright jots and tittles.</li>\n</ul>\n<p>FeedWordPress is an Atom/RSS aggregator for WordPress. It syndicates content from feeds that you choose into your WordPress weblog, and then the content it syndicates appears as a series of special posts in your WordPress posts database. If you syndicate several feeds then you can use WordPress&#8217;s posts database and templating engine as the back-end of an aggregation (&#8220;planet&#8221;) website. It was developed, originally, as a utility/hobby project, because I needed a more flexible replacement for <a href=\"https://web.archive.org/web/20051029095046/http://www.planetplanet.org/\" rel=\"nofollow ugc\">Planet</a> for aggregator sites that I administered.</p>\n<p>FeedWordPress is designed with flexibility, ease of use, and ease of configuration in mind. You&#8217;ll need a working installation of WordPress (version <a href=\"https://codex.wordpress.org/Version_4.5\" rel=\"nofollow ugc\">4.5</a> or later), and it helps to have SFTP or FTP access to your web host. The ability to create cron jobs on your web host is helpful but not required.</p>\n<h3>Using and Customizing FeedWordPress</h3>\n<p>FeedWordPress has many options which can be accessed through the WordPress Dashboard, and a lot of functionality accessible programmatically through WordPress templates or plugins. For further documentation of the ins and outs, see the documentation at the <a href=\"http://feedwordpress.radgeek.com/\" rel=\"nofollow ugc\">FeedWordPress project homepage</a>.</p>\n<h3>License</h3>\n<p>The FeedWordPress plugin is copyright © 2005-2021 by Charles Johnson. It uses code derived or translated from:</p>\n<ul>\n<li><a href=\"http://laughingmeme.org/archives/002203.html\" rel=\"nofollow ugc\">wp-rss-aggregate.php</a> by <a href=\"kellan@protest.net\" rel=\"nofollow ugc\">Kellan Elliot-McCrea</a></li>\n<li><a href=\"http://www.simplepie.org/\" rel=\"nofollow ugc\">SimplePie</a> feed parser by Ryan Parman, Geoffrey Sneddon, Ryan McCue, et al.</li>\n<li><a href=\"http://magpierss.sourceforge.net/\" rel=\"nofollow ugc\">MagpieRSS</a> feed parser by <a href=\"kellan@protest.net\" rel=\"nofollow ugc\">Kellan Elliot-McCrea</a></li>\n<li><a href=\"http://diveintomark.org/projects/feed_finder/\" rel=\"nofollow ugc\">Ultra-Liberal Feed Finder</a> by <a href=\"mark@diveintomark.org\" rel=\"nofollow ugc\">Mark Pilgrim</a></li>\n<li><a href=\"https://wordpress.org/\" rel=\"ugc\">WordPress Blog Tool and Publishing Platform</a></li>\n</ul>\n<p>according to the terms of the <a href=\"http://www.gnu.org/copyleft/gpl.html\" rel=\"nofollow ugc\">GNU General Public License</a>.</p>\n<p>This program is free software; you can redistribute it and/or modify it under the terms of the <a href=\"http://www.gnu.org/copyleft/gpl.html\" rel=\"nofollow ugc\">GNU General Public License</a> as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.</p>\n<p>This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/feedwordpress.2024.0511.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "aggregation": "aggregation",
        "atom": "Atom",
        "feed": "feed",
        "rss": "rss",
        "syndication": "syndication"
    },
    "stable_tag": "2024.0511",
    "versions": {
        "0.8": "https://downloads.wordpress.org/plugin/feedwordpress.0.8.zip",
        "0.9": "https://downloads.wordpress.org/plugin/feedwordpress.0.9.zip",
        "0.91": "https://downloads.wordpress.org/plugin/feedwordpress.0.91.zip",
        "0.95": "https://downloads.wordpress.org/plugin/feedwordpress.0.95.zip",
        "0.96": "https://downloads.wordpress.org/plugin/feedwordpress.0.96.zip",
        "0.97": "https://downloads.wordpress.org/plugin/feedwordpress.0.97.zip",
        "0.98": "https://downloads.wordpress.org/plugin/feedwordpress.0.98.zip",
        "0.981": "https://downloads.wordpress.org/plugin/feedwordpress.0.981.zip",
        "0.99": "https://downloads.wordpress.org/plugin/feedwordpress.0.99.zip",
        "0.991": "https://downloads.wordpress.org/plugin/feedwordpress.0.991.zip",
        "0.992": "https://downloads.wordpress.org/plugin/feedwordpress.0.992.zip",
        "0.993": "https://downloads.wordpress.org/plugin/feedwordpress.0.993.zip",
        "2008.1030": "https://downloads.wordpress.org/plugin/feedwordpress.2008.1030.zip",
        "2008.1101": "https://downloads.wordpress.org/plugin/feedwordpress.2008.1101.zip",
        "2008.1105": "https://downloads.wordpress.org/plugin/feedwordpress.2008.1105.zip",
        "2008.1214": "https://downloads.wordpress.org/plugin/feedwordpress.2008.1214.zip",
        "2009.0612": "https://downloads.wordpress.org/plugin/feedwordpress.2009.0612.zip",
        "2009.0613": "https://downloads.wordpress.org/plugin/feedwordpress.2009.0613.zip",
        "2009.0618": "https://downloads.wordpress.org/plugin/feedwordpress.2009.0618.zip",
        "2009.0707": "https://downloads.wordpress.org/plugin/feedwordpress.2009.0707.zip",
        "2009.1111": "https://downloads.wordpress.org/plugin/feedwordpress.2009.1111.zip",
        "2009.1112": "https://downloads.wordpress.org/plugin/feedwordpress.2009.1112.zip",
        "2010.0127": "https://downloads.wordpress.org/plugin/feedwordpress.2010.0127.zip",
        "2010.0528": "https://downloads.wordpress.org/plugin/feedwordpress.2010.0528.zip",
        "2010.0531": "https://downloads.wordpress.org/plugin/feedwordpress.2010.0531.zip",
        "2010.0602": "https://downloads.wordpress.org/plugin/feedwordpress.2010.0602.zip",
        "2010.0623": "https://downloads.wordpress.org/plugin/feedwordpress.2010.0623.zip",
        "2010.0903": "https://downloads.wordpress.org/plugin/feedwordpress.2010.0903.zip",
        "2010.0905": "https://downloads.wordpress.org/plugin/feedwordpress.2010.0905.zip",
        "2011.0211": "https://downloads.wordpress.org/plugin/feedwordpress.2011.0211.zip",
        "2011.0211.2": "https://downloads.wordpress.org/plugin/feedwordpress.2011.0211.2.zip",
        "2011.0512": "https://downloads.wordpress.org/plugin/feedwordpress.2011.0512.zip",
        "2011.0531": "https://downloads.wordpress.org/plugin/feedwordpress.2011.0531.zip",
        "2011.0602": "https://downloads.wordpress.org/plugin/feedwordpress.2011.0602.zip",
        "2011.0706": "https://downloads.wordpress.org/plugin/feedwordpress.2011.0706.zip",
        "2011.0721": "https://downloads.wordpress.org/plugin/feedwordpress.2011.0721.zip",
        "2011.1018": "https://downloads.wordpress.org/plugin/feedwordpress.2011.1018.zip",
        "2011.1019": "https://downloads.wordpress.org/plugin/feedwordpress.2011.1019.zip",
        "2012.1212": "https://downloads.wordpress.org/plugin/feedwordpress.2012.1212.zip",
        "2012.1218": "https://downloads.wordpress.org/plugin/feedwordpress.2012.1218.zip",
        "2013.0503": "https://downloads.wordpress.org/plugin/feedwordpress.2013.0503.zip",
        "2013.0504": "https://downloads.wordpress.org/plugin/feedwordpress.2013.0504.zip",
        "2014.0805": "https://downloads.wordpress.org/plugin/feedwordpress.2014.0805.zip",
        "2015.0426": "https://downloads.wordpress.org/plugin/feedwordpress.2015.0426.zip",
        "2015.0514": "https://downloads.wordpress.org/plugin/feedwordpress.2015.0514.zip",
        "2016.0420": "https://downloads.wordpress.org/plugin/feedwordpress.2016.0420.zip",
        "2016.1211": "https://downloads.wordpress.org/plugin/feedwordpress.2016.1211.zip",
        "2016.1213": "https://downloads.wordpress.org/plugin/feedwordpress.2016.1213.zip",
        "2017.0913": "https://downloads.wordpress.org/plugin/feedwordpress.2017.0913.zip",
        "2017.1004": "https://downloads.wordpress.org/plugin/feedwordpress.2017.1004.zip",
        "2017.1020": "https://downloads.wordpress.org/plugin/feedwordpress.2017.1020.zip",
        "2020.0118": "https://downloads.wordpress.org/plugin/feedwordpress.2020.0118.zip",
        "2020.0818": "https://downloads.wordpress.org/plugin/feedwordpress.2020.0818.zip",
        "2021.0713": "https://downloads.wordpress.org/plugin/feedwordpress.2021.0713.zip",
        "2022.0123": "https://downloads.wordpress.org/plugin/feedwordpress.2022.0123.zip",
        "2022.0203": "https://downloads.wordpress.org/plugin/feedwordpress.2022.0203.zip",
        "2022.0204": "https://downloads.wordpress.org/plugin/feedwordpress.2022.0204.zip",
        "2022.0208": "https://downloads.wordpress.org/plugin/feedwordpress.2022.0208.zip",
        "2022.0222": "https://downloads.wordpress.org/plugin/feedwordpress.2022.0222.zip",
        "2024.0428": "https://downloads.wordpress.org/plugin/feedwordpress.2024.0428.zip",
        "2024.0511": "https://downloads.wordpress.org/plugin/feedwordpress.2024.0511.zip",
        "trunk": "https://downloads.wordpress.org/plugin/feedwordpress.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://feedwordpress.radgeek.com/donate/",
    "banners": {
        "low": "https://ps.w.org/feedwordpress/assets/banner-772x250.jpg?rev=1413333",
        "high": false
    },
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/feedwordpress_a6a79a.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 86,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}