{
    "name": "Fix Alt Text",
    "slug": "fix-alt-text",
    "version": "1.8.1",
    "author": "<a href=\"https://fixalttext.com\">Fix Alt Text</a>",
    "author_profile": "https://profiles.wordpress.org/stevenayers63/",
    "contributors": {
        "stevenayers63": {
            "profile": "https://profiles.wordpress.org/stevenayers63/",
            "avatar": "https://secure.gravatar.com/avatar/5ca36dd1e33b8145a2c89d15e211ac43?s=96&d=monsterid&r=g",
            "display_name": "Steven Ayers"
        },
        "jdorner": {
            "profile": "https://profiles.wordpress.org/jdorner/",
            "avatar": "https://secure.gravatar.com/avatar/09356460a16f7fd4b957ef00d5ccad3b?s=96&d=monsterid&r=g",
            "display_name": "John Dorner"
        }
    },
    "requires": "5.3",
    "tested": "6.6.1",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 84,
    "ratings": {
        "5": 4,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 5,
    "support_url": "https://wordpress.org/support/plugin/fix-alt-text/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 12020,
    "last_updated": "2024-08-16 6:11pm GMT",
    "added": "2022-02-05",
    "homepage": "https://fixalttext.com",
    "sections": {
        "description": "<p>It is increasingly important for you to make your images meet accessibility standards. Images must have alternative text (alt text) added so that the visually impaired can use screen readers to understand the purpose and context of the image displayed on the screen.</p>\n<p>In addition to making your site more accessible, using alt text helps your site rank better in search engines. This is an added SEO benefit for marketers.</p>\n<p>Unfortunately, as a site grows, it becomes difficult and time-consuming to edit and maintain image alt text. Fix Alt Text plugin can help you discover where alt text is needed, quickly fix issues, and even force users to input alt text as images are used throughout the site in the future.</p>\n<h3>Features:</h3>\n<ul>\n<li>Find Usage: Easily find all uses of alt text by scanning the site</li>\n<li>Find keyword usage: Search for specific keywords used in alt text</li>\n<li>Inline Editing: Instantly edit alt text without manually editing and searching through the content of a post, attachment, or custom post type</li>\n<li>Detect Issues: Quickly identify issues with your alt text to assist you in ADA compliance</li>\n<li>Toggle Features: Control which features are active for maximum flexibility</li>\n<li>Tool Access: Control which user roles have access to the plugin</li>\n<li>Settings Access: Control which user roles have access to changing settings</li>\n<li>Global Settings: In a multisite setup, save time by using global settings and select which sites will inherit those settings</li>\n<li>Fully Multisite Compatible: Force sites within the network to use global network settings for easy management</li>\n</ul>\n<h3>Bonus Features</h3>\n<ul>\n<li>Privacy: It does not use any 3rd-party tracking</li>\n<li>No Sales Pitches: It does not sell or promote any pro plugins</li>\n<li>Free: It&#8217;s currently and will continue to be a Free plugin!</li>\n<li>No Littering: It cleans up after itself if uninstalled or when a blog is removed from a multisite network.</li>\n</ul>\n<h3>Compatible With</h3>\n<ul>\n<li>Multisite Installations</li>\n<li>WP Gutenberg Editor</li>\n<li>WP Classic Editor</li>\n<li>PHP Versions 7.4, 8.0, 8.1</li>\n<li><a href=\"https://wordpress.org/plugins/where-used/\" rel=\"ugc\">WhereUsed</a></li>\n<li><a href=\"https://wordpress.org/plugins/advanced-custom-fields/\" rel=\"ugc\">Advanced Custom Fields &#8211; ACF</a></li>\n<li><a href=\"https://github.com/humanmade/network-media-library\" rel=\"nofollow ugc\">Network Media Library</a></li>\n</ul>\n<h3>Language Support</h3>\n<ul>\n<li>English (default)</li>\n<li><a href=\"https://translate.wordpress.org/projects/wp-plugins/fix-alt-text\" rel=\"nofollow ugc\">Translate this plugin in your language.</a></li>\n</ul>\n",
        "changelog": "<h4>Versions Key (Major.Minor.Patch)</h4>\n<ul>\n<li>Major &#8211; 1.x.x increase involves major changes to the visual or functional aspects of the plugin, or removing functionality that has been previously deprecated. (higher risk of breaking changes)</li>\n<li>Minor &#8211; x.1.x increase introduces new features, improvements to existing features, or introduces deprecations. (low risk of breaking changes)</li>\n<li>Patch &#8211; x.x.1 increase is a bug fix, security fix, or minor improvement and does not introduce new features. (non-breaking changes)</li>\n</ul>\n<p>NOTICE: Release detail should be arranged by category per this order: New Feature, Improvement, Minor Improvement, Bug Fix, Security, Note</p>\n<h4>Version 1.8.1</h4>\n<p>*Release Date &#8211; 16 Aug 2024</p>\n<ul>\n<li>Minor Improvement: Updates to the changelog</li>\n</ul>\n<h4>Version 1.8.0</h4>\n<p><em>Release Date &#8211; 16 Aug 2024</em></p>\n<ul>\n<li>New Feature: Issues can now be toggled on/off within local and network settings (multisite)</li>\n<li>New Feature: Minimum words for alt text can be modified within local and network settings (multisite)</li>\n<li>New Feature: Maximum characters for alt text can be modified within local and network settings (multisite)</li>\n<li>New Feature: Added filter fixalttext_get_issues to allow developers the ability to add their own custom issues</li>\n<li>Improvement: Updated Helpers Library 1.7.0</li>\n<li>Improvement: Removed sorting for the alt text column in the references table. It was not very helpful to sort these values.</li>\n<li>Minor Improvement: On the settings page, converted the text notifying the user that the network settings are being used into an actual admin notice box.</li>\n<li>Bug Fix: Alt text length was unintentionally being truncated in specific scenarios to a length of 256 characters if the value was longer. Thank you @avisato</li>\n<li>Bug Fix: Migration script for version 1.3.0 was referencing the incorrect URL in the upgrade notice.</li>\n<li>Bug Fix: While using XDebug to troubleshoot issues in PHP, the wp heartbeat would interrupt the process.cd trunk</li>\n<li>Deprecated Filter: fixalttext_issues_color_key has been deprecated. Please use replacement fixalttext_get_issues filter to adjust the color scheme of issues on the issues pie chart.</li>\n<li>Note: Tested up to: 6.6.1</li>\n</ul>\n<h4>Version 1.7.0</h4>\n<p><em>Release Date &#8211; 25 Mar 2024</em></p>\n<ul>\n<li>New Feature: A Scan can be paused and resumed</li>\n<li>Minor Improvement: Updated Helpers Library 1.6.0</li>\n<li>Minor Improvement: Added JPE file extension as a valid mime type</li>\n<li>Bug Fix: While using the block editor in other languages, alt text was not validating and prompting the user to input alt text for images. Thank you @wmaas.</li>\n<li>Bug Fix: File extensions were sometimes including GET variables during a scan (run a new full scan to fix)</li>\n<li>Bug Fix: Dropdown file types filter contain invalid file types due to GET variables (run a new full scan to fix)</li>\n<li>Bug Fix: Invalid file types in issues discovered due to GET variables (run a new full scan to fix)</li>\n<li>Note: Tested up to: 6.4.3</li>\n</ul>\n<h4>Version 1.6.1</h4>\n<p><em>Release Date &#8211; 21 Sep 2023</em></p>\n<ul>\n<li>Bug Fix: The scan was exceeding the default memory limit when running the background process causing the scan the stall until the user cancelled the scan. This was preventing the plugin to fully scan the site.</li>\n<li>Note: Tested up to: 6.3.1</li>\n</ul>\n<h4>Version 1.6.0</h4>\n<p><em>Release Date &#8211; 28 Jul 2023</em></p>\n<ul>\n<li>Improvement: Converted Helpers Library to be under the plugin&#8217;s namespace to prevent conflicts with other plugins using the same dependency</li>\n<li>Minor Improvement: Optimized the uninstall cleanup script</li>\n<li>Bug fix: custom db tables were not being removed when the plugin was deleted from the site.</li>\n<li>Bug Fix: custom db tables were not being created in various scenarios</li>\n</ul>\n<h4>Version 1.5.0</h4>\n<p><em>Release Date &#8211; 13 Jul 2023</em></p>\n<ul>\n<li>Improvement: Added compatibility with <a href=\"https://github.com/humanmade/network-media-library\" rel=\"nofollow ugc\">Network Media Library plugin for WordPress</a></li>\n<li>Minor Improvement: Updated Helpers Library 1.5.0</li>\n<li>Bug Fix: Error encountered when inline editing alt text of an image in the media library. Only occurs in a multisite environment when using the Network Shared Media Library plugin and the image was uploaded from a non-primary site.</li>\n</ul>\n<h4>Version 1.4.4</h4>\n<p><em>Release Date &#8211; 31 May 2023</em></p>\n<ul>\n<li>Minor Improvement: Updated Helpers Library 1.4.1</li>\n<li>Bug fix: Javascript error occurs when selecting a PDF in media libary modal</li>\n<li>Note: Tested up to: 6.2.2</li>\n</ul>\n<h4>Version 1.4.3</h4>\n<p><em>Release Date &#8211; 17 May 2023</em></p>\n<ul>\n<li>Improvement: switch the keyup listener to use input for detecting changes of alt text input fields to be more reliable</li>\n<li>Bug Fix: After sending a post to the trash, references associated with the post still appear in References table</li>\n<li>Bug Fix: Attachment references were not getting removed from references table when deleted.</li>\n<li>Bug Fix: Force alt text alert was causing false positives when the media library modal is accessed, closed, then accessed again on the post edit screen int he admin.</li>\n</ul>\n<h4>Version 1.4.2</h4>\n<p><em>Release Date &#8211; 21 Apr 2023</em></p>\n<ul>\n<li>Bug Fix: Inline editing was encountering an error in specific scenarios: image_url_mismatch</li>\n</ul>\n<h4>Version 1.4.1</h4>\n<p><em>Release Date &#8211; 14 Apr 2023</em></p>\n<ul>\n<li>Minor Improvement: Updated Helpers Library 1.4.0</li>\n<li>Security: Improved sanitation of data</li>\n</ul>\n<h4>Version 1.4.0</h4>\n<p><em>Release Date &#8211; 05 Apr 2023</em></p>\n<ul>\n<li>Improvement: Search now includes the title of the attachment or post in the &#8220;from&#8221; column</li>\n<li>Minor Improvement: Updated Helpers Library 1.3.7</li>\n<li>Bug Fix: Deprecated PHP notice &#8211; PHP 8.2 deprecated sending null to trim()</li>\n<li>Bug Fix: PHP Fatal error occurred if mbstring non-default extension was not installed. Fallback implemented.</li>\n<li>Note: Tested up to: 6.2.0</li>\n</ul>\n<h4>Version 1.3.9</h4>\n<p><em>Release Date &#8211; 10 Mar 2023</em></p>\n<ul>\n<li>Minor Improvement: Updated Helpers Library 1.3.6</li>\n<li>Bug Fix: The plugin directory constant values were incorrect if site_url() and admin_url() do not have the same HTTP protocol.</li>\n<li>Bug Fix: Prevent update of plugin if it is under local git control</li>\n</ul>\n<h4>Version 1.3.8</h4>\n<p><em>Release Date &#8211; 9 Mar 2023</em></p>\n<ul>\n<li>Minor Improvement: Updated Helpers Library 1.3.5</li>\n<li>Bug Fix: Fixed fatal error related to multisite installations. Issue occurs when a previous blog has been deleted and a new blog is created. The new blog&#8217;s IDs increments and no longer matches the assumed corresponding index within the full array of blogs.</li>\n<li>Bug Fix: The database tables were not getting created on plugin activation for a multisite.</li>\n</ul>\n<h4>Version 1.3.7</h4>\n<p><em>Release Date &#8211; 3 Mar 2023</em></p>\n<ul>\n<li>Bug Fix: JavaScript error when the issues chart attempts to display when there are no issues found.</li>\n<li>Bug Fix: Inline editing did not work for images directly located in the media library</li>\n<li>Bug Fix: When uploading an attachment, the attachment was not automatically scanned into the system</li>\n</ul>\n<h4>Version 1.3.6</h4>\n<p><em>Release Date &#8211; 3 Mar 2023</em></p>\n<ul>\n<li>Bug Fix: Activating plugin on a multisite caused fatal error</li>\n</ul>\n<h4>Version 1.3.5</h4>\n<p><em>Release Date &#8211; 19 Jan 2023</em></p>\n<ul>\n<li>Bug Fix: Inline edit feature was not compatible with post meta that was stored as an array or an object.</li>\n<li>Bug Fix: Sometimes alt text would be marked as having code in it if a quote mark was in the alt text.</li>\n</ul>\n<h4>Version 1.3.4</h4>\n<p><em>Release Date &#8211; 29 Nov 2022</em></p>\n<ul>\n<li>Minor Improvement: Updated Helpers Library dependency</li>\n<li>Bug Fix: Scan duration details should not display 0 days, 0 hours, etc.</li>\n<li>Bug Fix: Scan is showing a message that a scan is needed when it is actually not</li>\n<li>Note: Tested up to: 6.1.1</li>\n</ul>\n<h4>Version 1.3.3</h4>\n<p><em>Release Date &#8211; 09 Nov 2022</em></p>\n<ul>\n<li>Minor Improvement: Updated Helpers Library dependency</li>\n<li>Bug Fix: Migration script wasn&#8217;t single site compatible</li>\n<li>Bug Fix: When scan menus option changed in settings, the user was not being notified that a new scan was needed.</li>\n<li>Bug Fix: Headers sent prematurely when displaying admin notice if updating plugin while another plugin is using an older version of Helpers Library</li>\n<li>Bug Fix: Scans involving thousands of users, or terms would run out of memory due to meta caching</li>\n<li>Bug Fix: There was a rare possibility that a post gets queued and then the post is deleted before the background scan processes it, which could cause the progress bar to stall on the dashboard.</li>\n<li>Note: Tested up to: 6.1.0</li>\n</ul>\n<h4>Version 1.3.1</h4>\n<p><em>Release Date &#8211; 27 Oct 2022</em></p>\n<ul>\n<li>Minor Improvement: Updated Helpers Library dependency</li>\n<li>Security: Removed usernames from the scan users queue file</li>\n</ul>\n<h4>Version 1.3.0</h4>\n<p><em>Release Date &#8211; 26 Oct 2022</em></p>\n<ul>\n<li>New Feature: Filter &#8220;fixalttext_excluded_post_types&#8221; has been added to allow modification of post types excluded from scans</li>\n<li>New Feature: Filter &#8220;fixalttext_excluded_taxonomies&#8221; has been added to allow modification of post types excluded from scans</li>\n<li>Improvement: Debug logging is more efficient</li>\n<li>Improvement: Scan was revised to now handle very large databases and use less resources</li>\n<li>Improvement: Updated recommended taxonomies and post types to scan. Please review your settings.</li>\n<li>Bug Fix: Uninstall script fixed</li>\n<li>Bug Fix: The plugin was initializing on the init hook, but activation hooks do not work on the init hook and were causing loading issues when plugin was activated.</li>\n<li>Bug Fix: Retrieving settings in a single site install were failing</li>\n<li>Bug Fix: Scan would run out of memory when trying to queue 400K posts</li>\n<li>Bug Fix: Post was not getting rescanned after it has been updated</li>\n<li>Security: Minor XSS Escaping within a user protected area</li>\n</ul>\n<h4>Version 1.2.0</h4>\n<p><em>Release Date &#8211; 20 Oct 2022</em></p>\n<ul>\n<li>New Feature: Debug area for troubleshooting scan issues. Debug mode must be turned on in settings before it will appear.</li>\n<li>New Feature: Detects invalid image src URLs and invalid image types</li>\n<li>New Feature: Records plugin version history to assist troubleshooting issues</li>\n<li>New Feature: Detects image alt text located in post excerpts</li>\n<li>Improvement: Converted all AJAX requests to JSON responses</li>\n<li>Improvement: Upgraded to Chart.js v3.8.0</li>\n<li>Improvement: Implemented standard security class to handle consistent sanitization</li>\n<li>Improvement: Styling and code standardization to make maintenance easier</li>\n<li>Improvement: Added Helpers_Library 1.1.0 dependency</li>\n<li>Improvement: Added upgrade migration scripts</li>\n<li>Improvement: On multisite, you can now navigate to the network settings from the site settings tab</li>\n<li>Improvement: DB table columns tuned for performance</li>\n<li>Improvement: Renamed issue names to be more descriptive (rescan required on update)</li>\n<li>Improvement: Moved filters into the column headings and now applied automatically on change</li>\n<li>Improvement: Filters are highlighted blue when applied</li>\n<li>Improvement: Converted inline edit text input to a textarea field for better ease of editing. Thanks Rick Barley!</li>\n<li>Improvement: Added auto focus on the inline edit field to save a click. Thanks Rick Barley!</li>\n<li>Minor Improvement: Refactored compatibility checks</li>\n<li>Bug Fix: Uninstall script didn&#8217;t remove scheduled crons</li>\n<li>Bug Fix: Conditional empty checks did not exist before iterating over various settings. Could result in PHP error.</li>\n<li>Bug Fix: Plugin options cache was not being cleared properly</li>\n<li>Bug Fix: Missing  tag in settings DOM</li>\n<li>Bug Fix: WP Crons did not have a consistent prefix</li>\n<li>Bug Fix: Updated links to # to include an actual target to stop jumping to the top of the screen</li>\n<li>Bug Fix: JS and CSS assets had a double slash in the URL. Thanks @amundsan</li>\n<li>Bug Fix: Scan complete notification had a broken link to scan details</li>\n<li>Bug Fix: Scan was picking up attachments in the Media Library that were not images</li>\n<li>Bug Fix: When uninstalling the plugin it threw an error</li>\n<li>Bug Fix: Could not start a new scan if a previous scan was interrupted by deactivating the plugin or some other unexpected action.</li>\n<li>Note: Increased Minimum WP Version to 5.3</li>\n<li>Note: Tested up to: 6.0.3</li>\n</ul>\n<h4>Version 1.1.4</h4>\n<p><em>Release Date &#8211; 15 Sep 2022</em></p>\n<ul>\n<li>Minor Improvement: Added consistency with how constants were defined</li>\n<li>Minor Improvement: Updated version release key in changelog</li>\n<li>Minor Improvement: Code formatting</li>\n<li>Bug Fix: User could save draft without being prompted to add alt text</li>\n<li>Bug Fix: hardcoded wp-admin references were breaking Bedrock compatibility. Thanks @amundsan</li>\n<li>Note: Tested up to 6.0.2</li>\n</ul>\n<h4>Version 1.1.3</h4>\n<p><em>Release Date &#8211; 09 Aug 2022</em></p>\n<ul>\n<li>Minor Improvement: Added versions key to Changelog</li>\n<li>Bug Fix: JS assets were not loaded when adding a new post.</li>\n</ul>\n<h4>Version 1.1.2</h4>\n<p><em>Release Date &#8211; 25 Mar 2022</em></p>\n<ul>\n<li>Bug Fix: non-static function called statically caused a fatal error</li>\n</ul>\n<h4>Version 1.1.1</h4>\n<p><em>Release Date &#8211; 25 Mar 2022</em></p>\n<ul>\n<li>Bug Fix: delete_post hook was sending 1 parameter instead of 2 and caused a fatal error</li>\n</ul>\n<h4>Version 1.1.0</h4>\n<p><em>Release Date &#8211; 24 Mar 2022</em></p>\n<ul>\n<li>New Feature: Scans now detect image alt text associated with taxonomies and users</li>\n<li>New Feature: Settings include ability to select which taxonomies to scan</li>\n<li>New Feature: Settings include ability to toggle on/off user scanning</li>\n<li>Improvement: Added labels to post types to be scanned in settings area</li>\n<li>Improvement: Minor styling adjustments</li>\n<li>Improvement: Minor performance tuning</li>\n<li>Improvement: Accessibility &#8211; Missing labels for Notification checkboxes</li>\n<li>Bug Fix: The notification that a new scan is needed after saving settings was not displayed to the user immediately</li>\n<li>Bug Fix: Search highlighting would cause a fatal error if the text being searched included a percent sign</li>\n<li>Bug Fix: Iterating over a null value when setting checkboxes to checked if no settings initially existed. PHP Warning thrown.</li>\n<li>Bug Fix: On new scan, the database would get cleared out even if the scan failed. Functionality moved to run when confirmed that the scan is going to run.</li>\n<li>Bug Fix: Settings page background would flicker due to css hover effect on tables.</li>\n<li>Note: Tested up to 5.9.2</li>\n</ul>\n<h4>Version 1.0.2</h4>\n<p><em>Release Date &#8211; 11 Feb 2022</em></p>\n<ul>\n<li>Improvement: Accessibility &#8211; Dropdown menus on Alt Text screen did not have labels</li>\n<li>Improvement: Accessibility &#8211; Table Row actions &amp; inline edit link don&#8217;t become visible on :focus</li>\n<li>Improvement: Accessibility &#8211; User Access settings did not have labels</li>\n<li>Bug Fix: Multiple links were opening in new tabs unintentionally.</li>\n<li>Note: Thank you Joe Dolson (@joedolson) for reviewing the plugin and providing great feedback!</li>\n</ul>\n<h4>Version 1.0.1</h4>\n<p><em>Release Date &#8211; 10 Feb 2022</em></p>\n<ul>\n<li>Minor Improvement: Code formatting and miscellaneous changes</li>\n<li>Bug Fix: JS error when defining jQuery constant for shorthand</li>\n</ul>\n<h4>Version 1.0.0</h4>\n<p><em>Release Date &#8211; 01 Feb 2022</em></p>\n<ul>\n<li>Note: Initial Release</li>\n</ul>\n"
    },
    "short_description": "Manage alt text site-wide easily with Fix Alt Text. You can also force users to use alt text when adding images in Gutenberg and Classic editors.",
    "description": "<p>It is increasingly important for you to make your images meet accessibility standards. Images must have alternative text (alt text) added so that the visually impaired can use screen readers to understand the purpose and context of the image displayed on the screen.</p>\n<p>In addition to making your site more accessible, using alt text helps your site rank better in search engines. This is an added SEO benefit for marketers.</p>\n<p>Unfortunately, as a site grows, it becomes difficult and time-consuming to edit and maintain image alt text. Fix Alt Text plugin can help you discover where alt text is needed, quickly fix issues, and even force users to input alt text as images are used throughout the site in the future.</p>\n<h3>Features:</h3>\n<ul>\n<li>Find Usage: Easily find all uses of alt text by scanning the site</li>\n<li>Find keyword usage: Search for specific keywords used in alt text</li>\n<li>Inline Editing: Instantly edit alt text without manually editing and searching through the content of a post, attachment, or custom post type</li>\n<li>Detect Issues: Quickly identify issues with your alt text to assist you in ADA compliance</li>\n<li>Toggle Features: Control which features are active for maximum flexibility</li>\n<li>Tool Access: Control which user roles have access to the plugin</li>\n<li>Settings Access: Control which user roles have access to changing settings</li>\n<li>Global Settings: In a multisite setup, save time by using global settings and select which sites will inherit those settings</li>\n<li>Fully Multisite Compatible: Force sites within the network to use global network settings for easy management</li>\n</ul>\n<h3>Bonus Features</h3>\n<ul>\n<li>Privacy: It does not use any 3rd-party tracking</li>\n<li>No Sales Pitches: It does not sell or promote any pro plugins</li>\n<li>Free: It&#8217;s currently and will continue to be a Free plugin!</li>\n<li>No Littering: It cleans up after itself if uninstalled or when a blog is removed from a multisite network.</li>\n</ul>\n<h3>Compatible With</h3>\n<ul>\n<li>Multisite Installations</li>\n<li>WP Gutenberg Editor</li>\n<li>WP Classic Editor</li>\n<li>PHP Versions 7.4, 8.0, 8.1</li>\n<li><a href=\"https://wordpress.org/plugins/where-used/\" rel=\"ugc\">WhereUsed</a></li>\n<li><a href=\"https://wordpress.org/plugins/advanced-custom-fields/\" rel=\"ugc\">Advanced Custom Fields &#8211; ACF</a></li>\n<li><a href=\"https://github.com/humanmade/network-media-library\" rel=\"nofollow ugc\">Network Media Library</a></li>\n</ul>\n<h3>Language Support</h3>\n<ul>\n<li>English (default)</li>\n<li><a href=\"https://translate.wordpress.org/projects/wp-plugins/fix-alt-text\" rel=\"nofollow ugc\">Translate this plugin in your language.</a></li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/fix-alt-text.1.8.1.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/fix-alt-text/trunk/screenshot-1.png?rev=3136768",
            "caption": "Dashboard: Initial scan is needed"
        },
        {
            "src": "https://ps.w.org/fix-alt-text/trunk/screenshot-2.png?rev=3136768",
            "caption": "Site Settings: Overwritten by network settings"
        },
        {
            "src": "https://ps.w.org/fix-alt-text/trunk/screenshot-3.png?rev=3136768",
            "caption": "Network Settings: Edit network settings and see scan status of all sites"
        },
        {
            "src": "https://ps.w.org/fix-alt-text/trunk/screenshot-4.png?rev=3136768",
            "caption": "Dashboard: Running full scan"
        },
        {
            "src": "https://ps.w.org/fix-alt-text/trunk/screenshot-5.png?rev=3136768",
            "caption": "Dashboard: Scan complete. Displaying issues and notifications"
        },
        {
            "src": "https://ps.w.org/fix-alt-text/trunk/screenshot-6.png?rev=3136768",
            "caption": "Alt Text: Found references involving alt text"
        },
        {
            "src": "https://ps.w.org/fix-alt-text/trunk/screenshot-7.png?rev=3136768",
            "caption": "Alt Text: Preview image and inline editing"
        },
        {
            "src": "https://ps.w.org/fix-alt-text/trunk/screenshot-8.png?rev=3136768",
            "caption": "Gutenberg Editor: Forcing Alt Text"
        },
        {
            "src": "https://ps.w.org/fix-alt-text/trunk/screenshot-9.png?rev=3136768",
            "caption": "Media Library: Forcing Alt Text"
        }
    ],
    "tags": {
        "accessibility": "accessibility",
        "accessible": "accessible",
        "alt-text": "Alt Text",
        "image-alt-text": "image alt text",
        "image-seo": "image seo"
    },
    "stable_tag": "1.8.1",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/fix-alt-text.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/fix-alt-text.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/fix-alt-text.1.0.2.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/fix-alt-text.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/fix-alt-text.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/fix-alt-text.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/fix-alt-text.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/fix-alt-text.1.1.4.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/fix-alt-text.1.2.0.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/fix-alt-text.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/fix-alt-text.1.3.1.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/fix-alt-text.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/fix-alt-text.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/fix-alt-text.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/fix-alt-text.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/fix-alt-text.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/fix-alt-text.1.3.8.zip",
        "1.3.9": "https://downloads.wordpress.org/plugin/fix-alt-text.1.3.9.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/fix-alt-text.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/fix-alt-text.1.4.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/fix-alt-text.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/fix-alt-text.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/fix-alt-text.1.4.4.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/fix-alt-text.1.5.0.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/fix-alt-text.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/fix-alt-text.1.6.1.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/fix-alt-text.1.7.0.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/fix-alt-text.1.8.0.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/fix-alt-text.1.8.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/fix-alt-text.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/fix-alt-text/assets/icon.svg?rev=2674473",
        "svg": "https://ps.w.org/fix-alt-text/assets/icon.svg?rev=2674473"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 84,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}