{
    "name": "Fluent Booking &#8211; The Ultimate Appointments Scheduling, Events Booking, Events Calendar Solution",
    "slug": "fluent-booking",
    "version": "1.5.20",
    "author": "<a href=\"https://fluentbooking.com\">Appointment & Booking Solution Team - WPManageNinja</a>",
    "author_profile": "https://profiles.wordpress.org/techjewel/",
    "contributors": {
        "techjewel": {
            "profile": "https://profiles.wordpress.org/techjewel/",
            "avatar": "https://secure.gravatar.com/avatar/5acfbfb0e8135fe5a1e36bb40d90ad69?s=96&d=monsterid&r=g",
            "display_name": "Shahjahan Jewel"
        },
        "wpmanageninja": {
            "profile": "https://profiles.wordpress.org/wpmanageninja/",
            "avatar": "https://secure.gravatar.com/avatar/73e86cd2dc2bb825dfce56778d031c10?s=96&d=monsterid&r=g",
            "display_name": "WPManageNinja"
        }
    },
    "requires": "6.0",
    "tested": "6.6.1",
    "requires_php": "7.3",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 7,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 7,
    "support_url": "https://wordpress.org/support/plugin/fluent-booking/",
    "support_threads": 3,
    "support_threads_resolved": 3,
    "active_installs": 2000,
    "downloaded": 6468,
    "last_updated": "2024-08-23 14:23:00",
    "added": "2024-07-16",
    "homepage": "https://fluentbooking.com/pricing/",
    "sections": {
        "description": "<p><a href=\"https://fluentbooking.com/\" rel=\"nofollow ugc\">FluentBooking</a> is a top-notch solution for scheduling and delivering appointment-based services. Whether it&#8217;s an appointment, event, or anything else, FluentBooking has you covered!</p>\n<p>From scheduling personal services to managing business events, it’s developed to provide the easiest management of your availability and clients.</p>\n<p>All you need to do is set your availability, connect with your calendar app, go live with the booking calendar, and accept payments. The final step? Meet with your attendee and make a great impression!</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/L6uJk1FSbZ4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent&#038;listType=playlist&#038;list=PLXpD0vT4thWHP3gjtexAT3fqP_Pdt78g0\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>USEFUL LINKS</h4>\n<p><strong><a href=\"https://fluentbooking.com/\" rel=\"nofollow ugc\">Official Website</a> || <a href=\"https://demo.fluentbooking.com/\" rel=\"nofollow ugc\">Demo</a> || <a href=\"https://fluentbooking.com/docs/\" rel=\"nofollow ugc\">Documentation</a> || <a href=\"https://www.facebook.com/FluentBooking\" rel=\"nofollow ugc\">Facebook</a> || <a href=\"https://www.instagram.com/fluentbooking?igsh=MThwY2dybnBibWkwcg==\" rel=\"nofollow ugc\">Instagram</a> || <a href=\"https://x.com/FluentBooking\" rel=\"nofollow ugc\">Twitter</a> || <a href=\"https://www.linkedin.com/company/fluentbooking\" rel=\"nofollow ugc\">LinkedIn</a></strong></p>\n<h4>🧐 WHY FLUENTBOOKING IS A GAME-CHANGER?</h4>\n<p>✅ Full GDPR Support: Manage all of your appointments and clients within the dashboard<br />\n✅ Multiple Meeting Types: Schedule one-on-one, group, team/round robin, and one-off events<br />\n✅ Flexible Meeting Locations: Choose virtual, in-person, phone, or custom meeting formats<br />\n✅ Automated Notifications: Automatically send email and SMS reminders to prevent no-shows<br />\n✅ Easy Availability Management: Set your weekly hours, add date overrides, and include buffer times<br />\n✅ Seamless Integrations: Connect with calendar apps, payment gateways, video conferencing tools, e-commerce platforms, CRM, and project management tools<br />\n✅ Customizable Booking Forms: Create forms for a personalized booking<br />\nexperience<br />\n✅ Real-Time Updates: Use webhooks to sync data and automate workflows instantly<br />\n✅ Insightful Dashboard: Track and analyze your bookings with visual reports</p>\n<h4>🧐 WHO NEEDS FLUENTBOOKING?</h4>\n<p>FluentBooking can be the go-to option for individuals or businesses looking for a reliable tool to manage their appointments. It’s a great choice for anyone needing an efficient and user-friendly appointment management solution.</p>\n<p><strong>Personal Services:</strong> Sell your personal services with one-on-one meetings and give clients a personalized experience</p>\n<p><strong>Sales:</strong> Schedule flexible sales meetings with the team or clients to achieve the best outcomes</p>\n<p><strong>Marketing:</strong> Meet with your team, set marketing goals, and ensure all members are aligned with the objectives</p>\n<p><strong>eLearning:</strong> Build your virtual classroom for students and take online education to the next level</p>\n<p><strong>Customer Service:</strong> Address and resolve customer issues, questions, or concerns, and turn frustrations into smiles</p>\n<p><strong>Recruitment:</strong> Schedule interview sessions and hire top talents for your team</p>\n<p><strong>Salons &amp; Spas:</strong> Organize your team’s schedule and provide beauty, grooming, or relaxation services to clients</p>\n<p><strong>Barber Services:</strong> Offer personalized grooming services to clients and meet their preferences</p>\n<p><strong>Healthcare Services:</strong> Automate patient appointments and provide a hassle-free treatment experience</p>\n<p><strong>Pet Grooming &amp; Veterinary Services:</strong> Meet with pet owners and provide medical care for their pets</p>\n<p><strong>Home Services:</strong> Send the right person to the right location to deliver home services to individuals or groups</p>\n<p><strong>Fitness Centers &amp; Gyms:</strong> Offer personal training sessions, group classes, or wellness consultations to health-conscious individuals</p>\n<p><strong>Automotive Services:</strong> Provide vehicle maintenance or repair services to vehicle owners at their preferred times</p>\n<h4>🕒 AVAILIBILITY MANAGEMENT</h4>\n<p>Experience hassle-free availability setup and management so you can focus more on your appointments. Set, manage, and display your appointment times to offer your attendees a convenient booking experience.</p>\n<p>Set your weekly availability hours and days for appointments<br />\nChoose your availability between future days, date ranges, or indefinitely<br />\nOffer multiple meeting durations and let attendees select the best time for their needs<br />\nAdd date overrides for changes to your weekly availability<br />\nDefine the event name and description for a better understanding of your service<br />\nSelect flexible meeting durations for your appointments<br />\nPick the best meeting location for an optimal service experience<br />\nAdd buffer time before or after your meetings to take a breather<br />\nLimit booking frequency or total duration and lock any time zone if needed<br />\nAdd booking questions to consider attendees&#8217; needs and preferences<br />\nAutomatically convert time zones so everyone sees the correct appointment time locally</p>\n<h4>👥 MULTIPLE MEETING TYPES</h4>\n<p>Having different meeting types like one-on-one, group, team/round robin, and one-off events makes it easier for both organizers and attendees, right? This helps you to focus on individual needs, host group discussions, manage team schedules fairly, and run special events.</p>\n<p>And FluentBooking does the exact thing! You can easily schedule and manage various meeting types to suit your needs:</p>\n<p><strong>One-on-one Meeting:</strong> Schedule a one-on-one meeting with your attendee and give personalized attention and service</p>\n<p><strong>Group Meeting (Pro):</strong> Arrange group meetings with multiple participants and work towards common goals</p>\n<p><strong>Round Robin Meeting (Pro):</strong> Set your team and start giving services to clients with rotating hosts</p>\n<p><strong>One-off Event (Pro):</strong> Create and manage single-time unique single events or group events that happen only once</p>\n<h4>🌏 MULTIPLE MEETING LOCATION</h4>\n<p>Select the best location for your meeting and enjoy flexibility and convenience. As an organizer, you just need to choose the best format for your meeting, and as an attendee, you can pick the most convenient way to join.</p>\n<p><strong>Conference:</strong> Easily host virtual meetings with popular video conferencing tools like Zoom, Google Meet, Microsoft Teams, etc.</p>\n<p><strong>In Person:</strong> Arrange face-to-face meetings at a physical location and meet in person</p>\n<p><strong>Phone:</strong> Offer phone meetings to attendees who prefer voice-only conversations</p>\n<p><strong>Online:</strong> Provide a direct meeting link on the booking calendar page to make joining simple and straightforward</p>\n<p><strong>Custom:</strong> Customize the meeting location with a specific title and description and meet your attendees</p>\n<h4>📢 AUTOMATED NOTIFICATIONS</h4>\n<p>Worrying about no-shows or cancellations? With automated notifications, there&#8217;s no chance of no-shows or last-minute surprises! Let’s improve your appointment conversion rate with email and SMS notifications.</p>\n<p><strong>Email notifications:</strong> Send automatic email notifications to the meeting organizer and attendee to keep everyone informed and updated in real-time. You can send booking confirmation emails, booking cancellation emails, booking rescheduled emails, booking approval request emails, booking submission confirmation emails, and more.</p>\n<p><strong>SMS notifications (Pro):</strong> Don’t limit yourself to just emails! You can send text SMS or WhatsApp messages to your attendee via Twilio too.</p>\n<h4>🛠 ADVANCED SETTINGS (Pro)</h4>\n<p>Go beyond regular scheduling and take advantage of advanced features that will make your appointment management experience even smoother.</p>\n<ul>\n<li>Redirect your attendee to any custom URL after booking</li>\n<li>Set manual confirmation or booking notice time for your calendar events</li>\n<li>Select whether you want to limit your attendee from canceling the meeting</li>\n<li>Select whether you want to limit your attendee from rescheduling</li>\n<li>Load FluentBooking at the frontend of your website</li>\n</ul>\n<h4>📝 APPOINTMENT BOOKING FORMS</h4>\n<p>Partner with Fluent Forms to create amazing appointment booking calendar forms and add your event information to them.</p>\n<ul>\n<li>Create or select an existing form to add your booking event</li>\n<li>Add the Calendar Booking Field in the form’s advanced input fields</li>\n<li>Go to Input Customization and choose Select Calendar to add your calendar</li>\n<li>Finally, you can view the form data inside the booking details</li>\n</ul>\n<h4>⚙️INTEGRATION</h4>\n<p>Integrate FluentBooking with popular tools and extend its functionalities according to your needs. From calendars to payment gateways, you have everything at your fingertips to take your business to the next stage.</p>\n<h4>📅 Calendar Integrations (Pro)</h4>\n<p>Automatically sync your events with your favorite calendar app to prevent double bookings or scheduling conflicts. Connect with a single click and keep yourself and your team updated about appointments from anywhere, anytime.</p>\n<ul>\n<li>Google Calendar</li>\n<li>Apple Calendar</li>\n<li>Outlook Calendar</li>\n<li>Nextcloud Calendar</li>\n</ul>\n<h4>💰 Payment Integrations (Pro)</h4>\n<p>Get paid for your services with all the popular payment gateways and let your clients book and pay in a single step. Offer your clients a secure and convenient payment experience.</p>\n<ul>\n<li>Stripe</li>\n<li>PayPal</li>\n<li>G-Pay</li>\n<li>Apple Pay</li>\n</ul>\n<h4>📩 SMS Integrations (Pro)</h4>\n<p>Send automated text SMS or WhatsApp notifications to your attendees and keep them informed about their upcoming appointments. Reduce missed appointments and last-minute cancellations by keeping clients informed and reminded of their bookings.</p>\n<ul>\n<li>Twilio</li>\n</ul>\n<h4>▶️ Video Conferencing Integrations (Pro)</h4>\n<p>Schedule your online meetings on popular video conferencing tools and meet with your attendees from anywhere in the globe. Automatically generate and send meeting links when appointments are booked and make it easy for your attendees to join the meeting.</p>\n<ul>\n<li>Zoom</li>\n<li>Google Meet</li>\n<li>Microsoft Teams</li>\n</ul>\n<h4>🛒 E-commerce Integrations (Pro)</h4>\n<p>Set up your services as products and sell them as events with FluentBooking. Let your customers buy your products as single events.</p>\n<ul>\n<li>WooCommerce</li>\n</ul>\n<h4>📝 Form Integrations</h4>\n<p>Create booking forms and map your important booking calendar data within the forms. Then use the information to make insightful decisions.</p>\n<ul>\n<li>Fluent Forms</li>\n</ul>\n<h4>CRM Integration</h4>\n<p>Design your customer journey with FluentCRM for different booking events and increase your upselling or cross-selling opportunities. Grow your business with the power of email automation and turn your customers into brand advocates.</p>\n<ul>\n<li>FluentCRM</li>\n</ul>\n<h4>Project Management</h4>\n<p>Convert your appointments into tasks and let your team know who is responsible for what. Track your appointments as tasks and manage them in the smartest way.</p>\n<ul>\n<li>FluentBoards</li>\n</ul>\n<h4>Webhook Integration (Pro)</h4>\n<p>Enable real-time data synchronization and automated workflows with webhooks. When an event takes place, send instant information to your other connected applications.</p>\n<h4>Other Integrations (Pro)</h4>\n<ul>\n<li>WPFusion</li>\n<li>Zapier</li>\n<li>Pabbly</li>\n<li>Make</li>\n<li>FlowMattic</li>\n</ul>\n<h4>🖥️DASHBOARD &amp; ANALYTICS</h4>\n<p>Get the most important insights from your appointments and track your business performance. Analyze your total, completed, and canceled bookings to evaluate how you are doing over any given period. Visualize your booking trends in a graphical format, and view your next or latest meetings.</p>\n<h4>🥷BUILT AND CRAFTED BY NINJAS</h4>\n<p>Built and developed by expert developers who have web development skills in this field for over a decade. This tool is built by the same developers who worked behind the development of  FluentCRM, Fluent Forms, Fluent Support, and Ninja Tables.</p>\n<h4>⭐ FluentBooking Review by Experts</h4>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/YycJ6n2n1e4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span><br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/2G9GKQlUr3E?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<blockquote>\n<p><strong>👦 Jack Arturo, Founder of WPFusion</strong><br />\n  There are a couple of booking solutions for WordPress but they tend to be complicated, buggy, or require WooCommerce. FluentBooking is the first plugin I&#8217;ve used that can seriously compete with cloud solutions like Calendly (even in the first release! 🤩) It was easy to set up and I was able to accept new appointments with just a few clicks. Thanks WPManageNinja! 🧡</p>\n<p><strong>👨 Augustine Mak &#8211; Entrepreneur/Educator / funnelstoincome.com</strong><br />\n  Finally, a fantastic and easy way to create bookings in WordPress. Another great opportunity for me to make even more money as an entrepreneur. It’s very easy to use and integrates seamlessly with Fluent Forms for creating advanced booking forms and FluentCRM for email automation. What a game-changer, I highly recommend FluentBooking.</p>\n<p><strong>👨 Davinder Singh Kainth, Founder, The WP Weekly</strong><br />\n  It is a simple yet powerful solution to get going with online bookings and appointments on a WordPress website. Web agencies should find this useful for their own use and on their client websites. If full control and ownership of data on the WordPress platform is your thing and you are looking to set up an efficient online booking system, FluentBooking solution should feature high on your list.</p>\n<p><strong>👨 Leo Koo, Agency Owner</strong><br />\n  FluentBooking is a solid booking form plugin that allows you to receive paid and free bookings quickly. As it comes from WPManageNinja, I thoroughly recommend the plugin as it will grow in features with time. The plugin is solid and ready for clients needing a booking form feature. Personally, I can&#8217;t wait to see what&#8217;s in store for FluentBooking. Don&#8217;t miss out on FluentBooking. Grab yourself a license today 😊</p>\n<p><strong>👦 David Risley, Founder, Blog Marketing Academy</strong><br />\n  Happy to see FluentBooking come out. While it&#8217;ll work standalone, combining it with FluentCRM and Fluent Forms makes a perfect trifecta for so many online businesses. I swear, before too long, I&#8217;ll be using almost all Fluent tools. 🙂</p>\n<p><strong>👦 Christopher Hughes, Founder, Simply Cruises</strong><br />\n  They’ve done it again! The Fluent team have yet again delivered what is to be a very promising new WP plugin. Successfully taking the ease of taking bookings via the web, but putting it firmly under your control on your own website without expensive SaaS fees. These guys know exactly what their customers want and deliver time and time again. A++</p>\n</blockquote>\n<h4>Other Plugins by the Same Team</h4>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/fluent-crm/\" rel=\"ugc\">FluentCRM – Email Marketing Automation and CRM Plugin for WordPress</a> &#8211; The ultimate email marketing automation and CRM plugin for WordPress.</li>\n<li><a href=\"https://wordpress.org/plugins/fluentform/\" rel=\"ugc\">Fluent Forms &#8211; Contact Form Builder Plugin</a> &#8211; The ultimate drag &amp; drop form builder for WordPress.</li>\n<li><a href=\"https://wordpress.org/plugins/ninja-tables/\" rel=\"ugc\">Ninja Tables – Best WP DataTables Plugin for WordPress</a> &#8211; The most user-friendly and responsive table plugin for WordPress.</li>\n<li><a href=\"https://wordpress.org/plugins/fluent-smtp/\" rel=\"ugc\">FluentSMTP – WordPress Mail SMTP, SES, SendGrid, MailGun Plugin</a> &#8211; The ultimate SMTP solution for WordPress.</li>\n<li><a href=\"https://wordpress.org/plugins/fluent-support/\" rel=\"ugc\">Fluent Support – WordPress Helpdesk and Customer Support Ticket Plugin</a> &#8211; The ultimate helpdesk and support ticket plugin for WordPress.</li>\n</ul>\n",
        "installation": "<p>This section describes how to install the plugin and get it working.</p>\n<ol>\n<li>Just search for FluentBooking in WordPress Plugins and click install and activate.</li>\n</ol>\n<p>OR</p>\n<ol>\n<li>Upload the plugin files to the <code>/wp-content/plugins/fluent-booking</code> directory, or install the plugin through the WordPress plugins screen directly.</li>\n<li>Activate the plugin through the \\&#8217;Plugins\\&#8217; screen in WordPress</li>\n<li>Use the <code>FluentBooking</code> from the admin dashboard to configure the plugin</li>\n</ol>\n",
        "faq": "\n<dt id='how%20many%20hosts%20or%20calendars%20can%20i%20add%3F'>\nHow many hosts or calendars can I add?\n</h4>\n<p>\n<p>You can add unlimited hosts and manage unlimited calendars with FluentBooking.</p>\n</p>\n<dt id='do%20i%20need%20to%20use%20other%20fluent%20plugins%20with%20fluentbooking%3F'>\nDo I need to use other Fluent plugins with FluentBooking?\n</h4>\n<p>\n<p>FluentBooking is a complete standalone product, so you don’t need to use any other Fluent plugins.</p>\n</p>\n<dt id='do%20i%20need%20any%20coding%20or%20technical%20skills%20to%20use%20fluentbooking%3F'>\nDo I need any coding or technical skills to use FluentBooking?\n</h4>\n<p>\n<p>No, you don’t need to be a coding expert or tech nerd to use FluentBooking. It’s an easy-to-use and user-friendly tool.</p>\n</p>\n<dt id='what%20calendar%20integrations%20are%20available%20in%20fluentbooking%3F'>\nWhat calendar integrations are available in FluentBooking?\n</h4>\n<p>\n<p>FluentBooking supports a one-click connection with Google Calendar, Apple Calendar, Nextcloud Calendar, Outlook Calendar, etc.</p>\n</p>\n<dt id='what%20payment%20gateways%20are%20supported%20by%20fluentbooking%3F'>\nWhat payment gateways are supported by FluentBooking?\n</h4>\n<p>\n<p>FluentBooking supports popular payment gateways like Stripe, PayPal, etc., to accept payments from clients.</p>\n</p>\n<dt id='which%20virtual%20conferencing%20tools%20are%20supported%20by%20fluentbooking%3F'>\nWhich virtual conferencing tools are supported by FluentBooking?\n</h4>\n<p>\n<p>FluentBooking supports all popular conferencing tools such as Zoom, Google Meet, Microsoft Teams, etc.</p>\n</p>\n<dt id='can%20i%20customize%20the%20content%20of%20email%20and%20sms%20notifications%3F'>\nCan I customize the content of email and SMS notifications?\n</h4>\n<p>\n<p>Yes, you can customize the content of your email and SMS notifications.</p>\n</p>\n<dt id='does%20fluentbooking%20have%20any%20public%20roadmap%3F'>\nDoes FluentBooking have any public roadmap?\n</h4>\n<p>\n<p>Yes, FluentBooking has a <a href=\"https://fluentbooking.com/roadmap/\" rel=\"nofollow ugc\">public roadmap</a> where you can track the development and share your suggestions.</p>\n</p>\n\n",
        "changelog": "<h4>1.5.20 (Date: 23 Aug 2024)</h4>\n<ul>\n<li>New: Reorder Calendar Event</li>\n<li>New: Calendar Import/Export</li>\n<li>New: Book Multiple Spots at Once</li>\n<li>New: Generate Booking Link</li>\n<li>Added Fluent Board Task to CRM Contact</li>\n<li>Formatted Custom Duration</li>\n<li>Improved Lots of UI/UX</li>\n<li>Fixed SVG Not Showing in Email</li>\n<li>Fixed Deleted Event&#8217;s Calendar Not Appearing Issue</li>\n</ul>\n<h4>1.5.11 (Date: 01 Aug 2024)</h4>\n<ul>\n<li>Added Rebook Appointment Feature</li>\n<li>Added Date Picker for Date Field</li>\n<li>Added Manual Email Sending to Guest</li>\n<li>Fixed Slot Interval Issue</li>\n<li>Fixed Host Email Notification Issue</li>\n</ul>\n<h4>1.5.02 (Date: 24 Jul 2024)</h4>\n<ul>\n<li>Fixed Media Upload Issue</li>\n<li>Fixed Issue with Group Booking</li>\n<li>Fixed Conflict Checking Issue with Round Robin</li>\n</ul>\n<h4>1.5.01 (Date: 18 July 2024)</h4>\n<ul>\n<li>Fixed Issue with FluentForm</li>\n<li>Fixed Board Due Date Issue</li>\n</ul>\n<h4>1.5.0 (Date: 16 July 2024)</h4>\n<ul>\n<li>Initial Launch as a free plugin</li>\n<li>Added: Clone Option of Email, SMS, Webhook and Integration Settings</li>\n<li>Added: Fluent Board Due Date based Meeting Date Option</li>\n<li>Added: Filter by Calendar Types</li>\n<li>Added: Calendar Query Parameter &#8211; Time</li>\n<li>Added: Duration Labels According to the Duration Hook</li>\n<li>Fixed Round Robin Day Light Saving Issue</li>\n<li>Fixed Issue with Elementor Integration</li>\n<li>Improved Round Robin Scheduling</li>\n<li>Lots of UI-UX Improvements</li>\n</ul>\n"
    },
    "short_description": "The ultimate solution for booking appointments, meetings, webinars, events, sales calls, and more.",
    "description": "<p><a href=\"https://fluentbooking.com/\" rel=\"nofollow ugc\">FluentBooking</a> is a top-notch solution for scheduling and delivering appointment-based services. Whether it&#8217;s an appointment, event, or anything else, FluentBooking has you covered!</p>\n<p>From scheduling personal services to managing business events, it’s developed to provide the easiest management of your availability and clients.</p>\n<p>All you need to do is set your availability, connect with your calendar app, go live with the booking calendar, and accept payments. The final step? Meet with your attendee and make a great impression!</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/L6uJk1FSbZ4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent&#038;listType=playlist&#038;list=PLXpD0vT4thWHP3gjtexAT3fqP_Pdt78g0\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>USEFUL LINKS</h4>\n<p><strong><a href=\"https://fluentbooking.com/\" rel=\"nofollow ugc\">Official Website</a> || <a href=\"https://demo.fluentbooking.com/\" rel=\"nofollow ugc\">Demo</a> || <a href=\"https://fluentbooking.com/docs/\" rel=\"nofollow ugc\">Documentation</a> || <a href=\"https://www.facebook.com/FluentBooking\" rel=\"nofollow ugc\">Facebook</a> || <a href=\"https://www.instagram.com/fluentbooking?igsh=MThwY2dybnBibWkwcg==\" rel=\"nofollow ugc\">Instagram</a> || <a href=\"https://x.com/FluentBooking\" rel=\"nofollow ugc\">Twitter</a> || <a href=\"https://www.linkedin.com/company/fluentbooking\" rel=\"nofollow ugc\">LinkedIn</a></strong></p>\n<h4>🧐 WHY FLUENTBOOKING IS A GAME-CHANGER?</h4>\n<p>✅ Full GDPR Support: Manage all of your appointments and clients within the dashboard<br />\n✅ Multiple Meeting Types: Schedule one-on-one, group, team/round robin, and one-off events<br />\n✅ Flexible Meeting Locations: Choose virtual, in-person, phone, or custom meeting formats<br />\n✅ Automated Notifications: Automatically send email and SMS reminders to prevent no-shows<br />\n✅ Easy Availability Management: Set your weekly hours, add date overrides, and include buffer times<br />\n✅ Seamless Integrations: Connect with calendar apps, payment gateways, video conferencing tools, e-commerce platforms, CRM, and project management tools<br />\n✅ Customizable Booking Forms: Create forms for a personalized booking<br />\nexperience<br />\n✅ Real-Time Updates: Use webhooks to sync data and automate workflows instantly<br />\n✅ Insightful Dashboard: Track and analyze your bookings with visual reports</p>\n<h4>🧐 WHO NEEDS FLUENTBOOKING?</h4>\n<p>FluentBooking can be the go-to option for individuals or businesses looking for a reliable tool to manage their appointments. It’s a great choice for anyone needing an efficient and user-friendly appointment management solution.</p>\n<p><strong>Personal Services:</strong> Sell your personal services with one-on-one meetings and give clients a personalized experience</p>\n<p><strong>Sales:</strong> Schedule flexible sales meetings with the team or clients to achieve the best outcomes</p>\n<p><strong>Marketing:</strong> Meet with your team, set marketing goals, and ensure all members are aligned with the objectives</p>\n<p><strong>eLearning:</strong> Build your virtual classroom for students and take online education to the next level</p>\n<p><strong>Customer Service:</strong> Address and resolve customer issues, questions, or concerns, and turn frustrations into smiles</p>\n<p><strong>Recruitment:</strong> Schedule interview sessions and hire top talents for your team</p>\n<p><strong>Salons &amp; Spas:</strong> Organize your team’s schedule and provide beauty, grooming, or relaxation services to clients</p>\n<p><strong>Barber Services:</strong> Offer personalized grooming services to clients and meet their preferences</p>\n<p><strong>Healthcare Services:</strong> Automate patient appointments and provide a hassle-free treatment experience</p>\n<p><strong>Pet Grooming &amp; Veterinary Services:</strong> Meet with pet owners and provide medical care for their pets</p>\n<p><strong>Home Services:</strong> Send the right person to the right location to deliver home services to individuals or groups</p>\n<p><strong>Fitness Centers &amp; Gyms:</strong> Offer personal training sessions, group classes, or wellness consultations to health-conscious individuals</p>\n<p><strong>Automotive Services:</strong> Provide vehicle maintenance or repair services to vehicle owners at their preferred times</p>\n<h4>🕒 AVAILIBILITY MANAGEMENT</h4>\n<p>Experience hassle-free availability setup and management so you can focus more on your appointments. Set, manage, and display your appointment times to offer your attendees a convenient booking experience.</p>\n<p>Set your weekly availability hours and days for appointments<br />\nChoose your availability between future days, date ranges, or indefinitely<br />\nOffer multiple meeting durations and let attendees select the best time for their needs<br />\nAdd date overrides for changes to your weekly availability<br />\nDefine the event name and description for a better understanding of your service<br />\nSelect flexible meeting durations for your appointments<br />\nPick the best meeting location for an optimal service experience<br />\nAdd buffer time before or after your meetings to take a breather<br />\nLimit booking frequency or total duration and lock any time zone if needed<br />\nAdd booking questions to consider attendees&#8217; needs and preferences<br />\nAutomatically convert time zones so everyone sees the correct appointment time locally</p>\n<h4>👥 MULTIPLE MEETING TYPES</h4>\n<p>Having different meeting types like one-on-one, group, team/round robin, and one-off events makes it easier for both organizers and attendees, right? This helps you to focus on individual needs, host group discussions, manage team schedules fairly, and run special events.</p>\n<p>And FluentBooking does the exact thing! You can easily schedule and manage various meeting types to suit your needs:</p>\n<p><strong>One-on-one Meeting:</strong> Schedule a one-on-one meeting with your attendee and give personalized attention and service</p>\n<p><strong>Group Meeting (Pro):</strong> Arrange group meetings with multiple participants and work towards common goals</p>\n<p><strong>Round Robin Meeting (Pro):</strong> Set your team and start giving services to clients with rotating hosts</p>\n<p><strong>One-off Event (Pro):</strong> Create and manage single-time unique single events or group events that happen only once</p>\n<h4>🌏 MULTIPLE MEETING LOCATION</h4>\n<p>Select the best location for your meeting and enjoy flexibility and convenience. As an organizer, you just need to choose the best format for your meeting, and as an attendee, you can pick the most convenient way to join.</p>\n<p><strong>Conference:</strong> Easily host virtual meetings with popular video conferencing tools like Zoom, Google Meet, Microsoft Teams, etc.</p>\n<p><strong>In Person:</strong> Arrange face-to-face meetings at a physical location and meet in person</p>\n<p><strong>Phone:</strong> Offer phone meetings to attendees who prefer voice-only conversations</p>\n<p><strong>Online:</strong> Provide a direct meeting link on the booking calendar page to make joining simple and straightforward</p>\n<p><strong>Custom:</strong> Customize the meeting location with a specific title and description and meet your attendees</p>\n<h4>📢 AUTOMATED NOTIFICATIONS</h4>\n<p>Worrying about no-shows or cancellations? With automated notifications, there&#8217;s no chance of no-shows or last-minute surprises! Let’s improve your appointment conversion rate with email and SMS notifications.</p>\n<p><strong>Email notifications:</strong> Send automatic email notifications to the meeting organizer and attendee to keep everyone informed and updated in real-time. You can send booking confirmation emails, booking cancellation emails, booking rescheduled emails, booking approval request emails, booking submission confirmation emails, and more.</p>\n<p><strong>SMS notifications (Pro):</strong> Don’t limit yourself to just emails! You can send text SMS or WhatsApp messages to your attendee via Twilio too.</p>\n<h4>🛠 ADVANCED SETTINGS (Pro)</h4>\n<p>Go beyond regular scheduling and take advantage of advanced features that will make your appointment management experience even smoother.</p>\n<ul>\n<li>Redirect your attendee to any custom URL after booking</li>\n<li>Set manual confirmation or booking notice time for your calendar events</li>\n<li>Select whether you want to limit your attendee from canceling the meeting</li>\n<li>Select whether you want to limit your attendee from rescheduling</li>\n<li>Load FluentBooking at the frontend of your website</li>\n</ul>\n<h4>📝 APPOINTMENT BOOKING FORMS</h4>\n<p>Partner with Fluent Forms to create amazing appointment booking calendar forms and add your event information to them.</p>\n<ul>\n<li>Create or select an existing form to add your booking event</li>\n<li>Add the Calendar Booking Field in the form’s advanced input fields</li>\n<li>Go to Input Customization and choose Select Calendar to add your calendar</li>\n<li>Finally, you can view the form data inside the booking details</li>\n</ul>\n<h4>⚙️INTEGRATION</h4>\n<p>Integrate FluentBooking with popular tools and extend its functionalities according to your needs. From calendars to payment gateways, you have everything at your fingertips to take your business to the next stage.</p>\n<h4>📅 Calendar Integrations (Pro)</h4>\n<p>Automatically sync your events with your favorite calendar app to prevent double bookings or scheduling conflicts. Connect with a single click and keep yourself and your team updated about appointments from anywhere, anytime.</p>\n<ul>\n<li>Google Calendar</li>\n<li>Apple Calendar</li>\n<li>Outlook Calendar</li>\n<li>Nextcloud Calendar</li>\n</ul>\n<h4>💰 Payment Integrations (Pro)</h4>\n<p>Get paid for your services with all the popular payment gateways and let your clients book and pay in a single step. Offer your clients a secure and convenient payment experience.</p>\n<ul>\n<li>Stripe</li>\n<li>PayPal</li>\n<li>G-Pay</li>\n<li>Apple Pay</li>\n</ul>\n<h4>📩 SMS Integrations (Pro)</h4>\n<p>Send automated text SMS or WhatsApp notifications to your attendees and keep them informed about their upcoming appointments. Reduce missed appointments and last-minute cancellations by keeping clients informed and reminded of their bookings.</p>\n<ul>\n<li>Twilio</li>\n</ul>\n<h4>▶️ Video Conferencing Integrations (Pro)</h4>\n<p>Schedule your online meetings on popular video conferencing tools and meet with your attendees from anywhere in the globe. Automatically generate and send meeting links when appointments are booked and make it easy for your attendees to join the meeting.</p>\n<ul>\n<li>Zoom</li>\n<li>Google Meet</li>\n<li>Microsoft Teams</li>\n</ul>\n<h4>🛒 E-commerce Integrations (Pro)</h4>\n<p>Set up your services as products and sell them as events with FluentBooking. Let your customers buy your products as single events.</p>\n<ul>\n<li>WooCommerce</li>\n</ul>\n<h4>📝 Form Integrations</h4>\n<p>Create booking forms and map your important booking calendar data within the forms. Then use the information to make insightful decisions.</p>\n<ul>\n<li>Fluent Forms</li>\n</ul>\n<h4>CRM Integration</h4>\n<p>Design your customer journey with FluentCRM for different booking events and increase your upselling or cross-selling opportunities. Grow your business with the power of email automation and turn your customers into brand advocates.</p>\n<ul>\n<li>FluentCRM</li>\n</ul>\n<h4>Project Management</h4>\n<p>Convert your appointments into tasks and let your team know who is responsible for what. Track your appointments as tasks and manage them in the smartest way.</p>\n<ul>\n<li>FluentBoards</li>\n</ul>\n<h4>Webhook Integration (Pro)</h4>\n<p>Enable real-time data synchronization and automated workflows with webhooks. When an event takes place, send instant information to your other connected applications.</p>\n<h4>Other Integrations (Pro)</h4>\n<ul>\n<li>WPFusion</li>\n<li>Zapier</li>\n<li>Pabbly</li>\n<li>Make</li>\n<li>FlowMattic</li>\n</ul>\n<h4>🖥️DASHBOARD &amp; ANALYTICS</h4>\n<p>Get the most important insights from your appointments and track your business performance. Analyze your total, completed, and canceled bookings to evaluate how you are doing over any given period. Visualize your booking trends in a graphical format, and view your next or latest meetings.</p>\n<h4>🥷BUILT AND CRAFTED BY NINJAS</h4>\n<p>Built and developed by expert developers who have web development skills in this field for over a decade. This tool is built by the same developers who worked behind the development of  FluentCRM, Fluent Forms, Fluent Support, and Ninja Tables.</p>\n<h4>⭐ FluentBooking Review by Experts</h4>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/YycJ6n2n1e4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span><br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/2G9GKQlUr3E?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<blockquote>\n<p><strong>👦 Jack Arturo, Founder of WPFusion</strong><br />\n  There are a couple of booking solutions for WordPress but they tend to be complicated, buggy, or require WooCommerce. FluentBooking is the first plugin I&#8217;ve used that can seriously compete with cloud solutions like Calendly (even in the first release! 🤩) It was easy to set up and I was able to accept new appointments with just a few clicks. Thanks WPManageNinja! 🧡</p>\n<p><strong>👨 Augustine Mak &#8211; Entrepreneur/Educator / funnelstoincome.com</strong><br />\n  Finally, a fantastic and easy way to create bookings in WordPress. Another great opportunity for me to make even more money as an entrepreneur. It’s very easy to use and integrates seamlessly with Fluent Forms for creating advanced booking forms and FluentCRM for email automation. What a game-changer, I highly recommend FluentBooking.</p>\n<p><strong>👨 Davinder Singh Kainth, Founder, The WP Weekly</strong><br />\n  It is a simple yet powerful solution to get going with online bookings and appointments on a WordPress website. Web agencies should find this useful for their own use and on their client websites. If full control and ownership of data on the WordPress platform is your thing and you are looking to set up an efficient online booking system, FluentBooking solution should feature high on your list.</p>\n<p><strong>👨 Leo Koo, Agency Owner</strong><br />\n  FluentBooking is a solid booking form plugin that allows you to receive paid and free bookings quickly. As it comes from WPManageNinja, I thoroughly recommend the plugin as it will grow in features with time. The plugin is solid and ready for clients needing a booking form feature. Personally, I can&#8217;t wait to see what&#8217;s in store for FluentBooking. Don&#8217;t miss out on FluentBooking. Grab yourself a license today 😊</p>\n<p><strong>👦 David Risley, Founder, Blog Marketing Academy</strong><br />\n  Happy to see FluentBooking come out. While it&#8217;ll work standalone, combining it with FluentCRM and Fluent Forms makes a perfect trifecta for so many online businesses. I swear, before too long, I&#8217;ll be using almost all Fluent tools. 🙂</p>\n<p><strong>👦 Christopher Hughes, Founder, Simply Cruises</strong><br />\n  They’ve done it again! The Fluent team have yet again delivered what is to be a very promising new WP plugin. Successfully taking the ease of taking bookings via the web, but putting it firmly under your control on your own website without expensive SaaS fees. These guys know exactly what their customers want and deliver time and time again. A++</p>\n</blockquote>\n<h4>Other Plugins by the Same Team</h4>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/fluent-crm/\" rel=\"ugc\">FluentCRM – Email Marketing Automation and CRM Plugin for WordPress</a> &#8211; The ultimate email marketing automation and CRM plugin for WordPress.</li>\n<li><a href=\"https://wordpress.org/plugins/fluentform/\" rel=\"ugc\">Fluent Forms &#8211; Contact Form Builder Plugin</a> &#8211; The ultimate drag &amp; drop form builder for WordPress.</li>\n<li><a href=\"https://wordpress.org/plugins/ninja-tables/\" rel=\"ugc\">Ninja Tables – Best WP DataTables Plugin for WordPress</a> &#8211; The most user-friendly and responsive table plugin for WordPress.</li>\n<li><a href=\"https://wordpress.org/plugins/fluent-smtp/\" rel=\"ugc\">FluentSMTP – WordPress Mail SMTP, SES, SendGrid, MailGun Plugin</a> &#8211; The ultimate SMTP solution for WordPress.</li>\n<li><a href=\"https://wordpress.org/plugins/fluent-support/\" rel=\"ugc\">Fluent Support – WordPress Helpdesk and Customer Support Ticket Plugin</a> &#8211; The ultimate helpdesk and support ticket plugin for WordPress.</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/fluent-booking.1.5.20.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/fluent-booking/assets/screenshot-1.png?rev=3119303",
            "caption": "FluentBooking Dashboard"
        },
        {
            "src": "https://ps.w.org/fluent-booking/assets/screenshot-2.png?rev=3119303",
            "caption": "Event Settings"
        },
        {
            "src": "https://ps.w.org/fluent-booking/assets/screenshot-3.png?rev=3119303",
            "caption": "Bookings List"
        },
        {
            "src": "https://ps.w.org/fluent-booking/assets/screenshot-4.png?rev=3119303",
            "caption": "Guest and Meeting Information"
        },
        {
            "src": "https://ps.w.org/fluent-booking/assets/screenshot-5.png?rev=3119303",
            "caption": "General Settings"
        }
    ],
    "tags": {
        "appointment-booking": "appointment booking",
        "appointments": "appointments",
        "booking": "booking",
        "booking-system": "booking system"
    },
    "stable_tag": "1.5.20",
    "versions": {
        "1.5.0": "https://downloads.wordpress.org/plugin/fluent-booking.1.5.0.zip",
        "1.5.01": "https://downloads.wordpress.org/plugin/fluent-booking.1.5.01.zip",
        "1.5.02": "https://downloads.wordpress.org/plugin/fluent-booking.1.5.02.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/fluent-booking.1.5.1.zip",
        "1.5.10": "https://downloads.wordpress.org/plugin/fluent-booking.1.5.10.zip",
        "1.5.20": "https://downloads.wordpress.org/plugin/fluent-booking.1.5.20.zip",
        "trunk": "https://downloads.wordpress.org/plugin/fluent-booking.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/fluent-booking/assets/banner-772x250.png?rev=3119303",
        "high": "https://ps.w.org/fluent-booking/assets/banner-1544x500.png?rev=3119303"
    },
    "icons": {
        "1x": "https://ps.w.org/fluent-booking/assets/icon.svg?rev=3119303",
        "svg": "https://ps.w.org/fluent-booking/assets/icon.svg?rev=3119303"
    },
    "blocks": {
        "fluent-booking/calendar": {
            "name": "fluent-booking/calendar",
            "title": "Fluent Booking Event"
        },
        "fluent-booking/team-management": {
            "name": "fluent-booking/team-management",
            "title": "FluentBooking Team"
        },
        "fluent-booking/calendar-management": {
            "name": "fluent-booking/calendar-management",
            "title": "FluentBooking Calendar"
        },
        "fluent-booking/booking-management": {
            "name": "fluent-booking/booking-management",
            "title": "FluentBooking Bookings"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}