{
    "name": "Five Star Restaurant Menu and Food Ordering",
    "slug": "food-and-drink-menu",
    "version": "2.4.18",
    "author": "<a href=\"https://www.fivestarplugins.com/\">Five Star Plugins</a>",
    "author_profile": "https://profiles.wordpress.org/rustaurius/",
    "contributors": {
        "rustaurius": {
            "profile": "https://profiles.wordpress.org/rustaurius/",
            "avatar": "https://secure.gravatar.com/avatar/9c9888d57981a083f95e53e5f1bcce92?s=96&d=monsterid&r=g",
            "display_name": "Rustaurius"
        }
    },
    "requires": "6.0",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 92,
    "ratings": {
        "5": 87,
        "4": 3,
        "3": 2,
        "2": 1,
        "1": 8
    },
    "num_ratings": 101,
    "support_url": "https://wordpress.org/support/plugin/food-and-drink-menu/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 7000,
    "downloaded": 379266,
    "last_updated": "2024-07-16 19:37:00",
    "added": "2013-12-06",
    "homepage": "https://www.fivestarplugins.com/plugins/five-star-restaurant-menu/",
    "sections": {
        "description": "<p>Create a stylish, responsive restaurant menu and add it to your site in minutes. With the easy-to-use builder and the included layout and customization options, you&#8217;ll have it set up in no time.</p>\n<p>This restaurant plugin can also be used to enable a food ordering system directly on your site, and you can manage the orders from our associated Five Star Restaurant Manager mobile app. This is available in the ultimate version, which you can read about in the <strong>Food Ordering</strong> section below.</p>\n<p><a href=\"https://www.fivestarplugins.com/food-ordering-demo/\" rel=\"nofollow ugc\">Food Ordering Demo</a></p>\n<p><a href=\"https://www.fivestarplugins.com/five-star-restaurant-menu-demo/\" rel=\"nofollow ugc\">Menu Demo</a></p>\n<h3>Key Features</h3>\n<ul>\n<li>Unlimited restaurant menus and menu items.</li>\n<li>Responsive layout, so your restaurant menu looks great on mobile and all devices.</li>\n<li>Add your restaurant menu to any page via the included <strong>Gutenberg blocks and shortcodes</strong>.</li>\n<li>Add a menu directly into any of your restaurant site&#8217;s block theme templates via the included <strong>patterns</strong>.</li>\n<li>Add unique photos and prices to each food or drink menu item .</li>\n<li>Optional sidebar to display your restaurant menu sections, for quick navigation.</li>\n<li>Full restaurant menu schema structured data automatically integrated, so Google can correctly identify your page as a menu and use it accordingly in search results.</li>\n<li>Create a QR code that you can use in restaurant to let your guests see your online menu.</li>\n</ul>\n<p><em><strong>Five Star Restaurant Menu</strong> is very user friendly and comes with a walk-through that runs automatically when you activate the plugin and will help you create your first menu items, add the menu to your site and set key options!</em></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/F30zoC0D55o?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Restaurant Menu QR Code</h3>\n<p>The plugin comes with the ability for you to generate a QR code that leads directly to your online menu. You can place these, for example, at the tables in your restaurant, so guests can scan them and gain easy and quick access to the restaurant menu page on your website.</p>\n<p>There are several great benefits to utilizing your online menu in your restaurant, including:</p>\n<ul>\n<li>Quick updates: You can instantaneously make changes to your restaurant menu. No matter how small or big the change you need to make is, you won&#8217;t need to reprint anything or explain it to every customer. </li>\n<li>Save money and trees by avoiding the need to print your restaurant menus.</li>\n<li>Creates a more contactless experience, no longer having menus shared between all customers.</li>\n</ul>\n<h3>Restaurant Menu Sections</h3>\n<p>The plugin comes with the ability to create separate restaurant menu sections. This allows you to divide a menu into multiple parts, making it more clear for your customers. You can even include a note for a section (e.g. &#8220;All items in this section come with salad or fries.&#8221;). Some examples of sections you can create are:</p>\n<ul>\n<li>Appetizers</li>\n<li>Main Course</li>\n<li>Dessert Menu</li>\n<li>Kid&#8217;s Menu</li>\n<li>Gluten Free Menu</li>\n<li>Weekly Specials</li>\n</ul>\n<p>You can then add a sidebar to your restaurant menu page, which lists all your sections, so your guests can quickly find what they&#8217;re looking for.</p>\n<p>In addition to this, you can also create completely separate and customizable restaurant menus. This feature can be used for several different purposes including individual menus for different meals, but also separate menus for drinks or snacks. It even works great if your restaurant is split up into different areas (e.g. a dining hall, a cafe, a bistro, etc.). Some examples of individual menus you can create are:</p>\n<ul>\n<li>Breakfast</li>\n<li>Brunch</li>\n<li>Lunch</li>\n<li>Dinner</li>\n<li>Wine</li>\n<li>Drinks</li>\n<li>Snacks</li>\n<li>Cafe Menu</li>\n<li>Specialties</li>\n<li>The possibilities are endless!</li>\n</ul>\n<h3>More Features!</h3>\n<p>Several additional features are included that will help ensure you&#8217;re able to set your restaurant menu up easily and with all the options you need. They will also enable you to deliver the best and easiest drink and food menu experience for the visitors to your restaurant&#8217;s website. These features include:</p>\n<ul>\n<li>Extra Gutenberg blocks to display individual sections or items on a page (instead of just a whole menu).</li>\n<li>Several extra patterns, so you can integrate restaurant menus, sections and individual items directly into your block theme.</li>\n<li>Ability to add multiple prices for a single item.</li>\n<li>Advanced template system for further layout customization of your restaurant menu(s). </li>\n<li>Simple compatibility with WPML for multi-language sites.</li>\n<li>Restaurants can add a footer to each drink or food menu for legal disclaimers or other notes.</li>\n<li>Display reviews for restaurant menu items (requires the premium version of the Five Star Restaurant Reviews plugin).</li>\n<li>Add a submit review form to restaurant menu items (requires the premium version of the Five Star Restaurant Reviews plugin).</li>\n<li>Widgets to display quick restaurant menu items in your sidebar or footer.</li>\n</ul>\n<h3>Premium Restaurant Menu</h3>\n<p>With the premium version of the plugin, you can extend the functionality of your restaurant menu to offer your guests the best possible experience. This includes multiple layout options, the ability to add custom fields to your menu items, sorting and filtering options, and much more.</p>\n<p>Premium features include:</p>\n<ul>\n<li>Additional responsive restaurant menu styles/layouts, including:</li>\n<li>The <strong>Refined</strong> style, which displays your restaurant menu in an elegant layout, without images, like you may find in an upscale restaurant.</li>\n<li>The <strong>Image</strong> style: Perfect for showcasing all the great photos you have of your restaurant menu items.</li>\n<li>The <strong>Ordering</strong> style: Designed and adapted for use specifically with the ordering features available in the ultimate version, this layout makes browsing, adding to cart and checking out a breeze.</li>\n<li>The <strong>Luxe</strong> style: A variation on the Refined style, this minimalist layout gives a luxury feel to your restaurant menu and fits in any theme.</li>\n<li>Custom fields to add any extra info you want to your restaurant menu items.</li>\n<li>Sorting, filtering and search options to let your customers find the exact meal or item they&#8217;re looking for.</li>\n<li>Icons to indicate dietary and ethical requirements, including organic, gluten-free, kosher, halal and many more.</li>\n<li>Badges for item features, specials and sales.</li>\n<li>Special/discount pricing.</li>\n<li>Google maps to show off local suppliers or ethical sourcing programs.</li>\n<li>Add a related items section to the single menu item page.</li>\n<li>Labelling options that let you change the wording for all the labels displayed on the front end of the plugin.</li>\n<li>Advanced styling options to change the fonts, colors, widths, borders, etc. of the different restaurant menu elements on your restaurant site. </li>\n</ul>\n<p>By combining the sorting/filtering/search options with the badges, dietary icons and specials, you can be sure that your guests will be able to locate the best possible menu items for them in no time at all.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/2NCgp67M_k4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Food Ordering (Requires Ultimate Version)</h3>\n<p>The ultimate version of the Five Star Restaurant Menu plugin lets you add a complete food ordering system to your restaurant website. Stop paying commissions to third-party services and start offering ordering directly on your site.</p>\n<p>Key features of the food ordering platform include:</p>\n<ul>\n<li>Add-to-cart buttons for all restaurant menu items.</li>\n<li>Intuitive cart that fits into any theme and lets customers easily add items directly from the your restaurant menu and check out. </li>\n<li>Options to have the responsive cart display at the bottom of the screen or on the side.</li>\n<li>Require payment immediately or give your customer the option to pay at the restaurant.</li>\n<li>Use Stripe payment intents (see below for details) or PayPal as your payment gateway.</li>\n<li>Create unlimited notifications, which can be sent via email and/or SMS to the restaurant admin and the customer when a new order is placed and/or whenever the status is changed for a food order.</li>\n<li>Easy-to-use admin interface lets you quickly manage your orders.</li>\n<li>Advanced order edit screen, via which you can update the customer information, the items in the order, the order status as well as the payment amount.</li>\n<li>Syncs directly with the Five Star Restaurant Manager mobile app (iOS and Android), so you can receive push notifications for new orders and manage your orders in the restaurant kitchen or on the go.</li>\n</ul>\n<p>Setting it up couldn&#8217;t be easier. When you enable the ordering feature, an &#8220;Add to Cart&#8221; button will appear on each restaurant menu item, which will let you add as many items as you want to the cart. There are also options to enable advanced ordering features, which let you have multiple prices per item as well as add-ons that guests can select when adding items to their cart.</p>\n<p>From the cart, you can then increase and decrease the quantity, remove items and view any special requests or add-ons. Checkout is a breeze with the included options. You can set it so that customers are required to pay right away at checkout or give them the option to pay when they pick the food up at your restaurant.</p>\n<p>Combine this with the available custom fields feature, which lets you add new inputs to the order form, and you can set up the checkout process however you like. For example, you could have an option for delivery and then require immediate payment either via Stripe or PayPal.</p>\n<p><strong>Stripe Payment Intents</strong></p>\n<p>The Stripe payment gateway now makes use of their <strong>payment intents</strong> system. With this you can enable many different types of payment methods, all directly from within your Stripe account. These include <strong>credit card, Apple Pay, Google Pay, direct debit, Afterpay and many other country- and region-specific methods</strong>.</p>\n<p>There is now also an option to <strong>take payments as holds and then charge/capture the payment at a later time</strong>. You could use this, for example, to only capture the payment once someone has arrived at the restaurant to pick up their food.</p>\n<p>Further customization features for the restaurant ordering system include:</p>\n<ul>\n<li>Add-ons for menu items, which can be selected when adding to cart (e.g. extra toppings).</li>\n<li>Restrict when ordering should be available by setting up a schedule. </li>\n<li>Set a minimum order total (e.g. in dollars, euros, etc., depending on your chosen currency).</li>\n<li>Option to temporarily pause ordering (e.g. you are at capacity in your restaurant or for orders).</li>\n<li>Alternatively, set a maximum number of orders that you can take.</li>\n<li>Fields for the customer to leave notes for both individual items and the overall order.</li>\n<li>Add custom fields to the order form (e.g. if you require extra info from your customers, want to offer delivery, etc.).</li>\n<li>Styling and labelling options to further customize the order form.</li>\n</ul>\n<p>Once an order is placed, you will receive a customizable notification that contains all of the order information. This is also created as an order in the plugin admin panel, where you can view all the details and also change the status and edit the order. Your customers can then view the order status right on your menu page via an intuitive order progress bar.</p>\n<p>There are further options to customize the ordering experience by setting specific hours when the ordering should be available as well as advanced features that let you add customization options to each menu item (e.g. &#8220;Add bacon&#8221;, &#8220;Upgrade to onion rings&#8221;, etc.). There is also an array of styling options to modify the colors of the ordering elements, including the buttons, the cart and the progress bar.</p>\n<h3>Five Star Restaurant Manager Mobile App</h3>\n<p>The ultimate version also syncs directly with our Five Star Restaurant Manager mobile app, for iOS and Android, which lets you manage your orders from your phone or tablet without needing to log in to your site/WordPress. With this, you can:</p>\n<ul>\n<li>Receive push notifications when new orders are submitted.</li>\n<li>View all orders directly in the app.</li>\n<li>Change the status of individual orders (e.g. to preparing or ready).</li>\n<li>Access the customer&#8217;s phone number or email address to quickly get in touch with them.</li>\n</ul>\n<p>With these features, you can set the app up on a tablet in the restaurant kitchen, to prepare orders as they come in, or for you to manage them anywhere on the go!</p>\n<p>For further information and purchasing options, please visit our <a href=\"https://www.fivestarplugins.com/plugins/five-star-restaurant-menu/\" rel=\"nofollow ugc\">WordPress restaurant menu</a> homepage.</p>\n<p><em>We are also pleased to offer a free 7-day trial of either the premium version or the ultimate version of the plugin, which you can use to test out features like the ordering system, additional layouts, custom fields and filtering options before buying!</em></p>\n<p>This plugin is one part of our suite designed to give you the best WordPress restaurant experience. Check out the powerful <a href=\"https://wordpress.org/plugins/restaurant-reservations/\" rel=\"ugc\">Restaurant Reservations</a> plugin and let your customers reserve a table directly on your site. With its intuitive and easy-to-use interface, you&#8217;ll be sure to not lose out on business to your competitors.</p>\n<h3>Help and support</h3>\n<ul>\n<li><a href=\"https://doc.fivestarplugins.com/plugins/food-and-drink-menu/user/\" rel=\"nofollow ugc\">Our documentation and user guide</a></li>\n<li><a href=\"https://wordpress.org/plugins/food-and-drink-menu/installation/\" rel=\"ugc\">Our installation guide</a></li>\n<li><a href=\"https://wordpress.org/plugins/food-and-drink-menu/faq/\" rel=\"ugc\">FAQs</a></li>\n<li><a href=\"https://www.youtube.com/playlist?list=PLEndQUuhlvSqy2KjpKfGpd-vAUJLfdYMI\" rel=\"nofollow ugc\">Our tutorial videos</a></li>\n<li><a href=\"https://wordpress.org/support/plugin/food-and-drink-menu/\" rel=\"ugc\">The support forum</a></li>\n<li><a href=\"https://www.fivestarplugins.com/support-center/\" rel=\"nofollow ugc\">Our Support Center</a></li>\n</ul>\n",
        "installation": "<ol>\n<li>Upload the &#8216;food-and-drink-menu&#8217; folder to the &#8216;/wp-content/plugins/&#8217; directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n<p>or</p>\n<ol>\n<li>Go to the &#8216;Plugins&#8217; menu in WordPress and click &#8216;Add New&#8217;</li>\n<li>Search for &#8216;Five Star Restaurant Menu&#8217; and select &#8216;Install Now&#8217;</li>\n<li>Activate the plugin when prompted</li>\n</ol>\n<h4>Getting Started</h4>\n<p>After activating the plugin, <strong>a walk-through will run automatically</strong> that will help you to create your menu items, add a menu to your site and set key options.</p>\n<p>You can also follow these steps to configure the plugin.</p>\n<ol>\n<li>\n<p>To create a menu section:</p>\n<ul>\n<li>Open the &#8216;Sections&#8217; tab in the plugin admin panel.</li>\n<li>The &#8216;Add New Menu Section&#8217; area will be on the left. Fill in the fields and click the &#8216;Add New Menu Section&#8217; button.</li>\n<li>Your new section will show in the table on the right. You can click on it there to edit it.</li>\n<li>You can now assign menu items to specific sections from the menu item create/edit screen.</li>\n</ul>\n</li>\n<li>\n<p>To create menu items:</p>\n<ul>\n<li>Open the &#8216;Menu Items&#8217; tab in the plugin admin panel.</li>\n<li>Click on the &#8216;Add Menu Item&#8217; button.</li>\n<li>Fill in the title, description and price fields, add a photo, and then choose the corresponding menu section.</li>\n<li>Once you&#8217;ve filled everything in, click the Publish button. This menu item will now be created and added to the menu section you chose.</li>\n</ul>\n</li>\n<li>\n<p>To create a menu:</p>\n<ul>\n<li>Open the &#8216;Menus&#8217; tab in the plugin admin panel.</li>\n<li>Click on the &#8216;Add Menu&#8217; button</li>\n<li>Type in a title for your menu</li>\n<li>Now use the Menu Layout area to drag and drop the different menu sections you&#8217;ve created into your menu</li>\n<li>Use the Menu Footer area to specify any extra notes that you want to display in your menu</li>\n<li>Now you can place the included &#8216;Menu&#8217; Gutenberg block or the the [fdm-menu] shortcode in the content area of any page you&#8217;ve created and it will display your menu. (Please note that it&#8217;s usually best to display your menu on a page that uses a full-width page templage [i.e. no sidebar].)</li>\n</ul>\n</li>\n<li>\n<p>Customize your experience by making use of the available options, found in the Settings area of the plugin admin.</p>\n</li>\n</ol>\n<p>For a list of specific features, see the description page here: <a href=\"https://wordpress.org/plugins/food-and-drink-menu/\" rel=\"ugc\">https://wordpress.org/plugins/food-and-drink-menu/</a>.</p>\n<h4>For help and support, please see:</h4>\n<ul>\n<li>Our documentation and user guide, here: <a href=\"https://doc.fivestarplugins.com/plugins/food-and-drink-menu/user/\" rel=\"nofollow ugc\">https://doc.fivestarplugins.com/plugins/food-and-drink-menu/user/</a></li>\n<li>Our FAQ page, here: <a href=\"https://wordpress.org/plugins/food-and-drink-menu/faq/\" rel=\"ugc\">https://wordpress.org/plugins/food-and-drink-menu/faq/</a></li>\n<li>Our tutorial videos, here: <a href=\"https://www.youtube.com/playlist?list=PLEndQUuhlvSqy2KjpKfGpd-vAUJLfdYMI\" rel=\"nofollow ugc\">https://www.youtube.com/playlist?list=PLEndQUuhlvSqy2KjpKfGpd-vAUJLfdYMI</a></li>\n<li>The support forum, here: <a href=\"https://wordpress.org/support/plugin/food-and-drink-menu/\" rel=\"ugc\">https://wordpress.org/support/plugin/food-and-drink-menu/</a></li>\n<li>Our Support Center, here: <a href=\"https://www.fivestarplugins.com/support-center/\" rel=\"nofollow ugc\">https://www.fivestarplugins.com/support-center/</a></li>\n</ul>\n",
        "faq": "\n<dt id='how%20do%20i%20display%20my%20menu%3F'>\nHow do I display my menu?\n</h4>\n<p>\n<p>You can either make use of the included &#8216;Menu&#8217; Gutenberg block or the [fdm-menu id=&#8221;1&#8243;] shortcode (just replace the id with the actual id of the menu you want to display).</p>\n</p>\n<dt id='can%20i%20add%20more%20than%20one%20price%20for%20a%20menu%20item%20%28e.g.%20for%20variations%29%3F'>\nCan I add more than one price for a menu item (e.g. for variations)?\n</h4>\n<p>\n<p>You definitely can. Right underneath where you add the main price, you can click the &#8216;Add Price&#8217; button and input the new price for your variation.</p>\n</p>\n<dt id='how%20do%20i%20change%20the%20order%20of%20items%20on%20my%20menu%3F'>\nHow do I change the order of items on my menu?\n</h4>\n<p>\n<p>When editing a Menu Item, you’ll see a panel on the right-hand side which has an Order input field. Menu Items are listed in order of this value, from lowest to highest.</p>\n<p>If you want one Menu Item to be listed after another, make sure it’s Order value is higher.</p>\n</p>\n<dt id='how%20can%20i%20show%20that%20a%20collection%20of%20dishes%20come%20with%20a%20side%3F'>\nHow can I show that a collection of dishes come with a side?\n</h4>\n<p>\n<p>Each Menu Section can have a description. When available, it displays below the section title.</p>\n<p>To add a description to a section, go to the Menu Items &gt; Menu Sections page in your WordPress admin area. Click the Edit link below the section you’d like to change.</p>\n<p>On the Edit screen, you’ll see an area to type in a description. This is a great place to put in details such as:</p>\n<ul>\n<li>All entrees come with a side salad or fries.</li>\n<li>Add cheese to any burger for $1. Add bacon for $2.</li>\n<li>Add fries and a coke to any order during lunchtime for just $10.</li>\n</ul>\n</p>\n<dt id='can%20i%20have%20different%20sections%20with%20the%20same%20name%3F'>\nCan I have different sections with the same name?\n</h4>\n<p>\n<p>Yes. It’s common, for example, for a restaurant to have two locations. Each location’s menu has a Starters section, but they might not have exactly the same Starters in each location. They need different sections with the same name.</p>\n<p>You’ll soon learn that you can’t create two sections with the same name. To get around this, you’ll need to give section a unique name, like &#8220;Starters (Downtown)&#8221; and &#8220;Starters (Uptown)&#8221;.</p>\n<p>You can then override these names when adding the section to a menu. To do this, click the Edit icon in the Menu Layout panel. You can then enter your preferred name. This name only applies to this menu, so different Menus can each have sections with the same name.</p>\n</p>\n<dt id='can%20i%20customize%20the%20look%20and%20layout%20of%20my%20menu%3F'>\nCan I customize the look and layout of my menu?\n</h4>\n<p>\n<p>The plugin comes with a base style, which inherits the look of your theme, as well as a classic style. There are also two extra premium styles available.</p>\n<p>Since version 1.5 of this plugin, you can also make use of your theme’s <a href=\"https://doc.fivestarplugins.com/plugins/food-and-drink-menu/user/advanced/page-templates\" rel=\"nofollow ugc\">page templates</a>.</p>\n<p>If you want to make more bespoke customizations to the design and style of your menu, you may need to know CSS code and how to modify PHP templates. You can read some simple tutorials <a href=\"https://doc.fivestarplugins.com/plugins/food-and-drink-menu/user/advanced/complex-layouts\" rel=\"nofollow ugc\">here</a>.</p>\n</p>\n<dt id='how%20can%20i%20indicate%20that%20we%20add%20a%20gratuity%3F'>\nHow can I indicate that we add a gratuity?\n</h4>\n<p>\n<p>Each Menu has an additional editor for the Menu Footer. You’ll see this when editing a menu.</p>\n<p>The Menu Footer is a great place to add details such as:</p>\n<ul>\n<li>All parties of 6 or more will automatically be charged a gratuity of 10%.</li>\n<li>All dishes are cooked in a kitchen with nuts.</li>\n<li>All of our meat is free-range and sourced from local producers.</li>\n</ul>\n</p>\n<dt id='i%20need%20to%20mark%20some%20dishes%20as%20vegetarian%2C%20spicy%20or%20similar%3F'>\nI need to mark some dishes as vegetarian, spicy or similar?\n</h4>\n<p>\n<p>The premium version features a wide range of icons covering dietary needs, healthy choices and religious preferences.</p>\n</p>\n<dt id='is%20this%20compatible%20with%20wpml%3F'>\nIs this compatible with WPML?\n</h4>\n<p>\n<p>This plugin includes a wpml-config.xml file which provides compatibility with the WPML multi-language plugin. Additionally, the plugin uses a custom post type. As such, if you enable our post type in the WPML settings, you’ll be able to create translations of your menu items. As well, all the strings/labels are localized in the code, so they will be picked up by WPML’s String Translation tool for easy direct translating.</p>\n</p>\n<dt id='for%20help%20and%20support%2C%20please%20see%3A'>\nFor help and support, please see:\n</h4>\n<p>\n<ul>\n<li><a href=\"https://doc.fivestarplugins.com/plugins/food-and-drink-menu/user/\" rel=\"nofollow ugc\">Our documentation and user guide</a></li>\n<li><a href=\"https://wordpress.org/plugins/food-and-drink-menu/installation/\" rel=\"ugc\">Our installation guide</a></li>\n<li><a href=\"https://www.youtube.com/playlist?list=PLEndQUuhlvSqy2KjpKfGpd-vAUJLfdYMI\" rel=\"nofollow ugc\">Our tutorial videos</a></li>\n<li><a href=\"https://wordpress.org/support/plugin/food-and-drink-menu/\" rel=\"ugc\">The support forum</a></li>\n<li><a href=\"https://www.fivestarplugins.com/support-center/\" rel=\"nofollow ugc\">Our Support Center</a></li>\n</ul>\n</p>\n\n",
        "changelog": "<h4>2.4.18 (2024-07-16)</h4>\n<ul>\n<li>Tested with WordPress 6.6.</li>\n</ul>\n<p><a href=\"https://www.fivestarplugins.com/changelogs/food-and-drink-menu.txt\" rel=\"nofollow ugc\">See changelog for all versions</a>.</p>\n"
    },
    "short_description": "Restaurant menu and food ordering system that is easy to set up and integrates with any theme. Includes restaurant menu blocks and patterns.",
    "description": "<p>Create a stylish, responsive restaurant menu and add it to your site in minutes. With the easy-to-use builder and the included layout and customization options, you&#8217;ll have it set up in no time.</p>\n<p>This restaurant plugin can also be used to enable a food ordering system directly on your site, and you can manage the orders from our associated Five Star Restaurant Manager mobile app. This is available in the ultimate version, which you can read about in the <strong>Food Ordering</strong> section below.</p>\n<p><a href=\"https://www.fivestarplugins.com/food-ordering-demo/\" rel=\"nofollow ugc\">Food Ordering Demo</a></p>\n<p><a href=\"https://www.fivestarplugins.com/five-star-restaurant-menu-demo/\" rel=\"nofollow ugc\">Menu Demo</a></p>\n<h3>Key Features</h3>\n<ul>\n<li>Unlimited restaurant menus and menu items.</li>\n<li>Responsive layout, so your restaurant menu looks great on mobile and all devices.</li>\n<li>Add your restaurant menu to any page via the included <strong>Gutenberg blocks and shortcodes</strong>.</li>\n<li>Add a menu directly into any of your restaurant site&#8217;s block theme templates via the included <strong>patterns</strong>.</li>\n<li>Add unique photos and prices to each food or drink menu item .</li>\n<li>Optional sidebar to display your restaurant menu sections, for quick navigation.</li>\n<li>Full restaurant menu schema structured data automatically integrated, so Google can correctly identify your page as a menu and use it accordingly in search results.</li>\n<li>Create a QR code that you can use in restaurant to let your guests see your online menu.</li>\n</ul>\n<p><em><strong>Five Star Restaurant Menu</strong> is very user friendly and comes with a walk-through that runs automatically when you activate the plugin and will help you create your first menu items, add the menu to your site and set key options!</em></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/F30zoC0D55o?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Restaurant Menu QR Code</h3>\n<p>The plugin comes with the ability for you to generate a QR code that leads directly to your online menu. You can place these, for example, at the tables in your restaurant, so guests can scan them and gain easy and quick access to the restaurant menu page on your website.</p>\n<p>There are several great benefits to utilizing your online menu in your restaurant, including:</p>\n<ul>\n<li>Quick updates: You can instantaneously make changes to your restaurant menu. No matter how small or big the change you need to make is, you won&#8217;t need to reprint anything or explain it to every customer. </li>\n<li>Save money and trees by avoiding the need to print your restaurant menus.</li>\n<li>Creates a more contactless experience, no longer having menus shared between all customers.</li>\n</ul>\n<h3>Restaurant Menu Sections</h3>\n<p>The plugin comes with the ability to create separate restaurant menu sections. This allows you to divide a menu into multiple parts, making it more clear for your customers. You can even include a note for a section (e.g. &#8220;All items in this section come with salad or fries.&#8221;). Some examples of sections you can create are:</p>\n<ul>\n<li>Appetizers</li>\n<li>Main Course</li>\n<li>Dessert Menu</li>\n<li>Kid&#8217;s Menu</li>\n<li>Gluten Free Menu</li>\n<li>Weekly Specials</li>\n</ul>\n<p>You can then add a sidebar to your restaurant menu page, which lists all your sections, so your guests can quickly find what they&#8217;re looking for.</p>\n<p>In addition to this, you can also create completely separate and customizable restaurant menus. This feature can be used for several different purposes including individual menus for different meals, but also separate menus for drinks or snacks. It even works great if your restaurant is split up into different areas (e.g. a dining hall, a cafe, a bistro, etc.). Some examples of individual menus you can create are:</p>\n<ul>\n<li>Breakfast</li>\n<li>Brunch</li>\n<li>Lunch</li>\n<li>Dinner</li>\n<li>Wine</li>\n<li>Drinks</li>\n<li>Snacks</li>\n<li>Cafe Menu</li>\n<li>Specialties</li>\n<li>The possibilities are endless!</li>\n</ul>\n<h3>More Features!</h3>\n<p>Several additional features are included that will help ensure you&#8217;re able to set your restaurant menu up easily and with all the options you need. They will also enable you to deliver the best and easiest drink and food menu experience for the visitors to your restaurant&#8217;s website. These features include:</p>\n<ul>\n<li>Extra Gutenberg blocks to display individual sections or items on a page (instead of just a whole menu).</li>\n<li>Several extra patterns, so you can integrate restaurant menus, sections and individual items directly into your block theme.</li>\n<li>Ability to add multiple prices for a single item.</li>\n<li>Advanced template system for further layout customization of your restaurant menu(s). </li>\n<li>Simple compatibility with WPML for multi-language sites.</li>\n<li>Restaurants can add a footer to each drink or food menu for legal disclaimers or other notes.</li>\n<li>Display reviews for restaurant menu items (requires the premium version of the Five Star Restaurant Reviews plugin).</li>\n<li>Add a submit review form to restaurant menu items (requires the premium version of the Five Star Restaurant Reviews plugin).</li>\n<li>Widgets to display quick restaurant menu items in your sidebar or footer.</li>\n</ul>\n<h3>Premium Restaurant Menu</h3>\n<p>With the premium version of the plugin, you can extend the functionality of your restaurant menu to offer your guests the best possible experience. This includes multiple layout options, the ability to add custom fields to your menu items, sorting and filtering options, and much more.</p>\n<p>Premium features include:</p>\n<ul>\n<li>Additional responsive restaurant menu styles/layouts, including:</li>\n<li>The <strong>Refined</strong> style, which displays your restaurant menu in an elegant layout, without images, like you may find in an upscale restaurant.</li>\n<li>The <strong>Image</strong> style: Perfect for showcasing all the great photos you have of your restaurant menu items.</li>\n<li>The <strong>Ordering</strong> style: Designed and adapted for use specifically with the ordering features available in the ultimate version, this layout makes browsing, adding to cart and checking out a breeze.</li>\n<li>The <strong>Luxe</strong> style: A variation on the Refined style, this minimalist layout gives a luxury feel to your restaurant menu and fits in any theme.</li>\n<li>Custom fields to add any extra info you want to your restaurant menu items.</li>\n<li>Sorting, filtering and search options to let your customers find the exact meal or item they&#8217;re looking for.</li>\n<li>Icons to indicate dietary and ethical requirements, including organic, gluten-free, kosher, halal and many more.</li>\n<li>Badges for item features, specials and sales.</li>\n<li>Special/discount pricing.</li>\n<li>Google maps to show off local suppliers or ethical sourcing programs.</li>\n<li>Add a related items section to the single menu item page.</li>\n<li>Labelling options that let you change the wording for all the labels displayed on the front end of the plugin.</li>\n<li>Advanced styling options to change the fonts, colors, widths, borders, etc. of the different restaurant menu elements on your restaurant site. </li>\n</ul>\n<p>By combining the sorting/filtering/search options with the badges, dietary icons and specials, you can be sure that your guests will be able to locate the best possible menu items for them in no time at all.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/2NCgp67M_k4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Food Ordering (Requires Ultimate Version)</h3>\n<p>The ultimate version of the Five Star Restaurant Menu plugin lets you add a complete food ordering system to your restaurant website. Stop paying commissions to third-party services and start offering ordering directly on your site.</p>\n<p>Key features of the food ordering platform include:</p>\n<ul>\n<li>Add-to-cart buttons for all restaurant menu items.</li>\n<li>Intuitive cart that fits into any theme and lets customers easily add items directly from the your restaurant menu and check out. </li>\n<li>Options to have the responsive cart display at the bottom of the screen or on the side.</li>\n<li>Require payment immediately or give your customer the option to pay at the restaurant.</li>\n<li>Use Stripe payment intents (see below for details) or PayPal as your payment gateway.</li>\n<li>Create unlimited notifications, which can be sent via email and/or SMS to the restaurant admin and the customer when a new order is placed and/or whenever the status is changed for a food order.</li>\n<li>Easy-to-use admin interface lets you quickly manage your orders.</li>\n<li>Advanced order edit screen, via which you can update the customer information, the items in the order, the order status as well as the payment amount.</li>\n<li>Syncs directly with the Five Star Restaurant Manager mobile app (iOS and Android), so you can receive push notifications for new orders and manage your orders in the restaurant kitchen or on the go.</li>\n</ul>\n<p>Setting it up couldn&#8217;t be easier. When you enable the ordering feature, an &#8220;Add to Cart&#8221; button will appear on each restaurant menu item, which will let you add as many items as you want to the cart. There are also options to enable advanced ordering features, which let you have multiple prices per item as well as add-ons that guests can select when adding items to their cart.</p>\n<p>From the cart, you can then increase and decrease the quantity, remove items and view any special requests or add-ons. Checkout is a breeze with the included options. You can set it so that customers are required to pay right away at checkout or give them the option to pay when they pick the food up at your restaurant.</p>\n<p>Combine this with the available custom fields feature, which lets you add new inputs to the order form, and you can set up the checkout process however you like. For example, you could have an option for delivery and then require immediate payment either via Stripe or PayPal.</p>\n<p><strong>Stripe Payment Intents</strong></p>\n<p>The Stripe payment gateway now makes use of their <strong>payment intents</strong> system. With this you can enable many different types of payment methods, all directly from within your Stripe account. These include <strong>credit card, Apple Pay, Google Pay, direct debit, Afterpay and many other country- and region-specific methods</strong>.</p>\n<p>There is now also an option to <strong>take payments as holds and then charge/capture the payment at a later time</strong>. You could use this, for example, to only capture the payment once someone has arrived at the restaurant to pick up their food.</p>\n<p>Further customization features for the restaurant ordering system include:</p>\n<ul>\n<li>Add-ons for menu items, which can be selected when adding to cart (e.g. extra toppings).</li>\n<li>Restrict when ordering should be available by setting up a schedule. </li>\n<li>Set a minimum order total (e.g. in dollars, euros, etc., depending on your chosen currency).</li>\n<li>Option to temporarily pause ordering (e.g. you are at capacity in your restaurant or for orders).</li>\n<li>Alternatively, set a maximum number of orders that you can take.</li>\n<li>Fields for the customer to leave notes for both individual items and the overall order.</li>\n<li>Add custom fields to the order form (e.g. if you require extra info from your customers, want to offer delivery, etc.).</li>\n<li>Styling and labelling options to further customize the order form.</li>\n</ul>\n<p>Once an order is placed, you will receive a customizable notification that contains all of the order information. This is also created as an order in the plugin admin panel, where you can view all the details and also change the status and edit the order. Your customers can then view the order status right on your menu page via an intuitive order progress bar.</p>\n<p>There are further options to customize the ordering experience by setting specific hours when the ordering should be available as well as advanced features that let you add customization options to each menu item (e.g. &#8220;Add bacon&#8221;, &#8220;Upgrade to onion rings&#8221;, etc.). There is also an array of styling options to modify the colors of the ordering elements, including the buttons, the cart and the progress bar.</p>\n<h3>Five Star Restaurant Manager Mobile App</h3>\n<p>The ultimate version also syncs directly with our Five Star Restaurant Manager mobile app, for iOS and Android, which lets you manage your orders from your phone or tablet without needing to log in to your site/WordPress. With this, you can:</p>\n<ul>\n<li>Receive push notifications when new orders are submitted.</li>\n<li>View all orders directly in the app.</li>\n<li>Change the status of individual orders (e.g. to preparing or ready).</li>\n<li>Access the customer&#8217;s phone number or email address to quickly get in touch with them.</li>\n</ul>\n<p>With these features, you can set the app up on a tablet in the restaurant kitchen, to prepare orders as they come in, or for you to manage them anywhere on the go!</p>\n<p>For further information and purchasing options, please visit our <a href=\"https://www.fivestarplugins.com/plugins/five-star-restaurant-menu/\" rel=\"nofollow ugc\">WordPress restaurant menu</a> homepage.</p>\n<p><em>We are also pleased to offer a free 7-day trial of either the premium version or the ultimate version of the plugin, which you can use to test out features like the ordering system, additional layouts, custom fields and filtering options before buying!</em></p>\n<p>This plugin is one part of our suite designed to give you the best WordPress restaurant experience. Check out the powerful <a href=\"https://wordpress.org/plugins/restaurant-reservations/\" rel=\"ugc\">Restaurant Reservations</a> plugin and let your customers reserve a table directly on your site. With its intuitive and easy-to-use interface, you&#8217;ll be sure to not lose out on business to your competitors.</p>\n<h3>Help and support</h3>\n<ul>\n<li><a href=\"https://doc.fivestarplugins.com/plugins/food-and-drink-menu/user/\" rel=\"nofollow ugc\">Our documentation and user guide</a></li>\n<li><a href=\"https://wordpress.org/plugins/food-and-drink-menu/installation/\" rel=\"ugc\">Our installation guide</a></li>\n<li><a href=\"https://wordpress.org/plugins/food-and-drink-menu/faq/\" rel=\"ugc\">FAQs</a></li>\n<li><a href=\"https://www.youtube.com/playlist?list=PLEndQUuhlvSqy2KjpKfGpd-vAUJLfdYMI\" rel=\"nofollow ugc\">Our tutorial videos</a></li>\n<li><a href=\"https://wordpress.org/support/plugin/food-and-drink-menu/\" rel=\"ugc\">The support forum</a></li>\n<li><a href=\"https://www.fivestarplugins.com/support-center/\" rel=\"nofollow ugc\">Our Support Center</a></li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.18.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-1.png?rev=2228702",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-2.png?rev=2228702",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-3.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-4.png?rev=2228702",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-5.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-6.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-7.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-8.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-9.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-10.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-11.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-12.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-13.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-14.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-15.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-16.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-17.png?rev=2803559",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/food-and-drink-menu/assets/screenshot-18.png?rev=2803559",
            "caption": ""
        }
    ],
    "tags": {
        "mobile-restaurant-menu": "mobile restaurant menu",
        "online-restaurant": "online restaurant",
        "restaurant": "restaurant",
        "restaurant-menu": "restaurant menu",
        "restaurant-order": "restaurant order"
    },
    "stable_tag": "2.4.18",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.0.2.zip",
        "1.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.1.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.1.4.zip",
        "1.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.2.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.2.2.zip",
        "1.3": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.3.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.3.2.zip",
        "1.4": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.4.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.4.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.4.3.zip",
        "1.5": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.5.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.5.2.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.6.2.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.7.0.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.1.7.2.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.0.5.zip",
        "2.0.6": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.0.6.zip",
        "2.0.7": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.0.7.zip",
        "2.0.8": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.0.8.zip",
        "2.0.9": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.0.9.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.1.1.zip",
        "2.1.10": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.1.10.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.1.2.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.1.3.zip",
        "2.1.4": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.1.4.zip",
        "2.1.5": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.1.5.zip",
        "2.1.6": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.1.6.zip",
        "2.1.7": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.1.7.zip",
        "2.1.8": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.1.8.zip",
        "2.1.9": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.1.9.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.2.1.zip",
        "2.2.10": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.2.10.zip",
        "2.2.11": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.2.11.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.2.2.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.2.3.zip",
        "2.2.4": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.2.4.zip",
        "2.2.5": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.2.5.zip",
        "2.2.6": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.2.6.zip",
        "2.2.7": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.2.7.zip",
        "2.2.8": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.2.8.zip",
        "2.2.9": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.2.9.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.0.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.1.zip",
        "2.3.10": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.10.zip",
        "2.3.11": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.11.zip",
        "2.3.12": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.12.zip",
        "2.3.13": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.13.zip",
        "2.3.14": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.14.zip",
        "2.3.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.2.zip",
        "2.3.3": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.3.zip",
        "2.3.4": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.4.zip",
        "2.3.5": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.5.zip",
        "2.3.6": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.6.zip",
        "2.3.7": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.7.zip",
        "2.3.8": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.8.zip",
        "2.3.9": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.3.9.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.0.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.1.zip",
        "2.4.10": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.10.zip",
        "2.4.11": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.11.zip",
        "2.4.12": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.12.zip",
        "2.4.13": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.13.zip",
        "2.4.14": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.14.zip",
        "2.4.15": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.15.zip",
        "2.4.16": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.16.zip",
        "2.4.17": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.17.zip",
        "2.4.18": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.18.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.2.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.3.zip",
        "2.4.4": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.4.zip",
        "2.4.5": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.5.zip",
        "2.4.6": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.6.zip",
        "2.4.7": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.7.zip",
        "2.4.8": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.8.zip",
        "2.4.9": "https://downloads.wordpress.org/plugin/food-and-drink-menu.2.4.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/food-and-drink-menu.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.etoilewebdesign.com/plugin-donations/",
    "banners": {
        "low": "https://ps.w.org/food-and-drink-menu/assets/banner-772x250.png?rev=2247194",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/food-and-drink-menu/assets/icon-128x128.png?rev=2205559"
    },
    "blocks": {
        "food-and-drink-menu/menu-section": {
            "name": "food-and-drink-menu/menu-section",
            "title": "Menu Section"
        },
        "food-and-drink-menu/menu-item": {
            "name": "food-and-drink-menu/menu-item",
            "title": "Menu Item"
        },
        "food-and-drink-menu/menu": {
            "name": "food-and-drink-menu/menu",
            "title": "Menu"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 92,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "food-and-drink-menu",
            "language": "de_DE_formal",
            "version": "2.4.17",
            "updated": "2024-03-22 01:43:10",
            "package": "http://downloads.wordpress.org/translation/plugin/food-and-drink-menu/2.4.17/de_DE_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "food-and-drink-menu",
            "language": "de_DE",
            "version": "2.4.17",
            "updated": "2024-03-22 01:45:07",
            "package": "http://downloads.wordpress.org/translation/plugin/food-and-drink-menu/2.4.17/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "food-and-drink-menu",
            "language": "es_CR",
            "version": "2.4.17",
            "updated": "2022-02-08 20:28:20",
            "package": "http://downloads.wordpress.org/translation/plugin/food-and-drink-menu/2.4.17/es_CR.zip"
        },
        {
            "type": "plugin",
            "slug": "food-and-drink-menu",
            "language": "ru_RU",
            "version": "2.4.17",
            "updated": "2023-05-30 10:25:10",
            "package": "http://downloads.wordpress.org/translation/plugin/food-and-drink-menu/2.4.17/ru_RU.zip"
        }
    ]
}