{
    "name": "Interactive Contact Form and Multi Step Form Builder with Drag &amp; Drop Editor &#8211; Funnelforms Free",
    "slug": "funnelforms-free",
    "version": "3.7.4.1",
    "author": "<a href=\"https://funnelforms.io/\">Funnelforms</a>",
    "author_profile": "https://profiles.wordpress.org/funnelforms/",
    "contributors": {
        "funnelforms": {
            "profile": "https://profiles.wordpress.org/funnelforms/",
            "avatar": "https://secure.gravatar.com/avatar/03bb809c18813364a38299c53014e64c?s=96&d=monsterid&r=g",
            "display_name": "Funnelforms"
        }
    },
    "requires": "5.0",
    "tested": "6.6.1",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 26,
        "4": 1,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 27,
    "support_url": "https://wordpress.org/support/plugin/funnelforms-free/",
    "support_threads": 2,
    "support_threads_resolved": 2,
    "active_installs": 2000,
    "downloaded": 28170,
    "last_updated": "2024-08-26 8:08am GMT",
    "added": "2022-12-14",
    "homepage": "",
    "sections": {
        "description": "<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/810409109\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p>Contact form redefined: Funnelforms Multi Step Form helps you generate <strong>high-quality leads through targeted question sequences on your website</strong> for free &#8211; whether through pre-qualified contact requests, configuration of service or product packages, or direct appointment booking within the multi step form. With the help of the fully customizable design, this contact form can also be seamlessly adapted to the corporate identity of the website.</p>\n<p><strong>See for yourself and check out our <a href=\"https://en.funnelforms.io/live-demo/\" rel=\"nofollow ugc\">Live Demo</a>!</strong></p>\n<p>With Funnelforms Free, you can easily and intuitively create an interactive form for your lead generation efforts to attract more <strong>ready-to-buy customers, acquire the right staff and digitize your business processes</strong>. The plugin&#8217;s operation in the WordPress backend is effortless thanks to multiple drag &amp; drop builders, making it very suitable for use by WordPress beginners. Since the form plugin is divided into the 3 main areas of question creation, contact form creation and form creation, simple and intuitive drag &amp; drop builders are used here which also provide a live visual view of the form at the same time.</p>\n<p>The overall goal of Funnelforms is to make <strong>efficient lead generation via website accessible to everyone.</strong> In doing so, the setup must be simple and the operation intuitive, which is why the users of the contact form plugin also range from the craftsman around the corner to real estate agents, consultants and online agencies. Depending on the industry and the use case, this means that different functions and integrations of the multi step form are used to reach the respective target group in the best possible way &#8211; with this type of contact form, this is quite easy to realize.</p>\n<p>The Funnelforms Free contact form contains everything you need for your basic multi-step lead generation, the <a href=\"https://en.funnelforms.io/\" rel=\"nofollow ugc\">Funnelforms Pro</a> contact form and its many extensions offer even <strong>more analytics data, question types, functions and integrations</strong> that take your lead generation to a whole other level, especially in terms of business automations.</p>\n<h3>IMPROVED LEAD GENERATION THROUGH INTERACTIVE MULTI STEP FORMS</h3>\n<p>To leave your competitors behind and attract new customers, you need to take care of <strong>automated lead generation</strong> of your website and make contacting them more pleasant. Multi step forms are much better for this than ordinary forms. Funnelforms helps you to easily <strong>create visually appealing contact forms</strong> and simplify the process of submission for the visitor &#8211; without overwhelming them. This includes a clear question and a well-defined choice of answers within the form. In addition, functions already integrated in the multi step form are also crucial, such as an automatic completion of addresses via Google Maps API or that of the text fields within the contact form.</p>\n<p>Funnelforms is designed in each of its components to always <strong>achieve the optimal conversion rate on your website</strong> &#8211; even if you create a completely custom form. We believe that <strong>successful lead generation via website is the key to business success today</strong>. But we also believe that it should not require any programming or special knowledge for the user. That&#8217;s why our multi step form is packed with important features and details that <strong>make life easier for you and your website visitors</strong>.</p>\n<h3>DRAG &amp; DROP CONTACT FORM BUILDER TO SIMPLIFY YOUR WORKFLOW</h3>\n<p>Funnelforms is packed with features to help you get the most out of your multi step and contact forms, while making the submission process as enjoyable as possible for your website visitors. Here are some of the highlights:</p>\n<ul>\n<li><strong>Unlimited number of questions</strong> with 4 different question types for more targeted queries and more precise answers (Single Selection, Multiple Selection, Text Line and Text Area).</li>\n<li><strong>Unlimited contact forms</strong> to capture all important contact details such as name, email address and phone number and receive them via notification email.</li>\n<li>Up to <strong>5 simultaneously usable forms</strong> with up to 6 form steps incl. URL forwarding and categorization of questions, contact forms and forms &#8211; without visitor limits.</li>\n<li><strong>Conditional logic within the form editor</strong> to better guide your visitors based on their answers and ask relevant questions.</li>\n<li><strong>Fully customizable responsive form design</strong> that displays optimally on any device and extensive settings options.</li>\n<li>For support: <strong>First steps checklist incl. quick start video and help center</strong> for your easy start.</li>\n<li><strong>[Pro]</strong> Dashboard Overview to get all the important <strong>data and statistics about the performance of your contact forms.</strong></li>\n<li><strong>[Pro] 7 more question types over the Free version</strong> to create even more powerful forms, <strong>including date picker, HTML content, address query with Google Maps integration, slider, appointment booking, file upload and dropdown</strong>.</li>\n<li><strong>[Pro]</strong> Unlimited <strong>appointment booking including calendar integration and synchronization</strong> to iCloud, Google Calendar, Outlook, Exchange and Office 365.</li>\n<li><strong>[Pro]</strong> More than <strong>5000 integrations</strong>, e.g. to CRM, sales, email marketing and support systems, to achieve maximum post-submission automation.</li>\n<li><strong>[Pro] 15 industry-specific demo templates</strong> for example for craftsmen, financial service providers, agencies or real estate agents to import and customize.</li>\n<li><strong>[Pro]</strong> Unlimited number of questions, contact forms, form steps and logical branching and integrations.</li>\n<li><strong>[Pro] Automatic email response</strong> (autoresponder) and <strong>form tracking for form views and submissions</strong>.</li>\n<li><strong>[Pro] Import and export function</strong> for all questions, contact forms, forms, appointment events and settings as well as <strong>CSV export</strong> of all or individual leads.</li>\n<li><strong>[Pro] App for iOS and Android</strong> to keep track of all stats, leads and lead details for your contact forms on the go. Get informed in real time via push notifications.</li>\n<li><strong>[Pro] Premium Support</strong> around the clock via live chat and ticket system for all <a href=\"https://en.funnelforms.io/\" rel=\"nofollow ugc\">Funnelforms Pro</a> users.</li>\n</ul>\n<h3>THE MAGIC OF THE DRAG &amp; DROP FORM BUILDER</h3>\n<p>The intuitive drag-and-drop form builder within the question, contact form, and form builder is the heart of your multi step form and is itself visually designed as a sequence or &#8220;funnel&#8221;. Additionally, the questions, contact forms, and appointment events available here can be <strong>categorized and assigned to specific forms</strong>. This way you never lose track of your queries and their structure.</p>\n<p>In the form builder, you link all your questions, contact forms, appointment events and redirects <strong>by drag and drop</strong> one after the other, so that a flow is created for your visitors and <strong>thanks to the integrated logic, all important questions are asked at the right time</strong>. In this way, based on his previous answer, the website visitor will only be asked questions that make sense to his answer in the following and thus lead him to the completion &#8211; this <strong>sales-psychological element of mutual dialogue extremely helps to increase your success in lead generation by a significant amount</strong>. The visual representation of the multi step form in the form builder itself makes the creation of the funnel much easier and the user only has to click through.</p>\n<p><strong>Check out the Quick Start Guide below to learn how to create your first multi step contact form:</strong></p>\n<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/782961075\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<h3>DATA PROTECTION FROM THE GROUND UP AS STANDARD</h3>\n<p>Funnelforms&#8217; contact form is <strong>GDPR compliant</strong> according to current, Europe-wide data protection law &#8211; which is mainly due to its technical structure and because it is installed locally on the WordPress system.</p>\n<p>A major difference to comparable form builders available on the market is that Funnelforms, as <strong>an external plugin, does not process or store any data on its own or third-party servers.</strong> All leads and personal customer or appointment data is exclusively available to you. All personal data is stored on your web server, in your WordPress database and in the form of leads on your WordPress website and does not leave this closed system.</p>\n<p>In the Pro version of the multi step form, connections to iCloud, Google Calendar, Outlook, Exchange and Office 365 can be established via the appointment booking to offer synchronization and automatic entry into the respective calendars. Through the many integrations that can be connected after submitting the contact form, <strong>only data selected by you will be sent to these respective third-party tools</strong>. Each of these providers of calendars and integrations offers its own data protection standard.</p>\n<h3>ACHIEVE YOUR BUSINESS GOALS ACROSS INDUSTRIES</h3>\n<p>There is hardly any contact form plugin that can be <strong>used across so many industries and still achieve such accurate results</strong>. Funnelforms covers all major sources of lead generation in many different industries.</p>\n<p>Clients range from <strong>web agencies, lawyers and accountants, car dealerships, coaches, service providers, financial companies, healthcare and nursing facilities, real estate agents, logistics companies and shipping companies, staffing agencies, travel providers and insurance companies</strong>. All these companies use the multi step form in different ways and for different purposes. Nevertheless, due to its unique design and psychologically meaningful structure, the form builder manages to achieve very good results in each area.</p>\n<p>Personnel recruiters, for example, use the file upload to receive the applicant&#8217;s resume along with other data while filling out the form &#8211; service providers ask for the desired services in a structured manner and thus know exactly what the potential customer expects from them &#8211; coaches have their potential customers book appointments directly for a free preliminary meeting. You see, there are <strong>many good reasons to offer your website visitors a multi step form</strong>, even if you don&#8217;t believe it yet. You have a <strong>much better data base for collaboration and can automate many digital processes and your users stay engaged</strong>.</p>\n<p>Take a look at the <a href=\"https://en.funnelforms.io/examples\" rel=\"nofollow ugc\">Examples</a> page to see for yourself that Funnelforms contact form can be used in almost any industry where contacts of any kind need to be generated (lead generation, recruitment, pricing, appointment setting, service and product configuration).</p>\n<h3>PREMIUM SUPPORT FOR USERS OF THE PRO VERSION</h3>\n<p>Funnelforms team will offer you any support you need. As a user of the Free version, you have the possibility to <strong>report errors via ticket</strong>, which will of course be fixed for you as soon as possible. Furthermore you have unlimited <strong>access to the Help Center</strong>. The Help Center offers many helpful articles and instructions on how to create a multi step form, contact form and tips on form builder in general. If you still have questions or can&#8217;t find an answer to your question in the Help Center, you can use the <a href=\"https://en.funnelforms.io/\" rel=\"nofollow ugc\">live chat on our website</a> for all other questions and help.</p>\n<p>But hopefully you&#8217;ll understand that we have to prioritize all Pro version customers. The individual email and ticket support is available to users who have purchased a <a href=\"https://en.funnelforms.io/\" rel=\"nofollow ugc\">Funnelforms Pro</a> license. Here, in addition to classic support topics, individual adaptations of the contact form can be implemented or help with the optimal setup can be given. Furthermore, in addition to the unlimited functions mentioned above, you will benefit from other helpful tools for your lead generation via multi step form:</p>\n<ul>\n<li><strong>Lead Training Video Tutorial</strong> of approx. 50 min. for the optimal use of Funnelforms on your website and best practices in using the form builder.</li>\n<li><strong>25,000 premium icons</strong> for download and free use in your multi step form and on your website.</li>\n<li><strong>Free personal 1:1 onboarding</strong> of 45 min for contact form setup, general questions and helpful tips for custom lead generation through your website.</li>\n<li><strong>Smartphone app for iOS &amp; Android</strong> to see all your leads&#8217; contact information on the go and get statistics from your contact forms.</li>\n<li><strong>Comprehensive and customized premium support</strong> that even implements your personal requests.</li>\n</ul>\n<p>So if you&#8217;re really serious about lead generation through your website and want to get the most out of it at all levels, we recommend the contact form plugin <a href=\"https://en.funnelforms.io/\" rel=\"nofollow ugc\">Funnelforms Pro</a>! <strong>Costs a little, but gets you even better lead generation results</strong>!</p>\n<h3>FUNNELFORMS IS TOP-RATED WITH MANY 5 STARS ON TRUSTPILOT</h3>\n<p>We are proud that the Funnelforms contact form has already convinced so many customers and brought them further. The plugin has more than 150 reviews on Trustpilot with an average of 4.9 stars. You can see <a href=\"https://de.trustpilot.com/review/funnelforms.io\" rel=\"nofollow ugc\">all reviews</a> here. However, we would like to present you some insightful reviews from satisfied customers here now as well:</p>\n<p><strong>5 stars from Simon Krebs:</strong></p>\n<p><strong>This tool is soo powerful!</strong><br />\nI started with the first license 3 months ago and successfully upgraded to the 10 agency license today. The service is simply unbeatable and the pricing for such a powerful tool is a must-have.<br />\nThis tool improves the conversion rate so much that it is almost criminal.</p>\n<p>There is simply no wish left unfulfilled. Every problem is fixed, the staff is just there.</p>\n<p>The software is incredibly accurate and well thought out.</p>\n<p>I am so happy to have found this tool</p>\n<p><strong>5 stars from Andi:</strong></p>\n<p><strong>How the hell is this possible!!!</strong><br />\nI usually never write reviews on the internet and am more the silent customer. Here I am downright forced by my results to say something, better yet I have no choice at all!</p>\n<p>Funnelforms purchased a few days ago, installed and license activated in less than 5 minutes. The tool? Can&#8217;t be beat for simplicity, intuitive and logical to use, all elements and buttons make sense where they are. Did it take me long to create my form? No.</p>\n<p>Form was up and running within 2 hours on the same day. But 2 hours not because I was overwhelmed and didn&#8217;t find the functions right away, but because I took my time to create an absolutely awesome logic. So Funnelforms then went live on our website. We usually have between 3 and 5 requests per week. After going live of Funnelforms, say and write received 28 leads in the first week alone. I didn&#8217;t think this was possible &#8211; and now shut up: no junk! Flawless quality of leads, good accessibility, genuine interest. Of these leads, 6 have already been converted into customers and sales.</p>\n<p>Again to let it sink in:</p>\n<p>-Without changing the website<br />\n-Without increasing visitors or traffic to the website<br />\n-Without increasing the adspend<br />\n-Without creating new advertising campaigns</p>\n<p>The only thing we did was replace our previous contact form with Funnelforms. I don&#8217;t know how you do it, but I am deeply convinced and can advise every company: Buy this software!!!</p>\n<p><strong>5 stars from Florian I.:</strong></p>\n<p><strong>Perfect for all kind of forms with Funnel</strong><br />\nVery very good form plugin, but actually it is much much more than that. We have been using the paid version for a while, but even now in the free version there are so many features unlocked that are really really great. Especially creating simple funnel forms is very fast and you don&#8217;t need hours of training. It is almost self-explanatory.<br />\nTop work and we are looking forward to updates.</p>\n<h3>READ MORE ABOUT THE FORM BUILDER</h3>\n<p>Need more information about multi step form builder, contact form creation and lead generation with Funnelforms? You can find us here:</p>\n<ul>\n<li>The official website of <a href=\"https://en.funnelforms.io/\" rel=\"nofollow ugc\">Funnelforms Plugin</a>.</li>\n<li>The <a href=\"https://help.funnelforms.io/en\" rel=\"nofollow ugc\">Funnelforms Help Center</a>.</li>\n<li>Also join our <a href=\"https://www.facebook.com/groups/639159471081043\" rel=\"nofollow ugc\">Funnelforms Facebook Group</a> to exchange ideas with other users and follow us on <a href=\"https://www.instagram.com/funnelforms/\" rel=\"nofollow ugc\">Instagram</a> and <a href=\"https://www.facebook.com/funnelforms\" rel=\"nofollow ugc\">Facebook</a>.</li>\n</ul>\n",
        "installation": "<p>You can install Funnelforms in two different ways explained below. After the installation you can visit the first steps menu to set up your first form.</p>\n<h3>INSTALL FUNNELFORMS DIRECTLY FROM WORDPRESS</h3>\n<ol>\n<li>Go to the plugins page in your wordpress dashboard and select ‘Add New’;</li>\n<li>Search for ‘Funnelforms’;</li>\n<li>Activate Funnelforms from your Plugins page;</li>\n<li>Visit the First steps menu in the Funnelforms plugin to set up your first form</li>\n</ol>\n<h3>INSTALL FUNNELFORMS MANUALLY</h3>\n<ol>\n<li>Upload the ‘funnelforms-free’ folder to the /wp-content/plugins/ directory;</li>\n<li>Activate the Funnelforms plugin through the ‘Plugins’ menu in WordPress;</li>\n<li>Visit the First steps menu in the Funnelforms plugin to set up your first form</li>\n</ol>\n",
        "faq": "\n<dt id='what%20is%20funnelforms%3F'>\nWhat is Funnelforms?\n</h4>\n<p>\n<p>Funnelforms is a multi step form and contact form builder plugin for WordPress that allows you to create high-quality, sales-optimized drag and drop custom forms for your website. In addition to many integrations, automations, designs and templates, many small conversion-increasing elements are built right in. With the help of simple drag and drop form builders, you can easily create a high-converting contact form or quiz for your website visitors. Thanks to the modern, intuitive design and the logical sequence of the multi step form, your visitors interact more with you. It creates a dialogue in which the users contact you in a natural way through your website. The sales psychology conversation technique of mutual dialogue provides you with significantly better results than conventional contact forms.</p>\n</p>\n<dt id='how%20can%20i%20benefit%20from%20funnelforms%3F'>\nHow can I benefit from Funnelforms?\n</h4>\n<p>\n<p>Funnelforms has one overall goal: increase inquiries and leads through your website. Used properly, you&#8217;ll definitely generate more pre-qualified customers and prospects with this contact form plugin. The design increases user interaction on your website and the likelihood of visitors filling it out is significantly higher than with a standard contact form such as Contact Form 7. Additionally, you benefit from many possible uses: Be it to receive more contact inquiries overall via your website, to pre-qualify suitable applicants in your recruiting process, to have products or services configured individually or to arrange appointments with interested parties. Furthermore, all data generated in these areas of application can be transferred to your tools, such as CRM or e-mail software, via integrations or webhooks and thus automated.</p>\n</p>\n<dt id='how%20can%20i%20create%20questions%3F'>\nHow can I create questions?\n</h4>\n<p>\n<p>New questions can be easily created in the question editor. You just need to select your question type and then configure the question with its answers. Later on, you have the possibility to copy and edit already created questions and to create a conditional logic with the created questions in the form builder, i.e. a chain of questions and possible answers that build on each other (if A -&gt; then B). The same applies to created contact forms, which are also created simply by drag &amp; drop form builder.</p>\n</p>\n<dt id='what%20are%20the%20integrations%20to%20other%20tools%3F'>\nWhat are the integrations to other tools?\n</h4>\n<p>\n<p>Funnelforms offers you a wide range of integrations for data transfer to other tools. Some integrations are natively built into the contact form plugin, others can be found through major interface providers. The integrations include CRM management systems, email marketing programs, SMS verification and a custom webhook &#8211; here&#8217;s a brief overview:</p>\n<p><strong>CRM</strong><br />\n* Hubspot<br />\n* Pipedrive<br />\n* Deals &amp; Projects<br />\n* FinCRM</p>\n<p><strong>Email Marketing</strong><br />\n* ActiveCampaign<br />\n* GetResponse<br />\n* Mailchimp<br />\n* KickTipp</p>\n<p><strong>SMS Verification</strong><br />\n* MessageBird</p>\n<p><strong>Automations</strong><br />\n* Zapier<br />\n* Make</p>\n<p>You can find an overview of all integrations on the <a href=\"https://en.funnelforms.io/integrations\" rel=\"nofollow ugc\">Integrations</a> page, we are also constantly developing the plugin so new integrations and automations are added all the time.</p>\n</p>\n<dt id='is%20it%20difficult%20to%20set%20up%20the%20multi%20step%20form%3F'>\nIs it difficult to set up the multi step form?\n</h4>\n<p>\n<p>No, this custom form builder is very simple and easy to install. It can be found directly in the WordPress plugin repository and can be installed from there or downloaded and installed manually. For each step of the setup process you will find a checklist within the contact form plugin and additionally useful instructions and tutorials in the <a href=\"https://help.funnelforms.io/en\" rel=\"nofollow ugc\">Help Center</a>. If you still get stuck, our support team will be happy to help you via email or live chat.</p>\n</p>\n<dt id='what%20is%20the%20difference%20to%20other%20contact%20form%20plugins%3F'>\nWhat is the difference to other contact form plugins?\n</h4>\n<p>\n<p>The main difference to comparable form plugins available on the market is that Funnelforms was explicitly designed to increase the conversion rate on your website. No other plugin is so focused on keeping the submission rate high, be it Contact Form 7, WPForms, Ninja Forms, Formidable Forms, Forminator or Ninja Forms. At the same time, it adds value to the user as they can click through many questions in the easiest way and manual entries are unnecessary. This saves time and facilitates the input. Through clearly defined and comprehensible logic for the user, a natural conversation structure can be recreated and the conversion rate of your contact form increases noticeably.</p>\n</p>\n<dt id='is%20there%20a%20startup%20discount%3F'>\nIs there a startup discount?\n</h4>\n<p>\n<p>Of course! We are passionate about helping startups grow with our contact form! Have you started your business within the last 12 months? Contact our sales team directly via our website and get a permanent 20% discount on any license &#8211; before that, of course, the 30-day trial period still applies.</p>\n</p>\n<dt id='is%20funnelforms%20gdpr%20compliant%3F'>\nIs Funnelforms GDPR compliant?\n</h4>\n<p>\n<p>Funnelforms is GDPR-compliant according to current, europe-wide data protection laws. A significant difference to comparable tools available on the market is that at no point is data processed or stored on our or third-party servers. All leads and personal customer data reside entirely on your website and your web server and do not leave this closed system. With the Pro version of the multi step form, connections to calendar providers such as iCloud, Google Calendar, Outlook, Office 365 and Exchange can be established when using the appointment booking feature to enable synchronization and integration with the respective calendars. Through the many integrations that can be connected to the contact form after submission, only the data you select will be sent to these respective third-party tools. However, each of these providers of calendars and integrations in turn offers its own data protection standard.</p>\n</p>\n<dt id='can%20i%20customize%20the%20contact%20form%20to%20match%20the%20design%20of%20my%20website%3F'>\nCan I customize the contact form to match the design of my website?\n</h4>\n<p>\n<p>Yes, all steps of the multi step form as well as the contact form are 100% customizable to your corporate identity and website design. All colors, font sizes and fonts are freely configurable. Additionally, you can upload your own fonts via third-party plugins and use them for the form. You can also choose from different layouts for the appearance.</p>\n</p>\n<dt id='is%20the%20multi%20step%20form%20also%20suitable%20for%20smartphones%20and%20tablets%3F'>\nIs the multi step form also suitable for smartphones and tablets?\n</h4>\n<p>\n<p>Yes, Funnelforms looks great on any device and is optimized for all device sizes. You also have the option to choose from different designs for the contact form layout. Options here are the classic tile view or the one-column or two-column list view, these can be selected separately for the desktop and mobile views.</p>\n</p>\n<dt id='what%20is%20the%20reseller%20license%3F'>\nWhat is the reseller license?\n</h4>\n<p>\n<p>Funnelforms&#8217; contact form is interesting for almost every industry and can especially help agency owners to increase the lead generation performance on their customer websites. Many agencies also use this opportunity for optimization work for their customers. With the reseller license you secure a license for 10 domains. You can resell these licenses to your clients at your own price and generate additional profits.</p>\n</p>\n<dt id='for%20me%20a%20feature%20or%20integration%20is%20missing%2C%20what%20now%3F'>\nFor me a feature or integration is missing, what now?\n</h4>\n<p>\n<p>Don&#8217;t worry, we always try to meet our customers&#8217; wishes and to develop the multi step form in the interest of our customers. You can easily <a href=\"https://feedback.funnelforms.io/b/funnelforms-english/\" rel=\"nofollow ugc\">suggest your feature</a> via an internal feedback portal and let other customers rate and upvote it. After enough votes and a review we plan to include this feature within the next updates.</p>\n</p>\n\n",
        "changelog": "<h4>3.7.4.1 &#8211; 25. August 2024</h4>\n<ul>\n<li>Scroll To Anchor (Desktop) Feature</li>\n<li>Bugfixes</li>\n<li>UX improvements</li>\n<li>Fixes small security issue</li>\n</ul>\n<h4>3.7.3.2 &#8211; 25. May 2024</h4>\n<ul>\n<li>Major Bugfixes</li>\n</ul>\n<h4>3.7.3.1 &#8211; 22. May 2024</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.7.3 &#8211; 15. May 2024</h4>\n<ul>\n<li>Bugfixes</li>\n<li>UX improvements</li>\n</ul>\n<h4>3.7.2 &#8211; 08. March 2024</h4>\n<ul>\n<li>Bugfixes</li>\n<li>UX improvements</li>\n</ul>\n<h4>3.7.1.1 &#8211; 19. February 2024</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.7 &#8211; 14. February 2024</h4>\n<ul>\n<li>Added custom fonts functionality</li>\n<li>Added more form styling configurations</li>\n<li>UX improvements</li>\n<li>Bugfixes</li>\n</ul>\n<h4>3.6.2.3 &#8211; 01. February 2024</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.6.2.2 &#8211; 29. January 2024</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.6.1 &#8211; 21. December 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.6 &#8211; 20. December 2023</h4>\n<ul>\n<li>Caching system extensively reworked</li>\n<li>Loading time fundamentally optimized</li>\n</ul>\n<h4>3.5.3.1 &#8211; 23. November 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.4.2.1 &#8211; 05. November 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.4.2 &#8211; 29. October 2023</h4>\n<ul>\n<li>Bugfixes</li>\n<li>Fixed security issues</li>\n</ul>\n<h4>3.4 &#8211; 18. September 2023</h4>\n<ul>\n<li>Bugfixes</li>\n<li>Fixed security issues</li>\n</ul>\n<h4>3.3.9 &#8211; 08. August 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.3.8.6 &#8211; 02. August 2023</h4>\n<ul>\n<li>Added B2B e-mail validation</li>\n<li>UX improvements</li>\n<li>Bugfixes</li>\n</ul>\n<h4>3.3.8.5 &#8211; 06. July 2023</h4>\n<ul>\n<li>Updated Freemius SDK to the latest version</li>\n</ul>\n<h4>3.3.8.4 &#8211; 20. June 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.3.8.3 &#8211; 12. June 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.3.8 &#8211; 04. May 2023</h4>\n<ul>\n<li>Healthcheck feature</li>\n<li>Bugfixes</li>\n</ul>\n<h4>3.3.7.2 &#8211; 03. May 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.3.7.1 &#8211; 19. April 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.3.7 &#8211; 14. April 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.3.6 &#8211; 01. April 2023</h4>\n<ul>\n<li>Site navigation integrated for lead overview</li>\n<li>Graphics and icons for selection questions can now be deactivated</li>\n<li>Progress bar can be hidden</li>\n<li>Double confirmation when deleting an answer linked in the form</li>\n<li>Function to scroll to the beginning of the next question on mobile has been improved</li>\n<li>Minor bug fixes for front- &amp; backend</li>\n</ul>\n<h4>3.3.5 &#8211; 08. March 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.3.4 &#8211; 27. February 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.3.3.3 &#8211; 28. January 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.3.3 &#8211; 28. January 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.2.10 &#8211; 13. January 2023</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.2.9 &#8211; 20. December 2022</h4>\n<ul>\n<li>Bugfixes</li>\n</ul>\n<h4>3.2.7 &#8211; 14. December 2022</h4>\n<ul>\n<li>Initial Public Release</li>\n</ul>\n"
    },
    "short_description": "The easiest plugin for interactive contact forms. Create a custom contact form, multi step form or quiz in just minutes via drag &amp; drop form builder.",
    "description": "<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/810409109\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p>Contact form redefined: Funnelforms Multi Step Form helps you generate <strong>high-quality leads through targeted question sequences on your website</strong> for free &#8211; whether through pre-qualified contact requests, configuration of service or product packages, or direct appointment booking within the multi step form. With the help of the fully customizable design, this contact form can also be seamlessly adapted to the corporate identity of the website.</p>\n<p><strong>See for yourself and check out our <a href=\"https://en.funnelforms.io/live-demo/\" rel=\"nofollow ugc\">Live Demo</a>!</strong></p>\n<p>With Funnelforms Free, you can easily and intuitively create an interactive form for your lead generation efforts to attract more <strong>ready-to-buy customers, acquire the right staff and digitize your business processes</strong>. The plugin&#8217;s operation in the WordPress backend is effortless thanks to multiple drag &amp; drop builders, making it very suitable for use by WordPress beginners. Since the form plugin is divided into the 3 main areas of question creation, contact form creation and form creation, simple and intuitive drag &amp; drop builders are used here which also provide a live visual view of the form at the same time.</p>\n<p>The overall goal of Funnelforms is to make <strong>efficient lead generation via website accessible to everyone.</strong> In doing so, the setup must be simple and the operation intuitive, which is why the users of the contact form plugin also range from the craftsman around the corner to real estate agents, consultants and online agencies. Depending on the industry and the use case, this means that different functions and integrations of the multi step form are used to reach the respective target group in the best possible way &#8211; with this type of contact form, this is quite easy to realize.</p>\n<p>The Funnelforms Free contact form contains everything you need for your basic multi-step lead generation, the <a href=\"https://en.funnelforms.io/\" rel=\"nofollow ugc\">Funnelforms Pro</a> contact form and its many extensions offer even <strong>more analytics data, question types, functions and integrations</strong> that take your lead generation to a whole other level, especially in terms of business automations.</p>\n<h3>IMPROVED LEAD GENERATION THROUGH INTERACTIVE MULTI STEP FORMS</h3>\n<p>To leave your competitors behind and attract new customers, you need to take care of <strong>automated lead generation</strong> of your website and make contacting them more pleasant. Multi step forms are much better for this than ordinary forms. Funnelforms helps you to easily <strong>create visually appealing contact forms</strong> and simplify the process of submission for the visitor &#8211; without overwhelming them. This includes a clear question and a well-defined choice of answers within the form. In addition, functions already integrated in the multi step form are also crucial, such as an automatic completion of addresses via Google Maps API or that of the text fields within the contact form.</p>\n<p>Funnelforms is designed in each of its components to always <strong>achieve the optimal conversion rate on your website</strong> &#8211; even if you create a completely custom form. We believe that <strong>successful lead generation via website is the key to business success today</strong>. But we also believe that it should not require any programming or special knowledge for the user. That&#8217;s why our multi step form is packed with important features and details that <strong>make life easier for you and your website visitors</strong>.</p>\n<h3>DRAG &amp; DROP CONTACT FORM BUILDER TO SIMPLIFY YOUR WORKFLOW</h3>\n<p>Funnelforms is packed with features to help you get the most out of your multi step and contact forms, while making the submission process as enjoyable as possible for your website visitors. Here are some of the highlights:</p>\n<ul>\n<li><strong>Unlimited number of questions</strong> with 4 different question types for more targeted queries and more precise answers (Single Selection, Multiple Selection, Text Line and Text Area).</li>\n<li><strong>Unlimited contact forms</strong> to capture all important contact details such as name, email address and phone number and receive them via notification email.</li>\n<li>Up to <strong>5 simultaneously usable forms</strong> with up to 6 form steps incl. URL forwarding and categorization of questions, contact forms and forms &#8211; without visitor limits.</li>\n<li><strong>Conditional logic within the form editor</strong> to better guide your visitors based on their answers and ask relevant questions.</li>\n<li><strong>Fully customizable responsive form design</strong> that displays optimally on any device and extensive settings options.</li>\n<li>For support: <strong>First steps checklist incl. quick start video and help center</strong> for your easy start.</li>\n<li><strong>[Pro]</strong> Dashboard Overview to get all the important <strong>data and statistics about the performance of your contact forms.</strong></li>\n<li><strong>[Pro] 7 more question types over the Free version</strong> to create even more powerful forms, <strong>including date picker, HTML content, address query with Google Maps integration, slider, appointment booking, file upload and dropdown</strong>.</li>\n<li><strong>[Pro]</strong> Unlimited <strong>appointment booking including calendar integration and synchronization</strong> to iCloud, Google Calendar, Outlook, Exchange and Office 365.</li>\n<li><strong>[Pro]</strong> More than <strong>5000 integrations</strong>, e.g. to CRM, sales, email marketing and support systems, to achieve maximum post-submission automation.</li>\n<li><strong>[Pro] 15 industry-specific demo templates</strong> for example for craftsmen, financial service providers, agencies or real estate agents to import and customize.</li>\n<li><strong>[Pro]</strong> Unlimited number of questions, contact forms, form steps and logical branching and integrations.</li>\n<li><strong>[Pro] Automatic email response</strong> (autoresponder) and <strong>form tracking for form views and submissions</strong>.</li>\n<li><strong>[Pro] Import and export function</strong> for all questions, contact forms, forms, appointment events and settings as well as <strong>CSV export</strong> of all or individual leads.</li>\n<li><strong>[Pro] App for iOS and Android</strong> to keep track of all stats, leads and lead details for your contact forms on the go. Get informed in real time via push notifications.</li>\n<li><strong>[Pro] Premium Support</strong> around the clock via live chat and ticket system for all <a href=\"https://en.funnelforms.io/\" rel=\"nofollow ugc\">Funnelforms Pro</a> users.</li>\n</ul>\n<h3>THE MAGIC OF THE DRAG &amp; DROP FORM BUILDER</h3>\n<p>The intuitive drag-and-drop form builder within the question, contact form, and form builder is the heart of your multi step form and is itself visually designed as a sequence or &#8220;funnel&#8221;. Additionally, the questions, contact forms, and appointment events available here can be <strong>categorized and assigned to specific forms</strong>. This way you never lose track of your queries and their structure.</p>\n<p>In the form builder, you link all your questions, contact forms, appointment events and redirects <strong>by drag and drop</strong> one after the other, so that a flow is created for your visitors and <strong>thanks to the integrated logic, all important questions are asked at the right time</strong>. In this way, based on his previous answer, the website visitor will only be asked questions that make sense to his answer in the following and thus lead him to the completion &#8211; this <strong>sales-psychological element of mutual dialogue extremely helps to increase your success in lead generation by a significant amount</strong>. The visual representation of the multi step form in the form builder itself makes the creation of the funnel much easier and the user only has to click through.</p>\n<p><strong>Check out the Quick Start Guide below to learn how to create your first multi step contact form:</strong></p>\n<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/782961075\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<h3>DATA PROTECTION FROM THE GROUND UP AS STANDARD</h3>\n<p>Funnelforms&#8217; contact form is <strong>GDPR compliant</strong> according to current, Europe-wide data protection law &#8211; which is mainly due to its technical structure and because it is installed locally on the WordPress system.</p>\n<p>A major difference to comparable form builders available on the market is that Funnelforms, as <strong>an external plugin, does not process or store any data on its own or third-party servers.</strong> All leads and personal customer or appointment data is exclusively available to you. All personal data is stored on your web server, in your WordPress database and in the form of leads on your WordPress website and does not leave this closed system.</p>\n<p>In the Pro version of the multi step form, connections to iCloud, Google Calendar, Outlook, Exchange and Office 365 can be established via the appointment booking to offer synchronization and automatic entry into the respective calendars. Through the many integrations that can be connected after submitting the contact form, <strong>only data selected by you will be sent to these respective third-party tools</strong>. Each of these providers of calendars and integrations offers its own data protection standard.</p>\n<h3>ACHIEVE YOUR BUSINESS GOALS ACROSS INDUSTRIES</h3>\n<p>There is hardly any contact form plugin that can be <strong>used across so many industries and still achieve such accurate results</strong>. Funnelforms covers all major sources of lead generation in many different industries.</p>\n<p>Clients range from <strong>web agencies, lawyers and accountants, car dealerships, coaches, service providers, financial companies, healthcare and nursing facilities, real estate agents, logistics companies and shipping companies, staffing agencies, travel providers and insurance companies</strong>. All these companies use the multi step form in different ways and for different purposes. Nevertheless, due to its unique design and psychologically meaningful structure, the form builder manages to achieve very good results in each area.</p>\n<p>Personnel recruiters, for example, use the file upload to receive the applicant&#8217;s resume along with other data while filling out the form &#8211; service providers ask for the desired services in a structured manner and thus know exactly what the potential customer expects from them &#8211; coaches have their potential customers book appointments directly for a free preliminary meeting. You see, there are <strong>many good reasons to offer your website visitors a multi step form</strong>, even if you don&#8217;t believe it yet. You have a <strong>much better data base for collaboration and can automate many digital processes and your users stay engaged</strong>.</p>\n<p>Take a look at the <a href=\"https://en.funnelforms.io/examples\" rel=\"nofollow ugc\">Examples</a> page to see for yourself that Funnelforms contact form can be used in almost any industry where contacts of any kind need to be generated (lead generation, recruitment, pricing, appointment setting, service and product configuration).</p>\n<h3>PREMIUM SUPPORT FOR USERS OF THE PRO VERSION</h3>\n<p>Funnelforms team will offer you any support you need. As a user of the Free version, you have the possibility to <strong>report errors via ticket</strong>, which will of course be fixed for you as soon as possible. Furthermore you have unlimited <strong>access to the Help Center</strong>. The Help Center offers many helpful articles and instructions on how to create a multi step form, contact form and tips on form builder in general. If you still have questions or can&#8217;t find an answer to your question in the Help Center, you can use the <a href=\"https://en.funnelforms.io/\" rel=\"nofollow ugc\">live chat on our website</a> for all other questions and help.</p>\n<p>But hopefully you&#8217;ll understand that we have to prioritize all Pro version customers. The individual email and ticket support is available to users who have purchased a <a href=\"https://en.funnelforms.io/\" rel=\"nofollow ugc\">Funnelforms Pro</a> license. Here, in addition to classic support topics, individual adaptations of the contact form can be implemented or help with the optimal setup can be given. Furthermore, in addition to the unlimited functions mentioned above, you will benefit from other helpful tools for your lead generation via multi step form:</p>\n<ul>\n<li><strong>Lead Training Video Tutorial</strong> of approx. 50 min. for the optimal use of Funnelforms on your website and best practices in using the form builder.</li>\n<li><strong>25,000 premium icons</strong> for download and free use in your multi step form and on your website.</li>\n<li><strong>Free personal 1:1 onboarding</strong> of 45 min for contact form setup, general questions and helpful tips for custom lead generation through your website.</li>\n<li><strong>Smartphone app for iOS &amp; Android</strong> to see all your leads&#8217; contact information on the go and get statistics from your contact forms.</li>\n<li><strong>Comprehensive and customized premium support</strong> that even implements your personal requests.</li>\n</ul>\n<p>So if you&#8217;re really serious about lead generation through your website and want to get the most out of it at all levels, we recommend the contact form plugin <a href=\"https://en.funnelforms.io/\" rel=\"nofollow ugc\">Funnelforms Pro</a>! <strong>Costs a little, but gets you even better lead generation results</strong>!</p>\n<h3>FUNNELFORMS IS TOP-RATED WITH MANY 5 STARS ON TRUSTPILOT</h3>\n<p>We are proud that the Funnelforms contact form has already convinced so many customers and brought them further. The plugin has more than 150 reviews on Trustpilot with an average of 4.9 stars. You can see <a href=\"https://de.trustpilot.com/review/funnelforms.io\" rel=\"nofollow ugc\">all reviews</a> here. However, we would like to present you some insightful reviews from satisfied customers here now as well:</p>\n<p><strong>5 stars from Simon Krebs:</strong></p>\n<p><strong>This tool is soo powerful!</strong><br />\nI started with the first license 3 months ago and successfully upgraded to the 10 agency license today. The service is simply unbeatable and the pricing for such a powerful tool is a must-have.<br />\nThis tool improves the conversion rate so much that it is almost criminal.</p>\n<p>There is simply no wish left unfulfilled. Every problem is fixed, the staff is just there.</p>\n<p>The software is incredibly accurate and well thought out.</p>\n<p>I am so happy to have found this tool</p>\n<p><strong>5 stars from Andi:</strong></p>\n<p><strong>How the hell is this possible!!!</strong><br />\nI usually never write reviews on the internet and am more the silent customer. Here I am downright forced by my results to say something, better yet I have no choice at all!</p>\n<p>Funnelforms purchased a few days ago, installed and license activated in less than 5 minutes. The tool? Can&#8217;t be beat for simplicity, intuitive and logical to use, all elements and buttons make sense where they are. Did it take me long to create my form? No.</p>\n<p>Form was up and running within 2 hours on the same day. But 2 hours not because I was overwhelmed and didn&#8217;t find the functions right away, but because I took my time to create an absolutely awesome logic. So Funnelforms then went live on our website. We usually have between 3 and 5 requests per week. After going live of Funnelforms, say and write received 28 leads in the first week alone. I didn&#8217;t think this was possible &#8211; and now shut up: no junk! Flawless quality of leads, good accessibility, genuine interest. Of these leads, 6 have already been converted into customers and sales.</p>\n<p>Again to let it sink in:</p>\n<p>-Without changing the website<br />\n-Without increasing visitors or traffic to the website<br />\n-Without increasing the adspend<br />\n-Without creating new advertising campaigns</p>\n<p>The only thing we did was replace our previous contact form with Funnelforms. I don&#8217;t know how you do it, but I am deeply convinced and can advise every company: Buy this software!!!</p>\n<p><strong>5 stars from Florian I.:</strong></p>\n<p><strong>Perfect for all kind of forms with Funnel</strong><br />\nVery very good form plugin, but actually it is much much more than that. We have been using the paid version for a while, but even now in the free version there are so many features unlocked that are really really great. Especially creating simple funnel forms is very fast and you don&#8217;t need hours of training. It is almost self-explanatory.<br />\nTop work and we are looking forward to updates.</p>\n<h3>READ MORE ABOUT THE FORM BUILDER</h3>\n<p>Need more information about multi step form builder, contact form creation and lead generation with Funnelforms? You can find us here:</p>\n<ul>\n<li>The official website of <a href=\"https://en.funnelforms.io/\" rel=\"nofollow ugc\">Funnelforms Plugin</a>.</li>\n<li>The <a href=\"https://help.funnelforms.io/en\" rel=\"nofollow ugc\">Funnelforms Help Center</a>.</li>\n<li>Also join our <a href=\"https://www.facebook.com/groups/639159471081043\" rel=\"nofollow ugc\">Funnelforms Facebook Group</a> to exchange ideas with other users and follow us on <a href=\"https://www.instagram.com/funnelforms/\" rel=\"nofollow ugc\">Instagram</a> and <a href=\"https://www.facebook.com/funnelforms\" rel=\"nofollow ugc\">Facebook</a>.</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/funnelforms-free.3.7.4.1.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/funnelforms-free/assets/screenshot-1.png?rev=2837296",
            "caption": "First steps and checklist for your quick start with Funnelforms"
        },
        {
            "src": "https://ps.w.org/funnelforms-free/assets/screenshot-2.png?rev=2833764",
            "caption": "Overview of all generated leads"
        },
        {
            "src": "https://ps.w.org/funnelforms-free/assets/screenshot-3.png?rev=2833764",
            "caption": "All created questions with the different question types"
        },
        {
            "src": "https://ps.w.org/funnelforms-free/assets/screenshot-4.png?rev=2833764",
            "caption": "Question editor to create a question for the multi step form"
        },
        {
            "src": "https://ps.w.org/funnelforms-free/assets/screenshot-5.png?rev=2833764",
            "caption": "Contact form editor to create a contact form for capture of personal data"
        },
        {
            "src": "https://ps.w.org/funnelforms-free/assets/screenshot-6.png?rev=2833764",
            "caption": "Contact form settings for notification email and more"
        },
        {
            "src": "https://ps.w.org/funnelforms-free/assets/screenshot-7.png?rev=2833764",
            "caption": "Form editor to build multi step forms with conditional logic"
        },
        {
            "src": "https://ps.w.org/funnelforms-free/assets/screenshot-8.png?rev=2833764",
            "caption": "Form settings to adjust colors, design and fonts"
        },
        {
            "src": "https://ps.w.org/funnelforms-free/assets/screenshot-9.png?rev=2833764",
            "caption": "Preview of the created form"
        }
    ],
    "tags": {
        "contact-form": "contact form",
        "form": "form",
        "funnel": "funnel",
        "multi-step-form": "Multi-Step Form",
        "quiz": "quiz"
    },
    "stable_tag": "3.7.4.1",
    "versions": {
        "3.2.10": "https://downloads.wordpress.org/plugin/funnelforms-free.3.2.10.zip",
        "3.2.7": "https://downloads.wordpress.org/plugin/funnelforms-free.3.2.7.zip",
        "3.2.9": "https://downloads.wordpress.org/plugin/funnelforms-free.3.2.9.zip",
        "3.3.3": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.3.zip",
        "3.3.3.1": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.3.1.zip",
        "3.3.3.3": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.3.3.zip",
        "3.3.4": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.4.zip",
        "3.3.5": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.5.zip",
        "3.3.6": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.6.zip",
        "3.3.7": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.7.zip",
        "3.3.7.1": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.7.1.zip",
        "3.3.7.2": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.7.2.zip",
        "3.3.8": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.8.zip",
        "3.3.8.3": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.8.3.zip",
        "3.3.8.4": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.8.4.zip",
        "3.3.8.5": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.8.5.zip",
        "3.3.8.6": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.8.6.zip",
        "3.3.8.7": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.8.7.zip",
        "3.3.9": "https://downloads.wordpress.org/plugin/funnelforms-free.3.3.9.zip",
        "3.4": "https://downloads.wordpress.org/plugin/funnelforms-free.3.4.zip",
        "3.4.2": "https://downloads.wordpress.org/plugin/funnelforms-free.3.4.2.zip",
        "3.4.2.1": "https://downloads.wordpress.org/plugin/funnelforms-free.3.4.2.1.zip",
        "3.5.3.1": "https://downloads.wordpress.org/plugin/funnelforms-free.3.5.3.1.zip",
        "3.6": "https://downloads.wordpress.org/plugin/funnelforms-free.3.6.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/funnelforms-free.3.6.1.zip",
        "3.6.2.2": "https://downloads.wordpress.org/plugin/funnelforms-free.3.6.2.2.zip",
        "3.6.2.3": "https://downloads.wordpress.org/plugin/funnelforms-free.3.6.2.3.zip",
        "3.7": "https://downloads.wordpress.org/plugin/funnelforms-free.3.7.zip",
        "3.7.2": "https://downloads.wordpress.org/plugin/funnelforms-free.3.7.2.zip",
        "3.7.3": "https://downloads.wordpress.org/plugin/funnelforms-free.3.7.3.zip",
        "3.7.3.1": "https://downloads.wordpress.org/plugin/funnelforms-free.3.7.3.1.zip",
        "3.7.3.2": "https://downloads.wordpress.org/plugin/funnelforms-free.3.7.3.2.zip",
        "3.7.4.1": "https://downloads.wordpress.org/plugin/funnelforms-free.3.7.4.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/funnelforms-free.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/funnelforms-free/assets/banner-772x250.png?rev=2833914",
        "high": "https://ps.w.org/funnelforms-free/assets/banner-1544x500.png?rev=2833914"
    },
    "icons": {
        "1x": "https://ps.w.org/funnelforms-free/assets/icon-128x128.gif?rev=3054299"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "ar",
            "version": "3.7.4.1",
            "updated": "2023-12-03 08:19:33",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/ar.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "de_DE_formal",
            "version": "3.7.4.1",
            "updated": "2024-03-28 19:21:19",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/de_DE_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "de_DE",
            "version": "3.7.4.1",
            "updated": "2024-03-28 19:25:04",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "es_ES",
            "version": "3.7.4.1",
            "updated": "2023-08-09 05:57:26",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "fr_FR",
            "version": "3.7.4.1",
            "updated": "2023-11-24 08:19:02",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "it_IT",
            "version": "3.7.4.1",
            "updated": "2024-01-25 19:06:59",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "ja",
            "version": "3.7.4.1",
            "updated": "2023-10-11 09:47:37",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/ja.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "nl_NL",
            "version": "3.7.4.1",
            "updated": "2024-07-30 12:46:36",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "pl_PL",
            "version": "3.7.4.1",
            "updated": "2024-06-07 13:18:03",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/pl_PL.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "pt_BR",
            "version": "3.7.4.1",
            "updated": "2023-09-18 09:26:51",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/pt_BR.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "pt_PT",
            "version": "3.7.4.1",
            "updated": "2023-09-18 09:27:00",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/pt_PT.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "ru_RU",
            "version": "3.7.4.1",
            "updated": "2024-02-20 07:21:01",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "sv_SE",
            "version": "3.7.4.1",
            "updated": "2023-11-30 13:32:46",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/sv_SE.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "tr_TR",
            "version": "3.7.4.1",
            "updated": "2024-08-03 09:42:53",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/tr_TR.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "zh_CN",
            "version": "3.7.4.1",
            "updated": "2023-12-03 08:09:31",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/zh_CN.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "zh_HK",
            "version": "3.7.4.1",
            "updated": "2023-12-03 08:12:51",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/zh_HK.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "zh_SG",
            "version": "3.7.4.1",
            "updated": "2023-12-03 08:12:45",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/zh_SG.zip"
        },
        {
            "type": "plugin",
            "slug": "funnelforms-free",
            "language": "zh_TW",
            "version": "3.7.4.1",
            "updated": "2023-12-03 08:12:39",
            "package": "http://downloads.wordpress.org/translation/plugin/funnelforms-free/3.7.4.1/zh_TW.zip"
        }
    ]
}