{
    "name": "GIFT4U &#8211; Gift Cards All in One for Woo",
    "slug": "gift4u-gift-cards-all-in-one-for-woo",
    "version": "1.0.7",
    "author": "<a href=\"http://villatheme.com\">VillaTheme</a>",
    "author_profile": "https://profiles.wordpress.org/villatheme/",
    "contributors": {
        "villatheme": {
            "profile": "https://profiles.wordpress.org/villatheme/",
            "avatar": "https://secure.gravatar.com/avatar/973d0ef458adb8a3c527f196b9529909?s=96&d=monsterid&r=g",
            "display_name": "VillaTheme"
        },
        "mrt3vn": {
            "profile": "https://profiles.wordpress.org/mrt3vn/",
            "avatar": "https://secure.gravatar.com/avatar/cb8ecbc2ffe02a20ea2f5d1da26d3a22?s=96&d=monsterid&r=g",
            "display_name": "Andy Ha"
        }
    },
    "requires": "5.0",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [
        "woocommerce"
    ],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 2,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 2,
    "support_url": "https://wordpress.org/support/plugin/gift4u-gift-cards-all-in-one-for-woo/",
    "support_threads": 4,
    "support_threads_resolved": 2,
    "active_installs": 100,
    "downloaded": 1995,
    "last_updated": "2024-06-08 01:53:00",
    "added": "2023-02-28",
    "homepage": "https://villatheme.com/extensions/gift4u-gift-cards-all-in-one-for-woo/",
    "sections": {
        "description": "<p><strong>WooCommerce Gift Cards All in One</strong> is a comprehensive plugin designed to simplify the gift card management process for WooCommerce store owners.</p>\n<p>Online gift cards have become a solution for the gifting dilemmas people encounter during special occasions. Giving gifts not only strengthens the bond between the giver and recipient but also benefits the merchants. It’s worth noting that when customers purchase gift cards for their loved ones, they indirectly promote your brand and boost sales.</p>\n<p>Enabling gift cards on your WooCommerce store is a mutually beneficial option for both the store owners and customers. Customers can purchase gift cards for themselves or their loved ones and even schedule them to be sent later. This is one of the reasons why gift cards have gained popularity, alongside other discounts and coupon offers.</p>\n<p><strong>WooCommerce Gift Cards All in One</strong> offers a one-stop-shop solution for creating, managing, and selling gift cards on your WooCommerce store.</p>\n<p>This plugin is the perfect solution for online stores looking to capitalize on the growing popularity of gift cards. With WooCommerce Gift Cards All in One, you can easily offer gift cards as an alternative to traditional gift-giving methods. This plugin makes it easy for customers to purchase gift cards, which can be redeemed for products or services on your WooCommerce store.</p>\n<blockquote>\n<p><a href=\"https://docs.villatheme.com/gift4u-gift-cards-all-in-one-for-woo/\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/KzHlkg0Zjjo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><strong>WooCommerce Gift Cards All in One</strong> offers several benefits for store owners.</p>\n<ul>\n<li>\n<p>Allows you to attract new customers to your store: Gift cards have been proven to be an effective tool for driving sales and increasing customer loyalty. By offering gift cards on your store, you can attract new customers who are looking<br />\nfor a convenient and easy way to purchase gifts.</p>\n</li>\n<li>\n<p>Increase your brand value: With customizable gift cards, you can add your store logo and branding to the gift card design. This not only helps increase brand awareness but also makes your store more memorable for customers who receive gift cards from your store.</p>\n</li>\n<li>\n<p>Makes it easy to purchase gift cards for any occasion: With WooCommerce Gift Cards All in One, customers can purchase gift cards for birthdays, holidays, weddings, or any other special occasion. They can even schedule gift cards to be sent at a later date, making it easy to plan ahead for special events.</p>\n</li>\n<li>\n<p>Improve your sales: With gift cards, customers are more likely to make a purchase, even if they don’t know what to buy initially. This means that gift cards can lead to increased sales for your store.</p>\n</li>\n<li>\n<p>Minimize fraud instances when customers try to return expired cash: The plugin also helps reduce fraud instances when customers try to make an expired cash return. With gift cards, customers are more likely to make a purchase, and there is less chance of fraud. This means that you can save time and money by reducing fraudulent returns on your store.</p>\n</li>\n<li>\n<p>Elevate sales and revenue with WooCommerce digital cards: Another benefit of WooCommerce Gift Cards All in One is that it helps increase your sales and revenue with digital cards. With digital gift cards, customers can purchase and redeem gift cards online, making it easier for them to use the gift card and for you to manage the gift card process.</p>\n</li>\n<li>\n<p>WooCommerce free gift cards are a superior alternative to cash cards and traditional gifts: WooCommerce free gift cards are the best substitute for cash cards and regular gifts. It’s a great way to incentivize customers to make a purchase. By offering free gift cards as part of a promotion or special offer, you can encourage customers to buy from your store.</p>\n</li>\n<li>\n<p>Achieve superb brand exposure by including the finest gift cards for different shopping occasions: By adding the best gift cards for various shopping occasions, you can experience excellent brand exposure. Create custom gift cards for different occasions, such as birthdays, holidays, and weddings. This means that your store can be more memorable for customers who receive gift cards.</p>\n</li>\n</ul>\n<p><strong>What you can do to achieve the benefits above</strong><br />\nCreate limitless gift card products with WooCommerce Gift Cards All in One<br />\nIt’s easy to create and manage as many gift cards as you want and then sell them.</p>\n<ul>\n<li>\n<p>Make your gift card price flexible with different pricing types</p>\n</li>\n<li>\n<p>Set up live duration for discount</p>\n</li>\n<li>\n<p>Make the gift card virtual/physical with delivery method – Email or Ship card</p>\n</li>\n<li>\n<p>Create multiple image galleries with different concept and assign galleries to gift card product</p>\n</li>\n<li>\n<p>Build and customize various card template easily and assign templates you want to gift card product</p>\n</li>\n<li>\n<p>Enable extra fields for gift card on product page</p>\n</li>\n<li>\n<p>Set up restriction for coupon user by email restriction</p>\n</li>\n<li>\n<p>Grant free shipping method</p>\n</li>\n<li>\n<p>Include/Exclude products, product categories, sale products from the coupon</p>\n</li>\n<li>\n<p>Make the coupon usable with min/max spend (subtotal)</p>\n</li>\n<li>\n<p>Set coupon expiry date</p>\n</li>\n</ul>\n<p><strong>Multiple image galleries and Gift card template</strong></p>\n<ul>\n<li>Image Galleries<br />\nThe plugin allows adding multiple images and users can select when purchasing a virtual gift card. These images can be grouped into different categories, for example Christmas, Birthday, Events and so on.</li>\n</ul>\n<p>Assign the galleries to gift card products.</p>\n<ul>\n<li>Gift Card templates<br />\nCreate and customize various card templates</li>\n</ul>\n<p>Assign the templates to gift card products.</p>\n<p><strong>Gift Card page on My account</strong><br />\nAfter activating WooCommerce Gift Cards All in One, customers will have a Gift cards page on their My account, allowing them to view the gift cards they purchased and their details/status:</p>\n<ul>\n<li>\n<p>Gift card coupon code</p>\n</li>\n<li>\n<p>Gift card coupon amount</p>\n</li>\n<li>\n<p>Gift card user</p>\n</li>\n<li>\n<p>Delivery status</p>\n</li>\n<li>\n<p>Delivery method</p>\n</li>\n<li>\n<p>Gift card expiry date</p>\n</li>\n<li>\n<p>Usage</p>\n</li>\n<li>\n<p>If the Gift card delivery method is “Email”, customer can choose to resend the Gift Card email</p>\n</li>\n</ul>\n<p><strong>Show coupon list under “Apply Coupon” form with WooCommerce Gift Cards All in One</strong><br />\nIf your store has an “Apply coupon” form somewhere allowing customers to enter their coupon code and redeem discount, then you can show/hide list of their purchased GIFT4U gift card coupon codes under that form. They can select one from the list and apply it in an easier way.</p>\n<ul>\n<li>\n<p>Select coupon background color</p>\n</li>\n<li>\n<p>Select coupon text color</p>\n</li>\n</ul>\n<p><strong>Customize and send Gift card email with WooCommerce Gift Cards All in One</strong><br />\nIf the “Delivery method” is “Email”, customers will receive an email with the Gift Card they purchased. Design that Gift Card email here.</p>\n<ul>\n<li>\n<p>Edit email subject</p>\n</li>\n<li>\n<p>Edit email content with both visual and text editor</p>\n</li>\n<li>\n<p>Multiple shortcodes supported</p>\n</li>\n<li>\n<p>Send a copy of message to sender when gift card email is sent to receiver</p>\n</li>\n</ul>\n<p>WooCommerce Gift Cards All in One plugin is a must-have for any WooCommerce store owner who wants to offer a hassle-free gift card solution. With customizable gift cards, easy purchasing options, and several benefits for store owners, this plugin is an essential tool for driving sales, increasing customer loyalty, and growing your brand.</p>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Customers can order and pay before it&#8217;s intended release date to guarantee a copy.</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Documentation</h3>\n<p>&#9658; <a href=\"https://docs.villatheme.com/?item=\" rel=\"nofollow ugc\">Getting Started</a></p>\n<h3>Plugin Links</h3>\n<p>&#9658; <a href=\"https://villatheme.com\" rel=\"nofollow ugc\">Project Page</a><br />\n&#9658; <a href=\"https://docs.villatheme.com/?item=\" rel=\"nofollow ugc\">Documentation</a><br />\n&#9658; <a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></p>\n",
        "installation": "<ol>\n<li>Unzip the download package</li>\n<li>Upload <code>gift4u-gift-cards-all-in-one-for-woo</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "changelog": "<p>/<strong>1.0.7 &#8211; 2024.06.08</strong>/<br />\n– Updated: Update security</p>\n<p>/<strong>1.0.6 &#8211; 2024.04.13</strong>/<br />\n– Updated: Compatible with WP 6.5 and  WC 8.7<br />\n– Updated: Update support class</p>\n<p>/<strong>1.0.5 &#8211; 2024.01.02</strong>/<br />\n– Fixed: Generate expired date in PDF file</p>\n<p>/<strong>1.0.4 &#8211; 2023.08.29</strong>/<br />\n– Fixed: Generate expired date</p>\n<p>/<strong>1.0.3 &#8211; 2023.07.03</strong>/<br />\n– Updated: Compatible with WooCommerce HPOS(COT)</p>\n<p>/<strong>1.0.2 &#8211; 2023.03.23</strong>/<br />\n&#8211; Added: PPDF file name in email</p>\n<p>/<strong>1.0.1 &#8211; 2023.03.01</strong>/<br />\n&#8211; Fixed: Expiry date format</p>\n<p>/<strong>1.0.0 &#8211; 2023.02.14</strong>/<br />\n~ The first released.</p>\n"
    },
    "short_description": "Attract customers by unlocking the potential of gift card products. Easily create, sell, and manage a WooCommerce gift card with a few simple steps.",
    "description": "<p><strong>WooCommerce Gift Cards All in One</strong> is a comprehensive plugin designed to simplify the gift card management process for WooCommerce store owners.</p>\n<p>Online gift cards have become a solution for the gifting dilemmas people encounter during special occasions. Giving gifts not only strengthens the bond between the giver and recipient but also benefits the merchants. It’s worth noting that when customers purchase gift cards for their loved ones, they indirectly promote your brand and boost sales.</p>\n<p>Enabling gift cards on your WooCommerce store is a mutually beneficial option for both the store owners and customers. Customers can purchase gift cards for themselves or their loved ones and even schedule them to be sent later. This is one of the reasons why gift cards have gained popularity, alongside other discounts and coupon offers.</p>\n<p><strong>WooCommerce Gift Cards All in One</strong> offers a one-stop-shop solution for creating, managing, and selling gift cards on your WooCommerce store.</p>\n<p>This plugin is the perfect solution for online stores looking to capitalize on the growing popularity of gift cards. With WooCommerce Gift Cards All in One, you can easily offer gift cards as an alternative to traditional gift-giving methods. This plugin makes it easy for customers to purchase gift cards, which can be redeemed for products or services on your WooCommerce store.</p>\n<blockquote>\n<p><a href=\"https://docs.villatheme.com/gift4u-gift-cards-all-in-one-for-woo/\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/KzHlkg0Zjjo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><strong>WooCommerce Gift Cards All in One</strong> offers several benefits for store owners.</p>\n<ul>\n<li>\n<p>Allows you to attract new customers to your store: Gift cards have been proven to be an effective tool for driving sales and increasing customer loyalty. By offering gift cards on your store, you can attract new customers who are looking<br />\nfor a convenient and easy way to purchase gifts.</p>\n</li>\n<li>\n<p>Increase your brand value: With customizable gift cards, you can add your store logo and branding to the gift card design. This not only helps increase brand awareness but also makes your store more memorable for customers who receive gift cards from your store.</p>\n</li>\n<li>\n<p>Makes it easy to purchase gift cards for any occasion: With WooCommerce Gift Cards All in One, customers can purchase gift cards for birthdays, holidays, weddings, or any other special occasion. They can even schedule gift cards to be sent at a later date, making it easy to plan ahead for special events.</p>\n</li>\n<li>\n<p>Improve your sales: With gift cards, customers are more likely to make a purchase, even if they don’t know what to buy initially. This means that gift cards can lead to increased sales for your store.</p>\n</li>\n<li>\n<p>Minimize fraud instances when customers try to return expired cash: The plugin also helps reduce fraud instances when customers try to make an expired cash return. With gift cards, customers are more likely to make a purchase, and there is less chance of fraud. This means that you can save time and money by reducing fraudulent returns on your store.</p>\n</li>\n<li>\n<p>Elevate sales and revenue with WooCommerce digital cards: Another benefit of WooCommerce Gift Cards All in One is that it helps increase your sales and revenue with digital cards. With digital gift cards, customers can purchase and redeem gift cards online, making it easier for them to use the gift card and for you to manage the gift card process.</p>\n</li>\n<li>\n<p>WooCommerce free gift cards are a superior alternative to cash cards and traditional gifts: WooCommerce free gift cards are the best substitute for cash cards and regular gifts. It’s a great way to incentivize customers to make a purchase. By offering free gift cards as part of a promotion or special offer, you can encourage customers to buy from your store.</p>\n</li>\n<li>\n<p>Achieve superb brand exposure by including the finest gift cards for different shopping occasions: By adding the best gift cards for various shopping occasions, you can experience excellent brand exposure. Create custom gift cards for different occasions, such as birthdays, holidays, and weddings. This means that your store can be more memorable for customers who receive gift cards.</p>\n</li>\n</ul>\n<p><strong>What you can do to achieve the benefits above</strong><br />\nCreate limitless gift card products with WooCommerce Gift Cards All in One<br />\nIt’s easy to create and manage as many gift cards as you want and then sell them.</p>\n<ul>\n<li>\n<p>Make your gift card price flexible with different pricing types</p>\n</li>\n<li>\n<p>Set up live duration for discount</p>\n</li>\n<li>\n<p>Make the gift card virtual/physical with delivery method – Email or Ship card</p>\n</li>\n<li>\n<p>Create multiple image galleries with different concept and assign galleries to gift card product</p>\n</li>\n<li>\n<p>Build and customize various card template easily and assign templates you want to gift card product</p>\n</li>\n<li>\n<p>Enable extra fields for gift card on product page</p>\n</li>\n<li>\n<p>Set up restriction for coupon user by email restriction</p>\n</li>\n<li>\n<p>Grant free shipping method</p>\n</li>\n<li>\n<p>Include/Exclude products, product categories, sale products from the coupon</p>\n</li>\n<li>\n<p>Make the coupon usable with min/max spend (subtotal)</p>\n</li>\n<li>\n<p>Set coupon expiry date</p>\n</li>\n</ul>\n<p><strong>Multiple image galleries and Gift card template</strong></p>\n<ul>\n<li>Image Galleries<br />\nThe plugin allows adding multiple images and users can select when purchasing a virtual gift card. These images can be grouped into different categories, for example Christmas, Birthday, Events and so on.</li>\n</ul>\n<p>Assign the galleries to gift card products.</p>\n<ul>\n<li>Gift Card templates<br />\nCreate and customize various card templates</li>\n</ul>\n<p>Assign the templates to gift card products.</p>\n<p><strong>Gift Card page on My account</strong><br />\nAfter activating WooCommerce Gift Cards All in One, customers will have a Gift cards page on their My account, allowing them to view the gift cards they purchased and their details/status:</p>\n<ul>\n<li>\n<p>Gift card coupon code</p>\n</li>\n<li>\n<p>Gift card coupon amount</p>\n</li>\n<li>\n<p>Gift card user</p>\n</li>\n<li>\n<p>Delivery status</p>\n</li>\n<li>\n<p>Delivery method</p>\n</li>\n<li>\n<p>Gift card expiry date</p>\n</li>\n<li>\n<p>Usage</p>\n</li>\n<li>\n<p>If the Gift card delivery method is “Email”, customer can choose to resend the Gift Card email</p>\n</li>\n</ul>\n<p><strong>Show coupon list under “Apply Coupon” form with WooCommerce Gift Cards All in One</strong><br />\nIf your store has an “Apply coupon” form somewhere allowing customers to enter their coupon code and redeem discount, then you can show/hide list of their purchased GIFT4U gift card coupon codes under that form. They can select one from the list and apply it in an easier way.</p>\n<ul>\n<li>\n<p>Select coupon background color</p>\n</li>\n<li>\n<p>Select coupon text color</p>\n</li>\n</ul>\n<p><strong>Customize and send Gift card email with WooCommerce Gift Cards All in One</strong><br />\nIf the “Delivery method” is “Email”, customers will receive an email with the Gift Card they purchased. Design that Gift Card email here.</p>\n<ul>\n<li>\n<p>Edit email subject</p>\n</li>\n<li>\n<p>Edit email content with both visual and text editor</p>\n</li>\n<li>\n<p>Multiple shortcodes supported</p>\n</li>\n<li>\n<p>Send a copy of message to sender when gift card email is sent to receiver</p>\n</li>\n</ul>\n<p>WooCommerce Gift Cards All in One plugin is a must-have for any WooCommerce store owner who wants to offer a hassle-free gift card solution. With customizable gift cards, easy purchasing options, and several benefits for store owners, this plugin is an essential tool for driving sales, increasing customer loyalty, and growing your brand.</p>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Customers can order and pay before it&#8217;s intended release date to guarantee a copy.</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Documentation</h3>\n<p>&#9658; <a href=\"https://docs.villatheme.com/?item=\" rel=\"nofollow ugc\">Getting Started</a></p>\n<h3>Plugin Links</h3>\n<p>&#9658; <a href=\"https://villatheme.com\" rel=\"nofollow ugc\">Project Page</a><br />\n&#9658; <a href=\"https://docs.villatheme.com/?item=\" rel=\"nofollow ugc\">Documentation</a><br />\n&#9658; <a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/gift4u-gift-cards-all-in-one-for-woo.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/gift4u-gift-cards-all-in-one-for-woo/assets/screenshot-1.jpg?rev=2879620",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gift4u-gift-cards-all-in-one-for-woo/assets/screenshot-2.jpg?rev=2879620",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gift4u-gift-cards-all-in-one-for-woo/assets/screenshot-3.jpg?rev=2879620",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gift4u-gift-cards-all-in-one-for-woo/assets/screenshot-4.jpg?rev=2879620",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gift4u-gift-cards-all-in-one-for-woo/assets/screenshot-5.jpg?rev=2879620",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gift4u-gift-cards-all-in-one-for-woo/assets/screenshot-6.jpg?rev=2879620",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gift4u-gift-cards-all-in-one-for-woo/assets/screenshot-7.jpg?rev=2879620",
            "caption": ""
        }
    ],
    "tags": {
        "card": "card",
        "gift": "gift",
        "gift-card": "gift card",
        "giftcard": "giftcard",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://www.villatheme.com/donate",
    "banners": {
        "low": "https://ps.w.org/gift4u-gift-cards-all-in-one-for-woo/assets/banner-772x250.jpg?rev=3081747",
        "high": "https://ps.w.org/gift4u-gift-cards-all-in-one-for-woo/assets/banner-1544x500.jpg?rev=3081747"
    },
    "icons": {
        "1x": "https://ps.w.org/gift4u-gift-cards-all-in-one-for-woo/assets/icon-128x128.gif?rev=3081747",
        "2x": "https://ps.w.org/gift4u-gift-cards-all-in-one-for-woo/assets/icon-256x256.gif?rev=3081747"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/gift4u-gift-cards-all-in-one-for-woo/blueprint.json?rev=3104274"
        }
    ],
    "preview_link": "",
    "language_packs": []
}