{
    "name": "Insights from Google PageSpeed",
    "slug": "google-pagespeed-insights",
    "version": "4.0.8",
    "author": "<a href=\"http://mattkeys.me\">Matt Keys</a>",
    "author_profile": "https://profiles.wordpress.org/mattkeys/",
    "contributors": {
        "mattkeys": {
            "profile": "https://profiles.wordpress.org/mattkeys/",
            "avatar": "https://secure.gravatar.com/avatar/0341d02803f0f4a86e6a07b626ea1e76?s=96&d=monsterid&r=g",
            "display_name": "Matt Keys"
        }
    },
    "requires": "3.6",
    "tested": "6.5.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 96,
    "ratings": {
        "5": 24,
        "4": 2,
        "3": 1,
        "2": 1,
        "1": 0
    },
    "num_ratings": 28,
    "support_url": "https://wordpress.org/support/plugin/google-pagespeed-insights/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 30000,
    "downloaded": 629327,
    "last_updated": "2024-07-07 19:09:00",
    "added": "2013-10-01",
    "homepage": "http://mattkeys.me",
    "sections": {
        "description": "<p>Google Pagespeed Insights is a tool that empowers you to make decisions that increase the performance of your website. Recommendations from Google Pagespeed are based upon current industry best practices for desktop and mobile web performance.</p>\n<p>Through the addition of advanced data visualization, tagging, filtering, and snapshot technology, Insights from Google PageSpeed provides a comprehensive solution for any webmaster looking to increase their site performance, their search engine ranking, and their visitors browsing experience.</p>\n<h4>Detailed Page Reporting</h4>\n<p>Sort your page reports by their Page Speed Score to prioritize the largest areas of opportunity on your site. Page reports utilize easy to read visualizations that allow you to quickly focus in on the most important data to improve your sites performance.</p>\n<h4>Report Summaries</h4>\n<p>Report Summaries are a powerful and exclusive feature of Insights from Google PageSpeed. Summaries display your average Page Score, largest areas for improvement across ALL reports, as well as best and lowest performing pages. Report summaries can be filtered to narrow results by: Pages, Posts, Categories, Custom URLs, and Custom Post Types.</p>\n<p>Using Report Summaries allows you to ‘zoom out’ from the page-level and better understand the big picture of your sites performance.</p>\n<h4>Desktop and Mobile Page Reports</h4>\n<p>Best practices for site performance differ greatly between Desktop and Mobile device usage. Configure Insights from Google PageSpeed to generate Desktop reports, Mobile reports, or both!</p>\n<p>Toggle back and forth between report types to see specific suggestions for improving the performance and experience on each platform.</p>\n<h4>Report Snapshots</h4>\n<p>The Report Snapshot tool builds on the power of Report Summaries, to provide historical “Point In Time” data about your website.</p>\n<p>Take a snapshot of any Report Summary screen to store that data for future retrieval. Add comments to your snapshots to provide additional meaning, such as “Before Installing W3 Total Cache.” Additionally, filter a Report Summary before taking a Snapshot to save a summary of the filtered data.</p>\n<h4>Snapshot Comparison Tool</h4>\n<p>The Snapshot Comparison Tool is an amazing utility that lets you visualize side-by-side results from any two similar Report Snapshots.</p>\n<p>Take a Report Snapshot before installing new plugins, or before implementing performance recommendations. Take another snapshot when you are finished and compare your results to measure the effect of your changes.</p>\n<h4>Add/Import Custom URLs</h4>\n<p>Easily add additional URLs for inclusion in Pagespeed Reports. Even add URLs for non-WordPress sites, even if they are not hosted on your server. URLs can be added manually, or upload a properly formatted XML sitemap to add multiple pages at once.</p>\n<p>Custom URLs can be tagged and filtered in Report Summaries. Take Report Snapshots of your Custom URLs just like you would with any other report type.</p>\n<h4>Scheduled Report Checks</h4>\n<p>Configure Insights from Google PageSpeed to automatically recheck your site on a Daily, Weekly, Bi-Monthly, or Monthly basis.</p>\n<p>With each scan, any new pages or posts will be discovered, and existing reports will be updated to reflect any changes to your site, as well as any changes in the Pagespeed recommendations.</p>\n<h4>Additional Languages</h4>\n<ul>\n<li>(v1.x translation) Russian Translation provided by: Ivanka from <a href=\"http://coupofy.com\" rel=\"nofollow ugc\">coupofy.com</a></li>\n<li>(v1.x translation) Spanish Translation provided by: Ogi Djuraskovic from <a href=\"http://firstsiteguide.com\" rel=\"nofollow ugc\">firstsiteguide.com</a></li>\n<li>(v1.x translation) Serbian Translation provided by: Ogi Djuraskovic from <a href=\"http://firstsiteguide.com\" rel=\"nofollow ugc\">firstsiteguide.com</a></li>\n</ul>\n<h3>Troubleshooting</h3>\n<p><strong>Please find the below list of potential issues that you may encounter, and the recommended next steps.</strong></p>\n<h4>I entered my API Key and saved the Options, but no Reports are showing up in the Report List.</h4>\n<ul>\n<li>Google Pagespeed needs to be able to load each page to create its report. Make sure that your pages are publicly accessible over the internet.</li>\n<li>Ensure that your API key is entered correctly, and that you have enabled the &#8220;PageSpeed Insights API&#8221; from the Google API Console.</li>\n<li>In the Options page, under &#8220;Advanced Configuration&#8221; there is a checkbox called &#8220;Log API Exceptions&#8221;. Any API exception that is not caught and handled automatically will be stored for up to 7 days. This log information can be very helpful when diagnosing issues.</li>\n</ul>\n<h4>Page report checks never finish all of the way, I have to press &#8220;Start Reporting&#8221; again and again to get it to finish checking all of my pages.</h4>\n<ul>\n<li>If the reports seem to always run for a certain length of time before stopping unexpectedly, you may be exceeding your servers Max Execution time. Try increasing the value in Options-&gt;Advanced Configuration &#8220;Maximum Execution Time&#8221;.</li>\n<li>Some web hosting providers do not allow the Maximum Execution Time to be overridden or increased. In that case you can try setting the Maximum Script Run Time. This will make the script run for the set period of time, then stop and spawn a new script, to get around timeout issues. Start with a low value, and test. Increase the value one step at a time until you find the largest value that allows your scans to finish successfully.</li>\n</ul>\n<h4>An error was reported while trying to check one of my pages, and it has been added to the Ignored Pages section.</h4>\n<ul>\n<li>Navigate to the Ignored Pages tab, find the page, and click &#8220;reactivate&#8221; to try it again.</li>\n<li>If the page fails again, ensure that the page is publicly accessible from the internet. Non-public pages cannot be checked.</li>\n<li>In some rare cases, pages are not able to be scanned by the Pagespeed API. Try checking your page manually here: https://developers.google.com/speed/pagespeed/insights/. If the page fails to be checked, report the issue to Google so that they can diagnose further.</li>\n</ul>\n<h4>I received a Javascript or PHP error.</h4>\n<ul>\n<li>If the error appeared while Google Pagespeed was checking pages, you may have loaded the page while it was storing data. Refresh the page in a couple seconds to see if the issue has gone away.</li>\n<li>If issues persist please report the problem with as much information as you can gather, including: What page you were on, the exact text of the error, or a screenshot of the error.</li>\n<li>In the Options page, under &#8220;Advanced Configuration&#8221; there is a checkbox called &#8220;Log API Exceptions&#8221;. Any API exception that is not caught and handled automatically will be logged for up to 7 days. This log information can be very helpful when diagnosing issues</li>\n</ul>\n<h4>My Page Scores seem really low. When I click &#8220;Recheck Results&#8221; when viewing Report Details, the score jumps up dramatically.</h4>\n<ul>\n<li>Your server may have been responding slowly when the first report was generated. A slow server response time can have a large impact on your Page Speed Score. If these problems happen frequently you may want to talk with your hosting provider about the problem, or look into alternative hosting providers.</li>\n</ul>\n<h4>I want to clear out all of the current page reports and start over.</h4>\n<ol>\n<li>Navigate to the &#8220;Options&#8221; tab</li>\n<li>Expand the &#8220;Advanced Configuration&#8221; section.</li>\n<li>Find the &#8220;Delete Data&#8221; Dropdown</li>\n<li>Select &#8220;Delete Reports Only&#8221; to remove all Page Reports</li>\n<li>Or Select &#8220;Delete EVERYTHING&#8221; to remove all Page Reports, Custom URLs, Snapshots, and Ignored Pages</li>\n</ol>\n",
        "installation": "<ol>\n<li>Login to your WordPress Admin page (usually http://yourdomain.com/wp-admin)</li>\n<li>Navigate to the Plugins screen and then click the &#8220;Add New&#8221; button</li>\n<li>Click on the &#8220;Upload&#8221; link near the top of the page and browse for the Insights from Google PageSpeed zip file</li>\n<li>Upload the file, and click &#8220;Activate Plugin&#8221; after the installation completes</li>\n<li>Congratulations, installation is complete; proceed to configuration.</li>\n</ol>\n<h4>Configuration</h4>\n<p>An extended version of the folliowing instructions as well as other documentation are included in the &#8220;documentation&#8221; folder of this plugin.</p>\n<p>Google Pagespeed Insights requires a Google API Key. Keys are free and can be obtained from Google. In order to get a key, you will need a Google account such as a GMail account. If you do not already have a Google account you can create one here: https://accounts.google.com/SignUp.</p>\n<ol>\n<li>Navigate to https://console.developers.google.com/</li>\n<li>Login with your Google Account (Create a Google account if you do not have one)</li>\n<li>Create a new API Key and enable the Google Pagespeed Insights API* (see note about restrictions)</li>\n<li>Paste your API Key into the Options page of Insights from Google PageSpeed</li>\n</ol>\n<ul>\n<li>Try first creating the API key without any &#8216;restrictions&#8217;. In my testing there seems to be a bug with using restricitons with the Pagespeed API.</li>\n</ul>\n<h4>Requirements</h4>\n<ul>\n<li>Google API Key <a href=\"https://code.google.com/apis/console/\" rel=\"nofollow ugc\">https://console.developers.google.com/</a></li>\n<li>WordPress 3.6 or Newer</li>\n</ul>\n",
        "changelog": "<h4>4.0.8</h4>\n<ul>\n<li>Fix PHP 8 warnings</li>\n</ul>\n<h4>4.0.7</h4>\n<ul>\n<li>Add support for XML sitemaps of type text/xml</li>\n<li>Bugfix some error messages not appearing when they should</li>\n<li>Add additional nonce checks for Cross-Site Request Forgery (CSRF) protection</li>\n</ul>\n<h4>4.0.6</h4>\n<ul>\n<li>Additional validating, sanitizing, and escaping the plugin codebase</li>\n</ul>\n<h4>4.0.5</h4>\n<ul>\n<li>Bugfix some validation rule reports not showing properly (some results may need to be rechecked to see the fixes)</li>\n<li>Better styling for readability in report details</li>\n<li>Additional validating, sanitizing, and escaping the plugin codebase</li>\n</ul>\n<h4>4.0.4</h4>\n<ul>\n<li>Bugfix improperly escaped data (xss security issue)</li>\n<li>Rename plugin to &#8220;Insights from Google PageSpeed&#8221;</li>\n</ul>\n<h4>4.0.3</h4>\n<ul>\n<li>Bugfix loading screenshots &#8216;filmstrip&#8217; images broken</li>\n</ul>\n<h4>4.0.2</h4>\n<ul>\n<li>Bugfix google has introduced a couple new report types that were not handled by JS templating in this plugin. Added support for the new type and also tried to more gracefully handle this issue if/when this happens again in the future.</li>\n</ul>\n<h4>4.0.1</h4>\n<ul>\n<li>Bugfix removed reference to &#8216;legend&#8217; template file that was deleted in v4.0.0 and was causing PHP warnings</li>\n</ul>\n<h4>4.0.0</h4>\n<ul>\n<li>NOTICE: This upgrade will remove any existing reports or snapshots created by older versions of this plugin as they are not compatible with the newest version of the pagespeed API (v5)</li>\n<li>Migrating to the latest version of the Google Pagespeed Insights API (v5). This comes with pretty big changes to reporting and is incompatible with reports generated from previous versions of the API (and this plugin)</li>\n<li>Replaced the Google API PHP library previously used by this plugin in favor of a much smaller and simpler class</li>\n<li>Bugfix SQL Mutex lock key not unique per installation causing issues when trying to run this plugin on multiple sites sharing the same SQL server</li>\n</ul>\n<h4>3.0.5</h4>\n<ul>\n<li>Fixed PHP warning when saving settings</li>\n</ul>\n<h4>3.0.4</h4>\n<ul>\n<li>Fixed bug where WordPress heartbeat API filter function failed to return properly</li>\n<li>Added additional options for max runtime to support scenarios where even 60 seconds was over the server max run time</li>\n</ul>\n<h4>3.0.3</h4>\n<ul>\n<li>Fixed bug where Maximum Script Run Time option could not be set to &#8220;No Limit&#8221; after previously being set to a higher value</li>\n</ul>\n<h4>3.0.2</h4>\n<ul>\n<li>Fixed bug introduced in v3.0.1 effecting servers running PHP 5.4 where a PHP error is produced while trying to perform actions in the plugin like saving options</li>\n</ul>\n<h4>3.0.1</h4>\n<ul>\n<li>Added snapshot comments to the view snapshot / compare snapshot templates</li>\n<li>Fixed bug with snapshot report type label reading &#8216;both&#8217; when it should read either desktop or mobile</li>\n<li>Fixed bug with snapshot report description label not loading translatable string</li>\n<li>Fixed bug preventing snapshot comments from being displayed in snapshots list table</li>\n<li>Improved hardening against authenticated XSS attacks</li>\n<li>Improved adherence to WordPress coding standards and best practices</li>\n</ul>\n<h4>3.0.0</h4>\n<ul>\n<li>Includes all previously &#8220;premium&#8221; functionality for free. This includes report snapshots, snapshot comparison tool, custom URL reporting, and scheduled report checks.</li>\n<li>Added in URL hotlinking in report details for paths to assets (images/scripts/etc)</li>\n</ul>\n<h4>2.0.3</h4>\n<ul>\n<li>Updating to latest google api php library 2.2.0 to resolve issues with PHP 7.1</li>\n</ul>\n<h4>2.0.2</h4>\n<ul>\n<li>Fixed bug which improperly returned WP Cron schedules on cron_schedules filter</li>\n</ul>\n<h4>2.0.1</h4>\n<ul>\n<li>Removed phpseclib unit tests from Google PHP API library to avoid false-positive with WordFence</li>\n</ul>\n<h4>2.0.0</h4>\n<ul>\n<li>Major rewrite for better compatibility and performance</li>\n<li>Updated to the latest Google Pagespeed Insights API verison and library</li>\n<li>Fixed issues with bulk installers not generating DB tables</li>\n<li>Consolidated scan methods to a single more reliable method inspired by WP cron</li>\n<li>Better identify, communicate, and resolve issues with environments that have difficulties with scanning pages or API errors</li>\n<li>Improved API error logging</li>\n<li>Added &#8216;abort scan&#8217; functionality to cancel an in-progress scan</li>\n<li>Added &#8216;Maximum Script Run Time&#8217; option to advanced configuration to allow scans to run in shorter intervals for web hosts which have script timeouts that cannot be overridden</li>\n<li>Update the codebase to adhere better to WordPress coding standards and best practices</li>\n</ul>\n<h4>1.0.6</h4>\n<ul>\n<li>Fixed error with WP_List_Table introduced with WordPress 4.3</li>\n<li>Added Russian translation. Thank you Ivanka from <a href=\"http://coupofy.com\" rel=\"nofollow ugc\">coupofy.com</a></li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Fixed problem with temp directory used by Google API which was not writable on many shared hosting environments, and prevented the plugin from working properly. Replaced sys_get_temp_dir function with WordPress get_temp_dir function to resolve.</li>\n<li>Added Spanish and Serbian translations. Thank you Ogi Djuraskovic from <a href=\"http://firstsiteguide.com\" rel=\"nofollow ugc\">firstsiteguide.com</a> for providing these.</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>Added auto-update capability</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Tweaked interactions with WPDB so that it will properly get the table prefix for WordPress multisite installations.</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Tweaked styles to look better in the new WordPress 3.8 admin theme.</li>\n<li>Fixed accidental use of some php shorttags (&lt;? instead of &lt;?php) that was causing activation errors for some. (Thank you bekar09 for first finding this error)</li>\n<li>Tweaked ajax.js for better performance (Thanks to Pippin for the suggestion)</li>\n<li>Tweaked use of get_pages() for better performance (Thanks to Pippin for the suggestion)</li>\n<li>Fixed a number of php notices</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Fixed a potential conflict with other plugins that also utilize the Google API PHP library. The API is now only included if the Google_Client class does not already exist.</li>\n<li>Added additional checking during plugin activation to fail fast if the server does not meet the minimum plugin requirements.</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Initial Release</li>\n</ul>\n"
    },
    "short_description": "Use Insights from Google PageSpeed to increase your sites performance, your search engine ranking, and your visitors browsing experience.",
    "description": "<p>Google Pagespeed Insights is a tool that empowers you to make decisions that increase the performance of your website. Recommendations from Google Pagespeed are based upon current industry best practices for desktop and mobile web performance.</p>\n<p>Through the addition of advanced data visualization, tagging, filtering, and snapshot technology, Insights from Google PageSpeed provides a comprehensive solution for any webmaster looking to increase their site performance, their search engine ranking, and their visitors browsing experience.</p>\n<h4>Detailed Page Reporting</h4>\n<p>Sort your page reports by their Page Speed Score to prioritize the largest areas of opportunity on your site. Page reports utilize easy to read visualizations that allow you to quickly focus in on the most important data to improve your sites performance.</p>\n<h4>Report Summaries</h4>\n<p>Report Summaries are a powerful and exclusive feature of Insights from Google PageSpeed. Summaries display your average Page Score, largest areas for improvement across ALL reports, as well as best and lowest performing pages. Report summaries can be filtered to narrow results by: Pages, Posts, Categories, Custom URLs, and Custom Post Types.</p>\n<p>Using Report Summaries allows you to ‘zoom out’ from the page-level and better understand the big picture of your sites performance.</p>\n<h4>Desktop and Mobile Page Reports</h4>\n<p>Best practices for site performance differ greatly between Desktop and Mobile device usage. Configure Insights from Google PageSpeed to generate Desktop reports, Mobile reports, or both!</p>\n<p>Toggle back and forth between report types to see specific suggestions for improving the performance and experience on each platform.</p>\n<h4>Report Snapshots</h4>\n<p>The Report Snapshot tool builds on the power of Report Summaries, to provide historical “Point In Time” data about your website.</p>\n<p>Take a snapshot of any Report Summary screen to store that data for future retrieval. Add comments to your snapshots to provide additional meaning, such as “Before Installing W3 Total Cache.” Additionally, filter a Report Summary before taking a Snapshot to save a summary of the filtered data.</p>\n<h4>Snapshot Comparison Tool</h4>\n<p>The Snapshot Comparison Tool is an amazing utility that lets you visualize side-by-side results from any two similar Report Snapshots.</p>\n<p>Take a Report Snapshot before installing new plugins, or before implementing performance recommendations. Take another snapshot when you are finished and compare your results to measure the effect of your changes.</p>\n<h4>Add/Import Custom URLs</h4>\n<p>Easily add additional URLs for inclusion in Pagespeed Reports. Even add URLs for non-WordPress sites, even if they are not hosted on your server. URLs can be added manually, or upload a properly formatted XML sitemap to add multiple pages at once.</p>\n<p>Custom URLs can be tagged and filtered in Report Summaries. Take Report Snapshots of your Custom URLs just like you would with any other report type.</p>\n<h4>Scheduled Report Checks</h4>\n<p>Configure Insights from Google PageSpeed to automatically recheck your site on a Daily, Weekly, Bi-Monthly, or Monthly basis.</p>\n<p>With each scan, any new pages or posts will be discovered, and existing reports will be updated to reflect any changes to your site, as well as any changes in the Pagespeed recommendations.</p>\n<h4>Additional Languages</h4>\n<ul>\n<li>(v1.x translation) Russian Translation provided by: Ivanka from <a href=\"http://coupofy.com\" rel=\"nofollow ugc\">coupofy.com</a></li>\n<li>(v1.x translation) Spanish Translation provided by: Ogi Djuraskovic from <a href=\"http://firstsiteguide.com\" rel=\"nofollow ugc\">firstsiteguide.com</a></li>\n<li>(v1.x translation) Serbian Translation provided by: Ogi Djuraskovic from <a href=\"http://firstsiteguide.com\" rel=\"nofollow ugc\">firstsiteguide.com</a></li>\n</ul>\n<h3>Troubleshooting</h3>\n<p><strong>Please find the below list of potential issues that you may encounter, and the recommended next steps.</strong></p>\n<h4>I entered my API Key and saved the Options, but no Reports are showing up in the Report List.</h4>\n<ul>\n<li>Google Pagespeed needs to be able to load each page to create its report. Make sure that your pages are publicly accessible over the internet.</li>\n<li>Ensure that your API key is entered correctly, and that you have enabled the &#8220;PageSpeed Insights API&#8221; from the Google API Console.</li>\n<li>In the Options page, under &#8220;Advanced Configuration&#8221; there is a checkbox called &#8220;Log API Exceptions&#8221;. Any API exception that is not caught and handled automatically will be stored for up to 7 days. This log information can be very helpful when diagnosing issues.</li>\n</ul>\n<h4>Page report checks never finish all of the way, I have to press &#8220;Start Reporting&#8221; again and again to get it to finish checking all of my pages.</h4>\n<ul>\n<li>If the reports seem to always run for a certain length of time before stopping unexpectedly, you may be exceeding your servers Max Execution time. Try increasing the value in Options-&gt;Advanced Configuration &#8220;Maximum Execution Time&#8221;.</li>\n<li>Some web hosting providers do not allow the Maximum Execution Time to be overridden or increased. In that case you can try setting the Maximum Script Run Time. This will make the script run for the set period of time, then stop and spawn a new script, to get around timeout issues. Start with a low value, and test. Increase the value one step at a time until you find the largest value that allows your scans to finish successfully.</li>\n</ul>\n<h4>An error was reported while trying to check one of my pages, and it has been added to the Ignored Pages section.</h4>\n<ul>\n<li>Navigate to the Ignored Pages tab, find the page, and click &#8220;reactivate&#8221; to try it again.</li>\n<li>If the page fails again, ensure that the page is publicly accessible from the internet. Non-public pages cannot be checked.</li>\n<li>In some rare cases, pages are not able to be scanned by the Pagespeed API. Try checking your page manually here: https://developers.google.com/speed/pagespeed/insights/. If the page fails to be checked, report the issue to Google so that they can diagnose further.</li>\n</ul>\n<h4>I received a Javascript or PHP error.</h4>\n<ul>\n<li>If the error appeared while Google Pagespeed was checking pages, you may have loaded the page while it was storing data. Refresh the page in a couple seconds to see if the issue has gone away.</li>\n<li>If issues persist please report the problem with as much information as you can gather, including: What page you were on, the exact text of the error, or a screenshot of the error.</li>\n<li>In the Options page, under &#8220;Advanced Configuration&#8221; there is a checkbox called &#8220;Log API Exceptions&#8221;. Any API exception that is not caught and handled automatically will be logged for up to 7 days. This log information can be very helpful when diagnosing issues</li>\n</ul>\n<h4>My Page Scores seem really low. When I click &#8220;Recheck Results&#8221; when viewing Report Details, the score jumps up dramatically.</h4>\n<ul>\n<li>Your server may have been responding slowly when the first report was generated. A slow server response time can have a large impact on your Page Speed Score. If these problems happen frequently you may want to talk with your hosting provider about the problem, or look into alternative hosting providers.</li>\n</ul>\n<h4>I want to clear out all of the current page reports and start over.</h4>\n<ol>\n<li>Navigate to the &#8220;Options&#8221; tab</li>\n<li>Expand the &#8220;Advanced Configuration&#8221; section.</li>\n<li>Find the &#8220;Delete Data&#8221; Dropdown</li>\n<li>Select &#8220;Delete Reports Only&#8221; to remove all Page Reports</li>\n<li>Or Select &#8220;Delete EVERYTHING&#8221; to remove all Page Reports, Custom URLs, Snapshots, and Ignored Pages</li>\n</ol>\n",
    "download_link": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.4.0.8.zip",
    "upgrade_notice": {
        "4.0.8": "<ul>\n<li>Fix PHP 8 warnings</li>\n</ul>",
        "4.0.7": "<ul>\n<li>Add support for XML sitemaps of type text/xml</li>\n<li>Bugfix some error messages not appearing when they should</li>\n<li>Add additional nonce checks for Cross-Site Request Forgery (CSRF) protection</li>\n</ul>",
        "4.0.6": "<ul>\n<li>Additional validating, sanitizing, and escaping the plugin codebase</li>\n</ul>",
        "4.0.5": "<ul>\n<li>Bugfix some validation rule reports not showing properly (some results may need to be rechecked to see the fixes)</li>\n<li>Better styling for readability in report details</li>\n<li>Additional validating, sanitizing, and escaping the plugin codebase</li>\n</ul>",
        "4.0.4": "<ul>\n<li>Bugfix improperly escaped data (xss security issue)</li>\n<li>Rename plugin to &quot;Insights from Google PageSpeed&quot;</li>\n</ul>",
        "4.0.3": "<ul>\n<li>Bugfix loading screenshots &#039;filmstrip&#039; images broken</li>\n</ul>",
        "4.0.2": "<ul>\n<li>Bugfix google has introduced a couple new report types that were not handled by JS templating in this plugin. Added support for the new type and also tried to more gracefully handle this issue if/when this happens again in the future.</li>\n</ul>",
        "4.0.1": "<ul>\n<li>Bugfix removed reference to &#039;legend&#039; template file that was deleted in v4.0.0 and was causing PHP warnings</li>\n</ul>",
        "4.0.0": "<ul>\n<li>NOTICE: This upgrade will remove any existing reports or snapshots created by older versions of this plugin as they are not compatible with the newest version of the pagespeed API (v5)</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/google-pagespeed-insights/assets/screenshot-1.png?rev=780690",
            "caption": "Filter reports by Pages, Posts, Category Indexes, or Custom Post Types. Sort Report Lists by Page Score to see your highest and lowest performing pages."
        },
        {
            "src": "https://ps.w.org/google-pagespeed-insights/assets/screenshot-2.png?rev=780690",
            "caption": "Separate reports for Desktop and Mobile page reports. Check each report to receive platform specific recommendations to increase your sites performance."
        },
        {
            "src": "https://ps.w.org/google-pagespeed-insights/assets/screenshot-3.png?rev=780690",
            "caption": "Configure Google Report Language, Report Types, and choose which WordPress URLs to run reports on."
        },
        {
            "src": "https://ps.w.org/google-pagespeed-insights/assets/screenshot-4.png?rev=780690",
            "caption": "View in-depth report details for recommendations on increasing your sites performance."
        }
    ],
    "tags": {
        "page-speed": "Page Speed",
        "pagespeed": "pagespeed",
        "pagespeed-insights": "pagespeed insights",
        "performance": "performance",
        "seo": "seo"
    },
    "stable_tag": "4.0.8",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.1.0.6.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.2.0.3.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.3.0.1.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.3.0.4.zip",
        "3.0.5": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.3.0.5.zip",
        "4.0.0": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.4.0.0.zip",
        "4.0.0-beta1": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.4.0.0-beta1.zip",
        "4.0.3": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.4.0.3.zip",
        "4.0.4": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.4.0.4.zip",
        "4.0.5": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.4.0.5.zip",
        "4.0.6": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.4.0.6.zip",
        "4.0.7": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.4.0.7.zip",
        "4.0.8": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.4.0.8.zip",
        "trunk": "https://downloads.wordpress.org/plugin/google-pagespeed-insights.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/google-pagespeed-insights/assets/banner-772x250.jpg?rev=780690",
        "high": "https://ps.w.org/google-pagespeed-insights/assets/banner-1544x500.jpg?rev=780690"
    },
    "icons": {
        "1x": "https://ps.w.org/google-pagespeed-insights/assets/icon-128x128.png?rev=1692787",
        "2x": "https://ps.w.org/google-pagespeed-insights/assets/icon-256x256.png?rev=1692787"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 96,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "google-pagespeed-insights",
            "language": "es_ES",
            "version": "4.0.6",
            "updated": "2020-05-16 20:35:28",
            "package": "https://downloads.wordpress.org/translation/plugin/google-pagespeed-insights/4.0.6/es_ES.zip"
        }
    ]
}