{
    "name": "Gravity PDF",
    "slug": "gravity-forms-pdf-extended",
    "version": "6.12.0",
    "author": "<a href=\"https://blueliquiddesigns.com.au\">Blue Liquid Designs</a>",
    "author_profile": "https://profiles.wordpress.org/blue-liquid-designs/",
    "contributors": {
        "blue-liquid-designs": {
            "profile": "https://profiles.wordpress.org/blue-liquid-designs/",
            "avatar": "https://secure.gravatar.com/avatar/9c3e1972b33b6b843f1b3ede61999a18?s=96&d=monsterid&r=g",
            "display_name": "Jake Jackson"
        }
    },
    "requires": "5.3",
    "tested": "6.6.2",
    "requires_php": "7.3",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 305,
        "4": 3,
        "3": 2,
        "2": 2,
        "1": 5
    },
    "num_ratings": 317,
    "support_url": "https://wordpress.org/support/plugin/gravity-forms-pdf-extended/",
    "support_threads": 4,
    "support_threads_resolved": 2,
    "active_installs": 50000,
    "last_updated": "2024-10-16 21:42:00",
    "added": "2012-09-10",
    "homepage": "https://gravitypdf.com",
    "sections": {
        "description": "<p><strong>Gravity PDF is the ultimate self-hosted solution for dynamically creating PDF documents using Gravity Forms and WordPress.</strong></p>\n<h4>Highly Customizable PDFs</h4>\n<p>Out of the box you get four highly-customizable PDF designs. Within minutes, you can personalize the look and feel by adding your company logo, header, footer, paper size / orientation, font, color and size. If the free designs don&#8217;t suit, select from our range of templates in the <a href=\"https://gravitypdf.com/store/#templates\" rel=\"nofollow ugc\">Template Shop</a>, <a href=\"https://gravitypdf.com/bespoke/\" rel=\"nofollow ugc\">go bespoke and have a template build by our team</a>, or <a href=\"https://docs.gravitypdf.com/v6/developers/start-customising\" rel=\"nofollow ugc\">build your own using HTML/CSS/PHP</a>.</p>\n<h4>Send as Email Attachment</h4>\n<p>Gravity PDF can automatically email the PDF to both the admin and the user as soon as the form is completed. You can combine this feature with a Gravity Forms payment add-on <a href=\"https://gravitypdf.com/news/sell-personalized-pdf-documents-using-gravity-forms/\" rel=\"nofollow ugc\">to sell personalized reports, gift certificates, or generate PDF invoices</a>.</p>\n<h4>Privacy, Security, and GDPR</h4>\n<p>Gravity PDF generates PDFs on your web server, and no third-party service receives your sensitive Gravity Forms entry data. <a href=\"https://docs.gravitypdf.com/v6/users/pdf-security\" rel=\"nofollow ugc\">Robust security protects your documents</a>, and <a href=\"https://docs.gravitypdf.com/v6/users/gdpr-and-gravity-pdf\" rel=\"nofollow ugc\">the plugin is GDPR-compliant</a> for our European friends.</p>\n<blockquote>\n<p>Digital document management with WordPress and Gravity Forms just became simple with Gravity PDF!</p>\n</blockquote>\n<h4>Free Feature</h4>\n<ul>\n<li><strong>Unlimited Use, No Restrictions</strong> – There are zero hard limits to the number of PDFs you can configure across all your forms or generate on your entries. Gravity PDF does <strong>NOT</strong> stamp documents with our logo, limit the number of PDFs you can create per month, or purposefully restrict essential functionality to force you to upgrade to a paid plan.</li>\n<li><strong>Privacy and Security</strong> &#8211; your form data is never sent to a third party to generate the PDFs and the documents are generated directly on your web server. <a href=\"https://docs.gravitypdf.com/v6/users/pdf-security#default-security\" rel=\"nofollow ugc\">Strong access control policies are put in place</a> to prevent unauthenticated access to your PDFs.</li>\n<li><strong>Multilingual</strong> – a multitude of languages from across the globe can be displayed in PDFs, include complex scripts like Hebrew, Arabic, Thai, Japanese, Chinese, and Korean.</li>\n<li><strong>Additional Fonts</strong> – match your branding and enhance the overall look and feel of PDFs by install your own fonts.</li>\n<li><strong>Columns</strong> – use <a href=\"https://docs.gravityforms.com/working-with-columns/\" rel=\"nofollow ugc\">Drag and Drop columns</a> in Gravity Forms and <a href=\"https://docs.gravitypdf.com/v6/users/columns\" rel=\"nofollow ugc\">PDFs will automatically mimic that layout</a>.</li>\n<li><strong>Shortcode and Merge Tags</strong> – You can generate a link or URL to PDFs <a href=\"https://docs.gravitypdf.com/v6/users/shortcodes-and-mergetags\" rel=\"nofollow ugc\">using both shortcodes and merge tags</a> so your users can download the PDF right after form submission.</li>\n<li><strong>Export Entries</strong> – include the direct link to any PDF(s) when <a href=\"https://docs.gravitypdf.com/v6/users/include-pdfs-in-entry-export\" rel=\"nofollow ugc\">exporting your form entries</a></li>\n<li><strong>Webhooks Add-on</strong> – <a href=\"https://docs.gravitypdf.com/v6/users/webhooks-support\" rel=\"nofollow ugc\">send the direct PDF link with Webhook requests</a> when using Gravity Forms Webhooks add-on.</li>\n<li><strong>Gravity Flow</strong> – create complex workflows <a href=\"https://gravityflow.io\" rel=\"nofollow ugc\">using Gravity Flow</a> and automatically email Gravity PDF-generated documents at any step in the workflow.</li>\n<li><strong>GravityView</strong> – add links to PDFs when building a members area <a href=\"https://gravityview.co\" rel=\"nofollow ugc\">using GravityView</a> + <a href=\"https://gravityview.co/extensions/advanced-filter/\" rel=\"nofollow ugc\">Advanced Filtering add-on</a>.</li>\n<li><strong>Background Processing</strong> – generating PDFs on form submission can be time consuming. <a href=\"https://docs.gravitypdf.com/v6/users/background-processing\" rel=\"nofollow ugc\">Offload it to a background process</a> will ensure form submissions are processed faster.</li>\n<li><strong>Design PDFs</strong> – developers can build their own PDF templates using HTML, CSS, and PHP <a href=\"https://docs.gravitypdf.com/v6/developers/start-customising\" rel=\"nofollow ugc\">with the help of our developer documentation</a>.</li>\n<li><strong>Documentation and Support</strong> – there is <a href=\"https://docs.gravitypdf.com/v6/users/five-minute-install\" rel=\"nofollow ugc\">extensive documentation</a> covering every feature of Gravity PDF that you can comb through, plus we provide <a href=\"https://gravitypdf.com/support/\" rel=\"nofollow ugc\">free general support to all users</a>.</li>\n</ul>\n<h4>Unlock More Functionality</h4>\n<p>Pay for additional PDF designs and functionality <a href=\"https://gravitypdf.com/store/\" rel=\"nofollow ugc\">from our online store</a>.</p>\n<ul>\n<li><strong>New Designs</strong> – get access to 9 additional universal designs, 6 certificates, 6 invoices, and 3 letter styles</li>\n<li><strong>Additional customizations</strong> – watermark PDFs with your own logo or text, control fields that should be displayed per PDF, add field descriptions, display all checkbox or radio field options, add notes, show field values instead of labels, and hide the product table</li>\n<li><strong>On-screen Preview</strong> – allow users to preview the PDF before form submission (and optionally payment) so they can see what the end result will be. This is a great feature for capturing e-signatures, selling PDF reports /  certificates / gift cards, or providing an on-screen proof before the PDF is sent to the printers (perfect for business cards).</li>\n<li><strong>Bulk Download</strong> &#8211; search, filter, and select entries and then zip up all your PDFs and download all together in a convenient zip file</li>\n<li><strong>Smart Loading Indicator</strong> &#8211; improve the UX for your users when generating complex PDFs that take time to create.</li>\n<li><strong>GravityView</strong> &#8211; turn <a href=\"https://www.gravitykit.com/products/gravityview/\" rel=\"nofollow ugc\">GravityView</a> into a drag-and-drop PDF builder for your Single Entry View Layouts.</li>\n<li><strong>GFChart</strong> &#8211; create PDF reports that display pie, bar, or column charts with aggregate Gravity Forms data <a href=\"https://gfchart.com\" rel=\"nofollow ugc\">using GFChart</a>.</li>\n<li><strong>30-Day Refund Guarantee</strong> – Purchase with confidence knowing when you buy a product from our store that you can get a refund within 30 days, for any reason.</li>\n</ul>\n<h4>Hire the Experts</h4>\n<p>Need a tailor-made solution for Gravity PDF that solves complex business problems? Our team of experienced developers have helped thousands of businesses like yours to accomplish these goals. We can even fill existing PDFs like government forms, without sending your sensitive entry data to a third-party server! <a href=\"https://gravitypdf.com/bespoke/\" rel=\"nofollow ugc\">Find out more</a>.</p>\n<h4>Documentation &amp; Support</h4>\n<p><a href=\"https://docs.gravitypdf.com/v6/users/five-minute-install/\" rel=\"nofollow ugc\">We have extensive documentation on using Gravity PDF</a>, and our friendly support team provides <a href=\"https://gravitypdf.com/support/#contact-support\" rel=\"nofollow ugc\">FREE basic support via GravityPDF.com</a>.</p>\n<h4>Contribute</h4>\n<p>All development for Gravity PDF <a href=\"https://github.com/GravityPDF/gravity-pdf/\" rel=\"nofollow ugc\">is handled via GitHub</a>. Opening new issues or submitting a pull request is welcome.</p>\n<p>Keep up to date with Gravity PDF by <a href=\"https://gravitypdf.com/signup/\" rel=\"nofollow ugc\">subscribing to the newsletter</a>, <a href=\"https://twitter.com/gravitypdf\" rel=\"nofollow ugc\">following us on Twitter/X</a>, <a href=\"https://www.youtube.com/gravitypdf\" rel=\"nofollow ugc\">subscribing to our YouTube channel</a>, and <a href=\"https://www.facebook.com/gravitypdf\" rel=\"nofollow ugc\">liking us on Facebook</a>.</p>\n<p>If you enjoy using the software <a href=\"https://www.g2.com/products/gravity-pdf/reviews\" rel=\"nofollow ugc\">we&#8217;d love it if you could give us a review!</a></p>\n",
        "installation": "<p>Gravity PDF can be run on most modern shared web hosting without any issues. It requires <strong>PHP 7.3+</strong> and at least 128MB of WP Memory. You&#8217;ll also need to be running WordPress 5.3+ and have <a href=\"https://rocketgenius.pxf.io/c/1211356/445235/7938\" rel=\"nofollow ugc\">Gravity Forms 2.5+</a> (affiliate link).</p>\n<p><a href=\"https://docs.gravitypdf.com/v6/users/five-minute-install\" rel=\"nofollow ugc\">You&#8217;ll find detailed installation instructions at docs.gravitypdf.com</a>.</p>\n<p><strong>Disclaimers</strong></p>\n<ul>\n<li>When you activate Gravity PDF on your website and Gravity Forms isn&#8217;t installed a notice will be displayed in the admin area that includes an affiliate link to the Gravity Forms website.</li>\n<li>After activating the plugin you will be prompted to <a href=\"https://docs.gravitypdf.com/v6/users/core-pdf-fonts\" rel=\"nofollow ugc\">run the Core Font Installation tool</a> so Gravity PDF can function correctly. This tool will download the fonts <a href=\"https://github.com/gravityPDF/mpdf-core-fonts\" rel=\"nofollow ugc\">from a public <em>GitHub</em> repository (maintained by Gravity PDF)</a>. For further information about <em>GitHub</em> you can refer to their <a href=\"https://docs.github.com/en/site-policy/github-terms/github-terms-of-service\" rel=\"nofollow ugc\">Terms of Service</a> and/or <a href=\"https://docs.github.com/en/site-policy/privacy-policies/github-privacy-statement#the-short-version\" rel=\"nofollow ugc\">Privacy Statement</a>.</li>\n<li><a href=\"https://docs.gravitypdf.com/v6/users/global-settings#help-tab\" rel=\"nofollow ugc\">A Help page is provided in the plugin&#8217;s settings</a> with an instant search feature <a href=\"https://docs.gravitypdf.com/v6/users/five-minute-install/\" rel=\"nofollow ugc\">of the Gravity PDF documentation</a>, and the search is powered by <em>Algolia</em>. For further information about <em>Algolia</em> you can refer to their <a href=\"https://www.algolia.com/policies/terms/\" rel=\"nofollow ugc\">Terms of Service</a> and/or <a href=\"https://www.algolia.com/policies/privacy/\" rel=\"nofollow ugc\">Privacy Statement</a>.</li>\n</ul>\n",
        "changelog": "<h4>6.12.0</h4>\n<ul>\n<li>Feature: Add basic support for Gravity Forms 2.9 Image Choice and Multiple Choice fields (Gravity PDF Core Booster v2.2 can show the images)</li>\n<li>Feature: Add support for Digital Signature for Gravity Forms plugin (https://wordpress.org/plugins/digital-signature-for-gravity-forms/)</li>\n<li>Housekeeping: Allow approved HTML to be displayed in the PDF for Product and Option field choices</li>\n<li>Housekeeping: Add <code>gfpdf_form_data_products</code> filter to allow entry pricing information to be modified for the PDF</li>\n<li>Bug: Fix column ordering issue in Blank Slate, Focus Gravity, and Rubix when the RTL setting is enabled</li>\n<li>Bug: Allow Password and Privileges PDF setting description to be translated</li>\n</ul>\n<h4>6.11.4</h4>\n<ul>\n<li>Bug: Allow numbers with decimals when saving number fields in the PDF Settings</li>\n</ul>\n<h4>6.11.3</h4>\n<ul>\n<li>Bug: Fix truncated merge tags in HTML attribute when included in PDF setting Rich Text fields</li>\n</ul>\n<h4>6.11.2</h4>\n<ul>\n<li>Bug: Resolve race condition by skipping PDF cleanup at the end of form submission process if PDF Background Processing is enabled</li>\n<li>Bug: Fix issue where some Notifications with PDFs attached were not being handled in a background task when PDF Background Processing is enabled</li>\n</ul>\n<h4>6.11.1</h4>\n<ul>\n<li>Bug: Only process enabled notifications during form submission when using PDF Background Processing. Notifications are enabled if they are active and have conditional logic that passes.</li>\n</ul>\n<h4>6.11.0</h4>\n<ul>\n<li>Housekeeping: Limit pages admin notices are displayed on to reduce notice fatigue</li>\n<li>Housekeeping: Add specific check for the PHP extension <code>Ctype</code> when the plugin loads</li>\n<li>Housekeeping: Tweak admin notice text to make error messages more clear</li>\n<li>Housekeeping: Remove downgrade notice to unsupported Gravity PDF v5.0 if minimum system requirements are not met for v6.0</li>\n<li>Housekeeping: Improve log messages when creating and validating a Signed PDF URL</li>\n<li>Housekeeping: Improve input sanitation for textarea, number, and custom paper size fields when saving the PDF Form Settings</li>\n<li>Housekeeping: Improve PDF Background Processing so its compatible with Gravity Forms native async notification feature</li>\n<li>Housekeeping: Correctly cleanup PDFs after a PDF Background Processing queue runs</li>\n<li>Bug: Enforce a 1pt minimum value for the Default Font Size and Font Size settings</li>\n<li>Bug: Self-heal the PDF signing secret key if it becomes invalid</li>\n<li>Bug: Self-heal the Global PDF Settings if it becomes invalid</li>\n<li>Bug: Prevent the page reloading when selecting a tooltip on PDF settings pages</li>\n<li>Bug: Register language files early so startup errors can be translated</li>\n</ul>\n<h4>6.10.2</h4>\n<ul>\n<li>Bug: Hydrate Nested Forms with Gravity Wiz Populate Anything data</li>\n</ul>\n<h4>6.10.1</h4>\n<ul>\n<li>Bug: Resolve PHP error when processing shortcode with invalid entry object</li>\n<li>Bug: Adhere to conditional logic and exclude CSS class for Page Break fields</li>\n<li>Bug: In more situations the Gravity PDF settings will be refreshed before the form meta is saved to the database</li>\n<li>Housekeeping: Run temporary directory cleanup routine twice daily and delete files older than 12 hours</li>\n<li>Housekeeping: Add gfpdf_system_status_report_items filter for Gravity PDF System Status report details</li>\n<li>Housekeeping: Update mPDF to latest version</li>\n<li>Housekeeping: Allow supported HTML in field labels when displayed in PDF</li>\n</ul>\n<h4>6.10.0</h4>\n<ul>\n<li>Feature: Add native support for the Legal Signature and Legal Consent form fields added by the Legal Signing for Gravity Forms plugin</li>\n</ul>\n<h4>6.9.1</h4>\n<ul>\n<li>Security: Disable the Signed URL feature in the [gravitypdf] shortcode when a URL parameter provides the entry ID (e.g. Page Confirmations)</li>\n<li>Bug: Gracefully handle invalid conditional logic rules when adding date entry meta support</li>\n<li>Bug: Display field for entry metadata PDF conditional rule when there are no form fields compatible with conditional logic</li>\n<li>Bug: Ensure the template cache is correctly cleared when PDF Debug Mode is enabled</li>\n<li>Bug: Flush the template cache after installing new templates via the PDF Template Manager</li>\n<li>Bug: Clear template cache when plugin deactivated</li>\n<li>Housekeeping: Small improvement to performance when reading template and font files from disk</li>\n</ul>\n<h4>6.9.0</h4>\n<ul>\n<li>Feature: Add new conditional logic options to PDFs eg. Payment Status, Date Created, Starred (props: Gravity Wiz)</li>\n<li>Feature: Add support for Show HTML Fields, Show Empty Fields, Show Section Break Description, and Enable Conditional Logic PDF settings when displaying Gravity Wiz Nested Forms field</li>\n<li>Bug: Fix Form Editor saving problem for Gravity Forms v2.6.*</li>\n<li>Bug: Fix Drag and Drop Column layout issue when the GF Styles Pro plugin is enabled</li>\n<li>Bug: Fix issue sending PDF URLs with Gravity Wiz Google Sheets</li>\n<li>Bug: Improve display of Rich Text Textarea fields by removing top margin on individual paragraphs</li>\n<li>Bug: Resolve compatibility issue that corrupted PDFs when using Weglot</li>\n<li>Housekeeping: Exclude popular WordPress staging environments from site count when activating Gravity PDF licenses</li>\n<li>Housekeeping: Improve Gravity PDF license activation success and error messages</li>\n<li>Security: Improve security of network requests to Gravity PDF licensing server</li>\n<li>Developer: Add <code>set_pdf_config( $config )</code> and <code>get_pdf_config()</code> methods to PDF Field classes</li>\n<li>Developer: In the PDF field blacklist, check using the original type and not with <code>$field-&gt;get_input_type()</code></li>\n</ul>\n<h4>6.8.0</h4>\n<ul>\n<li>Feature: Add PDF Download metabox to Gravity Flow Inbox for logged-in users with appropriate capability</li>\n<li>Feature: Add AI-generated translations for French, Spanish, Italian, German, Dutch, Russian, and Chinese</li>\n<li>Security: Only show PDF view/download links on entry list and details page if logged-in user has appropriate capability</li>\n<li>Housekeeping: Improve performance on admin pages by caching the list of available templates</li>\n<li>Housekeeping: When permalinks are enabled, generate the PDF URL with/without a trailing slash</li>\n<li>Bug: Remove whitespace from textarea fields in the PDF settings</li>\n</ul>\n<h4>6.7.4</h4>\n<ul>\n<li>Bug: Resolve PHP error for specific GravityView / GravityChart combo</li>\n<li>Bug: Render supported HTML in labels/choices for the PDF Pricing table</li>\n<li>Bug: Fix PHP error while viewing a PDF when running an older version of WordPress (&lt; 5.9) and PHP (&lt; 8.0)</li>\n</ul>\n<h4>6.7.3</h4>\n<ul>\n<li>Bug: Fix 3rd party conflict when different version of PSR-7 library is loaded</li>\n</ul>\n<h4>6.7.2</h4>\n<ul>\n<li>Bug: Resolve fatal error when using Gravity Forms Google Analytics Pagination feature with the PDF URL included in the parameters.</li>\n<li>Housekeeping: Update PDF library to latest version</li>\n<li>Housekeeping: Update help search API details</li>\n</ul>\n<h4>6.7.1</h4>\n<ul>\n<li>Bug: Improve dependency conflicts with third party plugins who bundle PSR Log v2 or v3</li>\n<li>Housekeeping: Use 4xx HTTP Status Codes for non-server related errors when generating PDFs</li>\n</ul>\n<h4>6.7.0</h4>\n<ul>\n<li>Feature: Add support for multiple PDFs with the same Filename on a single form</li>\n<li>Feature: Use secure links for File Upload and Post Image fields in Core and Universal PDFs</li>\n<li>Dev Feature: Include secure links in $form_data array for File Upload and Post Image fields</li>\n<li>Bug: Fix backwards compatibility error when running a version of Gravity Forms less that 2.6</li>\n<li>Bug: Allow sanitized HTML in the labels of Radio and Checkbox admin settings</li>\n<li>Bug: Remain editing current PDF if a hard refresh occurs after adding a new PDF to the form</li>\n</ul>\n<h4>6.6.1</h4>\n<ul>\n<li>Bug: Prevent PDF settings being override if multiple browser windows are open, and both are updating different settings of the same form concurrently</li>\n<li>Bug: Gracefully handle license key deactivation if an error occurs</li>\n<li>Housekeeping: Bump WordPress Tested Up To v6.3</li>\n</ul>\n<h4>6.6.0</h4>\n<ul>\n<li>Feature: Improve display of ungrouped product fields in Core and Universal templates</li>\n<li>Dev Feature: Add <code>gfpdf_hide_consent_field_if_empty</code> filter, to remove the Consent field from Core and Universal templates if a user hasn&#8217;t consented.</li>\n<li>Bug: Remove Section Break description container is there is not a description included</li>\n<li>Bug: Fix potential PHP error when using GravityView and PDF for GravityView</li>\n<li>Housekeeping: Update PHP and JS dependencies</li>\n</ul>\n<h4>6.5.5</h4>\n<ul>\n<li>Bug: Ensure PDF conditional logic is run through the correct sanitization function upon save</li>\n<li>Bug: Ensure Gravity Wiz Populate Anything live merge tags are correctly processed in the $form_data array</li>\n<li>Bug: Fix Monolog error when running PHP8.1</li>\n</ul>\n<h4>6.5.4</h4>\n<ul>\n<li>Bug: Fix duplicate notifications when using PDF Background Processing while looping over GFAPI::submit_form()</li>\n</ul>\n<h4>6.5.3</h4>\n<ul>\n<li>Bug: Fix HTTP(S) image/stylesheet loading problem in PDFs for SiteGround customers</li>\n</ul>\n<h4>6.5.2</h4>\n<ul>\n<li>Bug: Fix PHP error when a non-string is passed to the Kses sanitizing class</li>\n<li>Bug: Resolve memory problem generating Core PDFs if an HTML element contains more than 10+ classes (field CSS Classes are now truncated to 8 user-defined classes)</li>\n<li>Bug: Fix Slim Image Cropper display problems in Core PDFs</li>\n<li>Housekeeping: Update mPDF to the latest version</li>\n<li>Housekeeping: Update QueryPath to the latest version</li>\n</ul>\n<h4>6.5.1</h4>\n<ul>\n<li>Housekeeping: Update mPDF to the latest version</li>\n<li>Bug: Resolve custom font installation issue for some .ttf files</li>\n</ul>\n<h4>6.5.0</h4>\n<ul>\n<li>Housekeeping: Update Global Extension Settings UI to be Gravity Forms 2.5 compatible</li>\n<li>Housekeeping: Adjust how admin Notices are handled on Gravity PDF pages</li>\n<li>Housekeeping: Update JavaScript package bundle</li>\n<li>Dev: Validate template filename when uploading via the PDF Template Manager (A-Za-z0-9_-)</li>\n<li>Dev: Add filterable CSS class names to the PDF links in the admin area</li>\n<li>Dev: Pass context to the <code>gfpdf_core_template</code> hook</li>\n<li>Dev: Add <code>gfpdf_core_template_{form_id}</code> hook to target specific forms</li>\n<li>Bug: Fix undefined <code>rtl</code> notice in Core PDF templates</li>\n<li>Bug: Fix PHP8.1 notice when saving PDF settings</li>\n</ul>\n<h4>6.4.7</h4>\n<ul>\n<li>Bug: Resolve blank PDF problem when a large HTML block is processed by mPDF</li>\n<li>Bug: Resolve QueryPath deprecation notice about passing null to trim()</li>\n<li>Housekeeping: Update mPDF and URL Signer library to latest version</li>\n</ul>\n<h4>6.4.6</h4>\n<ul>\n<li>Bug: Adjust Nested Forms and Repeater field PDF markup to ensure a unique ID attribute for any HTML tags</li>\n<li>Bug: Prevent duplicate grid css classes being added to Nested Forms HTML tags</li>\n<li>Bug: Process merge tags in Background Image PDF setting before late escaping in the PDF HTML markup</li>\n<li>Housekeeping: Remove initialized message from Gravity PDF logs</li>\n</ul>\n<h4>6.4.5</h4>\n<ul>\n<li>Bug: Fix image display problem if filename had a space in it</li>\n<li>Bug: Fix Background Image display problem on Windows OS</li>\n<li>Developer: Added HTML field content to Repeater Field $form_data array</li>\n</ul>\n<h4>6.4.4</h4>\n<ul>\n<li>Bug: Resolve HTML encoding issue in PDF when displaying Coupon field in Gravity Wiz eCommerce Perk&#8217;s Product Table</li>\n<li>Bug: Remove coupon line item in PDF when Gravity Wiz eCommerce Perk&#8217;s Product Table in use</li>\n<li>Bug: Resolve duplicate product table displayed in a legacy v3 template</li>\n<li>Bug: Resolve PHP notice when displaying product table in legacy v3 template</li>\n<li>Bug: Resolve PHP notice when displaying Section Break field in legacy v3 template</li>\n</ul>\n<h4>6.4.3</h4>\n<ul>\n<li>Bug: Open PDF &#8220;view&#8221; link in a new browser tab on Entry List page</li>\n<li>Bug: Only hide Select field in Core/Universal templates if the saved value is an empty string, not a falsey value</li>\n<li>Bug: Prevent PHP notice when displaying Repeater field in PDFs with a Number sub-field</li>\n<li>Bug: Prevent HTML attribute content from having their entities decoded if they were previously encoded</li>\n<li>Bug: Fix Core/Universal template image display issues on servers running Windows</li>\n</ul>\n<h4>6.4.2</h4>\n<ul>\n<li>Bug: Allow <code>data</code> protocol so Base 64-encoded images can be correctly displayed in Core/Universal templates</li>\n<li>Bug: Fix Core Font Installer problem when running older versions of WordPress (5.3 to 5.8)</li>\n<li>Bug: Fix fatal return type mismatch error if <code>safe_style_css</code> filter has been implemented incorrectly</li>\n</ul>\n<h4>6.4.1</h4>\n<ul>\n<li>Bug: Fix PDF display issues with the Survey, Poll, Post Category, and Post Custom Fields</li>\n</ul>\n<h4>6.4.0</h4>\n<ul>\n<li>Security (Hardening): Move from early escaping to late escaping variables on output</li>\n<li>Security (Hardening): Add additional validation checks to the Core Font installer</li>\n<li>Security (Hardening): Escape text returned from WordPress l10n functions</li>\n<li>Security (Hardening): Escape any and all strings from the Gravity Forms form object, in any context (including PDFs)</li>\n<li>Security (Hardening): Move to earlier sanitizing of user input</li>\n<li>Security (Hardening): Custom PDF template filenames are now limited to the following characters: <code>A-Za-z0-9_-</code></li>\n<li>Security (Hardening): The <code>?html=1</code> and <code>?data=1</code> developer helper parameters now only work in non-production environments (<code>WP_ENVIRONMENT_TYPE !== 'production'</code>), or when Gravity PDF Debug Mode is explicitly enabled</li>\n<li>Security (Hardening): Prevent directory traversal when loading the various Gravity PDF UI components</li>\n<li>Security (Hardening): Change PDF Form Settings capability check from <code>gravityforms_edit_settings</code> to <code>gravityforms_edit_forms</code></li>\n<li>Security (Hardening): Change Font Manager CRUD capability check from <code>gravityforms_view_entries</code> to <code>gravityforms_edit_forms</code></li>\n<li>Security (Hardening): Switch to <code>sodium_crypto_secretbox_keygen()</code> function with modified fallback to <code>wp_generate_password()</code> when generating new PDF URL signing secret key</li>\n<li>Security (Hardening): Switch from a Text to Password field for the Gravity PDF License Keys</li>\n<li>Security (Hardening): Update PHP and JavaScript dependencies</li>\n<li>Developer: Added <code>\\GFPDF\\Statics\\Kses::output($html)</code> and <code>\\GFPDF\\Statics\\Kses::parse($html)</code> methods for use with escaping/sanitizing HTML in PDFs (as an alternative to wp_kses_post()).</li>\n<li>Performance: Register JavaScript in the footer on Gravity PDF admin pages</li>\n<li>Privacy: Added &#8220;Get more info&#8221; link in the Core Font Installer instructions, and disclaimer to plugin&#8217;s README.txt installation section</li>\n<li>Bug: Fix issue passing PDF URL to Gravity Forms Mailchimp add-on</li>\n<li>Bug: Allow hyphen in custom font key when updating or deleting to remain backwards compatible</li>\n<li>Bug: Fix PHP8.1 type conversion warning in the template cache when transient&#8217;s are flushed</li>\n<li>Bug: Remove empty repeater sections from Core PDFs when not filled in by the user</li>\n</ul>\n<h4>6.3.1</h4>\n<ul>\n<li>Security: Prevent potential XSS attack by escaping URL returned from add_query_args() on the PDF List or PDF Form Settings pages</li>\n<li>Developer: Apply <code>gfpdf_current_form_object</code> filter added in 6.3.0 to the form object in Helper_Abstract_Fields.php using the $type <code>helper_abstract_fields</code>.</li>\n<li>Bug: Correctly display the file path in the logs when cleaning up PDFs from disk or flushing the mPDF cache</li>\n<li>Performance: reduce I/O operations when flushing the mPDF cache by excluding the top-level directory</li>\n</ul>\n<h4>6.3.0</h4>\n<ul>\n<li>Feature: Support for mapping PDF URLs to your favorite services using Gravity Forms feeds. This includes (but is not limited to): PayPal, MailChimp, HubSpot, Stripe, Square, ActiveCampaign, Agile CRM, Capsule, CleverReach, Constant Contact, EmailOctopus, Zoho CRM</li>\n<li>Feature: Support for the Zapier add-on: PDF URLs can now be passed to your zaps</li>\n<li>Feature: Add [gravitypdf] shortcode rendering support to Gravity Wiz&#8217;s Entry Block perk</li>\n<li>Housekeeping: Change &#8220;document&#8221; icon used for settings menus to the &#8220;Gravity PDF&#8221; icon</li>\n<li>Housekeeping: duplicating PDFs on a form will now have the correct alternating background color in the table</li>\n<li>Housekeeping: Process the [gravitypdf] shortcode when merge tags get processed so that it can be used where ever merge tags are supported</li>\n<li>Developer: Add new <code>gfpdf_current_form_object</code> filter to manipulate the $form array when processing PDFs</li>\n<li>Bug: Fix a race condition when using Background Processing that could see the PDF deleted before being attached to notifications</li>\n<li>Bug: Do not strip the backslash character when used in PDF settings</li>\n</ul>\n<h4>6.2.1</h4>\n<ul>\n<li>Bug: Always generate a new PDF when using the GPDFAPI::create_pdf() method</li>\n<li>Bug: Fix fatal error during PDF generation when using the <code>gform_address_display_format</code> filter</li>\n</ul>\n<h4>6.2.0</h4>\n<ul>\n<li>Feature: Add support for Gravity Forms 2.6 (see Housekeeping below)</li>\n<li>Housekeeping: Add alternate background color on PDF List page</li>\n<li>Housekeeping: Add styles/support for new merge tag selector</li>\n<li>Housekeeping: Add styles for Copy to Clipboard shortcode button on PDF List page</li>\n<li>Housekeeping: Update help search API to query v6 documentation</li>\n<li>Bug: Fix error message display issue on Form PDF add/edit page</li>\n<li>Bug: Fix missing styles on multi-PDF view/download menu on Entry List page</li>\n</ul>\n<h4>6.1.1</h4>\n<ul>\n<li>Bug: Allow number field to show a thousand separator by using the &#8216;gform_include_thousands_sep_pre_format_number&#8217; filter.</li>\n<li>Bug: Fix PHP Notice when displaying Repeater field caused by processing field&#8217;s not present in <code>$form_data['field']</code> array key</li>\n<li>Housekeeping: Add logging to file/directory cleanup method</li>\n<li>Housekeeping: Add additional checks and logging when processing background tasks</li>\n</ul>\n<h4>6.1.0</h4>\n<ul>\n<li>Feature: Add Copy to Clipboard feature for PDF Shortcode on the PDF List page</li>\n<li>Bug: Fix empty check on the Radio field so a zero (0) value is not considered empty</li>\n</ul>\n<h4>6.0.3</h4>\n<ul>\n<li>Bug: Reduce the Focus Gravity template column widths by a fraction to prevent edge-case display issues (props Hiwire Creative)</li>\n<li>Bug: Fix Help page results text encoding problems</li>\n<li>Bug: Prevent multiple font files being uploaded to a single dropzone</li>\n<li>Bug: When checking if a Radio/Select field is empty in the PDF context, only look at the value property.</li>\n</ul>\n<h4>6.0.2</h4>\n<ul>\n<li>Bug: Fix up 404 link for Outdated Templates in System Status</li>\n<li>Bug: Revert vendor aliasing for mPDF and querypath (back to the original namespace) as it caused more problems than is solved. Developers: see https://docs.gravitypdf.com/v6/users/v5-to-v6-migration#changed-namespace-for-composer-packages</li>\n</ul>\n<h4>6.0.1</h4>\n<ul>\n<li>Bug: When displaying the minimum Gravity Forms version not met error, remove <code>beta-1</code> as the minimum to prevent confusion.</li>\n</ul>\n<h4>6.0.0</h4>\n<p>This major release is designed specifically for Gravity Forms 2.5+ and includes breaking pages that may affect you. You are strongly encouraged to <a href=\"https://docs.gravitypdf.com/v6/users/v5-to-v6-migration\" rel=\"nofollow ugc\">review the upgrade guide before attempting to update to v6</a>.</p>\n<h4>BREAKING CHANGES</h4>\n<ul>\n<li>New minimum requirements PHP7.3+, WordPress 5.3+, Gravity Forms 2.5+</li>\n<li>Removed Gravity PDF v3 template stylesheet (swap legacy PDF template to Focus Gravity template)</li>\n<li>Removed Gravity PDF v3 to v4 migration code (upgrade to v4/v5 before attempting v6 upgrade)</li>\n<li>(Dev) Moved all vendor (Packagist) packages to new <code>GFPDF_Vendor/</code> namespace (BC aliasing for common classes included). Prevents all vendor conflicts with other plugins.</li>\n<li>(Dev) Removed &#8220;Setup Custom Templates&#8221; tool (manually copy over template files to PDF Working Directory)</li>\n<li>(Dev) Removed <code>shortname</code> property from <code>custom_fonts</code> global PDF options, and removed the requirement for the <code>font_name</code> to be unique (use <code>id</code> instead of <code>shortname</code>).</li>\n<li>(Dev) Changed the first parameter $font_name in <code>GPDFAPI::delete_pdf_font()</code> to $font_id instead. You can no longer delete the font by<br />\nits name, as it is no longer a unique identifier.</li>\n<li>(Dev) Majority of admin user interface markup (UI) changed to suit new GF2.5 UI ()</li>\n<li>(Dev) Renamed <code>\\GFPDF\\Helper\\Fields\\Field_CreditCard</code> class to <code>Field_Creditcard</code></li>\n<li>(Dev) Change <code>\\GFPDF\\Model\\Model_Install</code> __construct signature by removing <code>Helper_Abstract_Forms</code> dependancy from the start and adding <code>Model_Uninstall</code> at the end</li>\n<li>(Dev) Change <code>\\GFPDF\\Model\\Model_System_Report</code> __construct signature by adding new <code>Helper_Templates</code> dependancy at the end</li>\n<li>(Dev) Removed <code>\\GFPDF\\View\\View_Settings::system_status</code> method. Replaced by <code>Controller_|Model_|View_System_Report</code> classes for direct integration with Gravity Forms System Status page</li>\n<li>(Dev) Removed undocumented <code>gfpdf_entry_detail_pre_container_markup</code> and <code>gfpdf_entry_detail_post_container_markup</code> actions</li>\n<li>(Dev) Adjusted ID from <code>#tab_pdf</code> to <code>#tab_PDF</code> for container on Global PDF settings page. This ensures both the Global and Form PDF settings use a consistent ID.</li>\n<li>(Dev) Change <code>\\GFPDF\\Model\\Model_Install</code> __construct signature by removing <code>Helper_Abstract_Forms</code> dependancy from the start and adding <code>Model_Uninstall</code> at the end</li>\n<li>(Dev) Change <code>\\GFPDF\\Model\\Model_System_Report</code> __construct signature by adding new <code>Helper_Templates</code> dependancy at the end</li>\n<li>(Dev) Removed <code>\\GFPDF\\View\\View_Settings::system_status</code> method. Replaced by <code>Controller_|Model_|View_System_Report</code> classes for direct integration with Gravity Forms System Status page</li>\n<li>(Dev) Removed undocumented <code>gfpdf_entry_detail_pre_container_markup</code> and <code>gfpdf_entry_detail_post_container_markup</code> actions</li>\n<li>(Dev) Adjusted ID from <code>#tab_pdf</code> to <code>#tab_PDF</code> for container on Global PDF settings page. This ensures both the Global and Form PDF settings use a consistent ID.</li>\n<li>(Dev) Deprecate Helper_Abstract_Options::get_font_short_name(). No direct replacement as the font &#8216;shortname&#8217; has been phased out (using unique ID now).</li>\n<li>(Dev) Updated field description markup to use DIVs instead of SPANs. Matches Gravity Forms RC1</li>\n<li>(Dev) Deprecate these methods from <code>\\GFPDF\\Model\\Model_Install</code>: <code>uninstall_plugin</code>, <code>remove_plugin_options</code>, <code>remove_plugin_form_settings</code>, <code>remove_folder_structure</code>, <code>deactivate_plugin</code>. All moved to <code>Model_Uninstall</code>.</li>\n</ul>\n<h4>NEW FEATURES</h4>\n<ul>\n<li>Brand new admin user interface (UI) to seamlessly match the Gravity Forms (GF) 2.5 UI.</li>\n<li>Added support for new GF columns feature in Core PDFs</li>\n<li>Add PDF column support for Gravity Perks Nested Forms</li>\n<li>Added RTL support for new GF columns feature in Core PDFs</li>\n<li>Refreshed Font Manager with better validation, error handling, and automatic support for fonts that include Open Type Layout features.</li>\n<li>Added new PDF metabox on Entry Details page. Includes a better user experience for forms with a lot of PDFs configured.</li>\n<li>Added new merge tag modifiers :download, :print, :signed, :signed:expiry to enhance existing PDF mergetag (modifiers can all be used in conjunction)</li>\n<li>Add PDF URL to Webhook add-on &#8220;All Fields&#8221; request body</li>\n<li>Add ability to include PDF URLs in Entry exports</li>\n<li>Add Gravity PDF info to Gravity Forms System Status page</li>\n<li>Show plugin downgrade prompt when minimum WordPress, Gravity Forms, or PHP requirements aren&#8217;t met so users can easily roll back to the latest supported v5.x version.</li>\n<li>Add support for WordPress&#8217; native Background Updates</li>\n<li>Add accessibility improvements for keyboard users and screen readers on all Gravity PDF UIs</li>\n<li>Display warning on System Status page when Core template overrides are out of date</li>\n<li>Include Add/Update PDF button below each section on PDF creation page to make it easy to save</li>\n<li>Improve RTL support on admin pages</li>\n</ul>\n<h4>UX IMPROVEMENTS</h4>\n<ul>\n<li>Remove the Always Save PDF setting from the UI.</li>\n<li>Switch all Radio PDF settings to new Toggle setting</li>\n<li>Switch all Multiselect PDF settings to Checkbox field (better accessibility)</li>\n<li>Rename PDF setting &#8220;Name&#8221; to &#8220;Label&#8221;</li>\n<li>Replace asterisk <code>*</code> to text <code>(required)</code> to signify required fields (better accessibility)</li>\n<li>Rename PDF setting &#8220;Orientation&#8221; to &#8220;Paper Orientation&#8221;</li>\n<li>Refine PDF settings descriptions.</li>\n<li>Removed Welcome Page</li>\n<li>Move Paper Size global settings below the Template / Font settings</li>\n<li>Removed rich Select functionality (using Chosen) in UI for greater accessibility</li>\n<li>Remove WP Dialog prompts in UI for greater accessibility</li>\n<li>Move Gravity PDF uninstaller from Tools tab to Gravity Forms Uninstall settings page</li>\n</ul>\n<h4>BUG FIXES</h4>\n<ul>\n<li>Ignore <code>content-type</code> header API response when running the Core Font installer</li>\n<li>Make all <code>GFPDFAPI</code> API class error responses translatable</li>\n<li>Fix PHP8 notice</li>\n<li>Prevent background queue from continuing if retry limit reached on unrecoverable task (like generating the PDF)</li>\n<li>Adjust custom paper size sanitize logic to fix PHP error</li>\n<li>Check for invalid relative date when using Signed PDF URLs and fallback to default timeout</li>\n<li>Fix border display issue in Core Product table</li>\n<li>Show error message in Template Manager when maximum file size limit is reached</li>\n</ul>\n<h4>DEVELOPER IMPROVEMENTS</h4>\n<ul>\n<li>Rewritten all CSS in SASS</li>\n<li>Add <code>GPDFAPI::get_entry_pdfs( $entry_id )</code> method to API. Acts like <code>GPDFAPI::get_form_pdfs( $form_id )</code> but filters out any PDFs that don&#8217;t pass conditional logic checks for the current entry.</li>\n<li>Added <code>Helper_Abstract_Config_Settings</code> class which template config files can extend to automatically have the current PDF settings injected into the class.</li>\n<li>Adjusted some logged items to use less severe alerts (when template config file doesn&#8217;t exist, and when native PDF support for a field doesn&#8217;t exist)</li>\n<li>Upgrade vendor packages to latest versions</li>\n<li>Remove all backbone.js and underscore.js Font Manager code from Gravity PDF admin pages</li>\n<li>Remove gulp as dependency (build is done using only webpack now)</li>\n<li>Add better error log messages for PDF Merge tag processing</li>\n<li>Pass additional information to the <code>gfpdf_field_container_class</code> filter</li>\n</ul>\n<p>See <a href=\"https://github.com/GravityPDF/gravity-pdf/blob/master/CHANGELOG.txt\" rel=\"nofollow ugc\">CHANGELOG.txt</a> for version 5/4/3 changelog history.</p>\n"
    },
    "short_description": "Automatically generate, email and download PDF documents with Gravity Forms and Gravity PDF.",
    "description": "<p><strong>Gravity PDF is the ultimate self-hosted solution for dynamically creating PDF documents using Gravity Forms and WordPress.</strong></p>\n<h4>Highly Customizable PDFs</h4>\n<p>Out of the box you get four highly-customizable PDF designs. Within minutes, you can personalize the look and feel by adding your company logo, header, footer, paper size / orientation, font, color and size. If the free designs don&#8217;t suit, select from our range of templates in the <a href=\"https://gravitypdf.com/store/#templates\" rel=\"nofollow ugc\">Template Shop</a>, <a href=\"https://gravitypdf.com/bespoke/\" rel=\"nofollow ugc\">go bespoke and have a template build by our team</a>, or <a href=\"https://docs.gravitypdf.com/v6/developers/start-customising\" rel=\"nofollow ugc\">build your own using HTML/CSS/PHP</a>.</p>\n<h4>Send as Email Attachment</h4>\n<p>Gravity PDF can automatically email the PDF to both the admin and the user as soon as the form is completed. You can combine this feature with a Gravity Forms payment add-on <a href=\"https://gravitypdf.com/news/sell-personalized-pdf-documents-using-gravity-forms/\" rel=\"nofollow ugc\">to sell personalized reports, gift certificates, or generate PDF invoices</a>.</p>\n<h4>Privacy, Security, and GDPR</h4>\n<p>Gravity PDF generates PDFs on your web server, and no third-party service receives your sensitive Gravity Forms entry data. <a href=\"https://docs.gravitypdf.com/v6/users/pdf-security\" rel=\"nofollow ugc\">Robust security protects your documents</a>, and <a href=\"https://docs.gravitypdf.com/v6/users/gdpr-and-gravity-pdf\" rel=\"nofollow ugc\">the plugin is GDPR-compliant</a> for our European friends.</p>\n<blockquote>\n<p>Digital document management with WordPress and Gravity Forms just became simple with Gravity PDF!</p>\n</blockquote>\n<h4>Free Feature</h4>\n<ul>\n<li><strong>Unlimited Use, No Restrictions</strong> – There are zero hard limits to the number of PDFs you can configure across all your forms or generate on your entries. Gravity PDF does <strong>NOT</strong> stamp documents with our logo, limit the number of PDFs you can create per month, or purposefully restrict essential functionality to force you to upgrade to a paid plan.</li>\n<li><strong>Privacy and Security</strong> &#8211; your form data is never sent to a third party to generate the PDFs and the documents are generated directly on your web server. <a href=\"https://docs.gravitypdf.com/v6/users/pdf-security#default-security\" rel=\"nofollow ugc\">Strong access control policies are put in place</a> to prevent unauthenticated access to your PDFs.</li>\n<li><strong>Multilingual</strong> – a multitude of languages from across the globe can be displayed in PDFs, include complex scripts like Hebrew, Arabic, Thai, Japanese, Chinese, and Korean.</li>\n<li><strong>Additional Fonts</strong> – match your branding and enhance the overall look and feel of PDFs by install your own fonts.</li>\n<li><strong>Columns</strong> – use <a href=\"https://docs.gravityforms.com/working-with-columns/\" rel=\"nofollow ugc\">Drag and Drop columns</a> in Gravity Forms and <a href=\"https://docs.gravitypdf.com/v6/users/columns\" rel=\"nofollow ugc\">PDFs will automatically mimic that layout</a>.</li>\n<li><strong>Shortcode and Merge Tags</strong> – You can generate a link or URL to PDFs <a href=\"https://docs.gravitypdf.com/v6/users/shortcodes-and-mergetags\" rel=\"nofollow ugc\">using both shortcodes and merge tags</a> so your users can download the PDF right after form submission.</li>\n<li><strong>Export Entries</strong> – include the direct link to any PDF(s) when <a href=\"https://docs.gravitypdf.com/v6/users/include-pdfs-in-entry-export\" rel=\"nofollow ugc\">exporting your form entries</a></li>\n<li><strong>Webhooks Add-on</strong> – <a href=\"https://docs.gravitypdf.com/v6/users/webhooks-support\" rel=\"nofollow ugc\">send the direct PDF link with Webhook requests</a> when using Gravity Forms Webhooks add-on.</li>\n<li><strong>Gravity Flow</strong> – create complex workflows <a href=\"https://gravityflow.io\" rel=\"nofollow ugc\">using Gravity Flow</a> and automatically email Gravity PDF-generated documents at any step in the workflow.</li>\n<li><strong>GravityView</strong> – add links to PDFs when building a members area <a href=\"https://gravityview.co\" rel=\"nofollow ugc\">using GravityView</a> + <a href=\"https://gravityview.co/extensions/advanced-filter/\" rel=\"nofollow ugc\">Advanced Filtering add-on</a>.</li>\n<li><strong>Background Processing</strong> – generating PDFs on form submission can be time consuming. <a href=\"https://docs.gravitypdf.com/v6/users/background-processing\" rel=\"nofollow ugc\">Offload it to a background process</a> will ensure form submissions are processed faster.</li>\n<li><strong>Design PDFs</strong> – developers can build their own PDF templates using HTML, CSS, and PHP <a href=\"https://docs.gravitypdf.com/v6/developers/start-customising\" rel=\"nofollow ugc\">with the help of our developer documentation</a>.</li>\n<li><strong>Documentation and Support</strong> – there is <a href=\"https://docs.gravitypdf.com/v6/users/five-minute-install\" rel=\"nofollow ugc\">extensive documentation</a> covering every feature of Gravity PDF that you can comb through, plus we provide <a href=\"https://gravitypdf.com/support/\" rel=\"nofollow ugc\">free general support to all users</a>.</li>\n</ul>\n<h4>Unlock More Functionality</h4>\n<p>Pay for additional PDF designs and functionality <a href=\"https://gravitypdf.com/store/\" rel=\"nofollow ugc\">from our online store</a>.</p>\n<ul>\n<li><strong>New Designs</strong> – get access to 9 additional universal designs, 6 certificates, 6 invoices, and 3 letter styles</li>\n<li><strong>Additional customizations</strong> – watermark PDFs with your own logo or text, control fields that should be displayed per PDF, add field descriptions, display all checkbox or radio field options, add notes, show field values instead of labels, and hide the product table</li>\n<li><strong>On-screen Preview</strong> – allow users to preview the PDF before form submission (and optionally payment) so they can see what the end result will be. This is a great feature for capturing e-signatures, selling PDF reports /  certificates / gift cards, or providing an on-screen proof before the PDF is sent to the printers (perfect for business cards).</li>\n<li><strong>Bulk Download</strong> &#8211; search, filter, and select entries and then zip up all your PDFs and download all together in a convenient zip file</li>\n<li><strong>Smart Loading Indicator</strong> &#8211; improve the UX for your users when generating complex PDFs that take time to create.</li>\n<li><strong>GravityView</strong> &#8211; turn <a href=\"https://www.gravitykit.com/products/gravityview/\" rel=\"nofollow ugc\">GravityView</a> into a drag-and-drop PDF builder for your Single Entry View Layouts.</li>\n<li><strong>GFChart</strong> &#8211; create PDF reports that display pie, bar, or column charts with aggregate Gravity Forms data <a href=\"https://gfchart.com\" rel=\"nofollow ugc\">using GFChart</a>.</li>\n<li><strong>30-Day Refund Guarantee</strong> – Purchase with confidence knowing when you buy a product from our store that you can get a refund within 30 days, for any reason.</li>\n</ul>\n<h4>Hire the Experts</h4>\n<p>Need a tailor-made solution for Gravity PDF that solves complex business problems? Our team of experienced developers have helped thousands of businesses like yours to accomplish these goals. We can even fill existing PDFs like government forms, without sending your sensitive entry data to a third-party server! <a href=\"https://gravitypdf.com/bespoke/\" rel=\"nofollow ugc\">Find out more</a>.</p>\n<h4>Documentation &amp; Support</h4>\n<p><a href=\"https://docs.gravitypdf.com/v6/users/five-minute-install/\" rel=\"nofollow ugc\">We have extensive documentation on using Gravity PDF</a>, and our friendly support team provides <a href=\"https://gravitypdf.com/support/#contact-support\" rel=\"nofollow ugc\">FREE basic support via GravityPDF.com</a>.</p>\n<h4>Contribute</h4>\n<p>All development for Gravity PDF <a href=\"https://github.com/GravityPDF/gravity-pdf/\" rel=\"nofollow ugc\">is handled via GitHub</a>. Opening new issues or submitting a pull request is welcome.</p>\n<p>Keep up to date with Gravity PDF by <a href=\"https://gravitypdf.com/signup/\" rel=\"nofollow ugc\">subscribing to the newsletter</a>, <a href=\"https://twitter.com/gravitypdf\" rel=\"nofollow ugc\">following us on Twitter/X</a>, <a href=\"https://www.youtube.com/gravitypdf\" rel=\"nofollow ugc\">subscribing to our YouTube channel</a>, and <a href=\"https://www.facebook.com/gravitypdf\" rel=\"nofollow ugc\">liking us on Facebook</a>.</p>\n<p>If you enjoy using the software <a href=\"https://www.g2.com/products/gravity-pdf/reviews\" rel=\"nofollow ugc\">we&#8217;d love it if you could give us a review!</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.12.0.zip",
    "upgrade_notice": {
        "6.0.2": "<p>WARNING: Breaking changes! New minimum versions: PHP7.3+, WordPress 5.3+, Gravity Forms 2.5+.</p>",
        "6.0.1": "<p>WARNING: Breaking changes! New minimum versions: PHP7.3+, WordPress 5.3+, Gravity Forms 2.5+.</p>",
        "6.0.0": "<p>WARNING: Breaking changes! New minimum versions: PHP7.3+, WordPress 5.3+, Gravity Forms 2.5+.</p>",
        "5.0.0": "<p>WARNING: Breaking changes! New minimum versions: PHP5.6+, WordPress 4.8+, Gravity Forms 2.3.1+.</p>",
        "4.2.0": "<p>WARNING: The minimum WordPress version supported is now 4.4.</p>",
        "4.0.4": "<p>This patch fixes a PDF security by-passing issue. If you use the PDF Security settings update immediately.</p>",
        "4.0.3": "<p>The core PDF templates have been updated to version 1.1. If you&#039;ve previously run the Custom Template Setup make sure you run it again to take advantage of the changes.</p>",
        "4.0": "<p><strong>WARNING</strong>: This major release is not 100% backwards compatibile with v3. Review our upgrade guide AND do a full backup before proceeding with the update (https://goo.gl/htd6CK).</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-1.png?rev=2522114",
            "caption": "Select various PDF templates (designs), attach to Notification emails, give a unique filename using merge tags, and apply conditional logic to the PDF"
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-2.png?rev=2522114",
            "caption": "Control the paper size, orientation, font, size, and color, and whether to layout the document in RTL mode"
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-3.png?rev=2522114",
            "caption": "Each template (design) has unique settings that allow you to change the appearance. Common settings include: Header, Footer, Background Color and Image, display HTML Fields, the Form Title, and enable Conditional Logic for the fields."
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-4.png?rev=2522114",
            "caption": "Password protect PDFs, format the PDF for long-term archiving (PDF/A-1b) or printing (PDFX-1a), and adjust the access control policies."
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-5.png?rev=2522114",
            "caption": "Zadani is a minimalist business-style PDF design that will generate a well-spaced document great for printing."
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-6.png?rev=2522114",
            "caption": "Rubix uses stylish containers to create an aesthetically pleasing PDF design."
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-7.png?rev=2522114",
            "caption": "Focus Gravity providing a classic layout which epitomises Gravity Forms Print Preview. It’s the familiar layout you’ve come to love in PDF format."
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-8.png?rev=2522114",
            "caption": "Blank Slate provides a print-friendly PDF design focused solely on the user-submitted data."
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-9.png?rev=2522114",
            "caption": "View individual PDFs on Gravity Forms Entry List page."
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-10.png?rev=2522114",
            "caption": "A flyout menu is shown when multiple PDFs are configured on a form when viewing on the Entry List page."
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-11.png?rev=2522114",
            "caption": "View or Download PDFs on the Gravity Forms Entry Details page from the <em>PDFs</em> metabox."
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-12.png?rev=2522114",
            "caption": "The Font Manager allows you to add, update, search, select, and delete custom fonts for use with Gravity PDF."
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-13.png?rev=2522114",
            "caption": "Design your own PDF templates and install via the PDF Template Manager. Or purchase a design from our online store."
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-14.png?rev=2522114",
            "caption": "Get detailed info about the state of Gravity PDF on your site from Gravity Forms System Status page"
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-15.png?rev=2522114",
            "caption": "Easily uninstall and delete all Gravity PDF data from your website"
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-16.png?rev=2522114",
            "caption": "A bunch of paid PDF designs are available, as well as additional functionality."
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-17.png?rev=1461821",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gravity-forms-pdf-extended/assets/screenshot-18.png?rev=1461821",
            "caption": ""
        }
    ],
    "tags": {
        "contact-form": "contact form",
        "email": "email",
        "form": "form",
        "gravity-forms": "gravity forms",
        "pdf": "pdf"
    },
    "stable_tag": "6.12.0",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.1.0.0.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.1.2.3.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.2.0.0.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.2.2.3.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.3.0.1.zip",
        "3.7.8": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.3.7.8.zip",
        "4.5.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.4.5.1.zip",
        "5.0.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.0.0.zip",
        "5.0.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.0.1.zip",
        "5.0.2": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.0.2.zip",
        "5.1.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.1.0.zip",
        "5.1.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.1.1.zip",
        "5.1.2": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.1.2.zip",
        "5.1.3": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.1.3.zip",
        "5.1.4": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.1.4.zip",
        "5.1.5": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.1.5.zip",
        "5.2.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.2.0.zip",
        "5.2.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.2.1.zip",
        "5.2.2": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.2.2.zip",
        "5.3.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.3.0.zip",
        "5.3.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.3.1.zip",
        "5.3.2": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.3.2.zip",
        "5.3.3": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.3.3.zip",
        "5.3.4": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.3.4.zip",
        "5.3.5": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.3.5.zip",
        "5.4.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.4.0.zip",
        "5.4.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.4.1.zip",
        "5.4.2": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.5.4.2.zip",
        "6.0.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.0.0.zip",
        "6.0.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.0.1.zip",
        "6.0.2": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.0.2.zip",
        "6.0.3": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.0.3.zip",
        "6.1.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.1.0.zip",
        "6.1.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.1.1.zip",
        "6.10.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.10.0.zip",
        "6.10.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.10.1.zip",
        "6.10.2": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.10.2.zip",
        "6.11.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.11.0.zip",
        "6.11.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.11.1.zip",
        "6.11.2": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.11.2.zip",
        "6.11.3": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.11.3.zip",
        "6.11.4": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.11.4.zip",
        "6.12.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.12.0.zip",
        "6.12.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.12.1.zip",
        "6.2.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.2.0.zip",
        "6.2.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.2.1.zip",
        "6.3.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.3.0.zip",
        "6.3.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.3.1.zip",
        "6.4.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.4.0.zip",
        "6.4.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.4.1.zip",
        "6.4.2": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.4.2.zip",
        "6.4.3": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.4.3.zip",
        "6.4.4": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.4.4.zip",
        "6.4.5": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.4.5.zip",
        "6.4.6": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.4.6.zip",
        "6.4.7": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.4.7.zip",
        "6.5.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.5.0.zip",
        "6.5.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.5.1.zip",
        "6.5.2": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.5.2.zip",
        "6.5.3": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.5.3.zip",
        "6.5.4": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.5.4.zip",
        "6.5.5": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.5.5.zip",
        "6.6.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.6.0.zip",
        "6.6.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.6.1.zip",
        "6.7.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.7.0.zip",
        "6.7.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.7.1.zip",
        "6.7.2": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.7.2.zip",
        "6.7.3": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.7.3.zip",
        "6.7.4": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.7.4.zip",
        "6.8.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.8.0.zip",
        "6.9.0": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.9.0.zip",
        "6.9.1": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.6.9.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/gravity-forms-pdf-extended.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://gravitypdf.com/donate-to-plugin/",
    "banners": {
        "low": "https://ps.w.org/gravity-forms-pdf-extended/assets/banner-772x250.png?rev=3168987",
        "high": "https://ps.w.org/gravity-forms-pdf-extended/assets/banner-1544x500.png?rev=3168987"
    },
    "icons": {
        "1x": "https://ps.w.org/gravity-forms-pdf-extended/assets/icon-128x128.png?rev=3168987",
        "2x": "https://ps.w.org/gravity-forms-pdf-extended/assets/icon-256x256.png?rev=3168987"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "gravity-forms-pdf-extended",
            "language": "es_ES",
            "version": "6.12.0",
            "updated": "2024-10-16 10:22:58",
            "package": "https://downloads.wordpress.org/translation/plugin/gravity-forms-pdf-extended/6.12.0/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "gravity-forms-pdf-extended",
            "language": "it_IT",
            "version": "6.12.0",
            "updated": "2022-07-26 23:49:31",
            "package": "https://downloads.wordpress.org/translation/plugin/gravity-forms-pdf-extended/6.12.0/it_IT.zip"
        }
    ]
}