{
    "name": "Signature Add-On for Gravity Forms",
    "slug": "gravity-signature-forms-add-on",
    "version": "1.8.4",
    "author": "<a href=\"https://www.approveme.com/\">ApproveMe.com</a>",
    "author_profile": "https://profiles.wordpress.org/approveme/",
    "contributors": {
        "approveme": {
            "profile": "https://profiles.wordpress.org/approveme/",
            "avatar": "https://secure.gravatar.com/avatar/620cf850230b2d03a2cf5763c9727998?s=96&d=monsterid&r=g",
            "display_name": "approveme"
        }
    },
    "requires": "4.5",
    "tested": "6.5.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 78,
    "ratings": {
        "5": 14,
        "4": 1,
        "3": 1,
        "2": 0,
        "1": 5
    },
    "num_ratings": 21,
    "support_url": "https://wordpress.org/support/plugin/gravity-signature-forms-add-on/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 113445,
    "last_updated": "2024-05-21 16:29:00",
    "added": "2015-09-10",
    "homepage": "http://aprv.me/2lfrDYG",
    "sections": {
        "description": "<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Try a demo of the Signature Add-on for Gravity Forms Here</a></strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/dpNTG_P7bXY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><em>Please note you will need the following plugins installed to completely automate the collection of contracts using Gravity Forms and WP E-Signature.</em><br />\n1. <a href=\"http://aprv.me/1TAspLi\" rel=\"nofollow ugc\">Gravity Forms</a><br />\n2. <a href=\"https://www.approveme.com/gravity-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">WP E-Signature</a> (Elite or Lifetime license)<br />\n3. <a href=\"https://www.approveme.com/wpesign-features/stand-alone-documents/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Stand Alone Document</a> (comes with above licenses)</p>\n<p>*A Elite or Lifetime license is required and can be purchased at <a href=\"http://aprv.me/2lOpn7l\" rel=\"nofollow ugc\">www.approveme.com</a></p>\n<p><strong>What would you do if you found out the contracts you use to run and operate your business were not legally binding?</strong></p>\n<p>What if you and your client were in a courtroom only to find out that the digital signature used on your contract was not signed with a compliant e-signature application? </p>\n<p><strong>The legal industry is a highly regulated industry that has strict laws and regulations around the electronic signature and digital signature submission process.</strong></p>\n<h4>How is this Signature Add-On different than the Gravity Forms Signature Add-on by Rocket Genius?</h4>\n<p>WordPress Form Plugins like Gravity Forms are absolutely fantastic! You can create some amazing and incredible WordPress workflows using their powerful WordPress Forms plugin; However, <em>signing a legally binding contract is NOT Gravity Forms main focus</em> (it is WP E-Signature’s SOLE focus). We have spent years developing a platform that adheres to the strict <a href=\"https://www.approveme.com/ueta-and-esign-act?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">UETA and ESIGN</a> national and international document signing guidelines.</p>\n<p>Most WordPress contract plugins and signature add-ons out there are not legally binding let alone UETA/ESIGN compliant (they do not adhere to the strict laws and regulations in the document singing industry). These typical signature add-ons, only “capture signature information as it is drawn and sends data to your web server where this information is converted into a PNG image and stored on your server.”</p>\n<p>This method, exposes you and your signers legal signature on the ftp server where your WordPress website lives. <strong>In other words the png files most signature add-ons generate, of your client’s hand drawn legal signature (the same signature which is used to buy a house, apply for a credit card, take out a business loan) is available to ANY ftp intruder; putting both you and your signer at high risk for identity theft.</strong></p>\n<p>This Signature Plugin fills in the gap by making the e-signature process compliant with UETA/ESIGN regulations.</p>\n<p><strong>The new signature add-on by <a href=\"http://www.secure.approveme.com/demo/gravity-forms-demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Approve Me</a> is the bridge between a form generation plugin and having a UETA / ESIGN compliant document signing application that lives on your WordPress website.</strong></p>\n<p>Watch the video above to see how you can save time and money by completely automating contracts for your web design, photography, consulting or freelance business using our <strong>Signature Add-On for Gravity Forms</strong>.</p>\n<p>WP E-Signature by ApproveMe focuses 100% on legally binding contract signing (UETA &amp; ESIGN compliant). No monthly fees. So you can use your website to sign contracts. It is by far the most customizable document singing application built for WordPress.</p>\n<p>ApproveMe’s WP E-Signature adhere’s to the strictest electronic signature and digital signature regulations by encrypting, storing, and protecting your data in such in a way that is damn near difficult to retrieve from a database let alone manipulate a contract.</p>\n<p>If the validity of a signature were to ever get questioned in a court room you would have peace of mind knowing that both you and your signer are protected by the ApproveMe verified seal.</p>\n<p>If you’re wanting even more out of WP E-Signature, we have it! There are TONS of advanced features available for our Elite or Lifetime license holders. Our WordPress Contract Plugin is by far the easiest way to integrate a court recognized Gravity Forms Approval process into your WordPress website.</p>\n<p><strong>Signature Add-On for Gravity Forms by <a href=\"http://www.secure.approveme.com/demo/gravity-forms-demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Approve Me</a> allows you to capture court recognized signatures immediately after a user submits a Gravity Form by either emailing or redirecting the users that recently filled out your gravityform to a unique contract or agreement made specific for that user, requiring them to draw (or type) their electronic signature using a touchscreen device, touch pads or even a mouse.</strong></p>\n<p><em>With <a href=\"https://www.approveme.com/gravity-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">WP E-Signature</a> (Elite or Lifetime) and this Digital Signature for GravityForms plugin you can automatically generate a contract for your customers to sign based on their form results from a Gravity Forms.</em></p>\n<p><strong>That’s just the start. Once customers sign…</strong></p>\n<p><em>…you and the customer will automatically receive a PDF of their signed contract.</em></p>\n<p><em>…no need to register on an outside website (all signatures happen without leaving your site)</em></p>\n<p><em>… you’ll have a 100% legally compliant signature on file to protect you AND the customer (according to UETA/ESIGN guidelines).</em></p>\n<h3>This e-signature add-on transforms your WordPress website into a court-recognized document signing application (but without the monthly fees&#8230; and with unlimited users).</h3>\n<ul>\n<li>Perfect for those wanting to automate the collection of signatures on proposals, estimates, timesheets, terms of service agreements, new client contracts, waiver forms and more!</li>\n</ul>\n<p>Automatically require your WordPress visitors to sign a legally binding agreement after submitting a gravity form.</p>\n<p>Quickly and easily add court recognized contract signing capabilities into your WordPress website using this Signature Add-on for Gravity Forms and ApproveMe’s WP E-Signature (Elite or Lifetime license). Gone are the days of sending your signers to an unrelated third party website just so they can sign your web design, photography, consulting or freelance contract. The form submitter will never have to leave your website or heaven forbid install any special browser plugins, add-ons or extensions to sign your contract.</p>\n<p>With ApproveMe’s WP E-Signature and their new Signature Add-On for Gravity Forms you can create a legally binding contract that is tailored 100% to the user that just submitted your Form.</p>\n<p><strong>Do the smart thing.  Don’t get caught in a courtroom with a document that’s not legally binding.</strong></p>\n<p><strong>Transform one single page of your existing WordPress website into a secure document and electronic signature application.  WP Digital E-Signature by ApproveMe, is a legally binding WordPress Contract Plugin, that’s easy to use.</strong></p>\n<p>WP E-Signature has a very extensive e-signature premium add-on library with dozens of expandable and customizable <a href=\"https://www.approveme.com/wpesign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">e-signature automations</a> and <a href=\"https://www.approveme.com/esign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">third-party integrations</a> to further enhance your custom document signing needs.</p>\n<p>The Signature Add-On works on all major desktop and mobile browsers. This includes IE, FireFox, Safari, Chrome, Opera, iOS, Android, and WebOS.</p>\n<p>In additional to being incredibly easy to use, ApproveMe’s Signature Add-on for Gravity Forms WordPress can automatically insert data that was submitted from a Gravity Form into a UETA/ESIGN compliant and court recognized contract using your very own WordPress website.</p>\n<p>So if you have a dropdown menu in your Gravity Form called “Web Design Package” and you offer a few different packages (each with a different price point) you can easily create a contract that includes the package details of an order in the contract that gets sent to your Gravity Form end-user.</p>\n<p>WP E-Signature is significantly different than the current signature add-on offered by Gravity Forms as it gives Gravity users the power (and leverage) to host their own document signing application that hooks into Gravity Form results and triggers on-demand legal contracts (that are compliant with all the document signing e-signature laws and regulations).</p>\n<p><strong>Automatically Trigger Contracts To Be Sent</strong>Once a user submits a gravity form you can automatically trigger a Contract to either be sent via email or to be the very next page the Gravity Form Submitter sees when they submit their form.</p>\n<p><strong>Connect Gravity Forms With Wp E-Signature</strong>This Signature Add-On for Gravity Forms will combine the powerful features of gravity forms with the relentless fury of features from WP E-Signature.</p>\n<p><strong>Add Gravity Form Field Values Into A Wp E-Signature Contract</strong>With Signature Add-On for Gravity Forms you can easily insert submitted form results into a contract that gets triggered automatically once a user completes a Gravity Form submission.</p>\n<p><strong>Redirect User To Wp E-Signature Contract After Gravity Form Submission</strong>Once a user successfully completes a Gravity Form Submission they are automatically redirected the contract of your choice using this premium E-Signature add-on.</p>\n<p><strong>Email A User A Contract Once They Fill Out A Gravity Form</strong>After successful form submission you can choose to email the form submitter (or another user if the other users email and name was in the gravity form that was just completed).</p>\n<p><strong>Signing Reminder Emails</strong>If a user has not yet signed the agreement that you were requiring them to sign after submitting your gravity form, you can automatically activate signing reminder emails where you can choose the trigger date, the frequency of reminder emails, and the expiration date of the signing reminder emails.</p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Try a demo of the Signature Add-on for Gravity Forms Here</a></strong></p>\n<h4>Strength &amp; flexibility</h4>\n<p>WP E-Signature is built using WordPress best practices both on the front and the back end. This results in an efficient, robust and easy-to-use plugin.</p>\n<h4>Legally Binding</h4>\n<p>WP E-Signature is recognized in court. We are <a href=\"http://www.ncsl.org/research/telecommunications-and-information-technology/uniform-electronic-transactions-acts.aspx\" rel=\"nofollow ugc\">(UETA)</a> and <a href=\"http://www.fdic.gov/regulations/compliance/manual/pdf/X-3.1.pdf\" rel=\"nofollow ugc\">(ESIGN)</a> compliant and adhere to some of the strictest document signing polices in the US and European unions.</p>\n<h4>Electronic Signature Security and Encryption</h4>\n<p>Security is our priority. All of your signed documents and signatures are kept hidden and encrypted on your server using a secure encryption sequence and signer specific URL.  Additionally you have the option of forcing SSL security (when an SSL certificate is installed on your server) for all WP E-Signature related pages.</p>\n<h4>Signer Audit Trail &amp; Reporting</h4>\n<p>Documents move turbo speed from signer to signer. We include a detailed audit report with viewer details, ip addresses, analytics and signer history. <a href=\"https://www.approveme.com/wordpress-audit-trail-e-signature-certificate/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">See how the audit trail can protect you and your signers</a></p>\n<h4>Document Signing Automation</h4>\n<p>If you do business online, customers probably have to sign an agreement or an online contract. Problem is a paper agreement doesn’t hold up if your business is an online business and your customers are online customers. You can try mailing or even scanning a contract to your digital customers which costs you time and money, in the meantime you have the risk of losing your customer because of the added delay.</p>\n<p>What you need is WP E-Signature. WP E-Signature lets you customize the signing process for what you need with no monthly fees. With a comprehensive marketplace of add-on extensions including Save as PDF, Dropbox Sync, Signer Input Fields, and dozens more which make it easy to automate and customize your document signing process.</p>\n<p>WP E-Signature works with any WordPress website, including the default WordPress themes. If you need help installing WordPress E-Signature check out our <a href=\"https://wpe.approveme.com/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">getting started docs</a> and start signing documents using your WordPress website.  Looking to get WordPress Proposals signed?  We got you covered!</p>\n<p>If you&#8217;re looking for a tailored WordPress eSigning integration or add-on designed specifically to be used for your document signing needs be sure to browse the official <a href=\"https://www.approveme.com/wpesign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">WP E-Signature Business Add-On Extensions</a> which come with an Lifetime or Elite license.   If you don’t see the integrations you need… let us know.</p>\n<p>You could also use a third party document signing service but they charge monthly fees and what’s worst, your customers are forced to create an account on an unrelated website just to sign your companies documents.</p>\n<h4>e-signature WordPress Features</h4>\n<p>Whether you&#8217;re operating a wedding photography business a membership based website, or a just a small web design agency in need of clients signing your website terms of service WP E-Signature has you covered. You can read all about ‘WP E-Signature’ features on the <a href=\"https://www.approveme.com/gravity-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">ApproveMe website</a>.</p>\n<h4>Customizable</h4>\n<p>Your business is unique, your online document signing process should be too. Choose from many of our <a href=\"https://www.approveme.com/wpesign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">e-signature workflows</a> best of all e-signature is hosted using your WordPress website.</p>\n<h4>Tablet &amp; Smart Phone Friendly</h4>\n<p>Upload documents via WordPress dashboard and collect real client signatures through your website using ApproveMe’s <a href=\"https://www.approveme.com/gravity-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">WordPress Contract Plugin</a>. Users sign documents online using their mouse, trackpad, tablet, or phone.</p>\n<h4>No Monthly Fees</h4>\n<p>WP E-Signature is the easiest and most affordable way to sign documents online using WordPress. You have full control over your data – it never leaves your server. Built exclusively for WordPress.</p>\n<h4>More About Gravity Forms</h4>\n<p>Gravity Forms is a premium featured advanced drag and drop, email notification routing, lead generation and capturing, conditional logic wielding, WordPress forms plugin that offers the ability to create WordPress posts from front-end hosted forms.</p>\n<h3>Need Support?</h3>\n<p>So we can better serve you and to avoid support tickets getting lost in outer space we try to provide world-class support via our website.</p>\n<p><strong>We do not offer support on the wordpress.org forum.</strong></p>\n<p>To create a support ticket please login to your account <a href=\"https://www.approveme.com/sign-in/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">www.approveme.com/support</a> and we look forward to helping you resolve your issue.</p>\n<p>If you have any other non-support related questions about ApproveMe’s WP E-Signature you’re welcome to ask any pre-sale questions from our <a href=\"https://www.approveme.com/letschat/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">contact form page</a>.</p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p>To view a live Gravity to WP E-Signature demo you can check one out at:</p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Try Gravity Forms + WP E-Signature Demo Here</a></strong></p>\n<h3>Additional Info</h3>\n<h3>Other notable PDF features and workflows for Signature Add-On for Gravity Forms plugin</h3>\n<ul>\n<li>Completely automate the signature collection process for your freelance or small business</li>\n<li>A copy of the signed agreement can be downloaded as a PDF from your website</li>\n<li>A Signed PDF can be synced with your Dropbox account</li>\n<li>An attached court recognized PDF can be emailed to both the signer and yourself</li>\n</ul>\n<p><strong>All documents are encrypted and stored on your WordPress website (not somebody else’s)</strong></p>\n<p>Learn more about the WP E-Signature document security here: (https://www.approveme.com/security-ueta-e-sign-protection/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms)</p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p><em>A valid WP E-Signature business license is required for this Gravity Forms Signature plugin to work.  You can easily purchase yours at (https://www.approveme.com/gravity-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms)</em></p>\n<p><strong>No Monthly Fees • UETA &amp; ESIGN Compliant • Legally Binding • Money Back Guarantee</strong></p>\n<h3>INSTALLATION COMPLETE!</h3>\n<p>All signed agreements can be saved as a PDF, attached to an email, automatically synced to a Dropbox account and more!  You decide how this should work!</p>\n<p><em>A valid <a href=\"https://www.approveme.com/gravity-forms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Elite or Lifetime</a> is required for Gravity Forms Signature plugin by ApproveMe to properly work</em></p>\n<p><strong><a href=\"https://www.approveme.com/gravity-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Get Your ApproveMe License Now</a></strong></p>\n",
        "installation": "<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/dpNTG_P7bXY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>How it Works:</h3>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Try a demo of the Signature Add-on for Gravity Forms Here</a></strong></p>\n<ul>\n<li>The Signature Add-On for Gravity Forms plugin is incredibly easy to setup. Once you have a valid ApproveMe business license you can easily (and automatically) generate a legally binding (court recognized) contract using submitted GravityForm data and require your Gravity Form submitter sign your WordPress contract.*</li>\n</ul>\n<p>This plugin is fantastic for Freelancers, Web Designers, Photographers and Small Business owners that are looking to streamline their contract creation process.</p>\n<h3>Follow these easy Gravity Forms Digital Signature Plugin steps to get started</h3>\n<p><strong>Step 1:</strong><br />\nApproveMe&#8217;s WP E-Signature requires a few more plugins/add-ons so you can unlock the power and automate Gravity Forms and legally binding Digital Signatures. You&#8217;ll need to download the following:</p>\n<p><em>Please note you will need the following plugins installed to completely automate the collection of contracts using Gravity Forms and WP E-Signature.</em></p>\n<ol>\n<li><a href=\"http://aprv.me/1TAspLi\" rel=\"nofollow ugc\">Gravity Forms</a></li>\n<li><a href=\"http://aprv.me/2lfrDYG\" rel=\"nofollow ugc\">WP E-Signature</a> (Elite or Lifetime license)</li>\n<li><a href=\"http://aprv.me/2lfrDYG\" rel=\"nofollow ugc\">Stand Alone Document</a> (comes with above licenses)</li>\n</ol>\n<p>*A Lifetime or Elite license is required and can be purchased at <a href=\"https://www.approveme.com/gravity-forms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">www.approveme.com</a></p>\n<p><strong>Step 2:</strong><br />\n<em>Enter your ApproveMe license</em><br />\nOnce you have purchased a business license from ApproveMe you will need to enter your license key to activate updates and support.</p>\n<p>To download your license key you can log into your <a href=\"https://www.approveme.com/purchase-history?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">ApproveMe account</a> here (password was emailed with your receipt)</p>\n<p><strong>Step 3:</strong><br />\n<em>Create a blank WordPress page</em><br />\nAfter the ApproveMe plugins are installed and your settings saved you will need to create a blank/empty WordPress page for each Stand Alone Document (or agreement) that you will be creating.</p>\n<p>To learn about Stand Alone Documents you can visit this <a href=\"https://wpe.approveme.com/article/156-basic-document-vs-stand-alone-document?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">helpful article</a></p>\n<p><strong>Step 4:</strong><br />\n<em>Create a Stand Alone Document</em><br />\nOk you&#8217;re doing great! You&#8217;re almost there&#8230; now that you&#8217;ve created a blank WordPress page we need to create a Stand Alone Document and then attach that WordPress page to our Stand Alone Document.</p>\n<p>To learn more about Stand Alone Documents checkout the <a href=\"https://wpe.approveme.com/article/137-stand-alone-documents-add-on?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">documentation page</a> for this add-on.</p>\n<p><strong>Step 5:</strong><br />\n<em>(optional) Insert Gravity Form User Data into a Contract</em></p>\n<p>This step will vary based on your desired outcome. Digital signature by Approve Me is triggered when a Gravity Form is submitted. This add-on gives you the ability to integrate Gravity Form user data (that was inputted from the user when the form was submitted) into a new contract that will either be emailed to the user or will be displayed to the user after they submit you form.</p>\n<p>To insert data into a Gravity Form, you will need the <a href=\"https://www.approveme.com/wpesign-features/signer-input-fields/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Custom Fields</a> feature enabled by ApproveMe (it’s included with your license).</p>\n<p><strong>How to add form fields data into a contract using Gravity Forms</strong></p>\n<p>Navigate to the Signer Input Fields/Custom Fields icon and select &#8220;Gravity Form Data&#8221;.</p>\n<p>Select the Gravity Form that you have already created (and would like to connect to your contract) using the dropdown menu.<br />\nChoose the field data that you would like to insert into your new contract.</p>\n<p>A shortcode will be generated with this information. Don&#8217;t worry though, the actual field value that your user enters will be displayed in its place once they signing your contract.</p>\n<p>This is an example of the auto-generated shortcode that will get inserted into the document you are creating after you select your desired field data from your Gravity Form.</p>\n<p>[esiggravity formid=&#8221;3&#8243; field_id=&#8221;1&#8243; ]</p>\n<p>You can move the shortcode that gets generated automatically, anywhere in your contract and it will display the user&#8217;s submitted data wherever you have the shortcode located in your contract.</p>\n<p><strong>Step 6:</strong><br />\n<em>Choose your document options and save settings</em></p>\n<p>After you have entered all of your desired contract text and have connected your desired Gravity Forms field results to your Stand Alone Document, you are ready to choose/define your document options.</p>\n<p>Please Note: Before you can publish your contract, you will also need to connect your Stand Alone Document with the blank WordPress page you created earlier for your contract. You can do so by searching for and selecting the page from the &#8220;Display on this page&#8221; dropdown menu located under the &#8220;Document Options&#8221; section.</p>\n<p><strong>Step 7:</strong><br />\n<em>Almost there&#8230; you&#8217;re 50% complete</em><br />\nOnce you&#8217;ve published your Stand Alone Document you are 50% complete. The next step is you will need to choose your &#8220;trigger&#8221; and &#8220;action&#8221; options for this document in gravity forms.</p>\n<p>Click LET&#8217;S GO NOW! to define those last Gravity Form settings.</p>\n<p><strong>Step 8:</strong><br />\n<em>Finish setting up the Gravity Form workflow/trigger</em></p>\n<p>You&#8217;re so close to being finished! Now you just need to choose your contract and the your desired actions for when this workflow is triggered.</p>\n<p>Navigate to the &#8220;Forms&#8221; tab found in the WordPress dashboard.</p>\n<p>Choose the form that you attached the Stand Alone Document.</p>\n<p>Select the &#8220;WP E-Signature&#8221; option found in the form settings and define the remainder settings.</p>\n<p>That&#8217;s it!</p>\n<p>To view a live Gravity to WP E-Signature demo you can check one out at:<br />\n<strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Try Gravity Forms Signature Demo Here</a></strong></p>\n",
        "faq": "\n<dt id='can%20i%20collect%20legally%20binding%20court%20recognized%20contracts%20from%20my%20wordpress%20website%20after%20someone%20submits%20a%20gravity%20form%3F'>\nCan I collect legally binding court recognized contracts from my WordPress website after someone submits a Gravity Form?\n</h4>\n<p>\n<p>With Signature Add-on for Gravity Forms  by ApproveMe, along with a <a href=\"https://www.approveme.com/gravity-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">WP E-Signature</a> Lifetime or Elite license you can easily collect <a href=\"https://www.approveme.com/ueta-and-esign-act/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">UETA/ESIGN compliant</a> signatures from your visitors after they submit a Gravity Form on your website.</p>\n<p><strong>You can even pass details from the submitted Gravity Form into your WordPress contract.</strong></p>\n</p>\n<dt id='are%20digital%20signature%20legal%3F'>\nAre Digital Signature Legal?\n</h4>\n<p>\n<p>Yes, electronic digital signatures are legally binding in the United States and many countries around the world.  <strong>United States</strong> in the US there are two digital signature Acts that established the legality of digital signatures in the US – the <a href=\"https://en.wikipedia.org/wiki/Electronic_Signatures_in_Global_and_National_Commerce_Act\" rel=\"nofollow ugc\">Electronic Signatures in Global and National Commerce Act</a> (ESIGN, 2000) and the <a href=\"https://en.wikipedia.org/wiki/Uniform_Electronic_Transactions_Act\" rel=\"nofollow ugc\">Uniform Electronic Transactions Act</a> (UETA, 1999). Both the ESIGN and UETA establish that electronic records and signatures carry the same weight and legal effect as traditional paper documents and handwritten signatures, they say “A document or signature cannot be denied legal effect or enforceability solely because it is in electronic form.” The ApproveMe WP E-Signature plugin is UETA/ESIGN compliant.</p>\n<p><strong>United Kingdom</strong><br />\nIn the UK, similar legislation to the ESIGN Act in the USA was likewise settled in 2000, and is known as the UK Electronic Communication Act. Approve Me is the main WordPress Plugin to Sign Contracts that warrants its e-signature solution to be consistent with this act.</p>\n<p><strong>European Union</strong><br />\nThe appropriation of the European Directive 1999/93/EC of 13 December 1999 established a the utilization of electronic marks on electronic and digital contracts inside of the European Union (EU). Thirty European nations (EU-27, Croatia, Turkey and Liechtenstein) have officially adopted Directive 1999/93/EC. To that end Electronic and Digital marks are effectively being used in Europe, and ApproveMe’s compliant WordPress E-Signature plugin is legitimately acceptable and enforceable within the European Union.</p>\n</p>\n<dt id='will%20i%20need%20to%20renew%20my%20approveme%20license%3F'>\nWill I Need to Renew my ApproveMe License?\n</h4>\n<p>\n<p>Yes you will (unless you have a Lifetime License). Each license key is valid for one calendar year from the purchase date. An active license key is needed for access to automatic/critical updates, plugin support and access to our growing <a href=\"https://www.approveme.com/esign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">e-signature add-on library</a>.</p>\n</p>\n<dt id='where%20can%20i%20find%20my%20license%20key%3F'>\nWhere Can I Find My License Key?\n</h4>\n<p>\n<p>If you’ve already purchased a license key and need to retrieve the license number, you can do that on the <a href=\"https://www.approveme.com/profile/\" rel=\"nofollow ugc\">support site here</a> or follow <a href=\"https://wpe.approveme.com/article/141-install-and-activate-plugins-extensions?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">these detailed steps</a>. Once you’ve successfully logged into the support site (using the credentials emailed to you at the time of purchase), your active license key(s) will be listed at the bottom of the page.</p>\n</p>\n<dt id='how%20much%20does%20it%20cost%20to%20renew%20my%20license%3F'>\nHow much does it cost to renew my license?\n</h4>\n<p>\n<p>The Lifetime Plan does not have a renewal cost.  It is a one-time payment for the WP e-signature plugin.  However all other plans have an annual renewal.  Our goal has always been to pull the price back as much as we possibly can so small businesses and freelancers could sign documents electronically using their WordPress website (and save alot of money in the process). Not only is our plugin the most powerful of its kind, it’s also the most affordable.  Not to throw anyone under the bus, but look at what our competitors charge every single year:</p>\n<p>Adobe charges $1,080 / yr (per 3 users)<br />\nDocusign charges $1,440 / yr (per 3 users)</p>\n<p>Not charing for renewals would actually hurt the product as we would not be able to invest as heavily as we currently do back into it&#8230;</p>\n</p>\n<dt id='what%20do%20i%20get%20for%20renewing%20my%20license%3F'>\nWhat do I get for renewing my license?\n</h4>\n<p>\n<p>Renewing your license provides an additional year of support and software updates. This provides peace of mind knowing you can turn to us for WP Electronic Signature related support and assistance. You’ll also continue receiving software updates to ensure WordPress compatibility (and security) as well as great new features and enhancements! Also (depending on your license) as we release new basic and premium add-ons you will be able download these at anytime.</p>\n</p>\n<dt id='i%20have%20other%20pre-sale%20questions%2C%20can%20you%20help%3F'>\nI have other pre-sale questions, can you help?\n</h4>\n<p>\n<p>Of Course. You’re welcome to ask any question you wish from our <a href=\"https://approveme.com/letschat/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">contact form page</a>.</p>\n</p>\n\n",
        "changelog": "<p>Version 1.8.4<br />\nFIX: Some minor bugs</p>\n<p>Version 1.8.3<br />\nADDED : PHP 8.2 compatibility<br />\nFIX: Some minor bugs</p>\n<p>Version 1.8.2<br />\nADDED: Php 8.1 support<br />\nADDED: Gravity multiple form data display option in single contracts filter.<br />\nFIX: Some minor bugs</p>\n<p>Version 1.8.1<br />\nFIX: Reminder interval validation issue<br />\nFIX: Some minor bugs</p>\n<p>Version 1.8.0<br />\nFIX: Signer name field issue<br />\nFIX: Signer reminder interval settings<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.9<br />\nFIX: Old Gravity form entry display issue<br />\nFIX: Dropdown label display issue<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.8<br />\nADDED: Dropdown field label value display support<br />\nFIX: Product field error<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.7<br />\nFIX: Data display cache conflict issue<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.6<br />\nADDED: Ability to populate different form data<br />\nADDED: Gravity Forms merge tags support<br />\nFIX: Validation issue<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.4.1<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.4<br />\nFIX: Iframe issue<br />\nFIX: Cache display issue<br />\nFIX: Other form data display issue<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.3<br />\nFIX: Gravity form address display issue<br />\nFIX : Cache display issue<br />\nFIX : Some minor issues</p>\n<p>Version  1.7.2.1<br />\nFIX: Cache issue fixed reverse.</p>\n<p>Version  1.7.2<br />\nFIX: Warning message display issue<br />\nFIX: Disabled field display issue<br />\nFIX: Custom field shortcode render issue<br />\nFIX : Some minor bugs</p>\n<p>Version  1.7.0<br />\nFIX : Entry cache conflict issue<br />\nFIX: Some minor issues</p>\n<p>Version 1.6.9.1<br />\nFIX: Label value display issue for checkbox, radio and multiselect field</p>\n<p>Version 1.6.9<br />\nFIX: Some minor bugs.</p>\n<p>Version 1.6.8<br />\nADDED: Rating widget.<br />\nFIX: Some minor bugs.</p>\n<p>Version 1.6.7<br />\nADDED : Change Brand Name<br />\nFIX: Label underline missing issue<br />\nFIX : Some other minor bugs</p>\n<p>Version 1.6.6<br />\nFIX : Number field display issue<br />\nADDED: License information</p>\n<p>Version 1.6.5<br />\nFIX : Field value display underline issue</p>\n<p>Version 1.6.4<br />\nADDED: Gravity forms all fields shortcode insert option<br />\nFIX: Multiselect field value display issue<br />\nFIX: Number field vaue display issue</p>\n<p>Version 1.6.2<br />\nFIX: Only label display issue</p>\n<p>Version 1.6.1<br />\nFIX: Name changed</p>\n<p>Version 1.5.9<br />\nFIX: Gravityforms settings link removed.<br />\nFIX: Few minor bugs fixed</p>\n<p>Version 1.5.7.5<br />\nFIX: Label name missing for Address and number field on gravity agreement<br />\nFIX : Css conflict with gravityforms version 2.5<br />\nFIX: Blank reminder settings issue<br />\nFIX: WP Rocket plugin conflict<br />\nFIX: Some other minor bugs.</p>\n<p>Version 1.5.7.0 &#8211; February 03, 2021<br />\nADDED: New landing page after activating plugin</p>\n<p>Version 1.5.6.9 &#8211; January 21, 2021<br />\nFIX : Unwanted value display issue</p>\n<p>Version 1.5.6.5 &#8211; January 04, 2021<br />\nFIX : Deleted field value display issue<br />\nFIX : Fatal error on settings saved<br />\nFIX : FIX Some minor issues.</p>\n<p>Version 1.5.6.5 &#8211; November 10, 2020<br />\nFIX : Trying to get property ‘id’ of non-object error<br />\nFIX: Gravity new version 2.5 beta compatibility issue<br />\nFIX: Gravity form single product field display issue<br />\nFIX: Fatal error resolved when core and business pack inactive<br />\nFIX: Some minor bugs.</p>\n<p>Version 1.5.6.1 &#8211; September 14, 2020<br />\nFIX : Multiple agreement not redirecting issue</p>\n<p>Version 1.5.6.0 &#8211; September 1, 2020<br />\nFIX : Display incorrect submission value<br />\nFIX:  Icon display issue<br />\nFIX : some minor bugs.</p>\n<p>Version 1.5.5.8 &#8211; June 2, 2020<br />\nADDED: Support snippet in about page.<br />\nFIX: Displaying incorrect format for number field on signing page<br />\nFIX: Field error in gravity form</p>\n<p>Version 1.5.5.3 &#8211; January 14, 2020<br />\nADDED: Gravity signature add-on capability for other wordpress users.<br />\nADDED: Gravity form post image field support.<br />\nFIX:   Merge tag support improved<br />\nFIX:  Some bugs.</p>\n<p>Version 1.5.3.8 &#8211; August 29, 2018<br />\nFIX: Gravity register method changed<br />\nFIX: Bug related to resending gravity form and not redirecting on sad document after submission<br />\nFIX: Label Name missing on signing document if we select Display value+lable for page field</p>\n<p>Version 1.5.3.6 &#8211; June 25, 2018<br />\nFIX: Conflict with gravity woocommerce product add-on<br />\nFIX: Demo video for plugins is not getting start after click on Play icon</p>\n<p>Version 1.5.3.4 &#8211; April 19, 2018<br />\nADDED: Multiple field value adding into document title</p>\n<p>Version 1.5.3.2 &#8211; March 26 2018<br />\nADDED: Displaying Field Label for Radio buttons and Check boxes<br />\nADDED: Type cast added to get formid on integer format</p>\n<p>Version 1.5.2 &#8211; October 9, 2017<br />\nADDED: a Gravity Forms Pre-Check when creating a document<br />\nFIX: error fixed on document title filter</p>\n<p>Version 1.5.0 &#8211; March 7, 2017<br />\nFIX: Warning message display if we enable &#8220;Signing Reminder Emails&#8221; checkbox<br />\nADDED: Gravity text editor menu adding filter has been added<br />\nFIX: Getting Error Signer Invite Emails not sent messages when using form<br />\nFIX: Undefined index bug has been fixed<br />\nFIX: Able to add negative value for days while applying reminder<br />\nADDED: get post and cookie filter has been added</p>\n<p>Version 1.4.6 &#8211; December 13, 2016<br />\nFIX: Gravity conflict removed with sticky list<br />\nADDED: Direct message denied and silence index page has been added</p>\n<p>Version 1.4.5.2 &#8211; October 26, 2016<br />\nFIX: Gravity map it output for address field removed.<br />\nFIX: Signer input fields alert has been removed</p>\n<p>Version 1.4.5.1 &#8211; October 6, 2016<br />\nFIX: Approveme.me link replaced with approveme.com<br />\nFIX: Gravity error message display added when entry id not found<br />\nFIX: HTML Content is not displaying on &#8220;Signing Document&#8221; Only {FIELD} display<br />\nFIX: Undefined index bug fixed</p>\n<p>Version 1.4.4.2 &#8211; July 13, 2016<br />\nFIX: Fixed bug related to the address field not saving.</p>\n<p>Version 1.4.4.1 &#8211; July 6, 2016<br />\nADDED: Added the ability to trigger multiple documents from a Gravity E-Signature Feed</p>\n<p>Version 1.4.4 &#8211; June 14, 2016<br />\nFIX: Undefined property on search issue fixed<br />\nFIX: Unable to find the &#8220;Signer Name&#8221; Field From dropdown under the Digital Signature workflow when we add SIF<br />\nFIX: URL In Gravity Readme</p>\n<p>Version 1.4.0 &#8211; May 20, 2016<br />\nIMPROVEMENT: No need to show invite pop up for gravity , woo , edd , ninja stand alone document<br />\nFIX: Gravity Form and Date format issue</p>\n<p>Version 1.3.1 &#8211; February 4, 2016<br />\nFIX: Fixed fatal error</p>\n<p>Version 1.3.0 &#8211; February 1, 2016<br />\nFIX: ajax submission bug has been fixed<br />\nIMPROVEMENT: Gravity signing reminders settings rebuilt<br />\nIMPROVEMENT: Gravity Signing Reminders should be optional (not required)<br />\nADDED: parameter added in Stand Alone Document invite send hook<br />\nADDED: Gravity Conditional Logic + translation string updated</p>\n<p>Version 1.1.0 &#8211; November 23, 2015<br />\nADDED: Gravity display option added<br />\nADDED: Capability has been added<br />\nFIX: Gravity Forms network activation bug has been fixed<br />\nFIX: Option &#8220;Gravity Form Data&#8221; is not displaying if we edit sad document from WP E-Signature dashboard<br />\nFIX: Value for field &#8220;Address&#8221; is not saving on the document</p>\n<p>Version 1.0.2 &#8211; October 20, 2015<br />\nFIX: Related to “Let’s Go Now” URL not working properly.</p>\n<p>Version 1.0.1 &#8211; September 29, 2015<br />\ngeneral bug fixes</p>\n<p>Version 1.0.0 &#8211; September 9, 2015<br />\nSubmitted version to WordPress.org repository</p>\n"
    },
    "short_description": "Automatically generate a legally binding &amp; court recognized contract from a Gravity Forms submission. Proposals. Time sheets. Contracts.",
    "description": "<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Try a demo of the Signature Add-on for Gravity Forms Here</a></strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/dpNTG_P7bXY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><em>Please note you will need the following plugins installed to completely automate the collection of contracts using Gravity Forms and WP E-Signature.</em><br />\n1. <a href=\"http://aprv.me/1TAspLi\" rel=\"nofollow ugc\">Gravity Forms</a><br />\n2. <a href=\"https://www.approveme.com/gravity-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">WP E-Signature</a> (Elite or Lifetime license)<br />\n3. <a href=\"https://www.approveme.com/wpesign-features/stand-alone-documents/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Stand Alone Document</a> (comes with above licenses)</p>\n<p>*A Elite or Lifetime license is required and can be purchased at <a href=\"http://aprv.me/2lOpn7l\" rel=\"nofollow ugc\">www.approveme.com</a></p>\n<p><strong>What would you do if you found out the contracts you use to run and operate your business were not legally binding?</strong></p>\n<p>What if you and your client were in a courtroom only to find out that the digital signature used on your contract was not signed with a compliant e-signature application? </p>\n<p><strong>The legal industry is a highly regulated industry that has strict laws and regulations around the electronic signature and digital signature submission process.</strong></p>\n<h4>How is this Signature Add-On different than the Gravity Forms Signature Add-on by Rocket Genius?</h4>\n<p>WordPress Form Plugins like Gravity Forms are absolutely fantastic! You can create some amazing and incredible WordPress workflows using their powerful WordPress Forms plugin; However, <em>signing a legally binding contract is NOT Gravity Forms main focus</em> (it is WP E-Signature’s SOLE focus). We have spent years developing a platform that adheres to the strict <a href=\"https://www.approveme.com/ueta-and-esign-act?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">UETA and ESIGN</a> national and international document signing guidelines.</p>\n<p>Most WordPress contract plugins and signature add-ons out there are not legally binding let alone UETA/ESIGN compliant (they do not adhere to the strict laws and regulations in the document singing industry). These typical signature add-ons, only “capture signature information as it is drawn and sends data to your web server where this information is converted into a PNG image and stored on your server.”</p>\n<p>This method, exposes you and your signers legal signature on the ftp server where your WordPress website lives. <strong>In other words the png files most signature add-ons generate, of your client’s hand drawn legal signature (the same signature which is used to buy a house, apply for a credit card, take out a business loan) is available to ANY ftp intruder; putting both you and your signer at high risk for identity theft.</strong></p>\n<p>This Signature Plugin fills in the gap by making the e-signature process compliant with UETA/ESIGN regulations.</p>\n<p><strong>The new signature add-on by <a href=\"http://www.secure.approveme.com/demo/gravity-forms-demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Approve Me</a> is the bridge between a form generation plugin and having a UETA / ESIGN compliant document signing application that lives on your WordPress website.</strong></p>\n<p>Watch the video above to see how you can save time and money by completely automating contracts for your web design, photography, consulting or freelance business using our <strong>Signature Add-On for Gravity Forms</strong>.</p>\n<p>WP E-Signature by ApproveMe focuses 100% on legally binding contract signing (UETA &amp; ESIGN compliant). No monthly fees. So you can use your website to sign contracts. It is by far the most customizable document singing application built for WordPress.</p>\n<p>ApproveMe’s WP E-Signature adhere’s to the strictest electronic signature and digital signature regulations by encrypting, storing, and protecting your data in such in a way that is damn near difficult to retrieve from a database let alone manipulate a contract.</p>\n<p>If the validity of a signature were to ever get questioned in a court room you would have peace of mind knowing that both you and your signer are protected by the ApproveMe verified seal.</p>\n<p>If you’re wanting even more out of WP E-Signature, we have it! There are TONS of advanced features available for our Elite or Lifetime license holders. Our WordPress Contract Plugin is by far the easiest way to integrate a court recognized Gravity Forms Approval process into your WordPress website.</p>\n<p><strong>Signature Add-On for Gravity Forms by <a href=\"http://www.secure.approveme.com/demo/gravity-forms-demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Approve Me</a> allows you to capture court recognized signatures immediately after a user submits a Gravity Form by either emailing or redirecting the users that recently filled out your gravityform to a unique contract or agreement made specific for that user, requiring them to draw (or type) their electronic signature using a touchscreen device, touch pads or even a mouse.</strong></p>\n<p><em>With <a href=\"https://www.approveme.com/gravity-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">WP E-Signature</a> (Elite or Lifetime) and this Digital Signature for GravityForms plugin you can automatically generate a contract for your customers to sign based on their form results from a Gravity Forms.</em></p>\n<p><strong>That’s just the start. Once customers sign…</strong></p>\n<p><em>…you and the customer will automatically receive a PDF of their signed contract.</em></p>\n<p><em>…no need to register on an outside website (all signatures happen without leaving your site)</em></p>\n<p><em>… you’ll have a 100% legally compliant signature on file to protect you AND the customer (according to UETA/ESIGN guidelines).</em></p>\n<h3>This e-signature add-on transforms your WordPress website into a court-recognized document signing application (but without the monthly fees&#8230; and with unlimited users).</h3>\n<ul>\n<li>Perfect for those wanting to automate the collection of signatures on proposals, estimates, timesheets, terms of service agreements, new client contracts, waiver forms and more!</li>\n</ul>\n<p>Automatically require your WordPress visitors to sign a legally binding agreement after submitting a gravity form.</p>\n<p>Quickly and easily add court recognized contract signing capabilities into your WordPress website using this Signature Add-on for Gravity Forms and ApproveMe’s WP E-Signature (Elite or Lifetime license). Gone are the days of sending your signers to an unrelated third party website just so they can sign your web design, photography, consulting or freelance contract. The form submitter will never have to leave your website or heaven forbid install any special browser plugins, add-ons or extensions to sign your contract.</p>\n<p>With ApproveMe’s WP E-Signature and their new Signature Add-On for Gravity Forms you can create a legally binding contract that is tailored 100% to the user that just submitted your Form.</p>\n<p><strong>Do the smart thing.  Don’t get caught in a courtroom with a document that’s not legally binding.</strong></p>\n<p><strong>Transform one single page of your existing WordPress website into a secure document and electronic signature application.  WP Digital E-Signature by ApproveMe, is a legally binding WordPress Contract Plugin, that’s easy to use.</strong></p>\n<p>WP E-Signature has a very extensive e-signature premium add-on library with dozens of expandable and customizable <a href=\"https://www.approveme.com/wpesign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">e-signature automations</a> and <a href=\"https://www.approveme.com/esign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">third-party integrations</a> to further enhance your custom document signing needs.</p>\n<p>The Signature Add-On works on all major desktop and mobile browsers. This includes IE, FireFox, Safari, Chrome, Opera, iOS, Android, and WebOS.</p>\n<p>In additional to being incredibly easy to use, ApproveMe’s Signature Add-on for Gravity Forms WordPress can automatically insert data that was submitted from a Gravity Form into a UETA/ESIGN compliant and court recognized contract using your very own WordPress website.</p>\n<p>So if you have a dropdown menu in your Gravity Form called “Web Design Package” and you offer a few different packages (each with a different price point) you can easily create a contract that includes the package details of an order in the contract that gets sent to your Gravity Form end-user.</p>\n<p>WP E-Signature is significantly different than the current signature add-on offered by Gravity Forms as it gives Gravity users the power (and leverage) to host their own document signing application that hooks into Gravity Form results and triggers on-demand legal contracts (that are compliant with all the document signing e-signature laws and regulations).</p>\n<p><strong>Automatically Trigger Contracts To Be Sent</strong>Once a user submits a gravity form you can automatically trigger a Contract to either be sent via email or to be the very next page the Gravity Form Submitter sees when they submit their form.</p>\n<p><strong>Connect Gravity Forms With Wp E-Signature</strong>This Signature Add-On for Gravity Forms will combine the powerful features of gravity forms with the relentless fury of features from WP E-Signature.</p>\n<p><strong>Add Gravity Form Field Values Into A Wp E-Signature Contract</strong>With Signature Add-On for Gravity Forms you can easily insert submitted form results into a contract that gets triggered automatically once a user completes a Gravity Form submission.</p>\n<p><strong>Redirect User To Wp E-Signature Contract After Gravity Form Submission</strong>Once a user successfully completes a Gravity Form Submission they are automatically redirected the contract of your choice using this premium E-Signature add-on.</p>\n<p><strong>Email A User A Contract Once They Fill Out A Gravity Form</strong>After successful form submission you can choose to email the form submitter (or another user if the other users email and name was in the gravity form that was just completed).</p>\n<p><strong>Signing Reminder Emails</strong>If a user has not yet signed the agreement that you were requiring them to sign after submitting your gravity form, you can automatically activate signing reminder emails where you can choose the trigger date, the frequency of reminder emails, and the expiration date of the signing reminder emails.</p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Try a demo of the Signature Add-on for Gravity Forms Here</a></strong></p>\n<h4>Strength &amp; flexibility</h4>\n<p>WP E-Signature is built using WordPress best practices both on the front and the back end. This results in an efficient, robust and easy-to-use plugin.</p>\n<h4>Legally Binding</h4>\n<p>WP E-Signature is recognized in court. We are <a href=\"http://www.ncsl.org/research/telecommunications-and-information-technology/uniform-electronic-transactions-acts.aspx\" rel=\"nofollow ugc\">(UETA)</a> and <a href=\"http://www.fdic.gov/regulations/compliance/manual/pdf/X-3.1.pdf\" rel=\"nofollow ugc\">(ESIGN)</a> compliant and adhere to some of the strictest document signing polices in the US and European unions.</p>\n<h4>Electronic Signature Security and Encryption</h4>\n<p>Security is our priority. All of your signed documents and signatures are kept hidden and encrypted on your server using a secure encryption sequence and signer specific URL.  Additionally you have the option of forcing SSL security (when an SSL certificate is installed on your server) for all WP E-Signature related pages.</p>\n<h4>Signer Audit Trail &amp; Reporting</h4>\n<p>Documents move turbo speed from signer to signer. We include a detailed audit report with viewer details, ip addresses, analytics and signer history. <a href=\"https://www.approveme.com/wordpress-audit-trail-e-signature-certificate/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">See how the audit trail can protect you and your signers</a></p>\n<h4>Document Signing Automation</h4>\n<p>If you do business online, customers probably have to sign an agreement or an online contract. Problem is a paper agreement doesn’t hold up if your business is an online business and your customers are online customers. You can try mailing or even scanning a contract to your digital customers which costs you time and money, in the meantime you have the risk of losing your customer because of the added delay.</p>\n<p>What you need is WP E-Signature. WP E-Signature lets you customize the signing process for what you need with no monthly fees. With a comprehensive marketplace of add-on extensions including Save as PDF, Dropbox Sync, Signer Input Fields, and dozens more which make it easy to automate and customize your document signing process.</p>\n<p>WP E-Signature works with any WordPress website, including the default WordPress themes. If you need help installing WordPress E-Signature check out our <a href=\"https://wpe.approveme.com/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">getting started docs</a> and start signing documents using your WordPress website.  Looking to get WordPress Proposals signed?  We got you covered!</p>\n<p>If you&#8217;re looking for a tailored WordPress eSigning integration or add-on designed specifically to be used for your document signing needs be sure to browse the official <a href=\"https://www.approveme.com/wpesign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">WP E-Signature Business Add-On Extensions</a> which come with an Lifetime or Elite license.   If you don’t see the integrations you need… let us know.</p>\n<p>You could also use a third party document signing service but they charge monthly fees and what’s worst, your customers are forced to create an account on an unrelated website just to sign your companies documents.</p>\n<h4>e-signature WordPress Features</h4>\n<p>Whether you&#8217;re operating a wedding photography business a membership based website, or a just a small web design agency in need of clients signing your website terms of service WP E-Signature has you covered. You can read all about ‘WP E-Signature’ features on the <a href=\"https://www.approveme.com/gravity-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">ApproveMe website</a>.</p>\n<h4>Customizable</h4>\n<p>Your business is unique, your online document signing process should be too. Choose from many of our <a href=\"https://www.approveme.com/wpesign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">e-signature workflows</a> best of all e-signature is hosted using your WordPress website.</p>\n<h4>Tablet &amp; Smart Phone Friendly</h4>\n<p>Upload documents via WordPress dashboard and collect real client signatures through your website using ApproveMe’s <a href=\"https://www.approveme.com/gravity-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">WordPress Contract Plugin</a>. Users sign documents online using their mouse, trackpad, tablet, or phone.</p>\n<h4>No Monthly Fees</h4>\n<p>WP E-Signature is the easiest and most affordable way to sign documents online using WordPress. You have full control over your data – it never leaves your server. Built exclusively for WordPress.</p>\n<h4>More About Gravity Forms</h4>\n<p>Gravity Forms is a premium featured advanced drag and drop, email notification routing, lead generation and capturing, conditional logic wielding, WordPress forms plugin that offers the ability to create WordPress posts from front-end hosted forms.</p>\n<h3>Need Support?</h3>\n<p>So we can better serve you and to avoid support tickets getting lost in outer space we try to provide world-class support via our website.</p>\n<p><strong>We do not offer support on the wordpress.org forum.</strong></p>\n<p>To create a support ticket please login to your account <a href=\"https://www.approveme.com/sign-in/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">www.approveme.com/support</a> and we look forward to helping you resolve your issue.</p>\n<p>If you have any other non-support related questions about ApproveMe’s WP E-Signature you’re welcome to ask any pre-sale questions from our <a href=\"https://www.approveme.com/letschat/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">contact form page</a>.</p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p>To view a live Gravity to WP E-Signature demo you can check one out at:</p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Try Gravity Forms + WP E-Signature Demo Here</a></strong></p>\n<h3>Additional Info</h3>\n<h3>Other notable PDF features and workflows for Signature Add-On for Gravity Forms plugin</h3>\n<ul>\n<li>Completely automate the signature collection process for your freelance or small business</li>\n<li>A copy of the signed agreement can be downloaded as a PDF from your website</li>\n<li>A Signed PDF can be synced with your Dropbox account</li>\n<li>An attached court recognized PDF can be emailed to both the signer and yourself</li>\n</ul>\n<p><strong>All documents are encrypted and stored on your WordPress website (not somebody else’s)</strong></p>\n<p>Learn more about the WP E-Signature document security here: (https://www.approveme.com/security-ueta-e-sign-protection/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms)</p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p><em>A valid WP E-Signature business license is required for this Gravity Forms Signature plugin to work.  You can easily purchase yours at (https://www.approveme.com/gravity-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms)</em></p>\n<p><strong>No Monthly Fees • UETA &amp; ESIGN Compliant • Legally Binding • Money Back Guarantee</strong></p>\n<h3>INSTALLATION COMPLETE!</h3>\n<p>All signed agreements can be saved as a PDF, attached to an email, automatically synced to a Dropbox account and more!  You decide how this should work!</p>\n<p><em>A valid <a href=\"https://www.approveme.com/gravity-forms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Elite or Lifetime</a> is required for Gravity Forms Signature plugin by ApproveMe to properly work</em></p>\n<p><strong><a href=\"https://www.approveme.com/gravity-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\" rel=\"nofollow ugc\">Get Your ApproveMe License Now</a></strong></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.8.4.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-1.png?rev=1361533",
            "caption": "<p><strong>Add New Document:</strong> Once you’ve installed the WP E-Signature, you just need to draft up a new “Stand Alone Document”</p>"
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-2.jpg?rev=1361533",
            "caption": "<p><strong>Gravity Form Data</strong> If you click the Signer Input Fields icon you will see the option “Gravity Form Data” you will need to click this in order to connect a gravity Form to this contract.</p>"
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-3.png?rev=1361533",
            "caption": "<strong>Select Your GravityForm:</strong> If you already have your gravity form created you can easily insert dynamic field data (from the gravity Form that is being submitted/triggering this contract) by selecting the Gravity Form."
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-4.png?rev=1361533",
            "caption": "<strong>Choose Your Gravity Form Fields:</strong> Once you’ve selected your Gravity Form you will see the available field options from this particular Gravity Form.  You can easily insert the submitted results from your gravity Form in ANY place throughout this contract that you are creating."
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-5.png?rev=1361533",
            "caption": "<strong>Document Signing Options (optional):</strong> WP e-signature by ApproveMe is a powerful e-signature tool filled with LOTS of customizable options i.e. Signing reminder Emails, Attach PDF to emails, Dropbox Sync, Auto Register WordPress Users, and TONS more.  To read all about the available add-on features (which come with the Elite or Lifetime license) you can checkout: <a href=\"https://www.approveme.com/esign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=gravity-forms\">https://www.approveme.com/wp-e-signature-features</a>"
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-6.png?rev=1361697",
            "caption": "<strong>Connect Your Document to a Page:</strong>Once you have customize your contract to taste you will need to select a BLANK WordPress page to attach this document to.  Do not include this page in your Nav menu since all of the magic actually happens after the Gravity Form is submitted (there’s no need to link to this page because the user will either be emailed a custom link or they will be automatically redirected once the gravity Form is submitted)."
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-7.png?rev=1361533",
            "caption": "<strong>Click “LET’S GO NOW”:</strong> After you have published your contract you will need to connect your Stand Alone Document to your Gravity Form.  This is pretty straight forward.  Just click the button “LET’S GO NOW!” to be redirected to the actions/trigger tab for your specific Gravity Form."
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-8.png?rev=1361533",
            "caption": "<strong>Define Your Signing Logic:</strong> This is the page (inside of Gravity Forms) that needs to be customized.  Please choose the Signers Full Name and the Signers Email address along with any other additional/advanced e-signature settings you’d like for your contract."
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-9.png?rev=1361663",
            "caption": "<strong>User Submits a Gravity Form</strong> Once a user submits the Gravity Form that you connected to your WP e-signature contract they will either be redirected to the contract immediately or emailed a invitation to signer their specific/custom contract that includes details from the submitted Gravity Form."
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-10.png?rev=1361663",
            "caption": "<strong>Review &amp; eSign:</strong> Your users will review the contract and add their signature to the contents of the contract."
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-11.png?rev=1361533",
            "caption": "<strong>Select a Digital Signature:</strong>Signers can choose a typed or digital signature"
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-12.png?rev=1361533",
            "caption": "<strong>Agree &amp; eSign:</strong>With their e-signature, the customers agree to the terms of the document"
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-13.png?rev=1361533",
            "caption": "<strong>View Signed Document Email:</strong>Customers will be sent an email that includes the link to the document (and PDF if you opt for this method)."
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-14.png?rev=1361533",
            "caption": "<strong>Save as PDF:</strong>Customers can either print or download their signed document from the website. To do this, they need to click “View Signed Document” from the link in the email they attained upon signing the document.  With the Attach as PDF add-on install you could also automatically include thee signed contract as a PDF attachment in this email."
        },
        {
            "src": "https://ps.w.org/gravity-signature-forms-add-on/assets/screenshot-15.png?rev=1361533",
            "caption": "<strong>WordPress Audit Trail e-signature Certificate:</strong> Proving signer intent is a very important component to signing electronic documents.  Every contract that is signed using WP E-Signature includes a detailed Signature Certificate.  You can <a href=\"https://www.approveme.com/wordpress-audit-trail-e-signature-certificate/\">read all about the security of this report here</a>."
        }
    ],
    "tags": {
        "digital-signature": "digital signature",
        "e-signature": "e-signature",
        "e-signatures": "e-signatures",
        "electronic-signature": "Electronic Signature",
        "gravityforms": "GravityForms"
    },
    "stable_tag": "1.8.4",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.0.2.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.1.0.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.3.1.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.4.0.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.4.4.zip",
        "1.4.4.1": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.4.4.1.zip",
        "1.4.4.2": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.4.4.2.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.4.5.zip",
        "1.4.5.1": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.4.5.1.zip",
        "1.4.5.2": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.4.5.2.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.4.6.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.1.zip",
        "1.5.2.0": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.2.0.zip",
        "1.5.2.2": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.2.2.zip",
        "1.5.3.2": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.3.2.zip",
        "1.5.3.4": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.3.4.zip",
        "1.5.3.6": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.3.6.zip",
        "1.5.3.8": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.3.8.zip",
        "1.5.4.5": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.4.5.zip",
        "1.5.4.9": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.4.9.zip",
        "1.5.5.3": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.5.3.zip",
        "1.5.5.8": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.5.8.zip",
        "1.5.6.0": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.6.0.zip",
        "1.5.6.1": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.6.1.zip",
        "1.5.6.5": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.6.5.zip",
        "1.5.6.8": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.6.8.zip",
        "1.5.6.9": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.6.9.zip",
        "1.5.7.0": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.7.0.zip",
        "1.5.7.5": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.7.5.zip",
        "1.5.9": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.5.9.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.6.2.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.6.5.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.6.6.zip",
        "1.6.7": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.6.7.zip",
        "1.6.8": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.6.8.zip",
        "1.6.9": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.6.9.zip",
        "1.6.9.1": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.6.9.1.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.7.0.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.7.2.zip",
        "1.7.2.1": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.7.2.1.zip",
        "1.7.3": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.7.3.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.7.4.zip",
        "1.7.4.1": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.7.4.1.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.7.6.zip",
        "1.7.7": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.7.7.zip",
        "1.7.8": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.7.8.zip",
        "1.7.8.1": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.7.8.1.zip",
        "1.7.8.2": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.7.8.2.zip",
        "1.7.9": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.7.9.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.8.0.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.8.1.zip",
        "1.8.2": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.8.2.zip",
        "1.8.3": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.8.3.zip",
        "1.8.4": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.1.8.4.zip",
        "trunk": "https://downloads.wordpress.org/plugin/gravity-signature-forms-add-on.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/gravity-signature-forms-add-on/assets/banner-772x250.png?rev=1242135",
        "high": "https://ps.w.org/gravity-signature-forms-add-on/assets/banner-1544x500.png?rev=1242135"
    },
    "icons": {
        "1x": "https://ps.w.org/gravity-signature-forms-add-on/assets/icon-128x128.png?rev=1242135",
        "2x": "https://ps.w.org/gravity-signature-forms-add-on/assets/icon-256x256.png?rev=1242135"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 78,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}