{
    "name": "WordPress Behance Plugin &#8211; Make a Portfolio, Feed, Gallery, Slider and More",
    "slug": "gs-behance-portfolio",
    "version": "3.0.6",
    "author": "<a href=\"https://www.gsplugins.com\">GS Plugins</a>",
    "author_profile": "https://profiles.wordpress.org/samdani/",
    "contributors": {
        "gsplugins": {
            "profile": "https://profiles.wordpress.org/gsplugins/",
            "avatar": "https://secure.gravatar.com/avatar/f78b1ff4757014dbee6dd0f9e263bdd1?s=96&d=monsterid&r=g",
            "display_name": "GS Plugins"
        },
        "itszaman": {
            "profile": "https://profiles.wordpress.org/itszaman/",
            "avatar": "https://secure.gravatar.com/avatar/92e3e231b1a5ded7b5e32db5e00039b2?s=96&d=monsterid&r=g",
            "display_name": "Md. Sarwar Zaman"
        },
        "samdani": {
            "profile": "https://profiles.wordpress.org/samdani/",
            "avatar": "https://secure.gravatar.com/avatar/2cc43b03989e22b7a8f456d7e3973e05?s=96&d=monsterid&r=g",
            "display_name": "Golam Samdani"
        },
        "freemius": {
            "profile": "https://profiles.wordpress.org/freemius/",
            "avatar": "https://secure.gravatar.com/avatar/3ac33da92186a78937b307bdd9e906ee?s=96&d=monsterid&r=g",
            "display_name": "Freemius"
        }
    },
    "requires": "4.3",
    "tested": "6.6.1",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 86,
    "ratings": {
        "5": 5,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 6,
    "support_url": "https://wordpress.org/support/plugin/gs-behance-portfolio/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 400,
    "downloaded": 19244,
    "last_updated": "2024-08-01 07:51:00",
    "added": "2016-08-16",
    "homepage": "https://www.gsplugins.com/wordpress-plugins",
    "sections": {
        "description": "<p>Introducing the best responsive Behance plugin for WordPress to showcase your Behance projects with style and ease. The <strong>GS Behance Portfolio</strong> plugin allows you to display your work anywhere on your site using shortcodes, making it incredibly versatile. Packed with essential control options and a variety of themes, this plugin ensures your projects are showcased elegantly with eye-catching effects that captivate your audience.</p>\n<p>Simple, flexible, and powerful, the <em>Behance Portfolio Plugin</em> is designed to meet your needs effortlessly. Whether you&#8217;re a designer, photographer, or creative professional, this plugin provides the perfect platform to present your portfolio in the most appealing way possible.</p>\n<p>🔥 <strong>Behance API Key is NOT Needed!</strong> 🔥</p>\n<p>🎬 <a href=\"https://behance.gsplugins.com\" rel=\"nofollow ugc\">Live Demo</a> ⬆️ <a href=\"https://www.gsplugins.com/product/gs-behance-portfolio\" rel=\"nofollow ugc\">Upgrade to PRO</a> 📚 <a href=\"https://docs.gsplugins.com/gs-behance-portfolio\" rel=\"nofollow ugc\">Documentation</a> 🙋‍♂️ <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a></p>\n<h3>Why use the GS Behance Portfolio Plugin</h3>\n<p>Behance is a premier platform for creatives to share their portfolios, offering extensive visibility and networking opportunities within a vibrant community of professionals. It helps designers, photographers, and artists to showcase their work, gain feedback, and connect with potential clients and collaborators. The GS Behance Portfolio Plugin seamlessly integrates your Behance projects into your WordPress site, providing an elegant and efficient way to display your portfolio and attract more attention to your work.</p>\n<h3>What Sets GS Behance Plugin Apart?</h3>\n<ul>\n<li><strong>Responsive and Customizable Design</strong>: The GS Behance Plugin is built to be responsive, ensuring your portfolio looks great on all devices. It offers multiple column options and works seamlessly with any standard WordPress theme, making it easy to customize to match your site’s design. Additionally, developer-friendly features and support for custom CSS allow for further personalization.</li>\n<li><strong>Versatile Display Options</strong>: With the ability to display Behance projects anywhere using the shortcode [gs_behance id=1]<br />\nand widgets, you have flexible options for showcasing your work. The plugin supports various display settings, including project titles, appreciations count, views count, and comment count, giving you comprehensive ways to present your portfolio.</li>\n<li><strong>Advanced Pro Features</strong>: Upgrading to the pro version unlocks seven unique themes, such as Projects, Projects Stat, Hover, Popup, Slider, Profile, and Filter. These themes provide diverse and dynamic ways to display your portfolio. Pro users also benefit from custom CSS options, priority email support, and free installation services, ensuring a premium user experience.</li>\n<li><strong>Effortless Setup and Maintenance</strong>: Setting up the GS Behance Plugin is straightforward, and it comes with detailed documentation and support. Pro users receive additional benefits like regular updates, auto-update notifications, and the convenience of updating directly from the dashboard. This ensures your plugin remains up-to-date with minimal effort.</li>\n</ul>\n<h3>Plugin&#8217;s Key Features</h3>\n<ul>\n<li><strong>Responsive Design</strong>: Ensures your Behance portfolio looks stunning and functions seamlessly across all devices and viewport sizes.</li>\n<li><strong>Different Column Options</strong>: Choose between 3-column or 4-column layouts to best showcase your projects.</li>\n<li><strong>Compatibility</strong>: Works with any standard WordPress theme for easy integration.</li>\n<li><strong>Developer Friendly</strong>: Easy to customize with developer-friendly features and settings.</li>\n<li><strong>Browser Support</strong>: Fully supported across all modern browsers for a consistent experience.</li>\n<li><strong>W3C Valid Markup</strong>: Adheres to W3C standards for clean and valid HTML markup.</li>\n<li><strong>Shortcodes &amp; Widgets</strong>: Display Behance projects anywhere on your site using the [gs_behance id=1] shortcode and widgets.</li>\n<li><strong>Projects Title Display</strong>: Show project titles prominently to enhance visibility.</li>\n<li><strong>Projects Appreciations Count</strong>: Display the number of appreciations each project has received.</li>\n<li><strong>Projects Views Count</strong>: Showcase the total views for each project.</li>\n<li><strong>Projects Comment Count</strong>: Show the number of comments each project has collected.</li>\n<li><strong>Custom CSS</strong>: Add your own custom CSS to tailor the plugin’s appearance to your preferences.</li>\n<li><strong>Easy Setup</strong>: Simple to install and configure, even for beginners.</li>\n<li><strong>Pro Features</strong>:</li>\n<li><strong>7 Different Themes</strong>: Choose from 7 unique themes to match your site&#8217;s style**:\n<ul>\n<li><strong>Theme 01 – Projects</strong>: Classic project display.</li>\n<li><strong>Theme 02 – Projects Stat</strong>: Emphasizes project statistics.</li>\n<li><strong>Theme 03 – Hover</strong>: Interactive hover effects.</li>\n<li><strong>Theme 04 – Popup</strong>: Projects in a popup view.</li>\n<li><strong>Theme 05 – Slider</strong>: Sliding carousel of projects.</li>\n<li><strong>Theme 06 – Profile</strong>: Showcases projects in a profile format.</li>\n<li><strong>Theme 07 – Filter</strong>: Filterable project display.</li>\n</ul>\n</li>\n<li><strong>Field-wise Projects</strong>: Organize projects by different fields for better categorization.</li>\n<li><strong>Priority Email Support</strong>: Receive priority support via email for any plugin-related queries.</li>\n<li><strong>Free Installation</strong>: Free installation assistance available if needed.</li>\n<li><strong>Regular Updates</strong>: Receive continual updates to keep your plugin current.</li>\n<li><strong>Auto Update Notification</strong>: Get notified automatically about new updates.</li>\n<li><strong>Auto Update from Dashboard</strong>: Easily update the plugin directly from your WordPress dashboard.</li>\n<li><strong>Well Documented</strong>: Comprehensive documentation and support to help you get the most out of the Plugin.</li>\n<li><strong>Live Demos</strong>: 🎬 <a href=\"https://behance.gsplugins.com\" rel=\"nofollow ugc\">View live Demos &raquo;</a></li>\n<li><strong>Upgrade to PRO</strong>: ⬆️ <a href=\"https://www.gsplugins.com/product/gs-behance-portfolio\" rel=\"nofollow ugc\">Upgrade to PRO &raquo;</a></li>\n</ul>\n<h3>General Settings</h3>\n<p>Go to <strong>Behance Portfolio &gt; Shortcode</strong>. Once inside, you’ll see the General Settings tab. Here, you can either create a new Shortcode or edit the existing ones (if already created).</p>\n<ul>\n<li><strong>Shortcode Name</strong>: Assign an unique Shortcode name here.</li>\n<li><strong>User ID</strong>: Enter Behance username ID in this box.</li>\n<li><strong>Total Projects</strong>: Set the number of projects you want shown with your Shortcode. By default, it shows 6 projects.</li>\n<li><strong>Theme</strong>: From 7 types of themes available, choose one that best shows your Behance projects.</li>\n<li><strong>Projects Link Target</strong>: Set whether clicking on the project’s link opens in a new tab or in the same window.</li>\n<li><strong><em>Slider Theme Settings (When Enabled Slider)</em></strong>:\n<ul>\n<li><strong>Speed</strong>: Adjust slider speed.</li>\n<li><strong>Enable Autoplay</strong>: Toggle slider autoplay on or off.</li>\n<li><strong>Delay</strong>: Set the time the slider should wait before starting to autoplay the projects. </li>\n</ul>\n</li>\n</ul>\n<h3>Style Settings</h3>\n<p>Go to <strong>Behance Portfolio &gt; Shortcode</strong>. Here, you can either create a new Shortcode or edit the existing ones. Once inside, beside the General Settings tab, you’ll see the tab for adjusting Style Settings.</p>\n<ul>\n<li><strong>Desktop Columns</strong>: Set the number of columns to show on desktop screens.</li>\n<li><strong>Tablet Columns</strong>: Configure the number of columns for optimal tablet viewing.</li>\n<li><strong>Portrait Mobile Columns</strong>: Adjust the column count for portrait mobile viewing.</li>\n<li><strong>Mobile Columns</strong>: Tailor the column count to suit mobile screen sizes.</li>\n</ul>\n<h3>Preferences</h3>\n<p><strong>Sync Interval</strong>: Adjust automatic Behance data synchronization interval time from here. However, this process can also be manually done by clicking on <strong>Tools</strong> (beside preferences, in the same navigation bar) and then clicking the <strong>SYNC DATA NOW</strong> button.</p>\n<p>Go to <strong>Behance Portfolio &gt; Shortcode</strong>. On the top right navigation bar, click on Preferences. You’ll see the following fields:</p>\n<ul>\n<li><strong>Disable Lazy Load</strong>: Toggle lazy loading for the Behance projects.</li>\n<li><strong>Lazy Load Class</strong>: Assign a class to disable lazy loading, each class should be separated by a space.</li>\n<li><strong>Custom CSS</strong>: Include your custom CSS into the Shortcode to get full control over the look and feel of your project presentations.</li>\n</ul>\n<h3>Page Builder Support</h3>\n<ul>\n<li>Gutenberg</li>\n<li>Elementor</li>\n</ul>\n<h3>GS Behance Portfolio&#8217;s shortcode usage</h3>\n<p>Choose a theme and other parameters to customize your display. The shortcode will be generated with an ID, like [gs_behance id=1]</p>\n<p>Basic Usage &#8211;</p>\n<pre><code>[gs_behance id=1]\n</code></pre>\n<p><strong>Shortcode PHP Usage</strong></p>\n<pre><code>&lt;?php echo do_shortcode( '[gs_behance id=1]' ); ?&gt;\n</code></pre>\n<h3>Documentation</h3>\n<p>If you have any questions regarding the <strong>WordPress Behance plugin</strong> and how to work with it, We recommend referring to our comprehensive online documentation. It provides detailed information and instructions to assist you in navigating and utilizing the plugin effectively. You can find the <a href=\"https://docs.gsplugins.com/gs-behance-portfolio\" rel=\"nofollow ugc\">Documentation</a> here.</p>\n<h3>Quick Support &amp; Bug Reporting</h3>\n<p>If you encounter any problems or discover bugs, please post them in our <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a> channel. We aim to respond as soon as possible (excluding holidays).</p>\n<p><strong><em>Pro users are requested to contact our support channel for dedicated assistance.</em></strong></p>\n<p>🙋‍♂️ Alternatively, you can reach out to us through our <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a> or <a href=\"https://wordpress.org/support/plugin/gs-behance-portfolio/\" rel=\"ugc\">WordPress.org</a> support forum.</p>\n<h3>Development Team</h3>\n<p>Crafted and Developed with Passion by <a href=\"https://www.gsplugins.com\" rel=\"nofollow ugc\">GS Plugins</a></p>\n<h3>Confused?</h3>\n<p>🎬 <a href=\"https://behance.gsplugins.com\" rel=\"nofollow ugc\">View live Demos &raquo;</a><br />\n📚 <a href=\"https://docs.gsplugins.com/gs-behance-portfolio\" rel=\"nofollow ugc\">Documentation &raquo;</a></p>\n<h3>🔥 You may like other plugins from <a href=\"https://www.gsplugins.com\" rel=\"nofollow ugc\">GS Plugins</a></h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-testimonial\" rel=\"ugc\">Testimonial Slider</a></strong> &#8211; Testimonials slider displays rotating customer endorsements and recommendations, helping to build trust and credibility for a business or product.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-logo-slider\" rel=\"ugc\">Logo Slider</a></strong> &#8211; Logo slider displays rotating logos of partners, clients, or sponsors, showcasing a business&#8217;s relationships and endorsements.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-portfolio/\" rel=\"ugc\">Portfolio</a></strong> &#8211; Filterable Portfolio plugin for WordPress allows you to easily display and showcase your projects, highlighting your skills and abilities.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-team-members\" rel=\"ugc\">Team Members</a></strong> &#8211; Build a Stunning Team Page or Section and Show off Your Team&#8217;s Talents!</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-projects\" rel=\"ugc\">Projects</a></strong> &#8211; Projects showcase displays detailed information including client reviews, ratings, galleries, and videos for a business&#8217;s work.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-books-showcase\" rel=\"ugc\">Books Showcase</a></strong> &#8211; Books showcase displays detailed information including author, published date, reviews, ratings, and gallery, allowing users to easily find and explore books.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-coach\" rel=\"ugc\">Coaches</a></strong> &#8211; Coaches plugin displays coaches&#8217; experience, skills, reviews, ratings, and certifications, helping users find the right coach for their needs.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/posts-grid\" rel=\"ugc\">Posts Grid</a></strong> &#8211;  WordPress Posts Grid plugin displays the latest posts in an elegant grid format, allowing for easy navigation and quick access to new content on a website.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/posts-widget\" rel=\"ugc\">Posts Widget</a></strong> &#8211;  WordPress Posts Widget plugin displays the latest posts in an elegant format on the sidebar or any widget area, allowing for easy navigation and quick access to new content on a website.</p>\n<h3>🎯 WooCommerce Plugins</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woocommerce-products-slider\" rel=\"ugc\">WooCommerce Products Slider</a></strong> &#8211; WooCommerce Product Slider plugin displays products in a visually pleasing, sliding manner, making it easy for customers to browse and find the products they want on an online store.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woo-variation-swatches\" rel=\"ugc\">WooCommerce Variation Swatches</a></strong> &#8211; WooCommerce Variation Swatches plugin replaces the default dropdown fields for variable products with visually appealing swatches, making it easier for customers to select product options and improve the overall shopping experience.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woo-brands\" rel=\"ugc\">WooCommerce Brands</a></strong> &#8211; WooCommerce Brands taxonomy plugin allows for easy cataloging of products by adding a brand taxonomy, making it simple to organize and filter products on an online store.</p>\n<h3>📣 Social Plugins</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-dribbble-portfolio\" rel=\"ugc\">Dribbble Portfolio</a></strong> &#8211; Dribbble Portfolio WP plugin enables you to display your Dribbble shots on your website in a portfolio layout, allowing you to showcase your design work to a wider audience.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-pinterest-portfolio\" rel=\"ugc\">Pinterest Portfolio</a></strong> &#8211; Pinterest plugin for WordPress allows you to display your Pinterest pins on your website, giving your audience a chance to view and interact with your boards, and potentially drive more traffic to your Pinterest profile.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-instagram-portfolio/\" rel=\"ugc\">Instagram Portfolio</a></strong> &#8211; Instagram plugin for WordPress allows you to display your Instagram posts on your website, making it easy for visitors to view and interact with your content and also to increase engagement on your website.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-envato-portfolio\" rel=\"ugc\">Portfolio &#8211; Envato</a></strong> &#8211; Envato Portfolio Plugin allows you to display your Themeforest and Codecanyon items on your website, showcasing your digital products and making them easily accessible for potential customers.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-youtube-gallery\" rel=\"ugc\">Youtube Gallery</a></strong> &#8211; YouTube Gallery plugin allows you to display videos from a YouTube channel or playlist on your website, creating a visually appealing gallery and making it easy for visitors to access and watch your videos.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/feeds-of-twitter\" rel=\"ugc\">Twitter Feeds</a></strong> &#8211; Twitter Feeds plugin displays Twitter feeds, hashtags, user cards, and collections on a website, making it easy for visitors to view and interact with your Twitter content.</p>\n<h3>🏆 Branding Plugin</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-custom-login\" rel=\"ugc\">Custom Login</a></strong> &#8211; GS Custom Login allows you to customize the WordPress login screen, providing an easy way to create a unique and visually appealing login experience for your website users.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/powerup\" rel=\"ugc\">PowerUp</a></strong> &#8211; Enhance Your WordPress Experience with the Ultimate Security &amp; Convenience Solution &#8211; Hide Admin Bar, Login &amp; Logout Redirection, Disable Comments &amp; Restrict WP-Admin Module.</p>\n",
        "installation": "<p>Install the Plugin with Ease: Step-by-Step Guide:</p>\n<ul>\n<li>Get visual assistance and a detailed usage guide by clicking on the <strong><a href=\"https://docs.gsplugins.com/gs-behance-portfolio\" rel=\"nofollow ugc\">Visual Installation &amp; Usage Guide &raquo;</a></strong></li>\n</ul>\n<h4>Install by Search Plugin</h4>\n<ul>\n<li>In your Admin, go to menu Plugins &gt; Add New</li>\n<li>Search <strong>GS Behance Portfolio</strong></li>\n<li>Click to install</li>\n<li>Activate the plugin</li>\n<li><strong>Behance Portfolio</strong> menu will be available.</li>\n</ul>\n<h4>Install by Upload Plugin</h4>\n<ul>\n<li>Download the latest version of GS Behance Portfolio (.zip file)</li>\n<li>In your Admin, go to menu Plugins &gt; Add New</li>\n<li>Select <strong>Upload Plugin</strong></li>\n<li>Click on <strong>Choose File</strong></li>\n<li>Select downloaded <strong><em>gs-behance-portfolio.zip</em></strong> &amp; click on <strong>Install Now</strong> button</li>\n<li>Activate the plugin</li>\n<li><strong>Behance Portfolio</strong> menu will be available.</li>\n</ul>\n<h4>Install Plugin using FTP</h4>\n<ul>\n<li>Upload <strong>gs-behance-portfolio-lite</strong> folder inside the <strong><em>/wp-content/plugins/</em></strong> directory</li>\n<li>Go to WordPress dashboard &gt; Plugins &amp; Activate the GS Behance Portfolio plugin</li>\n<li><strong>Behance Portfolio</strong> menu will be available.</li>\n</ul>\n<h4>Display on the website:</h4>\n<ul>\n<li>Use the <code>[gs_behance id=#]</code> shortcode or select a different theme.</li>\n<li>Place the shortcode where you want to display projects.</li>\n</ul>\n",
        "faq": "\n<dt id='how%20do%20i%20create%20apps%20to%20get%20behance%20access%20token%3F'>\nHow do I create apps to get Behance Access Token?\n</h4>\n<p>\n<p>The Behance API has been deprecated, and it is no longer possible to register new apps to obtain a Behance Access Token.</p>\n</p>\n<dt id='as%20behance%20doesn%E2%80%99t%20issue%20api%20keys%2C%20how%20can%20i%20use%20the%20gs%20behance%20portfolio%20plugin%3F'>\nAs Behance doesn’t issue API keys, how can I use the GS Behance Portfolio plugin?\n</h4>\n<p>\n<p>We&#8217;ve updated the plugin, and the exciting news is that you no longer need a Behance Access Token! You can now feature projects on your site without requiring a Behance API key.</p>\n</p>\n<dt id='how%20to%20install%20gs%20behance%20portfolio%20plugin%3F'>\nHow to install GS Behance Portfolio plugin?\n</h4>\n<p>\n<p>You can install the GS Behance Portfolio plugin like any standard WordPress plugin. Use the <strong>Upload Plugin</strong> method for installation.</p>\n<ul>\n<li><strong>Download the Plugin</strong>: Log in and download the latest GS Behance Portfolio plugin (.zip file) from your Purchase History.</li>\n<li><strong>Upload the Plugin</strong>: In the WordPress Admin Dashboard, go to <strong>Plugins &gt; Add New</strong>, then select <strong>Upload Plugin</strong>.</li>\n<li><strong>Choose the File</strong>: Click <strong>Choose File</strong>, select the <em>gs-behance-portfolio.zip</em> file you downloaded, and click <strong>Install Now</strong>.</li>\n<li><strong>Activate the Plugin</strong>: After the installation completes, activate the plugin.</li>\n<li><strong>Access Plugin Settings</strong>: Navigate to <strong>Behance Portfolio &gt; Shortcode</strong> in the admin menu.</li>\n<li><strong>Activate Your License</strong>: Enter your license key to activate the plugin fully.</li>\n<li><strong>Generate Shortcode</strong>: Create a shortcode to display your Behance projects on your site.</li>\n</ul>\n</p>\n<dt id='how%20to%20use%20shortcode%20inside%20page%20templates%3F'>\nHow to use shortcode inside page templates?\n</h4>\n<p>\n<p>WordPress provides a useful function, <strong>do_shortcode()</strong>, which lets you insert shortcodes directly into your theme files. For instance, to display Behance Projects in a theme file, you would use the following code:</p>\n<pre><code>&lt;?php echo do_shortcode('[gs_behance id=#']); ?&gt;\n</code></pre>\n</p>\n<dt id='is%20there%20any%20widget%20available%20to%20display%20projects%3F'>\nIs there any Widget available to display projects?\n</h4>\n<p>\n<p>Yes, a widget is available called GS Behance Portfolio. Simply drag and drop it into your desired widget area. Add a title and specify the number of projects to display. You can also choose from existing shortcodes.</p>\n</p>\n<dt id='how%20many%20different%20views%20%2F%20themes%20are%20available%20to%20display%20behance%20projects%3F'>\nHow many different views / themes are available to display Behance projects?\n</h4>\n<p>\n<p>Currently, there are seven unique themes for showcasing Behance projects: Projects, Projects Stat, Hover, Popup, Slider, Profile, and Filter.</p>\n</p>\n<dt id='is%20there%20any%20way%20to%20filter%20behance%20projects%3F'>\nIs there any way to filter Behance projects?\n</h4>\n<p>\n<p>Absolutely, you can utilize the Filter Theme (gs_beh_theme7). It allows filtering functionality based on the Behance Creative Fields.</p>\n</p>\n<dt id='is%20there%20any%20way%20to%20re-order%20%2F%20custom%20order%20to%20display%20projects%3F'>\nIs there any way to Re-Order / Custom order to display Projects?\n</h4>\n<p>\n<p>Not yet but we have plans to add this functionality in the future.</p>\n</p>\n<dt id='is%20gs%20behance%20portfolio%20responsive%3F'>\nIs GS Behance Portfolio responsive?\n</h4>\n<p>\n<p>Yes the plugin is responsive and works well across viewports of various sizes.</p>\n</p>\n<dt id='what%20is%20the%20reason%20for%20projects%20not%20being%20displayed%20beyond%20the%20first%2012%3F'>\nWhat is the reason for projects not being displayed beyond the first 12?\n</h4>\n<p>\n<p>We recognize the current limitation on the number of projects displayed. Previously, we were able to show an unlimited number of projects. However, due to a recent Behance API update, we are now restricted to displaying a maximum of 12 projects. Regrettably, since this constraint is from Behance, it is outside of our control.</p>\n<p>To avoid any confusion, we may consider removing the <strong>Total Projects</strong> field in the future.</p>\n</p>\n\n",
        "changelog": "<h4>Version 3.0.6 [29th Nov 2023]</h4>\n<ul>\n<li>[Fixed]: Mobile Column Issue.</li>\n</ul>\n<h4>Version 3.0.5 [28th Nov 2023]</h4>\n<ul>\n<li>[Fixed]: Free Template Disappered Issue.</li>\n<li>[Fixed]: Gutenberg Block Icon.</li>\n<li>[Fixed]: Asset Generator.</li>\n</ul>\n<h4>Version 3.0.4 [25th Nov 2023]</h4>\n<ul>\n<li>[Fixed]: Behance Projects Caching Issue.</li>\n</ul>\n<h4>Version 3.0.3 [23rd Nov 2023]</h4>\n<ul>\n<li>[Added]: Divi Builder Integration.</li>\n<li>[Added]: Beaver Builder Integration.</li>\n<li>[Added]: Oxygen Builder Integration.</li>\n<li>[Added]: Template Loader.</li>\n<li>[Added]: Popup, Slider &amp; Filter.</li>\n<li>[Added]: Slider Control.</li>\n<li>[Fixed]: Shortcode Builder.</li>\n<li>[Fixed]: Database Issue.</li>\n<li>[Fixed]: Assets Generator Restructure.</li>\n<li>[Updated]: Preferences Vue File.</li>\n<li>[Updated]: Purge Hooks.</li>\n<li>[Updated]: Container and Row Class.</li>\n<li>[Updated]: Freemius SDK 2.6.0</li>\n</ul>\n<h4>Version 3.0.2 [6th Jul 2023]</h4>\n<ul>\n<li>[Updated]: Freemius SDK to the latest version.</li>\n</ul>\n<h4>version 3.0.1 [21st Jun 2023]</h4>\n<ul>\n<li>[Updated]: Freemius SDK.</li>\n<li>[Removed]: Notices from the Account Page.</li>\n</ul>\n<h4>version 3.0.0 [19th Jun 2023]</h4>\n<ul>\n<li>[Updated]: Releasing via Freemius.</li>\n</ul>\n<h4>version 2.2.7 [22nd Mar 2023]</h4>\n<ul>\n<li>[Fixed]: Missing slash inside build file.</li>\n</ul>\n<h4>version 2.2.6 [21st Mar 2023]</h4>\n<ul>\n<li>[Fixed]: Array to string conversion notice.</li>\n</ul>\n<h4>version 2.2.5 [20th Mar 2023]</h4>\n<ul>\n<li>[Fixed]: Warning.</li>\n</ul>\n<h4>version 2.2.4 [20th Mar 2023]</h4>\n<ul>\n<li>[Added]: Option (on/off) to disable Lazy Load at the Preference Tab.</li>\n<li>[Added]: Class field option to exclude Lazy Loading.</li>\n<li>[Added]: Default skip-lazy Function.</li>\n<li>[Fixed]: Ajax Error.</li>\n</ul>\n<h4>version 2.2.3 [7th Mar 2023]</h4>\n<ul>\n<li>[Removed]: Notices from the License Page.</li>\n</ul>\n<h4>version 2.2.2 [28th Feb 2023]</h4>\n<ul>\n<li>[Renamed]: Namespaces.</li>\n</ul>\n<h4>version 2.2.1 [27th Feb 2023]</h4>\n<ul>\n<li>[Added]: AppSero.</li>\n<li>[Added]: Redirection on plugin activation.</li>\n<li>[Fixed]: Shortcode Reload Issue.</li>\n</ul>\n<h4>version 2.2.0 [16th Feb 2023]</h4>\n<p>[Improved]: Rewritten Behance Plugin.</p>\n<h4>version 1.0.6 [24th May 2021]</h4>\n<ul>\n<li>[Fixed]: PHP 7.3 Compatibility.</li>\n<li>[Fixed]: Deprecated Function Warning.</li>\n</ul>\n<h4>version 1.0.5 [19th Dec 2020]</h4>\n<ul>\n<li>[Updated]: AppSero Client.</li>\n<li>[Updated]: With WordPress version 5.6</li>\n</ul>\n<h4>Version 1.0.4 [13th Aug 20]</h4>\n<ul>\n<li>[Updated]: With WordPress latest version.</li>\n</ul>\n<h4>Version 1.0.3 [11th Jul 20]</h4>\n<ul>\n<li>[Added]: Appsero client.</li>\n<li>[Added]: Review system.</li>\n</ul>\n<h4>version 1.0.2 [25th Nov 19]</h4>\n<ul>\n<li>[Fixed]: Domain name with www &amp; fixed all urls.</li>\n<li>[Updated]: With WordPress latest version.</li>\n</ul>\n<h4>Version 1.0.1 [21st Oct 19]</h4>\n<ul>\n<li>[Fixed]: Domain name changed &amp; fixed all urls.</li>\n<li>[Added]: New Contributors.</li>\n</ul>\n<h4>Version 1.0.0</h4>\n<ul>\n<li>Initial release</li>\n</ul>\n"
    },
    "short_description": "The Best Behance WordPress Plugin to Make Portfolio, Gallery, Grid, Slider without API",
    "description": "<p>Introducing the best responsive Behance plugin for WordPress to showcase your Behance projects with style and ease. The <strong>GS Behance Portfolio</strong> plugin allows you to display your work anywhere on your site using shortcodes, making it incredibly versatile. Packed with essential control options and a variety of themes, this plugin ensures your projects are showcased elegantly with eye-catching effects that captivate your audience.</p>\n<p>Simple, flexible, and powerful, the <em>Behance Portfolio Plugin</em> is designed to meet your needs effortlessly. Whether you&#8217;re a designer, photographer, or creative professional, this plugin provides the perfect platform to present your portfolio in the most appealing way possible.</p>\n<p>🔥 <strong>Behance API Key is NOT Needed!</strong> 🔥</p>\n<p>🎬 <a href=\"https://behance.gsplugins.com\" rel=\"nofollow ugc\">Live Demo</a> ⬆️ <a href=\"https://www.gsplugins.com/product/gs-behance-portfolio\" rel=\"nofollow ugc\">Upgrade to PRO</a> 📚 <a href=\"https://docs.gsplugins.com/gs-behance-portfolio\" rel=\"nofollow ugc\">Documentation</a> 🙋‍♂️ <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a></p>\n<h3>Why use the GS Behance Portfolio Plugin</h3>\n<p>Behance is a premier platform for creatives to share their portfolios, offering extensive visibility and networking opportunities within a vibrant community of professionals. It helps designers, photographers, and artists to showcase their work, gain feedback, and connect with potential clients and collaborators. The GS Behance Portfolio Plugin seamlessly integrates your Behance projects into your WordPress site, providing an elegant and efficient way to display your portfolio and attract more attention to your work.</p>\n<h3>What Sets GS Behance Plugin Apart?</h3>\n<ul>\n<li><strong>Responsive and Customizable Design</strong>: The GS Behance Plugin is built to be responsive, ensuring your portfolio looks great on all devices. It offers multiple column options and works seamlessly with any standard WordPress theme, making it easy to customize to match your site’s design. Additionally, developer-friendly features and support for custom CSS allow for further personalization.</li>\n<li><strong>Versatile Display Options</strong>: With the ability to display Behance projects anywhere using the shortcode [gs_behance id=1]<br />\nand widgets, you have flexible options for showcasing your work. The plugin supports various display settings, including project titles, appreciations count, views count, and comment count, giving you comprehensive ways to present your portfolio.</li>\n<li><strong>Advanced Pro Features</strong>: Upgrading to the pro version unlocks seven unique themes, such as Projects, Projects Stat, Hover, Popup, Slider, Profile, and Filter. These themes provide diverse and dynamic ways to display your portfolio. Pro users also benefit from custom CSS options, priority email support, and free installation services, ensuring a premium user experience.</li>\n<li><strong>Effortless Setup and Maintenance</strong>: Setting up the GS Behance Plugin is straightforward, and it comes with detailed documentation and support. Pro users receive additional benefits like regular updates, auto-update notifications, and the convenience of updating directly from the dashboard. This ensures your plugin remains up-to-date with minimal effort.</li>\n</ul>\n<h3>Plugin&#8217;s Key Features</h3>\n<ul>\n<li><strong>Responsive Design</strong>: Ensures your Behance portfolio looks stunning and functions seamlessly across all devices and viewport sizes.</li>\n<li><strong>Different Column Options</strong>: Choose between 3-column or 4-column layouts to best showcase your projects.</li>\n<li><strong>Compatibility</strong>: Works with any standard WordPress theme for easy integration.</li>\n<li><strong>Developer Friendly</strong>: Easy to customize with developer-friendly features and settings.</li>\n<li><strong>Browser Support</strong>: Fully supported across all modern browsers for a consistent experience.</li>\n<li><strong>W3C Valid Markup</strong>: Adheres to W3C standards for clean and valid HTML markup.</li>\n<li><strong>Shortcodes &amp; Widgets</strong>: Display Behance projects anywhere on your site using the [gs_behance id=1] shortcode and widgets.</li>\n<li><strong>Projects Title Display</strong>: Show project titles prominently to enhance visibility.</li>\n<li><strong>Projects Appreciations Count</strong>: Display the number of appreciations each project has received.</li>\n<li><strong>Projects Views Count</strong>: Showcase the total views for each project.</li>\n<li><strong>Projects Comment Count</strong>: Show the number of comments each project has collected.</li>\n<li><strong>Custom CSS</strong>: Add your own custom CSS to tailor the plugin’s appearance to your preferences.</li>\n<li><strong>Easy Setup</strong>: Simple to install and configure, even for beginners.</li>\n<li><strong>Pro Features</strong>:</li>\n<li><strong>7 Different Themes</strong>: Choose from 7 unique themes to match your site&#8217;s style**:\n<ul>\n<li><strong>Theme 01 – Projects</strong>: Classic project display.</li>\n<li><strong>Theme 02 – Projects Stat</strong>: Emphasizes project statistics.</li>\n<li><strong>Theme 03 – Hover</strong>: Interactive hover effects.</li>\n<li><strong>Theme 04 – Popup</strong>: Projects in a popup view.</li>\n<li><strong>Theme 05 – Slider</strong>: Sliding carousel of projects.</li>\n<li><strong>Theme 06 – Profile</strong>: Showcases projects in a profile format.</li>\n<li><strong>Theme 07 – Filter</strong>: Filterable project display.</li>\n</ul>\n</li>\n<li><strong>Field-wise Projects</strong>: Organize projects by different fields for better categorization.</li>\n<li><strong>Priority Email Support</strong>: Receive priority support via email for any plugin-related queries.</li>\n<li><strong>Free Installation</strong>: Free installation assistance available if needed.</li>\n<li><strong>Regular Updates</strong>: Receive continual updates to keep your plugin current.</li>\n<li><strong>Auto Update Notification</strong>: Get notified automatically about new updates.</li>\n<li><strong>Auto Update from Dashboard</strong>: Easily update the plugin directly from your WordPress dashboard.</li>\n<li><strong>Well Documented</strong>: Comprehensive documentation and support to help you get the most out of the Plugin.</li>\n<li><strong>Live Demos</strong>: 🎬 <a href=\"https://behance.gsplugins.com\" rel=\"nofollow ugc\">View live Demos &raquo;</a></li>\n<li><strong>Upgrade to PRO</strong>: ⬆️ <a href=\"https://www.gsplugins.com/product/gs-behance-portfolio\" rel=\"nofollow ugc\">Upgrade to PRO &raquo;</a></li>\n</ul>\n<h3>General Settings</h3>\n<p>Go to <strong>Behance Portfolio &gt; Shortcode</strong>. Once inside, you’ll see the General Settings tab. Here, you can either create a new Shortcode or edit the existing ones (if already created).</p>\n<ul>\n<li><strong>Shortcode Name</strong>: Assign an unique Shortcode name here.</li>\n<li><strong>User ID</strong>: Enter Behance username ID in this box.</li>\n<li><strong>Total Projects</strong>: Set the number of projects you want shown with your Shortcode. By default, it shows 6 projects.</li>\n<li><strong>Theme</strong>: From 7 types of themes available, choose one that best shows your Behance projects.</li>\n<li><strong>Projects Link Target</strong>: Set whether clicking on the project’s link opens in a new tab or in the same window.</li>\n<li><strong><em>Slider Theme Settings (When Enabled Slider)</em></strong>:\n<ul>\n<li><strong>Speed</strong>: Adjust slider speed.</li>\n<li><strong>Enable Autoplay</strong>: Toggle slider autoplay on or off.</li>\n<li><strong>Delay</strong>: Set the time the slider should wait before starting to autoplay the projects. </li>\n</ul>\n</li>\n</ul>\n<h3>Style Settings</h3>\n<p>Go to <strong>Behance Portfolio &gt; Shortcode</strong>. Here, you can either create a new Shortcode or edit the existing ones. Once inside, beside the General Settings tab, you’ll see the tab for adjusting Style Settings.</p>\n<ul>\n<li><strong>Desktop Columns</strong>: Set the number of columns to show on desktop screens.</li>\n<li><strong>Tablet Columns</strong>: Configure the number of columns for optimal tablet viewing.</li>\n<li><strong>Portrait Mobile Columns</strong>: Adjust the column count for portrait mobile viewing.</li>\n<li><strong>Mobile Columns</strong>: Tailor the column count to suit mobile screen sizes.</li>\n</ul>\n<h3>Preferences</h3>\n<p><strong>Sync Interval</strong>: Adjust automatic Behance data synchronization interval time from here. However, this process can also be manually done by clicking on <strong>Tools</strong> (beside preferences, in the same navigation bar) and then clicking the <strong>SYNC DATA NOW</strong> button.</p>\n<p>Go to <strong>Behance Portfolio &gt; Shortcode</strong>. On the top right navigation bar, click on Preferences. You’ll see the following fields:</p>\n<ul>\n<li><strong>Disable Lazy Load</strong>: Toggle lazy loading for the Behance projects.</li>\n<li><strong>Lazy Load Class</strong>: Assign a class to disable lazy loading, each class should be separated by a space.</li>\n<li><strong>Custom CSS</strong>: Include your custom CSS into the Shortcode to get full control over the look and feel of your project presentations.</li>\n</ul>\n<h3>Page Builder Support</h3>\n<ul>\n<li>Gutenberg</li>\n<li>Elementor</li>\n</ul>\n<h3>GS Behance Portfolio&#8217;s shortcode usage</h3>\n<p>Choose a theme and other parameters to customize your display. The shortcode will be generated with an ID, like [gs_behance id=1]</p>\n<p>Basic Usage &#8211;</p>\n<pre><code>[gs_behance id=1]\n</code></pre>\n<p><strong>Shortcode PHP Usage</strong></p>\n<pre><code>&lt;?php echo do_shortcode( '[gs_behance id=1]' ); ?&gt;\n</code></pre>\n<h3>Documentation</h3>\n<p>If you have any questions regarding the <strong>WordPress Behance plugin</strong> and how to work with it, We recommend referring to our comprehensive online documentation. It provides detailed information and instructions to assist you in navigating and utilizing the plugin effectively. You can find the <a href=\"https://docs.gsplugins.com/gs-behance-portfolio\" rel=\"nofollow ugc\">Documentation</a> here.</p>\n<h3>Quick Support &amp; Bug Reporting</h3>\n<p>If you encounter any problems or discover bugs, please post them in our <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a> channel. We aim to respond as soon as possible (excluding holidays).</p>\n<p><strong><em>Pro users are requested to contact our support channel for dedicated assistance.</em></strong></p>\n<p>🙋‍♂️ Alternatively, you can reach out to us through our <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a> or <a href=\"https://wordpress.org/support/plugin/gs-behance-portfolio/\" rel=\"ugc\">WordPress.org</a> support forum.</p>\n<h3>Development Team</h3>\n<p>Crafted and Developed with Passion by <a href=\"https://www.gsplugins.com\" rel=\"nofollow ugc\">GS Plugins</a></p>\n<h3>Confused?</h3>\n<p>🎬 <a href=\"https://behance.gsplugins.com\" rel=\"nofollow ugc\">View live Demos &raquo;</a><br />\n📚 <a href=\"https://docs.gsplugins.com/gs-behance-portfolio\" rel=\"nofollow ugc\">Documentation &raquo;</a></p>\n<h3>🔥 You may like other plugins from <a href=\"https://www.gsplugins.com\" rel=\"nofollow ugc\">GS Plugins</a></h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-testimonial\" rel=\"ugc\">Testimonial Slider</a></strong> &#8211; Testimonials slider displays rotating customer endorsements and recommendations, helping to build trust and credibility for a business or product.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-logo-slider\" rel=\"ugc\">Logo Slider</a></strong> &#8211; Logo slider displays rotating logos of partners, clients, or sponsors, showcasing a business&#8217;s relationships and endorsements.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-portfolio/\" rel=\"ugc\">Portfolio</a></strong> &#8211; Filterable Portfolio plugin for WordPress allows you to easily display and showcase your projects, highlighting your skills and abilities.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-team-members\" rel=\"ugc\">Team Members</a></strong> &#8211; Build a Stunning Team Page or Section and Show off Your Team&#8217;s Talents!</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-projects\" rel=\"ugc\">Projects</a></strong> &#8211; Projects showcase displays detailed information including client reviews, ratings, galleries, and videos for a business&#8217;s work.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-books-showcase\" rel=\"ugc\">Books Showcase</a></strong> &#8211; Books showcase displays detailed information including author, published date, reviews, ratings, and gallery, allowing users to easily find and explore books.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-coach\" rel=\"ugc\">Coaches</a></strong> &#8211; Coaches plugin displays coaches&#8217; experience, skills, reviews, ratings, and certifications, helping users find the right coach for their needs.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/posts-grid\" rel=\"ugc\">Posts Grid</a></strong> &#8211;  WordPress Posts Grid plugin displays the latest posts in an elegant grid format, allowing for easy navigation and quick access to new content on a website.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/posts-widget\" rel=\"ugc\">Posts Widget</a></strong> &#8211;  WordPress Posts Widget plugin displays the latest posts in an elegant format on the sidebar or any widget area, allowing for easy navigation and quick access to new content on a website.</p>\n<h3>🎯 WooCommerce Plugins</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woocommerce-products-slider\" rel=\"ugc\">WooCommerce Products Slider</a></strong> &#8211; WooCommerce Product Slider plugin displays products in a visually pleasing, sliding manner, making it easy for customers to browse and find the products they want on an online store.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woo-variation-swatches\" rel=\"ugc\">WooCommerce Variation Swatches</a></strong> &#8211; WooCommerce Variation Swatches plugin replaces the default dropdown fields for variable products with visually appealing swatches, making it easier for customers to select product options and improve the overall shopping experience.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woo-brands\" rel=\"ugc\">WooCommerce Brands</a></strong> &#8211; WooCommerce Brands taxonomy plugin allows for easy cataloging of products by adding a brand taxonomy, making it simple to organize and filter products on an online store.</p>\n<h3>📣 Social Plugins</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-dribbble-portfolio\" rel=\"ugc\">Dribbble Portfolio</a></strong> &#8211; Dribbble Portfolio WP plugin enables you to display your Dribbble shots on your website in a portfolio layout, allowing you to showcase your design work to a wider audience.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-pinterest-portfolio\" rel=\"ugc\">Pinterest Portfolio</a></strong> &#8211; Pinterest plugin for WordPress allows you to display your Pinterest pins on your website, giving your audience a chance to view and interact with your boards, and potentially drive more traffic to your Pinterest profile.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-instagram-portfolio/\" rel=\"ugc\">Instagram Portfolio</a></strong> &#8211; Instagram plugin for WordPress allows you to display your Instagram posts on your website, making it easy for visitors to view and interact with your content and also to increase engagement on your website.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-envato-portfolio\" rel=\"ugc\">Portfolio &#8211; Envato</a></strong> &#8211; Envato Portfolio Plugin allows you to display your Themeforest and Codecanyon items on your website, showcasing your digital products and making them easily accessible for potential customers.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-youtube-gallery\" rel=\"ugc\">Youtube Gallery</a></strong> &#8211; YouTube Gallery plugin allows you to display videos from a YouTube channel or playlist on your website, creating a visually appealing gallery and making it easy for visitors to access and watch your videos.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/feeds-of-twitter\" rel=\"ugc\">Twitter Feeds</a></strong> &#8211; Twitter Feeds plugin displays Twitter feeds, hashtags, user cards, and collections on a website, making it easy for visitors to view and interact with your Twitter content.</p>\n<h3>🏆 Branding Plugin</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-custom-login\" rel=\"ugc\">Custom Login</a></strong> &#8211; GS Custom Login allows you to customize the WordPress login screen, providing an easy way to create a unique and visually appealing login experience for your website users.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/powerup\" rel=\"ugc\">PowerUp</a></strong> &#8211; Enhance Your WordPress Experience with the Ultimate Security &amp; Convenience Solution &#8211; Hide Admin Bar, Login &amp; Logout Redirection, Disable Comments &amp; Restrict WP-Admin Module.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/gs-behance-portfolio.3.0.6.zip",
    "upgrade_notice": {
        "Version 3.0.6 [29th Nov 2023]": "<ul>\n<li>[Fixed]: Mobile Column Issue.</li>\n</ul>",
        "Version 3.0.5 [28th Nov 2023]": "<ul>\n<li>[Fixed]: Free Template Disappered Issue.</li>\n<li>[Fixed]: Gutenberg Block Icon.</li>\n<li>[Fixed]: Asset Generator.</li>\n</ul>",
        "Version 3.0.4 [25th Nov 2023]": "<ul>\n<li>[Fixed]: Behance Projects Caching Issue.</li>\n</ul>",
        "Version 3.0.3 [23rd Nov 2023]": "<ul>\n<li>[Added]: Divi Builder Integration.</li>\n<li>[Added]: Beaver Builder Integration.</li>\n<li>[Added]: Oxygen Builder Integration.</li>\n<li>[Added]: Template Loader.</li>\n<li>[Added]: Popup, Slider &amp; Filter.</li>\n<li>[Added]: Slider Control.</li>\n<li>[Fixed]: Shortcode Builder.</li>\n<li>[Fixed]: Database Issue.</li>\n<li>[Fixed]: Assets Generator Restructure.</li>\n<li>[Updated]: Preferences Vue File.</li>\n<li>[Updated]: Purge Hooks.</li>\n<li>[Updated]: Container and Row Class.</li>\n<li>[Updated]: Freemius SDK 2.6.0</li>\n</ul>",
        "Version 3.0.2 [6th Jul 2023]": "<ul>\n<li>[Updated]: Freemius SDK to the latest version.</li>\n</ul>",
        "version 3.0.1 [21st Jun 2023]": "<ul>\n<li>[Updated]: Freemius SDK.</li>\n<li>[Removed]: Notices from the Account Page.</li>\n</ul>",
        "version 3.0.0 [19th Jun 2023]": "<ul>\n<li>[Updated]: Releasing via Freemius.</li>\n</ul>",
        "version 2.2.7 [22nd Mar 2023]": "<ul>\n<li>[Fixed]: Missing slash inside build file.</li>\n</ul>",
        "version 2.2.6 [21st Mar 2023]": "<ul>\n<li>[Fixed]: Array to string conversion notice.</li>\n</ul>",
        "version 2.2.5 [20th Mar 2023]": "<ul>\n<li>[Fixed]: Warning.</li>\n</ul>",
        "version 2.2.4 [20th Mar 2023]": "<ul>\n<li>[Added]: Option (on/off) to disable Lazy Load at the Preference Tab.</li>\n<li>[Added]: Class field option to exclude Lazy Loading.</li>\n<li>[Added]: Default skip-lazy Function.</li>\n<li>[Fixed]: Ajax Error.</li>\n</ul>",
        "version 2.2.3 [7th Mar 2023]": "<ul>\n<li>[Removed]: Notices from the License Page.</li>\n</ul>",
        "version 2.2.2 [28th Feb 2023]": "<ul>\n<li>[Renamed]: Namespaces.</li>\n</ul>",
        "version 2.2.1 [27th Feb 2023]": "<ul>\n<li>[Added]: AppSero.</li>\n<li>[Added]: Redirection on plugin activation.</li>\n<li>[Fixed]: Shortcode Reload Issue.</li>\n</ul>",
        "version 2.2.0 [16th Feb 2023]": "<p>[Improved]: Rewritten Behance Plugin.</p>",
        "version 1.0.6 [24th May 2021]": "<ul>\n<li>[Fixed]: PHP 7.3 Compatibility.</li>\n<li>[Fixed]: Deprecated Function Warning.</li>\n</ul>",
        "version 1.0.5 [19th Dec 2020]": "<ul>\n<li>[Updated]: AppSero Client.</li>\n<li>[Updated]: With WordPress version 5.6</li>\n</ul>",
        "Version 1.0.4 [13th Aug 20]": "<ul>\n<li>[Updated]: With WordPress latest version.</li>\n</ul>",
        "Version 1.0.3 [11th Jul 20]": "<ul>\n<li>[Added]: Appsero client.</li>\n<li>[Added]: Review system.</li>\n</ul>",
        "version 1.0.2 [25th Nov 19]": "<ul>\n<li>[Fixed]: Domain name with www &amp; fixed all urls.</li>\n<li>[Updated]: With WordPress latest version.</li>\n</ul>",
        "Version 1.0.1 [21st Oct 19]": "<ul>\n<li>[Fixed]: Domain name changed &amp; fixed all urls.</li>\n<li>[Added]: New Contributors.</li>\n</ul>",
        "Version 1.0.0": "<ul>\n<li>Initial release</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/gs-behance-portfolio/assets/screenshot-1.png?rev=1475270",
            "caption": "GS Behance Portfolio With Theme 01 - Projects"
        },
        {
            "src": "https://ps.w.org/gs-behance-portfolio/assets/screenshot-2.png?rev=1475270",
            "caption": "GS Behance Portfolio With Theme 02 - Project Views"
        },
        {
            "src": "https://ps.w.org/gs-behance-portfolio/assets/screenshot-3.gif?rev=2856441",
            "caption": "GS Behance Portfolio With Theme 03 - Hover"
        },
        {
            "src": "https://ps.w.org/gs-behance-portfolio/assets/screenshot-4.gif?rev=2857577",
            "caption": "GS Behance Portfolio With Theme 04 - Popup"
        },
        {
            "src": "https://ps.w.org/gs-behance-portfolio/assets/screenshot-5.gif?rev=2858105",
            "caption": "GS Behance Portfolio With Theme 05 - Slider"
        },
        {
            "src": "https://ps.w.org/gs-behance-portfolio/assets/screenshot-6.png?rev=1475270",
            "caption": "GS Behance Portfolio With Theme 06 - Profile"
        },
        {
            "src": "https://ps.w.org/gs-behance-portfolio/assets/screenshot-7.png?rev=1475270",
            "caption": "GS Behance Shortcode Generator"
        },
        {
            "src": "https://ps.w.org/gs-behance-portfolio/assets/screenshot-8.png?rev=1475270",
            "caption": "GS Behance Portfolio Widget"
        },
        {
            "src": "https://ps.w.org/gs-behance-portfolio/assets/screenshot-9.png?rev=2021687",
            "caption": "GS Behance Portfolio With Theme 07 - Filter"
        },
        {
            "src": "https://ps.w.org/gs-behance-portfolio/assets/screenshot-10.png?rev=2021687",
            "caption": "GS Behance Portfolio Field wise Projects"
        }
    ],
    "tags": {
        "behance": "behance",
        "behance-gallery-plugin": "behance gallery plugin",
        "behance-plugin": "behance plugin",
        "behance-wordpress": "behance wordpress",
        "wordpress-behance-plugin": "wordpress behance plugin"
    },
    "stable_tag": "3.0.6",
    "versions": {
        "3.0.0": "https://downloads.wordpress.org/plugin/gs-behance-portfolio.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/gs-behance-portfolio.3.0.1.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/gs-behance-portfolio.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/gs-behance-portfolio.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/gs-behance-portfolio.3.0.4.zip",
        "3.0.5": "https://downloads.wordpress.org/plugin/gs-behance-portfolio.3.0.5.zip",
        "3.0.6": "https://downloads.wordpress.org/plugin/gs-behance-portfolio.3.0.6.zip",
        "trunk": "https://downloads.wordpress.org/plugin/gs-behance-portfolio.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.paypal.com/donate/?hosted_button_id=K7K8YF4U3SCNQ",
    "banners": {
        "low": "https://ps.w.org/gs-behance-portfolio/assets/banner-772x250.png?rev=3002464",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/gs-behance-portfolio/assets/icon-128x128.png?rev=3002464"
    },
    "blocks": {
        "gs-beh/behance": {
            "name": "gs-beh/behance",
            "title": "GS Behance"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 86,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}