{
    "name": "Logo Slider &#8211; Logo Showcase, Logo Carousel, Logo Gallery and Client Logo Presentation",
    "slug": "gs-logo-slider",
    "version": "3.7.0",
    "author": "<a href=\"https://www.gsplugins.com\">GS Plugins</a>",
    "author_profile": "https://profiles.wordpress.org/samdani/",
    "contributors": {
        "gsplugins": {
            "profile": "https://profiles.wordpress.org/gsplugins/",
            "avatar": "https://secure.gravatar.com/avatar/f78b1ff4757014dbee6dd0f9e263bdd1?s=96&d=monsterid&r=g",
            "display_name": "GS Plugins"
        },
        "itszaman": {
            "profile": "https://profiles.wordpress.org/itszaman/",
            "avatar": "https://secure.gravatar.com/avatar/92e3e231b1a5ded7b5e32db5e00039b2?s=96&d=monsterid&r=g",
            "display_name": "Md. Sarwar Zaman"
        },
        "samdani": {
            "profile": "https://profiles.wordpress.org/samdani/",
            "avatar": "https://secure.gravatar.com/avatar/2cc43b03989e22b7a8f456d7e3973e05?s=96&d=monsterid&r=g",
            "display_name": "Golam Samdani"
        },
        "itsariful": {
            "profile": "https://profiles.wordpress.org/itsariful/",
            "avatar": "https://secure.gravatar.com/avatar/259ad30925c81ea504be2526de2c292b?s=96&d=monsterid&r=g",
            "display_name": "Ariful Islam"
        },
        "devshakhawat": {
            "profile": "https://profiles.wordpress.org/devshakhawat/",
            "avatar": "https://secure.gravatar.com/avatar/eb8ef64cd18125b98472fcf37ccc22bf?s=96&d=monsterid&r=g",
            "display_name": "Shakhawat Hossain"
        }
    },
    "requires": "4.3",
    "tested": "6.6.1",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 96,
    "ratings": {
        "5": 203,
        "4": 4,
        "3": 3,
        "2": 1,
        "1": 10
    },
    "num_ratings": 221,
    "support_url": "https://wordpress.org/support/plugin/gs-logo-slider/",
    "support_threads": 1,
    "support_threads_resolved": 1,
    "active_installs": 30000,
    "downloaded": 615369,
    "last_updated": "2024-08-19 7:37am GMT",
    "added": "2015-03-30",
    "homepage": "https://www.gsplugins.com/wordpress-plugins",
    "sections": {
        "description": "<p><strong>GS Logo Slider</strong> is a WordPress plugin that simplifies showcasing your partners, clients, brands, and sponsors. It allows you to create a logo slideshow quickly and easily. Featuring logos of respected companies on your website builds trust and credibility, while also boosting brand awareness for your partners, leading to stronger collaborations.</p>\n<p>The plugin is user-friendly, creating a dedicated logo post type and offering a user-friendly Shortcode generator for easy embedding. Its responsive design ensures that responsive sliders look great on all devices, and the lightweight plugin keeps your site running smoothly. Focus on what matters with GS Logo Slider.</p>\n<p>🎬 <a href=\"https://logo.gsplugins.com\" rel=\"nofollow ugc\">Live Demo</a> ⬆️ <a href=\"https://www.gsplugins.com/product/gs-logo-slider\" rel=\"nofollow ugc\">Upgrade to PRO</a> 📚 <a href=\"https://docs.gsplugins.com/gs-logo-slider\" rel=\"nofollow ugc\">Documentation</a> 🙋‍♂️ <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent&#038;listType=playlist&#038;list=PLLrT2alOaYX7BYElWvN_juWXo7yYAcjoh\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Why are logo sliders useful for businesses?</h3>\n<p>Logo sliders help businesses show their partners and clients, building trust and credibility. They save space on the website while highlighting important relationships. Not only it boosts brand recognition but can lead to more collaborations as well.</p>\n<h3>What Sets GS Logo Slider Apart?</h3>\n<ul>\n<li><strong>Responsive Across All Screen Sizes</strong>: This responsive logo slider effortlessly adjusts to any screen dimension, maintaining a polished look on desktops, tablets, and smartphones. Your logo display holds its visual appeal on all devices.</li>\n<li><strong>Comprehensive Documentation</strong>: The plugin includes thorough documentation that assists users with installation, configuration, and advanced customization options. It enables even those with limited technical skills to utilize it effectively.</li>\n<li><strong>Regular Updates</strong>: GS Logo Slider receives frequent updates to integrate the latest advanced features and security improvements. This ensures the plugin stays reliable and compatible with the newest WordPress versions.</li>\n<li><strong>High Performance</strong>: Engineered for speed and efficiency, GS Logo Slider delivers rapid loading times and smooth functionality. Its high performance enhances user experience and minimizes bounce rates.</li>\n</ul>\n<h3>Plugin Features &#8211; Logo Carousel</h3>\n<p><em>GS Logo Slider</em> is a powerful plugin with a rich array of functionalities. Here&#8217;s its huge features list:</p>\n<ul>\n<li><strong>Versatile Layouts</strong>: Choose from a variety of layouts including Grid, List, Table, Filter, Live Filter, Full Width Slider, Center Mode, Variable Width Slider, Vertical Center Slider, Vertical Ticker Up, Vertical Ticker Down, and 2 Rows Slider.</li>\n<li><strong>24 Different Themes</strong>: Choose from a variety of pre-designed themes.</li>\n<li><strong>Image Size Control</strong>: Select logo image sizes from Thumbnail, Medium, Large, or other registered sources.</li>\n<li><strong>Template Override</strong>: Override default templates for a personalized touch.</li>\n<li><strong>Drag &amp; Drop Reorder</strong>: Easily reorder logos as needed.</li>\n<li><strong>Gutenberg Block Available</strong>: Seamlessly integrate logos with the block editor.</li>\n<li><strong>Logo Shortcode Ready</strong>: Easily insert logos using Shortcodes.</li>\n<li><strong>Tooltip Option</strong>: Add informative tooltip descriptions to logos.</li>\n<li><strong>Multiple Sliders on Same Page</strong>: Display sliders from different categories on the same page.</li>\n<li><strong>Advanced Settings Panel</strong>: Comprehensive slider settings panel with all necessary options.</li>\n<li><strong>Slider Customization</strong>: There are customizable options such as adjusting slider carousel speed, slider autoplay pause, navigation, pagination, drag-and-drop feature, and color settings.</li>\n<li><strong>Directional Control</strong>: Logos can move <strong>Right to Left</strong> (default) or <strong>Left to Right</strong> for <em>Slider</em> &amp; <em>Ticker</em> Theme.</li>\n<li><strong>Display Options</strong>: Display logos horizontally or vertically.</li>\n<li><strong>Infinite Loop</strong>: Enable or disable infinite loop.</li>\n<li><strong>Ticker Mode</strong>: Slide in ticker mode, similar to a news scroll.</li>\n<li><strong>Grayscale Feature</strong>: Option to display logos in grayscale.</li>\n<li><strong>Hover Control</strong>: Stop sliding on hover.</li>\n<li><strong>Title Display</strong>: Display logos with or without titles.</li>\n<li><strong>Link Target Specification</strong>: Specify the target for logo links to open in a new tab or same window.</li>\n<li><strong>Transition Control</strong>: Set the number of logos to move during transition effects.</li>\n<li><strong>Shortcode Parameters</strong>: tons of Shortcode parameters for customization.</li>\n<li><strong>Category-wise Logos</strong>: Display logos based on categories.</li>\n<li><strong>Lightweight and Plug-and-Play</strong>: Simple installation with no configuration or extra code required.</li>\n<li><strong>Custom Post Type for Logo Posting</strong>: Dedicated post type for managing logos.</li>\n<li><strong>Compatibility</strong>: Works with all WordPress themes.</li>\n<li><strong>User-Friendly</strong>: It has an easy-to-use user interface for managing, editing, creating, and deleting logos without new knowledge.</li>\n<li><strong>Developer Friendly</strong>: Simple to customize and extend its functionalities using Hooks.</li>\n<li><strong>Priority Email Support</strong>: Get assistance via priority email support.</li>\n<li><strong>Free Installation Help</strong>: Free installation service if needed.</li>\n<li><strong>Continuous Updates</strong>: Stay updated with new features and improvements.</li>\n<li><strong>Auto Update</strong>: Receive notifications for updates and easily update the plugin from your dashboard.</li>\n<li><strong>Well-Documented</strong>: Comprehensive documentation and support.</li>\n</ul>\n<p>The plugin is advanced, feature-rich and is designed to provide a powerful, user-friendly, and customizable solution for displaying logos on your WordPress site.</p>\n<h3>Available Fields While Adding a Logo</h3>\n<p>Adding logos using this responsive carousel slider is very simple. There are only four fields to enter data into. They’re as follows:</p>\n<ul>\n<li><strong>Company Name</strong>: Write the name of the brand of the logo that you’re going to enter here. </li>\n<li><strong>Logo</strong>: Upload the brand logo image here.</li>\n<li><strong>Company URL</strong>: Enter the website’s URL here.</li>\n<li><strong>Logo Categories</strong>: Add new categories for the logo or choose from existing categories (if any).</li>\n</ul>\n<h3>General Settings</h3>\n<p>Go to <strong>GS Logos &gt; Logo Shortcode</strong>. Here, you can either create a new Shortcode or edit the existing ones. Once inside, you’ll see the <strong>General Settings</strong> page.</p>\n<ul>\n<li><strong>Name of the Shortcode</strong>: Decide on a unique name for your Shortcode.</li>\n<li><strong>Style &amp; Theming</strong>: Choose a style or theme for your Shortcode.</li>\n<li><strong>Image Size</strong>: Select the image size for the logos from options such as medium, large and custom.</li>\n<li><strong>Sliding Speed</strong>: Control the slider speed.</li>\n<li><strong>Autoplay</strong>: Turn auto sliding of the logos on or off.</li>\n<li><strong>Autoplay Delay</strong>: Set how long to delay the auto sliding.</li>\n<li><strong>Pause on hover</strong>: Specify if autoplay should cease when the user hovers on a logo.</li>\n<li><strong>Infinite Loop</strong>: Specify whether clicking the next button on the last slide logo will loop back to the first slide, and clicking the previous button on the first slide will loop to the last slide.</li>\n<li><strong>Reverse Direction</strong>: Set logo sliding direction from right to left (default is left to right)</li>\n<li><strong>Slider Navs</strong>: Activate/deactivate logo sliding buttons.</li>\n<li><strong>Navs Position</strong>: Determine the position of the navigation arrows. Options for setting arrow icons are bottom nav, inside/outside the slider component.</li>\n<li><strong>Slider Dots</strong>: Show or hide the dots under the slider. They make the navigation of the logos easier. </li>\n<li><strong>Logo Title</strong>: Opt to display logos with titles or without.</li>\n<li><strong>Logo Category</strong>: Select whether logos should be shown with accompanying titles.</li>\n<li><strong>Secondary Image</strong>: Show different images when hovering on the logos.</li>\n<li><strong>Tooltip</strong>: Decide whether to show tooltips when hovering on images or not.</li>\n</ul>\n<h3>Style Settings</h3>\n<p>Go to <strong>GS Logos &gt; Logo Shortcode</strong>. In the <em>second tab</em> you’ll see the <strong>Style Settings</strong> Page.</p>\n<ul>\n<li><strong>Logo style</strong>: Select whether logos will show in color or in grayscale.</li>\n<li><strong>Adjustable Spacing</strong>: Set the margin between logos in pixel values.</li>\n<li><strong>Desktop Logos</strong>: Set the number of logos to show on desktop screens.</li>\n<li><strong>Tablet Logos</strong>: Choose how many logos to display on tablet screens.</li>\n<li><strong>Mobile Logos</strong>: Configure the list of logos visible on mobile screens.</li>\n<li><strong>Clickable Logos</strong>: Set whether clicking on a logo opens its link on a new page or in the current page. </li>\n</ul>\n<h3>Query Settings</h3>\n<p>Go to GS <strong>Logos &gt; Logo Shortcode</strong>. In the <em>third tab</em>, after the General Settings and the Style Settings tab, you’ll see the <strong>Query Settings</strong> tab.</p>\n<ul>\n<li><strong>Logos</strong>: Set the number of logos you want to show. Default value is -1, and it means all the logos will be shown.</li>\n<li><strong>Order</strong>: Specify the order in which you want your logos to show. The criteria for ordering can be set from the <strong>Order By</strong> field. </li>\n<li><strong>Order By</strong>: Choose whether to order your logos by name, id, date of adding or you can select a custom order of your choice. Also, you can randomize the logo sequence on every page refresh. </li>\n<li><strong>Categories</strong>: Select a specific logo category to display logos from that category. You can select multiple categories here. </li>\n</ul>\n<h3>Preferences</h3>\n<p>Go to <strong>GS Logos &gt; Logo Shortcode</strong>. On the top right navigation bar, click on <strong>Preferences</strong>. You’ll see the following fields:</p>\n<ul>\n<li><strong>Disable Lazy Load</strong>: Disable or enable lazy loading of the logo images.</li>\n<li><strong>Anchor Tag rel</strong>: Choose the value for the Anchor tag&#8217;s <em>rel</em> attribute to enhance security and SEO. By default, the value is set to <strong>dofollow</strong>.</li>\n<li><strong>Custom CSS</strong>: Easily add your own custom CSS to the WordPress logo slider plugin for complete control over the appearance and styling of your logo displays.</li>\n</ul>\n<h3>Page Builder Support</h3>\n<ul>\n<li>Gutenberg</li>\n<li>Elementor</li>\n<li>WPBakery</li>\n<li>Divi Builders</li>\n<li>Genesis Framework</li>\n<li>Beaver Builder</li>\n<li>Oxygen Builder</li>\n<li>UX Builder – Flatsome</li>\n<li>TagDiv – Newspaper</li>\n</ul>\n<h3>Shortcode Usage</h3>\n<p>Basic Usage &#8211;<br />\nFrom Version 3.0.0, shortcode generator was added with a preview. Select theme &amp; other parameters. Shortcode will generate with id like [gslogo id=1]<br />\nUse the following shortcode to display logos for partners, clients, or sponsors.</p>\n<pre><code>[gslogo id=1]\n</code></pre>\n<p><strong>Shortcode PHP Usage</strong></p>\n<pre><code>&lt;?php echo do_shortcode( '[gslogo id=1]' ); ?&gt;\n</code></pre>\n<h3>Documentation</h3>\n<p>If you have any questions regarding the <strong>WordPress Logo Carousel</strong> plugin and how to work with it, We recommend referring to our comprehensive online documentation. It provides detailed information and instructions to assist you in navigating and utilizing the plugin effectively. You can find the <a href=\"https://docs.gsplugins.com/gs-logo-slider\" rel=\"nofollow ugc\">Documentation</a> here.</p>\n<h3>Quick Support &amp; Bug Reporting</h3>\n<p>If you encounter any problems or discover bugs, please post them in our <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a> channel. We aim to respond as soon as possible (excluding holidays).</p>\n<p><strong><em>Pro users are requested to contact our support channel for dedicated assistance.</em></strong></p>\n<p>🙋‍♂️ Alternatively, you can reach out to us through our <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a> or <a href=\"https://wordpress.org/support/plugin/gs-logo-slider/\" rel=\"ugc\">WordPress.org</a> support forum.</p>\n<h3>Development Team</h3>\n<p>Crafted and Developed with Passion by <a href=\"https://www.gsplugins.com\" rel=\"nofollow ugc\">GS Plugins</a></p>\n<h3>Confused?</h3>\n<p>🎬 <a href=\"https://logo.gsplugins.com\" rel=\"nofollow ugc\">View live Demos &raquo;</a><br />\n📚 <a href=\"https://docs.gsplugins.com/gs-logo-slider\" rel=\"nofollow ugc\">Documentation &raquo;</a></p>\n<h3>🔥 You may like other plugins from <a href=\"https://www.gsplugins.com\" rel=\"nofollow ugc\">GS Plugins</a></h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-testimonial\" rel=\"ugc\">Testimonial Slider</a></strong> &#8211; Testimonials slider displays rotating customer endorsements and recommendations, helping to build trust and credibility for a business or product.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-portfolio/\" rel=\"ugc\">Portfolio</a></strong> &#8211; Filterable Portfolio plugin for WordPress allows you to easily display and showcase your projects, highlighting your skills and abilities.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-team-members\" rel=\"ugc\">Team Members</a></strong> &#8211; Build a Stunning Team Page or Section and Show off Your Team&#8217;s Talents!</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-projects\" rel=\"ugc\">Projects</a></strong> &#8211; Projects showcase displays detailed information including client reviews, ratings, galleries, and videos for a business&#8217;s work.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-books-showcase\" rel=\"ugc\">Books Showcase</a></strong> &#8211; Books showcase displays detailed information including author, published date, reviews, ratings, and gallery, allowing users to easily find and explore books.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-coach\" rel=\"ugc\">Coaches</a></strong> &#8211; Coaches plugin displays coaches&#8217; experience, skills, reviews, ratings, and certifications, helping users find the right coach for their needs.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/posts-grid\" rel=\"ugc\">Posts Grid</a></strong> &#8211;  WordPress Posts Grid plugin displays the latest posts in an elegant grid format, allowing for easy navigation and quick access to new content on a website.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/posts-widget\" rel=\"ugc\">Posts Widget</a></strong> &#8211;  WordPress Posts Widget plugin displays the latest posts in an elegant format on the sidebar or any widget area, allowing for easy navigation and quick access to new content on a website.</p>\n<h3>🎯 WooCommerce Plugins</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woocommerce-products-slider\" rel=\"ugc\">WooCommerce Products Slider</a></strong> &#8211; WooCommerce Product Slider plugin displays products in a visually pleasing, sliding manner, making it easy for customers to browse and find the products they want on an online store.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woo-variation-swatches\" rel=\"ugc\">WooCommerce Variation Swatches</a></strong> &#8211; WooCommerce Variation Swatches plugin replaces the default dropdown fields for variable products with visually appealing swatches, making it easier for customers to select product options and improve the overall shopping experience.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woo-brands\" rel=\"ugc\">WooCommerce Brands</a></strong> &#8211; WooCommerce Brands taxonomy plugin allows for easy cataloging of products by adding a brand taxonomy, making it simple to organize and filter products on an online store.</p>\n<h3>📣 Social Plugins</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-dribbble-portfolio\" rel=\"ugc\">Dribbble Portfolio</a></strong> &#8211; Dribbble Portfolio WP plugin enables you to display your Dribbble shots on your website in a portfolio layout, allowing you to showcase your design work to a wider audience.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-behance-portfolio\" rel=\"ugc\">Behance Portfolio</a></strong> &#8211; Behance Portfolio WordPress plugin allows you to display your Behance projects on your website in a visually appealing layout, making it easy for your audience to view and appreciate your work.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-pinterest-portfolio\" rel=\"ugc\">Pinterest Portfolio</a></strong> &#8211; Pinterest plugin for WordPress allows you to display your Pinterest pins on your website, giving your audience a chance to view and interact with your boards, and potentially drive more traffic to your Pinterest profile.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-instagram-portfolio/\" rel=\"ugc\">Instagram Portfolio</a></strong> &#8211; Instagram plugin for WordPress allows you to display your Instagram posts on your website, making it easy for visitors to view and interact with your content and also to increase engagement on your website.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-envato-portfolio\" rel=\"ugc\">Portfolio &#8211; Envato</a></strong> &#8211; Envato Portfolio Plugin allows you to display your Themeforest and Codecanyon items on your website, showcasing your digital products and making them easily accessible for potential customers.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-youtube-gallery\" rel=\"ugc\">Youtube Gallery</a></strong> &#8211; YouTube Gallery plugin allows you to display videos from a YouTube channel or playlist on your website, creating a visually appealing gallery and making it easy for visitors to access and watch your videos.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/feeds-of-twitter\" rel=\"ugc\">Twitter Feeds</a></strong> &#8211; Twitter Feeds plugin displays Twitter feeds, hashtags, user cards, and collections on a website, making it easy for visitors to view and interact with your Twitter content.</p>\n<h3>🏆 Branding Plugin</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-custom-login\" rel=\"ugc\">Custom Login</a></strong> &#8211; GS Custom Login allows you to customize the WordPress login screen, providing an easy way to create a unique and visually appealing login experience for your website users.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/powerup\" rel=\"ugc\">PowerUp</a></strong> &#8211; Enhance Your WordPress Experience with the Ultimate Security &amp; Convenience Solution &#8211; Hide Admin Bar, Login &amp; Logout Redirection, Disable Comments &amp; Restrict WP-Admin Module.</p>\n",
        "installation": "<p>Install it as a regular WordPress plugin. Here are different ways to install the plugin :</p>\n<ul>\n<li><a href=\"https://docs.gsplugins.com/gs-logo-slider\" rel=\"nofollow ugc\">Visual Installation &amp; Usage Guide &raquo;</a></li>\n</ul>\n<h4>Install by Search Plugin</h4>\n<ul>\n<li>In your Admin, go to the menu Plugins &gt; Add New</li>\n<li>Search GS Logo Slider</li>\n<li>Click to install</li>\n<li>Activate the plugin</li>\n<li>GS Logos post type will show below POSTS</li>\n</ul>\n<h4>Install by Upload Plugin</h4>\n<ul>\n<li>Download the latest version(.zip file)</li>\n<li>In your Admin, go to menu Plugins &gt; Add New</li>\n<li>Select <strong>Upload Plugin</strong></li>\n<li>Click on <strong>Choose File</strong></li>\n<li>Select downloaded <strong><em>gs-logo-slider.zip</em></strong> &amp; click on <strong>Install Now</strong> button</li>\n<li>Activate the plugin</li>\n<li>Logos post type will show below POSTS</li>\n</ul>\n<h4>Install Plugin using FTP</h4>\n<ul>\n<li>Upload gs-logo-slider folder inside the /wp-content/plugins/ directory</li>\n<li>Go to WordPress dashboard &gt; Plugins &amp; Activate the plugin</li>\n<li>\n<p>Logos post type will show below POSTS</p>\n</li>\n<li>\n<p>Put [gslogo id=#] shortcode, where you need to show.</p>\n</li>\n</ul>\n",
        "faq": "\n<dt id='how%20do%20i%20add%20a%20new%20logo%3F'>\nHow do I add a new logo?\n</h4>\n<p>\n<p>To add a new Logo –<br />\nGo to <strong>GS Logos &gt; Add New</strong><br />\n&#8211; Add the company name in the Title input box.<br />\n&#8211; Upload logo image.<br />\n&#8211; Write the company&#8217;s website URL with <em>http://</em> or <em>https://</em>. Keep it blank if no website is available.<br />\n&#8211; Logo Categories (optional) : You can categorize your logos by creating your own category or selecting one from the existing ones.<br />\n&#8211; Finally, publish it.</p>\n<p>You can check out the <a href=\"https://docs.gsplugins.com/gs-logo-slider/manage-the-logos/add-new-logo/\" rel=\"nofollow ugc\">documentation</a> page for an in-depth guide on how to add a new logo using it.</p>\n</p>\n<dt id='what%20will%20be%20the%20logo%20image%20dimension%3F'>\nWhat will be the logo image dimension?\n</h4>\n<p>\n<p>200 pixels X 200 pixels is the default dimension but from the <em>General Settings</em> tab, you can choose other image sizes.</p>\n</p>\n<dt id='how%20to%20use%20shortcodes%20inside%20page%20templates%3F'>\nHow to use shortcodes inside page templates?\n</h4>\n<p>\n<p>The capabilities of WordPress are amazing, and one of its finest features is do_shortcode(), which allows you to utilize shortcodes in your theme files. To output Logos in a Theme file, for example, use this code:</p>\n<pre><code>&lt;?php echo do_shortcode('[gslogo id=1]'); ?&gt;\n</code></pre>\n</p>\n<dt id='how%20many%20logos%20can%20i%20add%3F'>\nHow many logos can I add?\n</h4>\n<p>\n<p>GS Logo Slider’s Pro version allows you to add unlimited logos. In the free version, up to 20 logos can be presented at once. You can add as many logos as necessary and sort them into categories. The number of logos on your page will not have an impact on your page loading speed.</p>\n</p>\n<dt id='is%20there%20any%20shortcode%20of%20the%20plugin%3F'>\nIs there any shortcode of the plugin?\n</h4>\n<p>\n<p>Yes, there are shortcodes available for the plugin. The default shortcode is:</p>\n<pre><code>[gslogo id=#]\n</code></pre>\n<p>First, install the plugin on your WordPress website. Then add the Shortcode where you wish to showcase the slider.</p>\n<p>You can add the shortcode to display logos anywhere at your site.</p>\n<p>Check <a href=\"https://docs.gsplugins.com/gs-logo-slider/shortcode-usage\" rel=\"nofollow ugc\">Shortcode Attributes &amp; Usage</a> docs for a detailed guide.</p>\n</p>\n<dt id='can%20i%20use%20an%20external%20link%20in%20the%20logo%20of%20my%20client%E2%80%99s%20website%20on%20the%20plugin%3F'>\nCan I use an external link in the logo of my client’s website on the plugin?\n</h4>\n<p>\n<p>Yes, you can. Add the company&#8217;s website address by starting it with <strong>https://</strong> in the company URL field. Logo will automatically link with the URL.<br />\nYou can set the link to open in a <em>new tab</em> / <em>same window</em>.</p>\n</p>\n<dt id='what%20version%20of%20wordpress%20do%20i%20need%20to%20use%20this%20plugin%3F'>\nWhat version of WordPress do I need to use this plugin?\n</h4>\n<p>\n<p>Minimum WordPress Version: 5.8 or higher is required for using the plugin. We regularly update the plugin to make it compatible with the latest WordPress versions.</p>\n</p>\n<dt id='what%20image%20formats%20can%20i%20use%20for%20the%20logos%3F'>\nWhat image formats can I use for the logos?\n</h4>\n<p>\n<p>For the logos, you can use JPG, JPEG, PNG, GIF and other image formats.</p>\n</p>\n<dt id='can%20i%20get%20a%20custom-developed%20plugin%20for%20my%20website%3F'>\nCan I get a custom-developed plugin for my website?\n</h4>\n<p>\n<p>Yes, we do provide custom development services. In case of a personal or a business need, you can <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">contact us</a> for custom support.</p>\n</p>\n<dt id='what%20makes%20our%20plugin%20stand%20out%20from%20other%20wordpress%20plugins%3F'>\nWhat makes our plugin stand out from other WordPress plugins?\n</h4>\n<p>\n<p>Our plugin is user-friendly, feature-rich, and optimized for performance, ensuring your website runs smoothly. We offer robust support, regular updates, and extensive customization options. Plus, our positive user feedback highlights its reliability and effectiveness.</p>\n</p>\n<dt id='is%20there%20any%20page%20builder%20support%20available%20for%20the%20gs%20logo%20slider%3F'>\nIs there any Page Builder Support available for the GS Logo Slider?\n</h4>\n<p>\n<p>Yes, Page Builder Support is there for the GS Logo Slider. Gutenberg, Elementor, WPBakery, Divi Builders, Oxygen Builder, UX Builder – Flatsome and TagDiv – Newspaper are all currently working properly. We have a plan to add support for additional builders in future updates.</p>\n</p>\n\n",
        "changelog": "<h4>Version 3.7.0 [19th Aug 2024]</h4>\n<ul>\n<li>[Added]: Enable/Disable Single Logo Page Option.</li>\n</ul>\n<h4>Version 3.6.9 [1st Jul 2024]</h4>\n<ul>\n<li>[Fixed]: XSS Issue.</li>\n</ul>\n<h4>Version 3.6.8 [31st Mar 2024]</h4>\n<ul>\n<li>[Improved]: CSS Issue.</li>\n</ul>\n<h4>Version 3.6.7 [23rd Mar 2024]</h4>\n<ul>\n<li>[Fixed]: PHP Warning When Deleted Shortcode is Used.</li>\n</ul>\n<h4>Version 3.6.6 [17th Mar 2024]</h4>\n<ul>\n<li>[Added]: Flip/Secondary Image adding Option.</li>\n<li>[Updated]: Category under title &gt; Default On to Off.</li>\n<li>[Updated]: Moved Excerpt Box below Other Meta Boxes.</li>\n<li>[Updated]: Secondary Logo as Pro Feature.</li>\n</ul>\n<h4>Version 3.6.5 [28th Jan 2024]</h4>\n<ul>\n<li>[Added]: Support for the Query Loop Block.</li>\n<li>[Added]: Excerpt Support.</li>\n<li>[Fixed]: Jetpack Feature Image Hidden Issue.</li>\n</ul>\n<h4>Version 3.6.4 [14th Dec 2023]</h4>\n<ul>\n<li>[Fixed]: Custom CSS not Generating Issue.</li>\n<li>[Fixed]: List Theme Wrong Column Issue.</li>\n</ul>\n<h4>Version 3.6.3 [7th Dec 2023]</h4>\n<ul>\n<li>[Fixed]: Hot Fix.</li>\n</ul>\n<h4>Version 3.6.2 [6th Dec 2023]</h4>\n<ul>\n<li>[Fixed]: Database Error Issue.</li>\n</ul>\n<h4>Version 3.6.1 [5th Dec 2023]</h4>\n<ul>\n<li>[Fixed]: Elementor Pro Swiper JS Conflict.</li>\n</ul>\n<h4>Version 3.6.0 [3rd Dec 2023]</h4>\n<ul>\n<li>[Improved]: Compatibility Checking With Pro Version.</li>\n</ul>\n<h4>Version 3.5.2 [29th Nov 2023]</h4>\n<ul>\n<li>[Added]: Namespace To Asset Generator.</li>\n<li>[Fixed]: Salient Theme Swiper Height Issue.</li>\n<li>[Fixed]: Shortcode Security Issue.</li>\n<li>[Updated]: Integrations &amp; Assets.</li>\n<li>[Updated]: Gutenberg, Divi, Elementor, Oxygen, WPBakery, Beaver Builder &amp; TagDiv Builder (Newspaper Theme) Integration.</li>\n<li>[Updated]: Swiper JS.</li>\n<li>[Updated]: Function Name.</li>\n<li>[Removed]: GSL_HACK_MSG.</li>\n</ul>\n<h4>Version 3.5.1 [30th Aug 2023]</h4>\n<ul>\n<li>[Added]: Oxygen Builder Integration.</li>\n<li>[Added]: Beaver Builder Integration.</li>\n<li>[Added]: Table Theme Heading Text Change Options.</li>\n<li>[Added]: Nofollow, Noopener, Norefferer Options.</li>\n<li>[Fixed]: Category selection Option.</li>\n</ul>\n<h4>Version 3.4.9 [16th Jul 2023]</h4>\n<ul>\n<li>[Fixed]: Category Include issue on the Shortcode Builder.</li>\n</ul>\n<h4>Version 3.4.8 [9th Jul 2023]</h4>\n<ul>\n<li>[Fixed]: Undefined Array Index Issue.</li>\n</ul>\n<h4>version 3.4.7 [17th Jun 2023]</h4>\n<ul>\n<li>[Added]: Custom Image Size.</li>\n<li>[Added]: Horizontal Alignment option for Grid themes.</li>\n<li>[Fixed]: Shortcode Disappear issue on Certain Cases.</li>\n<li>[Fixed]: Few PHP Notices.</li>\n<li>[Fixed]: Template Loading on Certain Cases.</li>\n<li>[Improved]: Editor Performance.</li>\n<li>[Improved]: Caching Mechanism.</li>\n</ul>\n<h4>version 3.4.6 [4th Jun 2023]</h4>\n<ul>\n<li>[Updated]: Minimum Value Set to 1 For Slider Theme on the Different Devices.</li>\n</ul>\n<h4>version 3.4.5 [18th Apr 2023]</h4>\n<ul>\n<li>[Fixed]: Empty Category Warning.</li>\n</ul>\n<h4>version 3.4.4 [9th Apr 2023]</h4>\n<ul>\n<li>[Updated]: Unlock the disabled switchers.</li>\n</ul>\n<h4>version 3.4.3 [8th Apr 2023]</h4>\n<ul>\n<li>[Updated]: Appesro SDK.</li>\n<li>[Updated]: Set a default value for the Clickable Logos field.</li>\n</ul>\n<h4>version 3.4.2 [16th Jan 2023]</h4>\n<ul>\n<li>[Fixed]: Escaping Issue.</li>\n</ul>\n<h4>version 3.4.1 [11th Jan 2023]</h4>\n<ul>\n<li>[Fixed]: Responsive Issues.</li>\n</ul>\n<h4>version 3.4.0 [5th Jan 2023]</h4>\n<ul>\n<li>[Fixed]: WP Recommended Sanitize Issues.</li>\n<li>[Updated]: Logo POT File.</li>\n</ul>\n<h4>version 3.3.9 [2nd Jan 2023]</h4>\n<ul>\n<li>[Added]: Child Theme Template Overwrite Support.</li>\n<li>[Fixed]: Security Issues &#8211; Phase2.</li>\n<li>[Fixed]: DB Prepare Issues.</li>\n<li>[Updated]: All Dummy Shortcodes Data.</li>\n</ul>\n<h4>version 3.3.8 [29th Dec 2022]</h4>\n<ul>\n<li>[Fixed]: Security Issues.</li>\n<li>[Updated]: Help &amp; Free, Pro common pages.</li>\n</ul>\n<h4>version 3.3.7 [25th Sep 2022]</h4>\n<ul>\n<li>[Added]: TagDiv Builder (Newspaper Theme) Support.</li>\n</ul>\n<h4>version 3.3.6 [16th Jul 2022]</h4>\n<ul>\n<li>[Fixed]: PHP 8.0 support &amp; Divi Integration Issue.</li>\n<li>[Fixed]: Assets Generation Hooks.</li>\n<li>[Fixed]: PHP 5.6 Unexpected Parse Error.</li>\n<li>[Updated]: Function Name.</li>\n</ul>\n<h4>version 3.3.5 [16th Jun 2022]</h4>\n<ul>\n<li>[Added]: Feature to display Category under the Logo Title.</li>\n<li>[Fixed]: Custom CSS not loading issue.</li>\n<li>[Added]: WP 6.0 version Compatibility.</li>\n</ul>\n<h4>version 3.3.4 [27th Apr 2022]</h4>\n<ul>\n<li>[Added]: Logo Title Tag Filter Hook.</li>\n<li>[Improved]: Compatibility with the Pro version for Ticker Theme.</li>\n</ul>\n<h4>version 3.3.3 [11th Apr 2022]</h4>\n<ul>\n<li>[Updated]: Slider Excessive Items Issue.</li>\n</ul>\n<h4>version 3.3.2 [9th Apr 2022]</h4>\n<ul>\n<li>[Fixed]: Slider Excessive Items Issue.</li>\n</ul>\n<h4>version 3.3.1 [3rd Apr 2022]</h4>\n<ul>\n<li>[Fixed]: Scroll conflict with Elementor.</li>\n</ul>\n<h4>version 3.3.0 [12th Feb 2022]</h4>\n<ul>\n<li>[Fixed]: Custom CSS loading issue on the Editor.</li>\n<li>[Added]: Support for dynamic Pages, Sidebars, Footers and Widgets.</li>\n<li>[Improved]: Compatibility for the Pro version.</li>\n</ul>\n<h4>version 3.2.1 [9th Feb 2022]</h4>\n<ul>\n<li>[Fixed]: For Builders.</li>\n</ul>\n<h4>version 3.1.3 [7th Feb 2022]</h4>\n<ul>\n<li>[Added]: Recursive function for finding inner columns for GS Logo Widget in Elementor document.</li>\n<li>[Fixed]: Find inner columns GS Logo Widget in Elementor document.</li>\n</ul>\n<h4>version 3.1.2 [6th Feb 2022]</h4>\n<ul>\n<li>[Removed]: Default option from Elementor.</li>\n</ul>\n<h4>version 3.1.1 [6th Feb 2022]</h4>\n<ul>\n<li>[Added]: Option (on/off) to disable Lazy Load.</li>\n<li>[Added]: Class field option to exclude Lazy Loading.</li>\n<li>[Added]: Latest WP version Compatibility.</li>\n<li>[Removed]: Admin notices from Logo pages.</li>\n</ul>\n<h4>version 3.0.9 [30th May 2021]</h4>\n<ul>\n<li>[Added]: Support for &#8220;Ultimate Addons for Gutenberg&#8221; plugin.</li>\n</ul>\n<h4>version 3.0.8 [23rd May 2021]</h4>\n<ul>\n<li>[Fixed]: PHP 7.3 Compatibility.</li>\n<li>[Fixed]: Deprecated Function Warning.</li>\n</ul>\n<h4>version 3.0.7 [20th May 2021]</h4>\n<ul>\n<li>[Added]: Direction <strong><em>Left to Right</em></strong> for Slider &amp; Ticker Theme (Pro feature).</li>\n<li>[Fixed]: CLS issue for unsupported CSS Property: border-radius</li>\n<li>[Fixed]: Lazy-load issues with images at Grid layout.</li>\n<li>[Fixed]: Output buffer issue.</li>\n<li>[Added]: Identification class to Logo images.</li>\n<li>[Updated]: Increased <strong><em>Sliding Speed</em></strong> and Autoplay pause value to max 10,000</li>\n</ul>\n<h4>version 3.0.6 [24th Apr 2021]</h4>\n<ul>\n<li>[Fixed]: Conflicted function name with other plugins.</li>\n<li>[Fixed]: Cumulative Layout Shift Error.</li>\n<li>[Fixed]: Wrong unique key issue.</li>\n<li>[Fixed]: SVG&#8217;s size issue.</li>\n</ul>\n<h4>version 3.0.5 [19th Apr 2021]</h4>\n<ul>\n<li>[Added]: Slider nav positions.</li>\n<li>[Added]: Multiliangual support.</li>\n<li>[Added]: SVG logo support.</li>\n<li>[Fixed]: AppSero conflict with other plugins.</li>\n<li>[Fixed]: Discount admin notice if pro is active.</li>\n<li>[Removed]: Go Pro link when premium plugin is active.</li>\n</ul>\n<h4>version 3.0.4 [18th Feb 2021]</h4>\n<ul>\n<li>[Fixed]: Compatibility issue with jQuery 3+</li>\n</ul>\n<h4>version 3.0.3 [10th Feb 2021]</h4>\n<ul>\n<li>[Fixed]: Multiple Carousels navigation issue.</li>\n<li>[Fixed]: Swift Builder carousel conflict.</li>\n<li>[Fixed]: For unprotected width.</li>\n<li>[Updated]: Scripts.</li>\n</ul>\n<h4>version 3.0.2 [6th Feb 2021]</h4>\n<ul>\n<li>[Fixed]: Potential shortcode error.</li>\n<li>[Fixed]: RTL Issue.</li>\n</ul>\n<h4>version 3.0.1 [31st Jan 2021]</h4>\n<ul>\n<li>[Fixed]: Swiper JS conflict with other themes.</li>\n<li>[Updated]: Integration with Gutenberg, Elementor, WPBakery, Divi Builders.</li>\n</ul>\n<h4>version 3.0.0 [28th Jan 2021]</h4>\n<ul>\n<li>[Updated]: Rewritten the plugin.</li>\n<li>[Added]: Import / delete Logo dummy data.</li>\n<li>[Added]: Edit, Clone / Duplicate, Delete Shortcode.</li>\n<li>[Added]: Overwrite Templates.</li>\n<li>[Added]: Performance Improvements.</li>\n<li>[Added]: Page Builder Support for Gutenberg, Elementor, WPBakery, Divi Builders.</li>\n<li>[Added]: Translations done for static strings.</li>\n<li>[Added]: Old Shortcode support.</li>\n<li>[Updated]: Cleanup &amp; Optimize assets.</li>\n<li>[Updated]: Organize files in the folder.</li>\n<li>[Fixed]: jQuery sort error in console.</li>\n<li>[Fixed]: Admin old CSS &amp; JS files loading in every page.</li>\n<li>[Fixed]: Custom style issue with Divi Builder.</li>\n<li>[Improved]: Compatibility with more themes.</li>\n</ul>\n<h4>version 1.8.16 [7th Jan 2021]</h4>\n<ul>\n<li>[Improved]: Few files urls.</li>\n<li>[Removed]: Admin Notice Ticker function.</li>\n<li>[Removed]: Removed unnecessary files from Appsero library.</li>\n</ul>\n<h4>version 1.8.15 [17th Dec 2020]</h4>\n<ul>\n<li>[Updated]: AppSero Client.</li>\n<li>[Removed]: Affiliate Admin Notice.</li>\n<li>[Updated]: WordPress 5.6</li>\n</ul>\n<h4>version 1.8.14 [27th Sep 2020]</h4>\n<ul>\n<li>[Fixed]: Affiliate Admin Notice.</li>\n</ul>\n<h4>version 1.8.13 [13th Sep 2020]</h4>\n<ul>\n<li>[Added]: New Admin Notice.</li>\n</ul>\n<h4>version 1.8.12 [13th Aug 2020]</h4>\n<ul>\n<li>[Updated]: WordPress 5.5</li>\n</ul>\n<h4>version 1.8.11 [24th Jun 2020]</h4>\n<ul>\n<li>[Updated]: AppSero Client.</li>\n</ul>\n<h4>version 1.8.10 [28th Apr 2020]</h4>\n<ul>\n<li>[Removed]: Admin Notice.</li>\n</ul>\n<h4>version 1.8.9 [21st Apr 2020]</h4>\n<ul>\n<li>[Updated]: Admin Notice.</li>\n</ul>\n<h4>version 1.8.8 [20th Apr 2020]</h4>\n<ul>\n<li>[Added]: Admin Notice.</li>\n</ul>\n<h4>version 1.8.7 [7th Apr 2020]</h4>\n<ul>\n<li>[Added]: Compatibility with Latest WP version.</li>\n<li>[Added]: CSS for BX loader.</li>\n</ul>\n<h4>version 1.8.6 [27th Feb 2020]</h4>\n<ul>\n<li>[Added]: Options for Breakpoints.</li>\n<li>[Fixed]: Responsive Breakpoints.</li>\n</ul>\n<h4>version 1.8.5 [23rd Nov 19]</h4>\n<ul>\n<li>[Fixed]: Domain name with www &amp; fixed all urls.</li>\n</ul>\n<h4>version 1.8.4 [19th Nov 19]</h4>\n<ul>\n<li>[Added]: Logo Category Support.</li>\n<li>[Added]: Logo Category Support at Block.</li>\n</ul>\n<h4>version 1.8.3 [20th Oct 19]</h4>\n<ul>\n<li>[Fixed]: Domain name changed &amp; fixed all urls.</li>\n<li>[Fixed]: Admin CSS.</li>\n<li>[Added]: New Contributors.</li>\n</ul>\n<h4>version 1.8.2</h4>\n<ul>\n<li>[Fixed]: JS conflict with Divi theme. Divider &gt; Style dropdown not working. Now fixed</li>\n<li>[Fixed]: JS conflict with Divi theme. Section &gt; Background Color picker not working. Now fixed</li>\n<li>[Fixed]: Responsiveness for 3 themes &#8211; Grid 1, List 1, Table 1</li>\n</ul>\n<h4>version 1.8.1</h4>\n<ul>\n<li>[Fixed]: Gutenberg Block for the old Gutenberg version compatibility</li>\n<li>[Fixed]: Initial value for Gutenberg Block</li>\n</ul>\n<h4>version 1.8</h4>\n<ul>\n<li>[Added]: Gutenberg Editor Support</li>\n<li>[Added]: Gutenberg Block</li>\n<li>[Added]: Released new 3 themes &#8211; Grid 1, List 1, Table 1</li>\n<li>[Fixed]: Reposition GS Logo&#8217;s sub menu pages</li>\n<li>[Fixed]: Admin CSS</li>\n</ul>\n<h4>version 1.7.2</h4>\n<ul>\n<li>Activation redirects added</li>\n<li>Coupon Code added</li>\n</ul>\n<h4>version 1.7.1</h4>\n<ul>\n<li>Help &amp; Usage info added</li>\n<li>Code Improved</li>\n</ul>\n<h4>version 1.7</h4>\n<ul>\n<li>Fixed Text Domain</li>\n<li>Added Review system</li>\n</ul>\n<h4>version 1.6</h4>\n<ul>\n<li>Shortcode attribute &#8211; order is now dynamic, previously it was fixed to DESC</li>\n<li>Shortcode attribute &#8211; orderby is now dynamic to ID / title / modified / rand, previously it was fixed to date.</li>\n</ul>\n<h4>version 1.5</h4>\n<ul>\n<li>Disabled Logo Archive Page</li>\n<li>Excluded Logos from search results</li>\n</ul>\n<h4>version 1.0.4</h4>\n<ul>\n<li>Fixed query issue for WP 4.4</li>\n</ul>\n<h4>version 1.0.3</h4>\n<ul>\n<li>Domain name changed &amp; fixed all urls</li>\n<li>Donate link added</li>\n<li>Css fixed</li>\n</ul>\n<h4>version 1.0.2</h4>\n<ul>\n<li>Documentation Added</li>\n<li>Added Demo &amp; Doc links</li>\n<li>Logo size changed to 200px X 200px</li>\n<li>By default title is not visible now</li>\n<li>Added different screenshots</li>\n<li>Added PRO features info</li>\n<li>Docs link added at sidebar</li>\n</ul>\n<h4>version 1.0.1</h4>\n<ul>\n<li>Added Descending logo order</li>\n<li>Increased 20 number of logos to display </li>\n</ul>\n<h4>version 1.0</h4>\n<ul>\n<li>Initial release</li>\n</ul>\n"
    },
    "short_description": "Logo Slider is The Best Responsive Plugin for Logo Showcase, Logo Carousel and display clients logos. Shortcode Generator with preview.",
    "description": "<p><strong>GS Logo Slider</strong> is a WordPress plugin that simplifies showcasing your partners, clients, brands, and sponsors. It allows you to create a logo slideshow quickly and easily. Featuring logos of respected companies on your website builds trust and credibility, while also boosting brand awareness for your partners, leading to stronger collaborations.</p>\n<p>The plugin is user-friendly, creating a dedicated logo post type and offering a user-friendly Shortcode generator for easy embedding. Its responsive design ensures that responsive sliders look great on all devices, and the lightweight plugin keeps your site running smoothly. Focus on what matters with GS Logo Slider.</p>\n<p>🎬 <a href=\"https://logo.gsplugins.com\" rel=\"nofollow ugc\">Live Demo</a> ⬆️ <a href=\"https://www.gsplugins.com/product/gs-logo-slider\" rel=\"nofollow ugc\">Upgrade to PRO</a> 📚 <a href=\"https://docs.gsplugins.com/gs-logo-slider\" rel=\"nofollow ugc\">Documentation</a> 🙋‍♂️ <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent&#038;listType=playlist&#038;list=PLLrT2alOaYX7BYElWvN_juWXo7yYAcjoh\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Why are logo sliders useful for businesses?</h3>\n<p>Logo sliders help businesses show their partners and clients, building trust and credibility. They save space on the website while highlighting important relationships. Not only it boosts brand recognition but can lead to more collaborations as well.</p>\n<h3>What Sets GS Logo Slider Apart?</h3>\n<ul>\n<li><strong>Responsive Across All Screen Sizes</strong>: This responsive logo slider effortlessly adjusts to any screen dimension, maintaining a polished look on desktops, tablets, and smartphones. Your logo display holds its visual appeal on all devices.</li>\n<li><strong>Comprehensive Documentation</strong>: The plugin includes thorough documentation that assists users with installation, configuration, and advanced customization options. It enables even those with limited technical skills to utilize it effectively.</li>\n<li><strong>Regular Updates</strong>: GS Logo Slider receives frequent updates to integrate the latest advanced features and security improvements. This ensures the plugin stays reliable and compatible with the newest WordPress versions.</li>\n<li><strong>High Performance</strong>: Engineered for speed and efficiency, GS Logo Slider delivers rapid loading times and smooth functionality. Its high performance enhances user experience and minimizes bounce rates.</li>\n</ul>\n<h3>Plugin Features &#8211; Logo Carousel</h3>\n<p><em>GS Logo Slider</em> is a powerful plugin with a rich array of functionalities. Here&#8217;s its huge features list:</p>\n<ul>\n<li><strong>Versatile Layouts</strong>: Choose from a variety of layouts including Grid, List, Table, Filter, Live Filter, Full Width Slider, Center Mode, Variable Width Slider, Vertical Center Slider, Vertical Ticker Up, Vertical Ticker Down, and 2 Rows Slider.</li>\n<li><strong>24 Different Themes</strong>: Choose from a variety of pre-designed themes.</li>\n<li><strong>Image Size Control</strong>: Select logo image sizes from Thumbnail, Medium, Large, or other registered sources.</li>\n<li><strong>Template Override</strong>: Override default templates for a personalized touch.</li>\n<li><strong>Drag &amp; Drop Reorder</strong>: Easily reorder logos as needed.</li>\n<li><strong>Gutenberg Block Available</strong>: Seamlessly integrate logos with the block editor.</li>\n<li><strong>Logo Shortcode Ready</strong>: Easily insert logos using Shortcodes.</li>\n<li><strong>Tooltip Option</strong>: Add informative tooltip descriptions to logos.</li>\n<li><strong>Multiple Sliders on Same Page</strong>: Display sliders from different categories on the same page.</li>\n<li><strong>Advanced Settings Panel</strong>: Comprehensive slider settings panel with all necessary options.</li>\n<li><strong>Slider Customization</strong>: There are customizable options such as adjusting slider carousel speed, slider autoplay pause, navigation, pagination, drag-and-drop feature, and color settings.</li>\n<li><strong>Directional Control</strong>: Logos can move <strong>Right to Left</strong> (default) or <strong>Left to Right</strong> for <em>Slider</em> &amp; <em>Ticker</em> Theme.</li>\n<li><strong>Display Options</strong>: Display logos horizontally or vertically.</li>\n<li><strong>Infinite Loop</strong>: Enable or disable infinite loop.</li>\n<li><strong>Ticker Mode</strong>: Slide in ticker mode, similar to a news scroll.</li>\n<li><strong>Grayscale Feature</strong>: Option to display logos in grayscale.</li>\n<li><strong>Hover Control</strong>: Stop sliding on hover.</li>\n<li><strong>Title Display</strong>: Display logos with or without titles.</li>\n<li><strong>Link Target Specification</strong>: Specify the target for logo links to open in a new tab or same window.</li>\n<li><strong>Transition Control</strong>: Set the number of logos to move during transition effects.</li>\n<li><strong>Shortcode Parameters</strong>: tons of Shortcode parameters for customization.</li>\n<li><strong>Category-wise Logos</strong>: Display logos based on categories.</li>\n<li><strong>Lightweight and Plug-and-Play</strong>: Simple installation with no configuration or extra code required.</li>\n<li><strong>Custom Post Type for Logo Posting</strong>: Dedicated post type for managing logos.</li>\n<li><strong>Compatibility</strong>: Works with all WordPress themes.</li>\n<li><strong>User-Friendly</strong>: It has an easy-to-use user interface for managing, editing, creating, and deleting logos without new knowledge.</li>\n<li><strong>Developer Friendly</strong>: Simple to customize and extend its functionalities using Hooks.</li>\n<li><strong>Priority Email Support</strong>: Get assistance via priority email support.</li>\n<li><strong>Free Installation Help</strong>: Free installation service if needed.</li>\n<li><strong>Continuous Updates</strong>: Stay updated with new features and improvements.</li>\n<li><strong>Auto Update</strong>: Receive notifications for updates and easily update the plugin from your dashboard.</li>\n<li><strong>Well-Documented</strong>: Comprehensive documentation and support.</li>\n</ul>\n<p>The plugin is advanced, feature-rich and is designed to provide a powerful, user-friendly, and customizable solution for displaying logos on your WordPress site.</p>\n<h3>Available Fields While Adding a Logo</h3>\n<p>Adding logos using this responsive carousel slider is very simple. There are only four fields to enter data into. They’re as follows:</p>\n<ul>\n<li><strong>Company Name</strong>: Write the name of the brand of the logo that you’re going to enter here. </li>\n<li><strong>Logo</strong>: Upload the brand logo image here.</li>\n<li><strong>Company URL</strong>: Enter the website’s URL here.</li>\n<li><strong>Logo Categories</strong>: Add new categories for the logo or choose from existing categories (if any).</li>\n</ul>\n<h3>General Settings</h3>\n<p>Go to <strong>GS Logos &gt; Logo Shortcode</strong>. Here, you can either create a new Shortcode or edit the existing ones. Once inside, you’ll see the <strong>General Settings</strong> page.</p>\n<ul>\n<li><strong>Name of the Shortcode</strong>: Decide on a unique name for your Shortcode.</li>\n<li><strong>Style &amp; Theming</strong>: Choose a style or theme for your Shortcode.</li>\n<li><strong>Image Size</strong>: Select the image size for the logos from options such as medium, large and custom.</li>\n<li><strong>Sliding Speed</strong>: Control the slider speed.</li>\n<li><strong>Autoplay</strong>: Turn auto sliding of the logos on or off.</li>\n<li><strong>Autoplay Delay</strong>: Set how long to delay the auto sliding.</li>\n<li><strong>Pause on hover</strong>: Specify if autoplay should cease when the user hovers on a logo.</li>\n<li><strong>Infinite Loop</strong>: Specify whether clicking the next button on the last slide logo will loop back to the first slide, and clicking the previous button on the first slide will loop to the last slide.</li>\n<li><strong>Reverse Direction</strong>: Set logo sliding direction from right to left (default is left to right)</li>\n<li><strong>Slider Navs</strong>: Activate/deactivate logo sliding buttons.</li>\n<li><strong>Navs Position</strong>: Determine the position of the navigation arrows. Options for setting arrow icons are bottom nav, inside/outside the slider component.</li>\n<li><strong>Slider Dots</strong>: Show or hide the dots under the slider. They make the navigation of the logos easier. </li>\n<li><strong>Logo Title</strong>: Opt to display logos with titles or without.</li>\n<li><strong>Logo Category</strong>: Select whether logos should be shown with accompanying titles.</li>\n<li><strong>Secondary Image</strong>: Show different images when hovering on the logos.</li>\n<li><strong>Tooltip</strong>: Decide whether to show tooltips when hovering on images or not.</li>\n</ul>\n<h3>Style Settings</h3>\n<p>Go to <strong>GS Logos &gt; Logo Shortcode</strong>. In the <em>second tab</em> you’ll see the <strong>Style Settings</strong> Page.</p>\n<ul>\n<li><strong>Logo style</strong>: Select whether logos will show in color or in grayscale.</li>\n<li><strong>Adjustable Spacing</strong>: Set the margin between logos in pixel values.</li>\n<li><strong>Desktop Logos</strong>: Set the number of logos to show on desktop screens.</li>\n<li><strong>Tablet Logos</strong>: Choose how many logos to display on tablet screens.</li>\n<li><strong>Mobile Logos</strong>: Configure the list of logos visible on mobile screens.</li>\n<li><strong>Clickable Logos</strong>: Set whether clicking on a logo opens its link on a new page or in the current page. </li>\n</ul>\n<h3>Query Settings</h3>\n<p>Go to GS <strong>Logos &gt; Logo Shortcode</strong>. In the <em>third tab</em>, after the General Settings and the Style Settings tab, you’ll see the <strong>Query Settings</strong> tab.</p>\n<ul>\n<li><strong>Logos</strong>: Set the number of logos you want to show. Default value is -1, and it means all the logos will be shown.</li>\n<li><strong>Order</strong>: Specify the order in which you want your logos to show. The criteria for ordering can be set from the <strong>Order By</strong> field. </li>\n<li><strong>Order By</strong>: Choose whether to order your logos by name, id, date of adding or you can select a custom order of your choice. Also, you can randomize the logo sequence on every page refresh. </li>\n<li><strong>Categories</strong>: Select a specific logo category to display logos from that category. You can select multiple categories here. </li>\n</ul>\n<h3>Preferences</h3>\n<p>Go to <strong>GS Logos &gt; Logo Shortcode</strong>. On the top right navigation bar, click on <strong>Preferences</strong>. You’ll see the following fields:</p>\n<ul>\n<li><strong>Disable Lazy Load</strong>: Disable or enable lazy loading of the logo images.</li>\n<li><strong>Anchor Tag rel</strong>: Choose the value for the Anchor tag&#8217;s <em>rel</em> attribute to enhance security and SEO. By default, the value is set to <strong>dofollow</strong>.</li>\n<li><strong>Custom CSS</strong>: Easily add your own custom CSS to the WordPress logo slider plugin for complete control over the appearance and styling of your logo displays.</li>\n</ul>\n<h3>Page Builder Support</h3>\n<ul>\n<li>Gutenberg</li>\n<li>Elementor</li>\n<li>WPBakery</li>\n<li>Divi Builders</li>\n<li>Genesis Framework</li>\n<li>Beaver Builder</li>\n<li>Oxygen Builder</li>\n<li>UX Builder – Flatsome</li>\n<li>TagDiv – Newspaper</li>\n</ul>\n<h3>Shortcode Usage</h3>\n<p>Basic Usage &#8211;<br />\nFrom Version 3.0.0, shortcode generator was added with a preview. Select theme &amp; other parameters. Shortcode will generate with id like [gslogo id=1]<br />\nUse the following shortcode to display logos for partners, clients, or sponsors.</p>\n<pre><code>[gslogo id=1]\n</code></pre>\n<p><strong>Shortcode PHP Usage</strong></p>\n<pre><code>&lt;?php echo do_shortcode( '[gslogo id=1]' ); ?&gt;\n</code></pre>\n<h3>Documentation</h3>\n<p>If you have any questions regarding the <strong>WordPress Logo Carousel</strong> plugin and how to work with it, We recommend referring to our comprehensive online documentation. It provides detailed information and instructions to assist you in navigating and utilizing the plugin effectively. You can find the <a href=\"https://docs.gsplugins.com/gs-logo-slider\" rel=\"nofollow ugc\">Documentation</a> here.</p>\n<h3>Quick Support &amp; Bug Reporting</h3>\n<p>If you encounter any problems or discover bugs, please post them in our <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a> channel. We aim to respond as soon as possible (excluding holidays).</p>\n<p><strong><em>Pro users are requested to contact our support channel for dedicated assistance.</em></strong></p>\n<p>🙋‍♂️ Alternatively, you can reach out to us through our <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a> or <a href=\"https://wordpress.org/support/plugin/gs-logo-slider/\" rel=\"ugc\">WordPress.org</a> support forum.</p>\n<h3>Development Team</h3>\n<p>Crafted and Developed with Passion by <a href=\"https://www.gsplugins.com\" rel=\"nofollow ugc\">GS Plugins</a></p>\n<h3>Confused?</h3>\n<p>🎬 <a href=\"https://logo.gsplugins.com\" rel=\"nofollow ugc\">View live Demos &raquo;</a><br />\n📚 <a href=\"https://docs.gsplugins.com/gs-logo-slider\" rel=\"nofollow ugc\">Documentation &raquo;</a></p>\n<h3>🔥 You may like other plugins from <a href=\"https://www.gsplugins.com\" rel=\"nofollow ugc\">GS Plugins</a></h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-testimonial\" rel=\"ugc\">Testimonial Slider</a></strong> &#8211; Testimonials slider displays rotating customer endorsements and recommendations, helping to build trust and credibility for a business or product.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-portfolio/\" rel=\"ugc\">Portfolio</a></strong> &#8211; Filterable Portfolio plugin for WordPress allows you to easily display and showcase your projects, highlighting your skills and abilities.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-team-members\" rel=\"ugc\">Team Members</a></strong> &#8211; Build a Stunning Team Page or Section and Show off Your Team&#8217;s Talents!</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-projects\" rel=\"ugc\">Projects</a></strong> &#8211; Projects showcase displays detailed information including client reviews, ratings, galleries, and videos for a business&#8217;s work.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-books-showcase\" rel=\"ugc\">Books Showcase</a></strong> &#8211; Books showcase displays detailed information including author, published date, reviews, ratings, and gallery, allowing users to easily find and explore books.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-coach\" rel=\"ugc\">Coaches</a></strong> &#8211; Coaches plugin displays coaches&#8217; experience, skills, reviews, ratings, and certifications, helping users find the right coach for their needs.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/posts-grid\" rel=\"ugc\">Posts Grid</a></strong> &#8211;  WordPress Posts Grid plugin displays the latest posts in an elegant grid format, allowing for easy navigation and quick access to new content on a website.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/posts-widget\" rel=\"ugc\">Posts Widget</a></strong> &#8211;  WordPress Posts Widget plugin displays the latest posts in an elegant format on the sidebar or any widget area, allowing for easy navigation and quick access to new content on a website.</p>\n<h3>🎯 WooCommerce Plugins</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woocommerce-products-slider\" rel=\"ugc\">WooCommerce Products Slider</a></strong> &#8211; WooCommerce Product Slider plugin displays products in a visually pleasing, sliding manner, making it easy for customers to browse and find the products they want on an online store.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woo-variation-swatches\" rel=\"ugc\">WooCommerce Variation Swatches</a></strong> &#8211; WooCommerce Variation Swatches plugin replaces the default dropdown fields for variable products with visually appealing swatches, making it easier for customers to select product options and improve the overall shopping experience.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woo-brands\" rel=\"ugc\">WooCommerce Brands</a></strong> &#8211; WooCommerce Brands taxonomy plugin allows for easy cataloging of products by adding a brand taxonomy, making it simple to organize and filter products on an online store.</p>\n<h3>📣 Social Plugins</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-dribbble-portfolio\" rel=\"ugc\">Dribbble Portfolio</a></strong> &#8211; Dribbble Portfolio WP plugin enables you to display your Dribbble shots on your website in a portfolio layout, allowing you to showcase your design work to a wider audience.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-behance-portfolio\" rel=\"ugc\">Behance Portfolio</a></strong> &#8211; Behance Portfolio WordPress plugin allows you to display your Behance projects on your website in a visually appealing layout, making it easy for your audience to view and appreciate your work.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-pinterest-portfolio\" rel=\"ugc\">Pinterest Portfolio</a></strong> &#8211; Pinterest plugin for WordPress allows you to display your Pinterest pins on your website, giving your audience a chance to view and interact with your boards, and potentially drive more traffic to your Pinterest profile.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-instagram-portfolio/\" rel=\"ugc\">Instagram Portfolio</a></strong> &#8211; Instagram plugin for WordPress allows you to display your Instagram posts on your website, making it easy for visitors to view and interact with your content and also to increase engagement on your website.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-envato-portfolio\" rel=\"ugc\">Portfolio &#8211; Envato</a></strong> &#8211; Envato Portfolio Plugin allows you to display your Themeforest and Codecanyon items on your website, showcasing your digital products and making them easily accessible for potential customers.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-youtube-gallery\" rel=\"ugc\">Youtube Gallery</a></strong> &#8211; YouTube Gallery plugin allows you to display videos from a YouTube channel or playlist on your website, creating a visually appealing gallery and making it easy for visitors to access and watch your videos.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/feeds-of-twitter\" rel=\"ugc\">Twitter Feeds</a></strong> &#8211; Twitter Feeds plugin displays Twitter feeds, hashtags, user cards, and collections on a website, making it easy for visitors to view and interact with your Twitter content.</p>\n<h3>🏆 Branding Plugin</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-custom-login\" rel=\"ugc\">Custom Login</a></strong> &#8211; GS Custom Login allows you to customize the WordPress login screen, providing an easy way to create a unique and visually appealing login experience for your website users.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/powerup\" rel=\"ugc\">PowerUp</a></strong> &#8211; Enhance Your WordPress Experience with the Ultimate Security &amp; Convenience Solution &#8211; Hide Admin Bar, Login &amp; Logout Redirection, Disable Comments &amp; Restrict WP-Admin Module.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/gs-logo-slider.3.7.0.zip",
    "upgrade_notice": {
        "Version 3.7.0 [19th Aug 2024]": "<ul>\n<li>[Added]: Enable/Disable Single Logo Page Option.</li>\n</ul>",
        "Version 3.6.9 [1st Jul 2024]": "<ul>\n<li>[Fixed]: XSS Issue.</li>\n</ul>",
        "Version 3.6.8 [31st Mar 2024]": "<ul>\n<li>[Improved]: CSS Issue.</li>\n</ul>",
        "Version 3.6.7 [23rd Mar 2024]": "<ul>\n<li>[Fixed]: PHP Warning When Deleted Shortcode is Used.</li>\n</ul>",
        "Version 3.6.6 [17th Mar 2024]": "<ul>\n<li>[Added]: Flip/Secondary Image adding Option.</li>\n<li>[Updated]: Category under title &gt; Default On to Off.</li>\n<li>[Updated]: Moved Excerpt Box below Other Meta Boxes.</li>\n<li>[Updated]: Secondary Logo as Pro Feature.</li>\n</ul>",
        "Version 3.6.5 [28th Jan 2024]": "<ul>\n<li>[Added]: Support for the Query Loop Block.</li>\n<li>[Added]: Excerpt Support.</li>\n<li>[Fixed]: Jetpack Feature Image Hidden Issue.</li>\n</ul>",
        "Version 3.6.4 [14th Dec 2023]": "<ul>\n<li>[Fixed]: Custom CSS not Generating Issue.</li>\n<li>[Fixed]: List Theme Wrong Column Issue.</li>\n</ul>",
        "Version 3.6.3 [7th Dec 2023]": "<ul>\n<li>[Fixed]: Hot Fix.</li>\n</ul>",
        "Version 3.6.2 [6th Dec 2023]": "<ul>\n<li>[Fixed]: Database Error Issue.</li>\n</ul>",
        "Version 3.6.1 [5th Dec 2023]": "<ul>\n<li>[Fixed]: Elementor Pro Swiper JS Conflict.</li>\n</ul>",
        "Version 3.6.0 [3rd Dec 2023]": "<ul>\n<li>[Improved]: Compatibility Checking With Pro Version.</li>\n</ul>",
        "Version 3.5.2 [29th Nov 2023]": "<ul>\n<li>[Added]: Namespace To Asset Generator.</li>\n<li>[Fixed]: Salient Theme Swiper Height Issue.</li>\n<li>[Fixed]: Shortcode Security Issue.</li>\n<li>[Updated]: Integrations &amp; Assets.</li>\n<li>[Updated]: Gutenberg, Divi, Elementor, Oxygen, WPBakery, Beaver Builder &amp; TagDiv Builder (Newspaper Theme) Integration.</li>\n<li>[Updated]: Swiper JS.</li>\n<li>[Updated]: Function Name.</li>\n<li>[Removed]: GSL_HACK_MSG.</li>\n</ul>",
        "Version 3.5.1 [30th Aug 2023]": "<ul>\n<li>[Added]: Oxygen Builder Integration.</li>\n<li>[Added]: Beaver Builder Integration.</li>\n<li>[Added]: Table Theme Heading Text Change Options.</li>\n<li>[Added]: Nofollow, Noopener, Norefferer Options.</li>\n<li>[Fixed]: Category selection Option.</li>\n</ul>",
        "Version 3.4.9 [16th Jul 2023]": "<ul>\n<li>[Fixed]: Category Include issue on the Shortcode Builder.</li>\n</ul>",
        "Version 3.4.8 [9th Jul 2023]": "<ul>\n<li>[Fixed]: Undefined Array Index Issue.</li>\n</ul>",
        "version 3.4.7 [17th Jun 2023]": "<ul>\n<li>[Added]: Custom Image Size.</li>\n<li>[Added]: Horizontal Alignment option for Grid themes.</li>\n<li>[Fixed]: Shortcode Disappear issue on Certain Cases.</li>\n<li>[Fixed]: Few PHP Notices.</li>\n<li>[Fixed]: Template Loading on Certain Cases.</li>\n<li>[Improved]: Editor Performance.</li>\n<li>[Improved]: Caching Mechanism.</li>\n</ul>",
        "version 3.4.6 [4th Jun 2023]": "<ul>\n<li>[Updated]: Minimum Value Set to 1 For Slider Theme on the Different Devices.</li>\n</ul>",
        "version 3.4.5 [18th Apr 2023]": "<ul>\n<li>[Fixed]: Empty Category Warning.</li>\n</ul>",
        "version 3.4.4 [9th Apr 2023]": "<ul>\n<li>[Updated]: Unlock the disabled switchers.</li>\n</ul>",
        "version 3.4.3 [8th Apr 2023]": "<ul>\n<li>[Updated]: Appesro SDK.</li>\n<li>[Updated]: Set a default value for the Clickable Logos field.</li>\n</ul>",
        "version 3.4.2 [16th Jan 2023]": "<ul>\n<li>[Fixed]: Escaping Issue.</li>\n</ul>",
        "version 3.4.1 [11th Jan 2023]": "<ul>\n<li>[Fixed]: Responsive Issues.</li>\n</ul>",
        "version 3.4.0 [5th Jan 2023]": "<ul>\n<li>[Fixed]: WP Recommended Sanitize Issues.</li>\n<li>[Updated]: Logo POT File.</li>\n</ul>",
        "version 3.3.9 [2nd Jan 2023]": "<ul>\n<li>[Added]: Child Theme Template Overwrite Support.</li>\n<li>[Fixed]: Security Issues - Phase2.</li>\n<li>[Fixed]: DB Prepare Issues.</li>\n<li>[Updated]: All Dummy Shortcodes Data.</li>\n</ul>",
        "version 3.3.8 [29th Dec 2022]": "<ul>\n<li>[Fixed]: Security Issues.</li>\n<li>[Updated]: Help &amp; Free, Pro common pages.</li>\n</ul>",
        "version 3.3.7 [25th Sep 2022]": "<ul>\n<li>[Added]: TagDiv Builder (Newspaper Theme) Support.</li>\n</ul>",
        "version 3.3.6 [16th Jul 2022]": "<ul>\n<li>[Fixed]: PHP 8.0 support &amp; Divi Integration Issue.</li>\n<li>[Fixed]: Assets Generation Hooks.</li>\n<li>[Fixed]: PHP 5.6 Unexpected Parse Error.</li>\n<li>[Updated]: Function Name.</li>\n</ul>",
        "version 3.3.5 [16th Jun 2022]": "<ul>\n<li>[Added]: Feature to display Category under the Logo Title.</li>\n<li>[Fixed]: Custom CSS not loading issue.</li>\n<li>[Added]: WP 6.0 version Compatibility.</li>\n</ul>",
        "version 3.3.4 [27th Apr 2022]": "<ul>\n<li>[Added]: Logo Title Tag Filter Hook.</li>\n<li>[Improved]: Compatibility with the Pro version for Ticker Theme.</li>\n</ul>",
        "version 3.3.3 [11th Apr 2022]": "<ul>\n<li>[Updated]: Slider Excessive Items Issue.</li>\n</ul>",
        "version 3.3.2 [9th Apr 2022]": "<ul>\n<li>[Fixed]: Slider Excessive Items Issue.</li>\n</ul>",
        "version 3.3.1 [3rd Apr 2022]": "<ul>\n<li>[Fixed]: Scroll conflict with Elementor.</li>\n</ul>",
        "version 3.3.0 [12th Feb 2022]": "<ul>\n<li>[Fixed]: Custom CSS loading issue on the Editor.</li>\n<li>[Added]: Support for dynamic Pages, Sidebars, Footers and Widgets.</li>\n<li>[Improved]: Compatibility for the Pro version.</li>\n</ul>",
        "version 3.2.1 [9th Feb 2022]": "<ul>\n<li>[Fixed]: For Builders.</li>\n</ul>",
        "version 3.1.3 [7th Feb 2022]": "<ul>\n<li>[Added]: Recursive function for finding inner columns for GS Logo Widget in Elementor document.</li>\n<li>[Fixed]: Find inner columns GS Logo Widget in Elementor document.</li>\n</ul>",
        "version 3.1.2 [6th Feb 2022]": "<ul>\n<li>[Removed]: Default option from Elementor.</li>\n</ul>",
        "version 3.1.1 [6th Feb 2022]": "<ul>\n<li>[Added]: Option (on/off) to disable Lazy Load.</li>\n<li>[Added]: Class field option to exclude Lazy Loading.</li>\n<li>[Added]: Latest WP version Compatibility.</li>\n<li>[Removed]: Admin notices from Logo pages.</li>\n</ul>",
        "version 3.0.9 [30th May 2021]": "<ul>\n<li>[Added]: Support for &quot;Ultimate Addons for Gutenberg&quot; plugin.</li>\n</ul>",
        "version 3.0.8 [23rd May 2021]": "<ul>\n<li>[Fixed]: PHP 7.3 Compatibility.</li>\n<li>[Fixed]: Deprecated Function Warning.</li>\n</ul>",
        "version 3.0.7 [20th May 2021]": "<ul>\n<li>[Added]: Direction <strong><em>Left to Right</em></strong> for Slider &amp; Ticker Theme (Pro feature).</li>\n<li>[Fixed]: CLS issue for unsupported CSS Property: border-radius</li>\n<li>[Fixed]: Lazy-load issues with images at Grid layout.</li>\n<li>[Fixed]: Output buffer issue.</li>\n<li>[Added]: Identification class to Logo images.</li>\n<li>[Updated]: Increased <strong><em>Sliding Speed</em></strong> and Autoplay pause value to max 10,000</li>\n</ul>",
        "version 3.0.6 [24th Apr 2021]": "<ul>\n<li>[Fixed]: Conflicted function name with other plugins.</li>\n<li>[Fixed]: Cumulative Layout Shift Error.</li>\n<li>[Fixed]: Wrong unique key issue.</li>\n<li>[Fixed]: SVG&#039;s size issue.</li>\n</ul>",
        "version 3.0.5 [19th Apr 2021]": "<ul>\n<li>[Added]: Slider nav positions.</li>\n<li>[Added]: Multiliangual support.</li>\n<li>[Added]: SVG logo support.</li>\n<li>[Fixed]: AppSero conflict with other plugins.</li>\n<li>[Fixed]: Discount admin notice if pro is active.</li>\n<li>[Removed]: GO Pro link when premium plugin is active.</li>\n</ul>",
        "version 3.0.4 [18th Feb 2021]": "<ul>\n<li>[Fixed]: Compatibility issue with jQuery 3+</li>\n</ul>",
        "version 3.0.3 [10th Feb 2021]": "<ul>\n<li>[Fixed]: Multiple Carousels navigation issue.</li>\n<li>[Fixed]: Swift Builder carousel conflict.</li>\n<li>[Fixed]: Viewpoint for unprotected width.</li>\n<li>[Updated]: Scripts.</li>\n</ul>",
        "version 3.0.2 [6th Feb 2021]": "<ul>\n<li>[Fixed]: Potential shortcode error.</li>\n<li>[Fixed]: RTL Issue.</li>\n</ul>",
        "version 3.0.1 [31st Jan 2021]": "<ul>\n<li>[Fixed]: Swiper JS conflict with other themes.</li>\n<li>[Updated]: Integration with Gutenberg, Elementor, WPBakery, Divi Builders.</li>\n</ul>",
        "version 3.0.0 [28th Jan 2021]": "<ul>\n<li>[Updated]: Rewritten the plugin.</li>\n<li>[Added]: Import / delete Logo dummy data.</li>\n<li>[Added]: Edit, Clone / Duplicate, Delete Shortcode.</li>\n<li>[Added]: Overwrite Templates.</li>\n<li>[Added]: Performance Improvements.</li>\n<li>[Added]: Page Builder Support for Gutenberg, Elementor, WPBakery, Divi Builders.</li>\n<li>[Added]: Translations done for static strings.</li>\n<li>[Added]: Old Shortcode support.</li>\n<li>[Updated]: Cleanup &amp; Optimize assets.</li>\n<li>[Updated]: Organize files in the folder.</li>\n<li>[Fixed]: jQuery sort error in console.</li>\n<li>[Fixed]: Admin old CSS &amp; JS files loading in every page.</li>\n<li>[Fixed]: Custom style issue with Divi Builder.</li>\n<li>[Improved]: Compatibility with more themes.</li>\n</ul>",
        "version 1.8.16 [7th Jan 2021]": "<ul>\n<li>[Improved]: Few files urls.</li>\n<li>[Removed]: Admin Notice Ticker function.</li>\n<li>[Removed]: Removed unnecessary files from Appsero library.</li>\n</ul>",
        "version 1.8.15 [17th Dec 2020]": "<ul>\n<li>[Updated]: AppSero Client.</li>\n<li>[Removed]: Affiliate Admin Notice.</li>\n<li>[Updated]: WordPress 5.6</li>\n</ul>",
        "version 1.8.14 [27th Sep 2020]": "<ul>\n<li>[Fixed]: Affiliate Admin Notice.</li>\n</ul>",
        "version 1.8.13 [13th Sep 2020]": "<ul>\n<li>[Added]: New Admin Notice.</li>\n</ul>",
        "version 1.8.12 [13th Aug 2020]": "<ul>\n<li>[Updated]: WordPress 5.5</li>\n</ul>",
        "version 1.8.11 [24th Jun 2020]": "<ul>\n<li>[Updated]: AppSero Client.</li>\n</ul>",
        "version 1.8.10 [28th Apr 2020]": "<ul>\n<li>[Removed]: Admin Notice.</li>\n</ul>",
        "version 1.8.9 [21st Apr 2020]": "<ul>\n<li>[Updated]: Admin Notice.</li>\n</ul>",
        "version 1.8.8 [20th Apr 2020]": "<ul>\n<li>[Added]: Admin Notice.</li>\n</ul>",
        "version 1.8.7 [7th Apr 2020]": "<ul>\n<li>[Added]: Compatibility with Latest WP version.</li>\n<li>[Added]: CSS for BX loader.</li>\n</ul>",
        "version 1.8.6 [27th Feb 2020]": "<ul>\n<li>[Added]: Options for Breakpoints.</li>\n<li>[Fixed]: Responsive Breakpoints.</li>\n</ul>",
        "version 1.8.5 [23rd Nov 19]": "<ul>\n<li>[Fixed]: Domain name with www &amp; fixed all urls.</li>\n</ul>",
        "version 1.8.4 [19th Nov 19]": "<ul>\n<li>[Added]: Logo Category Support.</li>\n<li>[Added]: Logo Category Support at Block.</li>\n</ul>",
        "version 1.8.3 [20th Oct 19]": "<ul>\n<li>[Fixed]: Domain name changed &amp; fixed all urls.</li>\n<li>[Fixed]: Admin CSS.</li>\n<li>[Added]: New Contributors.</li>\n</ul>",
        "version 1.8.2": "<ul>\n<li>[Fixed]: JS conflict with Divi theme. Divider &gt; Style dropdown not working. Now fixed</li>\n<li>[Fixed]: JS conflict with Divi theme. Section &gt; Background Color picker not working. Now fixed</li>\n<li>[Fixed]: Responsiveness for 3 themes - Grid 1, List 1, Table 1</li>\n</ul>",
        "version 1.8.1": "<ul>\n<li>[Fixed]: Gutenberg Block for the old Gutenberg version compatibility</li>\n<li>[Fixed]: Initial value for Gutenberg Block</li>\n</ul>",
        "version 1.8": "<ul>\n<li>[Added]: Gutenberg Editor Support</li>\n<li>[Added]: Gutenberg Block</li>\n<li>[Added]: Released new 3 themes - Grid 1, List 1, Table 1</li>\n<li>[Fixed]: Reposition GS Logo&#039;s sub menu pages</li>\n<li>[Fixed]: Admin CSS</li>\n</ul>",
        "version 1.7.2": "<ul>\n<li>Activation redirects added</li>\n<li>Coupon Code added</li>\n</ul>",
        "version 1.7.1": "<ul>\n<li>Help &amp; Usage info added</li>\n<li>Code Improved</li>\n</ul>",
        "version 1.7": "<ul>\n<li>Fixed Text Domain</li>\n<li>Added Review system</li>\n</ul>",
        "version 1.6": "<ul>\n<li>Shortcode attribute - order is now dynamic, previously it was fixed to DESC</li>\n<li>Shortcode attribute - orderby is now dynamic to ID / title / modified / rand, previously it was fixed to date.</li>\n</ul>",
        "version 1.5": "<ul>\n<li>Disabled Logo Archive Page</li>\n<li>Excluded Logos from search results</li>\n</ul>",
        "version 1.0.4": "<ul>\n<li>Fixed query issue for WP 4.4</li>\n</ul>",
        "version 1.0.2": "<ul>\n<li>Documentation Added</li>\n<li>Added Demo &amp; Doc links</li>\n<li>Logo size changed to 200px X 200px</li>\n<li>By default title is not visible now</li>\n<li>Added different screenshots</li>\n<li>Added PRO features info</li>\n<li>Docs link added at sidebar</li>\n</ul>",
        "version 1.0.1": "<ul>\n<li>Added Descending logo order</li>\n<li>Increased 20 number of logos to display</li>\n</ul>",
        "version 1.0": "<ul>\n<li>Initial release</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-1.gif?rev=2778762",
            "caption": "Default Color."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-2.gif?rev=2778768",
            "caption": "Default to Gray color in Reverse Direction."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-3.gif?rev=2778768",
            "caption": "Ticker Mode like News Scroll in both Directions."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-4.gif?rev=2778764",
            "caption": "Vertical Ticker Up."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-5.gif?rev=2778783",
            "caption": "2 Rows Slider &amp; Default Color."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-6.gif?rev=2778783",
            "caption": "Display Vertically."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-7.gif?rev=2778783",
            "caption": "Filter - 1 &amp; Default Color."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-8.gif?rev=2778783",
            "caption": "Live Filter."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-9.gif?rev=2778799",
            "caption": "GIF supported in Slider."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-10.gif?rev=2778799",
            "caption": "Custom Order for the plugin. After Drag &amp; Drop, go to Logo Shortcode &gt; Crete/Edit Shortcode &gt; Go to Query (3rd tab) &gt; Set Order: ASC (From Dropdown). ASC/DESC may be set to your liking. &gt; Set Order By: Custom Order (From Dropdown)"
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-11.png?rev=2779748",
            "caption": "Add a new Logo."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-12.png?rev=2779748",
            "caption": "All Logos."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-13.png?rev=2779748",
            "caption": "Created a Shortcodes list."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-14.png?rev=2779748",
            "caption": "Create New Shortcode with Preview."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-15.png?rev=2779748",
            "caption": "Preferences / Custom CSS &amp; Skip Lazy Loading for logos."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-16.png?rev=2779757",
            "caption": "Install Demo Data."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-17.png?rev=2779757",
            "caption": "General Settings."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-18.png?rev=2779757",
            "caption": "GS Logo Style Settings(2nd Tab)."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-19.png?rev=2779757",
            "caption": "GS Logo Query Settings (3rd Tab)."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-20.png?rev=2779757",
            "caption": "Logo Gutenberg Block."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-21.png?rev=2779757",
            "caption": "Logo Widget for Elementor."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-22.png?rev=2779757",
            "caption": "WPBakery - Element."
        },
        {
            "src": "https://ps.w.org/gs-logo-slider/assets/screenshot-23.png?rev=2779757",
            "caption": "Divi Builder - Module."
        }
    ],
    "tags": {
        "client-logo": "client logo",
        "logo-carousel": "logo carousel",
        "logo-carousel-slider": "logo carousel slider",
        "logo-slider": "logo slider",
        "logo-wordpress-plugin": "logo wordpress plugin"
    },
    "stable_tag": "3.7.0",
    "versions": {
        "3.6.0": "https://downloads.wordpress.org/plugin/gs-logo-slider.3.6.0.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/gs-logo-slider.3.6.1.zip",
        "3.6.2": "https://downloads.wordpress.org/plugin/gs-logo-slider.3.6.2.zip",
        "3.6.3": "https://downloads.wordpress.org/plugin/gs-logo-slider.3.6.3.zip",
        "3.6.4": "https://downloads.wordpress.org/plugin/gs-logo-slider.3.6.4.zip",
        "3.6.5": "https://downloads.wordpress.org/plugin/gs-logo-slider.3.6.5.zip",
        "3.6.6": "https://downloads.wordpress.org/plugin/gs-logo-slider.3.6.6.zip",
        "3.6.7": "https://downloads.wordpress.org/plugin/gs-logo-slider.3.6.7.zip",
        "3.6.8": "https://downloads.wordpress.org/plugin/gs-logo-slider.3.6.8.zip",
        "3.6.9": "https://downloads.wordpress.org/plugin/gs-logo-slider.3.6.9.zip",
        "3.7.0": "https://downloads.wordpress.org/plugin/gs-logo-slider.3.7.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/gs-logo-slider.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.paypal.com/donate/?hosted_button_id=K7K8YF4U3SCNQ",
    "banners": {
        "low": "https://ps.w.org/gs-logo-slider/assets/banner-772x250.png?rev=2971147",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/gs-logo-slider/assets/Icon-256x256.png?rev=2971147",
        "2x": "https://ps.w.org/gs-logo-slider/assets/Icon-256x256.png?rev=2971147"
    },
    "blocks": {
        "gslogo/shortcodes": {
            "name": "gslogo/shortcodes",
            "title": "Gslogo Shortcodes"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 96,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}