{
    "name": "Product Views for WooCommerce &#8211; Product Slider, Grid, Ticker, List &amp; Masonry",
    "slug": "gs-woocommerce-products-slider",
    "version": "3.0.0",
    "author": "<a href=\"https://www.gsplugins.com\">GS Plugins</a>",
    "author_profile": "https://profiles.wordpress.org/samdani/",
    "contributors": {
        "gsplugins": {
            "profile": "https://profiles.wordpress.org/gsplugins/",
            "avatar": "https://secure.gravatar.com/avatar/f78b1ff4757014dbee6dd0f9e263bdd1?s=96&d=monsterid&r=g",
            "display_name": "GS Plugins"
        },
        "itszaman": {
            "profile": "https://profiles.wordpress.org/itszaman/",
            "avatar": "https://secure.gravatar.com/avatar/92e3e231b1a5ded7b5e32db5e00039b2?s=96&d=monsterid&r=g",
            "display_name": "Md. Sarwar Zaman"
        },
        "samdani": {
            "profile": "https://profiles.wordpress.org/samdani/",
            "avatar": "https://secure.gravatar.com/avatar/2cc43b03989e22b7a8f456d7e3973e05?s=96&d=monsterid&r=g",
            "display_name": "Golam Samdani"
        },
        "itsariful": {
            "profile": "https://profiles.wordpress.org/itsariful/",
            "avatar": "https://secure.gravatar.com/avatar/259ad30925c81ea504be2526de2c292b?s=96&d=monsterid&r=g",
            "display_name": "Ariful Islam"
        },
        "devshakhawat": {
            "profile": "https://profiles.wordpress.org/devshakhawat/",
            "avatar": "https://secure.gravatar.com/avatar/eb8ef64cd18125b98472fcf37ccc22bf?s=96&d=monsterid&r=g",
            "display_name": "Shakhawat Hossain"
        }
    },
    "requires": "4.3",
    "tested": "6.6.1",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 78,
    "ratings": {
        "5": 5,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 7,
    "support_url": "https://wordpress.org/support/plugin/gs-woocommerce-products-slider/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 300,
    "downloaded": 24884,
    "last_updated": "2024-07-28 10:37am GMT",
    "added": "2017-09-20",
    "homepage": "https://www.gsplugins.com/wordpress-plugins",
    "sections": {
        "description": "<p>Enhance Your Product Displays for Better Sales! Utilize Carousel, Grid, Ticker, List, and Masonry layouts to maximize conversions. Display products anywhere using shortcodes like [gswoo id=#].</p>\n<p>Whether you&#8217;re selling digital or physical products via WooCommerce, presentation is crucial. <strong><em>GS WooCommerce Product Slider</em></strong> enhances your online store&#8217;s appearance, allowing you to engage customers effectively.</p>\n<p>With this plugin, create dynamic &#8220;Digital Signage&#8221; for new product introductions, brand awareness, increased exposure, and sales. No coding knowledge required. It&#8217;s the <em>Best WooCommerce Product Slider</em> plugin, offering simplicity, flexibility, and power.</p>\n<p>Boost your online business with the Best WooCommerce Product Slider Plugin!</p>\n<p>🎬 <a href=\"https://wooprod.gsplugins.com\" rel=\"nofollow ugc\">Live Demo</a> ⬆️ <a href=\"https://www.gsplugins.com/product/gs-woocommerce-product-slider\" rel=\"nofollow ugc\">Upgrade to PRO</a> 📚 <a href=\"https://docs.gsplugins.com/woocommerce-product-slider\" rel=\"nofollow ugc\">Documentation</a> 🙋‍♂️ <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a></p>\n<h3>Why WooCommerce Product Slider plugin is crucial for your business?</h3>\n<p>In today&#8217;s competitive online market, captivating product displays are essential for attracting customers and boosting sales. The WooCommerce Product Slider plugin plays a crucial role in enhancing your business by offering dynamic and visually appealing product showcases. With various layout options like Carousel, Grid, Ticker, List, and Masonry, this plugin allows you to create engaging displays that capture attention and encourage conversions.</p>\n<p>By showcasing your products in an attractive and organized manner, the WooCommerce Product Slider plugin helps you stand out from the competition and provides a better shopping experience for your customers. With the ability to display products anywhere on your site using shortcodes, this plugin ensures that your products are always front and center, increasing visibility and sales opportunities.</p>\n<h3>What makes GS WooCommerce Product Slider plugin stand out?</h3>\n<p>The <em>GS WooCommerce Product Slider</em> plugin stands out for several reasons, making it a must-have tool for any WooCommerce store owner.</p>\n<ul>\n<li><strong>Versatility:</strong> With multiple layout options including Carousel, Grid, Ticker, List, and Masonry, this plugin offers versatility to suit various product display needs.</li>\n<li><strong>Ease of Use:</strong> The plugin is user-friendly, allowing you to create stunning product displays without any coding knowledge.</li>\n<li><strong>Customization:</strong> It offers extensive customization options, including control over colors, styles, and display settings.</li>\n<li><strong>Compatibility:</strong> GS WooCommerce Product Slider plugin seamlessly integrates with popular page builders and is compatible with any standard WordPress theme.</li>\n<li><strong>Performance:</strong> It ensures optimized performance with swift loading times, enhancing user experience.</li>\n<li><strong>Responsive Design:</strong> The plugin is fully responsive, ensuring that your product displays look great on all devices.</li>\n<li><strong>Support and Updates:</strong> With priority email support and continuous updates, you can rely on GS WooCommerce Product Slider plugin for ongoing assistance and improvements.</li>\n</ul>\n<h3>Comprehensive Plugin Features</h3>\n<p>Unlock the Full Potential of <em>WooCommerce Product Slider</em> with an Impressive Set of Features:</p>\n<ul>\n<li><strong>40+ Designs:</strong> Choose from Carousel, Grid, Masonry, List, or Ticker layouts for your product display.</li>\n<li><strong>Theme Flexibility:</strong> Easily switch between Grid, Slider, Masonry, List, or Ticker themes.</li>\n<li><strong>Advanced Templating:</strong> Utilize Archive Templates and Shortcode Generator with Preview for enhanced customization.</li>\n<li><strong>Page Builder Compatibility:</strong> Seamlessly integrate with popular page builders for effortless design.</li>\n<li><strong>Category-wise Products:</strong> Include or exclude products based on categories.</li>\n<li><strong>Tag-wise Products:</strong> Include or exclude products based on tags.</li>\n<li><strong>Type-wise Products:</strong> Include or exclude products by type &#8211; Featured, In Stock, Free.</li>\n<li><strong>Specific Products:</strong> Include or exclude specific products by name.</li>\n<li><strong>Display Control:</strong> Show or hide various product elements like Title, Description, Ratings, Countdown, Price, Add to Cart, Wishlist, Compare, Quick View, Hot Badge, Out Of Stock Badge, Sale Badge, etc.</li>\n<li><strong>Description Length:</strong> Control the character length of product descriptions.</li>\n<li><strong>Product QuickView, Wishlist, and Compare Options:</strong> Enhance user experience with quick actions.</li>\n<li><strong>WooCommerce Quick View, Wishlist, Compare Plugin Supported:</strong> Seamless integration with essential plugins.</li>\n<li><strong>Optimized Performance:</strong> Enjoy swift loading times for improved user experience.</li>\n<li><strong>Conditional Script Loading:</strong> Load scripts only where necessary, optimizing site performance.</li>\n<li><strong>Localization Input Fields:</strong> Easily replace preferred texts for localization.</li>\n<li><strong>Responsive Design:</strong> Ensure compatibility across various devices with responsive design.</li>\n<li><strong>Theme Compatibility:</strong> Works seamlessly with any standard WordPress theme.</li>\n<li><strong>Developer-Friendly:</strong> Easily customizable for developers according to specific needs.</li>\n<li><strong>Browser Compatibility:</strong> Supported across all modern browsers.</li>\n<li><strong>SEO Boost:</strong> Enhance SEO with schema.org markup for better visibility.</li>\n<li><strong>W3C Valid Markup:</strong> Adheres to W3C standards for valid markup.</li>\n<li><strong>Flexible Output:</strong> Display products anywhere using generated shortcodes.</li>\n<li><strong>User-Friendly Setup:</strong> Easy to set up with a user-friendly interface.</li>\n<li><strong>RTL Support:</strong> Compatible with languages that read from right to left.</li>\n<li><strong>Translation Ready:</strong> Translatable with included POT files for multilingual sites.</li>\n<li><strong>Priority Email Support:</strong> Access dedicated support for any assistance needed.</li>\n<li><strong>Free Installation:</strong> Receive free installation assistance if required.</li>\n<li><strong>Robust Documentation:</strong> Well-documented with comprehensive support for queries.</li>\n<li><strong>Continuous Updates:</strong> Stay updated with new features and improvements.</li>\n<li><strong>Live Demos</strong>: 🎬 <a href=\"https://wooprod.gsplugins.com\" rel=\"nofollow ugc\">View live Demos &raquo;</a></li>\n<li><strong>Upgrade to PRO</strong>: ⬆️ <a href=\"https://www.gsplugins.com/product/gs-woocommerce-product-slider\" rel=\"nofollow ugc\">Upgrade to PRO &raquo;</a></li>\n</ul>\n<h3>General Settings (WooCommerce Product Slider)</h3>\n<p>Start by navigating to <strong>Product Views &gt; Shortcode</strong>. Here, you can either create a new shortcode or edit an existing one. Once inside, you’ll land on the <strong>General</strong> Settings page.</p>\n<ul>\n<li><strong><em>General Settings Fields:</em></strong>\n<ul>\n<li><strong>Shortcode Name:</strong> Give your shortcode a unique name.</li>\n<li><strong>View Type:</strong> Choose from Carousel, Grid, Masonry, List, or Ticker layouts.</li>\n<li><strong>Image Type:</strong> Select between Solid or Transparent.</li>\n<li><strong>Columns Control:</strong> Adjust the number of columns for Desktop, Tablet, Mobile &amp; Small Mobile (1 to 6 columns).</li>\n<li><strong>Columns Gap:</strong> Increase or decrease the gap between each item. Default is 30.</li>\n<li><strong>Display Title:</strong> Show or Hide Product Title.</li>\n<li><strong>Display Ratings:</strong> Show or Hide Product Ratings.</li>\n<li><strong>Display Count Down:</strong> Show or Hide Product Count Down Timer. Make sure <em>WPC Countdown Timer</em> plugin is active.</li>\n<li><strong>Display Price:</strong> Show or Hide Product Price.</li>\n<li><strong>Display Description:</strong> Show or Hide Product Description.</li>\n<li><strong>Description Length:</strong> Control the Description Character Length. Set to 0 for displaying all characters.</li>\n<li><strong>Display Add to Cart:</strong> Show or Hide Product Add to Cart button.</li>\n<li><strong>Display Wishlist:</strong> Show or Hide the Wishlist button. Make sure <em>YITH WooCommerce Wishlist</em> plugin is activated.</li>\n<li><strong>Display Compare:</strong> Show or Hide the Compare button. Make sure <em>YITH WooCommerce Compare</em> plugin is activated.</li>\n<li><strong>Display Quick View:</strong> Show or Hide the Quick View button. Make sure <em>YITH WooCommerce Quick View</em> plugin is activated.</li>\n<li><strong>Display Hot Badge:</strong> Show or Hide the Hot badge.</li>\n<li><strong>Display Out Of Stock Badge:</strong> Show or Hide the Out Of Stock badge.</li>\n<li><strong>Display Sale Badge:</strong> Show or Hide the Sale badge.</li>\n<li><strong>Sale Badge Type:</strong> Choose between Text or Numeric.</li>\n</ul>\n</li>\n<li><strong><em>Carousel Settings (When View Type is Carousel):</em></strong>\n<ul>\n<li><strong>Move Items:</strong> Set the number of items to move (1 to 6).</li>\n<li><strong>Slides Speed:</strong> Duration of transition between slides (in milliseconds).</li>\n<li><strong>Infinite Loop:</strong> Enable/Disable looping through slides.</li>\n<li><strong>Reverse Direction:</strong> Reverse the direction of carousel navigation.</li>\n<li><strong>Autoplay:</strong> Enable/Disable automatic slide change.\n<ul>\n<li><strong>Delay:</strong> Set the autoplay delay in milliseconds. Default is 2000 ms.</li>\n<li><strong>Stop On Hover:</strong> Pause autoplay on hover. Default is Off.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h3>Style Settings</h3>\n<p>Easily Customize Your Products Display:</p>\n<p>To get started, navigate to <strong>Product Views &gt; Shortcode</strong>. Create a new shortcode or edit an existing one. Then, proceed to the <strong><em>2nd tab</em></strong> labeled <strong><em>Style</em></strong>.</p>\n<ul>\n<li><strong>Rating Color:</strong> Personalize the color of the rating.</li>\n<li><strong>Price Color:</strong> Define the color of the price.</li>\n<li><strong>Old Price Color:</strong> Set the color of the old price.</li>\n<li><strong>Title Color:</strong> Customize the color of the title.</li>\n<li><strong>Title Hover Color:</strong> Personalize the color of the title on hover.</li>\n<li><strong>Description Color:</strong> Define the color of the description.</li>\n<li><strong>Description Hover Color:</strong> Set the color of the description on hover.</li>\n<li><strong>Badges Color:</strong> Customize the color of badges.</li>\n<li><strong>Badges BG Color:</strong> Personalize the background color of badges.</li>\n<li><strong>Discount Badge BG Color:</strong> Define the background color of discount badges.</li>\n<li><strong>Out of Stock Badge BG Color:</strong> Set the background color of out of stock badges.</li>\n<li><strong>Button Text:</strong> Customize the text of the buttons.</li>\n<li><strong>Button Text Hover:</strong> Personalize the text of the buttons on hover.</li>\n<li><strong>Button Background:</strong> Define the background of the buttons.</li>\n<li><strong>Button Background Hover:</strong> Set the background of the buttons on hover.</li>\n<li><strong><em>For Carousel View Type:</em></strong>\n<ul>\n<li><strong>Enable Carousel Navs:</strong> Toggle carousel navigation.</li>\n<li><strong>Enable Carousel Dots:</strong> Toggle carousel dots.</li>\n<li><strong>Enable Dynamic Dots:</strong> Toggle dynamic carousel dots.</li>\n<li><strong>Navs Style:</strong> Choose from 11 different navigation styles.</li>\n<li><strong>Navs Position:</strong> Choose the position of carousel navigation.\n<ul>\n<li>Bottom</li>\n<li>Center</li>\n<li>Center Outside</li>\n<li>Center Inside</li>\n<li>Top Right</li>\n<li>Top Left</li>\n</ul>\n</li>\n<li><strong>Dots Style:</strong> Choose from 4 different dot styles.</li>\n</ul>\n</li>\n</ul>\n<h3>Query Settings</h3>\n<p>Begin by navigating to <strong>Product Views &gt; Shortcode</strong>. Create a new shortcode or edit an existing one. Then proceed to the <strong><em>3rd tab</em></strong> labeled <strong>Query</strong>.</p>\n<ul>\n<li><strong>Display Limit:</strong> Set the total number of products to display. Use <strong>-1</strong> to show all products.</li>\n<li><strong><em>Order By:</em></strong>\n<ul>\n<li><strong>Product ID:</strong> Sort products by their ID.</li>\n<li><strong>Product Name:</strong> Arrange products alphabetically by name.</li>\n<li><strong>Latest:</strong> Display the latest products.</li>\n<li><strong>Random:</strong> Display products in a random order.</li>\n<li><strong>Best Sellers / Popularity:</strong> Arrange products based on popularity.</li>\n<li><strong>Average Rating:</strong> Sort products by average rating.</li>\n<li><strong>Price:</strong> Arrange products by price.</li>\n</ul>\n</li>\n<li><strong><em>Order:</em></strong>\n<ul>\n<li><strong>DESC (Descending):</strong> Arrange products in descending order.</li>\n<li><strong>ASC (Ascending):</strong> Arrange products in ascending order.</li>\n</ul>\n</li>\n<li><strong>Include Category:</strong> Choose a specific category to showcase products from. Select from the available list of created categories.</li>\n<li><strong>Exclude Category:</strong> Hide products associated with a particular category.</li>\n<li><strong>Include By Tags:</strong> Include items by tag name.</li>\n<li><strong>Exclude By Tags:</strong> Exclude items by tag name.</li>\n<li><strong>Include By Type:</strong> Include product types &#8211; <strong><em>Featured, In Stock, Free</em></strong>.</li>\n<li><strong>Exclude By Type:</strong> Exclude product types &#8211; <strong><em>Featured, In Stock, Free</em></strong>.</li>\n<li><strong>Display Specific Products:</strong> Choose specific products to display.</li>\n<li><strong>Exclude Specific Products:</strong> Exclude specific products from being displayed.</li>\n</ul>\n<h3>Preference ( Global Settings )</h3>\n<p>Navigate to <strong>Product Views &gt; Shortcode</strong> and click on <strong>Preferences</strong>.</p>\n<ul>\n<li>\n<p><strong><em>Replace Preferred Text for:</em></strong><br />\nCustomize specific text elements by replacing them with preferred alternatives. Here&#8217;s a list of elements you can customize:</p>\n<ul>\n<li><strong>Sale Badge Text:</strong> Change the text displayed on sale badges.</li>\n<li><strong>Out Of Stock Badge Text:</strong> Change the text displayed on out of stock badges.</li>\n<li><strong>Wishlist Popup Text:</strong> Customize the text displayed in the wishlist popup.</li>\n<li><strong>Compare Popup Text:</strong> Customize the text displayed in the compare popup.</li>\n<li><strong>Quick View Popup Text:</strong> Customize the text displayed in the quick view popup.</li>\n<li><strong>Disable Lazy Load:</strong> Toggle lazy loading for product images.</li>\n</ul>\n</li>\n<li><strong>Custom CSS:</strong> Add your custom CSS for additional styling options.</li>\n</ul>\n<h3>GS WooCommerce Product Slider&#8217;s shortcode usage</h3>\n<p>Select a <strong><em>theme, view type &amp; other parameters</em></strong>. Shortcode will generate with id like [gswoo id=1]</p>\n<pre><code>[gswoo id=1]\n</code></pre>\n<p><strong>Shortcode PHP Usage</strong></p>\n<pre><code>&lt;?php echo do_shortcode( '[gswoo id=3]' ); ?&gt;\n</code></pre>\n<h3>Documentation</h3>\n<p>If you have any questions regarding the <strong>Product Views for WooCommerce</strong> ( known as <strong><em>GS WooCommerce Product Slider</em></strong> ) plugin and how to work with it, We recommend referring to our comprehensive online documentation. It provides detailed information and instructions to assist you in navigating and utilizing the plugin effectively. You can find the <a href=\"https://docs.gsplugins.com/woocommerce-product-slider\" rel=\"nofollow ugc\">Documentation</a> here.</p>\n<h3>Quick Support &amp; Bug Reporting</h3>\n<p>If you encounter any problems or discover bugs, please post them in our <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a> channel. We aim to respond as soon as possible (excluding holidays).</p>\n<p><strong><em>Pro users are requested to contact our support channel for dedicated assistance.</em></strong></p>\n<p>🙋‍♂️ Alternatively, you can reach out to us through our <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a> or <a href=\"https://wordpress.org/support/plugin/gs-woocommerce-products-slider\" rel=\"ugc\">WordPress.org</a> support forum.</p>\n<h3>Development Team</h3>\n<p>Crafted and Developed with Passion by <a href=\"https://www.gsplugins.com\" rel=\"nofollow ugc\">GS Plugins</a></p>\n<h3>Confused?</h3>\n<p>🎬 <a href=\"https://wooprod.gsplugins.com\" rel=\"nofollow ugc\">View live Demos &raquo;</a><br />\n📚 <a href=\"https://docs.gsplugins.com/woocommerce-product-slider\" rel=\"nofollow ugc\">Documentation &raquo;</a></p>\n<h3>🔥 You may like other plugins from <a href=\"https://www.gsplugins.com\" rel=\"nofollow ugc\">GS Plugins</a></h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-testimonial\" rel=\"ugc\">Testimonial Slider</a></strong> &#8211; Testimonials slider displays rotating customer endorsements and recommendations, helping to build trust and credibility for a business or product.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-logo-slider\" rel=\"ugc\">Logo Slider</a></strong> &#8211; Logo slider displays rotating logos of partners, clients, or sponsors, showcasing a business&#8217;s relationships and endorsements.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-portfolio/\" rel=\"ugc\">Portfolio</a></strong> &#8211; Filterable Portfolio plugin for WordPress allows you to easily display and showcase your projects, highlighting your skills and abilities.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-team-members\" rel=\"ugc\">Team Members</a></strong> &#8211; Build a Stunning Team Page or Section and Show off Your Team&#8217;s Talents!</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-projects\" rel=\"ugc\">Projects</a></strong> &#8211; Projects showcase displays detailed information including client reviews, ratings, galleries, and videos for a business&#8217;s work.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-books-showcase\" rel=\"ugc\">Books Showcase</a></strong> &#8211; Books showcase displays detailed information including author, published date, reviews, ratings, and gallery, allowing users to easily find and explore books.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-coach\" rel=\"ugc\">Coaches</a></strong> &#8211; Coaches plugin displays coaches&#8217; experience, skills, reviews, ratings, and certifications, helping users find the right coach for their needs.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/posts-grid\" rel=\"ugc\">Posts Grid</a></strong> &#8211;  WordPress Posts Grid plugin displays the latest posts in an elegant grid format, allowing for easy navigation and quick access to new content on a website.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/posts-widget\" rel=\"ugc\">Posts Widget</a></strong> &#8211;  WordPress Posts Widget plugin displays the latest posts in an elegant format on the sidebar or any widget area, allowing for easy navigation and quick access to new content on a website.</p>\n<h3>🎯 WooCommerce Plugins</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woo-variation-swatches\" rel=\"ugc\">WooCommerce Variation Swatches</a></strong> &#8211; WooCommerce Variation Swatches plugin replaces the default dropdown fields for variable products with visually appealing swatches, making it easier for customers to select product options and improve the overall shopping experience.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woo-brands\" rel=\"ugc\">WooCommerce Brands</a></strong> &#8211; WooCommerce Brands taxonomy plugin allows for easy cataloging of products by adding a brand taxonomy, making it simple to organize and filter products on an online store.</p>\n<h3>📣 Social Plugins</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-dribbble-portfolio\" rel=\"ugc\">Dribbble Portfolio</a></strong> &#8211; Dribbble Portfolio WP plugin enables you to display your Dribbble shots on your website in a portfolio layout, allowing you to showcase your design work to a wider audience.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-behance-portfolio\" rel=\"ugc\">Behance Portfolio</a></strong> &#8211; Behance Portfolio WordPress plugin allows you to display your Behance projects on your website in a visually appealing layout, making it easy for your audience to view and appreciate your work.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-pinterest-portfolio\" rel=\"ugc\">Pinterest Portfolio</a></strong> &#8211; Pinterest plugin for WordPress allows you to display your Pinterest pins on your website, giving your audience a chance to view and interact with your boards, and potentially drive more traffic to your Pinterest profile.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-instagram-portfolio/\" rel=\"ugc\">Instagram Portfolio</a></strong> &#8211; Instagram plugin for WordPress allows you to display your Instagram posts on your website, making it easy for visitors to view and interact with your content and also to increase engagement on your website.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-envato-portfolio\" rel=\"ugc\">Portfolio &#8211; Envato</a></strong> &#8211; Envato Portfolio Plugin allows you to display your Themeforest and Codecanyon items on your website, showcasing your digital products and making them easily accessible for potential customers.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-youtube-gallery\" rel=\"ugc\">Youtube Gallery</a></strong> &#8211; YouTube Gallery plugin allows you to display videos from a YouTube channel or playlist on your website, creating a visually appealing gallery and making it easy for visitors to access and watch your videos.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/feeds-of-twitter\" rel=\"ugc\">Twitter Feeds</a></strong> &#8211; Twitter Feeds plugin displays Twitter feeds, hashtags, user cards, and collections on a website, making it easy for visitors to view and interact with your Twitter content.</p>\n<h3>🏆 Branding Plugin</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-custom-login\" rel=\"ugc\">Custom Login</a></strong> &#8211; GS Custom Login allows you to customize the WordPress login screen, providing an easy way to create a unique and visually appealing login experience for your website users.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/powerup\" rel=\"ugc\">PowerUp</a></strong> &#8211; Enhance Your WordPress Experience with the Ultimate Security &amp; Convenience Solution &#8211; Hide Admin Bar, Login &amp; Logout Redirection, Disable Comments &amp; Restrict WP-Admin Module.</p>\n",
        "installation": "<p>Install the Plugin with Ease: Step-by-Step Guide:</p>\n<ul>\n<li>Get visual assistance and a detailed usage guide by clicking on the <strong><a href=\"https://docs.gsplugins.com/woocommerce-product-slider\" rel=\"nofollow ugc\">Visual Installation &amp; Usage Guide &raquo;</a></strong></li>\n</ul>\n<h3>Install using the Search Plugin option:</h3>\n<ul>\n<li>Go to the WordPress Admin panel</li>\n<li>Navigate to Plugins &gt; Add New</li>\n<li>Search for <strong>Woocommerce Product Slider</strong></li>\n<li>Click to <em>Install Now</em></li>\n<li>Activate the plugin</li>\n<li>The <strong><em>Woo Product Views</em></strong> menu will appear under the Posts section.</li>\n</ul>\n<h3>Install using the Upload Plugin option:</h3>\n<ul>\n<li>Download the latest version (.zip file)</li>\n<li>In your Admin, go to the menu Plugins &gt; Add New</li>\n<li>Select <strong>Upload Plugin</strong></li>\n<li>Click on <strong>Choose File</strong></li>\n<li>Select downloaded <strong><em>gs-woocommerce-products-slider.zip</em></strong> &amp; click on <strong>Install Now</strong> button</li>\n<li>Activate the plugin</li>\n<li>The <strong><em>Woo Product Views</em></strong> menu will appear under the Posts section.</li>\n</ul>\n<h3>Install Plugin using FTP:</h3>\n<ul>\n<li>Upload <strong>gs-woocommerce-products-slider</strong> folder inside the <strong>/wp-content/plugins/</strong> directory</li>\n<li>Go to WordPress dashboard &gt; Plugins &amp; Activate the plugin</li>\n<li>The <strong><em>Woo Product Views</em></strong> menu will appear under the Posts section.</li>\n</ul>\n<h3>Display on the website:</h3>\n<ul>\n<li>Use the genrated shortcode like <code>[gswoo id=4]</code> or select a different theme</li>\n<li>Place the shortcode where you want to display products.</li>\n</ul>\n",
        "faq": "\n<dt id='how%20can%20i%20display%20products%20using%20the%20woocommerce%20product%20slider%20plugin%3F'>\nHow can I display products using the WooCommerce Product Slider plugin?\n</h4>\n<p>\n<p>After installing the plugin, a few pre-made shortcodes will be added. You can use them directly or edit them according to your needs. After generating a shortcode like <code>[gswoo id=1]</code>, simply paste it to display your products.</p>\n</p>\n<dt id='how%20can%20i%20generate%20shortcodes%20for%20the%20woocommerce%20product%20slider%20plugin%3F'>\nHow can I generate shortcodes for the WooCommerce Product Slider plugin?\n</h4>\n<p>\n<ul>\n<li>Go to <strong>Product Views &gt; Shortcodes</strong>.</li>\n<li>Click on <strong>Create New Shortcode</strong>.</li>\n<li>Set your preferred settings for <em>General</em>, <em>Style</em>, and <em>Query</em> Settings.</li>\n<li>Give the shortcode a name.</li>\n<li>Save the shortcode.</li>\n<li>Copy the generated shortcode.</li>\n<li>Paste it wherever you want to display the products.</li>\n</ul>\n</p>\n<dt id='how%20can%20i%20use%20shortcodes%20inside%20page%20templates%3F'>\nHow can I use shortcodes inside page templates?\n</h4>\n<p>\n<p>WordPress provides a handy function, <code>do_shortcode()</code>, which allows you to use shortcodes within your theme files. For example, to output a WooCommerce Product Slider in a theme file, you would use the following code:</p>\n<pre><code>&lt;?php echo do_shortcode('[gswoo id=1]'); ?&gt;\n</code></pre>\n</p>\n<dt id='when%20can%20i%20use%20this%20plugin%3F'>\nWhen can I use this plugin?\n</h4>\n<p>\n<p>You can use this plugin only when you have installed the WooCommerce plugin.</p>\n</p>\n<dt id='is%20the%20plugin%20compatible%20with%20all%20wordpress%20themes%3F'>\nIs the plugin compatible with all WordPress themes?\n</h4>\n<p>\n<p><strong>Woo Product Views</strong> known as <em>GS WooCommerce Products Slider</em> works with any theme that adheres to WordPress standards and WooCommerce guidelines.</p>\n</p>\n<dt id='what%20design%20options%20are%20available%20for%20the%20gs%20woocommerce%20product%20slider%20plugin%3F'>\nWhat design options are available for the GS WooCommerce Product Slider plugin?\n</h4>\n<p>\n<p>There are over 40+ design options available. Choose from <em>Carousel, Grid, Masonry, List, or Ticker</em> layouts for your product display.</p>\n</p>\n<dt id='i%20have%20several%20categories%20but%20wish%20to%20display%20products%20from%20selected%20categories%2C%20is%20that%20possible%3F'>\nI have several categories but wish to display products from selected categories, is that possible?\n</h4>\n<p>\n<p>Yes, you can display products in a slider from selected categories.</p>\n<ul>\n<li>Go to <strong>Product Views &gt; Shortcodes</strong>.</li>\n<li>Create or edit a shortcode.</li>\n<li>Navigate to the 3rd tab labeled <em>Query</em>.</li>\n<li>Under <em>Include by Category</em>, select the category/categories you want to include.</li>\n<li>You can select single or multiple categories from the dropdown.</li>\n<li>Additionally, you can exclude single or multiple categories under <em>Exclude Categories</em>.</li>\n</ul>\n</p>\n<dt id='is%20it%20possible%20to%20exclude%20categories%20from%20the%20shortcode%3F'>\nIs it possible to exclude categories from the shortcode?\n</h4>\n<p>\n<p>Yes, you can exclude categories from the shortcode.</p>\n<ul>\n<li>Go to <strong>Product Views &gt; Shortcodes</strong>.</li>\n<li>Create or edit a shortcode.</li>\n<li>Navigate to the 3rd tab labeled <em>Query</em>.</li>\n<li>Under the <em>Exclude</em> tab, select <em>Exclude by Category</em>.</li>\n<li>Choose the category/categories you want to exclude.</li>\n<li>You can exclude single or multiple categories.</li>\n</ul>\n</p>\n<dt id='can%20i%20display%20products%20by%20name%2C%20tag%2C%20or%20product%20type%3F'>\nCan I display products by Name, Tag, or Product Type?\n</h4>\n<p>\n<p>Yes, with the premium version, you can display products by Name, Tag, or Product Type.</p>\n<ul>\n<li>Go to <strong>Product Views &gt; Shortcodes</strong>.</li>\n<li>Create or edit a shortcode.</li>\n<li>Navigate to the 3rd tab labeled <em>Query</em>.</li>\n<li>You will find <em>Include</em> and <em>Exclude</em> tabs.</li>\n<li>Under these tabs, you can include or exclude by <em>category</em>, <em>tag</em>, or <em>Product Type</em>.</li>\n<li>3 different product types are available to include or exclude: <em>Featured, In Stock, Free</em>.</li>\n</ul>\n</p>\n\n",
        "changelog": "<h4>Version 3.0.0 [17th Apr 2024]</h4>\n<ul>\n<li>[Updated]: Rewritten the plugin.</li>\n</ul>\n<h4>Version 1.6.1 [31st Jan 2023]</h4>\n<ul>\n<li>[Removed]: All Admin Notices From the Woocommerce Products Slider Pages.</li>\n</ul>\n<h4>Version 1.6.0 [30th Jan 2023]</h4>\n<ul>\n<li>[Updated]: Free, Pro Plugins Pages &amp; Help Page.</li>\n<li>[Fixed]: Page Redirection on the Plugin Activation.</li>\n</ul>\n<h4>Version 1.5.9 [29th Jan 2023]</h4>\n<ul>\n<li>[Fixed]: Sanitize Issue.</li>\n</ul>\n<h4>version 1.5.8 [24th May 2021]</h4>\n<ul>\n<li>[Fixed]: PHP 7.3 Compatibility.</li>\n<li>[Fixed]: Deprecated Function Warning.</li>\n</ul>\n<h4>version 1.5.7 [17th Dec 2020]</h4>\n<ul>\n<li>[Updated]: AppSero Client.</li>\n<li>[Removed]: Affiliate Admin Notice.</li>\n<li>[Updated]: WordPress 5.6</li>\n</ul>\n<h4>version 1.5.6 [13th Sep 2020]</h4>\n<ul>\n<li>[Added]: Admin Notice.</li>\n</ul>\n<h4>version 1.5.5 [15th Aug 2020]</h4>\n<ul>\n<li>[Updated]: For WordPress 5.5</li>\n</ul>\n<h4>version 1.5.4 [24th Jun 2020]</h4>\n<ul>\n<li>[Updated]: Appsero Client.</li>\n</ul>\n<h4>Version 1.5.3 [31st May 20]</h4>\n<ul>\n<li>[Added]: Shortcode Generator.</li>\n</ul>\n<h4>Version 1.5.2 [20th Nov 19]</h4>\n<ul>\n<li>[Fixed]: Domain name with www &amp; fixed all urls.</li>\n<li>[Fixed]: wordPress latest version support.</li>\n</ul>\n<h4>Version 1.5.1 [22nd Oct 19]</h4>\n<ul>\n<li>[Fixed]: Domain name changed &amp; fixed all urls.</li>\n<li>[Fixed]: Admin CSS.</li>\n<li>[Added]: New Contributors.</li>\n</ul>\n<h4>version 1.5</h4>\n<ul>\n<li>Added Review system</li>\n<li>Activation redirects added</li>\n<li>Coupon Code added</li>\n</ul>\n<h4>version 1.4</h4>\n<ul>\n<li>Fixed &#8211; Menu Position</li>\n</ul>\n<h4>version 1.3</h4>\n<ul>\n<li>Fixed &#8211; Hidden product issue. If Product is set to Hidden in WooCommerce under product visibility then hidden product will exclude from Slider.</li>\n<li>Fixed admin CSS</li>\n</ul>\n<h4>version 1.2</h4>\n<ul>\n<li>Added Video &amp; other docs</li>\n</ul>\n<h4>version 1.1</h4>\n<ul>\n<li>Initial release</li>\n</ul>\n"
    },
    "short_description": "Transform Product Displays for Better Sales! Enhance your WooCommerce store with a stunning product slider!",
    "description": "<p>Enhance Your Product Displays for Better Sales! Utilize Carousel, Grid, Ticker, List, and Masonry layouts to maximize conversions. Display products anywhere using shortcodes like [gswoo id=#].</p>\n<p>Whether you&#8217;re selling digital or physical products via WooCommerce, presentation is crucial. <strong><em>GS WooCommerce Product Slider</em></strong> enhances your online store&#8217;s appearance, allowing you to engage customers effectively.</p>\n<p>With this plugin, create dynamic &#8220;Digital Signage&#8221; for new product introductions, brand awareness, increased exposure, and sales. No coding knowledge required. It&#8217;s the <em>Best WooCommerce Product Slider</em> plugin, offering simplicity, flexibility, and power.</p>\n<p>Boost your online business with the Best WooCommerce Product Slider Plugin!</p>\n<p>🎬 <a href=\"https://wooprod.gsplugins.com\" rel=\"nofollow ugc\">Live Demo</a> ⬆️ <a href=\"https://www.gsplugins.com/product/gs-woocommerce-product-slider\" rel=\"nofollow ugc\">Upgrade to PRO</a> 📚 <a href=\"https://docs.gsplugins.com/woocommerce-product-slider\" rel=\"nofollow ugc\">Documentation</a> 🙋‍♂️ <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a></p>\n<h3>Why WooCommerce Product Slider plugin is crucial for your business?</h3>\n<p>In today&#8217;s competitive online market, captivating product displays are essential for attracting customers and boosting sales. The WooCommerce Product Slider plugin plays a crucial role in enhancing your business by offering dynamic and visually appealing product showcases. With various layout options like Carousel, Grid, Ticker, List, and Masonry, this plugin allows you to create engaging displays that capture attention and encourage conversions.</p>\n<p>By showcasing your products in an attractive and organized manner, the WooCommerce Product Slider plugin helps you stand out from the competition and provides a better shopping experience for your customers. With the ability to display products anywhere on your site using shortcodes, this plugin ensures that your products are always front and center, increasing visibility and sales opportunities.</p>\n<h3>What makes GS WooCommerce Product Slider plugin stand out?</h3>\n<p>The <em>GS WooCommerce Product Slider</em> plugin stands out for several reasons, making it a must-have tool for any WooCommerce store owner.</p>\n<ul>\n<li><strong>Versatility:</strong> With multiple layout options including Carousel, Grid, Ticker, List, and Masonry, this plugin offers versatility to suit various product display needs.</li>\n<li><strong>Ease of Use:</strong> The plugin is user-friendly, allowing you to create stunning product displays without any coding knowledge.</li>\n<li><strong>Customization:</strong> It offers extensive customization options, including control over colors, styles, and display settings.</li>\n<li><strong>Compatibility:</strong> GS WooCommerce Product Slider plugin seamlessly integrates with popular page builders and is compatible with any standard WordPress theme.</li>\n<li><strong>Performance:</strong> It ensures optimized performance with swift loading times, enhancing user experience.</li>\n<li><strong>Responsive Design:</strong> The plugin is fully responsive, ensuring that your product displays look great on all devices.</li>\n<li><strong>Support and Updates:</strong> With priority email support and continuous updates, you can rely on GS WooCommerce Product Slider plugin for ongoing assistance and improvements.</li>\n</ul>\n<h3>Comprehensive Plugin Features</h3>\n<p>Unlock the Full Potential of <em>WooCommerce Product Slider</em> with an Impressive Set of Features:</p>\n<ul>\n<li><strong>40+ Designs:</strong> Choose from Carousel, Grid, Masonry, List, or Ticker layouts for your product display.</li>\n<li><strong>Theme Flexibility:</strong> Easily switch between Grid, Slider, Masonry, List, or Ticker themes.</li>\n<li><strong>Advanced Templating:</strong> Utilize Archive Templates and Shortcode Generator with Preview for enhanced customization.</li>\n<li><strong>Page Builder Compatibility:</strong> Seamlessly integrate with popular page builders for effortless design.</li>\n<li><strong>Category-wise Products:</strong> Include or exclude products based on categories.</li>\n<li><strong>Tag-wise Products:</strong> Include or exclude products based on tags.</li>\n<li><strong>Type-wise Products:</strong> Include or exclude products by type &#8211; Featured, In Stock, Free.</li>\n<li><strong>Specific Products:</strong> Include or exclude specific products by name.</li>\n<li><strong>Display Control:</strong> Show or hide various product elements like Title, Description, Ratings, Countdown, Price, Add to Cart, Wishlist, Compare, Quick View, Hot Badge, Out Of Stock Badge, Sale Badge, etc.</li>\n<li><strong>Description Length:</strong> Control the character length of product descriptions.</li>\n<li><strong>Product QuickView, Wishlist, and Compare Options:</strong> Enhance user experience with quick actions.</li>\n<li><strong>WooCommerce Quick View, Wishlist, Compare Plugin Supported:</strong> Seamless integration with essential plugins.</li>\n<li><strong>Optimized Performance:</strong> Enjoy swift loading times for improved user experience.</li>\n<li><strong>Conditional Script Loading:</strong> Load scripts only where necessary, optimizing site performance.</li>\n<li><strong>Localization Input Fields:</strong> Easily replace preferred texts for localization.</li>\n<li><strong>Responsive Design:</strong> Ensure compatibility across various devices with responsive design.</li>\n<li><strong>Theme Compatibility:</strong> Works seamlessly with any standard WordPress theme.</li>\n<li><strong>Developer-Friendly:</strong> Easily customizable for developers according to specific needs.</li>\n<li><strong>Browser Compatibility:</strong> Supported across all modern browsers.</li>\n<li><strong>SEO Boost:</strong> Enhance SEO with schema.org markup for better visibility.</li>\n<li><strong>W3C Valid Markup:</strong> Adheres to W3C standards for valid markup.</li>\n<li><strong>Flexible Output:</strong> Display products anywhere using generated shortcodes.</li>\n<li><strong>User-Friendly Setup:</strong> Easy to set up with a user-friendly interface.</li>\n<li><strong>RTL Support:</strong> Compatible with languages that read from right to left.</li>\n<li><strong>Translation Ready:</strong> Translatable with included POT files for multilingual sites.</li>\n<li><strong>Priority Email Support:</strong> Access dedicated support for any assistance needed.</li>\n<li><strong>Free Installation:</strong> Receive free installation assistance if required.</li>\n<li><strong>Robust Documentation:</strong> Well-documented with comprehensive support for queries.</li>\n<li><strong>Continuous Updates:</strong> Stay updated with new features and improvements.</li>\n<li><strong>Live Demos</strong>: 🎬 <a href=\"https://wooprod.gsplugins.com\" rel=\"nofollow ugc\">View live Demos &raquo;</a></li>\n<li><strong>Upgrade to PRO</strong>: ⬆️ <a href=\"https://www.gsplugins.com/product/gs-woocommerce-product-slider\" rel=\"nofollow ugc\">Upgrade to PRO &raquo;</a></li>\n</ul>\n<h3>General Settings (WooCommerce Product Slider)</h3>\n<p>Start by navigating to <strong>Product Views &gt; Shortcode</strong>. Here, you can either create a new shortcode or edit an existing one. Once inside, you’ll land on the <strong>General</strong> Settings page.</p>\n<ul>\n<li><strong><em>General Settings Fields:</em></strong>\n<ul>\n<li><strong>Shortcode Name:</strong> Give your shortcode a unique name.</li>\n<li><strong>View Type:</strong> Choose from Carousel, Grid, Masonry, List, or Ticker layouts.</li>\n<li><strong>Image Type:</strong> Select between Solid or Transparent.</li>\n<li><strong>Columns Control:</strong> Adjust the number of columns for Desktop, Tablet, Mobile &amp; Small Mobile (1 to 6 columns).</li>\n<li><strong>Columns Gap:</strong> Increase or decrease the gap between each item. Default is 30.</li>\n<li><strong>Display Title:</strong> Show or Hide Product Title.</li>\n<li><strong>Display Ratings:</strong> Show or Hide Product Ratings.</li>\n<li><strong>Display Count Down:</strong> Show or Hide Product Count Down Timer. Make sure <em>WPC Countdown Timer</em> plugin is active.</li>\n<li><strong>Display Price:</strong> Show or Hide Product Price.</li>\n<li><strong>Display Description:</strong> Show or Hide Product Description.</li>\n<li><strong>Description Length:</strong> Control the Description Character Length. Set to 0 for displaying all characters.</li>\n<li><strong>Display Add to Cart:</strong> Show or Hide Product Add to Cart button.</li>\n<li><strong>Display Wishlist:</strong> Show or Hide the Wishlist button. Make sure <em>YITH WooCommerce Wishlist</em> plugin is activated.</li>\n<li><strong>Display Compare:</strong> Show or Hide the Compare button. Make sure <em>YITH WooCommerce Compare</em> plugin is activated.</li>\n<li><strong>Display Quick View:</strong> Show or Hide the Quick View button. Make sure <em>YITH WooCommerce Quick View</em> plugin is activated.</li>\n<li><strong>Display Hot Badge:</strong> Show or Hide the Hot badge.</li>\n<li><strong>Display Out Of Stock Badge:</strong> Show or Hide the Out Of Stock badge.</li>\n<li><strong>Display Sale Badge:</strong> Show or Hide the Sale badge.</li>\n<li><strong>Sale Badge Type:</strong> Choose between Text or Numeric.</li>\n</ul>\n</li>\n<li><strong><em>Carousel Settings (When View Type is Carousel):</em></strong>\n<ul>\n<li><strong>Move Items:</strong> Set the number of items to move (1 to 6).</li>\n<li><strong>Slides Speed:</strong> Duration of transition between slides (in milliseconds).</li>\n<li><strong>Infinite Loop:</strong> Enable/Disable looping through slides.</li>\n<li><strong>Reverse Direction:</strong> Reverse the direction of carousel navigation.</li>\n<li><strong>Autoplay:</strong> Enable/Disable automatic slide change.\n<ul>\n<li><strong>Delay:</strong> Set the autoplay delay in milliseconds. Default is 2000 ms.</li>\n<li><strong>Stop On Hover:</strong> Pause autoplay on hover. Default is Off.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h3>Style Settings</h3>\n<p>Easily Customize Your Products Display:</p>\n<p>To get started, navigate to <strong>Product Views &gt; Shortcode</strong>. Create a new shortcode or edit an existing one. Then, proceed to the <strong><em>2nd tab</em></strong> labeled <strong><em>Style</em></strong>.</p>\n<ul>\n<li><strong>Rating Color:</strong> Personalize the color of the rating.</li>\n<li><strong>Price Color:</strong> Define the color of the price.</li>\n<li><strong>Old Price Color:</strong> Set the color of the old price.</li>\n<li><strong>Title Color:</strong> Customize the color of the title.</li>\n<li><strong>Title Hover Color:</strong> Personalize the color of the title on hover.</li>\n<li><strong>Description Color:</strong> Define the color of the description.</li>\n<li><strong>Description Hover Color:</strong> Set the color of the description on hover.</li>\n<li><strong>Badges Color:</strong> Customize the color of badges.</li>\n<li><strong>Badges BG Color:</strong> Personalize the background color of badges.</li>\n<li><strong>Discount Badge BG Color:</strong> Define the background color of discount badges.</li>\n<li><strong>Out of Stock Badge BG Color:</strong> Set the background color of out of stock badges.</li>\n<li><strong>Button Text:</strong> Customize the text of the buttons.</li>\n<li><strong>Button Text Hover:</strong> Personalize the text of the buttons on hover.</li>\n<li><strong>Button Background:</strong> Define the background of the buttons.</li>\n<li><strong>Button Background Hover:</strong> Set the background of the buttons on hover.</li>\n<li><strong><em>For Carousel View Type:</em></strong>\n<ul>\n<li><strong>Enable Carousel Navs:</strong> Toggle carousel navigation.</li>\n<li><strong>Enable Carousel Dots:</strong> Toggle carousel dots.</li>\n<li><strong>Enable Dynamic Dots:</strong> Toggle dynamic carousel dots.</li>\n<li><strong>Navs Style:</strong> Choose from 11 different navigation styles.</li>\n<li><strong>Navs Position:</strong> Choose the position of carousel navigation.\n<ul>\n<li>Bottom</li>\n<li>Center</li>\n<li>Center Outside</li>\n<li>Center Inside</li>\n<li>Top Right</li>\n<li>Top Left</li>\n</ul>\n</li>\n<li><strong>Dots Style:</strong> Choose from 4 different dot styles.</li>\n</ul>\n</li>\n</ul>\n<h3>Query Settings</h3>\n<p>Begin by navigating to <strong>Product Views &gt; Shortcode</strong>. Create a new shortcode or edit an existing one. Then proceed to the <strong><em>3rd tab</em></strong> labeled <strong>Query</strong>.</p>\n<ul>\n<li><strong>Display Limit:</strong> Set the total number of products to display. Use <strong>-1</strong> to show all products.</li>\n<li><strong><em>Order By:</em></strong>\n<ul>\n<li><strong>Product ID:</strong> Sort products by their ID.</li>\n<li><strong>Product Name:</strong> Arrange products alphabetically by name.</li>\n<li><strong>Latest:</strong> Display the latest products.</li>\n<li><strong>Random:</strong> Display products in a random order.</li>\n<li><strong>Best Sellers / Popularity:</strong> Arrange products based on popularity.</li>\n<li><strong>Average Rating:</strong> Sort products by average rating.</li>\n<li><strong>Price:</strong> Arrange products by price.</li>\n</ul>\n</li>\n<li><strong><em>Order:</em></strong>\n<ul>\n<li><strong>DESC (Descending):</strong> Arrange products in descending order.</li>\n<li><strong>ASC (Ascending):</strong> Arrange products in ascending order.</li>\n</ul>\n</li>\n<li><strong>Include Category:</strong> Choose a specific category to showcase products from. Select from the available list of created categories.</li>\n<li><strong>Exclude Category:</strong> Hide products associated with a particular category.</li>\n<li><strong>Include By Tags:</strong> Include items by tag name.</li>\n<li><strong>Exclude By Tags:</strong> Exclude items by tag name.</li>\n<li><strong>Include By Type:</strong> Include product types &#8211; <strong><em>Featured, In Stock, Free</em></strong>.</li>\n<li><strong>Exclude By Type:</strong> Exclude product types &#8211; <strong><em>Featured, In Stock, Free</em></strong>.</li>\n<li><strong>Display Specific Products:</strong> Choose specific products to display.</li>\n<li><strong>Exclude Specific Products:</strong> Exclude specific products from being displayed.</li>\n</ul>\n<h3>Preference ( Global Settings )</h3>\n<p>Navigate to <strong>Product Views &gt; Shortcode</strong> and click on <strong>Preferences</strong>.</p>\n<ul>\n<li>\n<p><strong><em>Replace Preferred Text for:</em></strong><br />\nCustomize specific text elements by replacing them with preferred alternatives. Here&#8217;s a list of elements you can customize:</p>\n<ul>\n<li><strong>Sale Badge Text:</strong> Change the text displayed on sale badges.</li>\n<li><strong>Out Of Stock Badge Text:</strong> Change the text displayed on out of stock badges.</li>\n<li><strong>Wishlist Popup Text:</strong> Customize the text displayed in the wishlist popup.</li>\n<li><strong>Compare Popup Text:</strong> Customize the text displayed in the compare popup.</li>\n<li><strong>Quick View Popup Text:</strong> Customize the text displayed in the quick view popup.</li>\n<li><strong>Disable Lazy Load:</strong> Toggle lazy loading for product images.</li>\n</ul>\n</li>\n<li><strong>Custom CSS:</strong> Add your custom CSS for additional styling options.</li>\n</ul>\n<h3>GS WooCommerce Product Slider&#8217;s shortcode usage</h3>\n<p>Select a <strong><em>theme, view type &amp; other parameters</em></strong>. Shortcode will generate with id like [gswoo id=1]</p>\n<pre><code>[gswoo id=1]\n</code></pre>\n<p><strong>Shortcode PHP Usage</strong></p>\n<pre><code>&lt;?php echo do_shortcode( '[gswoo id=3]' ); ?&gt;\n</code></pre>\n<h3>Documentation</h3>\n<p>If you have any questions regarding the <strong>Product Views for WooCommerce</strong> ( known as <strong><em>GS WooCommerce Product Slider</em></strong> ) plugin and how to work with it, We recommend referring to our comprehensive online documentation. It provides detailed information and instructions to assist you in navigating and utilizing the plugin effectively. You can find the <a href=\"https://docs.gsplugins.com/woocommerce-product-slider\" rel=\"nofollow ugc\">Documentation</a> here.</p>\n<h3>Quick Support &amp; Bug Reporting</h3>\n<p>If you encounter any problems or discover bugs, please post them in our <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a> channel. We aim to respond as soon as possible (excluding holidays).</p>\n<p><strong><em>Pro users are requested to contact our support channel for dedicated assistance.</em></strong></p>\n<p>🙋‍♂️ Alternatively, you can reach out to us through our <a href=\"https://www.gsplugins.com/contact\" rel=\"nofollow ugc\">Support</a> or <a href=\"https://wordpress.org/support/plugin/gs-woocommerce-products-slider\" rel=\"ugc\">WordPress.org</a> support forum.</p>\n<h3>Development Team</h3>\n<p>Crafted and Developed with Passion by <a href=\"https://www.gsplugins.com\" rel=\"nofollow ugc\">GS Plugins</a></p>\n<h3>Confused?</h3>\n<p>🎬 <a href=\"https://wooprod.gsplugins.com\" rel=\"nofollow ugc\">View live Demos &raquo;</a><br />\n📚 <a href=\"https://docs.gsplugins.com/woocommerce-product-slider\" rel=\"nofollow ugc\">Documentation &raquo;</a></p>\n<h3>🔥 You may like other plugins from <a href=\"https://www.gsplugins.com\" rel=\"nofollow ugc\">GS Plugins</a></h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-testimonial\" rel=\"ugc\">Testimonial Slider</a></strong> &#8211; Testimonials slider displays rotating customer endorsements and recommendations, helping to build trust and credibility for a business or product.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-logo-slider\" rel=\"ugc\">Logo Slider</a></strong> &#8211; Logo slider displays rotating logos of partners, clients, or sponsors, showcasing a business&#8217;s relationships and endorsements.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-portfolio/\" rel=\"ugc\">Portfolio</a></strong> &#8211; Filterable Portfolio plugin for WordPress allows you to easily display and showcase your projects, highlighting your skills and abilities.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-team-members\" rel=\"ugc\">Team Members</a></strong> &#8211; Build a Stunning Team Page or Section and Show off Your Team&#8217;s Talents!</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-projects\" rel=\"ugc\">Projects</a></strong> &#8211; Projects showcase displays detailed information including client reviews, ratings, galleries, and videos for a business&#8217;s work.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-books-showcase\" rel=\"ugc\">Books Showcase</a></strong> &#8211; Books showcase displays detailed information including author, published date, reviews, ratings, and gallery, allowing users to easily find and explore books.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-coach\" rel=\"ugc\">Coaches</a></strong> &#8211; Coaches plugin displays coaches&#8217; experience, skills, reviews, ratings, and certifications, helping users find the right coach for their needs.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/posts-grid\" rel=\"ugc\">Posts Grid</a></strong> &#8211;  WordPress Posts Grid plugin displays the latest posts in an elegant grid format, allowing for easy navigation and quick access to new content on a website.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/posts-widget\" rel=\"ugc\">Posts Widget</a></strong> &#8211;  WordPress Posts Widget plugin displays the latest posts in an elegant format on the sidebar or any widget area, allowing for easy navigation and quick access to new content on a website.</p>\n<h3>🎯 WooCommerce Plugins</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woo-variation-swatches\" rel=\"ugc\">WooCommerce Variation Swatches</a></strong> &#8211; WooCommerce Variation Swatches plugin replaces the default dropdown fields for variable products with visually appealing swatches, making it easier for customers to select product options and improve the overall shopping experience.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-woo-brands\" rel=\"ugc\">WooCommerce Brands</a></strong> &#8211; WooCommerce Brands taxonomy plugin allows for easy cataloging of products by adding a brand taxonomy, making it simple to organize and filter products on an online store.</p>\n<h3>📣 Social Plugins</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-dribbble-portfolio\" rel=\"ugc\">Dribbble Portfolio</a></strong> &#8211; Dribbble Portfolio WP plugin enables you to display your Dribbble shots on your website in a portfolio layout, allowing you to showcase your design work to a wider audience.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-behance-portfolio\" rel=\"ugc\">Behance Portfolio</a></strong> &#8211; Behance Portfolio WordPress plugin allows you to display your Behance projects on your website in a visually appealing layout, making it easy for your audience to view and appreciate your work.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-pinterest-portfolio\" rel=\"ugc\">Pinterest Portfolio</a></strong> &#8211; Pinterest plugin for WordPress allows you to display your Pinterest pins on your website, giving your audience a chance to view and interact with your boards, and potentially drive more traffic to your Pinterest profile.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-instagram-portfolio/\" rel=\"ugc\">Instagram Portfolio</a></strong> &#8211; Instagram plugin for WordPress allows you to display your Instagram posts on your website, making it easy for visitors to view and interact with your content and also to increase engagement on your website.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-envato-portfolio\" rel=\"ugc\">Portfolio &#8211; Envato</a></strong> &#8211; Envato Portfolio Plugin allows you to display your Themeforest and Codecanyon items on your website, showcasing your digital products and making them easily accessible for potential customers.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-youtube-gallery\" rel=\"ugc\">Youtube Gallery</a></strong> &#8211; YouTube Gallery plugin allows you to display videos from a YouTube channel or playlist on your website, creating a visually appealing gallery and making it easy for visitors to access and watch your videos.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/feeds-of-twitter\" rel=\"ugc\">Twitter Feeds</a></strong> &#8211; Twitter Feeds plugin displays Twitter feeds, hashtags, user cards, and collections on a website, making it easy for visitors to view and interact with your Twitter content.</p>\n<h3>🏆 Branding Plugin</h3>\n<p><strong><a href=\"https://wordpress.org/plugins/gs-custom-login\" rel=\"ugc\">Custom Login</a></strong> &#8211; GS Custom Login allows you to customize the WordPress login screen, providing an easy way to create a unique and visually appealing login experience for your website users.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/powerup\" rel=\"ugc\">PowerUp</a></strong> &#8211; Enhance Your WordPress Experience with the Ultimate Security &amp; Convenience Solution &#8211; Hide Admin Bar, Login &amp; Logout Redirection, Disable Comments &amp; Restrict WP-Admin Module.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/gs-woocommerce-products-slider.3.0.0.zip",
    "upgrade_notice": {
        "Version 3.0.0 [17th Apr 2024]": "<ul>\n<li>[Updated]: Rewritten the plugin.</li>\n</ul>",
        "Version 1.6.1 [31st Jan 2023]": "<ul>\n<li>[Removed]: All Admin Notices From the Woocommerce Products Slider Pages.</li>\n</ul>",
        "Version 1.6.0 [30th Jan 2023]": "<ul>\n<li>[Updated]: Free, Pro Plugins Pages &amp; Help Page.</li>\n<li>[Fixed]: Page Redirection on the Plugin Activation.</li>\n</ul>",
        "Version 1.5.9 [29th Jan 2023]": "<ul>\n<li>[Fixed]: Sanitize Issue.</li>\n</ul>",
        "version 1.5.8 [24th May 2021]": "<ul>\n<li>[Fixed]: PHP 7.3 Compatibility.</li>\n<li>[Fixed]: Deprecated Function Warning.</li>\n</ul>",
        "version 1.5.7 [17th Dec 2020]": "<ul>\n<li>[Updated]: AppSero Client.</li>\n<li>[Removed]: Affiliate Admin Notice.</li>\n<li>[Updated]: WordPress 5.6</li>\n</ul>",
        "version 1.5.6 [13th Sep 2020]": "<ul>\n<li>[Added]: Admin Notice.</li>\n</ul>",
        "version 1.5.5 [15th Aug 2020]": "<ul>\n<li>[Updated]: For WordPress 5.5</li>\n</ul>",
        "version 1.5.4 [24th Jun 2020]": "<ul>\n<li>[Updated]: Appsero Client.</li>\n</ul>",
        "Version 1.5.3 [31st May 20]": "<ul>\n<li>[Added]: Shortcode Generator.</li>\n</ul>",
        "Version 1.5.2 [20th Nov 19]": "<ul>\n<li>[Fixed]: Domain name with www &amp; fixed all urls.</li>\n<li>[Fixed]: wordPress latest version support.</li>\n</ul>",
        "Version 1.5.1 [22nd Oct 19]": "<ul>\n<li>[Fixed]: Domain name changed &amp; fixed all urls.</li>\n<li>[Fixed]: Admin CSS.</li>\n<li>[Added]: New Contributors.</li>\n</ul>",
        "version 1.5": "<ul>\n<li>Added Review system</li>\n<li>Activation redirects added</li>\n<li>Coupon Code added</li>\n</ul>",
        "version 1.4": "<ul>\n<li>Fixed - Menu Position</li>\n</ul>",
        "version 1.3": "<ul>\n<li>Fixed - Hidden product issue. If Product is set to Hidden in WooCommerce under product visibility then hidden product will exclude from Slider.</li>\n<li>Fixed admin CSS</li>\n</ul>",
        "version 1.2": "<ul>\n<li>Added Video &amp; other docs</li>\n</ul>",
        "version 1.1": "<ul>\n<li>Initial release</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/gs-woocommerce-products-slider/assets/screenshot-1.gif?rev=3075832",
            "caption": "Product Slider with Popup."
        },
        {
            "src": "https://ps.w.org/gs-woocommerce-products-slider/assets/screenshot-2.gif?rev=3075854",
            "caption": "Product Slider with Countdown."
        },
        {
            "src": "https://ps.w.org/gs-woocommerce-products-slider/assets/screenshot-3.gif?rev=3075832",
            "caption": "Product Slider in Left to Right Direction."
        },
        {
            "src": "https://ps.w.org/gs-woocommerce-products-slider/assets/screenshot-4.png?rev=3075854",
            "caption": "Products in Grid View."
        },
        {
            "src": "https://ps.w.org/gs-woocommerce-products-slider/assets/screenshot-5.png?rev=3075857",
            "caption": "Products in List View."
        },
        {
            "src": "https://ps.w.org/gs-woocommerce-products-slider/assets/screenshot-6.png?rev=3075857",
            "caption": "Products in Masonry View."
        },
        {
            "src": "https://ps.w.org/gs-woocommerce-products-slider/assets/screenshot-7.png?rev=3078530",
            "caption": "All shortcodes for Woo Product Views ( WooCommerce Product Slider )"
        },
        {
            "src": "https://ps.w.org/gs-woocommerce-products-slider/assets/screenshot-8.png?rev=3078530",
            "caption": "Create a new shortcode with preview. General Settings for WooCommerce Product Slider."
        },
        {
            "src": "https://ps.w.org/gs-woocommerce-products-slider/assets/screenshot-9.png?rev=3078530",
            "caption": "Style Settings (2nd Tab) for WooCommerce Product Slider."
        },
        {
            "src": "https://ps.w.org/gs-woocommerce-products-slider/assets/screenshot-10.png?rev=3078530",
            "caption": "Query Settings (3rd Tab) for WooCommerce Product Slider."
        },
        {
            "src": "https://ps.w.org/gs-woocommerce-products-slider/assets/screenshot-11.png?rev=3078530",
            "caption": "Preference - Global Settings for Woo Product Views ( WooCommerce Product Slider )"
        },
        {
            "src": "https://ps.w.org/gs-woocommerce-products-slider/assets/screenshot-12.png?rev=3078530",
            "caption": "Config Layouts - Replace Product page layouts (Shop, Category, Tag &amp; Product Search pages) with shortcodes."
        }
    ],
    "tags": {
        "featured-product-slider": "featured product slider",
        "product-carousel-slider": "product carousel slider",
        "product-gallery-slider": "product gallery slider",
        "product-image-slider": "product image slider",
        "product-slider": "product slider"
    },
    "stable_tag": "3.0.0",
    "versions": {
        "1.5.5": "https://downloads.wordpress.org/plugin/gs-woocommerce-products-slider.1.5.5.zip",
        "1.5.6": "https://downloads.wordpress.org/plugin/gs-woocommerce-products-slider.1.5.6.zip",
        "1.5.7": "https://downloads.wordpress.org/plugin/gs-woocommerce-products-slider.1.5.7.zip",
        "1.5.8": "https://downloads.wordpress.org/plugin/gs-woocommerce-products-slider.1.5.8.zip",
        "1.5.9": "https://downloads.wordpress.org/plugin/gs-woocommerce-products-slider.1.5.9.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/gs-woocommerce-products-slider.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/gs-woocommerce-products-slider.1.6.1.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/gs-woocommerce-products-slider.3.0.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/gs-woocommerce-products-slider.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.paypal.com/donate/?hosted_button_id=K7K8YF4U3SCNQ",
    "banners": {
        "low": "https://ps.w.org/gs-woocommerce-products-slider/assets/banner-772x250.png?rev=3080553",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/gs-woocommerce-products-slider/assets/icon-128x128.png?rev=3074782"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 78,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}