{
    "name": "GutenGeek Free Gutenberg Blocks for WordPress",
    "slug": "gtg-advanced-blocks",
    "version": "1.1.3",
    "author": "<a href=\"https://gutengeek.com/\">GutenGeek</a>",
    "author_profile": "https://profiles.wordpress.org/wpopal/",
    "contributors": {
        "gutengeek": {
            "profile": "https://profiles.wordpress.org/gutengeek/",
            "avatar": "https://secure.gravatar.com/avatar/0a9117e686e203550cd3eaa4b15e4a37?s=96&d=monsterid&r=g",
            "display_name": "GutenGeek"
        }
    },
    "requires": "5.0",
    "tested": "5.5.15",
    "requires_php": "7.2",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 66,
    "ratings": {
        "5": 1,
        "4": 1,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 3,
    "support_url": "https://wordpress.org/support/plugin/gtg-advanced-blocks/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 70,
    "downloaded": 3132,
    "last_updated": "2020-12-12 15:56:00",
    "added": "2020-06-23",
    "homepage": "https://gutengeek.com/template-library/#/blocks",
    "sections": {
        "description": "<p><strong>Advanced Gutenberg Blocks</strong></p>\n<p>Gutengeek is an advanced &amp; high-quality of Gutenberg Blocks in WordPress 5.0. This Gutenberg WP comes with plenty of amazing block features that make a new WordPress block editor easier and helpful for WordPress users. This plugin is a real WordPress Page Builder that allows you to construct websites by blocks only. The premade style that helps to build a perfect website in no time. It’s time-saving and cost-saving when editing any blocks. Get wonderful experience on the website building with Gutengeek now.</p>\n<p><a href=\"https://gutengeek.com/?utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Check this WordPress Gutenberg Demo now</a></p>\n<p>Powered Gutenberg editor, Gutengeek Gutenberg Blocks plugin will be your smart choice with a large number of prebuilt blocks and pages in the UI Kit library. It&#8217;s a quick process to speed up website builder easier and more simply. Each block is ready-to-customize for settings and visual styling. Users can import and use instantly for their content with blocks.</p>\n<p>Interestingly, this addon for Gutenberg plugin (GTG) allows you to craft your WordPress content with blocks without requiring any line of code. You can import predesigned blocks, pages and landing page for page and post content. Any people can use this editor for pages. Beautiful design ( page &amp; post) &amp; easy-to-use interface will let you get wonderful website building experience.</p>\n<p><a href=\"https://gutengeek.com/?utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Gutengeek Block</a> || <a href=\"https://libs.gutengeek.com/#/blocks/?utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Live Demo</a> || <a href=\"https://docs.gutengeek.com/utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Documentation</a></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8vU2I3mxTNA?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Complete Website Building Sample with Gutenberg WP</h3>\n<p>In order to support your editor better with Gutenberg WP, insteads of using Gutenberg default, no need to worry about the limited blocks support, Gutengeek is here for your choice. With Gutengeek, you can get 38+ Gutenberg blocks and 29+ premade Pack UI Kit library for FREE and a large library for sections, pages that need only 1 click to import to build content quickly. No matter who you are, developer or store owner, agency, Gutengeek Gutenberg truly meets exactly what you are looking for. By using built-in sections, you can build entire pages without requiring any line of code.</p>\n<p><a href=\"https://gutengeek.com/?utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Discover Gutengeek Gutenberg Blocks Demos -&gt; </a></p>\n<p>With Gutengeek, you can get:</p>\n<ul>\n<li>Get Free 38+ professional blocks, sections and pages for WordPress</li>\n<li>29+ Premade <a href=\"https://gutengeek.com/template-library/#/?utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Pack UI Kit Gutenberg Layouts</a> for various fields such as landing page, business, flowers shop, bloggers&#8230;These can be imported quickly into your WordPress content. </li>\n<li>Fully responsiveness each block on the different screens such as mobile, desktop, macbook. </li>\n<li>Optimize for loading speed. Simple to use &amp; build ready-to-customize block by replacing image and text. </li>\n<li>Easy to import demos in WordPress theme that is compatible with Gutenberg. </li>\n<li>Well-optimized for performance &amp; interface for all pre-built blocks, sections &amp; pages. </li>\n<li>Integration with a lot of WordPress plugins to showcase better website functionalities. </li>\n<li>High optimization with fully responsiveness. </li>\n<li>Support Custom Font &amp; Custom Icon with Gutenberg </li>\n</ul>\n<p><a href=\"https://docs.gutengeek.com/?utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Discover more WP Gutenberg documentation</a></p>\n<p>In general, each block in Gutengeek plugin, you can get full setting for:</p>\n<ul>\n<li>Premade layouts: Each block comes with its own style for the block. Choose multiple layouts and set alignment. Moreover, Gutengeek comes with stunning premade layouts that you can click to import instantly for adding content. </li>\n<li>Flexible typography options available on Gutengeek. Plus, by using Gutengeek, you can upload a custom font icon and custom font for the section block. </li>\n<li>Color settings: The Gutenberg block brings with all built-in color palette or gradient options. </li>\n<li>Block style: Insert title, description, separator, media or advanced settings.</li>\n<li>Advanced settings: Background, overlay, border, animation, …<br />\nControls for block dimensions, spacing &amp; alignments, separator or divider. </li>\n<li>Perfect responsiveness block optimization on the different devices on desktop, tablet and mobile. </li>\n</ul>\n<h3>Ultimate Gutengeek Documentation for Gutenberg</h3>\n<p>If you have any questions that are related to Gutengeek blocks, for quick support, you can view details at Gutengeek tutorial to make your website easy and time-saving. Whenever you want to install, activate or disable Gutenberg plugin, you can do it instantly. The existing pages or sections which are crafted by Gutenberg ( Gutengeek) still remain.</p>\n<p>Moreover, Gutengeek also supports video, blog for WordPress blocks. If having time, you can view more informative and detailed articles of Gutengeek Gutenberg blocks for WordPress.</p>\n<h3>Gutengeek &#8211; Advanced Gutenberg Blocks for WordPress</h3>\n<p>If default Gutenberg blocks are not satisfied by you, it lacks functions, less blocks for your editor, Gutengeek comes here. So it doesn’t matter if you are not experienced in technical. Gutengeek is an addon of Gutenberg. By virtue of bringing the quickest Gutenberg editor, Gutengeek is developed with numerous features for blocks that are easy to import to post and pages. Easy for all, no need to require technical knowledge.</p>\n<p>Here are all outstanding block features of Gutengeek that makes GutenGeek become a must-have plugin for new WordPress editor 5.0.</p>\n<ul>\n<li>38+ High-customizable Gutenberg Blocks for WordPress Editor</li>\n<li>29+ premade Pack UI Kit library for FREE</li>\n<li>Modern &amp; Responsive Layout Packs for blocks, templates, pages &amp; sections.</li>\n<li>High Customizable Row Columns</li>\n<li>Flexible to Resize Column</li>\n<li>Shape Divider/Builder</li>\n<li>Advanced and diverse web design options</li>\n<li>Unlimited Google web fonts &amp; system fonts</li>\n<li>Built-in sections</li>\n<li>Classic &amp; gradient color and background</li>\n<li>Background: Color, Video, Image</li>\n<li>Numerous Built-in animation</li>\n<li>Typography Support</li>\n<li>Box-shadow</li>\n<li>Alignments</li>\n<li>Border</li>\n<li>Border Radius</li>\n<li>Transform</li>\n<li>Animation</li>\n<li>Custom CSS</li>\n<li>Unlimited Color</li>\n<li>Dimensions</li>\n<li>Media</li>\n<li>Transition</li>\n<li>Custom Fonts</li>\n<li>Custom Icons Support</li>\n<li>Multiple devices supports</li>\n</ul>\n<h3>Speed up Website Building Faster and Better Performance</h3>\n<p>In order to bring a complete solution for website building with Gutengeek, this plugin is created with the fastest and the best customers’ experience. It’s easy to use and flexible to edit, customize content, style as you want. All multiple available blocks are the most essential role in editing. For example: call-to-action block, pie progress block, … Furthermore, each block comes with its own style, layouts which are easy to import content.</p>\n<p>Currently, this advanced Gutenberg block &#8211; Gutengeek &#8211; is still in development. We are continuing to contribute more features for gutenberg usage. So many more Gutenberg blocks and Gutenberg block templates are coming soon.<br />\nDiscover more at: Gutengeek.com</p>\n<h3>Powerful Gutengeek Page Builder Gutenberg Blocks for WordPress</h3>\n<p>Here are all 38+ custom blocks to the Gutenberg block editor. Let’s explore all available advanced Gutenberg blocks.</p>\n<p><strong>Gutengeek Advanced Page Builder Gutenberg Blocks features at glance:</strong></p>\n<ul>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/sections\" rel=\"nofollow ugc\">Section Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/accordion\" rel=\"nofollow ugc\">Advanced Accordion Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/header\" rel=\"nofollow ugc\">Header Block</a></li>\n<li>Heading Block</li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/image-box\" rel=\"nofollow ugc\">Image Box</a></li>\n<li>Post Grid Block</li>\n<li>Post Masonry Block</li>\n<li>Post Carousel Block</li>\n<li>Post Timeline Block</li>\n<li>Button Block</li>\n<li>Multi Buttons Block</li>\n<li>Counter Block</li>\n<li>Divider Block</li>\n<li>InfoBox Block</li>\n<li>InfoBox Grid Block</li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/testimonial\" rel=\"nofollow ugc\">Testimonial Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/tabs\" rel=\"nofollow ugc\">Tabs Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/team\" rel=\"nofollow ugc\">Teams Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/social-icons\" rel=\"nofollow ugc\">Social Icons Block</a></li>\n<li>Social Share Block</li>\n<li>Google Map Block</li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/icon-list\" rel=\"nofollow ugc\">Icon List Block</a></li>\n<li>Icon Block</li>\n<li>Timeline Block</li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/call-to-action\" rel=\"nofollow ugc\">Call to action Block</a></li>\n<li>Row &amp; Column Block</li>\n<li>Contact Form 7 Block</li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/blockquote\" rel=\"nofollow ugc\">Quote Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/pricing\" rel=\"nofollow ugc\">Pricing Table Block &amp; Pricing Table Grid Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/progress-bar\" rel=\"nofollow ugc\">Progress Bar Block</a></li>\n<li><a href=\"https://libs.gutengeek.com/#/blocks/video\" rel=\"nofollow ugc\">Video Block</a></li>\n<li>Video Popup Block</li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/card\" rel=\"nofollow ugc\">Cards Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/number-box\" rel=\"nofollow ugc\">Number Box Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/countdown\" rel=\"nofollow ugc\">Countdown Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/contact\" rel=\"nofollow ugc\">Custom form builder</a></li>\n<li><a href=\"https://libs.gutengeek.com/#/blocks/pie-progress\" rel=\"nofollow ugc\">Pie progress Block</a></li>\n<li>Single Image</li>\n</ul>\n<h3>Detail of Gutengeek Page Builder Gutenberg Blocks Features</h3>\n<ul>\n<li>Section Block: The Gutenberg Section Block is a container block which is combined with multiple other gutenberg Blocks inside. It’s comes as a group of blocks in WordPress</li>\n<li>Accordion Block: This Accordion block helps to showcase collapsible texts in a dropdown interface. </li>\n<li>Header Block: Allows to add header section for background &amp; content.</li>\n<li>Advanced Heading Block: Great combination of heading and sub-heading. You can showcase headings and titles in a stunning way with typography, border &amp; advanced options. </li>\n<li>Image Box Block: The image box block allows it to be placed in a single block or multiple block. With the Image box block, you can add the title here to grab clients attention by helping them get information via info boxes. </li>\n<li>Post Grid Block: The post grid block allows you to showcase all available posts in the grid layout that visitors can follow your blog significantly. It’s easy to customize the order of posts or changing content and images. </li>\n<li>Post Masonry Block: The Post Masonry Block enables you to display all your blog posts in masonry layouts without blank space in design. You can customize image, content and the order of post in masonry layout. </li>\n<li>Post Carousel Block: The post carousel block supports to display all available posts in carousels layout that you can build content, title, category and much more.</li>\n<li>Button Block: This Gutenberg button block helps to add a single button block with the great combination of shape, link, layout, interface in button.</li>\n<li>Multi Buttons Block: The multiple buttons block allows to design multiple button blocks showcase together. The blocks can be showcased more than 2 blocks impressively and creatively to make your site more interesting.</li>\n<li>Counter Grid Box Block: The counter grid block lets you display the counter number to evaluate the quality or quantity of what you want to showcase. Easily add counter limit &amp; duration, prefix, design &amp; postfix, etc.</li>\n<li>Divider Block: The Divider Block allows you to add a line or shape to divide your content &amp; increase the distinguishable section.</li>\n<li>InfoBox Block: The Info Box block helps to display all information in the box block. The information will be heading, subheading, description, icon or image. </li>\n<li>InfoBox Grid Block: This info box block lets display multiple infoboxes which showcase the information with heading, subheading, description &amp; image or icon. Moreover, by using Gutengeek, you can import all premade layout info boxes in grid layout for content. Then your editor can be done quickly in minutes by replacing text and images. </li>\n<li>Testimonials Block: The testimonial block allows to display all customers&#8217; feedback or reviews with names, avatars, icons &amp; more.</li>\n<li>Tabs Block: The tabs block supports to display your content with different tabs. The premade tabs block brings attractive animations, icons &amp; more stunning features that makes content more exciting. </li>\n<li>Teams Block: This teams block lets you showcase your team members with details such as  image, name, position, links to social profiles.  </li>\n<li>Social Icons Block: This social icon block supports adding icons and insert links to social networks you loved. It’s flexible to change to other icons with stunning icons for content.</li>\n<li>Social Share Block: The Social share block allows to add social icon share. By clicking on the social icon, your page and post can be shared on the social network in order to increase traffic &amp; engagement for websites.</li>\n<li>Google Map Block: The Google map block helps to embed Google maps on posts and pages that include lots of options like customize map height, zoom map.</li>\n<li>Icon List Block: At the list format, this icon list block supports choosing a favorite icon that is suitable with each list of items. Also, it covers a large number of attractive icons for you to select.</li>\n<li>Icon Block: The Icon Block lets you add/upload a customizable icon or available icons in Gutenberg for post and page.</li>\n<li>Timeline Block: This Timeline Block for Gutenberg helps to showcase perfectly the detail of roadmap, company history, product release, and achievements.</li>\n<li>Post timeline Block: The Post timeline block helps to showcase the order of all stunning posts with time, date published. Also, you can customize icon, date, content for posts on the timeline block. </li>\n<li>Call to action Block: This Call-to-action block helps to add “Learn more”, “Download”, “View more” to let customers take their action on your website.</li>\n<li>Row &amp; Column Block: The Row &amp; Column block supports to add multiple row and columns. Moreover, you can customize row and column layouts with amazing functionality.</li>\n<li>Contact Form 7 Block: Thanks to integrating contact form 7 in Gutenberg block, this contact form 7 allows to add a form in Gutenberg. It’s easy to customize and design for form to let custom fulfill form to get more information. </li>\n<li>Quote Block: The quote block allows you to add quoted sentences or text in a hot trend from famous persons with a lot of customization. </li>\n<li>Pricing Table Block: This pricing table block supports to display the price of items in a single block. It’s suitable with services, membership, in a beautiful table style.</li>\n<li>Pricing Table Grid Block: This pricing table grid block allows to display multiple price in the grid layout. You can change and customize the number of pricing table, content of price table with icon, &#8230;</li>\n<li>Progress Bar Block: This Progress bar block allows to display statistics via progress bars with bar background, animation showcase. It’s easy to change layout, style and setting for bar with color, change title, background,&#8230; </li>\n<li>Video Block: This Gutenberg Video block allows to add/upload video or embed video from to video block content to engage more interaction in video.</li>\n<li>Video Popup Block: This video popup block allows you to add video popups with icons, wrapper, and overlay to make your site more exciting for each page loading.</li>\n<li>Cards Block: The Card block for Gutengeek helps to display more information and photos in the card block to showcase your portfolio, team photos, services, and more.</li>\n<li>Countdown Block: This countdown block supports to add a countdown timer with number, hours, any date, customizable and easy to use or embed on a website or blog as a widget. It’s used to show the coming soon event, sale campaign, or opening ceremony.</li>\n<li>Custom form builder Block: This custom form builder block allows to add the various form fields, check boxes, radio buttons, text area and text on the block without any line of code or HTML CSS.</li>\n<li>Vertical Tabs Block: This vertical tab block lets you organize your content smartly with vertical tabs.<br />\nPie Progress Block: Break complicated parts of progress and use easy-to-see pie progresses.</li>\n<li>Single Image Block: This Gutenberg single image block supports to add caption, subcaption, text on image, overlay on image.</li>\n</ul>\n<h3>Bug Fixes</h3>\n<ul>\n<li>Global Style Variables</li>\n</ul>\n<h4>1.1.1</h4>\n<h3>Bug Fixes</h3>\n<ul>\n<li>Remove console.log</li>\n<li>Add hooks to post loop(Post Grid, Post Carousel, Post Masonry)</li>\n<li>Fixed toggle post category on dashboard</li>\n</ul>\n<h4>1.1</h4>\n<h3>FEATURE ADD NEW</h3>\n<pre><code>- New block Advanced Media Card\n</code></pre>\n<h4>1.0.6</h4>\n<h3>FIXED</h3>\n<ul>\n<li>Testimonial Rating</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Features\n<ul>\n<li>Apply RichText format: Bold, Underline, Color, Background</li>\n<li>Add Offcanvas, Full Width template</li>\n<li>Add Image Carousel block</li>\n</ul>\n</li>\n<li>FIXED\n<ul>\n<li>Animation selection</li>\n<li>Pie Progress block add action</li>\n</ul>\n</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Features\n<ul>\n<li>Blocks:\n<ul>\n<li>Image Block</li>\n</ul>\n</li>\n<li>Controls: Add Tabs, Tab, URL inspector controls</li>\n</ul>\n</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Features\n<ul>\n<li>Blocks:\n<ul>\n<li>Progress: add new style circle</li>\n<li>Tested up to: 5.4.2: Template Library button</li>\n<li>Split and add vendor: gutengeek/components(https://packagist.org/packages/gutengeek/components)</li>\n<li>Post Grid: add columns to post list</li>\n</ul>\n</li>\n<li>Add block position</li>\n<li>Add block border, border radius</li>\n<li>Update Animation control and improve animation effect</li>\n</ul>\n</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Bug Fixes\n<ul>\n<li>Blocks:\n<ul>\n<li>Testimonial: content boxshadow hover</li>\n<li>Post Masonry: hotfix Category components</li>\n<li>Info Box: Media Image align center on layout 1 + layout 2</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n",
        "installation": "<p>Gutengeek Page Builder Gutenberg Block works with WordPress version 5.0 or higher.<br />\nYou can install Gutengeek &#8211; Advanced Addons for Gutenberg Block via WordPress plugin directory or upload files to your server at wp-content/plugin</p>\n<p>Refer to our <a href=\"https://docs.gutengeek.com/topics/getting-started/\" rel=\"nofollow ugc\">getting started article</a> to know more.</p>\n<p>For more information, please visit our <a href=\"https://docs.gutengeek.com/?utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme&quot;\" rel=\"nofollow ugc\">Knowledge Base</a></p>\n",
        "faq": "\n<dt id='can%20i%20use%20gutengeek%20advanced%20gutenberg%20blocks%20for%20wordpress%20editor%20while%20having%20another%20page%20builder%3F'>\nCan I use Gutengeek Advanced Gutenberg Blocks for WordPress Editor while having another Page Builder?\n</h4>\n<p>\n<p>Yeah, you can do it. The basic need of Gutengeek Page Builder Gutenberg Plugin is the latest version. We made this plugin compatible with almost all page builders flawlessly. If you need any of our support, please contact us here.</p>\n</p>\n<dt id='why%20should%20choose%20gutengeek%20gutenberg%20blocks%20page%20builder%3F'>\nWhy should choose Gutengeek Gutenberg Blocks Page Builder?\n</h4>\n<p>\n<p>When choosing GutenGeek – Ultimate Addon for Gutenberg, it’s free to get a large library to launch any website with importing only. You can get all 38+ premade style Gutenberg blocks &amp; Gutenberg block templates. All of them can be imported quickly, easy customization.</p>\n</p>\n<dt id='can%20i%20use%20this%20block%20with%20other%20blocks%20plugin%3F'>\nCan I use this block with other blocks plugin?\n</h4>\n<p>\n<p>Yes, sure. Gutengeek works well with other plugins.</p>\n</p>\n<dt id='can%20i%20upload%20my%20favorite%20icon%20or%20font%3F'>\nCan I upload my favorite icon or font?\n</h4>\n<p>\n<p>Yes, you can do it with the Gutengeek plugin. This Gutenberg plugin allows you to upload your custom font and icon you love. Then apply your content easily.</p>\n</p>\n\n",
        "changelog": "<h4>1.1.2</h4>\n"
    },
    "short_description": "Gutengeek Free Gutenberg Blocks support 38+ advanced Gutenberg blocks, 29+ Pack UI Kits for sections &amp; templates in template library that powers y &hellip;",
    "description": "<p><strong>Advanced Gutenberg Blocks</strong></p>\n<p>Gutengeek is an advanced &amp; high-quality of Gutenberg Blocks in WordPress 5.0. This Gutenberg WP comes with plenty of amazing block features that make a new WordPress block editor easier and helpful for WordPress users. This plugin is a real WordPress Page Builder that allows you to construct websites by blocks only. The premade style that helps to build a perfect website in no time. It’s time-saving and cost-saving when editing any blocks. Get wonderful experience on the website building with Gutengeek now.</p>\n<p><a href=\"https://gutengeek.com/?utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Check this WordPress Gutenberg Demo now</a></p>\n<p>Powered Gutenberg editor, Gutengeek Gutenberg Blocks plugin will be your smart choice with a large number of prebuilt blocks and pages in the UI Kit library. It&#8217;s a quick process to speed up website builder easier and more simply. Each block is ready-to-customize for settings and visual styling. Users can import and use instantly for their content with blocks.</p>\n<p>Interestingly, this addon for Gutenberg plugin (GTG) allows you to craft your WordPress content with blocks without requiring any line of code. You can import predesigned blocks, pages and landing page for page and post content. Any people can use this editor for pages. Beautiful design ( page &amp; post) &amp; easy-to-use interface will let you get wonderful website building experience.</p>\n<p><a href=\"https://gutengeek.com/?utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Gutengeek Block</a> || <a href=\"https://libs.gutengeek.com/#/blocks/?utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Live Demo</a> || <a href=\"https://docs.gutengeek.com/utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Documentation</a></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8vU2I3mxTNA?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Complete Website Building Sample with Gutenberg WP</h3>\n<p>In order to support your editor better with Gutenberg WP, insteads of using Gutenberg default, no need to worry about the limited blocks support, Gutengeek is here for your choice. With Gutengeek, you can get 38+ Gutenberg blocks and 29+ premade Pack UI Kit library for FREE and a large library for sections, pages that need only 1 click to import to build content quickly. No matter who you are, developer or store owner, agency, Gutengeek Gutenberg truly meets exactly what you are looking for. By using built-in sections, you can build entire pages without requiring any line of code.</p>\n<p><a href=\"https://gutengeek.com/?utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Discover Gutengeek Gutenberg Blocks Demos -&gt; </a></p>\n<p>With Gutengeek, you can get:</p>\n<ul>\n<li>Get Free 38+ professional blocks, sections and pages for WordPress</li>\n<li>29+ Premade <a href=\"https://gutengeek.com/template-library/#/?utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Pack UI Kit Gutenberg Layouts</a> for various fields such as landing page, business, flowers shop, bloggers&#8230;These can be imported quickly into your WordPress content. </li>\n<li>Fully responsiveness each block on the different screens such as mobile, desktop, macbook. </li>\n<li>Optimize for loading speed. Simple to use &amp; build ready-to-customize block by replacing image and text. </li>\n<li>Easy to import demos in WordPress theme that is compatible with Gutenberg. </li>\n<li>Well-optimized for performance &amp; interface for all pre-built blocks, sections &amp; pages. </li>\n<li>Integration with a lot of WordPress plugins to showcase better website functionalities. </li>\n<li>High optimization with fully responsiveness. </li>\n<li>Support Custom Font &amp; Custom Icon with Gutenberg </li>\n</ul>\n<p><a href=\"https://docs.gutengeek.com/?utm_source=wporg-repo&amp;utm_medium=link&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Discover more WP Gutenberg documentation</a></p>\n<p>In general, each block in Gutengeek plugin, you can get full setting for:</p>\n<ul>\n<li>Premade layouts: Each block comes with its own style for the block. Choose multiple layouts and set alignment. Moreover, Gutengeek comes with stunning premade layouts that you can click to import instantly for adding content. </li>\n<li>Flexible typography options available on Gutengeek. Plus, by using Gutengeek, you can upload a custom font icon and custom font for the section block. </li>\n<li>Color settings: The Gutenberg block brings with all built-in color palette or gradient options. </li>\n<li>Block style: Insert title, description, separator, media or advanced settings.</li>\n<li>Advanced settings: Background, overlay, border, animation, …<br />\nControls for block dimensions, spacing &amp; alignments, separator or divider. </li>\n<li>Perfect responsiveness block optimization on the different devices on desktop, tablet and mobile. </li>\n</ul>\n<h3>Ultimate Gutengeek Documentation for Gutenberg</h3>\n<p>If you have any questions that are related to Gutengeek blocks, for quick support, you can view details at Gutengeek tutorial to make your website easy and time-saving. Whenever you want to install, activate or disable Gutenberg plugin, you can do it instantly. The existing pages or sections which are crafted by Gutenberg ( Gutengeek) still remain.</p>\n<p>Moreover, Gutengeek also supports video, blog for WordPress blocks. If having time, you can view more informative and detailed articles of Gutengeek Gutenberg blocks for WordPress.</p>\n<h3>Gutengeek &#8211; Advanced Gutenberg Blocks for WordPress</h3>\n<p>If default Gutenberg blocks are not satisfied by you, it lacks functions, less blocks for your editor, Gutengeek comes here. So it doesn’t matter if you are not experienced in technical. Gutengeek is an addon of Gutenberg. By virtue of bringing the quickest Gutenberg editor, Gutengeek is developed with numerous features for blocks that are easy to import to post and pages. Easy for all, no need to require technical knowledge.</p>\n<p>Here are all outstanding block features of Gutengeek that makes GutenGeek become a must-have plugin for new WordPress editor 5.0.</p>\n<ul>\n<li>38+ High-customizable Gutenberg Blocks for WordPress Editor</li>\n<li>29+ premade Pack UI Kit library for FREE</li>\n<li>Modern &amp; Responsive Layout Packs for blocks, templates, pages &amp; sections.</li>\n<li>High Customizable Row Columns</li>\n<li>Flexible to Resize Column</li>\n<li>Shape Divider/Builder</li>\n<li>Advanced and diverse web design options</li>\n<li>Unlimited Google web fonts &amp; system fonts</li>\n<li>Built-in sections</li>\n<li>Classic &amp; gradient color and background</li>\n<li>Background: Color, Video, Image</li>\n<li>Numerous Built-in animation</li>\n<li>Typography Support</li>\n<li>Box-shadow</li>\n<li>Alignments</li>\n<li>Border</li>\n<li>Border Radius</li>\n<li>Transform</li>\n<li>Animation</li>\n<li>Custom CSS</li>\n<li>Unlimited Color</li>\n<li>Dimensions</li>\n<li>Media</li>\n<li>Transition</li>\n<li>Custom Fonts</li>\n<li>Custom Icons Support</li>\n<li>Multiple devices supports</li>\n</ul>\n<h3>Speed up Website Building Faster and Better Performance</h3>\n<p>In order to bring a complete solution for website building with Gutengeek, this plugin is created with the fastest and the best customers’ experience. It’s easy to use and flexible to edit, customize content, style as you want. All multiple available blocks are the most essential role in editing. For example: call-to-action block, pie progress block, … Furthermore, each block comes with its own style, layouts which are easy to import content.</p>\n<p>Currently, this advanced Gutenberg block &#8211; Gutengeek &#8211; is still in development. We are continuing to contribute more features for gutenberg usage. So many more Gutenberg blocks and Gutenberg block templates are coming soon.<br />\nDiscover more at: Gutengeek.com</p>\n<h3>Powerful Gutengeek Page Builder Gutenberg Blocks for WordPress</h3>\n<p>Here are all 38+ custom blocks to the Gutenberg block editor. Let’s explore all available advanced Gutenberg blocks.</p>\n<p><strong>Gutengeek Advanced Page Builder Gutenberg Blocks features at glance:</strong></p>\n<ul>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/sections\" rel=\"nofollow ugc\">Section Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/accordion\" rel=\"nofollow ugc\">Advanced Accordion Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/header\" rel=\"nofollow ugc\">Header Block</a></li>\n<li>Heading Block</li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/image-box\" rel=\"nofollow ugc\">Image Box</a></li>\n<li>Post Grid Block</li>\n<li>Post Masonry Block</li>\n<li>Post Carousel Block</li>\n<li>Post Timeline Block</li>\n<li>Button Block</li>\n<li>Multi Buttons Block</li>\n<li>Counter Block</li>\n<li>Divider Block</li>\n<li>InfoBox Block</li>\n<li>InfoBox Grid Block</li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/testimonial\" rel=\"nofollow ugc\">Testimonial Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/tabs\" rel=\"nofollow ugc\">Tabs Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/team\" rel=\"nofollow ugc\">Teams Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/social-icons\" rel=\"nofollow ugc\">Social Icons Block</a></li>\n<li>Social Share Block</li>\n<li>Google Map Block</li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/icon-list\" rel=\"nofollow ugc\">Icon List Block</a></li>\n<li>Icon Block</li>\n<li>Timeline Block</li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/call-to-action\" rel=\"nofollow ugc\">Call to action Block</a></li>\n<li>Row &amp; Column Block</li>\n<li>Contact Form 7 Block</li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/blockquote\" rel=\"nofollow ugc\">Quote Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/pricing\" rel=\"nofollow ugc\">Pricing Table Block &amp; Pricing Table Grid Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/progress-bar\" rel=\"nofollow ugc\">Progress Bar Block</a></li>\n<li><a href=\"https://libs.gutengeek.com/#/blocks/video\" rel=\"nofollow ugc\">Video Block</a></li>\n<li>Video Popup Block</li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/card\" rel=\"nofollow ugc\">Cards Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/number-box\" rel=\"nofollow ugc\">Number Box Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/countdown\" rel=\"nofollow ugc\">Countdown Block</a></li>\n<li><a href=\"https://gutengeek.com/template-library/#/blocks/contact\" rel=\"nofollow ugc\">Custom form builder</a></li>\n<li><a href=\"https://libs.gutengeek.com/#/blocks/pie-progress\" rel=\"nofollow ugc\">Pie progress Block</a></li>\n<li>Single Image</li>\n</ul>\n<h3>Detail of Gutengeek Page Builder Gutenberg Blocks Features</h3>\n<ul>\n<li>Section Block: The Gutenberg Section Block is a container block which is combined with multiple other gutenberg Blocks inside. It’s comes as a group of blocks in WordPress</li>\n<li>Accordion Block: This Accordion block helps to showcase collapsible texts in a dropdown interface. </li>\n<li>Header Block: Allows to add header section for background &amp; content.</li>\n<li>Advanced Heading Block: Great combination of heading and sub-heading. You can showcase headings and titles in a stunning way with typography, border &amp; advanced options. </li>\n<li>Image Box Block: The image box block allows it to be placed in a single block or multiple block. With the Image box block, you can add the title here to grab clients attention by helping them get information via info boxes. </li>\n<li>Post Grid Block: The post grid block allows you to showcase all available posts in the grid layout that visitors can follow your blog significantly. It’s easy to customize the order of posts or changing content and images. </li>\n<li>Post Masonry Block: The Post Masonry Block enables you to display all your blog posts in masonry layouts without blank space in design. You can customize image, content and the order of post in masonry layout. </li>\n<li>Post Carousel Block: The post carousel block supports to display all available posts in carousels layout that you can build content, title, category and much more.</li>\n<li>Button Block: This Gutenberg button block helps to add a single button block with the great combination of shape, link, layout, interface in button.</li>\n<li>Multi Buttons Block: The multiple buttons block allows to design multiple button blocks showcase together. The blocks can be showcased more than 2 blocks impressively and creatively to make your site more interesting.</li>\n<li>Counter Grid Box Block: The counter grid block lets you display the counter number to evaluate the quality or quantity of what you want to showcase. Easily add counter limit &amp; duration, prefix, design &amp; postfix, etc.</li>\n<li>Divider Block: The Divider Block allows you to add a line or shape to divide your content &amp; increase the distinguishable section.</li>\n<li>InfoBox Block: The Info Box block helps to display all information in the box block. The information will be heading, subheading, description, icon or image. </li>\n<li>InfoBox Grid Block: This info box block lets display multiple infoboxes which showcase the information with heading, subheading, description &amp; image or icon. Moreover, by using Gutengeek, you can import all premade layout info boxes in grid layout for content. Then your editor can be done quickly in minutes by replacing text and images. </li>\n<li>Testimonials Block: The testimonial block allows to display all customers&#8217; feedback or reviews with names, avatars, icons &amp; more.</li>\n<li>Tabs Block: The tabs block supports to display your content with different tabs. The premade tabs block brings attractive animations, icons &amp; more stunning features that makes content more exciting. </li>\n<li>Teams Block: This teams block lets you showcase your team members with details such as  image, name, position, links to social profiles.  </li>\n<li>Social Icons Block: This social icon block supports adding icons and insert links to social networks you loved. It’s flexible to change to other icons with stunning icons for content.</li>\n<li>Social Share Block: The Social share block allows to add social icon share. By clicking on the social icon, your page and post can be shared on the social network in order to increase traffic &amp; engagement for websites.</li>\n<li>Google Map Block: The Google map block helps to embed Google maps on posts and pages that include lots of options like customize map height, zoom map.</li>\n<li>Icon List Block: At the list format, this icon list block supports choosing a favorite icon that is suitable with each list of items. Also, it covers a large number of attractive icons for you to select.</li>\n<li>Icon Block: The Icon Block lets you add/upload a customizable icon or available icons in Gutenberg for post and page.</li>\n<li>Timeline Block: This Timeline Block for Gutenberg helps to showcase perfectly the detail of roadmap, company history, product release, and achievements.</li>\n<li>Post timeline Block: The Post timeline block helps to showcase the order of all stunning posts with time, date published. Also, you can customize icon, date, content for posts on the timeline block. </li>\n<li>Call to action Block: This Call-to-action block helps to add “Learn more”, “Download”, “View more” to let customers take their action on your website.</li>\n<li>Row &amp; Column Block: The Row &amp; Column block supports to add multiple row and columns. Moreover, you can customize row and column layouts with amazing functionality.</li>\n<li>Contact Form 7 Block: Thanks to integrating contact form 7 in Gutenberg block, this contact form 7 allows to add a form in Gutenberg. It’s easy to customize and design for form to let custom fulfill form to get more information. </li>\n<li>Quote Block: The quote block allows you to add quoted sentences or text in a hot trend from famous persons with a lot of customization. </li>\n<li>Pricing Table Block: This pricing table block supports to display the price of items in a single block. It’s suitable with services, membership, in a beautiful table style.</li>\n<li>Pricing Table Grid Block: This pricing table grid block allows to display multiple price in the grid layout. You can change and customize the number of pricing table, content of price table with icon, &#8230;</li>\n<li>Progress Bar Block: This Progress bar block allows to display statistics via progress bars with bar background, animation showcase. It’s easy to change layout, style and setting for bar with color, change title, background,&#8230; </li>\n<li>Video Block: This Gutenberg Video block allows to add/upload video or embed video from to video block content to engage more interaction in video.</li>\n<li>Video Popup Block: This video popup block allows you to add video popups with icons, wrapper, and overlay to make your site more exciting for each page loading.</li>\n<li>Cards Block: The Card block for Gutengeek helps to display more information and photos in the card block to showcase your portfolio, team photos, services, and more.</li>\n<li>Countdown Block: This countdown block supports to add a countdown timer with number, hours, any date, customizable and easy to use or embed on a website or blog as a widget. It’s used to show the coming soon event, sale campaign, or opening ceremony.</li>\n<li>Custom form builder Block: This custom form builder block allows to add the various form fields, check boxes, radio buttons, text area and text on the block without any line of code or HTML CSS.</li>\n<li>Vertical Tabs Block: This vertical tab block lets you organize your content smartly with vertical tabs.<br />\nPie Progress Block: Break complicated parts of progress and use easy-to-see pie progresses.</li>\n<li>Single Image Block: This Gutenberg single image block supports to add caption, subcaption, text on image, overlay on image.</li>\n</ul>\n<h3>Bug Fixes</h3>\n<ul>\n<li>Global Style Variables</li>\n</ul>\n<h4>1.1.1</h4>\n<h3>Bug Fixes</h3>\n<ul>\n<li>Remove console.log</li>\n<li>Add hooks to post loop(Post Grid, Post Carousel, Post Masonry)</li>\n<li>Fixed toggle post category on dashboard</li>\n</ul>\n<h4>1.1</h4>\n<h3>FEATURE ADD NEW</h3>\n<pre><code>- New block Advanced Media Card\n</code></pre>\n<h4>1.0.6</h4>\n<h3>FIXED</h3>\n<ul>\n<li>Testimonial Rating</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Features\n<ul>\n<li>Apply RichText format: Bold, Underline, Color, Background</li>\n<li>Add Offcanvas, Full Width template</li>\n<li>Add Image Carousel block</li>\n</ul>\n</li>\n<li>FIXED\n<ul>\n<li>Animation selection</li>\n<li>Pie Progress block add action</li>\n</ul>\n</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Features\n<ul>\n<li>Blocks:\n<ul>\n<li>Image Block</li>\n</ul>\n</li>\n<li>Controls: Add Tabs, Tab, URL inspector controls</li>\n</ul>\n</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Features\n<ul>\n<li>Blocks:\n<ul>\n<li>Progress: add new style circle</li>\n<li>Tested up to: 5.4.2: Template Library button</li>\n<li>Split and add vendor: gutengeek/components(https://packagist.org/packages/gutengeek/components)</li>\n<li>Post Grid: add columns to post list</li>\n</ul>\n</li>\n<li>Add block position</li>\n<li>Add block border, border radius</li>\n<li>Update Animation control and improve animation effect</li>\n</ul>\n</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Bug Fixes\n<ul>\n<li>Blocks:\n<ul>\n<li>Testimonial: content boxshadow hover</li>\n<li>Post Masonry: hotfix Category components</li>\n<li>Info Box: Media Image align center on layout 1 + layout 2</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/gtg-advanced-blocks.1.1.3.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/gtg-advanced-blocks/assets/screenshot-1.png?rev=2328949",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gtg-advanced-blocks/assets/screenshot-2.png?rev=2328949",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gtg-advanced-blocks/assets/screenshot-3.png?rev=2328949",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gtg-advanced-blocks/assets/screenshot-4.png?rev=2328949",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gtg-advanced-blocks/assets/screenshot-5.png?rev=2328949",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gtg-advanced-blocks/assets/screenshot-6.png?rev=2328949",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gtg-advanced-blocks/assets/screenshot-8.png?rev=2328949",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gtg-advanced-blocks/assets/screenshot-9.png?rev=2394932",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gtg-advanced-blocks/assets/screenshot-10.png?rev=2394932",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/gtg-advanced-blocks/assets/screenshot-11.png?rev=2394932",
            "caption": ""
        }
    ],
    "tags": {
        "block-editor": "block-editor",
        "blocks": "blocks",
        "editor": "editor",
        "gutenberg": "gutenberg",
        "gutenberg-blocks": "gutenberg blocks"
    },
    "stable_tag": "1.1.3",
    "versions": {
        "1.0.5": "https://downloads.wordpress.org/plugin/gtg-advanced-blocks.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/gtg-advanced-blocks.1.0.6.zip",
        "1.1": "https://downloads.wordpress.org/plugin/gtg-advanced-blocks.1.1.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/gtg-advanced-blocks.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/gtg-advanced-blocks.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/gtg-advanced-blocks.1.1.3.zip",
        "trunk": "https://downloads.wordpress.org/plugin/gtg-advanced-blocks.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/gtg-advanced-blocks/assets/banner-772x250.png?rev=2472092",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/gtg-advanced-blocks/assets/icon-256x256.png?rev=2328949",
        "2x": "https://ps.w.org/gtg-advanced-blocks/assets/icon-256x256.png?rev=2328949"
    },
    "blocks": {
        "gutengeek/global": {
            "name": "gutengeek/global",
            "title": "Global"
        },
        "gutengeek/accordion-item": {
            "name": "gutengeek/accordion-item",
            "title": "Accordion Item"
        },
        "gutengeek/accordion": {
            "name": "gutengeek/accordion",
            "title": "Accordion"
        },
        "gutengeek/post-grid": {
            "name": "gutengeek/post-grid",
            "title": "Post Grid"
        },
        "gutengeek/post-masonry": {
            "name": "gutengeek/post-masonry",
            "title": "Post Masonry"
        },
        "gutengeek/post-carousel": {
            "name": "gutengeek/post-carousel",
            "title": "Post Carousel"
        },
        "gutengeek/button": {
            "name": "gutengeek/button",
            "title": "Button"
        },
        "gutengeek/buttons": {
            "name": "gutengeek/buttons",
            "title": "Buttons"
        },
        "gutengeek/counter": {
            "name": "gutengeek/counter",
            "title": "Counter"
        },
        "gutengeek/counter-grid": {
            "name": "gutengeek/counter-grid",
            "title": "Counter Grid Box"
        },
        "gutengeek/info-box-grid": {
            "name": "gutengeek/info-box-grid",
            "title": "InfoBox Grid"
        },
        "gutengeek/tab": {
            "name": "gutengeek/tab",
            "title": "Tab Item"
        },
        "gutengeek/tabs": {
            "name": "gutengeek/tabs",
            "title": "Tabs"
        },
        "gutengeek/team": {
            "name": "gutengeek/team",
            "title": "Team"
        },
        "gutengeek/team-grid": {
            "name": "gutengeek/team-grid",
            "title": "Teams"
        },
        "gutengeek/social-icons": {
            "name": "gutengeek/social-icons",
            "title": "Social Icons"
        },
        "gutengeek/social-share": {
            "name": "gutengeek/social-share",
            "title": "Social Share"
        },
        "gutengeek/google-map": {
            "name": "gutengeek/google-map",
            "title": "Google Map"
        },
        "gutengeek/icon-list": {
            "name": "gutengeek/icon-list",
            "title": "Icon List"
        },
        "gutengeek/icon": {
            "name": "gutengeek/icon",
            "title": "Icon"
        },
        "gutengeek/timeline": {
            "name": "gutengeek/timeline",
            "title": "Timeline"
        },
        "gutengeek/post-timeline": {
            "name": "gutengeek/post-timeline",
            "title": "Post Timeline"
        },
        "gutengeek/call-to-action": {
            "name": "gutengeek/call-to-action",
            "title": "Call To Action"
        },
        "gutengeek/column": {
            "name": "gutengeek/column",
            "title": "Column"
        },
        "gutengeek/mailchimp": {
            "name": "gutengeek/mailchimp",
            "title": "Mailchimp"
        },
        "gutengeek/blockquote": {
            "name": "gutengeek/blockquote",
            "title": "Quote"
        },
        "gutengeek/progress": {
            "name": "gutengeek/progress",
            "title": "Progress Bar"
        },
        "gutengeek/pie-progress-item": {
            "name": "gutengeek/pie-progress-item",
            "title": "Pie Progress Item"
        },
        "gutengeek/video": {
            "name": "gutengeek/video",
            "title": "Video"
        },
        "gutengeek/cards": {
            "name": "gutengeek/cards",
            "title": "Cards"
        },
        "gutengeek/number-box": {
            "name": "gutengeek/number-box",
            "title": "Number Box"
        },
        "gutengeek/number-box-grid": {
            "name": "gutengeek/number-box-grid",
            "title": "Number Box Grid"
        },
        "gutengeek/countdown": {
            "name": "gutengeek/countdown",
            "title": "Countdown"
        },
        "gutengeek/custom-form": {
            "name": "gutengeek/custom-form",
            "title": "Form Builder"
        },
        "gutengeek/image-block": {
            "name": "gutengeek/image-block",
            "title": "Single Image Block"
        },
        "gutengeek/image-carousel": {
            "name": "gutengeek/image-carousel",
            "title": "Image Carousel"
        },
        "gutengeek/media-card": {
            "name": "gutengeek/media-card",
            "title": "Advanced Media Card"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 66,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}