{
    "name": "GutenBee &#8211; Gutenberg Blocks",
    "slug": "gutenbee",
    "version": "2.18.0",
    "author": "<a href=\"https://www.cssigniter.com\">The CSSIgniter Team</a>",
    "author_profile": "https://profiles.wordpress.org/cssigniterteam/",
    "contributors": {
        "cssigniterteam": {
            "profile": "https://profiles.wordpress.org/cssigniterteam/",
            "avatar": "https://secure.gravatar.com/avatar/a0ecf6a506d5955f6ab7061ef3460dfe?s=96&d=monsterid&r=g",
            "display_name": "The CSSIgniter Team"
        },
        "silencerius": {
            "profile": "https://profiles.wordpress.org/silencerius/",
            "avatar": "https://secure.gravatar.com/avatar/1c476d1efc4f57f3d19d064b4e51b035?s=96&d=monsterid&r=g",
            "display_name": "Vassilis Mastorostergios"
        },
        "nvourva": {
            "profile": "https://profiles.wordpress.org/nvourva/",
            "avatar": "https://secure.gravatar.com/avatar/9d06f62f0cebb3af49f5e3337870c0a5?s=96&d=monsterid&r=g",
            "display_name": "Nik"
        },
        "tsiger": {
            "profile": "https://profiles.wordpress.org/tsiger/",
            "avatar": "https://secure.gravatar.com/avatar/d20c76f686bbd5c5b9078d41967d5ccd?s=96&d=monsterid&r=g",
            "display_name": "Gerasimos Tsiamalos"
        },
        "anastis": {
            "profile": "https://profiles.wordpress.org/anastis/",
            "avatar": "https://secure.gravatar.com/avatar/a0c9b3cdb2bebd7325ddd95422ea9c06?s=96&d=monsterid&r=g",
            "display_name": "Anastis Sourgoutsidis"
        }
    },
    "requires": "6.4",
    "tested": "6.6.1",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 15,
        "4": 2,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 17,
    "support_url": "https://wordpress.org/support/plugin/gutenbee/",
    "support_threads": 2,
    "support_threads_resolved": 2,
    "active_installs": 7000,
    "downloaded": 132718,
    "last_updated": "2024-07-24 13:28:00",
    "added": "2018-01-29",
    "homepage": "https://www.cssigniter.com/plugins/gutenbee/",
    "sections": {
        "description": "<p><a href=\"https://www.cssigniter.com/plugins/gutenbee/\" rel=\"nofollow ugc\">GutenBee is a collection of elegant WordPress blocks</a> enhancing your editing experience in the Gutenberg editor and vastly extending the potential of the new editor experience.</p>\n<p>Check out <a href=\"https://www.cssigniter.com/gutenbee/\" rel=\"nofollow ugc\">the demo</a> now!</p>\n<p>The plugin&#8217;s documentation can be found <a href=\"https://www.cssigniter.com/docs/gutenbee/\" rel=\"nofollow ugc\">here</a>.</p>\n<p>Here&#8217;s the demo of one of our latest blocks, the Food Menu block</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Wv_zwREKi68?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><strong>Blocks:</strong></p>\n<ul>\n<li><strong>Accordion</strong>: Organize your content into accordion elements. All the content including titles can be edited directly in the WordPress editor and you can choose any color combination from the block’s settings.</li>\n<li><strong>Banner</strong>: Create beautiful and flexible banners on your site to capture user attention. Supports video backgrounds.</li>\n<li><strong>Buttons</strong>: Actionable content needs clickable buttons. Add one or more buttons, tweak their colors, borders and alignment and you&#8217;re all set!</li>\n<li><strong>Container</strong>: A powerful container block allowing content grouping or splitting in columns, complete with fully responsive settings.</li>\n<li><strong>Countdown</strong>: Have an upcoming event? Pick a date directly inside the editor screen, choose your layout, colors, and typography and you’re ready!</li>\n<li><strong>CountUp</strong>: Maybe not every block counts, but this one does! Pick a starting and ending number, add a suffix or prefix, style it and you’re done!</li>\n<li><strong>Divider</strong>: Provide thematic content spacing with a fancy divider, edit its style, colors, and margins.</li>\n<li><strong>Food Menu</strong>: Display your dishes and drink offerings in a stylish fashion.</li>\n<li><strong>Google Maps</strong>: Easy-peasy fancy maps with the Google Maps block. Just enter a location and save, it just works! With support for beautiful predefined map styles and Snazzy custom map styles!</li>\n<li><strong>Heading</strong>: A normal heading block with responsive settings.</li>\n<li><strong>Icon</strong>: Display icons from a custom designed, curated list of over one hundred icons, with more icons being added in regular updates!</li>\n<li><strong>Icon Box</strong>: Your standard icon box block on steroids. Choose from over one hundred custom designed icons, style them any way and at any size you like, add some text and you’re good to go.</li>\n<li><strong>Icon List</strong>: Create lists with beautiful icons instead of bullets.</li>\n<li><strong>Image</strong>: A variation of the core Image block with extra responsive spacing and sizing settings.</li>\n<li><strong>Image Box</strong>: A standard image box with title and text block on steroids. Adjust your spacing, layout, alignment, or colors and typography.</li>\n<li><strong>Image Comparison</strong>: Need to showcase your photo editing skills or writing up a camera review? With the Image Comparison block you can enhance your posts with side-by-side comparison of any two photos you wish.</li>\n<li><strong>Justified Gallery</strong>: Create beautiful justified grid layout galleries inside any of your post or pages.</li>\n<li><strong>Paragraph</strong>: A variation of the core Paragraph block with responsive spacing settings.</li>\n<li><strong>Progress Bar</strong>: Add stylish progress bars and display either progress or your skillset with the most visually captivating way.</li>\n<li><strong>Review</strong>: Transform any post into a review. Score items individually, and average them out automatically.</li>\n<li><strong>Slideshow</strong>: Add a fancy slideshow to your posts or pages. Drag and drop your images, choose your settings and hit publish!</li>\n<li><strong>Spacer</strong>: Complete control spacing of elements in your posts and pages with the responsive Spacer block.</li>\n<li><strong>Tabs</strong>: Organize your content into fancy tabs. All the content including titles can be edited directly in the WordPress editor and you can choose any color combination from the block’s settings.</li>\n<li><strong>Testimonial</strong>: An easy to use block to help you display your testimonials with multiple layouts.</li>\n<li><strong>Post Types</strong>: List posts from any post type in a configurable grid, complete with fully responsive settings.</li>\n<li><strong>Video</strong>: Embed a video from your media library or upload a new one.</li>\n<li><strong>Video Embed</strong>: Embed videos from YouTube or Vimeo and lazy-load theme if you wish to.</li>\n</ul>\n<p><strong>JOIN OUR COMMUNITY</strong><br />\nJoin our <a href=\"https://www.facebook.com/groups/2601788933169108\" rel=\"nofollow ugc\">Facebook group</a> to discuss new features and stay up to date on our latest releases.</p>\n<p><strong>Contribute</strong><br />\nVisit the <a href=\"https://github.com/cssigniter/gutenbee\" rel=\"nofollow ugc\">GitHub repository</a> for full source code and to report any bugs.</p>\n",
        "installation": "<p>From within WordPress&#8217; dashboard:</p>\n<ol>\n<li>Go to Plugins -&gt; Add New</li>\n<li>Search for &#8220;GutenBee&#8221;</li>\n<li>Click &#8220;Install&#8221;</li>\n<li>Click &#8220;Activate&#8221;</li>\n<li>New Gutenberg Blocks will appear!</li>\n</ol>\n<p>Note that if you want to use the Google Maps block you will also need a Google Maps API Key. Instruction can be found in GutenBee&#8217;s settings page.</p>\n",
        "changelog": "<h4>2.18.0</h4>\n<ul>\n<li>WP 6.6 / React 19 update.</li>\n<li>Added GitHub link.</li>\n<li>Fixed an issue with the column block, sometimes invalidating in WordPress 6.5</li>\n</ul>\n<h4>2.17.4</h4>\n<ul>\n<li>Fixed an issue where some blocks could not be edited or the editor would not load properly due to lodash&#8217;s removal from core.</li>\n<li>Fixed an issue where the Icon list item rich text field would not accept input.</li>\n</ul>\n<h4>2.17.3</h4>\n<ul>\n<li>Enqueueing of Google Maps API key is now filterable via &#8216;gutenbee_enqueue_google_maps_api&#8217;</li>\n</ul>\n<h4>2.17.2</h4>\n<ul>\n<li>Fixed issue where since the iframe-ing of the block editor in WP 6.3, block editor assets would not get enqueued under specific circumstances.</li>\n<li>Block editor assets are now enqueued via the &#8216;enqueue_block_assets&#8217; action instead of &#8216;enqueue_block_editor_assets&#8217;.</li>\n</ul>\n<h4>2.17.1</h4>\n<ul>\n<li>Fixed issue where some required files would not be included in the distributed plugin.</li>\n</ul>\n<h4>2.17.0</h4>\n<ul>\n<li>Button block: The Button’s “outline” predefined template now correctly applies no background.</li>\n<li>Container / Column block: Added option to control the container’s column block height.</li>\n<li>Container / Column block: Fixed overlap in nested layouts.</li>\n<li>Fix layout of some inner blocks when placed inside of the Banner block.</li>\n<li>Food menu block: Minor layout adjustment in price text</li>\n<li>Gallery block: Added ability to display captions on the images.</li>\n<li>Image comparison block: Fix strings to be able to be translated.</li>\n<li>Progress bar block: Added option to control the block’s height.</li>\n<li>Review block: Fix an issue where it would calculate the score incorrectly.</li>\n<li>Review block: Fix performance issues when changing the rating.</li>\n<li>Review block: Fix block from displaying an error in the editor.</li>\n<li>Added WPML support.</li>\n<li>Maintenance tasks.</li>\n</ul>\n<h4>2.16.1</h4>\n<ul>\n<li>Various spacing fixes in block controls</li>\n<li>Fix spacer appearance in the block editor</li>\n<li>Prevent URL picker from appearing above the media gallery picker</li>\n</ul>\n<h4>2.16.0</h4>\n<ul>\n<li>Divider block: Fixed an issue where resetting the color would break the block in the editor.</li>\n<li>Container block: Fixed an issue where adding padding to a column would apply it to nested columns.</li>\n<li>All blocks: Added desktop only setting for animations.</li>\n<li>All blocks: Updated animation logic for longer blocks that surpass the animation viewport threshold.</li>\n<li>Accordion block: Allow more accordion and tab items.</li>\n<li>Block attributes are passed to gutenbee_get_columns_classes() for context.</li>\n</ul>\n<h4>2.15.0</h4>\n<ul>\n<li>All blocks: Added animation controls. Can be disabled via the plugin&#8217;s options.</li>\n<li>Paragraph block: Add advanced responsive typography controls.</li>\n<li>Heading block: Add advanced responsive typography controls.</li>\n<li>Post type block: Updated deprecated getAuthors to getUsers method.</li>\n<li>Banner block: Fixed background color reset from breaking the block.</li>\n<li>Image block: Don&#8217;t add the caption by default when selecting an image.</li>\n</ul>\n<h4>2.14.0</h4>\n<ul>\n<li>All blocks: Update code deprecations for WP 6.0</li>\n<li>Gallery block: Link to the full image URLs when images are linked to media.</li>\n</ul>\n<h4>2.13.1</h4>\n<ul>\n<li>Image Box block: Fixed max image size on WordPress 6.0</li>\n<li>Post Types block: Fixed max image size on WordPress 6.0</li>\n<li>Post Types block: Fixed box sizing on WordPress 6.0</li>\n<li>Post Types block: Edge case would set maximum number of columns per post type to a wrong number.</li>\n<li>Gallery block: Fixed box sizing on WordPress 6.0</li>\n<li>Google Maps Block: Conditionally load google maps api only if it’s necessary.</li>\n</ul>\n<h4>2.13.0</h4>\n<ul>\n<li>Divider block: Fix an issue where the divider block would not clear itself in the editor when around floated elements.</li>\n<li>Post Types block: Improve the experience of searching terms and included/excluded posts.</li>\n<li>Food Menu block: Fixed for WP 5.9</li>\n<li>Container block: Added tooltip descriptions on the more complex settings of the Container block.</li>\n<li>Countup Block: Added option to start the countup when the countup is in the viewport.</li>\n<li>Accordion Block: Added plus/minus icons on expand/collapse.</li>\n<li>Banner Block: Added default minimum height of 450px</li>\n<li>Image Box block: Fixed alignment setting.</li>\n<li>Post Types Block: Fixed load more button.</li>\n<li>Adjust text control for WP 5.9</li>\n<li>Fixed color picker for WP 5.9</li>\n<li>Fixed various smaller issues in support of WP 5.9</li>\n<li>Various smaller bugfixes and improvements</li>\n</ul>\n<h4>2.12.5</h4>\n<ul>\n<li>Post Types Block: Added “gutenbee.posts-loaded” event when posts are finished loading via load more button.</li>\n</ul>\n<h4>2.12.4</h4>\n<ul>\n<li>Post Types Block: Fix an issue where the post type would not render properly after changing it from the dropdown.</li>\n<li>Post Types Block: Added load more button functionality as a type of pagination.</li>\n<li>Fixed a layout issue with food items in the editor.</li>\n</ul>\n<h4>2.12.3</h4>\n<ul>\n<li>Fixed an issue where the Post Types block would be limited to 10 post types.</li>\n</ul>\n<h4>2.12.2</h4>\n<ul>\n<li>Fixed appearance of heading select controls (icons) in the block sidebar.</li>\n<li>Divider and Spacer blocks: Allow for heights less than 10px.</li>\n</ul>\n<h4>2.12.1</h4>\n<ul>\n<li>Update link controls on all blocks that support them and moved them on the block toolbar.</li>\n<li>Added a way to link padding and margin values together so that they can be changed at the same time with the same value.</li>\n<li>Fix issue with the font size picker on all blocks where the unit selection would not work.</li>\n<li>Fix Food Menu block appearance in the editor.</li>\n<li>Fix heading selection overflowing in the editor.</li>\n<li>Minor style adjustments for WordPress 5.8</li>\n<li>A deprecation warning would be thrown after WP 5.8 (action &#8216;block_categories&#8217; renamed to &#8216;block_categories_all&#8217;).</li>\n<li>The wp-editor script should not be enqueued together with the new block widgets editor in WP 5.8.</li>\n</ul>\n<h4>2.12.0</h4>\n<ul>\n<li>Added support for showing all/upcoming/past/recurring events from the Ignition Framework.</li>\n<li>Post Types Block: Added custom label for read more buttons.</li>\n<li>Make it easier to search for GutenBee blocks in the inserter (video, video embed, etc).</li>\n<li>Accordion Block: Added hover + active colors for the titles.</li>\n<li>Banner Block: Fix the ability to revert to &#8220;auto&#8221; height.</li>\n<li>Image Block: Migrate to editor API v2 &#8211; Improve editor appearance and UX.</li>\n<li>Image Comparison Block: Start images hidden until the comparison script is ready.</li>\n<li>List Icon Block: Improve horizontal appearance of icons and labels.</li>\n<li>Maps Block: Added the ability for HTML markup in marker info windows.</li>\n<li>Paragraph &amp; Heading Blocks: Fixed an issue where custom classes would not be applied.</li>\n<li>Post Types Block: Improved appearance of one column layout.</li>\n<li>Tabs Block: New hover colors.</li>\n</ul>\n<h4>2.11.1</h4>\n<ul>\n<li>Updated positioning of the video background spinner on the bottom center of the Container and Banner block.</li>\n<li>Fixed an issue where background overlay would sometimes disappear when a video background started playing in Safari.</li>\n<li>Fixed an issue where self hosted video backgrounds would not start in Firefox.</li>\n<li>Moved video background controls below the background image control (editor).</li>\n<li>Slideshow block: Arrow navigation now uses inline SVGs.</li>\n<li>Updated all &#8220;Circle Mask&#8221; block styles on Image and Testimonial blocks to &#8220;Rounded&#8221;.</li>\n</ul>\n<h4>2.11.0</h4>\n<ul>\n<li>Post Type block: Improve performance by creating new searchable controls for Tags and Posts.</li>\n<li>Banner &amp; Container block: Added support for start time in video backgrounds.</li>\n<li>Banner &amp; Container block: Added loading indicator for video backgrounds.</li>\n<li>Fixed an issue where some Range Slider controls would not be reset.</li>\n<li>Improved background video loading.</li>\n</ul>\n<h4>2.10.6</h4>\n<ul>\n<li>Post Type block: Prevent block style previews from loading complete preview of the block to improve performance.</li>\n</ul>\n<h4>2.10.5</h4>\n<ul>\n<li>Post Type block: Pass the number of columns and any classes (including block style-sourced ones) down into the item templates.</li>\n</ul>\n<h4>2.10.4</h4>\n<ul>\n<li>Fixed an infinite loop that was causing the Container block to crash in WP 5.7</li>\n<li>Fixed issue with color pickers where they would open and close immediately in WP 5.7</li>\n</ul>\n<h4>2.10.3</h4>\n<ul>\n<li>Fixed an issue where custom font sizes would not be applied in the editor for the Paragraph, Heading, Button, and Icon List blocks.</li>\n<li>Fixed deprecations from version 2.6.x on Container, Divider, and Spacer blocks.</li>\n</ul>\n<h4>2.10.2</h4>\n<ul>\n<li>Added the ability to mark Accordion tabs as default open</li>\n<li>Fixed an issue where a background image would get repeated if you had nested Container blocks.</li>\n<li>Fixed an issue where a background image would get repeated if you had nested Banner blocks.</li>\n<li>Enable anchor on the Spacer block.</li>\n</ul>\n<h4>2.10.1</h4>\n<ul>\n<li>Fix an issue that prevented JavaScript assets from being minified.</li>\n<li>Updated all instances of window.load to avoid a race condition causing Firefox to not run the scripts occasionally (Banner block / Slideshow block)</li>\n<li>Image block: Removed clearfix styling.</li>\n<li>Banner block: Fixed an issue where the banner&#8217;s background image would be hidden if it was inside a container with an overlay color.</li>\n<li>Slideshow block: Remove all dependencies on jquery-migrate.</li>\n</ul>\n<h4>2.10.0</h4>\n<ul>\n<li>Paragraph block&#8217;s content can now be included in auto-generated excerpts.</li>\n<li>Modernized CSS prefixes.</li>\n<li>Added responsive background image on Container, Column, Banner, Spacer, Divider Blocks.</li>\n<li>Fixed an issue where the responsive controls would not be clickable on dropdown controls (editor).</li>\n<li>Accordion block: Fixed title background application in editor.</li>\n<li>Accordion block: Fixed the title background color application in the editor.</li>\n<li>Banner block: Fixed issue where box shadow would not get applied correctly.</li>\n<li>Banner block: Fixed inset box shadow appearance in the editor.</li>\n<li>Banner block: Fixed application of box shadow and border.</li>\n<li>Banner block: Remove &#8220;noreferrer&#8221; attribute from link&#8217;s rel when &#8220;new target&#8221; setting is enabled.</li>\n<li>Buttons block: Remove &#8220;noreferrer&#8221; attribute from link&#8217;s rel when &#8220;new target&#8221; setting is enabled.</li>\n<li>Container block: Fixed a border radius issue when the block had a background overlay.</li>\n<li>Container block: Fixed issue where box shadow would not get applied correctly if the zoom option was enabled on the background image.</li>\n<li>Container block: Fixed an issue where the border would become clipped by parallax if it was enabled.</li>\n<li>Container block: Fixed application of box shadow and border.</li>\n<li>Container block: The container block&#8217;s width will now fit any custom editor width.</li>\n<li>Container block: Refactored width edge cases.</li>\n<li>Countdown block: Adjust for the case where the default date was set and the countdown was expired.</li>\n<li>Countdown block: Remove left and right margins from the first and last time element respectively.</li>\n<li>Google Maps block: Fixed an issue with the settings toggle.</li>\n<li>Icon block: Rearranged settings panels in editor.</li>\n<li>Icon Box block: Renamed alignment settings to better reflect what they do.</li>\n<li>Icon Box block: Fixed icon padding/margin.</li>\n<li>Image block: Added link destination setting.</li>\n<li>Image block: Fixed an issue where the image would overlap content if there was alignment in place (frontend).</li>\n<li>Review block: Fixed a case where applying bold font weight to the score subtitle would change its appearance.</li>\n<li>Review block: Fixed overflowing issues.</li>\n<li>Review block: Removed explicit width so that it won&#8217;t overlap containers if it has margin applied.</li>\n<li>Tabs block: Tab navigation now becomes vertical on small viewports.</li>\n</ul>\n<h4>2.9.0</h4>\n<ul>\n<li>Added Review block.</li>\n<li>Video Embed block: Added option &#8220;Stick to bottom on scroll&#8221;.</li>\n<li>Post Type block: Themes may now opt in to user-selectable image sizes for specific post types.</li>\n<li>Added Background zoom support for the Banner &amp; Container blocks.</li>\n<li>Added Background zoom option to BackgroundControl.</li>\n<li>Added plugin option to modify editor width globally.</li>\n<li>Added plugin option to modify inserter &amp; appender button colors globally.</li>\n<li>Front-end styles are now minified.</li>\n<li>Added link to the GutenBee settings on the plugin listing page.</li>\n<li>Renamed gutenbee_admin_styles() to gutenbee_admin_assets()</li>\n<li>gutenbee_get_template_part()&#8217;s 4th parameter renamed to $args, in order for template parts to be compatible with any other standard template parts, since the $args parameter was added in get_template_part().</li>\n<li>Fixed initial appender size on Banner block.</li>\n<li>Fixed initial minimum height of Banner block.</li>\n</ul>\n<h4>2.8.1</h4>\n<ul>\n<li>Fixed an issue with inner block wrappers caused by changes made in Gutenberg v9.2 / WordPress 5.6</li>\n<li>Fixed an issue where some blocks would force the inspector controls to extend past the viewport.</li>\n</ul>\n<h4>2.8.0</h4>\n<ul>\n<li>Added Banner block.</li>\n<li>Added support for video background in the Container block.</li>\n<li>Added filters &#8216;gutenbee_enqueue_frontend_styles&#8217; and &#8216;gutenbee_enqueue_frontend_scripts&#8217; to force enqueueing frontend assets.</li>\n<li>UPDATED: Convert all internal block inline CSS rules from ID based to class based.</li>\n<li>Merge all identical selector CSS rules in block inline styles.</li>\n<li>Fixed an issue where in some blocks &#8220;undefined&#8221; would appear as a class.</li>\n<li>Fixed an issue where the video block would break in the editor when adding padding/margin.</li>\n<li>Added support for anchor links on all blocks.</li>\n<li>Fixed issue where an empty element was output when no avatar was selected, or no quote text was set, in the Testimonial block.</li>\n<li>Fixed minor spacing issues in the Testimonial element.</li>\n<li>Added Toolbar button to clear avatar on the Testimonial block.</li>\n<li>Added Visibility settings on all blocks.</li>\n<li>Fixed an issue in the Video Embed block that caused it to crash in the editor when changing padding and margin settings.</li>\n<li>Added self hosted video support for video backgrounds.</li>\n<li>Added per Button font size control.</li>\n<li>Fixed some undefined variables.</li>\n<li>Fixed an issue where the border radius would not be migrated on Buttons.</li>\n</ul>\n<h4>2.7.0</h4>\n<ul>\n<li>Added new &#8220;Icon List&#8221; block.</li>\n<li>Added new &#8220;Testimonial&#8221; block.</li>\n<li>Added new &#8220;Video Embed&#8221; block.</li>\n<li>GutenBee block styles are loaded when the blocks are in reusable blocks.</li>\n</ul>\n<h4>2.6.2</h4>\n<ul>\n<li>Fixed Post Type block support for custom classes.</li>\n<li>Post Type block: Min-max columns are now filterable per post type (see &#8216;gutenbee_block_post_types_post_types_columns&#8217;).</li>\n<li>Fixed an issue where heading colors would not be overridden by the applied text color.</li>\n<li>Fixed an issue on the Icon block where deleting the icon input would invalidate the block.</li>\n<li>Updated buttons on the poster image setting in the Video block.</li>\n<li>Display initial values on the border settings.</li>\n<li>Always display the border radius setting, regardless of the border style attribute.</li>\n<li>Fixed handling of offset when used in combination with pagination in the Post Type block.</li>\n</ul>\n<h4>2.6.1</h4>\n<ul>\n<li>Fixed an issue with the IconBox and the ImageBox blocks where if the font size was reset the block would break validation.</li>\n</ul>\n<h4>2.6.0</h4>\n<ul>\n<li>Added new &#8220;Food Item&#8221; block.</li>\n<li>Fixed an issue where the theme-grid option would be incompatible with fullwidth alignment in the container block.</li>\n<li>Added background color for arrows and dots navigation in the Slideshow block.</li>\n<li>Update all color pickers on all blocks with RGBA ones.</li>\n<li>Changed the &#8220;Icon&#8221; and &#8220;Icon Box&#8221; blocks to render SVG for their icons instead of an icon font.</li>\n<li>Fixed an issue where the &#8220;Icon Box&#8221; and &#8220;Image Box&#8221; blocks would not accept the paste command in their text inputs.</li>\n<li>Front-end scripts and styles are now only enqueued when they are required by the GutenBee blocks used.</li>\n<li>Fixed Spacer block&#8217;s parallax setting.</li>\n<li>Now the container block will remain selected when choosing columns from the initial layouts.</li>\n<li>Updated default gutter size to &#8220;30px &#8211; large&#8221; in the container block (will not affect existing content).</li>\n<li>Fixed an issue where the reverse column order settings in tablet and mobile would not take effect on the container block.</li>\n<li>Fixed an issue where the styling would break on the Slideshow block if custom classes were added.</li>\n<li>Fixed an issue where center aligned Image blocks would cause their images to be stretched on iOS.</li>\n<li>Minor style adjustments.</li>\n</ul>\n<h4>2.5.0</h4>\n<ul>\n<li>Fixed container block issue spacing when theme grid is on.</li>\n<li>Fixed paragraph block border and box shadow application element.</li>\n<li>Fixed an issue where the move handlers were being clipped when the container block was fullwidth.</li>\n<li>Updated container block for WordPress 5.5 support.</li>\n<li>Fixed container block direction setting in the editor</li>\n<li>Fixed minor styling issue for blocks for WordPress 5.5 support</li>\n<li>Added &#8220;Included posts&#8221; in Post Type block</li>\n<li>Fixed an issue where the selected term in the post types block would not be preserved on subsequent page loads</li>\n</ul>\n<h4>2.4.0</h4>\n<ul>\n<li>Added border and border radius settings on all blocks (except Tabs and Accordion).</li>\n<li>Added box shadow settings on all blocks (except Tabs and Accordion).</li>\n<li>Fixed an issue where custom classes would make some blocks break their styling.</li>\n<li>Various editor UI fixes.</li>\n</ul>\n<h4>2.3.2</h4>\n<ul>\n<li>Added link in image block.</li>\n<li>Update Container block to work on WordPress 5.4</li>\n<li>Added the ability to rearrange columns within the container block.</li>\n<li>Fix container and column block hover controls from being inaccessible.</li>\n</ul>\n<h4>2.3.1</h4>\n<ul>\n<li>\n<p>Skipped.</p>\n</li>\n<li>\n<p>Added New buttons block.</p>\n</li>\n</ul>\n<h4>2.3.0</h4>\n<ul>\n<li>Added New buttons block.</li>\n<li>Added background overlay option for the container block.</li>\n<li>Added responsive alignment options for the Heading / Paragraph blocks.</li>\n<li>Added background color and spacing controls in image box and icon box blocks.</li>\n<li>Added transformations from Heading to Paragraph and Paragraph to Heading.</li>\n<li>Fixed an issue where the slider controls value would keep resetting on input blur.</li>\n<li>Override fixed image attachment when in mobile.</li>\n<li>Minor aesthetic fixes.</li>\n<li>Container alignment settings now will inherit its desktop values over to the smaller breakpoints unless explicitly overridden.</li>\n<li>Fixed single column width in container block to be 100%</li>\n<li>Fixed visual alignment issues in image box and icon box blocks.</li>\n<li>Fixed image attachment setting to be reverted when in mobile breakpoints.</li>\n<li>Updated all block icons.</li>\n<li>Fixed slideshow block.</li>\n<li>Add new paragraph when return is pressed for GutenBee paragraph and heading blocks.</li>\n<li>Fixed an issue with the Google Maps block where it would break in the editor if the height was adjusted.</li>\n</ul>\n<h4>2.2.0</h4>\n<ul>\n<li>Added new video block.</li>\n<li>Added responsive settings for blocks: ImageBox, Icon, IconBox.</li>\n<li>Fixed responsive styles. Unset properties will not get applied.</li>\n<li>Added font size in Heading block.</li>\n<li>Fixed issue where Post Types block wouldn&#8217;t respect WooCommerce&#8217;s products visibility option.</li>\n<li>Grouped block options in more relevant sections.</li>\n<li>Fixed incorrect wording on labels.</li>\n</ul>\n<h4>2.1.0</h4>\n<ul>\n<li>Added new blocks: Container, Heading, Paragraph, Image, Spacer, Post Types.</li>\n</ul>\n<h4>2.0.9</h4>\n<ul>\n<li>Added new blocks: Accordion, Countdown, CountUp, Google Maps, Icon, Icon Box, Image Box, Image Comparison, Justified Gallery, Progress Bar, Slideshow, Tabs.</li>\n<li>Removed the Spacer block.</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Initial release.</li>\n</ul>\n"
    },
    "short_description": "GutenBee enhances the Gutenberg editor with more blocks!",
    "description": "<p><a href=\"https://www.cssigniter.com/plugins/gutenbee/\" rel=\"nofollow ugc\">GutenBee is a collection of elegant WordPress blocks</a> enhancing your editing experience in the Gutenberg editor and vastly extending the potential of the new editor experience.</p>\n<p>Check out <a href=\"https://www.cssigniter.com/gutenbee/\" rel=\"nofollow ugc\">the demo</a> now!</p>\n<p>The plugin&#8217;s documentation can be found <a href=\"https://www.cssigniter.com/docs/gutenbee/\" rel=\"nofollow ugc\">here</a>.</p>\n<p>Here&#8217;s the demo of one of our latest blocks, the Food Menu block</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Wv_zwREKi68?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><strong>Blocks:</strong></p>\n<ul>\n<li><strong>Accordion</strong>: Organize your content into accordion elements. All the content including titles can be edited directly in the WordPress editor and you can choose any color combination from the block’s settings.</li>\n<li><strong>Banner</strong>: Create beautiful and flexible banners on your site to capture user attention. Supports video backgrounds.</li>\n<li><strong>Buttons</strong>: Actionable content needs clickable buttons. Add one or more buttons, tweak their colors, borders and alignment and you&#8217;re all set!</li>\n<li><strong>Container</strong>: A powerful container block allowing content grouping or splitting in columns, complete with fully responsive settings.</li>\n<li><strong>Countdown</strong>: Have an upcoming event? Pick a date directly inside the editor screen, choose your layout, colors, and typography and you’re ready!</li>\n<li><strong>CountUp</strong>: Maybe not every block counts, but this one does! Pick a starting and ending number, add a suffix or prefix, style it and you’re done!</li>\n<li><strong>Divider</strong>: Provide thematic content spacing with a fancy divider, edit its style, colors, and margins.</li>\n<li><strong>Food Menu</strong>: Display your dishes and drink offerings in a stylish fashion.</li>\n<li><strong>Google Maps</strong>: Easy-peasy fancy maps with the Google Maps block. Just enter a location and save, it just works! With support for beautiful predefined map styles and Snazzy custom map styles!</li>\n<li><strong>Heading</strong>: A normal heading block with responsive settings.</li>\n<li><strong>Icon</strong>: Display icons from a custom designed, curated list of over one hundred icons, with more icons being added in regular updates!</li>\n<li><strong>Icon Box</strong>: Your standard icon box block on steroids. Choose from over one hundred custom designed icons, style them any way and at any size you like, add some text and you’re good to go.</li>\n<li><strong>Icon List</strong>: Create lists with beautiful icons instead of bullets.</li>\n<li><strong>Image</strong>: A variation of the core Image block with extra responsive spacing and sizing settings.</li>\n<li><strong>Image Box</strong>: A standard image box with title and text block on steroids. Adjust your spacing, layout, alignment, or colors and typography.</li>\n<li><strong>Image Comparison</strong>: Need to showcase your photo editing skills or writing up a camera review? With the Image Comparison block you can enhance your posts with side-by-side comparison of any two photos you wish.</li>\n<li><strong>Justified Gallery</strong>: Create beautiful justified grid layout galleries inside any of your post or pages.</li>\n<li><strong>Paragraph</strong>: A variation of the core Paragraph block with responsive spacing settings.</li>\n<li><strong>Progress Bar</strong>: Add stylish progress bars and display either progress or your skillset with the most visually captivating way.</li>\n<li><strong>Review</strong>: Transform any post into a review. Score items individually, and average them out automatically.</li>\n<li><strong>Slideshow</strong>: Add a fancy slideshow to your posts or pages. Drag and drop your images, choose your settings and hit publish!</li>\n<li><strong>Spacer</strong>: Complete control spacing of elements in your posts and pages with the responsive Spacer block.</li>\n<li><strong>Tabs</strong>: Organize your content into fancy tabs. All the content including titles can be edited directly in the WordPress editor and you can choose any color combination from the block’s settings.</li>\n<li><strong>Testimonial</strong>: An easy to use block to help you display your testimonials with multiple layouts.</li>\n<li><strong>Post Types</strong>: List posts from any post type in a configurable grid, complete with fully responsive settings.</li>\n<li><strong>Video</strong>: Embed a video from your media library or upload a new one.</li>\n<li><strong>Video Embed</strong>: Embed videos from YouTube or Vimeo and lazy-load theme if you wish to.</li>\n</ul>\n<p><strong>JOIN OUR COMMUNITY</strong><br />\nJoin our <a href=\"https://www.facebook.com/groups/2601788933169108\" rel=\"nofollow ugc\">Facebook group</a> to discuss new features and stay up to date on our latest releases.</p>\n<p><strong>Contribute</strong><br />\nVisit the <a href=\"https://github.com/cssigniter/gutenbee\" rel=\"nofollow ugc\">GitHub repository</a> for full source code and to report any bugs.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/gutenbee.2.18.0.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/gutenbee/assets/screenshot-1.jpg?rev=2917794",
            "caption": "GutenBee's fancy new blocks."
        },
        {
            "src": "https://ps.w.org/gutenbee/assets/screenshot-2.jpg?rev=2917794",
            "caption": "Display your photos in beautiful slideshows."
        },
        {
            "src": "https://ps.w.org/gutenbee/assets/screenshot-3.jpg?rev=2917794",
            "caption": "Create awesome looking justified galleries."
        },
        {
            "src": "https://ps.w.org/gutenbee/assets/screenshot-4.jpg?rev=2917794",
            "caption": "Compare any two images."
        },
        {
            "src": "https://ps.w.org/gutenbee/assets/screenshot-5.jpg?rev=2917794",
            "caption": "Flexible Google Maps block with custom map styles."
        },
        {
            "src": "https://ps.w.org/gutenbee/assets/screenshot-6.jpg?rev=2917794",
            "caption": "Over a hundred icons to choose from with more being added regularly."
        },
        {
            "src": "https://ps.w.org/gutenbee/assets/screenshot-7.jpg?rev=2917794",
            "caption": "Tabs or Accordions, group your content the way you want."
        }
    ],
    "tags": {
        "blocks": "blocks",
        "gutenberg": "gutenberg"
    },
    "stable_tag": "2.18.0",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/gutenbee.1.0.0.zip",
        "2.0.9": "https://downloads.wordpress.org/plugin/gutenbee.2.0.9.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/gutenbee.2.1.0.zip",
        "2.10.0": "https://downloads.wordpress.org/plugin/gutenbee.2.10.0.zip",
        "2.10.1": "https://downloads.wordpress.org/plugin/gutenbee.2.10.1.zip",
        "2.10.2": "https://downloads.wordpress.org/plugin/gutenbee.2.10.2.zip",
        "2.10.3": "https://downloads.wordpress.org/plugin/gutenbee.2.10.3.zip",
        "2.10.4": "https://downloads.wordpress.org/plugin/gutenbee.2.10.4.zip",
        "2.10.5": "https://downloads.wordpress.org/plugin/gutenbee.2.10.5.zip",
        "2.10.6": "https://downloads.wordpress.org/plugin/gutenbee.2.10.6.zip",
        "2.11.0": "https://downloads.wordpress.org/plugin/gutenbee.2.11.0.zip",
        "2.11.1": "https://downloads.wordpress.org/plugin/gutenbee.2.11.1.zip",
        "2.12.0": "https://downloads.wordpress.org/plugin/gutenbee.2.12.0.zip",
        "2.12.1": "https://downloads.wordpress.org/plugin/gutenbee.2.12.1.zip",
        "2.12.2": "https://downloads.wordpress.org/plugin/gutenbee.2.12.2.zip",
        "2.12.3": "https://downloads.wordpress.org/plugin/gutenbee.2.12.3.zip",
        "2.12.4": "https://downloads.wordpress.org/plugin/gutenbee.2.12.4.zip",
        "2.12.5": "https://downloads.wordpress.org/plugin/gutenbee.2.12.5.zip",
        "2.13.0": "https://downloads.wordpress.org/plugin/gutenbee.2.13.0.zip",
        "2.13.1": "https://downloads.wordpress.org/plugin/gutenbee.2.13.1.zip",
        "2.14.0": "https://downloads.wordpress.org/plugin/gutenbee.2.14.0.zip",
        "2.15.0": "https://downloads.wordpress.org/plugin/gutenbee.2.15.0.zip",
        "2.16.0": "https://downloads.wordpress.org/plugin/gutenbee.2.16.0.zip",
        "2.16.1": "https://downloads.wordpress.org/plugin/gutenbee.2.16.1.zip",
        "2.17.1": "https://downloads.wordpress.org/plugin/gutenbee.2.17.1.zip",
        "2.17.2": "https://downloads.wordpress.org/plugin/gutenbee.2.17.2.zip",
        "2.17.3": "https://downloads.wordpress.org/plugin/gutenbee.2.17.3.zip",
        "2.17.4": "https://downloads.wordpress.org/plugin/gutenbee.2.17.4.zip",
        "2.18.0": "https://downloads.wordpress.org/plugin/gutenbee.2.18.0.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/gutenbee.2.2.0.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/gutenbee.2.3.0.zip",
        "2.3.2": "https://downloads.wordpress.org/plugin/gutenbee.2.3.2.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/gutenbee.2.4.0.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/gutenbee.2.5.0.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/gutenbee.2.6.0.zip",
        "2.6.1": "https://downloads.wordpress.org/plugin/gutenbee.2.6.1.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/gutenbee.2.6.2.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/gutenbee.2.7.0.zip",
        "2.8.0": "https://downloads.wordpress.org/plugin/gutenbee.2.8.0.zip",
        "2.8.1": "https://downloads.wordpress.org/plugin/gutenbee.2.8.1.zip",
        "2.9.0": "https://downloads.wordpress.org/plugin/gutenbee.2.9.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/gutenbee.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/gutenbee/assets/banner-772x250.png?rev=2917794",
        "high": "https://ps.w.org/gutenbee/assets/banner-1544x500.png?rev=2917794"
    },
    "icons": {
        "1x": "https://ps.w.org/gutenbee/assets/icon-128x128.png?rev=2917794",
        "2x": "https://ps.w.org/gutenbee/assets/icon-256x256.png?rev=2917794"
    },
    "blocks": {
        "gutenbee/post-types": {
            "name": "gutenbee/post-types",
            "title": "Post Types"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "gutenbee",
            "language": "el",
            "version": "2.18.0",
            "updated": "2021-10-07 13:11:42",
            "package": "http://downloads.wordpress.org/translation/plugin/gutenbee/2.18.0/el.zip"
        },
        {
            "type": "plugin",
            "slug": "gutenbee",
            "language": "fa_IR",
            "version": "2.18.0",
            "updated": "2021-12-25 09:10:11",
            "package": "http://downloads.wordpress.org/translation/plugin/gutenbee/2.18.0/fa_IR.zip"
        }
    ]
}