{
    "name": "Interactive Content – H5P",
    "slug": "h5p",
    "version": "1.16.0",
    "author": "<a href=\"http://joubel.com\">Joubel</a>",
    "author_profile": "https://profiles.wordpress.org/icc0rz/",
    "contributors": {
        "icc0rz": {
            "profile": "https://profiles.wordpress.org/icc0rz/",
            "avatar": "https://secure.gravatar.com/avatar/7067780e4575b0e65b09dc6f647e886a?s=96&d=monsterid&r=g",
            "display_name": "icc0rz"
        },
        "fnoks": {
            "profile": "https://profiles.wordpress.org/fnoks/",
            "avatar": "https://secure.gravatar.com/avatar/6b42ff8841f00a2f5481cedea8da4319?s=96&d=monsterid&r=g",
            "display_name": "fnoks"
        },
        "falcon28": {
            "profile": "https://profiles.wordpress.org/falcon28/",
            "avatar": "https://secure.gravatar.com/avatar/442a8397123602775eb43e0055d24079?s=96&d=monsterid&r=g",
            "display_name": "falcon28"
        },
        "underhaug": {
            "profile": "https://profiles.wordpress.org/underhaug/",
            "avatar": "https://secure.gravatar.com/avatar/df1c3ba99007fd7d285d9117acf977ee?s=96&d=monsterid&r=g",
            "display_name": "underhaug"
        }
    },
    "requires": "3.8.1",
    "tested": "6.6.2",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 96,
    "ratings": {
        "5": 54,
        "4": 1,
        "3": 2,
        "2": 0,
        "1": 2
    },
    "num_ratings": 59,
    "support_url": "https://wordpress.org/support/plugin/h5p/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 40000,
    "last_updated": "2024-10-10 13:06:00",
    "added": "2014-05-15",
    "homepage": "http://h5p.org/wordpress",
    "sections": {
        "description": "<p>One of the great benefits with using H5P is that it gives you access to lots of different <a href=\"https://h5p.org/content-types-and-applications\" title=\"Examples and Downloads\" rel=\"nofollow ugc\">interactive content types</a>, such as presentation, interactive video, memory game, quiz, multiple choice, timeline, collage, hotspots, drag and drop, cloze test (fill in the blanks), personality quiz, accordion, flash cards, audio recorder.</p>\n<p>Another great benefit with H5P is that it allows you to easily share and reuse content. To use content created with H5P, you simply insert a shortcode <code>[h5p Id=\"1\"]</code> where you wish for the content to appear. To reuse content, you just download the H5P you would like to edit and make your changes – e.g. translate to a new language or adjust it to a new situation.</p>\n<p>H5P is:</p>\n<ul>\n<li>Open Source</li>\n<li>Free to Use</li>\n<li>HTML5</li>\n<li>Responsive</li>\n</ul>\n<p>The H5P community is actively contributing to improve H5P. Updates and new features are continuously made available on the community portal <a href=\"https://h5p.org\" title=\"H5P\" rel=\"nofollow ugc\">H5P.org</a>.</p>\n<p>View our <a href=\"https://h5p.org/documentation/setup/wordpress\" title=\"Setup H5P for WordPress\" rel=\"nofollow ugc\">setup for WordPress</a> to get information on how to get started with H5P.</p>\n<h4>GDPR Compliance</h4>\n<p>Information useful to help you achieve GDPR compliance while using this plugin can be found at <a href=\"https://h5p.org/plugin-gdpr-compliance\" title=\"GDPR Compliance\" rel=\"nofollow ugc\">H5P.org&#8217;s GDPR Compliance</a> page.</p>\n",
        "installation": "<ol>\n<li>Download and extract the package</li>\n<li>Put the <code>h5p</code> folder in your <code>/wp-content/plugins/</code> directory</li>\n<li>Navigate to the WordPress installation in your web browser</li>\n<li>Login and active the plugin</li>\n</ol>\n<p>If you&#8217;re cloning this plugin from GitHub, remember to get the sub modules as well:<br />\n    git submodule update &#8211;init &#8211;recursive</p>\n",
        "changelog": "<h4>1.0</h4>\n<p>This is the first release of this plugin.</p>\n<h4>1.1</h4>\n<p>Imported the latest changes and bug fixes from h5p core.<br />\nImproved multilingual support. Added missing translations, and it should now be possible to translate the menu item without ruining the H5P forms.<br />\nFixed so that content dependencies cache is rebuilt when library dependencies changes. This also includes new export files.<br />\nThe H5P Editor is now inside an iframe to avoid messing up css styling.<br />\nA library administration user interface has been added. This supports content upgrades, deletion of libraries without content and uploading h5p packages without content.<br />\nAdded own h5p capabilities to roles, matching the defaults used for posts.<br />\nFixed bugs related to Windows paths and when debugging is enabled with notices.<br />\nOther minor bug fixes and improvements.</p>\n<h4>1.2</h4>\n<p>Added user results tracking and views for H5Ps. Can be disabled through settings.<br />\nRe-adding capabilities. Now adds to roles which have the default WP capabilities. Should fix issues for users which has changed the default roles.<br />\nUpdated views for viewing all content and inserting H5P into posts or pages. These are now paginated and can be filtered and sorted as needed.<br />\nAdded the ability to restrict creation of certain content types through the libraries administration UI.<br />\nImplemented function which will fetch meta data updates for content types(libraries) from H5P.org. This can be disabled through the settings interface. Currently it will only display links for tutorials when creating content, but in the future it might fetch information about new versions and upgrades.<br />\nOther minor bug fixes and improvements.</p>\n<h4>1.2.1</h4>\n<p>Fixed JavaScript error when the users doesn&#8217;t have access to the currently selected library. (It has been restricted.)<br />\nMade sure the whole copyrights dialog always is visible.<br />\nFixed pagination translation.</p>\n<h4>1.2.2</h4>\n<p>Fixed support for multi-site setups(network).<br />\nFixed issue when repacking h5p files after dependencies have changed, old libraries was still in the pack.<br />\nAdded missing string to translation.<br />\nFixed code causing PHP notices.<br />\nAdded H5P_DEV option. Can be set in wp-config to always override libraries when &#8220;new&#8221; ones are uploaded.</p>\n<h4>1.3.0</h4>\n<p>Added mini tutorial after activating plugin.<br />\nFixed issues with tmp directories on multi-hosted environments.<br />\nAdded H5P option to the admin bar&#8217;s new menu.<br />\nImproved plugin description and tags.<br />\nFixed issues with uploading and deleting libraries for php builds that doesn&#8217;t support INPUT_SERVER.<br />\nRemoved cleanup warnings when there&#8217;s no dir to clean.<br />\nUpdated to latest version of core, now supporting xAPI. [!]<br />\nH5P now has its own event system better suited for OO.<br />\nLibraries are now loaded in the same order as they are required by content types.<br />\nImproved the performance of the editor by reduced ajax requests.<br />\nSupport for external video sources and using video URLs from YouTube. [!]<br />\nYouTube integration (also requires updated libraries)<br />\nSupport for external video files<br />\nOther minor bug fixes.<br />\n[!] Only work with the latest version of the content types. Find upgrades at http://h5p.org/update-all-content-types</p>\n<h4>1.4.0</h4>\n<p>Added support for external embed.<br />\nUpdated default sorting on H5P tables, making it easier to find recently modified content or new results.<br />\nAdded actions which make it easier for other plugins to alter content types.<br />\nAdded support for inputing target DOM node when initializing H5P, making it possible to &#8220;start&#8221; content loaded via AJAX.<br />\nRemoved deprecated version of font-awesome from plugin code.<br />\nOther minor fixes and code clean up.</p>\n<h4>1.4.1</h4>\n<p>Fixed some misplaced code that causes the &#8220;my results&#8221; page to fail.</p>\n<h4>1.5.0</h4>\n<p>Added support for configuring the frame and buttons around H5Ps.<br />\nIncreased the performance of the upgrade process.<br />\nImproved internal URL system, it&#8217;s no longer required to have allow_url_fopen enabled in PHP.<br />\nMade it possible to store the current state of content pr user. This allows logged in users to resume exercises where they left off.<br />\nImproved xAPI support.<br />\nItalian language support. Thanks to community member yeu for contributing.<br />\nOther minor adjustments and fixes.</p>\n<h4>1.5.1</h4>\n<p>Fixed support for hosting services that limit unique key lengths to 767 bytes.<br />\nAdded support for additional font styling if the content types allows it.<br />\nDon&#8217;t show copyright button if there is no copyright.<br />\nTry to generate generic copyrights if the content type doesn&#8217;t have custom copyrights.<br />\nFixed JS error on results and content list pages that doesn&#8217;t contain tables.<br />\nFixed wrong sorting on insert H5P media pop-up.<br />\nOther minor bug fixes and adjustments.</p>\n<h4>1.5.2</h4>\n<p>Added italian language support to the editor, and update plugin translation. (big thanks to yeu for both of theses!)<br />\nFixed editor list bugs. One where you can&#8217;t order list items downwards.<br />\nFixed so that libraries are loaded according to weight in the editor.<br />\nImproved the external event dispatcher. Now the this arg should be correct.<br />\nKeep the contents disable settings when re-saving after global options have changed. (More consistent and reliable)<br />\nFixed issue where the about H5P button disappears from content.<br />\nMinor improvement to content output filtering</p>\n<h4>1.5.3</h4>\n<p>Imporved error handling when uploading H5P libraries, courtesy of community user limikael.<br />\nCreated separate class for querying H5P content in case other plugins wish to use it.<br />\nUpdated hooks for altering semantics, parameters, scripts and styles. See http://h5p.org/wordpress-customization for more information.<br />\nFixed actor for xAPI events.<br />\nUpload is selected by default if there&#8217;s no content.<br />\nOther minor bug fixes and adjustments.</p>\n<h4>1.5.4</h4>\n<p>Added base class for content types.<br />\nAdded duration, scaled and details about content type to xAPI.<br />\nAdded html class when content is framed.<br />\nMinor improvements for some UI strings to allow translation.<br />\nRemoved all utf-8 nbsp in the code.<br />\nFixed .off() wasn&#8217;t working for the event dispatcher.<br />\nAdded text-align support to wysiwyg.<br />\nImproved iframe communication, use parent instead of top.<br />\nMinor improvements to fullscreen and embed.<br />\nAdded Spanish translations.<br />\nAdded French translations.<br />\nMinor bugfixes and improvements to the editor.</p>\n<h4>1.5.5</h4>\n<p>Added auto-install of basic content types.<br />\nAdded notification when updates are available.<br />\nUse different temporary folder to avoid issues on certain hosts.<br />\nMade copyright fields translatable.<br />\nAdded workaround for bug when changing library in Chrome on Windows.<br />\nImproved semi-fullscreen for iPad devices.<br />\nAvoid warning message when allow_url_fopen=0.<br />\nUpdated various text strings and translations.<br />\nImproved editor design and fixed minor bugs in the editor.<br />\nPrepared for copy and paste support in the editor.<br />\nSmarter resize script when embedding. Less flickering.</p>\n<h4>1.5.6</h4>\n<p>Improved saving of current content state when leaving the page.<br />\nFixed issues with external embed resizing script.<br />\nImproved pasting of text in text editor/WYSIWYG.<br />\nFixed bug in video upload editor widget.</p>\n<h4>1.5.7</h4>\n<p>Handle WP errors when fetching updates.<br />\nAltered the &#8220;update only&#8221; feature to update minor and major versions as well, not just patch versions.<br />\nIncrease update download timeout to 28 seconds.<br />\nEncourage manual update if auto update fails.</p>\n<h4>1.6.0</h4>\n<p>Support for using slug instead of ID when inserting H5P content into posts, articles, etc. Thanks to Mikael Lindqvist for implementing this.<br />\nSupport for Simplified Chinese, thanks to Wen for contributing.<br />\nUse core library when deleting content. (simplifies code)<br />\nImproved file handling through core library. (simplifies code)<br />\nSupport for aggregating JavaScript and CSS through core library. Set H5P_DISABLE_AGGREGATION to disable.<br />\nImplemented system for logging H5P events. No UI yet.<br />\nImproved communications with H5P.org. Added clearer messages on how to disable.<br />\nAdded shortcode info to content pages.<br />\nImproved AJAX requests and error handling.<br />\nAdded a simple autoloader to make coding easier.<br />\nAdded support for tagging H5P content. Makes it easier to organize.<br />\nImproved user notification messages.<br />\nFixed broken library delete. (when managing libraries)<br />\nVarious bug fixes.</p>\n<h4>1.6.1</h4>\n<p>Fixed issue with content list on multi-site installations.</p>\n<h4>1.6.2</h4>\n<p>Fixed broken pagination for H5P content list.<br />\nReset page number when filtering in the H5P content list.<br />\nRemoved notice when content without stylesheets are aggregated.</p>\n<h4>1.7.0</h4>\n<p>Added custom HTML confirmation dialog.<br />\nAdded German translation, thanks to herrmayr.<br />\nAdded version numbers and links to licenses.<br />\nAdded handling of several digits in the major and minor versions of libraries.<br />\nAdded highlighting of required fields in the editor.<br />\nEnhanced action bar buttons for accessibility.<br />\nImproved some error messages that didn&#8217;t make much sense in the editor.<br />\nCorrected typos in Core spec and readme, thanks to Marc Laporte.<br />\nCorrected documentation in Core, thanks to Dave Richer.<br />\nFixed pagination widget to handle empty pages.<br />\nBugfix to avoid warnings on some systems when Cron cleans up tmp files.<br />\nJoined some CSS files to reduce the number of resources that&#8217;s loaded in the editor.<br />\nFixed number conversion before comparing versions in Content Upgrade.<br />\nFixed centering of CKEditor dialog in the editor.<br />\nFixed bug when trying to disable external communication.<br />\nFixed so that all the H5P tables are removed on uninstall.<br />\nFixed bug with messages displayed.<br />\nMinor text string corrections.<br />\nMinor visual enhancements.</p>\n<h4>1.7.1</h4>\n<p>Fixed video widget in editor not printing correct error message.</p>\n<h4>1.7.2</h4>\n<p>Reassign capabilities when enabling multisite. Will revert caps when changing back to single site.<br />\nBaked H5PEditor image styles into SCSS.<br />\nEditor: Don&#8217;t display copyright button until an image is added.<br />\nAdded Turkish translation – Thanks to hakangur at h5p.org for contributing.<br />\nUpdated French translation – Thanks to Realia at h5p.org.<br />\nAdded Polish translation for Editor – Thanks to k.kwasniewski at h5p.org and eTechnologie.<br />\nAdded l10n support for insert video widget – Also, updated texts to make them easier to understand.<br />\nAllow hyphens in HTML tags – Thanks to andyrandom at drupal.org.<br />\nxAPI – Avoid errors when browser cookies are disabled.<br />\nFixed unnecessary ajax calls.</p>\n<h4>1.7.3</h4>\n<p>Fixed class missing from autoloader.<br />\nAdded missing variable from uninstall.<br />\nAdded Bosnian translation, big thanks to sabahuddin on GitHub.<br />\nIncrease H5P API version to 1.9<br />\nAdded support for optional select in semantics.<br />\nAdded option for enabling LRS content types.<br />\nFixed text strings lacking translation support. (editor)<br />\nAdded support for the same common fields from multiple libraries in the same editor.</p>\n<h4>1.7.4</h4>\n<p>Exec ready callbacks when view is ready</p>\n<h4>1.7.5</h4>\n<p>Fixed backwards-compatible change in editor</p>\n<h4>1.7.6</h4>\n<p>Fixed loading of language files for content types</p>\n<h4>1.7.7</h4>\n<p>Makes it possible for a group semantics to have a sub content id<br />\nAdds semi full screen functionality<br />\nIncreases H5P API version to 1.11</p>\n<h4>1.7.8</h4>\n<p>Visual improvements for the editor<br />\nImprovements for the settings controlling the action button toolbar below each content.<br />\nIncreases H5P API version to 1.12<br />\nFixed untranslatable string, big thanks to Joseph Rezeau for finding and fixing these.</p>\n<h4>1.7.9</h4>\n<p>Fix compability with PHP &lt;5.4<br />\nBig thanks to andyrandom at drupal.org for providing the fix.</p>\n<p><h4>1.7.10</h4>\n</p>\n<p>Fixed bug where you could not have a custom user table.<br />\nInternal changes to improve how files are handled.<br />\nEnhanced language code compatibility.<br />\nAdded custom xAPI verbs for action toolbar buttons. This will make it possible to track the number of downloads.<br />\nAdded Dutch translation for plugin. Thanks to Qsento!<br />\nUpdated French translation for plugin. Thanks to Joseph Rezeau!<br />\nAdded Dutch translation for editor. Thanks to otacke!</p>\n<h4>1.7.11</h4>\n<p>Fixed fieldset overflow bug in Editor.</p>\n<h4>1.7.12</h4>\n<p>Fixed issue when generating export for some sites where the web server would report a false document_root.</p>\n<h4>1.7.13</h4>\n<p>Fixed editor issue related to a problem with fieldsets in IE (not able to expand)</p>\n<h4>1.8.0</h4>\n<p>Added H5P Hub interface for selecting and installing content types<br />\nImproved requirements checking<br />\nAdded support for important description in editor<br />\nMinor improvements and bug fixes</p>\n<h4>1.8.1</h4>\n<p>Removed functions dependendant on PHP &gt;5.4.</p>\n<h4>1.8.3</h4>\n<p>Fixed support for combining header styles with other text formating options.<br />\nAdded .wav files to whitelist.<br />\nAdded video quality naming option (currently, only used by Interactive Video).<br />\nOnly allow for a single video source when using YouTube (others doesn&#8217;t work).<br />\nImproved keyboard navigation with H5P Hub.<br />\nUpdated NL and DE translations.<br />\nOther minor bug fixes and improvements.</p>\n<h4>1.8.4</h4>\n<p>Changed H5P&#8217;s weight in the &#8216;Create New&#8217; menu to avoid always being place on top.<br />\nImproved SQL mode compatibility.<br />\nImproved requirement checks compatibility with different PHP versions.<br />\nAdded version selector for the different licenses.<br />\nAdded support for localized licenses.<br />\nMinor code improvements in core.<br />\nUpdated translations.<br />\nMinor design layout improvements in editor.<br />\nAdded external event for when changing and loading library in editor.</p>\n<h4>1.9.0</h4>\n<p>Improved H5P Hub error handling.<br />\nRemoved warnings in PHP 7.0+ when checking requirements due to bytes conversion.<br />\nAdded version selector when selecting content license.<br />\nAdded support for localizing content licenses.<br />\nMade the built-in fullscreen button keyboard accessible.<br />\nImproved the confirmation dialog positioning.<br />\nImproved the handling of temporary files as they&#8217;re uploaded.<br />\nAdded vtt and webvtt to the default file upload whitelist.<br />\nImproved font-family validation regex pattern. Big thanks to Cornel Les.<br />\nMoved the list description text to be consistent with other editor fields.<br />\nImproved the YouTube regexp matching pattern. Big thanks to Otacke!<br />\nImproved copyright button for media fields.<br />\nImproved editor number fields to support feedback ranges.<br />\nImproved editor number fields error messages to be consistent with other fields.<br />\nRemoved update button in H5P Hub when the users doesn&#8217;t have access to upated libraries.<br />\nOther minor editor improvements.<br />\nFixed support for absolute URLs for content types embedded through div.</p>\n<h4>1.9.1</h4>\n<p>Fixed content not loading due to wrong URL for multisites on the same domain. Big thanks to Joachim Happel for contributing the fix.</p>\n<h4>1.9.2</h4>\n<p>Fixed &#8216;div&#8217; content not loading on sites residing in sub directories, changes fix for multisites as well.</p>\n<h4>1.9.3</h4>\n<p>Improved the fix introduced in 1.9.2 as it was not tested well enough.</p>\n<h4>1.9.4</h4>\n<p>Something went wrong with the release of 1.9.3.</p>\n<h4>1.10.0</h4>\n<p>Adds more detailed error messages with links for troubleshooting them.<br />\nPrevent deleting sub content of linked directories.<br />\nNew action for adding head tags to embed page.<br />\nFixed PHP warnings when trying to view deleted content.<br />\nUpdated CKEditor to version 4.7.3.<br />\nAdded Greek translations (thanks to xarhsdev).<br />\nAdded Finnish translations (thanks to Janne Särkelä).<br />\nAdded support for editor iframe reloading.<br />\nAllow multiple content to be loaded at the same time.<br />\nRefactor of the Content Type Selector(Hub); big UX and performance improvements .<br />\nUpdated translations.</p>\n<h4>1.10.1</h4>\n<p>Fix issue with editor not saving correctly in Safari 11.<br />\nFix missing translation and some PHP notices.</p>\n<h4>1.10.2</h4>\n<p>Add support for the new Privacy APIs added in the latest WordPress. (retrieving and deleting user data upon request)<br />\nAdd an opt-in option for statistics for first time users of the plugin.<br />\nUpdate the French translation, big thanks to knowledgeplaces on GitHub!<br />\nRestricted some new content type in case an LRS isn&#8217;t used.<br />\nAdd support for the latest H5P Core version.<br />\nVarious minor bug fixes</p>\n<h4>1.10.3</h4>\n<p>Fix compatibility with PHP &lt;5.4</p>\n<p><h4>1.11.0</h4>\n</p>\n<p>Added the new metadata system to H5P<br />\nAdded support for Copy and Paste inside H5PEditor (No cross-site support)<br />\nAdded support for addons (e.g. Mathdisplay)<br />\nAdded Russian translation. Big thanks to Александр Шульгин<br />\nAdded Arabic translation. Big thanks to omniasaid<br />\nUpdated Turkish translation. Big thanks to hakangur<br />\nUpgraded CKEditor inside H5PEditor<br />\nAdded Bosnian translation to H5PEditor. Big thanks to Sabahuddin<br />\nUpdated German translation in H5PEditor. Big thanks to Sebastian Rettig<br />\nUpdated French translations in H5PEditor. Big thanks to knowledgeplaces<br />\nUpdated Arabic translations in H5PEditor. Big thanks to smartwayme<br />\nUpdated Polish translations in H5PEditor. Big thanks to Andrzej Pieńkowski<br />\nAdded brazilian portuguese translation in H5PEditor. Big thanks to Juliano Navroski Junior<br />\nUpdated Turkish translations in H5PEditor. Big thanks to Adem Özgür<br />\nFix appropriate separator for AJAX URLs in H5PEditor. Big thanks to Miika Langille<br />\nMinor bug fixes and improvements to H5PEditor and Core</p>\n<h4>1.11.1</h4>\n<p>Fixed serious bug when loading editor translations for some languages.</p>\n<h4>1.11.2</h4>\n<p>Fix compatibility with PHP &lt;5.4</p>\n<p><h4>1.11.3</h4>\n</p>\n<p>Fix &#8220;common fields&#8221; issue when switching between content types.<br />\nFix resizing bug for iframe embeds.<br />\nFix issue with temporary files.</p>\n<h4>1.12.0</h4>\n<p>Improved API for better support with PressBooks.<br />\nAdded Copy/Paste support for single libraries in Editor.<br />\nAdded support for semi-fullscreen in Editor. (used in Branching Scenario)<br />\nAdded support for Audio Recorder in default audio widget. (used in Memory Game)<br />\nImproved group summaries in Editor.<br />\nFix reset of all subContentIds when using Copy/Paste.<br />\nRemoved caching of pasted content to ensure objects are cloned.<br />\nRemoved support for base64 &#8220;uploads&#8221; in Core. (All uploads should be blobs or files)<br />\nOther minor Editor &amp; Core improvements.<br />\nUpdated translations, a big thanks to all contributors.</p>\n<h4>1.13.0</h4>\n<p>Added automated upgrade of content on save.<br />\nImproved error handling for content upgrade.<br />\nAdded support for language switching in editor.<br />\nAdded a new reuse dialog for download or copy of content in view.</p>\n<h4>1.13.1</h4>\n<p>Fix correct default language not always loading.</p>\n<h4>1.14.0</h4>\n<p>Added fullscreen editing mode<br />\nAdded offline support for storing and resubmitting answers<br />\nAllow setting bitrate for video files<br />\nImproved cross origin handling for media files</p>\n<h4>1.14.1</h4>\n<p>Fix invalid finnish language issue in core</p>\n<h4>1.15.0</h4>\n<p>Removed GitHub URL to prevent Update plugins using it and download the plugin without dependencies.<br />\nAdded capabilities for viewing h5p content. Thanks Otacke.<br />\nFixed missing NOT NULL causing errors on some configurations.<br />\nImproved list layout for narrow screens. Thanks Otacke.<br />\nChange how focus effect is applied when only using mouse cursor.<br />\nMinor accessibility improvements to editor.<br />\nUpdated language files. Big thanks to all the contributors.</p>\n<h4>1.15.1</h4>\n<p>Fixed PHP version 8 compatibility<br />\nAllow for separate accessibility title for content<br />\nUpdated translations<br />\nImproved attribute filtering performance</p>\n<h4>1.15.2</h4>\n<p>Fixed inconsistent variable naming</p>\n<h4>1.15.3</h4>\n<p>Update CKEditor to the latest 4.x version.</p>\n<h4>1.15.4</h4>\n<p>Update CKEditor to 4.17.1</p>\n<h4>1.15.5</h4>\n<p>Improve data loading by fetching user data in a separate query rather than joining wp_users. This will allow for storing data across multiple databases.<br />\nUpdated regexp to handle edge cases<br />\nUpdated translations</p>\n<h4>1.15.6</h4>\n<p>Fix bug when loading user result lists.<br />\nImprove cleanup of exported files on delete.</p>\n<h4>1.15.7</h4>\n<p>Change h5p_content_type_cache_updated_at into a network setting. Thanks n-goncalves.<br />\nFix sorting contents by author. Thanks Otacke.<br />\nFix query issue in username search in user activity results. Thanks ir4klis.<br />\nFix permission check for installing recommended libraries only. Thanks Otacke.<br />\nImproved narrow data views. Thanks Otacke.<br />\nFix potential memory issue. Thanks Otacke.<br />\nFix not storing empty content state (resume) for some content types.<br />\nUpdated translations.</p>\n<h4>1.15.8</h4>\n<p>Improve file upload<br />\nUpdated translations.</p>\n<h4>1.16.0</h4>\n<p>Upgraded to CKEditor5 in editor.<br />\nAdded new expand-collapse feature to the editor.<br />\nAdded support for Echo360 video provider.<br />\nUpdated translations.</p>\n"
    },
    "short_description": "Create and add rich content to your website for free. Some examples of what you get with H5P are Interactive Video, Quizzes, Collage and Timeline.",
    "description": "<p>One of the great benefits with using H5P is that it gives you access to lots of different <a href=\"https://h5p.org/content-types-and-applications\" title=\"Examples and Downloads\" rel=\"nofollow ugc\">interactive content types</a>, such as presentation, interactive video, memory game, quiz, multiple choice, timeline, collage, hotspots, drag and drop, cloze test (fill in the blanks), personality quiz, accordion, flash cards, audio recorder.</p>\n<p>Another great benefit with H5P is that it allows you to easily share and reuse content. To use content created with H5P, you simply insert a shortcode <code>[h5p Id=\"1\"]</code> where you wish for the content to appear. To reuse content, you just download the H5P you would like to edit and make your changes – e.g. translate to a new language or adjust it to a new situation.</p>\n<p>H5P is:</p>\n<ul>\n<li>Open Source</li>\n<li>Free to Use</li>\n<li>HTML5</li>\n<li>Responsive</li>\n</ul>\n<p>The H5P community is actively contributing to improve H5P. Updates and new features are continuously made available on the community portal <a href=\"https://h5p.org\" title=\"H5P\" rel=\"nofollow ugc\">H5P.org</a>.</p>\n<p>View our <a href=\"https://h5p.org/documentation/setup/wordpress\" title=\"Setup H5P for WordPress\" rel=\"nofollow ugc\">setup for WordPress</a> to get information on how to get started with H5P.</p>\n<h4>GDPR Compliance</h4>\n<p>Information useful to help you achieve GDPR compliance while using this plugin can be found at <a href=\"https://h5p.org/plugin-gdpr-compliance\" title=\"GDPR Compliance\" rel=\"nofollow ugc\">H5P.org&#8217;s GDPR Compliance</a> page.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/h5p.1.16.0.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/h5p/assets/screenshot-1.png?rev=914489",
            "caption": "Simple editor to create interactive H5P content"
        },
        {
            "src": "https://ps.w.org/h5p/assets/screenshot-2.png?rev=914489",
            "caption": "Preview the H5P interactive content"
        },
        {
            "src": "https://ps.w.org/h5p/assets/screenshot-3.png?rev=914489",
            "caption": "Press Add H5P to add interactive H5P content to posts"
        },
        {
            "src": "https://ps.w.org/h5p/assets/screenshot-4.png?rev=1289859",
            "caption": "Choose among available interactive H5P content from the list"
        },
        {
            "src": "https://ps.w.org/h5p/assets/screenshot-5.png?rev=914489",
            "caption": "Interactive H5P content added to a post"
        },
        {
            "src": "https://ps.w.org/h5p/assets/screenshot-6.png?rev=914489",
            "caption": "View post with interactive H5P content."
        }
    ],
    "tags": {
        "editor": "editor",
        "education": "education",
        "quiz": "quiz",
        "slider": "slider",
        "video": "video"
    },
    "stable_tag": "1.16.0",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/h5p.1.0.0.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/h5p.1.1.0.zip",
        "1.14.0": "https://downloads.wordpress.org/plugin/h5p.1.14.0.zip",
        "1.14.1": "https://downloads.wordpress.org/plugin/h5p.1.14.1.zip",
        "1.15.7": "https://downloads.wordpress.org/plugin/h5p.1.15.7.zip",
        "1.15.8": "https://downloads.wordpress.org/plugin/h5p.1.15.8.zip",
        "1.16.0": "https://downloads.wordpress.org/plugin/h5p.1.16.0.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/h5p.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/h5p.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/h5p.1.2.2.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/h5p.1.3.0.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/h5p.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/h5p.1.4.1.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/h5p.1.7.4.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/h5p.1.7.5.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/h5p.1.7.6.zip",
        "1.7.7": "https://downloads.wordpress.org/plugin/h5p.1.7.7.zip",
        "trunk": "https://downloads.wordpress.org/plugin/h5p.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://h5p.org",
    "banners": {
        "low": "https://ps.w.org/h5p/assets/banner-772x250.png?rev=1628151",
        "high": "https://ps.w.org/h5p/assets/banner-1544x500.png?rev=1628151"
    },
    "icons": {
        "1x": "https://ps.w.org/h5p/assets/icon.svg?rev=986118",
        "svg": "https://ps.w.org/h5p/assets/icon.svg?rev=986118"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 96,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "h5p",
            "language": "de_DE_formal",
            "version": "1.16.0",
            "updated": "2023-08-05 23:16:31",
            "package": "https://downloads.wordpress.org/translation/plugin/h5p/1.16.0/de_DE_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "h5p",
            "language": "de_DE",
            "version": "1.16.0",
            "updated": "2023-10-31 22:14:35",
            "package": "https://downloads.wordpress.org/translation/plugin/h5p/1.16.0/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "h5p",
            "language": "es_MX",
            "version": "1.16.0",
            "updated": "2024-02-21 14:26:02",
            "package": "https://downloads.wordpress.org/translation/plugin/h5p/1.16.0/es_MX.zip"
        },
        {
            "type": "plugin",
            "slug": "h5p",
            "language": "es_CR",
            "version": "1.16.0",
            "updated": "2021-11-24 17:51:28",
            "package": "https://downloads.wordpress.org/translation/plugin/h5p/1.16.0/es_CR.zip"
        },
        {
            "type": "plugin",
            "slug": "h5p",
            "language": "fa_IR",
            "version": "1.16.0",
            "updated": "2022-02-17 15:26:37",
            "package": "https://downloads.wordpress.org/translation/plugin/h5p/1.16.0/fa_IR.zip"
        },
        {
            "type": "plugin",
            "slug": "h5p",
            "language": "fr_FR",
            "version": "1.16.0",
            "updated": "2021-03-09 13:37:43",
            "package": "https://downloads.wordpress.org/translation/plugin/h5p/1.16.0/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "h5p",
            "language": "it_IT",
            "version": "1.16.0",
            "updated": "2021-06-08 16:14:44",
            "package": "https://downloads.wordpress.org/translation/plugin/h5p/1.16.0/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "h5p",
            "language": "nb_NO",
            "version": "1.16.0",
            "updated": "2019-03-05 21:07:12",
            "package": "https://downloads.wordpress.org/translation/plugin/h5p/1.16.0/nb_NO.zip"
        },
        {
            "type": "plugin",
            "slug": "h5p",
            "language": "nl_BE",
            "version": "1.16.0",
            "updated": "2022-04-16 13:27:05",
            "package": "https://downloads.wordpress.org/translation/plugin/h5p/1.16.0/nl_BE.zip"
        },
        {
            "type": "plugin",
            "slug": "h5p",
            "language": "sk_SK",
            "version": "1.16.0",
            "updated": "2019-11-01 07:50:19",
            "package": "https://downloads.wordpress.org/translation/plugin/h5p/1.16.0/sk_SK.zip"
        }
    ]
}