{
    "name": "HT Easy GA4 &#8211; Google Analytics WordPress Plugin",
    "slug": "ht-easy-google-analytics",
    "version": "1.2.6",
    "author": "<a href=\"https://hasthemes.com/\">HasThemes</a>",
    "author_profile": "https://profiles.wordpress.org/htplugins/",
    "contributors": {
        "htplugins": {
            "profile": "https://profiles.wordpress.org/htplugins/",
            "avatar": "https://secure.gravatar.com/avatar/c7c8a9cf1910e24386e077013ccbd260?s=96&d=monsterid&r=g",
            "display_name": "HT Plugins"
        },
        "hasthemes": {
            "profile": "https://profiles.wordpress.org/hasthemes/",
            "avatar": "https://secure.gravatar.com/avatar/22ee3e159ea3ed29d8be77abc7b039a0?s=96&d=monsterid&r=g",
            "display_name": "HasThemes"
        },
        "zenaulislam": {
            "profile": "https://profiles.wordpress.org/zenaulislam/",
            "avatar": "https://secure.gravatar.com/avatar/c69c192ed037f0ecb74348a2bd06bdda?s=96&d=monsterid&r=g",
            "display_name": "Zenaul Islam"
        },
        "aslamhasib": {
            "profile": "https://profiles.wordpress.org/aslamhasib/",
            "avatar": "https://secure.gravatar.com/avatar/1edee2d43268eb35c68a09a01f77c90f?s=96&d=monsterid&r=g",
            "display_name": "Aslam Hasib"
        },
        "tarekht": {
            "profile": "https://profiles.wordpress.org/tarekht/",
            "avatar": "https://secure.gravatar.com/avatar/781d3e5bf0e40ed19369ba7c50b173c0?s=96&d=monsterid&r=g",
            "display_name": "Tarek Aziz"
        }
    },
    "requires": "5.0",
    "tested": "6.6.2",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 88,
    "ratings": {
        "5": 6,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 7,
    "support_url": "https://wordpress.org/support/plugin/ht-easy-google-analytics/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 6000,
    "downloaded": 82862,
    "last_updated": "2024-09-11 04:38:00",
    "added": "2020-12-30",
    "homepage": "",
    "sections": {
        "description": "<p>HT Easy GA4 &#8211; Google Analytics 4 WordPress plugin is a great option for those in search of the best Google Analytics WordPress plugin for WordPress website traffic analytics. This easy-to-use and intuitive Google Analytics plugin for WordPress enables you to link your WordPress site with Google Analytics 4 with a few clicks and get complete analytics for WordPress site.<br />\nThe plugin developed by the HasThemes team can be pretty useful if you are a user of <a href=\"https://support.google.com/analytics/answer/10089681\" rel=\"nofollow ugc\">Google Analytics 4</a>, also known as GA4.</p>\n<pre><code><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/AreAbEZD5I0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n</code></pre>\n<p>In the past, it was a little complicated to combine website and mobile app usage data using the older Google Analytics tools. The only way it was possible was by using separate Google Analytics property. With the latest Google Analytics 4 version, you will get more advantages over the older Universal Analytics tool in terms of web analytics.</p>\n<p>HT Easy GA4 is an exceptional Google Analytics 4  WordPress plugin that brings actionable website insights directly to your WordPress dashboard. With HT Easy GA4, you gain access to customized reports designed to eliminate unnecessary clutter and present only the vital statistics that truly matter for your business growth. This means you can easily assess what&#8217;s driving success and identify areas that need improvement. Empower your decision-making with clear, relevant data, and optimize your website&#8217;s performance based on real-time, valuable information.</p>\n<p><a href=\"https://hasthemes.com/docs/ht-easy-ga4/how-to/\" rel=\"nofollow ugc\">Documentation</a> | <a href=\"https://hasthemes.com/plugins/google-analytics-plugin-for-wordpress?utm_source=wp-org&amp;utm_medium=ht-ga4&amp;utm_campaign=htga4_plugin-page#pricing\" rel=\"nofollow ugc\">Purchase Pro</a> | <a href=\"https://hasthemes.com/contact-us/\" rel=\"nofollow ugc\">Support</a></p>\n<h3>Benefits of using Google Analytics 4 ( GA4 )</h3>\n<ul>\n<li>Unified view between app and web</li>\n<li>Updated user interface with several new reporting tools</li>\n<li>More intelligent user privacy and tracking features</li>\n<li>A plethora of parameters</li>\n</ul>\n<h3>Key Features</h3>\n<ul>\n<li>👉 Manually Track your Visitors behavior with GA4 measurement_id</li>\n<li>👉 Automatically Track visitors and View reports with Google Login</li>\n<li>👉 View Standard Reports\n<ul>\n<li>Sessions</li>\n<li>Page View</li>\n<li>Bounce Rate</li>\n<li>Top Pages</li>\n<li>Top Referrers</li>\n<li>Top country’s</li>\n<li>User Types</li>\n<li>Device Types</li>\n</ul>\n</li>\n<li>👉 Generate and View Reports for a Custom Period of Time</li>\n<li>👉 Compare Chart Reports With Previous Periods of Time</li>\n<li>👉 WooCommerce Integration (Pro)</li>\n<li>👉 Exclude Administrators from being tracked</li>\n<li>👉 Exclude Custom User Roles from being tracked (Pro)</li>\n</ul>\n<h3>🔥 Premium Features 🔥</h3>\n<ul>\n<li>\n<p>E-commerce Reports</p>\n<ul>\n<li>Transactions</li>\n<li>Revenue</li>\n<li>Average Purchase Revenue</li>\n<li>Total Purchase Revenue</li>\n<li>Products Viewed</li>\n<li>Products Added to the Cart</li>\n<li>Products Checked Out</li>\n<li>Products Purchase Quantity</li>\n<li>Top Products</li>\n<li>Top Brands</li>\n<li>Top Sources</li>\n</ul>\n</li>\n<li>\n<p>Real-time Reports</p>\n<ul>\n<li>Page Views per Minute</li>\n<li>Active Users</li>\n<li>Top Pages</li>\n<li>Top Events</li>\n<li>Top country’s</li>\n<li>Device Types</li>\n</ul>\n</li>\n<li>\n<p>E-Commerce Events</p>\n<ul>\n<li>View Product</li>\n<li>View Category</li>\n<li>Add to Cart</li>\n<li>Initiate Checkout</li>\n<li>Purchase</li>\n</ul>\n</li>\n<li>\n<p>Video &amp; Audio Events</p>\n<ul>\n<li>Vimeo Video Engagement</li>\n<li>Self Hosted Video Engagement</li>\n<li>Self Hosted Audio Engagement</li>\n</ul>\n</li>\n</ul>\n<h3>Details of Each Feature of HT Easy GA4</h3>\n<p><strong>Login With Google</strong> &#8211; With HT GA4, login with Google allows you to seamlessly access the property and measurement ID of your Google account. This integration provides a convenient and efficient way to view and manage your Google Analytics data directly within the HT GA4 plugin.</p>\n<p><strong>Integration with WooCommerce</strong> &#8211; The HT GA4 plugin is compatible with WooCommerce. As a result, it facilitates tracking various eCommerce activities on your WooCommerce store easier. This feature can also provide you with vital insights that you can use to enhance your store for business growth. Thus, it would be a perfect plugin for Google Analytics for WooCommerce.</p>\n<h3>Standard Reports</h3>\n<ul>\n<li>\n<p><strong><em>Sessions</em></strong> &#8211; A session represents a user&#8217;s interactions with your website within a specific time frame. Monitoring sessions help you understand user behavior and spot trends.</p>\n</li>\n<li>\n<p><strong><em>Page Views</em></strong> &#8211; Page views count how many times a page on your website has been loaded. This data helps identify popular pages and traffic drivers.</p>\n</li>\n<li>\n<p>*<strong>Bounce Rate</strong> &#8211; Bounce rate indicates the percentage of users leaving your website after viewing only one page. Identifying high bounce rate pages can guide UX improvements.</p>\n</li>\n<li>\n<p><strong><em>Top Pages</em></strong> &#8211; The top pages report displays the pages that have the highest page views, allowing you to promote popular content effectively.</p>\n</li>\n<li>\n<p><strong><em>Top Referrers</em></strong> &#8211; This report reveals websites sending the most traffic to your site, enabling targeted marketing efforts. Also, this report shows how many sessions that website sent traffic to your site.</p>\n</li>\n<li>\n<p><strong><em>Top Countries</em></strong> &#8211; Identify the top countries where your website visitors come from and tailor marketing and content strategies accordingly.  Besides, you can get the session wise data of visitors coming from different countries.</p>\n</li>\n<li>\n<p><strong><em>User Types</em></strong> &#8211; The user types report categorizes visitors (new, returning, not set, etc.), aiding in segmenting your audience for personalized campaigns.</p>\n</li>\n<li>\n<p><strong><em>Device Types</em></strong> &#8211; The device types report shows the devices such as  Desktop, Tablet, Mobile, etc. that users utilize to access your website, facilitating optimizations for a better user experience.</p>\n</li>\n</ul>\n<h3>eCommerce Events (Pro)</h3>\n<p>This plugin contains a number of features for eCommerce tracking for various events.</p>\n<ul>\n<li>\n<p><strong><em>View Product</em></strong> &#8211; The &#8220;View Product&#8221; event tracks when a user views a specific product on your eCommerce website. This data helps you understand which products are attracting the most interest and engagement from your visitors.</p>\n</li>\n<li>\n<p><strong><em>View Category</em></strong> &#8211; The &#8220;View Category&#8221; event allows you to monitor when users explore a particular category of products on your online store. This information assists in identifying popular product categories and user preferences.</p>\n</li>\n<li>\n<p><strong><em>Add to Cart</em></strong> &#8211; The &#8220;Add to Cart&#8221; event is triggered when a user adds a product to their shopping cart. Tracking this event helps you gauge the level of interest in different products and evaluate the effectiveness of your marketing efforts.</p>\n</li>\n<li>\n<p><strong><em>Initiate Checkout</em></strong> &#8211; The &#8220;Initiate Checkout&#8221; event is recorded when a user starts the checkout process for their selected items. Monitoring this event provides insights into your conversion funnel and identifies potential barriers in the checkout process.</p>\n</li>\n<li>\n<p><strong><em>Purchase</em></strong> &#8211; The &#8220;Purchase&#8221; event tracks successful transactions when a user completes the payment process for their order. This is a crucial event to measure the overall performance and revenue generated by your e-commerce website.</p>\n</li>\n</ul>\n<h3>eCommerce Reports  (Pro)</h3>\n<p>The following are some remarkable eCommerce reports tracking features available in HT Easy GA4:</p>\n<ul>\n<li>\n<p><strong><em>Transactions</em></strong> &#8211; Track the number of sales made on your website to identify sales trends and performance.</p>\n</li>\n<li>\n<p><strong><em>Average Purchase Revenue</em></strong> &#8211; Discover the average amount spent by each user during a purchase, helping identify profitable products and optimize marketing efforts.</p>\n</li>\n<li>\n<p><strong><em>Total Purchase Revenue</em></strong> &#8211; Monitor the total amount of money spent on your website to track revenue trends and website performance.</p>\n</li>\n<li>\n<p><strong><em>Products Viewed</em></strong> &#8211; Keep track of the number of times each product is viewed to identify popular items for promotion.</p>\n</li>\n<li>\n<p><strong><em>Products Added to Cart</em></strong> &#8211; Monitor the number of times each product is added to the cart to optimize website engagement.</p>\n</li>\n<li>\n<p><strong><em>Products Checked Out</em></strong> &#8211; Track the number of times each product is purchased to analyze purchase behavior.</p>\n</li>\n<li>\n<p><strong><em>Products Purchase Quantity</em></strong> &#8211; Monitor the quantity of each product purchased to ensure adequate inventory management.</p>\n</li>\n<li>\n<p><strong><em>Top Products</em></strong> &#8211; HT Easy GA4 enables you to view the analytics of top products in your store in a streamlined and user-friendly table format. Get data about product purchase quantity, product revenue, product views, add to carts, carts to view, etc. Thus, you can identify the most popular products to focus on promoting and optimizing your inventory.</p>\n</li>\n<li>\n<p><strong><em>Top Brands</em></strong> &#8211; Get the analytics of top brands in table format that people are liking. Therefore, you can discover the most preferred brands to better understand customer preferences and preferences in the market. Get reports on brand name, product views, prchase quantity, product revenue, etc.</p>\n</li>\n<li>\n<p><strong><em>Top Sources</em></strong> &#8211; With the intuitive table-format report, you can easily access valuable data about the websites sending traffic to your site. This comprehensive report allows you to analyze product views, product quantity, and product revenue originating from different sources. By understanding where your website traffic is coming from and how it influences product interactions and revenue, you can make informed decisions to optimize marketing strategies and enhance overall website performance.</p>\n</li>\n</ul>\n<p>If you are running a website or app, you might already know how important the Google Analytics tool is when it comes to tracking and understanding different website data. Here website data refers to customer behavior, user experience, online content, device functionality, and many more.</p>\n<p>In case you are not familiar with the Google Analytics tool, it is one of the best web analytic tools that allow you to collect many vital reports, and stats, using which you will get to discover things you probably didn&#8217;t even know about your website visitors. By analyzing these crucial data, you will be able to maximize your website performance while growing your business at the same time.</p>\n<p>Though GA4 property enables more robust cross-device and cross-platform tracking, Google still recommends using the latest tool to take its advantage even if you don’t have a mobile app. You can use Google Analytics 4 for a website, an app, or both a website and an app together.</p>\n<p>To help you with adding the latest Google Analytics property to your WordPress website, the HT Easy GA4 ( Google Analytics 4 ) plugin will allow you to incorporate an analytic script to your existing theme and start tracking your website or mobile app usage data right away. Moreover, the plugin is super easy to use and you don’t have to write a single line of code. All you have to do is add a measurement ID, and you are good to go.</p>\n<h3>Our Other Plugins</h3>\n<p>We have a lot of plugins and extensions that might interest you. Try out other projects by following this link:</p>\n<p><strong><a href=\"https://wordpress.org/plugins/woolentor-addons/\" rel=\"ugc\">Woolentor Addons</a></strong><br />\nWoolentor is a WooCommerce page builder plugin that extends the functionality of the WooCommerce store. These Elementor Addons provide additional features and options for WooCommerce stores. Woolentor is the best alternative for ShopReady, Kadence, JetWidgets, ShopEngine, and CoDesigner. The Woolentor addons come with 50+ free Elementor widgets like Wishlist Extension Addon, Product compare, Product Filters, Product Variation Swatches, Shopify Style Checkout, Product Slider and 50+ pro Elementor Widgets like Checkout Fields Editor, Partial Payment, Email Customizer for WooCommerce with ready Email Templates, WooCommerce Email Automation, Multi Step Checkout, and many much more. Also it provide 90+ WooCommerce Elementor templates, 22+ WooCommerce Modules, and Gutenberg Blocks.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/ht-mega-for-elementor/\" rel=\"ugc\">HT Mega For Elementor</a></strong><br />\nHT Mega is an Elementor Addons that comes with custom page builder,  header builder, footer builder, mega menus, and more for your Elementor based website. The HT Mega plugin also includes a comprehensive set of Elementor widgets, readymade Elementor templates and Elementor Blocks.  HT Mega plugin works like ElementsKit, Essential Addons for Elementor, Royal Elementor Addons, Premium Addons, Happy Addons, PowerPack Addons, Unlimited Elements, Qi Addons, etc. The HT Mega plugin provides 84+ free Elementor widgets like Post Grid widget, Slider widget, Accordion widget, Elementor Forms widget, Contact Form Widget, Elementor tables, and other related items. It also provides 18+ pro widgets like Filterable Gallery Widget, Event Box Widget, Breadcrumbs Widget, Elementor Facebook Review Widget, Elementor Category List Widget, etc.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/hashbar-wp-notification-bar/\" rel=\"ugc\">Hashbar WP Notification Bar</a></strong><br />\nHashBar is a WordPress Notification Bar Plugin that enables you to create unlimited notification bars on your WordPress website. You can create as many notification bars as you want and customize their content to meet your needs.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/wp-plugin-manager/\" rel=\"ugc\">WP Plugin Manager &#8211; Deactivate plugins per page</a></strong><br />\nWP Plugin Manager is the perfect solution for those who want to disable certain plugins on specific pages or posts. With this plugin, you can easily activate or deactivate plugins on a per-page or per-post basis. Whichever plugin you don’t need you can deactivate or disable that plugin with the help of WP plugin Manager.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/extensions-for-cf7/\" rel=\"ugc\">Extensions For Cf7</a></strong><br />\nContact Form 7 is an excellent plugin for organizing your contact page. The CF7 extensions plugin includes Contact Form 7 Database, enabling Conditional Fields for Contact Form 7, etc. It allows fields to be set up as either visible or hidden depending upon the input from visitors. In addition, integrating seamlessly with Mailchimp brings leads generated every time someone fills out one form into an associated email list immediately.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/whols/\" rel=\"ugc\">Whols</a></strong><br />\nWhols is an outstanding plugin for WooCommerce that allows store owners to set wholesale prices for the products of their online stores. With Whols, you can easily add custom fields to your registration form, set minimum product requirements, and control how wholesale prices are displayed on both the shop and product detail pages. Whols work  like Wholesale Suite, B2Bking and B2B plugins.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/just-tables/\" rel=\"ugc\">Just Tables</a></strong><br />\nJustTables is a WooCommerce product table plugin that helps you easily create and manage tables for your products. It includes 28 pre-built columns with options to enable/disable, and you can add custom columns with custom fields/taxonomies. Just Tables also allows you to order table columns using drag and drop and set the number of products per page.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/swatchly/\" rel=\"ugc\">Swatchly</a></strong><br />\nSwatchly is a WooCommerce product variation swatches plugin that allows you to add color swatches to your product pages. With Swatchly, you can enable swatches for the shop, product list, and product details pages. There are three swatch types (label swatche, color swatche, image swatche), and the plugin supports multi-colored swatches.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/ht-slider-for-elementor/\" rel=\"ugc\">HT Slider For Elementor</a></strong><br />\nHT Slider For Elementor is a powerful and user-friendly slider addon for Elementor. You can customize the look and feel of your slider with HT Slider&#8217;s custom styling options. You also have the option to display your slides by id and category. Plus, HT Slider For Elementor comes with custom design options for slider navigation and pagination, so you can easily control the look and feel of your slider.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/ht-contactform/\" rel=\"ugc\">HT Contact form</a></strong><br />\nHT Contact Form 7 Widget is an Elementor addon that allows you to easily drag and drop Contact Form 7 forms into your web pages. With the help of this plugin, you can choose your form from the drop-down list, Custom Styling Options, and add it to any page or place on your website. The HT Contact Form 7 Widget is an essential tool for anyone using Contact Form 7 on their website.</p>\n<h3>Need Help?</h3>\n<p>Is there any feature that you want to get in this plugin?<br />\nNeeds assistance to use this plugin?<br />\nFeel free to <a href=\"https://hasthemes.com/contact-us/\" rel=\"nofollow ugc\">Contact us</a></p>\n",
        "installation": "<p>This section describes how to install the HT Easy GA4 Plugin for WordPress get it working.</p>\n<h4>1) Install</h4>\n<ol>\n<li>Go to the WordPress Dashboard &#8220;Add New Plugin&#8221; section.</li>\n<li>Search For &#8220;HT Easy GA4&#8221;.</li>\n<li>Install, then Activate it.</li>\n</ol>\n<h4>OR:</h4>\n<ol>\n<li>Unzip (if it is zipped) and Upload &#8216;HT Easy GA4&#8217; folder to the &#8216;/wp-content/plugins/&#8217; directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n<h4>2) Configure</h4>\n<ol>\n<li>Go to the HT Easy GA4 Settings Options.</li>\n<li>Add Google Analytics 4 Measurement ID.</li>\n</ol>\n",
        "changelog": "<h4>Version: 1.2.6 &#8211; Date: 2024-09-11</h4>\n<ul>\n<li>Fixed: Type error in array_intersect() function</li>\n</ul>\n<h4>Version: 1.2.5 &#8211; Date: 2024-09-10</h4>\n<ul>\n<li>Fixed: addToCarts event was not working for top products</li>\n</ul>\n<h4>Version: 1.2.4 &#8211; Date: 2024-09-04</h4>\n<ul>\n<li>Fixed: Tracking script loading issue</li>\n</ul>\n<h4>Version: 1.2.3 &#8211; Date: 2024-08-29</h4>\n<ul>\n<li>Fixed: Save button remain disabled after changing tracking ID issue</li>\n<li>Fixed: Some css issues of admin panel</li>\n</ul>\n<h4>Version: 1.2.2 &#8211; Date: 2024-07-16</h4>\n<ul>\n<li>Fixed: Currency sybmol were not showing properly</li>\n<li>Fixed: Several issues from the PCP plugin check</li>\n</ul>\n<h4>Version: 1.2.1 &#8211; Date: 2024-05-19</h4>\n<ul>\n<li>Fixed: Added to cart and purchase event were not working when redirect option was enabled</li>\n<li>Tweak: Prevented The CSRF issue using nonce while updating the API key from URL</li>\n<li>Improved: Refactored coding in some areas from raw to OOP</li>\n</ul>\n<h4>Version: 1.2.0 &#8211; Date: 2024-03-21</h4>\n<ul>\n<li>Fixed: An issue with login data being updated by non-privileged users</li>\n</ul>\n<h4>Version: 1.1.9 &#8211; Date: 2024-03-18</h4>\n<ul>\n<li>Fixed: Transition issue with cross browser Compatibility</li>\n<li>Tested: With WordPress 6.5 version</li>\n</ul>\n<h4>Version: 1.1.8 &#8211; Date: 2024-03-08</h4>\n<ul>\n<li>Fixed: Removed public REST API endpoint to prevent unauthorized access, and managed it differently</li>\n<li>Fixed: Sanitization and escaping issues in a few areas</li>\n</ul>\n<h4>Version: 1.1.7 &#8211; Date: 2024-02-20</h4>\n<ul>\n<li>Improved: Removed dependecny on JS for Diagnostic data notice dismiss issue</li>\n</ul>\n<h4>Version: 1.1.6 &#8211; Date: 2024-02-08</h4>\n<ul>\n<li>Fixed: Some sanitization and escaping issue</li>\n<li>Fixed: Prevented unauthorized access to the REST API</li>\n</ul>\n<h4>Version: 1.1.5 &#8211; Date: 2023-12-31</h4>\n<ul>\n<li>Fixed: Empty Notice shows instead of showing the standard report</li>\n<li>Tweak: Opt-in message to provide non-sensitive diagnostic data and usage information to improve the plugin</li>\n</ul>\n<h4>Version: 1.1.4 &#8211; Date: 2023-11-02</h4>\n<ul>\n<li>Added: Exclude Roles from being tracked</li>\n<li>Tweak: Improved UI</li>\n</ul>\n<h4>Version: 1.1.3 &#8211; Date: 2023-09-17</h4>\n<ul>\n<li>Fixed: Showing insufficient permission error.</li>\n<li>Tweak: Shows login with google button at first for better accessibility.</li>\n<li>Tweak: Improved plugin settings labels and descriptions.</li>\n</ul>\n<h4>Version: 1.1.2 &#8211; Date: 2023-08-17</h4>\n<ul>\n<li>Fixed: The bug where the upgrade notice was erroneously displayed across the entire admin area.</li>\n<li>Fixed: Loading spinner were spinning infinitely in firefox browser.</li>\n</ul>\n<h4>Version: 1.1.1 &#8211; Date: 2023-08-12</h4>\n<ul>\n<li>Added: Support Link</li>\n<li>Updated: Contents of the Readme file</li>\n</ul>\n<h4>Version: 1.1.0 &#8211; Date: 2023-07-23</h4>\n<ul>\n<li>Added: Option to login with Google</li>\n<li>Added: Standard Reports</li>\n</ul>\n<h4>Version: 1.0.8 &#8211; Date: 2023-04-04</h4>\n<ul>\n<li>Updated: Recommended plugins name</li>\n</ul>\n<h4>Version: 1.0.7 &#8211; Date: 2023-03-07</h4>\n<ul>\n<li>Added: Nonce verification for recommended plugins</li>\n<li>Improved: Coding standards in some areas</li>\n</ul>\n<h4>Version: 1.0.6 &#8211; Date: 2022-11-03</h4>\n<ul>\n<li>Compatibility with latest WordPress version.</li>\n</ul>\n<h4>Version: 1.0.5 &#8211; Date: 2022-09-14</h4>\n<ul>\n<li>Fixed: Site crashed error</li>\n</ul>\n<h4>Version: 1.0.4 &#8211; Date: 2022-09-13</h4>\n<ul>\n<li>Added: Recommendations submenu</li>\n</ul>\n<h4>Version: 1.0.3 &#8211; Date: 2022-09-02</h4>\n<ul>\n<li>Compatibility with latest WordPress version.</li>\n</ul>\n<h4>Version: 1.0.1 &#8211; Date: 2021-14-03</h4>\n<ul>\n<li>Compatibility with latest WordPress version.</li>\n</ul>\n<h4>Version: 1.0.0 &#8211; Date: 2020-12-28</h4>\n<ul>\n<li>Initial Upload.</li>\n</ul>\n"
    },
    "short_description": "HT Easy GA4 - Google Analytics WordPress Plugin enables tracking user behavior and viewing Google Analytics dashboard reports from your website.",
    "description": "<p>HT Easy GA4 &#8211; Google Analytics 4 WordPress plugin is a great option for those in search of the best Google Analytics WordPress plugin for WordPress website traffic analytics. This easy-to-use and intuitive Google Analytics plugin for WordPress enables you to link your WordPress site with Google Analytics 4 with a few clicks and get complete analytics for WordPress site.<br />\nThe plugin developed by the HasThemes team can be pretty useful if you are a user of <a href=\"https://support.google.com/analytics/answer/10089681\" rel=\"nofollow ugc\">Google Analytics 4</a>, also known as GA4.</p>\n<pre><code><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/AreAbEZD5I0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n</code></pre>\n<p>In the past, it was a little complicated to combine website and mobile app usage data using the older Google Analytics tools. The only way it was possible was by using separate Google Analytics property. With the latest Google Analytics 4 version, you will get more advantages over the older Universal Analytics tool in terms of web analytics.</p>\n<p>HT Easy GA4 is an exceptional Google Analytics 4  WordPress plugin that brings actionable website insights directly to your WordPress dashboard. With HT Easy GA4, you gain access to customized reports designed to eliminate unnecessary clutter and present only the vital statistics that truly matter for your business growth. This means you can easily assess what&#8217;s driving success and identify areas that need improvement. Empower your decision-making with clear, relevant data, and optimize your website&#8217;s performance based on real-time, valuable information.</p>\n<p><a href=\"https://hasthemes.com/docs/ht-easy-ga4/how-to/\" rel=\"nofollow ugc\">Documentation</a> | <a href=\"https://hasthemes.com/plugins/google-analytics-plugin-for-wordpress?utm_source=wp-org&amp;utm_medium=ht-ga4&amp;utm_campaign=htga4_plugin-page#pricing\" rel=\"nofollow ugc\">Purchase Pro</a> | <a href=\"https://hasthemes.com/contact-us/\" rel=\"nofollow ugc\">Support</a></p>\n<h3>Benefits of using Google Analytics 4 ( GA4 )</h3>\n<ul>\n<li>Unified view between app and web</li>\n<li>Updated user interface with several new reporting tools</li>\n<li>More intelligent user privacy and tracking features</li>\n<li>A plethora of parameters</li>\n</ul>\n<h3>Key Features</h3>\n<ul>\n<li>👉 Manually Track your Visitors behavior with GA4 measurement_id</li>\n<li>👉 Automatically Track visitors and View reports with Google Login</li>\n<li>👉 View Standard Reports\n<ul>\n<li>Sessions</li>\n<li>Page View</li>\n<li>Bounce Rate</li>\n<li>Top Pages</li>\n<li>Top Referrers</li>\n<li>Top country’s</li>\n<li>User Types</li>\n<li>Device Types</li>\n</ul>\n</li>\n<li>👉 Generate and View Reports for a Custom Period of Time</li>\n<li>👉 Compare Chart Reports With Previous Periods of Time</li>\n<li>👉 WooCommerce Integration (Pro)</li>\n<li>👉 Exclude Administrators from being tracked</li>\n<li>👉 Exclude Custom User Roles from being tracked (Pro)</li>\n</ul>\n<h3>🔥 Premium Features 🔥</h3>\n<ul>\n<li>\n<p>E-commerce Reports</p>\n<ul>\n<li>Transactions</li>\n<li>Revenue</li>\n<li>Average Purchase Revenue</li>\n<li>Total Purchase Revenue</li>\n<li>Products Viewed</li>\n<li>Products Added to the Cart</li>\n<li>Products Checked Out</li>\n<li>Products Purchase Quantity</li>\n<li>Top Products</li>\n<li>Top Brands</li>\n<li>Top Sources</li>\n</ul>\n</li>\n<li>\n<p>Real-time Reports</p>\n<ul>\n<li>Page Views per Minute</li>\n<li>Active Users</li>\n<li>Top Pages</li>\n<li>Top Events</li>\n<li>Top country’s</li>\n<li>Device Types</li>\n</ul>\n</li>\n<li>\n<p>E-Commerce Events</p>\n<ul>\n<li>View Product</li>\n<li>View Category</li>\n<li>Add to Cart</li>\n<li>Initiate Checkout</li>\n<li>Purchase</li>\n</ul>\n</li>\n<li>\n<p>Video &amp; Audio Events</p>\n<ul>\n<li>Vimeo Video Engagement</li>\n<li>Self Hosted Video Engagement</li>\n<li>Self Hosted Audio Engagement</li>\n</ul>\n</li>\n</ul>\n<h3>Details of Each Feature of HT Easy GA4</h3>\n<p><strong>Login With Google</strong> &#8211; With HT GA4, login with Google allows you to seamlessly access the property and measurement ID of your Google account. This integration provides a convenient and efficient way to view and manage your Google Analytics data directly within the HT GA4 plugin.</p>\n<p><strong>Integration with WooCommerce</strong> &#8211; The HT GA4 plugin is compatible with WooCommerce. As a result, it facilitates tracking various eCommerce activities on your WooCommerce store easier. This feature can also provide you with vital insights that you can use to enhance your store for business growth. Thus, it would be a perfect plugin for Google Analytics for WooCommerce.</p>\n<h3>Standard Reports</h3>\n<ul>\n<li>\n<p><strong><em>Sessions</em></strong> &#8211; A session represents a user&#8217;s interactions with your website within a specific time frame. Monitoring sessions help you understand user behavior and spot trends.</p>\n</li>\n<li>\n<p><strong><em>Page Views</em></strong> &#8211; Page views count how many times a page on your website has been loaded. This data helps identify popular pages and traffic drivers.</p>\n</li>\n<li>\n<p>*<strong>Bounce Rate</strong> &#8211; Bounce rate indicates the percentage of users leaving your website after viewing only one page. Identifying high bounce rate pages can guide UX improvements.</p>\n</li>\n<li>\n<p><strong><em>Top Pages</em></strong> &#8211; The top pages report displays the pages that have the highest page views, allowing you to promote popular content effectively.</p>\n</li>\n<li>\n<p><strong><em>Top Referrers</em></strong> &#8211; This report reveals websites sending the most traffic to your site, enabling targeted marketing efforts. Also, this report shows how many sessions that website sent traffic to your site.</p>\n</li>\n<li>\n<p><strong><em>Top Countries</em></strong> &#8211; Identify the top countries where your website visitors come from and tailor marketing and content strategies accordingly.  Besides, you can get the session wise data of visitors coming from different countries.</p>\n</li>\n<li>\n<p><strong><em>User Types</em></strong> &#8211; The user types report categorizes visitors (new, returning, not set, etc.), aiding in segmenting your audience for personalized campaigns.</p>\n</li>\n<li>\n<p><strong><em>Device Types</em></strong> &#8211; The device types report shows the devices such as  Desktop, Tablet, Mobile, etc. that users utilize to access your website, facilitating optimizations for a better user experience.</p>\n</li>\n</ul>\n<h3>eCommerce Events (Pro)</h3>\n<p>This plugin contains a number of features for eCommerce tracking for various events.</p>\n<ul>\n<li>\n<p><strong><em>View Product</em></strong> &#8211; The &#8220;View Product&#8221; event tracks when a user views a specific product on your eCommerce website. This data helps you understand which products are attracting the most interest and engagement from your visitors.</p>\n</li>\n<li>\n<p><strong><em>View Category</em></strong> &#8211; The &#8220;View Category&#8221; event allows you to monitor when users explore a particular category of products on your online store. This information assists in identifying popular product categories and user preferences.</p>\n</li>\n<li>\n<p><strong><em>Add to Cart</em></strong> &#8211; The &#8220;Add to Cart&#8221; event is triggered when a user adds a product to their shopping cart. Tracking this event helps you gauge the level of interest in different products and evaluate the effectiveness of your marketing efforts.</p>\n</li>\n<li>\n<p><strong><em>Initiate Checkout</em></strong> &#8211; The &#8220;Initiate Checkout&#8221; event is recorded when a user starts the checkout process for their selected items. Monitoring this event provides insights into your conversion funnel and identifies potential barriers in the checkout process.</p>\n</li>\n<li>\n<p><strong><em>Purchase</em></strong> &#8211; The &#8220;Purchase&#8221; event tracks successful transactions when a user completes the payment process for their order. This is a crucial event to measure the overall performance and revenue generated by your e-commerce website.</p>\n</li>\n</ul>\n<h3>eCommerce Reports  (Pro)</h3>\n<p>The following are some remarkable eCommerce reports tracking features available in HT Easy GA4:</p>\n<ul>\n<li>\n<p><strong><em>Transactions</em></strong> &#8211; Track the number of sales made on your website to identify sales trends and performance.</p>\n</li>\n<li>\n<p><strong><em>Average Purchase Revenue</em></strong> &#8211; Discover the average amount spent by each user during a purchase, helping identify profitable products and optimize marketing efforts.</p>\n</li>\n<li>\n<p><strong><em>Total Purchase Revenue</em></strong> &#8211; Monitor the total amount of money spent on your website to track revenue trends and website performance.</p>\n</li>\n<li>\n<p><strong><em>Products Viewed</em></strong> &#8211; Keep track of the number of times each product is viewed to identify popular items for promotion.</p>\n</li>\n<li>\n<p><strong><em>Products Added to Cart</em></strong> &#8211; Monitor the number of times each product is added to the cart to optimize website engagement.</p>\n</li>\n<li>\n<p><strong><em>Products Checked Out</em></strong> &#8211; Track the number of times each product is purchased to analyze purchase behavior.</p>\n</li>\n<li>\n<p><strong><em>Products Purchase Quantity</em></strong> &#8211; Monitor the quantity of each product purchased to ensure adequate inventory management.</p>\n</li>\n<li>\n<p><strong><em>Top Products</em></strong> &#8211; HT Easy GA4 enables you to view the analytics of top products in your store in a streamlined and user-friendly table format. Get data about product purchase quantity, product revenue, product views, add to carts, carts to view, etc. Thus, you can identify the most popular products to focus on promoting and optimizing your inventory.</p>\n</li>\n<li>\n<p><strong><em>Top Brands</em></strong> &#8211; Get the analytics of top brands in table format that people are liking. Therefore, you can discover the most preferred brands to better understand customer preferences and preferences in the market. Get reports on brand name, product views, prchase quantity, product revenue, etc.</p>\n</li>\n<li>\n<p><strong><em>Top Sources</em></strong> &#8211; With the intuitive table-format report, you can easily access valuable data about the websites sending traffic to your site. This comprehensive report allows you to analyze product views, product quantity, and product revenue originating from different sources. By understanding where your website traffic is coming from and how it influences product interactions and revenue, you can make informed decisions to optimize marketing strategies and enhance overall website performance.</p>\n</li>\n</ul>\n<p>If you are running a website or app, you might already know how important the Google Analytics tool is when it comes to tracking and understanding different website data. Here website data refers to customer behavior, user experience, online content, device functionality, and many more.</p>\n<p>In case you are not familiar with the Google Analytics tool, it is one of the best web analytic tools that allow you to collect many vital reports, and stats, using which you will get to discover things you probably didn&#8217;t even know about your website visitors. By analyzing these crucial data, you will be able to maximize your website performance while growing your business at the same time.</p>\n<p>Though GA4 property enables more robust cross-device and cross-platform tracking, Google still recommends using the latest tool to take its advantage even if you don’t have a mobile app. You can use Google Analytics 4 for a website, an app, or both a website and an app together.</p>\n<p>To help you with adding the latest Google Analytics property to your WordPress website, the HT Easy GA4 ( Google Analytics 4 ) plugin will allow you to incorporate an analytic script to your existing theme and start tracking your website or mobile app usage data right away. Moreover, the plugin is super easy to use and you don’t have to write a single line of code. All you have to do is add a measurement ID, and you are good to go.</p>\n<h3>Our Other Plugins</h3>\n<p>We have a lot of plugins and extensions that might interest you. Try out other projects by following this link:</p>\n<p><strong><a href=\"https://wordpress.org/plugins/woolentor-addons/\" rel=\"ugc\">Woolentor Addons</a></strong><br />\nWoolentor is a WooCommerce page builder plugin that extends the functionality of the WooCommerce store. These Elementor Addons provide additional features and options for WooCommerce stores. Woolentor is the best alternative for ShopReady, Kadence, JetWidgets, ShopEngine, and CoDesigner. The Woolentor addons come with 50+ free Elementor widgets like Wishlist Extension Addon, Product compare, Product Filters, Product Variation Swatches, Shopify Style Checkout, Product Slider and 50+ pro Elementor Widgets like Checkout Fields Editor, Partial Payment, Email Customizer for WooCommerce with ready Email Templates, WooCommerce Email Automation, Multi Step Checkout, and many much more. Also it provide 90+ WooCommerce Elementor templates, 22+ WooCommerce Modules, and Gutenberg Blocks.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/ht-mega-for-elementor/\" rel=\"ugc\">HT Mega For Elementor</a></strong><br />\nHT Mega is an Elementor Addons that comes with custom page builder,  header builder, footer builder, mega menus, and more for your Elementor based website. The HT Mega plugin also includes a comprehensive set of Elementor widgets, readymade Elementor templates and Elementor Blocks.  HT Mega plugin works like ElementsKit, Essential Addons for Elementor, Royal Elementor Addons, Premium Addons, Happy Addons, PowerPack Addons, Unlimited Elements, Qi Addons, etc. The HT Mega plugin provides 84+ free Elementor widgets like Post Grid widget, Slider widget, Accordion widget, Elementor Forms widget, Contact Form Widget, Elementor tables, and other related items. It also provides 18+ pro widgets like Filterable Gallery Widget, Event Box Widget, Breadcrumbs Widget, Elementor Facebook Review Widget, Elementor Category List Widget, etc.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/hashbar-wp-notification-bar/\" rel=\"ugc\">Hashbar WP Notification Bar</a></strong><br />\nHashBar is a WordPress Notification Bar Plugin that enables you to create unlimited notification bars on your WordPress website. You can create as many notification bars as you want and customize their content to meet your needs.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/wp-plugin-manager/\" rel=\"ugc\">WP Plugin Manager &#8211; Deactivate plugins per page</a></strong><br />\nWP Plugin Manager is the perfect solution for those who want to disable certain plugins on specific pages or posts. With this plugin, you can easily activate or deactivate plugins on a per-page or per-post basis. Whichever plugin you don’t need you can deactivate or disable that plugin with the help of WP plugin Manager.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/extensions-for-cf7/\" rel=\"ugc\">Extensions For Cf7</a></strong><br />\nContact Form 7 is an excellent plugin for organizing your contact page. The CF7 extensions plugin includes Contact Form 7 Database, enabling Conditional Fields for Contact Form 7, etc. It allows fields to be set up as either visible or hidden depending upon the input from visitors. In addition, integrating seamlessly with Mailchimp brings leads generated every time someone fills out one form into an associated email list immediately.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/whols/\" rel=\"ugc\">Whols</a></strong><br />\nWhols is an outstanding plugin for WooCommerce that allows store owners to set wholesale prices for the products of their online stores. With Whols, you can easily add custom fields to your registration form, set minimum product requirements, and control how wholesale prices are displayed on both the shop and product detail pages. Whols work  like Wholesale Suite, B2Bking and B2B plugins.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/just-tables/\" rel=\"ugc\">Just Tables</a></strong><br />\nJustTables is a WooCommerce product table plugin that helps you easily create and manage tables for your products. It includes 28 pre-built columns with options to enable/disable, and you can add custom columns with custom fields/taxonomies. Just Tables also allows you to order table columns using drag and drop and set the number of products per page.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/swatchly/\" rel=\"ugc\">Swatchly</a></strong><br />\nSwatchly is a WooCommerce product variation swatches plugin that allows you to add color swatches to your product pages. With Swatchly, you can enable swatches for the shop, product list, and product details pages. There are three swatch types (label swatche, color swatche, image swatche), and the plugin supports multi-colored swatches.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/ht-slider-for-elementor/\" rel=\"ugc\">HT Slider For Elementor</a></strong><br />\nHT Slider For Elementor is a powerful and user-friendly slider addon for Elementor. You can customize the look and feel of your slider with HT Slider&#8217;s custom styling options. You also have the option to display your slides by id and category. Plus, HT Slider For Elementor comes with custom design options for slider navigation and pagination, so you can easily control the look and feel of your slider.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/ht-contactform/\" rel=\"ugc\">HT Contact form</a></strong><br />\nHT Contact Form 7 Widget is an Elementor addon that allows you to easily drag and drop Contact Form 7 forms into your web pages. With the help of this plugin, you can choose your form from the drop-down list, Custom Styling Options, and add it to any page or place on your website. The HT Contact Form 7 Widget is an essential tool for anyone using Contact Form 7 on their website.</p>\n<h3>Need Help?</h3>\n<p>Is there any feature that you want to get in this plugin?<br />\nNeeds assistance to use this plugin?<br />\nFeel free to <a href=\"https://hasthemes.com/contact-us/\" rel=\"nofollow ugc\">Contact us</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.2.6.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/ht-easy-google-analytics/assets/screenshot-1.png?rev=2952528",
            "caption": "Standard Reports"
        },
        {
            "src": "https://ps.w.org/ht-easy-google-analytics/assets/screenshot-2.jpg?rev=2952528",
            "caption": "eCommerce Reports"
        },
        {
            "src": "https://ps.w.org/ht-easy-google-analytics/assets/screenshot-3.jpg?rev=2952528",
            "caption": "Dashboard Settings Panel with Option to Login with Google"
        },
        {
            "src": "https://ps.w.org/ht-easy-google-analytics/assets/screenshot-4.jpg?rev=2952528",
            "caption": "Choose Account, Property &amp; Measurement ID"
        },
        {
            "src": "https://ps.w.org/ht-easy-google-analytics/assets/screenshot-5.jpg?rev=2952528",
            "caption": "Script load in frontend"
        }
    ],
    "tags": {
        "analytics": "analytics",
        "ga4": "ga4",
        "google": "google",
        "google-analytics": "google analytics",
        "google-analytics-plugin": "google analytics plugin"
    },
    "stable_tag": "1.2.6",
    "versions": {
        "1.0.3": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.0.3.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.0.6.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.0.7.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.0.8.zip",
        "1.0.9": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.0.9.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.1.8.zip",
        "1.1.9": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.1.9.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.1.2.6.zip",
        "trunk": "https://downloads.wordpress.org/plugin/ht-easy-google-analytics.zip"
    },
    "business_model": "commercial",
    "repository_url": "",
    "commercial_support_url": "https://portal.hasthemes.com/contact/",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/ht-easy-google-analytics/assets/banner-772x250.png?rev=2875679",
        "high": "https://ps.w.org/ht-easy-google-analytics/assets/banner-1544x500.png?rev=2875679"
    },
    "icons": {
        "1x": "https://ps.w.org/ht-easy-google-analytics/assets/icon-128x128.png?rev=2875679",
        "2x": "https://ps.w.org/ht-easy-google-analytics/assets/icon-256x256.png?rev=2875679"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 88,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "ht-easy-google-analytics",
            "language": "ru_RU",
            "version": "1.2.5",
            "updated": "2023-11-13 11:55:11",
            "package": "https://downloads.wordpress.org/translation/plugin/ht-easy-google-analytics/1.2.5/ru_RU.zip"
        }
    ]
}