{
    "name": "HT Slider For Elementor",
    "slug": "ht-slider-for-elementor",
    "version": "1.5.7",
    "author": "<a href=\"https://profiles.wordpress.org/htplugins/\">HT Plugins</a>",
    "author_profile": "https://profiles.wordpress.org/htplugins/",
    "contributors": {
        "hasthemes": {
            "profile": "https://profiles.wordpress.org/hasthemes/",
            "avatar": "https://secure.gravatar.com/avatar/22ee3e159ea3ed29d8be77abc7b039a0?s=96&d=monsterid&r=g",
            "display_name": "HasThemes"
        },
        "htplugins": {
            "profile": "https://profiles.wordpress.org/htplugins/",
            "avatar": "https://secure.gravatar.com/avatar/c7c8a9cf1910e24386e077013ccbd260?s=96&d=monsterid&r=g",
            "display_name": "HT Plugins"
        },
        "devitemsllc": {
            "profile": "https://profiles.wordpress.org/devitemsllc/",
            "avatar": "https://secure.gravatar.com/avatar/fecac6a0b50c5cd5bb319d4d8de9b1ac?s=96&d=monsterid&r=g",
            "display_name": "HasTech"
        },
        "zenaulislam": {
            "profile": "https://profiles.wordpress.org/zenaulislam/",
            "avatar": "https://secure.gravatar.com/avatar/c69c192ed037f0ecb74348a2bd06bdda?s=96&d=monsterid&r=g",
            "display_name": "Zenaul Islam"
        },
        "aslamhasib": {
            "profile": "https://profiles.wordpress.org/aslamhasib/",
            "avatar": "https://secure.gravatar.com/avatar/1edee2d43268eb35c68a09a01f77c90f?s=96&d=monsterid&r=g",
            "display_name": "Aslam Hasib"
        },
        "tarekht": {
            "profile": "https://profiles.wordpress.org/tarekht/",
            "avatar": "https://secure.gravatar.com/avatar/781d3e5bf0e40ed19369ba7c50b173c0?s=96&d=monsterid&r=g",
            "display_name": "Tarek Aziz"
        }
    },
    "requires": "5.0",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 76,
    "ratings": {
        "5": 5,
        "4": 1,
        "3": 0,
        "2": 2,
        "1": 1
    },
    "num_ratings": 9,
    "support_url": "https://wordpress.org/support/plugin/ht-slider-for-elementor/",
    "support_threads": 2,
    "support_threads_resolved": 2,
    "active_installs": 20000,
    "downloaded": 232835,
    "last_updated": "2024-08-26 9:42am GMT",
    "added": "2019-03-24",
    "homepage": "https://htplugins.com/",
    "sections": {
        "description": "<p><strong><a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a></strong> For Elementor is a WordPress slider builder plugin for the popular <strong>Elementor page builder and Gutenberg block editor</strong>. It empowers you to effortlessly create and customize sliders using a drag-and-drop interface within the Elementor.</p>\n<p>With its user-friendly features, you can easily create a variety of stunning WordPress sliders and carousels like <strong>image sliders, video sliders, post slider carousels, product carousels, and more.</strong></p>\n<p>The plugin also offers a wide range of custom styling options to tailor your sliders, including slider <strong>navigation and pagination.</strong> You can also control how your sliders appear on different devices.</p>\n<p>With <a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a>, you have the freedom to showcase content from any custom post type, including WooCommerce products. Furthermore, it offers multiple layouts to display your posts within a slider.</p>\n<p><strong>👉 <a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">Purchase Pro</a> | <a href=\"https://hasthemes.com/contact-us/&quot;\" rel=\"nofollow ugc\">Support</a> 👈</strong></p>\n<p><strong>👉 <a href=\"https://theplugindemo.com/ht-slider/\" rel=\"nofollow ugc\">80+ Pre-Designed Templates Demo</a></strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Jl-hdWg2l10?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>❤️ Features:</h3>\n<ul>\n<li>Create Slides using Elementors Drag n Drop Addons or Gutenberg blocks.</li>\n<li>Display Slider using Elementor Addons/Shortcode.</li>\n<li>Custom Styling Options.</li>\n<li>Show by id and category wise.</li>\n<li>Display Posts Slide by post category, author, and excluding specific posts.</li>\n<li>Mobile and Tablet display options.</li>\n<li>Slider Navigation and paginations custom design options.</li>\n<li>Slider Navigation on/off Option.</li>\n<li>Navigation position (Default, Right Center, Bottom Left).</li>\n<li>Slider Pagination on/off Option.</li>\n<li>Pagination position (Bottom Center, Bottom Left, Bottom Right, Right Center, Left Center, and Custom with Offset X and Y).</li>\n<li>Slider Autoplay on/off Option.</li>\n</ul>\n<h3>🔥 Pro Features:</h3>\n<ul>\n<li>Support any custom post type&#8217;s content with WooCommerce products as slide.</li>\n<li>Post Slides layout( One &#8211; Five).</li>\n<li>Slide Custom content option.</li>\n<li>Slide Layout(Style One and Style Two).</li>\n<li>Individual Slide Style option for custom content slide.</li>\n<li>Slide Effect.</li>\n<li>Vertical Slide Mode.</li>\n<li>Variable Width.</li>\n<li>Arrow Icon Type(Icon, Image, Text).</li>\n<li>Arrow Custom Position.</li>\n</ul>\n<h3>✅ Pre-made Slider Templates for various categories</h3>\n<p>1.<a href=\"https://theplugindemo.com/ht-slider/?category=pets\" rel=\"nofollow ugc\"> Animal Pets Slider (4+)</a><br />\n2.<a href=\"https://theplugindemo.com/ht-slider/?category=books\" rel=\"nofollow ugc\"> Book Slider (3+)</a><br />\n3.<a href=\"https://theplugindemo.com/ht-slider/?category=car\" rel=\"nofollow ugc\"> Car &amp; Motors Slider (2+)</a><br />\n4.<a href=\"https://theplugindemo.com/ht-slider/?category=cosmetics\" rel=\"nofollow ugc\"> Cosmetic Slider (2+)</a><br />\n5.<a href=\"https://theplugindemo.com/ht-slider/?category=fashion\" rel=\"nofollow ugc\"> Fashion Slider (26+)</a><br />\n6.<a href=\"https://theplugindemo.com/ht-slider/?category=flower\" rel=\"nofollow ugc\"> Flower Slider (3+)</a><br />\n7.<a href=\"https://theplugindemo.com/ht-slider/?category=food\" rel=\"nofollow ugc\"> Food Slider (1)</a><br />\n8.<a href=\"https://theplugindemo.com/ht-slider/?category=fruits\" rel=\"nofollow ugc\"> Fruits Slider (2+)</a><br />\n9. <a href=\"https://theplugindemo.com/ht-slider/?category=furniture\" rel=\"nofollow ugc\">Furniture Slider (13+)</a><br />\n10.<a href=\"https://theplugindemo.com/ht-slider/?category=electronics\" rel=\"nofollow ugc\"> Electronics Slider (10+)</a><br />\n11.<a href=\"https://theplugindemo.com/ht-slider/?category=handmade\" rel=\"nofollow ugc\"> Handmade Slider (2+)</a><br />\n12.<a href=\"https://theplugindemo.com/ht-slider/?category=jewelry\" rel=\"nofollow ugc\"> Jewelry Slider (4+)</a><br />\n13.<a href=\"https://theplugindemo.com/ht-slider/?category=kids\" rel=\"nofollow ugc\"> Kids Slider (1)</a><br />\n14.<a href=\"https://theplugindemo.com/ht-slider/?category=kitchen\" rel=\"nofollow ugc\"> Kitchen Slider (4+)</a><br />\n15.<a href=\"https://theplugindemo.com/ht-slider/?category=maternity\" rel=\"nofollow ugc\"> Maternity Slider (2+)</a><br />\n16.<a href=\"https://theplugindemo.com/ht-slider/?category=coffee\" rel=\"nofollow ugc\"> Matcha Coffee Slider (2+)</a><br />\n17.<a href=\"https://theplugindemo.com/ht-slider/?category=perfumes\" rel=\"nofollow ugc\"> Perfume Slider (1)</a><br />\n18.<a href=\"https://theplugindemo.com/ht-slider/?category=plant\" rel=\"nofollow ugc\"> Nursery Slider (1)</a><br />\n19.<a href=\"https://theplugindemo.com/ht-slider/?category=health-beauty\" rel=\"nofollow ugc\"> Health Beauty Slider (1)</a><br />\n20.<a href=\"https://theplugindemo.com/ht-slider/?category=minimal\" rel=\"nofollow ugc\"> Minimal Slider (5+)</a><br />\n21.<a href=\"https://theplugindemo.com/ht-slider/?category=sports\" rel=\"nofollow ugc\"> Sports Slider (3+)</a><br />\n22.<a href=\"https://theplugindemo.com/ht-slider/?category=watches\" rel=\"nofollow ugc\"> Watch Slider (4+)</a><br />\n23.<a href=\"https://theplugindemo.com/ht-slider/?category=tools\" rel=\"nofollow ugc\"> Tools Equipment Slider (2+)</a><br />\n24.<a href=\"https://theplugindemo.com/ht-slider/?category=shapewear\" rel=\"nofollow ugc\"> Shapewear Slider (1)</a></p>\n<p>Elementor Slider widgets are versatile tools designed to enhance the visual storytelling of your website. HT Slider is a highly versatile and feature-rich Elementor WordPress slider plugin that empowers users to create stunning section sliders, post sliders, and content sliders with ease. This dynamic plugin serves as the perfect addon for Elementor, offering a wide range of customization options and pre-designed slider templates to choose from.</p>\n<p>Whether you need an image slider for your Elementor-powered website or want to showcase your latest blog posts using an Elementor posts slider, HT Slider has got you covered. With its intuitive interface and seamless integration with Elementor, this plugin allows you to effortlessly design and manage captivating sliders and carousel sliders that engage your audience and elevate the visual appeal of your website</p>\n<p>Whether you are an experienced designer or a beginner, this tool enables you to craft attractive sliders with dynamic content. Besides, if you want to adorn your WooCommerce site with stunning eCommerce slider, this drag drop slider builder plugin can come in handy as you can add a product slider, category slider, hero slider, and various other media sliders. By using HT Slider, you can effectively engage your audience and make your website more engaging and visually appealing.</p>\n<h3>Benefits of HT Slider Plugin for Elementor</h3>\n<h3>Numerous Pre-Designed Slider Templates</h3>\n<p>Experience the versatility of the <strong><a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a></strong> Plugin, complete with an impressive array of <strong><a href=\"https://theplugindemo.com/ht-slider/\" rel=\"nofollow ugc\">80 meticulously crafted slider templates</a>,</strong> all at your fingertips. Among these templates, you can choose one as per your needs and use it in different sections of your website such as hero section, banner, etc. It empowers you to seamlessly tailor each template to perfectly match your unique needs, ensuring a captivating visual presence on your website</p>\n<h3>Seamless Integration with Elementor</h3>\n<p><a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a> seamlessly integrates into the Elementor page builder, enhancing your design capabilities without requiring you to leave your familiar workspace. Create impressive sliders right within the Elementor interface using the intuitive drag-and-drop builder.</p>\n<h3>Dynamic Content Possibilities</h3>\n<p>Empower your sliders with a wide range of content options. <a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a> allows you to incorporate images, videos, text, buttons, and even dynamic post content. Bring your posts to life through captivating slides. This ensures that your sliders remain fresh, relevant, and engaging, making them a powerful tool for conveying your message.</p>\n<h3>Customizable Navigation and Pagination</h3>\n<p>Control the navigation and pagination elements of your sliders with ease. Tailor their appearance and behavior to match your website&#8217;s design and user experience preferences, ensuring seamless navigation through your slider content.</p>\n<h3>Responsive and Mobile-Ready</h3>\n<p>In today&#8217;s mobile-centric world, responsiveness is paramount. <a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a> ensures that your sliders adapt flawlessly to different screen sizes and devices, guaranteeing a consistent and visually pleasing experience for every visitor, regardless of their device.</p>\n<h3>Whom This Plugin is For</h3>\n<p><a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a> plugin is designed for a wide range of users who are looking to enhance their Elementor-powered websites with visually appealing and interactive sliders. This plugin is suitable for:</p>\n<p><strong>Website Owners:</strong> Whether you run a personal blog, a business website, or an e-commerce store, HT Slider offers you the tools to create captivating section sliders, post sliders, and content sliders that engage your audience and elevate the visual appeal of your website.<br />\nDevelopers: HT Slider provides developers with a versatile plugin to create customized sliders and carousel sliders for their clients&#8217; Elementor websites. With its extensive customization options and seamless integration with Elementor, developers can easily create sliders that align with their clients&#8217; branding and design preferences.</p>\n<p><strong>Content Creators:</strong> If you frequently publish blog posts or other dynamic content on your Elementor-powered website, HT Slider&#8217;s post slider functionality allows you to showcase your latest articles or updates in an attractive and interactive manner.</p>\n<p><strong>Designers:</strong> HT Slider serves as an excellent addon for Elementor, enabling designers to leverage its features to create visually stunning image sliders, text sliders, and banner sliders that enhance the overall aesthetics of their website designs.</p>\n<p><strong>Beginners:</strong> HT Slider offers a user-friendly interface and intuitive controls, making it accessible for beginners who may not have prior experience with creating sliders. The plugin&#8217;s pre-designed templates and easy-to-use customization options allow beginners to quickly create professional-looking sliders without any coding knowledge.</p>\n<h3>Ultimate Addons for Elementor Page Builder</h3>\n<blockquote>\n<p>Don&#8217;t forget to check our Ultimate mega addon for Elementor page Builder.<br />\n  <a href=\"https://wordpress.org/plugins/ht-mega-for-elementor/\" rel=\"ugc\">HT Mega – Ultimate Addons for Elementor Page Builder</a><br />\n  Includes 360 Blocks &amp; 15 Landing Pages.</p>\n</blockquote>\n<h3>Other Projects</h3>\n<p>We have a lot of plugins and extensions that might interest you. Try out other projects by following this link:</p>\n<p><strong><a href=\"https://wordpress.org/plugins/woolentor-addons/\" rel=\"ugc\">Woolentor Addons</a></strong><br />\nWoolentor is a WooCommerce page builder plugin that extends the functionality of the WooCommerce store. These Elementor Addons provide additional features and options for WooCommerce stores. Woolentor is the best alternative for ShopReady, Kadence, JetWidgets, ShopEngine, and CoDesigner. The Woolentor addons come with 50+ free Elementor widgets like Wishlist Extension Addon, Product compare, Product Filters, Product Variation Swatches, Shopify Style Checkout, Product Slider and 50+ pro Elementor Widgets like Checkout Fields Editor, Partial Payment, Email Customizer for WooCommerce with ready Email Templates, WooCommerce Email Automation, Multi Step Checkout, and many much more. Also it provide 90+ WooCommerce Elementor templates, 22+ WooCommerce Modules, and Gutenberg Blocks.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/ht-mega-for-elementor/\" rel=\"ugc\">HT Mega For Elementor</a></strong><br />\nHT Mega is an Elementor Addons that comes with custom page builder,  header builder, footer builder, mega menus, and more for your Elementor based website. The HT Mega plugin also includes a comprehensive set of Elementor widgets, readymade Elementor templates and Elementor Blocks.  HT Mega plugin works like ElementsKit, Essential Addons for Elementor, Royal Elementor Addons, Premium Addons, Happy Addons, PowerPack Addons, Unlimited Elements, Qi Addons, etc. The HT Mega plugin provides 84+ free Elementor widgets like Post Grid widget, Slider widget, Accordion widget, Elementor Forms widget, Contact Form Widget, Elementor tables, and other related items. It also provides 18+ pro widgets like Filterable Gallery Widget, Event Box Widget, Breadcrumbs Widget, Elementor Facebook Review Widget, Elementor Category List Widget, etc.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/hashbar-wp-notification-bar/\" rel=\"ugc\">Hashbar WP Notification Bar</a></strong><br />\nHashBar is a WordPress Notification Bar Plugin that enables you to create unlimited notification bars on your WordPress website. You can create as many notification bars as you want and customize their content to meet your needs.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/wp-plugin-manager/\" rel=\"ugc\">WP Plugin Manager &#8211; Deactivate plugins per page</a></strong><br />\nWP Plugin Manager is the perfect solution for those who want to disable certain plugins on specific pages or posts. With this plugin, you can easily activate or deactivate plugins on a per-page or per-post basis. Whichever plugin you don’t need you can deactivate or disable that plugin with the help of WP plugin Manager.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/extensions-for-cf7/\" rel=\"ugc\">Extensions For Cf7</a></strong><br />\nContact Form 7 is an excellent plugin for organizing your contact page. The CF7 extensions plugin includes Contact Form 7 Database, enabling Conditional Fields for Contact Form 7, etc. It allows fields to be set up as either visible or hidden depending upon the input from visitors. In addition, integrating seamlessly with Mailchimp brings leads generated every time someone fills out one form into an associated email list immediately.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/whols/\" rel=\"ugc\">Whols</a></strong><br />\nWhols is an outstanding plugin for WooCommerce that allows store owners to set wholesale prices for the products of their online stores. With Whols, you can easily add custom fields to your registration form, set minimum product requirements, and control how wholesale prices are displayed on both the shop and product detail pages. Whols work  like Wholesale Suite, B2Bking and B2B plugins.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/just-tables/\" rel=\"ugc\">Just Tables</a></strong><br />\nJustTables is a WooCommerce product table plugin that helps you easily create and manage tables for your products. It includes 28 pre-built columns with options to enable/disable, and you can add custom columns with custom fields/taxonomies. Just Tables also allows you to order table columns using drag and drop and set the number of products per page.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/swatchly/\" rel=\"ugc\">Swatchly</a></strong><br />\nSwatchly is a WooCommerce product variation swatches plugin that allows you to add color swatches to your product pages. With Swatchly, you can enable swatches for the shop, product list, and product details pages. There are three swatch types (label swatche, color swatche, image swatche), and the plugin supports multi-colored swatches.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/ht-contactform/\" rel=\"ugc\">HT Contact form</a></strong><br />\nHT Contact Form 7 Widget is an Elementor addon that allows you to easily drag and drop Contact Form 7 forms into your web pages. With the help of this plugin, you can choose your form from the drop-down list, Custom Styling Options, and add it to any page or place on your website. The HT Contact Form 7 Widget is an essential tool for anyone using Contact Form 7 on their website.</p>\n<h3>Need Help?</h3>\n<p>Is there any feature that you want to get in this plugin?<br />\nNeeds assistance to use this plugin?<br />\nFeel free to <a href=\"https://hasthemes.com/contact-us/\" rel=\"nofollow ugc\">Contact us</a></p>\n",
        "installation": "<p>This section describes how to install the HT Slider for Elementor Page Builder Plugins for WordPress get it working.</p>\n<h4>1) Install</h4>\n<h4>Install:</h4>\n<ol>\n<li>Go to the WordPress Dashboard &#8220;Add New Plugin&#8221; section.</li>\n<li>Search For &#8220;HT Slider For Elementor&#8221;.</li>\n<li>Install, then Activate it.</li>\n</ol>\n<h4>OR:</h4>\n<ol>\n<li>Unzip (if it is zipped) and Upload <code>ht-slider-for-elementor</code> folder to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "faq": "\n<dt id='can%20i%20create%20full-width%20sliders%20with%20ht%20slider%3F'>\nCan I create full-width sliders with HT Slider?\n</h4>\n<p>\n<p>Yes, HT Slider allows you to effortlessly design and customize full-width sliders that span the entire width of your webpage</p>\n</p>\n<dt id='can%20i%20create%20text-based%20sliders%20with%20ht%20slider%20for%20elementor%3F'>\nCan I create text-based sliders with HT Slider for Elementor?\n</h4>\n<p>\n<p>HT Slider offers a range of options to create text sliders that allow you to showcase captivating messages and engage your visitors.</p>\n</p>\n<dt id='is%20ht%20slider%20considered%20the%20best%20slider%20plugin%20for%20elementor%3F'>\nIs HT Slider considered the best slider plugin for Elementor?\n</h4>\n<p>\n<p>Many users consider HT Slider as one of the top choices for Elementor slider plugins, thanks to its extensive features, user-friendly interface, and seamless integration with Elementor.</p>\n</p>\n<dt id='is%20ht%20slider%20available%20as%20a%20free%20plugin%20for%20elementor%3F'>\nIs HT Slider available as a free plugin for Elementor?\n</h4>\n<p>\n<p>Yes, HT Slider does offer a free version.</p>\n</p>\n<dt id='can%20i%20use%20ht%20slider%20as%20an%20addon%20for%20elementor%20to%20enhance%20its%20slider%20capabilities%3F'>\nCan I use HT Slider as an addon for Elementor to enhance its slider capabilities?\n</h4>\n<p>\n<p>HT Slider serves as an excellent addon for Elementor, expanding its capabilities and providing you with more options to create eye-catching sliders.</p>\n</p>\n<dt id='can%20i%20create%20image%20sliders%20with%20ht%20slider%20for%20elementor%3F'>\nCan I create image sliders with HT Slider for Elementor?\n</h4>\n<p>\n<p>HT Slider provides powerful features for creating image sliders, allowing you to showcase your visual content in a captivating and interactive manner.</p>\n</p>\n<dt id='can%20i%20use%20ht%20slider%20to%20create%20banner%20sliders%3F'>\nCan I use HT Slider to create banner sliders?\n</h4>\n<p>\n<p>HT Slider allows you to design and customize banner sliders that can effectively grab the attention of your website visitors and promote your key messages or offers.</p>\n</p>\n\n",
        "changelog": "<h4>Version: 1.5.7 &#8211; Date: 2024-08-26</h4>\n<ul>\n<li>Added: Option to adjust the Slider column gap in all HT Slider Widgets</li>\n<li>Fixed: Issue with adding Center Padding in the HT Advanced Slider and HT Posts Slider Widgets</li>\n<li>Fixed: A few minor issues</li>\n<li>Tested: Compatibility with the latest version of Elementor</li>\n</ul>\n<h4>Version: 1.5.6 &#8211; Date: 2024-07-30</h4>\n<ul>\n<li>Added: Option to hide Empty Thumbnail Post in HT Posts Slider Widget</li>\n<li>Added: Option to choose between post content or post excerpt for the slide description in the HT Posts Slider Widget</li>\n<li>Fixed: Issue with adding custom link attributes in the HT Advanced Slider Widget</li>\n<li>Fixed: A few minor issues</li>\n<li>Tested: Compatibility with the latest version of WordPress</li>\n<li>Tested: Compatibility with the latest version of Elementor</li>\n</ul>\n<h4>Version: 1.5.5 &#8211; Date: 2024-06-25</h4>\n<ul>\n<li>Fixed: RTL issue in HT Slider Widget.</li>\n</ul>\n<h4>Version: 1.5.4 &#8211; Date: 2024-05-02</h4>\n<ul>\n<li>Added: Gutenberg block editor support in slide template</li>\n<li>Added: Shortcode for Gutenberg block page ([htslider])</li>\n<li>Tested: Compatibility with the latest version of Elementor</li>\n</ul>\n<h4>Version: 1.5.3 &#8211; Date: 2024-04-03</h4>\n<ul>\n<li>Fixed: Escaping issues have been resolved in multiple areas.</li>\n</ul>\n<h4>Version: 1.5.2 &#8211; Date: 2024-02-29</h4>\n<ul>\n<li>Added: Content Box Styles option in HT Advanced Slider Widget</li>\n<li>Fixed: A few minor issues</li>\n<li>Tested: Compatibility with the latest version of Elementor</li>\n</ul>\n<h4>Version: 1.5.1 &#8211; Date: 2023-08-29</h4>\n<ul>\n<li>Added: Title, Sub Title and Content Color options in HT Advanced Slider Widget</li>\n<li>Fixed: Elementor Deprecated issues</li>\n<li>Fixed: A few minor issues</li>\n</ul>\n<h4>Version: 1.5.0 &#8211; Date: 2023-08-14</h4>\n<ul>\n<li>Added: Advanced Slider widget</li>\n<li>Added: Posts Slider widget</li>\n<li>Fixed: A few minor issues</li>\n<li>Tested: Compatibility with the latest version of WordPress</li>\n<li>Tested: Compatibility with the latest version of Elementor</li>\n</ul>\n<h4>Version: 1.4.2 &#8211; Date: 2023-07-13</h4>\n<ul>\n<li>Fixed: Slider overlapping issue during page load.</li>\n</ul>\n<h4>Version: 1.4.1 &#8211; Date: 2023-07-06</h4>\n<ul>\n<li>Fixed: Template Library Image Loading Issue.</li>\n<li>Fixed: Template Library Import JSON Issue.</li>\n<li>Fixed: Recommendations Plugin Menu Tab Issue.</li>\n</ul>\n<h4>Version: 1.4.0 &#8211; Date: 2023-02-11</h4>\n<ul>\n<li>Added: Nonce verification for recommended plugins &amp; template library import. </li>\n<li>Improved: Coding standards in some areas</li>\n</ul>\n<h4>Version: 1.3.9 &#8211; Date: 2022-11-03</h4>\n<ul>\n<li>Capability with the latest WordPress version</li>\n</ul>\n<h4>Version: 1.3.8 &#8211; Date: 2022-09-13</h4>\n<ul>\n<li>Added: Recommendation Submenu</li>\n</ul>\n<h4>Version: 1.3.7 &#8211; Date: 2022-08-13</h4>\n<ul>\n<li>Compatibility with Elementor Latest Version</li>\n</ul>\n<h4>Version: 1.3.6 &#8211; Date: 2022-08-02</h4>\n<ul>\n<li>Admin panel menu category problem solve.</li>\n<li>Fixed Yoast SEO plugin conflict issue.</li>\n<li>Minor CSS issue fixed.</li>\n</ul>\n<h4>Version: 1.3.5 &#8211; Date: 2022-07-13</h4>\n<ul>\n<li>Compatibility with Elementor Latest Version</li>\n<li>Fixed register_widget_type and widgets_registered deprecated issue.</li>\n</ul>\n<h4>Version: 1.3.4 &#8211; Date: 2022-06-06</h4>\n<ul>\n<li>Capability with the latest WordPress version</li>\n<li>Minor Issue Fixed</li>\n</ul>\n<h4>Version: 1.3.3 &#8211; Date: 2022-04-09</h4>\n<ul>\n<li>Capability with the latest WordPress version</li>\n<li>Arrow Button Overlapping Problem Solve</li>\n</ul>\n<h4>Version: 1.3.2 &#8211; Date: 2022-03-31</h4>\n<ul>\n<li>Capability with the latest WordPress version</li>\n<li>Update Template Library Demo Link</li>\n<li>Update Template Library Demo API Content</li>\n<li>Update README Text Demo Link</li>\n</ul>\n<h4>Version: 1.3.1 &#8211; Date: 2022-02-06</h4>\n<ul>\n<li>Capability with latest WordPress version</li>\n</ul>\n<h4>Version: 1.3.0 &#8211; Date: 2021-11-20</h4>\n<ul>\n<li>Added : enable mouse draggable option</li>\n<li>Capability with latest WordPress version</li>\n</ul>\n<h4>Version: 1.2.9 &#8211; Date: 2021-10-10</h4>\n<ul>\n<li>Solved: Minor issue</li>\n<li>Capability with latest WordPress version</li>\n</ul>\n<h4>Version: 1.2.8 &#8211; Date: 2021-07-27</h4>\n<ul>\n<li>Added : Slider ordering option</li>\n<li>Capability with latest WordPress version</li>\n</ul>\n<h4>Version: 1.2.5 &#8211; Date: 2021-03-13</h4>\n<ul>\n<li>Solved: jQuery issue</li>\n</ul>\n<h4>Version: 1.2.3 &#8211; Date: 2021-03-13</h4>\n<ul>\n<li>Capability with latest WordPress version</li>\n</ul>\n<h4>Version: 1.0.8 &#8211; Date: 2020-08-13</h4>\n<ul>\n<li>Capability with latest WordPress version</li>\n</ul>\n<h4>Version: 1.0.8 &#8211; Date: 2020-03-30</h4>\n<ul>\n<li>Added: arrow Icon option</li>\n</ul>\n<h4>Version: 1.0.7 &#8211; Date: 2020-02-16</h4>\n<ul>\n<li>Solved: Style issue</li>\n</ul>\n<h4>Version: 1.0.5 &#8211; Date: 2020-01-14</h4>\n<ul>\n<li>Improved:80 template file</li>\n</ul>\n<h4>Version: 1.0.4 &#8211; Date: 2020-01-04</h4>\n<ul>\n<li>Added:80 template</li>\n</ul>\n"
    },
    "short_description": "The HT Slider is an Elementor slider plugin that enables you to add advanced sliders to your WordPress website.",
    "description": "<p><strong><a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a></strong> For Elementor is a WordPress slider builder plugin for the popular <strong>Elementor page builder and Gutenberg block editor</strong>. It empowers you to effortlessly create and customize sliders using a drag-and-drop interface within the Elementor.</p>\n<p>With its user-friendly features, you can easily create a variety of stunning WordPress sliders and carousels like <strong>image sliders, video sliders, post slider carousels, product carousels, and more.</strong></p>\n<p>The plugin also offers a wide range of custom styling options to tailor your sliders, including slider <strong>navigation and pagination.</strong> You can also control how your sliders appear on different devices.</p>\n<p>With <a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a>, you have the freedom to showcase content from any custom post type, including WooCommerce products. Furthermore, it offers multiple layouts to display your posts within a slider.</p>\n<p><strong>👉 <a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">Purchase Pro</a> | <a href=\"https://hasthemes.com/contact-us/&quot;\" rel=\"nofollow ugc\">Support</a> 👈</strong></p>\n<p><strong>👉 <a href=\"https://theplugindemo.com/ht-slider/\" rel=\"nofollow ugc\">80+ Pre-Designed Templates Demo</a></strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Jl-hdWg2l10?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>❤️ Features:</h3>\n<ul>\n<li>Create Slides using Elementors Drag n Drop Addons or Gutenberg blocks.</li>\n<li>Display Slider using Elementor Addons/Shortcode.</li>\n<li>Custom Styling Options.</li>\n<li>Show by id and category wise.</li>\n<li>Display Posts Slide by post category, author, and excluding specific posts.</li>\n<li>Mobile and Tablet display options.</li>\n<li>Slider Navigation and paginations custom design options.</li>\n<li>Slider Navigation on/off Option.</li>\n<li>Navigation position (Default, Right Center, Bottom Left).</li>\n<li>Slider Pagination on/off Option.</li>\n<li>Pagination position (Bottom Center, Bottom Left, Bottom Right, Right Center, Left Center, and Custom with Offset X and Y).</li>\n<li>Slider Autoplay on/off Option.</li>\n</ul>\n<h3>🔥 Pro Features:</h3>\n<ul>\n<li>Support any custom post type&#8217;s content with WooCommerce products as slide.</li>\n<li>Post Slides layout( One &#8211; Five).</li>\n<li>Slide Custom content option.</li>\n<li>Slide Layout(Style One and Style Two).</li>\n<li>Individual Slide Style option for custom content slide.</li>\n<li>Slide Effect.</li>\n<li>Vertical Slide Mode.</li>\n<li>Variable Width.</li>\n<li>Arrow Icon Type(Icon, Image, Text).</li>\n<li>Arrow Custom Position.</li>\n</ul>\n<h3>✅ Pre-made Slider Templates for various categories</h3>\n<p>1.<a href=\"https://theplugindemo.com/ht-slider/?category=pets\" rel=\"nofollow ugc\"> Animal Pets Slider (4+)</a><br />\n2.<a href=\"https://theplugindemo.com/ht-slider/?category=books\" rel=\"nofollow ugc\"> Book Slider (3+)</a><br />\n3.<a href=\"https://theplugindemo.com/ht-slider/?category=car\" rel=\"nofollow ugc\"> Car &amp; Motors Slider (2+)</a><br />\n4.<a href=\"https://theplugindemo.com/ht-slider/?category=cosmetics\" rel=\"nofollow ugc\"> Cosmetic Slider (2+)</a><br />\n5.<a href=\"https://theplugindemo.com/ht-slider/?category=fashion\" rel=\"nofollow ugc\"> Fashion Slider (26+)</a><br />\n6.<a href=\"https://theplugindemo.com/ht-slider/?category=flower\" rel=\"nofollow ugc\"> Flower Slider (3+)</a><br />\n7.<a href=\"https://theplugindemo.com/ht-slider/?category=food\" rel=\"nofollow ugc\"> Food Slider (1)</a><br />\n8.<a href=\"https://theplugindemo.com/ht-slider/?category=fruits\" rel=\"nofollow ugc\"> Fruits Slider (2+)</a><br />\n9. <a href=\"https://theplugindemo.com/ht-slider/?category=furniture\" rel=\"nofollow ugc\">Furniture Slider (13+)</a><br />\n10.<a href=\"https://theplugindemo.com/ht-slider/?category=electronics\" rel=\"nofollow ugc\"> Electronics Slider (10+)</a><br />\n11.<a href=\"https://theplugindemo.com/ht-slider/?category=handmade\" rel=\"nofollow ugc\"> Handmade Slider (2+)</a><br />\n12.<a href=\"https://theplugindemo.com/ht-slider/?category=jewelry\" rel=\"nofollow ugc\"> Jewelry Slider (4+)</a><br />\n13.<a href=\"https://theplugindemo.com/ht-slider/?category=kids\" rel=\"nofollow ugc\"> Kids Slider (1)</a><br />\n14.<a href=\"https://theplugindemo.com/ht-slider/?category=kitchen\" rel=\"nofollow ugc\"> Kitchen Slider (4+)</a><br />\n15.<a href=\"https://theplugindemo.com/ht-slider/?category=maternity\" rel=\"nofollow ugc\"> Maternity Slider (2+)</a><br />\n16.<a href=\"https://theplugindemo.com/ht-slider/?category=coffee\" rel=\"nofollow ugc\"> Matcha Coffee Slider (2+)</a><br />\n17.<a href=\"https://theplugindemo.com/ht-slider/?category=perfumes\" rel=\"nofollow ugc\"> Perfume Slider (1)</a><br />\n18.<a href=\"https://theplugindemo.com/ht-slider/?category=plant\" rel=\"nofollow ugc\"> Nursery Slider (1)</a><br />\n19.<a href=\"https://theplugindemo.com/ht-slider/?category=health-beauty\" rel=\"nofollow ugc\"> Health Beauty Slider (1)</a><br />\n20.<a href=\"https://theplugindemo.com/ht-slider/?category=minimal\" rel=\"nofollow ugc\"> Minimal Slider (5+)</a><br />\n21.<a href=\"https://theplugindemo.com/ht-slider/?category=sports\" rel=\"nofollow ugc\"> Sports Slider (3+)</a><br />\n22.<a href=\"https://theplugindemo.com/ht-slider/?category=watches\" rel=\"nofollow ugc\"> Watch Slider (4+)</a><br />\n23.<a href=\"https://theplugindemo.com/ht-slider/?category=tools\" rel=\"nofollow ugc\"> Tools Equipment Slider (2+)</a><br />\n24.<a href=\"https://theplugindemo.com/ht-slider/?category=shapewear\" rel=\"nofollow ugc\"> Shapewear Slider (1)</a></p>\n<p>Elementor Slider widgets are versatile tools designed to enhance the visual storytelling of your website. HT Slider is a highly versatile and feature-rich Elementor WordPress slider plugin that empowers users to create stunning section sliders, post sliders, and content sliders with ease. This dynamic plugin serves as the perfect addon for Elementor, offering a wide range of customization options and pre-designed slider templates to choose from.</p>\n<p>Whether you need an image slider for your Elementor-powered website or want to showcase your latest blog posts using an Elementor posts slider, HT Slider has got you covered. With its intuitive interface and seamless integration with Elementor, this plugin allows you to effortlessly design and manage captivating sliders and carousel sliders that engage your audience and elevate the visual appeal of your website</p>\n<p>Whether you are an experienced designer or a beginner, this tool enables you to craft attractive sliders with dynamic content. Besides, if you want to adorn your WooCommerce site with stunning eCommerce slider, this drag drop slider builder plugin can come in handy as you can add a product slider, category slider, hero slider, and various other media sliders. By using HT Slider, you can effectively engage your audience and make your website more engaging and visually appealing.</p>\n<h3>Benefits of HT Slider Plugin for Elementor</h3>\n<h3>Numerous Pre-Designed Slider Templates</h3>\n<p>Experience the versatility of the <strong><a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a></strong> Plugin, complete with an impressive array of <strong><a href=\"https://theplugindemo.com/ht-slider/\" rel=\"nofollow ugc\">80 meticulously crafted slider templates</a>,</strong> all at your fingertips. Among these templates, you can choose one as per your needs and use it in different sections of your website such as hero section, banner, etc. It empowers you to seamlessly tailor each template to perfectly match your unique needs, ensuring a captivating visual presence on your website</p>\n<h3>Seamless Integration with Elementor</h3>\n<p><a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a> seamlessly integrates into the Elementor page builder, enhancing your design capabilities without requiring you to leave your familiar workspace. Create impressive sliders right within the Elementor interface using the intuitive drag-and-drop builder.</p>\n<h3>Dynamic Content Possibilities</h3>\n<p>Empower your sliders with a wide range of content options. <a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a> allows you to incorporate images, videos, text, buttons, and even dynamic post content. Bring your posts to life through captivating slides. This ensures that your sliders remain fresh, relevant, and engaging, making them a powerful tool for conveying your message.</p>\n<h3>Customizable Navigation and Pagination</h3>\n<p>Control the navigation and pagination elements of your sliders with ease. Tailor their appearance and behavior to match your website&#8217;s design and user experience preferences, ensuring seamless navigation through your slider content.</p>\n<h3>Responsive and Mobile-Ready</h3>\n<p>In today&#8217;s mobile-centric world, responsiveness is paramount. <a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a> ensures that your sliders adapt flawlessly to different screen sizes and devices, guaranteeing a consistent and visually pleasing experience for every visitor, regardless of their device.</p>\n<h3>Whom This Plugin is For</h3>\n<p><a href=\"https://hasthemes.com/plugins/ht-slider-pro-for-elementor/\" rel=\"nofollow ugc\">HT Slider</a> plugin is designed for a wide range of users who are looking to enhance their Elementor-powered websites with visually appealing and interactive sliders. This plugin is suitable for:</p>\n<p><strong>Website Owners:</strong> Whether you run a personal blog, a business website, or an e-commerce store, HT Slider offers you the tools to create captivating section sliders, post sliders, and content sliders that engage your audience and elevate the visual appeal of your website.<br />\nDevelopers: HT Slider provides developers with a versatile plugin to create customized sliders and carousel sliders for their clients&#8217; Elementor websites. With its extensive customization options and seamless integration with Elementor, developers can easily create sliders that align with their clients&#8217; branding and design preferences.</p>\n<p><strong>Content Creators:</strong> If you frequently publish blog posts or other dynamic content on your Elementor-powered website, HT Slider&#8217;s post slider functionality allows you to showcase your latest articles or updates in an attractive and interactive manner.</p>\n<p><strong>Designers:</strong> HT Slider serves as an excellent addon for Elementor, enabling designers to leverage its features to create visually stunning image sliders, text sliders, and banner sliders that enhance the overall aesthetics of their website designs.</p>\n<p><strong>Beginners:</strong> HT Slider offers a user-friendly interface and intuitive controls, making it accessible for beginners who may not have prior experience with creating sliders. The plugin&#8217;s pre-designed templates and easy-to-use customization options allow beginners to quickly create professional-looking sliders without any coding knowledge.</p>\n<h3>Ultimate Addons for Elementor Page Builder</h3>\n<blockquote>\n<p>Don&#8217;t forget to check our Ultimate mega addon for Elementor page Builder.<br />\n  <a href=\"https://wordpress.org/plugins/ht-mega-for-elementor/\" rel=\"ugc\">HT Mega – Ultimate Addons for Elementor Page Builder</a><br />\n  Includes 360 Blocks &amp; 15 Landing Pages.</p>\n</blockquote>\n<h3>Other Projects</h3>\n<p>We have a lot of plugins and extensions that might interest you. Try out other projects by following this link:</p>\n<p><strong><a href=\"https://wordpress.org/plugins/woolentor-addons/\" rel=\"ugc\">Woolentor Addons</a></strong><br />\nWoolentor is a WooCommerce page builder plugin that extends the functionality of the WooCommerce store. These Elementor Addons provide additional features and options for WooCommerce stores. Woolentor is the best alternative for ShopReady, Kadence, JetWidgets, ShopEngine, and CoDesigner. The Woolentor addons come with 50+ free Elementor widgets like Wishlist Extension Addon, Product compare, Product Filters, Product Variation Swatches, Shopify Style Checkout, Product Slider and 50+ pro Elementor Widgets like Checkout Fields Editor, Partial Payment, Email Customizer for WooCommerce with ready Email Templates, WooCommerce Email Automation, Multi Step Checkout, and many much more. Also it provide 90+ WooCommerce Elementor templates, 22+ WooCommerce Modules, and Gutenberg Blocks.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/ht-mega-for-elementor/\" rel=\"ugc\">HT Mega For Elementor</a></strong><br />\nHT Mega is an Elementor Addons that comes with custom page builder,  header builder, footer builder, mega menus, and more for your Elementor based website. The HT Mega plugin also includes a comprehensive set of Elementor widgets, readymade Elementor templates and Elementor Blocks.  HT Mega plugin works like ElementsKit, Essential Addons for Elementor, Royal Elementor Addons, Premium Addons, Happy Addons, PowerPack Addons, Unlimited Elements, Qi Addons, etc. The HT Mega plugin provides 84+ free Elementor widgets like Post Grid widget, Slider widget, Accordion widget, Elementor Forms widget, Contact Form Widget, Elementor tables, and other related items. It also provides 18+ pro widgets like Filterable Gallery Widget, Event Box Widget, Breadcrumbs Widget, Elementor Facebook Review Widget, Elementor Category List Widget, etc.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/hashbar-wp-notification-bar/\" rel=\"ugc\">Hashbar WP Notification Bar</a></strong><br />\nHashBar is a WordPress Notification Bar Plugin that enables you to create unlimited notification bars on your WordPress website. You can create as many notification bars as you want and customize their content to meet your needs.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/wp-plugin-manager/\" rel=\"ugc\">WP Plugin Manager &#8211; Deactivate plugins per page</a></strong><br />\nWP Plugin Manager is the perfect solution for those who want to disable certain plugins on specific pages or posts. With this plugin, you can easily activate or deactivate plugins on a per-page or per-post basis. Whichever plugin you don’t need you can deactivate or disable that plugin with the help of WP plugin Manager.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/extensions-for-cf7/\" rel=\"ugc\">Extensions For Cf7</a></strong><br />\nContact Form 7 is an excellent plugin for organizing your contact page. The CF7 extensions plugin includes Contact Form 7 Database, enabling Conditional Fields for Contact Form 7, etc. It allows fields to be set up as either visible or hidden depending upon the input from visitors. In addition, integrating seamlessly with Mailchimp brings leads generated every time someone fills out one form into an associated email list immediately.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/whols/\" rel=\"ugc\">Whols</a></strong><br />\nWhols is an outstanding plugin for WooCommerce that allows store owners to set wholesale prices for the products of their online stores. With Whols, you can easily add custom fields to your registration form, set minimum product requirements, and control how wholesale prices are displayed on both the shop and product detail pages. Whols work  like Wholesale Suite, B2Bking and B2B plugins.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/just-tables/\" rel=\"ugc\">Just Tables</a></strong><br />\nJustTables is a WooCommerce product table plugin that helps you easily create and manage tables for your products. It includes 28 pre-built columns with options to enable/disable, and you can add custom columns with custom fields/taxonomies. Just Tables also allows you to order table columns using drag and drop and set the number of products per page.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/swatchly/\" rel=\"ugc\">Swatchly</a></strong><br />\nSwatchly is a WooCommerce product variation swatches plugin that allows you to add color swatches to your product pages. With Swatchly, you can enable swatches for the shop, product list, and product details pages. There are three swatch types (label swatche, color swatche, image swatche), and the plugin supports multi-colored swatches.</p>\n<p><strong><a href=\"https://wordpress.org/plugins/ht-contactform/\" rel=\"ugc\">HT Contact form</a></strong><br />\nHT Contact Form 7 Widget is an Elementor addon that allows you to easily drag and drop Contact Form 7 forms into your web pages. With the help of this plugin, you can choose your form from the drop-down list, Custom Styling Options, and add it to any page or place on your website. The HT Contact Form 7 Widget is an essential tool for anyone using Contact Form 7 on their website.</p>\n<h3>Need Help?</h3>\n<p>Is there any feature that you want to get in this plugin?<br />\nNeeds assistance to use this plugin?<br />\nFeel free to <a href=\"https://hasthemes.com/contact-us/\" rel=\"nofollow ugc\">Contact us</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.5.7.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/ht-slider-for-elementor/assets/screenshot-1.png?rev=3107417",
            "caption": "Pre-Designed Template Library"
        },
        {
            "src": "https://ps.w.org/ht-slider-for-elementor/assets/screenshot-2.png?rev=3107417",
            "caption": "Creating Image Slides with HT Slider"
        },
        {
            "src": "https://ps.w.org/ht-slider-for-elementor/assets/screenshot-3.png?rev=3107417",
            "caption": "Creating Post Slides with HT Slider"
        },
        {
            "src": "https://ps.w.org/ht-slider-for-elementor/assets/screenshot-4.png?rev=3107417",
            "caption": "Creating Video Slides with HT Slider"
        },
        {
            "src": "https://ps.w.org/ht-slider-for-elementor/assets/screenshot-5.png?rev=3107417",
            "caption": "Customized Navigation and Pagination"
        },
        {
            "src": "https://ps.w.org/ht-slider-for-elementor/assets/screenshot-6.png?rev=3107417",
            "caption": "Slider Settings in the Dashboard"
        },
        {
            "src": "https://ps.w.org/ht-slider-for-elementor/assets/screenshot-7.png?rev=3107417",
            "caption": "HT Slider Elementor Widget"
        },
        {
            "src": "https://ps.w.org/ht-slider-for-elementor/assets/screenshot-8.png?rev=3107417",
            "caption": "Slider Content Options"
        },
        {
            "src": "https://ps.w.org/ht-slider-for-elementor/assets/screenshot-9.png?rev=3107417",
            "caption": "Slider Control Options"
        },
        {
            "src": "https://ps.w.org/ht-slider-for-elementor/assets/screenshot-10.png?rev=3107417",
            "caption": "Slider Controller Style Options"
        }
    ],
    "tags": {
        "elementor": "elementor",
        "elementor-addons": "elementor addons",
        "post-type-slider": "Post type slider",
        "slider": "slider",
        "widgets": "widgets"
    },
    "stable_tag": "1.5.7",
    "versions": {
        "1.0.2": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.0.6.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.0.7.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.0.8.zip",
        "1.0.9": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.0.9.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.2.6.zip",
        "1.2.7": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.2.7.zip",
        "1.2.8": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.2.8.zip",
        "1.2.9": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.2.9.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.3.3.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.3.8.zip",
        "1.3.9": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.3.9.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.4.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.4.2.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.5.3.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.5.4.zip",
        "1.5.5": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.5.5.zip",
        "1.5.6": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.5.6.zip",
        "1.5.7": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.1.5.7.zip",
        "trunk": "https://downloads.wordpress.org/plugin/ht-slider-for-elementor.zip"
    },
    "business_model": "commercial",
    "repository_url": "",
    "commercial_support_url": "https://portal.hasthemes.com/contact/",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/ht-slider-for-elementor/assets/banner-772x250.png?rev=3107417",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/ht-slider-for-elementor/assets/icon-128x128.png?rev=2892097"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 76,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "ht-slider-for-elementor",
            "language": "ru_RU",
            "version": "1.5.7",
            "updated": "2023-07-13 06:41:36",
            "package": "http://downloads.wordpress.org/translation/plugin/ht-slider-for-elementor/1.5.7/ru_RU.zip"
        }
    ]
}