{
    "name": "Identityplus",
    "slug": "identity-plus",
    "version": "2.4.3",
    "author": "<a href=\"https://identity.plus\">Identity Plus Inc.</a>",
    "author_profile": "https://profiles.wordpress.org/shfarr/",
    "contributors": {
        "shfarr": {
            "profile": "https://profiles.wordpress.org/shfarr/",
            "avatar": "https://secure.gravatar.com/avatar/012199bf1c61ef48257f5cecf452a362?s=96&d=monsterid&r=g",
            "display_name": "Stefan Harsan Farr"
        }
    },
    "requires": "3.9",
    "tested": "6.1.7",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/identity-plus/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 10,
    "downloaded": 1549,
    "last_updated": "2023-01-03 8:32pm GMT",
    "added": "2016-11-08",
    "homepage": "https://wordpress.org/plugins/identity-plus",
    "sections": {
        "description": "<p>Identityplus is a novel security solution based on PKI (Public Key Infrastructure) called a network of trust. It features an all-in-one 2 (ocasionally 3) factor authentication and TLS level authentication making your site more secure than ever. Additionally it enables site owners to collaborate in defending against criminality by allowing them to send feedback on certificates and their oweners. With Identityplus, when a spam is reported, we are not only preventing the same spam being posted anywhere else, we are effectively preventing the spammer sending any other kind of spam, anywhere else. Keep on reading for a brief intro into this powerful technology.</p>\n<h4>Log In, Before A Login Page</h4>\n<p>Why Identityplus Is Better Than Any 2 Factor Authentication &#8230;</p>\n<p>Whenever you deal with application level login, whether it&#8217;s one factor, two factor or any factor for that matter, you need a login page. This page must load before it gets the chance to see who is visiting, which is why Worpress has a protection against repeated login attempts. This can stop bots, to a certain degree, but if you happen to have an application vulnerability that can be used by a hacker to bypass login, whether you forgot to updated your WordPress or something totally out of your control like zero day vulnerability in PHP, your blog is toast, regardless of how many factors of authentications you have.<br />\nIdentityplus uses TLS level authentication, which means the visiting device is authenticated before the login page loads. If the proper PKI credentials are not presented by the device, the page will never, ever load. The visitor is simply directed away from the sensitive page and hence is unable to perform any kind of attack, be that brute force, credential theft or zero day for that matter. No login page, no problem &#8230;</p>\n<h4>A VPN Into Your Admin Panel</h4>\n<p>Make Your Admin Panel Accessible Only From Your Computers &#8230;</p>\n<p>Having a PKI indenity in your browser is a powreful thing. Because the server expects that identity to be there, it does not only limit access by the user, it also limits access based on computer. As such, your admin panel becomes literally inaccessible from any other computer in the world. To access your admin panel, a hacker must steal your computer and access it from there.</p>\n<h4>SSO Like Never Before</h4>\n<p>Simpler, Faster, More Secure. Sign In Without Having To Do Anyting &#8230;</p>\n<p>Once you start using Identityplus, you will see you are hardly asked to do anything, you&#8217;ll just notice you are logged in. Don&#8217;t get scared, you are logged in because your computer is certified and it&#8217;s being identified before you would have the chance to do anything. But since you also logged in with your password or your fingerprint into the device you are using (laptop / mobile phone), you are actually performing 2 factor authentication without even noticing it. You will occasionally notice however, as your certificate becomes idle, that you are being asked for your Identityplus PIN. That&#8217;s actually the third factor authentication, all in one solution</p>\n<h4>A Network Of Trust</h4>\n<p>Reward Good Deeds And Block The Spammer, Not The Only Spam &#8230;</p>\n<p>When devices wear an impossible to forge identity, something amazing happens: if you restrict access to your comment section to devices with Identityplus certificates, whever you approve a comment, you are sending tokens of trust to the owner of that certificate telling Identityplus that you trust the owner. Now other blogs can trust him too, and he is steadily building a profile that defferentiates him from any malicius bot. Conversely, when you mark a comment as spam, you&#8217;ll be telling Identityplus that this is a malicious entity, and we block the certificate making sure the device can&#8217;t be used to post spam again. Now we are no longer only stopping spam, we are collectively working on stopping the spammer.</p>\n<h4>Enjoy 10 Connected Users For Free</h4>\n<p>Free Certificates, Free API Up To 10 Connected Users, Unlimited Validations For Free &#8230;</p>\n<p>A connected user is a user that can be signed in automatically via Identityplus into a service using Identityplus. If that service is your personal blog, you probably don&#8217;t have more than 10 users who regularly sign into the administrative section of your WordPress installation. If that&#8217;s the case, you will never have to pay for Identityplus. Visitors that comment with Identityplus accounts that are not connected to local accounts do not count. For this reason the plugin will only connect administrator accouns by default. If you need log more than 10 users into your back-end, you&#8217;ll need a business account, the cost of which scales with the number of your active users. Check our the pricing section for details.</p>\n<h3>2.4.3</h3>\n<p>Tested with WordPress 6.1.1</p>\n<h3>2.4.2</h3>\n<p>Minor bug fixes and tested with WordPress 6.0</p>\n<h3>2.4.1</h3>\n<p>Minor bug fixes</p>\n<h3>2.4</h3>\n<p>Tested with WordPress 5.7</p>\n<h3>2.3</h3>\n<p>Minor update and tested with WordPress 5.5</p>\n<h3>2.2</h3>\n<p>Tested with WordPress 5.3.2</p>\n<h3>2.1</h3>\n<p>We&#8217;ve replaced the necessity to validate the domain with an uploaded file with an automatic callback to achieve even less friction when you install the plug in.</p>\n<h3>2.0</h3>\n<p>This is a major update. We recommend deactivating the &#8220;Enforce Identity + Device Certificate&#8221; flag for safety during certificate update.</p>\n<p>Added automatic &amp; one click API certificate renewal. This grately improves user experience for maitaining the Identity Plus plugin and prevents accidental certificate expiration, which may cause service outage.<br />\nIntegrated the new service installation proces via automated wizard. It is no longer needed for the user to log into identity plus account and issue certificate before installation. Using the mobile application, or registered device, you can now onboard the service, issue the certificate and activate identity plus in one short flow.<br />\nWe&#8217;ve also moved the certificate storage from file to the database for enhanced security.</p>\n<h3>1.6.4</h3>\n<p>Minor bug fix</p>\n<h3>1.6.3</h3>\n<p>Moved the legacy certificate validation endpoint from https://get.identity.plus to https://signon.identity.plus. The get endpoint will now exclussively handle the certificate issuing and installation process.</p>\n<p>If you encounter problems while using legacy redirect and you land on get. subdomain, simply click the &#8220;back to single sign on&#8221; link to return to original flow. Please update your plugin to avoid this behavior. Sorry for the inconvenience.</p>\n<h3>1.6.2</h3>\n<p>Minor bug fix</p>\n<h3>1.6.1</h3>\n<p>Minor bug fix</p>\n<h3>1.6</h3>\n<p>Migrated to v1.1 Identityplus API. Identityplus plugin now allows individual wordpress users to connect their accounts on-demand. This new version also lifted the 10 accounts limit for non-corporate certificates, meaning that not-for-profit sites (public benefit or personal sites that produce no revenue) can connect any number of accounts at no cost.</p>\n<h4>1.5</h4>\n<p>Verified compatibility with WordPress 4.9.8.<br />\nCorrected minor bugs.</p>\n<h4>1.4 beta</h4>\n<p>Verified compatibility with WordPress 4.9.1.<br />\nCorrected minor bugs.</p>\n<h4>1.2 beta</h4>\n<p>Corrected WordPress coding practice issues and fixing</p>\n<h4>1.1 beta</h4>\n<p>We&#8217;ve restricted automatic login for pages that are filtered so that bots would not be bothered by the presence of the plugin.</p>\n<h4>1.0 beta</h4>\n<p>Version 1.0 beta is the first version of the Identityplus plugin, and it contains the minimum set of functionality and configuration options. Nevertheless, it will give your site an incredible security boost and at the same time it will improve user experience. Please take a moment to familiarize yourself with the core concepts so that you can take maximum advantage of this powerful security technology.</p>\n",
        "installation": "<p>A step by step installation instruction of the Identityplus WordPress plugin &#8230;</p>\n<p>Hopefully you will not encounter difficulties during the installation process but if you, feel free to send us a support request and we&#8217;ll help clarify things. That said, the installation does not require you to have any special knowledge, just follow the steps and enjoy the end result:</p>\n<h4>DOWLOAD &amp; ACTIVATE THE PLUGIN</h4>\n<ol>\n<li>You will need access to your Worpress installation files, and we recommend that you have the latest Worpress although we&#8217;ve tested the plugin back to WordPress 3.9.</li>\n<li>We recommend you start by downloading the Identityplus Worpress Plugin.</li>\n<li>Upload it into the /wp-content/plugins directory of your WordPress, alongside your other plugins, using your favorite method (ftp, sftp, scp, etc&#8230;)</li>\n<li>Activate the plugin and go to the Settings/Identityplus section. You will see an error that the certificate is missing but that is normal at this stage.</li>\n</ol>\n<h4>SIGN UP FOR Identityplus AND AUTHENTICATE YOUR BROWSER</h4>\n<ol>\n<li>Sign up for an Identityplus account, if you haven&#8217;t already.</li>\n<li>Install a certificate on your browser to access all the sections of your Identityplus account.</li>\n<li>We recommend you certify your other devices at this stage (mobile, tabled, whatever you have).</li>\n<li>Please don&#8217;t forget to set up a PIN, you will have to use it occasionally if your certificate becomes idle.</li>\n</ol>\n<h4>ISSUE AN API CERTIFICATE FOR YOUR WEB SITE</h4>\n<ol>\n<li>In your Identityplus dashboard, hit &#8220;Advanced&#8221; and select &#8220;API Domains&#8221;</li>\n<li>Add your blog&#8217;s domain. For example if your blog can be found at http://www.myblog.me, then the domain you register should be &#8220;www.myblog.me&#8221;.</li>\n<li>After adding it you need to verify your ownership of the domain, by downloading a file from Identityplus, uploading it into the root of your website and than click verify. Sorry, but this is an essential security step, both for you to make sure you specified the domain correctly but also to prevent others from impersonating your site.</li>\n<li>Now you can go to the &#8220;API Certificates&#8221; section, click &#8220;Add Web Site&#8221;. Follow the steps to issue the certificate: select the domain, select the type of certificate and hit next.</li>\n<li>At this stage you will have access to the password the certificate will be encrypted with. Copy it into the clipboard and paste it into the designated space in the Identityplus configuration in your WordPress.</li>\n<li>Download the certificate from your Identityplus Dashboard and upload it into the Identityplus settings of your Worpress instance. (hit save settings)</li>\n</ol>\n<h4>VERIFY</h4>\n<ol>\n<li>If everything went well so far, your local wordpress admin user is already bound to your Identityplus account and you are almost done.</li>\n<li>You can see this in the &#8220;Behavior&#8221; section. Make sure your user is bound before you continue to prevent locking yourself out of your WordPress.</li>\n<li>Best way to test this, is by taking your other device that is connected with Identityplus, the one you don&#8217;t regularly use to visit your /wp-admin section, and go to your bolgs /wp-admin section. If you are logged in automatically, your are all set.</li>\n<li>Alternatuvely, you can selectively delete all the cookies that were set by your blog to invalidate your session and log in.</li>\n<li>You can also test it by trying to log out of WordPress (this will delete your authentication cookies). If you are logged back in immediately Identityplus is working.</li>\n</ol>\n<h4>CONFIGURE</h4>\n<ol>\n<li>By checking &#8220;Enforce Identityplus Device Certificate&#8221; you make sure access to your filtered pages can only be done with valid Identityplus certificates.</li>\n<li>If you do not want users to register with your WordPress and you know only you are accessing the admin section you can also tick &#8220;Lock Down&#8221;. This means that even if the user is comming with a valid Identityplus certificate, but that certificate is not any one that is already connected, access will be denied.</li>\n<li>That is all, no more bots on your login page. You can also enforce the use of Identityplus certificates for commenting, this will give you the power to block the spammer whenever you mark a comment as spam and be an active participant in the Network of Trust.</li>\n<li>You can try accessing your wp-admin section from a different computer, see what happens and enjoy piece of mind.</li>\n</ol>\n<h4>EXTREME MEASURES</h4>\n<ol>\n<li>If the certificate in your browser expires, or you manually revoke it you will not be able to access your blog. This conflict needs to be resolved on Identityplus. Simply issue a new certificate for your browser, install it and all will be back to normal.</li>\n<li>You lose your device and it&#8217;s connected to your Identityplus. Take your other device, go to Identityplus and revoke the certificate of your lost device. This will revoke access to any Identityplus bound account, so you are safe.</li>\n<li>\n<p>You locked your self out of your WordPress. No problem.</p>\n<p>a. You need to go to your Worpress back-end, (access the files).<br />\nb. In your wp-content/plugins/identity-plus/lib folder, edit the initialize.php file.<br />\nc. Uncomment this line: // if(True) return &#8220;Manually disabled &#8230;&#8221;;<br />\nd. Access your WordPress using user name and password<br />\ne. Uninstall the plugin and perform a fresh install</p>\n</li>\n</ol>\n"
    },
    "short_description": "Identityplus is a novel security solution based on PKI (Public Key Infrastructure) called a network of trust. It features an all-in-one 2 (ocasionally &hellip;",
    "description": "<p>Identityplus is a novel security solution based on PKI (Public Key Infrastructure) called a network of trust. It features an all-in-one 2 (ocasionally 3) factor authentication and TLS level authentication making your site more secure than ever. Additionally it enables site owners to collaborate in defending against criminality by allowing them to send feedback on certificates and their oweners. With Identityplus, when a spam is reported, we are not only preventing the same spam being posted anywhere else, we are effectively preventing the spammer sending any other kind of spam, anywhere else. Keep on reading for a brief intro into this powerful technology.</p>\n<h4>Log In, Before A Login Page</h4>\n<p>Why Identityplus Is Better Than Any 2 Factor Authentication &#8230;</p>\n<p>Whenever you deal with application level login, whether it&#8217;s one factor, two factor or any factor for that matter, you need a login page. This page must load before it gets the chance to see who is visiting, which is why Worpress has a protection against repeated login attempts. This can stop bots, to a certain degree, but if you happen to have an application vulnerability that can be used by a hacker to bypass login, whether you forgot to updated your WordPress or something totally out of your control like zero day vulnerability in PHP, your blog is toast, regardless of how many factors of authentications you have.<br />\nIdentityplus uses TLS level authentication, which means the visiting device is authenticated before the login page loads. If the proper PKI credentials are not presented by the device, the page will never, ever load. The visitor is simply directed away from the sensitive page and hence is unable to perform any kind of attack, be that brute force, credential theft or zero day for that matter. No login page, no problem &#8230;</p>\n<h4>A VPN Into Your Admin Panel</h4>\n<p>Make Your Admin Panel Accessible Only From Your Computers &#8230;</p>\n<p>Having a PKI indenity in your browser is a powreful thing. Because the server expects that identity to be there, it does not only limit access by the user, it also limits access based on computer. As such, your admin panel becomes literally inaccessible from any other computer in the world. To access your admin panel, a hacker must steal your computer and access it from there.</p>\n<h4>SSO Like Never Before</h4>\n<p>Simpler, Faster, More Secure. Sign In Without Having To Do Anyting &#8230;</p>\n<p>Once you start using Identityplus, you will see you are hardly asked to do anything, you&#8217;ll just notice you are logged in. Don&#8217;t get scared, you are logged in because your computer is certified and it&#8217;s being identified before you would have the chance to do anything. But since you also logged in with your password or your fingerprint into the device you are using (laptop / mobile phone), you are actually performing 2 factor authentication without even noticing it. You will occasionally notice however, as your certificate becomes idle, that you are being asked for your Identityplus PIN. That&#8217;s actually the third factor authentication, all in one solution</p>\n<h4>A Network Of Trust</h4>\n<p>Reward Good Deeds And Block The Spammer, Not The Only Spam &#8230;</p>\n<p>When devices wear an impossible to forge identity, something amazing happens: if you restrict access to your comment section to devices with Identityplus certificates, whever you approve a comment, you are sending tokens of trust to the owner of that certificate telling Identityplus that you trust the owner. Now other blogs can trust him too, and he is steadily building a profile that defferentiates him from any malicius bot. Conversely, when you mark a comment as spam, you&#8217;ll be telling Identityplus that this is a malicious entity, and we block the certificate making sure the device can&#8217;t be used to post spam again. Now we are no longer only stopping spam, we are collectively working on stopping the spammer.</p>\n<h4>Enjoy 10 Connected Users For Free</h4>\n<p>Free Certificates, Free API Up To 10 Connected Users, Unlimited Validations For Free &#8230;</p>\n<p>A connected user is a user that can be signed in automatically via Identityplus into a service using Identityplus. If that service is your personal blog, you probably don&#8217;t have more than 10 users who regularly sign into the administrative section of your WordPress installation. If that&#8217;s the case, you will never have to pay for Identityplus. Visitors that comment with Identityplus accounts that are not connected to local accounts do not count. For this reason the plugin will only connect administrator accouns by default. If you need log more than 10 users into your back-end, you&#8217;ll need a business account, the cost of which scales with the number of your active users. Check our the pricing section for details.</p>\n<h3>2.4.3</h3>\n<p>Tested with WordPress 6.1.1</p>\n<h3>2.4.2</h3>\n<p>Minor bug fixes and tested with WordPress 6.0</p>\n<h3>2.4.1</h3>\n<p>Minor bug fixes</p>\n<h3>2.4</h3>\n<p>Tested with WordPress 5.7</p>\n<h3>2.3</h3>\n<p>Minor update and tested with WordPress 5.5</p>\n<h3>2.2</h3>\n<p>Tested with WordPress 5.3.2</p>\n<h3>2.1</h3>\n<p>We&#8217;ve replaced the necessity to validate the domain with an uploaded file with an automatic callback to achieve even less friction when you install the plug in.</p>\n<h3>2.0</h3>\n<p>This is a major update. We recommend deactivating the &#8220;Enforce Identity + Device Certificate&#8221; flag for safety during certificate update.</p>\n<p>Added automatic &amp; one click API certificate renewal. This grately improves user experience for maitaining the Identity Plus plugin and prevents accidental certificate expiration, which may cause service outage.<br />\nIntegrated the new service installation proces via automated wizard. It is no longer needed for the user to log into identity plus account and issue certificate before installation. Using the mobile application, or registered device, you can now onboard the service, issue the certificate and activate identity plus in one short flow.<br />\nWe&#8217;ve also moved the certificate storage from file to the database for enhanced security.</p>\n<h3>1.6.4</h3>\n<p>Minor bug fix</p>\n<h3>1.6.3</h3>\n<p>Moved the legacy certificate validation endpoint from https://get.identity.plus to https://signon.identity.plus. The get endpoint will now exclussively handle the certificate issuing and installation process.</p>\n<p>If you encounter problems while using legacy redirect and you land on get. subdomain, simply click the &#8220;back to single sign on&#8221; link to return to original flow. Please update your plugin to avoid this behavior. Sorry for the inconvenience.</p>\n<h3>1.6.2</h3>\n<p>Minor bug fix</p>\n<h3>1.6.1</h3>\n<p>Minor bug fix</p>\n<h3>1.6</h3>\n<p>Migrated to v1.1 Identityplus API. Identityplus plugin now allows individual wordpress users to connect their accounts on-demand. This new version also lifted the 10 accounts limit for non-corporate certificates, meaning that not-for-profit sites (public benefit or personal sites that produce no revenue) can connect any number of accounts at no cost.</p>\n<h4>1.5</h4>\n<p>Verified compatibility with WordPress 4.9.8.<br />\nCorrected minor bugs.</p>\n<h4>1.4 beta</h4>\n<p>Verified compatibility with WordPress 4.9.1.<br />\nCorrected minor bugs.</p>\n<h4>1.2 beta</h4>\n<p>Corrected WordPress coding practice issues and fixing</p>\n<h4>1.1 beta</h4>\n<p>We&#8217;ve restricted automatic login for pages that are filtered so that bots would not be bothered by the presence of the plugin.</p>\n<h4>1.0 beta</h4>\n<p>Version 1.0 beta is the first version of the Identityplus plugin, and it contains the minimum set of functionality and configuration options. Nevertheless, it will give your site an incredible security boost and at the same time it will improve user experience. Please take a moment to familiarize yourself with the core concepts so that you can take maximum advantage of this powerful security technology.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/identity-plus.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "2factor": "2factor",
        "authentication": "authentication",
        "comments": "comments",
        "security": "security",
        "spam": "spam"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/identity-plus/assets/banner-772x250.png?rev=1920096",
        "high": "https://ps.w.org/identity-plus/assets/banner-1544x500.png?rev=1920096"
    },
    "icons": {
        "1x": "https://ps.w.org/identity-plus/assets/icon.svg?rev=2231176",
        "svg": "https://ps.w.org/identity-plus/assets/icon.svg?rev=2231176"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}