{
    "name": "Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)",
    "slug": "image-hover-effects-ultimate",
    "version": "9.9.4",
    "author": "<a href=\"http://www.oxilab.org/\">Biplob Adhikari</a>",
    "author_profile": "https://profiles.wordpress.org/biplob018/",
    "contributors": {
        "biplob018": {
            "profile": "https://profiles.wordpress.org/biplob018/",
            "avatar": "https://secure.gravatar.com/avatar/8c736ef242eb8b60d4df2258f7e8ca66?s=96&d=monsterid&r=g",
            "display_name": "biplob018"
        },
        "richardmallick": {
            "profile": "https://profiles.wordpress.org/richardmallick/",
            "avatar": "https://secure.gravatar.com/avatar/5135a3ffb20efc533e5a4f69293f13d6?s=96&d=monsterid&r=g",
            "display_name": "Richard"
        }
    },
    "requires": "3.0.1",
    "tested": "6.6.2",
    "requires_php": "5.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 94,
    "ratings": {
        "5": 201,
        "4": 15,
        "3": 1,
        "2": 3,
        "1": 12
    },
    "num_ratings": 232,
    "support_url": "https://wordpress.org/support/plugin/image-hover-effects-ultimate/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 20000,
    "downloaded": 584550,
    "last_updated": "2024-09-14 15:17:00",
    "added": "2016-08-06",
    "homepage": "https://www.oxilabdemos.com/image-hover",
    "sections": {
        "description": "<blockquote>\n<p><strong>Best Image Hover Effects, Captions Hover or Image Gallery Plugin for WordPress</strong></p>\n</blockquote>\n<p><strong>Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)</strong> is an impressive, lightweight, responsive Image hover effects gallery. Use modern and elegant CSS hover effects and animations. Best Used for portfolio/ gallery/image showcase items in WordPress site using shortcodes and custom post. Consider the comfort of developers, we lunch an advanced pure CSS3 based hover effect plugin named Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier). It is fully responsive. Bring your images to live with some beautiful animation and transition with this awesome plugin.</p>\n<blockquote>\n<p>Your suggestions will make this plugin even better, so  <a href=\"https://wordpress.org/support/plugin/image-hover-effects-ultimate#new-post\" title=\"let us know\" rel=\"ugc\">let us know </a> if you need any assistance or help.</p>\n</blockquote>\n<p>Hover effect on the image is an important part of creating an attractive and professional looking webpage. With Image Hover Effects or Image Gallery, you can reach your website an apex level of beautifulness. In the past, we had to rely on Javascript for getting those special images hover effect on our webpage. And that was complicated enough as firstly we had to been through complex Javascript coding which could be the scariest thing for some people. And secondly we had to hire an expensive developer for accomplishing this task. It was the biggest problem for non-programming person who wanted to develop their own site for the amateur usage or something like that, such as a personal blog or something that is not much professional, but essential. In those days they had to learn coding even though they didn’t want to, or they had to solve the coding stuff by hiring a programmer. For those reasons they had to face much complexities if they want to add a special hover effect, photo gallery or add caption hover to their webpages. But now-a-days plugin like Image Hover Effect brings us the special convenience to add captions hover/image showcase items/image hover in WordPress site using shortcodes and custom post.</p>\n<p>=Quick Links=</p>\n<ul>\n<li><a href=\"https://www.oxilabdemos.com/image-hover/\" title=\"Image Hover Features\" rel=\"nofollow ugc\">Image Hover Features </a></li>\n<li><a href=\"https://www.oxilabdemos.com/image-hover/elements-extension/\" title=\"Demo Effects\" rel=\"nofollow ugc\">Demo Effects </a></li>\n<li><a href=\"https://www.youtube.com/watch?v=SGHeoNPogbE\" title=\"How to Use (Video)\" rel=\"nofollow ugc\">How to Use (Video) </a></li>\n<li><a href=\"https://www.oxilabdemos.com/image-hover/docs/\" title=\"How to Use (Documentation)\" rel=\"nofollow ugc\">How to Use (Documentation) </a></li>\n<li><a href=\"https://wordpress.org/support/plugin/image-hover-effects-ultimate#new-post\" title=\"Help and Support\" rel=\"ugc\">Help and Support </a></li>\n</ul>\n<p>Consider the comfort of developers we’ve lunched an advanced pure CSS3 based Image hover effect plugin named Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier). A non-coding person can easily develop his/her own site by using our plugin. We designer our image hover or photo gallery plugin very handy for all users. Everybody can add a beautiful image with amazing hover style to their web page by using our plugin. Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier) WordPress plugin is fully responsive hover effect plugin with Visual Composer built into it. With this plugin a developer can easily add 500+ amazing image hover effects/caption hover (with pro version) without any scripting at all. Bring your images to live with some beautiful animation and transition hover effects with this awesome plugin. Image hover effect on your website it’s really attractive and very important part of your page. If you are looking for fast, easy caption hovers effect with simple and very beautiful, highly customizable design here is it. Caption hover or image gallery where even newbie in WordPress will be able to create your first image effect with slide show and a carousel in a few minutes. And at the same time WordPress professional developers can get advanced tools and freedom of creativity. Just download this Image Hover Effect Ultimate plugin and you’ll not look for any other Hover Effect anymore!</p>\n<p>=Advantages of the Plugin=</p>\n<p>Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier) is an impressive, lightweight, responsive hover effects plugin. We used modern and elegant CSS3 style to design the hover effects style and animations. Best use of this plugin is for image hover/caption hover/portfolio/gallery/image showcase items. In WordPress site using Shortcode and custom post make this image hover plugin more user-friendly and touch enable the feature. Image Hover Effects Ultimate a standard and intuitive WordPress Hover Effect plugin to create image effects, add carousel and a slider which have never been possible before with any free image hover plugins.</p>\n<p><strong>Built in Visual Composer Extention</strong></p>\n<p>Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier) has every feature what you can expect from a free hover and slider plugin. It has a complete, easy-to-use hover effects editor with different layers with <strong>Visual Composer</strong> built in. Oxilab Developers make this plugin easier to <strong>Visual Composer</strong> Users by adding an awesome panel for <strong>Visual Composer</strong>. Just add Your Element in Visual Composer from <strong>Image Hover Ultimate</strong> Content bar menu. Besides Visual Composer, others page builder is also working With Short Codes.</p>\n<p><strong>Works with Elementor Page Bilder</strong></p>\n<p>Elementor Page builder is an lightwight and user friendly and most faster popular page buider while a big amount of wordpress users using <strong>Elementor</strong> as there first choice. As our shortcode based and well decorated Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier) are fully compatibility with <strong>Elementor Page Builder</strong>. Perhups if you get any kind of error we provide well documentation and user support. We also Support via video tutorial to users as they can solved or use as without any hagitate.</p>\n<p>=Touch Enable Feature=</p>\n<p>Image Hover Effect Ultimate can be enjoyed in any environment. Be it on a mobile, tablet or desktop no matter which device or screen size it is, our plugin will be responsive to that. We support Touch navigation on mobile browsers. Each design of Image Hover Effects Ultimate works on any Touch Screen device very smoothly. You will find your image hover effects be very responsive on iPhone, Tabs, Android or and Smart Phone. So don’t be hesitated to publish your Hover Effects on each device you want.</p>\n<p>=SEO-friendly and best eCommerce solution=</p>\n<p>Using Image Hover Effect Ultimate WordPress Plugin a WordPress developer can easily create SEO-friendly image hover effect to individual image so that their customers simply reach to exactly the right product/item details right away. You can easily add links to your image hover to popular social media, such as Facebook, Twitter, Tumblr, Instagram, VK, Google Plus, the interest so on, so that your customers can help you to spread the word about your product! It is pretty cool, isn’t it?</p>\n<p>We designed Image Hover Effect Ultimate plugin, including some exceptional features. Our plugin is much more effective when you use this for any eCommerce website. With Image Hover Effect WordPress plugin, you can easily add an image hover item to each product page, so that your customers can see the full description about the products they’re browsing just by hovering over the image. It’s the most comprehensive solution for every eCommerce site!</p>\n<p>=Clone Image Settings=</p>\n<p>If you have multiple of images on the website this feature is really useful for you! Clone settings of one specific image effect to apply it to another image. So you can copy the styles of the source image to as many images as you need just by one click. It is a great convenience for them who need to add more images at once. They will no longer need to customize the image one by one. It is very time consuming and boring also. This clone image option you will find on the image hover list. We will discuss it in details later on.</p>\n<p>=Live Preview=</p>\n<p>With our plugin we always develop Live Preview interface, so that users will find more comfortable and interest editing with our plugin. Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  also designed with a live preview interface. You can see your customization at the live page you editing the image. It will bring a great advantage for the editors.</p>\n<p>=Built for Developers=</p>\n<p>Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  was designed to be the most developer-friendly image hover plugin available for WordPress. It was also built on top of a solid extension framework, which means different functionality is separated out into different areas in the codebase. It also means the core plugin is lightweight, but still allowing for the most flexibility. This plugin is built in visual composer. With the visual composer page builder on it developers can find the easy way to work with the popular builder they used to. Visual composer is one of the popular and effective page builder within others. So visual composer&#8217;s facility will bring our plugin more user-friendly and convenient to the developers.</p>\n<p>=Custom CSS=</p>\n<p>WordPress professional developers can get advanced tools and freedom of creativity with our plugin. They can use their custom styling within Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  WordPress plugin. Advanced developers can add their custom CSS in the plugin very easily. There’s a section we’ve left for this task.</p>\n<p>=Image Hover Key Features=</p>\n<p>=Basic Features=</p>\n<blockquote>\n<ul>\n<li><strong>Clone Hover Effects</strong> With this plugin you can use the Clone option to copy the styles of the source image to as many images as you need just by one click.</li>\n<li><strong>Auto-resizing for thumbnails and images</strong> Image Hover media manager allows you to make additional customization of the images, like: rotation, flip, crop, manual resize.</li>\n<li><strong>Implemented to avoid AJAX libs conflicts</strong> All images hover effects’ code implemented in native WordPress style as result, our image hover effects don’t have any conflicts and work really stable.</li>\n<li><strong>Font settings</strong> Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  have built in advanced text style editor options. With this convenient you have full control to customize title, caption, and description of every image.</li>\n<li><strong>Implemented in native WordPress style using native classes</strong> Image Hover Effects Ultimate fully a secure plugin. It is fully native for WordPress implemented without any hacks and tricks.</li>\n<li><strong>Classic hover layout</strong> layout of the image hover could have classic style or grid layout, every hover effect on the page could have own styles and settings. You have full control to customize them on your own.</li>\n<li><strong>Works perfectly in IE, Firefox, Safari, Opera, Chrome</strong> Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  works properly with all latest versions of the popular browsers.</li>\n<li><strong>Overlay effects</strong> all hover effects of the Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  thumbnails are highly customizable and have a full set of options.</li>\n<li><strong>Backend text settings, preview</strong> All hover effects images, titles, captions, descriptions are highly customizable and also, we have a live preview of the changes in image hover backend.</li>\n<li><strong>Optional mobile tech support</strong> Our plugin support mobile devices and you can customize responsive gallery layout settings for different screen sizes.</li>\n<li><strong>Ability to insert images into the WordPress post, page, widget</strong> Every image hovers the item could be inserted in to post, page or widget with built in short code tag or using the wizard button – short code generator in post or page editor</li>\n<li><strong>Image Alignment</strong> Alignment of the image in post or page depend on your needs. You don’t need to use HTML tags or some CSS tricks to accomplish this task. This function in the plugin going to help you to align your images hovers the way you need. Possible to select one from implementing alignment modes: left, right, center of images hovers item alignment inside a post or page content.</li>\n<li><strong>Image Padding</strong> New padding options. Define custom values in pixels for padding image block in a post or page content.  It is possible to define padding from left, right, top and bottom side individually.</li>\n<li><strong>Plugin Compatibility Settings</strong> In Image hover effect ultimate settings you can customize the general image hover plugin settings to avoid conflicts with other plugins or WordPress theme.</li>\n<li><strong>Image Hover Cache</strong> Incredible new super cache option makes your page with image hover effect load ten times faster than ever. This function use absolutely new model of the images load. When you enable caching for the more image item, it’s going to be much faster and effective to use our plugin. Your visitors will be really surprised by the speed of the page load.</li>\n</ul>\n</blockquote>\n<p>=Pro Only Features=</p>\n<blockquote>\n<ul>\n<li>Customizable 500+ hover effects – Image hover effects Ultimate is working in cooperation with hover effect interface configuration options. You can easily change styles and colors of the hover animation elements. With those default styles you’ll find multiple effects on each.</li>\n<li>Fully responsive and Mobile enables – Image hover effects ultimate is very much responsive. This plugin implemented with advanced settings for different device&#8217;s screen size.</li>\n<li>Build in color selector – With this plugin you can easily customize the color of any image, text, background image, or effect style.</li>\n<li>Build in borders and shadow settings – Image hover borders and shadows have advanced options for configuration design and style of this image hover effect interface elements.</li>\n<li>Image Hover background color – In image hover settings you can change color of the background with comfortable color picker.</li>\n<li>Image Hover background transparency – In image hover settings you can change the transparency of the background with comfortable color picker. Or you can set the decimal value on your own. </li>\n<li>Customizable hover icons – all icons of the gallery buttons fully customizable and every icon could be easily changed with build in icons wizard</li>\n<li>Image Hover font color – In image hover settings you can change color of the font with comfortable color picker.</li>\n<li>Amazing responsive style effects</li>\n<li>Unlimited hover items</li>\n<li>Custom font size both heading &amp; descriptions. </li>\n<li>650+ Google fonts. </li>\n<li>Show / Hide text underline</li>\n<li>Unlimited heading font color</li>\n<li>Unlimited description font color</li>\n<li>Texts adjustments. </li>\n<li>External link for each hover item.</li>\n<li>Show/Hide border. </li>\n<li>Open link in new tab. </li>\n<li>Custom css generating. </li>\n<li>Very easy video tutorial. </li>\n<li>24/7 Customer Support. </li>\n<li>Support within 12 hours. </li>\n</ul>\n</blockquote>\n<p>=Responsive &amp; Beautiful=</p>\n<p>**Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier) ** is a very responsive image hover plugin what is really important for the website page rank, especially for the e-commerce. Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  work on mobile devices as stable part of your website interface. This plugin’s also fully responsive and mobile devices friendly. Image Hover Effects Ultimatemakes displaying your image hover a beautiful experience, by using amazing style effects and animation ranging from slicing and sliding to fading and folding. There simply is no better way to showcase your amazing work than to make the presentation of it looks just  &hellip;</p>\n",
        "installation": "<p>We’ve made it very simple and very easy to use. The installation process of this plugin is very easy. Those who are not even a regular user or even haven’t any prior experience can easily install our product on their WP dashboard. Nevertheless, for your convenience, we left an installation instruction over here:</p>\n<blockquote>\n<p>=Option 1=<br />\n  + Download the plugin image-hover-effects-ultimate.zip from WordPress Plugin Directory.<br />\n  + Unzip the zip file and extract the plugin folder named <strong>image-hover-effects-ultimate.zip<br />\n  + Left that plugin folder into your wp-content/plugins folder.<br />\n  + Go and refresh your WordPress administration panels and from the menu bar click on Plugins.<br />\n  + Now you may see your plug-in listed under inactive plug-in tab.<br />\n  + Click active to turn your wordpress plugin on.</strong></p>\n<p>=Option 2=<br />\n  + Like the first option you have to download the zip file from download location.<br />\n  + Unzip the zip file and extract the Image Hover Effects Ultimate plugin folder.<br />\n  + Double click on the installable folder in order to get image-hover-effects-ultimate.zip.<br />\n  + Go to wordpress admin panel and press Add New from the Menu bar under plugins tab.<br />\n  + Select upload link and drug the available image Hover Effects Plugin file and click install now.<br />\n  + After successfully installed finally click on ‘activate’ to turn on.</p>\n</blockquote>\n<p>Let us know if you need any help, just open a thread into Support Forum. Don’t be hesitated to inform us about any Bugs or Conflict.</p>\n<p>=Product Activation License=</p>\n<p>On the Image Hover Effects Ultimate submenu, you’ll find a new option entitled “Product License”. Here you can Upgrade your free version plugin to Pro version. By submitting and activating the license key you’ll able to upgrade your plugin very easily from this option. Let’s see how to upgrade the plugin from Product License submenu.</p>\n<p>Go to Product License submenu&gt;&gt; Enter the Product Key&gt;&gt; Click Save Changes button&gt;&gt; Now click on Activate license. That’s all! Now within few minutes you will get update notification to update your plugins. After Update you are able to access Pro features.</p>\n<p><strong>How to Start with Image Hover Effect Ultimate</strong></p>\n<p>We make Image Hover Effect Ultimate WordPress plugin very user friendly so that users can use it without having any trouble, rather they will find interest in it. Creating hovers item on an image is very simple and intuitive here with Image Hover Effect Ultimate. Also, the admin area of Image hovers effect ultimate contains inline information that describes you the settings and possibilities that the Image hover effect ultimate plugin offers. In this part we’re going to give you some instruction on how to start adding hover item to Image hover effect. So, let’s start:</p>\n<blockquote>\n<ul>\n<li>Click the Image Hover Effects Ultimate submenu entry entitled “General Effects”. This will take you to the image hover effect creation and editing page.</li>\n<li>Now select a Style from our template list. </li>\n<li>After selecting a style you’ll need to create a name of your selected style. Now click the Save button.</li>\n<li>Now click on Add New Items and upload a valid image. </li>\n</ul>\n</blockquote>\n<p>At this point you will see the Hover Modification Form with 6 Field</p>\n<blockquote>\n<ul>\n<li>First field: &#8220;Your Title&#8221; You can enter any title, the important thing to remember is that the item width and height are limited so please enter a short title. This is important to maintain the layout of the image wrapper.</li>\n<li>Second field: &#8220;Your Description&#8221; You can quickly insert the description in the description text area. It is important to enter a short description to maintain the layout of the image wrapper.</li>\n<li>Third field: &#8220;Enter URL&#8221; Chose a button URL in this field. EX: https://www.oxilab.org</li>\n<li>Forth Field: “Bottom Text” adds bottom text here.</li>\n<li>Fifth Field: &#8220;Upload Image&#8221; to choose an image, the image can come from any source and be any size, you can also use images uploaded right from the post media Uploader. Just copy the URL of the image after you upload it.</li>\n<li>Sixth Field: “Hover Background Image” Here you can add an image for the hover background of the image.</li>\n</ul>\n</blockquote>\n<p><strong>Note</strong> Remember that you have to add a valid button URL (EX: http://google.com).</p>\n<p>After adding a style and upload an image for making hovered item you can generate the shortcodes to your site post or page. Follow these instructions below:</p>\n<blockquote>\n<ul>\n<li>Go to Dashboard.</li>\n<li>Click Add New Post or page. </li>\n<li>In your Post/Page Editor you will see a Black down arrow box within your editor.</li>\n<li>Put Any Title On Title field.</li>\n<li>Copy &amp; Paste the Shortcode from the plugin.</li>\n<li>Click Publish.</li>\n</ul>\n</blockquote>\n<p>=Customizable=</p>\n<p>Your WordPress website represents you, your brand or your company. Image Hover Effects Ultimate allows you to create your plugin, exactly as you would like. You can customize the selection and settings of color, background, borders and edges, and more. The editing interface of General Effects contains four different customizing sections. There are general, heading, description and button text modification section. Let’s discuss more about the settings of those sections…</p>\n<p>=General Settings=</p>\n<blockquote>\n<ul>\n<li><strong>Image per Row</strong> Here you can select the image number you want to show in a single row of the page. You can add highest 6 items per row. This will give you the extra convenience to work with multiple images on one page.</li>\n<li><strong>Image Radius</strong> Image Radius allows you to customize the image type. You can get a rounded shape image by increasing the value. With 50% radius value you can get a circle image. And if you need a full square image customize that here.</li>\n<li><strong>Image Width &amp; Height</strong> You can customize the image width and height here.</li>\n<li><strong>Image Margin</strong> Image Margin is designed for making the distance between image to image. The proper setting of this option your image hover gallery will have more attractive and neat look.</li>\n<li><strong>Content Padding</strong> This padding option is for generating the space around the image content.</li>\n<li><strong>Background</strong> This option is for those who don’t want to upload any image to set as hover background. They can pick a color for their image hover background in this option. </li>\n<li><strong>Content Alignment</strong> You can customize the aligning option of the image content here.</li>\n<li><strong>Open in New Tab</strong> Here you can set the direction of your image link opening. Whether you can set the link to open in a new tab or the existing tab. </li>\n<li><strong>Image Animation</strong> You can select the animation style of your image hover. Here we left the bounce, fade in, flippers, light speed, rotation entrance, sliding entrance, zoom entrance and some special style effect. </li>\n<li><strong>Animation Duration</strong> Here you can set the timing of the animation. You can choose the animation duration here with this option.  </li>\n<li><strong>Content Animation</strong> Like image animation you are able to add and customize the animation for the content. This option will allow you to choose the animation style for image hover content.</li>\n<li><strong>Inner Shadow</strong> Add some shadow to the image inner portion with this option. This feature will help you to make your image more attractive and colorful. </li>\n<li><strong>Inner Shadow Color</strong> Give some color to your image inner shadow to make the shadow visible to the viewers.</li>\n</ul>\n</blockquote>\n<p>=Heading Setting=</p>\n<blockquote>\n<ul>\n<li><strong>Font Size</strong> This option will help you to customize the font size of the content heading. You can customize the heading font size of the image hover with this option.</li>\n<li><strong>Font Color</strong> You can choose a color for the font from the color picker in this option. </li>\n<li><strong>Font Family</strong> You can use Google font-family to add your preferred font for the heading. Creating all this you will have the original Image Hover with pretty content. </li>\n<li><strong>Font Weight</strong> Font weight is for customizing the weight style of the heading font. This is a free feature for decoration the image hover content heading.</li>\n<li><strong>Heading Underline</strong> By customizing the font style you can make your image content look more attractive. Heading Underline will add the heading an extra new look and also give the text some focus. </li>\n<li><strong>Padding Bottom</strong> By generating the space between the heading content and underline you can decorate the heading much prettier.</li>\n<li><strong>Margin Bottom</strong> This option is for creating the margin to having some space between heading text and description text. Like padding bottom this option is also a free option.</li>\n</ul>\n</blockquote>\n<p>=Description Settings=</p>\n<blockquote>\n<ul>\n<li><strong>Font Size</strong> This option will help you to customize the font size of the content description. You can customize the description font size of the image hover with this option. </li>\n<li><strong>Font Color</strong> You can choose a color for the description text from the color picker in this option. </li>\n<li><strong>Font Family</strong> You can use Google font-family to add your preferred font for the description text. Creating all this you will have the original Image Hover with pretty content. </li>\n<li><strong>Font Weight</strong> Font weight is for customizing the weight style of the description text. This is a free feature for decoration the image hover content description.</li>\n<li><strong>Padding Bottom</strong> By generating the space between the description content and bottom text you can decorate the image hover content section much prettier.</li>\n</ul>\n</blockquote>\n<p>=Button Text Settings=</p>\n<blockquote>\n<ul>\n<li><strong>Font Size</strong> This option will help you to customize the font size of the content button text. You can customize the button text font size of the image hover with this option. </li>\n<li><strong>Font Color</strong> You can choose a color for the button text from the color picker in this option. </li>\n<li><strong>Font Family</strong> You can use Google font-family to add your preferred font for the button text. Creating all this you will have the original Image Hover with pretty content. </li>\n<li><strong>Background Color</strong> This option is for customizing the background color of the button text. You can select a color balancing out the hover background color, opacity and the opacity of the button text. </li>\n<li><strong>Font Weight</strong> Font weight is for customizing the weight style of the button text. This is a free feature for decoration the image hover content button.</li>\n<li><strong>Hover Color</strong> When you hover over the button the color you select from this option will be appeared on the image. This option is for customizing the hover color of the button text. </li>\n<li><strong>Hover Background</strong> You can customize the hover background color of the button text here. </li>\n<li><strong>Button Radius</strong> If you want to give a rounded shape to your image button then increase the value here. This is a free version feature.</li>\n<li><strong>Padding Top Bottom</strong> To make a bigger or smaller button, customers the Padding top bottom option. This will increase the space at the top, bottom side of the button.</li>\n<li><strong>Padding Left, Right</strong> To make a bigger or smaller button, customize the Padding left right option. This will increase the space at the left and right side of the button.</li>\n<li><strong>Button Align</strong> Customize the button alignment to accurate the button text position in your image. Set the relevant position in the image.</li>\n</ul>\n</blockquote>\n",
        "faq": "<p>WordPress image hover effects Ultimate &#8211; Caption Hover with Visual Composer Plugin</p>\n\n<dt id='whether%2C%20is%20the%20image%20hover%20effects%20support%20basic%20html%20elements%3F'>\nWhether, is the Image hover Effects support basic HTML Elements?\n</h4>\n<p>\n<p>Yes. Basic Html has a support possibility.Such as you can add ,  <strong> .</strong></p>\n</p>\n<dt id='is%20the%20image%20hover%20effects%20ultimate%20-%20captions%20hover%20with%20visual%20composer%20responsive%3F'>\nIs the Image Hover Effects Ultimate &#8211; Captions Hover with Visual Composer Responsive?\n</h4>\n<p>\n<p>Yes, reacts and displays resizing images, videos, titles and descriptions for mobile devices and tablets.</p>\n</p>\n<dt id='how%20to%20enable%20the%20image%20hover%20effects%20ultimate%20to%20in%20a%20post%20or%20page%3F'>\nHow to enable the Image hover effects ultimate to in a post or page?\n</h4>\n<p>\n<p>[iheu_ultimate_oxi id=&#8221;1&#8243;] as demo for post. You can also add into page as shortcode for page.</p>\n</p>\n<dt id='is%20image%20hover%20effects%20support%20page%20builder'>\nIs Image Hover Effects Support Page Builder\n</h4>\n<p>\n<p>Yes, On Page Builder you Use shortcode for page builder. We also add extension for Visual Composer and SiteOrgin.</p>\n</p>\n<dt id='do%20i%20make%20clone%20of%20any%20style'>\nDo i Make Clone of any Style\n</h4>\n<p>\n<p>Its too easy Chose your style from Effects List and click at Clone.</p>\n</p>\n\n"
    },
    "short_description": "Create stunning image hover effects like gallery, lightbox, comparison, or magnifier with 500+ modern, elegant, lightweight animations.",
    "description": "<blockquote>\n<p><strong>Best Image Hover Effects, Captions Hover or Image Gallery Plugin for WordPress</strong></p>\n</blockquote>\n<p><strong>Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)</strong> is an impressive, lightweight, responsive Image hover effects gallery. Use modern and elegant CSS hover effects and animations. Best Used for portfolio/ gallery/image showcase items in WordPress site using shortcodes and custom post. Consider the comfort of developers, we lunch an advanced pure CSS3 based hover effect plugin named Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier). It is fully responsive. Bring your images to live with some beautiful animation and transition with this awesome plugin.</p>\n<blockquote>\n<p>Your suggestions will make this plugin even better, so  <a href=\"https://wordpress.org/support/plugin/image-hover-effects-ultimate#new-post\" title=\"let us know\" rel=\"ugc\">let us know </a> if you need any assistance or help.</p>\n</blockquote>\n<p>Hover effect on the image is an important part of creating an attractive and professional looking webpage. With Image Hover Effects or Image Gallery, you can reach your website an apex level of beautifulness. In the past, we had to rely on Javascript for getting those special images hover effect on our webpage. And that was complicated enough as firstly we had to been through complex Javascript coding which could be the scariest thing for some people. And secondly we had to hire an expensive developer for accomplishing this task. It was the biggest problem for non-programming person who wanted to develop their own site for the amateur usage or something like that, such as a personal blog or something that is not much professional, but essential. In those days they had to learn coding even though they didn’t want to, or they had to solve the coding stuff by hiring a programmer. For those reasons they had to face much complexities if they want to add a special hover effect, photo gallery or add caption hover to their webpages. But now-a-days plugin like Image Hover Effect brings us the special convenience to add captions hover/image showcase items/image hover in WordPress site using shortcodes and custom post.</p>\n<p>=Quick Links=</p>\n<ul>\n<li><a href=\"https://www.oxilabdemos.com/image-hover/\" title=\"Image Hover Features\" rel=\"nofollow ugc\">Image Hover Features </a></li>\n<li><a href=\"https://www.oxilabdemos.com/image-hover/elements-extension/\" title=\"Demo Effects\" rel=\"nofollow ugc\">Demo Effects </a></li>\n<li><a href=\"https://www.youtube.com/watch?v=SGHeoNPogbE\" title=\"How to Use (Video)\" rel=\"nofollow ugc\">How to Use (Video) </a></li>\n<li><a href=\"https://www.oxilabdemos.com/image-hover/docs/\" title=\"How to Use (Documentation)\" rel=\"nofollow ugc\">How to Use (Documentation) </a></li>\n<li><a href=\"https://wordpress.org/support/plugin/image-hover-effects-ultimate#new-post\" title=\"Help and Support\" rel=\"ugc\">Help and Support </a></li>\n</ul>\n<p>Consider the comfort of developers we’ve lunched an advanced pure CSS3 based Image hover effect plugin named Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier). A non-coding person can easily develop his/her own site by using our plugin. We designer our image hover or photo gallery plugin very handy for all users. Everybody can add a beautiful image with amazing hover style to their web page by using our plugin. Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier) WordPress plugin is fully responsive hover effect plugin with Visual Composer built into it. With this plugin a developer can easily add 500+ amazing image hover effects/caption hover (with pro version) without any scripting at all. Bring your images to live with some beautiful animation and transition hover effects with this awesome plugin. Image hover effect on your website it’s really attractive and very important part of your page. If you are looking for fast, easy caption hovers effect with simple and very beautiful, highly customizable design here is it. Caption hover or image gallery where even newbie in WordPress will be able to create your first image effect with slide show and a carousel in a few minutes. And at the same time WordPress professional developers can get advanced tools and freedom of creativity. Just download this Image Hover Effect Ultimate plugin and you’ll not look for any other Hover Effect anymore!</p>\n<p>=Advantages of the Plugin=</p>\n<p>Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier) is an impressive, lightweight, responsive hover effects plugin. We used modern and elegant CSS3 style to design the hover effects style and animations. Best use of this plugin is for image hover/caption hover/portfolio/gallery/image showcase items. In WordPress site using Shortcode and custom post make this image hover plugin more user-friendly and touch enable the feature. Image Hover Effects Ultimate a standard and intuitive WordPress Hover Effect plugin to create image effects, add carousel and a slider which have never been possible before with any free image hover plugins.</p>\n<p><strong>Built in Visual Composer Extention</strong></p>\n<p>Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier) has every feature what you can expect from a free hover and slider plugin. It has a complete, easy-to-use hover effects editor with different layers with <strong>Visual Composer</strong> built in. Oxilab Developers make this plugin easier to <strong>Visual Composer</strong> Users by adding an awesome panel for <strong>Visual Composer</strong>. Just add Your Element in Visual Composer from <strong>Image Hover Ultimate</strong> Content bar menu. Besides Visual Composer, others page builder is also working With Short Codes.</p>\n<p><strong>Works with Elementor Page Bilder</strong></p>\n<p>Elementor Page builder is an lightwight and user friendly and most faster popular page buider while a big amount of wordpress users using <strong>Elementor</strong> as there first choice. As our shortcode based and well decorated Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier) are fully compatibility with <strong>Elementor Page Builder</strong>. Perhups if you get any kind of error we provide well documentation and user support. We also Support via video tutorial to users as they can solved or use as without any hagitate.</p>\n<p>=Touch Enable Feature=</p>\n<p>Image Hover Effect Ultimate can be enjoyed in any environment. Be it on a mobile, tablet or desktop no matter which device or screen size it is, our plugin will be responsive to that. We support Touch navigation on mobile browsers. Each design of Image Hover Effects Ultimate works on any Touch Screen device very smoothly. You will find your image hover effects be very responsive on iPhone, Tabs, Android or and Smart Phone. So don’t be hesitated to publish your Hover Effects on each device you want.</p>\n<p>=SEO-friendly and best eCommerce solution=</p>\n<p>Using Image Hover Effect Ultimate WordPress Plugin a WordPress developer can easily create SEO-friendly image hover effect to individual image so that their customers simply reach to exactly the right product/item details right away. You can easily add links to your image hover to popular social media, such as Facebook, Twitter, Tumblr, Instagram, VK, Google Plus, the interest so on, so that your customers can help you to spread the word about your product! It is pretty cool, isn’t it?</p>\n<p>We designed Image Hover Effect Ultimate plugin, including some exceptional features. Our plugin is much more effective when you use this for any eCommerce website. With Image Hover Effect WordPress plugin, you can easily add an image hover item to each product page, so that your customers can see the full description about the products they’re browsing just by hovering over the image. It’s the most comprehensive solution for every eCommerce site!</p>\n<p>=Clone Image Settings=</p>\n<p>If you have multiple of images on the website this feature is really useful for you! Clone settings of one specific image effect to apply it to another image. So you can copy the styles of the source image to as many images as you need just by one click. It is a great convenience for them who need to add more images at once. They will no longer need to customize the image one by one. It is very time consuming and boring also. This clone image option you will find on the image hover list. We will discuss it in details later on.</p>\n<p>=Live Preview=</p>\n<p>With our plugin we always develop Live Preview interface, so that users will find more comfortable and interest editing with our plugin. Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  also designed with a live preview interface. You can see your customization at the live page you editing the image. It will bring a great advantage for the editors.</p>\n<p>=Built for Developers=</p>\n<p>Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  was designed to be the most developer-friendly image hover plugin available for WordPress. It was also built on top of a solid extension framework, which means different functionality is separated out into different areas in the codebase. It also means the core plugin is lightweight, but still allowing for the most flexibility. This plugin is built in visual composer. With the visual composer page builder on it developers can find the easy way to work with the popular builder they used to. Visual composer is one of the popular and effective page builder within others. So visual composer&#8217;s facility will bring our plugin more user-friendly and convenient to the developers.</p>\n<p>=Custom CSS=</p>\n<p>WordPress professional developers can get advanced tools and freedom of creativity with our plugin. They can use their custom styling within Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  WordPress plugin. Advanced developers can add their custom CSS in the plugin very easily. There’s a section we’ve left for this task.</p>\n<p>=Image Hover Key Features=</p>\n<p>=Basic Features=</p>\n<blockquote>\n<ul>\n<li><strong>Clone Hover Effects</strong> With this plugin you can use the Clone option to copy the styles of the source image to as many images as you need just by one click.</li>\n<li><strong>Auto-resizing for thumbnails and images</strong> Image Hover media manager allows you to make additional customization of the images, like: rotation, flip, crop, manual resize.</li>\n<li><strong>Implemented to avoid AJAX libs conflicts</strong> All images hover effects’ code implemented in native WordPress style as result, our image hover effects don’t have any conflicts and work really stable.</li>\n<li><strong>Font settings</strong> Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  have built in advanced text style editor options. With this convenient you have full control to customize title, caption, and description of every image.</li>\n<li><strong>Implemented in native WordPress style using native classes</strong> Image Hover Effects Ultimate fully a secure plugin. It is fully native for WordPress implemented without any hacks and tricks.</li>\n<li><strong>Classic hover layout</strong> layout of the image hover could have classic style or grid layout, every hover effect on the page could have own styles and settings. You have full control to customize them on your own.</li>\n<li><strong>Works perfectly in IE, Firefox, Safari, Opera, Chrome</strong> Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  works properly with all latest versions of the popular browsers.</li>\n<li><strong>Overlay effects</strong> all hover effects of the Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  thumbnails are highly customizable and have a full set of options.</li>\n<li><strong>Backend text settings, preview</strong> All hover effects images, titles, captions, descriptions are highly customizable and also, we have a live preview of the changes in image hover backend.</li>\n<li><strong>Optional mobile tech support</strong> Our plugin support mobile devices and you can customize responsive gallery layout settings for different screen sizes.</li>\n<li><strong>Ability to insert images into the WordPress post, page, widget</strong> Every image hovers the item could be inserted in to post, page or widget with built in short code tag or using the wizard button – short code generator in post or page editor</li>\n<li><strong>Image Alignment</strong> Alignment of the image in post or page depend on your needs. You don’t need to use HTML tags or some CSS tricks to accomplish this task. This function in the plugin going to help you to align your images hovers the way you need. Possible to select one from implementing alignment modes: left, right, center of images hovers item alignment inside a post or page content.</li>\n<li><strong>Image Padding</strong> New padding options. Define custom values in pixels for padding image block in a post or page content.  It is possible to define padding from left, right, top and bottom side individually.</li>\n<li><strong>Plugin Compatibility Settings</strong> In Image hover effect ultimate settings you can customize the general image hover plugin settings to avoid conflicts with other plugins or WordPress theme.</li>\n<li><strong>Image Hover Cache</strong> Incredible new super cache option makes your page with image hover effect load ten times faster than ever. This function use absolutely new model of the images load. When you enable caching for the more image item, it’s going to be much faster and effective to use our plugin. Your visitors will be really surprised by the speed of the page load.</li>\n</ul>\n</blockquote>\n<p>=Pro Only Features=</p>\n<blockquote>\n<ul>\n<li>Customizable 500+ hover effects – Image hover effects Ultimate is working in cooperation with hover effect interface configuration options. You can easily change styles and colors of the hover animation elements. With those default styles you’ll find multiple effects on each.</li>\n<li>Fully responsive and Mobile enables – Image hover effects ultimate is very much responsive. This plugin implemented with advanced settings for different device&#8217;s screen size.</li>\n<li>Build in color selector – With this plugin you can easily customize the color of any image, text, background image, or effect style.</li>\n<li>Build in borders and shadow settings – Image hover borders and shadows have advanced options for configuration design and style of this image hover effect interface elements.</li>\n<li>Image Hover background color – In image hover settings you can change color of the background with comfortable color picker.</li>\n<li>Image Hover background transparency – In image hover settings you can change the transparency of the background with comfortable color picker. Or you can set the decimal value on your own. </li>\n<li>Customizable hover icons – all icons of the gallery buttons fully customizable and every icon could be easily changed with build in icons wizard</li>\n<li>Image Hover font color – In image hover settings you can change color of the font with comfortable color picker.</li>\n<li>Amazing responsive style effects</li>\n<li>Unlimited hover items</li>\n<li>Custom font size both heading &amp; descriptions. </li>\n<li>650+ Google fonts. </li>\n<li>Show / Hide text underline</li>\n<li>Unlimited heading font color</li>\n<li>Unlimited description font color</li>\n<li>Texts adjustments. </li>\n<li>External link for each hover item.</li>\n<li>Show/Hide border. </li>\n<li>Open link in new tab. </li>\n<li>Custom css generating. </li>\n<li>Very easy video tutorial. </li>\n<li>24/7 Customer Support. </li>\n<li>Support within 12 hours. </li>\n</ul>\n</blockquote>\n<p>=Responsive &amp; Beautiful=</p>\n<p>**Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier) ** is a very responsive image hover plugin what is really important for the website page rank, especially for the e-commerce. Image Hover Effects Ultimate (Image Gallery, Effects, Lightbox, Comparison or Magnifier)  work on mobile devices as stable part of your website interface. This plugin’s also fully responsive and mobile devices friendly. Image Hover Effects Ultimatemakes displaying your image hover a beautiful experience, by using amazing style effects and animation ranging from slicing and sliding to fading and folding. There simply is no better way to showcase your amazing work than to make the presentation of it looks just  &hellip;</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.9.4.zip",
    "upgrade_notice": {
        "2.9.4": "<p>*Compatible with 6.6.2\n*Fixed Ajax Bugs</p>",
        "9.9.3": "<p>*Update Admin Ajax\n*Compatible with 6.4.3</p>",
        "9.9.1": "<p>Update Admin Ajax\nCompatible with 6.3.0</p>",
        "9.9.0": "<p>Custom CSS issues\nCompatible with 6.2.2</p>",
        "9.8.6": "<p>Update Admin Ajax\nSolved json files\nCompatible with 6.2.0</p>",
        "9.8.5": "<p>Compatible with 6.1.1\nSolve XSS Issues</p>",
        "9.8.4": "<p>Compatible with 6.0.4\nSolve Magnifier issues</p>",
        "9.8.3": "<p>Compatible with 6.0.1\nSolve settings issues</p>",
        "9.8.2": "<p>Compatible with 6.0\nAdd alt tag\nSolve templates issues</p>",
        "9.8.1": "<p>Support HTML\nSupport Shortcode</p>",
        "9.8.0": "<p>Modify Admin\nAdd Validation to render html</p>",
        "9.7.3": "<p>Fixed Escape Issues</p>",
        "9.7.2": "<p>HTML Supported\nFixed Admin Bugs</p>",
        "9.7.1": "<p>Modify Admin Request</p>",
        "9.7.0": "<p>Modify Admin Request\nAdmin Query</p>",
        "9.6.2": "<p>Update Rest API Request\nAdmin Query</p>",
        "9.6.1": "<p>Edit Clone Delete Button Modify\nSolved Ajax Load</p>",
        "9.6.0": "<p>Return Clone Button\nAdd Ajax Load\nDynamic Content</p>",
        "9.5.3": "<p>Solved After Property\nModify Oxilab Template</p>",
        "9.5.2": "<p>Add Web Import Options\nView Oxilab Template \nModify Admin Panel</p>",
        "9.5.1": "<p>Add JSON Import Export Options\nRegular Update\nSupport for 5.7.2 version</p>",
        "9.5.0": "<p>Upgrade Responsive Style\nAdd 2 new Layouts into General Effects</p>",
        "9.4.3": "<p>Upgrade Admin Issue</p>",
        "9.4.1": "<p>Upgrade Admin Issue\nExtension Bugs</p>",
        "9.4.0": "<p>Upgrade Docs Issue\nCarousel Bugs</p>",
        "9.3.4": "<p>Upgrade Nested CSS Issue\nFixed Extension Bugs</p>",
        "9.3.3": "<p>Upgrade Visual Composer Issues \nFixed Bugs</p>",
        "9.3.2": "<p>Upgrade Modules</p>",
        "9.3.1": "<p>Upgrade Database Issue</p>",
        "9.3": "<p>New Amdin panel\n8 type of Effects</p>",
        "9.2": "<p>Fixed bugs</p>",
        "9.1": "<p>Fixed bugs with Page builders</p>",
        "9.0": "<p>Update Admin</p>",
        "8.9": "<p>Fixed with Gutenberg</p>",
        "8.8": "<p>Fixed Bugs\nAdded Font Awesome upto 7.1</p>",
        "8.7": "<p>Fixed Bugs</p>",
        "8.6": "<p>Fixed Bugs\nAdded Font Awesome 5.5</p>",
        "8.5": "<p>Fixed Bugs</p>",
        "8.4": "<p>Fixed Bugs</p>",
        "8.3": "<p>Update font Awesome\nAdd image Rearrange Options</p>",
        "8.2": "<p>Solved Some Responsive Data.\nAdd Mobile or Touch Device Behavior</p>",
        "8.1": "<p>Add License Option.\nUser Capabilities</p>",
        "8.0": "<p>Added Responsive Data.</p>",
        "7.5": "<p>Upgrade to Resolve Viewport Capable Hover effects.</p>",
        "7.4": "<p>Upgrade to Resolve Touchscreen Device Capable Hover effects.</p>",
        "7.3": "<p>Upgrade to Resolve Touchscreen Device Capable Hover effects. Also Solved some responsive bugs.</p>",
        "7.2": "<p>*Add hover Second Image</p>",
        "6.9.1": "<p>*Solved image Problem</p>",
        "6.9": "<p>*Added 150+ Image Hover</p>",
        "6.8.2": "<p>*Resolve Bugs</p>",
        "6.8.1": "<ul>\n<li>Add more Options</li>\n</ul>",
        "6.7.1": "<ul>\n<li>Add Visual Composer Options</li>\n</ul>",
        "6.7": "<ul>\n<li>Update Admin Panel</li>\n</ul>",
        "6.6": "<ul>\n<li>Fixed some Bugs</li>\n</ul>",
        "6.5": "<ul>\n<li>Fixed some Bugs</li>\n</ul>",
        "6.4": "<ul>\n<li>Fixed some Bugs</li>\n<li>Responsive options</li>\n</ul>",
        "6.0": "<ul>\n<li>Add More Options</li>\n<li>Complete Responsive options</li>\n</ul>",
        "4.0": "<ul>\n<li>Added Bottom text option</li>\n<li>Added Without link Image hover</li>\n</ul>",
        "3.0": "<ul>\n<li>Added more Options</li>\n<li>Fixed some Bugs</li>\n</ul>",
        "2.0": "<ul>\n<li>Update pro version</li>\n<li>improve admin panel</li>\n</ul>",
        "1.0": "<ul>\n<li>Initial Release</li>\n<li>responsive layout= 9.9.3 =\nUpdate Admin Ajax\nCompatible with 6.4.3</li>\n</ul>",
        "7.6": "<p>Resolve Bugs.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/image-hover-effects-ultimate/assets/screenshot-1.png?rev=2246163",
            "caption": "Image hover Elements with Extensions"
        },
        {
            "src": "https://ps.w.org/image-hover-effects-ultimate/assets/screenshot-2.png?rev=2246163",
            "caption": "Selecting layouts from Template Library."
        },
        {
            "src": "https://ps.w.org/image-hover-effects-ultimate/assets/screenshot-3.png?rev=2246163",
            "caption": "Set Image hover Shortcode Name."
        },
        {
            "src": "https://ps.w.org/image-hover-effects-ultimate/assets/screenshot-4.png?rev=2246163",
            "caption": "Fullly Customizable Admin panel."
        },
        {
            "src": "https://ps.w.org/image-hover-effects-ultimate/assets/screenshot-5.png?rev=2246163",
            "caption": "Popup Data Input form."
        },
        {
            "src": "https://ps.w.org/image-hover-effects-ultimate/assets/screenshot-6.png?rev=2246163",
            "caption": "Background Settings with Gradient and Image."
        },
        {
            "src": "https://ps.w.org/image-hover-effects-ultimate/assets/screenshot-7.png?rev=2246163",
            "caption": "Typography settings with Heading or Descriptions."
        },
        {
            "src": "https://ps.w.org/image-hover-effects-ultimate/assets/screenshot-8.png?rev=2246163",
            "caption": "WP Post Extension with Image Hover."
        },
        {
            "src": "https://ps.w.org/image-hover-effects-ultimate/assets/screenshot-9.png?rev=2246163",
            "caption": "Carousel or Slider Extension with Image Hover."
        },
        {
            "src": "https://ps.w.org/image-hover-effects-ultimate/assets/screenshot-10.png?rev=2246163",
            "caption": "Filter or Sorting or Slider Extension with Image Hover."
        }
    ],
    "tags": {
        "awesome-css3-effects": "awesome css3 effects",
        "awesome-image-effects": "awesome image effects",
        "css3-effects": "css3 effects",
        "responsive-image-effects": "responsive image effects",
        "top-image-effects-for-wordpress": "top image effects for wordpress."
    },
    "stable_tag": "9.9.4",
    "versions": {
        "6.8.2": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.6.8.2.zip",
        "6.9": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.6.9.zip",
        "6.9.1": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.6.9.1.zip",
        "7.2": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.7.2.zip",
        "7.3": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.7.3.zip",
        "7.5": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.7.5.zip",
        "7.6": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.7.6.zip",
        "8.0": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.8.0.zip",
        "8.1": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.8.1.zip",
        "8.2": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.8.2.zip",
        "8.3": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.8.3.zip",
        "8.4": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.8.4.zip",
        "8.5": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.8.5.zip",
        "8.6": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.8.6.zip",
        "8.7": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.8.7.zip",
        "8.8": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.8.8.zip",
        "8.9": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.8.9.zip",
        "9.0": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.0.zip",
        "9.1": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.1.zip",
        "9.2": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.2.zip",
        "9.3.0": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.3.0.zip",
        "9.3.1": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.3.1.zip",
        "9.3.2": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.3.2.zip",
        "9.3.3": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.3.3.zip",
        "9.3.4": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.3.4.zip",
        "9.4.0": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.4.0.zip",
        "9.7.0": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.7.0.zip",
        "9.7.1": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.7.1.zip",
        "9.7.2": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.7.2.zip",
        "9.8.0": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.8.0.zip",
        "9.8.1": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.8.1.zip",
        "9.8.2": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.8.2.zip",
        "9.8.3": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.8.3.zip",
        "9.8.4": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.8.4.zip",
        "9.8.5": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.8.5.zip",
        "9.8.6": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.8.6.zip",
        "9.9.0": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.9.0.zip",
        "9.9.1": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.9.1.zip",
        "9.9.2": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.9.2.zip",
        "9.9.3": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.9.3.zip",
        "9.9.4": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.9.9.4.zip",
        "trunk": "https://downloads.wordpress.org/plugin/image-hover-effects-ultimate.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.oxilab.org",
    "banners": {
        "low": "https://ps.w.org/image-hover-effects-ultimate/assets/banner-772x250.png?rev=2634065",
        "high": "https://ps.w.org/image-hover-effects-ultimate/assets/banner-1544x500.png?rev=2634065"
    },
    "icons": {
        "1x": "https://ps.w.org/image-hover-effects-ultimate/assets/icon-128x128.png?rev=2634065",
        "2x": "https://ps.w.org/image-hover-effects-ultimate/assets/icon-256x256.png?rev=2634065"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 94,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}