{
    "name": "Visitor Analytics and Lead Generation Plugin by Inbound Rocket",
    "slug": "inbound-rocket",
    "version": "1.5.4",
    "author": "<a href=\"https://inboundrocket.co/\">Inbound Rocket</a>",
    "author_profile": "https://profiles.wordpress.org/inboundrocket/",
    "contributors": {
        "inboundrocket": {
            "profile": "https://profiles.wordpress.org/inboundrocket/",
            "avatar": "https://secure.gravatar.com/avatar/3486cbfa2b504224bcbef17d9a98be96?s=96&d=monsterid&r=g",
            "display_name": "inboundrocket"
        }
    },
    "requires": "2.5",
    "tested": "4.9.26",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 82,
    "ratings": {
        "5": 6,
        "4": 1,
        "3": 0,
        "2": 1,
        "1": 1
    },
    "num_ratings": 9,
    "support_url": "https://wordpress.org/support/plugin/inbound-rocket/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 20,
    "downloaded": 8569,
    "last_updated": "2018-12-05 17:15:00",
    "added": "2015-07-23",
    "homepage": "http://wordpress.org/extend/plugins/inbound-rocket/",
    "sections": {
        "description": "<p>Most websites are designed for hit-and-run readers. People find your site, read your article, and leave. Wouldn&#8217;t it be nice if some of those people subscribe or share your amazing content?</p>\n<p>Inbound Rocket has everything you need to grow your lead list. Here are the features that makes Inbound Rocket the most powerful customer acquisition &amp; lead generation platform. For more information about the different features, check out <a href=\"https://inboundrocket.co/features/\" rel=\"nofollow ugc\">our features section on our website</a>.</p>\n<h4>Business Isn’t Business Unless It’s Personal</h4>\n<p>Proper customer acquisition starts by knowing the person you are contacting. That’s why when someone submits any form on your WordPress site, you want to know more about them. What are the pages they’ve visited, did they return multiple times, did they share certain content?</p>\n<p>Inbound Rocket’s WordPress plugin gives you the details you need so you can make your next move.</p>\n<h4>Get More Traffic To Your Website</h4>\n<p>Most online businesses dream of having a highly popular website. It’s good for your brand and ultimately serves to drive wave after wave of potential customers your way. However, dreaming about it won’t get you there — taking action is the key.</p>\n<p>By using one of sharing power-ups, you will make it more easy for your visitors to share your content and in return end up with more visitors.</p>\n<h4>Convert Your Website Visitors Into Customers</h4>\n<p>Most marketing experts agree that it takes an average of seven contacts with a prospect before they’ll buy. So the way to convert site visitors into prospects and prospects into customers (and first-time customers into repeat customers) is by building relationships over time. The only way for you to be able to start building those relationships is by capturing their email addresses.</p>\n<p>Use our conversion power-ups to prevent people from slipping through the cracks.</p>\n<h4>Get Set Up In 3 Minutes</h4>\n<p>Inbound Rocket is easy to set up because it works with your existing website and even your existing forms. We automatically find and integrate with the forms on your site, no coding required.</p>\n<p>Multisite Compatible<br />\nInbound Rocket is fully Multisite compatible. The plugin will all data to each site&#8217;s installation just fine without requiring any additional setup.</p>\n<p>Note:<br />\nInbound Rocket collects usage information about this plugin so that we can better serve our users and know what features to add. By installing and activating the Inbound Rocket for WordPress plugin you agree to these terms.</p>\n",
        "installation": "<ol>\n<li>Upload <code>plugin-name.php</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n<li>Go through the activation steps</li>\n<li>Get yourself a good cup of joe (or tea if you like tea better), sit back and see your leads coming in.</li>\n</ol>\n",
        "changelog": "<h4>1.5.4</h4>\n<p>Minor bug fix release to fix an issue with the Selection Sharer as reported by Dan Ackerman. Thanks a lot Dan for finding it!</p>\n<h4>1.5.3</h4>\n<p>It seemed the charting solution we were using is not fully compliant with the GPL rules, so in this release, we switched from Highcharts to Charts.js for our statistics dashboard and widget.</p>\n<p>While we&#8217;re at it, are you missing anything on the statistics part that will help you improve your business results? Drop us a line so we can keep on improving Inbound Rocket.</p>\n<p>Next, to that, there&#8217;s also some bug squashed and performance enhancements.</p>\n<p>Thanks a lot, Daniel from Schoolastic for reporting the issue with our Welcome Mat so we could fix it. If you&#8217;re enjoying Inbound Rocket, please consider leaving a review or rating!</p>\n<h4>1.5.2</h4>\n<p>Small bug fix in the MailChimp connector, thanks to Han van Eijden for spotting this one! Next, to that, we made our connection to Gravatar in the backend go over https by default.</p>\n<h4>1.5.1</h4>\n<p>Lots of under the hood bug fixes, thanks all for reporting them! And the introduction of a new power-up; from now on you can synchronise the leads you generate on your WordPress website also towards your aWeber newsletter lists!</p>\n<h4>1.5.0</h4>\n<p>Big news.</p>\n<p>We&#8217;ve been working on this release for quite some time now, and we think you will going to love it. So what is new?</p>\n<ul>\n<li>Awesome new &#8220;Welcome Mat&#8221; power-up. It displays a full-screen call to action that shows when visitors land on your site. Encourage your visitors to join your email list, check out your popular blog post … the possibilities are endless!</li>\n<li>Selection Sharer updates, now you can decide which sharing options to show, love LinkedIn but hate Facebook? No worries, we got you covered!</li>\n<li>Having a lot of non-returning traffic? This would have started to fill up your database with single visitor records. We’re testing an option to auto clean tracking records for people who don&#8217;t return. Resulting in a significant speed improvement! (we already did some rigid testing, but just be sure to backup your data before testing this feature for now)</li>\n<li>MailChimp has a new API, so we&#8217;ve updated it to the latest version to make sure everything keeps on working the way it should.</li>\n<li>Improvements to Scroll Boxes, there were some reports of the cookie setting not working properly. Resulting in visitors closing the scroll box and it immediately appearing back again. We squashed this bug. Next to that we added the option of “is not” in the custom rules. This mean you can now say “if post is not”, “if page is not”, “if post is not in category” and “if post type is not”.</li>\n<li>A bugfix for a bug discovered by Hans Mensink, somehow the body copy of the welcome email was not being saved correctly. Thanks a lot for reporting this one, Hans!</li>\n<li>Some other small bug fixes and speed improvements.</li>\n</ul>\n<p>If you want to be featured in our release notes, all you&#8217;ve got to do is sent us your bugs, and we&#8217;ll make sure you get the proper recognition for finding them!</p>\n<h4>1.4.0</h4>\n<p>It’s been said that “you can please some of the people all of the time, you can please all of the people some of the time. But you can’t please all of the people all of the time”. Well, today. We’re very proud to continue with our mission of pleasing some of the people some of the time with this new release of Inbound Rocket!</p>\n<p>In this release, you will find lots of speed improvements, especially during the on-boarding process. But also for anyone out there who just like to change things and save their progress 😉</p>\n<p>Next to that we&#8217;ve added a better way of tracking your visitors for the people using normal cookies and to top it all of a nice and shiny dashboard widget to track your lead generating progress straight from the dashboard.</p>\n<h4>1.3.6</h4>\n<p>Reminder for next time, never release a new version on the weekend 😉</p>\n<p>Sorry for the trouble folks. This release fixes a glitch caused by our 1.3.5 update.Thank you, Michel, for reporting! It’s now fixed again.</p>\n<p>We also made the entire Evercookie process more robust in the process. If your host doesn’t like Evercookie, we will automatically detect this and disable Evercookie tracking in favor of normal HTTP Cookies. Have a great start of the week!</p>\n<h4>1.3.5</h4>\n<p>Bugs have been smashed. Updates have been made. This update will make your in-depth lead activity views nice and shiny again 🙂</p>\n<h4>1.3.4</h4>\n<p>Minor bug fix for our existing Inbound Rocket users.</p>\n<h4>1.3.3</h4>\n<p>Not seeing anything new? That’s because this release is mostly focused on behind the scene changes especially for our new users starting with Inbound Rocket.</p>\n<p>Next to that, existing and new users now have the option to disable Evercookie for tracking and use a less intrusive way, by using normal HTTP Cookies. And of course, we had some bug fixes and improvements to make Inbound Rocket faster, better, stronger.</p>\n<p>Inbound Rocket went on a weekend retreat, drank some green juice, did lots of yoga and is coming back to you cleansed and ready to take on the next update. Namaste!</p>\n<h4>1.3.2</h4>\n<p>We brainstormed for a long time to come up with a hip and cool way of saying that this update only has some bug fixes and improvements in the on-boarding process. This is the best we came up with.</p>\n<h4>1.3.1</h4>\n<p>Don’t you hate it, when you’re working for a long time on a new and shiny release and then at the last minutes some bugs found their way into your code?</p>\n<p>It just happened to us.</p>\n<p>In this update, we’re getting our hands dirty and dug out the tiny bugs. So, just a few small bug fixes and plugin improvements then.</p>\n<h4>1.3</h4>\n<p>We love it when we&#8217;re able to add new features to Inbound Rocket, and today is the release of a new power-up which a lot of you&#8217;ve been waiting for:</p>\n<p>Scroll Boxes</p>\n<p>With Scroll Boxes, you will have a polite way to ask your visitors for their email address as they finish reading your latest blog post or when they learn about your product. It is a power-up that allows you to create boxes which can pop-up or slide-in at any time and any screen position you want.</p>\n<p><strong>Features</strong></p>\n<ul>\n<li>Create boxes containing whatever content you like: shortcodes, links, custom HTML, anything really.</li>\n<li>Show boxes automatically after scrolling down based on a percentage point or a particular element (like your comment section).</li>\n<li>Choose the box position: centered or in any corner of the screen.</li>\n<li>Choose between a fading or sliding animation for showing the box.</li>\n<li>Customize the box appearance using a few simple color &amp; dimension controls.</li>\n<li>Only load the box on individual pages, posts, etc.</li>\n<li>Control how long dismissed boxes should stay hidden.</li>\n<li>Control whether boxes should show on small screens.</li>\n</ul>\n<p>This is the most powerful power-up to date, and we&#8217;re sure you will like it as much as we do!</p>\n<p>Let us know what you think about it by dropping us an email at support@inboundrocket.co, send a message to @inboundrocket on Twitter, or leave a comment on Facebook and tell us about all the use cases you have for this power-up.</p>\n<p>Oh, and of course, we made squashed some bug and made some performance improvements on our existing features as well.</p>\n<p>Have a fantastic day!</p>\n<h4>1.2</h4>\n<p>Yeah, new features!</p>\n<p>While we love ourselves some MailChimp, we were under the impression that the other email providers were a bit under appreciated. We fixed that now by adding not just one but two new connectors for you to enjoy. How&#8217;d you like them apples!</p>\n<p>If you&#8217;re more of a Campaign Monitor user yourself or you maybe fancy this awesome plugin for WordPress called Postmatic to send emails to your visitors? We&#8217;ve got you covered. A big shout-out for the team behind Postmatic for this one as well, for their support in getting this one up and running.</p>\n<p>So let&#8217;s see, eehm what else did we pack in this release?</p>\n<ul>\n<li>Performance enhanced in a perfectly legal and organic way</li>\n<li>You get a Facebook, and you get a Facebook, everybody gets a Facebook! Oh wait, even if you&#8217;d already had Facebook, now it&#8217;s way easier to integrate your page into the Selection Sharer</li>\n<li>The statistics dashboard looked like it was missing something? Yups that&#8217;s what we thought, made some improvements to make them more clear for you.</li>\n</ul>\n<p>That&#8217;s it; we&#8217;re already hard at work on our new release, which will be packed with an amazing new power-up. Be sure to keep an eye out for that one!</p>\n<p>And as always, we love hearing from you! To provide feedback or get in touch with us, please join us in our support forums on WordPress, drop us an email at support@inboundrocket.co, send a message to @inboundrocket on Twitter, or leave a comment on Facebook and tell us about the newest tricks you’ve learned.</p>\n<h4>1.1.4</h4>\n<p>Thanks to the amazing feedback of Keiran from MadCo, we were able to track down a pesky bug affecting some forms like Gravity forms not recording data the way it should be. No worries, as usual, we took them to their friends in the wild and let them go again.</p>\n<p>If you want to be featured in our release notes, all you&#8217;ve got to do is sent us your bugs and we&#8217;ll make sure you get the proper recognition for finding them!</p>\n<h4>1.1.3</h4>\n<p>We left a small Git merger in the welcome bar, thanks Jason from Postmatic for spotting it! It’s gone now 😉</p>\n<h4>1.1.2</h4>\n<p>There a three types of bugs that are gone now:</p>\n<ul>\n<li>Fixed: Thanks to Danny Brown for noticing a bug in the Selection Sharer, it&#8217;s now fixed and working properly again</li>\n<li>Fixed: While working on a knowledge base to help give you some answer to questions you might have (now live at http://inboundrocket.co/support/), we noticed a bug in the contacts section. No worries, it&#8217;s gone now</li>\n<li>And the uh, &#8230;uh, what was the third one again? Let&#8217;s see&#8230; Selection Sharer, &#8230; Contacts, and the uh&#8230; oh wait the third one was a small feature update as requested by the awesome Mr. Brown. From now on, you can choose to have the Welcome Bar shown of mobile, on the desktop or both if that&#8217;s your thing.</li>\n</ul>\n<p>Rate us five stars and we&#8217;ll have a drink in your honor. Because it&#8217;s always 5 o&#8217;clock somewhere!</p>\n<h4>1.1.1</h4>\n<p>We&#8217;ve captured some bugs that were bothering some new and existing users, took them to the wild and let them go so they won&#8217;t be bothering you again!</p>\n<ul>\n<li>Fixed: a glitch during database install for new users</li>\n<li>Fixed: duplication of lead lists for some users</li>\n</ul>\n<h4>1.1</h4>\n<p>Just in time for the new year, we wanted to thank all of you, our amazing users, for the feedback we received for our first release. You&#8217;re the reason we get to show up to work on this and do what we love, and we never forget that.</p>\n<p>After our initial release, you&#8217;ve been asking for a couple of new features which have been covered by this update.</p>\n<p>The first thing this release includes is multilingual support. Thanks to some amazing friends we can already say this version includes Spanish, French, Dutch and German translations. We want to give a special shoutout to Yelitza, Delphine, Emma and Kathleen, who helped us greatly with getting these translations done. Want to help out by translating it into your local language? Give us a shout at hello@inboundrocket.co</p>\n<p>The second new item in this release is a new power-up that helps connect your Inbound Rocket installation to MailChimp. With this power-up, you can automatically synchronize all your new leads to your MailChimp lists (different MailChimp lists for each lead list are supported). This one has been one of greatest requests so we sure think you will like this one.</p>\n<p>Lastly, we made some changes to the overall codebase. Making it smaller and, even more, secure than it already was, squashing some small bugs in the process. This one is more of an &#8220;under the hood&#8221; fix, but it will improve the overall experience for sure.</p>\n<p>Enjoy the update!</p>\n<p>2016 is going to be an amazing year, with lots of awesomeness coming from us to you, so keep on sending in that feedback and those requests!</p>\n<h4>1.0.5</h4>\n<p>Just in time for the weekend we squashed a small bug for people using the welcome bar power-up. Despite there being none left, we still squashed some 😛</p>\n<h4>1.0.4</h4>\n<p>Thanks Norbert for spotting another minor bug in there! This release includes two smaller bug fixes which made the plugin throw some errors when you were using Elegant Themes. Sorry for that, but thankfully it was quickly fixed 🙂</p>\n<p>If you got suggestions or want to report problems, please do reach out! We’re eager to fix them. &lt;3</p>\n<p><h4>1.0.3</h4>\n</p>\n<ul>\n<li>corrected the footer links, they now point to the correct place on wordpress.org</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>fix Evercookies minified code</li>\n</ul>\n<h4>1.0.1</h4>\n<p>One day after our initial release, the award for finding the first bug goes to André! Thanks a lot André, for finding this one!</p>\n<ul>\n<li>Fixed a small bug preventing the proper uninstallation of the plugin</li>\n<li>Fixed a bug to make the plugin compatible with PHP 5.2.x</li>\n</ul>\n<p>This means that if you&#8217;re running an older version of PHP we now got you covered from 5.2.x and upwards!</p>\n<h4>1.0</h4>\n<ul>\n<li>First release</li>\n</ul>\n"
    },
    "short_description": "The easiest way to double your leads. Inbound Rocket is an easy-to-use marketing automation and lead tracking plugin for WordPress.",
    "description": "<p>Most websites are designed for hit-and-run readers. People find your site, read your article, and leave. Wouldn&#8217;t it be nice if some of those people subscribe or share your amazing content?</p>\n<p>Inbound Rocket has everything you need to grow your lead list. Here are the features that makes Inbound Rocket the most powerful customer acquisition &amp; lead generation platform. For more information about the different features, check out <a href=\"https://inboundrocket.co/features/\" rel=\"nofollow ugc\">our features section on our website</a>.</p>\n<h4>Business Isn’t Business Unless It’s Personal</h4>\n<p>Proper customer acquisition starts by knowing the person you are contacting. That’s why when someone submits any form on your WordPress site, you want to know more about them. What are the pages they’ve visited, did they return multiple times, did they share certain content?</p>\n<p>Inbound Rocket’s WordPress plugin gives you the details you need so you can make your next move.</p>\n<h4>Get More Traffic To Your Website</h4>\n<p>Most online businesses dream of having a highly popular website. It’s good for your brand and ultimately serves to drive wave after wave of potential customers your way. However, dreaming about it won’t get you there — taking action is the key.</p>\n<p>By using one of sharing power-ups, you will make it more easy for your visitors to share your content and in return end up with more visitors.</p>\n<h4>Convert Your Website Visitors Into Customers</h4>\n<p>Most marketing experts agree that it takes an average of seven contacts with a prospect before they’ll buy. So the way to convert site visitors into prospects and prospects into customers (and first-time customers into repeat customers) is by building relationships over time. The only way for you to be able to start building those relationships is by capturing their email addresses.</p>\n<p>Use our conversion power-ups to prevent people from slipping through the cracks.</p>\n<h4>Get Set Up In 3 Minutes</h4>\n<p>Inbound Rocket is easy to set up because it works with your existing website and even your existing forms. We automatically find and integrate with the forms on your site, no coding required.</p>\n<p>Multisite Compatible<br />\nInbound Rocket is fully Multisite compatible. The plugin will all data to each site&#8217;s installation just fine without requiring any additional setup.</p>\n<p>Note:<br />\nInbound Rocket collects usage information about this plugin so that we can better serve our users and know what features to add. By installing and activating the Inbound Rocket for WordPress plugin you agree to these terms.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/inbound-rocket.1.5.4.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/inbound-rocket/assets/screenshot-1.png?rev=1204699",
            "caption": "See the detailed visit history of your new leads. What are the pages they’ve visited, did they return multiple times, did they share certain content?"
        },
        {
            "src": "https://ps.w.org/inbound-rocket/assets/screenshot-2.png?rev=1204699",
            "caption": "Inbound Rocket power-up - Selection Sharer: Popover menu to share on Twitter, Facebook, LinkedIn or by email any text selected on the page with support for mobile devices (with a popunder)."
        },
        {
            "src": "https://ps.w.org/inbound-rocket/assets/screenshot-3.png?rev=1204699",
            "caption": "Inbound Rocket power-up - Click To Tweet: Easy add Click To Tweet boxes with a single click (backend)"
        },
        {
            "src": "https://ps.w.org/inbound-rocket/assets/screenshot-4.png?rev=1204699",
            "caption": "Inbound Rocket power-up - Click To Tweet: Click To Tweet box in action on the Inbound Rocket blog."
        },
        {
            "src": "https://ps.w.org/inbound-rocket/assets/screenshot-5.png?rev=1204699",
            "caption": "Inbound Rocket power-up - Welcome bar: Welcome Bar on Desktop (optimized mobile version available too)"
        },
        {
            "src": "https://ps.w.org/inbound-rocket/assets/screenshot-6.png?rev=1442041",
            "caption": "Inbound Rocket power-up - Scroll Boxes: Using Scroll Boxes you present your offerings at just the right time."
        },
        {
            "src": "https://ps.w.org/inbound-rocket/assets/screenshot-7.png?rev=1655457",
            "caption": "Inbound Rocket power-up - Welcome Mat: Our Welcome Mat power-up is one of the most effective ways to build your site’s audience that we have found."
        }
    ],
    "tags": {
        "email": "email",
        "email-form": "email form",
        "email-list": "email list",
        "selection": "selection",
        "sharing": "sharing"
    },
    "stable_tag": "1.5.4",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/inbound-rocket.1.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/inbound-rocket.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/inbound-rocket.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/inbound-rocket.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/inbound-rocket.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/inbound-rocket.1.0.5.zip",
        "1.1": "https://downloads.wordpress.org/plugin/inbound-rocket.1.1.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/inbound-rocket.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/inbound-rocket.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/inbound-rocket.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/inbound-rocket.1.1.4.zip",
        "1.2": "https://downloads.wordpress.org/plugin/inbound-rocket.1.2.zip",
        "1.3": "https://downloads.wordpress.org/plugin/inbound-rocket.1.3.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/inbound-rocket.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/inbound-rocket.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/inbound-rocket.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/inbound-rocket.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/inbound-rocket.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/inbound-rocket.1.3.6.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/inbound-rocket.1.4.0.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/inbound-rocket.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/inbound-rocket.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/inbound-rocket.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/inbound-rocket.1.5.3.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/inbound-rocket.1.5.4.zip",
        "1.5.5": "https://downloads.wordpress.org/plugin/inbound-rocket.1.5.5.zip",
        "trunk": "https://downloads.wordpress.org/plugin/inbound-rocket.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/inbound-rocket/assets/banner-772x250.png?rev=1204699",
        "high": "https://ps.w.org/inbound-rocket/assets/banner-1544x500.png?rev=1204699"
    },
    "icons": {
        "1x": "https://ps.w.org/inbound-rocket/assets/icon-128x128.png?rev=1204699",
        "2x": "https://ps.w.org/inbound-rocket/assets/icon-256x256.png?rev=1204699"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 82,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "inbound-rocket",
            "language": "de_DE",
            "version": "1.5.4",
            "updated": "2024-02-18 20:30:14",
            "package": "http://downloads.wordpress.org/translation/plugin/inbound-rocket/1.5.4/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "inbound-rocket",
            "language": "nl_NL",
            "version": "1.5.4",
            "updated": "2024-05-02 17:37:27",
            "package": "http://downloads.wordpress.org/translation/plugin/inbound-rocket/1.5.4/nl_NL.zip"
        }
    ]
}