{
    "name": "InfiniteWP Client",
    "slug": "iwp-client",
    "version": "1.13.0",
    "author": "<a href=\"http://www.revmakx.com\">Revmakx</a>",
    "author_profile": "https://profiles.wordpress.org/revmakx/",
    "contributors": {
        "infinitewp": {
            "profile": "https://profiles.wordpress.org/infinitewp/",
            "avatar": "https://secure.gravatar.com/avatar/be03f4d168fc7e1c4e732b66244e1f71?s=96&d=monsterid&r=g",
            "display_name": "infinitewp"
        },
        "amritanandh": {
            "profile": "https://profiles.wordpress.org/amritanandh/",
            "avatar": "https://secure.gravatar.com/avatar/4aadf5d18612ed1103e239eaef254db4?s=96&d=monsterid&r=g",
            "display_name": "Amrit Anandh"
        },
        "rajkuppus": {
            "profile": "https://profiles.wordpress.org/rajkuppus/",
            "avatar": "https://secure.gravatar.com/avatar/20946073cbcf008bf111f3df16084ae5?s=96&d=monsterid&r=g",
            "display_name": "Kuppuraj"
        }
    },
    "requires": "3.1",
    "tested": "6.5.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 88,
    "ratings": {
        "5": 137,
        "4": 10,
        "3": 2,
        "2": 1,
        "1": 21
    },
    "num_ratings": 171,
    "support_url": "https://wordpress.org/support/plugin/iwp-client/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 200000,
    "downloaded": 7246610,
    "last_updated": "2024-04-29 10:44am GMT",
    "added": "2012-04-02",
    "homepage": "http://infinitewp.com/",
    "sections": {
        "description": "<p><a href=\"https://infinitewp.com/\" title=\"Manage Multiple WordPress\" rel=\"nofollow ugc\">InfiniteWP</a> allows users to manage unlimited number of WordPress sites from their own server.</p>\n<p>Main features:</p>\n<ul>\n<li>Self-hosted system: Resides on your own server and totally under your control</li>\n<li>One-click updates for WordPress, plugins and themes across all your sites</li>\n<li>Instant backup and restore your entire site or just the database</li>\n<li>One-click access to all WP admin panels</li>\n<li>Bulk Manage plugins &amp; themes: Activate &amp; Deactive multiple plugins &amp; themes on multiple sites simultaneously</li>\n<li>Bulk Install plugins &amp; themes in multiple sites at once</li>\n<li>and more..</li>\n</ul>\n<p>Visit us at <a href=\"https://infinitewp.com/\" title=\"Manage Multiple WordPress\" rel=\"nofollow ugc\">InfiniteWP.com</a>.</p>\n<p>Check out the <a href=\"https://www.youtube.com/watch?v=s35ZoW95cnU\" rel=\"nofollow ugc\">InfiniteWP Overview Video</a> below.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/s35ZoW95cnU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Credits: <a href=\"http://prelovac.com/vladimir\" rel=\"nofollow ugc\">Vladimir Prelovac</a> for his worker plugin on which the client plugin is being developed.</p>\n",
        "installation": "<ol>\n<li>Upload the plugin folder to your /wp-content/plugins/ folder</li>\n<li>Go to the Plugins page and activate InfiniteWP Client</li>\n<li>If you have not yet installed the InfiniteWP Admin Panel, visit <a href=\"http://infinitewp.com/\" title=\"Manage Multiple WordPress\" rel=\"nofollow ugc\">InfiniteWP.com</a>, download the free InfiniteWP Admin Panel &amp; install on your server.</li>\n<li>Add your WordPress site to the InfiniteWP Admin Panel and start using it.</li>\n</ol>\n",
        "changelog": "<h4>1.13.0 &#8211; April 29th 2024</h4>\n<ul>\n<li>Feature: SFTP support for multicall method backups.</li>\n<li>Fix: SFTP key-based backup not working for AWS S3.</li>\n<li>Fix: Openssl verification issue in the red hat server.</li>\n<li>Fix: PHP Fatal error occurred: Uncaught mysqli_sql_exception: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near &#8216;IF&#8217; at line 1.</li>\n<li>Fix: Code snippet empty responses.</li>\n<li>Fix: The PHP dump fails when the table name is in the format &#8216;wp_example-1034&#8217;.</li>\n<li>Fix: While running Phoenix backup failed to update the IWP_backup_status option and value 0.</li>\n<li>Fix: PHP Fatal error occurred: Uncaught TypeError: openssl_verify(): Argument #2 ($signature) must be of type string, array given in /wp-content/plugins/iwp-client/helper.class.php:387 – while adding or re-adding a site on a Red hat server with PHP version 8.3.</li>\n<li>Fix: WP Engine updated the API key.</li>\n<li>Fix: The plugin and theme update issue will show as an error (the theme is at the latest version).</li>\n<li>Fix: &#8216;_iwp_redirects&#8217; logging in a slow query log for certain users.</li>\n</ul>\n<h4>1.12.5 &#8211; Jan 3rd 2024</h4>\n<ul>\n<li>Improvement: Plugin update response improved.</li>\n<li>Fix: PHP Fatal error occurred: Uncaught ArgumentCountError: Too few arguments to function IWP_MMB_S3::abortMultipartUpload(), 1 passed in /iwp-client/lib/amazon/s3IWPBackup.php</li>\n<li>Fix: PHP Fatal error occurred: Uncaught TypeError: fseek(): Argument #1 ($stream) must be of type resource, bool given in /iwp-client/backup.class.multicall.php:4356</li>\n<li>Fix: IWP Client plugin connection error while performing WP fastest plugin cache clear.</li>\n<li>Fix: Backup taken using Phoenix method not satisfying number of backups to keep.</li>\n<li>Fix: php8 related warnings fixed.</li>\n</ul>\n<h4>1.12.3.1 &#8211; Dec 8th 2023</h4>\n<ul>\n<li>Improvement: New constant (IWP_BROKEN_LINK_RESULT_LIMIT) introduced to limit the Broken Linker checker result.</li>\n<li>Improvement: PHP secure library updated.</li>\n<li>Improvement: Better naming convention adopted.</li>\n</ul>\n<h4>1.12.3 &#8211; June 30th 2023</h4>\n<ul>\n<li>Fix: PHP Fatal error occurred: Uncaught TypeError: count(): Argument #1 ($value) must be of type Countable|array, string given in iwp-client/init.php:2122</li>\n<li>Fix: WordPress database error: [Table &#8216;wp_wptc_options&#8217; doesn&#8217;t exist] SELECT &#8216;value&#8217; from &#8216;wp_wptc_options&#8217; WHERE &#8216;name&#8217;=&#8217;white_lable_details&#8217;.</li>\n<li>Fix: Incorrect core updates are displayed on the admin panel for websites with the WPML Multilingual CMS plugin installed.</li>\n</ul>\n<h4>1.12.1 &#8211; June 14th 2023</h4>\n<ul>\n<li>Feature: Added compatibility to show premium plugin/theme change log links.</li>\n<li>Improvement: Added compatibility for WooCommerce High-Performance Order Storage plugin.</li>\n<li>Improvement: Improved the process of adding new sites.</li>\n<li>Improvement: Added new hook to handle &#8220;(503) The service is currently unavailable&#8221; while backing up the site to Google Drive.</li>\n<li>Improvement: Added a new constant to skip beta WordPress update notification.</li>\n<li>Fix: Windows server not taking backup root folder for certain users.</li>\n<li>Fix: If the root folder doesn’t have permission backup will stop.</li>\n<li>Fix: Backup runs without error if the iwp_processed_iterator table is missing.</li>\n<li>Fix: Deprecated hook used: wpmu_new_blog</li>\n<li>Fix: Open admin after login case handled.</li>\n<li>Fix: &#8220;Parse error: syntax error, unexpected &#8216;?&#8217; in core.class.php on line 1290&#8221; on sites installed on a server with PHP version 5.6.</li>\n</ul>\n<h4>1.11.1 &#8211; May 4th 2023</h4>\n<ul>\n<li>Fix: InfiniteWP: Warning: settings for googledrive are empty. A dummy field is usually needed so that something is saved.</li>\n<li>Fix: If the iwp_processed_iterator table is not available the backup runs without error and in PHP 8.0 it throws a fatal error.</li>\n<li>Fix: PHP Deprecated: Using ${var} in strings is deprecated, use {$var} instead in /wp-content/plugins/iwp-client/backup/databaseencrypt.php on line 4.</li>\n<li>Fix: PHP Fatal error: Uncaught TypeError: array_slice(): Argument #1 ($array) must be of type array, bool gave in wp-content/plugins/wp-client/init.php:3283.</li>\n<li>Fix: PHP Fatal error occurred: Uncaught TypeError: array_merge(): Argument #1 must be of type array, string given.</li>\n<li>Fix: Direct post call to any search.php fails if iwp-client plugin activated.</li>\n<li>Fix: Deprecated function get_option(&#8216;siteurl&#8217;).</li>\n</ul>\n<h4>1.11.0 &#8211; Jan 10th 2023</h4>\n<ul>\n<li>Improvement: After activating maintenance mode user can see the site from the wp-admin page.</li>\n<li>Improvement: Site LiteSpeed server detection.</li>\n<li>Improvement: Autoload option changed to off for IWP_backup_history in the options table.</li>\n<li>Improvement: Staging Site wp-admin page will have a different colour theme.</li>\n<li>Fix: Phoenix backup repo is not maintaining the limit for certain users.</li>\n<li>Fix: Some users faced the error during reload data (Error message: Cannot redeclare process_file() (previously declared in export/export.php:676)).</li>\n<li>Fix: The user logout option in the All-in-one security plugin causes the IWP client plugin connection errors.</li>\n<li>Fix: cURL Error(92): HTTP/2 stream 0 was not closed cleanly: PROTOCOL_ERROR (err 1).</li>\n<li>Fix: PHP Fatal error occurred: Uncaught ArgumentCountError: array_key_exists() expects exactly 2 arguments, 1 given /usr/www//wp-content/plugins/iwp-client/init.php.</li>\n<li>Fix: MySQL Error: WordPress database error: Processing the value for the following field failed: taskResults. The supplied value may be too long or contains invalid data.</li>\n</ul>\n<h4>1.9.9 &#8211; Aug 9th 2022</h4>\n<ul>\n<li>Fix: Wordfence recent update changed the table prefix from the camel case, which caused the Client report to be unable to fetch Wordfence data.</li>\n<li>Fix: PHP 8.0 fatal error in backup if the site has the smart-slider plugin installed.</li>\n<li>Fix: WP Fastest Cache : Unable to perform WP Fastest cache error fixed.</li>\n<li>Fix: PHP 8.0 fatal and warning.</li>\n</ul>\n<h4>1.9.8 &#8211; Mar 18th 2022</h4>\n<ul>\n<li>Feature: Added customer role to the Manage user addon if Woocommerce plugin is activated on the WordPress site.</li>\n<li>Fix: iThemes 404 logs removed from client reports as the iThemes plugin do not detect 404 errors.</li>\n<li>Fix: Error in query (1064): Syntax error near offset ) values issue fixed it happen some random server.</li>\n<li>Fix: Backing up a WordPress site with wp_ prefix includes other site database tables in the single and multicall method backups.</li>\n<li>Fix: mu-plugin version not shown on the plugin page.</li>\n<li>Fix: Unable to read InfiniteWP must use plugin</li>\n</ul>\n<h4>1.9.6 &#8211; Feb 14th 2022</h4>\n<ul>\n<li>Feature: Added support for Litespeed Cache.</li>\n<li>Improvement: Ensure phpseclib Crypt_Blowfish is loaded over PEAR’s version.</li>\n<li>Improvement: Enabled support for new Dropbox OAuth Authentication.</li>\n<li>Fix: Enabled version number for InfiniteWP MU plugin loader.</li>\n<li>Fix: Undefined array key “hook_suffix” warning.</li>\n<li>Fix: Delete SFTP test backup file on the remote server.</li>\n<li>Fix: PPL addon editor image not uploaded. (issue happening from 1.9.4.9).</li>\n<li>Fix: Fatal error while backing up a 0kb file using the single call method on site installed on site with php8 server.</li>\n</ul>\n<h4>1.9.4.11 &#8211; Jun 16th 2021</h4>\n<ul>\n<li>Improvement: Amazon s3 library updated.</li>\n<li>Improvement: Wordfence data not correctly showing in Client report due to the Wordfence recent release.</li>\n<li>Improvement: wp_new_user_notification function deprecated arg removed.</li>\n<li>Improvement: New constant (IWP_PHP_DB_ROWS) introduced on the WordPress site to take more row in the PHP database dump backup method.</li>\n<li>Improvement: If MySQL Dump fails, the admin panel will automatically retry MySQL Dump with a different &#8216;max_allowed_packet&#8217; value.</li>\n<li>Improvement: Added a few locations for the MySQL dump command.</li>\n<li>Improvement: Multicall method backup speed enhanced.</li>\n<li>Improvement: Enabled support for &#8220;Exclude file size&#8221; in Phoenix method backup.</li>\n<li>Fix: Multiple Deprecated notices and Warnings when backing up a site (installed on a server with PHP8) using all backup methods.</li>\n<li>Fix: Fatal errors due to disabled PHP functions on certain hosting providers.</li>\n<li>Fix: WP Option cache causing issue in Phoenix backup on certain servers.</li>\n<li>Fix: MySQL Dump using &#8216;passthru()&#8217; function not working both single and multicall method.</li>\n<li>Fix: MySQL Dump not working if &#8216;max_allowed_packet&#8217; size has low value.</li>\n<li>Fix: open_basedir warning fixed.</li>\n</ul>\n<h4>1.9.4.8.2 &#8211; Dec 2nd 2020</h4>\n<ul>\n<li>Improvement: Improved support for the recent WordPress DB update</li>\n<li>Fix: Percentage ( % ) converted to random string after Restore the single call backup in certain databases</li>\n<li>Fix: IWP maintancemode not working if Minimal Coming Soon &amp; Maintenance Mode – Coming Soon Page plugin activated</li>\n<li>Fix: SSL verification disabled during install plugins/themes from the panel.</li>\n<li>Fix: PHP Notice: Trying to get property &#8216;old_version&#8217; of non-object in /home/public_html/wp-content/plugins/iwp-client/installer.class.php on line 250</li>\n</ul>\n<h4>1.9.4.7 &#8211; Aug 10th 2020</h4>\n<ul>\n<li>Improvement: Multicall backup iwp_file_list table prefix validation improved.</li>\n<li>Improvement: Improved compatibility for PHP 7.4 or above.</li>\n<li>Improvement: Clone,Staging and restore DB details call improved.</li>\n<li>Improvement: Website URL added in the Activation key section after activating the IWP client plugin.</li>\n<li>Improvement: Redis cache will be cleared while running the Phoenix backup.</li>\n</ul>\n<h4>1.9.4.6 &#8211; Apr 24th 2020</h4>\n<ul>\n<li>Improvement: WPMerge Temp folder Excluded on all backup methods (single call, multicall, Phoenix).</li>\n<li>Improvement: Improved Error messages for failed plugins, themes, translation updates in the process queue, and activity log.</li>\n<li>Improvement: Phoenix backup failure case detection improved.</li>\n<li>Fix: Unable to activate or network activate plugins on multisite.</li>\n<li>Fix: Add site failed for Network sites without open SSL.</li>\n<li>Fix: .rnd files created on the wp-admin folder in a few instances.</li>\n</ul>\n<h4>1.9.4.5 &#8211; Jan 8th 2020</h4>\n<ul>\n<li>Fix: Important security fix.</li>\n</ul>\n<h4>1.9.4.4 &#8211; Dec 17th 2019</h4>\n<ul>\n<li>Improvement: Implemented a new method to fetch database details for the following operations. Restore, same server staging and existing site cloning.</li>\n<li>Improvement: Support for V3 PPL addon.</li>\n<li>Improvement: Now, the WPTC plugin gets a higher priority than the IWP client plugin.</li>\n<li>Fix: File uploader throws a fatal error if the selected folder doesn&#8217;t have permission to upload.</li>\n<li>Fix: Error: &#8220;Failed to upload to Amazon S3. Please check your details and set Managed Policies on your users to AmazonS3FullAccess&#8221; while backing up the site to s3 bucket using the single call method.</li>\n<li>Fix: With the Phoenix method, Backups are shown as completed if the backup folder does not have write permission.</li>\n<li>Fix: iwp-restore-log.txt file excluded in the multicall and single call method backups.</li>\n</ul>\n<h4>1.9.4.1 &#8211; July 25th 2019</h4>\n<ul>\n<li>Feature: Full Support for Multisite Installations.</li>\n<li>Feature: SSH support &#8211; You can use your SSH keys to backup your WordPress sites.</li>\n<li>Feature: You can Encrypt your DB backups using the Phoenix backup method.</li>\n<li>Feature: Server Side encryption for Amazon S3 backups is enabled for all three backup mechanisms.</li>\n<li>Feature: Notifications for WooCommerce DB updates.</li>\n<li>Improvement: IWP client plugin will add a must-use plugin to WordPress sites.</li>\n<li>Improvement: Support for WPTC backups to include on IWP Client reports.</li>\n<li>Improvement: File Iterator process is improved in the Multicall backup method.</li>\n<li>Improvement: You can now manage the users on your Multisites.</li>\n<li>Improvement: The activation key will not be shown to subscriber users.</li>\n<li>Improvement: Enabled support for Autoptimize plugin.</li>\n<li>Improvement: &#8220;site_map.xml&#8221; and &#8220;virtual files&#8221; are excluded from the backup while backing up the site using the single and multicall method.</li>\n<li>Improvement: Phoenix backup failure retry count decreased as the backup is running for a prolonged time.</li>\n<li>Improvement: By default, backup logs will be created for the multicall backup method.</li>\n<li>Improvement: Backup debug chart added.</li>\n<li>Improvement: Added an option to exclude Database tables on backup.</li>\n<li>Improvement: Google drive and Dropbox will respect the multicall loop break time.</li>\n<li>Improvement: Curl version, SSL version are added in server info.</li>\n<li>Improvement: Response header will now have the correct HTTP version.</li>\n<li>Improvement: MySQL dump backup process improved.</li>\n<li>Improvement: Support for manage users, manage comments, broken link checker, iThemes, Wordfence and Malware Scanner addons for v3.</li>\n<li>Fix: Duo security plugin on WordPress site breaks the IWP client plugin connection while performing open admin action.</li>\n<li>Fix: Backup is retried when it failed with error &#8220;Failed to connect to content.dropboxapi.com port 443: Connection timed out. and Could not resolve host: api.dropboxapi.com.&#8221;.</li>\n<li>Fix: Plugin updates count showing in plugin menu on WP admin page while hide plugin updates setting is enabled on InfiniteWP admin panel via Client Plugin Branding.</li>\n<li>Fix: Phoenix backup SFTP or FTP not using the custom port.</li>\n<li>Fix: FTP SSL not working on Phoenix backup.</li>\n<li>Fix: Ithemes security data is not included in the client reports.</li>\n<li>Fix: Backups failed with error &#8220;Database backup failed. Try to enable MySQL dump on your server.&#8221;.</li>\n<li>Fix: Table &#8220;w1.wp_iwp_backup_status&#8221; doesnot exist , IWP will now create the table automatically instead of throwing an error.</li>\n<li>Fix: Removed FTP credentials from error messages.</li>\n<li>Fix: Few PHP 7.2 warnings are fixed.</li>\n<li>Fix: Backups taken with Phoenix method are not erased from Google drive Storage while deleting the backups from via admin panel.</li>\n<li>Fix: &#8220;<em>Number of Backups to Keep</em>&#8221; setting was not working for the Phoenix method backups.</li>\n<li>Fix: Backup entries are not removed on WordPress database table wp_iwp_backup_status while deleting the backup schedules with phoenix method.</li>\n<li>Fix: S3 verification failed: File may be corrupted.</li>\n<li>Fix: Broken link checker update link and un-dismiss options throw fatal error.</li>\n<li>Fix: Submitted input out of alignment: got [4194300] expected [4194304].</li>\n<li>Fix: Dropbox account/info did not return HTTP 200. (only for specific users).</li>\n<li>Fix: Open admin not working if iThemes hide backend option enabled.</li>\n<li>Fix: PHP Fatal error occurred: Uncaught Guzzle\\Service\\Exception\\ValidationException: Validation errors: [Key] is a required string.</li>\n<li>Fix: If dump fails, the dump .sql file will be deleted.</li>\n<li>Fix: IWP Client Plugin error, Curl 18 and Curl 92 on updates and install option due to Cloud Flare setup on WordPress sites.</li>\n</ul>\n<h4>1.8.6 &#8211; Feb 11th 2019</h4>\n<ul>\n<li>Fix: Duo security plugin on WordPress site breaks the IWP client plugin connection while performing open admin action.</li>\n<li>Fix: Backup is retried when it failed with error &#8220;Failed to connect to content.dropboxapi.com port 443: Connection timed out. and Could not resolve host: api.dropboxapi.com.&#8221;.</li>\n<li>Fix: Plugin updates count showing in plugin menu on WP admin page while hide plugin updates setting is enabled on InfiniteWP admin panel via Client Plugin Branding.</li>\n<li>Fix: Phoenix backup SFTP or FTP not using the custom port.</li>\n<li>Fix: FTP SSL not working on Phoenix backup.</li>\n<li>Fix: Ithemes security data is not included in the client reports.</li>\n<li>Fix: Backups failed with error &#8220;Database backup failed. Try to enable MySQL dump on your server.&#8221;.</li>\n</ul>\n<h4>1.8.5 &#8211; Sep 4th 2018</h4>\n<ul>\n<li>Improvement: Multisite support for broken link checker plugin.</li>\n<li>Improvement: MySQL DB dump process is improved in multicall and single call backup.</li>\n<li>Improvement: Phoenix method now doesn&#8217;t wait for the wp-cron to start the backup.</li>\n<li>Improvement: Debug log added for few errors.</li>\n<li>Improvement: If your server gets timed out, the files which are already backed up will be skipped while resume/retrying it(Phoenix backups).</li>\n<li>Improvement: Phoenix Backups keep running in the background even when it&#8217;s stopped from your admin panel.</li>\n<li>Improvement: Phoenix Backup files are not deleted when we kill a backup process manually.</li>\n<li>Fix: Multicall backup files – S3 bucket – Global users permission.</li>\n<li>Fix: Broken link checker plugin unlink and mark not as broken action throws a fatal error.</li>\n<li>Fix: Phoenix backup files on your server is removed when you immediately backup your site using the single/multicall method after a phoenix backup.</li>\n<li>Fix: Piwik warning.</li>\n<li>Fix: A few PHP warnings are fixed.</li>\n<li>Fix: FTP backup keeps running if slash is added at the end of the FTP path.</li>\n</ul>\n<h4>1.8.3 &#8211; May 15th 2018</h4>\n<ul>\n<li>Improvement: Auto cron task is enabled by default for Phoenix method backups.</li>\n<li>Improvement: Calling Next Function failed error when Shell DB dump backup fails error.</li>\n</ul>\n<h4>1.8.2 &#8211; Apr 11th 2018</h4>\n<ul>\n<li>Fix: Itheme security&#8217;s action not displaying while generating Report.</li>\n</ul>\n<h4>1.8.1 &#8211; Apr 3rd 2018</h4>\n<ul>\n<li>Feature: New backup method introduced named Phoenix.</li>\n<li>Improvement: Multicall method is implemented for Restore process.</li>\n<li>Improvement: Backup Constants added for Phoenix method.</li>\n<li>Improvement: Support for Wordfence Security plugin New version.</li>\n<li>Improvement: Support for purging cache on WordPress sites.</li>\n<li>Improvement: Phoenix backup now supports V4 AWS regions.</li>\n<li>Improvement: WordFence and Itheme Security added for client reporting.</li>\n<li>Improvement: Site FTP details will be used from the panel if any update require FTP details.</li>\n<li>Improvement: Now you can create S3 buckets in the Paris region.</li>\n<li>Fix: PHP fatal error while backing up your site to a SFTP server using the single call backup method.</li>\n<li>Fix: Restore failed if the backup is placed inside a folder on your S3 bucket(Single call and Multicall).</li>\n<li>Fix: Restore failed if backup files are splitted into part files (Single call and Multicall).</li>\n<li>Fix: Undefined index: hook_suffix warning is fixed.</li>\n<li>Fix: Compatibility with All In One Security.</li>\n<li>Fix: PHP fatal errors due to incompatibility with few plugins like Cornerstone, Litespeed cache, Offers for WooCommerce etc.</li>\n<li>Fix: Dropbox storage exceeds limit error showing incorrectly with &#8220;path error&#8221;.</li>\n<li>Fix: A Few security plugins block the calls to IWP Client plugin breaking the panel and site connection.</li>\n<li>Fix: PHP Fatal error while backing up your site to your SFTP server using SIngle call method.</li>\n<li>Fix: PHP Fatal error occurred: Uncaught Guzzle\\Service\\Exception\\ValidationException: Validation errors: [Key] is a required string in while backing up the site using the multicall method.</li>\n</ul>\n<h4>1.6.8.3 &#8211; Jan 8th 2018</h4>\n<ul>\n<li>Improvement: Now IWP Client Plugin is compatible with most of the premium plugin/theme updates.</li>\n<li>Improvement: Now you can update your Child Themes on WP sites from your IWP dashboard.</li>\n<li>Improvement: MySQL dump is enabled for multicall backup method.</li>\n<li>Improvement: Enabled debug logs to sort out any backup issues in future.</li>\n<li>Fix: If any file named api.php called directly they will get an empty response.</li>\n<li>Fix: Premium updates for specific plugins/themes are not fetched on some instances.</li>\n<li>Fix: File list table break time increased and introduced a constant to change the value (IWP_FILE_LIST_BREAK_TIME) on wp-config.php file.</li>\n<li>Fix: Fatal error in Broken Link checker addon.</li>\n<li>Fix: IWP Client Plugin connection error due to the warning thrown by other plugins.</li>\n<li>Fix: &#8220;Zip-error: Error while updating the file .. .. .. in the file list table&#8221; error while backing up a site using the multicall method.</li>\n<li>Fix: &#8220;Zip-error: Unable to zip&#8221; error while backing up the site.</li>\n<li>Fix: Update failed for sites installed on a WP Engine server.</li>\n<li>Fix: Unknown error occurred while backing up the site.</li>\n<li>Fix: &#8220;Calling Next Function failed – Error while fetching table data&#8221; while backing up your sites.</li>\n<li>Fix: cURL operation timeout error while doing reload data.</li>\n<li>Fix: Windows server had issues in using MySQL dump.</li>\n<li>Fix: &#8220;Uncaught Exception: Submitted input out of alignment error&#8221; while uploading the backup to your Dropbox account.</li>\n<li>Fix: &#8220;Please deactivate &amp; activate InfiniteWP Client plugin on your site, then add the site again&#8221; error while adding the site to your panel.</li>\n<li>Fix: IWP client plugin connection is broken when NextGEN plugin is installed on WordPress sites.</li>\n<li>Fix: &#8220;Empty Response&#8221; error from the sites while backing up using the multicall method.</li>\n</ul>\n<h4>1.6.6.3 &#8211; Sep 29th 2017</h4>\n<ul>\n<li>Fix: v1_retired error while backing up the site to Dropbox</li>\n</ul>\n<h4>1.6.5.1 &#8211; Sep 9th 2017</h4>\n<ul>\n<li>Feature: WP Time Capsule support enabled.</li>\n<li>Improvement: Copy Details in client plugin installation has been updated to clipboard.js from flash.</li>\n<li>Improvement: WordPress updates will be fetched every 2 hours instead of 4 hours.</li>\n<li>Improvement: Custom posts will be registered to avoid false alerts from other security plugins.</li>\n<li>Improvement: Sucuri API is removed. IWP will use Sucuri Plugin to scan your sites for malware.</li>\n<li>Improvement: Calling Next Function failed – Error while fetching table data has been fixed.</li>\n<li>Improvement: Multicall backups would not exclude .zip files.</li>\n<li>Improvement: Support for iThemes Security plugin New version.</li>\n<li>Improvement: wp-content/uploads/wpallimport directory will be automatically excluded from backups.</li>\n<li>Improvement: Default file zip split size decreased to 512 MB.</li>\n<li>Fix: wp_iwp_backup_status table column type is changed from var_char to long text.</li>\n<li>Fix: The backup process would generate multiple warnings.</li>\n</ul>\n<h4>1.6.4.2 &#8211; Jul 10th 2017</h4>\n<ul>\n<li>Improvement: Dropbox API V2 has been integrated with InfiniteWP.</li>\n<li>Fix: While uploading the backup to Dropbox some users get Dropbox verification failed: File may be corrupted error.</li>\n<li>Fix: File exceeds 150MB upload limit error while uploading the backups to Dropbox using Single call back method.</li>\n<li>Fix: Path error if the Dropbox folder have trailing spaces.</li>\n</ul>\n<h4>1.6.4 &#8211; May 2nd 2017</h4>\n<ul>\n<li>Improvement: JSON communication implementation between Admin Panel and Client plugin has been completed.</li>\n<li>Improvement: Unwanted files and folders will be automatically excluded from backups.</li>\n<li>Improvement: Few unwanted folders have been excluded from the list of folders to be backed up.</li>\n<li>Fix: When cloud upload fails during backup, the copy is retained on the server instead of being deleted.</li>\n<li>Fix: The backup process would generate the warning &#8220;PHP Warning: fclose(): supplied resource is not a valid stream resource in /home/heidihic/public_html/wp-content/plugins/iwp-client/lib/amazon/s3IWPBackup.php on line 310&#8221; during multi-call backups.</li>\n</ul>\n<h4>1.6.3.2 &#8211; Jan 4th 2017</h4>\n<ul>\n<li>Improvement: JSON communication between Admin Panel and Client plugin has been implemented.</li>\n<li>Improvement: If the PHP version of WordPress site is less than 5.4.0 then the single call backups will fail with &#8220;Fatal error: Cannot use string offset as an array in /home/asogerb6/public_html/wp-content/plugins/iwp-client/backup.class.singlecall.php on line 340&#8221;.</li>\n<li>Improvement: Debug files DE_clMemoryPeak.php, DE_clMemoryUsage.php and DE_clTimeTaken.php have been removed.</li>\n<li>Improvement: Security patches have been applied for sites backed up to Amazon S3 storage.</li>\n<li>Fix: Backups having size greater than 2GB could not be uploaded to Google Drive in certain scenarios throwing a bad request error.</li>\n<li>Fix: &#8220;Failed to zip files. pclZip error (-4): File &#8216;/wp-content/plugins/wordfence/tmp/configCache.php&#8217; does not exist&#8221; has been fixed.</li>\n<li>Fix: Pluggable.php shouldn&#8217;t be included before loading all plugins.</li>\n<li>Fix: MySQL error wouldn&#8217;t show accurately during failed table creation.</li>\n<li>Fix: If the default auto_increment_increment value is set to 2 in the user&#8217;s server the backup will fail for all sites on that server.</li>\n<li>Fix: If the value for integer field is EMPTY then instead of considering default value as NULL, the plugin creates a duplicate entry during cloning.</li>\n</ul>\n<h4>1.6.1.1 &#8211; August 12th 2016</h4>\n<ul>\n<li>Fix: Bug Fix.</li>\n<li>Fix: Plugins were not updated but were showing incorrectly as updated in the Process Queue.</li>\n<li>Fix: Failed to restore: Error performing query &#8220;/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */; &#8220;: Variable &#8216;character_set_client&#8217; can&#8217;t be set to the value of &#8216;NULL&#8217; error message would show during restore.</li>\n<li>Fix: PHP Notice: Undefined index error would show while taking backups.</li>\n</ul>\n<h4>1.6.0 &#8211; June 27th 2016</h4>\n<ul>\n<li>Feature: Activity log for updates and backups to be used in new version of client reporting beta will be saved and retrieved from the WP Admin instead of the IWP Admin Panel, provided the client reporting addon is active.</li>\n<li>Improvement: The code in the backup_status_table has been refactored.</li>\n<li>Fix: Failed backups with date “01 Jan 1970” were not cleared from the database.</li>\n</ul>\n<h4>1.5.1.3 &#8211; May 24th 2016</h4>\n<ul>\n<li>Fix: &#8220;Unable to update File list table : Can’t DROP ‘thisFileName’; check that column/key exists&#8221; error would be thrown while taking Multi-call backups in the Multi-site WordPress environment.</li>\n</ul>\n<h4>1.5.1.2 &#8211; May 18th 2016</h4>\n<ul>\n<li>Fix: If the file path is 192 characters or higher, it would throw a Zip error: unable to update the file list while performing multicall backup.</li>\n<li>Fix: For the first WP core update alone, the From Version was missing in the WP updates section of the Client Reports.</li>\n</ul>\n<h4>1.5.1.1 &#8211; Mar 18th 2016</h4>\n<ul>\n<li>Improvement: Verifying backup uploaded to Amazon S3 utilized higher bandwidth.</li>\n</ul>\n<h4>1.5.1 &#8211; Mar 14th 2016</h4>\n<ul>\n<li>Improvement: Some of the deprecated WP functions are replaced with newer ones.</li>\n<li>Fix: SQL error populated while converting the IWP backup tables to UTF8 or UTF8MB4 in certain WP sites.</li>\n<li>Fix: DB optimization not working on the WP Maintenance addon.</li>\n<li>Fix: Versions prior to WP v3.9 were getting the wpdb::check_connection() fatal error.</li>\n</ul>\n<h4>1.5.0 &#8211; Jan 9th 2016</h4>\n<ul>\n<li>Improvement: Compatibility with PHP7.</li>\n<li>Improvement: Memory usage in Multi call backup now optimized.</li>\n<li>Improvement: Support for new Amazon S3 SDK. Added support for Frankfut bucket which will solve random errors in amazon backup. For php &lt; v5.3.3 will use older S3 library.</li>\n<li>Improvement: Timeout will be reduced in Single call backup Zip Archive.</li>\n<li>Improvement: Client plugin will support MySQLi by using wpdb class.</li>\n<li>Improvement: All tables created by client plugin will use default DB engine.</li>\n<li>Improvement: Maintenance mode status also included in reload data. This will result in the IWP Admin Panel displaying relevant status colours.</li>\n<li>Improvement: Support for WP Maintenance Addon&#8217;s new options &#8211; Clear trash comments, Clear trash posts, Unused posts metadata, Unused comments metadata, Remove pingbacks, Remove trackbacks.</li>\n<li>Improvement: Dedicated cacert.pem file introduced for Dropbox API.&#8221; client plugin.</li>\n<li>Fix: Issue with IWP DB Table version not updating.</li>\n<li>Fix: Backup DB table now uses WP&#8217;s charset (default UTF8). This will solve filename issues with foreign (umlaut) characters.</li>\n<li>Fix: Temp files not getting deleted while using single call backup in certain cases.</li>\n</ul>\n<h4>1.4.3 &#8211; Nov 18th 2015</h4>\n<ul>\n<li>Improvement: Maintenance mode status also included in reload data. This will result in the IWP Admin Panel displaying relevant status colours.</li>\n<li>Fix: Maintenance mode shows off even it is in ON mode after the site is reloaded.</li>\n</ul>\n<h4>1.4.2.2 &#8211; Sep 24th 2015</h4>\n<ul>\n<li>Improvement: Translation update support.</li>\n<li>Improvement: All executable files in client plugin should check the running script against the file name to prevent running directly for improved security.</li>\n<li>Improvement: Error message improved for premium plugin/theme when not registered with iwp process.</li>\n<li>Fix: Some admin theme blocks IWP Client from displaying activation key.</li>\n<li>Fix: Fatal error while calling wp_get_translation_updates() in WP versions lower than v3.7.</li>\n</ul>\n<h4>1.4.1 &#8211; Aug 31th 2015</h4>\n<ul>\n<li>Fix: Branding should take effect which we lost in v1.4.0 without making any changes.</li>\n</ul>\n<h4>1.3.16 &#8211; Jul 28th 2015</h4>\n<ul>\n<li>Fix: Dropbox download while restore create memory issue Fatal Error: Allowed Memory Size of __ Bytes Exhausted.</li>\n</ul>\n<h4>1.3.15 &#8211; Jul 8th 2015</h4>\n<ul>\n<li>Improvement: Security improvement.</li>\n<li>Fix: Parent theme update showing as child theme update.</li>\n<li>Fix: Bug fixes.</li>\n</ul>\n<h4>1.3.14 &#8211; Jul 3rd 2015</h4>\n<ul>\n<li>Fix: Bug fix.</li>\n</ul>\n<h4>1.3.13 &#8211; May 13th 2015</h4>\n<ul>\n<li>Fix: In certain cases, a multi-call backup of a large DB missed a few table&#8217;s data.</li>\n</ul>\n<h4>1.3.12 &#8211; Mar 31st 2015</h4>\n<ul>\n<li>Fix: In a few servers, readdir() was creating &#8220;Empty reply from server&#8221; error and in WPEngine it was creating 502 error while taking backup</li>\n<li>Fix: .mp4 was excluding by default </li>\n</ul>\n<h4>1.3.11 &#8211; Mar 27th 2015</h4>\n<ul>\n<li>Improvement: using wp_get_theme() instead of get_current_theme() which is deprecated in WordPress      </li>\n<li>Fix: IWP failed to recognise the error from WP v4.0</li>\n<li>Fix: Restoring backup for second time</li>\n<li>Fix: $HTTP_RAW_POST_DATA is made global, which is conflicting with other plugin</li>\n<li>Fix: Install a plugin/theme from Install &gt; My Computer from panel having IP and different port number</li>\n<li>Fix: Install a plugin/theme from Install &gt; My Computer from panel protected by basic http authentication</li>\n<li>Fix: Google Webmaster Redirection not working with a few themes</li>\n<li>Fix: Bug fixes</li>\n</ul>\n<h4>1.3.10 &#8211; Jan 27th 2015</h4>\n<ul>\n<li>Fix: Bug Fix &#8211; This version fixes an Open SSL bug that was introduced in v1.3.9. If you updated to v1.3.9 and are encountering connection errors, update the Client Plugin from your WP dashboards. You don&#8217;t have to re-add the sites to InfiniteWP.</li>\n</ul>\n<h4>1.3.9 &#8211; Jan 26th 2015</h4>\n<ul>\n<li>Fix: WP Dashboard jQuery conflict issue. </li>\n<li>Fix: Empty reply from server created by not properly configured OpenSSL functions.</li>\n<li>Fix: Google Drive backup upload timeout issue.</li>\n</ul>\n<h4>1.3.8 &#8211; Dec 2nd 2014</h4>\n<ul>\n<li>Fix: Fixed a security bug that would allow someone to put WP site into maintenance mode if they know the admin username. </li>\n</ul>\n<h4>1.3.7 &#8211; Nov 21st 2014</h4>\n<ul>\n<li>Fix: Dropbox SSL3 verification issue.</li>\n</ul>\n<h4>1.3.6 &#8211; Sep 1st 2014</h4>\n<ul>\n<li>Fix: IWP&#8217;s PCLZIP clash with other plugins. PCLZIP constants have been renamed to avoid further conflicts. This will fix empty folder error &#8211; &#8220;Error creating database backup folder (). Make sure you have correct write permissions.&#8221;</li>\n<li>Fix: Amazon S3 related &#8211; Call to a member function list_parts() on a non-object in wp-content/plugins/iwp-client/backup.class.multicall.php on line 4587.</li>\n</ul>\n<h4>1.3.5 &#8211; Aug 19th 2014</h4>\n<ul>\n<li>Improvement: Support for iThemes Security Pro.</li>\n<li>Fix: IWP&#8217;s PCLZIP clash with other plugins.</li>\n</ul>\n<h4>1.3.4 &#8211; Aug 11th 2014</h4>\n<ul>\n<li>Feature: Maintenance mode with custom HTML.</li>\n<li>New: WP site&#8217;s server info can be viewed.</li>\n<li>Improvement: Simplified site adding process &#8211; One-click copy &amp; paste.</li>\n<li>Improvement: New addons compatibility.</li>\n</ul>\n<h4>1.3.3 &#8211; Jul 28th 2014</h4>\n<ul>\n<li>Fix: False &#8220;FTP verification failed: File may be corrupted&#8221; error.</li>\n</ul>\n<h4>1.3.2 &#8211; Jul 23rd 2014</h4>\n<ul>\n<li>Fix: Dropbox backup upload in single call more then 50MB file not uploading issue.</li>\n</ul>\n<h4>1.3.1 &#8211; Jul 16th 2014</h4>\n<ul>\n<li>Fix: &#8220;Unable to create a temporary directory&#8221; while cloning to exisiting site or restoring.</li>\n<li>Fix: Disabled tracking hit count.</li>\n</ul>\n<h4>1.3.0 &#8211; Jul 9th 2014</h4>\n<ul>\n<li>Improvement: Multi-call backup &amp; upload.</li>\n<li>Fix: Fatal error Call to undefined function get_plugin_data() while client plugin update.</li>\n<li>Fix: Bug fixes.</li>\n</ul>\n<h4>1.2.15 &#8211; Jun 23rd 2014</h4>\n<ul>\n<li>Improvement: Support for backup upload to SFTP repository.</li>\n<li>Fix: Bug fixes.</li>\n</ul>\n<h4>1.2.14 &#8211; May 27th 2014</h4>\n<ul>\n<li>Improvement: SQL dump taken via mysqldump made compatible for clone.</li>\n</ul>\n<h4>1.2.13 &#8211; May 14th 2014</h4>\n<ul>\n<li>Fix: Google library conflict issues are fixed.</li>\n</ul>\n<h4>1.2.12 &#8211; May 7th 2014</h4>\n<ul>\n<li>Improvement: Backup process will only backup WordPress tables which have configured prefix in wp-config.php.</li>\n<li>Improvement: Support for Google Drive for cloud backup addon.</li>\n<li>Improvement: Minor improvements.</li>\n<li>Fix: Bug fixes</li>\n</ul>\n<h4>1.2.11 &#8211; Apr 16th 2014</h4>\n<ul>\n<li>Fix: Bug fixes</li>\n</ul>\n<p>= 1.2.10  &hellip;</p>\n"
    },
    "short_description": "Install this plugin on unlimited sites and manage them all from a central dashboard. This plugin communicates with your InfiniteWP Admin Panel.",
    "description": "<p><a href=\"https://infinitewp.com/\" title=\"Manage Multiple WordPress\" rel=\"nofollow ugc\">InfiniteWP</a> allows users to manage unlimited number of WordPress sites from their own server.</p>\n<p>Main features:</p>\n<ul>\n<li>Self-hosted system: Resides on your own server and totally under your control</li>\n<li>One-click updates for WordPress, plugins and themes across all your sites</li>\n<li>Instant backup and restore your entire site or just the database</li>\n<li>One-click access to all WP admin panels</li>\n<li>Bulk Manage plugins &amp; themes: Activate &amp; Deactive multiple plugins &amp; themes on multiple sites simultaneously</li>\n<li>Bulk Install plugins &amp; themes in multiple sites at once</li>\n<li>and more..</li>\n</ul>\n<p>Visit us at <a href=\"https://infinitewp.com/\" title=\"Manage Multiple WordPress\" rel=\"nofollow ugc\">InfiniteWP.com</a>.</p>\n<p>Check out the <a href=\"https://www.youtube.com/watch?v=s35ZoW95cnU\" rel=\"nofollow ugc\">InfiniteWP Overview Video</a> below.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/s35ZoW95cnU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Credits: <a href=\"http://prelovac.com/vladimir\" rel=\"nofollow ugc\">Vladimir Prelovac</a> for his worker plugin on which the client plugin is being developed.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/iwp-client.1.13.0.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/iwp-client/assets/screenshot-1.png?rev=1377834",
            "caption": "Sites &amp; Group Management"
        },
        {
            "src": "https://ps.w.org/iwp-client/assets/screenshot-2.png?rev=1377834",
            "caption": "Search WordPress Plugin Repository"
        },
        {
            "src": "https://ps.w.org/iwp-client/assets/screenshot-3.png?rev=1377834",
            "caption": "Bulk Plugin &amp; Theme Management"
        },
        {
            "src": "https://ps.w.org/iwp-client/assets/screenshot-4.png?rev=1377834",
            "caption": "One-click access to WordPress admin panels"
        },
        {
            "src": "https://ps.w.org/iwp-client/assets/screenshot-5.png?rev=1377834",
            "caption": "One-click updates"
        }
    ],
    "tags": {
        "admin": "admin",
        "administration": "administration",
        "amazon": "amazon",
        "api": "api",
        "authentication": "authentication"
    },
    "stable_tag": "1.13.0",
    "versions": {
        "0.1.4": "https://downloads.wordpress.org/plugin/iwp-client.0.1.4.zip",
        "0.1.5": "https://downloads.wordpress.org/plugin/iwp-client.0.1.5.zip",
        "1.0.0": "https://downloads.wordpress.org/plugin/iwp-client.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/iwp-client.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/iwp-client.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/iwp-client.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/iwp-client.1.0.4.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/iwp-client.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/iwp-client.1.1.1.zip",
        "1.1.10": "https://downloads.wordpress.org/plugin/iwp-client.1.1.10.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/iwp-client.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/iwp-client.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/iwp-client.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/iwp-client.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/iwp-client.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/iwp-client.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/iwp-client.1.1.8.zip",
        "1.1.9": "https://downloads.wordpress.org/plugin/iwp-client.1.1.9.zip",
        "1.11.0": "https://downloads.wordpress.org/plugin/iwp-client.1.11.0.zip",
        "1.11.1": "https://downloads.wordpress.org/plugin/iwp-client.1.11.1.zip",
        "1.12.1": "https://downloads.wordpress.org/plugin/iwp-client.1.12.1.zip",
        "1.12.3": "https://downloads.wordpress.org/plugin/iwp-client.1.12.3.zip",
        "1.12.3.1": "https://downloads.wordpress.org/plugin/iwp-client.1.12.3.1.zip",
        "1.12.5": "https://downloads.wordpress.org/plugin/iwp-client.1.12.5.zip",
        "1.13.0": "https://downloads.wordpress.org/plugin/iwp-client.1.13.0.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/iwp-client.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/iwp-client.1.2.1.zip",
        "1.2.10": "https://downloads.wordpress.org/plugin/iwp-client.1.2.10.zip",
        "1.2.11": "https://downloads.wordpress.org/plugin/iwp-client.1.2.11.zip",
        "1.2.12": "https://downloads.wordpress.org/plugin/iwp-client.1.2.12.zip",
        "1.2.13": "https://downloads.wordpress.org/plugin/iwp-client.1.2.13.zip",
        "1.2.14": "https://downloads.wordpress.org/plugin/iwp-client.1.2.14.zip",
        "1.2.15": "https://downloads.wordpress.org/plugin/iwp-client.1.2.15.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/iwp-client.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/iwp-client.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/iwp-client.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/iwp-client.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/iwp-client.1.2.6.zip",
        "1.2.7": "https://downloads.wordpress.org/plugin/iwp-client.1.2.7.zip",
        "1.2.8": "https://downloads.wordpress.org/plugin/iwp-client.1.2.8.zip",
        "1.2.9": "https://downloads.wordpress.org/plugin/iwp-client.1.2.9.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/iwp-client.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/iwp-client.1.3.1.zip",
        "1.3.10": "https://downloads.wordpress.org/plugin/iwp-client.1.3.10.zip",
        "1.3.11": "https://downloads.wordpress.org/plugin/iwp-client.1.3.11.zip",
        "1.3.12": "https://downloads.wordpress.org/plugin/iwp-client.1.3.12.zip",
        "1.3.13": "https://downloads.wordpress.org/plugin/iwp-client.1.3.13.zip",
        "1.3.14": "https://downloads.wordpress.org/plugin/iwp-client.1.3.14.zip",
        "1.3.15": "https://downloads.wordpress.org/plugin/iwp-client.1.3.15.zip",
        "1.3.16": "https://downloads.wordpress.org/plugin/iwp-client.1.3.16.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/iwp-client.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/iwp-client.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/iwp-client.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/iwp-client.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/iwp-client.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/iwp-client.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/iwp-client.1.3.8.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/iwp-client.1.4.1.zip",
        "1.4.2.2": "https://downloads.wordpress.org/plugin/iwp-client.1.4.2.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/iwp-client.1.4.3.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/iwp-client.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/iwp-client.1.5.1.zip",
        "1.5.1.1": "https://downloads.wordpress.org/plugin/iwp-client.1.5.1.1.zip",
        "1.5.1.3": "https://downloads.wordpress.org/plugin/iwp-client.1.5.1.3.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/iwp-client.1.6.0.zip",
        "1.6.1.1": "https://downloads.wordpress.org/plugin/iwp-client.1.6.1.1.zip",
        "1.6.3.2": "https://downloads.wordpress.org/plugin/iwp-client.1.6.3.2.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/iwp-client.1.6.4.zip",
        "1.6.4.2": "https://downloads.wordpress.org/plugin/iwp-client.1.6.4.2.zip",
        "1.6.5.1": "https://downloads.wordpress.org/plugin/iwp-client.1.6.5.1.zip",
        "1.6.6.3": "https://downloads.wordpress.org/plugin/iwp-client.1.6.6.3.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/iwp-client.1.8.1.zip",
        "1.8.3": "https://downloads.wordpress.org/plugin/iwp-client.1.8.3.zip",
        "1.8.5": "https://downloads.wordpress.org/plugin/iwp-client.1.8.5.zip",
        "1.8.6": "https://downloads.wordpress.org/plugin/iwp-client.1.8.6.zip",
        "1.9.4.1": "https://downloads.wordpress.org/plugin/iwp-client.1.9.4.1.zip",
        "1.9.4.11": "https://downloads.wordpress.org/plugin/iwp-client.1.9.4.11.zip",
        "1.9.4.4": "https://downloads.wordpress.org/plugin/iwp-client.1.9.4.4.zip",
        "1.9.4.5": "https://downloads.wordpress.org/plugin/iwp-client.1.9.4.5.zip",
        "1.9.4.6": "https://downloads.wordpress.org/plugin/iwp-client.1.9.4.6.zip",
        "1.9.4.8.2": "https://downloads.wordpress.org/plugin/iwp-client.1.9.4.8.2.zip",
        "1.9.6": "https://downloads.wordpress.org/plugin/iwp-client.1.9.6.zip",
        "1.9.8": "https://downloads.wordpress.org/plugin/iwp-client.1.9.8.zip",
        "1.9.9": "https://downloads.wordpress.org/plugin/iwp-client.1.9.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/iwp-client.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/iwp-client/assets/banner-772x250.png?rev=536142",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/iwp-client/assets/icon-128x128.png?rev=1132008",
        "2x": "https://ps.w.org/iwp-client/assets/icon-256x256.png?rev=1132008"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 88,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}