{
    "name": "JS Help Desk &#8211; The Ultimate Help Desk &amp; Support Plugin",
    "slug": "js-support-ticket",
    "version": "2.8.7",
    "author": "<a href=\"https://www.jshelpdesk.com\">JS Help Desk</a>",
    "author_profile": "https://profiles.wordpress.org/rabilal/",
    "contributors": {
        "rabilal": {
            "profile": "https://profiles.wordpress.org/rabilal/",
            "avatar": "https://secure.gravatar.com/avatar/6d445271316d4365d4fc1fe0323a85bd?s=96&d=monsterid&r=g",
            "display_name": "JoomSky"
        }
    },
    "requires": "5.5",
    "tested": "6.6.1",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 74,
    "ratings": {
        "5": 40,
        "4": 2,
        "3": 4,
        "2": 3,
        "1": 17
    },
    "num_ratings": 66,
    "support_url": "https://wordpress.org/support/plugin/js-support-ticket/",
    "support_threads": 3,
    "support_threads_resolved": 2,
    "active_installs": 5000,
    "downloaded": 318223,
    "last_updated": "2024-08-05 4:27am GMT",
    "added": "2014-10-10",
    "homepage": "https://www.jshelpdesk.com",
    "sections": {
        "description": "<p>JS Help Desk is the best helpdesk and support plugin. JS Help Desk is a professional, simple, easy to use and complete customer support system. JS Help Desk comes packed with lot features than most of the expensive(and complex) support ticket system on market. The best part is, It completely free.</p>\n<h4>JS Help Desk</h4>\n<ul>\n<li><a href=\"http://demo.jshelpdesk.com\" rel=\"nofollow ugc\">JS Help Desk Demo</a>  </li>\n<li><a href=\"https://jshelpdesk.com/\" rel=\"nofollow ugc\">Plugin Homepage</a>  </li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/HxSBUoMSKs8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Free Version Major Features</h3>\n<ul>\n<li><strong>A Professional Helpdesk System</strong>: JS Help Desk is a Professional help desk/support system.</li>\n<li><strong>Support to everyone</strong>: We support to our every user (free and pro both users).</li>\n<li>\n<p><strong>User Freindly with Video Support</strong>: JS Help Desk have video tutorials for all it major functions.</p>\n</li>\n<li>\n<p><strong>Front-end Tickets</strong>: Users create tickets from the front-end.</p>\n</li>\n<li><strong>Visitor/Guest Tickets</strong>: Often users do not want to create an account to open support ticket. Guest tickets is very important feature and it is free.</li>\n<li><strong>Unlimited Tickets</strong>: There are not any limit of tickets in the base version.</li>\n<li><strong>Unlimited Agents</strong>: System support unlimited agents at admin area in the base version.</li>\n<li><strong>Support Icon</strong>: This is very important to show support icon on your site, JS Help Desk offer support icon for front-end with various position options.</li>\n<li><strong>Create Ticket for Users</strong>: Admin/agent can create ticket on the behalf on any user.</li>\n<li><strong>GDPR</strong>: JS Help Desk is fully compatible with GDPR law.</li>\n<li><strong>Erase Data Requests</strong>: User can ask to erase his data and admin have option to delete or anoyomise his data.</li>\n<li><strong>Multiple Attachments</strong>: User/agent/admin can upload multiple attachments in ticket creation and ticket replies</li>\n<li><strong>Attachment Size and Type</strong>: Admin can control ticket attachments by it size and extensions type.</li>\n<li><strong>Powerful Filters and Sorting</strong>: System offer powerfull filters for both user and admin to search tickets with sorting option.</li>\n<li><strong>Priorities</strong>: Priority associated to the ticket defines the importance, system highlight the priorities with admin defined different color on tickets listing and ticket detail page.</li>\n<li><strong>Unlimited Departments</strong>: Create departments that relates to the various business units in your organization. It will be sale, support, billing, you can create any department in admin panel. User will select department when he create the ticket.</li>\n<li><strong>Ticket Status</strong>: Show ticket status message and different colors to highlight it.</li>\n<li><strong>Email Notification</strong>: System send email notification to user, agents and admin in different actions i.e new ticket, reply, close ticket etc.</li>\n<li><strong>Edit Ticket</strong>: Admin/agent can edit any ticket at any time.</li>\n<li><strong>Registration</strong>: System offer a beautiful registration form to register new user.</li>\n<li><strong>Login Form</strong>: System have it own login form to login the user.</li>\n<li><strong>Captcha/ReCaptcha</strong>: Another exiting feature. System offer it own captchat and google recaptcha to stop spaming.</li>\n<li><strong>Thankyou Message for Visitor</strong>: Admin can add special message for visitor, message will show after successfull ticket sumission.</li>\n<li><strong>HTML Editor</strong>: HTML editor for ticket summary, ticket reply, notes etc.</li>\n<li><strong>Term &amp; Conditions</strong>: Admin can add Terms &amp; Conditions at ticket sumission page.</li>\n<li><strong>Themes</strong>: Themes make our site more beautiful and eye catchy. By using this feature, you can change your plugin colors or can select colors from seven preset color theme with different color palettes.</li>\n<li><strong>Email Templates</strong>: JS Help Desk offer full power to admin, admin can edit any email template in html editor. System include beautiful predefined email templates.</li>\n<li><strong>Custom Fields</strong>: Sometime you need extra fields, no problem. JS Help Desk offer 12+ custom fields (Text field, Drop down, Checkbox, Radio button, Text area, Dependent fields, Admin only, Date, Email, Upload file, Multi select and T&amp;C ). </li>\n<li><strong>Fields Manager</strong>: System offer a powerful feature to manage the fields. Admin can add, edit, rename, ordering, publish/ubpublished and required/un-required fields for user &amp; visitor.</li>\n<li><strong>Custom Message for new ticket</strong>: This is an important feature that admin show a message/instruction (any message in Text Editor) on ticket summission form.</li>\n<li><strong>Admin/Agent Only</strong>: This field is visible to admin and agent only.</li>\n<li><strong>Hide Agent/Admin Info</strong>: Admin can hide agent information like email, name from the user.</li>\n<li><strong>Email config</strong>: Another admin power, system offer enable/disable action base email notifications like ticket reply, close ticket, chage priority etc.</li>\n<li><strong>Strength &amp; Flexibility</strong>: JS Help Desk is built using WordPress best practises both on the front and the back end. This results in an efficient, robust and intuitive plugin.</li>\n<li><strong>Easy to Use</strong>: Ticket system build on the basis on latest style. You will find it very easy to use. </li>\n<li><strong>RTL ready</strong>: JS Help Desk also support to RTL languages.</li>\n<li><strong>Fully Responsive</strong>: JS Help Desk work on all type of devices including smart phones, tables, laptops and desktops. Layouts auto adjust according to devices.</li>\n<li><strong>System Errors</strong>: System record every error and show in admin area.</li>\n<li><strong>Hide/Show Menu</strong>: Admin can hide/show JS Help Desk any menu item in configuraitons.</li>\n<li><strong>Translations</strong>: JS Help Desk support multi-language and offer 35+ tranlsations.</li>\n<li><strong>Pagination</strong>: Admin can sent record per page in the configurations page.</li>\n<li><strong>JS Help Desk have reports on</strong><br />\n-Get a summary of tickets handled by every staff members<br />\n-Get a detail report of tickets handled by every staff members<br />\n-Get a detail report of tickets created by every users<br />\n-Get a summary of tickets by status<br />\n-Get a summary of tickets by priorities<br />\n-Get a summary of tickets by departments<br />\n-Get a summary of tickets created by channel</li>\n</ul>\n<h3>Premium Add-Ons</h3>\n<p>JS Help Desk is a professional and complete help desk system, it offers 35+ addons.</p>\n<p><strong>Addons</strong></p>\n<ul>\n<li><a href=\"https://jshelpdesk.com/product/email-piping/\" rel=\"nofollow ugc\">Email Piping</a> &#8211; With the e-mail piping add-on user can create ticket, reply to existing ticket by e-mail! Users can even create a new ticket and account by simply sending an email to your designated support email address i.e support@yourdomain.com. Whenever something happens on your support site (a client opens a new ticket, an agent replies to an existing ticket, etc), an e-mail notification is sent out automatically. With email support add-on enabled, there is no longer a need to log into the support site to reply to a ticket. Agents and clients can simply reply to the e-mail and their message will automatically be added to the ticket.</li>\n<li><a href=\"https://jshelpdesk.com/product/time-tracking/\" rel=\"nofollow ugc\">Time Tracking</a> &#8211; Track the time spent on tickets at the most granular level possible while also reporting at the Client and Agent levels. Manually record the time spent on each reply to a ticket. The timer starts by a single button when the ticket is open in the agent’s browser and stops by a single button when the agents is done with the ticket.</li>\n<li><a href=\"https://jshelpdesk.com/product/paid-support/\" rel=\"nofollow ugc\">Paid Support</a> &#8211; Do you want charge to your users for support tickets? JS Help Desk Paid Support addon offer to admin to charge users for every new ticket or monthly subscripton with number of tickets limistation. </li>\n<li><a href=\"https://jshelpdesk.com/product/agents/\" rel=\"nofollow ugc\">Agents</a> &#8211; Agent plays an important role for help desk and provide assistance to users associated with support system. By adding this add on, add multiple agents and assign permissions to facilitate users against their tickets. Moreover agents can create ticket, delete ticket, close ticket and can performs all the actions that are allowed to them by admin.</li>\n<li><a href=\"https://jshelpdesk.com/product/agent-auto-assign/\" rel=\"nofollow ugc\">Agent Auto Assign</a> &#8211; JS Help Desk auto assign ticket to the agent on the base of rules.</li>\n<li><a href=\"https://jshelpdesk.com/product/multi-forms/\" rel=\"nofollow ugc\">Multi Forms</a> &#8211; Admin can create multi form for ticket on department base. Admin can also manage form fields independently.</li>\n<li><a href=\"https://jshelpdesk.com/product/merge-ticket/\" rel=\"nofollow ugc\">Merge Tickets</a> &#8211; There are hundred of tickets submitted to get assistance in which some of the tickets might be on same topic and queries. To provide support to each ticket with the same topic causes the waste of time. By this add on, Merge any of the two tickets or more with the same topic and query and provide support one for everyone.</li>\n<li><a href=\"https://jshelpdesk.com/product/overdue/\" rel=\"nofollow ugc\">Ticket Overdue</a> &#8211; Any of the ticket which is not resolve in given time or not respond back in time known as overdue Ticket. By adding this add on, You can set auto overdue ticket, Overdue by priority and cron job overdue.</li>\n<li><a href=\"https://jshelpdesk.com/product/smtp/\" rel=\"nofollow ugc\">SMTP</a> &#8211; SMTP (Simple Mail Transfer Protocol) is a TCP/IP protocol used in sending and receiving e-mail. By adding this add on, Admin can set custom email protocol to sending and receiving email in support ticket.</li>\n<li><a href=\"https://jshelpdesk.com/product/ban-email/\" rel=\"nofollow ugc\">Ban Email</a> &#8211; Ban Email is used to restrict the user to create new tickets. By this add on, you can ban any of the user’s email however, he cannot able to create new tickets.</li>\n<li><a href=\"https://jshelpdesk.com/product/woocommerce/\" rel=\"nofollow ugc\">WooCommerce</a> &#8211; The tight integration between the two is guaranteed to leave your customers feeling like their support experience is deeply rooted in their purchasing experience. If you have a WooCommerce store, you must be providing support. </li>\n<li><a href=\"https://jshelpdesk.com/product/private-credentials/\" rel=\"nofollow ugc\">Private Credentials</a> &#8211; Offering a decent and safer environment for customer to store their private and personal data encrypted. Giving a way to customers to securely sensitives data to tickets will be automatically removed when tickets are closed.sensitive data to tickets – data that is automatically removed when tickets are closed.</li>\n<li><a href=\"https://jshelpdesk.com/product/email-cc/\" rel=\"nofollow ugc\">Email CC</a> &#8211; Want to send an email to another email address? Email CC addon make it easy. You can achieve it with very easy steps, just select the action and add the email. System will also send an email to provided email address. The CC recipient will receive an exact copy of the email.</li>\n<li><a href=\"https://jshelpdesk.com/product/export/\" rel=\"nofollow ugc\">Export</a> &#8211; Exports are used to keep data at locals. By adding this add on, You can export any of the ticket data like ticket detail, ticket history and etc.</li>\n<li><a href=\"https://jshelpdesk.com/product/desktop-notification/\" rel=\"nofollow ugc\">Desktop Notification</a> &#8211; The desktop notifications add-on will keep you up to date with your support operations anytime. Every time something happens on your support, you are instantly notified. A notification popup will appear on your screen on each action happens associated with support ticket.</li>\n<li><a href=\"https://jshelpdesk.com/product/ticket-history/\" rel=\"nofollow ugc\">Ticket History</a> &#8211; Ticket History or Activity log become essentials for help desk. By adding this add on, Get complete activity log or ticket history of each action happens on ticket by agent. Keep the record of every ticket either it is closed or open.</li>\n<li><a href=\"https://jshelpdesk.com/product/close-ticket/\" rel=\"nofollow ugc\">Ticket Auto Close</a> &#8211; Auto Close Ticket reduce your effort to close ticket manually. By adding the add on, Ticket will be auto close after specific interval of time or pre defiend rules which can be set by admin. Ticket can also be close on reply by agent while ticket is open.</li>\n<li><a href=\"https://jshelpdesk.com/product/feedback/\" rel=\"nofollow ugc\">Feedback</a> &#8211; By adding this add on, you can get feedback from your users to enhance your quality of services. This add on allows you to automatically collect feedback responses that rate your agent’s performance on a ticket. This add on send a feedback link after a ticket is closed. The user will click a survey link and fill out the survey form on your website.</li>\n<li><a href=\"https://jshelpdesk.com/product/helptopic/\" rel=\"nofollow ugc\">Helptopic</a> &#8211; Help Topic is used to help end user to find the desired area in which they want to get instances and support. By adding this add on, Add multiples help topics with different name of areas to help your customer in more easier way.</li>\n<li><a href=\"https://jshelpdesk.com/product/internal-note/\" rel=\"nofollow ugc\">Private Note</a> &#8211; Wanna add a note to yourself? Do you need to transfer a ticket to another agent and want to give him some background on the issue? With the Private Notes addon you are able to add as many notes as you want to a ticket, and the user will never see them.</li>\n<li><a href=\"https://jshelpdesk.com/product/knowledge-base/\" rel=\"nofollow ugc\">Knowledge Base</a> &#8211; Knowledge Base are essentially used to help customer queries at basic levels, By adding this add on, add multiple knowledge base, group solutions by different topics to facilitate users.</li>\n<li><a href=\"https://jshelpdesk.com/product/canned-responses/\" rel=\"nofollow ugc\">Canned Response</a> &#8211; Canned responses are predetermined responses to common questions. By adding this add on, the agent may insert a canned response triggered by keystrokes or from a drop-down menu, rather than typing the same answer repeatedly or pasting from some other resource.</li>\n<li><a href=\"https://jshelpdesk.com/product/max-ticket/\" rel=\"nofollow ugc\">Max Tickets</a> &#8211; Help Desk usually offers unlimited tickets which can make huge traffic and can gradually effect on support services. By adding this add on, Admin can limit the user to create x number of tickets. User can only create X number tickets which is defined by admin. Admin can also set X number of tickets for agents to open at once.</li>\n<li><a href=\"https://jshelpdesk.com/product/mail-chimp/\" rel=\"nofollow ugc\">Mail Chimp</a> &#8211; User options allows to add Google Re-captcha or JS Help Desk Re-captcha for registration form. furthermore, user can be register as per role defined by admin such as subscriber, author and etc.</li>\n<li><a href=\"https://jshelpdesk.com/product/user-options/\" rel=\"nofollow ugc\">User Options</a> &#8211; User options allows to add Google Re-captcha or JS Help Desk Re-captcha for registration form. furthermore, user can be register as per role defined by admin such as subscriber, author and etc.</li>\n<li><a href=\"https://jshelpdesk.com/product/actions/\" rel=\"nofollow ugc\">Ticket Actions</a> &#8211; There are multiple options on every ticket like create, edit and delete. By this add on, You can get more options like Print Ticket, Lock ticket, Make Ticket in progress and change ticket priority.</li>\n<li><a href=\"https://jshelpdesk.com/product/announcements/\" rel=\"nofollow ugc\">Announcements</a> &#8211; Keep your customer update with the latest trends. By this add on, Make unlimited announcement against various categories to explore information associated with help desk.</li>\n<li><a href=\"https://jshelpdesk.com/product/downloads/\" rel=\"nofollow ugc\">Downloads</a> &#8211; Downloads are very common to help users to download all the relevant information from downloads. By this add on, Create unlimited downloads and add supporting files for users.</li>\n<li><a href=\"https://jshelpdesk.com/product/faq/\" rel=\"nofollow ugc\">FAQ</a> &#8211; Faqs (Frequently asked questions) are commonly use to answer all the user common questions at the earlier. By adding this add on, add unlimited Faqs to answer all the basic questions asked by users.</li>\n<li><a href=\"https://jshelpdesk.com/product/admin-widget/\" rel=\"nofollow ugc\">Admin Widgets</a> &#8211; Successful businesses run on data. So how would you like to see an immediate data of your support operations as soon as you log into your WordPress administration area? With this add-on you can get that. Take a look at the wealth of data you can access when you log into your WordPress Admin Dashboard. Key data widget include Latest Ticket and Ticket stats.</li>\n<li><a href=\"https://jshelpdesk.com/product/internal-mail/\" rel=\"nofollow ugc\">Internal Mail</a> &#8211; Internal e-mail are used to send and receive emails from one agent to another agent with in the support ticket.By adding this add on, Internal e-mail enables you to send or receive email to one another.</li>\n<li><a href=\"https://jshelpdesk.com/product/envato/\" rel=\"nofollow ugc\">Envato Validation</a> &#8211; With the Envato Validation addon, you can limit ticket submissions to your actual clients. By asking for their Envato purchase code, the plugin will Validate Envato licenses before allowing a user to open a ticket. It offers single product support, multiple products support and pre-product support.</li>\n<li><a href=\"https://jshelpdesk.com/product/widget/\" rel=\"nofollow ugc\">Front-End Widgets</a> &#8211; Widgets in WordPress allows you to add content and features in the widgetized areas of your theme which is mostly the sidebar. However these widget-ready areas can be in the header, footer, sidebar, below content, and basically any other area in your theme. By adding this add on, widget is offering two default widget of Latest ticket and Email Notification Widget.</li>\n<li><a href=\"https://jshelpdesk.com/product/multi-language-email-templates/\" rel=\"nofollow ugc\">Multi Language Email Templates</a> &#8211; It allows you to create a language-based email template for all default email templates in JS Help Desk.</li>\n<li><a href=\"https://jshelpdesk.com/product/easy-digital-download/\" rel=\"nofollow ugc\">Easy Digital Download</a> &#8211;  &hellip;</li>\n</ul>\n",
        "installation": "<h4>Automatic installation</h4>\n<p>Automatic installation is the easiest option as WordPress handles the file transfers itself and you don not need to leave your web browser. To do an automatic install of JS Help Desk, log in to your WordPress dashboard, navigate to the Plugins menu and click Add New.<br />\nIn the search field type  JS Help Desk  and click Search Plugins. Once you have found our help desk plugin you can view details about it such as the the point release, rating and description. Most importantly of course, you can install it by simply clicking  Install Now.</p>\n<h4>Manual installation</h4>\n<p>The manual installation method involves downloading our help desk plugin and uploading it to your webserver via your favourite FTP application. The WordPress codex contains <a href=\"https://codex.wordpress.org/Managing_Plugins#Manual_Plugin_Installation\" rel=\"nofollow ugc\">instructions on how to do this here</a>.</p>\n<h4>Updating</h4>\n<p>Automatic updates should work like a charm; as always though, ensure you backup your site just in case.</p>\n<h4>Minimum Requirements</h4>\n<ul>\n<li>WordPress 3.5 or greater</li>\n<li>PHP version 5.2.4 or greater</li>\n<li>MySQL version 5.0 or greater</li>\n</ul>\n",
        "faq": "\n<dt id='is%20user%20can%20open%20support%20ticket%20from%20front-end'>\nIs user can open support ticket from front-end\n</h4>\n<p>\n<p>Yes, user can open ticket from site.</p>\n</p>\n<dt id='will%20js%20help%20desk%20work%20with%20my%20theme%3F'>\nWill JS Help Desk work with my theme?\n</h4>\n<p>\n<p>Yes; JS Help Desk will work with any theme.</p>\n</p>\n<dt id='where%20can%20i%20report%20bugs%20or%20contribute%20to%20the%20project%3F'>\nWhere can I report bugs or contribute to the project?\n</h4>\n<p>\n<p>Bugs can be reported either in our support forum or preferably on the (https://joomsky.com).</p>\n</p>\n\n",
        "changelog": "<h4>2.8.7</h4>\n<ul>\n<li>Security update</li>\n</ul>\n<h4>2.8.6</h4>\n<ul>\n<li>Security update for themes</li>\n<li>Bug fix for themes</li>\n</ul>\n<h4>2.8.5</h4>\n<ul>\n<li>Bug fix for name on ticket reply page</li>\n<li>Add reply date time on ticket reply page</li>\n</ul>\n<h4>2.8.4</h4>\n<ul>\n<li>Security update</li>\n</ul>\n<h4>2.8.3</h4>\n<ul>\n<li>Security update</li>\n</ul>\n<h4>2.8.2</h4>\n<ul>\n<li>Security update</li>\n</ul>\n<h4>2.8.1</h4>\n<ul>\n<li>Add reCaptcha 3</li>\n<li>Improve plugin translation</li>\n<li>Bug fix</li>\n</ul>\n<h4>2.8.0</h4>\n<ul>\n<li>Improve ticket listing design</li>\n<li>Bug fix</li>\n</ul>\n<h4>2.7.9</h4>\n<ul>\n<li>Add addons update available alert at admin dashboard</li>\n</ul>\n<h4>2.7.8</h4>\n<ul>\n<li>Security fixes</li>\n<li>Compatible PHP 8.1</li>\n<li>Bug fix</li>\n</ul>\n<h4>2.7.7</h4>\n<ul>\n<li>Bug fix</li>\n</ul>\n<h4>2.7.6</h4>\n<ul>\n<li>Configuration base closed information on admin closed tickets</li>\n<li>Configuration base closed information on agent closed tickets</li>\n<li>Configuration base closed information on user closed tickets</li>\n<li>Configuration base assigned information on admin closed tickets</li>\n<li>Configuration base assigned information on agent closed tickets</li>\n<li>Configuration base assigned information on user closed tickets</li>\n<li>Configuration base multiforms popup for new tickets</li>\n<li>Ordering option for multiform</li>\n<li>Support icon bug fix</li>\n</ul>\n<h4>2.7.5</h4>\n<ul>\n<li>Security update</li>\n<li>Email link bug fix</li>\n<li>Configurations for user dashboard links</li>\n<li>Improve multiform options popup design</li>\n</ul>\n<h4>2.7.4</h4>\n<ul>\n<li>Addons update fix</li>\n</ul>\n<h4>2.7.3</h4>\n<ul>\n<li>Email Template bug fix</li>\n</ul>\n<h4>2.7.2</h4>\n<ul>\n<li>Security update</li>\n<li>Security fix</li>\n</ul>\n<h4>2.7.1</h4>\n<ul>\n<li>Security update</li>\n</ul>\n<h4>2.7.0</h4>\n<ul>\n<li>Add visible option for knowledgebase</li>\n<li>Add visible option for faqs</li>\n<li>Add visible option for announcement</li>\n</ul>\n<h4>2.6.9</h4>\n<ul>\n<li>Configuration base delete ticket option for users</li>\n<li>Add auto assign in departments</li>\n<li>Admin can add missing WP users</li>\n<li>Bug fix</li>\n</ul>\n<h4>2.6.8</h4>\n<ul>\n<li>Bug fix</li>\n</ul>\n<h4>2.6.7</h4>\n<ul>\n<li>Added delete ticket option for users</li>\n</ul>\n<h4>2.6.6</h4>\n<ul>\n<li>Add export ticke option for agent</li>\n</ul>\n<h4>2.6.5</h4>\n<ul>\n<li>Improve style sheet calling</li>\n</ul>\n<h4>2.6.4</h4>\n<ul>\n<li>Add Shortcodes For Multiform</li>\n</ul>\n<h4>2.6.3</h4>\n<ul>\n<li>Prefix and suffix for Ticket id</li>\n<li>Bug fix for translation</li>\n</ul>\n<h4>2.6.2</h4>\n<ul>\n<li>Department base field visibility in custom fields</li>\n</ul>\n<h4>2.6.1</h4>\n<ul>\n<li>Bug fixed for slug</li>\n</ul>\n<h4>2.6.0</h4>\n<ul>\n<li>Admin can change slug of Help Desk pages </li>\n<li>Bug fixed for All In One SEO shortcode</li>\n</ul>\n<h4>2.5.9</h4>\n<ul>\n<li>Add review option for admin</li>\n</ul>\n<h4>2.5.8</h4>\n<ul>\n<li>Theme bug fix on update the plugin</li>\n</ul>\n<h4>2.5.7</h4>\n<ul>\n<li>Configuration base product on woocommerce shop page</li>\n<li>Allow apostrophe in email address</li>\n<li>Select user bug fix on add ticket form</li>\n<li>Select user bug fix on add agent form</li>\n</ul>\n<h4>2.5.6</h4>\n<ul>\n<li>Add ticket history in email templates</li>\n<li>Improve in addon update</li>\n</ul>\n<h4>2.5.5</h4>\n<ul>\n<li>Improve visibilty of custom fields</li>\n<li>Google chart bug fix</li>\n</ul>\n<h4>2.5.4</h4>\n<ul>\n<li>Configuration base Support icon text</li>\n</ul>\n<h4>2.5.3</h4>\n<ul>\n<li>Improve RTL Design</li>\n</ul>\n<h4>2.5.2</h4>\n<ul>\n<li>Add Help page in admin area</li>\n</ul>\n<h4>2.5.1</h4>\n<ul>\n<li>Security update</li>\n</ul>\n<h4>2.5.0</h4>\n<ul>\n<li>Redesign admin configuration page</li>\n</ul>\n<h4>2.4.9</h4>\n<ul>\n<li>Add visibilty of custom fields.</li>\n<li>Add support icon configuration</li>\n</ul>\n<h4>2.4.8</h4>\n<ul>\n<li>Add ticket 404 bug fixed</li>\n</ul>\n<h4>2.4.7</h4>\n<ul>\n<li>Add ticket 404 bug fixed</li>\n</ul>\n<h4>2.4.6</h4>\n<ul>\n<li>Redesign admin configuration page</li>\n<li>Add theme (plugin color)</li>\n<li>Captcha for new registration.</li>\n</ul>\n<h4>2.4.5</h4>\n<ul>\n<li>Add agent auto assign addon</li>\n<li>Add new custum field type(admin_only)</li>\n</ul>\n<h4>2.4.4</h4>\n<ul>\n<li>Addon installation bug fix</li>\n<li>Paid support bug fix</li>\n</ul>\n<h4>2.4.3</h4>\n<ul>\n<li>Custom Fields fix</li>\n</ul>\n<h4>2.4.2</h4>\n<ul>\n<li>Add Multiform Addon</li>\n<li>Bug fix for user search in Export</li>\n<li>Bug fix for user create and delete</li>\n</ul>\n<h4>2.4.1</h4>\n<ul>\n<li>Login and register buttons on permission alert page</li>\n<li>Anonymous name on ticket reply</li>\n<li>Auto assign department in email piping</li>\n</ul>\n<h4>2.4.0</h4>\n<ul>\n<li>Bug fix for dublicate replies</li>\n</ul>\n<h4>2.3.9</h4>\n<ul>\n<li>Add link for registration</li>\n<li>Dashboard stats make linkable</li>\n</ul>\n<h4>2.3.8</h4>\n<ul>\n<li>Email bug fixed</li>\n</ul>\n<h4>2.3.7</h4>\n<ul>\n<li>Reply name bug fixed</li>\n</ul>\n<h4>2.3.6</h4>\n<ul>\n<li>Improve color presets</li>\n</ul>\n<h4>2.3.5</h4>\n<ul>\n<li>Add Email CC addon</li>\n</ul>\n<h4>2.3.4</h4>\n<ul>\n<li>Fix div problem</li>\n</ul>\n<h4>2.3.3</h4>\n<ul>\n<li>Added social login addon for users</li>\n<li>Reports bug fix</li>\n</ul>\n<h4>2.3.2</h4>\n<ul>\n<li>Fix ticket dublicate problem</li>\n</ul>\n<h4>2.3.1</h4>\n<ul>\n<li>Session imporvement in addons</li>\n<li>Feedback response messages fixes</li>\n</ul>\n<h4>2.3.0</h4>\n<ul>\n<li>Improve session implementation</li>\n</ul>\n<h4>2.2.9</h4>\n<ul>\n<li>Cookies and session issues solved</li>\n</ul>\n<h4>2.2.8</h4>\n<ul>\n<li>Add preview for attachment images</li>\n<li>Session replace with cookies</li>\n<li>Move translation folder in WP folders</li>\n</ul>\n<h4>2.2.7</h4>\n<ul>\n<li>Add Multi Language Emails Addon</li>\n</ul>\n<h4>2.2.6</h4>\n<ul>\n<li>Add translation download option</li>\n</ul>\n<h4>2.2.5</h4>\n<ul>\n<li>Improve WPMU</li>\n<li>Google chart bug fix</li>\n</ul>\n<h4>2.2.4</h4>\n<ul>\n<li>Improve canned respose</li>\n<li>Improve ticket ordering</li>\n<li>Google chart bug fix</li>\n</ul>\n<h4>2.2.3</h4>\n<ul>\n<li>Improve translations</li>\n</ul>\n<h4>2.2.2</h4>\n<ul>\n<li>Add new config for ticket sorting</li>\n<li>Small bug fix</li>\n</ul>\n<h4>2.2.1</h4>\n<ul>\n<li>Improve date format</li>\n<li>Canned respose bug fix</li>\n</ul>\n<h4>2.2.0</h4>\n<ul>\n<li>Bug fix</li>\n</ul>\n<h4>2.1.9</h4>\n<ul>\n<li>Email configuration bug fix</li>\n<li>Improve translations</li>\n</ul>\n<h4>2.1.8</h4>\n<ul>\n<li>Shortcodes improve for Helptopic and Downloads</li>\n<li>Add configuraitons for remove data front-end link</li>\n</ul>\n<h4>2.1.7</h4>\n<p>Major release</p>\n<ul>\n<li>Redesign</li>\n<li>Add GDPR</li>\n<li>Add privacy support</li>\n<li>Improve download by category</li>\n<li>Drag and drop for field ordering</li>\n<li>Add signature for admin</li>\n<li>Cron job url for hosting cron job</li>\n<li>Fix user register issues</li>\n<li>Improve system errors</li>\n<li>Improve form validation in case of multi-language</li>\n<li>Add new addon Paid Support</li>\n<li>Add new addon Easy Digital Downloads</li>\n<li>Add new addon Mailchimp</li>\n<li>Add new addon Envato Validation</li>\n</ul>\n<h4>2.1.6</h4>\n<ul>\n<li>Create ticket bug fix</li>\n</ul>\n<h4>2.1.5</h4>\n<ul>\n<li>New custom field type for terms and conditions</li>\n<li>New addon for woocommerce support</li>\n<li>New addon for private credentials</li>\n<li>Configuration page typography issue fix</li>\n<li>Minor bugs fixed</li>\n</ul>\n<h4>2.1.4</h4>\n<ul>\n<li>Configurations bug fix</li>\n</ul>\n<h4>2.1.3</h4>\n<ul>\n<li>Add admin capability for ticket management</li>\n</ul>\n<h4>2.1.2</h4>\n<ul>\n<li>Integrate JS Desktop Notification plugin</li>\n<li>Security check for ajax calls</li>\n<li>Support icon size change</li>\n</ul>\n<h4>2.1.1</h4>\n<ul>\n<li>Security fix</li>\n</ul>\n<h4>2.1.0</h4>\n<ul>\n<li>Modern, beautiful and light design</li>\n<li>Security improved, curl remove with WP library</li>\n</ul>\n<h4>2.0.9</h4>\n<ul>\n<li>Image optimization</li>\n<li>IE Compatibility improved.</li>\n</ul>\n<h4>2.0.8</h4>\n<ul>\n<li>Improve post installation process</li>\n</ul>\n<h4>2.0.7</h4>\n<ul>\n<li>User Registration</li>\n<li>Fix user avatar image ratio</li>\n</ul>\n<h4>2.0.6</h4>\n<ul>\n<li>Cross-Site Request Forgery(CSRF) prevention</li>\n</ul>\n<h4>2.0.5</h4>\n<ul>\n<li>Admin controlable login button link</li>\n<li>MariaDB bug fix</li>\n</ul>\n<h4>2.0.4</h4>\n<ul>\n<li>Improve custom fields</li>\n<li>Chart priority color change to default</li>\n<li>Javascript bug fix in case of multi-language</li>\n</ul>\n<h4>2.0.3</h4>\n<ul>\n<li>PHP 7.0.1 support</li>\n<li>Admin reply css bug fix</li>\n<li>Add left menu for admin</li>\n</ul>\n<h4>2.0.2</h4>\n<ul>\n<li>Add department and priority fields in email templates</li>\n</ul>\n<h4>2.0.1</h4>\n<ul>\n<li>Add login form</li>\n</ul>\n<h4>2.0.0</h4>\n<ul>\n<li>Update permalinks</li>\n</ul>\n<h4>1.1.9</h4>\n<ul>\n<li>Improve SEO</li>\n<li>Custom fields bug fixed</li>\n<li>Double email bug fixed</li>\n<li>Searching &amp; sorting bug fixed</li>\n</ul>\n<h4>1.1.8</h4>\n<ul>\n<li>Improve admin control panel</li>\n<li>Upload files via WP standard</li>\n<li>Bug fixed</li>\n</ul>\n<h4>1.1.7</h4>\n<ul>\n<li>Add ticket id option</li>\n<li>Email to department email on new ticket</li>\n<li>Separate phone ext.</li>\n<li>Print ticket</li>\n<li>Encrypt email link</li>\n<li>Add translation tool</li>\n</ul>\n<h4>1.1.6</h4>\n<ul>\n<li>Tickets fields bug fix</li>\n</ul>\n<h4>1.1.5</h4>\n<ul>\n<li>New powerful user fields</li>\n<li>Login page</li>\n<li>Add new search options</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Add multisites support</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Add avatar for user</li>\n<li>Change attachment directory structure </li>\n<li>Fix 404 error</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Security fix of file upload</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Security fix</li>\n<li>RTL, now support RTL langauges</li>\n<li>Hide ticket attachment directory</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Visitor can create ticket</li>\n<li>Add support icon with various position option</li>\n</ul>\n<h4>1.0.9</h4>\n<ul>\n<li>Improve user search</li>\n</ul>\n<h4>1.0.8</h4>\n<ul>\n<li>Add slug for JS Help Desk to avoid conflict with other pages and posts</li>\n<li>Shortcodes available for homepage</li>\n<li>Reply bug fix</li>\n</ul>\n<h4>1.0.7</h4>\n<ul>\n<li>Add German translation </li>\n<li>Implement WordPress time zone</li>\n</ul>\n<h4>1.0.6</h4>\n<ul>\n<li>Add field ordering, now admin change ticket field ordering </li>\n<li>Ticket form auto refill on error</li>\n<li>Improve user selection popup </li>\n<li>Department can unpublished from ticket form</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Admin can create ticket on behalf of any user </li>\n<li>User redirect to JS Help Desk control panel after login [configurable]</li>\n<li>Add count in my tickets tabs i.e Open (15) Answered (25)</li>\n<li>Add reports </li>\n<li>-By departments </li>\n<li>-By priorities </li>\n<li>-By status &amp; priorities</li>\n</ul>\n<h4>1.0.4 &#8211; 03/02/2015</h4>\n<ul>\n<li>Language pattern change.</li>\n<li>Bug fix.</li>\n</ul>\n<h4>1.0.3 &#8211; 02/06/2015</h4>\n<ul>\n<li>New control panel layout.</li>\n<li>Admin responsive layout, now JS Help Desk fully responsive.</li>\n<li>SEF improve</li>\n<li>Implement short codes</li>\n<li>Add breadcrumb</li>\n<li>Pagination bug fix</li>\n</ul>\n<h4>1.0.2 &#8211; 11/17/2014</h4>\n<ul>\n<li>Admin can change page url (slug).</li>\n<li>User fields bug fix.</li>\n</ul>\n<h4>1.0.1 &#8211; 10/25/2014</h4>\n<ul>\n<li>Email alert to admin [bug fix].</li>\n<li>Email alert in HTML format.</li>\n</ul>\n<h4>1.0.0 &#8211; 10/07/2014</h4>\n<ul>\n<li>Just release.</li>\n</ul>\n"
    },
    "short_description": "Professional, beautiful, complete and more powerful help desk &amp; support plugin for WordPress.",
    "description": "<p>JS Help Desk is the best helpdesk and support plugin. JS Help Desk is a professional, simple, easy to use and complete customer support system. JS Help Desk comes packed with lot features than most of the expensive(and complex) support ticket system on market. The best part is, It completely free.</p>\n<h4>JS Help Desk</h4>\n<ul>\n<li><a href=\"http://demo.jshelpdesk.com\" rel=\"nofollow ugc\">JS Help Desk Demo</a>  </li>\n<li><a href=\"https://jshelpdesk.com/\" rel=\"nofollow ugc\">Plugin Homepage</a>  </li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/HxSBUoMSKs8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Free Version Major Features</h3>\n<ul>\n<li><strong>A Professional Helpdesk System</strong>: JS Help Desk is a Professional help desk/support system.</li>\n<li><strong>Support to everyone</strong>: We support to our every user (free and pro both users).</li>\n<li>\n<p><strong>User Freindly with Video Support</strong>: JS Help Desk have video tutorials for all it major functions.</p>\n</li>\n<li>\n<p><strong>Front-end Tickets</strong>: Users create tickets from the front-end.</p>\n</li>\n<li><strong>Visitor/Guest Tickets</strong>: Often users do not want to create an account to open support ticket. Guest tickets is very important feature and it is free.</li>\n<li><strong>Unlimited Tickets</strong>: There are not any limit of tickets in the base version.</li>\n<li><strong>Unlimited Agents</strong>: System support unlimited agents at admin area in the base version.</li>\n<li><strong>Support Icon</strong>: This is very important to show support icon on your site, JS Help Desk offer support icon for front-end with various position options.</li>\n<li><strong>Create Ticket for Users</strong>: Admin/agent can create ticket on the behalf on any user.</li>\n<li><strong>GDPR</strong>: JS Help Desk is fully compatible with GDPR law.</li>\n<li><strong>Erase Data Requests</strong>: User can ask to erase his data and admin have option to delete or anoyomise his data.</li>\n<li><strong>Multiple Attachments</strong>: User/agent/admin can upload multiple attachments in ticket creation and ticket replies</li>\n<li><strong>Attachment Size and Type</strong>: Admin can control ticket attachments by it size and extensions type.</li>\n<li><strong>Powerful Filters and Sorting</strong>: System offer powerfull filters for both user and admin to search tickets with sorting option.</li>\n<li><strong>Priorities</strong>: Priority associated to the ticket defines the importance, system highlight the priorities with admin defined different color on tickets listing and ticket detail page.</li>\n<li><strong>Unlimited Departments</strong>: Create departments that relates to the various business units in your organization. It will be sale, support, billing, you can create any department in admin panel. User will select department when he create the ticket.</li>\n<li><strong>Ticket Status</strong>: Show ticket status message and different colors to highlight it.</li>\n<li><strong>Email Notification</strong>: System send email notification to user, agents and admin in different actions i.e new ticket, reply, close ticket etc.</li>\n<li><strong>Edit Ticket</strong>: Admin/agent can edit any ticket at any time.</li>\n<li><strong>Registration</strong>: System offer a beautiful registration form to register new user.</li>\n<li><strong>Login Form</strong>: System have it own login form to login the user.</li>\n<li><strong>Captcha/ReCaptcha</strong>: Another exiting feature. System offer it own captchat and google recaptcha to stop spaming.</li>\n<li><strong>Thankyou Message for Visitor</strong>: Admin can add special message for visitor, message will show after successfull ticket sumission.</li>\n<li><strong>HTML Editor</strong>: HTML editor for ticket summary, ticket reply, notes etc.</li>\n<li><strong>Term &amp; Conditions</strong>: Admin can add Terms &amp; Conditions at ticket sumission page.</li>\n<li><strong>Themes</strong>: Themes make our site more beautiful and eye catchy. By using this feature, you can change your plugin colors or can select colors from seven preset color theme with different color palettes.</li>\n<li><strong>Email Templates</strong>: JS Help Desk offer full power to admin, admin can edit any email template in html editor. System include beautiful predefined email templates.</li>\n<li><strong>Custom Fields</strong>: Sometime you need extra fields, no problem. JS Help Desk offer 12+ custom fields (Text field, Drop down, Checkbox, Radio button, Text area, Dependent fields, Admin only, Date, Email, Upload file, Multi select and T&amp;C ). </li>\n<li><strong>Fields Manager</strong>: System offer a powerful feature to manage the fields. Admin can add, edit, rename, ordering, publish/ubpublished and required/un-required fields for user &amp; visitor.</li>\n<li><strong>Custom Message for new ticket</strong>: This is an important feature that admin show a message/instruction (any message in Text Editor) on ticket summission form.</li>\n<li><strong>Admin/Agent Only</strong>: This field is visible to admin and agent only.</li>\n<li><strong>Hide Agent/Admin Info</strong>: Admin can hide agent information like email, name from the user.</li>\n<li><strong>Email config</strong>: Another admin power, system offer enable/disable action base email notifications like ticket reply, close ticket, chage priority etc.</li>\n<li><strong>Strength &amp; Flexibility</strong>: JS Help Desk is built using WordPress best practises both on the front and the back end. This results in an efficient, robust and intuitive plugin.</li>\n<li><strong>Easy to Use</strong>: Ticket system build on the basis on latest style. You will find it very easy to use. </li>\n<li><strong>RTL ready</strong>: JS Help Desk also support to RTL languages.</li>\n<li><strong>Fully Responsive</strong>: JS Help Desk work on all type of devices including smart phones, tables, laptops and desktops. Layouts auto adjust according to devices.</li>\n<li><strong>System Errors</strong>: System record every error and show in admin area.</li>\n<li><strong>Hide/Show Menu</strong>: Admin can hide/show JS Help Desk any menu item in configuraitons.</li>\n<li><strong>Translations</strong>: JS Help Desk support multi-language and offer 35+ tranlsations.</li>\n<li><strong>Pagination</strong>: Admin can sent record per page in the configurations page.</li>\n<li><strong>JS Help Desk have reports on</strong><br />\n-Get a summary of tickets handled by every staff members<br />\n-Get a detail report of tickets handled by every staff members<br />\n-Get a detail report of tickets created by every users<br />\n-Get a summary of tickets by status<br />\n-Get a summary of tickets by priorities<br />\n-Get a summary of tickets by departments<br />\n-Get a summary of tickets created by channel</li>\n</ul>\n<h3>Premium Add-Ons</h3>\n<p>JS Help Desk is a professional and complete help desk system, it offers 35+ addons.</p>\n<p><strong>Addons</strong></p>\n<ul>\n<li><a href=\"https://jshelpdesk.com/product/email-piping/\" rel=\"nofollow ugc\">Email Piping</a> &#8211; With the e-mail piping add-on user can create ticket, reply to existing ticket by e-mail! Users can even create a new ticket and account by simply sending an email to your designated support email address i.e support@yourdomain.com. Whenever something happens on your support site (a client opens a new ticket, an agent replies to an existing ticket, etc), an e-mail notification is sent out automatically. With email support add-on enabled, there is no longer a need to log into the support site to reply to a ticket. Agents and clients can simply reply to the e-mail and their message will automatically be added to the ticket.</li>\n<li><a href=\"https://jshelpdesk.com/product/time-tracking/\" rel=\"nofollow ugc\">Time Tracking</a> &#8211; Track the time spent on tickets at the most granular level possible while also reporting at the Client and Agent levels. Manually record the time spent on each reply to a ticket. The timer starts by a single button when the ticket is open in the agent’s browser and stops by a single button when the agents is done with the ticket.</li>\n<li><a href=\"https://jshelpdesk.com/product/paid-support/\" rel=\"nofollow ugc\">Paid Support</a> &#8211; Do you want charge to your users for support tickets? JS Help Desk Paid Support addon offer to admin to charge users for every new ticket or monthly subscripton with number of tickets limistation. </li>\n<li><a href=\"https://jshelpdesk.com/product/agents/\" rel=\"nofollow ugc\">Agents</a> &#8211; Agent plays an important role for help desk and provide assistance to users associated with support system. By adding this add on, add multiple agents and assign permissions to facilitate users against their tickets. Moreover agents can create ticket, delete ticket, close ticket and can performs all the actions that are allowed to them by admin.</li>\n<li><a href=\"https://jshelpdesk.com/product/agent-auto-assign/\" rel=\"nofollow ugc\">Agent Auto Assign</a> &#8211; JS Help Desk auto assign ticket to the agent on the base of rules.</li>\n<li><a href=\"https://jshelpdesk.com/product/multi-forms/\" rel=\"nofollow ugc\">Multi Forms</a> &#8211; Admin can create multi form for ticket on department base. Admin can also manage form fields independently.</li>\n<li><a href=\"https://jshelpdesk.com/product/merge-ticket/\" rel=\"nofollow ugc\">Merge Tickets</a> &#8211; There are hundred of tickets submitted to get assistance in which some of the tickets might be on same topic and queries. To provide support to each ticket with the same topic causes the waste of time. By this add on, Merge any of the two tickets or more with the same topic and query and provide support one for everyone.</li>\n<li><a href=\"https://jshelpdesk.com/product/overdue/\" rel=\"nofollow ugc\">Ticket Overdue</a> &#8211; Any of the ticket which is not resolve in given time or not respond back in time known as overdue Ticket. By adding this add on, You can set auto overdue ticket, Overdue by priority and cron job overdue.</li>\n<li><a href=\"https://jshelpdesk.com/product/smtp/\" rel=\"nofollow ugc\">SMTP</a> &#8211; SMTP (Simple Mail Transfer Protocol) is a TCP/IP protocol used in sending and receiving e-mail. By adding this add on, Admin can set custom email protocol to sending and receiving email in support ticket.</li>\n<li><a href=\"https://jshelpdesk.com/product/ban-email/\" rel=\"nofollow ugc\">Ban Email</a> &#8211; Ban Email is used to restrict the user to create new tickets. By this add on, you can ban any of the user’s email however, he cannot able to create new tickets.</li>\n<li><a href=\"https://jshelpdesk.com/product/woocommerce/\" rel=\"nofollow ugc\">WooCommerce</a> &#8211; The tight integration between the two is guaranteed to leave your customers feeling like their support experience is deeply rooted in their purchasing experience. If you have a WooCommerce store, you must be providing support. </li>\n<li><a href=\"https://jshelpdesk.com/product/private-credentials/\" rel=\"nofollow ugc\">Private Credentials</a> &#8211; Offering a decent and safer environment for customer to store their private and personal data encrypted. Giving a way to customers to securely sensitives data to tickets will be automatically removed when tickets are closed.sensitive data to tickets – data that is automatically removed when tickets are closed.</li>\n<li><a href=\"https://jshelpdesk.com/product/email-cc/\" rel=\"nofollow ugc\">Email CC</a> &#8211; Want to send an email to another email address? Email CC addon make it easy. You can achieve it with very easy steps, just select the action and add the email. System will also send an email to provided email address. The CC recipient will receive an exact copy of the email.</li>\n<li><a href=\"https://jshelpdesk.com/product/export/\" rel=\"nofollow ugc\">Export</a> &#8211; Exports are used to keep data at locals. By adding this add on, You can export any of the ticket data like ticket detail, ticket history and etc.</li>\n<li><a href=\"https://jshelpdesk.com/product/desktop-notification/\" rel=\"nofollow ugc\">Desktop Notification</a> &#8211; The desktop notifications add-on will keep you up to date with your support operations anytime. Every time something happens on your support, you are instantly notified. A notification popup will appear on your screen on each action happens associated with support ticket.</li>\n<li><a href=\"https://jshelpdesk.com/product/ticket-history/\" rel=\"nofollow ugc\">Ticket History</a> &#8211; Ticket History or Activity log become essentials for help desk. By adding this add on, Get complete activity log or ticket history of each action happens on ticket by agent. Keep the record of every ticket either it is closed or open.</li>\n<li><a href=\"https://jshelpdesk.com/product/close-ticket/\" rel=\"nofollow ugc\">Ticket Auto Close</a> &#8211; Auto Close Ticket reduce your effort to close ticket manually. By adding the add on, Ticket will be auto close after specific interval of time or pre defiend rules which can be set by admin. Ticket can also be close on reply by agent while ticket is open.</li>\n<li><a href=\"https://jshelpdesk.com/product/feedback/\" rel=\"nofollow ugc\">Feedback</a> &#8211; By adding this add on, you can get feedback from your users to enhance your quality of services. This add on allows you to automatically collect feedback responses that rate your agent’s performance on a ticket. This add on send a feedback link after a ticket is closed. The user will click a survey link and fill out the survey form on your website.</li>\n<li><a href=\"https://jshelpdesk.com/product/helptopic/\" rel=\"nofollow ugc\">Helptopic</a> &#8211; Help Topic is used to help end user to find the desired area in which they want to get instances and support. By adding this add on, Add multiples help topics with different name of areas to help your customer in more easier way.</li>\n<li><a href=\"https://jshelpdesk.com/product/internal-note/\" rel=\"nofollow ugc\">Private Note</a> &#8211; Wanna add a note to yourself? Do you need to transfer a ticket to another agent and want to give him some background on the issue? With the Private Notes addon you are able to add as many notes as you want to a ticket, and the user will never see them.</li>\n<li><a href=\"https://jshelpdesk.com/product/knowledge-base/\" rel=\"nofollow ugc\">Knowledge Base</a> &#8211; Knowledge Base are essentially used to help customer queries at basic levels, By adding this add on, add multiple knowledge base, group solutions by different topics to facilitate users.</li>\n<li><a href=\"https://jshelpdesk.com/product/canned-responses/\" rel=\"nofollow ugc\">Canned Response</a> &#8211; Canned responses are predetermined responses to common questions. By adding this add on, the agent may insert a canned response triggered by keystrokes or from a drop-down menu, rather than typing the same answer repeatedly or pasting from some other resource.</li>\n<li><a href=\"https://jshelpdesk.com/product/max-ticket/\" rel=\"nofollow ugc\">Max Tickets</a> &#8211; Help Desk usually offers unlimited tickets which can make huge traffic and can gradually effect on support services. By adding this add on, Admin can limit the user to create x number of tickets. User can only create X number tickets which is defined by admin. Admin can also set X number of tickets for agents to open at once.</li>\n<li><a href=\"https://jshelpdesk.com/product/mail-chimp/\" rel=\"nofollow ugc\">Mail Chimp</a> &#8211; User options allows to add Google Re-captcha or JS Help Desk Re-captcha for registration form. furthermore, user can be register as per role defined by admin such as subscriber, author and etc.</li>\n<li><a href=\"https://jshelpdesk.com/product/user-options/\" rel=\"nofollow ugc\">User Options</a> &#8211; User options allows to add Google Re-captcha or JS Help Desk Re-captcha for registration form. furthermore, user can be register as per role defined by admin such as subscriber, author and etc.</li>\n<li><a href=\"https://jshelpdesk.com/product/actions/\" rel=\"nofollow ugc\">Ticket Actions</a> &#8211; There are multiple options on every ticket like create, edit and delete. By this add on, You can get more options like Print Ticket, Lock ticket, Make Ticket in progress and change ticket priority.</li>\n<li><a href=\"https://jshelpdesk.com/product/announcements/\" rel=\"nofollow ugc\">Announcements</a> &#8211; Keep your customer update with the latest trends. By this add on, Make unlimited announcement against various categories to explore information associated with help desk.</li>\n<li><a href=\"https://jshelpdesk.com/product/downloads/\" rel=\"nofollow ugc\">Downloads</a> &#8211; Downloads are very common to help users to download all the relevant information from downloads. By this add on, Create unlimited downloads and add supporting files for users.</li>\n<li><a href=\"https://jshelpdesk.com/product/faq/\" rel=\"nofollow ugc\">FAQ</a> &#8211; Faqs (Frequently asked questions) are commonly use to answer all the user common questions at the earlier. By adding this add on, add unlimited Faqs to answer all the basic questions asked by users.</li>\n<li><a href=\"https://jshelpdesk.com/product/admin-widget/\" rel=\"nofollow ugc\">Admin Widgets</a> &#8211; Successful businesses run on data. So how would you like to see an immediate data of your support operations as soon as you log into your WordPress administration area? With this add-on you can get that. Take a look at the wealth of data you can access when you log into your WordPress Admin Dashboard. Key data widget include Latest Ticket and Ticket stats.</li>\n<li><a href=\"https://jshelpdesk.com/product/internal-mail/\" rel=\"nofollow ugc\">Internal Mail</a> &#8211; Internal e-mail are used to send and receive emails from one agent to another agent with in the support ticket.By adding this add on, Internal e-mail enables you to send or receive email to one another.</li>\n<li><a href=\"https://jshelpdesk.com/product/envato/\" rel=\"nofollow ugc\">Envato Validation</a> &#8211; With the Envato Validation addon, you can limit ticket submissions to your actual clients. By asking for their Envato purchase code, the plugin will Validate Envato licenses before allowing a user to open a ticket. It offers single product support, multiple products support and pre-product support.</li>\n<li><a href=\"https://jshelpdesk.com/product/widget/\" rel=\"nofollow ugc\">Front-End Widgets</a> &#8211; Widgets in WordPress allows you to add content and features in the widgetized areas of your theme which is mostly the sidebar. However these widget-ready areas can be in the header, footer, sidebar, below content, and basically any other area in your theme. By adding this add on, widget is offering two default widget of Latest ticket and Email Notification Widget.</li>\n<li><a href=\"https://jshelpdesk.com/product/multi-language-email-templates/\" rel=\"nofollow ugc\">Multi Language Email Templates</a> &#8211; It allows you to create a language-based email template for all default email templates in JS Help Desk.</li>\n<li><a href=\"https://jshelpdesk.com/product/easy-digital-download/\" rel=\"nofollow ugc\">Easy Digital Download</a> &#8211;  &hellip;</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/js-support-ticket.2.8.7.zip",
    "upgrade_notice": {
        "": "<p>Bugfixes for latest version.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-1.png?rev=2246832",
            "caption": "<p>Admin panel</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-2.png?rev=2246832",
            "caption": "<p>Admin Tickets</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-3.png?rev=2246832",
            "caption": "<p>Ticket Detail - Admin</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-4.png?rev=2246832",
            "caption": "<p>Configurations</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-5.png?rev=2246832",
            "caption": "<p>Departments</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-6.png?rev=2246832",
            "caption": "<p>Priorities</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-7.png?rev=2246832",
            "caption": "<p>Email Templates</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-8.png?rev=2246832",
            "caption": "<p>User Fields</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-9.png?rev=2246832",
            "caption": "<p>My Tickets - front-end</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-10.png?rev=2246832",
            "caption": "<p>Create new ticket - front-end</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-11.png?rev=2246832",
            "caption": "<p>Ticket Details - front-end</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-12.png?rev=2246832",
            "caption": "<p>Overall Reports</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-13.png?rev=2246832",
            "caption": "<p>Customer Feedbacks</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-14.png?rev=2246832",
            "caption": "<p>Report by Staff Members</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-15.png?rev=2246832",
            "caption": "<p>Report by Departments</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-16.png?rev=2246832",
            "caption": "<p>Timer</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-17.png?rev=2246832",
            "caption": "<p>Feedback</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-18.png?rev=2246832",
            "caption": "<p>Staff Member Control Panel</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-19.png?rev=2246832",
            "caption": "<p>Staff Member Tickets</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-20.png?rev=2246832",
            "caption": "<p>Staff Members List</p>"
        },
        {
            "src": "https://ps.w.org/js-support-ticket/assets/screenshot-21.png?rev=2246832",
            "caption": "<p>Internal Mails</p>"
        }
    ],
    "tags": {
        "helpdesk": "helpdesk",
        "support": "support",
        "support-ticket": "Support Ticket",
        "ticket-system": "ticket system",
        "tickets": "tickets"
    },
    "stable_tag": "2.8.7",
    "versions": {
        "2.5.1": "https://downloads.wordpress.org/plugin/js-support-ticket.2.5.1.zip",
        "2.5.2": "https://downloads.wordpress.org/plugin/js-support-ticket.2.5.2.zip",
        "2.5.3": "https://downloads.wordpress.org/plugin/js-support-ticket.2.5.3.zip",
        "2.5.4": "https://downloads.wordpress.org/plugin/js-support-ticket.2.5.4.zip",
        "2.5.5": "https://downloads.wordpress.org/plugin/js-support-ticket.2.5.5.zip",
        "2.5.6": "https://downloads.wordpress.org/plugin/js-support-ticket.2.5.6.zip",
        "2.5.7": "https://downloads.wordpress.org/plugin/js-support-ticket.2.5.7.zip",
        "2.5.8": "https://downloads.wordpress.org/plugin/js-support-ticket.2.5.8.zip",
        "2.5.9": "https://downloads.wordpress.org/plugin/js-support-ticket.2.5.9.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/js-support-ticket.2.6.0.zip",
        "2.6.1": "https://downloads.wordpress.org/plugin/js-support-ticket.2.6.1.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/js-support-ticket.2.6.2.zip",
        "2.6.3": "https://downloads.wordpress.org/plugin/js-support-ticket.2.6.3.zip",
        "2.6.4": "https://downloads.wordpress.org/plugin/js-support-ticket.2.6.4.zip",
        "2.6.5": "https://downloads.wordpress.org/plugin/js-support-ticket.2.6.5.zip",
        "2.6.6": "https://downloads.wordpress.org/plugin/js-support-ticket.2.6.6.zip",
        "2.6.7": "https://downloads.wordpress.org/plugin/js-support-ticket.2.6.7.zip",
        "2.6.8": "https://downloads.wordpress.org/plugin/js-support-ticket.2.6.8.zip",
        "2.6.9": "https://downloads.wordpress.org/plugin/js-support-ticket.2.6.9.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/js-support-ticket.2.7.0.zip",
        "2.7.1": "https://downloads.wordpress.org/plugin/js-support-ticket.2.7.1.zip",
        "2.7.2": "https://downloads.wordpress.org/plugin/js-support-ticket.2.7.2.zip",
        "2.7.3": "https://downloads.wordpress.org/plugin/js-support-ticket.2.7.3.zip",
        "2.7.4": "https://downloads.wordpress.org/plugin/js-support-ticket.2.7.4.zip",
        "2.7.5": "https://downloads.wordpress.org/plugin/js-support-ticket.2.7.5.zip",
        "2.7.6": "https://downloads.wordpress.org/plugin/js-support-ticket.2.7.6.zip",
        "2.7.7": "https://downloads.wordpress.org/plugin/js-support-ticket.2.7.7.zip",
        "2.7.8": "https://downloads.wordpress.org/plugin/js-support-ticket.2.7.8.zip",
        "2.7.9": "https://downloads.wordpress.org/plugin/js-support-ticket.2.7.9.zip",
        "2.8.0": "https://downloads.wordpress.org/plugin/js-support-ticket.2.8.0.zip",
        "2.8.1": "https://downloads.wordpress.org/plugin/js-support-ticket.2.8.1.zip",
        "2.8.2": "https://downloads.wordpress.org/plugin/js-support-ticket.2.8.2.zip",
        "2.8.3": "https://downloads.wordpress.org/plugin/js-support-ticket.2.8.3.zip",
        "2.8.4": "https://downloads.wordpress.org/plugin/js-support-ticket.2.8.4.zip",
        "2.8.5": "https://downloads.wordpress.org/plugin/js-support-ticket.2.8.5.zip",
        "2.8.6": "https://downloads.wordpress.org/plugin/js-support-ticket.2.8.6.zip",
        "2.8.7": "https://downloads.wordpress.org/plugin/js-support-ticket.2.8.7.zip",
        "trunk": "https://downloads.wordpress.org/plugin/js-support-ticket.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://jshelpdesk.com/pricing/",
    "banners": {
        "low": "https://ps.w.org/js-support-ticket/assets/banner-772x250.png?rev=2352338",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/js-support-ticket/assets/icon-128x128.png?rev=2355805"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 74,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}