{
    "name": "PaysonCheckout for WooCommerce",
    "slug": "krokedil-paysoncheckout-20-for-woocommerce",
    "version": "3.8.0",
    "author": "<a href=\"http://krokedil.com/\">Krokedil</a>",
    "author_profile": "https://profiles.wordpress.org/krokedil/",
    "contributors": {
        "krokedil": {
            "profile": "https://profiles.wordpress.org/krokedil/",
            "avatar": "https://secure.gravatar.com/avatar/d6447306e798c4bc817bfa836b38e43b?s=96&d=monsterid&r=g",
            "display_name": "Krokedil"
        },
        "niklashogefjord": {
            "profile": "https://profiles.wordpress.org/niklashogefjord/",
            "avatar": "https://secure.gravatar.com/avatar/7d83ffba45f8b681b1e6099b279c9482?s=96&d=monsterid&r=g",
            "display_name": "Niklas Högefjord"
        }
    },
    "requires": "4.5",
    "tested": "6.6.1",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 80,
    "ratings": {
        "5": 2,
        "4": 0,
        "3": 2,
        "2": 0,
        "1": 0
    },
    "num_ratings": 4,
    "support_url": "https://wordpress.org/support/plugin/krokedil-paysoncheckout-20-for-woocommerce/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 3000,
    "downloaded": 104734,
    "last_updated": "2024-08-13 08:23:00",
    "added": "2016-08-30",
    "homepage": "http://krokedil.com/",
    "sections": {
        "description": "<ul>\n<li>All payment methods with one contract</li>\n<li>No fixed fees, get started within 24 hours</li>\n<li>The customer never leaves your e-commerce store</li>\n</ul>\n<p>In PaysonCheckout Payson has removed all unnecessary steps in the checkout to increase conversions and sales. The payment window is nicely integrated into your e-store where customers can pay with a single click! All purchases are based on the service Invoice via email. The customer can then choose to get the goods delivered first and pay retrospectively or pay the invoice immediately upon purchase, for example by card, online bank payment or SMS.</p>\n<p>To get started with Payson you need to <a href=\"https://www.payson.se/sv/\" rel=\"nofollow ugc\">sign up</a> for a Business account.</p>\n<p>More information on how to get started can be found in the <a href=\"http://docs.krokedil.com/se/documentation/paysoncheckout-2-0-woocommerce/\" rel=\"nofollow ugc\">plugin documentation</a>.</p>\n",
        "installation": "<ol>\n<li>Download and unzip the latest release zip file.</li>\n<li>If you use the WordPress plugin uploader to install this plugin skip to step 4.</li>\n<li>Upload the entire plugin directory to your /wp-content/plugins/ directory.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress Administration.</li>\n<li>Go WooCommerce Settings &#8211;&gt; Payment Gateways and configure your Payson settings.</li>\n<li>Read more about the configuration process in the <a href=\"http://docs.krokedil.com/se/documentation/paysoncheckout-2-0-woocommerce/\" rel=\"nofollow ugc\">plugin documentation</a>.</li>\n</ol>\n",
        "changelog": "<h4>2024.08.13    &#8211; version 3.8.0</h4>\n<ul>\n<li>Feature       &#8211; Payson events will now be scheduled using the WC Action Scheduler.</li>\n<li>Fix           &#8211; Fixed an issue where the customer could not change subscription payment method to Payson.</li>\n<li>Fix           &#8211; Fixed an issue where Payson would not be available as payment option on the pay for order page if the order&#8217;s payment method was not set to Payson.</li>\n<li>Fix           &#8211; Removed reference to the deprecated wc_get_log_file_path function.</li>\n<li>Tweak         &#8211; Prevent the Payson order from being modified if it has already been finalized.</li>\n</ul>\n<h4>2024.02.02    &#8211; version 3.7.1</h4>\n<ul>\n<li>Fix           &#8211; Fixed an issue where the incorrect language would be set in the checkout.</li>\n</ul>\n<h4>2024.01.29    &#8211; version 3.7.0</h4>\n<ul>\n<li>Feature       &#8211; Added support for WooCommerce&#8217;s &#8220;High-Performance Order Storage&#8221; (&#8220;HPOS&#8221;).</li>\n<li>Feature       &#8211; Added support for Danish and Norwegian.</li>\n<li>Fix           &#8211; Resolved deprecation warnings.</li>\n</ul>\n<h4>2023.08.29    &#8211; version 3.6.1</h4>\n<ul>\n<li>Fix           &#8211; Fixed an issue where a string comparison failed due to HTML entities in the item name.</li>\n<li>Fix           &#8211; Revert changes from previous update that prevented renewal of failed subscriptions.</li>\n</ul>\n<h4>2023.08.28    &#8211; version 3.6.0</h4>\n<ul>\n<li>Feature       &#8211; Added supports for multiple checkout layouts.</li>\n<li>Fix           &#8211; Fixed an issue where the customer could not pay for a subscription through their account page.</li>\n<li>Tweak         &#8211; Added a remote order status check to prevent error due to conflicting local and remote order status.</li>\n<li>Tweak         &#8211; Payson do not support changing subscription payment method through their API. This feature support has therefore been removed from WooCommerce for Payson orders. You can still changing payment method through Payson&#8217;s account page.</li>\n</ul>\n<h4>2023.02.28    &#8211; version 3.5.1</h4>\n<ul>\n<li>Fix           &#8211; Fix a fatal error caused by a check in PHP versions older than 8.0.0.</li>\n</ul>\n<h4>2023.02.28    &#8211; version 3.5.0</h4>\n<ul>\n<li>Feature       &#8211; Added alternative checkout layouts.</li>\n<li>Fix           &#8211; Fixed a fatal error that sometimes happens when updating the Payson order reference.</li>\n<li>Fix           &#8211; Check if a session is available before attempting to retrieve the payment ID.</li>\n<li>Fix           &#8211; Fixed an issue where when attempting to refund a recurring payment (&#8220;subscription&#8221;), 404 was returned.</li>\n<li>Fix           &#8211; The Payson confirmation should now appear properly on the thank-you page in cases where the customer would reload the page.</li>\n<li>Fix           &#8211; Fixed an issue where recurring payments would not be refunded due to a credit mismatch.</li>\n<li>Tweak         &#8211; Modified the way we identify and retrieve the order to be refunded.</li>\n</ul>\n<h4>2022.09.29    &#8211; version 3.4.4</h4>\n<ul>\n<li>Fix           &#8211; Fixed a syntax error that causes a crash.</li>\n<li>Tweak         &#8211; Verify that the Payson settings are properly loaded before modifying them.</li>\n</ul>\n<h4>2022.08.08    &#8211; version 3.4.3</h4>\n<ul>\n<li>Fix           &#8211; Fixed the login button on the checkout page sometimes being displaced.</li>\n<li>Tweak         &#8211; If the WC and Payson total amount differs, the customer will be notified about this.</li>\n</ul>\n<h4>2022.06.29    &#8211; version 3.4.2</h4>\n<ul>\n<li>Fix           &#8211; Fixed an issue that would cause a critical error on versions of PHP older than 7.3. The WooCommerce team <a href=\"https://woocommerce.com/document/update-php-wordpress/\" rel=\"nofollow ugc\">strongly recommends</a> upgrading to PHP 7.4 for better performance and security.</li>\n</ul>\n<h4>2022.06.08    &#8211; version 3.4.1</h4>\n<ul>\n<li>Fix           &#8211; Fixed an issue that would cause the order review to update indefinitely if the cart contained a subscription product.</li>\n<li>Fix           &#8211; Fixed a fatal error that some sometimes happen when a checkout session is reinitialized.</li>\n</ul>\n<h4>2022.05.24    &#8211; version 3.4.0</h4>\n<ul>\n<li>Fix           &#8211; Fixed an issue where customer could not change the payment method of an existing subscription to Payson.</li>\n<li>Enhancement   &#8211; Added stacktrace to log for troubleshooting purposes.</li>\n<li>Tweak         &#8211; Log data is no longer autoloaded, only when needed.</li>\n<li>Tweak         &#8211; A new Payson checkout session is created when the currency is changed.</li>\n</ul>\n<h4>2022.02.11    &#8211; version 3.3.0</h4>\n<ul>\n<li>Feature       &#8211; We will now save the last 15 requests to Payson that had an API error and display them on the WooCommerce status page. This should help with getting error messages when you need to debug issues without going through the logs. These will also be in the status report that you can send to us for support tickets.</li>\n<li>Tweak         &#8211; Bumped required PHP version to 7.0.</li>\n<li>Tweak         &#8211; Minimum order/cart amount to make PaysonCheckout available in checkout is now 10 SEK or 1 EUR.</li>\n<li>Fix           &#8211; Improved control in detecting when requested refunds don&#8217;t match up with what is actually refunded.</li>\n<li>Fix           &#8211; Do not set WooCommerce order status to On hold in capture request if order has already been captured (in situations when capture has been done in Payson backoffice).</li>\n</ul>\n<h4>2021.09.22    &#8211; version 3.2.3</h4>\n<ul>\n<li>Fix           &#8211; Fixed an issue with subscriptions not being placed correctly in some cases.</li>\n</ul>\n<h4>2021.09.15    &#8211; version 3.2.2</h4>\n<ul>\n<li>Enhancement   &#8211; Add support to confirm orders in WooCommerce using the callback from Payson. This will help in cases where customers dont return to the checkout after completing the 3DS step.</li>\n<li>Enhancement   &#8211; Add support to be able to handle recurring payment callbacks from Payson when they confirm the order.</li>\n</ul>\n<h4>2021.08.20    &#8211; version 3.2.1</h4>\n<ul>\n<li>Enhancement   &#8211; Improved checks before we cancel an order with Payson to prevent canceling a Payson order incorrectly.</li>\n<li>Fix           &#8211; PHP 8.0 compatability.</li>\n<li>Fix           &#8211; Changed how we handle recurring payments with WooCommerce subscriptions. They will now first be created as Pending payment pending a callback from Payson when the order has been approved.</li>\n</ul>\n<h4>2021.08.09    &#8211; version 3.2.0</h4>\n<ul>\n<li>Feature       &#8211; Added a setting to set which default customer type to use for the checkout. B2C for Business to Customer, the current default. And B2B for Business to Business.</li>\n<li>Enhancement   &#8211; Added support for Facebook Pixels through the Facebook for WooCommerce plugin.</li>\n<li>Fix           &#8211; Removed a check that caused Payson to not be listed as an available checkout option on admin pages.</li>\n<li>Fix           &#8211; Fixed an issue causing an incorrect tax amount to be set for fees when using the pay for order feature in WooCommerce.</li>\n</ul>\n<h4>2021.05.24    &#8211; version 3.1.0</h4>\n<ul>\n<li>Feature       &#8211; Add support for expiration date for recurring payments. You can set the number of days you want the recurring payment to expire in with Payson.</li>\n</ul>\n<h4>2021.04.08    &#8211; version 3.0.4</h4>\n<ul>\n<li>Fix           &#8211; Fixed an infinite reload of the checkout page when you had a free trial subscription.</li>\n</ul>\n<h4>2021.03.10    &#8211; version 3.0.3</h4>\n<ul>\n<li>Fix           &#8211; Fixed a possible 404 error when placing a subscription order.</li>\n<li>Fix           &#8211; Fixed an error notice.</li>\n</ul>\n<h4>2021.01.27    &#8211; version 3.0.2</h4>\n<ul>\n<li>Enhancement   &#8211; Send customer data in the create call to PaysonCheckout if the customer is a pre existing customer.</li>\n<li>Localization  &#8211; Updated Swedish translation.</li>\n<li>Fix           &#8211; Fixed some error notices.</li>\n<li>Fix           &#8211; Fixed an error that would happen if you deactivated WooCommerce but kept PaysonCheckout active.</li>\n</ul>\n<h4>2021.01.12    &#8211; version 3.0.1</h4>\n<ul>\n<li>Fix           &#8211; Fixed a JavaScript error causing a order to not be properly created in WooCommerce that happens on some servers.</li>\n</ul>\n<h4>2021.01.13    &#8211; version 3.0.0</h4>\n<ul>\n<li>Major         &#8211; Major rewrite of the entire flow for the checkout process. Implementing a frontend event to speed up the checkout process, and compatibility with other plugins.</li>\n<li>Feature       &#8211; Support for extra checkout fields.</li>\n<li>Feature       &#8211; Support for Pay for orders. Orders generated by the store admin can now be completed by a customer using Payson Checkout.</li>\n<li>Fix           &#8211; Fixed an issue that caused a error when applying a 100% discount coupon.</li>\n</ul>\n<h4>2020.03.17    &#8211; version 2.3.4</h4>\n<ul>\n<li>Enhancement   &#8211; Using order number instead of order id to set the merchant reference in Payson system. (Compatibility improvement with WooCommerce Sequential Order Number).</li>\n</ul>\n<h4>2020.02.25  &#8211; version 2.3.3</h4>\n<ul>\n<li>Fix           &#8211; Fixed the handling of a denied recurring payment.</li>\n</ul>\n<h4>2020.01.21  &#8211; version 2.3.2</h4>\n<ul>\n<li>Fix           &#8211; Fixed an issue calculating the tax rate if a site had multiple tax rates settup.</li>\n</ul>\n<h4>2019.12.13  &#8211; version 2.3.1</h4>\n<ul>\n<li>Fix           &#8211; Save subscription ID correctly in WooCommerce subscription if a subscription has a free trial.</li>\n</ul>\n<h4>2019.12.10  &#8211; version 2.3.0</h4>\n<ul>\n<li>Feature       &#8211; Free trial subscriptions is now supported in the plugin.</li>\n<li>Enhancement   &#8211; Added more logging in the notification callback function.</li>\n<li>Fix           &#8211; Comparing with correct payment id in notification callback if order is a subscription.</li>\n</ul>\n<h4>2019.11.11  &#8211; version 2.2.1</h4>\n<ul>\n<li>Enhancement   &#8211; Added default for Last name when customer type is business. Prevents orders from being created on checkout error fallback.</li>\n</ul>\n<h4>2019.09.25  &#8211; version 2.2.0</h4>\n<ul>\n<li>Feature       &#8211; Added support for creating orders via API callback.</li>\n</ul>\n<h4>2019.08.09  &#8211; version 2.1.1</h4>\n<ul>\n<li>Fix           &#8211; Updating nonce correctly on update_checkout. This could cause issues finalizing order if logging in on checkout page.</li>\n<li>Fix           &#8211; Added checks to prevent JS error with some themes in checkout page.</li>\n<li>Fix           &#8211; Fix for order going through even if login in required and user isn&#8217;t logged in.</li>\n</ul>\n<h4>2019.05.28  &#8211; version 2.1.0</h4>\n<ul>\n<li>Feature       &#8211; Added support for recurring orders through WooCommerce Subscriptions ( https://woocommerce.com/products/woocommerce-subscriptions/ ).</li>\n<li>Enhancement   &#8211; Better handling of payment id transfer between frontend and server to server calls.</li>\n<li>Fix           &#8211; Fixed fee totals calculations. Caused missmatches between Payson and WooCommerce.</li>\n<li>Fix           &#8211; Set customer country properly on server to server callbacks. WooCommerce 3.6 compatible.</li>\n</ul>\n<h4>2019.04.18  &#8211; version 2.0.3</h4>\n<ul>\n<li>Enhancement   &#8211; Added swedish translation of plugin.</li>\n<li>Fix           &#8211; Fixed an issue getting a fee name.</li>\n</ul>\n<h4>2019.04.10  &#8211; version 2.0.2</h4>\n<ul>\n<li>Enhancement   &#8211; Added check on Payson order status for checkout page to create a new checkout session if the order is expired, canceled and so on.</li>\n<li>Enhancement   &#8211; Added integration information to all requests to Payson for easier debugging.</li>\n<li>Tweak         &#8211; Removed setting for mandatory phone number. We now go off if the phone number field is required or not.</li>\n<li>Tweak         &#8211; Moved a update checkout trigger to cover more scenarios for postcode based shipping.</li>\n<li>Fix           &#8211; Fixed inline CSS to prevent an overflow scroll for mobile users on checkout page.</li>\n</ul>\n<h4>2019.04.08  &#8211; version 2.0.1</h4>\n<ul>\n<li>Tweak         &#8211; Changed location of extra checkout fields to be above the iFrame.</li>\n<li>Tweak         &#8211; Re-added the language pot file.</li>\n<li>Tweak         &#8211; Retain the extra checkout field validation message.</li>\n</ul>\n<h4>2019.04.03  &#8211; version 2.0.0</h4>\n<ul>\n<li>Feature       &#8211; Added support for Extra Checkout field validation.</li>\n<li>Feature       &#8211; Added support for full order refunds with Payson.</li>\n<li>Feature       &#8211; Better error handling and logging.</li>\n<li>Feature       &#8211; Added stock, coupon and order total validation before completing checkout.</li>\n<li>Feature       &#8211; Added filters to all request arguments. Create and update Payson order.</li>\n<li>Tweak         &#8211; Complete rewrite of plugin.</li>\n<li>Tweak         &#8211; Only create a WooCommerce order when Payson payment is completed.</li>\n<li>Tweak         &#8211; Update the order reference in Payson on WooCommerce payment complete.</li>\n<li>Tweak         &#8211; Optimized checkout process.</li>\n<li>Tweak         &#8211; Optimized JavaScript for checkout and confirmation page.</li>\n</ul>\n<h4>2018.10.16    &#8211; version 1.4.0</h4>\n<ul>\n<li>Feature       &#8211; Added support for wp_add_privacy_policy_content (for GDPR compliance). More info: https://core.trac.wordpress.org/attachment/ticket/43473/PRIVACY-POLICY-CONTENT-HOOK.md.</li>\n<li>Tweak         &#8211; Improved error messaging in Payson account check request.</li>\n<li>Fix           &#8211; Updated compatability functions to prevent error.</li>\n<li>Tweak         &#8211; Added filters payson_pay_data, payson_gui &amp; payson_customer to allow merchants to modify order data sent to Payson.</li>\n<li>Tweak         &#8211; Added company name to WooCommerce order if purchase is a B2B order.</li>\n<li>Fix           &#8211; Changed how JS eventlistener PaysonEmbeddedAddressChanged was implemented. Some websites was not able to retrieve customer address data.</li>\n<li>Fix           &#8211; Submission failure process bug fix. Order is now created in Woo and customer redirected to thankyou page even if original checkout form submission fails.</li>\n</ul>\n<h4>2018.05.15    &#8211; version 1.3.1</h4>\n<ul>\n<li>Tweak         &#8211; Only make merchant account validation request to Payson on PaysonCheckout 2.0 settings page.</li>\n<li>Fix           &#8211; Don’t display Payson as an available payment method if cart total is too low (below 4 SEK or 0 EUR).</li>\n<li>Fix           &#8211; Save customer order note correctly when processing WC checkout/order.</li>\n</ul>\n<h4>2018.05.04    &#8211; version 1.3.0</h4>\n<ul>\n<li>Feature       &#8211; Added support for handling payments of manually created orders (via Pay for order page).</li>\n<li>Tweak         &#8211; Save _payson_checkout_id to WC order in thank you page if it hasn&#8217;t been saved earlier.</li>\n</ul>\n<h4>2018.04.09    &#8211; version 1.2.3</h4>\n<ul>\n<li>Tweak         &#8211; Change priority to 999 for filter woocommerce_locate_template so that PaysonCheckout template file doesn&#8217;t get overwritten by other plugins/themes.</li>\n<li>Fix           &#8211; Changed text domain for &#8220;Select another payment method&#8221; label so it uses translation files in plugin.</li>\n</ul>\n<h4>2018.04.05    &#8211; version 1.2.2</h4>\n<ul>\n<li>Tweak         &#8211; Improved error logging/handling.</li>\n<li>Tweak         &#8211; Display error message in checkout if Payson iframe doesnt load.</li>\n<li>Fix           &#8211; Unset payson_checkout_id session if communication error happens.</li>\n</ul>\n<h4>2018.04.05    &#8211; version 1.2.1</h4>\n<ul>\n<li>Fix           &#8211; Refer to self in static function to avoid issues when processing order in WooCommerce checkout.</li>\n<li>Fix           &#8211; Logging improvements.</li>\n<li>Tweak         &#8211; Don&#8217;t rely on session data in thank you page when trigger payment_complete().</li>\n</ul>\n<h4>2018.03.23    &#8211; version 1.2.0</h4>\n<ul>\n<li>Feature       &#8211; Use template file for displaying Payson Checkout. Making it possible to overwrite via theme.</li>\n<li>Tweak         &#8211; Make initial call to Payson before the checkout page is rendered. Reusluts in a faster loading Payson Checkout iframe.</li>\n<li>Tweak         &#8211; Submit WC checkout form when purchase is finalized in Payson iframe. Making it possible to save more order/cart data.</li>\n<li>Tweak         &#8211; Pause and resume current iframe on update_checkout event instead of re-rendering the html/iframe.</li>\n<li>Tweak         &#8211; Logging improvements.</li>\n<li>Tweak         &#8211; Schedule readyToShip notification callback to be executed in WC 2 minutes after purchase. For better order status control.</li>\n<li>Fix           &#8211; Avoid order status updates to be executed in a way so that new order email is missing customer address data.</li>\n</ul>\n<h4>2018.02.18    &#8211; version 1.1.14</h4>\n<ul>\n<li>Fix           &#8211; WC 3.3 switch payment method bug fix (not being able to switch from Payson to other gateway).</li>\n<li>Fix           &#8211; Flatesome theme css compatibility fix.</li>\n</ul>\n<h4>2017.12.06    &#8211; version 1.1.13</h4>\n<ul>\n<li>Tweak         &#8211; Save order after adding customer data in ready to ship callback.</li>\n</ul>\n<h4>2017.12.06    &#8211; version 1.1.12</h4>\n<ul>\n<li>Fix           &#8211; Re-add possibility to send items to Payson with price set to 0.</li>\n<li>Fix           &#8211; Only include Krokedil compatibility functions if they don&#8217;t already exist (compat w other plugins).</li>\n</ul>\n<h4>2017.11.22  &#8211; version 1.1.11</h4>\n<ul>\n<li>Fix           &#8211; Don’t send items to Payson with price set to 0. Product Bundles compatibility fix.</li>\n<li>Tweak         &#8211; Improved logging.</li>\n</ul>\n<h4>2017.10.09    &#8211; version 1.1.10</h4>\n<ul>\n<li>Fix           &#8211; Only delete WC order on expired callback from Payson if WC order has status payson-incomplete.</li>\n</ul>\n<h4>2017.09.29      &#8211; version 1.1.9</h4>\n<ul>\n<li>Fix           &#8211; Changed how we get the name of fees from $fee-&gt;label to $fee-&gt;name.</li>\n<li>Fix           &#8211; No longer possible for division by zero on Product vat.</li>\n<li>Fix           &#8211; Allowed countries sent to Payson changed from WC allowed shipping countries to WC allowed countries.</li>\n</ul>\n<h4>2017.08.25      &#8211; version 1.1.8</h4>\n<ul>\n<li>Tweak         &#8211; Adds loading spinner when waiting for the Payson iframe to render.</li>\n<li>Tweak         &#8211; Restrict product names sent to Payson to be max 199 characters.</li>\n<li>Tweak         &#8211; Added check to make sure that WC Gateway is loaded.</li>\n<li>Tweak         &#8211; Removed apply_filters woocommerce_cart_item_name when sending cart items to Payson. This filter can be used by themes to add html.</li>\n<li>Fix           &#8211; Adds fix that moves &#8220;Select another payment method&#8221; button to above order review section when checkout is updated via ajax.</li>\n</ul>\n<h4>2017.07.07    &#8211; version 1.1.7</h4>\n<ul>\n<li>Fix           &#8211; Adds customer email to local order in payson_address_changed_callback() callback. Fixes bug where customer confirmation email not being sent.</li>\n</ul>\n<h4>2017.07.03    &#8211; version 1.1.6</h4>\n<ul>\n<li>Fix           &#8211; Shipping tax sent correctly to Payson.</li>\n</ul>\n<h4>2017.07.03    &#8211; version 1.1.5</h4>\n<ul>\n<li>Fix           &#8211; Updated get_product_name() function (product name sent to Payson). Caused bug with WooCommerce 3.1.</li>\n</ul>\n<h4>2017.05.31    &#8211; version 1.1.4</h4>\n<ul>\n<li>Fix           &#8211; Added customer note to an order made with PaysonCheckout 2.0.</li>\n<li>Fix           &#8211; Added support to limit countries that can be chosen under &#8220;OTHER&#8221;.</li>\n<li>Fix           &#8211; Added compatibility functions to make PaysonCheckout 2.0 compatible with WooCommerce 3.0.</li>\n</ul>\n<h4>2017.04.06  &#8211; version 1.1.3</h4>\n<ul>\n<li>Fix           &#8211; WC 3.0 fix. Order lines sent to Payson now fetched from cart instead of local order.</li>\n<li>Fix           &#8211; Improved calculate_totals.</li>\n</ul>\n<h4>2017.03.05  &#8211; version 1.1.2</h4>\n<ul>\n<li>Fix           &#8211; Display PaysonCheckout iframe when switch to Payson in checkout (if not having Payson as default payment method).</li>\n</ul>\n<h4>2017.03.01  &#8211; version 1.1.1</h4>\n<ul>\n<li>Tweak         &#8211; Updating Paysons SDK (version from 2016-11-02).</li>\n<li>Tweak         &#8211; Adds product variations to product name sent to Payson.</li>\n<li>Tweak         &#8211; Improved multi currency support.</li>\n<li>Fix           &#8211; Create a new Payson checkout ID if the store currency has been changed when updating order/cart.</li>\n<li>Fix           &#8211; JS fix to prevent double calls to Payson on initial loading of checkout page.</li>\n</ul>\n<h4>2017.01.17    &#8211; version 1.1</h4>\n<ul>\n<li>Tweak         &#8211; Only show available shipping countries (defined in WC settings) in PaysonCheckout country selector.</li>\n<li>Tweak         &#8211; Change order status to Processing already from info received in thank you page. Helpful for stores where Payson server-to-server callbacks are being blocked.</li>\n<li>Tweak         &#8211; Swedish translation update.</li>\n</ul>\n<h4>2016.12.01  &#8211; version 1.0.1</h4>\n<ul>\n<li>Tweak         &#8211; Adds compatibility with Sequential Order Numbers and Sequential Order Numbers Pro.</li>\n<li>Fix           &#8211; Fixes order statuses issue in callback handler from Payson.</li>\n<li>Fix           &#8211; Fixes no PaysonCheckout resource update on shipping option change in checkout page.</li>\n</ul>\n<h4>2016.11.29  &#8211; version 1.0</h4>\n<ul>\n<li>Tweak         &#8211; Not WooCommerce order is created only when PaysonCheckout iframe is initialized.</li>\n<li>Tweak         &#8211; Improved checkout page UI when PaysonCheckout is the selected option.</li>\n</ul>\n<h4>2016.10.24  &#8211; version 0.8.5</h4>\n<ul>\n<li>Tweak         &#8211; Added support for Flatsome 3.x. No need for specific markup for Flatsome anymore.</li>\n<li>Tweak         &#8211; Removed duplicate code.</li>\n<li>Fix           &#8211; Fixed issue with new order emails not being sent (if PaysonEmbeddedAddressChanged js-event wasn&#8217;t triggered).</li>\n<li>Fix           &#8211; Fixed missing quote in inline CSS.</li>\n</ul>\n<h4>2016.09.23  &#8211; version 0.8.4</h4>\n<ul>\n<li>Tweak         &#8211; Added Payson logo to payment method display in checkout.</li>\n<li>Tweak         &#8211; Changed naming of Merchant ID to Agent ID in settings.</li>\n<li>Tweak         &#8211; Added Swedish translation file.</li>\n<li>Tweak         &#8211; Added default payment gateway description in settings.</li>\n</ul>\n<h4>2016.09.14  &#8211; version 0.8.3</h4>\n<ul>\n<li>Tweak         &#8211; Changes orderstatus from Payson Incomplete to Pending on Address Changed JS callback from Payson.</li>\n<li>Tweak         &#8211; Adds customer address to local order on Address Changed JS callback from Payson.</li>\n<li>Fix           &#8211; Fixed issue with new order emails not being sent.</li>\n</ul>\n<h4>2016.09.08  &#8211; version 0.8.2</h4>\n<ul>\n<li>Fix           &#8211; Fixed PHP error in check_terms() function caused when using PHP 5.5 and older.</li>\n</ul>\n<h4>2016.09.06  &#8211; version 0.8.1</h4>\n<ul>\n<li>Tweak         &#8211; Hide WooCommerce billing and shipping fields on loading of checkout page if PaysonCheckout is the selected payment method.</li>\n<li>Fix           &#8211; Prevent checkout iframe to reload/update directly on page load.</li>\n<li>Fix           &#8211; Prevent checkout iframe to update on scroll on mobile devices (triggered by resize js event).</li>\n</ul>\n<h4>2016.08.31  &#8211; version 0.8</h4>\n<ul>\n<li>Fix           &#8211; Fixing wrong url in include_once, caused PHP warnings.</li>\n</ul>\n<h4>2016.08.31  &#8211; version 0.7</h4>\n<ul>\n<li>Tweak         &#8211; Small code refactoring.</li>\n<li>Fix           &#8211; Fixes issue to be able to see orders with parson-incomplete order status in shop order list.</li>\n</ul>\n<h4>2016.08.30  &#8211; version 0.6</h4>\n<ul>\n<li>Feature       &#8211; Added setting for enable/disable request phone number in checkout.</li>\n<li>Misc          &#8211; First release on wordpress.org.</li>\n</ul>\n<h4>2016.08.24  &#8211; version 0.5</h4>\n<ul>\n<li>Tweak         &#8211; Added admin notices to inform merchant about possible misconfigurations in Payson settings.</li>\n<li>Tweak         &#8211; Change css class names for the divs that is hidden/displayed when Payson is the selected payment method in checkout.</li>\n</ul>\n<h4>2016.08.22  &#8211; version 0.4</h4>\n<ul>\n<li>Fix           &#8211; Allow free products in order sent to PaysonCheckout (caused fatal error).</li>\n</ul>\n<h4>2016.08.17  &#8211; version 0.3</h4>\n<ul>\n<li>Feature       &#8211; Added Cancel reservation in Payson directly from WooCommerce.</li>\n<li>Feature       &#8211; Added Capture transaction in Payson directly from WooCommerce.</li>\n<li>Tweak         &#8211; Improved try/catch when connecting to Payson.</li>\n<li>Tweak         &#8211; Store Payson checkout id as a separate post meta instead of the order transaction number.</li>\n<li>Tweak         &#8211; Updated Payson SDK to latest version.</li>\n<li>Fix           &#8211; Unset all created sessions on successful payment.</li>\n</ul>\n<h4>2016.08.02  &#8211; version 0.2</h4>\n<ul>\n<li>Tweak         &#8211; Improved display of the Payson iframe in checkout pages with a two column layout.</li>\n<li>Tweak         &#8211; Added Payson order status readyToShip as post meta to orders on payment_complete().</li>\n</ul>\n"
    },
    "short_description": "PaysonCheckout for WooCommerce is a plugin that extends WooCommerce, allowing you to take payments via Payson.",
    "description": "<ul>\n<li>All payment methods with one contract</li>\n<li>No fixed fees, get started within 24 hours</li>\n<li>The customer never leaves your e-commerce store</li>\n</ul>\n<p>In PaysonCheckout Payson has removed all unnecessary steps in the checkout to increase conversions and sales. The payment window is nicely integrated into your e-store where customers can pay with a single click! All purchases are based on the service Invoice via email. The customer can then choose to get the goods delivered first and pay retrospectively or pay the invoice immediately upon purchase, for example by card, online bank payment or SMS.</p>\n<p>To get started with Payson you need to <a href=\"https://www.payson.se/sv/\" rel=\"nofollow ugc\">sign up</a> for a Business account.</p>\n<p>More information on how to get started can be found in the <a href=\"http://docs.krokedil.com/se/documentation/paysoncheckout-2-0-woocommerce/\" rel=\"nofollow ugc\">plugin documentation</a>.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "e-commerce": "e-commerce",
        "ecommerce": "ecommerce",
        "payson": "payson",
        "paysoncheckout2-0": "paysoncheckout2.0",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "trunk",
    "versions": {
        "0.6": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.0.6.zip",
        "0.7": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.0.7.zip",
        "0.8": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.0.8.zip",
        "0.8.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.0.8.1.zip",
        "0.8.2": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.0.8.2.zip",
        "0.8.3": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.0.8.3.zip",
        "0.8.4": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.0.8.4.zip",
        "0.8.5": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.0.8.5.zip",
        "1.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.0.1.zip",
        "1.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.1.zip",
        "1.1.10": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.10.zip",
        "1.1.11": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.11.zip",
        "1.1.12": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.12.zip",
        "1.1.13": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.13.zip",
        "1.1.14": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.14.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.8.zip",
        "1.1.9": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.1.9.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.2.3.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.3.1.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.1.4.0.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.2.0.3.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.2.1.1.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.2.2.1.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.2.3.0.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.2.3.1.zip",
        "2.3.2": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.2.3.2.zip",
        "2.3.3": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.2.3.3.zip",
        "2.3.4": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.2.3.4.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.0.1.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.0.4.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.2.1.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.2.2.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.2.3.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.3.0.zip",
        "3.4.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.4.0.zip",
        "3.4.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.4.1.zip",
        "3.4.2": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.4.2.zip",
        "3.4.3": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.4.3.zip",
        "3.4.4": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.4.4.zip",
        "3.5.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.5.0.zip",
        "3.5.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.5.1.zip",
        "3.6.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.6.0.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.6.1.zip",
        "3.7.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.7.0.zip",
        "3.7.1": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.7.1.zip",
        "3.8.0": "https://downloads.wordpress.org/plugin/krokedil-paysoncheckout-20-for-woocommerce.3.8.0.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/krokedil-paysoncheckout-20-for-woocommerce/assets/banner-772x250.png?rev=2959202",
        "high": "https://ps.w.org/krokedil-paysoncheckout-20-for-woocommerce/assets/banner-1544x500.png?rev=2959202"
    },
    "icons": {
        "1x": "https://ps.w.org/krokedil-paysoncheckout-20-for-woocommerce/assets/icon-128x128.png?rev=2959202",
        "2x": "https://ps.w.org/krokedil-paysoncheckout-20-for-woocommerce/assets/icon-256x256.png?rev=2959202"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 80,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}