{
    "name": "Active Directory Integration / LDAP Integration",
    "slug": "ldap-login-for-intranet-sites",
    "version": "5.1.3",
    "author": "<a href=\"https://miniorange.com\">miniOrange</a>",
    "author_profile": "https://profiles.wordpress.org/cyberlord92/",
    "contributors": {
        "miniorange": {
            "profile": "https://profiles.wordpress.org/miniorange/",
            "avatar": "https://secure.gravatar.com/avatar/b76018c6531a7fb0c25caa52bd19ea34?s=96&d=monsterid&r=g",
            "display_name": "miniorange"
        }
    },
    "requires": "5.0",
    "tested": "6.6.1",
    "requires_php": "5.2.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 174,
        "4": 1,
        "3": 0,
        "2": 2,
        "1": 2
    },
    "num_ratings": 179,
    "support_url": "https://wordpress.org/support/plugin/ldap-login-for-intranet-sites/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 5000,
    "downloaded": 269865,
    "last_updated": "2024-08-12 12:03pm GMT",
    "added": "2015-08-06",
    "homepage": "https://miniorange.com",
    "sections": {
        "description": "<p><a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites#Features\" rel=\"nofollow ugc\">Features</a> | <a href=\"https://plugins.miniorange.com/step-by-step-guide-for-wordpress-ldap-login-plugin\" rel=\"nofollow ugc\">Setup Guide</a> | <a href=\"https://plugins.miniorange.com/wordpress-ldap-setup-guides\" rel=\"nofollow ugc\">Documentation</a> | <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites#Add-Ons\" rel=\"nofollow ugc\">Integrations</a> | <a href=\"https://www.miniorange.com/contact\" rel=\"nofollow ugc\">Contact Us</a></p>\n<p><a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites\" rel=\"nofollow ugc\">Active Directory Integration / LDAP Integration Login for Intranet Sites plugin</a> allows you to authenticate your users using their Active Directory/LDAP credentials into your WordPress site. It allows you to map the Active Directory/LDAP attributes to the WordPress user profile attributes and also lets you assign WordPress roles to your LDAP/Active Directory users. Additionally, the plugin has a user authentication report feature, which logs each unsuccessful Active Directory/LDAP authentication request made, providing additional security functionalities.</p>\n<p>This plugin allows users to authenticate against various Active Directory /other LDAP Servers like:</p>\n<ul>\n<li>Microsoft Active Directory</li>\n<li>Azure Active Directory</li>\n<li>Sun Active Directory</li>\n<li>OpenLDAP Directory</li>\n<li>JumpCloud</li>\n<li>FreeIPA Directory</li>\n<li>Synology</li>\n<li>OpenDS and other LDAP directories.</li>\n</ul>\n<p>The LDAP/Active Directory Login (AD Login) for Intranet plugin includes user management features as well, such as adding users from Active Directory or another LDAP Directory who are not registered in WordPress, WordPress role mapping, LDAP/Active Directory to WordPress attribute mapping, and more. We also provide additional add-ons that enhance the functionality of the basic plugin such as enabling <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites#LDAP-intranet-add-ons\" rel=\"nofollow ugc\">Kerberos/NTLM SSO Authentication</a>, importing users from Active Directory/LDAP Server to WordPress, creating users in Active Directory/LDAP server when created/registered in the WordPress site, sync users between the Active Directory/LDAP server and WordPress site, sync LDAP/Active Directory Profile Picture thumbnail attribute to WordPress user profile picture, AD integration with third-party plugins and more.</p>\n<h4>Minimum Requirements</h4>\n<ul>\n<li>Compatible with WordPress version 5.0 or higher</li>\n<li>Compatible with PHP version 5.2.0 or higher</li>\n<li><a href=\"https://faq.miniorange.com/knowledgebase/how-to-enable-php-ldap-extension\" rel=\"nofollow ugc\">PHP LDAP extension Enabled</a></li>\n</ul>\n<p><strong>Get a quick overview of our product</strong></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/VdAIDLCN-cQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h4>Free Version Features:-</h4>\n<ul>\n<li>Perform LDAP Authentication for any user trying to log into the WordPress website whose Active Directory/LDAP credentials are stored in the Active Directory/LDAP server. Additionally, logging in with WordPress credentials is also supported.</li>\n<li>Upon authentication, keep the WordPress User&#8217;s profile information in sync with the Active Directory/other LDAP Directories.</li>\n<li>Automatic User Registration in WordPress: Automatically create WordPress users who are present in the LDAP server/Active Directory upon login.</li>\n<li>Role Mapping: You can select a default WordPress role and assign it to all the Active Directory/LDAP users while LDAP/AD login is performed.</li>\n<li>Attribute mapping: Map the LDAP/Active Directory mail attribute to the WordPress user email and sync upon every successful LDAP/Active Directory Login (AD Login).</li>\n<li><a href=\"https://www.miniorange.com/guide-to-setup-ldaps-on-windows-server\" rel=\"nofollow ugc\">LDAPS (LDAP Secure Connection) support</a>: Supports establishing Secure Connection between the WordPress site and Active Directory/LDAP server via LDAPS protocol, this ensures protection against credential theft.</li>\n<li>Authentication Report: Keep logs of all the Active Directory/LDAP users who try to authenticate on your WordPress website and fail. A lot of the time these are security risks. The LDAP User Authentication report will give you a list of these users, you can also export a CSV of this report.</li>\n<li>Automatic fetching of LDAP Organizational Units from LDAP Server/Active Directory while configuring Search Base for LDAP/AD Login.</li>\n<li>Test connection to your Active Directory/other LDAP Directory while configuring LDAP server information in the plugin.</li>\n<li>Test authentication using credentials stored in your Active Directory/other LDAP Directory after configuring LDAP server information in the plugin.</li>\n<li>Ability to test against demo Active Directory/other LDAP Directory and demo credentials. You can do this using the demo LDAP Directory credentials from <a href=\"https://www.forumsys.com/2022/05/10/online-ldap-test-server/\" rel=\"nofollow ugc\">here</a>.</li>\n<li>Support Integration with hybrid Active Directory infrastructure.</li>\n<li>Compatible with the latest versions of WordPress and PHP.</li>\n<li>We provide extensive easy-to-understand <a href=\"https://plugins.miniorange.com/wordpress-ldap-setup-guides\" rel=\"nofollow ugc\">documentation</a> as well as <a href=\"https://www.youtube.com/playlist?list=PL2vweZ-PcNpd3lEzmiLZwL_cAG_Evg2QC\" rel=\"nofollow ugc\">YouTube setup videos</a> which will assist you while configuring our LDAP Active Directory plugin.</li>\n</ul>\n<p><strong>You can find out how to configure the Active Directory Integration / LDAP Integration plugin through the video below</strong></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/5DUGgP-Hf-k?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>This LDAP/Active Directory Login (AD Login) plugin is free to use under the MIT/Expat license. If you wish to use enhanced features, you may purchase our <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites\" rel=\"nofollow ugc\">Premium version</a>. We also provide additional <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites#LDAP-intranet-add-ons\" rel=\"nofollow ugc\">add-ons</a> that enhance the functionality of the basic WordPress LDAP/AD Login plugin. This will help support further development of our LDAP plugin, and in turn, serve our customers better.</p>\n<p>= <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites\" rel=\"nofollow ugc\">Premium Version Features</a>=</p>\n<ul>\n<li>Our premium plugin comes with additional features along with the aforementioned Free Plugin Features. </li>\n<li><strong>Login With Any LDAP Attribute Of Your Choice:</strong> Authenticate users against multiple LDAP/Active Directory username attributes like sAMAccountName, UID, UserPrincipalName, mail, cn, or any other custom LDAP attribute(s) according to your LDAP Active Directory/any other LDAP directory.</li>\n<li><strong>Auto-register of LDAP users in WordPress site:</strong> Allows users of Active Directory/other LDAP Directory to auto-register in WordPress.</li>\n<li><strong>Advanced Role Mapping:</strong> Assign specific WordPress roles based on the LDAP/Active Directory group memberships or the Organizational Units that are set in the LDAP Server/Active Directory. You can also assign a default WordPress role to all the LDAP/Active Directory users.</li>\n<li><strong>Fetch LDAP groups automatically for Role Mapping:</strong> Fetches the LDAP/AD Security Groups present in your Active Directory/other LDAP Directory.</li>\n<li><strong>Attribute Mapping:</strong> Configure and fetch the LDAP/AD attributes such as UID, cn (common name), mail, telephoneNumber, givenName, sn, sAMAccountName, and map with WordPress user profile attributes upon LDAP/AD Login (Active Directory Login).</li>\n<li><strong>Custom Attribute Mapping:</strong> You can create your own WordPress custom user profile attributes which is a nifty tool if your organization has various attributes present in the Active Directory/LDAP server.</li>\n<li><strong>Custom Search Filter:</strong> Allows you to restrict user authentication on the basis of LDAP/Active Directory security groups, userAccountControl etc.</li>\n<li><strong>Authenticate Users from Multiple LDAP Search Bases:</strong> Authenticate users against multiple search bases from your Active Directory/other LDAP Directory.</li>\n<li><strong>Automatic LDAP/Active Directory Users Search Base Selection:</strong> Fetches and allows you to select the Organization Unit (OU) present in your Active Directory/other LDAP Directory for the user&#8217;s search base.</li>\n<li><strong>Multiple LDAP Directories Configuration:</strong> Perform LDAP/Active Directory authentication against multiple directories through sequential search or on the basis of domain membership.</li>\n<li><strong>WordPress to LDAP User Profile Sync:</strong> Update/Sync the user profile in Active Directory/other LDAP Directory when updated from WordPress.</li>\n<li><strong>Authenticate users from LDAP and WordPress:</strong> Enable all WordPress users or WordPress administrators to login even if they are not present in the LDAP/Active Directory.</li>\n<li><strong>Redirect to Custom URL after Authentication:</strong> Redirect to WordPress Profile page/ Home page/ Custom URL after successful LDAP/Active Directory authentication.</li>\n<li><strong>Detailed User Authentication Report:</strong>  Keep track of user&#8217;s authentication requests for your WordPress site. Get detailed logging information for FAILED LDAP Authentication of individual users.</li>\n<li><strong>Support for Import/Export Plugin Configuration:</strong> Export your LDAP plugin configuration from the staging/testing site and import it to the production/live site. This will save you the hassle of reconfiguring the LDAP plugin.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-multisite-ldap-ad-plugin\" rel=\"nofollow ugc\">Multisite Support</a>:</strong> The plugin supports LDAP/AD Login integration for multisite environments as well.</li>\n<li><strong>Restrict login based on WordPress roles:</strong> Restrict LDAP/Active Directory login (AD Login) to certain users based on the roles which are assigned on WordPress.</li>\n<li>Provides seamless integration with <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites#LDAP-intranet-add-ons\" rel=\"nofollow ugc\">third-party plugins</a> such as BuddyBoss, BuddyPress, Ultimate Member, Gravity forms, Groups, and eMember.</li>\n</ul>\n<p><strong>You can find out Active Directory Integration / LDAP Integration Premium Version Features through the video below</strong></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/r0pnB2d0QP8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>= <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites#LDAP-intranet-add-ons\" rel=\"nofollow ugc\">Add-ons List</a>=</p>\n<ul>\n<li><strong><a href=\"//plugins.miniorange.com/guide-to-setup-kerberos-single-sign-sso)\" rel=\"nofollow ugc\">Active Directory Single Sign-On (SSO) using Kerberos/NTLM</a>:</strong> Enable Active Directory SSO (auto-login) on your WordPress site for Domain Joined Machines using Kerberos/NTLM SSO protocol. This supports Kerberos SSO authentication for Linux with Apache server, Windows authentication on IIS server, Windows with Apache server, etc. We also support Active Directory SSO solutions using the GSSAPI module as well.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-configure-miniorange-directory-sync-add-on-for-wordpress\" rel=\"nofollow ugc\">Sync Users LDAP Directory</a>:</strong> Sync/Import WordPress users from Active Directory/other LDAP directory. Schedules can be configured for the synchronization to run at a specific time and after a specific time interval. Additionally, you can also enable WordPress to LDAP/Active Directory user sync which would enable you to update/create an LDAP/AD user&#8217;s profile.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-miniorange-ldap-buddypress-integration-add-on\" rel=\"nofollow ugc\">Sync BuddyPress Extended Profiles</a>:</strong> Update the BuddyPress users extended profiles with Active Directory/LDAP Server attributes upon LDAP/AD login (Active Directory Login).</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-password-sync-with-ldap-add-on\" rel=\"nofollow ugc\">Password Sync with Active Directory/LDAP Directory</a>:</strong> Update your Active Directory/other LDAP Directory user password, the WordPress password of LDAP users will be synced to the LDAP server when you update or reset it in WordPress.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/configure-miniorange-profile-picture-map-add-on-for-wordpress\" rel=\"nofollow ugc\">Profile Picture Sync for WordPress and BuddyPress</a>:</strong> Update your WordPress and BuddyPress profile picture with thumbnail photos stored in your Active Directory/other LDAP Directory or vice-versa.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-ultimate-member-login-integration-with-ldap-credentials\" rel=\"nofollow ugc\">Ultimate Member Login and Profile Integration</a>:</strong> Enable LDAP/AD Login for Ultimate Member Login form and map Active Directory / other LDAP Directory User Profile attributes with ultimate member profile page.</li>\n<li><strong>Page/Post Restriction:</strong> This allows you to control access to your site&#8217;s content (pages/posts) based on LDAP groups/WordPress roles.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-miniorange-ldap-search-widget-add-on\" rel=\"nofollow ugc\">Search Staff From Active Directory/other LDAP Directory</a>:</strong> Search and display your Active Directory/other LDAP Directory users on your website page using a search widget and shortcode.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-third-party-user-profile-integration-with-ldap-add-on\" rel=\"nofollow ugc\">Third-Party Plugin User Profile Integration</a>:</strong> Update user profiles created using any third-party plugin with information from your Active Directory/other LDAP Directory stored in WordPress user meta table.</li>\n<li><strong>Gravity Forms Integration:</strong> Populate Gravity Form fields with information from Active Directory / other LDAP Directory. You can do AD integration with unlimited forms.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-miniorange-ldap-buddypress-integration-add-on\" rel=\"nofollow ugc\">Sync BuddyPress Groups</a>:</strong> Assign BuddyPress groups to users based on LDAP/AD group membership in Active Directory / other LDAP Directory.</li>\n<li><strong>MemberPress Plugin Integration:</strong> Login to MemberPress-protected content with Active Directory / other LDAP Directory Credentials.</li>\n<li><strong>eMember Plugin Integration:</strong> Login to eMember profiles with Active Directory / other LDAP Directory Credentials.</li>\n<li><strong>WP Groups Plugin Integration:</strong> Assign users to WordPress groups created using the Groups plugin based on their LDAP/AD groups memberships present in the Active Directory / LDAP Server. You can map any number of Active Directory groups with WordPress groups.</li>\n<li>With authentication being one of the essential functions of the day, a fast and <strong><a href=\"https://www.miniorange.com/support-plans\" rel=\"nofollow ugc\">priority support</a></strong> (provided in paid versions) ensure that any issues you face on a live production site can be resolved in a timely manner.</li>\n<li><strong>Regular updates</strong> to the premium plugin compatible with the latest WordPress version. The updates include security and bug fixes. These updates <strong>ensure that you are updated with the latest security fixes</strong>.</li>\n<li>Ensure timely updates for <strong>new WordPress/PHP releases</strong> with our premium plugins and compatibility updates to make sure you have adequate support for smooth transitions to new versions of WordPress and PHP.</li>\n<li><strong>Reasonably priced</strong> with various plans tailored to suit your needs.</li>\n<li><strong>Easy to setup</strong> with lots of support and documentation to assist with the setup.</li>\n<li>High level of <strong>customization</strong> and <strong>add-ons</strong> to support specific requirements.</li>\n</ul>\n<h4>Other Use-Cases we support:-</h4>\n<ul>\n<li><strong><a href=\"https://plugins.miniorange.com/wordpress-ldap-login-cloud\" rel=\"nofollow ugc\">miniOrange Active Directory/LDAP Integration for Cloud &amp; Shared Hosting Platforms Plugin</a></strong> supports login to WordPress sites hosted on a shared hosting platform using credentials stored in active directory and LDAP Directory systems in case you are not able to enable <strong><a href=\"https://faq.miniorange.com/knowledgebase/how-to-enable-php-ldap-extension/\" rel=\"nofollow ugc\">LDAP Extension</a></strong> on your site.</li>\n<li><strong> <a href=\"https://plugins.miniorange.com/wordpress-ldap-directory-search\" rel=\"nofollow ugc\">Search Staff/Employee present in your Active Directory</a></strong>: allows you to search and display the users present in your Active Directory / LDAP Server on a WordPress page using a shortcode.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/wordpress-login-and-user-management-plugin\" rel=\"nofollow ugc\">WordPress Login and User Management Plugin</a></strong>: This plugin offers several functionalities, including bulk user management, user redirection based on WordPress roles, user session management, auto-logout users, and the ability to make a page or post private or public based on an ID or URL.</li>\n<li>miniOrange also supports <strong><a href=\"https://www.miniorange.com/solutions/vpn-mfa-multi-factor-authentication\" rel=\"nofollow ugc\">VPN use cases</a></strong> Log in to your VPN client using Active Directory /other LDAP Directory credentials and <strong><a href=\"https://www.miniorange.com/products/multi-factor-authentication-mfa\" rel=\"nofollow ugc\">Multi-Factor Authentication</a></strong>.</li>\n<li>miniOrange supports <strong><a href=\"https://apisecurity.miniorange.com\" rel=\"nofollow ugc\">API Security use cases</a></strong> to protect and secure your APIs using our product <strong><a href=\"https://apiconsole.miniorange.com\" rel=\"nofollow ugc\">XecureAPI</a></strong> which helps you to enable Authentication methods ( like OAuth, SAML, LDAP, API Key Authentication, JWT Authentication etc ), Rate Limiting, IP restriction and much more on your APIs for complete protection.</li>\n<li>miniOrange supports <strong><a href=\"https://www.miniorange.com/products/single-sign-on-sso\" rel=\"nofollow ugc\">Single-Sign-On (SSO)</a></strong> into a plethora of applications and supports various protocols like(<strong><a href=\"https://blog.miniorange.com/radius-server-authentication/\" rel=\"nofollow ugc\">RADIUS</a>, <a href=\"https://plugins.miniorange.com/wordpress-single-sign-on-sso\" rel=\"nofollow ugc\">SAML</a>, <a href=\"https://plugins.miniorange.com/wordpress-sso\" rel=\"nofollow ugc\">OAuth</a>, <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites\" rel=\"nofollow ugc\">LDAP/LDAPS</a></strong>, using various IDP&#8217;s like <strong>Azure Active Directory, Microsoft On-Premise Active Directory, Octa, ADFS</strong>, etc.</li>\n<li>Contact us at info@xecurify.com to know more.</li>\n</ul>\n<h4>Need support?</h4>\n<p>Please email us at info@xecurify.com or <a href=\"https://xecurify.com/contact\" rel=\"nofollow ugc\">Contact us</a>.</p>\n",
        "installation": "<h4>Prerequisites</h4>\n<p>Active Directory Integration/LDAP Integration requires a few prerequisites before you can enable LDAP login for your WordPress sites.</p>\n<p>I. Active Directory Integration/LDAP Integration requires a few <code>PHP Modules</code> to be enabled. Make sure these are enabled.</p>\n<ol>\n<li>\n<p><strong>PHP LDAP Module</strong>:<br />\nStep-1: Open the php.ini file.<br />\nStep-2: Search for &#8220;extension=php_ldap.dll&#8221; in the php.ini file. Uncomment this line, if not present then add this line to the file and save the file.</p>\n</li>\n<li>\n<p><strong>OPENSSL Module</strong>:<br />\nStep-1: Open the php.ini file.<br />\nStep-2: Search for &#8220;extension=php_openssl.dll&#8221; in the php.ini file. Uncomment this line, if not present then add this line to the file and save the file.</p>\n</li>\n</ol>\n<p>II. To install Active Directory Integration/LDAP Integration the minimum requirements are:<br />\n1. <strong>WordPress version 5.0</strong><br />\n2. <strong>PHP version 5.2.0</strong></p>\n<h4>From your WordPress dashboard</h4>\n<ol>\n<li>Visit <code>Plugins &gt; Add New</code>.</li>\n<li>Search for <code>Active Directory Integration for Intranet Sites</code>. Find and Install <code>Active Directory Integration for Intranet Sites</code>.</li>\n<li>Activate the plugin from your Plugins page.</li>\n</ol>\n<h4>From WordPress.org</h4>\n<ol>\n<li>Download Active Directory Integration for Intranet Sites.</li>\n<li>Unzip and upload the <code>ldap-login-for-intranet-sites</code> directory to your <code>/wp-content/plugins/</code> directory.</li>\n<li>Activate Active Directory Integration for Intranet Sites from your Plugins page.</li>\n</ol>\n<h4>Once Activated</h4>\n<ol>\n<li>Go to <code>Settings-&gt; LDAP Login Config</code>, and follow the instructions.</li>\n<li>Click on <code>Save</code>.</li>\n</ol>\n<p>Make sure that if there is a firewall, you <code>OPEN THE FIREWALL</code> to allow incoming requests to your LDAP from your WordPress Server IP and open port 389 (636 for SSL or LDAPS).</p>\n",
        "faq": "<p>Click <a href=\"https://faq.miniorange.com/kb/ldap-authentication/\" rel=\"nofollow ugc\">here</a> to view our FAQ page.</p>\n<p>For support or troubleshooting help please email us at info@xecurify.com or <a href=\"https://miniorange.com/contact\" rel=\"nofollow ugc\">Contact us</a>.</p>\n",
        "changelog": "<h4>5.1.3</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability Improvements</li>\n<li>Readme changes</li>\n</ul>\n</li>\n</ul>\n<h4>5.1.2</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Improvements</li>\n<li>Compatibility with WordPress 6.6</li>\n</ul>\n</li>\n</ul>\n<h4>5.1.1</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>5.1.0</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Enhanced the Plugin&#8217;s User Interface.</li>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>5.0.6</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Improvements</li>\n</ul>\n</li>\n</ul>\n<h4>5.0.5</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Improvements</li>\n<li>Compatibility with WordPress 6.5</li>\n</ul>\n</li>\n</ul>\n<h4>5.0.4</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Changes in Login Settings</li>\n<li>Code Optimization</li>\n</ul>\n</li>\n</ul>\n<h4>5.0.3</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Improvements and usability fixes.</li>\n</ul>\n</li>\n</ul>\n<h4>5.0.2</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability fixes</li>\n</ul>\n</li>\n</ul>\n<h4>5.0.1</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Code Improvement</li>\n<li>Readme changes</li>\n</ul>\n</li>\n</ul>\n<h4>5.0.0</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Code Restructuring and Optimization.</li>\n<li>Revamped the User Interface to provide a user-friendly experience.</li>\n<li>Added step-by-step approach to simplify LDAP configuration.</li>\n<li>Enhanced User Reports for better usability.</li>\n</ul>\n</li>\n</ul>\n<h4>4.2.2</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Compatibility with WordPress 6.4</li>\n</ul>\n</li>\n</ul>\n<h4>4.2.1</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>4.2</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Enhanced security measures to prevent LDAP Passback Vulnerability.</li>\n</ul>\n</li>\n</ul>\n<h4>4.1.11</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>4.1.10</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Security Fixes.</li>\n</ul>\n</li>\n</ul>\n<h4>4.1.9</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>4.1.8</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Improvements in Error Messages.</li>\n<li>Compatibility with WordPress version 6.3.</li>\n</ul>\n</li>\n</ul>\n<h4>4.1.7</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>4.1.6</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Vulnerability Fixes.</li>\n</ul>\n</li>\n</ul>\n<h4>4.1.5</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Security Fixes.</li>\n<li>Code Optimization.</li>\n</ul>\n</li>\n</ul>\n<h4>4.1.4</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Removed Plugin Tour.</li>\n</ul>\n</li>\n</ul>\n<h4>4.1.3</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Compatibility with WordPress version 6.2.</li>\n</ul>\n</li>\n</ul>\n<h4>4.1.2</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability Improvements.</li>\n<li>UI Enhancement.</li>\n</ul>\n</li>\n</ul>\n<h4>4.1.1</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Vulnerability Fixes.</li>\n<li>Readme update.</li>\n</ul>\n</li>\n</ul>\n<h4>4.1.0</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>WP Guideline &amp; Security Fixes.</li>\n<li>Code Optimization.</li>\n</ul>\n</li>\n</ul>\n<h4>4.0.8</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Advertisement of Christmas Offers.</li>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>4.0.7</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Updated Licensing Plans.</li>\n<li>Compatibility with PHP 8.1.</li>\n</ul>\n</li>\n</ul>\n<h4>4.0.6</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Compatibility with WordPress 6.1.</li>\n<li>Minor UI fixes.</li>\n</ul>\n</li>\n</ul>\n<h4>4.0.5</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Compatibility fixes.</li>\n</ul>\n</li>\n</ul>\n<h4>4.0.4</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Improvement.</li>\n<li>Updated setup video and guide for configuration of the Plugin.</li>\n<li>Improved Account Registration form.</li>\n</ul>\n</li>\n</ul>\n<h4>4.0.3</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Improvements.</li>\n<li>Added new FAQ&#8217;s.</li>\n</ul>\n</li>\n</ul>\n<h4>4.0.2</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability Improvements.</li>\n<li>UI Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>4.0.1</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Improvements.</li>\n<li>Usability Improvements</li>\n</ul>\n</li>\n</ul>\n<h4>4.0</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Improvements.</li>\n<li>Improved visibility of Error and Success messages.</li>\n</ul>\n</li>\n</ul>\n<h4>3.7.7</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>UI Enhancement.</li>\n<li>Vulnerabilities Fixes &amp; Security Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.7.6</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Introduced new licensing plans.</li>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.7.5</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Compatibility with WordPress 6.0.</li>\n<li>Authentication report bug fixes.</li>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.7.4</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Compatibility with WordPress 5.9.3.</li>\n<li>Added a new FAQ.</li>\n<li>Added a new feature to set multiple roles and persist existing roles for the user.</li>\n</ul>\n</li>\n</ul>\n<h4>3.7.3</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Compatibility with WordPress 5.9.2.</li>\n<li>Added Export User Authentication Reports to the CSV file feature.</li>\n<li>Custom email domain feature for Users email.</li>\n</ul>\n</li>\n</ul>\n<h4>3.7.2</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Bug fixes for empty email field in username attribute</li>\n<li>Code optimization</li>\n<li>Usability Improvements</li>\n</ul>\n</li>\n</ul>\n<h4>3.7.1</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Compatibility with WordPress 5.9.</li>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.7</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.99</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>New Year Offers.</li>\n<li>Bug fix in default email domain mapping.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.98</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Christmas Offers &amp; Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.97</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability &amp; Security Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.96</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Vulnerabilities Fixes &amp; Security Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.95</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Bug Fixes &#8211; Sanitization of input fields.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.94</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability Improvements.</li>\n<li>Added option to set user&#8217;s email to username@email_domain in WordPress, if the &#8220;mail&#8221; attribute is not set in LDAP directory.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.93</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.92</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.91</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.9</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Compatible with WordPress 5.8.</li>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.8</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Integrated a support form for scheduling a call for assistance.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.7</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Bug Fix for auto registration of LDAP user.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.6</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Added new add-ons to integrate with third party plugins.</li>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.5</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability Improvements.</li>\n<li>Default Role Mapping feature.</li>\n<li>Assign default WordPress role for all users after login.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.4</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.3</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Tested for WordPress 5.7.</li>\n<li>Compatibility Fixes for PHP 8.0.</li>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.2</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6.1</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Usability Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.6</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Added setup guides and videos for premium add-ons.</li>\n<li>Compatible with WordPress 5.6</li>\n</ul>\n</li>\n</ul>\n<h4>3.5.93</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Added dropdown to select Directory Server Type.</li>\n<li>Improvements in &#8220;Premium Plugin Trial Request&#8221; feature.</li>\n<li>Usability Improvemnts in Licensing Page.</li>\n</ul>\n</li>\n</ul>\n<h4>3.5.92</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Improvements for possible Base DNs from Active Directory.</li>\n<li>Plugin tour fixes and usability improvements.</li>\n<li>Added &#8220;Premium Plugin Trial Request&#8221; feature.</li>\n</ul>\n</li>\n</ul>\n<h4>3.5.91</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Compatibility with WordPress 5.5.</li>\n<li>Usability improvements and fixes</li>\n<li>fetch users DN from Active Directory.</li>\n</ul>\n</li>\n</ul>\n<h4>3.5.9</h4>\n<ul>\n<li>Active Directory Integration : Usability improvements for Active Directory Integration</li>\n</ul>\n<h4>3.5.85</h4>\n<ul>\n<li>Active Directory Integration : Usability improvement to fetch list of possible Base DNs from Active Directory</li>\n</ul>\n<h4>3.5.8</h4>\n<ul>\n<li>Active Directory Integration : Usability improvements.</li>\n</ul>\n<h4>3.5.7</h4>\n<ul>\n<li>Active Directory Integration : Usability improvements and bug fixes.</li>\n</ul>\n<h4>3.5.6</h4>\n<ul>\n<li>Active Directory Integration : Compatibility with 5.4.2, Usability improvements for search attribute.</li>\n</ul>\n<h4>3.5.5</h4>\n<ul>\n<li>Active Directory Integration : Usability changes and fix for fetching email address at login time.</li>\n</ul>\n<h4>3.5.4</h4>\n<ul>\n<li>Active Directory Integration : PHP 7.4 and WordPress 5.4 compatibility</li>\n</ul>\n<h4>3.5.3</h4>\n<ul>\n<li>Active Directory Integration : Compatibility fixes</li>\n</ul>\n<h4>3.5.2</h4>\n<ul>\n<li>Active Directory Integration : Fixes\n<ul>\n<li>Compatibility Fixes</li>\n<li>UI fixes</li>\n</ul>\n</li>\n</ul>\n<h4>3.5.1</h4>\n<ul>\n<li>Active Directory Integration : Usability Improvements.</li>\n</ul>\n<h4>3.5</h4>\n<ul>\n<li>Active Directory Integration :\n<ul>\n<li>Compatibility to WordPress 5.3</li>\n<li>Bug Fixes and Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.0.13</h4>\n<ul>\n<li>Active Directory Integration : UI fix.</li>\n</ul>\n<h4>3.0.12</h4>\n<ul>\n<li>Active Directory Integration : UI fix.</li>\n</ul>\n<h4>3.0.11</h4>\n<ul>\n<li>Active Directory Integration : Bug fix for anonymous bind and uploading/editing images in wordpress.</li>\n</ul>\n<h4>3.0.10</h4>\n<ul>\n<li>Active Directory Integration : Change in Contact Us email.</li>\n</ul>\n<h4>3.0.9</h4>\n<ul>\n<li>Active Directory Integration : Improvements\n<ul>\n<li>Audit logs for authentication</li>\n<li>Compatibility to WordPress 5.2</li>\n<li>Bug Fixes and Improvements.</li>\n</ul>\n</li>\n</ul>\n<h4>3.0.8</h4>\n<ul>\n<li>Active Directory Integration : Bug Fixes and Improvements.</li>\n</ul>\n<h4>3.0.7</h4>\n<ul>\n<li>Active Directory Integration : Bug Fixes and Improvements.</li>\n</ul>\n<h4>3.0.6</h4>\n<ul>\n<li>Active Directory Integration : Multisite upgrade links added.</li>\n</ul>\n<h4>3.0.5</h4>\n<ul>\n<li>Active Directory Integration : Bug Fixes and Improvement.</li>\n</ul>\n<h4>3.0.4</h4>\n<ul>\n<li>Active Directory Integration : Bug Fixes and Improvement.</li>\n</ul>\n<h4>3.0.3</h4>\n<ul>\n<li>Active Directory Integration : Bug Fixes and Improvement.</li>\n</ul>\n<h4>3.0.2</h4>\n<ul>\n<li>Active Directory Integration : Improvements\n<ul>\n<li>Improved Visual Tour</li>\n<li>Added tab for making feature requests</li>\n<li>Made registration optional</li>\n<li>Listed add-ons in licensing plans.</li>\n</ul>\n</li>\n</ul>\n<h4>3.0.1</h4>\n<ul>\n<li>Active Directory Integration : Compatibility Fix\n<ul>\n<li>Support for PHP version &gt; 5.3</li>\n<li>WordPress 5.0.1 Compatibility</li>\n</ul>\n</li>\n</ul>\n<h4>3.0</h4>\n<ul>\n<li>Active Directory Integration : Added Visual Tour</li>\n</ul>\n<h4>2.92</h4>\n<ul>\n<li>Active Directory : Role Mapping bug fixes</li>\n</ul>\n<h4>2.91</h4>\n<ul>\n<li>Active Directory : Improvements\n<ul>\n<li>Usability fixes</li>\n<li>Bug fixes</li>\n<li>Licensing page revamp</li>\n</ul>\n</li>\n</ul>\n<h4>2.9</h4>\n<ul>\n<li>Active Directory : Usability fixes</li>\n</ul>\n<h4>2.8.3</h4>\n<ul>\n<li>Active Directory : Added Feedback Form</li>\n</ul>\n<h4>2.8</h4>\n<ul>\n<li>Active Directory : Removed MCrypt dependency. Bug fixes</li>\n</ul>\n<h4>2.7.7</h4>\n<ul>\n<li>Active Directory : Phone number visible in profile</li>\n</ul>\n<h4>2.7.6</h4>\n<ul>\n<li>Active Directory : Compatible with WordPress 4.9.4 and removed external links</li>\n</ul>\n<h4>2.7.43</h4>\n<ul>\n<li>Active Directory : On-premise IdP information</li>\n</ul>\n<h4>2.7.42</h4>\n<ul>\n<li>Active Directory : WordPress 4.9 Compatibility</li>\n</ul>\n<h4>2.7.4</h4>\n<ul>\n<li>Active Directory : Fix for login with user name/email</li>\n</ul>\n<h4>2.7.3</h4>\n<ul>\n<li>Active Directory : Additional feature links.</li>\n</ul>\n<h4>2.7.2</h4>\n<ul>\n<li>Active Directory : Licensing fixes.</li>\n</ul>\n<h4>2.7.1</h4>\n<ul>\n<li>Active Directory : Activation warning fix. Basic registration fields required for upgrade.</li>\n</ul>\n<h4>2.7</h4>\n<ul>\n<li>Active Directory : Registration removal, role mapping fixes and user name attribute configurable.</li>\n</ul>\n<h4>2.6.6</h4>\n<ul>\n<li>Active Directory : Updating Plugin Title</li>\n</ul>\n<h4>2.6.5</h4>\n<ul>\n<li>Active Directory : Licensing fix</li>\n</ul>\n<h4>2.6.4</h4>\n<p>Name fixes</p>\n<h4>2.6.2</h4>\n<p>Name changed</p>\n<h4>2.6.1</h4>\n<p>Added TLS support</p>\n<h4>2.5.8</h4>\n<p>Increased priority for authentication hook</p>\n<h4>2.5.7</h4>\n<p>Licensing fixes</p>\n<h4>2.5.6</h4>\n<p>WordPress 4.6 Compatibility</p>\n<h4>2.5.5</h4>\n<p>Added option to authenticate Administrators from both LDAP and WordPress</p>\n<h4>2.5.4</h4>\n<p>More page fixes</p>\n<h4>2.5.3</h4>\n<p>Page fixes</p>\n<h4>2.5.2</h4>\n<p>Registration fixes</p>\n<h4>2.5.1</h4>\n<ul>\n<li>UI improvement and fix for WP 4.5</li>\n</ul>\n<h4>2.5</h4>\n<p>Added more descriptive error messages and licensing plans updated.</p>\n<h4>2.3</h4>\n<p>Support for Integrated Windows Authentication &#8211; contact info@xecurify.com if interested</p>\n<h4>2.2</h4>\n<p>+Added alternate verification method for user activation.</p>\n<h4>2.1</h4>\n<p>+Minor Bug fixes.</p>\n<h4>2.0</h4>\n<p>Attribute Mapping and Role Mapping Bug fixes and Enhancement.</p>\n<h4>1.9</h4>\n<p>Attribute Mapping bug fixes</p>\n<h4>1.8</h4>\n<p>Role Mapping Bug fixes</p>\n<h4>1.7</h4>\n<p>Fallback to local password in case LDAP server is unreacheable.</p>\n<h4>1.6</h4>\n<p>Added attribute mapping and custom profile fields from LDAP.</p>\n<h4>1.5</h4>\n<p>Added mutiple role support in WP users to LDAP Group Role Mapping.</p>\n<h4>1.4</h4>\n<p>Improved encryption to support special characters.</p>\n<h4>1.3</h4>\n<p>Enhanced Usability and UI for the plugin.</p>\n<h4>1.2</h4>\n<p>Added LDAP groups to WordPress Users Role Mapping</p>\n<h4>1.1</h4>\n<p>Enhanced Troubleshooting</p>\n<h4>1.0</h4>\n<ul>\n<li>this is the first release.</li>\n</ul>\n"
    },
    "short_description": "Active Directory Integration/LDAP Integration enables login &amp; sync in WordPress with Active Directory/LDAP Directory credentials, 24/7 ACTIVE SUPPORT",
    "description": "<p><a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites#Features\" rel=\"nofollow ugc\">Features</a> | <a href=\"https://plugins.miniorange.com/step-by-step-guide-for-wordpress-ldap-login-plugin\" rel=\"nofollow ugc\">Setup Guide</a> | <a href=\"https://plugins.miniorange.com/wordpress-ldap-setup-guides\" rel=\"nofollow ugc\">Documentation</a> | <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites#Add-Ons\" rel=\"nofollow ugc\">Integrations</a> | <a href=\"https://www.miniorange.com/contact\" rel=\"nofollow ugc\">Contact Us</a></p>\n<p><a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites\" rel=\"nofollow ugc\">Active Directory Integration / LDAP Integration Login for Intranet Sites plugin</a> allows you to authenticate your users using their Active Directory/LDAP credentials into your WordPress site. It allows you to map the Active Directory/LDAP attributes to the WordPress user profile attributes and also lets you assign WordPress roles to your LDAP/Active Directory users. Additionally, the plugin has a user authentication report feature, which logs each unsuccessful Active Directory/LDAP authentication request made, providing additional security functionalities.</p>\n<p>This plugin allows users to authenticate against various Active Directory /other LDAP Servers like:</p>\n<ul>\n<li>Microsoft Active Directory</li>\n<li>Azure Active Directory</li>\n<li>Sun Active Directory</li>\n<li>OpenLDAP Directory</li>\n<li>JumpCloud</li>\n<li>FreeIPA Directory</li>\n<li>Synology</li>\n<li>OpenDS and other LDAP directories.</li>\n</ul>\n<p>The LDAP/Active Directory Login (AD Login) for Intranet plugin includes user management features as well, such as adding users from Active Directory or another LDAP Directory who are not registered in WordPress, WordPress role mapping, LDAP/Active Directory to WordPress attribute mapping, and more. We also provide additional add-ons that enhance the functionality of the basic plugin such as enabling <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites#LDAP-intranet-add-ons\" rel=\"nofollow ugc\">Kerberos/NTLM SSO Authentication</a>, importing users from Active Directory/LDAP Server to WordPress, creating users in Active Directory/LDAP server when created/registered in the WordPress site, sync users between the Active Directory/LDAP server and WordPress site, sync LDAP/Active Directory Profile Picture thumbnail attribute to WordPress user profile picture, AD integration with third-party plugins and more.</p>\n<h4>Minimum Requirements</h4>\n<ul>\n<li>Compatible with WordPress version 5.0 or higher</li>\n<li>Compatible with PHP version 5.2.0 or higher</li>\n<li><a href=\"https://faq.miniorange.com/knowledgebase/how-to-enable-php-ldap-extension\" rel=\"nofollow ugc\">PHP LDAP extension Enabled</a></li>\n</ul>\n<p><strong>Get a quick overview of our product</strong></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/VdAIDLCN-cQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h4>Free Version Features:-</h4>\n<ul>\n<li>Perform LDAP Authentication for any user trying to log into the WordPress website whose Active Directory/LDAP credentials are stored in the Active Directory/LDAP server. Additionally, logging in with WordPress credentials is also supported.</li>\n<li>Upon authentication, keep the WordPress User&#8217;s profile information in sync with the Active Directory/other LDAP Directories.</li>\n<li>Automatic User Registration in WordPress: Automatically create WordPress users who are present in the LDAP server/Active Directory upon login.</li>\n<li>Role Mapping: You can select a default WordPress role and assign it to all the Active Directory/LDAP users while LDAP/AD login is performed.</li>\n<li>Attribute mapping: Map the LDAP/Active Directory mail attribute to the WordPress user email and sync upon every successful LDAP/Active Directory Login (AD Login).</li>\n<li><a href=\"https://www.miniorange.com/guide-to-setup-ldaps-on-windows-server\" rel=\"nofollow ugc\">LDAPS (LDAP Secure Connection) support</a>: Supports establishing Secure Connection between the WordPress site and Active Directory/LDAP server via LDAPS protocol, this ensures protection against credential theft.</li>\n<li>Authentication Report: Keep logs of all the Active Directory/LDAP users who try to authenticate on your WordPress website and fail. A lot of the time these are security risks. The LDAP User Authentication report will give you a list of these users, you can also export a CSV of this report.</li>\n<li>Automatic fetching of LDAP Organizational Units from LDAP Server/Active Directory while configuring Search Base for LDAP/AD Login.</li>\n<li>Test connection to your Active Directory/other LDAP Directory while configuring LDAP server information in the plugin.</li>\n<li>Test authentication using credentials stored in your Active Directory/other LDAP Directory after configuring LDAP server information in the plugin.</li>\n<li>Ability to test against demo Active Directory/other LDAP Directory and demo credentials. You can do this using the demo LDAP Directory credentials from <a href=\"https://www.forumsys.com/2022/05/10/online-ldap-test-server/\" rel=\"nofollow ugc\">here</a>.</li>\n<li>Support Integration with hybrid Active Directory infrastructure.</li>\n<li>Compatible with the latest versions of WordPress and PHP.</li>\n<li>We provide extensive easy-to-understand <a href=\"https://plugins.miniorange.com/wordpress-ldap-setup-guides\" rel=\"nofollow ugc\">documentation</a> as well as <a href=\"https://www.youtube.com/playlist?list=PL2vweZ-PcNpd3lEzmiLZwL_cAG_Evg2QC\" rel=\"nofollow ugc\">YouTube setup videos</a> which will assist you while configuring our LDAP Active Directory plugin.</li>\n</ul>\n<p><strong>You can find out how to configure the Active Directory Integration / LDAP Integration plugin through the video below</strong></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/5DUGgP-Hf-k?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>This LDAP/Active Directory Login (AD Login) plugin is free to use under the MIT/Expat license. If you wish to use enhanced features, you may purchase our <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites\" rel=\"nofollow ugc\">Premium version</a>. We also provide additional <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites#LDAP-intranet-add-ons\" rel=\"nofollow ugc\">add-ons</a> that enhance the functionality of the basic WordPress LDAP/AD Login plugin. This will help support further development of our LDAP plugin, and in turn, serve our customers better.</p>\n<p>= <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites\" rel=\"nofollow ugc\">Premium Version Features</a>=</p>\n<ul>\n<li>Our premium plugin comes with additional features along with the aforementioned Free Plugin Features. </li>\n<li><strong>Login With Any LDAP Attribute Of Your Choice:</strong> Authenticate users against multiple LDAP/Active Directory username attributes like sAMAccountName, UID, UserPrincipalName, mail, cn, or any other custom LDAP attribute(s) according to your LDAP Active Directory/any other LDAP directory.</li>\n<li><strong>Auto-register of LDAP users in WordPress site:</strong> Allows users of Active Directory/other LDAP Directory to auto-register in WordPress.</li>\n<li><strong>Advanced Role Mapping:</strong> Assign specific WordPress roles based on the LDAP/Active Directory group memberships or the Organizational Units that are set in the LDAP Server/Active Directory. You can also assign a default WordPress role to all the LDAP/Active Directory users.</li>\n<li><strong>Fetch LDAP groups automatically for Role Mapping:</strong> Fetches the LDAP/AD Security Groups present in your Active Directory/other LDAP Directory.</li>\n<li><strong>Attribute Mapping:</strong> Configure and fetch the LDAP/AD attributes such as UID, cn (common name), mail, telephoneNumber, givenName, sn, sAMAccountName, and map with WordPress user profile attributes upon LDAP/AD Login (Active Directory Login).</li>\n<li><strong>Custom Attribute Mapping:</strong> You can create your own WordPress custom user profile attributes which is a nifty tool if your organization has various attributes present in the Active Directory/LDAP server.</li>\n<li><strong>Custom Search Filter:</strong> Allows you to restrict user authentication on the basis of LDAP/Active Directory security groups, userAccountControl etc.</li>\n<li><strong>Authenticate Users from Multiple LDAP Search Bases:</strong> Authenticate users against multiple search bases from your Active Directory/other LDAP Directory.</li>\n<li><strong>Automatic LDAP/Active Directory Users Search Base Selection:</strong> Fetches and allows you to select the Organization Unit (OU) present in your Active Directory/other LDAP Directory for the user&#8217;s search base.</li>\n<li><strong>Multiple LDAP Directories Configuration:</strong> Perform LDAP/Active Directory authentication against multiple directories through sequential search or on the basis of domain membership.</li>\n<li><strong>WordPress to LDAP User Profile Sync:</strong> Update/Sync the user profile in Active Directory/other LDAP Directory when updated from WordPress.</li>\n<li><strong>Authenticate users from LDAP and WordPress:</strong> Enable all WordPress users or WordPress administrators to login even if they are not present in the LDAP/Active Directory.</li>\n<li><strong>Redirect to Custom URL after Authentication:</strong> Redirect to WordPress Profile page/ Home page/ Custom URL after successful LDAP/Active Directory authentication.</li>\n<li><strong>Detailed User Authentication Report:</strong>  Keep track of user&#8217;s authentication requests for your WordPress site. Get detailed logging information for FAILED LDAP Authentication of individual users.</li>\n<li><strong>Support for Import/Export Plugin Configuration:</strong> Export your LDAP plugin configuration from the staging/testing site and import it to the production/live site. This will save you the hassle of reconfiguring the LDAP plugin.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-multisite-ldap-ad-plugin\" rel=\"nofollow ugc\">Multisite Support</a>:</strong> The plugin supports LDAP/AD Login integration for multisite environments as well.</li>\n<li><strong>Restrict login based on WordPress roles:</strong> Restrict LDAP/Active Directory login (AD Login) to certain users based on the roles which are assigned on WordPress.</li>\n<li>Provides seamless integration with <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites#LDAP-intranet-add-ons\" rel=\"nofollow ugc\">third-party plugins</a> such as BuddyBoss, BuddyPress, Ultimate Member, Gravity forms, Groups, and eMember.</li>\n</ul>\n<p><strong>You can find out Active Directory Integration / LDAP Integration Premium Version Features through the video below</strong></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/r0pnB2d0QP8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>= <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites#LDAP-intranet-add-ons\" rel=\"nofollow ugc\">Add-ons List</a>=</p>\n<ul>\n<li><strong><a href=\"//plugins.miniorange.com/guide-to-setup-kerberos-single-sign-sso)\" rel=\"nofollow ugc\">Active Directory Single Sign-On (SSO) using Kerberos/NTLM</a>:</strong> Enable Active Directory SSO (auto-login) on your WordPress site for Domain Joined Machines using Kerberos/NTLM SSO protocol. This supports Kerberos SSO authentication for Linux with Apache server, Windows authentication on IIS server, Windows with Apache server, etc. We also support Active Directory SSO solutions using the GSSAPI module as well.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-configure-miniorange-directory-sync-add-on-for-wordpress\" rel=\"nofollow ugc\">Sync Users LDAP Directory</a>:</strong> Sync/Import WordPress users from Active Directory/other LDAP directory. Schedules can be configured for the synchronization to run at a specific time and after a specific time interval. Additionally, you can also enable WordPress to LDAP/Active Directory user sync which would enable you to update/create an LDAP/AD user&#8217;s profile.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-miniorange-ldap-buddypress-integration-add-on\" rel=\"nofollow ugc\">Sync BuddyPress Extended Profiles</a>:</strong> Update the BuddyPress users extended profiles with Active Directory/LDAP Server attributes upon LDAP/AD login (Active Directory Login).</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-password-sync-with-ldap-add-on\" rel=\"nofollow ugc\">Password Sync with Active Directory/LDAP Directory</a>:</strong> Update your Active Directory/other LDAP Directory user password, the WordPress password of LDAP users will be synced to the LDAP server when you update or reset it in WordPress.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/configure-miniorange-profile-picture-map-add-on-for-wordpress\" rel=\"nofollow ugc\">Profile Picture Sync for WordPress and BuddyPress</a>:</strong> Update your WordPress and BuddyPress profile picture with thumbnail photos stored in your Active Directory/other LDAP Directory or vice-versa.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-ultimate-member-login-integration-with-ldap-credentials\" rel=\"nofollow ugc\">Ultimate Member Login and Profile Integration</a>:</strong> Enable LDAP/AD Login for Ultimate Member Login form and map Active Directory / other LDAP Directory User Profile attributes with ultimate member profile page.</li>\n<li><strong>Page/Post Restriction:</strong> This allows you to control access to your site&#8217;s content (pages/posts) based on LDAP groups/WordPress roles.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-miniorange-ldap-search-widget-add-on\" rel=\"nofollow ugc\">Search Staff From Active Directory/other LDAP Directory</a>:</strong> Search and display your Active Directory/other LDAP Directory users on your website page using a search widget and shortcode.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-third-party-user-profile-integration-with-ldap-add-on\" rel=\"nofollow ugc\">Third-Party Plugin User Profile Integration</a>:</strong> Update user profiles created using any third-party plugin with information from your Active Directory/other LDAP Directory stored in WordPress user meta table.</li>\n<li><strong>Gravity Forms Integration:</strong> Populate Gravity Form fields with information from Active Directory / other LDAP Directory. You can do AD integration with unlimited forms.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/guide-to-setup-miniorange-ldap-buddypress-integration-add-on\" rel=\"nofollow ugc\">Sync BuddyPress Groups</a>:</strong> Assign BuddyPress groups to users based on LDAP/AD group membership in Active Directory / other LDAP Directory.</li>\n<li><strong>MemberPress Plugin Integration:</strong> Login to MemberPress-protected content with Active Directory / other LDAP Directory Credentials.</li>\n<li><strong>eMember Plugin Integration:</strong> Login to eMember profiles with Active Directory / other LDAP Directory Credentials.</li>\n<li><strong>WP Groups Plugin Integration:</strong> Assign users to WordPress groups created using the Groups plugin based on their LDAP/AD groups memberships present in the Active Directory / LDAP Server. You can map any number of Active Directory groups with WordPress groups.</li>\n<li>With authentication being one of the essential functions of the day, a fast and <strong><a href=\"https://www.miniorange.com/support-plans\" rel=\"nofollow ugc\">priority support</a></strong> (provided in paid versions) ensure that any issues you face on a live production site can be resolved in a timely manner.</li>\n<li><strong>Regular updates</strong> to the premium plugin compatible with the latest WordPress version. The updates include security and bug fixes. These updates <strong>ensure that you are updated with the latest security fixes</strong>.</li>\n<li>Ensure timely updates for <strong>new WordPress/PHP releases</strong> with our premium plugins and compatibility updates to make sure you have adequate support for smooth transitions to new versions of WordPress and PHP.</li>\n<li><strong>Reasonably priced</strong> with various plans tailored to suit your needs.</li>\n<li><strong>Easy to setup</strong> with lots of support and documentation to assist with the setup.</li>\n<li>High level of <strong>customization</strong> and <strong>add-ons</strong> to support specific requirements.</li>\n</ul>\n<h4>Other Use-Cases we support:-</h4>\n<ul>\n<li><strong><a href=\"https://plugins.miniorange.com/wordpress-ldap-login-cloud\" rel=\"nofollow ugc\">miniOrange Active Directory/LDAP Integration for Cloud &amp; Shared Hosting Platforms Plugin</a></strong> supports login to WordPress sites hosted on a shared hosting platform using credentials stored in active directory and LDAP Directory systems in case you are not able to enable <strong><a href=\"https://faq.miniorange.com/knowledgebase/how-to-enable-php-ldap-extension/\" rel=\"nofollow ugc\">LDAP Extension</a></strong> on your site.</li>\n<li><strong> <a href=\"https://plugins.miniorange.com/wordpress-ldap-directory-search\" rel=\"nofollow ugc\">Search Staff/Employee present in your Active Directory</a></strong>: allows you to search and display the users present in your Active Directory / LDAP Server on a WordPress page using a shortcode.</li>\n<li><strong><a href=\"https://plugins.miniorange.com/wordpress-login-and-user-management-plugin\" rel=\"nofollow ugc\">WordPress Login and User Management Plugin</a></strong>: This plugin offers several functionalities, including bulk user management, user redirection based on WordPress roles, user session management, auto-logout users, and the ability to make a page or post private or public based on an ID or URL.</li>\n<li>miniOrange also supports <strong><a href=\"https://www.miniorange.com/solutions/vpn-mfa-multi-factor-authentication\" rel=\"nofollow ugc\">VPN use cases</a></strong> Log in to your VPN client using Active Directory /other LDAP Directory credentials and <strong><a href=\"https://www.miniorange.com/products/multi-factor-authentication-mfa\" rel=\"nofollow ugc\">Multi-Factor Authentication</a></strong>.</li>\n<li>miniOrange supports <strong><a href=\"https://apisecurity.miniorange.com\" rel=\"nofollow ugc\">API Security use cases</a></strong> to protect and secure your APIs using our product <strong><a href=\"https://apiconsole.miniorange.com\" rel=\"nofollow ugc\">XecureAPI</a></strong> which helps you to enable Authentication methods ( like OAuth, SAML, LDAP, API Key Authentication, JWT Authentication etc ), Rate Limiting, IP restriction and much more on your APIs for complete protection.</li>\n<li>miniOrange supports <strong><a href=\"https://www.miniorange.com/products/single-sign-on-sso\" rel=\"nofollow ugc\">Single-Sign-On (SSO)</a></strong> into a plethora of applications and supports various protocols like(<strong><a href=\"https://blog.miniorange.com/radius-server-authentication/\" rel=\"nofollow ugc\">RADIUS</a>, <a href=\"https://plugins.miniorange.com/wordpress-single-sign-on-sso\" rel=\"nofollow ugc\">SAML</a>, <a href=\"https://plugins.miniorange.com/wordpress-sso\" rel=\"nofollow ugc\">OAuth</a>, <a href=\"https://plugins.miniorange.com/wordpress-ldap-login-intranet-sites\" rel=\"nofollow ugc\">LDAP/LDAPS</a></strong>, using various IDP&#8217;s like <strong>Azure Active Directory, Microsoft On-Premise Active Directory, Octa, ADFS</strong>, etc.</li>\n<li>Contact us at info@xecurify.com to know more.</li>\n</ul>\n<h4>Need support?</h4>\n<p>Please email us at info@xecurify.com or <a href=\"https://xecurify.com/contact\" rel=\"nofollow ugc\">Contact us</a>.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.5.1.3.zip",
    "upgrade_notice": {
        "5.1.3": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability Improvements</li>\n<li>Readme changes</li>\n</ul></li>\n</ul>",
        "5.1.2": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Improvements</li>\n<li>Compatibility with WordPress 6.6</li>\n</ul></li>\n</ul>",
        "5.1.1": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Improvements.</li>\n</ul></li>\n</ul>",
        "5.1.0": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Enhanced the Plugin&#039;s User Interface.</li>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "5.0.6": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Improvements</li>\n</ul></li>\n</ul>",
        "5.0.5": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Improvements</li>\n<li>Compatibility with WordPress 6.5</li>\n</ul></li>\n</ul>",
        "5.0.4": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Changes in Login Settings</li>\n<li>Code Optimization</li>\n</ul></li>\n</ul>",
        "5.0.3": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Improvements and usability fixes.</li>\n</ul></li>\n</ul>",
        "5.0.2": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability fixes</li>\n</ul></li>\n</ul>",
        "5.0.1": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Code Improvement</li>\n<li>Readme changes</li>\n</ul></li>\n</ul>",
        "5.0.0": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Code Restructuring and Optimization.</li>\n<li>Revamped the User Interface to provide a user-friendly experience.</li>\n<li>Added step-by-step approach to simplify LDAP configuration.</li>\n<li>Enhanced User Reports for better usability.</li>\n</ul></li>\n</ul>",
        "4.2.2": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Compatibility with WordPress 6.4</li>\n</ul></li>\n</ul>",
        "4.2.1": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Improvements.</li>\n</ul></li>\n</ul>",
        "4.2": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Enhanced security measures to prevent LDAP Passback Vulnerability.</li>\n</ul></li>\n</ul>",
        "4.1.11": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "4.1.10": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Security Fixes.</li>\n</ul></li>\n</ul>",
        "4.1.9": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Improvements.</li>\n</ul></li>\n</ul>",
        "4.1.8": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Improvements in Error Messages.</li>\n<li>Compatibility with WordPress version 6.3.</li>\n</ul></li>\n</ul>",
        "4.1.7": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Improvements.</li>\n</ul></li>\n</ul>",
        "4.1.6": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Vulnerability Fixes.</li>\n</ul></li>\n</ul>",
        "4.1.5": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Security Fixes.</li>\n<li>Code Optimization.</li>\n</ul></li>\n</ul>",
        "4.1.4": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Removed Plugin Tour.</li>\n</ul></li>\n</ul>",
        "4.1.3": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Compatibility with WordPress version 6.2.</li>\n</ul></li>\n</ul>",
        "4.1.2": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability Improvements.</li>\n<li>UI Enhancement.</li>\n</ul></li>\n</ul>",
        "4.1.1": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Vulnerability Fixes.</li>\n<li>Readme update.</li>\n</ul></li>\n</ul>",
        "4.1.0": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>WP Guideline &amp; Security Fixes.</li>\n<li>Code Optimization.</li>\n</ul></li>\n</ul>",
        "4.0.8": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Advertisement of Christmas Offers.</li>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "4.0.7": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Updated Licensing Plans.</li>\n<li>Compatibility with PHP 8.1.</li>\n</ul></li>\n</ul>",
        "4.0.6": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Compatibility with WordPress 6.1.</li>\n<li>Minor UI fixes.</li>\n</ul></li>\n</ul>",
        "4.0.5": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Compatibility fixes.</li>\n</ul></li>\n</ul>",
        "4.0.4": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Improvement.</li>\n<li>Updated setup video and guide for configuration of the Plugin.</li>\n<li>Improved Account Registration form.</li>\n</ul></li>\n</ul>",
        "4.0.3": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Improvements.</li>\n<li>Added new FAQ&#039;s.</li>\n</ul></li>\n</ul>",
        "4.0.2": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability Improvements.</li>\n<li>UI Improvements.</li>\n</ul></li>\n</ul>",
        "4.0.1": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Improvements.</li>\n<li>Usability Improvements</li>\n</ul></li>\n</ul>",
        "4.0": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Improvements.</li>\n<li>Improved visibility of Error and Success messages.</li>\n</ul></li>\n</ul>",
        "3.7.7": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>UI Enhancement.</li>\n<li>Vulnerabilities Fixes &amp; Security Improvements.</li>\n</ul></li>\n</ul>",
        "3.7.6": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Introduced new licensing plans.</li>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.7.5": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Compatibility with WordPress 6.0.</li>\n<li>Authentication report bug fixes.</li>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.7.4": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Compatibility with WordPress 5.9.3.</li>\n<li>Added a new FAQ.</li>\n<li>Added a new feature to set multiple roles and persist existing roles for the user.</li>\n</ul></li>\n</ul>",
        "3.7.3": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Compatibility with WordPress 5.9.2.</li>\n<li>Added Export User Authentication Reports to the CSV file feature.</li>\n<li>Custom email domain feature for Users email.</li>\n</ul></li>\n</ul>",
        "3.7.2": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Bug fixes for empty email field in username attribute</li>\n<li>Code optimization</li>\n<li>Usability Improvements</li>\n</ul></li>\n</ul>",
        "3.7.1": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Compatibility with WordPress 5.9.</li>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.7": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.6.99": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>New Year Offers.</li>\n<li>Bug fix in default email domain mapping.</li>\n</ul></li>\n</ul>",
        "3.6.98": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Christmas Offers &amp; Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.6.97": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability &amp; Security Improvements.</li>\n</ul></li>\n</ul>",
        "3.6.96": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Vulnerabilities Fixes &amp; Security Improvements.</li>\n</ul></li>\n</ul>",
        "3.6.95": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Bug Fixes - Sanitization of input fields.</li>\n</ul></li>\n</ul>",
        "3.6.94": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability Improvements.</li>\n<li>Added option to set user&#039;s email to username@email_domain in WordPress, if the &quot;mail&quot; attribute is not set in LDAP directory.</li>\n</ul></li>\n</ul>",
        "3.6.93": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.6.92": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.6.91": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.6.9": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Compatible with WordPress 5.8.</li>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.6.8": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Integrated a support form for scheduling a call for assistance.</li>\n</ul></li>\n</ul>",
        "3.6.7": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Bug Fix for auto registration of LDAP user.</li>\n</ul></li>\n</ul>",
        "3.6.6": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Added new add-ons to integrate with third party plugins.</li>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.6.5": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability Improvements.</li>\n<li>Default Role Mapping feature.</li>\n<li>Assign default WordPress role for all users after login.</li>\n</ul></li>\n</ul>",
        "3.6.4": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.6.3": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Tested for WordPress 5.7.</li>\n<li>Compatibility Fixes for PHP 8.0.</li>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.6.2": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.6.1": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Usability Improvements.</li>\n</ul></li>\n</ul>",
        "3.6": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Added setup guides and videos for premium add-ons.</li>\n<li>Compatible with WordPress 5.6</li>\n</ul></li>\n</ul>",
        "3.5.93": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Added dropdown to select Directory Server Type.</li>\n<li>Improvements in &quot;Premium Plugin Trial Request&quot; feature.</li>\n<li>Usability Improvements in Licensing Page.</li>\n</ul></li>\n</ul>",
        "3.5.92": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Improvements for possible Base DNs from Active Directory.</li>\n<li>Plugin tour fixes and usability improvements.</li>\n<li>Added &quot;Premium Plugin Trial Request&quot; feature.</li>\n</ul></li>\n</ul>",
        "3.5.91": "<ul>\n<li>Active Directory Integration :\n\n<ul>\n<li>Compatibility with WordPress 5.5.</li>\n<li>Usability improvements and fixes</li>\n<li>fetch users DN from Active Directory.</li>\n</ul></li>\n</ul>",
        "3.5.9": "<ul>\n<li>Active Directory Integration : Usability improvements for Active Directory Integration</li>\n</ul>",
        "3.5.85": "<ul>\n<li>Active Directory Integration : Usability improvement to fetch list of possible Base DNs from Active Directory</li>\n</ul>",
        "3.5.8": "<ul>\n<li>Active Directory Integration : Usability improvements.</li>\n</ul>",
        "3.5.7": "<ul>\n<li>Active Directory Integration : Usability improvements and bug fixes.</li>\n</ul>",
        "3.5.6": "<ul>\n<li>Active Directory Integration : Compatibility with 5.4.2, Usability improvements for search attribute.</li>\n</ul>",
        "3.5.5": "<ul>\n<li>Active Directory Integration : Usability changes and fix for fetching email address at login time.</li>\n</ul>",
        "3.5.4": "<ul>\n<li>Active Directory Integration : PHP 7.4 and WordPress 5.4 compatibility</li>\n</ul>",
        "3.5.3": "<ul>\n<li>Active Directory Integration : Compatibility fixes</li>\n</ul>",
        "3.5.2": "<ul>\n<li>Active Directory Integration : Fixes\n\n<ul>\n<li>Compatibility Fixes</li>\n<li>UI fixes</li>\n</ul></li>\n</ul>",
        "3.5.1": "<ul>\n<li>Active Directory Integration : Usability Improvements.</li>\n</ul>",
        "3.5": "<ul>\n<li>Active Directory Integration : \n\n<ul>\n<li>Compatibility to WordPress 5.3</li>\n<li>Bug Fixes and Improvements.</li>\n</ul></li>\n</ul>",
        "3.0.13": "<ul>\n<li>Active Directory Integration : UI fix.</li>\n</ul>",
        "3.0.12": "<ul>\n<li>Active Directory Integration : UI fix.</li>\n</ul>",
        "3.0.11": "<ul>\n<li>Active Directory Integration : Bug fix for anonymous bind and uploading/editing images in wordpress.</li>\n</ul>",
        "3.0.10": "<ul>\n<li>Active Directory Integration : Change in Contact Us email.</li>\n</ul>",
        "3.0.9": "<ul>\n<li>Active Directory Integration : Improvements\n\n<ul>\n<li>Audit logs for authentication</li>\n<li>Compatibility to WordPress 5.2</li>\n<li>Bug Fixes and Improvements.</li>\n</ul></li>\n</ul>",
        "3.0.8": "<ul>\n<li>Active Directory Integration : Bug Fixes and Improvements.</li>\n</ul>",
        "3.0.7": "<ul>\n<li>Active Directory Integration : Bug Fixes and Improvements.</li>\n</ul>",
        "3.0.6": "<ul>\n<li>Active Directory Integration : Multisite upgrade links added.</li>\n</ul>",
        "3.0.5": "<ul>\n<li>Active Directory Integration : Bug Fixes and Improvement.</li>\n</ul>",
        "3.0.4": "<ul>\n<li>Active Directory Integration : Bug Fixes and Improvement.</li>\n</ul>",
        "3.0.3": "<ul>\n<li>Active Directory Integration : Bug Fixes and Improvement.</li>\n</ul>",
        "3.0.2": "<ul>\n<li>Active Directory Integration : Improvements\n\n<ul>\n<li>Improved Visual Tour</li>\n<li>Added tab for making feature requests</li>\n<li>Made registration optional</li>\n<li>Listed add-ons in licensing plans.</li>\n</ul></li>\n</ul>",
        "3.0.1": "<ul>\n<li>Active Directory Integration : Compatibility Fix\n\n<ul>\n<li>Support for PHP version &gt; 5.3</li>\n<li>Wordpress 5.0.1 Compatibility</li>\n</ul></li>\n</ul>",
        "3.0": "<ul>\n<li>Active Directory Integration : Added Visual Tour</li>\n</ul>",
        "2.92": "<ul>\n<li>Active Directory : Role Mapping bug fixes</li>\n</ul>",
        "2.91": "<ul>\n<li>Active Directory : Improvements\n\n<ul>\n<li>Usability fixes</li>\n<li>Bug fixes</li>\n<li>Licensing page revamp</li>\n</ul></li>\n</ul>",
        "2.9": "<ul>\n<li>Active Directory : Usability fixes</li>\n</ul>",
        "2.8.3": "<ul>\n<li>Active Directory : Added Feedback Form</li>\n</ul>",
        "2.8": "<ul>\n<li>Active Directory : Removed MCrypt dependency. Bug fixes</li>\n</ul>",
        "2.7.7": "<ul>\n<li>Active Directory : Phone number visible in profile</li>\n</ul>",
        "2.7.6": "<ul>\n<li>Active Directory : Compatible with WordPress 4.9.4 and removed external links</li>\n</ul>",
        "2.7.43": "<ul>\n<li>Active Directory : On-premise IdP information</li>\n</ul>",
        "2.7.42": "<ul>\n<li>Active Directory : WordPress 4.9 Compatibility</li>\n</ul>",
        "2.7.4": "<ul>\n<li>Active Directory : Fix for login with username/email</li>\n</ul>",
        "2.7.3": "<ul>\n<li>Active Directory : Additional feature links.</li>\n</ul>",
        "2.7.2": "<ul>\n<li>Active Directory : Licensing fixes.</li>\n</ul>",
        "2.7.1": "<ul>\n<li>Active Directory : Activation warning fix. Basic registration fields required for upgrade.</li>\n</ul>",
        "2.7": "<ul>\n<li>Active Directory : Registration removal, role mapping fixes and username attribute configurable.</li>\n</ul>",
        "2.6.6": "<ul>\n<li>Active Directory : Updating Plugin Title</li>\n</ul>",
        "2.6.5": "<ul>\n<li>Active Directory : Licensing fix</li>\n</ul>",
        "2.6.4": "<p>Name fixes</p>",
        "2.6.2": "<p>Name changed</p>",
        "2.6.1": "<p>Added TLS support</p>",
        "2.5.8": "<p>Increased priority for authentication hook</p>",
        "2.5.7": "<p>Licensing fixes</p>",
        "2.5.6": "<p>WordPress 4.6 Compatibility</p>",
        "2.5.5": "<p>Added option to authenticate Administrators from both LDAP and WordPress</p>",
        "2.5.4": "<p>More page fixes</p>",
        "2.5.3": "<p>Page fixes</p>",
        "2.5.2": "<p>Registration fixes</p>",
        "2.5.1": "<ul>\n<li>UI improvement and fix for WP 4.5</li>\n</ul>",
        "2.5": "<p>Added more descriptive error messages and licensing plans updated.</p>",
        "2.3": "<p>Support for Integrated Windows Authentication - contact info@xecurify.com if interested</p>",
        "2.2": "<p>+Added alternate verification method for user activation.</p>",
        "2.1": "<p>+Minor Bug fixes.</p>",
        "2.0": "<p>Attribute Mapping and Role Mapping Bug fixes and Enhancement.</p>",
        "1.9": "<p>Attribute Mapping bug fixes</p>",
        "1.8": "<p>Role Mapping Bug fixes</p>",
        "1.7": "<p>Fallback to local password in case LDAP server is unreacheable.</p>",
        "1.6": "<p>Added attribute mapping and custom profile fields from LDAP .</p>",
        "1.5": "<p>Added mutiple role support in WP users to LDAP Group Role Mapping .</p>",
        "1.4": "<p>Improved encryption to support special characters.</p>",
        "1.3": "<p>Enhanced Usability and UI for the plugin.</p>",
        "1.2": "<p>Added LDAP groups to WordPress Users Role Mapping</p>",
        "1.1": "<p>Enhanced Troubleshooting</p>",
        "1.0": "<p>First version of plugin.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/ldap-login-for-intranet-sites/assets/screenshot-1.png?rev=3002180",
            "caption": "Configure LDAP Server Connection"
        },
        {
            "src": "https://ps.w.org/ldap-login-for-intranet-sites/assets/screenshot-2.png?rev=3002180",
            "caption": "Configure LDAP User Login Mapping"
        },
        {
            "src": "https://ps.w.org/ldap-login-for-intranet-sites/assets/screenshot-3.png?rev=3002180",
            "caption": "LDAP Groups to WordPress Users Role Mapping"
        },
        {
            "src": "https://ps.w.org/ldap-login-for-intranet-sites/assets/screenshot-4.png?rev=3002180",
            "caption": "User Attributes Mapping between LDAP and WP"
        },
        {
            "src": "https://ps.w.org/ldap-login-for-intranet-sites/assets/screenshot-5.png?rev=3002180",
            "caption": "Sign-In Settings"
        },
        {
            "src": "https://ps.w.org/ldap-login-for-intranet-sites/assets/screenshot-6.png?rev=3002180",
            "caption": "Configure Multiple Directories"
        },
        {
            "src": "https://ps.w.org/ldap-login-for-intranet-sites/assets/screenshot-7.png?rev=3002180",
            "caption": "Export/Import LDAP Plugin Configuration"
        },
        {
            "src": "https://ps.w.org/ldap-login-for-intranet-sites/assets/screenshot-8.png?rev=3002180",
            "caption": "LDAP Authentication Report"
        },
        {
            "src": "https://ps.w.org/ldap-login-for-intranet-sites/assets/screenshot-9.png?rev=3002180",
            "caption": "LDAP Premium Add-ons"
        }
    ],
    "tags": {
        "active-directory": "active directory",
        "active-directory-integration": "active directory integration",
        "authentication": "authentication",
        "ldap": "ldap",
        "ldap-authentication": "ldap authentication"
    },
    "stable_tag": "5.1.3",
    "versions": {
        "2.6.5": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.2.6.5.zip",
        "2.6.6": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.2.6.6.zip",
        "2.7": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.2.7.zip",
        "2.7.1": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.2.7.1.zip",
        "2.7.2": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.2.7.2.zip",
        "2.7.3": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.2.7.3.zip",
        "2.7.4": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.2.7.4.zip",
        "2.7.42": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.2.7.42.zip",
        "2.7.43": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.2.7.43.zip",
        "2.7.6": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.2.7.6.zip",
        "2.8.3": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.2.8.3.zip",
        "3.0": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.1.zip",
        "3.0.10": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.10.zip",
        "3.0.11": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.11.zip",
        "3.0.12": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.12.zip",
        "3.0.13": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.13.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.4.zip",
        "3.0.5": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.5.zip",
        "3.0.6": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.6.zip",
        "3.0.7": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.7.zip",
        "3.0.8": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.8.zip",
        "3.0.9": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.0.9.zip",
        "3.5": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.zip",
        "3.5.1": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.1.zip",
        "3.5.2": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.2.zip",
        "3.5.3": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.3.zip",
        "3.5.4": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.4.zip",
        "3.5.5": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.5.zip",
        "3.5.6": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.6.zip",
        "3.5.7": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.7.zip",
        "3.5.8": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.8.zip",
        "3.5.85": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.85.zip",
        "3.5.9": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.9.zip",
        "3.5.91": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.91.zip",
        "3.5.92": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.92.zip",
        "3.5.93": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.5.93.zip",
        "3.6": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.1.zip",
        "3.6.2": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.2.zip",
        "3.6.3": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.3.zip",
        "3.6.4": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.4.zip",
        "3.6.5": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.5.zip",
        "3.6.6": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.6.zip",
        "3.6.7": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.7.zip",
        "3.6.8": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.8.zip",
        "3.6.9": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.9.zip",
        "3.6.91": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.91.zip",
        "3.6.92": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.92.zip",
        "3.6.93": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.93.zip",
        "3.6.94": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.94.zip",
        "3.6.95": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.95.zip",
        "3.6.96": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.96.zip",
        "3.6.97": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.97.zip",
        "3.6.98": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.98.zip",
        "3.6.99": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.6.99.zip",
        "3.7": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.7.zip",
        "3.7.1": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.7.1.zip",
        "3.7.2": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.7.2.zip",
        "3.7.3": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.7.3.zip",
        "3.7.4": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.7.4.zip",
        "3.7.5": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.7.5.zip",
        "3.7.6": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.7.6.zip",
        "3.7.7": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.3.7.7.zip",
        "4.0": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.0.zip",
        "4.0.1": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.0.1.zip",
        "4.0.2": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.0.2.zip",
        "4.0.3": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.0.3.zip",
        "4.0.4": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.0.4.zip",
        "4.0.5": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.0.5.zip",
        "4.0.6": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.0.6.zip",
        "4.0.7": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.0.7.zip",
        "4.0.8": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.0.8.zip",
        "4.1.0": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.1.0.zip",
        "4.1.1": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.1.1.zip",
        "4.1.10": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.1.10.zip",
        "4.1.11": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.1.11.zip",
        "4.1.2": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.1.2.zip",
        "4.1.3": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.1.3.zip",
        "4.1.4": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.1.4.zip",
        "4.1.5": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.1.5.zip",
        "4.1.6": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.1.6.zip",
        "4.1.7": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.1.7.zip",
        "4.1.8": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.1.8.zip",
        "4.1.9": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.1.9.zip",
        "4.2": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.2.zip",
        "4.2.1": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.2.1.zip",
        "4.2.2": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.4.2.2.zip",
        "5.0.0": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.5.0.0.zip",
        "5.0.1": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.5.0.1.zip",
        "5.0.2": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.5.0.2.zip",
        "5.0.3": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.5.0.3.zip",
        "5.0.4": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.5.0.4.zip",
        "5.0.5": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.5.0.5.zip",
        "5.0.6": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.5.0.6.zip",
        "5.1.0": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.5.1.0.zip",
        "5.1.1": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.5.1.1.zip",
        "5.1.2": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.5.1.2.zip",
        "5.1.3": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.5.1.3.zip",
        "trunk": "https://downloads.wordpress.org/plugin/ldap-login-for-intranet-sites.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://miniorange.com",
    "banners": {
        "low": "https://ps.w.org/ldap-login-for-intranet-sites/assets/banner-772x250.png?rev=1213862",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/ldap-login-for-intranet-sites/assets/icon-128x128.gif?rev=2664776"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}