{
    "name": "Local Delivery Drivers for WooCommerce",
    "slug": "local-delivery-drivers-for-woocommerce",
    "version": "1.9.3",
    "author": "<a href=\"http://www.powerfulwp.com\">powerfulwp</a>",
    "author_profile": "https://profiles.wordpress.org/powerfulwp/",
    "contributors": {
        "powerfulwp": {
            "profile": "https://profiles.wordpress.org/powerfulwp/",
            "avatar": "https://secure.gravatar.com/avatar/75d965461543821ea22e4d9217e9a5bc?s=96&d=monsterid&r=g",
            "display_name": "powerfulwp"
        }
    },
    "requires": "4.5",
    "tested": "6.6.1",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 86,
    "ratings": {
        "5": 13,
        "4": 2,
        "3": 1,
        "2": 0,
        "1": 2
    },
    "num_ratings": 18,
    "support_url": "https://wordpress.org/support/plugin/local-delivery-drivers-for-woocommerce/",
    "support_threads": 1,
    "support_threads_resolved": 1,
    "active_installs": 900,
    "downloaded": 49158,
    "last_updated": "2024-07-26 7:45pm GMT",
    "added": "2020-10-10",
    "homepage": "https://powerfulwp.com/local-delivery-drivers-for-woocommerce-premium/",
    "sections": {
        "description": "<p>Developed by <a href=\"https://powerfulwp.com/\" rel=\"nofollow ugc\">PowerfulWP</a> | <a href=\"https://powerfulwp.com/local-delivery-drivers-for-woocommerce-premium/\" rel=\"nofollow ugc\">Premium</a> | <a href=\"https://powerfulwp.com/docs/local-delivery-drivers-for-woocommerce-premium/\" rel=\"nofollow ugc\">Documents</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/lvMRSKTU0Ro?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span><br />\n* Several premium features are demonstrated in the video and images.</p>\n<h3>Improve the way you deliver, manage drivers, assign drivers to orders, send WhatsApp, SMS, email notifications, route planning, navigation &amp; more!</h3>\n<h3>LOCAL DELIVERY DRIVERS FOR WOOCOMMERCE</h3>\n<p>The Local Delivery Drivers for WooCommerce plugin is a powerful tool that streamlines the delivery process for store owners and drivers.</p>\n<p>With this plugin, store owners can easily assign orders to drivers, and drivers can manage their deliveries with a mobile-friendly panel.</p>\n<p>The plugin also allows store owners to send notifications to drivers and customers via WhatsApp, SMS, and email, and includes a feature for planning routes with navigation.</p>\n<h3>WHO CAN USE THIS PLUGIN?</h3>\n<p>The &#8220;Local Delivery Drivers for WooCommerce&#8221; plugin is suitable for any delivery service that uses WooCommerce and WordPress.</p>\n<p>Some examples of businesses that may benefit from using this plugin include:</p>\n<ul>\n<li>Grocery stores and supermarkets</li>\n<li>Restaurants and food delivery services</li>\n<li>Florists and flower shops</li>\n<li>Alcohol delivery services</li>\n<li>Pharmacies and medical supply stores</li>\n<li>Pet stores and animal supply stores</li>\n<li>Home and garden supply stores</li>\n<li>Furniture stores and home decor retailers</li>\n<li>Electronics stores and appliance retailers</li>\n<li>Toy stores and children&#8217;s retailers</li>\n<li>Sporting goods stores and outdoor retailers</li>\n<li>Clothing and fashion retailers</li>\n<li>Book stores </li>\n<li>Art supply stores and hobby stores</li>\n<li>Baby supply stores and children&#8217;s retailers</li>\n<li>Party supply stores</li>\n<li>Office supply stores and business supply retailers</li>\n<li>Cannabis and medical marijuana dispensaries</li>\n<li>Cleaning companies and home services providers</li>\n<li>Laundry and dry cleaning services</li>\n<li>Carpet cleaning services and home services providers</li>\n<li>Bakery or pastry shops</li>\n<li>Health food stores and natural or organic food retailers</li>\n<li>Gift shops and specialty retailers</li>\n<li>Printer ink and toner suppliers</li>\n<li>Clothing delivery companies and online fashion retailers</li>\n<li>Home delivery meal kit services</li>\n<li>Handmade or unique home decor items and furniture</li>\n<li>Natural or organic beauty and personal care products</li>\n<li>Online art galleries</li>\n<li>Vintage or secondhand clothing and accessories retailers</li>\n<li>Outdoor gear or adventure equipment retailers</li>\n<li>Musical instrument stores and record stores</li>\n<li>Health supplement and wellness product retailers</li>\n<li>Handmade jewelry and accessory stores</li>\n<li>Luxury or high-end fashion retailers</li>\n<li>Subscription box services for a specific niche (e.g., coffee, tea, snacks, crafts)</li>\n<li>Online plant nurseries or garden centers</li>\n<li>Any other business that involves local delivery of physical goods.</li>\n</ul>\n<h3>Features</h3>\n<h3>New Delivery Drivers User Role</h3>\n<p>This plugin adds a new user role called &#8216;Delivery Drivers&#8217; to your WooCommerce store.</p>\n<p>The store owner can use this role to manage delivery driver details, work availability, and order assignments.</p>\n<p>With this feature, you can easily keep track of your delivery team and streamline your order fulfillment process.</p>\n<h3>New Delivery Statuses for your WooCommerce store</h3>\n<p>This plugin enhances your WooCommerce store by introducing three order statuses to track better and manage the delivery process.</p>\n<p>These statuses are: &#8216;Driver Assigned,&#8217; &#8216;Failed Delivery Attempt,&#8217; and &#8216;Out for Delivery.&#8217;<br />\nThese updates will keep your customers informed and help your business run smoothly.</p>\n<ul>\n<li>\n<p>&#8220;Driver Assigned&#8221; &#8211; This status shows that a delivery driver has been assigned to the order. It helps you track which driver is handling which deliveries.</p>\n</li>\n<li>\n<p>&#8220;Failed Delivery Attempt&#8221; &#8211; If a delivery driver tries to deliver an order but is unable to (e.g. the customer is not home or the delivery address is incorrect), this status records the failed attempt. It helps you track any issues that may have occurred during the delivery process and communicate with customers about when to expect a second attempt.</p>\n</li>\n<li>\n<p>&#8220;Out for Delivery&#8221; &#8211; This status shows that the delivery driver is in the process of delivering the order. In addition, it indicates that the shipment is on its way to the customer and is expected to arrive soon.</p>\n</li>\n</ul>\n<h3>ASSIGNING DELIVERY DRIVERS TO ORDERS</h3>\n<p>The store owner has the ability to assign delivery drivers to orders on the admin panel&#8217;s order page.</p>\n<p>Once a delivery driver is assigned to an order, the order&#8217;s status will be updated to &#8216;Driver assigned.</p>\n<h3>ORDERS NOTES</h3>\n<p>The &#8220;Local Delivery Drivers for WooCommerce&#8221; plugin saves all actions the delivery driver takes on the order notes.</p>\n<p>This allows you to track the progress of each delivery and see any comments or updates made by the driver.</p>\n<p>By keeping a record of all delivery-related activities on the order notes, you can improve communication and transparency within your team, ultimately leading to more efficient and successful deliveries.</p>\n<h3>DELIVERY DRIVERS MOBILE-FRIENDLY PANEL</h3>\n<p>The &#8220;Local Delivery Drivers for WooCommerce&#8221; plugin includes a mobile-friendly panel that allows delivery drivers to manage their deliveries from their smartphones.</p>\n<p>The panel has a convenient, app-like interface and can be added to the mobile homepage for easy access.</p>\n<p>The delivery drivers panel includes screens for each order status, including a dashboard, driver assigned orders, out for delivery, failed delivery, and delivered orders.</p>\n<p>On the dashboard, drivers can update their availability and view the total number of orders in each status.</p>\n<p>The &#8220;driver assigned&#8221; screen shows all orders assigned to the driver, while the &#8220;out for delivery&#8221; screen displays all orders on the current delivery route.</p>\n<p>The &#8220;failed delivery&#8221; and &#8220;delivered&#8221; screens allow drivers to view their completed orders from today, yesterday, this month, and last month.</p>\n<p>Overall, the delivery drivers panel provides an easy-to-use interface for managing deliveries on the go.</p>\n<h3>ORDER PAGE SCREEN</h3>\n<p>On the order page, delivery drivers can view all the relevant details for an order, such as the billing and shipping addresses, items included in the order, and any comments left by the customer or dispatch center.</p>\n<p>They can also easily update the order&#8217;s status to &#8220;delivered&#8221; or &#8220;failed attempt&#8221; and leave comments for other team members to see.</p>\n<p>Additionally, the delivery driver can quickly call the customer or dispatch center directly from the order page if needed.</p>\n<h3>Supported languages</h3>\n<p>English, Spanish, French, Hebrew, Portuguese, Russian, German, Italian, and Arabic.</p>\n<h3>* PREMIUM FEATURES</h3>\n<p>Check out the <a href=\"https://powerfulwp.com/local-delivery-drivers-for-woocommerce-premium/\" rel=\"nofollow ugc\">Local Delivery Drivers for WooCommerce Premium</a> plugin.<br />\nThe premium plugin includes the following additional features:</p>\n<h3>DELIVERY TRACKING.</h3>\n<p>Provide your customers with the ability to track their deliveries by giving them access to a map showing their home address, store address, and the delivery driver&#8217;s location.</p>\n<p>Additionally, let them know the estimated time of arrival and give them the option to view the driver&#8217;s image, name, and vehicle details.</p>\n<p>They can even call the driver directly if needed.</p>\n<h3>FULLY ADMIN DRIVERS DASHBOARD.</h3>\n<p>The dashboard provides a comprehensive overview of your drivers and orders, including the number of orders each driver has in different statuses, the number of orders without an assigned driver, and the number of orders ready to be claimed.</p>\n<p>The statuses list displays all active drivers, their availability, and claim permissions.</p>\n<p>From the dashboard, store owners can easily update the statuses of all drivers with just one click.</p>\n<h3>ADMIN ORDERS FILTERS.</h3>\n<p>The store owners can filter orders with or without drivers, specific driver orders, and more.</p>\n<h3>MANAGE DRIVERS.</h3>\n<p>The store owners can view and manage driver information, account status, work availability, and claim permission on the &#8216;users&#8217; page of the admin panel.</p>\n<p>It is easy to update each driver&#8217;s status with a single click.</p>\n<h3>ASSIGN DELIVERY DRIVERS TO ORDERS.</h3>\n<p>The following options are available for assigning delivery drivers to orders:</p>\n<ul>\n<li>\n<p>Bulk assigns multiple delivery drivers to orders from the admin panel.</p>\n</li>\n<li>\n<p>Automatically assign available delivery drivers to orders.</p>\n</li>\n<li>\n<p>Allow delivery drivers to claim orders that are in the process status.</p>\n</li>\n</ul>\n<h3>ROUTE PLANNING AND NAVIGATION.</h3>\n<p>The delivery driver can use the route planning and navigation features to plan their route and get directions to their destination.</p>\n<ul>\n<li>\n<p>Optimize route by distance: This feature allows delivery drivers to find the shortest path to their destination.</p>\n</li>\n<li>\n<p>Plan route manually: This feature allows delivery drivers to customize their route according to their preferences.</p>\n</li>\n<li>\n<p>Navigation with Waze, Apple Maps, and Google Maps: The delivery driver can use any of these popular navigation apps to get directions to their destination.</p>\n</li>\n<li>\n<p>Travel modes in directions: Delivery drivers can choose the mode of transportation they will use, such as driving, walking, biking, or using public transit.</p>\n</li>\n<li>\n<p>Next delivery: After completing a delivery, the delivery driver can easily navigate to their next destination on their route.</p>\n</li>\n</ul>\n<h3>DRIVERS READY DELIVERY NOTES.</h3>\n<p>The ready delivery notes feature allows delivery drivers to add notes or information about an order easily.</p>\n<p>This can help communicate essential details or provide updates about the delivery process.</p>\n<h3>PROOF OF DELIVERY.</h3>\n<p>The proof of delivery feature includes the following options:</p>\n<ul>\n<li>\n<p>Signature: The driver can have the customer sign to confirm receipt of the delivery.</p>\n</li>\n<li>\n<p>Photo: The driver can take a photo as evidence that the delivery was completed.</p>\n</li>\n</ul>\n<p>These options provide a way for the driver to confirm that the delivery was successfully completed and can serve as documentation in case of any issues or disputes.</p>\n<h3>DELIVERY DETAILS.</h3>\n<p>The customer can access important information about the delivery of their order in both their emails and on the order page in their account.</p>\n<p>This information includes:</p>\n<ul>\n<li>\n<p>Estimated time of arrival: This is the expected time that the delivery will arrive at the customer&#8217;s location.</p>\n</li>\n<li>\n<p>Driver details: The customer is provided with the driver&#8217;s name and photo.</p>\n</li>\n<li>\n<p>Call the driver: The customer can quickly call the driver if they need to communicate with them.</p>\n</li>\n<li>\n<p>Driver vehicle details: The customer is provided with the type of vehicle being used for the delivery and the license plate number.</p>\n</li>\n<li>\n<p>Signature: The customer can view their signature as confirmation of delivery receipt.</p>\n</li>\n<li>\n<p>Proof of delivery: The customer can view a photo taken by the driver as evidence that the delivery was completed.</p>\n</li>\n</ul>\n<h3>DRIVERS COMMISSIONS.</h3>\n<p>The drivers commissions feature allows delivery drivers to view their commission earnings for each delivery.</p>\n<p>The admin also has access to a full report of drivers&#8217; commissions, which can be sorted by dates.</p>\n<p>This feature helps ensure that drivers are accurately compensated for their deliveries and provides transparency in the payment process.</p>\n<h3>BRANDING &#8211; ADD YOUR BRAND.</h3>\n<p>The branding feature allows you to customize the driver&#8217;s panel with your logo, text, and colors to represent your brand.</p>\n<p>This can help to create a consistent and professional appearance for your business.</p>\n<h3>THIRD-PARTY PLUGINS SUPPORT &#8211; CUSTOM FIELDS.</h3>\n<p>The third-party plugins support &#8211; custom fields feature allows you to add custom text fields for orders to the driver&#8217;s panel from third-party plugins such as delivery slots, etc.</p>\n<p>This feature provides flexibility and customization options for your business, allowing you to include additional information as needed.</p>\n<h3>MULTIVENDOR MARKETPLACE PLUGINS SUPPORT.</h3>\n<p>The multivendor marketplace plugins support feature allows the plugin to work with multivendor plugins such as Dokan, WCfM, and WCMP.</p>\n<p>With this feature, drivers can view the vendor&#8217;s pickup addresses and use the call and navigation functions to reach their location.</p>\n<h3>WHATSAPP, SMS &amp; EMAILS NOTIFICATIONS.</h3>\n<p>The WhatsApp, SMS and email notifications feature sends updates to delivery drivers and customers through WhatsApp, SMS, and email.</p>\n<p>The WhatsApp and SMS notifications are powered by the Twilio SMS provider.</p>\n<p>This feature helps to keep everyone informed and up-to-date on the delivery process.</p>\n<h3>WhatsApp / SMS / EMAIL to the Driver</h3>\n<p>The WhatsApp, SMS and email notifications feature sends updates to delivery drivers through WhatsApp, SMS, and email when they are assigned to an order.</p>\n<p>This helps ensure that drivers know their delivery assignments and can plan their routes accordingly.</p>\n<h3>WhatsApp / SMS / EMAIL to the Customer</h3>\n<p>The WhatsApp, SMS and email notifications feature sends updates to the customer through WhatsApp, SMS, and email at different stages of the delivery process.</p>\n<p>When the order is out for delivery, the customer will receive a notification.</p>\n<p>The customer will also receive a notification when the driver begins the delivery.</p>\n<p>This helps to keep the customer informed and aware of the status of their order.</p>\n<h3>EMAIL to the Vendor</h3>\n<p>The email notifications feature sends updates to the vendor through email when a delivery driver is assigned to an order.</p>\n<p>This helps to ensure that the vendor is aware of the delivery arrangements and can prepare the order for pickup.</p>\n<h3>EMAIL to the Admin</h3>\n<p>The email notifications feature sends updates to the admin through email at different stages of the delivery process.</p>\n<p>When a delivery driver claims a new order, the admin will receive a notification.</p>\n<p>The admin will also receive a notification when the order is successfully delivered.</p>\n<p>This helps to keep the admin informed and aware of the status of orders and the progress of deliveries.</p>\n<h3>DELIVERY DRIVER’S APPLICATION</h3>\n<p>The delivery driver&#8217;s application feature allows drivers to apply to become store drivers.</p>\n<p>This process helps to ensure that only qualified and reliable drivers are selected to represent the store and complete deliveries.</p>\n<h3>ORDERS NOTES</h3>\n<p>The orders notes feature allows users to add specific notes to orders, including the names of individuals and other relevant details.</p>\n<p>This can help to provide more context and information about the order and assist with the delivery process.</p>\n<h3>NOTES FOR THE DRIVERS</h3>\n<p>The notes for drivers feature allows store owners to write a message or note for the driver on each order.</p>\n<p>The driver can view this message on the driver&#8217;s panel, which can help provide important information or instructions related to the delivery.</p>\n<p>This feature helps to improve communication and coordination between the store and the driver.</p>\n<h3>SUPPORTED ADD-ONS AND PLUGINS</h3>\n<p>The supported add-ons and plugins for this plugin include:</p>\n<ul>\n<li><a href=\"https://powerfulwp.com/delivery-drivers-manager/\" rel=\"nofollow ugc\">Delivery Drivers Manager</a></li>\n<li><a href=\"https://powerfulwp.com/delivery-drivers-for-woocommerce-multi-vendor-marketplace/\" rel=\"nofollow ugc\">Delivery Drivers for Vendors</a></li>\n<li><a href=\"https://powerfulwp.com/pickup-locations-for-delivery-drivers/\" rel=\"nofollow ugc\">Pickup Locations for Delivery Drivers</a></li>\n<li><a href=\"https://powerfulwp.com/pickup-and-delivery-from-customer-locations-for-woocommerce/\" rel=\"nofollow ugc\">Pickup &amp; Delivery from Customer Locations for WooCommerce</a></li>\n<li><a href=\"https://powerfulwp.com/autocomplete-address-and-location-picker-for-woocommerce-premium/\" rel=\"nofollow ugc\">Autocomplete Address and Location Picker for WooCommerce</a></li>\n<li><a href=\"https://powerfulwp.com/distance-rate-shipping-for-woocommerce/\" rel=\"nofollow ugc\">Distance Rate Shipping for WooCommerce</a></li>\n<li><a href=\"https://powerfulwp.com/payments-for-delivery-drivers/\" rel=\"nofollow ugc\">Payments for Delivery Drivers</a></li>\n<li><a href=\"https://powerfulwp.com/order-picking-for-woocommerce/\" rel=\"nofollow ugc\">Order Picking for WooCommerce</a></li>\n</ul>\n<p>These add-ons and plugins provide additional functionality and customization options for the delivery process.</p>\n<h3>CREDIT</h3>\n<p><a href=\"https://fontawesome.com/license\" rel=\"nofollow ugc\">SVG created by fontawesome &#8211; www.fontawesome.com</a><br />\n<a href=\"https://www.freepik.com\" rel=\"nofollow ugc\">Design vector created by Freepik &#8211; Freepik.com</a></p>\n",
        "installation": "<p>To install this plugin, you will need to follow these steps:</p>\n<p>1.Create a backup of your website and database to ensure that you have a copy of your data in case anything goes wrong during the installation process.<br />\n1.Download the plugin from the specified source.<br />\n1.Upload the plugin to the wp-content/plugins directory on your WordPress website.<br />\n1.Go to the &#8220;plugins&#8221; page in your WordPress admin dashboard, and click on the &#8220;activate&#8221; button for the plugin.<br />\n1.After activation, you should see the &#8220;Delivery Driver&#8221; option in the left navigation bar of your WordPress admin dashboard.</p>\n<p>Store address<br />\nIt is important to ensure that your store address is correctly set up before using the Delivery Driver plugin. Here is how you can do this:</p>\n<ol>\n<li>Click on the &#8220;WooCommerce&#8221; link in the left menu of your WordPress admin dashboard.</li>\n<li>Click on the &#8220;settings&#8221; option.</li>\n<li>On the settings page, you will see a section for &#8220;Store Address.&#8221; Ensure this is correctly set up with your store&#8217;s address information.</li>\n<li>Save your changes once you are finished. This will ensure that your store address is correctly displayed and used by the plugin</li>\n</ol>\n",
        "faq": "\n<dt id='is%20this%20plugin%20easy%20to%20use%3F'>\nIs this plugin easy to use?\n</h4>\n<p>\n<p>Yes, the plugin is designed to be user-friendly and intuitive. Store owners and delivery drivers should be able to easily navigate and use the features of the plugin.</p>\n</p>\n<dt id='how%20to%20add%20a%20new%20delivery%20driver%20to%20woocommerce%3F'>\nHow to Add a New Delivery Driver to WooCommerce?\n</h4>\n<p>\n<ol>\n<li>Go to the &#8216;Users&#8217; section in your WordPress admin panel.</li>\n<li>Click &#8216;Add New User&#8217;.</li>\n<li>Enter the driver&#8217;s first name, last name, email, and password.</li>\n<li>Select the &#8216;Delivery Driver&#8217; role.</li>\n<li>Click &#8216;Add New User&#8217;.</li>\n<li>On the user page, input the driver&#8217;s phone number and country.</li>\n<li>Click &#8216;Update User&#8217;.</li>\n</ol>\n</p>\n<dt id='how%20do%20i%20assign%20a%20delivery%20driver%20to%20a%20woocommerce%20order%3F'>\nHow do I assign a delivery driver to a WooCommerce order?\n</h4>\n<p>\n<p>To assign a delivery driver to a WooCommerce order, go to the order page in the WordPress admin dashboard.<br />\nOn the order page, you will see a selection of available drivers.<br />\nSimply select the driver you want to assign to the order and click the &#8220;Update&#8221; button.<br />\nThis will assign the selected driver to the order.</p>\n</p>\n\n",
        "changelog": "<h4>1.0.0</h4>\n<ul>\n<li>Initial release.</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Fix: Customer phone number button.</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Fix: Improved CSS.</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Fix: Improved delivery driver panel.</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>Fix: Improved delivery driver panel.</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Fix: The delivery process has been improved.</li>\n<li>Add: A new order status called &#8220;Driver assigned&#8221; has been added, all the drivers assigned orders will be in this status.</li>\n<li>Add: When the driver is assigned to order, the status change to &#8220;Driver assigned&#8221; automatically.</li>\n<li>Fix: All security alerts have been updated to be more clear.</li>\n<li>Add: A notice for not using both admin and driver panels in the same browser on the same device has been added.</li>\n<li>Add: The customer name has been added to all orders screen on the driver panel.</li>\n<li>Add: Premium &#8211; Orders filters.</li>\n<li>Fix: Premium &#8211; Orders&#8217; notes have been improved to be more specifics.</li>\n<li>Add: Premium &#8211; New Dashboard screen has been added to the plugin menu.</li>\n<li>Add: Premium &#8211; How many orders each driver has in each status.</li>\n<li>Add: Premium &#8211; How many orders don’t have a driver.</li>\n<li>Add: Premium &#8211; How many orders are ready to claim.</li>\n<li>Add: Premium &#8211; List of all your active drivers,  availability, and claim permissions all statuses can be updated in one click.</li>\n<li>Add: Premium &#8211; Admin users screen with drivers statuses updates in one click.</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Fix: Order status automatically changes to &#8220;driver assigned&#8221; only when a driver has been assigned to order that in processing status.</li>\n<li>Fix: Drivers panel screen titles by current status names.</li>\n<li>Fix: Drivers panel gets the site favicon if exist.</li>\n<li>Fix: Premium &#8211; Distance unit system by country.</li>\n<li>Add: Premium &#8211; Navigation with Waze, apple maps, and google maps.</li>\n<li>Add: Premium &#8211; Drivers Panel Branding &#8211; Add your logo and colors.</li>\n<li>Add: Premium &#8211; Custom Fields &#8211; Add custom fields to the delivery panel from third-party plugins.</li>\n<li>Add: Premium &#8211; Drivers Commissions.</li>\n<li>Add: Premium &#8211; Drivers notes added to emails.</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Fix: Texts.</li>\n<li>Fix: Assign a driver edit permission.</li>\n<li>Fix: Style.</li>\n<li>Fix: Driver display name.</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>Fix: UTF-8.</li>\n<li>Fix: Texts.</li>\n<li>Fix: Shipping address format.</li>\n</ul>\n<h4>1.3.0</h4>\n<ul>\n<li>Fix: Driver panel UI.</li>\n<li>Fix: Images lazyload.</li>\n<li>Fix: Map address.</li>\n<li>Fix: Texts.</li>\n<li>Add: Texts.</li>\n<li>Add: Premium &#8211; Proof of Delivery &#8211; signature</li>\n<li>Add: Premium &#8211; Proof of Delivery &#8211; photo</li>\n<li>Add: Premium &#8211; Customer order page &#8211; drivers details + call the driver</li>\n<li>Add: Premium &#8211; Customer emails &#8211; drivers details + call the driver</li>\n<li>Add: Premium &#8211; Drivers photo, veichel type, license number.</li>\n</ul>\n<h4>1.3.1</h4>\n<ul>\n<li>Fix: Driver upload photo button.</li>\n</ul>\n<h4>1.3.2</h4>\n<ul>\n<li>Fix: Driver delivered notes.</li>\n</ul>\n<h4>1.4.0</h4>\n<ul>\n<li>Fix: Drivers roles query.</li>\n<li>Fix: Words.</li>\n<li>Add: languages: Spanish, French, Hebrew.</li>\n<li>Add: RTL support.</li>\n<li>Add: When the driver logs out he becomes unavailable for work.</li>\n<li>Fix: Premium &#8211; Custom fields.</li>\n<li>Fix: Premium &#8211; Routes.</li>\n<li>Add: Premium &#8211; Admin drivers routes map.</li>\n</ul>\n<h4>1.4.1</h4>\n<ul>\n<li>Fix: Bug in tracking class.</li>\n</ul>\n<h4>1.4.2</h4>\n<ul>\n<li>Fix: Drivers colors in the admin map.</li>\n</ul>\n<h4>1.4.3</h4>\n<ul>\n<li>Fix: Bug in admin reports.</li>\n</ul>\n<h4>1.5.0</h4>\n<ul>\n<li>Fix: Texts updated.</li>\n<li>Add: New texts have been added.</li>\n<li>Add: Support for brazil checkout fields plugin.</li>\n<li>Add: Support for chile states plugin.</li>\n<li>Add: Driver settings page in the drivers&#8217; panel.</li>\n<li>Fix: Premium &#8211; Driver application form option.</li>\n<li>Add: Premium &#8211; Start delivery button that sends a notification to the customer that his delivery has been started and ETA.</li>\n<li>Add: Premium &#8211; Auto-assign method: 1. Equally according to the number of orders each driver has 2.Unevenly in the following order: zip code, city, state, country, and the number of orders each driver has.</li>\n<li>Add: Premium &#8211; Drivers can set their Transportation Mode and Navigation APP.</li>\n<li>Add: Premium &#8211; Driver can see the order details from the claim orders screen.</li>\n<li>Add: Premium &#8211; Pickup info: call option and navigate on the driver panel order page.</li>\n</ul>\n<h4>1.6.1</h4>\n<ul>\n<li>Add: Driver page name has been changed for new installations.</li>\n<li>Fix: Local Dates.</li>\n<li>Fix: Order Numbers.</li>\n<li>Fix: Premium &#8211; Orders that have a local pickup or virtual products are blocked from auto-assign and claim orders.</li>\n<li>Fix: Premium &#8211; We split the plan route button into two buttons, one for optimizing route and one for manually.</li>\n<li>Add: Premium &#8211; Enable drivers info to customers on email and order page.</li>\n<li>Add: Premium &#8211; Vendor Pickup address, phone and navigation on the driver panel for dokan, wcfm and wcmp plugins.</li>\n<li>Add: Premium &#8211; Disable auto assign drivers option for shipping method.</li>\n<li>Add: Premium &#8211; Bulk update status to out for delivery.</li>\n</ul>\n<h4>1.6.3</h4>\n<ul>\n<li>Fix: Update user options for the driver role.</li>\n<li>Fix: is_virtual function bug.</li>\n<li>Fix: wordpress version 5.7 php notices.</li>\n</ul>\n<h4>1.6.4</h4>\n<ul>\n<li>Add: Filters and actions.</li>\n<li>Add: Add-ons support.</li>\n</ul>\n<h4>1.6.6</h4>\n<ul>\n<li>Fix: Currency Format.</li>\n<li>Fix: Payment method title.</li>\n<li>Add: Customer email to the customer info on the driver panel.</li>\n<li>Add: 2 google API keys for application restrictions.</li>\n</ul>\n<h4>1.7.0</h4>\n<ul>\n<li>Fix: Route address.</li>\n<li>Dev: The function lddfw_format_address has been modified and removed from the store class.</li>\n<li>Add: Add Weight on the driver order page.</li>\n<li>Add: Add Product metadata on the order page.</li>\n<li>Add: Premium &#8211; Driver can change origin and destination on route.</li>\n<li>Tweak: Premium &#8211; New custom pages on the driver panel.  </li>\n<li>Tweak: Premium &#8211; New Commission &#8211; distance-based pricing.</li>\n<li>Tweak: Premium &#8211; Enable auto-assigns and claim orders options for orders that contain virtual items.</li>\n<li>Tweak: Premium &#8211; New Settings: Driver permission, show and hide prices, order products, commission on the driver panel.</li>\n</ul>\n<h4>1.7.1</h4>\n<ul>\n<li>Fix: Premium &#8211; round commission.</li>\n<li>Fix: Premium &#8211; texts.</li>\n<li>Fix: Hide costs from order page.</li>\n</ul>\n<h4>1.7.2</h4>\n<ul>\n<li>Fix: Premium &#8211; route error.</li>\n</ul>\n<h4>1.7.4</h4>\n<ul>\n<li>Add: Texts.</li>\n<li>Fix: Improve query performance.</li>\n<li>Fix: Improve code quality.</li>\n<li>Fix: PHP Notices.</li>\n<li>Fix: Freemius SDK for add-ons.</li>\n<li>Fix: WordPress coding standards.</li>\n<li>Add: Premium &#8211; New custom field section &#8211; order pickup.  </li>\n<li>Add: Premium &#8211; Route address statues.</li>\n<li>Tweak: Premium &#8211; Multisite network support.</li>\n<li>Tweak: Premium &#8211; New email notifications: email to the vendor when a delivery driver has been assigned to order.</li>\n<li>Tweak: Premium &#8211; New email notifications: email to the admin when a new driver has been claimed order.</li>\n</ul>\n<h4>1.7.6</h4>\n<ul>\n<li>Fix: virtual products error.</li>\n<li>Fix: Style.</li>\n<li>Tweak: Improving plugin speed performance with a new sync table.</li>\n</ul>\n<h4>1.7.7</h4>\n<ul>\n<li>Fix: Lazyload for iframe.</li>\n<li>Fix: Translation words.</li>\n<li>Add: WordPress 5.8 support.</li>\n<li>Add: Premium &#8211; Coordinates support for routes.</li>\n</ul>\n<h4>1.7.8</h4>\n<ul>\n<li>Add: Premium notice.</li>\n</ul>\n<h4>1.7.9</h4>\n<ul>\n<li>Tweak: Premium &#8211; Product details on the delivery drivers panel.</li>\n<li>Tweak: Premium &#8211; WhatsApp notifications with Twilio provider.</li>\n</ul>\n<h4>1.8.1</h4>\n<ul>\n<li>Tweak: Premium &#8211; Driver tracking.</li>\n<li>Tweak: Premium &#8211; Tracking page for customers.</li>\n<li>Add: Premium &#8211; Notes for drivers.</li>\n<li>Add: Premium &#8211; New Claim orders limitation.</li>\n<li>Add: Premium &#8211; New Auto-assign options.</li>\n<li>Add: Premium &#8211; Store, drivers, sellers address coordinates.</li>\n<li>Add: Premium &#8211; New buttons on the drivers panel order page ( claim, unassigned, out for delivery ).</li>\n<li>Add: Premium &#8211; Auto load new orders on the drivers panel assigned to driver page.</li>\n<li>Add: Russian language.</li>\n<li>Add: German language.</li>\n<li>Add: Italian language.</li>\n</ul>\n<h4>1.8.2</h4>\n<ul>\n<li>Fix: Premium &#8211; Tracking page Improvement.</li>\n</ul>\n<h4>1.8.4</h4>\n<ul>\n<li>Tweak: The Arabic language added.</li>\n<li>Tweak: Premium &#8211; Add multiple pickup locations for multivendor parent order on drivers panel order page.</li>\n<li>Dev: Add new get_pickup_type function to get the pickup type.</li>\n<li>Dev: Add new lddfw_pickup_type filter to allow tuning of pickup type.</li>\n<li>Dev: Add new get_pickup_phone function to get the pickup phone number.</li>\n<li>Dev: Add new lddfw_pickup_phone filter to allow tuning of pickup phone number.</li>\n<li>Dev: Add new lddfw_pickup_location filter to allow tuning of pickup location.</li>\n<li>Dev: Update lddfw_pickup_address function.</li>\n<li>Fix: fix pickup city array if is empty.</li>\n<li>Fix: fix custom fields layout.</li>\n<li>Fix: Hide some product variations on drivers panel order page.</li>\n<li>Dev: New function get_order_pickup_geocode to get the pickup location geocode.</li>\n<li>Dev: New filter lddfw_get_order_pickup_geocode to allow tuning of pickup location geocode.</li>\n</ul>\n<h4>1.8.5</h4>\n<ul>\n<li>Tweak: Free &#8211; New setting option &#8211; Set store coordinates.</li>\n<li>Tweak: Premium &#8211; New driver panel dark mode.</li>\n<li>Tweak: Premium &#8211; Direction added to the driver panel order page.</li>\n<li>Tweak: Premium &#8211; New setting option &#8211; Set driver tracking interval.</li>\n<li>Tweak: Premium &#8211; New setting option &#8211; Add minutes to the ETA.</li>\n<li>Tweak: Premium &#8211; Delivery countdown timer added to the delivery driver order page.</li>\n<li>Tweak: Premium &#8211; New driver permission &#8211; view customer details.</li>\n<li>Tweak: Premium &#8211; New driver permission &#8211; view customer billing address.</li>\n<li>Tweak: Premium &#8211; New driver permission &#8211; view customer WhatsApp button.</li>\n<li>Add: Centered maps.</li>\n<li>Add: Add map language to maps.</li>\n<li>Add: Map styles updated.</li>\n<li>Add: The embedded map on the driver panel order page replaced with the Maps JavaScript API.</li>\n<li>Fix: The plugin settings have been reordered.</li>\n<li>Fix: The driver panel order page sections have been reordered.</li>\n<li>Fix: Add order details button on the driver panel orders screens.</li>\n<li>Fix: The map has been hidden on the driver panel order page for delivered orders.</li>\n<li>Fix: Customer email removed from driver panel.</li>\n<li>Dev: New function lddfw_get_app_mode.</li>\n<li>Dev: New function lddfw_get_map_language.</li>\n<li>Dev: New function lddfw_get_map_center.</li>\n</ul>\n<h4>1.8.6</h4>\n<ul>\n<li>Tweak: Premium &#8211; Added current week and last week dates to admin reports and driver panel.</li>\n<li>Tweak: Premium &#8211; Added payment methods to reports.</li>\n<li>Tweak: Premium &#8211; New driver commissions calculation: time, distance + time.</li>\n<li>Tweak: Show custom order numbers on the driver panel.</li>\n<li>Add: Loading indicator.</li>\n<li>Add: Protected custom fields that start with Underscore can be written with brackets.</li>\n<li>Fix: translation.</li>\n</ul>\n<h4>1.8.7</h4>\n<ul>\n<li>Tweak: Premium &#8211; New settings options &#8211; Taking a signature or photo is mandatory.</li>\n<li>Tweak: Premium &#8211; New settings options &#8211; Enable auto assign drivers to suborders if exist.</li>\n<li>Tweak: Premium &#8211; Disable claim orders by shipping method.</li>\n<li>Fix: Enable links on the driver panel product description.</li>\n<li>Fix: Russian translation.</li>\n<li>Fix: App mode on the admin user edit page.</li>\n<li>Fix: Style.</li>\n</ul>\n<h4>1.8.8</h4>\n<ul>\n<li>Tweak: Test Your Google Keys on settings.</li>\n</ul>\n<h4>1.8.9</h4>\n<ul>\n<li>Add: Premium &#8211; Option to change the admin recipient email.</li>\n<li>Fix: Order item meta.</li>\n<li>Tweak: Latest freemium SDK.</li>\n<li>Dev: Default option for the shipping settings.</li>\n<li>Add: Tested up to: 6.2</li>\n<li>Fix: javascript on the driver panel.</li>\n<li>Fix: Css.</li>\n<li>Fix: Bugs.</li>\n</ul>\n<h4>1.9.0</h4>\n<ul>\n<li>Fix: bug on order refund.</li>\n<li>Fix: Twilio API.</li>\n<li>Fix: Improve the route queries.</li>\n<li>Tweak: Latest freemium SDK.</li>\n</ul>\n<h4>1.9.1</h4>\n<ul>\n<li>Fix: Premium &#8211; user account security fix.</li>\n<li>Tweak: Premium &#8211; New sms and whatsapp notifications.</li>\n<li>Tweak: Portuguese (Brazil) language</li>\n<li>Tweak: Freemius SDK version 2.6.1.</li>\n</ul>\n<h4>1.9.3</h4>\n<ul>\n<li>Tweak: Woocommerce HPOS feature support.</li>\n<li>Tweak: Freemius SDK version 2.6.2.</li>\n</ul>\n<h4>1.9.4</h4>\n<ul>\n<li>Fix: Order type error.</li>\n<li>Tweak: Freemius SDK version 2.7.2.</li>\n</ul>\n"
    },
    "short_description": "Improve the way you deliver, manage drivers, assign drivers to orders, send WhatsApp, SMS, and email notifications, route planning, navigation &amp; more!",
    "description": "<p>Developed by <a href=\"https://powerfulwp.com/\" rel=\"nofollow ugc\">PowerfulWP</a> | <a href=\"https://powerfulwp.com/local-delivery-drivers-for-woocommerce-premium/\" rel=\"nofollow ugc\">Premium</a> | <a href=\"https://powerfulwp.com/docs/local-delivery-drivers-for-woocommerce-premium/\" rel=\"nofollow ugc\">Documents</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/lvMRSKTU0Ro?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span><br />\n* Several premium features are demonstrated in the video and images.</p>\n<h3>Improve the way you deliver, manage drivers, assign drivers to orders, send WhatsApp, SMS, email notifications, route planning, navigation &amp; more!</h3>\n<h3>LOCAL DELIVERY DRIVERS FOR WOOCOMMERCE</h3>\n<p>The Local Delivery Drivers for WooCommerce plugin is a powerful tool that streamlines the delivery process for store owners and drivers.</p>\n<p>With this plugin, store owners can easily assign orders to drivers, and drivers can manage their deliveries with a mobile-friendly panel.</p>\n<p>The plugin also allows store owners to send notifications to drivers and customers via WhatsApp, SMS, and email, and includes a feature for planning routes with navigation.</p>\n<h3>WHO CAN USE THIS PLUGIN?</h3>\n<p>The &#8220;Local Delivery Drivers for WooCommerce&#8221; plugin is suitable for any delivery service that uses WooCommerce and WordPress.</p>\n<p>Some examples of businesses that may benefit from using this plugin include:</p>\n<ul>\n<li>Grocery stores and supermarkets</li>\n<li>Restaurants and food delivery services</li>\n<li>Florists and flower shops</li>\n<li>Alcohol delivery services</li>\n<li>Pharmacies and medical supply stores</li>\n<li>Pet stores and animal supply stores</li>\n<li>Home and garden supply stores</li>\n<li>Furniture stores and home decor retailers</li>\n<li>Electronics stores and appliance retailers</li>\n<li>Toy stores and children&#8217;s retailers</li>\n<li>Sporting goods stores and outdoor retailers</li>\n<li>Clothing and fashion retailers</li>\n<li>Book stores </li>\n<li>Art supply stores and hobby stores</li>\n<li>Baby supply stores and children&#8217;s retailers</li>\n<li>Party supply stores</li>\n<li>Office supply stores and business supply retailers</li>\n<li>Cannabis and medical marijuana dispensaries</li>\n<li>Cleaning companies and home services providers</li>\n<li>Laundry and dry cleaning services</li>\n<li>Carpet cleaning services and home services providers</li>\n<li>Bakery or pastry shops</li>\n<li>Health food stores and natural or organic food retailers</li>\n<li>Gift shops and specialty retailers</li>\n<li>Printer ink and toner suppliers</li>\n<li>Clothing delivery companies and online fashion retailers</li>\n<li>Home delivery meal kit services</li>\n<li>Handmade or unique home decor items and furniture</li>\n<li>Natural or organic beauty and personal care products</li>\n<li>Online art galleries</li>\n<li>Vintage or secondhand clothing and accessories retailers</li>\n<li>Outdoor gear or adventure equipment retailers</li>\n<li>Musical instrument stores and record stores</li>\n<li>Health supplement and wellness product retailers</li>\n<li>Handmade jewelry and accessory stores</li>\n<li>Luxury or high-end fashion retailers</li>\n<li>Subscription box services for a specific niche (e.g., coffee, tea, snacks, crafts)</li>\n<li>Online plant nurseries or garden centers</li>\n<li>Any other business that involves local delivery of physical goods.</li>\n</ul>\n<h3>Features</h3>\n<h3>New Delivery Drivers User Role</h3>\n<p>This plugin adds a new user role called &#8216;Delivery Drivers&#8217; to your WooCommerce store.</p>\n<p>The store owner can use this role to manage delivery driver details, work availability, and order assignments.</p>\n<p>With this feature, you can easily keep track of your delivery team and streamline your order fulfillment process.</p>\n<h3>New Delivery Statuses for your WooCommerce store</h3>\n<p>This plugin enhances your WooCommerce store by introducing three order statuses to track better and manage the delivery process.</p>\n<p>These statuses are: &#8216;Driver Assigned,&#8217; &#8216;Failed Delivery Attempt,&#8217; and &#8216;Out for Delivery.&#8217;<br />\nThese updates will keep your customers informed and help your business run smoothly.</p>\n<ul>\n<li>\n<p>&#8220;Driver Assigned&#8221; &#8211; This status shows that a delivery driver has been assigned to the order. It helps you track which driver is handling which deliveries.</p>\n</li>\n<li>\n<p>&#8220;Failed Delivery Attempt&#8221; &#8211; If a delivery driver tries to deliver an order but is unable to (e.g. the customer is not home or the delivery address is incorrect), this status records the failed attempt. It helps you track any issues that may have occurred during the delivery process and communicate with customers about when to expect a second attempt.</p>\n</li>\n<li>\n<p>&#8220;Out for Delivery&#8221; &#8211; This status shows that the delivery driver is in the process of delivering the order. In addition, it indicates that the shipment is on its way to the customer and is expected to arrive soon.</p>\n</li>\n</ul>\n<h3>ASSIGNING DELIVERY DRIVERS TO ORDERS</h3>\n<p>The store owner has the ability to assign delivery drivers to orders on the admin panel&#8217;s order page.</p>\n<p>Once a delivery driver is assigned to an order, the order&#8217;s status will be updated to &#8216;Driver assigned.</p>\n<h3>ORDERS NOTES</h3>\n<p>The &#8220;Local Delivery Drivers for WooCommerce&#8221; plugin saves all actions the delivery driver takes on the order notes.</p>\n<p>This allows you to track the progress of each delivery and see any comments or updates made by the driver.</p>\n<p>By keeping a record of all delivery-related activities on the order notes, you can improve communication and transparency within your team, ultimately leading to more efficient and successful deliveries.</p>\n<h3>DELIVERY DRIVERS MOBILE-FRIENDLY PANEL</h3>\n<p>The &#8220;Local Delivery Drivers for WooCommerce&#8221; plugin includes a mobile-friendly panel that allows delivery drivers to manage their deliveries from their smartphones.</p>\n<p>The panel has a convenient, app-like interface and can be added to the mobile homepage for easy access.</p>\n<p>The delivery drivers panel includes screens for each order status, including a dashboard, driver assigned orders, out for delivery, failed delivery, and delivered orders.</p>\n<p>On the dashboard, drivers can update their availability and view the total number of orders in each status.</p>\n<p>The &#8220;driver assigned&#8221; screen shows all orders assigned to the driver, while the &#8220;out for delivery&#8221; screen displays all orders on the current delivery route.</p>\n<p>The &#8220;failed delivery&#8221; and &#8220;delivered&#8221; screens allow drivers to view their completed orders from today, yesterday, this month, and last month.</p>\n<p>Overall, the delivery drivers panel provides an easy-to-use interface for managing deliveries on the go.</p>\n<h3>ORDER PAGE SCREEN</h3>\n<p>On the order page, delivery drivers can view all the relevant details for an order, such as the billing and shipping addresses, items included in the order, and any comments left by the customer or dispatch center.</p>\n<p>They can also easily update the order&#8217;s status to &#8220;delivered&#8221; or &#8220;failed attempt&#8221; and leave comments for other team members to see.</p>\n<p>Additionally, the delivery driver can quickly call the customer or dispatch center directly from the order page if needed.</p>\n<h3>Supported languages</h3>\n<p>English, Spanish, French, Hebrew, Portuguese, Russian, German, Italian, and Arabic.</p>\n<h3>* PREMIUM FEATURES</h3>\n<p>Check out the <a href=\"https://powerfulwp.com/local-delivery-drivers-for-woocommerce-premium/\" rel=\"nofollow ugc\">Local Delivery Drivers for WooCommerce Premium</a> plugin.<br />\nThe premium plugin includes the following additional features:</p>\n<h3>DELIVERY TRACKING.</h3>\n<p>Provide your customers with the ability to track their deliveries by giving them access to a map showing their home address, store address, and the delivery driver&#8217;s location.</p>\n<p>Additionally, let them know the estimated time of arrival and give them the option to view the driver&#8217;s image, name, and vehicle details.</p>\n<p>They can even call the driver directly if needed.</p>\n<h3>FULLY ADMIN DRIVERS DASHBOARD.</h3>\n<p>The dashboard provides a comprehensive overview of your drivers and orders, including the number of orders each driver has in different statuses, the number of orders without an assigned driver, and the number of orders ready to be claimed.</p>\n<p>The statuses list displays all active drivers, their availability, and claim permissions.</p>\n<p>From the dashboard, store owners can easily update the statuses of all drivers with just one click.</p>\n<h3>ADMIN ORDERS FILTERS.</h3>\n<p>The store owners can filter orders with or without drivers, specific driver orders, and more.</p>\n<h3>MANAGE DRIVERS.</h3>\n<p>The store owners can view and manage driver information, account status, work availability, and claim permission on the &#8216;users&#8217; page of the admin panel.</p>\n<p>It is easy to update each driver&#8217;s status with a single click.</p>\n<h3>ASSIGN DELIVERY DRIVERS TO ORDERS.</h3>\n<p>The following options are available for assigning delivery drivers to orders:</p>\n<ul>\n<li>\n<p>Bulk assigns multiple delivery drivers to orders from the admin panel.</p>\n</li>\n<li>\n<p>Automatically assign available delivery drivers to orders.</p>\n</li>\n<li>\n<p>Allow delivery drivers to claim orders that are in the process status.</p>\n</li>\n</ul>\n<h3>ROUTE PLANNING AND NAVIGATION.</h3>\n<p>The delivery driver can use the route planning and navigation features to plan their route and get directions to their destination.</p>\n<ul>\n<li>\n<p>Optimize route by distance: This feature allows delivery drivers to find the shortest path to their destination.</p>\n</li>\n<li>\n<p>Plan route manually: This feature allows delivery drivers to customize their route according to their preferences.</p>\n</li>\n<li>\n<p>Navigation with Waze, Apple Maps, and Google Maps: The delivery driver can use any of these popular navigation apps to get directions to their destination.</p>\n</li>\n<li>\n<p>Travel modes in directions: Delivery drivers can choose the mode of transportation they will use, such as driving, walking, biking, or using public transit.</p>\n</li>\n<li>\n<p>Next delivery: After completing a delivery, the delivery driver can easily navigate to their next destination on their route.</p>\n</li>\n</ul>\n<h3>DRIVERS READY DELIVERY NOTES.</h3>\n<p>The ready delivery notes feature allows delivery drivers to add notes or information about an order easily.</p>\n<p>This can help communicate essential details or provide updates about the delivery process.</p>\n<h3>PROOF OF DELIVERY.</h3>\n<p>The proof of delivery feature includes the following options:</p>\n<ul>\n<li>\n<p>Signature: The driver can have the customer sign to confirm receipt of the delivery.</p>\n</li>\n<li>\n<p>Photo: The driver can take a photo as evidence that the delivery was completed.</p>\n</li>\n</ul>\n<p>These options provide a way for the driver to confirm that the delivery was successfully completed and can serve as documentation in case of any issues or disputes.</p>\n<h3>DELIVERY DETAILS.</h3>\n<p>The customer can access important information about the delivery of their order in both their emails and on the order page in their account.</p>\n<p>This information includes:</p>\n<ul>\n<li>\n<p>Estimated time of arrival: This is the expected time that the delivery will arrive at the customer&#8217;s location.</p>\n</li>\n<li>\n<p>Driver details: The customer is provided with the driver&#8217;s name and photo.</p>\n</li>\n<li>\n<p>Call the driver: The customer can quickly call the driver if they need to communicate with them.</p>\n</li>\n<li>\n<p>Driver vehicle details: The customer is provided with the type of vehicle being used for the delivery and the license plate number.</p>\n</li>\n<li>\n<p>Signature: The customer can view their signature as confirmation of delivery receipt.</p>\n</li>\n<li>\n<p>Proof of delivery: The customer can view a photo taken by the driver as evidence that the delivery was completed.</p>\n</li>\n</ul>\n<h3>DRIVERS COMMISSIONS.</h3>\n<p>The drivers commissions feature allows delivery drivers to view their commission earnings for each delivery.</p>\n<p>The admin also has access to a full report of drivers&#8217; commissions, which can be sorted by dates.</p>\n<p>This feature helps ensure that drivers are accurately compensated for their deliveries and provides transparency in the payment process.</p>\n<h3>BRANDING &#8211; ADD YOUR BRAND.</h3>\n<p>The branding feature allows you to customize the driver&#8217;s panel with your logo, text, and colors to represent your brand.</p>\n<p>This can help to create a consistent and professional appearance for your business.</p>\n<h3>THIRD-PARTY PLUGINS SUPPORT &#8211; CUSTOM FIELDS.</h3>\n<p>The third-party plugins support &#8211; custom fields feature allows you to add custom text fields for orders to the driver&#8217;s panel from third-party plugins such as delivery slots, etc.</p>\n<p>This feature provides flexibility and customization options for your business, allowing you to include additional information as needed.</p>\n<h3>MULTIVENDOR MARKETPLACE PLUGINS SUPPORT.</h3>\n<p>The multivendor marketplace plugins support feature allows the plugin to work with multivendor plugins such as Dokan, WCfM, and WCMP.</p>\n<p>With this feature, drivers can view the vendor&#8217;s pickup addresses and use the call and navigation functions to reach their location.</p>\n<h3>WHATSAPP, SMS &amp; EMAILS NOTIFICATIONS.</h3>\n<p>The WhatsApp, SMS and email notifications feature sends updates to delivery drivers and customers through WhatsApp, SMS, and email.</p>\n<p>The WhatsApp and SMS notifications are powered by the Twilio SMS provider.</p>\n<p>This feature helps to keep everyone informed and up-to-date on the delivery process.</p>\n<h3>WhatsApp / SMS / EMAIL to the Driver</h3>\n<p>The WhatsApp, SMS and email notifications feature sends updates to delivery drivers through WhatsApp, SMS, and email when they are assigned to an order.</p>\n<p>This helps ensure that drivers know their delivery assignments and can plan their routes accordingly.</p>\n<h3>WhatsApp / SMS / EMAIL to the Customer</h3>\n<p>The WhatsApp, SMS and email notifications feature sends updates to the customer through WhatsApp, SMS, and email at different stages of the delivery process.</p>\n<p>When the order is out for delivery, the customer will receive a notification.</p>\n<p>The customer will also receive a notification when the driver begins the delivery.</p>\n<p>This helps to keep the customer informed and aware of the status of their order.</p>\n<h3>EMAIL to the Vendor</h3>\n<p>The email notifications feature sends updates to the vendor through email when a delivery driver is assigned to an order.</p>\n<p>This helps to ensure that the vendor is aware of the delivery arrangements and can prepare the order for pickup.</p>\n<h3>EMAIL to the Admin</h3>\n<p>The email notifications feature sends updates to the admin through email at different stages of the delivery process.</p>\n<p>When a delivery driver claims a new order, the admin will receive a notification.</p>\n<p>The admin will also receive a notification when the order is successfully delivered.</p>\n<p>This helps to keep the admin informed and aware of the status of orders and the progress of deliveries.</p>\n<h3>DELIVERY DRIVER’S APPLICATION</h3>\n<p>The delivery driver&#8217;s application feature allows drivers to apply to become store drivers.</p>\n<p>This process helps to ensure that only qualified and reliable drivers are selected to represent the store and complete deliveries.</p>\n<h3>ORDERS NOTES</h3>\n<p>The orders notes feature allows users to add specific notes to orders, including the names of individuals and other relevant details.</p>\n<p>This can help to provide more context and information about the order and assist with the delivery process.</p>\n<h3>NOTES FOR THE DRIVERS</h3>\n<p>The notes for drivers feature allows store owners to write a message or note for the driver on each order.</p>\n<p>The driver can view this message on the driver&#8217;s panel, which can help provide important information or instructions related to the delivery.</p>\n<p>This feature helps to improve communication and coordination between the store and the driver.</p>\n<h3>SUPPORTED ADD-ONS AND PLUGINS</h3>\n<p>The supported add-ons and plugins for this plugin include:</p>\n<ul>\n<li><a href=\"https://powerfulwp.com/delivery-drivers-manager/\" rel=\"nofollow ugc\">Delivery Drivers Manager</a></li>\n<li><a href=\"https://powerfulwp.com/delivery-drivers-for-woocommerce-multi-vendor-marketplace/\" rel=\"nofollow ugc\">Delivery Drivers for Vendors</a></li>\n<li><a href=\"https://powerfulwp.com/pickup-locations-for-delivery-drivers/\" rel=\"nofollow ugc\">Pickup Locations for Delivery Drivers</a></li>\n<li><a href=\"https://powerfulwp.com/pickup-and-delivery-from-customer-locations-for-woocommerce/\" rel=\"nofollow ugc\">Pickup &amp; Delivery from Customer Locations for WooCommerce</a></li>\n<li><a href=\"https://powerfulwp.com/autocomplete-address-and-location-picker-for-woocommerce-premium/\" rel=\"nofollow ugc\">Autocomplete Address and Location Picker for WooCommerce</a></li>\n<li><a href=\"https://powerfulwp.com/distance-rate-shipping-for-woocommerce/\" rel=\"nofollow ugc\">Distance Rate Shipping for WooCommerce</a></li>\n<li><a href=\"https://powerfulwp.com/payments-for-delivery-drivers/\" rel=\"nofollow ugc\">Payments for Delivery Drivers</a></li>\n<li><a href=\"https://powerfulwp.com/order-picking-for-woocommerce/\" rel=\"nofollow ugc\">Order Picking for WooCommerce</a></li>\n</ul>\n<p>These add-ons and plugins provide additional functionality and customization options for the delivery process.</p>\n<h3>CREDIT</h3>\n<p><a href=\"https://fontawesome.com/license\" rel=\"nofollow ugc\">SVG created by fontawesome &#8211; www.fontawesome.com</a><br />\n<a href=\"https://www.freepik.com\" rel=\"nofollow ugc\">Design vector created by Freepik &#8211; Freepik.com</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/screenshot-1.png?rev=2397544",
            "caption": "Premium - Delivery Drivers Mobile-Friendly Welcome &amp; Dashboard pages."
        },
        {
            "src": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/screenshot-2.png?rev=2397544",
            "caption": "Premium - Delivery Drivers Mobile-Friendly Planing Route &amp; Route pages."
        },
        {
            "src": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/screenshot-3.png?rev=2397544",
            "caption": "Premium - Delivery Drivers Mobile-Friendly Order page."
        },
        {
            "src": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/screenshot-4.png?rev=2397544",
            "caption": "Premium - Delivery Drivers Mobile-Friendly Delivered &amp; Next Delivery pages."
        },
        {
            "src": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/screenshot-5.gif?rev=2405917",
            "caption": "Premium - Admin Drivers Dashboard."
        },
        {
            "src": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/screenshot-6.gif?rev=2405917",
            "caption": "Premium - Admin Drivers Users."
        },
        {
            "src": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/screenshot-7.png?rev=2415436",
            "caption": "Premium - Drivers Commissions."
        },
        {
            "src": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/screenshot-8.png?rev=2437895",
            "caption": "Premium - Proof of delivery - Signature."
        },
        {
            "src": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/screenshot-9.png?rev=2437895",
            "caption": "Premium - Proof of delivery - Photo."
        },
        {
            "src": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/screenshot-10.png?rev=2437895",
            "caption": "Premium - Drivers details."
        },
        {
            "src": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/screenshot-11.png?rev=2452971",
            "caption": "Premium - Admin drivers routes map."
        },
        {
            "src": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/screenshot-12.png?rev=2633196",
            "caption": "Premium - Delivery tracking."
        }
    ],
    "tags": {
        "courier": "courier",
        "delivery": "delivery",
        "drivers": "drivers",
        "shipping": "shipping",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.0.4.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.1.0.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.2.2.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.3.0.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.3.2.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.4.0.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.4.3.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.5.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.6.1.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.6.3.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.6.6.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.7.0.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.7.4.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.7.6.zip",
        "1.7.7": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.7.7.zip",
        "1.7.8": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.7.8.zip",
        "1.7.9": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.7.9.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.8.1.zip",
        "1.8.4": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.8.4.zip",
        "1.8.5": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.8.5.zip",
        "1.8.6": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.8.6.zip",
        "1.8.7": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.8.7.zip",
        "1.8.8": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.8.8.zip",
        "1.8.9": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.8.9.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.9.0.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.9.1.zip",
        "1.9.3": "https://downloads.wordpress.org/plugin/local-delivery-drivers-for-woocommerce.1.9.3.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://powerfulwp.com",
    "banners": {
        "low": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/banner-772x250.png?rev=2397269",
        "high": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/banner-1544x500.png?rev=2397269"
    },
    "icons": {
        "1x": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/icon-128x128.png?rev=2397269",
        "2x": "https://ps.w.org/local-delivery-drivers-for-woocommerce/assets/icon-256x256.png?rev=2397269"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 86,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}