{
    "name": "Wp MagicBox",
    "slug": "magicbox",
    "version": "1.2.2",
    "author": "MagicBox",
    "author_profile": "https://profiles.wordpress.org/wpmagicbox/",
    "contributors": {
        "wpmagicbox": {
            "profile": "https://profiles.wordpress.org/wpmagicbox/",
            "avatar": "https://secure.gravatar.com/avatar/94ffb8cebaf60cd4afa9dcd9bc104381?s=96&d=monsterid&r=g",
            "display_name": "WP Magic Box"
        }
    },
    "requires": "4.6",
    "tested": "6.1.7",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 1,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 1,
    "support_url": "https://wordpress.org/support/plugin/magicbox/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 10,
    "downloaded": 488,
    "last_updated": "2023-04-11 09:08:00",
    "added": "2023-03-21",
    "homepage": "https://wpmagicbox.com",
    "sections": {
        "description": "<p>When you first install WordPress, a web page doesn&#8217;t have the standard features it should have. Even for the most basic needs, it is necessary to buy many add-ons. MagicBox offers you all the features you need with just one plugin.</p>\n<p><a href=\"https://wpmagicbox.com/\" rel=\"nofollow ugc\">Wp MagicBox</a> everything for wordpress. Turn your website into a professional CMS system</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/KK4tLhMD3uE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>MagicBox Features</h3>\n<h3>SMTP</h3>\n<ul>\n<li>You can add any mail account information you want so that e-mails sent through your website can be forwarded.</li>\n<li>You can easily add the SMTP mail information.</li>\n<li>With this feature, messages from the contact forms on your site are forwarded to the e-mail you want.</li>\n<li>With this feature, new membership, order, lost password, etc. E-mails are forwarded to your members.</li>\n</ul>\n<h3>Contact Buttons</h3>\n<ul>\n<li>You can add contact and social media buttons to your website.</li>\n<li>You can add contact icons such as Facebook, Instagram, phone, mail.</li>\n<li>You can show the contact buttons at the top, right, bottom positions of your page.</li>\n<li>You can adjust the settings of the buttons as you wish.</li>\n<li>You can change the opening type of the dialog.</li>\n<li>You can specify whether the communication widget is displayed on or off</li>\n<li>You can show the communication widget on any page of your site.</li>\n</ul>\n<h3>Form Builder</h3>\n<ul>\n<li>You can add as many contact forms as you want without the need for any code for your website.</li>\n<li>You can add the forms you add to the page you want with Shortcode.</li>\n<li>You can follow the messages sent to the forms from your admin panel.</li>\n<li>If you want, incoming forms are automatically forwarded to the e-mail addresses you specify.</li>\n</ul>\n<h3>Bulk Mail</h3>\n<ul>\n<li>You can send mass mail to your members or to the lists you want from your Admin Panel.</li>\n<li>You can easily make mail designs with the editor.</li>\n<li>You can send mass e-mails specific to the member types on your site.</li>\n<li>You can add your mailing list in bulk manually.</li>\n<li>You can review the details of the mass mails you have sent.</li>\n<li>You can add special tags such as -name, -username, -mail to your maills.</li>\n</ul>\n<h3>Lazy Load</h3>\n<ul>\n<li>You can decrease the page opening time by not automatically loading the content that your visitors do not see.</li>\n<li>You can choose which pages the lazy load will be valid on.</li>\n<li>You can set which content types the lazy load is valid for.</li>\n</ul>\n<h3>Database Repair</h3>\n<ul>\n<li>You can periodically repair corrupted tables to improve your website performance and database health.</li>\n<li>You can view the corrupted tables in your database by severity.</li>\n<li>You can repair your tables individually or in bulk.</li>\n</ul>\n<h3>Cache Manager</h3>\n<ul>\n<li>By caching data on your website, you can reduce your site&#8217;s load time and improve your site&#8217;s SEO and overall user experience.</li>\n<li>You can set how caches are stored on your server.</li>\n<li>You can set the duration of caches on your server.</li>\n<li>You can set which states will be cached.</li>\n<li>You can separate desktop and mobile user caches.</li>\n<li>You can set the data that you do not want to be cached.</li>\n</ul>\n<h3>Preloader</h3>\n<ul>\n<li>You can upload page load animations to your website.</li>\n<li>You can select the preloader image you want from the gallery or add your own</li>\n<li>You can specify the display time, size and effect of the image.</li>\n<li>You can select the pages you want the Preloader to appear on.</li>\n</ul>\n<h3>Popup</h3>\n<ul>\n<li>You can add automatic pop-up dialogs to your website.</li>\n<li>You can edit the popup content with the editor.</li>\n<li>You can edit the appearance of the popup.</li>\n<li>You can add javascript tracking tags to your popup.</li>\n<li>You can choose how many times the popup will appear and for how long.</li>\n<li>You can select the pages you want the popup to open.</li>\n</ul>\n<h3>Live Search</h3>\n<ul>\n<li>By improving the search form of your website, you can show your visitors fast and image results.</li>\n<li>You can include images in search results.</li>\n<li>You can limit the length of titles and descriptions.</li>\n<li>You can specify the number of results to show.</li>\n</ul>\n<h3>Fancybox</h3>\n<ul>\n<li>You can display the media on your website in aesthetically pleasing Fancyboxes.</li>\n<li>FancyBox&#8217;s image, video, pdf etc. You can choose which objects to apply to.</li>\n<li>You can edit the appearance of the FancyBox.</li>\n<li>You can select the pages on which the FancyBoxes will be displayed.</li>\n</ul>\n<h3>Custom Css</h3>\n<ul>\n<li>You can easily customize the look of your site by adding custom CSS codes without changing your theme files.</li>\n<li>You can add custom css to both the WordPress Admin Panel and your website.</li>\n<li>You can add custom CSS to mobile, tablet and desktop views.</li>\n</ul>\n<h3>Cookie Policy Options</h3>\n<ul>\n<li>You can add a dialog message that informs your visitors about the use of cookies on your site and asks for confirmation.</li>\n<li>You can add a title and description to the cookie notice.</li>\n<li>You can customize the appearance of the pop-up notification.</li>\n<li>You You can edit the cookie confirmation button design.</li>\n</ul>\n<h3>Login Logs</h3>\n<ul>\n<li>You can view the users who have attempted to login to your website.</li>\n<li>You can view the date users attempted to login.</li>\n<li>You can view whether the login attempt was successful or not.</li>\n<li>You can see which ip and browser the users are trying from.</li>\n</ul>\n<h3>Php Information</h3>\n<ul>\n<li>You can view detailed information about the server and software of your WordPress website.</li>\n<li>You can view a lot of information about the current status of your php configuration</li>\n<li>You can view which extensions are active on your server.</li>\n<li>You can view the server and cookie information of your website.</li>\n</ul>\n<h3>Error Logs</h3>\n<ul>\n<li>You can view the errors that have occurred on your website or server.</li>\n<li>You can see the location and date of the error logs.</li>\n<li>You can easily clear the records.</li>\n</ul>\n<h3>Post Authentication</h3>\n<ul>\n<li>You can organize your post and page accesses for your WordPress website depending on user types.</li>\n<li>You can only grant logged-in users content access to certain pages and posts.</li>\n<li>You can add password restrictions to your content.</li>\n</ul>\n<h3>Disqus Comment</h3>\n<ul>\n<li>You can add the Disqus comment system to your website and directly interact with your target audience to increase your traffic and audience.</li>\n<li>You can adjust the position and size of the comment section.</li>\n<li>You can activate the captcha feature while commenting.</li>\n<li>You can limit the number of times users can comment.</li>\n</ul>\n<h3>Comment Manager</h3>\n<ul>\n<li>You can determine in which sections the WordPress Comment system will work on your web page, and you can prevent spam posts.</li>\n<li>You can prevent commenting on the content you have selected.</li>\n<li>You can hide old comments made on the content you selected.</li>\n<li>You can activate the captcha feature while commenting.</li>\n<li>You can limit the number of times users can comment.</li>\n</ul>\n<h3>Backup Manager</h3>\n<ul>\n<li>You can easily back up your website against any security threats, corruptions and updates.</li>\n<li>You can back up your entire website, plugins, themes, upload folder or database if you want.</li>\n<li>You can see the list of backups you have taken and download the ones you want.</li>\n</ul>\n<h3>Image Upload Optimiser</h3>\n<ul>\n<li>You can resize your images in your own browser and upload them to your site in an optimized way, without the need to resize them one by one.</li>\n<li>You save time on your bulk image uploads.</li>\n<li>You can set the maximum dimensions and quality of the image you will upload.</li>\n<li>By reducing the size of your images before uploading them to your server, you consume minimal space in your hosting space.</li>\n</ul>\n<h3>Bulk Image Resize</h3>\n<ul>\n<li>You can reduce server space usage and speed up your website by resizing images.</li>\n<li>You can resize images of content, products etc.in bulk on your site.</li>\n<li>You can reduce the quality of images in bulk.</li>\n<li>You can optimize JPG, PNG and GIF files.</li>\n</ul>\n<h3>Keyword Suggestion</h3>\n<ul>\n<li>While adding content such as posts, pages and products to your website, you can use relevant keyword suggestions to get more traffic to your content.</li>\n<li>You can add word suggestions directly to your content or use them as a tag.</li>\n<li>You can easily find popular keywords related to the topic.</li>\n<li>You can target keywords correctly with this feature.</li>\n</ul>\n<h3>Url Replacement</h3>\n<ul>\n<li>If you have changed your website address or want to change the links on your site, you can easily replace the old links with the new URL.</li>\n<li>You can change the links of all content types collectively or individually.</li>\n<li>You can change an old url on your site with a new url</li>\n</ul>\n<h3>Sitemap</h3>\n<ul>\n<li>You can create dynamic XML sitemaps to help search engines better index your site.</li>\n<li>You can create separate sitemaps depending on the content types of your website.</li>\n<li>You can include images in sitemaps.</li>\n<li>Your sitemap will be automatically updated for each separate content you add, without the need to repeatedly create a sitemap.</li>\n<li>You will be listed more easily in search engines such as Google, Bing, Yandex, Yahoo, Ask.</li>\n</ul>\n<h3>Site Redirects</h3>\n<ul>\n<li>You can redirect unsecured HTTP traffic to secure HTTPS traffic without touching any code.</li>\n<li>When you activate the plugin everything will be configured for you automatically and SSL will be enabled.</li>\n<li>The entire site will move to HTTPS using your SSL certificate.</li>\n<li>It works with any SSL certificate also you can redirect your website other website</li>\n</ul>\n<h3>Seo Image</h3>\n<ul>\n<li>You can automatically add alt and title tags to the images you add to your website to increase your visibility by search engines.</li>\n<li>You can add alt and title tags of images at once.</li>\n<li>You can increase the rate of your images appearing in search results.</li>\n</ul>\n<h3>Robot Txt Editor</h3>\n<ul>\n<li>You can determine how your website content will be read by search engine bots from your admin panel.</li>\n<li>You can edit the robot.txt file of your website</li>\n<li>You can make your edits without the hassle of FTP clients or permissions.</li>\n</ul>\n<h3>Error Redirects</h3>\n<ul>\n<li>You can redirect your pages with 404 errors so that your visitors and search engine robots do not have a bad experience.</li>\n<li>You can view the list of broken links on your website without using any SEO tools.</li>\n<li>You can make 301,302 and 307 redirects to broken links.</li>\n</ul>\n<h3>Error Page Manager</h3>\n<ul>\n<li>To prevent your visitors from seeing 404 pages as an error, you can have them automatically redirected to a different related content.</li>\n<li>You can prevent your users from having a bad experience.</li>\n<li>You can automatically redirect pages that give 404 errors to content with relevant and similar URLs.</li>\n</ul>\n<h3>Duplicate Manager</h3>\n<ul>\n<li>You can automatically detect your published content with the same name and same content so that your SEO is not adversely affected.</li>\n<li>You can delete duplicate content and redirect to original content.</li>\n<li>You can reduce server usage and speed up your website by cleaning up unnecessary content.</li>\n</ul>\n<h3>Custom Redirects</h3>\n<ul>\n<li>You can create and manage redirects for unopened, deleted or broken links on your site to improve SEO and visitor experience.</li>\n<li>You can redirect pages with 301,302 and 307 error codes to different pages you want.</li>\n<li>You can view the list of links to which you have redirected.</li>\n</ul>\n<h3>Visit Limitation</h3>\n<ul>\n<li>You can prevent unnecessary traffic by limiting the unusual requests of your users on your website.</li>\n<li>You can limit your visitors&#8217; page visits, searches and comments.</li>\n<li>You can exclude any user roles without limitation.</li>\n<li>You can exclude query limits for search engines.</li>\n<li>You can specify how the rules you specify are stored on your server.</li>\n<li>You can direct people who exceed the limits to different addresses.</li>\n</ul>\n<h3>Login Url</h3>\n<ul>\n<li>You can change the standard wp-admin Admin Panel url of your WordPress site.</li>\n<li>You can manually change the admin panel login address.</li>\n<li>You can block malicious login attempts to your admin panel.</li>\n</ul>\n<h3>Google Authenticator</h3>\n<ul>\n<li>You can secure admin login by adding two factor authentication to your website.</li>\n<li>You can protect your website from phishing and password theft.</li>\n<li>You can block requests that contain malicious code or content.</li>\n<li>By blocking all requests from malicious IPs, you can reduce server load while keeping your site secure.</li>\n</ul>\n<h3>Captcha</h3>\n<ul>\n<li>You can keep bots and abuse requests away from your website and only allow people to fill in the forms on your site.</li>\n<li>You can add Captcha verification to member login, member registration, comment, contact form sections of your website.</li>\n<li>You can prevent actions such as unnecessary member registration, malicious login attempts.</li>\n</ul>\n<h3>Tracking Codes</h3>\n<ul>\n<li>You can track your website&#8217;s data and increase conversions by adding analytics and marketing tags to the head section of your website.</li>\n<li>You can add Google webmaster, Analytics, Search Console, Yandex Metrica, Microsoft Clarity, Facebook Pixel, Google Tag Manager, OneSignal activation codes to your website.</li>\n<li>You can view and edit all tracking codes from a single page.</li>\n</ul>\n<h3>User.ini Editor</h3>\n<ul>\n<li>You can easily edit the User.ini file from the admin panel.</li>\n<li>You can make updates without the need for ftp client.</li>\n<li>If the User.ini file does not exist, it will be created automatically.</li>\n</ul>\n<h3>Htaccess Editor</h3>\n<ul>\n<li>You can easily edit the htaccess file from the admin panel.</li>\n<li>You can make updates without the need for ftp client.</li>\n<li>If the Htaccess file does not exist, it will be created automatically.</li>\n</ul>\n<h3>Code Insert Manager</h3>\n<ul>\n<li>You can add PHP, JS and HTML code to the desired areas of your website.</li>\n<li>You can select the pages you want to add code to.</li>\n<li>You can set which device views the codes you add will be valid.</li>\n<li>You can add codes to Head top, head bottom, body top and body bottom sections.</li>\n</ul>\n<h3>Gutenberg Editor</h3>\n<ul>\n<li>This plugin hides all functionality available in the new Gutenberg block editor</li>\n<li>You can use old style meta boxes.</li>\n<li>You can use the Gutenberg editor whenever you want.</li>\n</ul>\n<h3>White Label</h3>\n<ul>\n<li>You can hide the standard WordPress information by customizing the WordPress admin panel for your administrators or clients.</li>\n<li>You can hide the content you don&#8217;t want in the Admin Panel</li>\n<li>You can hide Admin Bar, Help Box, Update Messages, WordPress Logo and links, WordPress Version Check in the admin panel.</li>\n<li>You can change the WordPress Admin Page title.</li>\n<li>You can change the WordPress logo.</li>\n<li>You can choose which user roles your edits will apply to.</li>\n</ul>\n<h3>User Switch</h3>\n<ul>\n<li>You can quickly switch between user and administrator accounts in your WordPress Admin Panel.</li>\n<li>You can change user without entering username and password.</li>\n<li>You can test your website and admin panel with different user types.</li>\n<li>You can choose which admin roles can use this feature.</li>\n<li>After you switch to a new user account, you can continue testing your website that you are logged into as that user.</li>\n</ul>\n<h3>Maintenance Mode</h3>\n<ul>\n<li>You can add a maintenance page to your website that lets visitors know your site is down for maintenance.</li>\n<li>You can design the Maintenance Mode page as you wish with editör.</li>\n<li>You can add background image and color.</li>\n<li>You can set the background position and repeat.</li>\n</ul>\n<h3>Clone Manager</h3>\n<ul>\n<li>You can duplicate any type of content on your WordPress website with one click.</li>\n<li>You can set the contents for which the Duplicate feature will be active.</li>\n<li>You can make edits to draft contents without breaking the original content.</li>\n<li>You can publish the draft content manually whenever you want.</li>\n</ul>\n<h3>Custom Login</h3>\n<ul>\n<li>You can customize the WordPress Admin panel login page and create a custom login page for your administrators.</li>\n<li>You can change the login page logo.</li>\n<li>You can change the login page background.</li>\n<li>You can customize the login page form and button</li>\n<li>You can hide login page register, hide back url, hide privacy, Remember me features.</li>\n</ul>\n<h3>Custom Dashboard</h3>\n<ul>\n<li>You can customize the WordPress Dashboard depending on admin roles.</li>\n<li>You can change admin panel logo and dashboard title</li>\n<li>You can hide Dashboard widgets based on admin roles.</li>\n<li>You can add Dashboard Messages and show them to the user types you want.</li>\n</ul>\n<h3>Admin Menu Manager</h3>\n<ul>\n<li>You can organize the admin panel menu depending on admins roles.</li>\n<li>You can edit the admin menu as you wish.</li>\n<li>You can show different menu items for each admin role.</li>\n<li>You can hide the menu items you don&#8217;t want.</li>\n<li>You can change the order of the menu links by dragging and dropping.</li>\n<li>You can change the name of the menu item.</li>\n<li>You can reset all edits and restore the menu at any time.</li>\n</ul>\n<h3>User Permissions</h3>\n<ul>\n<li>You can set admin roles and access permissions on your website.</li>\n<li>You can add different admin roles to your site.</li>\n<li>You can set all permissions of user roles on your website.</li>\n<li>You can set the permissions of user roles for all pages and plugins that you add to your website later.</li>\n<li>When user login the website you can redirect specific admin role automatically another page.</li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/9lZ7xawZOHI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Note: If you want to use more features in magicbox, you need to get API key. Apart from that, you can use all the features included in the plugin for free. We have integrated our REST API into the plugin for your convenience when you want to upgrade your plugin. At the same time, we have added our control mechanism so that you can make new developments, updates and bug fixes with one click. You do not need an account or payment to use the plugin.</p>\n",
        "faq": "\n<dt id='what%20is%20magicbox%3F'>\nWhat is MAGICBOX?\n</h4>\n<p>\n<p>MAGICBOX is more than just an plugin. It is the world&#8217;s best, most comprehensive and most useful WordPress plugin developed to increase your workspace and the usefulness of WordPress by hosting dozens of features you need while managing your website in a single plugin.</p>\n</p>\n<dt id='why%20should%20i%20use%20magicbox%3F'>\nWhy should I use MAGICBOX?\n</h4>\n<p>\n<p>When you first set up your WordPress website, it doesn&#8217;t have many of the features you need for a standard website. To meet these needs, you need to install many paid or free plugins. Installing too many plugins will cost you both time and money. In addition, the more plugins you install on your site, the more difficult it will be to manage. You can find all the features you need in the MAGICBOX add-on to avoid dealing with many different problems such as update, security, speed.</p>\n</p>\n<dt id='will%20i%20have%20problems%20with%20other%20wordpress%20plugins%3F'>\nWill I have problems with other WordPress Plugins?\n</h4>\n<p>\n<p>No, because we tested all popular plugins with MAGICBOX. Since you will install very few plugins on your site when you use MAGICBOX, you will be less likely to have problems with your other plugins. If you still have any problems, report it to us and our experts will fix it in a very short time.</p>\n</p>\n<dt id='what%20can%20i%20do%20to%20my%20website%20with%20magicbox%3F'>\nWhat can I do to my website with MAGICBOX?\n</h4>\n<p>\n<p>What can&#8217;t you do? With many features in MAGICBOX, you can manage your WordPress website much more easily. You can easily manage all the features you need from a single panel. You can make the settings of your website and edit the design as you wish. You can adjust the operation and appearance of your admin panel, adjust the security, speed, settings of your site, and increase your traffic with Seo and marketing features. You can easily use many features like this without the need for any code knowledge.</p>\n<p><a href=\"https://wpmagicbox.com/support/get\" rel=\"nofollow ugc\">Take a look other Frequently Asked Questions</a></p>\n</p>\n\n",
        "changelog": "<h4>1.2.2</h4>\n<ul>\n<li>Cleared PHP Warnings &amp; Notices</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Broken links fixed</li>\n<li>Some design upgrades</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Changed licencing control and folders name.</li>\n<li>Fixed text field bugs.</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Added new setting options in features.</li>\n<li>Added new features in seo. Now you can change images file name with post title. It is most important on image seo.</li>\n<li>Fixed php version bugs specially php 8.0 and 8.1 and we are support php 5.4 now.</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Google Authenticator</li>\n<li>Google Captcha</li>\n<li>Login Url</li>\n<li>Fixed cross problems. Added new feature to custom dashboard. Fixed some css problems it is more comfortable now.</li>\n<li>Error Redirects</li>\n<li>Custom Redirects</li>\n<li>Fixed SSL bug on all wordpress versions.</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>WP 4.9 and 5.X version problems solved. This version about hooks.</li>\n<li>Custom Dashboard</li>\n<li>User Switch</li>\n<li>Maintenance Mode</li>\n<li>Lazy Load ( Image duplication solved )</li>\n<li>Popup</li>\n<li>User Permissions</li>\n<li>Some wordpress hooks not working on old versions. Added new hooks for alternative.</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Mobile usability improved</li>\n<li>Improved Contact Buttons elements</li>\n<li>Design adjustments were made</li>\n<li>Javascript errors resolved</li>\n</ul>\n<h4>1.0.0</h4>\n<p>When you first install WordPress, a web page doesn&#8217;t have the standard features it should have. Even for the most basic needs, it is necessary to buy many add-ons. MagicBox offers you all the features you need with just one plugin.</p>\n"
    },
    "short_description": "Do not install unnecessary plugins on your site. MagicBox is everything you need.",
    "description": "<p>When you first install WordPress, a web page doesn&#8217;t have the standard features it should have. Even for the most basic needs, it is necessary to buy many add-ons. MagicBox offers you all the features you need with just one plugin.</p>\n<p><a href=\"https://wpmagicbox.com/\" rel=\"nofollow ugc\">Wp MagicBox</a> everything for wordpress. Turn your website into a professional CMS system</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/KK4tLhMD3uE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>MagicBox Features</h3>\n<h3>SMTP</h3>\n<ul>\n<li>You can add any mail account information you want so that e-mails sent through your website can be forwarded.</li>\n<li>You can easily add the SMTP mail information.</li>\n<li>With this feature, messages from the contact forms on your site are forwarded to the e-mail you want.</li>\n<li>With this feature, new membership, order, lost password, etc. E-mails are forwarded to your members.</li>\n</ul>\n<h3>Contact Buttons</h3>\n<ul>\n<li>You can add contact and social media buttons to your website.</li>\n<li>You can add contact icons such as Facebook, Instagram, phone, mail.</li>\n<li>You can show the contact buttons at the top, right, bottom positions of your page.</li>\n<li>You can adjust the settings of the buttons as you wish.</li>\n<li>You can change the opening type of the dialog.</li>\n<li>You can specify whether the communication widget is displayed on or off</li>\n<li>You can show the communication widget on any page of your site.</li>\n</ul>\n<h3>Form Builder</h3>\n<ul>\n<li>You can add as many contact forms as you want without the need for any code for your website.</li>\n<li>You can add the forms you add to the page you want with Shortcode.</li>\n<li>You can follow the messages sent to the forms from your admin panel.</li>\n<li>If you want, incoming forms are automatically forwarded to the e-mail addresses you specify.</li>\n</ul>\n<h3>Bulk Mail</h3>\n<ul>\n<li>You can send mass mail to your members or to the lists you want from your Admin Panel.</li>\n<li>You can easily make mail designs with the editor.</li>\n<li>You can send mass e-mails specific to the member types on your site.</li>\n<li>You can add your mailing list in bulk manually.</li>\n<li>You can review the details of the mass mails you have sent.</li>\n<li>You can add special tags such as -name, -username, -mail to your maills.</li>\n</ul>\n<h3>Lazy Load</h3>\n<ul>\n<li>You can decrease the page opening time by not automatically loading the content that your visitors do not see.</li>\n<li>You can choose which pages the lazy load will be valid on.</li>\n<li>You can set which content types the lazy load is valid for.</li>\n</ul>\n<h3>Database Repair</h3>\n<ul>\n<li>You can periodically repair corrupted tables to improve your website performance and database health.</li>\n<li>You can view the corrupted tables in your database by severity.</li>\n<li>You can repair your tables individually or in bulk.</li>\n</ul>\n<h3>Cache Manager</h3>\n<ul>\n<li>By caching data on your website, you can reduce your site&#8217;s load time and improve your site&#8217;s SEO and overall user experience.</li>\n<li>You can set how caches are stored on your server.</li>\n<li>You can set the duration of caches on your server.</li>\n<li>You can set which states will be cached.</li>\n<li>You can separate desktop and mobile user caches.</li>\n<li>You can set the data that you do not want to be cached.</li>\n</ul>\n<h3>Preloader</h3>\n<ul>\n<li>You can upload page load animations to your website.</li>\n<li>You can select the preloader image you want from the gallery or add your own</li>\n<li>You can specify the display time, size and effect of the image.</li>\n<li>You can select the pages you want the Preloader to appear on.</li>\n</ul>\n<h3>Popup</h3>\n<ul>\n<li>You can add automatic pop-up dialogs to your website.</li>\n<li>You can edit the popup content with the editor.</li>\n<li>You can edit the appearance of the popup.</li>\n<li>You can add javascript tracking tags to your popup.</li>\n<li>You can choose how many times the popup will appear and for how long.</li>\n<li>You can select the pages you want the popup to open.</li>\n</ul>\n<h3>Live Search</h3>\n<ul>\n<li>By improving the search form of your website, you can show your visitors fast and image results.</li>\n<li>You can include images in search results.</li>\n<li>You can limit the length of titles and descriptions.</li>\n<li>You can specify the number of results to show.</li>\n</ul>\n<h3>Fancybox</h3>\n<ul>\n<li>You can display the media on your website in aesthetically pleasing Fancyboxes.</li>\n<li>FancyBox&#8217;s image, video, pdf etc. You can choose which objects to apply to.</li>\n<li>You can edit the appearance of the FancyBox.</li>\n<li>You can select the pages on which the FancyBoxes will be displayed.</li>\n</ul>\n<h3>Custom Css</h3>\n<ul>\n<li>You can easily customize the look of your site by adding custom CSS codes without changing your theme files.</li>\n<li>You can add custom css to both the WordPress Admin Panel and your website.</li>\n<li>You can add custom CSS to mobile, tablet and desktop views.</li>\n</ul>\n<h3>Cookie Policy Options</h3>\n<ul>\n<li>You can add a dialog message that informs your visitors about the use of cookies on your site and asks for confirmation.</li>\n<li>You can add a title and description to the cookie notice.</li>\n<li>You can customize the appearance of the pop-up notification.</li>\n<li>You You can edit the cookie confirmation button design.</li>\n</ul>\n<h3>Login Logs</h3>\n<ul>\n<li>You can view the users who have attempted to login to your website.</li>\n<li>You can view the date users attempted to login.</li>\n<li>You can view whether the login attempt was successful or not.</li>\n<li>You can see which ip and browser the users are trying from.</li>\n</ul>\n<h3>Php Information</h3>\n<ul>\n<li>You can view detailed information about the server and software of your WordPress website.</li>\n<li>You can view a lot of information about the current status of your php configuration</li>\n<li>You can view which extensions are active on your server.</li>\n<li>You can view the server and cookie information of your website.</li>\n</ul>\n<h3>Error Logs</h3>\n<ul>\n<li>You can view the errors that have occurred on your website or server.</li>\n<li>You can see the location and date of the error logs.</li>\n<li>You can easily clear the records.</li>\n</ul>\n<h3>Post Authentication</h3>\n<ul>\n<li>You can organize your post and page accesses for your WordPress website depending on user types.</li>\n<li>You can only grant logged-in users content access to certain pages and posts.</li>\n<li>You can add password restrictions to your content.</li>\n</ul>\n<h3>Disqus Comment</h3>\n<ul>\n<li>You can add the Disqus comment system to your website and directly interact with your target audience to increase your traffic and audience.</li>\n<li>You can adjust the position and size of the comment section.</li>\n<li>You can activate the captcha feature while commenting.</li>\n<li>You can limit the number of times users can comment.</li>\n</ul>\n<h3>Comment Manager</h3>\n<ul>\n<li>You can determine in which sections the WordPress Comment system will work on your web page, and you can prevent spam posts.</li>\n<li>You can prevent commenting on the content you have selected.</li>\n<li>You can hide old comments made on the content you selected.</li>\n<li>You can activate the captcha feature while commenting.</li>\n<li>You can limit the number of times users can comment.</li>\n</ul>\n<h3>Backup Manager</h3>\n<ul>\n<li>You can easily back up your website against any security threats, corruptions and updates.</li>\n<li>You can back up your entire website, plugins, themes, upload folder or database if you want.</li>\n<li>You can see the list of backups you have taken and download the ones you want.</li>\n</ul>\n<h3>Image Upload Optimiser</h3>\n<ul>\n<li>You can resize your images in your own browser and upload them to your site in an optimized way, without the need to resize them one by one.</li>\n<li>You save time on your bulk image uploads.</li>\n<li>You can set the maximum dimensions and quality of the image you will upload.</li>\n<li>By reducing the size of your images before uploading them to your server, you consume minimal space in your hosting space.</li>\n</ul>\n<h3>Bulk Image Resize</h3>\n<ul>\n<li>You can reduce server space usage and speed up your website by resizing images.</li>\n<li>You can resize images of content, products etc.in bulk on your site.</li>\n<li>You can reduce the quality of images in bulk.</li>\n<li>You can optimize JPG, PNG and GIF files.</li>\n</ul>\n<h3>Keyword Suggestion</h3>\n<ul>\n<li>While adding content such as posts, pages and products to your website, you can use relevant keyword suggestions to get more traffic to your content.</li>\n<li>You can add word suggestions directly to your content or use them as a tag.</li>\n<li>You can easily find popular keywords related to the topic.</li>\n<li>You can target keywords correctly with this feature.</li>\n</ul>\n<h3>Url Replacement</h3>\n<ul>\n<li>If you have changed your website address or want to change the links on your site, you can easily replace the old links with the new URL.</li>\n<li>You can change the links of all content types collectively or individually.</li>\n<li>You can change an old url on your site with a new url</li>\n</ul>\n<h3>Sitemap</h3>\n<ul>\n<li>You can create dynamic XML sitemaps to help search engines better index your site.</li>\n<li>You can create separate sitemaps depending on the content types of your website.</li>\n<li>You can include images in sitemaps.</li>\n<li>Your sitemap will be automatically updated for each separate content you add, without the need to repeatedly create a sitemap.</li>\n<li>You will be listed more easily in search engines such as Google, Bing, Yandex, Yahoo, Ask.</li>\n</ul>\n<h3>Site Redirects</h3>\n<ul>\n<li>You can redirect unsecured HTTP traffic to secure HTTPS traffic without touching any code.</li>\n<li>When you activate the plugin everything will be configured for you automatically and SSL will be enabled.</li>\n<li>The entire site will move to HTTPS using your SSL certificate.</li>\n<li>It works with any SSL certificate also you can redirect your website other website</li>\n</ul>\n<h3>Seo Image</h3>\n<ul>\n<li>You can automatically add alt and title tags to the images you add to your website to increase your visibility by search engines.</li>\n<li>You can add alt and title tags of images at once.</li>\n<li>You can increase the rate of your images appearing in search results.</li>\n</ul>\n<h3>Robot Txt Editor</h3>\n<ul>\n<li>You can determine how your website content will be read by search engine bots from your admin panel.</li>\n<li>You can edit the robot.txt file of your website</li>\n<li>You can make your edits without the hassle of FTP clients or permissions.</li>\n</ul>\n<h3>Error Redirects</h3>\n<ul>\n<li>You can redirect your pages with 404 errors so that your visitors and search engine robots do not have a bad experience.</li>\n<li>You can view the list of broken links on your website without using any SEO tools.</li>\n<li>You can make 301,302 and 307 redirects to broken links.</li>\n</ul>\n<h3>Error Page Manager</h3>\n<ul>\n<li>To prevent your visitors from seeing 404 pages as an error, you can have them automatically redirected to a different related content.</li>\n<li>You can prevent your users from having a bad experience.</li>\n<li>You can automatically redirect pages that give 404 errors to content with relevant and similar URLs.</li>\n</ul>\n<h3>Duplicate Manager</h3>\n<ul>\n<li>You can automatically detect your published content with the same name and same content so that your SEO is not adversely affected.</li>\n<li>You can delete duplicate content and redirect to original content.</li>\n<li>You can reduce server usage and speed up your website by cleaning up unnecessary content.</li>\n</ul>\n<h3>Custom Redirects</h3>\n<ul>\n<li>You can create and manage redirects for unopened, deleted or broken links on your site to improve SEO and visitor experience.</li>\n<li>You can redirect pages with 301,302 and 307 error codes to different pages you want.</li>\n<li>You can view the list of links to which you have redirected.</li>\n</ul>\n<h3>Visit Limitation</h3>\n<ul>\n<li>You can prevent unnecessary traffic by limiting the unusual requests of your users on your website.</li>\n<li>You can limit your visitors&#8217; page visits, searches and comments.</li>\n<li>You can exclude any user roles without limitation.</li>\n<li>You can exclude query limits for search engines.</li>\n<li>You can specify how the rules you specify are stored on your server.</li>\n<li>You can direct people who exceed the limits to different addresses.</li>\n</ul>\n<h3>Login Url</h3>\n<ul>\n<li>You can change the standard wp-admin Admin Panel url of your WordPress site.</li>\n<li>You can manually change the admin panel login address.</li>\n<li>You can block malicious login attempts to your admin panel.</li>\n</ul>\n<h3>Google Authenticator</h3>\n<ul>\n<li>You can secure admin login by adding two factor authentication to your website.</li>\n<li>You can protect your website from phishing and password theft.</li>\n<li>You can block requests that contain malicious code or content.</li>\n<li>By blocking all requests from malicious IPs, you can reduce server load while keeping your site secure.</li>\n</ul>\n<h3>Captcha</h3>\n<ul>\n<li>You can keep bots and abuse requests away from your website and only allow people to fill in the forms on your site.</li>\n<li>You can add Captcha verification to member login, member registration, comment, contact form sections of your website.</li>\n<li>You can prevent actions such as unnecessary member registration, malicious login attempts.</li>\n</ul>\n<h3>Tracking Codes</h3>\n<ul>\n<li>You can track your website&#8217;s data and increase conversions by adding analytics and marketing tags to the head section of your website.</li>\n<li>You can add Google webmaster, Analytics, Search Console, Yandex Metrica, Microsoft Clarity, Facebook Pixel, Google Tag Manager, OneSignal activation codes to your website.</li>\n<li>You can view and edit all tracking codes from a single page.</li>\n</ul>\n<h3>User.ini Editor</h3>\n<ul>\n<li>You can easily edit the User.ini file from the admin panel.</li>\n<li>You can make updates without the need for ftp client.</li>\n<li>If the User.ini file does not exist, it will be created automatically.</li>\n</ul>\n<h3>Htaccess Editor</h3>\n<ul>\n<li>You can easily edit the htaccess file from the admin panel.</li>\n<li>You can make updates without the need for ftp client.</li>\n<li>If the Htaccess file does not exist, it will be created automatically.</li>\n</ul>\n<h3>Code Insert Manager</h3>\n<ul>\n<li>You can add PHP, JS and HTML code to the desired areas of your website.</li>\n<li>You can select the pages you want to add code to.</li>\n<li>You can set which device views the codes you add will be valid.</li>\n<li>You can add codes to Head top, head bottom, body top and body bottom sections.</li>\n</ul>\n<h3>Gutenberg Editor</h3>\n<ul>\n<li>This plugin hides all functionality available in the new Gutenberg block editor</li>\n<li>You can use old style meta boxes.</li>\n<li>You can use the Gutenberg editor whenever you want.</li>\n</ul>\n<h3>White Label</h3>\n<ul>\n<li>You can hide the standard WordPress information by customizing the WordPress admin panel for your administrators or clients.</li>\n<li>You can hide the content you don&#8217;t want in the Admin Panel</li>\n<li>You can hide Admin Bar, Help Box, Update Messages, WordPress Logo and links, WordPress Version Check in the admin panel.</li>\n<li>You can change the WordPress Admin Page title.</li>\n<li>You can change the WordPress logo.</li>\n<li>You can choose which user roles your edits will apply to.</li>\n</ul>\n<h3>User Switch</h3>\n<ul>\n<li>You can quickly switch between user and administrator accounts in your WordPress Admin Panel.</li>\n<li>You can change user without entering username and password.</li>\n<li>You can test your website and admin panel with different user types.</li>\n<li>You can choose which admin roles can use this feature.</li>\n<li>After you switch to a new user account, you can continue testing your website that you are logged into as that user.</li>\n</ul>\n<h3>Maintenance Mode</h3>\n<ul>\n<li>You can add a maintenance page to your website that lets visitors know your site is down for maintenance.</li>\n<li>You can design the Maintenance Mode page as you wish with editör.</li>\n<li>You can add background image and color.</li>\n<li>You can set the background position and repeat.</li>\n</ul>\n<h3>Clone Manager</h3>\n<ul>\n<li>You can duplicate any type of content on your WordPress website with one click.</li>\n<li>You can set the contents for which the Duplicate feature will be active.</li>\n<li>You can make edits to draft contents without breaking the original content.</li>\n<li>You can publish the draft content manually whenever you want.</li>\n</ul>\n<h3>Custom Login</h3>\n<ul>\n<li>You can customize the WordPress Admin panel login page and create a custom login page for your administrators.</li>\n<li>You can change the login page logo.</li>\n<li>You can change the login page background.</li>\n<li>You can customize the login page form and button</li>\n<li>You can hide login page register, hide back url, hide privacy, Remember me features.</li>\n</ul>\n<h3>Custom Dashboard</h3>\n<ul>\n<li>You can customize the WordPress Dashboard depending on admin roles.</li>\n<li>You can change admin panel logo and dashboard title</li>\n<li>You can hide Dashboard widgets based on admin roles.</li>\n<li>You can add Dashboard Messages and show them to the user types you want.</li>\n</ul>\n<h3>Admin Menu Manager</h3>\n<ul>\n<li>You can organize the admin panel menu depending on admins roles.</li>\n<li>You can edit the admin menu as you wish.</li>\n<li>You can show different menu items for each admin role.</li>\n<li>You can hide the menu items you don&#8217;t want.</li>\n<li>You can change the order of the menu links by dragging and dropping.</li>\n<li>You can change the name of the menu item.</li>\n<li>You can reset all edits and restore the menu at any time.</li>\n</ul>\n<h3>User Permissions</h3>\n<ul>\n<li>You can set admin roles and access permissions on your website.</li>\n<li>You can add different admin roles to your site.</li>\n<li>You can set all permissions of user roles on your website.</li>\n<li>You can set the permissions of user roles for all pages and plugins that you add to your website later.</li>\n<li>When user login the website you can redirect specific admin role automatically another page.</li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/9lZ7xawZOHI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Note: If you want to use more features in magicbox, you need to get API key. Apart from that, you can use all the features included in the plugin for free. We have integrated our REST API into the plugin for your convenience when you want to upgrade your plugin. At the same time, we have added our control mechanism so that you can make new developments, updates and bug fixes with one click. You do not need an account or payment to use the plugin.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/magicbox.1.2.2.zip",
    "upgrade_notice": {
        "": "<p>If you wanna more features and functionality you can upgrade this plugin. If you don&#039;t wanna upgrade the plugin you can use some features as free and unlimited.</p>"
    },
    "screenshots": [],
    "tags": {
        "admin-menu-manager": "admin menu manager",
        "admin-panel": "admin panel",
        "custom-dashboard": "custom dashboard",
        "custom-login": "custom login",
        "user-permissions": "user permissions"
    },
    "stable_tag": "1.2.2",
    "versions": {
        "1.2.1": "https://downloads.wordpress.org/plugin/magicbox.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/magicbox.1.2.2.zip",
        "trunk": "https://downloads.wordpress.org/plugin/magicbox.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/magicbox/assets/banner-772x250.png?rev=2884240",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/magicbox/assets/icon-128x128.png?rev=2884240",
        "2x": "https://ps.w.org/magicbox/assets/icon-256x256.png?rev=2884240"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}