{
    "name": "Magical Addons For Elementor ( Header Footer Builder, Free Elementor Widgets, Elementor Templates Library )",
    "slug": "magical-addons-for-elementor",
    "version": "1.2.0",
    "author": "<a href=\"https://profiles.wordpress.org/nalam-1\">Noor alam</a>",
    "author_profile": "https://profiles.wordpress.org/nalam-1/",
    "contributors": {
        "nalam-1": {
            "profile": "https://profiles.wordpress.org/nalam-1/",
            "avatar": "https://secure.gravatar.com/avatar/26df47bb8ff499152da7d2671ed2c7db?s=96&d=monsterid&r=g",
            "display_name": "Noor Alam"
        }
    },
    "requires": "5.0",
    "tested": "6.6.1",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 6,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 6,
    "support_url": "https://wordpress.org/support/plugin/magical-addons-for-elementor/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 5000,
    "downloaded": 157279,
    "last_updated": "2024-08-13 13:22:00",
    "added": "2019-10-28",
    "homepage": "",
    "sections": {
        "description": "<p>The best part of Magical Addons is that you can design anything without having to touch a single line of code. Magical Addons has a huge collection of premium and highly functional extensions that can be used in an Elementor page builder. This is really a premium plugin that you can get for free.</p>\n<p><a href=\"https://magic.wpcolors.net/\" rel=\"nofollow ugc\"><strong>Check Elementor Magical Addons Demo Pages</strong></a></p>\n<p>Comes with 60+ Widgets, 100+ premade sections and blocks, 20+ template kits that help you build your websites in less time with no coding. our blocks and template library growing every week.</p>\n<h3>See Short video</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/bKLwBrxVjno?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Header &amp; Footer builder Short video</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/qOCqMaPNads?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Magical Addons Widgets List:</h3>\n<ul>\n<li><strong>All Free Widgets List:</strong></li>\n</ul>\n<ol>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-banner/\" rel=\"nofollow ugc\"><strong>Banner Widget</strong></a><br />\nCreate your website banner with the banner widget advance options. The banner widget has two different styles with huge options.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-slider/\" rel=\"nofollow ugc\"><strong>Animation Slider</strong></a><br />\nYou can create an awesome animation slider with images and text with our Animation Slider widget. The widget gives you a huge number of customizable options with animation so you can create elegant-looking sliders in a minute!!</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-info-box/\" rel=\"nofollow ugc\"><strong>Info Box</strong></a><br />\nShow any kind of information with a beautiful design. A magical info box creates your website more attractive.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-call-to-action/\" rel=\"nofollow ugc\"><strong>Call to action</strong></a><br />\nContent, image and button in one place with many styles and options in call to action widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-tabs/\" rel=\"nofollow ugc\"><strong>Tabs</strong></a><br />\nCreate both Vertical and Horizontal tabs with huge options &amp; features. Hope you will enjoy our tabs widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/countdown-timer/\" rel=\"nofollow ugc\"><strong>Countdown</strong></a><br />\nThe countdown widget allows you to display a timer that counts down to a specific time or date. It’s perfect for under-construction pages, sale items, events etc.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-dual-heading/\" rel=\"nofollow ugc\"><strong>Dual Heading</strong></a><br />\nYou can create a headline with 2 different styles with this widget. Dual Heading Widget has every possible option.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-team-members/\" rel=\"nofollow ugc\"><strong>Team Members</strong></a><br />\nThe best way to build a team grid is to introduce your team members, co-workers, etc. you can easily customize the team member widget as per your need.</p>\n</li>\n<li>\n<p>Timeline<br />\nCreate your timeline using the Magical timeline widget and showcase your timeline horizontal and vertical with awesome style.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-accordion/\" rel=\"nofollow ugc\"><strong>Accordion</strong></a><br />\nDisplay your website content in a foldable and succinct way using the Accordion widget. You can easily create your website faq section with the widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-about-widget/\" rel=\"nofollow ugc\"><strong>About me</strong></a><br />\nDisplay about your details on your webpage by the magical about me widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/progress-bar/\" rel=\"nofollow ugc\"><strong>Progress Bar</strong></a><br />\nProgress Bar Widget helps you to display user skills, task progress, download percentage, and other progressions in an awesome way.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-social-share/\" rel=\"nofollow ugc\"><strong>Social Share</strong></a><br />\nVisitors can share your content on their social media accounts with one button click. it\\&#8217;s a wonderful feature for improving your site Impressions</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-info-list/\" rel=\"nofollow ugc\"><strong>Info List</strong></a><br />\nYou can easily list your information by the Magical Elementor info list widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-dual-button/\" rel=\"nofollow ugc\"><strong>Dual Button</strong></a><br />\nDisplay two buttons side by side with two different styles by dual button widget. Dual Button perfect for banner, call to action and any other section. It will improve your website visibility.</p>\n</li>\n<li>\n<p>Template Insert<br />\nYou can insert your Elementor save the template by the template insert widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-back-to-top/\" rel=\"nofollow ugc\"><strong>Back to top</strong></a><br />\nElementor Back to top widget helps your visitor one click go page top easily. You can use the Back to top both in section and page.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/section-title/\" rel=\"nofollow ugc\"><strong>Section Title</strong></a><br />\nEvery website has a different style section title. Now you can easily create many different style section titles with the Elementor magical section title widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-card/\" rel=\"nofollow ugc\"><strong>Card</strong></a><br />\nDisplay your content like services, products, offers and other items by our Elementor magical Card Widget on your WordPress website.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-dual-heading/\" rel=\"nofollow ugc\"><strong>Dual Heading</strong></a><br />\nDisplay two different style heading by Elementor magical dual heading widget.</p>\n</li>\n<li>\n<p>Text Effects<br />\nYou can add many different text effects to your webpage text. You can create an animation header or highlighted text animation by Elementor magical text effects widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-block-quote/\" rel=\"nofollow ugc\"><strong>Blockquote</strong></a><br />\nElementor blockquote widget is free. Now you can create awesome blockquote in your website content easily by Elementor magical Blockquote widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/video-edit-page/\" rel=\"nofollow ugc\"><strong>Video Card</strong></a><br />\nShow your website content with video by the Elementor Magical video card widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-content-reveal/\" rel=\"nofollow ugc\"><strong>Content Reveal/Unfold</strong></a><br />\nYou can fit long text in a small area by the Content Reveal /Unfold widget. Elementor magical Content Reveal /Unfold widget is an awesome trick as it will make your layout design look better.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-icon-list/\" rel=\"nofollow ugc\"><strong>Icon List</strong></a><br />\nYou cat crate list with icon by Elementor magical icon list widget. You can set any icon from the icon library with huge options.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/pricing-table/\" rel=\"nofollow ugc\"><strong>Pricing Table</strong></a><br />\nYou can display detailed single prices or comparison pricing plans with the Elementor magical pricing table. Pricing table is a great way to boost your sales and engage more potential buyers.</p>\n</li>\n<li>\n<p>Data Table<br />\nElementor magical data table widget will let you create data tables with advanced styling options and features. Now show your data with a customizable table.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-flip-box/\" rel=\"nofollow ugc\"><strong>Flip Box</strong></a><br />\nElementor magical Flip Box Widget comes with cool 3D interactive effects. The Flip Box highlights your content in a great way.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-hover-card/\" rel=\"nofollow ugc\"><strong>Hover Card</strong></a><br />\nLots of hover effects are added in the Elementor magical hover card widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-image-comparison/\" rel=\"nofollow ugc\"><strong>Image Comparison</strong></a><br />\nElementor magical image comparison can compare two pictures with draggable or mouse hover options in horizontal and vertical layouts.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-accordion/\" rel=\"nofollow ugc\"><strong>Image Accordion</strong></a><br />\nCreate eye-catching image accordions in both vertical and horizontal orientations inside with Elementor magical image accordion.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-image-scroll/\" rel=\"nofollow ugc\"><strong>Image Smooth Scroll</strong></a><br />\nElementor magical image smooth scroll allows you to display an image attractive scrolling way</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-posts-grid/\" rel=\"nofollow ugc\"><strong>Posts Grid</strong></a><br />\nDisplay your website posts in many different grid styles with advanced posts query</p>\n</li>\n<li>\n<p><strong>Posts List</strong><br />\nYou can easily display your website posts in many different list styles with Elementor magical posts list widget.</p>\n</li>\n<li>\n<p><strong>Site Logo</strong><br />\nThe Magical Site Logo Elementor widget is a versatile tool that allows you to easily add a logo to your website. With this widget, you can upload your own logo image or add text logo. You can also adjust the size, color, and position of your logo. This widget is a quick and easy way to add a professional touch to your website.</p>\n</li>\n<li>\n<p><strong>Nav Menu</strong><br />\nNow, you build outstanding navigation menus in Elementor using the nav menu Widget with dozens of options.</p>\n</li>\n<li>\n<p><strong>Category/tag list</strong><br />\nNow, You can easily display posts category or tag lists on pages or sections.</p>\n</li>\n<li>\n<p><strong>Mailchimp Widget</strong><br />\nNow you can personalize your Mailchimp sign-up form with attractive and multiple styles With our Mailchimp Elementor addons.</p>\n</li>\n<li>\n<p><strong>advanced Skillbar</strong><br />\nThe Magical Advanced Skillbar Elementor widget is a great way to display your skills and expertise on your website. It allows you to easily create a beautiful and professional looking skillbar, without having to code or design anything yourself. The widget is extremely easy to use and comes with a variety of options to customize it to your needs</p>\n</li>\n<li>\n<p><strong>Search Bar</strong><br />\nNow, you can customize your WordPress search bar in a unique way with Multiple styles.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-contact-form/\" rel=\"nofollow ugc\"><strong>Contact Form 7</strong></a><br />\nContact Form 7 Elementor Widget will help you to display contact forms on your website.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-contact-form/\" rel=\"nofollow ugc\"><strong>WpForms</strong></a><br />\nDisplay easily WPForms plugin forms ease way using the Elementor magical WPForms widget.</p>\n</li>\n</ol>\n<ul>\n<li><strong>All Pro Widgets List:</strong></li>\n</ul>\n<p><a href=\"https://magic.wpcolors.net/filter-gallery/\" rel=\"nofollow ugc\"><strong>Portfolio/Filter Gallery</strong></a><br />\nPortfolio gallery is an a awesome for display portfolio items or filter image gallery.</p>\n<p><a href=\"https://magic.wpcolors.net/lottie/\" rel=\"nofollow ugc\"><strong>Lottie Animations</strong></a><br />\nThe Lottie Animation pro Elementor widget makes it easy to add Lottie animations to your Elementor-based website. With this addon, you can easily add Lottie animations to any Elementor widget or section. You can also control the playback of the animation, as well as the animation speed.</p>\n<p><a href=\"https://magic.wpcolors.net/info-carousel/\" rel=\"nofollow ugc\"><strong>Info Box Carousel</strong></a><br />\nThe Magical Info Box Carousel Elementor widget is a great way to showcase important information on your website in a carousel format. This widget is highly customizable, allowing you to change the number of slides, the order of the slides, the layout of the slides, and more. This widget is a great way to draw attention to important information on your website.</p>\n<p><a href=\"https://magic.wpcolors.net/bar-chart-pro/\" rel=\"nofollow ugc\"><strong>Bar Chart</strong></a><br />\nThe Magical Bar Chart Elementor widget is a great way to display data in a visually appealing way. This widget allows you to choose from a variety of chart types and customize the look and feel of your chart. You can also add a variety of data labels to your chart to make it even more informative.</p>\n<p><a href=\"https://magic.wpcolors.net/testmonial-pro/\" rel=\"nofollow ugc\"><strong>Testimonial Carousel</strong></a><br />\nThe Magical Testimonial Carousel Elementor widget is an excellent way to display testimonials on your website. The widget is fully responsive and looks great on all devices. It is also very easy to customize and change the look and feel of the widget to match your website&#8217;s style. Overall, the Testimonial Carousel Elementor widget is a great way to display testimonials on your website.</p>\n<p><a href=\"https://magic.wpcolors.net/promo-box-pro/\" rel=\"nofollow ugc\"><strong>Promo Box</strong></a><br />\nThe Magical Promo Box Elementor widget is a great way to promote your products or services on your website. It allows you to add a title, text, image, and button to your promotion, making it easy to grab attention and get your message across. The widget is also fully customizable, so you can change the colors, font, and size of your promotion to match your website&#8217;s look and feel.</p>\n<p><a href=\"https://magic.wpcolors.net/price-menu-pro/\" rel=\"nofollow ugc\"><strong>Price Menu</strong></a><br />\nThe Magical Price Menu Elementor widget is a great way to add a pricing menu to your website. It&#8217;s easy to use and lets you create a beautiful, responsive pricing menu that will look great on any device.</p>\n<p><a href=\"https://magic.wpcolors.net/photo-bunch/\" rel=\"nofollow ugc\"><strong>Photo Bunch</strong></a><br />\nThe Magical Photo Bunch widget is a great way to display a bunch of photos in a grid. It&#8217;s perfect for displaying a portfolio of photos, or a gallery of photos. The widget is responsive, so it will look great on all devices. The widget is easy to use, and it&#8217;s a great way to showcase a bunch of photos.</p>\n<p><a href=\"https://magic.wpcolors.net/pdf-view/\" rel=\"nofollow ugc\"><strong>PDF View</strong></a><br />\nThe Magical PDF View Elementor widget allows you to embed a PDF document in your web page. This is a great way to share documents with your audience, and the widget makes it easy to embed the PDF into your page. The PDF View Elementor widget is a great way to share documents with your audience.</p>\n<p>[<strong>One Page Nav</strong>]<br />\nThe Magical One Page Nav Elementor widget is a powerful tool that allows you to quickly and easily create a custom one page navigation menu for your website. With this widget, you can easily add new pages, change the order of your pages, and even add custom CSS to further customize your menu. This widget is the perfect solution for creating a custom one page navigation menu for your website.</p>\n<p><a href=\"https://magic.wpcolors.net/off-canvas/\" rel=\"nofollow ugc\"><strong>Off Canvas</strong></a><br />\nThe Magical Off-canvas is an Elementor widget that allows you to create a hidden sidebar, which can be revealed by clicking on a button or icon. This is a useful way to create a hidden menu, or to display additional information that you don&#8217;t want to clutter up your main content area.</p>\n<p><a href=\"https://magic.wpcolors.net/modal-popup/\" rel=\"nofollow ugc\"><strong>Modal/Popup</strong></a><br />\nThe Magical Popup Elementor widget is a great way to display important information on your website in a modal window. This widget is easy to use and configure, and it offers a variety of options to customize the look and feel of the popup. You can use the Popup Elementor widget to display a contact form, newsletter signup form, or any other content that you want to highlight on your website.</p>\n<p><a href=\"https://magic.wpcolors.net/hotspot-pro/\" rel=\"nofollow ugc\"><strong>Image Hotspots</strong></a><br />\nThe Magical Image Hotspots Elementor widget is a great way to add interactive hotspots to your images. You can use it to create custom hotspots with text and links, or to simply add dots or other markers to your image. This widget is extremely easy to use and is a great way to add some interactivity to your images.</p>\n<p><a href=\"https://magic.wpcolors.net/counter-pro/\" rel=\"nofollow ugc\"><strong>Mg Counter</strong></a><br />\nThe Mg Counter Elementor widget is a great way to display important statistics on your website. It&#8217;s easy to use and highly customizable, making it a great choice for any website. Plus, the widget is responsive and retina-ready, so it looks great on any device.</p>\n<p><a href=\"https://magic.wpcolors.net/content-switcher/\" rel=\"nofollow ugc\"><strong>Content Switcher</strong></a><br />\nThe Magical Content Switcher Elementor widget allows you to switch between different pieces of content on your page. This is a great way to showcase different pieces of content, or to create a more interactive experience for your users. The widget is very easy to use and is a great way to add more interactivity to your pages.</p>\n<p>[<strong>Price comparison</strong>]<br />\nMagical &#8220;Price Comparison&#8221; widget is a great way to compare prices of products and services. By using this widget, you can easily compare the prices of two or more products or services side by side. This is a great way to make sure you are getting the best deal possible.</p>\n<p><a href=\"https://magic.wpcolors.net/animated-heading/\" rel=\"nofollow ugc\"><strong>Animated Heading</strong></a><br />\nMagical Animated Heading widget allows you to add an animated heading to your website, which can really help to grab attention and make your site stand out. The widget is easy to use and highly customizable, so you can really make it your own. Plus, the widget is responsive, so it will look great on all devices.</p>\n<p>[<strong>Ajax Search</strong>]<br />\nMagical ajax search Elementor widget is the perfect way to add a search box to your Elementor-based website. This widget allows you to add a search box to any page or post, and it will search your site for the terms you enter. You can also use it to search for specific posts or pages.</p>\n<p><a href=\"https://magic.wpcolors.net/advance-ticker/\" rel=\"nofollow ugc\"><strong>Advanced Ticker</strong></a><br />\nThe Advanced Ticker Elementor widget is a powerful tool that allows you to easily create and manage tickers for your website. With this widget, you can create a variety of tickers, including news tickers, sports tickers, and stock tickers. You can also customize the look and feel of your tickers, and manage their settings from a central location. This widget is an essential tool for any website that wants to offer a variety of tickers to its visitors.</p>\n<p><strong>Note:</strong> This plugin is an addon of Elementor Page Builder. So the plugin only work with Elementor Page Builder plugin.<br />\n(https://wordpress.org/plugins/elementor/)</p>\n<h4>Translations</h4>\n<ul>\n<li>English</li>\n</ul>\n",
        "installation": "<p>This section describes how to install the plugin and get it working.</p>\n<p>e.g.</p>\n<h4>First things first, thank you for choosing our Magical Addons plugin!</h4>\n<h4>You can install the plugin one of two ways:</h4>\n<p>Install using FTP</p>\n<ul>\n<li>Unzip the <strong>magical-addons-for-elementor.zip</strong> file locally to your machine</li>\n<li>Connect to your FTP area using your preferred FTP package</li>\n<li>Upload the <strong>magical-addons-for-elementor.zip</strong> folder that you extracted from the zip file to the plugin folder of your WordPress installation (<strong>wp-content -&gt; plugin</strong>)</li>\n<li>Go to <strong>plugin </strong> and activate Magical Addons For Elementor.</li>\n</ul>\n<p>Install by WordPress (recommended)</p>\n<ul>\n<li>Login to your WordPress admin area.</li>\n<li>Navigate to <strong>plugin</strong> and click the <strong>Add New</strong> button at the top.</li>\n<li>Click the <strong>Upload plugin</strong> button at the top.</li>\n<li>Click the <strong>Choose File</strong> button and locate the <strong>Home animation-animation-slider.zip</strong> file on your machine and click the <strong>Install Now</strong> button.</li>\n<li>On the basis the plugin installs correctly, click the <strong>Activate</strong> link.</li>\n</ul>\n",
        "faq": "\n<dt id='does%20it%20work%20with%20any%20wordpress%20theme%3F'>\nDoes it work with any WordPress theme?\n</h4>\n<p>\n<p>Yes, it will work with any WordPress theme as long as you are using Elementor as a page builder.</p>\n</p>\n<dt id='will%20this%20plugin%20slow%20down%20my%20website%20speed%3F'>\nWill this plugin slow down my website speed?\n</h4>\n<p>\n<p>No, the plugin don&#8217;t slow your website.</p>\n</p>\n<dt id='can%20i%20use%20the%20plugin%20without%20elementor%20page%20builder%3F'>\nCan I use the plugin without Elementor Page Builder?\n</h4>\n<p>\n<p>No. You cannot use without Elementor since it’s an addon for Elementor.</p>\n</p>\n\n",
        "changelog": "<h4>1.2.0</h4>\n<pre><code>* Progressbar widget issue fixed\n* Updated mg slider options\n</code></pre>\n<h4>1.1.42</h4>\n<pre><code>* Security update\n</code></pre>\n<h4>1.1.41</h4>\n<pre><code>* Contact Form7 Style added\n</code></pre>\n<h4>1.1.40</h4>\n<pre><code>* Security Update\n</code></pre>\n<h4>1.1.39</h4>\n<pre><code>* Update slider style and scripts\n</code></pre>\n<h4>1.1.38</h4>\n<pre><code>* Security Issue Fixed\n* Team member widget social issue fixed\n</code></pre>\n<h4>1.1.37</h4>\n<pre><code>* Reduced Loading time\n* carousel issue fixed\n</code></pre>\n<h4>1.1.35</h4>\n<pre><code>* Fixed Security Issue\n</code></pre>\n<h4>1.1.34</h4>\n<pre><code>* New Options added for slider widget\n</code></pre>\n<h4>1.1.33</h4>\n<pre><code>* Updated some widgts bug\n</code></pre>\n<h4>1.1.31</h4>\n<pre><code>* Updated Dual button widget\n* Updated call to action widget\n* Updated banner widget\n</code></pre>\n<h4>1.1.31</h4>\n<pre><code>* Added widgets content template code for real time live update\n* 25 widgets update \n* SVG icons support added\n</code></pre>\n<h4>1.1.28</h4>\n<pre><code>* Replaced Elementor deprecated code \n* Dual button style added\n</code></pre>\n<h4>1.1.27</h4>\n<pre><code>* Pricing Table button alignment option added\n* Info Box full hover feature added\n* Dula Button 2nd button issue fixed\n</code></pre>\n<h4>1.1.26</h4>\n<pre><code>* Pricing Table title and list issue fixed\n* Posts list text issue fixed\n</code></pre>\n<h4>1.1.23</h4>\n<pre><code>* Dual Button style added and text added\n</code></pre>\n<h4>1.1.20</h4>\n<pre><code>* Fixed scroll to top style issue\n</code></pre>\n<h4>1.1.19</h4>\n<pre><code>* Replaced deprecated Elementor function\n</code></pre>\n<h4>1.1.18</h4>\n<pre><code>* Checked Elementor Latest version\n* Added new style for scroll to top\n</code></pre>\n<h4>1.1.16</h4>\n<pre><code>* Checked WordPress Latest version\n* Checked Elementor Latest version\n</code></pre>\n<h4>1.1.15</h4>\n<pre><code>* Astra theme Header Footer issue fixed\n* Oceanwp theme Header Footer issue fixed\n* Generatepress theme Header Footer issue fixed\n* Storefront theme Header Footer issue fixed\n* Body fonts issue fixed\n</code></pre>\n<h4>1.1.14</h4>\n<pre><code>* Header Footer builder added\n</code></pre>\n<h4>1.1.13</h4>\n<pre><code>* Countdown widget label options added\n</code></pre>\n<h4>1.1.12</h4>\n<pre><code>* Nav menu js undefined issue fixed\n* Template library js issue fixed\n</code></pre>\n<h4>1.1.11</h4>\n<pre><code>* Added new section &amp; pages\n* Fixed menu style\n</code></pre>\n<h4>1.1.10</h4>\n<pre><code>* Added new options and info\n* Fixed some PHP error\n</code></pre>\n<h4>1.1.9</h4>\n<pre><code>* Published premium version\n* Added new premade sections, blocks, pages\n* New options added some widges\n</code></pre>\n<h4>1.1.8</h4>\n<pre><code>* New options added for Mailchimp widget\n* Site logo widget issue fixed\n* One js issue fixed\n</code></pre>\n<h4>1.1.7</h4>\n<pre><code>* Added advanced skillbar widget \n* Fixed progressbar widget js issue\n* New options added in card widget\n</code></pre>\n<h4>1.1.6</h4>\n<pre><code>* Added Mailchimp widget\n* Added new options in nav menu widget\n* Fixed all css3 issued\n* Fixed API error\n</code></pre>\n<h4>1.1.5</h4>\n<pre><code>* Added template library\n* Fixed some widget issues\n</code></pre>\n<h4>1.1.4</h4>\n<pre><code>* Data Table widget added\n* Nav Menu widget added\n* update banner widget\n* update call to action widget\n* update content reveal widget\n* update dual button widget\n* update flipbox widget\n* update icon list widget\n* update image accordion widget\n* update qoute widget\n* update qoute widget\n* update tabs widget\n* update text effects widget\n</code></pre>\n<h4>1.1.3</h4>\n<pre><code>* Search bar widget adde\n* Categories/Tags list widget added\n* Scroll to top widget added\n* Site logo widget added\n* Template insert widget added\n* Info List widget added\n</code></pre>\n<h4>1.1.2</h4>\n<pre><code>* Image comparison added\n* Image Accordion added\n* Content Reveal added\n* Flip Box added\n* Call To Action added\n* Dual Button added\n* Icon List added\n* Image Smooth Scroll added\n</code></pre>\n<h4>1.1.1</h4>\n<ul>\n<li>PieChart Widget added</li>\n<li>Share Buttons Widget added</li>\n<li>Contact Form7 Widget added</li>\n<li>WP Forms Widget added</li>\n<li>Fixe some php bugs</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Blockquote Widget added</li>\n</ul>\n<h4>1.0.17</h4>\n<p>Tested with Elementor 4.7<br />\nInfo box widget linking issue fixed</p>\n<h4>1.0.10</h4>\n<p>Tested with WordPress 5.5<br />\nAdded some demo</p>\n<h4>1.0.9</h4>\n<p>Added &#8211; New style for Accordion<br />\nAdded &#8211; New style for tab</p>\n<h4>1.0.8</h4>\n<p>Added &#8211; Video card widget<br />\nAdded &#8211; section title widget<br />\nAdded &#8211; New style Info box<br />\nAdded &#8211; Card widget Badg and options<br />\nAdded &#8211; Progressbar widget new style and animation<br />\nAdded &#8211; New options for countdown timer<br />\nAdded &#8211; New options for hover card<br />\nAdded &#8211; New image options for pricing table<br />\nAdded &#8211; New image options for pricing table</p>\n<h4>1.0.6</h4>\n<p>Added &#8211; List Post widget<br />\nAdded &#8211; Grid Post options<br />\nFixed &#8211; Info box style</p>\n<h4>1.0.5</h4>\n<p>Added &#8211; Grid Post widget</p>\n<h4>1.0.4</h4>\n<p>Added &#8211; Slider widget<br />\nAdded &#8211; About us widget</p>\n<h4>1.0.2</h4>\n<p>Added &#8211; Accordion widget<br />\nAdded &#8211; Timeline widget<br />\nFixed &#8211; Some php issue</p>\n<h4>1.0.1</h4>\n<p>Added &#8211; Team Members widget<br />\nAdded &#8211; Card widget<br />\nEdited &#8211; Pricing table widget</p>\n<h4>1.0.0</h4>\n<p>Released version</p>\n"
    },
    "short_description": "Comes with 60+ Widgets, 100+ premade sections and blocks, Header Footer builder, 20+ template kits that help you build your websites in less time.",
    "description": "<p>The best part of Magical Addons is that you can design anything without having to touch a single line of code. Magical Addons has a huge collection of premium and highly functional extensions that can be used in an Elementor page builder. This is really a premium plugin that you can get for free.</p>\n<p><a href=\"https://magic.wpcolors.net/\" rel=\"nofollow ugc\"><strong>Check Elementor Magical Addons Demo Pages</strong></a></p>\n<p>Comes with 60+ Widgets, 100+ premade sections and blocks, 20+ template kits that help you build your websites in less time with no coding. our blocks and template library growing every week.</p>\n<h3>See Short video</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/bKLwBrxVjno?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Header &amp; Footer builder Short video</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/qOCqMaPNads?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Magical Addons Widgets List:</h3>\n<ul>\n<li><strong>All Free Widgets List:</strong></li>\n</ul>\n<ol>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-banner/\" rel=\"nofollow ugc\"><strong>Banner Widget</strong></a><br />\nCreate your website banner with the banner widget advance options. The banner widget has two different styles with huge options.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-slider/\" rel=\"nofollow ugc\"><strong>Animation Slider</strong></a><br />\nYou can create an awesome animation slider with images and text with our Animation Slider widget. The widget gives you a huge number of customizable options with animation so you can create elegant-looking sliders in a minute!!</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-info-box/\" rel=\"nofollow ugc\"><strong>Info Box</strong></a><br />\nShow any kind of information with a beautiful design. A magical info box creates your website more attractive.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-call-to-action/\" rel=\"nofollow ugc\"><strong>Call to action</strong></a><br />\nContent, image and button in one place with many styles and options in call to action widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-tabs/\" rel=\"nofollow ugc\"><strong>Tabs</strong></a><br />\nCreate both Vertical and Horizontal tabs with huge options &amp; features. Hope you will enjoy our tabs widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/countdown-timer/\" rel=\"nofollow ugc\"><strong>Countdown</strong></a><br />\nThe countdown widget allows you to display a timer that counts down to a specific time or date. It’s perfect for under-construction pages, sale items, events etc.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-dual-heading/\" rel=\"nofollow ugc\"><strong>Dual Heading</strong></a><br />\nYou can create a headline with 2 different styles with this widget. Dual Heading Widget has every possible option.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-team-members/\" rel=\"nofollow ugc\"><strong>Team Members</strong></a><br />\nThe best way to build a team grid is to introduce your team members, co-workers, etc. you can easily customize the team member widget as per your need.</p>\n</li>\n<li>\n<p>Timeline<br />\nCreate your timeline using the Magical timeline widget and showcase your timeline horizontal and vertical with awesome style.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-accordion/\" rel=\"nofollow ugc\"><strong>Accordion</strong></a><br />\nDisplay your website content in a foldable and succinct way using the Accordion widget. You can easily create your website faq section with the widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-about-widget/\" rel=\"nofollow ugc\"><strong>About me</strong></a><br />\nDisplay about your details on your webpage by the magical about me widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/progress-bar/\" rel=\"nofollow ugc\"><strong>Progress Bar</strong></a><br />\nProgress Bar Widget helps you to display user skills, task progress, download percentage, and other progressions in an awesome way.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-social-share/\" rel=\"nofollow ugc\"><strong>Social Share</strong></a><br />\nVisitors can share your content on their social media accounts with one button click. it\\&#8217;s a wonderful feature for improving your site Impressions</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-info-list/\" rel=\"nofollow ugc\"><strong>Info List</strong></a><br />\nYou can easily list your information by the Magical Elementor info list widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-dual-button/\" rel=\"nofollow ugc\"><strong>Dual Button</strong></a><br />\nDisplay two buttons side by side with two different styles by dual button widget. Dual Button perfect for banner, call to action and any other section. It will improve your website visibility.</p>\n</li>\n<li>\n<p>Template Insert<br />\nYou can insert your Elementor save the template by the template insert widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-back-to-top/\" rel=\"nofollow ugc\"><strong>Back to top</strong></a><br />\nElementor Back to top widget helps your visitor one click go page top easily. You can use the Back to top both in section and page.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/section-title/\" rel=\"nofollow ugc\"><strong>Section Title</strong></a><br />\nEvery website has a different style section title. Now you can easily create many different style section titles with the Elementor magical section title widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-card/\" rel=\"nofollow ugc\"><strong>Card</strong></a><br />\nDisplay your content like services, products, offers and other items by our Elementor magical Card Widget on your WordPress website.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-dual-heading/\" rel=\"nofollow ugc\"><strong>Dual Heading</strong></a><br />\nDisplay two different style heading by Elementor magical dual heading widget.</p>\n</li>\n<li>\n<p>Text Effects<br />\nYou can add many different text effects to your webpage text. You can create an animation header or highlighted text animation by Elementor magical text effects widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-block-quote/\" rel=\"nofollow ugc\"><strong>Blockquote</strong></a><br />\nElementor blockquote widget is free. Now you can create awesome blockquote in your website content easily by Elementor magical Blockquote widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/video-edit-page/\" rel=\"nofollow ugc\"><strong>Video Card</strong></a><br />\nShow your website content with video by the Elementor Magical video card widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-content-reveal/\" rel=\"nofollow ugc\"><strong>Content Reveal/Unfold</strong></a><br />\nYou can fit long text in a small area by the Content Reveal /Unfold widget. Elementor magical Content Reveal /Unfold widget is an awesome trick as it will make your layout design look better.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-icon-list/\" rel=\"nofollow ugc\"><strong>Icon List</strong></a><br />\nYou cat crate list with icon by Elementor magical icon list widget. You can set any icon from the icon library with huge options.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/pricing-table/\" rel=\"nofollow ugc\"><strong>Pricing Table</strong></a><br />\nYou can display detailed single prices or comparison pricing plans with the Elementor magical pricing table. Pricing table is a great way to boost your sales and engage more potential buyers.</p>\n</li>\n<li>\n<p>Data Table<br />\nElementor magical data table widget will let you create data tables with advanced styling options and features. Now show your data with a customizable table.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-flip-box/\" rel=\"nofollow ugc\"><strong>Flip Box</strong></a><br />\nElementor magical Flip Box Widget comes with cool 3D interactive effects. The Flip Box highlights your content in a great way.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-hover-card/\" rel=\"nofollow ugc\"><strong>Hover Card</strong></a><br />\nLots of hover effects are added in the Elementor magical hover card widget.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-image-comparison/\" rel=\"nofollow ugc\"><strong>Image Comparison</strong></a><br />\nElementor magical image comparison can compare two pictures with draggable or mouse hover options in horizontal and vertical layouts.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-accordion/\" rel=\"nofollow ugc\"><strong>Image Accordion</strong></a><br />\nCreate eye-catching image accordions in both vertical and horizontal orientations inside with Elementor magical image accordion.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-image-scroll/\" rel=\"nofollow ugc\"><strong>Image Smooth Scroll</strong></a><br />\nElementor magical image smooth scroll allows you to display an image attractive scrolling way</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/magical-posts-grid/\" rel=\"nofollow ugc\"><strong>Posts Grid</strong></a><br />\nDisplay your website posts in many different grid styles with advanced posts query</p>\n</li>\n<li>\n<p><strong>Posts List</strong><br />\nYou can easily display your website posts in many different list styles with Elementor magical posts list widget.</p>\n</li>\n<li>\n<p><strong>Site Logo</strong><br />\nThe Magical Site Logo Elementor widget is a versatile tool that allows you to easily add a logo to your website. With this widget, you can upload your own logo image or add text logo. You can also adjust the size, color, and position of your logo. This widget is a quick and easy way to add a professional touch to your website.</p>\n</li>\n<li>\n<p><strong>Nav Menu</strong><br />\nNow, you build outstanding navigation menus in Elementor using the nav menu Widget with dozens of options.</p>\n</li>\n<li>\n<p><strong>Category/tag list</strong><br />\nNow, You can easily display posts category or tag lists on pages or sections.</p>\n</li>\n<li>\n<p><strong>Mailchimp Widget</strong><br />\nNow you can personalize your Mailchimp sign-up form with attractive and multiple styles With our Mailchimp Elementor addons.</p>\n</li>\n<li>\n<p><strong>advanced Skillbar</strong><br />\nThe Magical Advanced Skillbar Elementor widget is a great way to display your skills and expertise on your website. It allows you to easily create a beautiful and professional looking skillbar, without having to code or design anything yourself. The widget is extremely easy to use and comes with a variety of options to customize it to your needs</p>\n</li>\n<li>\n<p><strong>Search Bar</strong><br />\nNow, you can customize your WordPress search bar in a unique way with Multiple styles.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-contact-form/\" rel=\"nofollow ugc\"><strong>Contact Form 7</strong></a><br />\nContact Form 7 Elementor Widget will help you to display contact forms on your website.</p>\n</li>\n<li>\n<p><a href=\"https://magic.wpcolors.net/mg-contact-form/\" rel=\"nofollow ugc\"><strong>WpForms</strong></a><br />\nDisplay easily WPForms plugin forms ease way using the Elementor magical WPForms widget.</p>\n</li>\n</ol>\n<ul>\n<li><strong>All Pro Widgets List:</strong></li>\n</ul>\n<p><a href=\"https://magic.wpcolors.net/filter-gallery/\" rel=\"nofollow ugc\"><strong>Portfolio/Filter Gallery</strong></a><br />\nPortfolio gallery is an a awesome for display portfolio items or filter image gallery.</p>\n<p><a href=\"https://magic.wpcolors.net/lottie/\" rel=\"nofollow ugc\"><strong>Lottie Animations</strong></a><br />\nThe Lottie Animation pro Elementor widget makes it easy to add Lottie animations to your Elementor-based website. With this addon, you can easily add Lottie animations to any Elementor widget or section. You can also control the playback of the animation, as well as the animation speed.</p>\n<p><a href=\"https://magic.wpcolors.net/info-carousel/\" rel=\"nofollow ugc\"><strong>Info Box Carousel</strong></a><br />\nThe Magical Info Box Carousel Elementor widget is a great way to showcase important information on your website in a carousel format. This widget is highly customizable, allowing you to change the number of slides, the order of the slides, the layout of the slides, and more. This widget is a great way to draw attention to important information on your website.</p>\n<p><a href=\"https://magic.wpcolors.net/bar-chart-pro/\" rel=\"nofollow ugc\"><strong>Bar Chart</strong></a><br />\nThe Magical Bar Chart Elementor widget is a great way to display data in a visually appealing way. This widget allows you to choose from a variety of chart types and customize the look and feel of your chart. You can also add a variety of data labels to your chart to make it even more informative.</p>\n<p><a href=\"https://magic.wpcolors.net/testmonial-pro/\" rel=\"nofollow ugc\"><strong>Testimonial Carousel</strong></a><br />\nThe Magical Testimonial Carousel Elementor widget is an excellent way to display testimonials on your website. The widget is fully responsive and looks great on all devices. It is also very easy to customize and change the look and feel of the widget to match your website&#8217;s style. Overall, the Testimonial Carousel Elementor widget is a great way to display testimonials on your website.</p>\n<p><a href=\"https://magic.wpcolors.net/promo-box-pro/\" rel=\"nofollow ugc\"><strong>Promo Box</strong></a><br />\nThe Magical Promo Box Elementor widget is a great way to promote your products or services on your website. It allows you to add a title, text, image, and button to your promotion, making it easy to grab attention and get your message across. The widget is also fully customizable, so you can change the colors, font, and size of your promotion to match your website&#8217;s look and feel.</p>\n<p><a href=\"https://magic.wpcolors.net/price-menu-pro/\" rel=\"nofollow ugc\"><strong>Price Menu</strong></a><br />\nThe Magical Price Menu Elementor widget is a great way to add a pricing menu to your website. It&#8217;s easy to use and lets you create a beautiful, responsive pricing menu that will look great on any device.</p>\n<p><a href=\"https://magic.wpcolors.net/photo-bunch/\" rel=\"nofollow ugc\"><strong>Photo Bunch</strong></a><br />\nThe Magical Photo Bunch widget is a great way to display a bunch of photos in a grid. It&#8217;s perfect for displaying a portfolio of photos, or a gallery of photos. The widget is responsive, so it will look great on all devices. The widget is easy to use, and it&#8217;s a great way to showcase a bunch of photos.</p>\n<p><a href=\"https://magic.wpcolors.net/pdf-view/\" rel=\"nofollow ugc\"><strong>PDF View</strong></a><br />\nThe Magical PDF View Elementor widget allows you to embed a PDF document in your web page. This is a great way to share documents with your audience, and the widget makes it easy to embed the PDF into your page. The PDF View Elementor widget is a great way to share documents with your audience.</p>\n<p>[<strong>One Page Nav</strong>]<br />\nThe Magical One Page Nav Elementor widget is a powerful tool that allows you to quickly and easily create a custom one page navigation menu for your website. With this widget, you can easily add new pages, change the order of your pages, and even add custom CSS to further customize your menu. This widget is the perfect solution for creating a custom one page navigation menu for your website.</p>\n<p><a href=\"https://magic.wpcolors.net/off-canvas/\" rel=\"nofollow ugc\"><strong>Off Canvas</strong></a><br />\nThe Magical Off-canvas is an Elementor widget that allows you to create a hidden sidebar, which can be revealed by clicking on a button or icon. This is a useful way to create a hidden menu, or to display additional information that you don&#8217;t want to clutter up your main content area.</p>\n<p><a href=\"https://magic.wpcolors.net/modal-popup/\" rel=\"nofollow ugc\"><strong>Modal/Popup</strong></a><br />\nThe Magical Popup Elementor widget is a great way to display important information on your website in a modal window. This widget is easy to use and configure, and it offers a variety of options to customize the look and feel of the popup. You can use the Popup Elementor widget to display a contact form, newsletter signup form, or any other content that you want to highlight on your website.</p>\n<p><a href=\"https://magic.wpcolors.net/hotspot-pro/\" rel=\"nofollow ugc\"><strong>Image Hotspots</strong></a><br />\nThe Magical Image Hotspots Elementor widget is a great way to add interactive hotspots to your images. You can use it to create custom hotspots with text and links, or to simply add dots or other markers to your image. This widget is extremely easy to use and is a great way to add some interactivity to your images.</p>\n<p><a href=\"https://magic.wpcolors.net/counter-pro/\" rel=\"nofollow ugc\"><strong>Mg Counter</strong></a><br />\nThe Mg Counter Elementor widget is a great way to display important statistics on your website. It&#8217;s easy to use and highly customizable, making it a great choice for any website. Plus, the widget is responsive and retina-ready, so it looks great on any device.</p>\n<p><a href=\"https://magic.wpcolors.net/content-switcher/\" rel=\"nofollow ugc\"><strong>Content Switcher</strong></a><br />\nThe Magical Content Switcher Elementor widget allows you to switch between different pieces of content on your page. This is a great way to showcase different pieces of content, or to create a more interactive experience for your users. The widget is very easy to use and is a great way to add more interactivity to your pages.</p>\n<p>[<strong>Price comparison</strong>]<br />\nMagical &#8220;Price Comparison&#8221; widget is a great way to compare prices of products and services. By using this widget, you can easily compare the prices of two or more products or services side by side. This is a great way to make sure you are getting the best deal possible.</p>\n<p><a href=\"https://magic.wpcolors.net/animated-heading/\" rel=\"nofollow ugc\"><strong>Animated Heading</strong></a><br />\nMagical Animated Heading widget allows you to add an animated heading to your website, which can really help to grab attention and make your site stand out. The widget is easy to use and highly customizable, so you can really make it your own. Plus, the widget is responsive, so it will look great on all devices.</p>\n<p>[<strong>Ajax Search</strong>]<br />\nMagical ajax search Elementor widget is the perfect way to add a search box to your Elementor-based website. This widget allows you to add a search box to any page or post, and it will search your site for the terms you enter. You can also use it to search for specific posts or pages.</p>\n<p><a href=\"https://magic.wpcolors.net/advance-ticker/\" rel=\"nofollow ugc\"><strong>Advanced Ticker</strong></a><br />\nThe Advanced Ticker Elementor widget is a powerful tool that allows you to easily create and manage tickers for your website. With this widget, you can create a variety of tickers, including news tickers, sports tickers, and stock tickers. You can also customize the look and feel of your tickers, and manage their settings from a central location. This widget is an essential tool for any website that wants to offer a variety of tickers to its visitors.</p>\n<p><strong>Note:</strong> This plugin is an addon of Elementor Page Builder. So the plugin only work with Elementor Page Builder plugin.<br />\n(https://wordpress.org/plugins/elementor/)</p>\n<h4>Translations</h4>\n<ul>\n<li>English</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/magical-addons-for-elementor.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/magical-addons-for-elementor/assets/screenshot-1.png?rev=2748124",
            "caption": "Magical Addons All Widgets with countdown and animated text."
        },
        {
            "src": "https://ps.w.org/magical-addons-for-elementor/assets/screenshot-2.png?rev=2748124",
            "caption": "Magical Addons Team members widget."
        },
        {
            "src": "https://ps.w.org/magical-addons-for-elementor/assets/screenshot-3.jpg?rev=2748124",
            "caption": "Magical Addons Tabs and list card."
        },
        {
            "src": "https://ps.w.org/magical-addons-for-elementor/assets/screenshot-4.png?rev=2748124",
            "caption": "Magical Addons Pricing table."
        },
        {
            "src": "https://ps.w.org/magical-addons-for-elementor/assets/screenshot-5.png?rev=2748124",
            "caption": "Magical Addons Posts list."
        },
        {
            "src": "https://ps.w.org/magical-addons-for-elementor/assets/screenshot-6.png?rev=2748124",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/magical-addons-for-elementor/assets/screenshot-7.png?rev=2748124",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/magical-addons-for-elementor/assets/screenshot-8.png?rev=2748124",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/magical-addons-for-elementor/assets/screenshot-9.png?rev=2748124",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/magical-addons-for-elementor/assets/screenshot-10.png?rev=2748124",
            "caption": ""
        }
    ],
    "tags": {
        "elementor": "elementor",
        "elementor-addons": "elementor addons",
        "elementor-widget": "elementor widget",
        "page-builder": "page builder",
        "template-library": "template library"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.1.40": "https://downloads.wordpress.org/plugin/magical-addons-for-elementor.1.1.40.zip"
    },
    "business_model": "commercial",
    "repository_url": "",
    "commercial_support_url": "https://wpthemespace.com/custom-service/",
    "donate_link": "https://wpthemespace.com/donation/",
    "banners": {
        "low": "https://ps.w.org/magical-addons-for-elementor/assets/banner-772x250.jpg?rev=2623712",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/magical-addons-for-elementor/assets/icon-256x256.png?rev=2235880",
        "2x": "https://ps.w.org/magical-addons-for-elementor/assets/icon-256x256.png?rev=2235880"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}