{
    "name": "Majestic Support &#8211; The Leading-Edge Help Desk &amp; Customer Support Plugin",
    "slug": "majestic-support",
    "version": "1.0.4",
    "author": "Majestic Support",
    "author_profile": "https://profiles.wordpress.org/ahmadmj/",
    "contributors": {
        "ahmadmj": {
            "profile": "https://profiles.wordpress.org/ahmadmj/",
            "avatar": "https://secure.gravatar.com/avatar/f913a3f8d2a061d63cf93017e43327d1?s=96&d=monsterid&r=g",
            "display_name": "Majestic Support"
        }
    },
    "requires": "5.5",
    "tested": "6.6.1",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 3,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 3,
    "support_url": "https://wordpress.org/support/plugin/majestic-support/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 2000,
    "downloaded": 12185,
    "last_updated": "2024-08-20 11:21am GMT",
    "added": "2023-11-24",
    "homepage": "https://www.majesticsupport.com",
    "sections": {
        "description": "<p>Majestic Support for WordPress is a top-tier ticket system that can significantly enhance your customers&#8217; support experience. This plugin generates and manages support tickets online, offering innovative features such as email piping, unlimited agents, customizable reply responses, invoicing history, and file attachment options.</p>\n<p>👉 <a href=\"http://demo.majesticsupport.com/\" rel=\"nofollow ugc\">View Demo</a> | <a href=\"https://www.youtube.com/channel/UCdEoePgwPrWaxJ__eA6vLIA\" rel=\"nofollow ugc\">Watch Videos</a> | <a href=\"https://majesticsupport.com/support/\" rel=\"nofollow ugc\">Support</a> | <a href=\"https://majesticsupport.com/\" rel=\"nofollow ugc\">Plugin Homepage</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8zdTsKbgeYE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>This plugin is particularly useful because customers can easily submit tickets from your website&#8217;s front end without needing to register. In addition, the administrator can create and complete tasks on behalf of users, streamlining the support process. Furthermore, you have complete control over the plugin&#8217;s support form customization, allowing you to display any relevant information to customers. Lastly, customers can attach files to their support tickets, ensuring that all necessary information is available to address their concerns.</p>\n<h4>Translations</h4>\n<p>Majestic Support is available in English, Arabic (العربية), German(Deutsch), Spanish(Español), French(Français), Italian(Italiano), Dutch(Nederlands), Polish(Polski), Brazilian Portuguese(Português do Brasil), Russian(Русский), Czech(Čeština), Greek(Ελληνικά), Indonesian(Bahasa Indonesia), Japanese(日本語), Swedish(Svenska), Thai(ไทย), Turkish(Türkçe), Cinese(简体中文), Malaysian(Bahasa Melayu), Korean(한국어), Romanian(Română) and Filipino(Tagalog)</p>\n<p><strong>Key Features Of Majestic Support</strong>:<br />\nKey features that make Majestic Support stand out from the rest include:</p>\n<ul>\n<li>Users on the front end can create tickets</li>\n<li>Ticket-specific smart reply answers that can be modified</li>\n<li>Allows you to place support icons in a variety of places on your website.</li>\n<li>Tickets can be made by administrators and agents on behalf of users</li>\n<li>You can manage an unlimited number of agents in the base version</li>\n<li>Users may request to have their data removed, and administrators may delete or anonymize it</li>\n<li>The base version does not impose ticket limitations</li>\n<li>Several attachments can be uploaded by a user, agent, or administrator while creating a ticket or replying to a ticket</li>\n<li>Manage an unlimited number of tickets and create an unlimited number of agent profiles</li>\n<li>Agent performance reports will provide you with valuable insights into the performance of your support system</li>\n<li></li>\n</ul>\n<h3>THE PLUGIN&#8217;S KEY FREE VERSION FEATURES THAT MAKE IT MAJESTIC:</h3>\n<p>There are many top-notch help desk plugins for WordPress, but Majestic Support stands out as the most practical one. This is because its basic free version provides several following enhancements over competing solutions.</p>\n<ul>\n<li>\n<p><strong>Smart Replies To New Tickets</strong><br />\nIn response to new tickets, the Smart Reply functionality allows you to automatically search for and provide relevant responses back to the user. When a new ticket is received, Majestic Support will perform a search and suggest quick and relevant responses to a customer query.</p>\n</li>\n<li>\n<p><strong>Fields Manager</strong><br />\nThis plugin allows you to create customized support forms by adding custom fields. An admin can add, edit, rename, publish, unpublish, and require or unrequire fields for users and visitors. Additionally, you can also change the display order of the fields, like where you want to show the fields on the support form.</p>\n</li>\n<li>\n<p><strong>Custom Fields</strong><br />\nExtra fields are sometimes required; this is no problem. Majestic Support offers 12+ custom fields (text field, dropdown, checkbox, radio button, text area, dependent fields, admin only, date, email, upload file, multi-select, and T&amp;C ).</p>\n</li>\n<li>\n<p><strong>Themes</strong><br />\nThemes make our site more beautiful and eye-catching. The plugin is flexible and easy to use, it can integrate seamlessly with any WordPress theme, so it can be used right away. With this feature, you can also change the plugin&#8217;s colors from seven preset color themes with different color palettes.</p>\n</li>\n<li>\n<p><strong>Support To Everyone</strong><br />\nBoth free and paid users can access Majestic Support; user-friendly support is also available in the form of video support. The plugin explains nearly all of its Majestic features through video tutorials.</p>\n</li>\n<li>\n<p><strong>System Log</strong><br />\nAs an admin, you&#8217;d like to know everything that happened on the system. With the system log, you will know everything about tickets, from when they arrived at your help desk to how an agent reacted to them and what happened next.</p>\n</li>\n<li>\n<p><strong>Slugs</strong><br />\nMake the web address unique according to your needs for identifying a particular page on a website in an easy-to-read form.</p>\n</li>\n</ul>\n<h3>MORE FEATURES WITH THE FREE VERSION</h3>\n<ul>\n<li>\n<p><strong>Front-end Tickets</strong>: Users can create tickets from the front end.</p>\n</li>\n<li>\n<p><strong>Visitor/Guest Tickets</strong>: Often users do not want to create an account to open a support ticket. Guest tickets are a very important feature and it is free.</p>\n</li>\n<li>\n<p><strong>Unlimited Tickets</strong>: There are not any limits on tickets in the base version.</p>\n</li>\n<li>\n<p><strong>Unlimited Agents</strong>: The system support unlimited agents in the admin area in the base version.</p>\n</li>\n<li>\n<p><strong>Support Icon</strong>: This is very important to show the support icon on your site, Majestic Support offers a support icon for the front end with various position options.</p>\n</li>\n<li>\n<p><strong>Create Ticket for Users</strong>: Admin/agent can create a ticket on behalf of any user.</p>\n</li>\n<li>\n<p><strong>GDPR</strong>: Majestic Support is fully compatible with GDPR law and can be easily configured to show GDPR-related information.</p>\n</li>\n<li>\n<p><strong>Erase Data Requests</strong>: Users can ask to erase their data and the admin has the option to delete or anonymize their data.</p>\n</li>\n<li>\n<p><strong>Multiple Attachments</strong>: User/agent/admin can upload multiple attachments in ticket creation and ticket replies</p>\n</li>\n<li>\n<p><strong>Attachment Size and Type</strong>: Admin can control ticket attachments by their size and extension type.</p>\n</li>\n<li>\n<p><strong>Powerful Filters and Sorting</strong>: The system offers powerful filters for both user and admin to search tickets with sorting options.</p>\n</li>\n<li>\n<p><strong>Priorities</strong>: Priority associated with the ticket defines the importance, and the system highlights the priorities with an admin-defined different color on the ticket listing and ticket detail page.</p>\n</li>\n<li>\n<p><strong>Unlimited Departments</strong>: Create departments that relate to the various business units in your organization. It will be sales, support, and billing, you can create any department in the admin panel. The user will select a department when he creates the ticket.</p>\n</li>\n<li>\n<p><strong>Ticket Status</strong>: Show the ticket status message and different colors to highlight it.</p>\n</li>\n<li>\n<p><strong>Email Notification</strong>: The system sends an email notification to the user, agents, and admin in different actions i.e new ticket, reply, close ticket, etc.</p>\n</li>\n<li>\n<p><strong>Edit Ticket</strong>: Admin/agent can edit any ticket at any time.</p>\n</li>\n<li>\n<p><strong>Registration</strong>: The system offers a beautiful registration form to register a new user.</p>\n</li>\n<li>\n<p><strong>Login Form</strong>: The system has its login form to log in to the user.</p>\n</li>\n<li>\n<p><strong>Captcha/ReCaptcha</strong>: Another exciting feature. The system offers its captcha and googles Recaptcha to stop spamming.</p>\n</li>\n<li>\n<p><strong>Thank you Message for Visitor</strong>: Admin can add a special message for the visitor, a message will show after the successful ticket submission.</p>\n</li>\n<li>\n<p><strong>HTML Editor</strong>: HTML editor for ticket summary, ticket reply, notes, etc.</p>\n</li>\n<li>\n<p><strong>Term &amp; Conditions</strong>: Admin can add Terms &amp; Conditions on the ticket submission page.</p>\n</li>\n<li>\n<p><strong>Themes</strong>: Themes make our site more beautiful and eye catchy. By using this feature, you can change your plugin colors or can select colors from seven preset color themes with different color palettes.</p>\n</li>\n<li>\n<p><strong>Email Templates</strong>: Majestic Support offers full power to the admin, the admin can edit any email template in the HTML editor. The system includes beautiful predefined email templates.</p>\n</li>\n<li>\n<p><strong>Custom Message for new ticket</strong>: This is an important feature in that the admin shows a message/instruction (any message in Text Editor) on the ticket submission form.</p>\n</li>\n<li>\n<p><strong>Admin/Agent Only</strong>: This field is visible to the admin and agent only.</p>\n</li>\n<li>\n<p><strong>Hide Agent/Admin Info</strong>: Admin can hide agent information like email, and name from the user.</p>\n</li>\n<li>\n<p><strong>Email Configuration</strong>: Another admin power is the system offering enable/disable action base email notifications like ticket reply, close ticket, change priority, etc.</p>\n</li>\n<li>\n<p><strong>Strength &amp; Flexibility</strong>: Majestic Support is built using WordPress best practices both on the front end and the back end. This results in an efficient, robust, and intuitive plugin.</p>\n</li>\n<li>\n<p><strong>Easy to Use:</strong> The ticket system builds based on the latest style. You will find it very easy to use.</p>\n</li>\n<li>\n<p><strong>RTL ready</strong>: Majestic Support also supports RTL languages.</p>\n</li>\n<li>\n<p><strong>Fully Responsive</strong>: Majestic Support work on all type of devices including smartphones, tablets, laptops, and desktops. Layouts auto-adjust according to devices.</p>\n</li>\n<li>\n<p><strong>System Errors</strong>: The system record every error and shows it in the admin area.</p>\n</li>\n<li>\n<p><strong>Hide/Show Menu</strong>: In configurations, administrators can hide or show Majestic Support for any menu item.</p>\n</li>\n<li>\n<p><strong>Translation</strong>: Majestic Support is multi-language and has over 35 translations available.</p>\n</li>\n<li>\n<p><strong>Pagination</strong>: On the configurations page, the administrator can specify one record per page.</p>\n</li>\n<li>\n<p><strong>Majestic Support has reported on</strong></p>\n</li>\n<li>Get a summary of tickets handled by every staff member</li>\n<li>Get a detailed report of tickets handled by every staff member</li>\n<li>Get a detailed report of tickets created by every user</li>\n<li>Get a summary of tickets by status</li>\n<li>Get a summary of tickets by priorities</li>\n<li>Get a summary of tickets by departments</li>\n<li>Get a summary of tickets created by the channel</li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/YDYnagRWyEU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>PREMIUM EXTENTIONS</h3>\n<p>In addition to providing a thorough overview of your support tickets, the plugin offers several handy premium features that make them easier to manage.</p>\n<ul>\n<li>\n<p><a href=\"https://majesticsupport.com/product/email-piping/\" rel=\"nofollow ugc\">Agents</a> &#8211; Agents assist users connected to the support system and play a crucial role in the help desk. By adding this add-on, you may add more agents and give them different permissions to make it easier for users to take action on their tickets. Additionally, agents can create, delete, close, and perform any other action given to them by the admin.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/agent-auto-assignment/\" rel=\"nofollow ugc\">Agent Auto Assign</a> &#8211; Ticket auto-assignment is a simple but critical process in the handling and closing of help desk tickets. When auto-assign is enabled, the ticket is assigned to an appropriate agent based on the rules.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/multiple-ticket-forms/\" rel=\"nofollow ugc\">Multi Forms</a> &#8211; By using this multi-form functionality, admins, agents, and users, as well as visitors with the necessary permissions, can create different ticket forms to accommodate various request types based on user roles.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/email-piping/\" rel=\"nofollow ugc\">Email Piping</a> &#8211; From the comfort of an email account, create tickets or reply to them. For example, you could offer your clients a special email address like support@yourdomain.com. The emails received in this email will be converted to tickets. The add-on also contains built-in options to control how to manage responses to tickets that have been closed, unrecognized email addresses, and much more.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/merge-tickets/\" rel=\"nofollow ugc\">Merge Tickets</a> &#8211; Hundreds of tickets have been submitted for assistance, some of which may be on the same topic and have similar questions. To provide support for each ticket with the same topic would be a waste of time. With this add-on, you can merge any of the two tickets or more with the same topic and query and provide support.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/private-credentials/\" rel=\"nofollow ugc\">Private Credentials</a> &#8211; This feature gives your tickets an additional layer of security so that users can safely enter passwords and other sensitive credentials onto the tickets.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/paid-support/\" rel=\"nofollow ugc\">Paid Support</a> &#8211; For using your support services, charge users. Create subscriptions based on duration, such as a monthly membership, or the number of tickets, like 10 tickets per month, or charge for each ticket.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/time-tracking/\" rel=\"nofollow ugc\">Time Tracking</a> &#8211; Track the time spent on tickets in the most precise manner while also providing client and agent-level reporting. Keep a manual record of the time invested in each ticket response.  When the ticket is open in the agent&#8217;s browser track the time with a single click, and stop the time tracking with one click once the agent has finished with the ticket.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/ticket-overdue/\" rel=\"nofollow ugc\">Ticket Overdue</a> &#8211; An &#8220;overdue ticket&#8221; is one that has not been resolved or has not been responded to in a timely manner. By adding this add-on, you can set auto-overdue tickets, overdue by priority, and cron job overdue.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/export-tickets/\" rel=\"nofollow ugc\">Export</a> &#8211; Exports are used to keep data on the local system. By adding this add-on, you can export any of the ticket data, like ticket detail, ticket history, etc.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/ticket-history/\" rel=\"nofollow ugc\">Ticket History</a> &#8211; As an admin, you&#8217;d like to know everything that happened on a ticket, from when it arrived at your help desk to how an agent reacted to it and what happened next. So, with the ticket history extension, you can see a summary of all the activities that have taken place on a ticket.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/auto-close-ticket/\" rel=\"nofollow ugc\">Ticket Auto Close</a> &#8211; Automatic ticket closure reduces your effort to close the ticket manually. By enabling the add-on, tickets will be automatically closed after a set period or pre-defined rules, as determined by the administrator. While a ticket is open, it can also be closed based on the agent&#8217;s response.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/feedback/\" rel=\"nofollow ugc\">Feedback</a> &#8211; By adding this add-on, you can get feedback from your users to enhance the quality of your services. This add-on allows you to automatically collect feedback responses that rate your agent’s performance on a ticket. This add-on sends a feedback link after a ticket is closed. The user will click on a survey link and fill out the survey form on your website.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/helptopic/\" rel=\"nofollow ugc\">Help Topic</a> &#8211; The Help Topic is used to assist the end user in locating the desired area where they want to get instant support. By adding this add-on, you can add multiple help topics with different names to help your customers more easily.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/internal-note/\" rel=\"nofollow ugc\">Private Note</a> &#8211; Add notes to tickets that are only visible to agents and administrators.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/knowledge-base/\" rel=\"nofollow ugc\">Knowledge Base</a> &#8211; With this add-on, you can add several knowledge bases and group solutions into various categories to better serve users. Knowledge bases are typically used to respond to basic customer inquiries.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/canned-responses/\" rel=\"nofollow ugc\">Canned Response</a> &#8211; Predetermined answers to typical inquiries are referred to as canned answers. Instead of constantly typing the same response or pasting it from another source, the agent can insert a premade response that is activated by keystrokes or from a drop-down menu by adding this add-on.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/max-tickets/\" rel=\"nofollow ugc\">Max Tickets</a> &#8211; The Help Desk usually offers unlimited tickets, which can cause huge traffic and gradually affect support services. The administrator can limit the user to creating a certain number of tickets by installing this add-on. The user can only create a certain number of tickets, which is set by the administrator. Admin can also limit the number of tickets that agents can open at once.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/user-options/\" rel=\"nofollow ugc\">User Options</a> &#8211; User options allow adding Google Re-Captcha or Majestic Support Re-Captcha to the registration form. Furthermore, users can register according to the roles defined by the admin, such as subscriber, author, etc.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/ticket-actions/\" rel=\"nofollow ugc\">Ticket Actions</a> &#8211; With the basic version, limited options are available for every ticket, like create, edit, and delete. But with the ticket action extension, you can get more options like print ticket, lock ticket, make a ticket in progress, and change the ticket priority.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/announcement/\" rel=\"nofollow ugc\">Announcements</a> &#8211; Keep your customers updated on the latest trends. With this add-on, make unlimited announcements against various categories to explore information associated with the help desk.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/downloads/\" rel=\"nofollow ugc\">Downloads</a> &#8211; Both the admin and agent can create unlimited downloads and attach multiple files to support their site; even more, both can also add downloads category-wise. A download can only be added by an agent with the admin&#8217;s permission.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/faq/\" rel=\"nofollow ugc\">FAQ</a> &#8211; Add unlimited FAQs to answer all the basic  &hellip;</p>\n</li>\n</ul>\n",
        "changelog": "<p>= 1.0.4<br />\n* Security update for colors.<br />\n* Bug fix for colors.</p>\n<p>= 1.0.3<br />\n* Add new translations.</p>\n<p>= 1.0.2<br />\n* Improve anonymous ticket functionality.</p>\n<p>= 1.0.1<br />\n* Security update.<br />\n* Bug fix.</p>\n<p>= 1.0.0<br />\n* Just release.</p>\n"
    },
    "short_description": "Majestic Support for WordPress is a top-tier ticket system that can significantly enhance your customers&#039; support experience.",
    "description": "<p>Majestic Support for WordPress is a top-tier ticket system that can significantly enhance your customers&#8217; support experience. This plugin generates and manages support tickets online, offering innovative features such as email piping, unlimited agents, customizable reply responses, invoicing history, and file attachment options.</p>\n<p>👉 <a href=\"http://demo.majesticsupport.com/\" rel=\"nofollow ugc\">View Demo</a> | <a href=\"https://www.youtube.com/channel/UCdEoePgwPrWaxJ__eA6vLIA\" rel=\"nofollow ugc\">Watch Videos</a> | <a href=\"https://majesticsupport.com/support/\" rel=\"nofollow ugc\">Support</a> | <a href=\"https://majesticsupport.com/\" rel=\"nofollow ugc\">Plugin Homepage</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8zdTsKbgeYE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>This plugin is particularly useful because customers can easily submit tickets from your website&#8217;s front end without needing to register. In addition, the administrator can create and complete tasks on behalf of users, streamlining the support process. Furthermore, you have complete control over the plugin&#8217;s support form customization, allowing you to display any relevant information to customers. Lastly, customers can attach files to their support tickets, ensuring that all necessary information is available to address their concerns.</p>\n<h4>Translations</h4>\n<p>Majestic Support is available in English, Arabic (العربية), German(Deutsch), Spanish(Español), French(Français), Italian(Italiano), Dutch(Nederlands), Polish(Polski), Brazilian Portuguese(Português do Brasil), Russian(Русский), Czech(Čeština), Greek(Ελληνικά), Indonesian(Bahasa Indonesia), Japanese(日本語), Swedish(Svenska), Thai(ไทย), Turkish(Türkçe), Cinese(简体中文), Malaysian(Bahasa Melayu), Korean(한국어), Romanian(Română) and Filipino(Tagalog)</p>\n<p><strong>Key Features Of Majestic Support</strong>:<br />\nKey features that make Majestic Support stand out from the rest include:</p>\n<ul>\n<li>Users on the front end can create tickets</li>\n<li>Ticket-specific smart reply answers that can be modified</li>\n<li>Allows you to place support icons in a variety of places on your website.</li>\n<li>Tickets can be made by administrators and agents on behalf of users</li>\n<li>You can manage an unlimited number of agents in the base version</li>\n<li>Users may request to have their data removed, and administrators may delete or anonymize it</li>\n<li>The base version does not impose ticket limitations</li>\n<li>Several attachments can be uploaded by a user, agent, or administrator while creating a ticket or replying to a ticket</li>\n<li>Manage an unlimited number of tickets and create an unlimited number of agent profiles</li>\n<li>Agent performance reports will provide you with valuable insights into the performance of your support system</li>\n<li></li>\n</ul>\n<h3>THE PLUGIN&#8217;S KEY FREE VERSION FEATURES THAT MAKE IT MAJESTIC:</h3>\n<p>There are many top-notch help desk plugins for WordPress, but Majestic Support stands out as the most practical one. This is because its basic free version provides several following enhancements over competing solutions.</p>\n<ul>\n<li>\n<p><strong>Smart Replies To New Tickets</strong><br />\nIn response to new tickets, the Smart Reply functionality allows you to automatically search for and provide relevant responses back to the user. When a new ticket is received, Majestic Support will perform a search and suggest quick and relevant responses to a customer query.</p>\n</li>\n<li>\n<p><strong>Fields Manager</strong><br />\nThis plugin allows you to create customized support forms by adding custom fields. An admin can add, edit, rename, publish, unpublish, and require or unrequire fields for users and visitors. Additionally, you can also change the display order of the fields, like where you want to show the fields on the support form.</p>\n</li>\n<li>\n<p><strong>Custom Fields</strong><br />\nExtra fields are sometimes required; this is no problem. Majestic Support offers 12+ custom fields (text field, dropdown, checkbox, radio button, text area, dependent fields, admin only, date, email, upload file, multi-select, and T&amp;C ).</p>\n</li>\n<li>\n<p><strong>Themes</strong><br />\nThemes make our site more beautiful and eye-catching. The plugin is flexible and easy to use, it can integrate seamlessly with any WordPress theme, so it can be used right away. With this feature, you can also change the plugin&#8217;s colors from seven preset color themes with different color palettes.</p>\n</li>\n<li>\n<p><strong>Support To Everyone</strong><br />\nBoth free and paid users can access Majestic Support; user-friendly support is also available in the form of video support. The plugin explains nearly all of its Majestic features through video tutorials.</p>\n</li>\n<li>\n<p><strong>System Log</strong><br />\nAs an admin, you&#8217;d like to know everything that happened on the system. With the system log, you will know everything about tickets, from when they arrived at your help desk to how an agent reacted to them and what happened next.</p>\n</li>\n<li>\n<p><strong>Slugs</strong><br />\nMake the web address unique according to your needs for identifying a particular page on a website in an easy-to-read form.</p>\n</li>\n</ul>\n<h3>MORE FEATURES WITH THE FREE VERSION</h3>\n<ul>\n<li>\n<p><strong>Front-end Tickets</strong>: Users can create tickets from the front end.</p>\n</li>\n<li>\n<p><strong>Visitor/Guest Tickets</strong>: Often users do not want to create an account to open a support ticket. Guest tickets are a very important feature and it is free.</p>\n</li>\n<li>\n<p><strong>Unlimited Tickets</strong>: There are not any limits on tickets in the base version.</p>\n</li>\n<li>\n<p><strong>Unlimited Agents</strong>: The system support unlimited agents in the admin area in the base version.</p>\n</li>\n<li>\n<p><strong>Support Icon</strong>: This is very important to show the support icon on your site, Majestic Support offers a support icon for the front end with various position options.</p>\n</li>\n<li>\n<p><strong>Create Ticket for Users</strong>: Admin/agent can create a ticket on behalf of any user.</p>\n</li>\n<li>\n<p><strong>GDPR</strong>: Majestic Support is fully compatible with GDPR law and can be easily configured to show GDPR-related information.</p>\n</li>\n<li>\n<p><strong>Erase Data Requests</strong>: Users can ask to erase their data and the admin has the option to delete or anonymize their data.</p>\n</li>\n<li>\n<p><strong>Multiple Attachments</strong>: User/agent/admin can upload multiple attachments in ticket creation and ticket replies</p>\n</li>\n<li>\n<p><strong>Attachment Size and Type</strong>: Admin can control ticket attachments by their size and extension type.</p>\n</li>\n<li>\n<p><strong>Powerful Filters and Sorting</strong>: The system offers powerful filters for both user and admin to search tickets with sorting options.</p>\n</li>\n<li>\n<p><strong>Priorities</strong>: Priority associated with the ticket defines the importance, and the system highlights the priorities with an admin-defined different color on the ticket listing and ticket detail page.</p>\n</li>\n<li>\n<p><strong>Unlimited Departments</strong>: Create departments that relate to the various business units in your organization. It will be sales, support, and billing, you can create any department in the admin panel. The user will select a department when he creates the ticket.</p>\n</li>\n<li>\n<p><strong>Ticket Status</strong>: Show the ticket status message and different colors to highlight it.</p>\n</li>\n<li>\n<p><strong>Email Notification</strong>: The system sends an email notification to the user, agents, and admin in different actions i.e new ticket, reply, close ticket, etc.</p>\n</li>\n<li>\n<p><strong>Edit Ticket</strong>: Admin/agent can edit any ticket at any time.</p>\n</li>\n<li>\n<p><strong>Registration</strong>: The system offers a beautiful registration form to register a new user.</p>\n</li>\n<li>\n<p><strong>Login Form</strong>: The system has its login form to log in to the user.</p>\n</li>\n<li>\n<p><strong>Captcha/ReCaptcha</strong>: Another exciting feature. The system offers its captcha and googles Recaptcha to stop spamming.</p>\n</li>\n<li>\n<p><strong>Thank you Message for Visitor</strong>: Admin can add a special message for the visitor, a message will show after the successful ticket submission.</p>\n</li>\n<li>\n<p><strong>HTML Editor</strong>: HTML editor for ticket summary, ticket reply, notes, etc.</p>\n</li>\n<li>\n<p><strong>Term &amp; Conditions</strong>: Admin can add Terms &amp; Conditions on the ticket submission page.</p>\n</li>\n<li>\n<p><strong>Themes</strong>: Themes make our site more beautiful and eye catchy. By using this feature, you can change your plugin colors or can select colors from seven preset color themes with different color palettes.</p>\n</li>\n<li>\n<p><strong>Email Templates</strong>: Majestic Support offers full power to the admin, the admin can edit any email template in the HTML editor. The system includes beautiful predefined email templates.</p>\n</li>\n<li>\n<p><strong>Custom Message for new ticket</strong>: This is an important feature in that the admin shows a message/instruction (any message in Text Editor) on the ticket submission form.</p>\n</li>\n<li>\n<p><strong>Admin/Agent Only</strong>: This field is visible to the admin and agent only.</p>\n</li>\n<li>\n<p><strong>Hide Agent/Admin Info</strong>: Admin can hide agent information like email, and name from the user.</p>\n</li>\n<li>\n<p><strong>Email Configuration</strong>: Another admin power is the system offering enable/disable action base email notifications like ticket reply, close ticket, change priority, etc.</p>\n</li>\n<li>\n<p><strong>Strength &amp; Flexibility</strong>: Majestic Support is built using WordPress best practices both on the front end and the back end. This results in an efficient, robust, and intuitive plugin.</p>\n</li>\n<li>\n<p><strong>Easy to Use:</strong> The ticket system builds based on the latest style. You will find it very easy to use.</p>\n</li>\n<li>\n<p><strong>RTL ready</strong>: Majestic Support also supports RTL languages.</p>\n</li>\n<li>\n<p><strong>Fully Responsive</strong>: Majestic Support work on all type of devices including smartphones, tablets, laptops, and desktops. Layouts auto-adjust according to devices.</p>\n</li>\n<li>\n<p><strong>System Errors</strong>: The system record every error and shows it in the admin area.</p>\n</li>\n<li>\n<p><strong>Hide/Show Menu</strong>: In configurations, administrators can hide or show Majestic Support for any menu item.</p>\n</li>\n<li>\n<p><strong>Translation</strong>: Majestic Support is multi-language and has over 35 translations available.</p>\n</li>\n<li>\n<p><strong>Pagination</strong>: On the configurations page, the administrator can specify one record per page.</p>\n</li>\n<li>\n<p><strong>Majestic Support has reported on</strong></p>\n</li>\n<li>Get a summary of tickets handled by every staff member</li>\n<li>Get a detailed report of tickets handled by every staff member</li>\n<li>Get a detailed report of tickets created by every user</li>\n<li>Get a summary of tickets by status</li>\n<li>Get a summary of tickets by priorities</li>\n<li>Get a summary of tickets by departments</li>\n<li>Get a summary of tickets created by the channel</li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/YDYnagRWyEU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>PREMIUM EXTENTIONS</h3>\n<p>In addition to providing a thorough overview of your support tickets, the plugin offers several handy premium features that make them easier to manage.</p>\n<ul>\n<li>\n<p><a href=\"https://majesticsupport.com/product/email-piping/\" rel=\"nofollow ugc\">Agents</a> &#8211; Agents assist users connected to the support system and play a crucial role in the help desk. By adding this add-on, you may add more agents and give them different permissions to make it easier for users to take action on their tickets. Additionally, agents can create, delete, close, and perform any other action given to them by the admin.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/agent-auto-assignment/\" rel=\"nofollow ugc\">Agent Auto Assign</a> &#8211; Ticket auto-assignment is a simple but critical process in the handling and closing of help desk tickets. When auto-assign is enabled, the ticket is assigned to an appropriate agent based on the rules.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/multiple-ticket-forms/\" rel=\"nofollow ugc\">Multi Forms</a> &#8211; By using this multi-form functionality, admins, agents, and users, as well as visitors with the necessary permissions, can create different ticket forms to accommodate various request types based on user roles.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/email-piping/\" rel=\"nofollow ugc\">Email Piping</a> &#8211; From the comfort of an email account, create tickets or reply to them. For example, you could offer your clients a special email address like support@yourdomain.com. The emails received in this email will be converted to tickets. The add-on also contains built-in options to control how to manage responses to tickets that have been closed, unrecognized email addresses, and much more.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/merge-tickets/\" rel=\"nofollow ugc\">Merge Tickets</a> &#8211; Hundreds of tickets have been submitted for assistance, some of which may be on the same topic and have similar questions. To provide support for each ticket with the same topic would be a waste of time. With this add-on, you can merge any of the two tickets or more with the same topic and query and provide support.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/private-credentials/\" rel=\"nofollow ugc\">Private Credentials</a> &#8211; This feature gives your tickets an additional layer of security so that users can safely enter passwords and other sensitive credentials onto the tickets.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/paid-support/\" rel=\"nofollow ugc\">Paid Support</a> &#8211; For using your support services, charge users. Create subscriptions based on duration, such as a monthly membership, or the number of tickets, like 10 tickets per month, or charge for each ticket.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/time-tracking/\" rel=\"nofollow ugc\">Time Tracking</a> &#8211; Track the time spent on tickets in the most precise manner while also providing client and agent-level reporting. Keep a manual record of the time invested in each ticket response.  When the ticket is open in the agent&#8217;s browser track the time with a single click, and stop the time tracking with one click once the agent has finished with the ticket.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/ticket-overdue/\" rel=\"nofollow ugc\">Ticket Overdue</a> &#8211; An &#8220;overdue ticket&#8221; is one that has not been resolved or has not been responded to in a timely manner. By adding this add-on, you can set auto-overdue tickets, overdue by priority, and cron job overdue.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/export-tickets/\" rel=\"nofollow ugc\">Export</a> &#8211; Exports are used to keep data on the local system. By adding this add-on, you can export any of the ticket data, like ticket detail, ticket history, etc.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/ticket-history/\" rel=\"nofollow ugc\">Ticket History</a> &#8211; As an admin, you&#8217;d like to know everything that happened on a ticket, from when it arrived at your help desk to how an agent reacted to it and what happened next. So, with the ticket history extension, you can see a summary of all the activities that have taken place on a ticket.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/auto-close-ticket/\" rel=\"nofollow ugc\">Ticket Auto Close</a> &#8211; Automatic ticket closure reduces your effort to close the ticket manually. By enabling the add-on, tickets will be automatically closed after a set period or pre-defined rules, as determined by the administrator. While a ticket is open, it can also be closed based on the agent&#8217;s response.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/feedback/\" rel=\"nofollow ugc\">Feedback</a> &#8211; By adding this add-on, you can get feedback from your users to enhance the quality of your services. This add-on allows you to automatically collect feedback responses that rate your agent’s performance on a ticket. This add-on sends a feedback link after a ticket is closed. The user will click on a survey link and fill out the survey form on your website.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/helptopic/\" rel=\"nofollow ugc\">Help Topic</a> &#8211; The Help Topic is used to assist the end user in locating the desired area where they want to get instant support. By adding this add-on, you can add multiple help topics with different names to help your customers more easily.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/internal-note/\" rel=\"nofollow ugc\">Private Note</a> &#8211; Add notes to tickets that are only visible to agents and administrators.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/knowledge-base/\" rel=\"nofollow ugc\">Knowledge Base</a> &#8211; With this add-on, you can add several knowledge bases and group solutions into various categories to better serve users. Knowledge bases are typically used to respond to basic customer inquiries.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/canned-responses/\" rel=\"nofollow ugc\">Canned Response</a> &#8211; Predetermined answers to typical inquiries are referred to as canned answers. Instead of constantly typing the same response or pasting it from another source, the agent can insert a premade response that is activated by keystrokes or from a drop-down menu by adding this add-on.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/max-tickets/\" rel=\"nofollow ugc\">Max Tickets</a> &#8211; The Help Desk usually offers unlimited tickets, which can cause huge traffic and gradually affect support services. The administrator can limit the user to creating a certain number of tickets by installing this add-on. The user can only create a certain number of tickets, which is set by the administrator. Admin can also limit the number of tickets that agents can open at once.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/user-options/\" rel=\"nofollow ugc\">User Options</a> &#8211; User options allow adding Google Re-Captcha or Majestic Support Re-Captcha to the registration form. Furthermore, users can register according to the roles defined by the admin, such as subscriber, author, etc.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/ticket-actions/\" rel=\"nofollow ugc\">Ticket Actions</a> &#8211; With the basic version, limited options are available for every ticket, like create, edit, and delete. But with the ticket action extension, you can get more options like print ticket, lock ticket, make a ticket in progress, and change the ticket priority.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/announcement/\" rel=\"nofollow ugc\">Announcements</a> &#8211; Keep your customers updated on the latest trends. With this add-on, make unlimited announcements against various categories to explore information associated with the help desk.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/downloads/\" rel=\"nofollow ugc\">Downloads</a> &#8211; Both the admin and agent can create unlimited downloads and attach multiple files to support their site; even more, both can also add downloads category-wise. A download can only be added by an agent with the admin&#8217;s permission.</p>\n</li>\n<li>\n<p><a href=\"https://majesticsupport.com/product/faq/\" rel=\"nofollow ugc\">FAQ</a> &#8211; Add unlimited FAQs to answer all the basic  &hellip;</p>\n</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/majestic-support.1.0.4.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-1.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-2.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-3.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-4.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-5.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-6.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-7.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-8.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-9.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-10.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-11.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-12.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-13.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-14.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-15.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-16.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-17.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-18.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-19.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-20.png?rev=3001137",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/majestic-support/assets/screenshot-21.png?rev=3001137",
            "caption": ""
        }
    ],
    "tags": {
        "helpdesk": "helpdesk",
        "support": "support",
        "support-desk": "support desk",
        "support-plugin": "support plugin",
        "ticket-system": "ticket system"
    },
    "stable_tag": "1.0.4",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/majestic-support.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/majestic-support.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/majestic-support.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/majestic-support.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/majestic-support.1.0.4.zip",
        "trunk": "https://downloads.wordpress.org/plugin/majestic-support.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://majesticsupport.com",
    "banners": {
        "low": "https://ps.w.org/majestic-support/assets/banner-772x250.png?rev=3106532",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/majestic-support/assets/icon-128x128.gif?rev=3001224"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}