{
    "name": "Zoom Meeting, Jitsi Meet, Webex &amp; Google Meet | 🔥 MeetingHub is the all-in-one solution for Webinar and Video Conference for WordPress",
    "slug": "meetinghub",
    "version": "1.13.7",
    "author": "Sovlix",
    "author_profile": "https://profiles.wordpress.org/sovlix/",
    "contributors": {
        "sovlix": {
            "profile": "https://profiles.wordpress.org/sovlix/",
            "avatar": "https://secure.gravatar.com/avatar/d66b7fb372d92253120b854a1b8ed576?s=96&d=monsterid&r=g",
            "display_name": "Sovlix"
        }
    },
    "requires": "5.0",
    "tested": "6.6.1",
    "requires_php": "5.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 4,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 4,
    "support_url": "https://wordpress.org/support/plugin/meetinghub/",
    "support_threads": 2,
    "support_threads_resolved": 2,
    "active_installs": 100,
    "downloaded": 2901,
    "last_updated": "2024-08-13 07:46:00",
    "added": "2024-02-13",
    "homepage": "",
    "sections": {
        "description": "<p><strong>🔥 MeetingHub &#8211; Webinar for WordPress with Zoom Meeting, Jitsi Meet, Webex, Google Meet, and More | All-in-one Video Conference Plugin with Branded Meetings.</strong></p>\n<p>Elevate your online meeting experience with MeetingHub – the ultimate all-in-one meeting solution for WordPress. MeetingHub is the best and super easy WordPress webinar plugin designed to create instant meetings with popular platforms such as Zoom, Jitsi Meet, Webex, Google Meet, and more.</p>\n<p><strong>👉 Join our <a href=\"https://www.facebook.com/groups/sovlixcommunity\" rel=\"nofollow ugc\">Facebook Community</a></strong><br />\n<strong>👉 Follow us on <a href=\"https://www.linkedin.com/company/sovlix\" rel=\"nofollow ugc\">LinkedIn</a></strong></p>\n<h3>Why Choose MeetingHub?</h3>\n<ul>\n<li><strong>Seamless Integration:</strong> Connect effortlessly with Zoom, Jitsi Meet, Webex, Google Meet, and other leading video conferencing platforms within your WordPress environment.</li>\n<li><strong>Easy Setup:</strong> Setting up and managing meetings is a breeze with our user-friendly interface, ensuring a hassle-free experience for both administrators and participants.</li>\n<li><strong>Comprehensive Support:</strong> Whether you&#8217;re hosting webinars or conferences, MeetingHub caters to all your meeting needs, providing a versatile solution for various scenarios.</li>\n<li>\n<p><strong>Developer-Friendly:</strong> Explore the comprehensive source code for MeetingHub, empowering developers to understand the inner workings of the Jitsi Meet integration. The readable React source code is conveniently located in the <code>assets/src/</code> directory.</p>\n</li>\n<li>\n<p><strong>Host can be enable or disable meeting</strong> As a host, you have full authority to enable or disable meetings with MeetingHub. This feature offers flexibility and control over the availability of your scheduled meetings, allowing you to activate or deactivate sessions as needed. Utilize this powerful control to manage meeting accessibility, enhance security, and maintain organizational protocols effectively. Ensure your meetings are only available when you want them to be, providing a secure and well-managed virtual meeting environment.</p>\n</li>\n<li>\n<p><strong>Multi-Language Translation Support:</strong> MeetingHub offers full internationalization, allowing you to translate the entire plugin interface into your preferred language. This feature enhances accessibility and usability for a global audience, making it easier for users worldwide to integrate seamlessly with Zoom, Jitsi Meet, Webex, Google Meet, and other video conferencing platforms.</p>\n</li>\n</ul>\n<h3>Integrations 👇</h3>\n<h3>🎯 Jitsi Meet Integration</h3>\n<p>Enjoy real-time collaboration with Jitsi Meet. MeetingHub seamlessly integrates with Jitsi Meet to provide users with a reliable and feature-rich video conferencing experience.</p>\n<ul>\n<li>\n<p><strong>Unlimited Duration Meetings</strong> &#8211; Embrace the liberty of hosting webinars without time constraints with Jitsi Meet for WordPress. Powered by our Jitsi community instance, each meeting enjoys extended availability, offering two hours of seamless interaction that automatically renews post-session. Immerse yourself in a full spectrum of cutting-edge video conferencing features, making our plugin the epitome of versatility for crafting WordPress webinars.</p>\n</li>\n<li>\n<p><strong>Customized Meeting Titles</strong> &#8211; Add a personal touch to your webinars by assigning distinctive names, facilitating easy recognition, and elevating the overall branding of your virtual events.</p>\n</li>\n<li>\n<p><strong>Dynamic Screen Sharing</strong> &#8211; Enhance communication in your virtual meetings with Jitsi Meet&#8217;s unmatched screen-sharing capabilities. This plugin distinguishes itself as the most intelligent choice among WordPress meeting plugins.</p>\n</li>\n<li>\n<p><strong>Limitless Meetings</strong> &#8211; Unshackle yourself from constraints and host an unlimited number of live webinars and video conferences seamlessly through the Jitsi Meet plugin on your WordPress website. Revel in unparalleled freedom and flexibility in your virtual event hosting endeavors.</p>\n</li>\n<li>\n<p><strong>Meeting Shortcode</strong> &#8211; Unleash enhanced functionality with Jitsi Meet&#8217;s shortcode feature, seamlessly creating and embedding video meetings on your website. Utilize the shortcode for diverse purposes, adding a layer of convenience to your WordPress website experience. Elevate your virtual gatherings with Jitsi Meet, where freedom, flexibility, and a seamless user experience converge.</p>\n</li>\n<li>\n<p><strong>Gutenberg Support</strong> &#8211; Embrace modern content creation with Gutenberg support for Jitsi Meet. Effortlessly integrate meetings into your posts and pages using the block editor, enhancing the overall user experience.</p>\n</li>\n<li>\n<p><strong>Meeting Height &amp; Width Customization</strong> &#8211; Enjoy added flexibility in meeting display by adjusting height and width settings. Tailor the visual aspects of your virtual gatherings to suit your specific needs, providing a personalized and engaging experience.</p>\n</li>\n<li>\n<p><strong>Meeting Muting Flexibility</strong> &#8211; Take control of your video conferences and webinars by muting them at your convenience through Jitsi Meet. Stay in charge and ensure smooth communication throughout.</p>\n</li>\n<li>\n<p><strong>Interactive Screen Sharing</strong> &#8211; Foster better communication among hosts and participants by seamlessly sharing screens during virtual meetings. Enhance collaboration and productivity with this intuitive feature.</p>\n</li>\n<li>\n<p><strong>Effortless Elementor Integration</strong> &#8211; Create meetings within Elementor effortlessly using simple shortcodes. Enjoy seamless live video chats without technical complexities, streamlining your workflow and enhancing user experience effortlessly.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance with a countdown timer for your upcoming Zoom events. Display a live timer on your website, reminding users of the approaching event start time.</p>\n</li>\n<li>\n<p><strong>Custom Domain Hosting</strong> &#8211; Personalize your video conferencing experience by creating a unique, branded URL for your meetings. Enhance your professional identity and make your website stand out with a custom domain for your Jitsi Meet sessions.</p>\n</li>\n<li>\n<p><strong>8&#215;8 JaaS Integration</strong> &#8211; Seamlessly integrate Jitsi with 8&#215;8&#8217;s JaaS (Jitsi as a Service) for a robust and scalable video conferencing solution. Enjoy enhanced features and reliability, ensuring your virtual meetings run smoothly and efficiently.</p>\n</li>\n</ul>\n<h3>🎯 Zoom Integration</h3>\n<p>MeetingHub&#8217;s seamless Zoom integration offers a powerful, feature-rich experience for managing your virtual meetings and webinars directly from your WordPress site.</p>\n<ul>\n<li>\n<p><strong>Effortlessly Manage Zoom Users and Access Reports</strong> &#8211; Oversee all your Zoom users and access comprehensive reports directly from your WordPress dashboard. Monitor participant activity, attendance, and meeting statistics with ease, improving your administrative efficiency.</p>\n</li>\n<li>\n<p><strong>Recurring Meetings and Webinars (Upcoming)</strong> &#8211; Schedule and manage recurring Zoom meetings and webinars without hassle. Keep your virtual events consistent and streamline your planning process by automating recurring sessions.</p>\n</li>\n<li>\n<p><strong>Utilize Personal Meeting IDs</strong> &#8211; Use your unique Personal Meeting IDs for setting up and managing your Zoom meetings. Maintain a consistent and recognizable identity for your meetings, enhancing professional branding and user familiarity.</p>\n</li>\n<li>\n<p><strong>View Registrants from the Frontend (Upcoming)</strong> &#8211; Display a list of meeting and webinar registrants directly on your website. Allow users to see who else is attending and foster a sense of community and engagement among participants.</p>\n</li>\n<li>\n<p><strong>Show User Recordings Based on Zoom Account</strong> &#8211; Customize your content delivery by showing recordings associated with specific Zoom accounts. Provide a personalized user experience by tailoring access to relevant recordings.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance with a countdown timer for your upcoming Zoom events. Display a live timer on your website, reminding users of the approaching event start time.</p>\n</li>\n<li>\n<p><strong>Duplicate Meetings and Webinars (Upcoming)</strong> &#8211; Easily duplicate existing Zoom meetings and webinars with a single click. Save time and effort when setting up similar or recurring events.</p>\n</li>\n<li>\n<p><strong>List and Access Recordings</strong> &#8211; Conveniently list and access all your Zoom meeting and webinar recordings from within WordPress. Ensure your valuable content is always available and organized for easy retrieval and playback.</p>\n</li>\n<li>\n<p><strong>Show Events in Calendar (Upcoming)</strong> &#8211; Display all your Zoom events in an interactive calendar view on your WordPress site. Enhance user experience by providing a clear and organized schedule of upcoming meetings and webinars.</p>\n</li>\n<li>\n<p><strong>Add to Calendar Links (Upcoming)</strong> &#8211; Simplify scheduling for your participants by providing &#8220;Add to Calendar&#8221; links. Ensure your audience never misses an event by allowing them to easily add meetings to their personal calendars.</p>\n</li>\n<li>\n<p><strong>Gutenberg Support</strong> &#8211; Embrace modern content creation with Gutenberg support for Zoom. Effortlessly integrate Zoom meetings into your posts and pages using the block editor, enhancing the overall user experience.</p>\n</li>\n<li>\n<p><strong>Meeting Shortcode</strong> &#8211; Unlock enhanced functionality with Zoom&#8217;s shortcode feature, seamlessly creating and embedding video meetings on your website. Utilize the shortcode for diverse purposes, adding a layer of convenience to your WordPress website experience. Elevate your virtual gatherings with Zoom, where freedom, flexibility, and a seamless user experience converge.</p>\n</li>\n<li>\n<p><strong>Effortless Elementor Integration</strong> &#8211; Create Zoom meetings within Elementor effortlessly using simple shortcodes. Enjoy seamless live video chats without technical complexities, streamlining your workflow and enhancing user experience effortlessly.</p>\n</li>\n</ul>\n<h3>Enhance Your Virtual Meeting Experience</h3>\n<p>With MeetingHub&#8217;s advanced Zoom integration features, you can efficiently manage your virtual meetings and webinars, providing a seamless experience for both administrators and participants. Optimize your workflow, improve user engagement, and maintain a professional online presence with our robust set of tools and upcoming features.</p>\n<h3>🎯 Webex Integration</h3>\n<p>Enhance your WordPress site with seamless Webex integration, perfect for educational institutions, consulting firms, remote businesses, yoga instructors, and more. Our MeetingHub (Video Conferencing with Webex) plugin is designed to streamline your workflow by allowing you to schedule, manage, and display Webex meetings directly on your WordPress site.</p>\n<h3>Why Use Webex Integration with MeetingHub?</h3>\n<ul>\n<li>\n<p><strong>Perfect for Remote Work:</strong> Ideal for businesses adapting to remote workflows and online learning environments.</p>\n</li>\n<li>\n<p><strong>User-Friendly Interface:</strong> Schedule Webex meetings easily and display them on your site with a single click.</p>\n</li>\n<li>\n<p><strong>Increase Engagement:</strong> Allow users to join Webex meetings directly from your site, enhancing interaction and engagement.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance with a countdown timer for your upcoming events. Display a live timer on your website, reminding users of the approaching event start time.</p>\n</li>\n<li>\n<p><strong>Gutenberg Support</strong> &#8211; Embrace modern content creation with Gutenberg support for Webex. Effortlessly integrate Webex meetings into your posts and pages using the block editor, enhancing the overall user experience.</p>\n</li>\n<li>\n<p><strong>Meeting Shortcode</strong> &#8211; Unlock enhanced functionality with Webex&#8217;s shortcode feature, seamlessly creating and embedding video meetings on your website. Utilize the shortcode for diverse purposes, adding a layer of convenience to your WordPress website experience. Elevate your virtual gatherings with Webex, where freedom, flexibility, and a seamless user experience converge.</p>\n</li>\n<li>\n<p><strong>Effortless Elementor Integration</strong> &#8211; Create Webex meetings within Elementor effortlessly using simple shortcodes. Enjoy seamless live video chats without technical complexities, streamlining your workflow and enhancing user experience effortlessly.</p>\n</li>\n</ul>\n<h3>Key Features</h3>\n<ul>\n<li><strong>Manage Webex Meetings:</strong> Organize and manage your Webex meetings as WordPress posts.</li>\n<li><strong>Quick Setup:</strong> Easy installation and configuration process.</li>\n<li><strong>Developer Friendly:</strong> Extensive customization options and template overrides for developers.</li>\n<li><strong>Meeting Recordings:</strong> View and manage meeting recordings directly from your dashboard.</li>\n<li><strong>Customizable Layouts:</strong> Change frontend layouts to suit your site’s design.</li>\n<li><strong>Shortcodes:</strong> Use shortcodes to embed Webex meetings anywhere on your site.</li>\n<li>\n<p><strong>One-Click Import (Upcoming):</strong> Import your Webex meetings into your WordPress dashboard with a single click.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance with a countdown timer for your upcoming events. Display a live timer on your website, reminding users of the approaching event start time.</p>\n</li>\n</ul>\n<h3>Upcoming Features &amp; Integrations</h3>\n<p>We have exciting plans for the future! MeetingHub is committed to enhancing your meeting experience by integrating with additional platforms. Let&#8217;s check what&#8217;s coming next!</p>\n<ul>\n<li>LMS Integration (LearnPress, LearnDash, Tutor LMS)</li>\n<li>WooCommerce Integration</li>\n<li>Email notification</li>\n<li>And many more&#8230;</li>\n</ul>\n<h3>🎥 Video Tutorials</h3>\n<ul>\n<li><strong>Setting Up Zoom with Server-to-Server OAuth in MeetingHub</strong></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ApSm4QJXLGc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Watch this tutorial to learn how to set up Zoom with Server-to-Server OAuth in MeetingHub. This video provides step-by-step instructions to configure OAuth credentials for seamless integration.</p>\n<ul>\n<li><strong>Setting Up Zoom with Meeting SDK App in MeetingHub</strong></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Q0Zt80PjvTE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>This tutorial demonstrates how to set up Zoom with Meeting SDK App in MeetingHub. Follow along with the video to configure your Meeting SDK App credentials for enhanced functionality within MeetingHub.</p>\n<ul>\n<li><strong>How to Set Up Webex OAuth in MeetingHub</strong></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/vV3EwUNJusk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<ul>\n<li><strong>How to Set Up 8&#215;8 JaaS in MeetingHub</strong></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/YqQ7Kcap5vo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>In this comprehensive tutorial, we&#8217;ll guide you through the entire process of setting up Webex OAuth in MeetingHub. Whether you&#8217;re a developer or an administrator, this video will help you integrate Webex authentication seamlessly and securely into your MeetingHub environment. Follow our detailed steps to ensure a smooth setup and enhance your meeting management experience.</p>\n<h4>Best and super easy WordPress webinar plugin to create instant meetings with Zoom, Jitsi Meet, Webex, and more. Meeting with Zoom, Jitsi Meet, Webex, and More | All-in-one Webinar and Video Conference for WordPress &#8211; MeetingHub</h4>\n<h4>Video conferencing with Zoom, MeetingHub plugin gives you the extensive functionality to manage your Zoom Meetings, Webinars, Recordings, Users, Reports from your WordPress Dashboard directly. The plugin is a great tool for managing your Zoom sessions on the fly without needing to go back and forth on multiple platforms. This plugin is developed in order to make smooth transitions in managing your online meetings or webinars without any hassle and time loss.</h4>\n",
        "changelog": "<h4>1.13.7 (13 August, 2024)</h4>\n<ul>\n<li><strong>Enhancement:</strong> Added comprehensive tutorial links to enhance the settings experience</li>\n</ul>\n<h4>1.13.6 (31 July, 2024)</h4>\n<ul>\n<li><strong>Fix:</strong> Fixed JaaS 8&#215;8 not works</li>\n</ul>\n<h4>1.13.5 (25 July, 2024)</h4>\n<ul>\n<li><strong>Enhancement:</strong> Enhanced the Zoom join browser functionality on single meeting shortcode</li>\n<li><strong>Fix:</strong> Fixed zoom redirect not works properly</li>\n</ul>\n<h4>1.13.4 (24 July, 2024)</h4>\n<ul>\n<li><strong>Enhancement:</strong> Improved the overall UI responsiveness</li>\n<li><strong>Enhancement:</strong> Enhanced the Jitsi single meeting shortcode</li>\n<li><strong>Enhancement:</strong> Enhanced compatibility to support WordPress 6.6</li>\n</ul>\n<h4>1.13.3 (13 July, 2024)</h4>\n<ul>\n<li><strong>Enhancement:</strong> Added a feature for Zoom meetings to join directly in the browser via shortcode</li>\n</ul>\n<h4>1.13.2 (12 July, 2024)</h4>\n<ul>\n<li><strong>Fix:</strong> Resolved an error that occurred while connect webex from setting</li>\n</ul>\n<h4>1.13.1 (10 July, 2024)</h4>\n<ul>\n<li><strong>Enhancement:</strong> Enhancing plugin security ensures that all data is more secure</li>\n</ul>\n<h4>1.13.0 (09 July, 2024)</h4>\n<ul>\n<li><strong>New:</strong> Added a text editor for the meeting description</li>\n<li><strong>New:</strong> Introduced support for meeting thumbnails</li>\n</ul>\n<h4>1.12.0 (06 July, 2024)</h4>\n<ul>\n<li><strong>New:</strong> Introduced shortcode for displaying Jitsi meeting lists</li>\n<li><strong>New:</strong> Introduced shortcode for displaying Webex meeting lists</li>\n<li><strong>New:</strong> Introduced shortcode for displaying Zoom meeting lists and webinar lists</li>\n</ul>\n<h4>1.11.1 (09 Jun, 2024)</h4>\n<ul>\n<li><strong>New:</strong> Enhanced user experience with the addition of toasts for all actions</li>\n<li><strong>New:</strong> Internationalization support by enabling translation for the entire plugin interface</li>\n<li><strong>New:</strong> Global Settings for Zoom &amp; Webex</li>\n<li><strong>Enhancement::</strong> Improved UI</li>\n</ul>\n<h4>1.11.0 (03 Jun, 2024)</h4>\n<ul>\n<li><strong>New:</strong> Display recording feature for Zoom</li>\n<li><strong>New:</strong> Gutenberg block for Zoom</li>\n<li><strong>New:</strong> Gutenberg block for Webex</li>\n<li><strong>New:</strong> Elementor widget for Zoom</li>\n<li><strong>New:</strong> Elementor widget for for Webex</li>\n<li><strong>New:</strong> Jass 8&#215;8 integration for Jitsi</li>\n<li><strong>New:</strong> Set self-hosted  domain for Jitsi</li>\n</ul>\n<h4>1.10.0 (24 May, 2024)</h4>\n<ul>\n<li>New: Seamlessly integrate Webex for your virtual meetings</li>\n<li>New: Create, edit, and delete Webex meetings directly from the platform</li>\n<li>New: Schedule Webex meetings with ease and efficiency</li>\n<li>New: Added a countdown timer feature for upcoming Webex meetings</li>\n<li>New: Shortcode support</li>\n<li>Fix: Resolved an error that occurred while saving shortcodes for Jitsi and Zoom meetings </li>\n<li>Enhancement: Streamlined the process for deleting multiple meetings</li>\n<li>Enhancement: Improved the accuracy of time zone settings for better scheduling</li>\n</ul>\n<h4>1.9.1 (18 May, 2024)</h4>\n<ul>\n<li>Fix: Resolved jitsi edit meeting not workings</li>\n</ul>\n<h4>1.9.0 (16 May, 2024)</h4>\n<ul>\n<li>New: Daily and account reports for Zoom</li>\n<li>Enhancement: Improved notice for Zoom warnings</li>\n</ul>\n<h4>1.8.0 &#8211; 12 May 2024</h4>\n<ul>\n<li>New: Introducing the option to create Zoom users</li>\n<li>New: Added a feature allowing users to select hosts for Zoom meetings/webinars</li>\n<li>New: Introduced the capability to add alternative hosts for Zoom meetings/webinars</li>\n<li>Enhancement: Improved handling for Zoom meetings/webinars creation when API settings are not properly configured</li>\n<li>Enhancement: Enhanced user experience by displaying notices based on actions taken</li>\n</ul>\n<h4>1.7.2 &#8211; 06 May 2024</h4>\n<ul>\n<li>Fix: Resolved deprecated header and footer issues occurring when the theme lacks either component</li>\n<li>New: Added a setting to hide the header and footer</li>\n</ul>\n<h4>v1.7.1 &#8211; 05 May 2024</h4>\n<ul>\n<li>Enhancement: Improved meeting page UI</li>\n</ul>\n<h4>1.7.0 &#8211; 04 May 2024</h4>\n<ul>\n<li>New: Zoom time duration functionality</li>\n<li>New: Sidebar option implemented for both Jitsi &amp; Zoom</li>\n<li>New: Meeting start and end capabilities for both Jitsi &amp; Zoom</li>\n<li>New: Automatic meeting name and password generation feature</li>\n<li>New: Automatic detection of current timezone feature</li>\n<li>New: Timezone support added for Jitsi</li>\n<li>New: Hide sidebar option introduced</li>\n<li>Enhancement: Enhanced overall UI experience</li>\n<li>Enhancement: Ensured meeting times are accurately reflected based on timezone</li>\n<li>Enhancement: Prevented creation of meetings with past dates</li>\n<li>Fix: Addressed issue where timezone settings did not persist after saving for Zoom</li>\n<li>Fix: Resolved issue with global set data not found for Jitsi meeting creation</li>\n</ul>\n<h4>1.6.0 &#8211; 08 Apr 2024</h4>\n<ul>\n<li>New: Added Jitsi new fields</li>\n<li>New: sticky save &amp; update button</li>\n<li>Fix: Fixed start audio muted setting</li>\n<li>Improvement: Improved save meeting button design</li>\n</ul>\n<h4>1.5.0 &#8211; 07 Apr 2024</h4>\n<ul>\n<li>New: Added Jitsi global settings</li>\n<li>Improvement: Displayed configuration notice only on settings page and update links </li>\n<li>Improvement: Modified back button design</li>\n<li>Improvement: Modified Zoom setup hints design</li>\n<li>Improvement: Fixed loading issue when changing zoom settings tab</li>\n<li>Improvement: Added a notice on zoom meting form</li>\n<li>Improvement: Compatibility has been enhanced to support WordPress 6.5</li>\n</ul>\n<h4>1.4.0 &#8211; 30 Mar 2024</h4>\n<ul>\n<li>New: Improved meeting muting via Jitsi Meet</li>\n<li>New: Added screen sharing for better collaboration</li>\n<li>New: Simplified Elementor integration for Jitsi</li>\n<li>Improvement: Meeting name customization</li>\n<li>Improvement: Modified select settings design</li>\n</ul>\n<h4>1.3.3 &#8211; 16 Mar 2024</h4>\n<ul>\n<li>Improvement: Included a tutorial link in the README for enhanced user guidance</li>\n<li>New: Implemented automatic redirection to the settings page upon activation of the plugin for improved user experience</li>\n</ul>\n<h4>1.3.2 &#8211; 09 Mar 2024</h4>\n<ul>\n<li>Fix: Fixed an issue where all meetings rows were not correctly checked or unchecked</li>\n<li>Fix: Resolved the pagination reload problem when all data on a page is deleted</li>\n<li>Fix: Ensured that the title is now a required field</li>\n</ul>\n<h4>1.3.1 &#8211; 29 Feb 2024</h4>\n<ul>\n<li>Improvement: Enhanced Gutenberg block for a seamlessly improved user experience </li>\n</ul>\n<h4>1.3.0 &#8211; 26 Feb 2024</h4>\n<ul>\n<li>New: Shortable columns for convenient data sorting</li>\n<li>New: Advanced search functionality for quick and precise data retrieval</li>\n<li>New: Effortlessly delete multiple meetings simultaneously</li>\n<li>New: Intuitive pagination for improved navigation and user experience</li>\n</ul>\n<h4>1.2.0 &#8211; 24 Feb 2024</h4>\n<ul>\n<li>New: Gutenberg support for Jitsi Meet has been seamlessly integrated</li>\n<li>New: Meeting customization is now enhanced with added settings for height and width</li>\n<li>New: A convenient settings link has been introduced beside the plugin deactivate button</li>\n<li>New: Explore the new &#8220;Get in Touch&#8221; submenu, featuring relevant content</li>\n<li>Improvement: The functionality of the setting save button has been refined for a smoother user experience</li>\n</ul>\n<h4>1.1.0 &#8211; 20 Feb 2024</h4>\n<ul>\n<li>New: Shortcode support added for Jitsi Meet &amp; Zoom </li>\n</ul>\n<h4>1.0.2 &#8211; 17 Feb 2024</h4>\n<ul>\n<li>New: Added notice for missing Oauth Credentials setup</li>\n<li>New: Introduced Write agenda for your meeting  setting</li>\n<li>Improvement: Auto-generate password when the password field is empty</li>\n<li>Fix: Settings page not displayed correctly after authentication response</li>\n</ul>\n<h4>1.0.1 &#8211; 16 Feb 2024</h4>\n<ul>\n<li>New: Zoom meeting integration</li>\n</ul>\n<h4>1.0.0 &#8211; 14 Feb 2024</h4>\n<ul>\n<li>Initial release 😀</li>\n</ul>\n"
    },
    "short_description": "MeetingHub - The best all-in-one WordPress webinar plugin to create instant meetings with Zoom, Jitsi Meet, Webex, Google Meet, and more.",
    "description": "<p><strong>🔥 MeetingHub &#8211; Webinar for WordPress with Zoom Meeting, Jitsi Meet, Webex, Google Meet, and More | All-in-one Video Conference Plugin with Branded Meetings.</strong></p>\n<p>Elevate your online meeting experience with MeetingHub – the ultimate all-in-one meeting solution for WordPress. MeetingHub is the best and super easy WordPress webinar plugin designed to create instant meetings with popular platforms such as Zoom, Jitsi Meet, Webex, Google Meet, and more.</p>\n<p><strong>👉 Join our <a href=\"https://www.facebook.com/groups/sovlixcommunity\" rel=\"nofollow ugc\">Facebook Community</a></strong><br />\n<strong>👉 Follow us on <a href=\"https://www.linkedin.com/company/sovlix\" rel=\"nofollow ugc\">LinkedIn</a></strong></p>\n<h3>Why Choose MeetingHub?</h3>\n<ul>\n<li><strong>Seamless Integration:</strong> Connect effortlessly with Zoom, Jitsi Meet, Webex, Google Meet, and other leading video conferencing platforms within your WordPress environment.</li>\n<li><strong>Easy Setup:</strong> Setting up and managing meetings is a breeze with our user-friendly interface, ensuring a hassle-free experience for both administrators and participants.</li>\n<li><strong>Comprehensive Support:</strong> Whether you&#8217;re hosting webinars or conferences, MeetingHub caters to all your meeting needs, providing a versatile solution for various scenarios.</li>\n<li>\n<p><strong>Developer-Friendly:</strong> Explore the comprehensive source code for MeetingHub, empowering developers to understand the inner workings of the Jitsi Meet integration. The readable React source code is conveniently located in the <code>assets/src/</code> directory.</p>\n</li>\n<li>\n<p><strong>Host can be enable or disable meeting</strong> As a host, you have full authority to enable or disable meetings with MeetingHub. This feature offers flexibility and control over the availability of your scheduled meetings, allowing you to activate or deactivate sessions as needed. Utilize this powerful control to manage meeting accessibility, enhance security, and maintain organizational protocols effectively. Ensure your meetings are only available when you want them to be, providing a secure and well-managed virtual meeting environment.</p>\n</li>\n<li>\n<p><strong>Multi-Language Translation Support:</strong> MeetingHub offers full internationalization, allowing you to translate the entire plugin interface into your preferred language. This feature enhances accessibility and usability for a global audience, making it easier for users worldwide to integrate seamlessly with Zoom, Jitsi Meet, Webex, Google Meet, and other video conferencing platforms.</p>\n</li>\n</ul>\n<h3>Integrations 👇</h3>\n<h3>🎯 Jitsi Meet Integration</h3>\n<p>Enjoy real-time collaboration with Jitsi Meet. MeetingHub seamlessly integrates with Jitsi Meet to provide users with a reliable and feature-rich video conferencing experience.</p>\n<ul>\n<li>\n<p><strong>Unlimited Duration Meetings</strong> &#8211; Embrace the liberty of hosting webinars without time constraints with Jitsi Meet for WordPress. Powered by our Jitsi community instance, each meeting enjoys extended availability, offering two hours of seamless interaction that automatically renews post-session. Immerse yourself in a full spectrum of cutting-edge video conferencing features, making our plugin the epitome of versatility for crafting WordPress webinars.</p>\n</li>\n<li>\n<p><strong>Customized Meeting Titles</strong> &#8211; Add a personal touch to your webinars by assigning distinctive names, facilitating easy recognition, and elevating the overall branding of your virtual events.</p>\n</li>\n<li>\n<p><strong>Dynamic Screen Sharing</strong> &#8211; Enhance communication in your virtual meetings with Jitsi Meet&#8217;s unmatched screen-sharing capabilities. This plugin distinguishes itself as the most intelligent choice among WordPress meeting plugins.</p>\n</li>\n<li>\n<p><strong>Limitless Meetings</strong> &#8211; Unshackle yourself from constraints and host an unlimited number of live webinars and video conferences seamlessly through the Jitsi Meet plugin on your WordPress website. Revel in unparalleled freedom and flexibility in your virtual event hosting endeavors.</p>\n</li>\n<li>\n<p><strong>Meeting Shortcode</strong> &#8211; Unleash enhanced functionality with Jitsi Meet&#8217;s shortcode feature, seamlessly creating and embedding video meetings on your website. Utilize the shortcode for diverse purposes, adding a layer of convenience to your WordPress website experience. Elevate your virtual gatherings with Jitsi Meet, where freedom, flexibility, and a seamless user experience converge.</p>\n</li>\n<li>\n<p><strong>Gutenberg Support</strong> &#8211; Embrace modern content creation with Gutenberg support for Jitsi Meet. Effortlessly integrate meetings into your posts and pages using the block editor, enhancing the overall user experience.</p>\n</li>\n<li>\n<p><strong>Meeting Height &amp; Width Customization</strong> &#8211; Enjoy added flexibility in meeting display by adjusting height and width settings. Tailor the visual aspects of your virtual gatherings to suit your specific needs, providing a personalized and engaging experience.</p>\n</li>\n<li>\n<p><strong>Meeting Muting Flexibility</strong> &#8211; Take control of your video conferences and webinars by muting them at your convenience through Jitsi Meet. Stay in charge and ensure smooth communication throughout.</p>\n</li>\n<li>\n<p><strong>Interactive Screen Sharing</strong> &#8211; Foster better communication among hosts and participants by seamlessly sharing screens during virtual meetings. Enhance collaboration and productivity with this intuitive feature.</p>\n</li>\n<li>\n<p><strong>Effortless Elementor Integration</strong> &#8211; Create meetings within Elementor effortlessly using simple shortcodes. Enjoy seamless live video chats without technical complexities, streamlining your workflow and enhancing user experience effortlessly.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance with a countdown timer for your upcoming Zoom events. Display a live timer on your website, reminding users of the approaching event start time.</p>\n</li>\n<li>\n<p><strong>Custom Domain Hosting</strong> &#8211; Personalize your video conferencing experience by creating a unique, branded URL for your meetings. Enhance your professional identity and make your website stand out with a custom domain for your Jitsi Meet sessions.</p>\n</li>\n<li>\n<p><strong>8&#215;8 JaaS Integration</strong> &#8211; Seamlessly integrate Jitsi with 8&#215;8&#8217;s JaaS (Jitsi as a Service) for a robust and scalable video conferencing solution. Enjoy enhanced features and reliability, ensuring your virtual meetings run smoothly and efficiently.</p>\n</li>\n</ul>\n<h3>🎯 Zoom Integration</h3>\n<p>MeetingHub&#8217;s seamless Zoom integration offers a powerful, feature-rich experience for managing your virtual meetings and webinars directly from your WordPress site.</p>\n<ul>\n<li>\n<p><strong>Effortlessly Manage Zoom Users and Access Reports</strong> &#8211; Oversee all your Zoom users and access comprehensive reports directly from your WordPress dashboard. Monitor participant activity, attendance, and meeting statistics with ease, improving your administrative efficiency.</p>\n</li>\n<li>\n<p><strong>Recurring Meetings and Webinars (Upcoming)</strong> &#8211; Schedule and manage recurring Zoom meetings and webinars without hassle. Keep your virtual events consistent and streamline your planning process by automating recurring sessions.</p>\n</li>\n<li>\n<p><strong>Utilize Personal Meeting IDs</strong> &#8211; Use your unique Personal Meeting IDs for setting up and managing your Zoom meetings. Maintain a consistent and recognizable identity for your meetings, enhancing professional branding and user familiarity.</p>\n</li>\n<li>\n<p><strong>View Registrants from the Frontend (Upcoming)</strong> &#8211; Display a list of meeting and webinar registrants directly on your website. Allow users to see who else is attending and foster a sense of community and engagement among participants.</p>\n</li>\n<li>\n<p><strong>Show User Recordings Based on Zoom Account</strong> &#8211; Customize your content delivery by showing recordings associated with specific Zoom accounts. Provide a personalized user experience by tailoring access to relevant recordings.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance with a countdown timer for your upcoming Zoom events. Display a live timer on your website, reminding users of the approaching event start time.</p>\n</li>\n<li>\n<p><strong>Duplicate Meetings and Webinars (Upcoming)</strong> &#8211; Easily duplicate existing Zoom meetings and webinars with a single click. Save time and effort when setting up similar or recurring events.</p>\n</li>\n<li>\n<p><strong>List and Access Recordings</strong> &#8211; Conveniently list and access all your Zoom meeting and webinar recordings from within WordPress. Ensure your valuable content is always available and organized for easy retrieval and playback.</p>\n</li>\n<li>\n<p><strong>Show Events in Calendar (Upcoming)</strong> &#8211; Display all your Zoom events in an interactive calendar view on your WordPress site. Enhance user experience by providing a clear and organized schedule of upcoming meetings and webinars.</p>\n</li>\n<li>\n<p><strong>Add to Calendar Links (Upcoming)</strong> &#8211; Simplify scheduling for your participants by providing &#8220;Add to Calendar&#8221; links. Ensure your audience never misses an event by allowing them to easily add meetings to their personal calendars.</p>\n</li>\n<li>\n<p><strong>Gutenberg Support</strong> &#8211; Embrace modern content creation with Gutenberg support for Zoom. Effortlessly integrate Zoom meetings into your posts and pages using the block editor, enhancing the overall user experience.</p>\n</li>\n<li>\n<p><strong>Meeting Shortcode</strong> &#8211; Unlock enhanced functionality with Zoom&#8217;s shortcode feature, seamlessly creating and embedding video meetings on your website. Utilize the shortcode for diverse purposes, adding a layer of convenience to your WordPress website experience. Elevate your virtual gatherings with Zoom, where freedom, flexibility, and a seamless user experience converge.</p>\n</li>\n<li>\n<p><strong>Effortless Elementor Integration</strong> &#8211; Create Zoom meetings within Elementor effortlessly using simple shortcodes. Enjoy seamless live video chats without technical complexities, streamlining your workflow and enhancing user experience effortlessly.</p>\n</li>\n</ul>\n<h3>Enhance Your Virtual Meeting Experience</h3>\n<p>With MeetingHub&#8217;s advanced Zoom integration features, you can efficiently manage your virtual meetings and webinars, providing a seamless experience for both administrators and participants. Optimize your workflow, improve user engagement, and maintain a professional online presence with our robust set of tools and upcoming features.</p>\n<h3>🎯 Webex Integration</h3>\n<p>Enhance your WordPress site with seamless Webex integration, perfect for educational institutions, consulting firms, remote businesses, yoga instructors, and more. Our MeetingHub (Video Conferencing with Webex) plugin is designed to streamline your workflow by allowing you to schedule, manage, and display Webex meetings directly on your WordPress site.</p>\n<h3>Why Use Webex Integration with MeetingHub?</h3>\n<ul>\n<li>\n<p><strong>Perfect for Remote Work:</strong> Ideal for businesses adapting to remote workflows and online learning environments.</p>\n</li>\n<li>\n<p><strong>User-Friendly Interface:</strong> Schedule Webex meetings easily and display them on your site with a single click.</p>\n</li>\n<li>\n<p><strong>Increase Engagement:</strong> Allow users to join Webex meetings directly from your site, enhancing interaction and engagement.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance with a countdown timer for your upcoming events. Display a live timer on your website, reminding users of the approaching event start time.</p>\n</li>\n<li>\n<p><strong>Gutenberg Support</strong> &#8211; Embrace modern content creation with Gutenberg support for Webex. Effortlessly integrate Webex meetings into your posts and pages using the block editor, enhancing the overall user experience.</p>\n</li>\n<li>\n<p><strong>Meeting Shortcode</strong> &#8211; Unlock enhanced functionality with Webex&#8217;s shortcode feature, seamlessly creating and embedding video meetings on your website. Utilize the shortcode for diverse purposes, adding a layer of convenience to your WordPress website experience. Elevate your virtual gatherings with Webex, where freedom, flexibility, and a seamless user experience converge.</p>\n</li>\n<li>\n<p><strong>Effortless Elementor Integration</strong> &#8211; Create Webex meetings within Elementor effortlessly using simple shortcodes. Enjoy seamless live video chats without technical complexities, streamlining your workflow and enhancing user experience effortlessly.</p>\n</li>\n</ul>\n<h3>Key Features</h3>\n<ul>\n<li><strong>Manage Webex Meetings:</strong> Organize and manage your Webex meetings as WordPress posts.</li>\n<li><strong>Quick Setup:</strong> Easy installation and configuration process.</li>\n<li><strong>Developer Friendly:</strong> Extensive customization options and template overrides for developers.</li>\n<li><strong>Meeting Recordings:</strong> View and manage meeting recordings directly from your dashboard.</li>\n<li><strong>Customizable Layouts:</strong> Change frontend layouts to suit your site’s design.</li>\n<li><strong>Shortcodes:</strong> Use shortcodes to embed Webex meetings anywhere on your site.</li>\n<li>\n<p><strong>One-Click Import (Upcoming):</strong> Import your Webex meetings into your WordPress dashboard with a single click.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance with a countdown timer for your upcoming events. Display a live timer on your website, reminding users of the approaching event start time.</p>\n</li>\n</ul>\n<h3>Upcoming Features &amp; Integrations</h3>\n<p>We have exciting plans for the future! MeetingHub is committed to enhancing your meeting experience by integrating with additional platforms. Let&#8217;s check what&#8217;s coming next!</p>\n<ul>\n<li>LMS Integration (LearnPress, LearnDash, Tutor LMS)</li>\n<li>WooCommerce Integration</li>\n<li>Email notification</li>\n<li>And many more&#8230;</li>\n</ul>\n<h3>🎥 Video Tutorials</h3>\n<ul>\n<li><strong>Setting Up Zoom with Server-to-Server OAuth in MeetingHub</strong></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ApSm4QJXLGc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Watch this tutorial to learn how to set up Zoom with Server-to-Server OAuth in MeetingHub. This video provides step-by-step instructions to configure OAuth credentials for seamless integration.</p>\n<ul>\n<li><strong>Setting Up Zoom with Meeting SDK App in MeetingHub</strong></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Q0Zt80PjvTE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>This tutorial demonstrates how to set up Zoom with Meeting SDK App in MeetingHub. Follow along with the video to configure your Meeting SDK App credentials for enhanced functionality within MeetingHub.</p>\n<ul>\n<li><strong>How to Set Up Webex OAuth in MeetingHub</strong></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/vV3EwUNJusk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<ul>\n<li><strong>How to Set Up 8&#215;8 JaaS in MeetingHub</strong></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/YqQ7Kcap5vo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>In this comprehensive tutorial, we&#8217;ll guide you through the entire process of setting up Webex OAuth in MeetingHub. Whether you&#8217;re a developer or an administrator, this video will help you integrate Webex authentication seamlessly and securely into your MeetingHub environment. Follow our detailed steps to ensure a smooth setup and enhance your meeting management experience.</p>\n<h4>Best and super easy WordPress webinar plugin to create instant meetings with Zoom, Jitsi Meet, Webex, and more. Meeting with Zoom, Jitsi Meet, Webex, and More | All-in-one Webinar and Video Conference for WordPress &#8211; MeetingHub</h4>\n<h4>Video conferencing with Zoom, MeetingHub plugin gives you the extensive functionality to manage your Zoom Meetings, Webinars, Recordings, Users, Reports from your WordPress Dashboard directly. The plugin is a great tool for managing your Zoom sessions on the fly without needing to go back and forth on multiple platforms. This plugin is developed in order to make smooth transitions in managing your online meetings or webinars without any hassle and time loss.</h4>\n",
    "download_link": "https://downloads.wordpress.org/plugin/meetinghub.1.13.7.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-1.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-2.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-3.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-4.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-5.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-6.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-7.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-8.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-9.png?rev=3091973",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-10.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-11.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-12.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-13.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-14.png?rev=3091909",
            "caption": ""
        }
    ],
    "tags": {
        "google-meet": "google meet",
        "video-conference": "video conference",
        "webex": "webex",
        "webinar": "webinar",
        "zoom-meeting": "zoom meeting"
    },
    "stable_tag": "1.13.7",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/meetinghub.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/meetinghub.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/meetinghub.1.0.2.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/meetinghub.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/meetinghub.1.1.1.zip",
        "1.10.0": "https://downloads.wordpress.org/plugin/meetinghub.1.10.0.zip",
        "1.11.0": "https://downloads.wordpress.org/plugin/meetinghub.1.11.0.zip",
        "1.11.1": "https://downloads.wordpress.org/plugin/meetinghub.1.11.1.zip",
        "1.12.0": "https://downloads.wordpress.org/plugin/meetinghub.1.12.0.zip",
        "1.13.0": "https://downloads.wordpress.org/plugin/meetinghub.1.13.0.zip",
        "1.13.1": "https://downloads.wordpress.org/plugin/meetinghub.1.13.1.zip",
        "1.13.2": "https://downloads.wordpress.org/plugin/meetinghub.1.13.2.zip",
        "1.13.3": "https://downloads.wordpress.org/plugin/meetinghub.1.13.3.zip",
        "1.13.4": "https://downloads.wordpress.org/plugin/meetinghub.1.13.4.zip",
        "1.13.5": "https://downloads.wordpress.org/plugin/meetinghub.1.13.5.zip",
        "1.13.6": "https://downloads.wordpress.org/plugin/meetinghub.1.13.6.zip",
        "1.13.7": "https://downloads.wordpress.org/plugin/meetinghub.1.13.7.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/meetinghub.1.2.0.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/meetinghub.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/meetinghub.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/meetinghub.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/meetinghub.1.3.3.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/meetinghub.1.4.0.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/meetinghub.1.5.0.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/meetinghub.1.6.0.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/meetinghub.1.7.0.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/meetinghub.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/meetinghub.1.7.2.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/meetinghub.1.8.0.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/meetinghub.1.9.0.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/meetinghub.1.9.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/meetinghub.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/meetinghub/assets/banner-772x250.png?rev=3039185",
        "high": "https://ps.w.org/meetinghub/assets/banner-1544x500.png?rev=3039185"
    },
    "icons": {
        "1x": "https://ps.w.org/meetinghub/assets/icon-128x128.png?rev=3039185",
        "2x": "https://ps.w.org/meetinghub/assets/icon-256x256.png?rev=3039185"
    },
    "blocks": {
        "meetinghub/jitsi-meet": {
            "name": "meetinghub/jitsi-meet",
            "title": "Jitsi Meet (MeetingHub)"
        },
        "meetinghub/zoom": {
            "name": "meetinghub/zoom",
            "title": "Zoom Direct Meeting or Webinar (MeetingHub)"
        },
        "meetinghub/webex": {
            "name": "meetinghub/webex",
            "title": "Webex (MeetingHub)"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}