{
    "name": "Zoom Meeting, Jitsi Meet, Webex, &amp; Google Meet &#8211; All-in-One Webinar &amp; Video Conference Solution for WordPress: MeetingHub",
    "slug": "meetinghub",
    "version": "1.15.6",
    "author": "<a href=\"https://sovlix.com/\">Sovlix</a>",
    "author_profile": "https://profiles.wordpress.org/sovlix/",
    "contributors": {
        "sovlix": {
            "profile": "https://profiles.wordpress.org/sovlix/",
            "avatar": "https://secure.gravatar.com/avatar/d66b7fb372d92253120b854a1b8ed576?s=96&d=monsterid&r=g",
            "display_name": "Sovlix"
        }
    },
    "requires": "5.0",
    "tested": "6.6.2",
    "requires_php": "7.2",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 6,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 6,
    "support_url": "https://wordpress.org/support/plugin/meetinghub/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 100,
    "last_updated": "2024-10-16 22:08:00",
    "added": "2024-02-13",
    "homepage": "",
    "sections": {
        "description": "<p>🔥 Get MeetingHub <strong><a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Lifetime Deal at 84% OFF!</a></strong> This offer won&#8217;t come again, <strong>we promise!</strong></p>\n<h4>Integrate Zoom Meeting, Jitsi Meet, Webex, &amp; Google Meet with the All-in-one Video Conference Plugin (MeetingHub) with Branded Meetings.</h4>\n<p><strong>👉 Join our <a href=\"https://www.facebook.com/groups/sovlixcommunity\" rel=\"nofollow ugc\">Facebook Community</a></strong></p>\n<p><strong>👉 Get updates from our</strong></p>\n<ul>\n<li><a href=\"https://www.linkedin.com/company/sovlix\" rel=\"nofollow ugc\">LinkedIn</a></li>\n<li><a href=\"https://x.com/SovlixOfficial\" rel=\"nofollow ugc\">Twitter</a></li>\n<li><a href=\"https://www.youtube.com/@Sovlix/\" rel=\"nofollow ugc\">YouTube</a> </li>\n<li><a href=\"https://www.facebook.com/sovlix\" rel=\"nofollow ugc\">Facebook Page</a></li>\n</ul>\n<p><strong>🎁 <a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Grab 84% Life Time Deal</a> NOW!</strong></p>\n<p>Elevate your online meeting experience with MeetingHub – the ultimate all-in-one meeting solution for WordPress. MeetingHub is the best and easiest WordPress webinar plugin designed to create instant meetings with popular platforms such as Zoom Meeting, Jitsi Meet, Webex, Google Meet, and more.</p>\n<h3>Why Choose MeetingHub?</h3>\n<ul>\n<li><strong>Seamless Integration:</strong> Connect effortlessly with Zoom Meeting, Jitsi Meet, Webex, Google Meet, and other leading video conferencing platforms within your WordPress environment.</li>\n<li><strong>Easy Setup:</strong> Setting up and managing meetings is a breeze with our user-friendly interface, ensuring a hassle-free experience for both administrators and participants.</li>\n<li><strong>Comprehensive Support:</strong> Whether you&#8217;re hosting webinars or conferences, MeetingHub caters to all your meeting needs, providing a versatile solution for various scenarios.</li>\n<li>\n<p><strong>Developer-Friendly:</strong> Explore the comprehensive source code for MeetingHub, empowering developers to understand the inner workings of the Jitsi Meet integration. The readable React source code is conveniently located in the <code>assets/src/</code> directory.</p>\n</li>\n<li>\n<p><strong>Host can be enable or disable meeting</strong> As a host, you have full authority to enable or disable meetings with MeetingHub. This feature offers flexibility and control over the availability of your scheduled meetings, allowing you to activate or deactivate sessions as needed. Utilize this powerful control to manage meeting accessibility, enhance security, and maintain organizational protocols effectively. Ensure your meetings are only available when you want them to be, providing a secure and well-managed virtual meeting environment.</p>\n</li>\n<li>\n<p><strong>Multi-Language Translation Support:</strong> MeetingHub offers full internationalization, allowing you to translate the entire plugin interface into your preferred language. This feature enhances accessibility and usability for a global audience, making it easier for users worldwide to integrate seamlessly with Zoom Meeting, Jitsi Meet, Webex, Google Meet, and other video conferencing platforms.</p>\n</li>\n</ul>\n<h4>🎁 <a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Get Pro</a></h4>\n<h3>Integrations 👇</h3>\n<h3>🎯 Zoom Meeting Integration</h3>\n<p>MeetingHub offers a comprehensive Zoom meeting integration, empowering you to manage all your virtual meetings and webinars right from your WordPress site. Whether you&#8217;re hosting a small group or a large-scale event, MeetingHub makes it easy to handle every aspect of your Zoom meeting experience.</p>\n<ul>\n<li>\n<p><strong>Effortlessly Manage Zoom Users and Access Reports</strong> &#8211; Take full control of your Zoom meeting users and access detailed reports directly from your WordPress dashboard. You&#8217;ll be able to track participation, monitor attendance, and analyze Zoom meeting statistics to boost your administrative efficiency.</p>\n</li>\n<li>\n<p><strong>Recurring Meetings and Webinars</strong> &#8211; Set up and manage recurring Zoom meeting and webinars without the usual hassle. By automating these processes, you ensure consistency and smooth scheduling for your audience.</p>\n</li>\n<li>\n<p><strong>Utilize Personal Meeting IDs</strong> &#8211; Use your unique Personal Meeting IDs to organize and manage your Zoom meeting. This feature ensures that your professional branding remains intact and participants can easily recognize your sessions.</p>\n</li>\n<li>\n<p><strong>View Registrants from the Frontend</strong> &#8211; Let visitors see who else will be attending your Zoom meetings and webinars by displaying a list of registrants right on your website. This transparency fosters community and increases engagement for future Zoom meeting events.</p>\n</li>\n<li>\n<p><strong>Show User Recordings Based on Zoom Account</strong> &#8211; Customize your post-meeting content by displaying recordings tied to specific Zoom accounts. This helps you provide a personalized follow-up experience for attendees of your Zoom meeting.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance by adding a countdown timer to your upcoming Zoom meetings and webinars. This keeps users excited and aware of when the next Zoom meeting will begin.</p>\n</li>\n<li>\n<p><strong>Duplicate Meetings and Webinars</strong> &#8211; Save time by duplicating existing Zoom meetings or webinars with a simple click. This is perfect for recurring or similar events, allowing you to quickly replicate successful Zoom meeting.</p>\n</li>\n<li>\n<p><strong>List and Access Recordings</strong> &#8211; Easily access and list all your Zoom meeting and webinar recordings directly within WordPress. This ensures that your content is well-organized and easily available for on-demand viewing.</p>\n</li>\n<li>\n<p><strong>Show Events in Calendar</strong> &#8211; Provide a convenient calendar view of your Zoom meeting schedule. Displaying all upcoming Zoom meeting in one place gives your audience a clear picture of your event lineup.</p>\n</li>\n<li>\n<p><strong>Add to Calendar Links</strong> &#8211; Simplify the scheduling process for your participants by offering &#8220;Add to Calendar&#8221; links for each Zoom meeting. This helps attendees easily keep track of all your virtual events.</p>\n</li>\n<li>\n<p><strong>Gutenberg Support</strong> &#8211; Integrate Zoom meeting seamlessly into your WordPress site using Gutenberg blocks. Whether it&#8217;s embedding a live session or adding a meeting link to your content, Gutenberg makes managing Zoom meeting effortless.</p>\n</li>\n<li>\n<p><strong>Zoom Meeting Shortcode</strong> &#8211; MeetingHub’s shortcode functionality allows you to embed any Zoom meeting directly into your WordPress site. This flexibility is key to a smooth user experience, whether you&#8217;re using it for live video chats, business meetings, or webinars.</p>\n</li>\n<li>\n<p><strong>Effortless Elementor Integration</strong> &#8211; If you&#8217;re using Elementor to build your website, MeetingHub has you covered. You can easily create and manage Zoom meeting within Elementor, providing a smooth and consistent experience for your visitors.</p>\n</li>\n</ul>\n<h3>Enhance Your Virtual Meeting Experience</h3>\n<p>MeetingHub’s powerful Zoom meeting integration brings everything you need to host seamless, professional virtual meetings and webinars. By integrating Zoom directly into your WordPress website, you can manage everything from one platform, making your Zoom meeting workflow more efficient. With our extensive set of features, you’ll enhance both your administrative capabilities and user engagement.</p>\n<p>Whether you’re managing recurring Zoom meetings, accessing detailed reports, or creating a countdown timer to keep participants engaged, MeetingHub elevates your Zoom meeting experience, offering unmatched ease and flexibility.</p>\n<h4>🎁 <a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Get Pro</a></h4>\n<h3>🎯 Jitsi Meet Integration</h3>\n<p>Enjoy real-time collaboration with Jitsi Meet. MeetingHub seamlessly integrates with Jitsi Meet to provide users with a reliable and feature-rich video conferencing experience.</p>\n<ul>\n<li>\n<p><strong>Unlimited Duration Meetings</strong> &#8211; Embrace the liberty of hosting webinars without time constraints with Jitsi Meet for WordPress. Powered by our Jitsi community instance, each meeting enjoys extended availability, offering two hours of seamless interaction that automatically renews post-session. Immerse yourself in a full spectrum of cutting-edge video conferencing features, making our plugin the epitome of versatility for crafting WordPress webinars.</p>\n</li>\n<li>\n<p><strong>Customized Meeting Titles</strong> &#8211; Add a personal touch to your webinars by assigning distinctive names, facilitating easy recognition, and elevating the overall branding of your virtual events.</p>\n</li>\n<li>\n<p><strong>Dynamic Screen Sharing</strong> &#8211; Enhance communication in your virtual meetings with Jitsi Meet&#8217;s unmatched screen-sharing capabilities. This plugin distinguishes itself as the most intelligent choice among WordPress meeting plugins.</p>\n</li>\n<li>\n<p><strong>Limitless Meetings</strong> &#8211; Unshackle yourself from constraints and host an unlimited number of live webinars and video conferences seamlessly through the Jitsi Meet plugin on your WordPress website. Revel in unparalleled freedom and flexibility in your virtual event hosting endeavors.</p>\n</li>\n<li>\n<p><strong>Meeting Shortcode</strong> &#8211; Unleash enhanced functionality with Jitsi Meet&#8217;s shortcode feature, seamlessly creating and embedding video meetings on your website. Utilize the shortcode for diverse purposes, adding a layer of convenience to your WordPress website experience. Elevate your virtual gatherings with Jitsi Meet, where freedom, flexibility, and a seamless user experience converge.</p>\n</li>\n<li>\n<p><strong>Gutenberg Support</strong> &#8211; Embrace modern content creation with Gutenberg support for Jitsi Meet. Effortlessly integrate meetings into your posts and pages using the block editor, enhancing the overall user experience.</p>\n</li>\n<li>\n<p><strong>Meeting Height &amp; Width Customization</strong> &#8211; Enjoy added flexibility in meeting display by adjusting height and width settings. Tailor the visual aspects of your virtual gatherings to suit your specific needs, providing a personalized and engaging experience.</p>\n</li>\n<li>\n<p><strong>Meeting Muting Flexibility</strong> &#8211; Take control of your video conferences and webinars by muting them at your convenience through Jitsi Meet. Stay in charge and ensure smooth communication throughout.</p>\n</li>\n<li>\n<p><strong>Interactive Screen Sharing</strong> &#8211; Foster better communication among hosts and participants by seamlessly sharing screens during virtual meetings. Enhance collaboration and productivity with this intuitive feature.</p>\n</li>\n<li>\n<p><strong>Effortless Elementor Integration</strong> &#8211; Create meetings within Elementor effortlessly using simple shortcodes. Enjoy seamless live video chats without technical complexities, streamlining your workflow and enhancing user experience effortlessly.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance with a countdown timer for your upcoming Zoom events. Display a live timer on your website, reminding users of the approaching event start time.</p>\n</li>\n<li>\n<p><strong>Custom Domain Hosting</strong> &#8211; Personalize your video conferencing experience by creating a unique, branded URL for your meetings. Enhance your professional identity and make your website stand out with a custom domain for your Jitsi Meet sessions.</p>\n</li>\n<li>\n<p><strong>8&#215;8 JaaS Integration</strong> &#8211; Seamlessly integrate Jitsi with 8&#215;8&#8217;s JaaS (Jitsi as a Service) for a robust and scalable video conferencing solution. Enjoy enhanced features and reliability, ensuring your virtual meetings run smoothly and efficiently.</p>\n</li>\n</ul>\n<h4>🎁 <a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Get Pro</a></h4>\n<h3>🎯 Webex Integration</h3>\n<p>Enhance your WordPress site with seamless Webex integration, perfect for educational institutions, consulting firms, remote businesses, yoga instructors, and more. Our MeetingHub (Video Conferencing with Webex) plugin is designed to streamline your workflow by allowing you to schedule, manage, and display Webex meetings directly on your WordPress site.</p>\n<h3>Why Use Webex Integration with MeetingHub?</h3>\n<ul>\n<li>\n<p><strong>Perfect for Remote Work:</strong> Ideal for businesses adapting to remote workflows and online learning environments.</p>\n</li>\n<li>\n<p><strong>User-Friendly Interface:</strong> Schedule Webex meetings easily and display them on your site with a single click.</p>\n</li>\n<li>\n<p><strong>Increase Engagement:</strong> Allow users to join Webex meetings directly from your site, enhancing interaction and engagement.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance with a countdown timer for your upcoming events. Display a live timer on your website, reminding users of the approaching event start time.</p>\n</li>\n<li>\n<p><strong>Gutenberg Support</strong> &#8211; Embrace modern content creation with Gutenberg support for Webex. Effortlessly integrate Webex meetings into your posts and pages using the block editor, enhancing the overall user experience.</p>\n</li>\n<li>\n<p><strong>Meeting Shortcode</strong> &#8211; Unlock enhanced functionality with Webex&#8217;s shortcode feature, seamlessly creating and embedding video meetings on your website. Utilize the shortcode for diverse purposes, adding a layer of convenience to your WordPress website experience. Elevate your virtual gatherings with Webex, where freedom, flexibility, and a seamless user experience converge.</p>\n</li>\n<li>\n<p><strong>Effortless Elementor Integration</strong> &#8211; Create Webex meetings within Elementor effortlessly using simple shortcodes. Enjoy seamless live video chats without technical complexities, streamlining your workflow and enhancing user experience effortlessly.</p>\n</li>\n</ul>\n<p><strong>🎁 <a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Grab 84% Life Time Deal</a> for limited time!</strong> This offer won&#8217;t come again, <strong>we promise!</strong></p>\n<h3>⚡ New</h3>\n<p><strong>Effortless LMS Integration</strong><br />\nTake your online education experience to the next level with our seamless LMS integration. Whether you’re using LearnDash, LifterLMS, or Tutor LMS, LearnPress our plugin connects effortlessly with platforms like Zoom, Jitsi, Webex, and Google Meet to power your virtual classrooms.</p>\n<ul>\n<li>Instant setup for virtual classes directly from your LMS dashboard</li>\n<li>Compatible with top LMS platforms: LearnDash, LifterLMS, Tutor LMS, and more</li>\n<li>Automate class scheduling and send reminders to students via email</li>\n<li>Perfect for e-learning, corporate training, and online coaching</li>\n<li>Create meetings in both the admin dashboard and instructor dashboard</li>\n<li>Each user&#8217;s meetings are private, and only they can access their own meetings</li>\n<li>Insert lessons and courses using shortcodes</li>\n<li>Easily embed meetings into your lessons with a dedicated button on the editor to insert meeting shortcodes automatically</li>\n</ul>\n<p>With this integration, scheduling and running live online classes or webinars is just a click away, making life easier for educators and trainers who want to deliver engaging lessons without the tech hassle.</p>\n<p><strong>Google Calendar Integration for Smarter Scheduling</strong><br />\nNever miss a meeting or class again with our Google Calendar integration. Automatically sync all your video calls, appointments, and LMS sessions with your calendar so you stay on top of your schedule.</p>\n<ul>\n<li>Automatically sync bookings, classes, and appointments with Google Calendar</li>\n<li>Real-time updates to avoid double bookings or scheduling conflicts</li>\n<li>Get notifications for all your events, synced across your devices</li>\n<li>Integrates with Outlook, iCal, and other popular calendar apps (upcoming)</li>\n</ul>\n<p>Whether you’re scheduling a one-on-one consultation or an entire week of classes, our Google Calendar integration ensures everything runs smoothly. Focus more on your meetings and less on your schedule with this convenient, time-saving feature.</p>\n<h4>🎁 <a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Get Pro</a></h4>\n<h3>😍 Upcoming Features &amp; Integrations</h3>\n<p><strong>Seamless Appointment Scheduling</strong><br />\nWe’re excited to introduce an appointment scheduling feature that allows users to seamlessly book meetings through platforms like Zoom, Jitsi, Webex, and Google Meet. With automated scheduling and calendar integrations, managing your time has never been easier.</p>\n<ul>\n<li>Automate appointment bookings with real-time availability</li>\n<li>Integrate with major video conferencing platforms</li>\n<li>Customizable appointment reminders for clients and hosts</li>\n<li>Sync appointments with Google Calendar, Outlook, and more</li>\n</ul>\n<p><strong>Advanced Booking System</strong><br />\nOur plugin will soon support a complete booking system to streamline meeting bookings, consultations, and events. Whether you’re managing online sessions, training, or webinars, this feature will handle all your booking needs.</p>\n<ul>\n<li>Manage individual or group bookings for meetings or events</li>\n<li>Custom time slots and session lengths</li>\n<li>Instant confirmation and booking notifications</li>\n<li>Integrated payment gateways for paid appointments (PayPal, Stripe, etc.)</li>\n</ul>\n<p><strong>Complete Integration for Appointments and Booking</strong><br />\nOur goal is to provide you with a comprehensive solution for handling both meeting scheduling and appointment management. With support for multiple video conferencing platforms, you’ll be able to book and manage all your virtual appointments in one place.</p>\n<ul>\n<li>One-click appointment scheduling with Zoom, Jitsi, Webex, and Google Meet</li>\n<li>Recurring appointments with automated reminders</li>\n<li>User-friendly booking calendar for clients to select preferred times</li>\n<li>Track and manage all upcoming appointments and meetings from a single dashboard</li>\n</ul>\n<h3>🎥 Video Tutorials</h3>\n<p>👉 <strong>Setting Up Zoom with Server-to-Server OAuth in MeetingHub</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ApSm4QJXLGc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Watch this tutorial to learn how to set up Zoom with Server-to-Server OAuth in MeetingHub. This video provides step-by-step instructions to configure OAuth credentials for seamless integration.</p>\n<p>👉 <strong>Setting Up Zoom with Meeting SDK App in MeetingHub</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Q0Zt80PjvTE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>This tutorial demonstrates how to set up Zoom with Meeting SDK App in MeetingHub. Follow along with the video to configure your Meeting SDK App credentials for enhanced functionality within Meeting Hub.</p>\n<p>👉 <strong>How to Set Up Webex OAuth in MeetingHub</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/vV3EwUNJusk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>👉 <strong>How to Set Up 8&#215;8 JaaS in MeetingHub</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/YqQ7Kcap5vo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>In this comprehensive tutorial, we&#8217;ll guide you through the entire process of setting up Webex OAuth in MeetingHub. Whether you&#8217;re a developer or an administrator, this video will help you integrate Webex authentication seamlessly and securely into your MeetingHub environment. Follow our detailed steps to ensure a smooth setup and enhance your meeting management experience.</p>\n<p>Best and super easy WordPress webinar plugin to create instant meetings with Zoom, Jitsi Meet, Webex, and more. Meeting with Zoom, Jitsi Meet, Webex, and More | All-in-one Webinar and Video Conference for WordPress &#8211; Meeting Hub</p>\n<p>Webinar and Video Conference with Jitsi Meet – Create Branded Webinars for WordPress, Meetings &amp; Livestreaming. EMBED MEETINGS, HOST WEBINARS, AND VIDEO CONFERENCE – EVERYTHING FROM THE WORDPRESS DASHBOARD</p>\n<p>Best Alternative of Video Conferencing with Zoom, eRoom – Zoom Meetings &amp; Webinars,  &hellip;</p>\n",
        "changelog": "<h4>1.15.6 &#8211; 17 OCT, 2024</h4>\n<ul>\n<li><strong>New:</strong> Added the ability to create meetings and display the meeting list on the Tutor LMS instructor dashboard</li>\n<li><strong>Fix:</strong> Resolved an error on the Zoom create user page</li>\n<li><strong>Fix:</strong> Fixed several UI issues</li>\n</ul>\n<h4>1.15.5 &#8211; 13 OCT, 2024</h4>\n<ul>\n<li><strong>New:</strong> Introduce WooCommerce booking integration</li>\n<li><strong>Fix:</strong> Resolved an issue related WooCommerce cart page</li>\n</ul>\n<h4>1.15.4 &#8211; 10 OCT, 2024</h4>\n<ul>\n<li><strong>Fix:</strong> Resolved issue where Zoom recurring meeting information was not displayed on the frontend</li>\n<li><strong>Fix:</strong> Fixed the issue where the floating &#8220;Create Meeting&#8221; button sometimes did not work</li>\n<li><strong>Fix:</strong> Corrected Webex meeting creation error related to the start time</li>\n</ul>\n<h4>1.15.3 &#8211; 04 OCT, 2024</h4>\n<ul>\n<li><strong>Improve:</strong> Enhanced decoration and minor tweak</li>\n</ul>\n<h4>1.15.2 &#8211; 27 SEP, 2024</h4>\n<ul>\n<li><strong>Fix:</strong> Fixed Jitsi authentication failed</li>\n<li><strong>Improve:</strong> Updated Freemious SDK</li>\n</ul>\n<h4>1.15.1 &#8211; 18 SEP, 2024</h4>\n<ul>\n<li><strong>Improve:</strong> Updated Freemious SDK</li>\n</ul>\n<h4>1.15.0 (16 September, 2024)</h4>\n<ul>\n<li><strong>New:</strong> We’ve added support for LMS platforms like Tutor LMS, LearnDash, and LearnPress</li>\n<li><strong>New:</strong> You can now integrate with Google Calendar for even better scheduling</li>\n<li><strong>Fix:</strong> Fixed a pesky error with the shortcode that some of you might have encountered</li>\n</ul>\n<h4>1.14.0 (07 September, 2024)</h4>\n<ul>\n<li><strong>New:</strong> WooCommerce integration to sell meetings as products directly through your online store</li>\n<li><strong>New:</strong> Meeting registration system for users to easily register and join meetings</li>\n<li><strong>New:</strong> Support for recurring meetings, enabling automated scheduling and management</li>\n</ul>\n<h4>1.13.7 (13 August, 2024)</h4>\n<ul>\n<li><strong>Improve:</strong> Added comprehensive tutorial links to enhance the settings experience</li>\n</ul>\n<h4>1.13.6 (31 July, 2024)</h4>\n<ul>\n<li><strong>Fix:</strong> Fixed JaaS 8&#215;8 not works</li>\n</ul>\n<h4>1.13.5 (25 July, 2024)</h4>\n<ul>\n<li><strong>Improve:</strong> Enhanced the Zoom join browser functionality on single meeting shortcode</li>\n<li><strong>Fix:</strong> Fixed zoom redirect not works properly</li>\n</ul>\n<h4>1.13.4 (24 July, 2024)</h4>\n<ul>\n<li><strong>Enhancement:</strong> Improved the overall UI responsiveness</li>\n<li><strong>Enhancement:</strong> Enhanced the Jitsi single meeting shortcode</li>\n<li><strong>Enhancement:</strong> Enhanced compatibility to support WordPress 6.6</li>\n</ul>\n<h4>1.13.3 (13 July, 2024)</h4>\n<ul>\n<li><strong>Enhancement:</strong> Added a feature for Zoom meetings to join directly in the browser via shortcode</li>\n</ul>\n<h4>1.13.2 (12 July, 2024)</h4>\n<ul>\n<li><strong>Fix:</strong> Resolved an error that occurred while connect webex from setting</li>\n</ul>\n<h4>1.13.1 (10 July, 2024)</h4>\n<ul>\n<li><strong>Enhancement:</strong> Enhancing plugin security ensures that all data is more secure</li>\n</ul>\n<h4>1.13.0 (09 July, 2024)</h4>\n<ul>\n<li><strong>New:</strong> Added a text editor for the meeting description</li>\n<li><strong>New:</strong> Introduced support for meeting thumbnails</li>\n</ul>\n<h4>1.12.0 (06 July, 2024)</h4>\n<ul>\n<li><strong>New:</strong> Introduced shortcode for displaying Jitsi meeting lists</li>\n<li><strong>New:</strong> Introduced shortcode for displaying Webex meeting lists</li>\n<li><strong>New:</strong> Introduced shortcode for displaying Zoom meeting lists and webinar lists</li>\n</ul>\n<h4>1.11.1 (09 Jun, 2024)</h4>\n<ul>\n<li><strong>New:</strong> Enhanced user experience with the addition of toasts for all actions</li>\n<li><strong>New:</strong> Internationalization support by enabling translation for the entire plugin interface</li>\n<li><strong>New:</strong> Global Settings for Zoom &amp; Webex</li>\n<li><strong>Enhancement::</strong> Improved UI</li>\n</ul>\n<h4>1.11.0 (03 Jun, 2024)</h4>\n<ul>\n<li><strong>New:</strong> Display recording feature for Zoom</li>\n<li><strong>New:</strong> Gutenberg block for Zoom</li>\n<li><strong>New:</strong> Gutenberg block for Webex</li>\n<li><strong>New:</strong> Elementor widget for Zoom</li>\n<li><strong>New:</strong> Elementor widget for for Webex</li>\n<li><strong>New:</strong> Jass 8&#215;8 integration for Jitsi</li>\n<li><strong>New:</strong> Set self-hosted  domain for Jitsi</li>\n</ul>\n<h4>1.10.0 (24 May, 2024)</h4>\n<ul>\n<li>New: Seamlessly integrate Webex for your virtual meetings</li>\n<li>New: Create, edit, and delete Webex meetings directly from the platform</li>\n<li>New: Schedule Webex meetings with ease and efficiency</li>\n<li>New: Added a countdown timer feature for upcoming Webex meetings</li>\n<li>New: Shortcode support</li>\n<li>Fix: Resolved an error that occurred while saving shortcodes for Jitsi and Zoom meetings </li>\n<li>Enhancement: Streamlined the process for deleting multiple meetings</li>\n<li>Enhancement: Improved the accuracy of time zone settings for better scheduling</li>\n</ul>\n<h4>1.9.1 (18 May, 2024)</h4>\n<ul>\n<li>Fix: Resolved jitsi edit meeting not workings</li>\n</ul>\n<h4>1.9.0 (16 May, 2024)</h4>\n<ul>\n<li>New: Daily and account reports for Zoom</li>\n<li>Enhancement: Improved notice for Zoom warnings</li>\n</ul>\n<h4>1.8.0 &#8211; 12 May 2024</h4>\n<ul>\n<li>New: Introducing the option to create Zoom users</li>\n<li>New: Added a feature allowing users to select hosts for Zoom meetings/webinars</li>\n<li>New: Introduced the capability to add alternative hosts for Zoom meetings/webinars</li>\n<li>Enhancement: Improved handling for Zoom meetings/webinars creation when API settings are not properly configured</li>\n<li>Enhancement: Enhanced user experience by displaying notices based on actions taken</li>\n</ul>\n<h4>1.7.2 &#8211; 06 May 2024</h4>\n<ul>\n<li>Fix: Resolved deprecated header and footer issues occurring when the theme lacks either component</li>\n<li>New: Added a setting to hide the header and footer</li>\n</ul>\n<h4>v1.7.1 &#8211; 05 May 2024</h4>\n<ul>\n<li>Enhancement: Improved meeting page UI</li>\n</ul>\n<h4>1.7.0 &#8211; 04 May 2024</h4>\n<ul>\n<li>New: Zoom time duration functionality</li>\n<li>New: Sidebar option implemented for both Jitsi &amp; Zoom</li>\n<li>New: Meeting start and end capabilities for both Jitsi &amp; Zoom</li>\n<li>New: Automatic meeting name and password generation feature</li>\n<li>New: Automatic detection of current timezone feature</li>\n<li>New: Timezone support added for Jitsi</li>\n<li>New: Hide sidebar option introduced</li>\n<li>Enhancement: Enhanced overall UI experience</li>\n<li>Enhancement: Ensured meeting times are accurately reflected based on timezone</li>\n<li>Enhancement: Prevented creation of meetings with past dates</li>\n<li>Fix: Addressed issue where timezone settings did not persist after saving for Zoom</li>\n<li>Fix: Resolved issue with global set data not found for Jitsi meeting creation</li>\n</ul>\n<h4>1.6.0 &#8211; 08 Apr 2024</h4>\n<ul>\n<li>New: Added Jitsi new fields</li>\n<li>New: sticky save &amp; update button</li>\n<li>Fix: Fixed start audio muted setting</li>\n<li>Improvement: Improved save meeting button design</li>\n</ul>\n<h4>1.5.0 &#8211; 07 Apr 2024</h4>\n<ul>\n<li>New: Added Jitsi global settings</li>\n<li>Improvement: Displayed configuration notice only on settings page and update links </li>\n<li>Improvement: Modified back button design</li>\n<li>Improvement: Modified Zoom setup hints design</li>\n<li>Improvement: Fixed loading issue when changing zoom settings tab</li>\n<li>Improvement: Added a notice on zoom meting form</li>\n<li>Improvement: Compatibility has been enhanced to support WordPress 6.5</li>\n</ul>\n<h4>1.4.0 &#8211; 30 Mar 2024</h4>\n<ul>\n<li>New: Improved meeting muting via Jitsi Meet</li>\n<li>New: Added screen sharing for better collaboration</li>\n<li>New: Simplified Elementor integration for Jitsi</li>\n<li>Improvement: Meeting name customization</li>\n<li>Improvement: Modified select settings design</li>\n</ul>\n<h4>1.3.3 &#8211; 16 Mar 2024</h4>\n<ul>\n<li>Improvement: Included a tutorial link in the README for enhanced user guidance</li>\n<li>New: Implemented automatic redirection to the settings page upon activation of the plugin for improved user experience</li>\n</ul>\n<h4>1.3.2 &#8211; 09 Mar 2024</h4>\n<ul>\n<li>Fix: Fixed an issue where all meetings rows were not correctly checked or unchecked</li>\n<li>Fix: Resolved the pagination reload problem when all data on a page is deleted</li>\n<li>Fix: Ensured that the title is now a required field</li>\n</ul>\n<h4>1.3.1 &#8211; 29 Feb 2024</h4>\n<ul>\n<li>Improvement: Enhanced Gutenberg block for a seamlessly improved user experience </li>\n</ul>\n<h4>1.3.0 &#8211; 26 Feb 2024</h4>\n<ul>\n<li>New: Shortable columns for convenient data sorting</li>\n<li>New: Advanced search functionality for quick and precise data retrieval</li>\n<li>New: Effortlessly delete multiple meetings simultaneously</li>\n<li>New: Intuitive pagination for improved navigation and user experience</li>\n</ul>\n<h4>1.2.0 &#8211; 24 Feb 2024</h4>\n<ul>\n<li>New: Gutenberg support for Jitsi Meet has been seamlessly integrated</li>\n<li>New: Meeting customization is now enhanced with added settings for height and width</li>\n<li>New: A convenient settings link has been introduced beside the plugin deactivate button</li>\n<li>New: Explore the new &#8220;Get in Touch&#8221; submenu, featuring relevant content</li>\n<li>Improvement: The functionality of the setting save button has been refined for a smoother user experience</li>\n</ul>\n<h4>1.1.0 &#8211; 20 Feb 2024</h4>\n<ul>\n<li>New: Shortcode support added for Jitsi Meet &amp; Zoom </li>\n</ul>\n<h4>1.0.2 &#8211; 17 Feb 2024</h4>\n<ul>\n<li>New: Added notice for missing Oauth Credentials setup</li>\n<li>New: Introduced Write agenda for your meeting  setting</li>\n<li>Improvement: Auto-generate password when the password field is empty</li>\n<li>Fix: Settings page not displayed correctly after authentication response</li>\n</ul>\n<h4>1.0.1 &#8211; 16 Feb 2024</h4>\n<ul>\n<li>New: Zoom meeting integration</li>\n</ul>\n<h4>1.0.0 &#8211; 14 Feb 2024</h4>\n<ul>\n<li>Initial release 😀</li>\n</ul>\n"
    },
    "short_description": "The best #1 Meeting plugin to create instant webinars and meetings with Zoom Meeting, Jitsi Meet, Webex, &amp; Google Meet.",
    "description": "<p>🔥 Get MeetingHub <strong><a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Lifetime Deal at 84% OFF!</a></strong> This offer won&#8217;t come again, <strong>we promise!</strong></p>\n<h4>Integrate Zoom Meeting, Jitsi Meet, Webex, &amp; Google Meet with the All-in-one Video Conference Plugin (MeetingHub) with Branded Meetings.</h4>\n<p><strong>👉 Join our <a href=\"https://www.facebook.com/groups/sovlixcommunity\" rel=\"nofollow ugc\">Facebook Community</a></strong></p>\n<p><strong>👉 Get updates from our</strong></p>\n<ul>\n<li><a href=\"https://www.linkedin.com/company/sovlix\" rel=\"nofollow ugc\">LinkedIn</a></li>\n<li><a href=\"https://x.com/SovlixOfficial\" rel=\"nofollow ugc\">Twitter</a></li>\n<li><a href=\"https://www.youtube.com/@Sovlix/\" rel=\"nofollow ugc\">YouTube</a> </li>\n<li><a href=\"https://www.facebook.com/sovlix\" rel=\"nofollow ugc\">Facebook Page</a></li>\n</ul>\n<p><strong>🎁 <a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Grab 84% Life Time Deal</a> NOW!</strong></p>\n<p>Elevate your online meeting experience with MeetingHub – the ultimate all-in-one meeting solution for WordPress. MeetingHub is the best and easiest WordPress webinar plugin designed to create instant meetings with popular platforms such as Zoom Meeting, Jitsi Meet, Webex, Google Meet, and more.</p>\n<h3>Why Choose MeetingHub?</h3>\n<ul>\n<li><strong>Seamless Integration:</strong> Connect effortlessly with Zoom Meeting, Jitsi Meet, Webex, Google Meet, and other leading video conferencing platforms within your WordPress environment.</li>\n<li><strong>Easy Setup:</strong> Setting up and managing meetings is a breeze with our user-friendly interface, ensuring a hassle-free experience for both administrators and participants.</li>\n<li><strong>Comprehensive Support:</strong> Whether you&#8217;re hosting webinars or conferences, MeetingHub caters to all your meeting needs, providing a versatile solution for various scenarios.</li>\n<li>\n<p><strong>Developer-Friendly:</strong> Explore the comprehensive source code for MeetingHub, empowering developers to understand the inner workings of the Jitsi Meet integration. The readable React source code is conveniently located in the <code>assets/src/</code> directory.</p>\n</li>\n<li>\n<p><strong>Host can be enable or disable meeting</strong> As a host, you have full authority to enable or disable meetings with MeetingHub. This feature offers flexibility and control over the availability of your scheduled meetings, allowing you to activate or deactivate sessions as needed. Utilize this powerful control to manage meeting accessibility, enhance security, and maintain organizational protocols effectively. Ensure your meetings are only available when you want them to be, providing a secure and well-managed virtual meeting environment.</p>\n</li>\n<li>\n<p><strong>Multi-Language Translation Support:</strong> MeetingHub offers full internationalization, allowing you to translate the entire plugin interface into your preferred language. This feature enhances accessibility and usability for a global audience, making it easier for users worldwide to integrate seamlessly with Zoom Meeting, Jitsi Meet, Webex, Google Meet, and other video conferencing platforms.</p>\n</li>\n</ul>\n<h4>🎁 <a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Get Pro</a></h4>\n<h3>Integrations 👇</h3>\n<h3>🎯 Zoom Meeting Integration</h3>\n<p>MeetingHub offers a comprehensive Zoom meeting integration, empowering you to manage all your virtual meetings and webinars right from your WordPress site. Whether you&#8217;re hosting a small group or a large-scale event, MeetingHub makes it easy to handle every aspect of your Zoom meeting experience.</p>\n<ul>\n<li>\n<p><strong>Effortlessly Manage Zoom Users and Access Reports</strong> &#8211; Take full control of your Zoom meeting users and access detailed reports directly from your WordPress dashboard. You&#8217;ll be able to track participation, monitor attendance, and analyze Zoom meeting statistics to boost your administrative efficiency.</p>\n</li>\n<li>\n<p><strong>Recurring Meetings and Webinars</strong> &#8211; Set up and manage recurring Zoom meeting and webinars without the usual hassle. By automating these processes, you ensure consistency and smooth scheduling for your audience.</p>\n</li>\n<li>\n<p><strong>Utilize Personal Meeting IDs</strong> &#8211; Use your unique Personal Meeting IDs to organize and manage your Zoom meeting. This feature ensures that your professional branding remains intact and participants can easily recognize your sessions.</p>\n</li>\n<li>\n<p><strong>View Registrants from the Frontend</strong> &#8211; Let visitors see who else will be attending your Zoom meetings and webinars by displaying a list of registrants right on your website. This transparency fosters community and increases engagement for future Zoom meeting events.</p>\n</li>\n<li>\n<p><strong>Show User Recordings Based on Zoom Account</strong> &#8211; Customize your post-meeting content by displaying recordings tied to specific Zoom accounts. This helps you provide a personalized follow-up experience for attendees of your Zoom meeting.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance by adding a countdown timer to your upcoming Zoom meetings and webinars. This keeps users excited and aware of when the next Zoom meeting will begin.</p>\n</li>\n<li>\n<p><strong>Duplicate Meetings and Webinars</strong> &#8211; Save time by duplicating existing Zoom meetings or webinars with a simple click. This is perfect for recurring or similar events, allowing you to quickly replicate successful Zoom meeting.</p>\n</li>\n<li>\n<p><strong>List and Access Recordings</strong> &#8211; Easily access and list all your Zoom meeting and webinar recordings directly within WordPress. This ensures that your content is well-organized and easily available for on-demand viewing.</p>\n</li>\n<li>\n<p><strong>Show Events in Calendar</strong> &#8211; Provide a convenient calendar view of your Zoom meeting schedule. Displaying all upcoming Zoom meeting in one place gives your audience a clear picture of your event lineup.</p>\n</li>\n<li>\n<p><strong>Add to Calendar Links</strong> &#8211; Simplify the scheduling process for your participants by offering &#8220;Add to Calendar&#8221; links for each Zoom meeting. This helps attendees easily keep track of all your virtual events.</p>\n</li>\n<li>\n<p><strong>Gutenberg Support</strong> &#8211; Integrate Zoom meeting seamlessly into your WordPress site using Gutenberg blocks. Whether it&#8217;s embedding a live session or adding a meeting link to your content, Gutenberg makes managing Zoom meeting effortless.</p>\n</li>\n<li>\n<p><strong>Zoom Meeting Shortcode</strong> &#8211; MeetingHub’s shortcode functionality allows you to embed any Zoom meeting directly into your WordPress site. This flexibility is key to a smooth user experience, whether you&#8217;re using it for live video chats, business meetings, or webinars.</p>\n</li>\n<li>\n<p><strong>Effortless Elementor Integration</strong> &#8211; If you&#8217;re using Elementor to build your website, MeetingHub has you covered. You can easily create and manage Zoom meeting within Elementor, providing a smooth and consistent experience for your visitors.</p>\n</li>\n</ul>\n<h3>Enhance Your Virtual Meeting Experience</h3>\n<p>MeetingHub’s powerful Zoom meeting integration brings everything you need to host seamless, professional virtual meetings and webinars. By integrating Zoom directly into your WordPress website, you can manage everything from one platform, making your Zoom meeting workflow more efficient. With our extensive set of features, you’ll enhance both your administrative capabilities and user engagement.</p>\n<p>Whether you’re managing recurring Zoom meetings, accessing detailed reports, or creating a countdown timer to keep participants engaged, MeetingHub elevates your Zoom meeting experience, offering unmatched ease and flexibility.</p>\n<h4>🎁 <a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Get Pro</a></h4>\n<h3>🎯 Jitsi Meet Integration</h3>\n<p>Enjoy real-time collaboration with Jitsi Meet. MeetingHub seamlessly integrates with Jitsi Meet to provide users with a reliable and feature-rich video conferencing experience.</p>\n<ul>\n<li>\n<p><strong>Unlimited Duration Meetings</strong> &#8211; Embrace the liberty of hosting webinars without time constraints with Jitsi Meet for WordPress. Powered by our Jitsi community instance, each meeting enjoys extended availability, offering two hours of seamless interaction that automatically renews post-session. Immerse yourself in a full spectrum of cutting-edge video conferencing features, making our plugin the epitome of versatility for crafting WordPress webinars.</p>\n</li>\n<li>\n<p><strong>Customized Meeting Titles</strong> &#8211; Add a personal touch to your webinars by assigning distinctive names, facilitating easy recognition, and elevating the overall branding of your virtual events.</p>\n</li>\n<li>\n<p><strong>Dynamic Screen Sharing</strong> &#8211; Enhance communication in your virtual meetings with Jitsi Meet&#8217;s unmatched screen-sharing capabilities. This plugin distinguishes itself as the most intelligent choice among WordPress meeting plugins.</p>\n</li>\n<li>\n<p><strong>Limitless Meetings</strong> &#8211; Unshackle yourself from constraints and host an unlimited number of live webinars and video conferences seamlessly through the Jitsi Meet plugin on your WordPress website. Revel in unparalleled freedom and flexibility in your virtual event hosting endeavors.</p>\n</li>\n<li>\n<p><strong>Meeting Shortcode</strong> &#8211; Unleash enhanced functionality with Jitsi Meet&#8217;s shortcode feature, seamlessly creating and embedding video meetings on your website. Utilize the shortcode for diverse purposes, adding a layer of convenience to your WordPress website experience. Elevate your virtual gatherings with Jitsi Meet, where freedom, flexibility, and a seamless user experience converge.</p>\n</li>\n<li>\n<p><strong>Gutenberg Support</strong> &#8211; Embrace modern content creation with Gutenberg support for Jitsi Meet. Effortlessly integrate meetings into your posts and pages using the block editor, enhancing the overall user experience.</p>\n</li>\n<li>\n<p><strong>Meeting Height &amp; Width Customization</strong> &#8211; Enjoy added flexibility in meeting display by adjusting height and width settings. Tailor the visual aspects of your virtual gatherings to suit your specific needs, providing a personalized and engaging experience.</p>\n</li>\n<li>\n<p><strong>Meeting Muting Flexibility</strong> &#8211; Take control of your video conferences and webinars by muting them at your convenience through Jitsi Meet. Stay in charge and ensure smooth communication throughout.</p>\n</li>\n<li>\n<p><strong>Interactive Screen Sharing</strong> &#8211; Foster better communication among hosts and participants by seamlessly sharing screens during virtual meetings. Enhance collaboration and productivity with this intuitive feature.</p>\n</li>\n<li>\n<p><strong>Effortless Elementor Integration</strong> &#8211; Create meetings within Elementor effortlessly using simple shortcodes. Enjoy seamless live video chats without technical complexities, streamlining your workflow and enhancing user experience effortlessly.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance with a countdown timer for your upcoming Zoom events. Display a live timer on your website, reminding users of the approaching event start time.</p>\n</li>\n<li>\n<p><strong>Custom Domain Hosting</strong> &#8211; Personalize your video conferencing experience by creating a unique, branded URL for your meetings. Enhance your professional identity and make your website stand out with a custom domain for your Jitsi Meet sessions.</p>\n</li>\n<li>\n<p><strong>8&#215;8 JaaS Integration</strong> &#8211; Seamlessly integrate Jitsi with 8&#215;8&#8217;s JaaS (Jitsi as a Service) for a robust and scalable video conferencing solution. Enjoy enhanced features and reliability, ensuring your virtual meetings run smoothly and efficiently.</p>\n</li>\n</ul>\n<h4>🎁 <a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Get Pro</a></h4>\n<h3>🎯 Webex Integration</h3>\n<p>Enhance your WordPress site with seamless Webex integration, perfect for educational institutions, consulting firms, remote businesses, yoga instructors, and more. Our MeetingHub (Video Conferencing with Webex) plugin is designed to streamline your workflow by allowing you to schedule, manage, and display Webex meetings directly on your WordPress site.</p>\n<h3>Why Use Webex Integration with MeetingHub?</h3>\n<ul>\n<li>\n<p><strong>Perfect for Remote Work:</strong> Ideal for businesses adapting to remote workflows and online learning environments.</p>\n</li>\n<li>\n<p><strong>User-Friendly Interface:</strong> Schedule Webex meetings easily and display them on your site with a single click.</p>\n</li>\n<li>\n<p><strong>Increase Engagement:</strong> Allow users to join Webex meetings directly from your site, enhancing interaction and engagement.</p>\n</li>\n<li>\n<p><strong>Countdown Timer</strong> &#8211; Build anticipation and increase attendance with a countdown timer for your upcoming events. Display a live timer on your website, reminding users of the approaching event start time.</p>\n</li>\n<li>\n<p><strong>Gutenberg Support</strong> &#8211; Embrace modern content creation with Gutenberg support for Webex. Effortlessly integrate Webex meetings into your posts and pages using the block editor, enhancing the overall user experience.</p>\n</li>\n<li>\n<p><strong>Meeting Shortcode</strong> &#8211; Unlock enhanced functionality with Webex&#8217;s shortcode feature, seamlessly creating and embedding video meetings on your website. Utilize the shortcode for diverse purposes, adding a layer of convenience to your WordPress website experience. Elevate your virtual gatherings with Webex, where freedom, flexibility, and a seamless user experience converge.</p>\n</li>\n<li>\n<p><strong>Effortless Elementor Integration</strong> &#8211; Create Webex meetings within Elementor effortlessly using simple shortcodes. Enjoy seamless live video chats without technical complexities, streamlining your workflow and enhancing user experience effortlessly.</p>\n</li>\n</ul>\n<p><strong>🎁 <a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Grab 84% Life Time Deal</a> for limited time!</strong> This offer won&#8217;t come again, <strong>we promise!</strong></p>\n<h3>⚡ New</h3>\n<p><strong>Effortless LMS Integration</strong><br />\nTake your online education experience to the next level with our seamless LMS integration. Whether you’re using LearnDash, LifterLMS, or Tutor LMS, LearnPress our plugin connects effortlessly with platforms like Zoom, Jitsi, Webex, and Google Meet to power your virtual classrooms.</p>\n<ul>\n<li>Instant setup for virtual classes directly from your LMS dashboard</li>\n<li>Compatible with top LMS platforms: LearnDash, LifterLMS, Tutor LMS, and more</li>\n<li>Automate class scheduling and send reminders to students via email</li>\n<li>Perfect for e-learning, corporate training, and online coaching</li>\n<li>Create meetings in both the admin dashboard and instructor dashboard</li>\n<li>Each user&#8217;s meetings are private, and only they can access their own meetings</li>\n<li>Insert lessons and courses using shortcodes</li>\n<li>Easily embed meetings into your lessons with a dedicated button on the editor to insert meeting shortcodes automatically</li>\n</ul>\n<p>With this integration, scheduling and running live online classes or webinars is just a click away, making life easier for educators and trainers who want to deliver engaging lessons without the tech hassle.</p>\n<p><strong>Google Calendar Integration for Smarter Scheduling</strong><br />\nNever miss a meeting or class again with our Google Calendar integration. Automatically sync all your video calls, appointments, and LMS sessions with your calendar so you stay on top of your schedule.</p>\n<ul>\n<li>Automatically sync bookings, classes, and appointments with Google Calendar</li>\n<li>Real-time updates to avoid double bookings or scheduling conflicts</li>\n<li>Get notifications for all your events, synced across your devices</li>\n<li>Integrates with Outlook, iCal, and other popular calendar apps (upcoming)</li>\n</ul>\n<p>Whether you’re scheduling a one-on-one consultation or an entire week of classes, our Google Calendar integration ensures everything runs smoothly. Focus more on your meetings and less on your schedule with this convenient, time-saving feature.</p>\n<h4>🎁 <a href=\"https://sovlix.com/meetinghub-pricing/\" rel=\"nofollow ugc\">Get Pro</a></h4>\n<h3>😍 Upcoming Features &amp; Integrations</h3>\n<p><strong>Seamless Appointment Scheduling</strong><br />\nWe’re excited to introduce an appointment scheduling feature that allows users to seamlessly book meetings through platforms like Zoom, Jitsi, Webex, and Google Meet. With automated scheduling and calendar integrations, managing your time has never been easier.</p>\n<ul>\n<li>Automate appointment bookings with real-time availability</li>\n<li>Integrate with major video conferencing platforms</li>\n<li>Customizable appointment reminders for clients and hosts</li>\n<li>Sync appointments with Google Calendar, Outlook, and more</li>\n</ul>\n<p><strong>Advanced Booking System</strong><br />\nOur plugin will soon support a complete booking system to streamline meeting bookings, consultations, and events. Whether you’re managing online sessions, training, or webinars, this feature will handle all your booking needs.</p>\n<ul>\n<li>Manage individual or group bookings for meetings or events</li>\n<li>Custom time slots and session lengths</li>\n<li>Instant confirmation and booking notifications</li>\n<li>Integrated payment gateways for paid appointments (PayPal, Stripe, etc.)</li>\n</ul>\n<p><strong>Complete Integration for Appointments and Booking</strong><br />\nOur goal is to provide you with a comprehensive solution for handling both meeting scheduling and appointment management. With support for multiple video conferencing platforms, you’ll be able to book and manage all your virtual appointments in one place.</p>\n<ul>\n<li>One-click appointment scheduling with Zoom, Jitsi, Webex, and Google Meet</li>\n<li>Recurring appointments with automated reminders</li>\n<li>User-friendly booking calendar for clients to select preferred times</li>\n<li>Track and manage all upcoming appointments and meetings from a single dashboard</li>\n</ul>\n<h3>🎥 Video Tutorials</h3>\n<p>👉 <strong>Setting Up Zoom with Server-to-Server OAuth in MeetingHub</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ApSm4QJXLGc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Watch this tutorial to learn how to set up Zoom with Server-to-Server OAuth in MeetingHub. This video provides step-by-step instructions to configure OAuth credentials for seamless integration.</p>\n<p>👉 <strong>Setting Up Zoom with Meeting SDK App in MeetingHub</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Q0Zt80PjvTE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>This tutorial demonstrates how to set up Zoom with Meeting SDK App in MeetingHub. Follow along with the video to configure your Meeting SDK App credentials for enhanced functionality within Meeting Hub.</p>\n<p>👉 <strong>How to Set Up Webex OAuth in MeetingHub</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/vV3EwUNJusk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>👉 <strong>How to Set Up 8&#215;8 JaaS in MeetingHub</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/YqQ7Kcap5vo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>In this comprehensive tutorial, we&#8217;ll guide you through the entire process of setting up Webex OAuth in MeetingHub. Whether you&#8217;re a developer or an administrator, this video will help you integrate Webex authentication seamlessly and securely into your MeetingHub environment. Follow our detailed steps to ensure a smooth setup and enhance your meeting management experience.</p>\n<p>Best and super easy WordPress webinar plugin to create instant meetings with Zoom, Jitsi Meet, Webex, and more. Meeting with Zoom, Jitsi Meet, Webex, and More | All-in-one Webinar and Video Conference for WordPress &#8211; Meeting Hub</p>\n<p>Webinar and Video Conference with Jitsi Meet – Create Branded Webinars for WordPress, Meetings &amp; Livestreaming. EMBED MEETINGS, HOST WEBINARS, AND VIDEO CONFERENCE – EVERYTHING FROM THE WORDPRESS DASHBOARD</p>\n<p>Best Alternative of Video Conferencing with Zoom, eRoom – Zoom Meetings &amp; Webinars,  &hellip;</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/meetinghub.1.15.6.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-1.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-2.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-3.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-4.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-5.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-6.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-7.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-8.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-9.png?rev=3091973",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-10.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-11.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-12.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-13.png?rev=3091909",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/meetinghub/assets/screenshot-14.png?rev=3091909",
            "caption": ""
        }
    ],
    "tags": {
        "conference": "Conference",
        "google-meet": "google meet",
        "video-conference": "video conference",
        "webinars": "webinars",
        "zoom-meeting": "zoom meeting"
    },
    "stable_tag": "1.15.6",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/meetinghub.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/meetinghub.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/meetinghub.1.0.2.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/meetinghub.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/meetinghub.1.1.1.zip",
        "1.10.0": "https://downloads.wordpress.org/plugin/meetinghub.1.10.0.zip",
        "1.11.0": "https://downloads.wordpress.org/plugin/meetinghub.1.11.0.zip",
        "1.11.1": "https://downloads.wordpress.org/plugin/meetinghub.1.11.1.zip",
        "1.12.0": "https://downloads.wordpress.org/plugin/meetinghub.1.12.0.zip",
        "1.13.0": "https://downloads.wordpress.org/plugin/meetinghub.1.13.0.zip",
        "1.13.1": "https://downloads.wordpress.org/plugin/meetinghub.1.13.1.zip",
        "1.13.2": "https://downloads.wordpress.org/plugin/meetinghub.1.13.2.zip",
        "1.13.3": "https://downloads.wordpress.org/plugin/meetinghub.1.13.3.zip",
        "1.13.4": "https://downloads.wordpress.org/plugin/meetinghub.1.13.4.zip",
        "1.13.5": "https://downloads.wordpress.org/plugin/meetinghub.1.13.5.zip",
        "1.13.6": "https://downloads.wordpress.org/plugin/meetinghub.1.13.6.zip",
        "1.13.7": "https://downloads.wordpress.org/plugin/meetinghub.1.13.7.zip",
        "1.14.0": "https://downloads.wordpress.org/plugin/meetinghub.1.14.0.zip",
        "1.15.0": "https://downloads.wordpress.org/plugin/meetinghub.1.15.0.zip",
        "1.15.1": "https://downloads.wordpress.org/plugin/meetinghub.1.15.1.zip",
        "1.15.2": "https://downloads.wordpress.org/plugin/meetinghub.1.15.2.zip",
        "1.15.3": "https://downloads.wordpress.org/plugin/meetinghub.1.15.3.zip",
        "1.15.4": "https://downloads.wordpress.org/plugin/meetinghub.1.15.4.zip",
        "1.15.5": "https://downloads.wordpress.org/plugin/meetinghub.1.15.5.zip",
        "1.15.6": "https://downloads.wordpress.org/plugin/meetinghub.1.15.6.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/meetinghub.1.2.0.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/meetinghub.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/meetinghub.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/meetinghub.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/meetinghub.1.3.3.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/meetinghub.1.4.0.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/meetinghub.1.5.0.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/meetinghub.1.6.0.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/meetinghub.1.7.0.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/meetinghub.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/meetinghub.1.7.2.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/meetinghub.1.8.0.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/meetinghub.1.9.0.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/meetinghub.1.9.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/meetinghub.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/meetinghub/assets/banner-772x250.png?rev=3039185",
        "high": "https://ps.w.org/meetinghub/assets/banner-1544x500.png?rev=3039185"
    },
    "icons": {
        "1x": "https://ps.w.org/meetinghub/assets/icon-128x128.png?rev=3039185",
        "2x": "https://ps.w.org/meetinghub/assets/icon-256x256.png?rev=3039185"
    },
    "blocks": {
        "meetinghub/jitsi-meet": {
            "name": "meetinghub/jitsi-meet",
            "title": "Jitsi Meet (MeetingHub)"
        },
        "meetinghub/zoom": {
            "name": "meetinghub/zoom",
            "title": "Zoom Direct Meeting or Webinar (MeetingHub)"
        },
        "meetinghub/webex": {
            "name": "meetinghub/webex",
            "title": "Webex (MeetingHub)"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}