{
    "name": "MetForm &#8211; Contact Form, Survey, Quiz, &amp; Custom Form Builder for Elementor",
    "slug": "metform",
    "version": "3.9.0",
    "author": "<a href=\"https://wpmet.com\">Wpmet</a>",
    "author_profile": "https://profiles.wordpress.org/xpeedstudio/",
    "contributors": {
        "xpeedstudio": {
            "profile": "https://profiles.wordpress.org/xpeedstudio/",
            "avatar": "https://secure.gravatar.com/avatar/9311be5ce267cdff860656bb2375e135?s=96&d=monsterid&r=g",
            "display_name": "XpeedStudio"
        },
        "ataurr": {
            "profile": "https://profiles.wordpress.org/ataurr/",
            "avatar": "https://secure.gravatar.com/avatar/c1f037a92baa3f68f165767da18711e4?s=96&d=monsterid&r=g",
            "display_name": "Ataur R"
        },
        "emranio": {
            "profile": "https://profiles.wordpress.org/emranio/",
            "avatar": "https://secure.gravatar.com/avatar/07f48aaf90c97745b95bf78980eefefc?s=96&d=monsterid&r=g",
            "display_name": "Emran"
        }
    },
    "requires": "5.0",
    "tested": "6.6.1",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 94,
    "ratings": {
        "5": 360,
        "4": 21,
        "3": 7,
        "2": 5,
        "1": 23
    },
    "num_ratings": 416,
    "support_url": "https://wordpress.org/support/plugin/metform/",
    "support_threads": 4,
    "support_threads_resolved": 3,
    "active_installs": 400000,
    "downloaded": 4108875,
    "last_updated": "2024-08-21 11:57am GMT",
    "added": "2019-08-29",
    "homepage": "http://products.wpmet.com/metform/",
    "sections": {
        "description": "<p>MetForm, the drag-and-drop WordPress contact form builder is an addon for <a href=\"https://elementor.com/\" rel=\"nofollow ugc\">Elementor</a>. This Elementor form builder plugin provides an intuitive real-time form-building experience, allowing anyone of any expertise level to create professionally designed website forms.</p>\n<p>It enables the fastest and most secure experience for managing and customizing multiple contact forms &#8211; without any code.</p>\n<h3>The Best Elementor Form Builder Plugin for WordPress Website &#8211; Empowering 3,00,000+ Active Users.</h3>\n<p>Metform reinforces Elementor and assists you in making volunteer applications, event forms, loan applications, restaurant reservations, admission forms, newsletter signups, data erasure requests, product order forms, WooCoomerce checkout, subscribe forms, patient forms, suggestion forms, survey forms, post survey forms, and so many.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/8R4-Q14cu-w?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Flexibility</h3>\n<p>MetForm is built with Elementor. Every field is an Elementor widget that can be rearranged by dragging and dropping. If you want to use an image or video under a form and want to show users, you can do so. This free contact form builder ships with a wide range of field input styles to create your brand-matched forms.</p>\n<p>Here, the exceptional thing is that you can create groups of your personalized fields and add them in any form with just one click. MetForm lite version is sufficient to create any type of form. For example, creating referral forms to get referral feedback, collecting testimonials through WordPress testimonial forms, and making client feedback forms to collect feedback scores on your products or services.</p>\n<p>Moreover, you will find lots of demos of multi-step, conditional, feedback, event, job application, booking, custom social signup, product registration, etc. forms in this WordPress beginner-friendly WordPress contact form builder.</p>\n<h3>USEFUL LINKS</h3>\n<blockquote>\n<p><strong><a href=\"https://products.wpmet.com/metform/\" rel=\"nofollow ugc\">Landing Page + Form Demo</a></strong> |  <strong><a href=\"http://wpmet.com/support-help/\" rel=\"nofollow ugc\">Need Support?</a></strong> | <strong><a href=\"https://wpmet.com/knowledgebase/metform/\" rel=\"nofollow ugc\">Documentation</a></strong> | <strong><a href=\"https://www.youtube.com/watch?v=zg1QIouKO_Q&amp;list=PL3t2OjZ6gY8NoB_48DwWKUDRtBEuBOxSc&amp;ab_channel=Wpmet\" rel=\"nofollow ugc\">Video Tutorials</a></strong> |  <a href=\"https://products.wpmet.com/metform/pricing/\" rel=\"nofollow ugc\"> <strong>Buy Pro</strong> </a> | <strong><a href=\"https://wpmet.com/plugin/metform/roadmaps#ideas\" rel=\"nofollow ugc\">Request a Feature</a></strong></p>\n</blockquote>\n<h3>Mobile-Friendly and Responsive</h3>\n<p>Metform builds with Elementor and it will work with Elementor without any issue. and responsive can be controlled from the Elementor page builder. and Your smart order or any online form will look great on all resolutions and devices: mobile, tablet, and desktop.</p>\n<h3>Embed Anywhere</h3>\n<p>You can use Metform anywhere with Elementor to create an Elementor contact form. Also, you can use it with any editor with a built-in form shortcode. Utilizing the shortcode support for customization is easy.</p>\n<h3>Manage Submissions</h3>\n<p>Your online form submission data can be saved in admin. So, it will send data to the form admin and also send a Confirmation Email to form users.</p>\n<h3>File Upload</h3>\n<p>Want your users to upload files from your online form? no worries we have a file upload option with our Elementor form builder MetForm.</p>\n<h3>Export Form Entries as CSV</h3>\n<p>Want to Export form entries as CSV? Yes, you can do that too with the Metform Elementor form builder addon.</p>\n<h3>Free HubSpot Integration</h3>\n<p>Now Free HubSpot integration is also available in MetForm. It ensures flawless customer relationship management. With MetForm HubSpot integration, you can store all the data properly in the HubSpot account and get access to any data in the shortest possible time.</p>\n<h3>Mailchimp Integration</h3>\n<p>You can use MailChimp in your contact form so that, you can collect and send leads from WordPress to MailChimp. Also, create MailChimp signup or lead generation forms and boxes with a custom style and expand your lead list.</p>\n<h3>**✨**Top Features</h3>\n<ul>\n<li><strong>Built with Elementor:</strong> MetForm is based on Elementor. This means this contact form builder offers an Elementor-like intuitive drag-and-drop workflow and real-time preview of your customizations. And, this budget-friendly email building tool with impressive form-building functionality powered by Elementor Builder has no learning curve. </li>\n</ul>\n<p>So, beginners can easily create a query form to collect reporting and other forms like a contact form or booking form. Learn how to create a WordPress Booking form with MetForm 👇</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/K7YJmNn9nIY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent&#038;listType=playlist&#038;list=PL3t2OjZ6gY8NoB_48DwWKUDRtBEuBOxSc\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<ul>\n<li><strong>Elementor Input Fields:</strong> From lead generation to survey forms, or any complex style forms, we have designed <strong>40+ Elementor widgets</strong> fields to build in your preferred style.</li>\n</ul>\n<blockquote>\n<p><strong></strong><strong>MetForm Fields</strong></p>\n<p>Text field, Email field, Number field, Date field Time field, Select field, Textarea field, Checkbox field, Radio field, Switcher field, Range slider field, URL field, Password field, Response Message, Opt-in, reCAPTCHA, Rating, File Upload, and many more.</p>\n</blockquote>\n<ul>\n<li>\n<p><strong>User Confirmation Email:</strong> Show a nice gesture to the form submitters by sending a confirmation email after they register or enter their data or at the end of your campaign.</p>\n</li>\n<li>\n<p><strong>Admin Notification Email:</strong> Notify admin of successful order notifications after users or customers complete a form submission.</p>\n</li>\n<li>\n<p><strong>Saved Entries in the Admin Panel:</strong> Save all the data that users give to fill up the form and display it in the admin panel.</p>\n</li>\n<li>\n<p><strong>Export Entries as CSV:</strong> Export multiple data from your MetForm that the user enters in a single CSV file and downloads in a spreadsheet.</p>\n</li>\n<li>\n<p><strong>Export to Google Sheets:</strong> The popular Elementor form creator MetForm allows you to export all your users’ personal contacts, databases, and messages on Google Sheets.</p>\n</li>\n<li>\n<p><strong>Required Login to Submit the Form:</strong> Make sure a secured and spam-free contact form by showing the required fields. Notify with a simple red star or an error message when those fields are empty.</p>\n</li>\n<li>\n<p><strong>Capture User Browser Data:</strong> Displays the user’s browser information like Web browser, Visited URL, Title, Visit Time, Visit Count, User Profile, etc.</p>\n</li>\n<li>\n<p><strong>Hide Form After Submission:</strong> Hide your public Elementor form after the user fills all the necessary fields and hits the submit button.</p>\n</li>\n<li>\n<p><strong>Limit Total Entries:</strong> Enable limit to the number of submission entries to your Elementor form. This Elementor contact form builder feature will also give an error message after getting crossed.</p>\n</li>\n<li>\n<p><strong>Redirect After Successful Form Submission:</strong> Simply add the desired destination URL and redirect to that page after successfully submitting the form. It is possible with Elementor form maker MetForm.</p>\n</li>\n<li>\n<p><strong>Validate required fields:</strong> The multi-step Elementor contact form builder helps you to validate your form’s required field and gives an error message if needed to make your form standard and way more professional.</p>\n</li>\n<li>\n<p><strong>Form submission via AJAX without page refreshes:</strong> Our Elementor contact form maker permits you to submit your contact us simple form without loading your page via AJAX to make it more user-friendly and time-saving. Therefore, online visitors can fill up the form using AJAX without page loading.</p>\n</li>\n<li>\n<p><strong>Supports multiple-column layout:</strong> Specify multiple-column layouts as many as you would like to display. Simply add the column in just one click with the multi-step form builder.</p>\n</li>\n<li>\n<p><strong>Shortcode support:</strong> Add powerful features with a simple Shortcode without any knowledge of technical, complicated, and lengthy code. Now, it&#8217;s easy to get Shortcode support for customization options.</p>\n</li>\n<li>\n<p><strong>Editable successful form submission message:</strong> MetForm Elementor forms builder gives access to edit your successful form submission message so you can personalize your own message.</p>\n</li>\n<li>\n<p><strong>Translation ready:</strong> Our WordPress contact form builder plugin supports multiple languages which means you can easily translate a language into your language.</p>\n</li>\n<li>\n<p><strong>Top-notch user support:</strong> MetForm is enriched with docs, FAQs, tutorials, and blogs. You will find answers to your problems in these resources.  And, the support team is one call away from you.</p>\n</li>\n</ul>\n<h3>Our Premium Input fields</h3>\n<ul>\n<li>\n<p><strong>Phone no Input Field:</strong> Let users select prefix country code from the dropdown.</p>\n</li>\n<li>\n<p><strong>Image Select Input Field:</strong> Upload images both vertically or horizontally to allow submitters to select one.</p>\n</li>\n<li>\n<p><strong>Toggle Select  Input Field:</strong> With our most powerful Toggle Select, you can activate one section from multiple sections at a time both vertically or horizontally. If you select one section as active, then another section will automatically get deactivated.</p>\n</li>\n<li>\n<p><strong>Simple Repeater Input Field:</strong> Create a group of fields to use in the future within one click.</p>\n</li>\n<li>\n<p><strong>Google Map Location  Input Field:</strong> Let users pinpoint their location in forms.</p>\n</li>\n<li>\n<p><strong>Color Picker Input Field:</strong> Design your form by choosing a color from the color picker.</p>\n</li>\n<li>\n<p><strong>Calculation Fields List:</strong> Display automatically calculated values after users perform calculations among Form Fields.</p>\n</li>\n<li>\n<p><strong>Payment Method  Input Field:</strong> Select a payment method like Paypal or Stripe and make a user payment policy.</p>\n</li>\n<li>\n<p><strong>Signature Input Field:</strong> Get users’ realistic signatures on your form.</p>\n</li>\n<li>\n<p><strong>Like-Dislike  Input Field:</strong> Allow users to react using like and dislike fields</p>\n</li>\n</ul>\n<h3>Our Premium Features</h3>\n<ul>\n<li>\n<p><strong>Multi-Step Form:</strong> Divide your large form into multiple sections to make it more user-friendly for customers to increase the completion rate.</p>\n</li>\n<li>\n<p><strong>Conditional logic:</strong> Allows users to select one category and the given question will appear only for that section otherwise it will remain invisible. Here comes our most unique field “Conditional Logic”.<br />\n<a href=\"https://www.youtube.com/watch?v=UDQOCwO7lhI\" rel=\"nofollow ugc\"> <strong>Conditional logic</strong> </a> &#8211; <a href=\"https://products.wpmet.com/metform/pro-demos/conditional-form-1/\" rel=\"nofollow ugc\"> <strong>Conditional logic demo 1</strong> </a> &#8211;  <a href=\"https://products.wpmet.com/metform/pro-demos/conditional-form-2/\" rel=\"nofollow ugc\"> <strong>Conditional logic demo 2</strong> </a> &#8211; <a href=\"https://products.wpmet.com/metform/pro-demos/conditional-form-3/\" rel=\"nofollow ugc\"> <strong>Conditional logic demo 3</strong> </a> &#8211;  <a href=\"https://products.wpmet.com/metform/pro-demos/conditional-form-4/\" rel=\"nofollow ugc\"> <strong>Conditional logic demo 4</strong> </a></p>\n</li>\n<li>\n<p><strong>Calculation:</strong> Help you to perform your calculations and display the results within seconds in your form.</p>\n</li>\n</ul>\n<p><a href=\"https://www.youtube.com/watch?v=20nsox2cZYc\" rel=\"nofollow ugc\"> <strong>Calculation video</strong> </a> &#8211; <a href=\"https://products.wpmet.com/metform/pro-demos/calculation-form-1/\" rel=\"nofollow ugc\"> <strong>Calculation demo 1</strong> </a> &#8211;  <a href=\"https://products.wpmet.com/metform/pro-demos/calculation-form-2/\" rel=\"nofollow ugc\"> <strong>Calculation demo 2</strong> </a></p>\n<ul>\n<li>\n<p><strong>REST API Support:</strong> Get form submission data and submission notification to Third Party API URL or Webhook by integrating our Rest API very easily.</p>\n</li>\n<li>\n<p><strong>WooCommerce checkout:</strong> Shows you the add to cart product and checkout form on a single page, Also, MetForm enables you to complete orders and payments without leaving the page.</p>\n</li>\n<li>\n<p><strong>Auto Populate Field:</strong> Show additional fields after someone fills up the form.</p>\n</li>\n<li>\n<p><strong>Zapier Integration:</strong> Zapier integration in your forms allows you to connect with thousands of popular apps without any coding.</p>\n</li>\n<li>\n<p><strong>Payment Method:</strong> Choose a payment gateway like Paypal or Stripe to make the payment system super easy for beginners.</p>\n</li>\n<li>\n<p><strong>Webhook</strong>: <a href=\"https://www.youtube.com/watch?v=2NpbK_dybWg\" rel=\"nofollow ugc\"> <strong>Webhook video</strong> </a></p>\n</li>\n</ul>\n<p><strong>Migrations are coming soon in these forms. Contact Form 7, Caldera Forms, Ninja Forms, Gravity Forms, fluent forms, wp forms, Forminator &amp; Formidable Form Builder, Everest Forms</strong></p>\n<h3>**✨** MetForm Integrations</h3>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/integration/\" rel=\"nofollow ugc\">MailChimp Integration</a>: Easily integrates MailChimp to create and manage a mailing list, automated mailing, newsletter, send leads, and many other options.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/zoho/\" rel=\"nofollow ugc\">WordPress ZoHo CRM Integration</a>: Manage customers’ relationships and speed up marketing and sales with the ZoHo integration of our Elementor form builder MetForm.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/hubspot-integration/\" rel=\"nofollow ugc\">HubSpot Integration</a>: Store all the contacts inside your HubSpot account without having fear of losing them. As a result, you can easily manage your visitors’ or clients’ information.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/integrate-fluentcrm-with-metform/\" rel=\"nofollow ugc\">FluentCRM Integration</a>: View all the embedding web form submission data inside FluentCRM and manage them for successful email marketing and growth hacking.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/helpscout-integration/\" rel=\"nofollow ugc\">HelpScout Integration</a>: Build a successful bond and manage the relationship with the customers better than ever with the HelpScout form. This contact form&#8217;s dynamic CRM integration lets you sort all contacts without any ticket or case number to save you time.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/twilio-sms-integration/\" rel=\"nofollow ugc\">Twilio Integration</a>: Connect with your clients, customers, or visitors via calls or messages with Twilio integration.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/convertkit-integration/\" rel=\"nofollow ugc\">ConvertKit Integration</a>: Successfully manage all the newsletters by integrating with ConvertKit which is built on the simplest interface.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/activecampaign/\" rel=\"nofollow ugc\">ActiveCampaign Integration</a>: Make a super easy contact list management with ActiveCampaign integration.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/aweber-integration/\" rel=\"nofollow ugc\">Aweber Integration</a>: Simply integrate with Aweber, the email marketing service provider, and build Aweber forms that let you keep in touch with your subscribers.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/getresponse-integration/\" rel=\"nofollow ugc\">GetResponse Integration</a>: It is another newsletter integration like others to keep your email marketing list sorted.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/mailpoet-integration/\" rel=\"nofollow ugc\">MailPoet Integration</a>: Connect your WordPress site with MailPoet to build your simple and easy contact us form with the easiest drag-and-drop feature.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/zapier-integration/\" rel=\"nofollow ugc\">Zapier Integration</a>: Automate workflows by connecting the apps and the services you use.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/slack-integration/\" rel=\"nofollow ugc\">Slack Integration</a>: You can redirect all the Elementor form data to integrate with Slack and get the customer information faster.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/google-sheet-integration/\" rel=\"nofollow ugc\">Google reCAPTCHA</a> Integration: Metform Elementor form builder allows you to integrate Google reCAPTCHA to keep your site safe from unwanted spam and abusive traffic.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/recaptcha-integration/\" rel=\"nofollow ugc\">reCAPTCHA Integration</a>: Keep your website safe from spam and abuses using Google reCAPTCHA.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/map-integration-with-metform/\" rel=\"nofollow ugc\">Map Integration</a>: Add Google map API key with MetForm- contact form builder to know your customer locations.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/suretriggers-integration/\" rel=\"nofollow ugc\">SureTriggers Integration</a>: Bring different websites, applications, software, and WordPress plugins under a single platform.</p>\n<p>Learn <a href=\"https://www.youtube.com/watch?v=Ft1E1_FNtws&amp;list=PL3t2OjZ6gY8NoB_48DwWKUDRtBEuBOxSc&amp;index=13\" rel=\"nofollow ugc\">How to Install and Activate MetForm</a></p>\n<h3>» DOCUMENTATION AND SUPPORT</h3>\n<ul>\n<li>📞 <a href=\"https://wpmet.com/support-ticket-form/\" rel=\"nofollow ugc\">Contact Our Support</a></li>\n<li>🙋🏼‍♂️ <a href=\"https://www.facebook.com/groups/wpmet/\" rel=\"nofollow ugc\">Join Our Facebook Community</a></li>\n<li>📑 <a href=\"https://wpmet.com/doc/metform/\" rel=\"nofollow ugc\">Check Documentation</a></li>\n<li>🔜 <a href=\"https://wpmet.com/plugin/metform/roadmaps/\" rel=\"nofollow ugc\">Check Roadmap</a></li>\n</ul>\n<p>👉 Rate us on <a href=\"https://wordpress.org/support/plugin/metform/reviews/#new-post\" rel=\"ugc\">WordPress</a></p>\n<h3>💥 OUR OTHER PLUGINS</h3>\n<p>If you like using the MetForm form builder, then consider checking out our other products:</p>\n<p>⭕ <a href=\"https://wpmet.com/plugin/elementskit/\" rel=\"nofollow ugc\">ElementsKit</a>  The most popular all-in-one addons for Elementor.</p>\n<p>⭕ <a href=\"https://wpmet.com/plugin/shopengine/\" rel=\"nofollow ugc\">ShopEngine</a>   It is an absolute WooCommerce Solution. You will have a great experience with this WooCommerce Builder for Elementor and Gutenberg.</p>\n<p>⭕ <a href=\"https://wordpress.org/plugins/getgenie\" rel=\"ugc\">GetGenie Ai</a>  GetGenie AI is an AI-powered Content &amp; SEO Assistant. You can access it as a WordPress plugin and a SaaS model. The tool also offers a chatbot called <a href=\"https://getgenie.ai/geniechat/\" rel=\"nofollow ugc\">GenieChat</a>.</p>\n<p>⭕ <a href=\"https://wpmet.com/plugin/wp-social/\" rel=\"nofollow ugc\">Wp Social</a>  Power your WordPress site by using WP Social. It will assist you in adding a Social Login, Social Counter, and Social Login to your website.</p>\n<p>⭕ <a href=\"https://products.wpmet.com/crowdfunding/\" rel=\"nofollow ugc\">Wp FundEngine</a>  Now, creating a crowdfunding and donation site with WordPress is easier. WP FundEngine provides you with all the functionalities to ease the processes.</p>\n<p>⭕ <a href=\"https://products.wpmet.com/review/\" rel=\"nofollow ugc\">Wp Ultimate Review</a>  Check out the quick plugin, and manage and style customer reviews according to your preferences.</p>\n<p>Visit  <a href=\"https://wpmet.com/\" rel=\"nofollow ugc\">wpmet</a>  to learn more about how to get the best out of WordPress using our plugins.<br />\nCheck out <a href=\"https://wpmet.com/blog\" rel=\"nofollow ugc\">Tutorials, Tips &amp; Tricks</a>! 👌</p>\n",
        "installation": "<ol>\n<li>Upload the plugin files to the `/wp-content/plugins/plugin-name directory, or install the form builder plugin through the WordPress plugins screen directly.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; screen in WordPress</li>\n<li>All Settings will be found in Admin sidebar -&gt; MetForm</li>\n</ol>\n<p>e.g.  This plugin requires an Elementor builder.</p>\n",
        "faq": "\n<dt id='what%20type%20of%20wordpress%20form%20you%20can%20make%20with%20metform%20form%20builder%3F'>\nWhat type of WordPress form you can make with MetForm form builder?\n</h4>\n<p>\n<p>MetForm allows you to make WordPress forms with a new experience. With the most flexible drag and drop feature, the form builder supports your Elementor site to become a powerful site. Some form types the Elementor forms builder offers are &#8211;<br />\n-Contact Form<br />\n-Multi Step Form<br />\n-Calculation Form<br />\n-Feedback Form<br />\n-Conditional Form<br />\n-Volunteer Application<br />\n-Booking Form<br />\n-Event Form<br />\n-Loan Application<br />\n-Job Application<br />\n-Restaurant Reservation<br />\n-Admission Form<br />\n-Newsletter Signup<br />\n-Data Erasure Request<br />\n-Product Order Form<br />\n-WooCommerce Checkout<br />\n-Subscribe Form<br />\n-Patient Form<br />\n-Suggestion Form<br />\n-Offline Contact Form<br />\nThere are more form types you can build with MetForm. Check it <a href=\"https://wpmet.com/plugin/metform/\" rel=\"nofollow ugc\">here</a>.</p>\n</p>\n<dt id='does%20metform%20offer%20newsletter%20integration%3F'>\nDoes MetForm offer Newsletter Integration?\n</h4>\n<p>\n<p>Yes. Metform has various Newsletter integrations, such as Mailchimp, AWeber, ActiveCampaign, Get Response, etc.</p>\n</p>\n<dt id='does%20metform%20include%20spam%20protection%3F'>\nDoes MetForm include spam protection?\n</h4>\n<p>\n<p>Of course!. This drag and drop builder ensures spam protection. Some of the form templates come with the latest reCAPTCHA v2 and v3 protection, and MetForm also offers a powerful reCAPTCHA widget. <a href=\"https://prnt.sc/e5j4WxDNuhmh\" rel=\"nofollow ugc\">Preview</a></p>\n</p>\n<dt id='does%20metform%20integrate%20with%20other%20wordpress%20plugins%20and%20services%3F'>\nDoes MetForm integrate with other WordPress plugins and services?\n</h4>\n<p>\n<p>MetForm doesn&#8217;t give you trouble working while there are multiple other WordPress plugins installed. Without struggling, you can smoothly run other services on your site and work with this amazing contact form builder.</p>\n</p>\n<dt id='where%20can%20you%20find%20the%20documentation%3F'>\nWhere can you find the documentation?\n</h4>\n<p>\n<p>Check our <a href=\"https://help.wpmet.com/docs-cat/metform/\" rel=\"nofollow ugc\">Documentation section here</a>  to understand the alpha and omega of MetForm.</p>\n<p>But you can see this video https://www.youtube.com/watch?v=rvawKRgLC14</p>\n</p>\n\n",
        "changelog": "<p>Version: 3.9.0 // 2024-08-21<br />\nRemoved: Edit with EmailKit button from WooCommerce email settings</p>\n<p>Version: 3.8.9 // 2024-06-09<br />\nImproved: Notify to admin on form submission feature.<br />\nImproved: File uploading security.<br />\nFixed: Form required field auto scrolling issue.<br />\nFixed: .stl file type uploading not working.<br />\nFixed: Calculation widget is not working if toggle select widget has same value.<br />\nFixed: Translation issue.</p>\n<p>Version: 3.8.8 // 2024-05-13<br />\nImproved: Dashboard user experience.<br />\nImproved: Security.</p>\n<p>Version: 3.8.7 // 2024-04-30<br />\nFixed: Google font loading issue.<br />\nFixed: Compatibility issue with Gravity Form and Jetpack Boost plugins.<br />\nFixed: Form disappearing if using summary widget.</p>\n<p>Version: 3.8.6 // 2024-03-31<br />\nImproved: Security.<br />\nImproved: Admin panel settings UI.<br />\nFixed: Redirect URL with ID issue.</p>\n<p>Version: 3.8.5 // 2024-03-11<br />\nFixed: Conditionally hidden fields entries issue.<br />\nFixed: IOS device multistep form scroll bar issue.<br />\nFixed: Notice Id limit vulnerability.</p>\n<p>Version: 3.8.4 // 2024-02-27<br />\nImproved: Rest API integration feature (added referral url with request payload).<br />\nFixed: The CSV export functionality for form entries is not working when dealing with a large volume of entries.<br />\nFixed: Display input field name alongside value issue.<br />\nFixed: Shortcode vulnerability issue.<br />\nFixed: Admin notice dismissing issue.<br />\nFixed: Mobile widget &#8216;+&#8217; sign issue.</p>\n<p>Version: 3.8.3 // 2024-01-14<br />\nImproved: User interface (UI).<br />\nFixed: Range Slider widget 0 range value is not working if minimum value is negative.<br />\nFixed: GDPR Consent widget &#8216;&amp;&#8217; character issue.</p>\n<p>Version: 3.8.2 // 2023-12-18<br />\nImproved: Security.</p>\n<p>Version: 3.8.1 // 2023-12-11<br />\nAdded: New control for minimum fraction count of Calculation widget.<br />\nFixed: 24 hours time format issue for Date widget.<br />\nFixed: Google re-captcha issue for multiple forms in same page.<br />\nFixed: HubSpot integration issue with GDPR Consent and Opt in (Listing) widgets.</p>\n<p>Version: 3.8.0 // 2023-11-05<br />\nImproved: File size limit control for file upload widget.<br />\nFixed: Meta box issue in form entries.<br />\nFixed: Image selecting issue of image widget.</p>\n<p>Version: 3.7.0 // 2023-10-18<br />\nAdded: Enable/Disable option for promotional message.<br />\nAdded: Thumbnails for quiz forms.<br />\nAdded: By range control for number widget.<br />\nFixed: metform_before_store_form_data hooks issue.<br />\nFixed: Translation issue for form validation message.<br />\nFixed: Character and number range validation issue.</p>\n<p>Version: 3.6.0 // 2023-10-01<br />\nFixed: Switch widget control issue.<br />\nFixed: Elementor deprecation issue.<br />\nImproved: Dashboard UI.</p>\n<p>Version: 3.5.1 // 2023-09-19<br />\nImproved: User experience.</p>\n<p>Version: 3.5.0 // 2023-09-17<br />\nAdded: Checkbox to disable promotional notice.<br />\nImproved: We have strengthened the form builder plugin&#8217;s security by adding more escaping, and sanitization.<br />\nFixed: The live URL link was broken on the settings page.</p>\n<p>Version: 3.4.1 // 2023-09-04<br />\nFixed: Admin notice permission and prevent API requests for drafted or trashed forms.</p>\n<p>Version: 3.4.0 // 2023-08-16<br />\nAdded: New settings to show input field option label in entries for select, checkbox, etc. fields.<br />\nAdded: Compatibility with Elementor 3.15 release.<br />\nImrpoved: Optimized rating widget.<br />\nImproved: Show fixed field names for Listing First Name and Listing First Name. <a href=\"https://prnt.sc/dKYz94jje0IH\" rel=\"nofollow ugc\">Preview</a><br />\nFixed: Elementor widget help button URL.<br />\nFixed: Elementor loading issue.</p>\n<p>Version: 3.3.4 // 2023-07-05<br />\nAdded: MetForm widgets help link to the official docs.<br />\nAdded: Custom JS event after successfully form submission.<br />\nFixed: Checkbox issue in simple repeater field.</p>\n<p>Version: 3.3.3 // 2023-06-11<br />\nAdded: Entry by meta data in the entry submission to make the Elementor form template fore flexible.<br />\nAdded: New controls for range input widget.<br />\nAdded: New control to change radio widget style.<br />\nFixed: Permalink structure update user permission.<br />\nFixed: Session conflict in the site health.<br />\nFixed: Summary widget style issue.<br />\nFixed: Float number is not working on number widget.<br />\nFixed: Page reloads even when there is no redirect URL after form submission.<br />\nFixed: Conditional logic for date field.<br />\nFixed: Local storage data not saving for simple repeater field.<br />\nFixed: Mobile widget issue.<br />\nImproved: Submit button icon control issue.<br />\nImproved: Added compatibility for updated Elementor with create form popup.<br />\nImproved: MetForm form builder is now fully compatible with Cleano theme.<br />\nImproved: Login form layout issue fixed.</p>\n<p>Version 3.3.2 // 2023-05-08<br />\nAdded: Submission ID with the thank you direction URL to.<br />\nImproved: Security, nonce and authorization checking.</p>\n<p>Version 3.3.1 // 2023-05-03<br />\nFixed: Form editor popup conflict with Elementor version update.<br />\nImproved: Security, nonce and authorization checking of the Elementor form.</p>\n<p>Version 3.3.0 // 2023-04-10<br />\nAdded: Compatibility with Google Place autocomplete plugin with MetForm.<br />\nFixed: Multi step form issue for any type of changes in Elementor.<br />\nFixed: Recaptcha V3 form submit issue.<br />\nFixed: File upload fatal error.<br />\nFixed: Zapier integration email field issue.<br />\nFixed: HubSpot list fetching and token saving issue.<br />\nFixed: Filtering entries in dashboard.<br />\nFixed: Simple repeater data in email.<br />\nImproved: Simple repeater field name with static name.</p>\n<p>Version 3.2.4 // 2023-03-12<br />\nFixed: Something went wrong message when upload file field is empty.</p>\n<p>Version 3.2.3 // 2023-03-06<br />\nFixed: Select field was not working in Safari browser.<br />\nFixed: Conditional calculation issues.<br />\nFixed: Conditional display for form fields.<br />\nFixed: Summary widget password issue.<br />\nFixed: Range input default value issue.<br />\nFixed: CSV URL was not working.<br />\nFixed: Escaping issue in signature field.<br />\nFixed: Form submission for not logged in users condition.<br />\nFixed: The resetting issue of input fields of multiple forms of a page.</p>\n<p>Version 3.2.2 // 2023-02-21<br />\nAdded: New notice if permalink saved as plain to change permalink to post name.<br />\nImproved: Entry ID auto increment by one and will be serialized.<br />\nImproved: Security in google reCAPTCHA and simple reCAPTCHA field.<br />\nImproved: Demo templates of the Elementor form.<br />\nImproved: GDPR consent message from on to accepted.<br />\nFixed: Simple repeater issue.<br />\nFixed: Redirection after submission was not working.<br />\nFixed: All fields went blank when reCAPTCHA was entered wrongly.<br />\nFixed: The compatibility issue with ElementsKit sticky option.<br />\nFixed: Security permission issue for REST API endpoint.<br />\nFixed: Field validation message color for some fields.<br />\nFixed: Layout compatibility issue in IOS devices.<br />\nFixed: HubSpot integration form fields mapping settings.<br />\nFixed: Big commented entries breaking the design.</p>\n<p>Version 3.2.1 // 2023-01-10<br />\nFixed: Compatibility with Elementor 3.10.0.</p>\n<p>Version 3.2.0 // 2023-01-08<br />\nImproved: Security and sanitization of our Elementor form.</p>\n<p>Version 3.1.2 // 2022-12-20<br />\nRemoved: Sweet alert success message.</p>\n<p>Version 3.1.1 // 2022-12-6<br />\nFixed: Multi step form doesn&#8217;t work properly issue.</p>\n<p>Version 3.1.0 // 2022-11-17<br />\nTweaked: CSS and JS.<br />\nCompatibility: To develop MetForm form builder, we have made it compatible with latest WordPress version 6.1</p>\n<p>Version 3.0.1 // 2022-10-27<br />\nFixed: Fixed php method not found.</p>\n<p>Version 3.0.0 // 2022-10-26<br />\nAdded: A new popup form creator in the admin dashboard for creating forms. <a href=\"https://prnt.sc/Xbtb01pet0Y1\" rel=\"nofollow ugc\">Preview</a><br />\nAdded: New form type select field was added to create different types of forms.<br />\nAdded: Filtering form template using form type select field added.<br />\nTweaked: Save &amp; close button design on the page.<br />\nTweaked: HubSpot error massage.<br />\nFixed: Multiselect default value doesn&#8217;t work properly for calculation.<br />\nFixed: Multiselect default value doesn&#8217;t remove after form submission.<br />\nFixed: Save &amp; close button issue on the page.<br />\nFixed: Compatibility issue with Elementor flexbox container.</p>\n<p>Version 2.2.1 // 2022-08-03<br />\nAdded: Meaningful error message for SMTP setup.<br />\nAdded: New control for select field.<br />\nAdded: HubSpot integration.<br />\nFixed: Entries file not showing.<br />\nFixed: Conditional field parent section height issue.<br />\nFixed: Select option’s double quotation issue.<br />\nFixed: Widget Label tab conditional logic.<br />\nTweaked: Email field validation.<br />\nTweaked: Switch widget space issue.<br />\nImproved: Search engine form indexing issue.</p>\n<p>Version 2.2.0 // 2022-06-21<br />\nAdded: Stp and stl file support inside file-upload widget.<br />\nAdded: Default alert method enabled for form submit response.<br />\nAdded: Input field name validation.<br />\nFixed: File upload bites issue.<br />\nFixed: Multiple file upload issue.<br />\nFixed: Payment method default value issue.<br />\nFixed: Error message not shown after form submit.<br />\nFixed: Type error problem.<br />\nFixed: Summary widget error when upload a file.<br />\nFixed: Repeater field value delete issue.<br />\nFixed: Editor-mode console warning for page.<br />\nFixed: Require massage issue for select widget.<br />\nFixed: Hubspot minor issues.<br />\nTweaked: Update hook and entries.<br />\nTweaked: Improved file data validation.<br />\nTweaked: Improved Auto-populate field.</p>\n<p>Version 2.1.6 // 2022-04-21<br />\nAdded: Set value from UTM.<br />\nAdded: Multiple file uploading support.<br />\nAdded: Select field option import from CSV local/remote.<br />\nAdded: Option for hiding form sending to user after form submission.<br />\nFixed: Calculation filed reuse issues.<br />\nFixed: Multistep form wrapper issue with Elementor latest version.</p>\n<p>Version 2.1.5 // 2022-04-20<br />\nFixed: Form view count was not working.</p>\n<p>Version 2.1.4 // 2022-04-20<br />\nFixed: Security issue.<br />\nTweaked: CSS and JS improved</p>\n<p>Version 2.1.3 // 2022-03-28<br />\nAdded: Success message from sweet alert.<br />\nFixed: Calculation widget issue to calculate from default value on load ( specially range slider).<br />\nFixed: Sorting issue in csv.<br />\nFixed: Background color issue in multi-select widget.<br />\nFixed: Time Field issue on IOS device.<br />\nTweaked: Change link of integration.<br />\nTweaked: CSS and JS improved</p>\n<p>Version 2.1.2 // 2022-01-30<br />\nFixed: Image carousel compatibility issue with MetForm<br />\nTweaked: CSS and JS improved.</p>\n<p>Version 2.1.1 // 2022-01-22<br />\nAdded: Some minor issues.<br />\nTweaked: CSS and JS improved.</p>\n<p>Version 2.1.0 // 2022-01-06<br />\nAdded: A new button added to ask for rating library<br />\nImproved: Added icon for rating<br />\nFixed: Some spelling issue<br />\nFixed: Checkbox Option is getting marked by default<br />\nFixed: Checkbox not saved issue<br />\nTweaked: CSS and JS improved</p>\n<p>Version 2.0.1 // 2021-12-12<br />\nAdded: File upload widget uppercase extension support<br />\nFixed: Multiple checkbox default select issue<br />\nFixed: Form hidden field issue<br />\nTweaked: CSS and JS improved</p>\n<p>Version 2.0.0 // 2021-11-28<br />\nTweaked: Heavily improved core CSS and JS<br />\nFixed: Text widget diacritic character issue<br />\nFixed: Range Slider widget issue with Conditional logic feature<br />\nFixed: Range Slider error on empty steps field</p>\n<p>Version 1.6.0 // 2021-11-10<br />\nAdded: Onboarding Integration<br />\nTweaked: CSS and JS improved<br />\nRemoved: Unnecessary image files</p>\n<p>Version 1.5.6 // 2021-11-07<br />\nFixed: Elementor Default Text Editor Preview and Frontend Encoding Problem.<br />\nTweaked: CSS and JS improved<br />\nCompatibility: To refine the form builder we have checked/fixed some compatibility issues</p>\n<p>Version 1.5.5 // 2021-09-29<br />\nAdded: Multi Select input placeholder control<br />\nAdded: New control to set current date as minimum date for date widget<br />\nFixed: Time widget placeholder does not work in mobile browsers<br />\nFixed: reCaptcha support for Elementor Popups.<br />\nFixed: Minor Markup Validation for Form Rendering.<br />\nFixed: MetForm Entry Filtering with Form Name</p>\n<p>Version 1.5.4<br />\nFixed: Date widget localization issue<br />\nFixed: Compatibility issue with Woodmart-6.1.4<br />\nFixed: Number widget input alignment issue<br />\nRemoved: Deprecated Elementor PHP Methods from Widgets.</p>\n<p>Version 1.5.3<br />\nFixed: Shortcode was not working.</p>\n<p>Version 1.5.2<br />\nRemoved: Summary widget’s react library warning<br />\nFixed : Performance issue<br />\nTweaked: Optimize CSS and JS files</p>\n<p>Version 1.5.1<br />\nFixed: Multistep form minor issue</p>\n<p>Version 1.5.0<br />\nImproved: Responsive message default time 5 seconds<br />\nFixed: Custom script tag issue<br />\nFixed: Form and Response message opening &amp; closing animation<br />\nFixed: Widget style controls conflicts with conditional feature on editor mode.<br />\nFixed: Conditionally hidden field doesn&#8217;t show in Elementor editor<br />\nFixed: Simple Captcha and reCaptcha values are removed from Summary Widget.<br />\nFixed: multistep scroll and spacing issue</p>\n<p>Version 1.4.10<br />\nFixed: File Upload widget file Size Limit and File Type validation</p>\n<p>Version 1.4.9<br />\nFixed: Form Settings Vertical Scrolling option not showing proper value</p>\n<p>Version 1.4.8<br />\nFixed: Ranged Slider console log error<br />\nFixed: Form Settings Style Fix<br />\nFixed: File Upload Widget size limit validation<br />\nFixed: File Upload Widget file type validation<br />\nFixed: Elementor <code>_register_controls</code> is soft deprecated<br />\nFixed: Form picker button alignment style<br />\nRemoved: Unnecessary duplicate stylesheet removed<br />\nFixed: Form Picker &#8220;No forms created yet&#8221; duplicate message<br />\nNew: File Uploads Info support for API/Webhook.</p>\n<p>Version 1.4.7<br />\nFixed: Fixed Scheme Namespace debug log issue<br />\nFixed: Rest API integration form broken<br />\nFixed: Required check for character length validation.</p>\n<p>Version 1.4.6<br />\nFixed: Date widget JS minification</p>\n<p>Version 1.4.5<br />\nadded: Added pre-defined control for checkbox widget<br />\nadded: Added pre-defined control for radio widget<br />\nFixed: Display position left for checkbox widget<br />\nFixed: Display position left for radio widget<br />\nFixed: Opt-in widget style controls<br />\nFixed: GDPR widget style controls<br />\nFixed: File-upload widget input padding, position left control</p>\n<p>Version 1.4.4<br />\nFixed: Showing response message on the screen after form submission<br />\nFixed: MailChimp multiple audience saving issue<br />\nTweak: Changed Form widget settings on Elementor</p>\n<p>Version 1.4.3<br />\nNew: Hook &#8216;metform/after_form_load&#8217; added to triggers after form load.<br />\nFixed: Backward &amp; Free Version support for success message style<br />\nFixed: Calculate widget</p>\n<p>Version 1.4.2<br />\nFixed: Backend entry fields color conflict<br />\nFixed: Multi file upload empty field error<br />\nTweak: Backend entries File section beautify<br />\nFixed: Backend File section download button now direct downloads instead of new tab open<br />\nFixed: Multiple form ReCAPTCHA validation issue<br />\nFixed: Help text multiline error<br />\nFixed: Multiselect &amp; Checkbox NaN value issue<br />\nFixed: Form submit &#8211; Hide Form not working issue (null value)</p>\n<p>Version 1.4.1<br />\nFixed: Few minor bug fix<br />\nImported: Few UI improvements</p>\n<p>Version 1.4.0<br />\nFix: Select Widget conditional required when hidden issue<br />\nFixed: Repeater bug fix<br />\nFixed: Creating form bug<br />\nImproved: Core libraries update<br />\nFixed: Minor other bug fix.</p>\n<p>Version 1.3.17<br />\nFixed: &#8216;Something went wrong&#8217; problem fixed</p>\n<p>Version 1.3.16<br />\nAdded: Form submission error handling</p>\n<p>Version 1.3.15<br />\nFixed: Google Map Error<br />\nFixed: Text Input field removing leading 0<br />\nFixed: Plugin activation Error<br />\nFixed: Tabbing issue fix &amp; jquery-ui-core added<br />\nFixed: Jargon removal<br />\nFixed: Google ReCaptcha &amp; Select widget validation<br />\nImprove: Update notice and rating system</p>\n<p>Version 1.3.14<br />\nImprove: Updated core libraries upgrade the form builder</p>\n<p>Version 1.3.13<br />\nFixed: Updated Facebook Community links</p>\n<p>Version 1.3.12<br />\nFixed: Default Value for Email input issue<br />\nFixed: Checkbox option left side label cursor fix<br />\nFixed: Rating widget star blinking issue<br />\nFixed: Select widget Option disabling issue<br />\nFixed: Summary widget shows Image (base64) values with  element<br />\nAdded: Summary title gets label if available. getInputLabel() API.<br />\nFixed: Checkbox option text Typography issue<br />\nAdded: Input Warning Text color &amp; Typography in common-controls, Checkbox, GDPR Consent, Radio, Recaptcha, Simple Captcha<br />\nRemoved: Word Length Validation on Telephone Widget &amp; Email Widget<br />\nFixed: Text area line break properly shows on E-Mail &amp; Entry<br />\nFixed: Metform New form Selector button position sticky<br />\nFixed: &#8220;Hubspot&#8221; spelling in multiple places<br />\nTweak: Overall code improvements<br />\nFixed: File upload issue<br />\nFixed: Calculation field with woocommerce cart add conflict issue<br />\nTweak: Multiple file add backend entry formattings<br />\nNew: Styling Controls for Like Dislike Widget.<br />\nFixed: Active value not working in Like Dislike Widget<br />\nFixed: Line break support for Text area Widget in Form Entry View.</p>\n<p>Version 1.2.11<br />\nFixed: Minor bug fix</p>\n<p>Version 1.3.10<br />\nFixed: Minor bug fix</p>\n<p>Version 1.3.9<br />\nFixed: Rating notification bug fix</p>\n<p>Version 1.3.8<br />\nFixed: Multiselect and checkbox multiple condition issues<br />\nTweak: Added a control for enabling  scroll to top feature for multistep form<br />\nImprove: added some CSS improvement on mobile widget to improve the form builder</p>\n<p>Version 1.3.7<br />\nFixed: Typography issue of input label of the gdpr consent field</p>\n<p>Version 1.3.6<br />\nFixed: Banner issues</p>\n<p>Version 1.3.5<br />\nFixed: Rating notice issues<br />\nAdded: CSS optimization.</p>\n<p>Version 1.3.4<br />\nFixed: Stripe issue<br />\nAdded: Custom JS event for the developer<br />\nTweak: Improved rating system.</p>\n<p>Version 1.3.3<br />\nFixed: WordPress&#8217;s latest version API issues fixed<br />\nFixed: The &#8216;file upload&#8217; widget disappears issues fixed<br />\nFixed: &#8216;rating&#8217; widget star rating issues fixed<br />\nFixed: &#8216;range&#8217; widget default value issues fixed<br />\nFixed: The &#8216;simple-repeater&#8217; widget is now working perfectly on multistep<br />\nFixed: subtraction issues fixed on the &#8216;calculation&#8217; widget<br />\nFixed: Multistep RTL issues fixed<br />\nTweak: Improved js file size</p>\n<p>Version 1.3.2<br />\nFix: ISS server plugin.php error</p>\n<p>Version 1.3.2<br />\nFixed: Number validation fixed in the back-end<br />\nFixed: reCAPTCHA error message fixed after form submitting<br />\nFixed: 24hrs fixed on time widget<br />\nFixed: Shortcode Null Coalescing Operator error fixed for old php support</p>\n<p>Version 1.3.1<br />\nNew: Added 24H control on Date widget<br />\nNew: Added scroll to top when changing the step on multistep<br />\nFixed: Prev and next step issues fixed<br />\nImproved: CSS and JS</p>\n<p>Version 1.3.0<br />\nNew: Localization Option for Date Field<br />\nNew: Added calculation numberFormat() function<br />\nFixed: HTML Entities for File Upload<br />\nFixed: active campaign error fixed<br />\nFixed: improved calculation<br />\nFixed: Multistep pressing enter to change the step fix<br />\nFixed: stripe payment issue fixed</p>\n<p>Version 1.3.0-beta6<br />\nFixed: mobile datepicker issues fixed<br />\nFixed: next and prev issues fixed on multistep<br />\nFixed: multistep tab title issue fixed</p>\n<p>Version 1.3.0-beta5<br />\nAdded: Spinner animation for Submit Button when submitting<br />\nAdded: Disable state for Submit Button to prevent multiple form submission<br />\nFixed: Admin settings page fixed<br />\nFixed: Submit Button causes JS error after empty form summited<br />\nFixed: Integration Settings causes JS error after update</p>\n<p>Version 1.3.0-beta4<br />\nNew: Responsive Width control for the Submit Button<br />\nFixed: form settings issues<br />\nFixed: HTML entities support for Input Label, Placeholder, and Help Text</p>\n<p>Version 1.3.0-beta3<br />\nNew: Option(&#8216;Stop Vertical Scrolling&#8217;) added for enabling or disabling vertical scrolling when form submit<br />\nNew: Form submitting failed notification added<br />\nTweak: Improved demo previews<br />\nFixed: Improved design on form settings<br />\nFixed: Multistep broken issues<br />\nFixed: Form inline style issues<br />\nFixed: &#8216;Select&#8217; widget placeholder added<br />\nFixed: Fixed &#8216;date&#8217; and &#8216;time&#8217; disappearing issues on multistep<br />\nFixed: Form redirection issue has been fixed<br />\nFixed: &#8216;Hide Form After Submission&#8217; issue has been fixed</p>\n<p>Version 1.3.0-beta2<br />\nAdded: New pot file for translation<br />\nRemoved: &#8216;Response message&#8217; widget has been removed<br />\nNew: Added Response message at the top of the form by default</p>\n<p>Version 1.3.0-beta1<br />\nNew: All form widgets are supported by React JS<br />\nHuge optimization<br />\n&#8220;&#8221;MetForm 1.3.0-beta1 is a major update. We have reconstructed the widgets with react and huge optimization for future proof. If you faced any issue with our form builder, please contact our support team from here https://wpmet.com/support-ticket&#8221;&#8221;</p>\n<p>Version v1.2.3<br />\nNew: .pot file added<br />\nNew: forms can be now exported &amp; imported using Elementor&#8217;s json files.<br />\nFixed: Block multiple form submission<br />\nTweak: JS improvement<br />\nTweak: CSS Improvement</p>\n<p>Version v1.2.2<br />\nNew: Setting dashboard design<br />\nNew: Added new default template preview<br />\nTweak: added admin pro notice<br />\nFixed: Date and time widget issues fixed on iPhone<br />\nFixed: iframe error fixed<br />\nFixed: Fontawesome icon missing issues<br />\nTweak: JS improvement<br />\nTweak: CSS Improvement</p>\n<p>Version 1.2.1<br />\nNew: GDPR consent input field<br />\nTweak: Email template included uploaded file<br />\nTweak: Email template design improvement<br />\nTweak: Validation options fixed<br />\nFixed: Date store issue</p>\n<p>Version 1.2.0<br />\nAdded: Global settings page<br />\nFixed: Simple captcha<br />\nAdded: Google reCAPTCHA v3. <a href=\"https://prnt.sc/zrutv836qt5X\" rel=\"nofollow ugc\">Preview</a><br />\nAdded: simple captcha and Google reCAPTCHA in different widget<br />\nFixed: Shortcode form submission issue<br />\nhtml support in the checkbox and opt-in text<br />\nAdded: Form summary widget</p>\n<p>Version 1.1.9<br />\nAdded: Simple CAPTCHA<br />\nAdded: Conversion and views in entries tabs<br />\nFixed: reCAPTCHA version 2 issue<br />\nImproved: Validation<br />\nRe-arranged controls</p>\n<p>Version 1.1.8<br />\nFixed: Updated input default color<br />\nFixed: CSS bug fixed<br />\nFixed: JS bug fixed<br />\nFixed: Added default value of some widget controls<br />\nFixed: Organized the widget controls<br />\nFixed: Improved table UI</p>\n<p>Version: 1.1.5<br />\n3rd party plugin compatibility<br />\nRest API Data submit improvement</p>\n<p>Version: 1.1.4<br />\nAdded: Now users can add 3rd party API to get form data<br />\nAdded: Now date input supports time selection too<br />\nImproved: Can disable specific date, range date in date picker.<br />\nImproved: Im Mail template design improvement<br />\nAdded: utf8 support in email template<br />\nAdded: Now user can redesign the upload button<br />\nAdded: Select widget support default select from option<br />\nAdded: Some do_action hooks to extend it’s functionality</p>\n<p>Version: 1.1.3<br />\nAdded: Option to change checkbox and radio color<br />\nAdded: help text with style condition</p>\n<p>Version: 1.1.2<br />\nFixed: reCAPTCHA  issue</p>\n<p>1.1<br />\nAdded: telephone widget<br />\nAdded: widget area to edit and save use from the same page.</p>\n"
    },
    "short_description": "Metform is the ultimate Elementor forms builder. With this quick contact form builder, you can build any kind of fast and secure contact form.",
    "description": "<p>MetForm, the drag-and-drop WordPress contact form builder is an addon for <a href=\"https://elementor.com/\" rel=\"nofollow ugc\">Elementor</a>. This Elementor form builder plugin provides an intuitive real-time form-building experience, allowing anyone of any expertise level to create professionally designed website forms.</p>\n<p>It enables the fastest and most secure experience for managing and customizing multiple contact forms &#8211; without any code.</p>\n<h3>The Best Elementor Form Builder Plugin for WordPress Website &#8211; Empowering 3,00,000+ Active Users.</h3>\n<p>Metform reinforces Elementor and assists you in making volunteer applications, event forms, loan applications, restaurant reservations, admission forms, newsletter signups, data erasure requests, product order forms, WooCoomerce checkout, subscribe forms, patient forms, suggestion forms, survey forms, post survey forms, and so many.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/8R4-Q14cu-w?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Flexibility</h3>\n<p>MetForm is built with Elementor. Every field is an Elementor widget that can be rearranged by dragging and dropping. If you want to use an image or video under a form and want to show users, you can do so. This free contact form builder ships with a wide range of field input styles to create your brand-matched forms.</p>\n<p>Here, the exceptional thing is that you can create groups of your personalized fields and add them in any form with just one click. MetForm lite version is sufficient to create any type of form. For example, creating referral forms to get referral feedback, collecting testimonials through WordPress testimonial forms, and making client feedback forms to collect feedback scores on your products or services.</p>\n<p>Moreover, you will find lots of demos of multi-step, conditional, feedback, event, job application, booking, custom social signup, product registration, etc. forms in this WordPress beginner-friendly WordPress contact form builder.</p>\n<h3>USEFUL LINKS</h3>\n<blockquote>\n<p><strong><a href=\"https://products.wpmet.com/metform/\" rel=\"nofollow ugc\">Landing Page + Form Demo</a></strong> |  <strong><a href=\"http://wpmet.com/support-help/\" rel=\"nofollow ugc\">Need Support?</a></strong> | <strong><a href=\"https://wpmet.com/knowledgebase/metform/\" rel=\"nofollow ugc\">Documentation</a></strong> | <strong><a href=\"https://www.youtube.com/watch?v=zg1QIouKO_Q&amp;list=PL3t2OjZ6gY8NoB_48DwWKUDRtBEuBOxSc&amp;ab_channel=Wpmet\" rel=\"nofollow ugc\">Video Tutorials</a></strong> |  <a href=\"https://products.wpmet.com/metform/pricing/\" rel=\"nofollow ugc\"> <strong>Buy Pro</strong> </a> | <strong><a href=\"https://wpmet.com/plugin/metform/roadmaps#ideas\" rel=\"nofollow ugc\">Request a Feature</a></strong></p>\n</blockquote>\n<h3>Mobile-Friendly and Responsive</h3>\n<p>Metform builds with Elementor and it will work with Elementor without any issue. and responsive can be controlled from the Elementor page builder. and Your smart order or any online form will look great on all resolutions and devices: mobile, tablet, and desktop.</p>\n<h3>Embed Anywhere</h3>\n<p>You can use Metform anywhere with Elementor to create an Elementor contact form. Also, you can use it with any editor with a built-in form shortcode. Utilizing the shortcode support for customization is easy.</p>\n<h3>Manage Submissions</h3>\n<p>Your online form submission data can be saved in admin. So, it will send data to the form admin and also send a Confirmation Email to form users.</p>\n<h3>File Upload</h3>\n<p>Want your users to upload files from your online form? no worries we have a file upload option with our Elementor form builder MetForm.</p>\n<h3>Export Form Entries as CSV</h3>\n<p>Want to Export form entries as CSV? Yes, you can do that too with the Metform Elementor form builder addon.</p>\n<h3>Free HubSpot Integration</h3>\n<p>Now Free HubSpot integration is also available in MetForm. It ensures flawless customer relationship management. With MetForm HubSpot integration, you can store all the data properly in the HubSpot account and get access to any data in the shortest possible time.</p>\n<h3>Mailchimp Integration</h3>\n<p>You can use MailChimp in your contact form so that, you can collect and send leads from WordPress to MailChimp. Also, create MailChimp signup or lead generation forms and boxes with a custom style and expand your lead list.</p>\n<h3>**✨**Top Features</h3>\n<ul>\n<li><strong>Built with Elementor:</strong> MetForm is based on Elementor. This means this contact form builder offers an Elementor-like intuitive drag-and-drop workflow and real-time preview of your customizations. And, this budget-friendly email building tool with impressive form-building functionality powered by Elementor Builder has no learning curve. </li>\n</ul>\n<p>So, beginners can easily create a query form to collect reporting and other forms like a contact form or booking form. Learn how to create a WordPress Booking form with MetForm 👇</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/K7YJmNn9nIY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent&#038;listType=playlist&#038;list=PL3t2OjZ6gY8NoB_48DwWKUDRtBEuBOxSc\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<ul>\n<li><strong>Elementor Input Fields:</strong> From lead generation to survey forms, or any complex style forms, we have designed <strong>40+ Elementor widgets</strong> fields to build in your preferred style.</li>\n</ul>\n<blockquote>\n<p><strong></strong><strong>MetForm Fields</strong></p>\n<p>Text field, Email field, Number field, Date field Time field, Select field, Textarea field, Checkbox field, Radio field, Switcher field, Range slider field, URL field, Password field, Response Message, Opt-in, reCAPTCHA, Rating, File Upload, and many more.</p>\n</blockquote>\n<ul>\n<li>\n<p><strong>User Confirmation Email:</strong> Show a nice gesture to the form submitters by sending a confirmation email after they register or enter their data or at the end of your campaign.</p>\n</li>\n<li>\n<p><strong>Admin Notification Email:</strong> Notify admin of successful order notifications after users or customers complete a form submission.</p>\n</li>\n<li>\n<p><strong>Saved Entries in the Admin Panel:</strong> Save all the data that users give to fill up the form and display it in the admin panel.</p>\n</li>\n<li>\n<p><strong>Export Entries as CSV:</strong> Export multiple data from your MetForm that the user enters in a single CSV file and downloads in a spreadsheet.</p>\n</li>\n<li>\n<p><strong>Export to Google Sheets:</strong> The popular Elementor form creator MetForm allows you to export all your users’ personal contacts, databases, and messages on Google Sheets.</p>\n</li>\n<li>\n<p><strong>Required Login to Submit the Form:</strong> Make sure a secured and spam-free contact form by showing the required fields. Notify with a simple red star or an error message when those fields are empty.</p>\n</li>\n<li>\n<p><strong>Capture User Browser Data:</strong> Displays the user’s browser information like Web browser, Visited URL, Title, Visit Time, Visit Count, User Profile, etc.</p>\n</li>\n<li>\n<p><strong>Hide Form After Submission:</strong> Hide your public Elementor form after the user fills all the necessary fields and hits the submit button.</p>\n</li>\n<li>\n<p><strong>Limit Total Entries:</strong> Enable limit to the number of submission entries to your Elementor form. This Elementor contact form builder feature will also give an error message after getting crossed.</p>\n</li>\n<li>\n<p><strong>Redirect After Successful Form Submission:</strong> Simply add the desired destination URL and redirect to that page after successfully submitting the form. It is possible with Elementor form maker MetForm.</p>\n</li>\n<li>\n<p><strong>Validate required fields:</strong> The multi-step Elementor contact form builder helps you to validate your form’s required field and gives an error message if needed to make your form standard and way more professional.</p>\n</li>\n<li>\n<p><strong>Form submission via AJAX without page refreshes:</strong> Our Elementor contact form maker permits you to submit your contact us simple form without loading your page via AJAX to make it more user-friendly and time-saving. Therefore, online visitors can fill up the form using AJAX without page loading.</p>\n</li>\n<li>\n<p><strong>Supports multiple-column layout:</strong> Specify multiple-column layouts as many as you would like to display. Simply add the column in just one click with the multi-step form builder.</p>\n</li>\n<li>\n<p><strong>Shortcode support:</strong> Add powerful features with a simple Shortcode without any knowledge of technical, complicated, and lengthy code. Now, it&#8217;s easy to get Shortcode support for customization options.</p>\n</li>\n<li>\n<p><strong>Editable successful form submission message:</strong> MetForm Elementor forms builder gives access to edit your successful form submission message so you can personalize your own message.</p>\n</li>\n<li>\n<p><strong>Translation ready:</strong> Our WordPress contact form builder plugin supports multiple languages which means you can easily translate a language into your language.</p>\n</li>\n<li>\n<p><strong>Top-notch user support:</strong> MetForm is enriched with docs, FAQs, tutorials, and blogs. You will find answers to your problems in these resources.  And, the support team is one call away from you.</p>\n</li>\n</ul>\n<h3>Our Premium Input fields</h3>\n<ul>\n<li>\n<p><strong>Phone no Input Field:</strong> Let users select prefix country code from the dropdown.</p>\n</li>\n<li>\n<p><strong>Image Select Input Field:</strong> Upload images both vertically or horizontally to allow submitters to select one.</p>\n</li>\n<li>\n<p><strong>Toggle Select  Input Field:</strong> With our most powerful Toggle Select, you can activate one section from multiple sections at a time both vertically or horizontally. If you select one section as active, then another section will automatically get deactivated.</p>\n</li>\n<li>\n<p><strong>Simple Repeater Input Field:</strong> Create a group of fields to use in the future within one click.</p>\n</li>\n<li>\n<p><strong>Google Map Location  Input Field:</strong> Let users pinpoint their location in forms.</p>\n</li>\n<li>\n<p><strong>Color Picker Input Field:</strong> Design your form by choosing a color from the color picker.</p>\n</li>\n<li>\n<p><strong>Calculation Fields List:</strong> Display automatically calculated values after users perform calculations among Form Fields.</p>\n</li>\n<li>\n<p><strong>Payment Method  Input Field:</strong> Select a payment method like Paypal or Stripe and make a user payment policy.</p>\n</li>\n<li>\n<p><strong>Signature Input Field:</strong> Get users’ realistic signatures on your form.</p>\n</li>\n<li>\n<p><strong>Like-Dislike  Input Field:</strong> Allow users to react using like and dislike fields</p>\n</li>\n</ul>\n<h3>Our Premium Features</h3>\n<ul>\n<li>\n<p><strong>Multi-Step Form:</strong> Divide your large form into multiple sections to make it more user-friendly for customers to increase the completion rate.</p>\n</li>\n<li>\n<p><strong>Conditional logic:</strong> Allows users to select one category and the given question will appear only for that section otherwise it will remain invisible. Here comes our most unique field “Conditional Logic”.<br />\n<a href=\"https://www.youtube.com/watch?v=UDQOCwO7lhI\" rel=\"nofollow ugc\"> <strong>Conditional logic</strong> </a> &#8211; <a href=\"https://products.wpmet.com/metform/pro-demos/conditional-form-1/\" rel=\"nofollow ugc\"> <strong>Conditional logic demo 1</strong> </a> &#8211;  <a href=\"https://products.wpmet.com/metform/pro-demos/conditional-form-2/\" rel=\"nofollow ugc\"> <strong>Conditional logic demo 2</strong> </a> &#8211; <a href=\"https://products.wpmet.com/metform/pro-demos/conditional-form-3/\" rel=\"nofollow ugc\"> <strong>Conditional logic demo 3</strong> </a> &#8211;  <a href=\"https://products.wpmet.com/metform/pro-demos/conditional-form-4/\" rel=\"nofollow ugc\"> <strong>Conditional logic demo 4</strong> </a></p>\n</li>\n<li>\n<p><strong>Calculation:</strong> Help you to perform your calculations and display the results within seconds in your form.</p>\n</li>\n</ul>\n<p><a href=\"https://www.youtube.com/watch?v=20nsox2cZYc\" rel=\"nofollow ugc\"> <strong>Calculation video</strong> </a> &#8211; <a href=\"https://products.wpmet.com/metform/pro-demos/calculation-form-1/\" rel=\"nofollow ugc\"> <strong>Calculation demo 1</strong> </a> &#8211;  <a href=\"https://products.wpmet.com/metform/pro-demos/calculation-form-2/\" rel=\"nofollow ugc\"> <strong>Calculation demo 2</strong> </a></p>\n<ul>\n<li>\n<p><strong>REST API Support:</strong> Get form submission data and submission notification to Third Party API URL or Webhook by integrating our Rest API very easily.</p>\n</li>\n<li>\n<p><strong>WooCommerce checkout:</strong> Shows you the add to cart product and checkout form on a single page, Also, MetForm enables you to complete orders and payments without leaving the page.</p>\n</li>\n<li>\n<p><strong>Auto Populate Field:</strong> Show additional fields after someone fills up the form.</p>\n</li>\n<li>\n<p><strong>Zapier Integration:</strong> Zapier integration in your forms allows you to connect with thousands of popular apps without any coding.</p>\n</li>\n<li>\n<p><strong>Payment Method:</strong> Choose a payment gateway like Paypal or Stripe to make the payment system super easy for beginners.</p>\n</li>\n<li>\n<p><strong>Webhook</strong>: <a href=\"https://www.youtube.com/watch?v=2NpbK_dybWg\" rel=\"nofollow ugc\"> <strong>Webhook video</strong> </a></p>\n</li>\n</ul>\n<p><strong>Migrations are coming soon in these forms. Contact Form 7, Caldera Forms, Ninja Forms, Gravity Forms, fluent forms, wp forms, Forminator &amp; Formidable Form Builder, Everest Forms</strong></p>\n<h3>**✨** MetForm Integrations</h3>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/integration/\" rel=\"nofollow ugc\">MailChimp Integration</a>: Easily integrates MailChimp to create and manage a mailing list, automated mailing, newsletter, send leads, and many other options.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/zoho/\" rel=\"nofollow ugc\">WordPress ZoHo CRM Integration</a>: Manage customers’ relationships and speed up marketing and sales with the ZoHo integration of our Elementor form builder MetForm.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/hubspot-integration/\" rel=\"nofollow ugc\">HubSpot Integration</a>: Store all the contacts inside your HubSpot account without having fear of losing them. As a result, you can easily manage your visitors’ or clients’ information.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/integrate-fluentcrm-with-metform/\" rel=\"nofollow ugc\">FluentCRM Integration</a>: View all the embedding web form submission data inside FluentCRM and manage them for successful email marketing and growth hacking.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/helpscout-integration/\" rel=\"nofollow ugc\">HelpScout Integration</a>: Build a successful bond and manage the relationship with the customers better than ever with the HelpScout form. This contact form&#8217;s dynamic CRM integration lets you sort all contacts without any ticket or case number to save you time.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/twilio-sms-integration/\" rel=\"nofollow ugc\">Twilio Integration</a>: Connect with your clients, customers, or visitors via calls or messages with Twilio integration.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/convertkit-integration/\" rel=\"nofollow ugc\">ConvertKit Integration</a>: Successfully manage all the newsletters by integrating with ConvertKit which is built on the simplest interface.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/activecampaign/\" rel=\"nofollow ugc\">ActiveCampaign Integration</a>: Make a super easy contact list management with ActiveCampaign integration.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/aweber-integration/\" rel=\"nofollow ugc\">Aweber Integration</a>: Simply integrate with Aweber, the email marketing service provider, and build Aweber forms that let you keep in touch with your subscribers.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/getresponse-integration/\" rel=\"nofollow ugc\">GetResponse Integration</a>: It is another newsletter integration like others to keep your email marketing list sorted.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/mailpoet-integration/\" rel=\"nofollow ugc\">MailPoet Integration</a>: Connect your WordPress site with MailPoet to build your simple and easy contact us form with the easiest drag-and-drop feature.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/zapier-integration/\" rel=\"nofollow ugc\">Zapier Integration</a>: Automate workflows by connecting the apps and the services you use.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/slack-integration/\" rel=\"nofollow ugc\">Slack Integration</a>: You can redirect all the Elementor form data to integrate with Slack and get the customer information faster.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/google-sheet-integration/\" rel=\"nofollow ugc\">Google reCAPTCHA</a> Integration: Metform Elementor form builder allows you to integrate Google reCAPTCHA to keep your site safe from unwanted spam and abusive traffic.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/recaptcha-integration/\" rel=\"nofollow ugc\">reCAPTCHA Integration</a>: Keep your website safe from spam and abuses using Google reCAPTCHA.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/map-integration-with-metform/\" rel=\"nofollow ugc\">Map Integration</a>: Add Google map API key with MetForm- contact form builder to know your customer locations.</p>\n<p><strong>🔷</strong> <a href=\"https://wpmet.com/doc/suretriggers-integration/\" rel=\"nofollow ugc\">SureTriggers Integration</a>: Bring different websites, applications, software, and WordPress plugins under a single platform.</p>\n<p>Learn <a href=\"https://www.youtube.com/watch?v=Ft1E1_FNtws&amp;list=PL3t2OjZ6gY8NoB_48DwWKUDRtBEuBOxSc&amp;index=13\" rel=\"nofollow ugc\">How to Install and Activate MetForm</a></p>\n<h3>» DOCUMENTATION AND SUPPORT</h3>\n<ul>\n<li>📞 <a href=\"https://wpmet.com/support-ticket-form/\" rel=\"nofollow ugc\">Contact Our Support</a></li>\n<li>🙋🏼‍♂️ <a href=\"https://www.facebook.com/groups/wpmet/\" rel=\"nofollow ugc\">Join Our Facebook Community</a></li>\n<li>📑 <a href=\"https://wpmet.com/doc/metform/\" rel=\"nofollow ugc\">Check Documentation</a></li>\n<li>🔜 <a href=\"https://wpmet.com/plugin/metform/roadmaps/\" rel=\"nofollow ugc\">Check Roadmap</a></li>\n</ul>\n<p>👉 Rate us on <a href=\"https://wordpress.org/support/plugin/metform/reviews/#new-post\" rel=\"ugc\">WordPress</a></p>\n<h3>💥 OUR OTHER PLUGINS</h3>\n<p>If you like using the MetForm form builder, then consider checking out our other products:</p>\n<p>⭕ <a href=\"https://wpmet.com/plugin/elementskit/\" rel=\"nofollow ugc\">ElementsKit</a>  The most popular all-in-one addons for Elementor.</p>\n<p>⭕ <a href=\"https://wpmet.com/plugin/shopengine/\" rel=\"nofollow ugc\">ShopEngine</a>   It is an absolute WooCommerce Solution. You will have a great experience with this WooCommerce Builder for Elementor and Gutenberg.</p>\n<p>⭕ <a href=\"https://wordpress.org/plugins/getgenie\" rel=\"ugc\">GetGenie Ai</a>  GetGenie AI is an AI-powered Content &amp; SEO Assistant. You can access it as a WordPress plugin and a SaaS model. The tool also offers a chatbot called <a href=\"https://getgenie.ai/geniechat/\" rel=\"nofollow ugc\">GenieChat</a>.</p>\n<p>⭕ <a href=\"https://wpmet.com/plugin/wp-social/\" rel=\"nofollow ugc\">Wp Social</a>  Power your WordPress site by using WP Social. It will assist you in adding a Social Login, Social Counter, and Social Login to your website.</p>\n<p>⭕ <a href=\"https://products.wpmet.com/crowdfunding/\" rel=\"nofollow ugc\">Wp FundEngine</a>  Now, creating a crowdfunding and donation site with WordPress is easier. WP FundEngine provides you with all the functionalities to ease the processes.</p>\n<p>⭕ <a href=\"https://products.wpmet.com/review/\" rel=\"nofollow ugc\">Wp Ultimate Review</a>  Check out the quick plugin, and manage and style customer reviews according to your preferences.</p>\n<p>Visit  <a href=\"https://wpmet.com/\" rel=\"nofollow ugc\">wpmet</a>  to learn more about how to get the best out of WordPress using our plugins.<br />\nCheck out <a href=\"https://wpmet.com/blog\" rel=\"nofollow ugc\">Tutorials, Tips &amp; Tricks</a>! 👌</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/metform.3.9.0.zip",
    "upgrade_notice": {
        "": "<p>Metform 1.3.0-beta1 is a major update. We have reconstructed the form builder&#039;s widgets with react and huge optimization for future proof. If you face any issue please contact our support team here https://wpmet.com/support-ticket</p>"
    },
    "screenshots": [],
    "tags": {
        "contact-form": "contact form",
        "contact-form-builder": "contact form builder",
        "elementor-contact-form": "Elementor contact form",
        "elementor-forms-builder": "elementor forms builder",
        "form-builder": "form builder"
    },
    "stable_tag": "3.9.0",
    "versions": {
        "1.0.1": "https://downloads.wordpress.org/plugin/metform.1.0.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/metform.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/metform.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/metform.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/metform.1.1.5.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/metform.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/metform.1.1.8.zip",
        "1.1.9": "https://downloads.wordpress.org/plugin/metform.1.1.9.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/metform.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/metform.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/metform.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/metform.1.2.3.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/metform.1.3.0.zip",
        "1.3.0-beta1": "https://downloads.wordpress.org/plugin/metform.1.3.0-beta1.zip",
        "1.3.0-beta2": "https://downloads.wordpress.org/plugin/metform.1.3.0-beta2.zip",
        "1.3.0-beta3": "https://downloads.wordpress.org/plugin/metform.1.3.0-beta3.zip",
        "1.3.0-beta4": "https://downloads.wordpress.org/plugin/metform.1.3.0-beta4.zip",
        "1.3.0-beta5": "https://downloads.wordpress.org/plugin/metform.1.3.0-beta5.zip",
        "1.3.0-beta6": "https://downloads.wordpress.org/plugin/metform.1.3.0-beta6.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/metform.1.3.1.zip",
        "1.3.10": "https://downloads.wordpress.org/plugin/metform.1.3.10.zip",
        "1.3.11": "https://downloads.wordpress.org/plugin/metform.1.3.11.zip",
        "1.3.12": "https://downloads.wordpress.org/plugin/metform.1.3.12.zip",
        "1.3.14": "https://downloads.wordpress.org/plugin/metform.1.3.14.zip",
        "1.3.15": "https://downloads.wordpress.org/plugin/metform.1.3.15.zip",
        "1.3.17": "https://downloads.wordpress.org/plugin/metform.1.3.17.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/metform.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/metform.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/metform.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/metform.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/metform.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/metform.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/metform.1.3.8.zip",
        "1.3.9": "https://downloads.wordpress.org/plugin/metform.1.3.9.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/metform.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/metform.1.4.1.zip",
        "1.4.10": "https://downloads.wordpress.org/plugin/metform.1.4.10.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/metform.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/metform.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/metform.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/metform.1.4.5.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/metform.1.4.6.zip",
        "1.4.7": "https://downloads.wordpress.org/plugin/metform.1.4.7.zip",
        "1.4.8": "https://downloads.wordpress.org/plugin/metform.1.4.8.zip",
        "1.4.9": "https://downloads.wordpress.org/plugin/metform.1.4.9.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/metform.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/metform.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/metform.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/metform.1.5.3.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/metform.1.5.4.zip",
        "1.5.5": "https://downloads.wordpress.org/plugin/metform.1.5.5.zip",
        "1.5.6": "https://downloads.wordpress.org/plugin/metform.1.5.6.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/metform.1.6.0.zip",
        "2.0": "https://downloads.wordpress.org/plugin/metform.2.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/metform.2.0.1.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/metform.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/metform.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/metform.2.1.2.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/metform.2.1.3.zip",
        "2.1.4": "https://downloads.wordpress.org/plugin/metform.2.1.4.zip",
        "2.1.5": "https://downloads.wordpress.org/plugin/metform.2.1.5.zip",
        "2.1.6": "https://downloads.wordpress.org/plugin/metform.2.1.6.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/metform.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/metform.2.2.1.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/metform.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/metform.3.0.1.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/metform.3.1.0.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/metform.3.1.1.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/metform.3.1.2.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/metform.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/metform.3.2.1.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/metform.3.2.2.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/metform.3.2.3.zip",
        "3.2.4": "https://downloads.wordpress.org/plugin/metform.3.2.4.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/metform.3.3.0.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/metform.3.3.1.zip",
        "3.3.2": "https://downloads.wordpress.org/plugin/metform.3.3.2.zip",
        "3.3.3": "https://downloads.wordpress.org/plugin/metform.3.3.3.zip",
        "3.4.0": "https://downloads.wordpress.org/plugin/metform.3.4.0.zip",
        "3.4.1": "https://downloads.wordpress.org/plugin/metform.3.4.1.zip",
        "3.5.0": "https://downloads.wordpress.org/plugin/metform.3.5.0.zip",
        "3.6.0": "https://downloads.wordpress.org/plugin/metform.3.6.0.zip",
        "3.7.0": "https://downloads.wordpress.org/plugin/metform.3.7.0.zip",
        "3.8.0": "https://downloads.wordpress.org/plugin/metform.3.8.0.zip",
        "3.8.1": "https://downloads.wordpress.org/plugin/metform.3.8.1.zip",
        "3.8.2": "https://downloads.wordpress.org/plugin/metform.3.8.2.zip",
        "3.8.3": "https://downloads.wordpress.org/plugin/metform.3.8.3.zip",
        "3.8.4": "https://downloads.wordpress.org/plugin/metform.3.8.4.zip",
        "3.8.5": "https://downloads.wordpress.org/plugin/metform.3.8.5.zip",
        "3.8.6": "https://downloads.wordpress.org/plugin/metform.3.8.6.zip",
        "3.8.7": "https://downloads.wordpress.org/plugin/metform.3.8.7.zip",
        "3.8.8": "https://downloads.wordpress.org/plugin/metform.3.8.8.zip",
        "3.8.9": "https://downloads.wordpress.org/plugin/metform.3.8.9.zip",
        "3.9.0": "https://downloads.wordpress.org/plugin/metform.3.9.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/metform.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/metform/assets/banner-772x250.png?rev=2544152",
        "high": "https://ps.w.org/metform/assets/banner-1544x500.png?rev=2544152"
    },
    "icons": {
        "1x": "https://ps.w.org/metform/assets/icon-128x128.png?rev=2544152",
        "2x": "https://ps.w.org/metform/assets/icon-256x256.png?rev=2544152"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 94,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "metform",
            "language": "fr_FR",
            "version": "3.9.0",
            "updated": "2021-12-30 21:41:39",
            "package": "http://downloads.wordpress.org/translation/plugin/metform/3.9.0/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "metform",
            "language": "nl_NL_formal",
            "version": "3.9.0",
            "updated": "2024-06-09 12:05:28",
            "package": "http://downloads.wordpress.org/translation/plugin/metform/3.9.0/nl_NL_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "metform",
            "language": "nl_NL",
            "version": "3.9.0",
            "updated": "2024-06-09 11:59:02",
            "package": "http://downloads.wordpress.org/translation/plugin/metform/3.9.0/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "metform",
            "language": "ru_RU",
            "version": "3.9.0",
            "updated": "2023-11-07 12:54:11",
            "package": "http://downloads.wordpress.org/translation/plugin/metform/3.9.0/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "metform",
            "language": "zh_CN",
            "version": "3.8.9",
            "updated": "2023-05-31 06:18:53",
            "package": "http://downloads.wordpress.org/translation/plugin/metform/3.8.9/zh_CN.zip"
        }
    ]
}