{
    "name": "Contact Form, Survey &amp; Form Builder &#8211; MightyForms",
    "slug": "mightyforms",
    "version": "1.3.9",
    "author": "<a href=\"https://porthas.com\">Porthas Inc.</a>",
    "author_profile": "https://profiles.wordpress.org/mightyforms/",
    "contributors": {
        "p0rthas": {
            "profile": "https://profiles.wordpress.org/p0rthas/",
            "avatar": "https://secure.gravatar.com/avatar/aa2c9f2e1b58ee9d79068d316f2ed98c?s=96&d=monsterid&r=g",
            "display_name": "Porthas Inc"
        },
        "lysyiweb": {
            "profile": "https://profiles.wordpress.org/lysyiweb/",
            "avatar": "https://secure.gravatar.com/avatar/497733e62a6a0d76de0b76876760f127?s=96&d=monsterid&r=g",
            "display_name": "Oleksandr Lysyi"
        }
    },
    "requires": "3.0.0",
    "tested": "6.5.5",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 7,
        "4": 1,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 8,
    "support_url": "https://wordpress.org/support/plugin/mightyforms/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 300,
    "downloaded": 7487,
    "last_updated": "2024-04-24 1:43pm GMT",
    "added": "2019-05-30",
    "homepage": "",
    "sections": {
        "description": "<p><strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">MightyForms Form Builder</a></strong> is the best solution for web developers and business owners alike that want to build forms for one or more websites. It’s free to use to create forms with unlimited fields and submissions.</p>\n<p>Create beautiful contact forms, application forms, email subscription forms, order forms, payment forms, surveys, booking form, and more with a powerful, no-code form builder with <strong><a href=\"https://www.mightyforms.com/features/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">features</a></strong> that help you automate your workflow and <a href=\"https://www.mightyforms.com/blog/form-builder-to-grow-your-business/\" rel=\"nofollow ugc\">grow your business</a> with lead generation.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/F4xZHrI9JEE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>📈 Marketing &amp; Sales Automation Form Builder</h3>\n<p>We created <strong>MightyForms</strong> to solve problems no other form builder was looking to solve. <a href=\"https://www.mightyforms.com/about-us/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">This is our story</a>. If you want to solve productivity and workflow automation with your online forms &#8211; you’re in the right place.</p>\n<p>This is more than just a form builder.</p>\n<p>MightyForm goes beyond a simple form builder. We are a platform that works with form solutions for your business. Lead capture forms, registration forms, contact form, survey, or any other form you need on your website, we are the online builder that brings solutions with features and integration that makes your business lighter and easier.</p>\n<p>If you’re looking for a free form builder, that can automate your business and have optimization, besides being responsive, trust on MightyForms.<br />\nThis is an order form creator that actually lets you see your products, payment method, and even do tests, before publishing the form. Payment forms that allow coupons, creates customer accounts, and assists your Sales team seamlessly.</p>\n<p>And if you’re looking for a contact form builder that not only works as an optimized and responsive contact form but also can receive files with it, you’re in the right place. MightyForms has integrations with Google Drive and Dropbox that allow you to receive files with your forms.</p>\n<p>Trust a form builder that automates your contact form. Let the visitor send you messages and send an automatic response. Create a payment form that works as an automatic payment system, and generates a PDF copy as a receipt. You can set one time payment, recurring subscription payments, or even sell Stripe products directly through the web form. Work with a payment form that helps online business and non-profit organizations.</p>\n<h3>📱 Mobile-friendly forms</h3>\n<p><strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">MightyForms</a></strong> is a form creator that automatically <a href=\"https://www.mightyforms.com/responsive-forms/?utm_source=wp-repo&amp;utm_medium=MF-responsive&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">makes online forms responsive</a>, you can even preview your form in different devices before publishing it, so you can be assured that your responsive form will be 100% mobile-friendly and easy to fill out on any device.<br />\nImagine having a contact form that doesn’t work well on mobiles. With a lot of your demands coming from mobile searches, that sounds terrifying. But with MightyForms form builder you have nothing to worry about. All your forms can perform perfectly from any device.</p>\n<h3>📑 Embed a form easily</h3>\n<p><strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">MightyForms Form Builder</a></strong> works seamlessly with the WordPress Gutenberg editor. Simply choose to add a block and select MightyForms.</p>\n<p>Alternatively, you can navigate to Plugins &gt; MightyForms &gt; My Forms, there you can see each of your forms’ shortcodes that you can copy and paste into the page you want to embed your form.</p>\n<h3>💻 Web form editor</h3>\n<p><strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">MightyForms</a></strong> the web form <a href=\"https://www.mightyforms.com/features/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">drag and drop editor</a> is incredibly easy to use. Simply select and drag the field you would like to add to your form and drop it wherever you like, you can then resize and reposition it if you need to. MightyForm is just this simple as an online form builder solution.</p>\n<p>You have total control over how your form looks, whether you want wider grids, popping colors, specific fonts, and information, you can get everything just the way you like it with a few clicks without having to write a single line of code.</p>\n<h3>📧 Contact form builder</h3>\n<p>Build your contact form from scratch or use a contact form template from our database. Easily make the contact form your own by adding your logo, brand colors, and personalize the user’s experience with a personalized pop-up success message.</p>\n<p>A contact form is one of the most important forms you have on your website. It&#8217;s used to start a conversation, so a contact form builder must have full comprehension of its importance and offer all the solutions to make the contact form provide the best user experience.</p>\n<p>Receive files through the contact form, integrating with Dropbox or Google Drive. MightyForms is a form builder that also automates your contact forms, so it completes tasks on autopilot, giving you more time to manage and grow your business.</p>\n<p>For this reason, MightyForms presents a large set of features and integrations. All to make your contact form the best way for the lead to start the conversation.</p>\n<p><a href=\"https://www.mightyforms.com/autoresponder/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">Set up an autoreply</a> that sends a customized email to each user that responded to your form. You can determine which fields are required to be filled out before submission and enable reCaptcha V3 to protect your form from bots.</p>\n<h3>🙋‍♀️ Registration Form builder</h3>\n<p>For all the reasons you may need a registration form, MightyForms form builder has the right feature and integration. Don’t go overlooking, your registration form can be built easily and branded here. Create a custom form made especially for your needs and make sure you have a high rate of completion.<br />\nYou use registration forms when you need to get data to subscribe to the visitor for some offer or service you offer. You can have opportunities, programs, or plans that need a registration form to be done in a faster and precise way.</p>\n<h3>✔Feedback form generator</h3>\n<p>Make sure you are offering the best possible service and experience by listening to your audience. Create easy-to-fill-out feedback forms with <strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">MightyForms</a></strong>.</p>\n<p>Ask for detailed feedback by allowing your audience to select from dropdown options, single choice, or checkbox fields. With the Form Abandonment Recovery feature, you can keep track of each submission as it’s being filled out, even if the user abandons the form you’ll see where they dropped off.<br />\nComplement your feedback form with the Save and Resume option. Let the lead come back to the feedback form when they are available to do so. Since this is a usually longer type of form, it&#8217;s interesting to allow the respondent to decide when they wish to continue responding.</p>\n<h3>‎️‍🔥 Survey creator</h3>\n<p>Understand your target market with online surveys. You can gather as much data as possible by sharing your form on social media or generating a link to your survey and sending it to your mailing list.</p>\n<p>Use personalized fields to let your target audience better understand your business and give their helpful opinion. Surveys are an excellent tool, especially for sectors such as <strong><a href=\"https://www.mightyforms.com/sales-and-marketing-automation/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">Marketing &amp; Sales</a></strong> and <strong><a href=\"https://www.mightyforms.com/human-resources-automation/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">Human Resources</a></strong>.</p>\n<h3>‎️‍🔥 Online Poll Form</h3>\n<p>Get closer to the prospect and understand better their needs and demands using a poll form. You can conduct polls to evaluate your business performance and improve it through the data collected. You can even create a <strong><a href=\"https://help.mightyforms.com/en/articles/3816635-how-to-make-a-custom-url-for-forms-and-surveys?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">unique URL</a></strong>  to share them as their own on social media, for example. This makes a personalized poll form.</p>\n<h3>💵 Donation Form</h3>\n<p>As a non-profit organization, you can receive the donation through a donation form. Build a beautiful and responsive donation form with MightyForms. Branded it using a custom form builder. Make it a payment form, using integrations that create a useful, intuitive, and quick to fill the form.<br />\nYour donation form can be the gateway for prospects to get to know your institution. You can have a PDF copy as the receipt of the donation, making it even more trustworthy.</p>\n<h3>👋 Request Forms</h3>\n<p>Order forms, service request forms, booking forms, donation form, all of these request forms can be built with <strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">MightyForms</a></strong> free form builder. Trust the best form maker platform on the market to build your request form.<br />\nBook appointments using booking forms, or then get requests about services or products using an order form. No matter the reason, we have the perfect free template for you to use. Or you can build your form from scratch and add all the features and integrations that can speed up all your tasks and demands.</p>\n<h3>📝 Application Form</h3>\n<p>You can have any kind of form built with MightyForms. The application form builder is an asset you may require overtime on your business. You may need a job application form for your business, as an example. Customize it with branding, making it personalized. Custom forms are easily recognizable and create brand awareness.<br />\nChoose a <strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">custom form builder</a></strong>  to build custom forms for your business.</p>\n<h3>💳 Payment Forms</h3>\n<p>There are multiple reasons for you to receive payment through your forms. It can be with your order form, booking form, donation form, registration form, or any other kind of payment form you work with.<br />\nWith <strong><a href=\"https://www.mightyforms.com/forms-with-stripe-payments?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">Stripe integration</a></strong> you can have all the payments or donations made through the form, making it easier for both the customer, or donor, and you.</p>\n<h3>🎮 Interactive Forms</h3>\n<p>Build quizzes or multi-step forms, for any kind of form you may use. Call the attention of prospect to your forms building it interactively and intuitively.</p>\n<p>A quiz form is a way to gather and give information making it more fun. No matter if you need a quiz form for your class or to discover which ice cream flavor you are, a quiz form can be the solution for your lead capture strategy.</p>\n<p>Make custom forms to create a more interactive approach. It can be a multi-step or conversational form, where you separate the questions as it&#8217;s more convenient for the respondent. Longer form, as a survey, for example, can be extenuating and cause a high abandonment rate. But, with a multi-step form, you can remove the overwhelming factor and let it lighter for the respondent.</p>\n<h3>📄 PDF forms submission</h3>\n<p>PDF form submissions are a free feature that lets you receive submissions in PDF format automatically in your email inbox. MightyForms makes it easy for you to select the fields from your PDF form, add it, and arrange it into a web form. You can even include a Signature Field that allows the user to Digitally sign your online form.</p>\n<p>Each submission can be automatically sent to you as a filled PDF form straight to your inbox. Or, if you prefer, you can always download each individual filled out PDF from your form’s dashboard. This solution is especially <a href=\"https://www.mightyforms.com/legal-document-automation/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">ideal for lawyers and other legal professionals</a> that rely on PDF document automation.</p>\n<h3>🎯 Form Abandonment Recovery</h3>\n<p>As an online form builder solution, we care about how you follow your form’s performance and bring to you the best and easy way. <strong><a href=\"https://www.mightyforms.com/form-analytics-real-time-data-capture?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">Abandoned Form Recovery feature</a></strong> is one of MightyForms most powerful premium features. Keep track of each submission as it’s being filled out, even if the user abandons the form you can see the information that was input up until then. It’s easy to enable and can be disabled at any time.</p>\n<h3>🥇 Google integrations</h3>\n<p>MightyForms makes your data analytics and performance data capture a lot easier by making it possible for you to connect your Google Tags Manager and Google Analytics account for advanced analytics and even A/B testing through Google Optimize.</p>\n<h3>🏆 More MightyForms Features</h3>\n<p><strong>Autoresponder</strong><br />\n set up automatic SMS or email notifications that can be completely customizable and set to send to the user, yourself, and anyone else in your team. Send notifications to users that abandoned your forms, automatically.</p>\n<p><strong>Pop-up message</strong><br />\n give your user a thank-you or welcome message with a quick pop-up that can include an image, gif, or video.</p>\n<p><strong>Redirect</strong><br />\n an excellent tool for an upsell, you can redirect your user to another landing page.</p>\n<p><strong>Update anytime</strong><br />\n if your form needs to be altered or integrated with another tool, simply edit it in the builder.</p>\n<p><strong>Custom design</strong><br />\n create forms that truly reflect and empower your brand, by customizing the look and functionalities.</p>\n<p><strong>Upload file field</strong><br />\nallow users to upload files to their submission with this customizable field.</p>\n<p><strong>Unique ID field</strong><br />\nthis can be used to create a unique client ID, order ID, etc., to help you keep your database organized.</p>\n<p><strong>Google Map field</strong><br />\nmake it easy for your users to find your business by embedding a Google map to your form.</p>\n<h3>🧩 MightyForms Integrations</h3>\n<p>Automate and optimize your workflow with powerful integrations.</p>\n<p><strong>Zapier integrations</strong><br />\nIntegrate with over 1.500 tools via Zapier, easily automating work processes.</p>\n<p><strong>Dropbox</strong><br />\nSave your form submission automatically to your Dropbox account.</p>\n<p><strong>Google Drive</strong><br />\nSave your form submissions automatically to your Google Drive account.</p>\n<p><strong>Google Calendar</strong><br />\nCreate events on your Google Calendar based on each submission data.</p>\n<p><strong>Google Sheets</strong><br />\nEasily organize and store submission data into a Google Sheet.</p>\n<p><strong>Stripe Payments</strong><br />\nKeep the payment form optimized and easier using Stripe payments integration. Build intuitive and responsive payment forms with Stripe integration.</p>\n<p><strong>And more coming soon</strong><br />\n<strong>MightyForms</strong>  is growing its list of integrations, from CRMs like Salesforce, to even more productivity and automation tools</p>\n<h3>Do you like MightyForms? 🙂</h3>\n<p>Follow us on Social Media:<br />\n<a href=\"https://twitter.com/MightyForms\" rel=\"nofollow ugc\">Twitter</a>,<br />\n<a href=\"https://twitter.com/MightyForms\" rel=\"nofollow ugc\">Facebook</a>,<br />\n<a href=\"https://www.instagram.com/mightyforms/\" rel=\"nofollow ugc\">Instagram</a>,<br />\n<a href=\"https://www.linkedin.com/company/mightyforms/\" rel=\"nofollow ugc\">Linkedin</a></p>\n<p><a href=\"https://www.mightyforms.com/blog/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">Subscribe to our newsletter</a></p>\n<p>Rate us on <a href=\"https://wordpress.org/support/plugin/mightyforms/reviews/?filter=5/#new-post\" rel=\"ugc\">WordPress</a></p>\n<h3>Third party services usage</h3>\n<p>MightyForm wordpress plugin connects to your MightyForms account through API to retrieve your existing forms and to display them in your website. Our service app can be accessed at https://app.mightyforms.com<br />\n&#8211; Terms of Use: <a href=\"https://help.mightyforms.com/pricing-privacy-terms/terms-of-use\" rel=\"nofollow ugc\">https://help.mightyforms.com/pricing-privacy-terms/terms-of-use</a><br />\n&#8211; Privacy Policy: <a href=\"https://help.mightyforms.com/pricing-privacy-terms/privacy-policy\" rel=\"nofollow ugc\">https://help.mightyforms.com/pricing-privacy-terms/privacy-policy</a></p>\n",
        "installation": "<ol>\n<li>Upload plugin files to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n<li>In sidebar menu go to MightyForms page and signin in application.</li>\n<li>Now, you can go to submenu (My froms), find there needed form, copy shortcode and paste in any page or post. Also, you can use Gutenberg block.</li>\n</ol>\n",
        "faq": "\n<dt id='who%20is%20mightyforms%20for%3F'>\nWho is MightyForms for?\n</h4>\n<p>\n<p>MightyForm is a platform that brings form solutions for all businesses or entities that have the need for a web form on their website. Capture more leads, automate complex tasks, and receive payments with web forms.<br />\nIf you’re a business owner, a blogger, designer, photographer, or any other profession that is online and needs means of communication and to sell your product or services, you can use the MightyForms plugin for WordPress and build the best forms for your purpose.<br />\nBuild contact forms, order forms, or booking forms, and streamline your processes.</p>\n</p>\n<dt id='does%20mightyforms%20have%20any%20limitation%20on%20the%20free%20version%3F'>\nDoes MightyForms have any limitation on the free version?\n</h4>\n<p>\n<p>You can build forms with unlimited fields and submissions, even on the free version. But some features and integrations are exclusive for paid plans.<br />\nPaid plans start at only $5 a month.<br />\nLearn more about our <a href=\"https://www.mightyforms.com/pricing?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">Pricing</a>. And if you’re a non-profit organization, get in touch with us, we can work on the best offer for your institution.</p>\n</p>\n<dt id='do%20i%20need%20to%20know%20coding%20to%20build%20a%20form%20with%20mightyforms%3F'>\nDo I need to know coding to build a form with MightyForms?\n</h4>\n<p>\n<p>No. MightyForms is a simple platform to use. All you have to do is select the field you wish to add to the form and just drag-and-drop it. You can resize, change colors, and personalize it, and all without writing a single line of code.</p>\n</p>\n<dt id='how%20can%20i%20add%20the%20form%20to%20my%20wordpress%20page%3F'>\nHow can I add the form to my WordPress page?\n</h4>\n<p>\n<p>After you build your form using the plugin, you can find the MightyForms in the Gutenberg Editor block. But you can also copy and paste the embed code to the HTML editor of your page.</p>\n</p>\n<dt id='am%20i%20notified%20when%20a%20form%20is%20submitted%3F'>\nAm I notified when a form is submitted?\n</h4>\n<p>\n<p>Yes. A notification is automatically set up to notify you of new submissions via email. And you can customize it to welcome new subscribers and add any information you need.You can easily create new email or SMS notifications..</p>\n</p>\n<dt id='can%20i%20receive%20payments%20with%20mightyforms%20forms%3F'>\nCan I receive payments with MightyForms forms?\n</h4>\n<p>\n<p>Yes. You can receive payments by activating the Stripe Integration, simply enable the functionality by using the payment field and signing in to your Stripe account. Add your products to the form, set up calculation rules, and receive the payment straight to the form.</p>\n</p>\n<dt id='what%20type%20of%20forms%20can%20i%20build%20using%20mightyforms%3F'>\nWhat type of forms can I build using MightyForms?\n</h4>\n<p>\n<p>You can build any form you need. It can be from scratch or you can use one of our several <strong><a href=\"https://www.mightyforms.com/form-templates/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">free templates</a></strong>.<br />\nYou can find free templates for a:<br />\nContact Form<br />\nBooking Form<br />\nOrder Form<br />\nApplication Form<br />\nRegistration Form<br />\nPayment Form<br />\nAll using the number of fields you need to accomplish your needs. Customize the forms, add your logo and give them a touch of your business personality.</p>\n</p>\n<dt id='can%20i%20receive%20uploaded%20files%20with%20mightyforms%3F'>\nCan I receive uploaded files with MightyForms?\n</h4>\n<p>\n<p>Yes. Enable the Google Drive or Dropbox integration and get all files sent directly and automatically to your Cloud account, saving you time and speeding up your work.</p>\n</p>\n<dt id='can%20i%20export%20forms%3F'>\nCan I Export forms?\n</h4>\n<p>\n<p>Yes. You can use embed codes to import your forms and to export them. It’s easy and of extreme importance, if you’re a developer building a form for a client.<br />\nCustomize the forms, giving it the business personality and branding it to be easily recognized by your customers.</p>\n</p>\n<dt id='how%20can%20i%20contact%20mightyforms%20support%20center%3F'>\nHow can I contact MightyForms Support Center?\n</h4>\n<p>\n<p>You can contact MightyForms in more than just one way. You can send us a message through our <strong><a href=\"https://www.mightyforms.com/contact-mightyforms-support?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">contact form</a></strong>, or send your questions through our Live Chat support.</p>\n</p>\n<dt id='do%20i%20need%20to%20download%20the%20mightyforms%20plugin%20to%20use%20it%20on%20wordpress%3F'>\nDo I need to download the MightyForms plugin to use it on WordPress?\n</h4>\n<p>\n<p>No. You can create a MightyForms account over at <a href=\"https://app.mightyforms.com/create-form?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">app.mightyforms.com</a>, create and publish your form there, then copy the Embed code generated and paste it into your WordPress site pages.<br />\nIf you choose to download the MightyForms plugin, simply activate it, and sign up for your MightyForms account. You can create a form on the plugin or embed a built form from your MightyForms dashboard.</p>\n<p>Your question is not listed? Search for it in our <strong><a href=\"https://help.mightyforms.com/en/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">help center</a></strong> or get in <strong><a href=\"https://www.mightyforms.com/contact-mightyforms-support/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">touch with us</a></strong></p>\n</p>\n\n",
        "changelog": "<h4>1.3.9</h4>\n<ul>\n<li>Small fixes</li>\n</ul>\n<h4>1.3.8</h4>\n<ul>\n<li>Added &#8220;How to&#8221; page</li>\n</ul>\n<h4>1.3.7</h4>\n<ul>\n<li>Added info-block for Safari users</li>\n</ul>\n<h4>1.3.6</h4>\n<ul>\n<li>Added &#8220;Reconnect&#8221; button for removing API key from the WordPress</li>\n</ul>\n<h4>1.3.5</h4>\n<ul>\n<li>Renamed menu items</li>\n<li>Fixed broken link in Readme</li>\n<li>Added &#8220;Create form&#8221; button if forms is absent in account</li>\n<li>Small fixes</li>\n</ul>\n<h4>1.3.4</h4>\n<ul>\n<li>Fixed jQuery Migrate deprecation notice</li>\n</ul>\n<h4>1.3.3</h4>\n<ul>\n<li>Updated Readme</li>\n</ul>\n<h4>1.3.2</h4>\n<ul>\n<li>Fix</li>\n</ul>\n<h4>1.3.1</h4>\n<ul>\n<li>Added guest-mode for unauthorized users</li>\n<li>Fixed wrong error message on &#8220;My forms&#8221; page when user haven&#8217;t forms in MightyForms account</li>\n</ul>\n<h4>1.3</h4>\n<ul>\n<li>Added &#8220;Rate us&#8221; widget</li>\n</ul>\n<h4>1.2.4</h4>\n<ul>\n<li>Added async to loader script. Decreased forms loading time</li>\n</ul>\n<h4>1.2.3</h4>\n<ul>\n<li>Analytics</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>Fixed catching API key for &#8220;My forms&#8221; page</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Compatibility with WP 5.3</li>\n</ul>\n<h4>1.2</h4>\n<ul>\n<li>Improved performance</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Fixed getting API key</li>\n</ul>\n<h4>1.1</h4>\n<ul>\n<li>Removed &#8220;settings&#8221; page, instead, user stay authorized in plugin, after success auth in MightyForms application, inside of plugin.</li>\n</ul>\n<h4>1.01</h4>\n<ul>\n<li>API URLs was changed</li>\n</ul>\n<h4>1.0</h4>\n<ul>\n<li>First stable release</li>\n</ul>\n"
    },
    "short_description": "Drag &amp; drop form builder with lead generation and workflow automation. MightyForms is a contact form builder, survey creator, order form creator, &hellip;",
    "description": "<p><strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">MightyForms Form Builder</a></strong> is the best solution for web developers and business owners alike that want to build forms for one or more websites. It’s free to use to create forms with unlimited fields and submissions.</p>\n<p>Create beautiful contact forms, application forms, email subscription forms, order forms, payment forms, surveys, booking form, and more with a powerful, no-code form builder with <strong><a href=\"https://www.mightyforms.com/features/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">features</a></strong> that help you automate your workflow and <a href=\"https://www.mightyforms.com/blog/form-builder-to-grow-your-business/\" rel=\"nofollow ugc\">grow your business</a> with lead generation.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/F4xZHrI9JEE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>📈 Marketing &amp; Sales Automation Form Builder</h3>\n<p>We created <strong>MightyForms</strong> to solve problems no other form builder was looking to solve. <a href=\"https://www.mightyforms.com/about-us/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">This is our story</a>. If you want to solve productivity and workflow automation with your online forms &#8211; you’re in the right place.</p>\n<p>This is more than just a form builder.</p>\n<p>MightyForm goes beyond a simple form builder. We are a platform that works with form solutions for your business. Lead capture forms, registration forms, contact form, survey, or any other form you need on your website, we are the online builder that brings solutions with features and integration that makes your business lighter and easier.</p>\n<p>If you’re looking for a free form builder, that can automate your business and have optimization, besides being responsive, trust on MightyForms.<br />\nThis is an order form creator that actually lets you see your products, payment method, and even do tests, before publishing the form. Payment forms that allow coupons, creates customer accounts, and assists your Sales team seamlessly.</p>\n<p>And if you’re looking for a contact form builder that not only works as an optimized and responsive contact form but also can receive files with it, you’re in the right place. MightyForms has integrations with Google Drive and Dropbox that allow you to receive files with your forms.</p>\n<p>Trust a form builder that automates your contact form. Let the visitor send you messages and send an automatic response. Create a payment form that works as an automatic payment system, and generates a PDF copy as a receipt. You can set one time payment, recurring subscription payments, or even sell Stripe products directly through the web form. Work with a payment form that helps online business and non-profit organizations.</p>\n<h3>📱 Mobile-friendly forms</h3>\n<p><strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">MightyForms</a></strong> is a form creator that automatically <a href=\"https://www.mightyforms.com/responsive-forms/?utm_source=wp-repo&amp;utm_medium=MF-responsive&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">makes online forms responsive</a>, you can even preview your form in different devices before publishing it, so you can be assured that your responsive form will be 100% mobile-friendly and easy to fill out on any device.<br />\nImagine having a contact form that doesn’t work well on mobiles. With a lot of your demands coming from mobile searches, that sounds terrifying. But with MightyForms form builder you have nothing to worry about. All your forms can perform perfectly from any device.</p>\n<h3>📑 Embed a form easily</h3>\n<p><strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">MightyForms Form Builder</a></strong> works seamlessly with the WordPress Gutenberg editor. Simply choose to add a block and select MightyForms.</p>\n<p>Alternatively, you can navigate to Plugins &gt; MightyForms &gt; My Forms, there you can see each of your forms’ shortcodes that you can copy and paste into the page you want to embed your form.</p>\n<h3>💻 Web form editor</h3>\n<p><strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">MightyForms</a></strong> the web form <a href=\"https://www.mightyforms.com/features/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">drag and drop editor</a> is incredibly easy to use. Simply select and drag the field you would like to add to your form and drop it wherever you like, you can then resize and reposition it if you need to. MightyForm is just this simple as an online form builder solution.</p>\n<p>You have total control over how your form looks, whether you want wider grids, popping colors, specific fonts, and information, you can get everything just the way you like it with a few clicks without having to write a single line of code.</p>\n<h3>📧 Contact form builder</h3>\n<p>Build your contact form from scratch or use a contact form template from our database. Easily make the contact form your own by adding your logo, brand colors, and personalize the user’s experience with a personalized pop-up success message.</p>\n<p>A contact form is one of the most important forms you have on your website. It&#8217;s used to start a conversation, so a contact form builder must have full comprehension of its importance and offer all the solutions to make the contact form provide the best user experience.</p>\n<p>Receive files through the contact form, integrating with Dropbox or Google Drive. MightyForms is a form builder that also automates your contact forms, so it completes tasks on autopilot, giving you more time to manage and grow your business.</p>\n<p>For this reason, MightyForms presents a large set of features and integrations. All to make your contact form the best way for the lead to start the conversation.</p>\n<p><a href=\"https://www.mightyforms.com/autoresponder/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">Set up an autoreply</a> that sends a customized email to each user that responded to your form. You can determine which fields are required to be filled out before submission and enable reCaptcha V3 to protect your form from bots.</p>\n<h3>🙋‍♀️ Registration Form builder</h3>\n<p>For all the reasons you may need a registration form, MightyForms form builder has the right feature and integration. Don’t go overlooking, your registration form can be built easily and branded here. Create a custom form made especially for your needs and make sure you have a high rate of completion.<br />\nYou use registration forms when you need to get data to subscribe to the visitor for some offer or service you offer. You can have opportunities, programs, or plans that need a registration form to be done in a faster and precise way.</p>\n<h3>✔Feedback form generator</h3>\n<p>Make sure you are offering the best possible service and experience by listening to your audience. Create easy-to-fill-out feedback forms with <strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">MightyForms</a></strong>.</p>\n<p>Ask for detailed feedback by allowing your audience to select from dropdown options, single choice, or checkbox fields. With the Form Abandonment Recovery feature, you can keep track of each submission as it’s being filled out, even if the user abandons the form you’ll see where they dropped off.<br />\nComplement your feedback form with the Save and Resume option. Let the lead come back to the feedback form when they are available to do so. Since this is a usually longer type of form, it&#8217;s interesting to allow the respondent to decide when they wish to continue responding.</p>\n<h3>‎️‍🔥 Survey creator</h3>\n<p>Understand your target market with online surveys. You can gather as much data as possible by sharing your form on social media or generating a link to your survey and sending it to your mailing list.</p>\n<p>Use personalized fields to let your target audience better understand your business and give their helpful opinion. Surveys are an excellent tool, especially for sectors such as <strong><a href=\"https://www.mightyforms.com/sales-and-marketing-automation/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">Marketing &amp; Sales</a></strong> and <strong><a href=\"https://www.mightyforms.com/human-resources-automation/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">Human Resources</a></strong>.</p>\n<h3>‎️‍🔥 Online Poll Form</h3>\n<p>Get closer to the prospect and understand better their needs and demands using a poll form. You can conduct polls to evaluate your business performance and improve it through the data collected. You can even create a <strong><a href=\"https://help.mightyforms.com/en/articles/3816635-how-to-make-a-custom-url-for-forms-and-surveys?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">unique URL</a></strong>  to share them as their own on social media, for example. This makes a personalized poll form.</p>\n<h3>💵 Donation Form</h3>\n<p>As a non-profit organization, you can receive the donation through a donation form. Build a beautiful and responsive donation form with MightyForms. Branded it using a custom form builder. Make it a payment form, using integrations that create a useful, intuitive, and quick to fill the form.<br />\nYour donation form can be the gateway for prospects to get to know your institution. You can have a PDF copy as the receipt of the donation, making it even more trustworthy.</p>\n<h3>👋 Request Forms</h3>\n<p>Order forms, service request forms, booking forms, donation form, all of these request forms can be built with <strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">MightyForms</a></strong> free form builder. Trust the best form maker platform on the market to build your request form.<br />\nBook appointments using booking forms, or then get requests about services or products using an order form. No matter the reason, we have the perfect free template for you to use. Or you can build your form from scratch and add all the features and integrations that can speed up all your tasks and demands.</p>\n<h3>📝 Application Form</h3>\n<p>You can have any kind of form built with MightyForms. The application form builder is an asset you may require overtime on your business. You may need a job application form for your business, as an example. Customize it with branding, making it personalized. Custom forms are easily recognizable and create brand awareness.<br />\nChoose a <strong><a href=\"https://www.mightyforms.com/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">custom form builder</a></strong>  to build custom forms for your business.</p>\n<h3>💳 Payment Forms</h3>\n<p>There are multiple reasons for you to receive payment through your forms. It can be with your order form, booking form, donation form, registration form, or any other kind of payment form you work with.<br />\nWith <strong><a href=\"https://www.mightyforms.com/forms-with-stripe-payments?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">Stripe integration</a></strong> you can have all the payments or donations made through the form, making it easier for both the customer, or donor, and you.</p>\n<h3>🎮 Interactive Forms</h3>\n<p>Build quizzes or multi-step forms, for any kind of form you may use. Call the attention of prospect to your forms building it interactively and intuitively.</p>\n<p>A quiz form is a way to gather and give information making it more fun. No matter if you need a quiz form for your class or to discover which ice cream flavor you are, a quiz form can be the solution for your lead capture strategy.</p>\n<p>Make custom forms to create a more interactive approach. It can be a multi-step or conversational form, where you separate the questions as it&#8217;s more convenient for the respondent. Longer form, as a survey, for example, can be extenuating and cause a high abandonment rate. But, with a multi-step form, you can remove the overwhelming factor and let it lighter for the respondent.</p>\n<h3>📄 PDF forms submission</h3>\n<p>PDF form submissions are a free feature that lets you receive submissions in PDF format automatically in your email inbox. MightyForms makes it easy for you to select the fields from your PDF form, add it, and arrange it into a web form. You can even include a Signature Field that allows the user to Digitally sign your online form.</p>\n<p>Each submission can be automatically sent to you as a filled PDF form straight to your inbox. Or, if you prefer, you can always download each individual filled out PDF from your form’s dashboard. This solution is especially <a href=\"https://www.mightyforms.com/legal-document-automation/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">ideal for lawyers and other legal professionals</a> that rely on PDF document automation.</p>\n<h3>🎯 Form Abandonment Recovery</h3>\n<p>As an online form builder solution, we care about how you follow your form’s performance and bring to you the best and easy way. <strong><a href=\"https://www.mightyforms.com/form-analytics-real-time-data-capture?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">Abandoned Form Recovery feature</a></strong> is one of MightyForms most powerful premium features. Keep track of each submission as it’s being filled out, even if the user abandons the form you can see the information that was input up until then. It’s easy to enable and can be disabled at any time.</p>\n<h3>🥇 Google integrations</h3>\n<p>MightyForms makes your data analytics and performance data capture a lot easier by making it possible for you to connect your Google Tags Manager and Google Analytics account for advanced analytics and even A/B testing through Google Optimize.</p>\n<h3>🏆 More MightyForms Features</h3>\n<p><strong>Autoresponder</strong><br />\n set up automatic SMS or email notifications that can be completely customizable and set to send to the user, yourself, and anyone else in your team. Send notifications to users that abandoned your forms, automatically.</p>\n<p><strong>Pop-up message</strong><br />\n give your user a thank-you or welcome message with a quick pop-up that can include an image, gif, or video.</p>\n<p><strong>Redirect</strong><br />\n an excellent tool for an upsell, you can redirect your user to another landing page.</p>\n<p><strong>Update anytime</strong><br />\n if your form needs to be altered or integrated with another tool, simply edit it in the builder.</p>\n<p><strong>Custom design</strong><br />\n create forms that truly reflect and empower your brand, by customizing the look and functionalities.</p>\n<p><strong>Upload file field</strong><br />\nallow users to upload files to their submission with this customizable field.</p>\n<p><strong>Unique ID field</strong><br />\nthis can be used to create a unique client ID, order ID, etc., to help you keep your database organized.</p>\n<p><strong>Google Map field</strong><br />\nmake it easy for your users to find your business by embedding a Google map to your form.</p>\n<h3>🧩 MightyForms Integrations</h3>\n<p>Automate and optimize your workflow with powerful integrations.</p>\n<p><strong>Zapier integrations</strong><br />\nIntegrate with over 1.500 tools via Zapier, easily automating work processes.</p>\n<p><strong>Dropbox</strong><br />\nSave your form submission automatically to your Dropbox account.</p>\n<p><strong>Google Drive</strong><br />\nSave your form submissions automatically to your Google Drive account.</p>\n<p><strong>Google Calendar</strong><br />\nCreate events on your Google Calendar based on each submission data.</p>\n<p><strong>Google Sheets</strong><br />\nEasily organize and store submission data into a Google Sheet.</p>\n<p><strong>Stripe Payments</strong><br />\nKeep the payment form optimized and easier using Stripe payments integration. Build intuitive and responsive payment forms with Stripe integration.</p>\n<p><strong>And more coming soon</strong><br />\n<strong>MightyForms</strong>  is growing its list of integrations, from CRMs like Salesforce, to even more productivity and automation tools</p>\n<h3>Do you like MightyForms? 🙂</h3>\n<p>Follow us on Social Media:<br />\n<a href=\"https://twitter.com/MightyForms\" rel=\"nofollow ugc\">Twitter</a>,<br />\n<a href=\"https://twitter.com/MightyForms\" rel=\"nofollow ugc\">Facebook</a>,<br />\n<a href=\"https://www.instagram.com/mightyforms/\" rel=\"nofollow ugc\">Instagram</a>,<br />\n<a href=\"https://www.linkedin.com/company/mightyforms/\" rel=\"nofollow ugc\">Linkedin</a></p>\n<p><a href=\"https://www.mightyforms.com/blog/?utm_source=wp-repo&amp;utm_medium=referral&amp;utm_campaign=wordpress\" rel=\"nofollow ugc\">Subscribe to our newsletter</a></p>\n<p>Rate us on <a href=\"https://wordpress.org/support/plugin/mightyforms/reviews/?filter=5/#new-post\" rel=\"ugc\">WordPress</a></p>\n<h3>Third party services usage</h3>\n<p>MightyForm wordpress plugin connects to your MightyForms account through API to retrieve your existing forms and to display them in your website. Our service app can be accessed at https://app.mightyforms.com<br />\n&#8211; Terms of Use: <a href=\"https://help.mightyforms.com/pricing-privacy-terms/terms-of-use\" rel=\"nofollow ugc\">https://help.mightyforms.com/pricing-privacy-terms/terms-of-use</a><br />\n&#8211; Privacy Policy: <a href=\"https://help.mightyforms.com/pricing-privacy-terms/privacy-policy\" rel=\"nofollow ugc\">https://help.mightyforms.com/pricing-privacy-terms/privacy-policy</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/mightyforms.1.3.9.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/mightyforms/assets/screenshot-1.png?rev=2117957",
            "caption": "MightyForms animation"
        },
        {
            "src": "https://ps.w.org/mightyforms/assets/screenshot-2.png?rev=2400308",
            "caption": "MightyForms intergration with WordPress"
        },
        {
            "src": "https://ps.w.org/mightyforms/assets/screenshot-3.png?rev=2400282",
            "caption": "WordPress integration (Gutenberg)"
        },
        {
            "src": "https://ps.w.org/mightyforms/assets/screenshot-4.png?rev=2400282",
            "caption": "WordPress integration (Gutenberg 2)"
        }
    ],
    "tags": {
        "contact-form": "contact form",
        "contact-form-builder": "contact form builder",
        "form-builder": "form builder",
        "free-form-builder": "free form builder",
        "online-form-builder": "online form builder"
    },
    "stable_tag": "1.3.9",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/mightyforms.1.0.zip",
        "1.01": "https://downloads.wordpress.org/plugin/mightyforms.1.01.zip",
        "1.1": "https://downloads.wordpress.org/plugin/mightyforms.1.1.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/mightyforms.1.1.1.zip",
        "1.2": "https://downloads.wordpress.org/plugin/mightyforms.1.2.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/mightyforms.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/mightyforms.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/mightyforms.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/mightyforms.1.2.4.zip",
        "1.3": "https://downloads.wordpress.org/plugin/mightyforms.1.3.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/mightyforms.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/mightyforms.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/mightyforms.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/mightyforms.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/mightyforms.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/mightyforms.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/mightyforms.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/mightyforms.1.3.8.zip",
        "1.3.9": "https://downloads.wordpress.org/plugin/mightyforms.1.3.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/mightyforms.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/mightyforms/assets/banner-772x250.jpg?rev=2400918",
        "high": "https://ps.w.org/mightyforms/assets/banner-1544x500.jpg?rev=2400918"
    },
    "icons": {
        "1x": "https://ps.w.org/mightyforms/assets/icon.svg?rev=2119175",
        "svg": "https://ps.w.org/mightyforms/assets/icon.svg?rev=2119175"
    },
    "blocks": {
        "mf/form-block": {
            "name": "mf/form-block",
            "title": "MightyForms"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}