{
    "name": "MobiLoud &#8211; WordPress Mobile Apps &#8211; Convert your WordPress Website to Native Mobile Apps",
    "slug": "mobiloud-mobile-app-plugin",
    "version": "4.6",
    "author": "<a href=\"https://www.mobiloud.com\">MobiLoud</a>",
    "author_profile": "https://profiles.wordpress.org/psac50/",
    "contributors": {
        "50pixels": {
            "profile": "https://profiles.wordpress.org/50pixels/",
            "avatar": "https://secure.gravatar.com/avatar/e59848f735088b1edb631755a93d7725?s=96&d=monsterid&r=g",
            "display_name": "50pixels - Mobile App Developers"
        },
        "psac50": {
            "profile": "https://profiles.wordpress.org/psac50/",
            "avatar": "https://secure.gravatar.com/avatar/9912573b8f5306b4a544a533ca19f7ae?s=96&d=monsterid&r=g",
            "display_name": "pietro"
        },
        "xsvet": {
            "profile": "https://profiles.wordpress.org/xsvet/",
            "avatar": "https://secure.gravatar.com/avatar/e17f3cfd10e47c873fabb2daef7acbfe?s=96&d=monsterid&r=g",
            "display_name": "xsvet"
        },
        "vitorargos": {
            "profile": "https://profiles.wordpress.org/vitorargos/",
            "avatar": "https://secure.gravatar.com/avatar/0c48be5f3ab7adeede87f8a2b1148cdf?s=96&d=monsterid&r=g",
            "display_name": "Vitor Argos"
        },
        "mobileappdev": {
            "profile": "https://profiles.wordpress.org/mobileappdev/",
            "avatar": "https://secure.gravatar.com/avatar/0b4a48de97b966b2770ce6073bfcbc08?s=96&d=monsterid&r=g",
            "display_name": "mobileappdev"
        }
    },
    "requires": "3.5",
    "tested": "6.5.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 84,
    "ratings": {
        "5": 81,
        "4": 9,
        "3": 2,
        "2": 2,
        "1": 16
    },
    "num_ratings": 110,
    "support_url": "https://wordpress.org/support/plugin/mobiloud-mobile-app-plugin/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 700,
    "downloaded": 303530,
    "last_updated": "2024-06-05 06:52:00",
    "added": "2012-06-15",
    "homepage": "https://www.mobiloud.com",
    "sections": {
        "description": "<p><strong><a href=\"https://www.mobiloud.com?ref=plugindesc\" rel=\"nofollow ugc\">MobiLoud</a> lets you turn your WordPress site into mobile apps for iOS and Android that require no work to maintain.</strong></p>\n<p><em>Install the <a href=\"https://www.mobiloud.com/wordpress-mobile-app\" rel=\"nofollow ugc\">MobiLoud mobile app plugin</a> and get a free preview of your app in 30 seconds.</em></p>\n<h4>What is MobiLoud?</h4>\n<p><a href=\"https://www.mobiloud.com/wordpress-mobile-app\" rel=\"nofollow ugc\">MobiLoud</a> makes it easy to convert any WordPress site into native mobile apps for iOS and Android that automatically update with your website. You also get to work with a team of experts handling everything related to your app for you.</p>\n<p>With <a href=\"https://www.mobiloud.com/wordpress-mobile-app\" rel=\"nofollow ugc\">MobiLoud</a> you just need to maintain your responsive mobile WordPress website and your app always stays in sync with no additional maintenance required.</p>\n<p>MobiLoud is the perfect solution for news publishers and ecommerce brands looking for a way to launch native mobile apps for their loyal customers without adding to their workload or spending $100K+ to develop an app from scratch.</p>\n<p>Some of our news clients include Euractiv, Canada&#8217;s National Observer, Sports Mockery, and Business Insider. We also work with large ecommerce brands like buybuyBaby, Estee Lauder, and John Varvatos to build premium ecommerce mobile apps that automatically update with everything on their sites.</p>\n<p>Install the <a href=\"https://www.mobiloud.com/wordpress-mobile-app\" rel=\"nofollow ugc\">MobiLoud mobile app plugin</a> and get a free preview of your app in 30 seconds.</p>\n<p>Here&#8217;s what you get when you build a mobile app for your WordPress site with <a href=\"https://www.mobiloud.com/wordpress-mobile-app\" rel=\"nofollow ugc\">MobiLoud</a>:</p>\n<ul>\n<li>Everything on your website works instantly in your app so you don&#8217;t have to manage a separate channel</li>\n<li>All themes, custom code, and any other features specific to your site work out of the box</li>\n<li>Your important plugins , including WooCommerce and BuddyPress, work seamlessly</li>\n<li>Provide a native app user experience with a native tab menu, native navigation elements, and native animations</li>\n<li>A fully managed service with a team of experts handling the app build, testing, and submission process for you</li>\n<li>Send unlimited, free push notifications to better engage with your most loyal users</li>\n<li>Get an app store presence and unlock a new acquisition channel for your brand</li>\n<li>Make it easy for users to hop back in with one-tap access to your publication, community, or ecommerce store</li>\n<li>Create app-only experiences with our advanced developer tools to make CSS changes to your existing theme or use a completely separate theme for your app</li>\n</ul>\n<p>&#8212;</p>\n<h3>Our customers love working with us:</h3>\n<p>&#8220;We couldn’t find another company that could offer the same features at the same price point, same time to market, and make it as easy as MobiLoud could.&#8221;</p>\n<p><strong>Svend Hansen, Product Owner, BESTSELLER</strong></p>\n<p>&#8220;If you&#8217;re set up on WordPress and you&#8217;re serious about WordPress – MobiLoud really gets WordPress. They can really be there for you in whatever capacity you need them to be for your team&#8221;</p>\n<p><strong>Adam Griffiths, Product Manager, Foreign Policy</strong></p>\n<p>&#8220;I wanted an easy option to literally convert my WordPress website into an app. After doing my research, MobiLoud was the one that stood out in terms of price and quality of service. If you already have a good mobile site, I don&#8217;t see the benefit of rebuilding an app from scratch when MobiLoud can get the job done.&#8221;</p>\n<p><strong>Arran Rice, Founder, Simply Flying</strong></p>\n<p>&#8220;Your level of service is unmatched. You are always there when we need you, and go above and beyond to make sure everything runs smoothly for us.”</p>\n<p><strong>Kenneth Chan, Founder &amp; CEO, TOBI</strong></p>\n<p>&#8220;My team is thrilled because we have functioning apps that require almost no effort on our part, to build or maintain. It is a brilliant solution.&#8221;</p>\n<p><strong>David Cost, VP of Ecommerce &amp; Marketing, Rainbow Shops</strong></p>\n<p>“Not only do MobiLoud have great support, but they&#8217;ve really come a long way with their technology. The ability to quickly configure your options and keep a lot of flexibility between WordPress and your mobile app is really a one of a kind experience”</p>\n<p><strong>Chris Burhans, CEO, Sports Mockery</strong></p>\n<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/354094380\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/354094639\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/332400724\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p><a href=\"https://www.mobiloud.com/reviews/?ref=plugindesc\" rel=\"nofollow ugc\">Read more reviews at MobiLoud.com</a></p>\n<p>&#8212;</p>\n<h4>How Does it Work?</h4>\n<p>We have two platforms &#8211; <a href=\"https://www.mobiloud.com/wordpress-news-app\" rel=\"nofollow ugc\">News</a>, and <a href=\"https://www.mobiloud.com/canvas\" rel=\"nofollow ugc\">Canvas</a>.</p>\n<ul>\n<li><strong>News</strong> for WordPress-based news sites, blogs, magazines, online newspapers, digital publishers and larger media organizations. News lets you build fully featured content apps like those from top publishers like the New York Times or the Wall Street Journal. If you&#8217;re a publisher, run a news site or blog built on WordPress, nothing can compete with native mobile apps for boosting loyalty, engagement and revenue on mobile. </li>\n<li><strong>Canvas</strong> for building hybrid iOS and Android apps from any WordPress site. Canvas lets you build apps with WordPress using your existing theme, all your plugins and site features: everything will work straight out of the box. Canvas is ideal for ecommerce stores, marketplaces, deals sites, directories, communities, and eLearning sites. It&#8217;s ideal for sites built with BuddyPress, BuddyBoss, Peepso, Learndash and many other platforms. WooCommerce websites can also easily be turned into native mobile apps using MobiLoud Canvas. </li>\n</ul>\n<h4>What Do They Have in Common?</h4>\n<p>Although News and Canvas work differently, they all have some key factors in common.</p>\n<ul>\n<li><strong>Simple, fast</strong> &#8212; You&#8217;ll be ready to launch in just weeks, and won&#8217;t need to touch a line of code &#8211; if you don&#8217;t want  to &#8211; while allowing plenty of customization and opportunities to get hands-on with the code for developers and agencies. </li>\n<li><strong>Full service</strong> &#8212; Our team can handle all the technical tasks necessary to get your app live. You can rely on our experts to completely configure the app for you (read more about our Full Service Package).</li>\n<li><strong>No risk guarantee</strong> &#8212; MobiLoud has no long term contracts, and we offer a 60-day guarantee with a full refund if you are not happy with the apps for any reason. We also offer an approval guarantee i.e. if your app is not approved by Apple and Google you can cancel the project and have your money back.</li>\n<li><strong>Manage the apps through WordPress</strong> &#8212; You can send push notifications and manage the configuration of the apps from a simple dashboard that sits in your WordPress admin dashboard. </li>\n<li><strong>Updates and Maintenance included</strong> &#8212; Ongoing maintenance of mobile apps costs businesses thousands per year. With MobiLoud it is all handled under our ongoing monthly or annual fees at a fraction of the cost. We&#8217;re there to assist you with any issues you might have with your app or changes you&#8217;d like to make. Stress free.</li>\n<li><strong>Synced with your site</strong> &#8212; You won&#8217;t need to add anything to your workflow, or allocate your team&#8217;s time to managing the apps. They&#8217;ll sync completely with your WordPress site and update with any new content, product or changes.</li>\n<li><strong>Integrate (almost) everything from your site</strong> &#8212; MobiLoud lets you leverage the whole ecosystem of WordPress plugins within your apps, and recreate the functionality and features you already built with no limiting templates.</li>\n<li><strong>Full featured</strong> &#8212; All MobiLoud apps come with unlimited push notifications as well as useful features like native sharing, app analytics, advertising integration, message centers, push preferences, and much more. </li>\n<li><strong>Native UX</strong> &#8212; News produces fully native mobile apps, with a native UX. Although Canvas is for building hybrid apps, the native tab bar and navigation added give the apps a native look and feel. </li>\n</ul>\n<h4>Which is Right for You?</h4>\n<p>Let&#8217;s take a look at the three platforms in a little more detail, so that you can see which is best for your business.</p>\n<h3>Canvas</h3>\n<p><a href=\"https://www.mobiloud.com/canvas\" rel=\"nofollow ugc\">Canvas</a> is perfect for community sites, startups, social platforms, deals sites, eLearning businesses, and in general any mobile optimized site based on WordPress.</p>\n<p>Canvas lets you build an app with all the plugins, themes, custom code you used to build your site.</p>\n<p>All other WordPress app builders force you into their themes and templates, and don&#8217;t let you fully leverage the flexibility of the WordPress platform like Canvas does.</p>\n<p>We&#8217;ve published hundreds of apps with Canvas, powered by sites running on WooCommerce, LearnDash, BuddyPress, BuddyBoss, PeepSo, and a wide range of other plugins and themes.</p>\n<p>Canvas gives you all the key advantages of native mobile apps like:</p>\n<ul>\n<li><strong>A Better Mobile UX</strong> &#8212; Your users can just tap once on their home screen and instantly open your app. When inside, the native navigation and tab menu provide a fast and intuitive experience.</li>\n<li><strong>More Loyalty and Engagement</strong> &#8212; Apps are great for driving loyalty and engagement. The icon on the home screen and push notifications are a constant reminder of your app &#8211; helping you to boost return visits, dwell time, and LTV. </li>\n<li><strong>Push Notifications</strong> &#8212; MobiLoud integrates with OneSignal, allowing you to send unlimited push notifications to iOS and Android devices right from your WordPress back-end. </li>\n<li><strong>An App Store Presence</strong> &#8212; A brand presence on the App Store and Google Play shows that you are serious about mobile user experience, and makes you look good in the eyes of potential users, partners and investors. </li>\n</ul>\n<h4>Canvas features</h4>\n<p>Canvas is packed with all the features you need to turn your site into great mobile apps. Let&#8217;s take a look at some of the key ones.</p>\n<ul>\n<li><strong>Native Tab Menu</strong> &#8212; The native tab menu is a key piece of your app. It makes the most important parts instantly accessible and gives a native experience to your users. </li>\n<li><strong>Native Navigation</strong> &#8212; iOS and Android users will be able to easily navigate through your app with a familiar native interface. </li>\n<li><strong>Message Center</strong> &#8212; Every push notification that your users receive will be accessed in the app&#8217;s message center so that they can explore them later. </li>\n<li><strong>Push Preferences</strong> &#8212; Your users can choose which kind of messages they want to receive. This improves their experience and makes your messages more impactful.</li>\n<li><strong>Customizable Splash Screen</strong> &#8212; Your users will see a branded splash screen while your apps load and get visual feedback with a loading indicator. </li>\n<li><strong>Configuration Dashboard</strong> &#8212; You can control everything about your app from a simple web interface. </li>\n<li><strong>Fully Customizable</strong> &#8212; Make the apps yours with a custom color scheme, logo and splash screen. Control every aspect of your app from our advanced JSON configuration if you know your way around code.</li>\n<li><strong>Automatic Rating Prompts</strong> &#8212; Gently nudge your users to review your app after they&#8217;ve used it for some time to help with your app marketing. </li>\n<li><strong>Firebase Analytics</strong> &#8212; With unlimited reporting and audience segmentation, Firebase will give you everything you need to understand your app users. </li>\n<li><strong>Handle External Links</strong> &#8212; Your app will be able to handle internal and external links, detecting the link tyle and either opening the device&#8217;s browser or keeping the user in-app</li>\n<li><strong>Code Editor</strong> &#8212; Inject any custom CSS to change how your pages are displayed in the app.</li>\n</ul>\n<p>In summary, Canvas is for you if you want apps that mirror your existing WordPress site&#8217;s features and functionality. Anything you can build for the web with WordPress, you can now have an app for too!</p>\n<h3>News</h3>\n<p><a href=\"https://www.mobiloud.com/wordpress-news-app\" rel=\"nofollow ugc\">News</a> is a custom app building service specifically designed for WordPress based digital publishers. Major publishing brands like Foreign Policy and Business Insider use News to provide a superior mobile user experience to their readers &#8211; and you can too!</p>\n<p>Our native mobile apps are the perfect channel for boosting audience loyalty, engaging readers with push notifications and generating revenue through ads or subscriptions.</p>\n<p>News is a premium software platform and a complete service to have news apps built and published for you. The apps will be just as good as those from major publishers and packed with all the features that a growing media organization needs.</p>\n<h4>How does News work?</h4>\n<p>We work with you and your team and build apps to your exact specification. We publish them to the App Stores, and handle all ongoing updates and maintenance for the lifetime of the apps.</p>\n<p>Working with MobiLoud instead of hiring an agency or your own app development team means saving tens, if not hundreds of thousands of dollars and months of work. On top of the time and cost savings, you get to leverage a platform years in development, used by hundreds of publishers worldwide, with all the features publishers needs in a native mobile app. And the platform keeps getting better with time!</p>\n<p>Need a custom app? Email us at <a href=\"mailto:&#x73;&#097;&#x6c;&#101;&#x73;&#064;&#109;&#x6f;&#098;&#x69;&#108;o&#x75;&#100;&#x2e;&#099;&#x6f;&#109;\" rel=\"nofollow ugc\">sales@mobiloud.com</a>.</p>\n<h4>How is News Different?</h4>\n<p>News is different from all the other app builder plugins on the market. Let&#8217;s look at how.</p>\n<ul>\n<li><strong>News apps are true native apps</strong> &#8212; Native apps are fast, feature-rich, and give the best possible user experience for your readers. They are the best opportunity for you to create a unique and custom app.</li>\n<li><strong>News isn&#8217;t just a tool, it&#8217;s a full service</strong> &#8212; Our team configure the apps to your specification, build them on our platform, help you to launch them on the App Store and Google Play, and handle all ongoing updates and maintenance</li>\n<li><strong>MobiLoud is designed specifically for digital publishers</strong> &#8211;No other mobile app solution gives you this level of integration with WordPress, your content and third party plugins. </li>\n<li><strong>News gives you everything you need to monetize</strong> &#8212; MobiLoud supports a number of mobile app specific advertising, analytics and membership solutions to give you all you need to monetize and grow your revenue through a new channel.</li>\n</ul>\n<h4>News Features</h4>\n<p>No matter what you use in your current monetization, engagement, and editorial stack &#8211; News can recreate that in mobile apps. Our platform powers apps from top publishers like Foreign Policy, Business Insider, Simple Flying &#8211; and many more.</p>\n<p>News has been specifically designed to give you all the features you need to make your app successful, drive more engagement and traffic and generate additional revenue from advertising and/or subscriptions.</p>\n<ul>\n<li><strong>Automatic content updates</strong> &#8212; Your mobile app updates without any work required. New content on your site is immediately visible in your app</li>\n<li><strong>Full customization of your mobile app&#8217;s style</strong> &#8212; It&#8217;s your mobile app, so it&#8217;s all about your brand. Add colors, your logo, customize the app menu and more</li>\n<li><strong>A mobile app that works on all major platforms</strong> &#8212; Guaranteed to work on iPhone, iPad, Android phones and tablets.</li>\n<li><strong>No-hassle publishing</strong> &#8212; MobiLoud gets your app published for you, on your own accounts, saving you tens of hours of work.</li>\n<li><strong>Effortless push notifications</strong> &#8212; Send push notifications to your app users for new content automatically with new content, or manually, as often as you want.</li>\n<li><strong>Mobile advertising and monetization</strong> &#8212; Make more money from your mobile traffic. Use banner ads, interstitials and native ads designed specifically for mobile apps.</li>\n<li><strong>Sell subscriptions or require a login</strong> &#8212; You can use in-app purchase to sell subscriptions and memberships within your app, or require a login for users to get access to premium content with an existing account.</li>\n<li><strong>Sell subscriptions to remove ads</strong> &#8212; Generate more revenue and improve your user&#8217;s experience by making it easy  &hellip;</li>\n</ul>\n",
        "installation": "<ol>\n<li><a href=\"https://www.mobiloud.com/demo/?ref=plugindesc\" rel=\"nofollow ugc\">Request a demo</a> or <a href=\"https://www.mobiloud.com/pricing/?ref=plugindesc\" rel=\"nofollow ugc\">sign up</a></li>\n<li>Go to WordPress Control Panel, click &#8220;Plugins&#8221;, then &#8220;Add New&#8221;</li>\n<li>Type in &#8220;MobiLoud&#8221; and click &#8220;Search Plugins&#8221;</li>\n<li>Click the &#8220;Install&#8221; button</li>\n<li>Click the &#8220;Activate Plugin&#8221; link</li>\n<li>Move to the &#8220;MobiLoud&#8221; section in the menu</li>\n<li>Done! Now you can start designing and testing your app</li>\n</ol>\n<h4>Any questions?</h4>\n<p>You can contact us at <a href=\"mailto:&#115;&#x75;&#112;p&#x6f;&#114;&#x74;&#x40;&#109;&#x6f;&#098;&#105;&#x6c;&#111;u&#x64;&#046;&#x63;&#x6f;&#109;\" rel=\"nofollow ugc\">support@mobiloud.com</a></p>\n",
        "faq": "\n<dt id='can%20i%20use%20everything%20from%20my%20existing%20wordpress%20site%20in%20the%20app%3F'>\nCan I use everything from my existing WordPress site in the app?\n</h4>\n<p>\n<p>If you use Canvas, you can indeed reuse everything from your site. All functionality coming from plugins, your theme, and custom development will work just the same in the iOS and Android apps. Whatever feature you want in the apps, just build it for the web and you&#8217;ll have it!</p>\n<p>For News, we have pre-built integrations with the most important and frequently used plugins and tools used by news publishers. Most plugins can easily be integrated with a few lines of code, sometimes more, [get in touch with our developers] (mailto:support@mobiloud.com)to learn more about how we can meet your specific needs.</p>\n</p>\n<dt id='are%20mobiloud%20apps%20native%20apps%3F'>\nAre MobiLoud apps native apps?\n</h4>\n<p>\n<p>News produces native apps that use your WordPress site as the back-end. Most UI elements are native, with some hybrid elements making customization and easy integration with WordPress possible. It&#8217;s the perfect blend of native and hybrid approaches, resulting in apps that feel 100% native, with the flexibility and speed of web development for customizations.</p>\n<p>Canvas creates hybrid apps that display your web application or website within a native &#8220;wrapper&#8221;. While the native format is ideal in the case of news &#8211; for many web apps <a href=\"https://www.mobiloud.com/blog/canvas-is-enough\" rel=\"nofollow ugc\">Canvas beats native development</a>.</p>\n</p>\n<dt id='should%20i%20download%20and%20install%20this%20plugin%3F'>\nShould I download and install this plugin?\n</h4>\n<p>\n<p>You should download and activate this plugin if you are a MobiLoud customer. To learn more about MobiLoud and start the process, <a href=\"https://www.mobiloud.com/demo/?ref=plugindesc\" rel=\"nofollow ugc\">book a demo</a></p>\n</p>\n<dt id='how%20is%20mobiloud%20different%20from%20apppresser%3F'>\nHow is MobiLoud different from AppPresser?\n</h4>\n<p>\n<p>MobiLoud and AppPresser are very different platforms. AppPresser is a template based DIY app-builder that creates hybrid apps that pull content from WordPress sites via APIs. You need to use AppPresser&#8217;s own theme and templates for the apps and will be able to use the plugins that they have pre-built integrations for. With AppPresser, it&#8217;s on you to customize your app.</p>\n<p>MobiLoud Canvas is different because we let you use all your existing plugins and themes in the apps and don&#8217;t restrict you with templates. Our native platform, News, is used to produce fast, native mobile apps you can customize from a simple dashboard in WordPress or with code.</p>\n<p>MobiLoud is also more of a service whereas AppPresser is more of a tool. We don&#8217;t leave you alone to build your apps, we help you build, test and publish them and we maintain them over time.</p>\n<p>Unlike AppPresser we offer a 60-day money back guarantee, so you can try our service with no risk! To read more about how MobiLoud Canvas compares to AppPresser, check <a href=\"https://www.mobiloud.com/help/knowledge-base/mobiloud-different-apppresser\" rel=\"nofollow ugc\">this article</a> out.</p>\n</p>\n<dt id='who%20is%20mobiloud%20for%3F'>\nWho is MobiLoud for?\n</h4>\n<p>\n<p><a href=\"https://www.mobiloud.com/?ref=plugindesc\" rel=\"nofollow ugc\">MobiLoud</a> is a mobile app development service for WordPress-based businesses.</p>\n<p>Canvas is ideal for all types of WordPress sites and is often used to build apps based on LearnDash, BuddyPress, PeepSo and BuddyBoss &#8211; as well as other directory, marketplace, eLearning, and social plugins. As long as it works well on mobile, Canvas can make it into an app!</p>\n<p>News is for professional WordPress-based digital publishers and high traffic blogs. News isn&#8217;t just an app builder for content sites &#8211; it&#8217;s a complete mobile platform that has been designed specifically to grow revenue, loyalty and engagement. With News you&#8217;ll have apps as good as an international publishing brand, access to premium ad networks to monetize, and features designed to boost audience engagement and retention. For an example of how News apps can work, check out <a href=\"https://www.mobiloud.com/customers/simple-flying\" rel=\"nofollow ugc\">Simple Flying</a>.</p>\n</p>\n<dt id='what%20is%20the%20process%20for%20building%20apps%20with%20mobiloud%3F'>\nWhat is the process for building apps with MobiLoud?\n</h4>\n<p>\n<p>The process starts with a demo call with one of our team. Then after signing up you&#8217;ll configure the app&#8217;s settings through the plugin. Our team will then build the apps, and in a week or so the apps will be ready for you to test on your own devices. When you are happy with the app features and performance, we prepare production binary files and submit and publish your apps on the App Store and Google Play. After a successful launch, we handle all the ongoing updates and maintenance on the apps, saving you thousands per year in developer fees.</p>\n</p>\n<dt id='what%20if%20my%20app%20is%20rejected%20by%20apple%3F'>\nWhat if my app is rejected by Apple?\n</h4>\n<p>\n<p>Although Apple&#8217;s criteria can seem strict, there is a very low chance that they will reject your apps. We have gone through the process more than 1000 times, and guarantee a successful submission. If they send the apps back for whatever reason, we work with them to make the necessary changes and keep working on it until they are live. In the unlikely event that we can&#8217;t reach a resolution, you&#8217;ll have a full refund.</p>\n</p>\n<dt id='do%20i%20need%20to%20know%20any%20coding%20or%20technical%20skills%3F'>\nDo I need to know any coding or technical skills?\n</h4>\n<p>\n<p>You do not need to be a developer to build great apps with our platform, but some familiarity with web technologies is advantageous. You&#8217;ll need to configure some settings and add visual assets in our dashboard, and set up the features you want to use in the apps. As the apps reflect your existing WordPress site though &#8211; you&#8217;ve done all the hard work already. Our team handles the more technical details of the app build for you, including the ongoing maintenance and updates. If you do have web developers on the team, you can use our code editor to style elements of the apps with custom CSS!</p>\n<p>Need help with custom development? Get in touch with our team at <a href=\"mailto:&#115;&#x75;&#112;p&#x6f;&#114;&#x74;&#x40;&#109;&#x6f;&#098;&#105;&#x6c;&#111;u&#x64;&#046;&#x63;&#x6f;&#109;\" rel=\"nofollow ugc\">support@mobiloud.com</a>, we can help.</p>\n</p>\n<dt id='how%20do%20push%20notifications%20work%3F'>\nHow do push notifications work?\n</h4>\n<p>\n<p>MobiLoud integrates with OneSignal, the best push provider on the market. You&#8217;ll be able to send unlimited push notifications right from your WordPress back-end, and configure them to go out automatically for new posts or send them manually whenever you see fit.</p>\n<p>You can also use OneSignal&#8217;s excellent documentation, dashboard and APIs to set up advanced push notification configurations &#8211; for example, to create onboarding flows or updating customers when their order status has changed.</p>\n</p>\n<dt id='how%20much%20time%20and%20effort%20will%20it%20take%20to%20manage%20the%20apps%3F'>\nHow much time and effort will it take to manage the apps?\n</h4>\n<p>\n<p>One of the great things about MobiLoud apps is that you need to put very little of your time into managing the apps. That&#8217;s because the apps will update automatically with any changes you make on your WordPress site, automatically &#8211; so there&#8217;s nothing to add to your team&#8217;s workflow. If you want to send push notifications or change the configuration of some aspect of the app, you can do so through the plugin and see your app immediately update with the changes.</p>\n<p>On the other hand, mobile apps do need to be maintained regularly. New phones come out, and Apple and Google also release frequent updates to their platforms. Keeping up with this is essential, and costs thousands of dollars per year in developer fees for many businesses. With MobiLoud, you&#8217;re covered. We handle all the necessary updates and maintenance work as part of the ongoing monthly or annual fees you pay.</p>\n</p>\n<dt id='how%20much%20does%20it%20cost%20to%20build%20mobile%20apps%20with%20mobiloud%3F'>\nHow much does it cost to build mobile apps with MobiLoud?\n</h4>\n<p>\n<p>We have different plans depending on the platform you want to use, and the scale of your app project. Learn more about our pricing <a href=\"https://www.mobiloud.com/pricing/?ref=plugindesc\" rel=\"nofollow ugc\">here</a>.</p>\n</p>\n<dt id='why%20do%20i%20have%20to%20pay%20a%20monthly%20fee%3F'>\nWhy do I have to pay a monthly fee?\n</h4>\n<p>\n<p>In short, there are two reasons why you pay a recurring fee. The first is to pay for the license that gives you access to our platform, the second is to get our technical support and maintenance service for updates and improvements (new app versions) that make sure your app works as it should on the latest iOS and Android versions, with security updates and other required SDK updates applied as needed. We provide a more engaged, hands on level of service than any other WordPress app builder platform.</p>\n</p>\n<dt id='can%20i%20modify%20the%20app%27s%20code%3F'>\nCan I modify the app&#8217;s code?\n</h4>\n<p>\n<p>Yes you can. Our code editor allows you to inject custom CSS into the app to style most of its elements. We occasionally offer a source code license to modify the app&#8217;s native platform code, but this is rarely needed for customizations. Get in touch with us at <a href=\"mailto:&#115;&#x75;&#112;p&#x6f;&#114;&#x74;&#x40;&#109;&#x6f;&#098;&#105;&#x6c;&#111;u&#x64;&#046;&#x63;&#x6f;&#109;\" rel=\"nofollow ugc\">support@mobiloud.com</a> to know more.</p>\n</p>\n<dt id='how%20do%20i%20know%20which%20is%20right%20for%20me%20-%20news%20or%20canvas%3F'>\nHow do I know which is right for me &#8211; News or Canvas?\n</h4>\n<p>\n<p>If you&#8217;re a publisher, News is likely for you. For anything else &#8211; Canvas likely has you covered. To find out for sure <a href=\"https://www.mobiloud.com/demo/?ref=plugindesc\" rel=\"nofollow ugc\">book a free demo with one of our team</a></p>\n</p>\n<dt id='can%20i%20see%20some%20examples%20of%20mobiloud%20apps%3F'>\nCan I see some examples of MobiLoud apps?\n</h4>\n<p>\n<p>Yes, we&#8217;ve written about some client&#8217;s apps &#8211; <a href=\"https://www.mobiloud.com/customers\" rel=\"nofollow ugc\">check them out!</a></p>\n</p>\n<dt id='what%27s%20the%20risk%3F'>\nWhat&#8217;s the risk?\n</h4>\n<p>\n<p>There is no risk on your part, for two main reasons. Firstly, we do not have any long-term contracts so you can cancel any time. Secondly, we offer a 60-day guarantee. If you are not happy with the apps for whatever reason you can cancel and receive a full refund.</p>\n</p>\n<dt id='what%20are%20the%20terms%20and%20conditions%3F'>\nWhat are the Terms and Conditions?\n</h4>\n<p>\n<p>Here are our <a href=\"https://www.mobiloud.com/terms/?ref=plugindesc\" rel=\"nofollow ugc\">Terms and Conditions</a> and <a href=\"https://www.mobiloud.com/privacy/?ref=plugindesc\" rel=\"nofollow ugc\">Privacy Policy</a>.</p>\n</p>\n<dt id='where%20are%20you%20based%3F'>\nWhere are you based?\n</h4>\n<p>\n<p>We&#8217;re a global company with a remote team and our base in London, UK. MobiLoud is a trading name of Fifty Pixels Ltd. We have a distributed team of developers and designers and a support team ready to answer any questions at <a href=\"mailto:&#115;&#x75;&#112;p&#x6f;&#114;&#x74;&#x40;&#109;&#x6f;&#098;&#105;&#x6c;&#111;u&#x64;&#046;&#x63;&#x6f;&#109;\" rel=\"nofollow ugc\">support@mobiloud.com</a>.</p>\n</p>\n<dt id='can%20i%20contact%20you%20over%20the%20phone%3F'>\nCan I contact you over the phone?\n</h4>\n<p>\n<p>Yes, you can call +1 347 903 7892 at any time of the day. Most of our team is available 9-5 Eastern time.</p>\n</p>\n<dt id='any%20questions%3F'>\nAny questions?\n</h4>\n<p>\n<p>You can contact us at <a href=\"mailto:&#115;&#x75;&#112;p&#x6f;&#114;&#x74;&#x40;&#109;&#x6f;&#098;&#105;&#x6c;&#111;u&#x64;&#046;&#x63;&#x6f;&#109;\" rel=\"nofollow ugc\">support@mobiloud.com</a></p>\n</p>\n\n",
        "changelog": "<h4>4.6</h4>\n<ul>\n<li>Added improvements to the onboarding screen</li>\n</ul>\n<h4>4.5</h4>\n<ul>\n<li>Fixed issue with push notification logs</li>\n</ul>\n<h4>4.4.8</h4>\n<ul>\n<li>Fixed one signal api response issue</li>\n</ul>\n<h4>4.4.7</h4>\n<ul>\n<li>Fixes compatibility issues with PHP 8.2</li>\n</ul>\n<h4>4.4.6</h4>\n<ul>\n<li>Adds support for WordPress 6.3</li>\n<li>Removes code related to Intercom</li>\n</ul>\n<h4>4.4.5</h4>\n<ul>\n<li>Adds editor for HTML inside home list HEAD tag</li>\n<li>Adds pull to refresh in the lists endpoint</li>\n<li>Fixes load more spinner in the posts endpoint</li>\n<li>Fixes issue with fetching posts in the list endpoint</li>\n</ul>\n<h4>4.4.4</h4>\n<ul>\n<li>Fixes responsives for admin settings</li>\n<li>Fixes Dark mode logo setting</li>\n<li>Fixes Paywall setting per post</li>\n<li>Fixes comments UI</li>\n<li>Fixes HTML entities in push notifications</li>\n<li>Adds editor theme support for App Lists and App pages</li>\n<li>Adds setting to always perform a new request in order to pull the latest content</li>\n<li>Adds support for Leaky Paywall</li>\n<li>Adds default template support for <code>posts</code> endpoint</li>\n<li>Adds support to override the <code>list.php</code> template</li>\n<li>Changes name from <code>default-templates</code> to <code>mobiloud-news-templates</code></li>\n</ul>\n<h4>4.4.3</h4>\n<ul>\n<li>Fixes a problem with automatic notifications not saving</li>\n<li>Fixes a problem with home screen posts not selecting</li>\n</ul>\n<h4>4.4.2</h4>\n<ul>\n<li>Fix App Lists error</li>\n<li>Fix live preview</li>\n</ul>\n<h4>4.4.1</h4>\n<ul>\n<li>Fixes Setup Wizard Form bugs</li>\n<li>Improves admin settings UI</li>\n<li>Fixes console errors</li>\n<li>Adds support for multisites</li>\n</ul>\n<h4>4.4</h4>\n<ul>\n<li>Adds App Lists and App Pages</li>\n<li>Adds new templating system</li>\n<li>Improves design settings</li>\n</ul>\n<h4>4.3.3.1</h4>\n<ul>\n<li>Fixes a problem with the lists</li>\n</ul>\n<h4>4.3.3</h4>\n<ul>\n<li>Adds support for Dark Mode</li>\n</ul>\n<h4>4.3.2</h4>\n<ul>\n<li>Bug fixes and improvements to plugin code</li>\n</ul>\n<h4>4.3.1</h4>\n<ul>\n<li>Adds new editor section &#8216;HTML before the home list&#8217;</li>\n<li>Adds filter to modify the main query</li>\n</ul>\n<h4>4.3</h4>\n<ul>\n<li>Adds support for dark mode</li>\n<li>Adds support for post swipe</li>\n<li>Fixes a problem with favorites when used along with sticky posts</li>\n</ul>\n<h4>4.2.7.1</h4>\n<ul>\n<li>Fixes a problem with related posts</li>\n</ul>\n<h4>4.2.7</h4>\n<ul>\n<li>Adds new options for displaying ads between paragraphs in the content</li>\n<li>Adds new logic for embedded pages CSS</li>\n<li>Improves related posts</li>\n</ul>\n<h4>4.2.6.1</h4>\n<ul>\n<li>Fixes a bug in lists introduced in version 4.2.6</li>\n</ul>\n<h4>4.2.6</h4>\n<ul>\n<li>Adds settings for caching</li>\n</ul>\n<h4>4.2.5</h4>\n<ul>\n<li>Activation screen enhancements</li>\n</ul>\n<h4>4.2.4</h4>\n<ul>\n<li>Fixes a problem with the menu settings</li>\n</ul>\n<h4>4.2.3</h4>\n<ul>\n<li>Improves support for DFP ads in lists</li>\n</ul>\n<h4>4.2.2</h4>\n<ul>\n<li>Fixes a problem with published time of posts in lists</li>\n<li>Fixes a problem with featured images flickering while loading</li>\n</ul>\n<h4>4.2.1</h4>\n<ul>\n<li>Fixes a bug in the code editor</li>\n</ul>\n<h4>4.2.0</h4>\n<ul>\n<li>Improvements to plugin settings</li>\n</ul>\n<h4>4.1.1</h4>\n<ul>\n<li>Improvements to plugin settings</li>\n</ul>\n<h4>4.1.0</h4>\n<ul>\n<li>Adds WordPress 5.4 support</li>\n</ul>\n<h4>4.0.9</h4>\n<ul>\n<li>Fixes a bug in the comments</li>\n</ul>\n<h4>4.0.8</h4>\n<ul>\n<li>Fixes a bug in the integration with Disqus</li>\n</ul>\n<h4>4.0.7</h4>\n<ul>\n<li>Fixes a bug in the menu area</li>\n</ul>\n<h4>4.0.6</h4>\n<ul>\n<li>Fixes article list styles problem and improves performance on single article screens</li>\n</ul>\n<h4>4.0.5</h4>\n<ul>\n<li>Fixes problem with styling on single article screens</li>\n</ul>\n<h4>4.0.4</h4>\n<ul>\n<li>Further securiy enhancements</li>\n<li>Ajax comments</li>\n</ul>\n<h4>4.0.3</h4>\n<ul>\n<li>Securiy enhancements</li>\n</ul>\n<h4>4.0.2</h4>\n<ul>\n<li>Bug fixes, security updates and enhancements</li>\n</ul>\n<h4>4.0.1</h4>\n<ul>\n<li>Fixes a bug in the notifications area</li>\n<li>Fixes PHP warnings</li>\n<li>Minor changes in admin screens</li>\n</ul>\n<h4>4.0.0</h4>\n<ul>\n<li>Changes in admin screens</li>\n<li>Improvements to plugin code</li>\n<li>New endpoints</li>\n</ul>\n<h4>3.8.8</h4>\n<ul>\n<li>Minor improvements to plugin code</li>\n</ul>\n<h4>3.8.7</h4>\n<ul>\n<li>Minor improvements to plugin code</li>\n</ul>\n<h4>3.8.6</h4>\n<ul>\n<li>Minor changes in admin screens</li>\n</ul>\n<h4>3.8.5</h4>\n<ul>\n<li>Fixes a bug affecting the Menu and Editor tabs</li>\n</ul>\n<h4>3.8.4</h4>\n<ul>\n<li>Minor changes and fixes</li>\n</ul>\n<h4>3.8.3</h4>\n<ul>\n<li>Minor changes to the plugin admin interface</li>\n</ul>\n<h4>3.8.2</h4>\n<ul>\n<li>Minor changes to the plugin admin interface</li>\n</ul>\n<h4>3.8.1</h4>\n<ul>\n<li>Minor changes to the plugin admin interface</li>\n</ul>\n<h4>3.8.0</h4>\n<ul>\n<li>Adds support for Admob Native Ads Advanced</li>\n</ul>\n<h4>3.7.9</h4>\n<ul>\n<li>Adds support for welcome screen</li>\n</ul>\n<h4>3.7.8</h4>\n<ul>\n<li>Fixes issue with PushBots notifications not including tags</li>\n<li>Fixes PushBots notification icon</li>\n</ul>\n<h4>3.7.7</h4>\n<ul>\n<li>Fixes issue causing iOS apps to crash</li>\n</ul>\n<h4>3.7.6</h4>\n<ul>\n<li>Adds related posts feature</li>\n<li>Adds support for paid app subscriptions</li>\n</ul>\n<h4>3.7.5</h4>\n<ul>\n<li>Adds improvements for caching functionality</li>\n<li>Adds flush cache button to the settings</li>\n<li>Adds a setting to include the post featured image in push notifications</li>\n</ul>\n<h4>3.7.4</h4>\n<ul>\n<li>Adds settings for Google DFP native ads</li>\n<li>Adds support for sending notifications to sub-categories when a main category is enabled</li>\n<li>Adds a setting to disable notices at the endpoint and prevent errors in the app</li>\n</ul>\n<h4>3.7.3</h4>\n<ul>\n<li>Adds improvements to OneSignal iOS notifications</li>\n</ul>\n<h4>3.7.2</h4>\n<ul>\n<li>Adds ajax loading for menu, settings and push tabs items</li>\n<li>Adds comScore integration settings</li>\n<li>Adds rating prompt settings</li>\n<li>Adds usability improvements to the category list in the settings</li>\n<li>Fixes a problem with indentation on replies</li>\n<li>Fixes time on comments</li>\n</ul>\n<h4>3.7.1</h4>\n<ul>\n<li>Adds indentation to replies in the app comments</li>\n<li>Adds improved confirmation when saving settings</li>\n</ul>\n<h4>3.7.0</h4>\n<ul>\n<li>Adds tabbed navigation to advertising settings</li>\n<li>Adds Facebook Audience Network integration Settings</li>\n<li>Adds limit to the interval between Ads in the article list</li>\n<li>Fixes text in the sidebar</li>\n</ul>\n<h4>3.6.9</h4>\n<ul>\n<li>Adds pre-fill for menu items and design settings</li>\n<li>Fixes problems with admin alerts positioning</li>\n<li>Fixes a OneSignal issue when the number of registered devices is higher than 100.000</li>\n<li>Fixes conflict with Nginx Cache and WP Rocket</li>\n</ul>\n<h4>3.6.8</h4>\n<ul>\n<li>Adds improvements to the app CSS loading</li>\n<li>Adds Quantcast Measure integration</li>\n<li>Adds a feature to restric searches for specific categories and post types in the app</li>\n<li>Fixes instructions for Google Analytics integration</li>\n</ul>\n<h4>3.6.7</h4>\n<ul>\n<li>Adds plugin version to JS and CSS files</li>\n<li>Fixes link to simulator</li>\n<li>Fixes metabox position</li>\n<li>Fixes spelling mistake</li>\n</ul>\n<h4>3.6.6</h4>\n<ul>\n<li>Adds new design to the settings</li>\n<li>Fixes a bug in push notifications</li>\n</ul>\n<h4>3.6.5</h4>\n<ul>\n<li>Fixes automatic push notifications</li>\n<li>Fixes push notifications for taxonomies without query_var</li>\n</ul>\n<h4>3.6.4</h4>\n<ul>\n<li>Adds support for WordPress 4.8</li>\n</ul>\n<h4>3.6.3</h4>\n<ul>\n<li>Fixes a bug with OneSignal where no image was being displayed in the push notification</li>\n<li>Adds OneSignal additional parameters for Android push notifications</li>\n</ul>\n<h4>3.6.2</h4>\n<ul>\n<li>Fixes a bug introduced in the last update</li>\n</ul>\n<h4>3.6.1</h4>\n<ul>\n<li>Improvements to OneSignal support</li>\n<li>Fixes a bug with posts list with Groups</li>\n</ul>\n<h4>3.6</h4>\n<ul>\n<li>Adds support for sending push notifications using OneSignal</li>\n<li>Adds an option to configure the cache expiration time</li>\n</ul>\n<h4>3.5.2</h4>\n<ul>\n<li>Fixes a bug introduced in the last update</li>\n</ul>\n<h4>3.5.1</h4>\n<ul>\n<li>Fixes and improvements to the internal caching functionality</li>\n<li>Improves support for server-side caching</li>\n<li>Bug-fix for Disqus comments</li>\n<li>Improvements to the display of images and captions within content</li>\n<li>Automatic notifications for custom taxonomies</li>\n<li>Adds options to send broadcast notifications with no categories (speed up delivery)</li>\n</ul>\n<h4>3.5</h4>\n<ul>\n<li>Now you can change the rate at which push notifications are sent out</li>\n<li>Allow non-admin users, like editors and writers, access to the Push Notifications page</li>\n<li>Fixes an issue affecting some New Relic users</li>\n</ul>\n<h4>3.4.8</h4>\n<ul>\n<li>Fixes a remaining edge case where push device counts would show zero devices</li>\n<li>Minor changes in the design &#8211; you&#8217;ll note some of the Home Screen settings are now in the Settings section</li>\n<li>Changes a parameter causing occasional long delays for push notifications on very popular apps</li>\n</ul>\n<h4>3.4.7</h4>\n<ul>\n<li>Fixes an intermittent issue with push device counts showing zero devices</li>\n<li>Adds an option to change the number of posts returned with every request for content (in the main list and categories)</li>\n<li>Adds support for new Admob ad formats</li>\n<li>Adds an option to disable frontend markers inserted from Really Simple SSL (they break the content feed for the app)</li>\n<li>Improves the rendering of excerpts in the app, making sure no leading space or shortcode is visible</li>\n<li>Unusued shortcodes are now removed by default &#8211; this can be overridden in the Settings</li>\n</ul>\n<h4>3.4.6</h4>\n<ul>\n<li>Adds an option to remove unused shortcodes</li>\n<li>Fixes a bug that kept empty categories checked in the article list options even when you unchecked them</li>\n<li>Minor fixes and improvements</li>\n</ul>\n<h4>3.4.5</h4>\n<ul>\n<li>Minor fixes and improvements</li>\n</ul>\n<h4>3.4.4</h4>\n<ul>\n<li>Fixes a bug with the push badge forgetting how to count. Now it should behave!</li>\n</ul>\n<h4>3.4.3</h4>\n<ul>\n<li>Fixes an issue with HTML entities not being parsed correctly in excerpts</li>\n</ul>\n<h4>3.4.2</h4>\n<ul>\n<li>Disables internal caching by default</li>\n<li>Adds a switch in configuration to enable/disable caching</li>\n</ul>\n<h4>3.4.1</h4>\n<ul>\n<li>Fixes an issue with excerpts fields causing issues on iOS</li>\n<li>Fixes content encoding issues</li>\n<li>Makes the plugin caching features optional</li>\n</ul>\n<h4>3.4</h4>\n<ul>\n<li>Fixes an issue where internal links return a list of posts rather than a single post</li>\n<li>Fixes a bug with Disqus comments</li>\n<li>Other minor improvements</li>\n</ul>\n<h4>3.3.9</h4>\n<ul>\n<li>Fixes a bug with internal links returning a list rather than a single post</li>\n<li>Adds an option to disable internal links detection and open all links in the browser</li>\n</ul>\n<h4>3.3.8</h4>\n<ul>\n<li>Fixes a bug within the license page</li>\n</ul>\n<h4>3.3.7</h4>\n<ul>\n<li>Fixes a bug with internal links accessed within the app</li>\n<li>Fixes a bug with featured image settings</li>\n</ul>\n<h4>3.3.6</h4>\n<ul>\n<li>Improved automatic push feature to reduce resource usage</li>\n</ul>\n<h4>3.3.5</h4>\n<ul>\n<li>Support for WordPress 4.5</li>\n</ul>\n<h4>3.3.4</h4>\n<ul>\n<li>v2 API endpoints for new mobile apps</li>\n<li>Changes on featured image size options for list and articles</li>\n<li>Other bug fixes and UI improvements</li>\n</ul>\n<h4>3.3.3</h4>\n<ul>\n<li>Request caching reducing access to database</li>\n<li>Fixes for sticky categories, character encoding issues</li>\n<li>Other bug fixes and UI improvementse Push Notifications page</li>\n<li>Fixes an issue affecting some New Relic users</li>\n</ul>\n<h4>3.4.8</h4>\n<ul>\n<li>Fixes a remaining edge case where push device counts would show zero devices</li>\n<li>Minor changes in the design &#8211; you&#8217;ll note some of the Home Screen settings are now in the Settings section</li>\n<li>Changes a parameter causing occasional long delays for push notifications on very popular apps</li>\n</ul>\n<h4>3.4.7</h4>\n<ul>\n<li>Fixes an intermittent issue with push device counts showing zero devices</li>\n<li>Adds an option to change the number of posts returned with every request for content (in the main list and categories)</li>\n<li>Adds support for new Admob ad formats</li>\n<li>Adds an option to disable frontend markers inserted from Really Simple SSL (they break the content feed for the app)</li>\n<li>Improves the rendering of excerpts in the app, making sure no leading space or shortcode is visible</li>\n<li>Unusued shortcodes are now removed by default &#8211; this can be overridden in the Settings</li>\n</ul>\n<h4>3.4.6</h4>\n<ul>\n<li>Adds an option to remove unused shortcodes</li>\n<li>Fixes a bug that kept empty categories checked in the article list options even when you unchecked them</li>\n<li>Minor fixes and improvements</li>\n</ul>\n<h4>3.4.5</h4>\n<ul>\n<li>Minor fixes and improvements</li>\n</ul>\n<h4>3.4.4</h4>\n<ul>\n<li>Fixes a bug with the push badge forgetting how to count. Now it should behave!</li>\n</ul>\n<h4>3.4.3</h4>\n<ul>\n<li>Fixes an issue with HTML entities not being parsed correctly in excerpts</li>\n</ul>\n<h4>3.4.2</h4>\n<ul>\n<li>Disables internal caching by default</li>\n<li>Adds a switch in configuration to enable/disable caching</li>\n</ul>\n<h4>3.4.1</h4>\n<ul>\n<li>Fixes an issue with excerpts fields causing issues on iOS</li>\n<li>Fixes content encoding issues</li>\n<li>Makes the plugin caching features optional</li>\n</ul>\n<h4>3.4</h4>\n<ul>\n<li>Fixes an issue where internal links return a list of posts rather than a single post</li>\n<li>Fixes a bug with Disqus comments</li>\n<li>Other minor improvements</li>\n</ul>\n"
    },
    "short_description": "The best way to build native mobile apps for iOS and Android from your WordPress site.",
    "description": "<p><strong><a href=\"https://www.mobiloud.com?ref=plugindesc\" rel=\"nofollow ugc\">MobiLoud</a> lets you turn your WordPress site into mobile apps for iOS and Android that require no work to maintain.</strong></p>\n<p><em>Install the <a href=\"https://www.mobiloud.com/wordpress-mobile-app\" rel=\"nofollow ugc\">MobiLoud mobile app plugin</a> and get a free preview of your app in 30 seconds.</em></p>\n<h4>What is MobiLoud?</h4>\n<p><a href=\"https://www.mobiloud.com/wordpress-mobile-app\" rel=\"nofollow ugc\">MobiLoud</a> makes it easy to convert any WordPress site into native mobile apps for iOS and Android that automatically update with your website. You also get to work with a team of experts handling everything related to your app for you.</p>\n<p>With <a href=\"https://www.mobiloud.com/wordpress-mobile-app\" rel=\"nofollow ugc\">MobiLoud</a> you just need to maintain your responsive mobile WordPress website and your app always stays in sync with no additional maintenance required.</p>\n<p>MobiLoud is the perfect solution for news publishers and ecommerce brands looking for a way to launch native mobile apps for their loyal customers without adding to their workload or spending $100K+ to develop an app from scratch.</p>\n<p>Some of our news clients include Euractiv, Canada&#8217;s National Observer, Sports Mockery, and Business Insider. We also work with large ecommerce brands like buybuyBaby, Estee Lauder, and John Varvatos to build premium ecommerce mobile apps that automatically update with everything on their sites.</p>\n<p>Install the <a href=\"https://www.mobiloud.com/wordpress-mobile-app\" rel=\"nofollow ugc\">MobiLoud mobile app plugin</a> and get a free preview of your app in 30 seconds.</p>\n<p>Here&#8217;s what you get when you build a mobile app for your WordPress site with <a href=\"https://www.mobiloud.com/wordpress-mobile-app\" rel=\"nofollow ugc\">MobiLoud</a>:</p>\n<ul>\n<li>Everything on your website works instantly in your app so you don&#8217;t have to manage a separate channel</li>\n<li>All themes, custom code, and any other features specific to your site work out of the box</li>\n<li>Your important plugins , including WooCommerce and BuddyPress, work seamlessly</li>\n<li>Provide a native app user experience with a native tab menu, native navigation elements, and native animations</li>\n<li>A fully managed service with a team of experts handling the app build, testing, and submission process for you</li>\n<li>Send unlimited, free push notifications to better engage with your most loyal users</li>\n<li>Get an app store presence and unlock a new acquisition channel for your brand</li>\n<li>Make it easy for users to hop back in with one-tap access to your publication, community, or ecommerce store</li>\n<li>Create app-only experiences with our advanced developer tools to make CSS changes to your existing theme or use a completely separate theme for your app</li>\n</ul>\n<p>&#8212;</p>\n<h3>Our customers love working with us:</h3>\n<p>&#8220;We couldn’t find another company that could offer the same features at the same price point, same time to market, and make it as easy as MobiLoud could.&#8221;</p>\n<p><strong>Svend Hansen, Product Owner, BESTSELLER</strong></p>\n<p>&#8220;If you&#8217;re set up on WordPress and you&#8217;re serious about WordPress – MobiLoud really gets WordPress. They can really be there for you in whatever capacity you need them to be for your team&#8221;</p>\n<p><strong>Adam Griffiths, Product Manager, Foreign Policy</strong></p>\n<p>&#8220;I wanted an easy option to literally convert my WordPress website into an app. After doing my research, MobiLoud was the one that stood out in terms of price and quality of service. If you already have a good mobile site, I don&#8217;t see the benefit of rebuilding an app from scratch when MobiLoud can get the job done.&#8221;</p>\n<p><strong>Arran Rice, Founder, Simply Flying</strong></p>\n<p>&#8220;Your level of service is unmatched. You are always there when we need you, and go above and beyond to make sure everything runs smoothly for us.”</p>\n<p><strong>Kenneth Chan, Founder &amp; CEO, TOBI</strong></p>\n<p>&#8220;My team is thrilled because we have functioning apps that require almost no effort on our part, to build or maintain. It is a brilliant solution.&#8221;</p>\n<p><strong>David Cost, VP of Ecommerce &amp; Marketing, Rainbow Shops</strong></p>\n<p>“Not only do MobiLoud have great support, but they&#8217;ve really come a long way with their technology. The ability to quickly configure your options and keep a lot of flexibility between WordPress and your mobile app is really a one of a kind experience”</p>\n<p><strong>Chris Burhans, CEO, Sports Mockery</strong></p>\n<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/354094380\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/354094639\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/332400724\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p><a href=\"https://www.mobiloud.com/reviews/?ref=plugindesc\" rel=\"nofollow ugc\">Read more reviews at MobiLoud.com</a></p>\n<p>&#8212;</p>\n<h4>How Does it Work?</h4>\n<p>We have two platforms &#8211; <a href=\"https://www.mobiloud.com/wordpress-news-app\" rel=\"nofollow ugc\">News</a>, and <a href=\"https://www.mobiloud.com/canvas\" rel=\"nofollow ugc\">Canvas</a>.</p>\n<ul>\n<li><strong>News</strong> for WordPress-based news sites, blogs, magazines, online newspapers, digital publishers and larger media organizations. News lets you build fully featured content apps like those from top publishers like the New York Times or the Wall Street Journal. If you&#8217;re a publisher, run a news site or blog built on WordPress, nothing can compete with native mobile apps for boosting loyalty, engagement and revenue on mobile. </li>\n<li><strong>Canvas</strong> for building hybrid iOS and Android apps from any WordPress site. Canvas lets you build apps with WordPress using your existing theme, all your plugins and site features: everything will work straight out of the box. Canvas is ideal for ecommerce stores, marketplaces, deals sites, directories, communities, and eLearning sites. It&#8217;s ideal for sites built with BuddyPress, BuddyBoss, Peepso, Learndash and many other platforms. WooCommerce websites can also easily be turned into native mobile apps using MobiLoud Canvas. </li>\n</ul>\n<h4>What Do They Have in Common?</h4>\n<p>Although News and Canvas work differently, they all have some key factors in common.</p>\n<ul>\n<li><strong>Simple, fast</strong> &#8212; You&#8217;ll be ready to launch in just weeks, and won&#8217;t need to touch a line of code &#8211; if you don&#8217;t want  to &#8211; while allowing plenty of customization and opportunities to get hands-on with the code for developers and agencies. </li>\n<li><strong>Full service</strong> &#8212; Our team can handle all the technical tasks necessary to get your app live. You can rely on our experts to completely configure the app for you (read more about our Full Service Package).</li>\n<li><strong>No risk guarantee</strong> &#8212; MobiLoud has no long term contracts, and we offer a 60-day guarantee with a full refund if you are not happy with the apps for any reason. We also offer an approval guarantee i.e. if your app is not approved by Apple and Google you can cancel the project and have your money back.</li>\n<li><strong>Manage the apps through WordPress</strong> &#8212; You can send push notifications and manage the configuration of the apps from a simple dashboard that sits in your WordPress admin dashboard. </li>\n<li><strong>Updates and Maintenance included</strong> &#8212; Ongoing maintenance of mobile apps costs businesses thousands per year. With MobiLoud it is all handled under our ongoing monthly or annual fees at a fraction of the cost. We&#8217;re there to assist you with any issues you might have with your app or changes you&#8217;d like to make. Stress free.</li>\n<li><strong>Synced with your site</strong> &#8212; You won&#8217;t need to add anything to your workflow, or allocate your team&#8217;s time to managing the apps. They&#8217;ll sync completely with your WordPress site and update with any new content, product or changes.</li>\n<li><strong>Integrate (almost) everything from your site</strong> &#8212; MobiLoud lets you leverage the whole ecosystem of WordPress plugins within your apps, and recreate the functionality and features you already built with no limiting templates.</li>\n<li><strong>Full featured</strong> &#8212; All MobiLoud apps come with unlimited push notifications as well as useful features like native sharing, app analytics, advertising integration, message centers, push preferences, and much more. </li>\n<li><strong>Native UX</strong> &#8212; News produces fully native mobile apps, with a native UX. Although Canvas is for building hybrid apps, the native tab bar and navigation added give the apps a native look and feel. </li>\n</ul>\n<h4>Which is Right for You?</h4>\n<p>Let&#8217;s take a look at the three platforms in a little more detail, so that you can see which is best for your business.</p>\n<h3>Canvas</h3>\n<p><a href=\"https://www.mobiloud.com/canvas\" rel=\"nofollow ugc\">Canvas</a> is perfect for community sites, startups, social platforms, deals sites, eLearning businesses, and in general any mobile optimized site based on WordPress.</p>\n<p>Canvas lets you build an app with all the plugins, themes, custom code you used to build your site.</p>\n<p>All other WordPress app builders force you into their themes and templates, and don&#8217;t let you fully leverage the flexibility of the WordPress platform like Canvas does.</p>\n<p>We&#8217;ve published hundreds of apps with Canvas, powered by sites running on WooCommerce, LearnDash, BuddyPress, BuddyBoss, PeepSo, and a wide range of other plugins and themes.</p>\n<p>Canvas gives you all the key advantages of native mobile apps like:</p>\n<ul>\n<li><strong>A Better Mobile UX</strong> &#8212; Your users can just tap once on their home screen and instantly open your app. When inside, the native navigation and tab menu provide a fast and intuitive experience.</li>\n<li><strong>More Loyalty and Engagement</strong> &#8212; Apps are great for driving loyalty and engagement. The icon on the home screen and push notifications are a constant reminder of your app &#8211; helping you to boost return visits, dwell time, and LTV. </li>\n<li><strong>Push Notifications</strong> &#8212; MobiLoud integrates with OneSignal, allowing you to send unlimited push notifications to iOS and Android devices right from your WordPress back-end. </li>\n<li><strong>An App Store Presence</strong> &#8212; A brand presence on the App Store and Google Play shows that you are serious about mobile user experience, and makes you look good in the eyes of potential users, partners and investors. </li>\n</ul>\n<h4>Canvas features</h4>\n<p>Canvas is packed with all the features you need to turn your site into great mobile apps. Let&#8217;s take a look at some of the key ones.</p>\n<ul>\n<li><strong>Native Tab Menu</strong> &#8212; The native tab menu is a key piece of your app. It makes the most important parts instantly accessible and gives a native experience to your users. </li>\n<li><strong>Native Navigation</strong> &#8212; iOS and Android users will be able to easily navigate through your app with a familiar native interface. </li>\n<li><strong>Message Center</strong> &#8212; Every push notification that your users receive will be accessed in the app&#8217;s message center so that they can explore them later. </li>\n<li><strong>Push Preferences</strong> &#8212; Your users can choose which kind of messages they want to receive. This improves their experience and makes your messages more impactful.</li>\n<li><strong>Customizable Splash Screen</strong> &#8212; Your users will see a branded splash screen while your apps load and get visual feedback with a loading indicator. </li>\n<li><strong>Configuration Dashboard</strong> &#8212; You can control everything about your app from a simple web interface. </li>\n<li><strong>Fully Customizable</strong> &#8212; Make the apps yours with a custom color scheme, logo and splash screen. Control every aspect of your app from our advanced JSON configuration if you know your way around code.</li>\n<li><strong>Automatic Rating Prompts</strong> &#8212; Gently nudge your users to review your app after they&#8217;ve used it for some time to help with your app marketing. </li>\n<li><strong>Firebase Analytics</strong> &#8212; With unlimited reporting and audience segmentation, Firebase will give you everything you need to understand your app users. </li>\n<li><strong>Handle External Links</strong> &#8212; Your app will be able to handle internal and external links, detecting the link tyle and either opening the device&#8217;s browser or keeping the user in-app</li>\n<li><strong>Code Editor</strong> &#8212; Inject any custom CSS to change how your pages are displayed in the app.</li>\n</ul>\n<p>In summary, Canvas is for you if you want apps that mirror your existing WordPress site&#8217;s features and functionality. Anything you can build for the web with WordPress, you can now have an app for too!</p>\n<h3>News</h3>\n<p><a href=\"https://www.mobiloud.com/wordpress-news-app\" rel=\"nofollow ugc\">News</a> is a custom app building service specifically designed for WordPress based digital publishers. Major publishing brands like Foreign Policy and Business Insider use News to provide a superior mobile user experience to their readers &#8211; and you can too!</p>\n<p>Our native mobile apps are the perfect channel for boosting audience loyalty, engaging readers with push notifications and generating revenue through ads or subscriptions.</p>\n<p>News is a premium software platform and a complete service to have news apps built and published for you. The apps will be just as good as those from major publishers and packed with all the features that a growing media organization needs.</p>\n<h4>How does News work?</h4>\n<p>We work with you and your team and build apps to your exact specification. We publish them to the App Stores, and handle all ongoing updates and maintenance for the lifetime of the apps.</p>\n<p>Working with MobiLoud instead of hiring an agency or your own app development team means saving tens, if not hundreds of thousands of dollars and months of work. On top of the time and cost savings, you get to leverage a platform years in development, used by hundreds of publishers worldwide, with all the features publishers needs in a native mobile app. And the platform keeps getting better with time!</p>\n<p>Need a custom app? Email us at <a href=\"mailto:&#x73;&#097;&#x6c;&#101;&#x73;&#064;&#109;&#x6f;&#098;&#x69;&#108;o&#x75;&#100;&#x2e;&#099;&#x6f;&#109;\" rel=\"nofollow ugc\">sales@mobiloud.com</a>.</p>\n<h4>How is News Different?</h4>\n<p>News is different from all the other app builder plugins on the market. Let&#8217;s look at how.</p>\n<ul>\n<li><strong>News apps are true native apps</strong> &#8212; Native apps are fast, feature-rich, and give the best possible user experience for your readers. They are the best opportunity for you to create a unique and custom app.</li>\n<li><strong>News isn&#8217;t just a tool, it&#8217;s a full service</strong> &#8212; Our team configure the apps to your specification, build them on our platform, help you to launch them on the App Store and Google Play, and handle all ongoing updates and maintenance</li>\n<li><strong>MobiLoud is designed specifically for digital publishers</strong> &#8211;No other mobile app solution gives you this level of integration with WordPress, your content and third party plugins. </li>\n<li><strong>News gives you everything you need to monetize</strong> &#8212; MobiLoud supports a number of mobile app specific advertising, analytics and membership solutions to give you all you need to monetize and grow your revenue through a new channel.</li>\n</ul>\n<h4>News Features</h4>\n<p>No matter what you use in your current monetization, engagement, and editorial stack &#8211; News can recreate that in mobile apps. Our platform powers apps from top publishers like Foreign Policy, Business Insider, Simple Flying &#8211; and many more.</p>\n<p>News has been specifically designed to give you all the features you need to make your app successful, drive more engagement and traffic and generate additional revenue from advertising and/or subscriptions.</p>\n<ul>\n<li><strong>Automatic content updates</strong> &#8212; Your mobile app updates without any work required. New content on your site is immediately visible in your app</li>\n<li><strong>Full customization of your mobile app&#8217;s style</strong> &#8212; It&#8217;s your mobile app, so it&#8217;s all about your brand. Add colors, your logo, customize the app menu and more</li>\n<li><strong>A mobile app that works on all major platforms</strong> &#8212; Guaranteed to work on iPhone, iPad, Android phones and tablets.</li>\n<li><strong>No-hassle publishing</strong> &#8212; MobiLoud gets your app published for you, on your own accounts, saving you tens of hours of work.</li>\n<li><strong>Effortless push notifications</strong> &#8212; Send push notifications to your app users for new content automatically with new content, or manually, as often as you want.</li>\n<li><strong>Mobile advertising and monetization</strong> &#8212; Make more money from your mobile traffic. Use banner ads, interstitials and native ads designed specifically for mobile apps.</li>\n<li><strong>Sell subscriptions or require a login</strong> &#8212; You can use in-app purchase to sell subscriptions and memberships within your app, or require a login for users to get access to premium content with an existing account.</li>\n<li><strong>Sell subscriptions to remove ads</strong> &#8212; Generate more revenue and improve your user&#8217;s experience by making it easy  &hellip;</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.6.zip",
    "upgrade_notice": {
        "4.0.5": "<ul>\n<li>Fixes problem with styling on single article screens</li>\n</ul>",
        "4.0.2": "<p>Recommended update for bug fixes, security updates and enhancements</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/mobiloud-mobile-app-plugin/assets/screenshot-1.png?rev=3091372",
            "caption": "<strong>Turn your site into an app</strong> - Transform your website into a mobile app experience your users are familiar with."
        },
        {
            "src": "https://ps.w.org/mobiloud-mobile-app-plugin/assets/screenshot-2.png?rev=3091372",
            "caption": "<strong>Update your website and app together</strong> - Your app and website are fully synced with any updates you make pushed to your app immediately, with no delay."
        },
        {
            "src": "https://ps.w.org/mobiloud-mobile-app-plugin/assets/screenshot-3.png?rev=3091372",
            "caption": "<strong>No design or feature limitations</strong> - All your favorite themes, tools, plugins, custom code and design all work perfectly in your app with no limitations."
        },
        {
            "src": "https://ps.w.org/mobiloud-mobile-app-plugin/assets/screenshot-4.png?rev=3091372",
            "caption": "<strong>Zero app maintenance</strong> - With our approach, you don't have to manage a separate channel, reducing overhead and work for your team."
        },
        {
            "src": "https://ps.w.org/mobiloud-mobile-app-plugin/assets/screenshot-5.png?rev=3091372",
            "caption": "<strong>Fully managed mobile apps</strong> - Our team handles everything related to your app, from setup, to launch, and any ongoing optimizations."
        },
        {
            "src": "https://ps.w.org/mobiloud-mobile-app-plugin/assets/screenshot-6.png?rev=3091372",
            "caption": "<strong>The risk-free way to launch an app</strong> - You get an app at an affordable cost, with no long-term contracts and a 60 day money back guarantee."
        }
    ],
    "tags": {
        "android-app": "Android App",
        "application": "application",
        "mobile": "mobile",
        "mobile-app": "Mobile App",
        "native-app": "native app"
    },
    "stable_tag": "4.6",
    "versions": {
        "1.0.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.0.2.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.1.3.zip",
        "1.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.2.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.2.1.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.2.6.zip",
        "1.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.3.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.3.5.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.3.8.zip",
        "1.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.4.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.4.1.zip",
        "1.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.5.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.5.3.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.5.4.zip",
        "1.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.6.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.6.2.zip",
        "1.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.7.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.7.2.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.7.4.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.7.5.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.7.6.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.0.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.1.zip",
        "1.8.10": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.10.zip",
        "1.8.11": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.11.zip",
        "1.8.12": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.12.zip",
        "1.8.14": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.14.zip",
        "1.8.15": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.15.zip",
        "1.8.16": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.16.zip",
        "1.8.17": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.17.zip",
        "1.8.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.5.zip",
        "1.8.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.6.zip",
        "1.8.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.7.zip",
        "1.8.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.8.zip",
        "1.8.9": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.8.9.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.9.0.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.9.1.zip",
        "1.9.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.1.9.2.zip",
        "2.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.1.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.1.1.zip",
        "2.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.1.zip",
        "2.3.10": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.10.zip",
        "2.3.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.2.zip",
        "2.3.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.3.zip",
        "2.3.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.4.zip",
        "2.3.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.5.zip",
        "2.3.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.6.zip",
        "2.3.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.7.zip",
        "2.3.7.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.7.5.zip",
        "2.3.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.8.zip",
        "2.3.9.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.9.5.zip",
        "2.3.9.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.9.6.zip",
        "2.3.9.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.9.7.zip",
        "2.3.9.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.2.3.9.8.zip",
        "3.0": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.0.1.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.0.4.zip",
        "3.0.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.0.5.zip",
        "3.0.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.0.6.zip",
        "3.0.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.0.7.zip",
        "3.0.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.0.8.zip",
        "3.0.9": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.0.9.zip",
        "3.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.1.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.1.1.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.1.2.zip",
        "3.1.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.1.3.zip",
        "3.1.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.1.4.zip",
        "3.1.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.1.5.zip",
        "3.1.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.1.6.zip",
        "3.1.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.1.7.zip",
        "3.1.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.1.8.zip",
        "3.1.9": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.1.9.zip",
        "3.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.2.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.2.1.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.2.2.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.2.3.zip",
        "3.2.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.2.4.zip",
        "3.2.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.2.5.zip",
        "3.2.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.2.6.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.3.1.zip",
        "3.3.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.3.2.zip",
        "3.3.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.3.3.zip",
        "3.3.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.3.4.zip",
        "3.3.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.3.5.zip",
        "3.3.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.3.6.zip",
        "3.3.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.3.7.zip",
        "3.3.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.3.8.zip",
        "3.3.9": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.3.9.zip",
        "3.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.4.zip",
        "3.4.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.4.1.zip",
        "3.4.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.4.2.zip",
        "3.4.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.4.3.zip",
        "3.4.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.4.4.zip",
        "3.4.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.4.5.zip",
        "3.4.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.4.6.zip",
        "3.4.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.4.7.zip",
        "3.4.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.4.8.zip",
        "3.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.5.zip",
        "3.5.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.5.1.zip",
        "3.5.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.5.2.zip",
        "3.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.6.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.6.1.zip",
        "3.6.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.6.2.zip",
        "3.6.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.6.3.zip",
        "3.6.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.6.4.zip",
        "3.6.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.6.5.zip",
        "3.6.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.6.6.zip",
        "3.6.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.6.7.zip",
        "3.6.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.6.8.zip",
        "3.6.9": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.6.9.zip",
        "3.7.0": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.7.0.zip",
        "3.7.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.7.1.zip",
        "3.7.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.7.2.zip",
        "3.7.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.7.3.zip",
        "3.7.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.7.4.zip",
        "3.7.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.7.5.zip",
        "3.7.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.7.6.zip",
        "3.7.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.7.7.zip",
        "3.7.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.7.8.zip",
        "3.8.0": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.8.0.zip",
        "3.8.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.8.1.zip",
        "3.8.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.8.2.zip",
        "3.8.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.8.3.zip",
        "3.8.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.8.4.zip",
        "3.8.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.8.5.zip",
        "3.8.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.8.6.zip",
        "3.8.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.8.7.zip",
        "3.8.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.3.8.8.zip",
        "4.0.0": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.0.0.zip",
        "4.0.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.0.1.zip",
        "4.0.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.0.2.zip",
        "4.0.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.0.3.zip",
        "4.0.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.0.4.zip",
        "4.0.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.0.5.zip",
        "4.0.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.0.6.zip",
        "4.0.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.0.7.zip",
        "4.0.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.0.8.zip",
        "4.0.9": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.0.9.zip",
        "4.1.0": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.1.0.zip",
        "4.1.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.1.1.zip",
        "4.2.0": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.2.0.zip",
        "4.2.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.2.1.zip",
        "4.2.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.2.2.zip",
        "4.2.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.2.3.zip",
        "4.2.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.2.4.zip",
        "4.2.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.2.5.zip",
        "4.2.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.2.6.zip",
        "4.2.6.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.2.6.1.zip",
        "4.2.6.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.2.6.2.zip",
        "4.2.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.2.7.zip",
        "4.2.7.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.2.7.1.zip",
        "4.2.7.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.2.7.2.zip",
        "4.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.3.zip",
        "4.3.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.3.1.zip",
        "4.3.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.3.2.zip",
        "4.3.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.3.3.zip",
        "4.3.3.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.3.3.1.zip",
        "4.3.3.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.3.3.2.zip",
        "4.3.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.3.4.zip",
        "4.3.4.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.3.4.1.zip",
        "4.3.4.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.3.4.2.zip",
        "4.3.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.3.5.zip",
        "4.3.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.3.7.zip",
        "4.3.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.3.8.zip",
        "4.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.4.zip",
        "4.4.1": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.4.1.zip",
        "4.4.2": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.4.2.zip",
        "4.4.3": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.4.3.zip",
        "4.4.4": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.4.4.zip",
        "4.4.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.4.5.zip",
        "4.4.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.4.6.zip",
        "4.4.7": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.4.7.zip",
        "4.4.8": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.4.8.zip",
        "4.5": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.5.zip",
        "4.6": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.4.6.zip",
        "trunk": "https://downloads.wordpress.org/plugin/mobiloud-mobile-app-plugin.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/mobiloud-mobile-app-plugin/assets/banner-772x250.png?rev=3091372",
        "high": "https://ps.w.org/mobiloud-mobile-app-plugin/assets/banner-1544x500.png?rev=3091372"
    },
    "icons": {
        "1x": "https://ps.w.org/mobiloud-mobile-app-plugin/assets/icon.svg?rev=3091372",
        "svg": "https://ps.w.org/mobiloud-mobile-app-plugin/assets/icon.svg?rev=3091372"
    },
    "blocks": {
        "mobiloud/recently-purchased-products": {
            "name": "mobiloud/recently-purchased-products",
            "title": "Recently purchased products"
        },
        "mobiloud/products-from-menu": {
            "name": "mobiloud/products-from-menu",
            "title": "Products from menu"
        },
        "mobiloud/product-search": {
            "name": "mobiloud/product-search",
            "title": "Product Search"
        },
        "mobiloud/divider": {
            "name": "mobiloud/divider",
            "title": "Divider"
        },
        "mobiloud/product-carousel": {
            "name": "mobiloud/product-carousel",
            "title": "Product Carousel"
        },
        "mobiloud/heading": {
            "name": "mobiloud/heading",
            "title": "Title"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 84,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}