{
    "name": "myCred &#8211; Loyalty Points and Rewards plugin for WordPress and WooCommerce &#8211; Give Points, Ranks, Badges, Cashback, WooCommerce rewards, and WooCommerce credits for Gamification",
    "slug": "mycred",
    "version": "2.7.3",
    "author": "<a href=\"https://mycred.me\">myCred</a>",
    "author_profile": "https://profiles.wordpress.org/wpexpertsio/",
    "contributors": {
        "mycred": {
            "profile": "https://profiles.wordpress.org/mycred/",
            "avatar": "https://secure.gravatar.com/avatar/8d670dedf1de4cfa05a677d55c230777?s=96&d=monsterid&r=g",
            "display_name": "myCRED"
        },
        "wpexpertsio": {
            "profile": "https://profiles.wordpress.org/wpexpertsio/",
            "avatar": "https://secure.gravatar.com/avatar/2b7fe145f920d4695acd6617855039ee?s=96&d=monsterid&r=g",
            "display_name": "WPExperts.io"
        }
    },
    "requires": "4.8",
    "tested": "6.6.1",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 92,
    "ratings": {
        "5": 393,
        "4": 7,
        "3": 9,
        "2": 6,
        "1": 38
    },
    "num_ratings": 453,
    "support_url": "https://wordpress.org/support/plugin/mycred/",
    "support_threads": 13,
    "support_threads_resolved": 13,
    "active_installs": 10000,
    "downloaded": 1115794,
    "last_updated": "2024-08-08 2:13pm GMT",
    "added": "2013-04-22",
    "homepage": "https://mycred.me",
    "sections": {
        "description": "<p>myCred is an intelligent and adaptive <strong>points management system</strong> that allows you to build and manage a broad range of digital rewards including points, ranks and, badges on your WordPress/WooCommerce powered website.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/-M19tzYo1jo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Build <strong>brand loyalty</strong> by rewarding your customers through store reward systems, cash back, community leaderboard, website content monetization, etc. &#8211; The possibilities are endless.</p>\n<p><strong>Increase customer engagement tenfold &#8211; Rewarding your users for community engagement will help your business grow.</strong></p>\n<h4>AMAZING AWARD SYSTEMS TO ENGAGE AND REWARD LOYAL CUSTOMERS</h4>\n<p>myCred allows <strong>THREE different ways</strong> through which you can award your users:</p>\n<ul>\n<li>\n<p><strong>Points &#8211;</strong> Set events and triggers to allow real-time tracking and automatically award your users with loyalty points and daily rewards.</p>\n</li>\n<li>\n<p><strong>Ranks &#8211;</strong> Set ranks within your leaderboards and reward your users with significant perks after they reach a certain milestone.</p>\n</li>\n<li>\n<p><strong>Badges &#8211;</strong> Boost your users&#8217; participation by rewarding them for their exceptional performance.</p>\n</li>\n<li>\n<p>Gain access to 50+ myCred add-ons.</p>\n</li>\n<li>Premium support &amp; priority updates.</li>\n<li>License key for all add-ons.</li>\n<li>Connect multiple sites with just one license key.</li>\n<li>Upgrade your package at any time to get more add-ons.</li>\n</ul>\n<p><a href=\"https://mycred.me/membership/\" rel=\"nofollow ugc\">Check package pricing page for add-on list</a></p>\n<h4>WooCommerce Cart &amp; Checkout Block Compatibility</h4>\n<p>myCred is compatible with WooCommerce’s cart &amp; checkout block compatibility, making it easier for users to fill out checkout page seamlessly and win WooCommerce rewards.</p>\n<h4>Features</h4>\n<h4>Point Management</h4>\n<p>Empower your users by rewarding them points and rewards &#8211; each user has their own POINT BALANCE to purchase online products, cash back, or online activities.</p>\n<p><strong>&#8211; Point Balances</strong>: Each user on your website will have their own point balance, where they can gain/lose viewpoints.<br />\n<strong>&#8211; Account History</strong>: Each time a user gains or loses points on your website, transaction is logged into a central log.<br />\n<strong>&#8211; Points Management</strong>: You have full control over your users&#8217; point balances. Adjust user balance by adding or removing points and rewards with or without a log entry.<br />\n<strong>&#8211; Automatic Points</strong>: Automatically award or deduct points from your user&#8217;s balance for their interaction on your WordPress/WooCommerce or gamification based website.<br />\n<strong>&#8211; Multiple Point Types</strong>: Create multiple point types through admin area to manage things easily. There is no limit to the number of point types you can have at your disposal.<br />\n<strong>&#8211; Buy Points</strong>: buyCred add-on allows your users to purchase points and rewards using real money using some of most popular payment gateways available in market today.<br />\n<strong>&#8211; Store Payments</strong>: myCred supports some of most popular store plugins for WordPress, allowing your users to pay for orders/tickets using their point balance instead of real money.<br />\n<strong>&#8211; Upload Point-type image</strong>: Give your gamification point type a unique identity by assigning them an image. Use it to create a WooCommerce wallet.<br />\n<strong>&#8211; Import/Export Points and Point Types</strong>: Save time by importing/exporting user points and point types (all  or specific). You can also export setup settings for all point types.<br />\n<strong>&#8211; Import/Export Setup Settings</strong>: Setup myCred quickly by importing/exporting setup settings in JSON format. Export option is available for all or specific user fields.</p>\n<h4>Badges &amp; Ranks</h4>\n<p><strong>&#8211;  Open Badge Functionality</strong> &#8211; new opportunities to recognize and validate achievements digitally.<br />\n<strong>&#8211;  Add badge details</strong> (name, achievement, website details, etc.).<br />\n<strong>&#8211;  Badge recognition and validation</strong> through different badge verification websites.<br />\n<strong>&#8211;  Single Badge Page</strong> is an exclusive page for each badge and its information (badge name, image, badge description, achievements, and benefits)<br />\n<strong>&#8211;  Open Badge Search Filter</strong> &#8211; [myCred badge list] shortcode gives you  ability to add search fields and filters for badges.<br />\n<strong>&#8211;  Evidence Shortcode</strong> &#8211; Technical support for gamification and badge verification purposes.<br />\n<strong>&#8211;  Badge Evidence Download Button</strong> &#8211; Access Open Badges of any users on website. Admin can also download any given badge images.<br />\n<strong>&#8211;  The &#8220;Quick Edit&#8221; badge option</strong> will allow you to modify information of any particular badge.<br />\n<strong>&#8211;  Social share setting</strong> &#8211; Allow users to share their achieved badges on their social profiles.<br />\n<strong>&#8211;  Import/Export User Badges</strong> &#8211; Import/Export option for user badges (all or specific). The admin can import badges with ID/Title/Slug.<br />\n<strong>&#8211;  Import/Export User Ranks</strong> &#8211; Import/Export option for user ranks (all or specific). The admin can import ranks with ID/Title/Slug.<br />\n<strong>&#8211;  Export Options</strong> &#8211; Admin can easily export badges and ranks in a raw or formatted file. Export option is available for all or specific user fields.<br />\n<strong>&#8211;  Award Badges/Ranks on Coupons</strong> &#8211; Assign user badges, ranks, and WooCommerce rewards to coupons so that users will get rewarded when using specific coupons at checkout.<br />\n<strong>&#8211;  Attributes</strong> &#8211; Add title, excerpt, and display attributes in mycred_my_badges shortcode to make it a digital wallet system.</p>\n<h4>cashCred</h4>\n<p><strong>GIVE USERS THE POWER TO CONVERT THEIR MYCRED POINTS INTO REAL MONEY.</strong></p>\n<p>cashCred is a built-in myCred add-on that allows users to redeem myCred points as a digital wallet for real money. Earn points through myCred&#8217;s intelligent rewards system. Instead of cash, reward users with points that can be encashed.</p>\n<p>cashCred works perfectly with a reward system that engages users to perform activities that require user interaction (watching a video, filling out a survey, and more).</p>\n<p><strong>&#8211;  Convert Points to Cash</strong> &#8211; Users can redeem myCred points for money.<br />\n<strong>&#8211;  Multiple Point Types</strong> &#8211; Allow multiple custom point types.<br />\n<strong>&#8211;  Exchange Rates</strong> &#8211; Define exchange rates for each points type.<br />\n<strong>&#8211;  Cash Withdrawal</strong> &#8211; Users can send a request to admin for cash withdrawal or cashback.<br />\n<strong>&#8211;  User Requests</strong> &#8211; Approve or deny user requests for cash withdrawal.<br />\n<strong>&#8211;  Additional Notes</strong> &#8211; Write additional notes for users, which will be displayed on the payment form.<br />\n<strong>&#8211;  Currency Code</strong> &#8211; Define currency code (USD, GBP, AUD, etc.) for the payment form.<br />\n<strong>&#8211;  Shortcode Support</strong> &#8211; Display cashCred module on website using a shortcode.<br />\n<strong>&#8211;  Set Limits &amp; Restrictions</strong> &#8211; Set minimum or maximum restriction limits on point conversion requests.<br />\n<strong>&#8211;  Pay Through PayPal</strong> &#8211; cashCred supports payment through PayPal.<br />\n<strong>&#8211;  Pay Through Stripe</strong> &#8211; cashCred supports payment through Stripe.<br />\n<strong>&#8211;  Create email events/templates</strong> for cashCred pending/approved/cancel requests.<br />\n<strong>&#8211;  Point Transfer</strong> &#8211; Users can transfer cashCred points to other users.<br />\n<strong>&#8211;  Min/Max Fee</strong> &#8211; Setup Numerical Difference (set a range for Minimum and Maximum fee).<br />\n<strong>&#8211;  Fees (points/percentage)</strong> &#8211; Setup Parameters (fees can be set up using points or percentage).<br />\n<strong>&#8211;  Registered References</strong> &#8211; All registered references will be listed on support page.</p>\n<h4>Template Tags</h4>\n<p><strong>&#8211;  Signup Referral Hook (%user_name%)</strong> &#8211; This hook returns a username whenever a user signup using a referral link.<br />\n<strong>&#8211;  Sell Content (%Price%)</strong> &#8211; This template tag returns number of points a user needs to purchase content.<br />\n<strong>&#8211;  Badges (%badge_title% and %badge_image%)</strong> &#8211; Display users&#8217; new badge title and image in outgoing email.<br />\n<strong>&#8211;  Ranks (%rank_title% and %rank_image%)</strong> &#8211; Display users&#8217; new rank title and image in outgoing email.</p>\n<h4>Dedicated Log</h4>\n<p>Each time myCred adds or deducts points from a user, adjustment is logged in a dedicated log, allowing your users to browse their history. This log keeps a record of your user&#8217;s accountability, badges, and ranks, among other useful statistics.</p>\n<p>This log data can be converted into charts to help you visualize the usage and circulation of points on your website.</p>\n<p>You can achieve following features by using a dedicated log for your points system:</p>\n<ul>\n<li>Set a limit to maximum number of times each hook can give out points to your user.</li>\n<li>Badges will use the log&#8217;s data to determine which user has earned a badge.</li>\n<li>Add-ons such as Sell Content use log to track users who have purchased posts from your website.</li>\n<li>Add-ons use log to ensure that a user does not gain repetitive points for same interaction within a given time frame.</li>\n</ul>\n<h4>Central Deposit</h4>\n<p>Central Deposit is a built-in add-on that allows admin to nominate any available user account to become  primary account from where all point-related transactions are managed.</p>\n<ul>\n<li><strong>Central Deposit Account</strong> &#8211; Admin can choose any existing user account to become a central deposit account that controls all points and their transactions.</li>\n<li><strong>Centralized Transaction Mangement</strong> &#8211; Any points spent or earned are recorded in a point log that can be accessed from user&#8217;s myCred admin dashboard.</li>\n<li><strong>Ignore Manual Adjustments</strong> &#8211; After a central deposit account is nominated, the admin can not add points to customer&#8217;s account manually.</li>\n<li><strong>Set Starting from</strong> &#8211; Setup starting date </li>\n<li><strong>Interval (in days)</strong> &#8211; Deposit points after x days interval.</li>\n<li><strong>Amount</strong> &#8211; The amount of points to be scheduled.</li>\n<li><strong>Recurring</strong> &#8211; Enabling this options will deposit the amount recursively after defined interval. We have also added two new email triggers for Central deposit.</li>\n<li>Added Email notification on Minimum balance in central deposit.</li>\n<li>Added Email notification on No balance Left in central deposit.</li>\n</ul>\n<h4>Achievements/Assets</h4>\n<ul>\n<li>Issue badges for any combination of achievements.</li>\n<li>Detailed badge categorization.</li>\n<li>Industry-related achievements.</li>\n<li>Achievement list Shortcode allows you to display myCred badge listing in tabs individually or in a category. </li>\n</ul>\n<h4>Additional features</h4>\n<p><strong>&#8211;  White-Labeling: myCred has built-in support for white-labeling</strong>: This allows you to rename plugin in your admin area to anything you like such as WooCommerce rewards or cashback.<br />\n<strong>&#8211;  Import &amp; Export</strong>: myCred comes with three built-in import tools allowing you to import points, use gamification, log entries, or migrate your CubePoints installation.<br />\n<strong>&#8211;  Multi-Site Support</strong>: myCred has built-in support for multi-sites, allowing you to choose between using a unique myCred installation or centralize balances across your network.<br />\n<strong>&#8211;  Leaderboards</strong>: Generate leaderboards based on your user&#8217;s balance or points history &#8211; display users with the most points for a particular instance.<br />\n<strong>&#8211;  Theme Independent</strong>: The myCred plugin is theme independent &#8211; Your theme needs to support widgets and shortcodes to run myCred.<br />\n<strong>&#8211;  BuddyPress Ready</strong>: myCred has had built-in support for BuddyPress through which you can access BuddyPress-related features like Insert point balances/badges/ranks into your user&#8217;s profiles.<br />\n<strong>&#8211;  A &#8220;Bulk Assign&#8221; tool</strong> for awarding/revoking points, badges, and ranks in bulk.<br />\n<strong>&#8211;  Enable/Disable add-ons</strong> &#8211; Save time and use toggle buttons for enabling or disabling add-ons.<br />\n<strong>&#8211;  Treasures</strong> &#8211; A brand new collection of attractive graphical images that can be used for ranks and badges.</p>\n<h4>BUILT-IN ADD-ONS</h4>\n<p>myCred is much more than just a point management system or a gamification plugin &#8211; It comes with several <a href=\"https://www.mycred.me/add-ons/\" rel=\"nofollow ugc\">built-in add-ons</a> like WooCommerce rewards that enable you to perform complex tasks such as transfer or buy points for real money, allow payments in stores, etc.</p>\n<p><strong>&#8211; Badges:</strong> Award your users badges based on their points history using gamification.<br />\n<strong>&#8211; buyCred:</strong> Let your users buy points in exchange for real money.<br />\n<strong>&#8211; Coupons:</strong> Create coupons that can be redeemed for points.<br />\n<strong>&#8211; Email notifications:</strong> Setup email notifications for status updates.<br />\n<strong>&#8211; Gateway:</strong> Let users pay with points in your store.<br />\n<strong>&#8211; Notifications:</strong> Enable popup notifications that display status updates.<br />\n<strong>&#8211; Ranks:</strong> Create ranks based on the user&#8217;s point balance.<br />\n<strong>&#8211; Sell Content:</strong> Sell your content in exchange for points.<br />\n<strong>&#8211; Statistics:</strong> Get a statistical overview of points in circulation, etc.<br />\n<strong>&#8211; Transfers:</strong> Allow your users to transfer points to other users.</p>\n<h4>myCred WooCommerce</h4>\n<p>myCred WooCommerce offers seamless integration with WooCommerce, improving your e-commerce experience. This built-in adddon introduces five key features: compatibility with WooCommerce blocks, points for each order, points for first orders, points for order ranges, and points for several orders. Earn rewards based on various order criteria, while admins have full control over points allocation through customizable hooks. The addon also supports myCred as a payment gateway, displaying user points or balances on the cart &amp; checkout pages.</p>\n<h4>BUILT-IN PLUGIN SUPPORT</h4>\n<p>myCred supports some of the most popular WordPress plugins like <strong>BuddyPress, WooCommerce, Jetpack, Contact Form 7, Disqus, Gravity Forms,</strong> among countless others for gamification.</p>\n<p><strong>Simple &amp; organized</strong> To keep your admin area organized, myCred will only show features and setting for those third-party plugins that are installed and enabled.</p>\n<h4>INTEGRATED WITH THE MOST POPULAR LEARNING MANAGEMENT SYSTEMS</h4>\n<p>myCred is integrated with a large number of popular learning management systems, that include:</p>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/mycred-learndash/\" rel=\"ugc\">LearnDash</a></li>\n<li><a href=\"https://wordpress.org/plugins/mycred-lifterlms-integration/\" rel=\"ugc\">LifterLMS</a></li>\n<li><a href=\"https://wplms.io/support/knowledge-base/wplms-mycred-add-on/\" rel=\"nofollow ugc\">WPLMS</a> (Free third-party integration)</li>\n<li><a href=\"https://thimpress.com/product/mycred-add-on-for-learnpress/\" rel=\"nofollow ugc\">LearnPress</a> (Paid third-party integration).</li>\n</ul>\n<h4>MYCRED&#8217;S INTEGRATION WITH YOUR FAVORITE PAGE BUILDERS:</h4>\n<ul>\n<li><a href=\"https://www.mycred.me/store/mycred-elementor/\" rel=\"nofollow ugc\">myCred Elementor</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-beaver-builder/\" rel=\"nofollow ugc\">myCred Beaver Builder</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-for-wpbakery-page-builder/\" rel=\"nofollow ugc\">myCred for WPBakery Page Builder</a></li>\n</ul>\n<h4>MYCRED OFFERS A VARIETY OF FREE PLUGINS THAT INCLUDE:</h4>\n<ul>\n<li><a href=\"https://www.mycred.me/store/mycred-lifterlms-integration/\" rel=\"nofollow ugc\">LifterLMS Plugin Integration with myCred</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-bp-group-leaderboards/\" rel=\"nofollow ugc\">myCred BP Group Leaderboards</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-for-wp-pro-quiz/\" rel=\"nofollow ugc\">myCred for WP-Pro-Quiz</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-for-rating-form/\" rel=\"nofollow ugc\">myCred for Rating Form</a><br />\n<a href=\"https://www.mycred.me/product-category/freebies/\" rel=\"nofollow ugc\">Explore to find out more&#8230;</a></li>\n</ul>\n<h4>MYCRED&#8217;S THIRD-PARTY BRIDGES PLUGINS:</h4>\n<ul>\n<li><a href=\"https://www.mycred.me/store/buycred-stripe/\" rel=\"nofollow ugc\">Stripe &#8211; buyCred Gateway</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-for-easy-digital-downloads/\" rel=\"nofollow ugc\">Easy Digital Downloads &#8211; myCred Gateway</a></li>\n<li><a href=\"https://mycred.me/store/mycred-zapier-addon/\" rel=\"nofollow ugc\">myCred Zapier Addon</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-dokan/\" rel=\"nofollow ugc\">myCred Dokan</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-wc-vendors/\" rel=\"nofollow ugc\">myCred WCVendors</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-learndash/\" rel=\"nofollow ugc\">myCred Learndash</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-for-users-ultra/\" rel=\"nofollow ugc\">myCred for Users Ultra</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-for-user-pro/\" rel=\"nofollow ugc\">myCred for User Pro</a></li>\n</ul>\n<h4>MYCRED&#8217;S GAMIFICATION PLUGINS:</h4>\n<ul>\n<li><a href=\"https://www.mycred.me/store/mycred-pacman/\" rel=\"nofollow ugc\">myCred PacMan</a></li>\n<li><a href=\"https://www.mycred.me/store/wheel-of-fortune-add-on/\" rel=\"nofollow ugc\">Wheel of Fortune Add-On</a></li>\n</ul>\n<h4>MYCRED&#8217;S ENHANCEMENT PLUGINS:</h4>\n<ul>\n<li><a href=\"https://www.mycred.me/store/mycred-woocommerce-plus/\" rel=\"nofollow ugc\">myCred WooCommerce Plus</a></li>\n<li><a href=\"https://mycred.me/store/mycred-email-digest/\" rel=\"nofollow ugc\">myCred Email Digest</a></li>\n<li><a href=\"https://mycred.me/store/mycred-progress-map/\" rel=\"nofollow ugc\">myCred Progress Map</a></li>\n<li><a href=\"https://mycred.me/store/mycred-points-cap/\" rel=\"nofollow ugc\">myCred Points Cap</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-level-cred/\" rel=\"nofollow ugc\">myCred Level Cred</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-social-proof/\" rel=\"nofollow ugc\">myCred Social Proof</a></li>\n<li><a href=\"https://www.mycred.me/store/sms-payments/\" rel=\"nofollow ugc\">myCred SMS Payments &#8211; Twilio Transfers</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-expiration-add-on/\" rel=\"nofollow ugc\">myCred Expiration Add on</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-social-share-add-on/\" rel=\"nofollow ugc\">myCred Social Share Add on</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-progress-bar-add-on/\" rel=\"nofollow ugc\">myCred Progress Bar Add on</a></li>\n<li><a href=\"https://www.mycred.me/store/jw-player-with-mycred/\" rel=\"nofollow ugc\">myCred Video Add-on For JW Player</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-bp-charges/\" rel=\"nofollow ugc\">myCred BP Charges</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-rest-api/\" rel=\"nofollow ugc\">myCred Rest API</a></li>\n<li><a href=\"https://www.mycred.me/store/transfer-plus/\" rel=\"nofollow ugc\">myCred Transfer Plus</a></li>\n<li><a href=\"https://www.mycred.me/store/video-add-on/\" rel=\"nofollow ugc\">myCred Video Add-on For Vimeo</a></li>\n<li><a href=\"https://www.mycred.me/store/notifications-plus-add-on/\" rel=\"nofollow ugc\">myCred Notifications Plus Add-on</a></li>\n</ul>\n<h4>Documentation</h4>\n<p>You can find extensive <a href=\"http://codex.mycred.me/\" rel=\"nofollow ugc\">documentation</a> on myCred related add-ons in the myCred Codex. You can also find a list of <a href=\"https://mycred.me/about/faq/\" rel=\"nofollow ugc\">frequently asked</a> questions on the myCred website.</p>\n<h4>Customizations</h4>\n<p>myCred has the ability to do-it-all because we have put in a lot of effort to make sure that the supported plugins are as developer-friendly as possible. If you need to build a custom feature, simply submit a <a href=\"https://mycred.me/customize/request-quote/\" rel=\"nofollow ugc\">request for a quote</a> via the myCred website.</p>\n<h4>Support</h4>\n<p>We offer support on our <a href=\"https://mycred.me/support/\" rel=\"nofollow ugc\">myCred website</a> from 9 AM &#8211; 5 PM, Monday to Friday (GMT+5).</p>\n<p>You can either submit a <a href=\"https://mycred.me/customize/request-quote/\" rel=\"nofollow ugc\">customization request</a> or open a <a href=\"https://mycred.me/support/\" rel=\"nofollow ugc\">support ticket</a> any time you&#8217;re facing trouble with myCred.</p>\n",
        "installation": "<h4>myCRED Guides</h4>\n<p><a href=\"http://codex.mycred.me/chapter-i/\" rel=\"nofollow ugc\">Chapter I &#8211; Introduction</a></p>\n<p><a href=\"http://codex.mycred.me/chapter-ii/\" rel=\"nofollow ugc\">Chapter II &#8211; Getting Started</a></p>\n<p><a href=\"http://codex.mycred.me/chapter-iii/\" rel=\"nofollow ugc\">Chapter III &#8211; Add-ons</a></p>\n<p><a href=\"http://codex.mycred.me/chapter-iv/\" rel=\"nofollow ugc\">Chapter IV &#8211; Premium Add-ons</a></p>\n<p><a href=\"http://codex.mycred.me/chapter-v/\" rel=\"nofollow ugc\">Chapter V &#8211; For Developers</a></p>\n<p><a href=\"http://codex.mycred.me/chapter-vi/\" rel=\"nofollow ugc\">Chapter VI &#8211; Reference Guides</a></p>\n",
        "faq": "<p>You can find a list of <a href=\"https://mycred.me/about/faq/\" rel=\"nofollow ugc\">frequently asked questions</a> on myCred website.</p>\n",
        "changelog": "<h4>2.7.3</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Added Open Badge Issuer Email field in Open Badge settings.</li>\n<li><strong>TWEAK</strong> &#8211; Code improvement and bugfixes.</li>\n</ul>\n<h4>2.7.2</h4>\n<ul>\n<li><strong>TWEAK</strong> &#8211; Compatible with WordPress Version 6.6.x.</li>\n</ul>\n<h4>2.7.1</h4>\n<ul>\n<li><strong>FIX</strong> &#8211; Fixed warnings and errors on WooCommerce product rewards.</li>\n</ul>\n<h4>2.7.0</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Added &#8220;Points for Each Order&#8221; hook.</li>\n<li><strong>NEW</strong> &#8211; Added &#8220;Points for First Order&#8221; hook.</li>\n<li><strong>NEW</strong> &#8211; Added &#8220;Points for Number of Orders&#8221; hook.</li>\n<li><strong>NEW</strong> &#8211; Added &#8220;Points for Order Range&#8221; hook.</li>\n<li><strong>TWEAK</strong> &#8211; Introduced a setting to enable/disable single product rewards globally.</li>\n<li><strong>TWEAK</strong> &#8211; Introduced a setting to select an order status for allocating rewards.</li>\n<li><strong>TWEAK</strong> &#8211; Moved the WooCommerce Points gateway from the &#8220;Gateway&#8221; add-ons to the &#8220;WooCommerce&#8221; add-on.</li>\n</ul>\n<h4>2.6.5</h4>\n<ul>\n<li><strong>TWEAK</strong> &#8211; Compatible with WordPress Version 6.5.2.</li>\n</ul>\n<h4>2.6.4</h4>\n<ul>\n<li><strong>TWEAK</strong> &#8211; Optimized code for better performance and maintainability.</li>\n</ul>\n<h4>2.6.3</h4>\n<ul>\n<li><strong>TWEAK</strong> &#8211; Added compatibility for WooCommerce cart and checkout blocks.</li>\n<li><strong>FIX</strong> &#8211; Expiry time was not displayed correctly in the mycred_sales_history shortcode.</li>\n</ul>\n<h4>2.6.2</h4>\n<ul>\n<li><strong>TWEAK</strong> &#8211; Code improvement.</li>\n<li><strong>FIX</strong> &#8211; Import points tool was not working.</li>\n<li><strong>FIX</strong> &#8211; buyCred gateways were not able to make automatic pay-outs.</li>\n</ul>\n<h4>2.6.1</h4>\n<ul>\n<li><strong>FIX</strong> &#8211; Fixed mycred_load_coupon shortcode issues.</li>\n</ul>\n<h4>2.6</h4>\n<ul>\n<li><strong>IMPROVEMENT</strong> &#8211; Modern and easy to use UI to manage myCred points system.</li>\n<li><strong>TWEAK</strong> &#8211; Optimized for performance and security.</li>\n<li><strong>TWEAK</strong> &#8211; Added compatibility for PHP 8.2.</li>\n</ul>\n<h4>2.5.3</h4>\n<ul>\n<li><strong>IMPROVEMENT</strong> &#8211; Updated Feedback library to the latest version.</li>\n</ul>\n<h4>2.5.2</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Added filter in mycred_badges_list shortcode.</li>\n</ul>\n<h4>2.5.1</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Added compatibility for Gravity Forms payment forms. Points will be rewarded when payment is successfully received.</li>\n<li><strong>FIX</strong> &#8211; PHP and Javascript warnings have been resolved.</li>\n<li><strong>FIX</strong> &#8211; Fixed security vulnerabilities.</li>\n<li><strong>TWEAK</strong> &#8211; Update bitpay library</li>\n<li><strong>TWEAK</strong> &#8211; Introduce filter to add extra fields in cashcred payment gateways</li>\n</ul>\n<h4>2.5</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Added ref attribute in the mycred_chart_balance_history shortcode.</li>\n<li><strong>NEW</strong> &#8211; Introduced new shortcode mycred_my_chart_gain_loss.</li>\n<li><strong>TWEAK</strong> &#8211; Added database indexes to ensure maximum performance on the myCred Log table.</li>\n<li><strong>TWEAK</strong> &#8211; Moved the Open badge setting to the separate open badge tab.</li>\n<li><strong>FIX</strong> &#8211; Ranks-related email notification events are not triggered when the admin adjusts the user&#8217;s points manually.</li>\n<li><strong>FIX</strong> &#8211; Issue fixed regarding myCred Events Manager Payment Gateway.</li>\n</ul>\n<h4>2.4.10</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Added action hook &#8220;mycred_add_share_and_embed_button&#8221;.</li>\n<li><strong>FIX</strong> &#8211; PHP warnings are resolved.</li>\n</ul>\n<h4>2.4.9</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Introduced title, excerpt, and display attributes in mycred_my_badges shortcode.</li>\n<li><strong>NEW</strong> &#8211; Added support in myCred referral hook for &#8220;New User Approve&#8221;.</li>\n<li><strong>NEW</strong> &#8211; Added email trigger in Email Notification for manually assigned rank.</li>\n<li><strong>TWEAK</strong> &#8211; Registered a points bulk assign reference.</li>\n<li><strong>TWEAK</strong> &#8211; Code improvement in mycred_my_badges shortcode.</li>\n<li><strong>FIX</strong> &#8211; Award / Revoke by User Role was not working.</li>\n<li><strong>FIX</strong> &#8211; PHP notices were resolved.</li>\n<li><strong>FIX</strong> &#8211; Filter hooks were not working properly after the last update.</li>\n<li><strong>FIX</strong> &#8211; Sorting by points not working at Users Page.</li>\n<li><strong>FIX</strong> &#8211; Fixed cashCred vulnerabilities.</li>\n<li><strong>FIX</strong> &#8211; Fixed CSS conflicts.</li>\n</ul>\n<h4>2.4.8.1</h4>\n<ul>\n<li><strong>FIX</strong> &#8211; Fixed erros in mycred_cashcred shortcode.</li>\n</ul>\n<h4>2.4.8</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Introduced new action hook mycred_cashcred_before_bank_form.</li>\n<li><strong>FIX</strong> &#8211; Fixed PHP errors.</li>\n<li><strong>FIX</strong> &#8211; mycred_show_if shortcode was not working correctly when using multiple shortcodes on the same page.</li>\n<li><strong>FIX</strong> &#8211; The user field issue was fixed in the Bulk Assign tool.</li>\n</ul>\n<h4>2.4.7</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Added filter &#8220;mycred_email_event&#8221;.</li>\n<li><strong>FIX</strong> &#8211; mycred_list_ranks order attribute was not working in some cases.</li>\n<li><strong>FIX</strong> &#8211; mycred_transfer numeric username was not working.</li>\n<li><strong>FIX</strong> &#8211; mycred_leaderboard exclude_zero attribute was not working.</li>\n<li><strong>FIX</strong> &#8211; Fixed security vulnerabilities.</li>\n</ul>\n<h4>2.4.6.1</h4>\n<ul>\n<li><strong>FIX</strong> &#8211; Badge level requirements not being saved.</li>\n<li><strong>FIX</strong> &#8211; Badge level requirements appear twice on the badge single page.</li>\n</ul>\n<h4>2.4.6</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Added minimum points reminder email notification for central deposit.</li>\n<li><strong>NEW</strong> &#8211; Added points automatically to the central account after the specified interval. (Schedule Deposit)</li>\n<li><strong>NEW</strong> &#8211; Added &#8220;No Available Balance&#8221; email notification for central deposit.</li>\n<li><strong>FIX</strong> &#8211; buyCred purchase reward hook setup did not appear properly in mycred_hook_table.</li>\n<li><strong>FIX</strong> &#8211; Typo fixes in wooCommerce product reward reference.</li>\n<li><strong>FIX</strong> &#8211; The &#8220;Insufficient Funds Warning&#8221; message did not appear according to the myCred transfer setting.</li>\n<li><strong>FIX</strong> &#8211; Product Reward refund was not working.</li>\n<li><strong>FIX</strong> &#8211; user_id attribute was not working in mycred_show_if shortcode.</li>\n<li><strong>FIX</strong> &#8211; License was not working when using subdirectory in multisite network.</li>\n<li><strong>FIX</strong> &#8211; Fixed security vulnerabilities.</li>\n</ul>\n<h4>2.4.5.4</h4>\n<ul>\n<li><strong>FIX</strong> &#8211; Rank publish or update not working correctly.</li>\n</ul>\n<h4>2.4.5.3</h4>\n<ul>\n<li><strong>FIX</strong> &#8211; Sell content issues in manual pages/posts.</li>\n</ul>\n<h4>2.4.5.2</h4>\n<ul>\n<li><strong>FIX</strong> &#8211; Sell Content settings not being saved.</li>\n</ul>\n<h4>2.4.5.1</h4>\n<ul>\n<li><strong>FIX</strong> &#8211; PHP notices in setting area.</li>\n</ul>\n<h4>2.4.5</h4>\n<ul>\n<li><strong>TWAEK</strong> &#8211; Code improvement.</li>\n</ul>\n<h4>2.4.4.4</h4>\n<ul>\n<li><strong>FIX</strong> &#8211; Unable to assign/revoke badges manually, also some HTML elements were not rendered properly in the user edit window under the Badges section.</li>\n</ul>\n<h4>2.4.4.3</h4>\n<ul>\n<li><strong>TWEAK</strong> &#8211; Patched security vulnerability.</li>\n</ul>\n<h4>2.4.4.2</h4>\n<ul>\n<li><strong>TWEAK</strong> &#8211; Patched security vulnerability.</li>\n</ul>\n<h4>2.4.4.1</h4>\n<ul>\n<li><strong>Improvement</strong> &#8211; Patched security vulnerability.</li>\n<li><strong>Improvement</strong> &#8211; Badge UI Fix.</li>\n</ul>\n<h4>2.4.4</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; All registered references will be listed on the support page. </li>\n<li><strong>NEW</strong> &#8211; Added Gutenberg blocks for the following shortcodes mycred_cashcred, mycred_badges_list, mycred_buy_pending, mycred_chart_circulation, mycred_chart_gain_loss, mycred_chart_history, mycred_chart_balance_history, mycred_chart_top_balance, mycred_chart_instance_history and mycred_chart_top_instance.</li>\n<li><strong>NEW</strong> &#8211; Added fee feature in cashCred.</li>\n<li><strong>TWEAK</strong> &#8211; Code improvements for tools.</li>\n<li><strong>FIX</strong> &#8211; Resolved depreciated warnings for PHP 8.</li>\n<li><strong>FIX</strong> &#8211; Sign-up referral was not working for multiple point types at a time when BuddyPress is active.</li>\n<li><strong>FIX</strong> &#8211; Duplicate Email triggers when rank promoted or demoted.</li>\n</ul>\n<h4>2.4.3</h4>\n<ul>\n<li><strong>TWAEK</strong> &#8211; Improve license system.</li>\n</ul>\n<h4>2.4.2</h4>\n<ul>\n<li><strong>TWEAK</strong> &#8211; SQL query optimization</li>\n</ul>\n<h4>2.4.1</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Added new attributes &#8220;streaming&#8221; and &#8220;duration&#8221; in mycred_video shortcode.</li>\n<li><strong>NEW</strong> &#8211; Added filter &#8220;mycred_transfer_notices&#8221;. </li>\n<li><strong>NEW</strong> &#8211; Added filter &#8220;mycred_cashcred_bank_transfer_title&#8221;.</li>\n<li><strong>TWEAK</strong> &#8211; Users will be fetched when the user types in the &#8220;Exclude by User&#8221; dropdown.</li>\n<li><strong>FIX</strong> &#8211; Errors and warnings in mycred_video shortcode.</li>\n<li><strong>FIX</strong> &#8211; Ranks were not promoted when points were earned from login and referral hooks.</li>\n<li><strong>FIX</strong> &#8211; Undefined function array_key_last() in php 7.2 and below.</li>\n<li><strong>FIX</strong> &#8211; Facing errors in frontend user profile with some themes.</li>\n<li><strong>FIX</strong> &#8211; Resolve conflict with myCred Gutenberg Block addon.</li>\n</ul>\n<h4>2.4</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Introduced an Import/Export tool. </li>\n<li><strong>NEW</strong> &#8211; Admin can assign &#8220;Badges&#8221; and &#8220;Manual Ranks&#8221; using coupons. </li>\n<li><strong>NEW</strong> &#8211; Merged myCred Gutenberg to myCred Core. </li>\n<li><strong>TWEAK</strong> &#8211; Code improvements. </li>\n<li><strong>FIX</strong> &#8211; myCred video interval three-digit value not working </li>\n<li><strong>FIX</strong> &#8211; exclude_zero attribute not working when total=1 in mycred_leaderboard shortcode. </li>\n<li><strong>FIX</strong> &#8211; In the badge edit window, remove level button always removes the first level. </li>\n<li><strong>FIX</strong> &#8211; Badges are not visible in the user profile for non-admin users. </li>\n<li><strong>FIX</strong> &#8211; When updating log entry it will not reflect on the current balance. </li>\n<li><strong>FIX</strong> &#8211; CSS confliction with some themes. </li>\n<li><strong>FIX</strong> &#8211; Stopped users from getting points on signup referral multiple times on a single event. </li>\n<li><strong>FIX</strong> &#8211; Leaderboard excludes users by role not working. </li>\n<li><strong>FIX</strong> &#8211; Leaderboard excludes users by comma-separated ids not working.</li>\n</ul>\n<h4>2.3.2</h4>\n<ul>\n<li><strong>TWAEK</strong> &#8211; Code improvement.</li>\n</ul>\n<h4>2.3.1</h4>\n<ul>\n<li><strong>TWAEK</strong> &#8211; Improve license system.</li>\n</ul>\n<h4>2.3</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Introduced a &#8220;Bulk Assign&#8221; tool for awarding/revoking points, badges, and ranks.</li>\n<li><strong>NEW</strong> &#8211; Introduced a new feature &#8220;Exclude by user role&#8221; admin can exclude any user role from the specific point type.</li>\n<li><strong>NEW</strong> &#8211; Introduced a timeframe attribute in [mycred_my_balance_converted] shortcode. Now you can show users converted balance of a given timeframe today, yesterday, this week, this month, last month.</li>\n<li><strong>FIX</strong> &#8211; Sometimes user&#8217;s ranks were not updating automatically.</li>\n<li><strong>FIX</strong> &#8211; Membership page layout issues.</li>\n<li><strong>FIX</strong> &#8211; Points conversion not working when using arrows to increase or decrease the amount in [mycred_cashcred] shortcode.</li>\n<li><strong>FIX</strong> &#8211; buyCred payment dialog couldn&#8217;t load on the subsite.</li>\n<li><strong>FIX</strong> &#8211; After deleting the badge their data will keep existing on the user&#8217;s meta.</li>\n<li><strong>FIX</strong> &#8211; &#8220;this-week&#8221; value not working in [mycred_leaderboard] timeframe attribute when the week starts other than &#8220;Monday&#8221; in your WordPress setting.</li>\n</ul>\n<h4>2.2</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Moved general settings and menus into the newly introduced &#8220;myCred&#8221; main menu.</li>\n<li><strong>NEW</strong> &#8211; On plugin activation, the default point type will be created automatically.</li>\n<li><strong>NEW</strong> &#8211; Added new template tags in email notification for transfer events.</li>\n<li><strong>NEW</strong> &#8211; Now user can upload a Point type image.</li>\n<li><strong>NEW</strong> &#8211; Introduced an image attribute in mycred_my_balance shortcode.</li>\n<li><strong>NEW</strong> &#8211; Introduced an image attribute in mycred_leaderboard shortcode.</li>\n<li><strong>NEW</strong> &#8211; Introduced Single badge page layout setting.</li>\n<li><strong>NEW</strong> &#8211; Introduced a enable/disable all addons button.</li>\n<li><strong>NEW</strong> &#8211; Users can share their achieved Badges on social media.</li>\n<li><strong>TWEAK</strong> &#8211; When a user deletes the log of buy_content, the sales count does not get updated. So, we have Introduced the &#8220;Update Sales Count&#8221; button in the settings.</li>\n<li><strong>TWEAK</strong> &#8211; Improve new point type creation form setting.</li>\n<li><strong>FIX</strong> &#8211; Backend logs are not being exported whether the export raw/formatted log option is set.</li>\n<li><strong>FIX</strong> &#8211; Incorrect achieved badge level image in [mycred_badges] shortcode.</li>\n<li><strong>FIX</strong> &#8211; In the Ranks list page All/Published/Trash links not working properly.</li>\n<li><strong>FIX</strong> &#8211; Unable to revoke badge from the User profile page. </li>\n<li><strong>FIX</strong> &#8211; Added some security validations in the transfer form.</li>\n<li><strong>FIX</strong> &#8211; MYSQL 8 syntax error in the leaderboard shortcode.</li>\n<li><strong>FIX</strong> &#8211; Added compatibility with BuddyPress version 8.0</li>\n</ul>\n<h4>2.1.1</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Introduced new template tags %badge_image%, %badge_title%, %rank_image% and %rank_title% for myCred email notification addon.</li>\n<li><strong>NEW</strong> &#8211; Added support for cashCred payment email in myCred email notification addon.</li>\n<li><strong>NEW</strong> &#8211; Added myCred Open badge image download button in the user profile(backend).</li>\n<li><strong>NEW</strong> &#8211; Added a new support menu in myCred for suggestions and support.</li>\n<li><strong>NEW</strong> &#8211; Added search bar and filters in mycred_badges_list shortcode.</li>\n<li><strong>NEW</strong> &#8211; Introduced a new template tag %price% for myCred sell content &#8220;Insufficient Funds Template&#8221;.</li>\n<li><strong>NEW</strong> &#8211; myCred Badge Quick Edit.</li>\n<li><strong>NEW</strong> &#8211; Introduced a new shortcode mycred_referral_stats which shows the referral stats for logged-in users.</li>\n<li><strong>NEW</strong> &#8211; Introduced a new template tag %user_name% for &#8220;Signup Referral&#8221; log template.</li>\n<li><strong>NEW</strong> &#8211; Introduced a setting for uninstalling. Now users can select which data will be deleted during myCred uninstall.</li>\n<li><strong>NEW</strong> &#8211; Introduced new action hook mycred_after_points_referral.</li>\n<li><strong>NEW</strong> &#8211; Introduced new action hook mycred_after_referring_signups.</li>\n<li><strong>NEW</strong> &#8211; Introduced new filter hook mycred_hook_referrals.</li>\n<li><strong>NEW</strong> &#8211; Introduced new filter hook mycred_before_hooks_save.</li>\n<li><strong>NEW</strong> &#8211; Introduced new fitler hook mycred_woo_gateway_user_id.</li>\n<li><strong>FIX</strong> &#8211; Unable to deactivate point types in buyCred Setting.</li>\n<li><strong>FIX</strong> &#8211; The user was unable to export the log from the frontend.</li>\n<li><strong>FIX</strong> &#8211; Height and width attributes in the mycred_my_badges shortcode were not working.</li>\n<li><strong>FIX</strong> &#8211; myCred Cubepoints importer was not importing date correctly.</li>\n<li><strong>FIX</strong> &#8211; If badges AND ranks were not active email notifications were not sending emails.</li>\n<li><strong>FIX</strong> &#8211; The user was unable to export the log from the frontend.</li>\n<li><strong>FIX</strong> &#8211; In the mycred_sales_history shortcode expires time was incorrect.</li>\n<li><strong>FIX</strong> &#8211; A broken image shows when the badge image does not set.</li>\n</ul>\n<h4>2.1.0.3</h4>\n<ul>\n<li><strong>FIX</strong> &#8211; Email notification issues.</li>\n<li><strong>FIX</strong> &#8211; Broken image if badge default image wasn&#8217;t set.</li>\n<li><strong>FIX</strong> &#8211; mycred_my_badges width and height attributes wasn&#8217;t working.</li>\n</ul>\n<h4>2.1.0.2</h4>\n<p>Improvement &#8211; Code optimization</p>\n<h4>2.1.0.1</h4>\n<ul>\n<li><strong>FIX</strong> &#8211; Remove warnings</li>\n</ul>\n<h4>2.1</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Open badge functionality in myCred Badge addon.</li>\n<li><strong>NEW</strong> &#8211; Introduce Achievement Types.</li>\n<li><strong>NEW</strong> &#8211; Introduce a new shortcode mycred_badges_list.</li>\n<li><strong>NEW</strong> &#8211; Single badge page.</li>\n<li><strong>NEW</strong> &#8211; Added support into Badges for Anniversary hook.</li>\n<li><strong>NEW</strong> &#8211; Added support into Badges for wooCommerce purchase reward.</li>\n<li><strong>NEW</strong> &#8211; Added %rank_title% template tag support in Email Notifications.</li>\n<li><strong>NEW</strong> &#8211; Added attributes in mycred_transfer shortcode.</li>\n<li><strong>FIX</strong> &#8211; mycred_history shortcode pagination not working properly when cache enabled.</li>\n<li><strong>FIX</strong> &#8211; Ranks weren&#8217;t working properly on the current balance.</li>\n<li><strong>FIX</strong> &#8211; mycred_sell_this shortcode not working in the bbPress topic</li>\n<li><strong>FIX</strong> &#8211; The central deposit missing log entry in some cases.</li>\n<li><strong>TWEAK</strong> &#8211; Removed deprecated functions.</li>\n<li><strong>TWEAK</strong> &#8211; Code Improvement.</li>\n<li><strong>TWEAK</strong> &#8211; Improve styling of mycred_transfer shortcode.</li>\n</ul>\n<h4>2.0.2</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; Added compatibility for multiple currencies in CashCred Paypal addon</li>\n<li><strong>FIX</strong> &#8211; Php erros in myCred woocommerce gateway</li>\n<li><strong>FIX</strong> &#8211; Points on daily visit hooks not working in some conditions</li>\n<li><strong>FIX</strong> &#8211; myCred CashCred multisite issues</li>\n<li><strong>TWEAK</strong> &#8211; license system</li>\n</ul>\n<h4>2.0.1</h4>\n<ul>\n<li><strong>FIX</strong> &#8211; myCred membership license not activating for members</li>\n</ul>\n<h4>2.0</h4>\n<ul>\n<li><strong>NEW</strong> &#8211; myCred CashCred</li>\n<li><strong>NEW</strong> &#8211; Added filter &#8216;mycred_link_click_amount&#8217;</li>\n<li><strong>NEW</strong> &#8211; Added exclude attribute in myCred leaderboard</li>\n<li><strong>NEW</strong> &#8211; Added &#8216;NOT LIKE&#8217; and &#8216;!=&#8217; operator for expiration addon</li>\n<li><strong>FIX</strong> &#8211; Php notices in rank addon</li>\n<li><strong>FIX</strong> &#8211; Rewards points option not visible for other product type in woocommerce</li>\n<li><strong>FIX</strong> &#8211; Erros in mycred_total_balance shortcode</li>\n<li><strong>FIX</strong> &#8211; myCred logs export issue</li>\n<li><strong>FIX</strong> &#8211; Fixed mycred admin dashboard overview widget showing incorrect or same amount of points</li>\n<li><strong>FIX</strong> &#8211; buyCred gift_to attribute not working</li>\n<li><strong>TWEAK</strong> &#8211; myCred Central Deposit</li>\n</ul>\n<h4>Previous Versions</h4>\n<p>https://mycred.me/support/changelog/</p>\n"
    },
    "short_description": "A WordPress gamification plugin is also a points management system. Award ranks, loyalty points and rewards or WooCommerce rewards to your users.",
    "description": "<p>myCred is an intelligent and adaptive <strong>points management system</strong> that allows you to build and manage a broad range of digital rewards including points, ranks and, badges on your WordPress/WooCommerce powered website.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/-M19tzYo1jo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Build <strong>brand loyalty</strong> by rewarding your customers through store reward systems, cash back, community leaderboard, website content monetization, etc. &#8211; The possibilities are endless.</p>\n<p><strong>Increase customer engagement tenfold &#8211; Rewarding your users for community engagement will help your business grow.</strong></p>\n<h4>AMAZING AWARD SYSTEMS TO ENGAGE AND REWARD LOYAL CUSTOMERS</h4>\n<p>myCred allows <strong>THREE different ways</strong> through which you can award your users:</p>\n<ul>\n<li>\n<p><strong>Points &#8211;</strong> Set events and triggers to allow real-time tracking and automatically award your users with loyalty points and daily rewards.</p>\n</li>\n<li>\n<p><strong>Ranks &#8211;</strong> Set ranks within your leaderboards and reward your users with significant perks after they reach a certain milestone.</p>\n</li>\n<li>\n<p><strong>Badges &#8211;</strong> Boost your users&#8217; participation by rewarding them for their exceptional performance.</p>\n</li>\n<li>\n<p>Gain access to 50+ myCred add-ons.</p>\n</li>\n<li>Premium support &amp; priority updates.</li>\n<li>License key for all add-ons.</li>\n<li>Connect multiple sites with just one license key.</li>\n<li>Upgrade your package at any time to get more add-ons.</li>\n</ul>\n<p><a href=\"https://mycred.me/membership/\" rel=\"nofollow ugc\">Check package pricing page for add-on list</a></p>\n<h4>WooCommerce Cart &amp; Checkout Block Compatibility</h4>\n<p>myCred is compatible with WooCommerce’s cart &amp; checkout block compatibility, making it easier for users to fill out checkout page seamlessly and win WooCommerce rewards.</p>\n<h4>Features</h4>\n<h4>Point Management</h4>\n<p>Empower your users by rewarding them points and rewards &#8211; each user has their own POINT BALANCE to purchase online products, cash back, or online activities.</p>\n<p><strong>&#8211; Point Balances</strong>: Each user on your website will have their own point balance, where they can gain/lose viewpoints.<br />\n<strong>&#8211; Account History</strong>: Each time a user gains or loses points on your website, transaction is logged into a central log.<br />\n<strong>&#8211; Points Management</strong>: You have full control over your users&#8217; point balances. Adjust user balance by adding or removing points and rewards with or without a log entry.<br />\n<strong>&#8211; Automatic Points</strong>: Automatically award or deduct points from your user&#8217;s balance for their interaction on your WordPress/WooCommerce or gamification based website.<br />\n<strong>&#8211; Multiple Point Types</strong>: Create multiple point types through admin area to manage things easily. There is no limit to the number of point types you can have at your disposal.<br />\n<strong>&#8211; Buy Points</strong>: buyCred add-on allows your users to purchase points and rewards using real money using some of most popular payment gateways available in market today.<br />\n<strong>&#8211; Store Payments</strong>: myCred supports some of most popular store plugins for WordPress, allowing your users to pay for orders/tickets using their point balance instead of real money.<br />\n<strong>&#8211; Upload Point-type image</strong>: Give your gamification point type a unique identity by assigning them an image. Use it to create a WooCommerce wallet.<br />\n<strong>&#8211; Import/Export Points and Point Types</strong>: Save time by importing/exporting user points and point types (all  or specific). You can also export setup settings for all point types.<br />\n<strong>&#8211; Import/Export Setup Settings</strong>: Setup myCred quickly by importing/exporting setup settings in JSON format. Export option is available for all or specific user fields.</p>\n<h4>Badges &amp; Ranks</h4>\n<p><strong>&#8211;  Open Badge Functionality</strong> &#8211; new opportunities to recognize and validate achievements digitally.<br />\n<strong>&#8211;  Add badge details</strong> (name, achievement, website details, etc.).<br />\n<strong>&#8211;  Badge recognition and validation</strong> through different badge verification websites.<br />\n<strong>&#8211;  Single Badge Page</strong> is an exclusive page for each badge and its information (badge name, image, badge description, achievements, and benefits)<br />\n<strong>&#8211;  Open Badge Search Filter</strong> &#8211; [myCred badge list] shortcode gives you  ability to add search fields and filters for badges.<br />\n<strong>&#8211;  Evidence Shortcode</strong> &#8211; Technical support for gamification and badge verification purposes.<br />\n<strong>&#8211;  Badge Evidence Download Button</strong> &#8211; Access Open Badges of any users on website. Admin can also download any given badge images.<br />\n<strong>&#8211;  The &#8220;Quick Edit&#8221; badge option</strong> will allow you to modify information of any particular badge.<br />\n<strong>&#8211;  Social share setting</strong> &#8211; Allow users to share their achieved badges on their social profiles.<br />\n<strong>&#8211;  Import/Export User Badges</strong> &#8211; Import/Export option for user badges (all or specific). The admin can import badges with ID/Title/Slug.<br />\n<strong>&#8211;  Import/Export User Ranks</strong> &#8211; Import/Export option for user ranks (all or specific). The admin can import ranks with ID/Title/Slug.<br />\n<strong>&#8211;  Export Options</strong> &#8211; Admin can easily export badges and ranks in a raw or formatted file. Export option is available for all or specific user fields.<br />\n<strong>&#8211;  Award Badges/Ranks on Coupons</strong> &#8211; Assign user badges, ranks, and WooCommerce rewards to coupons so that users will get rewarded when using specific coupons at checkout.<br />\n<strong>&#8211;  Attributes</strong> &#8211; Add title, excerpt, and display attributes in mycred_my_badges shortcode to make it a digital wallet system.</p>\n<h4>cashCred</h4>\n<p><strong>GIVE USERS THE POWER TO CONVERT THEIR MYCRED POINTS INTO REAL MONEY.</strong></p>\n<p>cashCred is a built-in myCred add-on that allows users to redeem myCred points as a digital wallet for real money. Earn points through myCred&#8217;s intelligent rewards system. Instead of cash, reward users with points that can be encashed.</p>\n<p>cashCred works perfectly with a reward system that engages users to perform activities that require user interaction (watching a video, filling out a survey, and more).</p>\n<p><strong>&#8211;  Convert Points to Cash</strong> &#8211; Users can redeem myCred points for money.<br />\n<strong>&#8211;  Multiple Point Types</strong> &#8211; Allow multiple custom point types.<br />\n<strong>&#8211;  Exchange Rates</strong> &#8211; Define exchange rates for each points type.<br />\n<strong>&#8211;  Cash Withdrawal</strong> &#8211; Users can send a request to admin for cash withdrawal or cashback.<br />\n<strong>&#8211;  User Requests</strong> &#8211; Approve or deny user requests for cash withdrawal.<br />\n<strong>&#8211;  Additional Notes</strong> &#8211; Write additional notes for users, which will be displayed on the payment form.<br />\n<strong>&#8211;  Currency Code</strong> &#8211; Define currency code (USD, GBP, AUD, etc.) for the payment form.<br />\n<strong>&#8211;  Shortcode Support</strong> &#8211; Display cashCred module on website using a shortcode.<br />\n<strong>&#8211;  Set Limits &amp; Restrictions</strong> &#8211; Set minimum or maximum restriction limits on point conversion requests.<br />\n<strong>&#8211;  Pay Through PayPal</strong> &#8211; cashCred supports payment through PayPal.<br />\n<strong>&#8211;  Pay Through Stripe</strong> &#8211; cashCred supports payment through Stripe.<br />\n<strong>&#8211;  Create email events/templates</strong> for cashCred pending/approved/cancel requests.<br />\n<strong>&#8211;  Point Transfer</strong> &#8211; Users can transfer cashCred points to other users.<br />\n<strong>&#8211;  Min/Max Fee</strong> &#8211; Setup Numerical Difference (set a range for Minimum and Maximum fee).<br />\n<strong>&#8211;  Fees (points/percentage)</strong> &#8211; Setup Parameters (fees can be set up using points or percentage).<br />\n<strong>&#8211;  Registered References</strong> &#8211; All registered references will be listed on support page.</p>\n<h4>Template Tags</h4>\n<p><strong>&#8211;  Signup Referral Hook (%user_name%)</strong> &#8211; This hook returns a username whenever a user signup using a referral link.<br />\n<strong>&#8211;  Sell Content (%Price%)</strong> &#8211; This template tag returns number of points a user needs to purchase content.<br />\n<strong>&#8211;  Badges (%badge_title% and %badge_image%)</strong> &#8211; Display users&#8217; new badge title and image in outgoing email.<br />\n<strong>&#8211;  Ranks (%rank_title% and %rank_image%)</strong> &#8211; Display users&#8217; new rank title and image in outgoing email.</p>\n<h4>Dedicated Log</h4>\n<p>Each time myCred adds or deducts points from a user, adjustment is logged in a dedicated log, allowing your users to browse their history. This log keeps a record of your user&#8217;s accountability, badges, and ranks, among other useful statistics.</p>\n<p>This log data can be converted into charts to help you visualize the usage and circulation of points on your website.</p>\n<p>You can achieve following features by using a dedicated log for your points system:</p>\n<ul>\n<li>Set a limit to maximum number of times each hook can give out points to your user.</li>\n<li>Badges will use the log&#8217;s data to determine which user has earned a badge.</li>\n<li>Add-ons such as Sell Content use log to track users who have purchased posts from your website.</li>\n<li>Add-ons use log to ensure that a user does not gain repetitive points for same interaction within a given time frame.</li>\n</ul>\n<h4>Central Deposit</h4>\n<p>Central Deposit is a built-in add-on that allows admin to nominate any available user account to become  primary account from where all point-related transactions are managed.</p>\n<ul>\n<li><strong>Central Deposit Account</strong> &#8211; Admin can choose any existing user account to become a central deposit account that controls all points and their transactions.</li>\n<li><strong>Centralized Transaction Mangement</strong> &#8211; Any points spent or earned are recorded in a point log that can be accessed from user&#8217;s myCred admin dashboard.</li>\n<li><strong>Ignore Manual Adjustments</strong> &#8211; After a central deposit account is nominated, the admin can not add points to customer&#8217;s account manually.</li>\n<li><strong>Set Starting from</strong> &#8211; Setup starting date </li>\n<li><strong>Interval (in days)</strong> &#8211; Deposit points after x days interval.</li>\n<li><strong>Amount</strong> &#8211; The amount of points to be scheduled.</li>\n<li><strong>Recurring</strong> &#8211; Enabling this options will deposit the amount recursively after defined interval. We have also added two new email triggers for Central deposit.</li>\n<li>Added Email notification on Minimum balance in central deposit.</li>\n<li>Added Email notification on No balance Left in central deposit.</li>\n</ul>\n<h4>Achievements/Assets</h4>\n<ul>\n<li>Issue badges for any combination of achievements.</li>\n<li>Detailed badge categorization.</li>\n<li>Industry-related achievements.</li>\n<li>Achievement list Shortcode allows you to display myCred badge listing in tabs individually or in a category. </li>\n</ul>\n<h4>Additional features</h4>\n<p><strong>&#8211;  White-Labeling: myCred has built-in support for white-labeling</strong>: This allows you to rename plugin in your admin area to anything you like such as WooCommerce rewards or cashback.<br />\n<strong>&#8211;  Import &amp; Export</strong>: myCred comes with three built-in import tools allowing you to import points, use gamification, log entries, or migrate your CubePoints installation.<br />\n<strong>&#8211;  Multi-Site Support</strong>: myCred has built-in support for multi-sites, allowing you to choose between using a unique myCred installation or centralize balances across your network.<br />\n<strong>&#8211;  Leaderboards</strong>: Generate leaderboards based on your user&#8217;s balance or points history &#8211; display users with the most points for a particular instance.<br />\n<strong>&#8211;  Theme Independent</strong>: The myCred plugin is theme independent &#8211; Your theme needs to support widgets and shortcodes to run myCred.<br />\n<strong>&#8211;  BuddyPress Ready</strong>: myCred has had built-in support for BuddyPress through which you can access BuddyPress-related features like Insert point balances/badges/ranks into your user&#8217;s profiles.<br />\n<strong>&#8211;  A &#8220;Bulk Assign&#8221; tool</strong> for awarding/revoking points, badges, and ranks in bulk.<br />\n<strong>&#8211;  Enable/Disable add-ons</strong> &#8211; Save time and use toggle buttons for enabling or disabling add-ons.<br />\n<strong>&#8211;  Treasures</strong> &#8211; A brand new collection of attractive graphical images that can be used for ranks and badges.</p>\n<h4>BUILT-IN ADD-ONS</h4>\n<p>myCred is much more than just a point management system or a gamification plugin &#8211; It comes with several <a href=\"https://www.mycred.me/add-ons/\" rel=\"nofollow ugc\">built-in add-ons</a> like WooCommerce rewards that enable you to perform complex tasks such as transfer or buy points for real money, allow payments in stores, etc.</p>\n<p><strong>&#8211; Badges:</strong> Award your users badges based on their points history using gamification.<br />\n<strong>&#8211; buyCred:</strong> Let your users buy points in exchange for real money.<br />\n<strong>&#8211; Coupons:</strong> Create coupons that can be redeemed for points.<br />\n<strong>&#8211; Email notifications:</strong> Setup email notifications for status updates.<br />\n<strong>&#8211; Gateway:</strong> Let users pay with points in your store.<br />\n<strong>&#8211; Notifications:</strong> Enable popup notifications that display status updates.<br />\n<strong>&#8211; Ranks:</strong> Create ranks based on the user&#8217;s point balance.<br />\n<strong>&#8211; Sell Content:</strong> Sell your content in exchange for points.<br />\n<strong>&#8211; Statistics:</strong> Get a statistical overview of points in circulation, etc.<br />\n<strong>&#8211; Transfers:</strong> Allow your users to transfer points to other users.</p>\n<h4>myCred WooCommerce</h4>\n<p>myCred WooCommerce offers seamless integration with WooCommerce, improving your e-commerce experience. This built-in adddon introduces five key features: compatibility with WooCommerce blocks, points for each order, points for first orders, points for order ranges, and points for several orders. Earn rewards based on various order criteria, while admins have full control over points allocation through customizable hooks. The addon also supports myCred as a payment gateway, displaying user points or balances on the cart &amp; checkout pages.</p>\n<h4>BUILT-IN PLUGIN SUPPORT</h4>\n<p>myCred supports some of the most popular WordPress plugins like <strong>BuddyPress, WooCommerce, Jetpack, Contact Form 7, Disqus, Gravity Forms,</strong> among countless others for gamification.</p>\n<p><strong>Simple &amp; organized</strong> To keep your admin area organized, myCred will only show features and setting for those third-party plugins that are installed and enabled.</p>\n<h4>INTEGRATED WITH THE MOST POPULAR LEARNING MANAGEMENT SYSTEMS</h4>\n<p>myCred is integrated with a large number of popular learning management systems, that include:</p>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/mycred-learndash/\" rel=\"ugc\">LearnDash</a></li>\n<li><a href=\"https://wordpress.org/plugins/mycred-lifterlms-integration/\" rel=\"ugc\">LifterLMS</a></li>\n<li><a href=\"https://wplms.io/support/knowledge-base/wplms-mycred-add-on/\" rel=\"nofollow ugc\">WPLMS</a> (Free third-party integration)</li>\n<li><a href=\"https://thimpress.com/product/mycred-add-on-for-learnpress/\" rel=\"nofollow ugc\">LearnPress</a> (Paid third-party integration).</li>\n</ul>\n<h4>MYCRED&#8217;S INTEGRATION WITH YOUR FAVORITE PAGE BUILDERS:</h4>\n<ul>\n<li><a href=\"https://www.mycred.me/store/mycred-elementor/\" rel=\"nofollow ugc\">myCred Elementor</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-beaver-builder/\" rel=\"nofollow ugc\">myCred Beaver Builder</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-for-wpbakery-page-builder/\" rel=\"nofollow ugc\">myCred for WPBakery Page Builder</a></li>\n</ul>\n<h4>MYCRED OFFERS A VARIETY OF FREE PLUGINS THAT INCLUDE:</h4>\n<ul>\n<li><a href=\"https://www.mycred.me/store/mycred-lifterlms-integration/\" rel=\"nofollow ugc\">LifterLMS Plugin Integration with myCred</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-bp-group-leaderboards/\" rel=\"nofollow ugc\">myCred BP Group Leaderboards</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-for-wp-pro-quiz/\" rel=\"nofollow ugc\">myCred for WP-Pro-Quiz</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-for-rating-form/\" rel=\"nofollow ugc\">myCred for Rating Form</a><br />\n<a href=\"https://www.mycred.me/product-category/freebies/\" rel=\"nofollow ugc\">Explore to find out more&#8230;</a></li>\n</ul>\n<h4>MYCRED&#8217;S THIRD-PARTY BRIDGES PLUGINS:</h4>\n<ul>\n<li><a href=\"https://www.mycred.me/store/buycred-stripe/\" rel=\"nofollow ugc\">Stripe &#8211; buyCred Gateway</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-for-easy-digital-downloads/\" rel=\"nofollow ugc\">Easy Digital Downloads &#8211; myCred Gateway</a></li>\n<li><a href=\"https://mycred.me/store/mycred-zapier-addon/\" rel=\"nofollow ugc\">myCred Zapier Addon</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-dokan/\" rel=\"nofollow ugc\">myCred Dokan</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-wc-vendors/\" rel=\"nofollow ugc\">myCred WCVendors</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-learndash/\" rel=\"nofollow ugc\">myCred Learndash</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-for-users-ultra/\" rel=\"nofollow ugc\">myCred for Users Ultra</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-for-user-pro/\" rel=\"nofollow ugc\">myCred for User Pro</a></li>\n</ul>\n<h4>MYCRED&#8217;S GAMIFICATION PLUGINS:</h4>\n<ul>\n<li><a href=\"https://www.mycred.me/store/mycred-pacman/\" rel=\"nofollow ugc\">myCred PacMan</a></li>\n<li><a href=\"https://www.mycred.me/store/wheel-of-fortune-add-on/\" rel=\"nofollow ugc\">Wheel of Fortune Add-On</a></li>\n</ul>\n<h4>MYCRED&#8217;S ENHANCEMENT PLUGINS:</h4>\n<ul>\n<li><a href=\"https://www.mycred.me/store/mycred-woocommerce-plus/\" rel=\"nofollow ugc\">myCred WooCommerce Plus</a></li>\n<li><a href=\"https://mycred.me/store/mycred-email-digest/\" rel=\"nofollow ugc\">myCred Email Digest</a></li>\n<li><a href=\"https://mycred.me/store/mycred-progress-map/\" rel=\"nofollow ugc\">myCred Progress Map</a></li>\n<li><a href=\"https://mycred.me/store/mycred-points-cap/\" rel=\"nofollow ugc\">myCred Points Cap</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-level-cred/\" rel=\"nofollow ugc\">myCred Level Cred</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-social-proof/\" rel=\"nofollow ugc\">myCred Social Proof</a></li>\n<li><a href=\"https://www.mycred.me/store/sms-payments/\" rel=\"nofollow ugc\">myCred SMS Payments &#8211; Twilio Transfers</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-expiration-add-on/\" rel=\"nofollow ugc\">myCred Expiration Add on</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-social-share-add-on/\" rel=\"nofollow ugc\">myCred Social Share Add on</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-progress-bar-add-on/\" rel=\"nofollow ugc\">myCred Progress Bar Add on</a></li>\n<li><a href=\"https://www.mycred.me/store/jw-player-with-mycred/\" rel=\"nofollow ugc\">myCred Video Add-on For JW Player</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-bp-charges/\" rel=\"nofollow ugc\">myCred BP Charges</a></li>\n<li><a href=\"https://www.mycred.me/store/mycred-rest-api/\" rel=\"nofollow ugc\">myCred Rest API</a></li>\n<li><a href=\"https://www.mycred.me/store/transfer-plus/\" rel=\"nofollow ugc\">myCred Transfer Plus</a></li>\n<li><a href=\"https://www.mycred.me/store/video-add-on/\" rel=\"nofollow ugc\">myCred Video Add-on For Vimeo</a></li>\n<li><a href=\"https://www.mycred.me/store/notifications-plus-add-on/\" rel=\"nofollow ugc\">myCred Notifications Plus Add-on</a></li>\n</ul>\n<h4>Documentation</h4>\n<p>You can find extensive <a href=\"http://codex.mycred.me/\" rel=\"nofollow ugc\">documentation</a> on myCred related add-ons in the myCred Codex. You can also find a list of <a href=\"https://mycred.me/about/faq/\" rel=\"nofollow ugc\">frequently asked</a> questions on the myCred website.</p>\n<h4>Customizations</h4>\n<p>myCred has the ability to do-it-all because we have put in a lot of effort to make sure that the supported plugins are as developer-friendly as possible. If you need to build a custom feature, simply submit a <a href=\"https://mycred.me/customize/request-quote/\" rel=\"nofollow ugc\">request for a quote</a> via the myCred website.</p>\n<h4>Support</h4>\n<p>We offer support on our <a href=\"https://mycred.me/support/\" rel=\"nofollow ugc\">myCred website</a> from 9 AM &#8211; 5 PM, Monday to Friday (GMT+5).</p>\n<p>You can either submit a <a href=\"https://mycred.me/customize/request-quote/\" rel=\"nofollow ugc\">customization request</a> or open a <a href=\"https://mycred.me/support/\" rel=\"nofollow ugc\">support ticket</a> any time you&#8217;re facing trouble with myCred.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/mycred.2.7.3.zip",
    "upgrade_notice": {
        "2.7.3": "<p>Code improvement.</p>",
        "2.7.2": "<p>Compatible with WordPress Version 6.6.1.</p>",
        "2.7.1": "<p>Bug fixes.</p>",
        "2.7.0": "<p>New features and improvements.</p>",
        "2.6.5": "<p>Compatible with WordPress Version 6.5.2.</p>",
        "2.6.4": "<p>Code improvement.</p>",
        "2.6.3": "<p>Bug fixes and improvements.</p>",
        "2.6.2": "<p>Bug fixes.</p>",
        "2.6.1": "<p>Bug fixes.</p>",
        "2.6": "<p>Improvements.</p>",
        "2.5.3": "<p>Updated Feedback library to the latest version.</p>",
        "2.5.2": "<p>Improvements.</p>",
        "2.5.1": "<p>New features and Bug fixes.</p>",
        "2.5": "<p>New features and Bug fixes.</p>",
        "2.4.10": "<p>Bug fixes.</p>",
        "2.4.9": "<p>New features and Bug fixes.</p>",
        "2.4.8.1": "<p>Bug fixes.</p>",
        "2.4.8": "<p>Bug fixes.</p>",
        "2.4.7": "<p>Bug fixes.</p>",
        "2.4.6.1": "<p>Bug fixes.</p>",
        "2.4.6": "<p>New features and Bug fixes.</p>",
        "2.4.5.4": "<p>Bug fixes.</p>",
        "2.4.5.3": "<p>Bug fixes.</p>",
        "2.4.5.2": "<p>Bug fixes.</p>",
        "2.4.5.1": "<p>Bug fixes.</p>",
        "2.4.5": "<p>Code improvement.</p>",
        "2.4.4.4": "<p>Bug fixes.</p>",
        "2.4.4.3": "<p>Code improvement.</p>",
        "2.4.4.2": "<p>Code improvement.</p>",
        "2.4.4.1": "<p>Improvement and Bug fixes.</p>",
        "2.4.4": "<p>New features and Bug fixes.</p>",
        "2.4.3": "<p>Code improvement.</p>",
        "2.4.2": "<p>Code improvement.</p>",
        "2.4.1": "<p>New features and Bug fixes.</p>",
        "2.4": "<p>New features and Bug fixes.</p>",
        "2.3.2": "<p>Code improvement.</p>",
        "2.3.1": "<p>Improve license system.</p>",
        "2.3": "<p>New features and Bug fixes.</p>",
        "2.2": "<p>New features and Bug fixes.</p>",
        "2.1.1": "<p>New features and Bug fixes.</p>",
        "2.1": "<p>New features and Bug fixes.</p>",
        "2.0": "<p>The banking module have been replaced by Central deposite module, and interest related functionality has been removed. If you are using simple interest or compound interest related functionality, you will fine the respective functionalities missing after the update.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/mycred/assets/screenshot-1.png?rev=2990725",
            "caption": "<strong>Point Type Image</strong>"
        },
        {
            "src": "https://ps.w.org/mycred/assets/screenshot-2.png?rev=2990725",
            "caption": "<strong>Built in Add-ons</strong>"
        },
        {
            "src": "https://ps.w.org/mycred/assets/screenshot-3.png?rev=2990725",
            "caption": "<strong>Free Add-ons</strong>"
        },
        {
            "src": "https://ps.w.org/mycred/assets/screenshot-4.png?rev=2990725",
            "caption": "<strong>Premium Add-ons</strong>"
        },
        {
            "src": "https://ps.w.org/mycred/assets/screenshot-5.png?rev=2990725",
            "caption": "<strong>Badges Social Share</strong>"
        },
        {
            "src": "https://ps.w.org/mycred/assets/screenshot-6.png?rev=2990725",
            "caption": "<strong>Badges Layout &amp; Alignment</strong>"
        },
        {
            "src": "https://ps.w.org/mycred/assets/screenshot-7.png?rev=2990725",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/mycred/assets/screenshot-8.png?rev=2990725",
            "caption": ""
        }
    ],
    "tags": {
        "badges": "badges",
        "gamification": "gamification",
        "loyalty": "Loyalty",
        "points": "points",
        "rewards": "Rewards"
    },
    "stable_tag": "2.7.3",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/mycred.1.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/mycred.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/mycred.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/mycred.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/mycred.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/mycred.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/mycred.1.0.6.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/mycred.1.0.7.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/mycred.1.0.8.zip",
        "1.0.9": "https://downloads.wordpress.org/plugin/mycred.1.0.9.zip",
        "1.0.9.1": "https://downloads.wordpress.org/plugin/mycred.1.0.9.1.zip",
        "1.0.9.2": "https://downloads.wordpress.org/plugin/mycred.1.0.9.2.zip",
        "1.0.9.3": "https://downloads.wordpress.org/plugin/mycred.1.0.9.3.zip",
        "1.1": "https://downloads.wordpress.org/plugin/mycred.1.1.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/mycred.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/mycred.1.1.2.zip",
        "1.2": "https://downloads.wordpress.org/plugin/mycred.1.2.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/mycred.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/mycred.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/mycred.1.2.3.zip",
        "1.3": "https://downloads.wordpress.org/plugin/mycred.1.3.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/mycred.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/mycred.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/mycred.1.3.3.zip",
        "1.3.3.1": "https://downloads.wordpress.org/plugin/mycred.1.3.3.1.zip",
        "1.3.3.2": "https://downloads.wordpress.org/plugin/mycred.1.3.3.2.zip",
        "1.4": "https://downloads.wordpress.org/plugin/mycred.1.4.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/mycred.1.4.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/mycred.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/mycred.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/mycred.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/mycred.1.4.5.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/mycred.1.4.6.zip",
        "1.4.7": "https://downloads.wordpress.org/plugin/mycred.1.4.7.zip",
        "1.5": "https://downloads.wordpress.org/plugin/mycred.1.5.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/mycred.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/mycred.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/mycred.1.5.3.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/mycred.1.5.4.zip",
        "1.6": "https://downloads.wordpress.org/plugin/mycred.1.6.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/mycred.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/mycred.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/mycred.1.6.3.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/mycred.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/mycred.1.6.5.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/mycred.1.6.6.zip",
        "1.6.7": "https://downloads.wordpress.org/plugin/mycred.1.6.7.zip",
        "1.6.8": "https://downloads.wordpress.org/plugin/mycred.1.6.8.zip",
        "1.6.9": "https://downloads.wordpress.org/plugin/mycred.1.6.9.zip",
        "1.7": "https://downloads.wordpress.org/plugin/mycred.1.7.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/mycred.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/mycred.1.7.2.zip",
        "1.7.3": "https://downloads.wordpress.org/plugin/mycred.1.7.3.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/mycred.1.7.4.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/mycred.1.7.5.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/mycred.1.7.6.zip",
        "1.7.7": "https://downloads.wordpress.org/plugin/mycred.1.7.7.zip",
        "1.7.8": "https://downloads.wordpress.org/plugin/mycred.1.7.8.zip",
        "1.7.8.1": "https://downloads.wordpress.org/plugin/mycred.1.7.8.1.zip",
        "1.7.9": "https://downloads.wordpress.org/plugin/mycred.1.7.9.zip",
        "1.7.9.1": "https://downloads.wordpress.org/plugin/mycred.1.7.9.1.zip",
        "1.7.9.2": "https://downloads.wordpress.org/plugin/mycred.1.7.9.2.zip",
        "1.7.9.3": "https://downloads.wordpress.org/plugin/mycred.1.7.9.3.zip",
        "1.7.9.4": "https://downloads.wordpress.org/plugin/mycred.1.7.9.4.zip",
        "1.7.9.5": "https://downloads.wordpress.org/plugin/mycred.1.7.9.5.zip",
        "1.7.9.6": "https://downloads.wordpress.org/plugin/mycred.1.7.9.6.zip",
        "1.7.9.7": "https://downloads.wordpress.org/plugin/mycred.1.7.9.7.zip",
        "1.7.9.8": "https://downloads.wordpress.org/plugin/mycred.1.7.9.8.zip",
        "1.8": "https://downloads.wordpress.org/plugin/mycred.1.8.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/mycred.1.8.1.zip",
        "1.8.11": "https://downloads.wordpress.org/plugin/mycred.1.8.11.zip",
        "1.8.12": "https://downloads.wordpress.org/plugin/mycred.1.8.12.zip",
        "1.8.13": "https://downloads.wordpress.org/plugin/mycred.1.8.13.zip",
        "1.8.13.1": "https://downloads.wordpress.org/plugin/mycred.1.8.13.1.zip",
        "1.8.14": "https://downloads.wordpress.org/plugin/mycred.1.8.14.zip",
        "1.8.14.1": "https://downloads.wordpress.org/plugin/mycred.1.8.14.1.zip",
        "1.8.14.2": "https://downloads.wordpress.org/plugin/mycred.1.8.14.2.zip",
        "1.8.2": "https://downloads.wordpress.org/plugin/mycred.1.8.2.zip",
        "1.8.3": "https://downloads.wordpress.org/plugin/mycred.1.8.3.zip",
        "1.8.4": "https://downloads.wordpress.org/plugin/mycred.1.8.4.zip",
        "1.8.4.1": "https://downloads.wordpress.org/plugin/mycred.1.8.4.1.zip",
        "1.8.5": "https://downloads.wordpress.org/plugin/mycred.1.8.5.zip",
        "1.8.5.1": "https://downloads.wordpress.org/plugin/mycred.1.8.5.1.zip",
        "1.8.6": "https://downloads.wordpress.org/plugin/mycred.1.8.6.zip",
        "1.8.7": "https://downloads.wordpress.org/plugin/mycred.1.8.7.zip",
        "1.8.8": "https://downloads.wordpress.org/plugin/mycred.1.8.8.zip",
        "1.8.9": "https://downloads.wordpress.org/plugin/mycred.1.8.9.zip",
        "2.0": "https://downloads.wordpress.org/plugin/mycred.2.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/mycred.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/mycred.2.0.2.zip",
        "2.1": "https://downloads.wordpress.org/plugin/mycred.2.1.zip",
        "2.1.0.2": "https://downloads.wordpress.org/plugin/mycred.2.1.0.2.zip",
        "2.1.0.3": "https://downloads.wordpress.org/plugin/mycred.2.1.0.3.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/mycred.2.1.1.zip",
        "2.2": "https://downloads.wordpress.org/plugin/mycred.2.2.zip",
        "2.3": "https://downloads.wordpress.org/plugin/mycred.2.3.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/mycred.2.3.1.zip",
        "2.3.1-beta.1": "https://downloads.wordpress.org/plugin/mycred.2.3.1-beta.1.zip",
        "2.3.2": "https://downloads.wordpress.org/plugin/mycred.2.3.2.zip",
        "2.4": "https://downloads.wordpress.org/plugin/mycred.2.4.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/mycred.2.4.1.zip",
        "2.4.10": "https://downloads.wordpress.org/plugin/mycred.2.4.10.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/mycred.2.4.2.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/mycred.2.4.3.zip",
        "2.4.3.1": "https://downloads.wordpress.org/plugin/mycred.2.4.3.1.zip",
        "2.4.4": "https://downloads.wordpress.org/plugin/mycred.2.4.4.zip",
        "2.4.4.1": "https://downloads.wordpress.org/plugin/mycred.2.4.4.1.zip",
        "2.4.4.2": "https://downloads.wordpress.org/plugin/mycred.2.4.4.2.zip",
        "2.4.4.2-beta.1": "https://downloads.wordpress.org/plugin/mycred.2.4.4.2-beta.1.zip",
        "2.4.4.2-beta.2": "https://downloads.wordpress.org/plugin/mycred.2.4.4.2-beta.2.zip",
        "2.4.4.2-beta.3": "https://downloads.wordpress.org/plugin/mycred.2.4.4.2-beta.3.zip",
        "2.4.4.3": "https://downloads.wordpress.org/plugin/mycred.2.4.4.3.zip",
        "2.4.4.4": "https://downloads.wordpress.org/plugin/mycred.2.4.4.4.zip",
        "2.4.5": "https://downloads.wordpress.org/plugin/mycred.2.4.5.zip",
        "2.4.5.1": "https://downloads.wordpress.org/plugin/mycred.2.4.5.1.zip",
        "2.4.5.2": "https://downloads.wordpress.org/plugin/mycred.2.4.5.2.zip",
        "2.4.5.3": "https://downloads.wordpress.org/plugin/mycred.2.4.5.3.zip",
        "2.4.5.3-beta": "https://downloads.wordpress.org/plugin/mycred.2.4.5.3-beta.zip",
        "2.4.5.4": "https://downloads.wordpress.org/plugin/mycred.2.4.5.4.zip",
        "2.4.6": "https://downloads.wordpress.org/plugin/mycred.2.4.6.zip",
        "2.4.6.1": "https://downloads.wordpress.org/plugin/mycred.2.4.6.1.zip",
        "2.4.7": "https://downloads.wordpress.org/plugin/mycred.2.4.7.zip",
        "2.4.8": "https://downloads.wordpress.org/plugin/mycred.2.4.8.zip",
        "2.4.8.1": "https://downloads.wordpress.org/plugin/mycred.2.4.8.1.zip",
        "2.4.9": "https://downloads.wordpress.org/plugin/mycred.2.4.9.zip",
        "2.5": "https://downloads.wordpress.org/plugin/mycred.2.5.zip",
        "2.5.1": "https://downloads.wordpress.org/plugin/mycred.2.5.1.zip",
        "2.5.2": "https://downloads.wordpress.org/plugin/mycred.2.5.2.zip",
        "2.5.3": "https://downloads.wordpress.org/plugin/mycred.2.5.3.zip",
        "2.6": "https://downloads.wordpress.org/plugin/mycred.2.6.zip",
        "2.6.1": "https://downloads.wordpress.org/plugin/mycred.2.6.1.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/mycred.2.6.2.zip",
        "2.6.3": "https://downloads.wordpress.org/plugin/mycred.2.6.3.zip",
        "2.6.3-beta": "https://downloads.wordpress.org/plugin/mycred.2.6.3-beta.zip",
        "2.6.4": "https://downloads.wordpress.org/plugin/mycred.2.6.4.zip",
        "2.6.5": "https://downloads.wordpress.org/plugin/mycred.2.6.5.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/mycred.2.7.0.zip",
        "2.7.1": "https://downloads.wordpress.org/plugin/mycred.2.7.1.zip",
        "2.7.2": "https://downloads.wordpress.org/plugin/mycred.2.7.2.zip",
        "2.7.3": "https://downloads.wordpress.org/plugin/mycred.2.7.3.zip",
        "beta2.2": "https://downloads.wordpress.org/plugin/mycred.beta2.2.zip",
        "beta2.2-2": "https://downloads.wordpress.org/plugin/mycred.beta2.2-2.zip",
        "beta2.2-3": "https://downloads.wordpress.org/plugin/mycred.beta2.2-3.zip",
        "beta2.2-4": "https://downloads.wordpress.org/plugin/mycred.beta2.2-4.zip",
        "trunk": "https://downloads.wordpress.org/plugin/mycred.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/mycred/assets/banner-772x250.jpg?rev=2699457",
        "high": "https://ps.w.org/mycred/assets/banner-1544x500.jpg?rev=2699457"
    },
    "icons": {
        "1x": "https://ps.w.org/mycred/assets/icon-128x128.gif?rev=2544137"
    },
    "blocks": {
        "mycred-woocommerce/mycred-woo-cart-block": {
            "$schema": "https://schemas.wp.org/trunk/block.json",
            "apiVersion": 2,
            "name": "mycred-woocommerce/mycred-woo-cart-block",
            "version": "1.0.0",
            "title": "myCred WooCommerce",
            "category": "woocommerce",
            "attributes": {
                "lock": {
                    "type": "object",
                    "default": {
                        "remove": true,
                        "move": true
                    }
                }
            },
            "textdomain": "mycred-woocommerce",
            "editorScript": "file:./build/index.js"
        },
        "mycred-woocommerce/mycred-woo-payment-gateway": {
            "$schema": "https://schemas.wp.org/trunk/block.json",
            "apiVersion": 2,
            "name": "mycred-woocommerce/mycred-woo-payment-gateway",
            "version": "1.0.0",
            "title": "myCred WooCommerce",
            "category": "woocommerce",
            "parent": [
                "woocommerce/checkout-payment-block"
            ],
            "attributes": {
                "lock": {
                    "type": "object",
                    "default": {
                        "remove": false,
                        "move": false
                    }
                }
            },
            "textdomain": "mycred-woocommerce",
            "editorScript": "file:./build/payment/index.js"
        },
        "mycred-woocommerce/mycred-woo-checkout-block": {
            "$schema": "https://schemas.wp.org/trunk/block.json",
            "apiVersion": 2,
            "name": "mycred-woocommerce/mycred-woo-checkout-block",
            "version": "1.0.0",
            "title": "myCred WooCommerce",
            "category": "woocommerce",
            "parent": [
                "woocommerce/checkout-totals-block"
            ],
            "attributes": {
                "lock": {
                    "type": "object",
                    "default": {
                        "remove": true,
                        "move": true
                    }
                }
            },
            "textdomain": "mycred-woocommerce",
            "editorScript": "file:./build/index.js"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "mycred",
            "language": "ja",
            "version": "2.7.3",
            "updated": "2023-11-10 12:12:08",
            "package": "http://downloads.wordpress.org/translation/plugin/mycred/2.7.3/ja.zip"
        },
        {
            "type": "plugin",
            "slug": "mycred",
            "language": "ko_KR",
            "version": "2.7.3",
            "updated": "2024-08-09 04:13:16",
            "package": "http://downloads.wordpress.org/translation/plugin/mycred/2.7.3/ko_KR.zip"
        },
        {
            "type": "plugin",
            "slug": "mycred",
            "language": "uk",
            "version": "2.7.3",
            "updated": "2024-07-23 14:17:06",
            "package": "http://downloads.wordpress.org/translation/plugin/mycred/2.7.3/uk.zip"
        },
        {
            "type": "plugin",
            "slug": "mycred",
            "language": "zh_CN",
            "version": "2.7.3",
            "updated": "2020-06-03 10:32:22",
            "package": "http://downloads.wordpress.org/translation/plugin/mycred/2.7.3/zh_CN.zip"
        }
    ]
}