{
    "name": "Ninja Forms Signature Contract Add-On",
    "slug": "ninja-signature-contract-forms-add-on",
    "version": "3.1.8.1",
    "author": "<a href=\"http://aprv.me/2ko4gfL\">ApproveMe.com</a>",
    "author_profile": "https://profiles.wordpress.org/approveme/",
    "contributors": {
        "approveme": {
            "profile": "https://profiles.wordpress.org/approveme/",
            "avatar": "https://secure.gravatar.com/avatar/620cf850230b2d03a2cf5763c9727998?s=96&d=monsterid&r=g",
            "display_name": "approveme"
        }
    },
    "requires": "4.5",
    "tested": "6.5.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 3,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 3,
    "support_url": "https://wordpress.org/support/plugin/ninja-signature-contract-forms-add-on/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 500,
    "downloaded": 38460,
    "last_updated": "2024-05-21 16:36:00",
    "added": "2016-01-25",
    "homepage": "http://aprv.me/2ko4gfL",
    "sections": {
        "description": "<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Try Ninja Forms Signature Demo Here</a></strong></p>\n<div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/174408205\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n<p><em>Please note you will need the following plugins installed to completely automate the process of collection of WordPress contracts using Ninja Forms and WP E-Signature.</em><br />\n1. <a href=\"https://wordpress.org/plugins/ninja-forms/\" rel=\"ugc\">Ninja Forms</a><br />\n2. <a href=\"http://aprv.me/2ko4gfL\" rel=\"nofollow ugc\">WP E-Signature</a> (Elite, Lifetime license)<br />\n3. <a href=\"https://www.approveme.com/ninja-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Stand Alone Document</a> (comes with above licenses)</p>\n<p>*A license is required and can be purchased at <a href=\"https://www.approveme.com/ninja-forms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">www.approveme.com</a></p>\n<p><strong>What would you do if you discover the contracts you used in running your online business were not legally binding?</strong></p>\n<h4>Ninja Forms Digital Signature Add-On</h4>\n<p>Imagine if you or your client were in a courtroom, only for the judge to discover that the e signature used on the contract with your client (or customer) was not signed using a compliant UETA/ESIGN e signature application?</p>\n<p><strong>The legal and electronic signature industry is a highly regulated sector which has strict laws and regulations regarding the electronic signature and transmission process. This is especially true for legal contracts, invoices, time sheets and employee agreements that could end up in a court room.</strong></p>\n<p>Ninja Forms is a terrific WordPress Form Plugin! It is quite possibly one of the best ways to automate any number of tasks using a WordPress website (and of course their renowned forms plugin). However, <em>signing legally binding contracts is NOT Ninja Forms primary focus</em> (it is however ApproveMe’s WP E-Signature  sole focus). We have invested many years building a system that adheres to the strictest <a href=\"http://aprv.me/2lIEKSE\" rel=\"nofollow ugc\">UETA and ESIGN</a> nationwide and foreign document signing regulations.</p>\n<p>This Signature Plugin fills the gap between a WordPress Forms plugin and an e-signature solution that is compliant with the UETA/ESIGN guidelines.</p>\n<p><strong>How this signature add-on is different from your average signature addon</strong><br />\nThe majority of WordPress contract plugins and digital signature add-ons out there are not legally binding much less UETA/ESIGN compliant (they fail to follow the countless laws and regulations guiding the document signing industry). These kinds of basic signature add-ons, only “record signature details when it is drawn, then they transmit this data to an online website server where the signature is converted and forever stored as a PNG (or JPEG) graphic file and finally saved on your own ftp server (forever).”</p>\n<p>This approach exposes you and your client’s authorized signature on the ftp website server in which your WordPress website lives. <strong>The image file of your client’s hand written legal signature (the identical signature that is used to buy a house, sign up for credit cards, purchase a car, obtain a business loan) is accessible to ALL ftp intruders; placing both you and your signer at a potential risk of identity theft.</strong></p>\n<p><strong>ApproveMe’s brand new signature add-on found at <a href=\"http://aprv.me/2ko4gfL\" rel=\"nofollow ugc\">ApproveMe.com</a> it is the connection point between a WordPress forms plugin and having a UETA / ESIGN compliant contract signing application that runs on your WordPress site.</strong></p>\n<p><strong>Check out the video clip above to find out ways to save time and money by fully automating legal contracts for your website design, digital photography, freelance or consulting business making use of our Ninja Forms Digital Signature Add-On.</strong></p>\n<p><strong>MORE ON HOW THIS SIGNATURE ADD-ON WORKS</strong></p>\n<p>**<a href=\"https://www.approveme.com/ninja-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">ApproveMe’s Signature Add-On for Ninja Forms</a> generates a UETA/ESIGN compliant court recognized contract with (optional) details/field values inserted anywhere you want them inserted in the contract.  These dynamic field values are taken from the submitted form of your end user.</p>\n<p>Your form submitter can either draw or type their legal  signature using their mouse, trackpad, tablet or smartphone.  All of this magic happens the instant an end user submits a Ninja Form by either emailing a signer specific invitation to their contract or immediately redirecting the end users.**</p>\n<p>Another highly popular use case is pre-filling contract data that might change from contract to contract. Say for instance, you are a Web Design agency and you have a standard contract you send out that varies ever so slightly every time you bring on a new client. Maybe you have optional packages available that need to be noted in your contract. But creating a new contract from scratch is incredibly time consuming.</p>\n<p>With this Ninja Forms Signature Add-On + ApproveMe’s WP E-Signature  (license) you can create a Ninja Form with the fields and sections of the contract that vary and add an additional field for the “Signers Name” + “Signers Email.”</p>\n<p>Your Ninja Form would look something like:</p>\n<p>DROPDOWN FIELD 1  = Dropdown of available packages<br />\nPARAGRAPH FIELD 2 = Classes or terms that vary from contract to contract<br />\nTEXT FIELD 2 = SIGNERS FULL NAME<br />\nTEXT FIELD 3 = SIGNERS EMAIL ADDRESS</p>\n<p>You would insert these Ninja Field values in your WP E-Signature  contract in the proper places or paragraphs that pertain to this information.</p>\n<p>You would choose the option “Email this contract whenever this form is submitted.”</p>\n<p>Now, whenever you fill out this Ninja Form, your contract will be automatically generated with the custom terms from your Ninja Form submission and then a signer invitation email will be sent to the signer email address that was given in the Ninja Form submission.</p>\n<p><em>Additional benefits of ApproveMe’s WP eSign Plugin and this for Ninja Forms Signature Add-On is that you are able to instantly create a legal contract for your clients to sign depending on their form information from a Ninja Form.</em></p>\n<p><strong>And that’s just the beginning. When a client signs…</strong></p>\n<p><em>… both you and the client will instantly get a PDF of the contract that they signed (e-signature automation at its finest).</em></p>\n<p><em>…registering or sending your client to a third-party website to sign your legal contracts is not required (all signatures take place on your WordPress website… so the experience is on your site and not someone else’s)</em></p>\n<p><em>… you’ll have a 100% legally compliant electronic signature on file to protect you AND the customer (according to UETA/ESIGN guidelines).</em></p>\n<h3>Ninja Forms Digital Signature add-on turns your WordPress site into a court recognized document signing application (but without the monthly fees… and with unlimited amount of users).</h3>\n<ul>\n<li>Ideal for anyone who wants to automate signature collection on proposals, quotes, timesheets, service terms agreements, new client legal contracts, waiver forms and much more! *</li>\n</ul>\n<p>Immediately redirect your site visitors to sign a legally binding contract after submitting a WordPress Form that was created using Ninja Forms.</p>\n<p>“I agree to terms” checkboxes have the legal standing of a limp handshake. <strong>Do the smart thing. Don’t get caught in a courtroom with a document that’s not legally binding.</strong></p>\n<p><strong>ADDON FEATURES THAT YOU CAN CUSTOMIZE</strong><br />\nWP E-Signature  offers an incredibly in depth e-signature add-on collection with several easy to customize <a href=\"https://www.approveme.com/ninja-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Ninja Forms e-signature automations</a> and <a href=\"https://www.approveme.com/esign-integrations?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">third-party integrations</a> to even further improve your personalized document signing requirements.</p>\n<p>The WordPress Online Contract platform operates on every leading PC and web browsers for smart phones. For example Chrome, FireFox, Opera, Safari, Android, iOS, and WebOS.</p>\n<p>Besides being user friendly, ApproveMe’s Ninja Forms WordPress Signature Plugin is able to instantly enter details which was posted from a Ninja Form into a UETA/ESIGN compliant and courtroom accepted contract form utilizing your own WordPress website.</p>\n<p>Therefore if you have a dropdown list of options in your Ninja Form named “Web Design Package” and you provide various products (different price points for each) it is possible to easily produce a legal contract which includes the package features of an order in the written agreement which is then sent to the end-user of your Ninja Form.</p>\n<p><strong>Instantly Trigger Contracts To Be Sent</strong> As soon as a client inputs data into and submits a Ninja form (that is connected to a WP E-Signature  contract using this add-on) it is possible to instantly generate a Contract to be delivered either by email or by redirecting the signer to the contract immediately as the “thank you page.”</p>\n<p><strong>Connect Ninja Forms Digital Signature With WP e-signature</strong> This Ninja Forms Signature Add-On will blend the powerful automation attributes of Ninja forms with the e-signature features and peace of mind offered with WP e-signature.</p>\n<p><strong>Include Ninja Form Field Values Inside A WP E-Signature  Contract</strong>  With WP E-Signature ’s Ninja Forms Electronic Signature Add-On, you are able to input submitted form information into a legal contract that is activated immediately as soon as a client submits a Ninja Form.</p>\n<p><strong>Redirect a User to a Electronic Signature Contract after Submitting a Ninja Form</strong>  After a user successfully submits a Ninja Form they can be immediately be rerouted to the contract of your choosing by using this E Signature add-on.</p>\n<p><strong>Sends your Client a Contract Via Email Once they Complete a Ninja Form</strong> After correctly submitting the Ninja Form, there is the option to email the form submitter a contract (or perhaps a different customer if the additional customer&#8217;s email and name was in the recently completed Ninja form).</p>\n<p><strong>Signing Reminder Emails</strong> In the event that a customer has not yet electrically signed the contract which you were requesting them to sign after sending in your Ninja form, it is possible to instantly trigger signing reminder emails where you can choose the trigger date, the frequency of reminder emails, and the expiration date of the signing reminder emails.</p>\n<p>=<strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Try a Free Ninja Forms Signature Demo</a></strong>=</p>\n<h4>e-signature WordPress Features</h4>\n<p>Whether you&#8217;re operating a wedding photography business a membership based website, or a just a small web design agency in need of clients signing your website terms of service WP E-Signature  has you covered. You can read all about ‘WP E-Signature ’ features on the <a href=\"https://www.approveme.com/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">ApproveMe website</a>.</p>\n<h4>Legally Binding Ninja Forms Digital Signature Plugin</h4>\n<p>WP E-Signature  is recognized in court. We are <a href=\"http://www.ncsl.org/research/telecommunications-and-information-technology/uniform-electronic-transactions-acts.aspx\" rel=\"nofollow ugc\">(UETA)</a> and <a href=\"http://www.fdic.gov/regulations/compliance/manual/pdf/X-3.1.pdf\" rel=\"nofollow ugc\">(ESIGN)</a> compliant and adhere to some of the strictest document signing polices in the US and European unions.</p>\n<h4>Signer Audit Trail &amp; Reporting</h4>\n<p>Documents move turbo speed from signer to signer. We include a detailed audit report with viewer details, ip addresses, analytics and signer history. <a href=\"https://www.approveme.com/wordpress-audit-trail-e-signature-certificate/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">See how the audit trail can protect you and your signers</a></p>\n<h4>Tablet &amp; Smart Phone Friendly</h4>\n<p>Upload documents via WordPress dashboard and collect real client signatures through your website using ApproveMe’s <a href=\"https://www.approveme.com/ninja-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">WordPress Forms Contract Plugin</a>. Users sign documents online using their mouse, trackpad, tablet, or phone.</p>\n<h4>Sign Documents Online with Strength &amp; flexibility</h4>\n<p><em>Ninja Forms Signature is built using WordPress best practices both on the front and the back end. This results in an efficient, robust and easy-to-use plugin.</em></p>\n<h4>Electronic Signature Security and Encryption</h4>\n<p>Security is our priority. All of your signed documents and signatures are kept hidden and encrypted on your server using a secure encryption sequence and signer specific URL.  Additionally you have the option of forcing SSL security (when an SSL certificate is installed on your server) for all WP E-Signature  related pages.</p>\n<h4>Document Signing Automation</h4>\n<p>If you do business online, customers probably have to sign an agreement or an online contract. Problem is a paper agreement doesn’t hold up if your business is an online business and your customers are online customers. You can try mailing or even scanning a contract to your digital customers which costs you time and money, in the meantime you have the risk of losing your customer because of the added delay.</p>\n<p>What you need is ApproveMe’s WP E-Signature . WP E-Signature  is more than a less than reliable signature pad.  This powerful plugin lets you customize the signing process for what you need with no monthly fees and greater security. With comprehensive of add-on features (inlaced with most licenses) you can easily Save as PDF, Sign Documents Online and sync them to Dropbox Sync, insert Signer Input Fields, and dozens more which make it easy to automate and customize your document signing process on your WordPress website.</p>\n<p>WP E-Signature  and Ninja Forms e-signatures works with any WordPress website, including the default WordPress themes. If you need help installing WordPress E-Signature check out our <a href=\"https://wpe.approveme.com/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">getting started docs</a> and start signing documents using your WordPress website.  Looking to get WordPress Proposals signed?  We got you covered!</p>\n<p>If you&#8217;re looking for a tailored WordPress eSigning integration or add-on designed specifically to be used for your document signing needs be sure to browse the official <a href=\"https://www.approveme.com/wpesign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">WP E-Signature  Basic and Advanced Add-On Features Page</a> which come with a license.   If you don’t see the integrations you need… let us know.</p>\n<h4>No Monthly Fees</h4>\n<p><em>WP E-Signature  is the easiest and most affordable way to sign documents online using WordPress. You have full control over your data – it never leaves your server. Built exclusively for WordPress.</em></p>\n<h4>Customizable</h4>\n<p>Your business is unique, your online document signing process should be too. Choose from many of our <a href=\"https://www.approveme.com/wpesign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">e-signature workflows</a> best of all e-signature is hosted using your WordPress website.</p>\n<h4>More About Ninja Forms</h4>\n<p>Ninja Forms is a premium featured advanced drag and drop, email notification routing, lead generation and capturing, conditional logic wielding, WordPress forms plugin that offers the ability to create WordPress posts from front-end hosted forms.</p>\n<h3>Need Customer Support?</h3>\n<p>In an effort to provide better service and to prevent support tickets getting lost in the black hole of the internet, we aim to supply top notch support services through our website.</p>\n<p><strong>There is no support offered on the wordpress.org forum.</strong></p>\n<p>Log into your account to start a support ticket <a href=\"https://www.approveme.com/support/\" rel=\"nofollow ugc\">www.approveme.com/support</a> and we are here to serve you and help you solve any problems you have.</p>\n<p>Do you have a question that is non-support related regarding ApproveMe’s WP E-Signature ?<br />\nPlease feel free to contact us with with any pre-sale questions at our <a href=\"https://www.approveme.com/letschat/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">contact form page</a>.</p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p>To see Ninja to WP E-Signature  in action see the demo video below:</p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Try Ninja Forms + WP E-Signature  Demo Here</a></strong></p>\n<div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/174408205\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n<h3>Additional Info</h3>\n<h3>Additional important PDF capabilities and workflows for Ninja Forms Signature Add-On</h3>\n<ul>\n<li>Fully automate the signature collection procedure for your individual or small company</li>\n<li>Download a copy of the signed document from your website as a PDF</li>\n<li>Sync your Dropbox account with a Signed PDF </li>\n<li>Email yourself and the signer a copy of the PDF which is UETA/ESIGN compliant</li>\n</ul>\n<p><strong>Your own WordPress website stores and encrypts all documents (not a random third party site)</strong></p>\n<p>Find out more details about document security of the WP E-Signature  here: <a href=\"https://www.approveme.com/ueta-and-esign-act/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Security UETA/E SIGN Protection</a></p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p><em>An active WP E-Signature license is necessary for the Ninja Forms Signature plugin to function. To get yours, you can simply buy a copy at (www.approveme.com)</em></p>\n<p><strong>Zero Monthly Expenses • UETA &amp; ESIGN Compliant • Legally Binding • 100% Money Back Guarantee</strong></p>\n<h3>INSTALLATION COMPLETE!</h3>\n<p>Every signed document could be saved as a PDF, placed in an email, instantly synced to a Dropbox account and much more! You choose exactly how you want it to work!</p>\n<p><em>An up to date <a href=\"https://www.approveme.com/ninja-forms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Elite or Lifetime License</a> is needed for ApproveMe’s  Ninja Forms Signature plugin to run smoothly</em></p>\n<p><strong><a href=\"https://www.approveme.com/ninja-forms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Get Your ApproveMe License Now</a></strong></p>\n",
        "installation": "<div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/174408205\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n<h3>How it Works:</h3>\n<p><em>The plugin for Ninja Forms Signature is very simple to setup. With an active ApproveMe license, it is possible to (and instantly) produce a legally binding (court accepted) contract utilizing completed Ninja Form data and require your Ninja Form submitter to add their signature on your WP E Signature generated contract.</em></p>\n<p>This plugin is amazing for Freelancers, Web Designers, Photographers and Small Business owners who want to simplify their contract generation process.</p>\n<h3>Get started by following these simple Ninja Forms Signature Plugin setup steps</h3>\n<p><strong>Step 1:</strong><br />\n<em>ApproveMe&#8217;s WP E Signature usually takes a couple more plugins/add-ons to help you release the full power and automate Ninja Forms as well as Digital Signatures that are legally binding. The following plugins are required:</em></p>\n<ol>\n<li><a href=\"https://wordpress.org/plugins/ninja-forms/\" rel=\"ugc\">Ninja Forms</a></li>\n<li><a href=\"http://aprv.me/2ko4gfL\" rel=\"nofollow ugc\">WP E-Signature</a> (Elite or Lifetime license)</li>\n<li><a href=\"http://aprv.me/2ko4gfL\" rel=\"nofollow ugc\">Stand Alone Document</a> (comes with above licenses)<br />\n*A Elite or Lifetime license is required and can be purchased at <a href=\"https://www.approveme.com/ninja-forms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">www.approveme.com</a></li>\n</ol>\n<p><strong>Step 2:</strong><br />\n<em>Input your ApproveMe license</em><br />\nAfter you have bought a license from ApproveMe, you must input your license key to launch upgrades and technical support.</p>\n<p>Log into your account to download your license key <a href=\"https://www.approveme.com/sign-in/\" rel=\"nofollow ugc\">ApproveMe account</a> here (your password is included in the receipt emailed to you)</p>\n<p><strong>Step 3:</strong><br />\n<em>Set up a blank WordPress page</em><br />\nOnce the WP e-signature plugins and add-ons have been installed and your configurations saved you have to set up a blank/empty WordPress webpage for every Stand Alone Document (or contract) you will be producing/sending to your form submitters.</p>\n<p>Discover more about Stand Alone Documents by visiting this <a href=\"https://wpe.approveme.com/article/156-basic-document-vs-stand-alone-document?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">helpful article</a></p>\n<p><strong>Step 4:</strong><br />\n<em>Set up a Stand Alone Document</em><br />\nWith the new blank WordPress page you will need to produce a Stand Alone Document and then connect that WordPress page to our Stand Alone Document.</p>\n<p>Find out more about Stand Alone Documents by visiting <a href=\"https://wpe.approveme.com/article/137-stand-alone-documents-add-on?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">documentation page</a> for this add-on.</p>\n<p><strong>Step 5:</strong><br />\n<em>(optional) Input Ninja Form User Details into a Contract</em></p>\n<p>This step will be different depending on the desired outcome you want. Approve Me&#8217;s Digital signature is triggered once a Ninja Form is submitted. This add-on provides you with the power to incorporate Ninja Form user info (which was inputted from the customer once the form was sent in) into a brand new contract form which will either be emailed to the customer or will be shown to the customer after they submit the form.</p>\n<p><strong>How to use Ninja Forms to add form fields details into a contract</strong></p>\n<p>Go to the Signer Input Fields/Custom Fields symbol and choose &#8220;Ninja Form Data&#8221;.</p>\n<p>Choose the Ninja Form which you have previously made (and want to link with your contract form) using the drop down option list.</p>\n<p>Pick the field info you want to include in your new contract.</p>\n<p>A shortcode is created using this data. Don&#8217;t be concerned though, the real field value that your customer inputs is going to be shown instead when they sign your contract.</p>\n<p>This is an example of the auto-generated shortcode which will get placed in the document you are producing when you select your desired field value from your Ninja Form.</p>\n<p>[esigNinja formid=&#8221;3&#8243; field_id=&#8221;1&#8243; ]</p>\n<p>It is easy to transfer the shortcode that is created instantly, anyplace in your contract form and it is going to show the customer&#8217;s provided info anywhere the shortcode is found in your contract.</p>\n<p><strong>Step 6:</strong><br />\n<em>Select your document preferences and save settings</em></p>\n<p>When you have inserted all of your required contract text and have linked your preferred Ninja Forms field data to your Stand Alone Document, you will be ready to choose/define your document settings.</p>\n<p>Please Be Aware: Before you can post your contract form, you also have to link your Stand Alone Document with the blank WordPress webpage you made previously for your contract. Do this by looking for and choosing the webpage from the &#8220;Display on this page&#8221; drop down option list found under the &#8220;Document Options&#8221; area. We decided NOT to include this page in your nav menu since it will be connected to a Ninja Form and will not work properly unless it has the field values of that submitted Ninja Form.</p>\n<p><strong>Step 7:</strong><br />\n<em>Getting there&#8230; you&#8217;re half way done</em><br />\nWhen you&#8217;ve published your Stand Alone Document you are halfway done. In the next step you have to pick your &#8220;trigger&#8221; and &#8220;action&#8221; selections for this document in Ninja Forms.</p>\n<p>Select LET&#8217;S GO NOW! to establish those final Ninja Form preferences.</p>\n<p><strong>Step 8:</strong><br />\n<em>Finalize creating the Ninja Form workflow/trigger</em></p>\n<p>You&#8217;re very close to the end now! All you need to do is to select your contract along with the your preferred actions once the workflow is activated.</p>\n<p>Go to the &#8220;Forms&#8221; tab located in the WordPress control panel.</p>\n<p>Select the form you attached to the Stand Alone Document.</p>\n<p>Choose the &#8220;E-Signature&#8221; choice within the form options and specify the remaining options.</p>\n<p>Now You&#8217;re done!</p>\n<p>To see a live demo of the Ninja to WP E-Signature  by visiting:<br />\n<a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Try Ninja Forms + WP E-Signature  Demo Here</a></p>\n",
        "faq": "\n<dt id='can%20i%20collect%20legally%20binding%20court%20recognized%20digital%20signature%20from%20my%20wordpress%20website%20when%20someone%20submits%20a%20ninja%20form%3F'>\nCan I collect legally binding court recognized Digital Signature from my WordPress website when someone submits a Ninja Form?\n</h4>\n<p>\n<p>With the Ninja Forms Signature Add-on by ApproveMe, along with a <a href=\"https://www.approveme.com/ninja-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">WP E-Signature </a> license you can easily collect <a href=\"https://www.approveme.com/ueta-and-esign-act?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">UETA/ESIGN compliant</a> signatures from your visitors or website customers after they submit a Ninja Form on your website.</p>\n<p><strong>You can even pass details from the submitted Ninja Form into your WordPress contract or document.</strong></p>\n</p>\n<dt id='are%20digital%20signature%20legal%3F'>\nAre Digital Signature Legal?\n</h4>\n<p>\n<p>Yes, electronic digital signatures are legally binding in the United States and many countries around the world.  <strong>United States</strong> in the US there are two digital signature Acts that established the legality of digital signatures in the US – the <a href=\"https://en.wikipedia.org/wiki/Electronic_Signatures_in_Global_and_National_Commerce_Act\" rel=\"nofollow ugc\">Electronic Signatures in Global and National Commerce Act</a> (ESIGN, 2000) and the <a href=\"https://en.wikipedia.org/wiki/Uniform_Electronic_Transactions_Act\" rel=\"nofollow ugc\">Uniform Electronic Transactions Act</a> (UETA, 1999). Both the ESIGN and UETA establish that electronic records and signatures carry the same weight and legal effect as traditional paper documents and handwritten signatures, they say “A document or signature cannot be denied legal effect or enforceability solely because it is in electronic form.” The ApproveMe WP E-Signature  plugin is UETA/ESIGN compliant.</p>\n<p><strong>United Kingdom</strong><br />\nIn the UK, similar legislation to the ESIGN Act in the USA was likewise settled in 2000, and is known as the UK Electronic Communication Act.</p>\n<p><strong>European Union</strong><br />\nThe appropriation of the European Directive 1999/93/EC of 13 December 1999 established a the utilization of electronic marks on electronic and digital contracts inside of the European Union (EU). Thirty European nations (EU-27, Croatia, Turkey and Liechtenstein) have officially adopted Directive 1999/93/EC. To that end Electronic and Digital marks are effectively being used in Europe, and ApproveMe’s compliant WP E-Signature  plugin is legitimately acceptable and enforceable within the European Union.  One of the best ways to ensure your document is EU compliant is to utilize our “Send Custom Contract Invitation via Email” feature.  So when a user submits your Ninja Form they will be emailed a custom email invitation to sign their unique contract.</p>\n</p>\n<dt id='will%20i%20need%20to%20renew%20my%20approveme%20license%3F'>\nWill I Need to Renew my ApproveMe License?\n</h4>\n<p>\n<p>Yes you will (unless you have an Lifetime License). Each license key is valid for one calendar year from the purchase date. An active license key is needed for access to automatic/critical updates, plugin support and access to our growing <a href=\"https://www.approveme.com/wpesign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">e-signature add-on library</a>.</p>\n</p>\n<dt id='where%20can%20i%20find%20my%20license%20key%3F'>\nWhere Can I Find My License Key?\n</h4>\n<p>\n<p>If you’ve already purchased a license key and need to retrieve the license number, you can do that on the <a href=\"https://www.approveme.com/profile/\" rel=\"nofollow ugc\">support site here</a> or follow <a href=\"https://wpe.approveme.com/article/140-installing-wp-digital-e-signature?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">these detailed steps</a>. Once you’ve successfully logged into the support site (using the credentials emailed to you at the time of purchase), your active license key(s) will be listed at the bottom of the page.</p>\n</p>\n<dt id='what%20do%20i%20get%20with%20my%20approveme%20license'>\nWhat do I get with my ApproveMe license\n</h4>\n<p>\n<p>Your license grants you access to all of our support resources, documentation, product downloads and basic and advanced add-ons like Stand Alone Documents, Document Templates, Unlimited Sender Roles and others, (which are required for this Ninja Forms WordPress e-signature Plugin) for one calendar year from your purchase date.</p>\n<p><a href=\"https://www.approveme.com/ninja-forms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">You can get a license here</a></p>\n</p>\n<dt id='how%20much%20does%20it%20cost%20to%20renew%20my%20license%3F'>\nHow much does it cost to renew my license?\n</h4>\n<p>\n<p>The Lifetime Plan does not have a renewal cost.  It is a one-time payment for the WP e-signature plugin.  However all other plans have an annual renewal.  Our goal has always been to pull the price back as much as we possibly can so small businesses and freelancers could sign documents electronically using their WordPress website (and save alot of money in the process). Not only is our plugin the most powerful of its kind, it’s also the most affordable.  Not to throw anyone under the bus, but look at what our competitors charge every single year:</p>\n<p>Adobe charges $1,080 / yr (per 3 users)<br />\nDocusign charges $1,440 / yr (per 3 users)</p>\n<p>Not charing for renewals would actually hurt the product as we would not be able to invest as heavily as we currently do back into it&#8230;</p>\n</p>\n<dt id='what%20do%20i%20get%20for%20renewing%20my%20license%3F'>\nWhat do I get for renewing my license?\n</h4>\n<p>\n<p>Renewing your license provides an additional year of support and software updates. This provides peace of mind knowing you can turn to us for WP Electronic Signature related support and assistance. You’ll also continue receiving software updates to ensure WordPress compatibility (and security) as well as great new features and enhancements! Also (depending on your license) as we release new basic and premium add-ons you will be able download these at anytime.</p>\n</p>\n<dt id='where%20do%20i%20go%20for%20help%20on%20additional%20pre-sale%20questions%3F'>\nWhere do I go for help on additional pre-sale questions?\n</h4>\n<p>\n<p>Please feel free to contact us at anytime with any additional questions you might have at our <a href=\"https://www.approveme.com/letschat/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">contact form page</a>.</p>\n</p>\n\n",
        "changelog": "<p>Version 3.1.8.1<br />\nFIX: Some minor bugs</p>\n<p>Version 3.1.8.0<br />\nADDED : PHP 8.2 compatibility<br />\nFIX: Some minor bugs</p>\n<p>Version 3.1.7.9<br />\nADDED: Php 8.1 support<br />\nFIX: Some minor bugs</p>\n<p>Version 3.1.7.8<br />\nFIX: Text field as signer name issue<br />\nFIX: Some minor bugs</p>\n<p>Version 3.1.7.7<br />\nADDED : Signer assignment option improved .<br />\nFIX: Some minor bugs</p>\n<p>Version 3.1.7.6<br />\nFIX: Other form data issue<br />\nFIX: E-mail button display issue<br />\nFIX: Some minor bugs</p>\n<p>Version 3.1.7.4<br />\nFIX: Cache display issue<br />\nFIX: Other form data issue<br />\nFIX: Some minor bugs</p>\n<p>Version 3.1.6.9<br />\nFIX: Upload field label display issue</p>\n<p>Version 3.1.6.8.1<br />\nFIX: Ninja calculation fields are not working<br />\nFIX: NF Shortcode is no longer populating data in the document title<br />\nFIX : Some minor bugs</p>\n<p>Version 3.1.6.8<br />\nADDED : Rating widget</p>\n<p>Version 3.1.6.7<br />\nADDED : Plugin name updated</p>\n<p>Version 3.1.6.6<br />\nADDED : New license information updated.</p>\n<p>Version 3.1.6.4<br />\nADDED: Form fields bulk shortcode insert option.<br />\nADDED : Ninja forms repeater fields support.</p>\n<p>Version 3.1.6.2<br />\nFIX: Calculation field value display issue.</p>\n<p>Version 3.1.6.1<br />\nFIX: Document title shortcode replacement issue.</p>\n<p>Version 3.1.6.0<br />\nFIX: Single checkbox value display issue fixed<br />\nFIX : Shortcode rendering issue<br />\nFIX : Some minor bugs.</p>\n<p>Version 3.1.5.8<br />\nFIX: Checkbox radio field label value display issue</p>\n<p>Version 3.1.5.7.5<br />\nFIX: Fatal error if e-signature core plugin inactive<br />\nFIX: Blank reminder settings issue<br />\nFIX: WP Rocket plugin conflict<br />\nFIX: Some other minor bugs.</p>\n<p>Version 3.1.5.6.9 &#8211; February 01, 2021<br />\nADDED : New landing page added after activating plugin</p>\n<p>Version 1.5.6.5 &#8211; November 10, 2020<br />\nFIX: Showing &#8220;Template not found&#8221;.<br />\nFIX: Error if you keep field id blank<br />\nFIX: Multiple contracts redirect issue.<br />\nFIX: Some minor bugs.</p>\n<p>Version 1.5.6.0 &#8211; September 1, 2020<br />\nFIX : Display incorrect submission value.<br />\nFIX:  Icon display issue.<br />\nFIX:  Conflict with formidable form.<br />\nFIX : some minor bugs.</p>\n<p>Version 1.5.5.8 &#8211; June 2, 2020<br />\nADDED: Support snippet in about page.</p>\n<p>Version 1.5.3.3 &#8211; January 14, 2020<br />\nADDED: Feature multiple contract workflow .<br />\nFIX: Some minor bug</p>\n<p>Version 1.5.4.5<br />\nFIX: ninja upload plugins compatibility with Esig</p>\n<p>Version 1.5.3.8 &#8211; August 29, 2018<br />\nFIX: Label name missing with country field on signing document with ninja<br />\nFIX: ninja form single checkbox hide unchecked field<br />\nFIX: Value of US States is missing on signing document with Ninja form</p>\n<p>Version 1.5.3.7 &#8211; July 17, 2018<br />\nFIX: Bug prevnting radio/check value from saving.</p>\n<p>Version 1.5.3.6 &#8211; June 25, 2018<br />\nFIX: Demo video for plugins is not getting start after click on Play icon<br />\nFIX: Redirect on blank page after click on &#8220;Next step&#8221; button</p>\n<p>Version 1.5.3.4 &#8211; April 19, 2018<br />\nADDED: Ninja signature contract add-on debug error<br />\nFIX: Ninja form single checkbox bug fixed.<br />\nADDED: Checkmark for all form integration<br />\nFIX: Multiple field value adding into document title</p>\n<p>Version 1.5.3.0 &#8211; January 31, 2018<br />\nFIX: Ninja file_upload field value missing issue fixed<br />\nADDED: Ninja table editor field value support added</p>\n<p>Version 1.5.2.0 &#8211; October 9, 2017<br />\nFIX: ninja display type added for checkbox and multiselect list<br />\nADDED: Ninja Forms Pre-Check when creating new document<br />\nFIX:    Ninja form display label value issue fixed</p>\n<p>Version 1.5.1.1 &#8211; August 29, 2017<br />\nFIX: Total Calculated value is missing on signing document after using calcualtion<br />\nFIX: Ninja multi select and checkbox issues fixed</p>\n<p>Version 1.5.1.0 &#8211; August 10, 2017<br />\nFIX: Resolved conflict with ninja save progress plugin<br />\nFIX: Display extra content with checkbox field on signing document<br />\nFIX: Need to store data in e-signature with form integration<br />\nFIX: BriteVerify validation message display if &#8220;Enable live validation&#8221; checkbox<br />\nFIX: Notice message display after submit form</p>\n<p>Version 1.5.0 &#8211; March 7, 2017<br />\nADDED: esig text editor sif menu filter has been added<br />\nFIX: Getting Error Signer Invite Emails not sent messages when using form integrations<br />\nFIX: Incorrect data display on &#8220;Almost there&#8230;you&#8217;re 50% complete&#8221; window<br />\nADDED: post ,get and cookie filter has been added<br />\nFIX: Excluded formintegration signer name validation<br />\nFIX: Not showing complete country name on signing document<br />\nFIX: Reminders are not working for Ninja Forms<br />\nADDED: Type casting added</p>\n<p>Version 1.4.6 &#8211; December 13, 2016<br />\nFIX: HTML field is not working (Ninja Form)<br />\nFIX: Added value in &#8220;Checkbox List&#8221; field is display in vertically form on PDF File<br />\nFIX: Ninja html value calculation fields<br />\nFIX: Fixed checkbox display issue in plain text mode<br />\nADDED: Direct message denied and silense index page has been added<br />\nFIX: Ninja 3.0 calculation html default value displayed for 3..015</p>\n<p>Version 1.4.5 &#8211; October 6, 2016<br />\nIMPROVEMENT: Update logic message for woo/gravity/edd when core is not installed<br />\nIMPROVEMENT: Replaced YouTube video with Vimeo<br />\nFIX: Approveme.me link replaced with approveme.com<br />\nADDED: Compatibility for Ninja Forms THREE<br />\nIMPROVEMENT: esig_nfds_get method changed</p>\n<p>Version 1.4.4 &#8211; June 14, 2016<br />\nFIX: Undefined property on search issue fixed<br />\nFIX: ninja action type bug with sif &amp; undifined offset ninja form fields</p>\n<p>May 20, 2015<br />\n&#8211; ADDED: Added screenshots to readme<br />\n&#8211; IMPRVOEMENT: No need to show invite pop up for gravity , woo , edd , ninja stand alone document</p>\n<p>February 1, 2016 &#8211; Updated core code and hooks so add-on is now compatible with WP E-Signature  version 1.3.1</p>\n<p>January 25, 2016 &#8211; Live version released on WordPress.org</p>\n"
    },
    "short_description": "Instantly produce a legally enforceable &amp; court recognized contract from a Ninja Form submission. Signature Pad Contracts. Proposals.",
    "description": "<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Try Ninja Forms Signature Demo Here</a></strong></p>\n<div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/174408205\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n<p><em>Please note you will need the following plugins installed to completely automate the process of collection of WordPress contracts using Ninja Forms and WP E-Signature.</em><br />\n1. <a href=\"https://wordpress.org/plugins/ninja-forms/\" rel=\"ugc\">Ninja Forms</a><br />\n2. <a href=\"http://aprv.me/2ko4gfL\" rel=\"nofollow ugc\">WP E-Signature</a> (Elite, Lifetime license)<br />\n3. <a href=\"https://www.approveme.com/ninja-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Stand Alone Document</a> (comes with above licenses)</p>\n<p>*A license is required and can be purchased at <a href=\"https://www.approveme.com/ninja-forms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">www.approveme.com</a></p>\n<p><strong>What would you do if you discover the contracts you used in running your online business were not legally binding?</strong></p>\n<h4>Ninja Forms Digital Signature Add-On</h4>\n<p>Imagine if you or your client were in a courtroom, only for the judge to discover that the e signature used on the contract with your client (or customer) was not signed using a compliant UETA/ESIGN e signature application?</p>\n<p><strong>The legal and electronic signature industry is a highly regulated sector which has strict laws and regulations regarding the electronic signature and transmission process. This is especially true for legal contracts, invoices, time sheets and employee agreements that could end up in a court room.</strong></p>\n<p>Ninja Forms is a terrific WordPress Form Plugin! It is quite possibly one of the best ways to automate any number of tasks using a WordPress website (and of course their renowned forms plugin). However, <em>signing legally binding contracts is NOT Ninja Forms primary focus</em> (it is however ApproveMe’s WP E-Signature  sole focus). We have invested many years building a system that adheres to the strictest <a href=\"http://aprv.me/2lIEKSE\" rel=\"nofollow ugc\">UETA and ESIGN</a> nationwide and foreign document signing regulations.</p>\n<p>This Signature Plugin fills the gap between a WordPress Forms plugin and an e-signature solution that is compliant with the UETA/ESIGN guidelines.</p>\n<p><strong>How this signature add-on is different from your average signature addon</strong><br />\nThe majority of WordPress contract plugins and digital signature add-ons out there are not legally binding much less UETA/ESIGN compliant (they fail to follow the countless laws and regulations guiding the document signing industry). These kinds of basic signature add-ons, only “record signature details when it is drawn, then they transmit this data to an online website server where the signature is converted and forever stored as a PNG (or JPEG) graphic file and finally saved on your own ftp server (forever).”</p>\n<p>This approach exposes you and your client’s authorized signature on the ftp website server in which your WordPress website lives. <strong>The image file of your client’s hand written legal signature (the identical signature that is used to buy a house, sign up for credit cards, purchase a car, obtain a business loan) is accessible to ALL ftp intruders; placing both you and your signer at a potential risk of identity theft.</strong></p>\n<p><strong>ApproveMe’s brand new signature add-on found at <a href=\"http://aprv.me/2ko4gfL\" rel=\"nofollow ugc\">ApproveMe.com</a> it is the connection point between a WordPress forms plugin and having a UETA / ESIGN compliant contract signing application that runs on your WordPress site.</strong></p>\n<p><strong>Check out the video clip above to find out ways to save time and money by fully automating legal contracts for your website design, digital photography, freelance or consulting business making use of our Ninja Forms Digital Signature Add-On.</strong></p>\n<p><strong>MORE ON HOW THIS SIGNATURE ADD-ON WORKS</strong></p>\n<p>**<a href=\"https://www.approveme.com/ninja-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">ApproveMe’s Signature Add-On for Ninja Forms</a> generates a UETA/ESIGN compliant court recognized contract with (optional) details/field values inserted anywhere you want them inserted in the contract.  These dynamic field values are taken from the submitted form of your end user.</p>\n<p>Your form submitter can either draw or type their legal  signature using their mouse, trackpad, tablet or smartphone.  All of this magic happens the instant an end user submits a Ninja Form by either emailing a signer specific invitation to their contract or immediately redirecting the end users.**</p>\n<p>Another highly popular use case is pre-filling contract data that might change from contract to contract. Say for instance, you are a Web Design agency and you have a standard contract you send out that varies ever so slightly every time you bring on a new client. Maybe you have optional packages available that need to be noted in your contract. But creating a new contract from scratch is incredibly time consuming.</p>\n<p>With this Ninja Forms Signature Add-On + ApproveMe’s WP E-Signature  (license) you can create a Ninja Form with the fields and sections of the contract that vary and add an additional field for the “Signers Name” + “Signers Email.”</p>\n<p>Your Ninja Form would look something like:</p>\n<p>DROPDOWN FIELD 1  = Dropdown of available packages<br />\nPARAGRAPH FIELD 2 = Classes or terms that vary from contract to contract<br />\nTEXT FIELD 2 = SIGNERS FULL NAME<br />\nTEXT FIELD 3 = SIGNERS EMAIL ADDRESS</p>\n<p>You would insert these Ninja Field values in your WP E-Signature  contract in the proper places or paragraphs that pertain to this information.</p>\n<p>You would choose the option “Email this contract whenever this form is submitted.”</p>\n<p>Now, whenever you fill out this Ninja Form, your contract will be automatically generated with the custom terms from your Ninja Form submission and then a signer invitation email will be sent to the signer email address that was given in the Ninja Form submission.</p>\n<p><em>Additional benefits of ApproveMe’s WP eSign Plugin and this for Ninja Forms Signature Add-On is that you are able to instantly create a legal contract for your clients to sign depending on their form information from a Ninja Form.</em></p>\n<p><strong>And that’s just the beginning. When a client signs…</strong></p>\n<p><em>… both you and the client will instantly get a PDF of the contract that they signed (e-signature automation at its finest).</em></p>\n<p><em>…registering or sending your client to a third-party website to sign your legal contracts is not required (all signatures take place on your WordPress website… so the experience is on your site and not someone else’s)</em></p>\n<p><em>… you’ll have a 100% legally compliant electronic signature on file to protect you AND the customer (according to UETA/ESIGN guidelines).</em></p>\n<h3>Ninja Forms Digital Signature add-on turns your WordPress site into a court recognized document signing application (but without the monthly fees… and with unlimited amount of users).</h3>\n<ul>\n<li>Ideal for anyone who wants to automate signature collection on proposals, quotes, timesheets, service terms agreements, new client legal contracts, waiver forms and much more! *</li>\n</ul>\n<p>Immediately redirect your site visitors to sign a legally binding contract after submitting a WordPress Form that was created using Ninja Forms.</p>\n<p>“I agree to terms” checkboxes have the legal standing of a limp handshake. <strong>Do the smart thing. Don’t get caught in a courtroom with a document that’s not legally binding.</strong></p>\n<p><strong>ADDON FEATURES THAT YOU CAN CUSTOMIZE</strong><br />\nWP E-Signature  offers an incredibly in depth e-signature add-on collection with several easy to customize <a href=\"https://www.approveme.com/ninja-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Ninja Forms e-signature automations</a> and <a href=\"https://www.approveme.com/esign-integrations?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">third-party integrations</a> to even further improve your personalized document signing requirements.</p>\n<p>The WordPress Online Contract platform operates on every leading PC and web browsers for smart phones. For example Chrome, FireFox, Opera, Safari, Android, iOS, and WebOS.</p>\n<p>Besides being user friendly, ApproveMe’s Ninja Forms WordPress Signature Plugin is able to instantly enter details which was posted from a Ninja Form into a UETA/ESIGN compliant and courtroom accepted contract form utilizing your own WordPress website.</p>\n<p>Therefore if you have a dropdown list of options in your Ninja Form named “Web Design Package” and you provide various products (different price points for each) it is possible to easily produce a legal contract which includes the package features of an order in the written agreement which is then sent to the end-user of your Ninja Form.</p>\n<p><strong>Instantly Trigger Contracts To Be Sent</strong> As soon as a client inputs data into and submits a Ninja form (that is connected to a WP E-Signature  contract using this add-on) it is possible to instantly generate a Contract to be delivered either by email or by redirecting the signer to the contract immediately as the “thank you page.”</p>\n<p><strong>Connect Ninja Forms Digital Signature With WP e-signature</strong> This Ninja Forms Signature Add-On will blend the powerful automation attributes of Ninja forms with the e-signature features and peace of mind offered with WP e-signature.</p>\n<p><strong>Include Ninja Form Field Values Inside A WP E-Signature  Contract</strong>  With WP E-Signature ’s Ninja Forms Electronic Signature Add-On, you are able to input submitted form information into a legal contract that is activated immediately as soon as a client submits a Ninja Form.</p>\n<p><strong>Redirect a User to a Electronic Signature Contract after Submitting a Ninja Form</strong>  After a user successfully submits a Ninja Form they can be immediately be rerouted to the contract of your choosing by using this E Signature add-on.</p>\n<p><strong>Sends your Client a Contract Via Email Once they Complete a Ninja Form</strong> After correctly submitting the Ninja Form, there is the option to email the form submitter a contract (or perhaps a different customer if the additional customer&#8217;s email and name was in the recently completed Ninja form).</p>\n<p><strong>Signing Reminder Emails</strong> In the event that a customer has not yet electrically signed the contract which you were requesting them to sign after sending in your Ninja form, it is possible to instantly trigger signing reminder emails where you can choose the trigger date, the frequency of reminder emails, and the expiration date of the signing reminder emails.</p>\n<p>=<strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Try a Free Ninja Forms Signature Demo</a></strong>=</p>\n<h4>e-signature WordPress Features</h4>\n<p>Whether you&#8217;re operating a wedding photography business a membership based website, or a just a small web design agency in need of clients signing your website terms of service WP E-Signature  has you covered. You can read all about ‘WP E-Signature ’ features on the <a href=\"https://www.approveme.com/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">ApproveMe website</a>.</p>\n<h4>Legally Binding Ninja Forms Digital Signature Plugin</h4>\n<p>WP E-Signature  is recognized in court. We are <a href=\"http://www.ncsl.org/research/telecommunications-and-information-technology/uniform-electronic-transactions-acts.aspx\" rel=\"nofollow ugc\">(UETA)</a> and <a href=\"http://www.fdic.gov/regulations/compliance/manual/pdf/X-3.1.pdf\" rel=\"nofollow ugc\">(ESIGN)</a> compliant and adhere to some of the strictest document signing polices in the US and European unions.</p>\n<h4>Signer Audit Trail &amp; Reporting</h4>\n<p>Documents move turbo speed from signer to signer. We include a detailed audit report with viewer details, ip addresses, analytics and signer history. <a href=\"https://www.approveme.com/wordpress-audit-trail-e-signature-certificate/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">See how the audit trail can protect you and your signers</a></p>\n<h4>Tablet &amp; Smart Phone Friendly</h4>\n<p>Upload documents via WordPress dashboard and collect real client signatures through your website using ApproveMe’s <a href=\"https://www.approveme.com/ninja-forms-signature-special/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">WordPress Forms Contract Plugin</a>. Users sign documents online using their mouse, trackpad, tablet, or phone.</p>\n<h4>Sign Documents Online with Strength &amp; flexibility</h4>\n<p><em>Ninja Forms Signature is built using WordPress best practices both on the front and the back end. This results in an efficient, robust and easy-to-use plugin.</em></p>\n<h4>Electronic Signature Security and Encryption</h4>\n<p>Security is our priority. All of your signed documents and signatures are kept hidden and encrypted on your server using a secure encryption sequence and signer specific URL.  Additionally you have the option of forcing SSL security (when an SSL certificate is installed on your server) for all WP E-Signature  related pages.</p>\n<h4>Document Signing Automation</h4>\n<p>If you do business online, customers probably have to sign an agreement or an online contract. Problem is a paper agreement doesn’t hold up if your business is an online business and your customers are online customers. You can try mailing or even scanning a contract to your digital customers which costs you time and money, in the meantime you have the risk of losing your customer because of the added delay.</p>\n<p>What you need is ApproveMe’s WP E-Signature . WP E-Signature  is more than a less than reliable signature pad.  This powerful plugin lets you customize the signing process for what you need with no monthly fees and greater security. With comprehensive of add-on features (inlaced with most licenses) you can easily Save as PDF, Sign Documents Online and sync them to Dropbox Sync, insert Signer Input Fields, and dozens more which make it easy to automate and customize your document signing process on your WordPress website.</p>\n<p>WP E-Signature  and Ninja Forms e-signatures works with any WordPress website, including the default WordPress themes. If you need help installing WordPress E-Signature check out our <a href=\"https://wpe.approveme.com/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">getting started docs</a> and start signing documents using your WordPress website.  Looking to get WordPress Proposals signed?  We got you covered!</p>\n<p>If you&#8217;re looking for a tailored WordPress eSigning integration or add-on designed specifically to be used for your document signing needs be sure to browse the official <a href=\"https://www.approveme.com/wpesign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">WP E-Signature  Basic and Advanced Add-On Features Page</a> which come with a license.   If you don’t see the integrations you need… let us know.</p>\n<h4>No Monthly Fees</h4>\n<p><em>WP E-Signature  is the easiest and most affordable way to sign documents online using WordPress. You have full control over your data – it never leaves your server. Built exclusively for WordPress.</em></p>\n<h4>Customizable</h4>\n<p>Your business is unique, your online document signing process should be too. Choose from many of our <a href=\"https://www.approveme.com/wpesign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">e-signature workflows</a> best of all e-signature is hosted using your WordPress website.</p>\n<h4>More About Ninja Forms</h4>\n<p>Ninja Forms is a premium featured advanced drag and drop, email notification routing, lead generation and capturing, conditional logic wielding, WordPress forms plugin that offers the ability to create WordPress posts from front-end hosted forms.</p>\n<h3>Need Customer Support?</h3>\n<p>In an effort to provide better service and to prevent support tickets getting lost in the black hole of the internet, we aim to supply top notch support services through our website.</p>\n<p><strong>There is no support offered on the wordpress.org forum.</strong></p>\n<p>Log into your account to start a support ticket <a href=\"https://www.approveme.com/support/\" rel=\"nofollow ugc\">www.approveme.com/support</a> and we are here to serve you and help you solve any problems you have.</p>\n<p>Do you have a question that is non-support related regarding ApproveMe’s WP E-Signature ?<br />\nPlease feel free to contact us with with any pre-sale questions at our <a href=\"https://www.approveme.com/letschat/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">contact form page</a>.</p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p>To see Ninja to WP E-Signature  in action see the demo video below:</p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Try Ninja Forms + WP E-Signature  Demo Here</a></strong></p>\n<div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/174408205\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n<h3>Additional Info</h3>\n<h3>Additional important PDF capabilities and workflows for Ninja Forms Signature Add-On</h3>\n<ul>\n<li>Fully automate the signature collection procedure for your individual or small company</li>\n<li>Download a copy of the signed document from your website as a PDF</li>\n<li>Sync your Dropbox account with a Signed PDF </li>\n<li>Email yourself and the signer a copy of the PDF which is UETA/ESIGN compliant</li>\n</ul>\n<p><strong>Your own WordPress website stores and encrypts all documents (not a random third party site)</strong></p>\n<p>Find out more details about document security of the WP E-Signature  here: <a href=\"https://www.approveme.com/ueta-and-esign-act/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Security UETA/E SIGN Protection</a></p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p><em>An active WP E-Signature license is necessary for the Ninja Forms Signature plugin to function. To get yours, you can simply buy a copy at (www.approveme.com)</em></p>\n<p><strong>Zero Monthly Expenses • UETA &amp; ESIGN Compliant • Legally Binding • 100% Money Back Guarantee</strong></p>\n<h3>INSTALLATION COMPLETE!</h3>\n<p>Every signed document could be saved as a PDF, placed in an email, instantly synced to a Dropbox account and much more! You choose exactly how you want it to work!</p>\n<p><em>An up to date <a href=\"https://www.approveme.com/ninja-forms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Elite or Lifetime License</a> is needed for ApproveMe’s  Ninja Forms Signature plugin to run smoothly</em></p>\n<p><strong><a href=\"https://www.approveme.com/ninja-forms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\" rel=\"nofollow ugc\">Get Your ApproveMe License Now</a></strong></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.8.1.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-1.png?rev=1361724",
            "caption": "<p><strong>Add New Document:</strong> Once you’ve installed the WP E-Signature , you just need to draft up a new “Stand Alone Document”</p>"
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-2.jpg?rev=1361724",
            "caption": "<p><strong>Ninja Forms Data</strong> If you click the Signer Input Fields icon you will see the option “Ninja Forms Data” you will need to click this in order to connect a Ninja Forms to this contract.</p>"
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-3.png?rev=1361724",
            "caption": "<strong>Select Your Ninja Forms:</strong> If you already have your Ninja Forms created you can easily insert dynamic field data (from the Ninja Forms that is being submitted/triggering this contract) by selecting the Ninja Forms."
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-4.png?rev=1361724",
            "caption": "<strong>Choose Your Ninja Forms Fields:</strong> Once you’ve selected your Ninja Forms you will see the available field options from this particular Ninja Forms.  You can easily insert the submitted results from your Ninja Forms in ANY place throughout this contract that you are creating."
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-5.png?rev=1361724",
            "caption": "<strong>Document Signing Options (optional):</strong> WP e-signature by ApproveMe is a powerful e-signature tool filled with LOTS of customizable options i.e. Signing reminder Emails, Attach PDF to emails, Dropbox Sync, Auto Register WordPress Users, and TONS more.  To read all about the available add-on features (which come with the license) you can checkout: <a href=\"https://www.approveme.com/esign-integrations?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\">https://www.approveme.com/esign-integrations</a>"
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-6.png?rev=1361724",
            "caption": "<strong>Connect Your Document to a Page:</strong>Once you have customize your contract to taste you will need to select a BLANK WordPress page to attach this document to.  Do not include this page in your Nav menu since all of the magic actually happens after the Ninja Forms is submitted (there’s no need to link to this page because the user will either be emailed a custom link or they will be automatically redirected once the Ninja Forms is submitted)."
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-7.png?rev=1361724",
            "caption": "<strong>Click “LET’S GO NOW”:</strong> After you have published your contract you will need to connect your Stand Alone Document to your Ninja Forms.  This is pretty straight forward.  Just click the button “LET’S GO NOW!” to be redirected to the actions/trigger tab for your specific Ninja Forms."
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-8.png?rev=1361724",
            "caption": "<strong>Define Your Signing Logic:</strong> This is the page (inside of Ninja Forms) that needs to be customized.  Please choose the Signers Full Name and the Signers Email address along with any other additional/advanced e-signature settings you’d like for your contract."
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-9.png?rev=1361724",
            "caption": "<strong>User Submits a Ninja Forms</strong> Once a user submits the Ninja Forms that you connected to your WP e-signature contract they will either be redirected to the contract immediately or emailed a invitation to signer their specific/custom contract that includes details from the submitted Ninja Forms."
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-10.png?rev=1361724",
            "caption": "<strong>Review &amp; eSign:</strong> Your users will review the contract and add their signature to the contents of the contract."
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-11.png?rev=1361724",
            "caption": "<strong>Select a Digital Signature:</strong>Signers can choose a typed or digital signature"
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-12.png?rev=1361724",
            "caption": "<strong>Agree &amp; eSign:</strong>With their e-signature, the customers agree to the terms of the document"
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-13.png?rev=1361724",
            "caption": "<strong>View Signed Document Email:</strong>Customers will be sent an email that includes the link to the document (and PDF if you opt for this method)."
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-14.png?rev=1361724",
            "caption": "<strong>Save as PDF:</strong>Customers can either print or download their signed document from the website. To do this, they need to click “View Signed Document” from the link in the email they attained upon signing the document.  With the Attach as PDF add-on install you could also automatically include thee signed contract as a PDF attachment in this email."
        },
        {
            "src": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/screenshot-15.png?rev=1361724",
            "caption": "<strong>WordPress Audit Trail e-signature Certificate:</strong> Proving signer intent is a very important component to signing electronic documents.  Every contract that is signed using WP E-Signature  includes a detailed Signature Certificate.  You can <a href=\"https://www.approveme.com/wordpress-audit-trail-e-signature-certificate/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=ninja-forms\">read all about the security of this report here</a>."
        }
    ],
    "tags": {
        "contract": "contract",
        "digital-signature": "digital signature",
        "ninja-forms-e-signatures": "Ninja Forms e-signatures",
        "ninja-forms-signature": "Ninja Forms Signature",
        "sig": "sig"
    },
    "stable_tag": "3.1.8.1",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.0.0.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.3.0.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.4.0.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.4.5.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.4.6.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.1.zip",
        "1.5.1.1": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.1.1.zip",
        "1.5.2.0": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.2.0.zip",
        "1.5.2.2": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.2.2.zip",
        "1.5.3.0": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.3.0.zip",
        "1.5.3.2": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.3.2.zip",
        "1.5.3.4": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.3.4.zip",
        "1.5.3.6": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.3.6.zip",
        "1.5.3.7": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.3.7.zip",
        "1.5.3.8": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.3.8.zip",
        "1.5.4.5": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.4.5.zip",
        "1.5.4.9": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.4.9.zip",
        "1.5.5.3": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.5.3.zip",
        "1.5.5.8": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.5.8.zip",
        "1.5.6.0": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.6.0.zip",
        "1.5.6.5": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.5.6.5.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.1.8.0.zip",
        "3.1.5.6.9": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.5.6.9.zip",
        "3.1.5.7.5": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.5.7.5.zip",
        "3.1.5.8": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.5.8.zip",
        "3.1.6.0": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.6.0.zip",
        "3.1.6.1": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.6.1.zip",
        "3.1.6.2": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.6.2.zip",
        "3.1.6.4": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.6.4.zip",
        "3.1.6.6": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.6.6.zip",
        "3.1.6.7": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.6.7.zip",
        "3.1.6.8": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.6.8.zip",
        "3.1.6.8.1": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.6.8.1.zip",
        "3.1.6.9": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.6.9.zip",
        "3.1.7.4": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.7.4.zip",
        "3.1.7.6": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.7.6.zip",
        "3.1.7.7": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.7.7.zip",
        "3.1.7.8": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.7.8.zip",
        "3.1.7.9": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.7.9.zip",
        "3.1.8.1": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.3.1.8.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/ninja-signature-contract-forms-add-on.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/banner-772x250.png?rev=1335363",
        "high": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/banner-1544x500.png?rev=1335381"
    },
    "icons": {
        "1x": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/icon-128x128.png?rev=1335363",
        "2x": "https://ps.w.org/ninja-signature-contract-forms-add-on/assets/icon-256x256.png?rev=1335363"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}