{
    "name": "WP Notifier To Slack- Increase  site security monitoring and reporting",
    "slug": "notifier-to-slack",
    "version": "2.16.0",
    "author": "<a href=\"https://wpxperties.com/\">WPXpertise</a>",
    "author_profile": "https://profiles.wordpress.org/devsabbirahmed/",
    "contributors": {
        "wpxpertise": {
            "profile": "https://profiles.wordpress.org/wpxpertise/",
            "avatar": "https://secure.gravatar.com/avatar/5ee8ed68e5a119fe22b4cba211cc6450?s=96&d=monsterid&r=g",
            "display_name": "wpxpertise"
        },
        "devsabbirahmed": {
            "profile": "https://profiles.wordpress.org/devsabbirahmed/",
            "avatar": "https://secure.gravatar.com/avatar/d8f953bd4233694f95c777fa8565fdca?s=96&d=monsterid&r=g",
            "display_name": "Sabbir Sam"
        }
    },
    "requires": "5.9",
    "tested": "6.6.1",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 2,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 2,
    "support_url": "https://wordpress.org/support/plugin/notifier-to-slack/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 10,
    "downloaded": 2799,
    "last_updated": "2024-08-26 09:50:00",
    "added": "2023-02-28",
    "homepage": "https://github.com/wpxpertise/",
    "sections": {
        "description": "<p>The #1 Notifier plugin, streamlines WordPress experience, Increase the security, monitoring activity, allowing you to focus on what matters most.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ADbxWuOY4kc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><a href=\"https://wpxperties.com/notifier-to-slack/\" rel=\"nofollow ugc\">Website</a> | <a href=\"https://wpxperties.com/docs-category/notifier-to-slack/\" rel=\"nofollow ugc\">Documentations</a> | <a href=\"https://www.youtube.com/playlist?list=PL4m92NgWQaq5ttBH9gSYUX1r4c6rtgLg9\" rel=\"nofollow ugc\">Tutorials</a></p>\n<p>Boost Your WooCommerce Experience with Instant Slack Notifications for Stocks, Order Status, Sales, Comments, Coupon Uses and Billing-Shipping status. Enhance your site security with a comprehensive tracking system that monitors user and editor activities at every step. Gain insights into authentication failures and other critical events to elevate your website&#8217;s defense to the next level. You have the option to track users in any mixture, keep track on their secret activities, and receive as many notifications as they have. All notifications can be delivered to Slack, Mail.</p>\n<blockquote><p> As a developer, if you have a WordPress ORG plugin and don&#8217;t want to spend your entire day monitoring new releases or support cases, you may leave the headaches to our plugin and get all instant notifications in your mobile Slack APP\n</p></blockquote>\n<h4>You don&#8217;t need to constantly visit the forum to check daily updates, reviews, and support</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/mDnbCo2w4BE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<blockquote><p>\nGet notified of each event using the Slack mobile app. Observe all of your website activities with ease and without logging in. Give WP Notifier to Slack all the be concerned, and you can stress-free carry out your everyday chores.\n</p></blockquote>\n<h3>📊Advance monitoring dashboard</h3>\n<p>Notifier To Slack plugin has site monitoring dashboard. You will be visualize and notified promptly if any previously installed plugin is deactivated or uninstalled, or if a new plugin is added and activated in your website. Receive notifications for user Registration, Sign-in/Sign-out. Few key points are listed below.</p>\n<ol>\n<li><strong>Realtime active user list in website</strong> </li>\n<li><strong>Easy and instant user kickout feature</strong> </li>\n<li><strong>Site Health Status</strong> </li>\n<li><strong>Realtime plugin update overview</strong> </li>\n<li><strong>Realtime Login attempt graph with daily login attempt information</strong> </li>\n<li><strong>Site visitor traffic list information with Visiting time, count and accurate location</strong> </li>\n<li><strong>Realtime last activaited pluigin info</strong> </li>\n<li><strong>Realtime last deactivated pluigin info</strong> </li>\n<li><strong>Realtime daily basis sign in-out users with time information</strong></li>\n</ol>\n<h3>👉Plugin corn setup and configuration guide</h3>\n<p>Add the corn URL to execute event, even though your site has no traffic/visitors. Whether you are not active on your website, it will send you a response at your preferred interval.</p>\n<p>Cron setup: <a href=\"https://console.cron-job.org/jobs/create\" rel=\"nofollow ugc\">Visit</a></p>\n<p>Complete below steps<br />\n1. Create cronjob<br />\n2. Set Title<br />\n3. Paste the URL you copied from above<br />\n4. Add an execution schedule of 5-25 minutes, in accordance with the specified interval.<br />\n5. Disable: From &#8216;Notify me when&#8217; the cronjob will be disabled because of too many failures</p>\n<p>👉<a href=\"https://www.youtube.com/playlist?list=PL4m92NgWQaq5ttBH9gSYUX1r4c6rtgLg9\" rel=\"nofollow ugc\">WP Notifier To Slack playlist</a></p>\n<h3>🤖 Advance CAPTCHA technology panel</h3>\n<p>Turnstile is Cloudflare&#8217;s latest privacy-focused invisible CAPTCHA solution, created to provide a modern alternative to CAPTCHA. So we Implement Cloudflare Turnstile for WordPress, WooCommerce login and registrations.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/PGo3vGEWP1c?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>🚨 Emergency Shutdown Mode</h3>\n<p>A new emergency shutdown mode has been developed to provide heightened security measures in critical situations. This feature is designed to immediately block access to all users, including administrators, in the event of an emergency. Only the super admin retains access to the site, while all other users are automatically logged out.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/MIeTLammCNg?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>💀 Instant Site Security Notifications</h3>\n<p>This feature likely monitors the WordPress configuration file (wp-config.php) and the .htaccess file for any unauthorized changes. If a hacker attempts to modify these files, the plugin will send a notification to the website administrator via Slack instantly, alerting them to the potential security breach.</p>\n<h3>🥏 Instant WooCommerce Notifications</h3>\n<p>If your WordPress website includes a WooCommerce store, this feature likely notifies the admin about important events related to product stock status and sales. This could include notifications for products going in or out of stock and sales with user and product details, all sent to Slack. Whenever a product is sold, you will notify instantly and you will know the update of the order status on every changes. When user use a coupon while purchasing a product, you will also be able notify about the product and user-related details.</p>\n<ol>\n<li><strong>Product stock, out of stock Notifications</strong> </li>\n<li><strong>Comment Moderation notifications</strong> </li>\n<li><strong>Sales Notifications to Slack</strong> </li>\n<li><strong>Order not completed within provided days reminder</strong> </li>\n<li><strong>Coupon uses notification</strong> </li>\n<li><strong>Product editor notification</strong> </li>\n<li><strong>Shipping status notification</strong> </li>\n<li><strong>Billing &amp; Shipping Address notification</strong> </li>\n</ol>\n<p>With the mobile Slack in your hand, you will be aware of user feedback regarding blog posts comment, products review, and every instantaneous replay.</p>\n<h3>🔝 Notifier To Slack FEATURES</h3>\n<ol>\n<li>\n<p><strong>Support channel review</strong> &#8211;  With WP Notifier to Slack, you can receive instant notifications of any support cases and reviews for your released plugins. This feature allows you to stay on top of your plugin-related support and feedback, enabling you to respond promptly and improve your users&#8217; experience.</p>\n</li>\n<li>\n<p><strong>Live Monitoring of Plugin Pages</strong> &#8211; This plugin also offers live monitoring of your plugin pages. You will receive immediate alerts whenever a plugin is activated or removed from your website. This feature enhances the security of your site, giving you peace of mind that you are always aware of any changes that occur, even when you are not present.</p>\n</li>\n<li>\n<p><strong>WordPress and Plugin-Related Update Notifications</strong> -WP Notifier to Slack notifies you immediately when the latest version of a plugin becomes available or when a WordPress core update is released. This feature keeps you informed about updates related to your website, ensuring that you stay up-to-date on every field, including security.</p>\n</li>\n<li>\n<p><strong>Unlimited notification sync</strong> &#8211; You can sync as many notification as you want with your added plugin.</p>\n</li>\n<li>\n<p><strong>Review Notification</strong> &#8211;  Get instant notifications about new reviews for your plugin from WordPress.org on your Slack channel.</p>\n</li>\n<li><strong>Plugin Activation/Deactivation Alert</strong> &#8211;  Get notified on Slack when your plugin is activated or deactivated on any website.</li>\n<li><strong>WP Core Update Notification</strong> &#8211;  Get notified on Slack when a new WordPress Core update is available.</li>\n<li><strong>Plugin Update Notification</strong> &#8211;  Get notified on Slack when a new update for your plugin is available.</li>\n<li>\n<p><strong>Login/Logout Alert</strong> &#8211;  Get notified on Slack when someone logs in or out of the website.</p>\n</li>\n<li>\n<p><strong>New User Registration Alert</strong> &#8211;  Get notified on Slack when a new user registers on the website.</p>\n</li>\n<li>\n<p><strong>Site Health Notification</strong> &#8211;  Get notified on Slack when there is a site health issue that needs attention.</p>\n</li>\n<li>\n<p><strong>Product Stock/Out of Stock Notification</strong> &#8211;  Get notified on Slack when a product is low on stock or out of stock.</p>\n</li>\n<li>\n<p><strong>Comment Moderation Notification</strong> &#8211;  Get notified on Slack when a new comment is posted on the website and needs moderation.</p>\n</li>\n<li>\n<p><strong>Corn job API</strong> &#8211; Use Corn API to get the response even if you&#8217;re not logged in.</p>\n</li>\n<li>\n<p><strong>Dynamic Dashboard</strong> &#8211; You may see all of the information provided by the website through this advanced admin panel, including the number of users who have tried to log in or signed out of your website on a daily basis. All of this information will be displayed to you promptly.</p>\n</li>\n<li>\n<p><strong>Website Health Score</strong> &#8211; A rating on the current condition of your website will be shown to you which will give you an idea of the current condition of the website.</p>\n</li>\n<li>\n<p><strong>Easy maintenance mode panel</strong> &#8211; Simplify website maintenance with an easy-to-use maintenance mode panel. Efficiently toggle maintenance mode on or off.</p>\n</li>\n<li>\n<p><strong>Global slack webhook configuration</strong> &#8211; Effortlessly streamline your communication with our Global Slack Webhook Configuration! Connect your all preference with easy check and stay in the loop with instant alerts, ensuring seamless collaboration and real-time updates across your team.</p>\n</li>\n<li>\n<p><strong>Theme activation alert</strong> &#8211; Experience ultimate control over your website aesthetics! Receive immediate alerts the moment your theme is activated. Stay ahead of the game and ensure a smooth transition whenever changes occur.</p>\n</li>\n<li>\n<p><strong>Theme deletion alert</strong> &#8211; Protect your theme environment! Our Theme Deletion Alert keeps you informed about any theme bidding farewell. Stay proactive and prevent accidental deletions with timely notifications.</p>\n</li>\n<li>\n<p><strong>New Theme installed alert</strong> &#8211; Embrace the new look! Get notified as soon as a fresh theme is installed, allowing you to stay on top of your website&#8217;s visual identity effortlessly..</p>\n</li>\n<li>\n<p><strong>Settings General page modification alert:</strong> &#8211; No modification goes unnoticed! Receive instant alerts for any changes made on the General Settings page. Stay informed and maintain control over your website&#8217;s settings with ease.</p>\n</li>\n<li>\n<p><strong>Cloudflare Turnstile for login/registrations:</strong> &#8211; Simply add Cloudflare Turnstile to your login and registrations page of your WordPress website to safeguard them from spam! A user-friendly and privacy-preserving reCAPTCHA solution.</p>\n</li>\n</ol>\n<h3>🔝 Notifier To Slack ADVANCED FEATURES</h3>\n<p><strong>🌟 Enable day to day notification for review</strong> &#8211; With the help of this plugin, you can start getting daily updates as well. New reviews will be sent to your Slack account promptly, saving you from having to repeatedly receive the same reviews.</p>\n<p><strong>🆘 Enable day to day notification for support:</strong> &#8211; With the help of this plugin, you can start getting daily updates as well. New suppor query will be sent to your Slack account promptly, saving you from having to repeatedly receive the same query.</p>\n<p><strong>⚙️ Integration list</strong> &#8211; If the most common forms on your website (Contact Form 7, FormFlow and more) have been filled out and submitted, you will receive immediate notifications along with the leads. This will allow you to view leads without logging into the website. The rapid notification allows you to respond to the user instantly following a form submission.</p>\n<p><strong>🚨 Visitor traffic list :</strong> &#8211; Keep track of your website visits! When visitors arrive to your site, you&#8217;ll get a full breakdown of who they are.</p>\n<p><strong>🔔 Forcefully logout currently active user :</strong> &#8211;  This tool allows you to manage your website&#8217;s active user more efficiently. Instantly update the status of active users in your WordPress dashboard; This ensuring accurate tracking of online users. Moreover, you can now take immediate action by forcefully logging out any selected user. In case of emergencies, simply click on &#8220;logout&#8221; to terminate a user&#8217;s session instantly, providing enhanced control over your website&#8217;s user management.</p>\n<p><strong>🛑 IP Blocker :</strong> &#8211; The IP Blocker feature empowers you with direct control over your website&#8217;s security by allowing you to manually/Auto block specific IP addresses or ranges. 🚫 Whether you need to restrict access for a particular user or block a range of IPs using CIDR notation, this tool provides you with the flexibility to enhance your site&#8217;s security. Simply input the desired IP address or range, and visitors from those locations will be restricted from accessing your site. 🧑‍💻</p>\n<p>Usage:</p>\n<ol>\n<li>To block a single IP: 🚫 Keep 182.168.1.1</li>\n<li>To block a range using CIDR: 🚫 Keep 203.0.113.0/24</li>\n<li>Take control of your website&#8217;s security with the Auto IP Blocker, and ensure only authorized users have access!.</li>\n</ol>\n<p><strong>🤖 Conditional IP Blocker :</strong> &#8211; The Conditional IP Blocker is your automated defense against suspicious login attempts. 🛡️ When a user repeatedly fails to log in within a specified time frame, this feature automatically blocks their IP address. This proactive approach helps prevent potential security threats and unauthorized access to your site. The system Conditionally identifies patterns of failed login attempts and takes swift action to safeguard your platform. ⚠️</p>\n<p><strong>🚀 Emergency Shutdown Mode:</strong> &#8211; Ensure the utmost security for your website with the Emergency Shutdown Mode. In times of crisis, this feature allows you to swiftly block access to all users, including administrators, except for the super admin. By implementing this safeguard, you can protect sensitive data and maintain control over your site&#8217;s operations during emergencies.</p>\n<p><strong>📊 Enable weekly plugin download notification</strong> &#8211; You will get a weekly calculation in the form of notification of how many users have downloaded your plugin daily in your Slack workspace.</p>\n<p><strong>🔄 User Role change notification</strong> &#8211; As soon as a user&#8217;s current role is upgraded or modified, you will be informed.</p>\n<p><strong>🔒 Lost password? Reset notification</strong> &#8211; You can find out if someone has changed the password by attempting to recover a lost password.</p>\n<p><strong>🔐 User account password change notification</strong> &#8211; Additionally, you will be able to determine whether someone has altered their password on their own account.</p>\n<p><strong>💸 Coupon uses notification</strong> &#8211;  Get notified on Slack when someone purchased product using coupon code.</p>\n<p><strong>🛍️ Sales Notification to Slack</strong> &#8211;  Get notified on Slack when someone makes a purchase on your website.</p>\n<p><strong>⚙️ Unwanted Site Script Modification</strong> &#8211;  Get notified on Slack when there is an unwanted modification in the website&#8217;s script.</p>\n<p><strong>🚨 Site Hack or Security Issues</strong> &#8211;  Get notified on Slack when there is a potential security issue or hack on the website.</p>\n<p><strong>⏰ Order not completed reminder</strong> &#8211; Receive timely reminders on Slack for any incomplete orders, allowing you to follow up and potentially recover lost sales. .</p>\n<p><strong>✏️ Product editor notification</strong> &#8211; Stay informed about any changes made to your product listings with instant notifications on Slack. This helps you track product updates and ensures accurate and up-to-date information for your customers. .</p>\n<p><strong>🚚 Shipping Status Updates</strong> &#8211; Receive real-time updates on shipping statuses directly to your Slack account. Keep customers informed and enhance their experience by providing timely delivery information. .</p>\n<p><strong>📬 Billing &amp; Shipping Address notification</strong> &#8211; Stay on top of any modifications to billing and shipping addresses by receiving instant notifications on Slack. This ensures that you have the most accurate information for order fulfillment and customer communication. .</p>\n<p><strong>🚧 Advance Error Log panel</strong> &#8211; Access an advanced error log panel directly through your Slack workspace. Monitor and troubleshoot website errors efficiently, enabling quick resolution and improved site performance. .</p>\n<p><strong>🐞 Active debug mode from site</strong> &#8211;  Activate the debug mode for your website directly from site. This feature enhances your ability to identify and address issues promptly, streamlining the debugging process for a smoother website operation. .</p>\n<p><strong>🚨 Get error notification</strong> &#8211; Receive immediate notifications on Slack for any errors detected on your website. Stay proactive in resolving issues to maintain a seamless user experience and prevent potential disruptions to your site&#8217;s functionality.</p>\n<p><strong>🔐 Login event with IP location alert</strong> &#8211; Stay vigilant with our Login Event Alert featuring IP location details! Receive instant notifications whenever a login occurs, providing you with valuable insights into user activities and enhancing your website&#8217;s security.</p>\n<p><strong>🚫 User deletion event alert</strong> &#8211; Keep track of user management with our User Deletion Event Alert! Receive timely notifications when a user is deleted, allowing you to stay informed about changes to your website&#8217;s user base.</p>\n<p><strong>🔐 Authentication failed alert with IP &amp; Location</strong> &#8211; Boost your site security with Authentication Failed Alerts! Receive notifications containing IP and location details whenever authentication failures are detected, empowering you to take swift action against potential threats.</p>\n<p><strong>📄 Page create or updating alert</strong> &#8211; Never miss a beat in your content creation journey! Get notified instantly when a new page is created or an existing one gets an update. Stay on top of your website&#8217;s dynamic content effortlessly.</p>\n<p><strong>📝 Post create or updating alert</strong> &#8211; Stay in the loop with real-time notifications for post creation or updates! Keep your content fresh and engaging by being promptly informed  &hellip;</p>\n",
        "installation": "<ol>\n<li>Go to your Dashboard</li>\n<li>Opt-in to Plugins &gt; Add New </li>\n<li>Search forNotifier To Slack</li>\n<li>Click Install and Activate</li>\n</ol>\n<p>Once you activate the plugin, it will be redirect to the plugin added pages <strong>add your plugin and hit save</strong>. Then simply visit setting page to set slack channel webhook and review interval. That’s it! You’re ready to get all review/support notification.</p>\n",
        "faq": "\n<dt id='how%20quickly%20can%20i%20get%20started%3F'>\nHow quickly can I get started?\n</h4>\n<p>\n<p>You can get started within a few minutes. Activate the plugin, connect your webhok and set interval then set the plugin slug and you’re ready.</p>\n</p>\n<dt id='how%20do%20i%20set%20up%20the%20slack%20notifications%3F'>\nHow do I set up the Slack notifications?\n</h4>\n<p>\n<p>You need to enter your Slack webhook URL in the plugin settings panel. Instructions for generating the webhook URL are provided in the settings panel.</p>\n</p>\n<dt id='can%20i%20give%20specific%20time%20for%20notification%3F'>\nCan I give specific time for notification?\n</h4>\n<p>\n<p>Yes of course, you can specify any time when you want the notification to appear.</p>\n</p>\n<dt id='will%20this%20plugin%20slow%20down%20my%20website%3F'>\nWill this plugin slow down my website?\n</h4>\n<p>\n<p>No, this plugin has been designed to have minimal impact on website performance.</p>\n</p>\n<dt id='is%20this%20plugin%20compatible%20with%20all%20modern%20browsers%3F'>\nIs this plugin compatible with all modern browsers?\n</h4>\n<p>\n<p>Yes, you can use this plugin in all modern browsers (Safari, Chrome, Firefox, Edge, etc) without any issue.</p>\n</p>\n<dt id='do%20i%20need%20to%20know%20any%20programming%20language%20for%20using%20this%20plugin%3F'>\nDo I need to know any programming language for using this plugin?\n</h4>\n<p>\n<p>No.Notifier To Slack is an easy-to-use plugin and you can use it without any programming knowledge.</p>\n</p>\n<dt id='what%20happens%20if%20i%20don%27t%20set%20up%20the%20slack%20notifications%3F'>\nWhat happens if I don&#8217;t set up the Slack notifications?\n</h4>\n<p>\n<p>You will not receive any notifications on Slack, but the plugin will still function normally.</p>\n</p>\n\n",
        "changelog": "<h4>2.16.0 – 26 August 2024</h4>\n<ul>\n<li>New: Advance Page and Post settings panel Implemented to get notification related to post and page created and other information</li>\n<li>New: Advance Media settings panel implemented  to get notification related to site media files</li>\n</ul>\n<h4>2.15.0 – 16 August 2024</h4>\n<ul>\n<li>New: New System and server information added to Dashboard</li>\n<li>New: Popup modal and alert </li>\n</ul>\n<h4>2.14.3 – 03 August 2024</h4>\n<ul>\n<li>Improvement: Readme and video guide updated</li>\n</ul>\n<h4>2.14.2 – 25 July 2024</h4>\n<ul>\n<li>Enhancement: Enhanced compatibility to support WordPress 6.6</li>\n</ul>\n<h4>2.14.1 – 15 July 2024</h4>\n<ul>\n<li>New: Banner update </li>\n</ul>\n<h4>2.14.0 – 03 July 2024</h4>\n<ul>\n<li>New: Introduce Website Downtime &amp; Erros Alerts</li>\n</ul>\n<h4>2.13.1 – 28 May 2024</h4>\n<ul>\n<li>Fix: Resolved issues when click to get slack global webhook triggered its not updated the latest changes.</li>\n</ul>\n<h4>2.13.0 – 06 May 2024</h4>\n<ul>\n<li>New: Introduce Integration panel </li>\n<li>New: FormFlow Integration support added </li>\n<li>New: Contact Form 7 Integration support added </li>\n<li>New: Implement new HeadwayWidget </li>\n<li>New: Implement new notice</li>\n</ul>\n<h4>2.12.1 – 02 May 2024</h4>\n<ul>\n<li>Enhancement: In the active user list, set the default login user to be the current active user.</li>\n<li>Enhancement: Add current user suffix as &#8220;me&#8221; and modal to request confirmation before logout.</li>\n</ul>\n<h4>2.12.0 – 01 May 2024</h4>\n<ul>\n<li>New: Find the current active user list on your website.</li>\n<li>New: Forcefully logout any currently active user from the list on your website.</li>\n<li>Enhancement: See who visited your website</li>\n</ul>\n<h4>2.11.3 – 26 Apr 2024</h4>\n<ul>\n<li>Enhancement: Update the Freemius module </li>\n<li>Fix: Resolved issues during installation and direct active plugin from plugin download page</li>\n</ul>\n<h4>2.11.2 – 08 Apr 2024</h4>\n<ul>\n<li>Enhancement: Enhanced compatibility to support WordPress 6.5</li>\n</ul>\n<h4>2.11.1 &#8211; 17 March 2024</h4>\n<ul>\n<li>Improvement: Readme and Others file Tag Updated</li>\n</ul>\n<h4>2.11.0 &#8211; 16 March 2024</h4>\n<ul>\n<li>New: The emergency shutdown mode was developed, which blocked all users, including the administrator, in the event of an emergency. Only the super admin can access the site, and all other users will automatically log out.   </li>\n</ul>\n<h4>2.10.0 &#8211; 26 Feb 2024</h4>\n<ul>\n<li>New: Ticket descriptions added for supports and review </li>\n<li>New: Notice for plugin review status</li>\n<li>New: Enable weekly plugin overview</li>\n<li>New: Get information about downloading plugins</li>\n<li>Fix: If admin IP blocked then settings not saved/updated. Now its fixed, so login admin can change the settings even if his ip blocked </li>\n</ul>\n<h4>2.9.1 &#8211; 23 Feb 2024</h4>\n<ul>\n<li>Fix: Fixed Conditional IP Blocker blocked list</li>\n<li>Improvement: Added &#8216;Click to get slack global webhook&#8217;</li>\n</ul>\n<h4>2.9.0 &#8211; 19 Feb 2024</h4>\n<ul>\n<li>New: Integrate Cloudflare Turnstile</li>\n<li>New: WordPress Login</li>\n<li>New: WodPress Register</li>\n<li>New: WordPress Reset Password</li>\n<li>New: WordPress Comment</li>\n<li>New: WooCommerce Login/Register</li>\n<li>New: WooCommerce Lost/Reset Password</li>\n</ul>\n<h4>2.8.0 &#8211; 06 Feb 2024</h4>\n<ul>\n<li>New: Multisite support</li>\n<li>New: Mail notification for all plugin activation and deactivation [Beta]</li>\n<li>Fix: Fixed advance security settings and page and post settings toggle conflict</li>\n</ul>\n<h4>2.7.0 &#8211; 24 Jan 2024</h4>\n<ul>\n<li>New: comment approval, deletion, and unapproval notice</li>\n<li>New: Manual IP Blocker</li>\n<li>New: Conditional IP Blocker</li>\n</ul>\n<h4>2.6.0 &#8211; 31 Dec 2023</h4>\n<ul>\n<li>New: Visitor traffic list</li>\n<li>Fix: UI improvement</li>\n</ul>\n<h4>2.5.0 &#8211; 20 Dec 2023</h4>\n<ul>\n<li>New: Global slack webhook configuration</li>\n<li>New: Theme activation alert</li>\n<li>New: Theme deletion alert</li>\n<li>New: New Theme installed alert</li>\n<li>New: Settings General page modification alert</li>\n<li>New: User deletion event alert</li>\n<li>New: Authentication failed alert with IP &amp; Location</li>\n<li>New: Advance Page and Post settings panel</li>\n<li>New: Page create or updating alert</li>\n<li>New: Post create or updating alert</li>\n<li>New: Post taxonomy alert</li>\n<li>New: Page/Post make trash alert</li>\n<li>New: Page/Post untrash alert</li>\n<li>New: Media Library attachment added event</li>\n<li>New: Media Library attachment deleted event</li>\n<li>New: Page/Post deleted alert</li>\n</ul>\n<h4>2.4.0 &#8211; 14 Dec 2023</h4>\n<ul>\n<li>New: Easy maintenance mode panel</li>\n<li>New: Advance Error Log panel</li>\n<li>New: Active debug mode from site</li>\n<li>New: Site error notification</li>\n<li>New: UI Improvement</li>\n</ul>\n<h4>2.3.0 &#8211; 05 Dec 2023</h4>\n<ul>\n<li>New: Order not completed reminder</li>\n<li>New: Product editor notification</li>\n<li>New: Shipping status notification</li>\n<li>New: Billing &amp; Shipping Address notification</li>\n</ul>\n<h4>2.2.2 &#8211; 29 Nov 2023</h4>\n<ul>\n<li>New: Parent site add.   </li>\n<li>Fix: Account page Issues.  </li>\n</ul>\n<h4>2.2.1 &#8211; 26 Nov 2023</h4>\n<ul>\n<li>New: Account and Upgrade page</li>\n</ul>\n<h4>2.2.0 &#8211; 24 Nov 2023</h4>\n<ul>\n<li>New: Enable day to day notification for review</li>\n<li>New: Enable day to day notification for support</li>\n<li>New: Enable weekly plugin download notification</li>\n<li>New: User Role change notification</li>\n<li>New: Lost password? Reset notification</li>\n<li>New: User account password change notification</li>\n<li>New: Coupon uses notification</li>\n<li>New: Sales Notifications to Slack</li>\n<li>New: Core wp-config modification alert</li>\n<li>New: Core .htaccess modification alert</li>\n<li>Fix: review and support notifier title Issues</li>\n<li>Fix: modal closing issues while in outside of the modal</li>\n<li>Fix: responsive issues from author page</li>\n<li>Fix: All other minor bugs</li>\n</ul>\n<h4>2.1.0 &#8211; 22 Nov 2023</h4>\n<ul>\n<li>New: day to day notification for review</li>\n<li>New: day to day notification for support</li>\n<li>New: weekly plugin download notification</li>\n<li>\n<p>Temp Key API update</p>\n</li>\n<li>\n<p>New: Pro feature Implement</p>\n</li>\n<li>New: Code refactor</li>\n<li>New: License panel</li>\n</ul>\n<h4>2.0.0 &#8211; 21 Nov 2023</h4>\n<ul>\n<li>New: Activation page</li>\n<li>New: Pro feature Implement</li>\n<li>Fix: UI Improvement</li>\n<li>Code refactor</li>\n<li>License panel</li>\n</ul>\n<h4>1.9.1 &#8211; 18 Nov 2023</h4>\n<ul>\n<li>New: Video tutorial update</li>\n</ul>\n<h4>1.9.0 &#8211; 17 Nov 2023</h4>\n<ul>\n<li>New: Add Support page</li>\n<li>Fix: Optimize code and fix all other minor bugs</li>\n</ul>\n<h4>1.8.2 &#8211; 17 Nov 2023</h4>\n<ul>\n<li>New: Enhanced Dashboard calculation time from WordPress REST API to Ajax</li>\n</ul>\n<h4>1.8.1 &#8211; 09 Nov 2023</h4>\n<ul>\n<li>New: Enhanced compatibility to support WordPress 6.4</li>\n<li>Fix: fatal error site health status</li>\n</ul>\n<h4>1.8.0 &#8211; 24 October 2023</h4>\n<ul>\n<li>New: Add new Time Interval from review, support and days for all feature</li>\n<li>Fix: fatal error once use Support notification </li>\n<li>Fix: Optimize code and fix all other minor bugs</li>\n</ul>\n<h4>1.7.3 &#8211; 23 October 2023</h4>\n<ul>\n<li>New: Video tutorial update</li>\n<li>Fix: site health status problem and fatal error</li>\n</ul>\n<h4>1.7.2 &#8211; 22 October 2023</h4>\n<ul>\n<li>Fix: corn job runtime issues </li>\n</ul>\n<h4>1.7.1 &#8211; 22 October 2023</h4>\n<ul>\n<li>Maintenance Update</li>\n</ul>\n<h4>1.7.0 &#8211; 16 October 2023</h4>\n<ul>\n<li>Add corn job to run anonymously </li>\n</ul>\n<h4>1.6.6 – 02 OCTOBER 2023</h4>\n<ul>\n<li>Fix: Timing accuracy problem</li>\n<li>Fix: Review not sending in given time</li>\n<li>Fix: Supports notification not sending in given time</li>\n</ul>\n<h4>1.6.5 &#8211; 26 August 2023</h4>\n<ul>\n<li>Fix cross origin YouTube video playback console error</li>\n<li>Improvement: Improve login chart and daily reset</li>\n</ul>\n<h4>1.6.4 &#8211; 24 August 2023</h4>\n<ul>\n<li>Assets update</li>\n<li>Improvement: Fix Dashboard chat overflow issue</li>\n</ul>\n<h4>1.6.3 &#8211; 23 August 2023</h4>\n<ul>\n<li>New: Add site health </li>\n<li>Fix: Fix responsive issues</li>\n</ul>\n<h4>1.6.2 &#8211; 23 August 2023</h4>\n<ul>\n<li>New: Add graph of daily login activity</li>\n<li>Fix: Logged out user bug fix from dashboard </li>\n</ul>\n<h4>1.6.1 &#8211; 22 August 2023</h4>\n<ul>\n<li>New: Add instruction video for each feature</li>\n<li>Fix: Dashboard logged data reset feature after 24 hours</li>\n</ul>\n<h4>1.6.0 &#8211; 18 August 2023</h4>\n<ul>\n<li>New: Dashboard feature implement</li>\n<li>New: Plugin Update widgets </li>\n<li>New: Last activaited pluigin widgets </li>\n<li>New: Last deactivated pluigin widgets </li>\n<li>New: Today logged users widgets   </li>\n<li>New: Today logged out users widgets </li>\n<li>Improvement: Enhanced and refacor code</li>\n</ul>\n<h4>1.5.1 &#8211; 16 August 2023</h4>\n<ul>\n<li>Fix: htaccess not found warning</li>\n</ul>\n<h4>1.5.0 &#8211; 15 August 2023</h4>\n<ul>\n<li>New: Core wp-config modification alert</li>\n<li>New: htaccess modification alert</li>\n<li>New: Introduce Dashboard</li>\n</ul>\n<h4>1.4.4 &#8211; 14 August 2023</h4>\n<ul>\n<li>Improvement: Enhanced compatibility to support WordPress 6.3</li>\n</ul>\n<h4>1.4.3 &#8211; 25 May 2023</h4>\n<ul>\n<li>Improvement: Maintenance Update</li>\n</ul>\n<h4>1.4.2 &#8211; 17 APR 2023</h4>\n<ul>\n<li>Improvement: Maintenance Update</li>\n</ul>\n<h4>1.4.1 &#8211; 31 MAR 2023</h4>\n<ul>\n<li>Improvement: Checked compatibility with WordPress 6.2</li>\n</ul>\n<h4>1.4.0 &#8211; 18 MAR 2023</h4>\n<ul>\n<li>New: Sales Notifications to Slack</li>\n<li>New: Product stock, out of stock Notifications</li>\n<li>New: Comment Moderation notifications</li>\n</ul>\n<h4>1.3.2 &#8211; 06 MAR 2023</h4>\n<ul>\n<li>Fixed: Fix on reload support response sending to slack</li>\n</ul>\n<h4>1.3.0 &#8211; 06 MAR 2023</h4>\n<ul>\n<li>New: Login/Logout alert</li>\n<li>New: New User Registration alert</li>\n<li>New: Site health notification</li>\n<li>New: WooCommerce settings panel UI</li>\n<li>New: Advance Security settings panel</li>\n<li>Fixed: WPCS and PHPCS</li>\n<li>Improvement: Updated readme</li>\n</ul>\n<h4>1.2.4 &#8211; 05 MAR 2023</h4>\n<ul>\n<li>Fixed: Registration error</li>\n</ul>\n<h4>1.2.3 &#8211; 05 MAR 2023</h4>\n<ul>\n<li>New: Plugin Deactivation notice feature</li>\n<li>New: Plugin Update notification feature</li>\n<li>New: Plugin Update notification feature</li>\n<li>Fixed: Registration error</li>\n<li>Improvement: Updated readme</li>\n</ul>\n<h4>1.1.3 &#8211; 05 MAR 2023</h4>\n<ul>\n<li>Improvement: Code and security</li>\n</ul>\n<h4>1.1.2 &#8211; 05 MAR 2023</h4>\n<ul>\n<li>Improvement: UI Update</li>\n</ul>\n<h4>1.1.1 &#8211; 04 MAR 2023</h4>\n<ul>\n<li>Improvement: Updated readme</li>\n</ul>\n<h4>1.1.0 &#8211; 04 MAR 2023</h4>\n<ul>\n<li>New: Plugin activation notice</li>\n<li>New: Plugin deactivation notice</li>\n<li>New: Plugin update notice</li>\n<li>New: WordPress update notice</li>\n<li>Fixed: Code refactor and fix all bugs/errors</li>\n<li>Improvement: Update UI</li>\n<li>Improvement: Update logo</li>\n<li>Improvement: Updated readme</li>\n</ul>\n<h4>1.0.1 – 28 FEB 2023</h4>\n<ul>\n<li>Update banner images</li>\n</ul>\n<h4>1.0.0 &#8211; 21 FEB 2023</h4>\n<ul>\n<li>Initial stable release</li>\n</ul>\n"
    },
    "short_description": "The #1 Notifier plugin, streamlines WordPress experience, Increase the security, monitoring activity, allowing you to focus on what matters most.",
    "description": "<p>The #1 Notifier plugin, streamlines WordPress experience, Increase the security, monitoring activity, allowing you to focus on what matters most.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ADbxWuOY4kc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><a href=\"https://wpxperties.com/notifier-to-slack/\" rel=\"nofollow ugc\">Website</a> | <a href=\"https://wpxperties.com/docs-category/notifier-to-slack/\" rel=\"nofollow ugc\">Documentations</a> | <a href=\"https://www.youtube.com/playlist?list=PL4m92NgWQaq5ttBH9gSYUX1r4c6rtgLg9\" rel=\"nofollow ugc\">Tutorials</a></p>\n<p>Boost Your WooCommerce Experience with Instant Slack Notifications for Stocks, Order Status, Sales, Comments, Coupon Uses and Billing-Shipping status. Enhance your site security with a comprehensive tracking system that monitors user and editor activities at every step. Gain insights into authentication failures and other critical events to elevate your website&#8217;s defense to the next level. You have the option to track users in any mixture, keep track on their secret activities, and receive as many notifications as they have. All notifications can be delivered to Slack, Mail.</p>\n<blockquote><p> As a developer, if you have a WordPress ORG plugin and don&#8217;t want to spend your entire day monitoring new releases or support cases, you may leave the headaches to our plugin and get all instant notifications in your mobile Slack APP\n</p></blockquote>\n<h4>You don&#8217;t need to constantly visit the forum to check daily updates, reviews, and support</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/mDnbCo2w4BE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<blockquote><p>\nGet notified of each event using the Slack mobile app. Observe all of your website activities with ease and without logging in. Give WP Notifier to Slack all the be concerned, and you can stress-free carry out your everyday chores.\n</p></blockquote>\n<h3>📊Advance monitoring dashboard</h3>\n<p>Notifier To Slack plugin has site monitoring dashboard. You will be visualize and notified promptly if any previously installed plugin is deactivated or uninstalled, or if a new plugin is added and activated in your website. Receive notifications for user Registration, Sign-in/Sign-out. Few key points are listed below.</p>\n<ol>\n<li><strong>Realtime active user list in website</strong> </li>\n<li><strong>Easy and instant user kickout feature</strong> </li>\n<li><strong>Site Health Status</strong> </li>\n<li><strong>Realtime plugin update overview</strong> </li>\n<li><strong>Realtime Login attempt graph with daily login attempt information</strong> </li>\n<li><strong>Site visitor traffic list information with Visiting time, count and accurate location</strong> </li>\n<li><strong>Realtime last activaited pluigin info</strong> </li>\n<li><strong>Realtime last deactivated pluigin info</strong> </li>\n<li><strong>Realtime daily basis sign in-out users with time information</strong></li>\n</ol>\n<h3>👉Plugin corn setup and configuration guide</h3>\n<p>Add the corn URL to execute event, even though your site has no traffic/visitors. Whether you are not active on your website, it will send you a response at your preferred interval.</p>\n<p>Cron setup: <a href=\"https://console.cron-job.org/jobs/create\" rel=\"nofollow ugc\">Visit</a></p>\n<p>Complete below steps<br />\n1. Create cronjob<br />\n2. Set Title<br />\n3. Paste the URL you copied from above<br />\n4. Add an execution schedule of 5-25 minutes, in accordance with the specified interval.<br />\n5. Disable: From &#8216;Notify me when&#8217; the cronjob will be disabled because of too many failures</p>\n<p>👉<a href=\"https://www.youtube.com/playlist?list=PL4m92NgWQaq5ttBH9gSYUX1r4c6rtgLg9\" rel=\"nofollow ugc\">WP Notifier To Slack playlist</a></p>\n<h3>🤖 Advance CAPTCHA technology panel</h3>\n<p>Turnstile is Cloudflare&#8217;s latest privacy-focused invisible CAPTCHA solution, created to provide a modern alternative to CAPTCHA. So we Implement Cloudflare Turnstile for WordPress, WooCommerce login and registrations.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/PGo3vGEWP1c?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>🚨 Emergency Shutdown Mode</h3>\n<p>A new emergency shutdown mode has been developed to provide heightened security measures in critical situations. This feature is designed to immediately block access to all users, including administrators, in the event of an emergency. Only the super admin retains access to the site, while all other users are automatically logged out.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/MIeTLammCNg?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>💀 Instant Site Security Notifications</h3>\n<p>This feature likely monitors the WordPress configuration file (wp-config.php) and the .htaccess file for any unauthorized changes. If a hacker attempts to modify these files, the plugin will send a notification to the website administrator via Slack instantly, alerting them to the potential security breach.</p>\n<h3>🥏 Instant WooCommerce Notifications</h3>\n<p>If your WordPress website includes a WooCommerce store, this feature likely notifies the admin about important events related to product stock status and sales. This could include notifications for products going in or out of stock and sales with user and product details, all sent to Slack. Whenever a product is sold, you will notify instantly and you will know the update of the order status on every changes. When user use a coupon while purchasing a product, you will also be able notify about the product and user-related details.</p>\n<ol>\n<li><strong>Product stock, out of stock Notifications</strong> </li>\n<li><strong>Comment Moderation notifications</strong> </li>\n<li><strong>Sales Notifications to Slack</strong> </li>\n<li><strong>Order not completed within provided days reminder</strong> </li>\n<li><strong>Coupon uses notification</strong> </li>\n<li><strong>Product editor notification</strong> </li>\n<li><strong>Shipping status notification</strong> </li>\n<li><strong>Billing &amp; Shipping Address notification</strong> </li>\n</ol>\n<p>With the mobile Slack in your hand, you will be aware of user feedback regarding blog posts comment, products review, and every instantaneous replay.</p>\n<h3>🔝 Notifier To Slack FEATURES</h3>\n<ol>\n<li>\n<p><strong>Support channel review</strong> &#8211;  With WP Notifier to Slack, you can receive instant notifications of any support cases and reviews for your released plugins. This feature allows you to stay on top of your plugin-related support and feedback, enabling you to respond promptly and improve your users&#8217; experience.</p>\n</li>\n<li>\n<p><strong>Live Monitoring of Plugin Pages</strong> &#8211; This plugin also offers live monitoring of your plugin pages. You will receive immediate alerts whenever a plugin is activated or removed from your website. This feature enhances the security of your site, giving you peace of mind that you are always aware of any changes that occur, even when you are not present.</p>\n</li>\n<li>\n<p><strong>WordPress and Plugin-Related Update Notifications</strong> -WP Notifier to Slack notifies you immediately when the latest version of a plugin becomes available or when a WordPress core update is released. This feature keeps you informed about updates related to your website, ensuring that you stay up-to-date on every field, including security.</p>\n</li>\n<li>\n<p><strong>Unlimited notification sync</strong> &#8211; You can sync as many notification as you want with your added plugin.</p>\n</li>\n<li>\n<p><strong>Review Notification</strong> &#8211;  Get instant notifications about new reviews for your plugin from WordPress.org on your Slack channel.</p>\n</li>\n<li><strong>Plugin Activation/Deactivation Alert</strong> &#8211;  Get notified on Slack when your plugin is activated or deactivated on any website.</li>\n<li><strong>WP Core Update Notification</strong> &#8211;  Get notified on Slack when a new WordPress Core update is available.</li>\n<li><strong>Plugin Update Notification</strong> &#8211;  Get notified on Slack when a new update for your plugin is available.</li>\n<li>\n<p><strong>Login/Logout Alert</strong> &#8211;  Get notified on Slack when someone logs in or out of the website.</p>\n</li>\n<li>\n<p><strong>New User Registration Alert</strong> &#8211;  Get notified on Slack when a new user registers on the website.</p>\n</li>\n<li>\n<p><strong>Site Health Notification</strong> &#8211;  Get notified on Slack when there is a site health issue that needs attention.</p>\n</li>\n<li>\n<p><strong>Product Stock/Out of Stock Notification</strong> &#8211;  Get notified on Slack when a product is low on stock or out of stock.</p>\n</li>\n<li>\n<p><strong>Comment Moderation Notification</strong> &#8211;  Get notified on Slack when a new comment is posted on the website and needs moderation.</p>\n</li>\n<li>\n<p><strong>Corn job API</strong> &#8211; Use Corn API to get the response even if you&#8217;re not logged in.</p>\n</li>\n<li>\n<p><strong>Dynamic Dashboard</strong> &#8211; You may see all of the information provided by the website through this advanced admin panel, including the number of users who have tried to log in or signed out of your website on a daily basis. All of this information will be displayed to you promptly.</p>\n</li>\n<li>\n<p><strong>Website Health Score</strong> &#8211; A rating on the current condition of your website will be shown to you which will give you an idea of the current condition of the website.</p>\n</li>\n<li>\n<p><strong>Easy maintenance mode panel</strong> &#8211; Simplify website maintenance with an easy-to-use maintenance mode panel. Efficiently toggle maintenance mode on or off.</p>\n</li>\n<li>\n<p><strong>Global slack webhook configuration</strong> &#8211; Effortlessly streamline your communication with our Global Slack Webhook Configuration! Connect your all preference with easy check and stay in the loop with instant alerts, ensuring seamless collaboration and real-time updates across your team.</p>\n</li>\n<li>\n<p><strong>Theme activation alert</strong> &#8211; Experience ultimate control over your website aesthetics! Receive immediate alerts the moment your theme is activated. Stay ahead of the game and ensure a smooth transition whenever changes occur.</p>\n</li>\n<li>\n<p><strong>Theme deletion alert</strong> &#8211; Protect your theme environment! Our Theme Deletion Alert keeps you informed about any theme bidding farewell. Stay proactive and prevent accidental deletions with timely notifications.</p>\n</li>\n<li>\n<p><strong>New Theme installed alert</strong> &#8211; Embrace the new look! Get notified as soon as a fresh theme is installed, allowing you to stay on top of your website&#8217;s visual identity effortlessly..</p>\n</li>\n<li>\n<p><strong>Settings General page modification alert:</strong> &#8211; No modification goes unnoticed! Receive instant alerts for any changes made on the General Settings page. Stay informed and maintain control over your website&#8217;s settings with ease.</p>\n</li>\n<li>\n<p><strong>Cloudflare Turnstile for login/registrations:</strong> &#8211; Simply add Cloudflare Turnstile to your login and registrations page of your WordPress website to safeguard them from spam! A user-friendly and privacy-preserving reCAPTCHA solution.</p>\n</li>\n</ol>\n<h3>🔝 Notifier To Slack ADVANCED FEATURES</h3>\n<p><strong>🌟 Enable day to day notification for review</strong> &#8211; With the help of this plugin, you can start getting daily updates as well. New reviews will be sent to your Slack account promptly, saving you from having to repeatedly receive the same reviews.</p>\n<p><strong>🆘 Enable day to day notification for support:</strong> &#8211; With the help of this plugin, you can start getting daily updates as well. New suppor query will be sent to your Slack account promptly, saving you from having to repeatedly receive the same query.</p>\n<p><strong>⚙️ Integration list</strong> &#8211; If the most common forms on your website (Contact Form 7, FormFlow and more) have been filled out and submitted, you will receive immediate notifications along with the leads. This will allow you to view leads without logging into the website. The rapid notification allows you to respond to the user instantly following a form submission.</p>\n<p><strong>🚨 Visitor traffic list :</strong> &#8211; Keep track of your website visits! When visitors arrive to your site, you&#8217;ll get a full breakdown of who they are.</p>\n<p><strong>🔔 Forcefully logout currently active user :</strong> &#8211;  This tool allows you to manage your website&#8217;s active user more efficiently. Instantly update the status of active users in your WordPress dashboard; This ensuring accurate tracking of online users. Moreover, you can now take immediate action by forcefully logging out any selected user. In case of emergencies, simply click on &#8220;logout&#8221; to terminate a user&#8217;s session instantly, providing enhanced control over your website&#8217;s user management.</p>\n<p><strong>🛑 IP Blocker :</strong> &#8211; The IP Blocker feature empowers you with direct control over your website&#8217;s security by allowing you to manually/Auto block specific IP addresses or ranges. 🚫 Whether you need to restrict access for a particular user or block a range of IPs using CIDR notation, this tool provides you with the flexibility to enhance your site&#8217;s security. Simply input the desired IP address or range, and visitors from those locations will be restricted from accessing your site. 🧑‍💻</p>\n<p>Usage:</p>\n<ol>\n<li>To block a single IP: 🚫 Keep 182.168.1.1</li>\n<li>To block a range using CIDR: 🚫 Keep 203.0.113.0/24</li>\n<li>Take control of your website&#8217;s security with the Auto IP Blocker, and ensure only authorized users have access!.</li>\n</ol>\n<p><strong>🤖 Conditional IP Blocker :</strong> &#8211; The Conditional IP Blocker is your automated defense against suspicious login attempts. 🛡️ When a user repeatedly fails to log in within a specified time frame, this feature automatically blocks their IP address. This proactive approach helps prevent potential security threats and unauthorized access to your site. The system Conditionally identifies patterns of failed login attempts and takes swift action to safeguard your platform. ⚠️</p>\n<p><strong>🚀 Emergency Shutdown Mode:</strong> &#8211; Ensure the utmost security for your website with the Emergency Shutdown Mode. In times of crisis, this feature allows you to swiftly block access to all users, including administrators, except for the super admin. By implementing this safeguard, you can protect sensitive data and maintain control over your site&#8217;s operations during emergencies.</p>\n<p><strong>📊 Enable weekly plugin download notification</strong> &#8211; You will get a weekly calculation in the form of notification of how many users have downloaded your plugin daily in your Slack workspace.</p>\n<p><strong>🔄 User Role change notification</strong> &#8211; As soon as a user&#8217;s current role is upgraded or modified, you will be informed.</p>\n<p><strong>🔒 Lost password? Reset notification</strong> &#8211; You can find out if someone has changed the password by attempting to recover a lost password.</p>\n<p><strong>🔐 User account password change notification</strong> &#8211; Additionally, you will be able to determine whether someone has altered their password on their own account.</p>\n<p><strong>💸 Coupon uses notification</strong> &#8211;  Get notified on Slack when someone purchased product using coupon code.</p>\n<p><strong>🛍️ Sales Notification to Slack</strong> &#8211;  Get notified on Slack when someone makes a purchase on your website.</p>\n<p><strong>⚙️ Unwanted Site Script Modification</strong> &#8211;  Get notified on Slack when there is an unwanted modification in the website&#8217;s script.</p>\n<p><strong>🚨 Site Hack or Security Issues</strong> &#8211;  Get notified on Slack when there is a potential security issue or hack on the website.</p>\n<p><strong>⏰ Order not completed reminder</strong> &#8211; Receive timely reminders on Slack for any incomplete orders, allowing you to follow up and potentially recover lost sales. .</p>\n<p><strong>✏️ Product editor notification</strong> &#8211; Stay informed about any changes made to your product listings with instant notifications on Slack. This helps you track product updates and ensures accurate and up-to-date information for your customers. .</p>\n<p><strong>🚚 Shipping Status Updates</strong> &#8211; Receive real-time updates on shipping statuses directly to your Slack account. Keep customers informed and enhance their experience by providing timely delivery information. .</p>\n<p><strong>📬 Billing &amp; Shipping Address notification</strong> &#8211; Stay on top of any modifications to billing and shipping addresses by receiving instant notifications on Slack. This ensures that you have the most accurate information for order fulfillment and customer communication. .</p>\n<p><strong>🚧 Advance Error Log panel</strong> &#8211; Access an advanced error log panel directly through your Slack workspace. Monitor and troubleshoot website errors efficiently, enabling quick resolution and improved site performance. .</p>\n<p><strong>🐞 Active debug mode from site</strong> &#8211;  Activate the debug mode for your website directly from site. This feature enhances your ability to identify and address issues promptly, streamlining the debugging process for a smoother website operation. .</p>\n<p><strong>🚨 Get error notification</strong> &#8211; Receive immediate notifications on Slack for any errors detected on your website. Stay proactive in resolving issues to maintain a seamless user experience and prevent potential disruptions to your site&#8217;s functionality.</p>\n<p><strong>🔐 Login event with IP location alert</strong> &#8211; Stay vigilant with our Login Event Alert featuring IP location details! Receive instant notifications whenever a login occurs, providing you with valuable insights into user activities and enhancing your website&#8217;s security.</p>\n<p><strong>🚫 User deletion event alert</strong> &#8211; Keep track of user management with our User Deletion Event Alert! Receive timely notifications when a user is deleted, allowing you to stay informed about changes to your website&#8217;s user base.</p>\n<p><strong>🔐 Authentication failed alert with IP &amp; Location</strong> &#8211; Boost your site security with Authentication Failed Alerts! Receive notifications containing IP and location details whenever authentication failures are detected, empowering you to take swift action against potential threats.</p>\n<p><strong>📄 Page create or updating alert</strong> &#8211; Never miss a beat in your content creation journey! Get notified instantly when a new page is created or an existing one gets an update. Stay on top of your website&#8217;s dynamic content effortlessly.</p>\n<p><strong>📝 Post create or updating alert</strong> &#8211; Stay in the loop with real-time notifications for post creation or updates! Keep your content fresh and engaging by being promptly informed  &hellip;</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.16.0.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-1.jpg?rev=3081892",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-2.jpg?rev=3040982",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-3.jpg?rev=3040982",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-4.jpg?rev=3081892",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-5.jpg?rev=3081892",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-6.jpg?rev=3081892",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-7.jpg?rev=3081892",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-8.jpg?rev=3040982",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-9.jpg?rev=3040982",
            "caption": ""
        }
    ],
    "tags": {
        "monitoring": "monitoring",
        "notifier": "notifier",
        "security": "security",
        "shutdown": "shutdown",
        "turnstile": "turnstile"
    },
    "stable_tag": "2.16.0",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.0.1.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.1.3.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.2.4.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.3.2.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.4.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.4.4.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.5.1.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.6.3.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.6.5.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.6.6.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.7.0.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.7.2.zip",
        "1.7.3": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.7.3.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.8.0.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.8.1.zip",
        "1.8.2": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.8.2.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.9.0.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.9.1.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.0.0.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.1.0.zip",
        "2.10.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.10.0.zip",
        "2.11.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.11.0.zip",
        "2.11.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.11.1.zip",
        "2.11.2": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.11.2.zip",
        "2.11.3": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.11.3.zip",
        "2.12.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.12.0.zip",
        "2.12.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.12.1.zip",
        "2.13.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.13.0.zip",
        "2.13.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.13.1.zip",
        "2.14.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.14.0.zip",
        "2.14.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.14.1.zip",
        "2.14.2": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.14.2.zip",
        "2.14.3": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.14.3.zip",
        "2.15.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.15.0.zip",
        "2.16.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.16.0.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.2.1.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.2.2.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.3.0.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.4.0.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.5.0.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.6.0.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.7.0.zip",
        "2.8.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.8.0.zip",
        "2.9.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.9.0.zip",
        "2.9.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.9.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/notifier-to-slack.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/notifier-to-slack/assets/banner-772x250.png?rev=3118485",
        "high": "https://ps.w.org/notifier-to-slack/assets/banner-1544x500.png?rev=3118485"
    },
    "icons": {
        "1x": "https://ps.w.org/notifier-to-slack/assets/icon-128x128.gif?rev=3040982",
        "2x": "https://ps.w.org/notifier-to-slack/assets/icon-256x256.gif?rev=3040982"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}