{
    "name": "WP Activity Guard – Boost Site Security, Activity Log &amp; Admin Notifications | WP Notifier To Slack",
    "slug": "notifier-to-slack",
    "version": "2.22.1",
    "author": "<a href=\"https://wpxperties.com/\">WPXpertise</a>",
    "author_profile": "https://profiles.wordpress.org/devsabbirahmed/",
    "contributors": {
        "wpxpertise": {
            "profile": "https://profiles.wordpress.org/wpxpertise/",
            "avatar": "https://secure.gravatar.com/avatar/5ee8ed68e5a119fe22b4cba211cc6450?s=96&d=monsterid&r=g",
            "display_name": "wpxpertise"
        },
        "devsabbirahmed": {
            "profile": "https://profiles.wordpress.org/devsabbirahmed/",
            "avatar": "https://secure.gravatar.com/avatar/d8f953bd4233694f95c777fa8565fdca?s=96&d=monsterid&r=g",
            "display_name": "Sabbir Sam"
        }
    },
    "requires": "5.9",
    "tested": "6.6.2",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 2,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 2,
    "support_url": "https://wordpress.org/support/plugin/notifier-to-slack/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 10,
    "last_updated": "2024-10-01 14:56:00",
    "added": "2023-02-28",
    "homepage": "https://github.com/wpxpertise/",
    "sections": {
        "description": "<p>Are you managing a WordPress site with multiple users performing admin tasks but struggling to track user activities? Do you run an online store with WooCommerce and find it challenging to respond to customers promptly? Want to elevate your site&#8217;s security to an exceptional level, making it nearly impossible for hackers to breach?</p>\n<p>WP Activity Guard an activity log and notifier plugin is your all-in-one solution. This powerful plugin not only logs and monitors user activities but also enhances your site’s security, tracks WooCommerce events, and sends real-time notifications to Slack, email, and your WordPress dashboard. Whether you&#8217;re online or offline, stay informed and in control with instant alerts and comprehensive activity log.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ADbxWuOY4kc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><a href=\"https://wpxperties.com/notifier-to-slack/\" rel=\"nofollow ugc\">Website</a> | <a href=\"https://wpxperties.com/docs-category/notifier-to-slack/\" rel=\"nofollow ugc\">Documentations</a> | <a href=\"https://www.youtube.com/playlist?list=PL4m92NgWQaq5ttBH9gSYUX1r4c6rtgLg9\" rel=\"nofollow ugc\">Tutorials</a></p>\n<h3>💀 Instant Site Security Notifications</h3>\n<p>WP Activity Guard enhances the security of your WordPress site by monitoring core files for any unauthorized changes. It protects your site from hackers by increasing overall security, restricting suspicious IP addresses, tracking unusual HTTP requests, and detecting malicious file injections. If a hacker attempts to modify these files, the plugin will immediately notify the website administrator via Slack and email, while also recording the activity log in the Dashboard. This way, you stay informed about any potential security breaches. Key features include:</p>\n<ol>\n<li><strong>Conditional IP Blocker</strong></li>\n<li><strong>Manual IP Blocker</strong></li>\n<li><strong>.htaccess modification alert</strong></li>\n<li><strong>Disable Themes &amp; Plugins Editor page</strong></li>\n<li><strong>Monitoring Suspicious HTTP Requests</strong></li>\n<li><strong>Monitoring Admin page access alerts</strong></li>\n<li><strong>Rate-Limiting Login Attempts</strong></li>\n<li><strong>Track Excessive 404 Errors</strong></li>\n<li><strong>Track File Uploads for Malicious Code</strong></li>\n<li><strong>Monitor WordPress Core file integrity</strong></li>\n<li><strong>Bot Traffic Detection (Rate-Limiting)</strong></li>\n<li><strong>Hide WP version</strong></li>\n<li><strong>Remove X-Powered-By</strong></li>\n<li><strong>wp-config modification alert</strong></li>\n</ol>\n<h3>🌐 Dashboard for advanced monitoring and logs</h3>\n<p>WP Activity Guard includes a comprehensive site monitoring dashboard for tracking and generating detailed activity log. The dashboard displays data in the form of graphs, status updates, and key metrics. Key features include:</p>\n<ol>\n<li><strong>Realtime activity log in the Dashboard</strong> </li>\n<li><strong>Get active user list in website and kickout anyone with one click</strong> </li>\n<li><strong>Get site visitor traffic list information with visiting time, count and accurate location</strong> </li>\n<li><strong>Get site health status to take immediate actions when required</strong> </li>\n<li><strong>Author panel to get plugin all status, support case and review</strong> </li>\n<li><strong>Realtime plugin update overview</strong> </li>\n<li><strong>Realtime leads and form submission alert for FormFlow and Contact Form 7 plugin</strong> </li>\n<li><strong>Cloudflare turnstile for site security</strong> </li>\n<li><strong>Easy maintenance mode panel to active maintenance mode</strong> </li>\n<li><strong>WooCommerce settings panel</strong> </li>\n<li><strong>Track website email submissions</strong> </li>\n<li><strong>Advance Page and Post settings panel</strong> </li>\n<li><strong>Realtime login attempt graph with daily login attempt information</strong> </li>\n<li><strong>Realtime last activaited pluigin info</strong> </li>\n<li><strong>Realtime last deactivated pluigin info</strong> </li>\n<li><strong>Realtime daily basis sign in-out users with time information</strong> </li>\n<li><strong>Get advance system info panel with server environment log, active themes and plugin info</strong> </li>\n<li><strong>Reset log and all activities manually and recursively</strong></li>\n</ol>\n<h3>🥏 Instant WooCommerce Notifications</h3>\n<p>Enhance your WooCommerce experience with instant Slack notifications for stock updates, order statuses, sales, comments, coupon usage, billing and shipping details, new orders, product downloads, and much more. WP Activity Guard helps you log all products/orders update/change and actions on your WordPress site, allowing reply to customers quickly and take appropriate action. The key features include:</p>\n<ol>\n<li><strong>Product stock, out of stock Notifications</strong> </li>\n<li><strong>Order not completed within provided days reminder</strong> </li>\n<li><strong>Coupon uses while purchase notification</strong> </li>\n<li><strong>Product download notification</strong> </li>\n<li><strong>Billing &amp; Shipping Address notification</strong> </li>\n<li><strong>Sales Notifications to Slack</strong> </li>\n<li><strong>Product editor notification</strong> </li>\n<li><strong>Shipping status notification</strong> </li>\n<li><strong>Comment Moderation notifications</strong></li>\n</ol>\n<h3>🤖 Advance CAPTCHA technology panel</h3>\n<p>Turnstile is Cloudflare&#8217;s latest privacy-focused invisible CAPTCHA solution, created to provide a modern alternative to CAPTCHA. So we Implement Cloudflare Turnstile for WordPress, WooCommerce login and registrations.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/PGo3vGEWP1c?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>🚨 Emergency Shutdown Mode</h3>\n<p>A new emergency shutdown mode has been developed to provide heightened security measures in critical situations. This feature is designed to immediately block access to all users, including administrators, in the event of an emergency. Only the super admin retains access to the site, while all other users are automatically logged out.</p>\n<h3>🔝 WP activity guard additional features</h3>\n<p><strong>⚠️ Activity log</strong> &#8211;  Activity Log helps to receive instant log for any WordPress actions,  user hidden activity that helps you to respond promptly and improve your site security.</p>\n<p><strong>🧩  Plugin/Theme updated notice with who update it</strong> &#8211; Get notified on Slack and activity log dashboard when plugin/theme is updated by any admin/user.</p>\n<p><strong>🚨 My Account page download notice</strong> &#8211;  Get notified on Slack and activity log when someone download product from My Account page.</p>\n<p><strong>💸 Coupon uses notification</strong> &#8211;  Get notified on Slack and activity log when someone purchased product using coupon code.</p>\n<p><strong>⏰ Order not completed reminder</strong> &#8211; Receive timely reminders on Slack and activity log for any incomplete orders, allowing you to follow up and potentially recover lost sales.</p>\n<p><strong>🔄 User Role change notification</strong> &#8211; As soon as a user&#8217;s current role is upgraded or modified, you will be informed.</p>\n<p><strong>🤖 Manual and Conditional IP Blocker</strong> &#8211; The IP Blocker feature empowers you with direct control over your website&#8217;s security by allowing you to manually/Auto block specific IP addresses or ranges. 🚫 Whether you need to restrict access for a particular user or block a range of IPs using CIDR notation, this tool provides you with the flexibility to enhance your site&#8217;s security. Simply input the desired IP address or range, and visitors from those locations will be restricted from accessing your site. 🧑‍💻</p>\n<p>Usage:<br />\n1. To block a single IP: 🚫 Keep 182.168.1.1<br />\n2. To block a range using CIDR: 🚫 Keep 203.0.113.0/24</p>\n<p>The Conditional IP Blocker is your automated defense against suspicious login attempts. When a user repeatedly fails to log in within a specified time frame, this feature automatically blocks their IP address.</p>\n<p><strong>🔐 Lost password? User account password/ Reset notification</strong> &#8211; You can find out if someone has changed the password by attempting to recover a lost password. Additionally, you will be able to determine whether someone has altered their password on their own account.</p>\n<p><strong>🛍️ Sales Notification to Slack</strong> &#8211;  Get notified on Slack and activity log when someone makes a purchase on your website.</p>\n<p><strong>⚙️ Unwanted Site Script Modification</strong> &#8211;  Get notified on Slack and activity log when there is an unwanted modification in the website&#8217;s script.</p>\n<p><strong>✏️ Product editor notification</strong> &#8211; Stay informed about any changes made to your product listings with instant notifications on Slack. This helps you track product updates and ensures accurate and up-to-date information for your customers.</p>\n<p><strong>🚚 Shipping Status Updates</strong> &#8211; Receive real-time updates on shipping statuses directly to your Slack account. Keep customers informed and enhance their experience by providing timely delivery information.</p>\n<p><strong>📬 Billing &amp; Shipping Address notification</strong> &#8211; Stay on top of any modifications to billing and shipping addresses by receiving instant notifications on Slack. This ensures that you have the most accurate information for order fulfillment and customer communication.</p>\n<p><strong>🌟 Enable day to day notification for review</strong> &#8211; With the help of this plugin, you can start getting daily updates as well. New reviews will be sent to your Slack account promptly, saving you from having to repeatedly receive the same reviews.</p>\n<p><strong>🆘 Enable day to day notification for support</strong> &#8211; With the help of this plugin, you can start getting daily updates as well. New suppor query will be sent to your Slack account promptly, saving you from having to repeatedly receive the same query.</p>\n<p><strong>📊 Enable weekly plugin download notification</strong> &#8211; You will get a weekly calculation in the form of notification of how many users have downloaded your plugin daily in your Slack workspace.</p>\n<p><strong>🚧 Advance Error Log panel</strong> &#8211; Access an advanced error log panel directly through your Slack workspace. Monitor and troubleshoot website errors efficiently, enabling quick resolution and improved site performance.</p>\n<p><strong>🐞 Active debug mode from site</strong> &#8211;  Activate the debug mode for your website directly from site. This feature enhances your ability to identify and address issues promptly, streamlining the debugging process for a smoother website operation.</p>\n<p><strong>🚨 Get error notification</strong> &#8211; Receive immediate notifications on Slack for any errors detected on your website. Stay proactive in resolving issues to maintain a seamless user experience and prevent potential disruptions to your site&#8217;s functionality.</p>\n<p><strong>🔐 Login event with IP location alert</strong> &#8211; Stay vigilant with our Login Event Alert featuring IP location details! Receive instant notifications whenever a login occurs, providing you with valuable insights into user activities and enhancing your website&#8217;s security.</p>\n<p><strong>🚫 User deletion event alert</strong> &#8211; Keep track of user management with our User Deletion Event Alert! Receive timely notifications when a user is deleted, allowing you to stay informed about changes to your website&#8217;s user base.</p>\n<p><strong>🔐 Authentication failed alert with IP &amp; Location</strong> &#8211; Boost your site security with Authentication Failed Alerts! Receive notifications containing IP and location details whenever authentication failures are detected, empowering you to take swift action against potential threats.</p>\n<p><strong>📄 Page/Post create, delete or updating alert</strong> &#8211; Never miss a beat in your content creation journey! Get notified instantly when a new page/post is created or an existing one gets an update. Stay on top of your website&#8217;s dynamic content effortlessly. Keep your content organized! Receive alerts for taxonomy changes in your posts, ensuring a structured and well-categorized content landscape.</p>\n<p><strong>🎛 Support channel review</strong> &#8211;  With WP Notifier to Slack, you can receive instant notifications of any support cases and reviews for your released plugins. This feature allows you to stay on top of your plugin-related support and feedback, enabling you to respond promptly and improve your users&#8217; experience.</p>\n<p><strong>🖱 Plugin Activation/Deactivation Alert</strong> &#8211;  Get notified when your plugin is activated or deactivated on any website.</p>\n<p><strong>📲 Login/Logout and User Registration Alert</strong> &#8211;  Get notified when someone logs in/out or when a new user registers on the website.</p>\n<p><strong>📈 Site Health Notification</strong> &#8211;  Get notified when there is a site health issue that needs attention. Log the site health in the dashboard with activity log.</p>\n<p><strong>📉 Product Stock/Out of Stock Notification</strong> &#8211;  Get notified when a product is low on stock or out of stock. Log the stock in the dashboard with details activity log of product.</p>\n<p><strong>📑 Comment action and moderation Notification</strong> &#8211;  Get notified on Slack and log activity when a new comment is posted, approved, decline or deleted. Log the comment in the dashboard with details activity log.</p>\n<p><strong>💻 Website Health Score</strong> &#8211; A rating on the current condition of your website will be shown to you which will give you an idea of the current condition of the website.</p>\n<p><strong>🚪 Theme activation, deletion, installed alert</strong> &#8211; Receive immediate alerts the moment your theme is activated or deleted or updated. Stay ahead of the game and ensure a smooth transition whenever changes occur.</p>\n<p><strong>💻  Monitoring Suspicious HTTP Requests</strong> &#8211; Activity Log actively monitors suspicious HTTP requests, including SQL Injection, XSS attacks, SQL Dropping, and Directory Traversal, and instantly alerts you, ensuring top-tier protection and immediate response to potential threats.</p>\n<p><strong>🦾  Monitoring Admin page access alerts</strong> &#8211; This feature continuously monitors the admin area and tracks logged-in users. If any user attempts to access the admin site without proper administrator privileges using hacking tools, it will log an alert, providing you with crucial security oversight and peace of mind.</p>\n<p><strong>🈲  Rate-Limiting Login Attempts</strong> &#8211; This feature implements rate-limiting for login attempts, monitoring visitors closely. If a user fails to log in three times, they will be automatically blocked for 10 minutes, significantly enhancing your site&#8217;s security against unauthorized access.</p>\n<p><strong>⛔  Track Excessive 404 Errors</strong> &#8211; This feature tracks excessive 404 errors, identifying suspicious behavior. If any IP address generates more than 10 404 errors within a 5-minute period, you&#8217;ll be promptly alerted, allowing you to take proactive measures to enhance your site&#8217;s security.</p>\n<p><strong>🦠  Track File Uploads for Malicious Code</strong> &#8211; This feature monitors file uploads for any suspicious activity, automatically blocking any disallowed file types. You can choose approved formats like—&#8217;image/jpeg&#8217;, &#8216;image/png&#8217;, and &#8216;application/pdf&#8217;, &#8216;application/zip&#8217;, &#8216;video/mp4&#8217; will be permitted only, ensuring robust protection against potentially harmful uploads, all other type formats will be blocked while upload.<br />\nGet the type from here: <a href=\"https://wpxperties.com/https-yourwebsite-com-mime-types-in-wordpress/\" rel=\"nofollow ugc\">wpxperties</a></p>\n<p><strong>💯  Monitor WordPress Core file integrity</strong> &#8211; This feature diligently monitors critical WordPress core files, including .htaccess, wp-login.php, wp-signup.php, wp-config.php, index.php, and wp-settings.php. If any changes are detected, it provides file modification logs, ensuring you stay informed and can swiftly respond to potential security threats.</p>\n<p><strong>🚸  Bot Traffic Detection (Rate-Limiting)</strong> &#8211; This feature offers advanced Bot Traffic Detection with rate-limiting capabilities, logging any alerts. If a suspicious bot is detected making over 200 requests per minute from a single IP address, it will be automatically blocked for 30 minutes, effectively safeguarding your site from potential attacks.</p>\n<p><strong>🛜  Hide WP version and remove X-Powered-By</strong> &#8211; This feature enhances your site&#8217;s security by removing the WordPress version number with PHP version from HTTP headers, RSS feeds and any enqueued scripts and styles. This helps to prevent potential attackers from exploiting known vulnerabilities associated with specific WordPress versions.</p>\n<p><strong>💳  Disable Themes &amp; Plugins Editor page</strong> &#8211; This feature enhances security by disabling the Themes and Plugins Editor from the admin page, preventing unauthorized users from making potentially harmful changes to your site&#8217;s code directly through the dashboard.</p>\n<p><strong>✉️ Introducing Email Logging</strong> &#8211; Capture and monitor all emails sent from your WordPress site for enhanced visibility into your site&#8217;s communication.</p>\n<p><strong>🚨 Visitor traffic list</strong> &#8211; Keep track of your website visitor log! When visitors arrive to your site, you&#8217;ll get a full breakdown of who they are.</p>\n<p><strong>🔔 Forcefully logout currently active user</strong> &#8211;  This tool allows you to manage your website&#8217;s active user more efficiently. Instantly update the status of active users in your WordPress dashboard. Moreover, you can now take immediate action by forcefully logging out any selected user. In case of emergencies, simply click on &#8220;Kickout&#8221; to terminate a user&#8217;s session instantly.</p>\n<p><strong>⚙️ Integration list</strong> &#8211; Forms on your website like Contact Form 7, FormFlow or others have been filled out and submitted, you will receive immediate notifications along with the leads. This will allow you to view leads without logging into the website. The rapid notification allows you to respond to the user instantly following a form submission.</p>\n<p><strong>🖥 Easy maintenance mode panel</strong> &#8211; Simplify website maintenance with an easy-to-use maintenance mode panel. Efficiently toggle maintenance mode on or off.</p>\n<p><strong>⚙️ Settings General page modification alert</strong> &#8211; No modification goes unnoticed! Receive instant alerts for any changes made on the General Settings page. Stay informed and maintain control over your website&#8217;s settings with ease.</p>\n<p><strong>🧭  Navigation menu create, update and delete event</strong> &#8211; Get notified on Slack and activity log dashboard when navigation menu create, update and deleted.</p>\n<p><strong>🗑️  Add/update/delete widgets event</strong> &#8211; Get notified on Slack and activity log dashboard when widgets created/updating/deleted.</p>\n",
        "installation": "<p>You can install the plugin manually or via the WordPress admin panel.</p>\n<ol>\n<li>Upload the Plugin:</li>\n</ol>\n<p>&#8211; Upload the notifier-to-slack folder to the /wp-content/plugins/ directory.<br />\n&#8211; Alternatively, install the plugin through the WordPress plugins screen directly.</p>\n<ol>\n<li>Activate the Plugin:</li>\n</ol>\n<p>&#8211; Navigate to the &#8216;Plugins&#8217; section in your WordPress admin panel.<br />\n&#8211; Click &#8216;Add New&#8217; and search for &#8220;WP Activity Guard By WPXpertise&#8221;.<br />\n&#8211; Click &#8216;Install Now&#8217; and then activate the plugin.</p>\n<ol>\n<li>Configure Settings:</li>\n</ol>\n<p>&#8211; Navigate to WP Activity Guard in the WordPress dashboard.<br />\n&#8211; Configure your security settings from ⚙️ Configuration, active all notification preferences, and activity tracking options.</p>\n",
        "faq": "\n<dt id='how%20does%20wp%20activity%20guard%20enhance%20my%20site%E2%80%99s%20security%3F'>\nHow does WP Activity Guard enhance my site’s security?\n</h4>\n<p>\n<p>WP Activity Guard monitors core files, blocks suspicious IPs, detects malicious activities, and provides real-time alerts to keep your site secure from potential threats.</p>\n</p>\n<dt id='does%20it%20support%20woocommerce%3F'>\nDoes it support WooCommerce?\n</h4>\n<p>\n<p>Absolutely! WP Activity Guard offers comprehensive WooCommerce tracking and notifications to keep your e-commerce operations smooth and secure.</p>\n</p>\n<dt id='how%20quickly%20can%20i%20get%20started%3F'>\nHow quickly can I get started?\n</h4>\n<p>\n<p>You can get started within a few minutes. Activate the plugin, connect your webhok and set interval then set the plugin slug and you’re ready.</p>\n</p>\n<dt id='is%20wp%20activity%20guard%20compatible%20with%20all%20themes%20and%20plugins%3F'>\nIs WP Activity Guard compatible with all themes and plugins?\n</h4>\n<p>\n<p>Yes, WP Activity Guard is designed to work seamlessly with most WordPress themes and plugins, including popular ones like WooCommerce, Contact Form 7 and FormFlow.</p>\n</p>\n<dt id='how%20do%20i%20set%20up%20the%20slack%20notifications%3F'>\nHow do I set up the Slack notifications?\n</h4>\n<p>\n<p>You need to enter your Slack webhook URL in the plugin settings panel. Instructions for generating the webhook URL are provided in the settings panel.</p>\n</p>\n<dt id='can%20i%20give%20specific%20time%20for%20notification%3F'>\nCan I give specific time for notification?\n</h4>\n<p>\n<p>Yes of course, you can specify any time when you want the notification to appear.</p>\n</p>\n<dt id='will%20this%20plugin%20slow%20down%20my%20website%3F'>\nWill this plugin slow down my website?\n</h4>\n<p>\n<p>No, this plugin has been designed to have minimal impact on website performance.</p>\n</p>\n<dt id='is%20this%20plugin%20compatible%20with%20all%20modern%20browsers%3F'>\nIs this plugin compatible with all modern browsers?\n</h4>\n<p>\n<p>Yes, you can use this plugin in all modern browsers (Safari, Chrome, Firefox, Edge, etc) without any issue.</p>\n</p>\n<dt id='do%20i%20need%20to%20know%20any%20programming%20language%20for%20using%20this%20plugin%3F'>\nDo I need to know any programming language for using this plugin?\n</h4>\n<p>\n<p>No. WP activity guard is an easy-to-use plugin and you can use it without any programming knowledge.</p>\n</p>\n<dt id='what%20happens%20if%20i%20don%27t%20set%20up%20the%20slack%20notifications%3F'>\nWhat happens if I don&#8217;t set up the Slack notifications?\n</h4>\n<p>\n<p>You will not receive any notifications on Slack, but the plugin will still function normally.</p>\n</p>\n\n",
        "changelog": "<h4>2.22.1</h4>\n<p><strong>WP Activity Guard – Secure Activity Log &amp; Notifications</strong></p>\n<ul>\n<li>New: Navigation menu create, update and delete event</li>\n<li>New: Adding/updating widgets event</li>\n<li>New: Widget deletion event</li>\n<li>New: Plugin updated notice with who update it</li>\n<li>New: Theme updated notice with who update it</li>\n<li>New: Disable Themes &amp; Plugins Editor page</li>\n<li>New: Monitoring Suspicious HTTP Requests</li>\n<li>New: Monitoring Admin page access alerts</li>\n<li>New: Rate-Limiting Login Attempts</li>\n<li>New: Track Excessive 404 Errors</li>\n<li>New: Track File Uploads for Malicious Code</li>\n<li>New: Monitor WordPress Core file integrity</li>\n<li>New: Bot Traffic Detection (Rate-Limiting)</li>\n<li>New: Hide WP version</li>\n<li>New: Remove X-Powered-By</li>\n</ul>\n<h4>2.21.0</h4>\n<ul>\n<li>New: Track email submissions</li>\n<li>Fix: Cron Schedule issue fix for reset activity log</li>\n</ul>\n<h4>2.20.0</h4>\n<ul>\n<li>Enhancement: Advance Log recursively reset functionality enhanced</li>\n</ul>\n<h4>2.19.0</h4>\n<ul>\n<li>New: Improvement of site health status and health score</li>\n<li>Enhancement: Advance Error Log panel status</li>\n</ul>\n<h4>2.18.0</h4>\n<ul>\n<li>New: WooCommerce My Account file download from a user will generate an instant notification in Slack and appear in the activity log.</li>\n<li>New: Activity logs are reset recursively.</li>\n<li>New: A new feature for resetting activity log data.</li>\n</ul>\n<h4>2.17.0</h4>\n<ul>\n<li>New: Dashboard Activity log Implemented to maintain a detailed log of all user and system modifications.</li>\n</ul>\n<h4>2.16.0</h4>\n<ul>\n<li>New: Advance Page and Post settings panel Implemented to get notification related to post and page created and other information</li>\n<li>New: Advance Media settings panel implemented  to get notification related to site media files</li>\n</ul>\n<h4>2.15.0</h4>\n<ul>\n<li>New: New System and server information added to Dashboard</li>\n<li>New: Popup modal and alert </li>\n</ul>\n<h4>2.14.0</h4>\n<ul>\n<li>New: Introduce Website Downtime &amp; Erros Alerts</li>\n</ul>\n<h4>2.13.0</h4>\n<ul>\n<li>New: Introduce Integration panel </li>\n<li>New: FormFlow Integration support added </li>\n<li>New: Contact Form 7 Integration support added </li>\n<li>New: Implement new HeadwayWidget </li>\n<li>New: Implement new notice</li>\n</ul>\n<h4>2.12.0</h4>\n<ul>\n<li>New: Find the current active user list on your website.</li>\n<li>New: Forcefully logout any currently active user from the list on your website.</li>\n<li>Enhancement: See who visited your website</li>\n</ul>\n<h4>2.11.0</h4>\n<ul>\n<li>New: The emergency shutdown mode was developed, which blocked all users, including the administrator, in the event of an emergency. Only the super admin can access the site, and all other users will automatically log out.   </li>\n</ul>\n<h4>2.10.0</h4>\n<ul>\n<li>New: Ticket descriptions added for supports and review </li>\n<li>New: Notice for plugin review status</li>\n<li>New: Enable weekly plugin overview</li>\n<li>New: Get information about downloading plugins</li>\n<li>Fix: If admin IP blocked then settings not saved/updated. Now its fixed, so login admin can change the settings even if his ip blocked </li>\n</ul>\n<h4>2.9.0</h4>\n<ul>\n<li>New: Integrate Cloudflare Turnstile</li>\n<li>New: WordPress Login</li>\n<li>New: WodPress Register</li>\n<li>New: WordPress Reset Password</li>\n<li>New: WordPress Comment</li>\n<li>New: WooCommerce Login/Register</li>\n<li>New: WooCommerce Lost/Reset Password</li>\n</ul>\n<h4>2.8.0</h4>\n<ul>\n<li>New: Multisite support</li>\n<li>New: Mail notification for all plugin activation and deactivation [Beta]</li>\n<li>Fix: Fixed advance security settings and page and post settings toggle conflict</li>\n</ul>\n<h4>2.7.0</h4>\n<ul>\n<li>New: comment approval, deletion, and unapproval notice</li>\n<li>New: Manual IP Blocker</li>\n<li>New: Conditional IP Blocker</li>\n</ul>\n<h4>2.6.0</h4>\n<ul>\n<li>New: Visitor traffic list</li>\n<li>Fix: UI improvement</li>\n</ul>\n<h4>2.5.0</h4>\n<ul>\n<li>New: Global slack webhook configuration</li>\n<li>New: Theme activation alert</li>\n<li>New: Theme deletion alert</li>\n<li>New: New Theme installed alert</li>\n<li>New: Settings General page modification alert</li>\n<li>New: User deletion event alert</li>\n<li>New: Authentication failed alert with IP &amp; Location</li>\n<li>New: Advance Page and Post settings panel</li>\n<li>New: Page create or updating alert</li>\n<li>New: Post create or updating alert</li>\n<li>New: Post taxonomy alert</li>\n<li>New: Page/Post make trash alert</li>\n<li>New: Page/Post untrash alert</li>\n<li>New: Media Library attachment added event</li>\n<li>New: Media Library attachment deleted event</li>\n<li>New: Page/Post deleted alert</li>\n</ul>\n<h4>2.4.0</h4>\n<ul>\n<li>New: Easy maintenance mode panel</li>\n<li>New: Advance Error Log panel</li>\n<li>New: Active debug mode from site</li>\n<li>New: Site error notification</li>\n<li>New: UI Improvement</li>\n</ul>\n<h4>2.3.0</h4>\n<ul>\n<li>New: Order not completed reminder</li>\n<li>New: Product editor notification</li>\n<li>New: Shipping status notification</li>\n<li>New: Billing &amp; Shipping Address notification</li>\n</ul>\n<h4>2.2.0</h4>\n<ul>\n<li>New: Enable day to day notification for review</li>\n<li>New: Enable day to day notification for support</li>\n<li>New: Enable weekly plugin download notification</li>\n<li>New: User Role change notification</li>\n<li>New: Lost password? Reset notification</li>\n<li>New: User account password change notification</li>\n<li>New: Coupon uses notification</li>\n<li>New: Sales Notifications to Slack</li>\n<li>New: Core wp-config modification alert</li>\n<li>New: Core .htaccess modification alert</li>\n<li>Fix: review and support notifier title Issues</li>\n<li>Fix: modal closing issues while in outside of the modal</li>\n<li>Fix: responsive issues from author page</li>\n<li>Fix: All other minor bugs</li>\n</ul>\n<h4>2.0.0</h4>\n<ul>\n<li>New: Activation page</li>\n<li>New: Pro feature Implement</li>\n<li>Fix: UI Improvement</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Initial stable release</li>\n</ul>\n"
    },
    "short_description": "Boost your WordPress site security, monitor activities, track changes and receive instant notifications via activity log panel, slack and email.",
    "description": "<p>Are you managing a WordPress site with multiple users performing admin tasks but struggling to track user activities? Do you run an online store with WooCommerce and find it challenging to respond to customers promptly? Want to elevate your site&#8217;s security to an exceptional level, making it nearly impossible for hackers to breach?</p>\n<p>WP Activity Guard an activity log and notifier plugin is your all-in-one solution. This powerful plugin not only logs and monitors user activities but also enhances your site’s security, tracks WooCommerce events, and sends real-time notifications to Slack, email, and your WordPress dashboard. Whether you&#8217;re online or offline, stay informed and in control with instant alerts and comprehensive activity log.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ADbxWuOY4kc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><a href=\"https://wpxperties.com/notifier-to-slack/\" rel=\"nofollow ugc\">Website</a> | <a href=\"https://wpxperties.com/docs-category/notifier-to-slack/\" rel=\"nofollow ugc\">Documentations</a> | <a href=\"https://www.youtube.com/playlist?list=PL4m92NgWQaq5ttBH9gSYUX1r4c6rtgLg9\" rel=\"nofollow ugc\">Tutorials</a></p>\n<h3>💀 Instant Site Security Notifications</h3>\n<p>WP Activity Guard enhances the security of your WordPress site by monitoring core files for any unauthorized changes. It protects your site from hackers by increasing overall security, restricting suspicious IP addresses, tracking unusual HTTP requests, and detecting malicious file injections. If a hacker attempts to modify these files, the plugin will immediately notify the website administrator via Slack and email, while also recording the activity log in the Dashboard. This way, you stay informed about any potential security breaches. Key features include:</p>\n<ol>\n<li><strong>Conditional IP Blocker</strong></li>\n<li><strong>Manual IP Blocker</strong></li>\n<li><strong>.htaccess modification alert</strong></li>\n<li><strong>Disable Themes &amp; Plugins Editor page</strong></li>\n<li><strong>Monitoring Suspicious HTTP Requests</strong></li>\n<li><strong>Monitoring Admin page access alerts</strong></li>\n<li><strong>Rate-Limiting Login Attempts</strong></li>\n<li><strong>Track Excessive 404 Errors</strong></li>\n<li><strong>Track File Uploads for Malicious Code</strong></li>\n<li><strong>Monitor WordPress Core file integrity</strong></li>\n<li><strong>Bot Traffic Detection (Rate-Limiting)</strong></li>\n<li><strong>Hide WP version</strong></li>\n<li><strong>Remove X-Powered-By</strong></li>\n<li><strong>wp-config modification alert</strong></li>\n</ol>\n<h3>🌐 Dashboard for advanced monitoring and logs</h3>\n<p>WP Activity Guard includes a comprehensive site monitoring dashboard for tracking and generating detailed activity log. The dashboard displays data in the form of graphs, status updates, and key metrics. Key features include:</p>\n<ol>\n<li><strong>Realtime activity log in the Dashboard</strong> </li>\n<li><strong>Get active user list in website and kickout anyone with one click</strong> </li>\n<li><strong>Get site visitor traffic list information with visiting time, count and accurate location</strong> </li>\n<li><strong>Get site health status to take immediate actions when required</strong> </li>\n<li><strong>Author panel to get plugin all status, support case and review</strong> </li>\n<li><strong>Realtime plugin update overview</strong> </li>\n<li><strong>Realtime leads and form submission alert for FormFlow and Contact Form 7 plugin</strong> </li>\n<li><strong>Cloudflare turnstile for site security</strong> </li>\n<li><strong>Easy maintenance mode panel to active maintenance mode</strong> </li>\n<li><strong>WooCommerce settings panel</strong> </li>\n<li><strong>Track website email submissions</strong> </li>\n<li><strong>Advance Page and Post settings panel</strong> </li>\n<li><strong>Realtime login attempt graph with daily login attempt information</strong> </li>\n<li><strong>Realtime last activaited pluigin info</strong> </li>\n<li><strong>Realtime last deactivated pluigin info</strong> </li>\n<li><strong>Realtime daily basis sign in-out users with time information</strong> </li>\n<li><strong>Get advance system info panel with server environment log, active themes and plugin info</strong> </li>\n<li><strong>Reset log and all activities manually and recursively</strong></li>\n</ol>\n<h3>🥏 Instant WooCommerce Notifications</h3>\n<p>Enhance your WooCommerce experience with instant Slack notifications for stock updates, order statuses, sales, comments, coupon usage, billing and shipping details, new orders, product downloads, and much more. WP Activity Guard helps you log all products/orders update/change and actions on your WordPress site, allowing reply to customers quickly and take appropriate action. The key features include:</p>\n<ol>\n<li><strong>Product stock, out of stock Notifications</strong> </li>\n<li><strong>Order not completed within provided days reminder</strong> </li>\n<li><strong>Coupon uses while purchase notification</strong> </li>\n<li><strong>Product download notification</strong> </li>\n<li><strong>Billing &amp; Shipping Address notification</strong> </li>\n<li><strong>Sales Notifications to Slack</strong> </li>\n<li><strong>Product editor notification</strong> </li>\n<li><strong>Shipping status notification</strong> </li>\n<li><strong>Comment Moderation notifications</strong></li>\n</ol>\n<h3>🤖 Advance CAPTCHA technology panel</h3>\n<p>Turnstile is Cloudflare&#8217;s latest privacy-focused invisible CAPTCHA solution, created to provide a modern alternative to CAPTCHA. So we Implement Cloudflare Turnstile for WordPress, WooCommerce login and registrations.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/PGo3vGEWP1c?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>🚨 Emergency Shutdown Mode</h3>\n<p>A new emergency shutdown mode has been developed to provide heightened security measures in critical situations. This feature is designed to immediately block access to all users, including administrators, in the event of an emergency. Only the super admin retains access to the site, while all other users are automatically logged out.</p>\n<h3>🔝 WP activity guard additional features</h3>\n<p><strong>⚠️ Activity log</strong> &#8211;  Activity Log helps to receive instant log for any WordPress actions,  user hidden activity that helps you to respond promptly and improve your site security.</p>\n<p><strong>🧩  Plugin/Theme updated notice with who update it</strong> &#8211; Get notified on Slack and activity log dashboard when plugin/theme is updated by any admin/user.</p>\n<p><strong>🚨 My Account page download notice</strong> &#8211;  Get notified on Slack and activity log when someone download product from My Account page.</p>\n<p><strong>💸 Coupon uses notification</strong> &#8211;  Get notified on Slack and activity log when someone purchased product using coupon code.</p>\n<p><strong>⏰ Order not completed reminder</strong> &#8211; Receive timely reminders on Slack and activity log for any incomplete orders, allowing you to follow up and potentially recover lost sales.</p>\n<p><strong>🔄 User Role change notification</strong> &#8211; As soon as a user&#8217;s current role is upgraded or modified, you will be informed.</p>\n<p><strong>🤖 Manual and Conditional IP Blocker</strong> &#8211; The IP Blocker feature empowers you with direct control over your website&#8217;s security by allowing you to manually/Auto block specific IP addresses or ranges. 🚫 Whether you need to restrict access for a particular user or block a range of IPs using CIDR notation, this tool provides you with the flexibility to enhance your site&#8217;s security. Simply input the desired IP address or range, and visitors from those locations will be restricted from accessing your site. 🧑‍💻</p>\n<p>Usage:<br />\n1. To block a single IP: 🚫 Keep 182.168.1.1<br />\n2. To block a range using CIDR: 🚫 Keep 203.0.113.0/24</p>\n<p>The Conditional IP Blocker is your automated defense against suspicious login attempts. When a user repeatedly fails to log in within a specified time frame, this feature automatically blocks their IP address.</p>\n<p><strong>🔐 Lost password? User account password/ Reset notification</strong> &#8211; You can find out if someone has changed the password by attempting to recover a lost password. Additionally, you will be able to determine whether someone has altered their password on their own account.</p>\n<p><strong>🛍️ Sales Notification to Slack</strong> &#8211;  Get notified on Slack and activity log when someone makes a purchase on your website.</p>\n<p><strong>⚙️ Unwanted Site Script Modification</strong> &#8211;  Get notified on Slack and activity log when there is an unwanted modification in the website&#8217;s script.</p>\n<p><strong>✏️ Product editor notification</strong> &#8211; Stay informed about any changes made to your product listings with instant notifications on Slack. This helps you track product updates and ensures accurate and up-to-date information for your customers.</p>\n<p><strong>🚚 Shipping Status Updates</strong> &#8211; Receive real-time updates on shipping statuses directly to your Slack account. Keep customers informed and enhance their experience by providing timely delivery information.</p>\n<p><strong>📬 Billing &amp; Shipping Address notification</strong> &#8211; Stay on top of any modifications to billing and shipping addresses by receiving instant notifications on Slack. This ensures that you have the most accurate information for order fulfillment and customer communication.</p>\n<p><strong>🌟 Enable day to day notification for review</strong> &#8211; With the help of this plugin, you can start getting daily updates as well. New reviews will be sent to your Slack account promptly, saving you from having to repeatedly receive the same reviews.</p>\n<p><strong>🆘 Enable day to day notification for support</strong> &#8211; With the help of this plugin, you can start getting daily updates as well. New suppor query will be sent to your Slack account promptly, saving you from having to repeatedly receive the same query.</p>\n<p><strong>📊 Enable weekly plugin download notification</strong> &#8211; You will get a weekly calculation in the form of notification of how many users have downloaded your plugin daily in your Slack workspace.</p>\n<p><strong>🚧 Advance Error Log panel</strong> &#8211; Access an advanced error log panel directly through your Slack workspace. Monitor and troubleshoot website errors efficiently, enabling quick resolution and improved site performance.</p>\n<p><strong>🐞 Active debug mode from site</strong> &#8211;  Activate the debug mode for your website directly from site. This feature enhances your ability to identify and address issues promptly, streamlining the debugging process for a smoother website operation.</p>\n<p><strong>🚨 Get error notification</strong> &#8211; Receive immediate notifications on Slack for any errors detected on your website. Stay proactive in resolving issues to maintain a seamless user experience and prevent potential disruptions to your site&#8217;s functionality.</p>\n<p><strong>🔐 Login event with IP location alert</strong> &#8211; Stay vigilant with our Login Event Alert featuring IP location details! Receive instant notifications whenever a login occurs, providing you with valuable insights into user activities and enhancing your website&#8217;s security.</p>\n<p><strong>🚫 User deletion event alert</strong> &#8211; Keep track of user management with our User Deletion Event Alert! Receive timely notifications when a user is deleted, allowing you to stay informed about changes to your website&#8217;s user base.</p>\n<p><strong>🔐 Authentication failed alert with IP &amp; Location</strong> &#8211; Boost your site security with Authentication Failed Alerts! Receive notifications containing IP and location details whenever authentication failures are detected, empowering you to take swift action against potential threats.</p>\n<p><strong>📄 Page/Post create, delete or updating alert</strong> &#8211; Never miss a beat in your content creation journey! Get notified instantly when a new page/post is created or an existing one gets an update. Stay on top of your website&#8217;s dynamic content effortlessly. Keep your content organized! Receive alerts for taxonomy changes in your posts, ensuring a structured and well-categorized content landscape.</p>\n<p><strong>🎛 Support channel review</strong> &#8211;  With WP Notifier to Slack, you can receive instant notifications of any support cases and reviews for your released plugins. This feature allows you to stay on top of your plugin-related support and feedback, enabling you to respond promptly and improve your users&#8217; experience.</p>\n<p><strong>🖱 Plugin Activation/Deactivation Alert</strong> &#8211;  Get notified when your plugin is activated or deactivated on any website.</p>\n<p><strong>📲 Login/Logout and User Registration Alert</strong> &#8211;  Get notified when someone logs in/out or when a new user registers on the website.</p>\n<p><strong>📈 Site Health Notification</strong> &#8211;  Get notified when there is a site health issue that needs attention. Log the site health in the dashboard with activity log.</p>\n<p><strong>📉 Product Stock/Out of Stock Notification</strong> &#8211;  Get notified when a product is low on stock or out of stock. Log the stock in the dashboard with details activity log of product.</p>\n<p><strong>📑 Comment action and moderation Notification</strong> &#8211;  Get notified on Slack and log activity when a new comment is posted, approved, decline or deleted. Log the comment in the dashboard with details activity log.</p>\n<p><strong>💻 Website Health Score</strong> &#8211; A rating on the current condition of your website will be shown to you which will give you an idea of the current condition of the website.</p>\n<p><strong>🚪 Theme activation, deletion, installed alert</strong> &#8211; Receive immediate alerts the moment your theme is activated or deleted or updated. Stay ahead of the game and ensure a smooth transition whenever changes occur.</p>\n<p><strong>💻  Monitoring Suspicious HTTP Requests</strong> &#8211; Activity Log actively monitors suspicious HTTP requests, including SQL Injection, XSS attacks, SQL Dropping, and Directory Traversal, and instantly alerts you, ensuring top-tier protection and immediate response to potential threats.</p>\n<p><strong>🦾  Monitoring Admin page access alerts</strong> &#8211; This feature continuously monitors the admin area and tracks logged-in users. If any user attempts to access the admin site without proper administrator privileges using hacking tools, it will log an alert, providing you with crucial security oversight and peace of mind.</p>\n<p><strong>🈲  Rate-Limiting Login Attempts</strong> &#8211; This feature implements rate-limiting for login attempts, monitoring visitors closely. If a user fails to log in three times, they will be automatically blocked for 10 minutes, significantly enhancing your site&#8217;s security against unauthorized access.</p>\n<p><strong>⛔  Track Excessive 404 Errors</strong> &#8211; This feature tracks excessive 404 errors, identifying suspicious behavior. If any IP address generates more than 10 404 errors within a 5-minute period, you&#8217;ll be promptly alerted, allowing you to take proactive measures to enhance your site&#8217;s security.</p>\n<p><strong>🦠  Track File Uploads for Malicious Code</strong> &#8211; This feature monitors file uploads for any suspicious activity, automatically blocking any disallowed file types. You can choose approved formats like—&#8217;image/jpeg&#8217;, &#8216;image/png&#8217;, and &#8216;application/pdf&#8217;, &#8216;application/zip&#8217;, &#8216;video/mp4&#8217; will be permitted only, ensuring robust protection against potentially harmful uploads, all other type formats will be blocked while upload.<br />\nGet the type from here: <a href=\"https://wpxperties.com/https-yourwebsite-com-mime-types-in-wordpress/\" rel=\"nofollow ugc\">wpxperties</a></p>\n<p><strong>💯  Monitor WordPress Core file integrity</strong> &#8211; This feature diligently monitors critical WordPress core files, including .htaccess, wp-login.php, wp-signup.php, wp-config.php, index.php, and wp-settings.php. If any changes are detected, it provides file modification logs, ensuring you stay informed and can swiftly respond to potential security threats.</p>\n<p><strong>🚸  Bot Traffic Detection (Rate-Limiting)</strong> &#8211; This feature offers advanced Bot Traffic Detection with rate-limiting capabilities, logging any alerts. If a suspicious bot is detected making over 200 requests per minute from a single IP address, it will be automatically blocked for 30 minutes, effectively safeguarding your site from potential attacks.</p>\n<p><strong>🛜  Hide WP version and remove X-Powered-By</strong> &#8211; This feature enhances your site&#8217;s security by removing the WordPress version number with PHP version from HTTP headers, RSS feeds and any enqueued scripts and styles. This helps to prevent potential attackers from exploiting known vulnerabilities associated with specific WordPress versions.</p>\n<p><strong>💳  Disable Themes &amp; Plugins Editor page</strong> &#8211; This feature enhances security by disabling the Themes and Plugins Editor from the admin page, preventing unauthorized users from making potentially harmful changes to your site&#8217;s code directly through the dashboard.</p>\n<p><strong>✉️ Introducing Email Logging</strong> &#8211; Capture and monitor all emails sent from your WordPress site for enhanced visibility into your site&#8217;s communication.</p>\n<p><strong>🚨 Visitor traffic list</strong> &#8211; Keep track of your website visitor log! When visitors arrive to your site, you&#8217;ll get a full breakdown of who they are.</p>\n<p><strong>🔔 Forcefully logout currently active user</strong> &#8211;  This tool allows you to manage your website&#8217;s active user more efficiently. Instantly update the status of active users in your WordPress dashboard. Moreover, you can now take immediate action by forcefully logging out any selected user. In case of emergencies, simply click on &#8220;Kickout&#8221; to terminate a user&#8217;s session instantly.</p>\n<p><strong>⚙️ Integration list</strong> &#8211; Forms on your website like Contact Form 7, FormFlow or others have been filled out and submitted, you will receive immediate notifications along with the leads. This will allow you to view leads without logging into the website. The rapid notification allows you to respond to the user instantly following a form submission.</p>\n<p><strong>🖥 Easy maintenance mode panel</strong> &#8211; Simplify website maintenance with an easy-to-use maintenance mode panel. Efficiently toggle maintenance mode on or off.</p>\n<p><strong>⚙️ Settings General page modification alert</strong> &#8211; No modification goes unnoticed! Receive instant alerts for any changes made on the General Settings page. Stay informed and maintain control over your website&#8217;s settings with ease.</p>\n<p><strong>🧭  Navigation menu create, update and delete event</strong> &#8211; Get notified on Slack and activity log dashboard when navigation menu create, update and deleted.</p>\n<p><strong>🗑️  Add/update/delete widgets event</strong> &#8211; Get notified on Slack and activity log dashboard when widgets created/updating/deleted.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.22.1.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-1.jpg?rev=3152536",
            "caption": "Security Dashboard: Monitor all security events and activity logs in real-time."
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-2.jpg?rev=3040982",
            "caption": "Author page"
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-3.jpg?rev=3040982",
            "caption": "Slack integration page"
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-4.jpg?rev=3081892",
            "caption": "Setting and Integration page: Easily configure your security and notification settings."
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-5.jpg?rev=3081892",
            "caption": "Advance Security settings page"
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-6.jpg?rev=3081892",
            "caption": "WooCommerce page"
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-7.jpg?rev=3081892",
            "caption": "Advance Error Log panel page"
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-8.jpg?rev=3040982",
            "caption": "Slack Response"
        },
        {
            "src": "https://ps.w.org/notifier-to-slack/assets/Screenshot-9.jpg?rev=3040982",
            "caption": "Slack notifications"
        }
    ],
    "tags": {
        "activity-log": "Activity Log",
        "monitoring": "monitoring",
        "notifier": "notifier",
        "security": "security",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "2.22.1",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.1.0.0.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.0.0.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.1.0.zip",
        "2.10.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.10.0.zip",
        "2.11.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.11.0.zip",
        "2.11.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.11.1.zip",
        "2.11.2": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.11.2.zip",
        "2.11.3": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.11.3.zip",
        "2.12.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.12.0.zip",
        "2.12.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.12.1.zip",
        "2.13.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.13.0.zip",
        "2.13.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.13.1.zip",
        "2.14.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.14.0.zip",
        "2.14.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.14.1.zip",
        "2.14.2": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.14.2.zip",
        "2.14.3": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.14.3.zip",
        "2.15.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.15.0.zip",
        "2.16.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.16.0.zip",
        "2.17.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.17.0.zip",
        "2.18.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.18.0.zip",
        "2.19.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.19.0.zip",
        "2.19.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.19.1.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.2.1.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.2.2.zip",
        "2.20.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.20.0.zip",
        "2.21.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.21.0.zip",
        "2.22.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.22.0.zip",
        "2.22.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.22.1.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.3.0.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.4.0.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.5.0.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.6.0.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.7.0.zip",
        "2.8.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.8.0.zip",
        "2.9.0": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.9.0.zip",
        "2.9.1": "https://downloads.wordpress.org/plugin/notifier-to-slack.2.9.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/notifier-to-slack.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/notifier-to-slack/assets/banner-772x250.png?rev=3159046",
        "high": "https://ps.w.org/notifier-to-slack/assets/banner-1544x500.png?rev=3159046"
    },
    "icons": {
        "1x": "https://ps.w.org/notifier-to-slack/assets/icon.svg?rev=3155913",
        "svg": "https://ps.w.org/notifier-to-slack/assets/icon.svg?rev=3155913"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}