{
    "name": "MemberPress payment addon &#8211; Novalnet AG",
    "slug": "novalnet-payment-addon-memberpress",
    "version": "1.0.1",
    "author": "<a href=\"https://www.novalnet.de\">Novalnet AG</a>",
    "author_profile": "https://profiles.wordpress.org/novalnet/",
    "contributors": {
        "novalnet": {
            "profile": "https://profiles.wordpress.org/novalnet/",
            "avatar": "https://secure.gravatar.com/avatar/af1ddcf954f6b2090fcb338c523e809f?s=96&d=monsterid&r=g",
            "display_name": "Novalnet AG"
        }
    },
    "requires": "5.0",
    "tested": "6.4.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/novalnet-payment-addon-memberpress/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 0,
    "downloaded": 402,
    "last_updated": "2023-12-29 07:29:00",
    "added": "2022-07-14",
    "homepage": "https://www.novalnet.de/modul/memberpress",
    "sections": {
        "description": "<h4>(German)</h4>\n<p>(English Description down below)</p>\n<p>Das Novalnet Zahlung-Addon für MemberPress bietet Ihnen eine Vielzahl an hilfreichen Features, die das tägliche Arbeiten mit dem MemberPress-Shopsystem vereinfachen.</p>\n<p>Wählen Sie aus den weltweit beliebtesten über 100 lokalen und internationalen Zahlungsmethoden die für Sie passenden aus, vom Rechnungskauf über SEPA-Lastschrift bis hin zur Kreditkarte.</p>\n<p>Kreditkartenzahlungen sind zusätzlich durch das 3D-Secure-Verfahren abgesichert, um Ihnen als Shop-Betreiber noch mehr Sicherheit zu bieten. Damit gehört das Addon der Novalnet AG zu einem der populärsten Extensions im Bereich Payment.</p>\n<p>Das Addon automatisiert den gesamten Transaktionsvorgang vom Checkout bis zum Forderungsmanagement und Inkasso. Darüber hinaus sichert es die Transaktionen ab und hilft Ihnen als Unternehmen dabei, Ihren Umsatz durch die folgenden Vorteile langfristig zu steigern:</p>\n<ul>\n<li><a href=\"https://www.novalnet.de/zahlungsabwicklung/\" title=\"über 100 lokal und international nachgefragte Zahlungsarten\" rel=\"nofollow ugc\">über 100 lokal und international nachgefragte Zahlungsarten</a> bereits integriert</li>\n<li>umfangreiches <a href=\"https://www.novalnet.de/risikomanagement/\" title=\"Risikomanagement\" rel=\"nofollow ugc\">Risikomanagement</a> zur Minimierung von Zahlungsausfällen durch mehr als 60 im Hintergrund arbeitende Betrugspräventionsmodule</li>\n<li>Für Zahlungsausfälle frei einstellbares, optional kostenloses Forderungsmanagement inkl. verschiedener Mahnstufen</li>\n<li>Automatisierte Rechnungsstellung für Ihre Endkunden</li>\n<li>umfangreiches und kostenloses Debitorenmanagement mit diversen Exportmöglichkeiten für Buchhaltungsprogramme </li>\n<li>Realtime-Monitoring, das Ihren Checkoutprozess in Bezug auf Kaufabbrüche überwacht, und Reporting </li>\n<li>Ihre Gelder sind durch Treuhandkonten zu 100 % u.a. vor einer Insolvenz geschützt</li>\n<li>Kostenfreier technischer Support bei Einbindung und Betrieb des Zahlungs-Addons</li>\n<li>Attraktive und flexible Auszahlungsmodalitäten</li>\n<li>Optionale Mitgliederverwaltung</li>\n<li>Spezielles Endkundenportal für Rückfragen zur Transaktion</li>\n</ul>\n<p>Einfache SEPA-Lastschrift-Lösung. Sie müssen kein separates Bankkonto eröffnen</p>\n<h4>VERMEIDEN SIE MEHRERE VERTRÄGE UND VERSTECKTE KOSTEN</h4>\n<p>Mehrere Verträge für die Zahlungsabwicklung mit verschiedenen Dienstleistern wie Banken, Kreditkarten-Acquirern, Anbietern von Betrugspräventionen, Inkassounternehmen etc. und mit unterschiedlichen Laufzeiten und Gebühren sind mit Nutzung des Addons Vergangenheit.</p>\n<p>Die Novalnet-Plattform sorgt dafür, dass Ihre Zahlungen in MemberPress reibungslos abgewickelt werden, erstellt automatisch Ihre Rechnungen, verschickt pünktlich Mahnungen und verarbeitet auch On-hold-Transaktionen und wiederkehrende Zahlungen.</p>\n<p>Ihre über MemberPress generierten Transaktionen sind durch ein Höchstmaß an Sicherheit geschützt. Dazu wird die Novalnet AG jedes Jahr in einem umfangreichen Sicherheits-Audit nach dem Payment Card Industry Data Security Standard (PCI DSS) auf dem höchsten Level 1 geprüft und zertifiziert.</p>\n<p>Die vielfach automatisierten Abläufe sorgen dafür, dass Sie Kosten sparen und sich auf Ihren Verkaufserfolg konzentrieren können.</p>\n<h4>WICHTIGSTE FUNKTIONEN</h4>\n<ul>\n<li>Einfache Integration in Ihren Bestellprozess – es wird keine externe Seite für die Zahlung aufgerufen</li>\n<li>Responsive Zahlungsseiten</li>\n<li>Sichere SSL-verschlüsselte Gateways</li>\n<li>Klare Echtzeit-Übersicht und Überwachung des Zahlungsstatus sowie automatisierte E-Mail-Benachrichtigungsfunktion für Zahlungsstatusreports</li>\n<li>Automatisierte Berichte und verschiedene Exportfunktionen für Ihre Buchhaltung in XML, SOAP, CSV, MT940 u.v.m. </li>\n<li>Kreditkartenzahlungen <a href=\"https://www.novalnet.de/3d-secure-infos\" title=\"mit 3D-Secure\" rel=\"nofollow ugc\">mit 3D-Secure</a></li>\n<li><a href=\"https://www.novalnet.de/pci-dss-zertifizierung\" title=\"PCI-DSS-konform\" rel=\"nofollow ugc\">PCI-DSS-konform</a>, keine aufwändige und teure Zertifizierung notwendig</li>\n</ul>\n<h4>MIT DEM ADDON KÖNNEN SIE VIELES DIREKT ÜBER DIE MEMBERPRESS-EINSTELLUNGEN VERWALTEN</h4>\n<ul>\n<li>Einfache Konfigurationsmöglichkeit für alle Zahlungsarten</li>\n<li>Einfaches Durchführen von Rückerstattungen aus der Shop-Administration heraus</li>\n<li>Flexible <a href=\"https://www.novalnet.de/abonnementverwaltung\" title=\"Abonnementverwaltung\" rel=\"nofollow ugc\">Abonnementverwaltung</a> für wiederkehrende Zahlungen</li>\n<li>Sehr einfaches Konfigurieren des Risikomanagements</li>\n<li>Einstellen komfortabler Statusmeldungen, z.B. für Zahlungseingänge bei Kauf auf Rechnung und Vorkasse</li>\n<li>Bequeme E-Mail-Benachrichtigungsfunktion über Statusmeldungen der Zahlungen</li>\n<li>Übersichtliches Status-Management für Chargebacks sowie SEPA-Rücklastschriften</li>\n<li>Vorhalten von Bestelldaten bei Kaufabbrüchen</li>\n</ul>\n<h4>LASSEN SIE IHRE KUNDEN ZAHLEN, WIE SIE MÖCHTEN</h4>\n<ul>\n<li><a href=\"https://www.novalnet.de/zahlungsart-kreditkarte\" title=\"Kreditkarte\" rel=\"nofollow ugc\">Kreditkarte</a>: Visa, Mastercard, American Express, JCB, UnionPay, Diners Club, Discover</li>\n<li>Debitkarte: Maestro, Carte Bleue, CartaSi, Postepay, PostFinance Card, PostFinance E-Finance , dankort</li>\n<li>Online-Überweisung: Sofortüberweisung, Onlineüberweisung eps, iDEAL, giropay, Przelewy24 etc.</li>\n<li>Wallet: Alipay, WeChat Pay, Apple Pay, PayPal.</li>\n<li>Vorkasse, Rechnung, Kauf auf Rechnung mit Zahlungsgarantie</li>\n<li><a href=\"https://www.novalnet.de/sepa-lastschrift\" title=\"SEPA-Lastschrift\" rel=\"nofollow ugc\">SEPA-Lastschrift</a>, Direct Debit UK (BACS)</li>\n<li>Barzahlen/viacash, Barzahlung bei Abholung</li>\n<li>Ratenzahlung</li>\n<li>Kauf auf  Rechnung und <a href=\"https://www.novalnet.de/lastschrift-mit-zahlungsgarantie\" title=\"SEPA-Lastschrift sind auch mit Zahlungsgarantie\" rel=\"nofollow ugc\">SEPA-Lastschrift sind auch mit Zahlungsgarantie</a> möglich.</li>\n</ul>\n<h4>GEHEN SIE AUF NUMMER SICHER</h4>\n<p>Die intelligente Novalnet-Betrugsprävention ist abhängig von Zahlungsart, Produktpalette und Warenkorbgröße. Durch zahlreiche, unabhängig zuschaltbare Fraudmodule verringert sich Ihre Zahlungsausfallquote spürbar.</p>\n<h4>SIE HABEN FRAGEN?</h4>\n<p>Kontaktieren Sie uns per E-Mail an <a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> oder telefonisch unter +49 89 9230683-20.</p>\n<p>Weitere Informationen über Novalnet und zur Kompatibilität des Novalnet-Payment-Addons finden Sie weiter unten.</p>\n<h4>(English)</h4>\n<h4>ACCEPT, MANAGE &amp; COLLECT PAYMENTS &#8211; MEMBERPRESS</h4>\n<p>The MemberPress Payment Addon from Novalnet allows you to accept, manage and collect payments. It is designed to optimize your payment processing, enrich customer experiences and improve conversion rates.<br />\nHundreds of e-commerce businesses across the world use this addon to:</p>\n<ul>\n<li>Accept 100+ international &amp; local payment methods</li>\n<li>Add new payment methods any time</li>\n<li>Manage payments, subscriptions &amp; members </li>\n<li>Secure transactions with proven risk management</li>\n<li>Avoid own <a href=\"https://www.novalnet.com/why-novalnet/pci-dss-certification/\" title=\"PCI DSS certification\" rel=\"nofollow ugc\">PCI DSS certification</a> </li>\n<li>Automate customer communication related to payments</li>\n<li>Provide payment support for end customers</li>\n<li>Follow transactions in real time</li>\n<li>Automate reporting for bookkeeping &amp; other departments etc.</li>\n</ul>\n<h4>WIDE PAYMENT PORTFOLIO FOR YOUR ONLINE SHOP</h4>\n<p>The MemberPress Novalnet Payment Addon enables access to <a href=\"https://www.novalnet.com/payment/\" title=\"international and local payment methods\" rel=\"nofollow ugc\">international and local payment methods</a> that can be easily integrated to your checkout process already today. Your payment portfolio remains up to date and follows both global and local payment trends across the world.</p>\n<p>Novalnet’s MemberPress Payment Addon supports:</p>\n<ul>\n<li>\n<p><a href=\"https://www.novalnet.com/payment-processing/credit-card/\" title=\"Credit cards\" rel=\"nofollow ugc\">Credit cards</a> (3DSecure also available): Visa, Mastercard, American Express, JCB, UnionPay, Diners Club,  Discover etc.</p>\n</li>\n<li>\n<p>Debit cards: Maestro, Visa, Carte Bleue, CartaSi, Postepay, PostFinance, dankort etc.</p>\n</li>\n<li>\n<p>Online bank transfers: Sofort, Online bank transfer, eps, iDEAL, giropay, Przelewy24, PostFinance Card, PostFinance E-Finance, Bancontact etc.</p>\n</li>\n<li>\n<p>E-wallets:  <a href=\"https://www.novalnet.com/cooperation/paypal/\" title=\"PayPal\" rel=\"nofollow ugc\">PayPal</a> &amp; Apple Pay</p>\n</li>\n<li>\n<p>Prepayment, Invoice, <a href=\"https://www.novalnet.com/solutions/payment-processing/sepa-direct-debit/\" title=\"Direct Debit SEPA\" rel=\"nofollow ugc\">Direct Debit SEPA</a>, <a href=\"https://www.novalnet.com/barzahlen/\" title=\"Barzahlen\" rel=\"nofollow ugc\">Barzahlen/viacash</a> &amp; Multibanco.</p>\n</li>\n<li>\n<p>Direct Debit SEPA with payment guarantee, Invoice with payment guarantee, Instalment by Invoice &amp; Instalment by Direct Debit SEPA</p>\n</li>\n</ul>\n<p>More information about each payment method can be found on our <a href=\"https://www.novalnet.de/zahlungsabwicklung\" title=\"website\" rel=\"nofollow ugc\">website</a>. If you have any additional inquiries, please do not hesitate to contact us at <a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> or +49 89 9230683-20.</p>\n<h4>ADVANCED PAYMENT EXPERIENCES FOR YOUR CUSTOMERS</h4>\n<p>Novalnet Payment Gateway for MemberPress ensures that your MemberPress offers seamless payment experiences. It provides optimized customer communications and auto-fill of payment details for future purchases. Set up email notifications and reminders for payment status updates and offer valuable customer support through Novalnet platform.</p>\n<h4>DIGITALIZATION &amp; REAL-TIME MONITORING</h4>\n<p>Novalnet’s MemberPress Payment Addon integrates your shop with one payment platform that covers all payment methods and services at once. Save costs, manual effort and time with the following MemberPress Payment Addon features.</p>\n<h4>KEY FEATURES</h4>\n<ul>\n<li>Easy configuration of all international &amp; local payment methods</li>\n<li>One PCI DSS certified payment platform for all payment services from checkout to collection</li>\n<li>Complete automation of all payment processes</li>\n<li>60+ risk &amp; payment fraud detection modules to prevent defaults in real time</li>\n<li>Effortless configuration of risk management with fraud prevention</li>\n<li>Affiliate solution supporting frictionless onboarding, split payments &amp; currency conversion</li>\n<li>Dynamic subscription and member management for recurring payments</li>\n<li>No PCI DSS certification required when using our payment module</li>\n<li>Clear overview of payment status from checkout to receivables</li>\n<li>Multilevel claims management with integrated handover to collection and various export functions for the accounting</li>\n<li>Automated e-mail notifications for staying up to date on the payment status</li>\n<li>Clear real-time overview and monitoring of payment status</li>\n<li>Automated bookkeeping report in XML, SOAP, CSV, MT940</li>\n<li>Simple seamless integration of the payment addon</li>\n<li>Secure SSL- encoded gateways</li>\n<li>On-hold transaction configuration in the shop admin panel</li>\n<li>Refund option for Credit/Debit Cards, Direct Debit SEPA, Direct Debit SEPA with payment guarantee, Invoice, Invoice with payment guarantee, Prepayment, Barzahlen/viacash, Sofort, iDEAL, eps, giropay, PayPal, Przelewy24, PostFinance Card, PostFinance E-Finance, Bancontact, Apple Pay, Online bank transfer, Trustly, Alipay &amp; WeChat Pay.</li>\n<li>Automatic order creation when subscriptions are renewed</li>\n<li>Subscription management (suspend, reactivate, cancel)</li>\n<li>Responsive templates</li>\n</ul>\n<h4>PCI COMPLIANT RISK MANAGEMENT &amp; FRAUD PREVENTION</h4>\n<p>Novalnet provides all its merchants secure payment processing in a PCI DSS Level 1 compliant manner. More than <a href=\"https://www.novalnet.com/risk-management/\" title=\"60 fraud prevention modules\" rel=\"nofollow ugc\">60 fraud prevention modules</a> are integrated to ensure machine learning fraud prevention and optimal risk minimization in real-time.</p>\n<h4>AVOID MULTIPLE CONTRACTS &amp; HIDDEN COSTS</h4>\n<p>This free MemberPress Payment Addon integrates your e-commerce business with Novalnet’s all-in-one payment platform to grow revenue. The integration and services are customizable based on individual customer needs. Novalnet’s prizing depends on your business model and chosen payment methods.</p>\n<p>Please contact us for more information:<a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> or +49 89 9230683-20.</p>\n<h4>ABOUT NOVALNET AG</h4>\n<p><a href=\"https://www.novalnet.de/\" title=\"Novalnet\" rel=\"nofollow ugc\">Novalnet</a> is a financial service institution offering payment solutions world-wide. We support customers all the way from setting up payment types and intelligent fraud prevention modules, to legitimate and reliable receivables and claims management. Operating in the market as a full payment service provider since 2007, we enable maximal reliability and client focus to all customers in every area of payment processing. Novalnet AG is a licensed payment institute which is regulated by the Federal Financial Supervisory Authority (BaFin).</p>\n<h4>ADDON COMPATIBILITY</h4>\n<p>To process Novalnet payments through this MemberPress Payment Addon, a <a href=\"https://www.novalnet.de/kontakt\" title=\"Novalnet account\" rel=\"nofollow ugc\">Novalnet account</a> is needed.</p>\n<ul>\n<li>Compatible with WordPress/MemberPress addons</li>\n<li>Works with WordPress Multi-Site</li>\n</ul>\n<h3>Arbitrary section</h3>\n<h4>Connect to MemberPress:</h4>\n<ol>\n<li>\n<p>Switch back to the WordPress admin area.</p>\n</li>\n<li>\n<p>Click on &#8220;MemberPress&#8221; in the menu on the left and click directly on the sublevel tab &#8220;Settings&#8221; tab there.</p>\n</li>\n<li>\n<p>Inside the &#8220;Novalnet Global Configuration&#8221; section you will have the Novalnet merchant global configuration. It will follow the below mentioned structure</p>\n<ul>\n<li>\n<p><strong>Product activation key</strong> Kindly enter the exact key from Novalnet admin area</p>\n</li>\n<li>\n<p><strong>Payment access key</strong> Kindly enter the exact key from Novalnet admin area</p>\n</li>\n<li>\n<p><strong>Select Tariff ID</strong> Kindly select the tariff from the list</p>\n</li>\n<li>\n<p><strong>Subscription Tariff ID</strong> Kindly select the subscription tariff from the list</p>\n</li>\n<li>\n<p><strong>Notification / Webhook URL</strong> Notification / Webhook URL settings</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Click on the specific membership and nagivate to custom section and choose &#8220;Novalnet&#8221;.</p>\n</li>\n</ol>\n<p>Now, just the following steps have to be executed for going live:</p>\n<h4>TRANSLATIONS</h4>\n<ul>\n<li>English</li>\n<li>German</li>\n</ul>\n<h4>GO-LIVE:</h4>\n<p>Now execute the following steps to go live and start your sales:</p>\n<ul>\n<li>Install the MemberPress Payment Addon by Novalnet directly from the WordPress repository </li>\n<li>Find the detailed information in the Installation Guide (incl. in the package) </li>\n<li>Configure Product Activation Key in the shop admin panel</li>\n<li>Activate &amp; configure the preferred payment types in Novalnet merchant admin panel </li>\n<li>You are ready to go!</li>\n</ul>\n<p>Please contact <a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> / 0049-89-923 068 320 for any technical issues or questions.</p>\n<h4>DISTRIBUTION</h4>\n<p>This addon enables the integration between MemberPress and Novalnet payments. The addon is free and released under the GNU General Public License. If you have found this script useful, please let also others know about it! Recommendations as well as comments in the merchant forum will be appreciated!</p>\n",
        "installation": "<h4>Compatibility</h4>\n<p>Novalnet payment addon compatible from MemberPress 1.9.3.7 &#8211; 1.11.15</p>\n<h4>Automatic Installation:</h4>\n<ul>\n<li>Go to Plugins &gt; “Add New”.</li>\n<li>Download the MemberPress payment addon &#8211; Novalnet from WordPress repository and Click &#8220;Install Now&#8221; to install the addon. A popup window will ask you to confirm your wish to install the addon.</li>\n</ul>\n<h4>Note:</h4>\n<p>If this is the first time you&#8217;ve installed a WordPress plugin, you may need to enter the FTP login credential information. If you&#8217;ve installed the plugin before, it will still have the login information. This information is available through your web server host.</p>\n<ul>\n<li>Click “Proceed” to continue the installation. The resulting installation screen will list the installation as successful or note any problems during the install.</li>\n<li>If successful, click &#8220;Activate Plugin&#8221; to activate it, or “Return to Plugin Installer” for further actions.</li>\n</ul>\n<h4>Manual Installation:</h4>\n<ul>\n<li>Download MemberPress payment addon &#8211; Novalnet to your desktop. (If downloaded as a zip archive, extract the plugin folder to your desktop.)</li>\n<li>Copy the plugin folder and paste into root/wp-content/plugins/ directory.</li>\n<li>Go to Plugins (Novalnet payment addon &#8211; Memberpress) screen and find the “Novalnet payment addon &#8211; Memberpress” in the list.</li>\n<li>Click “Activate Plugin” to activate it.</li>\n<li>Check the details in the readme file for customization and further instructions.</li>\n</ul>\n<h4>Now you can get your Product activation key from the Novalnet Admin Portal:</h4>\n<p>For this, kindly login into the Novalnet Admin Portal:<br />\n1. Go to http://www.novalnet.com and click on &#8220;Login&#8221; (top right). You will be redirected to Novalnet Admin Portal login form.<br />\n2. Inside the Novalnet Admin Portal, choose the tab &#8220;Projects&#8221; and click on the respective project in the list.<br />\n3. Click on the tab &#8220;API credentials&#8221;.<br />\n4. You can find the Product activation key &amp; Payment access key and enter the keys in Novalnet global configuration. Click on the &#8220;Save changes&#8221; button to configure and save the merchant details.</p>\n<h4>Now you have all required details to finish setting up your MemberPress webshop!</h4>\n",
        "faq": "\n<dt id='do%20i%20require%20an%20novalnet%20merchant%20account%20before%20i%20can%20use%20the%20memberpress%20novalnet%20payment%20addon%3F'>\nDo I require an Novalnet merchant account before I can use the MemberPress Novalnet payment addon?\n</h4>\n<p>\n<p>Yes, in order to use this addon and access all popular online payment methods within your MemberPress webshop you must require valid and approved Novalnet account. please contact our sales team <strong>sales@novalnet.de / 0049-89-923 068 320</strong></p>\n</p>\n<dt id='where%20merchant%20can%20find%20product%20activation%20key%3F'>\nWhere merchant can find product activation key?\n</h4>\n<p>\n<p>To get the Product Activation Key, please go to <a href=\"https://admin.novalnet.de/\" title=\"Novalnet admin portal\" rel=\"nofollow ugc\">Novalnet admin portal</a> &#8211; Projects: Project Information &#8211; API credentials: API Signature (Product activation key).</p>\n</p>\n<dt id='how%20to%20configure%20server%20ip%2C%20vendor%20script%20url%20%26%20paypal%20api%3F'>\nHow to configure server IP, vendor script URL &amp; Paypal API?\n</h4>\n<p>\n<p><strong>Vendor Script URL Configuration</strong></p>\n<p>Vendor script URL is required to keep the merchant’s database/system up-to-date and synchronized with Novalnet transaction status. It is mandatory to configure the Vendor Script URL in Novalnet administration portal.</p>\n<p>Novalnet system (via asynchronous) will transmit the information on each transaction and its status to the merchant’s system.</p>\n<p>To configure Vendor Script URL, please go to <a href=\"https://admin.novalnet.de/\" title=\"Novalnet admin portal\" rel=\"nofollow ugc\">Novalnet admin portal</a> &#8211; Projects: Project Information &#8211; API credentials &#8211; Vendor script URL / Notification &amp; Webhook URL.</p>\n<p><strong>Paypal API Configuration</strong></p>\n<p>To configure PayPal API details, please go to <a href=\"https://admin.novalnet.de/\" title=\"Novalnet admin portal\" rel=\"nofollow ugc\">Novalnet admin portal</a> &#8211; Projects: Project Information &#8211; Payment Methods: PayPal &#8211; Configure.</p>\n</p>\n<dt id='does%20this%20addon%20work%20with%20other%20webshop%20addon%3F'>\nDoes this addon work with other Webshop addon?\n</h4>\n<p>\n<p>This online payment addon only works with the MemberPress webshop. Are you looking for other online payment modules for webshop software? Please Find the complete overview of our webshop modules on our website. https://www.novalnet.de</p>\n</p>\n\n",
        "changelog": "<h4>1.0.1</h4>\n<ul>\n<li>[Fix] Compatible for MemberPress version 1.11.15</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>[Initial release] Payment plugin built with seamless payment experience, enhanced features with better usability to maintain the membership either as onetime or recurring</li>\n</ul>\n"
    },
    "short_description": "Novalnet payment addon provides all popular online payment methods for your MemberPress webshop.",
    "description": "<h4>(German)</h4>\n<p>(English Description down below)</p>\n<p>Das Novalnet Zahlung-Addon für MemberPress bietet Ihnen eine Vielzahl an hilfreichen Features, die das tägliche Arbeiten mit dem MemberPress-Shopsystem vereinfachen.</p>\n<p>Wählen Sie aus den weltweit beliebtesten über 100 lokalen und internationalen Zahlungsmethoden die für Sie passenden aus, vom Rechnungskauf über SEPA-Lastschrift bis hin zur Kreditkarte.</p>\n<p>Kreditkartenzahlungen sind zusätzlich durch das 3D-Secure-Verfahren abgesichert, um Ihnen als Shop-Betreiber noch mehr Sicherheit zu bieten. Damit gehört das Addon der Novalnet AG zu einem der populärsten Extensions im Bereich Payment.</p>\n<p>Das Addon automatisiert den gesamten Transaktionsvorgang vom Checkout bis zum Forderungsmanagement und Inkasso. Darüber hinaus sichert es die Transaktionen ab und hilft Ihnen als Unternehmen dabei, Ihren Umsatz durch die folgenden Vorteile langfristig zu steigern:</p>\n<ul>\n<li><a href=\"https://www.novalnet.de/zahlungsabwicklung/\" title=\"über 100 lokal und international nachgefragte Zahlungsarten\" rel=\"nofollow ugc\">über 100 lokal und international nachgefragte Zahlungsarten</a> bereits integriert</li>\n<li>umfangreiches <a href=\"https://www.novalnet.de/risikomanagement/\" title=\"Risikomanagement\" rel=\"nofollow ugc\">Risikomanagement</a> zur Minimierung von Zahlungsausfällen durch mehr als 60 im Hintergrund arbeitende Betrugspräventionsmodule</li>\n<li>Für Zahlungsausfälle frei einstellbares, optional kostenloses Forderungsmanagement inkl. verschiedener Mahnstufen</li>\n<li>Automatisierte Rechnungsstellung für Ihre Endkunden</li>\n<li>umfangreiches und kostenloses Debitorenmanagement mit diversen Exportmöglichkeiten für Buchhaltungsprogramme </li>\n<li>Realtime-Monitoring, das Ihren Checkoutprozess in Bezug auf Kaufabbrüche überwacht, und Reporting </li>\n<li>Ihre Gelder sind durch Treuhandkonten zu 100 % u.a. vor einer Insolvenz geschützt</li>\n<li>Kostenfreier technischer Support bei Einbindung und Betrieb des Zahlungs-Addons</li>\n<li>Attraktive und flexible Auszahlungsmodalitäten</li>\n<li>Optionale Mitgliederverwaltung</li>\n<li>Spezielles Endkundenportal für Rückfragen zur Transaktion</li>\n</ul>\n<p>Einfache SEPA-Lastschrift-Lösung. Sie müssen kein separates Bankkonto eröffnen</p>\n<h4>VERMEIDEN SIE MEHRERE VERTRÄGE UND VERSTECKTE KOSTEN</h4>\n<p>Mehrere Verträge für die Zahlungsabwicklung mit verschiedenen Dienstleistern wie Banken, Kreditkarten-Acquirern, Anbietern von Betrugspräventionen, Inkassounternehmen etc. und mit unterschiedlichen Laufzeiten und Gebühren sind mit Nutzung des Addons Vergangenheit.</p>\n<p>Die Novalnet-Plattform sorgt dafür, dass Ihre Zahlungen in MemberPress reibungslos abgewickelt werden, erstellt automatisch Ihre Rechnungen, verschickt pünktlich Mahnungen und verarbeitet auch On-hold-Transaktionen und wiederkehrende Zahlungen.</p>\n<p>Ihre über MemberPress generierten Transaktionen sind durch ein Höchstmaß an Sicherheit geschützt. Dazu wird die Novalnet AG jedes Jahr in einem umfangreichen Sicherheits-Audit nach dem Payment Card Industry Data Security Standard (PCI DSS) auf dem höchsten Level 1 geprüft und zertifiziert.</p>\n<p>Die vielfach automatisierten Abläufe sorgen dafür, dass Sie Kosten sparen und sich auf Ihren Verkaufserfolg konzentrieren können.</p>\n<h4>WICHTIGSTE FUNKTIONEN</h4>\n<ul>\n<li>Einfache Integration in Ihren Bestellprozess – es wird keine externe Seite für die Zahlung aufgerufen</li>\n<li>Responsive Zahlungsseiten</li>\n<li>Sichere SSL-verschlüsselte Gateways</li>\n<li>Klare Echtzeit-Übersicht und Überwachung des Zahlungsstatus sowie automatisierte E-Mail-Benachrichtigungsfunktion für Zahlungsstatusreports</li>\n<li>Automatisierte Berichte und verschiedene Exportfunktionen für Ihre Buchhaltung in XML, SOAP, CSV, MT940 u.v.m. </li>\n<li>Kreditkartenzahlungen <a href=\"https://www.novalnet.de/3d-secure-infos\" title=\"mit 3D-Secure\" rel=\"nofollow ugc\">mit 3D-Secure</a></li>\n<li><a href=\"https://www.novalnet.de/pci-dss-zertifizierung\" title=\"PCI-DSS-konform\" rel=\"nofollow ugc\">PCI-DSS-konform</a>, keine aufwändige und teure Zertifizierung notwendig</li>\n</ul>\n<h4>MIT DEM ADDON KÖNNEN SIE VIELES DIREKT ÜBER DIE MEMBERPRESS-EINSTELLUNGEN VERWALTEN</h4>\n<ul>\n<li>Einfache Konfigurationsmöglichkeit für alle Zahlungsarten</li>\n<li>Einfaches Durchführen von Rückerstattungen aus der Shop-Administration heraus</li>\n<li>Flexible <a href=\"https://www.novalnet.de/abonnementverwaltung\" title=\"Abonnementverwaltung\" rel=\"nofollow ugc\">Abonnementverwaltung</a> für wiederkehrende Zahlungen</li>\n<li>Sehr einfaches Konfigurieren des Risikomanagements</li>\n<li>Einstellen komfortabler Statusmeldungen, z.B. für Zahlungseingänge bei Kauf auf Rechnung und Vorkasse</li>\n<li>Bequeme E-Mail-Benachrichtigungsfunktion über Statusmeldungen der Zahlungen</li>\n<li>Übersichtliches Status-Management für Chargebacks sowie SEPA-Rücklastschriften</li>\n<li>Vorhalten von Bestelldaten bei Kaufabbrüchen</li>\n</ul>\n<h4>LASSEN SIE IHRE KUNDEN ZAHLEN, WIE SIE MÖCHTEN</h4>\n<ul>\n<li><a href=\"https://www.novalnet.de/zahlungsart-kreditkarte\" title=\"Kreditkarte\" rel=\"nofollow ugc\">Kreditkarte</a>: Visa, Mastercard, American Express, JCB, UnionPay, Diners Club, Discover</li>\n<li>Debitkarte: Maestro, Carte Bleue, CartaSi, Postepay, PostFinance Card, PostFinance E-Finance , dankort</li>\n<li>Online-Überweisung: Sofortüberweisung, Onlineüberweisung eps, iDEAL, giropay, Przelewy24 etc.</li>\n<li>Wallet: Alipay, WeChat Pay, Apple Pay, PayPal.</li>\n<li>Vorkasse, Rechnung, Kauf auf Rechnung mit Zahlungsgarantie</li>\n<li><a href=\"https://www.novalnet.de/sepa-lastschrift\" title=\"SEPA-Lastschrift\" rel=\"nofollow ugc\">SEPA-Lastschrift</a>, Direct Debit UK (BACS)</li>\n<li>Barzahlen/viacash, Barzahlung bei Abholung</li>\n<li>Ratenzahlung</li>\n<li>Kauf auf  Rechnung und <a href=\"https://www.novalnet.de/lastschrift-mit-zahlungsgarantie\" title=\"SEPA-Lastschrift sind auch mit Zahlungsgarantie\" rel=\"nofollow ugc\">SEPA-Lastschrift sind auch mit Zahlungsgarantie</a> möglich.</li>\n</ul>\n<h4>GEHEN SIE AUF NUMMER SICHER</h4>\n<p>Die intelligente Novalnet-Betrugsprävention ist abhängig von Zahlungsart, Produktpalette und Warenkorbgröße. Durch zahlreiche, unabhängig zuschaltbare Fraudmodule verringert sich Ihre Zahlungsausfallquote spürbar.</p>\n<h4>SIE HABEN FRAGEN?</h4>\n<p>Kontaktieren Sie uns per E-Mail an <a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> oder telefonisch unter +49 89 9230683-20.</p>\n<p>Weitere Informationen über Novalnet und zur Kompatibilität des Novalnet-Payment-Addons finden Sie weiter unten.</p>\n<h4>(English)</h4>\n<h4>ACCEPT, MANAGE &amp; COLLECT PAYMENTS &#8211; MEMBERPRESS</h4>\n<p>The MemberPress Payment Addon from Novalnet allows you to accept, manage and collect payments. It is designed to optimize your payment processing, enrich customer experiences and improve conversion rates.<br />\nHundreds of e-commerce businesses across the world use this addon to:</p>\n<ul>\n<li>Accept 100+ international &amp; local payment methods</li>\n<li>Add new payment methods any time</li>\n<li>Manage payments, subscriptions &amp; members </li>\n<li>Secure transactions with proven risk management</li>\n<li>Avoid own <a href=\"https://www.novalnet.com/why-novalnet/pci-dss-certification/\" title=\"PCI DSS certification\" rel=\"nofollow ugc\">PCI DSS certification</a> </li>\n<li>Automate customer communication related to payments</li>\n<li>Provide payment support for end customers</li>\n<li>Follow transactions in real time</li>\n<li>Automate reporting for bookkeeping &amp; other departments etc.</li>\n</ul>\n<h4>WIDE PAYMENT PORTFOLIO FOR YOUR ONLINE SHOP</h4>\n<p>The MemberPress Novalnet Payment Addon enables access to <a href=\"https://www.novalnet.com/payment/\" title=\"international and local payment methods\" rel=\"nofollow ugc\">international and local payment methods</a> that can be easily integrated to your checkout process already today. Your payment portfolio remains up to date and follows both global and local payment trends across the world.</p>\n<p>Novalnet’s MemberPress Payment Addon supports:</p>\n<ul>\n<li>\n<p><a href=\"https://www.novalnet.com/payment-processing/credit-card/\" title=\"Credit cards\" rel=\"nofollow ugc\">Credit cards</a> (3DSecure also available): Visa, Mastercard, American Express, JCB, UnionPay, Diners Club,  Discover etc.</p>\n</li>\n<li>\n<p>Debit cards: Maestro, Visa, Carte Bleue, CartaSi, Postepay, PostFinance, dankort etc.</p>\n</li>\n<li>\n<p>Online bank transfers: Sofort, Online bank transfer, eps, iDEAL, giropay, Przelewy24, PostFinance Card, PostFinance E-Finance, Bancontact etc.</p>\n</li>\n<li>\n<p>E-wallets:  <a href=\"https://www.novalnet.com/cooperation/paypal/\" title=\"PayPal\" rel=\"nofollow ugc\">PayPal</a> &amp; Apple Pay</p>\n</li>\n<li>\n<p>Prepayment, Invoice, <a href=\"https://www.novalnet.com/solutions/payment-processing/sepa-direct-debit/\" title=\"Direct Debit SEPA\" rel=\"nofollow ugc\">Direct Debit SEPA</a>, <a href=\"https://www.novalnet.com/barzahlen/\" title=\"Barzahlen\" rel=\"nofollow ugc\">Barzahlen/viacash</a> &amp; Multibanco.</p>\n</li>\n<li>\n<p>Direct Debit SEPA with payment guarantee, Invoice with payment guarantee, Instalment by Invoice &amp; Instalment by Direct Debit SEPA</p>\n</li>\n</ul>\n<p>More information about each payment method can be found on our <a href=\"https://www.novalnet.de/zahlungsabwicklung\" title=\"website\" rel=\"nofollow ugc\">website</a>. If you have any additional inquiries, please do not hesitate to contact us at <a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> or +49 89 9230683-20.</p>\n<h4>ADVANCED PAYMENT EXPERIENCES FOR YOUR CUSTOMERS</h4>\n<p>Novalnet Payment Gateway for MemberPress ensures that your MemberPress offers seamless payment experiences. It provides optimized customer communications and auto-fill of payment details for future purchases. Set up email notifications and reminders for payment status updates and offer valuable customer support through Novalnet platform.</p>\n<h4>DIGITALIZATION &amp; REAL-TIME MONITORING</h4>\n<p>Novalnet’s MemberPress Payment Addon integrates your shop with one payment platform that covers all payment methods and services at once. Save costs, manual effort and time with the following MemberPress Payment Addon features.</p>\n<h4>KEY FEATURES</h4>\n<ul>\n<li>Easy configuration of all international &amp; local payment methods</li>\n<li>One PCI DSS certified payment platform for all payment services from checkout to collection</li>\n<li>Complete automation of all payment processes</li>\n<li>60+ risk &amp; payment fraud detection modules to prevent defaults in real time</li>\n<li>Effortless configuration of risk management with fraud prevention</li>\n<li>Affiliate solution supporting frictionless onboarding, split payments &amp; currency conversion</li>\n<li>Dynamic subscription and member management for recurring payments</li>\n<li>No PCI DSS certification required when using our payment module</li>\n<li>Clear overview of payment status from checkout to receivables</li>\n<li>Multilevel claims management with integrated handover to collection and various export functions for the accounting</li>\n<li>Automated e-mail notifications for staying up to date on the payment status</li>\n<li>Clear real-time overview and monitoring of payment status</li>\n<li>Automated bookkeeping report in XML, SOAP, CSV, MT940</li>\n<li>Simple seamless integration of the payment addon</li>\n<li>Secure SSL- encoded gateways</li>\n<li>On-hold transaction configuration in the shop admin panel</li>\n<li>Refund option for Credit/Debit Cards, Direct Debit SEPA, Direct Debit SEPA with payment guarantee, Invoice, Invoice with payment guarantee, Prepayment, Barzahlen/viacash, Sofort, iDEAL, eps, giropay, PayPal, Przelewy24, PostFinance Card, PostFinance E-Finance, Bancontact, Apple Pay, Online bank transfer, Trustly, Alipay &amp; WeChat Pay.</li>\n<li>Automatic order creation when subscriptions are renewed</li>\n<li>Subscription management (suspend, reactivate, cancel)</li>\n<li>Responsive templates</li>\n</ul>\n<h4>PCI COMPLIANT RISK MANAGEMENT &amp; FRAUD PREVENTION</h4>\n<p>Novalnet provides all its merchants secure payment processing in a PCI DSS Level 1 compliant manner. More than <a href=\"https://www.novalnet.com/risk-management/\" title=\"60 fraud prevention modules\" rel=\"nofollow ugc\">60 fraud prevention modules</a> are integrated to ensure machine learning fraud prevention and optimal risk minimization in real-time.</p>\n<h4>AVOID MULTIPLE CONTRACTS &amp; HIDDEN COSTS</h4>\n<p>This free MemberPress Payment Addon integrates your e-commerce business with Novalnet’s all-in-one payment platform to grow revenue. The integration and services are customizable based on individual customer needs. Novalnet’s prizing depends on your business model and chosen payment methods.</p>\n<p>Please contact us for more information:<a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> or +49 89 9230683-20.</p>\n<h4>ABOUT NOVALNET AG</h4>\n<p><a href=\"https://www.novalnet.de/\" title=\"Novalnet\" rel=\"nofollow ugc\">Novalnet</a> is a financial service institution offering payment solutions world-wide. We support customers all the way from setting up payment types and intelligent fraud prevention modules, to legitimate and reliable receivables and claims management. Operating in the market as a full payment service provider since 2007, we enable maximal reliability and client focus to all customers in every area of payment processing. Novalnet AG is a licensed payment institute which is regulated by the Federal Financial Supervisory Authority (BaFin).</p>\n<h4>ADDON COMPATIBILITY</h4>\n<p>To process Novalnet payments through this MemberPress Payment Addon, a <a href=\"https://www.novalnet.de/kontakt\" title=\"Novalnet account\" rel=\"nofollow ugc\">Novalnet account</a> is needed.</p>\n<ul>\n<li>Compatible with WordPress/MemberPress addons</li>\n<li>Works with WordPress Multi-Site</li>\n</ul>\n<h3>Arbitrary section</h3>\n<h4>Connect to MemberPress:</h4>\n<ol>\n<li>\n<p>Switch back to the WordPress admin area.</p>\n</li>\n<li>\n<p>Click on &#8220;MemberPress&#8221; in the menu on the left and click directly on the sublevel tab &#8220;Settings&#8221; tab there.</p>\n</li>\n<li>\n<p>Inside the &#8220;Novalnet Global Configuration&#8221; section you will have the Novalnet merchant global configuration. It will follow the below mentioned structure</p>\n<ul>\n<li>\n<p><strong>Product activation key</strong> Kindly enter the exact key from Novalnet admin area</p>\n</li>\n<li>\n<p><strong>Payment access key</strong> Kindly enter the exact key from Novalnet admin area</p>\n</li>\n<li>\n<p><strong>Select Tariff ID</strong> Kindly select the tariff from the list</p>\n</li>\n<li>\n<p><strong>Subscription Tariff ID</strong> Kindly select the subscription tariff from the list</p>\n</li>\n<li>\n<p><strong>Notification / Webhook URL</strong> Notification / Webhook URL settings</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Click on the specific membership and nagivate to custom section and choose &#8220;Novalnet&#8221;.</p>\n</li>\n</ol>\n<p>Now, just the following steps have to be executed for going live:</p>\n<h4>TRANSLATIONS</h4>\n<ul>\n<li>English</li>\n<li>German</li>\n</ul>\n<h4>GO-LIVE:</h4>\n<p>Now execute the following steps to go live and start your sales:</p>\n<ul>\n<li>Install the MemberPress Payment Addon by Novalnet directly from the WordPress repository </li>\n<li>Find the detailed information in the Installation Guide (incl. in the package) </li>\n<li>Configure Product Activation Key in the shop admin panel</li>\n<li>Activate &amp; configure the preferred payment types in Novalnet merchant admin panel </li>\n<li>You are ready to go!</li>\n</ul>\n<p>Please contact <a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> / 0049-89-923 068 320 for any technical issues or questions.</p>\n<h4>DISTRIBUTION</h4>\n<p>This addon enables the integration between MemberPress and Novalnet payments. The addon is free and released under the GNU General Public License. If you have found this script useful, please let also others know about it! Recommendations as well as comments in the merchant forum will be appreciated!</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/novalnet-payment-addon-memberpress.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/novalnet-payment-addon-memberpress/assets/screenshot-1.png?rev=2756349",
            "caption": "Novalnet logo"
        },
        {
            "src": "https://ps.w.org/novalnet-payment-addon-memberpress/assets/screenshot-2.png?rev=2756349",
            "caption": "Novalnet merchant global configuration"
        },
        {
            "src": "https://ps.w.org/novalnet-payment-addon-memberpress/assets/screenshot-3.png?rev=2756349",
            "caption": "Novalnet payments are displayed in the checkout"
        }
    ],
    "tags": {
        "credit-cards": "Credit Cards",
        "novalnet-payment": "Novalnet payment",
        "payment-gateway": "payment gateway",
        "payments": "payments"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/novalnet-payment-addon-memberpress.1.0.0.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.novalnet.de",
    "banners": {
        "low": "https://ps.w.org/novalnet-payment-addon-memberpress/assets/banner-772x250.jpg?rev=2756349",
        "high": "https://ps.w.org/novalnet-payment-addon-memberpress/assets/banner-1544x500.jpg?rev=2756349"
    },
    "icons": {
        "1x": "https://ps.w.org/novalnet-payment-addon-memberpress/assets/icon-128x128.png?rev=2756349",
        "2x": "https://ps.w.org/novalnet-payment-addon-memberpress/assets/icon-256x256.png?rev=2756349"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}