{
    "name": "Office 365 User Authentication for WordPress",
    "slug": "o365-user-authentication",
    "version": "2.6",
    "author": "<a href=\"http://www.wpintegrate.com/\">wpintegrate.com</a>",
    "author_profile": "https://profiles.wordpress.org/wpintegrate/",
    "contributors": {
        "wpintegrate": {
            "profile": "https://profiles.wordpress.org/wpintegrate/",
            "avatar": "https://secure.gravatar.com/avatar/740bb62e678cb084836664193e1d50ec?s=96&d=monsterid&r=g",
            "display_name": "Wordpress Integration Services"
        }
    },
    "requires": "3.5.2",
    "tested": "6.3.5",
    "requires_php": "5.6.36",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 7,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 7,
    "support_url": "https://wordpress.org/support/plugin/o365-user-authentication/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 30,
    "downloaded": 6525,
    "last_updated": "2023-11-03 07:42:00",
    "added": "2018-10-26",
    "homepage": "http://www.wpintegrate.com/",
    "sections": {
        "description": "<p>“If you want to keep your login information safe and secure, while  easily accessible by the authorised personnel then this is the plugin for you!. Office 365 AAD User Authentication plugin is used to Authenticate an Azure Active Directory(AAD) user/Office 365 user against a WordPress website, which results in the user being logged into the WordPress website.</p>\n<h3>Office 365 User Authentication for WP plugin provide these features:</h3>\n<ul>\n<li>Azure AD user is able to log into a WordPress website as subscriber WordPress user role. </li>\n<li>Login via Azure Active Directory</li>\n<li>Automatic user registration after login if the user is not already registered with your site. </li>\n<li>Use Basic Attribute Mapping feature to map WordPress user profile attributes like First Name, Last Name to the attributes provided by your IDP. </li>\n<li>Used Basic WordPress role mapping to the subscriber role. </li>\n<li>Force authentication with your IDP on each login attempt. </li>\n<li>SAML Single Logout – Support for SAML Single Logout (Works only if your IDP supports SLO). </li>\n<li>Auto-redirect to IDP – Auto-redirect to your IDP for authentication without showing them your WordPress site’s login page. This is enabled via the use of our free <a href=\"https://wordpress.org/plugins/o365-wp-restrict/\" rel=\"ugc\">Intranet and Extranet with O365 Login</a> plugin. </li>\n<li>Protect Site – Protect your complete site. Have users authenticate themselves before they could access your site content. This is enabled via the use of our free <a href=\"https://wordpress.org/plugins/o365-wp-restrict/\" rel=\"ugc\">Intranet and Extranet with O365 Login</a> plugin.  </li>\n<li>Short Code – Use Short Code (PHP or HTML) to place the login link wherever you want on the site. </li>\n<li>Step-by-step Guides – Use step-by-step guide to configure your Identity Provider like ADFS. </li>\n<li>WordPress Multi-site Support. </li>\n</ul>\n<h3> <a href=\"https://wpintegrate.com/product/azure-ad-user-authentication-wordpress/\" rel=\"nofollow ugc\">PREMIUM</a> FEATURES: </h3>\n<p> The <a href=\"https://wpintegrate.com/product/azure-ad-user-authentication-wordpress/\" rel=\"nofollow ugc\"> premium </a> version of the plugin offers all of the above, plus: </p>\n<ul>\n<li>Create and update unlimited Azure Ad/Office 365 users. </li>\n<li>Support for (granting customers, partners etc. access to your (extranet) website. </li>\n<li>The ability to quickly rollout thousands of new users to WordPress from Azure Active Directory. This is enabled via our <a href=\"https://wpintegrate.com/product/azure-ad-and-office-365-user-synchronization-and-registration-for-wordpress/\" rel=\"nofollow ugc\">Azure Ad/Office 365 user registration and synchronization</a> solution.  </li>\n<li>Support for Muliti-tenant authentication.  </li>\n<li>Support for Azure AD Guest and Member user types authentication into WordPress. Ideal for the implementation of <a href=\"https://wpintegrate.com/product/sharepoint-search-with-list-and-document-display-for-wordpress/\" rel=\"nofollow ugc\">SharePoint</a> and <a href=\"https://wpintegrate.com/product/dynamics-crm-display-for-wordpress/\" rel=\"nofollow ugc\">Dynamics CRM 365</a> portals in WordPress.  </li>\n<li>Log out users from Office 365 when they log out from your WordPress website. </li>\n<li>Enhanced security features e.g. Brute Force Attacks prevention</li>\n<li>Support the mapping of Azure Ad/Office 365 data to user fields created by Buddypress Xprofile,  Toolset Type, Advanced Custom Field (ACF) via an intuitive user interface. </li>\n<li>Enhances a user’s WordPress profile with information from Azure Ad and Microsoft Graph e.g. office location, job title, mobile and business phone numbers </li>\n<li>Replaces default WordPress avatar for a user with the Azure Ad or Office 365 (O365) profile picture and placed it into the media library. </li>\n<li>Access Control based on users being a members of either an Office 365 or an Azure AD Security group </li>\n<li>Automated WordPress Role Assignment based on a configurable mapping between Office 365 or Azure AD Security groups and WordPress roles </li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/sjWOKeVJ1kM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/JF-2tthUx08?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>PREREQUISITES </h3>\n<ul>\n<li>WordPress with Admin Access </li>\n<li>The wpintegrate.com <a href=\"https://wpintegrate.com/custom/o365.zip\" rel=\"nofollow ugc\">office 365 base plugin</a> to enable a connection with your tenant azure ad environment  </li>\n<li>Office 365 Account with Global Administrator role </li>\n<li>Apache web server on Linux or Unix based hosting </li>\n<li>(Optional) To support further restriction of your WordPress website for intranet or extranet scenarios, consider using the free <a href=\"https://wordpress.org/plugins/o365-wp-restrict/\" rel=\"ugc\">Intranet and Extranet with O365 Login</a>  </li>\n</ul>\n<h3>SUPPORT </h3>\n<p>We would be happy to assist if you have questions or if the plugin doesn&#8217;t work for you as expected. Go to <a href=\"https://wpintegrate.com/contact-us/\" rel=\"nofollow ugc\">Support Webform</a>.</p>\n<h3>Our Suite of Office 365 Plugins</h3>\n<ul>\n<li><a href=\"https://wpintegrate.com/product/office-365-video-display-for-wordpress/\" rel=\"nofollow ugc\">Office 365 Video Display for WordPress</a><br />\nThe “Office 365 Video Display for WordPress” plugin is used to showcase videos from the SharePoint online’s video hub portal “https://[your-tenant].sharepoint.com/portals/hub/” in your WordPress website.  Support list or single display of videos in WordPress, based on channel ids and video ids. </li>\n<li><a href=\"https://wpintegrate.com/product/sharepoint-calendar-display-for-wordpress/\" rel=\"nofollow ugc\">Sharepoint Calendar Display for WordPress</a><br />\nThe “SharePoint Calendar Display for WordPress” plugin is used to show calendar events from the SharePoint calendar list type from SharePoint online in WordPress. The display types are calendar view via the full calendar javascript plugin, grid view and carousel view. We have created a shortcode with several configuration options to achieve this functionality.</li>\n<li><a href=\"https://wpintegrate.com/product/onedrive-for-business-display-for-wordpress/\" rel=\"nofollow ugc\">Onedrive for Business Display for WordPress</a><br />\nThe “OneDrive for Business Display for WordPress” plugin is used to show OneDrive for business files and folders online in WordPress. The display types are grid view and list view.<br />\nWe have created a shortcode with several configuration options to achieve this functionality.</li>\n<li><a href=\"https://wpintegrate.com/product/outlook-calendar-display-for-wordpress/\" rel=\"nofollow ugc\">Outlook Calendar Display for WordPress</a><br />\nThe “Outlook Calendar Display for WordPress” plugin is used to show calendar events from the Outlook calendar from Office 365 in WordPress. The display types are calendar view via the full calendar JavaScript plugin, grid view and carousel view.</li>\n<li><a href=\"https://wpintegrate.com/product/azure-ad-b2c-user-authentication-for-wordpress/\" rel=\"nofollow ugc\">Azure AD B2C User Authentication for WordPress</a><br />\nOffice 365 AAD B2C User Authentication plugin is used to Authenticate an Azure Active Directory(AAD) B2C user against a WordPress website, which results in the user being logged into the WordPress website.</li>\n<li><a href=\"https://wpintegrate.com/product/dynamics-crm-display-for-wordpress/\" rel=\"nofollow ugc\">Dynamic CRM 365 Display for WordPress</a><br />\nThe “Dynamic CRM 365 Display for WordPress” plugin is used to show Dynamics CRM 365 entities from Office 365 in WordPress. Define a custom template or use several that we provided to customize the look and feel of your displays.</li>\n<li><a href=\"https://wpintegrate.com/product/azure-ad-user-authentication-wordpress/\" rel=\"nofollow ugc\">Azure AD and Office 365 User Authentication for WordPress</a><br />\nOffice 365 AAD User Authentication plugin is used to verify users seamlessly and securely. This means no more having to remember usernames or passwords,making the process of logging in simple, easy and quick.</li>\n<li><a href=\"https://wpintegrate.com/product/sharepoint-search-with-list-and-document-display-for-wordpress/\" rel=\"nofollow ugc\">SharePoint Search with List and Document Display for WordPress</a><br />\nThe “SharePoint Search Display for WordPress” plugin is used to show SharePoint search results from SharePoint online in WordPress. The display types are grid view, faceted search view, and list view.</li>\n<li><a href=\"https://wpintegrate.com/product/powerapps-for-wordpress/\" rel=\"nofollow ugc\">Powerapps for WordPress</a><br />\nPowerapps for WordPress is a plugin that allows you to easily add your own custom bulk actions to your admin panel on the posts, custom post types, woocommerce, events(the event calendar plugin), BuddyPress, pages, media and users overviews. Which, on activation will pass the data of the selected records as parameters to the powerapps application for processing.</li>\n<li><a href=\"https://wpintegrate.com/product/powerbi-for-wordpress/\" rel=\"nofollow ugc\">PowerBi for WordPress</a><br />\nWe provide solutions and technical expertise to allow your WordPress data and website to work with PowerBi. Power BI is a suite of cloud-based business analytics tools to analyze data and share insights. Monitor your business and get answers quickly with rich dashboards available on every device.</li>\n<li><a href=\"https://wpintegrate.com/product/azure-ad-and-office-365-user-synchronization-and-registration-for-wordpress/\" rel=\"nofollow ugc\">Azure AD and Office 365 User Synchronization and Registration for WordPress</a><br />\nSynchronize users from Office 365 to WordPress (BuddyPress, Woocommerce, Memberpress) incl. Azure AD custom fields, avatar, Group Membership and user invitation.</li>\n<li><a href=\"https://wpintegrate.com/product/azure-adb2c-and-office-365-user-synchronization-and-registration-for-wordpress/\" rel=\"nofollow ugc\">Azure ADB2C and Office 365 User Synchronization and Registration for WordPress</a><br />\nSynchronize users from Azure ADB2C to WordPress (BuddyPress, Woocommerce, Memberpress) incl. Azure ADB2C custom fields, avatar, Group Membership and user invitation.</li>\n<li><a href=\"https://wpintegrate.com/product/microsoft-bookings-for-wordpress/\" rel=\"nofollow ugc\">Microsoft Bookings for WordPress</a><br />\nThe Microsoft Bookings for WordPress plugin is used to provide a customizable and streamlined booking experience for customers with the Microsoft Booking service acting as the backend and data source. We added support for payments.<br />\nMicrosoft Bookings is an online and mobile app for small businesses who provide services to customers on an appointment basis. Examples of businesses include hair salons, dental offices, spas, law firms, financial services providers, consultants, and auto shops.</li>\n<li><a href=\"https://wpintegrate.com/product/bookly-cred-rest-api-operations/\" rel=\"nofollow ugc\">Bookly Rest API CRED Operations</a><br />\nWe created the “Bookly CRED Rest API Operations” addon to allow users to create, update and delete appointments, staff, services and customers data created with the Bookly plugin from anywhere. In it’s most basic form, a rest api separates the content from its presentation, freeing developers and users to use their data as they would like. The rest api is provided in a simple to use and understand json format.</li>\n<li><a href=\"https://wpintegrate.com/product/microsoft-office-365-office-add-ins/\" rel=\"nofollow ugc\">Microsoft 365 Office Add-ins</a><br />\nOffice 365 Office Add-ins with Powerapps is a plugin that allows you to easily host or create an office 365 add-ins xml manifest, that implements a specific powerapps that is displayed in the context of an office 365 service – example outlook mail application. The XML manifest file of an Office Add-in describes how your add-in should be activated when an end user installs and uses it with Office documents and applications.</li>\n<li><a href=\"https://wpintegrate.com/product/microsoft-teams-wordpress/\" rel=\"nofollow ugc\">Microsoft Teams for WordPress</a><br />\nMicrosoft Teams enables you to get all your content, tools and conversations in the Team workspace within Office 365.<br />\nMicrosoft Teams for WordPress is used to create WordPress pages as Microsoft Teams Tabs and Apps as well as sending WordPress data(events, orders etc) to a Teams channel formatted as a specific adaptive card. This is achieved by using one or more of our plugins for (custom post type, woo-commerce, user and forms(gravity form, contact 7 and ninja forms)) to interface with the Microsoft Teams Rest APIs.</li>\n<li><a href=\"https://wpintegrate.com/product/office-365-microsoft-search-display-for-wordpress/\" rel=\"nofollow ugc\">Office 365 Microsoft Search Display for WordPress</a><br />\nThe “Office 365 Microsoft Search Display for WordPress” plugin is used to show indexed results from the supported connectors(SharePoint, outlook, etc) from Office 365 in WordPress. The display type currently available is a list view. </li>\n<li><a href=\"https://wpintegrate.com/product/office-365-persons-display-for-wordpress/\" rel=\"nofollow ugc\">Office 365 Persons Display for WordPress</a><br />\nThe “Office 365 Persons Display for WordPress” plugin is used to show Office 365/Azure AD users and Outlook contacts in WordPress. The display types are list/accordion and grid view.<br />\nWe have created a shortcode with several configuration options to achieve this functionality.</li>\n<li><a href=\"https://wpintegrate.com/product/office-365-yammer-display-for-wordpress/\" rel=\"nofollow ugc\">Office 365 Yammer Display for WordPress</a><br />\nThe “Office 365 Yammer Display for WordPress” plugin is used to show Office 365 Yammer groups and topics in WordPress. The display types are single and grid view.</li>\n<li><a href=\"https://wpintegrate.com/product/outlook-calendar-room-and-resource-booking-for-wordpress/\" rel=\"nofollow ugc\">Outlook Calendar Room and Resource Booking for WordPress</a><br />\nThe “Outlook Calendar Room and Resource Booking for WordPress” plugin is used to reserve rooms or resources within an organization.<br />\nIf you have a conference room, company car, or equipment that everyone needs to use, then you need to come up with a way to make those resources reservable to everyone. The best way to do that is to create a room or equipment mailbox in Microsoft 365 for each resource. You might create one for your first floor conference room, media equipment, or a moving truck.</li>\n<li><a href=\"https://wpintegrate.com/product/sharepoint-calendar-room-and-resource-booking-for-wordpress/\" rel=\"nofollow ugc\">Sharepoint Calendar Room and Resource Booking for WordPress</a><br />\nThe “Sharepoint Calendar Room and Resource Booking for WordPress” plugin is used to reserve rooms or resources within an organization.<br />\nIf you have a conference room, company car, or equipment that everyone needs to use, then you need to come up with a way to make those resources reservable to everyone. The best way to do that is to create a room or equipment mailbox in Microsoft 365 for each resource. You might create one for your first floor conference room, media equipment, or a moving truck.</li>\n</ul>\n<h3> Our Suite of Rest APIs, Web hook and Trigger based Plugins </h3>\n<ul>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-events/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Events</a> <br />\nThe Webhooks and REST API Manager – Events is a WordPress plugin used to add support for “the events calendar” and “the events calendar pro“ plugin, in varying integration scenarios.</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-media/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Media </a> <br />\nThe Webhooks and REST API Manager – Media is a WordPress plugin used to add support for media type in varying integration scenarios</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-posts/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Posts </a> <br />\nThe Webhooks and REST API Manager – Posts and Page is a WordPress plugin used to add support for post types in varying integration scenarios.<br />\nThe custom field plugins that are supported for posts, pages, or custom post types are:<br />\nAdvanced Custom Fields Pro, Advanced Custom Fields (Free), WordPress’s own, default custom fields, Toolset Types</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-users/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Users</a> <br />\nThe Webhooks and REST API Manager – Users is a WordPress plugin used to add support for the WordPress user meta values, user roles, buddypress xprofile meta, Advanced Custom Fields Pro, Advanced Custom Fields (Free), WordPress’s own, default custom fields and Toolset Types.</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-woocommerce/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Woocommerce </a> <br />\nThe Webhooks and REST API Manager – Woocommerce is a WordPress plugin used to add support for woocommerce in varying integration scenarios</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-bulk-actions/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Bulk Actions</a><br />\nWebhooks and REST API Manager – Bulk Actions is a WordPress plugin that allows you to easily add your own custom bulk actions to your admin panel on the posts, custom post types, woocommerce, events(the event calendar plugin), BuddyPress, pages, media and users overviews. Which, on activation will 1) immediately send an Http Call via webhooks to an external service with JSON data specific to the records selected for bulk action or 2) Add interactivity to your submission before it is sent to the external service, this interaction can be in the form of a text field, textarea, file or image data. Each configured interaction can be saved for future usage. Such external services include Zapier.com, Ifttt.com, Integromat.com and Microsoft flow.</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-forms/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Forms</a><br />\nThe Webhooks and REST API Manager – Forms is a WordPress plugin used to add support for gravity forms, contact 7 form, formcraft pro and ninja forms with added support for the uploading of single or multiple files in varying integration scenarios.</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-buddypress/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – BuddyPress </a> <br />\nThe Webhooks and REST API Manager – BuddyPress  is a WordPress plugin used to add support for “Buddypress/BbPress” plugins, in varying integration scenarios.</p>\n</li>\n</ul>\n",
        "installation": "<p>Installation Process</p>\n<ol>\n<li>Upload the plugin files to the <strong>/wp-content/plugins</strong> directory, or install the plugin through the WordPress plugins screen<br />\ndirectly.</li>\n<li>Before activate the plugin you need install the office365 base plugin.<br />\n<a href=\"https://wpintegrate.com/custom/o365.zip\" rel=\"nofollow ugc\">Click here</a> to download the base plugin.</li>\n<li>Activate the base plugin through the <strong>Plugins</strong> screen in WordPress.</li>\n<li>After activate base plugin from your WordPress admin menu go to <strong>Office 365</strong> &gt;&gt; <strong>Settings</strong> then under the <strong>General</strong> tab.<br />\nFill in the Application ID, Application Key and Tenant Name with the app registration details taken from the section <strong>Register<br />\nan application in Azure Active directory for WordPress</strong> above.</li>\n<li>Click on the <strong>Save Setting and get authentication</strong> button, to have the plugin verified. If successful a green text with<br />\n<strong>This plugin has been verified</strong>, will become visible.</li>\n<li>Now activate this authentication plugin through the <strong>Plugins</strong> screen in WordPress.</li>\n<li>After activate this plugin from your WordPress admin menu go to <strong>Office 365</strong> &gt;&gt; <strong>Settings</strong> then under the <strong>user</strong> tab<br />\nfill details as your needs.</li>\n</ol>\n",
        "faq": "\n<dt id='how%20to%20create%20azure%20application'>\nHow to Create Azure Application\n</h4>\n<p>Register an application in Azure Active directory for WordPress</p>\nWhat is an Azure Active directory application registration? \n<p>A Microsoft Azure active directory application registration provides the permissions needed to access office365 and Azure<br />\nservice resources using its REST APIs.</p>\n<ol>\n<li>Sign in to the Azure portal at https://aad.portal.azure.com/ – Please login in with your Office 365 administrator account,<br />\nthis user should have the role of <strong>Global administrator</strong> in office 365. This can be verified at<br />\nhttps://portal.office.com/adminportal/home#/users</li>\n<li>While logged into the Azure portal go to the menu item on the left for &#8220;Azure Active directory&#8221;. On the same left, you will<br />\nsee a sub menu specific for azure active directory, click on the menu option for &#8220;App Registration&#8221; or via [this link]<br />\n(https://aad.portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/RegisteredApps)</li>\n<li>In the upper left of the blade/panel to the right, click on the option for &#8220;New Application registration&#8221;.</li>\n<li>In the &#8220;Create&#8221; blade/panel – Add a &#8220;Name&#8221;, keep the &#8220;Application Type&#8221; as &#8220;Web app/API&#8221; and make the &#8220;Sign-on Url&#8221; &#8220;YOUR<br />\nDOMAIN NAME /wp-admin/admin.php?page=o365_settings&#8221;</li>\n<li>After saving/creating the app, you can search by name for the said app, so it can be modified further.</li>\n<li>Under Settings &gt;&gt; Reply URLs – You should have two URLs: &#8220;YOUR DOMAIN NAME/wp-admin&#8221; and &#8220;YOUR DOMAIN NAME/wp-<br />\nadmin/admin.php?page=o365_settings&#8221;</li>\n<li>Under Settings &gt;&gt; Required Permissions – To initially verify the base plugin – Enable Access for the default API<br />\n&#8220;Microsoft.Azure.ActiveDirectory&#8221; so that it has, ALL &#8220;Application Permissions&#8221; and &#8220;Delegated Permissions&#8221; enabled and saved.</li>\n<li>Under Settings &gt;&gt; Keys – create an application key by providing details for “Description” and choosing an appropriate<br />\n&#8220;Expires&#8221; time frame, then Save and Copy the key value. You won’t be able to retrieve it after you leave the blade.</li>\n<li>To get the Tenant Name needed to complete the plugin setup go to – Azure Active Directory &gt;&gt; Domain names or directly at<br />\nhttps://aad.portal.azure.com/#blade/Microsoft_AAD_IAM/ActiveDirectoryMenuBlade/Domains, the Tenant Name, is the prefix section of<br />\nthe Microsoft specific subdomains example: “myTenantName” taken from myTenantName.onmicrosoft.com or myTenantName.sharepoint.com.</li>\n</ol>\n<p> You can check steps with screenshots to create application in <a href=\"https://wpintegrate.com/kb-article/azure-active-directory-application-registration-configuration/\" rel=\"nofollow ugc\"> Azure portal from here</a> and check application <a href=\"https://wpintegrate.com/kb-article/azure-ad-and-office-365-user-authentication-for-wordpress-app-permission/\" rel=\"nofollow ugc\">permission for user auth plugin from here</a>.</p>\n</p>\n\n",
        "changelog": "<h4>1.0</h4>\n<ul>\n<li>Initial Release</li>\n</ul>\n<h4>1.1</h4>\n<p>Minor Bugs Fixes</p>\n<h4>1.2</h4>\n<p>Added option to add image as login link</p>\n<h4>1.3</h4>\n<p>Added option to style the login link</p>\n<h4>1.4</h4>\n<p>Make it compatible to PHP 7 and WordPress 5.2.4</p>\n<h4>1.5</h4>\n<p>Added option for Redirect after login</p>\n<h4>2.0</h4>\n<p>Updated azure endpoint with Graph APIs</p>\n"
    },
    "short_description": "“If you want to keep your login information safe and secure, while  easily accessible by the authorised personnel then this is the plugin for you!.",
    "description": "<p>“If you want to keep your login information safe and secure, while  easily accessible by the authorised personnel then this is the plugin for you!. Office 365 AAD User Authentication plugin is used to Authenticate an Azure Active Directory(AAD) user/Office 365 user against a WordPress website, which results in the user being logged into the WordPress website.</p>\n<h3>Office 365 User Authentication for WP plugin provide these features:</h3>\n<ul>\n<li>Azure AD user is able to log into a WordPress website as subscriber WordPress user role. </li>\n<li>Login via Azure Active Directory</li>\n<li>Automatic user registration after login if the user is not already registered with your site. </li>\n<li>Use Basic Attribute Mapping feature to map WordPress user profile attributes like First Name, Last Name to the attributes provided by your IDP. </li>\n<li>Used Basic WordPress role mapping to the subscriber role. </li>\n<li>Force authentication with your IDP on each login attempt. </li>\n<li>SAML Single Logout – Support for SAML Single Logout (Works only if your IDP supports SLO). </li>\n<li>Auto-redirect to IDP – Auto-redirect to your IDP for authentication without showing them your WordPress site’s login page. This is enabled via the use of our free <a href=\"https://wordpress.org/plugins/o365-wp-restrict/\" rel=\"ugc\">Intranet and Extranet with O365 Login</a> plugin. </li>\n<li>Protect Site – Protect your complete site. Have users authenticate themselves before they could access your site content. This is enabled via the use of our free <a href=\"https://wordpress.org/plugins/o365-wp-restrict/\" rel=\"ugc\">Intranet and Extranet with O365 Login</a> plugin.  </li>\n<li>Short Code – Use Short Code (PHP or HTML) to place the login link wherever you want on the site. </li>\n<li>Step-by-step Guides – Use step-by-step guide to configure your Identity Provider like ADFS. </li>\n<li>WordPress Multi-site Support. </li>\n</ul>\n<h3> <a href=\"https://wpintegrate.com/product/azure-ad-user-authentication-wordpress/\" rel=\"nofollow ugc\">PREMIUM</a> FEATURES: </h3>\n<p> The <a href=\"https://wpintegrate.com/product/azure-ad-user-authentication-wordpress/\" rel=\"nofollow ugc\"> premium </a> version of the plugin offers all of the above, plus: </p>\n<ul>\n<li>Create and update unlimited Azure Ad/Office 365 users. </li>\n<li>Support for (granting customers, partners etc. access to your (extranet) website. </li>\n<li>The ability to quickly rollout thousands of new users to WordPress from Azure Active Directory. This is enabled via our <a href=\"https://wpintegrate.com/product/azure-ad-and-office-365-user-synchronization-and-registration-for-wordpress/\" rel=\"nofollow ugc\">Azure Ad/Office 365 user registration and synchronization</a> solution.  </li>\n<li>Support for Muliti-tenant authentication.  </li>\n<li>Support for Azure AD Guest and Member user types authentication into WordPress. Ideal for the implementation of <a href=\"https://wpintegrate.com/product/sharepoint-search-with-list-and-document-display-for-wordpress/\" rel=\"nofollow ugc\">SharePoint</a> and <a href=\"https://wpintegrate.com/product/dynamics-crm-display-for-wordpress/\" rel=\"nofollow ugc\">Dynamics CRM 365</a> portals in WordPress.  </li>\n<li>Log out users from Office 365 when they log out from your WordPress website. </li>\n<li>Enhanced security features e.g. Brute Force Attacks prevention</li>\n<li>Support the mapping of Azure Ad/Office 365 data to user fields created by Buddypress Xprofile,  Toolset Type, Advanced Custom Field (ACF) via an intuitive user interface. </li>\n<li>Enhances a user’s WordPress profile with information from Azure Ad and Microsoft Graph e.g. office location, job title, mobile and business phone numbers </li>\n<li>Replaces default WordPress avatar for a user with the Azure Ad or Office 365 (O365) profile picture and placed it into the media library. </li>\n<li>Access Control based on users being a members of either an Office 365 or an Azure AD Security group </li>\n<li>Automated WordPress Role Assignment based on a configurable mapping between Office 365 or Azure AD Security groups and WordPress roles </li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/sjWOKeVJ1kM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/JF-2tthUx08?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>PREREQUISITES </h3>\n<ul>\n<li>WordPress with Admin Access </li>\n<li>The wpintegrate.com <a href=\"https://wpintegrate.com/custom/o365.zip\" rel=\"nofollow ugc\">office 365 base plugin</a> to enable a connection with your tenant azure ad environment  </li>\n<li>Office 365 Account with Global Administrator role </li>\n<li>Apache web server on Linux or Unix based hosting </li>\n<li>(Optional) To support further restriction of your WordPress website for intranet or extranet scenarios, consider using the free <a href=\"https://wordpress.org/plugins/o365-wp-restrict/\" rel=\"ugc\">Intranet and Extranet with O365 Login</a>  </li>\n</ul>\n<h3>SUPPORT </h3>\n<p>We would be happy to assist if you have questions or if the plugin doesn&#8217;t work for you as expected. Go to <a href=\"https://wpintegrate.com/contact-us/\" rel=\"nofollow ugc\">Support Webform</a>.</p>\n<h3>Our Suite of Office 365 Plugins</h3>\n<ul>\n<li><a href=\"https://wpintegrate.com/product/office-365-video-display-for-wordpress/\" rel=\"nofollow ugc\">Office 365 Video Display for WordPress</a><br />\nThe “Office 365 Video Display for WordPress” plugin is used to showcase videos from the SharePoint online’s video hub portal “https://[your-tenant].sharepoint.com/portals/hub/” in your WordPress website.  Support list or single display of videos in WordPress, based on channel ids and video ids. </li>\n<li><a href=\"https://wpintegrate.com/product/sharepoint-calendar-display-for-wordpress/\" rel=\"nofollow ugc\">Sharepoint Calendar Display for WordPress</a><br />\nThe “SharePoint Calendar Display for WordPress” plugin is used to show calendar events from the SharePoint calendar list type from SharePoint online in WordPress. The display types are calendar view via the full calendar javascript plugin, grid view and carousel view. We have created a shortcode with several configuration options to achieve this functionality.</li>\n<li><a href=\"https://wpintegrate.com/product/onedrive-for-business-display-for-wordpress/\" rel=\"nofollow ugc\">Onedrive for Business Display for WordPress</a><br />\nThe “OneDrive for Business Display for WordPress” plugin is used to show OneDrive for business files and folders online in WordPress. The display types are grid view and list view.<br />\nWe have created a shortcode with several configuration options to achieve this functionality.</li>\n<li><a href=\"https://wpintegrate.com/product/outlook-calendar-display-for-wordpress/\" rel=\"nofollow ugc\">Outlook Calendar Display for WordPress</a><br />\nThe “Outlook Calendar Display for WordPress” plugin is used to show calendar events from the Outlook calendar from Office 365 in WordPress. The display types are calendar view via the full calendar JavaScript plugin, grid view and carousel view.</li>\n<li><a href=\"https://wpintegrate.com/product/azure-ad-b2c-user-authentication-for-wordpress/\" rel=\"nofollow ugc\">Azure AD B2C User Authentication for WordPress</a><br />\nOffice 365 AAD B2C User Authentication plugin is used to Authenticate an Azure Active Directory(AAD) B2C user against a WordPress website, which results in the user being logged into the WordPress website.</li>\n<li><a href=\"https://wpintegrate.com/product/dynamics-crm-display-for-wordpress/\" rel=\"nofollow ugc\">Dynamic CRM 365 Display for WordPress</a><br />\nThe “Dynamic CRM 365 Display for WordPress” plugin is used to show Dynamics CRM 365 entities from Office 365 in WordPress. Define a custom template or use several that we provided to customize the look and feel of your displays.</li>\n<li><a href=\"https://wpintegrate.com/product/azure-ad-user-authentication-wordpress/\" rel=\"nofollow ugc\">Azure AD and Office 365 User Authentication for WordPress</a><br />\nOffice 365 AAD User Authentication plugin is used to verify users seamlessly and securely. This means no more having to remember usernames or passwords,making the process of logging in simple, easy and quick.</li>\n<li><a href=\"https://wpintegrate.com/product/sharepoint-search-with-list-and-document-display-for-wordpress/\" rel=\"nofollow ugc\">SharePoint Search with List and Document Display for WordPress</a><br />\nThe “SharePoint Search Display for WordPress” plugin is used to show SharePoint search results from SharePoint online in WordPress. The display types are grid view, faceted search view, and list view.</li>\n<li><a href=\"https://wpintegrate.com/product/powerapps-for-wordpress/\" rel=\"nofollow ugc\">Powerapps for WordPress</a><br />\nPowerapps for WordPress is a plugin that allows you to easily add your own custom bulk actions to your admin panel on the posts, custom post types, woocommerce, events(the event calendar plugin), BuddyPress, pages, media and users overviews. Which, on activation will pass the data of the selected records as parameters to the powerapps application for processing.</li>\n<li><a href=\"https://wpintegrate.com/product/powerbi-for-wordpress/\" rel=\"nofollow ugc\">PowerBi for WordPress</a><br />\nWe provide solutions and technical expertise to allow your WordPress data and website to work with PowerBi. Power BI is a suite of cloud-based business analytics tools to analyze data and share insights. Monitor your business and get answers quickly with rich dashboards available on every device.</li>\n<li><a href=\"https://wpintegrate.com/product/azure-ad-and-office-365-user-synchronization-and-registration-for-wordpress/\" rel=\"nofollow ugc\">Azure AD and Office 365 User Synchronization and Registration for WordPress</a><br />\nSynchronize users from Office 365 to WordPress (BuddyPress, Woocommerce, Memberpress) incl. Azure AD custom fields, avatar, Group Membership and user invitation.</li>\n<li><a href=\"https://wpintegrate.com/product/azure-adb2c-and-office-365-user-synchronization-and-registration-for-wordpress/\" rel=\"nofollow ugc\">Azure ADB2C and Office 365 User Synchronization and Registration for WordPress</a><br />\nSynchronize users from Azure ADB2C to WordPress (BuddyPress, Woocommerce, Memberpress) incl. Azure ADB2C custom fields, avatar, Group Membership and user invitation.</li>\n<li><a href=\"https://wpintegrate.com/product/microsoft-bookings-for-wordpress/\" rel=\"nofollow ugc\">Microsoft Bookings for WordPress</a><br />\nThe Microsoft Bookings for WordPress plugin is used to provide a customizable and streamlined booking experience for customers with the Microsoft Booking service acting as the backend and data source. We added support for payments.<br />\nMicrosoft Bookings is an online and mobile app for small businesses who provide services to customers on an appointment basis. Examples of businesses include hair salons, dental offices, spas, law firms, financial services providers, consultants, and auto shops.</li>\n<li><a href=\"https://wpintegrate.com/product/bookly-cred-rest-api-operations/\" rel=\"nofollow ugc\">Bookly Rest API CRED Operations</a><br />\nWe created the “Bookly CRED Rest API Operations” addon to allow users to create, update and delete appointments, staff, services and customers data created with the Bookly plugin from anywhere. In it’s most basic form, a rest api separates the content from its presentation, freeing developers and users to use their data as they would like. The rest api is provided in a simple to use and understand json format.</li>\n<li><a href=\"https://wpintegrate.com/product/microsoft-office-365-office-add-ins/\" rel=\"nofollow ugc\">Microsoft 365 Office Add-ins</a><br />\nOffice 365 Office Add-ins with Powerapps is a plugin that allows you to easily host or create an office 365 add-ins xml manifest, that implements a specific powerapps that is displayed in the context of an office 365 service – example outlook mail application. The XML manifest file of an Office Add-in describes how your add-in should be activated when an end user installs and uses it with Office documents and applications.</li>\n<li><a href=\"https://wpintegrate.com/product/microsoft-teams-wordpress/\" rel=\"nofollow ugc\">Microsoft Teams for WordPress</a><br />\nMicrosoft Teams enables you to get all your content, tools and conversations in the Team workspace within Office 365.<br />\nMicrosoft Teams for WordPress is used to create WordPress pages as Microsoft Teams Tabs and Apps as well as sending WordPress data(events, orders etc) to a Teams channel formatted as a specific adaptive card. This is achieved by using one or more of our plugins for (custom post type, woo-commerce, user and forms(gravity form, contact 7 and ninja forms)) to interface with the Microsoft Teams Rest APIs.</li>\n<li><a href=\"https://wpintegrate.com/product/office-365-microsoft-search-display-for-wordpress/\" rel=\"nofollow ugc\">Office 365 Microsoft Search Display for WordPress</a><br />\nThe “Office 365 Microsoft Search Display for WordPress” plugin is used to show indexed results from the supported connectors(SharePoint, outlook, etc) from Office 365 in WordPress. The display type currently available is a list view. </li>\n<li><a href=\"https://wpintegrate.com/product/office-365-persons-display-for-wordpress/\" rel=\"nofollow ugc\">Office 365 Persons Display for WordPress</a><br />\nThe “Office 365 Persons Display for WordPress” plugin is used to show Office 365/Azure AD users and Outlook contacts in WordPress. The display types are list/accordion and grid view.<br />\nWe have created a shortcode with several configuration options to achieve this functionality.</li>\n<li><a href=\"https://wpintegrate.com/product/office-365-yammer-display-for-wordpress/\" rel=\"nofollow ugc\">Office 365 Yammer Display for WordPress</a><br />\nThe “Office 365 Yammer Display for WordPress” plugin is used to show Office 365 Yammer groups and topics in WordPress. The display types are single and grid view.</li>\n<li><a href=\"https://wpintegrate.com/product/outlook-calendar-room-and-resource-booking-for-wordpress/\" rel=\"nofollow ugc\">Outlook Calendar Room and Resource Booking for WordPress</a><br />\nThe “Outlook Calendar Room and Resource Booking for WordPress” plugin is used to reserve rooms or resources within an organization.<br />\nIf you have a conference room, company car, or equipment that everyone needs to use, then you need to come up with a way to make those resources reservable to everyone. The best way to do that is to create a room or equipment mailbox in Microsoft 365 for each resource. You might create one for your first floor conference room, media equipment, or a moving truck.</li>\n<li><a href=\"https://wpintegrate.com/product/sharepoint-calendar-room-and-resource-booking-for-wordpress/\" rel=\"nofollow ugc\">Sharepoint Calendar Room and Resource Booking for WordPress</a><br />\nThe “Sharepoint Calendar Room and Resource Booking for WordPress” plugin is used to reserve rooms or resources within an organization.<br />\nIf you have a conference room, company car, or equipment that everyone needs to use, then you need to come up with a way to make those resources reservable to everyone. The best way to do that is to create a room or equipment mailbox in Microsoft 365 for each resource. You might create one for your first floor conference room, media equipment, or a moving truck.</li>\n</ul>\n<h3> Our Suite of Rest APIs, Web hook and Trigger based Plugins </h3>\n<ul>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-events/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Events</a> <br />\nThe Webhooks and REST API Manager – Events is a WordPress plugin used to add support for “the events calendar” and “the events calendar pro“ plugin, in varying integration scenarios.</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-media/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Media </a> <br />\nThe Webhooks and REST API Manager – Media is a WordPress plugin used to add support for media type in varying integration scenarios</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-posts/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Posts </a> <br />\nThe Webhooks and REST API Manager – Posts and Page is a WordPress plugin used to add support for post types in varying integration scenarios.<br />\nThe custom field plugins that are supported for posts, pages, or custom post types are:<br />\nAdvanced Custom Fields Pro, Advanced Custom Fields (Free), WordPress’s own, default custom fields, Toolset Types</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-users/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Users</a> <br />\nThe Webhooks and REST API Manager – Users is a WordPress plugin used to add support for the WordPress user meta values, user roles, buddypress xprofile meta, Advanced Custom Fields Pro, Advanced Custom Fields (Free), WordPress’s own, default custom fields and Toolset Types.</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-woocommerce/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Woocommerce </a> <br />\nThe Webhooks and REST API Manager – Woocommerce is a WordPress plugin used to add support for woocommerce in varying integration scenarios</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-bulk-actions/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Bulk Actions</a><br />\nWebhooks and REST API Manager – Bulk Actions is a WordPress plugin that allows you to easily add your own custom bulk actions to your admin panel on the posts, custom post types, woocommerce, events(the event calendar plugin), BuddyPress, pages, media and users overviews. Which, on activation will 1) immediately send an Http Call via webhooks to an external service with JSON data specific to the records selected for bulk action or 2) Add interactivity to your submission before it is sent to the external service, this interaction can be in the form of a text field, textarea, file or image data. Each configured interaction can be saved for future usage. Such external services include Zapier.com, Ifttt.com, Integromat.com and Microsoft flow.</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-forms/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – Forms</a><br />\nThe Webhooks and REST API Manager – Forms is a WordPress plugin used to add support for gravity forms, contact 7 form, formcraft pro and ninja forms with added support for the uploading of single or multiple files in varying integration scenarios.</p>\n</li>\n<li>\n<p><a href=\"https://wpintegrate.com/product/webhooks-and-rest-api-manager-buddypress/\" rel=\"nofollow ugc\">Webhooks and REST API Manager – BuddyPress </a> <br />\nThe Webhooks and REST API Manager – BuddyPress  is a WordPress plugin used to add support for “Buddypress/BbPress” plugins, in varying integration scenarios.</p>\n</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/o365-user-authentication.zip",
    "upgrade_notice": {
        "1.0": "<p>Upgrade notices describe the reason a user should upgrade.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/o365-user-authentication/assets/screenshot-1.png?rev=1963459",
            "caption": "/assets/screenshot-1.png"
        },
        {
            "src": "https://ps.w.org/o365-user-authentication/assets/screenshot-2.png?rev=1963459",
            "caption": "/assets/screenshot-2.png"
        },
        {
            "src": "https://ps.w.org/o365-user-authentication/assets/screenshot-3.png?rev=1963459",
            "caption": "/assets/screenshot-3.png"
        },
        {
            "src": "https://ps.w.org/o365-user-authentication/assets/screenshot-4.png?rev=2137409",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/o365-user-authentication/assets/screenshot-5.png?rev=2284072",
            "caption": ""
        }
    ],
    "tags": {
        "authentication-login": "authentication login",
        "azure-active-directory-sso": "azure active directory sso",
        "dynamics-crm": "dynamics crm",
        "office-365": "office 365",
        "sharepoint": "sharepoint"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://wpintegrate.com/",
    "banners": {
        "low": "https://ps.w.org/o365-user-authentication/assets/banner-772x250.png?rev=1963459",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/o365-user-authentication/assets/icon-128x128.png?rev=1963459",
        "2x": "https://ps.w.org/o365-user-authentication/assets/icon-256x256.png?rev=1963459"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}