{
    "name": "Optinly &#8211; Exit Intent, Newsletter Popups, Gamification &amp; Opt-in Forms",
    "slug": "optinly",
    "version": "1.0.20",
    "author": "OptinlyHQ",
    "author_profile": "https://profiles.wordpress.org/optinlyhq/",
    "contributors": {
        "optinlyhq": {
            "profile": "https://profiles.wordpress.org/optinlyhq/",
            "avatar": "https://secure.gravatar.com/avatar/3bda001a5366e452d58f3174f9de1421?s=96&d=monsterid&r=g",
            "display_name": "optinlyhq"
        }
    },
    "requires": "4.6.1",
    "tested": "6.4.5",
    "requires_php": "7.2",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 86,
    "ratings": {
        "5": 12,
        "4": 0,
        "3": 1,
        "2": 2,
        "1": 1
    },
    "num_ratings": 16,
    "support_url": "https://wordpress.org/support/plugin/optinly/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 20569,
    "last_updated": "2024-07-16 6:34am GMT",
    "added": "2020-06-23",
    "homepage": "https://www.optinly.com",
    "sections": {
        "description": "<h3>Optinly</h3>\n<p><a href=\"https://optinly.com/?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Optinly</a> is the <strong>best goal-based WordPress popup plugin</strong> that helps you capture more leads, engage audience and increase sales on the go.</p>\n<p>With Optinly’s popup builder plugin, you can <a href=\"https://app.optinly.com/?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">create responsive popup forms</a> in under a few minutes, thanks to the <strong>readymade free website popup templates</strong>.</p>\n<p>Optinly comes with different types of popup forms like <strong>email popups/subscription popups,spin the wheel popups, fullscreen overlays, countdown popups</strong> and more. This helps you achieve all your business goals with extreme ease and comfort.</p>\n<p>Also, the pre-existing growth marketing goals like <strong>build audience, promote special offers, increase cart value, reduce cart abandonment, etc</strong> helps you create popup campaigns quickly. All growth goals are backed by appropriate popup templates, making the campaign creation process super easy!</p>\n<p>This free popup tool comes with a clean UI/UX and has a lot of sophisticated features. Let’s look into Optinly and know how it can help with the list building/lead generation process, your business growth and also the other powerful features that come along.</p>\n<blockquote>\n<p><strong>Optinly App</strong><br />\n  Optinly popups and tools are part of the standalone Optinly app. You will need to create an Optinly account to access our popup builder, opt-in form builder and conversion tools <a href=\"https://app.optinly.com/?utm_source=wp_directory&amp;utm_medium=link&amp;utm_campaign=wpreadme\" title=\"Optinly\" rel=\"nofollow ugc\">Click here to create a free Optinly account now!</a></p>\n</blockquote>\n<h4>What is Optinly Popup Maker?</h4>\n<p>Put in a sentence, <strong>Optinly is a readymade popup maker</strong> that helps you create highly converting popups! Sounds great right?</p>\n<p>At Optinly, we understand how hard it is to create popups for your website/eCommerce store. And that’s the reason why we have come up with 75+ highly responsive predesigned templates. Also, we understand that every eCommerce owner has different perspectives and ideas.</p>\n<p>As a result, Optinly’s built-in popup editor allows you to customize the WordPress popup templates to a very high level. You can basically create website popups that are a clear reflection of your brand and ideas.</p>\n<p>Here’s what you can do with Optinly’s inbuilt popup editor.</p>\n<p>You can,</p>\n<ul>\n<li>\n<p><strong>Edit Popup Text</strong> &#8211; Change font style (bold, italics, underline), font color, font family and font size. You can also add hyperlinks to any part of the popup text and redirect users to the desired landing page.</p>\n</li>\n<li>\n<p><strong>Customize Call to Action Buttons</strong> &#8211; Change CTA button color, CTA button text color, font family, background color and more with Optinly. You can also change the color of the close icon on your popup template.</p>\n</li>\n<li>\n<p><strong>Customize Images</strong> &#8211; Optinly popup maker allows you to replace images that come with the popup templates. You can either choose an image from your local storage or choose from 1 million+ images in Pixabay.</p>\n</li>\n<li>\n<p><strong>Popup Transition effects</strong> &#8211; You can also choose to display popups with smooth animation effects. You get popup animation effects like fade-in, flip in, back in up and zoom in.</p>\n</li>\n<li>\n<p><strong>Device Responsiveness Check</strong> &#8211; You can have a preview of how your popup template is going to appear on multiple devices like mobiles, tablets and desktops using the device preview option.</p>\n</li>\n<li>\n<p><strong>GDPR Compliant</strong> &#8211; Most of Optinly’s popup templates come with the option to add/remove the <strong>“Accept Terms &amp; Conditions”</strong> checkbox. This helps you showcase that you are GDPR compliant to your web audience.</p>\n</li>\n</ul>\n<p>Let’s not reveal everything right away! Before we take an in-depth look at Optinly’s free popup creator, here are a few basics.</p>\n<ul>\n<li>\n<p><a href=\"https://help.optinly.com/installation/wordpress?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Learn how to connect Optinly popup tool with your WordPress website.</a></p>\n</li>\n<li>\n<p><a href=\"https://help.optinly.com/popups-campaigns/create-popups?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Learn how to create a campaign with Optinly popup tool.</a></p>\n</li>\n<li>\n<p><a href=\"https://optinly.com/features/?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Know more about Optinly popup tool.</a></p>\n</li>\n</ul>\n<p>★★★★★</p>\n<blockquote>\n<p><strong>Great Popup Plugin</strong><br />\n  &#8221; I have used this plugin for one of my blog and it was working fine as expected.<br />\n  I hardly need documentation or help from the support team. Thanks for providing it for free so user can fulfill their basic needs without purchasing the plugin&#8221;. &#8211; <a href=\"https://wordpress.org/support/topic/great-popup-plugin-36/\" rel=\"ugc\">Naveen</a></p>\n</blockquote>\n<h4>Why Do People Trust Optinly’s Free Popup Builder?</h4>\n<p>People love Optinly WordPress popup plugin, thanks to its easy installation and user-friendly popup creating approach. Optinly for a long time has been helping eCommerce owners and businesses capture leads and increase sales simultaneously &#8211; all in autopilot. With a lot of popup builder plugins around, take a look at why Optinly is being loved the most.</p>\n<p>Here are 5 robust reasons why people choose Optinly popup plugin as their go-to popup tool.</p>\n<ol>\n<li>\n<p><strong>Optinly Helps Save Huge Time</strong> &#8211; As we said already, creating popups is hard. But with Optinly WordPress popup tool, you can create popups with a few clicks. The user-centric approach helps all kinds of users create website popups with ease. All you have to do is, select your popup campaign goal, choose an appropriate WordPress popup template, set display rules and go live.</p>\n</li>\n<li>\n<p><strong>No Design/Development Skills Needed</strong> &#8211; The primary goal was to make Optinly as the best WordPress popup plugin around. Optinly follows a hassle-free installation process &#8211; whether it’s a WordPress website or a custom website, you can install Optinly in a few minutes <a href=\"https://help.optinly.com/?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">(find the installation instructions here)</a>. As for the design part, Optinly’s inbuilt popup editor makes it a walk in the park.</p>\n</li>\n<li>\n<p><strong>Ideal for Businesses &amp; eCommerce Stores</strong> &#8211; Optinly is an ideal lead capturing tool for both businesses and eCommerce stores. With marketing goals covering the most common growth scenarios, creating popups with Optinly is a no-brainer. You can simply collect leads or increase sales or engage audience with Optinly popup maker plugin &#8211; it’s totally up to you.</p>\n</li>\n<li>\n<p><strong>Help Docs</strong> &#8211; We want our users to have the best experience when they use Optinly popup plugin. And clean documentation helps products go a long way. Optinly has a dedicated knowledge base to help users out with the most common issues and queries. Whether it’s about creating a spin the wheel popup campaign or integrating with an Email marketing service provider, you can find everything you need in <a href=\"https://help.optinly.com/?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Optinly’s knowledge base</a>. There are also in-depth details about what you can do with Optinly’s popup editor, a couple of use cases, installation instructions and more.</p>\n</li>\n<li>\n<p><strong>Excellent Customer Support</strong> &#8211; Optinly’s customer support team is also an important factor why people stick with Optinly popup plugin. The team is more than happy to help grow your business. You can contact <a href=\"https://optinly.com/support/?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Optinly’s support team</a> from the chat option available on the homepage and the application or reach out via support@optinly.com.</p>\n</li>\n</ol>\n<p><strong>Here’s what people say about Optinly popup builder tool.</strong></p>\n<p>★★★★★</p>\n<blockquote>\n<p><strong>User Friendly Popup Plugin</strong><br />\n  &#8220;I am selling info products on my woocommerce store and this plugin really helps me to capture the leads and I am sending follow-ups and upselling emails to them. Customer data is the base of any business and this plugin really helps me to gather the data that I wanted.&#8221; &#8211; <a href=\"https://wordpress.org/support/topic/user-friendly-popup-plugin/\" rel=\"ugc\">Sumit</a></p>\n</blockquote>\n<p>Sumit also finds Optinly as an ideal lead capturing popup tool for his eCommerce store &#8211; does the intended task well!</p>\n<p>★★★★★</p>\n<blockquote>\n<p><strong>One tool you don&#8217;t know you need<br />\n  </strong><br />\n  &#8220;I have been creating websites for a while now and I was using free tools to create<br />\n  popups for Cookie Policy or Email optins. These free plugins although serves the<br />\n  purpose does not give options to track or customize. Was looking for a solution for a<br />\n  while and Optinly pops up in my mail.&#8221; &#8211; ***Amarnath ***</p>\n</blockquote>\n<p>This one’s huge! Here’s a user who has listed a few significant benefits of Optinly popup maker tool. And as for the CONS, the user is unsure if there exists any!</p>\n<p>★★★★★</p>\n<blockquote>\n<p><strong>A must-have even if you don&#8217;t like it<br />\n  </strong><br />\n  &#8220;I was never a fan of optins, I don&#8217;t like them myself, but unfortunately, they work and there is<br />\n  no way around that.<br />\n  Having said that I have tried several of them, and the free are annoying and the paid<br />\n  expensive. Then we have these guys to solve the problem.<br />\n  So far so good, and with an awesome price!.&#8221; &#8211; <strong><em>Joaomreis</em></strong></p>\n</blockquote>\n<p>Now you get why Optinly is the best WordPress popup plugin, don’t you? Here’s more on what people say about Optinly popup maker!</p>\n<h3>What Productive Features Does Optinly Responsive WordPress Newsletter Plugin Offer?</h3>\n<p>Like we already said, Optinly popup plugin helps businesses capture leads and comes with sophisticated features in its free version. And this makes Optinly one of the best newsletter WordPress popup plugins around.</p>\n<p>Let’s look at some of the best features of Optinly WordPress email newsletter popup plugin.</p>\n<h4>1. Simple Popup WordPress Plugin</h4>\n<p>Optinly is a WordPress popup plugin that’s extremely easy to use and display popups with. The clean UI/UX makes it a seamless experience when users try to create popups with Optinly. The clean dashboard, the goal-based approach, the WYSIWYG editor and the in-depth campaign analytics section together make Optinly a powerful yet a simple popup WordPress plugin.</p>\n<h4>2. Seamless Integration With Top Email Marketing Platforms</h4>\n<p>One of Optinly popup tool’s special features is the integration part. With Optinly, you can integrate with the best Email marketing service providers.</p>\n<p>Below mentioned are the integrations and webhooks Optinly popup plugin supports,</p>\n<ul>\n<li>MailChimp</li>\n<li>ConvertKit</li>\n<li>Hubspot</li>\n<li>MailerLite</li>\n<li>SendGrid</li>\n<li>Sendinblue</li>\n<li>CampaignMonitor</li>\n<li>Intercom</li>\n<li>Klaviyo</li>\n<li>ActiveCampaign</li>\n<li>GetResponse</li>\n<li>Customer.io</li>\n<li>SendFox</li>\n<li>Pabbly</li>\n<li>Integrately</li>\n</ul>\n<p>The additional number of planned ESPs and webhooks in the future makes Optinly a reliable popup maker WordPress plugin.</p>\n<p><a href=\"https://help.optinly.com/integrations?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Learn how to integrate Optinly with ESPs.</a></p>\n<h4>3. WordPress Widget-Based Popup Position</h4>\n<p>Positioning plays a crucial role when it comes to displaying popups. You need to make sure that the user experience isn’t sabotaged at any point. With Optinly popup plugin, you can display popup templates on different screen positions.</p>\n<p>You have options to</p>\n<ul>\n<li>Display slide-ins on the left and right corners of your screen.\n<ul>\n<li>Display floating bar popups either on the top or bottom of your screen.</li>\n<li>Fix floating bar popups to the screen while being scrolled.</li>\n</ul>\n</li>\n</ul>\n<h4>4. Different Types of Popups</h4>\n<p>We definitely know that one type of popup isn’t going to be enough for all your goals. And that is why Optinly popup tool comes with 6 different types of popups.</p>\n<p><strong>Coupon Popups</strong> &#8211; Coupons are a great way to increase your store/product sales. Optinly comes with pre-designed coupon popup templates. The coupon code automatically gets copied to the user’s clipboard when he/she clicks and tries to use it.</p>\n<p><strong>Spin the Wheel Popups</strong> &#8211; Gamification popups have helped engage and increase stickiness among web visitors. With Optinly’s spin the wheel popups, you can capture leads and increase sales simultaneously. Display coupons on spin to win templates as well.<br />\n<a href=\"https://help.optinly.com/popups-campaigns/spin-the-wheel-popups?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Learn how to create a spin to win campaign with Optinly.</a></p>\n<p><strong>Countdown Timer Popups</strong> &#8211; General stat states that 60% of people buy products because of FOMO (Fear of Missing Out). Leverage this strategy to promote impulsive buying during holiday sales. Use Optinly’s countdown timer popups to create FOMO on your store. You get both countdown timer bars and countdown timer popups.</p>\n<p><strong>Exit Intent Popups</strong> &#8211; Prevent visitors from abandoning your web page/shopping carts using exit triggers.</p>\n<p><strong>Fullscreen Overlay Popups</strong> &#8211; More screen space means undivided attention and more conversions. Optinly popup tool comes with highly customizable fullscreen overlay popup templates. Talk more to your audience and increase the chances of making a conversion.</p>\n<p><strong>Popup Launchers</strong> &#8211; The subtle lead generation popup lies at the bottom corner of your screen, giving a unique no-nonsense experience to your web audience.</p>\n<p>With different types of popups on deck, all you have to do is choose the one that’s going to be ideal for your marketing goals.</p>\n<h4>5. Exit Intent WordPress Popup Triggers</h4>\n<p>Abandonment has been the biggest problem of the decade for both websites and eCommerce owners. Stats say that around 70% of your store visitors end up abandoning their shopping carts and websites they visit.</p>\n<p>Luckily, Optinly is also a free exit popup tool that allows you to trigger popups when visitors exit. Exit intent popups can be used to prevent visitors from abandoning your web page/shopping carts. Display free exit intent popups with Optinly using the exit trigger display rule found on the popup triggering section.</p>\n<h4>6. Advanced Popup Display Rules</h4>\n<p>Displaying popups at the right time to your web audience is getting half the job done. Optinly popup plugin comes with advanced popup display rules/popup triggering options to help you with this.</p>\n<p>You get options to</p>\n<ul>\n<li>\n<p>Display popups when users exit (exit intent).</p>\n</li>\n<li>\n<p>Display popups only on specific pages.</p>\n<ul>\n<li>Exclude popups from being displayed on specific pages.</li>\n</ul>\n</li>\n<li>\n<p>Display popups after a specific period of time (time-delayed triggers).</p>\n</li>\n<li>Display popups based on device &#8211; mobile/desktops/tablets.<br />\nDisplay popups after a specific number of days to a visitor (retargeting).</li>\n</ul>\n<p>By using a combination of these triggers, you can capture more leads and increase sales on the go.</p>\n<p><a href=\"https://help.optinly.com/popups-campaigns/popup-display-rules?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Know more about Optinly’s display rules and how you can use them.</a></p>\n<h4>7. WYSIWYG Editor &#8211; Customizable WordPress Popups</h4>\n<p>Optinly is one of the best custom pop up builders around. You can seamlessly customize a chosen WordPress popup template using Optinly’s built-in popup editor. Since the editor follows a WYSIWYG (what you see is what you get) approach, you can edit predesigned templates with ease.</p>\n<h4>8. 75+ Email Popup WordPress Templates</h4>\n<p>Optinly comes with 75+ pre-designed WordPress popup templates. The different types of templates include slide-ins, floating bars, spin wheel popups, countdown timer popups, email collection popups and more.</p>\n<h4>9. WordPress Gamification Popups &#8211; Spin the Wheel Pop Up</h4>\n<p>Gamification helps with the engagement factor and increases visitor stickiness. Optinly is also a WordPress gamification popup plugin that comes with spin the wheel popups. Spin the wheel popups are a great tool for list building and increasing sales.</p>\n<h4>10. DIfferent Types of Popup Animations</h4>\n<p>Throw in some life to your popups! Make use of smooth display animation options Optinly has. Optinly popup maker comes with different types of popup animations like Fade In, Flip-In, Back in Up and Zoom In. You can simply choose the popup animation type you want when you customize your popup template.</p>\n<h4>11. Free WordPress Subscription Popup Tool</h4>\n<p>Optinly is one of the best free WordPress popup tools for your list building process. You can seamlessly grow your email list with the predesigned subscription popup templates and the sophisticated features that come in the free version. Since Optinly is a responsive popup WordPress plugin, you can display subscription popups on all devices &#8211; mobiles, tablets and desktops at zero cost.</p>\n<h4>12. Reduce Cart Abandonment Using Promotional Popups</h4>\n<p>WIth inbuilt exit intent triggers, Optinly helps you reduce cart abandonment to a great extent. Display coupons on popups or use countdown timer popups with promotional offers and stop visitors from abandoning their shopping carts. Coupons and timer popups are a great technique to create FOMO and promote impulsive buying.</p>\n<h4>13. Intuitive SaaS Popup Dashboard</h4>\n<p>Popup campaigns are all about conversions. With Optinly WordPress popup plugin, you get to know how  &hellip;</p>\n",
        "installation": "<p>This section describes how to install the plugin and get it working.</p>\n<p>e.g.</p>\n<ol>\n<li>Upload the plugin files to the <code>/wp-content/plugins/plugin-name</code> directory, or install the plugin through the WordPress plugins screen directly.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; screen in WordPress</li>\n<li>Use the Settings-&gt;Plugin Name screen to configure the plugin</li>\n<li>(Make your instructions match the desired user flow for activating and installing your plugin. Include any steps that might be needed for explanatory purposes)</li>\n</ol>\n",
        "faq": "\n<dt id='is%20optinly%20a%20free%20wordpress%20popup%20plugin%3F'>\nIs Optinly a free WordPress popup plugin?\n</h4>\n<p>\n<p>Yes. Optinly is a free WordPress popup plugin that comes with sophisticated features. With pre-existing growth marketing goals, templates and advanced display rules, you can create popups on the go with Optinly.</p>\n</p>\n<dt id='how%20many%20pop%20up%20campaigns%20can%20i%20create%20with%20optinly%20popup%20maker%20plugin%3F'>\nHow many pop up campaigns can I create with Optinly popup maker plugin?\n</h4>\n<p>\n<p>Optinly popup plugin doesn’t have limitations on the number of pop up campaigns. You can create an unlimited number of pop up campaigns with different templates &#8211; no strings attached.</p>\n</p>\n<dt id='can%20i%20edit%20popup%20templates%20based%20on%20my%20interest%3F'>\nCan I edit popup templates based on my interest?\n</h4>\n<p>\n<p>Optinly comes with a huge number of WordPress popup templates. You can customize any of these templates based on your ideas and interests using Optinly’s popup editor.</p>\n</p>\n<dt id='are%20optinly%E2%80%99s%20popup%20templates%20responsive%3F'>\nAre Optinly’s popup templates responsive?\n</h4>\n<p>\n<p>All inbuilt popup templates are highly responsive and customizable. You can display popups on desktops, tablets and mobile devices simultaneously or in a selected manner.</p>\n</p>\n<dt id='is%20there%20any%20option%20to%20redirect%20users%20when%20he%2Fshe%20clicks%20popups%3F'>\nIs there any option to redirect users when he/she clicks popups?\n</h4>\n<p>\n<p>Yes. With the Optinly popup builder tool, you get options to add custom URL links to popup buttons (CTA). You can simply copy and paste the URL in the respective field box found on Optinly’s popup editor section.</p>\n</p>\n<dt id='is%20there%20any%20option%20to%20download%20leads%20that%20are%20collected%20using%20optinly%20popups%3F'>\nIs there any option to download leads that are collected using Optinly popups?\n</h4>\n<p>\n<p>You can download the collected leads using Optinly popups via a CSV file format. You have this option under the “Subscribers&#8221; menu.</p>\n</p>\n<dt id='can%20i%20use%20optinly%20popup%20builder%20plugin%20for%20woocommerce%3F'>\nCan I use Optinly popup builder plugin for WooCommerce?\n</h4>\n<p>\n<p>Optinly is a WordPress popup builder plugin that’s compatible with WooCommerce as well. So, you can easily create popups for your WooCommerce store.</p>\n</p>\n<dt id='does%20optinly%20have%20any%20limit%20on%20the%20number%20of%20sessions%2Fpageviews%3F'>\nDoes Optinly have any limit on the number of sessions/pageviews?\n</h4>\n<p>\n<p>No. Optinly WordPress popup builder plugin does not have any limit on the number of sessions/pageviews. You can also create an unlimited number of popup campaigns with Optinly.</p>\n</p>\n<dt id='can%20i%20stop%20popups%20from%20being%20displayed%20on%20specific%20pages%3F'>\nCan I stop popups from being displayed on specific pages?\n</h4>\n<p>\n<p>Yes. With Optinly’s advanced popup display rules option, you can exclude popups from being displayed on specific pages.</p>\n</p>\n<dt id='how%20can%20i%20reach%20out%20to%20optinly%E2%80%99s%20customer%20support%20team%3F'>\nHow can I reach out to Optinly’s customer support team?\n</h4>\n<p>\n<p>You can contact Optinly’s support team using the chat option available on the website and the dashboard. You can also get in touch by sending an email to support@optinly.com</p>\n</p>\n\n",
        "changelog": "<h4>1.0.11</h4>\n<ul>\n<li>Mailpoet integration support added</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Shortcode support added [optinly-campaign ]</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>API Url modified</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Support upto 5.5 added</li>\n</ul>\n"
    },
    "short_description": "Capture more leads &amp; increase conversions with Optinly. Use 75+ templates and advanced triggering options to create highly converting popup campaigns!",
    "description": "<h3>Optinly</h3>\n<p><a href=\"https://optinly.com/?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Optinly</a> is the <strong>best goal-based WordPress popup plugin</strong> that helps you capture more leads, engage audience and increase sales on the go.</p>\n<p>With Optinly’s popup builder plugin, you can <a href=\"https://app.optinly.com/?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">create responsive popup forms</a> in under a few minutes, thanks to the <strong>readymade free website popup templates</strong>.</p>\n<p>Optinly comes with different types of popup forms like <strong>email popups/subscription popups,spin the wheel popups, fullscreen overlays, countdown popups</strong> and more. This helps you achieve all your business goals with extreme ease and comfort.</p>\n<p>Also, the pre-existing growth marketing goals like <strong>build audience, promote special offers, increase cart value, reduce cart abandonment, etc</strong> helps you create popup campaigns quickly. All growth goals are backed by appropriate popup templates, making the campaign creation process super easy!</p>\n<p>This free popup tool comes with a clean UI/UX and has a lot of sophisticated features. Let’s look into Optinly and know how it can help with the list building/lead generation process, your business growth and also the other powerful features that come along.</p>\n<blockquote>\n<p><strong>Optinly App</strong><br />\n  Optinly popups and tools are part of the standalone Optinly app. You will need to create an Optinly account to access our popup builder, opt-in form builder and conversion tools <a href=\"https://app.optinly.com/?utm_source=wp_directory&amp;utm_medium=link&amp;utm_campaign=wpreadme\" title=\"Optinly\" rel=\"nofollow ugc\">Click here to create a free Optinly account now!</a></p>\n</blockquote>\n<h4>What is Optinly Popup Maker?</h4>\n<p>Put in a sentence, <strong>Optinly is a readymade popup maker</strong> that helps you create highly converting popups! Sounds great right?</p>\n<p>At Optinly, we understand how hard it is to create popups for your website/eCommerce store. And that’s the reason why we have come up with 75+ highly responsive predesigned templates. Also, we understand that every eCommerce owner has different perspectives and ideas.</p>\n<p>As a result, Optinly’s built-in popup editor allows you to customize the WordPress popup templates to a very high level. You can basically create website popups that are a clear reflection of your brand and ideas.</p>\n<p>Here’s what you can do with Optinly’s inbuilt popup editor.</p>\n<p>You can,</p>\n<ul>\n<li>\n<p><strong>Edit Popup Text</strong> &#8211; Change font style (bold, italics, underline), font color, font family and font size. You can also add hyperlinks to any part of the popup text and redirect users to the desired landing page.</p>\n</li>\n<li>\n<p><strong>Customize Call to Action Buttons</strong> &#8211; Change CTA button color, CTA button text color, font family, background color and more with Optinly. You can also change the color of the close icon on your popup template.</p>\n</li>\n<li>\n<p><strong>Customize Images</strong> &#8211; Optinly popup maker allows you to replace images that come with the popup templates. You can either choose an image from your local storage or choose from 1 million+ images in Pixabay.</p>\n</li>\n<li>\n<p><strong>Popup Transition effects</strong> &#8211; You can also choose to display popups with smooth animation effects. You get popup animation effects like fade-in, flip in, back in up and zoom in.</p>\n</li>\n<li>\n<p><strong>Device Responsiveness Check</strong> &#8211; You can have a preview of how your popup template is going to appear on multiple devices like mobiles, tablets and desktops using the device preview option.</p>\n</li>\n<li>\n<p><strong>GDPR Compliant</strong> &#8211; Most of Optinly’s popup templates come with the option to add/remove the <strong>“Accept Terms &amp; Conditions”</strong> checkbox. This helps you showcase that you are GDPR compliant to your web audience.</p>\n</li>\n</ul>\n<p>Let’s not reveal everything right away! Before we take an in-depth look at Optinly’s free popup creator, here are a few basics.</p>\n<ul>\n<li>\n<p><a href=\"https://help.optinly.com/installation/wordpress?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Learn how to connect Optinly popup tool with your WordPress website.</a></p>\n</li>\n<li>\n<p><a href=\"https://help.optinly.com/popups-campaigns/create-popups?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Learn how to create a campaign with Optinly popup tool.</a></p>\n</li>\n<li>\n<p><a href=\"https://optinly.com/features/?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Know more about Optinly popup tool.</a></p>\n</li>\n</ul>\n<p>★★★★★</p>\n<blockquote>\n<p><strong>Great Popup Plugin</strong><br />\n  &#8221; I have used this plugin for one of my blog and it was working fine as expected.<br />\n  I hardly need documentation or help from the support team. Thanks for providing it for free so user can fulfill their basic needs without purchasing the plugin&#8221;. &#8211; <a href=\"https://wordpress.org/support/topic/great-popup-plugin-36/\" rel=\"ugc\">Naveen</a></p>\n</blockquote>\n<h4>Why Do People Trust Optinly’s Free Popup Builder?</h4>\n<p>People love Optinly WordPress popup plugin, thanks to its easy installation and user-friendly popup creating approach. Optinly for a long time has been helping eCommerce owners and businesses capture leads and increase sales simultaneously &#8211; all in autopilot. With a lot of popup builder plugins around, take a look at why Optinly is being loved the most.</p>\n<p>Here are 5 robust reasons why people choose Optinly popup plugin as their go-to popup tool.</p>\n<ol>\n<li>\n<p><strong>Optinly Helps Save Huge Time</strong> &#8211; As we said already, creating popups is hard. But with Optinly WordPress popup tool, you can create popups with a few clicks. The user-centric approach helps all kinds of users create website popups with ease. All you have to do is, select your popup campaign goal, choose an appropriate WordPress popup template, set display rules and go live.</p>\n</li>\n<li>\n<p><strong>No Design/Development Skills Needed</strong> &#8211; The primary goal was to make Optinly as the best WordPress popup plugin around. Optinly follows a hassle-free installation process &#8211; whether it’s a WordPress website or a custom website, you can install Optinly in a few minutes <a href=\"https://help.optinly.com/?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">(find the installation instructions here)</a>. As for the design part, Optinly’s inbuilt popup editor makes it a walk in the park.</p>\n</li>\n<li>\n<p><strong>Ideal for Businesses &amp; eCommerce Stores</strong> &#8211; Optinly is an ideal lead capturing tool for both businesses and eCommerce stores. With marketing goals covering the most common growth scenarios, creating popups with Optinly is a no-brainer. You can simply collect leads or increase sales or engage audience with Optinly popup maker plugin &#8211; it’s totally up to you.</p>\n</li>\n<li>\n<p><strong>Help Docs</strong> &#8211; We want our users to have the best experience when they use Optinly popup plugin. And clean documentation helps products go a long way. Optinly has a dedicated knowledge base to help users out with the most common issues and queries. Whether it’s about creating a spin the wheel popup campaign or integrating with an Email marketing service provider, you can find everything you need in <a href=\"https://help.optinly.com/?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Optinly’s knowledge base</a>. There are also in-depth details about what you can do with Optinly’s popup editor, a couple of use cases, installation instructions and more.</p>\n</li>\n<li>\n<p><strong>Excellent Customer Support</strong> &#8211; Optinly’s customer support team is also an important factor why people stick with Optinly popup plugin. The team is more than happy to help grow your business. You can contact <a href=\"https://optinly.com/support/?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Optinly’s support team</a> from the chat option available on the homepage and the application or reach out via support@optinly.com.</p>\n</li>\n</ol>\n<p><strong>Here’s what people say about Optinly popup builder tool.</strong></p>\n<p>★★★★★</p>\n<blockquote>\n<p><strong>User Friendly Popup Plugin</strong><br />\n  &#8220;I am selling info products on my woocommerce store and this plugin really helps me to capture the leads and I am sending follow-ups and upselling emails to them. Customer data is the base of any business and this plugin really helps me to gather the data that I wanted.&#8221; &#8211; <a href=\"https://wordpress.org/support/topic/user-friendly-popup-plugin/\" rel=\"ugc\">Sumit</a></p>\n</blockquote>\n<p>Sumit also finds Optinly as an ideal lead capturing popup tool for his eCommerce store &#8211; does the intended task well!</p>\n<p>★★★★★</p>\n<blockquote>\n<p><strong>One tool you don&#8217;t know you need<br />\n  </strong><br />\n  &#8220;I have been creating websites for a while now and I was using free tools to create<br />\n  popups for Cookie Policy or Email optins. These free plugins although serves the<br />\n  purpose does not give options to track or customize. Was looking for a solution for a<br />\n  while and Optinly pops up in my mail.&#8221; &#8211; ***Amarnath ***</p>\n</blockquote>\n<p>This one’s huge! Here’s a user who has listed a few significant benefits of Optinly popup maker tool. And as for the CONS, the user is unsure if there exists any!</p>\n<p>★★★★★</p>\n<blockquote>\n<p><strong>A must-have even if you don&#8217;t like it<br />\n  </strong><br />\n  &#8220;I was never a fan of optins, I don&#8217;t like them myself, but unfortunately, they work and there is<br />\n  no way around that.<br />\n  Having said that I have tried several of them, and the free are annoying and the paid<br />\n  expensive. Then we have these guys to solve the problem.<br />\n  So far so good, and with an awesome price!.&#8221; &#8211; <strong><em>Joaomreis</em></strong></p>\n</blockquote>\n<p>Now you get why Optinly is the best WordPress popup plugin, don’t you? Here’s more on what people say about Optinly popup maker!</p>\n<h3>What Productive Features Does Optinly Responsive WordPress Newsletter Plugin Offer?</h3>\n<p>Like we already said, Optinly popup plugin helps businesses capture leads and comes with sophisticated features in its free version. And this makes Optinly one of the best newsletter WordPress popup plugins around.</p>\n<p>Let’s look at some of the best features of Optinly WordPress email newsletter popup plugin.</p>\n<h4>1. Simple Popup WordPress Plugin</h4>\n<p>Optinly is a WordPress popup plugin that’s extremely easy to use and display popups with. The clean UI/UX makes it a seamless experience when users try to create popups with Optinly. The clean dashboard, the goal-based approach, the WYSIWYG editor and the in-depth campaign analytics section together make Optinly a powerful yet a simple popup WordPress plugin.</p>\n<h4>2. Seamless Integration With Top Email Marketing Platforms</h4>\n<p>One of Optinly popup tool’s special features is the integration part. With Optinly, you can integrate with the best Email marketing service providers.</p>\n<p>Below mentioned are the integrations and webhooks Optinly popup plugin supports,</p>\n<ul>\n<li>MailChimp</li>\n<li>ConvertKit</li>\n<li>Hubspot</li>\n<li>MailerLite</li>\n<li>SendGrid</li>\n<li>Sendinblue</li>\n<li>CampaignMonitor</li>\n<li>Intercom</li>\n<li>Klaviyo</li>\n<li>ActiveCampaign</li>\n<li>GetResponse</li>\n<li>Customer.io</li>\n<li>SendFox</li>\n<li>Pabbly</li>\n<li>Integrately</li>\n</ul>\n<p>The additional number of planned ESPs and webhooks in the future makes Optinly a reliable popup maker WordPress plugin.</p>\n<p><a href=\"https://help.optinly.com/integrations?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Learn how to integrate Optinly with ESPs.</a></p>\n<h4>3. WordPress Widget-Based Popup Position</h4>\n<p>Positioning plays a crucial role when it comes to displaying popups. You need to make sure that the user experience isn’t sabotaged at any point. With Optinly popup plugin, you can display popup templates on different screen positions.</p>\n<p>You have options to</p>\n<ul>\n<li>Display slide-ins on the left and right corners of your screen.\n<ul>\n<li>Display floating bar popups either on the top or bottom of your screen.</li>\n<li>Fix floating bar popups to the screen while being scrolled.</li>\n</ul>\n</li>\n</ul>\n<h4>4. Different Types of Popups</h4>\n<p>We definitely know that one type of popup isn’t going to be enough for all your goals. And that is why Optinly popup tool comes with 6 different types of popups.</p>\n<p><strong>Coupon Popups</strong> &#8211; Coupons are a great way to increase your store/product sales. Optinly comes with pre-designed coupon popup templates. The coupon code automatically gets copied to the user’s clipboard when he/she clicks and tries to use it.</p>\n<p><strong>Spin the Wheel Popups</strong> &#8211; Gamification popups have helped engage and increase stickiness among web visitors. With Optinly’s spin the wheel popups, you can capture leads and increase sales simultaneously. Display coupons on spin to win templates as well.<br />\n<a href=\"https://help.optinly.com/popups-campaigns/spin-the-wheel-popups?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Learn how to create a spin to win campaign with Optinly.</a></p>\n<p><strong>Countdown Timer Popups</strong> &#8211; General stat states that 60% of people buy products because of FOMO (Fear of Missing Out). Leverage this strategy to promote impulsive buying during holiday sales. Use Optinly’s countdown timer popups to create FOMO on your store. You get both countdown timer bars and countdown timer popups.</p>\n<p><strong>Exit Intent Popups</strong> &#8211; Prevent visitors from abandoning your web page/shopping carts using exit triggers.</p>\n<p><strong>Fullscreen Overlay Popups</strong> &#8211; More screen space means undivided attention and more conversions. Optinly popup tool comes with highly customizable fullscreen overlay popup templates. Talk more to your audience and increase the chances of making a conversion.</p>\n<p><strong>Popup Launchers</strong> &#8211; The subtle lead generation popup lies at the bottom corner of your screen, giving a unique no-nonsense experience to your web audience.</p>\n<p>With different types of popups on deck, all you have to do is choose the one that’s going to be ideal for your marketing goals.</p>\n<h4>5. Exit Intent WordPress Popup Triggers</h4>\n<p>Abandonment has been the biggest problem of the decade for both websites and eCommerce owners. Stats say that around 70% of your store visitors end up abandoning their shopping carts and websites they visit.</p>\n<p>Luckily, Optinly is also a free exit popup tool that allows you to trigger popups when visitors exit. Exit intent popups can be used to prevent visitors from abandoning your web page/shopping carts. Display free exit intent popups with Optinly using the exit trigger display rule found on the popup triggering section.</p>\n<h4>6. Advanced Popup Display Rules</h4>\n<p>Displaying popups at the right time to your web audience is getting half the job done. Optinly popup plugin comes with advanced popup display rules/popup triggering options to help you with this.</p>\n<p>You get options to</p>\n<ul>\n<li>\n<p>Display popups when users exit (exit intent).</p>\n</li>\n<li>\n<p>Display popups only on specific pages.</p>\n<ul>\n<li>Exclude popups from being displayed on specific pages.</li>\n</ul>\n</li>\n<li>\n<p>Display popups after a specific period of time (time-delayed triggers).</p>\n</li>\n<li>Display popups based on device &#8211; mobile/desktops/tablets.<br />\nDisplay popups after a specific number of days to a visitor (retargeting).</li>\n</ul>\n<p>By using a combination of these triggers, you can capture more leads and increase sales on the go.</p>\n<p><a href=\"https://help.optinly.com/popups-campaigns/popup-display-rules?utm_source=referral&amp;utm_medium=wordpressrepo&amp;utm_campaign=readme\" rel=\"nofollow ugc\">Know more about Optinly’s display rules and how you can use them.</a></p>\n<h4>7. WYSIWYG Editor &#8211; Customizable WordPress Popups</h4>\n<p>Optinly is one of the best custom pop up builders around. You can seamlessly customize a chosen WordPress popup template using Optinly’s built-in popup editor. Since the editor follows a WYSIWYG (what you see is what you get) approach, you can edit predesigned templates with ease.</p>\n<h4>8. 75+ Email Popup WordPress Templates</h4>\n<p>Optinly comes with 75+ pre-designed WordPress popup templates. The different types of templates include slide-ins, floating bars, spin wheel popups, countdown timer popups, email collection popups and more.</p>\n<h4>9. WordPress Gamification Popups &#8211; Spin the Wheel Pop Up</h4>\n<p>Gamification helps with the engagement factor and increases visitor stickiness. Optinly is also a WordPress gamification popup plugin that comes with spin the wheel popups. Spin the wheel popups are a great tool for list building and increasing sales.</p>\n<h4>10. DIfferent Types of Popup Animations</h4>\n<p>Throw in some life to your popups! Make use of smooth display animation options Optinly has. Optinly popup maker comes with different types of popup animations like Fade In, Flip-In, Back in Up and Zoom In. You can simply choose the popup animation type you want when you customize your popup template.</p>\n<h4>11. Free WordPress Subscription Popup Tool</h4>\n<p>Optinly is one of the best free WordPress popup tools for your list building process. You can seamlessly grow your email list with the predesigned subscription popup templates and the sophisticated features that come in the free version. Since Optinly is a responsive popup WordPress plugin, you can display subscription popups on all devices &#8211; mobiles, tablets and desktops at zero cost.</p>\n<h4>12. Reduce Cart Abandonment Using Promotional Popups</h4>\n<p>WIth inbuilt exit intent triggers, Optinly helps you reduce cart abandonment to a great extent. Display coupons on popups or use countdown timer popups with promotional offers and stop visitors from abandoning their shopping carts. Coupons and timer popups are a great technique to create FOMO and promote impulsive buying.</p>\n<h4>13. Intuitive SaaS Popup Dashboard</h4>\n<p>Popup campaigns are all about conversions. With Optinly WordPress popup plugin, you get to know how  &hellip;</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/optinly.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/optinly/assets/screenshot-2.gif?rev=2476226",
            "caption": "Anlaytics dashboard, Campaigns list, CSV format lead downloads, etc"
        },
        {
            "src": "https://ps.w.org/optinly/assets/screenshot-3.gif?rev=2476226",
            "caption": "75+ ready to use popup templates"
        },
        {
            "src": "https://ps.w.org/optinly/assets/screenshot-4.gif?rev=2476226",
            "caption": "Live Demo - Countdown timers, Exit intent and Slide-ins"
        },
        {
            "src": "https://ps.w.org/optinly/assets/screenshot-5.png?rev=2476226",
            "caption": "Pre-existing growth marketing goals"
        },
        {
            "src": "https://ps.w.org/optinly/assets/screenshot-6.png?rev=2476226",
            "caption": "75+ highly responsive and customizable popup templates"
        },
        {
            "src": "https://ps.w.org/optinly/assets/screenshot-7.png?rev=2476226",
            "caption": "Gamification Popup - Spin the wheel template"
        },
        {
            "src": "https://ps.w.org/optinly/assets/screenshot-8.png?rev=2476226",
            "caption": "Integration with 15+ top email service providers and webhooks"
        },
        {
            "src": "https://ps.w.org/optinly/assets/screenshot-9.png?rev=2476226",
            "caption": "Optinly customer testimonials &amp; user reviews"
        }
    ],
    "tags": {
        "exit-intent": "exit-intent",
        "lightbox": "lightbox",
        "newsletter": "newsletter",
        "optin": "Optin",
        "popups": "popups"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.10": "https://downloads.wordpress.org/plugin/optinly.1.0.10.zip",
        "1.0.11": "https://downloads.wordpress.org/plugin/optinly.1.0.11.zip",
        "1.0.11.1": "https://downloads.wordpress.org/plugin/optinly.1.0.11.1.zip",
        "1.0.15": "https://downloads.wordpress.org/plugin/optinly.1.0.15.zip",
        "1.0.16": "https://downloads.wordpress.org/plugin/optinly.1.0.16.zip",
        "1.0.17": "https://downloads.wordpress.org/plugin/optinly.1.0.17.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/optinly.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/optinly.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/optinly.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/optinly.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/optinly.1.0.6.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/optinly.1.0.7.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/optinly.1.0.8.zip",
        "1.0.9": "https://downloads.wordpress.org/plugin/optinly.1.0.9.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/optinly/assets/banner-772x250.png?rev=2476288",
        "high": "https://ps.w.org/optinly/assets/banner-1544x500.png?rev=2476288"
    },
    "icons": {
        "1x": "https://ps.w.org/optinly/assets/icon-128x128.png?rev=2329068",
        "2x": "https://ps.w.org/optinly/assets/icon-256x256.png?rev=2329068"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 86,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}