{
    "name": "Order Delivery Date for WooCommerce",
    "slug": "order-delivery-date-for-woocommerce",
    "version": "3.23.0",
    "author": "<a href=\"https://www.tychesoftwares.com/\">Tyche Softwares</a>",
    "author_profile": "https://profiles.wordpress.org/tychesoftwares/",
    "contributors": {
        "ashokrane": {
            "profile": "https://profiles.wordpress.org/ashokrane/",
            "avatar": "https://secure.gravatar.com/avatar/303cac30a48dba6130bdc2f341a4444b?s=96&d=monsterid&r=g",
            "display_name": "Vishal Kothari"
        },
        "tychesoftwares": {
            "profile": "https://profiles.wordpress.org/tychesoftwares/",
            "avatar": "https://secure.gravatar.com/avatar/ca56e0c3106736f7f0d990f9b0392c45?s=96&d=monsterid&r=g",
            "display_name": "tychesoftwares"
        },
        "rashmim": {
            "profile": "https://profiles.wordpress.org/rashmim/",
            "avatar": "https://secure.gravatar.com/avatar/45d9f4d6b0f5e72ef688d808174a3d4c?s=96&d=monsterid&r=g",
            "display_name": "Rashmi Malpande"
        }
    },
    "requires": "1.3",
    "tested": "6.6.2",
    "requires_php": "7.3",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 86,
    "ratings": {
        "5": 48,
        "4": 1,
        "3": 2,
        "2": 4,
        "1": 7
    },
    "num_ratings": 62,
    "support_url": "https://wordpress.org/support/plugin/order-delivery-date-for-woocommerce/",
    "support_threads": 6,
    "support_threads_resolved": 3,
    "active_installs": 10000,
    "last_updated": "2024-10-18 10:25:00",
    "added": "2012-08-17",
    "homepage": "https://www.tychesoftwares.com/store/premium-plugins/order-delivery-date-for-woocommerce-pro-21/",
    "sections": {
        "description": "<p>The Best FREE WordPress Delivery Date &amp; Time Plugin</p>\n<p>The Order Delivery Date for WooCommerce Lite is a FREE plugin that helps you to give your customer the power of selecting order delivery date &amp; time during the WooCommerce checkout.</p>\n<p>44% of consumers say that they will likely become repeat buyers after a personalized shopping experience with a particular company. With the Order Delivery Date lite version, you can deliver a personalized shopping experience where the user can pick a delivery date and time at their convenience. As a WooCommerce store owner, you can easily manage your delivery and utilize the time to grow your business.</p>\n<p><strong>What if you can get better features for less money? &#8211;<a href=\"https://www.tychesoftwares.com/products/woocommerce-order-delivery-date-pro-plugin-trial/?utm_source=wprepo&amp;utm_medium=descriptionlink&amp;utm_campaign=OrderDeliveryDateLite\" rel=\"nofollow ugc\">Try Order Delivery Date PRO for just $1</a></strong></p>\n<h3>Order Delivery Date for WooCommerce Lite Features</h3>\n<p>The Order Delivery Date for WooCommerce lite version gives you <strong>20+ features!</strong></p>\n<p>Add products to the cart and experience how the Order delivery date works- <a href=\"https://app.instawp.io/launch?t=order-delivery-date-pro-for-woocommerce&amp;d=v1\" rel=\"nofollow ugc\">Live Demo</a>.</p>\n<p>Also, Use and become familiar with the admin dashboard controls- <a href=\"https://app.instawp.io/launch?t=order-delivery-date-pro-for-woocommerce&amp;d=v1\" rel=\"nofollow ugc\">Admin Demo</a>.</p>\n<p><strong>While the lite has 20+ features, the Order Delivery Date Pro has 50+ features. <a href=\"https://www.tychesoftwares.com/products/woocommerce-order-delivery-date-pro-plugin-trial/?utm_source=wprepo&amp;utm_medium=litefeatureslink&amp;utm_campaign=OrderDeliveryDateLite\" rel=\"nofollow ugc\">Unlock all the PRO features for just $1 with our trial offer</a>.</strong></p>\n<p>Here are the Order Delivery Date for WooCommerce lite features:</p>\n<p><strong>Flexible Delivery Date Selection Options</strong></p>\n<ul>\n<li>Allow customers to select a delivery date on the checkout page.</li>\n<li>Disable the weekdays on which you do not deliver products.</li>\n<li>The minimum required time for delivery can be set in hours.</li>\n<li>Set the delivery date field mandatory on the checkout page.</li>\n<li>Auto-populate the first available delivery date &amp; time selection in the delivery date and time fields, respectively on the checkout page.</li>\n<li>Set delivery date field labels as per your business requirements. </li>\n<li>Disable delivery for Virtual and Featured products.   </li>\n</ul>\n<p><strong>Easy to Manage Delivery Options</strong></p>\n<ul>\n<li>Capture delivery time slot along with the delivery date.</li>\n<li>Add multiple time slots individually in one go.</li>\n<li>Add time slots in bulk with a fixed duration &amp; interval.</li>\n<li>Capture Delivery Date &amp; Time on cart page along with checkout page.</li>\n<li>Change the look of the delivery calendar by selecting the color code.</li>\n</ul>\n<p><strong>Conditional Based Delivery Date Selection Options</strong></p>\n<ul>\n<li>Set Maximum Deliveries per day by Orders  </li>\n<li>Limit the number of orders to be placed per day.</li>\n<li>Block a deliverable time slot for a date or weekday.</li>\n<li>Set holidays on the dates you do not deliver products.</li>\n</ul>\n<p><strong>Friendly Admin Controls</strong></p>\n<ul>\n<li>Admin can edit delivery dates from Orders page &amp; notify the customer.</li>\n<li>Selected Delivery Date will be displayed on the WooCommerce Order page at the backend.</li>\n<li>The selected delivery date will be displayed on the WooCommerce Edit Order page in the admin dashboard.</li>\n<li>Admins can filter orders based on the delivery dates on the WooCommerce orders page.</li>\n<li>Compatible with WooCommerce HPOS.</li>\n</ul>\n<p>** <em>Want to show the delivery dates on the product page? <a href=\"https://wordpress.org/plugins/product-delivery-date-for-woocommerce-lite/\" rel=\"ugc\">Product Delivery Date LITE</a> plugin allows the customer to choose a delivery date right within the product page and add the product to the cart.</em></p>\n<h3>Here is what some of our customers say about this plugin:</h3>\n<blockquote>\n<p>I really appreciated that they answered all my questions. They are so awesome. The plugin is so perfect. Everything works fine. If I need help, they will help. The free plugin is so perfect, so the pro version is gonna be excellent too. Thank you so much.<br />\n  &#8211; sisili08R</p>\n<p>A perfect plugin, says what it does and adds the functions simply with no fuss. I even had additional support when I wanted to tweak the plugin to fit my site better. Would recommend this to everyone.<br />\n  &#8211; <a href=\"https://wordpress.org/support/topic/just-what-i-needed-and-no-fuss/\" rel=\"ugc\">creaselambert</a></p>\n<p>The plugin worked as described and is extremely well supported which is key. It works by ordering the order screen by default – latest orders first – or by the delivery date. All one has to do is use a simple checkbox to flick between their preferred methods. The plugin developer has responded to a request I had inside a few hours and resolved it very professionally. 5 stars for the plugin and its support.<br />\n  &#8211; <a href=\"https://wordpress.org/support/topic/perfect-plugin-for-delivery-date/\" rel=\"ugc\">allmyhoney</a></p>\n<p>We use this plugin for the web shop of our florist for customers to arrange deliveries Monday to Friday and on Saturday mornings. Being able to set an earlier cut off time for Saturdays (or Sundays when applicable) is great.<br />\n  &#8211; <a href=\"https://wordpress.org/support/topic/custom-cut-off-times-for-each-day/\" rel=\"ugc\">bnolan</a></p>\n</blockquote>\n<p><strong>Pro Tip:</strong> The <a href=\"https://www.tychesoftwares.com/store/premium-plugins/woocommerce-subscriptions-compatibility-addon-for-order-delivery-date-pro-for-woocommerce-plugin/\" rel=\"nofollow ugc\">WooCommerce Subscriptions Compatibility addon</a> allows you to select a delivery date based on the renewal period for the renewal orders on the checkout for manual renewals. Delivery Date &amp; Time will be automatically updated for the renewal orders if the automatic renewals are enabled</p>\n<h3>Order Delivery Date PRO</h3>\n<p>The <a href=\"https://www.tychesoftwares.com/store/premium-plugins/order-delivery-date-for-woocommerce-pro-21/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=OrderDeliveryDateLite\" rel=\"nofollow ugc\">Order Delivery Date for WooCommerce also has a PRO version</a>. In the pro version, you get additional features that take your WooCommerce store shopping experience to the next level.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/lxWCq6X6bPM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>The PRO version offers 25+ additional features along with the 20+ Lite version features.</p>\n<h3>Order Delivery Date for WooCommerce PRO key highlight features</h3>\n<ul>\n<li>2-way Synchronization of your deliveries with Google Calendar in real-time</li>\n<li>Ability to enable or disable delivery date for specific product categories</li>\n<li>Create different delivery schedules from plugins like WooCommerce Table Rate Shipping, Fedex plugin,  USPS Shipping Method Plugin by WooCommerce, etc. </li>\n<li>Ability to create delivery schedules by shipping methods, product categories &amp; shipping classes.</li>\n<li>Ability to set up recurring deliveries with WooCommerce Subscriptions plugin and Subscription compatibility add-on</li>\n<li>Customers can edit the delivery date from the My Account section</li>\n<li>Admin can filter the orders by the delivery date</li>\n<li>Display delivery date &amp; time information in the WooCommerce mobile app    </li>\n<li>Customers/Admin are notified once the delivery is rescheduled</li>\n<li>Setup same-day &amp; next-day deliveries with cut-off times</li>\n<li>Compatibility with <a href=\"https://www.tychesoftwares.com/store/premium-plugins/pickup-date-addon-order-delivery-date-woocommerce-plugin/\" rel=\"nofollow ugc\">Pickup Date Addon</a></li>\n</ul>\n<p><strong>Wondering how all these PRO features can help your store? Stop thinking and <a href=\"https://www.tychesoftwares.com/products/woocommerce-order-delivery-date-pro-plugin-trial/?utm_source=wprepo&amp;utm_medium=profeatureslink&amp;utm_campaign=OrderDeliveryDateLite\" rel=\"nofollow ugc\">try all the PRO features on your WooCommerce store with our $1 trial offer</a>.</strong></p>\n<p>You can check the entire features on our <a href=\"https://www.tychesoftwares.com/differences-pro-lite-versions-order-delivery-date-woocommerce-plugin\" rel=\"nofollow ugc\">Order Delivery Date for the WooCommerce Lite Vs. Pro comparison post</a>.</p>\n<p>Order Delivery Date PRO is helping many WooCommerce store owners <a href=\"https://www.tychesoftwares.com/reduce-woocommerce-delivery-operational-cost/\" rel=\"nofollow ugc\">reduce operational costs and improve their orders</a> .</p>\n<blockquote>\n<p>This plugin is the perfect solution for allowing your customers to tell you when they’ll be available for delivery. Especially if you’re a small business that tends directly to your customer, this plugin will allow you to ensure their happiness with their order in that they’ll know exactly when to expect their delivery. A definite 5 star rating for the plugin and a 5 star rating for the support that it comes with! Please don’t have any doubts purchasing this one! Best money you’ll ever spend!<br />\n  &#8211; <a href=\"https://wordpress.org/support/topic/perfect-420/\" rel=\"ugc\">brandonecarr</a></p>\n</blockquote>\n<h3>Order Delivery Date for WooCommerce team promise.</h3>\n<p>Whether you are an Order Delivery Date pro user or a free version user, our support team is always there to help you. Feel free to contact us, and also, please share your review &amp; rate us a <strong>FIVE STAR rating</strong> to help fellow WordPress users try our plugins.</p>\n<p><strong>Recommended Plugin:</strong> Product Delivery Date Lite for WooCommerce &#8211; This Lets you add a delivery date selection option on the product page and more product-wise delivery options</p>\n<h3>About Us</h3>\n<p>We build WordPress plugins for WooCommerce that help store owners increase their sales. We have a portfolio of <a href=\"https://www.tychesoftwares.com/premium-woocommerce-plugins/\" rel=\"nofollow ugc\">12+ Premium WooCommerce plugins with a highly focused niche</a>. We are committed to providing top-notch services to our customers through our products &amp; team.</p>\n<p><a href=\"https://www.tychesoftwares.com/store/premium-plugins/all-pass-access/\" rel=\"nofollow ugc\">Get Access To All Our Plugins</a></p>\n",
        "installation": "<p>Option 1:</p>\n<ol>\n<li>Go to WordPress Dashboard-&gt;Plugins-&gt;Add New</li>\n<li>Search Order Delivery Date for WooCommerce plugin using search option</li>\n<li>Find the plugin and click Install Now button</li>\n<li>After installation, click on Activate Plugin link to activate the plugin.</li>\n</ol>\n<p>Option 2:</p>\n<ol>\n<li>Download the plugin order-delivery-date-for-woocommerce.zip</li>\n<li>Unpack the order-delivery-date-for-woocommerce.zip file and extract the order-delivery-date-for-woocommerce folder</li>\n<li>Upload the plugin folder to your /wp-content/plugins/ directory</li>\n<li>Go to WordPress dashboard, click on Plugins from the menu</li>\n<li>Locate the Order Delivery Date for WooCommerce plugin and click on Activate link to activate the plugin.</li>\n</ol>\n<p>Option 3:</p>\n<ol>\n<li>Download the plugin order-delivery-date-for-woocommerce.zip</li>\n<li>Go to WordPress Dashboard-&gt;Plugins-&gt;Add New</li>\n<li>Click on Upload Plugin link from top</li>\n<li>Upload the downloaded order-delivery-date-for-woocommerce.zip file and click on Install Now</li>\n<li>After installation, click on Activate Plugin link to activate the plugin.</li>\n</ol>\n",
        "changelog": "<p>= 3.23.0 (16.10.2024)<br />\n* Supporting code changes for the Trial Version of Order Delivery Date Pro for WooCommerce.</p>\n<h4>3.22.0 (30.07.2024)</h4>\n<ul>\n<li>Fix &#8211; Resolved warning error on the checkout page.</li>\n<li>Fix &#8211; Addressed issue where language change on plugin activation forced some order statuses to be translated incorrectly.</li>\n<li>Fix &#8211; Fixed The &#8220;As soon as possible&#8221; option was not appears first in the dropdown list.</li>\n<li>Fix &#8211; Fixed fatal error when untrashing a post from the site.</li>\n<li>Fix &#8211; Fixed &#8220;Uncaught Missing instance data for this datepicker&#8221; error.</li>\n<li>Fix &#8211; Corrected issue where the delivery date was reverting to the previously selected date on the cart block page.</li>\n<li>Fix &#8211; Resolved conflict issues with Gravity Form fields.</li>\n<li>Fix &#8211; Fixed the &#8220;selected timeslot has expired&#8221; error on the checkout page when the Divi theme is active.</li>\n<li>Fix &#8211; Addressed compatibility issues with the Bakery WordPress theme.</li>\n</ul>\n<h4>3.21.1 (03.04.2024)</h4>\n<ul>\n<li>Fix &#8211; Cross Site Request Forgery (CSRF) vulnerability.</li>\n<li>Tweak &#8211; Update compatibility with WordPress 6.5</li>\n<li>Tweak &#8211; Update compatibility with WooCommerce 8.7</li>\n</ul>\n<h4>3.21.0 (20.02.2024)</h4>\n<ul>\n<li>Fix &#8211; Unable to sort the delivery dates on WooCommerce Order page.</li>\n<li>Fix &#8211; Locked out date was not getting released when a date is changed in the admin order edit page.</li>\n<li>Fix &#8211; The delivery calendar was not responsive if &#8220;Number of Months&#8221; set to 2.</li>\n<li>Fix &#8211; Added Compatibility with cart and checkout block pages.</li>\n<li>Fix &#8211; The delivery date was missing on order received page and in order email when the order is placed with autopopulate delivary date.</li>\n<li>Fix &#8211; The delivery calender was not appearing when holiday name contains double quotes.</li>\n<li>Fix &#8211; Cross Site Request Forgery (CSRF) vulnerability.</li>\n</ul>\n<h4>3.20.2 (23.09.2023)</h4>\n<ul>\n<li>Tweak: Modified the setting sections labels to make them user friendly. </li>\n</ul>\n<h4>3.20.1 (02.08.2023)</h4>\n<ul>\n<li>Fix: A vulnerability issue was found when filtering the orders based on delivery date on WooCommerce orders page.</li>\n</ul>\n<h4>3.20.0 (11.07.2023)</h4>\n<ul>\n<li>Enhancement: Added a setting &#8216;Show filters on order listing page&#8217; to display filter dropdown based on delivery dates on WooCommerce orders page.</li>\n</ul>\n<h4>3.19.0 (29.11.2022)</h4>\n<ul>\n<li>Enhancement: Plugin has been made compatible with WooCommerce HPOS.</li>\n<li>Fix: The delivery date field was not being validated even though made mandatory.</li>\n</ul>\n<h4>3.18.0 (20.09.2022)</h4>\n<ul>\n<li>Enhancement &#8211; Added a new date format d-m-Y. Props to @joostvanderzanden.</li>\n<li>Tweak &#8211; Added an order_id parameter to &#8216;orddd_after_timeslot_update&#8217; action so other plugins can use it.</li>\n<li>Fix &#8211; When creating an order manually from the backend, the delivery date field would remain disabled and would not allow to add a delivery date. This has been fixed now.</li>\n<li>Fix &#8211; Time slots were not coming up for the first available delivery date on the delivery calendar. This has been fixed now.</li>\n<li>Fix – It was not allowing admin to edit the checkout page with Elementor when our plugin is active. This has now been fixed.</li>\n</ul>\n<h4>3.17.3 (09.05.2022)</h4>\n<ul>\n<li>Fix &#8211; Cut-off time error was appearing on checkout page when &#8216;Select Time slot&#8217; or &#8216;Timeslot Not Available&#8217; is chosen.</li>\n</ul>\n<h4>3.17.2 (05.05.2022)</h4>\n<ul>\n<li>Fix &#8211; Cut-off time error was appearing on checkout page when plugin was not used and no date sent.</li>\n</ul>\n<h4>3.17.1 (29.04.2022)</h4>\n<ul>\n<li>Fix &#8211; Cut-off time error was appearing on checkout page for valid dates when no timeslot was enabled.</li>\n</ul>\n<h4>3.17.0 (26.04.2022)</h4>\n<ul>\n<li>Fix &#8211; is_ajax deprecated error was removed on checkout page and cart page</li>\n<li>Fix &#8211; Delivery date field placeholder text was not appearing on the checkout page.</li>\n<li>Fix &#8211; Wrong delivery date was appearing on orders page when order was created in the admin side.</li>\n<li>Fix &#8211; Word &#8220;Array&#8221; was appearing when delivery date field label is blank.</li>\n<li>Fix &#8211; Was not able to save delivery date while editing orders created in the admin side or editing orders not having a delivery date.</li>\n<li>Fix &#8211; Word &#8220;Array&#8221; was appearing in the PDF invoice generated by &#8220;Invoice for WooCommerce&#8221; plugin when location field label is blank.</li>\n<li>Fix &#8211; Was able to place orders when cut-off time for delivery date or delivery time slot was reached. Fixed it by adding a error message when cut-off time is expired.</li>\n<li>Tweak &#8211; Added an option to enable/disable adding of delivery date/time column in the orders page in the admin. Also added an option to sort the orders based on delivery date/time by default.</li>\n</ul>\n<h4>3.16.1 (08.02.2022)</h4>\n<ul>\n<li>Fix &#8211; Delivery date field was not working after updating to WordPress 5.9</li>\n<li>Fix &#8211; Delivery date field was displayed on checkout for virtual products even when &#8216;Disable the Delivery Date and Time Slot Fields for: Virtual Products&#8217; setting was enabled.</li>\n</ul>\n<h4>3.16.0 (21.09.2021)</h4>\n<ul>\n<li>Dev &#8211; Removed the hidden input fields and sent the data to JS through wp_localize_script.</li>\n<li>Dev &#8211; Created template structure for the delivery date &amp; time fields.</li>\n<li>Fix &#8211; Preview theme calendar not come as per First day of week is selected. This has been fixed.</li>\n<li>Fix &#8211; We have updated .pot file for missing string translations.</li>\n<li>Fix &#8211; &amp;nbsp text appeared in the Shipping Days Settings section. This has been fixed.</li>\n</ul>\n<h4>3.15.1 (03.09.2021)</h4>\n<ul>\n<li>Fix &#8211; Number of dates was getting blocked after updating the plugin to v3.15.0. This has been fixed.</li>\n</ul>\n<h4>3.15.0 (31.08.2021)</h4>\n<ul>\n<li>Enhancement &#8211; Added new settings to add multiple time-slots and bulk time-slots.</li>\n</ul>\n<h4>3.14.0 (10.08.2021)</h4>\n<ul>\n<li>Enhancement &#8211; Added a new setting to apply colors to the delivery calendar.</li>\n<li>Enhancement &#8211; Added <code>Screen Reader</code> accessibility to read the calendar.</li>\n<li>Fix &#8211; The auto populated delivery date was not getting translated. This has been fixed.</li>\n</ul>\n<h4>3.13.0 (28.07.2021)</h4>\n<ul>\n<li>Enhancement &#8211; Added a meta box to edit delivery date and delivery time on the edit order page.</li>\n<li>Fix &#8211; Time slot charges were not getting applied on the cart page. This has been fixed.</li>\n<li>Fix &#8211; Delivery timeslot was not appearing in invoice pdf generated WooCommerce PDF Invoices &amp; Packing Slips plugin. This has been fixed.</li>\n</ul>\n<h4>3.12.0 (13.07.2021)</h4>\n<ul>\n<li>Enhancement &#8211; Displays the order delivery date and time on the edit order page. Earlier delivery date and time were only displayed in the custom fields.</li>\n<li>Fix &#8211; Customers were able to choose (type) past delivery date in the date-picker field. This has been fixed.</li>\n<li>Fix &#8211; Added a filter “orddd_is_holidays_excluded_from_dates_to_choose” that will not include holiday days in the Number of dates to choose.</li>\n<li>Fix &#8211; Maximum Order Deliveries per time slot was not working. This has been fixed.</li>\n</ul>\n<h4>3.11.9 (27.01.2021)</h4>\n<ul>\n<li>Fix &#8211; The time slot dropdown remained disabled when the checkout page was loaded for the first time and the date was auto-populated.</li>\n</ul>\n<h4>3.11.8 (22.01.2021)</h4>\n<ul>\n<li>Fix &#8211; The first available date was getting selected on every page load even though another dat was selected.</li>\n<li>Fix &#8211; The selected time slot on cart page was not passed to checkout page.</li>\n</ul>\n<h4>3.11.7 (19.01.2021)</h4>\n<ul>\n<li>Fix &#8211; First available day was coming a day later when minimum delivery time was set and a holiday was added.</li>\n<li>Fix &#8211; Fixed the warning coming on checkout page when the current date was set as holiday.</li>\n</ul>\n<h4>3.11.6 (15.01.2021)</h4>\n<ul>\n<li>Tweak &#8211; The minimum delivery time can be set in decimals.</li>\n<li>Fix &#8211; Fatal error was displayed when installing plugin with PHP v7.3.x</li>\n</ul>\n<h4>3.11.5 (12.01.2021)</h4>\n<ul>\n<li>Fix &#8211; &#8216;Select a time slot&#8217; &amp; &#8216;As soon as Possible&#8217; string were not present in the .po files.</li>\n<li>Fix &#8211; Saving empty holidays removed all the holidays from the settings.</li>\n</ul>\n<h4>3.11.4 (28.10.2020)</h4>\n<ul>\n<li>Fix &#8211; The minimum delivery time was not calculated correctly when some of the weekdays were disabled.</li>\n</ul>\n<h4>3.11.3 (12.10.2020)</h4>\n<ul>\n<li>Fix &#8211; The checkout page went into infinite loop when the current day was disabled in the settings.</li>\n<li>Fix &#8211; &#8216;jQuery.selectWoo is an undefined function&#8217; error was coming in the console for some themes.</li>\n<li>Fix &#8211; The &#8216;Auto-populate first available Delivery date&#8217; setting was not getting disabled.</li>\n<li>Fix &#8211; The selected delivery date was showing as “NaN Undefined, NaN” when we translate the checkout page from the Google chrome.</li>\n</ul>\n<h4>3.11.2 (11.09.2020)</h4>\n<ul>\n<li>Fix &#8211; The first available date was coming wrong when the &#8216;Apply Minimum Delivery Time for non working weekdays&#8217; setting was enabled.</li>\n<li>Fix &#8211; Minimum Delivery time was not being calculated on the time slots.</li>\n<li>Fix &#8211; Wrong date was being auto-populated on checkout page.</li>\n</ul>\n<h4>3.11.1 (04.09.2020)</h4>\n<ul>\n<li>Fix &#8211; &#8216;Array&#8217; word was being displayed in the order emails.</li>\n<li>Fix &#8211; The delivery date field was not placed correctly when the setting &#8216;Field placement on the Checkout page&#8217; was set to &#8216;Between Your Order &amp; Payment Section&#8217;.</li>\n</ul>\n<h4>3.11.0 (01.09.2020)</h4>\n<ul>\n<li>Feature &#8211; Ability to add time slots for weekdays. You can now add time slots with maximum order deliveries per time slot, time slot charges.</li>\n<li>Feature &#8211; Ability to block time slots for dates or weekdays.</li>\n<li>Fix &#8211; Fixed the error coming with WordPress 5.5.</li>\n</ul>\n<h4>3.10.1 (20.03.2020)</h4>\n<ul>\n<li>Update compatibility with WooCommerce 4.0.0.</li>\n</ul>\n<h4>3.10 (20.08.2019)</h4>\n<ul>\n<li>Changes in code to make the plugin compliant as per WPCS rules.</li>\n</ul>\n<h4>3.9 (23.07.2019)</h4>\n<ul>\n<li>Feature &#8211; You can now set a range of dates as holidays.</li>\n<li>Feature &#8211; You can now block the holidays for future years too. A checkbox named ‘Allow Recurring’ is added which if checked while adding holidays, it will disable the dates for all years in the calendar.</li>\n<li>Bug Fix &#8211;  Delivery Date calendar was not working on the checkout page with the Prohauz child theme. This is fixed now. </li>\n<li>Bug Fix &#8211; Number of dates available in the calendar was one less than the value set for the &#8220;Number of Dates to choose&#8221; option. This is fixed now. </li>\n</ul>\n<h4>3.8.1 (22.04.2019)</h4>\n<ul>\n<li>Fixed a warning that was appearing on Dashboard for some stores after the last update.</li>\n<li>Removed unwanted code that was being executed on plugin update.</li>\n</ul>\n<h4>3.8 (15.04.2019)</h4>\n<ul>\n<li>We have done code refactoring by removing unwanted code &amp; use of global variables where it was no longer required.</li>\n<li>We have implemented use of wp_cache_get &amp; wp_cache_set functions.</li>\n</ul>\n<h4>3.7 (04.04.2019)</h4>\n<p>There are some bug fixes in this update:<br />\n* Incorrect delivery date was preselected in the delivery calendar on the checkout page when the current date is set as a holiday. This is fixed now.<br />\n* Preview calendar width was not coming proper on the Appearance link in Order Delivery Date -&gt; Settings when the Eggplant calendar theme was selected. This is fixed now.<br />\n* Incorrect delivery date was preselected in the delivery calendar on the checkout page when the available dates have booked dates in between along with some weekdays disabled. This is fixed now.<br />\n* Incorrect delivery date was preselected on the checkout page due to the delivery date being stored in the session. This is fixed now.<br />\n* Width of the Delivery date field on the cart page was not proper. This is fixed now.<br />\n* On changing the first day of the week from Appearance link, the changes were not reflected in the admin calendars from the plugin. This is fixed now.<br />\n* WooCommerce Orders are not sorted in the descending order when &#8220;Sort on WooCommerce Orders Page&#8221; option is checked. This is fixed now.</p>\n<h4>3.6.1 (14.02.2019)</h4>\n<p>There are 3 bug fixes in this update:<br />\n* All holidays were getting deleted through bulk options even when only certain hoildays were marked.<br />\n* Changes made under Appearance -&gt; Editor submenu were not getting updated when Order Delivery Date lite plugin was active.<br />\n* &#8220;Apply Minimum Delivery Time for non working weekdays&#8221; option was not working for holidays.</p>\n<h4>3.6 (03.07.2018)</h4>\n<p>There are some enhancements and some bug fixes in this update which are mentioned below:<br />\n* Enhancements:<br />\n* A new dismissible notice is added in the WordPress admin, which provides an option to allow usage tracking of the non-sensitive data of our plugin from the website.<br />\n* A new FAQ &amp; Support menu is added to Order Delivery Date menu in admin dashboard which lists the top 10 frequently asked questions. This helps you to resolve your queries in a more faster way if they are already been answered or you can simply contact our Support team with the contact details provided.<br />\n* A Welcome page is added which will be shown on installation or updating of the plugin. It explains some exciting features or some new features in brief.<br />\n* A survey is added on deactivation of the plugin which helps us to know why is plugin is being or not used. This helps in improvising the plugin functionalities.<br />\n* Bug Fixes:<br />\n* Delivery Date information was not displayed in the Packing slips and the Invoices of the freshly installed WooCommerce PDF Invoices &amp; Packing Slips plugin. This is fixed now.<br />\n* Some strings were not translated using the .po files. This is fixed now.<br />\n* Delivery Date field was shown on the checkout page even when the featured variable product is added to the cart. This is fixed now.<br />\n* Wrong delivery date was auto-populated on the checkout page when the first available delivery date is set to a holiday. This is fixed now.<br />\n* Wrong delivery date was auto-populated on the checkout page where the Minimum Delivery time calculation was not done for non-working days when &#8216;Apply Minimum Delivery Time for non working weekdays&#8217; setting is enabled. This is fixed now.<br />\n* When holidays are deleted, the page was redirected to the Date Settings tab whereas it should stay on Holidays page itself. This is fixed now.<br />\n* Some warnings are fixed in the debug.log file.<br />\n* Some links shown on the welcome page are modified.</p>\n<h4>3.5 (23.05.2018)</h4>\n<ul>\n<li>The plugin is now GDPR compliant.</li>\n<li>Delivery Date &amp; Time for the orders will now be exported to the User&#8217;s Personal Data from the Tools -&gt; Export Personal Data menu.</li>\n<li>A warning was displayed on the checkout page when Minimum delivery time is set to blank. This is fixed now.</li>\n<li>Some notices are fixed in debug.log file.</li>\n</ul>\n<h4>3.4.2 (22.02.2018)</h4>\n<ul>\n<li>Additional columns &#8220;Fecha Horneada&#8221; and &#8220;Encargado&#8221; were added on the WooCommerce Edit order page when the plugin is updated to version 3.4.1. </li>\n</ul>\n<h4>3.4.1 (17.02.2018)</h4>\n<ul>\n<li>The language slug of Abandon Cart Lite was being used at many places. Fixed that.</li>\n<li>The UTM link of AbandonedCartLitePlugin was being used on some links, changed that.</li>\n<li>Updated compatibility with latest WooCommerce 3.3.x</li>\n</ul>\n<h4>3.4 (24.01.2018)</h4>\n<ul>\n<li>Auto-populate will be enabled by default for all new plugin installations. This will help in selecting the first available delivery date automatically on the checkout page.</li>\n<li>Delivery Date was coming incorrect when the option &#8220;Apply Minimum Delivery Time for non working weekdays&#8221; was enabled. This has been fixed.</li>\n</ul>\n<h4>3.3.1 (28.12.2017)</h4>\n<p>*A warning is fixed which was displayed when the plugin is activated.</p>\n<h4>3.3 (28.12.2017)</h4>\n<ul>\n<li>The delivery date field label was not coming properly on the checkout page. This is fixed now.</li>\n<li>Delivery weekdays were not getting deleted when the plugin is deleted. This is fixed now. </li>\n<li>Some errors in the debug.log file are fixed. </li>\n</ul>\n<h4>3.2 (06.09.2017)</h4>\n<ul>\n<li>A new language &#8216;Persian&#8217; is added for the calendar. Now you can set your Delivery Calendar in the Persian language on the Checkout Page.</li>\n<li>Some strings were not translated using the .po files. This is fixed now.</li>\n</ul>\n<h4>3.1 (20.07.2017)</h4>\n<ul>\n<li>You can add the Delivery Date field on the WooCommerce Cart page along with the Checkout page. A checkbox is added for this under Appearance tab.</li>\n<li>The selected Delivery Date will be retained until the order is placed.</li>\n</ul>\n<h4>3.0 (06.07.2017)</h4>\n<ul>\n<li>Fix &#8211; Delivery Calendar was not working on the checkout page when &#8216;Number of dates to choose&#8217; setting is set to &#8216;0&#8217;. This is fixed now. </li>\n</ul>\n<h4>2.9 (31.03.2017)</h4>\n<ul>\n<li>Fix &#8211; Warnings were displayed on the Order Received page with WooCommerce version 3.0.0. This is fixed now.</li>\n</ul>\n<h4>2.8 (17.03.2017)</h4>\n<ul>\n<li>Feature &#8211; From now you can set holidays on the dates you do not deliver products under Holidays tab. Selected holidays will be disabled for delivery in the delivery calendar on the checkout page.</li>\n<li>Feature &#8211; A new checkbox named &#8220;Auto-populate first available Delivery date&#8221; is added in Date Settings tab. If this checkbox is enabled then the first available Delivery Date will be Auto-populated in the Delivery Date field on the Checkout Page.</li>\n<li>Feature &#8211; A new checkbox named &#8220;Apply Minimum Delivery Time for non-working weekdays&#8221; is added under Date Settings tab. If this checkbox is checked then the Minimum Delivery Time (in hours) will be calculated on the non-working days which are unchecked under Delivery Days. If the checkbox is unchecked then the minimum delivery time will be calculated on the working days. The default value of the checkbox is checked when the plugin is updated.</li>\n</ul>\n<h4>2.7 (07.11.2016)</h4>\n<ul>\n<li>The delivery date selected on the checkout page can now be cleared without refreshing the checkout page.</li>\n<li>The calendar was not working on the checkout page when Field note text has line breaks. There was an error in the console as &#8220;Unexpected token&#8221;. This is fixed now.</li>\n<li>If the first available delivery date is disabled for delivery then number of days to choose is not working properly in the calendar. This is fixed now.</li>\n</ul>\n<h4>2.6 (16.09.2016)</h4>\n<ul>\n<li>\n<p>From now on the Delivery Date can be enabled or disabled for capturing the delivery date. A checkbox named as &#8216;Enable Delivery Date&#8217; is added in the Date Settings tab.</p>\n<p>The default value of this setting is disabled, which when enabled will allow clients to capture the         Delivery Date for an order on the checkout page.</p>\n</li>\n<li>\n<p>The Delivery Date field can also be disabled for Virtual and Featured products on the checkout page.</p>\n<p>A setting named &#8216;Disable the Delivery Date Field for&#8217; is added in the Appearance tab. The default       value for both the checkboxes is disabled. When a checkbox named &#8216;Virtual Products&#8217; is enabled then         the delivery date field will be disabled for only virtual products.</p>\n<p>When a checkbox &#8216;Featured Products&#8217; is enabled then the delivery date field will be disabled for        only featured products.</p>\n</li>\n<li>A notice will be displayed when the Order Delivery Date for WooCommerce plugin is activated but the WooCommerce plugin is deactivated or it is not installed. The plugin will be deactivated automatically.</li>\n<li>The width of the Delivery Date field will be the same as that of the other fields on the checkout page.</li>\n<li>Calendar was not working on the checkout page when Impreza theme was active.</li>\n<li>The cursor for the Delivery Date field will be text instead of a pointer.</li>\n</ul>\n<h4>2.5 (11.07.2016)</h4>\n<ul>\n<li>The Delivery dates will now be freed up when an order is cancelled, refunded, failed or trashed.</li>\n<li>Calendar was not showing up on iPhone 6+ when the Delivery Date field was selected. Instead, it would only show when the delivery date field label was clicked. This is fixed now.</li>\n</ul>\n<h4>2.4 (03.06.2016)</h4>\n<ul>\n<li>A new language &#8220;Hebrew&#8221; is added for the calendar. Now you can set your Delivery Calendar in the Hebrew language on the Checkout Page.</li>\n<li>&#8216;Delivery date in the Shipping Section&#8217; setting in the Appearance tab is now renamed to &#8216;Field placement on the Checkout page&#8217;. It will allow the Delivery Date field to be displayed in Billing Section, Shipping Section, before Order notes or after Order notes on the checkout page.</li>\n<li>The plugin is now using the jquery libraries available in WordPress core instead of the googleapis.com.</li>\n<li>The notice &#8220;Minimum Delivery time (in days) will now be calculated in hours which is from current WordPress time. To keep the functionality of our plugin intact at your site, we have added +24 hours to the &#8216;Minimum Delivery time (in hours)&#8217; setting.&#8221; is made dismissible now.</li>\n<li>A warning was displayed in the admin and on the front-end pages when the both Order Delivery Date Pro and Order Delivery Date Lite is activated together.</li>\n<li>The update notice &#8216;Order Delivery Date for WooCommerce Plugin needs to update your database&#8217; appears even when the plugin is re-installed. The notice should not come once the database is already updated. This is fixed now.</li>\n</ul>\n<h4>2.3 (19.04.2016)</h4>\n<ul>\n<li>Calendar next and previous arrows were not displayed correctly with the Galleria theme on the checkout page. This is fixed now.</li>\n<li>Delivery Date was not displayed on the invoice and packing list due to a hook being deprecated from WooCommerce Print Invoices/Packing Lists plugin. This issue is fixed now.</li>\n<li>A deprecated hook was used to add the Delivery Date value in customer notification email. This is fixed now.</li>\n<li>Calendar weekdays were overlapping in the calendar on the checkout page when the &#8220;Number of Months&#8221; was set to 2. This is fixed now.</li>\n<li>Delivery Dates were not translated on the Order Received page, My Account page and WooCommerce -&gt; Orders page when date language is set to Dutch-Belgian. This is fixed now.</li>\n</ul>\n<h4>2.2 (18.02.2016)</h4>\n<ul>\n<li>The Delivery Date field label, field placeholder text and the field note text in Order Delivery Date -&gt; Appearance can now be translated with WPML plugin.</li>\n<li>Until now, only admin user was able to access the Order Delivery Date settings page. From this update, users with the role &#8216;Shop manager&#8217; will be able to access and edit the Order Delivery Date settings.</li>\n<li>The calendar was not appearing on the checkout page when clicked on the Delivery Date field on the checkout page. This issue is specific to the &#8216;Stockholm&#8217; theme. This is fixed now.</li>\n</ul>\n<h4>2.1 (23.01.2016)</h4>\n<ul>\n<li>The jQuery Calendar on the checkout page will now appear with a Flat Design. The CSS file for the Flat Design is used from the WP Datepicker Styling plugin on Github: https://github.com/stuttter/wp-datepicker-styling</li>\n<li>The time sliders were not displayed on the admin product page for auction product type from the &#8220;WooCommerce Simple Auctions&#8221; plugin. This is fixed now.</li>\n</ul>\n<h4>2.0 (28.11.2015)</h4>\n<ul>\n<li>A checkbox is added on the Date settings tab to prevent the default sorting of the orders (in descending order) on the WooCommerce -&gt;Orders page when the Delivery Date field is visible. </li>\n</ul>\n<h4>1.9 (20.11.2015)</h4>\n<ul>\n<li>A new &#8216;Appearance&#8217; tab is added on the settings page where admin will be able to\n<ul>\n<li>Change the label, placeholder text for the Delivery Date field on the checkout page.</li>\n<li>To choose different language in the delivery calendar from 62 available languages. </li>\n<li>Date format for the Delivery Date can be changed.</li>\n<li>To set the 1st day of the week on the delivery date calendar.</li>\n<li>Field note text can be changed.</li>\n<li>Number of months to be shown on the calendar can be selected to maximum 2.</li>\n<li>The delivery date field can be set to shown in the Shipping section instead of always showing in the Billing section on the checkout page.</li>\n<li>Choose different theme for the delivery calendar to match with the theme of the website.</li>\n</ul>\n</li>\n<li>From this update, sorting of orders will be done based on Delivery Date on the WooCommerce-&gt; Order page.<br />\nYou will need to update the database for sorting the previous orders from the notice displayed after updating the plugin.</li>\n</ul>\n<p>Note: Please take a back up before updating this version.</p>\n<h4>1.8 (26.10.2015)</h4>\n<ul>\n<li>The Minimum Delivery time (in days) feature will now be replaced with Minimum Delivery time (in hours) Feature. When the plugin will be updated, the existing value will be multiplied with 24 hours and more 24 hours will be added to it, which will keep your setting intact.</li>\n<li>Plugin will have some default settings when it is installed for the first time.</li>\n<li>Order Delivery Date for WooCommerce (Lite version) is now compatible with Order Delivery Date Pro for WooCommerce plugin. </li>\n</ul>\n<h4>1.7.1 (19.10.2015)</h4>\n<ul>\n<li>The order was placed without selecting delivery date on the checkout page even if the Delivery Date field is mandatory. This is fixed now.</li>\n</ul>\n<h4>1.7 (06.10.2015)</h4>\n<ul>\n<li>A new setting is being added named as &#8216;Lockout date after X orders&#8217; which allows to block the dates for further deliveries after X number of orders.</li>\n<li>The plugin is now compatible with 3rd party plugins like:\n<ul>\n<li>WooCommerce Print Invoice &amp; Delivery Note</li>\n<li>WooCommerce PDF Invoices &amp; Packing Slips</li>\n<li>WooCommerce Customer/Order CSV Export</li>\n<li>WooCommerce Print Orders</li>\n<li>WooCommerce Print Invoice/Packing list</li>\n</ul>\n</li>\n<li>Delivery Date field on the checkout page has been made readonly preventing manual editing.</li>\n</ul>\n<h4>1.6 (01.07.2015)</h4>\n<ul>\n<li>The jQuery UI version has been updated to 1.10.4. The old version was throwing a Javascript error in some pages in the WordPress Admin.</li>\n</ul>\n<h4>1.5 (24.06.2015)</h4>\n<ul>\n<li>The plugin fields in admin have been restructured. We are now using the WordPress Settings API for all the plugin fields in admin.</li>\n<li>We have included .po, .pot and .mo files in the plugin. The plugin strings can now be translated to any language using these files.</li>\n</ul>\n<h4>1.4 (04.04.2015)</h4>\n<ul>\n<li>We have added a new setting &#8216;Mandatory field?&#8217; in the admin dashboard, which will allow the Delivery Date field to be set as mandatory on the checkout page.</li>\n</ul>\n<h4>1.3 (12.12.2014)</h4>\n<ul>\n<li>The delivery date will be displayed on the My Account page&#8217;s View Order page.</li>\n<li>The delivery date settings were getting reset for some customers, this has been fixed.</li>\n<li>The delivery date will be added to the email notification received by the customer on placing the order.</li>\n<li>The delivery date is attached to the customer invoice too.</li>\n</ul>\n<h4>1.2 (18.11.2014)</h4>\n<ul>\n<li>On deactivating the plugin, all the settings were getting reset. This has been fixed. Now on deactivating the plugin, the settings will stay intact.</li>\n</ul>\n<h4>1.1 (12.11.2014)</h4>\n<ul>\n<li>You can set which weekdays you want the delivery service to be available.</li>\n<li>You can set the Minimum delivery time (in Days). Enter the minimum number of days it takes for you to deliver an order.</li>\n<li>You can set the number of dates to be available for the customers to choose the delivery date.</li>\n<li>A column on the Orders page will be created where the delivery date will be displayed.</li>\n</ul>\n<h4>1.0 (16.08.2012)</h4>\n<ul>\n<li>Initial release.</li>\n</ul>\n"
    },
    "short_description": "Let customers choose delivery dates &amp; times on checkout. Simplify delivery management by blocking holidays &amp; setting max deliveries per day.",
    "description": "<p>The Best FREE WordPress Delivery Date &amp; Time Plugin</p>\n<p>The Order Delivery Date for WooCommerce Lite is a FREE plugin that helps you to give your customer the power of selecting order delivery date &amp; time during the WooCommerce checkout.</p>\n<p>44% of consumers say that they will likely become repeat buyers after a personalized shopping experience with a particular company. With the Order Delivery Date lite version, you can deliver a personalized shopping experience where the user can pick a delivery date and time at their convenience. As a WooCommerce store owner, you can easily manage your delivery and utilize the time to grow your business.</p>\n<p><strong>What if you can get better features for less money? &#8211;<a href=\"https://www.tychesoftwares.com/products/woocommerce-order-delivery-date-pro-plugin-trial/?utm_source=wprepo&amp;utm_medium=descriptionlink&amp;utm_campaign=OrderDeliveryDateLite\" rel=\"nofollow ugc\">Try Order Delivery Date PRO for just $1</a></strong></p>\n<h3>Order Delivery Date for WooCommerce Lite Features</h3>\n<p>The Order Delivery Date for WooCommerce lite version gives you <strong>20+ features!</strong></p>\n<p>Add products to the cart and experience how the Order delivery date works- <a href=\"https://app.instawp.io/launch?t=order-delivery-date-pro-for-woocommerce&amp;d=v1\" rel=\"nofollow ugc\">Live Demo</a>.</p>\n<p>Also, Use and become familiar with the admin dashboard controls- <a href=\"https://app.instawp.io/launch?t=order-delivery-date-pro-for-woocommerce&amp;d=v1\" rel=\"nofollow ugc\">Admin Demo</a>.</p>\n<p><strong>While the lite has 20+ features, the Order Delivery Date Pro has 50+ features. <a href=\"https://www.tychesoftwares.com/products/woocommerce-order-delivery-date-pro-plugin-trial/?utm_source=wprepo&amp;utm_medium=litefeatureslink&amp;utm_campaign=OrderDeliveryDateLite\" rel=\"nofollow ugc\">Unlock all the PRO features for just $1 with our trial offer</a>.</strong></p>\n<p>Here are the Order Delivery Date for WooCommerce lite features:</p>\n<p><strong>Flexible Delivery Date Selection Options</strong></p>\n<ul>\n<li>Allow customers to select a delivery date on the checkout page.</li>\n<li>Disable the weekdays on which you do not deliver products.</li>\n<li>The minimum required time for delivery can be set in hours.</li>\n<li>Set the delivery date field mandatory on the checkout page.</li>\n<li>Auto-populate the first available delivery date &amp; time selection in the delivery date and time fields, respectively on the checkout page.</li>\n<li>Set delivery date field labels as per your business requirements. </li>\n<li>Disable delivery for Virtual and Featured products.   </li>\n</ul>\n<p><strong>Easy to Manage Delivery Options</strong></p>\n<ul>\n<li>Capture delivery time slot along with the delivery date.</li>\n<li>Add multiple time slots individually in one go.</li>\n<li>Add time slots in bulk with a fixed duration &amp; interval.</li>\n<li>Capture Delivery Date &amp; Time on cart page along with checkout page.</li>\n<li>Change the look of the delivery calendar by selecting the color code.</li>\n</ul>\n<p><strong>Conditional Based Delivery Date Selection Options</strong></p>\n<ul>\n<li>Set Maximum Deliveries per day by Orders  </li>\n<li>Limit the number of orders to be placed per day.</li>\n<li>Block a deliverable time slot for a date or weekday.</li>\n<li>Set holidays on the dates you do not deliver products.</li>\n</ul>\n<p><strong>Friendly Admin Controls</strong></p>\n<ul>\n<li>Admin can edit delivery dates from Orders page &amp; notify the customer.</li>\n<li>Selected Delivery Date will be displayed on the WooCommerce Order page at the backend.</li>\n<li>The selected delivery date will be displayed on the WooCommerce Edit Order page in the admin dashboard.</li>\n<li>Admins can filter orders based on the delivery dates on the WooCommerce orders page.</li>\n<li>Compatible with WooCommerce HPOS.</li>\n</ul>\n<p>** <em>Want to show the delivery dates on the product page? <a href=\"https://wordpress.org/plugins/product-delivery-date-for-woocommerce-lite/\" rel=\"ugc\">Product Delivery Date LITE</a> plugin allows the customer to choose a delivery date right within the product page and add the product to the cart.</em></p>\n<h3>Here is what some of our customers say about this plugin:</h3>\n<blockquote>\n<p>I really appreciated that they answered all my questions. They are so awesome. The plugin is so perfect. Everything works fine. If I need help, they will help. The free plugin is so perfect, so the pro version is gonna be excellent too. Thank you so much.<br />\n  &#8211; sisili08R</p>\n<p>A perfect plugin, says what it does and adds the functions simply with no fuss. I even had additional support when I wanted to tweak the plugin to fit my site better. Would recommend this to everyone.<br />\n  &#8211; <a href=\"https://wordpress.org/support/topic/just-what-i-needed-and-no-fuss/\" rel=\"ugc\">creaselambert</a></p>\n<p>The plugin worked as described and is extremely well supported which is key. It works by ordering the order screen by default – latest orders first – or by the delivery date. All one has to do is use a simple checkbox to flick between their preferred methods. The plugin developer has responded to a request I had inside a few hours and resolved it very professionally. 5 stars for the plugin and its support.<br />\n  &#8211; <a href=\"https://wordpress.org/support/topic/perfect-plugin-for-delivery-date/\" rel=\"ugc\">allmyhoney</a></p>\n<p>We use this plugin for the web shop of our florist for customers to arrange deliveries Monday to Friday and on Saturday mornings. Being able to set an earlier cut off time for Saturdays (or Sundays when applicable) is great.<br />\n  &#8211; <a href=\"https://wordpress.org/support/topic/custom-cut-off-times-for-each-day/\" rel=\"ugc\">bnolan</a></p>\n</blockquote>\n<p><strong>Pro Tip:</strong> The <a href=\"https://www.tychesoftwares.com/store/premium-plugins/woocommerce-subscriptions-compatibility-addon-for-order-delivery-date-pro-for-woocommerce-plugin/\" rel=\"nofollow ugc\">WooCommerce Subscriptions Compatibility addon</a> allows you to select a delivery date based on the renewal period for the renewal orders on the checkout for manual renewals. Delivery Date &amp; Time will be automatically updated for the renewal orders if the automatic renewals are enabled</p>\n<h3>Order Delivery Date PRO</h3>\n<p>The <a href=\"https://www.tychesoftwares.com/store/premium-plugins/order-delivery-date-for-woocommerce-pro-21/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=OrderDeliveryDateLite\" rel=\"nofollow ugc\">Order Delivery Date for WooCommerce also has a PRO version</a>. In the pro version, you get additional features that take your WooCommerce store shopping experience to the next level.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/lxWCq6X6bPM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>The PRO version offers 25+ additional features along with the 20+ Lite version features.</p>\n<h3>Order Delivery Date for WooCommerce PRO key highlight features</h3>\n<ul>\n<li>2-way Synchronization of your deliveries with Google Calendar in real-time</li>\n<li>Ability to enable or disable delivery date for specific product categories</li>\n<li>Create different delivery schedules from plugins like WooCommerce Table Rate Shipping, Fedex plugin,  USPS Shipping Method Plugin by WooCommerce, etc. </li>\n<li>Ability to create delivery schedules by shipping methods, product categories &amp; shipping classes.</li>\n<li>Ability to set up recurring deliveries with WooCommerce Subscriptions plugin and Subscription compatibility add-on</li>\n<li>Customers can edit the delivery date from the My Account section</li>\n<li>Admin can filter the orders by the delivery date</li>\n<li>Display delivery date &amp; time information in the WooCommerce mobile app    </li>\n<li>Customers/Admin are notified once the delivery is rescheduled</li>\n<li>Setup same-day &amp; next-day deliveries with cut-off times</li>\n<li>Compatibility with <a href=\"https://www.tychesoftwares.com/store/premium-plugins/pickup-date-addon-order-delivery-date-woocommerce-plugin/\" rel=\"nofollow ugc\">Pickup Date Addon</a></li>\n</ul>\n<p><strong>Wondering how all these PRO features can help your store? Stop thinking and <a href=\"https://www.tychesoftwares.com/products/woocommerce-order-delivery-date-pro-plugin-trial/?utm_source=wprepo&amp;utm_medium=profeatureslink&amp;utm_campaign=OrderDeliveryDateLite\" rel=\"nofollow ugc\">try all the PRO features on your WooCommerce store with our $1 trial offer</a>.</strong></p>\n<p>You can check the entire features on our <a href=\"https://www.tychesoftwares.com/differences-pro-lite-versions-order-delivery-date-woocommerce-plugin\" rel=\"nofollow ugc\">Order Delivery Date for the WooCommerce Lite Vs. Pro comparison post</a>.</p>\n<p>Order Delivery Date PRO is helping many WooCommerce store owners <a href=\"https://www.tychesoftwares.com/reduce-woocommerce-delivery-operational-cost/\" rel=\"nofollow ugc\">reduce operational costs and improve their orders</a> .</p>\n<blockquote>\n<p>This plugin is the perfect solution for allowing your customers to tell you when they’ll be available for delivery. Especially if you’re a small business that tends directly to your customer, this plugin will allow you to ensure their happiness with their order in that they’ll know exactly when to expect their delivery. A definite 5 star rating for the plugin and a 5 star rating for the support that it comes with! Please don’t have any doubts purchasing this one! Best money you’ll ever spend!<br />\n  &#8211; <a href=\"https://wordpress.org/support/topic/perfect-420/\" rel=\"ugc\">brandonecarr</a></p>\n</blockquote>\n<h3>Order Delivery Date for WooCommerce team promise.</h3>\n<p>Whether you are an Order Delivery Date pro user or a free version user, our support team is always there to help you. Feel free to contact us, and also, please share your review &amp; rate us a <strong>FIVE STAR rating</strong> to help fellow WordPress users try our plugins.</p>\n<p><strong>Recommended Plugin:</strong> Product Delivery Date Lite for WooCommerce &#8211; This Lets you add a delivery date selection option on the product page and more product-wise delivery options</p>\n<h3>About Us</h3>\n<p>We build WordPress plugins for WooCommerce that help store owners increase their sales. We have a portfolio of <a href=\"https://www.tychesoftwares.com/premium-woocommerce-plugins/\" rel=\"nofollow ugc\">12+ Premium WooCommerce plugins with a highly focused niche</a>. We are committed to providing top-notch services to our customers through our products &amp; team.</p>\n<p><a href=\"https://www.tychesoftwares.com/store/premium-plugins/all-pass-access/\" rel=\"nofollow ugc\">Get Access To All Our Plugins</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.23.0.zip",
    "upgrade_notice": {
        "3.6 (03.07.2018)": "<p>There are some enhancements and some bug fixes in this update which are mentioned below:\n* Enhancements:\n* A new dismissible notice is added in the WordPress admin, which provides an option to allow usage tracking of the non-sensitive data of our plugin from the website.\n* A new FAQ &amp; Support menu is added to Order Delivery Date menu in admin dashboard which lists the top 10 frequently asked questions. This helps you to resolve your queries in a more faster way if they are already been answered or you can simply contact our Support team with the contact details provided. \n* A Welcome page is added which will be shown on installation or updating of the plugin. It explains some exciting features or some new features in brief. \n* A survey is added on deactivation of the plugin which helps us to know why is plugin is being or not used. This helps in improvising the plugin functionalities. \n* Bug Fixes:\n* Delivery Date information was not displayed in the Packing slips and the Invoices of the freshly installed WooCommerce PDF Invoices &amp; Packing Slips plugin. This is fixed now.\n* Some strings were not translated using the .po files. This is fixed now.\n* Delivery Date field was shown on the checkout page even when the featured variable product is added to the cart. This is fixed now.\n* Wrong delivery date was auto-populated on the checkout page when the first available delivery date is set to a holiday. This is fixed now.\n* Wrong delivery date was auto-populated on the checkout page where the Minimum Delivery time calculation was not done for non-working days when &#039;Apply Minimum Delivery Time for non working weekdays&#039; setting is enabled. This is fixed now.\n* When holidays are deleted, the page was redirected to the Date Settings tab whereas it should stay on Holidays page itself. This is fixed now.\n* Some warnings are fixed in the debug.log file.\n* Some links shown on the welcome page are modified.</p>",
        "3.5 (23.05.2018)": "<ul>\n<li>The plugin is now GDPR compliant.</li>\n<li>Delivery Date &amp; Time for the orders will now be exported to the User&#039;s Personal Data from the Tools -&gt; Export Personal Data menu.</li>\n<li>A warning was displayed on the checkout page when Minimum delivery time is set to blank. This is fixed now.</li>\n<li>Some notices are fixed in debug.log file.</li>\n</ul>",
        "3.4.2 (22.02.2018)": "<ul>\n<li>Additional columns &quot;Fecha Horneada&quot; and &quot;Encargado&quot; were added on the WooCommerce Edit order page when the plugin is updated to version 3.4.1.</li>\n</ul>",
        "3.4.1 (17.02.2018)": "<ul>\n<li>The language slug of Abandon Cart Lite was being used at many places. Fixed that.</li>\n<li>The UTM link of AbandonedCartLitePlugin was being used on some links, changed that.</li>\n<li>Updated compatibility with latest WooCommerce 3.3.x</li>\n</ul>",
        "3.4 (24.01.2018)": "<ul>\n<li>Auto-populate will be enabled by default for all new plugin installations. This will help in selecting the first available delivery date automatically on the checkout page.</li>\n<li>Delivery Date was coming incorrect when the option &quot;Apply Minimum Delivery Time for non working weekdays&quot; was enabled. This has been fixed.</li>\n</ul>",
        "3.3.1 (28.12.2017)": "<p>*A warning is fixed which was displayed when the plugin is activated.</p>",
        "3.3 (28.12.2017)": "<ul>\n<li>The delivery date field label was not coming properly on the checkout page. This is fixed now.</li>\n<li>Delivery weekdays were not getting deleted when the plugin is deleted. This is fixed now. </li>\n<li>Some errors in the debug.log file are fixed.</li>\n</ul>",
        "3.2 (06.09.2017)": "<ul>\n<li>A new language &#039;Persian&#039; is added for the calendar. Now you can set your Delivery Calendar in the Persian language on the Checkout Page.</li>\n<li>Some strings were not translated using the .po files. This is fixed now.</li>\n</ul>",
        "3.1 (20.07.2017)": "<ul>\n<li>You can add the Delivery Date field on the WooCommerce Cart page along with the Checkout page. A checkbox is added for this under Appearance tab.</li>\n<li>The selected Delivery Date will be retained until the order is placed.</li>\n</ul>",
        "3.0 (06.07.2017)": "<ul>\n<li>Fix - Delivery Calendar was not working on the checkout page when &#039;Number of dates to choose&#039; setting is set to &#039;0&#039;. This is fixed now.</li>\n</ul>",
        "2.9 (31.03.2017)": "<ul>\n<li>Fix - Warnings were displayed on the Order Received page with WooCommerce version 3.0.0. This is fixed now.</li>\n</ul>",
        "2.8 (17.03.2017)": "<ul>\n<li>Feature - From now you can set holidays on the dates you do not deliver products under Holidays tab. Selected holidays will be disabled for delivery in the delivery calendar on the checkout page.</li>\n<li>Feature - A new checkbox named &quot;Auto-populate first available Delivery date&quot; is added in Date Settings tab. If this checkbox is enabled then the first available Delivery Date will be Auto-populated in the Delivery Date field on the Checkout Page.</li>\n<li>Feature - A new checkbox named &quot;Apply Minimum Delivery Time for non-working weekdays&quot; is added under Date Settings tab. If this checkbox is checked then the Minimum Delivery Time (in hours) will be calculated on the non-working days which are unchecked under Delivery Days. If the checkbox is unchecked then the minimum delivery time will be calculated on the working days. The default value of the checkbox is checked when the plugin is updated.</li>\n</ul>",
        "2.7 (07.11.2016)": "<ul>\n<li>The delivery date selected on the checkout page can now be cleared without refreshing the checkout page.</li>\n<li>The calendar was not working on the checkout page when Field note text has line breaks. There was an error in the console as &quot;Unexpected token&quot;. This is fixed now.</li>\n<li>If the first available delivery date is disabled for delivery then number of days to choose is not working properly in the calendar. This is fixed now.</li>\n</ul>",
        "2.6 (16.09.2016)": "<ul>\n<li>From now on the Delivery Date can be enabled or disabled for capturing the delivery date. A checkbox named as &#039;Enable Delivery Date&#039; is added in the Date Settings tab.</li>\n</ul>\n\n<p>The default value of this setting is disabled, which when enabled will allow clients to capture the Delivery Date for an order on the checkout page.\n* The Delivery Date field can also be disabled for Virtual and Featured products on the checkout page.</p>\n\n<p>A setting named &#039;Disable the Delivery Date Field for&#039; is added in the Appearance tab. The default value for both the checkboxes is disabled. When a checkbox named &#039;Virtual Products&#039; is enabled then the delivery date field will be disabled for only virtual products.</p>\n\n<p>When a checkbox &#039;Featured Products&#039; is enabled then the delivery date field will be disabled for only featured products.\n* A notice will be displayed when the Order Delivery Date for WooCommerce plugin is activated but the WooCommerce plugin is deactivated or it is not installed. The plugin will be deactivated automatically.\n* The width of the Delivery Date field will be the same as that of the other fields on the checkout page.\n* Calendar was not working on the checkout page when Impreza theme was active.\n* The cursor for the Delivery Date field will be text instead of a pointer.</p>",
        "2.5 (11.07.2016)": "<ul>\n<li>The Delivery dates will now be freed up when an order is cancelled, refunded, failed or trashed.</li>\n<li>Calendar was not showing up on iPhone 6+ when the Delivery Date field was selected. Instead, it would only show when the delivery date field label was clicked. This is fixed now.</li>\n</ul>",
        "2.4 (03.06.2016)": "<ul>\n<li>A new language &quot;Hebrew&quot; is added for the calendar. Now you can set your Delivery Calendar in the Hebrew language on the Checkout Page.</li>\n<li>&#039;Delivery date in the Shipping Section&#039; setting in the Appearance tab is now renamed to &#039;Field placement on the Checkout page&#039;. It will allow the Delivery Date field to be displayed in Billing Section, Shipping Section, before Order notes or after Order notes on the checkout page.</li>\n<li>The plugin is now using the jquery libraries available in WordPress core instead of the googleapis.com.</li>\n<li>The notice &quot;Minimum Delivery time (in days) will now be calculated in hours which is from current WordPress time. To keep the functionality of our plugin intact at your site, we have added +24 hours to the &#039;Minimum Delivery time (in hours)&#039; setting.&quot; is made dismissible now.</li>\n<li>A warning was displayed in the admin and on the front-end pages when the both Order Delivery Date Pro and Order Delivery Date Lite is activated together.</li>\n<li>The update notice &#039;Order Delivery Date for WooCommerce Plugin needs to update your database&#039; appears even when the plugin is re-installed. The notice should not come once the database is already updated. This is fixed now.</li>\n</ul>",
        "2.3 (19.04.2016)": "<ul>\n<li>Calendar next and previous arrows were not displayed correctly with the Galleria theme on the checkout page. This is fixed now.</li>\n<li>Delivery Date was not displayed on the invoice and packing list due to a hook being deprecated from WooCommerce Print Invoices/Packing Lists plugin. This issue is fixed now.</li>\n<li>A deprecated hook was used to add the Delivery Date value in customer notification email. This is fixed now.</li>\n<li>Calendar weekdays were overlapping in the calendar on the checkout page when the &quot;Number of Months&quot; was set to 2. This is fixed now.</li>\n<li>Delivery Dates were not translated on the Order Received page, My Account page and WooCommerce -&gt; Orders page when date language is set to Dutch-Belgian. This is fixed now.</li>\n</ul>",
        "2.2 (18.02.2016)": "<ul>\n<li>The Delivery Date field label, field placeholder text and the field note text in Order Delivery Date -&gt; Appearance can now be translated with WPML plugin.</li>\n<li>Until now, only admin user was able to access the Order Delivery Date settings page. From this update, users with the role &#039;Shop manager&#039; will be able to access and edit the Order Delivery Date settings.</li>\n<li>The calendar was not appearing on the checkout page when clicked on the Delivery Date field on the checkout page. This issue is specific to the &#039;Stockholm&#039; theme. This is fixed now.</li>\n</ul>",
        "2.1 (23.01.2016)": "<ul>\n<li>The jQuery Calendar on the checkout page will now appear with a Flat Design. The CSS file for the Flat Design is used from the WP Datepicker Styling plugin on Github: https://github.com/stuttter/wp-datepicker-styling</li>\n<li>The time sliders were not displayed on the admin product page for auction product type from the &quot;WooCommerce Simple Auctions&quot; plugin. This is fixed now.</li>\n</ul>",
        "2.0 (28.11.2015)": "<ul>\n<li>A checkbox is added on the Date settings tab to prevent the default sorting of the orders (in descending order) on the WooCommerce -&gt;Orders page when the Delivery Date field is visible.</li>\n</ul>",
        "1.9 (20.11.2015)": "<ul>\n<li>A new &#039;Appearance&#039; tab is added on the settings page where admin will be able to\n\n<ul>\n<li>Change the label, placeholder text for the Delivery Date field on the checkout page.</li>\n<li>To choose different language in the delivery calendar from 62 available languages. </li>\n<li>Date format for the Delivery Date can be changed.</li>\n<li>To set the 1st day of the week on the delivery date calendar.</li>\n<li>Field note text can be changed.</li>\n<li>Number of months to be shown on the calendar can be selected to maximum 2.</li>\n<li>The delivery date field can be set to shown in the Shipping section instead of always showing in the Billing section on the checkout page.</li>\n<li>Choose different theme for the delivery calendar to match with the theme of the website.</li>\n</ul></li>\n<li>From this update, sorting of orders will be done based on Delivery Date on the WooCommerce-&gt; Order page.\nYou will need to update the database for sorting the previous orders from the notice displayed after updating the plugin.</li>\n</ul>\n\n<p>Note: Please take a back up before updating this version.</p>",
        "1.8 (26.10.2015)": "<ul>\n<li>The Minimum Delivery time (in days) feature will now be replaced with Minimum Delivery time (in hours) Feature. When the plugin will be updated, the existing value will be multiplied with 24 hours and more 24 hours will be added to it, which will keep your setting intact.</li>\n<li>Plugin will have some default settings when it is installed for the first time.</li>\n<li>Order Delivery Date for WooCommerce (Lite version) is now compatible with Order Delivery Date Pro for WooCommerce plugin.</li>\n</ul>",
        "1.7.1 (19.10.2015)": "<ul>\n<li>The order was placed without selecting delivery date on the checkout page even if the Delivery Date field is mandatory. This is fixed now.</li>\n</ul>",
        "1.7 (06.10.2015)": "<ul>\n<li>A new setting is being added named as &#039;Lockout date after X orders&#039; which allows to block the dates for further deliveries after X number of orders.</li>\n<li>The plugin is now compatible with 3rd party plugins like:\n\n<ul>\n<li>WooCommerce Print Invoice &amp; Delivery Note</li>\n<li>WooCommerce PDF Invoices &amp; Packing Slips</li>\n<li>WooCommerce Customer/Order CSV Export</li>\n<li>WooCommerce Print Orders</li>\n<li>WooCommerce Print Invoice/Packing list</li>\n</ul></li>\n<li>Delivery Date field on the checkout page has been made readonly preventing manual editing.</li>\n</ul>",
        "1.6 (01.07.2015)": "<ul>\n<li>The jQuery UI version has been updated to 1.10.4. The old version was throwing a Javascript error in some pages in the WordPress Admin.</li>\n</ul>",
        "1.5 (24.06.2015)": "<ul>\n<li>The plugin fields in admin have been restructured. We are now using the WordPress Settings API for all the plugin fields in admin.</li>\n<li>We have included .po, .pot and .mo files in the plugin. The plugin strings can now be translated to any language using these files.</li>\n</ul>",
        "1.4 (04.04.2015)": "<ul>\n<li>We have added a new setting &#039;Mandatory field?&#039; in the admin dashboard, which will allow the Delivery Date field to be set as mandatory on the checkout page.</li>\n</ul>",
        "1.3 (12.12.2014)": "<ul>\n<li>The delivery date will be displayed on the My Account page&#039;s View Order page.</li>\n<li>The delivery date settings were getting reset for some customers, this has been fixed.</li>\n<li>The delivery date will be added to the email notification received by the customer on placing the order.</li>\n<li>The delivery date is attached to the customer invoice too.</li>\n</ul>",
        "1.2 (18.11.2014)": "<ul>\n<li>On deactivating the plugin, all the settings were getting reset. This has been fixed. Now on deactivating the plugin, the settings will stay intact.</li>\n</ul>",
        "1.1 (12.11.2014)": "<ul>\n<li>You can set which weekdays you want the delivery service to be available.</li>\n<li>You can set the Minimum delivery time (in Days). Enter the minimum number of days it takes for you to deliver an order.</li>\n<li>You can set the number of dates to be available for the customers to choose the delivery date.</li>\n<li>A column on the Orders page will be created where the delivery date will be displayed.</li>\n</ul>",
        "1.0 (16.08.2012)": "<ul>\n<li>Initial release.</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/order-delivery-date-for-woocommerce/assets/screenshot-1.png?rev=2408224",
            "caption": "<p>The Delivery date field will be visible on checkout page, according to the settings</p>"
        },
        {
            "src": "https://ps.w.org/order-delivery-date-for-woocommerce/assets/screenshot-2.png?rev=2408224",
            "caption": "<p>Date Settings tab</p>"
        },
        {
            "src": "https://ps.w.org/order-delivery-date-for-woocommerce/assets/screenshot-3.png?rev=2408224",
            "caption": "<p>Holidays settings</p>"
        },
        {
            "src": "https://ps.w.org/order-delivery-date-for-woocommerce/assets/screenshot-4.png?rev=2408224",
            "caption": "<p>Time Slot settings</p>"
        },
        {
            "src": "https://ps.w.org/order-delivery-date-for-woocommerce/assets/screenshot-5.png?rev=2408224",
            "caption": "<p>View Time Slots table</p>"
        },
        {
            "src": "https://ps.w.org/order-delivery-date-for-woocommerce/assets/screenshot-6.png?rev=2408224",
            "caption": "<p>The selected delivery date will be shown in \"Custom Fields\" on Edit order page</p>"
        },
        {
            "src": "https://ps.w.org/order-delivery-date-for-woocommerce/assets/screenshot-7.png?rev=2454612",
            "caption": "<p>Delivery Date will be displayed on the Orders page in a new column titled \"Delivery Date\"</p>"
        }
    ],
    "tags": {
        "delivery-date": "delivery date",
        "delivery-time": "delivery time",
        "pickup-date": "pickup date",
        "preparation-time": "preparation time",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "3.23.0",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.1.0.zip",
        "1.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.1.1.zip",
        "1.2": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.1.2.zip",
        "1.3": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.1.3.zip",
        "1.4": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.1.4.zip",
        "1.5": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.1.5.zip",
        "1.6": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.1.6.zip",
        "1.7": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.1.7.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.1.7.1.zip",
        "1.8": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.1.8.zip",
        "1.9": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.1.9.zip",
        "2.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.2.0.zip",
        "2.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.2.1.zip",
        "2.2": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.2.2.zip",
        "2.3": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.2.3.zip",
        "2.4": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.2.4.zip",
        "2.5": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.2.5.zip",
        "2.6": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.2.6.zip",
        "2.7": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.2.7.zip",
        "2.8": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.2.8.zip",
        "2.9": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.2.9.zip",
        "3.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.0.zip",
        "3.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.1.zip",
        "3.10": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.10.zip",
        "3.10.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.10.1.zip",
        "3.10.2": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.10.2.zip",
        "3.11.2": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.11.2.zip",
        "3.11.3": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.11.3.zip",
        "3.11.4": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.11.4.zip",
        "3.11.5": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.11.5.zip",
        "3.11.6": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.11.6.zip",
        "3.11.7": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.11.7.zip",
        "3.11.8": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.11.8.zip",
        "3.11.9": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.11.9.zip",
        "3.12.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.12.0.zip",
        "3.13.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.13.0.zip",
        "3.14.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.14.0.zip",
        "3.15.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.15.0.zip",
        "3.15.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.15.1.zip",
        "3.16.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.16.0.zip",
        "3.16.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.16.1.zip",
        "3.17.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.17.0.zip",
        "3.17.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.17.1.zip",
        "3.17.1-1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.17.1-1.zip",
        "3.17.2": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.17.2.zip",
        "3.17.3": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.17.3.zip",
        "3.18.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.18.0.zip",
        "3.19.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.19.0.zip",
        "3.20.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.20.0.zip",
        "3.20.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.20.1.zip",
        "3.20.2": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.20.2.zip",
        "3.21.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.21.0.zip",
        "3.21.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.21.1.zip",
        "3.22.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.22.0.zip",
        "3.23.0": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.23.0.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.3.1.zip",
        "3.4": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.4.zip",
        "3.4.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.4.1.zip",
        "3.4.2": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.4.2.zip",
        "3.5": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.5.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.6.1.zip",
        "3.7": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.7.zip",
        "3.8": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.8.zip",
        "3.8.1": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.8.1.zip",
        "3.9": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.3.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/order-delivery-date-for-woocommerce.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.paypal.me/TycheSoftwares",
    "banners": {
        "low": "https://ps.w.org/order-delivery-date-for-woocommerce/assets/banner-772x250.png?rev=2379428",
        "high": "https://ps.w.org/order-delivery-date-for-woocommerce/assets/banner-1544x500.png?rev=2379428"
    },
    "icons": {
        "1x": "https://ps.w.org/order-delivery-date-for-woocommerce/assets/icon-128x128.png?rev=2379428",
        "2x": "https://ps.w.org/order-delivery-date-for-woocommerce/assets/icon-256x256.png?rev=2379428"
    },
    "blocks": {
        "order-delivery-date/delivery-date": {
            "$schema": "https://schemas.wp.org/trunk/block.json",
            "apiVersion": 2,
            "name": "order-delivery-date/delivery-date",
            "version": "1.0.0",
            "title": "Order Delivery Date",
            "category": "woocommerce",
            "parent": [
                "woocommerce/cart-items-block"
            ],
            "attributes": {
                "lock": {
                    "type": "object",
                    "default": {
                        "remove": true,
                        "move": true
                    }
                }
            },
            "textdomain": "order-delivery-date",
            "editorScript": "file:./build/cart-block.js"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 86,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "ar",
            "version": "3.22.0",
            "updated": "2020-11-08 14:19:48",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/ar.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "bg_BG",
            "version": "3.22.0",
            "updated": "2020-01-08 07:21:05",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/bg_BG.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "bs_BA",
            "version": "3.10",
            "updated": "2019-06-08 21:15:39",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.10/bs_BA.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "ca",
            "version": "3.22.0",
            "updated": "2022-07-03 10:10:22",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/ca.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "da_DK",
            "version": "3.22.0",
            "updated": "2019-02-03 14:29:37",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/da_DK.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "de_DE_formal",
            "version": "3.22.0",
            "updated": "2023-01-13 21:37:04",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/de_DE_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "de_DE",
            "version": "3.22.0",
            "updated": "2019-01-09 14:34:04",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "de_CH",
            "version": "3.22.0",
            "updated": "2019-01-09 14:33:38",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/de_CH.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "de_CH_informal",
            "version": "3.22.0",
            "updated": "2019-01-09 14:34:28",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/de_CH_informal.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "el",
            "version": "3.22.0",
            "updated": "2021-05-28 10:49:55",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/el.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "en_GB",
            "version": "3.22.0",
            "updated": "2018-12-04 09:26:07",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/en_GB.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "en_AU",
            "version": "3.22.0",
            "updated": "2018-12-04 01:53:55",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/en_AU.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "en_ZA",
            "version": "3.22.0",
            "updated": "2019-10-18 07:07:02",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/en_ZA.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "en_NZ",
            "version": "3.22.0",
            "updated": "2018-12-04 01:54:10",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/en_NZ.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "en_CA",
            "version": "3.22.0",
            "updated": "2018-12-04 09:22:44",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/en_CA.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "es_VE",
            "version": "3.22.0",
            "updated": "2019-12-10 23:12:35",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/es_VE.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "es_ES",
            "version": "3.22.0",
            "updated": "2019-07-12 07:50:49",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "es_PE",
            "version": "3.22.0",
            "updated": "2019-11-15 13:38:59",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/es_PE.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "es_MX",
            "version": "3.22.0",
            "updated": "2019-12-27 15:55:40",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/es_MX.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "es_GT",
            "version": "3.22.0",
            "updated": "2019-03-02 05:18:08",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/es_GT.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "fa_IR",
            "version": "3.22.0",
            "updated": "2018-11-11 05:10:54",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/fa_IR.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "fi",
            "version": "3.22.0",
            "updated": "2018-10-25 16:36:03",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/fi.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "fr_FR",
            "version": "3.22.0",
            "updated": "2018-11-15 15:07:16",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "gu",
            "version": "3.22.0",
            "updated": "2018-02-14 12:59:27",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/gu.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "he_IL",
            "version": "3.22.0",
            "updated": "2019-03-12 17:20:41",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/he_IL.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "hr",
            "version": "3.22.0",
            "updated": "2019-10-24 21:33:07",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/hr.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "hu_HU",
            "version": "3.22.0",
            "updated": "2019-02-26 08:15:48",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/hu_HU.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "it_IT",
            "version": "3.22.0",
            "updated": "2024-07-30 07:58:08",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "ja",
            "version": "3.22.0",
            "updated": "2018-12-24 05:57:23",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/ja.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "ko_KR",
            "version": "3.22.0",
            "updated": "2020-05-05 19:00:48",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/ko_KR.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "lt_LT",
            "version": "3.22.0",
            "updated": "2019-02-21 05:57:51",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/lt_LT.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "nl_BE",
            "version": "3.22.0",
            "updated": "2023-10-13 11:38:25",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/nl_BE.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "nl_NL_formal",
            "version": "3.22.0",
            "updated": "2024-02-25 14:51:13",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/nl_NL_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "nl_NL",
            "version": "3.22.0",
            "updated": "2023-10-13 11:30:01",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "pl_PL",
            "version": "3.22.0",
            "updated": "2022-01-13 06:56:07",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/pl_PL.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "pt_BR",
            "version": "3.22.0",
            "updated": "2019-11-14 16:46:18",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/pt_BR.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "ro_RO",
            "version": "3.22.0",
            "updated": "2021-09-17 08:43:39",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/ro_RO.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "ru_RU",
            "version": "3.22.0",
            "updated": "2018-12-09 23:36:50",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "sk_SK",
            "version": "3.22.0",
            "updated": "2019-02-09 17:56:46",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/sk_SK.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "sq",
            "version": "3.22.0",
            "updated": "2018-12-19 15:32:22",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/sq.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "sr_RS",
            "version": "3.22.0",
            "updated": "2019-01-21 09:48:58",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/sr_RS.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "sv_SE",
            "version": "3.22.0",
            "updated": "2021-10-24 11:55:47",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/sv_SE.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "tr_TR",
            "version": "3.22.0",
            "updated": "2019-01-15 03:11:27",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/tr_TR.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "uk",
            "version": "3.22.0",
            "updated": "2019-02-04 15:40:56",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/uk.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "vi",
            "version": "3.22.0",
            "updated": "2019-03-08 03:05:29",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/vi.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "zh_TW",
            "version": "3.22.0",
            "updated": "2021-08-11 09:24:57",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/zh_TW.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "zh_HK",
            "version": "3.22.0",
            "updated": "2018-12-04 11:47:27",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/zh_HK.zip"
        },
        {
            "type": "plugin",
            "slug": "order-delivery-date-for-woocommerce",
            "language": "zh_CN",
            "version": "3.22.0",
            "updated": "2018-12-12 02:35:10",
            "package": "https://downloads.wordpress.org/translation/plugin/order-delivery-date-for-woocommerce/3.22.0/zh_CN.zip"
        }
    ]
}