{
    "name": "PagSeguro / PagBank Connect para WooCommerce",
    "slug": "pagbank-connect",
    "version": "4.17.0",
    "author": "<a href=\"https://magenteiro.com\">PagSeguro/PagBank Integrações (Ricardo Martins)</a>",
    "author_profile": "https://profiles.wordpress.org/martins56/",
    "contributors": {
        "martins56": {
            "profile": "https://profiles.wordpress.org/martins56/",
            "avatar": "https://secure.gravatar.com/avatar/b8e7a05af0c27cbcd8c5f62ce32a49d6?s=96&d=monsterid&r=g",
            "display_name": "Ricardo Martins"
        }
    },
    "requires": "5.2",
    "tested": "6.6.2",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 32,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 32,
    "support_url": "https://wordpress.org/support/plugin/pagbank-connect/",
    "support_threads": 7,
    "support_threads_resolved": 7,
    "active_installs": 1000,
    "downloaded": 16788,
    "last_updated": "2024-09-17 07:59:00",
    "added": "2024-01-10",
    "homepage": "",
    "sections": {
        "description": "<p><strong>Aceite PagSeguro e PagBank (Pix, Cartão de Crédito, Boleto) em sua loja WooCommerce.</strong></p>\n<p>Esta é a <strong>forma mais fácil e gratuita de integrar sua loja com PagBank (PagSeguro)</strong>.<br />\nAo instalar e configurar nossa integração, você pode aceitar Pix, Boleto e Cartão de Crédito com o meio de pagamento mais confiado pelos brasileiros.</p>\n<p>⭐️Agora com taxas ainda menores (à partir de Agosto), válidas para lojas antigas e novas.⭐️</p>\n<p>Ou seja, você já economizava nas taxas do PagBank ao usar nosso plugin, e agora vai economizar ainda mais.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/wnzA0KQZCQs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Criado por Ricardo Martins (<strong>Parceiro oficial PagBank/PagSeguro desde 2015</strong>), esta é a 4ª geração das integrações PagSeguro, disponibilizadas desde 2014 no Magento, e desde 2019 no WooCommerce. Mais de 20 mil lojas atendidas e mais de 200 milhões de reais transacionados em nossas integrações.</p>\n<p>Além disso, você também pode aceitar pagamentos recorrentes e criar clubes de assinatura sem depender de plugins de terceiros.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/FOPwBTRryNM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><strong>Problemas com aprovação de pagamentos e chargebacks em transações com cartão de crédito?</strong></p>\n<p>Nossa integração suporta <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/22375922278157-Autentica%C3%A7%C3%A3o-3DS-Sua-prote%C3%A7%C3%A3o-contra-Chargeback\" rel=\"nofollow ugc\">autenticação 3D Secure</a>, que reduz drasticamente seus custos com chargebacks, e aumenta significativamente a taxa de aprovação.</p>\n<p>Tudo pra você vender mais com PagBank(PagSeguro) sem sequer precisar se preocupar em contratar um serviço de antifraude.</p>\n<ul>\n<li>Termos de uso e softwares terceiros<br />\nAo instalar o plugin PagBank Connect, você concorda com as <a href=\"https://pagseguro.uol.com.br/sobre/contrato-de-servicos\" rel=\"nofollow ugc\">Regras de uso do PagBank</a>, seu <a href=\"https://pagseguro.uol.com.br/sobre/contrato-de-servicos\" rel=\"nofollow ugc\">Contrato de Serviço</a>, <a href=\"https://pagseguro.uol.com.br/sobre/seguranca-e-privacidade\" rel=\"nofollow ugc\">Termos de Segurança, Privacidade</a> e <a href=\"https://pagseguro.uol.com.br/sobre/regras-de-compartilhamento\" rel=\"nofollow ugc\">Compartilhamento</a>, bem como os <a href=\"https://pagseguro.ricardomartins.net.br/terms.html\" rel=\"nofollow ugc\">Termos de uso e Política de Privacidade</a> do desenvolvedor.</li>\n</ul>\n<h3>⚡️ RECURSOS</h3>\n<ul>\n<li>Suporte a PIX, Cartão de Crédito e Boleto</li>\n<li>Suporte a <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/sections/20410120690829-Recorr%C3%AAncia-e-Clube-de-Assinatura-com-WooCommerce\" rel=\"nofollow ugc\">recorrência (assinaturas)</a>, sem depender de outros plugins</li>\n<li>Integração com <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/19944920673805-Envio-F%C3%A1cil-com-WooCommerce\" rel=\"nofollow ugc\">Envio Fácil</a> (economize até 70% no frete com Correios e Jadlog) sem precisar de contrato</li>\n<li>Suporte a <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/22375922278157-Autentica%C3%A7%C3%A3o-3DS-Sua-prote%C3%A7%C3%A3o-contra-Chargeback\" rel=\"nofollow ugc\">autenticação 3D Secure</a> (reduza chargebacks e aumente suas aprovações)</li>\n<li>Diversas <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/19945359660173-Op%C3%A7%C3%B5es-de-Parcelamento\" rel=\"nofollow ugc\">opções de parcelamento</a></li>\n<li>Suporte a <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/19945430928909-Oferecer-Desconto-Pix-e-Boleto\" rel=\"nofollow ugc\">descontos no boleto e pix</a></li>\n<li>Permite definir validade de boletos e código PIX</li>\n<li>Atualições automáticas de status de pedidos</li>\n<li>Configure como quer exibir o <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/19945038495629-Identificador-na-fatura\" rel=\"nofollow ugc\">nome da loja na fatura do cartão de crédito</a></li>\n<li>Diversas <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/20835022998029-Configura%C3%A7%C3%B5es-de-Endere%C3%A7o-de-Entrega\" rel=\"nofollow ugc\">opções de configuração de endereço</a></li>\n<li>Suporte a <a href=\"https://woo.com/document/high-performance-order-storage/\" rel=\"nofollow ugc\">High-Performance Order Storage (HPOS)</a>: Este plugin é otimizado para ambientes com High-Performance Order Storage, garantindo um manuseio rápido e eficiente de seus pedidos WooCommerce.</li>\n<li>Exibição de <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/26223028355597-Exibir-informa%C3%A7%C3%B5es-de-parcelamento-na-p%C3%A1gina-de-produto\" rel=\"nofollow ugc\">informações de parcelas na página de produto em 3 formatos diferentes</a></li>\n<li>Permite exibir os meios de pagamento de <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/26581505001357-Separar-meios-de-pagamento\" rel=\"nofollow ugc\">forma individual ou agrupada</a> (melhor experiência)</li>\n<li>Hooks disponíveis para facilitar integrações e modificações que você queira fazer sem sobrescrever o plugin. <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/27339148022669-Hooks-Filtros-e-A%C3%A7%C3%B5es-Dispon%C3%ADveis\" rel=\"nofollow ugc\">Veja documentação</a>.</li>\n</ul>\n<h3>Instalação automática via painel</h3>\n<ul>\n<li>Navegue até Plugins &gt; Adicionar Novo e procure por &#8220;PagBank Ricardo Martins&#8221;</li>\n<li>Clique no botão para instalar e ative o plugin</li>\n<li>Repita o processo buscando e instalando o plugin <a href=\"https://br.wordpress.org/plugins/woocommerce-extra-checkout-fields-for-brazil/\" rel=\"nofollow ugc\">Brazilian Market on WooCommerce</a> a fim de habilitar campos adicionais de endereço e CPF, que são obrigatórios no PagBank.</li>\n</ul>\n<h3>WP-CLI</h3>\n<p>Você pode instalar o plugin usando o <a href=\"https://wp-cli.org/\" rel=\"nofollow ugc\">WP-CLI</a>.</p>\n<ul>\n<li>Basta rodar o comando <code>wp plugin install pagbank-connect --activate</code>. Adicione <code>--allow-root</code> se estiver rodando o comando como root.</li>\n<li>Repita o processo para instalar o plugin <a href=\"https://br.wordpress.org/plugins/woocommerce-extra-checkout-fields-for-brazil/\" rel=\"nofollow ugc\">Brazilian Market on WooCommerce</a> com o comando <code>wp plugin install woocommerce-extra-checkout-fields-for-brazil --activate</code> caso ainda não tenha ele instalado.</li>\n</ul>\n<h3>Instalação manual</h3>\n<ul>\n<li>Baixe o <a href=\"https://codeload.github.com/r-martins/PagBank-WooCommerce/zip/refs/heads/master\" rel=\"nofollow ugc\">arquivo zip</a> e descompacte ele em sua máquina</li>\n<li>Faça upload dos arquivos na pasta /wp-content/plugins/pagbank-connect, usando seu FTP</li>\n<li>Navegue até Plugins &gt; Plugins instalados, e ative o plugin PagBank Connect</li>\n<li>Instale o plugin <a href=\"https://br.wordpress.org/plugins/woocommerce-extra-checkout-fields-for-brazil/\" rel=\"nofollow ugc\">Brazilian Market on WooCommerce</a> a fim de habilitar campos adicionais de endereço e CPF, que são obrigatórios no PagBank.</li>\n</ul>\n<h3>A gente instala pra você 🙀</h3>\n<p>Se você preferir, podemos instalar e configurar o plugin para você sem nenhum custo.</p>\n<p><a href=\"https://pagseguro.ricardomartins.net.br/woocommerce/agenteinstala.html\" rel=\"nofollow ugc\">Saiba mais</a>.</p>\n<h3>Configuração</h3>\n<ul>\n<li>Ative o meio de pagamento navegando até WooCommerce &gt; Configurações &gt; Pagamentos, e ativando o PagBank Connect</li>\n<li>Clique no PagBank Connect para acessar as configurações do módulo</li>\n<li>Clique em &#8220;Obter Connect Key&#8221;. Você será levado para nosso site, onde poderá escolher o modelo de recebimento (14 ou 30 dias) e então autorizar nossa aplicação.</li>\n<li>Ao clicar no modelo de recebimento desejado, você será levado(a) para o site do PagBank, onde deverá se logar com sua conta e autorizar nossa aplicação.</li>\n<li>Em seguida, será levado(a) de volta para nosso site, onde deverá preencher as informações do responsável técnico por sua loja.</li>\n<li>Feito isso, sua <em>Connect Key</em> será exibida e enviada para o e-mail informado. Use ela nas configurações da sua loja.</li>\n<li>Salve as configurações e sua loja está pronta para vender.</li>\n<li>Se desejar, configure <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/19945359660173-Op%C3%A7%C3%B5es-de-Parcelamento\" rel=\"nofollow ugc\">opções de parcelamento</a>, e validade do boleto e código pix de acordo com suas necessidades.</li>\n</ul>\n<h3>4.17.0</h3>\n<ul>\n<li>Melhoria: Se por algum motivo os ícones com cores personalizadas não puderem ser exibidos (ex: plugin de segurança afetando funcionamento), usaremos a imagem estática e exibiremos um aviso no admin ao salvar as configs do pagbank.</li>\n</ul>\n<h3>4.16.0</h3>\n<ul>\n<li>Melhoria: agora informações do PIX ou do Boleto também são enviadas no e-mail transacional</li>\n<li>Melhoria: alguns administradores digitavam o token PagBank (nunca solicitado) no campo da Connect Key. Agora validamos isso e avisamos ele sobre o engano.</li>\n<li>Melhoria: fazemos validação no último pedido pix a fim de ver se há erro de chave pix inválida causada pela não existência de chaves aleatórias na conta PagBank. Agora fazemos isso com bem menos frequência, ou uma vez só se estiver tudo certo. Isso deve melhorar a performance do plugin na área administrativa.</li>\n<li>Correção: em lojas com HPOS desabilitado e com WooCommerce 9.2.0 ou superior, um Notice era gravado (ou exibido) dizendo que o método <code>WC_Order_Data_Store_CPT::query</code> foi chamado incorretamente.</li>\n</ul>\n<h3>4.15.0</h3>\n<ul>\n<li>Melhorias gerais de código, performance, e boas práticas em todo plugin. Trata-se de uma grande mudança na forma como o plugin é estruturado internamente e nos possibilitará evolui-lo com mais segurança e menos bugs.</li>\n<li>Mudança: descontinuamos a opção de exibir os métodos de pagamento de forma agrupada. Agora eles são exibidos de forma individual, o que é mais amigável e intuitivo para o admin.</li>\n<li>Correção: na conversão de minutos da expiração do PIX para o usuário (ex: 43200 minutos era exibido como 7 dias)</li>\n</ul>\n<h4>4.14.0</h4>\n<ul>\n<li>Melhoria: Mensagem amigável e opção de esconder os meios de pagamento para pedidos inferiores a R$1,00</li>\n<li>Melhoria: truncamos alguns campos como nome do cliente e alguns campos de endereço a fim de evitar erros na finalização do pedido quando o valor informado é maior que o permitido pelo PagBank.</li>\n<li>Correção de Uncaught Error: Call to a member function get_edit_order_url() on bool na listagem de assinaturas ativas do admin em alguns cenários</li>\n<li>Correção: quando desabilitávamos a opção de pausar ou cancelar assinatura (para o usuário), as opções também deixavam de ser exibidas para o administrador em alguns cenários</li>\n</ul>\n<h4>4.13.0</h4>\n<ul>\n<li>Agora é possível definir período de teste e opções de descontos para assinaturas.</li>\n<li>APIs: obtenha informações detalhadas dos pagamentos feitos com pagbank nos metadados do pedido via API Rest do próprio WordPress/Woo</li>\n</ul>\n<h4>4.12.0</h4>\n<ul>\n<li>Agora é possível remover os botões de Cancelar ou Pausar assinatura na área do cliente</li>\n<li>Agora o administrador pode alterar o valor de uma assinatura no admin</li>\n</ul>\n<h4>4.11.7</h4>\n<ul>\n<li>Melhoria: adicionado NSU e Authorization code aos meta dados do pedido, para facilitar conciliação</li>\n<li>Melhoria: agora validamos o order_id do pedido quando uma notificação é recebida, evitando que pedidos com mesmo ID sejam atualizados erroneamente e em alguns casos alterando pedidos pagos para cancelados.</li>\n<li>Correção: símbolo da moeda (R$) aparecia duplicado no formulário de pagamento em vendas recorrentes</li>\n</ul>\n<h4>4.11.6</h4>\n<ul>\n<li>Melhoria: agora quando você marca para exibir meios de pagamento separadamente, a opção de selecionar como o titulo sera exibido é omitida, evitando confusão (já que esta opção não terá efeito algum)</li>\n<li>Corrige erro no tamanho dos ícones quando meios de pagamento eram exibidos individualmente, em alguns checkouts como Porto</li>\n<li>Mudamos a forma como obtemos o preço do produto na finalização de compra, a fim de corrigir erros de compatibilidade com alguns plugins e tornar o processo mais enxuto e rápido</li>\n</ul>\n<h4>4.11.5</h4>\n<ul>\n<li>Pequena melhoria: adicionamos alguns hooks com filters e actions para facilitar integrações e modificações que você queira fazer sem sobrescrever o plugin. <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/27339148022669-Hooks-Filtros-e-A%C3%A7%C3%B5es-Dispon%C3%ADveis\" rel=\"nofollow ugc\">Veja documentação</a>. </li>\n</ul>\n<h4>4.11.4</h4>\n<ul>\n<li>Correção: alguns plugins de terceiros não utilizam filtros corretamente, fazendo com que nosso css não seja inserido e o checkout apresente problemas, como ícones grandes e afins. Contornamos o problema aqui. </li>\n</ul>\n<h4>4.11.3</h4>\n<ul>\n<li>Correção em falha que impedia o EnvioFacil de ser habilitado</li>\n</ul>\n<h4>4.11.2</h4>\n<ul>\n<li>Correção: em alguns cenários, o campo de CPF, número do endereço e bairro não eram enviados corretamente ocasionando falha no fechamento do pedido (especialmente em Boletos).</li>\n</ul>\n<h4>4.11.1</h4>\n<ul>\n<li>Correção: nosso validador de chaves pix adicionado na versão anterior apontava para pedidos não-pix</li>\n<li>Correção: a mensagem de validação do pix não era ignorada em alguns cenários após dispensá-la</li>\n</ul>\n<h4>4.11.0</h4>\n<ul>\n<li>Melhoria: agora o plugin exibe uma mensagem de erro no admin caso o código PIX esteja sendo gerado incorretamente por conta de algum problema em sua conta PagBank (geralmente porque você não cadastrou a chave aleatória).</li>\n<li>Correção: o valor dos produtos era informado de forma incorreta ao PagBank quando múltiplos do mesmo item estavam presentes no pedido (embora o valor cobrado estivesse correto).</li>\n</ul>\n<h4>4.10.2</h4>\n<ul>\n<li>Correção em erro no cálculo de parcelas. Em alguns cenários, dependendo das regras de parcelamento, quando o total de parcelas sem juros era = 1, poderia ocasionar erro na pagina de produto (se as parcelas estivessem sendo exibidas la) e no dropdown de parcelamento do checkout.</li>\n<li>Correções diversas em warnings e notices em versões mais novas do PHP 8.1 e 8.2 que poderiam aparecer no admin, e em algumas etapas do pedido quando modo debug estava ativo. </li>\n</ul>\n<h4>4.10.1</h4>\n<ul>\n<li>Correção de erro &#8220;get_cart was called incorrectly&#8221; era exibido quando usado em conjunto com alguns outros plugins (como Mercado Pago), em alguns casos quebrando o carrinho.</li>\n<li>Alteramos a forma como o uso de shortcode de parcelamento é usado. Agora você deve habilitar ele nas configurações. Isso evita que ele seja adicionado em duplicidade.</li>\n<li>Corrigido falha na compra de produto recorrente quando meios de pagamento eram configurados para ser exibidos de forma separada. A mensagem Método de pagamento inválido era exibida.</li>\n<li>Melhoramos a descrição de alguns dos campos de configuração de cartão de crédito, a fim de deixar mais claro o que cada um faz e com mais links para documentação.</li>\n</ul>\n<h4>4.10.0</h4>\n<ul>\n<li>Emails: agora o administrador e cliente só receberão e-mails notificando que um pedido foi criado se o mesmo tiver sido pago.</li>\n<li>Correção/Mudança: agora pessoas com permissão de gerente de loja e administradores poderão ter acesso ao menu PagBank. Antes somente administradores tinham acesso.</li>\n<li>Agora é possível usar o shortcode [rm_pagbank_credit_card_installments] para exibir as parcelas de um produto em layouts personalizados.</li>\n<li>Corrigido Erro na exibição das parcelas quando opção &#8216;Texto com parcela máxima&#8217; era selecionado em alguns cenários.</li>\n</ul>\n<h4>4.9.3</h4>\n<ul>\n<li>Correção: quando usado em conjunto com alguns plugins, chamadas ao jQuery falhavam e impediam a finalização do checkout com erros na criptografia do cartão, entre outras coisas.</li>\n<li>Correção: quando linhas em branco eram inseridas pelo wp-load ou um de seus arquivos/plugins, a imagem dinâmica dos ícones das formas de pagamento não eram exibidas corretamente.</li>\n<li>Correção: ao desativar o plugin um modal de feedback é exibido. No entanto, se a pessoa mudasse de ideia e clicasse em Cancelar, nada acontecia.</li>\n</ul>\n<h4>4.9.2</h4>\n<ul>\n<li>Correção: ícones muito grandes em alguns temas</li>\n<li>Correção: ao clicar em &#8220;Configurar&#8221; na lista de pagamentos (ao invés de ir em PagBank &gt; Configurações) nenhuma alteração feita era salva.</li>\n</ul>\n<h4>4.9.1</h4>\n<ul>\n<li>Correção: quando exibir meios de pagamento de forma separada estava ativada, os meios de pagamento apareciam mesmo quando desativados.</li>\n</ul>\n<h4>4.9.0</h4>\n<ul>\n<li>Agora é possível exibir os meios de pagamento de forma individual (ideal para caso você aceite outros meios de pagamento além do PagBank)</li>\n<li>Agora quando um carrinho for recorrente (contiver produtos recorrentes PagBank), somente os meios PagBank suportados serão exibidos. </li>\n</ul>\n<h4>4.8.0</h4>\n<ul>\n<li>Agora é possível exibir informações de parcelamento na página do produto em 3 formatos diferentes</li>\n</ul>\n<h4>4.7.2</h4>\n<ul>\n<li>Melhoria: agora ao desativar o plugin damos a opção de você adicionar um comentário com mais detalhes sobre o motivo da desativação.</li>\n<li>Melhoria: agora exibimos um aviso no admin caso o checkout em blocos esteja em uso.</li>\n</ul>\n<h4>4.7.1</h4>\n<ul>\n<li>Melhorias gerais no JavaScript do plugin</li>\n<li>Melhoria: adicionado métodos de criptografia no Helper do plugin. Por enquanto usado somente em um caso específico na página de pagamento avulso (order-pay).</li>\n<li>Correção: cálculo de parcelas poderia falhar em alguns cenários quando usado em modo Sandbox, exibindo uma opção com mensagem &#8220;undefined&#8230;&#8221;.</li>\n<li>Correção: ao fazer um pedido com pix ou boleto e navegar até a área de meus pedidos, o cliente pode clicar em Pagar e escolher outro meio de pagamento. No entanto, pagamento com cartão e 3Ds não funcionava nesta página. Refizemos algumas coisas para tornar isso possível. Isso também traz compatibilidade a plugins de autorização de pedido (como Order Approval for Woocommerce). Reportado por Tiago da Tikovolpe.</li>\n<li>Melhoria: instalação via composer agora sugere que habilite extensão openssl do PHP, a fim de ter melhor criptografia. No momento a criptografia só é usada para o número do pedido, na página de pagamento avulso (/order-pay).</li>\n<li>Melhorias: code standards</li>\n</ul>\n<h4>4.7.0</h4>\n<ul>\n<li>Melhoria: cliente passa a receber e-mail informando que o pedido foi cancelado automaticamente após expiração do PIX. Sugerido por Fellipe (The Growth Space). </li>\n<li>Melhoria: agora é possível excluir o valor frete ao dar desconto em boleto e pix, aplicando o desconto somente aos produtos. Sugerido por Fabio (Kaizen Digital). </li>\n</ul>\n<h4>4.6.3</h4>\n<ul>\n<li>Melhoria/Correção: quando determinada configuracao do php era realizada, os ícones dos meios de pagamento não eram exibidos. Reportado por Daniel Carvalho.</li>\n</ul>\n<h4>4.6.2</h4>\n<ul>\n<li>Adicionado suporte ao WooCommerce 6.5</li>\n<li>Adicionado dependencia do plugin Brazilian Market on WooCommerce, evitando erros de campos obrigatórios em algumas lojas</li>\n<li>Pequenas melhorias de segurança (wp standards compliance)</li>\n</ul>\n<h4>4.6.1</h4>\n<ul>\n<li>Correção: quando o cliente digitava um cartão inválido ou incompleto e tentava finalizar o pedido, ocasionando falha na criptografia do cartão, o pedido ainda era submetido para o backend e gerando outros erros desnecessários, especialmente se outros campos também estivessem errados ou faltando. O mais clássico era o erro 40002 de encrypted_card.id incorreto.</li>\n<li>Correção: ao desativar e ativar novamente o plugin, um erro de SQL era gerado internamente devido a um bug no WordPress e uma mensagem de que o plugin teria gerado cerca de 1400 caracteres de saída inesperada durante a ativação era exibida no backend.</li>\n</ul>\n<h4>4.6.0</h4>\n<ul>\n<li>Pedidos PIX agora são cancelados automaticamente após periodo de expiração se não forem pagos</li>\n<li>Em alguns checkouts com plugins personalizados (ex: cartflows) o CSS de nosso plugin não era inserido corretamente, ocasionando quebra de layout e ignorando as cores dos ícones configuradas.</li>\n<li>Ao desativar nosso plugin, agora exibimos uma pergunta sobre o  &hellip;</li>\n</ul>\n",
        "faq": "\n<dt id='pagseguro%20ou%20pagbank%3F'>\nPagSeguro ou PagBank?\n</h4>\n<p>\n<p>Em 2023 o PagBank e o PagSeguro se tornaram uma única empresa: PagBank.</p>\n<p>E não se preocupe, os serviços que você usa não serão afetados.</p>\n</p>\n<dt id='quais%20os%20requisitos%20para%20usar%20esta%20integra%C3%A7%C3%A3o%3F'>\nQuais os requisitos para usar esta integração?\n</h4>\n<p>\n<ul>\n<li>Ter WooCommerce 4.0 ou superior</li>\n<li>PHP 7.4 ou superior</li>\n<li>Ter uma conta Vendedor ou Empresarial no PagSeguro/PagBank</li>\n<li><a href=\"https://pagseguro.ricardomartins.net.br/connect/autorizar.html\" rel=\"nofollow ugc\">Autorizar nossa integração</a> em sua conta PagBank.</li>\n<li>Ter instalado o plugin <a href=\"https://br.wordpress.org/plugins/woocommerce-extra-checkout-fields-for-brazil/\" rel=\"nofollow ugc\">Brazilian Market on WooCommerce</a> a fim de habilitar campos adicionais de endereço e CPF, que são obrigatórios no PagBank.</li>\n</ul>\n</p>\n<dt id='como%20funcionam%20os%20descontos%20nas%20taxas%3F'>\nComo funcionam os descontos nas taxas?\n</h4>\n<p>\n<p>Ao usar nossas integrações no modelo de recebimento em 14 ou 30 dias, ao invés de pagar 4,99% ou 3,99%, você pagará até 1% a menos e estará isento da taxa de R$0,40 por transação.</p>\n<p>Taxas menores também são aplicadas para transações parceladas, PIX e Boleto. PIX e Boleto também possuem prazos menores de recebimento.</p>\n<p>Consulte mais sobre elas no <a href=\"https://pagseguro.ricardomartins.net.br/connect/autorizar.html\" rel=\"nofollow ugc\">nosso site</a>.</p>\n</p>\n<dt id='eu%20tenho%20uma%20taxa%20ou%20condi%C3%A7%C3%A3o%20negociada%20menor%20que%20estas.%20o%20que%20fa%C3%A7o%3F'>\nEu tenho uma taxa ou condição negociada menor que estas. O que faço?\n</h4>\n<p>\n<p>Ao usar nossa integração, nossas taxas e condições serão aplicadas ao invés das suas. Isto é, nas transações realizadas com nosso plugin.</p>\n<p>É importante notar que taxas negociadas no mundo físico (moderninhas) não são aplicadas no mundo online.</p>\n<p>Se mesmo assim você possuir uma taxa ou condição melhor, e se compromete a faturar mais de R$20 mil / mês (pedidos aprovados usando nossa integração), podemos incluir sua loja em uma aplicação especial.</p>\n<p>Ao <a href=\"https://pagseguro.ricardomartins.net.br/connect/autorizar.html\" rel=\"nofollow ugc\">autorizar sua conta</a>, escolha a opção &#8220;Suas condições e taxas&#8221;.</p>\n<p>Sua Connect key será gerada respeitando as taxas e condições negociadas que você tem com o PagSeguro/PagBank.</p>\n</p>\n<dt id='tenho%20outra%20pergunta%20n%C3%A3o%20listada%20aqui'>\nTenho outra pergunta não listada aqui\n</h4>\n<p>\n<p>Consulte nossa <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/\" rel=\"nofollow ugc\">Central de ajuda</a> e <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/requests/new\" rel=\"nofollow ugc\">entre em contato</a> conosco se não encontrar sua dúvida respondida por lá.</p>\n<p>A maioria das dúvidas estão respondidas lá. As outras são respondidas em até 2 dias após entrar em contato.</p>\n</p>\n<dt id='o%20plugin%20atualiza%20os%20status%20automaticamente%3F'>\nO plugin atualiza os status automaticamente?\n</h4>\n<p>\n<p>Sim.</p>\n<p>E quando há uma transação no PagBank, um link para ela é exibida na página do pedido. Assim você pode confirmar novamente o status do mesmo.</p>\n<p>Caso utilize Cloudflare ou CDN, certifique-se de <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/115002699823-Usu%C3%A1rios-Cloudflare-e-CDN-s\" rel=\"nofollow ugc\">configurá-lo corretamente</a> e liberar os IPs do PagSeguro para evitar bloqueios nas notificações.</p>\n</p>\n<dt id='posso%20testar%20usando%20a%20sandbox%3F'>\nPosso testar usando a Sandbox?\n</h4>\n<p>\n<p>Sim. Basta clicar no botão &#8216;Obter Connect Key para Testes&#8217; localizado nas configurações do plugin, seguir as instruções, e informar sua Connect Key de testes no campo indicado.</p>\n<p>Um link para mais detalhes sobre como utilizar a Sandbox está disponível na página de configurações do plugin.</p>\n<p>Você também pode testar com dados reais e realizar o estorno. As tarifas e taxas são reembolsadas, não incidindo nenhum custo.</p>\n</p>\n<dt id='este%20%C3%A9%20um%20plugin%20oficial%3F'>\nEste é um plugin oficial?\n</h4>\n<p>\n<p>Não. Este é um plugin desenvolvido por Ricardo Martins, parceiro PagBank desde 2014.</p>\n<p>Apesar da parceria entre o desenvolvedor e o PagBank que concede descontos e benefícios, este NÃO é um produto oficial.</p>\n<p>PagSeguro e PagBank são marcas do UOL.</p>\n</p>\n<dt id='o%20plugin%20%C3%A9%20compat%C3%ADvel%20com%20o%20woocommerce%20subscriptions%3F'>\nO plugin é compatível com o WooCommerce Subscriptions?\n</h4>\n<p>\n<p>Você não precisa do plugin WooCommerce Subscriptions ou nenhum outro para aceitar <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/sections/20410120690829-Recorr%C3%AAncia-e-Clube-de-Assinatura-com-WooCommerce\" rel=\"nofollow ugc\">pagamentos recorrentes com nossa integração</a>.</p>\n</p>\n<dt id='posso%20modificar%20e%20comercializar%20este%20plugin%3F'>\nPosso modificar e comercializar este plugin?\n</h4>\n<p>\n<p>O plugin é licenciado sob GPL v3. Você pode modificar e distribuir, contanto que suas melhorias e correções sejam contribuidas de volta com o projeto.</p>\n<p>Você deve fazer isso através de Pull Requests ao <a href=\"https://github.com/r-martins/PagBank-WooCommerce\" rel=\"nofollow ugc\">repositório oficial no github</a>.</p>\n</p>\n\n"
    },
    "short_description": "PIX, Cartão de Crédito, Boleto, Recorrência + Envio Fácil e com taxas ainda menores no PagSeguro. Autenticação 3D: menos chargeback e mais aprovações.",
    "description": "<p><strong>Aceite PagSeguro e PagBank (Pix, Cartão de Crédito, Boleto) em sua loja WooCommerce.</strong></p>\n<p>Esta é a <strong>forma mais fácil e gratuita de integrar sua loja com PagBank (PagSeguro)</strong>.<br />\nAo instalar e configurar nossa integração, você pode aceitar Pix, Boleto e Cartão de Crédito com o meio de pagamento mais confiado pelos brasileiros.</p>\n<p>⭐️Agora com taxas ainda menores (à partir de Agosto), válidas para lojas antigas e novas.⭐️</p>\n<p>Ou seja, você já economizava nas taxas do PagBank ao usar nosso plugin, e agora vai economizar ainda mais.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/wnzA0KQZCQs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Criado por Ricardo Martins (<strong>Parceiro oficial PagBank/PagSeguro desde 2015</strong>), esta é a 4ª geração das integrações PagSeguro, disponibilizadas desde 2014 no Magento, e desde 2019 no WooCommerce. Mais de 20 mil lojas atendidas e mais de 200 milhões de reais transacionados em nossas integrações.</p>\n<p>Além disso, você também pode aceitar pagamentos recorrentes e criar clubes de assinatura sem depender de plugins de terceiros.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/FOPwBTRryNM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><strong>Problemas com aprovação de pagamentos e chargebacks em transações com cartão de crédito?</strong></p>\n<p>Nossa integração suporta <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/22375922278157-Autentica%C3%A7%C3%A3o-3DS-Sua-prote%C3%A7%C3%A3o-contra-Chargeback\" rel=\"nofollow ugc\">autenticação 3D Secure</a>, que reduz drasticamente seus custos com chargebacks, e aumenta significativamente a taxa de aprovação.</p>\n<p>Tudo pra você vender mais com PagBank(PagSeguro) sem sequer precisar se preocupar em contratar um serviço de antifraude.</p>\n<ul>\n<li>Termos de uso e softwares terceiros<br />\nAo instalar o plugin PagBank Connect, você concorda com as <a href=\"https://pagseguro.uol.com.br/sobre/contrato-de-servicos\" rel=\"nofollow ugc\">Regras de uso do PagBank</a>, seu <a href=\"https://pagseguro.uol.com.br/sobre/contrato-de-servicos\" rel=\"nofollow ugc\">Contrato de Serviço</a>, <a href=\"https://pagseguro.uol.com.br/sobre/seguranca-e-privacidade\" rel=\"nofollow ugc\">Termos de Segurança, Privacidade</a> e <a href=\"https://pagseguro.uol.com.br/sobre/regras-de-compartilhamento\" rel=\"nofollow ugc\">Compartilhamento</a>, bem como os <a href=\"https://pagseguro.ricardomartins.net.br/terms.html\" rel=\"nofollow ugc\">Termos de uso e Política de Privacidade</a> do desenvolvedor.</li>\n</ul>\n<h3>⚡️ RECURSOS</h3>\n<ul>\n<li>Suporte a PIX, Cartão de Crédito e Boleto</li>\n<li>Suporte a <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/sections/20410120690829-Recorr%C3%AAncia-e-Clube-de-Assinatura-com-WooCommerce\" rel=\"nofollow ugc\">recorrência (assinaturas)</a>, sem depender de outros plugins</li>\n<li>Integração com <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/19944920673805-Envio-F%C3%A1cil-com-WooCommerce\" rel=\"nofollow ugc\">Envio Fácil</a> (economize até 70% no frete com Correios e Jadlog) sem precisar de contrato</li>\n<li>Suporte a <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/22375922278157-Autentica%C3%A7%C3%A3o-3DS-Sua-prote%C3%A7%C3%A3o-contra-Chargeback\" rel=\"nofollow ugc\">autenticação 3D Secure</a> (reduza chargebacks e aumente suas aprovações)</li>\n<li>Diversas <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/19945359660173-Op%C3%A7%C3%B5es-de-Parcelamento\" rel=\"nofollow ugc\">opções de parcelamento</a></li>\n<li>Suporte a <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/19945430928909-Oferecer-Desconto-Pix-e-Boleto\" rel=\"nofollow ugc\">descontos no boleto e pix</a></li>\n<li>Permite definir validade de boletos e código PIX</li>\n<li>Atualições automáticas de status de pedidos</li>\n<li>Configure como quer exibir o <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/19945038495629-Identificador-na-fatura\" rel=\"nofollow ugc\">nome da loja na fatura do cartão de crédito</a></li>\n<li>Diversas <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/20835022998029-Configura%C3%A7%C3%B5es-de-Endere%C3%A7o-de-Entrega\" rel=\"nofollow ugc\">opções de configuração de endereço</a></li>\n<li>Suporte a <a href=\"https://woo.com/document/high-performance-order-storage/\" rel=\"nofollow ugc\">High-Performance Order Storage (HPOS)</a>: Este plugin é otimizado para ambientes com High-Performance Order Storage, garantindo um manuseio rápido e eficiente de seus pedidos WooCommerce.</li>\n<li>Exibição de <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/26223028355597-Exibir-informa%C3%A7%C3%B5es-de-parcelamento-na-p%C3%A1gina-de-produto\" rel=\"nofollow ugc\">informações de parcelas na página de produto em 3 formatos diferentes</a></li>\n<li>Permite exibir os meios de pagamento de <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/26581505001357-Separar-meios-de-pagamento\" rel=\"nofollow ugc\">forma individual ou agrupada</a> (melhor experiência)</li>\n<li>Hooks disponíveis para facilitar integrações e modificações que você queira fazer sem sobrescrever o plugin. <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/27339148022669-Hooks-Filtros-e-A%C3%A7%C3%B5es-Dispon%C3%ADveis\" rel=\"nofollow ugc\">Veja documentação</a>.</li>\n</ul>\n<h3>Instalação automática via painel</h3>\n<ul>\n<li>Navegue até Plugins &gt; Adicionar Novo e procure por &#8220;PagBank Ricardo Martins&#8221;</li>\n<li>Clique no botão para instalar e ative o plugin</li>\n<li>Repita o processo buscando e instalando o plugin <a href=\"https://br.wordpress.org/plugins/woocommerce-extra-checkout-fields-for-brazil/\" rel=\"nofollow ugc\">Brazilian Market on WooCommerce</a> a fim de habilitar campos adicionais de endereço e CPF, que são obrigatórios no PagBank.</li>\n</ul>\n<h3>WP-CLI</h3>\n<p>Você pode instalar o plugin usando o <a href=\"https://wp-cli.org/\" rel=\"nofollow ugc\">WP-CLI</a>.</p>\n<ul>\n<li>Basta rodar o comando <code>wp plugin install pagbank-connect --activate</code>. Adicione <code>--allow-root</code> se estiver rodando o comando como root.</li>\n<li>Repita o processo para instalar o plugin <a href=\"https://br.wordpress.org/plugins/woocommerce-extra-checkout-fields-for-brazil/\" rel=\"nofollow ugc\">Brazilian Market on WooCommerce</a> com o comando <code>wp plugin install woocommerce-extra-checkout-fields-for-brazil --activate</code> caso ainda não tenha ele instalado.</li>\n</ul>\n<h3>Instalação manual</h3>\n<ul>\n<li>Baixe o <a href=\"https://codeload.github.com/r-martins/PagBank-WooCommerce/zip/refs/heads/master\" rel=\"nofollow ugc\">arquivo zip</a> e descompacte ele em sua máquina</li>\n<li>Faça upload dos arquivos na pasta /wp-content/plugins/pagbank-connect, usando seu FTP</li>\n<li>Navegue até Plugins &gt; Plugins instalados, e ative o plugin PagBank Connect</li>\n<li>Instale o plugin <a href=\"https://br.wordpress.org/plugins/woocommerce-extra-checkout-fields-for-brazil/\" rel=\"nofollow ugc\">Brazilian Market on WooCommerce</a> a fim de habilitar campos adicionais de endereço e CPF, que são obrigatórios no PagBank.</li>\n</ul>\n<h3>A gente instala pra você 🙀</h3>\n<p>Se você preferir, podemos instalar e configurar o plugin para você sem nenhum custo.</p>\n<p><a href=\"https://pagseguro.ricardomartins.net.br/woocommerce/agenteinstala.html\" rel=\"nofollow ugc\">Saiba mais</a>.</p>\n<h3>Configuração</h3>\n<ul>\n<li>Ative o meio de pagamento navegando até WooCommerce &gt; Configurações &gt; Pagamentos, e ativando o PagBank Connect</li>\n<li>Clique no PagBank Connect para acessar as configurações do módulo</li>\n<li>Clique em &#8220;Obter Connect Key&#8221;. Você será levado para nosso site, onde poderá escolher o modelo de recebimento (14 ou 30 dias) e então autorizar nossa aplicação.</li>\n<li>Ao clicar no modelo de recebimento desejado, você será levado(a) para o site do PagBank, onde deverá se logar com sua conta e autorizar nossa aplicação.</li>\n<li>Em seguida, será levado(a) de volta para nosso site, onde deverá preencher as informações do responsável técnico por sua loja.</li>\n<li>Feito isso, sua <em>Connect Key</em> será exibida e enviada para o e-mail informado. Use ela nas configurações da sua loja.</li>\n<li>Salve as configurações e sua loja está pronta para vender.</li>\n<li>Se desejar, configure <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/19945359660173-Op%C3%A7%C3%B5es-de-Parcelamento\" rel=\"nofollow ugc\">opções de parcelamento</a>, e validade do boleto e código pix de acordo com suas necessidades.</li>\n</ul>\n<h3>4.17.0</h3>\n<ul>\n<li>Melhoria: Se por algum motivo os ícones com cores personalizadas não puderem ser exibidos (ex: plugin de segurança afetando funcionamento), usaremos a imagem estática e exibiremos um aviso no admin ao salvar as configs do pagbank.</li>\n</ul>\n<h3>4.16.0</h3>\n<ul>\n<li>Melhoria: agora informações do PIX ou do Boleto também são enviadas no e-mail transacional</li>\n<li>Melhoria: alguns administradores digitavam o token PagBank (nunca solicitado) no campo da Connect Key. Agora validamos isso e avisamos ele sobre o engano.</li>\n<li>Melhoria: fazemos validação no último pedido pix a fim de ver se há erro de chave pix inválida causada pela não existência de chaves aleatórias na conta PagBank. Agora fazemos isso com bem menos frequência, ou uma vez só se estiver tudo certo. Isso deve melhorar a performance do plugin na área administrativa.</li>\n<li>Correção: em lojas com HPOS desabilitado e com WooCommerce 9.2.0 ou superior, um Notice era gravado (ou exibido) dizendo que o método <code>WC_Order_Data_Store_CPT::query</code> foi chamado incorretamente.</li>\n</ul>\n<h3>4.15.0</h3>\n<ul>\n<li>Melhorias gerais de código, performance, e boas práticas em todo plugin. Trata-se de uma grande mudança na forma como o plugin é estruturado internamente e nos possibilitará evolui-lo com mais segurança e menos bugs.</li>\n<li>Mudança: descontinuamos a opção de exibir os métodos de pagamento de forma agrupada. Agora eles são exibidos de forma individual, o que é mais amigável e intuitivo para o admin.</li>\n<li>Correção: na conversão de minutos da expiração do PIX para o usuário (ex: 43200 minutos era exibido como 7 dias)</li>\n</ul>\n<h4>4.14.0</h4>\n<ul>\n<li>Melhoria: Mensagem amigável e opção de esconder os meios de pagamento para pedidos inferiores a R$1,00</li>\n<li>Melhoria: truncamos alguns campos como nome do cliente e alguns campos de endereço a fim de evitar erros na finalização do pedido quando o valor informado é maior que o permitido pelo PagBank.</li>\n<li>Correção de Uncaught Error: Call to a member function get_edit_order_url() on bool na listagem de assinaturas ativas do admin em alguns cenários</li>\n<li>Correção: quando desabilitávamos a opção de pausar ou cancelar assinatura (para o usuário), as opções também deixavam de ser exibidas para o administrador em alguns cenários</li>\n</ul>\n<h4>4.13.0</h4>\n<ul>\n<li>Agora é possível definir período de teste e opções de descontos para assinaturas.</li>\n<li>APIs: obtenha informações detalhadas dos pagamentos feitos com pagbank nos metadados do pedido via API Rest do próprio WordPress/Woo</li>\n</ul>\n<h4>4.12.0</h4>\n<ul>\n<li>Agora é possível remover os botões de Cancelar ou Pausar assinatura na área do cliente</li>\n<li>Agora o administrador pode alterar o valor de uma assinatura no admin</li>\n</ul>\n<h4>4.11.7</h4>\n<ul>\n<li>Melhoria: adicionado NSU e Authorization code aos meta dados do pedido, para facilitar conciliação</li>\n<li>Melhoria: agora validamos o order_id do pedido quando uma notificação é recebida, evitando que pedidos com mesmo ID sejam atualizados erroneamente e em alguns casos alterando pedidos pagos para cancelados.</li>\n<li>Correção: símbolo da moeda (R$) aparecia duplicado no formulário de pagamento em vendas recorrentes</li>\n</ul>\n<h4>4.11.6</h4>\n<ul>\n<li>Melhoria: agora quando você marca para exibir meios de pagamento separadamente, a opção de selecionar como o titulo sera exibido é omitida, evitando confusão (já que esta opção não terá efeito algum)</li>\n<li>Corrige erro no tamanho dos ícones quando meios de pagamento eram exibidos individualmente, em alguns checkouts como Porto</li>\n<li>Mudamos a forma como obtemos o preço do produto na finalização de compra, a fim de corrigir erros de compatibilidade com alguns plugins e tornar o processo mais enxuto e rápido</li>\n</ul>\n<h4>4.11.5</h4>\n<ul>\n<li>Pequena melhoria: adicionamos alguns hooks com filters e actions para facilitar integrações e modificações que você queira fazer sem sobrescrever o plugin. <a href=\"https://pagsegurotransparente.zendesk.com/hc/pt-br/articles/27339148022669-Hooks-Filtros-e-A%C3%A7%C3%B5es-Dispon%C3%ADveis\" rel=\"nofollow ugc\">Veja documentação</a>. </li>\n</ul>\n<h4>4.11.4</h4>\n<ul>\n<li>Correção: alguns plugins de terceiros não utilizam filtros corretamente, fazendo com que nosso css não seja inserido e o checkout apresente problemas, como ícones grandes e afins. Contornamos o problema aqui. </li>\n</ul>\n<h4>4.11.3</h4>\n<ul>\n<li>Correção em falha que impedia o EnvioFacil de ser habilitado</li>\n</ul>\n<h4>4.11.2</h4>\n<ul>\n<li>Correção: em alguns cenários, o campo de CPF, número do endereço e bairro não eram enviados corretamente ocasionando falha no fechamento do pedido (especialmente em Boletos).</li>\n</ul>\n<h4>4.11.1</h4>\n<ul>\n<li>Correção: nosso validador de chaves pix adicionado na versão anterior apontava para pedidos não-pix</li>\n<li>Correção: a mensagem de validação do pix não era ignorada em alguns cenários após dispensá-la</li>\n</ul>\n<h4>4.11.0</h4>\n<ul>\n<li>Melhoria: agora o plugin exibe uma mensagem de erro no admin caso o código PIX esteja sendo gerado incorretamente por conta de algum problema em sua conta PagBank (geralmente porque você não cadastrou a chave aleatória).</li>\n<li>Correção: o valor dos produtos era informado de forma incorreta ao PagBank quando múltiplos do mesmo item estavam presentes no pedido (embora o valor cobrado estivesse correto).</li>\n</ul>\n<h4>4.10.2</h4>\n<ul>\n<li>Correção em erro no cálculo de parcelas. Em alguns cenários, dependendo das regras de parcelamento, quando o total de parcelas sem juros era = 1, poderia ocasionar erro na pagina de produto (se as parcelas estivessem sendo exibidas la) e no dropdown de parcelamento do checkout.</li>\n<li>Correções diversas em warnings e notices em versões mais novas do PHP 8.1 e 8.2 que poderiam aparecer no admin, e em algumas etapas do pedido quando modo debug estava ativo. </li>\n</ul>\n<h4>4.10.1</h4>\n<ul>\n<li>Correção de erro &#8220;get_cart was called incorrectly&#8221; era exibido quando usado em conjunto com alguns outros plugins (como Mercado Pago), em alguns casos quebrando o carrinho.</li>\n<li>Alteramos a forma como o uso de shortcode de parcelamento é usado. Agora você deve habilitar ele nas configurações. Isso evita que ele seja adicionado em duplicidade.</li>\n<li>Corrigido falha na compra de produto recorrente quando meios de pagamento eram configurados para ser exibidos de forma separada. A mensagem Método de pagamento inválido era exibida.</li>\n<li>Melhoramos a descrição de alguns dos campos de configuração de cartão de crédito, a fim de deixar mais claro o que cada um faz e com mais links para documentação.</li>\n</ul>\n<h4>4.10.0</h4>\n<ul>\n<li>Emails: agora o administrador e cliente só receberão e-mails notificando que um pedido foi criado se o mesmo tiver sido pago.</li>\n<li>Correção/Mudança: agora pessoas com permissão de gerente de loja e administradores poderão ter acesso ao menu PagBank. Antes somente administradores tinham acesso.</li>\n<li>Agora é possível usar o shortcode [rm_pagbank_credit_card_installments] para exibir as parcelas de um produto em layouts personalizados.</li>\n<li>Corrigido Erro na exibição das parcelas quando opção &#8216;Texto com parcela máxima&#8217; era selecionado em alguns cenários.</li>\n</ul>\n<h4>4.9.3</h4>\n<ul>\n<li>Correção: quando usado em conjunto com alguns plugins, chamadas ao jQuery falhavam e impediam a finalização do checkout com erros na criptografia do cartão, entre outras coisas.</li>\n<li>Correção: quando linhas em branco eram inseridas pelo wp-load ou um de seus arquivos/plugins, a imagem dinâmica dos ícones das formas de pagamento não eram exibidas corretamente.</li>\n<li>Correção: ao desativar o plugin um modal de feedback é exibido. No entanto, se a pessoa mudasse de ideia e clicasse em Cancelar, nada acontecia.</li>\n</ul>\n<h4>4.9.2</h4>\n<ul>\n<li>Correção: ícones muito grandes em alguns temas</li>\n<li>Correção: ao clicar em &#8220;Configurar&#8221; na lista de pagamentos (ao invés de ir em PagBank &gt; Configurações) nenhuma alteração feita era salva.</li>\n</ul>\n<h4>4.9.1</h4>\n<ul>\n<li>Correção: quando exibir meios de pagamento de forma separada estava ativada, os meios de pagamento apareciam mesmo quando desativados.</li>\n</ul>\n<h4>4.9.0</h4>\n<ul>\n<li>Agora é possível exibir os meios de pagamento de forma individual (ideal para caso você aceite outros meios de pagamento além do PagBank)</li>\n<li>Agora quando um carrinho for recorrente (contiver produtos recorrentes PagBank), somente os meios PagBank suportados serão exibidos. </li>\n</ul>\n<h4>4.8.0</h4>\n<ul>\n<li>Agora é possível exibir informações de parcelamento na página do produto em 3 formatos diferentes</li>\n</ul>\n<h4>4.7.2</h4>\n<ul>\n<li>Melhoria: agora ao desativar o plugin damos a opção de você adicionar um comentário com mais detalhes sobre o motivo da desativação.</li>\n<li>Melhoria: agora exibimos um aviso no admin caso o checkout em blocos esteja em uso.</li>\n</ul>\n<h4>4.7.1</h4>\n<ul>\n<li>Melhorias gerais no JavaScript do plugin</li>\n<li>Melhoria: adicionado métodos de criptografia no Helper do plugin. Por enquanto usado somente em um caso específico na página de pagamento avulso (order-pay).</li>\n<li>Correção: cálculo de parcelas poderia falhar em alguns cenários quando usado em modo Sandbox, exibindo uma opção com mensagem &#8220;undefined&#8230;&#8221;.</li>\n<li>Correção: ao fazer um pedido com pix ou boleto e navegar até a área de meus pedidos, o cliente pode clicar em Pagar e escolher outro meio de pagamento. No entanto, pagamento com cartão e 3Ds não funcionava nesta página. Refizemos algumas coisas para tornar isso possível. Isso também traz compatibilidade a plugins de autorização de pedido (como Order Approval for Woocommerce). Reportado por Tiago da Tikovolpe.</li>\n<li>Melhoria: instalação via composer agora sugere que habilite extensão openssl do PHP, a fim de ter melhor criptografia. No momento a criptografia só é usada para o número do pedido, na página de pagamento avulso (/order-pay).</li>\n<li>Melhorias: code standards</li>\n</ul>\n<h4>4.7.0</h4>\n<ul>\n<li>Melhoria: cliente passa a receber e-mail informando que o pedido foi cancelado automaticamente após expiração do PIX. Sugerido por Fellipe (The Growth Space). </li>\n<li>Melhoria: agora é possível excluir o valor frete ao dar desconto em boleto e pix, aplicando o desconto somente aos produtos. Sugerido por Fabio (Kaizen Digital). </li>\n</ul>\n<h4>4.6.3</h4>\n<ul>\n<li>Melhoria/Correção: quando determinada configuracao do php era realizada, os ícones dos meios de pagamento não eram exibidos. Reportado por Daniel Carvalho.</li>\n</ul>\n<h4>4.6.2</h4>\n<ul>\n<li>Adicionado suporte ao WooCommerce 6.5</li>\n<li>Adicionado dependencia do plugin Brazilian Market on WooCommerce, evitando erros de campos obrigatórios em algumas lojas</li>\n<li>Pequenas melhorias de segurança (wp standards compliance)</li>\n</ul>\n<h4>4.6.1</h4>\n<ul>\n<li>Correção: quando o cliente digitava um cartão inválido ou incompleto e tentava finalizar o pedido, ocasionando falha na criptografia do cartão, o pedido ainda era submetido para o backend e gerando outros erros desnecessários, especialmente se outros campos também estivessem errados ou faltando. O mais clássico era o erro 40002 de encrypted_card.id incorreto.</li>\n<li>Correção: ao desativar e ativar novamente o plugin, um erro de SQL era gerado internamente devido a um bug no WordPress e uma mensagem de que o plugin teria gerado cerca de 1400 caracteres de saída inesperada durante a ativação era exibida no backend.</li>\n</ul>\n<h4>4.6.0</h4>\n<ul>\n<li>Pedidos PIX agora são cancelados automaticamente após periodo de expiração se não forem pagos</li>\n<li>Em alguns checkouts com plugins personalizados (ex: cartflows) o CSS de nosso plugin não era inserido corretamente, ocasionando quebra de layout e ignorando as cores dos ícones configuradas.</li>\n<li>Ao desativar nosso plugin, agora exibimos uma pergunta sobre o  &hellip;</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/pagbank-connect.4.17.0.zip",
    "upgrade_notice": {
        "": "<p>Ao atualizar nosso plugin, você se protege contra falhas de funcionamento e segurança e aumenta suas chances de conversão no momento mais importante do ciclo de vendas.</p>\n\n<p>Ao atualizar versões majoritárias (ex: 3.5 para 4.0), certifique-se de testar rigorosamente sua integração, pois mudanças deste tipo tendem a trazer incompatibilidades entre versões.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/pagbank-connect/assets/screenshot-1.jpg?rev=3020073",
            "caption": "Cartão de Crédito na visão do cliente"
        },
        {
            "src": "https://ps.w.org/pagbank-connect/assets/screenshot-2.jpg?rev=3020073",
            "caption": "PIX - Tela de Sucesso"
        },
        {
            "src": "https://ps.w.org/pagbank-connect/assets/screenshot-3.jpg?rev=3020073",
            "caption": "Configurações de cartão de crédito"
        },
        {
            "src": "https://ps.w.org/pagbank-connect/assets/screenshot-4.jpg?rev=3020073",
            "caption": "PIX e Boleto - Configurações"
        },
        {
            "src": "https://ps.w.org/pagbank-connect/assets/screenshot-5.jpg?rev=3020073",
            "caption": "Admin - Tela do Pedido"
        },
        {
            "src": "https://ps.w.org/pagbank-connect/assets/screenshot-6.jpg?rev=3020073",
            "caption": "Envio Fácil"
        },
        {
            "src": "https://ps.w.org/pagbank-connect/assets/screenshot-7.jpg?rev=3020073",
            "caption": "Autenticação 3D Secure"
        },
        {
            "src": "https://ps.w.org/pagbank-connect/assets/screenshot-8.jpg?rev=3027193",
            "caption": "Pedidos Recorrentes (assinaturas)"
        }
    ],
    "tags": {
        "cartao-de-credito": "cartão de crédito",
        "pagamento": "Pagamento",
        "pagbank": "pagbank",
        "pagseguro": "pagseguro",
        "pix": "pix"
    },
    "stable_tag": "4.17.0",
    "versions": {
        "4.10.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.10.0.zip",
        "4.10.1": "https://downloads.wordpress.org/plugin/pagbank-connect.4.10.1.zip",
        "4.10.2": "https://downloads.wordpress.org/plugin/pagbank-connect.4.10.2.zip",
        "4.11.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.11.0.zip",
        "4.11.1": "https://downloads.wordpress.org/plugin/pagbank-connect.4.11.1.zip",
        "4.11.2": "https://downloads.wordpress.org/plugin/pagbank-connect.4.11.2.zip",
        "4.11.3": "https://downloads.wordpress.org/plugin/pagbank-connect.4.11.3.zip",
        "4.11.4": "https://downloads.wordpress.org/plugin/pagbank-connect.4.11.4.zip",
        "4.11.5": "https://downloads.wordpress.org/plugin/pagbank-connect.4.11.5.zip",
        "4.11.6": "https://downloads.wordpress.org/plugin/pagbank-connect.4.11.6.zip",
        "4.11.7": "https://downloads.wordpress.org/plugin/pagbank-connect.4.11.7.zip",
        "4.12.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.12.0.zip",
        "4.13.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.13.0.zip",
        "4.14.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.14.0.zip",
        "4.15.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.15.0.zip",
        "4.16.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.16.0.zip",
        "4.17.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.17.0.zip",
        "4.2.10": "https://downloads.wordpress.org/plugin/pagbank-connect.4.2.10.zip",
        "4.2.11": "https://downloads.wordpress.org/plugin/pagbank-connect.4.2.11.zip",
        "4.2.12": "https://downloads.wordpress.org/plugin/pagbank-connect.4.2.12.zip",
        "4.2.13": "https://downloads.wordpress.org/plugin/pagbank-connect.4.2.13.zip",
        "4.2.14": "https://downloads.wordpress.org/plugin/pagbank-connect.4.2.14.zip",
        "4.2.6": "https://downloads.wordpress.org/plugin/pagbank-connect.4.2.6.zip",
        "4.2.7": "https://downloads.wordpress.org/plugin/pagbank-connect.4.2.7.zip",
        "4.2.8": "https://downloads.wordpress.org/plugin/pagbank-connect.4.2.8.zip",
        "4.2.9": "https://downloads.wordpress.org/plugin/pagbank-connect.4.2.9.zip",
        "4.3.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.3.0.zip",
        "4.3.1": "https://downloads.wordpress.org/plugin/pagbank-connect.4.3.1.zip",
        "4.4.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.4.0.zip",
        "4.4.1": "https://downloads.wordpress.org/plugin/pagbank-connect.4.4.1.zip",
        "4.4.2": "https://downloads.wordpress.org/plugin/pagbank-connect.4.4.2.zip",
        "4.4.3": "https://downloads.wordpress.org/plugin/pagbank-connect.4.4.3.zip",
        "4.4.4": "https://downloads.wordpress.org/plugin/pagbank-connect.4.4.4.zip",
        "4.5.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.5.0.zip",
        "4.6.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.6.0.zip",
        "4.6.1": "https://downloads.wordpress.org/plugin/pagbank-connect.4.6.1.zip",
        "4.6.2": "https://downloads.wordpress.org/plugin/pagbank-connect.4.6.2.zip",
        "4.6.3": "https://downloads.wordpress.org/plugin/pagbank-connect.4.6.3.zip",
        "4.7.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.7.0.zip",
        "4.7.1": "https://downloads.wordpress.org/plugin/pagbank-connect.4.7.1.zip",
        "4.7.2": "https://downloads.wordpress.org/plugin/pagbank-connect.4.7.2.zip",
        "4.8.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.8.0.zip",
        "4.9.0": "https://downloads.wordpress.org/plugin/pagbank-connect.4.9.0.zip",
        "4.9.1": "https://downloads.wordpress.org/plugin/pagbank-connect.4.9.1.zip",
        "4.9.2": "https://downloads.wordpress.org/plugin/pagbank-connect.4.9.2.zip",
        "4.9.3": "https://downloads.wordpress.org/plugin/pagbank-connect.4.9.3.zip",
        "trunk": "https://downloads.wordpress.org/plugin/pagbank-connect.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://github.com/sponsors/r-martins",
    "banners": {
        "low": "https://ps.w.org/pagbank-connect/assets/banner-772x250.jpg?rev=3029218",
        "high": "https://ps.w.org/pagbank-connect/assets/banner-1544x500.jpg?rev=3029218"
    },
    "icons": {
        "1x": "https://ps.w.org/pagbank-connect/assets/icon.svg?rev=3022080",
        "svg": "https://ps.w.org/pagbank-connect/assets/icon.svg?rev=3022080"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/pagbank-connect/blueprint.json?rev=3153086"
        }
    ],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "pagbank-connect",
            "language": "pt_BR",
            "version": "4.16.0",
            "updated": "2024-05-21 07:28:42",
            "package": "https://downloads.wordpress.org/translation/plugin/pagbank-connect/4.16.0/pt_BR.zip"
        }
    ]
}