{
    "name": "Page Restriction WordPress (WP) &#8211; Protect WP Pages/Post",
    "slug": "page-and-post-restriction",
    "version": "1.3.6",
    "author": "<a href=\"https://miniorange.com\">miniOrange</a>",
    "author_profile": "https://profiles.wordpress.org/cyberlord92/",
    "contributors": {
        "miniorange": {
            "profile": "https://profiles.wordpress.org/miniorange/",
            "avatar": "https://secure.gravatar.com/avatar/b76018c6531a7fb0c25caa52bd19ea34?s=96&d=monsterid&r=g",
            "display_name": "miniorange"
        }
    },
    "requires": "3.7",
    "tested": "6.5.5",
    "requires_php": "5.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 86,
    "ratings": {
        "5": 9,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 11,
    "support_url": "https://wordpress.org/support/plugin/page-and-post-restriction/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 24079,
    "last_updated": "2024-07-22 12:16pm GMT",
    "added": "2020-08-07",
    "homepage": "",
    "sections": {
        "description": "<p>CONTENT RESTRICTION / PAGE POST RESTRICTION | PROTECT CONTENT FOR WORDPRESS</p>\n<p>Content Restriction provide control of the entire content of your WordPress sites. This includes Page Restriction and Post Restriction i.e. Content restriction according to User Roles. You can Protect content by setting consent for single-entity users on WordPress sites based on their roles. Here a user role has permission to access a page; the authorization enables access to that user. By default, all roles will have access to the content of the page.<br />\nPage Restriction provides page protection by allowing content access to only Logged In Users to specific or all pages. Restrict access of your pages to logged-out users by showing them an error message letting them know they do not have permission to look into the content on the particular page.</p>\n<p>Besides Page Restrictions, we also provide Post Restrictions (Content restriction) feature which helps to Protect content by Restricting access for posts on logged-in/out status to users or specific user roles. Our WordPress Post restrictions feature also helps you to Restrict access in categories to logged-in/out users or specific user roles. We Display a custom message to users who do not have permission to view the content or redirect them to a specified URL. In our Page restriction, Post restriction Plugin our Individual Posts feature will enable protection for default posts as well as custom post types.</p>\n<p>Content Restriction also includes role-based capabilities which help in creating new custom roles and provide capabilities. You can create roles and customize them by assigning various WordPress capabilities to them according to requirements. You can also restrict content of your WordPress according to these custom roles with the help of our roles and capabilities feature.</p>\n<p><strong>We provide integration with <a href=\"https://wordpress.org/plugins/miniorange-saml-20-single-sign-on/\" rel=\"ugc\"> SAML Single Sign-On (SAML SSO) </a> and OAuth Single Sign-On (OAuth SSO) which helps in content restriction and allows content access to only those users who are authenticated by the configured Identity Provider or the Identity Server.</strong></p>\n<h3>CONTENT RESTRICTION &#8211; FREE VERSION FEATURES</h3>\n<ul>\n<li><strong>Page restriction</strong>: Restrict pages / Protect Content / Restrict user access by applying Page restriction on all or specific pages of your site. You can apply Page restriction to all the pages or restrict particular pages from the users that are not logged-in. Restricted users will be shown a static / default error message </li>\n<li><strong>Post restriction</strong>: Restrict access for individual posts. Restrict user access by applying Post restriction on all or specific posts. Restrict posts by showing a static / default error message to the users who do not have permission to access the content</li>\n<li><strong>Site restriction</strong>: You can enable site restriction and restrict access of your site to logged-in users and restrict/protect content of your site from those who are not logged- in. Complete site restriction will restrict your entire site and users won’t have the content access. Restricted users will be shown a static / default error message. </li>\n<li><strong>Content Restriction based on user login status</strong>: Restrict content (Page restriction | Post restriction | site restriction | tag restriction | widgets restriction | taxonomies restriction) and allow only logged-in users the content access. Protect content from those who are not logged-in users of the site. Those who are not logged-in won’t have the content access and will be shown a static / default error restriction message </li>\n<li><strong>Restrict content based on one or more WordPress Roles</strong>: This option allows content restriction according to the roles. Assign roles to the users and then give the content access according to the roles assigned to the users. Protect content confidential to a specific user role by restricting other user roles.</li>\n<li><strong>Restrict Pages/Posts while Creating (Meta Box)</strong>: Page restriction / Post restriction option while creating a particular page or post. This provides page restriction and Post restriction options to users while creating and editing posts/pages. This shows all the site’s user roles based on which Page restriction and Post restriction can be made. The meta box also asks if login is required to access the page/post.</li>\n<li><strong>Restrict all of your WordPress pages or posts</strong>:  this option allows you to restrict all the pages or posts available on your WordPress site. This option gives an effortless experience if you want to restrict pages, restrict posts or restrict content as you don’t have to list down individual pages or posts to restrict them from unauthorized users. A convenient way to protect all of your content in one step.</li>\n<li><strong>Unlimited WordPress Content restriction</strong>:  Restrict pages | Restrict posts | Restrict content to an unlimited extent. Any number of Page restrictions | Post restriction | Content restriction is allowed. The Page Restriction Plugin can work with large number of pages, posts and other WordPress content without overloading your servers. You can restrict as many pages / posts as you have in your WordPress, control their content, restrict users to have content access to your WordPress pages / posts and you won’t be held back by safety concerns due to the increasing number of pages/posts in you WordPress site.</li>\n<li><strong>Static Error Message</strong>: Protect content by restricting users who do not have permission to view the content by redirecting to a static / default error message.</li>\n<li><strong>Apply Parent Page Post Restriction to all Child Pages</strong>: Configure restrictions for the parent page and apply to all its child pages. Choose which parent page’s restrictions should be applied to its child pages.  </li>\n<li><strong>Create New Roles</strong>: The Page restriction and post restriction plugin allows you to create new WordPress Roles and assign capabilities as per the requirements. Create unlimited custom roles in your WordPress and protect content according to the user roles created</li>\n<li><strong>Modify Role Capabilities</strong>: Apply different WordPress capabilities to the roles created. Users will be able to update the capabilities of the new roles created as well as modify the capabilities of the custom roles. You can assign / delete / update new capabilities to the default WordPress roles</li>\n<li><strong>Update existing Roles</strong>: Default existing roles can be updated according to the requirements of the users. With the Page restriction plugin, users will be able to edit role names, delete or update roles, create a copy of an existing role etc.</li>\n<li><strong>Restrict using Quick Edit</strong>: Page Restriction / Post Restriction Plugin gives an option of quick edit on the restriction interface to make it convenient for you to edit the content restriction settings without going to the very restricted content.</li>\n<li><strong>Restrict specific blocks/excerpts in a Page/Post</strong>: Restrict specific blocks in the content of pages or posts. Use opening and closing tags of the shortcode anywhere in the page/post to restrict the access to the content present in the between the tags of the shortcode.</li>\n</ul>\n<h3>PAGE RESTRICTION &#8211; PREMIUM VERSION FEATURES</h3>\n<ul>\n<li>All features of the free version</li>\n<li><strong>Restrict Tags</strong>: Restrict users from accessing specific tags. Apply tag restriction on all or specific tags to restrict access of all or specific users from accessing the posts with the tag and the main page of the tag.</li>\n<li><strong>Restrict Nav Menu Items</strong>: Control the access to navigation menu of your site. Protect the content of the navigation menu and restrict specific user roles or logged out users from accessing the navigation menu items. </li>\n<li><strong>Restrict Widgets</strong>: Get better access control of the WordPress widgets. Restrict widgets by hiding them from the users. You can apply widget restriction to all widgets or have an option to restrict particular widgets from the users.</li>\n<li><strong>Restrict Custom Post Types</strong>: Allows extending restrictions of posts to custom post types. Protect posts of custom post types by assigning user roles to a page who can access content of that post.</li>\n<li><strong>Role based Block Restriction</strong>: Restrict blocks to one or more user roles and enable displaying content dynamically on your pages or posts. Allow only specific user roles to view some content on your page or post.</li>\n<li><strong>Post Category restrictions</strong>: Page restriction WordPress plugin controls the visibility of content for post categories without the hassle of editing every post on your site and defining the restrictions individually to logged in/out users or specific user roles</li>\n<li><strong>Restrict access to Meta Box</strong>: Restrict Access to the custom Meta Box based on user roles. This allows you to have control over who can restrict access to a page or post while creating/editing content.</li>\n<li><strong>Custom Error Message</strong>: Restrict content from users who do not have permission to view the protected content by displaying a custom error message.</li>\n<li><strong>Redirect Restricted user to WP Login Page</strong>:  Redirects users who do not have permission to view the restricted content to WordPress default login page (redirects to page/post after login).</li>\n<li><strong>Restrict Category based on User’s Login Status</strong>: Restrict content based on user’s logged in/out status and after successful authentication, redirect back to the restricted page.</li>\n<li><strong>Redirect Restricted User to a URL</strong>: Users trying to access a restricted page (content restrict) will be redirected to a specific page URL. This post restriction / page restriction option lets you modify the behaviour of restricted pages and posts.</li>\n<li><strong>Page Post restriction Plugin Integration with SAML/OAuth SSO</strong>: This page restriction and post restriction feature allows Protected content access to only the users who have been authenticated by the configured IdP. Allows redirecting not logged in users to your Identity Provider /Oauth Server login page.</li>\n</ul>\n<p><strong>WHY DO YOU NEED <a href=\"https://blog.miniorange.com/wordpress-page-post-restriction-addon/\" rel=\"nofollow ugc\">PAGE RESTRICTION WORDPRESS &#8211; PROTECT WP PAGES/POST</a> PLUGIN?</strong></p>\n<p>Managing a website is easier than ever nowadays. Do you have content you only want certain WordPress users to access? Now you can manage content for specific users as well as control or restrict content access for certain groups.</p>\n<p>Page restrictions and Post restrictions permit you to control / protect who can see as well as alter restrictions on individual pages in a space. Content Restriction allows to restrict entire WordPress content (site restriction | tag restriction | widgets restriction | taxonomies restriction) according to the user login status or their WordPress roles.We energetically suggest investigating your site needs and provide you the miniOrange Page Restriction WordPress plugin specially designed for integrating with WordPress Sites to keep your website safe with a user-friendly experience at an affordable price.</p>\n<h3>BENEFITS OF USING CONTENT RESTRICTION WORDPRESS PLUGIN</h3>\n<ul>\n<li><strong>Restrict access to complete site</strong>: Our Page restriction WordPress plugin helps to Protect content on your WordPress site and its feed make it completely private with more flexibility to restrict to private pages. This is very useful for intranet sites.</li>\n<li><strong>Unlimited content restriction</strong>: Content Restriction WordPress provides granular access to your content by applying restrictions on unlimited pages and posts on your site.</li>\n<li><strong>Supports Custom Post Types</strong>: You can even restrict access to custom post types which gives you complete control over your content on WordPress</li>\n<li><strong>Multiple User Roles</strong>: Page Restriction | Post restriction plugin can provide one, two, or even more roles to any pages. Multiple roles could be assigned to pages/posts simultaneously.</li>\n<li><strong>Inherited Restrictions</strong>: Page Restriction | Post restriction plugin helps you to make content restriction as easy as possible by reflecting the changes down to child pages/posts when a restriction is applied to the parent one.</li>\n<li><strong>Customize redirect</strong>: Helps you integrate the plugin seamlessly by allowing you to customize restricted messages and choose login authentication for Single Sign-On (SSO) redirecting to the IDP login page and redirecting to the WP login page.</li>\n<li><strong>Easy to use</strong>: Ease to set up and designed with user-friendly interfaces or Ease of use with protected content integrates User management and role-based content access</li>\n<li><strong>Multi-level content access</strong>: The option to hide content from different user roles and even nested pages</li>\n<li><strong>Restrict Anonymous/Other users</strong>: Our Page and Post restriction plugin limits anonymous/other user roles to your site who are logged in from accessing site content.</li>\n</ul>\n<p><strong>HOW WE ARE DIFFERENT</strong></p>\n<p>miniOrange has various types of deployments that give the customer a safe and protective choice. miniOrange offers a plugin, Cloud, and On-premise server module. We provide a reliable plugin with extended functionality in a cost-beneficial manner to Protect content on your WordPress sites. Our Page restriction WordPress, Post restriction plugin for WordPress sites, carries a lot of features within it like protecting posts, pages, custom post types. . If you are looking for a greater amount of administrative control over your WordPress website in a cost-efficient manner miniOrange is best with the powerful content restriction feature.</p>\n<h3>CONTRIBUTED BY MINIORANGE</h3>\n<p>Page restriction WordPress &#8211; Protect WP Pages/Posts is built by miniOrange. We create high-quality WordPress plugins that help you grow your WordPress sites.<br />\nCheck out our website for other plugins <a href=\"https://plugins.miniorange.com/\" rel=\"nofollow ugc\">https://plugins.miniorange.com/</a> or click here to see all our listed WordPress plugins.</p>\n<h3>DOCUMENTATION</h3>\n<p>Our Page restriction WordPress &#8211; Protect WP Pages/Posts plugin for WordPress comes with detailed setup guidelines with ensured content, expectations to make sure you don’t get lost along the way.<br />\n<a href=\"https://plugins.miniorange.com/wordpress-page-restriction#pagerestriction\" rel=\"nofollow ugc\">https://plugins.miniorange.com/wordpress-page-restriction#pagerestriction</a></p>\n<h3>CONTACT SUPPORT</h3>\n<p>If you are still nervous about your website security or how the plugin would work for you specifically, customized solutions and Active support are available. You can always <a href=\"https://www.miniorange.com/contact/\" rel=\"nofollow ugc\">Contact Us</a>, or Email us at samlsupport@xecurify.com and we would be happy to help you out.</p>\n",
        "installation": "<h4>From your WordPress dashboard</h4>\n<ol>\n<li>Visit <code>Plugins &gt; Add New</code>.</li>\n<li>Search for <code>Page Restriction WordPress</code>. Find and Install <code>Page Restriction WordPress</code>.</li>\n<li>Activate the plugin from your Plugins page.</li>\n</ol>\n<h4>From WordPress.org</h4>\n<ol>\n<li>Download Page Restriction WordPress plugin.</li>\n<li>Unzip and upload the <code>page-and-post-restriction</code> directory to your <code>/wp-content/plugins/</code> directory.</li>\n<li>Activate Page and Post Restriction from your Plugins page.</li>\n</ol>\n",
        "changelog": "<h4>1.3.6</h4>\n<ul>\n<li>Restricted the Rest API endpoint for the Pages and Posts</li>\n<li>Made Few UI Changes in the Plugin.</li>\n</ul>\n<h4>1.3.5</h4>\n<ul>\n<li>Adding a note for REST API Authentication</li>\n<li>Other code Improvements</li>\n</ul>\n<h4>1.3.4</h4>\n<ul>\n<li>Minor Bug fixes</li>\n</ul>\n<h4>1.3.3</h4>\n<ul>\n<li>Bug fix for role restriction</li>\n</ul>\n<h4>1.3.2</h4>\n<ul>\n<li>Compatibility with PHP 8.1 and WP 6.1</li>\n<li>Modified UI of selecting roles</li>\n<li>Updated Bootstrap version </li>\n<li>Resolved Metabox and Quick Edit roles issue </li>\n<li>Other Bug fixes</li>\n</ul>\n<h4>1.3.1</h4>\n<ul>\n<li>Added automatically making pages private if restricted by role</li>\n<li>Usability fixes</li>\n</ul>\n<h4>1.3.0</h4>\n<ul>\n<li>Fixed compatibility issues with older versions of PHP</li>\n</ul>\n<h4>1.2.9</h4>\n<ul>\n<li>WordPress 6.0 compatibility</li>\n<li>Roles and capabilities</li>\n<li>Usability fixes</li>\n</ul>\n<h4>1.2.8</h4>\n<ul>\n<li>Fix for headers sent</li>\n<li>Modified upgrading steps</li>\n<li>Added restrict options link</li>\n</ul>\n<h4>1.2.7</h4>\n<ul>\n<li>Improvements in search</li>\n<li>Added guide link</li>\n<li>Added info for settings</li>\n</ul>\n<h4>1.2.6</h4>\n<ul>\n<li>New User Interface for restrictions</li>\n<li>Introduced Block Restriction</li>\n</ul>\n<h4>1.2.5</h4>\n<ul>\n<li>Removed unwanted CSS/JS</li>\n<li>Fixed restriction with Elementor</li>\n</ul>\n<h4>1.2.4</h4>\n<ul>\n<li>WordPress 5.9 compatibility</li>\n<li>Modified licensing plans</li>\n<li>Fixed support form warning</li>\n</ul>\n<h4>1.2.3</h4>\n<ul>\n<li>Added new licensing plans</li>\n<li>Fixed feedback form</li>\n<li>Fixed metabox issue</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>Fixed issue for post role restriction</li>\n<li>WP 5.8 compatibility</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>License changes</li>\n<li>Bug Fixes</li>\n<li>New Premium feature</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Modified Feedback Form</li>\n<li>Removed General Settings</li>\n<li>UI Fixes</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Fixed Changing of configurations on Page/Post creation</li>\n<li>Fixed Restriction for Home Page</li>\n<li>Fixed Feedback Form compatibility</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Added Account Setup</li>\n<li>Added Support Form</li>\n<li>Added a Premium Plan page</li>\n</ul>\n<h4>0.50</h4>\n<ul>\n<li>This is the first release</li>\n</ul>\n"
    },
    "short_description": "Restrict content access for WordPress (WP) | Restrict pages/posts in WP based on user roles and login status to protect content",
    "description": "<p>CONTENT RESTRICTION / PAGE POST RESTRICTION | PROTECT CONTENT FOR WORDPRESS</p>\n<p>Content Restriction provide control of the entire content of your WordPress sites. This includes Page Restriction and Post Restriction i.e. Content restriction according to User Roles. You can Protect content by setting consent for single-entity users on WordPress sites based on their roles. Here a user role has permission to access a page; the authorization enables access to that user. By default, all roles will have access to the content of the page.<br />\nPage Restriction provides page protection by allowing content access to only Logged In Users to specific or all pages. Restrict access of your pages to logged-out users by showing them an error message letting them know they do not have permission to look into the content on the particular page.</p>\n<p>Besides Page Restrictions, we also provide Post Restrictions (Content restriction) feature which helps to Protect content by Restricting access for posts on logged-in/out status to users or specific user roles. Our WordPress Post restrictions feature also helps you to Restrict access in categories to logged-in/out users or specific user roles. We Display a custom message to users who do not have permission to view the content or redirect them to a specified URL. In our Page restriction, Post restriction Plugin our Individual Posts feature will enable protection for default posts as well as custom post types.</p>\n<p>Content Restriction also includes role-based capabilities which help in creating new custom roles and provide capabilities. You can create roles and customize them by assigning various WordPress capabilities to them according to requirements. You can also restrict content of your WordPress according to these custom roles with the help of our roles and capabilities feature.</p>\n<p><strong>We provide integration with <a href=\"https://wordpress.org/plugins/miniorange-saml-20-single-sign-on/\" rel=\"ugc\"> SAML Single Sign-On (SAML SSO) </a> and OAuth Single Sign-On (OAuth SSO) which helps in content restriction and allows content access to only those users who are authenticated by the configured Identity Provider or the Identity Server.</strong></p>\n<h3>CONTENT RESTRICTION &#8211; FREE VERSION FEATURES</h3>\n<ul>\n<li><strong>Page restriction</strong>: Restrict pages / Protect Content / Restrict user access by applying Page restriction on all or specific pages of your site. You can apply Page restriction to all the pages or restrict particular pages from the users that are not logged-in. Restricted users will be shown a static / default error message </li>\n<li><strong>Post restriction</strong>: Restrict access for individual posts. Restrict user access by applying Post restriction on all or specific posts. Restrict posts by showing a static / default error message to the users who do not have permission to access the content</li>\n<li><strong>Site restriction</strong>: You can enable site restriction and restrict access of your site to logged-in users and restrict/protect content of your site from those who are not logged- in. Complete site restriction will restrict your entire site and users won’t have the content access. Restricted users will be shown a static / default error message. </li>\n<li><strong>Content Restriction based on user login status</strong>: Restrict content (Page restriction | Post restriction | site restriction | tag restriction | widgets restriction | taxonomies restriction) and allow only logged-in users the content access. Protect content from those who are not logged-in users of the site. Those who are not logged-in won’t have the content access and will be shown a static / default error restriction message </li>\n<li><strong>Restrict content based on one or more WordPress Roles</strong>: This option allows content restriction according to the roles. Assign roles to the users and then give the content access according to the roles assigned to the users. Protect content confidential to a specific user role by restricting other user roles.</li>\n<li><strong>Restrict Pages/Posts while Creating (Meta Box)</strong>: Page restriction / Post restriction option while creating a particular page or post. This provides page restriction and Post restriction options to users while creating and editing posts/pages. This shows all the site’s user roles based on which Page restriction and Post restriction can be made. The meta box also asks if login is required to access the page/post.</li>\n<li><strong>Restrict all of your WordPress pages or posts</strong>:  this option allows you to restrict all the pages or posts available on your WordPress site. This option gives an effortless experience if you want to restrict pages, restrict posts or restrict content as you don’t have to list down individual pages or posts to restrict them from unauthorized users. A convenient way to protect all of your content in one step.</li>\n<li><strong>Unlimited WordPress Content restriction</strong>:  Restrict pages | Restrict posts | Restrict content to an unlimited extent. Any number of Page restrictions | Post restriction | Content restriction is allowed. The Page Restriction Plugin can work with large number of pages, posts and other WordPress content without overloading your servers. You can restrict as many pages / posts as you have in your WordPress, control their content, restrict users to have content access to your WordPress pages / posts and you won’t be held back by safety concerns due to the increasing number of pages/posts in you WordPress site.</li>\n<li><strong>Static Error Message</strong>: Protect content by restricting users who do not have permission to view the content by redirecting to a static / default error message.</li>\n<li><strong>Apply Parent Page Post Restriction to all Child Pages</strong>: Configure restrictions for the parent page and apply to all its child pages. Choose which parent page’s restrictions should be applied to its child pages.  </li>\n<li><strong>Create New Roles</strong>: The Page restriction and post restriction plugin allows you to create new WordPress Roles and assign capabilities as per the requirements. Create unlimited custom roles in your WordPress and protect content according to the user roles created</li>\n<li><strong>Modify Role Capabilities</strong>: Apply different WordPress capabilities to the roles created. Users will be able to update the capabilities of the new roles created as well as modify the capabilities of the custom roles. You can assign / delete / update new capabilities to the default WordPress roles</li>\n<li><strong>Update existing Roles</strong>: Default existing roles can be updated according to the requirements of the users. With the Page restriction plugin, users will be able to edit role names, delete or update roles, create a copy of an existing role etc.</li>\n<li><strong>Restrict using Quick Edit</strong>: Page Restriction / Post Restriction Plugin gives an option of quick edit on the restriction interface to make it convenient for you to edit the content restriction settings without going to the very restricted content.</li>\n<li><strong>Restrict specific blocks/excerpts in a Page/Post</strong>: Restrict specific blocks in the content of pages or posts. Use opening and closing tags of the shortcode anywhere in the page/post to restrict the access to the content present in the between the tags of the shortcode.</li>\n</ul>\n<h3>PAGE RESTRICTION &#8211; PREMIUM VERSION FEATURES</h3>\n<ul>\n<li>All features of the free version</li>\n<li><strong>Restrict Tags</strong>: Restrict users from accessing specific tags. Apply tag restriction on all or specific tags to restrict access of all or specific users from accessing the posts with the tag and the main page of the tag.</li>\n<li><strong>Restrict Nav Menu Items</strong>: Control the access to navigation menu of your site. Protect the content of the navigation menu and restrict specific user roles or logged out users from accessing the navigation menu items. </li>\n<li><strong>Restrict Widgets</strong>: Get better access control of the WordPress widgets. Restrict widgets by hiding them from the users. You can apply widget restriction to all widgets or have an option to restrict particular widgets from the users.</li>\n<li><strong>Restrict Custom Post Types</strong>: Allows extending restrictions of posts to custom post types. Protect posts of custom post types by assigning user roles to a page who can access content of that post.</li>\n<li><strong>Role based Block Restriction</strong>: Restrict blocks to one or more user roles and enable displaying content dynamically on your pages or posts. Allow only specific user roles to view some content on your page or post.</li>\n<li><strong>Post Category restrictions</strong>: Page restriction WordPress plugin controls the visibility of content for post categories without the hassle of editing every post on your site and defining the restrictions individually to logged in/out users or specific user roles</li>\n<li><strong>Restrict access to Meta Box</strong>: Restrict Access to the custom Meta Box based on user roles. This allows you to have control over who can restrict access to a page or post while creating/editing content.</li>\n<li><strong>Custom Error Message</strong>: Restrict content from users who do not have permission to view the protected content by displaying a custom error message.</li>\n<li><strong>Redirect Restricted user to WP Login Page</strong>:  Redirects users who do not have permission to view the restricted content to WordPress default login page (redirects to page/post after login).</li>\n<li><strong>Restrict Category based on User’s Login Status</strong>: Restrict content based on user’s logged in/out status and after successful authentication, redirect back to the restricted page.</li>\n<li><strong>Redirect Restricted User to a URL</strong>: Users trying to access a restricted page (content restrict) will be redirected to a specific page URL. This post restriction / page restriction option lets you modify the behaviour of restricted pages and posts.</li>\n<li><strong>Page Post restriction Plugin Integration with SAML/OAuth SSO</strong>: This page restriction and post restriction feature allows Protected content access to only the users who have been authenticated by the configured IdP. Allows redirecting not logged in users to your Identity Provider /Oauth Server login page.</li>\n</ul>\n<p><strong>WHY DO YOU NEED <a href=\"https://blog.miniorange.com/wordpress-page-post-restriction-addon/\" rel=\"nofollow ugc\">PAGE RESTRICTION WORDPRESS &#8211; PROTECT WP PAGES/POST</a> PLUGIN?</strong></p>\n<p>Managing a website is easier than ever nowadays. Do you have content you only want certain WordPress users to access? Now you can manage content for specific users as well as control or restrict content access for certain groups.</p>\n<p>Page restrictions and Post restrictions permit you to control / protect who can see as well as alter restrictions on individual pages in a space. Content Restriction allows to restrict entire WordPress content (site restriction | tag restriction | widgets restriction | taxonomies restriction) according to the user login status or their WordPress roles.We energetically suggest investigating your site needs and provide you the miniOrange Page Restriction WordPress plugin specially designed for integrating with WordPress Sites to keep your website safe with a user-friendly experience at an affordable price.</p>\n<h3>BENEFITS OF USING CONTENT RESTRICTION WORDPRESS PLUGIN</h3>\n<ul>\n<li><strong>Restrict access to complete site</strong>: Our Page restriction WordPress plugin helps to Protect content on your WordPress site and its feed make it completely private with more flexibility to restrict to private pages. This is very useful for intranet sites.</li>\n<li><strong>Unlimited content restriction</strong>: Content Restriction WordPress provides granular access to your content by applying restrictions on unlimited pages and posts on your site.</li>\n<li><strong>Supports Custom Post Types</strong>: You can even restrict access to custom post types which gives you complete control over your content on WordPress</li>\n<li><strong>Multiple User Roles</strong>: Page Restriction | Post restriction plugin can provide one, two, or even more roles to any pages. Multiple roles could be assigned to pages/posts simultaneously.</li>\n<li><strong>Inherited Restrictions</strong>: Page Restriction | Post restriction plugin helps you to make content restriction as easy as possible by reflecting the changes down to child pages/posts when a restriction is applied to the parent one.</li>\n<li><strong>Customize redirect</strong>: Helps you integrate the plugin seamlessly by allowing you to customize restricted messages and choose login authentication for Single Sign-On (SSO) redirecting to the IDP login page and redirecting to the WP login page.</li>\n<li><strong>Easy to use</strong>: Ease to set up and designed with user-friendly interfaces or Ease of use with protected content integrates User management and role-based content access</li>\n<li><strong>Multi-level content access</strong>: The option to hide content from different user roles and even nested pages</li>\n<li><strong>Restrict Anonymous/Other users</strong>: Our Page and Post restriction plugin limits anonymous/other user roles to your site who are logged in from accessing site content.</li>\n</ul>\n<p><strong>HOW WE ARE DIFFERENT</strong></p>\n<p>miniOrange has various types of deployments that give the customer a safe and protective choice. miniOrange offers a plugin, Cloud, and On-premise server module. We provide a reliable plugin with extended functionality in a cost-beneficial manner to Protect content on your WordPress sites. Our Page restriction WordPress, Post restriction plugin for WordPress sites, carries a lot of features within it like protecting posts, pages, custom post types. . If you are looking for a greater amount of administrative control over your WordPress website in a cost-efficient manner miniOrange is best with the powerful content restriction feature.</p>\n<h3>CONTRIBUTED BY MINIORANGE</h3>\n<p>Page restriction WordPress &#8211; Protect WP Pages/Posts is built by miniOrange. We create high-quality WordPress plugins that help you grow your WordPress sites.<br />\nCheck out our website for other plugins <a href=\"https://plugins.miniorange.com/\" rel=\"nofollow ugc\">https://plugins.miniorange.com/</a> or click here to see all our listed WordPress plugins.</p>\n<h3>DOCUMENTATION</h3>\n<p>Our Page restriction WordPress &#8211; Protect WP Pages/Posts plugin for WordPress comes with detailed setup guidelines with ensured content, expectations to make sure you don’t get lost along the way.<br />\n<a href=\"https://plugins.miniorange.com/wordpress-page-restriction#pagerestriction\" rel=\"nofollow ugc\">https://plugins.miniorange.com/wordpress-page-restriction#pagerestriction</a></p>\n<h3>CONTACT SUPPORT</h3>\n<p>If you are still nervous about your website security or how the plugin would work for you specifically, customized solutions and Active support are available. You can always <a href=\"https://www.miniorange.com/contact/\" rel=\"nofollow ugc\">Contact Us</a>, or Email us at samlsupport@xecurify.com and we would be happy to help you out.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.3.6.zip",
    "upgrade_notice": {
        "1.3.6": "<ul>\n<li>Restricted the Rest API endpoint for the Pages and Posts</li>\n<li>Made Few UI Changes in the Plugin.</li>\n</ul>",
        "1.3.5": "<ul>\n<li>Adding a note for REST API Authentication</li>\n<li>Other code Improvements</li>\n</ul>",
        "1.3.4": "<ul>\n<li>Minor Bug fixes</li>\n</ul>",
        "1.3.3": "<ul>\n<li>Bug fix for role restriction</li>\n</ul>",
        "1.3.2": "<ul>\n<li>Compatibility with PHP 8.1 and WP 6.1</li>\n<li>Modified UI of selecting roles</li>\n<li>Updated Bootstrap version </li>\n<li>Resolved Metabox and Quick Edit roles issue </li>\n<li>Other Bug fixes</li>\n</ul>",
        "1.3.1": "<ul>\n<li>Added automatically making pages private if restricted by role</li>\n<li>Usability fixes</li>\n</ul>",
        "1.3.0": "<ul>\n<li>Fixed compatibility issues with older versions of PHP</li>\n</ul>",
        "1.2.9": "<ul>\n<li>WordPress 6.0 compatibility</li>\n<li>Roles and capabilities</li>\n<li>Usability fixes</li>\n</ul>",
        "1.2.8": "<ul>\n<li>Fix for headers sent</li>\n<li>Modified upgrading steps</li>\n<li>Added restrict options link</li>\n</ul>",
        "1.2.7": "<ul>\n<li>Improvements in search</li>\n<li>Added guide link</li>\n<li>Added info for settings</li>\n</ul>",
        "1.2.6": "<ul>\n<li>New User Interface for restrictions</li>\n<li>Introduced Block Restriction</li>\n</ul>",
        "1.2.5": "<ul>\n<li>Removed unwanted CSS/JS</li>\n<li>Fixed restriction with Elementor</li>\n</ul>",
        "1.2.4": "<ul>\n<li>WordPress 5.9 compatibility</li>\n<li>Modified licensing plans</li>\n<li>Fixed support form warning</li>\n</ul>",
        "1.2.3": "<ul>\n<li>Added new licensing plans</li>\n<li>Fixed feedback form</li>\n<li>Fixed metabox issue</li>\n</ul>",
        "1.2.2": "<ul>\n<li>Fixed issue for post role restriction</li>\n<li>WP 5.8 compatibility</li>\n</ul>",
        "1.2.1": "<ul>\n<li>License changes</li>\n<li>Bug Fixes</li>\n<li>New Premium feature</li>\n</ul>",
        "1.2.0": "<ul>\n<li>Modified Feedback Form</li>\n<li>Removed General Settings</li>\n<li>UI Fixes</li>\n</ul>",
        "1.1.0": "<ul>\n<li>Fixed Changing of configurations on Page/Post creation</li>\n<li>Fixed Restriction for Home Page</li>\n<li>Fixed Feedback Form compatibility</li>\n</ul>",
        "1.0.0": "<ul>\n<li>Added Account Setup</li>\n<li>Added Support Form</li>\n<li>Added a Premium Plan page</li>\n</ul>",
        "0.50": "<ul>\n<li>This is the first release</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/page-and-post-restriction/assets/screenshot-1.jpg?rev=2354633",
            "caption": "Restrict Access to Posts/Pages based on User Roles."
        },
        {
            "src": "https://ps.w.org/page-and-post-restriction/assets/screenshot-2.jpg?rev=2354633",
            "caption": "Restrict Access to only Logged in Users."
        },
        {
            "src": "https://ps.w.org/page-and-post-restriction/assets/screenshot-3.jpg?rev=2354633",
            "caption": "Restrict Access to Meta-box based on User Roles."
        }
    ],
    "tags": {
        "content-restriction": "content restriction",
        "page-restriction": "page restriction",
        "post-restriction": "Post Restriction",
        "restrict-access": "Restrict access",
        "restrict-content": "restrict content"
    },
    "stable_tag": "1.3.6",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.0.0.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.1.0.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.2.6.zip",
        "1.2.7": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.2.7.zip",
        "1.2.8": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.2.8.zip",
        "1.2.9": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.2.9.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/page-and-post-restriction.1.3.6.zip",
        "trunk": "https://downloads.wordpress.org/plugin/page-and-post-restriction.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://miniorange.com",
    "banners": {
        "low": "https://ps.w.org/page-and-post-restriction/assets/banner-772x250.png?rev=2355810",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/page-and-post-restriction/assets/icon-128x128.png?rev=2655028"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 86,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/page-and-post-restriction/blueprint.json?rev=3123194"
        }
    ],
    "preview_link": "https://wordpress.org/plugins/page-and-post-restriction/?preview=1",
    "language_packs": []
}