{
    "name": "Page View Count",
    "slug": "page-views-count",
    "version": "2.8.4",
    "author": "<a href=\"https://a3rev.com\">a3rev Software</a>",
    "author_profile": "https://profiles.wordpress.org/a3rev/",
    "contributors": {
        "a3rev": {
            "profile": "https://profiles.wordpress.org/a3rev/",
            "avatar": "https://secure.gravatar.com/avatar/823503e64030a5f3746b7ecc3f8bdb8d?s=96&d=monsterid&r=g",
            "display_name": "Steve Truman"
        },
        "nguyencongtuan": {
            "profile": "https://profiles.wordpress.org/nguyencongtuan/",
            "avatar": "https://secure.gravatar.com/avatar/bb27336336fd63b7758e1c4c56a53b85?s=96&d=monsterid&r=g",
            "display_name": "Nguyen Tuan"
        }
    },
    "requires": "6.0",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 78,
    "ratings": {
        "5": 34,
        "4": 3,
        "3": 2,
        "2": 6,
        "1": 8
    },
    "num_ratings": 53,
    "support_url": "https://wordpress.org/support/plugin/page-views-count/",
    "support_threads": 2,
    "support_threads_resolved": 0,
    "active_installs": 20000,
    "downloaded": 659879,
    "last_updated": "2024-07-15 8:55am GMT",
    "added": "2012-12-21",
    "homepage": "",
    "sections": {
        "description": "<p>A beautifully simple to set up plugin that gives site visitors and site owners the ability to quickly and easily see how many people have visited that page or post.</p>\n<h4>FEATURES</h4>\n<ul>\n<li>On the front end it adds an icon and page views count to the bottom or top of pages and posts on your WordPress website.</li>\n<li>Switch ON | OFF hide Page Views Count for all Posts, Pages and all custom posts types including WooCommerce custom post types.</li>\n<li>Set the Position of the counter to show at the top of the page or post or at the bottom</li>\n<li>Set alignment of the counter Left, Right or Centre</li>\n<li>Set the colour and size of the counter icon</li>\n<li>Option to use load by Ajax to prevent the count from being cached by caching plugins </li>\n<li>Option to Manually set / edit total views and views today from Page View Count meta box on any post or page editor</li>\n<li>Add Page Views counter via the PVC Gutenberg block </li>\n<li>Add Page Views counter via shortcode</li>\n<li>Add Page Views counter via widget</li>\n<li>Developers can add the Page Views Counter via php tag</li>\n<li>All options and settings are point click &#8211; absolutely no coding required  </li>\n</ul>\n<h4>COMPATIBILTY</h4>\n<p>Compatible with WordPress 5.9+ and backwards to WP 5.6.0 Compatible with Classic Editor plugin (Gutenberg editor Deactivated)</p>\n<h4>GUTENBERG BLOCK</h4>\n<p>Using the Gutenberg Editor. Use the Page View Count Block to add the counter to any page or post content.  Block search for &#8216;Page Views&#8217; or selecting the block from the a3rev Blocks menu.</p>\n<p>Adding the Page Views block to your content automatically deactivates the Global Page View counter on the post or page.</p>\n<h4>ELEMENTOR TEMPLATES</h4>\n<p>Fully compatible with Elementor templates. Add counter via Shortcode or widget to any template.</p>\n<h4>DEVELOPERS</h4>\n<p>On the plugins dashboard in the + Page Views Count Function options box you will find the Page Views Count functions and notes on how to use them.</p>\n<ul>\n<li>Use to manually add Page views count to any content or object in the theme. </li>\n<li>Use to add page View Count to any content that is not create using WordPress custom post / taxonomy type. </li>\n<li>Use to create a custom position of the Page Views Count </li>\n<li>Functions support echo and return parameters when getting visitor stats on any variable.</li>\n</ul>\n<h4>TROUBLESHOOTING</h4>\n<ul>\n<li>The number 1 support request we get about the plugin is that it double or triple counts page or post loads. Yes it does and if you see that it is a Red Flag that you have a misconfiguration or bug in your theme or a plugin. Page Views Count does exactly that &#8211; counts each time the page or post is loading in the browser &#8211; if its counting twice it is because the browser is double loading the page. That is a bad thing and you or your developer needs to fix that.</li>\n</ul>\n<h4>CONTRIBUTE</h4>\n<p>When you download Page Views Count, you join our community. Regardless of if you are a WordPress beginner or experienced developer if you&#8217;’re interested in contributing to Page Views Count development head over to the <a href=\"https://github.com/a3rev/page-views-count\" rel=\"nofollow ugc\">Page Views Count GitHub Repository</a> to find out how you can contribute.<br />\nWant to add a new language to Page Views Count? Great! You can contribute via <a href=\"https://translate.wordpress.org/projects/wp-plugins/page-views-count\" rel=\"nofollow ugc\">translate.wordpress.org</a></p>\n<h3>Usage</h3>\n<ol>\n<li>\n<p>Install and activate the plugin</p>\n</li>\n<li>\n<p>Go to WordPress Settings menu &gt; Page View Count Menu</p>\n</li>\n<li>\n<p>Activate Page Views Count and use the options box settings to make the desired configuration</p>\n</li>\n<li>\n<p>Be sure to clear any caching and browser cache to see your Page Views Count</p>\n</li>\n</ol>\n",
        "installation": "<h4>Minimum Requirements</h4>\n<ul>\n<li>PHP version 7.4 or greater is recommended</li>\n<li>MySQL version 5.6 or greater is recommended</li>\n</ul>\n<h4>Automatic installation</h4>\n<p>Automatic installation is the easiest option as WordPress handles the file transfers itself and you don&#8217;t even need to leave your web browser. To do an automatic install of Page Views Count, log in to your WordPress admin panel, navigate to the Plugins menu and click Add New.</p>\n<p>In the search field type &#8220;Page Views Count&#8221; and click Search Plugins. Once you have found our plugin you can install it by simply clicking Install Now. After clicking that link you will be asked if you are sure you want to install the plugin. Click yes and WordPress will automatically complete the installation.</p>\n<h4>Manual installation</h4>\n<p>The manual installation method involves down loading our plugin and uploading it to your web server via your favorite FTP application.</p>\n<ol>\n<li>Download the plugin file to your computer and unzip it</li>\n<li>Using an FTP program, or your hosting control panel, upload the unzipped plugin folder to your WordPress installations wp-content/plugins/ directory.</li>\n<li>Activate the plugin from the Plugins menu within the WordPress admin.</li>\n</ol>\n",
        "changelog": ""
    },
    "short_description": "Places an icon, all time views count and views today count at the bottom of posts, pages and custom post types on any WordPress website.",
    "description": "<p>A beautifully simple to set up plugin that gives site visitors and site owners the ability to quickly and easily see how many people have visited that page or post.</p>\n<h4>FEATURES</h4>\n<ul>\n<li>On the front end it adds an icon and page views count to the bottom or top of pages and posts on your WordPress website.</li>\n<li>Switch ON | OFF hide Page Views Count for all Posts, Pages and all custom posts types including WooCommerce custom post types.</li>\n<li>Set the Position of the counter to show at the top of the page or post or at the bottom</li>\n<li>Set alignment of the counter Left, Right or Centre</li>\n<li>Set the colour and size of the counter icon</li>\n<li>Option to use load by Ajax to prevent the count from being cached by caching plugins </li>\n<li>Option to Manually set / edit total views and views today from Page View Count meta box on any post or page editor</li>\n<li>Add Page Views counter via the PVC Gutenberg block </li>\n<li>Add Page Views counter via shortcode</li>\n<li>Add Page Views counter via widget</li>\n<li>Developers can add the Page Views Counter via php tag</li>\n<li>All options and settings are point click &#8211; absolutely no coding required  </li>\n</ul>\n<h4>COMPATIBILTY</h4>\n<p>Compatible with WordPress 5.9+ and backwards to WP 5.6.0 Compatible with Classic Editor plugin (Gutenberg editor Deactivated)</p>\n<h4>GUTENBERG BLOCK</h4>\n<p>Using the Gutenberg Editor. Use the Page View Count Block to add the counter to any page or post content.  Block search for &#8216;Page Views&#8217; or selecting the block from the a3rev Blocks menu.</p>\n<p>Adding the Page Views block to your content automatically deactivates the Global Page View counter on the post or page.</p>\n<h4>ELEMENTOR TEMPLATES</h4>\n<p>Fully compatible with Elementor templates. Add counter via Shortcode or widget to any template.</p>\n<h4>DEVELOPERS</h4>\n<p>On the plugins dashboard in the + Page Views Count Function options box you will find the Page Views Count functions and notes on how to use them.</p>\n<ul>\n<li>Use to manually add Page views count to any content or object in the theme. </li>\n<li>Use to add page View Count to any content that is not create using WordPress custom post / taxonomy type. </li>\n<li>Use to create a custom position of the Page Views Count </li>\n<li>Functions support echo and return parameters when getting visitor stats on any variable.</li>\n</ul>\n<h4>TROUBLESHOOTING</h4>\n<ul>\n<li>The number 1 support request we get about the plugin is that it double or triple counts page or post loads. Yes it does and if you see that it is a Red Flag that you have a misconfiguration or bug in your theme or a plugin. Page Views Count does exactly that &#8211; counts each time the page or post is loading in the browser &#8211; if its counting twice it is because the browser is double loading the page. That is a bad thing and you or your developer needs to fix that.</li>\n</ul>\n<h4>CONTRIBUTE</h4>\n<p>When you download Page Views Count, you join our community. Regardless of if you are a WordPress beginner or experienced developer if you&#8217;’re interested in contributing to Page Views Count development head over to the <a href=\"https://github.com/a3rev/page-views-count\" rel=\"nofollow ugc\">Page Views Count GitHub Repository</a> to find out how you can contribute.<br />\nWant to add a new language to Page Views Count? Great! You can contribute via <a href=\"https://translate.wordpress.org/projects/wp-plugins/page-views-count\" rel=\"nofollow ugc\">translate.wordpress.org</a></p>\n<h3>Usage</h3>\n<ol>\n<li>\n<p>Install and activate the plugin</p>\n</li>\n<li>\n<p>Go to WordPress Settings menu &gt; Page View Count Menu</p>\n</li>\n<li>\n<p>Activate Page Views Count and use the options box settings to make the desired configuration</p>\n</li>\n<li>\n<p>Be sure to clear any caching and browser cache to see your Page Views Count</p>\n</li>\n</ol>\n",
    "download_link": "https://downloads.wordpress.org/plugin/page-views-count.2.8.4.zip",
    "upgrade_notice": {
        "2.8.4": "<p>This release has various tweaks for compatibility with WordPress 6.6</p>",
        "2.8.3": "<p>This maintenance release has an edge case fix that means total views record is created again at 1 when a duplicate post ID exists in the database.</p>",
        "2.8.2": "<p>This maintenance release has plugin framework updates for compatibility with PHP 8.1 onwards, plus compatibility with WordPress 6.4.1</p>",
        "2.8.1": "<p>This maintenance release has 1 fix for plugin on new option ADMIN-AJAX.</p>",
        "2.8.0": "<p>This release removes loading PVC Stats with PHP and replaces with REST API as default with Admin-ajax as the fallback.</p>",
        "2.7.0": "<p>This release changes the daily views reset from fixed GMT = 00 to use the timezone that is set in the site&#039;s WordPress General Settings.</p>",
        "2.6.3": "<p>This maintenance release had 2 performance tweaks for the page view count loading icon.</p>",
        "2.6.2": "<p>This maintenance release adds compatibility with plugins that set user roles, ie membership plugins.</p>",
        "2.6.1": "<p>Please run this update now to apply a security vulnerability patch</p>",
        "2.6.0": "<p>This feature release removes the fontawesome lib and replaces icons with SVGs plus adds Default Topography option to font controls.</p>",
        "2.5.6": "<p>This maintenance release has a security vulnerability patch, please run this update.</p>",
        "2.5.5": "<p>This maintenance release is for compatibility with WordPress major version 6.0 plus a bug fix.</p>",
        "2.5.4": "<p>This maintenance release has 2 fixes for plugins that filter custom content without post or page.</p>",
        "2.5.3": "<p>This security release follows a full security audit with code refactoring, security hardening including additional escaping and sanitizing.</p>",
        "2.5.2": "",
        "2.5.1": "<p>This maintenance release contains security hardening updates - please run it now.</p>",
        "2.5.0": "<p>This update has 4 code tweaks that harden the plugins security and improve performance - please run this update as soon as you see it.</p>",
        "2.4.15": "<p>This is an important security release that patches a SQL injection vulnerability that affects all previous versions. Please run this immediately.</p>",
        "2.4.14": "<p>This is a maintenance release for compatibility with WordPress major version 5.9</p>",
        "2.4.13": "<p>This maintenance release has a bug fix for compatibility with Gutenberg 10.8 and PHP 8.x</p>",
        "2.4.12": "<p>This maintenance release has code tweaks for WordPress 5.8 compatibility plus more Security hardening</p>",
        "2.4.11": "<p>This maintenance release has more code security hardening.</p>",
        "2.4.9": "<p>This maintenance release has code rewrites for WordPress 5.8 compatibility plus a Security patch</p>",
        "2.4.8": "<p>This maintenance release updates 23 deprecated jQuery functions for compatibility with the latest version of jQuery in WordPress 5.7</p>",
        "2.4.7": "<p>This maintenance release is for compatibility with WordPress 5.7 and Gutenberg 10.0</p>",
        "2.4.6": "<p>This is an important maintenance release that updates our scripts for compatibility with the latest version of jQuery released in WordPress 5.6</p>",
        "2.4.5": "<p>This maintenance release adds a block preview image for block discovery</p>",
        "2.4.4": "<p>This maintenance release has tweaks and a fix for compatibility with WordPress major version 5.6, PHP 7.4.8 and Gutenberg 9.4</p>",
        "2.4.3": "<p>This maintenance release is for compatibility with WordPress major version 5.5 and WooCommerce 4.3.1.</p>",
        "2.4.2": "<p>This maintenance release has a performance tweak, plus compatibility with WordPress 5.4.2, Gutenberg 8.5.1 and WooCommerce 4.3.0</p>",
        "2.4.1": "<p>This maintenance release fixes a PHP global function missed in the last update.</p>",
        "2.4.0": "<p>This big feature release adds dynamic text, change Total Views and Views Today text from the plugins dashboard. Add support for Dynamic Text string translation. Compatibility with WordPress 5.4, Gutenberg 7.5, WooCommerce 4.0 plus PHP 7.0 to 7.4</p>",
        "2.3.0": "<p>This feature release contains, new PVC shortcode, new PVC Widget, option to only show total views, a new eye icon option, full compatibility with Elementor Templates, completion of PHP Composer refactor and 4 PHP fixes for compatibility with PHP v 7.0 to 7.4.</p>",
        "2.2.1": "<p>This maintenance release has a full code security review plus compatibility with WordPress 5.3.1</p>",
        "2.2.0": "<p>This feature upgrade is a full refactor of the plugins PHP to PHP dependency manager Composer with autoloading.</p>",
        "2.1.3": "<p>This maintenance upgrade is to fix a style conflict with fontawesome icons</p>",
        "2.1.2": "<ul>\n<li>This is a maintenance upgrade to fix a potentially fatal error conflict with sites running PHP 7.3 plus compatibility with WordPress 5.2.2</li>\n</ul>",
        "2.1.1": "<p>This is a maintenance update for WordPress version 5.0.2 and PHP 7.3 compatibility</p>",
        "2.1.0": "<p>This feature upgrade ports Page View Count editor meta box to Page Views Gutenberg block. Full compatibility with WP 5.0.1, 4.9.9 and the Classic Editor.</p>",
        "2.0.5": "<p>Maintenance Update. Compatibility WordPress 4.9.6 and the new GDPR compliance requirements for users in the EU</p>",
        "2.0.4": "<p>Maintenance Update. Fixes for Views today count always showing 0 value, PHP warning and conflict with Yoast SEO Facebook description</p>",
        "2.0.3": "<p>Maintenance Update. This version updates the Plugin Framework to v 2.0.2, adds full compatibility with a3rev dashboard and WordPress v 4.9.4</p>",
        "2.0.2": "<p>Maintenance Update. This update includes 3 bug fixes, including AMP pages compatibility</p>",
        "2.0.1": "<p>Maintenance Update. 3 code tweaks for compatibility with WordPress 4.9.1 and 2 bug fixes</p>",
        "2.0.0": "<p>Major Feature Upgrade. Release of 7 new features and 2 code tweaks for compatibility with upcoming WordPress major version 4.8.0</p>",
        "1.4.0": "<p>Feature Upgrade. 3 new features, 5 tweaks for full compatibility with WordPress major version 4.5</p>",
        "1.3.2": "<p>Maintenance update. Tweaks for full compatibility with WordPress major version 4.4</p>",
        "1.3.1": "<p>Maintenance Update. 2 bug fixes for conflict with TinyMCE and WordPress editor conflict</p>",
        "1.3.0": "<p>Major Feature Upgrade. 3 much requested new features (see the changelog) plus 3 tweaks to plugins text domains - Note if you have a translation you need to chnage the .mo file name (see changelog)</p>",
        "1.2.1": "<p>Major Maintenance Upgrade. 5 Code Tweaks plus 2 bug fixes for full compatibility with WordPress v 4.3.0</p>",
        "1.2.0": "<p>Major Feature Upgrade. Massive admin panel UI and UX upgrade. Includes 6 new features plus 1 bug fix</p>",
        "1.1.0": "<p>Important Maintenance Upgrade. 2 x major a3rev Plugin Framework Security Hardening Tweaks plus 1 https bug fix</p>",
        "1.0.9": "<p>Maintenance upgrade. Code tweaks for full compatibility with WordPress 4.2.2 and Italian, Indonesian translations.</p>",
        "1.0.8": "<p>Maintenance upgrade. Code tweaks for full compatibility with WordPress 4.2.0</p>",
        "1.0.7": "<p>Upgrade now for full admin panel conversion from CSS to Sass</p>",
        "1.0.6.4": "<p>Upgrade now for 1 Sass bug fix</p>",
        "1.0.6.3": "<p>Update you plugin now for 1 framework code tweak plus 1 bug fix and full compatibility with WordPress Version 4.0</p>",
        "1.0.6.2": "<p>Upgrade now for a bug fix for missed style when disable AJAX load view counts in version release 1.0.6.1.</p>",
        "1.0.6.1": "<p>Upgrade now for a bug fix for Sass in yesterday&#039;s major version release 1.0.6.</p>",
        "1.0.6": "<p>Upgrade now for the beginning of conversion of plugin to backbone.js and Sass. Much faster front-end load and less calls on server.</p>",
        "1.0.5": "<p>Update now for new feature - load counter by Ajax event plus security hardening and 2 framework code tweaks and Russian translation.</p>",
        "1.0.4.3": "<p>Upgrade now for full compatoibility with WordPress Version 3.9.1, 8 code tweaks and 1 bug fix.</p>",
        "1.0.4.2": "<p>Upgrade now for full a3rev Plugin Framework compatibility with WordPress version 3.8.0 and backwards. New admin interface full mobile and tablet responsive display.</p>",
        "1.0.4.1": "<p>Update you plugin now for 2 bug fixes - especially important to upgrade now if you use the WordPress SEO plugin.</p>",
        "1.0.4": "<p>Upgrade now for another admin panel intuitive app interface feature plus a Radio switch bug fix and Android platform bug fix</p>",
        "1.0.3": "<p>Upgrade you plugin now for the all new a3rev admin panel app type interface and a protocols in browser bug fix</p>",
        "1.0.2": "<p>Important upgrade - please update your plugin now for a major performance enhancement.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/page-views-count/assets/screenshot-1.png?rev=2263624",
            "caption": "Counter"
        },
        {
            "src": "https://ps.w.org/page-views-count/assets/screenshot-2.png?rev=2263624",
            "caption": "PVC Admin"
        },
        {
            "src": "https://ps.w.org/page-views-count/assets/screenshot-3.png?rev=2263624",
            "caption": "Counter position and type"
        },
        {
            "src": "https://ps.w.org/page-views-count/assets/screenshot-4.png?rev=2263624",
            "caption": "PVC Widget"
        },
        {
            "src": "https://ps.w.org/page-views-count/assets/screenshot-5.png?rev=2263624",
            "caption": "PVC Gutenberg Block"
        }
    ],
    "tags": {
        "gutenberg": "gutenberg",
        "page-view-count": "page view count",
        "post-view-count": "post view count",
        "post-views": "post views",
        "wordpress-page-view": "wordpress page view"
    },
    "stable_tag": "2.8.4",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/page-views-count.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/page-views-count.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/page-views-count.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/page-views-count.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/page-views-count.1.0.4.zip",
        "1.0.4.1": "https://downloads.wordpress.org/plugin/page-views-count.1.0.4.1.zip",
        "1.0.4.2": "https://downloads.wordpress.org/plugin/page-views-count.1.0.4.2.zip",
        "1.0.4.3": "https://downloads.wordpress.org/plugin/page-views-count.1.0.4.3.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/page-views-count.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/page-views-count.1.0.6.zip",
        "1.0.6.1": "https://downloads.wordpress.org/plugin/page-views-count.1.0.6.1.zip",
        "1.0.6.2": "https://downloads.wordpress.org/plugin/page-views-count.1.0.6.2.zip",
        "1.0.6.3": "https://downloads.wordpress.org/plugin/page-views-count.1.0.6.3.zip",
        "1.0.6.4": "https://downloads.wordpress.org/plugin/page-views-count.1.0.6.4.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/page-views-count.1.0.7.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/page-views-count.1.0.8.zip",
        "1.0.9": "https://downloads.wordpress.org/plugin/page-views-count.1.0.9.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/page-views-count.1.1.0.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/page-views-count.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/page-views-count.1.2.1.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/page-views-count.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/page-views-count.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/page-views-count.1.3.2.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/page-views-count.1.4.0.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/page-views-count.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/page-views-count.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/page-views-count.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/page-views-count.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/page-views-count.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/page-views-count.2.0.5.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/page-views-count.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/page-views-count.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/page-views-count.2.1.2.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/page-views-count.2.1.3.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/page-views-count.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/page-views-count.2.2.1.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/page-views-count.2.3.0.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/page-views-count.2.4.0.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/page-views-count.2.4.1.zip",
        "2.4.11": "https://downloads.wordpress.org/plugin/page-views-count.2.4.11.zip",
        "2.4.12": "https://downloads.wordpress.org/plugin/page-views-count.2.4.12.zip",
        "2.4.13": "https://downloads.wordpress.org/plugin/page-views-count.2.4.13.zip",
        "2.4.14": "https://downloads.wordpress.org/plugin/page-views-count.2.4.14.zip",
        "2.4.15": "https://downloads.wordpress.org/plugin/page-views-count.2.4.15.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/page-views-count.2.4.2.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/page-views-count.2.4.3.zip",
        "2.4.4": "https://downloads.wordpress.org/plugin/page-views-count.2.4.4.zip",
        "2.4.5": "https://downloads.wordpress.org/plugin/page-views-count.2.4.5.zip",
        "2.4.6": "https://downloads.wordpress.org/plugin/page-views-count.2.4.6.zip",
        "2.4.7": "https://downloads.wordpress.org/plugin/page-views-count.2.4.7.zip",
        "2.4.8": "https://downloads.wordpress.org/plugin/page-views-count.2.4.8.zip",
        "2.4.9": "https://downloads.wordpress.org/plugin/page-views-count.2.4.9.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/page-views-count.2.5.0.zip",
        "2.5.1": "https://downloads.wordpress.org/plugin/page-views-count.2.5.1.zip",
        "2.5.2": "https://downloads.wordpress.org/plugin/page-views-count.2.5.2.zip",
        "2.5.3": "https://downloads.wordpress.org/plugin/page-views-count.2.5.3.zip",
        "2.5.4": "https://downloads.wordpress.org/plugin/page-views-count.2.5.4.zip",
        "2.5.5": "https://downloads.wordpress.org/plugin/page-views-count.2.5.5.zip",
        "2.5.6": "https://downloads.wordpress.org/plugin/page-views-count.2.5.6.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/page-views-count.2.6.0.zip",
        "2.6.1": "https://downloads.wordpress.org/plugin/page-views-count.2.6.1.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/page-views-count.2.6.2.zip",
        "2.6.3": "https://downloads.wordpress.org/plugin/page-views-count.2.6.3.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/page-views-count.2.7.0.zip",
        "2.8.0": "https://downloads.wordpress.org/plugin/page-views-count.2.8.0.zip",
        "2.8.1": "https://downloads.wordpress.org/plugin/page-views-count.2.8.1.zip",
        "2.8.2": "https://downloads.wordpress.org/plugin/page-views-count.2.8.2.zip",
        "2.8.3": "https://downloads.wordpress.org/plugin/page-views-count.2.8.3.zip",
        "2.8.4": "https://downloads.wordpress.org/plugin/page-views-count.2.8.4.zip",
        "trunk": "https://downloads.wordpress.org/plugin/page-views-count.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/page-views-count/assets/banner-772x250.jpg?rev=650541",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/page-views-count/assets/icon.svg?rev=986301",
        "svg": "https://ps.w.org/page-views-count/assets/icon.svg?rev=986301"
    },
    "blocks": {
        "page-views-count/stats": {
            "$schema": "https://schemas.wp.org/trunk/block.json",
            "apiVersion": 3,
            "name": "page-views-count/stats",
            "title": "Page Views",
            "description": "Show all time views and views today",
            "textdomain": "page-views-count",
            "category": "a3rev-blocks",
            "supports": {
                "multiple": false,
                "spacing": {
                    "margin": true,
                    "padding": false
                }
            },
            "keywords": [
                "Page Views Count",
                "Views",
                "Stats"
            ],
            "example": {
                "attributes": {
                    "isPreview": true
                }
            },
            "attributes": {
                "align": {
                    "type": "string",
                    "default": "left"
                },
                "postID": {
                    "type": "string",
                    "default": 0
                },
                "isDisabled": {
                    "type": "boolean",
                    "default": true
                },
                "isPreview": {
                    "type": "boolean",
                    "default": false
                }
            },
            "selectors": {
                "root": ".wp-block-apage-views-count-stats"
            },
            "editorScript": "page_views_count-cgb-block-js",
            "editorStyle": [
                "a3pvc"
            ]
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 78,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}