{
    "name": "PagSeguro International Payment Gateway for WooCommerce",
    "slug": "pagseguro-internacional-payment-gateway-for-woocommerce",
    "version": "1.0.0",
    "author": "<a href=\"https://pagseguro.com/\">PagSeguro Internacional</a>",
    "author_profile": "https://profiles.wordpress.org/pluginspagseguro/",
    "contributors": {
        "pluginspagseguro": {
            "profile": "https://profiles.wordpress.org/pluginspagseguro/",
            "avatar": "https://secure.gravatar.com/avatar/63cc1fd6f08c020b05b2771aafe2f61d?s=96&d=monsterid&r=g",
            "display_name": "pluginspagseguro"
        },
        "braising": {
            "profile": "https://profiles.wordpress.org/braising/",
            "avatar": "https://secure.gravatar.com/avatar/5f6468283b0063bbf5c9664e46e22929?s=96&d=monsterid&r=g",
            "display_name": "Daniel Leal"
        }
    },
    "requires": "6.0",
    "tested": "6.1.7",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 20,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 1,
    "support_url": "https://wordpress.org/support/plugin/pagseguro-internacional-payment-gateway-for-woocommerce/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 100,
    "downloaded": 1805,
    "last_updated": "2023-03-31 19:19:00",
    "added": "2023-03-07",
    "homepage": "https://wordpress.org/plugins/pagseguro-internacional-payment-for-woocommerce/",
    "sections": {
        "description": "<p>PagSeguro International Payment Gateway for WooCommerce allows merchants to accept over 140 Latin American payment methods directly on your website, thus helping boost sales and conversions in the region.</p>\n<p>Our features provide the best payment experience for your customers and include installments and refunds. They are all available by following a few installation steps and do not require technical knowledge.</p>\n<p>Main advantages:<br />\n&#8211; Coverage: Our solution includes 17 countries in Latin America, including the main markets such as Brazil, Mexico, Peru, Colombia, Chile and Argentina. We also cover Portugal, Spain, Turkey, Greece and Romania.<br />\n&#8211; Local payment options: Over 140 payment methods are available by installing our plugin, including local credit/debit cards, cash-based payments (Boleto, OXXO, RapiPago and more), bank transfers, PIX in Brazil, and e-wallets.<br />\n&#8211; Integrations to fit your exact business demands: By selecting PagSeguro Payment Page, the customer will be redirected to PagSeguro’s payment page to complete a purchase. PagSeguro handles all payment information collection, sensitive data protection, and transaction security. By selecting a payment method with Direct Checkout (credit cards, boleto and e-wallets), you will have complete control over your payment page. Customers pay directly on your interface without redirections.<br />\n&#8211; Robust risk analysis: Reduce your risk of fraud and chargebacks with our machine learning system, built by a team of experts on the LATAM market.<br />\n&#8211; Easy set-up: All functionalities are available with a straightforward installation of our plugin.</p>\n<p>Features available:<br />\n&#8211; Multicurrency and multilanguage: Our plugin supports multicurrency and multilingual plugins, so checkout will be adapted to display the selected language and currency chosen by the end-user.<br />\n&#8211; Installments: Offer customers the flexibility of splitting up payment purchases with the guarantee that your company still receives the money all at once, with no extra fees.<br />\n&#8211; Refunds API: We help avoid chargeback disputes by offering refunds in an integrated solution, where all the processes with the customer are done automatically. Our API supports total or partial refunds for processed payments.<br />\n&#8211; Recurring payments with Boleto: We are integrated with Woocommerce Subscriptions so you can offer recurring payments to your customers through Boleto Bancário in Brazil.<br />\n&#8211; Responsive checkout: Provide your clients with a user-friendly experience by using a checkout page adaptable to multiple devices and screen sizes.<br />\n&#8211; Sandbox environment for testing.<br />\n&#8211; Log and debug options.</p>\n<p>About PagSeguro</p>\n<p>PagSeguro (NYSE: PAGS) provides innovative payment solutions, automating payments, sales, and wire transfers to boost businesses anywhere, in a simple and secure way. Part of the UOL Group – the leader in Brazilian internet –, PagSeguro acts as an issuer, an acquirer, and a provider of digital accounts, besides offering complete solutions for online and in-person payments.</p>\n<p>The company also has the most complete payment methods coverage in Brazil and 16 other Latin American countries, besides Portugal, Spain, Turkey, Greece, and Romania, allowing merchants worldwide to process and collect more than 140 local payment methods and local currencies. It also provides instant single or mass cross-border payouts to Brazil.</p>\n<p>By partnering with PagSeguro, you’ll get the following benefits:<br />\n&#8211; No local entities required: One simple integration covers all markets without opening multiple bank accounts.<br />\n&#8211; No cross-border surcharges: All details on transactions and charges are available on our platform, so you don\\&#8217;t have to worry about additional undisclosed fees.<br />\n&#8211; Local customer support 24/7: Our support team speaks your customers\\&#8217; language (Portuguese, Spanish, English, and Turkish) and is available every day to ensure they are thoroughly looked after.<br />\n&#8211; Account management support: A dedicated regionalized account manager will be assigned to you so that we can ensure all your unique needs and business requirements are met.<br />\n&#8211; Robust risk analysis: Reduce your risk of fraud and chargebacks with our machine learning system, which we combine with a team full of experts on the LATAM market.</p>\n<p>Security<br />\nAll sensitive information will be tokenized and saved on PagSeguro’s environment. PagSeguro is PCI-DSS compliance certified, which means we follow global standards for security to assure trustworthy shopping experiences to your customers.</p>\n<h4>Compatibility &amp; Requirements</h4>\n<ul>\n<li>Compatible with WooCommerce 5+;</li>\n<li>Compatible with WordPress 5+;</li>\n<li>Tested and developed based on PagSeguro\\&#8217;s API</li>\n<li>Compatible with PHP 5.4.x to 7;</li>\n<li>Mandatory use of SSL certificate with TLS 1.2 protocol;</li>\n<li>Pages must be served over HTTPS</li>\n</ul>\n<h4>Further information</h4>\n<p>You can reach out to one of our payments specialists by accessing our website.</p>\n<h4>Start selling now</h4>\n<ol>\n<li>Create an account: Access our website and one of our business executives will contact you directly.</li>\n<li>Download and install our plugin: Your MerchantID and SecretKey should be available at your account. By following the step-by-step installation, you can set the plugin up by yourself.</li>\n<li>Sell to Latin America and get paid anywhere in the world: Select which payment methods are available at checkout and start selling.</li>\n</ol>\n",
        "installation": "<h4>Compatibility</h4>\n<ul>\n<li>Compatible with WooCommerce 5+;</li>\n<li>Compatible with WordPress 5+;</li>\n<li>Tested and developed based on PagSeguro’s API</li>\n<li>Compatible with PHP 5.4.x to 7;</li>\n<li>Mandatory use of SSL certificate with TLS 1.2 protocol;</li>\n</ul>\n<h4>Additional Plugins</h4>\n<ul>\n<li>For stores transacting in Brazil and using Direct API payment methods (credit cards, boleto, and e-wallets), it\\&#8217;s mandatory to install Brazilian Market on WooCommerce to add in your WC store some extra fields end-users must fill in with information to local regulatory authorities.</li>\n<li>For stores transacting in different countries, we recommend installing WooCommerce &#8211; Country Based Payments to configure the methods displayed in each country from your WC Settings.</li>\n<li>To set up a multi-currency store, we recommend installing Multi-Currency for WooCommerce;</li>\n<li>To offer Recurring Payments through Boleto &#8211; Direct Checkout in Brazil, you should install Woocommerce Subscriptions. More details about the integration with our plugin to follow in this document.</li>\n</ul>\n<h4>Installation</h4>\n<p>By accessing the Plugins directory (wp-admin/plugin-install), you can upload the plugin files or search for our plugin PagSeguro International Payment Gateway for WooCommerce.</p>\n<p>If you choose to search, please write \\&#8221;PagSeguro International Payment Gateway for WooCommerce\\&#8221; in the box at the right-hand corner and click \\&#8221;Install now\\&#8221;. In the plugins area of WordPress, activate the PagSeguro International Payment Gateway for WooCommerce module.</p>\n<p>If you choose to upload our package, please use the \\&#8221;Add new plugin\\&#8221; tool (wp-admin/plugins.php). Then, in the plugins area of WordPress, activate the PagSeguro International for WooCommerce module.</p>\n<h4>Settings</h4>\n<h4>1 &#8211; Activation</h4>\n<ul>\n<li>MerchantID &amp; SecretKey<br />\nGetting your MerchantID &amp; SecretKey is the first step to create a functional integration. After registering and formalizing your contract with PagSeguro, you will receive a SecretKey, which will be used to reference your account and validate the processed payments.</li>\n</ul>\n<p>Your PagSeguro MerchantID &amp; SecretKey can be found in MyAccount. With the data in hand, please access Payments in Woocommerce Settings (wp-admin/admin.php?page=wc-settings&amp;tab=checkout), select the payment method you wish to use and configure the respective fields as indicated below.</p>\n<p>WooCommerce -&gt; Settings -&gt; Payments -&gt;</p>\n<ul>\n<li>Sandbox<br />\nA sandbox is an isolated testing environment that enables users to run programs or execute files without affecting the actual application, system, or platform in which they run.</li>\n</ul>\n<p>All payment methods on our plugin have a sandbox environment so you can test the integration.<br />\nTo do this, you must activate the sandbox option of the desired method, as shown below:</p>\n<p>WooCommerce -&gt; Settings -&gt; Payments -&gt; Select the method and click ‘manage’ -&gt; enable PagSeguro sandbox</p>\n<p>You can change the transaction status in PagSeguro\\&#8217;s Sandbox environment through the page:<br />\nhttps://billing-partner.boacompra.com/ &#8211; Please use the same email and password from MyAccount.</p>\n<ul>\n<li>To find the transaction with the ID Order, you need to add the prefix configured in the \\&#8221;Invoice Prefix\\&#8221;, concatenated with the Woocommerce order number.</li>\n</ul>\n<p>Note: After testing the plugin, you should remember to disable the sandbox environment, otherwise your WooCommerce store won’t run our plugin.</p>\n<ul>\n<li>\n<p>Invoice Prefix<br />\nYou can set a prefix to differentiate the ID of your PagSeguro invoices:</p>\n</li>\n<li>\n<p>Logs<br />\nEnable the option for the module to record everything that is sent and received between your store and PagSeguro:</p>\n</li>\n</ul>\n<p>To view the logs, click the Logs link or go to \\&#8221;WooCommerce&gt; System Status&gt; Logs&gt; select log pagseguro-payment-xxxxx.log\\&#8221; and click \\&#8221;View\\&#8221; to review details of what has been sent and received between your store and PagSeguro.</p>\n<h4>2 – Payment Method</h4>\n<p>Our plugin provides a total of 5 payment method groups, distributed among 5 different gateways, all with their own individual settings.</p>\n<p>You should also enable on ‘WWCBP’ the countries you want to accept the payments methods:</p>\n<ul>\n<li>CREDIT CARD &#8211; DIRECT CHECKOUT (ONLY FOR BRAZIL)<br />\nCustomers pay with a credit card directly on your e-commerce checkout without redirections.</li>\n</ul>\n<p>Set the maximum number of installments accepted by the store at Credit Card Direct Checkout Settings. Select between 1 and 12 installments.</p>\n<p>Note: The interest rate may vary depending on the store\\&#8217;s billing ceiling or your contractual negotiation with PagSeguro.</p>\n<p>The installments are shown after entering the card number, since it depends on the card\\&#8217;s flag to inform the installment rate.</p>\n<ul>\n<li>BOLETO BANCÁRIO &#8211; DIRECT CHECKOUT (ONLY FOR BRAZIL)<br />\nAfter clicking on \\&#8221;Place order\\&#8221;, the customer is taken to the Thank You page with information about the boleto (Bank Slip Barcode).</li>\n</ul>\n<p>By default, when issuing a Boleto Bancário, we show a message referring to the standard billing fee of R$1.50 for issuance.</p>\n<p>If you do not want this message to appear at checkout, email and thank you page, just uncheck the option at Boleto Bancário Settings.</p>\n<ul>\n<li>E-WALLETS &#8211; DIRECT CHECKOUT (ONLY FOR BRAZIL)</li>\n</ul>\n<p>The e-wallet options available are PagSeguro and PayPal. When enabling this payment method, both e-wallets appear to the end-user:</p>\n<ul>\n<li>PAGSEGURO PAYMENT PAGE</li>\n</ul>\n<p>After clicking on \\&#8221;Place order\\&#8221;, your customer will be redirected to PagSeguro Payment Page to choose among all the payment methods you have made available to him. PagSeguro handles all payment information collection, sensitive data protection, and transaction security.</p>\n<p>To enable different payment groups, please access PagSeguro Payment Page Settings:</p>\n<p>You can check all available payment methods for your country here.</p>\n<ul>\n<li>PAGSEGURO PAYMENT PAGE – PIX</li>\n</ul>\n<p>After clicking on \\&#8221;Place order\\&#8221;, your customer will be redirected to PagSeguro Payment Page, but only see the PIX option enabled:</p>\n<h4>3 &#8211; Refunds</h4>\n<p>You can offer a partial or total refund to your end-user.<br />\nTo make a refund request, please access the desired order at WooCommerce Orders and click on the \\&#8221;Refund\\&#8221; button. Then, set the \\&#8221;Refunded Total\\&#8221; and click the \\&#8221;Reimbursement R$X,XX by Payment via PagSeguro\\&#8221; button. The module will transmit the request to PagSeguro in real-time.<br />\nIf the refund cannot be completed automatically, it means PagSeguro does not allow it to be refundable. Please check the methods that are refunded here.</p>\n<h4>4 – Recurring Payments through Boleto Direct Checkout and Woocommerce Subscriptions</h4>\n<p>We are integrated with Woocommerce Subscriptions so you can offer recurring payments to your customer through Boleto Bancário in Brazil. If you want this extra service offered by WooCommerce, you should purchase and install Woocommerce Subscription, then process the payment with PagSeguro.</p>\n<h4>5 – Translations</h4>\n<p>The language shown in the plugin is the one settled in WordPress General Settings. Our plugin supports English, Spanish, and Portuguese.</p>\n<h4>CHANGELOG</h4>\n<p>2.0.0<br />\n&#8211; Complete refactoring of the plugin structure.<br />\n&#8211; Payment options into individual gateways.<br />\n&#8211; Added support for Boleto Bancário subscriptions.<br />\n&#8211; Added support for Multicurrency and Multilanguage<br />\n&#8211; Added support for the PIX payment method<br />\n1.0.0<br />\n&#8211; The first version of the PagSeguro module.</p>\n"
    },
    "short_description": "PagSeguro International Payment Gateway for WooCommerce allows merchants to accept over 140 Latin American payment methods directly on your website, t &hellip;",
    "description": "<p>PagSeguro International Payment Gateway for WooCommerce allows merchants to accept over 140 Latin American payment methods directly on your website, thus helping boost sales and conversions in the region.</p>\n<p>Our features provide the best payment experience for your customers and include installments and refunds. They are all available by following a few installation steps and do not require technical knowledge.</p>\n<p>Main advantages:<br />\n&#8211; Coverage: Our solution includes 17 countries in Latin America, including the main markets such as Brazil, Mexico, Peru, Colombia, Chile and Argentina. We also cover Portugal, Spain, Turkey, Greece and Romania.<br />\n&#8211; Local payment options: Over 140 payment methods are available by installing our plugin, including local credit/debit cards, cash-based payments (Boleto, OXXO, RapiPago and more), bank transfers, PIX in Brazil, and e-wallets.<br />\n&#8211; Integrations to fit your exact business demands: By selecting PagSeguro Payment Page, the customer will be redirected to PagSeguro’s payment page to complete a purchase. PagSeguro handles all payment information collection, sensitive data protection, and transaction security. By selecting a payment method with Direct Checkout (credit cards, boleto and e-wallets), you will have complete control over your payment page. Customers pay directly on your interface without redirections.<br />\n&#8211; Robust risk analysis: Reduce your risk of fraud and chargebacks with our machine learning system, built by a team of experts on the LATAM market.<br />\n&#8211; Easy set-up: All functionalities are available with a straightforward installation of our plugin.</p>\n<p>Features available:<br />\n&#8211; Multicurrency and multilanguage: Our plugin supports multicurrency and multilingual plugins, so checkout will be adapted to display the selected language and currency chosen by the end-user.<br />\n&#8211; Installments: Offer customers the flexibility of splitting up payment purchases with the guarantee that your company still receives the money all at once, with no extra fees.<br />\n&#8211; Refunds API: We help avoid chargeback disputes by offering refunds in an integrated solution, where all the processes with the customer are done automatically. Our API supports total or partial refunds for processed payments.<br />\n&#8211; Recurring payments with Boleto: We are integrated with Woocommerce Subscriptions so you can offer recurring payments to your customers through Boleto Bancário in Brazil.<br />\n&#8211; Responsive checkout: Provide your clients with a user-friendly experience by using a checkout page adaptable to multiple devices and screen sizes.<br />\n&#8211; Sandbox environment for testing.<br />\n&#8211; Log and debug options.</p>\n<p>About PagSeguro</p>\n<p>PagSeguro (NYSE: PAGS) provides innovative payment solutions, automating payments, sales, and wire transfers to boost businesses anywhere, in a simple and secure way. Part of the UOL Group – the leader in Brazilian internet –, PagSeguro acts as an issuer, an acquirer, and a provider of digital accounts, besides offering complete solutions for online and in-person payments.</p>\n<p>The company also has the most complete payment methods coverage in Brazil and 16 other Latin American countries, besides Portugal, Spain, Turkey, Greece, and Romania, allowing merchants worldwide to process and collect more than 140 local payment methods and local currencies. It also provides instant single or mass cross-border payouts to Brazil.</p>\n<p>By partnering with PagSeguro, you’ll get the following benefits:<br />\n&#8211; No local entities required: One simple integration covers all markets without opening multiple bank accounts.<br />\n&#8211; No cross-border surcharges: All details on transactions and charges are available on our platform, so you don\\&#8217;t have to worry about additional undisclosed fees.<br />\n&#8211; Local customer support 24/7: Our support team speaks your customers\\&#8217; language (Portuguese, Spanish, English, and Turkish) and is available every day to ensure they are thoroughly looked after.<br />\n&#8211; Account management support: A dedicated regionalized account manager will be assigned to you so that we can ensure all your unique needs and business requirements are met.<br />\n&#8211; Robust risk analysis: Reduce your risk of fraud and chargebacks with our machine learning system, which we combine with a team full of experts on the LATAM market.</p>\n<p>Security<br />\nAll sensitive information will be tokenized and saved on PagSeguro’s environment. PagSeguro is PCI-DSS compliance certified, which means we follow global standards for security to assure trustworthy shopping experiences to your customers.</p>\n<h4>Compatibility &amp; Requirements</h4>\n<ul>\n<li>Compatible with WooCommerce 5+;</li>\n<li>Compatible with WordPress 5+;</li>\n<li>Tested and developed based on PagSeguro\\&#8217;s API</li>\n<li>Compatible with PHP 5.4.x to 7;</li>\n<li>Mandatory use of SSL certificate with TLS 1.2 protocol;</li>\n<li>Pages must be served over HTTPS</li>\n</ul>\n<h4>Further information</h4>\n<p>You can reach out to one of our payments specialists by accessing our website.</p>\n<h4>Start selling now</h4>\n<ol>\n<li>Create an account: Access our website and one of our business executives will contact you directly.</li>\n<li>Download and install our plugin: Your MerchantID and SecretKey should be available at your account. By following the step-by-step installation, you can set the plugin up by yourself.</li>\n<li>Sell to Latin America and get paid anywhere in the world: Select which payment methods are available at checkout and start selling.</li>\n</ol>\n",
    "download_link": "https://downloads.wordpress.org/plugin/pagseguro-internacional-payment-gateway-for-woocommerce.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/pagseguro-internacional-payment-gateway-for-woocommerce/assets/screenshot-1.png?rev=2876131",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/pagseguro-internacional-payment-gateway-for-woocommerce/assets/screenshot-2.jpg?rev=2876131",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/pagseguro-internacional-payment-gateway-for-woocommerce/assets/screenshot-3.jpg?rev=2876131",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/pagseguro-internacional-payment-gateway-for-woocommerce/assets/screenshot-4.jpg?rev=2876131",
            "caption": ""
        }
    ],
    "tags": {
        "pagseguro": "pagseguro",
        "pagseguro-pagamentos": "Pagseguro pagamentos",
        "payment": "payment",
        "wc-pagseguro": "wc pagseguro",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/pagseguro-internacional-payment-gateway-for-woocommerce.1.0.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/pagseguro-internacional-payment-gateway-for-woocommerce/assets/banner-772x250.jpg?rev=2876131",
        "high": "https://ps.w.org/pagseguro-internacional-payment-gateway-for-woocommerce/assets/banner-1544x500.jpg?rev=2876131"
    },
    "icons": {
        "1x": "https://ps.w.org/pagseguro-internacional-payment-gateway-for-woocommerce/assets/icon-256x256.png?rev=2876131",
        "2x": "https://ps.w.org/pagseguro-internacional-payment-gateway-for-woocommerce/assets/icon-256x256.png?rev=2876131"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 20,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}