{
    "name": "ParcelPanel (Free to install) &#8211; Shipment Tracking, Tracking, and Order Tracking for WooCommerce",
    "slug": "parcelpanel",
    "version": "4.3.8",
    "author": "<a href=\"https://www.parcelpanel.com\">Parcel Panel</a>",
    "author_profile": "https://profiles.wordpress.org/parcelpanel/",
    "contributors": {
        "parcelpanel": {
            "profile": "https://profiles.wordpress.org/parcelpanel/",
            "avatar": "https://secure.gravatar.com/avatar/bdc60207fca948b6cb36231e9e064009?s=96&d=monsterid&r=g",
            "display_name": "ParcelPanel Development Team"
        }
    },
    "requires": "5.8",
    "tested": "6.6.1",
    "requires_php": "7.2",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 457,
        "4": 2,
        "3": 1,
        "2": 2,
        "1": 7
    },
    "num_ratings": 469,
    "support_url": "https://wordpress.org/support/plugin/parcelpanel/",
    "support_threads": 1,
    "support_threads_resolved": 1,
    "active_installs": 7000,
    "downloaded": 135510,
    "last_updated": "2024-08-22 01:22:00",
    "added": "2021-10-08",
    "homepage": "https://docs.parcelpanel.com/woocommerce",
    "sections": {
        "description": "<h3>PARCELPANEL SHIPMENT TRACKING FOR WOOCOMMERCE – BEST ORDER TRACKING PLUGIN IN WORDPRESS 💪</h3>\n<p><strong>&#8220;Where is my order?&#8221;(WISMO) is the biggest concern of your customers.</strong> We created Parcel Panel Shipment Tracking, the ultimate tracking plugin for WordPress, to help WooCommerce merchants get access to the order tracker, improving customer satisfaction and driving more sales by providing the best post-purchase experience.</p>\n<h3>Free plan still available ✨</h3>\n<ul>\n<li>Since our initial launch in 2021, ParcelPanel Tracking has remained 100% FREE up to the present day. However, due to the continuous increase of various costs, we have decided to launch the paid version V3.6 starting in Sept, 2023.</li>\n<li>Free plan Including:\n<ul>\n<li>20 orders/month, and provides unlimited order lookups</li>\n<li>Access to 1,200+ carriers</li>\n<li>Real-time sync &amp; tracking</li>\n<li>Branded tracking page</li>\n<li>&#8230;</li>\n</ul>\n</li>\n</ul>\n<p>🥳 Limited Time Hidden Benefit: 50% discount for new users on monthly plans for the first month!</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/enPiGqg5pis?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><a href=\"https://docs.parcelpanel.com/woocommerce/\" rel=\"nofollow ugc\">Help Center</a> | <a href=\"https://www.parcelpanel.com/\" rel=\"nofollow ugc\">Website</a> | <a href=\"https://wordpress.org/support/plugin/parcelpanel/\" rel=\"ugc\">Support Forum</a></p>\n<h3>Fully GDPR ready</h3>\n<p>ParcelPanel Tracking is fully GDPR compliant, so you can be confident that your customers’ data is being collected and used in a responsible way. Learn more about our <a href=\"https://www.parcelpanel.com/privacy-policy/\" rel=\"nofollow ugc\">Privacy Policy</a>.</p>\n<h3>Why do you need an order tracking plugin for WooCommerce?</h3>\n<ul>\n<li>\n<p><strong>More than 5% support tickets for order tracking</strong><br />\nIf too many support tickets are about WISMO, then you&#8217;re experiencing order tracking and shipment tracking issues. Manually tracking shipments leads to high costs due to repetitive tasks.</p>\n</li>\n<li>\n<p><strong>Your customers are jumping through hoops</strong><br />\nTracking orders and knowing estimated delivery dates should be effortless for customers. Customers often face difficulty manually inputting tracking numbers into third-party tracking sites and find no information available until shipments start. This can lead to a disappointing tracking experience and lost sales due to decreased customer excitement about their orders.</p>\n</li>\n<li>\n<p><strong>Consistent brand experience is being challenged</strong><br />\nBefore purchase, you control the customer experience. However, after ordering, shipment tracking is handled by a third-party carrier. Problems like a poorly designed tracking page or loading issues can harm your brand.</p>\n</li>\n</ul>\n<h3>Why Parcel Panel Order Tracking for WooCommerce?</h3>\n<ul>\n<li>Parcel Panel Order Tracking can solve all the above shipment tracking and tracking issues and even bring in additional revenue.</li>\n<li>We&#8217;ve been focused on parcel tracking for years, provides advanced shipment tracking, and make sure accurate results for track orders, better than AST (Advanced Shipment Tracking), Trackship, 17track, Aftership, TrackingMore, Yith, Orders tracking, covering <a href=\"https://www.parcelpanel.com/couriers/\" rel=\"nofollow ugc\">1,200+ carriers</a> worldwide including USPS, Cainiao, Royal Mail, YunExpress, 4PX, YANWEN, etc.</li>\n<li>Perhaps we may not yet be as renowned as those well-known plugins on WordPress, such as Elementor, Yoast SEO, Rank Math SEO, Popup Builder, or the essential WordPress plugins like Contact Form, Classic Editor, Akismet Anti-Spam: Spam Protection, Jetpack, WP Mail SMTP, nor do we fall under the trendy categories like SEO, Email Marketing, Translate, Popup, or Google Analytics. However, our brand is built on being the top eCommerce tracking solution, dedicated to providing the best post-purchase experience for your customers with our ultimate product and service approach.</li>\n<li>Our team believes in efficiency and doing what&#8217;s right. We&#8217;re here to help merchants with order tracking challenges.</li>\n<li>Discover our exclusive order tracking features and understand why ParcelPanel shipment tracking is possibly the best WooCommerce tracking plugin.</li>\n</ul>\n<h3>Working Principle</h3>\n<h3>Streamlined Order Fulfillment Workflow</h3>\n<p>ParcelPanel Tracking offers features to optimize your order fulfillment process, tailored to meet various merchant requirements.</p>\n<ul>\n<li>Parcel Panel Shipment Tracking enables you to add [Partially Shipped], [Shipped], and [Delivered] order statuses, aligning seamlessly with your store&#8217;s workflow.</li>\n<li>Automation &#8211; ParcelPanel tracking support automatic switching of order status after all shipments reach the &#8216;Delivered&#8217; status to reduce repetitive tasks.</li>\n</ul>\n<h3>Auto-sync WooCommerce order data</h3>\n<ul>\n<li>Once a WooCommerce order is placed, it syncs up with Parcel Panel Shipment Tracking automatically. From there, tracking your shipments on our branded page is a breeze.</li>\n</ul>\n<h3>Auto-matching courier</h3>\n<ul>\n<li>We ensure accurate tracking results for all orders, covering <a href=\"https://www.parcelpanel.com/couriers/\" rel=\"nofollow ugc\">1,200+ mainstream carriers</a> worldwide.</li>\n<li>Parcel Panel Shipment Tracking&#8217;s smart system automatically identifies the correct couriers, retrieves tracking details from their official websites, and displays them on the tracking page.</li>\n</ul>\n<h3>Add tracking numbers to orders</h3>\n<ul>\n<li>Use the tracking number widget: Individually add tracking numbers on the Edit order page. Once added, they&#8217;ll sync to the ParcelPanel Shipments page.</li>\n<li>Bulk import via CSV: Utilize our smart field-mapping tool to import multiple tracking numbers from a CSV file, minimizing repetitive tasks.</li>\n<li>API Integration: Easily manage shipment tracking information in orders through ParcelPanel WooCommerce Tracking API (API). Refer to our <a href=\"https://docs.parcelpanel.com/woocommerce/api/pp-woo-api/\" rel=\"nofollow ugc\">API doc</a> for details.</li>\n<li>Third-Party Fulfillment: For dropshipping and shipping plugins, tracking numbers are auto-synced to ParcelPanel without any additional effort required on your part! </li>\n</ul>\n<h3>Integration</h3>\n<p>Parcel Panel Shipment Tracking integration includes the following plugins:</p>\n<ul>\n<li>Dropshipping\n<ul>\n<li>Ali2Woo &#8211; AliExpress Dropshipping with Ali2Woo Lite</li>\n<li>ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</li>\n<li>DSers</li>\n</ul>\n</li>\n<li>Shipping\n<ul>\n<li>WooCommerce Shipping</li>\n<li>Shippo</li>\n<li>Sendcloud</li>\n<li>ShipStation</li>\n<li>Dianxiaomi</li>\n<li>Pirateship </li>\n</ul>\n</li>\n<li>Email marketing\n<ul>\n<li>Klaviyo</li>\n<li>Omnisend</li>\n</ul>\n</li>\n<li>Payment\n<ul>\n<li>Paypal</li>\n</ul>\n</li>\n<li>Translate\n<ul>\n<li>WPML</li>\n<li>Weglot</li>\n</ul>\n</li>\n<li>Email customizer\n<ul>\n<li>YayMail – WooCommerce Email Customizer </li>\n</ul>\n</li>\n<li>Custom order number\n<ul>\n<li>Sequential Order Number for WooCommerce by WebToffee</li>\n<li>&#8230;</li>\n</ul>\n</li>\n<li>More Integration coming soon&#8230;</li>\n</ul>\n<p>ParcelPanel Shipment Tracking will continue to integrate with more plugins to improve the user experience. Stay tuned!<br />\nGot a plugin you&#8217;d like us to add? Let us know through our Feature request page, and we&#8217;ll check it out!</p>\n<h3>The best for WooCommerce dropshipping</h3>\n<ul>\n<li>Dropshipping mode hides all Chinese origins seamlessly, offering customers a complete branded shopping experience.</li>\n<li>Seamless integration with WooCommerce dropshipping apps like Ali2Woo, ALD, and DSers. Automatically sync tracking numbers from these apps for easy shipment tracking.</li>\n<li>Stay tuned for more integrated dropshipping plugins coming soon!</li>\n</ul>\n<h3>Save money &amp; Boost sales</h3>\n<p>A great order tracking solution not only lets customers track orders on their own, saving you cash, but also creates opportunities to make more money.<br />\nParcelPanel Shipment Tracking offers proactive updates and notifications on parcel progress, enabling customers to view current status.<br />\nBy offering product recommendations and controlling the customer experience, you can open up new marketing channels and increase sales.</p>\n<h3>Free to install &amp; Free plan available &amp; No-credit-card trial</h3>\n<ul>\n<li>Parcel Panel Shipment Tracking is a Free plan available with key features available and 20 quota/month!</li>\n</ul>\n<h3>Your brand, Your tracking page</h3>\n<ul>\n<li>Parcel Panel Order Tracking automatically creates a branded tracking page under your store domain (SEO friendly) with plenty of customizable elements. No more &#8220;Where is my order?&#8221; inquiries—bring customers back to your store and boost sales effortlessly.</li>\n</ul>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/eja-IuEViJs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<ul>\n<li>Order Lookup Widget\n<ul>\n<li>Allow customers to effortlessly track their orders using various methods.</li>\n<li>Track by order number and email/phone number.</li>\n<li>Track by tracking number only.</li>\n<li>Unlimited order lookups.</li>\n</ul>\n</li>\n<li>Shipping progress bar &#8211; keep your customers informed of order status.</li>\n<li>Intelligent product recommendation &#8211; upsell products on the tracking page to drive additional sales and enhance the tracking experience.</li>\n<li>Custom shipment status &#8211; inform customers of your process prior to shipping.</li>\n<li>Estimated delivery time &#8211; your customers always know when they can receive their packages.</li>\n<li>Map coordinates &#8211; Clear Google Maps to show customers the location of their packages.</li>\n<li>Multilingual Tracking Page &#8211; automatically adjust the language on the tracking page based on the store&#8217;s language when customers visit. Supports up to 34 languages and integrates seamlessly with translation apps like WPML.</li>\n<li>Universal Integration &#8211; Compatible with all themes and devices for a seamless tracking experience. Especially fully optimized for Right-to-Left (RTL) layouts.</li>\n<li>Mobile Optimization &#8211; mobile styles fine-tuned for smoother navigation, especially during peak-season promotions.</li>\n<li>Drive Traffic to Your Site &#8211; redirect customers to your WooCommerce site instead of the carrier site, increasing organic search traffic.</li>\n</ul>\n<h3>Account page tracking</h3>\n<ul>\n<li>With Parcel Panel Order Tracking, you can easily add a track button to your order history page, enabling your customers to conveniently track their order status with just one click there.</li>\n</ul>\n<h3>Shipping notifications</h3>\n<p><strong>Add an order tracking section to WooCommerce email notifications</strong><br />\nAutomatically insert Parcel Panel Shipment Tracking section to email notifications base on order status, so customers can easily track shipments in their email.</p>\n<p><strong>ParcelPanel shipping notifications</strong></p>\n<ul>\n<li>Developed and sent by ParcelPanel tracking\n<ul>\n<li>Stay informed with 5 smart notifications triggered by key shipping updates, keeping customers up-to-date on order progress.</li>\n<li>Customize email design and content to match your brand, providing a seamless post-purchase experience.</li>\n<li>Boost revenue with upsell and product recommendations directly within the email.</li>\n<li>Automatically ParcelPanel tracking shipping notifications in the customer&#8217;s language based on country for a seamless shopping experience worldwide.</li>\n</ul>\n</li>\n<li>Developed by ParcelPanel but sent by WooCommerce\n<ul>\n<li>Easily set up WooCommerce&#8217;s standard email system <a href=\"https://developer.wordpress.org/reference/functions/wp_mail/\" rel=\"nofollow ugc\"><code>wp_mail()</code></a> or ParcelPanel shipping emails (sent by WooCommerce) if preferred.</li>\n</ul>\n</li>\n</ul>\n<h3>Comprehensive dashboard insights</h3>\n<ul>\n<li>Order and Shipment Tracking: Access a robust dashboard for easy analysis and export of order and shipment tracking data, providing valuable insights for driving revenue growth.</li>\n<li>In-Depth Analytics: Obtain detailed analysis on Shipments, Transit Time, Tracking Pages, and Shipping Notifications at the Analytics page, empowering you to make informed decisions regarding your shipments.</li>\n</ul>\n<h3>Shipment management dashboard</h3>\n<ul>\n<li>Easily filter shipments by Order number, Tracking number, or Customer name.</li>\n<li>Customize displayed columns including &#8220;Order,&#8221; &#8220;Tracking number,&#8221; &#8220;Shipment status,&#8221; and more to suit your browsing needs.</li>\n<li>Trace shipments regardless of status, including exceptions, and view detailed order information on the shipment page.</li>\n<li>Utilize 8 standardized shipment tracking statuses for clarity.</li>\n<li>Manually update order status, ideal for merchants with their own shipping or local delivery teams.</li>\n</ul>\n<h3>Shipping providers</h3>\n<ul>\n<li>Parcel Panel Order Tracking support <a href=\"https://www.parcelpanel.com/couriers/\" rel=\"nofollow ugc\">1,200+ carriers</a> worldwide:<br />\nUSPS, Yun Express, AliExpress Standard Shipping, 4PX, UPS, DHL, Fedex, Delhivery, DHL Express, Australia Post, YANWEN, Brazil Correios, UK Royal Mail, CNE Express, YDH, China Post, La Poste and many more&#8230;.</li>\n</ul>\n<h3>Translations</h3>\n<ul>\n<li>The Parcel Panel Order Tracking plugin is localized and translatable by default. we support translation to the following languages: <strong>Chinese (Simplified), Chinese Traditional, English – default, French(France), German, Italian, Spanish(Spain), Portuguese(Portugal), Dutch, and Greek.</strong></li>\n</ul>\n<h3>24/7 Live chat support</h3>\n<ul>\n<li>Live chat or email: Need help? Don&#8217;t hesitate to contact us via live chat or email at <a href=\"mailto:&#115;&#x75;&#112;&#x70;&#111;&#x72;&#116;&#x40;&#112;a&#114;c&#x65;&#108;&#x70;&#097;&#x6e;&#101;&#x6c;&#046;&#x6f;&#114;&#x67;\" rel=\"nofollow ugc\">support@parcelpanel.org</a>.\n<ul>\n<li>ParcelPanel values your privacy. Our live chat, powered by Intercom, is disabled by default. We don&#8217;t collect private information about your store or customers without your permission. Click to learn more about our <a href=\"https://www.parcelpanel.com/privacy-policy/\" rel=\"nofollow ugc\">Privacy Policy</a>.</li>\n</ul>\n</li>\n<li><a href=\"https://wordpress.org/support/plugin/parcelpanel/\" rel=\"ugc\">Support Forum</a> is an excellent resource for discussing and solving problems.</li>\n<li><a href=\"https://docs.parcelpanel.com/woocommerce/\" rel=\"nofollow ugc\">ParcelPanel help center</a> is another valuable resource where you can find more information and detailed tutorials.</li>\n</ul>\n<h3>6,000+ Happy Customers</h3>\n<p>Join over 6,000 happy customers and elevate your post-purchase experience with Parcel Panel today. Here&#8217;s what our customers have to say:</p>\n<p>⭐⭐⭐⭐⭐</p>\n<blockquote>\n<p>&#8220;I&#8217;d install this tracking plugin in any store without hesitation. It&#8217;s incredibly useful, easy to use, customizable, and does its job perfectly. Plus, the support team is fast and friendly. Give it a try—you won&#8217;t regret it!&#8221;</p>\n</blockquote>\n<p>⭐⭐⭐⭐⭐</p>\n<blockquote>\n<p>&#8220;ParcelPanel Order Tracking is simply the best in the international market. It has no competitor.&#8221;</p>\n</blockquote>\n<p>⭐⭐⭐⭐⭐</p>\n<blockquote>\n<p>&#8220;I was facing a big problem by searching for custom order tracking module. After some research I got to know about ParcelPanel Order Tracking. It exceeded my expectations for my site and customers. Thank you to the development team!&#8221;</p>\n</blockquote>\n<p>⭐⭐⭐⭐⭐</p>\n<blockquote>\n<p>&#8220;Top-notch service with no quality alternatives in the WordPress plugin market. Highly recommended for serious shops—it&#8217;ll boost customer satisfaction to 100%.&#8221;</p>\n</blockquote>\n<p>⭐⭐⭐⭐⭐</p>\n<blockquote>\n<p>&#8220;This tracking plugin has everything a small e-commerce website needs. The tracking option simplifies things for both shop managers and customers. Extra settings like a branded tracking page, cross-selling recommendations, and end-to-end tracking make life even easier. Overall, it&#8217;s the go-to solution for shipment tracking needs.&#8221;</p>\n</blockquote>\n<h3>Getting started</h3>\n<p><a href=\"https://docs.parcelpanel.com/woocommerce/\" rel=\"nofollow ugc\">ParcelPanel Help Center</a>: While Parcel Panel Shipment Tracking is already easy to set up, our tutorials, guides, and knowledge bases are here to ensure you get started smoothly.<br />\n<a href=\"https://wordpress.org/support/plugin/parcelpanel/\" rel=\"ugc\">Support Ticket Forum</a>: Our dedicated forum offers support for any issues you encounter with Parcel Panel Shipment Tracking. We prioritize user experience and aim to promptly address all queries on the forum.<br />\n<a href=\"https://wordpress.org/plugins/parcelpanel/#faq-header\" rel=\"ugc\">Frequently Asked Questions</a>: Find answers to common questions about Parcel Panel Order Tracking, covering features, pricing, and more.</p>\n",
        "installation": "<p>By installing ParcelPanel for free you agree to our <a href=\"https://www.parcelpanel.com/privacy-policy/\" rel=\"nofollow ugc\">Privacy Policy</a>.</p>\n<h3>ParcelPanel is committed to providing an out-of-the-box user experience:</h3>\n<h4>DOWNLOAD STEPS</h4>\n<ol>\n<li>Visit Plugins page<span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> <strong>Add New</strong></li>\n<li>Search for <strong>ParcelPanel</strong></li>\n<li><strong>Install</strong> ParcelPanel once it appears</li>\n<li><strong>Activate</strong> ParcelPanel from your Plugins page</li>\n<li>Go to &#8220;after activation&#8221; below</li>\n</ol>\n<p>You might also want to refer to the following video:</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/pwZullMoVm8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>MANUALLY</h4>\n<ol>\n<li>Upload the <strong>parcelpanel</strong> folder to the <strong>/wp-content/plugins/</strong> directory</li>\n<li><strong>Activate</strong> the Parcel Panel Order Tracking for WooCommerce plugin through the &#8220;Plugins&#8221; menu in WordPress</li>\n<li>Go to &#8220;after activation&#8221; below</li>\n</ol>\n<h4>AFTER ACTIVATION</h4>\n<ol>\n<li>Add the tracking page to your WooCommerce store navigation menu</li>\n<li>Import tracking numbers of your orders with ParcelPanel Import Widget or using a CSV file, or directly sync them from dropshipping apps like Ali2Woo</li>\n<li>Now ParcelPanel will automatically track and update your shipment status, and timely send email notifications to customers by your needs</li>\n</ol>\n",
        "faq": "\n<dt id='how%20does%20parcel%20panel%20order%20tracking%20work%20in%20woocommerce%3F'>\nHow does Parcel Panel Order Tracking work in WooCommerce?\n</h4>\n<p>\n<ol>\n<li>ParcelPanel syncs your order data from the Orders section of your WooCommerce admin.</li>\n<li>Once an order is placed, it&#8217;s automatically synced to the ParcelPanel Shipments tab without a tracking number.</li>\n<li>When you manually add a tracking number and select the correct courier, it&#8217;s synced to ParcelPanel.</li>\n<li>Our smart system automatically retrieves tracking details from the courier&#8217;s official website.</li>\n<li>The tracking details are then displayed on the tracking page for easy access.</li>\n</ol>\n</p>\n<dt id='how%20many%20couriers%20does%20parcelpanel%20shipment%20tracking%20support%3F'>\nHow many couriers does ParcelPanel Shipment Tracking support?\n</h4>\n<p>\n<p>ParcelPanel Shipment Tracking supports over <a href=\"https://www.parcelpanel.com/couriers/\" rel=\"nofollow ugc\">1,200+ carriers</a> worldwide, including well-known logistics companies such as USPS, UPS, DHL, FedEx, Australia Post, Royal Mail, UBI, CNE, Yanwen, DPD, La Poste, GLS, and others. It also covers commonly used couriers by dropshipping merchants, like AliExpress Standard Shipping (Cainiao tracking), YunExpress, 4PX, CJ Packet, ePacket tracking (China Post, China EMS), and more.</p>\n</p>\n<dt id='where%20can%20my%20customers%20track%20their%20shipments%3F'>\nWhere can my customers track their shipments?\n</h4>\n<p>\n<p>Parcel Panel Shipment Tracking creates a branded tracking page on your WooCommerce store domain. Your customers can use this page to track their shipments. Simply add the tracking page to your store menus for easy access.</p>\n</p>\n<dt id='will%20it%20automatically%20track%20my%20orders%20and%20notify%20my%20customers%3F'>\nWill it automatically track my orders and notify my customers?\n</h4>\n<p>\n<p>Absolutely! ParcelPanel Shipment Tracking automatically matches couriers to accurately track your orders and update shipment statuses. With built-in shipping notifications and WooCommerce email alerts, you and your customers stay informed throughout the process.</p>\n</p>\n<dt id='why%20do%20i%20see%20a%20%22failed%20to%20connect%20to%20parcelpanel.%20can%20not%20connect%20website.%22%20error%3F'>\nWhy do I see a &#8220;Failed to connect to ParcelPanel. Can not connect website.&#8221; error?\n</h4>\n<p>\n<ul>\n<li>Check for active security plugins: Sometimes security plugins block connections to websites. Try disabling them and see if it resolves the issue.</li>\n<li>Contact your web host: Your host might have a firewall that&#8217;s blocking ParcelPanel. Ask them to <strong>whitelist ParcelPanel&#8217;s IPs</strong> or disable the firewall.</li>\n<li>Reach out to customer service: If the problem persists, contact our customer service via live chat or email for assistance. We&#8217;re here to help!</li>\n</ul>\n</p>\n<dt id='which%20themes%20does%20parcelpanel%27s%20tracking%20page%20support%3F'>\nWhich themes does ParcelPanel&#8217;s tracking page support?\n</h4>\n<p>\n<p>ParcelPanel has been tested with numerous WordPress themes and is compatible with all major WordPress themes. If you encounter any issues after installing ParcelPanel, please contact our support team, and we&#8217;ll assist you in resolving them.</p>\n</p>\n<dt id='does%20parcel%20panel%20order%20tracking%20adhere%20to%20a%20privacy%20policy%3F'>\nDoes Parcel Panel Order Tracking adhere to a privacy policy?\n</h4>\n<p>\n<p>ParcelPanel prioritizes user privacy. We do not gather private information about your store or customers without your consent. Additionally, our plugin is ISO 27001 certified and GDPR compliant. Click to read more about our <a href=\"https://www.parcelpanel.com/privacy-policy/\" rel=\"nofollow ugc\">Privacy Policy</a>.</p>\n</p>\n\n",
        "changelog": "<h4>4.3.8 &#8211; 2024-08-22</h4>\n<ul>\n<li>Enhanced – Compatible with Object Cache Pro and Redis Object Cache</li>\n</ul>\n<h4>4.3.5 &#8211; 2024-07-29</h4>\n<ul>\n<li>Fix &#8211; Fixed some known issues</li>\n</ul>\n<h4>4.3.0 &#8211; 2024-07-12</h4>\n<ul>\n<li>Fix &#8211; Fixed some known issues</li>\n</ul>\n<h4>4.2.2 &#8211; 2024-06-25</h4>\n<ul>\n<li>Fix &#8211; Fixed some known issues</li>\n</ul>\n<h4>4.2.0 &#8211; 2024-06-12</h4>\n<ul>\n<li>Added &#8211; Detailed analysis on Shipments, Transit Time, Tracking Page, and Shipping Notifications in Analytics page</li>\n<li>Added &#8211; NPS (Net Promoter Score)</li>\n<li>Enhanced &#8211; Post-purchase Estimated Delivery Date (EDD)</li>\n<li>Enhanced &#8211; Product recommendation logic</li>\n<li>Enhanced &#8211; Home page</li>\n<li>Fixed &#8211; Various known issues</li>\n</ul>\n<h4>4.1.3 &#8211; 2024-05-13</h4>\n<ul>\n<li>Fix &#8211; Fixed some known issues</li>\n</ul>\n<h4>4.1.2 &#8211; 2024-05-07</h4>\n<ul>\n<li>Fix &#8211; Fixed some known issues</li>\n</ul>\n<h4>4.1.1 &#8211; 2024-04-26</h4>\n<ul>\n<li>Fix &#8211; Fixed some known issues</li>\n</ul>\n<h4>4.1.0 &#8211; 2024-04-26</h4>\n<ul>\n<li>Add &#8211; Annual subscription plan &amp; usage charges</li>\n<li>Fix &#8211; Fixed some known issues</li>\n</ul>\n<h4>3.10.0 &#8211; 2024-04-01</h4>\n<ul>\n<li>Add &#8211; Annual user survey banner, onboarding, trial conversion</li>\n<li>Enhancement &#8211; Quick setup guide</li>\n<li>Fix – Fixed some known issues</li>\n</ul>\n<h4>3.9.0 &#8211; 2024-01-29</h4>\n<ul>\n<li>Add &#8211; Integrations with ShipStation, Dianxiaomi, and Pirateship</li>\n<li>Enhancement &#8211; Optimize the order fulfillment workflow(Partially Shipped, Shipped, Delivered )</li>\n<li>Enhancement &#8211; Add tracking  number widget</li>\n<li>Enhancement &#8211; Shipment page reconstruction.</li>\n<li>Enhancement &#8211; Updating ParcelPanel shipping notification content according to the new email regulations.</li>\n<li>Fix – Fixed some known issues</li>\n</ul>\n<h4>3.8.0 &#8211; 2023-12-12</h4>\n<ul>\n<li>Add &#8211; Integrations with PayPal, Klaviyo, and Omnisend</li>\n<li>Add &#8211; Multilingual Tracking Page (Automatic Language Switching, Automatic Translation for Dynamic Tracking Details)</li>\n<li>Enhancement &#8211; Tracking Page theme adaptation, RTL Layout Support and Mobile Optimization</li>\n<li>Enhancement &#8211; Compatible with HPOS (WooCommerce orders tables only)</li>\n<li>Fix – Fixed some known issues</li>\n</ul>\n<h4>3.7.0 &#8211; 2023-10-31</h4>\n<ul>\n<li>Add &#8211; Brand new ParcelPanel shipping notifications custom email editor</li>\n<li>Add &#8211; Advanced analytics (ParcelPanel shipping notifications, Tracking page Marketing clicks, Coupons upsell&#8230;)</li>\n</ul>\n<h4>3.6.1 &#8211; 2023-9-13</h4>\n<ul>\n<li>Changed – New payment model.</li>\n<li>Changed – Brand new UX design to account page.</li>\n<li>Fix – Fixed some known issues.</li>\n</ul>\n<h4>3.2.0 &#8211; 2023-8-07</h4>\n<ul>\n<li>Add – Compatible with WooCommerce HPOS.</li>\n<li>Add – Integrated YayMail – WooCommerce Email Customizer, WPML, WooCommerce Shipping, Shippo, Sendcloud.</li>\n<li>Fix – Fixed some known issues.</li>\n</ul>\n<h4>3.1.0</h4>\n<ul>\n<li>Add – ParcelPanel for WooCommerce Tracking API.</li>\n<li>Add – NPS banner.</li>\n</ul>\n<h4>3.0.11 &#8211; 2023-5-29</h4>\n<ul>\n<li>Fix &#8211; Fixed some known issues.</li>\n</ul>\n<h4>3.0.0 &#8211; 2023-5-17</h4>\n<ul>\n<li>Changed &#8211; Brand new UX design to improve user experience!</li>\n<li>Add &#8211; welcome aboard.</li>\n<li>Add &#8211; Multiple data analysis sections.</li>\n<li>Changed &#8211; Dropshipping mode can be enabled and disabled.</li>\n<li>Add &#8211; Filter by destinations.</li>\n<li>Add &#8211; Statistics of transit time.</li>\n<li>Changed &#8211; Manually update status.</li>\n<li>Fix &#8211; Fixed some known issues.</li>\n</ul>\n<h4>2.9.4 &#8211; 2023-3-09</h4>\n<ul>\n<li>Fix &#8211; Fixed some known issues.</li>\n</ul>\n<h4>2.9.2 &#8211; 2023-2-23</h4>\n<ul>\n<li>Fix &#8211; Fixed some known issues.</li>\n</ul>\n<h4>2.9.0 &#8211; 2023-2-22</h4>\n<ul>\n<li>Add – Intelligent product recommendation.</li>\n<li>Add &#8211; Research banner.</li>\n<li>Update &#8211; Google Maps recognition.</li>\n<li>Enhancement – Optimized UI interaction experience.</li>\n</ul>\n<h4>2.8.0 &#8211; 2023-2-8</h4>\n<ul>\n<li>Add &#8211; Integration with ALD and DSers.</li>\n<li>Update &#8211; Update the track button text of Account page.</li>\n<li>Enhancement &#8211; Order synchronization logic.</li>\n</ul>\n<h4>2.6.0 &#8211; 2022-10-19</h4>\n<ul>\n<li>Add &#8211; Partially Shipped mail.</li>\n<li>Add &#8211; Add a shortcut button to WooCommerce orders.</li>\n<li>Changed &#8211; The feature &#8220;Rename order status&#8221; moved to the settings tab.</li>\n<li>Update &#8211; Sync manually changed status to WooCommerce.</li>\n<li>Update &#8211; ParcelPanel shipping email notifications.</li>\n<li>Enhancement &#8211; CSV import feature optimization.</li>\n<li>Enhancement &#8211; Optimized UI interaction experience.</li>\n<li>Fix &#8211; Fixed some known issues.</li>\n</ul>\n<h4>2.5.0 &#8211; 2022-9-20</h4>\n<ul>\n<li>Update &#8211; Some styling updates.</li>\n<li>Fix &#8211; Fixed some known issues.</li>\n</ul>\n<h4>2.4.0 &#8211; 2022-8-10</h4>\n<ul>\n<li>Add &#8211; New feature: custom tracking info.</li>\n<li>Add &#8211; New feature: estimated delivery time based on destination.</li>\n<li>Add &#8211; New feature: product recommendation.</li>\n<li>Fix &#8211; Fixed some known issues.</li>\n</ul>\n<h4>2.3.0 &#8211; 2022-8-1</h4>\n<ul>\n<li>Add &#8211; Added &#8220;partially shipped&#8221; feature.</li>\n<li>Enhancement &#8211; Adapted the mobile view layout.</li>\n</ul>\n<h4>2.2.0 &#8211; 2022-7-11</h4>\n<ul>\n<li>Add &#8211; Added manually changing the shipment status.</li>\n<li>Update &#8211; Use Google Map on Tracking Page.</li>\n</ul>\n<h4>2.1.0 &#8211; 2022-6-23</h4>\n<ul>\n<li>Add &#8211; Added CSV column mapping of import tracking number.</li>\n</ul>\n<h4>2.0.2 &#8211; 2022-4-22</h4>\n<ul>\n<li>Add &#8211; Added some date formats.</li>\n<li>Fix &#8211; Fixed order number not showing in emails.</li>\n</ul>\n<h4>2.0.0 &#8211; 2022-4-13</h4>\n<ul>\n<li>Add &#8211; 1-click dropshipping mode.</li>\n<li>Update &#8211; Track order by phone.</li>\n<li>Enhancement &#8211; Associated with shipment and order items.</li>\n<li>Enhancement &#8211; Optimized the courier filter items on the shipments page.</li>\n<li>Enhancement &#8211; Optimized UI interaction experience.</li>\n</ul>\n<h4>1.4.5 &#8211; 2022-4-6</h4>\n<ul>\n<li>Enhancement &#8211; Features of import tracking number.</li>\n<li>Enhancement &#8211; Optimized style for tracking page.</li>\n<li>Enhancement &#8211; Optimized the code.</li>\n</ul>\n<h4>1.4.4 &#8211; 2022-3-24</h4>\n<ul>\n<li>Fix &#8211; Backwards compatibility issues with permission_check.</li>\n<li>Security &#8211; Fixed REST API authorization.</li>\n</ul>\n<h4>1.4.0 &#8211; 2022-3-18</h4>\n<ul>\n<li>Fix &#8211; The &#8220;Track Your Order&#8221; of the email template refers to the tracking page title.</li>\n<li>Update &#8211; Upgraded some dependencies.</li>\n<li>Enhancement &#8211; Optimized authorization verification and improved page performance.</li>\n</ul>\n<h4>1.3.0 &#8211; 2022-2-17</h4>\n<ul>\n<li>Update &#8211; Some courier company logos.</li>\n<li>Update &#8211; Updated CSV template header name.</li>\n<li>Enhancement &#8211; Added alignment style for title text in email preview.</li>\n</ul>\n<h4>1.2.1 &#8211; 2022-2-10</h4>\n<ul>\n<li>Enhancement &#8211; Synchronize with the tracking number of Ali2Woo.</li>\n<li>Fix &#8211; Fixed the tracking page timeline style in RTL mode.</li>\n</ul>\n<h4>1.2.0 &#8211; 2022-1-20</h4>\n<ul>\n<li>Add &#8211; Sync orders.</li>\n</ul>\n<h4>1.1.3 &#8211; 2022-1-17</h4>\n<ul>\n<li>Update &#8211; Style of the track button for the tracking page.</li>\n</ul>\n<h4>1.1.0 &#8211; 2022-1-10</h4>\n<ul>\n<li>Special Offer &#8211; ParcelPanel for WooCommerce is 100% OFF Now!!</li>\n<li>Add &#8211; Shipments page for ParcelPanel.</li>\n<li>Add &#8211; One-click to set the theme language of the tracking page.</li>\n<li>Add &#8211; Shipment export feature.</li>\n<li>Add &#8211; Manually sync orders.</li>\n<li>Add &#8211; Plugin feedback feature.</li>\n<li>Add &#8211; Dropshipping help guide.</li>\n<li>Fix &#8211; Some bugs in the settings page.</li>\n<li>Update &#8211; Some courier company logos.</li>\n<li>Update &#8211; Tracking page button with the same style as the theme.</li>\n<li>Update &#8211; A new default configuration for the settings page.</li>\n<li>Integration &#8211; Track the tracking number of Ali2Woo.</li>\n</ul>\n<h4>1.0.14 &#8211; 2021-12-10</h4>\n<ul>\n<li>Enhancement &#8211; Optimized tracking page.</li>\n</ul>\n<h4>1.0.12 &#8211; 2021-11-5</h4>\n<ul>\n<li>Fix &#8211; Auto sync courier list.</li>\n</ul>\n<h4>1.0.10 &#8211; 2021-10-30</h4>\n<ul>\n<li>Enhancement &#8211; Optimized the code.</li>\n</ul>\n<h4>1.0.8 &#8211; 2021-10-27</h4>\n<ul>\n<li>Add &#8211; Sample product display on tracking preview page.</li>\n<li>Add &#8211; Remind when the quota is less than or equal to 5.</li>\n<li>Add &#8211; Integrated intercom.</li>\n<li>Update &#8211; Some courier company logos.</li>\n<li>Enhancement &#8211; Cache plan list information.</li>\n<li>Enhancement &#8211; Bind the site to your account.</li>\n<li>Enhancement &#8211; Simplified the procedures for plan downgrade.</li>\n</ul>\n"
    },
    "short_description": "Tracking, Order tracking, Shipment tracking, Track order, The best Order Tracker for WooCommerce, Easily Track Order Status and Delivery Notifications",
    "description": "<h3>PARCELPANEL SHIPMENT TRACKING FOR WOOCOMMERCE – BEST ORDER TRACKING PLUGIN IN WORDPRESS 💪</h3>\n<p><strong>&#8220;Where is my order?&#8221;(WISMO) is the biggest concern of your customers.</strong> We created Parcel Panel Shipment Tracking, the ultimate tracking plugin for WordPress, to help WooCommerce merchants get access to the order tracker, improving customer satisfaction and driving more sales by providing the best post-purchase experience.</p>\n<h3>Free plan still available ✨</h3>\n<ul>\n<li>Since our initial launch in 2021, ParcelPanel Tracking has remained 100% FREE up to the present day. However, due to the continuous increase of various costs, we have decided to launch the paid version V3.6 starting in Sept, 2023.</li>\n<li>Free plan Including:\n<ul>\n<li>20 orders/month, and provides unlimited order lookups</li>\n<li>Access to 1,200+ carriers</li>\n<li>Real-time sync &amp; tracking</li>\n<li>Branded tracking page</li>\n<li>&#8230;</li>\n</ul>\n</li>\n</ul>\n<p>🥳 Limited Time Hidden Benefit: 50% discount for new users on monthly plans for the first month!</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/enPiGqg5pis?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><a href=\"https://docs.parcelpanel.com/woocommerce/\" rel=\"nofollow ugc\">Help Center</a> | <a href=\"https://www.parcelpanel.com/\" rel=\"nofollow ugc\">Website</a> | <a href=\"https://wordpress.org/support/plugin/parcelpanel/\" rel=\"ugc\">Support Forum</a></p>\n<h3>Fully GDPR ready</h3>\n<p>ParcelPanel Tracking is fully GDPR compliant, so you can be confident that your customers’ data is being collected and used in a responsible way. Learn more about our <a href=\"https://www.parcelpanel.com/privacy-policy/\" rel=\"nofollow ugc\">Privacy Policy</a>.</p>\n<h3>Why do you need an order tracking plugin for WooCommerce?</h3>\n<ul>\n<li>\n<p><strong>More than 5% support tickets for order tracking</strong><br />\nIf too many support tickets are about WISMO, then you&#8217;re experiencing order tracking and shipment tracking issues. Manually tracking shipments leads to high costs due to repetitive tasks.</p>\n</li>\n<li>\n<p><strong>Your customers are jumping through hoops</strong><br />\nTracking orders and knowing estimated delivery dates should be effortless for customers. Customers often face difficulty manually inputting tracking numbers into third-party tracking sites and find no information available until shipments start. This can lead to a disappointing tracking experience and lost sales due to decreased customer excitement about their orders.</p>\n</li>\n<li>\n<p><strong>Consistent brand experience is being challenged</strong><br />\nBefore purchase, you control the customer experience. However, after ordering, shipment tracking is handled by a third-party carrier. Problems like a poorly designed tracking page or loading issues can harm your brand.</p>\n</li>\n</ul>\n<h3>Why Parcel Panel Order Tracking for WooCommerce?</h3>\n<ul>\n<li>Parcel Panel Order Tracking can solve all the above shipment tracking and tracking issues and even bring in additional revenue.</li>\n<li>We&#8217;ve been focused on parcel tracking for years, provides advanced shipment tracking, and make sure accurate results for track orders, better than AST (Advanced Shipment Tracking), Trackship, 17track, Aftership, TrackingMore, Yith, Orders tracking, covering <a href=\"https://www.parcelpanel.com/couriers/\" rel=\"nofollow ugc\">1,200+ carriers</a> worldwide including USPS, Cainiao, Royal Mail, YunExpress, 4PX, YANWEN, etc.</li>\n<li>Perhaps we may not yet be as renowned as those well-known plugins on WordPress, such as Elementor, Yoast SEO, Rank Math SEO, Popup Builder, or the essential WordPress plugins like Contact Form, Classic Editor, Akismet Anti-Spam: Spam Protection, Jetpack, WP Mail SMTP, nor do we fall under the trendy categories like SEO, Email Marketing, Translate, Popup, or Google Analytics. However, our brand is built on being the top eCommerce tracking solution, dedicated to providing the best post-purchase experience for your customers with our ultimate product and service approach.</li>\n<li>Our team believes in efficiency and doing what&#8217;s right. We&#8217;re here to help merchants with order tracking challenges.</li>\n<li>Discover our exclusive order tracking features and understand why ParcelPanel shipment tracking is possibly the best WooCommerce tracking plugin.</li>\n</ul>\n<h3>Working Principle</h3>\n<h3>Streamlined Order Fulfillment Workflow</h3>\n<p>ParcelPanel Tracking offers features to optimize your order fulfillment process, tailored to meet various merchant requirements.</p>\n<ul>\n<li>Parcel Panel Shipment Tracking enables you to add [Partially Shipped], [Shipped], and [Delivered] order statuses, aligning seamlessly with your store&#8217;s workflow.</li>\n<li>Automation &#8211; ParcelPanel tracking support automatic switching of order status after all shipments reach the &#8216;Delivered&#8217; status to reduce repetitive tasks.</li>\n</ul>\n<h3>Auto-sync WooCommerce order data</h3>\n<ul>\n<li>Once a WooCommerce order is placed, it syncs up with Parcel Panel Shipment Tracking automatically. From there, tracking your shipments on our branded page is a breeze.</li>\n</ul>\n<h3>Auto-matching courier</h3>\n<ul>\n<li>We ensure accurate tracking results for all orders, covering <a href=\"https://www.parcelpanel.com/couriers/\" rel=\"nofollow ugc\">1,200+ mainstream carriers</a> worldwide.</li>\n<li>Parcel Panel Shipment Tracking&#8217;s smart system automatically identifies the correct couriers, retrieves tracking details from their official websites, and displays them on the tracking page.</li>\n</ul>\n<h3>Add tracking numbers to orders</h3>\n<ul>\n<li>Use the tracking number widget: Individually add tracking numbers on the Edit order page. Once added, they&#8217;ll sync to the ParcelPanel Shipments page.</li>\n<li>Bulk import via CSV: Utilize our smart field-mapping tool to import multiple tracking numbers from a CSV file, minimizing repetitive tasks.</li>\n<li>API Integration: Easily manage shipment tracking information in orders through ParcelPanel WooCommerce Tracking API (API). Refer to our <a href=\"https://docs.parcelpanel.com/woocommerce/api/pp-woo-api/\" rel=\"nofollow ugc\">API doc</a> for details.</li>\n<li>Third-Party Fulfillment: For dropshipping and shipping plugins, tracking numbers are auto-synced to ParcelPanel without any additional effort required on your part! </li>\n</ul>\n<h3>Integration</h3>\n<p>Parcel Panel Shipment Tracking integration includes the following plugins:</p>\n<ul>\n<li>Dropshipping\n<ul>\n<li>Ali2Woo &#8211; AliExpress Dropshipping with Ali2Woo Lite</li>\n<li>ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</li>\n<li>DSers</li>\n</ul>\n</li>\n<li>Shipping\n<ul>\n<li>WooCommerce Shipping</li>\n<li>Shippo</li>\n<li>Sendcloud</li>\n<li>ShipStation</li>\n<li>Dianxiaomi</li>\n<li>Pirateship </li>\n</ul>\n</li>\n<li>Email marketing\n<ul>\n<li>Klaviyo</li>\n<li>Omnisend</li>\n</ul>\n</li>\n<li>Payment\n<ul>\n<li>Paypal</li>\n</ul>\n</li>\n<li>Translate\n<ul>\n<li>WPML</li>\n<li>Weglot</li>\n</ul>\n</li>\n<li>Email customizer\n<ul>\n<li>YayMail – WooCommerce Email Customizer </li>\n</ul>\n</li>\n<li>Custom order number\n<ul>\n<li>Sequential Order Number for WooCommerce by WebToffee</li>\n<li>&#8230;</li>\n</ul>\n</li>\n<li>More Integration coming soon&#8230;</li>\n</ul>\n<p>ParcelPanel Shipment Tracking will continue to integrate with more plugins to improve the user experience. Stay tuned!<br />\nGot a plugin you&#8217;d like us to add? Let us know through our Feature request page, and we&#8217;ll check it out!</p>\n<h3>The best for WooCommerce dropshipping</h3>\n<ul>\n<li>Dropshipping mode hides all Chinese origins seamlessly, offering customers a complete branded shopping experience.</li>\n<li>Seamless integration with WooCommerce dropshipping apps like Ali2Woo, ALD, and DSers. Automatically sync tracking numbers from these apps for easy shipment tracking.</li>\n<li>Stay tuned for more integrated dropshipping plugins coming soon!</li>\n</ul>\n<h3>Save money &amp; Boost sales</h3>\n<p>A great order tracking solution not only lets customers track orders on their own, saving you cash, but also creates opportunities to make more money.<br />\nParcelPanel Shipment Tracking offers proactive updates and notifications on parcel progress, enabling customers to view current status.<br />\nBy offering product recommendations and controlling the customer experience, you can open up new marketing channels and increase sales.</p>\n<h3>Free to install &amp; Free plan available &amp; No-credit-card trial</h3>\n<ul>\n<li>Parcel Panel Shipment Tracking is a Free plan available with key features available and 20 quota/month!</li>\n</ul>\n<h3>Your brand, Your tracking page</h3>\n<ul>\n<li>Parcel Panel Order Tracking automatically creates a branded tracking page under your store domain (SEO friendly) with plenty of customizable elements. No more &#8220;Where is my order?&#8221; inquiries—bring customers back to your store and boost sales effortlessly.</li>\n</ul>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/eja-IuEViJs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<ul>\n<li>Order Lookup Widget\n<ul>\n<li>Allow customers to effortlessly track their orders using various methods.</li>\n<li>Track by order number and email/phone number.</li>\n<li>Track by tracking number only.</li>\n<li>Unlimited order lookups.</li>\n</ul>\n</li>\n<li>Shipping progress bar &#8211; keep your customers informed of order status.</li>\n<li>Intelligent product recommendation &#8211; upsell products on the tracking page to drive additional sales and enhance the tracking experience.</li>\n<li>Custom shipment status &#8211; inform customers of your process prior to shipping.</li>\n<li>Estimated delivery time &#8211; your customers always know when they can receive their packages.</li>\n<li>Map coordinates &#8211; Clear Google Maps to show customers the location of their packages.</li>\n<li>Multilingual Tracking Page &#8211; automatically adjust the language on the tracking page based on the store&#8217;s language when customers visit. Supports up to 34 languages and integrates seamlessly with translation apps like WPML.</li>\n<li>Universal Integration &#8211; Compatible with all themes and devices for a seamless tracking experience. Especially fully optimized for Right-to-Left (RTL) layouts.</li>\n<li>Mobile Optimization &#8211; mobile styles fine-tuned for smoother navigation, especially during peak-season promotions.</li>\n<li>Drive Traffic to Your Site &#8211; redirect customers to your WooCommerce site instead of the carrier site, increasing organic search traffic.</li>\n</ul>\n<h3>Account page tracking</h3>\n<ul>\n<li>With Parcel Panel Order Tracking, you can easily add a track button to your order history page, enabling your customers to conveniently track their order status with just one click there.</li>\n</ul>\n<h3>Shipping notifications</h3>\n<p><strong>Add an order tracking section to WooCommerce email notifications</strong><br />\nAutomatically insert Parcel Panel Shipment Tracking section to email notifications base on order status, so customers can easily track shipments in their email.</p>\n<p><strong>ParcelPanel shipping notifications</strong></p>\n<ul>\n<li>Developed and sent by ParcelPanel tracking\n<ul>\n<li>Stay informed with 5 smart notifications triggered by key shipping updates, keeping customers up-to-date on order progress.</li>\n<li>Customize email design and content to match your brand, providing a seamless post-purchase experience.</li>\n<li>Boost revenue with upsell and product recommendations directly within the email.</li>\n<li>Automatically ParcelPanel tracking shipping notifications in the customer&#8217;s language based on country for a seamless shopping experience worldwide.</li>\n</ul>\n</li>\n<li>Developed by ParcelPanel but sent by WooCommerce\n<ul>\n<li>Easily set up WooCommerce&#8217;s standard email system <a href=\"https://developer.wordpress.org/reference/functions/wp_mail/\" rel=\"nofollow ugc\"><code>wp_mail()</code></a> or ParcelPanel shipping emails (sent by WooCommerce) if preferred.</li>\n</ul>\n</li>\n</ul>\n<h3>Comprehensive dashboard insights</h3>\n<ul>\n<li>Order and Shipment Tracking: Access a robust dashboard for easy analysis and export of order and shipment tracking data, providing valuable insights for driving revenue growth.</li>\n<li>In-Depth Analytics: Obtain detailed analysis on Shipments, Transit Time, Tracking Pages, and Shipping Notifications at the Analytics page, empowering you to make informed decisions regarding your shipments.</li>\n</ul>\n<h3>Shipment management dashboard</h3>\n<ul>\n<li>Easily filter shipments by Order number, Tracking number, or Customer name.</li>\n<li>Customize displayed columns including &#8220;Order,&#8221; &#8220;Tracking number,&#8221; &#8220;Shipment status,&#8221; and more to suit your browsing needs.</li>\n<li>Trace shipments regardless of status, including exceptions, and view detailed order information on the shipment page.</li>\n<li>Utilize 8 standardized shipment tracking statuses for clarity.</li>\n<li>Manually update order status, ideal for merchants with their own shipping or local delivery teams.</li>\n</ul>\n<h3>Shipping providers</h3>\n<ul>\n<li>Parcel Panel Order Tracking support <a href=\"https://www.parcelpanel.com/couriers/\" rel=\"nofollow ugc\">1,200+ carriers</a> worldwide:<br />\nUSPS, Yun Express, AliExpress Standard Shipping, 4PX, UPS, DHL, Fedex, Delhivery, DHL Express, Australia Post, YANWEN, Brazil Correios, UK Royal Mail, CNE Express, YDH, China Post, La Poste and many more&#8230;.</li>\n</ul>\n<h3>Translations</h3>\n<ul>\n<li>The Parcel Panel Order Tracking plugin is localized and translatable by default. we support translation to the following languages: <strong>Chinese (Simplified), Chinese Traditional, English – default, French(France), German, Italian, Spanish(Spain), Portuguese(Portugal), Dutch, and Greek.</strong></li>\n</ul>\n<h3>24/7 Live chat support</h3>\n<ul>\n<li>Live chat or email: Need help? Don&#8217;t hesitate to contact us via live chat or email at <a href=\"mailto:&#115;&#x75;&#112;&#x70;&#111;&#x72;&#116;&#x40;&#112;a&#114;c&#x65;&#108;&#x70;&#097;&#x6e;&#101;&#x6c;&#046;&#x6f;&#114;&#x67;\" rel=\"nofollow ugc\">support@parcelpanel.org</a>.\n<ul>\n<li>ParcelPanel values your privacy. Our live chat, powered by Intercom, is disabled by default. We don&#8217;t collect private information about your store or customers without your permission. Click to learn more about our <a href=\"https://www.parcelpanel.com/privacy-policy/\" rel=\"nofollow ugc\">Privacy Policy</a>.</li>\n</ul>\n</li>\n<li><a href=\"https://wordpress.org/support/plugin/parcelpanel/\" rel=\"ugc\">Support Forum</a> is an excellent resource for discussing and solving problems.</li>\n<li><a href=\"https://docs.parcelpanel.com/woocommerce/\" rel=\"nofollow ugc\">ParcelPanel help center</a> is another valuable resource where you can find more information and detailed tutorials.</li>\n</ul>\n<h3>6,000+ Happy Customers</h3>\n<p>Join over 6,000 happy customers and elevate your post-purchase experience with Parcel Panel today. Here&#8217;s what our customers have to say:</p>\n<p>⭐⭐⭐⭐⭐</p>\n<blockquote>\n<p>&#8220;I&#8217;d install this tracking plugin in any store without hesitation. It&#8217;s incredibly useful, easy to use, customizable, and does its job perfectly. Plus, the support team is fast and friendly. Give it a try—you won&#8217;t regret it!&#8221;</p>\n</blockquote>\n<p>⭐⭐⭐⭐⭐</p>\n<blockquote>\n<p>&#8220;ParcelPanel Order Tracking is simply the best in the international market. It has no competitor.&#8221;</p>\n</blockquote>\n<p>⭐⭐⭐⭐⭐</p>\n<blockquote>\n<p>&#8220;I was facing a big problem by searching for custom order tracking module. After some research I got to know about ParcelPanel Order Tracking. It exceeded my expectations for my site and customers. Thank you to the development team!&#8221;</p>\n</blockquote>\n<p>⭐⭐⭐⭐⭐</p>\n<blockquote>\n<p>&#8220;Top-notch service with no quality alternatives in the WordPress plugin market. Highly recommended for serious shops—it&#8217;ll boost customer satisfaction to 100%.&#8221;</p>\n</blockquote>\n<p>⭐⭐⭐⭐⭐</p>\n<blockquote>\n<p>&#8220;This tracking plugin has everything a small e-commerce website needs. The tracking option simplifies things for both shop managers and customers. Extra settings like a branded tracking page, cross-selling recommendations, and end-to-end tracking make life even easier. Overall, it&#8217;s the go-to solution for shipment tracking needs.&#8221;</p>\n</blockquote>\n<h3>Getting started</h3>\n<p><a href=\"https://docs.parcelpanel.com/woocommerce/\" rel=\"nofollow ugc\">ParcelPanel Help Center</a>: While Parcel Panel Shipment Tracking is already easy to set up, our tutorials, guides, and knowledge bases are here to ensure you get started smoothly.<br />\n<a href=\"https://wordpress.org/support/plugin/parcelpanel/\" rel=\"ugc\">Support Ticket Forum</a>: Our dedicated forum offers support for any issues you encounter with Parcel Panel Shipment Tracking. We prioritize user experience and aim to promptly address all queries on the forum.<br />\n<a href=\"https://wordpress.org/plugins/parcelpanel/#faq-header\" rel=\"ugc\">Frequently Asked Questions</a>: Find answers to common questions about Parcel Panel Order Tracking, covering features, pricing, and more.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/parcelpanel.4.3.8.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/parcelpanel/assets/screenshot-1.png?rev=3054304",
            "caption": "Why Parcel Panel order tracking"
        },
        {
            "src": "https://ps.w.org/parcelpanel/assets/screenshot-2.png?rev=3054304",
            "caption": "No More \"Where is my order?\""
        },
        {
            "src": "https://ps.w.org/parcelpanel/assets/screenshot-3.png?rev=3054304",
            "caption": "Enhance Customer Satisfaction"
        },
        {
            "src": "https://ps.w.org/parcelpanel/assets/screenshot-4.png?rev=3054304",
            "caption": "More Traffic, More Revenue"
        },
        {
            "src": "https://ps.w.org/parcelpanel/assets/screenshot-5.png?rev=3054304",
            "caption": "Data-driven Decisions"
        },
        {
            "src": "https://ps.w.org/parcelpanel/assets/screenshot-6.png?rev=3054304",
            "caption": "Seamless Integration"
        },
        {
            "src": "https://ps.w.org/parcelpanel/assets/screenshot-7.png?rev=3054304",
            "caption": "Responsive Design"
        },
        {
            "src": "https://ps.w.org/parcelpanel/assets/screenshot-8.png?rev=3054304",
            "caption": "ParcelPanel shipments dashboard"
        }
    ],
    "tags": {
        "order-tracking": "order tracking",
        "shipment-tracking": "shipment tracking",
        "track-order": "track order",
        "tracking": "tracking",
        "woocommerce-shipment-tracking": "woocommerce shipment tracking"
    },
    "stable_tag": "4.3.8",
    "versions": {
        "1.0.10": "https://downloads.wordpress.org/plugin/parcelpanel.1.0.10.zip",
        "1.0.14": "https://downloads.wordpress.org/plugin/parcelpanel.1.0.14.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/parcelpanel.1.0.2.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/parcelpanel.1.0.6.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/parcelpanel.1.0.8.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/parcelpanel.1.4.4.zip",
        "2.9.4": "https://downloads.wordpress.org/plugin/parcelpanel.2.9.4.zip",
        "3.0.10": "https://downloads.wordpress.org/plugin/parcelpanel.3.0.10.zip",
        "3.0.11": "https://downloads.wordpress.org/plugin/parcelpanel.3.0.11.zip",
        "3.0.8": "https://downloads.wordpress.org/plugin/parcelpanel.3.0.8.zip",
        "3.0.9": "https://downloads.wordpress.org/plugin/parcelpanel.3.0.9.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/parcelpanel.3.1.0.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/parcelpanel.3.1.1.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/parcelpanel.3.1.2.zip",
        "3.1.3": "https://downloads.wordpress.org/plugin/parcelpanel.3.1.3.zip",
        "3.1.4": "https://downloads.wordpress.org/plugin/parcelpanel.3.1.4.zip",
        "3.1.5": "https://downloads.wordpress.org/plugin/parcelpanel.3.1.5.zip",
        "3.10.0": "https://downloads.wordpress.org/plugin/parcelpanel.3.10.0.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/parcelpanel.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/parcelpanel.3.2.1.zip",
        "3.6.0": "https://downloads.wordpress.org/plugin/parcelpanel.3.6.0.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/parcelpanel.3.6.1.zip",
        "3.7.1": "https://downloads.wordpress.org/plugin/parcelpanel.3.7.1.zip",
        "3.7.2": "https://downloads.wordpress.org/plugin/parcelpanel.3.7.2.zip",
        "3.8.1": "https://downloads.wordpress.org/plugin/parcelpanel.3.8.1.zip",
        "3.9.0": "https://downloads.wordpress.org/plugin/parcelpanel.3.9.0.zip",
        "4.1.0": "https://downloads.wordpress.org/plugin/parcelpanel.4.1.0.zip",
        "4.1.1": "https://downloads.wordpress.org/plugin/parcelpanel.4.1.1.zip",
        "4.1.2": "https://downloads.wordpress.org/plugin/parcelpanel.4.1.2.zip",
        "4.1.3": "https://downloads.wordpress.org/plugin/parcelpanel.4.1.3.zip",
        "4.2.0": "https://downloads.wordpress.org/plugin/parcelpanel.4.2.0.zip",
        "4.2.1": "https://downloads.wordpress.org/plugin/parcelpanel.4.2.1.zip",
        "4.2.2": "https://downloads.wordpress.org/plugin/parcelpanel.4.2.2.zip",
        "4.3.0": "https://downloads.wordpress.org/plugin/parcelpanel.4.3.0.zip",
        "4.3.1": "https://downloads.wordpress.org/plugin/parcelpanel.4.3.1.zip",
        "4.3.2": "https://downloads.wordpress.org/plugin/parcelpanel.4.3.2.zip",
        "4.3.3": "https://downloads.wordpress.org/plugin/parcelpanel.4.3.3.zip",
        "4.3.4": "https://downloads.wordpress.org/plugin/parcelpanel.4.3.4.zip",
        "4.3.5": "https://downloads.wordpress.org/plugin/parcelpanel.4.3.5.zip",
        "4.3.6": "https://downloads.wordpress.org/plugin/parcelpanel.4.3.6.zip",
        "4.3.7-beta-1": "https://downloads.wordpress.org/plugin/parcelpanel.4.3.7-beta-1.zip",
        "4.3.7-beta-2": "https://downloads.wordpress.org/plugin/parcelpanel.4.3.7-beta-2.zip",
        "4.3.8": "https://downloads.wordpress.org/plugin/parcelpanel.4.3.8.zip",
        "4.3.8-beta-1": "https://downloads.wordpress.org/plugin/parcelpanel.4.3.8-beta-1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/parcelpanel.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/parcelpanel/assets/banner-772x250.png?rev=3054311",
        "high": "https://ps.w.org/parcelpanel/assets/banner-1544x500.png?rev=3054304"
    },
    "icons": {
        "1x": "https://ps.w.org/parcelpanel/assets/icon-128x128.png?rev=2742561",
        "2x": "https://ps.w.org/parcelpanel/assets/icon-256x256.png?rev=2742561"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "parcelpanel",
            "language": "ar",
            "version": "4.3.8",
            "updated": "2023-08-16 02:15:54",
            "package": "https://downloads.wordpress.org/translation/plugin/parcelpanel/4.3.8/ar.zip"
        },
        {
            "type": "plugin",
            "slug": "parcelpanel",
            "language": "de_DE",
            "version": "4.3.8",
            "updated": "2023-12-12 07:43:26",
            "package": "https://downloads.wordpress.org/translation/plugin/parcelpanel/4.3.8/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "parcelpanel",
            "language": "el",
            "version": "4.3.8",
            "updated": "2023-12-12 07:43:28",
            "package": "https://downloads.wordpress.org/translation/plugin/parcelpanel/4.3.8/el.zip"
        },
        {
            "type": "plugin",
            "slug": "parcelpanel",
            "language": "es_ES",
            "version": "4.3.8",
            "updated": "2024-04-26 10:24:03",
            "package": "https://downloads.wordpress.org/translation/plugin/parcelpanel/4.3.8/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "parcelpanel",
            "language": "fr_FR",
            "version": "4.3.8",
            "updated": "2023-12-12 07:43:25",
            "package": "https://downloads.wordpress.org/translation/plugin/parcelpanel/4.3.8/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "parcelpanel",
            "language": "it_IT",
            "version": "4.3.8",
            "updated": "2023-12-12 07:43:29",
            "package": "https://downloads.wordpress.org/translation/plugin/parcelpanel/4.3.8/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "parcelpanel",
            "language": "nl_NL",
            "version": "4.3.8",
            "updated": "2024-04-26 08:12:56",
            "package": "https://downloads.wordpress.org/translation/plugin/parcelpanel/4.3.8/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "parcelpanel",
            "language": "pt_PT",
            "version": "4.3.8",
            "updated": "2023-12-12 07:43:33",
            "package": "https://downloads.wordpress.org/translation/plugin/parcelpanel/4.3.8/pt_PT.zip"
        },
        {
            "type": "plugin",
            "slug": "parcelpanel",
            "language": "sv_SE",
            "version": "4.3.8",
            "updated": "2023-12-12 07:43:35",
            "package": "https://downloads.wordpress.org/translation/plugin/parcelpanel/4.3.8/sv_SE.zip"
        },
        {
            "type": "plugin",
            "slug": "parcelpanel",
            "language": "zh_HK",
            "version": "4.3.8",
            "updated": "2023-12-12 07:43:20",
            "package": "https://downloads.wordpress.org/translation/plugin/parcelpanel/4.3.8/zh_HK.zip"
        },
        {
            "type": "plugin",
            "slug": "parcelpanel",
            "language": "zh_CN",
            "version": "4.3.8",
            "updated": "2023-12-12 07:43:19",
            "package": "https://downloads.wordpress.org/translation/plugin/parcelpanel/4.3.8/zh_CN.zip"
        }
    ]
}