{
    "name": "Photographers galleries",
    "slug": "photographers-galleries",
    "version": "1.1.8",
    "author": "<a href=\"https://photo.aurelienpierre.com\">Aurélien PIERRE</a>",
    "author_profile": "https://profiles.wordpress.org/aurelienpierre/",
    "contributors": {
        "aurelienpierre": {
            "profile": "https://profiles.wordpress.org/aurelienpierre/",
            "avatar": "https://secure.gravatar.com/avatar/e0fb97531f28593a553b2b2a657de0d7?s=96&d=monsterid&r=g",
            "display_name": "aurelienpierre"
        }
    },
    "requires": "3.6",
    "tested": "5.8.10",
    "requires_php": "7.2",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 1,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 1,
    "support_url": "https://wordpress.org/support/plugin/photographers-galleries/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 40,
    "downloaded": 5394,
    "last_updated": "2022-01-05 14:07:00",
    "added": "2016-04-25",
    "homepage": "https://wordpress.org/plugins/photographers-galleries/",
    "sections": {
        "description": "<h4>What ?</h4>\n<p>This is a lightweight plugin to display dynamic or static galleries on posts and pages with minimal overhead and using only native WordPress media.</p>\n<p>Main features:</p>\n<ol>\n<li>enable responsive images sizes (visitors get served the closest image size to their actual display resolution),</li>\n<li>enable custom taxinomies, tags, comments, author, comments for media attachments,</li>\n<li>make images queryable by tags, comments, taxinomies, etc. to display dynamic galleries from a shortcode,</li>\n<li>provide shortcode wrappers for default WordPress galleries to enable advanced layouts (carousel, exhibition, no caption, etc.),</li>\n<li>style default column galleries in a masonry way,</li>\n<li>add EXIF metadata in media admin view,</li>\n<li>fully responsive (height and width),</li>\n<li><strong>provide elegant, minimalist looks that put emphasis on image content first and never crop images to fit in an arbitrary layout.</strong></li>\n</ol>\n<p>The look is inspired by art books and museums exhibitions, meant to allow a flawless and non-intrusive full-screen experience, so you can design your website as a webapp.</p>\n<h4>Why ?</h4>\n<p>Most fancy gallery plugins will add their gallery manager on top of WordPress, which already has one… Then, they will crop images to fit within their fancy layout. Unfortunately, if you are an artist, the way you composed and framed your picture is no accident and should be honored by whatever display system you use. After all that, they will add an awful bloat of jQuery madness that will put a hole in your <a href=\"https://developers.google.com/speed/pagespeed/insights/\" rel=\"nofollow ugc\">Page Speed</a> score and kill your <a href=\"https://tools.pingdom.com/\" rel=\"nofollow ugc\">loading time</a>. Finally, they will distract visitors from your content with all their fancy effects that make your CPU overheat for nothing. Picture-based websites were already heavy, these will make sure to give them the final blow&#8230;</p>\n<p>We need better.</p>\n<h4>How ?</h4>\n<ul>\n<li>Use only built-in browser technologies (CSS, HTML, and native Javascript) to extend browser native features.</li>\n<li>Don&#8217;t use jQuery or additional bloatware lib that slows down page loading, creates compatibility nightmares and may not be hardware-accelerated.</li>\n<li>Load minified JS and CSS, on-demand (only on pages that use them), in footer and with defer support.</li>\n<li>Compatible with caching, minification, CDN and lazy loading (tested with WP Rocket).</li>\n<li>Compatible with lightboxes plugins.</li>\n<li>Only extends core WordPress features, for better security and maintainability.</li>\n</ul>\n<p>The JS weighs only 5.2 kB, and the CSS 7.2 kB.</p>\n<h3>Features</h3>\n<h4>Attachements improvements</h4>\n<p><strong>Photographers galleries</strong> enhances the WordPress attachments from the media library by enabling regular posts properties on them :</p>\n<ul>\n<li>comments,</li>\n<li>author,</li>\n<li>custom fields,</li>\n<li>posts categories,</li>\n<li>posts tags.</li>\n</ul>\n<p>It adds 3 custom taxonomies to the media attachments :</p>\n<ul>\n<li>galleries (which you can use as categories to describe <strong>what</strong> is on the picture),</li>\n<li>locations (<strong>where</strong> is the picture),</li>\n<li>models (<strong>who</strong> is on the picture).</li>\n</ul>\n<p>These taxonomies are hierarchical, meaning that a &#8220;USA&#8221; parent location can have &#8220;Texas&#8221; and &#8220;Nevada&#8221; children locations which can have children themselves.</p>\n<p>Taxonomies and tags make the attachments queryable in archives, just like posts categories, so they allow you to display dynamic galleries either through custom taxonomies template (to add to your theme) or on a page with a shortcode see <a href=\"https://wordpress.org/plugins/photographers-galleries/installation/\" rel=\"ugc\">Installation</a>. Most gallery<br />\nplugins create galleries as custom posts and force you to add your new pictures to all the relevant galleries. PG&#8217;s way allow you to add your pictures to multiple galleries in one step, during its upload in a post editor or in the media library.</p>\n<p>To add taxonomies terms to your pictures during their upload in posts editor, use the plugin <a href=\"https://wordpress.org/plugins/media-library-assistant/\" rel=\"ugc\">Media Library Assistant</a>. It will help you to bulk edit your media library too. See <a href=\"https://wordpress.org/plugins/photographers-galleries/other_notes/\" rel=\"ugc\">Other notes</a> to find how to set MLA.</p>\n<h4>Galleries improvements</h4>\n<p><strong>Photographers galleries</strong> enable the WordPress built-in HTML5 support for pictures and galleries to produce <code>&lt;figure&gt;</code> and <code>&lt;figcaption&gt;</code> tags to increase the SEO and get rid of WordPress default gallery layout (which width is set by the global variable <code>$content_width</code>). They add a fully responsive stylesheet to fit the galleries along the borders of the container.</p>\n<p>It also adds more thumbnails sizes for the responsive <code>srcset</code> HTML attribute of images, allowing browsers to load exactly the right image size for the current viewport size. These sizes go all the way from 240×360px to 4096×2160px, so don&#8217;t be afraid to upload high-resolution images, your visitors will only see the image size relevant for their screen size and pixel density.</p>\n<p>No particular operation is required, just use your regular WordPress gallery builder inside the post editor.</p>\n<h4>Extra layouts &amp; shortcodes wrappers for WordPress galleries</h4>\n<p><strong>Photographers galleries</strong> uses only regular WordPress galleries, called by the <code>[gallery]</code> shortcode, and does not rewrite them. This is intended to ensure maximum compatibility with other plugins (lightboxes, etc.) as well at with future WordPress versions. The extra gallery layouts are provided by extra shortcodes to wrap around the WordPress galleries.</p>\n<p><strong>Note : this makes use of the classic editor gallery, not the Gutenberg block. For what Photographers galleries does, the Gutenberg gallery block adds no benefit over the classic gallery.</strong></p>\n<p>Extra gallery layouts :</p>\n<ul>\n<li>no captions</li>\n<li>caption aligned</li>\n</ul>\n<p>See <a href=\"https://wordpress.org/plugins/photographers-galleries/installation/\" rel=\"ugc\">Installation</a> tab for use instructions.</p>\n<h4>Carousel</h4>\n<p><strong>Photographers galleries</strong> has a fixed-height carousel which takes by default 100 % of the container width and 92 % of the viewport height (99 % if captions are not displayed). It uses the native browser scrolling, supporting horizontal scrolling (touchpad and mouse wheel), swiping gestures (touch screens), click/tap on the next/previous buttons, as well as keyboard arrow keys (left and right).</p>\n<p>The pictures are fitted to the same height so the layout is flawless and continuous, perfect to display a serie or a portfolio. Every carousel instance on a same page can have its own style. This carousel was inspired by <a href=\"https://format.com/themes#horizon\" rel=\"nofollow ugc\">Format</a>.</p>\n<p>See <a href=\"https://wordpress.org/plugins/photographers-galleries/installation/\" rel=\"ugc\">Installation</a> tab for use details.</p>\n<h4>Exhibitions</h4>\n<p>Exhibitions are a new mode of the 1.0 that enables a full-width and full-height experience with a framing look reproducing museum framings. They come in-place of usual lightboxes and gives your pictures maximal impact with minimal clutter, assuming you will use them in a full-width theme template. They support keyboard arrow keys interactions, as well as horizontal scrolling and click/tap on the buttons.</p>\n<p>Exhibitions preload the next and previous images in row while looking at the current one, so the transition between images feels immediate and most lags are prevented.</p>\n<h4>Media library improvements</h4>\n<p><strong>Photographers galleries</strong> adds EXIF metadata of your pictures in the WP library columns :</p>\n<ul>\n<li>time and date of the capture,</li>\n<li>camera,</li>\n<li>focal length,</li>\n<li>ISO,</li>\n<li>aperture,</li>\n<li>shutter speed,</li>\n<li>copyright terms,</li>\n<li>author credit.</li>\n</ul>\n<h3>Technical details</h3>\n<h4>Configuring Media Library Assistant for PG</h4>\n<ol>\n<li>Go to &#8220;General tab&#8221;</li>\n<li>Go to the &#8220;Taxonomy Support&#8221; option</li>\n<li>For &#8220;Galleries&#8221;, &#8220;Locations&#8221;, &#8220;Models&#8221;, check all the checkboxes of the line</li>\n<li>Strings are ready to translate</li>\n</ol>\n<h4>Caveats</h4>\n<p>Using native WordPress galleries, Photographers Galleries need to overwrite theme styling, which might still compete with it. Some CSS tuning might be necessary to fix corner-cases.</p>\n",
        "installation": "<p>Install and activate the plugin through the WordPress plugins screen directly. There is no configuration page.</p>\n<p>Don&#8217;t forget to visit the <a href=\"https://photo.aurelienpierre.com/photographers-galleries-demo/\" rel=\"nofollow ugc\">Demo</a>, which presents examples and code to get them.</p>\n<h4>Dynamic gallery</h4>\n<p>This shortcode fetches all the pictures from a taxonomy (galleries, models, locations, tags) to build a dynamic gallery (which will be updated as soon as you add a picture to the corresponding taxonomy). All the display is processed by the regular WordPress shortcode, we just give it the pictures to show (meaning that your default styles, Jetpack, lightboxes etc. will work).</p>\n<ol>\n<li>Create a regular WordPress gallery on the desired page with the desired settings and dumb content</li>\n<li>Switch to the text editor in your post. You should see something like <code>[gallery size=\"full\" link=\"file\" type=\"rectangular\" ids=\"4127,4126\"]</code></li>\n<li>Strip the <code>ids</code> argument and rename the shortcode <code>dynamic_gallery</code> like <code>[dynamic_gallery size=\"full\" link=\"file\" type=\"rectangular\"]</code></li>\n<li>Add the desired taxonomy as an argument, for example <code>gallery=\"portraits\"</code>. You can add several conditions and use any of the galleries wrappers below.</li>\n<li>Tweak it with more arguments.</li>\n</ol>\n<p><strong>Example</strong> : <code>[dynamic_gallery gallery='portraits' location='montreal' size=\"full\" link=\"file\" columns='4']</code></p>\n<p><strong>Arguments</strong> :</p>\n<ul>\n<li>DISPLAY ARGUMENTS <em>optional</em>\n<ul>\n<li>Standard WordPress gallery arguments (See <a href=\"https://codex.wordpress.org/Gallery_Shortcode\" rel=\"nofollow ugc\">the WP Codex</a>):\n<ul>\n<li><code>columns</code></li>\n<li><code>size</code></li>\n<li><code>link</code></li>\n</ul>\n</li>\n<li>Jetpack argument (See <a href=\"https://en.support.wordpress.com/gallery/#adding-a-gallery-or-slideshow\" rel=\"nofollow ugc\">the Jetpack Support</a>) :\n<ul>\n<li><code>type</code></li>\n</ul>\n</li>\n</ul>\n</li>\n<li>CONTENT ARGUMENTS\n<ul>\n<li>Photographers galleries arguments : <em>they are all optional but you have to set at least one of them</em>\n<ul>\n<li><code>gallery</code> : the term (slug) of the gallery whose pictures you want to show</li>\n<li><code>model</code> : idem for the models taxonomy</li>\n<li><code>location</code> : idem for the location taxonomy</li>\n<li><code>tag</code> : idem for tags</li>\n<li><code>author</code> : display only pictures from the selected author. Use the author&#8217;s nicename (the one used to login)</li>\n<li><code>exif</code> : not yet implemented</li>\n</ul>\n</li>\n<li>Standard WordPress query arguments (See <a href=\"https://codex.wordpress.org/Class_Reference/WP_Query#Order_.26_Orderby_Parameters\" rel=\"nofollow ugc\">the WP Codex</a>) :\n<ul>\n<li><code>order</code> : <em>default : ASC</em></li>\n<li><code>orderby</code> : <em>default : date</em></li>\n<li>For these two arguments, you can directly pass any of the allowed values described in the <code>WP_Query</code> documentation.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p>Note that if you give more than one condition, the conditions are added with <code>AND</code>. There is no way to exlude pictures for now.</p>\n<h4>Galleries aligned by their caption</h4>\n<p>By default, pictures of different heights are aligned along their top border. To align them along their bottom border (meaning to have all the captions on the same line), use the <code>[aligncaption]</code> shortcode like this : <code>[aligncaption][gallery ids=\"\"][/aligncaption]</code>. Please be aware that other galleries types may be more suitable if you have different heights on the same gallery (e.g. tiled or masonry galleries), this is just a quick hook to improve captions readability.</p>\n<h4>Galleries without caption</h4>\n<p><strong>Photographers galleries</strong> allows you to display galleries without image captions even if they have one stored in the database. The fact is if you delete or alter the caption of a picture in a WordPress gallery, the media will be altered too in the database and probably elsewhere if you used it on another page, which might be a problem. Here, we will just hide it.</p>\n<p>Put your gallery shortcode in a <code>[nocaption]</code> shortcode like this : <code>[nocaption][gallery ids=\"\"][/nocaption]</code></p>\n<h4>Carousel</h4>\n<p>Just put your regular gallery shortcode in <code>[carousel]</code> shortcode like this : <code>[carousel][gallery ids=\"\" size=\"full\"][/carousel]</code>. Ensure your picture resolution is high enough to fit modern screens without stretching (2048 px on the large side is recommended). Since WordPress 4.4, the size you set does not matter since WP will load all available thumbnails in <code>srcset</code>. However, you need to set something, otherwise WP will default to square cropped thumbnails.</p>\n<p><strong>Example of use</strong> :<br />\n    <code>[carousel w=\"50%\" h=\"66vh\" align=\"left\" caption=\"hide\" title=\"Fancy\"]<br />\n[gallery size=\"large\" link=\"file\" ids=\"\"]<br />\n[/carousel]</code></p>\n<p><strong>Arguments</strong> :</p>\n<ul>\n<li><code>w</code> = width of the carousel box with its unit – default : <code>100%</code>\n<ul>\n<li>px</li>\n<li>percent of the container (<code>%</code>)</li>\n<li>percent of the viewport width (<code>vw</code>)</li>\n</ul>\n</li>\n<li><code>h</code> = height of the pictures with its units – default : <code>calc(100vh - 0.9em - 2ex - 20px)</code>\n<ul>\n<li>px</li>\n<li>percent of the container (<code>%</code>)</li>\n<li>percent of the viewport height (<code>vh</code>)</li>\n<li>a mix of different units with calc() CSS3 function : <code>calc(100vh – 40px – 2ex – 1.1em)</code></li>\n</ul>\n</li>\n<li><code>title</code> = the title to display on the carousel – default : none</li>\n<li><code>caption</code> = the caption style – default : <code>below</code>\n<ul>\n<li><code>below</code></li>\n<li><code>hide</code></li>\n<li><code>hover</code></li>\n</ul>\n</li>\n<li><code>align</code> = the desired alignement on the page – default : <code>none</code>\n<ul>\n<li><code>none</code></li>\n<li><code>left</code> (floating)</li>\n<li><code>right</code> (floating)</li>\n<li><code>center</code></li>\n</ul>\n</li>\n<li><code>raw_css</code> = raw CSS code — default : <code>none</code>\n<ul>\n<li>provide an easy way to quickly add custom CSS to a container</li>\n<li>if you want to style only one specific carousel, use the id <code>pg-carousel-X</code> where <code>X</code> is the order of your carousel on your page (from 1)</li>\n</ul>\n</li>\n</ul>\n<p>Please notice that the height argument sets the actual image height, not the whole carousel height, so don&#8217;t forget to leave some room for the captions (0.9em + 2ex) and the scrolling bar (around 20px).</p>\n<p>Each carousel on the page gets its own ID and settings, meaning that you can use several carousels on the same page with various settings.</p>\n<h4>Exhibitions</h4>\n<p>They work very similarly to carousels : <code>[exhibition][gallery ids=\"\" size=\"full\"][/exhibition]</code>.</p>\n<p><strong>Arguments</strong> :</p>\n<p>All the same as carousels, plus a <code>look</code> argument to choose the styling :</p>\n<ul>\n<li><code>modern</code> : similar to an alu-dibond mounting,</li>\n<li><code>classic</code> : similar to a classical framing with a passe-partout,</li>\n<li><code>box</code>, <code>box-dark</code>, <code>box-bright</code> : similar to a shadow box (called American box in Europe), in 3 shades,</li>\n<li><code>plain</code> : no styling at all,</li>\n<li><code>custom</code>, etc : you can create your own CSS looks by setting <code>look=\"your-name\"</code> in the shortcode, and style the CSS selector <code>.pg-exhibition-wrapper .look-your-name</code>.</li>\n</ul>\n",
        "changelog": "<h4>1.1.8</h4>\n<p>Bugfix : fix alignment of carousel&#8217;s images when captions are insanely long.</p>\n<h4>1.1.6</h4>\n<ul>\n<li>Improve the scroll capture detection when carousels and exhibitions take focus,</li>\n<li>Size the carrousel&#8217;s height accordingly to WP admin bar (if present) and captions,</li>\n<li>Auto-scroll on carousels and exhibitions depending on WP admin bar,</li>\n<li>Add 2 custom Javascript events for developers : <code>PhotoGalleryCaptureScroll</code> and <code>PhotoGalleryReleaseScroll</code>.<br />\nThe first gets fired when carousels and exhibitions take focus and force a scroll to fit them in viewport.<br />\nThe second gets fired when carousels and exhibitions loose focus. These can be listened to show/hide elements.</li>\n</ul>\n<h4>1.1.4</h4>\n<p>Fine-tune the auto-scrolling sensitivity on full-height carousels and exhibitions.</p>\n<h4>1.1.2</h4>\n<p>Make the browser scroll on the full-height carousel and exhibition to center it exactly in the viewport.</p>\n<p>From now on, releases will get even version numbers (x.0, x.2, x.4) and odd numbers will be for development versions (x.1, x.3, x.5).<br />\nThis will help cache and CDN invalidation based on versioning for people testing development versions.</p>\n<p>Happy New Year !</p>\n<h4>1.1.0</h4>\n<p>Minor CSS height rework for carousels.</p>\n<h4>1.0.9</h4>\n<p>Add EXIF metadata display in media view.<br />\nForce WebP thumbnails to quality = 90 because WP default (quality = 75) shows posterization in smooth gradients</p>\n<h4>1.0.8</h4>\n<p>Fix a margin regression in exhibitions</p>\n<h4>1.0.7</h4>\n<p>Improvements of captions:</p>\n<ul>\n<li>Remove unnecessary CSS rules,</li>\n<li>Reduce vertical margins for exhibitions to free more display real estate on mobile,</li>\n<li>Prevent column breaking between image and caption in figure for thumbnails galleries,</li>\n<li>Let captions flow for carousels.</li>\n</ul>\n<h4>1.0.6</h4>\n<p>Improvements for touch and small devices:</p>\n<ul>\n<li>handle swipe gestures and map them to horizontal scrolling,</li>\n<li>make all scroll event listeners passive for better performance,</li>\n<li>enable vertical scrolling on galleries to handle page scrolling,</li>\n<li>reduce margins and resize buttons for better use of mobile devices space,</li>\n<li>force assets enqueuing inside shortcodes for stability, remove one global content regex for performance,</li>\n<li>create responsive cropped square thumbnails to add responsitivity to default WP/themes square thumbs,</li>\n</ul>\n<p>Bugfixes:</p>\n<ul>\n<li>fix improper scaling of square images in exhibitions.</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>Improve Javascript preloading,</li>\n<li>Make <code>src</code> fetching more robust for lazy loading (test for <code>data-orig-src</code> field too),</li>\n<li>Improve exhibitions resetting on <code>window resize</code> event,</li>\n<li>Code cleaning and comments improvements for devs.</li>\n</ul>\n<h4>1.0.3</h4>\n<p>Remove legacy code to display custom media taxinomies on media pages. This feature is now in WordPress core.</p>\n<h4>1.0.2</h4>\n<p>Fix minor CSS issues, improve carousel arrows legibility and make them smaller.</p>\n<h4>1.0.1</h4>\n<p>Fix a potential issue in PHP scripts including</p>\n<h4>1.0</h4>\n<ul>\n<li>Fix Safari issues with picture height in carousels</li>\n<li>Add keyboard, touch swipe and horizontal scroll support in carousels</li>\n<li>Add exhibition mode</li>\n<li>Add thumbnail sizes for common screen resolutions, to fit in <code>scrset</code> of responsive images</li>\n</ul>\n<h4>0.4</h4>\n<ul>\n<li>Add <code>raw_css</code> argument to <code>[carousel]</code> shortcode</li>\n<li>Add EXIF metadata column in media library</li>\n<li>Add the <code>[dynamic_gallery]</code> shortcode to retrieve pictures from taxonomies in a standard WordPress gallery</li>\n<li>Refactor <code>[carousel]</code> shortcode functions and don&#8217;t add custom style on page if deafault settings are used</li>\n<li>Improve comments and docstrings</li>\n</ul>\n<h4>0.3.1</h4>\n<p>Minor default style tweaks</p>\n<h4>0.3</h4>\n<p>Add custom taxonomies, tags, comments and categories to attachments</p>\n<h4>0.2</h4>\n<p>Add some shortcodes</p>\n<h4>0.1</h4>\n<p>Initial version</p>\n"
    },
    "short_description": "Enhance your galleries with HTML5 responsive figure and present them with a  lightweight CSS3 carousel or exhibition mode that fills the gap between a &hellip;",
    "description": "<h4>What ?</h4>\n<p>This is a lightweight plugin to display dynamic or static galleries on posts and pages with minimal overhead and using only native WordPress media.</p>\n<p>Main features:</p>\n<ol>\n<li>enable responsive images sizes (visitors get served the closest image size to their actual display resolution),</li>\n<li>enable custom taxinomies, tags, comments, author, comments for media attachments,</li>\n<li>make images queryable by tags, comments, taxinomies, etc. to display dynamic galleries from a shortcode,</li>\n<li>provide shortcode wrappers for default WordPress galleries to enable advanced layouts (carousel, exhibition, no caption, etc.),</li>\n<li>style default column galleries in a masonry way,</li>\n<li>add EXIF metadata in media admin view,</li>\n<li>fully responsive (height and width),</li>\n<li><strong>provide elegant, minimalist looks that put emphasis on image content first and never crop images to fit in an arbitrary layout.</strong></li>\n</ol>\n<p>The look is inspired by art books and museums exhibitions, meant to allow a flawless and non-intrusive full-screen experience, so you can design your website as a webapp.</p>\n<h4>Why ?</h4>\n<p>Most fancy gallery plugins will add their gallery manager on top of WordPress, which already has one… Then, they will crop images to fit within their fancy layout. Unfortunately, if you are an artist, the way you composed and framed your picture is no accident and should be honored by whatever display system you use. After all that, they will add an awful bloat of jQuery madness that will put a hole in your <a href=\"https://developers.google.com/speed/pagespeed/insights/\" rel=\"nofollow ugc\">Page Speed</a> score and kill your <a href=\"https://tools.pingdom.com/\" rel=\"nofollow ugc\">loading time</a>. Finally, they will distract visitors from your content with all their fancy effects that make your CPU overheat for nothing. Picture-based websites were already heavy, these will make sure to give them the final blow&#8230;</p>\n<p>We need better.</p>\n<h4>How ?</h4>\n<ul>\n<li>Use only built-in browser technologies (CSS, HTML, and native Javascript) to extend browser native features.</li>\n<li>Don&#8217;t use jQuery or additional bloatware lib that slows down page loading, creates compatibility nightmares and may not be hardware-accelerated.</li>\n<li>Load minified JS and CSS, on-demand (only on pages that use them), in footer and with defer support.</li>\n<li>Compatible with caching, minification, CDN and lazy loading (tested with WP Rocket).</li>\n<li>Compatible with lightboxes plugins.</li>\n<li>Only extends core WordPress features, for better security and maintainability.</li>\n</ul>\n<p>The JS weighs only 5.2 kB, and the CSS 7.2 kB.</p>\n<h3>Features</h3>\n<h4>Attachements improvements</h4>\n<p><strong>Photographers galleries</strong> enhances the WordPress attachments from the media library by enabling regular posts properties on them :</p>\n<ul>\n<li>comments,</li>\n<li>author,</li>\n<li>custom fields,</li>\n<li>posts categories,</li>\n<li>posts tags.</li>\n</ul>\n<p>It adds 3 custom taxonomies to the media attachments :</p>\n<ul>\n<li>galleries (which you can use as categories to describe <strong>what</strong> is on the picture),</li>\n<li>locations (<strong>where</strong> is the picture),</li>\n<li>models (<strong>who</strong> is on the picture).</li>\n</ul>\n<p>These taxonomies are hierarchical, meaning that a &#8220;USA&#8221; parent location can have &#8220;Texas&#8221; and &#8220;Nevada&#8221; children locations which can have children themselves.</p>\n<p>Taxonomies and tags make the attachments queryable in archives, just like posts categories, so they allow you to display dynamic galleries either through custom taxonomies template (to add to your theme) or on a page with a shortcode see <a href=\"https://wordpress.org/plugins/photographers-galleries/installation/\" rel=\"ugc\">Installation</a>. Most gallery<br />\nplugins create galleries as custom posts and force you to add your new pictures to all the relevant galleries. PG&#8217;s way allow you to add your pictures to multiple galleries in one step, during its upload in a post editor or in the media library.</p>\n<p>To add taxonomies terms to your pictures during their upload in posts editor, use the plugin <a href=\"https://wordpress.org/plugins/media-library-assistant/\" rel=\"ugc\">Media Library Assistant</a>. It will help you to bulk edit your media library too. See <a href=\"https://wordpress.org/plugins/photographers-galleries/other_notes/\" rel=\"ugc\">Other notes</a> to find how to set MLA.</p>\n<h4>Galleries improvements</h4>\n<p><strong>Photographers galleries</strong> enable the WordPress built-in HTML5 support for pictures and galleries to produce <code>&lt;figure&gt;</code> and <code>&lt;figcaption&gt;</code> tags to increase the SEO and get rid of WordPress default gallery layout (which width is set by the global variable <code>$content_width</code>). They add a fully responsive stylesheet to fit the galleries along the borders of the container.</p>\n<p>It also adds more thumbnails sizes for the responsive <code>srcset</code> HTML attribute of images, allowing browsers to load exactly the right image size for the current viewport size. These sizes go all the way from 240×360px to 4096×2160px, so don&#8217;t be afraid to upload high-resolution images, your visitors will only see the image size relevant for their screen size and pixel density.</p>\n<p>No particular operation is required, just use your regular WordPress gallery builder inside the post editor.</p>\n<h4>Extra layouts &amp; shortcodes wrappers for WordPress galleries</h4>\n<p><strong>Photographers galleries</strong> uses only regular WordPress galleries, called by the <code>[gallery]</code> shortcode, and does not rewrite them. This is intended to ensure maximum compatibility with other plugins (lightboxes, etc.) as well at with future WordPress versions. The extra gallery layouts are provided by extra shortcodes to wrap around the WordPress galleries.</p>\n<p><strong>Note : this makes use of the classic editor gallery, not the Gutenberg block. For what Photographers galleries does, the Gutenberg gallery block adds no benefit over the classic gallery.</strong></p>\n<p>Extra gallery layouts :</p>\n<ul>\n<li>no captions</li>\n<li>caption aligned</li>\n</ul>\n<p>See <a href=\"https://wordpress.org/plugins/photographers-galleries/installation/\" rel=\"ugc\">Installation</a> tab for use instructions.</p>\n<h4>Carousel</h4>\n<p><strong>Photographers galleries</strong> has a fixed-height carousel which takes by default 100 % of the container width and 92 % of the viewport height (99 % if captions are not displayed). It uses the native browser scrolling, supporting horizontal scrolling (touchpad and mouse wheel), swiping gestures (touch screens), click/tap on the next/previous buttons, as well as keyboard arrow keys (left and right).</p>\n<p>The pictures are fitted to the same height so the layout is flawless and continuous, perfect to display a serie or a portfolio. Every carousel instance on a same page can have its own style. This carousel was inspired by <a href=\"https://format.com/themes#horizon\" rel=\"nofollow ugc\">Format</a>.</p>\n<p>See <a href=\"https://wordpress.org/plugins/photographers-galleries/installation/\" rel=\"ugc\">Installation</a> tab for use details.</p>\n<h4>Exhibitions</h4>\n<p>Exhibitions are a new mode of the 1.0 that enables a full-width and full-height experience with a framing look reproducing museum framings. They come in-place of usual lightboxes and gives your pictures maximal impact with minimal clutter, assuming you will use them in a full-width theme template. They support keyboard arrow keys interactions, as well as horizontal scrolling and click/tap on the buttons.</p>\n<p>Exhibitions preload the next and previous images in row while looking at the current one, so the transition between images feels immediate and most lags are prevented.</p>\n<h4>Media library improvements</h4>\n<p><strong>Photographers galleries</strong> adds EXIF metadata of your pictures in the WP library columns :</p>\n<ul>\n<li>time and date of the capture,</li>\n<li>camera,</li>\n<li>focal length,</li>\n<li>ISO,</li>\n<li>aperture,</li>\n<li>shutter speed,</li>\n<li>copyright terms,</li>\n<li>author credit.</li>\n</ul>\n<h3>Technical details</h3>\n<h4>Configuring Media Library Assistant for PG</h4>\n<ol>\n<li>Go to &#8220;General tab&#8221;</li>\n<li>Go to the &#8220;Taxonomy Support&#8221; option</li>\n<li>For &#8220;Galleries&#8221;, &#8220;Locations&#8221;, &#8220;Models&#8221;, check all the checkboxes of the line</li>\n<li>Strings are ready to translate</li>\n</ol>\n<h4>Caveats</h4>\n<p>Using native WordPress galleries, Photographers Galleries need to overwrite theme styling, which might still compete with it. Some CSS tuning might be necessary to fix corner-cases.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/photographers-galleries.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "carousel": "carousel",
        "gallery": "gallery",
        "html5": "HTML5",
        "pictures": "pictures",
        "responsive": "responsive"
    },
    "stable_tag": "trunk",
    "versions": {
        "0.3": "https://downloads.wordpress.org/plugin/photographers-galleries.0.3.zip",
        "0.3.1": "https://downloads.wordpress.org/plugin/photographers-galleries.0.3.1.zip",
        "0.4": "https://downloads.wordpress.org/plugin/photographers-galleries.0.4.zip",
        "0.4.1": "https://downloads.wordpress.org/plugin/photographers-galleries.0.4.1.zip",
        "0.4.2": "https://downloads.wordpress.org/plugin/photographers-galleries.0.4.2.zip",
        "1.0": "https://downloads.wordpress.org/plugin/photographers-galleries.1.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/photographers-galleries.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/photographers-galleries.1.0.2.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/photographers-galleries.1.0.4.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/photographers-galleries.1.0.6.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/photographers-galleries.1.0.7.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/photographers-galleries.1.0.8.zip",
        "1.0.9": "https://downloads.wordpress.org/plugin/photographers-galleries.1.0.9.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/photographers-galleries.1.1.0.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.paypal.me/aurelienpierre/",
    "banners": {
        "low": "https://ps.w.org/photographers-galleries/assets/banner-772x250.png?rev=1403699",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/photographers-galleries/assets/icon-256x256.png?rev=1403718",
        "2x": "https://ps.w.org/photographers-galleries/assets/icon-256x256.png?rev=1403718"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}