{
    "name": "Pix por Piggly (para Woocommerce)",
    "slug": "pix-por-piggly",
    "version": "2.1.2",
    "author": "<a href=\"https://studio.piggly.com.br/\">Piggly Lab</a>",
    "author_profile": "https://profiles.wordpress.org/pigglydev/",
    "contributors": {
        "pigglydev": {
            "profile": "https://profiles.wordpress.org/pigglydev/",
            "avatar": "https://secure.gravatar.com/avatar/de3508e00bdf34251cd734fe7b61d97e?s=96&d=monsterid&r=g",
            "display_name": "Piggly Dev"
        },
        "caiquearaujo": {
            "profile": "https://profiles.wordpress.org/caiquearaujo/",
            "avatar": "https://secure.gravatar.com/avatar/c4f693ccab1c494763a4f0ffe5d6cb57?s=96&d=monsterid&r=g",
            "display_name": "caiquearaujo"
        }
    },
    "requires": "6.0",
    "tested": "6.5.5",
    "requires_php": "8.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 90,
    "ratings": {
        "5": 60,
        "4": 1,
        "3": 2,
        "2": 3,
        "1": 6
    },
    "num_ratings": 72,
    "support_url": "https://wordpress.org/support/plugin/pix-por-piggly/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 7000,
    "downloaded": 92414,
    "last_updated": "2024-06-23 3:06pm GMT",
    "added": "2020-12-18",
    "homepage": "https://studio.piggly.com.br/",
    "sections": {
        "changelog": "<h4>2.1.2</h4>\n<ul>\n<li>Suporte a metabox e flag de pagamento Pix nos pedidos para WooCommerce 8.4+.</li>\n</ul>\n<h4>2.1.1</h4>\n<ul>\n<li>Corrigido os problemas de envio do comprovante.</li>\n</ul>\n<h4>2.1.0</h4>\n<ul>\n<li>Suporte ao PHP 8.0;</li>\n<li>Correção de bugs;</li>\n<li>Suporte ao WooCommerce Checkout Blocks.</li>\n</ul>\n<h4>2.0.28</h4>\n<ul>\n<li>Correções do WordPress.</li>\n</ul>\n<h4>2.0.27</h4>\n<ul>\n<li>Correções do WordPress.</li>\n</ul>\n<h4>2.0.26</h4>\n<ul>\n<li>Correção de problema na atualização de configuração do Pix.</li>\n</ul>\n<h4>2.0.25</h4>\n<ul>\n<li>Adição do menu &#8220;Processamento do Pix&#8221; para maior controle da cronjob e do processamento imediato do Pix.</li>\n<li>Novos avisos adicionados e nomenclatura dos Pix alterada.</li>\n</ul>\n<h4>2.0.24</h4>\n<ul>\n<li>Pequenas correções.</li>\n</ul>\n<h4>2.0.23</h4>\n<ul>\n<li>Pequenas correções;</li>\n<li>Prevenção de cancelamento automático.</li>\n</ul>\n<h4>2.0.22</h4>\n<ul>\n<li>Limpeza dos logs;</li>\n<li>Alerta de Modo Debug ativo;</li>\n<li>Filtragem básica dos Pix criados.</li>\n</ul>\n<h4>2.0.21</h4>\n<ul>\n<li>Bug na atualização do Pix.</li>\n</ul>\n<h4>2.0.20</h4>\n<ul>\n<li>Melhorias nas mensagens de retorno de erro e sucesso;</li>\n<li>Desabilitação da limpeza automática;</li>\n<li>Atualização automática do Pix com botão &#8220;Já realizei o pagamento&#8221; para APIs do Pix.</li>\n</ul>\n<h4>2.0.19</h4>\n<ul>\n<li>Correção de permissão de logs durante execução da cronjob;</li>\n<li>Correção na data de atualização do Pix;</li>\n<li>Correção no envio de notificação de Pix próximo a expiração;</li>\n<li>Remoção do Pix ao remover o pedido;</li>\n<li>Atualização automática para a página de pedido concluído, quando em uso da API do Pix;</li>\n<li>Correção da atualização da Cron Job para executar a cada minuto;</li>\n<li>Ação para executar os webhooks da API do Pix;</li>\n<li>Exibição do e2eid identificando o pagamento do Pix, quando em uso da API do Pix;</li>\n<li>Rotina para limpeza dos Pix expirados ou cancelados;</li>\n<li>Reorganização do menu Pix por Piggly.</li>\n</ul>\n<h4>2.0.18</h4>\n<ul>\n<li>Correção da detecção de Pix próximo à expiração;</li>\n<li>Habilitação da API do Woocommerce para pedidos Pix;</li>\n<li>Melhoria nos logs de debug para identificar envio dos e-mails.</li>\n</ul>\n<h4>2.0.17</h4>\n<ul>\n<li>Correção nos modelos de e-mails;</li>\n</ul>\n<h4>2.0.16</h4>\n<ul>\n<li>E-mail quando o Pix for criado;</li>\n<li>Exibição da data de expiração no template de pagamento;</li>\n<li>Melhorias na interface de configuração;</li>\n<li>Melhorias de comunicação nas páginas do plugin.</li>\n</ul>\n<h4>2.0.15</h4>\n<ul>\n<li>Correção de bug na metabox do pedido.</li>\n</ul>\n<h4>2.0.14</h4>\n<ul>\n<li>Personalização do destinatário dos e-mails administrativos;</li>\n<li>Correção no ícone do Pix;</li>\n<li>Opção para cancelar o pedido quando o Pix expirar;</li>\n<li>Recriação da cronjob ao atualizar.</li>\n</ul>\n<h4>2.0.12/2.0.13</h4>\n<ul>\n<li>Correção de bugs nas configurações do plugin;</li>\n<li>Adição da personalização do status de aguardando o pagamento.</li>\n</ul>\n<h4>2.0.11</h4>\n<ul>\n<li>Opção para reduzir o estoque do pedido assim que o Pix é criado;</li>\n<li>Posição dos links de comprovante;</li>\n<li>Estoque reduzido assim que o comprovante Pix é enviado;</li>\n<li>Opção de ocultar valor do Pix antes dos dados Pix.</li>\n</ul>\n<h4>2.0.9/2.0.10</h4>\n<ul>\n<li>Micro-correções.</li>\n</ul>\n<h4>2.0.8</h4>\n<ul>\n<li>Correção no banco de dados.</li>\n</ul>\n<h4>2.0.7</h4>\n<ul>\n<li>Correção no banco de dados.</li>\n<li>Notificação sobre atualização dos Links permanentes.</li>\n</ul>\n<h4>2.0.6</h4>\n<ul>\n<li>Correção para salvar informações de desconto Pix.</li>\n</ul>\n<h4>2.0.4/2.0.5</h4>\n<ul>\n<li>Correção no banco de dados.</li>\n</ul>\n<h4>2.0.3</h4>\n<ul>\n<li>Correção para aceitar a ausência de banco no Pix.</li>\n</ul>\n<h4>2.0.2</h4>\n<ul>\n<li>Notifica sobre atualização dos endpoints.</li>\n</ul>\n<h4>2.0.1</h4>\n<ul>\n<li>Micro correções.</li>\n</ul>\n<h4>2.0.0</h4>\n<ul>\n<li>Novo release com mudanças substanciais no núcleo do plugin.</li>\n</ul>\n<h4>1.3.14</h4>\n<ul>\n<li>Bug no shortcode <code>[pix-por-piggly]</code> que não retorna o template;</li>\n<li>Bug no desconto de pagamento e valor corrigido quando há cupom de desconto aplicado;</li>\n<li>Liberação da tela para APIs;</li>\n<li>Acionamento de actions e filters.</li>\n</ul>\n<h4>1.3.13</h4>\n<ul>\n<li>Aumento de segurança na validação dos arquivos enviados como comprovantes;</li>\n<li>Correção de bug na página de &#8220;Comprovantes Pix&#8221;;</li>\n<li>Outras melhorias e correções.</li>\n</ul>\n<h4>1.3.12</h4>\n<ul>\n<li>Pequenas correções e melhorias.</li>\n</ul>\n<h4>1.3.11</h4>\n<ul>\n<li>Correção de exibição duplicada dos shortcodes;</li>\n<li>Melhorias no sistema de upload dos comprovantes;</li>\n<li>Redirecionamento após comprovante recebido com sucesso;</li>\n<li>Outras correções e melhorias.</li>\n</ul>\n<h4>1.3.10</h4>\n<ul>\n<li>Validação dos arquivos .htaccess;</li>\n<li>Correção de problemas com valores Pix.</li>\n</ul>\n<h4>1.3.9</h4>\n<ul>\n<li>Bug na exibição do desconto no HTML;</li>\n<li>Formato numérico corrigido na página de pagamento via Pix.</li>\n</ul>\n<h4>1.3.8</h4>\n<ul>\n<li>Gestão eficiente e otimizada dos comprovantes Pix para exclusão e busca de comprovantes.</li>\n</ul>\n<h4>1.3.7</h4>\n<ul>\n<li>Correção no arquivo <code>.htaccess</code> que gera um erro 403 ao acessar os comprovantes.</li>\n</ul>\n<h4>1.3.6</h4>\n<ul>\n<li>Descrição avançada com Pix com passos para pagamento.</li>\n</ul>\n<h4>1.3.5</h4>\n<ul>\n<li>Escolher cor do ícone para o Pix;</li>\n<li>Ocultar o status &#8220;Comprovante Pix Recebido&#8221; no painel de pedidos;</li>\n<li>Correções e melhorias indicadas no suporte.</li>\n</ul>\n<h4>1.3.4</h4>\n<ul>\n<li>Correção do bug para a primeira instalação do plugin, retornando valores vazios.</li>\n</ul>\n<h4>1.3.3</h4>\n<ul>\n<li>A mudança do status para &#8220;Comprovante Pix Recebido&#8221; tornou-se opcional.</li>\n</ul>\n<h4>1.3.2</h4>\n<ul>\n<li>Correção para ocultar o botão &#8220;Enviar Comprovante&#8221;.</li>\n</ul>\n<h4>1.3.1</h4>\n<ul>\n<li>Correção do erro fatal no método remove_qr_image.</li>\n</ul>\n<h4>1.3.0</h4>\n<ul>\n<li>Suporte a formulário nativo para envio dos comprovantes;</li>\n<li>Melhorias no shortcode [pix-por-piggly];</li>\n<li>Melhorias e correções em gerais.</li>\n</ul>\n<h4>1.2.4</h4>\n<ul>\n<li>Atualização dos paineis de configuração;</li>\n<li>Melhoria na criação dos arquivos de QR Code contra erros de cachê;</li>\n<li>Suporte a API do Woocommerce;</li>\n<li>Correção da leitura de telefones internacionais no campo de Telefone do Whatsapp.</li>\n</ul>\n<h4>1.2.3</h4>\n<ul>\n<li>Corrige avisos do PHP e permite o ID da transação vazio como <code>***</code>.</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>Correção da ausência do botão em Teste seu Pix.</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Auto corrige automaticamente os campos do dados Pix baseado no Banco selecionado.</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Reformulação das configurações;</li>\n<li>Criação da metabox Pix nos pedidos pagos via Pix;</li>\n<li>Otimização da geração dos QR Codes;</li>\n<li>Desconto automático para pagamento via Pix.</li>\n</ul>\n<h4>1.1.14</h4>\n<ul>\n<li>Dicas de apoio para preenchimento do Pix;</li>\n<li>Correções dos botões Whatsapp e Telegram no e-mail;</li>\n<li>Link para ver o pedido no e-mail ao invés do link para pagamento;</li>\n<li>Correções ao salvar configurações;</li>\n<li>Adição do caminho para sobrescrever os templates.</li>\n</ul>\n<h4>1.1.13</h4>\n<ul>\n<li>Adição do botão de configuração e ajustes na importação;</li>\n</ul>\n<h4>1.1.12</h4>\n<ul>\n<li>Correções de bugs;</li>\n</ul>\n<h4>1.1.11</h4>\n<ul>\n<li>Melhorias no texto de apoio e captura de erros com textos de apoio;</li>\n</ul>\n<h4>1.1.10</h4>\n<ul>\n<li>Correção de bug no envio de e-mail;</li>\n</ul>\n<h4>1.1.9</h4>\n<ul>\n<li>Correção de bugs para versões 7.3- do PHP;</li>\n</ul>\n<h4>1.1.8</h4>\n<ul>\n<li>Correção de bugs, melhorias da documentação, controle de erros e inserção nas instruções via e-mail;</li>\n</ul>\n<h4>1.1.7</h4>\n<ul>\n<li>Correções e melhorias;</li>\n</ul>\n<h4>1.1.6</h4>\n<ul>\n<li>Correção do bug no campo Whatsapp, correção dos bugs com chaves vazias, controladores de e-mail e status;</li>\n</ul>\n<h4>1.1.5</h4>\n<ul>\n<li>Atualização da formatação do campo <strong>Identificador</strong>;</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Botões para Whatsapp e Telegram, além de melhorias no layout;</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Suporte para o PHP 7.2 (conforme solicitado por muitos utilizadores);</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Atualização da biblioteca <code>piggly/php-pix</code> e do painel de configurações;</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Atualização da biblioteca <code>piggly/php-pix</code>;</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Correções de bugs;</li>\n<li>Melhorias na exibição do Pix no e-mail e na tela;</li>\n<li>Ajuste de visualizações com base nas opções selecionadas;</li>\n<li>Melhorias no núcleo do plugin;</li>\n</ul>\n<h4>1.0.3/1.0.4</h4>\n<ul>\n<li>Correções de bugs e reposicionamento das descrições;</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Melhorias no design das informações de pagamento;</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Melhorias no design das informações de pagamento;</li>\n<li>Correções de pequenos bugs;</li>\n<li>Inclusão para encaminhar até a página para upload de arquivos;</li>\n<li>Inclusão da página &#8220;Teste seu Pix&#8221;.</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Versão inicial do plugin.</li>\n</ul>\n",
        "description": "<h3>Pix por Piggly v2.1.2</h3>\n<blockquote>\n<p>Compatível com WooCommerce Blocks e PHP 8.0+.</p>\n</blockquote>\n<p>O melhor plugin para pagamentos via Pix no Woocommerce. Na versão 2.0.0 o plugin está melhor mais dinâmico e muito mais responsivo. Veja mais detalhes.</p>\n<p><strong>Sempre atualize para continuar aproveitando</strong></p>\n<p>O <strong>Pix</strong> é o mais novo método de pagamento eletrônico criado pelo Banco Central do Brasil. Você encontra todos os detalhes na <a href=\"https://www.bcb.gov.br/estabilidadefinanceira/pix\" rel=\"nofollow ugc\">página oficial</a> do Pix.</p>\n<p>O plugin é permitir que você utilize o método de pagamento Pix em sua loja <strong>Woocommerce</strong> sem qualquer custo de forma simples, rápida e direta. Acesse as configurações do plugin em <code>Pix por Piggly</code> no menu lateral.</p>\n<blockquote>\n<p>Se você apreciar a função deste plugin e quiser apoiar este trabalho, sinta-se livre para fazer qualquer doação para a chave aleatória Pix <code>aae2196f-5f93-46e4-89e6-73bf4138427b</code> ❤.</p>\n<p>Não esqueça de deixar a sua avaliação sobre o plugin! Isso nos incentivará a lançar mais atualizações e continuar prestando um suporte de qualidade.</p>\n</blockquote>\n<h3>Recursos que só o Pix por Piggly tem</h3>\n<ul>\n<li>✅ Tratamento automático de dados, não se preocupe com o que você digita. O plugin automaticamente detecta melhorias;</li>\n<li>✅ Permita que o cliente envie o comprovante por uma página segura, pelo Whatsapp e/ou Telegram;</li>\n<li>✅ Atualize automaticamente o pedido quando um comprovante for enviado;</li>\n<li>✅ Defina uma data de expiração de pagamento do Pix;</li>\n<li>✅ Envio de e-mails para os eventos: quando o Pix estiver próximo de expirar, quando o Pix expirar, quando o Pix for pago e quando o Pix for criado para pagamento;</li>\n<li>✅ Teste o seu Pix a qualquer hora, antes mesmo de habilitar o plugin;</li>\n<li>✅ Aplique desconto automático, sem criação de cupons, ao realizar o pagamento via Pix;</li>\n<li>✅ Visualize os dados do Pix gerado na página do pedido;</li>\n<li>✅ Importe os dados Pix de uma chave Pix válida e preencha os dados da Conta Pix automaticamente;</li>\n<li>✅ Utilize <strong>Merge Tags</strong>, em campos disponíveis, para substituir variáveis e customizar ainda mais as funções do plugin;</li>\n<li>✅ Páginas dedicadas para o pagamento do Pix e envio de comprovantes, que podem ser acessados via “Minha Conta”;</li>\n<li>✅ Suporte a API do Woocommerce.</li>\n</ul>\n<h3>Versão `2.0.0`</h3>\n<p>Na versão <strong>2.0.0</strong> promovemos várias mudanças no formato no plugin, tanto para facilitar quando para deixar o fluxo de pagamento mais simples e dinâmico. Algumas opções foram removidas, enquanto outras foram mantidas. Leia abaixo em detalhes tudo que está diferente.</p>\n<h4>E-mails</h4>\n<h4>👎 Antes</h4>\n<p>👉 Era possível escolher o modelo de e-mail na qual o pagamento Pix seria anexado e, ainda, escolher a posição deste pagamento.</p>\n<h4>❌ Por que mudamos?</h4>\n<p>Muitos relatavam conflitos e dificuldades para gerenciar o conteúdo do e-mail, enquanto outros utilizavam plugins desatualizados que quebravam os e-mails. Isso acontecia, pois dependiamos de uma <code>action</code> localizada no modelo de e-mail selecionado para carregar os dados do Pix.</p>\n<h4>👍 Agora</h4>\n<p>👉 Criamos diversos modelos de e-mails, entre eles: quando o Pix estiver próximo de expirar, quando o Pix expirar, quando o Pix for pago e quando o Pix for criado para pagamento.</p>\n<p>👉 Não anexamos mais as informações do Pix no e-mail para evitar <strong>SPAM</strong> e compartilhamento desnecessário dos dados. Criamos um link único para o cliente acessar e visualizar todos os dados de pagamento novamente.</p>\n<h4>Comprovantes</h4>\n<p>👎 Antes =</p>\n<p>👉 Era possível selecionar uma página para enviar o comprovante e utilizar qualquer formulário desejado. Também era possível utilizar o shortcode <code>[pix-por-piggly-form]</code> para utilizar o recurso nativo do plugin para recebimento de comprovantes.</p>\n<h4>❌ Por que mudamos?</h4>\n<p>Alguns clientes enviavam de forma errada ou a forma como o shortcode <code>[pix-por-piggly-form]</code> era utilizado prejudicava a experiência criando diversos comprovantes desnecessários e produzindo muito lixo na pasta de uploads.</p>\n<h4>👍 Agora</h4>\n<p>👉 Será utilizado um link permanente exclusivo para que o usuário faça o envio do comprovante Pix, garantindo todas as validações necessárias para que o usuário envie sempre para o pedido correto.</p>\n<p>👉 O comprovante enviado será automaticamente associado ao Pix relacionado ao pedido e sempre será considerado o último comprovante enviado.</p>\n<h4>Pedidos</h4>\n<h4>👎 Antes</h4>\n<p>👉 Ao selecionar o Pix, o pedido automaticamente migrava o status para <code>Aguardando o Pagamento</code>, também era possível utilizar o status <code>Comprovante Pix Recebido</code> quando o comprovante era enviado.</p>\n<h4>❌ Por que mudamos?</h4>\n<p>Alguns usuários acharam o status <code>Comprovante Pix Recebido</code> muito complicado e tinham rotinas que impediam o uso.</p>\n<p>Migrar para o status <code>Aguardando o Pagamento</code> também não é mais uma opção, uma vez que os Pix podem ser confirmados tanto por API quanto por comprovantes.</p>\n<h4>👍 Agora</h4>\n<p>👉 Agora, por padrõa, o pedido ficará como <code>Pendente</code> atéq ue o cliente envie o comprovante ou que uma API Pix atualize o Pix como pago.</p>\n<p>👉 Quando o cliente enviar um comprovante, o status é migrado para sair da situação como <code>Pendente</code>.</p>\n<p>👉 Também foi adicionado um recurso para atualizar automaticamente o status do pedido para <code>Pago</code> quando o Pix for pago.</p>\n<p>👉 Tanto o status para Comprovante Enviado quanto para Pedido Pago podem ser configurados. <strong>Não recomendamos que o Comprovante Enviado marque o pedido como pago&#8230;</strong></p>\n<h4>Endpoints</h4>\n<h4>👍 Agora</h4>\n<p>👉 Foram criados dois endpoints exclusivos dentro do ambiente &#8220;Minha Conta&#8221; do Woocommerce. Um para o realizar o pagamento pendente do Pix e outro para enviar o comprovante de pagamento.</p>\n<p>👉 Os endpoints podem ser acessados a qualquer momento desde que o cliente tenha autorização e eles estejam liberados para acesso.</p>\n<h4>Templates</h4>\n<h4>👍 Agora</h4>\n<p>👉 Atualizamos todos os templates, será necessário revisá-los para que eles funcionem corretamente caso você tenha realizado alguma personalização.</p>\n<h4>Filtros e Ações</h4>\n<p>A partir da versão <strong>2.0.0</strong> é possível utilizar os filtros e as ações abaixo:</p>\n<h4>👍 Filtros</h4>\n<ul>\n<li><code>pgly_wc_piggly_pix_discount_applied</code> Personaliza o valor calculado para o desconto antes de aplicar;</li>\n<li><code>pgly_wc_piggly_pix_payload</code> Personaliza ou altera o objeto Payload do Pix antes de gerar o código;</li>\n<li><code>pgly_wc_piggly_pix_pending_status</code> Personaliza o status de <code>pending</code> ao criar um pedido com pagamento Pix;</li>\n<li><code>pgly_wc_piggly_pix_process</code> Personaliza o objeto <code>PixEntity</code> antes de processar o Pix.</li>\n</ul>\n<h4>👍 Ações</h4>\n<ul>\n<li><code>pgly_wc_piggly_pix_webhook</code> Executa o webhook do Pix;</li>\n<li><code>pgly_wc_piggly_pix_to_pay</code> Logo após o Pix ser criado e associado ao pedido;</li>\n<li><code>pgly_wc_piggly_pix_after_save_receipt</code> Logo após criar (e salvar) o comprovante do Pix;</li>\n<li><code>pgly_wc_piggly_pix_close_to_expires</code> Quando o Pix está próximo da expiração.</li>\n</ul>\n<h4>Principais melhorias</h4>\n<ul>\n<li>✅ Alteração da cor do ícone do Pix;</li>\n<li>✅ Formulário integrado para envio de comprovante;</li>\n<li>✅ (Opcional) Atualização automática do pedido com comprovante recebido;</li>\n<li>✅ Desconto automático para pagamento via Pix.</li>\n<li>✅ Reformulação das configurações;</li>\n<li>✅ Criação da metabox Pix nos pedidos pagos via Pix;</li>\n<li>✅ Otimização para geração dos QR Codes;</li>\n<li>✅ Desconto automático para pagamento via Pix.</li>\n</ul>\n<h3>Performance</h3>\n<p>Toda a estrutura e código do plugin foram atualizados para garantir a melhor performance, agora todos os dados de um Pix criado são salvos em uma tabela de dados que evita a recriação do Pix. Os QR Codes e os comprovantes também são associados ao Pix que permite um único arquivo de cada, mantendo a biblioteca de uploads sempre limpa.</p>\n<h3>Como funciona?</h3>\n<p>Assim como é feito atualmente com uma transferência eletrônica no Woocommerce, o <strong>Pix por Piggly</strong> permite aos consumidores escolherem o método de pagamento Pix, então eles recebem as instruções de pagamento e enviam o comprovante. Você também pode aplicar um desconto automático para pagamentos via Pix.</p>\n<p>Bem simples né?</p>\n<p>Para permitir isso, nosso plugin segue todas as propostas do padrão EMV®1, implementado pelo Banco Central do Brasil, você pode ler mais sobre isso em <a href=\"https://www.bcb.gov.br/content/estabilidadefinanceira/forumpireunioes/Anexo%20I%20-%20QRCodes%20-%20Especifica%C3%A7%C3%A3o%20-%20vers%C3%A3o%201-1.pdf\" rel=\"nofollow ugc\">Especificações Técnicas</a>. Utilizamos a nossa bibliteca <a href=\"https://github.com/piggly-dev/php-pix\" rel=\"nofollow ugc\">piggly/php-pix</a> para manipular e gerar os códigos pix.</p>\n<p>Dessa forma, nosso plugin gera os três principais métodos de pagamento Pix:</p>\n<ol>\n<li>Um <strong>QR Code</strong> com o código Pix;</li>\n<li>O código Pix em formato de texto para utilização da função <strong>Pix Copia &amp; Cola</strong>;</li>\n<li>Pagamento manual com os dados Pix fornecidos.</li>\n</ol>\n<p>Nosso plugin gera de forma automática o código Pix com base nas informações do Pedido e nas informações preenchidas na configuração do plugin.</p>\n<blockquote>\n<p>Não importa como você digita a chave Pix, ela será automaticamente convertida para os formatos apropriados, okay? Caso ela esteja inválida, de acordo com o formato escolhido, você será notificado.</p>\n</blockquote>\n<h3>Testes realizados</h3>\n<p>O código Pix gerado por esse plugin, incluindo a função <strong>QR Code</strong> e <strong>Pix Copia &amp; Cola</strong>, foi testado nos seguintes aplicativos de banco:</p>\n<ul>\n<li>Banco do Brasil;</li>\n<li>Banco Inter;</li>\n<li>BMG;</li>\n<li>Bradesco;</li>\n<li>C6;</li>\n<li>Itaú;</li>\n<li>Mercado Pago;</li>\n<li>Nubank;</li>\n<li>PagPank;</li>\n<li>Santander.</li>\n</ul>\n<p>Como o código utiliza o padrão do Pix é possível que funcione em todos os bancos. Mas, caso encontre problemas ou dificuldades não hesite em abrir uma <a href=\"https://wordpress.org/support/plugin/pix-por-piggly/\" rel=\"ugc\">thread</a> no Suporte do Plugin ou enviar um e-mail para <strong><a href=\"mailto:&#100;&#101;&#118;&#064;&#112;&#105;&#x67;&#x67;&#x6c;&#x79;&#x2e;&#x63;&#x6f;&#x6d;&#x2e;&#x62;&#x72;\" rel=\"nofollow ugc\">dev@piggly.com.br</a></strong>.</p>\n<h3>Perguntas Frequentes</h3>\n<h4>Qual é a licença do plugin?</h4>\n<p>Este plugin esta licenciado como GPLv2. Ele é distrubuido de forma gratuita.</p>\n<h4>O que eu preciso para utilizar este plugin?</h4>\n<ul>\n<li>Ter instalado o WordPress 4.0 ou superior;</li>\n<li>Ter instalado o plugin WooCommerce 3.0 ou superior;</li>\n<li>Utilizar a versão 7.2 do PHP;</li>\n<li>Ter a extensão <code>gd</code> para PHP habilitada, veja detalhes <a href=\"https://www.php.net/manual/pt_BR/book.image.php\" rel=\"nofollow ugc\">aqui</a>;</li>\n<li>Possuir uma conta bancária com Chave Pix.</li>\n</ul>\n<h4>Posso utilizar com outros gateways de pagamento?</h4>\n<p>Sim, esse plugin funciona apenas como um método de pagamento adicional, assim como acontece com o método de transferência eletrônica.</p>\n<h4>Como aplicar desconto automático?</h4>\n<p>Na página de configurações do Plugin, acesse <strong>Pedidos</strong> e insira um valor e um rótulo para o desconto Pix. O desconto será automaticamente aplicado quando o cliente escolher o método de pagamento Pix.</p>\n<h4>Como conferir o pagamento Pix?</h4>\n<p>A conferência do Pix ainda é manual, assim como acontece em uma transferência eletrônica. Para facilitar, o plugin gera os Pix com um código identificador. Esse código possuí um valor estático de 25 caracteres.</p>\n<p>Abra o pedido criado no Woocommerce e verifique o código identificador do Pix, ao abrir o aplicativo do seu banco, você poderá ver detalhes sobre o recebimento Pix e, na maioria dos bancos, o pagamento estará identificado com o código identificador do Pix.</p>\n<p>= Não tem como atualizar o pagamento Pix automaticamente?</p>\n<p>Para validar se um Pix foi pago a maioria dos bancos emissores irão cobrar taxas, assim como os intermediadores de pagamento. Se você faz parte de um banco emissor que já implementa a API Pix, pode entrar em contato com a gente em <a href=\"mailto:&#100;&#101;&#118;&#064;&#112;&#105;&#x67;&#x67;&#x6c;&#x79;&#x2e;&#x63;&#x6f;&#x6d;&#x2e;&#x62;&#x72;\" rel=\"nofollow ugc\">dev@piggly.com.br</a> para que possamos implementar a solução.</p>\n<h4>Gerei o código Pix, mas não consigo efetuar o pagamento. E agora?</h4>\n<p>Nas configurações do Plugin acesse &#8220;Suporte&#8221; e verifique a seção &#8220;O plugin gera o QR Code, mas não consigo pagá-lo&#8221;, lá estarão algumas dicas automáticas que podem ajudar você. Se ainda sim precisar de algum suporte, abra um chamado enviando um e-mail para <a href=\"mailto:&#100;&#101;&#118;&#064;&#112;&#105;&#x67;&#x67;&#x6c;&#x79;&#x2e;&#x63;&#x6f;&#x6d;&#x2e;&#x62;&#x72;\" rel=\"nofollow ugc\">dev@piggly.com.br</a>.</p>\n<h4>Como customizar os templates?</h4>\n<p>Nas configurações do Plugin acesse &#8220;Suporte&#8221; e verifique a seção &#8220;Como substituir os templates de e-mail e da página de obrigado&#8221;.</p>\n<blockquote>\n<p><strong>AVISO</strong>: Ao customizar os templates você pode perder funcionalidades importantes do plugin e comportamentos pré-existentes nos templates originais. Tenha certeza sobre o que está fazendo para garantir que tudo funcione como deve ser. <strong>Não prestaremos suporte para customizações</strong>.</p>\n</blockquote>\n<h3>Como instalar?</h3>\n<h4>No diretório oficial do WordPress</h4>\n<p>A página oficial do plugin pode ser encontrada em: <a href=\"https://wordpress.org/plugins/pix-por-piggly/\" rel=\"ugc\">wordpress@pix-por-piggly</a>.</p>\n<h4>No repositório do Github</h4>\n<p>Vá para <a href=\"https://github.com/piggly-dev/piggly-views-wordpress/releases\" rel=\"nofollow ugc\">Releases</a> neste repositório e faça o download em <code>.zip</code> da versão mais recente.</p>\n<p>Então, no <strong>Painel Administrativo</strong> do WordPress, vá em <code>Plugins &gt; Adicionar novo</code> e clique em <code>Upload plugin</code> no topo da página para enviar o arquivo <code>.zip</code>.</p>\n<blockquote>\n<p>Você precisará, posteriormente, ir até a pasta do plugin no terminal do seu servidor Web e executar o comando <code>composer install</code> caso escolha essa opção.</p>\n</blockquote>\n<h4>Da origem</h4>\n<p>Você precisará do Git instalado para contruir da origem. Para completar os passos a seguir, você precisará abrir um terminal de comando. Clone o repositório:</p>\n<pre><code>git clone https://github.com/piggly-dev/wc-piggly-pix.git\n</code></pre>\n<blockquote>\n<p>Você precisará, posteriormente, executar o comando <code>composer install</code> caso escolha essa opção.</p>\n</blockquote>\n<h3>Como utilizar?</h3>\n<p>Após a instalação do plugin, vá até <code>Plugins &gt; Plugins instalados</code>, ative o plugin <strong>Pix por Piggly para Woocommerce</strong>. Assim que você ativar, o plugin já estará disponível em <code>Woocommerce &gt; Configurações &gt; Pagamentos</code> e você poderá inserir todas as configurações pertinentes.</p>\n<p><strong>Preencha corretamente a sua chave Pix. Você pode testar nas configurações do plugin o funcionamento do Pix mesmo que o módulo esteja desativado.</strong></p>\n"
    },
    "short_description": "Pix por Piggly v2.1.2",
    "description": "<h3>Pix por Piggly v2.1.2</h3>\n<blockquote>\n<p>Compatível com WooCommerce Blocks e PHP 8.0+.</p>\n</blockquote>\n<p>O melhor plugin para pagamentos via Pix no Woocommerce. Na versão 2.0.0 o plugin está melhor mais dinâmico e muito mais responsivo. Veja mais detalhes.</p>\n<p><strong>Sempre atualize para continuar aproveitando</strong></p>\n<p>O <strong>Pix</strong> é o mais novo método de pagamento eletrônico criado pelo Banco Central do Brasil. Você encontra todos os detalhes na <a href=\"https://www.bcb.gov.br/estabilidadefinanceira/pix\" rel=\"nofollow ugc\">página oficial</a> do Pix.</p>\n<p>O plugin é permitir que você utilize o método de pagamento Pix em sua loja <strong>Woocommerce</strong> sem qualquer custo de forma simples, rápida e direta. Acesse as configurações do plugin em <code>Pix por Piggly</code> no menu lateral.</p>\n<blockquote>\n<p>Se você apreciar a função deste plugin e quiser apoiar este trabalho, sinta-se livre para fazer qualquer doação para a chave aleatória Pix <code>aae2196f-5f93-46e4-89e6-73bf4138427b</code> ❤.</p>\n<p>Não esqueça de deixar a sua avaliação sobre o plugin! Isso nos incentivará a lançar mais atualizações e continuar prestando um suporte de qualidade.</p>\n</blockquote>\n<h3>Recursos que só o Pix por Piggly tem</h3>\n<ul>\n<li>✅ Tratamento automático de dados, não se preocupe com o que você digita. O plugin automaticamente detecta melhorias;</li>\n<li>✅ Permita que o cliente envie o comprovante por uma página segura, pelo Whatsapp e/ou Telegram;</li>\n<li>✅ Atualize automaticamente o pedido quando um comprovante for enviado;</li>\n<li>✅ Defina uma data de expiração de pagamento do Pix;</li>\n<li>✅ Envio de e-mails para os eventos: quando o Pix estiver próximo de expirar, quando o Pix expirar, quando o Pix for pago e quando o Pix for criado para pagamento;</li>\n<li>✅ Teste o seu Pix a qualquer hora, antes mesmo de habilitar o plugin;</li>\n<li>✅ Aplique desconto automático, sem criação de cupons, ao realizar o pagamento via Pix;</li>\n<li>✅ Visualize os dados do Pix gerado na página do pedido;</li>\n<li>✅ Importe os dados Pix de uma chave Pix válida e preencha os dados da Conta Pix automaticamente;</li>\n<li>✅ Utilize <strong>Merge Tags</strong>, em campos disponíveis, para substituir variáveis e customizar ainda mais as funções do plugin;</li>\n<li>✅ Páginas dedicadas para o pagamento do Pix e envio de comprovantes, que podem ser acessados via “Minha Conta”;</li>\n<li>✅ Suporte a API do Woocommerce.</li>\n</ul>\n<h3>Versão `2.0.0`</h3>\n<p>Na versão <strong>2.0.0</strong> promovemos várias mudanças no formato no plugin, tanto para facilitar quando para deixar o fluxo de pagamento mais simples e dinâmico. Algumas opções foram removidas, enquanto outras foram mantidas. Leia abaixo em detalhes tudo que está diferente.</p>\n<h4>E-mails</h4>\n<h4>👎 Antes</h4>\n<p>👉 Era possível escolher o modelo de e-mail na qual o pagamento Pix seria anexado e, ainda, escolher a posição deste pagamento.</p>\n<h4>❌ Por que mudamos?</h4>\n<p>Muitos relatavam conflitos e dificuldades para gerenciar o conteúdo do e-mail, enquanto outros utilizavam plugins desatualizados que quebravam os e-mails. Isso acontecia, pois dependiamos de uma <code>action</code> localizada no modelo de e-mail selecionado para carregar os dados do Pix.</p>\n<h4>👍 Agora</h4>\n<p>👉 Criamos diversos modelos de e-mails, entre eles: quando o Pix estiver próximo de expirar, quando o Pix expirar, quando o Pix for pago e quando o Pix for criado para pagamento.</p>\n<p>👉 Não anexamos mais as informações do Pix no e-mail para evitar <strong>SPAM</strong> e compartilhamento desnecessário dos dados. Criamos um link único para o cliente acessar e visualizar todos os dados de pagamento novamente.</p>\n<h4>Comprovantes</h4>\n<p>👎 Antes =</p>\n<p>👉 Era possível selecionar uma página para enviar o comprovante e utilizar qualquer formulário desejado. Também era possível utilizar o shortcode <code>[pix-por-piggly-form]</code> para utilizar o recurso nativo do plugin para recebimento de comprovantes.</p>\n<h4>❌ Por que mudamos?</h4>\n<p>Alguns clientes enviavam de forma errada ou a forma como o shortcode <code>[pix-por-piggly-form]</code> era utilizado prejudicava a experiência criando diversos comprovantes desnecessários e produzindo muito lixo na pasta de uploads.</p>\n<h4>👍 Agora</h4>\n<p>👉 Será utilizado um link permanente exclusivo para que o usuário faça o envio do comprovante Pix, garantindo todas as validações necessárias para que o usuário envie sempre para o pedido correto.</p>\n<p>👉 O comprovante enviado será automaticamente associado ao Pix relacionado ao pedido e sempre será considerado o último comprovante enviado.</p>\n<h4>Pedidos</h4>\n<h4>👎 Antes</h4>\n<p>👉 Ao selecionar o Pix, o pedido automaticamente migrava o status para <code>Aguardando o Pagamento</code>, também era possível utilizar o status <code>Comprovante Pix Recebido</code> quando o comprovante era enviado.</p>\n<h4>❌ Por que mudamos?</h4>\n<p>Alguns usuários acharam o status <code>Comprovante Pix Recebido</code> muito complicado e tinham rotinas que impediam o uso.</p>\n<p>Migrar para o status <code>Aguardando o Pagamento</code> também não é mais uma opção, uma vez que os Pix podem ser confirmados tanto por API quanto por comprovantes.</p>\n<h4>👍 Agora</h4>\n<p>👉 Agora, por padrõa, o pedido ficará como <code>Pendente</code> atéq ue o cliente envie o comprovante ou que uma API Pix atualize o Pix como pago.</p>\n<p>👉 Quando o cliente enviar um comprovante, o status é migrado para sair da situação como <code>Pendente</code>.</p>\n<p>👉 Também foi adicionado um recurso para atualizar automaticamente o status do pedido para <code>Pago</code> quando o Pix for pago.</p>\n<p>👉 Tanto o status para Comprovante Enviado quanto para Pedido Pago podem ser configurados. <strong>Não recomendamos que o Comprovante Enviado marque o pedido como pago&#8230;</strong></p>\n<h4>Endpoints</h4>\n<h4>👍 Agora</h4>\n<p>👉 Foram criados dois endpoints exclusivos dentro do ambiente &#8220;Minha Conta&#8221; do Woocommerce. Um para o realizar o pagamento pendente do Pix e outro para enviar o comprovante de pagamento.</p>\n<p>👉 Os endpoints podem ser acessados a qualquer momento desde que o cliente tenha autorização e eles estejam liberados para acesso.</p>\n<h4>Templates</h4>\n<h4>👍 Agora</h4>\n<p>👉 Atualizamos todos os templates, será necessário revisá-los para que eles funcionem corretamente caso você tenha realizado alguma personalização.</p>\n<h4>Filtros e Ações</h4>\n<p>A partir da versão <strong>2.0.0</strong> é possível utilizar os filtros e as ações abaixo:</p>\n<h4>👍 Filtros</h4>\n<ul>\n<li><code>pgly_wc_piggly_pix_discount_applied</code> Personaliza o valor calculado para o desconto antes de aplicar;</li>\n<li><code>pgly_wc_piggly_pix_payload</code> Personaliza ou altera o objeto Payload do Pix antes de gerar o código;</li>\n<li><code>pgly_wc_piggly_pix_pending_status</code> Personaliza o status de <code>pending</code> ao criar um pedido com pagamento Pix;</li>\n<li><code>pgly_wc_piggly_pix_process</code> Personaliza o objeto <code>PixEntity</code> antes de processar o Pix.</li>\n</ul>\n<h4>👍 Ações</h4>\n<ul>\n<li><code>pgly_wc_piggly_pix_webhook</code> Executa o webhook do Pix;</li>\n<li><code>pgly_wc_piggly_pix_to_pay</code> Logo após o Pix ser criado e associado ao pedido;</li>\n<li><code>pgly_wc_piggly_pix_after_save_receipt</code> Logo após criar (e salvar) o comprovante do Pix;</li>\n<li><code>pgly_wc_piggly_pix_close_to_expires</code> Quando o Pix está próximo da expiração.</li>\n</ul>\n<h4>Principais melhorias</h4>\n<ul>\n<li>✅ Alteração da cor do ícone do Pix;</li>\n<li>✅ Formulário integrado para envio de comprovante;</li>\n<li>✅ (Opcional) Atualização automática do pedido com comprovante recebido;</li>\n<li>✅ Desconto automático para pagamento via Pix.</li>\n<li>✅ Reformulação das configurações;</li>\n<li>✅ Criação da metabox Pix nos pedidos pagos via Pix;</li>\n<li>✅ Otimização para geração dos QR Codes;</li>\n<li>✅ Desconto automático para pagamento via Pix.</li>\n</ul>\n<h3>Performance</h3>\n<p>Toda a estrutura e código do plugin foram atualizados para garantir a melhor performance, agora todos os dados de um Pix criado são salvos em uma tabela de dados que evita a recriação do Pix. Os QR Codes e os comprovantes também são associados ao Pix que permite um único arquivo de cada, mantendo a biblioteca de uploads sempre limpa.</p>\n<h3>Como funciona?</h3>\n<p>Assim como é feito atualmente com uma transferência eletrônica no Woocommerce, o <strong>Pix por Piggly</strong> permite aos consumidores escolherem o método de pagamento Pix, então eles recebem as instruções de pagamento e enviam o comprovante. Você também pode aplicar um desconto automático para pagamentos via Pix.</p>\n<p>Bem simples né?</p>\n<p>Para permitir isso, nosso plugin segue todas as propostas do padrão EMV®1, implementado pelo Banco Central do Brasil, você pode ler mais sobre isso em <a href=\"https://www.bcb.gov.br/content/estabilidadefinanceira/forumpireunioes/Anexo%20I%20-%20QRCodes%20-%20Especifica%C3%A7%C3%A3o%20-%20vers%C3%A3o%201-1.pdf\" rel=\"nofollow ugc\">Especificações Técnicas</a>. Utilizamos a nossa bibliteca <a href=\"https://github.com/piggly-dev/php-pix\" rel=\"nofollow ugc\">piggly/php-pix</a> para manipular e gerar os códigos pix.</p>\n<p>Dessa forma, nosso plugin gera os três principais métodos de pagamento Pix:</p>\n<ol>\n<li>Um <strong>QR Code</strong> com o código Pix;</li>\n<li>O código Pix em formato de texto para utilização da função <strong>Pix Copia &amp; Cola</strong>;</li>\n<li>Pagamento manual com os dados Pix fornecidos.</li>\n</ol>\n<p>Nosso plugin gera de forma automática o código Pix com base nas informações do Pedido e nas informações preenchidas na configuração do plugin.</p>\n<blockquote>\n<p>Não importa como você digita a chave Pix, ela será automaticamente convertida para os formatos apropriados, okay? Caso ela esteja inválida, de acordo com o formato escolhido, você será notificado.</p>\n</blockquote>\n<h3>Testes realizados</h3>\n<p>O código Pix gerado por esse plugin, incluindo a função <strong>QR Code</strong> e <strong>Pix Copia &amp; Cola</strong>, foi testado nos seguintes aplicativos de banco:</p>\n<ul>\n<li>Banco do Brasil;</li>\n<li>Banco Inter;</li>\n<li>BMG;</li>\n<li>Bradesco;</li>\n<li>C6;</li>\n<li>Itaú;</li>\n<li>Mercado Pago;</li>\n<li>Nubank;</li>\n<li>PagPank;</li>\n<li>Santander.</li>\n</ul>\n<p>Como o código utiliza o padrão do Pix é possível que funcione em todos os bancos. Mas, caso encontre problemas ou dificuldades não hesite em abrir uma <a href=\"https://wordpress.org/support/plugin/pix-por-piggly/\" rel=\"ugc\">thread</a> no Suporte do Plugin ou enviar um e-mail para <strong><a href=\"mailto:&#100;&#101;&#118;&#064;&#112;&#105;&#x67;&#x67;&#x6c;&#x79;&#x2e;&#x63;&#x6f;&#x6d;&#x2e;&#x62;&#x72;\" rel=\"nofollow ugc\">dev@piggly.com.br</a></strong>.</p>\n<h3>Perguntas Frequentes</h3>\n<h4>Qual é a licença do plugin?</h4>\n<p>Este plugin esta licenciado como GPLv2. Ele é distrubuido de forma gratuita.</p>\n<h4>O que eu preciso para utilizar este plugin?</h4>\n<ul>\n<li>Ter instalado o WordPress 4.0 ou superior;</li>\n<li>Ter instalado o plugin WooCommerce 3.0 ou superior;</li>\n<li>Utilizar a versão 7.2 do PHP;</li>\n<li>Ter a extensão <code>gd</code> para PHP habilitada, veja detalhes <a href=\"https://www.php.net/manual/pt_BR/book.image.php\" rel=\"nofollow ugc\">aqui</a>;</li>\n<li>Possuir uma conta bancária com Chave Pix.</li>\n</ul>\n<h4>Posso utilizar com outros gateways de pagamento?</h4>\n<p>Sim, esse plugin funciona apenas como um método de pagamento adicional, assim como acontece com o método de transferência eletrônica.</p>\n<h4>Como aplicar desconto automático?</h4>\n<p>Na página de configurações do Plugin, acesse <strong>Pedidos</strong> e insira um valor e um rótulo para o desconto Pix. O desconto será automaticamente aplicado quando o cliente escolher o método de pagamento Pix.</p>\n<h4>Como conferir o pagamento Pix?</h4>\n<p>A conferência do Pix ainda é manual, assim como acontece em uma transferência eletrônica. Para facilitar, o plugin gera os Pix com um código identificador. Esse código possuí um valor estático de 25 caracteres.</p>\n<p>Abra o pedido criado no Woocommerce e verifique o código identificador do Pix, ao abrir o aplicativo do seu banco, você poderá ver detalhes sobre o recebimento Pix e, na maioria dos bancos, o pagamento estará identificado com o código identificador do Pix.</p>\n<p>= Não tem como atualizar o pagamento Pix automaticamente?</p>\n<p>Para validar se um Pix foi pago a maioria dos bancos emissores irão cobrar taxas, assim como os intermediadores de pagamento. Se você faz parte de um banco emissor que já implementa a API Pix, pode entrar em contato com a gente em <a href=\"mailto:&#100;&#101;&#118;&#064;&#112;&#105;&#x67;&#x67;&#x6c;&#x79;&#x2e;&#x63;&#x6f;&#x6d;&#x2e;&#x62;&#x72;\" rel=\"nofollow ugc\">dev@piggly.com.br</a> para que possamos implementar a solução.</p>\n<h4>Gerei o código Pix, mas não consigo efetuar o pagamento. E agora?</h4>\n<p>Nas configurações do Plugin acesse &#8220;Suporte&#8221; e verifique a seção &#8220;O plugin gera o QR Code, mas não consigo pagá-lo&#8221;, lá estarão algumas dicas automáticas que podem ajudar você. Se ainda sim precisar de algum suporte, abra um chamado enviando um e-mail para <a href=\"mailto:&#100;&#101;&#118;&#064;&#112;&#105;&#x67;&#x67;&#x6c;&#x79;&#x2e;&#x63;&#x6f;&#x6d;&#x2e;&#x62;&#x72;\" rel=\"nofollow ugc\">dev@piggly.com.br</a>.</p>\n<h4>Como customizar os templates?</h4>\n<p>Nas configurações do Plugin acesse &#8220;Suporte&#8221; e verifique a seção &#8220;Como substituir os templates de e-mail e da página de obrigado&#8221;.</p>\n<blockquote>\n<p><strong>AVISO</strong>: Ao customizar os templates você pode perder funcionalidades importantes do plugin e comportamentos pré-existentes nos templates originais. Tenha certeza sobre o que está fazendo para garantir que tudo funcione como deve ser. <strong>Não prestaremos suporte para customizações</strong>.</p>\n</blockquote>\n<h3>Como instalar?</h3>\n<h4>No diretório oficial do WordPress</h4>\n<p>A página oficial do plugin pode ser encontrada em: <a href=\"https://wordpress.org/plugins/pix-por-piggly/\" rel=\"ugc\">wordpress@pix-por-piggly</a>.</p>\n<h4>No repositório do Github</h4>\n<p>Vá para <a href=\"https://github.com/piggly-dev/piggly-views-wordpress/releases\" rel=\"nofollow ugc\">Releases</a> neste repositório e faça o download em <code>.zip</code> da versão mais recente.</p>\n<p>Então, no <strong>Painel Administrativo</strong> do WordPress, vá em <code>Plugins &gt; Adicionar novo</code> e clique em <code>Upload plugin</code> no topo da página para enviar o arquivo <code>.zip</code>.</p>\n<blockquote>\n<p>Você precisará, posteriormente, ir até a pasta do plugin no terminal do seu servidor Web e executar o comando <code>composer install</code> caso escolha essa opção.</p>\n</blockquote>\n<h4>Da origem</h4>\n<p>Você precisará do Git instalado para contruir da origem. Para completar os passos a seguir, você precisará abrir um terminal de comando. Clone o repositório:</p>\n<pre><code>git clone https://github.com/piggly-dev/wc-piggly-pix.git\n</code></pre>\n<blockquote>\n<p>Você precisará, posteriormente, executar o comando <code>composer install</code> caso escolha essa opção.</p>\n</blockquote>\n<h3>Como utilizar?</h3>\n<p>Após a instalação do plugin, vá até <code>Plugins &gt; Plugins instalados</code>, ative o plugin <strong>Pix por Piggly para Woocommerce</strong>. Assim que você ativar, o plugin já estará disponível em <code>Woocommerce &gt; Configurações &gt; Pagamentos</code> e você poderá inserir todas as configurações pertinentes.</p>\n<p><strong>Preencha corretamente a sua chave Pix. Você pode testar nas configurações do plugin o funcionamento do Pix mesmo que o módulo esteja desativado.</strong></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.1.2.zip",
    "upgrade_notice": {
        "2.0.25": "<ul>\n<li>Adição do menu &quot;Processamento do Pix&quot; para maior controle da cronjob e do processamento imediato do Pix.</li>\n<li>Novos avisos adicionados e nomenclatura dos Pix alterada.</li>\n</ul>",
        "2.0.24": "<ul>\n<li>Pequenas correções;</li>\n</ul>",
        "2.0.23": "<ul>\n<li>Pequenas correções;</li>\n<li>Prevenção de cancelamento automático.</li>\n</ul>",
        "2.0.22": "<ul>\n<li>Limpeza dos logs;</li>\n<li>Alerta de Modo Debug ativo;</li>\n<li>Filtragem básica dos Pix criados.</li>\n</ul>",
        "2.0.21": "<ul>\n<li>Bug na atualização do Pix.</li>\n</ul>",
        "2.0.20": "<ul>\n<li>Melhorias nas mensagens de retorno de erro e sucesso;</li>\n<li>Desabilitação da limpeza automática;</li>\n<li>Atualização automática do Pix com botão &quot;Já realizei o pagamento&quot; para APIs do Pix.</li>\n</ul>",
        "2.0.19": "<ul>\n<li>Correção de permissão de logs durante execução da cronjob;</li>\n<li>Correção na data de atualização do Pix;</li>\n<li>Correção no envio de notificação de Pix próximo a expiração;</li>\n<li>Remoção do Pix ao remover o pedido;</li>\n<li>Atualização automática para a página de pedido concluído, quando em uso da API do Pix;</li>\n<li>Correção da atualização da Cron Job para executar a cada minuto;</li>\n<li>Ação para executar os webhooks da API do Pix;</li>\n<li>Exibição do e2eid identificando o pagamento do Pix, quando em uso da API do Pix;</li>\n<li>Rotina para limpeza dos Pix expirados ou cancelados;</li>\n<li>Reorganização do menu Pix por Piggly.</li>\n</ul>",
        "2.0.18": "<ul>\n<li>Correção da detecção de Pix próximo à expiração;</li>\n<li>Habilitação da API do Woocommerce para pedidos Pix;</li>\n<li>Melhoria nos logs de debug para identificar envio dos e-mails.</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/pix-por-piggly/assets/screenshot-1.png?rev=2518737",
            "caption": "Exemplo do método de pagamento durante o Checkout;"
        },
        {
            "src": "https://ps.w.org/pix-por-piggly/assets/screenshot-2.png?rev=2515048",
            "caption": "Exemplo das instruções com as informações de pagamento;"
        },
        {
            "src": "https://ps.w.org/pix-por-piggly/assets/screenshot-3.png?rev=2442570",
            "caption": "Método de pagamento nas configurações do Woocommerce;"
        },
        {
            "src": "https://ps.w.org/pix-por-piggly/assets/screenshot-4.png?rev=2515048",
            "caption": "Configurações gerais do método de pagamento;"
        },
        {
            "src": "https://ps.w.org/pix-por-piggly/assets/screenshot-5.png?rev=2515048",
            "caption": "Preencha os dados da sua conta Pix;"
        },
        {
            "src": "https://ps.w.org/pix-por-piggly/assets/screenshot-6.png?rev=2515048",
            "caption": "Ou, importe os dados Pix de um código Pix Copia &amp; Cola;"
        },
        {
            "src": "https://ps.w.org/pix-por-piggly/assets/screenshot-7.png?rev=2515048",
            "caption": "Configure pedidos, e-mails e desconto automático para o pagamento Pix;"
        },
        {
            "src": "https://ps.w.org/pix-por-piggly/assets/screenshot-8.png?rev=2515048",
            "caption": "Controle o envio de comprovantes dos pagamentos via Pix;"
        },
        {
            "src": "https://ps.w.org/pix-por-piggly/assets/screenshot-9.png?rev=2515048",
            "caption": "Teste o pagamento via Pix antes de habilitar o módulo;"
        },
        {
            "src": "https://ps.w.org/pix-por-piggly/assets/screenshot-10.png?rev=2515048",
            "caption": "Metabox Pix no pedido realizado via Pix."
        }
    ],
    "tags": {
        "e-commerce": "e-commerce",
        "payment": "payment",
        "pix": "pix",
        "shop": "shop",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "2.1.2",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.0.4.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.1.zip",
        "1.1.10": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.10.zip",
        "1.1.11": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.11.zip",
        "1.1.12": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.12.zip",
        "1.1.13": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.13.zip",
        "1.1.14": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.14.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.8.zip",
        "1.1.9": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.1.9.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.2.4.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.1.zip",
        "1.3.10": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.10.zip",
        "1.3.11": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.11.zip",
        "1.3.12": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.12.zip",
        "1.3.13": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.13.zip",
        "1.3.14": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.14.zip",
        "1.3.15": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.15.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.8.zip",
        "1.3.9": "https://downloads.wordpress.org/plugin/pix-por-piggly.1.3.9.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.1.zip",
        "2.0.10": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.10.zip",
        "2.0.11": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.11.zip",
        "2.0.12": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.12.zip",
        "2.0.13": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.13.zip",
        "2.0.14": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.14.zip",
        "2.0.15": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.15.zip",
        "2.0.16": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.16.zip",
        "2.0.17": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.17.zip",
        "2.0.18": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.18.zip",
        "2.0.19": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.19.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.2.zip",
        "2.0.20": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.20.zip",
        "2.0.21": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.21.zip",
        "2.0.22": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.22.zip",
        "2.0.23": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.23.zip",
        "2.0.24": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.24.zip",
        "2.0.25": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.25.zip",
        "2.0.26": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.26.zip",
        "2.0.27": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.27.zip",
        "2.0.28": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.28.zip",
        "2.0.29": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.29.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.5.zip",
        "2.0.6": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.6.zip",
        "2.0.7": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.7.zip",
        "2.0.8": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.8.zip",
        "2.0.9": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.0.9.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/pix-por-piggly.2.1.2.zip",
        "trunk": "https://downloads.wordpress.org/plugin/pix-por-piggly.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/pix-por-piggly/assets/banner-772x250.png?rev=2442570",
        "high": "https://ps.w.org/pix-por-piggly/assets/banner-1544x500.png?rev=2442570"
    },
    "icons": {
        "1x": "https://ps.w.org/pix-por-piggly/assets/icon-256x256.png?rev=2442570",
        "2x": "https://ps.w.org/pix-por-piggly/assets/icon-256x256.png?rev=2442570"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 90,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}