{
    "name": "Plastic Tunes",
    "slug": "plastic-tunes",
    "version": "1.4",
    "author": "<a href=\"http://unalignedcode.wordpress.com\">unalignedcoder</a>",
    "author_profile": "https://profiles.wordpress.org/unalignedcoder/",
    "contributors": {
        "unalignedcoder": {
            "profile": "https://profiles.wordpress.org/unalignedcoder/",
            "avatar": "https://secure.gravatar.com/avatar/1f57899c8070f9ce95cb65ec0f5a40ae?s=96&d=monsterid&r=g",
            "display_name": "unalignedcoder"
        }
    },
    "requires": "2.0.2",
    "tested": "2.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/plastic-tunes/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 10,
    "downloaded": 5059,
    "last_updated": "2009-09-09 11:32:00",
    "added": "2007-09-19",
    "homepage": "http://unalignedcode.wordpress.com/plastic_tunes/",
    "sections": {
        "description": "<p>Plastic Tunes is a &#8220;now-playing&#8221; plugin that allows your blog to display informations about the music you play in your media player, and most importantly, to insert them into your database. Artists, titles, albums and pretty much any information included in your digital music files goes into your database for real-time or later use, ready to be displayed on your sidebar, on a dedicated page or wherever you want.<br />\nThe concept of this plugin, and quite a few lines of code were originally taken from version 0.1 of the <a href=\"http://www.thesmithsplace.com/mutunes\" rel=\"nofollow ugc\">muTunes</a> plugin, made by Ken Smith &#8212; although Plastic Tunes grew a lot since then.</p>\n",
        "installation": "<ol>\n<li>\n<p>Installation of WordPress plugin:</p>\n<ul>\n<li>FTP the &#8220;plastic_tunes&#8221; folder to your <code>wp-content/plugins</code> directory.</li>\n<li>Activate the plugin</li>\n<li>Customize the options page (help is included on that page)</li>\n<li>Load the widget: if your installation is compatible, you can use the widget function to load the infos on the sidebar. Just remember to customize its options by adding a <code>user_id</code> in its otpions. Without it the widget won&#8217;t work and most likely will cause a ugly error. The title of the widget instead is optional, and if entered will override the sidebar title as (and if) indicated on the plastic tunes option page. Be aware that leaving the widget title empty also overrides the tags before and after the widget element, such as <code>&lt;h2&gt;</code> or <code>*</code>. In that scenario you are in fact expected to provide them with the &#8216;title&#8217; and the &#8216;closing element&#8217; fields on the plastic tune option page.</li>\n<li>If you can&#8217;t or won&#8217;t use the widget function, add the following piece of code to your sidebar: <code>&lt;?php plastic_sidebar($user_id); ?&gt;</code>, where <code>$user_id</code> is the number reported in the list in the options page.</li>\n<li>Add the following piece of code to the template you will use for  the entire list of music items: <code>&lt;?php plastic_table($user_id); ?&gt;</code> (see instruction on how to use templates on the WordPress codex website.)</li>\n</ul>\n</li>\n<li>\n<p>Installation and setup of media players plugins:</p>\n<ul>\n<li>consult the included &#8220;readme.htm&#8221;.</li>\n</ul>\n</li>\n</ol>\n",
        "changelog": "<ul>\n<li>1.4 Compatible with WordPress 2.5, and minor fixes and redesign.</li>\n<li>1.3 Plastic Tunes can now be used with the <a href=\"http://people.cc.jyu.fi/~ltnevala/nowplaying/plugin:1:Main.html\" rel=\"nofollow ugc\">Now Playing</a> plugin for Winamp. For compatibility reasons, AMIP users who update must slightly modify their insert settings. More details below. This version also fixes few potential bugs.</li>\n<li>1.2 Minor fix due to a bug of the widget functionality, where the widget form would not report the values correctly. Now fixed.</li>\n<li>1.1 A management page has been included in the admin area. This is still in a early stage, but allows you to browse all the music items you added so far, delete single records and purge the entire list of music items.<br />\nAlso added an option to skip duplicates when listing all the entries in your list page (this does not apply to the just mentioned management page in the admin area). For duplicates it is meant the same music piece played more than one time and appearing in more locations within the list. With this option on, songs that occur more than once will be inserted in the database just as well, but will not appear in the list.</li>\n<li>1.0b Just a mistake in the title of the plugin on the WP plugins page, where it said &#8216;(next)Plastic Tunes&#8217;. Sorry about it, it was a testing leftover. Now it correctly says &#8216;Plastic Tunes&#8217;.</li>\n<li>1.0 For sake of logic, efficiency and security, I made few changes in the way the plugin understands what goes on with the player. The callbacks events are slightly different now. You&#8217;ll have to take care of these changes in your AMIP configurator (see &#8216;How to install the Media Player plugin&#8217; section below). This is important since previously in the instructions I had also forgot to indicate the &#8216;duration&#8217; variable that is crucial for certain functions of the plugin.<br />\nOn a technical side, there&#8217;s now a new option in the options table of your wordpress DB, called <code>plastic_tunes_player_state</code>, and a obsolete one, that won&#8217;t be used anymore, <code>plastic_tunes_togglesidebar</code>(note that a plugin like <a href=\"http://www.mittineague.com/dev/co.php\" rel=\"nofollow ugc\">CleanOptions</a> can help you in removing obsolete entries from your wordpress options).<br />\nReflecting these changes, there are now in the code new comments and explanations, and also a very useful example on how it is possible to customize the title of the sidebar element according to the state of the player. Look for it in the &#8216;Edit the title of your sidebar code here&#8217; in the file &#8216;plastic_functions.php&#8217;.</li>\n<li>0.99 Corrected the relationship between the sidebar option and the widget. Now when the widget options has no title, it is not only assumed that the title is taken care of in the option page: also the default &#8216;before&#8217; and &#8216;after&#8217; tags of the widget are not displayed, and are thus expected to be taken care of in the option page too. They should be considered for in the &#8216;title&#8217; and &#8216;closing elements&#8217; fields. This is done to avoid redundancy of tags and allow for more customization. The less expert user is not affected by this as long as a title is entered in the widgted options.</li>\n<li>0.98 Plastic Tunes is now widget compatible. For those who run WordPress 2.2.x or the <a href=\"http://automattic.com/code/widgets/\" rel=\"nofollow ugc\">Widgets plugin</a> with compatible themes, it means it&#8217;s a lot easier now to show off your listening preferences on the sidebar. Read below for more detailed informations, &#8220;how to install&#8221; section.</li>\n<li>0.97 Two apostrophes slipped in a SQL query. It broke the insert of the data. Sorry for being such a messy programmer. Hopefully is now all OK.</li>\n<li>0.96 Corrected the time span calculation, now it works properly. Also added a checkbox I forgot in the option page. Never to sing the victory, they say in my falling country.</li>\n<li>0.95 Flood protection is now working. Also I realized that the &#8220;Play &amp; Change&#8221; callback from the media player wasn&#8217;t properly working (it caused duplicate entries after stopping and restarting the player). The event to use is now &#8220;Change&#8221; only. Also I changed the &#8220;year&#8221; field to accept more than 4 chars, in case of entries like &#8220;1998-2003&#8221; and similar. This version is quite a good one, I think (or better, I hope).</li>\n<li>0.94 temporarily removed flood protection. I don&#8217;t seem to be able to make it work properly. Also I forgot to make the variable <code>%duration%</code> available in the option panel, and the example of customized code for the sidebar was wrong. Both corrected.</li>\n<li>0.93 fixed the flood control function and few other bugs.</li>\n<li>0.90 first public release. I worked a lot before to release this beta, so I just invented a version number I thought proper. Possibly this one is a little optimistic, but hey, it&#8217;s too late to change it. I never understood the general logic of application numbering anyway.</li>\n</ul>\n"
    },
    "short_description": "A Multi-User \"Now Playing\" plugin that accepts input from iTunes, WinAmp, and many more. Saves your information to your DB and will accomodate multiple users. Widget compatible and highly customizable.",
    "description": "<p>Plastic Tunes is a &#8220;now-playing&#8221; plugin that allows your blog to display informations about the music you play in your media player, and most importantly, to insert them into your database. Artists, titles, albums and pretty much any information included in your digital music files goes into your database for real-time or later use, ready to be displayed on your sidebar, on a dedicated page or wherever you want.<br />\nThe concept of this plugin, and quite a few lines of code were originally taken from version 0.1 of the <a href=\"http://www.thesmithsplace.com/mutunes\" rel=\"nofollow ugc\">muTunes</a> plugin, made by Ken Smith &#8212; although Plastic Tunes grew a lot since then.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/plastic-tunes.1.4.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/plastic-tunes/trunk/screenshot-1.png?rev=1559359",
            "caption": "<p>In action on the sidebar</p>"
        },
        {
            "src": "https://ps.w.org/plastic-tunes/trunk/screenshot-2.png?rev=1559359",
            "caption": "<p>A glimpse of the option page</p>"
        }
    ],
    "tags": {
        "media": "media",
        "music": "music",
        "nowplaying": "nowplaying",
        "sidebar": "sidebar",
        "widget": "widget"
    },
    "stable_tag": "1.4",
    "versions": {
        "1.4": "https://downloads.wordpress.org/plugin/plastic-tunes.1.4.zip",
        "trunk": "https://downloads.wordpress.org/plugin/plastic-tunes.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/plastic-tunes.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}