{
    "name": "Pofily &#8211; WooCommerce Product Filters",
    "slug": "pofily-woo-product-filters",
    "version": "1.1.1",
    "author": "<a href=\"https://villatheme.com/\">VillaTheme</a>",
    "author_profile": "https://profiles.wordpress.org/villatheme/",
    "contributors": {
        "villatheme": {
            "profile": "https://profiles.wordpress.org/villatheme/",
            "avatar": "https://secure.gravatar.com/avatar/973d0ef458adb8a3c527f196b9529909?s=96&d=monsterid&r=g",
            "display_name": "VillaTheme"
        },
        "mrt3vn": {
            "profile": "https://profiles.wordpress.org/mrt3vn/",
            "avatar": "https://secure.gravatar.com/avatar/cb8ecbc2ffe02a20ea2f5d1da26d3a22?s=96&d=monsterid&r=g",
            "display_name": "Andy Ha"
        }
    },
    "requires": "5.0.0",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [
        "woocommerce"
    ],
    "compatibility": [],
    "rating": 96,
    "ratings": {
        "5": 5,
        "4": 1,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 6,
    "support_url": "https://wordpress.org/support/plugin/pofily-woo-product-filters/",
    "support_threads": 1,
    "support_threads_resolved": 1,
    "active_installs": 900,
    "downloaded": 11514,
    "last_updated": "2024-04-13 09:10:00",
    "added": "2021-11-09",
    "homepage": "https://villatheme.com/extensions/pofily-woocommerce-product-filters/",
    "sections": {
        "description": "<p>Pofily – WooCommerce Product Filters help you add filters to products. You can create filters based on your expectation and customers’ needs, for Taxonomy, Review, Price, Name. With various options of Filters the plugin provides, customers can search for their in-need products with just a few manipulations. Users can design how to show filters on the frontend with Customize settings, choose a place to display filter by using shortcode or adding rules, make the Filter look friendly and convenient to use for customers.</p>\n<p><strong>You can see this video guide on how to install and use Pofily – WooCommerce Product Filters</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/4fIzjU8qVFY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>&#9658; <strong>With Pofily – WooCommerce Product Filters, you can:</strong></p>\n<ul>\n<li>\n<p>Create multiple filter blocks as you want for different contents: Product tag, product category, product attribute, product price, product name, product review.</p>\n</li>\n<li>\n<p>“Add all” and “Remove all” buttons are helpful when you do not want to add terms manually. It helps to save time and work effectively with big data.</p>\n</li>\n<li>\n<p>If you want to replace the original name of the terms, Label and Tooltip can help. Set the labels that match your expectation and make it look friendly to customers</p>\n</li>\n<li>\n<p>Customize how you want with all WooCommerce product filters: make them display as checkboxes, selections, buttons, color swatches, range slider.</p>\n</li>\n<li>\n<p>Decide to show WooCommerce product filters with modal or on the sidebar (widget)</p>\n</li>\n<li>\n<p>Design WooCommerce product filters with style, colors, sizes, directions, icons, and many more…</p>\n</li>\n<li>\n<p>Create Filter Menu to add WooCommerce product filters</p>\n</li>\n<li>\n<p>Set rules to apply product filters. This is useful when you want to show the filters separately.</p>\n</li>\n<li>\n<p>Allow customers to choose multiple WooCommerce product filters at once, or only choose one filter each time they use.</p>\n</li>\n<li>\n<p>Effortlessly change the position of filters display by dragging and dropping.  Move them to the place you want in Filter Menu</p>\n</li>\n<li>\n<p>If there are many terms to show, you can use the “View more” button.</p>\n</li>\n<li>\n<p>The “Clear” button works for each WooCommerce product filter separately</p>\n</li>\n<li>\n<p>The “Clear Filter” button works for all active filters, help customers remove all selected filters, and start again</p>\n</li>\n<li>\n<p>“Active Filters” settings help customers know which filters they chose.</p>\n</li>\n</ul>\n<blockquote>\n<p><a href=\"https://demo.new2new.com/\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"https://docs.villatheme.com/pofily-woocommerce-product-filters/\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://codecanyon.net/item/pofily-woocommerce-product-filters/34743510\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<h3>FEATURES</h3>\n<p>&#9658; <strong>Show filters of Pofily – WooCommerce Product Filters in Modal</strong><br />\nUsers can decide to show WooCommerce Product Filters in the modal window or not. If you disable this feature, the filters appear on the sidebar of the widget. If enabled, users can customize the modal appearance to match their expectations, with various available customizing options.</p>\n<ul>\n<li>\n<p>Choose to show product filters in Modal window with Off-canvas style</p>\n</li>\n<li>\n<p>Edit icon to show Modal window with Icon position and Modal icon style</p>\n</li>\n<li>\n<p>Edit Modal with position to appear, effect, column layout</p>\n</li>\n<li>\n<p>Choose a style: Theme style or Custom style</p>\n</li>\n<li>\n<p>Design filter area with color of Title, Background and Accent color</p>\n</li>\n<li>\n<p>Set default color for Color swatches type (Taxonomy)</p>\n</li>\n<li>\n<p>Design label with default, hovered, and active status: font size, border width, border radius, background color, text color</p>\n</li>\n</ul>\n<p>&#9658; <strong>Create filters with Pofily – WooCommerce Product Filters that help customers search for products conveniently.</strong><br />\nPage builders can create different WooCommerce product filters for different searching purposes, based on customers’ needs. Each product filter has its own design options and can be edited. Users can create several versions with the same filter type.</p>\n<ul>\n<li>\n<p>Create multiple filter blocks for particular searching purposes with different options: Taxonomy, Price, Review, Name.</p>\n</li>\n<li>\n<p>Choose Taxonomy to apply the filter: Categories, Product tags, Attribute (Color, Size,…), …</p>\n</li>\n<li>\n<p>Show Filter as checkboxes, buttons, color swatches, range slider, search field (with Name)</p>\n</li>\n<li>\n<p>Customize terms or values with labels to replace the original name.</p>\n</li>\n<li>\n<p>Customize terms/values with tooltip when hovering the mouse over the term/value.</p>\n</li>\n<li>\n<p>Create range slider with Min – Max value and Step Slider..</p>\n</li>\n<li>\n<p>Enable, disable to show the number of items.</p>\n</li>\n<li>\n<p>Enable, disable to allow customers to choose multiple selections.</p>\n</li>\n<li>\n<p>Enable, disable to show filter as toggle.</p>\n</li>\n<li>\n<p>Enable, disable to show “view more” button.</p>\n</li>\n<li>\n<p>Enable, disable to show “clear” button.</p>\n</li>\n<li>\n<p>Select Order by Name, Slug, or ID and choose Order type between ASC or DESC (for Taxonomy)</p>\n</li>\n<li>\n<p>Edit display type – Vertical or Horizontal – for Button type</p>\n</li>\n</ul>\n<p>&#9658; <strong>Customize and arrange the menu display with Pofily – WooCommerce Product Filters on the front end.</strong></p>\n<ul>\n<li>\n<p>Choose and add blocks you want the menu to display on your website with created blocks</p>\n</li>\n<li>\n<p>Drag to change the position of Filter appeared in the menu.</p>\n</li>\n<li>\n<p>Enable, disable to show “Apply Filter” button</p>\n</li>\n<li>\n<p>Enable, disable to show menu in a modal window</p>\n</li>\n</ul>\n<p>&#9658; <strong>Pofily – WooCommerce Product Filters support showing Filter Menu with shortcode</strong></p>\n<ul>\n<li>We provided a shortcode when you create a Filter Menu. This shortcode helps you to display that Filter Menu in the position you decide to match your needs. Copy the shortcode, and paste it in the ideal place you find.</li>\n</ul>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>The plugin is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>PRO VERSION</h3>\n<ul>\n<li>\n<p><strong>All features from free version.</strong></p>\n</li>\n<li>\n<p><strong>Show filters in Modal style or Top product loop style.</strong></p>\n</li>\n<li>\n<p><strong>Create filters for Metadata and OnSale/InStock products.</strong></p>\n</li>\n<li>\n<p><strong>Show filters as images, ranges with Display Type option.</strong></p>\n</li>\n<li>\n<p><strong>Customize range with Min and Max value. Create as many ranges as you want with the Range type.</strong></p>\n</li>\n<li>\n<p><strong>With Filter By Metadata, we provide meta keys of Products available in the database. Manage at settings and the<br />\nplugin will display corresponding meta value.</strong></p>\n</li>\n<li>\n<p><strong>Set rules to display Filter Menu at Display Conditions.</strong></p>\n</li>\n<li>\n<p><strong>6 months premium support from VillaTheme</strong>: We will help you if you have any problem with the plugin Free Shipping Bar for WooCommerce.</p>\n</li>\n</ul>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Customers can order and pay before it&#8217;s intended release date to guarantee a copy.</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"https://docs.villatheme.com/?item=pofily\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"https://docs.villatheme.com/?item=pofily\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
        "installation": "<ol>\n<li>Unzip the download package</li>\n<li>Upload <code>pofily-woo-product-filters</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "changelog": "<p>/<strong>1.1.1 &#8211; 2024.04.13</strong>/<br />\n– Updated: Compatible with WC 8.7 and WP 6.5.2<br />\n&#8211; Updated: Update support file</p>\n<p>/<strong>1.1.0 &#8211; 2023.08.23</strong>/<br />\n– Updated: Compatible with HPOS &#8211; WC 8.0 and WP 6.3</p>\n<p>/<strong>1.0.8 &#8211; 2023.07.15</strong>/<br />\n– Updated: Compatible with HPOS &#8211; WC 7.8 and WP 6.2<br />\n&#8211; Updated: Update support file</p>\n<p>/<strong>1.0.7 &#8211; 2022.12.22</strong>/<br />\n– Updated: Compatible with WC 7.2.0<br />\n– Updated: Language file<br />\n&#8211; Updated: Update support file</p>\n<p>/**1.0.6 &#8211; 2022.06.18 **/<br />\n&#8211; Fixed: Fixed toggle collapsible not working correct<br />\n&#8211; Updated: Compatible with WC6.6.0<br />\n&#8211; Updated: Update support file</p>\n<p>/**1.0.5 &#8211; 2022.05.21 **/<br />\n&#8211; Updated: Updated support file<br />\n&#8211; Updated: Compatible with WC6.5.0 and WP6.0</p>\n<p>/**1.0.4 &#8211; 2021.03.29 **/<br />\n&#8211; Updated: Updated support file</p>\n<p>/**1.0.3 &#8211; 2021.03.21 **/<br />\n&#8211; Updated: Updated support file<br />\n&#8211; Updated: Compatible with WC6.3.0</p>\n<p>/**1.0.2 &#8211; 2021.12.02 **/<br />\n&#8211; Fixed: Fixed responsive issue on Tablet and Mobile<br />\n&#8211; Fixed: Fixed show as toggle of filter block not working correctly</p>\n<p>/**1.0.1 &#8211; 2021.11.12 **/<br />\n&#8211; Updated: support url,review url,  docs url, pro url<br />\n&#8211; Updated: Compatible with Multi Currency for WooCommerce by VillaTheme</p>\n"
    },
    "short_description": "Pofily - WooCommerce Product Filters is an expert at filtering products. With just a few clicks",
    "description": "<p>Pofily – WooCommerce Product Filters help you add filters to products. You can create filters based on your expectation and customers’ needs, for Taxonomy, Review, Price, Name. With various options of Filters the plugin provides, customers can search for their in-need products with just a few manipulations. Users can design how to show filters on the frontend with Customize settings, choose a place to display filter by using shortcode or adding rules, make the Filter look friendly and convenient to use for customers.</p>\n<p><strong>You can see this video guide on how to install and use Pofily – WooCommerce Product Filters</strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/4fIzjU8qVFY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>&#9658; <strong>With Pofily – WooCommerce Product Filters, you can:</strong></p>\n<ul>\n<li>\n<p>Create multiple filter blocks as you want for different contents: Product tag, product category, product attribute, product price, product name, product review.</p>\n</li>\n<li>\n<p>“Add all” and “Remove all” buttons are helpful when you do not want to add terms manually. It helps to save time and work effectively with big data.</p>\n</li>\n<li>\n<p>If you want to replace the original name of the terms, Label and Tooltip can help. Set the labels that match your expectation and make it look friendly to customers</p>\n</li>\n<li>\n<p>Customize how you want with all WooCommerce product filters: make them display as checkboxes, selections, buttons, color swatches, range slider.</p>\n</li>\n<li>\n<p>Decide to show WooCommerce product filters with modal or on the sidebar (widget)</p>\n</li>\n<li>\n<p>Design WooCommerce product filters with style, colors, sizes, directions, icons, and many more…</p>\n</li>\n<li>\n<p>Create Filter Menu to add WooCommerce product filters</p>\n</li>\n<li>\n<p>Set rules to apply product filters. This is useful when you want to show the filters separately.</p>\n</li>\n<li>\n<p>Allow customers to choose multiple WooCommerce product filters at once, or only choose one filter each time they use.</p>\n</li>\n<li>\n<p>Effortlessly change the position of filters display by dragging and dropping.  Move them to the place you want in Filter Menu</p>\n</li>\n<li>\n<p>If there are many terms to show, you can use the “View more” button.</p>\n</li>\n<li>\n<p>The “Clear” button works for each WooCommerce product filter separately</p>\n</li>\n<li>\n<p>The “Clear Filter” button works for all active filters, help customers remove all selected filters, and start again</p>\n</li>\n<li>\n<p>“Active Filters” settings help customers know which filters they chose.</p>\n</li>\n</ul>\n<blockquote>\n<p><a href=\"https://demo.new2new.com/\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"https://docs.villatheme.com/pofily-woocommerce-product-filters/\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://codecanyon.net/item/pofily-woocommerce-product-filters/34743510\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<h3>FEATURES</h3>\n<p>&#9658; <strong>Show filters of Pofily – WooCommerce Product Filters in Modal</strong><br />\nUsers can decide to show WooCommerce Product Filters in the modal window or not. If you disable this feature, the filters appear on the sidebar of the widget. If enabled, users can customize the modal appearance to match their expectations, with various available customizing options.</p>\n<ul>\n<li>\n<p>Choose to show product filters in Modal window with Off-canvas style</p>\n</li>\n<li>\n<p>Edit icon to show Modal window with Icon position and Modal icon style</p>\n</li>\n<li>\n<p>Edit Modal with position to appear, effect, column layout</p>\n</li>\n<li>\n<p>Choose a style: Theme style or Custom style</p>\n</li>\n<li>\n<p>Design filter area with color of Title, Background and Accent color</p>\n</li>\n<li>\n<p>Set default color for Color swatches type (Taxonomy)</p>\n</li>\n<li>\n<p>Design label with default, hovered, and active status: font size, border width, border radius, background color, text color</p>\n</li>\n</ul>\n<p>&#9658; <strong>Create filters with Pofily – WooCommerce Product Filters that help customers search for products conveniently.</strong><br />\nPage builders can create different WooCommerce product filters for different searching purposes, based on customers’ needs. Each product filter has its own design options and can be edited. Users can create several versions with the same filter type.</p>\n<ul>\n<li>\n<p>Create multiple filter blocks for particular searching purposes with different options: Taxonomy, Price, Review, Name.</p>\n</li>\n<li>\n<p>Choose Taxonomy to apply the filter: Categories, Product tags, Attribute (Color, Size,…), …</p>\n</li>\n<li>\n<p>Show Filter as checkboxes, buttons, color swatches, range slider, search field (with Name)</p>\n</li>\n<li>\n<p>Customize terms or values with labels to replace the original name.</p>\n</li>\n<li>\n<p>Customize terms/values with tooltip when hovering the mouse over the term/value.</p>\n</li>\n<li>\n<p>Create range slider with Min – Max value and Step Slider..</p>\n</li>\n<li>\n<p>Enable, disable to show the number of items.</p>\n</li>\n<li>\n<p>Enable, disable to allow customers to choose multiple selections.</p>\n</li>\n<li>\n<p>Enable, disable to show filter as toggle.</p>\n</li>\n<li>\n<p>Enable, disable to show “view more” button.</p>\n</li>\n<li>\n<p>Enable, disable to show “clear” button.</p>\n</li>\n<li>\n<p>Select Order by Name, Slug, or ID and choose Order type between ASC or DESC (for Taxonomy)</p>\n</li>\n<li>\n<p>Edit display type – Vertical or Horizontal – for Button type</p>\n</li>\n</ul>\n<p>&#9658; <strong>Customize and arrange the menu display with Pofily – WooCommerce Product Filters on the front end.</strong></p>\n<ul>\n<li>\n<p>Choose and add blocks you want the menu to display on your website with created blocks</p>\n</li>\n<li>\n<p>Drag to change the position of Filter appeared in the menu.</p>\n</li>\n<li>\n<p>Enable, disable to show “Apply Filter” button</p>\n</li>\n<li>\n<p>Enable, disable to show menu in a modal window</p>\n</li>\n</ul>\n<p>&#9658; <strong>Pofily – WooCommerce Product Filters support showing Filter Menu with shortcode</strong></p>\n<ul>\n<li>We provided a shortcode when you create a Filter Menu. This shortcode helps you to display that Filter Menu in the position you decide to match your needs. Copy the shortcode, and paste it in the ideal place you find.</li>\n</ul>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>The plugin is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>PRO VERSION</h3>\n<ul>\n<li>\n<p><strong>All features from free version.</strong></p>\n</li>\n<li>\n<p><strong>Show filters in Modal style or Top product loop style.</strong></p>\n</li>\n<li>\n<p><strong>Create filters for Metadata and OnSale/InStock products.</strong></p>\n</li>\n<li>\n<p><strong>Show filters as images, ranges with Display Type option.</strong></p>\n</li>\n<li>\n<p><strong>Customize range with Min and Max value. Create as many ranges as you want with the Range type.</strong></p>\n</li>\n<li>\n<p><strong>With Filter By Metadata, we provide meta keys of Products available in the database. Manage at settings and the<br />\nplugin will display corresponding meta value.</strong></p>\n</li>\n<li>\n<p><strong>Set rules to display Filter Menu at Display Conditions.</strong></p>\n</li>\n<li>\n<p><strong>6 months premium support from VillaTheme</strong>: We will help you if you have any problem with the plugin Free Shipping Bar for WooCommerce.</p>\n</li>\n</ul>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Customers can order and pay before it&#8217;s intended release date to guarantee a copy.</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"https://docs.villatheme.com/?item=pofily\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"https://docs.villatheme.com/?item=pofily\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/pofily-woo-product-filters.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "product-filter-for-woocommerce": "product filter for woocommerce",
        "woocommerce-filter-plugin": "woocommerce filter plugin",
        "woocommerce-filters": "woocommerce filters",
        "woocommerce-product-filter-plugin": "woocommerce product filter plugin",
        "woocommerce-product-filters": "woocommerce product filters"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://www.villatheme.com/donate",
    "banners": {
        "low": "https://ps.w.org/pofily-woo-product-filters/assets/banner-772x250.jpg?rev=3080883",
        "high": "https://ps.w.org/pofily-woo-product-filters/assets/banner-1544x500.jpg?rev=3080883"
    },
    "icons": {
        "1x": "https://ps.w.org/pofily-woo-product-filters/assets/icon-128x128.gif?rev=3089826"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 96,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "pofily-woo-product-filters",
            "language": "vi",
            "version": "1.1.1",
            "updated": "2022-12-10 08:35:37",
            "package": "https://downloads.wordpress.org/translation/plugin/pofily-woo-product-filters/1.1.1/vi.zip"
        }
    ]
}