{
    "name": "Poll Maker &#8211; Versus Polls, Anonymous Polls, Image Polls",
    "slug": "poll-maker",
    "version": "5.4.2",
    "author": "<a href=\"https://ays-pro.com/\">Poll Maker Team</a>",
    "author_profile": "https://profiles.wordpress.org/ays-pro/",
    "contributors": {
        "ays-pro": {
            "profile": "https://profiles.wordpress.org/ays-pro/",
            "avatar": "https://secure.gravatar.com/avatar/687e43a4a0037eb881d2028efa919d9e?s=96&d=monsterid&r=g",
            "display_name": "ays-pro"
        }
    },
    "requires": "4.0",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 84,
    "ratings": {
        "5": 55,
        "4": 4,
        "3": 4,
        "2": 4,
        "1": 9
    },
    "num_ratings": 76,
    "support_url": "https://wordpress.org/support/plugin/poll-maker/",
    "support_threads": 4,
    "support_threads_resolved": 3,
    "active_installs": 6000,
    "downloaded": 433212,
    "last_updated": "2024-09-10 08:19:00",
    "added": "2018-11-15",
    "homepage": "https://ays-pro.com/wordpress/poll-maker/",
    "sections": {
        "description": "<h3>WordPress Poll Plugin</h3>\n<ul>\n<li><a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">WordPress Poll plugin pricing</a></li>\n<li><a href=\"https://poll-plugin.com/wordpress-poll-plugin-free-demo/\" rel=\"nofollow ugc\">Poll Maker Free Demo</a></li>\n<li><a href=\"https://poll-plugin.com/wordpress-poll-plugin-pro-demo/\" rel=\"nofollow ugc\">Poll Maker Pro Demo</a></li>\n<li><a href=\"https://ays-pro.com/wordpress-poll-maker-user-manual\" rel=\"nofollow ugc\">Poll Maker Pro Documentation</a></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/RDKZXFmG6Pc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">WordPress Poll plugin</a> is developed to build awesome polls and conduct interactive elections super easily and quickly.</p>\n<p>Our WordPress Polling Plugin gives impressive tools to create <strong>powerful and simple polls</strong>. You have 5 poll types to choose from, advanced settings, dozens of style options included 7 pre-build themes, and many more functionalities a professional poll builder will wish for. Looking for the <strong>best poll plugin for WordPress</strong> via which you can create a poll in minutes? You are in the right place!</p>\n<p>Create and publish your first poll in <em>3 simple steps</em>:</p>\n<ul>\n<li>Click on the <em>Add new</em> button on the <em>Polls</em> page,</li>\n<li>Choose the <em>type</em>, and fill out other necessary information such as a <em>question, answers, etc.</em></li>\n<li>Save it and copy the generated <em>shortcode</em> and insert it into any post or page to make your poll public.</li>\n</ul>\n<blockquote>\n<p><strong>Poll shortcode</strong><br />\n  <strong>[ays_poll id=&#8217;your_poll_id&#8217;]</strong></p>\n</blockquote>\n<p>Data is an essential part of any business process, don&#8217;t you agree? Data-oriented companies are the most successful ones nowadays. So, if you want to compete with them, you need to have this <strong>lead generator tool</strong> at your disposal. You need to imply the &#8220;give and take&#8221; rule: provide <em>interactive content</em> to your audience and <em>get new leads</em>.<br />\nThe benefits of receiving new leads are many:</p>\n<ul>\n<li><strong>Increase the traffic</strong> of your website</li>\n<li>Use the plugin as an effective marketing tool and build your <strong>Social Media strategy</strong> based on it: email marketing, SMM marketing,  etc.</li>\n<li>Receive customer feedback, do <strong>market research</strong>, and improve your services and products</li>\n<li>Get insights and take action: create an <strong>opinion poll</strong>, know more about your customers&#8217; habits, preferences, interests, and so on.</li>\n</ul>\n<p><strong><a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">PRO</a>|<a href=\"https://poll-plugin.com/wordpress-poll-plugin-pro-demo/\" rel=\"nofollow ugc\">DEMO</a>|<a href=\"https://ays-pro.com/wordpress-poll-maker-user-manual\" rel=\"nofollow ugc\">DOCUMENTATION</a></strong></p>\n<h3>WordPress Poll maker plugin features, advantages</h3>\n<h4>Poll question</h4>\n<p>There is a default <strong>WordPress classic editor</strong> for adding and editing the question. You can use it for formatting your question text. Most importantly, it allows you to create an <em>image poll, video poll or audio poll</em>. If you have CSS or HTML skills, you are free to write your own code and design your question the way you wish it to be. Moreover, you can insert a shortcode of any other plugin easily. This WordPress Vote plugin&#8217;s developers continually do their best to build the <em>Best WordPress Poll Plugin</em> ever. All you need is to grab the chance and give it a try!</p>\n<h4>Poll types</h4>\n<p>This WordPress Poll plugin allows you to make 7 types of online polls:</p>\n<ul>\n<li><strong>Choosing</strong> &#8211; You can add as many options for choosing as you want. There is also an option that allows users to add their custom option(Pro).</li>\n<li><strong>Rating</strong> &#8211; With this type, you can make voting forms with rating a single product. It allows you to choose the type of rating: <strong>with stars or with emojis</strong>. It depends on the subject you want to examine.</li>\n<li><strong>Voting</strong> &#8211; With this type, you can make voting forms with voting. Here are again two types: <strong>like/dislike</strong> or emojis. It is an easy way to understand users love your product or not.</li>\n<li><strong>Dropdown</strong> (Available only in <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Pro version</a>) &#8211; You need to write the possible answers in the field of &#8216;Answers&#8217;, which are 2 by default. The participants need to choose one answer from a list of choices presented in a dropdown menu.</li>\n<li><strong>Range</strong> (Available only in <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Pro version</a>) &#8211; It allows a participant to select answers in 1-100 range.</li>\n<li><strong>VS (versus)</strong> (Available only in <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Pro version</a>) &#8211; This is the type of competition with two products or persons. There are awesome styles for making versus votes.</li>\n<li><strong>Text</strong> (Available only in <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Pro version</a>) &#8211; Get the most detailed responses. Give poll participants the opportunity to provide full answers to your questions, using both Short Text answers and Paragraphs.</li>\n</ul>\n<p><strong>Poll Demos (Free)</strong></p>\n<ul>\n<li><a href=\"https://poll-plugin.com/choosing-poll/\" rel=\"nofollow ugc\">Choosing Poll</a></li>\n<li><a href=\"https://poll-plugin.com/voting-poll/\" rel=\"nofollow ugc\">Voting Poll</a></li>\n<li><a href=\"https://poll-plugin.com/rating-poll/\" rel=\"nofollow ugc\">Rating Poll</a></li>\n<li><a href=\"https://poll-plugin.com/audio-poll/\" rel=\"nofollow ugc\">Audio Poll</a></li>\n<li><a href=\"https://poll-plugin.com/video-poll-2/\" rel=\"nofollow ugc\">Video Poll</a></li>\n</ul>\n<p><strong>Poll Demos (Pro)</strong></p>\n<ul>\n<li><a href=\"https://poll-plugin.com/anonymous-polls-dropdown-type/\" rel=\"nofollow ugc\">Anonymous Polls</a></li>\n<li><a href=\"https://poll-plugin.com/versus-poll-versus-type/\" rel=\"nofollow ugc\">Versus Poll</a></li>\n<li><a href=\"https://poll-plugin.com/slider-rating-polls-slider-type/\" rel=\"nofollow ugc\">Slider Rating Polls</a></li>\n<li><a href=\"https://poll-plugin.com/open-ended-question-polls-text-type/\" rel=\"nofollow ugc\">Open-Ended question Polls</a></li>\n<li><a href=\"https://poll-plugin.com/image-choosing/\" rel=\"nofollow ugc\">Image Poll</a></li>\n</ul>\n<p><strong>Multivote functionality</strong>: By selecting <em>Choosing</em> type, you can also activate <em>Multivote functionality</em>. It allows your respondents to choose more than one answer to your question. Moreover, you can give a maximum number to it, so your respondents can not vote more than the assigned count of answers to the given question.</p>\n<h4>Notify admin by email</h4>\n<p>With our Vote plugin, you can be notified via email each time a vote is submitted. All you need is to enable the <strong>Results notification</strong> by email option from your form&#8217;s settings and enter your email address in the corresponding field. It allows you to be informed and doesn&#8217;t check your admin dashboard frequently.</p>\n<p>Save your time, and in the meantime, be informed with our <strong>WordPress Voting Plugin</strong>!</p>\n<h4>Redirection (Individual and Global)</h4>\n<p>Redirection is a super-effective technique to <strong>boost your website traffic</strong>. Attract your website visitors via engaging polls and after voting, redirect them to another webpage. You can either redirect no matter the answer they give or redirect based on their answer. The latter one is a powerful <strong>call-to-action</strong> trick. For instance, if you are selling books, you can make a question like <em>What book genre is your personality?</em>. Then, redirect the participants to different book pages based on their answers. This a great marketing idea, isn&#8217;t it?</p>\n<h4>Schedule Poll</h4>\n<p>Now there is wide used function: <strong>schedule</strong>. We also include this function in our poll builder plugin.</p>\n<p>It saves a mass of time. For example, if you are going to make an election in the near future, you don&#8217;t need to remember and set the alarm for that. You can make it right now and set a start date for displaying it.</p>\n<p>Also, it is important to set an end date for the vote, as long as you may need to check product ratings for a <strong>specific period of time</strong>. The plugin will show the expiring message after the end date, which is provided from the dashboard. #1 poll plugin for WP, don&#8217;t you agree?<br />\nMoreover, you can create a <a href=\"https://www.youtube.com/watch?v=uMwBPfrFkng&amp;\" rel=\"nofollow ugc\">WordPress event poll</a> and schedule it to get people engaged at a certain date.</p>\n<h4>Limit by User Roles</h4>\n<p>This feature allows you to select <strong>specific user roles</strong> for displaying your online form. Only users with the selected user group can take it. Also, you can set the restriction that only logged-in users have permission to take the form. There is a message parameter for every option.</p>\n<h4>Limit to vote only once</h4>\n<p>Want to have <strong>accurate results</strong>? This online voting tool give it to you! By activating the <em>Maximum number of attempts per user</em> option, you will not receive multiple votes from the same person. The plugin offers 4 detection methods: <em>By IP address, by WP user ID, by Cookie, by Cookie and IP</em>.</p>\n<h4>Password Protected Poll</h4>\n<p>Create a password-protected poll to ensure privacy, limit participation to only authorized individuals, and safeguard sensitive information or opinions shared during the polling process. This security feature can be useful when the poll involves confidential information, or when the poll is intended for a specific audience or group of individuals. The given feature is available in the <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">premium version</a> of the plugin.</p>\n<h4>Results page on the front-end</h4>\n<p>The plugin lets you configure the result page and customize it on your own. You can either hide the results or display them instantly after the voting. You can choose the way of sorting the results: <em>Ascending, Descending, or none</em>. To make your form more engaging, you can activate the <em>Show passed users avatars</em> option. It will display the profile pictures of those users who have taken your voting form. You can type in your preferred thank you message, for instance, <em>Thank you for taking the time to complete this form</em>. Besides, the plugin allows you to <strong>display different result messages</strong> based on the answer the voter chooses (<a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Premium feature</a>). Each voter will see an individual message most relevant to him.  Amazing, isn&#8217;t it?</p>\n<p>Want to visualize the result via interactive and beautiful charts? No problem at all! The plugin gives that opportunity. It allows you to show your results via the following charts: <strong>Bar chart, Pie chart, Column chart, and Versus chart</strong>. Available in the <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Premium version</a>. More are coming!</p>\n<h4>Information form with custom fields</h4>\n<p>Want to get more info from your website visitors with the <strong>WP poll plugin</strong>? It is possible with the help of our plugin. Please note that the functionality is available only in the <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Pro version</a>. You can add information form to your poll. After or before taking the choice, the user must fill in his information like <strong>name, email, phone</strong>, or any other information you have added into the form. So it is a handy tool for collecting user&#8217;s data and using it for your marketing.</p>\n<h4>Anonymous polls</h4>\n<p>Do not want to trace the data to an individual participant? Anonymity is an inseparable part of research conducting, particularly in Europe. After activating the <em>allow anonymity</em> option, WP User and the User IP will not be collected in your database.  Furthermore, <a href=\"https://www.youtube.com/watch?v=JrTkFtliTVQ\" rel=\"nofollow ugc\">anonymous feedback</a> can give valuable and more accurate answers. Protect the rights of your participants <strong>under GDPR</strong> with us. Please note that the option is available on the <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Premium version</a>.</p>\n<h4>Templates and style options</h4>\n<p>This <em>WordPress election voting plugin</em> has 7 awesome templates (4 of them available only in the <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Pro version</a>). You can choose your preferred template and customize it with style options in our free online poll maker plugin. There are <strong>30+ style options</strong> for customizing the design. You can customize colors, images, borders, backgrounds.</p>\n<h4>Additional functionalities(Shortcodes)</h4>\n<p>This plugin offers several additional functionalities in the form of shortcodes. The <em>shortcode for all polls</em> will print all published polls after each other. So your website visitors can participate in all your polls simultaneously. The <em>Shortcode result by ID</em> will display only the result page of the particular form. Assume that it is already over and you want to show the results to your participants. In that case, this shortcode will be of help to you. You can choose to show the results via interactive charts: <strong>Bar chart, Pie chart,</strong> or <strong>Column chart</strong>. Other two awesome shortcodes that the plugin offers are the <em>Categories shortcode</em> and <em>Global leaderboard</em>. The latter one prints the list of top users who have voted your forms.</p>\n<h4>Social sharing</h4>\n<p>The social share opportunity is another awesome option that this WordPress Poll plugin offers you. By enabling the option,  the responders will be able to share the voting form to their social accounts: Facebook, Twitter, and LinkedIn. This will have a huge impact on the awareness and popularity of your form. Moreover, it will boost the traffic to your website. It is Great, isn&#8217;t it?</p>\n<h4>Mailchimp integration</h4>\n<p>MailChimp is a powerful online tool for <strong>email marketing</strong>. We&#8217;ve made integration with Mailchimp, which allows you to collect users&#8217; emails automatically. It saves a lot of time and allows you to make a huge community.</p>\n<h4>Voting Plugin</h4>\n<p>Use a voting form to engage your audience, gather information, and improve your company. Gain insights into topics like upcoming elections or office leadership while promoting democracy. With our image poll WordPress plugin, run photo contests and gather user feedback to enhance your features. Make interesting poll questions, diversify answer options, and choose the best WordPress voting plugin for optimal engagement.</p>\n<p><strong>Features</strong></p>\n<ul>\n<li>Poll types &#8211; choosing, rating, voting</li>\n<li>Unlimited polls</li>\n<li>Unlimited answers</li>\n<li>Unlimited results</li>\n<li>Different icons</li>\n<li>Categorize polls</li>\n<li>Category-multiple view</li>\n<li>Reports in dashboard</li>\n<li>Social share buttons</li>\n<li>Notification by e-mail</li>\n<li>Limit users rate once</li>\n<li>Only for logged in users option</li>\n<li>Limit by user roles</li>\n<li>Style settings (10+)</li>\n<li>Two themes</li>\n<li>Live preview</li>\n</ul>\n<p><strong><a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">PRO</a> Features</strong></p>\n<ul>\n<li>Includes ALL Free version Features and</li>\n<li>VS type of poll (versus)</li>\n<li>User information form</li>\n<li>Ability to add custom option</li>\n<li>Extra 4 themes</li>\n<li>Results with charts</li>\n<li>Export results to CSV</li>\n<li>Custom Form Fields</li>\n<li>Text instead of results</li>\n<li>Vote reason option</li>\n<li>Voted user location</li>\n<li>Import/Export polls</li>\n<li>Anonymous poll</li>\n<li>Allow multivote</li>\n<li><a href=\"https://www.youtube.com/watch?v=y9yu9Md4vCs&amp;\" rel=\"nofollow ugc\">Password protected poll</a></li>\n<li>Vote session</li>\n<li>Send mail to user</li>\n<li>Messages based on answers</li>\n<li>Display category shortcode</li>\n<li>User History shortcode</li>\n<li>Leaderboard</li>\n<li>Poll creation by user</li>\n<li>Summary emails</li>\n<li>Copy protection</li>\n<li>Multilingual polls</li>\n<li>Text to speech</li>\n<li>More on the way &#8230;</li>\n</ul>\n<p><strong>Connect with your Favorite Tools</strong> (<a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">PRO</a>)</p>\n<ul>\n<li>MailChimp integration</li>\n<li>Campaign Monitor integration</li>\n<li>Zapier integration</li>\n<li>ActiveCampaign integration</li>\n<li>Slack integration</li>\n<li>SendGrid integration</li>\n<li>GamiPress integration</li>\n<li>Mad Mimi integration</li>\n<li>ConvertKit integration</li>\n<li>GetResponse integration</li>\n<li>Google sheet integration</li>\n<li>Klaviyo integration</li>\n<li>MyCred integration</li>\n<li>Aweber integration</li>\n<li>Mailpoet integration</li>\n</ul>\n<h4>Easy to Use</h4>\n<p>If you want to create powerful and simple polls, it is essential to have a tool like this <strong>Poll &amp; Vote Plugin</strong> at your disposal.</p>\n<p>Searching on <em>how to make a poll on your website?</em> Feel free to check out the following <a href=\"https://ays-pro.com/wordpress-poll-maker-user-manual\" rel=\"nofollow ugc\">User Manual</a>.</p>\n<p>This <em>WordPress easy polling plugin</em> also has a widget possibility, and while installing the plugin, the widget is also installed. Many websites are most likely to place the form on the sidebar keeping it dominant. So your clients do not need to waste their time participating in some elections; they just do it on the spot with one click, which provides a huge amount of results.<br />\nBy the way, we have created an awesome <a href=\"https://ays-pro.com/wordpress/survey-maker/\" rel=\"nofollow ugc\">Survey Maker plugin for WordPress</a>.</p>\n<p><strong>New Chart Builder plugin:</strong> Create static and dynamic charts for your WordPress website using our <a href=\"https://wordpress.org/plugins/chart-builder/\" rel=\"ugc\">WordPress Chart plugin</a>. Transfer your data into charts easily.</p>\n<p>Don&#8217;t forget that, in case of any problems or upcoming questions, please contact us via this <a href=\"https://wordpress.org/support/plugin/poll-maker/\" rel=\"ugc\">FREE SUPPORT FORUM</a>.</p>\n<p><strong>Other plugins from Ays Pro Team</strong></p>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/quiz-maker/\" rel=\"ugc\">Quiz Maker</a> for creating advanced quizzes and exams easily and quickly.</li>\n<li><a href=\"https://wordpress.org/plugins/survey-maker/\" rel=\"ugc\">Survey Maker</a> for collecting data and analyze it.  </li>\n<li><a href=\"https://wordpress.org/plugins/ays-popup-box/\" rel=\"ugc\">Popup Box</a>, an easy way to create eye-catching and engaging popups. </li>\n<li><a href=\"https://wordpress.org/plugins/secure-copy-content-protection/\" rel=\"ugc\">Secure Copy Content Protection</a> to protect web content from being plagiarized.</li>\n<li><a href=\"https://wordpress.org/plugins/chart-builder/\" rel=\"ugc\">Chartify</a> to build both static and dynamic charts, graphs and diagrams. </li>\n<li><a href=\"https://wordpress.org/plugins/easy-form/\" rel=\"ugc\">Easy Form</a> to create various forms for your website. </li>\n<li><a href=\"https://wordpress.org/plugins/ays-chatgpt-assistant/\" rel=\"ugc\">AI ChatBot</a> to generate high-quality content for your blog, and finding the answer to any questions in seconds.</li>\n<li><a href=\"https://wordpress.org/plugins/personal-dictionary/\" rel=\"ugc\">Personal Dictionary</a> to create and organize their vocabulary lists, study and memorize the words. </li>\n<li><a href=\"https://wordpress.org/plugins/ays-slider/\" rel=\"ugc\">Image Slider</a> give the aility to grab your audience&#8217;s attention with amazing and entertaining slideshows.</li>\n<li><a href=\"https://wordpress.org/plugins/ays-random-posts-and-pages/\" rel=\"ugc\">Random Posts and Pages Widget</a> for creating internal links and encouraging visitor engagement on your website.</li>\n<li><a href=\"https://wordpress.org/plugins/gallery-photo-gallery/\" rel=\"ugc\">Photo Gallery</a> for displaying responsive image gallery with awesome layout options.</li>\n</ul>\n",
        "installation": "<p>There are two ways to install Poll maker: the easy way, when you install Poll maker from your WordPress dashboard, and the not so easy way, when you install it from WordPress.org.</p>\n<ul>\n<li>1.1 The easiest way to enjoy Poll Maker:</li>\n<li>1.1.1 Login to your WordPress dashboard</li>\n<li>1.1.2 Go to Plugins</li>\n<li>1.1.3 Add New</li>\n<li>1.1.4 Search for Poll maker</li>\n<li>1.1.5 Click to install</li>\n<li>1.2 The second way:</li>\n<li>1.2.1Download the zip file from https://wordpress.org/plugins/poll-maker/</li>\n<li>1.2.2 Go to Plugins</li>\n<li>1.2.3 Add New</li>\n<li>1.2.4 Upload plugin</li>\n<li>1.2.5 Choose file ays poll_maker.zip</li>\n<li>\n<p>1.2.6 Click to install</p>\n</li>\n<li>\n<p>1.3 In order to install the Poll maker from WordPress.org you must unzip the archive and copy the poll-maker folder into your plugins folder (\\wp-content\\plugins).<br />\nAfter one ofthis steps you can activate the plugin from the Plugins menu.<br />\nOnce activated configure any options as desired and you can enjoy our Poll maker.</p>\n</li>\n</ul>\n",
        "faq": "\n<dt id='1.%20how%20can%20i%20add%20a%20poll%20in%20my%20site%3F'>\n1. How can I add a Poll in my site?\n</h4>\n<p>\n<p>At first, you need to install the plugin and create a Poll in it. After it, a shortcode will be<br />\ngenerated which you can add wherever you want in your site. And then you can see your Poll.</p>\n</p>\n<dt id='2.%20are%20there%20any%20limitations%20in%20the%20way%20of%20making%20questions%20for%20poll.'>\n2. Are there any limitations in the way of making questions for Poll.\n</h4>\n<p>\n<p>The plugin has no limitation in the way of making questions Poll. You can make a Poll<br />\nyourself and can add as many Polls as you want. And, you can construct any kind of Poll<br />\nquestion such as video, photo, audio, etc. And you can insert whatever you want with shortcodes.</p>\n</p>\n<dt id='3.%20can%20i%20add%20the%20same%20poll%20in%20different%20pages%3F'>\n3. Can I add the same poll in different pages?\n</h4>\n<p>\n<p>Yes, of course. You can add the same Poll at the same time in different pages of the site. You<br />\ncan also add the Polls in widgets on sidebar. And this does not interrupt the traffic of your site.</p>\n</p>\n<dt id='4.%20how%20to%20check%20the%20results%20in%20poll%3F'>\n4. How to check the results in Poll?\n</h4>\n<p>\n<p>After the installation of the plugin you will need to open settings (&#8220;Poll maker&#8221; in dashboard)<br />\nand entering &#8220;Results&#8221; section you will find the results of your Poll with the help of filters.</p>\n</p>\n<dt id='5.%20how%20many%20types%20are%20there%20in%20the%20poll%3F'>\n5. How many types are there in the Poll?\n</h4>\n<p>\n<p>Our Poll has the following types: voting, choosing, rating (rating-emoji, rating-stars)</p>\n</p>\n<dt id='6.%20what%20shall%20i%20do%20in%20case%20of%20any%20problem%3F'>\n6. What shall I do in case of any problem?\n</h4>\n<p>\n<p>Our support team works very hard to provide answers within 24 hours. We do our best for<br />\ngiving you thorough answers. For the future, we also plan many new and fantastic features and,<br />\nof course, new updates.</p>\n</p>\n<dt id='7.%20how%20can%20i%20add%20a%20poll%20on%20the%20widget%3F'>\n7. How can I add a poll on the widget?\n</h4>\n<p>\n<p>There are two Polls set by default in our plugin. For adding a Poll in widget you need to<br />\nfollow the instruction: Go to the widget section and if you have a Poll in our plugin, you will see<br />\nthere our widget. Then put it on the sidebar and select the Poll and a width for it. Afterward, we<br />\ncan say that it is a widget poll.</p>\n</p>\n<dt id='8.%20where%20can%20i%20find%20a%20demo%20for%20this%20wordpress%20poll%20plugin%3F'>\n8. Where can I find a demo for this WordPress Poll Plugin?\n</h4>\n<p>\n<p>Check out the WordPress <a href=\"https://poll-plugin.com/wordpress-poll-plugin-free-demo/\" rel=\"nofollow ugc\">Poll plugin Free Demo</a> page to find all the advanced features the plugin offers.</p>\n</p>\n<dt id='9.%20can%20i%20collect%20personal%20information%20from%20my%20poll%20voters%3F'>\n9. Can I collect personal information from my poll voters?\n</h4>\n<p>\n<p>Sure! In order to achieve this, head to the <strong>Polls page &gt; particular poll &gt; User Data</strong> tab and tick the <strong>Enable Information Form</strong> option.<br />\nThen, select which fields the user should fill out.</p>\n</p>\n<dt id='10.%20how%20to%20change%20the%20ready-made%20template%2Ftheme%3F'>\n10. How to change the ready-made template/theme?\n</h4>\n<p>\n<p>Want to change the style of the poll? Then, head to the <strong>Polls page &gt; particular poll &gt; Styles</strong> tab.<br />\nSelect your preferred, ready-to-use template and customize it with the styling options available in the plugin.</p>\n</p>\n<dt id='11.%20is%20there%20any%20documentation%20or%20user%20guide%20for%20this%20poll%20plugin%3F'>\n11. Is there any documentation or user guide for this poll plugin?\n</h4>\n<p>\n<p>Sure, there is! Check out our <a href=\"https://ays-pro.com/wordpress-poll-maker-user-manual\" rel=\"nofollow ugc\">official documentation(user guide)</a> to find all the features/functionalities the plugin includes.<br />\nThere you can see the detailed descriptions of the options, instructions for their usage, video guides, the installation process of the plugin, etc.<br />\nBy the way, you are welcome to contact us via the <a href=\"https://wordpress.org/support/plugin/poll-maker/\" rel=\"ugc\">Free Support Forum</a> in case of having any questions/queries.</p>\n</p>\n<dt id='12.%20how%20to%20upgrade%20to%20the%20poll%20pro%20version%20without%20losing%20my%20data%3F'>\n12. How to upgrade to the Poll PRO version without losing my data?\n</h4>\n<p>\n<p>All you need to do is to click on the <strong>Upgrade</strong> button (instead of the Deactivate) when deactivating the plugin.<br />\nBy this, you will save your already created data (quizzes with questions). You can check out the <a href=\"https://ays-pro.com/how-to-update-upgrade-ays-pro-plugins\" rel=\"nofollow ugc\">Update Guide</a> for further information.</p>\n</p>\n\n",
        "changelog": "<h4>5.4.2</h4>\n<ul>\n<li>Added: Info Text for the Elementor and Gutenberg blocks preview</li>\n<li>Improved: Some styles on the admin dashboard</li>\n</ul>\n<h4>5.4.1</h4>\n<ul>\n<li>Fixed: Issue connected to the poll title</li>\n<li>Updated: POT file</li>\n</ul>\n<h4>5.4.0</h4>\n<ul>\n<li>Added: Expand/Collapse functionality for polls options on the Polls page</li>\n</ul>\n<h4>5.3.9</h4>\n<ul>\n<li>Improved: Styles on the admin dashboard</li>\n</ul>\n<h4>5.3.8</h4>\n<ul>\n<li>Fixed: Issue connected to the allow multivote option</li>\n<li>Fixed: Some style issues on the front page</li>\n</ul>\n<h4>5.3.7</h4>\n<ul>\n<li>Fixed: Polls search box issue on polls list table</li>\n<li>Fixed: Some styles on the admin dashboard</li>\n</ul>\n<h4>5.3.6</h4>\n<ul>\n<li>Added: Autofill logged-in user data option</li>\n<li>Tested: Compatible up to 6.6.1</li>\n</ul>\n<h4>5.3.5</h4>\n<ul>\n<li>Added: Poll main URL option</li>\n<li>Tested: Compatible up to 6.6</li>\n</ul>\n<h4>5.3.4</h4>\n<ul>\n<li>Fixed: Translation issues</li>\n<li>Fixed: Poll alignment issue on the front page</li>\n</ul>\n<h4>5.3.3</h4>\n<ul>\n<li>Fixed: Style issues on the front page</li>\n<li>Fixed: PHP issue on the each results list table</li>\n</ul>\n<h4>5.3.2</h4>\n<ul>\n<li>Improved: Plugin performance on the admin dashboard</li>\n<li>Tested: Compatible up to 6.5.5</li>\n</ul>\n<h4>5.3.1</h4>\n<ul>\n<li>Fixed: Style issues on the front page</li>\n<li>Fixed: Style issues on the admin dashboard</li>\n<li>Updated: POT file</li>\n</ul>\n<h4>5.3.0</h4>\n<ul>\n<li>Improved: Some Styles on the admin dashboard</li>\n<li>Fixed: User IP security issue</li>\n</ul>\n<h4>5.2.9</h4>\n<ul>\n<li>Fixed: Issue connected to the text type poll statistics chart</li>\n<li>Fixed: Style issues on the admin dashboard</li>\n<li>Tested: Compatible up to 6.5.4</li>\n</ul>\n<h4>5.2.8</h4>\n<ul>\n<li>Fixed: Issue connected to the poll text type</li>\n</ul>\n<h4>5.2.7</h4>\n<ul>\n<li>Fixed: Style issue on the admin dashboard</li>\n<li>Fixed: Issue connected to the poll categories shortcode</li>\n</ul>\n<h4>5.2.6</h4>\n<ul>\n<li>Fixed: Issue connected to the poll text type</li>\n</ul>\n<h4>5.2.5</h4>\n<ul>\n<li>Fixed: Translation issues on the admin dashboard</li>\n<li>Fixed: Some issues on the front page</li>\n</ul>\n<h4>5.2.4</h4>\n<ul>\n<li>Fixed: Translation issues on the admin dashboard</li>\n<li>Updated: POT file</li>\n</ul>\n<h4>5.2.3</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Tested: Compatible up to 6.5.3</li>\n</ul>\n<h4>5.2.2</h4>\n<ul>\n<li>Improved: Footer Style on the admin dashboard</li>\n</ul>\n<h4>5.2.1</h4>\n<ul>\n<li>Fixed: Issues connected to the poll fonts on the front page</li>\n</ul>\n<h4>5.2.0</h4>\n<ul>\n<li>Fixed: Issue connected to the result message on the front page</li>\n<li>Fixed: JS issues on the admin dashboard</li>\n</ul>\n<h4>5.1.9</h4>\n<ul>\n<li>Fixed: Quick Poll security issue on the admin dashboard</li>\n<li>Fixed: Security issue connected to the change the author of the current poll option</li>\n</ul>\n<h4>5.1.8</h4>\n<ul>\n<li>Fixed: JavaScript conflict with Elementor plugin</li>\n<li>Updated: POT file</li>\n</ul>\n<h4>5.1.7</h4>\n<ul>\n<li>Changed: The polls Edit page design</li>\n</ul>\n<h4>5.1.6</h4>\n<ul>\n<li>Added: Hide results option for the Quick Poll Popup</li>\n<li>Tested: Compatible up to 6.5</li>\n</ul>\n<h4>5.1.5</h4>\n<ul>\n<li>Added: Show Author option for the Quick Poll Popup</li>\n</ul>\n<h4>5.1.4</h4>\n<ul>\n<li>Fixed: Issue with the filter by type in polls list table (PHP 7.2)</li>\n<li>Updated: POT file</li>\n</ul>\n<h4>5.1.3</h4>\n<ul>\n<li>Changed: The polls list table design</li>\n</ul>\n<h4>5.1.2</h4>\n<ul>\n<li>Added: User phone message variable on the general settings page</li>\n<li>Improved: Some styles on the admin dashboard</li>\n</ul>\n<h4>5.1.1</h4>\n<ul>\n<li>Added: Show timer at the bottom suboption to display the timer at the bottom</li>\n</ul>\n<h4>5.1.0</h4>\n<ul>\n<li>Added: The Message variables section for the Hide Results option</li>\n<li>Improved: Some styles on the admin dashboard</li>\n</ul>\n<h4>5.0.9</h4>\n<ul>\n<li>Added: User Email message variable on the general settings page</li>\n<li>Fixed: Issue connected to the result message</li>\n</ul>\n<h4>5.0.8</h4>\n<ul>\n<li>Fixed: Issue connected to the User Name message variable</li>\n<li>Updated: PO files</li>\n</ul>\n<h4>5.0.7</h4>\n<ul>\n<li>Added: User Name message variable on the general settings page</li>\n<li>Updated: PO files</li>\n</ul>\n<h4>5.0.6</h4>\n<ul>\n<li>Added: Allow not to vote option for the Quick Poll Popup</li>\n<li>Improved: Some styles on the admin dashboard</li>\n<li>Updated: POT</li>\n</ul>\n<h4>5.0.5</h4>\n<ul>\n<li>Improved: Some styles on the admin dashboard</li>\n</ul>\n<h4>5.0.4</h4>\n<ul>\n<li>Added: Information popup about the poll after creating a poll</li>\n</ul>\n<h4>5.0.3</h4>\n<ul>\n<li>Added: Allow Multivote option for the Quick Poll Popup</li>\n<li>Fixed: Issue connected to the Allow Multivote option</li>\n</ul>\n<h4>5.0.2</h4>\n<ul>\n<li>Added: Create Quick Poll functionality on the admin dashboard</li>\n</ul>\n<h4>5.0.1</h4>\n<ul>\n<li>Added: User website message variable on the general settings page</li>\n<li>Added: Italian language support</li>\n<li>Updated: POT and PO files</li>\n</ul>\n<h4>5.0.0</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Fixed: Elementor widget issue</li>\n</ul>\n<h4>4.9.9</h4>\n<ul>\n<li>Added: Cancel button on the polls edit page</li>\n<li>Fixed: Some styles on the admin dashboard</li>\n</ul>\n<h4>4.9.8</h4>\n<ul>\n<li>Improved: Message when no active polls found option on the poll categories page</li>\n<li>Fixed: Images sanitizing problem</li>\n</ul>\n<h4>4.9.7</h4>\n<ul>\n<li>Added: Confirmation box for unsaved changes on the admin dashboard</li>\n</ul>\n<h4>4.9.6</h4>\n<ul>\n<li>Fixed: Images sanitizing problem on the admin/front page</li>\n<li>Tested: Compatible up to 6.4.2</li>\n</ul>\n<h4>4.9.5</h4>\n<ul>\n<li>Improved: Some changes on the admin dashboard</li>\n<li>Updated: POT and PO files</li>\n</ul>\n<h4>4.9.4</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Fixed: Some styles on the front page</li>\n</ul>\n<h4>4.9.3</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Fixed: PHP issue on the each results list table</li>\n</ul>\n<h4>4.9.2</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n</ul>\n<h4>4.9.1</h4>\n<ul>\n<li>Improved: Some changes on the admin dashboard</li>\n</ul>\n<h4>4.9.0</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Fixed: PHP issue on the each results list table</li>\n</ul>\n<h4>4.8.9</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Fixed: Some issues on the each results list table</li>\n</ul>\n<h4>4.8.8</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n</ul>\n<h4>4.8.7</h4>\n<ul>\n<li>Fixed: Some styles on the front page</li>\n<li>Updated: POT and PO files </li>\n<li>Tested: Compatible up to 6.4.1</li>\n</ul>\n<h4>4.8.6</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Fixed: Some responsive style issues on the results list table</li>\n</ul>\n<h4>4.8.5</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Fixed: Filter and search options conflict on the polls list table</li>\n<li>Tested: Compatible up to 6.4</li>\n</ul>\n<h4>4.8.4</h4>\n<ul>\n<li>Changed: The banner style on the admin dashboard</li>\n</ul>\n<h4>4.8.3</h4>\n<ul>\n<li>Added: Type filter on the polls list table</li>\n<li>Fixed: Some styles on the admin dashboard</li>\n</ul>\n<h4>4.8.2</h4>\n<ul>\n<li>Improved: Some changes on the admin dashboard</li>\n<li>Tested: Compatible up to 6.3.2</li>\n</ul>\n<h4>4.8.1</h4>\n<ul>\n<li>Added: Height suboption for the Show results by option</li>\n<li>Fixed: Issue connected to the allow multivote option</li>\n</ul>\n<h4>4.8.0</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Improved: Ask a question button style on the admin dashboard</li>\n</ul>\n<h4>4.7.9</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Fixed: Some styles on the front page</li>\n</ul>\n<h4>4.7.8</h4>\n<ul>\n<li>Fixed: Banner timer issue on the admin dashboard</li>\n<li>Fixed: Some issues conected to the loading effect size option</li>\n<li>Fixed: Some issues conected to the allow custom answer option</li>\n</ul>\n<h4>4.7.7</h4>\n<ul>\n<li>Added: Confirmation Box before removing the polls/results and categories</li>\n<li>Fixed: Some styles on the admin dashboard</li>\n</ul>\n<h4>4.7.6</h4>\n<ul>\n<li>Fixed: Banner security issue on the admin dashboard</li>\n<li>Fixed: Some issues connected to the allow custom answer option</li>\n</ul>\n<h4>4.7.5</h4>\n<ul>\n<li>Added: Author filter on the polls list table</li>\n<li>Fixed: Responsive problem on the admin dashboard</li>\n<li>Tested: Compatible up to 6.3.1</li>\n</ul>\n<h4>4.7.4</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Fixed: Issue connected to the create post for poll option</li>\n</ul>\n<h4>4.7.3</h4>\n<ul>\n<li>Added: 7 and 10-star rating options for the Rating Poll Type</li>\n<li>Improved: Styles on the admin dashboard</li>\n<li>Tested: Compatible up to 6.3</li>\n</ul>\n<h4>4.7.2</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Fixed: Security issue on the front page</li>\n</ul>\n<h4>4.7.1</h4>\n<ul>\n<li>Improved: Dashboard styles</li>\n<li>Fixed: Security issue on the admin dashboard</li>\n</ul>\n<h4>4.7.0</h4>\n<ul>\n<li>Added: Detailed Popup for the poll each result</li>\n<li>Changed: The banner style on the admin dashboard</li>\n<li>Fixed: Some styles on the admin dashboard </li>\n</ul>\n<h4>4.6.9</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Improved: Min/Max values for the Allow multivote option</li>\n</ul>\n<h4>4.6.8</h4>\n<ul>\n<li>Added: Status filter on the polls list table</li>\n<li>Improved: Deactivate popup style on the plugins page</li>\n</ul>\n<h4>4.6.7</h4>\n<ul>\n<li>Added: User phone column on the poll results list table</li>\n<li>Fixed: User name user email and vote reason displaying issue on the poll results list table</li>\n<li>Fixed: Some issues on the front page</li>\n</ul>\n<h4>4.6.6</h4>\n<ul>\n<li>Fixed: Database error on the polls results page</li>\n<li>Fixed: Some styles on the admin dashboard</li>\n</ul>\n<h4>4.6.5</h4>\n<ul>\n<li>Fixed: Some styles on the admin dashboard</li>\n<li>Fixed: JS issue on the admin dashboard</li>\n<li>Fixed: The default value for the alignment option in the text type</li>\n</ul>\n<h4>4.6.4</h4>\n<ul>\n<li>Added: Introduction page for Poll Maker</li>\n<li>Added: Setup Guide</li>\n</ul>\n<h4>4.6.3</h4>\n<ul>\n<li>Added: Create post for poll Option</li>\n<li>Added: Results column on the polls list table</li>\n<li>Added: Ability to copy the shortcode from the polls list table</li>\n<li>Added: Add new submenu</li>\n<li>Added: Each poll results list table</li>\n<li>Changed: Some styles on the admin dashboard</li>\n<li>Fixed: Security issue on the poll integrations page</li>\n<li>Improved: Polls results list table</li>\n</ul>\n<h4>4.6.2</h4>\n<ul>\n<li>Added: Button background color changing option</li>\n<li>Tested: Compatible up to 6.2.2</li>\n</ul>\n<h4>4.6.1</h4>\n<ul>\n<li>Added: Option to be able to show results after schedule without button</li>\n<li>Tested: Compatible up to 6.2.1</li>\n</ul>\n<h4>4.6.0</h4>\n<ul>\n<li>Fixed: Select poll issue on the Gutenberg block</li>\n<li>Updated: POT and PO files</li>\n</ul>\n<h4>4.5.9</h4>\n<ul>\n<li>Fixed: Gutenberg block error</li>\n</ul>\n<h4>4.5.8</h4>\n<ul>\n<li>Added: Button text color changing option</li>\n</ul>\n<h4>4.5.7</h4>\n<ul>\n<li>Added: Functionality to insert message variables into the wp editor on the result message</li>\n</ul>\n<h4>4.5.6</h4>\n<ul>\n<li>Fixed: CSS style issues on the admin dashboard</li>\n<li>Tested: Compatible up to 6.2</li>\n</ul>\n<h4>4.5.5</h4>\n<ul>\n<li>Added: Title option for Poll logo</li>\n<li>Fixed: Some CSS style issues on the front-end</li>\n</ul>\n<h4>4.5.4</h4>\n<ul>\n<li>Added: Default message for text type</li>\n<li>Fixed: Some changes on the admin dashboard</li>\n</ul>\n<h4>4.5.3</h4>\n<ul>\n<li>Fixed: Code correction on the front-end</li>\n<li>Fixed: Some changes on the admin dashboard</li>\n<li>Locked: New Pro features</li>\n</ul>\n<h4>4.5.2</h4>\n<ul>\n<li>Changed: The banner style on the admin dashboard</li>\n<li>Fixed: Some changes on the admin dashboard</li>\n</ul>\n<h4>4.5.1</h4>\n<ul>\n<li>Added: Shortcode attribute for ayspoll_results to show latest result</li>\n<li>Fixed: Some changes on the admin dashboard</li>\n</ul>\n<h4>4.5.0</h4>\n<ul>\n<li>Changed: Some CSS style issues on the admin dashboard</li>\n<li>Fixed: Categories list table pagination issue</li>\n<li>Fixed: The Search box and pagination conflict on all list tables</li>\n</ul>\n<h4>4.4.9</h4>\n<ul>\n<li>Added: SVG poll icon in Gutenberg editor</li>\n<li>Fixed: Column width issue for logged-in users</li>\n<li>Updated: POT file</li>\n</ul>\n<h4>4.4.8</h4>\n<ul>\n<li>Added: Reset styles button on the admin dashboard</li>\n</ul>\n<h4>4.4.7</h4>\n<ul>\n<li>Fixed: CSS style issues on the admin dashboard</li>\n</ul>\n<h4>4.4.6</h4>\n<ul>\n<li>Added: Tooltip for Save buttons on the admin dashboard</li>\n<li>Updated: POT file</li>\n</ul>\n<h4>4.4.5</h4>\n<ul>\n<li>Changed: Some CSS style issues on the admin dashboard</li>\n</ul>\n<h4>4.4.4</h4>\n<ul>\n<li>Changed: Some CSS style issues on the admin dashboard</li>\n<li>Fixed: Vertical scrolling issue on the admin dashboard</li>\n</ul>\n<h4>4.4.3</h4>\n<ul>\n<li>Fixed: Default poll creation date in admin dashboard</li>\n<li>Updated: POT and PO files</li>\n</ul>\n<h4>4.4.2</h4>\n<ul>\n<li>Fixed: CSS style issues on the admin dashboard</li>\n</ul>\n<h4>4.4.1</h4>\n<ul>\n<li>Changed: Some CSS style issues on the admin dashboard</li>\n<li>Fixed: Poll duplication issue</li>\n</ul>\n<h4>4.4.0</h4>\n<ul>\n<li>Changed: Change the poll author option design</li>\n<li>Fixed: Some issues on the front page</li>\n</ul>\n<h4>4.3.9</h4>\n<ul>\n<li>Fixed: Multivote and answer redirection problem on the front page</li>\n<li>Fixed: Multivote and show correct answers problem on the front page</li>\n</ul>\n<h4>4.3.8</h4>\n<ul>\n<li>Fixed: CSS style issue on the admin page</li>\n</ul>\n<h4>4.3.7</h4>\n<ul>\n<li>Added: Confirmation box for deleting poll answers</li>\n<li>Fixed: CSS style issues on the admin dashboard</li>\n<li>Tested: Compatible up to 6.1.1</li>\n</ul>\n<h4>4.3.6</h4>\n<ul>\n<li>Fixed: Answer table ordering style problem</li>\n<li>Fixed: Style problem on the admin dashboard</li>\n</ul>\n<h4>4.3.5</h4>\n<ul>\n<li>Added: Redirect to another polls functionality on the polls page</li>\n<li>Fixed: Polls category problem on the results page</li>\n</ul>\n<h4>4.3.4</h4>\n<ul>\n<li>Fixed: CSS style issues on the front page</li>\n<li>Tested: Compatible up to 6.1</li>\n</ul>\n<h4>4.3.3</h4>\n<ul>\n<li>Fixed: CSS style issue on the admin dashboard</li>\n</ul>\n<h4>4.3.2</h4>\n<ul>\n<li>Fixed: CSS style issues on the admin dashboard</li>\n</ul>\n<h4>4.3.1</h4>\n<ul>\n<li>Added: Missing files</li>\n</ul>\n<h4>4.3.0</h4>\n<ul>\n<li>Added: Documentation, Free Support and Rate Us links on the plugins page</li>\n<li>Fixed: Answers redirect issue on the front page</li>\n<li>Fixed: CSS style issue on the admin dashboard</li>\n</ul>\n<h4>4.2.9</h4>\n<ul>\n<li>Added: New loading effect on the admin dashboard</li>\n<li>Added: Read/unread functionality on the results list table</li>\n<li>Fixed: CSS style issues on the admin dashboard</li>\n<li>Tested: Compatible up to 6.0.3</li>\n</ul>\n<h4>4.2.8</h4>\n<ul>\n<li>Added: Categories column on the results list table</li>\n<li>Fixed: CSS style issues on the front page</li>\n</ul>\n<h4>4.2.7</h4>\n<ul>\n<li>Fixed: CSS style issues on the front page</li>\n</ul>\n<h4>4.2.6</h4>\n<ul>\n<li>Fixed: Alignment issue on the front page</li>\n<li>Fixed: Default poll choosing issue on the admin dashboard</li>\n</ul>\n<h4>4.2.5</h4>\n<ul>\n<li>Fixed: CSS style issues on the admin dashboard</li>\n<li>Updated: POT and PO files</li>\n</ul>\n<h4>4.2.4</h4>\n<ul>\n<li>Fixed: Select poll issue on the Gutenberg editor</li>\n<li>Fixed: Translation issue on How to use submenu</li>\n<li>Tested: Compatible up to 6.0.2</li>\n</ul>\n<h4>4.2.3</h4>\n<ul>\n<li>Fixed: CSS style issues on the admin dashboard</li>\n</ul>\n<h4>4.2.2</h4>\n<ul>\n<li>Fixed: CSS style issues on the admin dashboard</li>\n</ul>\n<h4>4.2.1</h4>\n<ul>\n<li>Added: New bar chart type on the front page </li>\n</ul>\n<h4>4.2.0</h4>\n<ul>\n<li>Added: How to create a poll in one minute video on the polls page</li>\n<li>Fixed: CSS style issue on admin dashboard</li>\n</ul>\n<h4>4.1.9</h4>\n<ul>\n<li>Fixed: CSS style issues on admin dashboard</li>\n</ul>\n<h4>4.1.8</h4>\n<ul>\n<li>Changed: Poll type choosing page design</li>\n</ul>\n<h4>4.1.7.1</h4>\n<ul>\n<li>Fixed: Poll type choosing functionality issue</li>\n</ul>\n<h4>4.1.7</h4>\n<ul>\n<li>Improved: Poll type choosing functionality while adding a new poll</li>\n</ul>\n<h4>4.1.6</h4>\n<ul>\n<li>Added: User IP address message variable on the general settings</li>\n<li>Fixed: PHP problem on the result shortcode</li>\n</ul>\n<h4>4.1.5</h4>\n<ul>\n<li>Added: Current poll page link message variable on the general settings</li>\n</ul>\n<h4>4.1.4</h4>\n<ul>\n<li>Added: Show poll answers count shortcode</li>\n</ul>\n<h4>4.1.3</h4>\n<ul>\n<li>Added: All passed polls count per user message variable</li>\n</ul>\n<h4>4.1.2</h4>\n<ul>\n<li>Added: Demo links for poll types</li>\n<li>Fixed: Default poll issue on the results page</li>\n</ul>\n<h4>4.1.1</h4>\n<ul>\n<li>Changed: Community section style on the How to use page</li>\n</ul>\n<h4>4.1.0</h4>\n<ul>\n<li>Added: Youtube link to social media links option</li>\n</ul>\n<h4>4.0.9</h4>\n<ul>\n<li>Changed: Our Products submenu Interface design</li>\n</ul>\n<h4>4.0.8</h4>\n<ul>\n<li>Fixed: Share buttons heading&#8217;s shortcode problem</li>\n<li>Added: View Documentation link in admin page submenus</li>\n<li>Tested: Compatible up to 6.0</li>\n</ul>\n<h4>4.0.7</h4>\n<ul>\n<li>Changed: The banner style on the admin dashboard</li>\n</ul>\n<h4>4.0.6</h4>\n<ul>\n<li>Added: Heading for social media links option</li>\n</ul>\n<h4>4.0.5</h4>\n<ul>\n<li>Added: Social media links option</li>\n</ul>\n<h4>4.0.4</h4>\n<ul>\n<li>Added: Show current poll author shortcode on the general settings</li>\n</ul>\n<h4>4.0.3</h4>\n<ul>\n<li>Added: Next Poll category button on the Poll categories edit page</li>\n</ul>\n<h4>4.0.2</h4>\n<ul>\n<li>Added: Next Poll category button on the Poll categories edit page</li>\n<li>Fixed: PHP problem on the admin dashboard</li>\n</ul>\n<h4>4.0.1</h4>\n<ul>\n<li>Added: Poll pass count message variable</li>\n</ul>\n<h4>4.0.0</h4>\n<ul>\n<li>Added: Show poll categories titles shortcode</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Added: Default poll with type Rating</li>\n<li>Added: Apply button when user trying to add new poll</li>\n<li>Fixed: Activation problem</li>\n</ul>\n"
    },
    "short_description": "Poll Maker is a FREE WordPress poll plugin that will let you create customizable and professional online polls and voting for your WordPress website.",
    "description": "<h3>WordPress Poll Plugin</h3>\n<ul>\n<li><a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">WordPress Poll plugin pricing</a></li>\n<li><a href=\"https://poll-plugin.com/wordpress-poll-plugin-free-demo/\" rel=\"nofollow ugc\">Poll Maker Free Demo</a></li>\n<li><a href=\"https://poll-plugin.com/wordpress-poll-plugin-pro-demo/\" rel=\"nofollow ugc\">Poll Maker Pro Demo</a></li>\n<li><a href=\"https://ays-pro.com/wordpress-poll-maker-user-manual\" rel=\"nofollow ugc\">Poll Maker Pro Documentation</a></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/RDKZXFmG6Pc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">WordPress Poll plugin</a> is developed to build awesome polls and conduct interactive elections super easily and quickly.</p>\n<p>Our WordPress Polling Plugin gives impressive tools to create <strong>powerful and simple polls</strong>. You have 5 poll types to choose from, advanced settings, dozens of style options included 7 pre-build themes, and many more functionalities a professional poll builder will wish for. Looking for the <strong>best poll plugin for WordPress</strong> via which you can create a poll in minutes? You are in the right place!</p>\n<p>Create and publish your first poll in <em>3 simple steps</em>:</p>\n<ul>\n<li>Click on the <em>Add new</em> button on the <em>Polls</em> page,</li>\n<li>Choose the <em>type</em>, and fill out other necessary information such as a <em>question, answers, etc.</em></li>\n<li>Save it and copy the generated <em>shortcode</em> and insert it into any post or page to make your poll public.</li>\n</ul>\n<blockquote>\n<p><strong>Poll shortcode</strong><br />\n  <strong>[ays_poll id=&#8217;your_poll_id&#8217;]</strong></p>\n</blockquote>\n<p>Data is an essential part of any business process, don&#8217;t you agree? Data-oriented companies are the most successful ones nowadays. So, if you want to compete with them, you need to have this <strong>lead generator tool</strong> at your disposal. You need to imply the &#8220;give and take&#8221; rule: provide <em>interactive content</em> to your audience and <em>get new leads</em>.<br />\nThe benefits of receiving new leads are many:</p>\n<ul>\n<li><strong>Increase the traffic</strong> of your website</li>\n<li>Use the plugin as an effective marketing tool and build your <strong>Social Media strategy</strong> based on it: email marketing, SMM marketing,  etc.</li>\n<li>Receive customer feedback, do <strong>market research</strong>, and improve your services and products</li>\n<li>Get insights and take action: create an <strong>opinion poll</strong>, know more about your customers&#8217; habits, preferences, interests, and so on.</li>\n</ul>\n<p><strong><a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">PRO</a>|<a href=\"https://poll-plugin.com/wordpress-poll-plugin-pro-demo/\" rel=\"nofollow ugc\">DEMO</a>|<a href=\"https://ays-pro.com/wordpress-poll-maker-user-manual\" rel=\"nofollow ugc\">DOCUMENTATION</a></strong></p>\n<h3>WordPress Poll maker plugin features, advantages</h3>\n<h4>Poll question</h4>\n<p>There is a default <strong>WordPress classic editor</strong> for adding and editing the question. You can use it for formatting your question text. Most importantly, it allows you to create an <em>image poll, video poll or audio poll</em>. If you have CSS or HTML skills, you are free to write your own code and design your question the way you wish it to be. Moreover, you can insert a shortcode of any other plugin easily. This WordPress Vote plugin&#8217;s developers continually do their best to build the <em>Best WordPress Poll Plugin</em> ever. All you need is to grab the chance and give it a try!</p>\n<h4>Poll types</h4>\n<p>This WordPress Poll plugin allows you to make 7 types of online polls:</p>\n<ul>\n<li><strong>Choosing</strong> &#8211; You can add as many options for choosing as you want. There is also an option that allows users to add their custom option(Pro).</li>\n<li><strong>Rating</strong> &#8211; With this type, you can make voting forms with rating a single product. It allows you to choose the type of rating: <strong>with stars or with emojis</strong>. It depends on the subject you want to examine.</li>\n<li><strong>Voting</strong> &#8211; With this type, you can make voting forms with voting. Here are again two types: <strong>like/dislike</strong> or emojis. It is an easy way to understand users love your product or not.</li>\n<li><strong>Dropdown</strong> (Available only in <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Pro version</a>) &#8211; You need to write the possible answers in the field of &#8216;Answers&#8217;, which are 2 by default. The participants need to choose one answer from a list of choices presented in a dropdown menu.</li>\n<li><strong>Range</strong> (Available only in <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Pro version</a>) &#8211; It allows a participant to select answers in 1-100 range.</li>\n<li><strong>VS (versus)</strong> (Available only in <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Pro version</a>) &#8211; This is the type of competition with two products or persons. There are awesome styles for making versus votes.</li>\n<li><strong>Text</strong> (Available only in <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Pro version</a>) &#8211; Get the most detailed responses. Give poll participants the opportunity to provide full answers to your questions, using both Short Text answers and Paragraphs.</li>\n</ul>\n<p><strong>Poll Demos (Free)</strong></p>\n<ul>\n<li><a href=\"https://poll-plugin.com/choosing-poll/\" rel=\"nofollow ugc\">Choosing Poll</a></li>\n<li><a href=\"https://poll-plugin.com/voting-poll/\" rel=\"nofollow ugc\">Voting Poll</a></li>\n<li><a href=\"https://poll-plugin.com/rating-poll/\" rel=\"nofollow ugc\">Rating Poll</a></li>\n<li><a href=\"https://poll-plugin.com/audio-poll/\" rel=\"nofollow ugc\">Audio Poll</a></li>\n<li><a href=\"https://poll-plugin.com/video-poll-2/\" rel=\"nofollow ugc\">Video Poll</a></li>\n</ul>\n<p><strong>Poll Demos (Pro)</strong></p>\n<ul>\n<li><a href=\"https://poll-plugin.com/anonymous-polls-dropdown-type/\" rel=\"nofollow ugc\">Anonymous Polls</a></li>\n<li><a href=\"https://poll-plugin.com/versus-poll-versus-type/\" rel=\"nofollow ugc\">Versus Poll</a></li>\n<li><a href=\"https://poll-plugin.com/slider-rating-polls-slider-type/\" rel=\"nofollow ugc\">Slider Rating Polls</a></li>\n<li><a href=\"https://poll-plugin.com/open-ended-question-polls-text-type/\" rel=\"nofollow ugc\">Open-Ended question Polls</a></li>\n<li><a href=\"https://poll-plugin.com/image-choosing/\" rel=\"nofollow ugc\">Image Poll</a></li>\n</ul>\n<p><strong>Multivote functionality</strong>: By selecting <em>Choosing</em> type, you can also activate <em>Multivote functionality</em>. It allows your respondents to choose more than one answer to your question. Moreover, you can give a maximum number to it, so your respondents can not vote more than the assigned count of answers to the given question.</p>\n<h4>Notify admin by email</h4>\n<p>With our Vote plugin, you can be notified via email each time a vote is submitted. All you need is to enable the <strong>Results notification</strong> by email option from your form&#8217;s settings and enter your email address in the corresponding field. It allows you to be informed and doesn&#8217;t check your admin dashboard frequently.</p>\n<p>Save your time, and in the meantime, be informed with our <strong>WordPress Voting Plugin</strong>!</p>\n<h4>Redirection (Individual and Global)</h4>\n<p>Redirection is a super-effective technique to <strong>boost your website traffic</strong>. Attract your website visitors via engaging polls and after voting, redirect them to another webpage. You can either redirect no matter the answer they give or redirect based on their answer. The latter one is a powerful <strong>call-to-action</strong> trick. For instance, if you are selling books, you can make a question like <em>What book genre is your personality?</em>. Then, redirect the participants to different book pages based on their answers. This a great marketing idea, isn&#8217;t it?</p>\n<h4>Schedule Poll</h4>\n<p>Now there is wide used function: <strong>schedule</strong>. We also include this function in our poll builder plugin.</p>\n<p>It saves a mass of time. For example, if you are going to make an election in the near future, you don&#8217;t need to remember and set the alarm for that. You can make it right now and set a start date for displaying it.</p>\n<p>Also, it is important to set an end date for the vote, as long as you may need to check product ratings for a <strong>specific period of time</strong>. The plugin will show the expiring message after the end date, which is provided from the dashboard. #1 poll plugin for WP, don&#8217;t you agree?<br />\nMoreover, you can create a <a href=\"https://www.youtube.com/watch?v=uMwBPfrFkng&amp;\" rel=\"nofollow ugc\">WordPress event poll</a> and schedule it to get people engaged at a certain date.</p>\n<h4>Limit by User Roles</h4>\n<p>This feature allows you to select <strong>specific user roles</strong> for displaying your online form. Only users with the selected user group can take it. Also, you can set the restriction that only logged-in users have permission to take the form. There is a message parameter for every option.</p>\n<h4>Limit to vote only once</h4>\n<p>Want to have <strong>accurate results</strong>? This online voting tool give it to you! By activating the <em>Maximum number of attempts per user</em> option, you will not receive multiple votes from the same person. The plugin offers 4 detection methods: <em>By IP address, by WP user ID, by Cookie, by Cookie and IP</em>.</p>\n<h4>Password Protected Poll</h4>\n<p>Create a password-protected poll to ensure privacy, limit participation to only authorized individuals, and safeguard sensitive information or opinions shared during the polling process. This security feature can be useful when the poll involves confidential information, or when the poll is intended for a specific audience or group of individuals. The given feature is available in the <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">premium version</a> of the plugin.</p>\n<h4>Results page on the front-end</h4>\n<p>The plugin lets you configure the result page and customize it on your own. You can either hide the results or display them instantly after the voting. You can choose the way of sorting the results: <em>Ascending, Descending, or none</em>. To make your form more engaging, you can activate the <em>Show passed users avatars</em> option. It will display the profile pictures of those users who have taken your voting form. You can type in your preferred thank you message, for instance, <em>Thank you for taking the time to complete this form</em>. Besides, the plugin allows you to <strong>display different result messages</strong> based on the answer the voter chooses (<a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Premium feature</a>). Each voter will see an individual message most relevant to him.  Amazing, isn&#8217;t it?</p>\n<p>Want to visualize the result via interactive and beautiful charts? No problem at all! The plugin gives that opportunity. It allows you to show your results via the following charts: <strong>Bar chart, Pie chart, Column chart, and Versus chart</strong>. Available in the <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Premium version</a>. More are coming!</p>\n<h4>Information form with custom fields</h4>\n<p>Want to get more info from your website visitors with the <strong>WP poll plugin</strong>? It is possible with the help of our plugin. Please note that the functionality is available only in the <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Pro version</a>. You can add information form to your poll. After or before taking the choice, the user must fill in his information like <strong>name, email, phone</strong>, or any other information you have added into the form. So it is a handy tool for collecting user&#8217;s data and using it for your marketing.</p>\n<h4>Anonymous polls</h4>\n<p>Do not want to trace the data to an individual participant? Anonymity is an inseparable part of research conducting, particularly in Europe. After activating the <em>allow anonymity</em> option, WP User and the User IP will not be collected in your database.  Furthermore, <a href=\"https://www.youtube.com/watch?v=JrTkFtliTVQ\" rel=\"nofollow ugc\">anonymous feedback</a> can give valuable and more accurate answers. Protect the rights of your participants <strong>under GDPR</strong> with us. Please note that the option is available on the <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Premium version</a>.</p>\n<h4>Templates and style options</h4>\n<p>This <em>WordPress election voting plugin</em> has 7 awesome templates (4 of them available only in the <a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">Pro version</a>). You can choose your preferred template and customize it with style options in our free online poll maker plugin. There are <strong>30+ style options</strong> for customizing the design. You can customize colors, images, borders, backgrounds.</p>\n<h4>Additional functionalities(Shortcodes)</h4>\n<p>This plugin offers several additional functionalities in the form of shortcodes. The <em>shortcode for all polls</em> will print all published polls after each other. So your website visitors can participate in all your polls simultaneously. The <em>Shortcode result by ID</em> will display only the result page of the particular form. Assume that it is already over and you want to show the results to your participants. In that case, this shortcode will be of help to you. You can choose to show the results via interactive charts: <strong>Bar chart, Pie chart,</strong> or <strong>Column chart</strong>. Other two awesome shortcodes that the plugin offers are the <em>Categories shortcode</em> and <em>Global leaderboard</em>. The latter one prints the list of top users who have voted your forms.</p>\n<h4>Social sharing</h4>\n<p>The social share opportunity is another awesome option that this WordPress Poll plugin offers you. By enabling the option,  the responders will be able to share the voting form to their social accounts: Facebook, Twitter, and LinkedIn. This will have a huge impact on the awareness and popularity of your form. Moreover, it will boost the traffic to your website. It is Great, isn&#8217;t it?</p>\n<h4>Mailchimp integration</h4>\n<p>MailChimp is a powerful online tool for <strong>email marketing</strong>. We&#8217;ve made integration with Mailchimp, which allows you to collect users&#8217; emails automatically. It saves a lot of time and allows you to make a huge community.</p>\n<h4>Voting Plugin</h4>\n<p>Use a voting form to engage your audience, gather information, and improve your company. Gain insights into topics like upcoming elections or office leadership while promoting democracy. With our image poll WordPress plugin, run photo contests and gather user feedback to enhance your features. Make interesting poll questions, diversify answer options, and choose the best WordPress voting plugin for optimal engagement.</p>\n<p><strong>Features</strong></p>\n<ul>\n<li>Poll types &#8211; choosing, rating, voting</li>\n<li>Unlimited polls</li>\n<li>Unlimited answers</li>\n<li>Unlimited results</li>\n<li>Different icons</li>\n<li>Categorize polls</li>\n<li>Category-multiple view</li>\n<li>Reports in dashboard</li>\n<li>Social share buttons</li>\n<li>Notification by e-mail</li>\n<li>Limit users rate once</li>\n<li>Only for logged in users option</li>\n<li>Limit by user roles</li>\n<li>Style settings (10+)</li>\n<li>Two themes</li>\n<li>Live preview</li>\n</ul>\n<p><strong><a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">PRO</a> Features</strong></p>\n<ul>\n<li>Includes ALL Free version Features and</li>\n<li>VS type of poll (versus)</li>\n<li>User information form</li>\n<li>Ability to add custom option</li>\n<li>Extra 4 themes</li>\n<li>Results with charts</li>\n<li>Export results to CSV</li>\n<li>Custom Form Fields</li>\n<li>Text instead of results</li>\n<li>Vote reason option</li>\n<li>Voted user location</li>\n<li>Import/Export polls</li>\n<li>Anonymous poll</li>\n<li>Allow multivote</li>\n<li><a href=\"https://www.youtube.com/watch?v=y9yu9Md4vCs&amp;\" rel=\"nofollow ugc\">Password protected poll</a></li>\n<li>Vote session</li>\n<li>Send mail to user</li>\n<li>Messages based on answers</li>\n<li>Display category shortcode</li>\n<li>User History shortcode</li>\n<li>Leaderboard</li>\n<li>Poll creation by user</li>\n<li>Summary emails</li>\n<li>Copy protection</li>\n<li>Multilingual polls</li>\n<li>Text to speech</li>\n<li>More on the way &#8230;</li>\n</ul>\n<p><strong>Connect with your Favorite Tools</strong> (<a href=\"https://ays-pro.com/wordpress/poll-maker\" rel=\"nofollow ugc\">PRO</a>)</p>\n<ul>\n<li>MailChimp integration</li>\n<li>Campaign Monitor integration</li>\n<li>Zapier integration</li>\n<li>ActiveCampaign integration</li>\n<li>Slack integration</li>\n<li>SendGrid integration</li>\n<li>GamiPress integration</li>\n<li>Mad Mimi integration</li>\n<li>ConvertKit integration</li>\n<li>GetResponse integration</li>\n<li>Google sheet integration</li>\n<li>Klaviyo integration</li>\n<li>MyCred integration</li>\n<li>Aweber integration</li>\n<li>Mailpoet integration</li>\n</ul>\n<h4>Easy to Use</h4>\n<p>If you want to create powerful and simple polls, it is essential to have a tool like this <strong>Poll &amp; Vote Plugin</strong> at your disposal.</p>\n<p>Searching on <em>how to make a poll on your website?</em> Feel free to check out the following <a href=\"https://ays-pro.com/wordpress-poll-maker-user-manual\" rel=\"nofollow ugc\">User Manual</a>.</p>\n<p>This <em>WordPress easy polling plugin</em> also has a widget possibility, and while installing the plugin, the widget is also installed. Many websites are most likely to place the form on the sidebar keeping it dominant. So your clients do not need to waste their time participating in some elections; they just do it on the spot with one click, which provides a huge amount of results.<br />\nBy the way, we have created an awesome <a href=\"https://ays-pro.com/wordpress/survey-maker/\" rel=\"nofollow ugc\">Survey Maker plugin for WordPress</a>.</p>\n<p><strong>New Chart Builder plugin:</strong> Create static and dynamic charts for your WordPress website using our <a href=\"https://wordpress.org/plugins/chart-builder/\" rel=\"ugc\">WordPress Chart plugin</a>. Transfer your data into charts easily.</p>\n<p>Don&#8217;t forget that, in case of any problems or upcoming questions, please contact us via this <a href=\"https://wordpress.org/support/plugin/poll-maker/\" rel=\"ugc\">FREE SUPPORT FORUM</a>.</p>\n<p><strong>Other plugins from Ays Pro Team</strong></p>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/quiz-maker/\" rel=\"ugc\">Quiz Maker</a> for creating advanced quizzes and exams easily and quickly.</li>\n<li><a href=\"https://wordpress.org/plugins/survey-maker/\" rel=\"ugc\">Survey Maker</a> for collecting data and analyze it.  </li>\n<li><a href=\"https://wordpress.org/plugins/ays-popup-box/\" rel=\"ugc\">Popup Box</a>, an easy way to create eye-catching and engaging popups. </li>\n<li><a href=\"https://wordpress.org/plugins/secure-copy-content-protection/\" rel=\"ugc\">Secure Copy Content Protection</a> to protect web content from being plagiarized.</li>\n<li><a href=\"https://wordpress.org/plugins/chart-builder/\" rel=\"ugc\">Chartify</a> to build both static and dynamic charts, graphs and diagrams. </li>\n<li><a href=\"https://wordpress.org/plugins/easy-form/\" rel=\"ugc\">Easy Form</a> to create various forms for your website. </li>\n<li><a href=\"https://wordpress.org/plugins/ays-chatgpt-assistant/\" rel=\"ugc\">AI ChatBot</a> to generate high-quality content for your blog, and finding the answer to any questions in seconds.</li>\n<li><a href=\"https://wordpress.org/plugins/personal-dictionary/\" rel=\"ugc\">Personal Dictionary</a> to create and organize their vocabulary lists, study and memorize the words. </li>\n<li><a href=\"https://wordpress.org/plugins/ays-slider/\" rel=\"ugc\">Image Slider</a> give the aility to grab your audience&#8217;s attention with amazing and entertaining slideshows.</li>\n<li><a href=\"https://wordpress.org/plugins/ays-random-posts-and-pages/\" rel=\"ugc\">Random Posts and Pages Widget</a> for creating internal links and encouraging visitor engagement on your website.</li>\n<li><a href=\"https://wordpress.org/plugins/gallery-photo-gallery/\" rel=\"ugc\">Photo Gallery</a> for displaying responsive image gallery with awesome layout options.</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/poll-maker.5.4.2.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/poll-maker/assets/screenshot-1.gif?rev=2143754",
            "caption": "Poll Maker - front end poll preview gif"
        },
        {
            "src": "https://ps.w.org/poll-maker/assets/screenshot-2.gif?rev=2515595",
            "caption": "Poll Maker - front end poll preview"
        },
        {
            "src": "https://ps.w.org/poll-maker/assets/screenshot-3.jpg?rev=2143754",
            "caption": "Poll Maker - front end poll preview"
        },
        {
            "src": "https://ps.w.org/poll-maker/assets/screenshot-4.jpg?rev=2143754",
            "caption": "Poll Maker - dashboard polls list"
        },
        {
            "src": "https://ps.w.org/poll-maker/assets/screenshot-5.jpg?rev=2143754",
            "caption": "Poll Maker - dashboard edit poll"
        },
        {
            "src": "https://ps.w.org/poll-maker/assets/screenshot-6.jpg?rev=2143754",
            "caption": "Poll Maker - dashboard edit poll"
        },
        {
            "src": "https://ps.w.org/poll-maker/assets/screenshot-7.jpg?rev=2143754",
            "caption": "Poll Maker - dashboard edit poll style"
        },
        {
            "src": "https://ps.w.org/poll-maker/assets/screenshot-8.jpg?rev=2143754",
            "caption": "Poll Maker - dashboard poll results"
        },
        {
            "src": "https://ps.w.org/poll-maker/assets/screenshot-9.jpg?rev=2143754",
            "caption": "Poll Maker - dashboard preview gif"
        },
        {
            "src": "https://ps.w.org/poll-maker/assets/screenshot-10.jpg?rev=2143754",
            "caption": ""
        }
    ],
    "tags": {
        "poll-plugin": "poll plugin",
        "polling": "polling",
        "polls": "polls",
        "vote": "vote",
        "wordpress-poll": "WordPress poll"
    },
    "stable_tag": "5.4.2",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/poll-maker.1.0.0.zip",
        "4.0.0": "https://downloads.wordpress.org/plugin/poll-maker.4.0.0.zip",
        "4.0.1": "https://downloads.wordpress.org/plugin/poll-maker.4.0.1.zip",
        "4.0.2": "https://downloads.wordpress.org/plugin/poll-maker.4.0.2.zip",
        "4.0.3": "https://downloads.wordpress.org/plugin/poll-maker.4.0.3.zip",
        "4.0.4": "https://downloads.wordpress.org/plugin/poll-maker.4.0.4.zip",
        "4.0.5": "https://downloads.wordpress.org/plugin/poll-maker.4.0.5.zip",
        "4.0.6": "https://downloads.wordpress.org/plugin/poll-maker.4.0.6.zip",
        "4.0.7": "https://downloads.wordpress.org/plugin/poll-maker.4.0.7.zip",
        "4.0.8": "https://downloads.wordpress.org/plugin/poll-maker.4.0.8.zip",
        "4.0.9": "https://downloads.wordpress.org/plugin/poll-maker.4.0.9.zip",
        "4.1.0": "https://downloads.wordpress.org/plugin/poll-maker.4.1.0.zip",
        "4.1.1": "https://downloads.wordpress.org/plugin/poll-maker.4.1.1.zip",
        "4.1.2": "https://downloads.wordpress.org/plugin/poll-maker.4.1.2.zip",
        "4.1.3": "https://downloads.wordpress.org/plugin/poll-maker.4.1.3.zip",
        "4.1.4": "https://downloads.wordpress.org/plugin/poll-maker.4.1.4.zip",
        "4.1.5": "https://downloads.wordpress.org/plugin/poll-maker.4.1.5.zip",
        "4.1.6": "https://downloads.wordpress.org/plugin/poll-maker.4.1.6.zip",
        "4.1.7": "https://downloads.wordpress.org/plugin/poll-maker.4.1.7.zip",
        "4.1.7.1": "https://downloads.wordpress.org/plugin/poll-maker.4.1.7.1.zip",
        "4.1.8": "https://downloads.wordpress.org/plugin/poll-maker.4.1.8.zip",
        "4.1.9": "https://downloads.wordpress.org/plugin/poll-maker.4.1.9.zip",
        "4.2.0": "https://downloads.wordpress.org/plugin/poll-maker.4.2.0.zip",
        "4.2.1": "https://downloads.wordpress.org/plugin/poll-maker.4.2.1.zip",
        "4.2.2": "https://downloads.wordpress.org/plugin/poll-maker.4.2.2.zip",
        "4.2.3": "https://downloads.wordpress.org/plugin/poll-maker.4.2.3.zip",
        "4.2.4": "https://downloads.wordpress.org/plugin/poll-maker.4.2.4.zip",
        "4.2.5": "https://downloads.wordpress.org/plugin/poll-maker.4.2.5.zip",
        "4.2.6": "https://downloads.wordpress.org/plugin/poll-maker.4.2.6.zip",
        "4.2.7": "https://downloads.wordpress.org/plugin/poll-maker.4.2.7.zip",
        "4.2.8": "https://downloads.wordpress.org/plugin/poll-maker.4.2.8.zip",
        "4.2.9": "https://downloads.wordpress.org/plugin/poll-maker.4.2.9.zip",
        "4.3.0": "https://downloads.wordpress.org/plugin/poll-maker.4.3.0.zip",
        "4.3.1": "https://downloads.wordpress.org/plugin/poll-maker.4.3.1.zip",
        "4.3.2": "https://downloads.wordpress.org/plugin/poll-maker.4.3.2.zip",
        "4.3.3": "https://downloads.wordpress.org/plugin/poll-maker.4.3.3.zip",
        "4.3.4": "https://downloads.wordpress.org/plugin/poll-maker.4.3.4.zip",
        "4.3.5": "https://downloads.wordpress.org/plugin/poll-maker.4.3.5.zip",
        "4.3.6": "https://downloads.wordpress.org/plugin/poll-maker.4.3.6.zip",
        "4.3.7": "https://downloads.wordpress.org/plugin/poll-maker.4.3.7.zip",
        "4.3.8": "https://downloads.wordpress.org/plugin/poll-maker.4.3.8.zip",
        "4.3.9": "https://downloads.wordpress.org/plugin/poll-maker.4.3.9.zip",
        "4.4.0": "https://downloads.wordpress.org/plugin/poll-maker.4.4.0.zip",
        "4.4.1": "https://downloads.wordpress.org/plugin/poll-maker.4.4.1.zip",
        "4.4.2": "https://downloads.wordpress.org/plugin/poll-maker.4.4.2.zip",
        "4.4.3": "https://downloads.wordpress.org/plugin/poll-maker.4.4.3.zip",
        "4.4.4": "https://downloads.wordpress.org/plugin/poll-maker.4.4.4.zip",
        "4.4.5": "https://downloads.wordpress.org/plugin/poll-maker.4.4.5.zip",
        "4.4.6": "https://downloads.wordpress.org/plugin/poll-maker.4.4.6.zip",
        "4.4.7": "https://downloads.wordpress.org/plugin/poll-maker.4.4.7.zip",
        "4.4.8": "https://downloads.wordpress.org/plugin/poll-maker.4.4.8.zip",
        "4.4.9": "https://downloads.wordpress.org/plugin/poll-maker.4.4.9.zip",
        "4.5.0": "https://downloads.wordpress.org/plugin/poll-maker.4.5.0.zip",
        "4.5.1": "https://downloads.wordpress.org/plugin/poll-maker.4.5.1.zip",
        "4.5.2": "https://downloads.wordpress.org/plugin/poll-maker.4.5.2.zip",
        "4.5.3": "https://downloads.wordpress.org/plugin/poll-maker.4.5.3.zip",
        "4.5.4": "https://downloads.wordpress.org/plugin/poll-maker.4.5.4.zip",
        "4.5.5": "https://downloads.wordpress.org/plugin/poll-maker.4.5.5.zip",
        "4.5.6": "https://downloads.wordpress.org/plugin/poll-maker.4.5.6.zip",
        "4.5.7": "https://downloads.wordpress.org/plugin/poll-maker.4.5.7.zip",
        "4.5.8": "https://downloads.wordpress.org/plugin/poll-maker.4.5.8.zip",
        "4.5.9": "https://downloads.wordpress.org/plugin/poll-maker.4.5.9.zip",
        "4.6.0": "https://downloads.wordpress.org/plugin/poll-maker.4.6.0.zip",
        "4.6.1": "https://downloads.wordpress.org/plugin/poll-maker.4.6.1.zip",
        "4.6.2": "https://downloads.wordpress.org/plugin/poll-maker.4.6.2.zip",
        "4.6.3": "https://downloads.wordpress.org/plugin/poll-maker.4.6.3.zip",
        "4.6.4": "https://downloads.wordpress.org/plugin/poll-maker.4.6.4.zip",
        "4.6.5": "https://downloads.wordpress.org/plugin/poll-maker.4.6.5.zip",
        "4.6.6": "https://downloads.wordpress.org/plugin/poll-maker.4.6.6.zip",
        "4.6.7": "https://downloads.wordpress.org/plugin/poll-maker.4.6.7.zip",
        "4.6.8": "https://downloads.wordpress.org/plugin/poll-maker.4.6.8.zip",
        "4.6.9": "https://downloads.wordpress.org/plugin/poll-maker.4.6.9.zip",
        "4.7.0": "https://downloads.wordpress.org/plugin/poll-maker.4.7.0.zip",
        "4.7.1": "https://downloads.wordpress.org/plugin/poll-maker.4.7.1.zip",
        "4.7.2": "https://downloads.wordpress.org/plugin/poll-maker.4.7.2.zip",
        "4.7.3": "https://downloads.wordpress.org/plugin/poll-maker.4.7.3.zip",
        "4.7.4": "https://downloads.wordpress.org/plugin/poll-maker.4.7.4.zip",
        "4.7.5": "https://downloads.wordpress.org/plugin/poll-maker.4.7.5.zip",
        "4.7.6": "https://downloads.wordpress.org/plugin/poll-maker.4.7.6.zip",
        "4.7.7": "https://downloads.wordpress.org/plugin/poll-maker.4.7.7.zip",
        "4.7.8": "https://downloads.wordpress.org/plugin/poll-maker.4.7.8.zip",
        "4.7.9": "https://downloads.wordpress.org/plugin/poll-maker.4.7.9.zip",
        "4.8.0": "https://downloads.wordpress.org/plugin/poll-maker.4.8.0.zip",
        "4.8.1": "https://downloads.wordpress.org/plugin/poll-maker.4.8.1.zip",
        "4.8.2": "https://downloads.wordpress.org/plugin/poll-maker.4.8.2.zip",
        "4.8.3": "https://downloads.wordpress.org/plugin/poll-maker.4.8.3.zip",
        "4.8.4": "https://downloads.wordpress.org/plugin/poll-maker.4.8.4.zip",
        "4.8.5": "https://downloads.wordpress.org/plugin/poll-maker.4.8.5.zip",
        "4.8.6": "https://downloads.wordpress.org/plugin/poll-maker.4.8.6.zip",
        "4.8.7": "https://downloads.wordpress.org/plugin/poll-maker.4.8.7.zip",
        "4.8.8": "https://downloads.wordpress.org/plugin/poll-maker.4.8.8.zip",
        "4.8.9": "https://downloads.wordpress.org/plugin/poll-maker.4.8.9.zip",
        "4.9.0": "https://downloads.wordpress.org/plugin/poll-maker.4.9.0.zip",
        "4.9.1": "https://downloads.wordpress.org/plugin/poll-maker.4.9.1.zip",
        "4.9.2": "https://downloads.wordpress.org/plugin/poll-maker.4.9.2.zip",
        "4.9.3": "https://downloads.wordpress.org/plugin/poll-maker.4.9.3.zip",
        "4.9.4": "https://downloads.wordpress.org/plugin/poll-maker.4.9.4.zip",
        "4.9.5": "https://downloads.wordpress.org/plugin/poll-maker.4.9.5.zip",
        "4.9.6": "https://downloads.wordpress.org/plugin/poll-maker.4.9.6.zip",
        "4.9.7": "https://downloads.wordpress.org/plugin/poll-maker.4.9.7.zip",
        "4.9.8": "https://downloads.wordpress.org/plugin/poll-maker.4.9.8.zip",
        "4.9.9": "https://downloads.wordpress.org/plugin/poll-maker.4.9.9.zip",
        "5.0.0": "https://downloads.wordpress.org/plugin/poll-maker.5.0.0.zip",
        "5.0.1": "https://downloads.wordpress.org/plugin/poll-maker.5.0.1.zip",
        "5.0.2": "https://downloads.wordpress.org/plugin/poll-maker.5.0.2.zip",
        "5.0.3": "https://downloads.wordpress.org/plugin/poll-maker.5.0.3.zip",
        "5.0.4": "https://downloads.wordpress.org/plugin/poll-maker.5.0.4.zip",
        "5.0.5": "https://downloads.wordpress.org/plugin/poll-maker.5.0.5.zip",
        "5.0.6": "https://downloads.wordpress.org/plugin/poll-maker.5.0.6.zip",
        "5.0.7": "https://downloads.wordpress.org/plugin/poll-maker.5.0.7.zip",
        "5.0.8": "https://downloads.wordpress.org/plugin/poll-maker.5.0.8.zip",
        "5.0.9": "https://downloads.wordpress.org/plugin/poll-maker.5.0.9.zip",
        "5.1.0": "https://downloads.wordpress.org/plugin/poll-maker.5.1.0.zip",
        "5.1.1": "https://downloads.wordpress.org/plugin/poll-maker.5.1.1.zip",
        "5.1.2": "https://downloads.wordpress.org/plugin/poll-maker.5.1.2.zip",
        "5.1.3": "https://downloads.wordpress.org/plugin/poll-maker.5.1.3.zip",
        "5.1.4": "https://downloads.wordpress.org/plugin/poll-maker.5.1.4.zip",
        "5.1.5": "https://downloads.wordpress.org/plugin/poll-maker.5.1.5.zip",
        "5.1.6": "https://downloads.wordpress.org/plugin/poll-maker.5.1.6.zip",
        "5.1.7": "https://downloads.wordpress.org/plugin/poll-maker.5.1.7.zip",
        "5.1.8": "https://downloads.wordpress.org/plugin/poll-maker.5.1.8.zip",
        "5.1.9": "https://downloads.wordpress.org/plugin/poll-maker.5.1.9.zip",
        "5.2.0": "https://downloads.wordpress.org/plugin/poll-maker.5.2.0.zip",
        "5.2.1": "https://downloads.wordpress.org/plugin/poll-maker.5.2.1.zip",
        "5.2.2": "https://downloads.wordpress.org/plugin/poll-maker.5.2.2.zip",
        "5.2.3": "https://downloads.wordpress.org/plugin/poll-maker.5.2.3.zip",
        "5.2.4": "https://downloads.wordpress.org/plugin/poll-maker.5.2.4.zip",
        "5.2.5": "https://downloads.wordpress.org/plugin/poll-maker.5.2.5.zip",
        "5.2.6": "https://downloads.wordpress.org/plugin/poll-maker.5.2.6.zip",
        "5.2.7": "https://downloads.wordpress.org/plugin/poll-maker.5.2.7.zip",
        "5.2.8": "https://downloads.wordpress.org/plugin/poll-maker.5.2.8.zip",
        "5.2.9": "https://downloads.wordpress.org/plugin/poll-maker.5.2.9.zip",
        "5.3.0": "https://downloads.wordpress.org/plugin/poll-maker.5.3.0.zip",
        "5.3.1": "https://downloads.wordpress.org/plugin/poll-maker.5.3.1.zip",
        "5.3.2": "https://downloads.wordpress.org/plugin/poll-maker.5.3.2.zip",
        "5.3.3": "https://downloads.wordpress.org/plugin/poll-maker.5.3.3.zip",
        "5.3.4": "https://downloads.wordpress.org/plugin/poll-maker.5.3.4.zip",
        "5.3.5": "https://downloads.wordpress.org/plugin/poll-maker.5.3.5.zip",
        "5.3.6": "https://downloads.wordpress.org/plugin/poll-maker.5.3.6.zip",
        "5.3.7": "https://downloads.wordpress.org/plugin/poll-maker.5.3.7.zip",
        "5.3.8": "https://downloads.wordpress.org/plugin/poll-maker.5.3.8.zip",
        "5.3.9": "https://downloads.wordpress.org/plugin/poll-maker.5.3.9.zip",
        "5.4.0": "https://downloads.wordpress.org/plugin/poll-maker.5.4.0.zip",
        "5.4.1": "https://downloads.wordpress.org/plugin/poll-maker.5.4.1.zip",
        "5.4.2": "https://downloads.wordpress.org/plugin/poll-maker.5.4.2.zip",
        "trunk": "https://downloads.wordpress.org/plugin/poll-maker.zip"
    },
    "business_model": "commercial",
    "repository_url": "",
    "commercial_support_url": "https://ays-pro.com/wordpress/poll-maker",
    "donate_link": "https://ays-pro.com/wordpress/poll-maker",
    "banners": {
        "low": "https://ps.w.org/poll-maker/assets/banner-772x250.jpg?rev=2072434",
        "high": "https://ps.w.org/poll-maker/assets/banner-1544x500.jpg?rev=2072435"
    },
    "icons": {
        "1x": "https://ps.w.org/poll-maker/assets/icon-128x128.png?rev=2670375",
        "2x": "https://ps.w.org/poll-maker/assets/icon-256x256.png?rev=2670375"
    },
    "blocks": {
        "poll-maker/poll": {
            "name": "poll-maker/poll",
            "title": "Poll Maker"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 84,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "poll-maker",
            "language": "es_ES",
            "version": "5.4.2",
            "updated": "2024-08-27 14:00:22",
            "package": "https://downloads.wordpress.org/translation/plugin/poll-maker/5.4.2/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "poll-maker",
            "language": "fr_FR",
            "version": "5.4.2",
            "updated": "2024-05-14 10:48:03",
            "package": "https://downloads.wordpress.org/translation/plugin/poll-maker/5.4.2/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "poll-maker",
            "language": "it_IT",
            "version": "5.4.2",
            "updated": "2024-05-10 12:04:49",
            "package": "https://downloads.wordpress.org/translation/plugin/poll-maker/5.4.2/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "poll-maker",
            "language": "nl_NL_formal",
            "version": "5.4.2",
            "updated": "2024-08-27 13:32:16",
            "package": "https://downloads.wordpress.org/translation/plugin/poll-maker/5.4.2/nl_NL_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "poll-maker",
            "language": "nl_BE",
            "version": "5.4.2",
            "updated": "2024-08-27 11:08:31",
            "package": "https://downloads.wordpress.org/translation/plugin/poll-maker/5.4.2/nl_BE.zip"
        },
        {
            "type": "plugin",
            "slug": "poll-maker",
            "language": "nl_NL",
            "version": "5.4.2",
            "updated": "2024-08-27 11:09:13",
            "package": "https://downloads.wordpress.org/translation/plugin/poll-maker/5.4.2/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "poll-maker",
            "language": "pl_PL",
            "version": "5.4.2",
            "updated": "2024-08-31 21:35:29",
            "package": "https://downloads.wordpress.org/translation/plugin/poll-maker/5.4.2/pl_PL.zip"
        },
        {
            "type": "plugin",
            "slug": "poll-maker",
            "language": "pt_BR",
            "version": "5.4.2",
            "updated": "2024-07-04 20:51:41",
            "package": "https://downloads.wordpress.org/translation/plugin/poll-maker/5.4.2/pt_BR.zip"
        },
        {
            "type": "plugin",
            "slug": "poll-maker",
            "language": "ru_RU",
            "version": "5.4.2",
            "updated": "2023-10-11 14:38:55",
            "package": "https://downloads.wordpress.org/translation/plugin/poll-maker/5.4.2/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "poll-maker",
            "language": "tr_TR",
            "version": "5.4.2",
            "updated": "2024-05-13 08:34:47",
            "package": "https://downloads.wordpress.org/translation/plugin/poll-maker/5.4.2/tr_TR.zip"
        }
    ]
}