{
    "name": "Portfolio Gallery &#8211; Image Gallery Plugin",
    "slug": "portfolio-filter-gallery",
    "version": "1.6.7",
    "author": "<a href=\"http://awplife.com/\">A WP Life</a>",
    "author_profile": "https://profiles.wordpress.org/awordpresslife/",
    "contributors": {
        "awordpresslife": {
            "profile": "https://profiles.wordpress.org/awordpresslife/",
            "avatar": "https://secure.gravatar.com/avatar/8d4ee52a55fe320b4839f6ec308f25ef?s=96&d=monsterid&r=g",
            "display_name": "A WP Life"
        },
        "razipathhan": {
            "profile": "https://profiles.wordpress.org/razipathhan/",
            "avatar": "https://secure.gravatar.com/avatar/d9d7ea00aec21b7fc4c1d152fff002f1?s=96&d=monsterid&r=g",
            "display_name": "Pathhan"
        },
        "hanif0991": {
            "profile": "https://profiles.wordpress.org/hanif0991/",
            "avatar": "https://secure.gravatar.com/avatar/c6147a72fd7ff7d0f0020e909d3cf064?s=96&d=monsterid&r=g",
            "display_name": "mohammadhanif"
        },
        "muhammadshahid": {
            "profile": "https://profiles.wordpress.org/muhammadshahid/",
            "avatar": "https://secure.gravatar.com/avatar/1e24557797c4e83f997175ee3a0cf91f?s=96&d=monsterid&r=g",
            "display_name": "Alexander"
        },
        "fkfaisalkhan007": {
            "profile": "https://profiles.wordpress.org/fkfaisalkhan007/",
            "avatar": "https://secure.gravatar.com/avatar/5d06fd05ab6d5ec68b9cec1380dc6dc5?s=96&d=monsterid&r=g",
            "display_name": "fkfaisalkhan007"
        },
        "sharikkhan007": {
            "profile": "https://profiles.wordpress.org/sharikkhan007/",
            "avatar": "https://secure.gravatar.com/avatar/e85c03b9050dcc35ba4d204b4775586f?s=96&d=monsterid&r=g",
            "display_name": "Sharik Khan"
        },
        "zishlife": {
            "profile": "https://profiles.wordpress.org/zishlife/",
            "avatar": "https://secure.gravatar.com/avatar/7bfe4b0cad704d2dbb3a6dd61a30436d?s=96&d=monsterid&r=g",
            "display_name": "zish"
        },
        "farazfrank": {
            "profile": "https://profiles.wordpress.org/farazfrank/",
            "avatar": "https://secure.gravatar.com/avatar/6d4e9d72fbe4687770e1ae3f436c3036?s=96&d=monsterid&r=g",
            "display_name": "FARAZFRANK"
        }
    },
    "requires": "3.2",
    "tested": "6.6.1",
    "requires_php": "5.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 96,
    "ratings": {
        "5": 297,
        "4": 6,
        "3": 3,
        "2": 1,
        "1": 12
    },
    "num_ratings": 319,
    "support_url": "https://wordpress.org/support/plugin/portfolio-filter-gallery/",
    "support_threads": 2,
    "support_threads_resolved": 2,
    "active_installs": 30000,
    "downloaded": 865103,
    "last_updated": "2024-08-09 11:39:00",
    "added": "2016-10-10",
    "homepage": "http://awplife.com/",
    "sections": {
        "description": "<p>A super easy way to create a beautiful and responsive portfolio for your WordPress websites. Portfolio filter gallery is fully responsive and works with all devices like Macbook, desktop PC, tablets, mobile.<br />\nThe first portfolio plugin in WordPress for a separate category page.</p>\n<h3>Links</h3>\n<ul>\n<li><a href=\"https://awplife.com/wordpress-plugins/portfolio-filter-gallery-wordpress-plugin/\" rel=\"nofollow ugc\">Upgrade To Portfolio Premium</a></li>\n<li><a href=\"https://awplife.com/demo/portfolio-filter-gallery-free-wordpress-plugin/\" rel=\"nofollow ugc\">Free Live Demo</a></li>\n<li>\n<p><a href=\"https://awplife.com/demo/portfolio-filter-gallery-premium/\" rel=\"nofollow ugc\">Premium Live Demo</a></p>\n</li>\n<li>\n<p><a href=\"https://webenvo.com/ultimate-portfolio/\" rel=\"nofollow ugc\">Ultimate Portfolio &#8211; Advanced Version With Gutenberg </a></p>\n</li>\n</ul>\n<h4>HOW TO USE THE EASIEST PORTFOLIO WITH WORDPRESS</h4>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/6rvJ9NN_kA0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Features</h3>\n<ul>\n<li>Filters &#8211; an easy way to create filters for portfolio galleries</li>\n<li>Bootstrap Lightbox &#8211; the best and responsive bootstrap image lightbox</li>\n<li>Multiple Column Layout &#8211; show the portfolio gallery in multiple columns like two columns, three columns, four columns</li>\n<li>Responsive &#8211; all device compatible like PC, Mac, tabs, phones</li>\n<li>Numbering &#8211; show numbering on images</li>\n<li>Title &#8211; show image title / label / caption on gallery images</li>\n<li>Spacing or Without Spacing &#8211; Show gallery with and without spacing </li>\n<li>Gray Scale &#8211; make beautiful photo gallery with Grayscale effect</li>\n<li>Masonry &#8211; masonry style image photo video galleries</li>\n<li>Multi-Color For Filters &#8211; apply multiple colors for filters button</li>\n</ul>\n<h3>Pro Features</h3>\n<ul>\n<li>Easy &amp; Simple </li>\n<li>Responsive Gallery </li>\n<li>Portfolio Filtration </li>\n<li>Add Unlimited Filters </li>\n<li>Unlimited Filter colors </li>\n<li>Customize Border Settings</li>\n<li>Portfolio Masonry Gallery </li>\n<li>Link Portfolio Gallery  </li>\n<li>Load More Portfolio</li>\n<li>Multiple Column Layouts </li>\n<li>Bootstrap 3.3.6 Based </li>\n<li>30 Hover Effect </li>\n<li>5 Light Box Pop-up Style</li>\n<li>Image Title</li>\n<li>Gallery in Post</li>\n<li>Gallery in Page</li>\n<li>Gallery in Widget</li>\n<li>SEO Friendly Gallery</li>\n<li>Thumbnail Size &amp; Quality Setting</li>\n<li>Navigation Error in Lightbox Preview</li>\n<li>Portfolio Gallery Images Order Buttons Like Ascending, Descending &amp; Shuffle</li>\n<li>Simple &amp; User-Friendly Custom Plugin Dashboard</li>\n<li>Create Unlimited Portfolio Galleries With Unlimited Images</li>\n<li>Custom CSS</li>\n<li>Easy To Implement Anywhere Into WordPress</li>\n<li>Easily Customizable Portfolio</li>\n<li>Fast, Friendly &amp; Quality Support</li>\n<li>You will get the best filtration in multiple themes</li>\n<li>You can change unlimited colors, change title &amp; description background colors, change title description color, also change the border color of images. </li>\n<li>You can customize image border like border colors, border size</li>\n<li>Beautifully created masonry gallery</li>\n<li>Link option with both theme you can also set a read more or view button and give a link into it or give the link on the image </li>\n<li>Set multiple column layouts like 1 column, 2 columns, 3 columns, 4 column </li>\n</ul>\n<h3>🎨 PORTFOLIO FILTER GALLERY DESIGN</h3>\n<p>Portfolio gallery method is really easy to use you will find a separate category page, the user can easily create a portfolio within a minute. choose the filters with the images with a select box<br />\nthat makes a really different portfolio filter gallery with other plugins. Show portfolio with or without a lightbox, in the free version of the portfolio you have a bootstrap lightbox with navigation.<br />\nyou can also show title with images and the title will also appear with bootstrap lightbox in the bottom. If you don&#8217;t want lightbox you can also link your portfolio for an external project.<br />\nThe default layout of the portfolio is the masonry layout. If you want to use the grid layout you can use the same size image for the portfolio. then you can show your portfolio with grid layout also.<br />\nShow your portfolio gallery with a border or you can show your portfolio without spacing or with spacing.</p>\n<h3>📱 DEFINING MASONRY LAYOUT IN PORTFOLIO</h3>\n<p>The term Masonry layout probably owes its name to the popular jQuery Masonry plugin that is used to generate this type of layout.<br />\nMasonry layout is also referred to as the Pinterest Style Layout, as www.pinterest.com was the first major website to use this layout style. Masonry layout gives a great look of your portfolio gallery<br />\nThe plugins listed contain unique features in addition to the common feature set. It is difficult to understand the difference between each plugin just by looking at a Masonry layout generated by each one. All of the layouts will appear quite similar. It is important to consider the available features before choosing a plugin. Generally, most plugins provide an API and documentation for identifying their features.<br />\nI suggest looking at the available features of each plugin before making your choice. I have compiled the following list of common features from the plugins listed in the previous section. These are some of the main features, but each plugin also has its own unique ones. It’s up to you to choose the best plugin based on your application requirements.<br />\nMasonry layouts can have fixed-size columns or dynamic columns. Fixed-size columns are the norm. It is better to choose a plugin that allows dynamic columns, as it enhances flexibility.<br />\nSorting and Filtering – Plugins like Isotope allow you to sort and filter the elements without losing the structure of the layout. It is a good feature to have when you need dynamic Masonry layouts.<br />\nAnimation – Unlike normal layouts, Masonry layouts change completely with the addition or removal of elements. Because of this, it is better to have animation effects for adjusting elements – this creates an awesome user experience.<br />\nDynamic Elements – Generally, we create the layout on page load using the available elements. But some sites might require the ability to add or remove elements without refreshing. In such cases, the plugin should have the ability to auto adjust the layout to provide the optimal structure.<br />\nLayout Options – The plugin should allow you to set column width, gutter size, alignment, etc.<br />\nDevelopers and designers are accustomed to seeing web pages laid out with CSS floats. But this common type of layout doesn’t take the size of the elements into consideration. Instead, it adds elements one after another, first in the horizontal direction, then vertically.</p>\n<h3>(PORTFOLIO ) CUSTOM CSS OPTION</h3>\n<p>Custom CSS is part of Custom Design, which is a feature of the WordPress.com Premium and WordPress.com Business plans. … CSS stands for Cascading Style Sheets. It is a markup language that controls the appearance of HTML elements on a web page.</p>\n<h3>(PORTFOLIO ) LINK OPTION</h3>\n<p>Link portfolio by giving a link on separate images</p>\n<h3>FAST CUSTOMER SUPPORT</h3>\n<p>Low response time<br />\nWe always try to respond within hours or within a day.<br />\nResolving an issue within 24 hours.</p>\n<h3>GENERAL Features</h3>\n<p><strong>Portfolio Filtration</strong></p>\n<ul>\n<li>Sparate page of portfolio filters</li>\n<li>Create filters </li>\n<li>Edit filters</li>\n<li>Delete filters</li>\n</ul>\n<p><strong>Bootstrap Lightbox</strong></p>\n<ul>\n<li>Onclick lightbox on the gallery</li>\n<li>Navigation with the portfolio</li>\n<li>Display title with the gallery</li>\n</ul>\n<p><strong>Multiple Column Layout</strong></p>\n<ul>\n<li>Show in 2, 3  column layout with portfolio</li>\n<li>Manage space of the gallery</li>\n</ul>\n<p><strong>Responsive Portfolio</strong></p>\n<ul>\n<li>Show portfolio gallery with responsive mode</li>\n<li>Show gallery with desktop and mobile with center align </li>\n</ul>\n<p><strong>Title On Portfolio</strong></p>\n<ul>\n<li>Show title on gallery in a unique way </li>\n<li>Title with background color option on the gallery </li>\n<li>Show discription with gallery no limit</li>\n<li>Show read more link option</li>\n</ul>\n<p><strong>Ease Of Customization</strong></p>\n<ul>\n<li>Create your portfolio with the easiest way on the WordPress</li>\n<li>Create filters on a separate page</li>\n<li>Choose filters with your images of portfolio</li>\n<li>Filter images according to the category</li>\n</ul>\n<p><strong>Masonry Portfolio Gallery</strong></p>\n<ul>\n<li>Masonry layouts are a great choice for creating galleries</li>\n<li>Show your portfolio with an uneven height of images</li>\n<li>Manage sccording to window size</li>\n</ul>\n<p><strong>Link Option</strong></p>\n<ul>\n<li>Link your portfolio with external page or site</li>\n<li>You can link your portfolio gallery with separate image</li>\n<li>Option for open link into same tab or new tab</li>\n</ul>\n<p><strong>Video Option</strong></p>\n<ul>\n<li>Show your work or portfolio with images and videos</li>\n<li>Show portfolio gallery with vemio or youtube videos</li>\n<li>Youtube icon on hover</li>\n<li>Vemio icon on hover</li>\n<li>Close button availabe</li>\n<li>Esc close option</li>\n</ul>\n<h3>Pro Features In Detail</h3>\n<p><strong>Unlimited Filters</strong><br />\nCreate unlimited filter and category in the premium version, the plugin has a unique separate category page for creating the filters so you don&#8217;t need to use WordPress categories.<br />\nusers will really like the ease of use the plugin. You can set up your project in some clicks. You can also edit, update, delete your category names.</p>\n<p><strong>Upload Images</strong><br />\nUpload process of images it also really easy process. this plugin uses WordPress media uploader so you can upload multiple images at a time. you can also use cropped images from your media.<br />\nImages have the option to filter images with filters that you will find with a select box on the bottom of images. choose your desire filter with the image to filter it.<br />\nImages have also Title option and link option that you can change any time or multiple time.<br />\nNote: recommended to do not repeat images in the gallery for performance issues.</p>\n<p><em>Bootstrap Based</em><br />\nBuild responsive, mobile-first projects on the web.Bootstrap is an open source toolkit with HTML, CSS, and JS.responsive grid system, extensive prebuilt components, and powerful plugins built on jQuery.<br />\nBootstrap allows to create responsive and dynamic layouts that manage according to your device.<br />\nThe most prominent components of Bootstrap are its layout components, as they affect an entire web page. The basic layout component is called &#8220;Container&#8221;, as every other element in the page is placed in it.<br />\nUsers can choose between a fixed-width container and a fluid-width container.</p>\n<p><strong>Filterizer</strong><br />\nThis plugin is build on jQuery that searches, sorts, shuffles and applies stunning filters over responsive galleries using CSS3 transitions.<br />\nPluggable look &amp; feel (write your CSS effects in the box on the right and hit Filterize)<br />\nSmooth performance — optimized for smooth experience on mobile devices<br />\nLightweight &#8211; Fast to load on the page<br />\nResponsive — with your Media Queries (resize the window)<br />\nPlatform support:<br />\nChrome, Firefox, Safari, Opera<br />\nAndroid and iOS browsers<br />\nEdge, IE(v.10+)</p>\n<p><strong>Multi Layout</strong><br />\nThe plugin has the option to create a gallery into multiple layouts. In the plugin two layout option available that you can choose from the setting page. The first layout is a minimal type layout that gives your site a minimal and fresh look. the second layout gives an attractive and nice look to your site. You can use multi-layout with multiple pages.</p>\n<p><strong>Beauty Of Hover Effects</strong><br />\nThere are an additional three types of hover effects available in the plugin. That you can use according to your layout. Hover effects available with transition effects that give beautiful look to your gallery.<br />\nHover effects show your title or description in a smooth way. The effect with icon also available.</p>\n<ul>\n<li>Overlay Zoom</li>\n<li>Image with title &amp; caption on hover</li>\n<li>Image with title and slide in the icon on hover</li>\n</ul>\n<p><strong>Filters Layout</strong><br />\nChange the filter layout with color, underline color different filters available with a different layout. You can also hide filters from your gallery if you don&#8217;t want to show filters in any case.<br />\nMultifilter option available, Sorting control, Search box available for search with the image title or image description.</p>\n<p><strong>Multiple Lightbox</strong><br />\nThere are six types of lightbox available in the plugin. The lightbox shows the image into a popup or large container you can also navigate the images to the next image. All the lightbox are responsive and works<br />\naccording to your device type. It also looks beautiful on the small devices. The Swipebox lightbox works according to filtered image groups. It will filter only the images that you have on the active filter.<br />\nLD lightbox changes its size according to image.</p>\n<ul>\n<li>LD Light Box<br />\nFully responsive and changes size according to the images</li>\n<li>Swipebox Light Box ( Lightbox work filtered images group ) &#8211;<br />\nSwipebox is a jQuery &#8220;lightbox&#8221; plugin for desktop, mobile and tablet. Main features is </li>\n<li>Swipe gestures for mobile</li>\n<li>Keyboard Navigation for desktop</li>\n<li>CSS transitions with jQuery fallback</li>\n<li>Retina support for UI icons</li>\n<li>Easy CSS customization<br />\nCompatibility &#8211; Chrome, Safari, Firefox, Opera, IE9+, IOS4+, Android, windows phone.</li>\n<li>Pop Trox Light Box<br />\npoptrox is another simple yet fully customizable jQuery lightbox plugin for displaying html content (image, youtube/vimeo video) in a responsive popup window.</li>\n<li>Viewer Light Box<br />\nA dead simple jQuery based image viewer to display all the images in a navigatable, lightbox-style gallery popup that auto resizes when the screen size changes.</li>\n<li>Blue Imp Light Box<br />\nblueimp Gallery is a touch-enabled, responsive and customizable image &amp; video gallery, carousel and lightbox, optimized for both mobile and desktop web browsers.<br />\nIt features swipe, mouse and keyboard navigation, transition effects, slideshow functionality, fullscreen support and on-demand content loading and can be extended to display additional content types.</li>\n<li>Bootstrap 3 Light Box </li>\n</ul>\n<p><strong>User Interface</strong><br />\nPlugin has easy user inerface all the setting is devied into saprate tab, user can esaely changes the setting. It also based on Bootstrap and it is also responsive.</p>\n<p><strong>Load More Option</strong><br />\nUsers can set the limit of images on the page to load If you want to load more image then click on load button and it will load the remaining images. Option available for change color for the load button and for the loader icon.</p>\n<ul>\n<li>Image Limit For Load More</li>\n<li>Change text For Load More Button</li>\n<li>Change load More Button Color</li>\n<li>Change load More Icon Color</li>\n</ul>\n<p><strong>Customization</strong></p>\n<p><strong>Gallery Thumbnail Size</strong></p>\n<ul>\n<li>Medium &#8211; 300 x 169</li>\n<li>Large &#8211; 840 x 473</li>\n<li>Full Size &#8211; 1280 x 720</li>\n<li>Custom Thumbnail &#8211; 300 x 300</li>\n<li>Custom Thumbnail &#8211; 500 x 500</li>\n</ul>\n<p><strong>Columns Settings</strong></p>\n<ul>\n<li>Columns On Large Desktops</li>\n<li>Columns On Desktops</li>\n<li>Columns On Tablets</li>\n<li>Columns On Phone</li>\n</ul>\n<p><strong>Title &amp; discription</strong></p>\n<ul>\n<li>Title &amp; discription On Thumbnail Show/Hide</li>\n<li>Title &amp; discription Color</li>\n<li>Select Color</li>\n<li>Title &amp; discription Background Color</li>\n<li>Select Color</li>\n<li>Title Font Size</li>\n<li>Read More Show/Hide</li>\n<li>Change Read More Text</li>\n</ul>\n<p><strong>Thumbnail Options</strong></p>\n<ul>\n<li>Thumbnails Custom Border Setting</li>\n<li>Show Numbering On Thumbnails</li>\n<li>Thumbnails Spacing ( px )</li>\n<li>Image Gray Scale (Gray Effect)</li>\n<li>Video Auto-Play In lightbox</li>\n<li>Open Image Link URL</li>\n<li>Link Nofollow</li>\n<li>Link No opener</li>\n<li>Link No referrer</li>\n</ul>\n<p><strong>Filters</strong></p>\n<ul>\n<li>Hide filters</li>\n<li>Multi-Filters Enable</li>\n<li>Ascending</li>\n<li>Descending Button</li>\n<li>Shuffle Button</li>\n<li>Search Box</li>\n<li>Filters Color</li>\n<li>Filters underline Color</li>\n</ul>\n<p><strong>SHORTCODE</strong></p>\n<p>Portfolio Gallery offers an easy-to-use Insert Gallery, which means you never need to work with shortcodes again when inserting and manageing galleries. You just need to copy and paste gallery shortcode into the gallery.<br />\nIf you do want to work with shortcodes, there is a powerful shortcode system as you’d expect of a popular WordPress gallery plugin.<br />\nFor more information, feel free to visit the official website for portfolio gallery.</p>\n",
        "installation": "<p>Install Portfolio Filter Gallery either via the WordPress.org plugin directory or by uploading the files to your server.</p>\n<p>After activating  Filter Gallery plugin, go to plugin menu.</p>\n<p>Add your filters.</p>\n<p>Create Portfolio Filter Gallery, configure settings and save.</p>\n<p>Copy gallery shortcode and publish on page/post.</p>\n<p>That&#8217;s it. You&#8217;re ready to go!</p>\n",
        "faq": "\n<dt id='have%20any%20queries%3F'>\nHave any queries?\n</h4>\n<p>\n<p>Please post your question on the plugin support forum</p>\n<p>https://wordpress.org/support/plugin/portfolio-filter-gallery/</p>\n</p>\n<dt id='how%20can%20i%20create%20filters%20for%20images%3F'>\nHow can I create filters for images?\n</h4>\n<p>\n<p>In the Portfolio Gallery plugin, you can find a separate page for creating filters Go to Portfolio Gallery menu then click filters submenu.</p>\n</p>\n<dt id='how%20can%20i%20show%20videos%20in%20the%20plugin%3F'>\nHow can I show videos in the plugin?\n</h4>\n<p>\n<p>After uploading the images choose the image type = (video) from the select box below the image and then type your video link (Vimeo or youtube) then click on publish or update the post.</p>\n</p>\n<dt id='is%20there%20any%20limit%20to%20upload%20the%20images%20in%20the%20plugin%3F'>\nIs there any limit to upload the images in the plugin?\n</h4>\n<p>\n<ul>\n<li>No, there is no limit for uploading the images, You can upload unlimited images.</li>\n</ul>\n</p>\n<dt id='how%20to%20add%20portfolio%20galleries%20to%20a%20post%20or%20page%3F'>\nHow to add portfolio galleries to a post or page?\n</h4>\n<p>\n<ul>\n<li>After creating your gallery you will find copy shortcode option. Copy shortcode and just paste it to your page or post to show gallery.</li>\n</ul>\n</p>\n<dt id='how%20many%20images%20and%20videos%20can%20be%20added%20to%20the%20gallery%3F'>\nHow many images and videos can be added to the gallery?\n</h4>\n<p>\n<ul>\n<li>This plugin doesn’t have the limit for images and videos. You are able to add an unlimited amount of photos to your projects.</li>\n</ul>\n</p>\n<dt id='can%20i%20change%20the%20sequence%20of%20images%20in%20the%20gallery%3F'>\nCan I change the sequence of images in the gallery?\n</h4>\n<p>\n<ul>\n<li>When you create a gallery you can see drag and drop option for images so you can drag and drop images to get your desirable gallery.</li>\n</ul>\n</p>\n<dt id='is%20portfolio%20gallery%20responsive%3F'>\nIs Portfolio Gallery responsive?\n</h4>\n<p>\n<ul>\n<li>Gallery plugin has fully responsive design and layout. It is designed to display all of its views and react with your device smoothly.</li>\n</ul>\n</p>\n<dt id='can%20i%20add%20url%20links%20to%20the%20image%3F'>\nCan I add URL links to the image?\n</h4>\n<p>\n<ul>\n<li>Yes, you can add the links to images. you can find the link option under the image when you will upload.</li>\n</ul>\n</p>\n<dt id='how%20do%20i%20publish%20galleries%20on%20pages%20or%20posts%3F'>\nHow do I Publish galleries on pages or posts?\n</h4>\n<p>\n<ul>\n<li>Open the post/page you want to display the gallery. Paste your gallery shortcode into text editor and press plublish button to show your gallery or Instagram feed. You can also show the gallery in widget like page or post just paste your shortcode into text widget and your gallery is ready to show.</li>\n</ul>\n</p>\n\n",
        "changelog": "<h4>1.6.7</h4>\n<ul>\n<li>Image border issue fixed.</li>\n<li>Tested with WordPress version 6.6.1</li>\n</ul>\n<h4>1.6.6</h4>\n<ul>\n<li>Lightbox error fixed.</li>\n</ul>\n<h4>1.6.5</h4>\n<ul>\n<li>Lightbox senetization fixed.</li>\n</ul>\n<h4>1.6.4</h4>\n<ul>\n<li>Filter alignment fixed.</li>\n<li>Tested with WordPress version 6.5.5</li>\n</ul>\n<h4>1.6.3</h4>\n<ul>\n<li>Botstrap CSS fixed.</li>\n</ul>\n<h4>1.6.2</h4>\n<ul>\n<li>Tested with WordPress version 6.5.4</li>\n</ul>\n<h4>1.6.1</h4>\n<ul>\n<li>Bootstrap Extra menu css remove.</li>\n</ul>\n<h4>1.6.0</h4>\n<ul>\n<li>Bootstrap lightbox updated to version 5.</li>\n</ul>\n<h4>1.5.8</h4>\n<ul>\n<li>Security logic changed.</li>\n</ul>\n<h4>1.5.7</h4>\n<ul>\n<li>Cross Site Scripting (XSS) issue fixed! </li>\n<li>Increased limit of categories.</li>\n</ul>\n<h4>1.5.6</h4>\n<ul>\n<li>Added feature to show image count with filter/category</li>\n<li>Tested with WordPress version 6.4.3</li>\n</ul>\n<h4>1.5.5</h4>\n<ul>\n<li>Tasted with WordPress version 6.4</li>\n</ul>\n<h4>1.5.4</h4>\n<ul>\n<li>Added Shuffle button for backend images.</li>\n</ul>\n<h4>1.5.3</h4>\n<ul>\n<li>Filter page array error fixed.</li>\n</ul>\n<h4>1.5.2</h4>\n<ul>\n<li>Tasted with WordPress version 6.3.1</li>\n</ul>\n<h4>1.5.1</h4>\n<ul>\n<li>Tasted with WordPress version 6.2.2</li>\n</ul>\n<h4>1.5.0</h4>\n<ul>\n<li>Tasted with WordPress version 6.2</li>\n</ul>\n<h4>1.4.9</h4>\n<ul>\n<li>Script ids issue fixed.</li>\n</ul>\n<h4>1.4.8</h4>\n<ul>\n<li>Search issue fixed with hide title.</li>\n</ul>\n<h4>1.4.6</h4>\n<ul>\n<li>CSS Fixed.</li>\n<li>Tasted with WordPress version 6.1.1</li>\n</ul>\n<h4>1.4.5</h4>\n<ul>\n<li>Image CSS fixed.</li>\n<li>php variable Bug fixed.</li>\n</ul>\n<h4>1.4.4</h4>\n<ul>\n<li>Fixed a php bug.</li>\n</ul>\n<h4>1.4.3</h4>\n<ul>\n<li>Fixed little coding bugs.</li>\n<li>Improved UI for better user experience.</li>\n<li>Tasted with WordPress version 6.0.2</li>\n</ul>\n<h4>1.4.2</h4>\n<ul>\n<li>Fixed Security issues.</li>\n<li>Tasted with WordPress version 6.0.1</li>\n</ul>\n<h4>1.4.1</h4>\n<ul>\n<li>Added js for fresh load images.</li>\n<li>Tasted with WordPress version 6.0</li>\n</ul>\n<h4>1.4.0</h4>\n<ul>\n<li>Filter background color is now changeable with custom css.</li>\n<li>Tasted with WordPress version 5.9.3</li>\n</ul>\n<h4>1.3.9</h4>\n<ul>\n<li>Removed Extra Slashes from filters.</li>\n<li>Tasted with WordPress version 5.9.3</li>\n</ul>\n<h4>1.3.8</h4>\n<ul>\n<li>Errors Fixed.</li>\n<li>Tasted with WordPress version 5.9</li>\n</ul>\n<h4>1.3.7</h4>\n<ul>\n<li>Translation Bug Fixed.</li>\n<li>Tasted with WordPress version 5.8.3</li>\n</ul>\n<h4>1.3.6</h4>\n<ul>\n<li>Additional changes: Spanish translation ready.</li>\n<li>Tasted with WordPress version 5.8.2</li>\n</ul>\n<h4>1.3.5</h4>\n<ul>\n<li>Small bugs fixed.</li>\n</ul>\n<h4>1.3.4</h4>\n<ul>\n<li>Gallery loading issue fixed.</li>\n</ul>\n<h4>1.3.3.1</h4>\n<ul>\n<li>Scrolling issue fixed.</li>\n</ul>\n<h4>1.3.3</h4>\n<ul>\n<li>Added exclude wordpress lazy load fuction.</li>\n<li>Tested on wordpress 5.8.</li>\n<li>changes filter sort alphabatical order.</li>\n</ul>\n<h4>1.3.2</h4>\n<ul>\n<li>Fixed Security issues.</li>\n</ul>\n<h4>1.3.1</h4>\n<ul>\n<li>Fixed minor bugs.</li>\n</ul>\n<h4>1.3.0</h4>\n<ul>\n<li>Tasted with WordPress version 5.7.2</li>\n<li>Fixed minor bugs.</li>\n</ul>\n<h4>1.2.9</h4>\n<ul>\n<li>Added LD Lightbox option to show filtred images group</li>\n<li>Fixed image transition issue.</li>\n</ul>\n<h4>1.2.8</h4>\n<ul>\n<li>Tasted with WordPress version 5.6.1</li>\n<li>Fixed lightbox arrow issue.</li>\n</ul>\n<h4>1.2.7</h4>\n<ul>\n<li>Transition issue fixed</li>\n<li>Column ct off issue fixed</li>\n</ul>\n<h4>1.2.6</h4>\n<ul>\n<li>Bug Fixed.</li>\n</ul>\n<h4>1.2.5</h4>\n<ul>\n<li>fixed footer column issue.</li>\n</ul>\n<h4>1.2.4</h4>\n<ul>\n<li>Portfolio Filter Gallery Video Doc updated in WordPres.org description page</li>\n</ul>\n<h4>1.2.3</h4>\n<ul>\n<li>Tasted with WordPress version 5.5</li>\n<li>Fixed minor bugs.</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>Fixed All undefine variable bugs.</li>\n<li>Removed etra Js.</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Fixed minor bugs.</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Added Gallery direction option.</li>\n<li>Added option for thumbanail border remove.</li>\n<li>Added option for sort images by title.</li>\n<li>Added option for change &#8220;All&#8221; text.</li>\n<li>Added option for sort filters alphabatic order.</li>\n<li>Added search option.</li>\n<li>Added filter position option.</li>\n<li>Added Bootstrap js disable option.</li>\n<li>Free Demo Link Added</li>\n</ul>\n<h4>1.1.8</h4>\n<ul>\n<li>Tasted with WordPress version 5.4.2</li>\n<li>Free Demo Link Added</li>\n</ul>\n<h4>1.1.7</h4>\n<ul>\n<li>Fixed issue with anchor tag (hypertext link)</li>\n</ul>\n<h4>1.1.6</h4>\n<ul>\n<li>Mutiple gallery on same page issue fixed</li>\n<li>Bootstrap lightbox issue fixed.</li>\n<li>New Lightbox option added.</li>\n</ul>\n<h4>1.1.5</h4>\n<ul>\n<li>Filter Delete, Edit Bug Fixed</li>\n<li>Typo Error Fixed</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Fix nonce issue</li>\n<li>Fix Bootstrap Lightbox Alignment issue</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Security Fix: Ajax Nonce nonce implemented to delete filter(s)</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Hover effect issue fixed</li>\n<li>Hide filters / category option added</li>\n<li>Bug fixed</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Sanitization added</li>\n<li>Escaping added</li>\n<li>Nonce field added on form and verified while posting data</li>\n<li>Bad coding techniques removed (like Serialize / Base64Encode function removed)</li>\n<li>1.07 to 1.0.9 settings update button added</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Sanitization added</li>\n<li>Escaping added</li>\n</ul>\n<h4>1.0.8</h4>\n<ul>\n<li>Plugin security added</li>\n<li>Under review</li>\n</ul>\n<h4>1.0.7</h4>\n<ul>\n<li>Fixed column issue</li>\n</ul>\n<h4>1.0.6</h4>\n<ul>\n<li>shortcode feature added in all gallery page</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Add alternative text for images</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>Add Loader for gallery</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Fixed jQuery Error </li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Fixed spacing issue</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Fixed image loading animation</li>\n<li>Add transition to filters</li>\n<li>Tasted with WordPress version 5.1.1</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Completely Change of dashboard interface</li>\n<li>Add option to change color option for filters</li>\n<li>Now you can choose any color for filter No limit</li>\n<li>Change filters layout</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Completely Change of dashboard interface</li>\n<li>Add option to change color option for filters</li>\n<li>Now you can choose any color for filter No limit</li>\n<li>Change filters layout</li>\n</ul>\n<h4>0.3.5</h4>\n<ul>\n<li>None</li>\n<li>None</li>\n</ul>\n<h4>0.3.4</h4>\n<ul>\n<li>Checked with WordPress 5.0.2</li>\n<li>Remove CSS bugs</li>\n</ul>\n"
    },
    "short_description": "Portfolio gallery comes with a separate category page and user-friendly interface. Showcase portfolio, images, video, gallery.",
    "description": "<p>A super easy way to create a beautiful and responsive portfolio for your WordPress websites. Portfolio filter gallery is fully responsive and works with all devices like Macbook, desktop PC, tablets, mobile.<br />\nThe first portfolio plugin in WordPress for a separate category page.</p>\n<h3>Links</h3>\n<ul>\n<li><a href=\"https://awplife.com/wordpress-plugins/portfolio-filter-gallery-wordpress-plugin/\" rel=\"nofollow ugc\">Upgrade To Portfolio Premium</a></li>\n<li><a href=\"https://awplife.com/demo/portfolio-filter-gallery-free-wordpress-plugin/\" rel=\"nofollow ugc\">Free Live Demo</a></li>\n<li>\n<p><a href=\"https://awplife.com/demo/portfolio-filter-gallery-premium/\" rel=\"nofollow ugc\">Premium Live Demo</a></p>\n</li>\n<li>\n<p><a href=\"https://webenvo.com/ultimate-portfolio/\" rel=\"nofollow ugc\">Ultimate Portfolio &#8211; Advanced Version With Gutenberg </a></p>\n</li>\n</ul>\n<h4>HOW TO USE THE EASIEST PORTFOLIO WITH WORDPRESS</h4>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/6rvJ9NN_kA0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Features</h3>\n<ul>\n<li>Filters &#8211; an easy way to create filters for portfolio galleries</li>\n<li>Bootstrap Lightbox &#8211; the best and responsive bootstrap image lightbox</li>\n<li>Multiple Column Layout &#8211; show the portfolio gallery in multiple columns like two columns, three columns, four columns</li>\n<li>Responsive &#8211; all device compatible like PC, Mac, tabs, phones</li>\n<li>Numbering &#8211; show numbering on images</li>\n<li>Title &#8211; show image title / label / caption on gallery images</li>\n<li>Spacing or Without Spacing &#8211; Show gallery with and without spacing </li>\n<li>Gray Scale &#8211; make beautiful photo gallery with Grayscale effect</li>\n<li>Masonry &#8211; masonry style image photo video galleries</li>\n<li>Multi-Color For Filters &#8211; apply multiple colors for filters button</li>\n</ul>\n<h3>Pro Features</h3>\n<ul>\n<li>Easy &amp; Simple </li>\n<li>Responsive Gallery </li>\n<li>Portfolio Filtration </li>\n<li>Add Unlimited Filters </li>\n<li>Unlimited Filter colors </li>\n<li>Customize Border Settings</li>\n<li>Portfolio Masonry Gallery </li>\n<li>Link Portfolio Gallery  </li>\n<li>Load More Portfolio</li>\n<li>Multiple Column Layouts </li>\n<li>Bootstrap 3.3.6 Based </li>\n<li>30 Hover Effect </li>\n<li>5 Light Box Pop-up Style</li>\n<li>Image Title</li>\n<li>Gallery in Post</li>\n<li>Gallery in Page</li>\n<li>Gallery in Widget</li>\n<li>SEO Friendly Gallery</li>\n<li>Thumbnail Size &amp; Quality Setting</li>\n<li>Navigation Error in Lightbox Preview</li>\n<li>Portfolio Gallery Images Order Buttons Like Ascending, Descending &amp; Shuffle</li>\n<li>Simple &amp; User-Friendly Custom Plugin Dashboard</li>\n<li>Create Unlimited Portfolio Galleries With Unlimited Images</li>\n<li>Custom CSS</li>\n<li>Easy To Implement Anywhere Into WordPress</li>\n<li>Easily Customizable Portfolio</li>\n<li>Fast, Friendly &amp; Quality Support</li>\n<li>You will get the best filtration in multiple themes</li>\n<li>You can change unlimited colors, change title &amp; description background colors, change title description color, also change the border color of images. </li>\n<li>You can customize image border like border colors, border size</li>\n<li>Beautifully created masonry gallery</li>\n<li>Link option with both theme you can also set a read more or view button and give a link into it or give the link on the image </li>\n<li>Set multiple column layouts like 1 column, 2 columns, 3 columns, 4 column </li>\n</ul>\n<h3>🎨 PORTFOLIO FILTER GALLERY DESIGN</h3>\n<p>Portfolio gallery method is really easy to use you will find a separate category page, the user can easily create a portfolio within a minute. choose the filters with the images with a select box<br />\nthat makes a really different portfolio filter gallery with other plugins. Show portfolio with or without a lightbox, in the free version of the portfolio you have a bootstrap lightbox with navigation.<br />\nyou can also show title with images and the title will also appear with bootstrap lightbox in the bottom. If you don&#8217;t want lightbox you can also link your portfolio for an external project.<br />\nThe default layout of the portfolio is the masonry layout. If you want to use the grid layout you can use the same size image for the portfolio. then you can show your portfolio with grid layout also.<br />\nShow your portfolio gallery with a border or you can show your portfolio without spacing or with spacing.</p>\n<h3>📱 DEFINING MASONRY LAYOUT IN PORTFOLIO</h3>\n<p>The term Masonry layout probably owes its name to the popular jQuery Masonry plugin that is used to generate this type of layout.<br />\nMasonry layout is also referred to as the Pinterest Style Layout, as www.pinterest.com was the first major website to use this layout style. Masonry layout gives a great look of your portfolio gallery<br />\nThe plugins listed contain unique features in addition to the common feature set. It is difficult to understand the difference between each plugin just by looking at a Masonry layout generated by each one. All of the layouts will appear quite similar. It is important to consider the available features before choosing a plugin. Generally, most plugins provide an API and documentation for identifying their features.<br />\nI suggest looking at the available features of each plugin before making your choice. I have compiled the following list of common features from the plugins listed in the previous section. These are some of the main features, but each plugin also has its own unique ones. It’s up to you to choose the best plugin based on your application requirements.<br />\nMasonry layouts can have fixed-size columns or dynamic columns. Fixed-size columns are the norm. It is better to choose a plugin that allows dynamic columns, as it enhances flexibility.<br />\nSorting and Filtering – Plugins like Isotope allow you to sort and filter the elements without losing the structure of the layout. It is a good feature to have when you need dynamic Masonry layouts.<br />\nAnimation – Unlike normal layouts, Masonry layouts change completely with the addition or removal of elements. Because of this, it is better to have animation effects for adjusting elements – this creates an awesome user experience.<br />\nDynamic Elements – Generally, we create the layout on page load using the available elements. But some sites might require the ability to add or remove elements without refreshing. In such cases, the plugin should have the ability to auto adjust the layout to provide the optimal structure.<br />\nLayout Options – The plugin should allow you to set column width, gutter size, alignment, etc.<br />\nDevelopers and designers are accustomed to seeing web pages laid out with CSS floats. But this common type of layout doesn’t take the size of the elements into consideration. Instead, it adds elements one after another, first in the horizontal direction, then vertically.</p>\n<h3>(PORTFOLIO ) CUSTOM CSS OPTION</h3>\n<p>Custom CSS is part of Custom Design, which is a feature of the WordPress.com Premium and WordPress.com Business plans. … CSS stands for Cascading Style Sheets. It is a markup language that controls the appearance of HTML elements on a web page.</p>\n<h3>(PORTFOLIO ) LINK OPTION</h3>\n<p>Link portfolio by giving a link on separate images</p>\n<h3>FAST CUSTOMER SUPPORT</h3>\n<p>Low response time<br />\nWe always try to respond within hours or within a day.<br />\nResolving an issue within 24 hours.</p>\n<h3>GENERAL Features</h3>\n<p><strong>Portfolio Filtration</strong></p>\n<ul>\n<li>Sparate page of portfolio filters</li>\n<li>Create filters </li>\n<li>Edit filters</li>\n<li>Delete filters</li>\n</ul>\n<p><strong>Bootstrap Lightbox</strong></p>\n<ul>\n<li>Onclick lightbox on the gallery</li>\n<li>Navigation with the portfolio</li>\n<li>Display title with the gallery</li>\n</ul>\n<p><strong>Multiple Column Layout</strong></p>\n<ul>\n<li>Show in 2, 3  column layout with portfolio</li>\n<li>Manage space of the gallery</li>\n</ul>\n<p><strong>Responsive Portfolio</strong></p>\n<ul>\n<li>Show portfolio gallery with responsive mode</li>\n<li>Show gallery with desktop and mobile with center align </li>\n</ul>\n<p><strong>Title On Portfolio</strong></p>\n<ul>\n<li>Show title on gallery in a unique way </li>\n<li>Title with background color option on the gallery </li>\n<li>Show discription with gallery no limit</li>\n<li>Show read more link option</li>\n</ul>\n<p><strong>Ease Of Customization</strong></p>\n<ul>\n<li>Create your portfolio with the easiest way on the WordPress</li>\n<li>Create filters on a separate page</li>\n<li>Choose filters with your images of portfolio</li>\n<li>Filter images according to the category</li>\n</ul>\n<p><strong>Masonry Portfolio Gallery</strong></p>\n<ul>\n<li>Masonry layouts are a great choice for creating galleries</li>\n<li>Show your portfolio with an uneven height of images</li>\n<li>Manage sccording to window size</li>\n</ul>\n<p><strong>Link Option</strong></p>\n<ul>\n<li>Link your portfolio with external page or site</li>\n<li>You can link your portfolio gallery with separate image</li>\n<li>Option for open link into same tab or new tab</li>\n</ul>\n<p><strong>Video Option</strong></p>\n<ul>\n<li>Show your work or portfolio with images and videos</li>\n<li>Show portfolio gallery with vemio or youtube videos</li>\n<li>Youtube icon on hover</li>\n<li>Vemio icon on hover</li>\n<li>Close button availabe</li>\n<li>Esc close option</li>\n</ul>\n<h3>Pro Features In Detail</h3>\n<p><strong>Unlimited Filters</strong><br />\nCreate unlimited filter and category in the premium version, the plugin has a unique separate category page for creating the filters so you don&#8217;t need to use WordPress categories.<br />\nusers will really like the ease of use the plugin. You can set up your project in some clicks. You can also edit, update, delete your category names.</p>\n<p><strong>Upload Images</strong><br />\nUpload process of images it also really easy process. this plugin uses WordPress media uploader so you can upload multiple images at a time. you can also use cropped images from your media.<br />\nImages have the option to filter images with filters that you will find with a select box on the bottom of images. choose your desire filter with the image to filter it.<br />\nImages have also Title option and link option that you can change any time or multiple time.<br />\nNote: recommended to do not repeat images in the gallery for performance issues.</p>\n<p><em>Bootstrap Based</em><br />\nBuild responsive, mobile-first projects on the web.Bootstrap is an open source toolkit with HTML, CSS, and JS.responsive grid system, extensive prebuilt components, and powerful plugins built on jQuery.<br />\nBootstrap allows to create responsive and dynamic layouts that manage according to your device.<br />\nThe most prominent components of Bootstrap are its layout components, as they affect an entire web page. The basic layout component is called &#8220;Container&#8221;, as every other element in the page is placed in it.<br />\nUsers can choose between a fixed-width container and a fluid-width container.</p>\n<p><strong>Filterizer</strong><br />\nThis plugin is build on jQuery that searches, sorts, shuffles and applies stunning filters over responsive galleries using CSS3 transitions.<br />\nPluggable look &amp; feel (write your CSS effects in the box on the right and hit Filterize)<br />\nSmooth performance — optimized for smooth experience on mobile devices<br />\nLightweight &#8211; Fast to load on the page<br />\nResponsive — with your Media Queries (resize the window)<br />\nPlatform support:<br />\nChrome, Firefox, Safari, Opera<br />\nAndroid and iOS browsers<br />\nEdge, IE(v.10+)</p>\n<p><strong>Multi Layout</strong><br />\nThe plugin has the option to create a gallery into multiple layouts. In the plugin two layout option available that you can choose from the setting page. The first layout is a minimal type layout that gives your site a minimal and fresh look. the second layout gives an attractive and nice look to your site. You can use multi-layout with multiple pages.</p>\n<p><strong>Beauty Of Hover Effects</strong><br />\nThere are an additional three types of hover effects available in the plugin. That you can use according to your layout. Hover effects available with transition effects that give beautiful look to your gallery.<br />\nHover effects show your title or description in a smooth way. The effect with icon also available.</p>\n<ul>\n<li>Overlay Zoom</li>\n<li>Image with title &amp; caption on hover</li>\n<li>Image with title and slide in the icon on hover</li>\n</ul>\n<p><strong>Filters Layout</strong><br />\nChange the filter layout with color, underline color different filters available with a different layout. You can also hide filters from your gallery if you don&#8217;t want to show filters in any case.<br />\nMultifilter option available, Sorting control, Search box available for search with the image title or image description.</p>\n<p><strong>Multiple Lightbox</strong><br />\nThere are six types of lightbox available in the plugin. The lightbox shows the image into a popup or large container you can also navigate the images to the next image. All the lightbox are responsive and works<br />\naccording to your device type. It also looks beautiful on the small devices. The Swipebox lightbox works according to filtered image groups. It will filter only the images that you have on the active filter.<br />\nLD lightbox changes its size according to image.</p>\n<ul>\n<li>LD Light Box<br />\nFully responsive and changes size according to the images</li>\n<li>Swipebox Light Box ( Lightbox work filtered images group ) &#8211;<br />\nSwipebox is a jQuery &#8220;lightbox&#8221; plugin for desktop, mobile and tablet. Main features is </li>\n<li>Swipe gestures for mobile</li>\n<li>Keyboard Navigation for desktop</li>\n<li>CSS transitions with jQuery fallback</li>\n<li>Retina support for UI icons</li>\n<li>Easy CSS customization<br />\nCompatibility &#8211; Chrome, Safari, Firefox, Opera, IE9+, IOS4+, Android, windows phone.</li>\n<li>Pop Trox Light Box<br />\npoptrox is another simple yet fully customizable jQuery lightbox plugin for displaying html content (image, youtube/vimeo video) in a responsive popup window.</li>\n<li>Viewer Light Box<br />\nA dead simple jQuery based image viewer to display all the images in a navigatable, lightbox-style gallery popup that auto resizes when the screen size changes.</li>\n<li>Blue Imp Light Box<br />\nblueimp Gallery is a touch-enabled, responsive and customizable image &amp; video gallery, carousel and lightbox, optimized for both mobile and desktop web browsers.<br />\nIt features swipe, mouse and keyboard navigation, transition effects, slideshow functionality, fullscreen support and on-demand content loading and can be extended to display additional content types.</li>\n<li>Bootstrap 3 Light Box </li>\n</ul>\n<p><strong>User Interface</strong><br />\nPlugin has easy user inerface all the setting is devied into saprate tab, user can esaely changes the setting. It also based on Bootstrap and it is also responsive.</p>\n<p><strong>Load More Option</strong><br />\nUsers can set the limit of images on the page to load If you want to load more image then click on load button and it will load the remaining images. Option available for change color for the load button and for the loader icon.</p>\n<ul>\n<li>Image Limit For Load More</li>\n<li>Change text For Load More Button</li>\n<li>Change load More Button Color</li>\n<li>Change load More Icon Color</li>\n</ul>\n<p><strong>Customization</strong></p>\n<p><strong>Gallery Thumbnail Size</strong></p>\n<ul>\n<li>Medium &#8211; 300 x 169</li>\n<li>Large &#8211; 840 x 473</li>\n<li>Full Size &#8211; 1280 x 720</li>\n<li>Custom Thumbnail &#8211; 300 x 300</li>\n<li>Custom Thumbnail &#8211; 500 x 500</li>\n</ul>\n<p><strong>Columns Settings</strong></p>\n<ul>\n<li>Columns On Large Desktops</li>\n<li>Columns On Desktops</li>\n<li>Columns On Tablets</li>\n<li>Columns On Phone</li>\n</ul>\n<p><strong>Title &amp; discription</strong></p>\n<ul>\n<li>Title &amp; discription On Thumbnail Show/Hide</li>\n<li>Title &amp; discription Color</li>\n<li>Select Color</li>\n<li>Title &amp; discription Background Color</li>\n<li>Select Color</li>\n<li>Title Font Size</li>\n<li>Read More Show/Hide</li>\n<li>Change Read More Text</li>\n</ul>\n<p><strong>Thumbnail Options</strong></p>\n<ul>\n<li>Thumbnails Custom Border Setting</li>\n<li>Show Numbering On Thumbnails</li>\n<li>Thumbnails Spacing ( px )</li>\n<li>Image Gray Scale (Gray Effect)</li>\n<li>Video Auto-Play In lightbox</li>\n<li>Open Image Link URL</li>\n<li>Link Nofollow</li>\n<li>Link No opener</li>\n<li>Link No referrer</li>\n</ul>\n<p><strong>Filters</strong></p>\n<ul>\n<li>Hide filters</li>\n<li>Multi-Filters Enable</li>\n<li>Ascending</li>\n<li>Descending Button</li>\n<li>Shuffle Button</li>\n<li>Search Box</li>\n<li>Filters Color</li>\n<li>Filters underline Color</li>\n</ul>\n<p><strong>SHORTCODE</strong></p>\n<p>Portfolio Gallery offers an easy-to-use Insert Gallery, which means you never need to work with shortcodes again when inserting and manageing galleries. You just need to copy and paste gallery shortcode into the gallery.<br />\nIf you do want to work with shortcodes, there is a powerful shortcode system as you’d expect of a popular WordPress gallery plugin.<br />\nFor more information, feel free to visit the official website for portfolio gallery.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.6.7.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/portfolio-filter-gallery/assets/screenshot-1.png?rev=1514860",
            "caption": "Portfolio Filter Gallery 3 Column With Number And Title"
        },
        {
            "src": "https://ps.w.org/portfolio-filter-gallery/assets/screenshot-2.png?rev=1757455",
            "caption": "Portfolio Filter Gallery Without Spacing"
        },
        {
            "src": "https://ps.w.org/portfolio-filter-gallery/assets/screenshot-3.png?rev=1787577",
            "caption": "Portfolio Filter Gallery With 2 Column Layout"
        },
        {
            "src": "https://ps.w.org/portfolio-filter-gallery/assets/screenshot-4.png?rev=1787577",
            "caption": "Portfolio Filter Gallery With Gray Scale(Gray Effect On Hover) On Thumbnails"
        },
        {
            "src": "https://ps.w.org/portfolio-filter-gallery/assets/screenshot-5.png?rev=1787577",
            "caption": "Portfolio Filter Gallery With Masonry"
        },
        {
            "src": "https://ps.w.org/portfolio-filter-gallery/assets/screenshot-6.png?rev=1787577",
            "caption": "Add Filters In Portfolio Gallery"
        },
        {
            "src": "https://ps.w.org/portfolio-filter-gallery/assets/screenshot-7.png?rev=1787577",
            "caption": "Filter Thumbnails By Portfolio Filters"
        },
        {
            "src": "https://ps.w.org/portfolio-filter-gallery/assets/screenshot-8.png?rev=2833681",
            "caption": "A. Adding Thumbnails  B. Shortcode"
        },
        {
            "src": "https://ps.w.org/portfolio-filter-gallery/assets/screenshot-9.png?rev=2833681",
            "caption": "Portfolio Filter Gallery Settings"
        }
    ],
    "tags": {
        "gallery": "gallery",
        "portfolio": "portfolio",
        "portfolio-gallery": "portfolio gallery",
        "responsive": "responsive",
        "wordpress-portfolio-plugin": "wordpress portfolio plugin"
    },
    "stable_tag": "1.6.7",
    "versions": {
        "0.2.0": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.0.zip",
        "0.2.1": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.1.zip",
        "0.2.10": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.10.zip",
        "0.2.11": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.11.zip",
        "0.2.12": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.12.zip",
        "0.2.13": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.13.zip",
        "0.2.14": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.14.zip",
        "0.2.15": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.15.zip",
        "0.2.16": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.16.zip",
        "0.2.17": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.17.zip",
        "0.2.18": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.18.zip",
        "0.2.19": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.19.zip",
        "0.2.2": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.2.zip",
        "0.2.20": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.20.zip",
        "0.2.21": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.21.zip",
        "0.2.22": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.22.zip",
        "0.2.23": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.23.zip",
        "0.2.24": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.24.zip",
        "0.2.25": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.25.zip",
        "0.2.26": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.26.zip",
        "0.2.27": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.27.zip",
        "0.2.3": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.3.zip",
        "0.2.4": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.4.zip",
        "0.2.5": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.5.zip",
        "0.2.6": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.6.zip",
        "0.2.7": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.7.zip",
        "0.2.8": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.8.zip",
        "0.2.9": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.2.9.zip",
        "0.3.0": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.3.0.zip",
        "0.3.1": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.3.1.zip",
        "0.3.3": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.3.3.zip",
        "0.3.4": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.3.4.zip",
        "0.3.5": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.0.3.5.zip",
        "1.0.0": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.0.6.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.0.7.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.0.8.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.1.8.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.2.6.zip",
        "1.2.7": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.2.7.zip",
        "1.2.8": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.2.8.zip",
        "1.2.9": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.2.9.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.3.3.zip",
        "1.3.3.1": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.3.3.1.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.3.8.zip",
        "1.3.9": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.3.9.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.4.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.4.5.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.4.6.zip",
        "1.4.7": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.4.7.zip",
        "1.4.8": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.4.8.zip",
        "1.4.9": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.4.9.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.5.3.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.5.4.zip",
        "1.5.5": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.5.5.zip",
        "1.5.6": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.5.6.zip",
        "1.5.7": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.5.7.zip",
        "1.5.8": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.5.8.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.6.3.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.6.5.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.6.6.zip",
        "1.6.7": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.1.6.7.zip",
        "trunk": "https://downloads.wordpress.org/plugin/portfolio-filter-gallery.zip"
    },
    "business_model": "commercial",
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://paypal.me/awplife",
    "banners": {
        "low": "https://ps.w.org/portfolio-filter-gallery/assets/banner-772x250.png?rev=3099185",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/portfolio-filter-gallery/assets/icon-128x128.gif?rev=2330535",
        "2x": "https://ps.w.org/portfolio-filter-gallery/assets/icon-256x256.gif?rev=2330535"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 96,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "portfolio-filter-gallery",
            "language": "de_DE",
            "version": "1.6.7",
            "updated": "2022-01-07 21:05:03",
            "package": "https://downloads.wordpress.org/translation/plugin/portfolio-filter-gallery/1.6.7/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "portfolio-filter-gallery",
            "language": "ru_RU",
            "version": "1.6.7",
            "updated": "2023-05-28 08:22:31",
            "package": "https://downloads.wordpress.org/translation/plugin/portfolio-filter-gallery/1.6.7/ru_RU.zip"
        }
    ]
}