{
    "name": "Post Rating and Review",
    "slug": "post-rating-and-review",
    "version": "1.3.4",
    "author": "<a href=\"https://profiles.wordpress.org/bourgesloic/\">Loïc Bourgès</a>",
    "author_profile": "https://profiles.wordpress.org/bourgesloic/",
    "contributors": {
        "bourgesloic": {
            "profile": "https://profiles.wordpress.org/bourgesloic/",
            "avatar": "https://secure.gravatar.com/avatar/545b34164fcbc1f9461c238bf13c2298?s=96&d=monsterid&r=g",
            "display_name": "bourgesloic"
        }
    },
    "requires": "5.0",
    "tested": "6.0.9",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 3,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 3,
    "support_url": "https://wordpress.org/support/plugin/post-rating-and-review/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 50,
    "downloaded": 2959,
    "last_updated": "2022-07-14 10:08:00",
    "added": "2022-02-12",
    "homepage": "https://fr.wordpress.org/plugins/post-rating-and-review/",
    "sections": {
        "description": "<p>The &#8220;Post Rating and Review&#8221; plugin offers the possibility to connected visitors to review posts or types of posts that you have created (custom post types). You may define the rating scale yourself.</p>\n<p>You can use the plugin in 2 ways:</p>\n<ol>\n<li>Full activation of reviews management (rating + comment): to allow your users to rate <strong>AND</strong> leave a comment</li>\n<li>Enabling rating only: when you want your users to leave a rating but you don&#8217;t need to collect their feedback</li>\n</ol>\n<p>These features are mainly usable with shortcodes, so without development. Three shortcodes are integrated into the plugin allowing the display of 3 different widgets:</p>\n<ul>\n<li>the &#8220;set rating&#8221; widget which allows a visitor to leave a rating for a post</li>\n<li>the &#8220;display rating&#8221; widget which allows you to display the overall rating of a post</li>\n<li>the &#8220;rating chart&#8221; widget which displays the overall rating of a post as well as a breakdown by rating scale</li>\n</ul>\n<p>Enabling review management will automatically display the &#8220;rating chart&#8221; widget above the list of comments in a single post page without the need of a shortcode. Additionally, you can integrate other widgets on the same page if you wish (for instance, a widget &#8220;display rating&#8221; at the top of the page).</p>\n<p>The plugin also includes functionalities to manage email notification to posts authors when a new review of their post is submitted.</p>\n<p>This plugin integrates schema.org specifications on ratings: microdata will be automatically generated when you display the overall rating of a post (&#8220;aggregateRating&#8221; type).</p>\n<p>An important point: in this first version, the plugin allows rating only for <strong>visitors connected to your site</strong>, which seems to us to be the best choice to manage reviews on a website. Nevertheless, a future update may integrate the management of ratings and reviews by non-connected visitors if needed.</p>\n<p>I developed this plugin for my own use and then made it as configurable as possible so that it could be used by others. Do not hesitate to contact me if you are missing certain features. I can&#8217;t promise you that I will be able to integrate them into a future release for you, but it doesn&#8217;t hurt to ask!</p>\n<h3>Overview of plugin options</h3>\n<p>You can access and customize the following parameters:</p>\n<h4>Rating widget general settings</h4>\n<ul>\n<li>Rating max (integer): maximum rating that a visitor can assign (usually 5)</li>\n<li>Default star size: size in pixels of the stars displayed in the widgets. This parameter can then be modified when calling a shortcode.</li>\n<li>Step for rating set: precision for the visitor to assign a rating (I recommend 0.5 or 1)</li>\n<li>Color for stars: color of the stars displayed within all widgets</li>\n<li>Color for widget chart bar: color of the chart bar in the detailed rating chart</li>\n<li>Color for widget chart bar (hover): color of the chart bar when cursor hovers in the detailed rating chart</li>\n<li>Color to highlight user owned review: color of border to highlight connected user owned review</li>\n</ul>\n<h4>Rating display settings</h4>\n<ul>\n<li>Display overall rating after stars: if yes, the shortcode overall rating (prar_display_rating_for_post) will display the rating in plain text after the stars.</li>\n<li>Display number of ratings after stars: if yes, the shortcode overall rating (prar_display_rating_for_post) will display the number of ratings after the stars.</li>\n<li>Text displayed below user&#8217;s rating: indicates the text displayed below a user&#8217;s note when the user has already rated (shortcode prar_set_rating_for_post). The text {note} will be replaced by the rating given by the user.</li>\n</ul>\n<h4>Rating recording settings</h4>\n<ul>\n<li>Text displayed after rating update: this text will be displayed under the widget when the visitor validates his rating (shortcode prar_set_rating_for_post). After a few moments, this text will disappear and be replaced by the text defined in &#8220;text displayed below the user note&#8221; option field.</li>\n<li>User can change rating after submission?: if yes, the visitor can modify his rating even after submission. If not, the visitor will be able to modify his note as long as he does not leave the page; if he leaves the page and then returns, the rating will no longer be editable.</li>\n<li>Save overall rating and number of ratings in post meta? : if yes, the overall rating as well as the number of ratings will be updated in the meta of the post that the visitor rated. You can then choose the name of the fields that will be saved (meta_key in the postmeta table) and what type of meta you want to use (Meta WordPress as standard, ACF field if you use ACF and you have created a custom field to store these values ).</li>\n</ul>\n<h4>Reviews management settings</h4>\n<p>Enable review management? : if yes, the management of reviews will be activated. Then choose the type or types of post for which you want to activate this management of reviews. Then indicate which fields are mandatory for a visitor to be able to submit their review (N.B. at least one of the 2 fields must be selected as mandatory).<br />\nYou can also indicate if a review author have the possibility to modify and/or delete its review (N.B. it applies until review has not been answered). Last, you can allow modifying review in WP backoffice by another user that review author.</p>\n<h4>Email notifications settings</h4>\n<ul>\n<li>Send an email to the post author when a new rating is submitted: useful when you do not use review management functionalities. Selecting &#8220;yes&#8221; will enable sending a notification email to the post author when a rating is submitted by a visitor through the plugin shortcode.</li>\n<li>Send an email to the post author when a new review is posted: WordPress includes a notification email to post authors for new comments. If you select &#8220;yes&#8221;, WordPress standard email is customized and includes the rating submitted by the reviewer.</li>\n</ul>\n<h4>Tools</h4>\n<ul>\n<li>By clicking on the &#8220;Start database reset&#8221; button, all datas stored by the plugin will be erased. This can be useful in the development phase to test your site and dump the data from your tests before going live.</li>\n</ul>\n<h3>Rating Management Shortcodes</h3>\n<p>Three shortcodes display a Rating widget. You can integrate these shortcodes in several ways: in the Gutenberg editor, in the Classic Editor, in a widget or even directly in your templates.<br />\nYou can also integrate several rating widgets on the same page: for example, if you integrate the shortcode at the top and bottom of the page, the validation of the rating with one of rating widgets will trigger the update of the other widgets present on the page.</p>\n<h4>1. Shortcode to give a rating</h4>\n<pre><code>[prar_set_rating_for_post]\n</code></pre>\n<p>Optional parameters accepted in the shortcode:</p>\n<ul>\n<li>post_id (numeric): id of the post that will be rated by the visitor. If the parameter is not specified, the plugin will use the active post.</li>\n<li>size (numeric): size in pixels of the stars displayed. By default, uses the size defined in the plugin options.</li>\n<li>step (numeric &gt; 0 and &lt;= 1): by default, uses the value indicated in the options of the plugin.</li>\n<li>readonly (true/false): displays the read-only widget that cannot be modified by the visitor. This can be useful to show the visitor the rating he gave to a post (for example in a My Account section).</li>\n<li>class (text): css class that will be added to the widget to facilitate formatting customization</li>\n<li>external_id (numeric): this is the id of a post attached to the post_id you specified. Example of use: you have created two types of posts &#8220;Books&#8221; and &#8220;Writers&#8221;, each book being attached to a writer. You call the shortcode for a book and you provide the writer&#8217;s post_id in the &#8220;external_id&#8221; parameter. The plugin will store the writer&#8217;s id along with book&#8217;s post id. It will allow you to display the writer&#8217;s overall rating on his page: this rating will be based on all of his books that have been rated by visitors on your website .</li>\n<li>update_after_vote (false / true): by default filled by the value indicated in the options of the plugin. If false, visitors will not be able to change their rating once they leave the page. When visitors return to the page, they will see the rating they gave but will not be able to modify it. If true, the note will be editable at any time by the visitor.</li>\n</ul>\n<p>Example:</p>\n<pre><code>[prar_set_rating_for_post post_id=\"153\" step=\"0.5\" size=\"32\" update_after_vote=\"false\"]\n</code></pre>\n<h4>2. Shortcode to display overall rating</h4>\n<pre><code>[prar_display_rating_for_post]\n</code></pre>\n<p>Optional parameters accepted in the shortcode:</p>\n<ul>\n<li>post_id (numeric): id of the post for which you want to display the overall rating. If the parameter is not specified, the plugin will use the active post.</li>\n<li>size (numeric): size in pixels of the stars displayed. By default, uses the size defined in the plugin options.</li>\n<li>step (numeric &gt; 0 and &lt;= 1): by default, uses the value indicated in the options of the plugin.</li>\n<li>display_compteurs (true/false): if true, the overall rating as well as the number of ratings will be displayed next to the widget.</li>\n<li>class (text): css class that will be added to the widget to facilitate formatting customization</li>\n<li>user_id (numeric): if the id of a user is indicated then the behavior will depend on the post_id and external_id parameters. Below are the different cases:<br />\nuser_id filled in alone: ​​the widget will display the overall rating of a given user (average of all his ratings)<br />\nuser_id with post_id: the widget will display the rating given by the user to the post<br />\nuser_id with external_id: the widget will display the overall rating of all ratings given by the user and linked to this external_id.</li>\n<li>external_id (numeric): this is the id of a post attached to the post_id you specified (cf. shortcode prar_set_rating_for_post). If filled in alone (without user_id or post_id), then the widget will display the overall rating of all ratings assigned to this external_id.</li>\n</ul>\n<p>Example:</p>\n<pre><code>[prar_display_rating_for_post post_id=\"153\" size=\"32\" display_compteurs=\"true\"]\n</code></pre>\n<h4>3. Shortcode to display overall rating + detailed rating chart</h4>\n<pre><code>[prar_display_rating_chart_for_post]\n</code></pre>\n<p>Optional parameters accepted in the shortcode:</p>\n<ul>\n<li>post_id (numeric): id of the post for which you want to display the widget. If the parameter is not specified, the plugin will use the active post.</li>\n<li>size (numeric): height in pixels of the horizontal bars used to represent the number of notes per note scale.</li>\n<li>class (text): css class that will be added to the widget to facilitate formatting customization</li>\n</ul>\n<p>Example:</p>\n<pre><code>[prar_display_rating_chart_for_post post_id=\"153\" size=\"20\"]\n</code></pre>\n<h3>Overview of reviews management</h3>\n<p>Managing reviews consists of associating a rating with a comment. The reviews management uses WordPress commenting functionalities: therefore, comments must be activated for the types of post for which you want to activate reviews.<br />\nThanks to the use of standard WP features, the settings you specify for comments will automatically apply to reviews (manual approval of comments, notification messages, automatic moderation, etc.).</p>\n<p>The settings that <strong>will not apply</strong> to review management are:</p>\n<ol>\n<li>&#8220;Users must be registered and logged in to comment&#8221;: currently the plugin only accepts reviews for logged-in visitors. Regardless of your choice for this option, only logged-in visitors will be able to leave a review.</li>\n<li>Enable threaded (nested) comments N levels deep: in the plugin, only administrators will be able to respond to a review via the WordPress admin screens. Visitors &#8211; logged in or not &#8211; will not be able to respond to a review.</li>\n</ol>\n<p>To enable reviews, indicate &#8220;yes&#8221; in the plugin options (&#8220;Reviews management settings&#8221; section) then select the post types for which you want the review management features to be automatically implemented.<br />\nWhen you activate this management of reviews, the standard &#8220;Comments&#8221; area will be replaced by a plugin owned template (&#8220;post-reviews.php&#8221;) which is located in the &#8220;includes/template&#8221; folder of the plugin. You can also customize this template by copying it into a &#8220;prar-rating&#8221; folder in your theme.<br />\nThis template displays the overall rating, the detailed rating chart, the list of reviews already published as well as a button allowing a visitor to leave a new review. This button is active if the visitor is logged in and has not already left a review on the post. The writing of the review by the visitor is done in a popin which combines the rating attribution and the comment left by the visitor. Via the options of the plugin, it is possible to determine if the note and/or the comment are mandatory to leave a review.<br />\nReviews left by users will be visible in admin in the standard WordPress comments list as well as on the post editing page.</p>\n<h3>Overview of email notifications management</h3>\n<p>You can activate a functionality which will send emails to post authors each time a new rating or a new review of their post is submitted.</p>\n<h4>How it works</h4>\n<ul>\n<li>Notification of new review: email sending is based on WordPress standard functionality. Email content and subject are customized through a txt template named <code>email-author-notification-new-review_en_US.txt</code> (en_US can be changed with your locale if you want to translate it to your language).<br />\nWhen manual approbation on comments is activated, the notification email is sent to the post author as soon as the review is approved in WordPress admin.<br />\nImportant notice: WordPress does not send the notification email when the user who did approve the review is also the post author. In the same logic, WordPress does not send the email when the review author is also the post author.</li>\n<li>Notification of new rating: this functionality is almost the same as the notification&#8217;s for new review. It is useful when you do not use these plugin review management functionalities (i.e. you just use the shortcodes as a standalone). The txt template of this email is <code>email-author-notification-new-rating_en_US.txt</code>.</li>\n</ul>\n<p>Both emails are in plain-text format. You can customize these emails copying txt template in a &#8220;prar-rating&#8221; folder in your theme directory, then change the locale if you need (for instance, <code>email-author-notification-new-rating_de_DE.txt</code> if your website is in german language). Text between {} shall not be changed: it will be replaced dynamically by values when the email is generated.</p>\n<h3>For Developers</h3>\n<p>Several hooks are available for developers as well as callable functions:</p>\n<h4>Actions</h4>\n<ul>\n<li><code>prar_rating_before_save_note</code><br />\nCalled before saving rating to database<br />\nParameters: <code>post_id, user_id, note, external_id</code></li>\n<li><code>prar_rating_after_save_note</code><br />\nCalled right after saving rating to database<br />\nParameters: <code>post_id, user_id, note, external_id</code></li>\n<li><code>prar_rating_tpl_reviews_begin_header</code><br />\nCalled in the post-reviews.php template just before the section title<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_reviews_before_add_review</code><br />\nCalled in the post-reviews.php template just before the &#8220;Add a review&#8221; button<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_reviews_after_add_review</code><br />\nCalled in the post-reviews.php template just after the &#8220;Add a review&#8221; button<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_reviews_end_header</code><br />\nCalled in the post-reviews.php template at the end of the header<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_have_reviews_start</code><br />\nCalled in the post-reviews.php template just before the list of reviews (when there are reviews)<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_have_reviews_end</code><br />\nCalled in the post-reviews.php template just after the list of reviews (when there are reviews)<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_no_reviews_start</code><br />\nCalled in the post-reviews.php template just before the list of reviews (when there are no reviews for the post yet)<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_no_reviews_end</code><br />\nCalled in the post-reviews.php template just before the list of reviews (when there are no reviews for the post yet)<br />\nParameter: none</li>\n</ul>\n<h4>Filters</h4>\n<ul>\n<li><code>prar_rating_sc_set_note_atts</code><br />\nAllows to override the parameters indicated during the call to the shortcode prar_set_rating_for_post<br />\nParameter: <code>array atts</code></li>\n<li><code>prar_rating_text_save_user_note</code><br />\nAllows to override the text displayed to the visitor when the rating is saved with the prar_set_rating_for_post shortcode. Default text is set in plugin options<br />\nParameters: <code>initial text, note, post_id</code></li>\n<li><code>prar_rating_text_user_note</code><br />\nAllows to override the text displayed to the visitor next to his rating in the prar_set_rating_for_post shortcode. Default text is set in plugin options<br />\nParameters: <code>initial text, note, post_id</code></li>\n<li><code>prar_rating_html_block_user_note</code><br />\nAllows to modify the html block which is after the rating in the prar_set_rating_for_post shortcode.<br />\nParameters: <code>initial html block, note, post_id</code></li>\n<li><code>prar_rating_html_block_display_note</code><br />\nAllows to modify the html block displayed after the widget in the shortcode prar_display_rating_for_post<br />\nParameters: <code>initial html block, array with overall note information (number_of_notes, note, sum_notes)</code></li>\n<li><code>prar_rating_notification_new_review_email_subject</code><br />\nAllows to customize email subject of new review notification email sent to post author<br />\nParameters: <code>subject, comment (object)</code></li>\n<li><code>prar_rating_notification_new_review_email_header</code><br />\nAllows to customize email headers of new review notification email sent to post author<br />\nParameters: <code>header, comment (object)</code></li>\n<li><code>prar_rating_notification_new_rating_email_subject</code><br />\nAllows to customize email subject of new rating notification email sent to post author<br />\nParameters: <code>subject, blogname, post (object), rating (array)</code></li>\n<li><code>prar_rating_notification_new_rating_email_sender</code><br />\nAllows to customize email sender of new rating notification email sent to post author<br />\nParameters: <code>sender, blogname, post (object), rating (array)</code></li>\n<li><code>prar_rating_notification_new_rating_email_from</code><br />\nAllows to customize email from (in header) of new rating notification email sent to post author<br />\nParameters: <code>from, blogname, post (object), rating (array)</code></li>\n<li><code>prar_rating_notification_new_rating_email_header</code><br />\nAllows to customize email header of new rating notification email sent to post author<br />\nParameters: <code>header, blogname, post (object), rating (array)</code></li>\n<li><code>prar_rating_can_review_be_updated</code><br />\nIndicate if a review can be updated by the review author<br />\nParameters: <code>can_be_uptdated (boolean), comment (object)</code></li>\n</ul>\n<h4>Functions</h4>\n<ul>\n<li><code>prar_rating_get_average_note_for_post</code><br />\nReturns the overall rating for a post, user, external_id as an array (number_of_notes, note, sum_notes)<br />\nParameters: <code>post_id, user_id, external_id</code></li>\n<li><code>prar_rating_get_average_note_for_user</code><br />\nReturns the overall rating given by a user as an array (number_of_notes, rating, sum_notes)<br />\nParameter: <code>user_id</code></li>\n<li><code>prar_rating_get_average_note_for_external_id</code><br />\nReturns the overall rating for an external_id as an array (number_of_notes, rating, sum_notes)<br />\nParameter: <code>external_id</code></li>\n<li><code>prar_rating_get_all_notes_for_user</code><br />\nReturns an array with one line per rating assigned by a user (post, user_id, rating, external_id, date)<br />\nParameter: <code>user_id</code></li>\n<li><code>prar_rating_get_all_notes_for_post</code><br />\nReturns an array with one row per rating assigned for a post (post, user_id, rating, external_id, date)<br />\nParameter: <code>post_id</code></li>\n<li><code>prar_rating_get_all_notes_for_external_id</code><br />\nReturns an array with one row per rating assigned to an external_id (post, user_id, rating, external_id, date)<br />\nParameter: <code>external_id</code></li>\n</ul>\n<h4>JavaScript</h4>\n<ul>\n<li><code>trigger(\"prar_rating_saved\")</code><br />\nAn &#8216;prar_rating_saved&#8217; event is generated related to the DOM element that carries the widget. This allows you, if necessary, to trigger specific actions in your website when assigning a rating. N.B. this event is generated when the note is saved in a <code>\"prar_set_rating_for_post\"</code> widget. It is not generated as part of the management of reviews for which the note is recorded after validation of the complete form.</li>\n<li>event listener <code>prar_rating_display_stars</code><br />\nIf your page is generated through ajax and includes the plugin shortcode, you must trigger this event in order to display the stars icons. Trigger the event after having made changes in DOM through your ajax function.</li>\n</ul>\n<h3>Special thanks</h3>\n<p>The development of this plugin was greatly facilitated by &#8220;RaterJS&#8221; javascript library developed by Fredrik Olsson. Many thanks also to <a href=\"https://www.ericbourges.com\" rel=\"nofollow ugc\">Eric</a> for his valuable design advices and feature ideas.</p>\n",
        "installation": "<ol>\n<li>Navigate to Dashboard -&gt; Plugins -&gt; Add New and search for the plugin</li>\n<li>Click on &#8220;Install Now&#8221; and then &#8220;Activate&#8221;</li>\n</ol>\n",
        "faq": "\n<dt id='do%20i%20need%20programing%20skills%20to%20use%20the%20plugin%3F'>\nDo I need programing skills to use the plugin?\n</h4>\n<p>\n<p>No. You just need to have a global understanding of the way WordPress works, and to know how to use shortcodes. If you need further information on shortcodes in WordPress, find below links to articles on wordpress.com website:<br />\n<a href=\"https://wordpress.com/go/website-building/what-is-a-shortcode/\" rel=\"nofollow ugc\">What Is a Shortcode?</a><br />\n<a href=\"https://wordpress.com/go/how-to/wordpress-shortcodes-what-they-are-when-to-use/\" rel=\"nofollow ugc\">WordPress Shortcodes: What They Are and When to Use Them</a></p>\n</p>\n<dt id='does%20the%20plugin%20works%20with%20caching%20plugins%3F'>\nDoes the plugin works with caching plugins?\n</h4>\n<p>\n<p>Logically yes. This plugin is based on ajax development which should not be taken into account by caching plugins.<br />\nHowever let me know through support page if you meet any difficulty with caching plugin.</p>\n</p>\n<dt id='may%20i%20be%20able%20to%20open%20reviews%20submission%20to%20non-logged-in%20users%3F'>\nMay I be able to open reviews submission to non-logged-in users?\n</h4>\n<p>\n<p>No. Reviews and rating are open to logged-in users. It allows to avoid cookie usage which could be complex within GDPR regulation in Europe.<br />\nI will consider to include this functionaly if the demand is growing.</p>\n</p>\n<dt id='do%20i%20need%20to%20pay%20something%20to%20use%20the%20plugin%3F'>\nDo I need to pay something to use the plugin?\n</h4>\n<p>\n<p>No! This plugin is not a freemium. Everything comes for free. I just developed it because I was able to (very humbly!) and because I like it.<br />\nHowever, I accept donations if you love this plugin 😉</p>\n</p>\n\n",
        "changelog": "<h4>1.3.4 &#8211; Released on 14 july 2022</h4>\n<ul>\n<li>FIX: compatibility with mandara theme</li>\n<li>FIX: stars alignement in detailed chart widget</li>\n</ul>\n<h4>1.3.3 &#8211; Released on 12 july 2022</h4>\n<ul>\n<li>FIX: missing closing </li>\n</ul>\n<p>&lt;</p>\n<p>div&gt; in detailed rating chart widget</p>\n<h4>1.3.2 &#8211; Released on 11 july 2022</h4>\n<ul>\n<li>TWEAK: add possibility to change border color for connected user owned review</li>\n</ul>\n<h4>1.3.1 &#8211; Released on 11 july 2022</h4>\n<ul>\n<li>FIX: in rare cases, multiple notes for the same user might occur through multiple clicks</li>\n<li>FIX: round issue when calculating average note (taking into account half point notes)</li>\n</ul>\n<h4>1.3.0 &#8211; Released on 8 july 2022</h4>\n<ul>\n<li>ADD: widget display note may be automatically integrated in archive page (after post title)</li>\n<li>ADD: widget display note may be automatically integrated in single page (at the beginning of post content)</li>\n<li>ADD: star color may be customized in admin, available also for chart bar in the widget detailed rating chart</li>\n</ul>\n<h4>1.2.2 &#8211; Released on 7 july 2022</h4>\n<ul>\n<li>FIX: round issue when calculating average note</li>\n<li>FIX: files part-update-review.php and post-rating-and-review-admin.js were missing in the plugin files</li>\n<li>TWEAK: better management of microdata generation</li>\n</ul>\n<h4>1.2.1 &#8211; Released on 19 april 2022</h4>\n<ul>\n<li>FIX: file prar-rating-plugins-compatibility.php was missing in the plugin files</li>\n</ul>\n<h4>1.2.0 &#8211; Released on 8 March 2022</h4>\n<ul>\n<li>ADD: reviews can be modified by review author if enable in plugin options</li>\n<li>ADD: option in admin to forbid review modification in WP admin by another user that review author</li>\n<li>ADD: new review validation now handled through ajax</li>\n<li>TWEAK: in post edit page in admin, add rating given within list of reviews metabox</li>\n<li>TWEAK: in front, management of WordPress error message through ajax when creating a review</li>\n<li>FIX: add compatibility with &#8220;Zeno Report Comments&#8221; plugin</li>\n</ul>\n<h4>1.1.1 &#8211; Released on 19 February 2022</h4>\n<ul>\n<li>FIX: widget chart display was broken in post edit admin page due to prar-admin-style.css</li>\n</ul>\n<h4>1.1.0 &#8211; Released on 18 February 2022</h4>\n<ul>\n<li>ADD: functionalities for email notification management to the post authors</li>\n<li>FIX: in the shortcode to display chart, rating could be present twice due to half notes</li>\n<li>FIX: in review management, comment text remained mandatory even if it was specified as optional in plugin options.</li>\n</ul>\n<h4>1.0.1 &#8211; Released on 15 February 2022</h4>\n<ul>\n<li>TWEAK: added javascript event listener (<code>prar_rating_display_stars</code>) in order to display stars icons when a content is generated through ajax.</li>\n</ul>\n<h4>1.0.0 &#8211; Released on 13 February 2022</h4>\n<ul>\n<li>Initial release.</li>\n</ul>\n"
    },
    "short_description": "Easy-to-use plugin to manage star rating reviews on your posts or custom posts. Built on Wordpress comments functionalites. Neat and hasslefree.",
    "description": "<p>The &#8220;Post Rating and Review&#8221; plugin offers the possibility to connected visitors to review posts or types of posts that you have created (custom post types). You may define the rating scale yourself.</p>\n<p>You can use the plugin in 2 ways:</p>\n<ol>\n<li>Full activation of reviews management (rating + comment): to allow your users to rate <strong>AND</strong> leave a comment</li>\n<li>Enabling rating only: when you want your users to leave a rating but you don&#8217;t need to collect their feedback</li>\n</ol>\n<p>These features are mainly usable with shortcodes, so without development. Three shortcodes are integrated into the plugin allowing the display of 3 different widgets:</p>\n<ul>\n<li>the &#8220;set rating&#8221; widget which allows a visitor to leave a rating for a post</li>\n<li>the &#8220;display rating&#8221; widget which allows you to display the overall rating of a post</li>\n<li>the &#8220;rating chart&#8221; widget which displays the overall rating of a post as well as a breakdown by rating scale</li>\n</ul>\n<p>Enabling review management will automatically display the &#8220;rating chart&#8221; widget above the list of comments in a single post page without the need of a shortcode. Additionally, you can integrate other widgets on the same page if you wish (for instance, a widget &#8220;display rating&#8221; at the top of the page).</p>\n<p>The plugin also includes functionalities to manage email notification to posts authors when a new review of their post is submitted.</p>\n<p>This plugin integrates schema.org specifications on ratings: microdata will be automatically generated when you display the overall rating of a post (&#8220;aggregateRating&#8221; type).</p>\n<p>An important point: in this first version, the plugin allows rating only for <strong>visitors connected to your site</strong>, which seems to us to be the best choice to manage reviews on a website. Nevertheless, a future update may integrate the management of ratings and reviews by non-connected visitors if needed.</p>\n<p>I developed this plugin for my own use and then made it as configurable as possible so that it could be used by others. Do not hesitate to contact me if you are missing certain features. I can&#8217;t promise you that I will be able to integrate them into a future release for you, but it doesn&#8217;t hurt to ask!</p>\n<h3>Overview of plugin options</h3>\n<p>You can access and customize the following parameters:</p>\n<h4>Rating widget general settings</h4>\n<ul>\n<li>Rating max (integer): maximum rating that a visitor can assign (usually 5)</li>\n<li>Default star size: size in pixels of the stars displayed in the widgets. This parameter can then be modified when calling a shortcode.</li>\n<li>Step for rating set: precision for the visitor to assign a rating (I recommend 0.5 or 1)</li>\n<li>Color for stars: color of the stars displayed within all widgets</li>\n<li>Color for widget chart bar: color of the chart bar in the detailed rating chart</li>\n<li>Color for widget chart bar (hover): color of the chart bar when cursor hovers in the detailed rating chart</li>\n<li>Color to highlight user owned review: color of border to highlight connected user owned review</li>\n</ul>\n<h4>Rating display settings</h4>\n<ul>\n<li>Display overall rating after stars: if yes, the shortcode overall rating (prar_display_rating_for_post) will display the rating in plain text after the stars.</li>\n<li>Display number of ratings after stars: if yes, the shortcode overall rating (prar_display_rating_for_post) will display the number of ratings after the stars.</li>\n<li>Text displayed below user&#8217;s rating: indicates the text displayed below a user&#8217;s note when the user has already rated (shortcode prar_set_rating_for_post). The text {note} will be replaced by the rating given by the user.</li>\n</ul>\n<h4>Rating recording settings</h4>\n<ul>\n<li>Text displayed after rating update: this text will be displayed under the widget when the visitor validates his rating (shortcode prar_set_rating_for_post). After a few moments, this text will disappear and be replaced by the text defined in &#8220;text displayed below the user note&#8221; option field.</li>\n<li>User can change rating after submission?: if yes, the visitor can modify his rating even after submission. If not, the visitor will be able to modify his note as long as he does not leave the page; if he leaves the page and then returns, the rating will no longer be editable.</li>\n<li>Save overall rating and number of ratings in post meta? : if yes, the overall rating as well as the number of ratings will be updated in the meta of the post that the visitor rated. You can then choose the name of the fields that will be saved (meta_key in the postmeta table) and what type of meta you want to use (Meta WordPress as standard, ACF field if you use ACF and you have created a custom field to store these values ).</li>\n</ul>\n<h4>Reviews management settings</h4>\n<p>Enable review management? : if yes, the management of reviews will be activated. Then choose the type or types of post for which you want to activate this management of reviews. Then indicate which fields are mandatory for a visitor to be able to submit their review (N.B. at least one of the 2 fields must be selected as mandatory).<br />\nYou can also indicate if a review author have the possibility to modify and/or delete its review (N.B. it applies until review has not been answered). Last, you can allow modifying review in WP backoffice by another user that review author.</p>\n<h4>Email notifications settings</h4>\n<ul>\n<li>Send an email to the post author when a new rating is submitted: useful when you do not use review management functionalities. Selecting &#8220;yes&#8221; will enable sending a notification email to the post author when a rating is submitted by a visitor through the plugin shortcode.</li>\n<li>Send an email to the post author when a new review is posted: WordPress includes a notification email to post authors for new comments. If you select &#8220;yes&#8221;, WordPress standard email is customized and includes the rating submitted by the reviewer.</li>\n</ul>\n<h4>Tools</h4>\n<ul>\n<li>By clicking on the &#8220;Start database reset&#8221; button, all datas stored by the plugin will be erased. This can be useful in the development phase to test your site and dump the data from your tests before going live.</li>\n</ul>\n<h3>Rating Management Shortcodes</h3>\n<p>Three shortcodes display a Rating widget. You can integrate these shortcodes in several ways: in the Gutenberg editor, in the Classic Editor, in a widget or even directly in your templates.<br />\nYou can also integrate several rating widgets on the same page: for example, if you integrate the shortcode at the top and bottom of the page, the validation of the rating with one of rating widgets will trigger the update of the other widgets present on the page.</p>\n<h4>1. Shortcode to give a rating</h4>\n<pre><code>[prar_set_rating_for_post]\n</code></pre>\n<p>Optional parameters accepted in the shortcode:</p>\n<ul>\n<li>post_id (numeric): id of the post that will be rated by the visitor. If the parameter is not specified, the plugin will use the active post.</li>\n<li>size (numeric): size in pixels of the stars displayed. By default, uses the size defined in the plugin options.</li>\n<li>step (numeric &gt; 0 and &lt;= 1): by default, uses the value indicated in the options of the plugin.</li>\n<li>readonly (true/false): displays the read-only widget that cannot be modified by the visitor. This can be useful to show the visitor the rating he gave to a post (for example in a My Account section).</li>\n<li>class (text): css class that will be added to the widget to facilitate formatting customization</li>\n<li>external_id (numeric): this is the id of a post attached to the post_id you specified. Example of use: you have created two types of posts &#8220;Books&#8221; and &#8220;Writers&#8221;, each book being attached to a writer. You call the shortcode for a book and you provide the writer&#8217;s post_id in the &#8220;external_id&#8221; parameter. The plugin will store the writer&#8217;s id along with book&#8217;s post id. It will allow you to display the writer&#8217;s overall rating on his page: this rating will be based on all of his books that have been rated by visitors on your website .</li>\n<li>update_after_vote (false / true): by default filled by the value indicated in the options of the plugin. If false, visitors will not be able to change their rating once they leave the page. When visitors return to the page, they will see the rating they gave but will not be able to modify it. If true, the note will be editable at any time by the visitor.</li>\n</ul>\n<p>Example:</p>\n<pre><code>[prar_set_rating_for_post post_id=\"153\" step=\"0.5\" size=\"32\" update_after_vote=\"false\"]\n</code></pre>\n<h4>2. Shortcode to display overall rating</h4>\n<pre><code>[prar_display_rating_for_post]\n</code></pre>\n<p>Optional parameters accepted in the shortcode:</p>\n<ul>\n<li>post_id (numeric): id of the post for which you want to display the overall rating. If the parameter is not specified, the plugin will use the active post.</li>\n<li>size (numeric): size in pixels of the stars displayed. By default, uses the size defined in the plugin options.</li>\n<li>step (numeric &gt; 0 and &lt;= 1): by default, uses the value indicated in the options of the plugin.</li>\n<li>display_compteurs (true/false): if true, the overall rating as well as the number of ratings will be displayed next to the widget.</li>\n<li>class (text): css class that will be added to the widget to facilitate formatting customization</li>\n<li>user_id (numeric): if the id of a user is indicated then the behavior will depend on the post_id and external_id parameters. Below are the different cases:<br />\nuser_id filled in alone: ​​the widget will display the overall rating of a given user (average of all his ratings)<br />\nuser_id with post_id: the widget will display the rating given by the user to the post<br />\nuser_id with external_id: the widget will display the overall rating of all ratings given by the user and linked to this external_id.</li>\n<li>external_id (numeric): this is the id of a post attached to the post_id you specified (cf. shortcode prar_set_rating_for_post). If filled in alone (without user_id or post_id), then the widget will display the overall rating of all ratings assigned to this external_id.</li>\n</ul>\n<p>Example:</p>\n<pre><code>[prar_display_rating_for_post post_id=\"153\" size=\"32\" display_compteurs=\"true\"]\n</code></pre>\n<h4>3. Shortcode to display overall rating + detailed rating chart</h4>\n<pre><code>[prar_display_rating_chart_for_post]\n</code></pre>\n<p>Optional parameters accepted in the shortcode:</p>\n<ul>\n<li>post_id (numeric): id of the post for which you want to display the widget. If the parameter is not specified, the plugin will use the active post.</li>\n<li>size (numeric): height in pixels of the horizontal bars used to represent the number of notes per note scale.</li>\n<li>class (text): css class that will be added to the widget to facilitate formatting customization</li>\n</ul>\n<p>Example:</p>\n<pre><code>[prar_display_rating_chart_for_post post_id=\"153\" size=\"20\"]\n</code></pre>\n<h3>Overview of reviews management</h3>\n<p>Managing reviews consists of associating a rating with a comment. The reviews management uses WordPress commenting functionalities: therefore, comments must be activated for the types of post for which you want to activate reviews.<br />\nThanks to the use of standard WP features, the settings you specify for comments will automatically apply to reviews (manual approval of comments, notification messages, automatic moderation, etc.).</p>\n<p>The settings that <strong>will not apply</strong> to review management are:</p>\n<ol>\n<li>&#8220;Users must be registered and logged in to comment&#8221;: currently the plugin only accepts reviews for logged-in visitors. Regardless of your choice for this option, only logged-in visitors will be able to leave a review.</li>\n<li>Enable threaded (nested) comments N levels deep: in the plugin, only administrators will be able to respond to a review via the WordPress admin screens. Visitors &#8211; logged in or not &#8211; will not be able to respond to a review.</li>\n</ol>\n<p>To enable reviews, indicate &#8220;yes&#8221; in the plugin options (&#8220;Reviews management settings&#8221; section) then select the post types for which you want the review management features to be automatically implemented.<br />\nWhen you activate this management of reviews, the standard &#8220;Comments&#8221; area will be replaced by a plugin owned template (&#8220;post-reviews.php&#8221;) which is located in the &#8220;includes/template&#8221; folder of the plugin. You can also customize this template by copying it into a &#8220;prar-rating&#8221; folder in your theme.<br />\nThis template displays the overall rating, the detailed rating chart, the list of reviews already published as well as a button allowing a visitor to leave a new review. This button is active if the visitor is logged in and has not already left a review on the post. The writing of the review by the visitor is done in a popin which combines the rating attribution and the comment left by the visitor. Via the options of the plugin, it is possible to determine if the note and/or the comment are mandatory to leave a review.<br />\nReviews left by users will be visible in admin in the standard WordPress comments list as well as on the post editing page.</p>\n<h3>Overview of email notifications management</h3>\n<p>You can activate a functionality which will send emails to post authors each time a new rating or a new review of their post is submitted.</p>\n<h4>How it works</h4>\n<ul>\n<li>Notification of new review: email sending is based on WordPress standard functionality. Email content and subject are customized through a txt template named <code>email-author-notification-new-review_en_US.txt</code> (en_US can be changed with your locale if you want to translate it to your language).<br />\nWhen manual approbation on comments is activated, the notification email is sent to the post author as soon as the review is approved in WordPress admin.<br />\nImportant notice: WordPress does not send the notification email when the user who did approve the review is also the post author. In the same logic, WordPress does not send the email when the review author is also the post author.</li>\n<li>Notification of new rating: this functionality is almost the same as the notification&#8217;s for new review. It is useful when you do not use these plugin review management functionalities (i.e. you just use the shortcodes as a standalone). The txt template of this email is <code>email-author-notification-new-rating_en_US.txt</code>.</li>\n</ul>\n<p>Both emails are in plain-text format. You can customize these emails copying txt template in a &#8220;prar-rating&#8221; folder in your theme directory, then change the locale if you need (for instance, <code>email-author-notification-new-rating_de_DE.txt</code> if your website is in german language). Text between {} shall not be changed: it will be replaced dynamically by values when the email is generated.</p>\n<h3>For Developers</h3>\n<p>Several hooks are available for developers as well as callable functions:</p>\n<h4>Actions</h4>\n<ul>\n<li><code>prar_rating_before_save_note</code><br />\nCalled before saving rating to database<br />\nParameters: <code>post_id, user_id, note, external_id</code></li>\n<li><code>prar_rating_after_save_note</code><br />\nCalled right after saving rating to database<br />\nParameters: <code>post_id, user_id, note, external_id</code></li>\n<li><code>prar_rating_tpl_reviews_begin_header</code><br />\nCalled in the post-reviews.php template just before the section title<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_reviews_before_add_review</code><br />\nCalled in the post-reviews.php template just before the &#8220;Add a review&#8221; button<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_reviews_after_add_review</code><br />\nCalled in the post-reviews.php template just after the &#8220;Add a review&#8221; button<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_reviews_end_header</code><br />\nCalled in the post-reviews.php template at the end of the header<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_have_reviews_start</code><br />\nCalled in the post-reviews.php template just before the list of reviews (when there are reviews)<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_have_reviews_end</code><br />\nCalled in the post-reviews.php template just after the list of reviews (when there are reviews)<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_no_reviews_start</code><br />\nCalled in the post-reviews.php template just before the list of reviews (when there are no reviews for the post yet)<br />\nParameter: none</li>\n<li><code>prar_rating_tpl_no_reviews_end</code><br />\nCalled in the post-reviews.php template just before the list of reviews (when there are no reviews for the post yet)<br />\nParameter: none</li>\n</ul>\n<h4>Filters</h4>\n<ul>\n<li><code>prar_rating_sc_set_note_atts</code><br />\nAllows to override the parameters indicated during the call to the shortcode prar_set_rating_for_post<br />\nParameter: <code>array atts</code></li>\n<li><code>prar_rating_text_save_user_note</code><br />\nAllows to override the text displayed to the visitor when the rating is saved with the prar_set_rating_for_post shortcode. Default text is set in plugin options<br />\nParameters: <code>initial text, note, post_id</code></li>\n<li><code>prar_rating_text_user_note</code><br />\nAllows to override the text displayed to the visitor next to his rating in the prar_set_rating_for_post shortcode. Default text is set in plugin options<br />\nParameters: <code>initial text, note, post_id</code></li>\n<li><code>prar_rating_html_block_user_note</code><br />\nAllows to modify the html block which is after the rating in the prar_set_rating_for_post shortcode.<br />\nParameters: <code>initial html block, note, post_id</code></li>\n<li><code>prar_rating_html_block_display_note</code><br />\nAllows to modify the html block displayed after the widget in the shortcode prar_display_rating_for_post<br />\nParameters: <code>initial html block, array with overall note information (number_of_notes, note, sum_notes)</code></li>\n<li><code>prar_rating_notification_new_review_email_subject</code><br />\nAllows to customize email subject of new review notification email sent to post author<br />\nParameters: <code>subject, comment (object)</code></li>\n<li><code>prar_rating_notification_new_review_email_header</code><br />\nAllows to customize email headers of new review notification email sent to post author<br />\nParameters: <code>header, comment (object)</code></li>\n<li><code>prar_rating_notification_new_rating_email_subject</code><br />\nAllows to customize email subject of new rating notification email sent to post author<br />\nParameters: <code>subject, blogname, post (object), rating (array)</code></li>\n<li><code>prar_rating_notification_new_rating_email_sender</code><br />\nAllows to customize email sender of new rating notification email sent to post author<br />\nParameters: <code>sender, blogname, post (object), rating (array)</code></li>\n<li><code>prar_rating_notification_new_rating_email_from</code><br />\nAllows to customize email from (in header) of new rating notification email sent to post author<br />\nParameters: <code>from, blogname, post (object), rating (array)</code></li>\n<li><code>prar_rating_notification_new_rating_email_header</code><br />\nAllows to customize email header of new rating notification email sent to post author<br />\nParameters: <code>header, blogname, post (object), rating (array)</code></li>\n<li><code>prar_rating_can_review_be_updated</code><br />\nIndicate if a review can be updated by the review author<br />\nParameters: <code>can_be_uptdated (boolean), comment (object)</code></li>\n</ul>\n<h4>Functions</h4>\n<ul>\n<li><code>prar_rating_get_average_note_for_post</code><br />\nReturns the overall rating for a post, user, external_id as an array (number_of_notes, note, sum_notes)<br />\nParameters: <code>post_id, user_id, external_id</code></li>\n<li><code>prar_rating_get_average_note_for_user</code><br />\nReturns the overall rating given by a user as an array (number_of_notes, rating, sum_notes)<br />\nParameter: <code>user_id</code></li>\n<li><code>prar_rating_get_average_note_for_external_id</code><br />\nReturns the overall rating for an external_id as an array (number_of_notes, rating, sum_notes)<br />\nParameter: <code>external_id</code></li>\n<li><code>prar_rating_get_all_notes_for_user</code><br />\nReturns an array with one line per rating assigned by a user (post, user_id, rating, external_id, date)<br />\nParameter: <code>user_id</code></li>\n<li><code>prar_rating_get_all_notes_for_post</code><br />\nReturns an array with one row per rating assigned for a post (post, user_id, rating, external_id, date)<br />\nParameter: <code>post_id</code></li>\n<li><code>prar_rating_get_all_notes_for_external_id</code><br />\nReturns an array with one row per rating assigned to an external_id (post, user_id, rating, external_id, date)<br />\nParameter: <code>external_id</code></li>\n</ul>\n<h4>JavaScript</h4>\n<ul>\n<li><code>trigger(\"prar_rating_saved\")</code><br />\nAn &#8216;prar_rating_saved&#8217; event is generated related to the DOM element that carries the widget. This allows you, if necessary, to trigger specific actions in your website when assigning a rating. N.B. this event is generated when the note is saved in a <code>\"prar_set_rating_for_post\"</code> widget. It is not generated as part of the management of reviews for which the note is recorded after validation of the complete form.</li>\n<li>event listener <code>prar_rating_display_stars</code><br />\nIf your page is generated through ajax and includes the plugin shortcode, you must trigger this event in order to display the stars icons. Trigger the event after having made changes in DOM through your ajax function.</li>\n</ul>\n<h3>Special thanks</h3>\n<p>The development of this plugin was greatly facilitated by &#8220;RaterJS&#8221; javascript library developed by Fredrik Olsson. Many thanks also to <a href=\"https://www.ericbourges.com\" rel=\"nofollow ugc\">Eric</a> for his valuable design advices and feature ideas.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/post-rating-and-review.1.3.4.zip",
    "upgrade_notice": {
        "": "<p>First relase . Not applicable.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/post-rating-and-review/assets/screenshot-1.png?rev=2677641",
            "caption": "Example of review management on a single post page"
        },
        {
            "src": "https://ps.w.org/post-rating-and-review/assets/screenshot-2.png?rev=2677641",
            "caption": "Shortcodes set and display note on a single post page"
        },
        {
            "src": "https://ps.w.org/post-rating-and-review/assets/screenshot-3.png?rev=2677641",
            "caption": "Settings page in admin"
        },
        {
            "src": "https://ps.w.org/post-rating-and-review/assets/screenshot-4.png?rev=2677641",
            "caption": "Ratings display in admin on post page"
        },
        {
            "src": "https://ps.w.org/post-rating-and-review/assets/screenshot-5.png?rev=2677641",
            "caption": "Admin rating integrated on comments lists"
        }
    ],
    "tags": {
        "custom-post": "custom post",
        "rate-post": "rate post",
        "rating": "rating",
        "review": "review",
        "vote": "vote"
    },
    "stable_tag": "1.3.4",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/post-rating-and-review.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/post-rating-and-review.1.0.1.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/post-rating-and-review.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/post-rating-and-review.1.1.1.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/post-rating-and-review.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/post-rating-and-review.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/post-rating-and-review.1.2.2.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/post-rating-and-review.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/post-rating-and-review.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/post-rating-and-review.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/post-rating-and-review.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/post-rating-and-review.1.3.4.zip",
        "trunk": "https://downloads.wordpress.org/plugin/post-rating-and-review.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.paypal.com/donate/?hosted_button_id=M3C8563S6NEJY",
    "banners": {
        "low": "https://ps.w.org/post-rating-and-review/assets/banner-772x250.png?rev=2681317",
        "high": "https://ps.w.org/post-rating-and-review/assets/banner-1544x500.png?rev=2681317"
    },
    "icons": {
        "1x": "https://ps.w.org/post-rating-and-review/assets/icon-128x128.jpg?rev=2677641",
        "2x": "https://ps.w.org/post-rating-and-review/assets/icon-256x256.jpg?rev=2677641"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "post-rating-and-review",
            "language": "fr_FR",
            "version": "1.3.4",
            "updated": "2022-02-12 13:23:57",
            "package": "http://downloads.wordpress.org/translation/plugin/post-rating-and-review/1.3.4/fr_FR.zip"
        }
    ]
}