{
    "name": "Paid Videochat Turnkey Site &#8211; HTML5 PPV Live Webcams",
    "slug": "ppv-live-webcams",
    "version": "7.1.6",
    "author": "<a href=\"https://videowhisper.com/\">VideoWhisper.com</a>",
    "author_profile": "https://profiles.wordpress.org/videowhisper/",
    "contributors": {
        "videowhisper": {
            "profile": "https://profiles.wordpress.org/videowhisper/",
            "avatar": "https://secure.gravatar.com/avatar/83e8f5d01f2b5af43633cc00c6bf9666?s=96&d=monsterid&r=g",
            "display_name": "videowhisper"
        }
    },
    "requires": "5.1",
    "tested": "6.6.2",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 82,
    "ratings": {
        "5": 16,
        "4": 0,
        "3": 1,
        "2": 0,
        "1": 4
    },
    "num_ratings": 21,
    "support_url": "https://wordpress.org/support/plugin/ppv-live-webcams/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 50,
    "downloaded": 88016,
    "last_updated": "2024-09-12 15:46:00",
    "added": "2015-03-03",
    "homepage": "https://paidvideochat.com",
    "sections": {
        "description": "<p>Transform your WordPress site into a thriving pay-per-view (PPV) video chat service with the PPV Live Webcams plugin. This comprehensive solution allows performers from various sectors—be it education, counseling, or entertainment—to monetize their skills through live streaming, private consultations, and media sales. Designed for seamless operation across devices, this plugin integrates cutting-edge technologies like HTML5 WebRTC/HLS for an optimal user experience without the need for additional downloads.</p>\n<p><a href=\"https://paidvideochat.com/demo/\" title=\"PaidVideochat Turnkey Site Demos\" rel=\"nofollow ugc\">Live Demos</a></p>\n<p>Build a turnkey pay per view (PPV) videochat, your own platform, where live service providers (consultants, advisors, performers) can market and sell their services remotely.</p>\n<h4>Platform Benefits</h4>\n<ul>\n<li>Quick and Cost Effective: Launch a fully functional PPV video chat platform for a fraction of the cost and time required to develop from scratch.</li>\n<li>Leverage WordPress: Built on the reliable WordPress framework, this plugin offers ease of use and access to a vast selection of plugins, themes, community of developers.</li>\n<li>No Downloads Required: With a fully web-based setup, users can start streaming and viewing without the need for additional software or plugins. Optionally, performers can broadcasting using professional RTMP encoders like OBS, mobile Larix Broadcaster and clients can watch using same web interface.</li>\n<li>Multiple Revenue Streams: Generate income through various channels including private shows, group sessions, tips/gifts with goals, creator subscriptions, digital content, donations and crowdfunding. </li>\n<li>Wide Provider Support: Ideal for a broad range of service providers such as educators, trainers, advisors, and entertainers looking to monetize their expertise remotely. Solution can host remote paid videochat services from various types of providers including performers, adult models, consultants, teachers, personal trainers, tutors, therapists, mediums, tarot readers, spiritual healers, psychic readers, astrologists, herbalists, lawyers, financial / tax / legal advisors, technicians or other professionals that can provide remote assistance, interventions, shows and services.  </li>\n</ul>\n<p>For more details see:<br />\n<a href=\"https://paidvideochat.com/\" title=\"Paid VideoChat Homepage\" rel=\"nofollow ugc\">PaidVideoChat Solution HomePage</a></p>\n<h4>Free Streaming Server Services</h4>\n<p>This type of solution requires specific live streaming server services. For quickly testing own setup, try these options:<br />\n* Register for a <a href=\"https://webrtchost.com/hosting-plans/#Streaming-Only\" rel=\"nofollow ugc\">Free Streaming account with WebRTC &amp; RTMP/HLS</a><br />\n* Install on own dedicated server or VPS the free open source <a href=\"https://github.com/videowhisper/videowhisper-webrtc\" rel=\"nofollow ugc\">WebRTC Signaling Server</a> for basic P2P live streaming using STUN/TURN (as alternative to WowzaSE live streaming)</p>\n<h4>HTML5 Videochat</h4>\n<ul>\n<li>responsive app, versatile, mobile friendly, 100% web based (no Flash, no downloads) room link </li>\n<li>live streaming &amp; chat, public lobby for presales or paid group sessions</li>\n<li>video conference meeting with multiple webcams</li>\n<li>collaboration: file sharing, presentation</li>\n<li>private 2 way video calls, on request or setup with locked link</li>\n<li>pay per minute or free, in private calls and group videochat shows</li>\n<li>gifts/donations with multiple goals and revenue sharing when multiple checked in performers</li>\n<li>Lovense browser/extension integration: notify API on tips to activate toy, show listings with toy</li>\n<li>random room with Next button</li>\n<li>random match mode with custom matching criteria (2 way)</li>\n<li>on demand recording of live video streams, with option to stack in save recording (conferencing)</li>\n<li>broadcast with RTMP encoders like OBS with SnapCamera, mobile Larix Broadcaster (HTML5 HLS playback)</li>\n<li>screen sharing, including mixing audio with microphone</li>\n<li>audio/video/screen recording messages, emoticons, replies in chat</li>\n<li>push performer stream to 3rd party RTMP platforms</li>\n<li>multi language text chat: integrates DeepL API for live translations on request</li>\n<li>multi-view with RTSP IP camera re-streaming support (can switch live between webcam and streams)</li>\n<li>scale 1 to many using Wowza SE as relay and/or use P2P WebRTC + STUN/TURN (new)</li>\n<li>generates &amp; uploads camera snapshots (and no longer relies on FFmpeg as external streams)</li>\n</ul>\n<h4>Turnkey Site</h4>\n<ul>\n<li>Custom (editable) frontend registration types: Performer/Teacher/Broadcaster/Tutor/Consultant/Model, Client/Student/Viewer/Fan, Studio/Company/Brand/Clinic/School</li>\n<li>Custom videochat rooms (Webcam/Room/Conference/Meeting/Venue/Shop) and editable list of Chat Modes (Free Chat, Paid Group Show, Video Conference, Calls Only, Broadcast)</li>\n<li>HTML5 Videochat App interface: Live Video Streaming, Request Private Call, 2 Way Video Calls, Tips/Gifts, Video Conference Split Screen, Instant File Sharing, Presentation</li>\n<li>AJAX webcams list with custom template and CSS</li>\n<li>Public and private Pay Per Minute videochat shows</li>\n<li>PPV settings (cost per minute, grace time) </li>\n<li>Gifts/Tips/Donations (customizable amount, label, sound) in HTML and Advance interface and customizable gift goals</li>\n<li>Paid Questions/Messages, performer gets paid on reply</li>\n<li>Integrates WP SMS &amp; WP Twilio Core for notifications or questions/messages</li>\n<li><a href=\"https://wordpress.org/plugins/paid-membership/\" title=\"MicroPayments/FansPaysite\" rel=\"ugc\">MicroPayments/FansPaysite</a> wallet integration: sell creator subscriptions, digital content, membership with tokens &amp; token packages with WooCommerce gateways</li>\n<li><a href=\"https://wordpress.org/plugins/woo-wallet/\" rel=\"ugc\">TeraWallet</a> tokens wallet integration</li>\n<li><a href=\"https://wordpress.org/plugins/mycred/\" rel=\"ugc\">myCRED Wallet</a> credits wallet integration</li>\n<li>Lobby access permissions (access lists or pay per room)</li>\n<li>HTML5 Live Streaming interface for broadcast and playback on mobiles from Flash PC app broadcasts</li>\n<li>HLS &amp; MPEG-Dash transcoding for performer stream (watch live video stream from iOS/Android mobile)</li>\n<li>Customizable for a multitude of user interaction and billing scenarios</li>\n<li>RTMP Admin tool to monitor live sessions and spy on cams on RTMP server</li>\n<li>100% php plugin source code</li>\n<li>Abides to WP coding and security standards</li>\n<li>Archive streams and import with <a href=\"https://wordpress.org/plugins/video-share-vod/\" title=\"Video Share / Video On Demand\" rel=\"ugc\">Video Share VOD</a> plugin</li>\n<li>Performers can import and upload videos to show on their page</li>\n<li>Video teaser shows on profile page and preview in listings (on hover)</li>\n<li>Performers can upload pictures to show in a gallery on their page (with <a href=\"https://videochat-scripts.com/picture-gallery-plugin/\" title=\"WordPress Picture Gallery Plugin\" rel=\"nofollow ugc\">Picture Gallery</a>)</li>\n<li>Sell Pictures/Videos (with <a href=\"https://wordpress.org/plugins/paid-membership/\" title=\"MicroPayments - Paid Membership, Content\" rel=\"ugc\">MicroPayments &#8211; Paid Membership, Content</a>)</li>\n<li><a href=\"https://wordpress.org/plugins/rate-star-review/\" title=\"Rate Star Review - AJAX Reviews for Content, with Star Ratings\" rel=\"ugc\">Reviews with Star Ratings</a> integration</li>\n<li>Performers can restrict access from specific countries to their listings and webcam page</li>\n<li>Performers can set an access price or password for room page</li>\n<li>Fake Live Performers: Schedule videos to play in loop as if performer was live</li>\n<li>Custom listing fields/questions (unlimited fields can be configured from backend)</li>\n<li>Paid Group Modes: define group chat modes from backend</li>\n<li>Multi Performer Checkin: Multiple performers can be checked in same webcam channel for sharing paid group session profits</li>\n<li>GeoBlocking: globally (by admin) or per webcam (by performer), block countries/regions/cities with GeoIP</li>\n<li>Performer/Studio Approval: Administrative records with custom fields for review</li>\n<li>Multi-Person account support (partners, couples, groups): collect personal records for each person</li>\n<li>Moderators that can access group chats in secret without generating charges</li>\n<li>Daily free time limit for free chat, visitors</li>\n<li>Auto import webcam snapshots in picture galleries</li>\n<li>Archive and import broadcasts from group mode sessions</li>\n<li>Collaboration mode support: video conferencing, file sharing, present videos/images/documents</li>\n<li>Random videochat (Next button to quickly move to a different performer room without reloading page/interface)</li>\n<li>BuddyPress Groups integration: Each group has own room and administrators become performers (room moderators)</li>\n<li>BuddyPress Activity integration: create rooms, go live in room</li>\n<li>BuddyPress Profile integration for performers: list live rooms (updated with AJAX), [paid] video questions</li>\n<li>WooCommerce Products integration: Select products to show on room profile</li>\n<li>Google reCAPTCHA v3 integration for frontend registration, login</li>\n<li>Custom menus for performer, client, studio or regular members</li>\n<li>SightEngine integration for live streaming moderation based on stream snapshots (detect nudity, weapons, drugs, violence, etc)</li>\n</ul>\n<h4>Hosting Requirements</h4>\n<ul>\n<li>This plugin has <a href=\"https://videowhisper.com/?p=Requirements\" title=\"Live Streaming Requirements\" rel=\"nofollow ugc\">requirements</a> beyond regular WordPress hosting specifications: specific live streaming servers, certificates, licensing, tools and configuration for HTML5 live camera streaming.</li>\n<li>For testing, register for a <a href=\"https://webrtchost.com/hosting-plans/#Streaming-Only\" rel=\"nofollow ugc\">Free Streaming account with WebRTC &amp; RTMP/HLS</a></li>\n<li>A new <a href=\"https://github.com/videowhisper/videowhisper-webrtc\" rel=\"nofollow ugc\">WebRTC Signaling Server</a>  is available for basic live streaming functionality using TURN servers. It&#8217;s in early development stage and not recommended for production use.</li>\n<li>Some advanced features require executing server commands for accessing tools like FFmpeg. This involves special configuration and security precautions on web server. By default executing commands (and these features) are disabled.</li>\n</ul>\n<h4>Home Page</h4>\n<p>For online site demos, detailed software requirements, installation and setup instructions see plugin homepage:<br />\n<a href=\"https://paidvideochat.com/\" title=\"Paid VideoChat Homepage\" rel=\"nofollow ugc\">PaidVideoChat HomePage</a><br />\n<a href=\"https://paidvideochat.com\" title=\"PPV Live Webcams / Paid Videochat Plugin HomePage\" rel=\"nofollow ugc\">WordPress PPV Live Webcams Plugin HomePage</a></p>\n<h4>Consulting Services</h4>\n<p>Get complete consulting services to run your live streaming site:<br />\n<a href=\"https://consult.videowhisper.com\" title=\"Consult VideoWhisper\" rel=\"nofollow ugc\">Consult VideoWhisper</a></p>\n<h4>How it Works</h4>\n<p>Performers join to earn money. They turn on their webcams and hang out in public (presale) rooms  waiting for members to chat.  Performers are listed on a page (live performers show first) and site visitors can join them.</p>\n<p>Paying clients can invite performers to do private video chat shows and pay per minute. They first need to register as clients and add some money to their virtual wallet on site to be able to request private shows.</p>\n<p>Payments go from clients to site owner’s account depending on billing gateway (multiple supported).  Site owner can see earnings for each performer and send payments as necessary.</p>\n<h4>Billing</h4>\n<p>Clients can prepay credits that can be used for ppv chat. Billing is supported with TeraWallet (WooCommerce Wallet) and/or myCRED plugin that includes PayPal Standard, Skrill (Moneybookers), NETbilling, Zombaio, BitPay (bitcoin).  Other payment modules are available for extra: 2checkout, ComproPago, CoinBase, CoinPayments, PayFast, Payza, Robokassa, Stripe, WePay.<br />\nWooWallet supports free and premium payment gateways: PayPal (Standard, Checkout), Stripe (CC, Apple Pay, Google Pay, SEPA, Bancontact, Sofort, Giropay, EPS, iDeal, Przelewy24, Alipay, Multibanco),  Square (CC U.S, Canada, Australia, Japan and the UK), Amazon Pay, PayFast, Venmo, eWay (SG, MY, HK, AU, NZ), Klarna (now, later, slice), Authorize.Net, SagePay (UK), WorldPay, 2 Checkout.</p>\n<p>Payouts can be made manually by site owner, with the Payout Tool that generates mass CSV payout lists (for processors like Paypal, Skrill) or with 3rd party plugins/addons.</p>\n<h3>Demos</h3>\n<p>WordPress turnkey site demos on:<br />\n* <a href=\"https://paidvideochat.com/demo/\" title=\"PaidVideochat Turnkey Site Demo\" rel=\"nofollow ugc\">PaidVideochat Turnkey Site Demo</a><br />\n* <a href=\"https://demo.fanspaysite.com\" title=\"FansPaySite Demo\" rel=\"nofollow ugc\">FansPaySite Demo</a></p>\n<p>Simplified demonstrative setups for testing videochat app without registration:<br />\n* <a href=\"https://demo.videowhisper.com/videocall-html5-videochat-php/\" rel=\"nofollow ugc\">Video Call PHP / HTML5 Videochat on Wowza SE</a><br />\n* <a href=\"https://demo.videowhisper.com/p2p-html5-videocall/\" rel=\"nofollow ugc\">Video Call PHP / HTML5 Videochat on VideoWhisper WebRTC</a><br />\n* <a href=\"https://demo.videowhisper.com/html5-videochat-php/\" rel=\"nofollow ugc\">Live Streaming PHP / HTML5 Videochat on Wowza SE</a><br />\n* <a href=\"https://demo.videowhisper.com/vws-html5-livestreaming/\" rel=\"nofollow ugc\">Live Streaming PHP / HTML5 Videochat on VideoWhisper WebRTC</a><br />\n* <a href=\"https://demo.videowhisper.com/cam-recorder-html5-video-audio/\" rel=\"nofollow ugc\">Cam/Mic Recorder HTML5 &#8211; Standalone</a><br />\n* <a href=\"https://2wayvideochat.com/random-videochat/\" rel=\"nofollow ugc\">Random Videochat</a></p>\n",
        "installation": "<p>This plugin has <a href=\"https://videowhisper.com/?p=Requirements\" title=\"Live Streaming Requirements\" rel=\"nofollow ugc\">requirements</a> beyond regular WordPress hosting specifications: specific live streaming servers, certificates, licensing, tools and configuration for HTML5 live camera streaming. HTML5 live streaming is not possible without specific HTML5 live streaming server services and configuration.</p>\n<p>A new <a href=\"https://github.com/videowhisper/videowhisper-webrtc\" rel=\"nofollow ugc\">VideoWhisper WebRTC</a> signaling server is available for basic live streaming functionality using TURN servers. It&#8217;s in early development stage and not recommended for production use.</p>\n<p>Before trying to install, make sure you have all Hosting Requirements. Then see <a href=\"https://paidvideochat.com/features/quick-setup-tutorial/\" rel=\"nofollow ugc\">Quick Setup Tutorial for a Paid Videochat Site</a> .</p>\n<ul>\n<li>Install and activate the PaidVideochat &#8211; PPV Live Webcams plugin by VideoWhisper. A wizard with installation steps should show to guide setup.</li>\n<li>Configure streaming settings from Live Webcams &gt; Settings in WP backends. It&#8217;s compulsory to fill HTML5 live streaming hosting settings to enable this core functionality.</li>\n<li>From Settings &gt; Permalinks enable a SEO friendly structure (ex. Post name)</li>\n<li>Install and enable a billing plugin (myCRED and/or TeraWallet for WooCommerce)</li>\n<li>From Appearance &gt; Menus add Webcams and optionally the Performer Dashboard pages to main site menu</li>\n</ul>\n",
        "changelog": "<h4>7.1</h4>\n<ul>\n<li>Support for VideoWhisper server for RTMP/HLS </li>\n<li>Import settings from VideoWhisper account</li>\n</ul>\n<h4>6.12</h4>\n<ul>\n<li>Contest categories: performers can easily add their rooms to contest categories from Performer Dashboard: Contests section</li>\n<li>Room votes from HTML5 Videochat</li>\n</ul>\n<h4>6.11</h4>\n<ul>\n<li>Multi select room profile fields</li>\n<li>Select multiple options for each filter when browsing rooms</li>\n</ul>\n<h4>6.10</h4>\n<ul>\n<li>SightEngine integration for live streaming moderation (customizable: detect nudity, weapons, drugs, violence, etc)</li>\n<li>Room suspension timeout (unsuspend after some time)</li>\n</ul>\n<h4>6.9</h4>\n<ul>\n<li>Multi persons account support (partners, couples, groups): collect personal records for each person</li>\n<li>Define personal administrative records (collected per person) and custom person types</li>\n<li>Dynamic AJAX form with personal records on registration</li>\n<li>Edit personal and account records from performer dashboard &amp; backend edit user screen </li>\n<li>Add / Remove persons from Performer Dashboard / Edit User Screen</li>\n</ul>\n<h4>6.8</h4>\n<ul>\n<li>Define required administrative fields</li>\n<li>Custom message &amp; email for performers when their register &amp; confirm or update their administrative records</li>\n<li>Edit administrative records from backend (when editing user profile in WP), including document uploads</li>\n<li>Payout Reports: save all payouts and generate/save reports (as csv)</li>\n</ul>\n<h4>6.7</h4>\n<ul>\n<li>Payout lists generator: generate mass payout lists</li>\n<li>Payouts: generate payout lists, export to CSV, mark as paid, make local token wallet transactions</li>\n<li>Lovense toy detection and display in listings with filtering (requires resetting listing templates)</li>\n</ul>\n<h4>6.6</h4>\n<ul>\n<li>Allowed Plugins Filter, a must use plugin that filters plugins on AJAX requests for optimal resource usage, security, scalability</li>\n<li>Admins can toggle APF and configure plugins to load on AJAX requests from APF Optimizer menu</li>\n</ul>\n<h4>6.5</h4>\n<ul>\n<li>Latest HTML5 Videochat generates and uploads camera snapshots (and no longer relies on WowzaSE &amp; FFmpeg)</li>\n<li>Floating logo in HTML5 Videochat videos (for watermarking content in case of screen recording)</li>\n</ul>\n<h4>6.4</h4>\n<ul>\n<li>Support for the new <a href=\"https://github.com/videowhisper/videowhisper-webrtc\" rel=\"nofollow ugc\">VideoWhisper WebRTC</a> signaling server for P2P live streaming (SSL, STUN/TURN support)</li>\n<li>Auto mode for WebRTC: use Wowza for group streaming and VideoWhisper WebRTC for P2P</li>\n<li>Togle 2 way in private video/audio chat (disable to ensure client privacy)</li>\n<li>List MicroPayments subscriptions and purchased content in Client Dashboard</li>\n</ul>\n<h4>6.3</h4>\n<ul>\n<li>Restreaming (RTSP IP Camera) Support based on Wowza SE stream configuration files</li>\n<li>Multiple re-stream addresses can be added per room from Performer Dashboard : Streams tab</li>\n<li>When not live performer can select a stream to show in room until going live (which shows webcam)</li>\n<li>Streams show as Views in HTML5 Videochat action bar for switching</li>\n<li>When live, performer changes default room view (webcam or a stream) and can assign streams to slots in Collaboration mode</li>\n<li>Client switches between streams locally (only for himself) in Videochat</li>\n<li>PHP 8 compatibility changes</li>\n<li>Performers can switch group mode live from action bar</li>\n<li>HTML5 Videochat chat recording adds Screen Sharing in addition to Webcam, Microphone</li>\n</ul>\n<h4>6.2</h4>\n<ul>\n<li>Multilanguage: users can specify preferred language that shows as flag in user list</li>\n<li>DeepL API integraton for live translations on request</li>\n<li>Frontend registration without activation email (option)</li>\n<li>Minimum balance for unlimited free chat time (setting)</li>\n</ul>\n<h4>6.1</h4>\n<ul>\n<li>Random match calls: match clients with performers in video calls</li>\n<li>Random match form to define criteria, both for performer rooms and clients.</li>\n<li>Matchmaking fields on registration for performer/client.</li>\n<li>Moderator roles, hidden in group chat and do not generate charges</li>\n</ul>\n<h4>5.9</h4>\n<ul>\n<li>Collect user mobile number for SMS notifications on questions/messages, frontend password reset</li>\n<li>WP SMS &amp; WP Twilio Core integration for SMS notifications</li>\n<li>Added instructions for Larix Broadcaster mobile apps instead of Wowza GoCoder (removed)</li>\n</ul>\n<h4>5.8</h4>\n<ul>\n<li>Lovense browser/extension integration: broadcaster notifies API when receiving tips</li>\n<li>Bonus earning rate after certain time spent online</li>\n</ul>\n<h4>5.7</h4>\n<ul>\n<li>Screen Sharing including mixing audio with microphone</li>\n<li>Ember current room in BuddyPress/BuddyBoss profile</li>\n<li>Live Rooms in performer BuddyPress profile</li>\n<li>Video Questions in performer BuddyPress profile</li>\n<li>Include reason to display when rejecting account</li>\n<li>Email notification on account approval, rejection</li>\n<li>User filter in backend: not verified, approved, rejected</li>\n</ul>\n<h4>5.6</h4>\n<ul>\n<li>Listings filters as accordion menus instead of dropdowns (option)</li>\n<li>Custom room profile fields as filters</li>\n<li>Frontend forgot password recovery forms</li>\n<li>Paid question attachments and custom price</li>\n<li>List selected digital content items on room pages</li>\n<li>Paid question video/audio recordings with HTML5 Webcam Microphone Recorder Forms plugin</li>\n<li>Custom menus for performer, client, studio or regular members</li>\n</ul>\n<h4>5.5</h4>\n<ul>\n<li>Special frontend registration pages for client/performer/studio</li>\n<li>Account activation by email link (when registered with the special pages)</li>\n<li>Terms of Use and Privacy Policy pages</li>\n<li>Goals for room gifts</li>\n<li>Google reCAPTCHA v3</li>\n<li>Push performer streams to RTMP platforms</li>\n<li>Studios can collect payments from performers</li>\n<li>Goals tab and manager in application</li>\n</ul>\n<h4>5.4</h4>\n<ul>\n<li>Text only mode for simple and advanced interfaces</li>\n<li>Private audio call and text modes</li>\n<li>Packet loss reporting for WebRTC streaming</li>\n<li>List new rooms in BuddyPress Activity</li>\n<li>Performers select WooCommerce products to show in room profile</li>\n<li>BuddyPress profile links in chat</li>\n<li>Send audio recording from text chat in HTML5 Videochat</li>\n<li>Send video recording from text chat in HTML5 Videochat</li>\n</ul>\n<h4>5.3</h4>\n<ul>\n<li>BuddyPress groups integration: each group can have own room accessible only by its members, where all admins can become performers</li>\n<li>Extra performer roles, to allow multiple types of users to manage rooms</li>\n<li>Chat replies, mentions</li>\n<li>Chat auto insert basic emoticons </li>\n<li>Audio only layouts</li>\n</ul>\n<h4>5.2</h4>\n<ul>\n<li>Kick, Ban</li>\n<li>Sound notifications</li>\n<li>User tab count</li>\n<li>Option to setup locked call as paid or free</li>\n<li>Checked in performers also share Tips/Gifts in addition to Pay Per Minute</li>\n<li>Stream recording on request, directly in suitable container without transcoding, including from WebRTC </li>\n<li>Document uploads for administrative records </li>\n</ul>\n<h4>5.1</h4>\n<ul>\n<li>External broadcast encoder support (OBS, GoCoder)</li>\n<li>Improved presentation files: all files  displayed as video/audio/downloads.</li>\n<li>Higher Chrome bitrate selection reliability</li>\n<li>Emoticons</li>\n</ul>\n<h4>4.9</h4>\n<ul>\n<li>Paid messages: Pay per message/question, performer gets paid on reply.</li>\n<li>Client Dashboard page/shortcode: Access balance and messages/replies.</li>\n<li>Featured webcams show with a ribbon with featured level (and first in default order)</li>\n<li>Direct private show requests (from webcam list)</li>\n<li>Setup private calls with URL from performer dashboard</li>\n<li>HTML5 Videochat:\n<ul>\n<li>Supports voyeur mode</li>\n<li>Direct private call waiting lobby (wait for performer to get online and automatically request private)</li>\n<li>Audio Only mode: shows only microphone controls, room picture/screenshot instead of video</li>\n<li>Reveal mode: reveal webcam on request after some time</li>\n</ul>\n</li>\n</ul>\n<h4>4.8</h4>\n<ul>\n<li>HTML5 Videochat improvements:\n<ul>\n<li>Split view in collaboration mode (multiple streams and documents)</li>\n<li>Display slots (1,2,4,6) for split view, toggle collaboration mode</li>\n<li>Conference mode (split view and all users can start camera)</li>\n<li>Translation support for most important texts</li>\n<li>Improved chat dark mode</li>\n<li>Icon/Text/Full tab menus</li>\n<li>Disable private call requests</li>\n</ul>\n</li>\n</ul>\n<h4>4.7</h4>\n<ul>\n<li>Instant room shortcode [videowhisper_cam_instant] to instantly access own room (automatically created)</li>\n<li>Full Page App Videochat template</li>\n<li>HTML5 Videochat improvements:\n<ul>\n<li>(HTML5 Videochat) Site Menu</li>\n<li>enable dark mode from config</li>\n<li>toggle simple/advanced interface (with user list) from settings</li>\n<li>Fomantic UI (Semantic UI fork with interface improvements)</li>\n<li>room options tab: switch public/private at runtime</li>\n</ul>\n</li>\n<li>WYSIWYG editor for profile fields</li>\n</ul>\n<h4>4.6</h4>\n<ul>\n<li>Global Site GeoBlocking: prevent users from countries or regions from accessing site contents</li>\n<li>Collaboration mode with tabs in HTML5 Videochat app</li>\n<li>File sharing tab with drag &amp; drop multi file upload in HTML5 Videochat app</li>\n<li>Dark mode in HTML5 Videochat app</li>\n<li>Bitrate adaptation based on resolution, in HTML5 Videochat app </li>\n<li>Show images and videos on main screen from Files tab in collaboration mode</li>\n<li>Presentation tab for broadcaster to remove file and resume streaming</li>\n<li>Users tab for collaboration mode to display in presentation</li>\n<li>Bitrate stats for broadcasting and playback</li>\n</ul>\n<h4>4.5</h4>\n<ul>\n<li>Random Videochat (Next button) in HTML5 Videochat app</li>\n<li>Filter rooms by Free/Paid status</li>\n<li>WYSIWYG editor for performer dashboard message</li>\n<li>HTML5 Videochat as default interface if available and performer is offline</li>\n<li>Teaser loops in HTML5 Videochat if performer is offline </li>\n<li>[videowhisper_cam_random] shortcode for showing a random webcam room</li>\n</ul>\n<h4>4.4</h4>\n<ul>\n<li>VideoWhisper HTML5 Videochat App (beta version)</li>\n<li>Grid/List layout</li>\n<li>Support category, description, featured rating, status code in listings</li>\n<li>Sort listings by rating in category (after selecting a category)</li>\n<li>Dedicated webcam profile page</li>\n<li>Support for configuring inverted (dark mode) interface and other Semantic UI classes</li>\n<li>Setup requirements checkpoints and review page</li>\n</ul>\n<h4>4.3</h4>\n<ul>\n<li>Admin bar menus and user profile menus for performer/studio</li>\n<li>Automated AAC codec detection and configuration for FFMPEG</li>\n<li>RTMP Session Control</li>\n<li>HTML5 WebRTC basic group videochat interface (html5 broadcast for performance, playback for clients, html chat)</li>\n<li>HTML Chat Balance and custom Tips with AJAX, image, sound</li>\n</ul>\n<h4>4.2</h4>\n<ul>\n<li>WooCommerce Wallet integration</li>\n<li>Multi Wallet support: active wallet, transfer balance to active wallet</li>\n</ul>\n<h4>4.1</h4>\n<ul>\n<li>Semantic UI integration</li>\n<li>Multi-select (toggle) profile fields</li>\n<li>Integrate Rate Star Review to review webcams and list reviews</li>\n<li>Sort by rating, number of ratings, rate popularity (sum of ratings)</li>\n<li>Show rating stars in listings</li>\n<li>Backend tool to assign performers to studios</li>\n</ul>\n<h4>3.9</h4>\n<ul>\n<li>Performers can configure custom paid group mode rate (controlled feature)</li>\n<li>Performers can configured custom 2 way slots for group mode (controlled feature)</li>\n<li>Performers can lock their room page with a password (controlled feature) required for everybody on room page and enforced for clients in app login</li>\n<li>Counters for paid sessions (available in room listing templates)</li>\n</ul>\n<h4>3.8</h4>\n<ul>\n<li>Private show modes: Video Chat, Audio Chat, Text Only</li>\n<li>Search by tags (multiple comma separated values) or name</li>\n<li>Custom labels for adjusting solution for specific themes</li>\n<li>Low balance client warnings with sound and custom message at 2 custom amount levels</li>\n</ul>\n<h4>3.7</h4>\n<ul>\n<li>Live preview of drawings in presentation mode</li>\n<li>Presentation mode configurable per room from frontend if feature is enabled</li>\n</ul>\n<h4>3.6</h4>\n<ul>\n<li>Auto pause streaming after private videochat</li>\n<li>Custom room entry link option</li>\n</ul>\n<h4>3.5</h4>\n<ul>\n<li>Advanced location bans: supports country, region, city, continent code</li>\n<li>Performance improvements: cache webcam listings, timeout offline checks for ffmpeg processes</li>\n<li>Pending balance check/preview for clients (estimates incomplete paid sessions)</li>\n</ul>\n<h4>3.4</h4>\n<ul>\n<li>Presentation Mode: Slide show, file sharing, slide annotations including whiteboard</li>\n</ul>\n<h4>3.3</h4>\n<ul>\n<li>Archiving and automated import of webcam streams for configured group modes</li>\n</ul>\n<h4>3.2</h4>\n<ul>\n<li>Automated import of webcam snapshots in picture galleries for group and private chat</li>\n</ul>\n<h4>3.1</h4>\n<ul>\n<li>2 Way special group user mode</li>\n<li>Voyeur special group user mode</li>\n<li>Special layout code for 2 way modes</li>\n<li>Chat filtering regex configuration</li>\n</ul>\n<h4>2.9</h4>\n<ul>\n<li>Video preview on listing page (preview of teaser video as configured in VideoShareVOD)</li>\n<li>Custom amount tips (value input by tipper), custom tip colors</li>\n<li>Fixed adaptive layout code options</li>\n<li>Featured webcam listings</li>\n</ul>\n<h4>2.8</h4>\n<ul>\n<li>Visitor daily time limit</li>\n<li>Free chat daily time limit</li>\n<li>Teaser video (on webcam page) based on VideoShareVOD</li>\n</ul>\n<h4>2.7</h4>\n<ul>\n<li>Performer can kick and ban users from own room</li>\n</ul>\n<h4>2.6</h4>\n<ul>\n<li>Account administrative records for verification, payouts</li>\n<li>Verify users, disabled access for unverified providers</li>\n</ul>\n<h4>2.5</h4>\n<ul>\n<li>Performer Checkin: Multiple performers can be checked in for sharing paid group session profits</li>\n</ul>\n<h4>2.4</h4>\n<ul>\n<li>Paid Group Modes: define group chat modes from backend</li>\n</ul>\n<h4>2.3</h4>\n<ul>\n<li>Webcam profile details: unlimited custom fields of different types can be added</li>\n</ul>\n<h4>2.2</h4>\n<ul>\n<li>Studio Role: Studios can manage multiple performers and webcam listings</li>\n<li>Multiple webcam listings: performers can select between available webcam listings (created by them or the studio)</li>\n<li>Fake performer, picture selection improvements</li>\n</ul>\n<h4>2.1</h4>\n<ul>\n<li>Multiple Webcams: Performers can broadcast multiple cameras and viewers can switch to different angles</li>\n<li>Private Mode: Performers can toggle private chat 1 way or 2 way</li>\n<li>Custom loader (animated GIF) while loading interface</li>\n<li>Custom message (announcement) in performer dashboard</li>\n</ul>\n<h4>1.15</h4>\n<ul>\n<li>Schedule video playlists: Fake live performer (as video loop) for configured accounts</li>\n</ul>\n<h4>1.14</h4>\n<ul>\n<li>HTML chat for HLS / MPEG Dash client provides public for mobile users</li>\n</ul>\n<h4>1.13</h4>\n<ul>\n<li>MPEG Dash Support HTML5 live video streaming for Android and most HTML5 capable browsers</li>\n<li>Custom earning ratio: admin can quick edit webcams to setup both earning ratio and CPM</li>\n</ul>\n<h4>1.12</h4>\n<ul>\n<li>Ban countries feature: Performer can ban list of countries from accessing webcam in AJAX lists or page</li>\n</ul>\n<h4>1.11</h4>\n<ul>\n<li>Performer pictures: Picture Gallery integration to upload/import pictures and show on performer&#8217;s page</li>\n</ul>\n<h4>1.10</h4>\n<ul>\n<li>Performer videos: VideoShareVOD integration to import/upload videos and show on performer&#8217;s page</li>\n</ul>\n<h4>1.9</h4>\n<ul>\n<li>Admin tool to monitor all connecter users, identify their IP, spy on published streams</li>\n</ul>\n<h4>1.8</h4>\n<ul>\n<li>HLS transcoding for performer stream (allows mobile users to watch live stream on iOS/Android)</li>\n</ul>\n<h4>1.7</h4>\n<ul>\n<li>Tips customisable from backend (amount, label, sound)</li>\n<li>Floating logo image over video</li>\n<li>Client cam starts only in private show, if enabled, for 2 way videochat</li>\n</ul>\n<h4>1.6</h4>\n<ul>\n<li>Live video preview with shortcodes</li>\n<li>New fields to show in cam list: brief, tags, cpm</li>\n<li>Set message/behaviour for client view when performer is offline</li>\n<li>Listing customization settings</li>\n</ul>\n<h4>1.5</h4>\n<ul>\n<li>Listing filters by status and availability</li>\n<li>Backend improvements, listings with snapshot, sort by last time online, quick edit Custom CPM</li>\n<li>Custom features can be enabled for different performer classes and their rooms:</li>\n<li>Custom show cost per minute (CPM) per room</li>\n<li>Upload room picture, write description (profile, bio, schedule)</li>\n<li>Access list per room</li>\n<li>Access fee per room (one time fee for public access)</li>\n</ul>\n<h4>1.4</h4>\n<ul>\n<li>More listing and filtering options</li>\n</ul>\n<h4>1.3</h4>\n<ul>\n<li>Multiple improvements and fixes</li>\n</ul>\n<h4>1.0</h4>\n<ul>\n<li>Integrates VideoWhisper Video Messenger</li>\n</ul>\n"
    },
    "short_description": "Launch a PPV live webcam platform with real-time interaction and robust monetization for performers.",
    "description": "<p>Transform your WordPress site into a thriving pay-per-view (PPV) video chat service with the PPV Live Webcams plugin. This comprehensive solution allows performers from various sectors—be it education, counseling, or entertainment—to monetize their skills through live streaming, private consultations, and media sales. Designed for seamless operation across devices, this plugin integrates cutting-edge technologies like HTML5 WebRTC/HLS for an optimal user experience without the need for additional downloads.</p>\n<p><a href=\"https://paidvideochat.com/demo/\" title=\"PaidVideochat Turnkey Site Demos\" rel=\"nofollow ugc\">Live Demos</a></p>\n<p>Build a turnkey pay per view (PPV) videochat, your own platform, where live service providers (consultants, advisors, performers) can market and sell their services remotely.</p>\n<h4>Platform Benefits</h4>\n<ul>\n<li>Quick and Cost Effective: Launch a fully functional PPV video chat platform for a fraction of the cost and time required to develop from scratch.</li>\n<li>Leverage WordPress: Built on the reliable WordPress framework, this plugin offers ease of use and access to a vast selection of plugins, themes, community of developers.</li>\n<li>No Downloads Required: With a fully web-based setup, users can start streaming and viewing without the need for additional software or plugins. Optionally, performers can broadcasting using professional RTMP encoders like OBS, mobile Larix Broadcaster and clients can watch using same web interface.</li>\n<li>Multiple Revenue Streams: Generate income through various channels including private shows, group sessions, tips/gifts with goals, creator subscriptions, digital content, donations and crowdfunding. </li>\n<li>Wide Provider Support: Ideal for a broad range of service providers such as educators, trainers, advisors, and entertainers looking to monetize their expertise remotely. Solution can host remote paid videochat services from various types of providers including performers, adult models, consultants, teachers, personal trainers, tutors, therapists, mediums, tarot readers, spiritual healers, psychic readers, astrologists, herbalists, lawyers, financial / tax / legal advisors, technicians or other professionals that can provide remote assistance, interventions, shows and services.  </li>\n</ul>\n<p>For more details see:<br />\n<a href=\"https://paidvideochat.com/\" title=\"Paid VideoChat Homepage\" rel=\"nofollow ugc\">PaidVideoChat Solution HomePage</a></p>\n<h4>Free Streaming Server Services</h4>\n<p>This type of solution requires specific live streaming server services. For quickly testing own setup, try these options:<br />\n* Register for a <a href=\"https://webrtchost.com/hosting-plans/#Streaming-Only\" rel=\"nofollow ugc\">Free Streaming account with WebRTC &amp; RTMP/HLS</a><br />\n* Install on own dedicated server or VPS the free open source <a href=\"https://github.com/videowhisper/videowhisper-webrtc\" rel=\"nofollow ugc\">WebRTC Signaling Server</a> for basic P2P live streaming using STUN/TURN (as alternative to WowzaSE live streaming)</p>\n<h4>HTML5 Videochat</h4>\n<ul>\n<li>responsive app, versatile, mobile friendly, 100% web based (no Flash, no downloads) room link </li>\n<li>live streaming &amp; chat, public lobby for presales or paid group sessions</li>\n<li>video conference meeting with multiple webcams</li>\n<li>collaboration: file sharing, presentation</li>\n<li>private 2 way video calls, on request or setup with locked link</li>\n<li>pay per minute or free, in private calls and group videochat shows</li>\n<li>gifts/donations with multiple goals and revenue sharing when multiple checked in performers</li>\n<li>Lovense browser/extension integration: notify API on tips to activate toy, show listings with toy</li>\n<li>random room with Next button</li>\n<li>random match mode with custom matching criteria (2 way)</li>\n<li>on demand recording of live video streams, with option to stack in save recording (conferencing)</li>\n<li>broadcast with RTMP encoders like OBS with SnapCamera, mobile Larix Broadcaster (HTML5 HLS playback)</li>\n<li>screen sharing, including mixing audio with microphone</li>\n<li>audio/video/screen recording messages, emoticons, replies in chat</li>\n<li>push performer stream to 3rd party RTMP platforms</li>\n<li>multi language text chat: integrates DeepL API for live translations on request</li>\n<li>multi-view with RTSP IP camera re-streaming support (can switch live between webcam and streams)</li>\n<li>scale 1 to many using Wowza SE as relay and/or use P2P WebRTC + STUN/TURN (new)</li>\n<li>generates &amp; uploads camera snapshots (and no longer relies on FFmpeg as external streams)</li>\n</ul>\n<h4>Turnkey Site</h4>\n<ul>\n<li>Custom (editable) frontend registration types: Performer/Teacher/Broadcaster/Tutor/Consultant/Model, Client/Student/Viewer/Fan, Studio/Company/Brand/Clinic/School</li>\n<li>Custom videochat rooms (Webcam/Room/Conference/Meeting/Venue/Shop) and editable list of Chat Modes (Free Chat, Paid Group Show, Video Conference, Calls Only, Broadcast)</li>\n<li>HTML5 Videochat App interface: Live Video Streaming, Request Private Call, 2 Way Video Calls, Tips/Gifts, Video Conference Split Screen, Instant File Sharing, Presentation</li>\n<li>AJAX webcams list with custom template and CSS</li>\n<li>Public and private Pay Per Minute videochat shows</li>\n<li>PPV settings (cost per minute, grace time) </li>\n<li>Gifts/Tips/Donations (customizable amount, label, sound) in HTML and Advance interface and customizable gift goals</li>\n<li>Paid Questions/Messages, performer gets paid on reply</li>\n<li>Integrates WP SMS &amp; WP Twilio Core for notifications or questions/messages</li>\n<li><a href=\"https://wordpress.org/plugins/paid-membership/\" title=\"MicroPayments/FansPaysite\" rel=\"ugc\">MicroPayments/FansPaysite</a> wallet integration: sell creator subscriptions, digital content, membership with tokens &amp; token packages with WooCommerce gateways</li>\n<li><a href=\"https://wordpress.org/plugins/woo-wallet/\" rel=\"ugc\">TeraWallet</a> tokens wallet integration</li>\n<li><a href=\"https://wordpress.org/plugins/mycred/\" rel=\"ugc\">myCRED Wallet</a> credits wallet integration</li>\n<li>Lobby access permissions (access lists or pay per room)</li>\n<li>HTML5 Live Streaming interface for broadcast and playback on mobiles from Flash PC app broadcasts</li>\n<li>HLS &amp; MPEG-Dash transcoding for performer stream (watch live video stream from iOS/Android mobile)</li>\n<li>Customizable for a multitude of user interaction and billing scenarios</li>\n<li>RTMP Admin tool to monitor live sessions and spy on cams on RTMP server</li>\n<li>100% php plugin source code</li>\n<li>Abides to WP coding and security standards</li>\n<li>Archive streams and import with <a href=\"https://wordpress.org/plugins/video-share-vod/\" title=\"Video Share / Video On Demand\" rel=\"ugc\">Video Share VOD</a> plugin</li>\n<li>Performers can import and upload videos to show on their page</li>\n<li>Video teaser shows on profile page and preview in listings (on hover)</li>\n<li>Performers can upload pictures to show in a gallery on their page (with <a href=\"https://videochat-scripts.com/picture-gallery-plugin/\" title=\"WordPress Picture Gallery Plugin\" rel=\"nofollow ugc\">Picture Gallery</a>)</li>\n<li>Sell Pictures/Videos (with <a href=\"https://wordpress.org/plugins/paid-membership/\" title=\"MicroPayments - Paid Membership, Content\" rel=\"ugc\">MicroPayments &#8211; Paid Membership, Content</a>)</li>\n<li><a href=\"https://wordpress.org/plugins/rate-star-review/\" title=\"Rate Star Review - AJAX Reviews for Content, with Star Ratings\" rel=\"ugc\">Reviews with Star Ratings</a> integration</li>\n<li>Performers can restrict access from specific countries to their listings and webcam page</li>\n<li>Performers can set an access price or password for room page</li>\n<li>Fake Live Performers: Schedule videos to play in loop as if performer was live</li>\n<li>Custom listing fields/questions (unlimited fields can be configured from backend)</li>\n<li>Paid Group Modes: define group chat modes from backend</li>\n<li>Multi Performer Checkin: Multiple performers can be checked in same webcam channel for sharing paid group session profits</li>\n<li>GeoBlocking: globally (by admin) or per webcam (by performer), block countries/regions/cities with GeoIP</li>\n<li>Performer/Studio Approval: Administrative records with custom fields for review</li>\n<li>Multi-Person account support (partners, couples, groups): collect personal records for each person</li>\n<li>Moderators that can access group chats in secret without generating charges</li>\n<li>Daily free time limit for free chat, visitors</li>\n<li>Auto import webcam snapshots in picture galleries</li>\n<li>Archive and import broadcasts from group mode sessions</li>\n<li>Collaboration mode support: video conferencing, file sharing, present videos/images/documents</li>\n<li>Random videochat (Next button to quickly move to a different performer room without reloading page/interface)</li>\n<li>BuddyPress Groups integration: Each group has own room and administrators become performers (room moderators)</li>\n<li>BuddyPress Activity integration: create rooms, go live in room</li>\n<li>BuddyPress Profile integration for performers: list live rooms (updated with AJAX), [paid] video questions</li>\n<li>WooCommerce Products integration: Select products to show on room profile</li>\n<li>Google reCAPTCHA v3 integration for frontend registration, login</li>\n<li>Custom menus for performer, client, studio or regular members</li>\n<li>SightEngine integration for live streaming moderation based on stream snapshots (detect nudity, weapons, drugs, violence, etc)</li>\n</ul>\n<h4>Hosting Requirements</h4>\n<ul>\n<li>This plugin has <a href=\"https://videowhisper.com/?p=Requirements\" title=\"Live Streaming Requirements\" rel=\"nofollow ugc\">requirements</a> beyond regular WordPress hosting specifications: specific live streaming servers, certificates, licensing, tools and configuration for HTML5 live camera streaming.</li>\n<li>For testing, register for a <a href=\"https://webrtchost.com/hosting-plans/#Streaming-Only\" rel=\"nofollow ugc\">Free Streaming account with WebRTC &amp; RTMP/HLS</a></li>\n<li>A new <a href=\"https://github.com/videowhisper/videowhisper-webrtc\" rel=\"nofollow ugc\">WebRTC Signaling Server</a>  is available for basic live streaming functionality using TURN servers. It&#8217;s in early development stage and not recommended for production use.</li>\n<li>Some advanced features require executing server commands for accessing tools like FFmpeg. This involves special configuration and security precautions on web server. By default executing commands (and these features) are disabled.</li>\n</ul>\n<h4>Home Page</h4>\n<p>For online site demos, detailed software requirements, installation and setup instructions see plugin homepage:<br />\n<a href=\"https://paidvideochat.com/\" title=\"Paid VideoChat Homepage\" rel=\"nofollow ugc\">PaidVideoChat HomePage</a><br />\n<a href=\"https://paidvideochat.com\" title=\"PPV Live Webcams / Paid Videochat Plugin HomePage\" rel=\"nofollow ugc\">WordPress PPV Live Webcams Plugin HomePage</a></p>\n<h4>Consulting Services</h4>\n<p>Get complete consulting services to run your live streaming site:<br />\n<a href=\"https://consult.videowhisper.com\" title=\"Consult VideoWhisper\" rel=\"nofollow ugc\">Consult VideoWhisper</a></p>\n<h4>How it Works</h4>\n<p>Performers join to earn money. They turn on their webcams and hang out in public (presale) rooms  waiting for members to chat.  Performers are listed on a page (live performers show first) and site visitors can join them.</p>\n<p>Paying clients can invite performers to do private video chat shows and pay per minute. They first need to register as clients and add some money to their virtual wallet on site to be able to request private shows.</p>\n<p>Payments go from clients to site owner’s account depending on billing gateway (multiple supported).  Site owner can see earnings for each performer and send payments as necessary.</p>\n<h4>Billing</h4>\n<p>Clients can prepay credits that can be used for ppv chat. Billing is supported with TeraWallet (WooCommerce Wallet) and/or myCRED plugin that includes PayPal Standard, Skrill (Moneybookers), NETbilling, Zombaio, BitPay (bitcoin).  Other payment modules are available for extra: 2checkout, ComproPago, CoinBase, CoinPayments, PayFast, Payza, Robokassa, Stripe, WePay.<br />\nWooWallet supports free and premium payment gateways: PayPal (Standard, Checkout), Stripe (CC, Apple Pay, Google Pay, SEPA, Bancontact, Sofort, Giropay, EPS, iDeal, Przelewy24, Alipay, Multibanco),  Square (CC U.S, Canada, Australia, Japan and the UK), Amazon Pay, PayFast, Venmo, eWay (SG, MY, HK, AU, NZ), Klarna (now, later, slice), Authorize.Net, SagePay (UK), WorldPay, 2 Checkout.</p>\n<p>Payouts can be made manually by site owner, with the Payout Tool that generates mass CSV payout lists (for processors like Paypal, Skrill) or with 3rd party plugins/addons.</p>\n<h3>Demos</h3>\n<p>WordPress turnkey site demos on:<br />\n* <a href=\"https://paidvideochat.com/demo/\" title=\"PaidVideochat Turnkey Site Demo\" rel=\"nofollow ugc\">PaidVideochat Turnkey Site Demo</a><br />\n* <a href=\"https://demo.fanspaysite.com\" title=\"FansPaySite Demo\" rel=\"nofollow ugc\">FansPaySite Demo</a></p>\n<p>Simplified demonstrative setups for testing videochat app without registration:<br />\n* <a href=\"https://demo.videowhisper.com/videocall-html5-videochat-php/\" rel=\"nofollow ugc\">Video Call PHP / HTML5 Videochat on Wowza SE</a><br />\n* <a href=\"https://demo.videowhisper.com/p2p-html5-videocall/\" rel=\"nofollow ugc\">Video Call PHP / HTML5 Videochat on VideoWhisper WebRTC</a><br />\n* <a href=\"https://demo.videowhisper.com/html5-videochat-php/\" rel=\"nofollow ugc\">Live Streaming PHP / HTML5 Videochat on Wowza SE</a><br />\n* <a href=\"https://demo.videowhisper.com/vws-html5-livestreaming/\" rel=\"nofollow ugc\">Live Streaming PHP / HTML5 Videochat on VideoWhisper WebRTC</a><br />\n* <a href=\"https://demo.videowhisper.com/cam-recorder-html5-video-audio/\" rel=\"nofollow ugc\">Cam/Mic Recorder HTML5 &#8211; Standalone</a><br />\n* <a href=\"https://2wayvideochat.com/random-videochat/\" rel=\"nofollow ugc\">Random Videochat</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/ppv-live-webcams.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/ppv-live-webcams/trunk/screenshot-1.jpg?rev=3150959",
            "caption": "HTML5 Video Call - Client View"
        },
        {
            "src": "https://ps.w.org/ppv-live-webcams/trunk/screenshot-2.jpg?rev=3150959",
            "caption": "HTML5 Video Conference - Split Screen"
        },
        {
            "src": "https://ps.w.org/ppv-live-webcams/trunk/screenshot-3.jpg?rev=3150959",
            "caption": "Browse Live Experts - AJAX Live Updates"
        },
        {
            "src": "https://ps.w.org/ppv-live-webcams/trunk/screenshot-4.png?rev=3150959",
            "caption": "Role selection on signup: performer, client (customizable)."
        },
        {
            "src": "https://ps.w.org/ppv-live-webcams/trunk/screenshot-5.png?rev=3150959",
            "caption": "Private Video Call Room Setup"
        },
        {
            "src": "https://ps.w.org/ppv-live-webcams/trunk/screenshot-6.jpg?rev=3150959",
            "caption": "HTML5 Videochat Streaming Settings"
        },
        {
            "src": "https://ps.w.org/ppv-live-webcams/trunk/screenshot-7.png?rev=3150959",
            "caption": "Paid Questions / Messages"
        }
    ],
    "tags": {
        "conference": "Conference",
        "pay-per-minute": "pay per minute",
        "video-call": "video call",
        "videochat": "videochat",
        "webcam": "webcam"
    },
    "stable_tag": "trunk",
    "versions": {
        "5.6.34": "https://downloads.wordpress.org/plugin/ppv-live-webcams.5.6.34.zip",
        "5.7.3": "https://downloads.wordpress.org/plugin/ppv-live-webcams.5.7.3.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://consult.videowhisper.com",
    "banners": {
        "low": "https://ps.w.org/ppv-live-webcams/assets/banner-772x250.jpg?rev=2271640",
        "high": "https://ps.w.org/ppv-live-webcams/assets/banner-1544x500.jpg?rev=2271640"
    },
    "icons": {
        "1x": "https://ps.w.org/ppv-live-webcams/assets/icon-128x128.png?rev=2271643",
        "2x": "https://ps.w.org/ppv-live-webcams/assets/icon-256x256.png?rev=2271643"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 82,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/ppv-live-webcams/blueprint.json?rev=3150959"
        }
    ],
    "preview_link": "",
    "language_packs": []
}