{
    "name": "Print Anywhere &amp; Create PDFs of Order Receipts, Invoices, Labels &amp; More.",
    "slug": "print-google-cloud-print-gcp-woocommerce",
    "version": "4.5.15",
    "author": "<a href=\"http://www.bizswoop.com\">BizSwoop a CPF Concepts, LLC Brand</a>",
    "author_profile": "https://profiles.wordpress.org/bizswoop/",
    "contributors": {
        "bizswoop": {
            "profile": "https://profiles.wordpress.org/bizswoop/",
            "avatar": "https://secure.gravatar.com/avatar/2c4ec8b3b593c822b6b90f6778f30349?s=96&d=monsterid&r=g",
            "display_name": "bizswoop"
        }
    },
    "requires": "4.4",
    "tested": "6.6.1",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 94,
    "ratings": {
        "5": 14,
        "4": 1,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 16,
    "support_url": "https://wordpress.org/support/plugin/print-google-cloud-print-gcp-woocommerce/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 60891,
    "last_updated": "2024-08-02 3:26pm GMT",
    "added": "2018-05-16",
    "homepage": "http://www.getbizprint.com",
    "sections": {
        "description": "<p>BizPrint is simply the best way to print documents for your WooCommerce orders to any printer around your home office, restaurant, warehouse or business of any type or create PDFs. Print Manager formats your WooCommerce order data into an organized and branded <a href=\"https://getbizprint.com/woocommerce-thermal-printer/\" rel=\"nofollow ugc\">receipt</a>, <a href=\"https://getbizprint.com/woocommerce-custom-invoice/\" rel=\"nofollow ugc\">invoice</a>, <a href=\"https://getbizprint.com/woocommerce-packing-slip-print\" rel=\"nofollow ugc\">packing slip</a>, <a href=\"http://getbizprint.com/woocommerce-delivery-notes\" rel=\"nofollow ugc\">delivery note</a>, <a href=\"https://getbizprint.com/woocommerce-shipping-labels\" rel=\"nofollow ugc\">shipping label</a> or order printout, for your customers and staff to use!</p>\n<p>This free Print Manager Plugin connects to <a href=\"https://getbizprint.com/\" rel=\"nofollow ugc\">BizPrint</a> cloud service to enable automatic printing to anywhere in the world! In just one year, BizPrint has helped businesses to automate over 1,250,000+ Prints and saved over 575,000+ employee hours! It’s easy to set up with no coding required in just a few simple steps. You can read the full list of benefits for store owners and get started at <a href=\"https://getbizprint.com/\" rel=\"nofollow ugc\">GetBizPrint.com</a></p>\n<p>BizPrint prints your WooCommerce orders automatically to your existing printer, and has the reliability, flexibility, and customizability you need for your specific use case. You’ve found the right plugin!</p>\n<h4>Why Create Printed Receipts For Your Store?</h4>\n<p>Any transaction between a store and customer needs some evidence of purchase. There are many reasons to make your WooCommerce order details physical. For example:</p>\n<ul>\n<li>If you run a restaurant, the kitchen and wait staff will need physical copies of the order so they can prepare the food and serve customers with maximum efficiency.</li>\n<li>For warehouses or fulfillment centers, a printed order will help pickers and packers to prepare and fulfill an order without delay.</li>\n<li>In lots of cases, a customer will want a printed receipt in order to prove a purchase, for product returns, employer reimbursement or for tax purposes.</li>\n</ul>\n<p>BizPrint has a customer satisfaction rating of 4.8 stars and boasts 99.5% reliability uptime on our globally distributed servers that power the cloud. We have answered over 7,500 support tickets last year alone and can’t wait to help save you time!</p>\n<p>But don’t just take our word for it! This is what Chris from Kyoto Sushi had to say about how BizPrint is helping their business:</p>\n<blockquote>\n<p>“We started taking orders online and printing them with BizPrint, and it has been game changing. BizPrint improves the customer experience, reduces kitchen downtime, and frees up my time. My staff are 30% more productive. I can outperform our competitors (including on UberEat, Deliveroo, etc) whilst having lower costs, better quality, and lower prices. If you own a restaurant, getting BizPrint is a no-brainer.” &#8211; Chris L. Owner Kyoto Sushi Restaurant.</p>\n</blockquote>\n<h4>BizPrint for WooCommerce Includes All The Features You Need</h4>\n<ul>\n<li>Supports Automatic Prints by Order Status</li>\n<li>Adds Manual Print Button Option on WooCommerce Orders &amp; Details Page</li>\n<li>Set Up An Unlimited Number of Printer Stations and Locations</li>\n<li>Use Your Current Thermal or Inkjet Printers</li>\n<li>Supports All Major Brands like HP, Dymo, Cannon, Star, Epson, Brother &amp; more</li>\n<li>Supports Local, Network, USB, Serial, Wifi and Bluetooth Based Printers</li>\n<li>Choose Single Print or Print Multiple Copies Instantly</li>\n<li>Support with Popular WordPress Plugins like Product Add-ons, Point of Sale, Pickup Delivery Scheduler and More</li>\n<li>Over 15 Templates Available Including, Receipt Template, Customer Invoice, Order Pick List, Pickup &amp; Delivery Invoice etc</li>\n<li>Custom Branding to Add Your Logo and Additional Store Information</li>\n<li>Supports Over 36 Languages including the ability to select a language for specific printer locations</li>\n<li>Generate PDF Receipts &amp; Invoices</li>\n<li>Product Mapping To Print Selected Product Category on Specific Print Stations</li>\n</ul>\n<h4>Template Integrations To Work With:</h4>\n<ul>\n<li><a href=\"https://jovvie.com/\" rel=\"nofollow ugc\">Jovvie Point of Sale by BizSwoop</a></li>\n<li><a href=\"https://www.bizswoop.com/pickup-delivery-scheduler/\" rel=\"nofollow ugc\">BizSwoop Pickup Delivery Scheduler</a></li>\n<li><a href=\"https://www.bizswoop.com/product-manager/\" rel=\"nofollow ugc\">BizSwoop Product Manager</a></li>\n<li><a href=\"https://flownotify.com/\" rel=\"nofollow ugc\">Flow Notify by BizSwoop</a></li>\n<li><a href=\"https://woocommerce.com/products/product-add-ons/\" rel=\"nofollow ugc\">WooCommerce Product Add-Ons</a></li>\n<li><a href=\"https://wordpress.org/plugins/yith-woocommerce-product-add-ons/\" rel=\"ugc\">YITH WooCommerce Product Add-Ons</a></li>\n<li><a href=\"https://wordpress.org/plugins/woo-delivery/\" rel=\"ugc\">Delivery &amp; Pickup Date Time for WooCommerce</a></li>\n<li><a href=\"https://wordpress.org/plugins/order-delivery-date-for-woocommerce/\" rel=\"ugc\">Order Delivery Date for WooCommerce</a></li>\n<li><a href=\"https://www.skyverge.com/product/woocommerce-local-pickup-plus/\" rel=\"nofollow ugc\">WooCommerce Local Pickup Plus</a></li>\n<li><a href=\"https://iconicwp.com/products/woocommerce-delivery-slots/\" rel=\"nofollow ugc\">WooCommerce Delivery Slots</a></li>\n<li><a href=\"https://wordpress.org/plugins/pi-woocommerce-order-date-time-and-type/\" rel=\"ugc\">Order Delivery, Order Pickup, Order Date, Order Time</a></li>\n<li><a href=\"https://wordpress.org/plugins/food-store/\" rel=\"ugc\">Food Store &#8211; Online Food Delivery &amp; Pickup</a></li>\n<li><a href=\"https://codecanyon.net/item/woocommerce-food-restaurant-menu-food-ordering/25457330\" rel=\"nofollow ugc\">WooCommerce Food &#8211; Restaurant Menu &amp; Food</a></li>\n<li><a href=\"https://wordpress.org/plugins/woo-extra-product-options/\" rel=\"ugc\">Extra Product Options (Product Addons) for WooCommerce</a></li>\n<li><a href=\"https://getbizprint.com/template-store/\" rel=\"nofollow ugc\">And More Compatibility Is Added Everyday!</a></li>\n</ul>\n<p>Steps To Getting Started:<br />\n1. Visit <a href=\"https://getbizprint.com/\" rel=\"nofollow ugc\">GetBizPrint.com</a> to read more about BizPrint.<br />\n2. Signup for <a href=\"https://login.bizswoop.app/register\" rel=\"nofollow ugc\">an account</a>. It&#8217;s FREE.<br />\n3. Select a plan &#8211; <a href=\"https://getbizprint.com/pricing/\" rel=\"nofollow ugc\">Get started with free prints.</a><br />\n4. Follow the <a href=\"https://getbizprint.com/quick-start-guide/\" rel=\"nofollow ugc\">Quick Start Guide.</a> You’ll be printing in 5 minutes.</p>\n<p>We’re ecstatic that Tiffany is having so much success using BizPrint:</p>\n<blockquote>\n<p>“I can create a customizable receipt for the customer that’s easy to read.</p>\n<p>If you need to use WooCommerce in-person, want to save money by emailing your receipts, or just need great looking receipts (I receive compliments about our receipts), I’d highly recommend BizPrint. The team and software are excellent, and easy to work with.” &#8211; Tiffany W. Owner, Swatty Creek Mill.</p>\n</blockquote>\n<h3>BizPrint WooCommerce Mapping:</h3>\n<ul>\n<li>Product &amp; Category Mapping: Using the <a href=\"https://getbizprint.com/features/mapping/\" rel=\"nofollow ugc\">Product &amp; Category Mapping feature</a> you can setup specific printers to only display printed items from chosen WooCommerce products &amp; categories. Setup multiple printer stations, and create efficient workflows to optimize fulfillment within your business.</li>\n<li>Shipping Zones &amp; Methods Mapping: Using the <a href=\"http://getbizprint.com/features/mapping/#shipping\" rel=\"nofollow ugc\">Shipping Zones &amp; Methods Mapping</a> you can setup printers to only print orders from defined shipping zones and methods. This can really help businesses that have multiple locations, fulfillment stations or other creative uses, like food trucks!</li>\n</ul>\n<p>Our users really enjoy this feature. This is what the owner of Mighty Moose Marts, a retail &amp; online store had to say about printer stations:</p>\n<blockquote>\n<p>“One of the strengths to us was the ability to support multiple printers in different locations.</p>\n<p>We’re using BizPrint to automatically print customer receipts at our ordering station and simultaneously print in the kitchen to fulfill the order. The impact is improved kitchen times, increased sales, and happier customers. I’d highly recommend BizPrint to other small businesses for in-store Point of Sale orders or orders placed online by your customers.” &#8211; Chris R. Co-Owner, Mighty Moose Marts.</p>\n</blockquote>\n<h3>BizPrint Hardware:</h3>\n<p>BizPrint was designed to work with any printer that can be connected to a Windows, Mac or Linux computer! This means you can use your current thermal or Inkjet Printers with support for all major brands like HP, Dymo, Cannon, Star, Epson, Brother and more. Supported connection types include Local, Network, USB, Serial, Wifi and Bluetooth Based Printers. If you do not want to use your own computer, learn more about <a href=\"https://getbizprint.com/bizprint-hub-hardware/\" rel=\"nofollow ugc\">BizPrint Hub</a>.</p>\n<h3>BizPrint User Documentation &amp; Support:</h3>\n<p>If you need help with BizPrint, you have multiple options for getting help:<br />\n1. Please ensure you have setup BizPrint properly using the <a href=\"https://getbizprint.com/quick-start-guide/\" rel=\"nofollow ugc\">Quick Start Guide.</a><br />\n2. Refer to the <a href=\"https://getbizprint.com/documentation/\" rel=\"nofollow ugc\">BizPrint documentation</a> for troubleshooting information.<br />\n3. Get in touch with our <a href=\"https://getbizprint.com/support/\" rel=\"nofollow ugc\">support team.</a></p>\n<h3>BizPrint Expert Developer Documentation:</h3>\n<p>Although BizPrint doesn’t require any coding knowledge to use, there are instances where you want to print WooCommerce Orders in a more customized manner. For this, we provide <a href=\"https://getbizprint.com/documentation/developer/\" rel=\"nofollow ugc\">developer documentation</a> which provides you the plugin development structure to add your own custom WooCommerce Order Receipt, Invoice, Packing Slip and other templates.</p>\n<p>You can also find developer resources in the <a href=\"https://getbizprint.com/#developer\" rel=\"nofollow ugc\">BizPrint marketplace</a> including the Sample print template.</p>\n<p>Also provided are WP Actions to Extend Third-party plugin meta data into templates. By default, BizPrint works with all <a href=\"https://www.bizswoop.com/\" rel=\"nofollow ugc\">BizSwoop Plugins</a> and there have been a number of <a href=\"https://getbizprint.com/marketplace/\" rel=\"nofollow ugc\">templates developed</a> for other 3rd party plugins. If the template is not compatible with your 3rd party plugin, you can develop your own template integration, or reach out to the BizPrint team to request compatibility.</p>\n<h3>What features are included in BizPrint?:</h3>\n<ul>\n<li><strong>Instant Printing:</strong> Automatically print WooCommerce orders in a receipt format based on order status anywhere in your restaurant, retail store or fulfillment station instantly.</li>\n<li><strong>Supports All Printer Models:</strong> All printers that can connect to a Mac, PC or Linux and have a supported driver will work. Easy to adjust margins and formatting.</li>\n<li><strong>Custom Branding on Receipts:</strong> Easily customize invoice and order print templates to include your company logo or other company information.</li>\n<li><strong>WooCommerce Compatibility:</strong> Native WooCommerce compatibility means that it works with other plugins. No need for third-party solutions to generate orders/invoices!</li>\n<li><strong>Print to Multiple Printers:</strong> A scalable cloud solution that can print to multiple printers at once. And we support any printer model! If it connects to a Windows, Mac or Linux, it will work.</li>\n<li><strong>Generates PDF Receipts:</strong> With the ability to generate a PDF of the receipt, BizPrint offers an easier and less fragmented solution for your WooCommerce printing needs.</li>\n<li><strong>Simple to Set Up &amp; Easy to Use:</strong> Don’t worry, we make it simple to set up – even for non-technical people! Create a BizSwoop account, configure the BizPrint plugin, and start printing in under 5 minutes.</li>\n<li><strong>Supports 36 Languages:</strong> We speak your language! Plugin and receipt templates support 36 languages, including the ability to select a language for specific printer locations.</li>\n<li><strong>Unlimited Printer Locations:</strong> Set up an unlimited number of printers and print to multiple locations. iOS &amp; Android devices can also send print jobs.</li>\n<li><strong>Supports Thermal Receipt Printers:</strong> Order printing is formatted for both Thermal receipt and Inkjet printers. Supports standard printers Letter/A4 for customer and order receipts.</li>\n<li><strong>Cloud Printing:</strong> Fast and secure printing with BizPrint Cloud infrastructure enables printing to anywhere in the world. The Cloud Printing functionality is compatible with the POS.</li>\n<li><strong>Automatically Print WooCommerce Packing Slips:</strong> Package Fulfillment for retail to ship packages to customers, packing slips and receipts. Shipping from your store is easier than ever.</li>\n<li><strong>Print WooCommerce Orders Straight to the Kitchen:</strong> Restaurant printing orders for customer receipts and fulfillment inside their restaurant. Enjoy a more efficient workflow and higher productivity with orders instantly printed in the kitchen.</li>\n<li><strong>Print On-Demand At Point of Sale:</strong> Point of Sale to print customer receipts transaction (any POS using WooCommerce is compatible). Print professional-looking receipts every time!</li>\n<li><strong>Product Mapping Add-On:</strong> Map specific printers to only print items from defined products and categories. The add-ons allow the admin to select products and categories to print for only specific locations.</li>\n<li><strong>Pickup and Delivery Add-On:</strong> Easily <a href=\"https://www.bizswoop.com/pickup-delivery-scheduler/\" rel=\"nofollow ugc\">add pick-up, take-out, curbside or local delivery</a> functionality to the checkout workflow on your WooCommerce store. We make it simple!</li>\n<li><a href=\"https://getbizprint.com/features/\" rel=\"nofollow ugc\">View All</a></li>\n</ul>\n<h3>Learn More About Specific Print Topics On Our Blog:</h3>\n<ul>\n<li><a href=\"https://getbizprint.com/woocommerce-print-receipt/\" rel=\"nofollow ugc\">How To Print Order Receipts in WooCommerce</a></li>\n<li><a href=\"https://getbizprint.com/woocommerce-packing-slip-print/\" rel=\"nofollow ugc\">How To Automatically Print Packing Slips from WooCommerce</a></li>\n<li><a href=\"https://getbizprint.com/woocommerce-thermal-printer/\" rel=\"nofollow ugc\">Print Receipts on Thermal Printer with WooCommerce￼</a></li>\n<li><a href=\"https://getbizprint.com/woocommerce-print-order-list/\" rel=\"nofollow ugc\">How to Print an Order List in WooCommerce (Automatically)</a></li>\n<li><a href=\"https://getbizprint.com/how-to-generate-invoice-in-woocommerce/\" rel=\"nofollow ugc\">Generate a Simple Invoice in WooCommerce (For Email and Print)</a></li>\n</ul>\n<h3>What Else?</h3>\n<ul>\n<li>BizPrint is developed by BizSwoop based in the United States. If you like BizPrint for Order &amp; Receipt, consider checking out the other projects from <a href=\"https://www.bizswoop.com/\" rel=\"nofollow ugc\">BizSwoop:</a></li>\n<li><a href=\"https://jovvie.com/\" rel=\"nofollow ugc\">Jovvie Point of Sale for WooCommerce</a> &#8211; A fast, complete Point of Sale system built for WooCommerce stores of all sizes. Restaurants, retailers and sales teams around the globe love using Jovvie POS. Load the POS on any device and sell anywhere!</li>\n<li><a href=\"https://flownotify.com/\" rel=\"nofollow ugc\">Flow Notify</a> &#8211; The Best SMS, WhatsApp &amp; Email Notification Plugin for your store. Create order statuses and send order alert info to customers through automated SMS, WhatsApp, and Emails in WordPress and WooCommerce.</li>\n<li><a href=\"https://www.bizswoop.com/product-manager/\" rel=\"nofollow ugc\">Product Manager Add-ons</a> &#8211; The #1 Product Manager Add-ons plugin for WooCommerce! Create easy product up-sells, checkout add-ons, product tables, samples, bundles and more. Your store is going to get a major boost, you won’t find a better Product Manager plugin for WooCommerce with more to offer.</li>\n<li><a href=\"https://www.bizswoop.com/store-order-hours\" rel=\"nofollow ugc\">Store Order Hours</a> &#8211; Create your online open sign with a store hours scheduler. Automatically toggle WooCommerce customer checkout functionality on/off on a schedule. Create visual notification settings, Add floating hours widget, custom branding, and more. </li>\n<li><a href=\"https://www.bizswoop.com/pickup-delivery-scheduler/\" rel=\"nofollow ugc\">Pickup Delivery Scheduler</a> &#8211; Easily add pick-up, take-out, curbside and local delivery functionality to your WooCommerce store. Smart logic features allow for easy implementation of calendar ordering scheduling, defined pre-order days, minimum wait times, delivery cut-off times and order volume time slot management for your business.</li>\n<li><a href=\"https://www.bizswoop.com/store-plus/\" rel=\"nofollow ugc\">Store Plus B2B Wholesale for WooCommerce</a> &#8211; Wholesale, B2B and Enterprise business account functionality for customer level pricing, customer business profiles &amp; more. The software automatically uses your defined pricing rules to calculate and display the product price on simple, variable and variation prices dynamically in real-time on customer accounts.</li>\n</ul>\n",
        "installation": "<ol>\n<li>Upload Print Manager to the /wp-content/plugins/ directory</li>\n<li>Activate the plugin through the Plugins menu in WordPress</li>\n<li>Now select from the WooCommerce menu Printer Settings</li>\n<li>Click the General Tab and Customize Printer Settings and Company Information</li>\n<li>[Setup a BizSwoop account for BizPrint Service] (https://getbizprint.com/quick-start-guide/)</li>\n<li>Click the Locations Tab and Select Printers your Account. Orders will Start Printing</li>\n<li>If you have any issues contact, visit <a href=\"https://getbizprint.com/support/\" rel=\"nofollow ugc\">support</a></li>\n</ol>\n",
        "faq": "\n<dt id='how%20do%20i%20get%20started%20using%20bizprint%3F'>\nHow Do I Get Started Using BizPrint?\n</h4>\n<p>\n<p>Start by creating a <a href=\"https://login.bizswoop.app/register\" rel=\"nofollow ugc\">free account</a> and then following our <a href=\"https://getbizprint.com/quick-start-guide/\" rel=\"nofollow ugc\">quick start setup guide</a>.</p>\n</p>\n<dt id='is%20print%20manager%20%26%20bizprint%20free%3F'>\nIs Print Manager &amp; BizPrint Free?\n</h4>\n<p>\n<p>Print Manager is a free plugin and is used to connect to BizPrint to power cloud printing services. BizPrint offers free prints to get started. You can learn more about plans and pricing at <a href=\"https://getbizprint.com/pricing/\" rel=\"nofollow ugc\">GetBizPrint.com/Pricing</a></p>\n</p>\n<dt id='do%20i%20need%20an%20account%20to%20print%3F'>\nDo I Need An Account to Print?\n</h4>\n<p>\n<p>Yes, you need a BizSwoop account to use BizPrint. The BizSwoop account is Free to create. You can get started <a href=\"https://login.bizswoop.app/register\" rel=\"nofollow ugc\">here</a>.</p>\n</p>\n<dt id='where%20do%20i%20find%20out%20more%20information%20about%20the%20bizprint%20cloud%20service%3F'>\nWhere Do I Find Out More Information About The BizPrint Cloud Service?\n</h4>\n<p>\n<p>Visit our website for more information at <a href=\"https://getbizprint.com/\" rel=\"nofollow ugc\">GetBizPrint.com</a></p>\n</p>\n<dt id='do%20you%20provide%20support%3F'>\nDo You Provide Support?\n</h4>\n<p>\n<p>Yes, we actively support and develop the Print Manager plugin and BizPrint Cloud Print. You can contact us at any time by visiting <a href=\"https://getbizprint.com/support/\" rel=\"nofollow ugc\">https://getbizprint.com/support/</a> to submit a support request, report bugs or submit request features.</p>\n</p>\n<dt id='will%20you%20support%20order%20receipt%20print%20plugin%20version%203.0.16%20and%20older%3F'>\nWill you support Order Receipt Print plugin version 3.0.16 and older?\n</h4>\n<p>\n<p>Sorry, no. Order Receipt Print plugin was developed for Google Cloud Print. Google Cloud Print shuts down effective December 31, 2020. Once the Google system is shut down, we are not able to support legacy versions of the plugin Order Receipt Print. To continue using the plugin, you need to update to the latest version Print Manager using the BizPrint Cloud Print SaaS service for all printing requirements with WooCommerce.</p>\n</p>\n\n",
        "changelog": "<h4>4.5.15</h4>\n<ul>\n<li>Add Greek language support</li>\n<li>WC 9.1.4 compatibility</li>\n<li>WP 6.6.1 compatibility </li>\n</ul>\n<h4>4.5.14</h4>\n<ul>\n<li>Add Traditional Chinese language support</li>\n<li>Add Simplified Chinese language support</li>\n<li>WC 9.1.2 compatibility</li>\n<li>WP 6.6.0 compatibility </li>\n</ul>\n<h4>4.5.13</h4>\n<ul>\n<li>PHP 8 compatibility</li>\n<li>Bug fixes and performance improvements</li>\n<li>WC 9.0.2 compatibility</li>\n<li>WP 6.5.5 compatibility </li>\n</ul>\n<h4>4.5.12</h4>\n<ul>\n<li>Add URL Hash improvements</li>\n<li>Bug fixes and performance improvements</li>\n<li>WC 8.9.1 compatibility</li>\n<li>WP 6.5.3 compatibility </li>\n</ul>\n<h4>4.5.11</h4>\n<ul>\n<li>Add Tamil language support</li>\n<li>Bug fixes and performance improvements</li>\n<li>WC 8.7.0 compatibility</li>\n<li>WP 6.5.2 compatibility </li>\n</ul>\n<h4>4.5.8</h4>\n<ul>\n<li>Patch to price management template add-on</li>\n</ul>\n<h4>4.5.6</h4>\n<ul>\n<li>Patch to Cross Site Request Forgery (CSRF) printer management fix</li>\n<li>WC 8.6.1 compatibility</li>\n</ul>\n<h4>4.5.5</h4>\n<ul>\n<li>Improve html symantics for templates</li>\n<li>WC 8.5.3 compatibility</li>\n<li>WP 6.4.3 compatibility    </li>\n</ul>\n<h4>4.5.4</h4>\n<pre><code>* New print dialog window\n* New Browser Print workflow\n* Add filter for disallowed query args\n* Fix broken access control preview view \n* Fix Cross Site Request Forgery (CSRF) printer management\n* WC 8.5.1 compatibility\n* WP 6.4.2 compatibility    \n</code></pre>\n<h4>4.5.1</h4>\n<pre><code>* New print dialog window\n* New Browser Print workflow\n* Add filter for disallowed query args\n* WC 8.5.1 compatibility\n* WP 6.4.2 compatibility\n</code></pre>\n<h4>4.3.39</h4>\n<pre><code>* WC 8.3.1 compatibility\n* WP 6.4.1 compatibility          \n</code></pre>\n<h4>4.3.38</h4>\n<pre><code>* Compatibility with HPOS\n* Bug fixes and performance improvements        \n</code></pre>\n<h4>4.3.37</h4>\n<pre><code>* Backwards Compatibility with Older WC versioning\n* Bug fixes and performance improvements\n</code></pre>\n<h4>4.3.36</h4>\n<pre><code>* Table Compatibility with HPOS\n* Bug fixes and performance improvements\n</code></pre>\n<h4>4.3.35</h4>\n<pre><code>* Hook for price settings\n* Compatibility with HPOS\n* Bug fixes and performance improvements\n* WC 8.1.1 compatibility\n</code></pre>\n<h4>4.3.32</h4>\n<pre><code>* Compatibility with Order Scheduler Pro\n* Compatibility with HPOS\n* Bug fixes and performance improvements\n* WC 8.0.3 compatibility\n* WP 6.3.1 compatibility    \n</code></pre>\n<h4>4.3.31</h4>\n<pre><code>* Print connection optimizations\n* Bug fixes and performance improvements\n* WC 7.6.1 compatibility\n* WP 6.2.0 compatibility\n</code></pre>\n<h4>4.3.30</h4>\n<pre><code>* UI/UX string improvements for connection issues\n* Bug fixes and performance improvements\n* WC 7.6.0 compatibility\n* WP 6.2.0 compatibility\n</code></pre>\n<h4>4.3.29</h4>\n<pre><code>* UI/UX string improvements\n* Bug fixes and performance improvements\n* WC 7.5.0 compatibility\n</code></pre>\n<h4>4.3.26</h4>\n<pre><code>* Bug fixes and performance improvements\n* WC 7.4.1 compatibility\n</code></pre>\n<h4>4.3.25</h4>\n<pre><code>* Add fix for Zprint-POS and headers PHP logging\n* Bug fixes and performance improvements\n</code></pre>\n<h4>4.3.24</h4>\n<pre><code>* Add fix for Zprint-POS PHP logging\n* Bug fixes and performance improvements\n* WC 7.4.0 compatibility\n</code></pre>\n<h4>4.3.23</h4>\n<pre><code>* Add support for PHP +\n* Bug fixes and performance improvements\n* WC 7.3.0 compatibility\n</code></pre>\n<h4>4.3.22</h4>\n<pre><code>* Add Hungarian as a supported language\n* WP 6.1.1 compatibility\n* WC 7.2.0 compatibility\n</code></pre>\n<h4>4.3.21</h4>\n<pre><code>* Bug fix for plain text template rendering\n* WP 6.0.3 compatibility\n* WC 7.0.0 compatibility\n</code></pre>\n<h4>4.3.19</h4>\n<pre><code>* Readme updates\n* WC 6.8.2 compatibility\n</code></pre>\n<h4>4.3.18</h4>\n<pre><code>* WC 6.8.2 compatibility\n</code></pre>\n<h4>4.3.16</h4>\n<pre><code>* Fix permission access restrictons \n* Bug fixes and performance improvements\n</code></pre>\n<h4>4.3.15</h4>\n<pre><code>* Fix empty printer list\n* Bug fixes and performance improvements\n* WP 6.0.1 compatibility\n* WC 6.7.0 compatibility\n</code></pre>\n<h4>4.3.14</h4>\n<pre><code>* Set error warning message log\n* Bug fixes\n</code></pre>\n<h4>4.3.12</h4>\n<pre><code>* Set undefined status for shipping mapping\n* Bug fixes\n* WC 6.5.1 compatibility\n</code></pre>\n<h4>4.3.11</h4>\n<pre><code>* Plugin reset data functionality\n</code></pre>\n<h4>4.3.9</h4>\n<pre><code>* Webhooks connection optimizations\n* Performance Improvements\n* Bug fixes\n* WC 6.4.1 compatibility\n</code></pre>\n<h4>4.3.6</h4>\n<pre><code>* New development hooks\n* Performance Improvements\n* Bug fixes\n* WP 5.9.3 compatibility\n</code></pre>\n<h4>4.3.1</h4>\n<pre><code>* New activation workflow\n* New layout of plugin UI/UX\n* Performance Improvements\n* Bug fixes\n* WP 5.9.2 compatibility\n</code></pre>\n<h4>4.2.1</h4>\n<pre><code>* Bulk print functionality \n* Performance Improvements\n* Bug fixes\n* WP 5.9.1 compatibility\n* WC 6.3.1 compatibility\n</code></pre>\n<h4>4.1.20</h4>\n<pre><code>* Performance Improvements\n* Bug fixes\n* WP 5.9.0 compatibility\n* WC 6.1.1 compatibility\n</code></pre>\n<h4>4.1.18</h4>\n<pre><code>* I18n input encoding for location fields\n* Bug fixes\n</code></pre>\n<h4>4.1.17</h4>\n<pre><code>* Improvements for location save functionality\n* Bug fixes\n</code></pre>\n<h4>4.1.16</h4>\n<pre><code>* Add translation support for Swedish language and dialect variants\n* WC 5.9.0 compatibility\n</code></pre>\n<h4>4.1.14</h4>\n<pre><code>* Add translation support for Swedish language and dialect variants\n* WC 5.8.0 compatibility\n</code></pre>\n<h4>4.1.13</h4>\n<pre><code>* PHP compatibility support fix\n* WC 5.7.1 compatibility\n</code></pre>\n<h4>4.1.11</h4>\n<pre><code>* WP 5.8.1 compatibility\n</code></pre>\n<h4>4.1.10</h4>\n<pre><code>* Improvements for Order ID mapping\n* Bug fixes\n* WC 5.7.0 compatibility\n</code></pre>\n<h4>4.1.7</h4>\n<pre><code>* Add location language support for selecting receipt languages\n* Performance improvements\n* Bug fixes\n* WC 5.6.0 compatibility\n</code></pre>\n<h4>4.1.2</h4>\n<pre><code>* Add access role management for plugin settings\n* ![TRANSLATION SUPPORT]! Added support for 28 languages\n* ![SAAS SERVICE]! Cloud Print Service BizPrint solution, learn more at https://www.bizswoop.com/wp/print/\n* ![REQUIRED]! Setup new BizPrint Cloud Print SaaS service at https://www.bizswoop.com/print-setup/\n* WP 5.8.0 compatibility\n* WC 5.5.2 compatibility\n</code></pre>\n<h4>4.1.1</h4>\n<pre><code>* ![TRANSLATION SUPPORT]! Added support for 28 languages\n* Add filter and hooks support for 3rd part templates\n* Modify filter on sample print jobs\n* Database table check logic and behavior\n* ![SAAS SERVICE]! Cloud Print Service BizPrint solution, learn more at https://www.bizswoop.com/wp/print/\n* ![REQUIRED]! Setup new BizPrint Cloud Print SaaS service at https://www.bizswoop.com/print-setup/\n</code></pre>\n<h4>4.1.0</h4>\n<pre><code>* ![TRANSLATION SUPPORT]! Added support for 28 languages\n* Add filter and hooks support for 3rd part templates\n* Modify filter on sample print jobs\n* ![SAAS SERVICE]! Cloud Print Service BizPrint solution, learn more at https://www.bizswoop.com/wp/print/\n* ![REQUIRED]! Setup new BizPrint Cloud Print SaaS service at https://www.bizswoop.com/print-setup/\n</code></pre>\n<h4>4.0.21</h4>\n<pre><code>* Add custom margin support for thermal printers connected to Windows\n* ![NEW]! Cloud Print Service BizPrint solution, learn more at https://www.bizswoop.com/wp/print/\n* ![REQUIRED]! Setup new BizPrint Cloud Print SaaS service at https://www.bizswoop.com/print-setup/\n</code></pre>\n<h4>4.0.20</h4>\n<pre><code>* Add beforeFooter and end hooks to print template strucutre\n* ![NEW]! Cloud Print Service BizPrint solution, learn more at https://www.bizswoop.com/wp/print/\n* ![REQUIRED]! Setup new BizPrint Cloud Print SaaS service at https://www.bizswoop.com/print-setup/\n</code></pre>\n<h4>4.0.19</h4>\n<pre><code>* Revert printer model template improvements for print layout optimizations due to conflicts\n* ![NEW]! Cloud Print Service BizPrint solution, learn more at https://www.bizswoop.com/wp/print/\n* ![REQUIRED]! Setup new BizPrint Cloud Print SaaS service at https://www.bizswoop.com/print-setup/\n</code></pre>\n<h4>4.0.18</h4>\n<pre><code>* Printer model template improvements for print layout optimizations\n* ![NEW]! Cloud Print Service BizPrint solution, learn more at https://www.bizswoop.com/wp/print/\n* ![REQUIRED]! Setup new BizPrint Cloud Print SaaS service at https://www.bizswoop.com/print-setup/\n</code></pre>\n<h4>4.0.17</h4>\n<pre><code>* ![NEW]! Print dialog UX improvements\n* ![NEW]! Print order actions button\n* Improvement to Print UI strings for usability\n* Debug and log data functionality\n* WP 5.7.2 compatibility\n* ![NEW]! Cloud Print Service BizPrint solution, learn more at https://www.bizswoop.com/wp/print/\n* ![REQUIRED]! Setup new BizPrint Cloud Print SaaS service at https://www.bizswoop.com/print-setup/\n</code></pre>\n<h4>4.0.12</h4>\n<pre><code>* Print template store compatibility and hooks\n* POS save compatibility optimizations\n* Debug and log data functionality\n* WC 5.3.0 compatibility\n* ![NEW]! Cloud Print Service BizPrint solution, learn more at https://www.bizswoop.com/wp/print/\n* ![REQUIRED]! Setup new BizPrint Cloud Print SaaS service at https://www.bizswoop.com/print-setup/\n</code></pre>\n<h4>4.0.10</h4>\n<pre><code>* Print call optimizations\n* Debug and log data functionality\n* Print Manager Add-ons compatibility\n* WP 5.7.1 compatibility\n* WC 5.2.2 compatibility\n* ![NEW]! Cloud Print Service BizPrint solution, learn more at https://www.bizswoop.com/wp/print/\n* ![REQUIRED]! Setup new BizPrint Cloud Print SaaS service at https://www.bizswoop.com/print-setup/\n</code></pre>\n<h4>4.0.6</h4>\n<pre><code>* Multiple copies support\n* ![NEW]! Cloud Print Service BizPrint solution, learn more at https://www.bizswoop.com/wp/print/\n* ![REQUIRED]! Setup new BizPrint Cloud Print SaaS service at https://www.bizswoop.com/print-setup/\n* WP 5.7.0 compatibility\n* WC 5.1.0 compatibility\n</code></pre>\n<h4>4.0.1</h4>\n<pre><code>* !IMPORTANT! Google Cloud Print is shutting down, effective December 31, 2020.\n* ![NEW]! Cloud Print Service BizPrint solution, learn more at https://www.bizswoop.com/wp/print/\n* ![REQUIRED]! Setup new BizPrint Cloud Print SaaS service at https://www.bizswoop.com/print-setup/\n* Add BizPrint Cloud Print code infrastructure\n* Remove Google Cloud Print code infrastructure\n* WP 5.6.0 compatibility\n* WC 4.8.0 compatibility\n</code></pre>\n<h4>3.1.5</h4>\n<pre><code>* !IMPORTANT! Google Cloud Print is shutting down, effective December 31, 2020.\n* ![NEW]! Cloud Print Service BizPrint solution, learn more at https://www.bizswoop.com/wp/print/\n* WP 5.6.0 compatibility\n* WC 4.8.0 compatibility\n</code></pre>\n<h4>3.0.16</h4>\n<pre><code>* !IMPORTANT! Google Cloud Print is shutting down, effective December 31, 2020.\n* ![NEW]! Cloud Print Service BizPrint solution schedule for release, learn more at https://www.bizswoop.com/wp/print/\n* Manual print support for BizSwoop POS plugin\n* WP 5.5.3 compatibility\n* WC 4.7.1 compatibility\n</code></pre>\n<h4>3.0.15</h4>\n<pre><code>* Google Cloud Print is shutting down. New features and functionality will be on hold until replacement to GCP is released.\n* WP 5.5.1 compatibility\n* WC 4.5.2 compatibility\n</code></pre>\n<h4>3.0.14</h4>\n<pre><code>* Google Cloud Print is shutting down. New features and functionality will be on hold until replacement to GCP is released.\n* WP 5.5 compatibility\n* WC 4.4.1 compatibility\n</code></pre>\n<h4>3.0.13</h4>\n<pre><code>* WP 5.2 and WC 4.3.0 compatibility\n* Performance improvements\n* Bug fixes\n</code></pre>\n<h4>3.0.12</h4>\n<pre><code>* Print template modifications for Take-Out and Delivery\n* Performance improvements\n* Bug fixes\n</code></pre>\n<h4>3.0.11</h4>\n<pre><code>* Support for Checkout Add-ons plugin\n    * Support for Take-Out and Delivery plugin\n    * Performance improvements\n* Bug fixes\n</code></pre>\n<h4>3.0.5</h4>\n<pre><code>* Change default print templates to use general settings for Local Timezone for time ordered value\n* Bug fixes\n</code></pre>\n<h4>3.0.4</h4>\n<pre><code>* Bug fix to custom logo and headers displaying on default templates\n* Bug fix location saving for existing locations\n* Hide _reduced_stock on default templates for inventory management of products\n* Print API performance improvements\n</code></pre>\n<h4>3.0.3</h4>\n<pre><code>* Modifications to zPrint API for product &amp; category mapping on locations\n* New template option \"Include Order Cost\" to hide or show order total amounts\n* Bug fixes and performance improvements\n* WP 5.1 and WC 3.5.5 compatibility\n</code></pre>\n<h4>3.0.2</h4>\n<pre><code>* Added wp hook to zPrint API for custom templates loading\n* Bug fixes to print order status\n</code></pre>\n<h4>3.0.1</h4>\n<pre><code>* Major release will not provide backwards compatibility to print templates\n* Customizations on header, footer &amp; content for templates on each location\n* Add support for automatic print to all WooCommerce order status types\n* Add support for custom templates output type selection on templates\n* Bug fixes to print stability and scalability\n</code></pre>\n<h4>2.1.2</h4>\n<pre><code>* Tweak to Text Domain string to fix for localization support\n</code></pre>\n<h4>2.1.1</h4>\n<pre><code>* Bug fix to Domain path for localization support\n</code></pre>\n<h4>2.1.0</h4>\n<pre><code>* Added Location Mapping to Users based on User Roles\n* Added Localization Support for String Translations\n* Added New Layout Styling for Location Settings\n* Added New Shipping &amp; Customer Settings for Default Templates\n* Added Support for Custom Templates\n* Bug Fixes\n</code></pre>\n<h4>2.0.5</h4>\n<pre><code>* Added Shipping Method Section to Customer Order Receipt &amp; Order Receipt Template\n* Added Support for Local Pickup Shipping Method\n* Bug Fixes\n</code></pre>\n<h4>2.0.4</h4>\n<pre><code>* Added Shipping Method to Customer Order Receipt Template\n* Bug Fixes\n</code></pre>\n<h4>2.0.3</h4>\n<pre><code>* Bug Fixes\n</code></pre>\n<h4>2.0.2</h4>\n<pre><code>* Major upgrade release\n* Added Support for Custom Margins\n* Added Support for Page Orientation\n* Add New Template for Customer Order Receipt\n* Added Support for Custom Layout Size of Paper\n* Added Templates for Order Receipt, Customer Receipt &amp; Customer Order Receipt with Letter, A4 &amp; Thermal Printers\n* Fixes to Bugs\n</code></pre>\n<h4>1.0.13</h4>\n<pre><code>* Feature Support for Enabling &amp; Disabling Automatic Printing\n* Added Plug-in Version &amp; Automatic Printing Status Information to Log File\n</code></pre>\n<h4>1.0.12</h4>\n<pre><code>* Feature Support for Automatic Printing based on WooCommerce Statuses\n* Hide POS Label, if POS not Installed\n</code></pre>\n<h4>1.0.11</h4>\n<pre><code>* Bug Fixes for Deleting Locations\n</code></pre>\n<h4>1.0.10</h4>\n<pre><code>* Bug Fixes\n</code></pre>\n<h4>1.0.9</h4>\n<pre><code>* Optimizing for background print jobs\n* Bug Fixes\n</code></pre>\n<h4>1.0.7</h4>\n<pre><code>* Fixes for background print jobs\n* Template Bug Fixes\n</code></pre>\n<h4>1.0.5</h4>\n<pre><code>* Bug Fixes and WooCommerce Load Order\n</code></pre>\n<h4>1.0</h4>\n<pre><code>* First version released for Print Google Cloud Print WooCommerce.\n</code></pre>\n"
    },
    "short_description": "Print Anywhere &amp; Create PDFs of Receipts, Order Invoice, Packing Slip, PDF, Packing List, Shipping Labels, Credit Notes and More for WooCommerce - &hellip;",
    "description": "<p>BizPrint is simply the best way to print documents for your WooCommerce orders to any printer around your home office, restaurant, warehouse or business of any type or create PDFs. Print Manager formats your WooCommerce order data into an organized and branded <a href=\"https://getbizprint.com/woocommerce-thermal-printer/\" rel=\"nofollow ugc\">receipt</a>, <a href=\"https://getbizprint.com/woocommerce-custom-invoice/\" rel=\"nofollow ugc\">invoice</a>, <a href=\"https://getbizprint.com/woocommerce-packing-slip-print\" rel=\"nofollow ugc\">packing slip</a>, <a href=\"http://getbizprint.com/woocommerce-delivery-notes\" rel=\"nofollow ugc\">delivery note</a>, <a href=\"https://getbizprint.com/woocommerce-shipping-labels\" rel=\"nofollow ugc\">shipping label</a> or order printout, for your customers and staff to use!</p>\n<p>This free Print Manager Plugin connects to <a href=\"https://getbizprint.com/\" rel=\"nofollow ugc\">BizPrint</a> cloud service to enable automatic printing to anywhere in the world! In just one year, BizPrint has helped businesses to automate over 1,250,000+ Prints and saved over 575,000+ employee hours! It’s easy to set up with no coding required in just a few simple steps. You can read the full list of benefits for store owners and get started at <a href=\"https://getbizprint.com/\" rel=\"nofollow ugc\">GetBizPrint.com</a></p>\n<p>BizPrint prints your WooCommerce orders automatically to your existing printer, and has the reliability, flexibility, and customizability you need for your specific use case. You’ve found the right plugin!</p>\n<h4>Why Create Printed Receipts For Your Store?</h4>\n<p>Any transaction between a store and customer needs some evidence of purchase. There are many reasons to make your WooCommerce order details physical. For example:</p>\n<ul>\n<li>If you run a restaurant, the kitchen and wait staff will need physical copies of the order so they can prepare the food and serve customers with maximum efficiency.</li>\n<li>For warehouses or fulfillment centers, a printed order will help pickers and packers to prepare and fulfill an order without delay.</li>\n<li>In lots of cases, a customer will want a printed receipt in order to prove a purchase, for product returns, employer reimbursement or for tax purposes.</li>\n</ul>\n<p>BizPrint has a customer satisfaction rating of 4.8 stars and boasts 99.5% reliability uptime on our globally distributed servers that power the cloud. We have answered over 7,500 support tickets last year alone and can’t wait to help save you time!</p>\n<p>But don’t just take our word for it! This is what Chris from Kyoto Sushi had to say about how BizPrint is helping their business:</p>\n<blockquote>\n<p>“We started taking orders online and printing them with BizPrint, and it has been game changing. BizPrint improves the customer experience, reduces kitchen downtime, and frees up my time. My staff are 30% more productive. I can outperform our competitors (including on UberEat, Deliveroo, etc) whilst having lower costs, better quality, and lower prices. If you own a restaurant, getting BizPrint is a no-brainer.” &#8211; Chris L. Owner Kyoto Sushi Restaurant.</p>\n</blockquote>\n<h4>BizPrint for WooCommerce Includes All The Features You Need</h4>\n<ul>\n<li>Supports Automatic Prints by Order Status</li>\n<li>Adds Manual Print Button Option on WooCommerce Orders &amp; Details Page</li>\n<li>Set Up An Unlimited Number of Printer Stations and Locations</li>\n<li>Use Your Current Thermal or Inkjet Printers</li>\n<li>Supports All Major Brands like HP, Dymo, Cannon, Star, Epson, Brother &amp; more</li>\n<li>Supports Local, Network, USB, Serial, Wifi and Bluetooth Based Printers</li>\n<li>Choose Single Print or Print Multiple Copies Instantly</li>\n<li>Support with Popular WordPress Plugins like Product Add-ons, Point of Sale, Pickup Delivery Scheduler and More</li>\n<li>Over 15 Templates Available Including, Receipt Template, Customer Invoice, Order Pick List, Pickup &amp; Delivery Invoice etc</li>\n<li>Custom Branding to Add Your Logo and Additional Store Information</li>\n<li>Supports Over 36 Languages including the ability to select a language for specific printer locations</li>\n<li>Generate PDF Receipts &amp; Invoices</li>\n<li>Product Mapping To Print Selected Product Category on Specific Print Stations</li>\n</ul>\n<h4>Template Integrations To Work With:</h4>\n<ul>\n<li><a href=\"https://jovvie.com/\" rel=\"nofollow ugc\">Jovvie Point of Sale by BizSwoop</a></li>\n<li><a href=\"https://www.bizswoop.com/pickup-delivery-scheduler/\" rel=\"nofollow ugc\">BizSwoop Pickup Delivery Scheduler</a></li>\n<li><a href=\"https://www.bizswoop.com/product-manager/\" rel=\"nofollow ugc\">BizSwoop Product Manager</a></li>\n<li><a href=\"https://flownotify.com/\" rel=\"nofollow ugc\">Flow Notify by BizSwoop</a></li>\n<li><a href=\"https://woocommerce.com/products/product-add-ons/\" rel=\"nofollow ugc\">WooCommerce Product Add-Ons</a></li>\n<li><a href=\"https://wordpress.org/plugins/yith-woocommerce-product-add-ons/\" rel=\"ugc\">YITH WooCommerce Product Add-Ons</a></li>\n<li><a href=\"https://wordpress.org/plugins/woo-delivery/\" rel=\"ugc\">Delivery &amp; Pickup Date Time for WooCommerce</a></li>\n<li><a href=\"https://wordpress.org/plugins/order-delivery-date-for-woocommerce/\" rel=\"ugc\">Order Delivery Date for WooCommerce</a></li>\n<li><a href=\"https://www.skyverge.com/product/woocommerce-local-pickup-plus/\" rel=\"nofollow ugc\">WooCommerce Local Pickup Plus</a></li>\n<li><a href=\"https://iconicwp.com/products/woocommerce-delivery-slots/\" rel=\"nofollow ugc\">WooCommerce Delivery Slots</a></li>\n<li><a href=\"https://wordpress.org/plugins/pi-woocommerce-order-date-time-and-type/\" rel=\"ugc\">Order Delivery, Order Pickup, Order Date, Order Time</a></li>\n<li><a href=\"https://wordpress.org/plugins/food-store/\" rel=\"ugc\">Food Store &#8211; Online Food Delivery &amp; Pickup</a></li>\n<li><a href=\"https://codecanyon.net/item/woocommerce-food-restaurant-menu-food-ordering/25457330\" rel=\"nofollow ugc\">WooCommerce Food &#8211; Restaurant Menu &amp; Food</a></li>\n<li><a href=\"https://wordpress.org/plugins/woo-extra-product-options/\" rel=\"ugc\">Extra Product Options (Product Addons) for WooCommerce</a></li>\n<li><a href=\"https://getbizprint.com/template-store/\" rel=\"nofollow ugc\">And More Compatibility Is Added Everyday!</a></li>\n</ul>\n<p>Steps To Getting Started:<br />\n1. Visit <a href=\"https://getbizprint.com/\" rel=\"nofollow ugc\">GetBizPrint.com</a> to read more about BizPrint.<br />\n2. Signup for <a href=\"https://login.bizswoop.app/register\" rel=\"nofollow ugc\">an account</a>. It&#8217;s FREE.<br />\n3. Select a plan &#8211; <a href=\"https://getbizprint.com/pricing/\" rel=\"nofollow ugc\">Get started with free prints.</a><br />\n4. Follow the <a href=\"https://getbizprint.com/quick-start-guide/\" rel=\"nofollow ugc\">Quick Start Guide.</a> You’ll be printing in 5 minutes.</p>\n<p>We’re ecstatic that Tiffany is having so much success using BizPrint:</p>\n<blockquote>\n<p>“I can create a customizable receipt for the customer that’s easy to read.</p>\n<p>If you need to use WooCommerce in-person, want to save money by emailing your receipts, or just need great looking receipts (I receive compliments about our receipts), I’d highly recommend BizPrint. The team and software are excellent, and easy to work with.” &#8211; Tiffany W. Owner, Swatty Creek Mill.</p>\n</blockquote>\n<h3>BizPrint WooCommerce Mapping:</h3>\n<ul>\n<li>Product &amp; Category Mapping: Using the <a href=\"https://getbizprint.com/features/mapping/\" rel=\"nofollow ugc\">Product &amp; Category Mapping feature</a> you can setup specific printers to only display printed items from chosen WooCommerce products &amp; categories. Setup multiple printer stations, and create efficient workflows to optimize fulfillment within your business.</li>\n<li>Shipping Zones &amp; Methods Mapping: Using the <a href=\"http://getbizprint.com/features/mapping/#shipping\" rel=\"nofollow ugc\">Shipping Zones &amp; Methods Mapping</a> you can setup printers to only print orders from defined shipping zones and methods. This can really help businesses that have multiple locations, fulfillment stations or other creative uses, like food trucks!</li>\n</ul>\n<p>Our users really enjoy this feature. This is what the owner of Mighty Moose Marts, a retail &amp; online store had to say about printer stations:</p>\n<blockquote>\n<p>“One of the strengths to us was the ability to support multiple printers in different locations.</p>\n<p>We’re using BizPrint to automatically print customer receipts at our ordering station and simultaneously print in the kitchen to fulfill the order. The impact is improved kitchen times, increased sales, and happier customers. I’d highly recommend BizPrint to other small businesses for in-store Point of Sale orders or orders placed online by your customers.” &#8211; Chris R. Co-Owner, Mighty Moose Marts.</p>\n</blockquote>\n<h3>BizPrint Hardware:</h3>\n<p>BizPrint was designed to work with any printer that can be connected to a Windows, Mac or Linux computer! This means you can use your current thermal or Inkjet Printers with support for all major brands like HP, Dymo, Cannon, Star, Epson, Brother and more. Supported connection types include Local, Network, USB, Serial, Wifi and Bluetooth Based Printers. If you do not want to use your own computer, learn more about <a href=\"https://getbizprint.com/bizprint-hub-hardware/\" rel=\"nofollow ugc\">BizPrint Hub</a>.</p>\n<h3>BizPrint User Documentation &amp; Support:</h3>\n<p>If you need help with BizPrint, you have multiple options for getting help:<br />\n1. Please ensure you have setup BizPrint properly using the <a href=\"https://getbizprint.com/quick-start-guide/\" rel=\"nofollow ugc\">Quick Start Guide.</a><br />\n2. Refer to the <a href=\"https://getbizprint.com/documentation/\" rel=\"nofollow ugc\">BizPrint documentation</a> for troubleshooting information.<br />\n3. Get in touch with our <a href=\"https://getbizprint.com/support/\" rel=\"nofollow ugc\">support team.</a></p>\n<h3>BizPrint Expert Developer Documentation:</h3>\n<p>Although BizPrint doesn’t require any coding knowledge to use, there are instances where you want to print WooCommerce Orders in a more customized manner. For this, we provide <a href=\"https://getbizprint.com/documentation/developer/\" rel=\"nofollow ugc\">developer documentation</a> which provides you the plugin development structure to add your own custom WooCommerce Order Receipt, Invoice, Packing Slip and other templates.</p>\n<p>You can also find developer resources in the <a href=\"https://getbizprint.com/#developer\" rel=\"nofollow ugc\">BizPrint marketplace</a> including the Sample print template.</p>\n<p>Also provided are WP Actions to Extend Third-party plugin meta data into templates. By default, BizPrint works with all <a href=\"https://www.bizswoop.com/\" rel=\"nofollow ugc\">BizSwoop Plugins</a> and there have been a number of <a href=\"https://getbizprint.com/marketplace/\" rel=\"nofollow ugc\">templates developed</a> for other 3rd party plugins. If the template is not compatible with your 3rd party plugin, you can develop your own template integration, or reach out to the BizPrint team to request compatibility.</p>\n<h3>What features are included in BizPrint?:</h3>\n<ul>\n<li><strong>Instant Printing:</strong> Automatically print WooCommerce orders in a receipt format based on order status anywhere in your restaurant, retail store or fulfillment station instantly.</li>\n<li><strong>Supports All Printer Models:</strong> All printers that can connect to a Mac, PC or Linux and have a supported driver will work. Easy to adjust margins and formatting.</li>\n<li><strong>Custom Branding on Receipts:</strong> Easily customize invoice and order print templates to include your company logo or other company information.</li>\n<li><strong>WooCommerce Compatibility:</strong> Native WooCommerce compatibility means that it works with other plugins. No need for third-party solutions to generate orders/invoices!</li>\n<li><strong>Print to Multiple Printers:</strong> A scalable cloud solution that can print to multiple printers at once. And we support any printer model! If it connects to a Windows, Mac or Linux, it will work.</li>\n<li><strong>Generates PDF Receipts:</strong> With the ability to generate a PDF of the receipt, BizPrint offers an easier and less fragmented solution for your WooCommerce printing needs.</li>\n<li><strong>Simple to Set Up &amp; Easy to Use:</strong> Don’t worry, we make it simple to set up – even for non-technical people! Create a BizSwoop account, configure the BizPrint plugin, and start printing in under 5 minutes.</li>\n<li><strong>Supports 36 Languages:</strong> We speak your language! Plugin and receipt templates support 36 languages, including the ability to select a language for specific printer locations.</li>\n<li><strong>Unlimited Printer Locations:</strong> Set up an unlimited number of printers and print to multiple locations. iOS &amp; Android devices can also send print jobs.</li>\n<li><strong>Supports Thermal Receipt Printers:</strong> Order printing is formatted for both Thermal receipt and Inkjet printers. Supports standard printers Letter/A4 for customer and order receipts.</li>\n<li><strong>Cloud Printing:</strong> Fast and secure printing with BizPrint Cloud infrastructure enables printing to anywhere in the world. The Cloud Printing functionality is compatible with the POS.</li>\n<li><strong>Automatically Print WooCommerce Packing Slips:</strong> Package Fulfillment for retail to ship packages to customers, packing slips and receipts. Shipping from your store is easier than ever.</li>\n<li><strong>Print WooCommerce Orders Straight to the Kitchen:</strong> Restaurant printing orders for customer receipts and fulfillment inside their restaurant. Enjoy a more efficient workflow and higher productivity with orders instantly printed in the kitchen.</li>\n<li><strong>Print On-Demand At Point of Sale:</strong> Point of Sale to print customer receipts transaction (any POS using WooCommerce is compatible). Print professional-looking receipts every time!</li>\n<li><strong>Product Mapping Add-On:</strong> Map specific printers to only print items from defined products and categories. The add-ons allow the admin to select products and categories to print for only specific locations.</li>\n<li><strong>Pickup and Delivery Add-On:</strong> Easily <a href=\"https://www.bizswoop.com/pickup-delivery-scheduler/\" rel=\"nofollow ugc\">add pick-up, take-out, curbside or local delivery</a> functionality to the checkout workflow on your WooCommerce store. We make it simple!</li>\n<li><a href=\"https://getbizprint.com/features/\" rel=\"nofollow ugc\">View All</a></li>\n</ul>\n<h3>Learn More About Specific Print Topics On Our Blog:</h3>\n<ul>\n<li><a href=\"https://getbizprint.com/woocommerce-print-receipt/\" rel=\"nofollow ugc\">How To Print Order Receipts in WooCommerce</a></li>\n<li><a href=\"https://getbizprint.com/woocommerce-packing-slip-print/\" rel=\"nofollow ugc\">How To Automatically Print Packing Slips from WooCommerce</a></li>\n<li><a href=\"https://getbizprint.com/woocommerce-thermal-printer/\" rel=\"nofollow ugc\">Print Receipts on Thermal Printer with WooCommerce￼</a></li>\n<li><a href=\"https://getbizprint.com/woocommerce-print-order-list/\" rel=\"nofollow ugc\">How to Print an Order List in WooCommerce (Automatically)</a></li>\n<li><a href=\"https://getbizprint.com/how-to-generate-invoice-in-woocommerce/\" rel=\"nofollow ugc\">Generate a Simple Invoice in WooCommerce (For Email and Print)</a></li>\n</ul>\n<h3>What Else?</h3>\n<ul>\n<li>BizPrint is developed by BizSwoop based in the United States. If you like BizPrint for Order &amp; Receipt, consider checking out the other projects from <a href=\"https://www.bizswoop.com/\" rel=\"nofollow ugc\">BizSwoop:</a></li>\n<li><a href=\"https://jovvie.com/\" rel=\"nofollow ugc\">Jovvie Point of Sale for WooCommerce</a> &#8211; A fast, complete Point of Sale system built for WooCommerce stores of all sizes. Restaurants, retailers and sales teams around the globe love using Jovvie POS. Load the POS on any device and sell anywhere!</li>\n<li><a href=\"https://flownotify.com/\" rel=\"nofollow ugc\">Flow Notify</a> &#8211; The Best SMS, WhatsApp &amp; Email Notification Plugin for your store. Create order statuses and send order alert info to customers through automated SMS, WhatsApp, and Emails in WordPress and WooCommerce.</li>\n<li><a href=\"https://www.bizswoop.com/product-manager/\" rel=\"nofollow ugc\">Product Manager Add-ons</a> &#8211; The #1 Product Manager Add-ons plugin for WooCommerce! Create easy product up-sells, checkout add-ons, product tables, samples, bundles and more. Your store is going to get a major boost, you won’t find a better Product Manager plugin for WooCommerce with more to offer.</li>\n<li><a href=\"https://www.bizswoop.com/store-order-hours\" rel=\"nofollow ugc\">Store Order Hours</a> &#8211; Create your online open sign with a store hours scheduler. Automatically toggle WooCommerce customer checkout functionality on/off on a schedule. Create visual notification settings, Add floating hours widget, custom branding, and more. </li>\n<li><a href=\"https://www.bizswoop.com/pickup-delivery-scheduler/\" rel=\"nofollow ugc\">Pickup Delivery Scheduler</a> &#8211; Easily add pick-up, take-out, curbside and local delivery functionality to your WooCommerce store. Smart logic features allow for easy implementation of calendar ordering scheduling, defined pre-order days, minimum wait times, delivery cut-off times and order volume time slot management for your business.</li>\n<li><a href=\"https://www.bizswoop.com/store-plus/\" rel=\"nofollow ugc\">Store Plus B2B Wholesale for WooCommerce</a> &#8211; Wholesale, B2B and Enterprise business account functionality for customer level pricing, customer business profiles &amp; more. The software automatically uses your defined pricing rules to calculate and display the product price on simple, variable and variation prices dynamically in real-time on customer accounts.</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.5.15.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/print-google-cloud-print-gcp-woocommerce/assets/screenshot-1.png?rev=2777934",
            "caption": "<p>General Settings Tab for Print Template &amp; Automatic Printing</p>"
        },
        {
            "src": "https://ps.w.org/print-google-cloud-print-gcp-woocommerce/assets/screenshot-2.png?rev=2777934",
            "caption": "<p>BizPrint Cloud Management Dashboard</p>"
        },
        {
            "src": "https://ps.w.org/print-google-cloud-print-gcp-woocommerce/assets/screenshot-3.png?rev=2777934",
            "caption": "<p>Sample of HTML Receipt/Invoice Template</p>"
        },
        {
            "src": "https://ps.w.org/print-google-cloud-print-gcp-woocommerce/assets/screenshot-4.png?rev=2777934",
            "caption": "<p>Sample of Plain Text Receipt/Invoice Template</p>"
        },
        {
            "src": "https://ps.w.org/print-google-cloud-print-gcp-woocommerce/assets/screenshot-5.png?rev=2777936",
            "caption": "<p>Add a Printer, Configure Settings and Select Printer</p>"
        },
        {
            "src": "https://ps.w.org/print-google-cloud-print-gcp-woocommerce/assets/screenshot-6.png?rev=2777934",
            "caption": "<p>Printers Tab Showing List of All Configured Printers with BizPrint Cloud</p>"
        }
    ],
    "tags": {
        "automatic-print": "automatic print",
        "pdf": "pdf",
        "print": "print",
        "shipping-labels": "shipping labels",
        "woocommerce-print": "woocommerce print"
    },
    "stable_tag": "4.5.15",
    "versions": {
        "1.0.13": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.1.0.13.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.2.0.5.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.2.1.2.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.1.zip",
        "3.0.11": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.11.zip",
        "3.0.12": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.12.zip",
        "3.0.13": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.13.zip",
        "3.0.14": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.14.zip",
        "3.0.15": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.15.zip",
        "3.0.17": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.17.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.4.zip",
        "3.0.5": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.5.zip",
        "3.0.6": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.6.zip",
        "3.0.7": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.7.zip",
        "3.0.8": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.8.zip",
        "3.0.9": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.3.0.9.zip",
        "4.0.1": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.0.1.zip",
        "4.0.10": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.0.10.zip",
        "4.0.12": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.0.12.zip",
        "4.0.17": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.0.17.zip",
        "4.0.18": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.0.18.zip",
        "4.0.19": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.0.19.zip",
        "4.0.20": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.0.20.zip",
        "4.0.21": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.0.21.zip",
        "4.0.6": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.0.6.zip",
        "4.1.10": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.1.10.zip",
        "4.1.2": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.1.2.zip",
        "4.1.20": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.1.20.zip",
        "4.1.7": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.1.7.zip",
        "4.3.12": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.12.zip",
        "4.3.15": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.15.zip",
        "4.3.16": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.16.zip",
        "4.3.17": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.17.zip",
        "4.3.18": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.18.zip",
        "4.3.19": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.19.zip",
        "4.3.21": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.21.zip",
        "4.3.22": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.22.zip",
        "4.3.26": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.26.zip",
        "4.3.29": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.29.zip",
        "4.3.31": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.31.zip",
        "4.3.32": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.32.zip",
        "4.3.35": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.35.zip",
        "4.3.36": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.36.zip",
        "4.3.37": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.37.zip",
        "4.3.38": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.38.zip",
        "4.3.39": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.39.zip",
        "4.3.9": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.3.9.zip",
        "4.5.11": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.5.11.zip",
        "4.5.12": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.5.12.zip",
        "4.5.13": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.5.13.zip",
        "4.5.14": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.5.14.zip",
        "4.5.15": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.5.15.zip",
        "4.5.4": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.5.4.zip",
        "4.5.6": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.5.6.zip",
        "4.5.8": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.4.5.8.zip",
        "trunk": "https://downloads.wordpress.org/plugin/print-google-cloud-print-gcp-woocommerce.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/print-google-cloud-print-gcp-woocommerce/assets/banner-772x250.png?rev=3095310",
        "high": "https://ps.w.org/print-google-cloud-print-gcp-woocommerce/assets/banner-1544x500.png?rev=3095310"
    },
    "icons": {
        "1x": "https://ps.w.org/print-google-cloud-print-gcp-woocommerce/assets/icon-128x128.png?rev=3095244",
        "2x": "https://ps.w.org/print-google-cloud-print-gcp-woocommerce/assets/icon-256x256.png?rev=3095244"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 94,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}