{
    "name": "Real Estate Manager &#8211; Property Listing and Agent Management",
    "slug": "real-estate-manager",
    "version": "7.3",
    "author": "<a href=\"https://webcodingplace.com/\">WebCodingPlace</a>",
    "author_profile": "https://profiles.wordpress.org/rameez_iqbal/",
    "contributors": {
        "rameez_iqbal": {
            "profile": "https://profiles.wordpress.org/rameez_iqbal/",
            "avatar": "https://secure.gravatar.com/avatar/b32e62ad1eb58856ce70614e2ac72a56?s=96&d=monsterid&r=g",
            "display_name": "Rameez Iqbal"
        }
    },
    "requires": "3.5",
    "tested": "6.5.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 36,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 37,
    "support_url": "https://wordpress.org/support/plugin/real-estate-manager/",
    "support_threads": 3,
    "support_threads_resolved": 0,
    "active_installs": 600,
    "downloaded": 34571,
    "last_updated": "2024-05-29 5:53pm GMT",
    "added": "2017-03-05",
    "homepage": "https://wp-rem.com",
    "sections": {
        "description": "<p>Real Estate Manager is a comprehensive WordPress plugin designed to create feature-rich real estate websites and portals. With its responsive design and clean property templates, Real Estate Manager offers a seamless integration of advanced features to enhance your real estate listings.</p>\n<ul>\n<li><a href=\"https://wp-rem.com\" rel=\"nofollow ugc\">Live Demos</a></li>\n<li><a href=\"https://wp-rem.com/online-documentation/\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://wp-rem.com/online-documentation/category/shortcodes/\" rel=\"nofollow ugc\">Shortcodes</a></li>\n<li><a href=\"https://wpml.org/plugin/real-estate-manager-pro/\" rel=\"nofollow ugc\">WPML Recommendation</a></li>\n<li><a href=\"https://webcodingplace.com/contact-us/\" rel=\"nofollow ugc\">Feature Request / Help</a></li>\n</ul>\n<h3>Key Features:</h3>\n<ul>\n<li><strong>Property Types:</strong> Categorize properties based on their types for easy navigation.</li>\n<li><strong>Property Video:</strong> Showcase properties with engaging video content.</li>\n<li><strong>Gallery Images:</strong> Display property images in an interactive slider, thumbnail slider or justified grid (like Google Images).</li>\n<li><strong>Advanced AJAX Search:</strong> Enhance user experience with a fast and dynamic search functionality including advanced queries.</li>\n<li><strong>Google Maps and Leaflet Maps:</strong> Integrate Google Maps or Leaflet Maps to display property locations with markers and clusters.</li>\n<li><strong>Grid Listings:</strong> Display properties in a grid layout for a visually appealing presentation in more than 5 different styles.</li>\n<li><strong>Frontend Management:</strong> Allow users to submit properties directly from the frontend and manage them.</li>\n<li><strong>Agent Management System:</strong> Ability to create custom data fields for agents and option to display them on their profile as well.</li>\n<li><strong>Responsive Properties Grid and Carousels:</strong> Ensure your property listings look great on all devices.</li>\n</ul>\n<h3>Additional Features:</h3>\n<ul>\n<li><strong>WooCommerce Compatibility:</strong> Manage paid subscriptions using the Woo Estato Addon.</li>\n<li><strong>Nearby Properties:</strong> Automatically display properties close to the visitor&#8217;s location.</li>\n<li><strong>Filter Properties:</strong> Let visitors filter properties based on property types directly from the map.</li>\n<li><strong>Unlimited Features:</strong> Add unlimited property features and options.</li>\n<li><strong>Property Carousels:</strong> Integrated touch enabled carousel sliders for property listings.</li>\n<li><strong>Unlimited Features:</strong> Add unlimited property features and options.</li>\n<li><strong>Property Gallery:</strong> Lets you to add unlimited gallery photos for each property, that will display on single property page in touch friendly slider.</li>\n<li><strong>Property CPT:</strong> Custom Post Type is used for managing properties with responsive frontend template. You can also customize property slug and template files by including them in your theme.</li>\n<li><strong>WPML:</strong> Its compatible with WPML to let you create multi language real estate site.</li>\n<li><strong>WPBakery Page Builder:</strong> 15+ Visual Composer elements are added to easily insert and manage shortcodes.</li>\n<li><strong>Divi Modules:</strong> 15+ Divi Modules are available to easily use components in the pages.</li>\n<li><strong>Divi Builder:</strong> Create custom listing design using Divi Builder.</li>\n<li><strong>Elementor:</strong> Create Custom listing design using Elementor Theme Builder.</li>\n<li><strong>Optimized Code:</strong> Based on WP Codex Standards, only relevant scripts and styles loads to give you fast experience and avoiding conflicts.</li>\n<li><strong>Email Alerts:</strong> Email alerts for property inquiry and on agent registration with customize email messages.</li>\n<li><strong>Drag Drop Fields:</strong> Create custom property fields using drag drop fields builder.</li>\n<li><strong>Price Range Slider:</strong> Let the users to choose range of their budget while searching properties using price range slider.</li>\n<li><strong>Fast AJAX Search:</strong> AJAX based fast search for listings with advanced search queries.</li>\n<li><strong>Agent Profile:</strong> Agent profile management with their social links and other settings that can be managed from profile settings.</li>\n<li><strong>Widgets Included:</strong> Search Widget, Tags Cloud and Mortgage Calculator Widgets are available to add to the widget areas.</li>\n<li><strong>Frontend Property Submission:</strong> Create properties from frontend without even going to WordPress dashboard by using just one shortcode.</li>\n<li><strong>Frontend Agent Registration:</strong> Register agents using builtin register form with the ability to be approved by site administrator.</li>\n<li><strong>Agent Login:</strong> AJAX based login with captcha verification and custom redirection after successful login.</li>\n<li><strong>My Properties:</strong> Display a list of current logged in agent&#8217;s properties with actions to delete or edit them using just a single shortcode.</li>\n<li><strong>Frontend Profile Editing:</strong> Let the registered agents to edit their profile from frontend.</li>\n<li><strong>Developers Friendly:</strong> Real Estate Manager is based on actions and filter to let the developers easily modify or add new functionalities.</li>\n<li><strong>Property Video:</strong> Separate section to display video of internal structure of properties with responsive video player.</li>\n<li><strong>File Attachments:</strong> Easily attach all type of files with properties like floor plans, wire frames or documents.</li>\n<li><strong>Translation Ready:</strong> You can easily change the English strings into your own language using any translation plugin, like Loco Translate. More than 15 languages are already translated in this plugin and POT file is also included to add your own language.</li>\n<li><strong>Custom Map Icons:</strong> You can replace default map icons with your own images easily from settings by uploading them.</li>\n<li><strong>Customize Colors:</strong> You can customize the color scheme based on your theme, you can choose colors from settings for each element individually.</li>\n<li><strong>Custom Currency and Area Unit:</strong> Easily change currency by just selecting your country.</li>\n<li><strong>Custom Labels:</strong> You can change all labels and headings into your own text easily.</li>\n<li><strong>Map Types:</strong> You can choose map style from four styles. Road Map, Earth, Hybrid or Tarrain.</li>\n<li><strong>Map Zoom Level:</strong> Customize map zoom level and default latitude and longitude easily.</li>\n<li><strong>Disable Scripts:</strong> You can disable bootstrap and font awesome css to load from plugin if your theme is already loading them.</li>\n</ul>\n<h3>Addons</h3>\n<ul>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-xml-csv-importer/\" rel=\"nofollow ugc\">REM &#8211; XML, CSV Importer:</a></strong><br />\n      Import or sync listings from files (XML, CSV) or external APIs.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-conditional-fields/\" rel=\"nofollow ugc\">REM &#8211; Conditional Fields:</a></strong><br />\n      Dependable listing fields on search forms and creation/updation.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-conditional-fields/\" rel=\"nofollow ugc\">REM &#8211; Currency Switcher:</a></strong><br />\n      Live currency converion for prices of listings.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-saved-searches-and-notify/\" rel=\"nofollow ugc\">REM &#8211; Saved Searches and Notify:</a></strong><br />\n      Save the search criteria and notify when a matching listing is available.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-wish-list/\" rel=\"nofollow ugc\">REM &#8211; Wishlist</a></strong><br />\n      Add listing to favourites and bulk contact their agents.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-export-and-import/\" rel=\"nofollow ugc\">REM &#8211; Export Import</a></strong><br />\n      Export and Import the plugin settings.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-property-listing-styles/\" rel=\"nofollow ugc\">REM &#8211; Property Listing Styles</a></strong><br />\n      Additional listing styles for property archives.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-social-share/\" rel=\"nofollow ugc\">REM &#8211; Social Share</a></strong><br />\n      Social Share buttons for listings and print PDFs.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-google-map-filters/\" rel=\"nofollow ugc\">REM &#8211; Google Map Filters</a></strong><br />\n      Search and filter listings directly on the map.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-filterable-grid/\" rel=\"nofollow ugc\">REM &#8211; Filterable Properties Grid</a></strong><br />\n      Display listings in a filterable justified grid.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-woo-estato/\" rel=\"nofollow ugc\">REM &#8211; Woo Estato</a></strong><br />\n      Paid subscriptions for listing submissions.\n   </li>\n</ul>\n<h3>Translations</h3>\n<ul>\n<li>English</li>\n<li>German</li>\n<li>Spanish</li>\n<li>Russian</li>\n<li>Arabic</li>\n<li>Czech</li>\n<li>Danish</li>\n<li>Greek</li>\n<li>Persian</li>\n<li>Portuguese</li>\n<li>Greek</li>\n<li>Serbian</li>\n<li>Chinese</li>\n<li>Norway</li>\n<li>Israel</li>\n<li>Please contact support@webcodingplace.com to request your language.</li>\n</ul>\n",
        "installation": "<ol>\n<li>Go to plugins in your dashboard and select &#8216;add new&#8217;</li>\n<li>Search for &#8216;Real Estate Manager&#8217; and install it</li>\n<li>Go to Dashboard &gt; Real Estate Manager -&gt; Add New Property</li>\n<li>Go to Dashboard &gt; Real Estate Manager -&gt; Settings</li>\n</ol>\n",
        "changelog": "<h4>7.3 &#8211; May, 30 2024</h4>\n<ul>\n<li>Bug Fixed: Map Box price is not appearing</li>\n<li>Bug Fixed: Map CSS is displaying above the shortcode</li>\n</ul>\n<h4>7.2 &#8211; April, 4 2024</h4>\n<ul>\n<li>Bug Fixed: WP Sanitizations and Escape</li>\n</ul>\n<h4>6.7.1 &#8211; April, 7 2019</h4>\n<ul>\n<li>Bug Fixed: Property contents breaking when saving from frontend</li>\n</ul>\n<h4>6.7 &#8211; April, 6 2019</h4>\n<ul>\n<li>Feature Added: scroll_results attribute for [rem_search_property] to disable auto scroll</li>\n<li>Feature Added: A new filter added for price formatting rem_display_property_price</li>\n<li>Feature Added: A new filter added for email headers rem_email_headers</li>\n<li>Bug Fixed: Map box not displaying data when nearest properties enabled</li>\n<li>Bug Fixed: Post status issue when approved by admin is selected</li>\n</ul>\n<h4>6.6 &#8211; March, 28 2019</h4>\n<ul>\n<li>1 New Addon: Custom Colors is released</li>\n<li>Feature Added: Divi Modules Added</li>\n<li>Feature Added: WPBakery Page Buider Addons updated</li>\n<li>Feature Added: Override shortcode templates from theme (putting them in theme&#8217;s root inside rem directory)</li>\n<li>Feature Added: Total number of Agents in rem_list_agents</li>\n<li>Feature Added: Option for agents to search their properties on my properties page</li>\n<li>Feature Added: Agents can change the property status from frontend (Publish or Draft)</li>\n<li>Feature Added: GDPR checkbox added in the contact form with custom text</li>\n<li>Feature Added: POT is updated and language files including in the plugin are also updated</li>\n<li>Bug Fixed: Max container width not applying is fixed</li>\n<li>Bug Fixed: Login redirect 404 issue</li>\n<li>Bug Fixed: Delete media button not appearing for agents</li>\n<li>Many other fixes and enhancements.</li>\n</ul>\n<h4>6.5 &#8211; February, 18 2019</h4>\n<ul>\n<li>2 New Addons: Woo Estato and Conditional Fields are released</li>\n<li>Feature Added: Compatible with Conditional fields and Woo Estato</li>\n<li>Feature Added: First image will be featured image when editing/creating properties from frontend</li>\n<li>Bug Fixed: Font Awesome icons not working for some themes</li>\n<li>Bug Fixed: Edit Agent profile not updating from frontend</li>\n<li>Bug Fixed: Edit property page bug fixed L.Control.geocoder is not a function</li>\n<li>Bug Fixed: Agent contact form not working</li>\n</ul>\n<h4>6.4 &#8211; January, 29 2019</h4>\n<ul>\n<li>Feature Added: 2 Ribbon styles to choose from settings</li>\n<li>Feature Added: Geolocation service for the map to automatically get a location from address, on the large map</li>\n<li>Feature Added: Single Property Page ribbons added</li>\n<li>Feature Added: Help text added in create property form from frontend</li>\n<li>Feature Added: Admin can manage properties from frontend using shortcode [rem_manage_properties]</li>\n<li>Feature Added: Disable map on single property page</li>\n<li>Feature Added: Blocks added for Gutenberg (Login, Register and Simple Search) more are coming&#8230;</li>\n<li>Feature Added: Email address also added in Email Format options (Agent Contact Form)</li>\n<li>Feature Added: While searching, leaving min or max price fields blank will take minimum and maximum respectively</li>\n<li>Feature Added: Fields that have area word in data name will display area unit with value automatically</li>\n<li>Feature Added: Fields that have price word in data name will display price unit with value automatically</li>\n<li>Feature Added: Hooks added in create and edit property forms for checkbox validations</li>\n<li>Feature Added: Property thumbnails are now clickable</li>\n<li>Feature Added: Auto Approve agents is added, go to Settings -&gt; Advanced Settings to configure</li>\n<li>Feature Added: Display agents random by using orderby=&#8221;rand&#8221; in the shortcode</li>\n<li>Feature Added: Property ID is added on singly property page, you can also disable it from settings</li>\n<li>Feature Added: All dropdown fields have first value empty to disable them</li>\n<li>Feature Added: Date field format option is added under Single Property Page settings</li>\n<li>Feature Added: Image Optimization, Now you can choose which sizes of images to use when displaying listings</li>\n<li>Feature Added: Display properties based on Features attached, using shortcode attribute features. Eg: features=&#8221;attic,balcony&#8221;</li>\n<li>Bug Fixed: Polylang not working for Custom Features</li>\n<li>Bug Fixed: Search form advanced features not displaying correctly</li>\n<li>Bug Fixed: Google Map fa icons not displaying</li>\n<li>Bug Fixed: Map not working on single property using shortcode [rem_property]</li>\n<li>Bug Fixed: My properties page, properties are not editing/deleting</li>\n<li>Bug Fixed: Deny agent email is not working</li>\n<li>Bug Fixed: Property ID in email, fixed</li>\n<li>Bug Fixed: $valid_tabs is not defined</li>\n<li>Bug Fixed: Create property page, several bugs fixed for IE8 to IE 11</li>\n</ul>\n<h4>6.3 &#8211; December, 4 2018</h4>\n<ul>\n<li>Feature Added: Wishlist addon released</li>\n<li>Feature Added: Agent Contact Custom settings for email markup and subject</li>\n<li>Bug Fixed: Agents unable to upload images</li>\n<li>Bug Fixed: Google Map fa icons not displaying</li>\n<li>Bug Fixed: Settings tabs not working for other languages</li>\n<li>Bug Fixed: Pagination conflict with some themes</li>\n<li>Bug Fixed: Some icons enhanced</li>\n</ul>\n<h4>6.2.2 &#8211; October, 22 2018</h4>\n<ul>\n<li>Feature Added: Compatible and tested with WordPress 5.0-alpha-43776</li>\n<li>Feature Added: Support added for Polylang</li>\n<li>Feature Added: I18n Ribbons</li>\n<li>Feature Added: Hide passwords in admin as per GDPR </li>\n<li>Feature Added: Extensions reference added</li>\n<li>Feature Added: Not Available properties will not display publicly</li>\n<li>Bug Fixed: Create property frontend image upload error with jQuery latest version</li>\n<li>Bug Fixed: WPML translation issues for property features</li>\n<li>Bug Fixed: Tabs with empty fields will not display on frontend</li>\n<li>Many other small fixes and enhancements</li>\n</ul>\n<h4>6.2.1 &#8211; September, 25 2018</h4>\n<ul>\n<li>Bug Fixed: Emails are not working</li>\n</ul>\n<h4>6.2 &#8211; August, 16 2018</h4>\n<ul>\n<li>Bug Fixed: Property Submit for Review Issue</li>\n<li>Bug Fixed: Images not displaying properly on listings</li>\n<li>Bug Fixed: Screen options not working on property admin page</li>\n<li>Bug Fixed: Settings tabs not opening for some languages</li>\n<li>Bug Fixed: Top Bar not saving in WP Bakery Page Builder</li>\n<li>Bug Fixed: XSS Security issues resolved</li>\n</ul>\n<h4>6.1 &#8211; July, 11 2018</h4>\n<ul>\n<li>Bug Fixed: Disabled porperty types areas</li>\n</ul>\n<h4>6.0 &#8211; July, 8 2018</h4>\n<ul>\n<li>Feature Added: Leaflet with OpenStreetMap Integrated (as Google Maps is no longer free)</li>\n<li>Feature Added: Font Awesome 5 Integration</li>\n<li>Feature Added: Agents Listing</li>\n<li>Feature Added: Ribbon options for sold, sale, rented properties</li>\n<li>Feature Added: List properties with multiple metas</li>\n<li>Feature Added: Featured Properties</li>\n<li>Feature Added: Listing Style 7 Added</li>\n<li>Feature Added: Disable option for widgets</li>\n<li>Feature Added: Masonry option for property listings</li>\n<li>Feature Added: Disable contact form on agent pages</li>\n<li>Feature Added: Display agent specific listings</li>\n<li>Feature Added: Filter options in property listings in admin</li>\n<li>Feature Added: Search by Property ID</li>\n<li>Feature Added: WP Bakery Page Builder 5.4.5 Support Added</li>\n<li>Feature Added: Agent Card Style 2 Added</li>\n<li>Feature Added: Custom Title for Property Archive</li>\n<li>Feature Added: Min and Max Fields for Property Price when Searching</li>\n<li>Feature Added: Responsive reCaptcha</li>\n<li>Feature Added: Date field added in Custom Fields</li>\n<li>Feature Added: Property Tags Widget Added</li>\n<li>Feature Added: Simple Search Form (shortcode [rem_simple_search])</li>\n<li>Feature Added: Top Bar for listings to sort and change layouts</li>\n<li>Feature Added: Logout button shortcode [rem_agent_logout]</li>\n<li>Feature Added: Custom data to filter properties on map</li>\n<li>Feature Added: Create your own map styling using Google Map API</li>\n<li>Feature Added: Snazzy Maps support</li>\n<li>Feature Added: Upload Agent picture from frontend</li>\n<li>Feature Added: Display current logged in agent&#8217;s profile using shortcode [rem_my_profile]</li>\n<li>Feature Added: Gallery Slider controls including width/height and image fit</li>\n<li>Feature Added: Search Properties by agents (dropdown of agent names in search form)</li>\n<li>Feature Added: Upload Attachments from frontend when creating properties</li>\n<li>Feature Added: Display logged in agent&#8217;s properties in property listing, carousel and map</li>\n<li>Feature Added: Sort Searched properties by price, name, date etc</li>\n<li>Feature Added: Change filter dropdown columns in AJAX search form</li>\n<li>Feature Added: Use custom data on property listing boxes</li>\n<li>Languages Added: Bulgarian</li>\n<li>Languages Added: Spanish (Maxico)</li>\n<li>Languages Added: Polish</li>\n<li>Bug Fixed: Custom dropdown when creating new property not appearing</li>\n<li>Bug Fixed: Gallery slider support with mobile devices</li>\n<li>Bug Fixed: Single property page no margins on mobile</li>\n<li>Bug Fixed: Last Gallery image not deleting</li>\n<li>Bug Fixed: Property delete and edit icons not appearing</li>\n<li>Bug Fixed: Agent can&#8217;t upload media from frontend</li>\n<li>Bug Fixed: Agent Picture cut off for some screen sizes</li>\n<li>Bug Fixed: Single Property Page Map not working with only address</li>\n<li>Many other small fixes and enhancements</li>\n</ul>\n<h4>5.3 &#8211; February, 22 2018</h4>\n<ul>\n<li>Bug Fixed: Pagination not working on homepage</li>\n<li>Bug Fixed: Property features not saving when all disable</li>\n</ul>\n<h4>5.2 &#8211; January, 29 2018</h4>\n<ul>\n<li>Feature Added: Danish and Portuguese Brazil Languages Added</li>\n<li>Bug Fixed: Search not working property according to price range selected</li>\n</ul>\n<h4>5.1 &#8211; January, 18 2018</h4>\n<ul>\n<li>Bug Fixed: Fixed some memory consumption issues from previous release</li>\n</ul>\n<h4>5.0 &#8211; January, 10 2018</h4>\n<ul>\n<li>Feature Added: New Enhanced UI</li>\n<li>Feature Added: Human made translations added</li>\n<li>Feature Added: Sale Price for Properties</li>\n<li>Feature Added: Clear button in search fields</li>\n<li>Feature Added: Open search results in separate page</li>\n<li>Feature Added: Inline Property Style is responsive</li>\n<li>Feature Added: Display counter stats on agent page</li>\n<li>Feature Added: Custom hooks for agent pages</li>\n<li>Feature Added: Frontend property editing.</li>\n<li>Feature Added: A new property style 6 is added.</li>\n<li>Feature Added: Convert area field into dropdown of area ranges.</li>\n<li>Feature Added: Convert bedroom and bathroom fields into dropdown of ranges Eg: 2+ or 2-6.</li>\n<li>Feature Added: Logout button added on edit profile page</li>\n<li>Feature Added: Display number of bathroom on property listings with icon</li>\n<li>Feature Added: Area unit is added wherever the area is displayed</li>\n<li>Feature Added: Currency symbol is added wherever the price is displayed</li>\n<li>Feature Added: Settings UI is enhanced for better navigation</li>\n<li>Feature Added: Filter properties by Property Type on Map</li>\n<li>Feature Added: Display single property using shortcode [rem_property id=&#8221;PROPERTY_ID&#8221;]</li>\n<li>Feature Added: Filter properties in property listing shortcode by providing meta</li>\n<li>Feature Added: Disable Scripts option for fontawesome and bootstrap</li>\n<li>Bug Fixed: Sidebar conflicting on mobile devices</li>\n<li>Bug Fixed: Currency format not working with price slider is fixed</li>\n<li>Bug Fixed: Search widget auto selects random value is fixed</li>\n<li>Bug Fixed: Admin agents page displaying 0 property count</li>\n<li>Bug Fixed: Property content is not updating from frontend</li>\n<li>Bug Fixed: Error on activation add_cap</li>\n<li>Bug Fixed: Search Results from widget, pagination breaks on next pages.</li>\n<li>Bug Fixed: Conflict with some theme&#8217;s menus is fixed.</li>\n<li>and many more enhancements and fixes.</li>\n</ul>\n<h4>4.5 &#8211; December, 9 2017</h4>\n<ul>\n<li>Feature Added: Property Listing Style is responsive</li>\n<li>Feature Added: POT file is updated</li>\n</ul>\n<h4>4.4.9 &#8211; November, 11 2017</h4>\n<ul>\n<li>Feature Added: Search properties by area using a range. Example write 2300-5600 in Area field to search properties between this range of area.</li>\n<li>Feature Added: Search properties by bedrooms using a range. Example write 2-5 in Bedrooms field to search properties that has 2 to 5 bedrooms.</li>\n<li>Feature Added: Search properties by bathrooms using a range. Example write 2-5 in Bathrooms field to search properties that has 2 to 5 bathrooms.</li>\n</ul>\n<h4>4.4.8 &#8211; November, 7 2017</h4>\n<ul>\n<li>Important if you&#8217;re updating: Please remove those status, types and features etc from their perspective fields which you don&#8217;t want to display.</li>\n<li>Feature Added: Easily remove existing types, purpose and status by just adding new ones</li>\n<li>Feature Added: Improved Documentation</li>\n<li>Bug Fixed: Price slider not working with pagination</li>\n</ul>\n<h4>4.4.7 &#8211; October, 1 2017</h4>\n<ul>\n<li>Feature Added: Disable Info icon and provide custom url</li>\n<li>Feature Added: Custom Excerpt length option for property listing added</li>\n<li>Feature Added: Documentation Enhanced</li>\n<li>Bug Fixed: Search property not working when searching through widget, without Search Field</li>\n<li>Bug Fixed: Icons not loading on search AJAX page</li>\n<li>Pro Version Link Added</li>\n</ul>\n<h4>4.4.6 &#8211; September, 15 2017</h4>\n<ul>\n<li>Feature Added: Agent Contact Email Additional Email Addresses in Settings</li>\n<li>Feature Added: Phone Number option in Agent Contact</li>\n<li>Feature Added: Specific Search, Example [rem_search_property fixed_fields=&#8221;status|normal,type|villa&#8221;]</li>\n</ul>\n<h4>4.4.5 &#8211; September, 7 2017</h4>\n<ul>\n<li>Feature Added: Custom area unit</li>\n<li>Feature Added: Default map location when creating property</li>\n<li>Feature Added: Property IDs are now showing with properties list</li>\n<li>Feature Added: Disable search text field in widget</li>\n</ul>\n<h4>4.4.4 &#8211; August, 27 2017</h4>\n<ul>\n<li>Bug Fixed: Maps display only 10 properties</li>\n</ul>\n<h4>4.4.3 &#8211; August, 17 2017</h4>\n<ul>\n<li>Feature Added: Search settings box added in settings</li>\n<li>Feature Added: Custom layouts for search results</li>\n<li>Bug Fixed: Maps not appear when creating property from frontend when SSL enabled</li>\n</ul>\n<h4>4.4.2 &#8211; July, 28 2017</h4>\n<ul>\n<li>Feature Added: Support for SSL enabled sites is added</li>\n</ul>\n<h4>4.4.1 &#8211; July, 4 2017</h4>\n<ul>\n<li>Feature Added: Pagination Disable option added for property listing ([rem_list_properties pagination=&#8221;disable&#8221; posts=&#8221;6&#8243; class=&#8221;col-sm-4&#8243;])</li>\n<li>Bug Fixed: Properties count effecting listings in admin is fixed</li>\n<li>Bug Fixed: Property author is unable to change is fixed now</li>\n</ul>\n<h4>4.4 &#8211; May, 11 2017</h4>\n<ul>\n<li>Feature Added: Rooms field added</li>\n<li>Feature Added: Custom post count on archive pages</li>\n<li>Feature Added: Pagination added for archive pages</li>\n<li>Feature Added: Select2 added for better choosing options in admin</li>\n<li>Bug Fixed: Search Form fields alignment issues</li>\n</ul>\n<h4>4.3 &#8211; May, 2 2017</h4>\n<ul>\n<li>Feature Added: Add custom text after price</li>\n<li>Feature Added: Custom Zoom level for maps</li>\n<li>Feature Added: Custom Map Types</li>\n<li>Feature Added: Properties count for search results</li>\n</ul>\n<h4>4.2 &#8211; April, 28 2017</h4>\n<ul>\n<li>Feature Added: Add custom text after price</li>\n<li>Bug Fixed: [rem_my_properties] Edit and Delete buttons are not displaying</li>\n</ul>\n<h4>4.1 &#8211; April, 25 2017</h4>\n<ul>\n<li>Feature Added: Currency formatting options, and Price display options added</li>\n<li>Feature Added: Latest translation file added (wcp-rem.po)</li>\n</ul>\n<h4>4.0 &#8211; April, 23 2017</h4>\n<ul>\n<li>Feature Added: Now you can search the place on map while creating new property from frontend</li>\n<li>Feature Added: Admins can also setup their profile like agents</li>\n<li>Feature Added: Agents can delete or edit their properties from shortcode [rem_my_properties]</li>\n<li>Bug Fixed: Labels break when Search Widget is active</li>\n<li>Bug Fixed: Search Form, when opens &#8220;More Filters&#8221; displays a bottom border</li>\n<li>Bug Fixed: Tags heading will not appear in property display page, if no tag is provided</li>\n</ul>\n<h4>3.9 &#8211; April, 10 2017</h4>\n<ul>\n<li>Feature Added: Property Status Publish and Draft added, drafts will not be searchable or publically accessible</li>\n<li>Feature Added: After successfull registration, redirect users to any custom URL</li>\n<li>Bug Fixed: City, Country not searchable if have spaces</li>\n</ul>\n<h4>3.8 &#8211; April, 7 2017</h4>\n<ul>\n<li>Feature Added: Compatible with WPML</li>\n<li>Bug Fixed: Property price error when no price is set</li>\n<li>Bug Fixed: Widget price ranges not working</li>\n<li>Bug Fixed: File attachment issue fixed</li>\n<li>Bug Fixed: Multiple search shortcodes on same page</li>\n</ul>\n<h4>3.7 &#8211; April, 5 2017</h4>\n<ul>\n<li>Feature Added: Visual Composer Support Added</li>\n<li>Feature Added: Edit Agent Profile from Front End</li>\n<li>Feature Added: File Attachment with Properties</li>\n<li>Feature Added: Display Properties related to specific status, purpose or type</li>\n<li>Feature Added: Display Properties matching specific tags</li>\n<li>Feature Added: Display specific Agent on any page using shortcode</li>\n</ul>\n<h4>3.6 &#8211; March, 31 2017</h4>\n<ul>\n<li>Feature Added: Display Multiple Properties on Map using shortcode [rem_maps ids=&#8221;comma,separated,property,ids&#8221;]</li>\n<li>Feature Added: Search Widget with personalized search fields</li>\n<li>Feature Added: Mortgage Calculator Widget</li>\n<li>Feature Added: Easy to insert shortcodes from editor bar</li>\n<li>Feature Added: Customize the Property Tags archive title</li>\n<li>Feature Added: Property State and Zip Code options added</li>\n</ul>\n<h4>3.5 &#8211; March, 28 2017</h4>\n<ul>\n<li>Feature Added: Languages added Greek, Persian, Czech, Danish, Spanish</li>\n</ul>\n<h4>3.4 March, 26 2017</h4>\n<ul>\n<li>Feature Added: Social Icons for YouTube, Instagram and Facebook Page Added</li>\n<li>Feature Added: Dummy Data included in dummy directory</li>\n<li>Feature Added: Filter added for social icons &#8220;rem_all_social_networks&#8221;</li>\n<li>Bug Fixed: Custom Contact Form works now, you can use contact form 7 etc&#8230;</li>\n</ul>\n<h4>3.3 March, 22 2017</h4>\n<ul>\n<li>Feature Added: 5 Property Styles Added for shortcode [rem_list_properties style=&#8221;1 to 5&#8243;]</li>\n<li>Bug Fixed: Social icons and pages full width fixed</li>\n</ul>\n<h4>3.2 March, 21 2017</h4>\n<ul>\n<li>Bug Fixed: Multiple Features are not removing</li>\n</ul>\n<h4>3.1 20th March 2017</h4>\n<ul>\n<li>Feature Added: Custom Titles</li>\n<li>Feature Added: Translations in German, Spanish, Russian, Arabic</li>\n</ul>\n<h4>3.0 16th March 2017</h4>\n<ul>\n<li>Feature Added: Maps Custom Icons</li>\n<li>Feature Added: Custom Theme Color</li>\n<li>Feature Added: Remove Existing Property Options</li>\n<li>Feature Added: Maps API Option Added</li>\n<li>Feature Added: 2 More Templates for Property Page</li>\n<li>Bug Fixed: Drop Down Menu Cut Off on Search Page</li>\n</ul>\n<h4>2.0 11th March 2017</h4>\n<ul>\n<li>Feature Added: Custom Colors</li>\n<li>Feature Added: Custom CSS Code</li>\n</ul>\n<h4>1.0.0 6th March 2017</h4>\n<ul>\n<li>Initial Release</li>\n</ul>\n"
    },
    "short_description": "A comprehensive WordPress plugin designed to create feature-rich real estate websites and portals including Agent Management System.",
    "description": "<p>Real Estate Manager is a comprehensive WordPress plugin designed to create feature-rich real estate websites and portals. With its responsive design and clean property templates, Real Estate Manager offers a seamless integration of advanced features to enhance your real estate listings.</p>\n<ul>\n<li><a href=\"https://wp-rem.com\" rel=\"nofollow ugc\">Live Demos</a></li>\n<li><a href=\"https://wp-rem.com/online-documentation/\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://wp-rem.com/online-documentation/category/shortcodes/\" rel=\"nofollow ugc\">Shortcodes</a></li>\n<li><a href=\"https://wpml.org/plugin/real-estate-manager-pro/\" rel=\"nofollow ugc\">WPML Recommendation</a></li>\n<li><a href=\"https://webcodingplace.com/contact-us/\" rel=\"nofollow ugc\">Feature Request / Help</a></li>\n</ul>\n<h3>Key Features:</h3>\n<ul>\n<li><strong>Property Types:</strong> Categorize properties based on their types for easy navigation.</li>\n<li><strong>Property Video:</strong> Showcase properties with engaging video content.</li>\n<li><strong>Gallery Images:</strong> Display property images in an interactive slider, thumbnail slider or justified grid (like Google Images).</li>\n<li><strong>Advanced AJAX Search:</strong> Enhance user experience with a fast and dynamic search functionality including advanced queries.</li>\n<li><strong>Google Maps and Leaflet Maps:</strong> Integrate Google Maps or Leaflet Maps to display property locations with markers and clusters.</li>\n<li><strong>Grid Listings:</strong> Display properties in a grid layout for a visually appealing presentation in more than 5 different styles.</li>\n<li><strong>Frontend Management:</strong> Allow users to submit properties directly from the frontend and manage them.</li>\n<li><strong>Agent Management System:</strong> Ability to create custom data fields for agents and option to display them on their profile as well.</li>\n<li><strong>Responsive Properties Grid and Carousels:</strong> Ensure your property listings look great on all devices.</li>\n</ul>\n<h3>Additional Features:</h3>\n<ul>\n<li><strong>WooCommerce Compatibility:</strong> Manage paid subscriptions using the Woo Estato Addon.</li>\n<li><strong>Nearby Properties:</strong> Automatically display properties close to the visitor&#8217;s location.</li>\n<li><strong>Filter Properties:</strong> Let visitors filter properties based on property types directly from the map.</li>\n<li><strong>Unlimited Features:</strong> Add unlimited property features and options.</li>\n<li><strong>Property Carousels:</strong> Integrated touch enabled carousel sliders for property listings.</li>\n<li><strong>Unlimited Features:</strong> Add unlimited property features and options.</li>\n<li><strong>Property Gallery:</strong> Lets you to add unlimited gallery photos for each property, that will display on single property page in touch friendly slider.</li>\n<li><strong>Property CPT:</strong> Custom Post Type is used for managing properties with responsive frontend template. You can also customize property slug and template files by including them in your theme.</li>\n<li><strong>WPML:</strong> Its compatible with WPML to let you create multi language real estate site.</li>\n<li><strong>WPBakery Page Builder:</strong> 15+ Visual Composer elements are added to easily insert and manage shortcodes.</li>\n<li><strong>Divi Modules:</strong> 15+ Divi Modules are available to easily use components in the pages.</li>\n<li><strong>Divi Builder:</strong> Create custom listing design using Divi Builder.</li>\n<li><strong>Elementor:</strong> Create Custom listing design using Elementor Theme Builder.</li>\n<li><strong>Optimized Code:</strong> Based on WP Codex Standards, only relevant scripts and styles loads to give you fast experience and avoiding conflicts.</li>\n<li><strong>Email Alerts:</strong> Email alerts for property inquiry and on agent registration with customize email messages.</li>\n<li><strong>Drag Drop Fields:</strong> Create custom property fields using drag drop fields builder.</li>\n<li><strong>Price Range Slider:</strong> Let the users to choose range of their budget while searching properties using price range slider.</li>\n<li><strong>Fast AJAX Search:</strong> AJAX based fast search for listings with advanced search queries.</li>\n<li><strong>Agent Profile:</strong> Agent profile management with their social links and other settings that can be managed from profile settings.</li>\n<li><strong>Widgets Included:</strong> Search Widget, Tags Cloud and Mortgage Calculator Widgets are available to add to the widget areas.</li>\n<li><strong>Frontend Property Submission:</strong> Create properties from frontend without even going to WordPress dashboard by using just one shortcode.</li>\n<li><strong>Frontend Agent Registration:</strong> Register agents using builtin register form with the ability to be approved by site administrator.</li>\n<li><strong>Agent Login:</strong> AJAX based login with captcha verification and custom redirection after successful login.</li>\n<li><strong>My Properties:</strong> Display a list of current logged in agent&#8217;s properties with actions to delete or edit them using just a single shortcode.</li>\n<li><strong>Frontend Profile Editing:</strong> Let the registered agents to edit their profile from frontend.</li>\n<li><strong>Developers Friendly:</strong> Real Estate Manager is based on actions and filter to let the developers easily modify or add new functionalities.</li>\n<li><strong>Property Video:</strong> Separate section to display video of internal structure of properties with responsive video player.</li>\n<li><strong>File Attachments:</strong> Easily attach all type of files with properties like floor plans, wire frames or documents.</li>\n<li><strong>Translation Ready:</strong> You can easily change the English strings into your own language using any translation plugin, like Loco Translate. More than 15 languages are already translated in this plugin and POT file is also included to add your own language.</li>\n<li><strong>Custom Map Icons:</strong> You can replace default map icons with your own images easily from settings by uploading them.</li>\n<li><strong>Customize Colors:</strong> You can customize the color scheme based on your theme, you can choose colors from settings for each element individually.</li>\n<li><strong>Custom Currency and Area Unit:</strong> Easily change currency by just selecting your country.</li>\n<li><strong>Custom Labels:</strong> You can change all labels and headings into your own text easily.</li>\n<li><strong>Map Types:</strong> You can choose map style from four styles. Road Map, Earth, Hybrid or Tarrain.</li>\n<li><strong>Map Zoom Level:</strong> Customize map zoom level and default latitude and longitude easily.</li>\n<li><strong>Disable Scripts:</strong> You can disable bootstrap and font awesome css to load from plugin if your theme is already loading them.</li>\n</ul>\n<h3>Addons</h3>\n<ul>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-xml-csv-importer/\" rel=\"nofollow ugc\">REM &#8211; XML, CSV Importer:</a></strong><br />\n      Import or sync listings from files (XML, CSV) or external APIs.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-conditional-fields/\" rel=\"nofollow ugc\">REM &#8211; Conditional Fields:</a></strong><br />\n      Dependable listing fields on search forms and creation/updation.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-conditional-fields/\" rel=\"nofollow ugc\">REM &#8211; Currency Switcher:</a></strong><br />\n      Live currency converion for prices of listings.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-saved-searches-and-notify/\" rel=\"nofollow ugc\">REM &#8211; Saved Searches and Notify:</a></strong><br />\n      Save the search criteria and notify when a matching listing is available.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-wish-list/\" rel=\"nofollow ugc\">REM &#8211; Wishlist</a></strong><br />\n      Add listing to favourites and bulk contact their agents.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-export-and-import/\" rel=\"nofollow ugc\">REM &#8211; Export Import</a></strong><br />\n      Export and Import the plugin settings.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-property-listing-styles/\" rel=\"nofollow ugc\">REM &#8211; Property Listing Styles</a></strong><br />\n      Additional listing styles for property archives.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-social-share/\" rel=\"nofollow ugc\">REM &#8211; Social Share</a></strong><br />\n      Social Share buttons for listings and print PDFs.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-google-map-filters/\" rel=\"nofollow ugc\">REM &#8211; Google Map Filters</a></strong><br />\n      Search and filter listings directly on the map.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-filterable-grid/\" rel=\"nofollow ugc\">REM &#8211; Filterable Properties Grid</a></strong><br />\n      Display listings in a filterable justified grid.\n   </li>\n<li>\n      <strong><a href=\"https://wp-rem.com/addons/rem-woo-estato/\" rel=\"nofollow ugc\">REM &#8211; Woo Estato</a></strong><br />\n      Paid subscriptions for listing submissions.\n   </li>\n</ul>\n<h3>Translations</h3>\n<ul>\n<li>English</li>\n<li>German</li>\n<li>Spanish</li>\n<li>Russian</li>\n<li>Arabic</li>\n<li>Czech</li>\n<li>Danish</li>\n<li>Greek</li>\n<li>Persian</li>\n<li>Portuguese</li>\n<li>Greek</li>\n<li>Serbian</li>\n<li>Chinese</li>\n<li>Norway</li>\n<li>Israel</li>\n<li>Please contact support@webcodingplace.com to request your language.</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/real-estate-manager.7.3.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/real-estate-manager/assets/screenshot-1.jpg?rev=1633908",
            "caption": "Multiple Properties on Map with Locations"
        },
        {
            "src": "https://ps.w.org/real-estate-manager/assets/screenshot-2.jpg?rev=1633908",
            "caption": "Property Gallery Touch Slider"
        },
        {
            "src": "https://ps.w.org/real-estate-manager/assets/screenshot-3.jpg?rev=1633908",
            "caption": "Responsive and Readable Design"
        },
        {
            "src": "https://ps.w.org/real-estate-manager/assets/screenshot-4.jpg?rev=1633908",
            "caption": "File Attachment and Property Video"
        },
        {
            "src": "https://ps.w.org/real-estate-manager/assets/screenshot-5.jpg?rev=1633908",
            "caption": "Property Location and Tags"
        },
        {
            "src": "https://ps.w.org/real-estate-manager/assets/screenshot-6.jpg?rev=1632255",
            "caption": "Visual Composer Shortcodes Ready"
        },
        {
            "src": "https://ps.w.org/real-estate-manager/assets/screenshot-7.jpg?rev=1633908",
            "caption": "Frontend Property Submission"
        },
        {
            "src": "https://ps.w.org/real-estate-manager/assets/screenshot-8.jpg?rev=1633908",
            "caption": "Properties Grid Listing"
        },
        {
            "src": "https://ps.w.org/real-estate-manager/assets/screenshot-9.jpg?rev=1633908",
            "caption": "Agent Profile Page"
        },
        {
            "src": "https://ps.w.org/real-estate-manager/assets/screenshot-10.jpg?rev=1633908",
            "caption": "Easy to use Settings"
        }
    ],
    "tags": {
        "listings": "listings",
        "property": "property",
        "real-estate": "real-estate",
        "realty": "realty",
        "wp-property": "wp-property"
    },
    "stable_tag": "7.3",
    "versions": {
        "2.0": "https://downloads.wordpress.org/plugin/real-estate-manager.2.0.zip",
        "3.0": "https://downloads.wordpress.org/plugin/real-estate-manager.3.0.zip",
        "3.1": "https://downloads.wordpress.org/plugin/real-estate-manager.3.1.zip",
        "3.2": "https://downloads.wordpress.org/plugin/real-estate-manager.3.2.zip",
        "3.3": "https://downloads.wordpress.org/plugin/real-estate-manager.3.3.zip",
        "3.4": "https://downloads.wordpress.org/plugin/real-estate-manager.3.4.zip",
        "3.5": "https://downloads.wordpress.org/plugin/real-estate-manager.3.5.zip",
        "3.6": "https://downloads.wordpress.org/plugin/real-estate-manager.3.6.zip",
        "3.7": "https://downloads.wordpress.org/plugin/real-estate-manager.3.7.zip",
        "3.8": "https://downloads.wordpress.org/plugin/real-estate-manager.3.8.zip",
        "3.9": "https://downloads.wordpress.org/plugin/real-estate-manager.3.9.zip",
        "4.0": "https://downloads.wordpress.org/plugin/real-estate-manager.4.0.zip",
        "4.1": "https://downloads.wordpress.org/plugin/real-estate-manager.4.1.zip",
        "4.2": "https://downloads.wordpress.org/plugin/real-estate-manager.4.2.zip",
        "4.3": "https://downloads.wordpress.org/plugin/real-estate-manager.4.3.zip",
        "4.4": "https://downloads.wordpress.org/plugin/real-estate-manager.4.4.zip",
        "4.4.1": "https://downloads.wordpress.org/plugin/real-estate-manager.4.4.1.zip",
        "4.4.2": "https://downloads.wordpress.org/plugin/real-estate-manager.4.4.2.zip",
        "4.4.3": "https://downloads.wordpress.org/plugin/real-estate-manager.4.4.3.zip",
        "4.4.4": "https://downloads.wordpress.org/plugin/real-estate-manager.4.4.4.zip",
        "4.4.5": "https://downloads.wordpress.org/plugin/real-estate-manager.4.4.5.zip",
        "4.4.6": "https://downloads.wordpress.org/plugin/real-estate-manager.4.4.6.zip",
        "4.4.7": "https://downloads.wordpress.org/plugin/real-estate-manager.4.4.7.zip",
        "4.4.8": "https://downloads.wordpress.org/plugin/real-estate-manager.4.4.8.zip",
        "4.4.9": "https://downloads.wordpress.org/plugin/real-estate-manager.4.4.9.zip",
        "4.5": "https://downloads.wordpress.org/plugin/real-estate-manager.4.5.zip",
        "5.0": "https://downloads.wordpress.org/plugin/real-estate-manager.5.0.zip",
        "5.1": "https://downloads.wordpress.org/plugin/real-estate-manager.5.1.zip",
        "5.2": "https://downloads.wordpress.org/plugin/real-estate-manager.5.2.zip",
        "5.3": "https://downloads.wordpress.org/plugin/real-estate-manager.5.3.zip",
        "6.0": "https://downloads.wordpress.org/plugin/real-estate-manager.6.0.zip",
        "6.1": "https://downloads.wordpress.org/plugin/real-estate-manager.6.1.zip",
        "6.2": "https://downloads.wordpress.org/plugin/real-estate-manager.6.2.zip",
        "6.2.1": "https://downloads.wordpress.org/plugin/real-estate-manager.6.2.1.zip",
        "6.2.2": "https://downloads.wordpress.org/plugin/real-estate-manager.6.2.2.zip",
        "6.3": "https://downloads.wordpress.org/plugin/real-estate-manager.6.3.zip",
        "6.4": "https://downloads.wordpress.org/plugin/real-estate-manager.6.4.zip",
        "6.5": "https://downloads.wordpress.org/plugin/real-estate-manager.6.5.zip",
        "6.6": "https://downloads.wordpress.org/plugin/real-estate-manager.6.6.zip",
        "6.7": "https://downloads.wordpress.org/plugin/real-estate-manager.6.7.zip",
        "6.7.1": "https://downloads.wordpress.org/plugin/real-estate-manager.6.7.1.zip",
        "6.8": "https://downloads.wordpress.org/plugin/real-estate-manager.6.8.zip",
        "7.0": "https://downloads.wordpress.org/plugin/real-estate-manager.7.0.zip",
        "7.1": "https://downloads.wordpress.org/plugin/real-estate-manager.7.1.zip",
        "7.2": "https://downloads.wordpress.org/plugin/real-estate-manager.7.2.zip",
        "7.3": "https://downloads.wordpress.org/plugin/real-estate-manager.7.3.zip",
        "trunk": "https://downloads.wordpress.org/plugin/real-estate-manager.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.paypal.me/webcodingplace",
    "banners": {
        "low": "https://ps.w.org/real-estate-manager/assets/banner-772x250.jpg?rev=3074279",
        "high": "https://ps.w.org/real-estate-manager/assets/banner-1544x500.jpg?rev=3074279"
    },
    "icons": {
        "1x": "https://ps.w.org/real-estate-manager/assets/icon-128x128.gif?rev=3064412",
        "2x": "https://ps.w.org/real-estate-manager/assets/icon-256x256.gif?rev=3064412"
    },
    "blocks": {
        "real-estate-manager/login-agent": {
            "name": "real-estate-manager/login-agent",
            "title": "Login Agent"
        },
        "real-estate-manager/simple-search": {
            "name": "real-estate-manager/simple-search",
            "title": "Simple Search"
        },
        "real-estate-manager/register-agent": {
            "name": "real-estate-manager/register-agent",
            "title": "Register Agent"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "real-estate-manager",
            "language": "el",
            "version": "7.3",
            "updated": "2024-06-25 13:03:52",
            "package": "http://downloads.wordpress.org/translation/plugin/real-estate-manager/7.3/el.zip"
        }
    ]
}