{
    "name": "REDIS &#8211; WooCommerce Dynamic Pricing and Discounts",
    "slug": "redis-woo-dynamic-pricing-and-discounts",
    "version": "1.0.13",
    "author": "<a href=\"https://villatheme.com\">VillaTheme</a>",
    "author_profile": "https://profiles.wordpress.org/villatheme/",
    "contributors": {
        "villatheme": {
            "profile": "https://profiles.wordpress.org/villatheme/",
            "avatar": "https://secure.gravatar.com/avatar/973d0ef458adb8a3c527f196b9529909?s=96&d=monsterid&r=g",
            "display_name": "VillaTheme"
        },
        "mrt3vn": {
            "profile": "https://profiles.wordpress.org/mrt3vn/",
            "avatar": "https://secure.gravatar.com/avatar/cb8ecbc2ffe02a20ea2f5d1da26d3a22?s=96&d=monsterid&r=g",
            "display_name": "Andy Ha"
        }
    },
    "requires": "5.0",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [
        "woocommerce"
    ],
    "compatibility": [],
    "rating": 84,
    "ratings": {
        "5": 4,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 5,
    "support_url": "https://wordpress.org/support/plugin/redis-woo-dynamic-pricing-and-discounts/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 100,
    "downloaded": 4294,
    "last_updated": "2024-06-17 7:18am GMT",
    "added": "2021-11-17",
    "homepage": "https://villatheme.com/extensions/redis-woocommerce-dynamic-pricing-and-discounts/",
    "sections": {
        "description": "<p>REDIS – WooCommerce Dynamic Pricing and Discounts is an advanced product pricing plugin that helps shop owners to configure discount types and pricing for products and carts. Shop owners can configure WooCommerce Dynamic Pricing and Discounts, offer attractive prices or discounts for customers based on cart conditions or product quantity.  WooCommerce Dynamic Pricing and Discounts promises to motivate purchases and increase revenue for shop owners.</p>\n<blockquote>\n<p><a href=\"https://docs.villatheme.com/?item=redis\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<h3>How to install and use the plugin</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/zgM_EQBpIgQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>THE PLUGIN FEATURES:</h3>\n<p>&#9658; <strong>Product pricing</strong>: Configure bulk discounts for each product based on product quantity or discount amounts.</p>\n<ul>\n<li>\n<p><strong>Shop owners can set up many product pricing rules</strong>: Products that are eligible for particular rules will be applied a discount at the respective level.</p>\n</li>\n<li>\n<p><strong>Set up the date conditions to apply the product pricing rule</strong>: For example, product pricing will be applied every Saturday, or from Dec 1st  to Dec 31st…</p>\n</li>\n<li>\n<p><strong>Product pricing rules</strong>: You can set a fixed discount on the product price or discount based on the quantity of the product. For example, 5% discount for y product quantities purchased or $10 per product purchased.</p>\n</li>\n<li>\n<p>Basic: Set a fixed discount on the product price. Eg: $10 per product purchased.</p>\n</li>\n<li>\n<p>Bulk pricing is based on product quantity. You can set the quantity of: current product( apply discount per product based on the quantity of that currently selected product), all cart items( apply discount per product based on quantity of all items in the cart), all cart items in the same category( apply discount per product based on quantity of all cart items in the same category).</p>\n</li>\n<li>\n<p><strong>Set up product conditions to apply the product pricing rule</strong>: with which products discount will be applied, available:</p>\n</li>\n<li>\n<p>Product sale: Apply the product pricing rule for the sale-off products on your site.</p>\n</li>\n<li>\n<p>Product price: Products whose price falls in the price range set. Eg: a 5% discount for products that have a base price from $20 to $30.</p>\n</li>\n<li>\n<p>Product visibility: Products whose catalog visibility is set, available:  Shop only; Shop and search results; Search results only; Hidden. Eg: a $5 discount for products whose visibility is set: Shop only.</p>\n</li>\n<li>\n<p>Include products: Assign particular products. Eg: a $5 discount for products that are assigned.</p>\n</li>\n<li>\n<p>Exclude products: All products will be applied except these products. Eg: a 5% discount for all products except these selected products.</p>\n</li>\n<li>\n<p>Include categories: Assign particular categories. A $5 discount for products in these categories which are assigned.</p>\n</li>\n<li>\n<p>Exclude categories: All categories will be assigned except these categories. Eg: a 5% discount for all categories except these selected categories.</p>\n</li>\n<li>\n<p><strong>Set up cart conditions to apply the product pricing rule</strong>: If a cart is eligible as (a) rules set, a product discount will be applied.</p>\n</li>\n<li>\n<p>Cart subtotal: Set the cart subtotal value from (min) to (max) to get a product discount, leave one side empty if you want.</p>\n</li>\n<li>\n<p>Cart items:<br />\nThe total quantity of cart items: Set the total quantity value from (min) to (max) a product discount, leave one side empty if you want.</p>\n</li>\n</ul>\n<p>Include cart items: Set the specific products which the carts must have to be applied a product discount.</p>\n<p>exclude cart items: Set the specific products to which the carts must not have to be applied a product discount.</p>\n<p>Include cart items by categories: Set the specific categories which the carts must have to be applied a product discount.</p>\n<p>Exclude cart items by categories: Set the specific categories to which the carts must not have to be applied a product discount.</p>\n<p>Include cart items by tags: Set tags which if the cart includes these tag products will get a product discount.</p>\n<p>Exclude cart items by tags: Set tags which if the cart does not include these tag products will get a product discount.</p>\n<ul>\n<li>Applied coupon:</li>\n</ul>\n<p>Include coupon: Set the specific Coupons which the carts must have to get a product discount</p>\n<p>Exclude coupon: Set the specific Coupons which the carts must have to get a product discount</p>\n<ul>\n<li>Billing address:</li>\n</ul>\n<p>Include billing countries: Set the specific countries in which the carts must have these billing countries to apply a product discount</p>\n<p>Exclude billing countries: Set the specific countries in which the carts must not have these billing countries to apply a product discount</p>\n<ul>\n<li>Shipping address:</li>\n</ul>\n<p>Include shipping countries: Set the specific countries which the carts must have these shipping countries to apply a product discount</p>\n<p>Exclude shipping countries: Set the specific countries in which the carts must not have these shipping countries to apply a product discount</p>\n<ul>\n<li>\n<p><strong>Set up customer conditions to apply the product pricing rule</strong>: Offer a product discount matched with user roles or users you set, available:</p>\n</li>\n<li>\n<p>Customer information:</p>\n</li>\n</ul>\n<p>Logged-in users: Apply a product discount to users who are logged in or not. There are 2 options: Yes or No for who logged in, and non-logged in, respectively.</p>\n<p>Include user role: Apply a product discount to these user roles that you assign.</p>\n<p>Exclude user role: Apply a product discount to all except these user roles you assign.</p>\n<p>Include user: Apply a product discount to these users you assign.</p>\n<p>Exclude user: Apply a product discount to all except these users you assign</p>\n<ul>\n<li>Order history:</li>\n</ul>\n<p>Order status: Select respective order statuses to get a product discount.</p>\n<p>Order count: Select the ordered date range and the ordered quantity to get a product discount.</p>\n<p>Order total: Select the ordered date range and the ordered total to get a product discount</p>\n<p>Has last order: Options to apply a product discount for the order before or after a specific day.</p>\n<ul>\n<li>Purchased products:</li>\n</ul>\n<p>Include purchased products: Fill in the products which if the customer has purchased before will get a product discount</p>\n<p>Exclude purchased products: Fill in the products which if the customer has purchased before will not get a product discount</p>\n<p>Include purchased categories: Fill in the categories which if the customer has purchased before will get a product discount</p>\n<p>Exclude purchased categories: Fill in the categories which if the customer has purchased before will not get a product discount</p>\n<p>&#9658; <strong>Display discount price on the frontend</strong>: There are options to display the discount prices on the store and on the cart page.</p>\n<ul>\n<li>\n<p><strong>Change display price style</strong>:  Select the price style to display: Only discount price; Both regular price and discount price or Both base price and discount price.</p>\n</li>\n<li>\n<p><strong>Option to display dynamic pricing on the single product page</strong></p>\n</li>\n<li>\n<p><strong>Assign pages to display discount price</strong>:</p>\n</li>\n<li>\n<p>On the single product page.</p>\n</li>\n<li>\n<p>On the product list pages: There are choices to choose from WooCommerce page, Product category page, Shop page, Single product page</p>\n</li>\n<li>\n<p><strong>Display sale badge</strong>: Display sale badge if the displayed price is changed.</p>\n</li>\n<li>\n<p><strong>Display pricing table</strong>: Display discount pricing table with respective quantity, matched with quantity range set in the rule</p>\n</li>\n<li>\n<p><strong>Customize pricing table text</strong>: Enter pricing table title to display on the frontend.</p>\n</li>\n<li>\n<p><strong>Select pricing table position</strong>: Set the position of the pricing table, it can be: Before adding to cart button, after adding to cart button, before product meta, after product meta, after product summary.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Cart discount</strong>: Configure bulk discount for carts based on rules in WooCommerce Dynamic Pricing and Discounts.</p>\n<ul>\n<li>\n<p><strong>Shop owners can set up many cart rules</strong>: A cart that is eligible for particular rules will be applied a discount at the respective level.</p>\n</li>\n<li>\n<p><strong>Set up the date conditions to apply the cart discount rule</strong>: For example, the cart discount will be applied every Monday, or from Feb 1st  to Feb31st …</p>\n</li>\n<li>\n<p><strong>Set up cart conditions to apply the cart discount rule</strong>: If a cart is eligible as (a) rules set, a cart discount will be applied.</p>\n</li>\n<li>\n<p>Cart subtotal: Set the cart subtotal value from (min) to (max) to get a cart discount, leave one side empty if you want.</p>\n</li>\n<li>\n<p>Cart items:</p>\n</li>\n</ul>\n<p>The total quantity of cart items: Set the total quantity value from (min) to (max) to get a cart discount, leave one side empty if you want.</p>\n<p>Include cart items:  Set the specific products which the carts must have to be applied a cart discount.</p>\n<p>Exclude cart items: Set the specific products to which the carts must not have to be applied a cart discount.</p>\n<p>Include cart items by categories: Set the specific categories which the carts must have to be applied a cart discount.</p>\n<p>Exclude cart items by categories: Set the specific categories to which the carts must not have to be applied a cart discount.</p>\n<p>Include cart items by tags: Set tags which if the cart includes these tag products will get a cart discount.</p>\n<p>Exclude cart items by tags: Set tags which if the cart does not include these tag products will get a cart discount.</p>\n<ul>\n<li>Applied coupon:</li>\n</ul>\n<p>Include coupon: Set the specific Coupons which the carts must have to get a cart discount</p>\n<p>Exclude coupon: Set the specific Coupons which the carts must have to get a cart discount</p>\n<ul>\n<li>Billing address:</li>\n</ul>\n<p>Include billing countries: Set the specific countries in which the carts must have these billing countries to apply a cart discount</p>\n<p>Exclude billing countries: Set the specific countries in which the carts must not have these billing countries to apply a cart discount</p>\n<ul>\n<li>Shipping address:</li>\n</ul>\n<p>Include shipping countries: Set the specific countries which the carts must have these shipping countries to apply a cart discount</p>\n<p>Exclude shipping countries: Set the specific countries which the carts must not have these shipping countries to apply a cart discount</p>\n<ul>\n<li>\n<p><strong>Set up customer conditions to apply the cart discount rule</strong>: Offer a cart discount matched with user roles or users you set, available:</p>\n</li>\n<li>\n<p>Customer information:</p>\n</li>\n</ul>\n<p>Logged-in users: Apply a cart discount to users who are logged in or not. There are 2 options: Yes or No for who logged in, and non-logged in, respectively.</p>\n<p>Include user role: Apply a cart discount to these user roles that you assign.</p>\n<p>Exclude user role: Apply a cart discount to all except these user roles you assign.</p>\n<p>Include user: Apply a cart discount to these users you assign.</p>\n<p>Exclude user: Apply a cart discount to all except these users you assign.</p>\n<ul>\n<li>Order history:</li>\n</ul>\n<p>Order status: Select respective order statuses to get a cart discount.</p>\n<p>Order count: Select the ordered date range and the ordered quantity to get a cart discount.</p>\n<p>Order total: Select the ordered date range and the ordered total to get a cart discount</p>\n<p>Has last order: Options to apply a cart discount for the order before or after a specific day.</p>\n<ul>\n<li>Purchased products:</li>\n</ul>\n<p>Include purchased products: Fill in the products which if the customer has purchased before will get a cart discount</p>\n<p>Exclude purchased products: Fill in the products which if the customer has purchased before will not get a cart discount</p>\n<p>Exclude purchased categories: Fill in the categories which if the customer has purchased before will not get a cart discount</p>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a></p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a></p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a></p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a></p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a></p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a></p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a></p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a></p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a></p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a></p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a></p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a></p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a></p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a></p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a></p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a></p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a></p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a></p>\n<h3>Documentation</h3>\n<p>&#9658; <a href=\"https://docs.villatheme.com/?item=redis\" rel=\"nofollow ugc\">Getting Started</a></p>\n<h3>Plugin Links</h3>\n<p>&#9658; <a href=\"https://villatheme.com/extensions/redis-woocommerce-dynamic-pricing-and-discounts/\" rel=\"nofollow ugc\">Project Page</a><br />\n&#9658; <a href=\"https://docs.villatheme.com/?item=redis\" rel=\"nofollow ugc\">Documentation</a><br />\n&#9658; <a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></p>\n",
        "installation": "<ol>\n<li>Unzip the download package</li>\n<li>Upload <code>redis-woo-dynamic-pricing-and-discounts</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "changelog": "<p>/<strong>1.0.13 &#8211; 2024.06.17</strong>/<br />\n– Updated: Compatible with WC 8.9</p>\n<p>/<strong>1.0.12 &#8211; 2024.04.13</strong>/<br />\n– Updated: Compatible with WP 6.5 and  WC 8.7<br />\n– Updated: Update support class</p>\n<p>/<strong>1.0.11 – 2023.08.04</strong>/<br />\n– Fixed: Compatible with &#8216;High-Performance order storage (COT)&#8217;<br />\n– Updated: Update support class</p>\n<p>/<strong>1.0.10 – 2023.04.12</strong>/<br />\n– Updated: Compatible with &#8216;High-Performance order storage (COT)&#8217;</p>\n<p>/<strong>1.0.9 – 2022.12.15</strong>/<br />\n&#8211; Fixed: Display wrong on the mini cart on some case</p>\n<p>/<strong>1.0.8 – 2022.10.22</strong>/<br />\n&#8211; Fixed: error warning Undefined variable $curcy_data</p>\n<p>/<strong>1.0.7 – 2022.07.25</strong>/<br />\n&#8211; Updated: Compatibility with WebPOS – WooCommerce POS – Point of Sale by VillaTheme<br />\n– Updated: Update support class</p>\n<p>/<strong>1.0.6 – 2022.05.30</strong>/<br />\n– Updated: Compatible with WC 6.5 and WP 6.0<br />\n– Updated: Update support class</p>\n<p>/<strong>1.0.5 &#8211; 2022.04.12</strong>/<br />\n&#8211; Fixed: Can not get user conditions for variable products</p>\n<p>/<strong>1.0.4 &#8211; 2022.03.29</strong>/<br />\n&#8211; Updated: Update support class</p>\n<p>/<strong>1.0.3 &#8211; 2022.03.22</strong>/<br />\n&#8211; Updated: Update support class</p>\n<p>/<strong>1.0.2 &#8211; 2022.01.11</strong>/<br />\n&#8211; Updated: support class</p>\n<p>/<em>1.0.1  &#8211; 2021.12.29</em>/<br />\n&#8211; Updated: Compatibility with WC 6.0</p>\n<p>/** 1.0.0 &#8211; 2021. **/<br />\n~ The first released.</p>\n"
    },
    "short_description": "REDIS creates product pricing and smart cart discount rules, with pricing tables on single product pages",
    "description": "<p>REDIS – WooCommerce Dynamic Pricing and Discounts is an advanced product pricing plugin that helps shop owners to configure discount types and pricing for products and carts. Shop owners can configure WooCommerce Dynamic Pricing and Discounts, offer attractive prices or discounts for customers based on cart conditions or product quantity.  WooCommerce Dynamic Pricing and Discounts promises to motivate purchases and increase revenue for shop owners.</p>\n<blockquote>\n<p><a href=\"https://docs.villatheme.com/?item=redis\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<h3>How to install and use the plugin</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/zgM_EQBpIgQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>THE PLUGIN FEATURES:</h3>\n<p>&#9658; <strong>Product pricing</strong>: Configure bulk discounts for each product based on product quantity or discount amounts.</p>\n<ul>\n<li>\n<p><strong>Shop owners can set up many product pricing rules</strong>: Products that are eligible for particular rules will be applied a discount at the respective level.</p>\n</li>\n<li>\n<p><strong>Set up the date conditions to apply the product pricing rule</strong>: For example, product pricing will be applied every Saturday, or from Dec 1st  to Dec 31st…</p>\n</li>\n<li>\n<p><strong>Product pricing rules</strong>: You can set a fixed discount on the product price or discount based on the quantity of the product. For example, 5% discount for y product quantities purchased or $10 per product purchased.</p>\n</li>\n<li>\n<p>Basic: Set a fixed discount on the product price. Eg: $10 per product purchased.</p>\n</li>\n<li>\n<p>Bulk pricing is based on product quantity. You can set the quantity of: current product( apply discount per product based on the quantity of that currently selected product), all cart items( apply discount per product based on quantity of all items in the cart), all cart items in the same category( apply discount per product based on quantity of all cart items in the same category).</p>\n</li>\n<li>\n<p><strong>Set up product conditions to apply the product pricing rule</strong>: with which products discount will be applied, available:</p>\n</li>\n<li>\n<p>Product sale: Apply the product pricing rule for the sale-off products on your site.</p>\n</li>\n<li>\n<p>Product price: Products whose price falls in the price range set. Eg: a 5% discount for products that have a base price from $20 to $30.</p>\n</li>\n<li>\n<p>Product visibility: Products whose catalog visibility is set, available:  Shop only; Shop and search results; Search results only; Hidden. Eg: a $5 discount for products whose visibility is set: Shop only.</p>\n</li>\n<li>\n<p>Include products: Assign particular products. Eg: a $5 discount for products that are assigned.</p>\n</li>\n<li>\n<p>Exclude products: All products will be applied except these products. Eg: a 5% discount for all products except these selected products.</p>\n</li>\n<li>\n<p>Include categories: Assign particular categories. A $5 discount for products in these categories which are assigned.</p>\n</li>\n<li>\n<p>Exclude categories: All categories will be assigned except these categories. Eg: a 5% discount for all categories except these selected categories.</p>\n</li>\n<li>\n<p><strong>Set up cart conditions to apply the product pricing rule</strong>: If a cart is eligible as (a) rules set, a product discount will be applied.</p>\n</li>\n<li>\n<p>Cart subtotal: Set the cart subtotal value from (min) to (max) to get a product discount, leave one side empty if you want.</p>\n</li>\n<li>\n<p>Cart items:<br />\nThe total quantity of cart items: Set the total quantity value from (min) to (max) a product discount, leave one side empty if you want.</p>\n</li>\n</ul>\n<p>Include cart items: Set the specific products which the carts must have to be applied a product discount.</p>\n<p>exclude cart items: Set the specific products to which the carts must not have to be applied a product discount.</p>\n<p>Include cart items by categories: Set the specific categories which the carts must have to be applied a product discount.</p>\n<p>Exclude cart items by categories: Set the specific categories to which the carts must not have to be applied a product discount.</p>\n<p>Include cart items by tags: Set tags which if the cart includes these tag products will get a product discount.</p>\n<p>Exclude cart items by tags: Set tags which if the cart does not include these tag products will get a product discount.</p>\n<ul>\n<li>Applied coupon:</li>\n</ul>\n<p>Include coupon: Set the specific Coupons which the carts must have to get a product discount</p>\n<p>Exclude coupon: Set the specific Coupons which the carts must have to get a product discount</p>\n<ul>\n<li>Billing address:</li>\n</ul>\n<p>Include billing countries: Set the specific countries in which the carts must have these billing countries to apply a product discount</p>\n<p>Exclude billing countries: Set the specific countries in which the carts must not have these billing countries to apply a product discount</p>\n<ul>\n<li>Shipping address:</li>\n</ul>\n<p>Include shipping countries: Set the specific countries which the carts must have these shipping countries to apply a product discount</p>\n<p>Exclude shipping countries: Set the specific countries in which the carts must not have these shipping countries to apply a product discount</p>\n<ul>\n<li>\n<p><strong>Set up customer conditions to apply the product pricing rule</strong>: Offer a product discount matched with user roles or users you set, available:</p>\n</li>\n<li>\n<p>Customer information:</p>\n</li>\n</ul>\n<p>Logged-in users: Apply a product discount to users who are logged in or not. There are 2 options: Yes or No for who logged in, and non-logged in, respectively.</p>\n<p>Include user role: Apply a product discount to these user roles that you assign.</p>\n<p>Exclude user role: Apply a product discount to all except these user roles you assign.</p>\n<p>Include user: Apply a product discount to these users you assign.</p>\n<p>Exclude user: Apply a product discount to all except these users you assign</p>\n<ul>\n<li>Order history:</li>\n</ul>\n<p>Order status: Select respective order statuses to get a product discount.</p>\n<p>Order count: Select the ordered date range and the ordered quantity to get a product discount.</p>\n<p>Order total: Select the ordered date range and the ordered total to get a product discount</p>\n<p>Has last order: Options to apply a product discount for the order before or after a specific day.</p>\n<ul>\n<li>Purchased products:</li>\n</ul>\n<p>Include purchased products: Fill in the products which if the customer has purchased before will get a product discount</p>\n<p>Exclude purchased products: Fill in the products which if the customer has purchased before will not get a product discount</p>\n<p>Include purchased categories: Fill in the categories which if the customer has purchased before will get a product discount</p>\n<p>Exclude purchased categories: Fill in the categories which if the customer has purchased before will not get a product discount</p>\n<p>&#9658; <strong>Display discount price on the frontend</strong>: There are options to display the discount prices on the store and on the cart page.</p>\n<ul>\n<li>\n<p><strong>Change display price style</strong>:  Select the price style to display: Only discount price; Both regular price and discount price or Both base price and discount price.</p>\n</li>\n<li>\n<p><strong>Option to display dynamic pricing on the single product page</strong></p>\n</li>\n<li>\n<p><strong>Assign pages to display discount price</strong>:</p>\n</li>\n<li>\n<p>On the single product page.</p>\n</li>\n<li>\n<p>On the product list pages: There are choices to choose from WooCommerce page, Product category page, Shop page, Single product page</p>\n</li>\n<li>\n<p><strong>Display sale badge</strong>: Display sale badge if the displayed price is changed.</p>\n</li>\n<li>\n<p><strong>Display pricing table</strong>: Display discount pricing table with respective quantity, matched with quantity range set in the rule</p>\n</li>\n<li>\n<p><strong>Customize pricing table text</strong>: Enter pricing table title to display on the frontend.</p>\n</li>\n<li>\n<p><strong>Select pricing table position</strong>: Set the position of the pricing table, it can be: Before adding to cart button, after adding to cart button, before product meta, after product meta, after product summary.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Cart discount</strong>: Configure bulk discount for carts based on rules in WooCommerce Dynamic Pricing and Discounts.</p>\n<ul>\n<li>\n<p><strong>Shop owners can set up many cart rules</strong>: A cart that is eligible for particular rules will be applied a discount at the respective level.</p>\n</li>\n<li>\n<p><strong>Set up the date conditions to apply the cart discount rule</strong>: For example, the cart discount will be applied every Monday, or from Feb 1st  to Feb31st …</p>\n</li>\n<li>\n<p><strong>Set up cart conditions to apply the cart discount rule</strong>: If a cart is eligible as (a) rules set, a cart discount will be applied.</p>\n</li>\n<li>\n<p>Cart subtotal: Set the cart subtotal value from (min) to (max) to get a cart discount, leave one side empty if you want.</p>\n</li>\n<li>\n<p>Cart items:</p>\n</li>\n</ul>\n<p>The total quantity of cart items: Set the total quantity value from (min) to (max) to get a cart discount, leave one side empty if you want.</p>\n<p>Include cart items:  Set the specific products which the carts must have to be applied a cart discount.</p>\n<p>Exclude cart items: Set the specific products to which the carts must not have to be applied a cart discount.</p>\n<p>Include cart items by categories: Set the specific categories which the carts must have to be applied a cart discount.</p>\n<p>Exclude cart items by categories: Set the specific categories to which the carts must not have to be applied a cart discount.</p>\n<p>Include cart items by tags: Set tags which if the cart includes these tag products will get a cart discount.</p>\n<p>Exclude cart items by tags: Set tags which if the cart does not include these tag products will get a cart discount.</p>\n<ul>\n<li>Applied coupon:</li>\n</ul>\n<p>Include coupon: Set the specific Coupons which the carts must have to get a cart discount</p>\n<p>Exclude coupon: Set the specific Coupons which the carts must have to get a cart discount</p>\n<ul>\n<li>Billing address:</li>\n</ul>\n<p>Include billing countries: Set the specific countries in which the carts must have these billing countries to apply a cart discount</p>\n<p>Exclude billing countries: Set the specific countries in which the carts must not have these billing countries to apply a cart discount</p>\n<ul>\n<li>Shipping address:</li>\n</ul>\n<p>Include shipping countries: Set the specific countries which the carts must have these shipping countries to apply a cart discount</p>\n<p>Exclude shipping countries: Set the specific countries which the carts must not have these shipping countries to apply a cart discount</p>\n<ul>\n<li>\n<p><strong>Set up customer conditions to apply the cart discount rule</strong>: Offer a cart discount matched with user roles or users you set, available:</p>\n</li>\n<li>\n<p>Customer information:</p>\n</li>\n</ul>\n<p>Logged-in users: Apply a cart discount to users who are logged in or not. There are 2 options: Yes or No for who logged in, and non-logged in, respectively.</p>\n<p>Include user role: Apply a cart discount to these user roles that you assign.</p>\n<p>Exclude user role: Apply a cart discount to all except these user roles you assign.</p>\n<p>Include user: Apply a cart discount to these users you assign.</p>\n<p>Exclude user: Apply a cart discount to all except these users you assign.</p>\n<ul>\n<li>Order history:</li>\n</ul>\n<p>Order status: Select respective order statuses to get a cart discount.</p>\n<p>Order count: Select the ordered date range and the ordered quantity to get a cart discount.</p>\n<p>Order total: Select the ordered date range and the ordered total to get a cart discount</p>\n<p>Has last order: Options to apply a cart discount for the order before or after a specific day.</p>\n<ul>\n<li>Purchased products:</li>\n</ul>\n<p>Include purchased products: Fill in the products which if the customer has purchased before will get a cart discount</p>\n<p>Exclude purchased products: Fill in the products which if the customer has purchased before will not get a cart discount</p>\n<p>Exclude purchased categories: Fill in the categories which if the customer has purchased before will not get a cart discount</p>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a></p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a></p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a></p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a></p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a></p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a></p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a></p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a></p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a></p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a></p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a></p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a></p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a></p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a></p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a></p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a></p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a></p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a></p>\n<h3>Documentation</h3>\n<p>&#9658; <a href=\"https://docs.villatheme.com/?item=redis\" rel=\"nofollow ugc\">Getting Started</a></p>\n<h3>Plugin Links</h3>\n<p>&#9658; <a href=\"https://villatheme.com/extensions/redis-woocommerce-dynamic-pricing-and-discounts/\" rel=\"nofollow ugc\">Project Page</a><br />\n&#9658; <a href=\"https://docs.villatheme.com/?item=redis\" rel=\"nofollow ugc\">Documentation</a><br />\n&#9658; <a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/redis-woo-dynamic-pricing-and-discounts.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/redis-woo-dynamic-pricing-and-discounts/assets/screenshot-1.png?rev=2650295",
            "caption": "Display discount price on the products page"
        },
        {
            "src": "https://ps.w.org/redis-woo-dynamic-pricing-and-discounts/assets/screenshot-2.png?rev=2650295",
            "caption": "Display discount price on the products list"
        },
        {
            "src": "https://ps.w.org/redis-woo-dynamic-pricing-and-discounts/assets/screenshot-3.png?rev=2650295",
            "caption": "Cart discount"
        }
    ],
    "tags": {
        "dynamic-pricing-woocommerce": "dynamic pricing woocommerce",
        "woo-discount-rules": "woo discount rules",
        "woocommerce-bulk-discount": "woocommerce bulk discount",
        "woocommerce-discount": "woocommerce discount",
        "woocommerce-dynamic-pricing-discounts": "woocommerce dynamic pricing &amp; discounts"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://www.villatheme.com/donate",
    "banners": {
        "low": "https://ps.w.org/redis-woo-dynamic-pricing-and-discounts/assets/banner-772x250.jpg?rev=3081764",
        "high": "https://ps.w.org/redis-woo-dynamic-pricing-and-discounts/assets/banner-1544x500.jpg?rev=3081764"
    },
    "icons": {
        "1x": "https://ps.w.org/redis-woo-dynamic-pricing-and-discounts/assets/icon-128x128.gif?rev=3081764",
        "2x": "https://ps.w.org/redis-woo-dynamic-pricing-and-discounts/assets/icon-256x256.gif?rev=3081764"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 84,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/redis-woo-dynamic-pricing-and-discounts/blueprint.json?rev=3103395"
        }
    ],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "redis-woo-dynamic-pricing-and-discounts",
            "language": "vi",
            "version": "1.0.13",
            "updated": "2024-06-13 07:37:42",
            "package": "http://downloads.wordpress.org/translation/plugin/redis-woo-dynamic-pricing-and-discounts/1.0.13/vi.zip"
        }
    ]
}