{
    "name": "ReDi Restaurant Reservation",
    "slug": "redi-restaurant-reservation",
    "version": "24.0730",
    "author": "<a href=\"https://landing.reservationdiary.eu\">Reservation Diary</a>",
    "author_profile": "https://profiles.wordpress.org/thecatkin/",
    "contributors": {
        "thecatkin": {
            "profile": "https://profiles.wordpress.org/thecatkin/",
            "avatar": "https://secure.gravatar.com/avatar/41cf65a0b68a6ef868aab77210d4ef3c?s=96&d=monsterid&r=g",
            "display_name": "catkin"
        }
    },
    "requires": "5.0.0",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 90,
    "ratings": {
        "5": 23,
        "4": 1,
        "3": 0,
        "2": 0,
        "1": 3
    },
    "num_ratings": 27,
    "support_url": "https://wordpress.org/support/plugin/redi-restaurant-reservation/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 75857,
    "last_updated": "2024-07-30 9:45am GMT",
    "added": "2013-01-17",
    "homepage": "https://landing.reservationdiary.eu",
    "sections": {
        "description": "<p>Restaurant reservations are made easy and quick. Receive and accept online client reservations. Display available spaces at a specific time. Allow instant client reservations, with personalized notifications about the reservation status. In short, convert website visitors into restaurant guests.</p>\n<p><a href=\"https://www.youtube.com/watch?v=DmU4K8jbjBU\" rel=\"nofollow ugc\">Introduction video of the plugin</a><br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/DmU4K8jbjBU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><a href=\"https://youtu.be/ms6VO9-4RFA\" rel=\"nofollow ugc\">Overview of the plugin</a><br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ms6VO9-4RFA?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Focus on your business and don’t waste time reading emails to confirm reservations manually. ReDi Restaurant Reservation is a fully automated reservation system. Everything is done without human involvement.</p>\n<p>You may easily handle reservations for your restaurant using the ReDi Restaurant Reservation plugin. This plugin facilitates online customer reservations, your clients can view available space at a predetermined time and make reservations with instant confirmation.<br />\nSimply, configure the maximum number of reservations per person, the hours of operation, and the restaurant information. That’s it!</p>\n<p>So. looking for the fastest and most simple restaurant reservation WordPress plugin? You are in the right place!</p>\n<p>Get the plugin downloaded first. The process is quite simple.</p>\n<ul>\n<li>Go to your WordPress website from the backend. </li>\n<li>Click on Plugins &gt; Add New. </li>\n<li>On the search line, type “ReDi Restaurant Reservation.”</li>\n<li>Click on Install &gt; Activate. </li>\n</ul>\n<p>Start your WordPress restaurant reservation page, <strong>with 3 steps:</strong></p>\n<ul>\n<li>Register &amp; Generate/Create the API key.</li>\n<li>Check the new Reservation page (it automatically creates a reservation page after registration).</li>\n<li>Make all the necessary configurations and customizations.</li>\n</ul>\n<p>It is not unexpected that there is an increase in demand for online restaurant reservations because most of us spend more than 24 hours per week using our mobile devices. So a <strong>credible restaurant reservation system</strong> is a must for a successful business, don’t you agree?</p>\n<p>The benefits of using a restaurant reservation system, such as ReDi, are numerous:</p>\n<ul>\n<li><strong>Increase Conversion Rates:</strong> Extensive and catchy CTA’s (calls to action) help to increase conversions and offer visitors immediate restaurant reservations.</li>\n<li><strong>Save Time:</strong> As far as ReDi is fully automated it will save a lot of time from your workers, which can be used on other things.</li>\n<li><strong>Additional Analytics:</strong> Track the website visitors and reservation data to make more result-based decisions for your business.</li>\n<li><strong>Satisfied Clients:</strong> In the age of technology clients prefer to have everything easy and quick at hand. That’s why online restaurant reservations will greatly boost customer satisfaction.</li>\n<li><strong>Capture Abandoning Customers:</strong> Without an instant reservation confirmation, a visitor will most probably go to a few more restaurants to make a reservation. Thus, the restaurant may lose that client.</li>\n</ul>\n<h3>REDI RESTAURANT RESERVATION PLUGIN FEATURES, ADD-ONS, AND ADVANTAGES</h3>\n<h4>KEY FEATURES</h4>\n<p>The ReDi Restaurant Reservation plugin works well for all types of businesses, including little cafés, bars, and large restaurants. The plugin includes several helpful functions and highlights.</p>\n<h4>INSTANT CONFIRMATION</h4>\n<p>Checking and confirming availability in an instant without any delays. This ReDi feature is one in its category, other reservation plugins are missing this availability. That’s why it makes ReDi stand out in the market.</p>\n<h4>RESERVATION FORM</h4>\n<p>Reservation form available for all devices (mobile, tablet, PC, etc.), allowing visitors to view all of the available reservations for that day.</p>\n<h4>RESTAURANT CAPACITY CONTROL</h4>\n<p>The ability to control and set a maximum number of seats based on the weekday.<br />\nShow the restaurant timing: when and how long your restaurant is open and working (also set multiple open/close times a day).</p>\n<h4>BLOCKED TIME</h4>\n<p>Establish a specified timeframe from which bookings can no longer be accepted.</p>\n<h4>EMAIL CONFIRMATION</h4>\n<p>Fully customizable and multilingual email templates to send instant confirmation letters to clients.</p>\n<ul>\n<li>All these features prove Redi is not a simple reservation solution, but powerful software that allows checking various aspects before making a confirmation, such as: </li>\n<li>Is the restaurant open on that day/hour?</li>\n<li>Is the restaurant&#8217;s capacity enough for receiving guests?</li>\n<li>Can the kitchen serve guests without delays?</li>\n<li>Are there free seats available?</li>\n</ul>\n<p>Thus, it provides the fastest availability check and confirmation.</p>\n<h3>ADDITIONAL SERVICES</h3>\n<p>Also, the ReDi restaurant booking system offers additional restaurant reservation features and services by request, and the price of those varies from business to business. Some examples of other services include:</p>\n<h4>FACEBOOK INTEGRATION</h4>\n<p>Use Facebook for your business and turn your Facebook fans into clients. Moreover, you can further enhance your business experience with Facebook integration, and we will provide you with the profile pictures of your customers if found. When a consumer visits, especially on their first visit, you might impress them by recognizing their face.</p>\n<h4>WHITE LABELING</h4>\n<p>Upon request, you can get white-labeled reservation applications for Facebook Application, iPhone/iPad Application, Windows Phone Application, or Android Application.</p>\n<p>Please send a request by email: <a href=\"mailto:info@reservationdiary.eu\" rel=\"nofollow ugc\">info@reservationdiary.eu</a> or through our contact form: <a href=\"https://reservationdiary.eu/contact/\" rel=\"nofollow ugc\">reservationdiary.eu/contact</a></p>\n<h4>RESTAURANT FEEDBACK</h4>\n<p>Do you want to know what your clients think about their last sit? Are they satisfied with your service? We will get that info for you. Our plugin allows feedback collection to know the impressions of your clients from their last visit.</p>\n<h4>REMINDER EMAILS</h4>\n<p>Send fully personalized reservation reminder emails to your clients and remind them about upcoming reservations.</p>\n<h4>PRE-PAYMENT SERVICES</h4>\n<p>Pre-payment services. Many clients may reserve a seat and forget to show up, even after the reservation reminder email. So, to motivate them to show up or not lose profits if they do not, you can set pre-payment services for reservations.</p>\n<p>This plugin emphasizes simplicity. However still offers everything you need, even some additional useful services.</p>\n<h4>BIRTHDAY PROMOTIONS AND RESERVATIONS</h4>\n<p>With the integration of MailChimp, you may send birthday promos or invites to return to your restaurant.</p>\n<h3>FREE VERSION</h3>\n<p>The free version allows:</p>\n<ul>\n<li>Instant Availability check in a matter of seconds.</li>\n<li>Both instant &amp; manual confirmation.</li>\n<li>Custom fields &amp; Awaiting List System.</li>\n<li>Also, you can easily send confirmation emails.</li>\n<li>Reservations are limited to 100 guests per month.</li>\n</ul>\n<h3>BASIC VERSION</h3>\n<p>The Basic Version costs 19 EUR + VAT* per month.</p>\n<ul>\n<li><strong>VAT</strong> is applied to businesses and residents of the EU. VAT rate depends on the country where the customer is located. 0% VAT is applied when an EU VAT number is provided.</li>\n</ul>\n<p>The basic plan offers features such as:</p>\n<ul>\n<li>Everything listed in the free version </li>\n<li>No reservation limits per months</li>\n<li>Amazing and full-featured, yet simple in-usage dashboard for reservation management </li>\n<li>You can enter multiple working hours per day</li>\n<li>Reports &amp; overall statistics </li>\n<li>More customization options, especially when it comes to email templates</li>\n<li>The dashboard allows you to put daily notes and any other comments inside </li>\n<li>Feedback request that users who visited the restaurant get after their visit. This feature is quite useful as good feedback will motivate you; meanwhile, some construction criticism will give you a basis for further improvement plan implementation. </li>\n<li>Reservation export option (CSV) that can be easily opened with Excel.</li>\n<li>Personal Demo of how the plugin works for clients.</li>\n<li>Also, you get a 30-day free trial period to check the Basic Version’s features.</li>\n</ul>\n<h3>ADDONS</h3>\n<p>So, with a one-time payment, you will get the following features:</p>\n<ul>\n<li>Pre-payment for the reservations so that clients feel more responsible. </li>\n<li>Discount functionality.</li>\n<li>Integrations with Facebook, MailChimp, Sendinblue, BulkSMS, and others, will work perfectly fine for email marketing and notification campaigns. </li>\n</ul>\n<p>Plugins and add-ons can be purchased from our landing page. <a href=\"https://landing.reservationdiary.eu/\" rel=\"nofollow ugc\">Open the landing page.</a></p>\n<h3>ADVANTAGES AND BENEFITS</h3>\n<p>Along with the centralized and fully remote restaurant booking system, restaurant owners and managers from more than 90 countries in the world can control everything from any place they wish. Moreover, the Redi Restaurant plugin completely solves the language problems between the customers and restaurant staff.</p>\n<p>Now, let’s see other benefits of the Redi Restaurant plugin:</p>\n<ul>\n<li>The plugin is available in multiple languages (including Spanish, Italian, Portuguese, Russian, and many more). Plus, you can add a language on request by contacting info@reservationdiary.eu or through our contact form: reservation diary. EU/contact.</li>\n<li>Reservations are handled entirely automatically by the plugin.</li>\n<li>Create fully customized reservation forms for your website with the CSS code.</li>\n<li>Compatible and responsive reservation form that works perfectly on all devices.</li>\n<li>Easy to install and manage</li>\n<li>Quick automated response to your client</li>\n<li>When a customer&#8217;s request is approved, send a copy of the confirmation to them through email.</li>\n<li>Receive alerts each time a new reservation is made.</li>\n</ul>\n<h3>ADDITIONAL RESOURCES</h3>\n<ul>\n<li>You can check more info about us on our website: reservation diary.eu</li>\n<li>See our video tutorials on youtube <a href=\"https://www.youtube.com/channel/UCvMNupiAUT7enwnDhgrbKOg\" rel=\"nofollow ugc\">Video tutorials</a></li>\n<li>Check out our recent news on a <a href=\"https://www.facebook.com/ReDiReservation\" rel=\"nofollow ugc\">Facebook page</a></li>\n</ul>\n<h4>Supported languages</h4>\n<ul>\n<li>Català</li>\n<li>Czeck</li>\n<li>Danish</li>\n<li>Deutsch</li>\n<li>English</li>\n<li>Español</li>\n<li>Eesti</li>\n<li>Français, <a href=\"http://www.youtube.com/watch?v=MWJKx7onpBs\" rel=\"nofollow ugc\">check out video review</a></li>\n<li>Italiano</li>\n<li>Latvian</li>\n<li>Lithuanian</li>\n<li>Magyar</li>\n<li>Nederlands</li>\n<li>Norwegian</li>\n<li>Polski</li>\n<li>Português</li>\n<li>Türkçe</li>\n<li>Slovak</li>\n<li>Svenska</li>\n<li>Suomi</li>\n<li>Русский</li>\n<li>עברית (Hebrew)</li>\n<li>日本語 (Japanese)</li>\n</ul>\n<p>If you need more languages, please contact us by email: <a href=\"mailto:info@reservationdiary.eu\" rel=\"nofollow ugc\">info@reservationdiary.eu</a> or through our contact form: <a href=\"https://reservationdiary.eu/contact/\" rel=\"nofollow ugc\">reservationdiary.eu/contact</a></p>\n<h4>Basic package functionality</h4>\n<ul>\n<li>View your upcoming reservations from your Mobile/Tablet PC and never miss your customer. This page should be open on a Tablet PC and so hostess can see all upcoming reservations for today. Page refreshes every 15 min and shows reservations that in past for 3 hours as well as upcoming reservations for next 24 hours. By clicking on reservation you will see reservation details. Demo version can be accessed using this link: <a href=\"https://reservationdiary.eu/free-demo/\" rel=\"nofollow ugc\">reservationdiary.eu/free-demo</a></li>\n<li>Setup maximum available seats for online reservation by week day</li>\n<li>Open times. This option will enable you to choose between various working hours whichever is most convenient to you.</li>\n<li>Support for multiple places. Number of places depends on number of subscriptions.</li>\n<li>Blocked Time. Define time range when online reservation should not be accepted. Specify a reason why reservations are not accepted at this time to keep your clients happy.</li>\n<li>Send client reservation confirmation emails from WordPress account</li>\n<li>Email template customization for all supported languages</li>\n</ul>\n<p>Plugin and addonds can be purchased from our landing page. <a href=\"https://landing.reservationdiary.eu/\" rel=\"nofollow ugc\">Open landing page.</a></p>\n<h4>Additional services (by request)</h4>\n<ul>\n<li>Use your Facebook account for your business. Make clients from your Facebook fans. <a href=\"http://www.slideshare.net/sergeiprokopov/make-clients-from-your-facebook-fans\" rel=\"nofollow ugc\">View presentation.</a></li>\n<li>We can offer you white labeled restaurant reservation application for Facebook Application, iPhone/iPad Application, Windows Phone Application or Android Application. Please send request by email: <a href=\"mailto:info@reservationdiary.eu\" rel=\"nofollow ugc\">info@reservationdiary.eu</a> or through our contact form: <a href=\"https://reservationdiary.eu/contact/\" rel=\"nofollow ugc\">reservationdiary.eu/contact</a></li>\n<li>Enhance your business experience by using our Facebook integration service where we try to provide you with profile pictures of your customers if found. You can amaze your customer by knowing him by face when he visits you, especially at the time of first visit.</li>\n<li>Do you want to know what your client thinks about his last visit? We will collect it for you.</li>\n<li>Remind your customer about upcoming reservation via Email or by SMS. More information here: <a href=\"https://reservationdiary.eu/pricing/\" rel=\"nofollow ugc\">reservationdiary.eu/pricing</a></li>\n<li>Collect pre-payment for reservations</li>\n<li>Discouns per reservation module </li>\n<li>Send birthday promotions or reminders to visit your restaurant again with MailChimp integration. More information here: <a href=\"https://reservationdiary.eu/pricing/\" rel=\"nofollow ugc\">reservationdiary.eu/pricing</a></li>\n<li>If you are building a catalogue of restaurants and looking for the perfect reservation plugin for it, we can provide it to you. Just let us know through contact form: <a href=\"https://reservationdiary.eu/contact/\" rel=\"nofollow ugc\">reservationdiary.eu/contact</a></li>\n<li>Do you want to write your own module? We have an API. Contact us to get more information. Contact form: <a href=\"https://reservationdiary.eu/contact/\" rel=\"nofollow ugc\">reservationdiary.eu/contact</a></li>\n</ul>\n<p>If you would like to add some new functionality or have any other queries, please contact us by email: <a href=\"mailto:info@reservationdiary.eu\" rel=\"nofollow ugc\">info@reservationdiary.eu</a> or through our contact form: <a href=\"https://reservationdiary.eu/contact/\" rel=\"nofollow ugc\">reservationdiary.eu/contact</a></p>\n",
        "installation": "<ol>\n<li>Click on &#8220;Install now&#8221; to install plugin</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n<li>Go to Settings/Redi Restaurant Reservation page</li>\n<li>Follow instructions on the page to setup plugin</li>\n</ol>\n<p>When plugin is activated, new page is automatically created and you can make your first reservation straight away. You can also create page manually and enter [redirestaurant] short code. Plugin is based on a public <a href=\"http://www.reservationdiary.eu/eng/reservation-wordpress-plugin\" rel=\"nofollow ugc\">ReservationDiary API</a>. We do not share any of our user&#8217;s information with third parties.<br />\nIn case you have any problems with plugin installation or you need some customization, please don&#8217;t hesitate to contact us by email: <a href=\"mailto:info@reservationdiary.eu\" rel=\"nofollow ugc\">info@reservationdiary.eu</a></p>\n",
        "changelog": "<p>= 24.0730<br />\n* Bugfux in plugin activation</p>\n<p>= 24.0726<br />\n* Scroll calendar to first available month<br />\n* Fixed loading of alternative time settings</p>\n<p>= 24.0712<br />\n* Fixed Broken Access Control vulnerability<br />\n* Fixed issues when admin page brakes for French translation<br />\n* Updated according to Plugin Check recommendations</p>\n<p>= 24.0422<br />\n* Support for multilingual text in message for large groups and fully booked message<br />\n* Updated catalan translation<br />\n* Fixed issue with changing and modifying places</p>\n<p>= 24.0303<br />\n* Fixed XSS vulnerability injection in admin panel</p>\n<p>= 24.0128<br />\n* Added option to control if reason is required when guest is canceling reservation</p>\n<p>= 23.1219<br />\n* Added more options to alternative time step, 10 min and 20 min</p>\n<p>= 23.1124<br />\n* Added open time validation settings<br />\n* Hide unnecessary form elements for cancel reservation, when one required fields is filled in</p>\n<p>= 23.1106<br />\n* Removed nonce check for reservation form<br />\n* Improved admin setting form validation<br />\n* Added subscribe to newsletter box</p>\n<p>= 23.0926<br />\n* Email Sending Update: Now, when an email is sent, the plugin will use the email address configured in the plugin settings instead of the WordPress admin email.<br />\n* Enhanced Welcome Page: We have enhanced the welcome page to include convenient links for obtaining personalized assistance and connecting with us through our social channels.<br />\n* Admin Settings Page Makeover: The admin settings page has been given a fresh, redesigned look for improved user experience.<br />\n* Translation Support: We&#8217;ve introduced support for a translation folder located outside of the plugin. This means that with each update, your translations will remain intact, ensuring a seamless multilingual experience.</p>\n<p>= 23.0907<br />\n* Added Lithuanian and Latvian languages. Updated French translation<br />\n* Added Select place option when there more than one restaurant</p>\n<p>= 23.0629<br />\n* Fine tuned registration flow<br />\n* Added collecting feedback about reservation experience and plugin usage for future plugin improvements<br />\n* Fixed security finding<br />\n* Added nonce check for CSRF<br />\n* Added permission check for changes in admin settings<br />\n* Added page to reconfirm reservation by guest before on a day of visiting restaurant</p>\n<h4>23.0211</h4>\n<ul>\n<li>Added support for reservation duration when there are multiple restaurants on one page</li>\n</ul>\n<h4>23.0123</h4>\n<ul>\n<li>Fixed bug: After first plugin installation generate API Key by email gives an error.</li>\n<li>Fixed bug: When calendar is in popup mode, and dates are loaded, then the user has to open it again.</li>\n<li>Fixed bug: After installation, by default reservation page does not show success page.</li>\n<li>After installation by default calendar is click to show, changed to show always.</li>\n<li>Timeshift normal mode is hidden for new installations</li>\n<li>TimePicker type setting is hidden for new installations</li>\n<li>Fixed bug: Cancel reservation error in wordpress.</li>\n<li>Pre-selection of the country in the settings after the first installation.</li>\n<li>Fixed bug: When saving settings after installing the plugin, an error occurred.</li>\n</ul>\n<h4>22.1130</h4>\n<ul>\n<li>Reverted settings block with time shift</li>\n</ul>\n<h4>22.1117</h4>\n<ul>\n<li>Fixed calendar to disable closed days</li>\n</ul>\n<h4>22.1018</h4>\n<ul>\n<li>Fixed custom fields appearance</li>\n<li>Fixed hide steps setting default value</li>\n<li>Updated Spanish translation</li>\n</ul>\n<h4>22.1017</h4>\n<ul>\n<li>Added support for discount addon</li>\n<li>Changed date parsing from gmdate to date</li>\n<li>Changed the way local time is obtained</li>\n</ul>\n<h4>22.1016</h4>\n<ul>\n<li>fixed date format when submitting waitlist form </li>\n<li>split into multiple files so that loco translate picks files that is less than 100kb</li>\n<li>added separated setting for email via SMTP</li>\n<li>removed session init</li>\n<li>updated calendar to show fully booked days</li>\n<li>check box custom fiels extended to have default values</li>\n<li>changed order between date and guests</li>\n<li>fixed option to collect phone number with country code</li>\n<li>added possibility to define later reservation time in minutes, hours and days </li>\n</ul>\n<h4>22.0322</h4>\n<ul>\n<li>fixed reservation form for iPad and Safari browser</li>\n</ul>\n<h4>22.0303</h4>\n<ul>\n<li>fixed date bug in wait list</li>\n<li>updated local time preview in admin settings</li>\n<li>added video for Reservation Form settings and Reservation settingsadded video for Reservation Form settings and Reservation settings</li>\n<li>added more videos for settings</li>\n<li>added support for flexible reservation duration time per time block</li>\n<li>updated time format on modify reservation page</li>\n</ul>\n<h4>21.0819</h4>\n<ul>\n<li>Added First/Last name enable option</li>\n<li>Added Phone number country flag disable options</li>\n<li>Updated/Shown &#8216;End reservation time&#8217; front end during reservation</li>\n<li>Added video instructions</li>\n<li>Added link to documentation</li>\n<li>Reorganized place reservation settings</li>\n</ul>\n<h4>21.0601</h4>\n<ul>\n<li>Renamed Upcoming to Waiter Dashboard</li>\n<li>Added return back to WordPress admin dashboard from Basic package settings and Waiter Dashboard</li>\n</ul>\n<h4>21.0524</h4>\n<ul>\n<li>Updated custom fields</li>\n<li>Added new custom field Birthday for using in promotions</li>\n<li>Fixed new key warning</li>\n</ul>\n<h4>21.0503</h4>\n<ul>\n<li>Removed unneeded folders and files</li>\n<li>Removed settings iframes</li>\n<li>Removed diagnostics data collection</li>\n<li>Added data sanitization</li>\n<li>Updated calling of files locations</li>\n<li>Renamed constants to plugin specific</li>\n</ul>\n<h4>21.0426</h4>\n<ul>\n<li>Fixed XSS vulnarability</li>\n</ul>\n<h4>21.0307</h4>\n<ul>\n<li>Added Català language</li>\n<li>Added link to videos</li>\n<li>Updated German translations</li>\n<li>Sorted admin settings</li>\n<li>Added information where reservation was created</li>\n<li>Fixed session creation</li>\n</ul>\n<h4>20.0810</h4>\n<ul>\n<li>Select number of guests instead of pre-selected value</li>\n</ul>\n<h4>20.0727</h4>\n<ul>\n<li>Settings to set max time before reservation in hours and days</li>\n<li>Custom fields as dropdown and options</li>\n</ul>\n<h4>20.0608</h4>\n<ul>\n<li>Fixed date format when changing places</li>\n<li>Added option to show seats left when time is selected</li>\n<li>Extended size in database for custom fields</li>\n</ul>\n<h4>20.0516</h4>\n<ul>\n<li>Added edit reservation form</li>\n<li>Fixed entry to wait list</li>\n<li>Save custom field to local database</li>\n</ul>\n<h4>20.0402</h4>\n<ul>\n<li>Save reservations to local database</li>\n<li>International phone number selection</li>\n<li>Added captcha</li>\n<li>Added children drop down</li>\n<li>Allow to customize fully booked message</li>\n<li>Improved first available date selection</li>\n<li>Allow to enter into waitlist when part of the day is closed</li>\n</ul>\n<h4>20.0315</h4>\n<ul>\n<li>Added login via social network accounts on reservation form</li>\n</ul>\n<h4>20.0312</h4>\n<ul>\n<li>Fixed cancel reservation form</li>\n</ul>\n<h4>20.0229</h4>\n<ul>\n<li>When plugin is not working user can send direct email to restaurant</li>\n<li>Fixed custom fields issue when there are multiple restaurants</li>\n<li>Added option to enable/disable cancel reservation form</li>\n<li>Improved reservation form auto-complete</li>\n<li>Moved logic of showing available times to script</li>\n</ul>\n<h4>19.1220</h4>\n<ul>\n<li>Added support to override default reservation confirmation page</li>\n</ul>\n<h4>19.1126</h4>\n<ul>\n<li>Fixed blocked dates with new line in reason</li>\n</ul>\n<h4>19.1030</h4>\n<ul>\n<li>Added field for time to wait list form</li>\n</ul>\n<h4>19.1003</h4>\n<ul>\n<li>Fixed issue with waitlist and gdpr checkbox</li>\n<li>Fixed blocked dates when &#8216; is included in reason</li>\n</ul>\n<h4>19.0914</h4>\n<ul>\n<li>Removed extra slash from path</li>\n<li>Fixed wait list to not pickup custom fields validations</li>\n<li>Blocked wait list for current day</li>\n<li>Added support for overriding frontend file and styles file from current theme directory</li>\n<li>Added phone to wait list</li>\n<li>Added GDPR checkbox to wait list</li>\n</ul>\n<h4>19.0513</h4>\n<ul>\n<li>Added Wait List feature, that allows guests to enter their information when fully busy</li>\n</ul>\n<h4>19.0302</h4>\n<ul>\n<li>Excluded custom fields from printing when specified</li>\n</ul>\n<h4>19.0224</h4>\n<ul>\n<li>Added tool tip to calendar for disabled dates</li>\n<li>Replaced Email field to Email, Phone or Name on cancel reservation form</li>\n<li>Allow to pre-populate fields in reservation form from the link</li>\n<li>Added new parameter to custom fields to exclude parameter from printing</li>\n<li>Added possibility to change API key </li>\n</ul>\n<h4>18.1003</h4>\n<ul>\n<li>Improved reducing number of seats without losing reservations</li>\n</ul>\n<h4>18.0610</h4>\n<ul>\n<li>Fixed updating disabled dates in calendar when place is changed in dropdown</li>\n<li>Changed &#8220;allow to contact by SMS&#8221;, &#8220;Send newsletter and promotion&#8221;, &#8220;Reminder&#8221; checkbox default values to unchecked to comply with GDPR </li>\n</ul>\n<h4>18.0322</h4>\n<ul>\n<li>Fixed issue with missing custom fields</li>\n</ul>\n<h4>18.0225</h4>\n<ul>\n<li>Added specific field types for SMS/Email reminders</li>\n<li>Added more strict validation for Phone number</li>\n</ul>\n<h4>17.0114</h4>\n<ul>\n<li>Fixed check of available time when minimum number of guests is more than one</li>\n<li>Added reservation number to thank you page</li>\n<li>Disabled in calendar non-working days. Limited calendar max time to 1 year.</li>\n<li>Added support for manual reservations</li>\n<li>Added Norwegian translation</li>\n<li>Scroll to top of the form instead of page to support single page sites</li>\n<li>Added no translate directive to fix Google translate issues</li>\n</ul>\n<h4>15.0422</h4>\n<ul>\n<li>Fixed cancel reservation with space in number</li>\n<li>Changed country from free form field to dropdown</li>\n<li>New variation is added to plugin, that displays all possible times for selected date</li>\n<li>Updated list of languages and translation</li>\n<li>Added diagnostics for installation troubleshooting</li>\n<li>Added support for translation to Upcoming Reservations TabletPC version</li>\n<li>Added description to each setting</li>\n<li>Added widget to collect new feature requests</li>\n<li>Disable blocked dates in calendar</li>\n<li>Added list of reservations</li>\n</ul>\n<h4>14.0904</h4>\n<ul>\n<li>Extended view for basic package settings</li>\n<li>Removed warnings</li>\n<li>Improved error handling during first registration</li>\n<li>Added support for Email CC for reservation notifications</li>\n</ul>\n<h4>14.0630</h4>\n<ul>\n<li>Limit maximum time before reservation</li>\n<li>Fixed warnings</li>\n<li>Fixed upcoming reservation list</li>\n<li>New style for upcoming reservation email</li>\n<li>Increased time out for API call</li>\n<li>Added check for comments size</li>\n</ul>\n<h4>14.0511</h4>\n<ul>\n<li>Added settings to select Min and Max party size</li>\n<li>Added message to client when he select Large group</li>\n<li>Added setting to specify alternative time step</li>\n<li>Added Portuguese (Brazil) translation</li>\n<li>Added Swedish translation</li>\n<li>Fixed multi language support</li>\n<li>Fixed time displayed in drop down</li>\n<li>Removed line brakes from javascript to prevent WordPress inserting p elements there when content formatting is turned on</li>\n<li>Removed direct dependency from curl library</li>\n<li>Added Google Analytic Tracking Code to thank you page</li>\n<li>Add extra attribute to br to prevent controls displacement</li>\n<li>Added ability to cancel reservation by client</li>\n<li>Added possibility to override errors returned by API</li>\n<li>New client reservation confirmation email template</li>\n</ul>\n<h4>14.0221</h4>\n<ul>\n<li>Added alternative time picker for better reservation time selection on mobile devices</li>\n<li>Added limits to text areas</li>\n<li>Moved all texts to language files</li>\n</ul>\n<h4>14.0114</h4>\n<ul>\n<li>Added support for multiple places (for basic package users)</li>\n<li>Added better error handling to Admin console</li>\n<li>Changed style of confirmation message</li>\n<li>Scroll up page to confirmation message</li>\n<li>Set calendar style to display on top of all elements</li>\n<li>Moved cancel functionality to separated Tab</li>\n<li>Fixed double click on reservation</li>\n<li>Fixed manual date input</li>\n</ul>\n<h4>13.1022</h4>\n<ul>\n<li>Added setting for maximum persons per reservation</li>\n<li>Added support for custom fields that user should fill during reservation</li>\n<li>Added Polish language</li>\n</ul>\n<h4>13.0919</h4>\n<ul>\n<li>Added Portuguese language</li>\n<li>Added German language</li>\n<li>Refactored calendar localization support to work on PHP 5.2 version</li>\n<li>Improved error handling</li>\n</ul>\n<h4>13.0817</h4>\n<ul>\n<li>Added calendar localization support</li>\n</ul>\n<h4>13.0815</h4>\n<ul>\n<li>Added cancel reservation from admin panel</li>\n</ul>\n<h4>13.0716</h4>\n<ul>\n<li>Added possibility to specify date format in emails</li>\n<li>Added to configuration reservation duration time</li>\n</ul>\n<h4>13.0625</h4>\n<ul>\n<li>Added timezone support</li>\n</ul>\n<h4>13.0618</h4>\n<ul>\n<li>Fixed problem with double escaping of &#8216; or \\ symbols</li>\n</ul>\n<h4>13.0530</h4>\n<ul>\n<li>Added Dutch translation</li>\n<li>Added Danish translation</li>\n<li>Added Spainish translation</li>\n</ul>\n<h4>13.0505</h4>\n<ul>\n<li>Added support for different time formats</li>\n</ul>\n<h4>13.0406</h4>\n<ul>\n<li>Added French translation</li>\n<li>Added possibility to provide Short and Full description about restaurant</li>\n<li>Added language selection for emails that are sent to administrator</li>\n<li>Added configuration of minimum time in hours before reservation</li>\n</ul>\n<h4>13.0316</h4>\n<ul>\n<li>Fixed incompatibility with plugins that resides on same page</li>\n<li>Added multi language support to reservation form</li>\n<li>Added translations on Russian and Estonian</li>\n</ul>\n<h4>13.0302</h4>\n<ul>\n<li>Fixed incompatibility with some themes</li>\n</ul>\n<h4>13.0203</h4>\n<ul>\n<li>Changed persons from free form text to drop down</li>\n<li>When user changes date, time or number of persons, form is closed and user has to check reservation availability with new form data</li>\n<li>Added required field validation on a client side</li>\n<li>When fully booked added information message</li>\n</ul>\n<h4>13.0128</h4>\n<ul>\n<li>Added settings saved message box to admin page</li>\n<li>Added check box that asks for permission to publish restaurant details into reservationdiary.eu catalogue</li>\n<li>Fixed pre populating of URL field in admin page</li>\n</ul>\n<h4>13.0119</h4>\n<ul>\n<li>Updated reservation confirmation text</li>\n<li>Selected reservation time highlighted with bold style</li>\n<li>Added loading icon</li>\n<li>Applied time zone of the general WordPress settings</li>\n<li>Removed links from confirmation email</li>\n</ul>\n<h4>13.0114</h4>\n<ul>\n<li>Initial version</li>\n</ul>\n"
    },
    "short_description": "Get your restaurant booming with the ReDi Reservation plugin! Simplify bookings, offer instant confirmations, and customize settings. Try today!",
    "description": "<p>Restaurant reservations are made easy and quick. Receive and accept online client reservations. Display available spaces at a specific time. Allow instant client reservations, with personalized notifications about the reservation status. In short, convert website visitors into restaurant guests.</p>\n<p><a href=\"https://www.youtube.com/watch?v=DmU4K8jbjBU\" rel=\"nofollow ugc\">Introduction video of the plugin</a><br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/DmU4K8jbjBU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><a href=\"https://youtu.be/ms6VO9-4RFA\" rel=\"nofollow ugc\">Overview of the plugin</a><br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ms6VO9-4RFA?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Focus on your business and don’t waste time reading emails to confirm reservations manually. ReDi Restaurant Reservation is a fully automated reservation system. Everything is done without human involvement.</p>\n<p>You may easily handle reservations for your restaurant using the ReDi Restaurant Reservation plugin. This plugin facilitates online customer reservations, your clients can view available space at a predetermined time and make reservations with instant confirmation.<br />\nSimply, configure the maximum number of reservations per person, the hours of operation, and the restaurant information. That’s it!</p>\n<p>So. looking for the fastest and most simple restaurant reservation WordPress plugin? You are in the right place!</p>\n<p>Get the plugin downloaded first. The process is quite simple.</p>\n<ul>\n<li>Go to your WordPress website from the backend. </li>\n<li>Click on Plugins &gt; Add New. </li>\n<li>On the search line, type “ReDi Restaurant Reservation.”</li>\n<li>Click on Install &gt; Activate. </li>\n</ul>\n<p>Start your WordPress restaurant reservation page, <strong>with 3 steps:</strong></p>\n<ul>\n<li>Register &amp; Generate/Create the API key.</li>\n<li>Check the new Reservation page (it automatically creates a reservation page after registration).</li>\n<li>Make all the necessary configurations and customizations.</li>\n</ul>\n<p>It is not unexpected that there is an increase in demand for online restaurant reservations because most of us spend more than 24 hours per week using our mobile devices. So a <strong>credible restaurant reservation system</strong> is a must for a successful business, don’t you agree?</p>\n<p>The benefits of using a restaurant reservation system, such as ReDi, are numerous:</p>\n<ul>\n<li><strong>Increase Conversion Rates:</strong> Extensive and catchy CTA’s (calls to action) help to increase conversions and offer visitors immediate restaurant reservations.</li>\n<li><strong>Save Time:</strong> As far as ReDi is fully automated it will save a lot of time from your workers, which can be used on other things.</li>\n<li><strong>Additional Analytics:</strong> Track the website visitors and reservation data to make more result-based decisions for your business.</li>\n<li><strong>Satisfied Clients:</strong> In the age of technology clients prefer to have everything easy and quick at hand. That’s why online restaurant reservations will greatly boost customer satisfaction.</li>\n<li><strong>Capture Abandoning Customers:</strong> Without an instant reservation confirmation, a visitor will most probably go to a few more restaurants to make a reservation. Thus, the restaurant may lose that client.</li>\n</ul>\n<h3>REDI RESTAURANT RESERVATION PLUGIN FEATURES, ADD-ONS, AND ADVANTAGES</h3>\n<h4>KEY FEATURES</h4>\n<p>The ReDi Restaurant Reservation plugin works well for all types of businesses, including little cafés, bars, and large restaurants. The plugin includes several helpful functions and highlights.</p>\n<h4>INSTANT CONFIRMATION</h4>\n<p>Checking and confirming availability in an instant without any delays. This ReDi feature is one in its category, other reservation plugins are missing this availability. That’s why it makes ReDi stand out in the market.</p>\n<h4>RESERVATION FORM</h4>\n<p>Reservation form available for all devices (mobile, tablet, PC, etc.), allowing visitors to view all of the available reservations for that day.</p>\n<h4>RESTAURANT CAPACITY CONTROL</h4>\n<p>The ability to control and set a maximum number of seats based on the weekday.<br />\nShow the restaurant timing: when and how long your restaurant is open and working (also set multiple open/close times a day).</p>\n<h4>BLOCKED TIME</h4>\n<p>Establish a specified timeframe from which bookings can no longer be accepted.</p>\n<h4>EMAIL CONFIRMATION</h4>\n<p>Fully customizable and multilingual email templates to send instant confirmation letters to clients.</p>\n<ul>\n<li>All these features prove Redi is not a simple reservation solution, but powerful software that allows checking various aspects before making a confirmation, such as: </li>\n<li>Is the restaurant open on that day/hour?</li>\n<li>Is the restaurant&#8217;s capacity enough for receiving guests?</li>\n<li>Can the kitchen serve guests without delays?</li>\n<li>Are there free seats available?</li>\n</ul>\n<p>Thus, it provides the fastest availability check and confirmation.</p>\n<h3>ADDITIONAL SERVICES</h3>\n<p>Also, the ReDi restaurant booking system offers additional restaurant reservation features and services by request, and the price of those varies from business to business. Some examples of other services include:</p>\n<h4>FACEBOOK INTEGRATION</h4>\n<p>Use Facebook for your business and turn your Facebook fans into clients. Moreover, you can further enhance your business experience with Facebook integration, and we will provide you with the profile pictures of your customers if found. When a consumer visits, especially on their first visit, you might impress them by recognizing their face.</p>\n<h4>WHITE LABELING</h4>\n<p>Upon request, you can get white-labeled reservation applications for Facebook Application, iPhone/iPad Application, Windows Phone Application, or Android Application.</p>\n<p>Please send a request by email: <a href=\"mailto:info@reservationdiary.eu\" rel=\"nofollow ugc\">info@reservationdiary.eu</a> or through our contact form: <a href=\"https://reservationdiary.eu/contact/\" rel=\"nofollow ugc\">reservationdiary.eu/contact</a></p>\n<h4>RESTAURANT FEEDBACK</h4>\n<p>Do you want to know what your clients think about their last sit? Are they satisfied with your service? We will get that info for you. Our plugin allows feedback collection to know the impressions of your clients from their last visit.</p>\n<h4>REMINDER EMAILS</h4>\n<p>Send fully personalized reservation reminder emails to your clients and remind them about upcoming reservations.</p>\n<h4>PRE-PAYMENT SERVICES</h4>\n<p>Pre-payment services. Many clients may reserve a seat and forget to show up, even after the reservation reminder email. So, to motivate them to show up or not lose profits if they do not, you can set pre-payment services for reservations.</p>\n<p>This plugin emphasizes simplicity. However still offers everything you need, even some additional useful services.</p>\n<h4>BIRTHDAY PROMOTIONS AND RESERVATIONS</h4>\n<p>With the integration of MailChimp, you may send birthday promos or invites to return to your restaurant.</p>\n<h3>FREE VERSION</h3>\n<p>The free version allows:</p>\n<ul>\n<li>Instant Availability check in a matter of seconds.</li>\n<li>Both instant &amp; manual confirmation.</li>\n<li>Custom fields &amp; Awaiting List System.</li>\n<li>Also, you can easily send confirmation emails.</li>\n<li>Reservations are limited to 100 guests per month.</li>\n</ul>\n<h3>BASIC VERSION</h3>\n<p>The Basic Version costs 19 EUR + VAT* per month.</p>\n<ul>\n<li><strong>VAT</strong> is applied to businesses and residents of the EU. VAT rate depends on the country where the customer is located. 0% VAT is applied when an EU VAT number is provided.</li>\n</ul>\n<p>The basic plan offers features such as:</p>\n<ul>\n<li>Everything listed in the free version </li>\n<li>No reservation limits per months</li>\n<li>Amazing and full-featured, yet simple in-usage dashboard for reservation management </li>\n<li>You can enter multiple working hours per day</li>\n<li>Reports &amp; overall statistics </li>\n<li>More customization options, especially when it comes to email templates</li>\n<li>The dashboard allows you to put daily notes and any other comments inside </li>\n<li>Feedback request that users who visited the restaurant get after their visit. This feature is quite useful as good feedback will motivate you; meanwhile, some construction criticism will give you a basis for further improvement plan implementation. </li>\n<li>Reservation export option (CSV) that can be easily opened with Excel.</li>\n<li>Personal Demo of how the plugin works for clients.</li>\n<li>Also, you get a 30-day free trial period to check the Basic Version’s features.</li>\n</ul>\n<h3>ADDONS</h3>\n<p>So, with a one-time payment, you will get the following features:</p>\n<ul>\n<li>Pre-payment for the reservations so that clients feel more responsible. </li>\n<li>Discount functionality.</li>\n<li>Integrations with Facebook, MailChimp, Sendinblue, BulkSMS, and others, will work perfectly fine for email marketing and notification campaigns. </li>\n</ul>\n<p>Plugins and add-ons can be purchased from our landing page. <a href=\"https://landing.reservationdiary.eu/\" rel=\"nofollow ugc\">Open the landing page.</a></p>\n<h3>ADVANTAGES AND BENEFITS</h3>\n<p>Along with the centralized and fully remote restaurant booking system, restaurant owners and managers from more than 90 countries in the world can control everything from any place they wish. Moreover, the Redi Restaurant plugin completely solves the language problems between the customers and restaurant staff.</p>\n<p>Now, let’s see other benefits of the Redi Restaurant plugin:</p>\n<ul>\n<li>The plugin is available in multiple languages (including Spanish, Italian, Portuguese, Russian, and many more). Plus, you can add a language on request by contacting info@reservationdiary.eu or through our contact form: reservation diary. EU/contact.</li>\n<li>Reservations are handled entirely automatically by the plugin.</li>\n<li>Create fully customized reservation forms for your website with the CSS code.</li>\n<li>Compatible and responsive reservation form that works perfectly on all devices.</li>\n<li>Easy to install and manage</li>\n<li>Quick automated response to your client</li>\n<li>When a customer&#8217;s request is approved, send a copy of the confirmation to them through email.</li>\n<li>Receive alerts each time a new reservation is made.</li>\n</ul>\n<h3>ADDITIONAL RESOURCES</h3>\n<ul>\n<li>You can check more info about us on our website: reservation diary.eu</li>\n<li>See our video tutorials on youtube <a href=\"https://www.youtube.com/channel/UCvMNupiAUT7enwnDhgrbKOg\" rel=\"nofollow ugc\">Video tutorials</a></li>\n<li>Check out our recent news on a <a href=\"https://www.facebook.com/ReDiReservation\" rel=\"nofollow ugc\">Facebook page</a></li>\n</ul>\n<h4>Supported languages</h4>\n<ul>\n<li>Català</li>\n<li>Czeck</li>\n<li>Danish</li>\n<li>Deutsch</li>\n<li>English</li>\n<li>Español</li>\n<li>Eesti</li>\n<li>Français, <a href=\"http://www.youtube.com/watch?v=MWJKx7onpBs\" rel=\"nofollow ugc\">check out video review</a></li>\n<li>Italiano</li>\n<li>Latvian</li>\n<li>Lithuanian</li>\n<li>Magyar</li>\n<li>Nederlands</li>\n<li>Norwegian</li>\n<li>Polski</li>\n<li>Português</li>\n<li>Türkçe</li>\n<li>Slovak</li>\n<li>Svenska</li>\n<li>Suomi</li>\n<li>Русский</li>\n<li>עברית (Hebrew)</li>\n<li>日本語 (Japanese)</li>\n</ul>\n<p>If you need more languages, please contact us by email: <a href=\"mailto:info@reservationdiary.eu\" rel=\"nofollow ugc\">info@reservationdiary.eu</a> or through our contact form: <a href=\"https://reservationdiary.eu/contact/\" rel=\"nofollow ugc\">reservationdiary.eu/contact</a></p>\n<h4>Basic package functionality</h4>\n<ul>\n<li>View your upcoming reservations from your Mobile/Tablet PC and never miss your customer. This page should be open on a Tablet PC and so hostess can see all upcoming reservations for today. Page refreshes every 15 min and shows reservations that in past for 3 hours as well as upcoming reservations for next 24 hours. By clicking on reservation you will see reservation details. Demo version can be accessed using this link: <a href=\"https://reservationdiary.eu/free-demo/\" rel=\"nofollow ugc\">reservationdiary.eu/free-demo</a></li>\n<li>Setup maximum available seats for online reservation by week day</li>\n<li>Open times. This option will enable you to choose between various working hours whichever is most convenient to you.</li>\n<li>Support for multiple places. Number of places depends on number of subscriptions.</li>\n<li>Blocked Time. Define time range when online reservation should not be accepted. Specify a reason why reservations are not accepted at this time to keep your clients happy.</li>\n<li>Send client reservation confirmation emails from WordPress account</li>\n<li>Email template customization for all supported languages</li>\n</ul>\n<p>Plugin and addonds can be purchased from our landing page. <a href=\"https://landing.reservationdiary.eu/\" rel=\"nofollow ugc\">Open landing page.</a></p>\n<h4>Additional services (by request)</h4>\n<ul>\n<li>Use your Facebook account for your business. Make clients from your Facebook fans. <a href=\"http://www.slideshare.net/sergeiprokopov/make-clients-from-your-facebook-fans\" rel=\"nofollow ugc\">View presentation.</a></li>\n<li>We can offer you white labeled restaurant reservation application for Facebook Application, iPhone/iPad Application, Windows Phone Application or Android Application. Please send request by email: <a href=\"mailto:info@reservationdiary.eu\" rel=\"nofollow ugc\">info@reservationdiary.eu</a> or through our contact form: <a href=\"https://reservationdiary.eu/contact/\" rel=\"nofollow ugc\">reservationdiary.eu/contact</a></li>\n<li>Enhance your business experience by using our Facebook integration service where we try to provide you with profile pictures of your customers if found. You can amaze your customer by knowing him by face when he visits you, especially at the time of first visit.</li>\n<li>Do you want to know what your client thinks about his last visit? We will collect it for you.</li>\n<li>Remind your customer about upcoming reservation via Email or by SMS. More information here: <a href=\"https://reservationdiary.eu/pricing/\" rel=\"nofollow ugc\">reservationdiary.eu/pricing</a></li>\n<li>Collect pre-payment for reservations</li>\n<li>Discouns per reservation module </li>\n<li>Send birthday promotions or reminders to visit your restaurant again with MailChimp integration. More information here: <a href=\"https://reservationdiary.eu/pricing/\" rel=\"nofollow ugc\">reservationdiary.eu/pricing</a></li>\n<li>If you are building a catalogue of restaurants and looking for the perfect reservation plugin for it, we can provide it to you. Just let us know through contact form: <a href=\"https://reservationdiary.eu/contact/\" rel=\"nofollow ugc\">reservationdiary.eu/contact</a></li>\n<li>Do you want to write your own module? We have an API. Contact us to get more information. Contact form: <a href=\"https://reservationdiary.eu/contact/\" rel=\"nofollow ugc\">reservationdiary.eu/contact</a></li>\n</ul>\n<p>If you would like to add some new functionality or have any other queries, please contact us by email: <a href=\"mailto:info@reservationdiary.eu\" rel=\"nofollow ugc\">info@reservationdiary.eu</a> or through our contact form: <a href=\"https://reservationdiary.eu/contact/\" rel=\"nofollow ugc\">reservationdiary.eu/contact</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/redi-restaurant-reservation.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-01.png?rev=792013",
            "caption": "Example of plugin first page installed into default theme. When plugin is activated, new \"Reservation\" page is created. Step 1: Requests from user to select reservation date and time, and number of seats. User has to click on a button \"Check available time\". System will query online database for available places at specified time and shows result."
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-02.png?rev=744130",
            "caption": "Example of calendar control."
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-03.png?rev=744130",
            "caption": "Example of time control."
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-04.png?rev=792013",
            "caption": "Step 2: On this step user is requested to select available time if any."
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-05.png?rev=792013",
            "caption": "Step 3: Once user selects available reservation time, user will be requested to fill reservation form with contact information and custom fields."
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-06.png?rev=744130",
            "caption": "Reservation confirmation screen. At this time user has to receive confirmation email. Same time restaurant owner receives list of all upcoming reservations."
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-07.png?rev=791994",
            "caption": "Setup screen with number of seats available, maximum persons per reservation, opening times and days of the week."
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-08.png?rev=744130",
            "caption": "Setup screen with info on the restaurant including name, address, country, phone, email, URL"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-09.png?rev=791994",
            "caption": "List of upcoming reservations on Mobile/Tablet PC (Available only for Basic package users). Demo version can be accessed by this link: <a href=\"http://upcoming.reservationdiary.eu/en/Entry2/89a08039-2c68-47c4-978c-3acb3e9989ea\">Open demo version</a>"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-10.png?rev=883174",
            "caption": "Detailed reservation information on Mobile/Tablet PC (Available only for Basic package users). Photo is taken from Facebook public profile. Photo, Visits and Rating are available only by request."
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-11.png?rev=883399",
            "caption": "Cancel reservation from Tablet PC version"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-12.png?rev=883399",
            "caption": "Configuration for maximum available seats for online reservation by week day. (Available only for Basic package users)"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-13.png?rev=883174",
            "caption": "Setting for custom fields that user should fill during reservation"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-14.png?rev=883174",
            "caption": "List of Time shifts (Available only for Basic package users)"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-15.png?rev=883174",
            "caption": "Open/close time for time shift (Available only for Basic package users)"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-16.png?rev=883174",
            "caption": "Time before reservation for time shift by weekday (Available only for Basic package users)"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-17.png?rev=883174",
            "caption": "Step 1: Select place, date and time (Multiple places available only for Basic package users)"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-18.png?rev=883174",
            "caption": "Blocked Time list. (Available only for Basic package users)"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-19.png?rev=883174",
            "caption": "Edit Blocked time. (Available only for Basic package users)"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-20.png?rev=903336",
            "caption": "Step 1: Setup Goal with Google Analytics Tracking Code (google analytics/Conversions/Goals/Overview/Set up goals/New goal)."
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-21.png?rev=903336",
            "caption": "Step 2: Setup Goal details (Category: ReDi Restaurant Reservation, Action: Reservation confirmed)"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-22.png?rev=912267",
            "caption": "Cancel reservation page for clients."
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-23.png?rev=978426",
            "caption": "Step 1: Display all available time grouped by Opening Times (Available only for Basic package users)"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-24.png?rev=978426",
            "caption": "List of all emails available for customization"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-25.png?rev=978426",
            "caption": "Example of Email customization page"
        },
        {
            "src": "https://ps.w.org/redi-restaurant-reservation/assets/screenshot-26.PNG?rev=1353890",
            "caption": "Change reservation from Tablet PC version"
        }
    ],
    "tags": {
        "best-wordpress-restaurant-reservation-plugin": "best wordpress restaurant reservation plugin",
        "online-reservation": "online reservation",
        "restaurant-booking-plugin": "Restaurant booking plugin",
        "restaurant-reservation-system": "Restaurant reservation system",
        "table-booking": "table booking"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/redi-restaurant-reservation/assets/banner-772x250.png?rev=2395563",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/redi-restaurant-reservation/assets/icon-128x128.gif?rev=2873539"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 90,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "redi-restaurant-reservation",
            "language": "cs_CZ",
            "version": "24.0730",
            "updated": "2023-11-10 08:17:38",
            "package": "http://downloads.wordpress.org/translation/plugin/redi-restaurant-reservation/24.0730/cs_CZ.zip"
        },
        {
            "type": "plugin",
            "slug": "redi-restaurant-reservation",
            "language": "es_ES",
            "version": "24.0730",
            "updated": "2024-07-12 12:11:27",
            "package": "http://downloads.wordpress.org/translation/plugin/redi-restaurant-reservation/24.0730/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "redi-restaurant-reservation",
            "language": "hu_HU",
            "version": "24.0730",
            "updated": "2015-11-21 15:25:10",
            "package": "http://downloads.wordpress.org/translation/plugin/redi-restaurant-reservation/24.0730/hu_HU.zip"
        }
    ]
}