{
    "name": "Reservation.Tools Embedded Booking Form for Restaurants, Clubs, Bars",
    "slug": "reservation-tools-embedded-booking-form-for-restaurants-clubs-bars",
    "version": "1.0.0",
    "author": "<a href=\"https://www.reservation.tools\">Reservation Ltd.</a>",
    "author_profile": "https://profiles.wordpress.org/rtools/",
    "contributors": {
        "rtools": {
            "profile": "https://profiles.wordpress.org/rtools/",
            "avatar": "https://secure.gravatar.com/avatar/f68ce255f137270ae789b895adf87f63?s=96&d=monsterid&r=g",
            "display_name": "Reservation.Tools"
        }
    },
    "requires": "6.4.2",
    "tested": "6.4.5",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 1,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 1,
    "support_url": "https://wordpress.org/support/plugin/reservation-tools-embedded-booking-form-for-restaurants-clubs-bars/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 0,
    "downloaded": 478,
    "last_updated": "2024-03-04 14:52:00",
    "added": "2024-03-04",
    "homepage": "",
    "sections": {
        "description": "<p>Reservation.Tools is a reservation and customer relation management app distributed as SaaS.</p>\n<ol>\n<li>This plugin relies on a 3rd party software as a service for reservation management app <a href=\"https://www.reservation.tools\" rel=\"nofollow ugc\">Reservation.Tools</a></li>\n<li><a href=\"https://www.reservation.tools/terms-of-use/\" rel=\"nofollow ugc\">Terms of use</a></li>\n<li><a href=\"https://www.reservation.tools/privacy-policy/\" rel=\"nofollow ugc\">Privacy Policy</a></li>\n<li>This plugin is one of the integrations that the platform provides.<br />\nIt&#8217;s a widget that displays the Booking Form integration of the Reservation.Tools app SaaS.</li>\n</ol>\n<p>To use it you need to have a registered account with Reservation.Tools and to enable the Reservation Form integration. While the widget is free, the account is paid with a trial period. For pricing visit our <a href=\"https://www.reservation.tools/pricing/\" rel=\"nofollow ugc\">Pricing Page</a></p>\n<p>You can <a href=\"https://www.reservation.tools/contacts/\" rel=\"nofollow ugc\">schedule a free training and demo</a> with our team:</p>\n<p>Check more tutorials on our <a href=\"https://www.youtube.com/watch?v=ZIPjLsFaXvI&amp;list=PLdbhGTDnwfenbMVF_OMFf-PYmm-cOxAqb&amp;index=2\" rel=\"nofollow ugc\">Youtube channel</a></p>\n<p>Here is a short list of some of the features. For detailed and up-to-date feature list visit <a href=\"https://www.reservation.tools/features/\" rel=\"nofollow ugc\">Features</a></p>\n<p>Visual Table Layout in a Floor Plan</p>\n<p>We offer a customized floor plan design for each venue, allowing users to easily manage their reservations.<br />\nOur Floor plan view enables users to zoom in and out, providing a detailed overview of the venue’s layout. The app differentiates table statuses by color-coding, making it easy to identify available, occupied, and reserved tables.</p>\n<p>The Visual Table Layout provides you with a clear understanding of your venue’s seating arrangements. Whether you&#8217;re a restaurant owner, manager, or host, the Reservation Tool app makes it easy to manage reservations and provide an exceptional guest experience.</p>\n<p>For your convenience, you can switch between three views: Search list, Floor plan, and Scheduler.</p>\n<p>Easily Build and Edit by Yourself a Fully Customized Floor Plan</p>\n<p>Through the RT Design Module you can create a customized floor plan for your venues. You don&#8217;t need any specific designer skills, as it offers an intuitive drag-and-drop option to build and modify the layout of your venue. You can create tables of various sizes and shapes, and even define specific zones within the interior of your venue, such as bar, VIP section, kitchen, restroom and more. Additionally, you can add text and label your tables and zones for better organization.</p>\n<p>The module allows you to group certain tables in zones and assign them unique names. This feature enables your clients to make a table reservation for a specific zone, when using the online reservation form. This enhances your guests&#8217; experience by providing them with a clear view of your restaurant&#8217;s layout and enabling them to choose their preferred seating location.</p>\n<p>Additionally, the fully customizable floor plan provides you with a visual representation of your venue, enabling you to better manage reservations, assign tables, and optimise seating arrangements.</p>\n<p>Different Levels of User Access (Manager, Admin, Hostess)</p>\n<p>You can set up different user roles with specific access levels to ensure that only authorized users have access to specific features and data. The main roles include Manager, Hostess, and Admin.</p>\n<p>The Hostess level provides access to essential features required for managing reservations, such as the ability to create and edit reservations, manage waitlists, and view floor plans. However, Hostess users do not have access to more advanced features such as reports and analytics.</p>\n<p>Reservations from Google Search and Google Maps</p>\n<p>Reservation Tools is an official partner of “Reserve with Google” which is a specialized feature designed to enhance Google Business services by enabling users to book reservations directly from search results.</p>\n<p>When potential clients find your business on Google Search, they can make a reservation using the Reserve with Google platform. The platform is mobile-friendly and standardized, making it easy for clients to book a table quickly and easily.</p>\n<p>We will assist you to enable reservation bookings on Google, so potential clients can easily find your venue.<br />\nFor all our customers, the integration with &#8220;Reserve with Google&#8221; is provided as a free service.</p>\n<p>Online Reservations from Your Website Form</p>\n<p>You can integrate an online reservation form on your website. This form can be fully customised to match the website&#8217;s design and branding, providing a seamless user experience for customers.</p>\n<p>The reservation form includes fields for customers to enter their name, email, telephone number, and use a drop-down menus to choose the number of people in their party and their preferred date and time for the reservation. The form also includes fields for preferred dining area or other specific requirements.</p>\n<p>By allowing your customers to make reservations through your website, you can save time, increase efficiency, and improve the overall customer experience.</p>\n<p>Online Reservations from Facebook, Instagram and Booking Marketplaces</p>\n<p>This feature allows customers to make a reservation using different online platforms. You can take advantage of the social media platforms&#8217; large user base and allow customers to book directly through your social media pages.</p>\n<p>Online reservations from Facebook, Instagram, and Booking marketplaces offer a seamless and convenient experience for your customers, allowing them to easily book a table without having to call you or visit your website.</p>\n<p>Live Availability Checker to Prevent Overbooking</p>\n<p>The Live Availability Checker is a tool that helps you to manage your reservations and prevent overbooking. It works by checking the availability in real-time and providing up-to-date information to both the business and the customer.</p>\n<p>The Live Availability Checker acts as a central hub where you can manage all your bookings from different channels. Whenever a customer makes a booking, the Live Availability Checker automatically updates the availability, making it visible to other potential customers. This ensures that customers are only offered booking options that are currently available and prevents the risk of double-booking.</p>\n<p>Online Access to The App</p>\n<p>Our reservation management solution is cloud-based, providing online access to our app from any device with an internet connection. Whether you&#8217;re using a computer, laptop, or smartphone, you can easily access the RT app and manage your reservations with ease.</p>\n<p>To access the app, you can simply use a web browser on your device or download the mobile app directly. This provides you with the flexibility to manage your reservations on-the-go and from any location.</p>\n<p>Real Time Data Update</p>\n<p>No more worries about double bookings or out-of-date information.</p>\n<p>Reservation Tools is equipped with a powerful real-time data synchronization feature that ensures all users within the same account can access and work on the app simultaneously, regardless of their location or device. This means that hosts, managers, and administrators can collaborate on the platform in real time, ensuring that all data is up-to-date across all devices.</p>\n<p>With this feature, you can rest assured that all changes made to bookings, cancellations, and modifications are instantly updated across all devices.</p>\n<p>The real-time data update feature is designed to enhance productivity and efficiency, providing you with a seamless reservation experience.</p>\n<p>Manage Multiple Venues Through One Account</p>\n<p>This convenient functionality enables owners or managers to easily manage multiple venues using a single account, as it provides a consolidated view of reservations, making it easier to track availability, seating capacity, and overall business performance. To ensure you stay ahead of the challenges of running multiple venues, it allows you to monitor reservations created and edited by your staff in real-time or to create and edit data by yourself, providing a greater control over the reservation process.</p>\n<p>Create Reservations at Ease</p>\n<p>Making reservations is a breeze with our app. You have two easy options: simply click on the desired table or use the dedicated reservation form. The reservation form connects to your RT database, and as you type the first letter of the client&#8217;s name, a list of names appears. This allows you to choose from existing clients and automatically fills in their details such as name and phone number. You can add as many tables as needed to a single reservation and accommodate an unlimited number of guests. Customisation options include adding specific client’s preferences (e.g., smoker, deposit, etc.), comments, and venue zones</p>\n<p>Edit Reservations</p>\n<p>You can edit existing reservations with just one click. If any changes are necessary, you can easily update all the information entered, and even transfer the reservation to the waiting list if needed.</p>\n<p>Closing A Reservation</p>\n<p>In the event that you need to close a reservation, our app offers you several options to choose from, including:<br />\n• Client didn’t show up;<br />\n• Canceled by the customer;<br />\n• Canceled by the venue.</p>\n<p>The selected reason will be accurately recorded in our database under the specific reservation and client&#8217;s name, ensuring clear and organized record-keeping.</p>\n<p>Automated Data Entries from Incoming Phone Calls</p>\n<p>When a customer calls to make a reservation, the system can automatically recognize the phone number and cross-reference it with the data already stored in your database. This eliminates the need for manual data entry. If the phone number matches an existing customer, the app can automatically retrieve and fills their data into the new reservation, including their name, phone number, and any other relevant information.</p>\n<p>This not only saves time and reduces the risk of errors or typos, but also provides a personalised experience for the customer. Your staff will be able to address the customer by name and reference any past reservations or preferences.</p>\n<p>Module for Customer Accommodation and Quick Reservation Search and Browsing</p>\n<p>You can easily search for specific reservations by entering relevant keywords or letters, and sort them by customer name, date or time. Sorting reservations by name and time allows you to quickly organize and prioritise bookings, making it easier to manage the workload.</p>\n<p>The module enables users to browse through reservations effortlessly, providing a seamless experience for both customers and staff.</p>\n<p>Quick Print of The Reservations</p>\n<p>Our app includes a button in the Administration module that allows a quick printing of reservations for a specified time period &#8211; whether it be for the day, week, or a customized period.</p>\n<p>Once the time period is selected, the system generates a comprehensive list of all reservations within that period, including customer name, reservation date, time, and any other relevant details. Additionally, you can customise the reservation list before printing, providing the flexibility to choose which information to include or exclude.</p>\n<p>Easy Seating</p>\n<p>The Reservation Tools app simplifies the process of assigning tables to customers with just a few clicks, making it easy for your team to provide top-notch service to your customers.</p>\n<p>Due to the intuitive interface, tables are displayed graphically, making it easy to visualize the available seating options and assign them accordingly.</p>\n<p>You can also assign tables to customers without reservation. By providing a clear, visual representation of available tables and party sizes, the app makes it easy to avoid assigning tables that are already occupied or reserved.</p>\n<p>Customer Rating</p>\n<p>The customer rating option allows you to rate your clients using a five-star rating system, which is stored in the database along with other client’s information such as reservation history and preferences.</p>\n<p>Reservation Notifications for Clients – SMS &amp; Email</p>\n<p>Reduce the number of no-shows and enhance customer loyalty towards your brand and services.</p>\n<p>The RT app allows to create and personalize SMS and email reminders for your clients regarding their reservations. You have full control to customise the content of the message to include details about the reservation status, such as cancellation, confirmation, completion, expiration, rejection, or reminder.</p>\n<p>Reservation Notifications for Staff Members – SMS &amp; Email</p>\n<p>This option allows staff members to receive reservation notifications via SMS and email. You can customize and personalize notifications to inform staff members of any new or updated reservations made by clients.</p>\n<p>Additionally, the RT app also provides the option to notify other staff members when a reservation has been created, removed, or modified by a colleague. This feature helps ensure that all team members are up-to-date on reservation changes and can work together more effectively to manage bookings.</p>\n<p>Payments</p>\n<p>You can create payments for deposits. Each reservation has a profile URL page that is sent to customers via a notification or manually. The page contains all online payment options like paying with card or providing a bank information. Payments with cards are automatically marked as paid. You can also add cash payments and mark bank payments as paid.</p>\n<p>Customer Database &amp; CRM (Customer Relationship Management)</p>\n<p>Build a highly-efficient customer database by keeping track of important information about your customers and provide a more personalized and efficient service.</p>\n<p>For regular customers, the CRM tool also keeps track of clients’ personal preferences, such as their preferred seating location or their favorite menu items, as well as any allergies or dietary restrictions the customer may have. This information can be used to provide personalized service and make the customer feel valued and appreciated.</p>\n<p>The CRM tool also enables you to rate your customers, based on factors such as their frequency of visits, spending habits, and overall satisfaction with their experience. This information can be used to target promotions and discounts to specific customers, or to identify areas where the business can improve its service.</p>\n<p>Statistics and Reports</p>\n<p>Our reservation app comes equipped with a powerful statistics and reporting feature that enables businesses to make data-driven decisions and optimize their operations. This feature provides detailed reports regarding venue occupancy, effectiveness of different reservation channels used, analysis of the type of reservations, and customer information.</p>\n<p>The Dashboard for insights and statistics offers a comprehensive overview of the business operations. With this feature, you can easily access key performance indicators such as the number of reservations made by day, month, year, or custom period and to identify peak periods and adjust staffing and inventory levels accordingly. You can view the percentage of reservations that have been confirmed, canceled, or are pending, providing an overall snapshot of the status of reservations.</p>\n<p>You can check the percentage rate of reservations by channel, that will enables you to analyze the effectiveness of different reservation channels, such as phone, website, or third-party platforms. This information could be used to optimize marketing and promotional strategies and allocate resources to the most effective channels.</p>\n<p>Activity Log</p>\n<p>You can keep track of all the actions executed by every single user connected to the venue account. This feature is useful for managers who need to identify which member of staff is responsible for specific actions related to reservation creation and editing.</p>\n<p>The Activity Log feature provides an extra level of accountability and transparency for all users connected to the venue account. Users can be confident that their actions are being recorded and that they can be traced back to specific individuals if needed.</p>\n<p>If you have any questions or issues, our customer support team is always available to help you.</p>\n",
        "installation": "<p>How to set-up:<br />\nThis plugin is providing and Embeddable Booking Form for the Reservation.Tools service. To use it, you need to have an account with Reservation.Tools and use the app.<br />\nAll the management of the reservations is done in the Reservation.Tools app, using native and web apps.<br />\nYou can register for a 1 month trial, then contact the team for the subscription you want to start. Pricing is available <a href=\"https://www.reservation.tools/pricing\" rel=\"nofollow ugc\">here</a>.</p>\n<ol>\n<li>Create an account or login here: <a href=\"https://app.reservation.tools\" rel=\"nofollow ugc\">https://app.reservation.tools</a></li>\n<li>After logging in the app, in the top left corner of the app, use the main menu to access the administration panel, or click here: <a href=\"https://app.reservation.tools/admin\" rel=\"nofollow ugc\">https://app.reservation.tools/admin</a></li>\n<li>In the Venues menu, chose the &#8220;Integrations&#8221; button on your Venue.</li>\n<li>Click Add/Enable on the &#8220;Reservation Form&#8221; integration.</li>\n<li>At the bottom of the page, you will find the HTML code of your Reservation Form. It&#8217;s an Iframe with this format: &#8220;https://app.reservation.tools/i/{TOKEN}&#8221;. The {TOKEN} part is your actual Account ID, which you need to copy and add in the input above, and click Save.</li>\n<li>Now in the page editor there is a Widget Called Reservation.Tools Booking form. Use it to show your booking form.</li>\n<li>Take a look at our <a href=\"https://www.reservation.tools/how-to/how-to-manage-reservations/\" rel=\"nofollow ugc\">tutorials</a>, or <a href=\"https://www.reservation.tools/contacts/\" rel=\"nofollow ugc\">contact us</a> for a free demo and training.</li>\n<li><a href=\"https://www.reservation.tools/contacts/\" rel=\"nofollow ugc\">Contact us</a> for any inquiries.</li>\n</ol>\n"
    },
    "short_description": "A Restaurant Booking Form Widget integration of the Reservation.Tools app. You need an account with Reservation.Tools to enable the Reservation Form.",
    "description": "<p>Reservation.Tools is a reservation and customer relation management app distributed as SaaS.</p>\n<ol>\n<li>This plugin relies on a 3rd party software as a service for reservation management app <a href=\"https://www.reservation.tools\" rel=\"nofollow ugc\">Reservation.Tools</a></li>\n<li><a href=\"https://www.reservation.tools/terms-of-use/\" rel=\"nofollow ugc\">Terms of use</a></li>\n<li><a href=\"https://www.reservation.tools/privacy-policy/\" rel=\"nofollow ugc\">Privacy Policy</a></li>\n<li>This plugin is one of the integrations that the platform provides.<br />\nIt&#8217;s a widget that displays the Booking Form integration of the Reservation.Tools app SaaS.</li>\n</ol>\n<p>To use it you need to have a registered account with Reservation.Tools and to enable the Reservation Form integration. While the widget is free, the account is paid with a trial period. For pricing visit our <a href=\"https://www.reservation.tools/pricing/\" rel=\"nofollow ugc\">Pricing Page</a></p>\n<p>You can <a href=\"https://www.reservation.tools/contacts/\" rel=\"nofollow ugc\">schedule a free training and demo</a> with our team:</p>\n<p>Check more tutorials on our <a href=\"https://www.youtube.com/watch?v=ZIPjLsFaXvI&amp;list=PLdbhGTDnwfenbMVF_OMFf-PYmm-cOxAqb&amp;index=2\" rel=\"nofollow ugc\">Youtube channel</a></p>\n<p>Here is a short list of some of the features. For detailed and up-to-date feature list visit <a href=\"https://www.reservation.tools/features/\" rel=\"nofollow ugc\">Features</a></p>\n<p>Visual Table Layout in a Floor Plan</p>\n<p>We offer a customized floor plan design for each venue, allowing users to easily manage their reservations.<br />\nOur Floor plan view enables users to zoom in and out, providing a detailed overview of the venue’s layout. The app differentiates table statuses by color-coding, making it easy to identify available, occupied, and reserved tables.</p>\n<p>The Visual Table Layout provides you with a clear understanding of your venue’s seating arrangements. Whether you&#8217;re a restaurant owner, manager, or host, the Reservation Tool app makes it easy to manage reservations and provide an exceptional guest experience.</p>\n<p>For your convenience, you can switch between three views: Search list, Floor plan, and Scheduler.</p>\n<p>Easily Build and Edit by Yourself a Fully Customized Floor Plan</p>\n<p>Through the RT Design Module you can create a customized floor plan for your venues. You don&#8217;t need any specific designer skills, as it offers an intuitive drag-and-drop option to build and modify the layout of your venue. You can create tables of various sizes and shapes, and even define specific zones within the interior of your venue, such as bar, VIP section, kitchen, restroom and more. Additionally, you can add text and label your tables and zones for better organization.</p>\n<p>The module allows you to group certain tables in zones and assign them unique names. This feature enables your clients to make a table reservation for a specific zone, when using the online reservation form. This enhances your guests&#8217; experience by providing them with a clear view of your restaurant&#8217;s layout and enabling them to choose their preferred seating location.</p>\n<p>Additionally, the fully customizable floor plan provides you with a visual representation of your venue, enabling you to better manage reservations, assign tables, and optimise seating arrangements.</p>\n<p>Different Levels of User Access (Manager, Admin, Hostess)</p>\n<p>You can set up different user roles with specific access levels to ensure that only authorized users have access to specific features and data. The main roles include Manager, Hostess, and Admin.</p>\n<p>The Hostess level provides access to essential features required for managing reservations, such as the ability to create and edit reservations, manage waitlists, and view floor plans. However, Hostess users do not have access to more advanced features such as reports and analytics.</p>\n<p>Reservations from Google Search and Google Maps</p>\n<p>Reservation Tools is an official partner of “Reserve with Google” which is a specialized feature designed to enhance Google Business services by enabling users to book reservations directly from search results.</p>\n<p>When potential clients find your business on Google Search, they can make a reservation using the Reserve with Google platform. The platform is mobile-friendly and standardized, making it easy for clients to book a table quickly and easily.</p>\n<p>We will assist you to enable reservation bookings on Google, so potential clients can easily find your venue.<br />\nFor all our customers, the integration with &#8220;Reserve with Google&#8221; is provided as a free service.</p>\n<p>Online Reservations from Your Website Form</p>\n<p>You can integrate an online reservation form on your website. This form can be fully customised to match the website&#8217;s design and branding, providing a seamless user experience for customers.</p>\n<p>The reservation form includes fields for customers to enter their name, email, telephone number, and use a drop-down menus to choose the number of people in their party and their preferred date and time for the reservation. The form also includes fields for preferred dining area or other specific requirements.</p>\n<p>By allowing your customers to make reservations through your website, you can save time, increase efficiency, and improve the overall customer experience.</p>\n<p>Online Reservations from Facebook, Instagram and Booking Marketplaces</p>\n<p>This feature allows customers to make a reservation using different online platforms. You can take advantage of the social media platforms&#8217; large user base and allow customers to book directly through your social media pages.</p>\n<p>Online reservations from Facebook, Instagram, and Booking marketplaces offer a seamless and convenient experience for your customers, allowing them to easily book a table without having to call you or visit your website.</p>\n<p>Live Availability Checker to Prevent Overbooking</p>\n<p>The Live Availability Checker is a tool that helps you to manage your reservations and prevent overbooking. It works by checking the availability in real-time and providing up-to-date information to both the business and the customer.</p>\n<p>The Live Availability Checker acts as a central hub where you can manage all your bookings from different channels. Whenever a customer makes a booking, the Live Availability Checker automatically updates the availability, making it visible to other potential customers. This ensures that customers are only offered booking options that are currently available and prevents the risk of double-booking.</p>\n<p>Online Access to The App</p>\n<p>Our reservation management solution is cloud-based, providing online access to our app from any device with an internet connection. Whether you&#8217;re using a computer, laptop, or smartphone, you can easily access the RT app and manage your reservations with ease.</p>\n<p>To access the app, you can simply use a web browser on your device or download the mobile app directly. This provides you with the flexibility to manage your reservations on-the-go and from any location.</p>\n<p>Real Time Data Update</p>\n<p>No more worries about double bookings or out-of-date information.</p>\n<p>Reservation Tools is equipped with a powerful real-time data synchronization feature that ensures all users within the same account can access and work on the app simultaneously, regardless of their location or device. This means that hosts, managers, and administrators can collaborate on the platform in real time, ensuring that all data is up-to-date across all devices.</p>\n<p>With this feature, you can rest assured that all changes made to bookings, cancellations, and modifications are instantly updated across all devices.</p>\n<p>The real-time data update feature is designed to enhance productivity and efficiency, providing you with a seamless reservation experience.</p>\n<p>Manage Multiple Venues Through One Account</p>\n<p>This convenient functionality enables owners or managers to easily manage multiple venues using a single account, as it provides a consolidated view of reservations, making it easier to track availability, seating capacity, and overall business performance. To ensure you stay ahead of the challenges of running multiple venues, it allows you to monitor reservations created and edited by your staff in real-time or to create and edit data by yourself, providing a greater control over the reservation process.</p>\n<p>Create Reservations at Ease</p>\n<p>Making reservations is a breeze with our app. You have two easy options: simply click on the desired table or use the dedicated reservation form. The reservation form connects to your RT database, and as you type the first letter of the client&#8217;s name, a list of names appears. This allows you to choose from existing clients and automatically fills in their details such as name and phone number. You can add as many tables as needed to a single reservation and accommodate an unlimited number of guests. Customisation options include adding specific client’s preferences (e.g., smoker, deposit, etc.), comments, and venue zones</p>\n<p>Edit Reservations</p>\n<p>You can edit existing reservations with just one click. If any changes are necessary, you can easily update all the information entered, and even transfer the reservation to the waiting list if needed.</p>\n<p>Closing A Reservation</p>\n<p>In the event that you need to close a reservation, our app offers you several options to choose from, including:<br />\n• Client didn’t show up;<br />\n• Canceled by the customer;<br />\n• Canceled by the venue.</p>\n<p>The selected reason will be accurately recorded in our database under the specific reservation and client&#8217;s name, ensuring clear and organized record-keeping.</p>\n<p>Automated Data Entries from Incoming Phone Calls</p>\n<p>When a customer calls to make a reservation, the system can automatically recognize the phone number and cross-reference it with the data already stored in your database. This eliminates the need for manual data entry. If the phone number matches an existing customer, the app can automatically retrieve and fills their data into the new reservation, including their name, phone number, and any other relevant information.</p>\n<p>This not only saves time and reduces the risk of errors or typos, but also provides a personalised experience for the customer. Your staff will be able to address the customer by name and reference any past reservations or preferences.</p>\n<p>Module for Customer Accommodation and Quick Reservation Search and Browsing</p>\n<p>You can easily search for specific reservations by entering relevant keywords or letters, and sort them by customer name, date or time. Sorting reservations by name and time allows you to quickly organize and prioritise bookings, making it easier to manage the workload.</p>\n<p>The module enables users to browse through reservations effortlessly, providing a seamless experience for both customers and staff.</p>\n<p>Quick Print of The Reservations</p>\n<p>Our app includes a button in the Administration module that allows a quick printing of reservations for a specified time period &#8211; whether it be for the day, week, or a customized period.</p>\n<p>Once the time period is selected, the system generates a comprehensive list of all reservations within that period, including customer name, reservation date, time, and any other relevant details. Additionally, you can customise the reservation list before printing, providing the flexibility to choose which information to include or exclude.</p>\n<p>Easy Seating</p>\n<p>The Reservation Tools app simplifies the process of assigning tables to customers with just a few clicks, making it easy for your team to provide top-notch service to your customers.</p>\n<p>Due to the intuitive interface, tables are displayed graphically, making it easy to visualize the available seating options and assign them accordingly.</p>\n<p>You can also assign tables to customers without reservation. By providing a clear, visual representation of available tables and party sizes, the app makes it easy to avoid assigning tables that are already occupied or reserved.</p>\n<p>Customer Rating</p>\n<p>The customer rating option allows you to rate your clients using a five-star rating system, which is stored in the database along with other client’s information such as reservation history and preferences.</p>\n<p>Reservation Notifications for Clients – SMS &amp; Email</p>\n<p>Reduce the number of no-shows and enhance customer loyalty towards your brand and services.</p>\n<p>The RT app allows to create and personalize SMS and email reminders for your clients regarding their reservations. You have full control to customise the content of the message to include details about the reservation status, such as cancellation, confirmation, completion, expiration, rejection, or reminder.</p>\n<p>Reservation Notifications for Staff Members – SMS &amp; Email</p>\n<p>This option allows staff members to receive reservation notifications via SMS and email. You can customize and personalize notifications to inform staff members of any new or updated reservations made by clients.</p>\n<p>Additionally, the RT app also provides the option to notify other staff members when a reservation has been created, removed, or modified by a colleague. This feature helps ensure that all team members are up-to-date on reservation changes and can work together more effectively to manage bookings.</p>\n<p>Payments</p>\n<p>You can create payments for deposits. Each reservation has a profile URL page that is sent to customers via a notification or manually. The page contains all online payment options like paying with card or providing a bank information. Payments with cards are automatically marked as paid. You can also add cash payments and mark bank payments as paid.</p>\n<p>Customer Database &amp; CRM (Customer Relationship Management)</p>\n<p>Build a highly-efficient customer database by keeping track of important information about your customers and provide a more personalized and efficient service.</p>\n<p>For regular customers, the CRM tool also keeps track of clients’ personal preferences, such as their preferred seating location or their favorite menu items, as well as any allergies or dietary restrictions the customer may have. This information can be used to provide personalized service and make the customer feel valued and appreciated.</p>\n<p>The CRM tool also enables you to rate your customers, based on factors such as their frequency of visits, spending habits, and overall satisfaction with their experience. This information can be used to target promotions and discounts to specific customers, or to identify areas where the business can improve its service.</p>\n<p>Statistics and Reports</p>\n<p>Our reservation app comes equipped with a powerful statistics and reporting feature that enables businesses to make data-driven decisions and optimize their operations. This feature provides detailed reports regarding venue occupancy, effectiveness of different reservation channels used, analysis of the type of reservations, and customer information.</p>\n<p>The Dashboard for insights and statistics offers a comprehensive overview of the business operations. With this feature, you can easily access key performance indicators such as the number of reservations made by day, month, year, or custom period and to identify peak periods and adjust staffing and inventory levels accordingly. You can view the percentage of reservations that have been confirmed, canceled, or are pending, providing an overall snapshot of the status of reservations.</p>\n<p>You can check the percentage rate of reservations by channel, that will enables you to analyze the effectiveness of different reservation channels, such as phone, website, or third-party platforms. This information could be used to optimize marketing and promotional strategies and allocate resources to the most effective channels.</p>\n<p>Activity Log</p>\n<p>You can keep track of all the actions executed by every single user connected to the venue account. This feature is useful for managers who need to identify which member of staff is responsible for specific actions related to reservation creation and editing.</p>\n<p>The Activity Log feature provides an extra level of accountability and transparency for all users connected to the venue account. Users can be confident that their actions are being recorded and that they can be traced back to specific individuals if needed.</p>\n<p>If you have any questions or issues, our customer support team is always available to help you.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/reservation-tools-embedded-booking-form-for-restaurants-clubs-bars.1.0.0.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/reservation-tools-embedded-booking-form-for-restaurants-clubs-bars/assets/screenshot-1.jpg?rev=3045031",
            "caption": "https://static.reservation.tools/screenshots/1.jpg"
        },
        {
            "src": "https://ps.w.org/reservation-tools-embedded-booking-form-for-restaurants-clubs-bars/assets/screenshot-2.jpg?rev=3045031",
            "caption": "https://static.reservation.tools/screenshots/3.jpg"
        },
        {
            "src": "https://ps.w.org/reservation-tools-embedded-booking-form-for-restaurants-clubs-bars/assets/screenshot-3.jpg?rev=3045031",
            "caption": "https://static.reservation.tools/screenshots/8.jpg"
        }
    ],
    "tags": {
        "bookings": "bookings",
        "night-club-reservations": "night club reservations",
        "reservation-management": "reservation management",
        "reservations": "reservations",
        "restaurant-bookings": "restaurant bookings"
    },
    "stable_tag": "1.0.0",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/reservation-tools-embedded-booking-form-for-restaurants-clubs-bars.1.0.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/reservation-tools-embedded-booking-form-for-restaurants-clubs-bars.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/reservation-tools-embedded-booking-form-for-restaurants-clubs-bars/assets/icon-256x256.png?rev=3045031",
        "2x": "https://ps.w.org/reservation-tools-embedded-booking-form-for-restaurants-clubs-bars/assets/icon-256x256.png?rev=3045031"
    },
    "blocks": {
        "reservation-tools/booking-form": {
            "name": "reservation-tools/booking-form",
            "title": "Reservation.Tools Booking Form"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}