{
    "name": "Five Star Restaurant Reservations &#8211; WordPress Booking Plugin",
    "slug": "restaurant-reservations",
    "version": "2.6.26",
    "author": "<a href=\"https://www.fivestarplugins.com/\">Five Star Plugins</a>",
    "author_profile": "https://profiles.wordpress.org/rustaurius/",
    "contributors": {
        "rustaurius": {
            "profile": "https://profiles.wordpress.org/rustaurius/",
            "avatar": "https://secure.gravatar.com/avatar/9c9888d57981a083f95e53e5f1bcce92?s=96&d=monsterid&r=g",
            "display_name": "Rustaurius"
        }
    },
    "requires": false,
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 94,
    "ratings": {
        "5": 170,
        "4": 5,
        "3": 2,
        "2": 3,
        "1": 10
    },
    "num_ratings": 190,
    "support_url": "https://wordpress.org/support/plugin/restaurant-reservations/",
    "support_threads": 2,
    "support_threads_resolved": 2,
    "active_installs": 10000,
    "downloaded": 917959,
    "last_updated": "2024-07-18 2:03pm GMT",
    "added": "2014-05-08",
    "homepage": "http://www.fivestarplugins.com/plugins/five-star-restaurant-reservations/",
    "sections": {
        "description": "<p>Restaurant reservations made easy. Accept reservations and table bookings online. Quickly confirm or reject restaurant reservations, send out custom email notifications, restrict booking times and more.</p>\n<p><a href=\"https://www.fivestarplugins.com/restaurant-reservations-ultimate-demo/\" rel=\"nofollow ugc\">Reservation Demo</a></p>\n<p><em>The plugin includes a Gutenberg restaurant block as well as a restaurant reservation shortcode, so you can display your booking form on any page, no matter which page editing system you are using. We also include several patterns, so you can integrate your forms directly into your block-based theme.</em></p>\n<h4>Key Features</h4>\n<ul>\n<li>Create a customized restaurant reservation form</li>\n<li>Responsive booking form layout that looks great for mobile reservations and on all devices</li>\n<li>Add your reservation form to any page via the included Gutenberg restaurant booking block or shortcode, or just choose your reservation page in the settings</li>\n<li>Set up a specific restaurant schedule by defining the times and dates available for reservation</li>\n<li>Quickly <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/bookings/confirm-reject-bookings\" rel=\"nofollow ugc\">confirm or reject</a> a booking</li>\n<li>Notify a customer by email when their request is confirmed or rejected</li>\n<li>Receive an <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/notifications/\" rel=\"nofollow ugc\">email notification</a> when a booking request is made</li>\n</ul>\n<p><em>Five Star Restaurant Reservations is very user friendly and comes with a walk-through that runs automatically when you activate the plugin and will help you add the booking form to your site and set key options!</em></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/a-dJeE2Ilh4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Create a five star restaurant reservation experience by tailoring your form to yours and your customers&#8217; specific needs. With options to set minimum and maximum party sizes, to require a phone number, to change the date and time format and to write a custom message after a successful online restaurant booking, you can create a familiar and comfortable atmosphere, and make the reservation process as easy and effortless as possible.</p>\n<h4>Additional Restaurant Reservation Features</h4>\n<p>Our customizable restaurant reservations plugin comes with several additional features that will help ensure you&#8217;re able to set it up not only easily, but with all the options you need. It will also allow you to deliver the best and easiest online restaurant booking system for your visitors. These features include:</p>\n<ul>\n<li>Add and edit bookings directly from the plugin admin panel</li>\n<li>Add exceptions to your schedule (e.g. for holidays and special events)</li>\n<li>With our intuitive and fully customizable <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/notifications/email-content\" rel=\"nofollow ugc\">notification configuration table</a>, you can create as many different notifications as you need. Choose the action trigger (e.g. setting a booking to confirmed), the recipient (admin or guest), the message type (email or SMS [requires ultimate version, see below]), and write a unique subject and message. We even have <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/notifications/template-tags\" rel=\"nofollow ugc\">template tags</a> that can be used to dynamically include booking information in the notification message.</li>\n<li>Send customers <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/notifications/send-emails\" rel=\"nofollow ugc\">an email</a> about their booking from the admin panel</li>\n<li>Option to automatically confirm reservations below a certain party size.</li>\n<li>Customize the date and time formats.</li>\n<li>Automatically <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/bookings/schedule\" rel=\"nofollow ugc\">block bookings</a> when you&#8217;re closed, including holidays and one-off openings</li>\n<li><a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/bookings/ban-customers\" rel=\"nofollow ugc\">Ban abusive customers</a> to save money on no-shows</li>\n<li>Change the language of the datepicker feature</li>\n</ul>\n<p>With our reservation system, you can set up the booking schedule for you restaurant. Our settings allow you to be as broad or specific as you want with this, with options for setting the open times, the interval between booking slots, booking in advance, and even the ability to add exceptions to these options.</p>\n<p>You know your customers best. With features like the ability to enable automatic confirmation and to customize your notifications, you can tailor your restaurant booking form to meet the specific requirements of your restaurant and business.</p>\n<h4>Multiple Locations</h4>\n<p>If you have multiple restaurant locations, you can easily add this as a choice to your booking form. This is made possible by integrating with the <a href=\"https://wordpress.org/plugins/business-profile/\" rel=\"ugc\">Five Star Business Profile</a> plugin. When you <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/multiple-locations/\" rel=\"nofollow ugc\">enable and create multiple locations in that plugin</a>, they will automatically show up and be included in the Five Star Restaurant Reservations plugin. This lets you:</p>\n<ul>\n<li>Have a dropdown in your booking form to let your guests choose which location they want to reserve at.</li>\n<li>Set separate schedules and exceptions for each location.</li>\n<li>Set separate restrictions and limits at each location (premium feature, see below).</li>\n</ul>\n<p>No need to have many separate forms or pages, or a complicated solution, to accept bookings at your multiple locations. Five Star Restaurant Reservations has you covered!</p>\n<p>However, if you do wish to create a separate form for each location, this is easily made possible via a <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/multiple-locations/#location-shortcode\" rel=\"nofollow ugc\">shortcode attribute</a> that lets you specify the location of the form. This will make it so the location selector does not show in the booking form and so that the booking is automatically assigned to this location.</p>\n<h4>Limit the Number of People or Reservations (Requires Premium)</h4>\n<p>The premium version of our restaurant reservations plugin comes with several features that let you restrict the number of people in your restaurant, so you can be sure to never overbook and also that you are following any recommended capacity limits in your region.</p>\n<ul>\n<li>Set a dining block length used as a guide to apply the restrictions.</li>\n<li>Set a maximum number of reservations allowed per dining block length.</li>\n<li>Or set a maximum number of seats/people allowed per dining block length.</li>\n<li>Additional options to set a maximum number of reservations or seats per dining block length below which all bookings will be automatically confirmed.</li>\n<li>Works in tandem with all other restriction options (e.g. party size, auto-confirmation of bookings, early bookings, etc.) to make sure only available days and time slots that match all settings show in the booking form.</li>\n<li>Multiple Locations: Both the maximum reservation and maximum seats settings are configurable on a per-location basis.</li>\n</ul>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/XsDvPklGgF4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>Premium Restaurant Reservations</h4>\n<p>The premium version also comes with many other features that let you extend the functionality of your booking form to offer your customers the best possible experience. These include:</p>\n<ul>\n<li>Stylish New Layout Options: Choose from multiple modern restaurant form layouts to find the one that best suits your site. </li>\n<li>Custom Fields: Plan your dinner service better by asking for special seating requests, dietary needs and more when customers book online. Similar to open table, this allows you to customize the reservation system to have any field you want, allowing you to gather all the info you need to offer the best experience to your customers. This feature also allows you to modify the existing default fields.</li>\n<li>View Bookings Page: Create a page on the front end of your site that displays upcoming bookings and allows you to check in guests who have arrived. Any custom fields you create can also be displayed in the view bookings table. This makes it a great tool for your restaurant manager or host, as they can view the bookings for today and check guests in. There is also an option to make this page private, so it only shows if you&#8217;re logged in.</li>\n<li>Advanced Notifications: With the intuitive <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/notifications/notifications-table\" rel=\"nofollow ugc\">notification configuration table</a>, you can create an unlimited number of notifications and bind them to any status/trigger/event you wish.</li>\n<li>Email Templates and Designer: Send beautiful email notifications with your own logo and brand colors when your customers make a reservation. A separate template is available for each notification that you create. </li>\n<li>Export Bookings: Easily print your restaurant bookings via PDF or export them to an Excel/CSV file so you can analyze patterns, gather customer data and import bookings into other services.</li>\n<li>MailChimp Integration: Subscribe new reservation requests to your MailChimp mailing list and watch your subscription rates grow effortlessly. Includes an option to add a checkbox to the booking form, so guests can choose whether or not to opt in for this.</li>\n<li>Styling Options: Many styling options are included that let you set the color, font-size, borders, etc. for the different elements of the booking form.</li>\n<li>Labelling Options: The premium version of the restaurant reservations plugin comes with options to modify the text of all labels and messages that show on the front end. This includes the booking form fields and validation messages, the cancel reservation form, the view bookings form/table as well as elements specific to the ultimate version (such as the deposit payment page).</li>\n</ul>\n<h4>Restaurant Reservations Ultimate</h4>\n<p>The ultimate version of the restaurant reservations plugin contains several powerful features to give you and your guests an amazing booking experience, and also to help you reduce the amount of no-shows at your restaurant. These include:</p>\n<ul>\n<li><strong>Booking by Table</strong>: Add your restaurant&#8217;s tables to the plugin and allow (or require) guests to select a table when they make their reservation, based on the booking time and party size.\n<ul>\n<li>You can set a minimum and maximum number of seats at each table.</li>\n<li>You can also combine tables to let people book for large parties.</li>\n<li>You can configure your tables on a per-location basis.</li>\n<li>Upload and display a table layout graphic with your reservation form, so guests can visualize exactly where/what they&#8217;re booking.</li>\n</ul>\n</li>\n<li><strong>Conditional Maximums</strong>: Set separate maximums (reservations or people) for each scheduling rule or exception that you have. Now you can have, for example, a separate capacity for lunch and dinner services, or manage your capacities differently on the weekend. </li>\n<li><strong>Booking Deposits</strong>: Require a deposit, either per guest or per reservation, when someone makes a reservation, to help prevent no-shows.\n<ul>\n<li>Both Stripe and PayPal are available as payment gateways.\n<ul>\n<li>The Stipe payment gateway now makes use of their <strong>payment intents</strong> system. With this you can enable many different types of payment methods, all directly from within your Stripe account. These include <strong>credit card, Apple Pay, Google Pay, direct debit, Afterpay and many other country- and region-specific methods</strong>.</li>\n</ul>\n</li>\n<li>We&#8217;ve also provided a method for you to programatically add a different/your own gateway (<a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/payments/custom-gateway\" rel=\"nofollow ugc\">more info</a>).</li>\n<li>Options to require deposit only for certain party sizes or only at certain times.</li>\n<li>Option to set table-specific deposit amounts.</li>\n<li>Option to take the deposit as a hold and charge/capture payment at a later time (e.g. when you confirm the booking or on the reservation date, etc.).</li>\n</ul>\n</li>\n<li><strong>SMS Notifications</strong>: Set the notification type to SMS for any notification trigger event, to the admin or customer, all via the <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/notifications/notifications-table\" rel=\"nofollow ugc\">notification configuration table</a>.</li>\n<li><strong>Reservation Reminders</strong>: Send an <strong>SMS</strong> or email reminder message before a booking at a time that you specify (e.g. 4 hours before a reservation).</li>\n<li><strong>Late-Arrival Notices</strong>: Send an <strong>SMS</strong> or email message when a guest is late for their reservation by a specified amount of time.</li>\n<li><strong>Post-Reservation Follow-Up</strong>: Send a follow-up <strong>SMS</strong> or email message a specified amount of time after the reservation (e.g. 18 hours, 2 days, etc.). This can be used to get customer feedback, request a review, offer a promotion, or anything else!</li>\n</ul>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/0DigZnw_3Qw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>Five Star Restaurant Manager Mobile App</h4>\n<p>The ultimate version also syncs directly with our <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/fsrm/\" rel=\"nofollow ugc\">Five Star Restaurant Manager</a> mobile app, for iOS and Android, which lets you manage your bookings from your phone or tablet without needing to log in to your site/WordPress. With this, you can:</p>\n<ul>\n<li>Receive push notifications every time there is a new booking.</li>\n<li>View all new and existing bookings directly in the app.</li>\n<li>Change the status (e.g. to confirmed) of a booking.</li>\n<li>Check people in as they arrive.</li>\n<li>Includes filtering options, so you can quickly find the booking(s) you are looking for.</li>\n</ul>\n<p>The app works in tandem with the restaurant reservations on your site. So, not only do the bookings and statuses immediately sync up, but, for example, when you check someone in via the app, it will tell your site to not send them a late-arrival notification.</p>\n<p>With these features, you can set the app up on a tablet for your host to use front of house to manage the bookings for the day and check people in, or for you to manage them anywhere on the go!</p>\n<p>For further information and purchasing options, please visit our <a href=\"https://www.fivestarplugins.com/plugins/five-star-restaurant-reservations/\" rel=\"nofollow ugc\">WordPress restaurant reservations</a> homepage.</p>\n<p>** We are also pleased to offer a free 7-day trial of either the premium version or the ultimate version, which you can use to test out features like the reservation restrictions, custom fields and payment deposits before buying! **</p>\n<p>This easy restaurant booking system is one part of our suite of plugins designed to give you the best WordPress restaurant experience. Check out the powerful <a href=\"https://wordpress.org/plugins/food-and-drink-menu/\" rel=\"ugc\">Restaurant Menu</a> plugin and let your customers view your full menu and place food orders directly on your site! With its intuitive and easy-to-use interface, you&#8217;ll be sure to not lose out on business to your competitors.</p>\n<h4>For help and support, please see:</h4>\n<ul>\n<li>Our documentation and user guide, here: <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/\" rel=\"nofollow ugc\">https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/</a></li>\n<li>Our FAQ page, here: <a href=\"https://wordpress.org/plugins/restaurant-reservations/faq/\" rel=\"ugc\">https://wordpress.org/plugins/restaurant-reservations/faq/</a></li>\n<li>Our installation guide, here: <a href=\"https://wordpress.org/plugins/restaurant-reservations/installation/\" rel=\"ugc\">https://wordpress.org/plugins/restaurant-reservations/installation/</a></li>\n<li>Our tutorial videos, here: <a href=\"https://www.youtube.com/playlist?list=PLEndQUuhlvSpWIb_sbRdFsHSkDADYU7JF\" rel=\"nofollow ugc\">https://www.youtube.com/playlist?list=PLEndQUuhlvSpWIb_sbRdFsHSkDADYU7JF</a></li>\n<li>The Restaurant Reservations support forum, here: <a href=\"https://wordpress.org/support/plugin/restaurant-reservations/\" rel=\"ugc\">https://wordpress.org/support/plugin/restaurant-reservations/</a></li>\n<li>Our Support Center, here: <a href=\"https://www.fivestarplugins.com/support-center/\" rel=\"nofollow ugc\">https://www.fivestarplugins.com/support-center/</a></li>\n</ul>\n<p>This plugin also comes with hooks that developers can use to extend and customize it. Take a look at the <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/developer/\" rel=\"nofollow ugc\">Developer Documentation</a> to find out more.</p>\n",
        "installation": "<ol>\n<li>Upload the &#8216;restaurant-reservations&#8217; folder to the &#8216;/wp-content/plugins/&#8217; directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n<p>or</p>\n<ol>\n<li>Go to the &#8216;Plugins&#8217; menu in WordPress and click &#8216;Add New&#8217;</li>\n<li>Search for &#8216;Five Star Restaurant Reservations&#8217; and select &#8216;Install Now&#8217;</li>\n<li>Activate the plugin when prompted</li>\n</ol>\n<h4>Getting Started</h4>\n<p>After activating the plugin, <strong>a walk-through will run automatically</strong>, which will help you to add the booking form to your site and set key options.</p>\n<p>You can also follow these steps to configure the plugin.</p>\n<ol>\n<li>\n<p>To place your restaurant booking form on a page:</p>\n<ul>\n<li>Option 1: Go to the Basic tab in the plugin settings and use the Booking Page dropdown to select the page on which you want your reservation form to appear. </li>\n<li>Option 2: Place the included reservations Gutenberg block on the page on which you want your reservation form to appear.</li>\n<li>Option 3: Place the [booking-form] shortcode on the page on which you want your reservation form to appear.</li>\n</ul>\n</li>\n<li>\n<p>To customize the form:</p>\n<ul>\n<li>Go to the Settings area of the plugin admin and click the Basic tab. There you&#8217;ll be able to set the minimum and maximum party size, the successful booking message, the date and time format, and make use of our security and privacy features.</li>\n<li>Also in the Settings area, go to the &#8216;Booking Schedule&#8217; tab. There you&#8217;ll be able to set your restaurant&#8217;s schedule, the interval between booking slots, earliest and latest bookings and also create exceptions for the schedule.</li>\n</ul>\n</li>\n<li>\n<p>To set up notifications.</p>\n<ul>\n<li>Go to the &#8216;Notifications&#8217; tab in the settings.</li>\n<li>Use notification configuration table to create all the notifications you need.</li>\n<li>There is also a list of template tags there that you can include in your messages to display reservation-specific messages about the booking.</li>\n</ul>\n</li>\n<li>\n<p>To view and manage your bookings:</p>\n<ul>\n<li>Go to the &#8216;Bookings&#8217; area of the plugin admin.</li>\n<li>There you&#8217;ll be able to view and modify any bookings that have been placed on your site.</li>\n<li>You&#8217;ll also be able to manually create a new restaurant reservation (e.g. a reservation you took over the phone).</li>\n</ul>\n</li>\n</ol>\n<p>For a list of specific features, see the Restaurant Reservations description page here: https://wordpress.org/plugins/restaurant-reservations/.</p>\n<h4>For help and support, please see:</h4>\n<ul>\n<li>Our documentation and user guide, here: <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/\" rel=\"nofollow ugc\">https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/</a></li>\n<li>Our FAQ page, here: <a href=\"https://wordpress.org/plugins/restaurant-reservations/faq/\" rel=\"ugc\">https://wordpress.org/plugins/restaurant-reservations/faq/</a></li>\n<li>Our tutorial videos, here: <a href=\"https://www.youtube.com/playlist?list=PLEndQUuhlvSpWIb_sbRdFsHSkDADYU7JF\" rel=\"nofollow ugc\">https://www.youtube.com/playlist?list=PLEndQUuhlvSpWIb_sbRdFsHSkDADYU7JF</a></li>\n<li>The Restaurant Reservations support forum, here: <a href=\"https://wordpress.org/support/plugin/restaurant-reservations/\" rel=\"ugc\">https://wordpress.org/support/plugin/restaurant-reservations/</a></li>\n<li>Our Support Center, here: <a href=\"https://www.fivestarplugins.com/support-center/\" rel=\"nofollow ugc\">https://www.fivestarplugins.com/support-center/</a></li>\n</ul>\n",
        "faq": "\n<dt id='is%20there%20a%20gutenberg%20block%20to%20display%20the%20booking%20form%3F'>\nIs there a Gutenberg block to display the booking form?\n</h4>\n<p>\n<p>Yes, just search for the &#8216;Booking Form&#8217; block and add that to your page.</p>\n</p>\n<dt id='is%20there%20a%20shortcode%20to%20display%20the%20booking%20form%3F'>\nIs there a shortcode to display the booking form?\n</h4>\n<p>\n<p>Yes, use the <code>[booking-form]</code> shortcode.</p>\n</p>\n<dt id='can%20i%20change%20the%20format%20of%20the%20date%20or%20time%3F'>\nCan I change the format of the date or time?\n</h4>\n<p>\n<p>Yes, set the format for the datepicker in <em>Settings &gt; Basic</em>.</p>\n</p>\n<dt id='the%20datepicker%20or%20timepicker%20is%20not%20working.'>\nThe datepicker or timepicker is not working.\n</h4>\n<p>\n<p>If you load up the form and no date or time picker is popping up when you select those fields, this is likely caused by a JavaScript error from another plugin or theme. You can find the problematic plugin by deactivating other plugins you&#8217;re using one by one. Test after each deactivation to see if the date and time pickers work.</p>\n<p>If you have deactivated all other plugins and still have a problem, try switching to a default theme (one of the TwentySomething themes).</p>\n</p>\n<dt id='i%27m%20not%20receiving%20notification%20emails%20for%20new%20bookings.'>\nI&#8217;m not receiving notification emails for new bookings.\n</h4>\n<p>\n<p>This is almost always the result of issues with your server and can be caused by a number of things. Before posting a support request, please run through the following checklist:</p>\n<ol>\n<li>Double-check that the notification email in <em>Settings &gt; Notifications</em> is correct.</li>\n<li>Make sure that WordPress is able to send emails. The admin email address in the WordPress settings page should receive notifications of new users.</li>\n<li>If you&#8217;re not able to receive regular WordPress emails, contact your web host and ask them for help sorting it out.</li>\n<li>If you&#8217;re able to receive regular WordPress emails but not booking notifications, check your spam filters or junk mail folders.</li>\n<li>If you still haven&#8217;t found the emails, contact your web host and let them know the date, time and email address where you expected to receive a booking. They should be able to check their logs to see what is happening to the email.</li>\n</ol>\n</p>\n<dt id='can%20i%20make%20the%20phone%20number%20required%3F'>\nCan I make the phone number required?\n</h4>\n<p>\n<p>Yes, there is an option for this in the Basic area of the Settings page.</p>\n</p>\n<dt id='can%20i%20translate%20the%20booking%20form%3F'>\nCan I translate the booking form?\n</h4>\n<p>\n<p>Yes, everything in this plugin can be translated using the standard translation process and software like PoEdit. If you&#8217;re not familiar with that process, I&#8217;d recommend you take a look at the <a href=\"https://wordpress.org/plugins/loco-translate/\" rel=\"ugc\">Loco Translate</a> plugin, which provides a simple interface in your WordPress admin area for translating themes and plugins.</p>\n</p>\n<dt id='i%20set%20early%20or%20late%20bookings%20restrictions%2C%20but%20i%20scan%20still%20book%20during%20that%20time'>\nI set Early or Late Bookings restrictions, but I scan still book during that time\n</h4>\n<p>\n<p>Users with the Administrator and Booking Manager roles are exempt from these restrictions. This is so that they can make last-minute changes to bookings as needed. If you want to test the Early or Late Bookings restrictions, try logging out and testing.</p>\n</p>\n<dt id='i%20want%20to%20add%20a%20field%20to%20the%20form.%20can%20i%20do%20that%3F'>\nI want to add a field to the form. Can I do that?\n</h4>\n<p>\n<p>The premium version does indeed come with a custom fields feature that lets you add new fields and modify existing ones.</p>\n</p>\n<dt id='more%20questions%20and%20answers'>\nMore questions and answers\n</h4>\n<p>\n<p>Find answers to even more questions in the <a href=\"http://doc.fivestarplugins.com/plugins/restaurant-reservations/user/faq\" rel=\"nofollow ugc\">FAQ</a>.</p>\n</p>\n<dt id='for%20help%20and%20support%2C%20please%20see%3A'>\nFor help and support, please see:\n</h4>\n<p>\n<ul>\n<li>Our documentation and user guide, here: <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/\" rel=\"nofollow ugc\">https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/</a></li>\n<li>Our installation guide, here: <a href=\"https://wordpress.org/plugins/restaurant-reservations/installation/\" rel=\"ugc\">https://wordpress.org/plugins/restaurant-reservations/installation/</a></li>\n<li>Our tutorial videos, here: <a href=\"https://www.youtube.com/playlist?list=PLEndQUuhlvSpWIb_sbRdFsHSkDADYU7JF\" rel=\"nofollow ugc\">https://www.youtube.com/playlist?list=PLEndQUuhlvSpWIb_sbRdFsHSkDADYU7JF</a></li>\n<li>The Restaurant Reservations support forum, here: <a href=\"https://wordpress.org/support/plugin/restaurant-reservations/\" rel=\"ugc\">https://wordpress.org/support/plugin/restaurant-reservations/</a></li>\n<li>Our Support Center, here: <a href=\"https://www.fivestarplugins.com/support-center/\" rel=\"nofollow ugc\">https://www.fivestarplugins.com/support-center/</a></li>\n</ul>\n</p>\n\n",
        "changelog": "<h4>2.6.26 (2024-07-18)</h4>\n<ul>\n<li>Fix for issue with date range exceptions not being correctly applied in some cases.</li>\n<li>Added the ability to set date range exceptions for specific locations.</li>\n</ul>\n<h4>2.6.25 (2024-07-17)</h4>\n<ul>\n<li>Fix for fatal error in yesterday&#8217;s release.</li>\n</ul>\n<h4>2.6.24 (2024-07-16)</h4>\n<ul>\n<li>Added a new feature in the ultimate version that lets you set separate maximums (reservations or people) for each scheduling rule or exception.</li>\n<li>Tested with WordPress 6.6.</li>\n</ul>\n<h4>2.6.23 (2024-06-20)</h4>\n<ul>\n<li>Fix for an issue in which the MailChimp integration sometimes wasn&#8217;t loading the field information when you selected an audience.</li>\n</ul>\n<h4>2.6.22 (2024-05-16)</h4>\n<ul>\n<li><strong>Significant change</strong>: Added &#8216;suppress_filters =&gt; true&#8217; to reservation deletion queries, to prevent the query from being edited by other themes/plugins.</li>\n<li>Targeted the delete query to only run if required.</li>\n</ul>\n<h4>2.6.21 (2024-04-18)</h4>\n<ul>\n<li>Fix for rare case in which a user might have a pre-notification-table (so pre-v2.6.3) reminder notification still enabled and sending.</li>\n</ul>\n<h4>2.6.20 (2024-04-12)</h4>\n<ul>\n<li>Fixed an issue in which the chosen email template wasn&#8217;t being used for cron-based notifications (i.e. reminder, late arrival and post reservation events).</li>\n<li>Fixed an issue causing there to be equal signs around the from name in sent email notifications in certain cases.</li>\n<li>Fixed an issue causing the admin notification email address field to not show on the location edit screen in the business profile plugin in certain cases.</li>\n</ul>\n<h4>2.6.19 (2024-04-04)</h4>\n<ul>\n<li>Added the phone number and email address to the event description for iCal exports.</li>\n<li>Added an option to set a cutoff time for cancellations.</li>\n<li>Added an option to let the admin ignore maximum reservation and people counts.</li>\n<li>Added a check for whether the rtb_cron_jobs event is scheduled on settings page save.</li>\n<li>Added functionality to delete bookings with the payment-pending status 7 days after they&#8217;re created.</li>\n<li>Fixed the item counts for admin bookings, to not include trashed bookings in table and date labelling counts.</li>\n<li>Fixed the reservation count when a date range is selected in the admin, and added text warning that the guest count is page-specific.</li>\n<li>Updated .pot file to include some gettext strings that were missing.</li>\n<li>Tested for compatibility with WP 6.5 and PHP 8.2, and eliminated/fixed deprecated notices associated with this.</li>\n</ul>\n<h4>2.6.18 (2024-02-15)</h4>\n<ul>\n<li>Fixed issue in which, if you specified a location in the shortcode or block, the available tables would be those from the global rule and not the specific location.</li>\n<li>Update to statement_descriptor in Stripe integration to correct an issue a user was having with third-party payment methods (e.g. Apple or Google Pay) in Payment Intents.</li>\n</ul>\n<h4>2.6.17 (2024-01-30)</h4>\n<ul>\n<li>Added an option to add/display the cancelled status in the admin even if the &#8220;let guests view and cancel bookings&#8221; option is not enabled.</li>\n<li>Styling updates for the Columns Alternate style.</li>\n<li>Fix: In view bookings form/table, custom fields wouldn&#8217;t display radio or dropdown values if the first input value was the one selected.</li>\n<li>Fix: Two deprecated null argument notices.</li>\n<li>Security: Updating process that ensures booking request comes from admin before allowing status to be set.</li>\n</ul>\n<h4>2.6.16 (2023-12-19)</h4>\n<ul>\n<li>Added a notification event for the payment pending status.</li>\n<li>Fix for tables not being correctly populated in the admin edit booking modal in certain instances.</li>\n<li>Fix for combination tables not being pre-selected for existing bookings in the admin edit booking modal.</li>\n<li>Fix: The current date for view bookings ignored the wp_timezone, so the selected date was sometimes not today on page load.</li>\n<li>Small styling fix for the Stripe payment intents checkout form when using the Columns Alternate booking form style. </li>\n</ul>\n<h4>2.6.15 (2023-11-07)</h4>\n<ul>\n<li>Tested for WordPress 6.4 compatibility/support.</li>\n</ul>\n<h4>2.6.14 (2023-10-25)</h4>\n<ul>\n<li>Added a new &#8220;Columns Alternate&#8221; booking form layout style.</li>\n<li>Added a new &#8220;Minimalist&#8221; booking form layout style, which can be used as-is for a clean look or as a base for your own CSS customization.</li>\n<li>Added a new option to upload and display a table layout graphic with your booking form. </li>\n<li>Added locations to the daily summary email if location terms exist.</li>\n<li>Updated a few styling issues with the inputs in certain booking form layouts that were occurring with certain specific themes.</li>\n</ul>\n<h4>2.6.13 (2023-08-22)</h4>\n<ul>\n<li>Fixed a few styling issues with the Contemporary layout.</li>\n<li>Updated .pot translation file.</li>\n</ul>\n<h4>2.6.12 (2023-08-18)</h4>\n<ul>\n<li>Updated the Stripe payment gateway (for payments/deposits in the ultimate version) to use the Stripe payment intents system, so you can now enable many different payment methods in your Stripe account, including Apple Pay, Google Pay, direct debit, etc.</li>\n<li>CSS styling updates for the payment form.</li>\n<li>Fixed an issue sometimes causing an extra time slot to show in the time picker later than the scheduled closing time when using either a large or a custom time interval.</li>\n</ul>\n<h4>2.6.11 (2023-08-08)</h4>\n<ul>\n<li>Tested for WordPress 6.3 compatibility/support.</li>\n</ul>\n<h4>2.6.10 (2023-06-14)</h4>\n<ul>\n<li>Fixed a PHP warning related to multiple locations.</li>\n<li>Fixed an issue causing a new booking notification to still be sent when a payment failed.</li>\n</ul>\n<h4>2.6.9 (2023-06-13)</h4>\n<ul>\n<li>Fixed an issue with reminder notifications not sending.</li>\n</ul>\n<h4>2.6.8 (2023-06-06)</h4>\n<ul>\n<li>Update to the search on the admin bookings page.</li>\n</ul>\n<h4>2.6.7 (2023-04-17)</h4>\n<ul>\n<li>Fix for an issue where tables were duplicated if the party size wasn&#8217;t changed after the time was selected.</li>\n<li>Fix for incorrect section names when location-specific tables were in use.</li>\n<li>Loading Google Fonts used in two email templates locally.</li>\n</ul>\n<h4>2.6.6 (2023-04-11)</h4>\n<ul>\n<li>Updated the booking submitted timestamp (in the booking details) to take into account the timezone.</li>\n<li>Updated the message editor for the new notifications table to address issues with HTML tags.</li>\n<li>Updated the table dropdown to only show the deposit amount if deposits are set by table.</li>\n<li>Updated multiple locations to use global tables if no location-specific tables have been set.</li>\n<li>Fixed an issue causing the email template to not be used for Booking Closed notifications.</li>\n<li>Fixed an issue preventing bookings from being submitted when using location-specific tables.</li>\n<li>Small styling update for the deposit payment page.</li>\n</ul>\n<h4>2.6.5 (2023-04-05)</h4>\n<ul>\n<li>Fixed issue with double notifications when using payment deposits.</li>\n<li>Added a button to reset the premium notifications table data, in the event that you want/need to re-import the old notifications.</li>\n</ul>\n<h4>2.6.4 (2023-04-04)</h4>\n<ul>\n<li>Fixed an issue in which the message modal was not opening if no fields existed in the notifications table on page load.</li>\n<li>Fixed a spacing issue with table deposit amounts. </li>\n</ul>\n<h4>2.6.3 (2023-03-31)</h4>\n<ul>\n<li>Changed the premium and ultimate notifications configuration to allow for more flexibility and the ability for you to add/create your own notifications, for which you can specify the trigger event, message type, message content, etc., in addition to the preset/default messages.</li>\n<li>Added the ability set different deposit amounts per table.</li>\n<li>Added the ability to configure different tables and sections for each location (if using multiple locations).</li>\n<li>Added &#8216;iCal&#8217; as an option for export type, so that bookings can be imported to popular calendar software such as Google Calendar, Outlook, etc.</li>\n<li>Added who (which user) confirmed a booking to the booking details. </li>\n<li>Added many labelling options to cover the various validation messages that appear throughout the booking form. </li>\n<li>Updated the default text for the front-end cancel booking button, to make it more obvious/clear what the purpose/functionality of that feature is.</li>\n<li>Updated block for compatibility with WordPress 6.2.</li>\n<li>Fixed an issue where cancelled bookings were counted when restricting party size.</li>\n</ul>\n<h4>2.6.2 (2023-01-24)</h4>\n<ul>\n<li>Added push notification functionality to the Five Star Restaurant Manager mobile app when a new booking is made. </li>\n<li>Added a filter (rtb_booking_deposit_amount) to allow for the modification of the deposit amount based on other booking information, such as custom fields.</li>\n<li>Created set_location_name method to add the location name to a booking when the location term ID exists (e.g. for use in the Five Star Restaurant Manager mobile app listings).</li>\n<li>Corrected/eliminated a notice on the admin bookings screen.</li>\n</ul>\n<h4>2.6.1 (2023-01-04)</h4>\n<ul>\n<li>Fixes a potential fatal error on the settings page.</li>\n</ul>\n<h4>2.6.0 (2023-01-04)</h4>\n<ul>\n<li>Added new tutorial videos to the settings pages that explain and show what each option does.</li>\n<li>Added quick links to the admin about page to re-run the walk-through, view tutorial videos and suggest a feature.</li>\n<li>You can now add your own custom payment gateway for deposits.</li>\n<li>Fixed an issue with the user-specific language not applying if the main site language had an included translation file.</li>\n<li>Fixed an issue with the site logo not showing in notification emails. </li>\n<li>Fixed an issue in which, if you enabled the hold option for Stripe payments, but then switched your payment gateway to PayPal, the message about the hold would still display on the front end.</li>\n<li>Removed duplicate currency setting.</li>\n<li>Updated the descriptions of some settings for clarity.</li>\n<li>Updated pickadate library.</li>\n<li>Tested with PHP 8.1, corrected errors related to table selection and exporting with the MPDF option, and updated deprecated functions.</li>\n</ul>\n<p><a href=\"https://www.fivestarplugins.com/changelogs/restaurant-reservations.txt\" rel=\"nofollow ugc\">See changelog for all versions</a>.</p>\n"
    },
    "short_description": "Restaurant reservations made easy. Accept bookings online. Quickly confirm or reject reservations, send email notifications, set booking times and mor &hellip;",
    "description": "<p>Restaurant reservations made easy. Accept reservations and table bookings online. Quickly confirm or reject restaurant reservations, send out custom email notifications, restrict booking times and more.</p>\n<p><a href=\"https://www.fivestarplugins.com/restaurant-reservations-ultimate-demo/\" rel=\"nofollow ugc\">Reservation Demo</a></p>\n<p><em>The plugin includes a Gutenberg restaurant block as well as a restaurant reservation shortcode, so you can display your booking form on any page, no matter which page editing system you are using. We also include several patterns, so you can integrate your forms directly into your block-based theme.</em></p>\n<h4>Key Features</h4>\n<ul>\n<li>Create a customized restaurant reservation form</li>\n<li>Responsive booking form layout that looks great for mobile reservations and on all devices</li>\n<li>Add your reservation form to any page via the included Gutenberg restaurant booking block or shortcode, or just choose your reservation page in the settings</li>\n<li>Set up a specific restaurant schedule by defining the times and dates available for reservation</li>\n<li>Quickly <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/bookings/confirm-reject-bookings\" rel=\"nofollow ugc\">confirm or reject</a> a booking</li>\n<li>Notify a customer by email when their request is confirmed or rejected</li>\n<li>Receive an <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/notifications/\" rel=\"nofollow ugc\">email notification</a> when a booking request is made</li>\n</ul>\n<p><em>Five Star Restaurant Reservations is very user friendly and comes with a walk-through that runs automatically when you activate the plugin and will help you add the booking form to your site and set key options!</em></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/a-dJeE2Ilh4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Create a five star restaurant reservation experience by tailoring your form to yours and your customers&#8217; specific needs. With options to set minimum and maximum party sizes, to require a phone number, to change the date and time format and to write a custom message after a successful online restaurant booking, you can create a familiar and comfortable atmosphere, and make the reservation process as easy and effortless as possible.</p>\n<h4>Additional Restaurant Reservation Features</h4>\n<p>Our customizable restaurant reservations plugin comes with several additional features that will help ensure you&#8217;re able to set it up not only easily, but with all the options you need. It will also allow you to deliver the best and easiest online restaurant booking system for your visitors. These features include:</p>\n<ul>\n<li>Add and edit bookings directly from the plugin admin panel</li>\n<li>Add exceptions to your schedule (e.g. for holidays and special events)</li>\n<li>With our intuitive and fully customizable <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/notifications/email-content\" rel=\"nofollow ugc\">notification configuration table</a>, you can create as many different notifications as you need. Choose the action trigger (e.g. setting a booking to confirmed), the recipient (admin or guest), the message type (email or SMS [requires ultimate version, see below]), and write a unique subject and message. We even have <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/notifications/template-tags\" rel=\"nofollow ugc\">template tags</a> that can be used to dynamically include booking information in the notification message.</li>\n<li>Send customers <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/notifications/send-emails\" rel=\"nofollow ugc\">an email</a> about their booking from the admin panel</li>\n<li>Option to automatically confirm reservations below a certain party size.</li>\n<li>Customize the date and time formats.</li>\n<li>Automatically <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/bookings/schedule\" rel=\"nofollow ugc\">block bookings</a> when you&#8217;re closed, including holidays and one-off openings</li>\n<li><a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/bookings/ban-customers\" rel=\"nofollow ugc\">Ban abusive customers</a> to save money on no-shows</li>\n<li>Change the language of the datepicker feature</li>\n</ul>\n<p>With our reservation system, you can set up the booking schedule for you restaurant. Our settings allow you to be as broad or specific as you want with this, with options for setting the open times, the interval between booking slots, booking in advance, and even the ability to add exceptions to these options.</p>\n<p>You know your customers best. With features like the ability to enable automatic confirmation and to customize your notifications, you can tailor your restaurant booking form to meet the specific requirements of your restaurant and business.</p>\n<h4>Multiple Locations</h4>\n<p>If you have multiple restaurant locations, you can easily add this as a choice to your booking form. This is made possible by integrating with the <a href=\"https://wordpress.org/plugins/business-profile/\" rel=\"ugc\">Five Star Business Profile</a> plugin. When you <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/multiple-locations/\" rel=\"nofollow ugc\">enable and create multiple locations in that plugin</a>, they will automatically show up and be included in the Five Star Restaurant Reservations plugin. This lets you:</p>\n<ul>\n<li>Have a dropdown in your booking form to let your guests choose which location they want to reserve at.</li>\n<li>Set separate schedules and exceptions for each location.</li>\n<li>Set separate restrictions and limits at each location (premium feature, see below).</li>\n</ul>\n<p>No need to have many separate forms or pages, or a complicated solution, to accept bookings at your multiple locations. Five Star Restaurant Reservations has you covered!</p>\n<p>However, if you do wish to create a separate form for each location, this is easily made possible via a <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/multiple-locations/#location-shortcode\" rel=\"nofollow ugc\">shortcode attribute</a> that lets you specify the location of the form. This will make it so the location selector does not show in the booking form and so that the booking is automatically assigned to this location.</p>\n<h4>Limit the Number of People or Reservations (Requires Premium)</h4>\n<p>The premium version of our restaurant reservations plugin comes with several features that let you restrict the number of people in your restaurant, so you can be sure to never overbook and also that you are following any recommended capacity limits in your region.</p>\n<ul>\n<li>Set a dining block length used as a guide to apply the restrictions.</li>\n<li>Set a maximum number of reservations allowed per dining block length.</li>\n<li>Or set a maximum number of seats/people allowed per dining block length.</li>\n<li>Additional options to set a maximum number of reservations or seats per dining block length below which all bookings will be automatically confirmed.</li>\n<li>Works in tandem with all other restriction options (e.g. party size, auto-confirmation of bookings, early bookings, etc.) to make sure only available days and time slots that match all settings show in the booking form.</li>\n<li>Multiple Locations: Both the maximum reservation and maximum seats settings are configurable on a per-location basis.</li>\n</ul>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/XsDvPklGgF4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>Premium Restaurant Reservations</h4>\n<p>The premium version also comes with many other features that let you extend the functionality of your booking form to offer your customers the best possible experience. These include:</p>\n<ul>\n<li>Stylish New Layout Options: Choose from multiple modern restaurant form layouts to find the one that best suits your site. </li>\n<li>Custom Fields: Plan your dinner service better by asking for special seating requests, dietary needs and more when customers book online. Similar to open table, this allows you to customize the reservation system to have any field you want, allowing you to gather all the info you need to offer the best experience to your customers. This feature also allows you to modify the existing default fields.</li>\n<li>View Bookings Page: Create a page on the front end of your site that displays upcoming bookings and allows you to check in guests who have arrived. Any custom fields you create can also be displayed in the view bookings table. This makes it a great tool for your restaurant manager or host, as they can view the bookings for today and check guests in. There is also an option to make this page private, so it only shows if you&#8217;re logged in.</li>\n<li>Advanced Notifications: With the intuitive <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/notifications/notifications-table\" rel=\"nofollow ugc\">notification configuration table</a>, you can create an unlimited number of notifications and bind them to any status/trigger/event you wish.</li>\n<li>Email Templates and Designer: Send beautiful email notifications with your own logo and brand colors when your customers make a reservation. A separate template is available for each notification that you create. </li>\n<li>Export Bookings: Easily print your restaurant bookings via PDF or export them to an Excel/CSV file so you can analyze patterns, gather customer data and import bookings into other services.</li>\n<li>MailChimp Integration: Subscribe new reservation requests to your MailChimp mailing list and watch your subscription rates grow effortlessly. Includes an option to add a checkbox to the booking form, so guests can choose whether or not to opt in for this.</li>\n<li>Styling Options: Many styling options are included that let you set the color, font-size, borders, etc. for the different elements of the booking form.</li>\n<li>Labelling Options: The premium version of the restaurant reservations plugin comes with options to modify the text of all labels and messages that show on the front end. This includes the booking form fields and validation messages, the cancel reservation form, the view bookings form/table as well as elements specific to the ultimate version (such as the deposit payment page).</li>\n</ul>\n<h4>Restaurant Reservations Ultimate</h4>\n<p>The ultimate version of the restaurant reservations plugin contains several powerful features to give you and your guests an amazing booking experience, and also to help you reduce the amount of no-shows at your restaurant. These include:</p>\n<ul>\n<li><strong>Booking by Table</strong>: Add your restaurant&#8217;s tables to the plugin and allow (or require) guests to select a table when they make their reservation, based on the booking time and party size.\n<ul>\n<li>You can set a minimum and maximum number of seats at each table.</li>\n<li>You can also combine tables to let people book for large parties.</li>\n<li>You can configure your tables on a per-location basis.</li>\n<li>Upload and display a table layout graphic with your reservation form, so guests can visualize exactly where/what they&#8217;re booking.</li>\n</ul>\n</li>\n<li><strong>Conditional Maximums</strong>: Set separate maximums (reservations or people) for each scheduling rule or exception that you have. Now you can have, for example, a separate capacity for lunch and dinner services, or manage your capacities differently on the weekend. </li>\n<li><strong>Booking Deposits</strong>: Require a deposit, either per guest or per reservation, when someone makes a reservation, to help prevent no-shows.\n<ul>\n<li>Both Stripe and PayPal are available as payment gateways.\n<ul>\n<li>The Stipe payment gateway now makes use of their <strong>payment intents</strong> system. With this you can enable many different types of payment methods, all directly from within your Stripe account. These include <strong>credit card, Apple Pay, Google Pay, direct debit, Afterpay and many other country- and region-specific methods</strong>.</li>\n</ul>\n</li>\n<li>We&#8217;ve also provided a method for you to programatically add a different/your own gateway (<a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/payments/custom-gateway\" rel=\"nofollow ugc\">more info</a>).</li>\n<li>Options to require deposit only for certain party sizes or only at certain times.</li>\n<li>Option to set table-specific deposit amounts.</li>\n<li>Option to take the deposit as a hold and charge/capture payment at a later time (e.g. when you confirm the booking or on the reservation date, etc.).</li>\n</ul>\n</li>\n<li><strong>SMS Notifications</strong>: Set the notification type to SMS for any notification trigger event, to the admin or customer, all via the <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/notifications/notifications-table\" rel=\"nofollow ugc\">notification configuration table</a>.</li>\n<li><strong>Reservation Reminders</strong>: Send an <strong>SMS</strong> or email reminder message before a booking at a time that you specify (e.g. 4 hours before a reservation).</li>\n<li><strong>Late-Arrival Notices</strong>: Send an <strong>SMS</strong> or email message when a guest is late for their reservation by a specified amount of time.</li>\n<li><strong>Post-Reservation Follow-Up</strong>: Send a follow-up <strong>SMS</strong> or email message a specified amount of time after the reservation (e.g. 18 hours, 2 days, etc.). This can be used to get customer feedback, request a review, offer a promotion, or anything else!</li>\n</ul>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/0DigZnw_3Qw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>Five Star Restaurant Manager Mobile App</h4>\n<p>The ultimate version also syncs directly with our <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/fsrm/\" rel=\"nofollow ugc\">Five Star Restaurant Manager</a> mobile app, for iOS and Android, which lets you manage your bookings from your phone or tablet without needing to log in to your site/WordPress. With this, you can:</p>\n<ul>\n<li>Receive push notifications every time there is a new booking.</li>\n<li>View all new and existing bookings directly in the app.</li>\n<li>Change the status (e.g. to confirmed) of a booking.</li>\n<li>Check people in as they arrive.</li>\n<li>Includes filtering options, so you can quickly find the booking(s) you are looking for.</li>\n</ul>\n<p>The app works in tandem with the restaurant reservations on your site. So, not only do the bookings and statuses immediately sync up, but, for example, when you check someone in via the app, it will tell your site to not send them a late-arrival notification.</p>\n<p>With these features, you can set the app up on a tablet for your host to use front of house to manage the bookings for the day and check people in, or for you to manage them anywhere on the go!</p>\n<p>For further information and purchasing options, please visit our <a href=\"https://www.fivestarplugins.com/plugins/five-star-restaurant-reservations/\" rel=\"nofollow ugc\">WordPress restaurant reservations</a> homepage.</p>\n<p>** We are also pleased to offer a free 7-day trial of either the premium version or the ultimate version, which you can use to test out features like the reservation restrictions, custom fields and payment deposits before buying! **</p>\n<p>This easy restaurant booking system is one part of our suite of plugins designed to give you the best WordPress restaurant experience. Check out the powerful <a href=\"https://wordpress.org/plugins/food-and-drink-menu/\" rel=\"ugc\">Restaurant Menu</a> plugin and let your customers view your full menu and place food orders directly on your site! With its intuitive and easy-to-use interface, you&#8217;ll be sure to not lose out on business to your competitors.</p>\n<h4>For help and support, please see:</h4>\n<ul>\n<li>Our documentation and user guide, here: <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/\" rel=\"nofollow ugc\">https://doc.fivestarplugins.com/plugins/restaurant-reservations/user/</a></li>\n<li>Our FAQ page, here: <a href=\"https://wordpress.org/plugins/restaurant-reservations/faq/\" rel=\"ugc\">https://wordpress.org/plugins/restaurant-reservations/faq/</a></li>\n<li>Our installation guide, here: <a href=\"https://wordpress.org/plugins/restaurant-reservations/installation/\" rel=\"ugc\">https://wordpress.org/plugins/restaurant-reservations/installation/</a></li>\n<li>Our tutorial videos, here: <a href=\"https://www.youtube.com/playlist?list=PLEndQUuhlvSpWIb_sbRdFsHSkDADYU7JF\" rel=\"nofollow ugc\">https://www.youtube.com/playlist?list=PLEndQUuhlvSpWIb_sbRdFsHSkDADYU7JF</a></li>\n<li>The Restaurant Reservations support forum, here: <a href=\"https://wordpress.org/support/plugin/restaurant-reservations/\" rel=\"ugc\">https://wordpress.org/support/plugin/restaurant-reservations/</a></li>\n<li>Our Support Center, here: <a href=\"https://www.fivestarplugins.com/support-center/\" rel=\"nofollow ugc\">https://www.fivestarplugins.com/support-center/</a></li>\n</ul>\n<p>This plugin also comes with hooks that developers can use to extend and customize it. Take a look at the <a href=\"https://doc.fivestarplugins.com/plugins/restaurant-reservations/developer/\" rel=\"nofollow ugc\">Developer Documentation</a> to find out more.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.26.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-1.png?rev=2983930",
            "caption": "Booking form with Columns Alternate layout, using multiple locations, and showing a table layout graphic."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-2.png?rev=2983930",
            "caption": "Booking form with the Contemporary layout."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-3.png?rev=2983930",
            "caption": "Booking form with the Columns layout."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-4.png?rev=2804955",
            "caption": "Booking form with the default layout, with multiple locations, tables and deposits enabled."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-5.png?rev=2983930",
            "caption": "Booking form with the Minimalist layout."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-6.png?rev=2983930",
            "caption": "Great, mobile-friendly date picker."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-7.png?rev=2983930",
            "caption": "Great, mobile-friendly time picker."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-8.png?rev=2983930",
            "caption": "Email received after making a booking."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-9.png?rev=2983930",
            "caption": "View bookings form, where you can also check guests in as arrived (premium)."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-10.png?rev=2983930",
            "caption": "Payment screen for deposit (ultimate)."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-11.png?rev=2983930",
            "caption": "Email reminder of upcoming reservation (ultimate)."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-12.png?rev=2983930",
            "caption": "Easily manage bookings. View today's bookings or upcoming bookings at-a-glance. Confirm or reject bookings quickly."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-13.png?rev=2983930",
            "caption": "Quickly find bookings within a specific date range and/or for a specific location."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-14.png?rev=2983930",
            "caption": "Edit bookings from the admin panel."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-15.png?rev=2983930",
            "caption": "Adding the booking form block to a page."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-16.png?rev=2983930",
            "caption": "The custom fields editor."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-17.png?rev=2983930",
            "caption": "The plugin admin dashboard screen."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-18.png?rev=2983930",
            "caption": "The scheduler."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-19.png?rev=2983930",
            "caption": "Editing a notification email."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-20.png?rev=2983930",
            "caption": "The Styling area of the Settings page."
        },
        {
            "src": "https://ps.w.org/restaurant-reservations/assets/screenshot-21.png?rev=2983930",
            "caption": "Viewing bookings in the Five Star Restaurant Manager app."
        }
    ],
    "tags": {
        "reservation": "reservation",
        "reservation-form": "reservation form",
        "reservations": "reservations",
        "restaurant": "restaurant",
        "restaurant-reservations": "restaurant reservations"
    },
    "stable_tag": "2.6.26",
    "versions": {
        "1.0.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.0.2.zip",
        "1.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.1.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.1.4.zip",
        "1.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.2.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.2.3.zip",
        "1.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.3.zip",
        "1.4": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.4.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.4.1.zip",
        "1.4.10": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.4.10.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.4.5.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.4.6.zip",
        "1.4.7": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.4.7.zip",
        "1.4.8": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.4.8.zip",
        "1.4.9": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.4.9.zip",
        "1.5": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.5.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.5.3.zip",
        "1.6": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.6.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.6.3.zip",
        "1.7": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.7.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.7.2.zip",
        "1.7.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.7.3.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.7.4.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.7.5.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.7.6.zip",
        "1.7.7": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.7.7.zip",
        "1.7.8": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.7.8.zip",
        "1.8": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.8.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.8.1.zip",
        "1.8.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.8.2.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/restaurant-reservations.1.9.0.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.1.zip",
        "2.0.10": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.10.zip",
        "2.0.11": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.11.zip",
        "2.0.12": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.12.zip",
        "2.0.13": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.13.zip",
        "2.0.14": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.14.zip",
        "2.0.15": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.15.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.5.zip",
        "2.0.6": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.6.zip",
        "2.0.7": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.7.zip",
        "2.0.8": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.8.zip",
        "2.0.9": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.0.9.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.1.zip",
        "2.1.10": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.10.zip",
        "2.1.11": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.11.zip",
        "2.1.12": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.12.zip",
        "2.1.13": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.13.zip",
        "2.1.14": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.14.zip",
        "2.1.15": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.15.zip",
        "2.1.16": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.16.zip",
        "2.1.17": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.17.zip",
        "2.1.18": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.18.zip",
        "2.1.19": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.19.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.2.zip",
        "2.1.20": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.20.zip",
        "2.1.21": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.21.zip",
        "2.1.22": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.22.zip",
        "2.1.23": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.23.zip",
        "2.1.24": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.24.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.3.zip",
        "2.1.4": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.4.zip",
        "2.1.5": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.5.zip",
        "2.1.6": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.6.zip",
        "2.1.7": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.7.zip",
        "2.1.8": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.8.zip",
        "2.1.9": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.1.9.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.2.1.zip",
        "2.2.10": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.2.10.zip",
        "2.2.11": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.2.11.zip",
        "2.2.12": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.2.12.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.2.2.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.2.3.zip",
        "2.2.4": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.2.4.zip",
        "2.2.5": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.2.5.zip",
        "2.2.6": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.2.6.zip",
        "2.2.7": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.2.7.zip",
        "2.2.8": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.2.8.zip",
        "2.2.9": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.2.9.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.3.0.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.3.1.zip",
        "2.3.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.3.2.zip",
        "2.3.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.3.3.zip",
        "2.3.4": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.3.4.zip",
        "2.3.5": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.3.5.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.4.1.zip",
        "2.4.10": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.4.10.zip",
        "2.4.11": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.4.11.zip",
        "2.4.12": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.4.12.zip",
        "2.4.13": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.4.13.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.4.2.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.4.3.zip",
        "2.4.4": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.4.4.zip",
        "2.4.5": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.4.5.zip",
        "2.4.6": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.4.6.zip",
        "2.4.7": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.4.7.zip",
        "2.4.8": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.4.8.zip",
        "2.4.9": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.4.9.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.0.zip",
        "2.5.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.1.zip",
        "2.5.10": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.10.zip",
        "2.5.11": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.11.zip",
        "2.5.12": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.12.zip",
        "2.5.13": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.13.zip",
        "2.5.14": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.14.zip",
        "2.5.15": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.15.zip",
        "2.5.16": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.16.zip",
        "2.5.17": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.17.zip",
        "2.5.18": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.18.zip",
        "2.5.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.2.zip",
        "2.5.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.3.zip",
        "2.5.4": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.4.zip",
        "2.5.5": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.5.zip",
        "2.5.6": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.6.zip",
        "2.5.7": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.7.zip",
        "2.5.8": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.8.zip",
        "2.5.9": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.5.9.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.0.zip",
        "2.6.1": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.1.zip",
        "2.6.10": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.10.zip",
        "2.6.11": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.11.zip",
        "2.6.12": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.12.zip",
        "2.6.13": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.13.zip",
        "2.6.14": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.14.zip",
        "2.6.15": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.15.zip",
        "2.6.16": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.16.zip",
        "2.6.17": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.17.zip",
        "2.6.18": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.18.zip",
        "2.6.19": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.19.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.2.zip",
        "2.6.20": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.20.zip",
        "2.6.21": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.21.zip",
        "2.6.22": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.22.zip",
        "2.6.23": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.23.zip",
        "2.6.24": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.24.zip",
        "2.6.25": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.25.zip",
        "2.6.26": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.26.zip",
        "2.6.3": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.3.zip",
        "2.6.4": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.4.zip",
        "2.6.5": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.5.zip",
        "2.6.6": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.6.zip",
        "2.6.7": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.7.zip",
        "2.6.8": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.8.zip",
        "2.6.9": "https://downloads.wordpress.org/plugin/restaurant-reservations.2.6.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/restaurant-reservations.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.etoilewebdesign.com/plugin-donations/",
    "banners": {
        "low": "https://ps.w.org/restaurant-reservations/assets/banner-772x250.png?rev=2205491",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/restaurant-reservations/assets/icon-128x128.png?rev=2205491"
    },
    "blocks": {
        "restaurant-reservations/booking-form": {
            "name": "restaurant-reservations/booking-form",
            "title": "Booking Form"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 94,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "restaurant-reservations",
            "language": "ca",
            "version": "2.6.26",
            "updated": "2023-09-15 06:34:55",
            "package": "http://downloads.wordpress.org/translation/plugin/restaurant-reservations/2.6.26/ca.zip"
        },
        {
            "type": "plugin",
            "slug": "restaurant-reservations",
            "language": "cs_CZ",
            "version": "2.6.26",
            "updated": "2023-04-02 18:17:44",
            "package": "http://downloads.wordpress.org/translation/plugin/restaurant-reservations/2.6.26/cs_CZ.zip"
        },
        {
            "type": "plugin",
            "slug": "restaurant-reservations",
            "language": "da_DK",
            "version": "2.6.26",
            "updated": "2017-01-29 07:53:45",
            "package": "http://downloads.wordpress.org/translation/plugin/restaurant-reservations/2.6.26/da_DK.zip"
        },
        {
            "type": "plugin",
            "slug": "restaurant-reservations",
            "language": "de_DE",
            "version": "2.6.26",
            "updated": "2023-02-25 21:59:24",
            "package": "http://downloads.wordpress.org/translation/plugin/restaurant-reservations/2.6.26/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "restaurant-reservations",
            "language": "es_ES",
            "version": "2.6.26",
            "updated": "2024-06-24 18:04:22",
            "package": "http://downloads.wordpress.org/translation/plugin/restaurant-reservations/2.6.26/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "restaurant-reservations",
            "language": "fr_FR",
            "version": "2.6.26",
            "updated": "2023-10-25 17:18:07",
            "package": "http://downloads.wordpress.org/translation/plugin/restaurant-reservations/2.6.26/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "restaurant-reservations",
            "language": "it_IT",
            "version": "2.6.26",
            "updated": "2024-07-10 04:43:53",
            "package": "http://downloads.wordpress.org/translation/plugin/restaurant-reservations/2.6.26/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "restaurant-reservations",
            "language": "ja",
            "version": "2.6.26",
            "updated": "2019-03-05 00:57:46",
            "package": "http://downloads.wordpress.org/translation/plugin/restaurant-reservations/2.6.26/ja.zip"
        },
        {
            "type": "plugin",
            "slug": "restaurant-reservations",
            "language": "nl_NL",
            "version": "2.6.26",
            "updated": "2024-07-30 12:56:58",
            "package": "http://downloads.wordpress.org/translation/plugin/restaurant-reservations/2.6.26/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "restaurant-reservations",
            "language": "pt_BR",
            "version": "2.6.26",
            "updated": "2018-11-30 17:22:04",
            "package": "http://downloads.wordpress.org/translation/plugin/restaurant-reservations/2.6.26/pt_BR.zip"
        },
        {
            "type": "plugin",
            "slug": "restaurant-reservations",
            "language": "tr_TR",
            "version": "2.6.26",
            "updated": "2017-05-16 08:40:52",
            "package": "http://downloads.wordpress.org/translation/plugin/restaurant-reservations/2.6.26/tr_TR.zip"
        }
    ]
}