{
    "name": "Membership Plugin &#8211; Restrict Content",
    "slug": "restrict-content",
    "version": "3.2.12",
    "author": "<a href=\"https://stellarwp.com/\">StellarWP</a>",
    "author_profile": "https://profiles.wordpress.org/stellarwp/",
    "contributors": {
        "stellarwp": {
            "profile": "https://profiles.wordpress.org/stellarwp/",
            "avatar": "https://secure.gravatar.com/avatar/d22ed43e6ad1454f32040c2f053126b1?s=96&d=monsterid&r=g",
            "display_name": "StellarWP"
        },
        "reedyseth": {
            "profile": "https://profiles.wordpress.org/reedyseth/",
            "avatar": "https://secure.gravatar.com/avatar/e21f01b31b82ae62c8dd60cdafa10487?s=96&d=monsterid&r=g",
            "display_name": "Israel Barragan"
        },
        "highprrrr": {
            "profile": "https://profiles.wordpress.org/highprrrr/",
            "avatar": "https://secure.gravatar.com/avatar/2929fad6c867ee658c037d1bf81a6b28?s=96&d=monsterid&r=g",
            "display_name": "James Welbes"
        }
    },
    "requires": "6.0",
    "tested": "6.4.5",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 64,
    "ratings": {
        "5": 41,
        "4": 9,
        "3": 4,
        "2": 1,
        "1": 36
    },
    "num_ratings": 91,
    "support_url": "https://wordpress.org/support/plugin/restrict-content/",
    "support_threads": 16,
    "support_threads_resolved": 2,
    "active_installs": 10000,
    "downloaded": 529772,
    "last_updated": "2024-07-22 5:49pm GMT",
    "added": "2010-07-24",
    "homepage": "https://restrictcontentpro.com",
    "sections": {
        "description": "<p>Restrict Content is a powerful WordPress membership plugin that allows you to monetize content access. As a content restriction plugin, Restrict Content gives you full control over who can and cannot view content on your WordPress site. As a design tool, Restrict Content helps you create pages that dynamically display content based on user role or membership level.</p>\n<p>Restrict Content can power a full-fledged membership or subscription website with multiple membership levels, or just hide a page or post. Restrict Content makes it simple to limit access to posts, pages, media, custom post types, and even API requests. This gives you full control over who can and who cannot view content on your WordPress site.</p>\n<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/650723404\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p>Restrict Content is completely customizable with features built for developers and extensible with a library of <a href=\"https://restrictcontentpro.com/add-ons/pro/\" rel=\"nofollow ugc\">Pro add-ons</a>.</p>\n<h4>💪 As Powerful as a WordPress Membership Plugin &#8230; or as Simple as a Content Restriction Plugin</h4>\n<p>Use Restrict Content as a <strong>WordPress membership plugin</strong> to:</p>\n<ul>\n<li><strong>Create unlimited membership levels or subscription packages.</strong> Easily create free, trial, and premium memberships or subscriptions. Each plan can be used to set a user’s access to specific content on your site.</li>\n<li><strong>Sell memberships and collect payments on your WordPress site.</strong> You can even collect payments with Stripe in the free version!</li>\n<li><strong>Control content access for your members.</strong> Decide who can access specific pages, posts, archives, and even WordPress blocks based on a member’s plan, status, and more.</li>\n<li><strong>Manage your members or subscribers.</strong> Restrict Content lets you easily keep track of your memberships through an intuitive admin interface. Quickly view active, expired, cancelled, and pending memberships. Memberships can be added manually, modified in bulk, and easily searched for when you need to locate a specific record. Each membership can also be manually modified at any time.</li>\n<li><strong>Allow members to manage their account with self-service account management. </strong> Members can easily view their account status, renewal or expiration date, and options to upgrade or cancel their account. They can also access a complete history of payments made to their account, including PDF invoices for each payment. Finally, members are able update their account name, email, and password through an included profile editor.</li>\n<li><strong>Offer prorated memberships.</strong> Customers can also upgrade and downgrade between membership levels at any time. These upgrades and downgrades are prorated based on how much the customer has already paid and how much time is left in their current membership.</li>\n<li><strong> Auto-renew membership payments.</strong> Select whether membership payments should always auto renew or let the customer decide.</li>\n</ul>\n<p>Use Restrict Content as a <strong>WordPress content restriction plugin</strong> to:</p>\n<ul>\n<li><strong>Restrict access to your WordPress site based user role.</strong> Limit access to full content via a simple interface on the post, page, and custom post type editing screens.</li>\n<li><strong>Control user access to content</strong><strong> based on WordPress user role, access level(s), or membership level(s).</strong></li>\n<li><strong>Protect sensitive content.</strong></li>\n<li><strong>Clearly separate public content from private content</strong></li>\n<li><strong>Restrict access to entire pages or specific sections</strong></li>\n<li><strong>Let users register and login from the frontend of your site</strong></li>\n</ul>\n<blockquote>\n<p>“Most plugins that restrict content are heavy and need 3rd party commerce solutions like WooCommerce to work. Restrict Content Pro has EVERYTHING built-in: memberships, payment gateways and plenty of add-ons – a true, one-stop solution for membership websites!”<br />\n  David Attard, CollectiveRay</p>\n</blockquote>\n<h4>✨ Features</h4>\n<p>Our feature-rich plugin comes with everything you need to restrict content and sell memberships from your WordPress site.</p>\n<ul>\n<li>👥 <strong>Membership Levels</strong> &#8211; Set access level, duration (in days, months, years), number of renewals, price, signup fee, status, assign WordPress user role. Set any price (including free) or optionally set a sign up fee. Set the frequency and period, and specify a user role that will be assigned to members when they register.</li>\n<li>🖥 <strong>Auto-Created Member Pages</strong> &#8211; Pages generated by the plugin include: Registration, Success, Account, Edit Profile, Update Billing Card</li>\n<li>🔁 <strong>Auto Renewals</strong> &#8211; Select to let customer choose whether to auto renew, always auto renew, or never auto renew.<br />\n💳 <strong>Payment Gateways</strong> &#8211; Stripe and Manual Payments, PayPal (Pro), Authorize.net (Pro), Braintree (Pro), Custom (Pro).</li>\n<li><span aria-hidden=\"true\" class=\"wp-exclude-emoji\">↕</span>️ <strong>Upgrade/Downgrade Membership</strong> &#8211; Allow members to change their subscription level at any time.</li>\n<li>✉️ <strong>Member Emails</strong> &#8211; Paid membership activation email, free membership activation email, cancelled membership email, expired membership email, payment received email, renewal payment failed email.</li>\n<li>📄 <strong>Payment Invoices</strong> &#8211; The payment invoice has a clean design and is printable. Customize with your logo, company name, address, email, header text, notes, and footer text</li>\n<li>🪄 <strong>Prorated memberships</strong> &#8211; Allow members to pay the price difference when they upgrade.</li>\n</ul>\n<h4>🙌 Even More Features</h4>\n<p>✔️ Redirect Default Login URL &#8211; Force the default login URL to a custom URL.<br />\n✔️ Content Excerpts &#8211; Choose whether or not to show content excerpts to members without access to the content.<br />\n✔️ Import/Export Data &#8211; Whether you prefer to maintain your own records of your memberships database, you wish to run your own analysis, or you simply need to import membership records into another service or application such as MailChimp or Excel, Restrict Content allows you to export all membership records to a CSV at anytime.<br />\n✔️ Restricted Content Message &#8211; Customize the message shown to users who do not have permission to view the content.<br />\n✔️ Restrict access to <a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a> products.</p>\n<h4>🏋️‍♀️ More Power with Pro Features</h4>\n<ul>\n<li>🏷 <strong>Discount code support</strong> &#8211; Discount codes allow you to provide your customers with special promotional codes that give them a discount on the purchase of a membership. Restrict Content Pro supports various kinds of discount codes and site administrators can easily create any number of discounts from the admin interface. Discount codes can be set up to provide a percentage discount or a flat rate discount. Each discount code is created with a name, description, unique code, maximum uses, and optional expiration dates.</li>\n<li>📈 <strong>Detailed reporting</strong> &#8211; Restrict Content Pro provides a complete reports section where you can view the earnings of your membership website. You can view total earnings for any given period or drill down to specific membership levels.</li>\n<li>🕵️‍♀️ <strong>Free trials</strong> &#8211; Allow prospective members to try a membership before they buy. Send emails to free trial users when their free trial is about to end.</li>\n<li>✉️ <strong>Member Email Customization</strong> &#8211; Add a personal touch to all of your member emails with Restrict Content Pro.</li>\n<li>🔒 <strong>Google reCAPTCHA</strong> &#8211; Protect your member login form from bots with Google reCAPTCHA.</li>\n<li>🚀 <strong> 34 Powerful Add-ons</strong> &#8211; All Restrict Content Pro plans come with all Restrict Content Pro add-ons to add more integrations and functionality to your site.</li>\n</ul>\n<p><strong><a href=\"https://restrictcontentpro.com/pricing/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=upgrade&amp;utm_term=description\" rel=\"nofollow ugc\">Upgrade to Restrict Content Pro now</a></strong></p>\n<h4>🛠 Developer Features</h4>\n<p>Restrict Content Pro has been built with developers in mind. That means it is flexible, easy to extend, and chocked full of action hooks and filters, making it easy to modify and tweak to your specific needs. With clean and simple display options, Restrict Content Pro is designed to integrate perfectly with every theme without any custom CSS being necessary.</p>\n<p>Extensive and easy to modify template files are included with Restrict Content Pro. If you have built a theme, for clients or general distribution, you can easily customize the display of registration forms, profile editor, account pages, and more through custom template files added directly to your theme’s folder.</p>\n<p>Because of the huge number of action hooks and filters, Restrict Content Pro can be easily integrated with other plugins to help provide a more seamless experience for customers. This also makes it possible to build add-on plugins for Restrict Content Pro that extend its functionality.</p>\n<p>✔️ Theme Integration &#8211; Designed to work with any theme.<br />\n✔️ Action Hooks &amp; filters galore &#8211; Restrict Content contains a bunch of action hooks and filters, allowing you to easily customize the plugin to your specific needs. Check out our extensive developer docs for actions, filters, classes, constants, and functions.<br />\n✔️ Easy to Modify Template files &#8211; Making changes to Restrict Content Pro template files is a cinch. Make a copy of any plugin template file and drop it in your theme to override the plugin’s file with your own custom markup.<br />\n✔️ So Many Integrations &#8211; Restrict Content plays nice with a bunch of plugins and third-party services, including e-commerce systems like WooCommerce, lots of Pro payment gateways, email newsletter services, and much more!<br />\n✔️ REST API &#8211; Restrict Content Pro includes a complete REST API, allowing you to extend the plugin and its functionality beyond WordPress and into your web application. The possibilities for what you can do are nearly limitless!<br />\n✔️ WP-CLI Integration &#8211; Restrict Content Pro integrates with WP-CLI. Several commands are supported in order to speed up your workflow with batch processing jobs, creating memberships, and viewing customer information.<br />\n✔️ Debug mode for developers &#8211; Turn on error logging to help identify issues. Logs are kept in Restrict &gt; Tools.</p>\n<h4>💳 Stripe payment processing support</h4>\n<p>It’s no secret that we believe <a href=\"https://stripe.com/\" rel=\"nofollow ugc\">Stripe</a> is the best payment processor. Stripe currently supports 14 languages, over 35 countries and 135+ currencies. <a href=\"https://stripe.com/global\" rel=\"nofollow ugc\">Check support for your country</a>.</p>\n<p>Hands down, Stripe has the simplest setup process and highest reliability we know of – and support for Stripe is included in Restrict Content. Stripe has a per-transaction charge which varies by country. See <a href=\"https://stripe.com/pricing\" rel=\"nofollow ugc\">Stripe’s pricing page</a> for more information. However, if you prefer a different payment gateway or your country does not support Stripe, we’ve got you covered&#8230;</p>\n<p>Besides Stripe, we have several payment gateways available to Restrict Content Pro. Visit the following links to get more details for the payment gateway of your choice.</p>\n<ul>\n<li><a href=\"https://restrictcontentpro.com/tour/payment-gateways/paypal/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=paypal&amp;utm_term=description\" rel=\"nofollow ugc\">PayPal</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/payment-gateways/authorize-net/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=authorize-net&amp;utm_term=description\" rel=\"nofollow ugc\">Authorize.Net</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/payment-gateways/braintree/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=braintree&amp;utm_term=description\" rel=\"nofollow ugc\">Braintree</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/payment-gateways/add-your-own/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=add-your-own&amp;utm_term=description\" rel=\"nofollow ugc\">Build your own (extensive API available)</a></li>\n</ul>\n<h4>🧰 Shortcodes</h4>\n<ul>\n<li>Limit access to content with a shortcode. Example: <code>[restrict]This content is limited to logged in users.[/restrict]</code></li>\n<li>Limit access to content based on user role. Example: <code>[restrict userlevel=\"editor\"]Only editors and higher can see this content.[/restrict]</code></li>\n<li>Display a registration form for new accounts on any page of your website with <code>[register_form]</code>.</li>\n<li>Display a login form for existing users on any page of your website with <code>[login_form]</code>.</li>\n</ul>\n<h4>🛒 WooCommerce integration</h4>\n<p>Restrict Content allows you to easily control who can view and/or purchase products in <a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a>, the most popular eCommerce plugin for WordPress.</p>\n<h4>💬 Get reliable help</h4>\n<p>Restrict Content is backed by top-notch technical support from our full-time support team. We also have extensive <a href=\"https://help.ithemes.com/hc/en-us/categories/360004039733-Restrict-Content-Pro?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=docs&amp;utm_term=description\" rel=\"nofollow ugc\">documentation site</a> available. If you’re looking for faster support via email, we encourage you to purchase a <a href=\"https://restrictcontentpro.com/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=purchase&amp;utm_term=description\" rel=\"nofollow ugc\">Restrict Content Pro license</a>.</p>\n<p>We check in on the <a href=\"https://wordpress.org/support/plugin/restrict-content\" rel=\"ugc\">The Restrict Content forum here on WordPress.org</a> about once a week to help users with basic troubleshooting and identifying bugs. If you’re looking for premium, personalized support, consider upgrading to Restrict Content Pro.</p>\n<h3>📃 Documentation</h3>\n<p>All of our documentation can be found in the <a href=\"https://help.ithemes.com/hc/en-us/categories/360004039733-Restrict-Content-Pro\" rel=\"nofollow ugc\">iThemes Help Docs</a>.</p>\n<h4>🤔 Who is Restrict Content Pro for?</h4>\n<p>No matter what kind of membership site or plans you offer, Restrict Content Pro can be adapted to suit your business needs – and set up in <a href=\"https://restrictcontentpro.com/tour/use-cases/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=use-cases&amp;utm_term=description\" rel=\"nofollow ugc\">many different ways</a>, based on how you want to allow members to access your site’s content.</p>\n<p>Here are a few examples:</p>\n<ul>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/member-blogs/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=member-blogs&amp;utm_term=description\" rel=\"nofollow ugc\">Member Blogs</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/group-accounts/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=group-accounts&amp;utm_term=description\" rel=\"nofollow ugc\">Group Accounts</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/club-memberships/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=club-memberships&amp;utm_term=description\" rel=\"nofollow ugc\">Club Memberships</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/co-operatives/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=co-operatives&amp;utm_term=description\" rel=\"nofollow ugc\">Co-operatives</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/job-boards/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=job-boards&amp;utm_term=description\" rel=\"nofollow ugc\">Job Boards</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/magazine-subscriptions/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=magazine-subscriptions&amp;utm_term=description\" rel=\"nofollow ugc\">Magazine Subscriptions</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/maintenance-contracts/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=maintenance-contracts&amp;utm_term=description\" rel=\"nofollow ugc\">Maintenance Contracts</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/private-communities/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=private-communities&amp;utm_term=description\" rel=\"nofollow ugc\">Private Communities</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/support-agreements/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=support-agreements&amp;utm_term=description\" rel=\"nofollow ugc\">Support Agreements</a></li>\n</ul>\n<blockquote>\n<p>“RCP is always at the top of my list when helping clients choose a membership platform. In addition to being a great plugin ​today​, the pace of improvement is impressive. RCP gets better and better all the time.”<br />\n  Travis Northcutt, Member Up</p>\n</blockquote>\n<h4>💌 Email marketing service provider add-ons</h4>\n<p>With a Professional or higher license, you can connect Restrict Content Pro to any of the following email marketing service providers. This allows you to add members to your mailing lists for different membership levels as well as synchronize account details.</p>\n<ul>\n<li><a href=\"https://restrictcontentpro.com/downloads/mailchimp-pro/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=mailchimp&amp;utm_term=description\" rel=\"nofollow ugc\">Mailchimp</a></li>\n<li><a href=\"https://restrictcontentpro.com/downloads/aweber-pro/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=aweber&amp;utm_term=description\" rel=\"nofollow ugc\">AWeber</a></li>\n<li><a href=\"https://restrictcontentpro.com/downloads/convertkit/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=convertkit&amp;utm_term=description\" rel=\"nofollow ugc\">ConvertKit</a></li>\n<li><a href=\"https://restrictcontentpro.com/downloads/activecampaign/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=activecampaign&amp;utm_term=description\" rel=\"nofollow ugc\">ActiveCampaign</a></li>\n</ul>\n<h4>🔌 Other add-ons in Restrict Content Pro</h4>\n<ul>\n<li><a href=\"https://restrictcontentpro.com/downloads/group-accounts/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=group-accounts&amp;utm_term=description\" rel=\"nofollow ugc\">Group Accounts</a> &#8211; Sell multi-member group memberships.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/drip-content/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=drip-content&amp;utm_term=description\" rel=\"nofollow ugc\">Drip Content</a> &#8211; Release content to members on a schedule.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/custom-redirects/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=custom-redirects&amp;utm_term=description\" rel=\"nofollow ugc\">Custom Redirects</a> &#8211; Specify where members are redirected on a per-membership-level basis.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/woocommerce-member-discounts/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=woocommerce&amp;utm_term=description\" rel=\"nofollow ugc\">WooCommerce Member Discounts</a> &#8211; Give members automatic discounts on purchases in your WooCommerce store.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/site-creation/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=site-creation&amp;utm_term=description\" rel=\"nofollow ugc\">Site Creation</a> &#8211; Allow paid members to purchase sites in a WordPress multisite.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/restriction-timelock/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=timelock&amp;utm_term=description\" rel=\"nofollow ugc\">Restriction Timelock</a> &#8211; Keep content unrestricted until a specified date in the future.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/restriction-timeouts/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=timeouts&amp;utm_term=description\" rel=\"nofollow ugc\">Restriction Timeouts</a> &#8211; Specify a date and time when restricted content will have its restrictions removed, making it available to everyone.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/restrict-past-content/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=past-content&amp;utm_term=description\" rel=\"nofollow ugc\">Restrict Past Content</a> &#8211; Restrict content published prior to a member&#8217;s join date.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/hard-set-expiration-dates/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=expiration&amp;utm_term=description\" rel=\"nofollow ugc\">Hard-set Expiration Dates</a> &#8211; Allows for a specific expiration date to be assigned to membership levels.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/help-scout/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=help-scout&amp;utm_term=description\" rel=\"nofollow ugc\">Help Scout</a> &#8211; Display customer&#8217;s membership information from Restrict Content Pro inside of Help Scout when viewing tickets.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/math-verification/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=math&amp;utm_term=description\" rel=\"nofollow ugc\">Math Verification</a> &#8211; Add a math verification field to registration forms.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/ip-restriction/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=ip&amp;utm_term=description\" rel=\"nofollow ugc\">IP Restriction</a> &#8211; Allow specific IP addresses to bypass content restrictions and ban other IP addresses from signing up for a membership plan.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/enforce-strong-passwords/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=strong-passwords&amp;utm_term=description\" rel=\"nofollow ugc\">Enforce Strong Passwords</a> &#8211; Enforce strong passwords during registration.</li>\n</ul>\n<h4>👋 Meet the team</h4>\n<p>Restrict Content is built by <a href=\"https://iThemes.com/team/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=rc-lite-plugin&amp;utm_content=ithemes&amp;utm_term=description\" rel=\"nofollow ugc\">iThemes</a>. We also make popular WordPress plugins like <a href=\"https://ithemes.com/security?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=rc-lite-plugin&amp;utm_content=popular&amp;utm_term=description\" rel=\"nofollow ugc\">iThemes Security Pro</a> and <a href=\"https://ithemes.com/security?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=rc-lite-plugin&amp;utm_content=popular&amp;utm_term=description\" rel=\"nofollow ugc\">BackupBuddy</a> used by hundreds of thousands of people just like you.</p>\n<h4>✏️ From our blog</h4>\n<p>Check out some of our popular posts for actionable advice for running membership sites.</p>\n<ul>\n<li><a href=\"https://restrictcontentpro.com/top-8-benefits-to-running-a-membership-site/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=8-benefits&amp;utm_term=description\" rel=\"nofollow ugc\">The top 8 benefits of running a membership site</a></li>\n<li><a href=\"https://restrictcontentpro.com/which-membership-model-is-best-for-your-business/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=which-model&amp;utm_term=description\" rel=\"nofollow ugc\">Which membership model is best for your business?</a></li>\n<li><a href=\"https://restrictcontentpro.com/how-to-start-a-membership-site-on-a-budget/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=start-on-budget&amp;utm_term=description\" rel=\"nofollow ugc\">How to start a membership site on a budget</a></li>\n<li><a href=\"https://restrictcontentpro.com/should-you-be-offering-tiered-memberships/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=tiered-memberships&amp;utm_term=description\" rel=\"nofollow ugc\">Should you be offering tiered memberships?</a></li>\n</ul>\n<p><strong><a href=\"https://restrictcontentpro.com/subscribe/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=subscribe&amp;utm_term=description\" rel=\"nofollow ugc\">Subscribe to our newsletter</a></strong> to get posts like these in your inbox as soon as they’re published.</p>\n<h3>Install Restrict Content Manually</h3>\n<ol>\n<li>From the dashboard of your site, navigate to Plugins &#8211;&gt; Add New.</li>\n<li>Select the Upload option and hit &#8220;Choose File.&#8221;</li>\n<li>When the popup appears select the restrict-content-x.x.zip file from your desktop. (The &#8216;x.x&#8217; will change depending on the current version number).</li>\n<li>Follow the on-screen instructions and wait as the upload completes.</li>\n<li>When it&#8217;s finished, activate the plugin via the prompt. A message will show confirming activation was successful.</li>\n</ol>\n<p>That&#8217;s it! Just configure your settings as you see fit, and you&#8217;re on your way to restricting content. Need help getting things started? Check out our <a href=\"https://help.ithemes.com/hc/en-us/articles/4402387794587-Getting-Started-with-Restrict-Content\" rel=\"nofollow ugc\">getting started guide</a> for help with settings and features.</p>\n<p>To restrict an entire post or page, simply select the user level or membership level you’d like to restrict the post or page to from the drop down menu added just below the post/page editor.</p>\n<p>There is also a short code for showing content only to users that are not logged in.</p>\n<p>[not_logged_in]This content is only shown to non-logged-in users.[/not_logged_in]</p>\n",
        "installation": "<ol>\n<li>Visit the plugins page within your dashboard and select ‘Add New’</li>\n<li>Search for &#8220;Restrict Content&#8221;</li>\n<li>Activate Restrict Content from your Plugins page</li>\n<li>You&#8217;re done!</li>\n</ol>\n",
        "faq": "\n<dt id='can%20i%20just%20restrict%20part%20of%20a%20post%2Fpage%3F'>\nCan I just restrict part of a post/page?\n</h4>\n<p>\n<p>Yes. You can choose exactly which content to protect with the [restrict] shortcode. You can set the <code>userlevel</code> attribute to specify which role is required to view the content. For example, to restrict to editors you would use: <code>[restrict userlevel=”editor”]Your protected content here.[/restrict]</code></p>\n</p>\n<dt id='can%20i%20charge%20customers%20when%20they%20register%20an%20account%3F'>\nCan I charge customers when they register an account?\n</h4>\n<p>\n<p>Yes! With the Restrict Content plugin, you can offer paid membership levels with manual payments or Stripe. For even more payment gateways, check out <a href=\"https://restrictcontentpro.com/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=faq\" rel=\"nofollow ugc\">Restrict Content Pro</a>.</p>\n</p>\n<dt id='does%20the%20plugin%20protect%20images%20and%20other%20media%20files%3F'>\nDoes the plugin protect images and other media files?\n</h4>\n<p>\n<p>Yes. Restrict Content can restrict access to media that is embedded within a post or page, but it does not protect the original file URL on the server.</p>\n</p>\n<dt id='can%20i%20restrict%20content%20in%20my%20rss%20feed%3F'>\nCan I restrict content in my RSS feed?\n</h4>\n<p>\n<p>Yes. There’s a checkbox for this within each post/page. If enabled, that content in your RSS feed will be restricted.</p>\n</p>\n<dt id='can%20i%20integrate%20newsletter%20signups%20with%20the%20registration%20form%3F'>\nCan I integrate newsletter signups with the registration form?\n</h4>\n<p>\n<p>Not with this plugin, but <a href=\"https://restrictcontentpro.com/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=faq\" rel=\"nofollow ugc\">Restrict Content Pro</a> has integrations for many popular email marketing providers, including Mailchimp, ConvertKit, ActiveCampaign, and more.</p>\n</p>\n<dt id='do%20restrictions%20work%20in%20rest%20api%20requests%3F'>\nDo restrictions work in REST API requests?\n</h4>\n<p>\n<p>Yes. All restrictions apply in REST API requests &#8211; exactly the same as if viewing your site normally.</p>\n</p>\n<dt id='does%20restrict%20content%20work%20with%20the%20gutenberg%20editor%20%2F%20the%20wordpress%20block%20editor%3F'>\nDoes Restrict Content work with the Gutenberg editor / the WordPress block editor?\n</h4>\n<p>\n<p>Yes. Full page restriction settings as well as the <code>[restrict]</code>, <code>[register_form]</code>, and <code>[login_form]</code> shortcodes all work with Gutenberg.</p>\n</p>\n<dt id='does%20this%20plugin%20support%20restricting%20access%20by%20custom%20user%20roles%3F'>\nDoes this plugin support restricting access by custom user roles?\n</h4>\n<p>\n<p>Yes! Restrict Content provides the ability to limit access based on custom roles.</p>\n</p>\n<dt id='will%20the%20plugin%20work%20with%20third%20party%20page%20builders%3F'>\nWill the plugin work with third party page builders?\n</h4>\n<p>\n<p>Restrict Content works with most third party page builders. However, if using the [restrict] shortcode, most page builders will require that the opening and closing shortcode tags be within the same element/block.</p>\n</p>\n<dt id='does%20this%20plugin%20include%20frontend%20login%20or%20registration%20forms%3F'>\nDoes this plugin include frontend login or registration forms?\n</h4>\n<p>\n<p>Yes. Restrict Content includes shortcodes for a registration form, a login form, and a password reset form.</p>\n</p>\n\n",
        "changelog": "<h4>3.2.12</h4>\n<ul>\n<li>Fix: Prevent fatal errors in legacy mode.</li>\n</ul>\n<h4>3.2.11</h4>\n<ul>\n<li>Fix: Updated knowledge base links</li>\n</ul>\n<h4>3.2.10</h4>\n<ul>\n<li>Fix: Updated libraries to avoid conflicts</li>\n</ul>\n<h4>3.2.9</h4>\n<ul>\n<li>Fix: PHP 8.2+ warnings related to the creation of dynamic properties</li>\n<li>Fix: PHP 8.2+ errors after deleting a membership level</li>\n<li>Fix: Added type to button HTML elements</li>\n<li>Fix: Stripe credit card form on the Account page</li>\n<li>Fix: Proration Credits not working when changing membership level</li>\n<li>Improvement: Cancels subscriptions on Stripe after a membership level gets deleted</li>\n<li>Improvement: New styles for Group Accounts add-on</li>\n<li>Improvement: Compatibility with Ultimate Members Add-on</li>\n<li>Security: Improved validation for the default log file</li>\n<li>Security: Tightened opt-in/opt-out links security</li>\n<li>Misc: Updated links in the plugin&#8217;s general settings page</li>\n</ul>\n<h4>3.2.8</h4>\n<ul>\n<li>Fix: PayPal renew date</li>\n<li>Fix: Extended compatibility with PHP 8.x</li>\n<li>Fix: Prevent fatal error while trying to send emails using Event Tickets and The Events Calendar</li>\n<li>Fix: Don&#8217;t allow negative values for maximum renewals</li>\n<li>Misc: Updated telemetry key names</li>\n<li>Security: Fixed issues with log file</li>\n</ul>\n<h4>3.2.7</h4>\n<ul>\n<li>Fix: Stripe webhook error</li>\n<li>Misc: Removed all remaining freemius code</li>\n<li>Misc: Updated telemetry constant</li>\n</ul>\n<h4>3.2.6</h4>\n<ul>\n<li>Fix: Error in the welcome page using PHP 8.1.x.</li>\n</ul>\n<h4>3.2.5</h4>\n<ul>\n<li>Fix: Extended compatibility with PHP 8.x</li>\n<li>Fix: Fix compatibility with custom database prefix on Site Info &gt; Restrict Content Pro</li>\n<li>Updated: Languages domain path to increase ease of usage with translation plugins</li>\n<li>Security: Update third-party libraries that had vulnerabilities</li>\n</ul>\n<h4>3.2.4</h4>\n<ul>\n<li>HotFix: Resolved a conflict that caused a critical error when Restrict Content Pro is active at the same time as The Events Calendar or Event Tickets.</li>\n</ul>\n<h4>3.2.3</h4>\n<ul>\n<li>Fix: Resolved a security vulnerability on the admin pages to ensure the protection of your website.</li>\n<li>Improvement: We removed the Stripe webhooks setting in <code>Restrict &gt; Settings / Misc</code>.<br />\nRCP uses these 6 webhooks only: customer.subscription.created, customer.subscription.deleted, charge.succeeded, charge.refunded, invoice.payment_succeeded, invoice.payment_failed.<br />\nSee https://restrictcontentpro.com/knowledgebase/stripe/ for additional details.</li>\n<li>Enhancement: We have enhanced the functionality of the RCP core by incorporating the &#8216;RCP Custom Redirect&#8217; add-on. This addition allows for custom redirection capabilities within the RCP system, providing more flexibility and control for administrators.</li>\n</ul>\n<h4>3.2.2</h4>\n<ul>\n<li>Fix: Updated codes for Stripe Error messages to reduce false positives.</li>\n<li>Enhancement :Telemetry settings are now shown on initial plugin activation, and can be accessed from Plugins &gt; Installed under the Restrict Content Pro plugin.</li>\n<li>Update: Removed outdated notices for certain add-ons.</li>\n</ul>\n<h4>3.2.1</h4>\n<ul>\n<li>Enhancement: Make sure that the Stripe integration is returning a valid success or error response. Allow stripe to retry the event if it was not processed.</li>\n<li>Enhancement: Add Stripe configuration to make sure it retries events that were not process. This is helpful if many events are process at the same time.</li>\n</ul>\n<h4>3.2.0</h4>\n<ul>\n<li>Enhancement: Add new feature in our Telemetry integration to send additional information to Telemetry.</li>\n<li>Fix: Style fixes to register Forms.</li>\n<li>Fix: Earnings calculations that were not correctly evaluated.</li>\n</ul>\n<h4>3.1.9.1</h4>\n<ul>\n<li>HotFix: Fatal Error Calling <code>RCP_Telemetry</code>. Action Hook added in constructor executed before the file was included.</li>\n</ul>\n<h4>3.1.9</h4>\n<ul>\n<li>Enhancement: Replace Freemius third-party integration with our StellarWP Telemetry.</li>\n<li>Enhancement: Add reCaptcha feature from Pro.</li>\n<li>Enhancement: Add Add-Ons page.</li>\n<li>Enhancement: Add Stripe webhooks option to include any missing webhook.</li>\n<li>Update: Language domain in were using LION for rcp.</li>\n<li>Fix: Replaces Divs with tables on the &#8216;Register page&#8217; and &#8216;Your Membership&#8217; page.</li>\n<li>Fix: Gutenberg Block “Content Upgrade Redirect” that was missing.</li>\n<li>Fix: Revert div for tables in registration pages.</li>\n</ul>\n<h4>3.1.8</h4>\n<ul>\n<li>Fix: Sanitation issues in core files.</li>\n<li>Fix: Fatal error cannot redeclare “rcp_should_show_discounts” when using multiple paid registration forms.</li>\n<li>Enhancement: Update Stripe library to version 10.3.</li>\n</ul>\n<h4>3.1.7</h4>\n<ul>\n<li>Fix: Email templates that were deleted when saving any RC setting.</li>\n<li>Enhancement: Register templates and remove duplicated code.</li>\n</ul>\n<h4>3.1.6</h4>\n<ul>\n<li>Add: Freemius integration to help Restrict Content Pro be a better plugin.</li>\n</ul>\n<h4>3.1.5</h4>\n<ul>\n<li>Fix: Fixes to prevent usage of PHP Short tags.</li>\n</ul>\n<h4>3.1.4</h4>\n<ul>\n<li>Fix: Compatibility with The Events Calendar and Pods.</li>\n</ul>\n<h4>3.1.3</h4>\n<ul>\n<li>Fix: Styles from the registration button, the font size in the password hint text</li>\n</ul>\n<h4>3.1.2</h4>\n<ul>\n<li>Fix: Registration form with missing labels.</li>\n<li>Enhancement: Styling of registration form for desktop and mobile.</li>\n</ul>\n<h4>3.1.1</h4>\n<ul>\n<li>Fix: Error when updating or adding a card with Stripe. Update RCP JS Stripe code since it was using deprecated function.</li>\n<li>Enhancement: Update styles of registration page. Remove tables, replace with divs. Props @highprrrr</li>\n<li>Enhancement: Update styles of Membership page. Remove table, replace with divs. Align columns. Tweak mobile view. Give inputs a max width. Props @highprrrr.</li>\n</ul>\n<h4>3.1.0</h4>\n<ul>\n<li>Fix: Correct trail validation. Trail is valid if the number of days is greater than zero in the Membership configuration.</li>\n<li>Enhancement: Stripe statement descriptor and Statement descriptor Suffix.</li>\n<li>Enhancement: Change the label &#8220;Membership Level&#8221; -&gt; &#8220;Membership&#8221; in the exporting tools.</li>\n<li>Enhancement: Add new options in the System Info report.</li>\n<li>Feature: Add an Option to allow the user to switch between free subs.</li>\n<li>Feature: Use user levels or roles in the [restrict] shortcode. Parameter user &#8220;level&#8221;.</li>\n<li>Update: Restrict Content Branding.</li>\n</ul>\n<h4>3.0.5</h4>\n<ul>\n<li>Fix: Error using <code>[restrict]</code> shortcode in legacy version. props @fdanell</li>\n</ul>\n<h4>3.0.4</h4>\n<ul>\n<li>Fix: Broken help page form</li>\n</ul>\n<h4>3.0.3</h4>\n<ul>\n<li>Fix: Fixing upgrade logic</li>\n<li>Fix: Fixing Restrictions</li>\n<li>Fix: Multisite downgrade link</li>\n</ul>\n<h4>3.0.2</h4>\n<ul>\n<li>Fix: Set option for Stripe updates displayed to admin</li>\n<li>Fix: Renaming base plugin filename.</li>\n</ul>\n<h4>3.0.1</h4>\n<ul>\n<li>Note: Readme version bump</li>\n</ul>\n<h4>3.0</h4>\n<ul>\n<li>New: Create and Sell Memberships</li>\n<li>New: Collect payments with Stripe</li>\n<li>New: Send Customer Emails</li>\n<li>New: Powerful Content Restriction Options</li>\n<li>New: Pro Level Shortcodes added</li>\n<li>Note: Legacy version of Restrict Content still included and maintained until Dec. 2022</li>\n</ul>\n<h4>2.2.10</h4>\n<ul>\n<li>Fix: Options Comparison broken for new Installs</li>\n</ul>\n<h4>2.2.9</h4>\n<ul>\n<li>Note: Version Bump</li>\n</ul>\n<h4>2.2.8</h4>\n<ul>\n<li>Note: Tested with WordPress 5.8</li>\n<li>Improvement: Adding Help Page</li>\n<li>Improvement: Adding Welcome page on activation</li>\n</ul>\n<h4>2.2.6</h4>\n<ul>\n<li>Note: Tested with WordPress 5.7.2</li>\n<li>Improvement: Moving Restrict Content Settings from Generic Settings Menu to Admin Menu as individual menu item.</li>\n<li>Improvement: Adding additional styling to metabox settings.</li>\n<li>Tweak: Adding Why Go Pro Page</li>\n</ul>\n<h4>2.2.5</h4>\n<ul>\n<li>Note: Tested with WordPress 5.7</li>\n<li>Updating Tested Up To Version</li>\n</ul>\n<h4>2.2.4</h4>\n<ul>\n<li>Note: Tested with WordPress 5.3.</li>\n<li>Improvement: Display <code>wp_signon()</code> errors while processing login.</li>\n<li>Fix: Typo in setting description.</li>\n<li>Tweak: Adjusted plugin author name and URL.</li>\n</ul>\n<h4>2.2.3</h4>\n<ul>\n<li>Fix: Registration now works properly if you have JavaScript disabled in your browser.</li>\n</ul>\n<h4>2.2.2</h4>\n<ul>\n<li>Fix: Content visibility in the REST API.</li>\n</ul>\n<h4>2.2.1</h4>\n<ul>\n<li>Tweak: Remove hard-coded red color from restricted message. A class <code>rc-restricted-content-message</code> has been added to the span tag if you&#8217;d like to add the color back in with CSS.</li>\n<li>Tweak: The Restrict Content plugin is now auto deactivated when Restrict Content Pro is activated.</li>\n</ul>\n<h4>2.2</h4>\n<ul>\n<li>New: Login form shortcode &#8211; [login_form]</li>\n<li>New: Password reset form &#8211; part of the [login_form] shortcode</li>\n<li>New: User registration form &#8211; [register_form] shortcode</li>\n<li>New: Improved compatibility with Restrict Content Pro, allowing for seamless upgrades</li>\n<li>Fix: Undefined index PHP notice</li>\n<li>Tweak: General code cleanup and improvements</li>\n</ul>\n<h4>2.1.3</h4>\n<ul>\n<li>Fix: Undefined nonce index when saving some post types</li>\n<li>Fix: Removed restrict metabox from post types that it does not apply to</li>\n<li>Fix: Made restricted message shown in feeds translatable</li>\n<li>Fix: Some text strings not translatable</li>\n<li>Tweak: Added new rcp_metabox_excluded_post_types filter</li>\n</ul>\n<h4>2.1.2</h4>\n<ul>\n<li>Removed incorrect contextual help tab</li>\n</ul>\n<h4>2.1.1</h4>\n<ul>\n<li>Some general code cleanup and compatibility checks for WordPress 4.1+</li>\n</ul>\n<h4>2.1</h4>\n<ul>\n<li>Improved settings page to match core WordPress UI</li>\n<li>Fixed problem with unescaped HTML in restricted messages options</li>\n<li>Added complete internationalization on default language files</li>\n</ul>\n<h4>2.0.4</h4>\n<ul>\n<li>Added do_shortcode() to the not logged in short code</li>\n</ul>\n<h4>2.0.3</h4>\n<ul>\n<li>Fixed a problem with the not logged in short code.</li>\n</ul>\n<h4>2.0.2</h4>\n<ul>\n<li>Added new [not_logged_in] short code.</li>\n</ul>\n<h4>2.0</h4>\n<ul>\n<li>Added settings page with options to configure each of the messages displayed to users who do not have permission to view a page.</li>\n<li>Improved the performance of several functions.</li>\n<li>Better organization of the plugin files and improved infrastructure for soon-to-come new features.</li>\n</ul>\n"
    },
    "short_description": "Restrict Content is a powerful WordPress membership plugin that gives you full control over who can and cannot view content on your WordPress site.",
    "description": "<p>Restrict Content is a powerful WordPress membership plugin that allows you to monetize content access. As a content restriction plugin, Restrict Content gives you full control over who can and cannot view content on your WordPress site. As a design tool, Restrict Content helps you create pages that dynamically display content based on user role or membership level.</p>\n<p>Restrict Content can power a full-fledged membership or subscription website with multiple membership levels, or just hide a page or post. Restrict Content makes it simple to limit access to posts, pages, media, custom post types, and even API requests. This gives you full control over who can and who cannot view content on your WordPress site.</p>\n<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/650723404\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p>Restrict Content is completely customizable with features built for developers and extensible with a library of <a href=\"https://restrictcontentpro.com/add-ons/pro/\" rel=\"nofollow ugc\">Pro add-ons</a>.</p>\n<h4>💪 As Powerful as a WordPress Membership Plugin &#8230; or as Simple as a Content Restriction Plugin</h4>\n<p>Use Restrict Content as a <strong>WordPress membership plugin</strong> to:</p>\n<ul>\n<li><strong>Create unlimited membership levels or subscription packages.</strong> Easily create free, trial, and premium memberships or subscriptions. Each plan can be used to set a user’s access to specific content on your site.</li>\n<li><strong>Sell memberships and collect payments on your WordPress site.</strong> You can even collect payments with Stripe in the free version!</li>\n<li><strong>Control content access for your members.</strong> Decide who can access specific pages, posts, archives, and even WordPress blocks based on a member’s plan, status, and more.</li>\n<li><strong>Manage your members or subscribers.</strong> Restrict Content lets you easily keep track of your memberships through an intuitive admin interface. Quickly view active, expired, cancelled, and pending memberships. Memberships can be added manually, modified in bulk, and easily searched for when you need to locate a specific record. Each membership can also be manually modified at any time.</li>\n<li><strong>Allow members to manage their account with self-service account management. </strong> Members can easily view their account status, renewal or expiration date, and options to upgrade or cancel their account. They can also access a complete history of payments made to their account, including PDF invoices for each payment. Finally, members are able update their account name, email, and password through an included profile editor.</li>\n<li><strong>Offer prorated memberships.</strong> Customers can also upgrade and downgrade between membership levels at any time. These upgrades and downgrades are prorated based on how much the customer has already paid and how much time is left in their current membership.</li>\n<li><strong> Auto-renew membership payments.</strong> Select whether membership payments should always auto renew or let the customer decide.</li>\n</ul>\n<p>Use Restrict Content as a <strong>WordPress content restriction plugin</strong> to:</p>\n<ul>\n<li><strong>Restrict access to your WordPress site based user role.</strong> Limit access to full content via a simple interface on the post, page, and custom post type editing screens.</li>\n<li><strong>Control user access to content</strong><strong> based on WordPress user role, access level(s), or membership level(s).</strong></li>\n<li><strong>Protect sensitive content.</strong></li>\n<li><strong>Clearly separate public content from private content</strong></li>\n<li><strong>Restrict access to entire pages or specific sections</strong></li>\n<li><strong>Let users register and login from the frontend of your site</strong></li>\n</ul>\n<blockquote>\n<p>“Most plugins that restrict content are heavy and need 3rd party commerce solutions like WooCommerce to work. Restrict Content Pro has EVERYTHING built-in: memberships, payment gateways and plenty of add-ons – a true, one-stop solution for membership websites!”<br />\n  David Attard, CollectiveRay</p>\n</blockquote>\n<h4>✨ Features</h4>\n<p>Our feature-rich plugin comes with everything you need to restrict content and sell memberships from your WordPress site.</p>\n<ul>\n<li>👥 <strong>Membership Levels</strong> &#8211; Set access level, duration (in days, months, years), number of renewals, price, signup fee, status, assign WordPress user role. Set any price (including free) or optionally set a sign up fee. Set the frequency and period, and specify a user role that will be assigned to members when they register.</li>\n<li>🖥 <strong>Auto-Created Member Pages</strong> &#8211; Pages generated by the plugin include: Registration, Success, Account, Edit Profile, Update Billing Card</li>\n<li>🔁 <strong>Auto Renewals</strong> &#8211; Select to let customer choose whether to auto renew, always auto renew, or never auto renew.<br />\n💳 <strong>Payment Gateways</strong> &#8211; Stripe and Manual Payments, PayPal (Pro), Authorize.net (Pro), Braintree (Pro), Custom (Pro).</li>\n<li><span aria-hidden=\"true\" class=\"wp-exclude-emoji\">↕</span>️ <strong>Upgrade/Downgrade Membership</strong> &#8211; Allow members to change their subscription level at any time.</li>\n<li>✉️ <strong>Member Emails</strong> &#8211; Paid membership activation email, free membership activation email, cancelled membership email, expired membership email, payment received email, renewal payment failed email.</li>\n<li>📄 <strong>Payment Invoices</strong> &#8211; The payment invoice has a clean design and is printable. Customize with your logo, company name, address, email, header text, notes, and footer text</li>\n<li>🪄 <strong>Prorated memberships</strong> &#8211; Allow members to pay the price difference when they upgrade.</li>\n</ul>\n<h4>🙌 Even More Features</h4>\n<p>✔️ Redirect Default Login URL &#8211; Force the default login URL to a custom URL.<br />\n✔️ Content Excerpts &#8211; Choose whether or not to show content excerpts to members without access to the content.<br />\n✔️ Import/Export Data &#8211; Whether you prefer to maintain your own records of your memberships database, you wish to run your own analysis, or you simply need to import membership records into another service or application such as MailChimp or Excel, Restrict Content allows you to export all membership records to a CSV at anytime.<br />\n✔️ Restricted Content Message &#8211; Customize the message shown to users who do not have permission to view the content.<br />\n✔️ Restrict access to <a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a> products.</p>\n<h4>🏋️‍♀️ More Power with Pro Features</h4>\n<ul>\n<li>🏷 <strong>Discount code support</strong> &#8211; Discount codes allow you to provide your customers with special promotional codes that give them a discount on the purchase of a membership. Restrict Content Pro supports various kinds of discount codes and site administrators can easily create any number of discounts from the admin interface. Discount codes can be set up to provide a percentage discount or a flat rate discount. Each discount code is created with a name, description, unique code, maximum uses, and optional expiration dates.</li>\n<li>📈 <strong>Detailed reporting</strong> &#8211; Restrict Content Pro provides a complete reports section where you can view the earnings of your membership website. You can view total earnings for any given period or drill down to specific membership levels.</li>\n<li>🕵️‍♀️ <strong>Free trials</strong> &#8211; Allow prospective members to try a membership before they buy. Send emails to free trial users when their free trial is about to end.</li>\n<li>✉️ <strong>Member Email Customization</strong> &#8211; Add a personal touch to all of your member emails with Restrict Content Pro.</li>\n<li>🔒 <strong>Google reCAPTCHA</strong> &#8211; Protect your member login form from bots with Google reCAPTCHA.</li>\n<li>🚀 <strong> 34 Powerful Add-ons</strong> &#8211; All Restrict Content Pro plans come with all Restrict Content Pro add-ons to add more integrations and functionality to your site.</li>\n</ul>\n<p><strong><a href=\"https://restrictcontentpro.com/pricing/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=upgrade&amp;utm_term=description\" rel=\"nofollow ugc\">Upgrade to Restrict Content Pro now</a></strong></p>\n<h4>🛠 Developer Features</h4>\n<p>Restrict Content Pro has been built with developers in mind. That means it is flexible, easy to extend, and chocked full of action hooks and filters, making it easy to modify and tweak to your specific needs. With clean and simple display options, Restrict Content Pro is designed to integrate perfectly with every theme without any custom CSS being necessary.</p>\n<p>Extensive and easy to modify template files are included with Restrict Content Pro. If you have built a theme, for clients or general distribution, you can easily customize the display of registration forms, profile editor, account pages, and more through custom template files added directly to your theme’s folder.</p>\n<p>Because of the huge number of action hooks and filters, Restrict Content Pro can be easily integrated with other plugins to help provide a more seamless experience for customers. This also makes it possible to build add-on plugins for Restrict Content Pro that extend its functionality.</p>\n<p>✔️ Theme Integration &#8211; Designed to work with any theme.<br />\n✔️ Action Hooks &amp; filters galore &#8211; Restrict Content contains a bunch of action hooks and filters, allowing you to easily customize the plugin to your specific needs. Check out our extensive developer docs for actions, filters, classes, constants, and functions.<br />\n✔️ Easy to Modify Template files &#8211; Making changes to Restrict Content Pro template files is a cinch. Make a copy of any plugin template file and drop it in your theme to override the plugin’s file with your own custom markup.<br />\n✔️ So Many Integrations &#8211; Restrict Content plays nice with a bunch of plugins and third-party services, including e-commerce systems like WooCommerce, lots of Pro payment gateways, email newsletter services, and much more!<br />\n✔️ REST API &#8211; Restrict Content Pro includes a complete REST API, allowing you to extend the plugin and its functionality beyond WordPress and into your web application. The possibilities for what you can do are nearly limitless!<br />\n✔️ WP-CLI Integration &#8211; Restrict Content Pro integrates with WP-CLI. Several commands are supported in order to speed up your workflow with batch processing jobs, creating memberships, and viewing customer information.<br />\n✔️ Debug mode for developers &#8211; Turn on error logging to help identify issues. Logs are kept in Restrict &gt; Tools.</p>\n<h4>💳 Stripe payment processing support</h4>\n<p>It’s no secret that we believe <a href=\"https://stripe.com/\" rel=\"nofollow ugc\">Stripe</a> is the best payment processor. Stripe currently supports 14 languages, over 35 countries and 135+ currencies. <a href=\"https://stripe.com/global\" rel=\"nofollow ugc\">Check support for your country</a>.</p>\n<p>Hands down, Stripe has the simplest setup process and highest reliability we know of – and support for Stripe is included in Restrict Content. Stripe has a per-transaction charge which varies by country. See <a href=\"https://stripe.com/pricing\" rel=\"nofollow ugc\">Stripe’s pricing page</a> for more information. However, if you prefer a different payment gateway or your country does not support Stripe, we’ve got you covered&#8230;</p>\n<p>Besides Stripe, we have several payment gateways available to Restrict Content Pro. Visit the following links to get more details for the payment gateway of your choice.</p>\n<ul>\n<li><a href=\"https://restrictcontentpro.com/tour/payment-gateways/paypal/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=paypal&amp;utm_term=description\" rel=\"nofollow ugc\">PayPal</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/payment-gateways/authorize-net/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=authorize-net&amp;utm_term=description\" rel=\"nofollow ugc\">Authorize.Net</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/payment-gateways/braintree/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=braintree&amp;utm_term=description\" rel=\"nofollow ugc\">Braintree</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/payment-gateways/add-your-own/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=add-your-own&amp;utm_term=description\" rel=\"nofollow ugc\">Build your own (extensive API available)</a></li>\n</ul>\n<h4>🧰 Shortcodes</h4>\n<ul>\n<li>Limit access to content with a shortcode. Example: <code>[restrict]This content is limited to logged in users.[/restrict]</code></li>\n<li>Limit access to content based on user role. Example: <code>[restrict userlevel=\"editor\"]Only editors and higher can see this content.[/restrict]</code></li>\n<li>Display a registration form for new accounts on any page of your website with <code>[register_form]</code>.</li>\n<li>Display a login form for existing users on any page of your website with <code>[login_form]</code>.</li>\n</ul>\n<h4>🛒 WooCommerce integration</h4>\n<p>Restrict Content allows you to easily control who can view and/or purchase products in <a href=\"https://woocommerce.com/\" rel=\"nofollow ugc\">WooCommerce</a>, the most popular eCommerce plugin for WordPress.</p>\n<h4>💬 Get reliable help</h4>\n<p>Restrict Content is backed by top-notch technical support from our full-time support team. We also have extensive <a href=\"https://help.ithemes.com/hc/en-us/categories/360004039733-Restrict-Content-Pro?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=docs&amp;utm_term=description\" rel=\"nofollow ugc\">documentation site</a> available. If you’re looking for faster support via email, we encourage you to purchase a <a href=\"https://restrictcontentpro.com/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=purchase&amp;utm_term=description\" rel=\"nofollow ugc\">Restrict Content Pro license</a>.</p>\n<p>We check in on the <a href=\"https://wordpress.org/support/plugin/restrict-content\" rel=\"ugc\">The Restrict Content forum here on WordPress.org</a> about once a week to help users with basic troubleshooting and identifying bugs. If you’re looking for premium, personalized support, consider upgrading to Restrict Content Pro.</p>\n<h3>📃 Documentation</h3>\n<p>All of our documentation can be found in the <a href=\"https://help.ithemes.com/hc/en-us/categories/360004039733-Restrict-Content-Pro\" rel=\"nofollow ugc\">iThemes Help Docs</a>.</p>\n<h4>🤔 Who is Restrict Content Pro for?</h4>\n<p>No matter what kind of membership site or plans you offer, Restrict Content Pro can be adapted to suit your business needs – and set up in <a href=\"https://restrictcontentpro.com/tour/use-cases/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=use-cases&amp;utm_term=description\" rel=\"nofollow ugc\">many different ways</a>, based on how you want to allow members to access your site’s content.</p>\n<p>Here are a few examples:</p>\n<ul>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/member-blogs/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=member-blogs&amp;utm_term=description\" rel=\"nofollow ugc\">Member Blogs</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/group-accounts/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=group-accounts&amp;utm_term=description\" rel=\"nofollow ugc\">Group Accounts</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/club-memberships/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=club-memberships&amp;utm_term=description\" rel=\"nofollow ugc\">Club Memberships</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/co-operatives/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=co-operatives&amp;utm_term=description\" rel=\"nofollow ugc\">Co-operatives</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/job-boards/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=job-boards&amp;utm_term=description\" rel=\"nofollow ugc\">Job Boards</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/magazine-subscriptions/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=magazine-subscriptions&amp;utm_term=description\" rel=\"nofollow ugc\">Magazine Subscriptions</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/maintenance-contracts/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=maintenance-contracts&amp;utm_term=description\" rel=\"nofollow ugc\">Maintenance Contracts</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/private-communities/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=private-communities&amp;utm_term=description\" rel=\"nofollow ugc\">Private Communities</a></li>\n<li><a href=\"https://restrictcontentpro.com/tour/use-cases/support-agreements/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=support-agreements&amp;utm_term=description\" rel=\"nofollow ugc\">Support Agreements</a></li>\n</ul>\n<blockquote>\n<p>“RCP is always at the top of my list when helping clients choose a membership platform. In addition to being a great plugin ​today​, the pace of improvement is impressive. RCP gets better and better all the time.”<br />\n  Travis Northcutt, Member Up</p>\n</blockquote>\n<h4>💌 Email marketing service provider add-ons</h4>\n<p>With a Professional or higher license, you can connect Restrict Content Pro to any of the following email marketing service providers. This allows you to add members to your mailing lists for different membership levels as well as synchronize account details.</p>\n<ul>\n<li><a href=\"https://restrictcontentpro.com/downloads/mailchimp-pro/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=mailchimp&amp;utm_term=description\" rel=\"nofollow ugc\">Mailchimp</a></li>\n<li><a href=\"https://restrictcontentpro.com/downloads/aweber-pro/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=aweber&amp;utm_term=description\" rel=\"nofollow ugc\">AWeber</a></li>\n<li><a href=\"https://restrictcontentpro.com/downloads/convertkit/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=convertkit&amp;utm_term=description\" rel=\"nofollow ugc\">ConvertKit</a></li>\n<li><a href=\"https://restrictcontentpro.com/downloads/activecampaign/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=activecampaign&amp;utm_term=description\" rel=\"nofollow ugc\">ActiveCampaign</a></li>\n</ul>\n<h4>🔌 Other add-ons in Restrict Content Pro</h4>\n<ul>\n<li><a href=\"https://restrictcontentpro.com/downloads/group-accounts/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=group-accounts&amp;utm_term=description\" rel=\"nofollow ugc\">Group Accounts</a> &#8211; Sell multi-member group memberships.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/drip-content/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=drip-content&amp;utm_term=description\" rel=\"nofollow ugc\">Drip Content</a> &#8211; Release content to members on a schedule.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/custom-redirects/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=custom-redirects&amp;utm_term=description\" rel=\"nofollow ugc\">Custom Redirects</a> &#8211; Specify where members are redirected on a per-membership-level basis.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/woocommerce-member-discounts/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=woocommerce&amp;utm_term=description\" rel=\"nofollow ugc\">WooCommerce Member Discounts</a> &#8211; Give members automatic discounts on purchases in your WooCommerce store.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/site-creation/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=site-creation&amp;utm_term=description\" rel=\"nofollow ugc\">Site Creation</a> &#8211; Allow paid members to purchase sites in a WordPress multisite.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/restriction-timelock/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=timelock&amp;utm_term=description\" rel=\"nofollow ugc\">Restriction Timelock</a> &#8211; Keep content unrestricted until a specified date in the future.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/restriction-timeouts/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=timeouts&amp;utm_term=description\" rel=\"nofollow ugc\">Restriction Timeouts</a> &#8211; Specify a date and time when restricted content will have its restrictions removed, making it available to everyone.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/restrict-past-content/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=past-content&amp;utm_term=description\" rel=\"nofollow ugc\">Restrict Past Content</a> &#8211; Restrict content published prior to a member&#8217;s join date.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/hard-set-expiration-dates/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=expiration&amp;utm_term=description\" rel=\"nofollow ugc\">Hard-set Expiration Dates</a> &#8211; Allows for a specific expiration date to be assigned to membership levels.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/help-scout/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=help-scout&amp;utm_term=description\" rel=\"nofollow ugc\">Help Scout</a> &#8211; Display customer&#8217;s membership information from Restrict Content Pro inside of Help Scout when viewing tickets.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/math-verification/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=math&amp;utm_term=description\" rel=\"nofollow ugc\">Math Verification</a> &#8211; Add a math verification field to registration forms.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/ip-restriction/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=ip&amp;utm_term=description\" rel=\"nofollow ugc\">IP Restriction</a> &#8211; Allow specific IP addresses to bypass content restrictions and ban other IP addresses from signing up for a membership plan.</li>\n<li><a href=\"https://restrictcontentpro.com/downloads/enforce-strong-passwords/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=strong-passwords&amp;utm_term=description\" rel=\"nofollow ugc\">Enforce Strong Passwords</a> &#8211; Enforce strong passwords during registration.</li>\n</ul>\n<h4>👋 Meet the team</h4>\n<p>Restrict Content is built by <a href=\"https://iThemes.com/team/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=rc-lite-plugin&amp;utm_content=ithemes&amp;utm_term=description\" rel=\"nofollow ugc\">iThemes</a>. We also make popular WordPress plugins like <a href=\"https://ithemes.com/security?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=rc-lite-plugin&amp;utm_content=popular&amp;utm_term=description\" rel=\"nofollow ugc\">iThemes Security Pro</a> and <a href=\"https://ithemes.com/security?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=rc-lite-plugin&amp;utm_content=popular&amp;utm_term=description\" rel=\"nofollow ugc\">BackupBuddy</a> used by hundreds of thousands of people just like you.</p>\n<h4>✏️ From our blog</h4>\n<p>Check out some of our popular posts for actionable advice for running membership sites.</p>\n<ul>\n<li><a href=\"https://restrictcontentpro.com/top-8-benefits-to-running-a-membership-site/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=8-benefits&amp;utm_term=description\" rel=\"nofollow ugc\">The top 8 benefits of running a membership site</a></li>\n<li><a href=\"https://restrictcontentpro.com/which-membership-model-is-best-for-your-business/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=which-model&amp;utm_term=description\" rel=\"nofollow ugc\">Which membership model is best for your business?</a></li>\n<li><a href=\"https://restrictcontentpro.com/how-to-start-a-membership-site-on-a-budget/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=start-on-budget&amp;utm_term=description\" rel=\"nofollow ugc\">How to start a membership site on a budget</a></li>\n<li><a href=\"https://restrictcontentpro.com/should-you-be-offering-tiered-memberships/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=tiered-memberships&amp;utm_term=description\" rel=\"nofollow ugc\">Should you be offering tiered memberships?</a></li>\n</ul>\n<p><strong><a href=\"https://restrictcontentpro.com/subscribe/?utm_medium=readme&amp;utm_source=wporg&amp;utm_campaign=lite-plugin&amp;utm_content=subscribe&amp;utm_term=description\" rel=\"nofollow ugc\">Subscribe to our newsletter</a></strong> to get posts like these in your inbox as soon as they’re published.</p>\n<h3>Install Restrict Content Manually</h3>\n<ol>\n<li>From the dashboard of your site, navigate to Plugins &#8211;&gt; Add New.</li>\n<li>Select the Upload option and hit &#8220;Choose File.&#8221;</li>\n<li>When the popup appears select the restrict-content-x.x.zip file from your desktop. (The &#8216;x.x&#8217; will change depending on the current version number).</li>\n<li>Follow the on-screen instructions and wait as the upload completes.</li>\n<li>When it&#8217;s finished, activate the plugin via the prompt. A message will show confirming activation was successful.</li>\n</ol>\n<p>That&#8217;s it! Just configure your settings as you see fit, and you&#8217;re on your way to restricting content. Need help getting things started? Check out our <a href=\"https://help.ithemes.com/hc/en-us/articles/4402387794587-Getting-Started-with-Restrict-Content\" rel=\"nofollow ugc\">getting started guide</a> for help with settings and features.</p>\n<p>To restrict an entire post or page, simply select the user level or membership level you’d like to restrict the post or page to from the drop down menu added just below the post/page editor.</p>\n<p>There is also a short code for showing content only to users that are not logged in.</p>\n<p>[not_logged_in]This content is only shown to non-logged-in users.[/not_logged_in]</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/restrict-content.3.2.12.zip",
    "upgrade_notice": {
        "2.2.1": "<p>Removed hard-coded red color from restriction message and deactivate plugin when pro version is activated.</p>",
        "2.1": "<ul>\n<li>Improved settings page to match core WordPress UI</li>\n<li>Fixed problem with unescaped HTML in restricted messages options</li>\n<li>Added complete internationalization on default language files</li>\n</ul>",
        "2.0.4": "<ul>\n<li>Added do_shortcode() to the not logged in short code</li>\n</ul>",
        "2.0.3": "<ul>\n<li>Fixed a problem with the not logged in short code.</li>\n</ul>",
        "2.0.2": "<ul>\n<li>Added new [not_logged_in] short code.</li>\n</ul>",
        "2.0": "<p>Added message configuration, custom post type support, and improved plugin infrastructure.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/restrict-content/assets/screenshot-1.png?rev=2287616",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/restrict-content/assets/screenshot-2.png?rev=2287616",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/restrict-content/assets/screenshot-3.png?rev=2287616",
            "caption": ""
        }
    ],
    "tags": {
        "membership": "membership",
        "registration-form": "registration form",
        "restrict-access": "Restrict access",
        "restrict-pages": "restrict pages",
        "restrict-posts": "restrict posts"
    },
    "stable_tag": "3.2.12",
    "versions": {
        "1.1": "https://downloads.wordpress.org/plugin/restrict-content.1.1.zip",
        "1.2": "https://downloads.wordpress.org/plugin/restrict-content.1.2.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/restrict-content.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/restrict-content.1.2.2.zip",
        "2.0": "https://downloads.wordpress.org/plugin/restrict-content.2.0.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/restrict-content.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/restrict-content.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/restrict-content.2.0.4.zip",
        "2.1": "https://downloads.wordpress.org/plugin/restrict-content.2.1.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/restrict-content.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/restrict-content.2.1.2.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/restrict-content.2.1.3.zip",
        "2.2": "https://downloads.wordpress.org/plugin/restrict-content.2.2.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/restrict-content.2.2.1.zip",
        "2.2.10": "https://downloads.wordpress.org/plugin/restrict-content.2.2.10.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/restrict-content.2.2.2.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/restrict-content.2.2.3.zip",
        "2.2.4": "https://downloads.wordpress.org/plugin/restrict-content.2.2.4.zip",
        "2.2.5": "https://downloads.wordpress.org/plugin/restrict-content.2.2.5.zip",
        "2.2.7": "https://downloads.wordpress.org/plugin/restrict-content.2.2.7.zip",
        "2.2.8": "https://downloads.wordpress.org/plugin/restrict-content.2.2.8.zip",
        "2.2.9": "https://downloads.wordpress.org/plugin/restrict-content.2.2.9.zip",
        "3.0": "https://downloads.wordpress.org/plugin/restrict-content.3.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/restrict-content.3.0.1.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/restrict-content.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/restrict-content.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/restrict-content.3.0.4.zip",
        "3.0.5": "https://downloads.wordpress.org/plugin/restrict-content.3.0.5.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/restrict-content.3.1.0.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/restrict-content.3.1.1.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/restrict-content.3.1.2.zip",
        "3.1.3": "https://downloads.wordpress.org/plugin/restrict-content.3.1.3.zip",
        "3.1.4": "https://downloads.wordpress.org/plugin/restrict-content.3.1.4.zip",
        "3.1.5": "https://downloads.wordpress.org/plugin/restrict-content.3.1.5.zip",
        "3.1.6": "https://downloads.wordpress.org/plugin/restrict-content.3.1.6.zip",
        "3.1.7": "https://downloads.wordpress.org/plugin/restrict-content.3.1.7.zip",
        "3.1.8": "https://downloads.wordpress.org/plugin/restrict-content.3.1.8.zip",
        "3.1.9": "https://downloads.wordpress.org/plugin/restrict-content.3.1.9.zip",
        "3.1.9.1": "https://downloads.wordpress.org/plugin/restrict-content.3.1.9.1.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/restrict-content.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/restrict-content.3.2.1.zip",
        "3.2.10": "https://downloads.wordpress.org/plugin/restrict-content.3.2.10.zip",
        "3.2.11": "https://downloads.wordpress.org/plugin/restrict-content.3.2.11.zip",
        "3.2.12": "https://downloads.wordpress.org/plugin/restrict-content.3.2.12.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/restrict-content.3.2.2.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/restrict-content.3.2.3.zip",
        "3.2.4": "https://downloads.wordpress.org/plugin/restrict-content.3.2.4.zip",
        "3.2.5": "https://downloads.wordpress.org/plugin/restrict-content.3.2.5.zip",
        "3.2.6": "https://downloads.wordpress.org/plugin/restrict-content.3.2.6.zip",
        "3.2.7": "https://downloads.wordpress.org/plugin/restrict-content.3.2.7.zip",
        "3.2.8": "https://downloads.wordpress.org/plugin/restrict-content.3.2.8.zip",
        "3.2.9": "https://downloads.wordpress.org/plugin/restrict-content.3.2.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/restrict-content.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/restrict-content/assets/banner-772x250.png?rev=2749858",
        "high": "https://ps.w.org/restrict-content/assets/banner-1544x500.png?rev=2749858"
    },
    "icons": {
        "1x": "https://ps.w.org/restrict-content/assets/icon.svg?rev=2749858",
        "svg": "https://ps.w.org/restrict-content/assets/icon.svg?rev=2749858"
    },
    "blocks": {
        "restrict-content-pro/content-upgrade-redirect": {
            "apiVersion": 2,
            "name": "restrict-content-pro/content-upgrade-redirect",
            "title": "Content Upgrade Redirect",
            "category": "restrict-content-pro",
            "icon": "paperclip",
            "description": "Link to a page containing a Registration Form, then redirect the registration form to the specified Redirect URL.",
            "textdomain": "rcp",
            "keywords": [
                "restrict",
                "rcp",
                "content-upgrade-redirect"
            ],
            "attributes": {
                "redirectUrl": {
                    "type": "string"
                },
                "registrationUrl": {
                    "type": "string"
                },
                "loginUrl": {
                    "type": "string"
                }
            },
            "editorScript": "file:../../../build/content-upgrade-redirect.js",
            "editorStyle": "file:../../../build/content-upgrade-redirect.css",
            "style": "file:../../../build/style-content-upgrade-redirect.css",
            "supports": {
                "html": false
            }
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 64,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "restrict-content",
            "language": "da_DK",
            "version": "3.2.12",
            "updated": "2018-01-16 15:07:50",
            "package": "http://downloads.wordpress.org/translation/plugin/restrict-content/3.2.12/da_DK.zip"
        },
        {
            "type": "plugin",
            "slug": "restrict-content",
            "language": "en_GB",
            "version": "3.2.12",
            "updated": "2023-12-20 09:43:44",
            "package": "http://downloads.wordpress.org/translation/plugin/restrict-content/3.2.12/en_GB.zip"
        },
        {
            "type": "plugin",
            "slug": "restrict-content",
            "language": "en_CA",
            "version": "3.2.12",
            "updated": "2016-04-24 12:13:34",
            "package": "http://downloads.wordpress.org/translation/plugin/restrict-content/3.2.12/en_CA.zip"
        },
        {
            "type": "plugin",
            "slug": "restrict-content",
            "language": "es_ES",
            "version": "3.2.12",
            "updated": "2024-07-17 19:05:37",
            "package": "http://downloads.wordpress.org/translation/plugin/restrict-content/3.2.12/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "restrict-content",
            "language": "fi",
            "version": "3.2.12",
            "updated": "2017-05-31 13:05:01",
            "package": "http://downloads.wordpress.org/translation/plugin/restrict-content/3.2.12/fi.zip"
        },
        {
            "type": "plugin",
            "slug": "restrict-content",
            "language": "fr_FR",
            "version": "3.2.12",
            "updated": "2020-01-16 09:50:47",
            "package": "http://downloads.wordpress.org/translation/plugin/restrict-content/3.2.12/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "restrict-content",
            "language": "he_IL",
            "version": "3.2.12",
            "updated": "2016-04-24 11:31:21",
            "package": "http://downloads.wordpress.org/translation/plugin/restrict-content/3.2.12/he_IL.zip"
        },
        {
            "type": "plugin",
            "slug": "restrict-content",
            "language": "it_IT",
            "version": "3.2.12",
            "updated": "2022-08-13 13:53:16",
            "package": "http://downloads.wordpress.org/translation/plugin/restrict-content/3.2.12/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "restrict-content",
            "language": "nl_NL_formal",
            "version": "3.2.12",
            "updated": "2022-05-05 12:42:10",
            "package": "http://downloads.wordpress.org/translation/plugin/restrict-content/3.2.12/nl_NL_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "restrict-content",
            "language": "nl_NL",
            "version": "3.2.12",
            "updated": "2023-12-20 23:15:24",
            "package": "http://downloads.wordpress.org/translation/plugin/restrict-content/3.2.12/nl_NL.zip"
        }
    ]
}