{
    "name": "Resultat Finans Betallösning",
    "slug": "resultat-finans-betallosning",
    "version": "2.2",
    "author": "<a href=\"http://www.resultatfinans.se\">Resultat Finans</a>",
    "author_profile": "https://profiles.wordpress.org/rfabanvandare/",
    "contributors": {
        "rfabanvandare": {
            "profile": "https://profiles.wordpress.org/rfabanvandare/",
            "avatar": "https://secure.gravatar.com/avatar/ae69625dfa79aea6f690869cab2c5b70?s=96&d=monsterid&r=g",
            "display_name": "rfabanvandare"
        }
    },
    "requires": false,
    "tested": false,
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/resultat-finans-betallosning/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 0,
    "downloaded": 620,
    "last_updated": "2018-02-12 9:20am GMT",
    "added": "2018-02-12",
    "homepage": "https://wordpress.org/plugins/Resultat-finans-betallosning/",
    "sections": {
        "description": "<p>Resultat Finans betallosning ar en enkel och smidig betallosning som med nagra fa knapptryck latt integreras i din e-handelsbutik. Den mojliggor en snabb och trygg affar for kunden, och tillhandahaller fran 10,90:- SEK per kop fakturaservice till inkassohantering. Ingen finansieringskostnad. Du behaller 100% av det du saljer.<br />\nTillagget kraver att avtal traffas mellan anvandare och Resultat Finans.<br />\nFor att snabbt komma igang med din betallosning, vanligen ladda ner tillagget och kontakta Resultat Finans:<br />\nEpost: info@resultatfinans.se<br />\nTelefon: 042-300 97 85</p>\n<p>Gallande fran 2018.02.05<br />\nInformation om Resultat Finans<br />\nResultat Finans Aktiebolag, Org.nr. 556834-0284<br />\nBox 1165, 251 11 Helsingborg,<br />\nTfn vaxel: 042-300 97 85<br />\nHemsida: www.resultatfinans.se</p>\n<p>Styrelsen har sitt sate i Helsingborg, Skane lan.<br />\nResultat Finans har inkassotillstand utfardat av datainspektionen och ar registrerade hos Finansinspektionen (enligt SFS 1996:1006). Finansinspektionen, Box 7821, 103 97 STOCKHOLM.</p>\n<p>Allmant<br />\nDessa anvandarvillkor omfattar Resultat Finans betallosning (Tjansten) som tillhandahalls av Resultat Finans AB (Resultat Finans). Avtalsvillkoren gor sig gallande vid ditt (Kundens) nyttjande av Tjansten och vid Resultat Finans tillhandahallande av Tjansten.<br />\nOm anvandarvillkoren i detta avtal inte samtyckts till, kan inte Tjansten anvandas. Tjansten tillhandahalls i befintligt skick och sa som det ar tillgangligt. Resultat Finans begransningar i fraga om ansvar och tillganglighet framgar nedan.<br />\nFor dessa villkor och kommunikation med anledning harav ska svenska spraket tillampas. Resultat Finans rekommenderar kunden att gora en utskrift av dessa anvandarvillkor. Kunden har dock ratt att begara att villkoren och annan skriftlig information om Tjansten som har lamnats av Resultat Finans fore eller i samband med nyttjande av Tjansten skickas med post till din folkbokforingsadress. Bestallning av villkor och eventuell annan skriftlig information kan goras hos Resultat Finans.</p>\n<p>Definitioner<br />\nFoljande ord och begrepp ska i dessa anvandarvillkor anses ha den innebord som anges nedan.<br />\nBankdag: En dag nar medverkande banker eller annan betaltjanstleverantor har oppet for verksamhet i den utstrackning som kravs for genomforande av en betalningstransaktion.<br />\nBetalare: En fysisk eller juridisk person som antingen ar en kontoinnehavare och som godkanner en Betalningsorder fran ett konto, eller en fysisk eller juridisk person som lamnar en Betalningsorder.<br />\nKunden: Den fysiska eller juridiska person som ingar avtal om integration av Resultat Finans Betallosning.<br />\nResultat Finans Betallosning: En elektronisk tjanst som tillhandahalls av Resultat Finans och som syftar till att mojliggora fakturahantering, paminnelsehantering och inkasso vid distanskop av produkter och tjanster over Internet.<br />\nSlutanvandare: Den fysiska eller juridiska person som ar betalare av varor eller tjanster medierade genom Resultat Finans Betallosning.<br />\nTjansteutbud: Faktura- och paminnelsehantering, efterbevakning och inkasso.<br />\nTjansten: Den elektroniska tjansten Resultat Finans Betallosning.</p>\n<p>Beskrivning av Tjansten<br />\nMed tjansten menas i detta anvandaravtal en paketlosning genom vilken Kunden kan erbjuda slutanvandaren fakturahantering vid distanskop av tjanster och produkter over internet. Fakturahantering i denna mening innefattar, fransett fakturering, vidare bade paminnelsehantering, efterbevakning och inkasso till vilka slutanvandaren kan erbjudas avbetalningsplaner via e-post eller brev.</p>\n<p>Krav pa utrustning och programvara<br />\nFor att anvanda Tjansten kravs uppkoppling mot internet. natverk for datakommunikation, t ex Internet. For sadan uppkoppling kravs dator, smart telefon, lasplatta eller liknande teknisk utrustning och kommunikationsutrustning och programvara.</p>\n<p>Resultat Finans utvecklar kontinuerligt funktionaliteten i Tjansten varfor Resultat Finans rekommenderar kunden att anvanda operativsystem och webblasare som uppdateras och stods av tillverkarna.<br />\nDu ansvarar alltid sjalv for tillgang till den tekniska utrustning och programvara som kravs for att anvanda Tjansten samt eventuella kostnader for sadan utrustning. Du ska visa normal aktsamhet vid anvandning av Tjansten och dar sa ar mojligt anvanda antivirusprogram och brandvaggar.<br />\nAnvandning av Tjansten kan medfora att du belastas av trafikavgifter for datatrafik. Ansvaret for betalning av sadana avgifter aligger enbart kunden och regleras i ditt avtal med din leverantor av datatrafik. Resultat Finans ar inte ansvarig for betalning av trafikavgifter.</p>\n<p>Forutsattningar for att anvanda Tjansten<br />\nDu maste uppfylla de sarskilda krav som Resultat Finans anger vid bestallningstillfallet.<br />\nNar kunden lamnat samtycke for genomforandet av en bestallningsorder ska denna betraktas som godkand av kunden. Nar kunden lamnat samtycke for anvandande av Resultat Finans Betallosning, skall kontakt initieras med Resultat Finans i syfte att innan slutligt godkannande av integrationen sakerstalla kundens identitet och uppratthalla Resultat Finans skyldighet att ha god kunskap om kunden och kundens affarer. Om Resultat Finans inte kan sakerstalla kundens identitet, eller vidare bedomer att det foreligger befogad risk for bedrageri, ager Resultat Finans ratt att neka slutligt godkannande av bestallningsorder.<br />\nOm personuppgiftshantering<br />\nFor att mojliggora anvandning av Tjansten kommer Resultat Finans att be kunden att lamna sarskilda personuppgifter sasom namn, personnummer och organisationsnummer. Resultat Finans vidtar, i enlighet med deras policy, atgarder for att styrka riktigheten i de uppgifter som utlamnats innan avtal kan intradas for att bruka Tjansten. Informationen kommer att anvandas i syfte att administrera arendet i Tjansten. I samband med bestallning av tjansten kommer Resultat Finans att kreditprova kundens ansokan t.ex. genom kontroll av uppgifter om ekonomi, samt verifikation av andra givna uppgifter och bakgrundsinformation.<br />\nFor den slutanvandare som genom kundens plattform avser genomfora ett genom Resultat Finans Betallosning medierat distanskop, atar sig att vid varje tidpunkt forhalla sig till de villkor som gor sig gallande for att bruka Tjansten. For narvarande omfattar dessa villkor lagring av personuppgifter, mobiltelefonnummer, e-postadress samt information inhamtad genom tredje part med avseende pa dennes kreditvardighet.</p>\n<p>Du ska vid bestallningstillfallet uppge<br />\nOm kunden ansoker om Tjansten hos Resultat Finans kommer denne efterfragas att godkanna Resultat Finans villkor harfor. Med avseende pa kundens godkannande lamnas bl.a. samtycke till att Resultat Finans samlar in, behandlar, anvander och distribuerar kundens personuppgifter i syfte att behandla ansokan. Om samtycke ej lamnas kan Resultat Finans inte ta emot kundens ansokan. Samtycke omfattar alla personuppgifter kunden lamnar i ansokan, all ytterligare information som Resultat Finans forses av kunden med anledning av ansokan och all annan information som Resultat Finans inhamtar fran tredje part i syfte att behandla ansokan.<br />\nOm ansokan beviljas kommer Resultat Finans att hantera kundens personuppgifter i enlighet med vad som anges i villkoren for det specifika tjansteutbud som ar knutet till Tjansten.<br />\nResultat Finans, eller den Resultat Finans anlitar, kan komma att behandla personuppgifterna for att administrera Tjansten samt for hantering av eventuell kreditansokan. Kundens personuppgifter kan ocksa komma att lamnas ut till sadana tredje parter med vilka Resultat Finans samarbetar, exempelvis IT-leverantorer och externa bolag som kan vara involverade i Resultat Finans processer.<br />\nResultat Finans ansvarar for att de personuppgifter kunden delger Resultat Finans skyddas, och Resultat Finans vidtar lampliga tekniska och organisatoriska sakerhetsatgarder for att skydda kundens personuppgifter.<br />\nPersonuppgiftsansvarig for behandling av uppgifter ar Resultat Finans Aktiebolag med organisationsnummer 556834-0284. Om du har nagra fragor eller funderingar kring anvandandet av personuppgifter kan du kontakta Resultat Finans kundservice, se avtalets ingress &#8211; Information om Resultat Finans.<br />\nSlutanvandare kan nar som helst begara att egna personuppgifter korrigeras eller raderas. Det finns aven mojlighet att kostnadsfritt erhalla uppgift om vilka personuppgifter som Resultat Finans behandlar om kunden. Skriv till -Resultat Finans Aktiebolag, Box 1165 Sodra Strandgatan 15, 251 11, Helsingborg-.<br />\nSamtycke till marknadsforing samt profilering genom marknads- och kundanalyser<br />\nResultat Finans kan, pa begaran av kunden, nyttja denna data i syfte att utfora marknads- och kundanalyser som utgor underlag for marknadsforing, metod- och affarsutveckling.</p>\n<p>Begransningar i Tjansten<br />\nResultat Finans forbehaller sig ratten att avgora vilka tjansteutbud som vid varje tidpunkt ingar i den registrerade Tjansten.<br />\nTillganglighet till Tjansten<br />\nResultat Finans kan inte garantera att Tjansten ar fri fran avbrott och forbehaller sig aven ratten att under kortare tid stanga Tjansten for service, underhall och uppgradering.</p>\n<p>Sakerhetslosningar<br />\nTillamplig sakerhetslosning for Tjansten kan variera fran tid till annan. Resultat Finans anvisar tillampliga sakerhetslosningar for kunden. Du ar skyldig att folja de sakerhetsforeskrifter som Resultat Finans vid var tid meddelar.<br />\nInformation och meddelanden<br />\nResultat Finans lamnar information och meddelanden enligt detta avtal till kunden skriftligen. Om ett meddelande avser nagot annat an uppsagning av avtal ska Resultat Finans aven ha mojlighet att lamna information och meddelanden enligt detta avtal genom att anvanda din registrerade e-post och mobiltelefonnummer. Om Resultat Finans skickar ett brev till kunden, och anvander den adress som kunden angivit eller pa annat satt ar kand for Resultat Finans, ska kunden anses ha tagit del av meddelandet senast pa femte dagen efter att brevet skickades. Om brevet sands som ett rekommenderat brev ska anses ha natt kunden senast pa sjunde dagen efter att brevet skickades.<br />\nKunden ska omedelbart underratta Resultat Finans om andring av personuppgifter, sasom namn, adress, telefonnummer, personnummer eller registrerad e-postadress eller annan andring av uppgifter som ar av betydelse for Resultat Finans avtalsrelation med kunden. Resultat Finans ska omedelbart meddelas om nagon som har ratt att foretrada kunden inte langre har sadan ratt. Vid andring av namn eller andra personuppgifter ska personbevis bifogas.</p>\n<p>Andring av villkor<br />\nResultat Finans ska pa det satt som anges i punkten Information och meddelanden meddela andringar i villkor och information. Resultat Finans har ratt att andra omfattning och innehall for Tjansten. Om andringen enligt Resultat Finans bedomning inte ar att betrakta som obetydlig ska kunden underrattas och om kunden inte godkanner andringen har kunden ratt att omedelbart och avgiftsfritt saga upp avtalet till att upphora den dag da andringen ska borja galla. Om uppsagning inte gors innan andringen har borjat galla anses kunden ha godkant andringen.<br />\nAndringar som ar till fordel for kunden kan genomforas omedelbart och utan att kunden informeras.<br />\nResultat Finans ratt att avbryta Tjansten<br />\nResultat Finans har ratt att avbryta tillhandahallandet av Tjansten, helt eller delvist:<br />\n1. for att underhalla och uppdatera Tjansten,<br />\n2. om det enligt Resultat Finans uppfattning finns en pataglig risk for att Resultat Finans eller dess kunder kan lida skada om Tjansten tillhandahalls,<br />\n3. vid misstanke om obehorigt utnyttjande,<br />\n4. vid upprepade misslyckade forsok att initiera en tjanst i Tjansten, eller<br />\n5. om kunden vasentligen asidosatt avtalet eller andra instruktioner eller overenskommelser som galler for Tjansten.<br />\nFragor och klagomal<br />\nFragor och klagomal som avser de produkter eller tjanster som betalts genom Resultat Finans Betallosning, samt eventuella reklamationer, ska stallas till den part som formedlar desamma. Resultat Finans ansvarar enbart for de forfarande som star i direkt anknytning till de tjansteutbud som ar utgivna av Resultat Finans i enlighet med det aktuella tjansteutbudets villkor. Klagomal som enbart avser Tjansten ska utan drojsmal, men senast inom tre (3) manader, raknat fran den tidpunkt da den omstandighet som ett klagomal ror intraffade, stallas till Resultat Finans. Efter denna tidpunkt har inte kunden mojlighet att gora gallande klagomal avseende den specifika omstandigheten. I den man Resultat Finans behover utreda en fraga med anledning av vad kunden patalat ska kunden pa Resultat Finans begaran tillhandahalla sadana uppgifter som Resultat Finans rimligen kan behova for att genomfora nodvandig utredning.</p>\n<p>Begransning av ansvaret for Tjansten<br />\nResultat Finans ansvarar inte pa nagot satt for skador, kostnader eller olagenheter som uppkommer till foljd av omstandighet hanforlig till Tjansten. Resultat Finans ansvarar inte heller for skador, kostnader eller olagenhet som beror pa fel, storningar eller avbrott i din dator, din sakerhetslosning, eller kommunikationsforbindelse med Resultat Finans datorsystem och Tjansten, som forsvarar eller omojliggor atkomst till Tjansten. Vidare ansvarar Resultat Finans inte for skada som beror pa storningar eller avbrott i Resultat Finans datorsystem som omojliggor eller forsvarar atkomst av Tjansten.<br />\nResultat Finans ansvarar inte for skador, kostnader eller olagenheter som orsakats av att Resultat Finans avbrutit tillhandahallandet av Tjansten pa felaktiga grunder om Resultat Finans har haft anledning att anta att skaliga grunder for att avbryta Tjansten forelag da tillhandahallandet av Tjansten avbrots.<br />\nResultat Finans ansvarar vidare inte for om tillhandahallandet av Tjansten, inklusive sadan del som tillhandahalls av underleverantor, hindras, direkt eller indirekt, genom svenskt eller utlandskt lagbud, svenskt eller utlandsk myndighets atgard, krigshandelse, strejk, lockout eller annan liknande omstandighet, bojkott, blockad, tekniskt fel/avbrott/bristande tillgang till tele- eller IT-system eller skadad data i dessa system, brand, stromavbrott, skadegorelse (inklusive datavirus och datahacking) eller annan handelse som star utanfor Resultat Finans, och underleverantors, kontroll. Forbehallet i fraga om strejk, blockad, bojkott och lockout galler aven om Resultat Finans, eller underleverantor, sjalv vidtar eller ar foremal for sadan konfliktatgard.<br />\nResultat Finans ansvarar vidare inte for skador, kostnader eller olagenheter som uppkommit hos kunden i andra fall an de ovan angivna om Resultat Finans varit normalt aktsam.<br />\nResultat Finans ansvarar inte i nagot fall for indirekt skada om inte skadan orsakats av Resultat Finans grova vardsloshet.<br />\nFor Resultat Finans genomforande av betaltjanster inom EES-omradet i Euro, Svenska kronor eller i nagon annan av EES-landernas valutor ansvarar inte Resultat Finans i fall av osedvanliga eller oforutsagbara omstandigheter som Resultat Finans inte har nagot inflytande over och vars konsekvenser hade varit omojliga for Resultat Finans att avvarja trots alla anstrangningar. Ansvar for genomforande av betaltjanster enligt detta stycke intrader inte heller da Resultat Finans eller en av Resultat Finans anlitad part handlar i enlighet med svensk lag eller unionsratt.</p>\n<p>Tvistlosning och klagomal<br />\nSvensk ratt ska tillampas pa detta avtal och en tvist ska provas av svensk allman domstol. Resultat Finans har dock ratt att vacka talan mot kunden vid domstol i annat land om kunden har sin hemvist i det landet. Kunden kan, i syfte att finna losning pa en tvist utanfor domstol, kontakta Resultat Finans kundservice. Kunden har aven mojlighet att inge klagomal med begaran om rattelse via e-post till info@resultatfinans.se eller genom brev till Klagomalsansvarig, Resultat Finans, Box 1165, 251 11 Helsingborg.</p>\n"
    },
    "short_description": "Resultat Finans betallosning ar en enkel och smidig betallosning som med nagra fa knapptryck latt integreras i din e-handelsbutik.",
    "description": "<p>Resultat Finans betallosning ar en enkel och smidig betallosning som med nagra fa knapptryck latt integreras i din e-handelsbutik. Den mojliggor en snabb och trygg affar for kunden, och tillhandahaller fran 10,90:- SEK per kop fakturaservice till inkassohantering. Ingen finansieringskostnad. Du behaller 100% av det du saljer.<br />\nTillagget kraver att avtal traffas mellan anvandare och Resultat Finans.<br />\nFor att snabbt komma igang med din betallosning, vanligen ladda ner tillagget och kontakta Resultat Finans:<br />\nEpost: info@resultatfinans.se<br />\nTelefon: 042-300 97 85</p>\n<p>Gallande fran 2018.02.05<br />\nInformation om Resultat Finans<br />\nResultat Finans Aktiebolag, Org.nr. 556834-0284<br />\nBox 1165, 251 11 Helsingborg,<br />\nTfn vaxel: 042-300 97 85<br />\nHemsida: www.resultatfinans.se</p>\n<p>Styrelsen har sitt sate i Helsingborg, Skane lan.<br />\nResultat Finans har inkassotillstand utfardat av datainspektionen och ar registrerade hos Finansinspektionen (enligt SFS 1996:1006). Finansinspektionen, Box 7821, 103 97 STOCKHOLM.</p>\n<p>Allmant<br />\nDessa anvandarvillkor omfattar Resultat Finans betallosning (Tjansten) som tillhandahalls av Resultat Finans AB (Resultat Finans). Avtalsvillkoren gor sig gallande vid ditt (Kundens) nyttjande av Tjansten och vid Resultat Finans tillhandahallande av Tjansten.<br />\nOm anvandarvillkoren i detta avtal inte samtyckts till, kan inte Tjansten anvandas. Tjansten tillhandahalls i befintligt skick och sa som det ar tillgangligt. Resultat Finans begransningar i fraga om ansvar och tillganglighet framgar nedan.<br />\nFor dessa villkor och kommunikation med anledning harav ska svenska spraket tillampas. Resultat Finans rekommenderar kunden att gora en utskrift av dessa anvandarvillkor. Kunden har dock ratt att begara att villkoren och annan skriftlig information om Tjansten som har lamnats av Resultat Finans fore eller i samband med nyttjande av Tjansten skickas med post till din folkbokforingsadress. Bestallning av villkor och eventuell annan skriftlig information kan goras hos Resultat Finans.</p>\n<p>Definitioner<br />\nFoljande ord och begrepp ska i dessa anvandarvillkor anses ha den innebord som anges nedan.<br />\nBankdag: En dag nar medverkande banker eller annan betaltjanstleverantor har oppet for verksamhet i den utstrackning som kravs for genomforande av en betalningstransaktion.<br />\nBetalare: En fysisk eller juridisk person som antingen ar en kontoinnehavare och som godkanner en Betalningsorder fran ett konto, eller en fysisk eller juridisk person som lamnar en Betalningsorder.<br />\nKunden: Den fysiska eller juridiska person som ingar avtal om integration av Resultat Finans Betallosning.<br />\nResultat Finans Betallosning: En elektronisk tjanst som tillhandahalls av Resultat Finans och som syftar till att mojliggora fakturahantering, paminnelsehantering och inkasso vid distanskop av produkter och tjanster over Internet.<br />\nSlutanvandare: Den fysiska eller juridiska person som ar betalare av varor eller tjanster medierade genom Resultat Finans Betallosning.<br />\nTjansteutbud: Faktura- och paminnelsehantering, efterbevakning och inkasso.<br />\nTjansten: Den elektroniska tjansten Resultat Finans Betallosning.</p>\n<p>Beskrivning av Tjansten<br />\nMed tjansten menas i detta anvandaravtal en paketlosning genom vilken Kunden kan erbjuda slutanvandaren fakturahantering vid distanskop av tjanster och produkter over internet. Fakturahantering i denna mening innefattar, fransett fakturering, vidare bade paminnelsehantering, efterbevakning och inkasso till vilka slutanvandaren kan erbjudas avbetalningsplaner via e-post eller brev.</p>\n<p>Krav pa utrustning och programvara<br />\nFor att anvanda Tjansten kravs uppkoppling mot internet. natverk for datakommunikation, t ex Internet. For sadan uppkoppling kravs dator, smart telefon, lasplatta eller liknande teknisk utrustning och kommunikationsutrustning och programvara.</p>\n<p>Resultat Finans utvecklar kontinuerligt funktionaliteten i Tjansten varfor Resultat Finans rekommenderar kunden att anvanda operativsystem och webblasare som uppdateras och stods av tillverkarna.<br />\nDu ansvarar alltid sjalv for tillgang till den tekniska utrustning och programvara som kravs for att anvanda Tjansten samt eventuella kostnader for sadan utrustning. Du ska visa normal aktsamhet vid anvandning av Tjansten och dar sa ar mojligt anvanda antivirusprogram och brandvaggar.<br />\nAnvandning av Tjansten kan medfora att du belastas av trafikavgifter for datatrafik. Ansvaret for betalning av sadana avgifter aligger enbart kunden och regleras i ditt avtal med din leverantor av datatrafik. Resultat Finans ar inte ansvarig for betalning av trafikavgifter.</p>\n<p>Forutsattningar for att anvanda Tjansten<br />\nDu maste uppfylla de sarskilda krav som Resultat Finans anger vid bestallningstillfallet.<br />\nNar kunden lamnat samtycke for genomforandet av en bestallningsorder ska denna betraktas som godkand av kunden. Nar kunden lamnat samtycke for anvandande av Resultat Finans Betallosning, skall kontakt initieras med Resultat Finans i syfte att innan slutligt godkannande av integrationen sakerstalla kundens identitet och uppratthalla Resultat Finans skyldighet att ha god kunskap om kunden och kundens affarer. Om Resultat Finans inte kan sakerstalla kundens identitet, eller vidare bedomer att det foreligger befogad risk for bedrageri, ager Resultat Finans ratt att neka slutligt godkannande av bestallningsorder.<br />\nOm personuppgiftshantering<br />\nFor att mojliggora anvandning av Tjansten kommer Resultat Finans att be kunden att lamna sarskilda personuppgifter sasom namn, personnummer och organisationsnummer. Resultat Finans vidtar, i enlighet med deras policy, atgarder for att styrka riktigheten i de uppgifter som utlamnats innan avtal kan intradas for att bruka Tjansten. Informationen kommer att anvandas i syfte att administrera arendet i Tjansten. I samband med bestallning av tjansten kommer Resultat Finans att kreditprova kundens ansokan t.ex. genom kontroll av uppgifter om ekonomi, samt verifikation av andra givna uppgifter och bakgrundsinformation.<br />\nFor den slutanvandare som genom kundens plattform avser genomfora ett genom Resultat Finans Betallosning medierat distanskop, atar sig att vid varje tidpunkt forhalla sig till de villkor som gor sig gallande for att bruka Tjansten. For narvarande omfattar dessa villkor lagring av personuppgifter, mobiltelefonnummer, e-postadress samt information inhamtad genom tredje part med avseende pa dennes kreditvardighet.</p>\n<p>Du ska vid bestallningstillfallet uppge<br />\nOm kunden ansoker om Tjansten hos Resultat Finans kommer denne efterfragas att godkanna Resultat Finans villkor harfor. Med avseende pa kundens godkannande lamnas bl.a. samtycke till att Resultat Finans samlar in, behandlar, anvander och distribuerar kundens personuppgifter i syfte att behandla ansokan. Om samtycke ej lamnas kan Resultat Finans inte ta emot kundens ansokan. Samtycke omfattar alla personuppgifter kunden lamnar i ansokan, all ytterligare information som Resultat Finans forses av kunden med anledning av ansokan och all annan information som Resultat Finans inhamtar fran tredje part i syfte att behandla ansokan.<br />\nOm ansokan beviljas kommer Resultat Finans att hantera kundens personuppgifter i enlighet med vad som anges i villkoren for det specifika tjansteutbud som ar knutet till Tjansten.<br />\nResultat Finans, eller den Resultat Finans anlitar, kan komma att behandla personuppgifterna for att administrera Tjansten samt for hantering av eventuell kreditansokan. Kundens personuppgifter kan ocksa komma att lamnas ut till sadana tredje parter med vilka Resultat Finans samarbetar, exempelvis IT-leverantorer och externa bolag som kan vara involverade i Resultat Finans processer.<br />\nResultat Finans ansvarar for att de personuppgifter kunden delger Resultat Finans skyddas, och Resultat Finans vidtar lampliga tekniska och organisatoriska sakerhetsatgarder for att skydda kundens personuppgifter.<br />\nPersonuppgiftsansvarig for behandling av uppgifter ar Resultat Finans Aktiebolag med organisationsnummer 556834-0284. Om du har nagra fragor eller funderingar kring anvandandet av personuppgifter kan du kontakta Resultat Finans kundservice, se avtalets ingress &#8211; Information om Resultat Finans.<br />\nSlutanvandare kan nar som helst begara att egna personuppgifter korrigeras eller raderas. Det finns aven mojlighet att kostnadsfritt erhalla uppgift om vilka personuppgifter som Resultat Finans behandlar om kunden. Skriv till -Resultat Finans Aktiebolag, Box 1165 Sodra Strandgatan 15, 251 11, Helsingborg-.<br />\nSamtycke till marknadsforing samt profilering genom marknads- och kundanalyser<br />\nResultat Finans kan, pa begaran av kunden, nyttja denna data i syfte att utfora marknads- och kundanalyser som utgor underlag for marknadsforing, metod- och affarsutveckling.</p>\n<p>Begransningar i Tjansten<br />\nResultat Finans forbehaller sig ratten att avgora vilka tjansteutbud som vid varje tidpunkt ingar i den registrerade Tjansten.<br />\nTillganglighet till Tjansten<br />\nResultat Finans kan inte garantera att Tjansten ar fri fran avbrott och forbehaller sig aven ratten att under kortare tid stanga Tjansten for service, underhall och uppgradering.</p>\n<p>Sakerhetslosningar<br />\nTillamplig sakerhetslosning for Tjansten kan variera fran tid till annan. Resultat Finans anvisar tillampliga sakerhetslosningar for kunden. Du ar skyldig att folja de sakerhetsforeskrifter som Resultat Finans vid var tid meddelar.<br />\nInformation och meddelanden<br />\nResultat Finans lamnar information och meddelanden enligt detta avtal till kunden skriftligen. Om ett meddelande avser nagot annat an uppsagning av avtal ska Resultat Finans aven ha mojlighet att lamna information och meddelanden enligt detta avtal genom att anvanda din registrerade e-post och mobiltelefonnummer. Om Resultat Finans skickar ett brev till kunden, och anvander den adress som kunden angivit eller pa annat satt ar kand for Resultat Finans, ska kunden anses ha tagit del av meddelandet senast pa femte dagen efter att brevet skickades. Om brevet sands som ett rekommenderat brev ska anses ha natt kunden senast pa sjunde dagen efter att brevet skickades.<br />\nKunden ska omedelbart underratta Resultat Finans om andring av personuppgifter, sasom namn, adress, telefonnummer, personnummer eller registrerad e-postadress eller annan andring av uppgifter som ar av betydelse for Resultat Finans avtalsrelation med kunden. Resultat Finans ska omedelbart meddelas om nagon som har ratt att foretrada kunden inte langre har sadan ratt. Vid andring av namn eller andra personuppgifter ska personbevis bifogas.</p>\n<p>Andring av villkor<br />\nResultat Finans ska pa det satt som anges i punkten Information och meddelanden meddela andringar i villkor och information. Resultat Finans har ratt att andra omfattning och innehall for Tjansten. Om andringen enligt Resultat Finans bedomning inte ar att betrakta som obetydlig ska kunden underrattas och om kunden inte godkanner andringen har kunden ratt att omedelbart och avgiftsfritt saga upp avtalet till att upphora den dag da andringen ska borja galla. Om uppsagning inte gors innan andringen har borjat galla anses kunden ha godkant andringen.<br />\nAndringar som ar till fordel for kunden kan genomforas omedelbart och utan att kunden informeras.<br />\nResultat Finans ratt att avbryta Tjansten<br />\nResultat Finans har ratt att avbryta tillhandahallandet av Tjansten, helt eller delvist:<br />\n1. for att underhalla och uppdatera Tjansten,<br />\n2. om det enligt Resultat Finans uppfattning finns en pataglig risk for att Resultat Finans eller dess kunder kan lida skada om Tjansten tillhandahalls,<br />\n3. vid misstanke om obehorigt utnyttjande,<br />\n4. vid upprepade misslyckade forsok att initiera en tjanst i Tjansten, eller<br />\n5. om kunden vasentligen asidosatt avtalet eller andra instruktioner eller overenskommelser som galler for Tjansten.<br />\nFragor och klagomal<br />\nFragor och klagomal som avser de produkter eller tjanster som betalts genom Resultat Finans Betallosning, samt eventuella reklamationer, ska stallas till den part som formedlar desamma. Resultat Finans ansvarar enbart for de forfarande som star i direkt anknytning till de tjansteutbud som ar utgivna av Resultat Finans i enlighet med det aktuella tjansteutbudets villkor. Klagomal som enbart avser Tjansten ska utan drojsmal, men senast inom tre (3) manader, raknat fran den tidpunkt da den omstandighet som ett klagomal ror intraffade, stallas till Resultat Finans. Efter denna tidpunkt har inte kunden mojlighet att gora gallande klagomal avseende den specifika omstandigheten. I den man Resultat Finans behover utreda en fraga med anledning av vad kunden patalat ska kunden pa Resultat Finans begaran tillhandahalla sadana uppgifter som Resultat Finans rimligen kan behova for att genomfora nodvandig utredning.</p>\n<p>Begransning av ansvaret for Tjansten<br />\nResultat Finans ansvarar inte pa nagot satt for skador, kostnader eller olagenheter som uppkommer till foljd av omstandighet hanforlig till Tjansten. Resultat Finans ansvarar inte heller for skador, kostnader eller olagenhet som beror pa fel, storningar eller avbrott i din dator, din sakerhetslosning, eller kommunikationsforbindelse med Resultat Finans datorsystem och Tjansten, som forsvarar eller omojliggor atkomst till Tjansten. Vidare ansvarar Resultat Finans inte for skada som beror pa storningar eller avbrott i Resultat Finans datorsystem som omojliggor eller forsvarar atkomst av Tjansten.<br />\nResultat Finans ansvarar inte for skador, kostnader eller olagenheter som orsakats av att Resultat Finans avbrutit tillhandahallandet av Tjansten pa felaktiga grunder om Resultat Finans har haft anledning att anta att skaliga grunder for att avbryta Tjansten forelag da tillhandahallandet av Tjansten avbrots.<br />\nResultat Finans ansvarar vidare inte for om tillhandahallandet av Tjansten, inklusive sadan del som tillhandahalls av underleverantor, hindras, direkt eller indirekt, genom svenskt eller utlandskt lagbud, svenskt eller utlandsk myndighets atgard, krigshandelse, strejk, lockout eller annan liknande omstandighet, bojkott, blockad, tekniskt fel/avbrott/bristande tillgang till tele- eller IT-system eller skadad data i dessa system, brand, stromavbrott, skadegorelse (inklusive datavirus och datahacking) eller annan handelse som star utanfor Resultat Finans, och underleverantors, kontroll. Forbehallet i fraga om strejk, blockad, bojkott och lockout galler aven om Resultat Finans, eller underleverantor, sjalv vidtar eller ar foremal for sadan konfliktatgard.<br />\nResultat Finans ansvarar vidare inte for skador, kostnader eller olagenheter som uppkommit hos kunden i andra fall an de ovan angivna om Resultat Finans varit normalt aktsam.<br />\nResultat Finans ansvarar inte i nagot fall for indirekt skada om inte skadan orsakats av Resultat Finans grova vardsloshet.<br />\nFor Resultat Finans genomforande av betaltjanster inom EES-omradet i Euro, Svenska kronor eller i nagon annan av EES-landernas valutor ansvarar inte Resultat Finans i fall av osedvanliga eller oforutsagbara omstandigheter som Resultat Finans inte har nagot inflytande over och vars konsekvenser hade varit omojliga for Resultat Finans att avvarja trots alla anstrangningar. Ansvar for genomforande av betaltjanster enligt detta stycke intrader inte heller da Resultat Finans eller en av Resultat Finans anlitad part handlar i enlighet med svensk lag eller unionsratt.</p>\n<p>Tvistlosning och klagomal<br />\nSvensk ratt ska tillampas pa detta avtal och en tvist ska provas av svensk allman domstol. Resultat Finans har dock ratt att vacka talan mot kunden vid domstol i annat land om kunden har sin hemvist i det landet. Kunden kan, i syfte att finna losning pa en tvist utanfor domstol, kontakta Resultat Finans kundservice. Kunden har aven mojlighet att inge klagomal med begaran om rattelse via e-post till info@resultatfinans.se eller genom brev till Klagomalsansvarig, Resultat Finans, Box 1165, 251 11 Helsingborg.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/resultat-finans-betallosning.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": [],
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/resultat-finans-betallosning.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}