{
    "name": "Rexpansive Builder",
    "slug": "rexpansive-page-builder",
    "version": "2.2.0",
    "author": "<a href=\"https://www.neweb.info/\">NEWEB - Digital Agency</a>",
    "author_profile": "https://profiles.wordpress.org/neweb_agency/",
    "contributors": {
        "neweb_agency": {
            "profile": "https://profiles.wordpress.org/neweb_agency/",
            "avatar": "https://secure.gravatar.com/avatar/7562387b8d02a79f7f7b0424ff9b048d?s=96&d=monsterid&r=g",
            "display_name": "neweb_agency"
        }
    },
    "requires": "4.2",
    "tested": "6.3.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 3,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 3,
    "support_url": "https://wordpress.org/support/plugin/rexpansive-page-builder/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 10,
    "downloaded": 3160,
    "last_updated": "2023-09-11 11:03:00",
    "added": "2017-06-16",
    "homepage": "https://www.neweb.info/store/plugin/rexpansive-page-builder/",
    "sections": {
        "description": "<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/xlrW_cETz0o?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>REXPANSIVE &#8211; The Page Builder with the maximum fluidity.</h3>\n<p>Thanks to the evolved smoothness you can move and resize on the fly blocks with photos, texts, videos and much more, on an advanced matrix. The system will also help you to correct alignments and placements, guaranteeing a balance between creativity and design, avoiding annoying attempts to make adjustments.</p>\n<h3>Real-time update directly on the public part, allowing you to save time.</h3>\n<p>We know that it is frustrating to move from the reserved to the public part in order to understand the effective changes. Now you will see them immediately, with numerous features at your fingertips.</p>\n<h3>Add or change your models  &amp; Buttons.</h3>\n<p>You can choose your models, update them, create them, delete them and even synchronise them!</p>\n<h3>Synchronise your sections or make them independent.</h3>\n<p>You can finally decide to make a synchronised section on all the other pages, or you can decide to insert it and make it independent.</p>\n<h3>An advanced responsive.</h3>\n<p>In this way, each device will have photos, videos, texts and the layout it deserves.<br />\nOn certain devices, such as the mobile phone, photos or layouts, they have much more impact if set vertically rather than in landscape mode, definitely making them better suited to the desktop.</p>\n<h3>Changing the text will be child’s play!</h3>\n<p>You can edit and draft your text, apply a colour, set the type of font, align it, modify the html, insert images and much more!</p>\n<h3>Flexible or ordered, layouts made just for you.</h3>\n<p>The idea is to allow two modes of display, ordered or flexible: you can create an ordered display grid, known as “grid”, in which it is the system itself that keeps the elements organized and aligned, or a flexible display, known as “masonry”, with which your photos will maintain their original proportions, so they will always be totally accurate in every respect and Rexpansive will manage the rest.</p>\n<h3>Feel free  to change thanks to cancellation.</h3>\n<p>Thanks to the “Cancel” function you can decide to change your current version, returning to the previous changes and viewing the changes in real time.</p>\n<h3>Upload your SVG icons and modify them to your liking.</h3>\n<p>Once you have uploaded your icons in SVG format, you can decide whether to resize and colour them with thousands of colours. That way, there will be no limit to your creativity.</p>\n<h3>Rexslider. The quick &amp; easy slider!</h3>\n<p>You can create your sliders quickly by inserting them directly into the blocks. You can benefit from the use of the Rexpansive Builder expansion to customise the size swiftly and rapidly !o)</p>\n<h3>Collapse! One over the other, in a click!</h3>\n<p>You can decide to “collapse” all your content, such as photos, texts, videos and much more, with a simple click, placing them one after the other thanks to the “collapse! function.</p>\n<h3>Instant. Create faster than the speed of light.</h3>\n<p>We have eliminated a significant number of tools; everything is now lighter, and performance is better thanks to expansion. You can now create and view the result in an instant.</p>\n<h3>Compatible with any theme.</h3>\n<p>Rexpansive Builder is designed on a massive scale in order to be compatible with your theme. Furthermore, the system is compatible with the most recent browsers and also with older ones, so that you can feel comfortable even on the public side. Obviously, the Rexpansive Builder plugin works perfectly with all themes when a third-party Page Builder is not active.</p>\n<h3>More control. More freedom.</h3>\n<p>You will be able to customize the CSS of every single page. In this way, customisation will be unlimited and will guarantee that you can always do whatever you want.</p>\n<h3>Clean interface. The functions will appear only when needed, to offer you a truly relaxing experience.</h3>\n<p>Our dedication to design has allowed us to create a simple and functional user experience. In fact, the interface will prove to be clean right from the start. In this way, when you modify an element, the functions will appear near to you, optimising the closeness between elements and functions, making it extraordinary and pleasant to update your content.</p>\n<h3>So many features. So many possibilities.</h3>\n<h3>Responsive</h3>\n<p>Rest assured that every pixel will be responsive!</p>\n<h3>Compatible</h3>\n<p>Compatible with IE9, IE10, IE11, Firefox, Safari, Opera, Chrome.</p>\n<h3>Fast</h3>\n<p>We worked hard to create a fast and fluid page builder like never before.</p>\n<h3>Tips</h3>\n<p>Send us your suggestions or report corrections through the support function.</p>\n<h3>Powerful panel</h3>\n<p>Modify the look and style of your website, thanks to a wide range of options.</p>\n<h3>Unlimited Colours</h3>\n<p>Unlimited colours available for the texts and boxes on your page.</p>\n<h3>WPML support</h3>\n<p>Full integration with the WPML plugin allows you to make use of its various functions.</p>\n<h3>Free updates</h3>\n<p>We believe that showing you our improvements is a gift you truly deserve.</p>\n<h3>Grid&amp;Masonry</h3>\n<p>Flexible or ordered, each section can be set up as desired.</p>\n<h3>Ordered</h3>\n<p>Everything in its place! Organize photos, videos, entire sections.</p>\n<h3>Clone</h3>\n<p>Increase productivity. Copy photos, texts, videos, sections of any size.</p>\n<h3>Space</h3>\n<p>Distribute your content any way you want it. Your creativity will have no limits.</p>\n<h3>One page</h3>\n<p>No loading! Create sections within the page and link them whichever way you wish.</p>\n<h3>WooCommerce</h3>\n<p>Compatible with WooCommerce – you can create more layouts, allowing you to sell more.</p>\n<h3>Build</h3>\n<p>Customise the width and height of each module on any page. It’s simple and intuitive!</p>\n<h3>SEO-friendly</h3>\n<p>Rexpansive uses the best methods to optimize the code and improve SEO.</p>\n<h3>Video</h3>\n<p>Upload videos (Vimeo, YouTube to Mp4), expand and move them. Enjoy the show.</p>\n<h3>Overlay</h3>\n<p>Titles and texts on the images will finally be more visible and vivid.</p>\n<h3>Image Options</h3>\n<p>Stunning commands for photos with PhotoSwipe: galleries, fullscreen, zoom and sharing.</p>\n<h3>User friendly</h3>\n<p>You’ll see how easy it is right away, thanks to the intuitive design created for all.</p>\n<h3>Alignments</h3>\n<p>Texts and photos in their own place: you can put everything wherever you want it.</p>\n<h3>Live Editor</h3>\n<p>The page builder will allow you to edit directly on the public part.</p>\n<h3>Links</h3>\n<p>Each block can be linked to everything, so you can decide what to link.</p>\n<h3>Custom Code</h3>\n<p>For the more experienced among us: you can insert CSS anywhere.</p>\n<h3>Bug Submission and Forum Support</h3>\n<p><a href=\"https://neweb.freshdesk.com/support/tickets/new\" rel=\"nofollow ugc\">https://neweb.freshdesk.com/support/tickets/new</a></p>\n",
        "installation": "<ol>\n<li>Upload <code>rexpansive-builder</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n<h4>Website</h4>\n<p><a href=\"https://www.neweb.info/\" rel=\"nofollow ugc\">https://www.neweb.info/</a></p>\n",
        "changelog": "<h4>2.2.0 &#8211; September 11, 2023</h4>\n<ul>\n<li>Updated: Tested up to WordPress 6.3</li>\n<li>Updated: Sass version</li>\n<li>Updated: Deprecate MediumEditor and use CKEditor5</li>\n<li>Updated: Remove default margin on paragraph inside a RexSlider</li>\n<li>Updated: Style success and error response area for CF7 forms</li>\n<li>Added: Allow display blocks in a masonry way inside a fixed section, removing empty spaces</li>\n<li>Added: Classes to set full image background on block positioning</li>\n<li>Fixed: Avoid load useless content on pages withoud builder active</li>\n<li>Fixed: Correct section height calculation after a CF7 form submission</li>\n<li>Fixed: Block only image class</li>\n</ul>\n<h4>2.1.1 &#8211; January 18, 2023</h4>\n<ul>\n<li>Updated: Update license version to GNU GPLv3</li>\n<li>Updated: Setting min-height instead of height for sections</li>\n<li>Fixed: Some problem of update when changing section boxed dimension</li>\n<li>Fixed: Navigator label default position error</li>\n<li>Fixed: No-flow blocks behaviour after change layout</li>\n</ul>\n<h4>2.1.0 &#8211; November 7, 2022</h4>\n<ul>\n<li>Updated: Tested up to WordPress 6.1</li>\n<li>Added: Classes to allow overflow on blocks and sections</li>\n<li>Added: RexIndicator shortcode, for placing indicator lines inside blocks</li>\n<li>Added: RexMarker shortcode for placing tooltips on blocks, setting their coordinates</li>\n<li>Fixed: Inline Image with photoswipe zoom</li>\n<li>Fixed: Launch blocks and sections animation after their possible images are fully loaded</li>\n</ul>\n<h4>2.0.14 &#8211; June 10, 2022</h4>\n<ul>\n<li>Updated: Tested up to WordPress 6.0</li>\n<li>Added: Allow closing popup page pressing esc key or clicking outside popup</li>\n<li>Added: Allow to customize rexslider render function</li>\n<li>Added: Add feature to set vertical nav position</li>\n<li>Added: Allow to having a block that opens a popup video</li>\n<li>Added: Allow to having a block that opens a popup page</li>\n<li>Added: Add block class to customize the link target behavior</li>\n<li>Fixed: Sometimes a row stays or become locked (black background) even if user do not want to drag blocks between rows</li>\n<li>Fixed: Import of a new cf7 form cause some problems</li>\n<li>Fixed: Popup video with a Vimeo link</li>\n<li>Fixed: PHP Warning</li>\n</ul>\n<h4>2.0.13 &#8211; April 5, 2022</h4>\n<ul>\n<li>Updated: Tested up to WordPress 5.9.2</li>\n<li>Added: Allow use of numeric keypad to set measures, like padding or margin</li>\n<li>Fixed: Animation not triggered on blocks positioned attached to top of the page</li>\n<li>Fixed: Avoid noscript elements to prevent formatting problems</li>\n<li>Fixed: Prevent double click on blocks with slider</li>\n<li>Fixed: Tools buttons sizes</li>\n</ul>\n<h4>2.0.12 &#8211; August 26, 2021</h4>\n<ul>\n<li>Added: Minimun height to sections with one element when dragging the element around</li>\n<li>Fixed: Compatibility with PHP 8.0.0 which interruped saving process</li>\n<li>Fixed: Import of CF7 form models</li>\n</ul>\n<h4>2.0.11 &#8211; July 21, 2021</h4>\n<ul>\n<li>Updated: Tested up to WordPress 5.8</li>\n</ul>\n<h4>2.0.10 &#8211; May 28, 2021</h4>\n<ul>\n<li>Added: HTML editor button on block, without the need to select text</li>\n<li>Added: When user change section order on default (desktop), he can decide to automatically synchronize the sorting on the other saved layouts</li>\n<li>Updated: Hide empty sections on frontend</li>\n<li>Fixed: Retrieving update information</li>\n<li>Fixed: PHP warnings when plugin fails to load updates information</li>\n<li>Fixed: Bug on ordering new sections</li>\n</ul>\n<h4>2.0.9 &#8211; November 5, 2020</h4>\n<ul>\n<li>Added: When editing a text block, now the block keeps the red outline</li>\n<li>Added: Popup video with YouTube, Vimeo or mp4</li>\n<li>Added: Popup video feature on RexButtons</li>\n<li>Updated: Now section modal width setting have a minimum width</li>\n<li>Updated: Highly improved drag &amp; drop of RexButtons, RexModels &amp; RexWpcf7</li>\n<li>Updated: When importing a RexButton, the cursor moves to the first paragraph after it (if there is no one, it&#8217;s created)</li>\n<li>Fixed: When pasting text from Word the resultant HTML was not cleaned from Word formatting</li>\n<li>Fixed: Text editor loses focus when pasting text</li>\n<li>Fixed: When importing RexButtons / RexWpcf7 forms, it was not possible to remove the focus with the ESC button or clicking out</li>\n<li>Fixed: When importing a RexButton on an already existent block, the block was not completely focused</li>\n<li>Fixed: Section background color undo not working</li>\n<li>Fixed: Resetting of the layout when a user changes layout without saving did not reset everything</li>\n</ul>\n<h4>2.0.8 &#8211; September 4, 2020</h4>\n<ul>\n<li>Added: Class to remove a block from a grid flow on public side</li>\n<li>Added: RexSlider prev/next icon customizable with hook</li>\n<li>Updated: Natural fit image position default is now left-top</li>\n<li>Fixed: Overlay and background colors&#8217; toolboxes showing over blocks even if they weren&#8217;t set</li>\n<li>Fixed: When cloning a block with a mp4 video, the cloned block did not display the video (a refresh was needed)</li>\n<li>Fixed: Block size indicator displaying wrong size when resetting the block settings</li>\n<li>Fixed: Section&#8217;s toolboxes going below other sections in certain situations</li>\n<li>Fixed: Different behaviour of block videos when adding them compared to when the page loads</li>\n<li>Fixed: RexSlider natural blurred images with text displaying badly</li>\n<li>Fixed: RexSlider videos not working correctly on backend side</li>\n<li>Fixed: When hitting DEL in a text block before a RexButton, the RexButton loses its settings</li>\n<li>Fixed: Height of a block increasing when editing its internal lateral paddings</li>\n<li>Fixed: Slider/youtube video with text: the text was invisible</li>\n</ul>\n<h4>2.0.7 &#8211; August 19, 2020</h4>\n<ul>\n<li>Added: Class to deactivate default animation on blocks (.deactivate-rexpansive-animation)</li>\n<li>Added: Class to make a natural image fit all the space possible in the block (.fit-natural-bg-image)</li>\n<li>Updated: Made several improvements to RexAccordions</li>\n<li>Fixed: Sticky Section animation</li>\n</ul>\n<h4>2.0.6 – June 23, 2020</h4>\n<ul>\n<li>Update: Prevent the possibility to set Full Height on Masonry rows</li>\n<li>Update: When replacing an image the block maintain its dimensions</li>\n<li>Update: Videos on blocks and rows fits the entire element</li>\n<li>Update: Confirm/Reset buttons on color pickers</li>\n<li>Update: Reset on row resets all the blocks properties and dimensions with the &#8220;Desktop&#8221; default</li>\n<li>Update: Reset on block reset the block properties and dimensions with the &#8220;Desktop&#8221; default</li>\n<li>Update: On new RexSlider removed blur option by default</li>\n<li>Fixed: Handling correctly the remove of images or videos from blocks on layouts different from &#8220;Destkop&#8221;</li>\n<li>Fixed: Generation of pages saved with old builder (versions prior to 2.0)</li>\n<li>Fixed: On builder, RexButton with page anchor scrolls down when clicked</li>\n<li>Fixed: Editor HTML not closing when click &#8220;Save&#8221;</li>\n<li>Fixed: Removed outline from inputs when focused on CF7 forms</li>\n<li>Fixed: Synchrony changes of CF7 forms</li>\n<li>Fixed: When editing RexButton the &#8220;Save Page&#8221; button now becomes grey</li>\n<li>Fixed: On small blocks there was not possibile to use all the settings buttons</li>\n<li>Fixed: Correctly add a min height on empty rows</li>\n</ul>\n<h4>2.0.5 – May 29, 2020</h4>\n<ul>\n<li>Added: Confirm/Reset buttons to confirm or reset changes made inside a modal or with a color picker</li>\n<li>Added: Row label, to customize the navigator labels</li>\n<li>Added: Reset button on rows and blocks to reset their properties with the &#8220;Desktop&#8221; default</li>\n<li>Added: CF7 forms on lateral panel. Now it&#8217;s possible to customize CF7 forms directly from the builder. Old forms will not be affected</li>\n<li>Updated: On image size change, if user set natural, the block auto resizes to fit image</li>\n<li>Updated: Block dimensions indicator is now at bottom left of the block</li>\n<li>Updated: When dragging a RexButton the lateral menu disappears / appears acording to the mouse position</li>\n<li>Updated: When dragging a RexButton the placeholder is more visible</li>\n<li>Updated: Photoswipe on a RexSlider opens only the images in the slider</li>\n<li>Updated: Change a row or a block property on layouts different from default, saves only that property, leaving the other properties synchronized with the &#8220;Desktop&#8221; default ones</li>\n<li>Fixed: On a copied row, text editor doesn&#8217;t work</li>\n<li>Fixed: On an imported template, at the first moment the tools are not correctly visible</li>\n<li>Fixed: On an import template, text editor doesn&#8217;t work</li>\n<li>Fixed: When deleting a RexButton from the list, separates the ones accross the pages</li>\n<li>Fixed: Images url on installed contents</li>\n</ul>\n<h4>2.0.4 – April 29, 2020</h4>\n<ul>\n<li>Added: Lazy load content by default on every page</li>\n<li>Updated: Improved performances on frontend</li>\n<li>Updated: Navigator style</li>\n<li>Fixed: Block heights calculation</li>\n<li>Fixed: When a lot of text was copied within a block, the top bar disappeared</li>\n<li>Fixed: Builder tools style problems with TwentyTwenty Theme</li>\n<li>Fixed: Zoom all images and RexSlider</li>\n</ul>\n<h4>2.0.3 – February 13, 2020</h4>\n<ul>\n<li>Added: Fast Load (loads images and videos on page scroll)</li>\n<li>Added: Custom class for the RexButton</li>\n<li>Added: Inline icon option</li>\n<li>Updated: Mp4 videos are not cut</li>\n<li>Fixed: Block heights on other layouts than default</li>\n<li>Fixed: Pasting text inside other text</li>\n<li>Fixed: Page cloning with a RexSlider</li>\n<li>Fixed: Row cloning with a RexButton</li>\n<li>Fixed: Image size for section background</li>\n<li>Fixed: Delete of a copied row with a video block</li>\n<li>Fixed: Block with link and photoswipe</li>\n<li>Fixed: Block with RexSlider height</li>\n</ul>\n<h4>2.0.2 &#8211; November 15, 2019</h4>\n<ul>\n<li>Added: Hold grid button (prevents collapse on mobile)</li>\n<li>Updated: Background image on block with text remains full when added</li>\n<li>Fixed: Mp4 video size</li>\n<li>Fixed: YouTube video position</li>\n</ul>\n<h4>2.0.1 &#8211; October 28, 2019</h4>\n<ul>\n<li>Added: Replace an inserted icon</li>\n<li>Fixed: Install default contents (models, buttons, icons)</li>\n<li>Fixed: Block heights calculation</li>\n<li>Fixed: Draft editing</li>\n<li>Fixed: WPML compatibility</li>\n<li>Fixed: Yoast meta description</li>\n<li>Fixed: Overlay on slider blocks</li>\n<li>Fixed: Video inside slider on iOS</li>\n<li>Fixed: Inline YouTube video</li>\n</ul>\n<h4>2.0.0 &#8211; August 23, 2019</h4>\n<ul>\n<li>Updated: LIVE Page Builder available!!</li>\n</ul>\n<h4>1.0.10 &#8211; June 29, 2017</h4>\n<ul>\n<li>Added: Draggable windows on Rexpansive Builder</li>\n<li>Fixed: TextFill</li>\n<li>Fixed: Chrome problem with the builder</li>\n</ul>\n<h4>1.0.9 – March 18, 2017</h4>\n<ul>\n<li>Fixed: Update notification bug</li>\n</ul>\n<h4>1.0.8 – February 27, 2017</h4>\n<ul>\n<li>Fixed: Calculation of blocks height on grid</li>\n</ul>\n<h4>1.0.7 – February 24, 2017</h4>\n<ul>\n<li>Fixed: General grid updates and fixes</li>\n<li>Fixed: TextFill</li>\n<li>Fixed: Content alignment tool</li>\n<li>Fixed: Improved scroll animation</li>\n</ul>\n<h4>1.0.6 – January 17, 2017</h4>\n<ul>\n<li>Added: Now you can see the dimensions of the blocks in the backend area</li>\n<li>Updated: Now when you change the behaviour of the row between masonry and grid, the type of the images remains the original</li>\n</ul>\n<h4>1.0.5 – July 20, 2016</h4>\n<ul>\n<li>Updated: Default unit measure of the block internal padding; now it’s in pixels</li>\n<li>Fixed: When you insert an image you can choose correctly its size, using the Media Upload panel</li>\n</ul>\n<h4>1.0.4 – May 10, 2016</h4>\n<ul>\n<li>Added: Possibility to modify text on a block after the insertion</li>\n<li>Fixed: Further fixes on TextResize</li>\n<li>Fixed: Plugin activation when the premium version is active</li>\n</ul>\n<h4>1.0.3 &#8211; May 3, 2016</h4>\n<ul>\n<li>Added: Smooth scroll on internal links</li>\n<li>Fixed: TextFill</li>\n<li>Fixed: TextResize</li>\n</ul>\n<h4>1.0.2 &#8211; April 18, 2016</h4>\n<ul>\n<li>Fixed: Tooltip problem on the page builder</li>\n</ul>\n<h4>1.0.1 &#8211; March 22, 2016</h4>\n<ul>\n<li>Fixed: TexFill</li>\n</ul>\n<h4>1.0.0 &#8211; February 23, 2016</h4>\n<ul>\n<li>Rexpansive Builder Test</li>\n</ul>\n"
    },
    "short_description": "The new and awesome plugin to build a page in 1 minute! Expand your mind!",
    "description": "<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/xlrW_cETz0o?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>REXPANSIVE &#8211; The Page Builder with the maximum fluidity.</h3>\n<p>Thanks to the evolved smoothness you can move and resize on the fly blocks with photos, texts, videos and much more, on an advanced matrix. The system will also help you to correct alignments and placements, guaranteeing a balance between creativity and design, avoiding annoying attempts to make adjustments.</p>\n<h3>Real-time update directly on the public part, allowing you to save time.</h3>\n<p>We know that it is frustrating to move from the reserved to the public part in order to understand the effective changes. Now you will see them immediately, with numerous features at your fingertips.</p>\n<h3>Add or change your models  &amp; Buttons.</h3>\n<p>You can choose your models, update them, create them, delete them and even synchronise them!</p>\n<h3>Synchronise your sections or make them independent.</h3>\n<p>You can finally decide to make a synchronised section on all the other pages, or you can decide to insert it and make it independent.</p>\n<h3>An advanced responsive.</h3>\n<p>In this way, each device will have photos, videos, texts and the layout it deserves.<br />\nOn certain devices, such as the mobile phone, photos or layouts, they have much more impact if set vertically rather than in landscape mode, definitely making them better suited to the desktop.</p>\n<h3>Changing the text will be child’s play!</h3>\n<p>You can edit and draft your text, apply a colour, set the type of font, align it, modify the html, insert images and much more!</p>\n<h3>Flexible or ordered, layouts made just for you.</h3>\n<p>The idea is to allow two modes of display, ordered or flexible: you can create an ordered display grid, known as “grid”, in which it is the system itself that keeps the elements organized and aligned, or a flexible display, known as “masonry”, with which your photos will maintain their original proportions, so they will always be totally accurate in every respect and Rexpansive will manage the rest.</p>\n<h3>Feel free  to change thanks to cancellation.</h3>\n<p>Thanks to the “Cancel” function you can decide to change your current version, returning to the previous changes and viewing the changes in real time.</p>\n<h3>Upload your SVG icons and modify them to your liking.</h3>\n<p>Once you have uploaded your icons in SVG format, you can decide whether to resize and colour them with thousands of colours. That way, there will be no limit to your creativity.</p>\n<h3>Rexslider. The quick &amp; easy slider!</h3>\n<p>You can create your sliders quickly by inserting them directly into the blocks. You can benefit from the use of the Rexpansive Builder expansion to customise the size swiftly and rapidly !o)</p>\n<h3>Collapse! One over the other, in a click!</h3>\n<p>You can decide to “collapse” all your content, such as photos, texts, videos and much more, with a simple click, placing them one after the other thanks to the “collapse! function.</p>\n<h3>Instant. Create faster than the speed of light.</h3>\n<p>We have eliminated a significant number of tools; everything is now lighter, and performance is better thanks to expansion. You can now create and view the result in an instant.</p>\n<h3>Compatible with any theme.</h3>\n<p>Rexpansive Builder is designed on a massive scale in order to be compatible with your theme. Furthermore, the system is compatible with the most recent browsers and also with older ones, so that you can feel comfortable even on the public side. Obviously, the Rexpansive Builder plugin works perfectly with all themes when a third-party Page Builder is not active.</p>\n<h3>More control. More freedom.</h3>\n<p>You will be able to customize the CSS of every single page. In this way, customisation will be unlimited and will guarantee that you can always do whatever you want.</p>\n<h3>Clean interface. The functions will appear only when needed, to offer you a truly relaxing experience.</h3>\n<p>Our dedication to design has allowed us to create a simple and functional user experience. In fact, the interface will prove to be clean right from the start. In this way, when you modify an element, the functions will appear near to you, optimising the closeness between elements and functions, making it extraordinary and pleasant to update your content.</p>\n<h3>So many features. So many possibilities.</h3>\n<h3>Responsive</h3>\n<p>Rest assured that every pixel will be responsive!</p>\n<h3>Compatible</h3>\n<p>Compatible with IE9, IE10, IE11, Firefox, Safari, Opera, Chrome.</p>\n<h3>Fast</h3>\n<p>We worked hard to create a fast and fluid page builder like never before.</p>\n<h3>Tips</h3>\n<p>Send us your suggestions or report corrections through the support function.</p>\n<h3>Powerful panel</h3>\n<p>Modify the look and style of your website, thanks to a wide range of options.</p>\n<h3>Unlimited Colours</h3>\n<p>Unlimited colours available for the texts and boxes on your page.</p>\n<h3>WPML support</h3>\n<p>Full integration with the WPML plugin allows you to make use of its various functions.</p>\n<h3>Free updates</h3>\n<p>We believe that showing you our improvements is a gift you truly deserve.</p>\n<h3>Grid&amp;Masonry</h3>\n<p>Flexible or ordered, each section can be set up as desired.</p>\n<h3>Ordered</h3>\n<p>Everything in its place! Organize photos, videos, entire sections.</p>\n<h3>Clone</h3>\n<p>Increase productivity. Copy photos, texts, videos, sections of any size.</p>\n<h3>Space</h3>\n<p>Distribute your content any way you want it. Your creativity will have no limits.</p>\n<h3>One page</h3>\n<p>No loading! Create sections within the page and link them whichever way you wish.</p>\n<h3>WooCommerce</h3>\n<p>Compatible with WooCommerce – you can create more layouts, allowing you to sell more.</p>\n<h3>Build</h3>\n<p>Customise the width and height of each module on any page. It’s simple and intuitive!</p>\n<h3>SEO-friendly</h3>\n<p>Rexpansive uses the best methods to optimize the code and improve SEO.</p>\n<h3>Video</h3>\n<p>Upload videos (Vimeo, YouTube to Mp4), expand and move them. Enjoy the show.</p>\n<h3>Overlay</h3>\n<p>Titles and texts on the images will finally be more visible and vivid.</p>\n<h3>Image Options</h3>\n<p>Stunning commands for photos with PhotoSwipe: galleries, fullscreen, zoom and sharing.</p>\n<h3>User friendly</h3>\n<p>You’ll see how easy it is right away, thanks to the intuitive design created for all.</p>\n<h3>Alignments</h3>\n<p>Texts and photos in their own place: you can put everything wherever you want it.</p>\n<h3>Live Editor</h3>\n<p>The page builder will allow you to edit directly on the public part.</p>\n<h3>Links</h3>\n<p>Each block can be linked to everything, so you can decide what to link.</p>\n<h3>Custom Code</h3>\n<p>For the more experienced among us: you can insert CSS anywhere.</p>\n<h3>Bug Submission and Forum Support</h3>\n<p><a href=\"https://neweb.freshdesk.com/support/tickets/new\" rel=\"nofollow ugc\">https://neweb.freshdesk.com/support/tickets/new</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.2.0.zip",
    "upgrade_notice": {
        "": "<ul>\n<li>None</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/rexpansive-page-builder/assets/screenshot-1.jpg?rev=2145388",
            "caption": "Photos &amp; Texts"
        },
        {
            "src": "https://ps.w.org/rexpansive-page-builder/assets/screenshot-2.jpg?rev=2145388",
            "caption": "Models"
        },
        {
            "src": "https://ps.w.org/rexpansive-page-builder/assets/screenshot-3.jpg?rev=2145388",
            "caption": "Synchronize models"
        },
        {
            "src": "https://ps.w.org/rexpansive-page-builder/assets/screenshot-4.jpg?rev=2145388",
            "caption": "Advanced responsive"
        },
        {
            "src": "https://ps.w.org/rexpansive-page-builder/assets/screenshot-5.jpg?rev=2145388",
            "caption": "Inline text edit"
        },
        {
            "src": "https://ps.w.org/rexpansive-page-builder/assets/screenshot-6.jpg?rev=2145388",
            "caption": "Undo/Redo &amp; Custom Icons"
        },
        {
            "src": "https://ps.w.org/rexpansive-page-builder/assets/screenshot-7.jpg?rev=2145388",
            "caption": "Rexslider &amp; Collapse"
        },
        {
            "src": "https://ps.w.org/rexpansive-page-builder/assets/screenshot-8.jpg?rev=2145388",
            "caption": "Fast"
        },
        {
            "src": "https://ps.w.org/rexpansive-page-builder/assets/screenshot-9.jpg?rev=2145388",
            "caption": "Compatible"
        },
        {
            "src": "https://ps.w.org/rexpansive-page-builder/assets/screenshot-10.jpg?rev=2145388",
            "caption": "Custom CSS"
        },
        {
            "src": "https://ps.w.org/rexpansive-page-builder/assets/screenshot-11.jpg?rev=2145388",
            "caption": "Clean interface"
        }
    ],
    "tags": {
        "builder": "builder",
        "composer": "composer",
        "content-builder": "content builder",
        "custom": "custom",
        "drag-and-drop": "drag-and-drop"
    },
    "stable_tag": "2.2.0",
    "versions": {
        "1.0.10": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.1.0.10.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.1.zip",
        "2.0.10": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.10.zip",
        "2.0.11": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.11.zip",
        "2.0.12": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.12.zip",
        "2.0.13": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.13.zip",
        "2.0.14": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.14.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.5.zip",
        "2.0.6": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.6.zip",
        "2.0.7": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.7.zip",
        "2.0.8": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.8.zip",
        "2.0.9": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.0.9.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.1.1.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.2.2.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/rexpansive-page-builder.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://www.neweb.info/",
    "banners": {
        "low": "https://ps.w.org/rexpansive-page-builder/assets/banner-772x250.jpg?rev=1679895",
        "high": "https://ps.w.org/rexpansive-page-builder/assets/banner-1544x500.jpg?rev=1679895"
    },
    "icons": {
        "1x": "https://ps.w.org/rexpansive-page-builder/assets/icon-128x128.jpg?rev=2145388",
        "2x": "https://ps.w.org/rexpansive-page-builder/assets/icon-256x256.jpg?rev=2145388"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}