{
    "name": "Rich Table of Contents",
    "slug": "rich-table-of-content",
    "version": "1.4.0",
    "author": "<a href=\"https://croover.co.jp/\">CROOVER.inc</a>",
    "author_profile": "https://profiles.wordpress.org/ryota0101/",
    "contributors": {
        "ryota0101": {
            "profile": "https://profiles.wordpress.org/ryota0101/",
            "avatar": "https://secure.gravatar.com/avatar/0d6d52a5122798e75ad9f11ebc02d78c?s=96&d=monsterid&r=g",
            "display_name": "Croover.inc"
        }
    },
    "requires": "5.3.2",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 82,
    "ratings": {
        "5": 11,
        "4": 3,
        "3": 0,
        "2": 0,
        "1": 3
    },
    "num_ratings": 17,
    "support_url": "https://wordpress.org/support/plugin/rich-table-of-content/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 20000,
    "downloaded": 318614,
    "last_updated": "2024-07-31 5:50am GMT",
    "added": "2020-02-25",
    "homepage": "https://croover.co.jp/rtoc",
    "sections": {
        "description": "<p>RTOC is a table of contents generation plugin from Japan that allows anyone to easily create a table of contents. Equipped with the functions of the conventional table of contents plugin, it is designed to thoroughly pursue design and ease of use.<br />\nIntroducing a real-time preview with an intuitive UI design allows you to create an ideal table of contents with a single button.It is definitely a plus factor for your blog or site.RTOC is easy to use, so please use it.</p>\n<h3>Install</h3>\n<p>【How to automatically install from the WordPress admin screen】<br />\n    ①Click &#8220;Plugins&#8221; <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> &#8220;Add New&#8221; from the WordPress administration screen.<br />\n    ②Type &#8220;Rich Table of Contents&#8221; in the new search box.<br />③Activate after installation\n</p>\n<p></p>\n<p>【How to install manually using FTP etc.】<br />\n①Download this plugin from WordPress.org（There is a button called &#8220;Download&#8221; on the right side of the plugin title on this page, so download from there）<br />②Unzip the zip file called &#8220;rich-table-of-content&#8221; and download it to the / wp-content / plugins / directory.<br />③Click the plugin from the WordPress administration screen and click Activate.</p>\n<h3>Basic settings</h3>\n<p>Configure the basic settings for the table of contents.</p>\n<ul>\n<li>Table of contents title: You can freely decide the title of the table of contents.</li>\n<li>Auto insert for the following content types: You can decide whether to show the table of contents on posts and pages.</li>\n<li>Heading to be displayed: Set which heading (h2, h3, h4) to display.</li>\n<li>Display conditions: Set the number of headings to display the table of contents.</li>\n<li>Font: Set font.</li>\n</ul>\n<h3>Design settings</h3>\n<p>You can freely set the table of contents design.</p>\n<ul>\n<li>Title display: Set whether the title position is left or center.</li>\n<li>H2 list design: Set the H2 list design.</li>\n<li>H3 list design: Set the H3 list design.</li>\n<li>Frame design: Sets the table of contents frame design.</li>\n<li>Animation: Set the animation when the table of contents is displayed。</li>\n<li>Smooth scroll   : Set whether to scroll to the headline when clicking (tapping) the table of contents.</li>\n</ul>\n<h3>Preset color settings</h3>\n<p>RTOC color preset added by default. Choose and set the preset that suits your site.</p>\n<h3>Color settings(For advanced users)</h3>\n<p>In addition to the preset colors, you can set your own colors. If you want to set your own color or modify the preset color partially, please change the color here.</p>\n<ul>\n<li>Title color: Set the title color.</li>\n<li>Text color: Set the text color.</li>\n<li>Back color: Set the back color.</li>\n<li>Border color: Set the border color.</li>\n<li>H2 list color: Set the H2 list color.</li>\n<li>H3 list color: Set the H3 list color.</li>\n<li>Back to table of contents button background color: Sets the background color of the back to table of contents button.（Available only when Back to Contents button is enabled）</li>\n</ul>\n<h3>Advanced settings</h3>\n<p>If you want to do advanced customization such as the button to return to the table of contents and the exclusion of plugin CSS, please set here.</p>\n<ul>\n<li>Button to return to table of contents: (Only for smartphones) Display a button to return to the table of contents.</li>\n<li>Button location to return to table of contents: (Only for smartphones) You can set the button to return to the table of contents to the left or right.</li>\n<li>Up and down adjustment of the button to return to the table of contents: （example -20,40）</li>\n<li>Excluded post ID: You can set posts that you do not want to show the table of contents. Set the table of contents not to be displayed in the article by entering the post article ID separated by commas.（Example 2,3,75）</li>\n<li>Excluded page ID: You can set pages that you do not want to display the table of contents. By entering page IDs separated by commas, you can set the table of contents not to be displayed in articles.（Example 4,6,91）</li>\n<li>Default table of contents settings: Select whether to display the table of contents open or closed.</li>\n<li>Do not load plugin CSS: If checked, all CSS of RTOC will not be read and all design settings will be invalid. If you have customized the table of contents using CSS, JS, etc., please check here and operate.</li>\n</ul>\n<h3>RTOC shortcode</h3>\n<p>You can display the table of contents by pasting this code anywhere in the article. If you do not enter a value (such as title = &#8220;&#8221;) and it is blank, the setting on the management screen will be reflected.<br />\nFor details, see the actual setting screen, so check that.</p>\n<h3>Help</h3>\n<p>If you have any problems, we will be glad to help you contact our support.<br />\nAlso, basic issues are listed in the &#8220;Help section&#8221; of the plugin, so please look there first.</p>\n",
        "installation": "<p>【How to automatically install from the WordPress admin screen】<br />\n    ①Click &#8220;Plugins&#8221; <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> &#8220;Add New&#8221; from the WordPress administration screen.<br />\n    ②Type &#8220;Rich Table of Contents&#8221; in the new search box.<br />③Activate after installation\n</p>\n<p></p>\n<p>【How to install manually using FTP etc.】<br />\n①Download this plugin from WordPress.org（There is a button called &#8220;Download&#8221; on the right side of the plugin title on this page, so download from there）<br />②Unzip the zip file called &#8220;rich-table-of-content&#8221; and download it to the / wp-content / plugins / directory.<br />③Click the plugin from the WordPress administration screen and click Activate.</p>\n",
        "changelog": "<h4>1.0</h4>\n<p>First Release.</p>\n<h4>1.0.1</h4>\n<p>The version has been upgraded with minor corrections!</p>\n<h4>1.0.2</h4>\n<p>The version has been upgraded with minor corrections!</p>\n<h4>1.0.3</h4>\n<p>＜Corrected item＞<br />\n・[JIN only] Fixed the problem that characters written in the category disappeared<br />\n・Fixed the problem that the heading icon short code was displayed<br />\n・Fixed an issue that short code is not displayed when SPACE is included<br />\n・Fixed an issue where pasting a shortcode into a tracking widget was not reflected<br />\n・Fixed the problem that it is not displayed correctly only with &#8216;(&#8216; and &#8216;[&#8216;<br />\n・Fixed display bug on IE and EDGE</p>\n<h4>1.0.4</h4>\n<p>＜Corrected item＞<br />\n・Fixed an issue where footer copyright display was broken by affinger<br />\n・Fixed an issue where the $ hook string was exposed on the admin screen<br />\n・Fixed an issue where a line break on a text editor would cause the line break to disappear even if the line was saved on a text editor.<br />\n・Fixed the problem that the set id is deleted when the id is set in the headline<br />\n┗The problem of IDs being deleted in the table of contents created with shortcodes continues.<br />\n・Fixed the problem that the top article disappears if RTOC is included when the fixed top page is set in &#8220;AFFINGER management&#8221;&gt; &#8220;Top page&#8221; in affinger5</p>\n<h4>1.0.5</h4>\n<p>＜Corrected item＞<br />\n・fixed HTML structure of table of contents is broken<br />\n・Fixed a problem where the table of contents is displayed on a page even if the display check is removed.<br />\n・Fixed a problem where id is lost if id is set to a heading when a shortcode is used to generate a table of contents.<br />\n・Adding Help Items<br />\n・Correction of typos and omissions in the management screen.</p>\n<h4>1.0.6</h4>\n<p>＜Corrected item＞<br />\n・Fixed a problem where the &#8220;Back to Table of Contents&#8221; button is displayed even if there is no table of contents.</p>\n<h4>1.0.9</h4>\n<p>＜Corrected item＞<br />\n・Confirmed support for WordPress 5.4</p>\n<h4>1.1.0</h4>\n<p>＜Added item＞<br />\n・Added translation files to support English and Japanese.</p>\n<h4>1.1.2</h4>\n<p>＜Corrected item＞<br />\n・Corrected a typo in the management screen.</p>\n<h4>1.1.4</h4>\n<p>＜Corrected item＞<br />\n・Fixed a problem with HTML anchors in headings that caused the headings to jump to other headings when the table of contents was clicked.<br />\n・Fixed a problem where the design is not reflected when the headline design is customized. (Only font size is supported.)<br />\n・Fixed a problem that does not work even if you put RTOC in the sidebar follow widget and click it on the category page.<br />\n・Fixed the problem of links not jumping on category pages.<br />\n・Fixed a problem in which the ad above the first heading of JIN is displayed on the table of contents when the table of contents is set above the heading when using RTOC. (JIN only)</p>\n<p>＜Added item＞<br />\n・Added an item that can change the text of the Back to Table of Contents button.<br />\n・Added an item that can change the text of the open/close button.</p>\n<h4>1.1.6</h4>\n<p>＜Corrected item＞<br />\n・Fixed a problem with the first heading.<br />\n・Fixed a problem with shortcode headings not jumping.</p>\n<h4>1.1.7</h4>\n<p>＜Corrected item＞<br />\n・Fixed a problem with a count() error when adding headings to a category page.<br />\n・Fixed an issue where IDs are not given for the first heading and you can&#8217;t jump from the table of contents.</p>\n<h4>1.1.9</h4>\n<p>＜Corrected item＞<br />\n・Fixed an issue where an article created in Gutenberg and edited in Classic Editor does not scroll when clicked on to check the article.<br />\n・Fixed an issue where the sequential numbering of the table of contents does not scroll correctly when using numbers.</p>\n<h4>1.1.97</h4>\n<p>＜Corrected item＞<br />\n・Added &#8220;rtoc-&#8221; to the name used in counter to prevent duplication when counter-increment is used in other themes and plugins.<br />\n・Fixed a problem where the sequential numbering was broken if H2 was numbered &#8220;1.&#8221; and H3 was numbered &#8220;01 |&#8221;.<br />\n・In RTOC Settings &gt; Shortcodes &gt; Table of Contents shortcode, change heading=&#8221;h3&#8243; to heading=&#8221;&#8221;.<br />\n・Fixed earlyacccess of Noto Sans JP to the official version.<br />\n・Fixed the paragraph structure of the output table of contents.<br />\n・Make it possible to handle Japanese characters in the id name.</p>\n<h4>1.1.98</h4>\n<p>＜Corrected item＞<br />\n・Added placeholder to the exclude ID setting in the application settings.<br />\n・Fixed a problem where the table of contents would also reflect headings that were bold or italicized, or contained other elements such as img tags in the headings.<br />\n・Fixed an issue where the Gutenberg Widget in WordPress 5.8 would throw an error.<br />\n・Fixed an issue where a popup would appear when using JIN, even if a color other than JIN color was set.</p>\n<h4>1.2.1</h4>\n<p>＜New Features＞<br />\n・Added a function to measure the usage rate of the table of contents for 7 days. Only articles with a table of contents are supported, and you can check the value on the article edit screen. (This figure is calculated by our own method.)<br />\n・Adjustment of existing designs<br />\n・Refactoring the code</p>\n<h4>1.2.2</h4>\n<p>＜Corrected item＞<br />\n・Fixed Syntax Error in PHP 7.2 and below that was found in Ver1.2.1.</p>\n<h4>1.2.5</h4>\n<p>＜Corrected item＞<br />\n-Support for WordPress 5.9-<br />\n・Fixed the problem of headings not jumping correctly.</p>\n<h4>1.2.6</h4>\n<p>＜Corrected item＞<br />\n-Support for WordPress 5.9-<br />\n・Fixed the problem of not jumping to the heading properly when using double-byte numbers or certain special characters.<br />\n・Fixed broken design in the sidebar.</p>\n<h4>1.3.0</h4>\n<p>\nFixed issue with display of TOP page table of contents<br />\nFixed issue with RTOC not being detected as table of contents in Rank Math SEO</p>\n<p>\nAddition of a setting to hide the open/close button of the table of contents.<br />\nAddition of a setting to display the Back to Table of Contents button on PCs.<br />\nAddition of a function to display the Back to Table of Contents button with a fade-in.<br />\nUnify and brush up the table of contents design in the sidebar.</p>\n<p>\nAdjustment of design in other themes.<br />\nAdjustment of the design of the sidebar.<br />\nLoad fonts only for selected fonts.</p>\n<h4>1.3.1</h4>\n<p>\nFixed an issue that prevented viewing media and editing articles.<br />\nFixed an issue where a margin would open under an article on the TOP page.</p>\n<h4>1.3.2</h4>\n<p>\nFixed an issue that caused an error when activating the plugin.<br />\nFixed an issue that caused margins to appear when the top page is a fixed page.</p>\n<h4>1.3.4</h4>\n<p>\nFixed an issue with a margin opening under the footer when viewing the article on a mobile phone.<br />\nFixed an issue where the sidebar would be covered when viewing an article on a mobile phone.<br />\nFixed an issue where the design of the sidebar would be corrupted when a specific design is selected.</p>\n<h4>1.3.5</h4>\n<p>\nAdded a check box to not display the table of contents on the TOP page.</p>\n<p>\nAdjusted the CSS of the table of contents.<br />\nAdjustment of open/close button design.</p>\n<p>\nFixed a problem with the table of contents of other articles being displayed on fixed pages.<br />\nFixed a problem with shortcodes not displaying properly.<br />\nFixed a problem that the messages of other plug-ins are not displayed on the RTOC setting screen.<br />\nFixed a JS error when a shortcode was added to the sidebar with no table of contents in the article.</p>\n<h4>1.3.6</h4>\n<p>\nSupport for WordPress 6.1.1</p>\n<p>\nFixed an issue where the table of contents title was right-aligned when there was a table of contents in the sidebar.<br />\nFixed an issue where the open/close button of the table of contents was below the title.<br />\nFixed an issue where the table of contents stops tracking when the page frame is trimmed.<br />\nFixed an issue where the title color of the table of contents was not reflected.<br />\nFixed an issue where the table of contents is displayed even on category pages when using the WordPress theme JIN:R.</p>\n<h4>1.3.8</h4>\n<p>\nThe following issues have been corrected.<br />\n「RTOC does not validate and escapes some of its shortcode attributes before outputting them back in the page, which could allow users with a role as low as a contributor to perform Stored Cross-Site Scripting attacks, which could be used against high privileged users such as admin. and we consider it a high-risk level.」</p>\n<h4>1.3.9</h4>\n<p>\nThe following issues have been corrected.<br />\n「RTOC does not validate and escapes some of its shortcode attributes before outputting them back in the page, which could allow users with a role as low as a contributor to perform Stored Cross-Site Scripting attacks, which could be used against high privileged users such as admin. and we consider it a high-risk level.」</p>\n<h4>1.3.91</h4>\n<p>\n・Support for WordPress 6.2<br />\n・Partial refactoring of internal code<br />\n・Banner replacement</p>\n<h4>1.3.96</h4>\n<p>\n・Fixed an issue that the table of contents is not displayed on fixed pages with customized categories of WordPress theme JIN:R.<br />\n・Design Adjustment</p>\n<h4>1.3.97</h4>\n<p>\n・Design Adjustment</p>\n<h4>1.3.99</h4>\n<p>\n・Fixed an error when using a theme other than JIN:R.</p>\n<h4>1.4.0</h4>\n<p>\nSupport for WordPress 6.6.1</p>\n<p>\n・Fixed an issue where a Warning error would occur if you went to the article page before entering the settings screen.<br />\n・Fixed an issue where initial values were not reflected when the plugin was activated for the first time.<br />\n・Fixed an issue with the table of contents in the sidebar penetrating into the footer in certain environments.<br />\n・Fixed an issue that caused Javascript errors under certain conditions.</p>\n"
    },
    "short_description": "RTOC is a table of contents generation plugin from Japan that allows anyone to easily create a table of contents. Equipped with the functions of the c &hellip;",
    "description": "<p>RTOC is a table of contents generation plugin from Japan that allows anyone to easily create a table of contents. Equipped with the functions of the conventional table of contents plugin, it is designed to thoroughly pursue design and ease of use.<br />\nIntroducing a real-time preview with an intuitive UI design allows you to create an ideal table of contents with a single button.It is definitely a plus factor for your blog or site.RTOC is easy to use, so please use it.</p>\n<h3>Install</h3>\n<p>【How to automatically install from the WordPress admin screen】<br />\n    ①Click &#8220;Plugins&#8221; <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> &#8220;Add New&#8221; from the WordPress administration screen.<br />\n    ②Type &#8220;Rich Table of Contents&#8221; in the new search box.<br />③Activate after installation\n</p>\n<p></p>\n<p>【How to install manually using FTP etc.】<br />\n①Download this plugin from WordPress.org（There is a button called &#8220;Download&#8221; on the right side of the plugin title on this page, so download from there）<br />②Unzip the zip file called &#8220;rich-table-of-content&#8221; and download it to the / wp-content / plugins / directory.<br />③Click the plugin from the WordPress administration screen and click Activate.</p>\n<h3>Basic settings</h3>\n<p>Configure the basic settings for the table of contents.</p>\n<ul>\n<li>Table of contents title: You can freely decide the title of the table of contents.</li>\n<li>Auto insert for the following content types: You can decide whether to show the table of contents on posts and pages.</li>\n<li>Heading to be displayed: Set which heading (h2, h3, h4) to display.</li>\n<li>Display conditions: Set the number of headings to display the table of contents.</li>\n<li>Font: Set font.</li>\n</ul>\n<h3>Design settings</h3>\n<p>You can freely set the table of contents design.</p>\n<ul>\n<li>Title display: Set whether the title position is left or center.</li>\n<li>H2 list design: Set the H2 list design.</li>\n<li>H3 list design: Set the H3 list design.</li>\n<li>Frame design: Sets the table of contents frame design.</li>\n<li>Animation: Set the animation when the table of contents is displayed。</li>\n<li>Smooth scroll   : Set whether to scroll to the headline when clicking (tapping) the table of contents.</li>\n</ul>\n<h3>Preset color settings</h3>\n<p>RTOC color preset added by default. Choose and set the preset that suits your site.</p>\n<h3>Color settings(For advanced users)</h3>\n<p>In addition to the preset colors, you can set your own colors. If you want to set your own color or modify the preset color partially, please change the color here.</p>\n<ul>\n<li>Title color: Set the title color.</li>\n<li>Text color: Set the text color.</li>\n<li>Back color: Set the back color.</li>\n<li>Border color: Set the border color.</li>\n<li>H2 list color: Set the H2 list color.</li>\n<li>H3 list color: Set the H3 list color.</li>\n<li>Back to table of contents button background color: Sets the background color of the back to table of contents button.（Available only when Back to Contents button is enabled）</li>\n</ul>\n<h3>Advanced settings</h3>\n<p>If you want to do advanced customization such as the button to return to the table of contents and the exclusion of plugin CSS, please set here.</p>\n<ul>\n<li>Button to return to table of contents: (Only for smartphones) Display a button to return to the table of contents.</li>\n<li>Button location to return to table of contents: (Only for smartphones) You can set the button to return to the table of contents to the left or right.</li>\n<li>Up and down adjustment of the button to return to the table of contents: （example -20,40）</li>\n<li>Excluded post ID: You can set posts that you do not want to show the table of contents. Set the table of contents not to be displayed in the article by entering the post article ID separated by commas.（Example 2,3,75）</li>\n<li>Excluded page ID: You can set pages that you do not want to display the table of contents. By entering page IDs separated by commas, you can set the table of contents not to be displayed in articles.（Example 4,6,91）</li>\n<li>Default table of contents settings: Select whether to display the table of contents open or closed.</li>\n<li>Do not load plugin CSS: If checked, all CSS of RTOC will not be read and all design settings will be invalid. If you have customized the table of contents using CSS, JS, etc., please check here and operate.</li>\n</ul>\n<h3>RTOC shortcode</h3>\n<p>You can display the table of contents by pasting this code anywhere in the article. If you do not enter a value (such as title = &#8220;&#8221;) and it is blank, the setting on the management screen will be reflected.<br />\nFor details, see the actual setting screen, so check that.</p>\n<h3>Help</h3>\n<p>If you have any problems, we will be glad to help you contact our support.<br />\nAlso, basic issues are listed in the &#8220;Help section&#8221; of the plugin, so please look there first.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.4.0.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "cms": "cms",
        "indexes": "indexes",
        "navigation": "navigation",
        "table-of-contents": "table of contents",
        "toc": "toc"
    },
    "stable_tag": "1.4.0",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.0.6.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.0.7.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.0.8.zip",
        "1.0.9": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.0.9.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.1.2.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.1.8.zip",
        "1.1.9": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.1.9.zip",
        "1.1.96": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.1.96.zip",
        "1.1.97": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.1.97.zip",
        "1.1.98": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.1.98.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.2.2.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.2.6.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.8.zip",
        "1.3.91": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.91.zip",
        "1.3.92": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.92.zip",
        "1.3.93": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.93.zip",
        "1.3.94": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.94.zip",
        "1.3.95": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.95.zip",
        "1.3.96": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.96.zip",
        "1.3.97": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.97.zip",
        "1.3.98": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.98.zip",
        "1.3.99": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.3.99.zip",
        "1.30": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.30.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.4.0.zip",
        "1.9.95": "https://downloads.wordpress.org/plugin/rich-table-of-content.1.9.95.zip",
        "trunk": "https://downloads.wordpress.org/plugin/rich-table-of-content.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://croover.co.jp/",
    "banners": {
        "low": "https://ps.w.org/rich-table-of-content/assets/banner-772x250.png?rev=2251177",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/rich-table-of-content/assets/icon-128x128.png?rev=2252503",
        "2x": "https://ps.w.org/rich-table-of-content/assets/icon-256x256.png?rev=2252503"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 82,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "rich-table-of-content",
            "language": "zh_TW",
            "version": "1.4.0",
            "updated": "2023-08-25 19:06:25",
            "package": "http://downloads.wordpress.org/translation/plugin/rich-table-of-content/1.4.0/zh_TW.zip"
        }
    ]
}