{
    "name": "Photo Gallery, Images, Slider in Rbs Image Gallery",
    "slug": "robo-gallery",
    "version": "3.2.21",
    "author": "<a href=\"https://robosoft.co/gallery\">RoboSoft</a>",
    "author_profile": "https://profiles.wordpress.org/robosoft/",
    "contributors": {
        "gallerysupport": {
            "profile": "https://profiles.wordpress.org/gallerysupport/",
            "avatar": "https://secure.gravatar.com/avatar/dff9c2b15d2b3ff10a38565969e7e6a7?s=96&d=monsterid&r=g",
            "display_name": "gallerysupport"
        },
        "robosoft": {
            "profile": "https://profiles.wordpress.org/robosoft/",
            "avatar": "https://secure.gravatar.com/avatar/4a5208b3011d8f276f01b298d579783d?s=96&d=monsterid&r=g",
            "display_name": "robosoft"
        }
    },
    "requires": "3.3",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 86,
    "ratings": {
        "5": 314,
        "4": 8,
        "3": 6,
        "2": 8,
        "1": 57
    },
    "num_ratings": 393,
    "support_url": "https://wordpress.org/support/plugin/robo-gallery/",
    "support_threads": 15,
    "support_threads_resolved": 15,
    "active_installs": 50000,
    "downloaded": 2011857,
    "last_updated": "2024-07-21 12:11pm GMT",
    "added": "2015-07-14",
    "homepage": "https://robosoft.co/gallery",
    "sections": {
        "description": "<p>Gallery on your website it&#8217;s really attractive and a very important part of your pages. If you looking for a fast, easy plugin with a simple and very beautiful, highly customizable design <a href=\"https://www.robogallery.co/gallery-showcase/\" rel=\"nofollow ugc\">ALL DEMOS YOU CAN FIND HERE</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/7ejiww-ekHE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>With our plugin, even newbies in WordPress will be able to create their first gallery in a few minutes and at the same time WordPress professionals get advanced tools and freedom of creativity. Just download this plugin and you&#8217;ll not look for any other plugin anymore! <a href=\"https://www.robogallery.co/gallery-showcase/\" rel=\"nofollow ugc\">Gallery Showcase with the previews of all views</a></p>\n<blockquote>\n<h4>Demos</h4>\n<p><a href=\"https://www.robogallery.co/gallery-showcase/\" rel=\"nofollow ugc\">All Gallery Demos</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/portfolio-gallery/\" rel=\"nofollow ugc\">Portfolio Gallery</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/hashtags/\" rel=\"nofollow ugc\">Hash Tags</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/masonry-gallery/\" rel=\"nofollow ugc\">Masonry Gallery</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/youtube-video-gallery/\" rel=\"nofollow ugc\">Youtube Video</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/blog-style-gallery/\" rel=\"nofollow ugc\">Blog Style</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/vimeo-video-gallery/\" rel=\"nofollow ugc\">Vimeo Video</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/cars-gallery-demo/\" rel=\"nofollow ugc\">Multi Categories Cars Demo</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/custom-layout/\" rel=\"nofollow ugc\">Grid Layout Demo with Fade hover effect</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/gallery-demo-movie/\" rel=\"nofollow ugc\">Multi Categories Polaroid style Movie Demo with classic layout</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/gallery-design/\" rel=\"nofollow ugc\">Design Sketch Demo with grid layout</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/push-effect-demo/\" rel=\"nofollow ugc\">Multi Categories Demo with custom interface colors and classic layout</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/design-video-gallery/\" rel=\"nofollow ugc\">Video Demo with grid layout</a></p>\n</blockquote>\n<h4>Key Features</h4>\n<ul>\n<li><strong>No Right click / Content protection</strong> &#8211;  in Robo gallery possible to disable right click to prevent copying of the gallery content.  Content copy protection is very important for every photographer&#8217;s portfolio photos.</li>\n<li><strong>Lightbox no right-click / Content protection</strong> &#8211;  in Robo gallery possible to disable right-click to prevent copying of the gallery lightbox content.  Content copy protection is very important for every photographer&#8217;s portfolio photos.</li>\n<li><strong>One click setup</strong> &#8211; implemented one-click wizard with the 5 types: image grid, mosaic, masonry, polaroid, and youtube gallery.</li>\n<li><strong>No limits</strong> &#8211; no limits for the number of instances with 5 free types: photo grid, mosaic, masonry, polaroid, and youtube grid.</li>\n<li><strong>No limits for images/photos</strong> &#8211; no limits for the number of images/photos in every album.</li>\n<li><strong>Gutenberg block</strong> &#8211; implemented Gutenberg gallery block for simple and fast configuration of the plugin in Gutenberg editor.</li>\n<li><strong>Fully responsive and Mobile features</strong> &#8211; plugin implemented with advanced settings for different devices&#8217; screen sizes.</li>\n<li><strong>Fade effects</strong> &#8211; one of the hover animations it&#8217;s a classic fade effect. </li>\n<li><strong>Batch images upload</strong> &#8211; advanced media manager which allows uploading batch of images with one click. Just drag and drop a set of the gallery images and it&#8217;s uploaded automatically to the server.</li>\n<li><strong>Auto-resizing for thumbnails and images</strong> &#8211; media manager allow you to make additional customization of the images, rotary, flip, crop, and manually resize.</li>\n<li><strong>Customizable 15 hover effects</strong> &#8211; all hover effects work in cooperation with interface configuration options. You can easily change the style and colors of the hover animation elements.</li>\n<li><strong>Implemented to avoid AJAX libs conflicts</strong> &#8211; code implemented in native WordPress style as a result our plugin doesn&#8217;t have any conflicts and works really stable.</li>\n<li><strong>Polaroid gallery</strong> &#8211; with our plugin you can create a Polaroid layout just with a few clicks.</li>\n<li><strong>Advanced Polaroid Styles</strong> &#8211; Polaroid styles are implemented with advanced functionality. Implemented left, right and center image titles alignment. Polaroid description panel of the image&#8217;s background color selector. </li>\n<li><strong>Build in colors selector</strong> &#8211; you can easily change the color of any interface element.</li>\n<li><strong>Social sharing</strong> &#8211; gallery lightbox supports social sharing on Twitter, Facebook, google plus and Pinterest.</li>\n<li><strong>Build in borders and shadows settings</strong> &#8211; borders and shadows have advanced options for configuration design and style of this gallery interface elements.</li>\n<li><strong>Font settings</strong> &#8211; build in advanced text style editor options. With these options, you can fully customize the title, caption, and description of every image</li>\n<li><strong>Different resolutions</strong> &#8211; implemented advanced size control options where you can define layout or fixed size for the interface elements on different screen resolutions</li>\n<li><strong>Implemented in native WordPress style using native classes</strong> &#8211; native for WordPress implemented without any hacks and tricks</li>\n<li><strong>Multi Categories</strong> &#8211; multi categories albums support. You can create your own galleries tree, depending on your needs</li>\n<li><strong>Classic layout</strong> &#8211; layout could have a classic style or grid layout, and every item on the page could have its own styles and settings</li>\n<li><strong>Advanced pagination function</strong> &#8211; pagination function implemented in google load more style</li>\n<li><strong>Work in IE, Firefox, Safari, Opera, Chrome</strong> &#8211; work properly in all the latest versions of the popular browsers</li>\n<li><strong>Lazy loading option</strong> &#8211; implemented advanced lazy loading options, for the case when you have big sets of images you can define the amount of the galleries images for the first load and for the next steps of the load more options</li>\n<li><strong>Advanced cache options</strong> &#8211; implemented advanced images caching options</li>\n<li><strong>Overlay effects</strong> &#8211; all hover effects of the thumbnails are highly customizable and have a full set of options</li>\n<li><strong>Backend text settings preview</strong> &#8211; all images titles, captions, and descriptions are highly customizable also we have a life preview of the changes in the backend</li>\n<li><strong>Resizing crop function</strong> &#8211; in media managed you&#8217;ll find a great set of very useful features for example images crop, and manual resizing</li>\n<li><strong>Optional mobile touch support</strong> &#8211; our plugin supports mobile devices and you can customize responsive gallery layout settings for different screen sizes</li>\n<li><strong>Custom ordering of the images</strong> &#8211; ordering for all images  could be easily changed manually in the media manager or you can find order by options in general settings</li>\n<li><strong>Ability to insert plugin to the WordPress post, page, widget</strong> &#8211; every item could be inserted in to post, page or widget with a build shortcode tag or using a wizard button &#8211; shortcode generator in post or page editor</li>\n<li><strong>Lightbox social buttons</strong> &#8211; in plugin settings you can turn on/off social buttons</li>\n<li><strong>Lightbox background color</strong> &#8211; in lightbox settings you can change the color of the background with a comfortable color selector</li>\n<li><strong>Lightbox background transparency</strong> &#8211; in lightbox settings you can change the transparency of the background with a comfortable color selector</li>\n<li><strong>Lightbox font color</strong> &#8211; in lightbox settings you can change the color of the font with a comfortable color selector</li>\n<li><strong>Lightbox font transparency</strong> &#8211; in lightbox settings you can change the transparency of the font with a comfortable color selector</li>\n<li><strong>Advanced Compatibility</strong> &#8211;  implement advanced compatibility options to avoid conflict with libraries of other plugins and themes. You can switch between modes to find the proper value for your case.</li>\n<li><strong>Advanced Social Sharing</strong> &#8211;  advanced social sharing functionality in a lightbox. Implemented deep linking functionality for the images social sharing services Facebook, Twitter, Pinterest, Google+, VK</li>\n<li><strong>Click Thumbnails</strong> &#8211; advanced click functionality. You can use click-on buttons or on the gallery thumbnails to enlarge images or open the image link.  With the new functionality, you can combine absolutely different features of the clicking functionality.</li>\n<li><strong>Alignment</strong> &#8211; alignment of the photo gallery in the post or page depends on your needs. You don&#8217;t need to use HTML tags or some CSS tricks this function gonna help you to align your image gallery the way you need. Possible to select one from implemented alignment modes: left, right, and center for image alignment inside post or page content.</li>\n<li><strong>Padding</strong> &#8211; new padding options. Define custom values in pixels for padding thumbnails block in post or page content. Is it possible to define padding from the left, right, top and bottom side</li>\n<li><strong>Post Generator</strong> &#8211; new function for the automatic post creation with a gallery tag inside it. Advanced post manager implemented with additional functions for customization and management of all your posts in one place.</li>\n<li><strong>Description Panel</strong> &#8211; new image description panel in a lightbox with a few different themes. The settings section makes you able to change content panel theme styles. In the description panel, you can define a few content sources. Image title, image caption or image description.</li>\n<li><strong>Swipe in Lightbox</strong> &#8211; lightbox supports the swipe effect on multiple mobile devices. Swipe properly work in the lightbox for all images. Tested for Android and iOS.</li>\n<li><strong>Advanced Link Button Design</strong> &#8211; front end interface have link button. This button provides linking functionality on every thumbnail.<br />\nThis interface button has a wide range of front-end interface customization options. You can easily change this button color, border and icon.</li>\n<li><strong>Hover Description Template</strong> &#8211; every image contain description field. In additional parameters of the image hover, you can define some HTML tags or build-in tags for customization of the image description.</li>\n<li><strong>Plugin Compatibility Settings</strong> &#8211; in plugin settings you can customize general plugin settings to avoid conflicts with other plugins or WordPress themes.</li>\n<li><strong>Admin Interface Modes</strong> &#8211; in plugin settings you can customize plugin interface settings to avoid conflicts with another plugin.</li>\n<li><strong>Video Links</strong> &#8211; in the media manager every image have a separate option for a video link. Video links could be specified to the youtube feed or Vimeo.</li>\n<li><strong>Images Custom Ratio</strong> &#8211; in plugin settings you can define a custom ratio for every picture. Every gallery could have personal settings for this option.</li>\n<li><strong>Thumbnails Fade Effect</strong> &#8211; implemented Fade effect for the hover of the photo thumbnails. With such a hover animation effect become more attractive and eye-catching.</li>\n<li><strong>Advanced Load more function</strong> &#8211; implemented very attractive navigation mode. Auto pre-loading images like an endless list of images. Load more functions have a lot of customization options to make it work the way you need.</li>\n<li><strong>SEO code optimization</strong> &#8211; implemented a few front-end code output modes. One simplified mode with all core front-end code elements and another mode with additional not visible elements. This option has additional modes. These SEO output modes give you default output mode, thumbnail, and thumbnail+links mode.</li>\n<li><strong>Template</strong> &#8211; in our plugin, we have an advanced template engine for images description. Every hover text of the image could be edited and customized with built-in template options.</li>\n<li><strong>Cache</strong> &#8211; incredible new super cache option makes your page load ten times faster. This function use absolutely new model of the image load. When you enable cache for big-size galleries it&#8217;s gonna be much faster and more effective to use our plugin. Your visitors will be really surprised by the speed of the page load.</li>\n<li><strong>Support Videos</strong> &#8211; every image has an option where possible to define a video link for every particular picture.</li>\n<li><strong>Elementor Block</strong> &#8211; in the Elementor page builder you can use the built-in Elementor block in our plugin.</li>\n<li><strong>Slider</strong> &#8211; possible to create an image slider with mobile-friendly interface and support touchscreen devices. In slideshow mode, you can upload photos to the image slideshow and configure different interface elements to navigate between slides. Possible to create an unlimited amount of photo sliders with different text on the description panel. You can use a title, caption or photo description as a text source for every slide of the image slider.</li>\n</ul>\n<h4>Pro Key Features</h4>\n<ul>\n<li><strong>50+ pre-configured styles</strong> &#8211; one-click setup of the gallery with required type and theme styles. These styles are classified into 6 categories with different types of grid layouts and interface views.</li>\n<li><strong>Advanced Youtube Gallery</strong> &#8211; pre-configured 6 views for the youtube feeds mode. Every instance has a full set of design configuration controls.</li>\n<li><strong>Advanced Photo Grid Themes</strong> &#8211; pre-configured 8 views for the image grid view with additional advanced interface and layout configuration settings.</li>\n<li><strong>Advanced Masonry Themes</strong> &#8211; pre-configured 8 views for the masonry grid views with additional advanced interface and layout configuration settings. Added smart resizing mode for the resizing images automatically for the building of the masonry grid layout. </li>\n<li><strong>Advanced Mosaic Themes</strong> &#8211; pre-configured 6 views for the mosaic grid views with additional advanced interface and layout configuration settings.</li>\n<li><strong>Advanced Polaroid Themes</strong> &#8211; pre-configured 8 views for the polaroid grid views with additional advanced interface and layout configuration settings.</li>\n<li><strong>Advanced Wall Style Themes</strong> &#8211; pre-configured 8 views for the wall style grid view with additional advanced interface and layout configuration settings.</li>\n<li><strong>Advanced Menu Settings</strong> &#8211; full access to the configuration of the top grid filters and navigation buttons. With the configuration of the navigation menu styles and modes. </li>\n<li><strong>Advanced Tags Navigation</strong> &#8211; tags navigation mode for the top navigation menu.</li>\n<li><strong>Advanced Polaroid Settings</strong> &#8211; configuration of the polaroid content source and design for the description panel.</li>\n<li><strong>Advanced Size Settings</strong> &#8211; set of size options, grid spacing, column management, and mobile-friendly settings for mobile devices.</li>\n<li><strong>Advanced Lightbox Settings</strong> &#8211; customizable colors, styles and visibility of the navigation elements in the lightbox popup.</li>\n<li><strong>Advanced Hover Settings</strong> &#8211; multiply colors configuration for the overlay, buttons and all text for the additional hover elements like title, caption and description.</li>\n<li><strong>Advanced Pagination Settings</strong> &#8211; configuration of the load more function workflow. Modification of the styles and colors of the pagination interface element.</li>\n<li><strong>Advanced Layout Settings</strong> &#8211; image grid settings, different layout settings for the desktop site version and mobile devices. Android or iOS, mobile-friendly gallery layout.</li>\n<li><strong>Advanced Resizing Settings</strong> &#8211; for the masonry grid implemented a new automatic, advanced thumbnail resizing function.</li>\n<li><strong>Youtube Playlist</strong> &#8211; fast import of the youtube playlist videos in a few clicks.  </li>\n<li><strong>Youtube Channel</strong> &#8211; fast import of the youtube channel videos in a few clicks.  </li>\n<li><strong>Image Link</strong> &#8211; every image have a personal link field. You can set a different link for every image.</li>\n<li><strong>Tags for images</strong> &#8211; every image contain description field. In additional parameters of the image hover, you can define some HTML tags or build-in tags for customization of the image description.</li>\n<li><strong>Grid layout</strong> &#8211; in plugin implemented not only a classic gallery layout, but also a grid layout for the modern style with different sizes of thumbnails.</li>\n<li><strong>Smart Links</strong> &#8211; implemented smart image links and video links parsing algorithm. Implemented auto-detection links with turned-off link navigation buttons</li>\n<li><strong>Hover layout template</strong> &#8211; hover effects have a set of advanced options. For example, you can customize the layout of the hover effect with build tags</li>\n<li><strong>Customizable Grid</strong> &#8211; every image has additional options for customization of the layout of the photos, as result, you can build a fully custom gallery grid, depending on your needs. You can decide which size of the thumbnails matrix you need on your website</li>\n<li><strong>Customizable hover icons</strong> &#8211; all icons of the gallery buttons are fully customizable and every icon could be easily changed with the build icons wizard</li>\n<li><strong>Gallery widget</strong> &#8211; every item could be inserted in to post, page or widget with a build shortcode tag or using a wizard button &#8211; shortcode generator in the post or page editor</li>\n<li><strong>Clone</strong> &#8211; if you have hundreds of galleries on the website this feature is really useful for you! Clone settings of one gallery to apply it to another one. So you can copy styles of the source item to as many galleries as you need with just one click.</li>\n<li><strong>Custom Thumbnails Shadows</strong> &#8211; shadow it&#8217;s a very  &hellip;</li>\n</ul>\n",
        "installation": "<p>You don&#8217;t need to do any additional configurations or manual code changes. You can install it through the regular installer of WordPress. Just download the plugin and install it manually or automatically using the WordPress repository. If you have some questions related to our plugin feel free to contact our support team we are happy to help you!</p>\n",
        "faq": "\n<dt id='how%20to%20upload%20images%20to%20the%20gallery%3F'>\nHow to upload images to the gallery?\n</h4>\n<p>\n<p>When you create a new gallery or open an already existent item for edit on the right side of the edit settings section you&#8217;ll see the images manager button. When you open the images manager you&#8217;ll be able there to edit all media resources settings. Upload, edit or delete. In the images manager, you can use the drag and drop images upload tool.</p>\n</p>\n<dt id='how%20to%20change%20the%20quality%20of%20the%20thumbnails%3F'>\nHow to change the quality of the thumbnails?\n</h4>\n<p>\n<p>The quality of the thumbnails could be easily changed in size option/thumbnails options/source</p>\n</p>\n<dt id='where%20it%27s%20possible%20to%20define%20vertical%20and%20horizontal%20paddings%3F'>\nWhere it&#8217;s possible to define vertical and horizontal paddings?\n</h4>\n<p>\n<p>In settings, you can define horizontal and vertical paddings between thumbnails</p>\n</p>\n<dt id='do%20you%20have%20some%20limits%20for%20image%20size%3F'>\nDo you have some limits for image size?\n</h4>\n<p>\n<p>No, we don&#8217;t have any limits for image size.</p>\n</p>\n<dt id='how%20i%20can%20create%20a%20custom%20%28grid%29%20layout%20of%20the%20thumbnails%3F'>\nHow I can create a custom (grid) layout of the thumbnails?\n</h4>\n<p>\n<p>Our plugin implemented a layout based on column amount. So you can general amount of columns in your gallery grid and define a custom amount of columns which every image gonna take. As result, you can customize the layout of the grid</p>\n</p>\n<dt id='is%20it%20possible%20to%20insert%20the%20video%20as%20a%20gallery%20link%3F'>\nIs it possible to insert the video as a gallery link?\n</h4>\n<p>\n<p>Yes. When you open media manager you&#8217;ll see their list of images. Click on some images and on the right side you&#8217;ll see image options. Every image has a video link field in the image options, where you can define some custom links to the online video.</p>\n</p>\n<dt id='how%20to%20define%20the%20size%20of%20the%20gallery%20images%20thumbnails%3F'>\nHow to define the size of the gallery images thumbnails?\n</h4>\n<p>\n<p>Our thumbnail layout is fully responsive and thumbnail size depends on a lot of factors. It calculates thumbnails automatically depending on the general size and layout settings.  First of all, you can define ratio values for the thumbnails. Size of the thumbnails could be selected from standard pre-defined WordPress sizes: thumbnail, medium, large, full</p>\n</p>\n<dt id='how%20to%20load%20more%20function%20work%3F'>\nHow to load more function work?\n</h4>\n<p>\n<p>In the admin section, you can define the number of images for the first load after clicking on load more button. Load more it&#8217;s such google style pagination functionality that makes you able to limit the number of images for the first load</p>\n</p>\n<dt id='how%20do%20change%20the%20number%20of%20columns%20in%20the%20layout%3F'>\nHow do change the number of columns in the layout?\n</h4>\n<p>\n<p>In general settings, you can find thumbnail column options which could depend on the device screen size. You can define different gallery column amounts for different resolutions.</p>\n</p>\n<dt id='how%20to%20enable%20swipe%20mode%20for%20a%20lightbox%3F'>\nHow to enable swipe mode for a lightbox?\n</h4>\n<p>\n<p>When you open settings in the list of options you can find the lightbox settings block. There are switch-on swipe options if you wish to enable this mode in the gallery lightbox.</p>\n</p>\n\n",
        "changelog": "<h4>3.2.21</h4>\n<ul>\n<li>Compatibility with WordPress 6.6</li>\n</ul>\n<h4>3.2.20</h4>\n<ul>\n<li>Modification of the general core settings, fixes of the name and image title issues</li>\n</ul>\n<h4>3.2.19</h4>\n<ul>\n<li>Compatibility with WordPress 6.5</li>\n<li>Compatibility with PHP 8+</li>\n<li>Modification of permissions for media manager photos</li>\n</ul>\n<h4>3.2.18</h4>\n<ul>\n<li>Fixed images media manager fields, tags for different resources types</li>\n</ul>\n<h4>3.2.17</h4>\n<ul>\n<li>Compatibility with WordPress 6.4</li>\n</ul>\n<h4>3.2.16</h4>\n<ul>\n<li>Fix of the youtube key field</li>\n<li>Update of the youtube functionality</li>\n<li>Compatibility with WordPress 6.3</li>\n</ul>\n<h4>3.2.15</h4>\n<ul>\n<li>Compatibility with WordPress 6.2</li>\n</ul>\n<h4>3.2.14</h4>\n<ul>\n<li>Modify the plugin structure</li>\n<li>Changed paths of the plugin add-ons</li>\n</ul>\n<h4>3.2.13</h4>\n<ul>\n<li>Fixed the shortcodes</li>\n<li>Modification of the output workflow</li>\n</ul>\n<h4>3.2.12</h4>\n<ul>\n<li>Added new security check</li>\n<li>Fix the admin section links for the clone option</li>\n</ul>\n<h4>3.2.11</h4>\n<ul>\n<li>Fix links issues, fixed link button</li>\n<li>Security fix</li>\n</ul>\n<h4>3.2.9</h4>\n<ul>\n<li>Modification of the hover functionality, links, buttons</li>\n</ul>\n<h4>3.2.5</h4>\n<ul>\n<li>Fix the compatibility settings of the plugin</li>\n<li>Admin section modification </li>\n<li>Compatibility with WordPress 6.1</li>\n</ul>\n<h4>3.2.4</h4>\n<ul>\n<li>Update of the new gallery dialog interface</li>\n<li>Fixed popup of gallery Wizzard issues</li>\n</ul>\n<h4>3.2.3</h4>\n<ul>\n<li>Gutenberg block fix</li>\n</ul>\n<h4>3.2.2</h4>\n<ul>\n<li>Fixed Gutenberg issues, fixed search functionality</li>\n</ul>\n<h4>3.2.1</h4>\n<ul>\n<li>Fixed media manager loading issues </li>\n<li>Compatibility with WordPress 6.0</li>\n</ul>\n<h4>3.2.0</h4>\n<ul>\n<li>Fixed drag and drop issue </li>\n<li>Added preview ordering option </li>\n<li>Fixed gallery fields compatibility</li>\n<li>Fixed issues related to PHP 7.4, PHP 7.1</li>\n<li>Fixed issues related to conflicts with PHP modules</li>\n</ul>\n<h4>3.1.8</h4>\n<ul>\n<li>Compatibility with WordPress 5.9</li>\n<li>Fixed notices in PHP 7.1 </li>\n</ul>\n<h4>3.1.7</h4>\n<ul>\n<li>Fixed the compatibility with extensions of the PHP7+</li>\n<li>Small interface fixes</li>\n</ul>\n<h4>3.1.5</h4>\n<ul>\n<li>Fixed lightbox right-click content protection fix</li>\n<li>Added duplicate post option</li>\n<li>Added new draft option</li>\n</ul>\n<h4>3.1.4</h4>\n<ul>\n<li>Right-click protection for the gallery and lightbox</li>\n<li>Fix the PHP warnings</li>\n<li>Plugin admin section modifications and fixes</li>\n</ul>\n<h4>3.1.3</h4>\n<ul>\n<li>Small interface fixes, tested on 5.8.2</li>\n</ul>\n<h4>3.1.2</h4>\n<ul>\n<li>Fix for the masonry and mosaic layouts</li>\n</ul>\n<h4>3.1.1</h4>\n<ul>\n<li>Added demos showcase with links in dialog and dashboard</li>\n<li>Modification and small fixes for the new wizard</li>\n<li>Fixed settings type block</li>\n</ul>\n<h4>3.0.10</h4>\n<ul>\n<li>Compatibility with PHP 8</li>\n<li>Fix the lazy load function</li>\n<li>Fix notices in the admin section</li>\n</ul>\n<h4>3.0.9</h4>\n<ul>\n<li>Compatibility with WordPress 5.8</li>\n</ul>\n<h4>3.0.8</h4>\n<ul>\n<li>Fixed new dialog problem</li>\n<li>Fixed styles issues in the admin section</li>\n<li>Fixed load more conflict with multiple items</li>\n</ul>\n<h4>3.0.7</h4>\n<ul>\n<li>Fix the gallery version</li>\n</ul>\n<h4>3.0.6</h4>\n<ul>\n<li>New free image slider theme</li>\n<li>Added clone function to masonry, mosaic, youtube, and polaroid types</li>\n<li>Fix the link and buttons in the masonry</li>\n<li>Fix the alignment </li>\n<li>Fix the new dialog interface</li>\n<li>Fix menu and categories</li>\n<li>Fix the search text management</li>\n</ul>\n<h4>3.0.5</h4>\n<ul>\n<li>Tested up to WordPress 5.7 version</li>\n<li>Fixed a few mosaic and wall-style themes</li>\n</ul>\n<h4>3.0.4</h4>\n<ul>\n<li>Fix links modes and clickable thumbnails option</li>\n<li>Fix mobile links and clicks</li>\n</ul>\n<h4>3.0.3</h4>\n<ul>\n<li>Fix links buttons in mosaic, masonry, polaroid and grid</li>\n<li>Fix alignment</li>\n<li>Fix compatibility with the old PHP version</li>\n</ul>\n<h4>3.0.2</h4>\n<ul>\n<li>Fix clone values list</li>\n<li>Fix image ordering</li>\n<li>Fix Yoast compatibility</li>\n<li>Fix the compatibility with the old PHP version</li>\n</ul>\n<h4>3.0.1</h4>\n<ul>\n<li>Fix the old PHP version&#8217;s support</li>\n</ul>\n<h4>3.0.0</h4>\n<ul>\n<li>New structure of the core plugin code</li>\n<li>Fixed the grey thumbnails problem in the media manager</li>\n<li>Fixed Divi notices</li>\n<li>Added a new gallery wizard with the classification of the types</li>\n<li>Added a new media manager widget with a photos preview</li>\n<li>Added free types: grid, masonry, polaroid, mosaic, youtube gallery</li>\n<li>Added new youtube integration with support of the video ids, playlists, channels</li>\n<li>Added preconfigured 6 categories with wall style, grid, masonry, mosaic, polaroid and advanced youtube feed types</li>\n<li>Added auto-configuration engine for the photo grid layout configuration</li>\n<li>Added auto-resize smart module for resizing the thumbnails for the masonry grid layout</li>\n<li>Optimized CSS and js code</li>\n<li>Prepared integrations for Instagram feed, Pinterest, Flickr, dropbox, google drive, and Facebook gallery sources for the content</li>\n<li>Tested with WordPress 5.6 version, with small fixes</li>\n</ul>\n<h4>2.8.34</h4>\n<ul>\n<li>Tested WordPress 5.5 version, fixed Gutenberg block notices</li>\n</ul>\n<h4>2.8.33</h4>\n<ul>\n<li>Tested with the latest WordPress version, optimized settings for Divi theme</li>\n</ul>\n<h4>2.8.32</h4>\n<ul>\n<li>Fix the admin section, interface fixes</li>\n</ul>\n<h4>2.8.31</h4>\n<ul>\n<li>Tested with WordPress 5.4, small code fixes</li>\n</ul>\n<h4>2.8.30</h4>\n<ul>\n<li>Cache fixing</li>\n</ul>\n<h4>2.8.29</h4>\n<ul>\n<li>Fixed media manager</li>\n</ul>\n<h4>2.8.28</h4>\n<ul>\n<li>Tested with WordPress 5.3</li>\n</ul>\n<h4>2.8.27</h4>\n<ul>\n<li>Abspath fix in plugin paths</li>\n</ul>\n<h4>2.8.26</h4>\n<ul>\n<li>Fixed small bugs, and added new code structures</li>\n</ul>\n<h4>2.8.25</h4>\n<ul>\n<li>Modification of the configuration fields, fix of the shortcode</li>\n</ul>\n<h4>2.8.24</h4>\n<ul>\n<li>Fixed Elementor editor conflict in image widget mode</li>\n<li>Prepared Elementor page builder block </li>\n<li>Tested with WordPress 5.2</li>\n</ul>\n<h4>2.8.23</h4>\n<ul>\n<li>Fix the media manager resources upload, additional file type check</li>\n</ul>\n<h4>2.8.22</h4>\n<ul>\n<li>Fix the Gutenberg block and lightbox code</li>\n</ul>\n<h4>2.8.21</h4>\n<ul>\n<li>Modification of the hover zoom and link buttons styles</li>\n</ul>\n<h4>2.8.20</h4>\n<ul>\n<li>Fix the hover elements position, fixed styles of the menu</li>\n</ul>\n<h4>2.8.19</h4>\n<ul>\n<li>Modification of the translation elements</li>\n<li>Fixed small issues in the editor</li>\n</ul>\n<h4>2.8.18</h4>\n<ul>\n<li>Fix the Gutenberg editor, Gutenberg optimization</li>\n</ul>\n<h4>2.8.17</h4>\n<ul>\n<li>Fix the Gutenberg editor id value problem</li>\n<li>Modification of the self-images functionality</li>\n<li>Added new Images of the Current item field logic</li>\n</ul>\n<h4>2.8.16</h4>\n<ul>\n<li>Fix the Gutenberg block for the old Gutenberg version compatibility</li>\n</ul>\n<h4>2.8.15</h4>\n<ul>\n<li>Added Gutenberg editor support</li>\n<li>Added Gutenberg block</li>\n<li>Small code fixes</li>\n</ul>\n<h4>2.8.14</h4>\n<ul>\n<li>Fixed lightbox background transparency issue</li>\n<li>Compatibility with WordPress 5.0</li>\n</ul>\n<h4>2.8.13</h4>\n<ul>\n<li>Fixed notices and optimization of the admin interface</li>\n</ul>\n<h4>2.8.12</h4>\n<ul>\n<li>Added new template tag for video link</li>\n<li>Modification of the general CSS styles structure</li>\n<li>Added a new custom CSS field where you can add modifications for every item</li>\n<li>Added new global custom CSS for the entire plugin</li>\n<li>Added new global custom js for the entire plugin</li>\n<li>Smart parser for the front end includes</li>\n</ul>\n<h4>2.8.11</h4>\n<ul>\n<li>Added check of the no images and notification</li>\n<li>Update default settings in the admin section</li>\n<li>Plugin tested in Gutenberg</li>\n<li>Modification of the menu settings</li>\n<li>Modification of the zoom button settings</li>\n<li>Updated default menu views</li>\n<li>Updated default hover views</li>\n<li>Added check of the no images and notification</li>\n</ul>\n<h4>2.8.10</h4>\n<ul>\n<li>Update spacing options and hover effect</li>\n</ul>\n<h4>2.8.9</h4>\n<ul>\n<li>Optimization of the admin interface options</li>\n</ul>\n<h4>2.8.8</h4>\n<ul>\n<li>Fixed pixelated or blurred images in thumbnails</li>\n<li>Enabled source option for the all free users</li>\n</ul>\n<h4>2.8.7</h4>\n<ul>\n<li>Updated admin section image quality options</li>\n</ul>\n<h4>2.8.6</h4>\n<ul>\n<li>Fix for the dashboard redirect function</li>\n<li>Fix the lightbox background transparency</li>\n</ul>\n<h4>2.8.4</h4>\n<ul>\n<li>Update backend interface, added overview section</li>\n<li>Fixed some js conflicts</li>\n<li>Fixed images manager button </li>\n</ul>\n<h4>2.8.3</h4>\n<ul>\n<li>Update image widget add-on</li>\n<li>Modify add-ons installation</li>\n<li>Update images manager</li>\n<li>Small fixes to the interface</li>\n</ul>\n<h4>2.8.2</h4>\n<ul>\n<li>Added a new image gallery widget to the add-ons section</li>\n</ul>\n<h4>2.8.1</h4>\n<ul>\n<li>Fix the path problem in a new version, including WordPress.com users </li>\n</ul>\n<h4>2.8.0</h4>\n<ul>\n<li>fix of the backup notices</li>\n<li>fix of the export backup function</li>\n<li>Global modification of plugin structure, new add-ons section</li>\n<li>New backup add-on </li>\n<li>New statistics add-on  </li>\n</ul>\n<h4>2.7.14</h4>\n<ul>\n<li>fix of the image manager additional fields values validation</li>\n</ul>\n<h4>2.7.13</h4>\n<ul>\n<li>fixed the outdated code elements, and modified the general structure of some interface elements</li>\n</ul>\n<h4>2.7.12</h4>\n<ul>\n<li>fixed swipe inverted direction, add a new option for swipe direction switch to the left or to the right</li>\n</ul>\n<h4>2.7.11</h4>\n<ul>\n<li>Fix the old PHP version support, white screen problem fix</li>\n</ul>\n<h4>2.7.10</h4>\n<ul>\n<li>Changed navigation in the admin section</li>\n</ul>\n<h4>2.7.9</h4>\n<ul>\n<li>Fix the notifications</li>\n</ul>\n<h4>2.7.8</h4>\n<ul>\n<li>Updated interface icons and CSS fixes</li>\n</ul>\n<h4>2.7.7</h4>\n<ul>\n<li>Updated cache functionality</li>\n<li>Added cache expiration option</li>\n</ul>\n<h4>2.7.6</h4>\n<ul>\n<li>Added copy shortcode by clicking on listing</li>\n<li>Added sorting confirmation message</li>\n</ul>\n<h4>2.7.5</h4>\n<ul>\n<li>fix of the notices</li>\n</ul>\n<h4>2.7.3</h4>\n<ul>\n<li>New ajax preload module</li>\n<li>Notification init fix</li>\n<li>Fix for automatic js error detection and fix the system</li>\n</ul>\n<h4>2.7.2</h4>\n<ul>\n<li>New advanced, automatic js error detection and fixing system</li>\n</ul>\n<h4>2.7.1</h4>\n<ul>\n<li>New advanced categories sorting section</li>\n</ul>\n<h4>2.7.0</h4>\n<ul>\n<li>New super cache function</li>\n</ul>\n<h4>2.6.22</h4>\n<ul>\n<li>Update the ordering page</li>\n</ul>\n<h4>2.6.21</h4>\n<ul>\n<li>Advanced sorting options, new sorting management options</li>\n</ul>\n<h4>2.6.20</h4>\n<ul>\n<li>Update of the settings block</li>\n<li>Change interface code structure, added new tabs</li>\n</ul>\n<h4>2.6.19</h4>\n<ul>\n<li>Fixed multiple issues with interface conflicts</li>\n</ul>\n<h4>2.6.18</h4>\n<ul>\n<li>Video short links support for Youtube</li>\n</ul>\n<h4>2.6.17</h4>\n<ul>\n<li>Update admin settings</li>\n<li>Added new search options</li>\n<li>Search background color</li>\n</ul>\n<h4>2.6.16</h4>\n<ul>\n<li>Extend languages support</li>\n<li>Update of the statistics features</li>\n</ul>\n<h4>2.6.15</h4>\n<ul>\n<li>Modification of the admin interface</li>\n<li>Changed notification mode in the settings section</li>\n</ul>\n<h4>2.6.14</h4>\n<ul>\n<li>Fixed conflict with another plugin</li>\n<li>Fixed media manager conflict</li>\n</ul>\n<h4>2.6.13</h4>\n<ul>\n<li>Update of the statistics section in the backend</li>\n<li>Small statistics fixes</li>\n</ul>\n<h4>2.6.12</h4>\n<ul>\n<li>Fix the admin interface </li>\n<li>Updated category management dialog</li>\n</ul>\n<h4>2.6.11</h4>\n<ul>\n<li>Update of the language functionality</li>\n<li>Multi-language support</li>\n</ul>\n<h4>2.6.10</h4>\n<ul>\n<li>Modification of the interface in the admin section</li>\n<li>Modification of the zip library</li>\n</ul>\n<h4>2.6.9</h4>\n<ul>\n<li>Added a new archiver library for an alternative backup method</li>\n<li>Backup algorithm optimized</li>\n</ul>\n<h4>2.6.8</h4>\n<ul>\n<li>Front-end SEO code optimization, changed alt in lightbox functionality</li>\n</ul>\n<h4>2.6.7</h4>\n<ul>\n<li>Code fixes and optimization of some functionality implementation</li>\n</ul>\n<h4>2.6.6</h4>\n<ul>\n<li>Updated hover mode for thumbnails on mobile devices</li>\n</ul>\n<h4>2.6.5</h4>\n<ul>\n<li>Added new search field label customization option</li>\n<li>Optimization of the admin interface options</li>\n</ul>\n<h4>2.6.4</h4>\n<ul>\n<li>Changed galleries management algorithm</li>\n<li>Added additional galleries checks</li>\n</ul>\n<h4>2.6.3</h4>\n<ul>\n<li>New front-end search functionality</li>\n<li>Added search field in the top menu block</li>\n<li>Search result load without page reload</li>\n</ul>\n<h4>2.6.2</h4>\n<ul>\n<li>New function for clone function configuration</li>\n<li>Show/hide option for clone block in settings</li>\n</ul>\n<h4>2.6.1</h4>\n<ul>\n<li>Updated widget</li>\n<li>Added new latest  option in the list</li>\n</ul>\n<h4>2.6.0</h4>\n<ul>\n<li>Fixed PHP Compatibility Checker warnings</li>\n</ul>\n<h4>2.5.9</h4>\n<ul>\n<li>Update of the backup algorithm, new full backup method</li>\n<li>Changes in a backend data configuration </li>\n</ul>\n<h4>2.5.8</h4>\n<ul>\n<li>Fix the JS code</li>\n</ul>\n<h4>2.5.7</h4>\n<ul>\n<li>Optimization of the code structure</li>\n<li>Combining of the CSS files </li>\n</ul>\n<h4>2.5.6</h4>\n<ul>\n<li>Optimization of the code structure</li>\n<li>Combining of the JS files </li>\n</ul>\n<h4>2.5.5</h4>\n<ul>\n<li>Added new tags ordering option</li>\n<li>Added ordering modes No ordering, Alphabetical ASC, Alphabetical desc  </li>\n</ul>\n<h4>2.5.4</h4>\n<ul>\n<li>Fix for Facebook sharing images function </li>\n</ul>\n<h4>2.5.3</h4>\n<ul>\n<li>Fixed Facebook sharing in the case of special symbols conflict </li>\n<li>Added VK social sharing option</li>\n<li>Added switch to turn on/off every social source separately</li>\n</ul>\n<h4>2.5.2</h4>\n<ul>\n<li>Fixed conflict of the lightbox counter label with the old version</li>\n</ul>\n<h4>2.5.1</h4>\n<ul>\n<li>Fixed quote parsing in image description and caption fields</li>\n</ul>\n<h4>2.5.0</h4>\n<ul>\n<li>Lightbox interface update</li>\n<li>Added new lightbox counter template field</li>\n</ul>\n<h4>2.4.9</h4>\n<ul>\n<li>Fixed link function, preload for the link function is disabled</li>\n</ul>\n<h4>2.4.8</h4>\n<ul>\n<li>Updated statistics and fixed reset statistic function</li>\n<li>Updated description of the plugin, explanation of the life cases</li>\n</ul>\n<h4>2.4.7</h4>\n<ul>\n<li>Updated font options</li>\n<li>Added new awesome font load modes</li>\n<li>Updated awesome font load process to avoid conflicts</li>\n<li>Code cleaning, removed/replaced old libs</li>\n<li>Plugin code structure optimization</li>\n</ul>\n<h4>2.4.6</h4>\n<ul>\n<li>Fixed link option</li>\n<li>Fixed default output after installation event</li>\n</ul>\n<h4>2.4.5</h4>\n<ul>\n<li>Fixed express panel publishing issues, per users requests</li>\n<li>Added show/hide option for express panel</li>\n<li>Turned off the express panel by default</li>\n</ul>\n<h4>2.4.4</h4>\n<ul>\n<li>Fixed tag error in plugin source to avoid warning</li>\n</ul>\n<h4>2.4.3</h4>\n<ul>\n<li>Added new Express Panel for fast settings save</li>\n<li>Scroll effect for Express Panel</li>\n</ul>\n<h4>2.4.2</h4>\n<ul>\n<li>Updated statistics, added a new reset button</li>\n<li>Small code fixes</li>\n</ul>\n"
    },
    "short_description": "Rbs Image Gallery is an advanced responsive photo gallery plugin. Flexible gallery images management tools. Links, videos, slider and gallery lightbox &hellip;",
    "description": "<p>Gallery on your website it&#8217;s really attractive and a very important part of your pages. If you looking for a fast, easy plugin with a simple and very beautiful, highly customizable design <a href=\"https://www.robogallery.co/gallery-showcase/\" rel=\"nofollow ugc\">ALL DEMOS YOU CAN FIND HERE</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/7ejiww-ekHE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>With our plugin, even newbies in WordPress will be able to create their first gallery in a few minutes and at the same time WordPress professionals get advanced tools and freedom of creativity. Just download this plugin and you&#8217;ll not look for any other plugin anymore! <a href=\"https://www.robogallery.co/gallery-showcase/\" rel=\"nofollow ugc\">Gallery Showcase with the previews of all views</a></p>\n<blockquote>\n<h4>Demos</h4>\n<p><a href=\"https://www.robogallery.co/gallery-showcase/\" rel=\"nofollow ugc\">All Gallery Demos</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/portfolio-gallery/\" rel=\"nofollow ugc\">Portfolio Gallery</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/hashtags/\" rel=\"nofollow ugc\">Hash Tags</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/masonry-gallery/\" rel=\"nofollow ugc\">Masonry Gallery</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/youtube-video-gallery/\" rel=\"nofollow ugc\">Youtube Video</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/blog-style-gallery/\" rel=\"nofollow ugc\">Blog Style</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/vimeo-video-gallery/\" rel=\"nofollow ugc\">Vimeo Video</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/cars-gallery-demo/\" rel=\"nofollow ugc\">Multi Categories Cars Demo</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/custom-layout/\" rel=\"nofollow ugc\">Grid Layout Demo with Fade hover effect</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/gallery-demo-movie/\" rel=\"nofollow ugc\">Multi Categories Polaroid style Movie Demo with classic layout</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/gallery-design/\" rel=\"nofollow ugc\">Design Sketch Demo with grid layout</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/push-effect-demo/\" rel=\"nofollow ugc\">Multi Categories Demo with custom interface colors and classic layout</a></p>\n<p><a href=\"https://robogallery.co/demo/gallery/design-video-gallery/\" rel=\"nofollow ugc\">Video Demo with grid layout</a></p>\n</blockquote>\n<h4>Key Features</h4>\n<ul>\n<li><strong>No Right click / Content protection</strong> &#8211;  in Robo gallery possible to disable right click to prevent copying of the gallery content.  Content copy protection is very important for every photographer&#8217;s portfolio photos.</li>\n<li><strong>Lightbox no right-click / Content protection</strong> &#8211;  in Robo gallery possible to disable right-click to prevent copying of the gallery lightbox content.  Content copy protection is very important for every photographer&#8217;s portfolio photos.</li>\n<li><strong>One click setup</strong> &#8211; implemented one-click wizard with the 5 types: image grid, mosaic, masonry, polaroid, and youtube gallery.</li>\n<li><strong>No limits</strong> &#8211; no limits for the number of instances with 5 free types: photo grid, mosaic, masonry, polaroid, and youtube grid.</li>\n<li><strong>No limits for images/photos</strong> &#8211; no limits for the number of images/photos in every album.</li>\n<li><strong>Gutenberg block</strong> &#8211; implemented Gutenberg gallery block for simple and fast configuration of the plugin in Gutenberg editor.</li>\n<li><strong>Fully responsive and Mobile features</strong> &#8211; plugin implemented with advanced settings for different devices&#8217; screen sizes.</li>\n<li><strong>Fade effects</strong> &#8211; one of the hover animations it&#8217;s a classic fade effect. </li>\n<li><strong>Batch images upload</strong> &#8211; advanced media manager which allows uploading batch of images with one click. Just drag and drop a set of the gallery images and it&#8217;s uploaded automatically to the server.</li>\n<li><strong>Auto-resizing for thumbnails and images</strong> &#8211; media manager allow you to make additional customization of the images, rotary, flip, crop, and manually resize.</li>\n<li><strong>Customizable 15 hover effects</strong> &#8211; all hover effects work in cooperation with interface configuration options. You can easily change the style and colors of the hover animation elements.</li>\n<li><strong>Implemented to avoid AJAX libs conflicts</strong> &#8211; code implemented in native WordPress style as a result our plugin doesn&#8217;t have any conflicts and works really stable.</li>\n<li><strong>Polaroid gallery</strong> &#8211; with our plugin you can create a Polaroid layout just with a few clicks.</li>\n<li><strong>Advanced Polaroid Styles</strong> &#8211; Polaroid styles are implemented with advanced functionality. Implemented left, right and center image titles alignment. Polaroid description panel of the image&#8217;s background color selector. </li>\n<li><strong>Build in colors selector</strong> &#8211; you can easily change the color of any interface element.</li>\n<li><strong>Social sharing</strong> &#8211; gallery lightbox supports social sharing on Twitter, Facebook, google plus and Pinterest.</li>\n<li><strong>Build in borders and shadows settings</strong> &#8211; borders and shadows have advanced options for configuration design and style of this gallery interface elements.</li>\n<li><strong>Font settings</strong> &#8211; build in advanced text style editor options. With these options, you can fully customize the title, caption, and description of every image</li>\n<li><strong>Different resolutions</strong> &#8211; implemented advanced size control options where you can define layout or fixed size for the interface elements on different screen resolutions</li>\n<li><strong>Implemented in native WordPress style using native classes</strong> &#8211; native for WordPress implemented without any hacks and tricks</li>\n<li><strong>Multi Categories</strong> &#8211; multi categories albums support. You can create your own galleries tree, depending on your needs</li>\n<li><strong>Classic layout</strong> &#8211; layout could have a classic style or grid layout, and every item on the page could have its own styles and settings</li>\n<li><strong>Advanced pagination function</strong> &#8211; pagination function implemented in google load more style</li>\n<li><strong>Work in IE, Firefox, Safari, Opera, Chrome</strong> &#8211; work properly in all the latest versions of the popular browsers</li>\n<li><strong>Lazy loading option</strong> &#8211; implemented advanced lazy loading options, for the case when you have big sets of images you can define the amount of the galleries images for the first load and for the next steps of the load more options</li>\n<li><strong>Advanced cache options</strong> &#8211; implemented advanced images caching options</li>\n<li><strong>Overlay effects</strong> &#8211; all hover effects of the thumbnails are highly customizable and have a full set of options</li>\n<li><strong>Backend text settings preview</strong> &#8211; all images titles, captions, and descriptions are highly customizable also we have a life preview of the changes in the backend</li>\n<li><strong>Resizing crop function</strong> &#8211; in media managed you&#8217;ll find a great set of very useful features for example images crop, and manual resizing</li>\n<li><strong>Optional mobile touch support</strong> &#8211; our plugin supports mobile devices and you can customize responsive gallery layout settings for different screen sizes</li>\n<li><strong>Custom ordering of the images</strong> &#8211; ordering for all images  could be easily changed manually in the media manager or you can find order by options in general settings</li>\n<li><strong>Ability to insert plugin to the WordPress post, page, widget</strong> &#8211; every item could be inserted in to post, page or widget with a build shortcode tag or using a wizard button &#8211; shortcode generator in post or page editor</li>\n<li><strong>Lightbox social buttons</strong> &#8211; in plugin settings you can turn on/off social buttons</li>\n<li><strong>Lightbox background color</strong> &#8211; in lightbox settings you can change the color of the background with a comfortable color selector</li>\n<li><strong>Lightbox background transparency</strong> &#8211; in lightbox settings you can change the transparency of the background with a comfortable color selector</li>\n<li><strong>Lightbox font color</strong> &#8211; in lightbox settings you can change the color of the font with a comfortable color selector</li>\n<li><strong>Lightbox font transparency</strong> &#8211; in lightbox settings you can change the transparency of the font with a comfortable color selector</li>\n<li><strong>Advanced Compatibility</strong> &#8211;  implement advanced compatibility options to avoid conflict with libraries of other plugins and themes. You can switch between modes to find the proper value for your case.</li>\n<li><strong>Advanced Social Sharing</strong> &#8211;  advanced social sharing functionality in a lightbox. Implemented deep linking functionality for the images social sharing services Facebook, Twitter, Pinterest, Google+, VK</li>\n<li><strong>Click Thumbnails</strong> &#8211; advanced click functionality. You can use click-on buttons or on the gallery thumbnails to enlarge images or open the image link.  With the new functionality, you can combine absolutely different features of the clicking functionality.</li>\n<li><strong>Alignment</strong> &#8211; alignment of the photo gallery in the post or page depends on your needs. You don&#8217;t need to use HTML tags or some CSS tricks this function gonna help you to align your image gallery the way you need. Possible to select one from implemented alignment modes: left, right, and center for image alignment inside post or page content.</li>\n<li><strong>Padding</strong> &#8211; new padding options. Define custom values in pixels for padding thumbnails block in post or page content. Is it possible to define padding from the left, right, top and bottom side</li>\n<li><strong>Post Generator</strong> &#8211; new function for the automatic post creation with a gallery tag inside it. Advanced post manager implemented with additional functions for customization and management of all your posts in one place.</li>\n<li><strong>Description Panel</strong> &#8211; new image description panel in a lightbox with a few different themes. The settings section makes you able to change content panel theme styles. In the description panel, you can define a few content sources. Image title, image caption or image description.</li>\n<li><strong>Swipe in Lightbox</strong> &#8211; lightbox supports the swipe effect on multiple mobile devices. Swipe properly work in the lightbox for all images. Tested for Android and iOS.</li>\n<li><strong>Advanced Link Button Design</strong> &#8211; front end interface have link button. This button provides linking functionality on every thumbnail.<br />\nThis interface button has a wide range of front-end interface customization options. You can easily change this button color, border and icon.</li>\n<li><strong>Hover Description Template</strong> &#8211; every image contain description field. In additional parameters of the image hover, you can define some HTML tags or build-in tags for customization of the image description.</li>\n<li><strong>Plugin Compatibility Settings</strong> &#8211; in plugin settings you can customize general plugin settings to avoid conflicts with other plugins or WordPress themes.</li>\n<li><strong>Admin Interface Modes</strong> &#8211; in plugin settings you can customize plugin interface settings to avoid conflicts with another plugin.</li>\n<li><strong>Video Links</strong> &#8211; in the media manager every image have a separate option for a video link. Video links could be specified to the youtube feed or Vimeo.</li>\n<li><strong>Images Custom Ratio</strong> &#8211; in plugin settings you can define a custom ratio for every picture. Every gallery could have personal settings for this option.</li>\n<li><strong>Thumbnails Fade Effect</strong> &#8211; implemented Fade effect for the hover of the photo thumbnails. With such a hover animation effect become more attractive and eye-catching.</li>\n<li><strong>Advanced Load more function</strong> &#8211; implemented very attractive navigation mode. Auto pre-loading images like an endless list of images. Load more functions have a lot of customization options to make it work the way you need.</li>\n<li><strong>SEO code optimization</strong> &#8211; implemented a few front-end code output modes. One simplified mode with all core front-end code elements and another mode with additional not visible elements. This option has additional modes. These SEO output modes give you default output mode, thumbnail, and thumbnail+links mode.</li>\n<li><strong>Template</strong> &#8211; in our plugin, we have an advanced template engine for images description. Every hover text of the image could be edited and customized with built-in template options.</li>\n<li><strong>Cache</strong> &#8211; incredible new super cache option makes your page load ten times faster. This function use absolutely new model of the image load. When you enable cache for big-size galleries it&#8217;s gonna be much faster and more effective to use our plugin. Your visitors will be really surprised by the speed of the page load.</li>\n<li><strong>Support Videos</strong> &#8211; every image has an option where possible to define a video link for every particular picture.</li>\n<li><strong>Elementor Block</strong> &#8211; in the Elementor page builder you can use the built-in Elementor block in our plugin.</li>\n<li><strong>Slider</strong> &#8211; possible to create an image slider with mobile-friendly interface and support touchscreen devices. In slideshow mode, you can upload photos to the image slideshow and configure different interface elements to navigate between slides. Possible to create an unlimited amount of photo sliders with different text on the description panel. You can use a title, caption or photo description as a text source for every slide of the image slider.</li>\n</ul>\n<h4>Pro Key Features</h4>\n<ul>\n<li><strong>50+ pre-configured styles</strong> &#8211; one-click setup of the gallery with required type and theme styles. These styles are classified into 6 categories with different types of grid layouts and interface views.</li>\n<li><strong>Advanced Youtube Gallery</strong> &#8211; pre-configured 6 views for the youtube feeds mode. Every instance has a full set of design configuration controls.</li>\n<li><strong>Advanced Photo Grid Themes</strong> &#8211; pre-configured 8 views for the image grid view with additional advanced interface and layout configuration settings.</li>\n<li><strong>Advanced Masonry Themes</strong> &#8211; pre-configured 8 views for the masonry grid views with additional advanced interface and layout configuration settings. Added smart resizing mode for the resizing images automatically for the building of the masonry grid layout. </li>\n<li><strong>Advanced Mosaic Themes</strong> &#8211; pre-configured 6 views for the mosaic grid views with additional advanced interface and layout configuration settings.</li>\n<li><strong>Advanced Polaroid Themes</strong> &#8211; pre-configured 8 views for the polaroid grid views with additional advanced interface and layout configuration settings.</li>\n<li><strong>Advanced Wall Style Themes</strong> &#8211; pre-configured 8 views for the wall style grid view with additional advanced interface and layout configuration settings.</li>\n<li><strong>Advanced Menu Settings</strong> &#8211; full access to the configuration of the top grid filters and navigation buttons. With the configuration of the navigation menu styles and modes. </li>\n<li><strong>Advanced Tags Navigation</strong> &#8211; tags navigation mode for the top navigation menu.</li>\n<li><strong>Advanced Polaroid Settings</strong> &#8211; configuration of the polaroid content source and design for the description panel.</li>\n<li><strong>Advanced Size Settings</strong> &#8211; set of size options, grid spacing, column management, and mobile-friendly settings for mobile devices.</li>\n<li><strong>Advanced Lightbox Settings</strong> &#8211; customizable colors, styles and visibility of the navigation elements in the lightbox popup.</li>\n<li><strong>Advanced Hover Settings</strong> &#8211; multiply colors configuration for the overlay, buttons and all text for the additional hover elements like title, caption and description.</li>\n<li><strong>Advanced Pagination Settings</strong> &#8211; configuration of the load more function workflow. Modification of the styles and colors of the pagination interface element.</li>\n<li><strong>Advanced Layout Settings</strong> &#8211; image grid settings, different layout settings for the desktop site version and mobile devices. Android or iOS, mobile-friendly gallery layout.</li>\n<li><strong>Advanced Resizing Settings</strong> &#8211; for the masonry grid implemented a new automatic, advanced thumbnail resizing function.</li>\n<li><strong>Youtube Playlist</strong> &#8211; fast import of the youtube playlist videos in a few clicks.  </li>\n<li><strong>Youtube Channel</strong> &#8211; fast import of the youtube channel videos in a few clicks.  </li>\n<li><strong>Image Link</strong> &#8211; every image have a personal link field. You can set a different link for every image.</li>\n<li><strong>Tags for images</strong> &#8211; every image contain description field. In additional parameters of the image hover, you can define some HTML tags or build-in tags for customization of the image description.</li>\n<li><strong>Grid layout</strong> &#8211; in plugin implemented not only a classic gallery layout, but also a grid layout for the modern style with different sizes of thumbnails.</li>\n<li><strong>Smart Links</strong> &#8211; implemented smart image links and video links parsing algorithm. Implemented auto-detection links with turned-off link navigation buttons</li>\n<li><strong>Hover layout template</strong> &#8211; hover effects have a set of advanced options. For example, you can customize the layout of the hover effect with build tags</li>\n<li><strong>Customizable Grid</strong> &#8211; every image has additional options for customization of the layout of the photos, as result, you can build a fully custom gallery grid, depending on your needs. You can decide which size of the thumbnails matrix you need on your website</li>\n<li><strong>Customizable hover icons</strong> &#8211; all icons of the gallery buttons are fully customizable and every icon could be easily changed with the build icons wizard</li>\n<li><strong>Gallery widget</strong> &#8211; every item could be inserted in to post, page or widget with a build shortcode tag or using a wizard button &#8211; shortcode generator in the post or page editor</li>\n<li><strong>Clone</strong> &#8211; if you have hundreds of galleries on the website this feature is really useful for you! Clone settings of one gallery to apply it to another one. So you can copy styles of the source item to as many galleries as you need with just one click.</li>\n<li><strong>Custom Thumbnails Shadows</strong> &#8211; shadow it&#8217;s a very  &hellip;</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.21.zip",
    "upgrade_notice": {
        "3.2.21": "<p>Compatibility with WordPress 6.6</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-1.gif?rev=2176489",
            "caption": "Demo 1"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-2.gif?rev=2176489",
            "caption": "Demo 2"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-3.gif?rev=2176489",
            "caption": "Demo 3"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-4.gif?rev=2176489",
            "caption": "Demo 4"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-5.png?rev=2176489",
            "caption": "Demo 5"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-6.png?rev=2176489",
            "caption": "Demo 6"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-7.png?rev=2176489",
            "caption": "Demo 7"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-8.png?rev=2176489",
            "caption": "Demo 8"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-9.png?rev=2176489",
            "caption": "Demo 9"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-10.png?rev=2176489",
            "caption": "Demo 10"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-11.png?rev=2176489",
            "caption": "Demo 11"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-12.png?rev=2176489",
            "caption": "Demo 12"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-13.png?rev=2176489",
            "caption": "General and size settings"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-14.png?rev=2176489",
            "caption": "Layout settings"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-15.png?rev=2176489",
            "caption": "Shadow and border settings"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-16.png?rev=2176489",
            "caption": "Hover and menu settings"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-17.png?rev=2176489",
            "caption": "Loading and Polaroid settings"
        },
        {
            "src": "https://ps.w.org/robo-gallery/assets/screenshot-18.png?rev=2176489",
            "caption": "Buttons settings"
        }
    ],
    "tags": {
        "gallery": "gallery",
        "image-gallery": "image gallery",
        "photo-gallery": "photo gallery",
        "responsive-gallery": "responsive gallery",
        "wordpress-gallery-plugin": "wordpress gallery plugin"
    },
    "stable_tag": "3.2.21",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/robo-gallery.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/robo-gallery.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/robo-gallery.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/robo-gallery.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/robo-gallery.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/robo-gallery.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/robo-gallery.1.0.6.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/robo-gallery.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/robo-gallery.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/robo-gallery.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/robo-gallery.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/robo-gallery.1.1.5.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/robo-gallery.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/robo-gallery.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/robo-gallery.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/robo-gallery.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/robo-gallery.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/robo-gallery.1.2.5.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/robo-gallery.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/robo-gallery.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/robo-gallery.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/robo-gallery.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/robo-gallery.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/robo-gallery.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/robo-gallery.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/robo-gallery.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/robo-gallery.1.3.8.zip",
        "1.3.9": "https://downloads.wordpress.org/plugin/robo-gallery.1.3.9.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/robo-gallery.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/robo-gallery.1.4.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/robo-gallery.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/robo-gallery.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/robo-gallery.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/robo-gallery.1.4.5.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/robo-gallery.1.4.6.zip",
        "1.4.7": "https://downloads.wordpress.org/plugin/robo-gallery.1.4.7.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/robo-gallery.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/robo-gallery.1.5.1.zip",
        "1.5.10": "https://downloads.wordpress.org/plugin/robo-gallery.1.5.10.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/robo-gallery.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/robo-gallery.1.5.3.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/robo-gallery.1.5.4.zip",
        "1.5.5": "https://downloads.wordpress.org/plugin/robo-gallery.1.5.5.zip",
        "1.5.6": "https://downloads.wordpress.org/plugin/robo-gallery.1.5.6.zip",
        "1.5.7": "https://downloads.wordpress.org/plugin/robo-gallery.1.5.7.zip",
        "1.5.8": "https://downloads.wordpress.org/plugin/robo-gallery.1.5.8.zip",
        "1.5.9": "https://downloads.wordpress.org/plugin/robo-gallery.1.5.9.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/robo-gallery.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/robo-gallery.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/robo-gallery.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/robo-gallery.1.6.3.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/robo-gallery.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/robo-gallery.1.6.5.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/robo-gallery.1.6.6.zip",
        "1.6.7": "https://downloads.wordpress.org/plugin/robo-gallery.1.6.7.zip",
        "1.6.8": "https://downloads.wordpress.org/plugin/robo-gallery.1.6.8.zip",
        "1.6.9": "https://downloads.wordpress.org/plugin/robo-gallery.1.6.9.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.0.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.1.zip",
        "1.7.10": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.10.zip",
        "1.7.11": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.11.zip",
        "1.7.12": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.12.zip",
        "1.7.13": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.13.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.2.zip",
        "1.7.3": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.3.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.4.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.5.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.6.zip",
        "1.7.7": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.7.zip",
        "1.7.8": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.8.zip",
        "1.7.9": "https://downloads.wordpress.org/plugin/robo-gallery.1.7.9.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/robo-gallery.1.8.0.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/robo-gallery.1.8.1.zip",
        "1.8.2": "https://downloads.wordpress.org/plugin/robo-gallery.1.8.2.zip",
        "1.8.3": "https://downloads.wordpress.org/plugin/robo-gallery.1.8.3.zip",
        "1.8.4": "https://downloads.wordpress.org/plugin/robo-gallery.1.8.4.zip",
        "1.8.5": "https://downloads.wordpress.org/plugin/robo-gallery.1.8.5.zip",
        "1.8.6": "https://downloads.wordpress.org/plugin/robo-gallery.1.8.6.zip",
        "1.8.7": "https://downloads.wordpress.org/plugin/robo-gallery.1.8.7.zip",
        "1.8.8": "https://downloads.wordpress.org/plugin/robo-gallery.1.8.8.zip",
        "1.8.9": "https://downloads.wordpress.org/plugin/robo-gallery.1.8.9.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.0.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.1.zip",
        "1.9.10": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.10.zip",
        "1.9.11": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.11.zip",
        "1.9.12": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.12.zip",
        "1.9.13": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.13.zip",
        "1.9.14": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.14.zip",
        "1.9.15": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.15.zip",
        "1.9.16": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.16.zip",
        "1.9.2": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.2.zip",
        "1.9.3": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.3.zip",
        "1.9.4": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.4.zip",
        "1.9.5": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.5.zip",
        "1.9.6": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.6.zip",
        "1.9.7": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.7.zip",
        "1.9.8": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.8.zip",
        "1.9.9": "https://downloads.wordpress.org/plugin/robo-gallery.1.9.9.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.1.zip",
        "2.0.10": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.10.zip",
        "2.0.11": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.11.zip",
        "2.0.12": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.12.zip",
        "2.0.13": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.13.zip",
        "2.0.14": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.14.zip",
        "2.0.15": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.15.zip",
        "2.0.16": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.16.zip",
        "2.0.17": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.17.zip",
        "2.0.18": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.18.zip",
        "2.0.19": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.19.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.2.zip",
        "2.0.20": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.20.zip",
        "2.0.21": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.21.zip",
        "2.0.22": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.22.zip",
        "2.0.23": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.23.zip",
        "2.0.24": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.24.zip",
        "2.0.25": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.25.zip",
        "2.0.26": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.26.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.3.zip",
        "2.0.30": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.30.zip",
        "2.0.31": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.31.zip",
        "2.0.32": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.32.zip",
        "2.0.33": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.33.zip",
        "2.0.34": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.34.zip",
        "2.0.35": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.35.zip",
        "2.0.36": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.36.zip",
        "2.0.37": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.37.zip",
        "2.0.38": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.38.zip",
        "2.0.39": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.39.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.4.zip",
        "2.0.40": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.40.zip",
        "2.0.41": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.41.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.5.zip",
        "2.0.6": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.6.zip",
        "2.0.7": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.7.zip",
        "2.0.8": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.8.zip",
        "2.0.9": "https://downloads.wordpress.org/plugin/robo-gallery.2.0.9.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/robo-gallery.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/robo-gallery.2.1.1.zip",
        "2.1.10": "https://downloads.wordpress.org/plugin/robo-gallery.2.1.10.zip",
        "2.1.11": "https://downloads.wordpress.org/plugin/robo-gallery.2.1.11.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/robo-gallery.2.1.2.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/robo-gallery.2.1.3.zip",
        "2.1.4": "https://downloads.wordpress.org/plugin/robo-gallery.2.1.4.zip",
        "2.1.5": "https://downloads.wordpress.org/plugin/robo-gallery.2.1.5.zip",
        "2.1.6": "https://downloads.wordpress.org/plugin/robo-gallery.2.1.6.zip",
        "2.1.7": "https://downloads.wordpress.org/plugin/robo-gallery.2.1.7.zip",
        "2.1.8": "https://downloads.wordpress.org/plugin/robo-gallery.2.1.8.zip",
        "2.1.9": "https://downloads.wordpress.org/plugin/robo-gallery.2.1.9.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/robo-gallery.2.2.0.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/robo-gallery.2.3.0.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/robo-gallery.2.3.1.zip",
        "2.3.2": "https://downloads.wordpress.org/plugin/robo-gallery.2.3.2.zip",
        "2.3.3": "https://downloads.wordpress.org/plugin/robo-gallery.2.3.3.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/robo-gallery.2.4.0.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/robo-gallery.2.4.1.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/robo-gallery.2.4.2.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/robo-gallery.2.4.3.zip",
        "2.4.4": "https://downloads.wordpress.org/plugin/robo-gallery.2.4.4.zip",
        "2.4.5": "https://downloads.wordpress.org/plugin/robo-gallery.2.4.5.zip",
        "2.4.6": "https://downloads.wordpress.org/plugin/robo-gallery.2.4.6.zip",
        "2.4.7": "https://downloads.wordpress.org/plugin/robo-gallery.2.4.7.zip",
        "2.4.8": "https://downloads.wordpress.org/plugin/robo-gallery.2.4.8.zip",
        "2.4.9": "https://downloads.wordpress.org/plugin/robo-gallery.2.4.9.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/robo-gallery.2.5.0.zip",
        "2.5.1": "https://downloads.wordpress.org/plugin/robo-gallery.2.5.1.zip",
        "2.5.2": "https://downloads.wordpress.org/plugin/robo-gallery.2.5.2.zip",
        "2.5.3": "https://downloads.wordpress.org/plugin/robo-gallery.2.5.3.zip",
        "2.5.4": "https://downloads.wordpress.org/plugin/robo-gallery.2.5.4.zip",
        "2.5.5": "https://downloads.wordpress.org/plugin/robo-gallery.2.5.5.zip",
        "2.5.6": "https://downloads.wordpress.org/plugin/robo-gallery.2.5.6.zip",
        "2.5.7": "https://downloads.wordpress.org/plugin/robo-gallery.2.5.7.zip",
        "2.5.8": "https://downloads.wordpress.org/plugin/robo-gallery.2.5.8.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.0.zip",
        "2.6.1": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.1.zip",
        "2.6.10": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.10.zip",
        "2.6.11": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.11.zip",
        "2.6.12": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.12.zip",
        "2.6.13": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.13.zip",
        "2.6.14": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.14.zip",
        "2.6.15": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.15.zip",
        "2.6.16": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.16.zip",
        "2.6.17": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.17.zip",
        "2.6.18": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.18.zip",
        "2.6.19": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.19.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.2.zip",
        "2.6.20": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.20.zip",
        "2.6.21": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.21.zip",
        "2.6.22": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.22.zip",
        "2.6.3": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.3.zip",
        "2.6.4": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.4.zip",
        "2.6.5": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.5.zip",
        "2.6.6": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.6.zip",
        "2.6.7": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.7.zip",
        "2.6.8": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.8.zip",
        "2.6.9": "https://downloads.wordpress.org/plugin/robo-gallery.2.6.9.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.0.zip",
        "2.7.1": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.1.zip",
        "2.7.10": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.10.zip",
        "2.7.11": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.11.zip",
        "2.7.12": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.12.zip",
        "2.7.13": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.13.zip",
        "2.7.14": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.14.zip",
        "2.7.2": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.2.zip",
        "2.7.3": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.3.zip",
        "2.7.4": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.4.zip",
        "2.7.5": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.5.zip",
        "2.7.6": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.6.zip",
        "2.7.7": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.7.zip",
        "2.7.8": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.8.zip",
        "2.7.9": "https://downloads.wordpress.org/plugin/robo-gallery.2.7.9.zip",
        "2.8.0": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.0.zip",
        "2.8.1": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.1.zip",
        "2.8.10": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.10.zip",
        "2.8.11": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.11.zip",
        "2.8.12": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.12.zip",
        "2.8.13": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.13.zip",
        "2.8.14": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.14.zip",
        "2.8.15": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.15.zip",
        "2.8.16": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.16.zip",
        "2.8.17": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.17.zip",
        "2.8.18": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.18.zip",
        "2.8.19": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.19.zip",
        "2.8.2": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.2.zip",
        "2.8.20": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.20.zip",
        "2.8.21": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.21.zip",
        "2.8.22": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.22.zip",
        "2.8.23": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.23.zip",
        "2.8.24": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.24.zip",
        "2.8.25": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.25.zip",
        "2.8.26": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.26.zip",
        "2.8.27": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.27.zip",
        "2.8.28": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.28.zip",
        "2.8.29": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.29.zip",
        "2.8.3": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.3.zip",
        "2.8.30": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.30.zip",
        "2.8.31": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.31.zip",
        "2.8.32": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.32.zip",
        "2.8.33": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.33.zip",
        "2.8.34": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.34.zip",
        "2.8.4": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.4.zip",
        "2.8.6": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.6.zip",
        "2.8.7": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.7.zip",
        "2.8.8": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.8.zip",
        "2.8.9": "https://downloads.wordpress.org/plugin/robo-gallery.2.8.9.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/robo-gallery.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/robo-gallery.3.0.1.zip",
        "3.0.10": "https://downloads.wordpress.org/plugin/robo-gallery.3.0.10.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/robo-gallery.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/robo-gallery.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/robo-gallery.3.0.4.zip",
        "3.0.5": "https://downloads.wordpress.org/plugin/robo-gallery.3.0.5.zip",
        "3.0.6": "https://downloads.wordpress.org/plugin/robo-gallery.3.0.6.zip",
        "3.0.7": "https://downloads.wordpress.org/plugin/robo-gallery.3.0.7.zip",
        "3.0.8": "https://downloads.wordpress.org/plugin/robo-gallery.3.0.8.zip",
        "3.0.9": "https://downloads.wordpress.org/plugin/robo-gallery.3.0.9.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/robo-gallery.3.1.1.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/robo-gallery.3.1.2.zip",
        "3.1.3": "https://downloads.wordpress.org/plugin/robo-gallery.3.1.3.zip",
        "3.1.4": "https://downloads.wordpress.org/plugin/robo-gallery.3.1.4.zip",
        "3.1.5": "https://downloads.wordpress.org/plugin/robo-gallery.3.1.5.zip",
        "3.1.7": "https://downloads.wordpress.org/plugin/robo-gallery.3.1.7.zip",
        "3.1.8": "https://downloads.wordpress.org/plugin/robo-gallery.3.1.8.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.1.zip",
        "3.2.11": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.11.zip",
        "3.2.12": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.12.zip",
        "3.2.13": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.13.zip",
        "3.2.14": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.14.zip",
        "3.2.15": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.15.zip",
        "3.2.16": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.16.zip",
        "3.2.17": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.17.zip",
        "3.2.18": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.18.zip",
        "3.2.19": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.19.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.2.zip",
        "3.2.20": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.20.zip",
        "3.2.21": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.21.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.3.zip",
        "3.2.4": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.4.zip",
        "3.2.5": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.5.zip",
        "3.2.9": "https://downloads.wordpress.org/plugin/robo-gallery.3.2.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/robo-gallery.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://robosoft.co/robogallery",
    "banners": {
        "low": "https://ps.w.org/robo-gallery/assets/banner-772x250.png?rev=2176511",
        "high": "https://ps.w.org/robo-gallery/assets/banner-1544x500.png?rev=2176511"
    },
    "icons": {
        "1x": "https://ps.w.org/robo-gallery/assets/icon-128x128.gif?rev=2291186",
        "2x": "https://ps.w.org/robo-gallery/assets/icon-256x256.gif?rev=2291186"
    },
    "blocks": {
        "robo/block-robo-gallery": {
            "name": "robo/block-robo-gallery",
            "title": "Image Gallery by Robo",
            "icon": "format-gallery",
            "category": "widgets",
            "editorScript": "file:./includes/extensions/block/dist/blocks.build.js",
            "description": "Photo gallery block for a simple setup of the Image Gallery",
            "keywords": [
                "images",
                "photos",
                "gallery"
            ],
            "textdomain": "robo-gallery"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 86,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "robo-gallery",
            "language": "en_GB",
            "version": "3.2.20",
            "updated": "2022-07-22 10:25:36",
            "package": "http://downloads.wordpress.org/translation/plugin/robo-gallery/3.2.20/en_GB.zip"
        },
        {
            "type": "plugin",
            "slug": "robo-gallery",
            "language": "en_CA",
            "version": "3.2.20",
            "updated": "2024-05-10 07:30:26",
            "package": "http://downloads.wordpress.org/translation/plugin/robo-gallery/3.2.20/en_CA.zip"
        },
        {
            "type": "plugin",
            "slug": "robo-gallery",
            "language": "en_AU",
            "version": "3.2.20",
            "updated": "2019-02-03 22:51:00",
            "package": "http://downloads.wordpress.org/translation/plugin/robo-gallery/3.2.20/en_AU.zip"
        },
        {
            "type": "plugin",
            "slug": "robo-gallery",
            "language": "nl_BE",
            "version": "3.2.20",
            "updated": "2023-11-01 12:59:36",
            "package": "http://downloads.wordpress.org/translation/plugin/robo-gallery/3.2.20/nl_BE.zip"
        },
        {
            "type": "plugin",
            "slug": "robo-gallery",
            "language": "ru_RU",
            "version": "3.2.20",
            "updated": "2023-04-27 06:15:26",
            "package": "http://downloads.wordpress.org/translation/plugin/robo-gallery/3.2.20/ru_RU.zip"
        }
    ]
}