{
    "name": "Sales Countdown Timer",
    "slug": "sales-countdown-timer",
    "version": "1.1.2",
    "author": "<a href=\"http://villatheme.com\">VillaTheme</a>",
    "author_profile": "https://profiles.wordpress.org/villatheme/",
    "contributors": {
        "villatheme": {
            "profile": "https://profiles.wordpress.org/villatheme/",
            "avatar": "https://secure.gravatar.com/avatar/973d0ef458adb8a3c527f196b9529909?s=96&d=monsterid&r=g",
            "display_name": "VillaTheme"
        },
        "mrt3vn": {
            "profile": "https://profiles.wordpress.org/mrt3vn/",
            "avatar": "https://secure.gravatar.com/avatar/cb8ecbc2ffe02a20ea2f5d1da26d3a22?s=96&d=monsterid&r=g",
            "display_name": "Andy Ha"
        }
    },
    "requires": "5.0",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 88,
    "ratings": {
        "5": 19,
        "4": 2,
        "3": 1,
        "2": 2,
        "1": 1
    },
    "num_ratings": 25,
    "support_url": "https://wordpress.org/support/plugin/sales-countdown-timer/",
    "support_threads": 3,
    "support_threads_resolved": 1,
    "active_installs": 6000,
    "downloaded": 118616,
    "last_updated": "2024-06-13 9:20am GMT",
    "added": "2018-07-30",
    "homepage": "https://villatheme.com/extensions/sales-countdown-timer/",
    "sections": {
        "description": "<p>WooCommerce countdown timer helps to motivate customers purchasing. Many shop owners use WooCommerce countdown timer in sale events, promotions to boost sale, improve sales and revenue. Has your site have WooCommerce countdown timer plugin yet, let’s find out the WooCommerce countdown timer plugin from VillaTheme.</p>\n<p>Sales Countdown Timer is a plugin that allows shop owners to boost the Sales in the Sale Campaigns. The plugin can display WooCommerce countdown timer any pages by shortcodes. It is a must-have plugin for encouraging customers to purchase by creating urgency psychology.</p>\n<blockquote>\n<p><a href=\"http://new2new.com/?item=sales-countdown-timer\" title=\"Demo Sales Countdown Timer\" rel=\"nofollow ugc\">Try the Demo</a> |<a href=\"http://docs.villatheme.com/?item=sales-countdown-timer\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> |<a href=\"https://1.envato.market/962d3\" title=\"Pro Version\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/eZodkhv6jD0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>FEATURES</h3>\n<p>&#9658; <strong>WooCommerce Countdown Timer</strong>: The plugin displays sales countdown timers in single product pages and the shop page of WooCommerce. The clocks will notify customers when the sales end or how many sale product quantities left. In WooCommerce single product, you can select Sales Countdown Timer settings and schedule sale campaigns.</p>\n<ul>\n<li>\n<p><strong>Select Sales Countdown Timer profile in WooCommerce single product page, variation products, and select Sales Countdown Timer for bulk products.</strong></p>\n</li>\n<li>\n<p><strong>Display countdown clock base on WooCommerce sale scheduled time</strong></p>\n</li>\n<li>\n<p><strong>Select specific sale time</strong>: WooCommerce allows you to schedule sale time by date. With Sale Countdown Timer you are able to select specific sale time by hours and minutes.</p>\n</li>\n<li>\n<p><strong>Position in single product pages</strong>: select where the countdown clock will be displayed in single product pages. There are many options for you to select: before product price, after product price, before sale flash badges, after sale flash badges, before “add to cart” button, after “add to cart” button, in the product picture.</p>\n</li>\n<li>\n<p><strong>Position in archive pages</strong>: select where will the countdown click appear in archive pages like shop page, categories pages. There are many options for you to select: before product price, after product price, before sale flash badges, after sale flash badges, before “add to cart” button, after “add to cart” button, in the product picture.</p>\n</li>\n<li>\n<p><strong>Display in shop page, categories page, related products</strong>: you have options to choose display or hide the countdown clock on these pages.</p>\n</li>\n<li>\n<p><strong>Upcoming sale message</strong>: When you schedule a sale campaign in future, you can choose to display an upcoming sale message in the single product page. The messages can be customized with a shortcode display how many time left until the sale time.</p>\n</li>\n<li>\n<p><strong>Sale ends message</strong>: display when will the sale finish message with the shortcode {countdown_timer}.</p>\n</li>\n<li>\n<p><strong>Shortcode</strong>: the shortcode {countdown_timer} will display the countdown clock.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Sale Progress bar – Stock quantity bar</strong>: The plugin displays a progress bar display how many products are available for the sale campaign, how many products are sold and how many left.</p>\n<ul>\n<li>\n<p><strong>Progress bar message</strong>: Configure the sale progress bar message as you want with shortcodes.</p>\n</li>\n<li>\n<p><strong>Shortcodes</strong>:</p>\n</li>\n</ul>\n<p>-{quantity_left} – Number of products left</p>\n<p>-{quantity_sold} – Number of products sold</p>\n<p>-{percentage_left} – Percentage of products left</p>\n<p>-{percentage_sold} – Percentage of products sold</p>\n<p>-{goal} – The goal that you set on the single product page</p>\n<ul>\n<li>\n<p><strong>Progress bar type</strong>: select to display the sale progress as increase or dicrease.</p>\n</li>\n<li>\n<p><strong>Order status</strong>: select what order status that will be counted in the progress bar.</p>\n</li>\n<li>\n<p><strong>Position</strong>: there are 2 positions for the sale progress bar above the countdown clock and below the countdown clock.</p>\n</li>\n<li>\n<p><strong>Design</strong>: configure the frontend of the progress bar with options for width, height, background color, text color and border-radius.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Shortcodes Countdown Timer</strong>:The plugin does not require WooCommerce to work. You can display countdown clocks anywhere by using shortcodes. Settings for Countdown Timer shortcode are similar with the WooCommerce Countdown Timer, the difference is that WooCommerce Countdown Timer displays WooCommerce sale time and the Countdown Timer shortcode display your chosen time.</p>\n<ul>\n<li>\n<p><strong>Display countdown timer by shortcodes</strong>.</p>\n</li>\n<li>\n<p><strong>Select countdown time in the plugin backend</strong>.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Multiple setting profiles</strong>:The plugin allows you to set up as many Countdown Timer profiles as you want. Each profile is completely a standalone Sales Countdown Timer. With each profile, you are able to set up full settings include General settings, Design settings.</p>\n<p>&#9658; <strong>Design</strong>:Feel free to design the sales countdown timer to fit with your website front-end.</p>\n<ul>\n<li>\n<p><strong>Time display</strong>: select the time separator style and time format style.</p>\n</li>\n<li>\n<p><strong>Countdown timer clock design</strong>: configure front-end style with text color, background color, border color, padding, and border-radius.</p>\n</li>\n<li>\n<p><strong>Countdown timer item design</strong>: design the items inside the countdown timer, such as date item, hour item.</p>\n</li>\n<li>\n<p><strong>Design the time value</strong>: time value includes the time number and unit. Custom it with font size, text color, and background color.</p>\n</li>\n</ul>\n<h3>PREMIUM FEATURES</h3>\n<p>All features from the free version.</p>\n<p>&#9658; <strong>Checkout countdown timer</strong>:</p>\n<ul>\n<li>\n<p><strong>Set the checkout countdown timer for a minimum cart total to get a special offer</strong>.</p>\n</li>\n<li>\n<p><strong>The reset mode will be applied only to Administrators for testing purposes</strong>.</p>\n</li>\n<li>\n<p><strong>Reset checkout countdown for a cart after this time if the customer does not place the order during checkout countdown</strong>.</p>\n</li>\n<li>\n<p><strong>Give offers before the checkout countdown timer hits zero: Free shipping and/or discount amount (percentage/fixed amount)</strong>.</p>\n</li>\n<li>\n<p><strong>Integrates options that allow you to change offers when the countdown timer hits specific values</strong>.</p>\n</li>\n<li>\n<p><strong>Assign pages where the checkout countdown timer shows up</strong>.</p>\n</li>\n<li>\n<p><strong>Design the checkout countdown timer on the checkout page and other assigned pages</strong>.</p>\n</li>\n</ul>\n<p>&#9658; <strong>6 months of support:</strong> with each purchase, you will have 6 months of support from VillaTheme. Our developers will help if you have any problem with Sales Countdown Timer.</p>\n<p>&#9658; <a href=\"https://1.envato.market/962d3\" rel=\"nofollow ugc\">GET PREMIUM VERSION NOW</a></p>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Product size Chart for WooCommerce customize and design the size chart of specific products or categories.</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons.</p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/?item=sales-countdown-timer\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/?item=sales-countdown-timer\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
        "installation": "<ol>\n<li>Unzip the download package</li>\n<li>Upload <code>sales-countdown-timer</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "changelog": "<p>/<strong>1.1.2 &#8211; 2024.06.13</strong>/<br />\n&#8211; Updated: Compatible with WordPress 6.5</p>\n<p>/<strong>1.1.1 &#8211; 2024.01.15</strong>/<br />\n&#8211; Fixed: Progress is not running with woocommerce_ajax_variation_threshold</p>\n<p>/<strong>1.1.0 &#8211; 2023.09.05</strong>/<br />\n&#8211; Fixed: Error when Woo product not exits<br />\n&#8211; Fixed: Error when Woo not active<br />\n&#8211; Updated: Compatible with High-Performance order storage (COT)</p>\n<p>/<strong>1.0.11 &#8211; 2023.02.08</strong>/<br />\n&#8211; Fixed: The page does not reload after the end of the countdown<br />\n&#8211; Update: Option to show/hide hour init with zero value</p>\n<p>/<strong>1.0.10 &#8211; 2022.08.30</strong>/<br />\n&#8211; Fixed: Missing input field of elementor block<br />\n&#8211; Fixed: Option countdown timer did not work on all templates</p>\n<p>/<strong>1.0.9 &#8211; 2022.07.13</strong>/<br />\n&#8211; Fixed: Missing sale price when updating product</p>\n<p>/<strong>1.0.8 &#8211; 2022.05.21</strong>/<br />\n&#8211; Update: support class<br />\n&#8211; Update: compatible with Elementor 3.1</p>\n<p>/<strong>1.0.7 &#8211; 2022.03.21</strong>/<br />\n&#8211; Update: support class</p>\n<p>/<strong>1.0.6 &#8211; 2021.11.17</strong>/<br />\n&#8211; Fixed: Progress bar is not showing on the single product page in some places and does not automatically update the quantity ordered</p>\n<p>/<strong>1.0.5.9 &#8211; 2020.07.31</strong>/<br />\n&#8211; Update: support class</p>\n<p>/<strong>1.0.5.8 &#8211; 2021.06.02</strong>/<br />\n&#8211; Update: support class</p>\n<p><strong>1.0.5.7 &#8211; 2021.01.26</strong><br />\n&#8211; Fixed: Can&#8217;t change Datetime format style</p>\n<p><strong>1.0.5.6 &#8211; 2020.08.20</strong><br />\n&#8211; Fixed: refresh page on iOS device</p>\n<p><strong>1.0.5.5 &#8211; 2020.08.14</strong><br />\n&#8211; Updated: Compatibility with WP 5.5<br />\n– Updated: Display countdown timer</p>\n<p><strong>1.0.5.4 &#8211; 2020.05.20</strong><br />\n&#8211; Updated: compatible with Elementor for Shortcode</p>\n<p>/<strong>1.0.5.3 &#8211; 2020.04.23</strong>/<br />\n&#8211; Update: support class</p>\n<p>/<strong>1.0.5.2 &#8211; 2020.03.31</strong>/<br />\n&#8211; Fixed: Countdown timer in archive page</p>\n<p>/<strong>1.0.5.1 &#8211; 2020.03.23</strong>/<br />\n&#8211; Update: support class</p>\n<p>/<em>1.0.5 &#8211; 2020.02.01</em>/<br />\n&#8211; Added: Premium version url<br />\n&#8211; Updated: Video preview</p>\n<p>/<em>1.0.4.5 &#8211; 2019.11.23</em>/<br />\n&#8211; Fixed: Not reflect sales price after countdown time is started</p>\n<p>/<em>1.0.4.4 &#8211; 2019.11.16</em>/<br />\n&#8211; Updated: Sanitize input data</p>\n<p>/<em>1.0.4.2 &#8211; 2019.04.03</em>/<br />\n&#8211; Updated: Make admin notices dismissible</p>\n<p>/<em>1.0.4.1 &#8211; 2019.01.03</em>/<br />\n&#8211; Fixed: Product quantity broken</p>\n<p>/<em>1.0.4 &#8211; 2018.12.04</em>/<br />\n&#8211; Fixed: Products price when start and end sales<br />\n&#8211; Removed: Option to show on related products<br />\n&#8211; Added: Option to set size of countdown timer on shop/category page and on mobile<br />\n&#8211; Added: Datetime unit position<br />\n&#8211; Added: Animation style<br />\n&#8211; Added: Circle countdown timer<br />\n&#8211; Added: Make countdown timer sticky when scroll on single product page</p>\n<p>/<em>1.0.3.1 &#8211; 2018.11.21</em>/<br />\n&#8211; Fixed: Current countdown timer style not working in admin settings</p>\n<p>/<em>1.0.3 &#8211; 2018.11.21</em>/<br />\n&#8211; Updated: Working with variable products<br />\n&#8211; Optimized: Speed load</p>\n<p>/<em>1.0.2.1 &#8211; 2018.11.10</em>/<br />\n&#8211; Updated: Class support</p>\n<p>/<em>1.0.2 &#8211; 2018.10.17</em>/<br />\n&#8211; Updated: Class support</p>\n<p>/<em>1.0.1 &#8211; 2018.10.15</em>/<br />\n&#8211; Fixed: Class support</p>\n"
    },
    "short_description": "Create versatile countdown timers for your WordPress site and WooCommerce products, including progress bars and upcoming sale countdowns.",
    "description": "<p>WooCommerce countdown timer helps to motivate customers purchasing. Many shop owners use WooCommerce countdown timer in sale events, promotions to boost sale, improve sales and revenue. Has your site have WooCommerce countdown timer plugin yet, let’s find out the WooCommerce countdown timer plugin from VillaTheme.</p>\n<p>Sales Countdown Timer is a plugin that allows shop owners to boost the Sales in the Sale Campaigns. The plugin can display WooCommerce countdown timer any pages by shortcodes. It is a must-have plugin for encouraging customers to purchase by creating urgency psychology.</p>\n<blockquote>\n<p><a href=\"http://new2new.com/?item=sales-countdown-timer\" title=\"Demo Sales Countdown Timer\" rel=\"nofollow ugc\">Try the Demo</a> |<a href=\"http://docs.villatheme.com/?item=sales-countdown-timer\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> |<a href=\"https://1.envato.market/962d3\" title=\"Pro Version\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/eZodkhv6jD0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>FEATURES</h3>\n<p>&#9658; <strong>WooCommerce Countdown Timer</strong>: The plugin displays sales countdown timers in single product pages and the shop page of WooCommerce. The clocks will notify customers when the sales end or how many sale product quantities left. In WooCommerce single product, you can select Sales Countdown Timer settings and schedule sale campaigns.</p>\n<ul>\n<li>\n<p><strong>Select Sales Countdown Timer profile in WooCommerce single product page, variation products, and select Sales Countdown Timer for bulk products.</strong></p>\n</li>\n<li>\n<p><strong>Display countdown clock base on WooCommerce sale scheduled time</strong></p>\n</li>\n<li>\n<p><strong>Select specific sale time</strong>: WooCommerce allows you to schedule sale time by date. With Sale Countdown Timer you are able to select specific sale time by hours and minutes.</p>\n</li>\n<li>\n<p><strong>Position in single product pages</strong>: select where the countdown clock will be displayed in single product pages. There are many options for you to select: before product price, after product price, before sale flash badges, after sale flash badges, before “add to cart” button, after “add to cart” button, in the product picture.</p>\n</li>\n<li>\n<p><strong>Position in archive pages</strong>: select where will the countdown click appear in archive pages like shop page, categories pages. There are many options for you to select: before product price, after product price, before sale flash badges, after sale flash badges, before “add to cart” button, after “add to cart” button, in the product picture.</p>\n</li>\n<li>\n<p><strong>Display in shop page, categories page, related products</strong>: you have options to choose display or hide the countdown clock on these pages.</p>\n</li>\n<li>\n<p><strong>Upcoming sale message</strong>: When you schedule a sale campaign in future, you can choose to display an upcoming sale message in the single product page. The messages can be customized with a shortcode display how many time left until the sale time.</p>\n</li>\n<li>\n<p><strong>Sale ends message</strong>: display when will the sale finish message with the shortcode {countdown_timer}.</p>\n</li>\n<li>\n<p><strong>Shortcode</strong>: the shortcode {countdown_timer} will display the countdown clock.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Sale Progress bar – Stock quantity bar</strong>: The plugin displays a progress bar display how many products are available for the sale campaign, how many products are sold and how many left.</p>\n<ul>\n<li>\n<p><strong>Progress bar message</strong>: Configure the sale progress bar message as you want with shortcodes.</p>\n</li>\n<li>\n<p><strong>Shortcodes</strong>:</p>\n</li>\n</ul>\n<p>-{quantity_left} – Number of products left</p>\n<p>-{quantity_sold} – Number of products sold</p>\n<p>-{percentage_left} – Percentage of products left</p>\n<p>-{percentage_sold} – Percentage of products sold</p>\n<p>-{goal} – The goal that you set on the single product page</p>\n<ul>\n<li>\n<p><strong>Progress bar type</strong>: select to display the sale progress as increase or dicrease.</p>\n</li>\n<li>\n<p><strong>Order status</strong>: select what order status that will be counted in the progress bar.</p>\n</li>\n<li>\n<p><strong>Position</strong>: there are 2 positions for the sale progress bar above the countdown clock and below the countdown clock.</p>\n</li>\n<li>\n<p><strong>Design</strong>: configure the frontend of the progress bar with options for width, height, background color, text color and border-radius.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Shortcodes Countdown Timer</strong>:The plugin does not require WooCommerce to work. You can display countdown clocks anywhere by using shortcodes. Settings for Countdown Timer shortcode are similar with the WooCommerce Countdown Timer, the difference is that WooCommerce Countdown Timer displays WooCommerce sale time and the Countdown Timer shortcode display your chosen time.</p>\n<ul>\n<li>\n<p><strong>Display countdown timer by shortcodes</strong>.</p>\n</li>\n<li>\n<p><strong>Select countdown time in the plugin backend</strong>.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Multiple setting profiles</strong>:The plugin allows you to set up as many Countdown Timer profiles as you want. Each profile is completely a standalone Sales Countdown Timer. With each profile, you are able to set up full settings include General settings, Design settings.</p>\n<p>&#9658; <strong>Design</strong>:Feel free to design the sales countdown timer to fit with your website front-end.</p>\n<ul>\n<li>\n<p><strong>Time display</strong>: select the time separator style and time format style.</p>\n</li>\n<li>\n<p><strong>Countdown timer clock design</strong>: configure front-end style with text color, background color, border color, padding, and border-radius.</p>\n</li>\n<li>\n<p><strong>Countdown timer item design</strong>: design the items inside the countdown timer, such as date item, hour item.</p>\n</li>\n<li>\n<p><strong>Design the time value</strong>: time value includes the time number and unit. Custom it with font size, text color, and background color.</p>\n</li>\n</ul>\n<h3>PREMIUM FEATURES</h3>\n<p>All features from the free version.</p>\n<p>&#9658; <strong>Checkout countdown timer</strong>:</p>\n<ul>\n<li>\n<p><strong>Set the checkout countdown timer for a minimum cart total to get a special offer</strong>.</p>\n</li>\n<li>\n<p><strong>The reset mode will be applied only to Administrators for testing purposes</strong>.</p>\n</li>\n<li>\n<p><strong>Reset checkout countdown for a cart after this time if the customer does not place the order during checkout countdown</strong>.</p>\n</li>\n<li>\n<p><strong>Give offers before the checkout countdown timer hits zero: Free shipping and/or discount amount (percentage/fixed amount)</strong>.</p>\n</li>\n<li>\n<p><strong>Integrates options that allow you to change offers when the countdown timer hits specific values</strong>.</p>\n</li>\n<li>\n<p><strong>Assign pages where the checkout countdown timer shows up</strong>.</p>\n</li>\n<li>\n<p><strong>Design the checkout countdown timer on the checkout page and other assigned pages</strong>.</p>\n</li>\n</ul>\n<p>&#9658; <strong>6 months of support:</strong> with each purchase, you will have 6 months of support from VillaTheme. Our developers will help if you have any problem with Sales Countdown Timer.</p>\n<p>&#9658; <a href=\"https://1.envato.market/962d3\" rel=\"nofollow ugc\">GET PREMIUM VERSION NOW</a></p>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Product size Chart for WooCommerce customize and design the size chart of specific products or categories.</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons.</p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/?item=sales-countdown-timer\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/?item=sales-countdown-timer\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/sales-countdown-timer.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/sales-countdown-timer/assets/screenshot-1.png?rev=1984805",
            "caption": "Countdown timer designs"
        },
        {
            "src": "https://ps.w.org/sales-countdown-timer/assets/screenshot-2.png?rev=1984805",
            "caption": "Countdown timer with progress bar on WooCommerce single products, category page and shop page settings"
        }
    ],
    "tags": {
        "checkout-countdown-for-woocommerce": "checkout countdown for woocommerce",
        "product-time-countdown-for-woocommerce": "product time countdown for woocommerce",
        "woocommerce": "woocommerce",
        "woocommerce-countdown-timer": "woocommerce countdown timer",
        "woocommerce-sales-countdown": "WooCommerce Sales Countdown"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.villatheme.com/donate",
    "banners": {
        "low": "https://ps.w.org/sales-countdown-timer/assets/banner-772x250.jpg?rev=3080892",
        "high": "https://ps.w.org/sales-countdown-timer/assets/banner-1544x500.jpg?rev=3080892"
    },
    "icons": {
        "1x": "https://ps.w.org/sales-countdown-timer/assets/icon-128x128.gif?rev=3080892",
        "2x": "https://ps.w.org/sales-countdown-timer/assets/icon-256x256.gif?rev=3080892"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 88,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/sales-countdown-timer/blueprint.json?rev=3102190"
        }
    ],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "sales-countdown-timer",
            "language": "vi",
            "version": "1.1.2",
            "updated": "2022-11-30 07:34:35",
            "package": "http://downloads.wordpress.org/translation/plugin/sales-countdown-timer/1.1.2/vi.zip"
        }
    ]
}