{
    "name": "SCM &#8211; Smart Currency Manager &#8211; Premium Variant for WcVendor",
    "slug": "scd-smart-currency-detector-premium-variant-for-wcvendor",
    "version": "4.8.0.1",
    "author": "<a href=\"http://gajelabs.com\">GaJeLabs</a>",
    "author_profile": "https://profiles.wordpress.org/scd2021/",
    "contributors": {
        "gajelabs": {
            "profile": "https://profiles.wordpress.org/gajelabs/",
            "avatar": "https://secure.gravatar.com/avatar/8a1b57bc79029d26af3efbed8c6e1260?s=96&d=monsterid&r=g",
            "display_name": "GaJeLabs"
        }
    },
    "requires": "4.0.0",
    "tested": "6.3.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 20,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 1,
    "support_url": "https://wordpress.org/support/plugin/scd-smart-currency-detector-premium-variant-for-wcvendor/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 0,
    "downloaded": 376,
    "last_updated": "2023-09-30 16:05:00",
    "added": "2022-10-10",
    "homepage": "http://gajelabs.com/",
    "sections": {
        "description": "<p>ALL-IN-ONE solution for buyers, sellers, single/multi vendors sites, market places. Best currency plugin for WC Vendor Marketplace for currency conversion</p>\n<p>👉 This plugin is compatible to: <a href=\"https://fr.wordpress.org/plugins/wc-vendors/\" rel=\"nofollow ugc\">WcVendor (WC Vendor &#8211; Marketplace )</a></p>\n<p>👉 <strong>Handle the multiple currencies of your buyers, sellers, also yours, for detection, conversion, display, format, dashboards, withdraws, payments, orders, emails notifications, including extensions for shipping, taxes calculation, checkout, worldwide payment methods, products addons, simple &#8211; variable products, and more.</strong></p>\n<p>👉 This is a plugin of the German company <a href=\"https://gajelabs.com/\" rel=\"nofollow ugc\">GaJeLabs</a>, which makes you handle multiple currencies within your <a href=\"https://wcvendors.com/\" rel=\"nofollow ugc\">WcVendor</a> premium marketplace, in several forms.</p>\n<p><strong>This WordPress variant gives you FREE access to this premium plugin for 7 STRAIGHT DAYS.<br />\nAfter that the plugin can be purchased from our website <a href=\"https://gajelabs.com\" rel=\"nofollow ugc\">GaJeLabs</a>,<br />\nor after getting in contact with us from the GaJeLabs team.<br />\nSkype: gajelabs.<br />\nWhatsapp 00 49 176 636 397 50.<br />\nEmail: support@gajelabs.com.</strong></p>\n<p>👉 This plugin can be used within only one domain. Though we recommend you to choose the variant valid for 2 up to 5 domains. Any serious online business needs at least a testing website(not visible for the customers) and the live website(visible for the customers). The testing website being a copy of the live website. Therefore the license for at least 2 domains. Our most successful customers have 3 domains for one and the same business, meaning 3 variants of the same website. Other customers use the same plugin within several live websites.</p>\n<p>👉 It is the first part of a big products bulk which overall makes it very easy, affordable, to sell, deliver products worldwide and do tax returns(including solutions for taxes, landed costs, shipping, payment, third party integrations like <a href=\"https://www.avalara.com/\" rel=\"nofollow ugc\">avalara</a>, <a href=\"https://www.fedex.com/\" rel=\"nofollow ugc\">fedex</a>, <a href=\"https://www.xero.com/\" rel=\"nofollow ugc\">xero</a>, and more).<br />\nWe keep on adding further features and functions to this plugin, which you can all use at the same costs.</p>\n<h4>Here a glimpse on the features it contains:</h4>\n<p>🎉 Vendors set the products price per currency, by a specific product: for simple products<br />\n🎉 Vendors set the products price per currency, by a specific product: for variable products<br />\n🎉 Admin(s) set the products price per currency, by a specific product: for simple products<br />\n🎉 Admin(s) set the products price per currency, by a specific product: for variable products<br />\n🎉 Manually set the rates between currencies (earn money additionally).<br />\nSet up manual rates between all currencies you want and the websites currency.<br />\nThese rates also apply using the multiple plugins widgets available for buyers within the website.<br />\nYou can even increase these rates with a threshold to better prepare for fluctuations for example, or to define your commission on sales with this specific currency.<br />\nYou can provide the real currencies symbols instead of currencies code, like for example €, ₪, ¥, £.<br />\nYou can decide how you want to position the currency and his symbol for display.<br />\n🎉 Automatic rates between currencies (best rates api).<br />\nWe got an internal module and routines providing you the best live rates at a time between two currencies.<br />\nWe also keep on pushing on this front accordingly, and calculate better rates than payment solutions like <a href=\"https://www.paypal.com/\" rel=\"nofollow ugc\">paypal</a>.<br />\n🎉 Each vendor can decide which currency he uses for his own shop.<br />\nEach vendor can specify his shop currency. This is a profound change and improvement with regards to the handling of multiple currencies within a marketplace.<br />\nMost of the time, the vendors and the marketplace owner don‘t live in the same country nor have the same currency. Thus each vendor can handle his own shop using his own currency, and same for the marketplace owner, which defines the currency of his marketplace.<br />\nThe vendor can also, after setting its own default(shop) currency, specify whether its product price will be set in his default currency or in the websites(base) currency.<br />\n🎉 The vendor&#8217;s own currency is also the one visible within its dashboard.<br />\nIt means the vendor&#8217;s sales are summarized using his currency and of course the specific amounts.<br />\nThis depends on the settings chosen by the vendor. If the vendor choosed to set his product prices in the website(base) currency, his dashboard will be using this currency as well.<br />\n🎉 The vendor’s own currency is also the one visible within his orders overview.<br />\nTake the same vendor as an example, which has USD as its own currency.<br />\n🎉 Admins dashboard is coherent to all vendors dashboards totgeher and brings an overall report in the admins(websites) currency<br />\n🎉 The admins withdrawal page is adapted accordingly.<br />\nThen the vendor&#8217;s withdrawal page is also adapted accordingly.<br />\n🎉 Format the currencies and symbol display.<br />\nAs you can see within the picture below, the AED symbol has been added to the specific currency description.<br />\n🎉 Automatic clients currency calculation and display.<br />\nThis is mostly based on our geo api module, providing detailed information about the customer&#8217;s position. Finer than at country or city level, with for example(on demand) the possibility to let the user change the geolocation.<br />\n🎉 Mobile and app friendly.<br />\nYou can use these features on your iOS / Android apps.<br />\nYou can decide whether you want to use the widget within the mobile version of your website or not.<br />\nYou can configure some specific behavior(like color) on your mobile widgets.<br />\n🎉 More features are available, like the compatibility(optional) with many payment gateways, as for example AliPay(wechat, payoneer, uepapay, azul, cardcom, stripe, square, bitcoin, paypal, whatsapp order &amp; checkout, …)<br />\nAnd keep on improving.<br />\n🎉 This plugin has also opened extensions for email notification, pdf creation,<br />\npowerful taxes calculation(online or offline), powerful shipping calculation(online or offline), connection to an accounting plugin like Xero, and more.</p>\n<h4>Contact us by any question or customization request.</h4>\n<p>👉 Skype: gajelabs 👈<br />\n👉 WhatsApp: 00 49 176 636 397 50 👈</p>\n<h3>Disclaimer</h3>\n<p>It is not responsible for any harm or wrong doing this Plugin may cause. Users are fully responsible for their own use. This Plugin is to be used WITHOUT warranty.</p>\n",
        "changelog": "<h4>4.8.1</h4>\n<ul>\n<li>Update the Plugin name to SCM &#8211; Smart Currency Manager</li>\n</ul>\n<h4>4.8.0</h4>\n<ul>\n<li>Fix issue on variable products</li>\n<li>Auto installation of dependency plugin SCM Free variant </li>\n</ul>\n<h4>4.7.8</h4>\n<ul>\n<li>Remove some obsolete settings options on SCM currency settings in WcVendor vendor dashboard </li>\n<li>Change plugin name </li>\n<li>Correct SCM currency settings integration in WcVendor vendor dashbord menu for mobile view</li>\n</ul>\n<h4>4.7.7</h4>\n<ul>\n<li>correct issue when add new simple product and variable product</li>\n</ul>\n<h4>4.7.6</h4>\n<ul>\n<li>hithlight scd currency menu on WcVendor dashboard after clicking on.</li>\n</ul>\n<h4>4.7.5</h4>\n<ul>\n<li>Extends import export woocommerce feature to scd data prices</li>\n<li>Add compatibilty with payzen</li>\n</ul>\n<h4>4.7.4</h4>\n<ul>\n<li>Add custom currency option</li>\n<li>Email notification after deactivate the plugin</li>\n</ul>\n<h4>4.7.3</h4>\n<ul>\n<li>Split scd in free and premium versions</li>\n</ul>\n<h4>4.7.2</h4>\n<ul>\n<li>Add register shiping methods in default currency for WcVendor marketplace site </li>\n<li>Improve currency drop down menu </li>\n<li>Fix issue on scd wcmp compatibility<br />\n4.6.7 =</li>\n<li>Fix currency menu issue</li>\n<li>improve loading speed</li>\n</ul>\n<h4>4.6.6</h4>\n<p>Add filter currencies option for widget on landing page</p>\n<h4>4.6.5</h4>\n<ul>\n<li>Fix bug</li>\n<li>Move some functions to correct file</li>\n<li>remove some unsed code<br />\n4.6.4</li>\n<li>Update WcVendor compatibility</li>\n<li>reorganize code for multivendors variant</li>\n</ul>\n<h4>4.6.3</h4>\n<ul>\n<li>fix issue when user set his default currency</li>\n</ul>\n<h4>4.6.2</h4>\n<ul>\n<li>Fix issue with license activation</li>\n</ul>\n<h4>4.6.1</h4>\n<ul>\n<li>Add new widget model</li>\n<li>Add scd dropdown menu for currencies</li>\n</ul>\n<h4>4.6.0</h4>\n<ul>\n<li>Fix double conversion in WcVendor order page </li>\n<li>Start using shorcode to place scd widget in any location of the website</li>\n</ul>\n<h4>4.5.9</h4>\n<ul>\n<li>Fix can&#8217;t disbale variation on WcVendor dashbord when scd is activated</li>\n<li>Fix widget not work after EUR currency selection</li>\n</ul>\n<h4>4.5.8</h4>\n<ul>\n<li>Fix auto select currency in widget correponding to the target currency</li>\n</ul>\n<h4>4.5.7</h4>\n<ul>\n<li>Support Stripe payment gateway for payments in converted currency</li>\n</ul>\n<h4>4.5.6</h4>\n<ul>\n<li>Register variable product with user default currency in WcVendor plugin</li>\n</ul>\n<h4>4.5.5</h4>\n<ul>\n<li>use select2 library for WcVendor integratio</li>\n<li>Fix auto select cfp currency when eur is selected in fr and ru langauges</li>\n<li>Fix undefined ofset in ispricebycurr function</li>\n</ul>\n<h4>4.5.4</h4>\n<p>*Fix hide WcVendor content unhide by scd in product dashboard page!</p>\n<h4>4.5.3</h4>\n<ul>\n<li>Add setting menu option to select fallback currency</li>\n<li>Fix SCM widget to list currencies in alphabetical order</li>\n<li>Support user location simulation for testing</li>\n</ul>\n<h4>4.5.2</h4>\n<ul>\n<li>Use base currency for paypal payment if user currency not supported</li>\n<li>Remove Multi Roles settings tab</li>\n<li>Add support tab and license info to settings menu</li>\n<li>Add option to enable or disable plugin data deletion on uninstall</li>\n</ul>\n<h4>4.5.1</h4>\n<p>WcVendor improvement to allow vendor to use custom currency for setting product price</p>\n<h4>4.5.0</h4>\n<ul>\n<li>Fix manual setings options; </li>\n<li>WcVendor improvement to allow vendor to use custom currency for setting product price;</li>\n<li>Fix issue of duplicated fields on WcVendor Edit product page</li>\n</ul>\n<h4>4.4.9</h4>\n<p>Fix plugin updater</p>\n<h4>4.4.8</h4>\n<p>WcVendor improvement to allow vendor to use custom currency</p>\n<h4>4.4.7</h4>\n<p>Update setting to allow seller to limit the set of currencies available to users; Changes to SCM widget.</p>\n<h4>4.4.6</h4>\n<p>Corrections to conversion module to improve performance</p>\n<h4>4.4.5</h4>\n<p>Improve scd WcVendor implementation</p>\n<h4>4.4.4</h4>\n<p>Display currency symbol instead of currency code;<br />\nDelay loading of client side scripts to address intermittent issues with certain themes.</p>\n<h4>4.4.3</h4>\n<p>Orders are now saved with the currency used for payment if the multi-currency payment setting is enabled;<br />\nFix to issue with conversion of order totals after applying coupons.</p>\n<h4>4.4.2</h4>\n<p>Fix conversion of high values and variable product price</p>\n<h4>4.4.1</h4>\n<p>Fix issue resulting in NaN price display in certain currencies</p>\n<h4>4.4.0</h4>\n<p>Extend set user currency feature to WcVendor plugin</p>\n<h4>4.3.9</h4>\n<p>Fixed widget issue</p>\n<h4>4.3.8</h4>\n<p>Fixed performance issue<br />\nFixed double conversion issue</p>\n<h4>4.3.7</h4>\n<p>Support use of customer currency for payments with Paypal (Enabled via settings)</p>\n<h4>4.3.6</h4>\n<p>Fix plugin update issue</p>\n<h4>4.3.5</h4>\n<p>Fix paypal issue on multi currencies mode</p>\n<h4>4.3.4</h4>\n<p>Add PayUmoney support</p>\n<h4>4.3.3</h4>\n<p>Fix checkout page conversion issue on autodetection mode</p>\n<h4>4.3.2</h4>\n<p>Fix shopping cart conversion issue</p>\n<h4>4.3.1</h4>\n<p>Fixed conversion issue on cart and checkout page</p>\n<h4>4.3.0</h4>\n<p>Add set user currency for wc vendors</p>\n<h4>4.2.9</h4>\n<p>Add multi-base currencies feature</p>\n<h4>4.2.8</h4>\n<p>Fix bug cause by undefined variable</p>\n<h4>4.2.7</h4>\n<p>Fix update product with wcmp plugin issue</p>\n<h4>4.2.6</h4>\n<p>Update api key</p>\n<h4>4.2.5</h4>\n<p>Add compatibility with WooCommerce Market place plugin (WCMP)</p>\n<h4>4.2.4</h4>\n<p>Add SPG Functionalities</p>\n<h4>4.2.3</h4>\n<p>workarround of library chosen when update product using WcVendor plugin</p>\n<h4>4.2.2</h4>\n<p>Add compatibility update product with WcVendor plugins</p>\n<h4>4.2.1</h4>\n<ul>\n<li>Adding pdate system from private repository </li>\n</ul>\n<h4>4.2.0</h4>\n<ul>\n<li>Convert js $ to JQuery</li>\n</ul>\n<h4>4.1.9</h4>\n<ul>\n<li>Added russian translation of the widget</li>\n</ul>\n<h4>4.1.8</h4>\n<ul>\n<li>Add license manager</li>\n</ul>\n<h4>4.1.7</h4>\n<ul>\n<li>Integrate wooCommerce frontend manager plugin</li>\n</ul>\n<h4>4.1.6</h4>\n<ul>\n<li>Added french translation of the widget</li>\n</ul>\n<h4>4.1.5</h4>\n<ul>\n<li>Integrate WcVendor multi-vendors market pleces plugin</li>\n</ul>\n<h4>4.1.4</h4>\n<ul>\n<li>Fix bug: a third party jquery function wrongly called</li>\n</ul>\n<h4>4.1.3</h4>\n<ul>\n<li>Fix issue: yahoo api and others were shutdown therefore no conversion rate</li>\n</ul>\n<h4>4.1.2</h4>\n<ul>\n<li>Fix issue: after deleting a product the conversion to local currency is not done</li>\n</ul>\n<h4>4.1.1</h4>\n<ul>\n<li>Caching all the conversion rates in end user&#8217;s local storage to speed up price conversions</li>\n</ul>\n<h4>4.1.0</h4>\n<ul>\n<li>removing price by currency option in the default options</li>\n</ul>\n<h4>4.0.9</h4>\n<ul>\n<li>Changing plugin folder name</li>\n</ul>\n<h4>4.0.8</h4>\n<ul>\n<li>Added compatibility to the WcVendor plugin</li>\n</ul>\n<h4>4.0.7</h4>\n<p>use scd with WC Vendors</p>\n<h4>4.0.5</h4>\n<p>update product using wc-vendors</p>\n<h4>4.0.4</h4>\n<ul>\n<li>fixed cookies issue and adapted cookies to php 7.1.X</li>\n</ul>\n<h4>4.0.3</h4>\n<ul>\n<li>integrate wc-vendors plugin</li>\n</ul>\n<h4>4.0.2</h4>\n<ul>\n<li>Fixed performace issue</li>\n</ul>\n<h4>4.0.1</h4>\n<ul>\n<li>Added compatibility to the WooCommerce Frontend Manager plugin</li>\n</ul>\n<h4>4.0.0</h4>\n<ul>\n<li>Adapted to WooCommerce 3.3.1 and WordPress 4.9.4 </li>\n</ul>\n<h4>3.9</h4>\n<ul>\n<li>Fixed: cookies management</li>\n<li>Added: a new source for  currency rates</li>\n</ul>\n<h4>3.8</h4>\n<ul>\n<li>Fixed: error handling manual updated rates</li>\n<li>Fixed: display issues</li>\n</ul>\n<h4>3.7</h4>\n<ul>\n<li>Fixed: paypal currencies issues with spg </li>\n<li>Fixed: Issues with yahooapi call</li>\n<li>Fixed: Some Display issues</li>\n</ul>\n<h4>3.6</h4>\n<ul>\n<li>Fixed: js issues on product page</li>\n</ul>\n<h4>3.5</h4>\n<ul>\n<li>Added: enable end users to update SCM from admin panel</li>\n</ul>\n<h4>3.4</h4>\n<ul>\n<li>Fixed: display issues and notices</li>\n<li>Added: cookies management</li>\n</ul>\n<h4>3.3</h4>\n<ul>\n<li>Added: Compatibility with his paypal gateway [Smart Paypal Gateway]</li>\n<li>Fixed: issues on money format fixed</li>\n</ul>\n<p>=3.0 =<br />\n* Added: Enable support for woocommerce 3.1.x<br />\n* Fixed: Multi users / roles settings<br />\n* Fixed: SCM incompatibilities and issues on woocommerce 2.6.+</p>\n<h4>1.2</h4>\n<ul>\n<li>Added: Enable Support for site using ssl certificates</li>\n</ul>\n<h4>1.1</h4>\n<ul>\n<li>Fixed: End users widget with flags + currencies</li>\n<li>Fixed: Multi users / roles display style</li>\n<li>Added: Shortcode [scd_widget]</li>\n</ul>\n<h4>1.0</h4>\n<ul>\n<li>Added: All-in-one     </li>\n<li>Added: Approximate the products price</li>\n<li>Added: Enable the payment with several currencies</li>\n<li>Added: Allow to auto update exchange rate</li>\n<li>Added: Exchange rates are fetched from Yahoo Finance So they are always updated</li>\n<li>Added: Set time to update Exchange rates</li>\n<li>Added: Customize each currency separately</li>\n<li>Added: Set the position for each currency (e.g.  50, 50 )</li>\n<li>Added: 1-10% on top of instant Exchange rates </li>\n<li>Added: Round up the converted price to your convenience </li>\n<li>Added: Customize foreign currencies names, Formats, symbols, signs, brands</li>\n<li>Added: Several options to customize your exchange rate for each currency</li>\n<li>Added: Format / rename your currencies</li>\n<li>Added: Automatic target currency detection, depending on end users Location (e.g. Auto detection)</li>\n<li>Added: End users widget</li>\n<li>Added: Allow to add a decimal numbers display</li>\n<li>Added: Set the number of decimals</li>\n<li>Added: Enable Multi roles based, webpages display currency</li>\n<li>Added: Specify the number of usable currencies for your different roles </li>\n<li>Added: Set a specific products price for each given currency  </li>\n<li>Added: Appropriate for multi store market places (e.g. WC Marketplace)</li>\n<li>Added: Appropriate for multi vendor sites (e.g. WC Vendors, WcVendor)</li>\n<li>Added: Users to roles settings and restrictions</li>\n<li>Added: Simplified the products creations UI for multiple currencies</li>\n<li>Added: Supports 237 countries and 157 currencies</li>\n<li>Added: Appropriate for all other currency echange use cases</li>\n<li>Added: Mobile friendly</li>\n<li>Added: Replace Original Price</li>\n<li>Added: Supports all modern browsers</li>\n<li>Added: Easy installation</li>\n</ul>\n"
    },
    "short_description": "ALL-IN-ONE solution for buyers, sellers, single/multi vendors sites, market places. Best currency plugin for WC Vendor Marketplace for currency conver &hellip;",
    "description": "<p>ALL-IN-ONE solution for buyers, sellers, single/multi vendors sites, market places. Best currency plugin for WC Vendor Marketplace for currency conversion</p>\n<p>👉 This plugin is compatible to: <a href=\"https://fr.wordpress.org/plugins/wc-vendors/\" rel=\"nofollow ugc\">WcVendor (WC Vendor &#8211; Marketplace )</a></p>\n<p>👉 <strong>Handle the multiple currencies of your buyers, sellers, also yours, for detection, conversion, display, format, dashboards, withdraws, payments, orders, emails notifications, including extensions for shipping, taxes calculation, checkout, worldwide payment methods, products addons, simple &#8211; variable products, and more.</strong></p>\n<p>👉 This is a plugin of the German company <a href=\"https://gajelabs.com/\" rel=\"nofollow ugc\">GaJeLabs</a>, which makes you handle multiple currencies within your <a href=\"https://wcvendors.com/\" rel=\"nofollow ugc\">WcVendor</a> premium marketplace, in several forms.</p>\n<p><strong>This WordPress variant gives you FREE access to this premium plugin for 7 STRAIGHT DAYS.<br />\nAfter that the plugin can be purchased from our website <a href=\"https://gajelabs.com\" rel=\"nofollow ugc\">GaJeLabs</a>,<br />\nor after getting in contact with us from the GaJeLabs team.<br />\nSkype: gajelabs.<br />\nWhatsapp 00 49 176 636 397 50.<br />\nEmail: support@gajelabs.com.</strong></p>\n<p>👉 This plugin can be used within only one domain. Though we recommend you to choose the variant valid for 2 up to 5 domains. Any serious online business needs at least a testing website(not visible for the customers) and the live website(visible for the customers). The testing website being a copy of the live website. Therefore the license for at least 2 domains. Our most successful customers have 3 domains for one and the same business, meaning 3 variants of the same website. Other customers use the same plugin within several live websites.</p>\n<p>👉 It is the first part of a big products bulk which overall makes it very easy, affordable, to sell, deliver products worldwide and do tax returns(including solutions for taxes, landed costs, shipping, payment, third party integrations like <a href=\"https://www.avalara.com/\" rel=\"nofollow ugc\">avalara</a>, <a href=\"https://www.fedex.com/\" rel=\"nofollow ugc\">fedex</a>, <a href=\"https://www.xero.com/\" rel=\"nofollow ugc\">xero</a>, and more).<br />\nWe keep on adding further features and functions to this plugin, which you can all use at the same costs.</p>\n<h4>Here a glimpse on the features it contains:</h4>\n<p>🎉 Vendors set the products price per currency, by a specific product: for simple products<br />\n🎉 Vendors set the products price per currency, by a specific product: for variable products<br />\n🎉 Admin(s) set the products price per currency, by a specific product: for simple products<br />\n🎉 Admin(s) set the products price per currency, by a specific product: for variable products<br />\n🎉 Manually set the rates between currencies (earn money additionally).<br />\nSet up manual rates between all currencies you want and the websites currency.<br />\nThese rates also apply using the multiple plugins widgets available for buyers within the website.<br />\nYou can even increase these rates with a threshold to better prepare for fluctuations for example, or to define your commission on sales with this specific currency.<br />\nYou can provide the real currencies symbols instead of currencies code, like for example €, ₪, ¥, £.<br />\nYou can decide how you want to position the currency and his symbol for display.<br />\n🎉 Automatic rates between currencies (best rates api).<br />\nWe got an internal module and routines providing you the best live rates at a time between two currencies.<br />\nWe also keep on pushing on this front accordingly, and calculate better rates than payment solutions like <a href=\"https://www.paypal.com/\" rel=\"nofollow ugc\">paypal</a>.<br />\n🎉 Each vendor can decide which currency he uses for his own shop.<br />\nEach vendor can specify his shop currency. This is a profound change and improvement with regards to the handling of multiple currencies within a marketplace.<br />\nMost of the time, the vendors and the marketplace owner don‘t live in the same country nor have the same currency. Thus each vendor can handle his own shop using his own currency, and same for the marketplace owner, which defines the currency of his marketplace.<br />\nThe vendor can also, after setting its own default(shop) currency, specify whether its product price will be set in his default currency or in the websites(base) currency.<br />\n🎉 The vendor&#8217;s own currency is also the one visible within its dashboard.<br />\nIt means the vendor&#8217;s sales are summarized using his currency and of course the specific amounts.<br />\nThis depends on the settings chosen by the vendor. If the vendor choosed to set his product prices in the website(base) currency, his dashboard will be using this currency as well.<br />\n🎉 The vendor’s own currency is also the one visible within his orders overview.<br />\nTake the same vendor as an example, which has USD as its own currency.<br />\n🎉 Admins dashboard is coherent to all vendors dashboards totgeher and brings an overall report in the admins(websites) currency<br />\n🎉 The admins withdrawal page is adapted accordingly.<br />\nThen the vendor&#8217;s withdrawal page is also adapted accordingly.<br />\n🎉 Format the currencies and symbol display.<br />\nAs you can see within the picture below, the AED symbol has been added to the specific currency description.<br />\n🎉 Automatic clients currency calculation and display.<br />\nThis is mostly based on our geo api module, providing detailed information about the customer&#8217;s position. Finer than at country or city level, with for example(on demand) the possibility to let the user change the geolocation.<br />\n🎉 Mobile and app friendly.<br />\nYou can use these features on your iOS / Android apps.<br />\nYou can decide whether you want to use the widget within the mobile version of your website or not.<br />\nYou can configure some specific behavior(like color) on your mobile widgets.<br />\n🎉 More features are available, like the compatibility(optional) with many payment gateways, as for example AliPay(wechat, payoneer, uepapay, azul, cardcom, stripe, square, bitcoin, paypal, whatsapp order &amp; checkout, …)<br />\nAnd keep on improving.<br />\n🎉 This plugin has also opened extensions for email notification, pdf creation,<br />\npowerful taxes calculation(online or offline), powerful shipping calculation(online or offline), connection to an accounting plugin like Xero, and more.</p>\n<h4>Contact us by any question or customization request.</h4>\n<p>👉 Skype: gajelabs 👈<br />\n👉 WhatsApp: 00 49 176 636 397 50 👈</p>\n<h3>Disclaimer</h3>\n<p>It is not responsible for any harm or wrong doing this Plugin may cause. Users are fully responsible for their own use. This Plugin is to be used WITHOUT warranty.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/scd-smart-currency-detector-premium-variant-for-wcvendor.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "auto-detect": "auto detect",
        "conversion": "conversion",
        "converter": "converter",
        "currency": "currency",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/scd-smart-currency-detector-premium-variant-for-wcvendor.1.0.0.zip",
        "4.7.8": "https://downloads.wordpress.org/plugin/scd-smart-currency-detector-premium-variant-for-wcvendor.4.7.8.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/scd-smart-currency-detector-premium-variant-for-wcvendor/assets/banner-772×250.jpg?rev=2796672",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/scd-smart-currency-detector-premium-variant-for-wcvendor/assets/icon-128×128.png?rev=2796672"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 20,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}