{
    "name": "Sell Downloads",
    "slug": "sell-downloads",
    "version": "1.1.7",
    "author": "<a href=\"http://wordpress.dwbooster.com/content-tools/sell-downloads\">CodePeople</a>",
    "author_profile": "https://profiles.wordpress.org/codepeople/",
    "contributors": {
        "codepeople": {
            "profile": "https://profiles.wordpress.org/codepeople/",
            "avatar": "https://secure.gravatar.com/avatar/c0662edcefb5a4e2ab12803856ba2358?s=96&d=monsterid&r=g",
            "display_name": "codepeople"
        }
    },
    "requires": "3.5.0",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 80,
    "ratings": {
        "5": 12,
        "4": 3,
        "3": 2,
        "2": 2,
        "1": 2
    },
    "num_ratings": 21,
    "support_url": "https://wordpress.org/support/plugin/sell-downloads/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 200,
    "downloaded": 90955,
    "last_updated": "2024-07-05 12:02am GMT",
    "added": "2013-03-20",
    "homepage": "http://wordpress.dwbooster.com/content-tools/sell-downloads",
    "sections": {
        "description": "<p>Sell Downloads features:</p>\n<p>» Sell Downloads is a WordPress eCommerce<br />\n» Allows selling digital files like audio,video,documents,pictures,etc.<br />\n» Allows to filter products by types of files<br />\n» Includes multiple layouts for the store<br />\n» Allows paging and sorting the results by popularity, price or file name<br />\n» Uses PayPal as payment gateway. Payments are SCA ready (Strong Customer Authentication), compatible with the new Payment services (PSD 2) &#8211; Directive (EU)<br />\n» Allows sharing products in social networks (Facebook, Twitter, Google+)<br />\n» Allows to associate additional information to the products<br />\n» Allows to protect the files with the inclusion of a file&#8217;s demo<br />\n» The demo files will be displayed directly on browser, whether are enabled<br />\n  the corresponding plugins in browser</p>\n<p><strong>Sell Downloads</strong> is an  WordPress eCommerce for selling downloadable files: audio, video, documents, pictures all that may be published in Internet. Sell Downloads uses PayPal as payment gateway, making the sale process easy and secure.</p>\n<p>Create an e-commerce for sell digital files never was more easy than with &#8220;Sell Downloads&#8221;, the majority of e-commerce plugins are developed thinking in tangible products and does the sale&#8217;s process very complex. An ecommerce that pretends to sale only digital files must to coexist with data related to tangible products, configure shipping cost, etc, &#8220;Sell Downloads&#8221; doesn&#8217;t need any of previous data. With &#8220;Sell Downloads&#8221; is required only define the PayPal data and the products to sell.</p>\n<p><strong>More about the Main Features:</strong></p>\n<ul>\n<li>Allows selling your digital files via PayPal. PayPal is the payment gateway by excellence, very easy to use and very secure.</li>\n<li>Allows a custom setup of the ecommerce, with ability to filter products by types of files, paging and sorting the results by popularity, price or file name, making of &#8220;Sell Downloads&#8221; a very configurable plugin.</li>\n<li>Allows to insert a specific product in a post or page.</li>\n<li>Allows to associate additional information to the products. For example, if are selling a book and like to associate a link to other books of the same editorial, or a page of reviews from critics, this field would be the option for do it.</li>\n<li>Allows to protect the files with the inclusion of a file&#8217;s demo. Monographies, videos, songs and many other digital files, allow the creation of a version for demo. It is very hard to sell a song if the possible customers never hear at least a part of it, similar happen with videos and its trailers or the monographies and its abstracts.</li>\n<li>Includes a module to track sales statistics. With the statistics module is possible to know the amount of sales, the discounts applied or coupon used, and check the total of earnings by the ecommerce in a period of time. The statistics module allows to display animated charts with specific reports like: sales by currency, country or products.</li>\n</ul>\n<p>The &#8220;Sell Downloads&#8221; plugin allows the specific integration with the following editors:</p>\n<ul>\n<li>Classic WordPress Editor.</li>\n<li>Gutenberg Editor.</li>\n<li>Elementor.</li>\n<li>Page Builder by SiteOrigin.</li>\n<li>BeaverBuilder Editor.</li>\n<li>For other editors, the shortcodes should be inserted using other controls of general purpose, like the controls for inserting HTML or shortcodes.</li>\n</ul>\n<p>The base plugin, available for free from the WordPress Plugin Directory has all the features you need to create a ecommerce for sell downloads on your website.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Quosrug9pgo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Inserting and using the basic &#8220;Sell Downloads&#8221; plugin.</p>\n<p><strong>Premium Features:</strong></p>\n<ul>\n<li>Allows to enable a shopping cart. With a shopping cart is possible to sell multiple products in the same purchase action, the customers will appreciate this feature.</li>\n<li>The product is available as widget to be inserted in the website&#8217;s sidebars.</li>\n<li>Allows to insert a product list in a post or page. The products can be selected between the most rated, the newest, or top selling. The product list is available as widget to be inserted in the website&#8217;s sidebars.</li>\n<li>Allows to define sales discounts. It is usual in the e-commerce create sales campaigns, define discounts for products or events (like mothers day, the Christmas,etc.), to promote the sales. The &#8220;Sell Downloads&#8221; allows to define shop&#8217;s discounts, and display the previous and new prices of products.</li>\n<li>Allows to define discount coupons. The coupons are an excellent tool to know where is the origin of sales and create (like in discounts definition) sales campaings, but directed to a specific sector or website. The coupons are applied to all sales from the ecommerce.</li>\n</ul>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/BG1Y2TSlvms?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Inserting and using the premium &#8220;Sell Downloads&#8221; plugin.</p>\n<p><strong>Demo of Premium Version of Plugin</strong></p>\n<p><a href=\"https://demos.dwbooster.com/sell-downloads/wp-login.php\" title=\"Click to access the administration area demo\" rel=\"nofollow ugc\">https://demos.dwbooster.com/sell-downloads/wp-login.php</a></p>\n<p><a href=\"https://demos.dwbooster.com/sell-downloads/\" title=\"Click to access the Sell Downloads\" rel=\"nofollow ugc\">https://demos.dwbooster.com/sell-downloads/</a></p>\n<p><strong>Are safe the downloads links?</strong></p>\n<p>The security in the access to products files is determined in different ways.</p>\n<ul>\n<li>The products files can&#8217;t be accessed directly. The purchased files are stored in a special directory called sd-downloads, the sd-downloads directory includes a .htaccess file that forbid the access from browser. The files can be accessed only through a server side script that validates the purchase.</li>\n<li>The Store determines the validity of  download links based in three options, available in the settings page of plugin.</li>\n</ul>\n<p>It is possible define a time period, in days, where a download link is considered valid. If a user tries to download a purchased product, the Store checks the date of purchasing.<br />\nThe  Store may be configured to request the email address used in the purchasing to check the validity of download link.</p>\n<p>It is possible define a limit of downloads by purchase. If a user tries to download a product, the Sell Downloads checks how many downloads have been made.</p>\n<p>If you want more information about this plugin don&#8217;t hesitate in checking the plugin&#8217;s website:</p>\n<p><a href=\"http://wordpress.dwbooster.com/content-tools/sell-downloads\" title=\"Sell Downloads\" rel=\"nofollow ugc\">http://wordpress.dwbooster.com/content-tools/sell-downloads</a></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/fkkA1-bs430?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Inserting a products list, and products, in pages or sidebars of website (only available in the premium version of plugin).</p>\n<h3>Interface</h3>\n<p><strong>Setting up of shop</strong></p>\n<p>Sell Downloads can be set up via the menu: &#8220;Sell Downloads &gt; Sell Downloads Settings&#8221;. The setup screen offers general settings for the shop, allows entering the PayPal data required to process sales and texts that will be used for the email notifications with the download links of the purchased files.</p>\n<p><strong>Settings Interface</strong></p>\n<p>The setup interface of commerce includes the following fields:</p>\n<ul>\n<li>URL of store page: Enter the URL of the webpage where the ecommerce was inserted. The URL of the store will be used to return from the product page to the shop page.</li>\n<li>Allow searching by taxonomies: Modifies the search process of WordPress to allow the products be found by their taxonomies.</li>\n<li>Allow to filter by type: Inserts a field into the shopping webpage that allows to filter products by type (jpg, mp3, doc,&#8230;.)</li>\n<li>Store layout: Allows select one of the multiple layouts available for the store.</li>\n<li>Allow multiple pages: Allows paging through the shop&#8217;s products.</li>\n<li>Items per page: Defines the number of products per page in the commerce&#8217;s page.</li>\n<li>Share in social networks: Display a group of buttons for sharing the products in the social networks(like Facebook, Twitter and Google+)</li>\n<li>Facebook app id for sharing in Facebook: App id for sharing the website&#8217;s links in Facebook.</li>\n</ul>\n<p><strong>Payment gateway data (PayPal)</strong></p>\n<ul>\n<li>Enable PayPal Payments: Allows the sale of products through PayPal.</li>\n<li>PayPal email: Enter the email address associated with the PayPal account.</li>\n<li>Currency: Symbol of the currency in which payments are accepted.</li>\n<li>PayPal language: Preferred language of the PayPal interface.</li>\n<li>PayPal button: Select the PayPal button design.</li>\n<li>Increase the download page security: Requests the email used in product&#8217;s purchase from the download page.</li>\n<li>Download link valid for: Set an expire time for the download links.</li>\n</ul>\n<p><strong>Discount settings applied to the sales of the ecommerce. In the shopping cart the discount is applied to the total sale cost(premium version)</strong></p>\n<ul>\n<li>Percent to discount: Enter the percent to discount to the total sale cost.</li>\n<li>Valid for sales over than: Apply discount to sales superior to this value.</li>\n<li>Valid from (dd/mm/yyyy): Apply discount from the entered date.</li>\n<li>Valid to (dd/mm/yyyy): Apply discount until the entered date.</li>\n<li>Promotional text: Text to promote the discount.</li>\n</ul>\n<p><strong>Coupon settings applied to all sales of the ecommerce(premium version)</strong></p>\n<ul>\n<li>Percent to discount: Enter the percent to discount to the total sale cost.</li>\n<li>Coupon: Enter the coupon code.</li>\n<li>Valid from (dd/mm/yyyy): The coupon is valid from the entered date.</li>\n<li>Valid to (dd/mm/yyyy): The coupon is valid to the entered date.</li>\n</ul>\n<p><strong>Notification Settings</strong>, both for buyers to complete a payment, and the shop manager</p>\n<ul>\n<li>Notification &#8220;from&#8221; email: E-mail address that will appear as the sender of notifications.</li>\n<li>Send notification to email: Email address where a notification is sent after each sale.</li>\n<li>Subject of user confirmation email: Subject of the confirmation email sent to the customer when making the purchase.</li>\n<li>Email confirmation to user: Body of message sent to the customer when making the purchase. The message should include the tag  %INFORMATION% which will be replaced by the purchase data, like the download link.</li>\n<li>Subject of email notification to admin: Subject of email notification sent to the administrator when a purchase is made.</li>\n<li>Email notification to admin: Body of the email message sent to the administrator when a purchase is made. The message text should include the tag  %INFORMATION%, which will be replaced by the purchase data.</li>\n</ul>\n<p><strong>Affiliate Royale Integration</strong>, if the Affiliate Royale plugin is installed on the website, and you want integrate it with the store.</p>\n<p><strong>Creating product for commerce</strong></p>\n<p>The shop allows to sell possible digital files (video, audio, documents, etc). To create a product press the menu option &#8220;Sell Downloads &gt; Products for Sale&#8221;. Initially it displays the list of products entered previously and a set of data associated with the product: Product Name, File Type, Downloads, Purchases and Date (screenshot-2)</p>\n<p>To enter a new product/file to the shop press &#8220;Add New&#8221;.</p>\n<p>The interface for entering data pertaining to a product is described below (screenshot-3):</p>\n<p><strong>Product&#8217;s data</strong></p>\n<ul>\n<li>Enter Title Here: Enter the title-name of the product to display in the shop page and the product page.</li>\n<li>Description: Description of the product. This field is optional, but offers the opportunity to provide additional information about the product, this information is displayed only in the product page.</li>\n<li>Sales Price: Retail price of the product.</li>\n<li>File for sale: URL of the file to sell. The button associated with the field displays the WordPress media gallery making it easy to select the file.</li>\n<li>File for demo: URL file demo. The file for demo may be accessed from the ecommerce page.The button associated with the field displays the WordPress media gallery making it easy to select the file.</li>\n<li>File Type: Select a file type from the list or enter a new one if it is not yet on the list. The file type allow filtering the products in the shop page.</li>\n<li>Image: URL of an image that represents the product, the product image is shown in the ecommerce page and product page. The button associated with the field displays the WordPress media gallery making it easy to select the file.</li>\n<li>Duration: Enter a value with time format. Useful for Audio and Video files. With other files types the fields may be let empty.</li>\n<li>Publication Year: Enter a value with year format. Useful for files associated with a date, as the creation or publication date , for example a book or monograph.</li>\n<li>Additional Information: URL of a webpage with additional information about the product.</li>\n</ul>\n<p><strong>Programming a discount for the specific product(premium version)</strong></p>\n<ul>\n<li>New price: The new price to apply to the product. The old and new prices will shown in pages of the ecommerce and the specific product.</li>\n<li>Valid from (dd/mm/yyyy): Apply discount from the entered date.</li>\n<li>Valid to (dd/mm/yyyy): Apply discount until the entered date.</li>\n<li>Promotional text: Text to promote the discount. The promoting text will be shown in the shop page.</li>\n</ul>\n<p><strong>Publishing the &#8220;Sell Downloads&#8221; ecommerce</strong></p>\n<p>The &#8220;Sell Downloads&#8221; ecommerce can be posted on a page or post of WordPress. To insert the &#8220;Sell Downloads&#8221; shop go to the relevant section (page or post) and press the &#8220;Sell Downloads&#8221; button above the  content editor of post/page(screenshot-4), the action displays a setup screen (screenshot-5)</p>\n<p><strong>Interface for insertion dialog</strong></p>\n<ul>\n<li>Filter results by products type: by default, displays only products that belong to a specified type.</li>\n<li>Columns: Defines the number of columns in the shop page.</li>\n</ul>\n<p>The insertion process generates a shortcode which will be replaced by the shop when it is displayed on the website.</p>\n<p>Note: After inserting the ecommerce on a page of your WordPress, it is advisable to copy the URL of the relevant page, and enter in the &#8220;Sell Downloads&#8221; setup section, to allow the users to return to the shop from the product page.</p>\n<p><strong>Shortcode attributes</strong></p>\n<p>Through the shortcode it is possible define some attribute for change the store&#8217;s settings:</p>\n<p>columns: Enter the number of columns to display the products in the store with a grid format. By default the value of &#8220;columns&#8221; attribute is 1.</p>\n<pre><code>    [sell_downloads columns=\"3\"]\n</code></pre>\n<p>filter_by_type: The values allowed are 1 or 0, and shows or hide the filtering by product&#8217;s type in the header section of the store&#8217;s page.</p>\n<pre><code>    [sell_downloads columns=\"3\" filter_by_type=\"1\"]\n</code></pre>\n<p>show_order_by: The values allowed are 1 or 0, and shows or hide the &#8220;Order by&#8221; options in the header section of the store&#8217;s page.</p>\n<pre><code>    [sell_downloads columns=\"3\" show_order_by=\"1\"]\n</code></pre>\n<p>order_by: The values allowed are: plays, price, post_title, post_date. Allows ordering the products in the store&#8217;s page by the criteria defined in the attribute.</p>\n<pre><code>    [sell_downloads columns=\"3\" order_by=\"post_title\"]\n</code></pre>\n<p><strong>Interface for insertion dialog of product (the products list is available as widget to be inserted in the website&#8217;s sidebars)(the option is available only in the premium version of &#8220;Sell Downloads&#8221; plugin)</strong></p>\n<ul>\n<li>Enter the product&#8217;s ID (screenshot-6)</li>\n</ul>\n<p>The insertion process generates a shortcode which will be replaced by the product when it is displayed on the website.</p>\n<p><strong>Interface for insertion dialog of product list (the products list is available as widget to be inserted in the website&#8217;s sidebars)(the option is available only in the premium version of &#8220;Sell Downloads&#8221; plugin)</strong></p>\n<ul>\n<li>Select the type of list: it is possible insert the list of top rated products, the newest or top selling.</li>\n<li>Number of products to show: enter the number of products to display in the list.</li>\n<li>Number of columns: enter the number of columns.<br />\n(screenshot-7)</li>\n</ul>\n<p>The insertion process generates a shortcode which will be replaced by the list of products when it is displayed on the website.</p>\n<p>The products list, and specific products, can be inserted as widgets on sidebars (screenshot-8)</p>\n<p><strong>Sales Statistics</strong></p>\n<p>When a sale takes place, a notification email is sent to the shop manager. However, sales can also be reviewed in Sales Reports. To do this, go to option &#8220;Sell Downloads &gt; Sales Reports&#8221;(screenshot-9)</p>\n<p>The Reports section allows you to filter sales reports over a specific  &hellip;</p>\n",
        "installation": "<p><strong>To install Sell Downloads, follow these steps:</strong></p>\n<ol>\n<li>Download and unzip the plugin</li>\n<li>Upload the entire &#8220;sell-downloads&#8221; directory to the &#8220;/wp-content/plugins /&#8221; directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in &#8220;WordPress&#8221;</li>\n<li>Go to &#8220;Sell Downloads &gt; Sell Downloads Settings&#8221; and set up your store.</li>\n</ol>\n",
        "faq": "\n<dt id='q%3A%20why%20the%20sales%20button%20doesn%27t%20%20appear%3F'>\nQ: Why the sales button doesn&#8217;t  appear?\n</h4>\n<p>\n<p>A: First, go to the settings page of commerce and be sure the PayPal checkbox is checked, and has defined the seller&#8217;s email. Second, be sure the product has a price defined and a file for sell associated.</p>\n</p>\n<dt id='q%3A%20how%20the%20discounts%20are%20treated%20by%20the%20store%3F'>\nQ: How the discounts are treated by the store?\n</h4>\n<p>\n<p>A: If the store has defined a discount and a coupon at the same time, only one is applied to the sale, the biggest of both.</p>\n</p>\n<dt id='q%3A%20how%20to%20download%20all%20purchased%20products%20as%20only%20one%20file%3F'>\nQ: How to download all purchased products as only one file?\n</h4>\n<p>\n<p>A: To download all purchased files as  only one file, is required enabling the zip option from the settings page of &#8220;Sell Downloads&#8221;. The zip feature may be disabled in your website because the required extensions are not present in the PHP of the web server.</p>\n</p>\n<dt id='q%3A%20why%20the%20sell%20downloads%20is%20not%20loading%20on%20page%3F'>\nQ: Why the sell downloads is not loading on page?\n</h4>\n<p>\n<p>A: Verify that the theme used in your website, includes the function wp_footer(); in the template file &#8220;footer.php&#8221; or the template file &#8220;index.php&#8221;</p>\n</p>\n<dt id='q%3A%20what%20can%20i%20do%20if%20the%20sell%20downloads%20directory%20exists%20and%20the%20premium%20version%20of%20plugin%20cannot%20be%20installed%3F'>\nQ: What can I do if the sell downloads directory exists and the premium version of plugin cannot be installed?\n</h4>\n<p>\n<p>A: Go to the plugins section in WordPress, deactivate the free version of Sell Downloads, and delete it ( Don&#8217;t worry, this process don&#8217;t modify the products created with the free version of plugin), and finally install and activate the premium version of plugin.</p>\n</p>\n<dt id='q%3A%20does%20allow%20the%20sell%20downloads%20a%20different%20payment%20gateway%20than%20paypal%3F'>\nQ: Does allow the sell downloads a different payment gateway than PayPal?\n</h4>\n<p>\n<p>A: I&#8217;m sorry, but the current version of plugin allows PayPal only.</p>\n</p>\n<dt id='q%3A%20can%20the%20customers%20pay%20directly%20with%20its%20credit%20cards%3F'>\nQ: Can the customers pay directly with its credit cards?\n</h4>\n<p>\n<p>A: The restriction is imposed by PayPal. Please, check that your PayPal account allow to charge directly from the credit cards of customers.</p>\n</p>\n<dt id='q%3A%20is%20possible%20modify%20the%20appearance%20of%20sell%20downloads%20products%3F'>\nQ: Is possible modify the appearance of sell downloads products?\n</h4>\n<p>\n<p>A: The design of each section of Sell Downloads, is determined from templates located in &#8220;/wp-content/plugins/sell-downloads/sd-templates&#8221;.</p>\n<p>The &#8220;sd-templates&#8221; directory contains multiple files.</p>\n<p>The template files:</p>\n<ul>\n<li>product.tpl.html is used in the store page.</li>\n<li>product_single.tpl.html is used in particular pages of products.</li>\n<li>product_multiple.tpl.html is used in pages of multiple entries like: archives and search result page.</li>\n</ul>\n</p>\n<dt id='q%3A%20is%20possible%20promote%20a%20product%2C%20or%20products%20list%3F'>\nQ: Is possible promote a product, or products list?\n</h4>\n<p>\n<p>A: It is possible promote a product or products list, from the website&#8217;s sidebars, or directly from the content of pages or posts.</p>\n<p>To promote the products on sidebars, go to the widgets section, and inserts the corresponding widget on sidebar.</p>\n<p>To promote the products from the content of pages and posts, go to the page and press the corresponding icon over the contents editor.</p>\n</p>\n<dt id='q%3A%20are%20safe%20the%20products%27%20downloads%3F'>\nQ: Are safe the products&#8217; downloads?\n</h4>\n<p>\n<p>A: The security in the access to products files is determined in different ways.</p>\n<ul>\n<li>The products files can&#8217;t be accessed directly. The purchased files are stored in a special directory called sd-downloads, the sd-downloads directory includes a .htaccess file that forbid the access from browser. The files can be accessed only through a server side script that validates the purchase.</li>\n<li>The Store determines the validity of  download links based in three options, available in the settings page of plugin.<br />\n&#8212; It is possible define a time period, in days, where a download link is considered valid. If a user tries to download a purchased product, the Store checks the date of purchasing.<br />\n&#8212; It is possible define a limit of downloads by purchase. If a user tries to download a product, the Sell Downloads checks how many downloads have been made.<br />\n&#8212; The Store may be configured to request the email address used in the purchasing to check the validity of download link.</li>\n</ul>\n</p>\n<dt id='q%3A%20can%20i%20customize%20the%20store%27s%20design%3F'>\nQ: Can I customize the store&#8217;s design?\n</h4>\n<p>\n<p>A: The plugin includes some different designs that can be selected through the settings option &#8220;Store Layout&#8221;, but you can create a new once, duplicating an of available store&#8217;s layouts, and edit its style.css file</p>\n</p>\n<dt id='q%3A%20how%20to%20configure%20the%20ipn%20on%20paypal%20sandbox%20%3F'>\nQ: How to configure the IPN on PayPal Sandbox ?\n</h4>\n<p>\n<p>A: <a href=\"https://www.paypal.com/cgi-bin/webscr?cmd=p/sell/ipn-test-outside\" title=\"Configuring the IPN on PayPal Sandbox\" rel=\"nofollow ugc\">https://www.paypal.com/cgi-bin/webscr?cmd=p/sell/ipn-test-outside</a></p>\n</p>\n<dt id='q%3A%20is%20possible%20to%20search%20the%20products%20by%20their%20types%2C%20from%20the%20search%20box%20of%20my%20website%3F'>\nQ: Is possible to search the products by their types, from the search box of my website?\n</h4>\n<p>\n<p>A: Yes, that&#8217;s possible. The products types are taxonomies, and for searching by the products&#8217; taxonomies, go to the settings page of the store, and tick the checkbox: &#8220;Allow searching by taxonomies&#8221;, and that&#8217;s all.</p>\n</p>\n\n",
        "changelog": "<h4>1.1.7</h4>\n<ul>\n<li>Improves the Gutenberg blocks.</li>\n<li>Fixes an issue processing the store shortcode attributes.</li>\n</ul>\n<h4>1.1.6</h4>\n<ul>\n<li>Modifies the group by processing in the sales reports.</li>\n</ul>\n<h4>1.1.5</h4>\n<ul>\n<li>Fixes a conflict in the activation process with WP6.5.</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Preserves the original files&#8217; names.</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Modifies the integration with the payment gateways.</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Modifies the module that identifies local files.</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Modifies the links to IPN documentation.</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Fixes deprecated notices in the latest version of PHP.</li>\n</ul>\n<h4>1.0.150</h4>\n<ul>\n<li>Modifies the banner module.</li>\n</ul>\n<h4>1.0.149</h4>\n<ul>\n<li>Clear session variables when editing the Music Store page.</li>\n</ul>\n<h4>1.0.148</h4>\n<ul>\n<li>Modifies the integration with Elementor to ensure compatibility with the latest version of Elementor.</li>\n</ul>\n<h4>1.0.147</h4>\n<ul>\n<li>Modifies the register post type to hide the description from the archive page.</li>\n</ul>\n<h4>1.0.146</h4>\n<ul>\n<li>Improves the plugin security.</li>\n</ul>\n<h4>1.0.145</h4>\n<ul>\n<li>Fixes a minor issue in the integration with the payment gateways.</li>\n</ul>\n<h4>1.0.144</h4>\n<ul>\n<li>Fixes a warning.</li>\n</ul>\n<h4>1.0.143</h4>\n<ul>\n<li>Fixes an issue with the products list in the admin section.</li>\n</ul>\n<h4>1.0.142</h4>\n<ul>\n<li>Implements new validation rules to improves the plugin security.</li>\n</ul>\n<h4>1.0.141</h4>\n<ul>\n<li>Modifies functions deprecated by the latest Elementor update.</li>\n</ul>\n<h4>1.0.140</h4>\n<ul>\n<li>Minor changes in the product&#8217;s appearance.</li>\n<li>Modifies the shopping cart page in the commercial version of the plugin.</li>\n</ul>\n<h4>1.0.139</h4>\n<ul>\n<li>Modifies the Elementor widget.</li>\n</ul>\n<h4>1.0.138</h4>\n<ul>\n<li>Fixes a minor issue in the PDF viewer for products demos.</li>\n</ul>\n<h4>1.0.137</h4>\n<ul>\n<li>Fixes the issue of the invalid characters into the products&#8217; names in the integration with PayPal.</li>\n</ul>\n<h4>1.0.136</h4>\n<ul>\n<li>Modifies the Elementor widget.</li>\n</ul>\n<h4>1.0.135</h4>\n<ul>\n<li>Includes new options in the permalinks settings to modify the slugs for products and taxonomies.</li>\n</ul>\n<h4>1.0.134</h4>\n<ul>\n<li>Allows entering a default cover to use with products without an image associated.</li>\n</ul>\n<h4>1.0.133</h4>\n<ul>\n<li>Uses the featured images of products if they don&#8217;t have associated covers.</li>\n</ul>\n<h4>1.0.132</h4>\n<ul>\n<li>Modifies the management of transients.</li>\n</ul>\n<h4>1.0.131</h4>\n<ul>\n<li>Allows to insert products.</li>\n<li>Improves the Gutenberg integration.</li>\n</ul>\n<h4>1.0.130</h4>\n<ul>\n<li>Improves the store&#8217;s appearance on mobile devices.</li>\n</ul>\n<h4>1.0.129</h4>\n<ul>\n<li>Modify manually registered sales to allow sending the email to the buyer with the download link.</li>\n</ul>\n<h4>1.0.128</h4>\n<ul>\n<li>Includes the Troubleshoot section in the store&#8217;s settings to fix a conflict with some servers settings.</li>\n</ul>\n<h4>1.0.127</h4>\n<ul>\n<li>Fixes a conflict with Elementor.</li>\n</ul>\n<h4>1.0.126</h4>\n<ul>\n<li>Modifies the payment processing to improves the users&#8217; feedbacks against the delays in PayPal notifications.</li>\n</ul>\n<h4>1.0.125</h4>\n<ul>\n<li>Includes a new feature in the store&#8217;s settings to limit the access to the free products to registered users only.</li>\n</ul>\n<h4>1.0.124</h4>\n<ul>\n<li>Includes a new section in the products&#8217; settings to emulate manual purchases.</li>\n</ul>\n<h4>1.0.123</h4>\n<ul>\n<li>Fixes an issue in the Layout 1.</li>\n</ul>\n<h4>1.0.122</h4>\n<ul>\n<li>Modifies the styles to avoid visual conflicts with currencies that must be shown in uppercase, such as CHF.</li>\n</ul>\n<h4>1.0.121</h4>\n<ul>\n<li>Allows to associate multiple images with the products and display images pop-up in the products&#8217; pages.</li>\n</ul>\n<h4>1.0.120</h4>\n<ul>\n<li>Improves the store&#8217;s accessibility.</li>\n</ul>\n<h4>1.0.119</h4>\n<ul>\n<li>Fixes an issue in the sales reports module for entering manual purchases.</li>\n</ul>\n<h4>1.0.118</h4>\n<ul>\n<li>Modifies the scripts blocks to prevent the uncaught errors in other plugins affect to the Store.</li>\n</ul>\n<h4>1.0.117</h4>\n<ul>\n<li>Modifies the code that generates the download and cart pages.</li>\n</ul>\n<h4>1.0.116</h4>\n<ul>\n<li>Checks a possible issue with the database structure, and fixes it.</li>\n</ul>\n<h4>1.0.115</h4>\n<ul>\n<li>Includes a new section in the sales reports to allow entering manual purchases.</li>\n</ul>\n<h4>1.0.114</h4>\n<h4>1.0.113</h4>\n<ul>\n<li>Modifies the management of the session&#8217;s variables.</li>\n</ul>\n<h4>1.0.112</h4>\n<ul>\n<li>Includes a new attribute in the products settings for selling them individually, are associated to them a quantity field.</li>\n</ul>\n<h4>1.0.111</h4>\n<ul>\n<li>Replaces the buy buttons images with texts and css, allowing translate their texts and modify their designs.</li>\n</ul>\n<h4>1.0.110</h4>\n<ul>\n<li>Fixes an issue in the database.</li>\n</ul>\n<h4>1.0.109</h4>\n<ul>\n<li>Modifies the layout 3.</li>\n<li>Fixes some conflicts with the themes&#8217; styles.</li>\n<li>Highlights the most important attributes in the products and store&#8217;s settings.</li>\n<li>Increases the timeout for accessing to the files hosted on external domains.</li>\n</ul>\n<h4>1.0.108</h4>\n<ul>\n<li>Includes a new attribute in the store&#8217;s settings for controlling the additional attribute to prevent the pages cache.</li>\n</ul>\n<h4>1.0.107</h4>\n<ul>\n<li>Fixes an issue with the notification emails.</li>\n</ul>\n<h4>1.0.106</h4>\n<ul>\n<li>Allows to associate custom fields to the products.</li>\n</ul>\n<h4>1.0.105</h4>\n<ul>\n<li>Adapts the plugin&#8217;s blocks to the new version of the Gutenberg editor.</li>\n</ul>\n<h4>1.0.104</h4>\n<ul>\n<li>Includes a new section to customize the products templates.</li>\n</ul>\n<h4>1.0.103</h4>\n<ul>\n<li>Includes a new option in the sales reports to resend the download link to the buyer and reset the number of downloads.</li>\n</ul>\n<h4>1.0.102</h4>\n<ul>\n<li>Includes a list of filters to allow modify the products data before display them:</li>\n</ul>\n<p>sell-downloads-title<br />\nsell-downloads-votes<br />\nsell-downloads-cover-url<br />\nsell-downloads-time<br />\nsell-downloads-year<br />\nsell-downloads-info<br />\nsell-downloads-content</p>\n<h4>1.0.101</h4>\n<ul>\n<li>Modifies the styles of players.</li>\n</ul>\n<h4>1.0.100</h4>\n<ul>\n<li>Includes a new module to prevent the WP Super Cache plugin cached the download page, and other particular pages of the store.</li>\n</ul>\n<h4>1.0.99</h4>\n<ul>\n<li>Modifies the module for debugging the payments.</li>\n</ul>\n<h4>1.0.98</h4>\n<ul>\n<li>Includes new Order By options.</li>\n</ul>\n<h4>1.0.97</h4>\n<ul>\n<li>Modifies the access to the demos.</li>\n</ul>\n<h4>1.0.96</h4>\n<ul>\n<li>Includes new options in the store&#8217;s settings to decide the images&#8217; size of products&#8217; covers.</li>\n</ul>\n<h4>1.0.95</h4>\n<ul>\n<li>Includes a new section in the store&#8217;s settings to make easier the debugging of payments notifications.</li>\n</ul>\n<h4>1.0.94</h4>\n<ul>\n<li>Fixes a notice in the products&#8217; settings.</li>\n<li>Includes new attributes in the online demos to prevent the size of videos break the page&#8217;s structure.</li>\n</ul>\n<h4>1.0.93</h4>\n<ul>\n<li>Fixes a warning saving the products changes.</li>\n</ul>\n<h4>1.0.92</h4>\n<ul>\n<li>Includes two new constant that can be included in the notification emails: %DATETIME% that would be replaced by the purchase date/time, and &#8220;%BUYERNAME%&#8221; that would be replaced by the first name and last name of the buyer, if there is an user in the website with payer&#8217;s email.</li>\n</ul>\n<h4>1.0.91</h4>\n<ul>\n<li>Fixes a conflict with third party plugins.</li>\n</ul>\n<h4>1.0.90</h4>\n<ul>\n<li>Includes the integration with the BeaverBuilder Editor.</li>\n</ul>\n<h4>1.0.89</h4>\n<ul>\n<li>Removes unnecessary code for the recent versions of WordPress.</li>\n<li>Corrects the roles of users that can create products (similar to other ecommerce plugins). Hiding the options from the WordPress menu for those users without access to them.</li>\n</ul>\n<h4>1.0.88</h4>\n<ul>\n<li>Assigns the title attribute to the buttons for screen readers compatibility.</li>\n<li>The super admin can dissable the attribute that allows associate zip files to the songs, defining the SD_INCLUDE_ZIP_ATTRIBUTE constant as false into the wp-config.php file.</li>\n</ul>\n<h4>1.0.87</h4>\n<ul>\n<li>Includes an attribute in the store&#8217;s settings, accessible only by the website&#8217;s administrators, for enabling or not, the option for accepting zipped files in the products, as the files for selling.</li>\n</ul>\n<h4>1.0.86</h4>\n<ul>\n<li>Improves the plugin&#8217;s security.</li>\n</ul>\n<h4>1.0.85</h4>\n<ul>\n<li>Fixes some minor errors.</li>\n</ul>\n<h4>1.0.84</h4>\n<ul>\n<li>Modifies the module of the IPN script.</li>\n</ul>\n<h4>1.0.83</h4>\n<ul>\n<li>Allows to define taxes from the store&#8217;s settings.</li>\n</ul>\n<h4>1.0.82</h4>\n<ul>\n<li>Fixes some issues.</li>\n</ul>\n<h4>1.0.81</h4>\n<ul>\n<li>Improves the identification of the special pages, like the download page, and the shopping cart page in the commercial version of the plugin.</li>\n</ul>\n<h4>1.0.80</h4>\n<ul>\n<li>Improves the module that protects the store.</li>\n<li>Fixes some notices in the download process of purchased files.</li>\n</ul>\n<h4>1.0.79</h4>\n<ul>\n<li>Modifies the module to download the purchased files.</li>\n<li>Modifies the module that the determines the default From and Destination addresses for the notification emails.</li>\n</ul>\n<h4>1.0.78</h4>\n<ul>\n<li>Fixes some minor errors.</li>\n</ul>\n<h4>1.0.77</h4>\n<ul>\n<li>Implements new widgets for integrating the plugin with Page Builder by SiteOrigin.</li>\n</ul>\n<h4>1.0.76</h4>\n<ul>\n<li>Implements a real review module. Now the popularity is decided by the users, clicking on the corresponding star icon associated to the products, instead determine them automatically.</li>\n</ul>\n<h4>1.0.75</h4>\n<ul>\n<li>Modifies the blocks for the Gutenberg editor,  preparing the plugin for WordPress 5.1</li>\n</ul>\n<h4>1.0.74</h4>\n<ul>\n<li>Accepts the new &#8220;exclude&#8221; attribute in the [sell_downloads] shortcode to exclude specific products from the store. The values of the attribute are the products&#8217; ids separated by comma sign.</li>\n<li>Allows to define the new attribute from the different editors (The classic WordPress editor, Gutenberg editor and Elementor).</li>\n</ul>\n<h4>1.0.73</h4>\n<ul>\n<li>Modifies the language files and plugin headers.</li>\n</ul>\n<h4>1.0.72</h4>\n<ul>\n<li>Includes new widgets to allow the specific integration with the Elementor editor.</li>\n</ul>\n<h4>1.0.71</h4>\n<ul>\n<li>Includes a new attribute in the store&#8217;s settings for controlling the popularity of products.</li>\n</ul>\n<h4>1.0.70</h4>\n<ul>\n<li>Modifies the way the shortcodes are replaced to create the preview of the store and products in the Gutenberg editor.</li>\n</ul>\n<h4>1.0.69</h4>\n<ul>\n<li>Improves the integration with the Gutenberg Editor.</li>\n<li>Modifies the module to download the purchased products to fix some issues in servers with low resources.</li>\n</ul>\n<h4>1.0.68</h4>\n<ul>\n<li>Modifies the styles to solve some conflicts with different themes.</li>\n</ul>\n<h4>1.0.67</h4>\n<ul>\n<li>Fixes an issue between the Promote Banner and the official distribution of WP5.0</li>\n</ul>\n<h4>1.0.66</h4>\n<ul>\n<li>Modifies the store&#8217;s settings to allow detect easier the possible problems, and includes a video to teach users how configure their PayPal accounts.</li>\n</ul>\n<h4>1.0.65</h4>\n<ul>\n<li>Fixes a conflict with the &#8220;Speed Booster Pack&#8221; plugin.</li>\n</ul>\n<h4>1.0.64</h4>\n<ul>\n<li>Fixes an issue that displays a block of code in the download page.</li>\n</ul>\n<h4>1.0.63</h4>\n<ul>\n<li>Allows to upload compressed files as the files for selling.</li>\n<li>Allows to include a special text in the download page: {download-links-here} to be replaced by the download links. The special text gives the websites owners more control over the format of the download pages. If the special text is not inserted the download links are concatenated to the download page&#8217;s content.</li>\n<li>Fixes an issue checking the memory available in the PHP script.</li>\n</ul>\n<h4>1.0.62</h4>\n<ul>\n<li>Removes the attribute CrossOrigin from the audio and video tags.</li>\n<li>Fixes an issue in the return urls.</li>\n</ul>\n<h4>1.0.61</h4>\n<ul>\n<li>Hides the promotion banner for the majority of roles and fixes a conflict between the promotion banner and the Gutenberg editor.</li>\n</ul>\n<h4>1.0.60</h4>\n<ul>\n<li>Reduces the access to database.</li>\n</ul>\n<h4>1.0.59</h4>\n<ul>\n<li>Fixes an issue with indices in the database tables.</li>\n<li>Improves the database queries.</li>\n</ul>\n<h4>1.0.58</h4>\n<ul>\n<li>Modifies the wizard for the initial configuration.</li>\n</ul>\n<h4>1.0.57</h4>\n<ul>\n<li>Improves the store configuration process.</li>\n</ul>\n<h4>1.0.56</h4>\n<ul>\n<li>Improves the store configuration.</li>\n<li>Modifies the deactivation process to allow the users find easier the solution to the usual issues.</li>\n</ul>\n<h4>1.0.55</h4>\n<ul>\n<li>Fixes some notices in the installation process.</li>\n</ul>\n<h4>1.0.54</h4>\n<ul>\n<li>Removes and optimize some queries to increase the plugin&#8217;s performance.</li>\n</ul>\n<h4>1.0.53</h4>\n<ul>\n<li>Modifies the way the client&#8217;s side scripts are executed to prevent the uncaught javascript errors on page affect the Store.</li>\n</ul>\n<h4>1.0.52</h4>\n<ul>\n<li>Removes the invalid characters from the products names before contacting the payment gateway.</li>\n</ul>\n<h4>1.0.51</h4>\n<ul>\n<li>Allows to define the download links valid for times intervals less than 1.</li>\n<li>Fixes an issue with the loopback requests when are being edited the code of plugins or themes in the WordPress editor.</li>\n</ul>\n<h4>1.0.50</h4>\n<ul>\n<li>Includes the crossOrigin attribute in the audio and video tags for playing files in external domains.</li>\n</ul>\n<h4>1.0.49</h4>\n<ul>\n<li>Allows the access to reports and store&#8217;s settings only to the websites administrators.</li>\n</ul>\n<h4>1.0.48</h4>\n<ul>\n<li>Removes the copy of &#8220;MediaElement&#8221; player distributed with the plugin to use the version distributed with WordPress.</li>\n</ul>\n<h4>1.0.47</h4>\n<ul>\n<li>Modifies the code that is considered deprecated by PHP7.</li>\n</ul>\n<h4>1.0.46</h4>\n<ul>\n<li>Allows the integration with the Gutenberg editor (the next editor distributed with WordPress).</li>\n</ul>\n<h4>1.0.45</h4>\n<ul>\n<li>Includes a new filter for the &#8220;get_the_excerpt&#8221; hook.</li>\n</ul>\n<h4>1.0.44</h4>\n<ul>\n<li>Sends the Content-Type header when the Demo file is downloaded to prevent conflicts with some web servers that identify the demo files as texts, even when they are binaries.</li>\n</ul>\n<h4>1.0.43</h4>\n<ul>\n<li>Applies the same charset used by the database to the plugin&#8217;s tables.</li>\n</ul>\n<h4>1.0.42</h4>\n<ul>\n<li>Modifies the store&#8217;s styles, specifically its appearance in small screens, like mobiles devices.</li>\n<li>Includes a new predefined layout.</li>\n</ul>\n<h4>1.0.41</h4>\n<ul>\n<li>Allows publishing comments in the store&#8217;s products.</li>\n<li>Allows to integrate the store with &#8220;Affiliate Royale&#8221;.</li>\n</ul>\n<h4>1.0.40</h4>\n<ul>\n<li>Modifies the module for accessing the WordPress reviews section.</li>\n</ul>\n<h4>1.0.39</h4>\n<ul>\n<li>Minifies the template files.</li>\n<li>Includes languages files for Italian (thanks to @passegua)</li>\n</ul>\n<h4>1.0.38</h4>\n<ul>\n<li>Uses the internationalization functions into the template files, to allow translating these texts too.</li>\n</ul>\n<h4>1.0.37</h4>\n<ul>\n<li>Modifies the module to determine if the file for selling is local to the website.</li>\n<li>Includes the languages directory and the default language files for English.</li>\n<li>Improves the access to the plugin documentation.</li>\n</ul>\n<h4>1.0.36</h4>\n<ul>\n<li>Modifies the module that sanitizes the products attributes before send them to the browser.</li>\n</ul>\n<h4>1.0.35</h4>\n<ul>\n<li>Modifies the IPN script to satisfy the new PayPal requirements.</li>\n</ul>\n<h4>1.0.34</h4>\n<ul>\n<li>Fixes an issue in the regular expression that checks the uploaded files.</li>\n</ul>\n<h4>1.0.33</h4>\n<ul>\n<li>Strips all dangerous tags from the products&#8217; attributes.</li>\n</ul>\n<h4>1.0.32</h4>\n<ul>\n<li>Strip tags from the terms in the File Types taxonomy.</li>\n<li>Excludes the invalid files types from the lists of files to associate with the products.</li>\n</ul>\n<h4>1.0.31</h4>\n<ul>\n<li>Fixes a warning message accessing to QUERY_STRING in the store&#8217;s pages, in stores with multiple pages.</li>\n</ul>\n<h4>1.0.30</h4>\n<ul>\n<li>Fixes an issue with servers where were enabled the Magic Quotes.</li>\n</ul>\n<h4>1.0.29</h4>\n<ul>\n<li>Allows to enter the Facebook App id for sharing the website&#8217;s links in Facebook.</li>\n</ul>\n<h4>1.0.28</h4>\n<ul>\n<li>Modifies the code in the IPN that checks the price of purchased products.</li>\n</ul>\n<h4>1.0.27</h4>\n<ul>\n<li>Fixes an issue in PHP copying huge files.</li>\n</ul>\n<h4>1.0.26</h4>\n<ul>\n<li>Includes try/catch blocks to prevent PHP fatal errors caused by PHPMailer.</li>\n<li>Fixes an issue caused by the files with apostrophes in their names.</li>\n</ul>\n<h4>1.0.25</h4>\n<ul>\n<li>Sanitizes all data submitted by the users, and escapes all outputs to the browser to prevent possible security vulnerabilities.</li>\n<li>Modifies the behavior of the URLs friendly.</li>\n</ul>\n<h4>1.0.24</h4>\n<ul>\n<li>Includes the &#8220;Category&#8221; taxonomy for products.</li>\n<li>Allows filtering by category in the store&#8217;s pages.</li>\n<li>Allows to define the &#8220;category&#8221; attribute in the store&#8217;s shortcode for filtering the products by default.</li>\n<li>Corrects some issues in the store&#8217;s layouts.</li>\n</ul>\n<h4>1.0.23</h4>\n<ul>\n<li>Improves the appearance of the Dark Layout.</li>\n</ul>\n<h4>1.0.22</h4>\n<ul>\n<li>Modifies some deprecated jQuery functions.</li>\n</ul>\n<h4>1.0.21</h4>\n<ul>\n<li>Changes the order that resources are loaded to prevent conflicts with themes that are not prepared for WP4.5</li>\n</ul>\n<h4>1.0.20</h4>\n<ul>\n<li>\n<p>Escape all attributes, SQL queries, and URL parameters, to prevent some vulnerabilities.= 1.0.23 =</p>\n</li>\n<li>\n<p>Improves the appearance of the Dark Layout.</p>\n</li>\n</ul>\n<h4>1.0.22</h4>\n<ul>\n<li>Modifies some deprecated jQuery functions.</li>\n</ul>\n<h4>1.0.21</h4>\n<ul>\n<li>Changes the order that resources are loaded to prevent conflicts with themes that are not prepared for WP4.5</li>\n</ul>\n<h4>1.0.20</h4>\n<ul>\n<li>Escape all attributes, SQL queries, and URL parameters, to prevent some vulnerabilities.</li>\n</ul>\n<h4>1.0.19</h4>\n<ul>\n<li>Modifies the download process to improve the performance and save the server&#8217;s resources.</li>\n</ul>\n<h4>1.0.18</h4>\n<ul>\n<li>Increases the plugin&#8217;s security. Allows to download only files with the mime types supported by the website.</li>\n</ul>\n<h4>1.0.17</h4>\n<ul>\n<li>Optimize the queries for searching.</li>\n</ul>\n<h4>1.0.16</h4>\n<ul>\n<li>Takes into account the taxes in the IPN script.</li>\n</ul>\n<h4>1.0.15</h4>\n<ul>\n<li>Reduces the penalization time by IP if the download link is invalid.</li>\n</ul>\n<h4>1.0.14</h4>\n<ul>\n<li>Allows searching by the taxonomies of the products.</li>\n<li>Includes metatags for including the correct information when the product is shared in Facebook.</li>\n</ul>\n<h4>1.0.13</h4>\n<ul>\n<li>Allows to enable/disable the PayPal Sandbox in the store&#8217;s settings for testing the purchases</li>\n</ul>\n<h4>1.0.12</h4>\n<ul>\n<li>Fixes an issue in the use of friendly URLs in the store&#8217;s products.</li>\n</ul>\n<h4>1.0.11</h4>\n<ul>\n<li>Corrects an issue with the use of the predefined layouts in stores protected with Secure Socket Layer (SSL).</li>\n<li>Corrects some messages in the store&#8217;s settings.</li>\n</ul>\n<h4>1.0.10</h4>\n<ul>\n<li>Corrects an issue with the pagination in the store&#8217;s pages.</li>\n</ul>\n<h4>1.0.9</h4>\n<ul>\n<li>Prevents an error in the installation process, when the user&#8217;s privileges are not sufficient.</li>\n</ul>\n<h4>1.0.8</h4>\n<ul>\n<li>Security update to prevent the use of brute force to identify the purchase IDs</li>\n</ul>\n<h4>1.0.7</h4>\n<ul>\n<li>Corrects a possible vulnerability in the download of purchased files.</li>\n<li>Corrects an issue with files for selling with spaces in their names.</li>\n</ul>\n<h4>1.0.6</h4>\n<ul>\n<li>Corrects an issue in the store&#8217;s pagination.</li>\n<li>Selects smaller images as covers of the products to improve the loading speed of the store&#8217;s page.</li>\n<li>Allows to use friendly URLs, or not, in the products pages.</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Corrects a conflict in the sales reports with the Music Store plugin.</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>Modifies the styles of Dark layout.</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Includes the Featured Image as part of products, because some plugins and themes use the featured Images on post types.</li>\n<li>Uses functions included since WordPress 3.5.0, that modifies the requirements.</li>\n<li>Optimize the plugins code.</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Optimize the plugins code.</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Improves the plugin documentation.</li>\n<li>Fixes a compatibility issue with the &#8220;Music Store&#8221; plugin.</li>\n<li>Corrects the decimal digits in the products prices.</li>\n<li>Increases the security of purchased files.</li>\n<li>Removes the &#8220;Description&#8221; tab from the product&#8217;s page, if the product has not a description defined.</li>\n<li>Allows ordering the products by date.</li>\n<li>Allows inserting separated stores in different pages of website.</li>\n<li>Corrects an issue displaying free products.</li>\n<li>Optimizes the queries to database.</li>\n<li>Modifies the design of the attribute: product&#8217;s type, in the store&#8217;s page.</li>\n<li>Includes the products ID as a column in the list of products.</li>\n<li>Makes a memory checking to avoid errors downloading the purchased files.</li>\n<li>Fixes an issue checking the downloads permissions.</li>\n<li>Allows download large files.</li>\n<li>Improves the store&#8217;s design in themes with responsive designs.</li>\n<li>Throws the correct content-type header in the download process.</li>\n<li>Includes new filtering options in the sales reports.</li>\n<li>Includes charts in the sales reports to detect the sales trends easily.</li>\n<li>Includes in the currency list, all currencies allowed by PayPal.</li>\n<li>Allows define a limit in the download of purchased products, and the possibility to reset the counter.</li>\n<li>Includes multiple store&#8217;s layouts.</li>\n<li>Displays a timeout in the download page, if the IPN has not been called, when it is visited.</li>\n</ul>\n<h4>1.0</h4>\n<ul>\n<li>First version released.</li>\n</ul>\n"
    },
    "short_description": "Sell Downloads is an WordPress eCommerce for selling downloadable files: audio, video, documents, pictures all that may be published in Internet.",
    "description": "<p>Sell Downloads features:</p>\n<p>» Sell Downloads is a WordPress eCommerce<br />\n» Allows selling digital files like audio,video,documents,pictures,etc.<br />\n» Allows to filter products by types of files<br />\n» Includes multiple layouts for the store<br />\n» Allows paging and sorting the results by popularity, price or file name<br />\n» Uses PayPal as payment gateway. Payments are SCA ready (Strong Customer Authentication), compatible with the new Payment services (PSD 2) &#8211; Directive (EU)<br />\n» Allows sharing products in social networks (Facebook, Twitter, Google+)<br />\n» Allows to associate additional information to the products<br />\n» Allows to protect the files with the inclusion of a file&#8217;s demo<br />\n» The demo files will be displayed directly on browser, whether are enabled<br />\n  the corresponding plugins in browser</p>\n<p><strong>Sell Downloads</strong> is an  WordPress eCommerce for selling downloadable files: audio, video, documents, pictures all that may be published in Internet. Sell Downloads uses PayPal as payment gateway, making the sale process easy and secure.</p>\n<p>Create an e-commerce for sell digital files never was more easy than with &#8220;Sell Downloads&#8221;, the majority of e-commerce plugins are developed thinking in tangible products and does the sale&#8217;s process very complex. An ecommerce that pretends to sale only digital files must to coexist with data related to tangible products, configure shipping cost, etc, &#8220;Sell Downloads&#8221; doesn&#8217;t need any of previous data. With &#8220;Sell Downloads&#8221; is required only define the PayPal data and the products to sell.</p>\n<p><strong>More about the Main Features:</strong></p>\n<ul>\n<li>Allows selling your digital files via PayPal. PayPal is the payment gateway by excellence, very easy to use and very secure.</li>\n<li>Allows a custom setup of the ecommerce, with ability to filter products by types of files, paging and sorting the results by popularity, price or file name, making of &#8220;Sell Downloads&#8221; a very configurable plugin.</li>\n<li>Allows to insert a specific product in a post or page.</li>\n<li>Allows to associate additional information to the products. For example, if are selling a book and like to associate a link to other books of the same editorial, or a page of reviews from critics, this field would be the option for do it.</li>\n<li>Allows to protect the files with the inclusion of a file&#8217;s demo. Monographies, videos, songs and many other digital files, allow the creation of a version for demo. It is very hard to sell a song if the possible customers never hear at least a part of it, similar happen with videos and its trailers or the monographies and its abstracts.</li>\n<li>Includes a module to track sales statistics. With the statistics module is possible to know the amount of sales, the discounts applied or coupon used, and check the total of earnings by the ecommerce in a period of time. The statistics module allows to display animated charts with specific reports like: sales by currency, country or products.</li>\n</ul>\n<p>The &#8220;Sell Downloads&#8221; plugin allows the specific integration with the following editors:</p>\n<ul>\n<li>Classic WordPress Editor.</li>\n<li>Gutenberg Editor.</li>\n<li>Elementor.</li>\n<li>Page Builder by SiteOrigin.</li>\n<li>BeaverBuilder Editor.</li>\n<li>For other editors, the shortcodes should be inserted using other controls of general purpose, like the controls for inserting HTML or shortcodes.</li>\n</ul>\n<p>The base plugin, available for free from the WordPress Plugin Directory has all the features you need to create a ecommerce for sell downloads on your website.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Quosrug9pgo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Inserting and using the basic &#8220;Sell Downloads&#8221; plugin.</p>\n<p><strong>Premium Features:</strong></p>\n<ul>\n<li>Allows to enable a shopping cart. With a shopping cart is possible to sell multiple products in the same purchase action, the customers will appreciate this feature.</li>\n<li>The product is available as widget to be inserted in the website&#8217;s sidebars.</li>\n<li>Allows to insert a product list in a post or page. The products can be selected between the most rated, the newest, or top selling. The product list is available as widget to be inserted in the website&#8217;s sidebars.</li>\n<li>Allows to define sales discounts. It is usual in the e-commerce create sales campaigns, define discounts for products or events (like mothers day, the Christmas,etc.), to promote the sales. The &#8220;Sell Downloads&#8221; allows to define shop&#8217;s discounts, and display the previous and new prices of products.</li>\n<li>Allows to define discount coupons. The coupons are an excellent tool to know where is the origin of sales and create (like in discounts definition) sales campaings, but directed to a specific sector or website. The coupons are applied to all sales from the ecommerce.</li>\n</ul>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/BG1Y2TSlvms?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Inserting and using the premium &#8220;Sell Downloads&#8221; plugin.</p>\n<p><strong>Demo of Premium Version of Plugin</strong></p>\n<p><a href=\"https://demos.dwbooster.com/sell-downloads/wp-login.php\" title=\"Click to access the administration area demo\" rel=\"nofollow ugc\">https://demos.dwbooster.com/sell-downloads/wp-login.php</a></p>\n<p><a href=\"https://demos.dwbooster.com/sell-downloads/\" title=\"Click to access the Sell Downloads\" rel=\"nofollow ugc\">https://demos.dwbooster.com/sell-downloads/</a></p>\n<p><strong>Are safe the downloads links?</strong></p>\n<p>The security in the access to products files is determined in different ways.</p>\n<ul>\n<li>The products files can&#8217;t be accessed directly. The purchased files are stored in a special directory called sd-downloads, the sd-downloads directory includes a .htaccess file that forbid the access from browser. The files can be accessed only through a server side script that validates the purchase.</li>\n<li>The Store determines the validity of  download links based in three options, available in the settings page of plugin.</li>\n</ul>\n<p>It is possible define a time period, in days, where a download link is considered valid. If a user tries to download a purchased product, the Store checks the date of purchasing.<br />\nThe  Store may be configured to request the email address used in the purchasing to check the validity of download link.</p>\n<p>It is possible define a limit of downloads by purchase. If a user tries to download a product, the Sell Downloads checks how many downloads have been made.</p>\n<p>If you want more information about this plugin don&#8217;t hesitate in checking the plugin&#8217;s website:</p>\n<p><a href=\"http://wordpress.dwbooster.com/content-tools/sell-downloads\" title=\"Sell Downloads\" rel=\"nofollow ugc\">http://wordpress.dwbooster.com/content-tools/sell-downloads</a></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/fkkA1-bs430?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>Inserting a products list, and products, in pages or sidebars of website (only available in the premium version of plugin).</p>\n<h3>Interface</h3>\n<p><strong>Setting up of shop</strong></p>\n<p>Sell Downloads can be set up via the menu: &#8220;Sell Downloads &gt; Sell Downloads Settings&#8221;. The setup screen offers general settings for the shop, allows entering the PayPal data required to process sales and texts that will be used for the email notifications with the download links of the purchased files.</p>\n<p><strong>Settings Interface</strong></p>\n<p>The setup interface of commerce includes the following fields:</p>\n<ul>\n<li>URL of store page: Enter the URL of the webpage where the ecommerce was inserted. The URL of the store will be used to return from the product page to the shop page.</li>\n<li>Allow searching by taxonomies: Modifies the search process of WordPress to allow the products be found by their taxonomies.</li>\n<li>Allow to filter by type: Inserts a field into the shopping webpage that allows to filter products by type (jpg, mp3, doc,&#8230;.)</li>\n<li>Store layout: Allows select one of the multiple layouts available for the store.</li>\n<li>Allow multiple pages: Allows paging through the shop&#8217;s products.</li>\n<li>Items per page: Defines the number of products per page in the commerce&#8217;s page.</li>\n<li>Share in social networks: Display a group of buttons for sharing the products in the social networks(like Facebook, Twitter and Google+)</li>\n<li>Facebook app id for sharing in Facebook: App id for sharing the website&#8217;s links in Facebook.</li>\n</ul>\n<p><strong>Payment gateway data (PayPal)</strong></p>\n<ul>\n<li>Enable PayPal Payments: Allows the sale of products through PayPal.</li>\n<li>PayPal email: Enter the email address associated with the PayPal account.</li>\n<li>Currency: Symbol of the currency in which payments are accepted.</li>\n<li>PayPal language: Preferred language of the PayPal interface.</li>\n<li>PayPal button: Select the PayPal button design.</li>\n<li>Increase the download page security: Requests the email used in product&#8217;s purchase from the download page.</li>\n<li>Download link valid for: Set an expire time for the download links.</li>\n</ul>\n<p><strong>Discount settings applied to the sales of the ecommerce. In the shopping cart the discount is applied to the total sale cost(premium version)</strong></p>\n<ul>\n<li>Percent to discount: Enter the percent to discount to the total sale cost.</li>\n<li>Valid for sales over than: Apply discount to sales superior to this value.</li>\n<li>Valid from (dd/mm/yyyy): Apply discount from the entered date.</li>\n<li>Valid to (dd/mm/yyyy): Apply discount until the entered date.</li>\n<li>Promotional text: Text to promote the discount.</li>\n</ul>\n<p><strong>Coupon settings applied to all sales of the ecommerce(premium version)</strong></p>\n<ul>\n<li>Percent to discount: Enter the percent to discount to the total sale cost.</li>\n<li>Coupon: Enter the coupon code.</li>\n<li>Valid from (dd/mm/yyyy): The coupon is valid from the entered date.</li>\n<li>Valid to (dd/mm/yyyy): The coupon is valid to the entered date.</li>\n</ul>\n<p><strong>Notification Settings</strong>, both for buyers to complete a payment, and the shop manager</p>\n<ul>\n<li>Notification &#8220;from&#8221; email: E-mail address that will appear as the sender of notifications.</li>\n<li>Send notification to email: Email address where a notification is sent after each sale.</li>\n<li>Subject of user confirmation email: Subject of the confirmation email sent to the customer when making the purchase.</li>\n<li>Email confirmation to user: Body of message sent to the customer when making the purchase. The message should include the tag  %INFORMATION% which will be replaced by the purchase data, like the download link.</li>\n<li>Subject of email notification to admin: Subject of email notification sent to the administrator when a purchase is made.</li>\n<li>Email notification to admin: Body of the email message sent to the administrator when a purchase is made. The message text should include the tag  %INFORMATION%, which will be replaced by the purchase data.</li>\n</ul>\n<p><strong>Affiliate Royale Integration</strong>, if the Affiliate Royale plugin is installed on the website, and you want integrate it with the store.</p>\n<p><strong>Creating product for commerce</strong></p>\n<p>The shop allows to sell possible digital files (video, audio, documents, etc). To create a product press the menu option &#8220;Sell Downloads &gt; Products for Sale&#8221;. Initially it displays the list of products entered previously and a set of data associated with the product: Product Name, File Type, Downloads, Purchases and Date (screenshot-2)</p>\n<p>To enter a new product/file to the shop press &#8220;Add New&#8221;.</p>\n<p>The interface for entering data pertaining to a product is described below (screenshot-3):</p>\n<p><strong>Product&#8217;s data</strong></p>\n<ul>\n<li>Enter Title Here: Enter the title-name of the product to display in the shop page and the product page.</li>\n<li>Description: Description of the product. This field is optional, but offers the opportunity to provide additional information about the product, this information is displayed only in the product page.</li>\n<li>Sales Price: Retail price of the product.</li>\n<li>File for sale: URL of the file to sell. The button associated with the field displays the WordPress media gallery making it easy to select the file.</li>\n<li>File for demo: URL file demo. The file for demo may be accessed from the ecommerce page.The button associated with the field displays the WordPress media gallery making it easy to select the file.</li>\n<li>File Type: Select a file type from the list or enter a new one if it is not yet on the list. The file type allow filtering the products in the shop page.</li>\n<li>Image: URL of an image that represents the product, the product image is shown in the ecommerce page and product page. The button associated with the field displays the WordPress media gallery making it easy to select the file.</li>\n<li>Duration: Enter a value with time format. Useful for Audio and Video files. With other files types the fields may be let empty.</li>\n<li>Publication Year: Enter a value with year format. Useful for files associated with a date, as the creation or publication date , for example a book or monograph.</li>\n<li>Additional Information: URL of a webpage with additional information about the product.</li>\n</ul>\n<p><strong>Programming a discount for the specific product(premium version)</strong></p>\n<ul>\n<li>New price: The new price to apply to the product. The old and new prices will shown in pages of the ecommerce and the specific product.</li>\n<li>Valid from (dd/mm/yyyy): Apply discount from the entered date.</li>\n<li>Valid to (dd/mm/yyyy): Apply discount until the entered date.</li>\n<li>Promotional text: Text to promote the discount. The promoting text will be shown in the shop page.</li>\n</ul>\n<p><strong>Publishing the &#8220;Sell Downloads&#8221; ecommerce</strong></p>\n<p>The &#8220;Sell Downloads&#8221; ecommerce can be posted on a page or post of WordPress. To insert the &#8220;Sell Downloads&#8221; shop go to the relevant section (page or post) and press the &#8220;Sell Downloads&#8221; button above the  content editor of post/page(screenshot-4), the action displays a setup screen (screenshot-5)</p>\n<p><strong>Interface for insertion dialog</strong></p>\n<ul>\n<li>Filter results by products type: by default, displays only products that belong to a specified type.</li>\n<li>Columns: Defines the number of columns in the shop page.</li>\n</ul>\n<p>The insertion process generates a shortcode which will be replaced by the shop when it is displayed on the website.</p>\n<p>Note: After inserting the ecommerce on a page of your WordPress, it is advisable to copy the URL of the relevant page, and enter in the &#8220;Sell Downloads&#8221; setup section, to allow the users to return to the shop from the product page.</p>\n<p><strong>Shortcode attributes</strong></p>\n<p>Through the shortcode it is possible define some attribute for change the store&#8217;s settings:</p>\n<p>columns: Enter the number of columns to display the products in the store with a grid format. By default the value of &#8220;columns&#8221; attribute is 1.</p>\n<pre><code>    [sell_downloads columns=\"3\"]\n</code></pre>\n<p>filter_by_type: The values allowed are 1 or 0, and shows or hide the filtering by product&#8217;s type in the header section of the store&#8217;s page.</p>\n<pre><code>    [sell_downloads columns=\"3\" filter_by_type=\"1\"]\n</code></pre>\n<p>show_order_by: The values allowed are 1 or 0, and shows or hide the &#8220;Order by&#8221; options in the header section of the store&#8217;s page.</p>\n<pre><code>    [sell_downloads columns=\"3\" show_order_by=\"1\"]\n</code></pre>\n<p>order_by: The values allowed are: plays, price, post_title, post_date. Allows ordering the products in the store&#8217;s page by the criteria defined in the attribute.</p>\n<pre><code>    [sell_downloads columns=\"3\" order_by=\"post_title\"]\n</code></pre>\n<p><strong>Interface for insertion dialog of product (the products list is available as widget to be inserted in the website&#8217;s sidebars)(the option is available only in the premium version of &#8220;Sell Downloads&#8221; plugin)</strong></p>\n<ul>\n<li>Enter the product&#8217;s ID (screenshot-6)</li>\n</ul>\n<p>The insertion process generates a shortcode which will be replaced by the product when it is displayed on the website.</p>\n<p><strong>Interface for insertion dialog of product list (the products list is available as widget to be inserted in the website&#8217;s sidebars)(the option is available only in the premium version of &#8220;Sell Downloads&#8221; plugin)</strong></p>\n<ul>\n<li>Select the type of list: it is possible insert the list of top rated products, the newest or top selling.</li>\n<li>Number of products to show: enter the number of products to display in the list.</li>\n<li>Number of columns: enter the number of columns.<br />\n(screenshot-7)</li>\n</ul>\n<p>The insertion process generates a shortcode which will be replaced by the list of products when it is displayed on the website.</p>\n<p>The products list, and specific products, can be inserted as widgets on sidebars (screenshot-8)</p>\n<p><strong>Sales Statistics</strong></p>\n<p>When a sale takes place, a notification email is sent to the shop manager. However, sales can also be reviewed in Sales Reports. To do this, go to option &#8220;Sell Downloads &gt; Sales Reports&#8221;(screenshot-9)</p>\n<p>The Reports section allows you to filter sales reports over a specific  &hellip;</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/sell-downloads.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-01.jpg?rev=787702",
            "caption": "Sell Downloads Item"
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-02.jpg?rev=787702",
            "caption": "Sell Downloads Product Section"
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-03.jpg?rev=787702",
            "caption": "Product Edition Interface"
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-04.jpg?rev=2016195",
            "caption": "Integration with the Gutenberg Editor"
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-05.jpg?rev=2016195",
            "caption": "Integration with the Elementor Editor"
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-06.jpg?rev=2043012",
            "caption": "Integration with the Page Builder by SiteOrigin"
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-07.jpg?rev=2043012",
            "caption": "Sell Downloads Insertion Button"
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-08.jpg?rev=2043012",
            "caption": "Sell Downloads Insertion Interface"
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-09.jpg?rev=2168767",
            "caption": "Integration with the BeaverBuilder Editor."
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-10.jpg?rev=2168767",
            "caption": "Insertion Interface for Product"
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-11.jpg?rev=2168767",
            "caption": "Insertion Interface for Products List"
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-12.jpg?rev=2168767",
            "caption": "Available Widgets for Products and Products List Insertion"
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-13.jpg?rev=2168767",
            "caption": "Sales Reports"
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-14.jpg?rev=2168767",
            "caption": "Filtering Sales Report"
        },
        {
            "src": "https://ps.w.org/sell-downloads/assets/screenshot-15.jpg?rev=2168767",
            "caption": "Available layouts"
        }
    ],
    "tags": {
        "ecommerce": "ecommerce",
        "paypal": "paypal",
        "sell-downloads": "sell downloads",
        "shop": "shop",
        "store": "store"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.147": "https://downloads.wordpress.org/plugin/sell-downloads.1.0.147.zip",
        "1.0.148": "https://downloads.wordpress.org/plugin/sell-downloads.1.0.148.zip",
        "1.0.149": "https://downloads.wordpress.org/plugin/sell-downloads.1.0.149.zip",
        "1.0.150": "https://downloads.wordpress.org/plugin/sell-downloads.1.0.150.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/sell-downloads.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/sell-downloads.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/sell-downloads.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/sell-downloads.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/sell-downloads.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/sell-downloads.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/sell-downloads.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/sell-downloads.1.1.7.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://wordpress.dwbooster.com/content-tools/sell-downloads",
    "banners": {
        "low": "https://ps.w.org/sell-downloads/assets/banner-772x250.png?rev=1624893",
        "high": "https://ps.w.org/sell-downloads/assets/banner-1544x500.png?rev=1624893"
    },
    "icons": {
        "1x": "https://ps.w.org/sell-downloads/assets/icon-128x128.jpg?rev=1058371",
        "2x": "https://ps.w.org/sell-downloads/assets/icon-256x256.jpg?rev=1058371"
    },
    "blocks": {
        "cpsd/sell-downloads": {
            "name": "cpsd/sell-downloads",
            "title": "Sell Downloads"
        },
        "cpsd/sell-downloads-product": {
            "name": "cpsd/sell-downloads-product",
            "title": "Product"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 80,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}