{
    "name": "SellKit &#8211; Funnel builder and checkout optimizer for WooCommerce to sell more, faster",
    "slug": "sellkit",
    "version": "2.0.5",
    "author": "<a href=\"https://artbees.net\">Artbees</a>",
    "author_profile": "https://profiles.wordpress.org/artbees/",
    "contributors": {
        "artbees": {
            "profile": "https://profiles.wordpress.org/artbees/",
            "avatar": "https://secure.gravatar.com/avatar/52daf57a41f634a166f95d11f63d3ba0?s=96&d=monsterid&r=g",
            "display_name": "artbees"
        }
    },
    "requires": "5.6",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 94,
    "ratings": {
        "5": 25,
        "4": 1,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 28,
    "support_url": "https://wordpress.org/support/plugin/sellkit/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 10000,
    "downloaded": 143687,
    "last_updated": "2024-07-16 5:52am GMT",
    "added": "2022-02-09",
    "homepage": "https://getsellkit.com/",
    "sections": {
        "description": "<p>Sellkit is a <strong><a href=\"https://getsellkit.com\" rel=\"nofollow ugc\">checkout optimizer for WooCommerce</a></strong> that drives more sales with sales funnels, increases order value with optimized checkout and boost engagement with dynamic discounts, smart coupons and checkout alerts.</p>\n<ul>\n<li>It’s unified</li>\n<li>It’s simple to use.</li>\n<li>It comes with an unbelievably competitive pricing structure</li>\n<li>And you don’t need to be a marketing genius to get it to work!</li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8N89pulIDXc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Are your sales stats disappointing? Do your carts suffer from low engagement and high abandonment? Are your offers and deals easily ignored?<br />\nSellKit is all your online store needs to sell in full swing!</p>\n<ul>\n<li>Build and customize engaging checkout pages or get started fast with professional premade templates</li>\n<li>Streamline the conversion process with advanced filters and variation swatches</li>\n<li>Remove checkout friction with skip cart, autocomplete, inline form validation and more</li>\n<li>Skyrocket sales with irresistible sales funnels<br />\nBoost average order value with highly-targeted 1-click order bumps, upsells and downsells</li>\n<li>Increase conversion possibility with dynamic discounts</li>\n<li>Show smart notices during checkout and effectively increase the chance of bigger orders</li>\n<li>Drive retention and loyalty with smart coupons based on customer behavior and shopping history</li>\n<li>Personalize the shopping experience and customer journey using advanced conditional and RFM segmentation</li>\n<li>Measure the performance of your WooCommerce store, funnels and promotions with actionable insights and analytics</li>\n</ul>\n<h3>Who is it for?</h3>\n<p>All types of WooCommerce websites:</p>\n<ul>\n<li>eCommerce stores</li>\n<li>Service businesses</li>\n<li>Digital products and subscriptions</li>\n<li>Marketers</li>\n<li>Dropshipping businesses</li>\n</ul>\n<h3>Drive sales through irresistible sales funnels</h3>\n<p>Maximize engagement and multiply profits by driving your visitors through mobile-optimized sale funnels.<br />\nServe alluring upsell/downsell offers and automatically turn visitors into customers and repeat customers.</p>\n<h4>Create unlimited sales funnels on an intuitive canvas</h4>\n<p>Visually create sales funnels on an intuitive canvas. Add, remove and manage the steps with zero coding involved.<br />\nAlternatively, choose from readymade funnel templates for a variety of businesses and use cases.</p>\n<ul>\n<li>Link pages dynamically (not just linearly!)</li>\n<li>Mobile-optimized templates</li>\n<li>Actionable insights</li>\n</ul>\n<h4>Increase sales with personalized order bumps during checkout</h4>\n<p>Easily increase the average order value with one-click order bump offers anywhere in the checkout form.<br />\nTrigger order bumps and apply personalized discounts based on your own conditions.</p>\n<ul>\n<li>Make rule-based offers using hundreds of pre-set conditions</li>\n<li>Place anywhere in the checkout form</li>\n</ul>\n<h4>Boost order value with personalized one-click upsells and downsell</h4>\n<p>Boost AOV even further with personalized one-click upsell and downsell offers during checkout, either as separate offers or right within the same order before it’s placed.</p>\n<ul>\n<li>Advanced segmentation</li>\n<li>All major payment gateways</li>\n<li>Use readymade Elementor templates</li>\n</ul>\n<h4>Use opt-in forms to grow leads and prevent cart abandonment</h4>\n<p>Collect emails and other key information with opt-in funnels. Easily build your own lead magnets or use readymade templates.</p>\n<ul>\n<li>View and manage contact details, orders and site activity</li>\n<li>Use a template or build your own form</li>\n<li>Advanced contact management</li>\n<li>Sync contacts to your automations tools</li>\n</ul>\n<h4>Save time with a collection of ready-made templates</h4>\n<p>Quickly choose from beautiful readymade designs for cart, checkout, upset, downhill and thank you pages, all optimized for mobile, without writing a single line of code.</p>\n<h4>Measure your success with actionable insights and Analytics</h4>\n<p>Assess the performance of your funnels using relevant metrics and insightful charts.<br />\nFrom engagement to sales, discover how your funnels are performing within the chosen timeframe.</p>\n<ul>\n<li>Funnel engagement: Visits, bounce rate and more</li>\n<li>Funnel sales: Revenue, orders, conversion rate, average order value, order bump and upsell revenue</li>\n<li>Comparative visual chart to spot growth</li>\n</ul>\n<h4>More funnel builder features</h4>\n<ul>\n<li>Facebook Pixel integration</li>\n<li>Works with Elementor</li>\n<li>Built for Mobile</li>\n</ul>\n<h3>Optimize the checkout page and streamline the conversion</h3>\n<p>Upgrade WooCommerce’s rigid, distracting and confusing checkout experience. Build smart, engaging and converting checkout pages.</p>\n<h4>Simplify the checkout process</h4>\n<p>Remove checkout friction with a simple checkout form, express checkout and a majority of payment options.</p>\n<ul>\n<li>Advanced product filters</li>\n<li>Variation swatches</li>\n<li>Express checkout</li>\n<li>Skip cart</li>\n<li>Sticky cart</li>\n<li>Auto-populated form fields such as address, state and more</li>\n<li>Inline form validation instead of whole-form validation</li>\n<li>Option to sign up with a checkbox instead of separate sign up and login pages</li>\n</ul>\n<h4>Make your checkout page fun, informative and convincing</h4>\n<p>Help your visitors decide by displaying supporting information such as testimonials, reviews and interesting numbers alongside the checkout form.</p>\n<h4>Customize your checkout forms to your liking and customer’s ease</h4>\n<p>Add, order and reorder your checkout forms fields. Save customer’s time with pre-populated and auto-completed fields.<br />\nIncrease conversion rate with automatically applied coupons.</p>\n<h4>Boost mobile sales with mobile-optimized checkouts</h4>\n<p>SellKit checkout forms are highly optimized for mobile.<br />\nBoost your mobile sales with mobile-ready designs, single-step forms and quick, one-click payment.</p>\n<h3>Boost WooCommerce promotions with dynamic discounts, smart coupons and checkout alerts</h3>\n<p>No more one-size-fits-all discounts and coupons! Deliver customers highly personalized deals, coupons and offers based on shopping behavior and demographic data.</p>\n<h4>Treat eligible customers to personalized coupons</h4>\n<p>Overcome hesitation and competition with a winning hand. Build a better relationship with your customers and increase repeat purchases with<br />\nsmart coupons based on your customer’s shopping behavior.</p>\n<h4>Boost conversion possibility with dynamic discounts in checkout</h4>\n<p>Personalize the shopping experience with conditional discounts applied automatically during checkout.<br />\nDefine your own rules and apply discounts based on customer shopping behavior.</p>\n<h4>Display smart checkout alerts based on customer behavior</h4>\n<p>Show personalized offers to the customer in Cart, Checkout, Catalog and product single pages and effectively increase the chances of more orders. Choose from a variety of conditions to trigger the alert.</p>\n<h4>Hyper-target your customers with the best-in-class segmentation</h4>\n<p>Use advanced segmentation to personalize the final price, discount coupons and alerts during checkout based on customer geolocation, referring website, shopping behavior and many other attributes.</p>\n<h4>Define custom discounts and coupons for different locations</h4>\n<p>With SellKit’s advanced geolocational segmentation you can now offer automated discounts in different locations.<br />\nYou can also automate discounts or generate coupons that are applicable in specific geolocations.</p>\n<h3>What’s included in the SellKit free version?</h3>\n<p>Check below to see what you can do with SellKit that you would otherwise pay a fortune for in similar products.</p>\n<ul>\n<li>Unlimited Sales Funnels</li>\n<li>Limited Checkout Forms</li>\n<li>Custom Thank you pages</li>\n<li>One-Click Order Bump</li>\n<li>One-Click Upsell &amp; Downsell</li>\n<li>Limited Analytics</li>\n<li>Limited Customer Segmentation</li>\n<li>Ready to use Funnel Templates</li>\n<li>Community Support</li>\n</ul>\n<h3>What will you get if you upgrade to SellKit Pro?</h3>\n<p>Everything in the Free version and…</p>\n<ul>\n<li>Pro Checkout Features</li>\n<li>Cart Optimisations</li>\n<li>Personalized coupons</li>\n<li>Dynamic Discounts</li>\n<li>Smart Alerts</li>\n<li>Advanced Product Catalog Filters</li>\n<li>Product Catalog Swatches</li>\n<li>Advanced Analytics</li>\n<li>Advanced Customer Segmentation</li>\n<li>Pro Ready to use Templates</li>\n<li>Standard Support</li>\n</ul>\n<h3>How SellKit pricing blows away the competition</h3>\n<p>If you’re using too many tools to increase sales for your online business and looking for a unified, cost-effective option, Selkit is the best all-in-one solution, offering the functionality of:</p>\n<ul>\n<li>Funnel builders (Cartflows, BuildWooFunnels, Clickfunnels)</li>\n<li>One-click order bump plugins (IconicWP Sales Booster,&#8230; )</li>\n<li>One-click Upsell &amp; Downsell plugins (Yith Deals, UpStroke, WooCommerce Checkout Add-Ons)</li>\n<li>Discounts &amp; Coupons plugins (SmartAdvanced Coupons, WooCommerce Dynamic Pricing &amp; Discounts, Yith dynamic pricing &amp; discount, StoreApps)</li>\n<li>Alerts plugins (Yith cart messages, Skyverge CardNotices)</li>\n</ul>\n<p><strong>Total Value: $900/year<br />\nSellKit: $199/year (Save $700/year)</strong></p>\n<h3>All features at a glance</h3>\n<ul>\n<li>Drag &amp; Drop mobile-optimized funnel builder</li>\n<li>One-click upsell and downsell</li>\n<li>One-click order bump</li>\n<li>Opt-in and opt-in confirmation funnel steps</li>\n<li>Beautiful readymade designs for cart, checkout, upsell, downhill and thank you page</li>\n<li>Advanced funnels analytics (visits, bounce rate, orders, revenue, conversion rate, AOV)</li>\n<li>Comparative analytics charts</li>\n<li>Customizable thank you page</li>\n<li>Supports all major payment gateways</li>\n<li>Design, order, reorder your checkout form fields</li>\n<li>Multi-step OR single step checkout</li>\n<li>Email grab in the beginning of checkout instead of the end</li>\n<li>Auto-populate State</li>\n<li>Address Autocomplete</li>\n<li>Pre-populate Form Data</li>\n<li>Pre-filled form for abandoned users</li>\n<li>Add custom checkout fields</li>\n<li>Auto-Apply Coupons</li>\n<li>Express Checkout</li>\n<li>Product-specific checkouts</li>\n<li>Swap Global Checkout</li>\n<li>Checkout Expiry</li>\n<li>Custom thank you page</li>\n<li>Skip Cart</li>\n<li>Auto-apply discounts with advanced segmentation</li>\n<li>Personalized coupons with advanced segmentation</li>\n<li>Smart alerts with advanced segmentation</li>\n<li>Funnel Export/Import/Duplicate</li>\n</ul>\n<h3>Support</h3>\n<ul>\n<li>30 Day money-back guarantee (No questions asked!)</li>\n<li>Cancel any time</li>\n<li>24/7 support</li>\n</ul>\n<h3>Integrations</h3>\n<p>SellKit is fully integrated with:</p>\n<ul>\n<li>Facebook Pixel</li>\n<li>Google Analytics</li>\n<li>Elementor page builder</li>\n</ul>\n<h3>NOTE</h3>\n<p>Main functionalities are only compatible with Elementor at the moment. Compatibility with more builders are in development.</p>\n",
        "installation": "<ol>\n<li>Install using the WordPress built-in Plugin installer, or Extract the zip file and drop the contents in the <code>wp-content/plugins/</code> directory of your WordPress installation.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress.</li>\n</ol>\n",
        "changelog": "<h4>2.0.5 &#8211; 2024-07-15</h4>\n<ul>\n<li>Bug Fix: Fixed the issue with the Next Step link on the Opt-In Confirmation step.</li>\n<li>Improvement: Improved the Checkout widget to display even when the cart is empty in the editor.</li>\n<li>Improvement: Improved the Opt-In step to be enabled in the appropriate place within Funnels.</li>\n<li>Feature: Added an Offset setting to the Checkout widget&#8217;s Sticky Cart.</li>\n</ul>\n<h4>2.0.1 &#8211; 2024-06-24</h4>\n<ul>\n<li>Bug Fix: Fixed vulnerability issues.</li>\n</ul>\n<h4>2.0.0 &#8211; 2024-06-07</h4>\n<ul>\n<li>Bug Fix: Fixed vulnerability issues.</li>\n</ul>\n<h4>1.9.8 &#8211; 2024-05-29</h4>\n<ul>\n<li>Bug Fix: Fixed style settings issue on Checkout widget.</li>\n<li>Bug Fix: Fixed decimal number issues in Analytics.</li>\n<li>Improvement: Changed Geolocation API to maxmind.</li>\n</ul>\n<h4>1.9.6 &#8211; 2024-05-21</h4>\n<ul>\n<li>Bug Fix: Fixed decimal number issue in Funnel and Discounts analytics.</li>\n<li>Bug Fix: Fixed bump issue on Funnel.</li>\n<li>Improvement: Changed Decision step to Condition step.</li>\n<li>Improvement: Improved preview button to display actual URL.</li>\n<li>Improvement: Updated preview button label in Funnels and Steps.</li>\n<li>Feature: Added ability to set Sales and Checkout steps as the home page.</li>\n</ul>\n<h4>1.9.3 &#8211; 2024-05-08</h4>\n<ul>\n<li>Bug Fix: Fixed Funnel issue on deactivating.</li>\n<li>Bug Fix: Fixed issues on importing Funnels.</li>\n<li>Improvement: Improved importing process of Funnels.</li>\n</ul>\n<h4>1.9.2 &#8211; 2024-05-01</h4>\n<ul>\n<li>Bug Fix: Fixed some PHP warning and notices in Funnels.</li>\n<li>Bug Fix: Fixed Contact issues on Funnels.</li>\n<li>Bug Fix: Fixed Analytics data issues on Funnels.</li>\n<li>Bug Fix: Fixed History issues on Funnels.</li>\n<li>Bug Fix: Fixed issue on exporting Funnels.</li>\n<li>Bug Fix: Fixed total revenue issue with coupons in Funnels.</li>\n<li>Improvement: Improved Checkout step, Bumps, Downsell and Upsell to validate product count.</li>\n</ul>\n<h4>1.8.9 &#8211; 2024-04-09</h4>\n<ul>\n<li>Bug Fix: Fixed fatal error on reset password page.</li>\n<li>Bug Fix: Fixed database error on opt-in widget.</li>\n<li>Bug Fix: Fixed Billing options on the Checkout widget.</li>\n<li>Bug Fix: Fixed Global Checkout issues.</li>\n<li>Improvement: Updated Checkout widget icons to SVG.</li>\n<li>Feature: Added Custom Billing Field to dynamic keywords.</li>\n<li>Feature: Added Custom Shipping Field to dynamic keywords.</li>\n<li>Feature: Added Custom Fields to checkout widget.</li>\n<li>Feature: Added order note to checkout widget.</li>\n<li>Feature: Added Header and Footer template selector to Global Checkout widget.</li>\n</ul>\n<h4>1.8.6 &#8211; 2024-03-07</h4>\n<ul>\n<li>Bug Fix: Fixed incompatibility issues with PHP 8.2.</li>\n<li>Bug Fix: Fixed thankyou page URL issue in Global Checkout.</li>\n<li>Bug Fix: Fixed decision step issue in Checkout widget &amp; Global Checkout feature.</li>\n<li>Bug Fix: Fixed Elementor&#8217;s Text Editor widget issue while using Checkout widget.</li>\n<li>Bug Fix: Fixed some PHP warning and notices.</li>\n</ul>\n<h4>1.8.3 &#8211; 2024-01-26</h4>\n<ul>\n<li>Bug Fix: Fixed vulnerability issues on opt-in form download action.</li>\n<li>Improvement: Improved Checkout widget to show billing fields before payment methods.</li>\n</ul>\n<h4>1.8.1 &#8211; 2023-11-27</h4>\n<ul>\n<li>Bug Fix: Fixed Funnel tabs issues.</li>\n<li>Bug Fix: Fixed Order Bump condition in Global Checkout feature.</li>\n<li>Improvement: Improved Checkout widget to be compatible with NMI Gateway PCI for WooCommerce plugin.</li>\n<li>Improvement: Improved Checkout widget to be compatible with Payment Plugins for Stripe WooCommerce plugin.</li>\n<li>Feature: Added option to change Funnel Step Base URL.</li>\n</ul>\n<h4>1.7.9 &#8211; 2023-10-03</h4>\n<ul>\n<li>Bug Fix: Fixed User Type condition issue.</li>\n<li>Bug Fix: Fixed UX issue when WooCommerce plugin is deactivated.</li>\n<li>Bug Fix: Fixed Funnel issue after removing product.</li>\n<li>Bug Fix: Fixed sellkit-coupon-expiry-date shortcode issue.</li>\n<li>Feature: Added Reset Previous Cart Items option to Checkout step.</li>\n</ul>\n<h4>1.7.5 &#8211; 2023-08-15</h4>\n<ul>\n<li>Bug Fix: Fixed Checkout widget issues.</li>\n</ul>\n<h4>1.7.4 &#8211; 2023-07-13</h4>\n<ul>\n<li>Feature: Added Global Checkout feature.</li>\n</ul>\n<h4>1.7.2 &#8211; 2023-06-14</h4>\n<ul>\n<li>Bug Fix: Fixed Decision step issue on the Flowchart.</li>\n<li>Bug Fix: Fixed import Funnel issues.</li>\n<li>Bug Fix: Fixed Order Cart Details issues.</li>\n<li>Improvement: Improved Upsell &amp; Downsell in Decision step on the Flowchart.</li>\n<li>Feature: Integrate Upsell &amp; Downsell templates icon with Elementor inline fonts.</li>\n</ul>\n<h4>1.6.8 &#8211; 2023-05-08</h4>\n<ul>\n<li>Bug Fix: Fixed Funnel duplication issue.</li>\n<li>Bug Fix: Fixed get_page_by_title deprecated function.</li>\n<li>Bug Fix: Fixed fatal error on reset password page.</li>\n<li>Bug Fix: Fixed coupon apply button issue on Checkout widget.</li>\n<li>Improvement: Improved Checkout widget design.</li>\n<li>Feature: Added new style settings for Checkout widget.</li>\n</ul>\n<h4>1.6.5 &#8211; 2023-04-12</h4>\n<ul>\n<li>Bug Fix: Fixed Checkout widget issues.</li>\n<li>Improvement: Improved Visitor Country keyword.</li>\n<li>Feature: Added padding setting for Checkout widget multistep layout.</li>\n</ul>\n<h4>1.6.2 &#8211; 2023-02-20</h4>\n<ul>\n<li>Bug Fix: Fixed Checkout widget issues.</li>\n<li>Bug Fix: Fixed incompatibility issues with PHP 8.1.</li>\n<li>Bug Fix: Fixed fatal error on background process.</li>\n<li>Improvement: Improved Checkout widget to be compatible with Stripe Payments.</li>\n</ul>\n<h4>1.5.9 &#8211; 2023-01-25</h4>\n<ul>\n<li>Improvement: Improved Checkout widget to be compatible with WooCommerce Shipping options.</li>\n</ul>\n<h4>1.5.8 &#8211; 2023-01-18</h4>\n<ul>\n<li>Bug Fix: Fixed products issue on Funnel.</li>\n<li>Bug Fix: Fixed Elementor deprecated notices.</li>\n<li>Bug Fix: Fixed Checkout widget issue on WooCommerce default checkout page.</li>\n</ul>\n<h4>1.5.7 &#8211; 2021-01-05</h4>\n<ul>\n<li>Bug Fix: Fixed duplicated Google API key field in Settings.</li>\n<li>Bug Fix: Fixed conditions in Funnels.</li>\n<li>Bug Fix: Fixed Checkout widget issues.</li>\n<li>Improvement: Improved Cart Items Quantity condition name.</li>\n<li>Feature: Added Cart Total Items Count condition.</li>\n<li>Feature: Added asking for review in Dashboard.</li>\n<li>Feature: Added variation swatches control in Settings.</li>\n</ul>\n<h4>1.5.4 &#8211; 2022-12-12</h4>\n<ul>\n<li>Bug Fix: Fixed style conflict with Hello Theme.</li>\n<li>Bug Fix: Fixed dependency alert issue.</li>\n<li>Bug Fix: Fixed some conditions&#8217; issues in funnels.</li>\n<li>Bug Fix: Fixed site health errors.</li>\n<li>Bug Fix: Fixed extra Decision step template from the preview page.</li>\n<li>Bug Fix: Fixed payment icons&#8217; alignments.</li>\n<li>Bug Fix: Fixed issues in showing all payment methods in the checkout.</li>\n<li>Bug Fix: Fixed Order Bump issue when we have more parameters in our URL.</li>\n<li>Bug Fix: Fixed incompatibility issues with PHP 7.2.</li>\n<li>Improvement: Improved Google API link.</li>\n<li>Improvement: Improved WP repo descriptions.</li>\n</ul>\n<h4>1.5.1 &#8211; 2022-11-08</h4>\n<ul>\n<li>Bug Fix: Fixed Funnel importing issue.</li>\n</ul>\n<h4>1.5.0 &#8211; 2022-10-14</h4>\n<ul>\n<li>Bug Fix: Fixed Funnel Elementor dependency issue.</li>\n<li>Bug Fix: Fixed database names errors with hyphen.</li>\n<li>Bug Fix: Fixed radio button style in checkout builder widget.</li>\n<li>Bug Fix: Fixed a small Elementor error when SellKit is activated.</li>\n<li>Bug Fix: Fixed warnings while saving discounts.</li>\n<li>Bug Fix: Fixed Optin incompatibilities with other themes.</li>\n<li>Improvement: Improved checkout builder widget mobile design.</li>\n<li>Improvement: Improved the size of SellKit widgets&#8217; icons.</li>\n<li>Feature: Added Funnel flowchart structure.</li>\n<li>Feature: Added Funnel Contacts feature.</li>\n<li>Feature: Added some extra conditions to funnel.</li>\n<li>Feature: Added Opting widget.</li>\n<li>Feature: Added Opting Step.</li>\n<li>Feature: Added an option to checkout builder widget for term of services.</li>\n<li>Feature: Added Export/Import/Duplicate features to the Funnel.</li>\n</ul>\n<h4>1.3.2 &#8211; 2022-10-03</h4>\n<ul>\n<li>Bug Fix: Fixed plugin data deletion on multisite.</li>\n<li>Bug Fix: Fixed auto-apply coupon issues.</li>\n<li>Improvement: Improved checkout builder widget mobile design.</li>\n<li>Improvement: Improved products search component.</li>\n<li>Feature: Integrated virtual products with checkout widget.</li>\n<li>Feature: Added missed fields to the checkout widget.</li>\n</ul>\n<h4>1.3.1 &#8211; 2022-09-06</h4>\n<ul>\n<li>Bug Fix: Fixed checkout builder widget incompatibilities with famous themes.</li>\n<li>Bug Fix: Fixed dependency issues.</li>\n<li>Bug Fix: Fixed browser language condition issue.</li>\n<li>Bug Fix: Fixed a small JS issue in upsell page.</li>\n<li>Bug Fix: Fixed showing tax issues.</li>\n</ul>\n<h4>1.2.9 &#8211; 2022-08-18</h4>\n<ul>\n<li>Bug Fix: Fixed checkout widget first loading in Elementor editor.</li>\n</ul>\n<h4>1.2.8 &#8211; 2022-08-02</h4>\n<ul>\n<li>Bug Fix: Fixed checkout widget incompatibilities with other themes.</li>\n<li>Bug Fix: Fixed conditions small issues.</li>\n<li>Bug Fix: Fixed widget icons in dark mode.</li>\n<li>Bug Fix: Fixed some typos in conditions.</li>\n<li>Bug Fix: Fixed checkout billing email issue.</li>\n<li>Bug Fix: Fixed checkout widget scroll issue.</li>\n<li>Bug Fix: Fixed checkout widget shipping issues.</li>\n<li>Bug Fix: Fixed checkout widget price issues.</li>\n<li>Improvement: Improved country and city conditions.</li>\n<li>Improvement: Improved checkout widget autocomplete feature.</li>\n<li>Improvement: Improved showing bank transfer data.</li>\n</ul>\n<h4>1.2.5 &#8211; 2022-06-28</h4>\n<ul>\n<li>Bug Fix: Fixed total invoice issue in checkout builder widget.</li>\n<li>Bug Fix: Fixed free shipping issue in checkout builder widget.</li>\n<li>Bug Fix: Fixed plugin data deletion issue.</li>\n<li>Bug Fix: Fixed state field issue in checkout builder widget.</li>\n<li>Bug Fix: Fixed a conflict with Menu icons plugin.</li>\n<li>Bug Fix: Fixed notices issues in WordPress admin area.</li>\n<li>Bug Fix: Fixed some small translation issues.</li>\n<li>Bug Fix: Fixed an error caused by contact segmentation data.</li>\n<li>Bug Fix: Fixed a warning in adding a new column to database.</li>\n<li>Bug Fix: Fixed dynamic keywords style in dark mode.</li>\n<li>Bug Fix: Fixed incompatibility issues with PHP 7.2.</li>\n<li>Improvement: Improved state and city lookup by postcode in checkout builder widget.</li>\n</ul>\n<h4>1.2.3 &#8211; 2022-05-23</h4>\n<ul>\n<li>Feature: Added some new conditions to the conditions component.</li>\n<li>Bug Fix: Fixed translation issues.</li>\n<li>Bug Fix: Fixed some style issue in funnels.</li>\n<li>Improvement: Improved SellKit Pro promotions.</li>\n<li>Improvement: Improved readme file documentation.</li>\n</ul>\n<h4>1.2.2 &#8211; 2022-04-28</h4>\n<ul>\n<li>Feature: Added some new keywords.</li>\n<li>Bug Fix: Fixed analytics style issues.</li>\n<li>Bug Fix: Fixed PHP 7.2 incompatibilities.</li>\n<li>Bug Fix: Fixed undefined HTTP_ACCEPT_LANGUAGE error.</li>\n<li>Bug Fix: Fixed some deprecated notices regarding Elementor plugin.</li>\n<li>Improvement: Improved features names.</li>\n</ul>\n<h4>1.2.1 &#8211; 2022-04-07</h4>\n<ul>\n<li>Feature: Added a notice to install and activate woocommerce.</li>\n<li>Bug Fix: Fixed dynamic keywords issues in thankyou page.</li>\n<li>Bug Fix: Fixed the location performance issue.</li>\n<li>Bug Fix: Fixed order bump discount style.</li>\n<li>Bug Fix: Fixed SellKit checkout styling issue.</li>\n<li>Bug Fix: Fixed some bugs in PHP 7.2.</li>\n<li>Bug Fix: Fixed date picker value in conditions component.</li>\n<li>Improvement: Added some new validations for checkout step in checkout builder.</li>\n<li>Improvement: Removed extra validation fields for checkout builder fields.</li>\n<li>Improvement: Removed FILTER_SANITIZE_STRING which is deprecated in PHP 8.1.</li>\n</ul>\n<h4>1.1.4 &#8211; 2022-03-09</h4>\n<ul>\n<li>Feature: Added a js error logger.</li>\n<li>Bug Fix: Added a fallback for location API request.</li>\n<li>Bug Fix: Fixed an error in dynamic keywords section.</li>\n<li>Bug Fix: Fixed a fatal error in checkout builder widget.</li>\n</ul>\n<h4>1.1.3 &#8211; 2022-02-18</h4>\n<ul>\n<li>Improvement: Added some notices for dependent plugins.</li>\n<li>Feature: Added some new conditions to the conditions component.</li>\n<li>Bug Fix: Fixed some typography issues.</li>\n<li>Bug Fix: Added some small bug fixes to the condition component.</li>\n<li>Bug Fix: Fixed Document/global/link not found error in the elementor editor area.</li>\n</ul>\n<h4>1.0.0 &#8211; 2022-02-11</h4>\n<ul>\n<li>Initial release</li>\n</ul>\n"
    },
    "short_description": "Sellkit helps WooCommerce websites drive more sales with sales funnels.",
    "description": "<p>Sellkit is a <strong><a href=\"https://getsellkit.com\" rel=\"nofollow ugc\">checkout optimizer for WooCommerce</a></strong> that drives more sales with sales funnels, increases order value with optimized checkout and boost engagement with dynamic discounts, smart coupons and checkout alerts.</p>\n<ul>\n<li>It’s unified</li>\n<li>It’s simple to use.</li>\n<li>It comes with an unbelievably competitive pricing structure</li>\n<li>And you don’t need to be a marketing genius to get it to work!</li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8N89pulIDXc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>Are your sales stats disappointing? Do your carts suffer from low engagement and high abandonment? Are your offers and deals easily ignored?<br />\nSellKit is all your online store needs to sell in full swing!</p>\n<ul>\n<li>Build and customize engaging checkout pages or get started fast with professional premade templates</li>\n<li>Streamline the conversion process with advanced filters and variation swatches</li>\n<li>Remove checkout friction with skip cart, autocomplete, inline form validation and more</li>\n<li>Skyrocket sales with irresistible sales funnels<br />\nBoost average order value with highly-targeted 1-click order bumps, upsells and downsells</li>\n<li>Increase conversion possibility with dynamic discounts</li>\n<li>Show smart notices during checkout and effectively increase the chance of bigger orders</li>\n<li>Drive retention and loyalty with smart coupons based on customer behavior and shopping history</li>\n<li>Personalize the shopping experience and customer journey using advanced conditional and RFM segmentation</li>\n<li>Measure the performance of your WooCommerce store, funnels and promotions with actionable insights and analytics</li>\n</ul>\n<h3>Who is it for?</h3>\n<p>All types of WooCommerce websites:</p>\n<ul>\n<li>eCommerce stores</li>\n<li>Service businesses</li>\n<li>Digital products and subscriptions</li>\n<li>Marketers</li>\n<li>Dropshipping businesses</li>\n</ul>\n<h3>Drive sales through irresistible sales funnels</h3>\n<p>Maximize engagement and multiply profits by driving your visitors through mobile-optimized sale funnels.<br />\nServe alluring upsell/downsell offers and automatically turn visitors into customers and repeat customers.</p>\n<h4>Create unlimited sales funnels on an intuitive canvas</h4>\n<p>Visually create sales funnels on an intuitive canvas. Add, remove and manage the steps with zero coding involved.<br />\nAlternatively, choose from readymade funnel templates for a variety of businesses and use cases.</p>\n<ul>\n<li>Link pages dynamically (not just linearly!)</li>\n<li>Mobile-optimized templates</li>\n<li>Actionable insights</li>\n</ul>\n<h4>Increase sales with personalized order bumps during checkout</h4>\n<p>Easily increase the average order value with one-click order bump offers anywhere in the checkout form.<br />\nTrigger order bumps and apply personalized discounts based on your own conditions.</p>\n<ul>\n<li>Make rule-based offers using hundreds of pre-set conditions</li>\n<li>Place anywhere in the checkout form</li>\n</ul>\n<h4>Boost order value with personalized one-click upsells and downsell</h4>\n<p>Boost AOV even further with personalized one-click upsell and downsell offers during checkout, either as separate offers or right within the same order before it’s placed.</p>\n<ul>\n<li>Advanced segmentation</li>\n<li>All major payment gateways</li>\n<li>Use readymade Elementor templates</li>\n</ul>\n<h4>Use opt-in forms to grow leads and prevent cart abandonment</h4>\n<p>Collect emails and other key information with opt-in funnels. Easily build your own lead magnets or use readymade templates.</p>\n<ul>\n<li>View and manage contact details, orders and site activity</li>\n<li>Use a template or build your own form</li>\n<li>Advanced contact management</li>\n<li>Sync contacts to your automations tools</li>\n</ul>\n<h4>Save time with a collection of ready-made templates</h4>\n<p>Quickly choose from beautiful readymade designs for cart, checkout, upset, downhill and thank you pages, all optimized for mobile, without writing a single line of code.</p>\n<h4>Measure your success with actionable insights and Analytics</h4>\n<p>Assess the performance of your funnels using relevant metrics and insightful charts.<br />\nFrom engagement to sales, discover how your funnels are performing within the chosen timeframe.</p>\n<ul>\n<li>Funnel engagement: Visits, bounce rate and more</li>\n<li>Funnel sales: Revenue, orders, conversion rate, average order value, order bump and upsell revenue</li>\n<li>Comparative visual chart to spot growth</li>\n</ul>\n<h4>More funnel builder features</h4>\n<ul>\n<li>Facebook Pixel integration</li>\n<li>Works with Elementor</li>\n<li>Built for Mobile</li>\n</ul>\n<h3>Optimize the checkout page and streamline the conversion</h3>\n<p>Upgrade WooCommerce’s rigid, distracting and confusing checkout experience. Build smart, engaging and converting checkout pages.</p>\n<h4>Simplify the checkout process</h4>\n<p>Remove checkout friction with a simple checkout form, express checkout and a majority of payment options.</p>\n<ul>\n<li>Advanced product filters</li>\n<li>Variation swatches</li>\n<li>Express checkout</li>\n<li>Skip cart</li>\n<li>Sticky cart</li>\n<li>Auto-populated form fields such as address, state and more</li>\n<li>Inline form validation instead of whole-form validation</li>\n<li>Option to sign up with a checkbox instead of separate sign up and login pages</li>\n</ul>\n<h4>Make your checkout page fun, informative and convincing</h4>\n<p>Help your visitors decide by displaying supporting information such as testimonials, reviews and interesting numbers alongside the checkout form.</p>\n<h4>Customize your checkout forms to your liking and customer’s ease</h4>\n<p>Add, order and reorder your checkout forms fields. Save customer’s time with pre-populated and auto-completed fields.<br />\nIncrease conversion rate with automatically applied coupons.</p>\n<h4>Boost mobile sales with mobile-optimized checkouts</h4>\n<p>SellKit checkout forms are highly optimized for mobile.<br />\nBoost your mobile sales with mobile-ready designs, single-step forms and quick, one-click payment.</p>\n<h3>Boost WooCommerce promotions with dynamic discounts, smart coupons and checkout alerts</h3>\n<p>No more one-size-fits-all discounts and coupons! Deliver customers highly personalized deals, coupons and offers based on shopping behavior and demographic data.</p>\n<h4>Treat eligible customers to personalized coupons</h4>\n<p>Overcome hesitation and competition with a winning hand. Build a better relationship with your customers and increase repeat purchases with<br />\nsmart coupons based on your customer’s shopping behavior.</p>\n<h4>Boost conversion possibility with dynamic discounts in checkout</h4>\n<p>Personalize the shopping experience with conditional discounts applied automatically during checkout.<br />\nDefine your own rules and apply discounts based on customer shopping behavior.</p>\n<h4>Display smart checkout alerts based on customer behavior</h4>\n<p>Show personalized offers to the customer in Cart, Checkout, Catalog and product single pages and effectively increase the chances of more orders. Choose from a variety of conditions to trigger the alert.</p>\n<h4>Hyper-target your customers with the best-in-class segmentation</h4>\n<p>Use advanced segmentation to personalize the final price, discount coupons and alerts during checkout based on customer geolocation, referring website, shopping behavior and many other attributes.</p>\n<h4>Define custom discounts and coupons for different locations</h4>\n<p>With SellKit’s advanced geolocational segmentation you can now offer automated discounts in different locations.<br />\nYou can also automate discounts or generate coupons that are applicable in specific geolocations.</p>\n<h3>What’s included in the SellKit free version?</h3>\n<p>Check below to see what you can do with SellKit that you would otherwise pay a fortune for in similar products.</p>\n<ul>\n<li>Unlimited Sales Funnels</li>\n<li>Limited Checkout Forms</li>\n<li>Custom Thank you pages</li>\n<li>One-Click Order Bump</li>\n<li>One-Click Upsell &amp; Downsell</li>\n<li>Limited Analytics</li>\n<li>Limited Customer Segmentation</li>\n<li>Ready to use Funnel Templates</li>\n<li>Community Support</li>\n</ul>\n<h3>What will you get if you upgrade to SellKit Pro?</h3>\n<p>Everything in the Free version and…</p>\n<ul>\n<li>Pro Checkout Features</li>\n<li>Cart Optimisations</li>\n<li>Personalized coupons</li>\n<li>Dynamic Discounts</li>\n<li>Smart Alerts</li>\n<li>Advanced Product Catalog Filters</li>\n<li>Product Catalog Swatches</li>\n<li>Advanced Analytics</li>\n<li>Advanced Customer Segmentation</li>\n<li>Pro Ready to use Templates</li>\n<li>Standard Support</li>\n</ul>\n<h3>How SellKit pricing blows away the competition</h3>\n<p>If you’re using too many tools to increase sales for your online business and looking for a unified, cost-effective option, Selkit is the best all-in-one solution, offering the functionality of:</p>\n<ul>\n<li>Funnel builders (Cartflows, BuildWooFunnels, Clickfunnels)</li>\n<li>One-click order bump plugins (IconicWP Sales Booster,&#8230; )</li>\n<li>One-click Upsell &amp; Downsell plugins (Yith Deals, UpStroke, WooCommerce Checkout Add-Ons)</li>\n<li>Discounts &amp; Coupons plugins (SmartAdvanced Coupons, WooCommerce Dynamic Pricing &amp; Discounts, Yith dynamic pricing &amp; discount, StoreApps)</li>\n<li>Alerts plugins (Yith cart messages, Skyverge CardNotices)</li>\n</ul>\n<p><strong>Total Value: $900/year<br />\nSellKit: $199/year (Save $700/year)</strong></p>\n<h3>All features at a glance</h3>\n<ul>\n<li>Drag &amp; Drop mobile-optimized funnel builder</li>\n<li>One-click upsell and downsell</li>\n<li>One-click order bump</li>\n<li>Opt-in and opt-in confirmation funnel steps</li>\n<li>Beautiful readymade designs for cart, checkout, upsell, downhill and thank you page</li>\n<li>Advanced funnels analytics (visits, bounce rate, orders, revenue, conversion rate, AOV)</li>\n<li>Comparative analytics charts</li>\n<li>Customizable thank you page</li>\n<li>Supports all major payment gateways</li>\n<li>Design, order, reorder your checkout form fields</li>\n<li>Multi-step OR single step checkout</li>\n<li>Email grab in the beginning of checkout instead of the end</li>\n<li>Auto-populate State</li>\n<li>Address Autocomplete</li>\n<li>Pre-populate Form Data</li>\n<li>Pre-filled form for abandoned users</li>\n<li>Add custom checkout fields</li>\n<li>Auto-Apply Coupons</li>\n<li>Express Checkout</li>\n<li>Product-specific checkouts</li>\n<li>Swap Global Checkout</li>\n<li>Checkout Expiry</li>\n<li>Custom thank you page</li>\n<li>Skip Cart</li>\n<li>Auto-apply discounts with advanced segmentation</li>\n<li>Personalized coupons with advanced segmentation</li>\n<li>Smart alerts with advanced segmentation</li>\n<li>Funnel Export/Import/Duplicate</li>\n</ul>\n<h3>Support</h3>\n<ul>\n<li>30 Day money-back guarantee (No questions asked!)</li>\n<li>Cancel any time</li>\n<li>24/7 support</li>\n</ul>\n<h3>Integrations</h3>\n<p>SellKit is fully integrated with:</p>\n<ul>\n<li>Facebook Pixel</li>\n<li>Google Analytics</li>\n<li>Elementor page builder</li>\n</ul>\n<h3>NOTE</h3>\n<p>Main functionalities are only compatible with Elementor at the moment. Compatibility with more builders are in development.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/sellkit.2.0.5.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/sellkit/assets/screenshot-1.jpg?rev=2821977",
            "caption": "Advanced Segmentation (ONLY in PRO)"
        },
        {
            "src": "https://ps.w.org/sellkit/assets/screenshot-2.jpg?rev=2822073",
            "caption": "Create Automated Discounts (ONLY in PRO)"
        },
        {
            "src": "https://ps.w.org/sellkit/assets/screenshot-3.jpg?rev=2821977",
            "caption": "Create Personalized Coupons (ONLY in PRO)"
        },
        {
            "src": "https://ps.w.org/sellkit/assets/screenshot-4.jpg?rev=2821977",
            "caption": "Customize &amp; Preview Your Order Bump Appearance"
        },
        {
            "src": "https://ps.w.org/sellkit/assets/screenshot-5.jpg?rev=2821977",
            "caption": "Display Smart Checkout alerts to engage your customers even further (ONLY in PRO)"
        },
        {
            "src": "https://ps.w.org/sellkit/assets/screenshot-6.jpg?rev=2821977",
            "caption": "Funnel Analytics Engagement"
        },
        {
            "src": "https://ps.w.org/sellkit/assets/screenshot-7.jpg?rev=2821977",
            "caption": "Funnel Analytics Sales"
        },
        {
            "src": "https://ps.w.org/sellkit/assets/screenshot-8.jpg?rev=2675637",
            "caption": "Import All Funnel Steps or Selectively"
        },
        {
            "src": "https://ps.w.org/sellkit/assets/screenshot-9.jpg?rev=2821977",
            "caption": "Order Bump &amp; upsell Conditioning Without Single Line of Coding"
        },
        {
            "src": "https://ps.w.org/sellkit/assets/screenshot-10.jpg?rev=2675637",
            "caption": "Ready-made Recipes"
        },
        {
            "src": "https://ps.w.org/sellkit/assets/screenshot-11.gif?rev=2821977",
            "caption": "Visual Funnel Builder on Canvas"
        }
    ],
    "tags": {
        "checkout-alert": "checkout alert",
        "checkout-optimizer": "checkout optimizer",
        "optimized-checkout": "optimized checkout",
        "sales-funnel": "sales funnel",
        "smart-coupon": "smart coupon"
    },
    "stable_tag": "2.0.5",
    "versions": {
        "1.1.0": "https://downloads.wordpress.org/plugin/sellkit.1.1.0.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/sellkit.1.1.4.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/sellkit.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/sellkit.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/sellkit.1.2.3.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/sellkit.1.2.5.zip",
        "1.2.9": "https://downloads.wordpress.org/plugin/sellkit.1.2.9.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/sellkit.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/sellkit.1.3.2.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/sellkit.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/sellkit.1.5.1.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/sellkit.1.5.4.zip",
        "1.5.7": "https://downloads.wordpress.org/plugin/sellkit.1.5.7.zip",
        "1.5.8": "https://downloads.wordpress.org/plugin/sellkit.1.5.8.zip",
        "1.5.9": "https://downloads.wordpress.org/plugin/sellkit.1.5.9.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/sellkit.1.6.2.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/sellkit.1.6.5.zip",
        "1.6.8": "https://downloads.wordpress.org/plugin/sellkit.1.6.8.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/sellkit.1.7.2.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/sellkit.1.7.4.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/sellkit.1.7.5.zip",
        "1.7.9": "https://downloads.wordpress.org/plugin/sellkit.1.7.9.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/sellkit.1.8.1.zip",
        "1.8.3": "https://downloads.wordpress.org/plugin/sellkit.1.8.3.zip",
        "1.8.6": "https://downloads.wordpress.org/plugin/sellkit.1.8.6.zip",
        "1.8.9": "https://downloads.wordpress.org/plugin/sellkit.1.8.9.zip",
        "1.9.2": "https://downloads.wordpress.org/plugin/sellkit.1.9.2.zip",
        "1.9.3": "https://downloads.wordpress.org/plugin/sellkit.1.9.3.zip",
        "1.9.6": "https://downloads.wordpress.org/plugin/sellkit.1.9.6.zip",
        "1.9.8": "https://downloads.wordpress.org/plugin/sellkit.1.9.8.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/sellkit.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/sellkit.2.0.1.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/sellkit.2.0.5.zip",
        "trunk": "https://downloads.wordpress.org/plugin/sellkit.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://getsellkit.com/",
    "banners": {
        "low": "https://ps.w.org/sellkit/assets/banner-772x250.png?rev=2675638",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/sellkit/assets/icon-256x256.png?rev=2675638",
        "2x": "https://ps.w.org/sellkit/assets/icon-256x256.png?rev=2675638"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 94,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}