{
    "name": "Social Share Buttons",
    "slug": "seo-optimized-share-buttons",
    "version": "1.0",
    "author": "spyrosli",
    "author_profile": "https://profiles.wordpress.org/spyrosli/",
    "contributors": {
        "spyrosli": {
            "profile": "https://profiles.wordpress.org/spyrosli/",
            "avatar": "https://secure.gravatar.com/avatar/09fae9b90867b64a6fc7a110d2b1b4b3?s=96&d=monsterid&r=g",
            "display_name": "Spyrosli"
        }
    },
    "requires": "3.6",
    "tested": "4.7.29",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 92,
    "ratings": {
        "5": 4,
        "4": 0,
        "3": 1,
        "2": 0,
        "1": 0
    },
    "num_ratings": 5,
    "support_url": "https://wordpress.org/support/plugin/seo-optimized-share-buttons/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 300,
    "downloaded": 8786,
    "last_updated": "2016-12-19 08:06:00",
    "added": "2016-12-19",
    "homepage": "",
    "sections": {
        "description": "<p>Add Facebook, Twitter, Google+, LinkedIn, Pinterest and Digg share buttons as well as an Email share button and print button. Above and/or below your pages and posts. It&#8217;s all fully customizable so you choose what social media buttons and social share buttons you want on your website.</p>\n<p>Get your websites content shared on social medias like Twitter, Facebook and much more by installing this Social share WordPress plugin. Users can easily share your content on the most popular social networks.</p>\n<p><strong>Important:</strong> A lot of people request a floating sidebar with social icons, sadly this is not something that will be added, since it can be harmful for your websites SEO. You can read more about that if you scroll down and read under &#8220;Additional information and F.A.Q&#8221;</p>\n<p><strong>Core functionality include</strong></p>\n<ul>\n<li>Minimalistic design</li>\n<li>Share text</li>\n<li>Suggest user an email text and subject</li>\n<li>Social share counter</li>\n<li>Facebook, Twitter, Google+, LinkedIn, Pinterest and Digg share buttons</li>\n<li>Shortcodes</li>\n<li>Email share button</li>\n<li>Print button</li>\n<li>Choose yourself what buttons to show</li>\n<li>Place buttons above and/or under content</li>\n<li>Seo Optimized</li>\n<li>Light code</li>\n<li>Responsive design</li>\n<li>Follows Google Insight guidelines</li>\n<li>Build in cache</li>\n<li>Mobile Optimized and Retina Ready</li>\n</ul>\n<p><strong>Bonus Functionality include</strong></p>\n<ul>\n<li>Show buttons on: Posts, pages, front page, Archives, Attachment pages, Categories, search results and much more.</li>\n<li>Disable all extra CSS and JS so you can make your own design.</li>\n<li>Fetch shares from both HTTP and HTTPS</li>\n<li>Open share box in: New window, same page or popup.</li>\n<li>Multiple shortcode settings</li>\n</ul>\n<p><strong>Seo Optimized and follows Googles new guidelines</strong></p>\n<p>After the release of Googles new overlay update, which you can read more about on <a href=\"https://webmasters.googleblog.com/2016/08/helping-users-easily-access-content-on.html\" rel=\"nofollow ugc\">Google&#8217;s own blog</a> Almost every share plugins are coded so they function as an overlay, where they hide parts of the screen for design and other reasons.</p>\n<p>For example: They have a custom design, where the original design is hidden behind it &#8211; Or functions as a sidebar or so that follows the screen when you scroll. This is only two out of many examples.</p>\n<p>We are the first plugin to fix this issue, by coding the design in a new way, where we have altered the original code provided by social networks such as Facebook, Twitter and more, and made the design that way.</p>\n<p>Not only does this help avoiding getting punished by the Google update, we have also made the code quicker, meaning we have set a new record in how fast social media share buttons can be loaded, which you can read more about under Lightning Fast Load Time.</p>\n<p>We are also the first social share plugin to follow every single guideline and requirement from <a href=\"https://developers.google.com/speed/docs/insights/rules\" rel=\"nofollow ugc\">Google Insight</a> making this plugin the ultimative SEO optimized share plugin.</p>\n<p><strong>Lightning Fast</strong></p>\n<p>Usually it will take between 1,0 &#8211; 2,5 seconds to load social media buttons, because there is so much external data that needs to be loaded. We have found a way to overcome this issue. We have created a built in social share caching, a custom cache that stores all data from the social networks, for example scripts, amount of likes/tweets and much more on your website instead of Facebook, Twitters and more, cutting the loading process down to milliseconds.</p>\n<p>We have also altered the usual scripts provided by the social networks, we have managed to bring the load time of social share buttons down by up to 0.7 seconds! Bringing the load time down to 30% of the usual load time &#8211; And as every SEO expert know, page speed and load time is a huge part of your SEO and rankings, which you can read more about on <a href=\"https://moz.com/learn/seo/page-speed\" rel=\"nofollow ugc\">MOZ</a></p>\n<p><strong>Source and copyright</strong></p>\n<ul>\n<li>Thanks to Access Keys for creating <a href=\"https://wordpress.org/plugins/accesspress-social-share/\" rel=\"ugc\">Social Share WordPress Plugin &#8211; AccessPress Social Share</a> under <a href=\"http://www.gnu.org/licenses/gpl-2.0.html\" rel=\"nofollow ugc\">GPLv2</a></li>\n<li>Thanks to <a href=\"http://fontawesome.io/\" rel=\"nofollow ugc\">FontAwesome</a> which is licensed under MIT License · Documentation licensed under CC BY 3.0</li>\n</ul>\n<p><strong>Core Changes</strong></p>\n<ul>\n<li>We have made the code light weight with minification and code rewriting.</li>\n<li>We have corrected cache settings so they follow Googles guidelines.</li>\n<li>We have updated the design and animations.</li>\n<li>We have SEO optimized the share buttons.</li>\n<li>We have made the design responsive and fluid so it follows <a href=\"https://developers.google.com/speed/pagespeed/insights/\" rel=\"nofollow ugc\">Google Insights</a> guidelines</li>\n<li>We have updated descriptions</li>\n<li>We have added more documentation and articles to help the users make the right settings according to their website.</li>\n<li>We have removed fonts to make it load faster.</li>\n<li>We have corrected typographical errors.</li>\n</ul>\n<p><strong>Further info and good-to-know</strong></p>\n<p><strong>Why is there no floating sidebar?</strong></p>\n<p>It is our primary task to make sure that you do not get punished by any Google updates now, or in the future.<br />\nAfter Googles update that is supose to: &#8220;Helping users easily access content on mobile&#8221; any sort of overlays<br />\nmight be mistaken for popups and harm your SEO.</p>\n<p>Source: <a href=\"https://webmasters.googleblog.com/2016/08/helping-users-easily-access-content-on.html?m=1\" rel=\"nofollow ugc\">Google webmaster blog</a></p>\n<p><strong>What does light weight code mean?</strong></p>\n<p>A &#8220;lightweight&#8221; library or tool in software engineering generally means a library that is less of a pain in the ass to use but not as fully-featured as an equivalent library that is not lightweight. There is a trade-off between pain-in-the-ass-ness and functionality. &#8220;Lightweight&#8221; means a design that errs on the side of less functionality.</p>\n<ul>\n<li>It can be less of a pain in the ass in several different ways including</li>\n<li>Few or no dependencies on other libraries.</li>\n<li>Easy to install, set up, and/or build.</li>\n<li>Smaller memory footprint.</li>\n<li>Smaller interface.</li>\n<li>Smaller absolute amount of code.</li>\n</ul>\n<p>Source: <a href=\"https://www.quora.com/What-exactly-does-lightweight-mean-when-describing-databases-or-software-frameworks\" rel=\"nofollow ugc\">Quora</a></p>\n<p><strong>Why does the buttons slow down my website?</strong></p>\n<p>Here&#8217;s how social share buttons work: The vast majority of social media buttons have a direct interaction with the social network involved. Most of them just have counters, like a Facebook fan count or a Twitter follower count. Where is that count kept? On the servers of the social network, provided via an API. Typically, the output is going to just be a short text string, but even so, that text string needs to be queried and received. So, for a Facebook button with a share button, you might have a process that looks like this.</p>\n<ol>\n<li>The user sends a request to load your page.</li>\n<li>Your server processes the request and begins loading your page.</li>\n<li>Your load encounters the script that loads the Facebook share button and begins to run the script.</li>\n<li>The script requires data from Facebook and sends a request to the Facebook servers.</li>\n<li>The Facebook servers receive the request and query their database for the relevant data.</li>\n<li>The Facebook data is received and send back to your server.</li>\n<li>Your server inputs the data in the relevant place in the script, which completes the load of that script and, presumably, the page.</li>\n<li>This is a lengthy process, and that’s just for one simple social media button. Now repeat it for Twitter if you have a Twitter button with a follower count, and repeat it for Pinterest for pins, and repeat it for Reddit for upvotes, and repeat it for every other site you have a button for.</li>\n</ol>\n<p>This is a lengthy process, and that’s just for one simple social media button. Now repeat it for Twitter if you have a Twitter button with a follower count, and repeat it for Pinterest for pins, and repeat it for Reddit for upvotes, and repeat it for every other site you have a button for.</p>\n<p>I gets even slower if you use something like the Facebook like box, which not only needs to pick and send along like data, it needs to send over a selection of users with their profile pictures, names, and links. That can become a sizable chunk of data.</p>\n<p>Of course, social networks need to have incredibly fast load times in order to attract and keep users. Facebook has a server farm to rival that of Google and they’re tapped into a backbone just as fast as what Google has. At least, I assume so; I don’t know the details of either company’s infrastructure.</p>\n<p>Even so, no matter how fast the servers, there’s still time spent sending queries and returning data. Every button you add, every query of another domain or another server, is adding to your load times. Even if it’s just a few hundred milliseconds per request, that can add up very quickly.</p>\n<p>This, by the way, is why APIs exist. An API call exports just the data necessary, nothing more. Compare these two pages: Facebook and the Facebook Graph. You’ll note that the second one doesn’t have scripts, doesn’t have feeds, doesn’t have apps; nothing. It’s just a bit of short text. It’s an error because the “graph homepage” doesn’t exist, but that’s still about all of the data you actually get from an API Call. A few hundred bytes of information, compared to the kilobytes or megabytes of data for a regular page load.</p>\n<p>The more social buttons you use, the more calls need to be made, and the slower a page loads. If, somewhere along the line, a single piece of data bugs out or a request fails, the button won’t load. Some social buttons have error handling to cover that case, while others don’t. If they don’t, it can be devastating to load times.</p>\n<p>Source: <a href=\"http://blogpros.com/blog/2016/01/why-social-buttons-slow-down-your-websites-load-time\" rel=\"nofollow ugc\">Blogpros</a></p>\n<p><strong>Why is social share buttons good for my website</strong></p>\n<p>Operating a business blog is a great way to communicate with target audience members and share your thoughts and opinions on business matters in an informal way. It’s not easy to maintain a blog as it takes time to brainstorm a topic, write posts, edit them, post them, and then monitor the comments. If you’re going to dedicate all of that time to your blog you want to get the most out of it, right? The success of a blog largely depends on how many people actually read it and one important way to increase readership is to include social share buttons on every blog post.</p>\n<p>Do you have social share buttons on your blog? If not, you’ll want to add them now. Here’s why:</p>\n<p><strong>Social Signals</strong></p>\n<p>The search engines now include the strength of a link in social media as an algorithm-ranking factor. Strength is measured by calculating the number of times that content is shared, tweeted, liked, and posted in social media. So if your content is getting shared frequently, that will improve its search engine ranking for relevant keywords. Since social share buttons make it so much easier for a reader to pass along your content to their network, without them you are missing out on a huge opportunity.</p>\n<p><strong>Increase brand exposure</strong></p>\n<p>Marketing and advertising is all about getting your brand and messaging in front of as many potential clients and customers as possible. Millions of people use social networks every day. Obviously not everyone that could benefit from your product or service has heard of you. Including social share buttons increases the likelihood of getting your content in front of new eyeballs. When someone shares your content with their network, it might get seen by a new potential customer, who then may share it with their network, and another new potential customer who then may share it with their network, etc. may see it. The possibilities are limitless and this is an important way to improve brand visibility across the web and increase your number of social followers.</p>\n<p><strong>Encourge a good user experience</strong></p>\n<p>It’s important to make any interaction that a potential client or customer has with your brand a smooth and easy process. It should be simple to navigate your blog, which should include categories and a search feature so that visitors can quickly find a post that is most relevant to their needs at any particular time. You should also make it easy for them to share your content, so easy that they don’t even need to think about it. If they think it’s helpful or interesting they can quickly click on a button and boom, it’s shared.</p>\n<p><strong>Develop natural links</strong><br />\nBecause of the social share buttons, people will share your links with others, as long as it’s well written and provides value. Over time, people will do more than just share the links on social – they’ll create valuable, natural links. As more and more people share your content on social media, you’ll increase the chances of gaining natural links.</p>\n<p><strong>Get more traffic</strong><br />\nOne of the biggest benefits of adding social share buttons is that it can help increase traffic to your site. With so many content options online, it can be hard to get your information read. Simply put, sharing content increases overall traffic. Instead of making it hard for people to share, make it easy by including sharing buttons.</p>\n<p>You want your social share buttons to add value to your site. For instance, when including the buttons to your posts, you may be tempted to put them at the top or bottom. However, it’s much more effective to put them in both places, which adds value both for you and the user. Another issue is that not every page on your site will need the buttons. For instance, if you have a static page, such as an about me page, adding social share buttons to these posts doesn’t really add anything. Do you really want to these pages to be shared in social? However, you definitely will want your blog content to be shared, so it makes sense to add the buttons to your posts.</p>\n<p>If you don’t include the buttons there’s a higher likelihood that it won’t get shared, or that someone who has the intent to share the content opens up a new window, signs in to their social network, gets distracted and forgets about your page altogether. Don’t take the risk. Add share buttons so that blog visitors will stay on your site longer.</p>\n<p>Source: <a href=\"http://www.brickmarketing.com/blog/social-share-buttons.htm\" rel=\"nofollow ugc\">Brick Marketing</a></p>\n<p><strong>How does the caching the social share buttons work?</strong><br />\nThe sharing widget will typically consist of a few small icons, some HTML and CSS, and other JavaScript. Typically, the icons are very small and rarely change, but they’re served billions of times a day.</p>\n<p>These sharing icons are perfect candidates for very aggressive caching. When we chat with customers about this, we recommend setting a very long time to live (TTL) and an even longer grace period (also known as a “serve stale” period which will continue showing your content even if your origin server is unavailable). Then, if our customers do want to change anything, they can issue a purge and Fastly will fetch the new assets immediately.</p>\n<p>Since the working set is so small, for similar setups we typically see a 100% cache hit ratio. This means customers can dramatically lower their hosting costs while ensuring that they’ll be able to weather request spikes that occur when, for example, a story that has the sharing widget embedded suddenly sees a lot of traffic, without breaking a sweat.</p>\n<p>There is a dynamic element to a sharing widget: the share count. There are typically two ways to deliver this:</p>\n<ol>\n<li>Baked into the HTML or JavaScript that you deliver</li>\n<li>Via an API that the JavaScript calls</li>\n</ol>\n<p>Doing it the first way would ruin your cache hit ratio for all those previously cacheable assets, since you’ll need a new version of the widget every time a user Likes the page. By doing it the second way, you can minimize the problem to just one API call, which isn’t too bad.</p>\n<p>With Fastly, there is a third option. Here’s how it works:</p>\n<p>The share count actually doesn’t need to be absolutely up-to-the-second accurate. Instead, Fastly caches the results of the API call for ~5 minutes (this number is completely configurable depending on traffic and other factors). Every time a user clicks on the social share button, JavaScript first updates the counter on the page and then does an API call to update the counts. Fastly can either pass this API call through to origin or intercept it and return a 200 response, but emit a log message with the relevant information.</p>\n<p>However, if the user navigates away from the page and then comes back (or clicks through to the second page of a multi-page article) within that 5 minute window, they’re going to see that their “Share” hasn’t been counted, which is confusing.</p>\n<p>In that case, there’s a fairly easy work around. When the user clicks “Like” or “Share,” the JavaScript updates the counter on the widget and sets a cookie with the new count in it before making the call back to register the “Like” or “Share.”</p>\n<p>When the social share button is loaded again, the widget code first checks to see if the cookie is present (or alternatively, is newer than the last-modified of the API call) and uses those values. If not, it uses the values from the API.<br />\nWe still avoid the additional call back to the customer’s origin server, but the user is happy that their “Like” or “Share” has has been counted.</p>\n<p>Meanwhile, the widget will load incredibly quickly and the customer will have reduced their load back to their servers from potentially billions a day to:</p>\n<p>1 request per asset every time they update their widget<br />\n1 request every 5 minutes to fetch the updated count<br />\n1 POST request every time a user hits the social share button (unless they use logs instead)</p>\n<p>Source: <a href=\"https://www.fastly.com/blog/caching-like-and-share-buttons\" rel=\"nofollow ugc\">Fastly</a></p>\n",
        "installation": "<p><strong>Uploading via the WordPress admin panel:</strong></p>\n<ol>\n<li>Visit Plugins-&gt;Add New in the admin WordPress Panel after logging in.</li>\n<li>Click &#8216;Upload Plugin&#8217; next to the page title at the top of the page.</li>\n<li>Select the location of your plugin zip in the file uploader input.</li>\n<li>Click Upload, and the plugin will be uploaded and installed for you quickly and easily.</li>\n<li>You will now be asked if you want to activate the plugin, choose yes.</li>\n<li>For customizing the plugin&#8217;s settings, click on &#8220;Share Buttons&#8221; in the left admin menu.</li>\n</ol>\n<p><strong>Choosing social networks</strong></p>\n<ul>\n<li>Click the tab Social Networks.</li>\n<li>Use drag and drop to order the buttons.</li>\n<li>Check the social media platforms you wish to show on your website.</li>\n</ul>\n<p><strong>Choosing where you want your buttons to appear</strong></p>\n<ul>\n<li>Click the tab Display Settings.</li>\n<li>Choose the page types you want your social share buttons to appear, etc pages and posts</li>\n</ul>\n<p><strong>Choosing button placement and design</strong></p>\n<ul>\n<li>Click the tab Design and Placement</li>\n<li>Choose where you want your buttons to appear, for example above content</li>\n<li>Choose a design you like, for example Theme 1</li>\n</ul>\n<p><strong>Optional settings</strong></p>\n<ul>\n<li>Click the tab Miscellaneous</li>\n<li>Choose if you want to use your own JS and CSS or not</li>\n<li>Type in your share text </li>\n<li>Choose if you want to show how many have shared your website or not</li>\n<li>If you have moved from HTTP to HTTPS previously then check the setting</li>\n<li>Choose if you want to open the share box in a new window or same, please read the description for good information</li>\n<li>Choose to keep or disable caching, we always recommend you to keep it.</li>\n<li>Choose email settings and what the standard message should be when people share your website through email</li>\n</ul>\n",
        "faq": "\n<h4>Installation Instructions</h4>\n<p>\n<p><strong>Uploading via the WordPress admin panel:</strong></p>\n<ol>\n<li>Visit Plugins-&gt;Add New in the admin WordPress Panel after logging in.</li>\n<li>Click &#8216;Upload Plugin&#8217; next to the page title at the top of the page.</li>\n<li>Select the location of your plugin zip in the file uploader input.</li>\n<li>Click Upload, and the plugin will be uploaded and installed for you quickly and easily.</li>\n<li>You will now be asked if you want to activate the plugin, choose yes.</li>\n<li>For customizing the plugin&#8217;s settings, click on &#8220;Share Buttons&#8221; in the left admin menu.</li>\n</ol>\n<p><strong>Choosing social networks</strong></p>\n<ul>\n<li>Click the tab Social Networks.</li>\n<li>Use drag and drop to order the buttons.</li>\n<li>Check the social media platforms you wish to show on your website.</li>\n</ul>\n<p><strong>Choosing where you want your buttons to appear</strong></p>\n<ul>\n<li>Click the tab Display Settings.</li>\n<li>Choose the page types you want your social share buttons to appear, etc pages and posts</li>\n</ul>\n<p><strong>Choosing button placement and design</strong></p>\n<ul>\n<li>Click the tab Design and Placement</li>\n<li>Choose where you want your buttons to appear, for example above content</li>\n<li>Choose a design you like, for example Theme 1</li>\n</ul>\n<p><strong>Optional settings</strong></p>\n<ul>\n<li>Click the tab Miscellaneous</li>\n<li>Choose if you want to use your own JS and CSS or not</li>\n<li>Type in your share text </li>\n<li>Choose if you want to show how many have shared your website or not</li>\n<li>If you have moved from HTTP to HTTPS previously then check the setting</li>\n<li>Choose if you want to open the share box in a new window or same, please read the description for good information</li>\n<li>Choose to keep or disable caching, we always recommend you to keep it.</li>\n<li>Choose email settings and what the standard message should be when people share your website through email</li>\n</ul>\n</p>\n\n"
    },
    "short_description": "Follow the new guidelines from Google with our social share buttons so you don&#039;t get punished and drop in rank! We have done all the work for you &hellip;",
    "description": "<p>Add Facebook, Twitter, Google+, LinkedIn, Pinterest and Digg share buttons as well as an Email share button and print button. Above and/or below your pages and posts. It&#8217;s all fully customizable so you choose what social media buttons and social share buttons you want on your website.</p>\n<p>Get your websites content shared on social medias like Twitter, Facebook and much more by installing this Social share WordPress plugin. Users can easily share your content on the most popular social networks.</p>\n<p><strong>Important:</strong> A lot of people request a floating sidebar with social icons, sadly this is not something that will be added, since it can be harmful for your websites SEO. You can read more about that if you scroll down and read under &#8220;Additional information and F.A.Q&#8221;</p>\n<p><strong>Core functionality include</strong></p>\n<ul>\n<li>Minimalistic design</li>\n<li>Share text</li>\n<li>Suggest user an email text and subject</li>\n<li>Social share counter</li>\n<li>Facebook, Twitter, Google+, LinkedIn, Pinterest and Digg share buttons</li>\n<li>Shortcodes</li>\n<li>Email share button</li>\n<li>Print button</li>\n<li>Choose yourself what buttons to show</li>\n<li>Place buttons above and/or under content</li>\n<li>Seo Optimized</li>\n<li>Light code</li>\n<li>Responsive design</li>\n<li>Follows Google Insight guidelines</li>\n<li>Build in cache</li>\n<li>Mobile Optimized and Retina Ready</li>\n</ul>\n<p><strong>Bonus Functionality include</strong></p>\n<ul>\n<li>Show buttons on: Posts, pages, front page, Archives, Attachment pages, Categories, search results and much more.</li>\n<li>Disable all extra CSS and JS so you can make your own design.</li>\n<li>Fetch shares from both HTTP and HTTPS</li>\n<li>Open share box in: New window, same page or popup.</li>\n<li>Multiple shortcode settings</li>\n</ul>\n<p><strong>Seo Optimized and follows Googles new guidelines</strong></p>\n<p>After the release of Googles new overlay update, which you can read more about on <a href=\"https://webmasters.googleblog.com/2016/08/helping-users-easily-access-content-on.html\" rel=\"nofollow ugc\">Google&#8217;s own blog</a> Almost every share plugins are coded so they function as an overlay, where they hide parts of the screen for design and other reasons.</p>\n<p>For example: They have a custom design, where the original design is hidden behind it &#8211; Or functions as a sidebar or so that follows the screen when you scroll. This is only two out of many examples.</p>\n<p>We are the first plugin to fix this issue, by coding the design in a new way, where we have altered the original code provided by social networks such as Facebook, Twitter and more, and made the design that way.</p>\n<p>Not only does this help avoiding getting punished by the Google update, we have also made the code quicker, meaning we have set a new record in how fast social media share buttons can be loaded, which you can read more about under Lightning Fast Load Time.</p>\n<p>We are also the first social share plugin to follow every single guideline and requirement from <a href=\"https://developers.google.com/speed/docs/insights/rules\" rel=\"nofollow ugc\">Google Insight</a> making this plugin the ultimative SEO optimized share plugin.</p>\n<p><strong>Lightning Fast</strong></p>\n<p>Usually it will take between 1,0 &#8211; 2,5 seconds to load social media buttons, because there is so much external data that needs to be loaded. We have found a way to overcome this issue. We have created a built in social share caching, a custom cache that stores all data from the social networks, for example scripts, amount of likes/tweets and much more on your website instead of Facebook, Twitters and more, cutting the loading process down to milliseconds.</p>\n<p>We have also altered the usual scripts provided by the social networks, we have managed to bring the load time of social share buttons down by up to 0.7 seconds! Bringing the load time down to 30% of the usual load time &#8211; And as every SEO expert know, page speed and load time is a huge part of your SEO and rankings, which you can read more about on <a href=\"https://moz.com/learn/seo/page-speed\" rel=\"nofollow ugc\">MOZ</a></p>\n<p><strong>Source and copyright</strong></p>\n<ul>\n<li>Thanks to Access Keys for creating <a href=\"https://wordpress.org/plugins/accesspress-social-share/\" rel=\"ugc\">Social Share WordPress Plugin &#8211; AccessPress Social Share</a> under <a href=\"http://www.gnu.org/licenses/gpl-2.0.html\" rel=\"nofollow ugc\">GPLv2</a></li>\n<li>Thanks to <a href=\"http://fontawesome.io/\" rel=\"nofollow ugc\">FontAwesome</a> which is licensed under MIT License · Documentation licensed under CC BY 3.0</li>\n</ul>\n<p><strong>Core Changes</strong></p>\n<ul>\n<li>We have made the code light weight with minification and code rewriting.</li>\n<li>We have corrected cache settings so they follow Googles guidelines.</li>\n<li>We have updated the design and animations.</li>\n<li>We have SEO optimized the share buttons.</li>\n<li>We have made the design responsive and fluid so it follows <a href=\"https://developers.google.com/speed/pagespeed/insights/\" rel=\"nofollow ugc\">Google Insights</a> guidelines</li>\n<li>We have updated descriptions</li>\n<li>We have added more documentation and articles to help the users make the right settings according to their website.</li>\n<li>We have removed fonts to make it load faster.</li>\n<li>We have corrected typographical errors.</li>\n</ul>\n<p><strong>Further info and good-to-know</strong></p>\n<p><strong>Why is there no floating sidebar?</strong></p>\n<p>It is our primary task to make sure that you do not get punished by any Google updates now, or in the future.<br />\nAfter Googles update that is supose to: &#8220;Helping users easily access content on mobile&#8221; any sort of overlays<br />\nmight be mistaken for popups and harm your SEO.</p>\n<p>Source: <a href=\"https://webmasters.googleblog.com/2016/08/helping-users-easily-access-content-on.html?m=1\" rel=\"nofollow ugc\">Google webmaster blog</a></p>\n<p><strong>What does light weight code mean?</strong></p>\n<p>A &#8220;lightweight&#8221; library or tool in software engineering generally means a library that is less of a pain in the ass to use but not as fully-featured as an equivalent library that is not lightweight. There is a trade-off between pain-in-the-ass-ness and functionality. &#8220;Lightweight&#8221; means a design that errs on the side of less functionality.</p>\n<ul>\n<li>It can be less of a pain in the ass in several different ways including</li>\n<li>Few or no dependencies on other libraries.</li>\n<li>Easy to install, set up, and/or build.</li>\n<li>Smaller memory footprint.</li>\n<li>Smaller interface.</li>\n<li>Smaller absolute amount of code.</li>\n</ul>\n<p>Source: <a href=\"https://www.quora.com/What-exactly-does-lightweight-mean-when-describing-databases-or-software-frameworks\" rel=\"nofollow ugc\">Quora</a></p>\n<p><strong>Why does the buttons slow down my website?</strong></p>\n<p>Here&#8217;s how social share buttons work: The vast majority of social media buttons have a direct interaction with the social network involved. Most of them just have counters, like a Facebook fan count or a Twitter follower count. Where is that count kept? On the servers of the social network, provided via an API. Typically, the output is going to just be a short text string, but even so, that text string needs to be queried and received. So, for a Facebook button with a share button, you might have a process that looks like this.</p>\n<ol>\n<li>The user sends a request to load your page.</li>\n<li>Your server processes the request and begins loading your page.</li>\n<li>Your load encounters the script that loads the Facebook share button and begins to run the script.</li>\n<li>The script requires data from Facebook and sends a request to the Facebook servers.</li>\n<li>The Facebook servers receive the request and query their database for the relevant data.</li>\n<li>The Facebook data is received and send back to your server.</li>\n<li>Your server inputs the data in the relevant place in the script, which completes the load of that script and, presumably, the page.</li>\n<li>This is a lengthy process, and that’s just for one simple social media button. Now repeat it for Twitter if you have a Twitter button with a follower count, and repeat it for Pinterest for pins, and repeat it for Reddit for upvotes, and repeat it for every other site you have a button for.</li>\n</ol>\n<p>This is a lengthy process, and that’s just for one simple social media button. Now repeat it for Twitter if you have a Twitter button with a follower count, and repeat it for Pinterest for pins, and repeat it for Reddit for upvotes, and repeat it for every other site you have a button for.</p>\n<p>I gets even slower if you use something like the Facebook like box, which not only needs to pick and send along like data, it needs to send over a selection of users with their profile pictures, names, and links. That can become a sizable chunk of data.</p>\n<p>Of course, social networks need to have incredibly fast load times in order to attract and keep users. Facebook has a server farm to rival that of Google and they’re tapped into a backbone just as fast as what Google has. At least, I assume so; I don’t know the details of either company’s infrastructure.</p>\n<p>Even so, no matter how fast the servers, there’s still time spent sending queries and returning data. Every button you add, every query of another domain or another server, is adding to your load times. Even if it’s just a few hundred milliseconds per request, that can add up very quickly.</p>\n<p>This, by the way, is why APIs exist. An API call exports just the data necessary, nothing more. Compare these two pages: Facebook and the Facebook Graph. You’ll note that the second one doesn’t have scripts, doesn’t have feeds, doesn’t have apps; nothing. It’s just a bit of short text. It’s an error because the “graph homepage” doesn’t exist, but that’s still about all of the data you actually get from an API Call. A few hundred bytes of information, compared to the kilobytes or megabytes of data for a regular page load.</p>\n<p>The more social buttons you use, the more calls need to be made, and the slower a page loads. If, somewhere along the line, a single piece of data bugs out or a request fails, the button won’t load. Some social buttons have error handling to cover that case, while others don’t. If they don’t, it can be devastating to load times.</p>\n<p>Source: <a href=\"http://blogpros.com/blog/2016/01/why-social-buttons-slow-down-your-websites-load-time\" rel=\"nofollow ugc\">Blogpros</a></p>\n<p><strong>Why is social share buttons good for my website</strong></p>\n<p>Operating a business blog is a great way to communicate with target audience members and share your thoughts and opinions on business matters in an informal way. It’s not easy to maintain a blog as it takes time to brainstorm a topic, write posts, edit them, post them, and then monitor the comments. If you’re going to dedicate all of that time to your blog you want to get the most out of it, right? The success of a blog largely depends on how many people actually read it and one important way to increase readership is to include social share buttons on every blog post.</p>\n<p>Do you have social share buttons on your blog? If not, you’ll want to add them now. Here’s why:</p>\n<p><strong>Social Signals</strong></p>\n<p>The search engines now include the strength of a link in social media as an algorithm-ranking factor. Strength is measured by calculating the number of times that content is shared, tweeted, liked, and posted in social media. So if your content is getting shared frequently, that will improve its search engine ranking for relevant keywords. Since social share buttons make it so much easier for a reader to pass along your content to their network, without them you are missing out on a huge opportunity.</p>\n<p><strong>Increase brand exposure</strong></p>\n<p>Marketing and advertising is all about getting your brand and messaging in front of as many potential clients and customers as possible. Millions of people use social networks every day. Obviously not everyone that could benefit from your product or service has heard of you. Including social share buttons increases the likelihood of getting your content in front of new eyeballs. When someone shares your content with their network, it might get seen by a new potential customer, who then may share it with their network, and another new potential customer who then may share it with their network, etc. may see it. The possibilities are limitless and this is an important way to improve brand visibility across the web and increase your number of social followers.</p>\n<p><strong>Encourge a good user experience</strong></p>\n<p>It’s important to make any interaction that a potential client or customer has with your brand a smooth and easy process. It should be simple to navigate your blog, which should include categories and a search feature so that visitors can quickly find a post that is most relevant to their needs at any particular time. You should also make it easy for them to share your content, so easy that they don’t even need to think about it. If they think it’s helpful or interesting they can quickly click on a button and boom, it’s shared.</p>\n<p><strong>Develop natural links</strong><br />\nBecause of the social share buttons, people will share your links with others, as long as it’s well written and provides value. Over time, people will do more than just share the links on social – they’ll create valuable, natural links. As more and more people share your content on social media, you’ll increase the chances of gaining natural links.</p>\n<p><strong>Get more traffic</strong><br />\nOne of the biggest benefits of adding social share buttons is that it can help increase traffic to your site. With so many content options online, it can be hard to get your information read. Simply put, sharing content increases overall traffic. Instead of making it hard for people to share, make it easy by including sharing buttons.</p>\n<p>You want your social share buttons to add value to your site. For instance, when including the buttons to your posts, you may be tempted to put them at the top or bottom. However, it’s much more effective to put them in both places, which adds value both for you and the user. Another issue is that not every page on your site will need the buttons. For instance, if you have a static page, such as an about me page, adding social share buttons to these posts doesn’t really add anything. Do you really want to these pages to be shared in social? However, you definitely will want your blog content to be shared, so it makes sense to add the buttons to your posts.</p>\n<p>If you don’t include the buttons there’s a higher likelihood that it won’t get shared, or that someone who has the intent to share the content opens up a new window, signs in to their social network, gets distracted and forgets about your page altogether. Don’t take the risk. Add share buttons so that blog visitors will stay on your site longer.</p>\n<p>Source: <a href=\"http://www.brickmarketing.com/blog/social-share-buttons.htm\" rel=\"nofollow ugc\">Brick Marketing</a></p>\n<p><strong>How does the caching the social share buttons work?</strong><br />\nThe sharing widget will typically consist of a few small icons, some HTML and CSS, and other JavaScript. Typically, the icons are very small and rarely change, but they’re served billions of times a day.</p>\n<p>These sharing icons are perfect candidates for very aggressive caching. When we chat with customers about this, we recommend setting a very long time to live (TTL) and an even longer grace period (also known as a “serve stale” period which will continue showing your content even if your origin server is unavailable). Then, if our customers do want to change anything, they can issue a purge and Fastly will fetch the new assets immediately.</p>\n<p>Since the working set is so small, for similar setups we typically see a 100% cache hit ratio. This means customers can dramatically lower their hosting costs while ensuring that they’ll be able to weather request spikes that occur when, for example, a story that has the sharing widget embedded suddenly sees a lot of traffic, without breaking a sweat.</p>\n<p>There is a dynamic element to a sharing widget: the share count. There are typically two ways to deliver this:</p>\n<ol>\n<li>Baked into the HTML or JavaScript that you deliver</li>\n<li>Via an API that the JavaScript calls</li>\n</ol>\n<p>Doing it the first way would ruin your cache hit ratio for all those previously cacheable assets, since you’ll need a new version of the widget every time a user Likes the page. By doing it the second way, you can minimize the problem to just one API call, which isn’t too bad.</p>\n<p>With Fastly, there is a third option. Here’s how it works:</p>\n<p>The share count actually doesn’t need to be absolutely up-to-the-second accurate. Instead, Fastly caches the results of the API call for ~5 minutes (this number is completely configurable depending on traffic and other factors). Every time a user clicks on the social share button, JavaScript first updates the counter on the page and then does an API call to update the counts. Fastly can either pass this API call through to origin or intercept it and return a 200 response, but emit a log message with the relevant information.</p>\n<p>However, if the user navigates away from the page and then comes back (or clicks through to the second page of a multi-page article) within that 5 minute window, they’re going to see that their “Share” hasn’t been counted, which is confusing.</p>\n<p>In that case, there’s a fairly easy work around. When the user clicks “Like” or “Share,” the JavaScript updates the counter on the widget and sets a cookie with the new count in it before making the call back to register the “Like” or “Share.”</p>\n<p>When the social share button is loaded again, the widget code first checks to see if the cookie is present (or alternatively, is newer than the last-modified of the API call) and uses those values. If not, it uses the values from the API.<br />\nWe still avoid the additional call back to the customer’s origin server, but the user is happy that their “Like” or “Share” has has been counted.</p>\n<p>Meanwhile, the widget will load incredibly quickly and the customer will have reduced their load back to their servers from potentially billions a day to:</p>\n<p>1 request per asset every time they update their widget<br />\n1 request every 5 minutes to fetch the updated count<br />\n1 POST request every time a user hits the social share button (unless they use logs instead)</p>\n<p>Source: <a href=\"https://www.fastly.com/blog/caching-like-and-share-buttons\" rel=\"nofollow ugc\">Fastly</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/seo-optimized-share-buttons.1.0.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/seo-optimized-share-buttons/assets/screenshot-1.png?rev=1560476",
            "caption": "Design"
        }
    ],
    "tags": {
        "buttons": "buttons",
        "share": "share",
        "share-buttons": "share buttons",
        "social": "social",
        "social-share-buttons": "Social Share Buttons"
    },
    "stable_tag": "1.0",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/seo-optimized-share-buttons.1.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/seo-optimized-share-buttons.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/seo-optimized-share-buttons/assets/banner-772x250.png?rev=1560517",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/seo-optimized-share-buttons/assets/icon-128x128.png?rev=1560477"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 92,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}