{
    "name": "ShiftController Employee Shift Scheduling",
    "slug": "shiftcontroller",
    "version": "4.9.66",
    "author": "<a href=\"https://www.shiftcontroller.com/\">plainware.com</a>",
    "author_profile": "https://profiles.wordpress.org/plainware/",
    "contributors": {
        "plainware": {
            "profile": "https://profiles.wordpress.org/plainware/",
            "avatar": "https://secure.gravatar.com/avatar/f36a1bc79979329d07a5fbf8fbef9293?s=96&d=monsterid&r=g",
            "display_name": "plainware"
        }
    },
    "requires": "4.1",
    "tested": "6.6.1",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 86,
    "ratings": {
        "5": 15,
        "4": 0,
        "3": 3,
        "2": 0,
        "1": 2
    },
    "num_ratings": 20,
    "support_url": "https://wordpress.org/support/plugin/shiftcontroller/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 101988,
    "last_updated": "2024-08-24 10:10am GMT",
    "added": "2013-11-19",
    "homepage": "https://www.shiftcontroller.com/",
    "sections": {
        "description": "<p>ShiftController is a lightweight, easy to use WordPress staff scheduling and rostering, rota planning plugin for any business that needs to manage and schedule employees.</p>\n<h4>Keep Organized</h4>\n<p>Associate your employees with calendars, configure shift types, assign managers, and keep your staff scheduling under control anywhere at anytime online from your WordPress powered website!</p>\n<h4>Escape Schedule Conflicts</h4>\n<p>Quickly see and correct any conflicts due to overlapping shifts or timeoffs. Each conflicting entry is highlighted in the schedule calendar so you will not miss it.</p>\n<h4>Mobile Friendly</h4>\n<p>Responsive design that works perfectly well for iPhone, Android, Blackberry, Windows as well as for desktops, laptops and tablets.</p>\n<h3>Pro Version Features</h3>\n<p><strong>Bulk Edit</strong><br />\nThe <a href=\"https://www.shiftcontroller.com/bulk-actions/\" rel=\"nofollow ugc\">Bulk Edit</a> function lets you change or delete multiple shifts at once.</p>\n<p><strong>Repeat Shifts</strong><br />\nQuickly <a href=\"https://www.shiftcontroller.com/recurring-shifts/\" rel=\"nofollow ugc\">create new or repeat existing shifts</a> months ahead.</p>\n<p><strong>Shift Pickup</strong><br />\nWith the <a href=\"https://www.shiftcontroller.com/shift-pickup/\" rel=\"nofollow ugc\">Shift Pickup</a> module shifts can be marked as requested for pickup, and other employees can pick them up.</p>\n<p><strong>Schedule Templates</strong><br />\nQuickly create new week schedules from <a href=\"https://www.shiftcontroller.com/schedule-templates/\" rel=\"nofollow ugc\">schedule templates</a>.</p>\n<p><strong>Custom Fields</strong><br />\n<a href=\"https://www.shiftcontroller.com/custom-fields/\" rel=\"nofollow ugc\">Additional fields</a> for shifts to keep custom information.</p>\n<p><strong>Schedule Limits</strong><br />\n<a href=\"https://www.shiftcontroller.com/schedule-limits/\" rel=\"nofollow ugc\">Limit total number or duration of shifts</a> within a day, a week, or a month.</p>\n<p>Please visit <a href=\"https://www.shiftcontroller.com\" title=\"WordPress Employee Scheduling\" rel=\"nofollow ugc\">our website</a> for more info and <a href=\"https://www.shiftcontroller.com/order/\" rel=\"nofollow ugc\">get the Premium version now!</a>.</p>\n<h3>Support</h3>\n<p>Please contact us at https://www.shiftcontroller.com/contact/</p>\n<p>Author: Plainware<br />\nAuthor URI: https://www.shiftcontroller.com</p>\n",
        "installation": "<ol>\n<li>\n<p>After unzipping, upload everything in the <code>shiftcontroller</code> folder to your <code>/wp-content/plugins/</code> directory (preserving directory structure).</p>\n</li>\n<li>\n<p>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress.</p>\n</li>\n</ol>\n",
        "changelog": "<h4>4.9.66</h4>\n<ul>\n<li>BUG: the schedule display crushed if there was a pending time off within the displayed date range.</li>\n</ul>\n<h4>4.9.65</h4>\n<ul>\n<li>Added a rich-text editor for employee&#8217;s description.</li>\n<li>Disallowed HTML in employee, calendar and shift time names.</li>\n</ul>\n<h4>4.9.64</h4>\n<ul>\n<li>Added a setting if to display an abbreviated label in the schedule compact view.</li>\n</ul>\n<h4>4.9.63</h4>\n<ul>\n<li>Added a setting if to confirm publishing shifts.</li>\n<li>Added 2 new options for &#8220;start&#8221; parameter of the shortcode: first-blank, first-non-blank.</li>\n</ul>\n<h4>4.9.62</h4>\n<ul>\n<li>Added an option to let employees unassign themselves from a shift, the shift becomes open after that. (Pro Version).</li>\n</ul>\n<h4>4.9.61</h4>\n<ul>\n<li>BUG: the &#8220;Custom Time&#8221; text wasn&#8217;t translatable in some places.</li>\n<li>BUG: the Print View link wasn&#8217;t working properly on some front end pages.</li>\n</ul>\n<h4>4.9.60</h4>\n<ul>\n<li>Several optimizations for database queries that should improve performance.</li>\n<li>BUG: a front end page with route=&#8221;myschedule&#8221; could redirect to everyone&#8217;s schedule after shift update.</li>\n</ul>\n<h4>4.9.59</h4>\n<ul>\n<li>Minor fixes</li>\n</ul>\n<h4>4.9.58</h4>\n<ul>\n<li>Minor fixes</li>\n</ul>\n<h4>4.9.57</h4>\n<ul>\n<li>BUG: the &#8220;Assigned Shift&#8221; filter was not working in the schedule view.</li>\n<li>BUG: an error might have appeared after a template shift was deleted.</li>\n<li>Modified the SMS module so that a phone number can be associated directly with the employee, even if there is no a linked user account.</li>\n</ul>\n<h4>4.9.56</h4>\n<ul>\n<li>BUG: a shift wasn&#8217;t displayed in the schedule if the shift&#8217;s employee was later removed from the calendar of the shift.</li>\n<li>Adjusted style of the output to better fit into front-end themes, especially in dark mode.</li>\n</ul>\n<h4>4.9.55</h4>\n<ul>\n<li>BUG: shift time might be displayed incorrectly on dates when the daylight saving time clock change happened.</li>\n<li>BUG: REST API GET /shiftcontroller/v4/shifts endpoint might work incorrectly under some WordPress configurations.</li>\n<li>Added a page break in the schedule list print view after each calendar or employee, so each section is printed on a new page.</li>\n</ul>\n<h4>4.9.54</h4>\n<ul>\n<li>Added new options for the &#8220;hideui&#8221; shortcode parameter: date-nav, report-duration, report-qty.</li>\n</ul>\n<h4>4.9.53</h4>\n<ul>\n<li>Bug: changing date option wasn&#8217;t available for shifts and time off that were full day or many days.</li>\n</ul>\n<h4>4.9.52</h4>\n<ul>\n<li>Bug: the form error messages were not displayed for form inputs after the first one.</li>\n<li>Bug: previous text might remain in form inputs.</li>\n</ul>\n<h4>4.9.51</h4>\n<ul>\n<li>Added an option to specify the CSV delimiter in shifts export file. Both default setting in Administration, Date and Time, and personal preference in Profile, Preference.</li>\n</ul>\n<h4>4.9.50</h4>\n<ul>\n<li>In the schedule day view we extended the end time range to fully display overnight shifts.</li>\n<li>Modified the session code that didn&#8217;t work properly with action result messages and user preferences in some setups.</li>\n</ul>\n<h4>4.9.49</h4>\n<ul>\n<li>Added an option to change calendar and employee for a template shift in Schedule Templates module of the Pro version.</li>\n</ul>\n<h4>4.9.48</h4>\n<ul>\n<li>Added a new REST API end point to find available employees during a certain date and time range.</li>\n</ul>\n<h4>4.9.47</h4>\n<ul>\n<li>Added a delete shift email notification for employees and managers/admins.</li>\n</ul>\n<h4>4.9.46</h4>\n<ul>\n<li>BUG: Calendar filter in schedule view didn&#8217;t work due to error in version 4.9.44.</li>\n<li>BUG: When a shift copied to another employee, the new employee didn&#8217;t get a notification.</li>\n</ul>\n<h4>4.9.45</h4>\n<ul>\n<li>BUG: Couldn&#8217;t create shifts for a selected employee due to error in version 4.9.44.</li>\n</ul>\n<h4>4.9.44</h4>\n<ul>\n<li>BUG: Shifts of archived employees and calendars were not visible in the schedule view.</li>\n<li>BUG: Custom fields module may have produced a critical error (Pro Version).</li>\n</ul>\n<h4>4.9.43</h4>\n<ul>\n<li>Minor fixes to ensure compatibility with PHP 8.</li>\n</ul>\n<h4>4.9.42</h4>\n<ul>\n<li>Minor fixes to display better for RTL languages.</li>\n</ul>\n<h4>4.9.41</h4>\n<ul>\n<li>BUG: Copy To Another Employee link was visible to users who were not allowed to do this action.</li>\n<li>Minor fixes.</li>\n</ul>\n<h4>4.9.40</h4>\n<ul>\n<li>Added an option to choose shift, time off or both in when sending reminders.</li>\n</ul>\n<h4>4.9.39</h4>\n<ul>\n<li>BUG: In Administration, Employees, various actions were not working properly for the first item in the list.</li>\n<li>BUG: footer custom date picker in the schedule view didn&#8217;t work properly.</li>\n<li>Copy &amp; Change Employee option from the Change Employee screen moved to a separate acton Copy To Another Employee.</li>\n<li>In the shortcode &#8220;calendar&#8221; parameter can accept negative value to skip specified calendar(s), for example [shiftcontroller4 calendar=&#8221;-123,-321&#8243;]</li>\n<li>Added an option to make a copy of schedule template (Pro Version).</li>\n<li>Added an option to edit time in template shifts in schedule templates (Pro Version).</li>\n<li>Minor fixes.</li>\n</ul>\n<h4>4.9.38</h4>\n<ul>\n<li>For Schedule Limits module, if an employee has individual limits, they override possible common limits set for all employees (Pro Version).</li>\n<li>Minor fixes.</li>\n</ul>\n<h4>4.9.37</h4>\n<ul>\n<li>Minor fixes.</li>\n</ul>\n<h4>4.9.36</h4>\n<ul>\n<li>Minor fixes in upgrade from legacy version 3 module.</li>\n</ul>\n<h4>4.9.35</h4>\n<ul>\n<li>Added Custom Number of Days option for shift schedule templates module (Pro Version).</li>\n</ul>\n<h4>4.9.34</h4>\n<ul>\n<li>Include custom fields too when copying a shift to another employee.</li>\n<li>Added new options for the &#8220;hideui&#8221; shortcode parameter: filter, pagetitle, pagemenu.</li>\n</ul>\n<h4>4.9.33</h4>\n<ul>\n<li>Added an option to copy shift to a new employee.</li>\n</ul>\n<h4>4.9.32</h4>\n<ul>\n<li>Added a setting to specify the max end date for iCal feed.</li>\n<li>PHP 8.2 compatibility fixes.</li>\n<li>BUG: The date picker input might not be working for employees.</li>\n</ul>\n<h4>4.9.31</h4>\n<ul>\n<li>Minor fixes.</li>\n</ul>\n<h4>4.9.30</h4>\n<ul>\n<li>BUG: If an employee wasn&#8217;t allowed to view Everyone&#8217;s Schedule, their date selection form didn&#8217;t work in the My Schedule page.</li>\n</ul>\n<h4>4.9.29</h4>\n<ul>\n<li>BUG: If an employee wasn&#8217;t allowed to edit published shifts, but allowed to create published shifts, they still could unpublish a shift, edit it, then publish back.</li>\n<li>Added an option to make a custom field required (Pro version).</li>\n<li>Added a setting to define the date range when employees can create shifts for themselves. For example, from the start of the current week to the end of next month.</li>\n</ul>\n<h4>4.9.28</h4>\n<ul>\n<li>Added a shortcode parameter hideui=&#8221;bulk&#8221; to disable bulk actions for shifts (Pro version).</li>\n</ul>\n<h4>4.9.27</h4>\n<ul>\n<li>Added a setting if to enable slim view for month schedule grouped by calendar or employee.</li>\n</ul>\n<h4>4.9.26</h4>\n<ul>\n<li>Minor fixes.</li>\n</ul>\n<h4>4.9.25</h4>\n<ul>\n<li>Minor fixes.</li>\n</ul>\n<h4>4.9.24</h4>\n<ul>\n<li>BUG: The feed export file had broken columns if different shifts had different set of columns like custom fields or break time start/end.</li>\n<li>Minor fixes.</li>\n</ul>\n<h4>4.9.23</h4>\n<ul>\n<li>BUG: If shift was with a break, the break time didn&#8217;t display in notifications.</li>\n<li>BUG: If a custom field contained options with special characters, they didn&#8217;t display corrrectly.</li>\n</ul>\n<h4>4.9.22</h4>\n<ul>\n<li>Added an option to query custom fields in the API and export calls.</li>\n</ul>\n<h4>4.9.21</h4>\n<ul>\n<li>Added bulk actions for employees in admin view.</li>\n<li>BUG: wrong links were given in Profile:iCal Sync, Administration:Shifts Feed, Administration:Reminders, Administration:Shift Pickup Request Reminders.</li>\n</ul>\n<h4>4.9.20</h4>\n<ul>\n<li>After creating shifts from a week template, it gets back to this week schedule rather than to the current week.</li>\n<li>Don&#8217;t send a confusing &#8220;pick up request cancelled&#8221; notification to the original employee of the shift after the shift has been picked up by a new employee. (Pro version).</li>\n<li>Added a setting to display n (3,4,5,6) weeks in the schedule view.</li>\n<li>BUG: managers (not admins) weren&#8217;t allowed to create shifts from schedule templates. (Pro version).</li>\n</ul>\n<h4>4.9.19</h4>\n<ul>\n<li>Added the filter detail if any to the print view of the schedule.</li>\n<li>BUG: The order of shifts in schedule templates didn&#8217;t follow the Week Starts On setting, always starting from Sunday. (Pro version).</li>\n<li>BUG: False conflicts with changing employee of an existing shift, the bug appeared since 4.9.16.</li>\n</ul>\n<h4>4.9.18</h4>\n<ul>\n<li>A bit of modification for version 4.9.17, when doing pickup and employee assign bulk actions on grouped open shifts, pick only one of the grouped shifts as otherwise it would create overlapping conflicts for the employee. (Pro version).</li>\n</ul>\n<h4>4.9.17</h4>\n<ul>\n<li>BUG: If open shifts were grouped together in the schedule view, the bulk action process handled only one of them rather than all. (Pro version).</li>\n<li>Added a shortcode parameter to display shifts with or without conflicts.</li>\n</ul>\n<h4>4.9.16</h4>\n<ul>\n<li>Added &#8220;Shifts With Conflicts&#8221; filter option for the schedule view, available for logged in users only.</li>\n<li>BUG: It might display &#8220;new shift&#8221; and &#8220;new time off&#8221; links in schedule list view for users whose permissions didn&#8217;t allow that.</li>\n</ul>\n<h4>4.9.15</h4>\n<ul>\n<li>BUG: There was an error related to timezone settings with PHP 8.1.</li>\n<li>Default shift duration can be selected with half-hour steps (was full hour before).</li>\n</ul>\n<h4>4.9.14</h4>\n<ul>\n<li>Custom fields for shifts in schedule templates, and they can edited too before making new real shifts from template. (Pro version).</li>\n<li>Shift order in schedule view now also considers the employee sort order.</li>\n<li>BUG: Shift create from REST API might fail with the Pro version.</li>\n</ul>\n<h4>4.9.13</h4>\n<ul>\n<li>Added bulk actions for calendars in admin view.</li>\n<li>Do not display calendar label in schedule view if only one calendar exists.</li>\n<li>Changed a bit misleading &#8220;Shift Type&#8221; naming to &#8220;Shift Time&#8221;.</li>\n<li>Added break start/end times to shift export file.</li>\n</ul>\n<h4>4.9.12</h4>\n<ul>\n<li>BUG: Custom fields were not displayed for calendar managers when creating a shift.</li>\n<li>BUG: Error when displaying a schedule day view for a disabled day of week.</li>\n<li>BUG: When displaying shifts with the same time, their sort order wasn&#8217;t following the calendars sort order.</li>\n<li>Added 2 week view.</li>\n</ul>\n<h4>4.9.11</h4>\n<ul>\n<li>BUG: Time reports may have been calculated incorrectly with overnight shifts.</li>\n</ul>\n<h4>4.9.10</h4>\n<ul>\n<li>BUG: Changes in version 4.9.9 broke the timezone setting in the iCal output.</li>\n<li>BUG: Custom fields were not copied then copying an existing calendar to a new one (Pro version).</li>\n<li>BUG: It didn&#8217;t allow a valid mobile phone number if it was shorter than 11 digits.</li>\n<li>Custom fields can now be copied from another calendar (Pro version).</li>\n</ul>\n<h4>4.9.9</h4>\n<ul>\n<li>BUG: Custom fields might not be displayed in the JSON feeds output.</li>\n<li>Added an option to copy settings from an existing calendar when creating a new calendar.</li>\n<li>Added SMS text reminders for employees for the next day shift.</li>\n<li>Minor bug fixes.</li>\n</ul>\n<h4>4.9.8</h4>\n<ul>\n<li>BUG: Labels of shift types ending in 12:00am (end of day) weren&#8217;t displayed in the schedule view.</li>\n<li>BUG: Viewers (view only managers) were not able to view shifts of their calendars.</li>\n<li>BUG: 4 week view showed today’s date for all days</li>\n<li>Weekly reminders can now be sent on any day of the previous week, not only the last one.</li>\n<li>Minor bug fixes.</li>\n</ul>\n<h4>4.9.7</h4>\n<ul>\n<li>Added Danish language.</li>\n<li>Minor bug fixes.</li>\n</ul>\n<h4>4.9.6</h4>\n<ul>\n<li>BUG: schedule template shifts could not be created if the calendar had only one employee.</li>\n<li>Added {EMPLOYEE_ID} and {EMPLOYEE_NAME} to reminder subject templates.</li>\n<li>Modified Limits module to allow setting limits per specific employee. (Pro Version)</li>\n<li>Modified Limits module to allow min hours or number of shifts. (Pro Version)</li>\n<li>Modified Schedule Templates module to allow selection of available employees for open shifts. (Pro Version)</li>\n<li>Minor bug fixes.</li>\n</ul>\n<h4>4.9.5</h4>\n<ul>\n<li>BUG: wrong markup in admin config for reminders that might cause the form submit failure on some sites.</li>\n<li>BUG: employees might have less permissions than defined in some configurations</li>\n</ul>\n<h4>4.9.4</h4>\n<ul>\n<li>BUG: weekly and monthly reminders were resending every day if the cron job ran daily.</li>\n</ul>\n<h4>4.9.3</h4>\n<ul>\n<li>Added monthly reminders for the Email Reminders module.</li>\n<li>Added Shift Pickup Email Reminders module which sends out daily, weekly or monthly reminders of shifts with pickup request.</li>\n</ul>\n<h4>4.9.2</h4>\n<ul>\n<li>Added &#8220;Change Date&#8221; option for shifts.</li>\n</ul>\n<h4>4.9.1</h4>\n<ul>\n<li>BUG: fixed session and REST errors in WordPress SiteHealth.</li>\n</ul>\n<h4>4.9.0</h4>\n<ul>\n<li>Added Email Reminders module.</li>\n<li>BUG: if employees were allowed to edit their shifts, the time change didn&#8217;t work.</li>\n</ul>\n<h4>4.8.9</h4>\n<ul>\n<li>Added default schedule view type and group by settings.</li>\n<li>Automatic notifications when changing shift employee: Shift Unpublished for the old employee, and Shift Published for the new one.</li>\n</ul>\n<h4>4.8.8</h4>\n<ul>\n<li>BUG: An error in session function that lead to double action result messages and caching of form values.</li>\n</ul>\n<h4>4.8.7</h4>\n<ul>\n<li>Added pickup shortcode parameter to display shifts that have (or have no) pickup request.</li>\n<li>Minor fixes.</li>\n</ul>\n<h4>4.8.6</h4>\n<ul>\n<li>Added a few more settings for REST API shifts list interface.</li>\n<li>Separate internal schedule preference settings storage for admin area and front end schedule, otherwise it might have produced issues.</li>\n<li>Minor fixes.</li>\n</ul>\n<h4>4.8.5</h4>\n<ul>\n<li>Added short time formats like 8pm or 8p, no minutes if time is like 8:00pm.</li>\n<li>Don&#8217;t show shift conflicts for not logged in users.</li>\n<li>BUG: In schedule limits module shifts in the last day of the range were counted incorrectly.</li>\n</ul>\n<h4>4.8.4</h4>\n<ul>\n<li>Added REST API and WordPress Filters API for shifts.</li>\n</ul>\n<h4>4.8.3</h4>\n<ul>\n<li>Added an option to change shift type on existing shifts.</li>\n</ul>\n<h4>4.8.2</h4>\n<ul>\n<li>Added the &#8220;year&#8221; range in the Schedule Limits module (Pro Version).</li>\n<li>BUG: Schedule Templates module may produce a fatal error after a calendar was deleted.</li>\n<li>For Custom Fields added an option to allow edit for visitors (Pro Version).</li>\n<li>Updated translation files.</li>\n<li>PHP 8 compatibility fixes.</li>\n<li>BUG: draft shifts were not accessible for visitors even if permission settings allowed it.</li>\n</ul>\n<h4>4.8.1</h4>\n<ul>\n<li>In Schedule Limits added a setting if to take into account premliminary shifts (in the new shift process).</li>\n<li>Enhanced permissions in calendars &#8211; to &#8220;Create&#8221; we also added &#8220;Edit&#8221; and &#8220;Delete&#8221; permissions.</li>\n</ul>\n<h4>4.8.0</h4>\n<ul>\n<li>Schedule Limits module: changed number and duration inputs to allow any number (Pro Version).</li>\n<li>Redesigned the admin New Calendar Manager page to group users by WordPress role to work better with a large number of users.</li>\n<li>Added Swedish translation.</li>\n</ul>\n<h4>4.7.9</h4>\n<ul>\n<li>Added Schedule Limits module (Pro Version).</li>\n<li>Fixed iCal issues when description and custom fields contained multiple lines.</li>\n</ul>\n<h4>4.7.8</h4>\n<ul>\n<li>Added Schedule Templates module (Pro Version).</li>\n<li>Added calendar description to iCal export.</li>\n<li>BUG: newlines in comments could break iCal export.</li>\n</ul>\n<h4>4.7.7</h4>\n<ul>\n<li>Shift types now can have the same start/end times if they have different lunch breaks.</li>\n</ul>\n<h4>4.7.5</h4>\n<ul>\n<li>Added an option to list shifts for an exact date and time, including current time.</li>\n<li>BUG: The front end page with shortcode didn&#8217;t properly redirect to login form if an authenticated user is required to view the page.</li>\n<li>BUG: Localized datepicker may have worked incorrectly</li>\n</ul>\n<h4>4.7.4</h4>\n<ul>\n<li>Added display sort order configuration for calendars and employees.</li>\n</ul>\n<h4>4.7.3</h4>\n<ul>\n<li>Added radio and checkbox custom fields (Pro Version).</li>\n</ul>\n<h4>4.7.2</h4>\n<ul>\n<li>BUG: Fixed bugs with false links to new shift/timeoff when the current user isn&#8217;t allowed to perform these actions.</li>\n<li>Added JSON shifts output feed option (in Administration/Shifts Feed).</li>\n</ul>\n<h4>4.7.1</h4>\n<ul>\n<li>Optimized week and month schedule views so it should be rendered faster.</li>\n</ul>\n<h4>4.7.0</h4>\n<ul>\n<li>ShiftController&#8217;s ownership is changed to plainware.com</li>\n</ul>\n<h4>4.6.2</h4>\n<ul>\n<li>Added Next/Previous labels for schedule navigation links.</li>\n<li>Added labels for new shift/timeoff links in the schedule view.</li>\n<li>Make new shift/timeoff links visually muted for past dates.</li>\n<li>Added a setting if to disable using of Draft shift status.</li>\n<li>Moved Everyone Schedule / My Schedule to separate links in main menu</li>\n</ul>\n<h4>4.6.1</h4>\n<ul>\n<li>BUG: &#8220;loopback request&#8221; error in WordPress SiteHealth.</li>\n</ul>\n<h4>4.6.0</h4>\n<ul>\n<li>Added a setting if a conflict is considered for overlapping shifts only in the same calendar.</li>\n<li>BUG: there was a &#8220;REST API&#8221; error in WordPress SiteHealth.</li>\n</ul>\n<h4>4.5.9</h4>\n<ul>\n<li>Added label for textarea custom field in the admin area.</li>\n<li>When creating a shift or assigning new or another employee, unavailable employees are displayed below available ones.</li>\n<li>Added a setting for default shift duration.</li>\n<li>In the admin calendars list view we added the quantity of notifications and permission options enabled for each calendar.</li>\n<li>The schedule view remembers last filtered calendars and employees.</li>\n</ul>\n<h4>4.5.8</h4>\n<ul>\n<li>Added an option to filter our open shifts from a display, i.e. see assigned shifts only.</li>\n<li>Added a new 4 weeks schedule view.</li>\n<li>Added employee description to the shift details view.</li>\n<li>Added My Profile link to the schedule view on a shortcode front end page.</li>\n<li>Make it compatible with Polylang multi language plugin &#8211; if a front end page is set to a language, then we switch to that language.</li>\n</ul>\n<h4>4.5.7</h4>\n<ul>\n<li>Calendar permission settings were not working correctly for visitors (not logged in users).</li>\n<li>Added the timezone setting.</li>\n<li>BUG: Notifications still sent the shift type title even if it was disabled (instead of the time).</li>\n</ul>\n<h4>4.5.6</h4>\n<ul>\n<li>Added a permission settings per each calendar if to allow employees from other calendars see shifts in this calendar. It configures the feature added in version 4.5.5.</li>\n<li>BUG: Custom fields were not saved when repeating a shift for multiple days (Pro Version).</li>\n</ul>\n<h4>4.5.5</h4>\n<ul>\n<li>BUG: Employees could see shifts from other calendars that they are not allowed to participate in.</li>\n</ul>\n<h4>4.5.4</h4>\n<ul>\n<li>Added a setting to define the time increment for time selectors (5, 10, 15 etc minutes).</li>\n<li>Added a setting to define if the lunch break input is needed.</li>\n</ul>\n<h4>4.5.3</h4>\n<ul>\n<li>BUG: A calendar manager could not create open published shifts.</li>\n</ul>\n<h4>4.5.2</h4>\n<ul>\n<li>BUG: Open shifts from different calendars were also grouped which was wrong.</li>\n<li>New setting if to automatically create a pickup request for open published shifts. (Pro Version)</li>\n<li>Disabled rich text/HTML editor for custom fields if edited from front end. (Pro Version)</li>\n</ul>\n<h4>4.5.1</h4>\n<ul>\n<li>Group multiple open shifts for the same time in the schedule view.</li>\n<li>New setting if employees are allowed to create shifts for themselves with conflicts (overlapping existing shifts).</li>\n<li>BUG: compatibility issue &#8211; the date picker might have failed to work with some front end themes.</li>\n</ul>\n<h4>4.5.0</h4>\n<ul>\n<li>BUG: The weekly repeat function included the current day of the week even if it was unchecked (Pro Version).</li>\n<li>Removed hyphens and underscores from the abbreviated labels if the full labels contained any.</li>\n</ul>\n<h4>4.4.9</h4>\n<ul>\n<li>In the month schedule view the shift widget now displays abbreviated label of the calendar title or of the employee name, depending on the grouping selected.</li>\n<li>Modified the permissions part so that if an employee can&#8217;t see others shifts in a calendar, so this employee can&#8217;t also see others employees names.</li>\n</ul>\n<h4>4.4.8</h4>\n<ul>\n<li>Added &#8220;Every 2 Weeks&#8221;, &#8220;Every 3 Weeks&#8221;, &#8220;Every 4 Weeks&#8221; shifts repeat options (Pro Version).</li>\n<li>BUG: The Email From Name setting was not taking effect.</li>\n<li>BUG: Backward schedule navigation button worked incorrectly in the day view.</li>\n<li>BUG: Minor translation related and other fixes.</li>\n</ul>\n<h4>4.4.7</h4>\n<ul>\n<li>Schedule header with date labels now sticks to the top when scrolling down the schedule view.</li>\n<li>BUG: Another attempt to fix a fatal error in print view in some configurations.</li>\n</ul>\n<h4>4.4.6</h4>\n<ul>\n<li>Changed calendar description field to a wysiwyg editor. Also WordPress shortcodes are now processed in this field.</li>\n<li>A small change when creating multiple shifts: for example if there are 2 new shifts for 1 Sep and 1 Oct, after submit you return back to 1 Sep calendar, rather jumping forward to 1 Oct.</li>\n<li>BUG: Attempted to fix a fatal error in print view in some configurations.</li>\n</ul>\n<h4>4.4.5</h4>\n<ul>\n<li>Changed how links to shifts in calendar are displayed. That allows other links in custom fields if any to work properly.</li>\n<li>Schedule navigation links now in the footer too.</li>\n</ul>\n<h4>4.4.4</h4>\n<ul>\n<li>Custom textarea fields now use rich text/HTML editor (Pro Version).</li>\n<li>Shifts duration summary view now separates shifts and time off.</li>\n</ul>\n<h4>4.4.3</h4>\n<ul>\n<li>BUG: Wrong URLs if the server address was configured with a port.</li>\n<li>If from the schedule week or month view switching to the day view, for the current week/month it shows today rather than the first day of the week/month.</li>\n</ul>\n<h4>4.4.2</h4>\n<ul>\n<li>Added an option to select all employees when creating a shift.</li>\n<li>Added &#8220;viewers&#8221; for calendars &#8211; users who can only view shifts.</li>\n</ul>\n<h4>4.4.1</h4>\n<ul>\n<li>Added a setting to change email sender name and address.</li>\n<li>New notification to all employees when other employee picks up a shift (Pro Version).</li>\n</ul>\n<h4>4.4.0</h4>\n<ul>\n<li>BUG: Repeat shifts function didn&#8217;t work after 4.3.9 version update.</li>\n</ul>\n<h4>4.3.9</h4>\n<ul>\n<li>Modified &#8220;X Days On / Y Days Off&#8221; automatic repeat option to accept manual entry that enables any repeating shift schedule.</li>\n<li>Internal code change to enable WordPress&#8217; apply_filters() function call ShiftController functions.</li>\n<li>BUG: forms with multiple action buttons may not have worked properly in some installations.</li>\n</ul>\n<h4>4.3.8</h4>\n<ul>\n<li>Edit custom fields in one form rather than save button per each field (Pro Version).</li>\n<li>New notification to manager when an employee picks up a shift (Pro Version).</li>\n<li>Added an option to import existing WordPress users as employees.</li>\n<li>Added an option to select calendars when creating a new employee.</li>\n</ul>\n<h4>4.3.7</h4>\n<ul>\n<li>BUG: Wrong urls for our plugin if the website was configured for a port other than 80.</li>\n<li>BUG: Multiday shifts were not shown if they begin before the displayed range.</li>\n<li>When repeating a shift with custom fields, these fields get pre-filled with the current values from this shift.</li>\n<li>Added several automatic repeat options (like weekly, biweekly, etc) when creating a new shift (Pro Version).</li>\n</ul>\n<h4>4.3.6</h4>\n<ul>\n<li>BUG: in 4.3.5 we used a function that is available since WordPress 5.0 that broke setups with earlier versions.</li>\n</ul>\n<h4>4.3.5</h4>\n<ul>\n<li>BUG: Error when creating multiday shifts when choosing a start date that was not initially appeared on screen.</li>\n<li>Added calendar description to the new shift form.</li>\n<li>Redesigned the multiple days selector so that the checkbox and the date label are stacked rather than shown on one line as sometimes the date got truncated on narrow screens.</li>\n<li>For localized installations prioritize our translations over the ones from the Translate WordPress site as the latter may appear incomplete.</li>\n<li>Added &#8220;Toggle On&#8221; options when assigning employees to calendars in the admin area.</li>\n</ul>\n<h4>4.3.4</h4>\n<ul>\n<li>BUG: There was an error when creating a new shift from a front end page with the filter parameter for multiple calendars.</li>\n<li>Added a link to the administration options in the front end page.</li>\n<li>Added &#8220;sh4-bulk-form&#8221; CSS class for the bulk form so it can be hidden in the front end if needed.</li>\n</ul>\n<h4>4.3.3</h4>\n<ul>\n<li>Minor code fixes to remove warnings in PHP 7 in iCal exports.</li>\n<li>Added from/to date parameters for shifts feed output.</li>\n<li>BUG: Managers were not able to view or edit custom fields (only admins could).</li>\n<li>BUG: Employees could pickup past shifts.</li>\n<li>BUG: Shift titles on mouseover were without spaces.</li>\n<li>BUG: When in a front end page configured for &#8220;My Schedule&#8221;, after any action on shifts it returned back to &#8220;Everyone Schedule&#8221;.</li>\n<li>BUG: In WP 5.0 time selector was not working in a front end page.</li>\n<li>BUG: There was an error when saving a post with ShiftController shortcode in Gutenberg or some other page builders like Elementor.</li>\n</ul>\n<h4>4.3.2</h4>\n<ul>\n<li>Added the all week select in the shift repeat and new recurring shift screens. (Pro Version)</li>\n<li>Added French translation.</li>\n<li>Minor fixes to address possible errors with shift break times.</li>\n<li>Minor fix to make sure jQuery is loaded in the front end for WordPress 5.0.</li>\n<li>BUG: custom fields didn&#8217;t show up in the iCal feed. (Pro Version)</li>\n</ul>\n<h4>4.3.1</h4>\n<ul>\n<li>Updated the translation file.</li>\n<li>Added the date label when selecting a shift type after calendar view.</li>\n<li>Minor fix in the view when selecting repeating dates for new shifts.</li>\n<li>Added a week number in the schedule week view.</li>\n<li>Added a setting if to send notification emails in HTML or plain text.</li>\n<li>BUG: Employees could delete their published shifts if they were only allowed to create draft shifts.</li>\n</ul>\n<h4>4.3.0</h4>\n<ul>\n<li>If employees/visitors are not configured to view others shifts in all calendars, then the Everyone Schedule view is not available for employees and visitors.</li>\n<li>BUG: Minor error notice &#8220;Undefined index: cfield_details&#8221;. (Pro Version)</li>\n<li>BUG: Custom fields were not included in email notifications after shift create. (Pro Version)</li>\n<li>Added a setting if to hide hours counters in the schedule view.</li>\n<li>Added the &#8220;Toggle Selected&#8221; button in the bulk actions form. (Pro Version)</li>\n</ul>\n<h4>4.2.9</h4>\n<ul>\n<li>Added shifts duration summary per day in the week view.</li>\n<li>BUG: An error occured if WordPress timezone was set to an UTC relative option (like UTC-7 etc).</li>\n</ul>\n<h4>4.2.8</h4>\n<ul>\n<li>BUG: Creating new shifts from a front end page failed if the &#8220;type&#8221; shortcode parameter was used.</li>\n</ul>\n<h4>4.2.7</h4>\n<ul>\n<li>Added a new drop down type for custom fields. (Pro Version)</li>\n<li>Custom fields are now also included in the iCal export. (Pro Version)</li>\n<li>BUG: Shifts view permissions may be processed incorrectly for employees&#8217; iCal export.</li>\n</ul>\n<h4>4.2.6</h4>\n<ul>\n<li>BUG: Schedule download didn&#8217;t work properly in WordPress front end.</li>\n<li>BUG: After reschedule notification emails still displayed old time.</li>\n<li>BUG: Error in the iCal export feed for employees.</li>\n<li>BUG: It didn&#8217;t allow to update a custom field if there was already another one with the same label in another calendar. (Pro Version)</li>\n<li>BUG: Overlap conflicts function may show false alerts sometimes.</li>\n<li>Schedule day view now shows 7 days at once.</li>\n</ul>\n<h4>4.2.5</h4>\n<ul>\n<li>Optimizations to improve speed for heavy schedules with many employees and shifts.</li>\n</ul>\n<h4>4.2.4</h4>\n<ul>\n<li>BUG: &#8220;Not allowed&#8221; error when trying to create new open shifts.</li>\n</ul>\n<h4>4.2.3</h4>\n<ul>\n<li>BUG: Date labels were not visible in the print view.</li>\n<li>BUG: Calendar type (shift/timeoff) was reset after editing a calendar.</li>\n</ul>\n<h4>4.2.2</h4>\n<ul>\n<li>Added the description field for employees which is also displayed when creating shifts or changing employees.</li>\n<li>BUG: The shortcode parameter route=&#8221;myschedule&#8221; doesn&#8217;t bring up the correct view.</li>\n<li>BUG: The repeat function didn&#8217;t correctly added shift lunch breaks (Pro Version).</li>\n</ul>\n<h4>4.2.1</h4>\n<ul>\n<li>BUG: the shifts were not showing in the week/month view for the last day for the week/month.</li>\n</ul>\n<h4>4.2.0</h4>\n<ul>\n<li>Redesigned the new shift process so that shifts can be created for multiple employees at once.</li>\n<li>Shortcode can now show the My Schedule page, the shifts of the currently logged in user.</li>\n<li>Added a shortcode parameter to disable the link to the shift details (hideui=&#8221;shiftdetails&#8221;).</li>\n<li>Custom fields added to notification templates (Pro Version).</li>\n<li>BUG: it wasn&#8217;t allowing to create a lunch break for overnight shifts, like shift 11pm-3am and break 1am-2am.</li>\n</ul>\n<h4>4.1.6</h4>\n<ul>\n<li>Added the day shifts calendar view.</li>\n<li>Added a setting to specify min and max time, which is convienient if you don&#8217;t need 24 hours.</li>\n<li>When creating new shifts, the initial visible dates calendar extended to 4 weeks.</li>\n<li>BUG: a date wasn&#8217;t preselected in the Select Dates view when adding a shift from calendar (Pro Version).</li>\n<li>BUG: bulk action form to change employee was displayed even if it wasn&#8217;t allowed for the current user (Pro Version).</li>\n<li>BUG: filtering for &#8220;open shifts&#8221; was not working in the schedule view.</li>\n</ul>\n<h4>4.1.5</h4>\n<ul>\n<li>Added several shortcode parameters to configure the front end view.</li>\n<li>BUG: lunch break was not removed if the checkbox was unchecked when changing shift time.</li>\n</ul>\n<h4>4.1.4</h4>\n<ul>\n<li>BUG: error when an employee tried to create own shift even if it was allowed.</li>\n</ul>\n<h4>4.1.3</h4>\n<ul>\n<li>BUG: custom fields added to the export download did not work properly if multiple calendars were using custom fields. (Pro Version)</li>\n<li>Added a function to change or assign employee for multiple shifts at once. (Pro Version)</li>\n</ul>\n<h4>4.1.2</h4>\n<ul>\n<li>Custom fields are now added to the export download file too. (Pro Version)</li>\n<li>Updated JavaScript files to help avoid conflicts with other plugins and themes.</li>\n</ul>\n<h4>4.1.1</h4>\n<ul>\n<li>Added a setting for a calendar if it is for time off. This lets to create 2 separate buttons for new shifts and time off. Also the shifts in the time off calendars are not counted for the totals results in the schedule view.</li>\n<li>Added a check to avoid shift types with duplicated start and end times.</li>\n<li>BUG: Timezone was not properly set in the iCal feed.</li>\n<li>BUG: Full day shift type title was not shown in the schedule view.</li>\n</ul>\n<h4>4.1.0</h4>\n<ul>\n<li>Added custom fields module for the Pro addon.</li>\n<li>BUG: error when creating a new shift type (on a site with PHP 7.1).</li>\n<li>BUG: error when creating a shift for a calendar which had only one, custom time shift type.</li>\n</ul>\n<h4>4.0.8</h4>\n<ul>\n<li>Added shift detailed information on mouse over in month schedule view.</li>\n<li>Added CSV feed of upcoming shifts (in Administration, Upcoming Shifts Feed), it can be used to export shifts to other applications.</li>\n<li>BUG: error after trying to change employee (appeared since 4.0.7).</li>\n</ul>\n<h4>4.0.7</h4>\n<ul>\n<li>Added an option to create multiple open shifts at once.</li>\n<li>Display current timezone in the iCal details page.</li>\n<li>Added links for iCal feeds per employee.</li>\n<li>Added an option to  &hellip;</li>\n</ul>\n"
    },
    "short_description": "Schedule staff and shifts anywhere at anytime online from your WordPress powered website.",
    "description": "<p>ShiftController is a lightweight, easy to use WordPress staff scheduling and rostering, rota planning plugin for any business that needs to manage and schedule employees.</p>\n<h4>Keep Organized</h4>\n<p>Associate your employees with calendars, configure shift types, assign managers, and keep your staff scheduling under control anywhere at anytime online from your WordPress powered website!</p>\n<h4>Escape Schedule Conflicts</h4>\n<p>Quickly see and correct any conflicts due to overlapping shifts or timeoffs. Each conflicting entry is highlighted in the schedule calendar so you will not miss it.</p>\n<h4>Mobile Friendly</h4>\n<p>Responsive design that works perfectly well for iPhone, Android, Blackberry, Windows as well as for desktops, laptops and tablets.</p>\n<h3>Pro Version Features</h3>\n<p><strong>Bulk Edit</strong><br />\nThe <a href=\"https://www.shiftcontroller.com/bulk-actions/\" rel=\"nofollow ugc\">Bulk Edit</a> function lets you change or delete multiple shifts at once.</p>\n<p><strong>Repeat Shifts</strong><br />\nQuickly <a href=\"https://www.shiftcontroller.com/recurring-shifts/\" rel=\"nofollow ugc\">create new or repeat existing shifts</a> months ahead.</p>\n<p><strong>Shift Pickup</strong><br />\nWith the <a href=\"https://www.shiftcontroller.com/shift-pickup/\" rel=\"nofollow ugc\">Shift Pickup</a> module shifts can be marked as requested for pickup, and other employees can pick them up.</p>\n<p><strong>Schedule Templates</strong><br />\nQuickly create new week schedules from <a href=\"https://www.shiftcontroller.com/schedule-templates/\" rel=\"nofollow ugc\">schedule templates</a>.</p>\n<p><strong>Custom Fields</strong><br />\n<a href=\"https://www.shiftcontroller.com/custom-fields/\" rel=\"nofollow ugc\">Additional fields</a> for shifts to keep custom information.</p>\n<p><strong>Schedule Limits</strong><br />\n<a href=\"https://www.shiftcontroller.com/schedule-limits/\" rel=\"nofollow ugc\">Limit total number or duration of shifts</a> within a day, a week, or a month.</p>\n<p>Please visit <a href=\"https://www.shiftcontroller.com\" title=\"WordPress Employee Scheduling\" rel=\"nofollow ugc\">our website</a> for more info and <a href=\"https://www.shiftcontroller.com/order/\" rel=\"nofollow ugc\">get the Premium version now!</a>.</p>\n<h3>Support</h3>\n<p>Please contact us at https://www.shiftcontroller.com/contact/</p>\n<p>Author: Plainware<br />\nAuthor URI: https://www.shiftcontroller.com</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/shiftcontroller.4.9.66.zip",
    "upgrade_notice": {
        "": "<p>The upgrade is simply - upload everything up again to your <code>/wp-content/plugins/</code> directory, then go to the ShiftController menu item in the admin panel. It will automatically start the upgrade process if any needed.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/shiftcontroller/assets/screenshot-1.png?rev=1986582",
            "caption": "Front-end of the plugin."
        },
        {
            "src": "https://ps.w.org/shiftcontroller/assets/screenshot-2.png?rev=1986582",
            "caption": "Back-end of the plugin."
        }
    ],
    "tags": {
        "employee": "employee",
        "rota": "rota",
        "shift": "shift",
        "staff": "staff",
        "volunteer": "volunteer"
    },
    "stable_tag": "4.9.66",
    "versions": {
        "2.1.0": "https://downloads.wordpress.org/plugin/shiftcontroller.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/shiftcontroller.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/shiftcontroller.2.1.2.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/shiftcontroller.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/shiftcontroller.2.2.1.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/shiftcontroller.2.2.2.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/shiftcontroller.2.2.3.zip",
        "2.2.4": "https://downloads.wordpress.org/plugin/shiftcontroller.2.2.4.zip",
        "2.2.5": "https://downloads.wordpress.org/plugin/shiftcontroller.2.2.5.zip",
        "2.2.6": "https://downloads.wordpress.org/plugin/shiftcontroller.2.2.6.zip",
        "3.2.4": "https://downloads.wordpress.org/plugin/shiftcontroller.3.2.4.zip",
        "4.9.24": "https://downloads.wordpress.org/plugin/shiftcontroller.4.9.24.zip",
        "4.9.26": "https://downloads.wordpress.org/plugin/shiftcontroller.4.9.26.zip",
        "4.9.59": "https://downloads.wordpress.org/plugin/shiftcontroller.4.9.59.zip",
        "4.9.60": "https://downloads.wordpress.org/plugin/shiftcontroller.4.9.60.zip",
        "4.9.61": "https://downloads.wordpress.org/plugin/shiftcontroller.4.9.61.zip",
        "4.9.65": "https://downloads.wordpress.org/plugin/shiftcontroller.4.9.65.zip",
        "4.9.66": "https://downloads.wordpress.org/plugin/shiftcontroller.4.9.66.zip",
        "trunk": "https://downloads.wordpress.org/plugin/shiftcontroller.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/shiftcontroller/assets/icon-128x128.png?rev=1851172"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 86,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "shiftcontroller",
            "language": "es_ES",
            "version": "4.9.61",
            "updated": "2023-04-13 07:47:18",
            "package": "http://downloads.wordpress.org/translation/plugin/shiftcontroller/4.9.61/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "shiftcontroller",
            "language": "it_IT",
            "version": "4.9.61",
            "updated": "2023-04-13 07:47:16",
            "package": "http://downloads.wordpress.org/translation/plugin/shiftcontroller/4.9.61/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "shiftcontroller",
            "language": "nl_NL_formal",
            "version": "4.9.61",
            "updated": "2023-04-13 07:47:16",
            "package": "http://downloads.wordpress.org/translation/plugin/shiftcontroller/4.9.61/nl_NL_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "shiftcontroller",
            "language": "nl_BE",
            "version": "4.9.61",
            "updated": "2023-04-13 07:47:15",
            "package": "http://downloads.wordpress.org/translation/plugin/shiftcontroller/4.9.61/nl_BE.zip"
        },
        {
            "type": "plugin",
            "slug": "shiftcontroller",
            "language": "nl_NL",
            "version": "4.9.61",
            "updated": "2023-04-13 07:47:14",
            "package": "http://downloads.wordpress.org/translation/plugin/shiftcontroller/4.9.61/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "shiftcontroller",
            "language": "sv_SE",
            "version": "4.9.61",
            "updated": "2023-04-13 07:47:19",
            "package": "http://downloads.wordpress.org/translation/plugin/shiftcontroller/4.9.61/sv_SE.zip"
        }
    ]
}