{
    "name": "Shopready &#8211; Elementor addons for WooCommerce Page Builder",
    "slug": "shopready-elementor-addon",
    "version": "3.3",
    "author": "<a href=\"http://quomodosoft.com\">quomodosoft</a>",
    "author_profile": "https://profiles.wordpress.org/quomodosoft/",
    "contributors": {
        "quomodosoft": {
            "profile": "https://profiles.wordpress.org/quomodosoft/",
            "avatar": "https://secure.gravatar.com/avatar/e92d4af18ddb55acbd76658c80fd6fed?s=96&d=monsterid&r=g",
            "display_name": "quomodosoft"
        },
        "rayhanuddin2020": {
            "profile": "https://profiles.wordpress.org/rayhanuddin2020/",
            "avatar": "https://secure.gravatar.com/avatar/c4e630e857f015bde0aee5bcb999e43d?s=96&d=monsterid&r=g",
            "display_name": "Rayhan Uddin"
        }
    },
    "requires": "5.5",
    "tested": "6.4.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 88,
    "ratings": {
        "5": 11,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 13,
    "support_url": "https://wordpress.org/support/plugin/shopready-elementor-addon/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 200,
    "downloaded": 11097,
    "last_updated": "2023-11-19 9:02am GMT",
    "added": "2021-10-12",
    "homepage": "https://profiles.wordpress.org/quomodosoft",
    "sections": {
        "description": "<p>Easily add dynamic WooCommerce widgets anywhere you like on any Elementor page with the <strong>ShopReady – WooCommerce Plugin</strong>. <strong>ShopReady – WooCommerce Builder</strong> is Easily Create Woocommerce Product Quick View, Product Comparison, woocommerce slider addons, custom product archive builder, sale countdown, Woocommerce variation swatches module, woocommerce product gallery, woocommerce shopping cart, product variations, woocommerce checkout, wishlist, woocommerce currency switcher, floating cart, secure checkout badges, etc. Build a complete store in minutes without writing a single line of code. It’s that simple!</p>\n<p>ShopReady – WooCommerce addon is the most easy to use and complete <strong>Woocommerce Builder for Elementor</strong>. You can edit each and every single components and customize single product page, cart page, archive page, checkout page, order page, my account page, and thank-you page</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/\" rel=\"nofollow ugc\">🚀 Pro Version Available</a> |  <a href=\"https://quomodosoft.com/qsdocs/shop-ready/\" rel=\"nofollow ugc\">👁️ Documentation</a> |  <a href=\"https://support.quomodosoft.com/support/\" rel=\"nofollow ugc\">👩🏼‍💻 Support</a></p>\n<h3>NOTE:</h3>\n<p><a href=\"https://wordpress.org/plugins/elementor/\" rel=\"ugc\">ELEMENTOR</a> PAGE BUILDER IS REQUIRED FOR THIS PLUGIN.</p>\n<h3>SHOPREADY WOOCOMMERCE BUILDER INCLUDES</h3>\n<ul>\n<li><strong>SHOP PAGE BUILDER</strong></li>\n<li><strong>SINGLE PRODUCT TEMPLATE BUILDER</strong></li>\n<li><strong>ARCHIVE PAGE BUILDER</strong></li>\n<li><strong>CART PAGE BUILDER</strong></li>\n<li><strong>CHECKOUT PAGE BUILDER</strong></li>\n<li><strong>MY ACCOUNT PAGE BUILDER</strong></li>\n<li><strong>THANK YOU PAGE BUILDER</strong></li>\n<li><strong>WISHLIST PAGE BUILDER</strong></li>\n<li><strong>PRODUCT COMPARISON PAGE BUILDER</strong></li>\n<li><strong>PRODUCT QUICKVIEW BUILDER</strong></li>\n<li><strong>QUICKVIEW CHECKOUT BUILDER</strong></li>\n</ul>\n<p>You can see the plugin demo here : <a href=\"https://quomodosoft.com/plugins/shopready/\" rel=\"nofollow ugc\">Live Demo</a></p>\n<h3>KEY FEATURES OF ShopReady &#8211; WooCommerce Builder for Elementor</h3>\n<ul>\n<li><strong>WooCommerce Template Builder (Basic)</strong></li>\n<li><strong>WooCommerce Product Grid</strong></li>\n<li><strong>WooCommerce Product Slider</strong></li>\n<li><strong>WooCommerce Product Tab</strong></li>\n<li><strong>Mini Cart</strong></li>\n<li><strong>Side Cart</strong></li>\n<li><strong>Offcanvas Cart</strong></li>\n<li><strong>Action Buttons in different Positions</strong></li>\n<li><strong>Sale / Discount Schedule Counter</strong></li>\n<li><strong>Header Builder</strong></li>\n<li><strong>Footer Builder</strong></li>\n<li><strong>Mega Menu</strong></li>\n<li><strong>WooCommerce Add to Cart</strong></li>\n<li><strong>Stock Progressbar</strong></li>\n<li><strong>WooCommerce UpSell</strong></li>\n<li><strong>WooCommerce CrossSell</strong></li>\n<li><strong>WooCommerce Cart</strong></li>\n<li><strong>WooCommerce Checkout</strong></li>\n<li><strong>WooCommerce Related Product</strong></li>\n<li><strong>Testimonial</strong></li>\n<li><strong>Slider Control Options</strong></li>\n<li><strong>Special Day offer banner</strong></li>\n<li><strong>Product QR Code</strong></li>\n<li><strong>WooCommerce Product Rating</strong></li>\n<li><strong>WooCommerce Product Review</strong></li>\n<li><strong>Custom Product Template Builder</strong></li>\n<li><strong>WooCommerce Product Grid (Curvy)</strong></li>\n<li><strong>Product Accordion Listing</strong></li>\n<li><strong>Product Image Accordion</strong></li>\n<li><strong>WooCommerce Shop Page Builder</strong></li>\n<li><strong>Ajax Add to Cart (shop page)</strong></li>\n<li><strong>Search Filter Demo</strong></li>\n<li>**Template Library **</li>\n<li><strong>One Click Demo (Pro)</strong></li>\n<li><strong>Upcoming More&#8230;</strong></li>\n</ul>\n<h3>SHOPREADY STUNNING &amp; EXCLUSIVE MODULES FOR WOOCOMMERCE.</h3>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/quick-view-details/\" rel=\"nofollow ugc\">QUICK VIEW MODULE:</a><br />\nA good user experience is to save time and click for users and increase the conversion. So here this Module will help. Buyers can click and see the Product details through <strong>woocommerce quick view</strong>, quick view, view product, quickshop plugin, Quick View Module and popup.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/variation-swatches-details/\" rel=\"nofollow ugc\">VARIATION SWATCHES MODULE:</a><br />\nLet the shopper/buyer choose his colors, size and quantity with ShopReady woocommerce product <strong>variations Swatches</strong> Module. Give them authority to  choser their won.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/variation-swatches-details/\" rel=\"nofollow ugc\">WISHLIST MODULE:</a><br />\nWhen you are confused and want to buy as much as possible but still not sure or not ready to cart in, here the functions <strong>Woocommerce Wish list</strong> which helps you. Just add them to your Wishlist and later you can decide. That is a time saving <strong>woocommerce wishlist</strong> from ShopReady WooCommerce Builder now its more easier to handle or create Wishlist.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/product-comparison-module/\" rel=\"nofollow ugc\">PRODUCT COMPARISON MODULE:</a><br />\nDifferent Brand Different Product even different choice. Just put them all in a single table to compare and judged which one is best for you. In ShopReady WooCommerce Builder, we have <strong>Product Comparison</strong> for you as a module.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/sales-notification-module/\" rel=\"nofollow ugc\">SALES NOTIFICATION MODULE-PRO</a><br />\nJust active this effective module from ShopReady WooCommerce Builder dashboard and let your incoming customers know that who is buying and when. So that they can feel confident and depend on your store. <strong>Sales Notification Module</strong> from Shopready will help you to setup the process.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/currency-switcher-module/\" rel=\"nofollow ugc\">CURRENCY SWITCHER MODULE-PRO</a><br />\nYou can set and show the currency for your customers and now this easy with ShopReady WooCommerce Builder <strong>Currency Switcher module</strong>. Shopready comes with woocommerce currency switcher, ultimate currency exchange reviews, ultimate currency exchange, switcher pricing, currency storage, woocommerce multi currency.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/flash-sale-countdown-module/\" rel=\"nofollow ugc\">FLASH SALE COUNTDOWN MODULE-PRO</a><br />\nFor any event, discount period or special offer. You can always show a countdown timer to give a gentle reminder to your visitors about it and its duration length. <strong>Woocommerce Flash Sale Countdown</strong> module from ShopReady is the options to make things easy for you.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/image-masking-module/\" rel=\"nofollow ugc\">IMAGE MASKING</a><br />\nDynamic and eye catchy image of product with different shape and frame will boost your website look and feel. Now its easy to do Woocommerce elementor  <strong>image masking</strong>, with ShopReady <strong>WooCommerce Builder</strong> Image Masking Module.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/\" rel=\"nofollow ugc\">BADGES MODULE-PRO</a><br />\nTo catch attention or to attract towards new, discounted or limited time products, you can use <strong>Badges</strong>. In ShopReady WooCommerce Builder we have bring extensive customization options for this <strong>product badges</strong>.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/quick-checkout-module/\" rel=\"nofollow ugc\">QUICK CHECKOUT MODULE-PRO</a><br />\nTo save time, you don’t need to go pages after pages to buy a single product. Now you are one step behind to checkout directly from you product page. Bingo, ShopReady WooCommerce Builder has presets also for this <strong>woocommerce quick checkout</strong>, woocommerce checkout plugin.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/flying-cart-animation-module/\" rel=\"nofollow ugc\">FLYING CART ANIMATION MODULE-PRO</a><br />\nAnother interesting feature or module, Just add product to your cart and it will land you in the cart icon with a beautiful animation which surely give joy to your customers and will catch attention.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/template-library-module/\" rel=\"nofollow ugc\">TEMPLATE LIBRARY MODULE-PRO</a><br />\nWe have numbers of presets and this library will grow for sure.Now you have the options to choose form the woocommerce shop page template, woocommerce plugin template, Woocommerce Elementor Templates library / ready  presets of ShopReady WooCommerce Builder Template library.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/\" rel=\"nofollow ugc\">🚀 Pro Version Available</a> |  <a href=\"https://quomodosoft.com/qsdocs/shop-ready/\" rel=\"nofollow ugc\">👁️ Documentation</a> |  <a href=\"https://support.quomodosoft.com/support/\" rel=\"nofollow ugc\">👩🏼‍💻 Support</a></p>\n<h3>SHOPREADY – WOOCOMMERCE BUILDER FOR ELEMENTOR SINGLE PRODUCT PAGE WIDGET LISTS</h3>\n<p>WITH STUNNING 20+ WIDGETS, NOW ITS EASIER TO BUILD YOUR OWN SINGLE PRODUCT DETAIL PAGE.</p>\n<ul>\n<li><strong>Product Price Widget:</strong> Change the font, color, size and currency with the pricing widget</li>\n<li><strong>Product Title Widget:</strong> Title plays an important role so we do.now you can customize or portrait your title with more style.</li>\n<li><strong>Woocommerce Ratings:</strong> – Now its more easy with give and collect ratings by ShopReady – WooCommerce Builder for Elementor rating widgets</li>\n<li><strong>Product Upsell:</strong> – Show some more addon products in the product derails page and gain more sales with the Upsell options.</li>\n<li><strong>Woocommerce Additional Information:</strong> – Show more infowith ShopReady – WooCommerce Elementor Addon Additional information widgets.</li>\n<li><strong>Product Add to Cart:</strong> – We have the Add to card button under single product and now its more easy to covert you customers with ShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Woocommerce Product meta:</strong> – show metadata in style with ShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Woocommerce Product Description:</strong> – Dynamically build your product description and show through ShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Single product Image:</strong> – describe more with Visual. Less talk show more with ShopReady – WooCommerce Builder forElementor</li>\n<li><strong>Product Image thumbnail:</strong> – with ShopReady – WooCommerce Builder for Elementor now its more easy to show multiple images as a slider In your product page</li>\n<li><strong>Product SKU:</strong> – A stock-keeping unit is important to take care of your inventory and stock.</li>\n<li><strong>Product Tag:</strong> – With ShopReady – WooCommerce Builder for Elementor we bring Product tag. So now its more easy to Use</li>\n<li><strong>Product Stock:</strong> – Give a clear view about product STOCK status with ShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Product Stock Progress bar:</strong> – Show stock update with a counter bar or progress bar with ShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Product Categories:</strong> now you can organize or showcase segment wise or category wise. You can also show or hide the categories even can do style.</li>\n<li><strong>Woocommerce Product Data Tab:</strong> – Save space and show more with the Data Tab. Most popular Woocommerce Widgets for elementor by ShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Woocommerce product review:</strong> – display your product reviews with in your single product page for your Woocommerce website</li>\n<li><strong>Product Share:</strong> Put a Social Share option anywhere in your product details page.</li>\n<li><strong>WooCommerce Price Filter:</strong> based on the requirement now you can create a price range and segment the product based on that.</li>\n<li><strong>Breadcrumbs:</strong> You will have the text, icon customization option on your Breadcrumbs </li>\n<li><strong>Woocommerce Related Product:</strong> – bring more sale by showing related product and do more upsell with ShopReady<br />\n– WooCommerce Builder for Elementor</li>\n</ul>\n<h3>BUILD YOUR CART PAGE WITH SHOPREADY WIDGETS</h3>\n<p>Don’t let your buyer go empty handed or you can always redirect<br />\nto shop page after a successful checkout.</p>\n<ul>\n<li><strong>Cart Table:</strong> Cart page and its components can be customized easily or you can decorate the table with a beautiful color and typo of your choice through the cart table widgets.</li>\n<li><strong>Cart Total:</strong> Give an overview of the cart total amount and give them assurance of the transparency with proper details.</li>\n<li><strong>Cross-Sell:</strong> With a controlled mindset or funnel now you can showcase the products in the cart page or range of product which is relevant to the cart product.</li>\n<li><strong>Redirect to Shop:</strong> Once a successful checkout bring your customers to Shop page and insist him/her to buy again .</li>\n<li><strong>Empty Cart Message:</strong> Don’t let your visitors empty handed and show them message and remind them to buy.</li>\n</ul>\n<h3>PRODUCT ARCHIVE PAGE WITH SHOPREADY WOOCOMMERCE BUILDER</h3>\n<p>All your achieved product with beautiful design.</p>\n<ul>\n<li><strong>WooCommerce Archive Title:</strong> With a proper Typoghray and style now its easier to design the title</li>\n<li><strong>WooCommerce Archive Products:</strong> We have multi styled product layout to make your archive product page more attractive.</li>\n<li><strong>Description:</strong> Important Info to describe more about the archive page and its ability to customize with shopready  WooCommerce builder.</li>\n</ul>\n<h3>BUILD YOUR CUSTOM CHECKOUT PAGE WITH SHOPREADY</h3>\n<p>For a better feel and user experience it’s the most IMPORTANT part of an eCommerce. Let them feel good and navigate the mind to sell more</p>\n<ul>\n<li><strong>Checkout Payment Section:</strong> Make them feel secure with the Payment portion and set it Infront . Orientation of this section is important chose wisely. You can also design it with text, color &amp; Typo you chose </li>\n<li><strong>Review Checkout Order:</strong> Let confirm the shopper by review the checkout product at cart. Chose a style from our presets or you can build your own.</li>\n<li><strong>Checkout Form Additional:</strong> Don’t bother customers<br />\nwith asking by much info. Just create a form with<br />\nimportant required info field.</li>\n<li><strong>Apply Coupon:</strong> Give your Shoppers a privilege with<br />\ndiscount coupon and remind them about it. Show the<br />\ncoupon section anywhere you want.</li>\n<li><strong>Billing Form Style:</strong> Change the style, orientation or<br />\nlocate in a suitable position with.</li>\n<li><strong>Checkout Form Login:</strong> Create your own login form for<br />\ncheckout page and style it.</li>\n<li><strong>Shipping Form:</strong> Give a makeover to your shipping form<br />\nand style it properly.</li>\n<li><strong>Shipping Methods:</strong> Let the shopper chose the shipping<br />\nmethod and help them feel good while choosing it. Style<br />\nthe shipping method section with more care and love.</li>\n</ul>\n<h3>CREATE BEAUTIFUL ORDER DETAILS PAGE WITH SHOPREADY</h3>\n<p>Show the love and gratitude towards the customers after a<br />\nsuccessful checkout.</p>\n<ul>\n<li><strong>Order Details:</strong> with order details widgets you can have a<br />\nready style or make your own. Show the perfect order<br />\ndetails with it.</li>\n<li><strong>Address Details:</strong> give a boost to your Thank you page<br />\nwith proper info including the address widgets.</li>\n<li><strong>Order Confirm:</strong> Thank them and say congratulations<br />\nwith a order confirmation message.</li>\n<li><strong>Order Thank You:</strong> be humble and WIN more hearts with<br />\na Thank You message to your customers.</li>\n</ul>\n<h3>AUTHORISE YOUR USER/SHOPPERS WITH AN ACCOUNT PAGE BUILDER BY SHOPREADY WOOCOMMERCE BUILDER.</h3>\n<p>Its fun, when you have the authority to navigate or control your<br />\nown account in a website. Give them the leverage to hand it<br />\nthemselves.</p>\n<ul>\n<li><strong>Address:</strong> WooCommerce Default account page tab is<br />\nnow fund to modify and handle.</li>\n<li><strong>Dashboard:</strong> your authority to control and navigate all<br />\nother options available in the my account page.</li>\n<li><strong>Orders:</strong> Its kind of purchase history for your buy from a<br />\nsingle site or account of that website.</li>\n<li><strong>Order Details:</strong> See each and every order details and<br />\nmange your orders.</li>\n<li><strong>Downloads:</strong> For a digital goods that is helpful. Now you<br />\ncan download digital products or info in a file folder from<br />\nthis section.</li>\n<li><strong>Logout:</strong> When there is way to INN there must be a way of<br />\nOUT, we are talking about Logout from the my account<br />\npage.</li>\n<li><strong>Account Details:</strong> An overview of your account details<br />\nform that tab and you can also update it..</li>\n<li><strong>Account Register Form:</strong> create your personalized<br />\nregistration form with shopready  account registration<br />\nform.</li>\n</ul>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/\" rel=\"nofollow ugc\">🚀 Pro Version Available</a> |  <a href=\"https://quomodosoft.com/qsdocs/shop-ready/\" rel=\"nofollow ugc\">👁️ Documentation</a> |  <a href=\"https://support.quomodosoft.com/support/\" rel=\"nofollow ugc\">👩🏼‍💻 Support</a></p>\n<h3>SHOPREADY GENERAL WIDGETS LIST</h3>\n<ul>\n<li><strong>Deal Products:</strong> This widget will let you add your discount<br />\nproducts with a start and end sale date. Deal products will<br />\nlet you show available stock, sold numbers, and many<br />\nmore information to your sale products.</li>\n<li>** Product List Filter:** In ShopReady we have bring the Product list filterable options that will help you to filter products as per your requirements .</li>\n<li><strong>Product Category List:</strong> Show your product categories to<br />\nyour customers in a more attractive way with the product<br />\ncategory list widget. This widget will make your product<br />\ncategories more organized. You can also customize this<br />\noption as you want.</li>\n<li><strong>Recently Viewed Products:</strong> Add a recently viewed<br />\noption to your eCommerce store so that your customers<br />\ncan see the products they viewed a few times before. This<br />\nwidget will help your customers easily find products and<br />\nplace orders.</li>\n<li><strong>Categories (Pro):</strong> Categories widget will let you add<br />\ncategories to any of your WooCommerce pages to ease<br />\nthe product search option for your customers. You can<br />\nalso customize categories for your pages.</li>\n<li><strong>Currency Switcher (Pro):</strong> This is a great widget by<br />\nusing it your customers can switch among different<br />\ncurrencies according to their needs. And let them use that<br />\ncurrency to checkout.</li>\n<li><strong>Flash Sale Products countdown (Pro):</strong> To bring more attention or seeking attention with a countdown timer in the prodct descriptions or in a product area always helps to convert more.</li>\n</ul>\n<h3>ALL REQUIRED WOOCOMMERCE WIDGETS BY SHOPREADY WOOCOMMERCE BUILDER</h3>\n<ul>\n<li><strong>Login:</strong> – Customised Login,my account login, elementor login and register,<br />\nelementor social login, elementor free login page, elementor login logout button,<br />\nelementor login redirect, user login , signup form, login form, register form widgets<br />\n&amp; Create an awesomeWoocommerce website with our easy to use and feature rich<br />\nShopReady elementor addons.</li>\n<li><strong>Forget Password:</strong> – ShopReady – WooCommerce Builder<br />\nfor Elementor has Forget Password Widgets to help you to<br />\nrecover your lost password.</li>\n<li><strong>SignUp:</strong> – To bring new customers and build a solid<br />\ncustomer based, ShopReady Signup widgets is best for<br />\nyour Woocommerce wesbsite.</li>\n<li><strong>Menu:</strong> – Navigate your user with a customise menu elementor mobile menu, elementor responsive menu, elementor hamburger menu, elementor post navbar, elementor post site menu, elementor post menu styler, elementor post nav menu toggle button, elementor nav menu sticky, elementor add button to menu, elementor add icons to menu from<br />\nShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>QR Code:</strong> – Using Qr Code now its easy to provide<br />\ninformation about the products. Its free in ShopReady –<br />\nWooCommerce Builder for Elementor</li>\n<li><strong>Testimonial:</strong> – Collect more testimonials with ShopReady<br />\n– WooCommerce Builder for Elementor fro your<br />\nWoocommerce shop and product build trust for new<br />\nbuyers</li>\n<li><strong>Button:</strong> – we have range of buttons to take ACTION on<br />\nthe products</li>\n<li><strong>FAQ:</strong> – Pre made questions with answers with a tab<br />\nfunctional. It will save time and buyers get info in<br />\nadvance.</li>\n<li><strong>Mega Menu:</strong> – We have Mega menu to show more<br />\nvariety in the menu to the customers.</li>\n<li><strong>Header Build:</strong> – We also have Header Builder in<br />\nShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Footer Builder:</strong> – ShopReady – WooCommerce Builder<br />\nfor Elementor contains Footer Builder options / features to<br />\nmake your desire one</li>\n</ul>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/\" rel=\"nofollow ugc\">🚀 Pro Version Available</a> |  <a href=\"https://quomodosoft.com/qsdocs/shop-ready/\" rel=\"nofollow ugc\">👁️ Documentation</a> |  <a href=\"https://support.quomodosoft.com/support/\" rel=\"nofollow ugc\">👩🏼‍💻 Support</a></p>\n<p><strong>IT’S TIME TO GET STARTED WITH ShopReady</strong><br />\nLearn How to Install and Use <a href=\"https://youtu.be/grvpUvMFFqg\" rel=\"nofollow ugc\">ShopReady</a></p>\n<p>Stay Updated with our <a href=\"https://www.youtube.com/watch?v=grvpUvMFFqg&amp;list=PLppJphJlREVWAUpufxCJxRgvL35uxlCoq\" rel=\"nofollow ugc\">Youtube Channel</a></p>\n<h3>OUR OTHER PLUGINS</h3>\n<p>If you like using ShopReady WooCommerce Builder, then consider checking out our other WordPress plugins:</p>\n<p><a href=\"https://wordpress.org/plugins/element-ready-lite\" rel=\"ugc\">ElementsReady</a> &#8211; Elements Ready Elementor Addons With Header &amp; Footer Builder</p>\n<p><a href=\"https://wordpress.org/plugins/qs-dark-mode/\" rel=\"ugc\">QS Dark Mode</a> &#8211; QS Dark Mode –  Click and change the website interface to BLACK mode with QS Dark Mode WordPress Plugin</p>\n",
        "installation": "<ol>\n<li>Upload the plugin files to the <code>/wp-content/plugins/plugin-name</code> directory, or install the plugin through the WordPress plugins screen directly.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; screen in WordPress</li>\n<li>All Settings will be found in Admin sidebar -&gt; ShopReady</li>\n</ol>\n",
        "faq": "\n<dt id='is%20this%20compitable%20elementor%20pro%3F'>\nIs this compitable Elementor Pro?\n</h4>\n<p>\n<p>Yes it&#8217;s compitable with Elementor Pro.</p>\n</p>\n<dt id='is%20shopready%20%20pro%20version%20available%3F'>\nIs ShopReady  Pro Version Available?\n</h4>\n<p>\n<p>Yes. Check out the <a href=\"https://plugins.quomodosoft.com/shopready/\" rel=\"nofollow ugc\">Website</a>.</p>\n</p>\n<dt id='what%20are%20the%20required%20plugins%20to%20use%20shopready%20woocommerce%20builder%3F'>\nWhat are the required Plugins to use ShopReady WooCommerce Builder?\n</h4>\n<p>\n<p>Elementor<br />\nWooCommerce<br />\nShopReady Free + Pro Version</p>\n</p>\n<dt id='does%20it%20required%20elementor%20pro%3F'>\nDoes It Required Elementor Pro?\n</h4>\n<p>\n<p>NO, Elementor Free Version is Enough.</p>\n</p>\n<dt id='how%20can%20i%20set%20the%20templete%20in%20shopready%20woocommerce%20builder%3F'>\nHow can I set the Templete in ShopReady WooCommerce Builder?\n</h4>\n<p>\n<p>See <a href=\"https://youtu.be/GrYpHGjpQoM\" rel=\"nofollow ugc\">Youtube video</a></p>\n</p>\n<dt id='is%20shopready%20woocommerce%20builder%20drag%20and%20drop%20supported%3F'>\nIs ShopReady WooCommerce Builder Drag and Drop supported?\n</h4>\n<p>\n<p>Yes It is.</p>\n</p>\n<dt id='can%20i%20ask%20for%20a%20feature%20or%20request%20for%20feature%3F'>\nCan i ask for a Feature or Request for Feature?\n</h4>\n<p>\n<p>Yes you can do it by submitting a <a href=\"https://plugins.quomodosoft.com/shopready/#shop-ready-feature-request\" rel=\"nofollow ugc\">Feature Request Form</a></p>\n</p>\n<dt id='elementor%20editor%20fails%20to%20load%20or%20not%20working%3F'>\nElementor editor fails to load or not working?\n</h4>\n<p>\n<p>It&#8217;s due to your server PHP settings. Increase your server PHP memory limit from the wp-config.php file or php.ini file. If you don&#8217;t have an idea about it. Please contact your hosting provider and ask to increase<br />\n* PHP memory_limit = 2024M<br />\n* max_execution_time = 300</p>\n</p>\n<dt id='do%20you%20have%20plan%20for%20regular%20update%3F'>\nDo you have plan for regular update?\n</h4>\n<p>\n<p>Yes we have full planed for continiously update.</p>\n</p>\n\n",
        "changelog": "<h4>3.3</h4>\n<ul>\n<li>Template Issue fixed</li>\n<li>Widget updated &amp; bug fixed</li>\n<li>Php compatibility issue fixed</li>\n<li>Css optimiziation</li>\n<li>Esacping and sanitization</li>\n<li>Readme Update</li>\n</ul>\n<h4>3.2</h4>\n<ul>\n<li>Variables and options are escaped</li>\n<li>Readme Update</li>\n</ul>\n<h4>3.1</h4>\n<ul>\n<li>Data Sanitized, Escaped, and Validated Properly</li>\n<li>Readme Update</li>\n</ul>\n<h4>3.0</h4>\n<ul>\n<li>Fixed Internationalization Issues</li>\n<li>Data Sanitized, Escaped, and Validated Properly</li>\n<li>Remove Direct file access</li>\n<li>Readme Update</li>\n</ul>\n<h4>2.9</h4>\n<ul>\n<li>Fixed Internationalization Issues</li>\n<li>Data Sanitized, Escaped, and Validated Properly</li>\n<li>Remove Direct file access</li>\n<li>Widget Style Updates</li>\n<li>Readme Update</li>\n</ul>\n<h4>2.8</h4>\n<ul>\n<li>Remove PHP Limits Globally,</li>\n<li>Used WordPress Native HTTP API over CURL</li>\n<li>Fixed Internationalization Issues</li>\n<li>Data Sanitized, Escaped, and Validated Properly</li>\n<li>Remove Direct file access</li>\n<li>Called Styles &amp; Scripts From locally.</li>\n<li>Outdated Library Updated to the Latest Stable Version</li>\n<li>Added Nonces &amp; user permissions verification</li>\n<li>Readme Update</li>\n</ul>\n<h4>2.7</h4>\n<ul>\n<li>Shopready Plugin Name update</li>\n<li>Readme Update</li>\n</ul>\n<h4>2.6</h4>\n<ul>\n<li>Update Woocommerce Outdated Templates</li>\n<li>Compatibility Check with Latest WordPress Version</li>\n<li>Compatibility Check with Latest WooCommerce Version</li>\n<li>Compatibility Check with Latest Elementor Version</li>\n</ul>\n<h4>2.5</h4>\n<ul>\n<li>added: Partial Payment option (pro)</li>\n<li>Fix: Pro menu</li>\n</ul>\n<h4>2.4</h4>\n<ul>\n<li>Fix: template library interface issue</li>\n<li>Fix: quickview close icon issue</li>\n</ul>\n<h4>2.3</h4>\n<ul>\n<li>Added: Product sticky Cart (pro)</li>\n<li>Added: Wishlist Popup Button widget (pro)</li>\n<li>Added: Compare Popup Button widget (pro)</li>\n<li>Added: Hotspot widget (pro)</li>\n<li>Fix: tab issue fix</li>\n</ul>\n<h4>2.2</h4>\n<ul>\n<li>added multisteps checkout option</li>\n<li>optimize assets </li>\n</ul>\n<h4>2.1</h4>\n<ul>\n<li>fix css</li>\n<li>optimize widgets </li>\n<li>added documentation link</li>\n<li>added servey form</li>\n</ul>\n<h4>2.0</h4>\n<ul>\n<li>fix css</li>\n<li>update compare widgte</li>\n<li>update wishlist modal</li>\n<li>added grid widget control</li>\n</ul>\n<h4>1.9</h4>\n<ul>\n<li>Screenshots Update</li>\n<li>Style Default Product Grid </li>\n<li>Fix bugs </li>\n<li>Update OneClick Demo Files</li>\n</ul>\n<h4>1.8</h4>\n<ul>\n<li>Change banner</li>\n<li>change logo</li>\n<li>added template preset</li>\n<li>Fix bugs </li>\n<li>Update license system</li>\n</ul>\n<h4>1.4.8</h4>\n<ul>\n<li>Change banner</li>\n</ul>\n<h4>1.4.7</h4>\n<ul>\n<li>Update FAQ</li>\n<li>added notice </li>\n<li>fix notice close issue</li>\n</ul>\n<h4>1.4.6</h4>\n<ul>\n<li>dashboard ui fixing</li>\n<li>language update</li>\n</ul>\n<h4>1.4.5</h4>\n<ul>\n<li>added site settings option panel</li>\n<li>fix ajax module issue</li>\n</ul>\n<h4>1.4.4</h4>\n<ul>\n<li>product compare preloader added</li>\n<li>Shop ajax search added to lite</li>\n<li>shop pagination issue fix</li>\n<li>readme content update</li>\n</ul>\n<h4>1.4.3</h4>\n<ul>\n<li>Product Compare Issue Fix</li>\n<li>Added notice style option</li>\n<li>added wishlist button style option</li>\n</ul>\n<h4>1.4.2</h4>\n<ul>\n<li>Theme Compatibily issue fix </li>\n<li>added grid archive layout</li>\n<li>fix cart quantity issue</li>\n<li>added flying cart</li>\n<li>order again button issue fix</li>\n<li>added Shop Archive Desc widget</li>\n</ul>\n<h4>1.4.1</h4>\n<ul>\n<li>update template library</li>\n<li>add shop widget controls</li>\n<li>added ajax search</li>\n</ul>\n<h4>1.4</h4>\n<ul>\n<li>added checkout layout</li>\n<li>fix add to cart issue </li>\n<li>fix mini cart issue</li>\n<li>quick checkout added</li>\n<li>user login style control fix</li>\n<li>cart page duplicate button issue fix</li>\n<li>product compare issue fix</li>\n<li>checkout site settings added </li>\n</ul>\n<h4>1.3.0</h4>\n<ul>\n<li>added new template block</li>\n<li>added sale notifications</li>\n<li>added newslatter</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>fix template library</li>\n<li>added templates in template library</li>\n<li>fix search widget </li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>fix dashboard design issue</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Initial release</li>\n</ul>\n"
    },
    "short_description": "ShopReady - WooCommerce Builder Elementor Addon. Available functions/features are WooCommerce Template Builder (Basic), WooCommerce Product Grid, WooC &hellip;",
    "description": "<p>Easily add dynamic WooCommerce widgets anywhere you like on any Elementor page with the <strong>ShopReady – WooCommerce Plugin</strong>. <strong>ShopReady – WooCommerce Builder</strong> is Easily Create Woocommerce Product Quick View, Product Comparison, woocommerce slider addons, custom product archive builder, sale countdown, Woocommerce variation swatches module, woocommerce product gallery, woocommerce shopping cart, product variations, woocommerce checkout, wishlist, woocommerce currency switcher, floating cart, secure checkout badges, etc. Build a complete store in minutes without writing a single line of code. It’s that simple!</p>\n<p>ShopReady – WooCommerce addon is the most easy to use and complete <strong>Woocommerce Builder for Elementor</strong>. You can edit each and every single components and customize single product page, cart page, archive page, checkout page, order page, my account page, and thank-you page</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/\" rel=\"nofollow ugc\">🚀 Pro Version Available</a> |  <a href=\"https://quomodosoft.com/qsdocs/shop-ready/\" rel=\"nofollow ugc\">👁️ Documentation</a> |  <a href=\"https://support.quomodosoft.com/support/\" rel=\"nofollow ugc\">👩🏼‍💻 Support</a></p>\n<h3>NOTE:</h3>\n<p><a href=\"https://wordpress.org/plugins/elementor/\" rel=\"ugc\">ELEMENTOR</a> PAGE BUILDER IS REQUIRED FOR THIS PLUGIN.</p>\n<h3>SHOPREADY WOOCOMMERCE BUILDER INCLUDES</h3>\n<ul>\n<li><strong>SHOP PAGE BUILDER</strong></li>\n<li><strong>SINGLE PRODUCT TEMPLATE BUILDER</strong></li>\n<li><strong>ARCHIVE PAGE BUILDER</strong></li>\n<li><strong>CART PAGE BUILDER</strong></li>\n<li><strong>CHECKOUT PAGE BUILDER</strong></li>\n<li><strong>MY ACCOUNT PAGE BUILDER</strong></li>\n<li><strong>THANK YOU PAGE BUILDER</strong></li>\n<li><strong>WISHLIST PAGE BUILDER</strong></li>\n<li><strong>PRODUCT COMPARISON PAGE BUILDER</strong></li>\n<li><strong>PRODUCT QUICKVIEW BUILDER</strong></li>\n<li><strong>QUICKVIEW CHECKOUT BUILDER</strong></li>\n</ul>\n<p>You can see the plugin demo here : <a href=\"https://quomodosoft.com/plugins/shopready/\" rel=\"nofollow ugc\">Live Demo</a></p>\n<h3>KEY FEATURES OF ShopReady &#8211; WooCommerce Builder for Elementor</h3>\n<ul>\n<li><strong>WooCommerce Template Builder (Basic)</strong></li>\n<li><strong>WooCommerce Product Grid</strong></li>\n<li><strong>WooCommerce Product Slider</strong></li>\n<li><strong>WooCommerce Product Tab</strong></li>\n<li><strong>Mini Cart</strong></li>\n<li><strong>Side Cart</strong></li>\n<li><strong>Offcanvas Cart</strong></li>\n<li><strong>Action Buttons in different Positions</strong></li>\n<li><strong>Sale / Discount Schedule Counter</strong></li>\n<li><strong>Header Builder</strong></li>\n<li><strong>Footer Builder</strong></li>\n<li><strong>Mega Menu</strong></li>\n<li><strong>WooCommerce Add to Cart</strong></li>\n<li><strong>Stock Progressbar</strong></li>\n<li><strong>WooCommerce UpSell</strong></li>\n<li><strong>WooCommerce CrossSell</strong></li>\n<li><strong>WooCommerce Cart</strong></li>\n<li><strong>WooCommerce Checkout</strong></li>\n<li><strong>WooCommerce Related Product</strong></li>\n<li><strong>Testimonial</strong></li>\n<li><strong>Slider Control Options</strong></li>\n<li><strong>Special Day offer banner</strong></li>\n<li><strong>Product QR Code</strong></li>\n<li><strong>WooCommerce Product Rating</strong></li>\n<li><strong>WooCommerce Product Review</strong></li>\n<li><strong>Custom Product Template Builder</strong></li>\n<li><strong>WooCommerce Product Grid (Curvy)</strong></li>\n<li><strong>Product Accordion Listing</strong></li>\n<li><strong>Product Image Accordion</strong></li>\n<li><strong>WooCommerce Shop Page Builder</strong></li>\n<li><strong>Ajax Add to Cart (shop page)</strong></li>\n<li><strong>Search Filter Demo</strong></li>\n<li>**Template Library **</li>\n<li><strong>One Click Demo (Pro)</strong></li>\n<li><strong>Upcoming More&#8230;</strong></li>\n</ul>\n<h3>SHOPREADY STUNNING &amp; EXCLUSIVE MODULES FOR WOOCOMMERCE.</h3>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/quick-view-details/\" rel=\"nofollow ugc\">QUICK VIEW MODULE:</a><br />\nA good user experience is to save time and click for users and increase the conversion. So here this Module will help. Buyers can click and see the Product details through <strong>woocommerce quick view</strong>, quick view, view product, quickshop plugin, Quick View Module and popup.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/variation-swatches-details/\" rel=\"nofollow ugc\">VARIATION SWATCHES MODULE:</a><br />\nLet the shopper/buyer choose his colors, size and quantity with ShopReady woocommerce product <strong>variations Swatches</strong> Module. Give them authority to  choser their won.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/variation-swatches-details/\" rel=\"nofollow ugc\">WISHLIST MODULE:</a><br />\nWhen you are confused and want to buy as much as possible but still not sure or not ready to cart in, here the functions <strong>Woocommerce Wish list</strong> which helps you. Just add them to your Wishlist and later you can decide. That is a time saving <strong>woocommerce wishlist</strong> from ShopReady WooCommerce Builder now its more easier to handle or create Wishlist.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/product-comparison-module/\" rel=\"nofollow ugc\">PRODUCT COMPARISON MODULE:</a><br />\nDifferent Brand Different Product even different choice. Just put them all in a single table to compare and judged which one is best for you. In ShopReady WooCommerce Builder, we have <strong>Product Comparison</strong> for you as a module.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/sales-notification-module/\" rel=\"nofollow ugc\">SALES NOTIFICATION MODULE-PRO</a><br />\nJust active this effective module from ShopReady WooCommerce Builder dashboard and let your incoming customers know that who is buying and when. So that they can feel confident and depend on your store. <strong>Sales Notification Module</strong> from Shopready will help you to setup the process.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/currency-switcher-module/\" rel=\"nofollow ugc\">CURRENCY SWITCHER MODULE-PRO</a><br />\nYou can set and show the currency for your customers and now this easy with ShopReady WooCommerce Builder <strong>Currency Switcher module</strong>. Shopready comes with woocommerce currency switcher, ultimate currency exchange reviews, ultimate currency exchange, switcher pricing, currency storage, woocommerce multi currency.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/flash-sale-countdown-module/\" rel=\"nofollow ugc\">FLASH SALE COUNTDOWN MODULE-PRO</a><br />\nFor any event, discount period or special offer. You can always show a countdown timer to give a gentle reminder to your visitors about it and its duration length. <strong>Woocommerce Flash Sale Countdown</strong> module from ShopReady is the options to make things easy for you.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/image-masking-module/\" rel=\"nofollow ugc\">IMAGE MASKING</a><br />\nDynamic and eye catchy image of product with different shape and frame will boost your website look and feel. Now its easy to do Woocommerce elementor  <strong>image masking</strong>, with ShopReady <strong>WooCommerce Builder</strong> Image Masking Module.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/\" rel=\"nofollow ugc\">BADGES MODULE-PRO</a><br />\nTo catch attention or to attract towards new, discounted or limited time products, you can use <strong>Badges</strong>. In ShopReady WooCommerce Builder we have bring extensive customization options for this <strong>product badges</strong>.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/quick-checkout-module/\" rel=\"nofollow ugc\">QUICK CHECKOUT MODULE-PRO</a><br />\nTo save time, you don’t need to go pages after pages to buy a single product. Now you are one step behind to checkout directly from you product page. Bingo, ShopReady WooCommerce Builder has presets also for this <strong>woocommerce quick checkout</strong>, woocommerce checkout plugin.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/flying-cart-animation-module/\" rel=\"nofollow ugc\">FLYING CART ANIMATION MODULE-PRO</a><br />\nAnother interesting feature or module, Just add product to your cart and it will land you in the cart icon with a beautiful animation which surely give joy to your customers and will catch attention.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/template-library-module/\" rel=\"nofollow ugc\">TEMPLATE LIBRARY MODULE-PRO</a><br />\nWe have numbers of presets and this library will grow for sure.Now you have the options to choose form the woocommerce shop page template, woocommerce plugin template, Woocommerce Elementor Templates library / ready  presets of ShopReady WooCommerce Builder Template library.</p>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/\" rel=\"nofollow ugc\">🚀 Pro Version Available</a> |  <a href=\"https://quomodosoft.com/qsdocs/shop-ready/\" rel=\"nofollow ugc\">👁️ Documentation</a> |  <a href=\"https://support.quomodosoft.com/support/\" rel=\"nofollow ugc\">👩🏼‍💻 Support</a></p>\n<h3>SHOPREADY – WOOCOMMERCE BUILDER FOR ELEMENTOR SINGLE PRODUCT PAGE WIDGET LISTS</h3>\n<p>WITH STUNNING 20+ WIDGETS, NOW ITS EASIER TO BUILD YOUR OWN SINGLE PRODUCT DETAIL PAGE.</p>\n<ul>\n<li><strong>Product Price Widget:</strong> Change the font, color, size and currency with the pricing widget</li>\n<li><strong>Product Title Widget:</strong> Title plays an important role so we do.now you can customize or portrait your title with more style.</li>\n<li><strong>Woocommerce Ratings:</strong> – Now its more easy with give and collect ratings by ShopReady – WooCommerce Builder for Elementor rating widgets</li>\n<li><strong>Product Upsell:</strong> – Show some more addon products in the product derails page and gain more sales with the Upsell options.</li>\n<li><strong>Woocommerce Additional Information:</strong> – Show more infowith ShopReady – WooCommerce Elementor Addon Additional information widgets.</li>\n<li><strong>Product Add to Cart:</strong> – We have the Add to card button under single product and now its more easy to covert you customers with ShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Woocommerce Product meta:</strong> – show metadata in style with ShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Woocommerce Product Description:</strong> – Dynamically build your product description and show through ShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Single product Image:</strong> – describe more with Visual. Less talk show more with ShopReady – WooCommerce Builder forElementor</li>\n<li><strong>Product Image thumbnail:</strong> – with ShopReady – WooCommerce Builder for Elementor now its more easy to show multiple images as a slider In your product page</li>\n<li><strong>Product SKU:</strong> – A stock-keeping unit is important to take care of your inventory and stock.</li>\n<li><strong>Product Tag:</strong> – With ShopReady – WooCommerce Builder for Elementor we bring Product tag. So now its more easy to Use</li>\n<li><strong>Product Stock:</strong> – Give a clear view about product STOCK status with ShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Product Stock Progress bar:</strong> – Show stock update with a counter bar or progress bar with ShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Product Categories:</strong> now you can organize or showcase segment wise or category wise. You can also show or hide the categories even can do style.</li>\n<li><strong>Woocommerce Product Data Tab:</strong> – Save space and show more with the Data Tab. Most popular Woocommerce Widgets for elementor by ShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Woocommerce product review:</strong> – display your product reviews with in your single product page for your Woocommerce website</li>\n<li><strong>Product Share:</strong> Put a Social Share option anywhere in your product details page.</li>\n<li><strong>WooCommerce Price Filter:</strong> based on the requirement now you can create a price range and segment the product based on that.</li>\n<li><strong>Breadcrumbs:</strong> You will have the text, icon customization option on your Breadcrumbs </li>\n<li><strong>Woocommerce Related Product:</strong> – bring more sale by showing related product and do more upsell with ShopReady<br />\n– WooCommerce Builder for Elementor</li>\n</ul>\n<h3>BUILD YOUR CART PAGE WITH SHOPREADY WIDGETS</h3>\n<p>Don’t let your buyer go empty handed or you can always redirect<br />\nto shop page after a successful checkout.</p>\n<ul>\n<li><strong>Cart Table:</strong> Cart page and its components can be customized easily or you can decorate the table with a beautiful color and typo of your choice through the cart table widgets.</li>\n<li><strong>Cart Total:</strong> Give an overview of the cart total amount and give them assurance of the transparency with proper details.</li>\n<li><strong>Cross-Sell:</strong> With a controlled mindset or funnel now you can showcase the products in the cart page or range of product which is relevant to the cart product.</li>\n<li><strong>Redirect to Shop:</strong> Once a successful checkout bring your customers to Shop page and insist him/her to buy again .</li>\n<li><strong>Empty Cart Message:</strong> Don’t let your visitors empty handed and show them message and remind them to buy.</li>\n</ul>\n<h3>PRODUCT ARCHIVE PAGE WITH SHOPREADY WOOCOMMERCE BUILDER</h3>\n<p>All your achieved product with beautiful design.</p>\n<ul>\n<li><strong>WooCommerce Archive Title:</strong> With a proper Typoghray and style now its easier to design the title</li>\n<li><strong>WooCommerce Archive Products:</strong> We have multi styled product layout to make your archive product page more attractive.</li>\n<li><strong>Description:</strong> Important Info to describe more about the archive page and its ability to customize with shopready  WooCommerce builder.</li>\n</ul>\n<h3>BUILD YOUR CUSTOM CHECKOUT PAGE WITH SHOPREADY</h3>\n<p>For a better feel and user experience it’s the most IMPORTANT part of an eCommerce. Let them feel good and navigate the mind to sell more</p>\n<ul>\n<li><strong>Checkout Payment Section:</strong> Make them feel secure with the Payment portion and set it Infront . Orientation of this section is important chose wisely. You can also design it with text, color &amp; Typo you chose </li>\n<li><strong>Review Checkout Order:</strong> Let confirm the shopper by review the checkout product at cart. Chose a style from our presets or you can build your own.</li>\n<li><strong>Checkout Form Additional:</strong> Don’t bother customers<br />\nwith asking by much info. Just create a form with<br />\nimportant required info field.</li>\n<li><strong>Apply Coupon:</strong> Give your Shoppers a privilege with<br />\ndiscount coupon and remind them about it. Show the<br />\ncoupon section anywhere you want.</li>\n<li><strong>Billing Form Style:</strong> Change the style, orientation or<br />\nlocate in a suitable position with.</li>\n<li><strong>Checkout Form Login:</strong> Create your own login form for<br />\ncheckout page and style it.</li>\n<li><strong>Shipping Form:</strong> Give a makeover to your shipping form<br />\nand style it properly.</li>\n<li><strong>Shipping Methods:</strong> Let the shopper chose the shipping<br />\nmethod and help them feel good while choosing it. Style<br />\nthe shipping method section with more care and love.</li>\n</ul>\n<h3>CREATE BEAUTIFUL ORDER DETAILS PAGE WITH SHOPREADY</h3>\n<p>Show the love and gratitude towards the customers after a<br />\nsuccessful checkout.</p>\n<ul>\n<li><strong>Order Details:</strong> with order details widgets you can have a<br />\nready style or make your own. Show the perfect order<br />\ndetails with it.</li>\n<li><strong>Address Details:</strong> give a boost to your Thank you page<br />\nwith proper info including the address widgets.</li>\n<li><strong>Order Confirm:</strong> Thank them and say congratulations<br />\nwith a order confirmation message.</li>\n<li><strong>Order Thank You:</strong> be humble and WIN more hearts with<br />\na Thank You message to your customers.</li>\n</ul>\n<h3>AUTHORISE YOUR USER/SHOPPERS WITH AN ACCOUNT PAGE BUILDER BY SHOPREADY WOOCOMMERCE BUILDER.</h3>\n<p>Its fun, when you have the authority to navigate or control your<br />\nown account in a website. Give them the leverage to hand it<br />\nthemselves.</p>\n<ul>\n<li><strong>Address:</strong> WooCommerce Default account page tab is<br />\nnow fund to modify and handle.</li>\n<li><strong>Dashboard:</strong> your authority to control and navigate all<br />\nother options available in the my account page.</li>\n<li><strong>Orders:</strong> Its kind of purchase history for your buy from a<br />\nsingle site or account of that website.</li>\n<li><strong>Order Details:</strong> See each and every order details and<br />\nmange your orders.</li>\n<li><strong>Downloads:</strong> For a digital goods that is helpful. Now you<br />\ncan download digital products or info in a file folder from<br />\nthis section.</li>\n<li><strong>Logout:</strong> When there is way to INN there must be a way of<br />\nOUT, we are talking about Logout from the my account<br />\npage.</li>\n<li><strong>Account Details:</strong> An overview of your account details<br />\nform that tab and you can also update it..</li>\n<li><strong>Account Register Form:</strong> create your personalized<br />\nregistration form with shopready  account registration<br />\nform.</li>\n</ul>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/\" rel=\"nofollow ugc\">🚀 Pro Version Available</a> |  <a href=\"https://quomodosoft.com/qsdocs/shop-ready/\" rel=\"nofollow ugc\">👁️ Documentation</a> |  <a href=\"https://support.quomodosoft.com/support/\" rel=\"nofollow ugc\">👩🏼‍💻 Support</a></p>\n<h3>SHOPREADY GENERAL WIDGETS LIST</h3>\n<ul>\n<li><strong>Deal Products:</strong> This widget will let you add your discount<br />\nproducts with a start and end sale date. Deal products will<br />\nlet you show available stock, sold numbers, and many<br />\nmore information to your sale products.</li>\n<li>** Product List Filter:** In ShopReady we have bring the Product list filterable options that will help you to filter products as per your requirements .</li>\n<li><strong>Product Category List:</strong> Show your product categories to<br />\nyour customers in a more attractive way with the product<br />\ncategory list widget. This widget will make your product<br />\ncategories more organized. You can also customize this<br />\noption as you want.</li>\n<li><strong>Recently Viewed Products:</strong> Add a recently viewed<br />\noption to your eCommerce store so that your customers<br />\ncan see the products they viewed a few times before. This<br />\nwidget will help your customers easily find products and<br />\nplace orders.</li>\n<li><strong>Categories (Pro):</strong> Categories widget will let you add<br />\ncategories to any of your WooCommerce pages to ease<br />\nthe product search option for your customers. You can<br />\nalso customize categories for your pages.</li>\n<li><strong>Currency Switcher (Pro):</strong> This is a great widget by<br />\nusing it your customers can switch among different<br />\ncurrencies according to their needs. And let them use that<br />\ncurrency to checkout.</li>\n<li><strong>Flash Sale Products countdown (Pro):</strong> To bring more attention or seeking attention with a countdown timer in the prodct descriptions or in a product area always helps to convert more.</li>\n</ul>\n<h3>ALL REQUIRED WOOCOMMERCE WIDGETS BY SHOPREADY WOOCOMMERCE BUILDER</h3>\n<ul>\n<li><strong>Login:</strong> – Customised Login,my account login, elementor login and register,<br />\nelementor social login, elementor free login page, elementor login logout button,<br />\nelementor login redirect, user login , signup form, login form, register form widgets<br />\n&amp; Create an awesomeWoocommerce website with our easy to use and feature rich<br />\nShopReady elementor addons.</li>\n<li><strong>Forget Password:</strong> – ShopReady – WooCommerce Builder<br />\nfor Elementor has Forget Password Widgets to help you to<br />\nrecover your lost password.</li>\n<li><strong>SignUp:</strong> – To bring new customers and build a solid<br />\ncustomer based, ShopReady Signup widgets is best for<br />\nyour Woocommerce wesbsite.</li>\n<li><strong>Menu:</strong> – Navigate your user with a customise menu elementor mobile menu, elementor responsive menu, elementor hamburger menu, elementor post navbar, elementor post site menu, elementor post menu styler, elementor post nav menu toggle button, elementor nav menu sticky, elementor add button to menu, elementor add icons to menu from<br />\nShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>QR Code:</strong> – Using Qr Code now its easy to provide<br />\ninformation about the products. Its free in ShopReady –<br />\nWooCommerce Builder for Elementor</li>\n<li><strong>Testimonial:</strong> – Collect more testimonials with ShopReady<br />\n– WooCommerce Builder for Elementor fro your<br />\nWoocommerce shop and product build trust for new<br />\nbuyers</li>\n<li><strong>Button:</strong> – we have range of buttons to take ACTION on<br />\nthe products</li>\n<li><strong>FAQ:</strong> – Pre made questions with answers with a tab<br />\nfunctional. It will save time and buyers get info in<br />\nadvance.</li>\n<li><strong>Mega Menu:</strong> – We have Mega menu to show more<br />\nvariety in the menu to the customers.</li>\n<li><strong>Header Build:</strong> – We also have Header Builder in<br />\nShopReady – WooCommerce Builder for Elementor</li>\n<li><strong>Footer Builder:</strong> – ShopReady – WooCommerce Builder<br />\nfor Elementor contains Footer Builder options / features to<br />\nmake your desire one</li>\n</ul>\n<p><a href=\"https://quomodosoft.com/plugins/shopready/\" rel=\"nofollow ugc\">🚀 Pro Version Available</a> |  <a href=\"https://quomodosoft.com/qsdocs/shop-ready/\" rel=\"nofollow ugc\">👁️ Documentation</a> |  <a href=\"https://support.quomodosoft.com/support/\" rel=\"nofollow ugc\">👩🏼‍💻 Support</a></p>\n<p><strong>IT’S TIME TO GET STARTED WITH ShopReady</strong><br />\nLearn How to Install and Use <a href=\"https://youtu.be/grvpUvMFFqg\" rel=\"nofollow ugc\">ShopReady</a></p>\n<p>Stay Updated with our <a href=\"https://www.youtube.com/watch?v=grvpUvMFFqg&amp;list=PLppJphJlREVWAUpufxCJxRgvL35uxlCoq\" rel=\"nofollow ugc\">Youtube Channel</a></p>\n<h3>OUR OTHER PLUGINS</h3>\n<p>If you like using ShopReady WooCommerce Builder, then consider checking out our other WordPress plugins:</p>\n<p><a href=\"https://wordpress.org/plugins/element-ready-lite\" rel=\"ugc\">ElementsReady</a> &#8211; Elements Ready Elementor Addons With Header &amp; Footer Builder</p>\n<p><a href=\"https://wordpress.org/plugins/qs-dark-mode/\" rel=\"ugc\">QS Dark Mode</a> &#8211; QS Dark Mode –  Click and change the website interface to BLACK mode with QS Dark Mode WordPress Plugin</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.3.3.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/shopready-elementor-addon/assets/screenshot-1.png?rev=2752560",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/shopready-elementor-addon/assets/screenshot-2.png?rev=2752560",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/shopready-elementor-addon/assets/screenshot-3.png?rev=2752560",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/shopready-elementor-addon/assets/screenshot-4.png?rev=2752560",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/shopready-elementor-addon/assets/screenshot-5.png?rev=2752560",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/shopready-elementor-addon/assets/screenshot-6.png?rev=2752560",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/shopready-elementor-addon/assets/screenshot-7.png?rev=2752560",
            "caption": ""
        }
    ],
    "tags": {
        "elementor-addon": "elementor addon",
        "woocommerce": "woocommerce",
        "woocommerce-addon": "woocommerce addon",
        "woocommerce-builder": "WooCommerce Builder",
        "woocommerce-plugin": "WooCommerce Plugin"
    },
    "stable_tag": "3.3",
    "versions": {
        "1.8": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.1.8.zip",
        "1.9": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.1.9.zip",
        "2.0": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.2.0.zip",
        "2.1": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.2.1.zip",
        "2.2": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.2.2.zip",
        "2.3": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.2.3.zip",
        "2.4": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.2.4.zip",
        "2.5": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.2.5.zip",
        "2.6": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.2.6.zip",
        "2.7": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.2.7.zip",
        "2.8": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.2.8.zip",
        "2.9": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.2.9.zip",
        "3.0": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.3.0.zip",
        "3.1": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.3.1.zip",
        "3.2": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.3.2.zip",
        "3.3": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.3.3.zip",
        "trunk": "https://downloads.wordpress.org/plugin/shopready-elementor-addon.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/shopready-elementor-addon/assets/banner-772x250.jpg?rev=2741588",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/shopready-elementor-addon/assets/icon-128x128.png?rev=2741588"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 88,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}