{
    "name": "Silvasoft boekhouden",
    "slug": "silvasoft-boekhouden",
    "version": "3.0.1",
    "author": "<a href=\"https://www.silvasoft.nl\">silvasoft</a>",
    "author_profile": "https://profiles.wordpress.org/silvasoft/",
    "contributors": {
        "silvasoft": {
            "profile": "https://profiles.wordpress.org/silvasoft/",
            "avatar": "https://secure.gravatar.com/avatar/22c3cbce0ec208a5f9c6a9b23ff20326?s=96&d=monsterid&r=g",
            "display_name": "silvasoft"
        }
    },
    "requires": "5.0",
    "tested": "6.5.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 2,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 2,
    "support_url": "https://wordpress.org/support/plugin/silvasoft-boekhouden/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 300,
    "downloaded": 7893,
    "last_updated": "2024-05-18 09:49:00",
    "added": "2017-09-11",
    "homepage": "https://www.silvasoft.nl/artikel/woocommerce-boekhouding/",
    "sections": {
        "description": "<p>Met deze plugin koppelt u uw WooCommerce webshop eenvoudig met Silvasoft. U kunt uw orders vanuit WooCommerce naar Silvasoft versturen als verkopen in de module &#8220;Boekhouding&#8221; of als facturen in de module &#8220;Facturatie&#8221; of als order in de module &#8220;Offertes &amp; orders&#8221;. Alle orders, relaties en producten in uw webwinkel worden volledig automatisch verwerkt in uw (Silvasoft) administratie, u hoeft hier helemaal niets aan te doen!</p>\n<h3>Gratis boekhoudkoppeling voor uw WooCommerce webshop?</h3>\n<p>Meld u nu aan op <a href=\"https://www.silvasoft.nl/?src-rf=woocommerce\" title=\"Ga naar silvasoft.nl\" rel=\"nofollow ugc\">www.silvasoft.nl</a> of <a href=\"https://www.silvasoft.be/?src-rf=woocommerce\" title=\"Ga naar silvasoft.be\" rel=\"nofollow ugc\">www.silvasoft.be</a> en start uw gratis 30 dagen proefperiode van de Silvasoft bedrijfssoftware om direct gratis aan de slag te gaan met deze koppeling.</p>\n<h3>Voordelen van deze gratis koppeling</h3>\n<ul>\n<li>Automatisch boekhouden voor uw WooCommerce webwinkel!</li>\n<li>Uw WooCommerce orders automatisch als boekingen, facturen of verkooporders in Silvasoft.</li>\n<li>Uw klanten worden automatisch bewaard in het Silvasoft CRM.</li>\n<li>Uw producten worden automatisch bewaard in het Silvasoft product- en voorraadbeheer.</li>\n<li>Voorraadmutaties worden aangemaakt in Silvasoft voor WooCommerce bestellingen.</li>\n<li>2-way sync van voorraad. Voorraad vanuit Silvasoft doorvoeren in uw WooCommerce artikelen</li>\n<li>Ondersteuning voor creditnota&#8217;s / (partial) refunds.</li>\n<li>Ondersteuning voor de WooCommerce plugins: EU Vat Assistant, EU Vat Compliance, Booster, Jetpack for WooCommerce en meer.</li>\n<li>Mogelijkheid tot handmatig versturen van oude orders naar Silvasoft in bulk en per order.</li>\n<li>Volledig configureerbaar. Eigen grootboekrekening koppeling per land, eigen btw-code koppeling per land.</li>\n<li>Betaalbaar, compleet en online boekhouden voor Nederland én België doet u met Silvasoft!</li>\n</ul>\n<h3>Hoe werkt het?</h3>\n<p>U kunt binnen Silvasoft via het menu Beheer &gt; API de API activeren. U kunt direct aan de slag met het gratis API plan. Met behulp van uw Silvasoft gebruikersnaam en de API code die u in Silvasoft kunt opvragen schakelt u snel de koppeling in. Lees meer in het tabblad &#8220;Installation&#8221; van deze plugin.</p>\n<h3>Producten, voorraad en CRM relaties</h3>\n<p>Alle orders worden automatisch gekoppeld aan een CRM relatie in Silvasoft. Is deze relatie nog niet aanwezig in uw administratie, dan wordt deze automatisch aangemaakt! Maakt u in Silvasoft ook gebruik van de module &#8220;Product- en voorraadbeheer&#8221; dan worden automatisch uw producten en productvoorraaden bijgewerkt op basis van de WooCommerce bestellingen.</p>\n<h3>Koppelingen met de Silvasoft modules</h3>\n<p><strong>Koppeling met boekhouding</strong><br />\nIndien u bij de instelling &#8220;Hoe wilt u de orders versturen naar Silvasoft?&#8221; kiest voor &#8220;Aanmaken als verkoopboeking&#8221; dan worden uw orders verstuurd naar de Silvasoft &#8220;Boekhouden&#8221; module.</p>\n<p><strong>Koppeling met facturatie</strong><br />\nIndien u bij de instelling &#8220;Hoe wilt u de orders versturen naar Silvasoft?&#8221; kiest voor &#8220;Aanmaken als verkoopfactuur&#8221; dan worden uw orders verstuurd naar de Silvasoft &#8220;Facturatie&#8221; module. Deze komen ook automatisch in uw boekhouding terecht. Via de facturatiemodule heeft u aanvullende mogelijkheden voor de orders zoals het opmaken van een pakbon, PDF factuur, versturen van mails en meer.</p>\n<p><strong>Koppeling met offertes &amp; orders</strong><br />\nIndien u bij de instelling &#8220;Hoe wilt u de orders versturen naar Silvasoft?&#8221; kiest voor &#8220;Aanmaken als verkooporder&#8221; dan worden uw orders verstuurd naar de Silvasoft &#8220;Offertes &amp; orders&#8221; module. Deze komen ook automatisch in uw order overzicht terecht. Via de Offertes &amp; orders module heeft u aanvullende mogelijkheden voor de orders zoals het opmaken van een pakbon, omzetten van order naar factuur, versturen van mails en meer.</p>\n<p><strong>Koppeling met product &amp; voorraadbeheer</strong><br />\nU kunt ervoor kiezen om 2-way synchronisatie in te schakelen. Hiermee wordt de voorraad vanuit de Silvasoft bedrijfssoftware overgenomen in uw WooCommerce webshop. Heeft u meerdere webshops, of maakt u ook handmatig orders/facturen of voorraadmutaties in Silvasoft, dan blijt uw voorraad in WooCommerce altijd up-to-date!</p>\n",
        "installation": "<p>Het installeren en activeren van deze plugin doet u razendsnel, als volgt:<br />\n1. Ga in uw Silvasoft omgeving naar het menu Beheer &gt; API<br />\n2. Indien u nog geen API plan geactiveerd heeft, kiest u eerst een plan. Daarna logt u uit en opnieuw in. Ga nu opnieuw naar het menu Beheer &gt; API.<br />\n3. U ziet nu uw API gegevens. Vraag een (nieuwe) API token op en bewaar deze. Met behulp van deze token koppelen we namelijk uw webshop aan Silvasoft.<br />\n4. Ga nu in uw WordPress website omgeving naar het menu Silvasoft &gt; Instellingen. Configureer hier uw Silvasoft gebruikersnaam, api-token en eventuele andere instellingen.<br />\n5. Bewaar uw instellingen, en u bent helemaal klaar!</p>\n<p>Uw orders zullen automatisch verstuurd worden wanneer ze de juiste status hebben. Wilt u een order handmatig versturen naar Silvasoft? Vanuit het WooCommerce order overizcht kunt u dit met 1 druk op de knop doen. Ga hiervoor naar het order overzicht van WooCommerce (bestelling overzicht) en klik daar op de knop &#8216;Silvasoft&#8217; in de kolom &#8216;Acties&#8217; om een order te versturen naar Silvasoft. Wilt u meerdere orders tegelijk versturen, selecteer ze dan en kies vervolgens onder de keuzelijst &#8216;Acties&#8217; (bovenaan het order overzicht) voor &#8216;Verstuur orders naar Silvasoft (bulk)&#8217; en klik op &#8216;Toepassen&#8217;.</p>\n<h4>Server / Installatie vereisten</h4>\n<ul>\n<li>PHP version 5.2.4 of hoger (let op: bij problemen PHP 7 of hoger gebruiken!)</li>\n<li>MySQL version 5.0 of hoger</li>\n<li>Support voor de volgende PHP functies: curl, json_encode, json_decode</li>\n<li>WooCommerce</li>\n</ul>\n",
        "changelog": "<h4>3.0.1</h4>\n<ul>\n<li>Nieuw: nieuwe instellingen voor synchronisatie van voorraad vanuit Silvasoft richting WooCommerce. </li>\n<li>Let op: plugin moet worden uitgeschakeld en opnieuw ingeschakeld (na updaten). Uw instellingen blijven behouden. Bekijk de Silvasoft kennisbank en YouTube kanaal voor meer informatie en een demo video. </li>\n<li>Minor fix</li>\n</ul>\n<h4>3.0</h4>\n<ul>\n<li>Nieuw: nieuwe instellingen voor synchronisatie van voorraad vanuit Silvasoft richting WooCommerce. </li>\n<li>Let op: plugin moet worden uitgeschakeld en opnieuw ingeschakeld (na updaten). Uw instellingen blijven behouden. Bekijk de Silvasoft kennisbank en YouTube kanaal voor meer informatie en een demo video. </li>\n</ul>\n<h4>2.7.4</h4>\n<ul>\n<li>Fix limiet orderregels voor grote orders</li>\n</ul>\n<h4>2.7.3</h4>\n<ul>\n<li>Fix voor EU Vat Number ondersteuning</li>\n</ul>\n<h4>2.7.2</h4>\n<ul>\n<li>Diverse technische verbeteringen</li>\n</ul>\n<h4>2.7.1</h4>\n<ul>\n<li>Diverse technische verbeteringen</li>\n</ul>\n<h4>2.7.0</h4>\n<ul>\n<li>Fix: diverse issues rondom creditnota&#8217;s versturen</li>\n<li>Fix: verbeterde compatibiliteit met PHP 8 en WP 6+</li>\n<li>Let op: bij problemen graag updaten naar nieuwste versie WooCommerce en PHP 8+</li>\n</ul>\n<h4>2.6.0</h4>\n<ul>\n<li>PHP 8 compatibiliteit</li>\n</ul>\n<h4>2.5.0</h4>\n<ul>\n<li>Nieuw: mogelijkheid tot koppelen landcode + btw % aan een eigen btw-code in Silvasoft. Zie het menu: Silvasoft &gt; Instellingen voor meer informatie. </li>\n<li>Fix: nu compatible met WordPress 6+. </li>\n<li>Fix: diverse derepcated PHP meldingen </li>\n<li>Fix: compatibiliteit met de volgende plugins: &#8220;EU/UK VAT Compliance for WooCommerce&#8221;,  &#8220;Sequential Order Numbers for WooCommerce&#8221;, &#8220;Booster for WooCommerce&#8221;, &#8220;EU Vat for WooCommerce&#8221;. LET OP: update deze plugins naar de laatste versie indien u deze gebruikt! </li>\n</ul>\n<h4>2.4.9</h4>\n<ul>\n<li>Fix: in sommige gevallen kwamen orders met verschillende btw-percentages in 1 order niet goed door. </li>\n</ul>\n<h4>2.4.8</h4>\n<ul>\n<li>Nieuw: mogelijkheid tot koppelen afwijkende opbrengstrekening per land (om omzet te splitsen per land op verschillende grootboekrekeningen)</li>\n<li>Fix: de instelling &#8220;Orderregels met bedrag 0 euro meesturen naar Silvasoft?&#8221; werkte niet naar behoren, dit is nu opgelost</li>\n</ul>\n<h4>2.4.7</h4>\n<ul>\n<li>Fix voor verkeerd btw-percentage vanuit order naar Silvasoft gestuurd</li>\n</ul>\n<h4>2.4.6</h4>\n<ul>\n<li>Fix error veroorzaakt door de gratis &#8220;woocommerce-eu-vat-compliance&#8221; plugin</li>\n</ul>\n<h4>2.4.5</h4>\n<ul>\n<li>Ondersteuning voor &#8216;Sequential Order Number&#8217; plugin van SkyVerge</li>\n<li>Nieuwe instelling om de artikelomschrijving vanuit Silvasoft te gebruiken als omschrijving voor de factuur- of orderregel (in plaats van de naam van het artikel).</li>\n</ul>\n<h4>2.4.4</h4>\n<ul>\n<li>Fix PHP error undefined index partialrefund</li>\n</ul>\n<h4>2.4.3</h4>\n<ul>\n<li>Kleine verbeteringen aan logging en API interactie</li>\n</ul>\n<h4>2.4.2</h4>\n<ul>\n<li>Nieuwe instelling om bij verzendkosten onderscheid te maken in Silvasoft tussen verschillende btw-tarieven. Voorbeeld: verzendkosten met 21% btw wordt op een ander artikelnummer geboekt als verzendkosten 6% btw. </li>\n</ul>\n<h4>2.4.1</h4>\n<ul>\n<li>Verbeterde error logging</li>\n</ul>\n<h4>2.4</h4>\n<ul>\n<li>Ondersteuning voor Booster EU Vat validatie. Btw-nummer wordt nu overgenomen naar de relatie in Silvasoft.</li>\n<li>Ondersteuning voor shop instellingen &#8216;prijzen ingevoerd inclusief btw&#8217; of &#8216;prijzen ingevoerd exclusief btw&#8217;. Silvasoft zal bij nieuwe producten op basis van deze instelling de prijs juist overnemen. </li>\n<li>Fix voor voorraadberekening in Silvasoft bij doorboeken order vanuit WooCommerce als factuur</li>\n<li>Orderregels van 0 euro krijgen nu niet meer noodzakelijk ook 0% btw in Silvasoft. Indien in Silvasoft voor het artikel een ander btw-percentage is geconfigureerd zal dat percentage gebruikt worden. Indien het artikel nog niet bestaat in Silvasoft, of geen btw is ingesteld bij het artikel zal 0% gebruikt worden. </li>\n</ul>\n<h4>2.3</h4>\n<ul>\n<li>Nieuwe instelling voor btw bij verlegde verkopen. Mogelijkheid tot instellen van een btw-code zodat verlegde verkopen in Silvasoft geboekt worden op het btw-percentage dat is ingesteld. </li>\n<li>Nieuwe instelling om aan te geven wanneer orders verstuurd moeten worden naar Silvasoft. Keuze uit: direct na statuswijziging, in de achtergrond via CRON of enkel handmatig. Meer uitleg van de keuzes vindt u in het instellingen scherm. Let op: om van de CRON keuze gebruik te maken dient u de plugin eenmalig te deactiveren en opnieuw te activeren! </li>\n</ul>\n<h4>2.2</h4>\n<ul>\n<li>Extra fee regels worden nu gesplitst op de naam van de regel in Silvasoft als product. Voorheen werden alle fees geboekt op het product &#8216;woo-fee&#8217;</li>\n<li>Er zijn een aantal instellingen toegevoegd waarmee kan worden aangegeven op welke opbrengstrekeningen de verkopen geboekt moeten worden in Silvasoft. Aparte obrengstrekeningen voor binnenland, buitenland binnen EU, en buitenland buiten EU kunnen worden opgegeven. </li>\n<li>Er is een instelling toegevoegd waarmee u kunt kiezen of de datum van de order, of de datum van versturen moet worden gebruikt in Silvasoft bij de aangemaakte boeking / order. </li>\n<li>De debug-mode is uitgebreid qua logging en foutmeldingen in de logging zijn verbeterd.</li>\n</ul>\n<h4>2.1.4.1</h4>\n<ul>\n<li>Verbeterde logging</li>\n</ul>\n<h4>2.1.4</h4>\n<ul>\n<li>Verbeterde logging</li>\n</ul>\n<h4>2.1.3</h4>\n<ul>\n<li>Fix voor PHP warning headers already sent</li>\n</ul>\n<h4>2.1.2</h4>\n<ul>\n<li>Fix voor overname van datum bij overzetten historische orders naar Silvasoft</li>\n<li>Nieuwe optie om alle orders als niet-verstuurd te markeren (onderaan de log pagina)</li>\n</ul>\n<h4>2.1.1</h4>\n<ul>\n<li>Fix voor gedeeltelijke terugbetalingen</li>\n</ul>\n<h4>2.1</h4>\n<ul>\n<li>Nieuw! Ondersteuning voor gedeeltelijke terugbetalingen. Vanuit het order overzicht kan de terugbetaling naar Silvasoft gestuurd worden via de knop &#8216;Silvasoft (credit)&#8217;</li>\n<li>Nieuw! In het orderoverzicht wordt nu een aparte knop getoond voor creditnota&#8217;s. Deze knop verschijnt zodra de order de status heeft die is ingesteld als &#8216;creditnota&#8217; status in de plugin instellingen. De knop verschijnt ook zodra er een gedeeltelijke terugbetaling is aangemaakt bij de order.</li>\n</ul>\n<h4>2.0.4.2</h4>\n<ul>\n<li>Fix voor bestellingen van bedrijven met btw, zonder bedrijfsnaam. Naam van de persoon wordt nu overgenomen als bedrijfsnaam in het Silvasoft CRM. </li>\n</ul>\n<h4>2.0.4.1</h4>\n<ul>\n<li>Fix voor verzendkosten met btw voor verzendingen naar het buitenland.</li>\n</ul>\n<h4>2.0.4</h4>\n<ul>\n<li>Verschillende verzendmethodes worden vanaf nu gekoppeld aan verschillende producten in Silvasoft op basis van de titel van de verzendmethode.</li>\n</ul>\n<h4>2.0.3</h4>\n<ul>\n<li>Debug mode beschikbaar voor foutopsporing. </li>\n</ul>\n<h4>2.0.2</h4>\n<ul>\n<li>Nieuw! Bij herkenning van btw-nummer bij de relatie wordt de relatie nu aangemaakt als bedrijf in Silvasoft.</li>\n<li>Nieuw! Ondersteuning voor herkenning van btw-nummer via de extra velden &#8216;_vat_number&#8217; en &#8216;vat_number&#8217;. </li>\n<li>Nieuw! Mogelijkheid tot het instellen van een btw-percentage voor verzendkosten zodat Silvasoft deze juist herkent indien de vezendkosten 0 euro zijn.</li>\n<li>Nieuw! Afwijkend adres voor verzending (indien opgegeven bij het afrekene in de webshop) wordt in Silvasoft nu gekoppeld als adres voor de pakbon bij de order of factuur. </li>\n</ul>\n<h4>2.0.1</h4>\n<ul>\n<li>Nieuw! Verstuur historische orders naar Silvasoft in bulk</li>\n<li>Nieuw! De knop &#8216;Silvasoft&#8217; in de kolom &#8216;Acties&#8217; in het WooCommerce order overzicht is nu doorzichtig voor orders die al verstuurd zijn. Zo is snel te zien welke orders (succesvol) verstuurd zijn naar Silvasoft, en welke niet. </li>\n</ul>\n<h4>1.9.6</h4>\n<ul>\n<li>Fix for &#8220;JSONObject[&#8220;SubTotalInclTax&#8221;] is not a number.&#8221; error</li>\n</ul>\n<h4>1.9.5</h4>\n<ul>\n<li>Fix for rounding issues (WooCommerce total rounding different from Silvasoft)</li>\n</ul>\n<h4>1.9.4</h4>\n<ul>\n<li>Bugfix (errors in Apache log)</li>\n</ul>\n<h4>1.9.3</h4>\n<ul>\n<li>Bugfix</li>\n</ul>\n<h4>1.9.2</h4>\n<ul>\n<li>Nieuwe instelling om 0 euro regels (gratis producten) mee te sturen naar Silvasoft (voor bijvoorbeeld voorraadbeheer)</li>\n</ul>\n<h4>1.9.1</h4>\n<ul>\n<li>Fix voor ordernummer in referentie of opmerking van offerte/order. </li>\n</ul>\n<h4>1.9</h4>\n<ul>\n<li>Het is nu mogelijk om uw orders te laten versturen naar de Silvasoft module &#8216;Offertes &amp; orders&#8217;. </li>\n<li>Fix voor aanschrijfwijze contactpersoon o.b.v. voorletter.</li>\n</ul>\n<h4>1.8.2</h4>\n<ul>\n<li>Kleine bugfixes en verbeteringen</li>\n</ul>\n<h4>1.8.1</h4>\n<ul>\n<li>Ondersteuning voor meesturen van WooCommerce Booster plugin aangepast ordernummer in de factuuropmerking.</li>\n<li>Nieuwe instelling! Mogelijkheid tot het overnemen van het WooCommerce ordernummer naar het Silvasoft referentie veld bij een factuur.</li>\n</ul>\n<h4>1.8</h4>\n<ul>\n<li>Ondersteuning voor WooCommerce Booster plugin (extra kosten voor betaalmethodes)</li>\n<li>Nieuwe instelling om billing_address_2 als huisnummer veld te gebruiken</li>\n</ul>\n<h4>1.7</h4>\n<ul>\n<li>Ondersteuning voor EU Vat Assistant plugin van Aelia. Btw-nummer ingevoerd via deze plugin bij de order wordt meegestuurd naar Silvasoft.</li>\n<li>Ondersteuning voor custom post field &#8216;vat_number&#8217;. Wanneer dit veld wordt gevonden in de order meta zal het gebruikt worden als btw-nummer en meegestuurd worden naar Silvasoft.</li>\n</ul>\n<h4>1.6</h4>\n<ul>\n<li>Fix voor btw percentage not found in user administration error</li>\n</ul>\n<h4>1.5</h4>\n<ul>\n<li>Compatibiliteit met WooCommerce 3.6.4 en hoger</li>\n</ul>\n<h4>1.4</h4>\n<ul>\n<li>Het is nu mogelijk een eigen factuuropmerking mee te sturen naar Silvasoft</li>\n<li>De EU Vat Compliance plugin van SimbaHosting wordt nu ondersteund (het btw-nummer dat klanten opgeven in de checkout wordt meegestuurd naar Silvasoft)</li>\n</ul>\n<h4>1.3</h4>\n<ul>\n<li>Compatibiliteit met WooCommerce 3.2 en hoger</li>\n<li>Fix voor het versturen van orders</li>\n<li>Nieuwe feature: handmatig versturen van een order vanuit het WooCommerce order overizcht. </li>\n</ul>\n<h4>1.2</h4>\n<ul>\n<li>Fix voor WP 4.8 en hoger (convert_to_screen) error. </li>\n</ul>\n<h4>1.1</h4>\n<ul>\n<li>Orders die niet verstuurd konden worden (bijvoorbeeld door ongeldige API key) kunnen nu handmatig opnieuw verstuurd worden vanuit het log overzicht. </li>\n<li>Diverse verbeteringen</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Initial release of the WooCommerce &#8211; Silvasoft connector</li>\n</ul>\n"
    },
    "short_description": "Koppel WooCommerce aan uw Silvasoft bedrijfssoftware voor automatische boekhouding, orders &amp; facturatie en voorraadbeheer. Automatisch. Eenvoudig.",
    "description": "<p>Met deze plugin koppelt u uw WooCommerce webshop eenvoudig met Silvasoft. U kunt uw orders vanuit WooCommerce naar Silvasoft versturen als verkopen in de module &#8220;Boekhouding&#8221; of als facturen in de module &#8220;Facturatie&#8221; of als order in de module &#8220;Offertes &amp; orders&#8221;. Alle orders, relaties en producten in uw webwinkel worden volledig automatisch verwerkt in uw (Silvasoft) administratie, u hoeft hier helemaal niets aan te doen!</p>\n<h3>Gratis boekhoudkoppeling voor uw WooCommerce webshop?</h3>\n<p>Meld u nu aan op <a href=\"https://www.silvasoft.nl/?src-rf=woocommerce\" title=\"Ga naar silvasoft.nl\" rel=\"nofollow ugc\">www.silvasoft.nl</a> of <a href=\"https://www.silvasoft.be/?src-rf=woocommerce\" title=\"Ga naar silvasoft.be\" rel=\"nofollow ugc\">www.silvasoft.be</a> en start uw gratis 30 dagen proefperiode van de Silvasoft bedrijfssoftware om direct gratis aan de slag te gaan met deze koppeling.</p>\n<h3>Voordelen van deze gratis koppeling</h3>\n<ul>\n<li>Automatisch boekhouden voor uw WooCommerce webwinkel!</li>\n<li>Uw WooCommerce orders automatisch als boekingen, facturen of verkooporders in Silvasoft.</li>\n<li>Uw klanten worden automatisch bewaard in het Silvasoft CRM.</li>\n<li>Uw producten worden automatisch bewaard in het Silvasoft product- en voorraadbeheer.</li>\n<li>Voorraadmutaties worden aangemaakt in Silvasoft voor WooCommerce bestellingen.</li>\n<li>2-way sync van voorraad. Voorraad vanuit Silvasoft doorvoeren in uw WooCommerce artikelen</li>\n<li>Ondersteuning voor creditnota&#8217;s / (partial) refunds.</li>\n<li>Ondersteuning voor de WooCommerce plugins: EU Vat Assistant, EU Vat Compliance, Booster, Jetpack for WooCommerce en meer.</li>\n<li>Mogelijkheid tot handmatig versturen van oude orders naar Silvasoft in bulk en per order.</li>\n<li>Volledig configureerbaar. Eigen grootboekrekening koppeling per land, eigen btw-code koppeling per land.</li>\n<li>Betaalbaar, compleet en online boekhouden voor Nederland én België doet u met Silvasoft!</li>\n</ul>\n<h3>Hoe werkt het?</h3>\n<p>U kunt binnen Silvasoft via het menu Beheer &gt; API de API activeren. U kunt direct aan de slag met het gratis API plan. Met behulp van uw Silvasoft gebruikersnaam en de API code die u in Silvasoft kunt opvragen schakelt u snel de koppeling in. Lees meer in het tabblad &#8220;Installation&#8221; van deze plugin.</p>\n<h3>Producten, voorraad en CRM relaties</h3>\n<p>Alle orders worden automatisch gekoppeld aan een CRM relatie in Silvasoft. Is deze relatie nog niet aanwezig in uw administratie, dan wordt deze automatisch aangemaakt! Maakt u in Silvasoft ook gebruik van de module &#8220;Product- en voorraadbeheer&#8221; dan worden automatisch uw producten en productvoorraaden bijgewerkt op basis van de WooCommerce bestellingen.</p>\n<h3>Koppelingen met de Silvasoft modules</h3>\n<p><strong>Koppeling met boekhouding</strong><br />\nIndien u bij de instelling &#8220;Hoe wilt u de orders versturen naar Silvasoft?&#8221; kiest voor &#8220;Aanmaken als verkoopboeking&#8221; dan worden uw orders verstuurd naar de Silvasoft &#8220;Boekhouden&#8221; module.</p>\n<p><strong>Koppeling met facturatie</strong><br />\nIndien u bij de instelling &#8220;Hoe wilt u de orders versturen naar Silvasoft?&#8221; kiest voor &#8220;Aanmaken als verkoopfactuur&#8221; dan worden uw orders verstuurd naar de Silvasoft &#8220;Facturatie&#8221; module. Deze komen ook automatisch in uw boekhouding terecht. Via de facturatiemodule heeft u aanvullende mogelijkheden voor de orders zoals het opmaken van een pakbon, PDF factuur, versturen van mails en meer.</p>\n<p><strong>Koppeling met offertes &amp; orders</strong><br />\nIndien u bij de instelling &#8220;Hoe wilt u de orders versturen naar Silvasoft?&#8221; kiest voor &#8220;Aanmaken als verkooporder&#8221; dan worden uw orders verstuurd naar de Silvasoft &#8220;Offertes &amp; orders&#8221; module. Deze komen ook automatisch in uw order overzicht terecht. Via de Offertes &amp; orders module heeft u aanvullende mogelijkheden voor de orders zoals het opmaken van een pakbon, omzetten van order naar factuur, versturen van mails en meer.</p>\n<p><strong>Koppeling met product &amp; voorraadbeheer</strong><br />\nU kunt ervoor kiezen om 2-way synchronisatie in te schakelen. Hiermee wordt de voorraad vanuit de Silvasoft bedrijfssoftware overgenomen in uw WooCommerce webshop. Heeft u meerdere webshops, of maakt u ook handmatig orders/facturen of voorraadmutaties in Silvasoft, dan blijt uw voorraad in WooCommerce altijd up-to-date!</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.3.0.1.zip",
    "upgrade_notice": {
        "1.0.0": "<p>Initial release</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/silvasoft-boekhouden/assets/screenshot-1.jpg?rev=2801244",
            "caption": "Plugin instellingen. Configureer snel en eenvoudig de API connectie. Bepaal zelf bij welke status uw WooCommerce orders naar Silvasoft verstuurd moeten worden. Bepaal tevens of het als verkoopboeking, of verkoopfactuur in Silvasoft moet worden aangemaakt."
        },
        {
            "src": "https://ps.w.org/silvasoft-boekhouden/assets/screenshot-2.jpg?rev=2801242",
            "caption": "Plugin log. Vindt precies terug welke orders verstuurd zijn (of niet) naar Silvasoft. Lost eventuele fouten handmatig op."
        },
        {
            "src": "https://ps.w.org/silvasoft-boekhouden/assets/screenshot-3.jpg?rev=2801242",
            "caption": "In Silvasoft. Uw orders komen volledig automatisch in uw Silvasoft boekhouding verkoopboek."
        },
        {
            "src": "https://ps.w.org/silvasoft-boekhouden/assets/screenshot-4.jpg?rev=2801242",
            "caption": "In Silvasoft. Uw orders in Silvasoft laten aanmaken als verkoopfactuur."
        },
        {
            "src": "https://ps.w.org/silvasoft-boekhouden/assets/screenshot-5.jpg?rev=2801242",
            "caption": "In Silvasoft. Synchronisatie van uw WooCommerce producten en voorraadbeheer in Silvasoft."
        }
    ],
    "tags": {
        "boekhouden": "boekhouden",
        "boekhoudprogramma": "boekhoudprogramma",
        "factureren": "factureren",
        "silvasoft-be": "silvasoft.be",
        "silvasoft-nl": "silvasoft.nl"
    },
    "stable_tag": "3.0.1",
    "versions": {
        "1.1": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.1.zip",
        "1.2": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.2.zip",
        "1.3": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.3.zip",
        "1.4": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.4.zip",
        "1.5": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.5.zip",
        "1.6": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.6.zip",
        "1.7": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.7.zip",
        "1.8": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.8.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.8.1.zip",
        "1.8.2": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.8.2.zip",
        "1.9": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.9.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.9.1.zip",
        "1.9.2": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.9.2.zip",
        "1.9.3": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.9.3.zip",
        "1.9.4": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.9.4.zip",
        "1.9.5": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.9.5.zip",
        "1.9.6": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.1.9.6.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.0.4.zip",
        "2.0.4.1": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.0.4.1.zip",
        "2.0.4.2": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.0.4.2.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.1.2.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.1.3.zip",
        "2.1.4": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.1.4.zip",
        "2.1.4.1": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.1.4.1.zip",
        "2.2": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.2.zip",
        "2.3": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.3.zip",
        "2.4": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.4.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.4.1.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.4.2.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.4.3.zip",
        "2.4.4": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.4.4.zip",
        "2.4.5": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.4.5.zip",
        "2.4.6": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.4.6.zip",
        "2.4.7": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.4.7.zip",
        "2.4.8": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.4.8.zip",
        "2.4.9": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.4.9.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.5.0.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.6.0.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.7.0.zip",
        "2.7.1": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.7.1.zip",
        "2.7.2": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.7.2.zip",
        "2.7.3": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.7.3.zip",
        "2.7.4": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.2.7.4.zip",
        "3.0": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.3.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.3.0.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/silvasoft-boekhouden.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/silvasoft-boekhouden/assets/icon-128x128.jpg?rev=2801242",
        "2x": "https://ps.w.org/silvasoft-boekhouden/assets/icon-256x256.jpg?rev=2801242"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}