{
    "name": "SitePush",
    "slug": "sitepush",
    "version": "0.4.2",
    "author": "<a href=\"http://rowatt.com\">Mark Rowatt Anderson</a>",
    "author_profile": "https://profiles.wordpress.org/markauk/",
    "contributors": {
        "markauk": {
            "profile": "https://profiles.wordpress.org/markauk/",
            "avatar": "https://secure.gravatar.com/avatar/17cdb8eebca6512b9860302449378ca8?s=96&d=monsterid&r=g",
            "display_name": "Mark Rowatt Anderson"
        }
    },
    "requires": "3.3.1",
    "tested": "3.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 94,
    "ratings": {
        "5": 14,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 15,
    "support_url": "https://wordpress.org/support/plugin/sitepush/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 50,
    "downloaded": 9916,
    "last_updated": "2013-09-09 14:17:00",
    "added": "2012-07-05",
    "homepage": "http://rowatt.com/sitepush",
    "sections": {
        "description": "<p>SitePush is a WordPress plugin which allows you to have multiple versions of your WordPress site, so you can edit, develop, test without any risk to your main, live site. It&#8217;s great for developers, designers and editors&#8230; anyone who wants to be able to test changes to a site before it is visible to the world. For example:-</p>\n<ol>\n<li>you can <strong>easily move content between sites</strong>. For example, make extensive edits on a private staging site, and then push changes all at once to your live site. Or, easily pull copy of your live database into your development site so you are developing against the latest content.</li>\n<li><strong>test new themes and plugins</strong>, and only push them to your live site once they are configured and working as you want.</li>\n<li>upgrade WordPress, themes and plugins on a private site so you can <strong>test that nothing breaks before upgrading your live site</strong>. Sure you take backups before any upgrades (right?), but it&#8217;s a pain doing a full backup and an even bigger pain restoring from a backup.</li>\n<li>easily make small (and big!) code changes on your development site, <strong>test and easily push new code to a live site</strong>. Great for dealing with clients who want &#8220;just one more thing&#8221;.</li>\n</ol>\n<p>Although SitePush installation is a bit more involved than a typical plugin, once set up it runs with minimal effort and can be easily used by non-tech authors &amp; editors. Site admins can easily configure SitePush so that non-admins can only push content (i.e. posts/pages, comments and uploads) and to a restricted set of sites.</p>\n<p><strong>Please read the <em>Installation</em> instructions before you install SitePush &#8211; it&#8217;s not a normal download and activate type of plugin installation</strong></p>\n<h4>Support</h4>\n<p>SitePush is under active development and I will do my best to provide fixes to problems. The latest general releases are always available through the WordPress Plugins Directory. Development code is <a href=\"https://github.com/rowatt/sitepush/tree/develop\" rel=\"nofollow ugc\">hosted on GitHub</a>, so you may find more frequent releases there.</p>\n<p>For general questions, please post on the WordPress forums with the tag sitepush. For bug reports or if you wish to suggest patches or fixes, please go to the <a href=\"https://github.com/rowatt/sitepush\" rel=\"nofollow ugc\">SitePush GitHub repository</a>.</p>\n<p>If you have any problems with SitePush, it would be helpful if you could add</p>\n<pre><code>define('SITEPUSH_DEBUG',TRUE);\n</code></pre>\n<p>to your wp-config.php file, and include the output which will now be displayed at the top of the SitePush options screen.</p>\n<p><strong>Disclaimer</strong> Although SitePush has been well tested and is used on production web sites, it moves files and database content between sites which could break things. Use of SitePush is at your own risk! Please make sure you have adequate backups and if you do find any problems please report them.</p>\n<h4>Roadmap</h4>\n<p>There are a number of areas which could be improved. Currently on the roadmap:-</p>\n<ul>\n<li>improve push undo</li>\n<li>add support for pushing between sites on different servers</li>\n</ul>\n<p>Please let me know how you would like to see SitePush evolve.</p>\n<h3>Server Setup</h3>\n<h4>How to setup SitePush in a multiple vhost environment</h4>\n<p>You can run your separate versions of a site in a single vhost, or in separate vhosts. While running them all in a single vhost can be little easier to set up on some web hosts, it does not work well if different sites need any different configuration in your .htaccess file &#8211; for example if you are using a caching plugin.</p>\n<p>If you are able to set up separate vhosts (or subdomains as some hosts call them) I recommend you do it that way.</p>\n<p>Let&#8217;s say you want to have three versions of your site &#8211; live, test, and dev.</p>\n<p>Set up a vhost for each site. Where they all sit on your server will depend on your hosting setup, but let&#8217;s say they are at:-</p>\n<pre><code>/var/www/vhosts/live/httpdocs\n/var/www/vhosts/test/httpdocs\n/var/www/vhosts/dev/httpdocs\n</code></pre>\n<p>You will need to create a directory to hold all the config files. If at all possible, this directory should not be web accessible. For example, it might be at:-</p>\n<pre><code>/var/www/sitepush/config\n</code></pre>\n<p>You will also probably want to create a directory for any backups SitePush makes, such as:-</p>\n<pre><code>/var/www/sitepush/backups\n</code></pre>\n<p>Finally, you will need to create a database for each of your sites. Consult the <a href=\"https://codex.wordpress.org/Installing_WordPress\" rel=\"nofollow ugc\">WordPress installation instructions</a> and your web host for how to do this.</p>\n<p>Download WordPress and unzip it into one of your sites. I normally keep WordPress in its own subdirectory, for example:-</p>\n<pre><code>/var/www/vhosts/live/httpdocs/wordpress\n</code></pre>\n<p>That way, the root directory stays clean, and if I install anything else outside of WordPress, there won&#8217;t be any confusion of which files belong where. You need to make a couple of changes for this setup to work &#8211; see <a href=\"https://codex.wordpress.org/Giving_WordPress_Its_Own_Directory\" rel=\"nofollow ugc\">WordPress documentation</a> for more details. Note that for multisite installs, though, you will need to install WordPress in the root directory.</p>\n<p>I do, however, put my wp-config.php file in the root directory (WordPress is smart enough to find it).</p>\n<p>Next you will need to create the SitePush config files and put them in the config directory you created above. See <a href=\"https://wordpress.org/extend/plugins/sitepush/installation\" rel=\"ugc\">the SitePush installation instructions</a> for what needs to go in your sites config file and your database config file (I usually call them sites.ini.php and dbs.ini.php).</p>\n<p>Now, copy the files from the site you just set up to your other sites, for example:-</p>\n<pre><code>cd /var/www/vhosts\ncp -r live/httpdocs dev/httpdocs\n</code></pre>\n<p>To save a bit of disk space (at the expense of possibly messing things up between sites), you can also symlink the uploads directory between sites so there is only one copy of any media files uploaded. For example:-</p>\n<pre><code>cd /var/www/vhosts/dev/httpdocs/wordpress/wp-content\nrmdir uploads\nln -s ../../../../live/httpdocs/wordpress/wp-content/uploads uploads\n</code></pre>\n<p>The exact paths will depend on your setup.</p>\n<p>Finally, log into your live site, install, activate and configure SitePush, and now you are set up to easily move files and content between 3 versions of your site!</p>\n<h4>How to setup SitePush in a single vhost</h4>\n<p>You can run your separate versions of a site in a single vhost, or in separate vhosts. Depending on your web host, running them all in a single vhost can be bit easier to set up, though it does mean you need to share one .htaccess file across all versions of your site, and won&#8217;t work for WordPress Multisite setups.</p>\n<p>If you are able to set up separate vhosts (or subdomains as some hosts call them) I recommend you do it that way, but if not, these instructions show how you can have multiple version so of your site on one vhost.</p>\n<p>Let&#8217;s say you want to have three versions of your site &#8211; live, test, and dev.</p>\n<p>First make sure that you can set up domain aliases on your host &#8211; so that multiple domains point to the same files. For example, you might set up:-</p>\n<pre><code>live.example.com\ntest.example.com\ndev.example.com\n</code></pre>\n<p>If your host allows wildcard domain setups, so for example anything.example.com would point to your files, that would also work</p>\n<p>Set up a subdirectory for each site. Where they all sit on your server will depend on your hosting setup, but let&#8217;s say they are at:-</p>\n<pre><code>/var/www/httpdocs/live\n/var/www/httpdocs/test\n/var/www/httpdocs/dev\n</code></pre>\n<p>You will need to create a directory to hold all the config files. If at all possible, this directory should not be web accessible. For example, it might be at:-</p>\n<pre><code>/var/www/sitepush/config\n</code></pre>\n<p>You will also probably want to create a directory for any backups SitePush makes, such as:-</p>\n<pre><code>/var/www/sitepush/backups\n</code></pre>\n<p>Download WordPress and unzip it into one of the directories for your sites. For example:-</p>\n<pre><code>/var/www/httpdocs/live\n</code></pre>\n<p>Follow the <a href=\"https://codex.wordpress.org/Giving_WordPress_Its_Own_Directory\" rel=\"nofollow ugc\">instructions</a> for more installing WordPress in a subdirectory.</p>\n<p>You should also now create a database for each of your sites. Consult the <a href=\"https://codex.wordpress.org/Installing_WordPress\" rel=\"nofollow ugc\">WordPress installation instructions</a> and your web host for how to do this.</p>\n<p>Complete any other required configuration (WordPress setup, plugin installs etc) and make sure that your site is now working properly. Don&#8217;t forget to install SitePush!</p>\n<p>Next you need to create the SitePush config files and put them in the config directory you created above. See here readme.txt or <a href=\"https://wordpress.org/extend/plugins/sitepush/installation\" rel=\"ugc\">the SitePush installation instructions</a> for what needs to go in your sites config file and your database config file (I usually call them sites.ini.php and dbs.ini.php).</p>\n<p>Now, copy the files from the site you just set up to your other sites, for example:-</p>\n<pre><code>cd /var/www/httpdocs\ncp -r live dev\ncp -r live test\n</code></pre>\n<p>To save a bit of disk space (at the expense of possibly messing things up between sites), you can also symlink the uploads directory between sites so there is only one copy of any media files uploaded. For example:-</p>\n<pre><code>cd /var/www/httpdocs/dev/wp-content\nrmdir uploads\nln -s ../../live/wp-content/uploads uploads\n</code></pre>\n<p>The exact paths will depend on your setup.</p>\n<p>Next you need to make some changes to your wp-config.php file so that it will point to the correct site files and database depending on what domain name was used. The exact details will vary depending on your setup, but you will want something like this, which should be inserted immediately above the line <code>/* That's all, stop editing! Happy blogging. */</code>:-</p>\n<pre><code>switch ( $_SERVER['SERVER_NAME'] ) {\n    case 'test.example.com':\n        $site_dir='test';\n        define('DB_NAME', 'database_name_here');\n        define('DB_USER', 'username_here');\n        define('DB_PASSWORD', 'password_here');\n        break;\n\n    case 'dev.example.com':\n        define('DB_NAME', 'database_name_here');\n        define('DB_USER', 'username_here');\n        define('DB_PASSWORD', 'password_here');\n        $site_dir='dev';\n        break;\n\n    case 'www.example.com':\n    case 'live.example.com':\n    default:\n        define('DB_NAME', 'database_name_here');\n        define('DB_USER', 'username_here');\n        define('DB_PASSWORD', 'password_here');\n        $site_dir='live';\n        break;\n}\n</code></pre>\n<p>Insert whatever constant definitions are specific to a site in that section, and delete or comment them out from their original location in wp-config.</p>\n<p>Lastly, you need to edit the last line of wp-config so it reads:-</p>\n<pre><code>require(\"./{$site_dir}/wp-blog-header.php\");\n</code></pre>\n<p>You can now log into your live site, activate and configure SitePush. Once that is done, you can push everything to your other sites and you should now be able to access all three versions of your site. You are now set up to easily move files and content between 3 versions of your site!</p>\n",
        "installation": "<h4>Summary of installation steps</h4>\n<ol>\n<li>check that your setup meets the requirements in the section below</li>\n<li>set up different versions of your site on your server</li>\n<li>download and unzip the plugin in your plugins directory and activate the plugin</li>\n<li>create and upload the config files which hold details of your sites and databases. See <em>Config file</em> sections below for more details.</li>\n<li>go to the SitePush settings page (immediately below Dashboard), and fill in settings as required. There is further help and explanation in the plugin.</li>\n</ol>\n<p>Details for each step are covered in the sections below.</p>\n<h4>Requirements</h4>\n<p>SitePush uses shell commands to do some of its stuff, so there is more chance of things going wrong than with most plugins. Please check that your set up meets these requirements, and even if it does, please test your setup thoroughly before pushing to a live site.</p>\n<p>SitePush is currently well tested on:-</p>\n<ul>\n<li>Linux</li>\n<li>MacOS X (MAMP)</li>\n</ul>\n<p>SitePush should work on Windows systems, but with the following caveats:-</p>\n<ul>\n<li>backup of files will not work</li>\n<li>clearing of arbitrary cache files will not work (caches[] option in sites config)</li>\n<li>it is not as well tested on Windows systems</li>\n</ul>\n<p>If you would like to help make SitePush work better on Windows systems please let me know.</p>\n<p><strong>SitePush will not work in whole or in part</strong>:-</p>\n<ul>\n<li>if your host has PHP safe mode enabled</li>\n<li>if your host does not allow PHP to execute shell commands</li>\n<li>to push files between sites on different servers. Currently, SitePush must have filesystem access to all sites it pushes files to. Your databases can, however, be on different servers as long as they are accessible by the site your are pushing from.</li>\n</ul>\n<p>It has experimental support for Multisite installs:-<br />\n* it will not run if you have WP_ALLOW_MULTISITE or MULTISITE defined as TRUE in your wp-config file unless you also define SITEPUSH_ALLOW_MULTISITE to TRUE in your wp-config file.</p>\n<p>In addition to WordPress (3.3 or greater), PHP (5.2.4 or greater) and mySQL (5.0 or greater) your server must have the following installed:-</p>\n<ul>\n<li>mysql and mysqldump command line utilities (tested on mysql version 5.5, it should work on versions above 5.0)</li>\n<li>tar (any version should be fine, required for file backups)</li>\n</ul>\n<h4>Setup different versions of your site</h4>\n<p>Different versions of your site must be on the same server (filesystem). You can setup different versions either in separate vhosts (normally recommended) or all in one vhost (won&#8217;t work for multisite installs and may not work if you are using caching plugins).</p>\n<p>For full details of how to do this, see the instructions for each method in the <em>Server Setup</em> section.</p>\n<h4>Download and install SitePush plugin</h4>\n<p>Download and install SitePush on one version of your site as per normal.</p>\n<h4>Update wp-config.php</h4>\n<p>In most cases you will need to update the wp-config.php file for each site you are pushing to. Because you are likely running different versions of sites at different URLs, you need to tell WordPress to override the <code>WordPress Address</code> and <code>Site Address</code> options.</p>\n<p>To do this, add definitions for the <code>WP_HOME</code> and <code>WP_SITEURL</code> constants in your wp-config.php file. For more information about this please see the <a href=\"https://codex.wordpress.org/Editing_wp-config.php#WordPress_address_.28URL.29\" rel=\"nofollow ugc\">WordPress codex</a>.</p>\n<h4>Sites config file</h4>\n<p>In addition to configuring SitePush&#8217;s settings page, you will also need to create and some settings files as described in this and the following sections. If at all possible upload these files outside of your web root so they are not accessible from a web browser. If that is not possible, make sure the file names end in &#8216;.php&#8217; and that you include the first line from the sample files.</p>\n<p>The sites config file contains information about all the sites you wish to push/pull between. It looks like this:-</p>\n<pre><code>; &lt;?php die('Forbidden'); ?&gt; -*- conf -*-\n\n[all]\nwp_dir = /wp\nwp_content_dir = /wp/wp-content\ncache = no\ncaches[] = /caches/timthumb\ncaches[] = /caches/something_else\n\n[live]\nlabel = Live Site\ndomains[] = live.example.com\ndomains[] = live.example.co.uk\nweb_path = /var/www/vhosts/mysite-live\ndb = live\nlive = yes\n\n[dev]\nlabel = Dev Site\ndomain = dev.example.com\nweb_path = /var/www/vhosts/mysite-dev\ndb = dev\nlive = no\n</code></pre>\n<p>Each section represents parameters for a web site, with the exception of <em>[all]</em> &#8211; parameters in this section apply to all sites. Required parameters are as follows:-</p>\n<ul>\n<li><strong>[sitename]</strong> = a unique name for this site. It&#8217;s only used internally (or as label if you don&#8217;t supply the label parameter), and can be anything you like.</li>\n<li><strong>web_path</strong> = the full filesystem path to the web root for the site (not the root of the WordPress install if you have WordPress in a subdirectory).</li>\n<li><strong>domain</strong> = the domain this site is at. If the site uses more than one domain, use the domains[] parameter for each domain instead. Optional if domains[] parameters supplied.</li>\n<li><strong>domains[]</strong> (optional if domain parameter supplied) = if your site can be accessed via multiple domains (e.g. example.com, example.co.uk) then list each domain with the domains[] parameter. Make sure you include the <em>[]</em>.</li>\n<li><strong>db</strong> = the SitePush label of the database this site uses, as defined in your databases config file (see below).</li>\n</ul>\n<p>The following parameters are optional:-</p>\n<ul>\n<li><strong>label</strong> = label for your site used in menus, error messages etc. The label doesn&#8217;t have to be unique, but it will be rather confusing if it&#8217;s not.</li>\n<li><strong>wp_dir</strong> = the path from your webroot to this sites WordPress install.  You shouldn&#8217;t need to set this unless</li>\n<li><strong>wp_content_dir</strong> = the path from your webroot to the site&#8217;s wp-content directory. You shouldn&#8217;t need to set this.</li>\n<li><strong>wp_plugin_dir</strong>  = the path from your webroot to the site&#8217;s plugins directory. You shouldn&#8217;t need to set this.</li>\n<li><strong>live</strong> = is this a live/production site (<em>yes</em>), or not (<em>no</em>). SitePush will show some warnings when you select a live site to push to, can prevent users logging into live sites and can activate/deactivate specific plugins on live sites. Defaults to no.</li>\n<li><strong>default</strong> = if set to yes, SitePush will use settings for this site if it can&#8217;t figure out what config to use for a site. This should be set at most for one site. Defaults to no.</li>\n<li><strong>cache</strong> = is caching turned on for this site (yes or no). If you have set <em>WP_CACHE</em> to TRUE in your wp-config for this site, you should set this to yes. Defaults to no.</li>\n<li><strong>caches[]</strong> = if your site has any cache directories which should be cleared when you update the site, enter the full filesystem path to those directories here, and SitePush will empty those directories whenever you push if the <em>Clear cache on destination</em> option is set when you push.</li>\n<li><strong>admin_only</strong> = if only admins should be able to push to/pull from this site, then set to <em>yes</em>. Defaults to no.</li>\n<li><strong>source_only</strong> = if set to yes, non-admins will not be able to push to this site. Defaults to no.</li>\n<li><strong>destination_only</strong> = if set to yes, non-admins will not be able to push from this site. Defaults to no.</li>\n</ul>\n<p>Don&#8217;t include a trailing slash on any paths.</p>\n<h4>Databases config file</h4>\n<p>The databases config file contains information about your sites&#8217; databases.</p>\n<pre><code>; &lt;?php die('Forbidden'); ?&gt; -*- conf -*-\n; Do not remove the above line, it is all that prevents this file from being downloaded.\n\n[all]\nprefix = wp_\n\n[live]\nname = live_database\nuser = db_user\npw = live_db_password\n\n[dev]\nname = dev_database\nuser = db_user\npw = dev_db_password\n</code></pre>\n<p>Each section represents parameters for a WordPress database, with the exception of <em>[all]</em> &#8211; parameters in this section apply to all sites. Required parameters are as follows:-</p>\n<ul>\n<li><strong>[dblabel]</strong> = a unique label for this database. This label is used for the <em>db</em> parameter in the sites config file.</li>\n<li><strong>name</strong> = the name of the database (same as <em>DB_NAME</em> in wp-config).</li>\n<li><strong>user</strong> = the user name for accessing the database (same as <em>DB_USER</em> in wp-config).</li>\n<li><strong>pw</strong> = the database password (same as <em>DB_PASSWORD</em> in wp-config).</li>\n</ul>\n<p>The following parameters are optional:-</p>\n<ul>\n<li><strong>host</strong> = the database host. Defaults to DB_HOST.</li>\n</ul>\n<p><strong>NOTE</strong> All databases you are pushing to/from must use the same prefix.</p>\n<h4>Domain map config file</h4>\n<p>If you are running a Multisite installation, you will also need to create a domain map file so that SitePush knows which domains apply to which sites. The file should have as many sections as you have SitePush sites defined in your sites config file, and each section should contain one entry for each blog in your multisite setup. If your multisite installation is set up as a subdomain install, then you should list the full domains for each site, for example:-</p>\n<pre><code>; &lt;?php die('Forbidden'); ?&gt; -*- conf -*-\n; Do not remove the above line, it is all that prevents this file from being downloaded.\n\n[live]\n1 = site1.example.com\n2 = site2.example.com\n3 = site3.example.com\n\n[dev]\n1 = dev1.example.com\n2 = dev2.example.com\n3 = dev3.example.com\n</code></pre>\n<ul>\n<li><strong>[sitename]</strong> = the name you have given this site. It should be exactly the same as <em>[sitename]</em> in your sites config file.</li>\n<li><strong>blogid = domain</strong> = define the primary domain for each blogid in your network. If you are using a sub-directory set up, then the domain would be the same for each blog, but you still need to enter it for each one.</li>\n</ul>\n<p>If, on the other hand, your installation is set up as a subdirectory install, then the domains in each section will be the same, for example:-</p>\n<pre><code>; &lt;?php die('Forbidden'); ?&gt; -*- conf -*-\n; Do not remove the above line, it is all that prevents this file from being downloaded.\n\n[live]\n1 = live.example.com\n2 = live.example.com\n3 = live.example.com\n\n[dev]\n1 = dev.example.com\n2 = dev.example.com\n3 = dev.example.com\n</code></pre>\n<p>** do not include the subdirectory path for each site **</p>\n<p>If you do not configure this correctly, you will not be able to access blogs where you have pushed multisite tables (or if you pushed the whole database) and may have problems accessing individual blogs where you pushed options for that blog. If this does happen, you will need to manually edit the wp_blogs, wp_site, wp_sitemeta and options tables, or restore from a backup.</p>\n<h4>Other Important Notes for Multisite Setups</h4>\n<ol>\n<li>Support for Multisite is experimental and to enable it you will need to define SITEPUSH_ALLOW_MULTISITE as TRUE in wp-config. There may be some rough edges and note that SitePush has not been thoroughly tested on Multisite configurations, so make sure you have appropriate backups.</li>\n<li>SitePush settings for each blog are independent, so you will need to configure each blog separately. Each blog will probably need its own sites config file (as domains and/or subdirectories will be different for each blog), but can and should share a common database config file. The domain map config file should also be common amongst all sites.</li>\n<li>SitePush uses the term <em>site</em> to distinguish between different versions of a site &#8211; e.g. live, staging, development. A SitePush site is not the same as a Multisite site (which is actually a network of blogs). A standard Multisite setup normally only has one site but many blogs (so really it should be called a Multiblog setup&#8230;).</li>\n<li>If you have a large Multisite network, you should probably avoid pushing all tables&#8230; if it takes too long the script may time out and you may be left with an incomplete database.</li>\n<li>In Multisite setups, only Super Admins can administer SitePush.</li>\n</ol>\n",
        "faq": "\n<h4>Can I push between sites running different versions of WordPress?</h4>\n<p>\n<p>Pushing files between sites running different versions of WordPress should not be a problem.</p>\n<p>Pushing databases between sites running different versions of WordPress is not recommended. However, as long as there are no structural changes to the database which would cause backward compatibility problems, then it should work fine. The first time you go to wp-admin after a push, WordPress will probably tell you it needs to update the database.</p>\n</p>\n<h4>SitePush complains that it can&#8217;t find mysql/mysqldump/rsync</h4>\n<p>\n<p>Make sure you enter the complete absolute path to the actual file binary/executable, not just the directory it is in. For example:-</p>\n<ul>\n<li><code>C:/wamp/bin/mysql/mysql5.6.12/bin/mysql.exe</code></li>\n<li><code>/Applications/MAMP/Library/bin/mysql</code></li>\n<li><code>/usr/bin/mysql</code></li>\n</ul>\n<p>Note &#8211; these paths are just examples, they may be different on your system.</p>\n</p>\n<h4>Does SitePush have to be running on sites I push to?</h4>\n<p>\n<p>SitePush should normally be installed and running on all sites you are pushing to and from.</p>\n<p>SitePush can push files and database tables to a site even if that site is not running SitePush, however, some important aspects of SitePush require that it is running on sites you push to. If SitePush is not running on a site, the following will not work:-</p>\n<ul>\n<li>fix site urls</li>\n<li>preventing login to live sites</li>\n<li>clearing cache after a push</li>\n<li>activating/deactivating plugins</li>\n</ul>\n<p>If you don&#8217;t want SitePush to show in wp-admin for a particular site, define <code>SITEPUSH_HIDE</code> to true in the wp-config.php file for that site.</p>\n</p>\n<h4>SitePush isn&#8217;t updating my database after a push</h4>\n<p>\n<p>This is by design &#8211; SitePush avoids making any changes to the database unless absolutely necessary. Currently the only changes made are on multisite installs where the database needs to be updated to ensure each site has the correct URL.</p>\n<p>Note that the <em>Fix site URLs</em> option does not actually make any changes to the database &#8211; if activated it replaces incorrect URLs as they are output to the screen.</p>\n</p>\n<h4>Can I use SitePush to move my site to a new server, or to backup my installation?</h4>\n<p>\n<p>In theory you probably could, but it&#8217;s likely more effort than it&#8217;s worth &#8211; SitePush is designed to make it really easy to repeatedly move database and files between sites, not for a one off move or automated backup. If you are looking for a plugin to do this, you could use something like <a href=\"https://wordpress.org/extend/plugins/wordpress-move/\" rel=\"ugc\">WordPress Move</a> or <a href=\"https://wordpress.org/extend/plugins/wpremote/\" rel=\"ugc\">WP Remote</a> or <a href=\"https://wordpress.org/extend/plugins/backupwordpress/\" rel=\"ugc\">BackupWordPress</a>.</p>\n</p>\n<h4>How do I use SitePush on my Multisite installation</h4>\n<p>\n<p>Support for Multisite is experimental. You can enable it by defining SITEPUSH_ALLOW_MULTISITE as TRUE in wp-config. SitePush should work OK with Multisite setups, but there may be a few rough edges and it has not been thoroughly tested, so make sure you have appropriate backups.</p>\n</p>\n<h4>How do I push custom tables created by another plugin?</h4>\n<p>\n<p>You can add groups of custom tables to be pushed in the &#8220;Custom DB table groups&#8221; option on the main settings screen.</p>\n</p>\n<h4>SitePush times out before pushes complete</h4>\n<p>\n<p>By default, SitePush will run for up to 10 minutes to push. If your push is taking longer than that, you are either trying to push a very large database, a lot of large files or something is wrong. <a href=\"http://dev.mysql.com/doc/refman/5.5/en/mysqlcheck.html\" rel=\"nofollow ugc\">Repairing and optimizing your database</a> can help. Also, some web hosts have proxy servers with their own timeouts &#8211; if they time out in less than 10 minutes, there&#8217;s nothing SitePush can do to lengthen the timeout.</p>\n<p>If you do have problems with timeouts, you can also try pushing things separately.</p>\n</p>\n\n",
        "changelog": "<h4>0.4.2 (2013-09-09)</h4>\n<ul>\n<li>Allow pushing between two databases with same name if the databases are on different hosts. (props wethanet)</li>\n<li>Fix bug preventing push if database configs have different names from site configs.</li>\n<li>Add admin option to hide specific push options for all users. Useful for preventing accidental pushing of, say, comments tables if you never want them pushed.</li>\n<li>Add action hooks so you can run custom code before and after pushing. Note that these hooks only run from the site you are pushing from. See classes/class-sitepush-plugin.php for more info.</li>\n<li>Don&#8217;t allow SitePush to be added to the list of plugins to deactivate.</li>\n<li>Fix PHP Notice.</li>\n</ul>\n<h4>0.4.1 (2012-11-13)</h4>\n<ul>\n<li>Bugfixes relating to URL replacement when pushing multisite installs.</li>\n<li>Improvements to URL replacement, SitePush now replaces URLs in widgets, nav_menus and any URL passed through clean_url().</li>\n</ul>\n<h4>0.4 (2012-09-06)</h4>\n<ul>\n<li>SitePush no longer depends on rsync to push files. If you don&#8217;t have rsync on your server, SitePush will copy files using PHP.</li>\n<li>You can now define custom groups of database tables to push, allowing any custom tables created by plugins to be pushed without pushing the whole database.</li>\n<li>Added debug mode which lists information about your environment at the top of the options screen. Add define(&#8216;SITEPUSH_DEBUG&#8217;,TRUE); to your wp-config.php file to enable debug mode.</li>\n<li>Detect various problems with hosting setups and add more helpful error messages.</li>\n<li>Various bug fixes.</li>\n</ul>\n<h4>0.3 (2012-07-06)</h4>\n<ul>\n<li>Initial public alpha release.</li>\n</ul>\n"
    },
    "short_description": "Easily move content and code between WordPress sites. Pull your site&#039;s DB to a dev site, push new code to a staging site, etc.",
    "description": "<p>SitePush is a WordPress plugin which allows you to have multiple versions of your WordPress site, so you can edit, develop, test without any risk to your main, live site. It&#8217;s great for developers, designers and editors&#8230; anyone who wants to be able to test changes to a site before it is visible to the world. For example:-</p>\n<ol>\n<li>you can <strong>easily move content between sites</strong>. For example, make extensive edits on a private staging site, and then push changes all at once to your live site. Or, easily pull copy of your live database into your development site so you are developing against the latest content.</li>\n<li><strong>test new themes and plugins</strong>, and only push them to your live site once they are configured and working as you want.</li>\n<li>upgrade WordPress, themes and plugins on a private site so you can <strong>test that nothing breaks before upgrading your live site</strong>. Sure you take backups before any upgrades (right?), but it&#8217;s a pain doing a full backup and an even bigger pain restoring from a backup.</li>\n<li>easily make small (and big!) code changes on your development site, <strong>test and easily push new code to a live site</strong>. Great for dealing with clients who want &#8220;just one more thing&#8221;.</li>\n</ol>\n<p>Although SitePush installation is a bit more involved than a typical plugin, once set up it runs with minimal effort and can be easily used by non-tech authors &amp; editors. Site admins can easily configure SitePush so that non-admins can only push content (i.e. posts/pages, comments and uploads) and to a restricted set of sites.</p>\n<p><strong>Please read the <em>Installation</em> instructions before you install SitePush &#8211; it&#8217;s not a normal download and activate type of plugin installation</strong></p>\n<h4>Support</h4>\n<p>SitePush is under active development and I will do my best to provide fixes to problems. The latest general releases are always available through the WordPress Plugins Directory. Development code is <a href=\"https://github.com/rowatt/sitepush/tree/develop\" rel=\"nofollow ugc\">hosted on GitHub</a>, so you may find more frequent releases there.</p>\n<p>For general questions, please post on the WordPress forums with the tag sitepush. For bug reports or if you wish to suggest patches or fixes, please go to the <a href=\"https://github.com/rowatt/sitepush\" rel=\"nofollow ugc\">SitePush GitHub repository</a>.</p>\n<p>If you have any problems with SitePush, it would be helpful if you could add</p>\n<pre><code>define('SITEPUSH_DEBUG',TRUE);\n</code></pre>\n<p>to your wp-config.php file, and include the output which will now be displayed at the top of the SitePush options screen.</p>\n<p><strong>Disclaimer</strong> Although SitePush has been well tested and is used on production web sites, it moves files and database content between sites which could break things. Use of SitePush is at your own risk! Please make sure you have adequate backups and if you do find any problems please report them.</p>\n<h4>Roadmap</h4>\n<p>There are a number of areas which could be improved. Currently on the roadmap:-</p>\n<ul>\n<li>improve push undo</li>\n<li>add support for pushing between sites on different servers</li>\n</ul>\n<p>Please let me know how you would like to see SitePush evolve.</p>\n<h3>Server Setup</h3>\n<h4>How to setup SitePush in a multiple vhost environment</h4>\n<p>You can run your separate versions of a site in a single vhost, or in separate vhosts. While running them all in a single vhost can be little easier to set up on some web hosts, it does not work well if different sites need any different configuration in your .htaccess file &#8211; for example if you are using a caching plugin.</p>\n<p>If you are able to set up separate vhosts (or subdomains as some hosts call them) I recommend you do it that way.</p>\n<p>Let&#8217;s say you want to have three versions of your site &#8211; live, test, and dev.</p>\n<p>Set up a vhost for each site. Where they all sit on your server will depend on your hosting setup, but let&#8217;s say they are at:-</p>\n<pre><code>/var/www/vhosts/live/httpdocs\n/var/www/vhosts/test/httpdocs\n/var/www/vhosts/dev/httpdocs\n</code></pre>\n<p>You will need to create a directory to hold all the config files. If at all possible, this directory should not be web accessible. For example, it might be at:-</p>\n<pre><code>/var/www/sitepush/config\n</code></pre>\n<p>You will also probably want to create a directory for any backups SitePush makes, such as:-</p>\n<pre><code>/var/www/sitepush/backups\n</code></pre>\n<p>Finally, you will need to create a database for each of your sites. Consult the <a href=\"https://codex.wordpress.org/Installing_WordPress\" rel=\"nofollow ugc\">WordPress installation instructions</a> and your web host for how to do this.</p>\n<p>Download WordPress and unzip it into one of your sites. I normally keep WordPress in its own subdirectory, for example:-</p>\n<pre><code>/var/www/vhosts/live/httpdocs/wordpress\n</code></pre>\n<p>That way, the root directory stays clean, and if I install anything else outside of WordPress, there won&#8217;t be any confusion of which files belong where. You need to make a couple of changes for this setup to work &#8211; see <a href=\"https://codex.wordpress.org/Giving_WordPress_Its_Own_Directory\" rel=\"nofollow ugc\">WordPress documentation</a> for more details. Note that for multisite installs, though, you will need to install WordPress in the root directory.</p>\n<p>I do, however, put my wp-config.php file in the root directory (WordPress is smart enough to find it).</p>\n<p>Next you will need to create the SitePush config files and put them in the config directory you created above. See <a href=\"https://wordpress.org/extend/plugins/sitepush/installation\" rel=\"ugc\">the SitePush installation instructions</a> for what needs to go in your sites config file and your database config file (I usually call them sites.ini.php and dbs.ini.php).</p>\n<p>Now, copy the files from the site you just set up to your other sites, for example:-</p>\n<pre><code>cd /var/www/vhosts\ncp -r live/httpdocs dev/httpdocs\n</code></pre>\n<p>To save a bit of disk space (at the expense of possibly messing things up between sites), you can also symlink the uploads directory between sites so there is only one copy of any media files uploaded. For example:-</p>\n<pre><code>cd /var/www/vhosts/dev/httpdocs/wordpress/wp-content\nrmdir uploads\nln -s ../../../../live/httpdocs/wordpress/wp-content/uploads uploads\n</code></pre>\n<p>The exact paths will depend on your setup.</p>\n<p>Finally, log into your live site, install, activate and configure SitePush, and now you are set up to easily move files and content between 3 versions of your site!</p>\n<h4>How to setup SitePush in a single vhost</h4>\n<p>You can run your separate versions of a site in a single vhost, or in separate vhosts. Depending on your web host, running them all in a single vhost can be bit easier to set up, though it does mean you need to share one .htaccess file across all versions of your site, and won&#8217;t work for WordPress Multisite setups.</p>\n<p>If you are able to set up separate vhosts (or subdomains as some hosts call them) I recommend you do it that way, but if not, these instructions show how you can have multiple version so of your site on one vhost.</p>\n<p>Let&#8217;s say you want to have three versions of your site &#8211; live, test, and dev.</p>\n<p>First make sure that you can set up domain aliases on your host &#8211; so that multiple domains point to the same files. For example, you might set up:-</p>\n<pre><code>live.example.com\ntest.example.com\ndev.example.com\n</code></pre>\n<p>If your host allows wildcard domain setups, so for example anything.example.com would point to your files, that would also work</p>\n<p>Set up a subdirectory for each site. Where they all sit on your server will depend on your hosting setup, but let&#8217;s say they are at:-</p>\n<pre><code>/var/www/httpdocs/live\n/var/www/httpdocs/test\n/var/www/httpdocs/dev\n</code></pre>\n<p>You will need to create a directory to hold all the config files. If at all possible, this directory should not be web accessible. For example, it might be at:-</p>\n<pre><code>/var/www/sitepush/config\n</code></pre>\n<p>You will also probably want to create a directory for any backups SitePush makes, such as:-</p>\n<pre><code>/var/www/sitepush/backups\n</code></pre>\n<p>Download WordPress and unzip it into one of the directories for your sites. For example:-</p>\n<pre><code>/var/www/httpdocs/live\n</code></pre>\n<p>Follow the <a href=\"https://codex.wordpress.org/Giving_WordPress_Its_Own_Directory\" rel=\"nofollow ugc\">instructions</a> for more installing WordPress in a subdirectory.</p>\n<p>You should also now create a database for each of your sites. Consult the <a href=\"https://codex.wordpress.org/Installing_WordPress\" rel=\"nofollow ugc\">WordPress installation instructions</a> and your web host for how to do this.</p>\n<p>Complete any other required configuration (WordPress setup, plugin installs etc) and make sure that your site is now working properly. Don&#8217;t forget to install SitePush!</p>\n<p>Next you need to create the SitePush config files and put them in the config directory you created above. See here readme.txt or <a href=\"https://wordpress.org/extend/plugins/sitepush/installation\" rel=\"ugc\">the SitePush installation instructions</a> for what needs to go in your sites config file and your database config file (I usually call them sites.ini.php and dbs.ini.php).</p>\n<p>Now, copy the files from the site you just set up to your other sites, for example:-</p>\n<pre><code>cd /var/www/httpdocs\ncp -r live dev\ncp -r live test\n</code></pre>\n<p>To save a bit of disk space (at the expense of possibly messing things up between sites), you can also symlink the uploads directory between sites so there is only one copy of any media files uploaded. For example:-</p>\n<pre><code>cd /var/www/httpdocs/dev/wp-content\nrmdir uploads\nln -s ../../live/wp-content/uploads uploads\n</code></pre>\n<p>The exact paths will depend on your setup.</p>\n<p>Next you need to make some changes to your wp-config.php file so that it will point to the correct site files and database depending on what domain name was used. The exact details will vary depending on your setup, but you will want something like this, which should be inserted immediately above the line <code>/* That's all, stop editing! Happy blogging. */</code>:-</p>\n<pre><code>switch ( $_SERVER['SERVER_NAME'] ) {\n    case 'test.example.com':\n        $site_dir='test';\n        define('DB_NAME', 'database_name_here');\n        define('DB_USER', 'username_here');\n        define('DB_PASSWORD', 'password_here');\n        break;\n\n    case 'dev.example.com':\n        define('DB_NAME', 'database_name_here');\n        define('DB_USER', 'username_here');\n        define('DB_PASSWORD', 'password_here');\n        $site_dir='dev';\n        break;\n\n    case 'www.example.com':\n    case 'live.example.com':\n    default:\n        define('DB_NAME', 'database_name_here');\n        define('DB_USER', 'username_here');\n        define('DB_PASSWORD', 'password_here');\n        $site_dir='live';\n        break;\n}\n</code></pre>\n<p>Insert whatever constant definitions are specific to a site in that section, and delete or comment them out from their original location in wp-config.</p>\n<p>Lastly, you need to edit the last line of wp-config so it reads:-</p>\n<pre><code>require(\"./{$site_dir}/wp-blog-header.php\");\n</code></pre>\n<p>You can now log into your live site, activate and configure SitePush. Once that is done, you can push everything to your other sites and you should now be able to access all three versions of your site. You are now set up to easily move files and content between 3 versions of your site!</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/sitepush.0.4.2.zip",
    "upgrade_notice": {
        "0.4.2": "<p>Add option to allow hiding of push options, add action hooks for developers, bugfixes and documentation updates.</p>",
        "0.4.1": "<p>Bugfixes and improvements to URL replacement.</p>",
        "0.4": "<p>SitePush no longer depends on rsync to push files, and allows you to define custom groups of DB tables to push. Many bugfixes and improved error reporting.</p>",
        "0.3": "<p>Initial public alpha release.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/sitepush/trunk/screenshot-1.png?rev=1566983",
            "caption": "Push screen for non-admins. Site admin can configure what non-admins can push, so they can't push anything too dangerous."
        },
        {
            "src": "https://ps.w.org/sitepush/trunk/screenshot-2.png?rev=1566983",
            "caption": "Push screen as seen by admins. Admins can push any set of files or DB tables."
        },
        {
            "src": "https://ps.w.org/sitepush/trunk/screenshot-3.png?rev=1566983",
            "caption": "Push screen for a multisite installation as seen by admins. In this case, the admin has defined some custom table groups for Gravity Forms."
        },
        {
            "src": "https://ps.w.org/sitepush/trunk/screenshot-4.png?rev=1566983",
            "caption": "Main options screen."
        }
    ],
    "tags": {
        "deployment": "deployment",
        "development": "development",
        "migrate": "migrate",
        "migration": "migration",
        "move": "move"
    },
    "stable_tag": "0.4.2",
    "versions": {
        "0.3": "https://downloads.wordpress.org/plugin/sitepush.0.3.zip",
        "0.4": "https://downloads.wordpress.org/plugin/sitepush.0.4.zip",
        "0.4.1": "https://downloads.wordpress.org/plugin/sitepush.0.4.1.zip",
        "0.4.2": "https://downloads.wordpress.org/plugin/sitepush.0.4.2.zip",
        "trunk": "https://downloads.wordpress.org/plugin/sitepush.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/sitepush.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 94,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}