{
    "name": "Slider Hero with Animation, Video Background",
    "slug": "slider-hero",
    "version": "8.8.5",
    "author": "<a href=\"https://www.quantumcloud.com/products/slider-hero/\">Slider Hero</a>",
    "author_profile": "https://profiles.wordpress.org/quantumcloud/",
    "contributors": {
        "quantumcloud": {
            "profile": "https://profiles.wordpress.org/quantumcloud/",
            "avatar": "https://secure.gravatar.com/avatar/97d6007ecaef11f5d151452d87e5c479?s=96&d=monsterid&r=g",
            "display_name": "QuantumCloud"
        }
    },
    "requires": "4.6",
    "tested": "6.6.1",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 96,
    "ratings": {
        "5": 31,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 33,
    "support_url": "https://wordpress.org/support/plugin/slider-hero/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 4000,
    "downloaded": 189911,
    "last_updated": "2024-08-19 1:11pm GMT",
    "added": "2017-04-13",
    "homepage": "https://wordpress.org/plugins/slider-hero",
    "sections": {
        "description": "<p>Slider Hero is a futuristic, responsive header Hero Slider plugin and <strong>Dyanmic Website Intro Advert</strong> maker with Youtube Video background and animated background effects for hero banners, hero sliders and Landing pages. Create awesome <strong>animation slider</strong> and animated header with text carousel and Call to Action buttons from Gutenberg Slider Block &amp; Elementor Slider Widget. Use youtube video background or combine animation effect and youtube video.</p>\n<blockquote>\n<p>🚀 <a href=\"https://www.quantumcloud.com/resources/free-support/\" rel=\"nofollow ugc\">Support, Bug Report, Feature Requests</a> | <a href=\"https://dev2.testversions.com/sliderhero/\" rel=\"nofollow ugc\">Slider Hero</a> Live Demo | <strong>Upgrade to <a href=\"https://www.quantumcloud.com/products/slider-hero/\" rel=\"nofollow ugc\">Slider Hero Pro!</a></strong></p>\n</blockquote>\n<p>Slider Hero also includes a <strong>Gutenberg Slider</strong> block and an <strong>Elementor Slider</strong> widget. Use the Elementor Slider Widget or the Gutenberg Slider block to quickly embed Slider Hero anywhere on your page.</p>\n<p>Slider Hero is not just your typical responsive image slider plugin for wordpress. This plugin is one of a kind and is based on a unqiue concept that uses incredible CSS3 and JavaScript background animation slider effects not available anywhere else. It is a <strong>super fun and simple</strong> slider plugin to use and <strong>very quick</strong> to create elegant, unique animation sliders with animated background effects within a matter of minutes. Not only that, this plugin also supports Youtube background video and Background Image Sliders!</p>\n<p>** The free version works in the same way as the pro version just with less number of effects &amp; features. The pro version also supports video sliders like Youtube Video Slider, Vimeo Video Slider or Custom Video Sliders. Video Sliders are not yet available in the free version.</p>\n<blockquote>\n<p>Check the <a href=\"http://www.slider-hero.com/intro/\" rel=\"nofollow ugc\">Hero Introduction</a><br />\n  Dare to See <a href=\"http://www.slider-hero.com/matrix-intro/\" rel=\"nofollow ugc\">How Deep the Rabbit Hole Goes?</a></p>\n<p>Check out the Live Previews of the <a href=\"https://www.slider-hero.com/\" rel=\"nofollow ugc\">Slider Hero</a><br />\n  Upgrade now to <a href=\"https://www.quantumcloud.com/products/slider-hero/\" rel=\"nofollow ugc\">Slider Hero Pro</a></p>\n</blockquote>\n<h4>Create Modern Slider Carousels Easily</h4>\n<p>Check this tutorial to see how fast, intuitive and easy it is to use this wordpress slider plugin to create slider carousels and text carousels.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/KfH2KRpbObQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<blockquote>\n<p>Looking for an Elegent Portfolio plugin? Try our <a href=\"https://wordpress.org/plugins/portfolio-x/\" rel=\"ugc\">Portfolio X</a>!</p>\n</blockquote>\n<h4>Create Stunning Product Intro Adverts</h4>\n<p>Make unique product intros and adverts with like a pro without any additional editing tool. The intro creation process is extremely easy and insanely quick and FUN. Now introduce your products and services with a dramatic flair!</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/k9CFs-hiBUk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<blockquote>\n<p>//-&gt; Try our <strong><a href=\"https://wordpress.org/plugins/chatbot/\" rel=\"ugc\">FREE ChatBot for WordPress with AI &#8211; WPBot</a></strong>. It is an easy to use, Native, No coding required, AI ChatBot to provide Automated Live Chat Support. Use ChatBot to <strong>answer user questions</strong> and also <strong>collect information</strong> from the users using <strong>conversational forms</strong>. It can be also be powered by DialogFlow, Tavily or OpenAI ChatGPT or simply use the built-in features to provide Live support and collect user data. ++ Check out <a href=\"https://www.wpbot.pro/\" rel=\"nofollow ugc\">ChatBot for WordPress</a> Demo.</p>\n</blockquote>\n<h4>Why Use Slider Hero Rather than Other WordPress Slider Plugin?</h4>\n<p>Traditional Image Sliders are bad for user conversions and they cause <strong>banner blindness</strong>. They are boring and do not engage users. Eye tracking studies conducted by Neilson Norman Group found that as soon as visitors perceived something to be an advertisement they turned their focus away from it. Image sliders divide your user’s attention. Images on slides represent different products or offers in the span of a few seconds. Your website user has hardly read a single thing when whoosh&#8230;the image changes and they have to refocus their attention.</p>\n<p>Our slider plugin is different. It <strong>focuses on your core messages/</strong><strong>, uses a background animation of your choice to keep the user </strong><strong>interested and focused</strong>. The unique Call to Action button leads the users where they really need to be. The effects are almost like subtle Cinemagraph animations when used in onjunction with your images or text carousels. Think of it as a perfect alternative to background videos.</p>\n<h4>More than a Slider Plugin &#8211; Use Motion Typography to Build Amazing Product Intros</h4>\n<p>The other unique feature of Slider Hero is the Intro Advert builder. Introduce your products and services with a <strong>dramatic flair</strong>. The typographic intro builder allows you to do something very unique. You can create stunning product introductions like stunning “Apple – iPhone 7 and iPhone 7 Plus in 107 seconds” or “Introducing Pixel, Phone by Google” with chained text animation combining background audio of your choice.</p>\n<p>Build a combination of beautiful text animation along with the background animation. This can be applied in company  introductions, creative projects, for your product or service launch etc. You can easily change the color of the text, animation type and more! The intro builder interface is simple and intuitive.</p>\n<blockquote>\n<p>Upgrade to the <a href=\"https://www.quantumcloud.com/products/slider-hero/\" rel=\"nofollow ugc\">Professional Version</a></p>\n</blockquote>\n<h4>Slider Hero Benefits</h4>\n<p>This is the best wordpress header slider plugin with text overlay and cinematic background animation effects. This plugin is best used as Intro, Landing Page Slider or Home Page Slider. It can be used as a fullscreen slider plugin besides the full width or custom width modes. Create a memorable EXPERIENCE for your wordpress coming soon, splash page, home page or landing page that will impress your site visitors with a memorable first impression.</p>\n<p>You can use the Elementor Slider widget or Gutenberg Slider block to create HTML5 animated banners,<strong> HERO Banner</strong>, hero carousel with text and image, HERO text carousel, responsive header image slider, or simple image carousel. The pro version supports Parallax Effect and Ken Burns Effect.</p>\n<p>Marketers prefer Hero image or <strong>Hero sliders</strong> for homepage and landing pages because traditional image sliders do not convert customers as much as an animated bannere which typically occupies the most prime real estate of your website. This plugin provides a middle ground. It allows you to set a background Hero Image and/or select a GREAT javascript background animation effect and apply Title, Description and Buttons etc. as slides or carousel. <strong>Instant awesomeness</strong>.</p>\n<p>There are quite a few great WordPress slider plugins available but they take a lot of efforts and expertise to produce awesome effects you see in their demos. With our plugin, you can make amazing looking Homepage or <strong>Landing Page Hero Sliders</strong> or animated header with cinematic effects easily and quickly like no others.</p>\n<h4>Slider Hero Use Cases</h4>\n<p>This slider plugin provides all the <strong>quality of the premium and popular WordPress Slider plugins</strong> without the headechs and complications. Select an animation effect like slider Particle Effect, Snow effect, Nasa or Space effect, Bubble effect or Nyan Cat effect, add a background image or choose from a collection of gradients, add title, description, and button (optional) and you are good to go. There is no dragging and dropping or awkward animation timings to get right – this plugin does everything for you. You can use it as an alternative to background video.</p>\n<p><strong>Finally a Hero to rescue your websites</strong> from boring image sliders that nobody scrolls through.</p>\n<p>You can also use Slider Hero as Background Image Slides with or without text carousel and effects. Available Transition Effects are: Fade in/Out, (Slide Left, Slide Right, Slide from Top and Slide from Bottom available in Pro version)</p>\n<p>Slider Hero comes with embedded video support! Create a text carousel with <strong>Youtube Video Background</strong>. Pro version supports uploading your own files or use <strong>Vimeo</strong>, Loop, Mute, and Set a color overlay with opacity! Video background can be combined with most special effects to create something truly unique and amazing.</p>\n<p><strong>Using Video Background with Slider Hero</strong><br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/NL88kFnAD9s?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>This slider plugin is perfect to use on your Landing page, Home page, Coming Soon page, 404 Error Page or Splash page and create a permanent, unique impression on your website users.</p>\n<h4>All Slider Hero Features</h4>\n<p><strong>Unique, Cinematic Intro Advert Builder</strong></p>\n<ul>\n<li>Create Unlimited Cinematic Intro Advert Easily which was never possible before</li>\n<li>Simple, Effective and Intuitive Interface</li>\n<li>Define text, Font color, Letter Spacing, Font Weight</li>\n<li>Select from 800+ Google Fonts [PRO FEATURE]</li>\n<li>Live Font Preview [PRO FEATURE]</li>\n<li>Flexible Intro Builder with Dynamic Slide delay, Text Animation Type (50+ effects)</li>\n<li>Upload Image as Slide Background or Select a Color</li>\n<li>Redirect to New Page After Intro Ends with Custom Delay [PRO FEATURE]</li>\n<li>Load Regular Slider with Call to Action Buttons After Intro Ends with Custom Delay [PRO FEATURE]</li>\n<li>11 Background Animation to Choose from (more coming soon) [PRO FEATURE]</li>\n</ul>\n<p><strong>Modern Sliders and Text Carousels with Special Background Effects</strong></p>\n<ul>\n<li>Create Unlimited Modern Sliders and Text Carousels with Stunning, Never Before Seen Background Animations</li>\n<li>Choose from <strong>8 (80+ in PRO)</strong> Wonderfully Refreshing and Unique Background Animation Effects</li>\n<li>Switch Between Effects Instantly [PRO FEATURE]</li>\n<li>Reposition Title, Description and Buttons Easily</li>\n<li>800+ Google Fonts with Live Font Preview [PRO FEATURE]</li>\n<li>Choose from 173 Professionally Created Gradient or Upload an Image as Background</li>\n<li>Parallax Effect Support for Background Image [PRO FEATURE]</li>\n<li>Ken Burns Effect for Background Image [PRO FEATURE]</li>\n</ul>\n<p><strong>Slider with Video Background</strong></p>\n<ul>\n<li>Embed a Video as Background with Your Slider</li>\n<li>Use Youtube Video background</li>\n<li>Use Vimeo Video Background  [PRO FEATURE]</li>\n<li>Upload Your Own Video (mp4 and webm)  [PRO FEATURE]</li>\n<li>Loop and Repeat Option  [PRO FEATURE]</li>\n<li>Mute Sound Option. [PRO FEATURE]</li>\n<li>Color Overlay  [PRO FEATURE]</li>\n<li>Choose Overlay Color and Opacity [PRO FEATURE]</li>\n<li>Hide ‘watch later’, ‘share’ and channel ‘subscribe’ and Video suggestion from youtube videos</li>\n</ul>\n<p><strong>Video Slider </strong><br />\n* Youtube Video Slider<br />\n* Upload Your Own Video (mp4 and webm) and create Custom Video Slider<br />\n* Vimeo Video Slider<br />\n* Add Text to Slide on Top of Videos [PRO FEATURE]<br />\n* Hide ‘watch later’, ‘share’ and channel ‘subscribe’ and Video suggestion from youtube videos [PRO FEATURE]</p>\n<p><strong>Call to Action Buttons</strong></p>\n<ul>\n<li>Add One or Two [PRO FEATURE] Call to Action Buttons with Each Slide</li>\n<li>Square or Rounded Shape</li>\n<li>With or Without Borders</li>\n<li>Choose from 10 Custom Button Animations. [PRO FEATURE]</li>\n<li>Customize Button Fonts with Colors, Letter Spacing and More</li>\n</ul>\n<p><strong>Text Animation</strong></p>\n<ul>\n<li>Standard Animate CSS Text In and Out Effects</li>\n<li>Letter FX Effects to Animate Your Letters [PRO FEATURE]</li>\n<li>Combine Animate CSS and Letter FX for Unique Text Effects of Your Own [PRO FEATURE]</li>\n<li>20 Custom, Exotic Text Animation Effects for Title and Descriptions [PRO FEATURE]</li>\n</ul>\n<p><strong>Audio Support</strong></p>\n<ul>\n<li>Add Background Music to Match the Tone of Your Intro Adverts and Sliders. [PRO FEATURE]</li>\n<li>Choose The Audio Controller Position [PRO FEATURE]</li>\n<li>Users Can Turn Sound On and Off [PRO FEATURE]</li>\n<li>Select if Audio Should Loop Indefinitely or Stop After Repeating a Few Times [PRO FEATURE]</li>\n</ul>\n<p><strong>Unique Slider Decoration</strong></p>\n<ul>\n<li>Add Unique Decoration for Top and Bottom Parts of Your Sliders [PRO FEATURE]</li>\n<li>Choose from Slope, Rounded, Triangle, Arrow, Cloud or Half Circle Patterns [PRO FEATURE]</li>\n<li>Stand Out from the Crowd</li>\n</ul>\n<p><strong>Background Image Carousel</strong></p>\n<ul>\n<li>Use as Background Image Carousel with or without text carousel and effects.</li>\n<li>Available Transition Effects: Fade in/Out, Slide Left, Slide Right, Slide from Top and Slide from Bottom</li>\n<li>Parallax Effect Support for Background Image [PRO FEATURE]</li>\n<li>Ken Burns Effect for Background Image [PRO FEATURE]</li>\n</ul>\n<p><strong>General Options</strong></p>\n<ul>\n<li>Hero Slider, Carousel and Standard Features</li>\n<li>Fully Responsive</li>\n<li>Unlimited Sliders on a Page</li>\n<li>Drag &amp; Drop Slide Position</li>\n<li>Unpublish Slide/s</li>\n<li>Quick and Easy Building WITHOUT Any Layer or Timeline</li>\n<li>Copy and Duplicate  [PRO FEATURE]</li>\n<li>Auto Slide On or Off</li>\n<li>Repeat On or Off [PRO FEATURE]</li>\n<li>Random Slide</li>\n<li>Background Animation Canvas Opacity [PRO FEATURE]</li>\n<li>Preview Your Sliders While Creating and Save Time</li>\n</ul>\n<p><strong>Slider Navigation and Controls</strong></p>\n<ul>\n<li>Arrow Navigation with Custom  [PRO FEATURE] Colored Arrow Icons</li>\n<li>Special Floating Navigation Arrows [PRO FEATURE]</li>\n<li>Dot Navigation [PRO FEATURE]</li>\n<li>Pause and ResStart Slider [PRO FEATURE]</li>\n</ul>\n<p><strong>Preloader</strong></p>\n<ul>\n<li>Turn Preloader on or Off [PRO FEATURE]</li>\n<li>Upload Your Own Preloader Image or Animated Gif [PRO FEATURE]</li>\n</ul>\n<p><strong>Import Export Slider</strong></p>\n<ul>\n<li>Export and Import in Another Website Easily [PRO FEATURE]</li>\n<li>Export/Import Your Carefully Crafted Intro or Adverts [PRO FEATURE]</li>\n</ul>\n<p><strong>Full Width and Full Screen Slider</strong></p>\n<ul>\n<li>Slider Hero Supports Full Width Slider Layout </li>\n<li>Stretch Full Screen and Full Height</li>\n</ul>\n<h4>Available Background Animation Effects in the Pro Version</h4>\n<p>Intro Effect, Stripe Connect Effect, Clear Sky Effect, Water Ripple Effect, Aeronautics Effect, Antigravity Flow, Balls Gravity Effect, Bird Flying Effect, Blob Effect, Blade Effect, Blur Effect, Bubble, Campfire, Circle Intersection, Cloudy Sky Effect, Confetti Effect, Cosmic Web, Colorful Particle, Cursor And Paint,  Day Night Effect, Division Effect, Directional Force, Distance, Electric Clock, Firework, Fizzy Sparks, Float and Rain, Floating Leafs, Flowing Circle Effect, Flying Rocket Effect, Grid Effect, Helix Corruption, Helix Chaos, Helix Multiple, Glitch, Iconsahedron Effect, Intersecting Line Effect, Just Cloud, Link Particle, Liquid Landscape, Matrix Effect, Metaballs, Microcosm Effect, Moving Color, Wave, NASA, Neno, Hexagon, Noise Effect, Nyan Cat, Orbital Effect, Particle Effect, Particle Helix, Particle System, Hacker, Physics Bug, Racing Particles, Rain Effect, Rainy Season, Rays and Particles, Play or Work? Rain Of Line, Rising and falling cubes, Shape Animation, Space Elevator, Christmas Snow Effect, Squidematics, Stars Effect, Stellar Cloud, Subvisual, Tag Canvas, The Great Attractor, Thibaut, Tiny Galaxy Effect, Torus of Cubes, Water Effect, Wave Effect, Wave Animation Effect, Waaave Canvas, Walking Background, Star Trek Warp Speed, Water Swimming, Waving Cloth, Water Droplet, Wormhole Effect, Word Cloud, Valentine Effect, Ygekpg Effect</p>\n<blockquote>\n<p>Upgrade to <a href=\"https://www.quantumcloud.com/products/slider-hero/\" rel=\"nofollow ugc\">Professional Version</a><br />\n  Pro Version Documentation <a href=\"https://www.quantumcloud.com/documentations/slider-hero/\" rel=\"nofollow ugc\">Documentation</a></p>\n</blockquote>\n<h4>Getting Started</h4>\n<p>Step 1: Select a Slider effect<br />\nStep 2: Add title and text to your first slide. Unlimited slides supported<br />\nStep 3: Paste shortcode in your homepage or landing page or any page!</p>\n<p>You are ready with an awesome, animated Hero Slider or Hero Banner!</p>\n<h4>CUSTOMER SUPPORT</h4>\n<p>All technical stuffs could be tough for your busy schedule. But you don’t need to go at it alone. QuantumCloud&#8217;s quick and friendly customer support team is made up of top notch, friendly people &#8211; working hard to ensure you get the help you need, when you need it. We have built in Support area in the slider plugin. Just shoot us a mail with your questions or feedback and we will get right back to you.</p>\n<h4>Leave a Rating for this Slider Plugin</h4>\n<p><strong>If you like our effort</strong> and would like to support us or if you just thought that this plugin was somewhat helpful, please leave a <strong>5 star rating</strong> and a short blurb on what you like the most about it. It means the world to us and motivates our developers to keep adding kool, new, premium features to this awesome plugin.</p>\n<p><strong>If you face any problem, or want more features in this Plugin </strong><strong>please leave a comment</strong>, instead of review. We take all customer feedback extremely seriously.</p>\n<h3>Use</h3>\n<ol>\n<li>After activating the slider plugin, create a new page or post. In the body section copy paste the Hero shortcode </li>\n<li>Save the page/post and check the page in front end.</li>\n</ol>\n",
        "installation": "<ol>\n<li>Download the slider plugin zip file. Extract and upload the folder in your wp-content/plugins folder.</li>\n<li>From the wp-admin panel go to plugins and activate &#8220;Slider Hero&#8221;</li>\n<li>Create a new page and paste the plugin Short Code. </li>\n<li>You are ready to wow your site visitors.</li>\n</ol>\n",
        "faq": "\n<dt id='how%20do%20i%20remove%20%E2%80%98watch%20later%E2%80%99%2C%20%E2%80%98share%E2%80%99%20and%20channel%20%E2%80%98subscribe%E2%80%99%20buttons'>\nHow do I remove ‘watch later’, ‘share’ and channel ‘subscribe’ buttons\n</h4>\n<p>\n<p>Unfortunately, since September 2018 there is no option to hide Watch Later, Share and Video Title within embedded YouTube iframe. Simply, YouTube does not allow anymore ‘clean’ embed without those components.</p>\n<p>However, the <a href=\"https://www.quantumcloud.com/products/slider-hero\" rel=\"nofollow ugc\">Slider Hero Pro</a> version supports an overlay technique to mitigate these.</p>\n</p>\n<dt id='does%20slider%20hero%20support%20youtube%20background%20video%20auto%20play%3F'>\nDoes Slider Hero Support Youtube Background Video Auto Play?\n</h4>\n<p>\n<p>Video will auto play if it does not have sound. You can turn off the sound setting from the Video settings. If video has sound then it depends on the browser policy and the user&#8217;s history with your website. Please check this article from Google for more details:<br />\nhttps://developers.google.com/web/updates/2017/09/autoplay-policy-changes</p>\n</p>\n<dt id='why%20the%20background%20image%20does%20not%20show%20with%20some%20slider%20effects'>\nWhy the background image does not show with some slider effects\n</h4>\n<p>\n<p>Some effects simply does not support background image because background image will look extremely odd with those selected effects. That is why your background image is not showing up with those few selected effects.</p>\n</p>\n<dt id='can%20you%20add%20more%20effects%20to%20choose%20from%3F'>\nCan you add more effects to choose from?\n</h4>\n<p>\n<p>A professional version of the plugin is available with 80+ effects to choose from and loads of extra features. If you have any feature request or suggestions and want to be a part of the development effort to shape the plugin in the way you like, leave us a feedback from:<br />\nhttps://www.quantumcloud.com/products/support/</p>\n</p>\n<dt id='i%20have%20been%20using%20the%20free%20version%20plugin.%20how%20do%20i%20upgrade%20to%20the%20pro%20version%3F'>\nI have been using the free version plugin. How do I upgrade to the pro version?\n</h4>\n<p>\n<p>1st, you need to deactivate and delete the free version. Then install and activate the pro version and you are ready to go!</p>\n</p>\n\n",
        "changelog": "<h4>8.8.5</h4>\n<p>End sale</p>\n<h4>8.8.4</h4>\n<p>4th of July sale</p>\n<h4>8.8.3</h4>\n<p>Fixed a plugin redirect issue on activation</p>\n<h4>8.8.2</h4>\n<p>End Eid Sale</p>\n<h4>8.8.1</h4>\n<p>Eid Sale</p>\n<h4>8.8.0</h4>\n<p>Fixed some button animation issue</p>\n<h4>8.7.0</h4>\n<p>Fixed some PHP and Escaping Issues</p>\n<h4>8.6.1</h4>\n<p>Removed New year sal</p>\n<h4>8.6.0</h4>\n<p>New year sale</p>\n<h4>8.5.9</h4>\n<p>Christmas sale</p>\n<h4>8.5.8</h4>\n<p>Removed BF Sale</p>\n<h4>8.5.7</h4>\n<p>Fixed a PHP error</p>\n<h4>8.5.6</h4>\n<p>BF Sale</p>\n<h4>8.5.5</h4>\n<p>BF Sale</p>\n<h4>8.5.4</h4>\n<p>Fixed some JS issues</p>\n<h4>8.5.3</h4>\n<p>Sale banner removed</p>\n<h4>8.5.2</h4>\n<p>Support section updated</p>\n<p>Halloween sale</p>\n<h4>8.5.0</h4>\n<p>Fixed some JS issue</p>\n<h4>8.4.9</h4>\n<p>Removed Admin notice</p>\n<h4>8.4.8</h4>\n<p>Added Admin notice</p>\n<h4>8.4.7</h4>\n<p>Limit Admin notice</p>\n<h4>8.4.6</h4>\n<p>Improved Admin notice</p>\n<h4>8.4.5</h4>\n<p>Admin notice</p>\n<h4>8.4.4</h4>\n<p>Sanitized a setting option</p>\n<h4>8.4.3</h4>\n<p>Button design</p>\n<h4>8.4.2</h4>\n<p>Addded custom CSS back</p>\n<h4>8.4.1</h4>\n<p>Fixed drag and drop reorder issue</p>\n<h4>8.4.0</h4>\n<p>youtube video background improved</p>\n<p>Fixed php warning on Help page</p>\n<h4>8.3.9</h4>\n<p>Fixed issue with youtube video background</p>\n<h4>8.3.8</h4>\n<p>Added getting started section</p>\n<h4>8.3.7</h4>\n<p>Background video issue fixed.</p>\n<p>Video slider issue fixed.</p>\n<h4>8.3.6</h4>\n<p>Improve loading time</p>\n<h4>8.3.5</h4>\n<p>Custom CSS overriding issue fixed.</p>\n<h4>8.3.4</h4>\n<p>CSS important removed</p>\n<h4>8.3.3</h4>\n<p>Publish checkbox issue fixed.</p>\n<h4>8.3.2</h4>\n<p>Fixed a version mixup files</p>\n<h4>8.3.1</h4>\n<p>Fixed a CSS issue</p>\n<h4>8.3.0</h4>\n<p>Reverse slid image effect settings added.</p>\n<h4>8.2.9</h4>\n<p>Updated an OT function for improved security</p>\n<h4>8.2.8</h4>\n<p>Fixed font variant issue</p>\n<h4>8.2.7</h4>\n<p>Sanitized a function</p>\n<h4>8.2.6</h4>\n<p>Removed description box for intro slider</p>\n<h4>8.2.5</h4>\n<p>Slide title HTML issue fixed.</p>\n<p>Slider save issue fixed.</p>\n<h4>8.2.4</h4>\n<p>Refactored and removed some code</p>\n<h4>8.2.3</h4>\n<p>Removed redundant code</p>\n<p>Improved code standard for sanitization, escape</p>\n<h4>8.2.2</h4>\n<p>Removed obsolete code</p>\n<p>Used wp_enqueue commands</p>\n<p>Improved code sanitization</p>\n<h4>8.2.1</h4>\n<p>Nonce must be verifiedm issue fixed.</p>\n<h4>8.2.0</h4>\n<p>Refactored some PHP code</p>\n<p>Fixed a Javascript error</p>\n<h4>8.1.9</h4>\n<p>WP 5.6 compatible</p>\n<h4>8.1.8</h4>\n<p>Improved deactivation module</p>\n<h4>8.1.7</h4>\n<p>Constant define lower case issue fixed.</p>\n<h4>8.1.6</h4>\n<p>Fixed a PHP warning</p>\n<h4>8.1.4</h4>\n<p>Fixed slider repeat bug</p>\n<h4>8.1.3</h4>\n<p>Improved the cube effect</p>\n<h4>8.1.3</h4>\n<p>Cube Animations effect issue has been fixed.</p>\n<h4>8.1.2</h4>\n<p>All php warnings issue fixed.</p>\n<p>Undefined index issue fixed.</p>\n<p>Button render issue fixed.</p>\n<p>Slider Image alignment issue fixed.</p>\n<h4>8.1.0</h4>\n<p>Background image disappears issue fixed</p>\n<h4>8.0.0</h4>\n<p>Massive feature upgrades</p>\n<h4>7.5.4</h4>\n<p>Updated support page</p>\n<h4>7.5.3</h4>\n<p>Fixed a notice for php 7.3.x</p>\n<h4>7.5.2</h4>\n<p>Slider loading issue with slow network fixed.</p>\n<h4>7.5.1</h4>\n<p>Button editor close button overlay issue fixed.</p>\n<p>First Slide that comes with slider hero package by default &#8211; fixed some issues.</p>\n<h4>7.5.0</h4>\n<p>Fixed an issue with the particle effect zooming</p>\n<h4>7.4.0</h4>\n<p>Added elementor slider widget</p>\n<h4>7.3.0</h4>\n<p>Intro builder cancel &amp; reset button issue fixed.</p>\n<p>Undefined CSS issue fixed.</p>\n<h4>7.2.0</h4>\n<p>Torus effect replacement notice removed</p>\n<h4>7.1.0</h4>\n<p>Improved the plugin deactivation survey UX and fixed a bug</p>\n<h4>7.0.0</h4>\n<p>Improved the plugin deactivation survey UX</p>\n<h4>6.9.0</h4>\n<p>Improved the plugin deactivation survey</p>\n<h4>6.8.0</h4>\n<p>Improved the video background issue</p>\n<h4>6.7.0</h4>\n<p>Replaced the torus animation effect with new one</p>\n<h4>6.6.0</h4>\n<p>Some Custom Css added using wp_enqueue_inline_style</p>\n<p>Some Custom js added using wp_enqueue_inline_script</p>\n<p>Refactored and cleaned code</p>\n<h4>6.5.0</h4>\n<p>Improved shortcode maker code</p>\n<h4>6.4.0</h4>\n<p>Removed unused folder inc</p>\n<h4>6.3.0</h4>\n<p>Added video mute option</p>\n<h4>6.1.0</h4>\n<p>Youtube background video issue fixed.</p>\n<h4>6.0.0</h4>\n<p>Fixed some PHP warnings</p>\n<h4>5.9.0</h4>\n<p>Shortcode Generator Slider Block for Gutenberg.</p>\n<h4>5.8.0</h4>\n<p>Custom video, Youtube video, vimeo video added as pro effect.</p>\n<h4>5.7.0</h4>\n<p>Replaced OT with custom settings page</p>\n<h4>5.6.0</h4>\n<p>Removed some OT files and references to them to improve security</p>\n<h4>5.5.0</h4>\n<p>Fixed some PHP notices</p>\n<h4>5.4.0</h4>\n<p>Added text</p>\n<h4>5.3.0</h4>\n<p>Better full width slider support</p>\n<h4>5.2.0</h4>\n<p>Extra Security check &#8211; removed.</p>\n<p>Slider resize with aspect ration issue fixed for fullwidth mode.</p>\n<p>Slider resize with aspect ratio for custom width &amp; height.</p>\n<p>Support page conflict issue fixed.</p>\n<h4>5.1.0</h4>\n<p>Slider resize with aspect ratio for custom width &amp; height.</p>\n<h4>5.0.0</h4>\n<p>Fixed some conflicts with SLD</p>\n<h4>4.9.0</h4>\n<p>Improved support area. Added tips</p>\n<h4>4.8.0</h4>\n<p>Fixed header already sent error.</p>\n<h4>4.7.0</h4>\n<p>Improved support area</p>\n<h4>4.6.0</h4>\n<p>Multislider issue fixed.</p>\n<p>Enabled arrow color settings.</p>\n<h4>4.5.0</h4>\n<p>Button Bottom Margin &#8211; added.</p>\n<p>Description Bottom Margin &#8211; added.</p>\n<p>Title Bottom Margin &#8211; added.</p>\n<h4>4.5.0</h4>\n<p>Button Bottom Margin &#8211; added.</p>\n<p>Description Bottom Margin &#8211; added.</p>\n<p>Title Bottom Margin &#8211; added.</p>\n<h4>4.4.0</h4>\n<p>Submenu added for Help section.</p>\n<p>Design issue fixed.</p>\n<p>Remove theme option&#8217;s menu from admin bar</p>\n<p>Youtube player api added.</p>\n<h4>4.3.0</h4>\n<p>Added slide repeat</p>\n<h4>4.2.0</h4>\n<p>Added title background color</p>\n<h4>4.1.0</h4>\n<p>Added description out animation</p>\n<h4>4.0.0</h4>\n<p>Added title out animation</p>\n<h4>3.9.0</h4>\n<p>Slide padding time option added.</p>\n<h4>3.8.0</h4>\n<p>Show Pause button option added.</p>\n<h4>3.7.0</h4>\n<p>Show restart button option added.</p>\n<h4>3.6.0</h4>\n<p>Improved reponsiveness</p>\n<h4>3.5.0</h4>\n<p>Improved backend interface</p>\n<h4>3.4.0</h4>\n<p>Button Text &#8220;Add A Button&#8221; will change to &#8220;Edit Button&#8221; immediatly after adding a button.</p>\n<p>Subtitle not removing issue fixed.</p>\n<h4>3.3.0</h4>\n<p>Added duplicate Feature</p>\n<h4>3.2.0</h4>\n<p>Improved image sliding for ie/saffari.</p>\n<h4>3.1.0</h4>\n<p>Credit added.</p>\n<p>Added a conflict with Promo page.</p>\n<h4>3.0.0</h4>\n<p>Better responsiveness</p>\n<p>Added JS box</p>\n<h4>2.9.0</h4>\n<p>Updated backend text positions area to improve responsiveness</p>\n<h4>2.8.0</h4>\n<p>Color &amp; Background Section moved to the top of display settings.</p>\n<p>Added youtube Background video feature</p>\n<h4>2.7.0</h4>\n<p>Added preview for 3 new effects</p>\n<h4>2.6.0</h4>\n<p>Backend font-family &amp; black background issue &#8211; fixed.</p>\n<h4>2.5.0</h4>\n<p>Added fixed position save button</p>\n<h4>2.4.0</h4>\n<p>Fixed a conflict with Avada theme for tite font size.</p>\n<p>Added priority to add jquery at top of the page.</p>\n<h4>2.3.0</h4>\n<p>Fixed a bug that overwrote the delete button CSS style (visual) in WordPress plugin page</p>\n<h4>2.2.0</h4>\n<p>Intro Builder New Button</p>\n<p>New Menu selection issue fixed.</p>\n<p>Pro version effects added in New page.</p>\n<h4>2.1.5</h4>\n<p>Letter fx pro feature</p>\n<p>Content section align issue fixed.</p>\n<h4>2.1.0</h4>\n<p>Some Alignments fixed.</p>\n<p>Button Cancel issue fixed.</p>\n<p>Preview size bigger</p>\n<p>Introducing Hero Pro</p>\n<h4>2.0.0</h4>\n<p>Introducing dynamic, cinematic Intro Builder</p>\n<h4>1.9.1</h4>\n<p>Minor text update</p>\n<h4>1.9.0</h4>\n<p>Fixed some JS conflicts with 4.9</p>\n<h4>1.8.0</h4>\n<p>Added feature &#8211; Random slide</p>\n<h4>1.7.5</h4>\n<p>Fixed a bug with background image</p>\n<p>Added slide count</p>\n<h4>1.7.0</h4>\n<p>Added background image transition effect</p>\n<h4>1.6.5</h4>\n<p>Uploaded image show very small &#8211; Fixed.</p>\n<p>Slide Buttons break down when New slide is added &#8211; Fixed.</p>\n<p>Set default pause time to 13000 &#8211; Fixed.</p>\n<p>Fix the Button create window&#8217;s button alignments &#8211; Fixed.</p>\n<p>Fix language for title line height &#8211; Fixed.</p>\n<p>Fix Line Height Matching in Px &#8211; Fixed.</p>\n<h4>1.6.0</h4>\n<p>Redesigned backend interface</p>\n<h4>1.5.5</h4>\n<p>Fixed a conflict with themes that use option tree</p>\n<h4>1.5.0</h4>\n<p>Fixed a bug about preview for admin</p>\n<p>Fixed bug for slide delete</p>\n<p>Small misc. improvements</p>\n<h4>1.4.5</h4>\n<p>Removed pause before 1st slide</p>\n<p>Fixed text color for description</p>\n<h4>1.4.0</h4>\n<p>Major Update</p>\n<p>Image upload option add to slide.</p>\n<p>Left &amp; Right margin offset.</p>\n<p>Added custom css option in backend.</p>\n<p>Added Font height for title &amp; description.</p>\n<p>shortcode logo changed.</p>\n<p>Language changed.</p>\n<p>Support page updated.</p>\n<p>Support Email problem fixed.</p>\n<h4>1.2.0</h4>\n<p>Add shortcode column in list.</p>\n<p>Add type in details area.</p>\n<p>Change shortcode button to logo icon</p>\n<p>Added Text for subtitle</p>\n<p>Torus conflicting issue fixed.</p>\n<p>Change some languages.</p>\n<h4>1.1.0</h4>\n<ul>\n<li>Preview Option Added.</li>\n<li>Updated  Menu.</li>\n<li>New  Effect Added (Torus of Cubes).</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>More Button features added &#8211; Font size, Font Weight, Font Color, Hover Color, Letter Spacing.</li>\n<li>auto fit on resize window.</li>\n<li>Misc. Adjustments and bug fixes</li>\n</ul>\n<h4>0.9.5</h4>\n<ul>\n<li>Misc. Adjustments and bug fixes</li>\n</ul>\n<h4>0.9.1</h4>\n<ul>\n<li>Login cookie Bug fix</li>\n</ul>\n<h4>0.9.0</h4>\n<ul>\n<li>Inception</li>\n</ul>\n"
    },
    "short_description": "Hero Slider with Youtube Video Background &amp; Animation Effects. Adverts, Text Carousels, Animated Header - Elementor Slider Widget &amp; Gutenberg",
    "description": "<p>Slider Hero is a futuristic, responsive header Hero Slider plugin and <strong>Dyanmic Website Intro Advert</strong> maker with Youtube Video background and animated background effects for hero banners, hero sliders and Landing pages. Create awesome <strong>animation slider</strong> and animated header with text carousel and Call to Action buttons from Gutenberg Slider Block &amp; Elementor Slider Widget. Use youtube video background or combine animation effect and youtube video.</p>\n<blockquote>\n<p>🚀 <a href=\"https://www.quantumcloud.com/resources/free-support/\" rel=\"nofollow ugc\">Support, Bug Report, Feature Requests</a> | <a href=\"https://dev2.testversions.com/sliderhero/\" rel=\"nofollow ugc\">Slider Hero</a> Live Demo | <strong>Upgrade to <a href=\"https://www.quantumcloud.com/products/slider-hero/\" rel=\"nofollow ugc\">Slider Hero Pro!</a></strong></p>\n</blockquote>\n<p>Slider Hero also includes a <strong>Gutenberg Slider</strong> block and an <strong>Elementor Slider</strong> widget. Use the Elementor Slider Widget or the Gutenberg Slider block to quickly embed Slider Hero anywhere on your page.</p>\n<p>Slider Hero is not just your typical responsive image slider plugin for wordpress. This plugin is one of a kind and is based on a unqiue concept that uses incredible CSS3 and JavaScript background animation slider effects not available anywhere else. It is a <strong>super fun and simple</strong> slider plugin to use and <strong>very quick</strong> to create elegant, unique animation sliders with animated background effects within a matter of minutes. Not only that, this plugin also supports Youtube background video and Background Image Sliders!</p>\n<p>** The free version works in the same way as the pro version just with less number of effects &amp; features. The pro version also supports video sliders like Youtube Video Slider, Vimeo Video Slider or Custom Video Sliders. Video Sliders are not yet available in the free version.</p>\n<blockquote>\n<p>Check the <a href=\"http://www.slider-hero.com/intro/\" rel=\"nofollow ugc\">Hero Introduction</a><br />\n  Dare to See <a href=\"http://www.slider-hero.com/matrix-intro/\" rel=\"nofollow ugc\">How Deep the Rabbit Hole Goes?</a></p>\n<p>Check out the Live Previews of the <a href=\"https://www.slider-hero.com/\" rel=\"nofollow ugc\">Slider Hero</a><br />\n  Upgrade now to <a href=\"https://www.quantumcloud.com/products/slider-hero/\" rel=\"nofollow ugc\">Slider Hero Pro</a></p>\n</blockquote>\n<h4>Create Modern Slider Carousels Easily</h4>\n<p>Check this tutorial to see how fast, intuitive and easy it is to use this wordpress slider plugin to create slider carousels and text carousels.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/KfH2KRpbObQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<blockquote>\n<p>Looking for an Elegent Portfolio plugin? Try our <a href=\"https://wordpress.org/plugins/portfolio-x/\" rel=\"ugc\">Portfolio X</a>!</p>\n</blockquote>\n<h4>Create Stunning Product Intro Adverts</h4>\n<p>Make unique product intros and adverts with like a pro without any additional editing tool. The intro creation process is extremely easy and insanely quick and FUN. Now introduce your products and services with a dramatic flair!</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/k9CFs-hiBUk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<blockquote>\n<p>//-&gt; Try our <strong><a href=\"https://wordpress.org/plugins/chatbot/\" rel=\"ugc\">FREE ChatBot for WordPress with AI &#8211; WPBot</a></strong>. It is an easy to use, Native, No coding required, AI ChatBot to provide Automated Live Chat Support. Use ChatBot to <strong>answer user questions</strong> and also <strong>collect information</strong> from the users using <strong>conversational forms</strong>. It can be also be powered by DialogFlow, Tavily or OpenAI ChatGPT or simply use the built-in features to provide Live support and collect user data. ++ Check out <a href=\"https://www.wpbot.pro/\" rel=\"nofollow ugc\">ChatBot for WordPress</a> Demo.</p>\n</blockquote>\n<h4>Why Use Slider Hero Rather than Other WordPress Slider Plugin?</h4>\n<p>Traditional Image Sliders are bad for user conversions and they cause <strong>banner blindness</strong>. They are boring and do not engage users. Eye tracking studies conducted by Neilson Norman Group found that as soon as visitors perceived something to be an advertisement they turned their focus away from it. Image sliders divide your user’s attention. Images on slides represent different products or offers in the span of a few seconds. Your website user has hardly read a single thing when whoosh&#8230;the image changes and they have to refocus their attention.</p>\n<p>Our slider plugin is different. It <strong>focuses on your core messages/</strong><strong>, uses a background animation of your choice to keep the user </strong><strong>interested and focused</strong>. The unique Call to Action button leads the users where they really need to be. The effects are almost like subtle Cinemagraph animations when used in onjunction with your images or text carousels. Think of it as a perfect alternative to background videos.</p>\n<h4>More than a Slider Plugin &#8211; Use Motion Typography to Build Amazing Product Intros</h4>\n<p>The other unique feature of Slider Hero is the Intro Advert builder. Introduce your products and services with a <strong>dramatic flair</strong>. The typographic intro builder allows you to do something very unique. You can create stunning product introductions like stunning “Apple – iPhone 7 and iPhone 7 Plus in 107 seconds” or “Introducing Pixel, Phone by Google” with chained text animation combining background audio of your choice.</p>\n<p>Build a combination of beautiful text animation along with the background animation. This can be applied in company  introductions, creative projects, for your product or service launch etc. You can easily change the color of the text, animation type and more! The intro builder interface is simple and intuitive.</p>\n<blockquote>\n<p>Upgrade to the <a href=\"https://www.quantumcloud.com/products/slider-hero/\" rel=\"nofollow ugc\">Professional Version</a></p>\n</blockquote>\n<h4>Slider Hero Benefits</h4>\n<p>This is the best wordpress header slider plugin with text overlay and cinematic background animation effects. This plugin is best used as Intro, Landing Page Slider or Home Page Slider. It can be used as a fullscreen slider plugin besides the full width or custom width modes. Create a memorable EXPERIENCE for your wordpress coming soon, splash page, home page or landing page that will impress your site visitors with a memorable first impression.</p>\n<p>You can use the Elementor Slider widget or Gutenberg Slider block to create HTML5 animated banners,<strong> HERO Banner</strong>, hero carousel with text and image, HERO text carousel, responsive header image slider, or simple image carousel. The pro version supports Parallax Effect and Ken Burns Effect.</p>\n<p>Marketers prefer Hero image or <strong>Hero sliders</strong> for homepage and landing pages because traditional image sliders do not convert customers as much as an animated bannere which typically occupies the most prime real estate of your website. This plugin provides a middle ground. It allows you to set a background Hero Image and/or select a GREAT javascript background animation effect and apply Title, Description and Buttons etc. as slides or carousel. <strong>Instant awesomeness</strong>.</p>\n<p>There are quite a few great WordPress slider plugins available but they take a lot of efforts and expertise to produce awesome effects you see in their demos. With our plugin, you can make amazing looking Homepage or <strong>Landing Page Hero Sliders</strong> or animated header with cinematic effects easily and quickly like no others.</p>\n<h4>Slider Hero Use Cases</h4>\n<p>This slider plugin provides all the <strong>quality of the premium and popular WordPress Slider plugins</strong> without the headechs and complications. Select an animation effect like slider Particle Effect, Snow effect, Nasa or Space effect, Bubble effect or Nyan Cat effect, add a background image or choose from a collection of gradients, add title, description, and button (optional) and you are good to go. There is no dragging and dropping or awkward animation timings to get right – this plugin does everything for you. You can use it as an alternative to background video.</p>\n<p><strong>Finally a Hero to rescue your websites</strong> from boring image sliders that nobody scrolls through.</p>\n<p>You can also use Slider Hero as Background Image Slides with or without text carousel and effects. Available Transition Effects are: Fade in/Out, (Slide Left, Slide Right, Slide from Top and Slide from Bottom available in Pro version)</p>\n<p>Slider Hero comes with embedded video support! Create a text carousel with <strong>Youtube Video Background</strong>. Pro version supports uploading your own files or use <strong>Vimeo</strong>, Loop, Mute, and Set a color overlay with opacity! Video background can be combined with most special effects to create something truly unique and amazing.</p>\n<p><strong>Using Video Background with Slider Hero</strong><br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/NL88kFnAD9s?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>This slider plugin is perfect to use on your Landing page, Home page, Coming Soon page, 404 Error Page or Splash page and create a permanent, unique impression on your website users.</p>\n<h4>All Slider Hero Features</h4>\n<p><strong>Unique, Cinematic Intro Advert Builder</strong></p>\n<ul>\n<li>Create Unlimited Cinematic Intro Advert Easily which was never possible before</li>\n<li>Simple, Effective and Intuitive Interface</li>\n<li>Define text, Font color, Letter Spacing, Font Weight</li>\n<li>Select from 800+ Google Fonts [PRO FEATURE]</li>\n<li>Live Font Preview [PRO FEATURE]</li>\n<li>Flexible Intro Builder with Dynamic Slide delay, Text Animation Type (50+ effects)</li>\n<li>Upload Image as Slide Background or Select a Color</li>\n<li>Redirect to New Page After Intro Ends with Custom Delay [PRO FEATURE]</li>\n<li>Load Regular Slider with Call to Action Buttons After Intro Ends with Custom Delay [PRO FEATURE]</li>\n<li>11 Background Animation to Choose from (more coming soon) [PRO FEATURE]</li>\n</ul>\n<p><strong>Modern Sliders and Text Carousels with Special Background Effects</strong></p>\n<ul>\n<li>Create Unlimited Modern Sliders and Text Carousels with Stunning, Never Before Seen Background Animations</li>\n<li>Choose from <strong>8 (80+ in PRO)</strong> Wonderfully Refreshing and Unique Background Animation Effects</li>\n<li>Switch Between Effects Instantly [PRO FEATURE]</li>\n<li>Reposition Title, Description and Buttons Easily</li>\n<li>800+ Google Fonts with Live Font Preview [PRO FEATURE]</li>\n<li>Choose from 173 Professionally Created Gradient or Upload an Image as Background</li>\n<li>Parallax Effect Support for Background Image [PRO FEATURE]</li>\n<li>Ken Burns Effect for Background Image [PRO FEATURE]</li>\n</ul>\n<p><strong>Slider with Video Background</strong></p>\n<ul>\n<li>Embed a Video as Background with Your Slider</li>\n<li>Use Youtube Video background</li>\n<li>Use Vimeo Video Background  [PRO FEATURE]</li>\n<li>Upload Your Own Video (mp4 and webm)  [PRO FEATURE]</li>\n<li>Loop and Repeat Option  [PRO FEATURE]</li>\n<li>Mute Sound Option. [PRO FEATURE]</li>\n<li>Color Overlay  [PRO FEATURE]</li>\n<li>Choose Overlay Color and Opacity [PRO FEATURE]</li>\n<li>Hide ‘watch later’, ‘share’ and channel ‘subscribe’ and Video suggestion from youtube videos</li>\n</ul>\n<p><strong>Video Slider </strong><br />\n* Youtube Video Slider<br />\n* Upload Your Own Video (mp4 and webm) and create Custom Video Slider<br />\n* Vimeo Video Slider<br />\n* Add Text to Slide on Top of Videos [PRO FEATURE]<br />\n* Hide ‘watch later’, ‘share’ and channel ‘subscribe’ and Video suggestion from youtube videos [PRO FEATURE]</p>\n<p><strong>Call to Action Buttons</strong></p>\n<ul>\n<li>Add One or Two [PRO FEATURE] Call to Action Buttons with Each Slide</li>\n<li>Square or Rounded Shape</li>\n<li>With or Without Borders</li>\n<li>Choose from 10 Custom Button Animations. [PRO FEATURE]</li>\n<li>Customize Button Fonts with Colors, Letter Spacing and More</li>\n</ul>\n<p><strong>Text Animation</strong></p>\n<ul>\n<li>Standard Animate CSS Text In and Out Effects</li>\n<li>Letter FX Effects to Animate Your Letters [PRO FEATURE]</li>\n<li>Combine Animate CSS and Letter FX for Unique Text Effects of Your Own [PRO FEATURE]</li>\n<li>20 Custom, Exotic Text Animation Effects for Title and Descriptions [PRO FEATURE]</li>\n</ul>\n<p><strong>Audio Support</strong></p>\n<ul>\n<li>Add Background Music to Match the Tone of Your Intro Adverts and Sliders. [PRO FEATURE]</li>\n<li>Choose The Audio Controller Position [PRO FEATURE]</li>\n<li>Users Can Turn Sound On and Off [PRO FEATURE]</li>\n<li>Select if Audio Should Loop Indefinitely or Stop After Repeating a Few Times [PRO FEATURE]</li>\n</ul>\n<p><strong>Unique Slider Decoration</strong></p>\n<ul>\n<li>Add Unique Decoration for Top and Bottom Parts of Your Sliders [PRO FEATURE]</li>\n<li>Choose from Slope, Rounded, Triangle, Arrow, Cloud or Half Circle Patterns [PRO FEATURE]</li>\n<li>Stand Out from the Crowd</li>\n</ul>\n<p><strong>Background Image Carousel</strong></p>\n<ul>\n<li>Use as Background Image Carousel with or without text carousel and effects.</li>\n<li>Available Transition Effects: Fade in/Out, Slide Left, Slide Right, Slide from Top and Slide from Bottom</li>\n<li>Parallax Effect Support for Background Image [PRO FEATURE]</li>\n<li>Ken Burns Effect for Background Image [PRO FEATURE]</li>\n</ul>\n<p><strong>General Options</strong></p>\n<ul>\n<li>Hero Slider, Carousel and Standard Features</li>\n<li>Fully Responsive</li>\n<li>Unlimited Sliders on a Page</li>\n<li>Drag &amp; Drop Slide Position</li>\n<li>Unpublish Slide/s</li>\n<li>Quick and Easy Building WITHOUT Any Layer or Timeline</li>\n<li>Copy and Duplicate  [PRO FEATURE]</li>\n<li>Auto Slide On or Off</li>\n<li>Repeat On or Off [PRO FEATURE]</li>\n<li>Random Slide</li>\n<li>Background Animation Canvas Opacity [PRO FEATURE]</li>\n<li>Preview Your Sliders While Creating and Save Time</li>\n</ul>\n<p><strong>Slider Navigation and Controls</strong></p>\n<ul>\n<li>Arrow Navigation with Custom  [PRO FEATURE] Colored Arrow Icons</li>\n<li>Special Floating Navigation Arrows [PRO FEATURE]</li>\n<li>Dot Navigation [PRO FEATURE]</li>\n<li>Pause and ResStart Slider [PRO FEATURE]</li>\n</ul>\n<p><strong>Preloader</strong></p>\n<ul>\n<li>Turn Preloader on or Off [PRO FEATURE]</li>\n<li>Upload Your Own Preloader Image or Animated Gif [PRO FEATURE]</li>\n</ul>\n<p><strong>Import Export Slider</strong></p>\n<ul>\n<li>Export and Import in Another Website Easily [PRO FEATURE]</li>\n<li>Export/Import Your Carefully Crafted Intro or Adverts [PRO FEATURE]</li>\n</ul>\n<p><strong>Full Width and Full Screen Slider</strong></p>\n<ul>\n<li>Slider Hero Supports Full Width Slider Layout </li>\n<li>Stretch Full Screen and Full Height</li>\n</ul>\n<h4>Available Background Animation Effects in the Pro Version</h4>\n<p>Intro Effect, Stripe Connect Effect, Clear Sky Effect, Water Ripple Effect, Aeronautics Effect, Antigravity Flow, Balls Gravity Effect, Bird Flying Effect, Blob Effect, Blade Effect, Blur Effect, Bubble, Campfire, Circle Intersection, Cloudy Sky Effect, Confetti Effect, Cosmic Web, Colorful Particle, Cursor And Paint,  Day Night Effect, Division Effect, Directional Force, Distance, Electric Clock, Firework, Fizzy Sparks, Float and Rain, Floating Leafs, Flowing Circle Effect, Flying Rocket Effect, Grid Effect, Helix Corruption, Helix Chaos, Helix Multiple, Glitch, Iconsahedron Effect, Intersecting Line Effect, Just Cloud, Link Particle, Liquid Landscape, Matrix Effect, Metaballs, Microcosm Effect, Moving Color, Wave, NASA, Neno, Hexagon, Noise Effect, Nyan Cat, Orbital Effect, Particle Effect, Particle Helix, Particle System, Hacker, Physics Bug, Racing Particles, Rain Effect, Rainy Season, Rays and Particles, Play or Work? Rain Of Line, Rising and falling cubes, Shape Animation, Space Elevator, Christmas Snow Effect, Squidematics, Stars Effect, Stellar Cloud, Subvisual, Tag Canvas, The Great Attractor, Thibaut, Tiny Galaxy Effect, Torus of Cubes, Water Effect, Wave Effect, Wave Animation Effect, Waaave Canvas, Walking Background, Star Trek Warp Speed, Water Swimming, Waving Cloth, Water Droplet, Wormhole Effect, Word Cloud, Valentine Effect, Ygekpg Effect</p>\n<blockquote>\n<p>Upgrade to <a href=\"https://www.quantumcloud.com/products/slider-hero/\" rel=\"nofollow ugc\">Professional Version</a><br />\n  Pro Version Documentation <a href=\"https://www.quantumcloud.com/documentations/slider-hero/\" rel=\"nofollow ugc\">Documentation</a></p>\n</blockquote>\n<h4>Getting Started</h4>\n<p>Step 1: Select a Slider effect<br />\nStep 2: Add title and text to your first slide. Unlimited slides supported<br />\nStep 3: Paste shortcode in your homepage or landing page or any page!</p>\n<p>You are ready with an awesome, animated Hero Slider or Hero Banner!</p>\n<h4>CUSTOMER SUPPORT</h4>\n<p>All technical stuffs could be tough for your busy schedule. But you don’t need to go at it alone. QuantumCloud&#8217;s quick and friendly customer support team is made up of top notch, friendly people &#8211; working hard to ensure you get the help you need, when you need it. We have built in Support area in the slider plugin. Just shoot us a mail with your questions or feedback and we will get right back to you.</p>\n<h4>Leave a Rating for this Slider Plugin</h4>\n<p><strong>If you like our effort</strong> and would like to support us or if you just thought that this plugin was somewhat helpful, please leave a <strong>5 star rating</strong> and a short blurb on what you like the most about it. It means the world to us and motivates our developers to keep adding kool, new, premium features to this awesome plugin.</p>\n<p><strong>If you face any problem, or want more features in this Plugin </strong><strong>please leave a comment</strong>, instead of review. We take all customer feedback extremely seriously.</p>\n<h3>Use</h3>\n<ol>\n<li>After activating the slider plugin, create a new page or post. In the body section copy paste the Hero shortcode </li>\n<li>Save the page/post and check the page in front end.</li>\n</ol>\n",
    "download_link": "https://downloads.wordpress.org/plugin/slider-hero.8.8.5.zip",
    "upgrade_notice": {
        "Change some languages.": ""
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/slider-hero/assets/screenshot-1.jpg?rev=1799129",
            "caption": "Snow effect"
        },
        {
            "src": "https://ps.w.org/slider-hero/assets/screenshot-2.jpg?rev=1799129",
            "caption": "Nasa effect"
        },
        {
            "src": "https://ps.w.org/slider-hero/assets/screenshot-3.jpg?rev=1799129",
            "caption": "Bubble effect"
        },
        {
            "src": "https://ps.w.org/slider-hero/assets/screenshot-4.jpg?rev=1799129",
            "caption": "Particle effect"
        },
        {
            "src": "https://ps.w.org/slider-hero/assets/screenshot-5.jpg?rev=1799129",
            "caption": "Nyan Cat effect"
        },
        {
            "src": "https://ps.w.org/slider-hero/assets/screenshot-6.jpg?rev=1799129",
            "caption": "Gradient effect"
        },
        {
            "src": "https://ps.w.org/slider-hero/assets/screenshot-7.jpg?rev=1799129",
            "caption": "Torus Effect"
        },
        {
            "src": "https://ps.w.org/slider-hero/assets/screenshot-8.jpg?rev=1799129",
            "caption": "Backend Select Slider Effect"
        },
        {
            "src": "https://ps.w.org/slider-hero/assets/screenshot-9.jpg?rev=1799129",
            "caption": "Create Slider"
        },
        {
            "src": "https://ps.w.org/slider-hero/assets/screenshot-10.jpg?rev=1799129",
            "caption": "Display Settings"
        }
    ],
    "tags": {
        "banner-slider": "Banner slider",
        "elementor-slider": "elementor-slider",
        "slider": "slider",
        "video-background": "video background",
        "video-slider": "video slider"
    },
    "stable_tag": "8.8.5",
    "versions": {
        "0.9.0": "https://downloads.wordpress.org/plugin/slider-hero.0.9.0.zip",
        "0.9.1": "https://downloads.wordpress.org/plugin/slider-hero.0.9.1.zip",
        "0.9.5": "https://downloads.wordpress.org/plugin/slider-hero.0.9.5.zip",
        "1.0.0": "https://downloads.wordpress.org/plugin/slider-hero.1.0.0.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/slider-hero.1.1.0.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/slider-hero.1.2.0.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/slider-hero.1.4.0.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/slider-hero.1.4.5.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/slider-hero.1.5.0.zip",
        "1.5.5": "https://downloads.wordpress.org/plugin/slider-hero.1.5.5.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/slider-hero.1.6.0.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/slider-hero.1.6.5.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/slider-hero.1.7.0.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/slider-hero.1.7.5.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/slider-hero.1.8.0.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/slider-hero.1.9.0.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/slider-hero.1.9.1.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/slider-hero.2.0.0.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/slider-hero.2.1.0.zip",
        "2.1.5": "https://downloads.wordpress.org/plugin/slider-hero.2.1.5.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/slider-hero.2.2.0.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/slider-hero.2.3.0.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/slider-hero.2.4.0.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/slider-hero.2.5.0.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/slider-hero.2.6.0.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/slider-hero.2.7.0.zip",
        "2.8.0": "https://downloads.wordpress.org/plugin/slider-hero.2.8.0.zip",
        "2.9.0": "https://downloads.wordpress.org/plugin/slider-hero.2.9.0.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/slider-hero.3.0.0.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/slider-hero.3.1.0.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/slider-hero.3.2.0.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/slider-hero.3.3.0.zip",
        "3.4.0": "https://downloads.wordpress.org/plugin/slider-hero.3.4.0.zip",
        "3.5.0": "https://downloads.wordpress.org/plugin/slider-hero.3.5.0.zip",
        "3.6.0": "https://downloads.wordpress.org/plugin/slider-hero.3.6.0.zip",
        "3.7.0": "https://downloads.wordpress.org/plugin/slider-hero.3.7.0.zip",
        "3.8.0": "https://downloads.wordpress.org/plugin/slider-hero.3.8.0.zip",
        "3.9.0": "https://downloads.wordpress.org/plugin/slider-hero.3.9.0.zip",
        "4.0.0": "https://downloads.wordpress.org/plugin/slider-hero.4.0.0.zip",
        "4.1.0": "https://downloads.wordpress.org/plugin/slider-hero.4.1.0.zip",
        "4.2.0": "https://downloads.wordpress.org/plugin/slider-hero.4.2.0.zip",
        "4.3.0": "https://downloads.wordpress.org/plugin/slider-hero.4.3.0.zip",
        "4.4.0": "https://downloads.wordpress.org/plugin/slider-hero.4.4.0.zip",
        "4.5.0": "https://downloads.wordpress.org/plugin/slider-hero.4.5.0.zip",
        "4.6.0": "https://downloads.wordpress.org/plugin/slider-hero.4.6.0.zip",
        "4.7.0": "https://downloads.wordpress.org/plugin/slider-hero.4.7.0.zip",
        "4.8.0": "https://downloads.wordpress.org/plugin/slider-hero.4.8.0.zip",
        "4.9.0": "https://downloads.wordpress.org/plugin/slider-hero.4.9.0.zip",
        "5.0.0": "https://downloads.wordpress.org/plugin/slider-hero.5.0.0.zip",
        "5.1.0": "https://downloads.wordpress.org/plugin/slider-hero.5.1.0.zip",
        "5.2.0": "https://downloads.wordpress.org/plugin/slider-hero.5.2.0.zip",
        "5.3.0": "https://downloads.wordpress.org/plugin/slider-hero.5.3.0.zip",
        "5.4.0": "https://downloads.wordpress.org/plugin/slider-hero.5.4.0.zip",
        "5.5.0": "https://downloads.wordpress.org/plugin/slider-hero.5.5.0.zip",
        "5.6.0": "https://downloads.wordpress.org/plugin/slider-hero.5.6.0.zip",
        "5.7.0": "https://downloads.wordpress.org/plugin/slider-hero.5.7.0.zip",
        "5.8.0": "https://downloads.wordpress.org/plugin/slider-hero.5.8.0.zip",
        "5.9.0": "https://downloads.wordpress.org/plugin/slider-hero.5.9.0.zip",
        "6.0.0": "https://downloads.wordpress.org/plugin/slider-hero.6.0.0.zip",
        "6.1.0": "https://downloads.wordpress.org/plugin/slider-hero.6.1.0.zip",
        "6.3.0": "https://downloads.wordpress.org/plugin/slider-hero.6.3.0.zip",
        "6.4.0": "https://downloads.wordpress.org/plugin/slider-hero.6.4.0.zip",
        "6.5.0": "https://downloads.wordpress.org/plugin/slider-hero.6.5.0.zip",
        "6.6.0": "https://downloads.wordpress.org/plugin/slider-hero.6.6.0.zip",
        "6.7.0": "https://downloads.wordpress.org/plugin/slider-hero.6.7.0.zip",
        "6.8.0": "https://downloads.wordpress.org/plugin/slider-hero.6.8.0.zip",
        "6.9.0": "https://downloads.wordpress.org/plugin/slider-hero.6.9.0.zip",
        "7.0.0": "https://downloads.wordpress.org/plugin/slider-hero.7.0.0.zip",
        "7.1.0": "https://downloads.wordpress.org/plugin/slider-hero.7.1.0.zip",
        "7.2.0": "https://downloads.wordpress.org/plugin/slider-hero.7.2.0.zip",
        "7.3.0": "https://downloads.wordpress.org/plugin/slider-hero.7.3.0.zip",
        "7.4.0": "https://downloads.wordpress.org/plugin/slider-hero.7.4.0.zip",
        "7.5.0": "https://downloads.wordpress.org/plugin/slider-hero.7.5.0.zip",
        "7.5.1": "https://downloads.wordpress.org/plugin/slider-hero.7.5.1.zip",
        "7.5.2": "https://downloads.wordpress.org/plugin/slider-hero.7.5.2.zip",
        "7.5.3": "https://downloads.wordpress.org/plugin/slider-hero.7.5.3.zip",
        "7.5.4": "https://downloads.wordpress.org/plugin/slider-hero.7.5.4.zip",
        "8.0.0": "https://downloads.wordpress.org/plugin/slider-hero.8.0.0.zip",
        "8.1.0": "https://downloads.wordpress.org/plugin/slider-hero.8.1.0.zip",
        "8.1.1": "https://downloads.wordpress.org/plugin/slider-hero.8.1.1.zip",
        "8.1.2": "https://downloads.wordpress.org/plugin/slider-hero.8.1.2.zip",
        "8.1.3": "https://downloads.wordpress.org/plugin/slider-hero.8.1.3.zip",
        "8.1.4": "https://downloads.wordpress.org/plugin/slider-hero.8.1.4.zip",
        "8.1.5": "https://downloads.wordpress.org/plugin/slider-hero.8.1.5.zip",
        "8.1.6": "https://downloads.wordpress.org/plugin/slider-hero.8.1.6.zip",
        "8.1.7": "https://downloads.wordpress.org/plugin/slider-hero.8.1.7.zip",
        "8.1.8": "https://downloads.wordpress.org/plugin/slider-hero.8.1.8.zip",
        "8.1.9": "https://downloads.wordpress.org/plugin/slider-hero.8.1.9.zip",
        "8.2.0": "https://downloads.wordpress.org/plugin/slider-hero.8.2.0.zip",
        "8.2.1": "https://downloads.wordpress.org/plugin/slider-hero.8.2.1.zip",
        "8.2.2": "https://downloads.wordpress.org/plugin/slider-hero.8.2.2.zip",
        "8.2.3": "https://downloads.wordpress.org/plugin/slider-hero.8.2.3.zip",
        "8.2.4": "https://downloads.wordpress.org/plugin/slider-hero.8.2.4.zip",
        "8.2.5": "https://downloads.wordpress.org/plugin/slider-hero.8.2.5.zip",
        "8.2.6": "https://downloads.wordpress.org/plugin/slider-hero.8.2.6.zip",
        "8.2.7": "https://downloads.wordpress.org/plugin/slider-hero.8.2.7.zip",
        "8.2.8": "https://downloads.wordpress.org/plugin/slider-hero.8.2.8.zip",
        "8.2.9": "https://downloads.wordpress.org/plugin/slider-hero.8.2.9.zip",
        "8.3.0": "https://downloads.wordpress.org/plugin/slider-hero.8.3.0.zip",
        "8.3.1": "https://downloads.wordpress.org/plugin/slider-hero.8.3.1.zip",
        "8.3.2": "https://downloads.wordpress.org/plugin/slider-hero.8.3.2.zip",
        "8.3.3": "https://downloads.wordpress.org/plugin/slider-hero.8.3.3.zip",
        "8.3.4": "https://downloads.wordpress.org/plugin/slider-hero.8.3.4.zip",
        "8.3.5": "https://downloads.wordpress.org/plugin/slider-hero.8.3.5.zip",
        "8.3.6": "https://downloads.wordpress.org/plugin/slider-hero.8.3.6.zip",
        "8.3.7": "https://downloads.wordpress.org/plugin/slider-hero.8.3.7.zip",
        "8.3.8": "https://downloads.wordpress.org/plugin/slider-hero.8.3.8.zip",
        "8.3.9": "https://downloads.wordpress.org/plugin/slider-hero.8.3.9.zip",
        "8.4.0": "https://downloads.wordpress.org/plugin/slider-hero.8.4.0.zip",
        "8.4.1": "https://downloads.wordpress.org/plugin/slider-hero.8.4.1.zip",
        "8.4.2": "https://downloads.wordpress.org/plugin/slider-hero.8.4.2.zip",
        "8.4.3": "https://downloads.wordpress.org/plugin/slider-hero.8.4.3.zip",
        "8.4.4": "https://downloads.wordpress.org/plugin/slider-hero.8.4.4.zip",
        "8.4.5": "https://downloads.wordpress.org/plugin/slider-hero.8.4.5.zip",
        "8.4.6": "https://downloads.wordpress.org/plugin/slider-hero.8.4.6.zip",
        "8.4.7": "https://downloads.wordpress.org/plugin/slider-hero.8.4.7.zip",
        "8.4.8": "https://downloads.wordpress.org/plugin/slider-hero.8.4.8.zip",
        "8.4.9": "https://downloads.wordpress.org/plugin/slider-hero.8.4.9.zip",
        "8.5.0": "https://downloads.wordpress.org/plugin/slider-hero.8.5.0.zip",
        "8.5.2": "https://downloads.wordpress.org/plugin/slider-hero.8.5.2.zip",
        "8.5.3": "https://downloads.wordpress.org/plugin/slider-hero.8.5.3.zip",
        "8.5.4": "https://downloads.wordpress.org/plugin/slider-hero.8.5.4.zip",
        "8.5.5": "https://downloads.wordpress.org/plugin/slider-hero.8.5.5.zip",
        "8.5.6": "https://downloads.wordpress.org/plugin/slider-hero.8.5.6.zip",
        "8.5.7": "https://downloads.wordpress.org/plugin/slider-hero.8.5.7.zip",
        "8.5.8": "https://downloads.wordpress.org/plugin/slider-hero.8.5.8.zip",
        "8.5.9": "https://downloads.wordpress.org/plugin/slider-hero.8.5.9.zip",
        "8.6.0": "https://downloads.wordpress.org/plugin/slider-hero.8.6.0.zip",
        "8.6.1": "https://downloads.wordpress.org/plugin/slider-hero.8.6.1.zip",
        "8.7.0": "https://downloads.wordpress.org/plugin/slider-hero.8.7.0.zip",
        "8.8.0": "https://downloads.wordpress.org/plugin/slider-hero.8.8.0.zip",
        "8.8.1": "https://downloads.wordpress.org/plugin/slider-hero.8.8.1.zip",
        "8.8.2": "https://downloads.wordpress.org/plugin/slider-hero.8.8.2.zip",
        "8.8.3": "https://downloads.wordpress.org/plugin/slider-hero.8.8.3.zip",
        "8.8.4": "https://downloads.wordpress.org/plugin/slider-hero.8.8.4.zip",
        "8.8.5": "https://downloads.wordpress.org/plugin/slider-hero.8.8.5.zip",
        "trunk": "https://downloads.wordpress.org/plugin/slider-hero.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.quantumcloud.com",
    "banners": {
        "low": "https://ps.w.org/slider-hero/assets/banner-772x250.jpg?rev=1802635",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/slider-hero/assets/icon-256x256.png?rev=1991815",
        "2x": "https://ps.w.org/slider-hero/assets/icon-256x256.png?rev=1991815"
    },
    "blocks": {
        "qcld-slider-hero/render-all-sliders": {
            "name": "qcld-slider-hero/render-all-sliders",
            "title": "Qcld Slider Hero Render All Sliders"
        },
        "qcld-slider-hero/qcld-slider-hero-shortcode-maker": {
            "name": "qcld-slider-hero/qcld-slider-hero-shortcode-maker",
            "title": "Slider-Hero"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 96,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}