{
    "name": "SmartVideo &#8211; Video Player and CDN",
    "slug": "smartvideo",
    "version": "2.1.1",
    "author": "<a href=\"https://swarmify.idevaffiliate.com/idevaffiliate.php?id=10275&url=48\">Swarmify</a>",
    "author_profile": "https://profiles.wordpress.org/jdadmin/",
    "contributors": {
        "kinggmobb": {
            "profile": "https://profiles.wordpress.org/kinggmobb/",
            "avatar": "https://secure.gravatar.com/avatar/5a7bcb36362cecab04ea51f0cd0cff4d?s=96&d=monsterid&r=g",
            "display_name": "Matthew"
        },
        "jdadmin": {
            "profile": "https://profiles.wordpress.org/jdadmin/",
            "avatar": "https://secure.gravatar.com/avatar/b22c8fdbdf8f48285d9719e7aa70bb4a?s=96&d=monsterid&r=g",
            "display_name": "Swarmify"
        }
    },
    "requires": "3.0.1",
    "tested": "6.4.5",
    "requires_php": "7.3",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 78,
    "ratings": {
        "5": 10,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 4
    },
    "num_ratings": 14,
    "support_url": "https://wordpress.org/support/plugin/smartvideo/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 2000,
    "downloaded": 71451,
    "last_updated": "2024-02-02 5:36pm GMT",
    "added": "2018-02-26",
    "homepage": "",
    "sections": {
        "installation": "<ol>\n<li>Upload the plugin files to the <code>/wp-content/plugins/SmartVideo</code> directory, or install the plugin through the WordPress plugins screen directly.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; screen in WordPress.</li>\n<li>Use the Settings-&gt;SmartVideo screen to configure the plugin.</li>\n<li>You will need to sign up for an account at <a href=\"https://swarmify.idevaffiliate.com/idevaffiliate.php?id=10275&amp;url=48\" rel=\"nofollow ugc\">Swarmify</a>.</li>\n</ol>\n",
        "changelog": "<h4>2.1.1</h4>\n<ul>\n<li><strong>Bugfixes for Elementor</strong>\n<ul>\n<li>Added &#8216;swarmify://&#8217; protocol type to allowed list in Elementor</li>\n<li>Also fixed a broken link to the settings page</li>\n</ul>\n</li>\n</ul>\n<h4>2.1.0</h4>\n<ul>\n<li><strong>Improved New Admin Interface</strong>\n<ul>\n<li>The same top-notch video playing and CDN, with a more modern admin panel</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.25</h4>\n<ul>\n<li><strong>WordPress 6.3 Updates</strong>\n<ul>\n<li>Updated for enhanced compatibility with the latest version of WordPress 6.3</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.24</h4>\n<ul>\n<li><strong>WordPress 5.9 Updates</strong>\n<ul>\n<li>Updated for enhanced compatibility with the latest version of WordPress 5.9.3</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.23.2</h4>\n<ul>\n<li><strong>Welcome Tatum(WP 5.8)</strong>\n<ul>\n<li>WordPress 5.8 is out with many new and awesome features. SmartVideo fully supports this new version so worry not. Have your cake and eat it too! Yum</li>\n<li>Fixing an Elementor bug that caused unseemly warnings to appear while in dev mode. Can&#8217;t have that now.</li>\n<li>Added some minor fixes for 5.8.1</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.22</h4>\n<ul>\n<li><strong>Fairy dust magic for better PageSpeed Scores (FCP, LCP, CLS)</strong>\n<ul>\n<li>We&#8217;re going to be straight with you, this brings some magic pixie dust which will boost your Web Vitals. But you are boosting the score only and not actually changing anything real with the performance of the site. So if the score is important to you, then this will make you happy. But don&#8217;t fool yourself into thinking anything changed in actual speed, it just tests better and unfortunately a lot of people are judging yours and our works by a number generated by Google which currently doesn&#8217;t have a basis in reality. Hence us putting out this update because fair or not, people gonna judge.</li>\n<li>For more reading on the current problems in Web Vitals:</li>\n<li><a href=\"https://swarmify.idevaffiliate.com/idevaffiliate.php?id=10275&amp;url=53\" rel=\"nofollow ugc\">Framehole: PageSpeed 6.0 loophole for easy perfect score</a></li>\n<li><a href=\"https://www.devisedlabs.com/blog/largest-contentful-paint-lcp-hack\" rel=\"nofollow ugc\">Get a perfect Largest Contentful Paint (LCP) time with a single line of code</a></li>\n<li>Also fixed a minor bug(z-index) in the layout of our Classic Widget causing you to be unable to pick from your Media Library. Sorry about that and hat tip to Mirco for pointing it out!</li>\n<li>You&#8217;re among friends here. You are going to update for the PageSpeed Score improvement aren&#8217;t you? No judgement here, do what you need to do because business is a contact sport.</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.21</h4>\n<ul>\n<li><strong>2020 is nevermore, so it&#8217;s time for 2.0.21</strong>\n<ul>\n<li>Look, everyone wants to forget 2020 and move forward to a better future in 2021. But our developers had one problem, Some how, some way, our plugin just happened to be at version 2.0.20. It was like a continuous nightmare where everytime we thought we were done with 2020, there it is again in our face. So what do developers do when faced with a problem&#8230;&#8230;they solve it. We present the fresh new version 2.0.21. And just like the new year brings fresh optimism, so too did this version for our developers. Now they feel cheery, and ready to take on the world. Basically like they just finished a double espresso.</li>\n<li>Features&#8230;.well this version brings inspiration, hope, and&#8230;&#8230;some minor housekeeping fixes. Really let&#8217;s be honest, we are all ready for change, so here it is, version 2.0.21. Can&#8217;t be any worse than the last one right?</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.20</h4>\n<ul>\n<li><strong>CSS Conflict resolution update</strong>\n<ul>\n<li>What happens when different plugins have a CSS conflict? If you answered Style Battle Royale, well then you are an interesting person who is probably fun at parties. But if you answered,  &#8220;<em>shrug</em> things probably break?&#8221; You would be correct. Our new release prevents these style sheet conflicts where our player and your theme&#8217;s video player just couldn&#8217;t get along. Now they at least they are divided by a wall and can only stare angrily across the room.</li>\n<li>Namespaced the SmartVideo player CSS styles so that conficts between our video player and those included via your theme or other plugins should be eliminated. But there may be some sneaky conflicts we missed and if you see them, just reach out to support so we can take care of them. Thanks!</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.19</h4>\n<ul>\n<li><strong>No need to fear, dynamic tags are here</strong>\n<ul>\n<li>Need to template up your massive video archive so that each post displays with the associated video in a SmartVideo tag. Easy breezy if you are an Elementor Pro user. Our SmartVideo widget can now dynamically load both the video source and/or poster image from any Elementor Pro dynamic tag. Quick, efficient, and beautiful</li>\n<li>Elementor SmartVideo widget supports <a href=\"https://elementor.com/help/dynamic-tags-pro/\" rel=\"nofollow ugc\">dynamic tags</a> for Elementor Pro users</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.18</h4>\n<ul>\n<li><strong>Now you see me, now you don&#8217;t</strong>\n<ul>\n<li>Sometimes it&#8217;s fun to revert to our inner child and play games like hide &amp; seek. Try it, we&#8217;ll wait. You really needed that, right? While games are good for humans, it&#8217;s not good for our Gutenberg block editor to play hide &amp; seek with your block attributes. Naughty code was hiding the URL you set when you specified direct video URL&#8217;s in our SmartVideo block. Don&#8217;t worry we had a talk with the code, and it will never hide this data again. Also, rest assured everything is in there from previous blocks you have inserted, it was just&#8230;..hidden.</li>\n<li>Gutenberg block editor was not showing the URL&#8217;s you previously set for videos when you chose the &#8220;Another source&#8221; option. This has been fixed.</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.17</h4>\n<ul>\n<li><strong>Crouching tiger, hidden classic</strong>\n<ul>\n<li>Fixed issue with SmartVideo Classic widget where you would click to specify a YouTube video and the popup to enter it would never show up</li>\n<li>For those without that problem, well now is a great time to turn on automatic updates for our plugin if you have the new WordPress 5.5 release. That way if a future update fixes a problem you have, then it gets installed automatically. Like robots, but in the cloud&#8230;</li>\n<li>Adjusted for deprecated jquery functionality</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.15</h4>\n<ul>\n<li><strong>Tested for the fresh WordPress release coming soon &#8230; WP 5.5 Codename: WFH &#8212; Stay Safe &amp; Sane</strong>\n<ul>\n<li>Updated testing for the latest WordPress builds so you can confidently install and get your video on</li>\n<li><em>Disclaimer: Not responsible for overconfidence or lack there of in the actual videos. That part is up to you. We believe in you though!!!</em></li>\n</ul>\n</li>\n</ul>\n<h4>2.0.14</h4>\n<ul>\n<li><strong>Trimming down for speed</strong>\n<ul>\n<li>Fixed a bug causing extra stylesheets to get included in frontend output. I mean we&#8217;re stylish, but no need for excess styling!</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.13</h4>\n<ul>\n<li><strong>Pro lovin, for our Pro Customers</strong>\n<ul>\n<li>All of the Swarmlings: Moved lesser used options to a collapsed <code>Advanced Options</code> panel because everyone likes a tidy settings page, right?</li>\n<li>Pro Customers: Configure a watermark for your video. It can be your logo, your friends logo, or even a disco dancing dog gif if that&#8217;s your style</li>\n<li>Pro Customers: Looking to level up your YouTube revenue and take control of your own ads. Well we made that simple with our javascript snippet, but who wants to figure out that gobbledy gook. You are using our WordPress plugin to simplify, and now you can configure your ad platform URL directly in the plugin.</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.12</h4>\n<ul>\n<li><strong>Sometimes you need MOAR POWER</strong>\n<ul>\n<li>You can now statically configure the Swarmify CDN key in advance from your &#8216;wp-config.php&#8217; file. Just define the constant <code>SWARMIFY_CDN_KEY</code> and set it to your key. Config-&gt;Done</li>\n<li>Elementor Pro giving you heartburn when used with our widget, antacid has arrived. We worked out an issue causing Elementor Pro&#8217;s form widget to run itself out of memory. </li>\n</ul>\n</li>\n</ul>\n<h4>2.0.11</h4>\n<ul>\n<li><strong>WordPress host wants you to upload slower, fine we can make that happen</strong>\n<ul>\n<li>Added a toggle in the settings to disable our upload acceleration if your WordPress host has issues with it. </li>\n<li>We wish they would just adjust on their side, but we can be flexible so now you can turn this off in the settings if its giving your web host heartburn 😉</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.10</h4>\n<ul>\n<li><strong>Watch video faster for those who enjoy chipmunk voices</strong>\n<ul>\n<li>Why would you want the video to play at 1.25x, 1.5x, 2x speeds? Well because you were a fan of those Chipmunk albums where you could listen to popular music sung in a high squeaky voice.</li>\n<li>Or it may just be your customers enjoy watching at differing paces. That must be the reason because nobody likes chipmunks, right? Alvin, alvin, ALVIN?</li>\n<li>All SmartVideo players now allow viewers to change the playback speed to suit their preferences.</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.9</h4>\n<ul>\n<li><strong>Too much speed!!!</strong>\n<ul>\n<li>Some hosts weren&#8217;t ready for maximum upload acceleration so they put on the brakes and prevented media file uploads. Now we detect these slowpokes and kindly slow down from insanely fast to somewhat crazy fast upload speeds.</li>\n<li>If you were having trouble with uploads after previous update, that should be fixed now 😉</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.8</h4>\n<ul>\n<li><strong>Closed minded no more</strong>\n<ul>\n<li>Display closed captions on all YouTube source videos&#8230; Or don&#8217;t. It&#8217;s up to you with a new plugin setting that enables imported captions from your YouTube videos to be shown at the click of a button. (Don&#8217;t worry, manual closed caption config is coming soon&#8230;&#8230;)</li>\n<li>Accelerate your video uploads with new faster, better, stronger video uploading behind the scenes. Uploading videos to use in your WordPress media library will be faster and smoother than ever</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.6</h4>\n<ul>\n<li><strong>Elementary my dear Beaver</strong>\n<ul>\n<li>Quoting for the SmartVideo widget in Elementor and Beaver Builder was not so smart. But we educated it and all of your quoting issues have been resolved.</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.5</h4>\n<ul>\n<li><strong>Oldie but goodie</strong>\n<ul>\n<li>Fixed a bug causing WordPress versions &lt; 4.9 to have issues with our plugin. We&#8217;re sorry Classic, you are still loved!</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.4</h4>\n<ul>\n<li><strong>Hex a Gone?</strong>: Some users have a dislike for 6 sided polygons. We are partial to them ourselves, but realize everyone has the right to the basics of life, liberty, and choice of play button shapes.</li>\n<li><strong>Change play button shapes</strong>:\n<ul>\n<li>Hexagon &#8211; Our personal favorite</li>\n<li>Circle &#8211; For those inclined to a single side</li>\n<li>Rectangle &#8211; Do you like 4 sides and the golden ratio, then this is for you!</li>\n</ul>\n</li>\n</ul>\n<h4>2.0.3</h4>\n<ul>\n<li><strong>Divi&#8217;ded we fall</strong>: If your theme colors weren&#8217;t working properly in Divi, they are now!</li>\n</ul>\n<h4>2.0.2</h4>\n<ul>\n<li><strong>Vime &#8216;ode to our customers</strong>: It would be really neat if this could autoconvert all Vimeo videos like it does for YouTube, you said. Well maybe not you, but some people said this. And our answer, done! Our global autoconvert toggle now handles converting Vimeo and YouTube videos throughout your site. All without needing to get your hands dirty with any pesky template editing.</li>\n</ul>\n<h4>2.0.1</h4>\n<ul>\n<li><strong>Classic is still cool</strong>: Fixed a bug with our Classic Editor widget where the edit window wouldn&#8217;t close when you clicked &#8220;Insert into Post&#8221;. That wasn&#8217;t very awesome at all. So we fixed it, and now our classic widget is 20% cooler.</li>\n<li>Fixed some minor casing inconsistencies so that we can be more consistent 🙂</li>\n</ul>\n<h4>2.0.0</h4>\n<ul>\n<li><strong>Codename: Van Gogh</strong>\n<ul>\n<li>All of the pretty native widgets you want</li>\n<li>Less of those pesky ears!!</li>\n<li>You wanted modern native widgets for all your favorite page builders, and we are here to deliver.</li>\n</ul>\n</li>\n<li><strong>Native widgets for:</strong>\n<ul>\n<li><strong>Gutenberg</strong> &#8211; For when <em>blocks</em> are your thing</li>\n<li><strong>Divi Builder</strong> &#8211; Fancy style, drag and drop, and now the world&#8217;s fastest video</li>\n<li><strong>Elementor</strong> &#8211; Adding the best video is now elemental my dear Watson</li>\n<li><strong>Beaver Builder</strong> &#8211; Chuck slow wooden, video players out the window. And upgrade your video to the player that will make you say <em>dam</em></li>\n</ul>\n</li>\n<li><strong>Automatic Vimeo Import</strong> &#8211; All widgets allow for simple import of your legacy Vimeo content. This is of course in addition to our existing support for YouTube, Amazon S3, Media Library, and more!!</li>\n<li><strong>Easier to find Settings Panel</strong> &#8211; If you ever forgot where to configure your account, we feel you. We always lost track of where the settings were at. No more searching in menus for settings. Now it&#8217;s front and center in your WordPress Admin</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Awesome Color Picker for video player color customization now in settings</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Significantly increased Lighthouse &amp; Pagespeed scores with our enhanced embed engine</li>\n<li>Extreme Video Theme Optimization &#8211; Automatically optimize and accelerate your theme&#8217;s background videos. Never face slow loading video again</li>\n</ul>\n<h4>1.1.7</h4>\n<p>Bug fixes</p>\n<h4>1.1.4</h4>\n<p>Adds widgets for standard WP editor, Beaver Builder, Elementor, and KingComposer</p>\n<h4>1.0.2</h4>\n<p>Moves scripts from body to head</p>\n<h4>1.0.1</h4>\n<p>Minor link updates</p>\n<h4>1.0</h4>\n<p>Initial version</p>\n",
        "description": "<p>Video player and unlimited video hosting built to work for WordPress users</p>\n<h3>Why use this video player plugin?</h3>\n<h3>A Way To:</h3>\n<ul>\n<li><strong>Add Video</strong> to your site in seconds</li>\n<li><strong>Improve PageSpeed Scores</strong>. Optimized to ensure faster page loading than typical embeds</li>\n<li><strong>Speed Up Video Load Times</strong>. In fact, SmartVideo is 12 times faster than YouTube.</li>\n<li>Give visitors <strong>Buffer-Free Playback</strong>. </li>\n<li><strong>Convert your YouTube &amp; Vimeo Embeds</strong> with zero work on your part. (Don’t use YouTube? No problem.)</li>\n<li><strong>Add Branding</strong> and your color scheme to videos.</li>\n<li>Beautiful video widgets for <strong>Elementor, Gutenberg, Beaver Builder, and Divi</strong></li>\n<li>Give visitors what <em>you</em> want to give them. <strong>No traffic leaks</strong> or “Recommended Videos”.</li>\n<li><strong>Use Our Global Delivery Network</strong>, where we are serving the fastest streams anywhere on the planet</li>\n<li><strong>Professionally Encode</strong> every video without a thought.</li>\n<li>Use the most responsive player that optimizes for all desktop, tablet, and mobile devices</li>\n<li><strong>Make Money</strong> with our ad network integration &#8211; easily add your VAST Ad URL to start making money on your content </li>\n</ul>\n<h3>Here are some things you can do with SmartVideo:</h3>\n<ul>\n<li>Add a poster image</li>\n<li>Make a video autoplay</li>\n<li>Speed up a background video</li>\n<li>Make a video loop</li>\n<li>Turn controls on or off</li>\n<li>Prevent browsers from forcing full-screen playback</li>\n<li>And much, much more&#8230;</li>\n</ul>\n<h3>SmartVideo is for users that:</h3>\n<ul>\n<li>Need fast, clean video for WordPress</li>\n<li>Want a WordPress video plugin that does all the heavy lifting</li>\n<li>Need WordPress video hosting that won’t break the bank</li>\n<li>Need a WordPress YouTube plugin that converts embeds automatically</li>\n<li>Are tired of slow WordPress video load speeds affecting their site </li>\n</ul>\n<h4>Additional Info</h4>\n<p>It&#8217;s now easier than ever to get professional, fast videos on your site! Our SmartVideo plugin enables easy video player insertion, giving you total control of your videos in an effortless tool. The plugin also provides widgets compatible with the standard WordPress editor, Gutenberg, the classic editor, Beaver Builder, Elementor, and Divi. Let us know what you think!</p>\n<p>Tired of your brand being overshadowed by YouTube’s on your own site? Eliminate unwanted overlays, watermarks and recommended videos that distract visitors from your content and leak traffic. Graduate in just a few minutes.</p>\n<p>SmartVideo gives your visitors clean, accelerated, professional playback that loads fast and won&#8217;t bog your site down. Capture your visitors’ attention and generate more clients, leads, bookings, or sales.</p>\n<p>With SmartVideo, WordPress users can create clean, fast, professional video experiences in a matter of minutes. SmartVideo is cross-platform and supports all video files. It’s built on open source technology enhanced with proprietary streaming EdgeAI. It optimizes audio and video for both desktop and mobile. After installing the plugin and running through a brief setup, everything just works––automatically!</p>\n<p>SmartVideo is for site owners that want super fast, Netflix-level video load speeds and quality, but can’t spend the time and effort needed to integrate with players, encoding services, and CDN’s. Don’t weigh your site down with ordinary players.</p>\n<p>At Swarmify, we believe that adding video to your website should be as easy as adding an image. Simply install our plugin, and boom, we optimize your videos for the highest quality. All video and audio playback works seamlessly. Your users can watch crystal-clear videos with no slowdowns or buffering.</p>\n<p>There’s no encoding, no API, no uploading, no choosing bitrates, and no programmer required. It&#8217;s the video experience WordPress users have always deserved.</p>\n<p>Of course, behind the scenes, our software handles all the Internet complexities so you don’t have to.  SmartVideo works to provide 8x less buffering, stall-outs and pixelated playbacks than competing video players, and keeps the quality sharp and clear. And if you already have YouTube embeds on your site, the SmartVideo plugin will auto-convert all YouTube embeds to our clean, fast SmartVideo technology. No work needed on your end.</p>\n<h3>Install SmartVideo and start free today!</h3>\n<p>Video formats supported: MP4, M3U8, HLS, MPEG-DASH, WEBM, and VP 8/9 file formats.</p>\n<p>Audio formats supported: MP3, AAC, OPUS</p>\n"
    },
    "short_description": "Video player and unlimited video hosting built to work for WordPress users",
    "description": "<p>Video player and unlimited video hosting built to work for WordPress users</p>\n<h3>Why use this video player plugin?</h3>\n<h3>A Way To:</h3>\n<ul>\n<li><strong>Add Video</strong> to your site in seconds</li>\n<li><strong>Improve PageSpeed Scores</strong>. Optimized to ensure faster page loading than typical embeds</li>\n<li><strong>Speed Up Video Load Times</strong>. In fact, SmartVideo is 12 times faster than YouTube.</li>\n<li>Give visitors <strong>Buffer-Free Playback</strong>. </li>\n<li><strong>Convert your YouTube &amp; Vimeo Embeds</strong> with zero work on your part. (Don’t use YouTube? No problem.)</li>\n<li><strong>Add Branding</strong> and your color scheme to videos.</li>\n<li>Beautiful video widgets for <strong>Elementor, Gutenberg, Beaver Builder, and Divi</strong></li>\n<li>Give visitors what <em>you</em> want to give them. <strong>No traffic leaks</strong> or “Recommended Videos”.</li>\n<li><strong>Use Our Global Delivery Network</strong>, where we are serving the fastest streams anywhere on the planet</li>\n<li><strong>Professionally Encode</strong> every video without a thought.</li>\n<li>Use the most responsive player that optimizes for all desktop, tablet, and mobile devices</li>\n<li><strong>Make Money</strong> with our ad network integration &#8211; easily add your VAST Ad URL to start making money on your content </li>\n</ul>\n<h3>Here are some things you can do with SmartVideo:</h3>\n<ul>\n<li>Add a poster image</li>\n<li>Make a video autoplay</li>\n<li>Speed up a background video</li>\n<li>Make a video loop</li>\n<li>Turn controls on or off</li>\n<li>Prevent browsers from forcing full-screen playback</li>\n<li>And much, much more&#8230;</li>\n</ul>\n<h3>SmartVideo is for users that:</h3>\n<ul>\n<li>Need fast, clean video for WordPress</li>\n<li>Want a WordPress video plugin that does all the heavy lifting</li>\n<li>Need WordPress video hosting that won’t break the bank</li>\n<li>Need a WordPress YouTube plugin that converts embeds automatically</li>\n<li>Are tired of slow WordPress video load speeds affecting their site </li>\n</ul>\n<h4>Additional Info</h4>\n<p>It&#8217;s now easier than ever to get professional, fast videos on your site! Our SmartVideo plugin enables easy video player insertion, giving you total control of your videos in an effortless tool. The plugin also provides widgets compatible with the standard WordPress editor, Gutenberg, the classic editor, Beaver Builder, Elementor, and Divi. Let us know what you think!</p>\n<p>Tired of your brand being overshadowed by YouTube’s on your own site? Eliminate unwanted overlays, watermarks and recommended videos that distract visitors from your content and leak traffic. Graduate in just a few minutes.</p>\n<p>SmartVideo gives your visitors clean, accelerated, professional playback that loads fast and won&#8217;t bog your site down. Capture your visitors’ attention and generate more clients, leads, bookings, or sales.</p>\n<p>With SmartVideo, WordPress users can create clean, fast, professional video experiences in a matter of minutes. SmartVideo is cross-platform and supports all video files. It’s built on open source technology enhanced with proprietary streaming EdgeAI. It optimizes audio and video for both desktop and mobile. After installing the plugin and running through a brief setup, everything just works––automatically!</p>\n<p>SmartVideo is for site owners that want super fast, Netflix-level video load speeds and quality, but can’t spend the time and effort needed to integrate with players, encoding services, and CDN’s. Don’t weigh your site down with ordinary players.</p>\n<p>At Swarmify, we believe that adding video to your website should be as easy as adding an image. Simply install our plugin, and boom, we optimize your videos for the highest quality. All video and audio playback works seamlessly. Your users can watch crystal-clear videos with no slowdowns or buffering.</p>\n<p>There’s no encoding, no API, no uploading, no choosing bitrates, and no programmer required. It&#8217;s the video experience WordPress users have always deserved.</p>\n<p>Of course, behind the scenes, our software handles all the Internet complexities so you don’t have to.  SmartVideo works to provide 8x less buffering, stall-outs and pixelated playbacks than competing video players, and keeps the quality sharp and clear. And if you already have YouTube embeds on your site, the SmartVideo plugin will auto-convert all YouTube embeds to our clean, fast SmartVideo technology. No work needed on your end.</p>\n<h3>Install SmartVideo and start free today!</h3>\n<p>Video formats supported: MP4, M3U8, HLS, MPEG-DASH, WEBM, and VP 8/9 file formats.</p>\n<p>Audio formats supported: MP3, AAC, OPUS</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/smartvideo.zip",
    "upgrade_notice": {
        "1.2.1": "<ul>\n<li>Awesome Color Picker for video player color customization now in settings</li>\n</ul>",
        "1.2.0": "<ul>\n<li>Significantly increased Lighthouse &amp; Pagespeed scores with our enhanced embed engine</li>\n<li>Extreme Video Theme Optimization - Automatically optimize and accelerate your theme&#039;s background videos. Never face slow loading video again</li>\n</ul>",
        "1.1.7": "<p>All users of 1.1.4 should upgrade.</p>",
        "1.1.4": "<p>You should upgrade if you want more control over video parameters, you are using non-YouTube videos, or you are using Beaver Builder, Elementor, or KingComposer.</p>",
        "1.0.2": "<p>You should upgrade if you are experiencing visible delays in the conversions from standard video tags/YouTube to SmartVideo.</p>",
        "1.0.1": "<p>You should upgrade only if you have not signed up for a Swarmify account.</p>",
        "1.0": "<p>You should upgrade from no plugin if you want to accelerate your videos, of course :)</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/smartvideo/assets/screenshot-1.png?rev=2163219",
            "caption": "Introduction"
        },
        {
            "src": "https://ps.w.org/smartvideo/assets/screenshot-2.png?rev=2163219",
            "caption": "Automagically convert YouTube"
        },
        {
            "src": "https://ps.w.org/smartvideo/assets/screenshot-3.png?rev=2163219",
            "caption": "Plugin settings dashboard"
        },
        {
            "src": "https://ps.w.org/smartvideo/assets/screenshot-4.png?rev=2163219",
            "caption": "Add your account key"
        },
        {
            "src": "https://ps.w.org/smartvideo/assets/screenshot-5.png?rev=2163219",
            "caption": "Set up the plugin options"
        }
    ],
    "tags": {
        "cdn": "cdn",
        "smartvideo": "smartvideo",
        "swarmify": "swarmify",
        "video-player": "video player",
        "youtube": "youtube"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/smartvideo.1.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/smartvideo.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/smartvideo.1.0.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/smartvideo.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/smartvideo.1.1.4.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/smartvideo.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/smartvideo.1.1.8.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/smartvideo.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/smartvideo.1.2.1.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/smartvideo.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/smartvideo.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/smartvideo.2.0.2.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/smartvideo/assets/banner-772x250.png?rev=2163219",
        "high": "https://ps.w.org/smartvideo/assets/banner-1544x500.png?rev=2163219"
    },
    "icons": {
        "1x": "https://ps.w.org/smartvideo/assets/icon.svg?rev=2163219",
        "svg": "https://ps.w.org/smartvideo/assets/icon.svg?rev=2163219"
    },
    "blocks": {
        "extension/smartvideo": {
            "$schema": "https://schemas.wp.org/trunk/block.json",
            "apiVersion": 3,
            "name": "extension/smartvideo",
            "version": "2.1.0",
            "title": "Smartvideo",
            "category": "widgets",
            "textdomain": "swarmify",
            "editorScript": "file:./build/index.js",
            "editorStyle": "file:./build/index.css",
            "style": "file:./build/style-index.css"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 78,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}