{
    "name": "WooCommerce Wishlist (High customization, fast setup,Free Elementor Wishlist, most features)",
    "slug": "smart-wishlist-for-more-convert",
    "version": "1.8.2",
    "author": "<a href=\"https://moreconvert.com\">MoreConvert</a>",
    "author_profile": "https://profiles.wordpress.org/moreconvert/",
    "contributors": {
        "moreconvert": {
            "profile": "https://profiles.wordpress.org/moreconvert/",
            "avatar": "https://secure.gravatar.com/avatar/4aec5812e3db8673416ae1130567d24a?s=96&d=monsterid&r=g",
            "display_name": "moreconvert"
        }
    },
    "requires": "5.8",
    "tested": "6.6.1",
    "requires_php": "7.2.5",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 81,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 81,
    "support_url": "https://wordpress.org/support/plugin/smart-wishlist-for-more-convert/",
    "support_threads": 1,
    "support_threads_resolved": 1,
    "active_installs": 4000,
    "downloaded": 48177,
    "last_updated": "2024-07-29 12:25pm GMT",
    "added": "2021-07-19",
    "homepage": "https://moreconvert.com/smart-wishlist-for-more-convert",
    "sections": {
        "description": "<p>🚀 <strong>Supercharge your WooCommerce sales</strong> with the MoreConvert WooCommerce Wishlist plugin. How? Read on to find out!</p>\n<p><strong>Free Version:</strong><br />\n&#8211; <strong>WooCommerce Wishlist:</strong> Create wishlists easily.<br />\n&#8211; Beautiful icons in various positions + shortcodes<br />\n&#8211; <strong>Elementor Widgets:</strong> Customize with Elementor<br />\n&#8211; <a href=\"https://moreconvert.com/integrations//?utm_source=wordpressorg&amp;utm_content=preview\" rel=\"nofollow ugc\"><strong>Over 100 integrations</strong> with plugins and themes.</a><br />\n&#8211; High customization and fast setup.</p>\n<p>📚 <strong><a href=\"https://moreconvert.com/docs/wishlist/?utm_source=wordpressorg&amp;utm_content=documentation\" rel=\"nofollow ugc\">DOCUMENTATION</a></strong> |✨ 23 Significant Update in 2023 |⚡ Swift and Attentive Support Team</p>\n<p><strong>Premium Version:</strong><br />\n&#8211; Back-in-Stock Notifier: Alert when items return.<br />\n&#8211; Save Cart for later: Retain shopping carts.<br />\n&#8211; Advanced Analytics: Uncover user insights.<br />\n&#8211; Email Campaigns &amp; Automation: Targeted emails, automated.<br />\n&#8211; And over 47 other cool and useful options.</p>\n<p>🌟 <a href=\"https://moreconvert.com/demo-signup/?utm_source=wordpressorg&amp;utm_content=preview\" rel=\"nofollow ugc\">TRY MC Woocommerce Wishlist <strong>PREMIUM</strong> For <strong>FREE</strong> </a></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/kFrdOcpZ8ZE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3><strong>Free Version Details</strong></h3>\n<ul>\n<li><strong>Wishlist Buttons</strong> and <strong>Wishlist Page</strong> for Woocommerce</li>\n<li><strong>Wishlist counter</strong> similar to the WooCommerce mini cart.</li>\n<li><strong>Elementor widget</strong> for the Wishlist page, Add to Wishlist Button, and the counter/mini Wishlist.</li>\n<li><strong>WordPress widget</strong> for the counter.</li>\n<li>Support for Woocommerce <strong>Variable products</strong> and integration with most addons.</li>\n<li><strong>Share the wishlist</strong> on social media, via link, or export it as a PDF.</li>\n<li><strong>Easily change all words</strong> without translator plugins.</li>\n<li><strong>Quick Wizard</strong> for fast configuration.</li>\n<li><strong>Login/signup invitation</strong> for unregistered users.</li>\n<li><strong>Full customization options</strong> for the front-end, including all sections of the Wishlist page, buttons, counters, icons, etc.</li>\n<li><strong>Change button text</strong> after adding a product to the wishlist.</li>\n<li>Well-designed <strong>icons for the woocommerce wishlist plugin button</strong>.</li>\n<li>Button type options: <strong>icon, text, or both</strong>.</li>\n<li><strong>Button tooltip</strong> for product pages and shop pages.</li>\n<li><strong>Customizable share icon color</strong>.</li>\n<li><strong>Enable/disable automatic removal</strong> of products from the woocommerce wishlist and moving them to the cart after purchase.</li>\n<li><strong>Enable/disable WooCommerce Wishlist functionality</strong> for unregistered users.</li>\n<li>Choose the wishlist button action: either a <strong>popup or direct redirection</strong> to the wishlist page.</li>\n<li><strong>Customizable appearance</strong> for the wishlist redirecting pop-up, including text and image.</li>\n<li>Handling of <strong>out-of-stock products</strong> in the wishlist button management.</li>\n<li>Ability to <strong>add the entire wishlist to the cart</strong>.</li>\n<li>Use <strong>shortcodes</strong> for desired button placement.</li>\n<li>Simplified behavior for &#8220;remove from wishlist&#8221; action (removal on the second click).</li>\n<li><strong>Add to Menu functionality</strong> with a single click on the counter.</li>\n<li>Four options for <strong>placing the counter number</strong>.</li>\n<li><strong>Shortcodes and widgets</strong> available for the counter.</li>\n<li><strong>Customizable counter</strong> (text, icon, color) for the add to menu feature.</li>\n<li><strong>Automation emails for wishlist</strong>: status updates and purchase invites.</li>\n<li><strong>Set conditions</strong> based on WooCommerce Wishlist status, products, or prices for email automation.</li>\n<li><strong>Schedule five customizable emails</strong> with different templates to boost sales.</li>\n<li><strong>Define automatic discount coupons</strong> with expiration dates and auto-deletion.</li>\n<li><strong>Email automation stops after coupon use</strong> and user&#8217;s purchase.</li>\n<li><strong>Personalize Notif and follow-up emails</strong> for users, allow unsubscribing.</li>\n<li><strong>Custom CSS styles</strong>.</li>\n<li><strong>Import and Export</strong> plugin settings.</li>\n<li>Fast <strong>AJAX interaction</strong> for all frontend events.</li>\n<li><strong>Compatibility with popular themes</strong> and page builders such as Gutenberg, Elementor, Divi, Astra, Storefront, OceanWP, Flatsome, and more.</li>\n<li><a href=\"https://moreconvert.com/integrations//?utm_source=wordpressorg&amp;utm_content=preview\" rel=\"nofollow ugc\"><strong>Over 100 integrations</strong> with plugins and themes.</a></li>\n<li>Advanced <strong>cache-friendly functionality</strong>.</li>\n<li><strong>Translation-ready</strong> and compatible with all translation plugins.</li>\n<li><strong>Customize the wishlist table page</strong> to display product image, name, review, price, discount, stock status, quantity, date added, and variations.</li>\n<li><strong>Customizable appearance for the add to wishlist button</strong>, including options for different icons, text, color, size, border, and more.</li>\n<li><strong>Change WooCommerce Wishlist button position</strong> on product and shop pages.</li>\n<li><strong>Mini Wishlist</strong> for the counter and sidebar widget.</li>\n</ul>\n<h3><strong>Premium Version Details</strong></h3>\n<p>🔒 <strong>Advanced WooCommerce Wishlist features</strong><br />\n&#8211; <strong>Popup for sharing options</strong>.<br />\n&#8211; <strong>Selectable list layouts</strong> by users (<strong>grid or list</strong>).<br />\n&#8211; Shortcode for User Counter on Wishlist on the product page<br />\n&#8211; Move Products between Lists<br />\n&#8211; Drag and Drop items among List<br />\n&#8211; Copy Products from other shared Lists to your List<br />\n&#8211; Toast Style Management<br />\n&#8211; Open New Tab For External Product Add To Cart for affiliate shops<br />\n&#8211; Total price with three style (classic, marketing, modern) and different position and style.</p>\n<p>🔒 <strong>WooCommerce Unlimited lists</strong> (Bookmark system/or use as Bundle builder)<br />\nAll Advanced and free WooCommerce Wishlist features plus:<br />\n&#8211; <strong>Customize names and descriptions</strong> for each list.<br />\n&#8211; <strong>Add or move products between multiple lists</strong>.<br />\n&#8211; <strong>Choose whether to make lists public or private</strong>.<br />\n&#8211; <strong>Attractive display in the WooCommerce My Account section</strong>.<br />\n&#8211; <strong>Additional dedicated button</strong> to encourage user engagement and lead generation.<br />\n&#8211; <strong>Sharing feature as popup or under the lists</strong>.<br />\n&#8211; <strong>Dedicated counter</strong> with all customizable options and mini lists.</p>\n<p>🔒 WooCommerce Waitlist options<br />\n&#8211; <strong>All WooCommerce Wishlist Features</strong><br />\n&#8211; <strong>Dedicated Waitlist Button</strong>, <strong>Wishlist Page</strong> and <strong>Counter</strong> for Woocommerce<br />\n&#8211; <strong>Email Notifier</strong> for Back in Stock, Limited Stock, Price Changes, and Special Sales<br />\n&#8211; <strong>Email Automation</strong> with Five Follow-ups<br />\n&#8211; <strong>Product-Specific Email Automation</strong> for Variable Products in All Modes (Back in Stock, Limited Stock, Price Change, Special Sale)<br />\n&#8211; <strong>Create Combined Conditions</strong> for Email Campaigns and Automation based on User Behavior in Wishlist, Waitlist, Shopping Cart, and Multilist, and User Status and Purchase History.<br />\n&#8211; <strong>Exclusive Out-of-Stock Product Box</strong> with Two Customizable Styles</p>\n<p>🔒 Next purchase cart for save cart for later<br />\n&#8211; Secret <strong>Next Purchase Cart Button</strong><br />\n&#8211; Add <strong>Next Purchase Cart</strong> under cart table or in Separate Tab<br />\n&#8211; <strong>Pop-up Prevents Removal</strong> from Cart and Invites to Add to Next Shopping Cart<br />\n&#8211; <strong>Hide Next Purchase Cart Button</strong>, Show on Removal Request<br />\n&#8211; <strong>Customizable Buttons and Texts and Well-designed icons</strong> with Full Details<br />\n&#8211; <strong>Support for Changing and Out-of-Stock Products</strong><br />\n&#8211; <strong>Invitation Button</strong> for Similar Products When Unavailable in Next Purchase Cart<br />\n&#8211; <strong>Email Notifier</strong> with Automatic Follow-ups and Discount Code (Similar to Waitlist)<br />\n&#8211; Attractive and Professional Styles to Reduce Cart Removal<br />\n&#8211; Define for guests, users, or both<br />\n&#8211; Three styles to choose from for the save for later button position.<br />\n&#8211; Easily add products to cart with one click using &#8220;<strong>Save for Later</strong>&#8221; or remove them from the list.<br />\n&#8211; Option to include a prominent call-to-action bar with notification on top the list.<br />\n&#8211; Convenient &#8220;<strong>Add All to Cart</strong>&#8221; button on the cart page for added convenience.</p>\n<p>🔒 Comprehensive analytics<br />\n&#8211; <strong>Analyze Individual User Behavior</strong><br />\n&#8211; <strong>Filter, View and export Users</strong> based on Various Conditions (List</p>\n<p>Status, List Ownership, User Status, Previous Purchases, Combined Conditions)<br />\n&#8211; <strong>Save User Segments</strong> based on Categories<br />\n&#8211; <strong>Send Email Campaigns</strong> to Users with Category-based Filtering<br />\n&#8211; <strong>Check Users</strong> based on Lists and Previous Purchases<br />\n&#8211; <strong>Add Notes</strong> to Users for CRM Purposes<br />\n&#8211; <strong>View and Analyze List Indicators</strong> for Improved Sales<br />\n&#8211; <strong>View Lists of Individual Users</strong> with Various Condition.<br />\n&#8211; <strong>View Product Status</strong> in Each List and All Lists<br />\n&#8211; <strong>Identify Users</strong> of Specific Products<br />\n&#8211; <strong>Define Multiple Conditions</strong> for Analytics and Targeting High Sales Numbers without General Ads</p>\n<p>🔥 <strong><a href=\"https://moreconvert.com/pricing\" rel=\"nofollow ugc\">GET THE PREMIUM VERSION NOW!</a></strong></p>\n<p>🔒 Unlimited automated email sequences<br />\n&#8211; <strong>Define dozens of automated emails</strong> based on conditions from lists, purchase history, and user status.<br />\n&#8211; <strong>Create exclusive discount codes</strong> for each user with automatic deletion after purchase and customizable conditions.<br />\n&#8211; <strong>Set up five automatic follow-up emails</strong> with specific timings and various appearance templates.<br />\n&#8211; <strong>Generate automatic sales</strong> through email automation.<br />\n&#8211; View detailed <strong>click rate, open rate, and sales reports</strong> for each email automation.<br />\n&#8211; <strong>Automatically send emails</strong> using the website&#8217;s SMTP with a system to reduce server pressure.<br />\n&#8211; <strong>Personalize email content</strong> based on user characteristics and lists.<br />\n&#8211; <strong>Allow users to unsubscribe</strong> from email automation.<br />\n&#8211; <strong>Email automation stops after coupon use</strong> and user&#8217;s purchase.</p>\n<p>🔒 One-shot Email campaign<br />\n&#8211; <strong>Define dozens of one-time emails</strong> based on detailed conditions from lists, purchase history, and user status.<br />\n&#8211; <strong>Create exclusive discount codes</strong> for each user with automatic deletion after purchase and customization options.<br />\n&#8211; Schedule and send <strong>bulk emails</strong>.<br />\n&#8211; View detailed <strong>click rate, open rate, and sales reports</strong> for each email campaign.<br />\n&#8211; <strong>Automatically send emails</strong> using the website&#8217;s SMTP with a system to reduce server pressure.<br />\n&#8211; <strong>Personalize email content</strong> based on user characteristics and lists.<br />\n&#8211; <strong>Allow users to unsubscribe</strong> from email campaigns.</p>\n<p>More advanced features in the premium version include:</p>\n<ul>\n<li><strong>Display all lists</strong> on one page using tabs or different pages.</li>\n<li><strong>Enhanced settings for email marketing.</strong></li>\n<li><strong>Priority support and faster, comprehensive updates.</strong></li>\n<li>Compatible with a wider range of popular WordPress themes and plugins.</li>\n<li>Optimized for seamless desktop and mobile viewing experiences.</li>\n<li>Supports both simple and variable products.</li>\n</ul>\n<p>🌟 <strong><a href=\"https://moreconvert.com/demo-signup/?utm_source=wordpressorg&amp;utm_content=preview\" rel=\"nofollow ugc\">TRY THE FREE DEMO OF MC Wishlist PREMIUM</a></strong></p>\n<p>Why is <strong>this one plugin</strong> better than all those plugins out there?</p>\n<ul>\n<li>All these lists (<strong>waitlist, wishlist, multilist, save for later, etc.</strong>) have the same core, installing different plugins with disproportionate updates will slow down your site and <strong>cost</strong> and <strong>trouble</strong> increases <strong>you</strong>, we give you a much lighter plugin than the sum of those plugins, without conflicts with other plugins.</li>\n<li>The styling and graphics of the plugin are very flexible, professional and correctly coded, and without a single line of coding, you can add several different buttons to the product, store, and shopping cart pages in exactly the way you want.</li>\n<li>Other plugins store user data without any use, but <strong>we do not burden your database</strong>, but multiply the behavior of your users by analyzing this data professionally.</li>\n<li><strong>Monitor the user&#8217;s behavior</strong> on the store, products, and cart pages and give special offers to each user based on the user&#8217;s behavior, which will significantly increase your sales.</li>\n<li>You don&#8217;t need more traffic, you need a higher conversion rate, with this plugin you can easily increase your sales without the need for expensive email marketing servers and dozens of different plugins.</li>\n<li><strong>Strengthen customer loyalty</strong> with personalized lists, encourage repeat visits, and repeat purchases.</li>\n</ul>\n<p>🔥 <strong><a href=\"https://moreconvert.com/pricing\" rel=\"nofollow ugc\">GET THE PREMIUM VERSION NOW!</a></strong></p>\n<p>So, you&#8217;re probably wondering why this plugin is so awesome and necessary, right? Let me break it down for you:</p>\n<p>⚡ Get your customers excited about your products with a pre-launch waitlist or price drop alerts. It&#8217;s like giving them a backstage pass to exclusive deals, encouraging them to make purchases and feel like part of the inner circle.</p>\n<p>⚡ Create a sense of urgency by notifying customers when a product is running low in stock. They won&#8217;t want to miss out on their favorite items, so they&#8217;ll be motivated to buy before it&#8217;s too late!</p>\n<p>⚡ You can even offer price increase alerts, giving your customers a nudge to make timely purchases and avoid missing out on great prices.</p>\n<p>⚡ Ever had customers asking when certain products will be back in stock? Well, our plugin takes care of that too! Your customers will receive notifications when specific or similar products are back on the shelves.</p>\n<p>⚡ Say goodbye to complicated processes! Our plugin offers counter and mini lists options that make everything super simple and user-friendly.</p>\n<p>⚡ Oh, and did I mention that you can customize the appearance, sharing, and counters of the lists and buttons? It&#8217;s like having your own personalized, stylish assistant to handle it all.</p>\n<p>But wait, there&#8217;s more! This plugin brings a whole bunch of practical and useful benefits:</p>\n<p>🛒 <strong>Increase sales with saved carts:</strong><br />\nWith the &#8220;Save Cart for Later&#8221; feature, your customers can conveniently save their favorite items for future purchases. The Next Purchase Cart ensures that they won&#8217;t forget the products they love, leading to increased sales and customer satisfaction.</p>\n<p>📊 <strong>Comprehensive Analytics for Informed Decision-Making:</strong><br />\nTake your business intelligence to the next level with detailed analytics. Understand individual user behavior, segment users based on various conditions, and target high-sales opportunities without general ads. The plugin allows you to view product status in each list, identify users of specific products, and create multiple conditions for effective analytics.</p>\n<p>📈 <strong>Unlimited Automated Email Sequences:</strong><br />\nEngage your customers with personalized and automated email sequences. Define dozens of emails based on user lists, purchase history, and user status. Create exclusive discount codes, set up automatic follow-ups, and generate sales through targeted email campaigns. Monitor click rates, open rates, and sales reports for each email, ensuring a data-driven approach to your marketing strategy.</p>\n<p>📧 <strong>One-Shot Email Campaigns:</strong><br />\nFor one-time promotions, the plugin enables you to define one-time emails based on specific conditions. Schedule and send bulk emails, view detailed campaign reports, and personalize content based on user characteristics and lists. It&#8217;s a powerful tool to run effective and targeted promotional campaigns.</p>\n<p>🌐 <strong>Optimized for Desktop and Mobile:</strong><br />\nWhether your customers are browsing on a desktop or a mobile device, the MoreConvert WooCommerce Wishlist plugin provides a seamless and optimized experience. The responsive design ensures that users can easily interact with wishlists, waitlists, and more, enhancing their overall shopping experience.</p>\n<p>🌟 <strong>Why MoreConvert?</strong><br />\n&#8211; <strong>Lightweight Plugin:</strong> Combines multiple functionalities in a single, efficient plugin without slowing down your site.<br />\n&#8211; <strong>Flexible Styling:</strong> Professional and flexible styling options without the need for coding.<br />\n&#8211; <strong>Smart Data Handling:</strong> Analyze user behavior without burdening your database, providing actionable insights.<br />\n&#8211; <strong>Increased Conversion:</strong> Boost sales with personalized lists, encouraging repeat visits and purchases.<br />\n&#8211; <strong>Cost-Effective:</strong> A comprehensive solution that eliminates the need for multiple plugins and expensive email marketing servers.</p>\n<p>Ready to supercharge your WooCommerce sales and provide an exceptional shopping experience for your customers? 🚀 <strong><a href=\"https://moreconvert.com/pricing\" rel=\"nofollow ugc\">Get the Premium Version Now!</a></strong></p>\n<p>🔥 <strong><a href=\"https://moreconvert.com/demo-signup/?utm_source=wordpressorg&amp;utm_content=preview\" rel=\"nofollow ugc\">Try the Free Demo of MC Wishlist Premium</a></strong></p>\n<h3>Installation and use</h3>\n<ol>\n<li>Upload <code>smart-wishlist-for-more-convert.zip</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the Plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n<li>Make sure to disable caching on your checkout and thank you steps</li>\n<li>Watch the Video below to learn how to use the Plugin</li>\n</ol>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/56yvYqOh-Rw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n",
        "faq": "\n<dt id='what%20marketing%20features%20can%20i%20utilize%20in%20this%20plugin%3F'>\nWhat marketing features can I utilize in this Plugin?\n</h4>\n<p>\n<p>The MoreConvert WooCommerce Wishlist plugin enables you to increase sales by sending compelling email templates based on various user circumstances.</p>\n</p>\n<dt id='can%20my%20customers%20share%20their%20wishlists%20on%20social%20media%3F'>\nCan my customers share their Wishlists on social media?\n</h4>\n<p>\n<p>Absolutely! Customers can share their wishlists on social media platforms. They can even customize the title of their link before posting, adding a personal touch to their sharing experience.</p>\n</p>\n<dt id='does%20mc%20woocommerce%20wishlist%20plugin%20allow%20adding%20an%20%22add%20to%20wishlist%22%20button%20on%20the%20products%20on%20the%20shop%20page%20and%20archive%20pages%3F'>\nDoes MC WooCommerce Wishlist plugin allow adding an &#8220;add to wishlist&#8221; button on the products on the shop page and archive pages?\n</h4>\n<p>\n<p>Yes, you can showcase the &#8220;Add to Wishlist&#8221; button on various pages, including the shop page, category pages, product shortcodes, and product sliders. The flexibility extends to all locations where the WooCommerce products&#8217; loop is utilized.</p>\n</p>\n<dt id='can%20i%20customize%20the%20wishlist%20page%3F'>\nCan I customize the wishlist page?\n</h4>\n<p>\n<p>A: Certainly! The wishlist page is a simple template that you can override by placing the file template &#8220;wishlist.php&#8221; inside the &#8220;woocommerce&#8221; folder of your theme.</p>\n</p>\n<dt id='can%20i%20move%20the%20position%20of%20the%20%22add%20to%20wishlist%22%20button%3F'>\nCan I move the position of the &#8220;Add to wishlist&#8221; button?\n</h4>\n<p>\n<p>A: Absolutely! You have the flexibility to move the &#8220;Add to Wishlist&#8221; button to another default position or use the shortcode within your theme code.</p>\n</p>\n<dt id='can%20i%20change%20the%20style%20of%20the%20%22add%20to%20wishlist%22%20button%3F'>\nCan I change the style of the &#8220;Add to wishlist&#8221; button?\n</h4>\n<p>\n<p>A: Yes, customization options abound. You can modify the background, text, and border colors or apply custom CSS. Additionally, you can choose between using a link or a button for the &#8220;Add to Wishlist&#8221; feature.</p>\n</p>\n<dt id='wishlist%20page%20returns%20a%20404%20error.%20what%20should%20i%20do%3F'>\nWishlist page returns a 404 error. What should I do?\n</h4>\n<p>\n<p>If you encounter a 404 error for the wishlist page, try regenerating the wishlist page from Settings -&gt; Wishlist -&gt; Wishlist page Tab -&gt; change &#8220;Choose the Wishlist page&#8221; by simply saving them again.</p>\n</p>\n<dt id='have%20you%20encountered%20anomalies%20after%20the%20plugin%20update%20that%20did%20not%20exist%20in%20the%20previous%20version%3F'>\nHave you encountered anomalies after the plugin update that did not exist in the previous version?\n</h4>\n<p>\n<p>Anomalies might arise if your theme overrides plugin templates. If you use a popular theme, inform us to establish new compatibility. Alternatively, test the plugin in the WordPress default theme to rule out potential influences.</p>\n</p>\n<dt id='where%20can%20i%20find%20documentation%3F'>\nWhere can I find documentation?\n</h4>\n<p>\n<p>Comprehensive documentation is available online. Refer to our <a href=\"https://moreconvert.com/smart-wishlist-for-more-convert-documentation/\" rel=\"nofollow ugc\">online documentation</a> for assistance with setup and configuration.</p>\n</p>\n<dt id='where%20can%20i%20get%20support%20or%20talk%20to%20other%20users%3F'>\nWhere can I get support or talk to other users?\n</h4>\n<p>\n<p>For support and discussions, visit the <a href=\"https://wordpress.org/support/plugin/smart-wishlist-for-more-convert/\" rel=\"ugc\">Plugin Forum</a> or our <a href=\"https://moreconvert.com/support/\" rel=\"nofollow ugc\">help page</a> on our website.</p>\n</p>\n\n",
        "changelog": "<h4>1.8.2</h4>\n<ul>\n<li>Tested: WP 6.6.1</li>\n<li>Tested: WC 9.1.4</li>\n<li>Added: Add new setting for Set Default Privacy on Create New List Popup.(Premium Feature)</li>\n<li>Added: Add new setting for show reference wishlist on cart, checkout and order.(Premium feature)</li>\n<li>Added: Integration with WooCommerce Product Add-Ons Ultimate to Display Edit Options in Wishlist Table.(Premium feature)</li>\n<li>Fixed: Resolved Some JavaScript Bugs Reported on Tablet and Mobile Devices.</li>\n<li>Improvement: Share a List with Guests.</li>\n<li>Enhancement: Enhanced Guest Access on Lists Page.</li>\n<li>Improvement: Improved &#8220;Copy Product&#8221; Access for Guests.</li>\n<li>Fixed: Fix Some Reported Bugs with Shoptimizer Theme.</li>\n<li>Improvement: Display Login Notice Just if Lists Are Not Empty.</li>\n</ul>\n<h4>1.8.1</h4>\n<ul>\n<li>Tested: WP 6.5.4</li>\n<li>Tested: WC 8.9.3</li>\n<li>Fixed: Remove &#8220;Requires Plugins&#8221; from the plugin description for demo import bugs reported.</li>\n<li>Fixed: Fix reported bug when Add a product to the wishlist in loops that have an input with the name &#8220;add-to-cart&#8221; instead of a button with the name &#8220;add-to-cart&#8221;.</li>\n</ul>\n<h4>1.8.0</h4>\n<ul>\n<li>Tested: WC 8.8.3</li>\n<li>Fixed: Fix loco translate bugs.</li>\n<li>Fixed: Fix The Save button in the multilist popup bugs.(Premium feature)</li>\n</ul>\n<h4>1.7.9</h4>\n<ul>\n<li>Tested: WP 6.5.2</li>\n<li>Tested: WC 8.8.2</li>\n<li>Fixed: Fix tooltip bugs.</li>\n<li>Fixed: Fix popup icon size.</li>\n<li>Fixed: vulnerability discovered in delete_item request.</li>\n<li>Fixed: Fixed reported issues when cache is enabled.</li>\n<li>Fixed: Fixed Wishlist tab name.(Premium feature).</li>\n<li>Improvement: Change Twitter icon to X.</li>\n<li>Improvement: The Save button in the multilist popup is now disabled if no checkboxes are changed.(Premium feature).</li>\n</ul>\n<p><a href=\"https://moreconvert.com/changelog/\" rel=\"nofollow ugc\">See changelog for all versions</a>.</p>\n"
    },
    "short_description": "Free: WooCommerce Wishlist, Email automation, Elementor and Premium: Back-in-Stock Notifier, Save For Later, Multi-lists, reports, Email Marketing",
    "description": "<p>🚀 <strong>Supercharge your WooCommerce sales</strong> with the MoreConvert WooCommerce Wishlist plugin. How? Read on to find out!</p>\n<p><strong>Free Version:</strong><br />\n&#8211; <strong>WooCommerce Wishlist:</strong> Create wishlists easily.<br />\n&#8211; Beautiful icons in various positions + shortcodes<br />\n&#8211; <strong>Elementor Widgets:</strong> Customize with Elementor<br />\n&#8211; <a href=\"https://moreconvert.com/integrations//?utm_source=wordpressorg&amp;utm_content=preview\" rel=\"nofollow ugc\"><strong>Over 100 integrations</strong> with plugins and themes.</a><br />\n&#8211; High customization and fast setup.</p>\n<p>📚 <strong><a href=\"https://moreconvert.com/docs/wishlist/?utm_source=wordpressorg&amp;utm_content=documentation\" rel=\"nofollow ugc\">DOCUMENTATION</a></strong> |✨ 23 Significant Update in 2023 |⚡ Swift and Attentive Support Team</p>\n<p><strong>Premium Version:</strong><br />\n&#8211; Back-in-Stock Notifier: Alert when items return.<br />\n&#8211; Save Cart for later: Retain shopping carts.<br />\n&#8211; Advanced Analytics: Uncover user insights.<br />\n&#8211; Email Campaigns &amp; Automation: Targeted emails, automated.<br />\n&#8211; And over 47 other cool and useful options.</p>\n<p>🌟 <a href=\"https://moreconvert.com/demo-signup/?utm_source=wordpressorg&amp;utm_content=preview\" rel=\"nofollow ugc\">TRY MC Woocommerce Wishlist <strong>PREMIUM</strong> For <strong>FREE</strong> </a></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/kFrdOcpZ8ZE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3><strong>Free Version Details</strong></h3>\n<ul>\n<li><strong>Wishlist Buttons</strong> and <strong>Wishlist Page</strong> for Woocommerce</li>\n<li><strong>Wishlist counter</strong> similar to the WooCommerce mini cart.</li>\n<li><strong>Elementor widget</strong> for the Wishlist page, Add to Wishlist Button, and the counter/mini Wishlist.</li>\n<li><strong>WordPress widget</strong> for the counter.</li>\n<li>Support for Woocommerce <strong>Variable products</strong> and integration with most addons.</li>\n<li><strong>Share the wishlist</strong> on social media, via link, or export it as a PDF.</li>\n<li><strong>Easily change all words</strong> without translator plugins.</li>\n<li><strong>Quick Wizard</strong> for fast configuration.</li>\n<li><strong>Login/signup invitation</strong> for unregistered users.</li>\n<li><strong>Full customization options</strong> for the front-end, including all sections of the Wishlist page, buttons, counters, icons, etc.</li>\n<li><strong>Change button text</strong> after adding a product to the wishlist.</li>\n<li>Well-designed <strong>icons for the woocommerce wishlist plugin button</strong>.</li>\n<li>Button type options: <strong>icon, text, or both</strong>.</li>\n<li><strong>Button tooltip</strong> for product pages and shop pages.</li>\n<li><strong>Customizable share icon color</strong>.</li>\n<li><strong>Enable/disable automatic removal</strong> of products from the woocommerce wishlist and moving them to the cart after purchase.</li>\n<li><strong>Enable/disable WooCommerce Wishlist functionality</strong> for unregistered users.</li>\n<li>Choose the wishlist button action: either a <strong>popup or direct redirection</strong> to the wishlist page.</li>\n<li><strong>Customizable appearance</strong> for the wishlist redirecting pop-up, including text and image.</li>\n<li>Handling of <strong>out-of-stock products</strong> in the wishlist button management.</li>\n<li>Ability to <strong>add the entire wishlist to the cart</strong>.</li>\n<li>Use <strong>shortcodes</strong> for desired button placement.</li>\n<li>Simplified behavior for &#8220;remove from wishlist&#8221; action (removal on the second click).</li>\n<li><strong>Add to Menu functionality</strong> with a single click on the counter.</li>\n<li>Four options for <strong>placing the counter number</strong>.</li>\n<li><strong>Shortcodes and widgets</strong> available for the counter.</li>\n<li><strong>Customizable counter</strong> (text, icon, color) for the add to menu feature.</li>\n<li><strong>Automation emails for wishlist</strong>: status updates and purchase invites.</li>\n<li><strong>Set conditions</strong> based on WooCommerce Wishlist status, products, or prices for email automation.</li>\n<li><strong>Schedule five customizable emails</strong> with different templates to boost sales.</li>\n<li><strong>Define automatic discount coupons</strong> with expiration dates and auto-deletion.</li>\n<li><strong>Email automation stops after coupon use</strong> and user&#8217;s purchase.</li>\n<li><strong>Personalize Notif and follow-up emails</strong> for users, allow unsubscribing.</li>\n<li><strong>Custom CSS styles</strong>.</li>\n<li><strong>Import and Export</strong> plugin settings.</li>\n<li>Fast <strong>AJAX interaction</strong> for all frontend events.</li>\n<li><strong>Compatibility with popular themes</strong> and page builders such as Gutenberg, Elementor, Divi, Astra, Storefront, OceanWP, Flatsome, and more.</li>\n<li><a href=\"https://moreconvert.com/integrations//?utm_source=wordpressorg&amp;utm_content=preview\" rel=\"nofollow ugc\"><strong>Over 100 integrations</strong> with plugins and themes.</a></li>\n<li>Advanced <strong>cache-friendly functionality</strong>.</li>\n<li><strong>Translation-ready</strong> and compatible with all translation plugins.</li>\n<li><strong>Customize the wishlist table page</strong> to display product image, name, review, price, discount, stock status, quantity, date added, and variations.</li>\n<li><strong>Customizable appearance for the add to wishlist button</strong>, including options for different icons, text, color, size, border, and more.</li>\n<li><strong>Change WooCommerce Wishlist button position</strong> on product and shop pages.</li>\n<li><strong>Mini Wishlist</strong> for the counter and sidebar widget.</li>\n</ul>\n<h3><strong>Premium Version Details</strong></h3>\n<p>🔒 <strong>Advanced WooCommerce Wishlist features</strong><br />\n&#8211; <strong>Popup for sharing options</strong>.<br />\n&#8211; <strong>Selectable list layouts</strong> by users (<strong>grid or list</strong>).<br />\n&#8211; Shortcode for User Counter on Wishlist on the product page<br />\n&#8211; Move Products between Lists<br />\n&#8211; Drag and Drop items among List<br />\n&#8211; Copy Products from other shared Lists to your List<br />\n&#8211; Toast Style Management<br />\n&#8211; Open New Tab For External Product Add To Cart for affiliate shops<br />\n&#8211; Total price with three style (classic, marketing, modern) and different position and style.</p>\n<p>🔒 <strong>WooCommerce Unlimited lists</strong> (Bookmark system/or use as Bundle builder)<br />\nAll Advanced and free WooCommerce Wishlist features plus:<br />\n&#8211; <strong>Customize names and descriptions</strong> for each list.<br />\n&#8211; <strong>Add or move products between multiple lists</strong>.<br />\n&#8211; <strong>Choose whether to make lists public or private</strong>.<br />\n&#8211; <strong>Attractive display in the WooCommerce My Account section</strong>.<br />\n&#8211; <strong>Additional dedicated button</strong> to encourage user engagement and lead generation.<br />\n&#8211; <strong>Sharing feature as popup or under the lists</strong>.<br />\n&#8211; <strong>Dedicated counter</strong> with all customizable options and mini lists.</p>\n<p>🔒 WooCommerce Waitlist options<br />\n&#8211; <strong>All WooCommerce Wishlist Features</strong><br />\n&#8211; <strong>Dedicated Waitlist Button</strong>, <strong>Wishlist Page</strong> and <strong>Counter</strong> for Woocommerce<br />\n&#8211; <strong>Email Notifier</strong> for Back in Stock, Limited Stock, Price Changes, and Special Sales<br />\n&#8211; <strong>Email Automation</strong> with Five Follow-ups<br />\n&#8211; <strong>Product-Specific Email Automation</strong> for Variable Products in All Modes (Back in Stock, Limited Stock, Price Change, Special Sale)<br />\n&#8211; <strong>Create Combined Conditions</strong> for Email Campaigns and Automation based on User Behavior in Wishlist, Waitlist, Shopping Cart, and Multilist, and User Status and Purchase History.<br />\n&#8211; <strong>Exclusive Out-of-Stock Product Box</strong> with Two Customizable Styles</p>\n<p>🔒 Next purchase cart for save cart for later<br />\n&#8211; Secret <strong>Next Purchase Cart Button</strong><br />\n&#8211; Add <strong>Next Purchase Cart</strong> under cart table or in Separate Tab<br />\n&#8211; <strong>Pop-up Prevents Removal</strong> from Cart and Invites to Add to Next Shopping Cart<br />\n&#8211; <strong>Hide Next Purchase Cart Button</strong>, Show on Removal Request<br />\n&#8211; <strong>Customizable Buttons and Texts and Well-designed icons</strong> with Full Details<br />\n&#8211; <strong>Support for Changing and Out-of-Stock Products</strong><br />\n&#8211; <strong>Invitation Button</strong> for Similar Products When Unavailable in Next Purchase Cart<br />\n&#8211; <strong>Email Notifier</strong> with Automatic Follow-ups and Discount Code (Similar to Waitlist)<br />\n&#8211; Attractive and Professional Styles to Reduce Cart Removal<br />\n&#8211; Define for guests, users, or both<br />\n&#8211; Three styles to choose from for the save for later button position.<br />\n&#8211; Easily add products to cart with one click using &#8220;<strong>Save for Later</strong>&#8221; or remove them from the list.<br />\n&#8211; Option to include a prominent call-to-action bar with notification on top the list.<br />\n&#8211; Convenient &#8220;<strong>Add All to Cart</strong>&#8221; button on the cart page for added convenience.</p>\n<p>🔒 Comprehensive analytics<br />\n&#8211; <strong>Analyze Individual User Behavior</strong><br />\n&#8211; <strong>Filter, View and export Users</strong> based on Various Conditions (List</p>\n<p>Status, List Ownership, User Status, Previous Purchases, Combined Conditions)<br />\n&#8211; <strong>Save User Segments</strong> based on Categories<br />\n&#8211; <strong>Send Email Campaigns</strong> to Users with Category-based Filtering<br />\n&#8211; <strong>Check Users</strong> based on Lists and Previous Purchases<br />\n&#8211; <strong>Add Notes</strong> to Users for CRM Purposes<br />\n&#8211; <strong>View and Analyze List Indicators</strong> for Improved Sales<br />\n&#8211; <strong>View Lists of Individual Users</strong> with Various Condition.<br />\n&#8211; <strong>View Product Status</strong> in Each List and All Lists<br />\n&#8211; <strong>Identify Users</strong> of Specific Products<br />\n&#8211; <strong>Define Multiple Conditions</strong> for Analytics and Targeting High Sales Numbers without General Ads</p>\n<p>🔥 <strong><a href=\"https://moreconvert.com/pricing\" rel=\"nofollow ugc\">GET THE PREMIUM VERSION NOW!</a></strong></p>\n<p>🔒 Unlimited automated email sequences<br />\n&#8211; <strong>Define dozens of automated emails</strong> based on conditions from lists, purchase history, and user status.<br />\n&#8211; <strong>Create exclusive discount codes</strong> for each user with automatic deletion after purchase and customizable conditions.<br />\n&#8211; <strong>Set up five automatic follow-up emails</strong> with specific timings and various appearance templates.<br />\n&#8211; <strong>Generate automatic sales</strong> through email automation.<br />\n&#8211; View detailed <strong>click rate, open rate, and sales reports</strong> for each email automation.<br />\n&#8211; <strong>Automatically send emails</strong> using the website&#8217;s SMTP with a system to reduce server pressure.<br />\n&#8211; <strong>Personalize email content</strong> based on user characteristics and lists.<br />\n&#8211; <strong>Allow users to unsubscribe</strong> from email automation.<br />\n&#8211; <strong>Email automation stops after coupon use</strong> and user&#8217;s purchase.</p>\n<p>🔒 One-shot Email campaign<br />\n&#8211; <strong>Define dozens of one-time emails</strong> based on detailed conditions from lists, purchase history, and user status.<br />\n&#8211; <strong>Create exclusive discount codes</strong> for each user with automatic deletion after purchase and customization options.<br />\n&#8211; Schedule and send <strong>bulk emails</strong>.<br />\n&#8211; View detailed <strong>click rate, open rate, and sales reports</strong> for each email campaign.<br />\n&#8211; <strong>Automatically send emails</strong> using the website&#8217;s SMTP with a system to reduce server pressure.<br />\n&#8211; <strong>Personalize email content</strong> based on user characteristics and lists.<br />\n&#8211; <strong>Allow users to unsubscribe</strong> from email campaigns.</p>\n<p>More advanced features in the premium version include:</p>\n<ul>\n<li><strong>Display all lists</strong> on one page using tabs or different pages.</li>\n<li><strong>Enhanced settings for email marketing.</strong></li>\n<li><strong>Priority support and faster, comprehensive updates.</strong></li>\n<li>Compatible with a wider range of popular WordPress themes and plugins.</li>\n<li>Optimized for seamless desktop and mobile viewing experiences.</li>\n<li>Supports both simple and variable products.</li>\n</ul>\n<p>🌟 <strong><a href=\"https://moreconvert.com/demo-signup/?utm_source=wordpressorg&amp;utm_content=preview\" rel=\"nofollow ugc\">TRY THE FREE DEMO OF MC Wishlist PREMIUM</a></strong></p>\n<p>Why is <strong>this one plugin</strong> better than all those plugins out there?</p>\n<ul>\n<li>All these lists (<strong>waitlist, wishlist, multilist, save for later, etc.</strong>) have the same core, installing different plugins with disproportionate updates will slow down your site and <strong>cost</strong> and <strong>trouble</strong> increases <strong>you</strong>, we give you a much lighter plugin than the sum of those plugins, without conflicts with other plugins.</li>\n<li>The styling and graphics of the plugin are very flexible, professional and correctly coded, and without a single line of coding, you can add several different buttons to the product, store, and shopping cart pages in exactly the way you want.</li>\n<li>Other plugins store user data without any use, but <strong>we do not burden your database</strong>, but multiply the behavior of your users by analyzing this data professionally.</li>\n<li><strong>Monitor the user&#8217;s behavior</strong> on the store, products, and cart pages and give special offers to each user based on the user&#8217;s behavior, which will significantly increase your sales.</li>\n<li>You don&#8217;t need more traffic, you need a higher conversion rate, with this plugin you can easily increase your sales without the need for expensive email marketing servers and dozens of different plugins.</li>\n<li><strong>Strengthen customer loyalty</strong> with personalized lists, encourage repeat visits, and repeat purchases.</li>\n</ul>\n<p>🔥 <strong><a href=\"https://moreconvert.com/pricing\" rel=\"nofollow ugc\">GET THE PREMIUM VERSION NOW!</a></strong></p>\n<p>So, you&#8217;re probably wondering why this plugin is so awesome and necessary, right? Let me break it down for you:</p>\n<p>⚡ Get your customers excited about your products with a pre-launch waitlist or price drop alerts. It&#8217;s like giving them a backstage pass to exclusive deals, encouraging them to make purchases and feel like part of the inner circle.</p>\n<p>⚡ Create a sense of urgency by notifying customers when a product is running low in stock. They won&#8217;t want to miss out on their favorite items, so they&#8217;ll be motivated to buy before it&#8217;s too late!</p>\n<p>⚡ You can even offer price increase alerts, giving your customers a nudge to make timely purchases and avoid missing out on great prices.</p>\n<p>⚡ Ever had customers asking when certain products will be back in stock? Well, our plugin takes care of that too! Your customers will receive notifications when specific or similar products are back on the shelves.</p>\n<p>⚡ Say goodbye to complicated processes! Our plugin offers counter and mini lists options that make everything super simple and user-friendly.</p>\n<p>⚡ Oh, and did I mention that you can customize the appearance, sharing, and counters of the lists and buttons? It&#8217;s like having your own personalized, stylish assistant to handle it all.</p>\n<p>But wait, there&#8217;s more! This plugin brings a whole bunch of practical and useful benefits:</p>\n<p>🛒 <strong>Increase sales with saved carts:</strong><br />\nWith the &#8220;Save Cart for Later&#8221; feature, your customers can conveniently save their favorite items for future purchases. The Next Purchase Cart ensures that they won&#8217;t forget the products they love, leading to increased sales and customer satisfaction.</p>\n<p>📊 <strong>Comprehensive Analytics for Informed Decision-Making:</strong><br />\nTake your business intelligence to the next level with detailed analytics. Understand individual user behavior, segment users based on various conditions, and target high-sales opportunities without general ads. The plugin allows you to view product status in each list, identify users of specific products, and create multiple conditions for effective analytics.</p>\n<p>📈 <strong>Unlimited Automated Email Sequences:</strong><br />\nEngage your customers with personalized and automated email sequences. Define dozens of emails based on user lists, purchase history, and user status. Create exclusive discount codes, set up automatic follow-ups, and generate sales through targeted email campaigns. Monitor click rates, open rates, and sales reports for each email, ensuring a data-driven approach to your marketing strategy.</p>\n<p>📧 <strong>One-Shot Email Campaigns:</strong><br />\nFor one-time promotions, the plugin enables you to define one-time emails based on specific conditions. Schedule and send bulk emails, view detailed campaign reports, and personalize content based on user characteristics and lists. It&#8217;s a powerful tool to run effective and targeted promotional campaigns.</p>\n<p>🌐 <strong>Optimized for Desktop and Mobile:</strong><br />\nWhether your customers are browsing on a desktop or a mobile device, the MoreConvert WooCommerce Wishlist plugin provides a seamless and optimized experience. The responsive design ensures that users can easily interact with wishlists, waitlists, and more, enhancing their overall shopping experience.</p>\n<p>🌟 <strong>Why MoreConvert?</strong><br />\n&#8211; <strong>Lightweight Plugin:</strong> Combines multiple functionalities in a single, efficient plugin without slowing down your site.<br />\n&#8211; <strong>Flexible Styling:</strong> Professional and flexible styling options without the need for coding.<br />\n&#8211; <strong>Smart Data Handling:</strong> Analyze user behavior without burdening your database, providing actionable insights.<br />\n&#8211; <strong>Increased Conversion:</strong> Boost sales with personalized lists, encouraging repeat visits and purchases.<br />\n&#8211; <strong>Cost-Effective:</strong> A comprehensive solution that eliminates the need for multiple plugins and expensive email marketing servers.</p>\n<p>Ready to supercharge your WooCommerce sales and provide an exceptional shopping experience for your customers? 🚀 <strong><a href=\"https://moreconvert.com/pricing\" rel=\"nofollow ugc\">Get the Premium Version Now!</a></strong></p>\n<p>🔥 <strong><a href=\"https://moreconvert.com/demo-signup/?utm_source=wordpressorg&amp;utm_content=preview\" rel=\"nofollow ugc\">Try the Free Demo of MC Wishlist Premium</a></strong></p>\n<h3>Installation and use</h3>\n<ol>\n<li>Upload <code>smart-wishlist-for-more-convert.zip</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the Plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n<li>Make sure to disable caching on your checkout and thank you steps</li>\n<li>Watch the Video below to learn how to use the Plugin</li>\n</ol>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/56yvYqOh-Rw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n",
    "download_link": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.8.2.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-1.png?rev=2776908",
            "caption": "Design different wishlist button styles."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-2.png?rev=2776909",
            "caption": "Place every location that you want."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-3.png?rev=2776942",
            "caption": "Design a gorgeous &amp; responsive Wishlist page."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-4.png?rev=2776912",
            "caption": "Create a faster way to access Wishlist."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-5.gif?rev=2776940",
            "caption": "Groundbreaking Integration with Elementor Page builder."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-6.gif?rev=2776914",
            "caption": "Optimize your wishlist button easily without any hassle."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-7.gif?rev=2776915",
            "caption": "Customize everything on your wishlist page."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-8.gif?rev=2776916",
            "caption": "Change the wishlist counter and mini Wishlist display."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-9.gif?rev=2776917",
            "caption": "No need to pay for email marketing service for retargeting automation."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-10.gif?rev=2776918",
            "caption": "Includes social media sharing options."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-11.gif?rev=2776919",
            "caption": "MC Wishlist comes with speed optimization management."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-12.gif?rev=2875178",
            "caption": "Add different buttons to your product page with one plugin."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-13.gif?rev=2875179",
            "caption": "Customize popup share options and layouts."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-14.gif?rev=2875180",
            "caption": "Advanced \"Save For Later\" options."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-15.gif?rev=2945018",
            "caption": "Generate new customers with our advanced analytics."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-16.gif?rev=2945019",
            "caption": "Send seasonal one-shot campaigns to users based on advanced conditions."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-17.gif?rev=2945020",
            "caption": "Send automated emails based on conditions and increase sales."
        },
        {
            "src": "https://ps.w.org/smart-wishlist-for-more-convert/assets/screenshot-18.gif?rev=2945017",
            "caption": "WooCommerce advanced Waitlist (Restock, Price change, on sale, limited stock)."
        }
    ],
    "tags": {
        "back-in-stock": "back in stock",
        "out-of-stock": "out of stock",
        "wishlist": "Wishlist",
        "woocommerce-waitlist": "woocommerce waitlist",
        "woocommerce-wishlist": "woocommerce wishlist"
    },
    "stable_tag": "1.8.2",
    "versions": {
        "1.0.1": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.0.2.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.2.4.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.3.3.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.4.1.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.4.5.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.4.6.zip",
        "1.4.7": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.4.7.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.5.2.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.5.4.zip",
        "1.5.5": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.5.5.zip",
        "1.5.6": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.5.6.zip",
        "1.5.7": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.5.7.zip",
        "1.5.8": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.5.8.zip",
        "1.5.9": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.5.9.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.6.3.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.6.5.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.6.6.zip",
        "1.6.7": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.6.7.zip",
        "1.6.8": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.6.8.zip",
        "1.6.9": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.6.9.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.7.0.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.7.2.zip",
        "1.7.3": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.7.3.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.7.4.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.7.6.zip",
        "1.7.7": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.7.7.zip",
        "1.7.8": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.7.8.zip",
        "1.7.9": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.7.9.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.8.0.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.8.1.zip",
        "1.8.2": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.1.8.2.zip",
        "trunk": "https://downloads.wordpress.org/plugin/smart-wishlist-for-more-convert.zip"
    },
    "business_model": "commercial",
    "repository_url": "",
    "commercial_support_url": "https://moreconvert.com/n866",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/smart-wishlist-for-more-convert/assets/banner-772×250.gif?rev=2936071",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/smart-wishlist-for-more-convert/assets/icon-128×128.gif?rev=2936073",
        "2x": "https://ps.w.org/smart-wishlist-for-more-convert/assets/icon-256×256.gif?rev=2936076"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "smart-wishlist-for-more-convert",
            "language": "fa_IR",
            "version": "1.8.2",
            "updated": "2024-06-06 06:01:36",
            "package": "http://downloads.wordpress.org/translation/plugin/smart-wishlist-for-more-convert/1.8.2/fa_IR.zip"
        },
        {
            "type": "plugin",
            "slug": "smart-wishlist-for-more-convert",
            "language": "fr_FR",
            "version": "1.8.2",
            "updated": "2024-06-28 13:51:09",
            "package": "http://downloads.wordpress.org/translation/plugin/smart-wishlist-for-more-convert/1.8.2/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "smart-wishlist-for-more-convert",
            "language": "it_IT",
            "version": "1.8.2",
            "updated": "2024-08-26 02:51:22",
            "package": "http://downloads.wordpress.org/translation/plugin/smart-wishlist-for-more-convert/1.8.2/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "smart-wishlist-for-more-convert",
            "language": "nl_NL",
            "version": "1.8.2",
            "updated": "2024-03-06 22:30:11",
            "package": "http://downloads.wordpress.org/translation/plugin/smart-wishlist-for-more-convert/1.8.2/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "smart-wishlist-for-more-convert",
            "language": "ru_RU",
            "version": "1.8.2",
            "updated": "2023-09-27 14:20:26",
            "package": "http://downloads.wordpress.org/translation/plugin/smart-wishlist-for-more-convert/1.8.2/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "smart-wishlist-for-more-convert",
            "language": "uk",
            "version": "1.8.2",
            "updated": "2024-06-24 18:40:16",
            "package": "http://downloads.wordpress.org/translation/plugin/smart-wishlist-for-more-convert/1.8.2/uk.zip"
        }
    ]
}