{
    "name": "Soccer Engine &#8211; Soccer Plugin for WordPress",
    "slug": "soccer-engine-lite",
    "version": "1.13",
    "author": "<a href=\"https://daext.com\">DAEXT</a>",
    "author_profile": "https://profiles.wordpress.org/daext/",
    "contributors": {
        "daext": {
            "profile": "https://profiles.wordpress.org/daext/",
            "avatar": "https://secure.gravatar.com/avatar/777207912d99fde4c1fe0a95af9f6b78?s=96&d=monsterid&r=g",
            "display_name": "DAEXT"
        }
    },
    "requires": "5.0",
    "tested": "6.6.2",
    "requires_php": "5.5",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 1,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 1,
    "support_url": "https://wordpress.org/support/plugin/soccer-engine-lite/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 100,
    "last_updated": "2024-10-15 12:45:00",
    "added": "2022-02-22",
    "homepage": "",
    "sections": {
        "description": "<p>Soccer Engine is a specialized soccer plugin for WordPress that gives sports bloggers and club websites administrators the ability to complement their articles with results, fixtures, match commentaries, transfer market data, and a great variety of other statistics.</p>\n<p>When installed, this massive project adds to WordPress 40 new administrative menus, 27 new editor blocks, and 62 customization options. Our goal is to provide all WordPress users with a comprehensive and expandable solution for any soccer-related website.</p>\n<h3>Pro version</h3>\n<p>We distribute the <a href=\"https://daext.com/soccer-engine/\" rel=\"nofollow ugc\">Pro version</a> of this plugin that includes the following additional features:</p>\n<ul>\n<li><strong>Additional Blocks</strong> like the Match Timeline, Ranking Transitions Chart, Market Value Transitions Chart, Referee Statistics by Competition, Referee Statistics by Team.</li>\n<li><strong>Events Wizard</strong> to generate multiple events in a single operation. With this feature, you can easily assign results to multiple matches without manually adding single events.</li>\n<li><strong>REST API</strong> to optionally manage the Soccer Engine data with external applications, create new additional plugin features, automatically create match events, and more.</li>\n<li><strong>Import</strong> and <strong>Export</strong> menus to create a backup of the plugin data or move the plugin data between different WordPress installations.</li>\n<li><strong>Additional advanced options</strong> to set custom menu capabilities, customize the pagination system, and more.</li>\n</ul>\n<h3>Publish a great variety of soccer statistics</h3>\n<p>This plugin gives you the ability to publish a great variety of soccer statistics on your website. These statistics are sometimes directly retrieved from records added by the website editors with the administrative menus. Other times, the plugin generates statistics based on simple or complex calculations. Examples of statistics directly retrieved from the inputted data are the first name of a player, the last name of a player, and its height. In contrast, examples of statistics calculated by the plugin are the standings tables of the competitions or statistics that report the player performance.</p>\n<p>In terms of elements generated in the front-end, the plugin uses regular HTML tables for the most part. However, the plugin can also generate more complex layouts when needed. To illustrate, in the case of match commentaries or to visually represent the formations, the plugin uses custom layouts augmented with images, SVG illustrations, and more.</p>\n<p>Below you can find a list of the blocks added to WordPress by the plugin in alphabetic order. Please note that users of the <a href=\"https://wordpress.org/plugins/classic-editor/\" rel=\"ugc\">Classic Editor</a>, or users with alternative visual editors can use shortcodes with parameters as a fallback for the editor blocks. For more information on the use of the shortcodes provided by Soccer Engine, visit the <a href=\"https://daext.com/doc/soccer-engine-lite/#shortcodes\" rel=\"nofollow ugc\">shortcodes section</a> of the plugin manual.</p>\n<h4>Agency contracts</h4>\n<p>This block displays a table that lists the contractual agreement between players and their agencies or sports agents.</p>\n<h4>Competition round</h4>\n<p>Use this element to display a table with information about the matches associated with a competition.</p>\n<h4>Competition standings table</h4>\n<p>With this block, you can generate a standings table that compares the teams of a round-robin competition by ranking them based on multiple criteria.</p>\n<p>Note that we worked to make the tournament system very flexible. For example, you can set the criteria used to rank the teams or determine the points assigned to the team&#8217;s victories, draw, and loss.</p>\n<h4>Injuries</h4>\n<p>This block allows you to display a table with information about the injuries.</p>\n<p>The plugin gives you the ability to list the individual injuries associated with the players and add additional information like the injury type (E.g., concussion, knee inflammation, meniscal tear, etc.), the date range on which the player was injured, and more.</p>\n<h4>Market value transitions</h4>\n<p>This block displays a table with information about the market value of players at a specific moment in time.</p>\n<h4>Match commentary</h4>\n<p>This block gives you the ability to describe the events of a match. Specifically, this element generates a list of events that include the minute of the event, an icon that represents the type of event, an image of the player, and your custom description of the event.</p>\n<h4>Match lineup</h4>\n<p>Use this block to display a team&#8217;s lineup in a specific match. If the game includes events, event icons are used to provide details on these events.</p>\n<h4>Match score</h4>\n<p>This block summarizes essential data about a match in a simple and easy-to-understand layout. Specifically, the following information is displayed: The name of the teams, the team logos, the match result, the date and hour of the match, where the game has been played, the attendance, and the referee.</p>\n<h4>Match staff</h4>\n<p>Use this feature to list the staff members that participated in a specific match. For example, a typical list of staff members includes the manager, the assistant manager, and a few other members like the athletic coach, the team coordinator, etc.</p>\n<h4>Match substitutions</h4>\n<p>This element allows you to list the substitute players available for a team in a specific match.</p>\n<h4>Match visual lineup</h4>\n<p>This block generates a layout composed of an isometric field with the players in the starting lineup and a table that lists substitutes and staff members.</p>\n<p>Note that the player displayed in the isometric field are positioned based on the specific formation defined in the back-end. In addition, below each player are also shown icons used to represent the event associated with the players.</p>\n<h4>Matches</h4>\n<p>This block displays a table that lists one match per row with information like the date of the game, the hour of the game, the home team, the away team, the match result, and more.</p>\n<p>Note that this list is generated based on custom criteria defined with the block options. You can, for example, only display the matches played by a specific team, the games played in a specified date interval, and more.</p>\n<h4>Player awards</h4>\n<p>Use the player awards to register and display the awards received by the players. A prominent example of this feature is to list the Ballon D&#8217;Or winners. Note that you can define your custom awards in the back-end and, consequently, list awards assigned by local competitions, etc.</p>\n<h4>Player summary</h4>\n<p>This element generates information retrieved from the players and from the transfers market data. It&#8217;s a layout commonly used in &#8220;Player Profile&#8221; pages or more in general to complement pages or paragraphs dedicated to specific players.</p>\n<h4>Players</h4>\n<p>This layout generates a table that lists one player per row. The table columns, which you can customize with the block options, can display information like the age of the player, the citizenship, the player height, the market value, the current club of the player, the club that owns the player, and more.</p>\n<h4>Ranking transitions</h4>\n<p>With this block, you can display a table that lists the ranking value of the teams in a specific ranking system. An example of ranking system is the <a href=\"https://www.uefa.com/nationalassociations/uefarankings/\" rel=\"nofollow ugc\">UEFA club coefficients</a>.</p>\n<p>Based on your specific needs, you can create your custom ranking systems or report the data of existing ranking systems.</p>\n<h4>Referee summary</h4>\n<p>This block displays a referee&#8217;s image, additional information retrieved from referee data, and calculated information based on the referee&#8217;s performance on existing matches.</p>\n<p>In terms of computed statistics, the plugin can list the number of appearances, the overall number of yellow cards and red cards assigned by the referee, and more.</p>\n<h4>Squad lineup / Squad staff / Squad substitutions</h4>\n<p>These three blocks list the players and staff members associated with a squad.</p>\n<p>Note that in this plugin, the squads are reusable collections of players, staff members, formations, and jersey sets usually used to speed up the configuration of new matches.</p>\n<h4>Staff</h4>\n<p>This block displays a list of staff members with information like the staff member&#8217;s age, their citizenship, and their role. Examples of staff members are managers, assistant managers, athletic coaches, goalkeeping coaches, board members.</p>\n<h4>Staff awards</h4>\n<p>Use this block to generate a list of awards assigned to staff members. Staff awards are honors, like &#8220;Best manager of the year&#8221;, usually given by associations to the staff members of a soccer team.</p>\n<h4>Staff summary</h4>\n<p>This block displays an image of the staff member with relevant information like his age, citizenship, and role. In addition, the plugin also displays computed information like the staff member favorite formation, the points per match, the average number of goals scored by the staff member teams, the number of matches in which the staff member has been involved, and the number of matches won, drawn, and lost.</p>\n<h4>Team contracts</h4>\n<p>You should use this feature to display contracts between players and teams. Essential information associated with the team contracts are the contract&#8217;s start date, the contract&#8217;s end date, and the salary.</p>\n<p>Team contracts are always associated with a contract type, which is used to better define and categorize the team contract. Examples of contract types are purchase, loan, loan with option, etc. It&#8217;s worth noting that the plugin gives you the ability to define your custom contract types from a dedicated menu.</p>\n<h4>Transfers</h4>\n<p>This is an essential element for transfer market blogs that want to list the transfer market movement.</p>\n<p>Thanks to the block filters, you can display, for example, only the transfer market movement that took place in a specific period, the transfer market movement associated with a particular team, the transfer market movement with high fees, and more.</p>\n<p>In the front-end, the table generated with this block includes information such as the player name, the player citizenship, the teams involved in the transfer, the date of the transfer, the market value of the player, the fee paid to complete the transfer, and more.</p>\n<h4>Trophies</h4>\n<p>Use this block to display the trophies won by a team with information like the type of trophy or the data on which the trophy has been assigned.</p>\n<p>Use this feature, for example, to list the UEFA Champions League winners or to list the winners of local soccer competitions.</p>\n<h4>Unavailable players</h4>\n<p>Use this element to list the unavailable players. This list includes the name of the player, the reason for the unavailability, the date range on which the player is unavailable, and optionally other player information.</p>\n<h3>Notable features of this soccer plugin</h3>\n<h4>Vector graphics</h4>\n<p>The plugin uses dynamic and customizable SVGs to represent icons and other graphical elements like the soccer fields, the clocks used to display the minute of an event, etc.</p>\n<h4>Customizable style</h4>\n<p>A total of 40 style options allows you to customize the colors and the typography of the elements generated by the plugin. So you can easily create your own unique and consistent style.</p>\n<h4>The events system</h4>\n<p>Events are the single units used to generate the match statistics. Examples of events are goals, yellow cards, red cards, and substitutions.</p>\n<p>By entering events, you will be able to display match commentaries, generate event tooltips with details of the events, and more. In addition, the events data allows the plugin to generate computed statistics.</p>\n<h4>Customizable competitions</h4>\n<p>The plugin allows you to create competitions of type <a href=\"https://en.wikipedia.org/wiki/Round-robin_tournament\" rel=\"nofollow ugc\">Round-robin</a> and <a href=\"https://en.wikipedia.org/wiki/Single-elimination_tournament\" rel=\"nofollow ugc\">Elimination</a> with a custom number of participating teams.</p>\n<p>These two types of competition are the foundations for any soccer tournament. For example, you can easily create the English Premier League by making a Round-robin tournament with 20 teams or set up the knockout stage of the Champions League by using an Elimination tournament with 16 teams.</p>\n<h4>Credits</h4>\n<p>This plugin makes use of the following resources:</p>\n<ul>\n<li><a href=\"https://github.com/harvesthq/chosen\" rel=\"nofollow ugc\">Chosen</a> licensed under the <a href=\"http://www.opensource.org/licenses/mit-license.php\" rel=\"nofollow ugc\">MIT License</a></li>\n<li>Flags icons by <a href=\"https://www.gosquared.com/\" rel=\"nofollow ugc\">GoSquared</a> licensed under the <a href=\"http://www.opensource.org/licenses/mit-license.php\" rel=\"nofollow ugc\">MIT License</a></li>\n<li>The ball icon used in the back-end menus is part of <a href=\"https://github.com/FortAwesome/Font-Awesome\" rel=\"nofollow ugc\">Font Awesome</a> and is licensed under the <a href=\"https://scripts.sil.org/cms/scripts/page.php?site_id=nrsi&amp;id=OFL\" rel=\"nofollow ugc\">SIL license</a>.</li>\n</ul>\n<p>For each library you can find the actual copy of the license inside the folder used to store the library files.</p>\n",
        "installation": "<h4>Installation (Single Site)</h4>\n<p>With this procedure you will be able to install the Soccer Engine plugin on your WordPress website:</p>\n<ol>\n<li>Visit the <strong>Plugins -&gt; Add New</strong> menu</li>\n<li>Click on the <strong>Upload Plugin</strong> button and select the zip file you just downloaded</li>\n<li>Click on <strong>Install Now</strong></li>\n<li>Click on <strong>Activate Plugin</strong></li>\n</ol>\n<h4>Installation (Multisite)</h4>\n<p>This plugin supports both a <strong>Network Activation</strong> (the plugin will be activated on all the sites of your WordPress Network) and a <strong>Single Site Activation</strong> in a <strong>WordPress Network</strong> environment (your plugin will be activated on a single site of the network).</p>\n<p>With this procedure you will be able to perform a <strong>Network Activation</strong>:</p>\n<ol>\n<li>Visit the <strong>Plugins -&gt; Add New</strong> menu</li>\n<li>Click on the <strong>Upload Plugin</strong> button and select the zip file you just downloaded</li>\n<li>Click on <strong>Install Now</strong></li>\n<li>Click on <strong>Network Activate</strong></li>\n</ol>\n<p>With this procedure you will be able to perform a <strong>Single Site Activation</strong> in a <strong>WordPress Network</strong> environment:</p>\n<ol>\n<li>Visit the specific site of the <strong>WordPress Network</strong> where you want to install the plugin</li>\n<li>Visit the <strong>Plugins</strong> menu</li>\n<li>Click on the <strong>Activate</strong> button (just below the name of the plugin)</li>\n</ol>\n",
        "changelog": "<h4>1.13</h4>\n<p><em>May 6, 2024</em></p>\n<ul>\n<li>Nonce validation added to the plugin back-end menus.</li>\n<li>Fixed error in the text domain passed to the translation functions.</li>\n<li>Improved variable escaping.</li>\n</ul>\n<h4>1.12</h4>\n<p><em>April 8, 2024</em></p>\n<ul>\n<li>Fixed a bug (started with WordPress version 6.5) that prevented the creation of the plugin database tables and the initialization of the plugin options during the plugin activation.</li>\n</ul>\n<h4>1.11</h4>\n<p><em>December 29, 2023</em></p>\n<ul>\n<li>Fixed PHP warnings.</li>\n<li>General refactoring. The phpcs &#8220;WordPress&#8221; ruleset has been partially applied to the plugin code.</li>\n<li>Plugin name changed to &#8220;Soccer Engine &#8211; Soccer Plugin for WordPress&#8221;.</li>\n</ul>\n<h4>1.10</h4>\n<p><em>March 21, 2023</em></p>\n<ul>\n<li>The &#8220;Events Wizard&#8221; menu has been added.</li>\n<li>Changelog added.</li>\n<li>A link to the Pro Version has been added to the Plugins menu.</li>\n<li>Improved block style in the block editor.</li>\n</ul>\n<h4>1.09</h4>\n<p><em>April 24, 2022</em></p>\n<ul>\n<li>Fixing other wrong text domain occurrences in the translation functions.</li>\n</ul>\n<h4>1.08</h4>\n<p><em>April 23, 2022</em></p>\n<ul>\n<li>The correct text domain is now used with the translation functions.</li>\n<li>Removed the &#8220;Lite&#8221; word from the plugin name.</li>\n</ul>\n<h4>1.07</h4>\n<p><em>February 22, 2022</em></p>\n<ul>\n<li>Initial release.</li>\n</ul>\n"
    },
    "short_description": "Soccer Engine is a plugin that lets bloggers and clubs add results, fixtures, match commentaries, transfers, and a wide range of stats to articles.",
    "description": "<p>Soccer Engine is a specialized soccer plugin for WordPress that gives sports bloggers and club websites administrators the ability to complement their articles with results, fixtures, match commentaries, transfer market data, and a great variety of other statistics.</p>\n<p>When installed, this massive project adds to WordPress 40 new administrative menus, 27 new editor blocks, and 62 customization options. Our goal is to provide all WordPress users with a comprehensive and expandable solution for any soccer-related website.</p>\n<h3>Pro version</h3>\n<p>We distribute the <a href=\"https://daext.com/soccer-engine/\" rel=\"nofollow ugc\">Pro version</a> of this plugin that includes the following additional features:</p>\n<ul>\n<li><strong>Additional Blocks</strong> like the Match Timeline, Ranking Transitions Chart, Market Value Transitions Chart, Referee Statistics by Competition, Referee Statistics by Team.</li>\n<li><strong>Events Wizard</strong> to generate multiple events in a single operation. With this feature, you can easily assign results to multiple matches without manually adding single events.</li>\n<li><strong>REST API</strong> to optionally manage the Soccer Engine data with external applications, create new additional plugin features, automatically create match events, and more.</li>\n<li><strong>Import</strong> and <strong>Export</strong> menus to create a backup of the plugin data or move the plugin data between different WordPress installations.</li>\n<li><strong>Additional advanced options</strong> to set custom menu capabilities, customize the pagination system, and more.</li>\n</ul>\n<h3>Publish a great variety of soccer statistics</h3>\n<p>This plugin gives you the ability to publish a great variety of soccer statistics on your website. These statistics are sometimes directly retrieved from records added by the website editors with the administrative menus. Other times, the plugin generates statistics based on simple or complex calculations. Examples of statistics directly retrieved from the inputted data are the first name of a player, the last name of a player, and its height. In contrast, examples of statistics calculated by the plugin are the standings tables of the competitions or statistics that report the player performance.</p>\n<p>In terms of elements generated in the front-end, the plugin uses regular HTML tables for the most part. However, the plugin can also generate more complex layouts when needed. To illustrate, in the case of match commentaries or to visually represent the formations, the plugin uses custom layouts augmented with images, SVG illustrations, and more.</p>\n<p>Below you can find a list of the blocks added to WordPress by the plugin in alphabetic order. Please note that users of the <a href=\"https://wordpress.org/plugins/classic-editor/\" rel=\"ugc\">Classic Editor</a>, or users with alternative visual editors can use shortcodes with parameters as a fallback for the editor blocks. For more information on the use of the shortcodes provided by Soccer Engine, visit the <a href=\"https://daext.com/doc/soccer-engine-lite/#shortcodes\" rel=\"nofollow ugc\">shortcodes section</a> of the plugin manual.</p>\n<h4>Agency contracts</h4>\n<p>This block displays a table that lists the contractual agreement between players and their agencies or sports agents.</p>\n<h4>Competition round</h4>\n<p>Use this element to display a table with information about the matches associated with a competition.</p>\n<h4>Competition standings table</h4>\n<p>With this block, you can generate a standings table that compares the teams of a round-robin competition by ranking them based on multiple criteria.</p>\n<p>Note that we worked to make the tournament system very flexible. For example, you can set the criteria used to rank the teams or determine the points assigned to the team&#8217;s victories, draw, and loss.</p>\n<h4>Injuries</h4>\n<p>This block allows you to display a table with information about the injuries.</p>\n<p>The plugin gives you the ability to list the individual injuries associated with the players and add additional information like the injury type (E.g., concussion, knee inflammation, meniscal tear, etc.), the date range on which the player was injured, and more.</p>\n<h4>Market value transitions</h4>\n<p>This block displays a table with information about the market value of players at a specific moment in time.</p>\n<h4>Match commentary</h4>\n<p>This block gives you the ability to describe the events of a match. Specifically, this element generates a list of events that include the minute of the event, an icon that represents the type of event, an image of the player, and your custom description of the event.</p>\n<h4>Match lineup</h4>\n<p>Use this block to display a team&#8217;s lineup in a specific match. If the game includes events, event icons are used to provide details on these events.</p>\n<h4>Match score</h4>\n<p>This block summarizes essential data about a match in a simple and easy-to-understand layout. Specifically, the following information is displayed: The name of the teams, the team logos, the match result, the date and hour of the match, where the game has been played, the attendance, and the referee.</p>\n<h4>Match staff</h4>\n<p>Use this feature to list the staff members that participated in a specific match. For example, a typical list of staff members includes the manager, the assistant manager, and a few other members like the athletic coach, the team coordinator, etc.</p>\n<h4>Match substitutions</h4>\n<p>This element allows you to list the substitute players available for a team in a specific match.</p>\n<h4>Match visual lineup</h4>\n<p>This block generates a layout composed of an isometric field with the players in the starting lineup and a table that lists substitutes and staff members.</p>\n<p>Note that the player displayed in the isometric field are positioned based on the specific formation defined in the back-end. In addition, below each player are also shown icons used to represent the event associated with the players.</p>\n<h4>Matches</h4>\n<p>This block displays a table that lists one match per row with information like the date of the game, the hour of the game, the home team, the away team, the match result, and more.</p>\n<p>Note that this list is generated based on custom criteria defined with the block options. You can, for example, only display the matches played by a specific team, the games played in a specified date interval, and more.</p>\n<h4>Player awards</h4>\n<p>Use the player awards to register and display the awards received by the players. A prominent example of this feature is to list the Ballon D&#8217;Or winners. Note that you can define your custom awards in the back-end and, consequently, list awards assigned by local competitions, etc.</p>\n<h4>Player summary</h4>\n<p>This element generates information retrieved from the players and from the transfers market data. It&#8217;s a layout commonly used in &#8220;Player Profile&#8221; pages or more in general to complement pages or paragraphs dedicated to specific players.</p>\n<h4>Players</h4>\n<p>This layout generates a table that lists one player per row. The table columns, which you can customize with the block options, can display information like the age of the player, the citizenship, the player height, the market value, the current club of the player, the club that owns the player, and more.</p>\n<h4>Ranking transitions</h4>\n<p>With this block, you can display a table that lists the ranking value of the teams in a specific ranking system. An example of ranking system is the <a href=\"https://www.uefa.com/nationalassociations/uefarankings/\" rel=\"nofollow ugc\">UEFA club coefficients</a>.</p>\n<p>Based on your specific needs, you can create your custom ranking systems or report the data of existing ranking systems.</p>\n<h4>Referee summary</h4>\n<p>This block displays a referee&#8217;s image, additional information retrieved from referee data, and calculated information based on the referee&#8217;s performance on existing matches.</p>\n<p>In terms of computed statistics, the plugin can list the number of appearances, the overall number of yellow cards and red cards assigned by the referee, and more.</p>\n<h4>Squad lineup / Squad staff / Squad substitutions</h4>\n<p>These three blocks list the players and staff members associated with a squad.</p>\n<p>Note that in this plugin, the squads are reusable collections of players, staff members, formations, and jersey sets usually used to speed up the configuration of new matches.</p>\n<h4>Staff</h4>\n<p>This block displays a list of staff members with information like the staff member&#8217;s age, their citizenship, and their role. Examples of staff members are managers, assistant managers, athletic coaches, goalkeeping coaches, board members.</p>\n<h4>Staff awards</h4>\n<p>Use this block to generate a list of awards assigned to staff members. Staff awards are honors, like &#8220;Best manager of the year&#8221;, usually given by associations to the staff members of a soccer team.</p>\n<h4>Staff summary</h4>\n<p>This block displays an image of the staff member with relevant information like his age, citizenship, and role. In addition, the plugin also displays computed information like the staff member favorite formation, the points per match, the average number of goals scored by the staff member teams, the number of matches in which the staff member has been involved, and the number of matches won, drawn, and lost.</p>\n<h4>Team contracts</h4>\n<p>You should use this feature to display contracts between players and teams. Essential information associated with the team contracts are the contract&#8217;s start date, the contract&#8217;s end date, and the salary.</p>\n<p>Team contracts are always associated with a contract type, which is used to better define and categorize the team contract. Examples of contract types are purchase, loan, loan with option, etc. It&#8217;s worth noting that the plugin gives you the ability to define your custom contract types from a dedicated menu.</p>\n<h4>Transfers</h4>\n<p>This is an essential element for transfer market blogs that want to list the transfer market movement.</p>\n<p>Thanks to the block filters, you can display, for example, only the transfer market movement that took place in a specific period, the transfer market movement associated with a particular team, the transfer market movement with high fees, and more.</p>\n<p>In the front-end, the table generated with this block includes information such as the player name, the player citizenship, the teams involved in the transfer, the date of the transfer, the market value of the player, the fee paid to complete the transfer, and more.</p>\n<h4>Trophies</h4>\n<p>Use this block to display the trophies won by a team with information like the type of trophy or the data on which the trophy has been assigned.</p>\n<p>Use this feature, for example, to list the UEFA Champions League winners or to list the winners of local soccer competitions.</p>\n<h4>Unavailable players</h4>\n<p>Use this element to list the unavailable players. This list includes the name of the player, the reason for the unavailability, the date range on which the player is unavailable, and optionally other player information.</p>\n<h3>Notable features of this soccer plugin</h3>\n<h4>Vector graphics</h4>\n<p>The plugin uses dynamic and customizable SVGs to represent icons and other graphical elements like the soccer fields, the clocks used to display the minute of an event, etc.</p>\n<h4>Customizable style</h4>\n<p>A total of 40 style options allows you to customize the colors and the typography of the elements generated by the plugin. So you can easily create your own unique and consistent style.</p>\n<h4>The events system</h4>\n<p>Events are the single units used to generate the match statistics. Examples of events are goals, yellow cards, red cards, and substitutions.</p>\n<p>By entering events, you will be able to display match commentaries, generate event tooltips with details of the events, and more. In addition, the events data allows the plugin to generate computed statistics.</p>\n<h4>Customizable competitions</h4>\n<p>The plugin allows you to create competitions of type <a href=\"https://en.wikipedia.org/wiki/Round-robin_tournament\" rel=\"nofollow ugc\">Round-robin</a> and <a href=\"https://en.wikipedia.org/wiki/Single-elimination_tournament\" rel=\"nofollow ugc\">Elimination</a> with a custom number of participating teams.</p>\n<p>These two types of competition are the foundations for any soccer tournament. For example, you can easily create the English Premier League by making a Round-robin tournament with 20 teams or set up the knockout stage of the Champions League by using an Elimination tournament with 16 teams.</p>\n<h4>Credits</h4>\n<p>This plugin makes use of the following resources:</p>\n<ul>\n<li><a href=\"https://github.com/harvesthq/chosen\" rel=\"nofollow ugc\">Chosen</a> licensed under the <a href=\"http://www.opensource.org/licenses/mit-license.php\" rel=\"nofollow ugc\">MIT License</a></li>\n<li>Flags icons by <a href=\"https://www.gosquared.com/\" rel=\"nofollow ugc\">GoSquared</a> licensed under the <a href=\"http://www.opensource.org/licenses/mit-license.php\" rel=\"nofollow ugc\">MIT License</a></li>\n<li>The ball icon used in the back-end menus is part of <a href=\"https://github.com/FortAwesome/Font-Awesome\" rel=\"nofollow ugc\">Font Awesome</a> and is licensed under the <a href=\"https://scripts.sil.org/cms/scripts/page.php?site_id=nrsi&amp;id=OFL\" rel=\"nofollow ugc\">SIL license</a>.</li>\n</ul>\n<p>For each library you can find the actual copy of the license inside the folder used to store the library files.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/soccer-engine-lite.1.13.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/soccer-engine-lite/assets/screenshot-1.png?rev=2683027",
            "caption": "Matches menu"
        },
        {
            "src": "https://ps.w.org/soccer-engine-lite/assets/screenshot-2.png?rev=2683027",
            "caption": "Events menu"
        },
        {
            "src": "https://ps.w.org/soccer-engine-lite/assets/screenshot-3.png?rev=2683027",
            "caption": "Options menu in the \"Colors\" tab"
        },
        {
            "src": "https://ps.w.org/soccer-engine-lite/assets/screenshot-4.png?rev=2683027",
            "caption": "Options menu in the \"Advanced\" tab"
        },
        {
            "src": "https://ps.w.org/soccer-engine-lite/assets/screenshot-5.png?rev=2683027",
            "caption": "Some of the plugin blocks in the post editor"
        },
        {
            "src": "https://ps.w.org/soccer-engine-lite/assets/screenshot-6.png?rev=2683027",
            "caption": "Soccer field with the players in the starting lineup"
        },
        {
            "src": "https://ps.w.org/soccer-engine-lite/assets/screenshot-7.png?rev=2683027",
            "caption": "Match commentary"
        },
        {
            "src": "https://ps.w.org/soccer-engine-lite/assets/screenshot-8.png?rev=2683027",
            "caption": "The profile page of a player"
        },
        {
            "src": "https://ps.w.org/soccer-engine-lite/assets/screenshot-9.png?rev=2683027",
            "caption": "Staff members listed in a paginated table"
        },
        {
            "src": "https://ps.w.org/soccer-engine-lite/assets/screenshot-10.png?rev=2683027",
            "caption": "Transfer market movements listed in a paginated table"
        },
        {
            "src": "https://ps.w.org/soccer-engine-lite/assets/screenshot-11.png?rev=2683027",
            "caption": "The rounds of a competitions"
        },
        {
            "src": "https://ps.w.org/soccer-engine-lite/assets/screenshot-12.png?rev=2683027",
            "caption": "The league table of a competition"
        }
    ],
    "tags": {
        "fixtures": "fixtures",
        "football": "football",
        "league": "league",
        "soccer": "soccer",
        "sports": "sports"
    },
    "stable_tag": "1.13",
    "versions": {
        "1.07": "https://downloads.wordpress.org/plugin/soccer-engine-lite.1.07.zip",
        "1.08": "https://downloads.wordpress.org/plugin/soccer-engine-lite.1.08.zip",
        "1.09": "https://downloads.wordpress.org/plugin/soccer-engine-lite.1.09.zip",
        "1.10": "https://downloads.wordpress.org/plugin/soccer-engine-lite.1.10.zip",
        "1.11": "https://downloads.wordpress.org/plugin/soccer-engine-lite.1.11.zip",
        "1.12": "https://downloads.wordpress.org/plugin/soccer-engine-lite.1.12.zip",
        "1.13": "https://downloads.wordpress.org/plugin/soccer-engine-lite.1.13.zip",
        "trunk": "https://downloads.wordpress.org/plugin/soccer-engine-lite.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://daext.com",
    "banners": {
        "low": "https://ps.w.org/soccer-engine-lite/assets/banner-772x250.png?rev=2683027",
        "high": "https://ps.w.org/soccer-engine-lite/assets/banner-1544x500.png?rev=2683027"
    },
    "icons": {
        "1x": "https://ps.w.org/soccer-engine-lite/assets/icon.svg?rev=2683027",
        "svg": "https://ps.w.org/soccer-engine-lite/assets/icon.svg?rev=2683027"
    },
    "blocks": {
        "daextsoenl/player-summary": {
            "name": "daextsoenl/player-summary",
            "title": "Player Summary"
        },
        "daextsoenl/transfers": {
            "name": "daextsoenl/transfers",
            "title": "Transfers"
        },
        "daextsoenl/team-contracts": {
            "name": "daextsoenl/team-contracts",
            "title": "Team Contracts"
        },
        "daextsoenl/agency-contracts": {
            "name": "daextsoenl/agency-contracts",
            "title": "Agency Contracts"
        },
        "daextsoenl/players": {
            "name": "daextsoenl/players",
            "title": "Players"
        },
        "daextsoenl/player-awards": {
            "name": "daextsoenl/player-awards",
            "title": "Player Awards"
        },
        "daextsoenl/unavailable-players": {
            "name": "daextsoenl/unavailable-players",
            "title": "Unavailable Players"
        },
        "daextsoenl/injuries": {
            "name": "daextsoenl/injuries",
            "title": "Injuries"
        },
        "daextsoenl/staff": {
            "name": "daextsoenl/staff",
            "title": "Staff"
        },
        "daextsoenl/staff-awards": {
            "name": "daextsoenl/staff-awards",
            "title": "Staff Awards"
        },
        "daextsoenl/trophies": {
            "name": "daextsoenl/trophies",
            "title": "Trophies"
        },
        "daextsoenl/matches": {
            "name": "daextsoenl/matches",
            "title": "Matches"
        },
        "daextsoenl/ranking-transitions": {
            "name": "daextsoenl/ranking-transitions",
            "title": "Ranking Transitions"
        },
        "daextsoenl/market-value-transitions": {
            "name": "daextsoenl/market-value-transitions",
            "title": "Market Value Transitions"
        },
        "daextsoenl/match-commentary": {
            "name": "daextsoenl/match-commentary",
            "title": "Match Commentary"
        },
        "daextsoenl/match-lineup": {
            "name": "daextsoenl/match-lineup",
            "title": "Match Lineup"
        },
        "daextsoenl/match-visual-lineup": {
            "name": "daextsoenl/match-visual-lineup",
            "title": "Match Visual Lineup"
        },
        "daextsoenl/match-substitutions": {
            "name": "daextsoenl/match-substitutions",
            "title": "Match Substitutions"
        },
        "daextsoenl/match-staff": {
            "name": "daextsoenl/match-staff",
            "title": "Match Staff"
        },
        "daextsoenl/squad-lineup": {
            "name": "daextsoenl/squad-lineup",
            "title": "Squad Lineup"
        },
        "daextsoenl/squad-substitutions": {
            "name": "daextsoenl/squad-substitutions",
            "title": "Squad Substitutions"
        },
        "daextsoenl/squad-staff": {
            "name": "daextsoenl/squad-staff",
            "title": "Squad Staff"
        },
        "daextsoenl/competition-standings-table": {
            "name": "daextsoenl/competition-standings-table",
            "title": "Competition Standings Table"
        },
        "daextsoenl/competition-round": {
            "name": "daextsoenl/competition-round",
            "title": "Competition Round"
        },
        "daextsoenl/match-score": {
            "name": "daextsoenl/match-score",
            "title": "Match Score"
        },
        "daextsoenl/staff-summary": {
            "name": "daextsoenl/staff-summary",
            "title": "Staff Summary"
        },
        "daextsoenl/referee-summary": {
            "name": "daextsoenl/referee-summary",
            "title": "Referee Summary"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "soccer-engine-lite",
            "language": "it_IT",
            "version": "1.13",
            "updated": "2024-01-25 19:06:26",
            "package": "https://downloads.wordpress.org/translation/plugin/soccer-engine-lite/1.13/it_IT.zip"
        }
    ]
}