{
    "name": "Super Product Filter",
    "slug": "super-product-filter",
    "version": "1.0.3",
    "author": "<a href=\"https://hashthemes.com\">HashThemes</a>",
    "author_profile": "https://profiles.wordpress.org/hashthemes/",
    "contributors": {
        "hashthemes": {
            "profile": "https://profiles.wordpress.org/hashthemes/",
            "avatar": "https://secure.gravatar.com/avatar/d0ff68cef9d6f3cd414b968df21decee?s=96&d=monsterid&r=g",
            "display_name": "HashThemes"
        }
    },
    "requires": "5.0",
    "tested": "6.6.2",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/super-product-filter/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 0,
    "downloaded": 110,
    "last_updated": "2024-09-11 04:54:00",
    "added": "2024-08-25",
    "homepage": "https://demo.hashthemes.com/super-woocommerce-product-filter/",
    "sections": {
        "description": "<p>The Super Product Filter is a powerful WordPress plugin developed to enhance the shopping experience on WooCommerce-powered websites. This plugin allows customers to quickly and easily filter products by various attributes such as categories, price range, color, size, brand, and more.</p>\n<p>With its user-friendly interface, the plugin integrates seamlessly into any WooCommerce store, providing real-time filtering that updates product listings instantly as users adjust their preferences.</p>\n<p>Perfect for online retailers with extensive product catalogs, this plugin empowers customers to find exactly what they’re looking for with ease, transforming browsing into a streamlined and efficient process.</p>\n<h3>Test Dashboard</h3>\n<p>Explore a test dashboard to get a hands on experience with our features and functionalities. Visit <a href=\"https://tastewp.com/plugins/super-product-filter/\" rel=\"nofollow ugc\">Test Dashboard</a> to access the test environment.</p>\n<p>Feel free to experiment, and if you have any feedback or encounter issues, please let us know through our support tickets.</p>\n<h3>Real Time AJAX Filtering</h3>\n<p>Real-Time AJAX Filtering ensures that product search results update instantly as users adjust their filters without requiring a page reload. This dynamic feature enhances the shopping experience by providing immediate feedback, allowing customers to see filtered results in real-time.</p>\n<h3>Customizable Layouts</h3>\n<p>Customizable Layouts offer flexibility in how filters are displayed on your website. You can choose from various layout options, such as dropdowns, checkboxes, buttons, or sliders, and arrange them in horizontal or vertical orientations to best fit your site&#8217;s design. Additionally, you can tailor the appearance of the filters by adjusting colors, fonts, and spacing to match your branding and enhance user experience.</p>\n<h3>Compatibility with any WooCommerce Themes</h3>\n<p>Integrates seamlessly with all WooCommerce themes, regardless of their design or structure. This feature allows you to implement powerful filtering capabilities without worrying about theme conflicts or layout issues. Whether you&#8217;re using a custom theme or a popular pre-designed option, the plugin adjusts to fit your theme&#8217;s look and feel, providing a consistent and cohesive user experience. This compatibility makes it easy to enhance your store&#8217;s functionality while maintaining the aesthetic integrity of your website.</p>\n<h3>Compatible with any Page Builder</h3>\n<p>The plugin works seamlessly with all major WordPress page builders, such as Elementor, WPBakery, and Beaver Builder. This feature allows you to integrate advanced filtering options into your custom page layouts without any conflicts or limitations. Whether you&#8217;re designing your pages with a drag-and-drop builder or a more advanced page creation tool, the plugin adapts to your builder&#8217;s interface, providing a smooth and flexible experience.</p>\n<h3>Multiple Filter Type</h3>\n<ul>\n<li>Radio</li>\n<li>Checkbox</li>\n<li>Button</li>\n<li>Toggle</li>\n<li>Multi Select</li>\n<li>Pricing Slider</li>\n<li>Color Box</li>\n<li>Image Box</li>\n<li>Rating Star</li>\n</ul>\n<h3>Category and Tag Filter</h3>\n<p>Effortlessly refine the product searches by selecting specific categories and tags. This feature enhances the shopping experience by enabling users to quickly narrow down options and find relevant products based on organized categories or specific tags, all with real-time updates and customizable display options.</p>\n<h3>Attribute Based Filters</h3>\n<p>Attribute-Based Filters allow customers to refine their product searches based on specific attributes like color, size, material, and more. By selecting multiple attributes, users can quickly narrow down their options, leading to a more personalized shopping experience.</p>\n<h3>Price Range Filter</h3>\n<p>Price Range Filters enable customers to quickly find products within their budget by allowing them to set a specific price range. This intuitive feature uses a slider or input fields to define the minimum and maximum price, instantly updating the product listings to match the selected range.</p>\n<h3>Rating and Reviews Filter</h3>\n<p>Rating and Reviews Filters empower customers to refine their product searches based on customer ratings and reviews. By selecting a specific rating threshold, users can easily filter out products that don’t meet their quality expectations, focusing only on top-rated items.</p>\n<h3>Stock Availability Filter</h3>\n<p>Find products that are currently in stock or available for purchase. This feature enables users to filter out out-of-stock items and focus on products that can be immediately purchased or shipped.</p>\n<h3>Discount and Sale Filter</h3>\n<p>Easily find products that are currently on sale or offered at a discounted price. Users can filter results to display only items with active promotions, markdowns, or special offers. This feature highlights savings opportunities and helps shoppers quickly locate the best deals.</p>\n<h3>Reset Filter Button</h3>\n<p>Quickly clear all applied filters and return to the default product view. By clicking this button, users can effortlessly remove all selections for categories, attributes, price ranges, ratings, and other filters, simplifying the process of starting a new search.</p>\n<h3>Selectively Include and Exclude Product Categories and Attributes<br />\n</h3>\n<p>You can include specific categories or attributes that are relevant to your product range while excluding those that are not applicable. This feature helps streamline the filtering process, ensuring that users only see relevant options, which can enhance their browsing experience and improve the efficiency of product searches.</p>\n<h3>Display Anywhere on any Pages</h3>\n<p>Position filters wherever you need them on your website. Whether you want to place them in sidebars, headers, footers, or directly within product or shop pages, this feature allows you to use widgets or shortcodes for versatile placement.</p>\n<h3>Widget and Shortcode Support</h3>\n<p>Easily integrate filters into various parts of your website using widgets or shortcodes. You can place filters in sidebars, headers, footers, or any page or post by simply adding a widget to a designated area or inserting a shortcode where you want the filters to appear.</p>\n<h3>Display Product Count</h3>\n<p>Shows the number of products available within each filter category or attribute. This feature provides users with a clear indication of how many items meet their selected criteria, helping them gauge the variety and volume of products before applying filters. By displaying product counts, you enhance transparency and guide users in making more informed decisions.</p>\n<h3>Logic Operator (OR/AND)</h3>\n<p>Using AND logic, users can refine their search by selecting multiple criteria that must all be met simultaneously. With OR logic, users can select criteria where any one of the selected options will satisfy the filter. This feature provides greater flexibility and precision in filtering, allowing users to tailor their search results according to their specific needs and preferences.</p>\n<h3>Import and Export Filter Settings</h3>\n<p>Transfer your filter configurations between different sites or save them for future use. With this feature, you can export your filter settings into a file and import them into another site or restore them later. This functionality simplifies managing filter setups across multiple environments, making it easy to replicate or migrate filter configurations without having to manually reconfigure each setting.</p>\n<h3>Mobile Responsive</h3>\n<p>Filter interface adapts seamlessly to different screen sizes and devices, including smartphones and tablets. This feature optimizes the display and functionality of filters for touch interactions and smaller screens, providing a user-friendly experience across all devices.</p>\n<h3>Lightweight and Fast</h3>\n<p>The filter plugin operates efficiently without slowing down your website. The feature is optimized to minimize resource usage and maintain high performance, even with large product catalogs or high traffic volumes. This design focus helps provide a smooth, responsive user experience by ensuring that filters load quickly and don’t negatively impact page load times or overall site speed, contributing to better performance and user satisfaction.</p>\n<h3>Cross Browser Compatibility</h3>\n<p>The plugin functions consistently across all major web browsers, including Chrome, Firefox, Safari, Edge, and Internet Explorer. This feature ensures that users have a uniform experience regardless of their browser choice, avoiding issues such as display inconsistencies or functionality problems.</p>\n<h3>Multilingual and RTL Support</h3>\n<p>The plugin is compatible with multilingual sites and right-to-left (RTL) languages. It works seamlessly with translation plugins like WPML, allowing you to display filters in multiple languages. Additionally, it supports RTL text directions, making it suitable for languages such as Arabic and Hebrew.</p>\n<h3>Dedicated Support and Documentation</h3>\n<p>We provides users with comprehensive assistance and resources to effectively use and troubleshoot the filter plugin. The dedicated support includes responsive customer service and technical help to address any issues or questions. Detailed documentation offers step-by-step guides, setup instructions, and troubleshooting tips, ensuring that users can easily configure and customize the plugin to meet their needs.</p>\n<h3>Compatible with Advanced Custom Field (ACF) Plugin &#8211; <strong>PRO</strong></h3>\n<p>Integrates seamlessly with ACF, allowing you to utilize custom fields in your product filtering options. This compatibility enables you to filter products based on custom attributes or fields created with ACF, providing greater flexibility and customization. Whether you&#8217;re using ACF to add unique product attributes or additional data, this feature allows you to incorporate those custom fields into your filtering system, enhancing the relevance and precision of search results.</p>\n<h3>Step By Step Filtering &#8211; <strong>PRO</strong></h3>\n<p>This feature breaks down the filtering options into manageable stages, such as first selecting a category, then choosing attributes, and finally setting a price range. By presenting filters in a logical order, it simplifies the search process, helps users make more informed choices, and improves the overall user experience by reducing overwhelm and ensuring that each filter choice is relevant to the next.</p>\n<h3>Conditional Display of Filters by Product Category or Tag &#8211; <strong>PRO</strong></h3>\n<p>Allows you to show or hide specific filters based on the selected product category or tag. This feature ensures that only relevant filters are displayed, depending on the user&#8217;s current selection, which streamlines the browsing experience and reduces clutter.</p>\n<h3>Display as OffCanvas Menu &#8211; <strong>PRO</strong></h3>\n<p>Provides a sleek and modern way to present filters by sliding them in from the side of the screen. This off-canvas menu can be accessed via a button or icon, allowing users to expand or collapse the filter options as needed. This design saves valuable screen space and keeps the interface clean, making it ideal for mobile and desktop views alike.</p>\n<h3>Get Started Today!</h3>\n<p>Ready to transform your WooCommerce store? Install Super Product Filter now and empower your customers with a superior shopping experience.</p>\n<h3>Premium Upgrade</h3>\n<p>For premium upgrade, please click below link <br />\n<a href=\"https://1.envato.market/eK5yrQ\" rel=\"nofollow ugc\">Super WooCommerce Product Filter</a> | <a href=\"https://demo.hashthemes.com/super-woocommerce-product-filter/\" rel=\"nofollow ugc\">Premium Demos</a></p>\n",
        "installation": "<li>Go to WordPress Dashboard &gt; Plugins &gt; Add New</li>\n<li>Search for &#8220;Super Product Filter&#8221; and install the plugin</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n",
        "changelog": "<h4>1.0.3 &#8211; 11 Sep, 2024</h4>\n<ul>\n<li>Filter block minor bug fixed</li>\n</ul>\n<h4>1.0.2 &#8211; 3 Sep, 2024</h4>\n<ul>\n<li>Added Elementor Module of Filter</li>\n<li>Added Elementor Block of Filter</li>\n</ul>\n<h4>1.0.1 &#8211; 26 Aug, 2024</h4>\n<ul>\n<li>Code Formating</li>\n<li>Description on readme.txt file updated</li>\n</ul>\n<h4>1.0 &#8211; 25 Aug, 2024</h4>\n<ul>\n<li>Release</li>\n</ul>\n"
    },
    "short_description": "Enhance your shopping experience by using a product filter that streamlines the selection process, ensuring you find the perfect product effortlessly.",
    "description": "<p>The Super Product Filter is a powerful WordPress plugin developed to enhance the shopping experience on WooCommerce-powered websites. This plugin allows customers to quickly and easily filter products by various attributes such as categories, price range, color, size, brand, and more.</p>\n<p>With its user-friendly interface, the plugin integrates seamlessly into any WooCommerce store, providing real-time filtering that updates product listings instantly as users adjust their preferences.</p>\n<p>Perfect for online retailers with extensive product catalogs, this plugin empowers customers to find exactly what they’re looking for with ease, transforming browsing into a streamlined and efficient process.</p>\n<h3>Test Dashboard</h3>\n<p>Explore a test dashboard to get a hands on experience with our features and functionalities. Visit <a href=\"https://tastewp.com/plugins/super-product-filter/\" rel=\"nofollow ugc\">Test Dashboard</a> to access the test environment.</p>\n<p>Feel free to experiment, and if you have any feedback or encounter issues, please let us know through our support tickets.</p>\n<h3>Real Time AJAX Filtering</h3>\n<p>Real-Time AJAX Filtering ensures that product search results update instantly as users adjust their filters without requiring a page reload. This dynamic feature enhances the shopping experience by providing immediate feedback, allowing customers to see filtered results in real-time.</p>\n<h3>Customizable Layouts</h3>\n<p>Customizable Layouts offer flexibility in how filters are displayed on your website. You can choose from various layout options, such as dropdowns, checkboxes, buttons, or sliders, and arrange them in horizontal or vertical orientations to best fit your site&#8217;s design. Additionally, you can tailor the appearance of the filters by adjusting colors, fonts, and spacing to match your branding and enhance user experience.</p>\n<h3>Compatibility with any WooCommerce Themes</h3>\n<p>Integrates seamlessly with all WooCommerce themes, regardless of their design or structure. This feature allows you to implement powerful filtering capabilities without worrying about theme conflicts or layout issues. Whether you&#8217;re using a custom theme or a popular pre-designed option, the plugin adjusts to fit your theme&#8217;s look and feel, providing a consistent and cohesive user experience. This compatibility makes it easy to enhance your store&#8217;s functionality while maintaining the aesthetic integrity of your website.</p>\n<h3>Compatible with any Page Builder</h3>\n<p>The plugin works seamlessly with all major WordPress page builders, such as Elementor, WPBakery, and Beaver Builder. This feature allows you to integrate advanced filtering options into your custom page layouts without any conflicts or limitations. Whether you&#8217;re designing your pages with a drag-and-drop builder or a more advanced page creation tool, the plugin adapts to your builder&#8217;s interface, providing a smooth and flexible experience.</p>\n<h3>Multiple Filter Type</h3>\n<ul>\n<li>Radio</li>\n<li>Checkbox</li>\n<li>Button</li>\n<li>Toggle</li>\n<li>Multi Select</li>\n<li>Pricing Slider</li>\n<li>Color Box</li>\n<li>Image Box</li>\n<li>Rating Star</li>\n</ul>\n<h3>Category and Tag Filter</h3>\n<p>Effortlessly refine the product searches by selecting specific categories and tags. This feature enhances the shopping experience by enabling users to quickly narrow down options and find relevant products based on organized categories or specific tags, all with real-time updates and customizable display options.</p>\n<h3>Attribute Based Filters</h3>\n<p>Attribute-Based Filters allow customers to refine their product searches based on specific attributes like color, size, material, and more. By selecting multiple attributes, users can quickly narrow down their options, leading to a more personalized shopping experience.</p>\n<h3>Price Range Filter</h3>\n<p>Price Range Filters enable customers to quickly find products within their budget by allowing them to set a specific price range. This intuitive feature uses a slider or input fields to define the minimum and maximum price, instantly updating the product listings to match the selected range.</p>\n<h3>Rating and Reviews Filter</h3>\n<p>Rating and Reviews Filters empower customers to refine their product searches based on customer ratings and reviews. By selecting a specific rating threshold, users can easily filter out products that don’t meet their quality expectations, focusing only on top-rated items.</p>\n<h3>Stock Availability Filter</h3>\n<p>Find products that are currently in stock or available for purchase. This feature enables users to filter out out-of-stock items and focus on products that can be immediately purchased or shipped.</p>\n<h3>Discount and Sale Filter</h3>\n<p>Easily find products that are currently on sale or offered at a discounted price. Users can filter results to display only items with active promotions, markdowns, or special offers. This feature highlights savings opportunities and helps shoppers quickly locate the best deals.</p>\n<h3>Reset Filter Button</h3>\n<p>Quickly clear all applied filters and return to the default product view. By clicking this button, users can effortlessly remove all selections for categories, attributes, price ranges, ratings, and other filters, simplifying the process of starting a new search.</p>\n<h3>Selectively Include and Exclude Product Categories and Attributes<br />\n</h3>\n<p>You can include specific categories or attributes that are relevant to your product range while excluding those that are not applicable. This feature helps streamline the filtering process, ensuring that users only see relevant options, which can enhance their browsing experience and improve the efficiency of product searches.</p>\n<h3>Display Anywhere on any Pages</h3>\n<p>Position filters wherever you need them on your website. Whether you want to place them in sidebars, headers, footers, or directly within product or shop pages, this feature allows you to use widgets or shortcodes for versatile placement.</p>\n<h3>Widget and Shortcode Support</h3>\n<p>Easily integrate filters into various parts of your website using widgets or shortcodes. You can place filters in sidebars, headers, footers, or any page or post by simply adding a widget to a designated area or inserting a shortcode where you want the filters to appear.</p>\n<h3>Display Product Count</h3>\n<p>Shows the number of products available within each filter category or attribute. This feature provides users with a clear indication of how many items meet their selected criteria, helping them gauge the variety and volume of products before applying filters. By displaying product counts, you enhance transparency and guide users in making more informed decisions.</p>\n<h3>Logic Operator (OR/AND)</h3>\n<p>Using AND logic, users can refine their search by selecting multiple criteria that must all be met simultaneously. With OR logic, users can select criteria where any one of the selected options will satisfy the filter. This feature provides greater flexibility and precision in filtering, allowing users to tailor their search results according to their specific needs and preferences.</p>\n<h3>Import and Export Filter Settings</h3>\n<p>Transfer your filter configurations between different sites or save them for future use. With this feature, you can export your filter settings into a file and import them into another site or restore them later. This functionality simplifies managing filter setups across multiple environments, making it easy to replicate or migrate filter configurations without having to manually reconfigure each setting.</p>\n<h3>Mobile Responsive</h3>\n<p>Filter interface adapts seamlessly to different screen sizes and devices, including smartphones and tablets. This feature optimizes the display and functionality of filters for touch interactions and smaller screens, providing a user-friendly experience across all devices.</p>\n<h3>Lightweight and Fast</h3>\n<p>The filter plugin operates efficiently without slowing down your website. The feature is optimized to minimize resource usage and maintain high performance, even with large product catalogs or high traffic volumes. This design focus helps provide a smooth, responsive user experience by ensuring that filters load quickly and don’t negatively impact page load times or overall site speed, contributing to better performance and user satisfaction.</p>\n<h3>Cross Browser Compatibility</h3>\n<p>The plugin functions consistently across all major web browsers, including Chrome, Firefox, Safari, Edge, and Internet Explorer. This feature ensures that users have a uniform experience regardless of their browser choice, avoiding issues such as display inconsistencies or functionality problems.</p>\n<h3>Multilingual and RTL Support</h3>\n<p>The plugin is compatible with multilingual sites and right-to-left (RTL) languages. It works seamlessly with translation plugins like WPML, allowing you to display filters in multiple languages. Additionally, it supports RTL text directions, making it suitable for languages such as Arabic and Hebrew.</p>\n<h3>Dedicated Support and Documentation</h3>\n<p>We provides users with comprehensive assistance and resources to effectively use and troubleshoot the filter plugin. The dedicated support includes responsive customer service and technical help to address any issues or questions. Detailed documentation offers step-by-step guides, setup instructions, and troubleshooting tips, ensuring that users can easily configure and customize the plugin to meet their needs.</p>\n<h3>Compatible with Advanced Custom Field (ACF) Plugin &#8211; <strong>PRO</strong></h3>\n<p>Integrates seamlessly with ACF, allowing you to utilize custom fields in your product filtering options. This compatibility enables you to filter products based on custom attributes or fields created with ACF, providing greater flexibility and customization. Whether you&#8217;re using ACF to add unique product attributes or additional data, this feature allows you to incorporate those custom fields into your filtering system, enhancing the relevance and precision of search results.</p>\n<h3>Step By Step Filtering &#8211; <strong>PRO</strong></h3>\n<p>This feature breaks down the filtering options into manageable stages, such as first selecting a category, then choosing attributes, and finally setting a price range. By presenting filters in a logical order, it simplifies the search process, helps users make more informed choices, and improves the overall user experience by reducing overwhelm and ensuring that each filter choice is relevant to the next.</p>\n<h3>Conditional Display of Filters by Product Category or Tag &#8211; <strong>PRO</strong></h3>\n<p>Allows you to show or hide specific filters based on the selected product category or tag. This feature ensures that only relevant filters are displayed, depending on the user&#8217;s current selection, which streamlines the browsing experience and reduces clutter.</p>\n<h3>Display as OffCanvas Menu &#8211; <strong>PRO</strong></h3>\n<p>Provides a sleek and modern way to present filters by sliding them in from the side of the screen. This off-canvas menu can be accessed via a button or icon, allowing users to expand or collapse the filter options as needed. This design saves valuable screen space and keeps the interface clean, making it ideal for mobile and desktop views alike.</p>\n<h3>Get Started Today!</h3>\n<p>Ready to transform your WooCommerce store? Install Super Product Filter now and empower your customers with a superior shopping experience.</p>\n<h3>Premium Upgrade</h3>\n<p>For premium upgrade, please click below link <br />\n<a href=\"https://1.envato.market/eK5yrQ\" rel=\"nofollow ugc\">Super WooCommerce Product Filter</a> | <a href=\"https://demo.hashthemes.com/super-woocommerce-product-filter/\" rel=\"nofollow ugc\">Premium Demos</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/super-product-filter.1.0.3.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "ajax-filter": "ajax filter",
        "ajax-product-filter": "ajax product filter",
        "product-filter": "product filter",
        "woocommerce-ajax-filter": "woocommerce ajax filter",
        "woocommerce-filter": "woocommerce filter"
    },
    "stable_tag": "1.0.3",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/super-product-filter.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/super-product-filter.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/super-product-filter.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/super-product-filter.1.0.3.zip",
        "trunk": "https://downloads.wordpress.org/plugin/super-product-filter.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/super-product-filter/assets/banner-772x250.jpg?rev=3141021",
        "high": "https://ps.w.org/super-product-filter/assets/banner-1544x500.jpg?rev=3141021"
    },
    "icons": {
        "1x": "https://ps.w.org/super-product-filter/assets/icon-128x128.png?rev=3141021",
        "2x": "https://ps.w.org/super-product-filter/assets/icon-256x256.png?rev=3141021"
    },
    "blocks": {
        "swpf/product-filter": {
            "name": "swpf/product-filter",
            "title": "Swpf Product Filter"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}