{
    "name": "SupportCandy &#8211; Helpdesk &amp; Customer Support Ticket System",
    "slug": "supportcandy",
    "version": "3.2.9",
    "author": "<a href=\"https://supportcandy.net/\">SupportCandy</a>",
    "author_profile": "https://profiles.wordpress.org/supportcandy/",
    "contributors": {
        "supportcandy": {
            "profile": "https://profiles.wordpress.org/supportcandy/",
            "avatar": "https://secure.gravatar.com/avatar/2dc14b33d8fe152bbb62e11d6d43b3ef?s=96&d=monsterid&r=g",
            "display_name": "SupportCandy"
        },
        "pradeepmakone07": {
            "profile": "https://profiles.wordpress.org/pradeepmakone07/",
            "avatar": "https://secure.gravatar.com/avatar/5d19e743cb90809780f701a28fff386f?s=96&d=monsterid&r=g",
            "display_name": "Pradeep Makone"
        },
        "nsgawli": {
            "profile": "https://profiles.wordpress.org/nsgawli/",
            "avatar": "https://secure.gravatar.com/avatar/5030db3c78e7188d49d81dd1d705da2d?s=96&d=monsterid&r=g",
            "display_name": "Nikhil G"
        }
    },
    "requires": "5.6",
    "tested": "6.6.1",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 249,
        "4": 7,
        "3": 3,
        "2": 2,
        "1": 4
    },
    "num_ratings": 265,
    "support_url": "https://wordpress.org/support/plugin/supportcandy/",
    "support_threads": 11,
    "support_threads_resolved": 4,
    "active_installs": 10000,
    "downloaded": 362597,
    "last_updated": "2024-08-12 10:40:00",
    "added": "2018-08-15",
    "homepage": "https://wordpress.org/plugins/supportcandy/",
    "sections": {
        "description": "<p><em>THE SIMPLE, SECURE AND FEATURE-RICH SUPPORT TICKETING SYSTEM PLUGIN FOR YOUR WORDPRESS SITE.</em></p>\n<p>SupportCandy adds to your WordPress site the features of a complete help desk and customer support ticket system. It is one of the oldest helpdesk &amp; customer support ticketing plugin available for WordPress.</p>\n<p>We stand as a remarkably versatile and feature-packed help desk and ticket management plugin. Elevate your customer support game by effortlessly handling and resolving customer queries directly from the comfort of your WordPress dashboard.</p>\n<p>SupportCandy Helpdesk is the ultimate solution for all your helpdesk and support ticketing needs within WordPress, featuring features comparable to those offered by top-tier SaaS solutions such as Zendesk, Help Scout, or Freshdesk.</p>\n<div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/858235638\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n<p><a href=\"https://supportcandy.net/docs-category/getting-started/\" rel=\"nofollow ugc\">Follow this</a> getting started guide and be ready to support your customers like never before within a few minutes!</p>\n<p><a href=\"https://supportcandy.net/\" rel=\"nofollow ugc\">Click here</a> to visit our official website.</p>\n<p><em>YOUR WORDPRESS-BASED SELF-HOSTED CUSTOMER SUPPORT SOLUTION BACKED BY UNPARALLEL TECHNICAL SUPPORT</em></p>\n<p>While we prioritize technical support for our paid users, we are committed to assisting each and every customer promptly. Our dedication ensures that all users receive the assistance they need as quickly as possible. Moreover, we offer best-in-class customer support and maximum features in our free version, setting us apart from others in the industry.</p>\n<p>In addition to ticket management, you can assign multiple specific permission levels to agents and customers. Gain access to detailed reports concerning your customers, agents, and the overall productivity of your customer support desk. By navigating through the ticket view, you can gain a comprehensive 360-degree perspective of your customers, including their past tickets, purchase history, membership levels, and more. Armed with this wealth of customer data alongside their queries, you can accomplish much more.</p>\n<p>SupportCandy is a self-hosted support ticket plugin offers limitless tickets, support agents, users, tags, and more. There are no constraints, as you maintain ownership of your system and data.</p>\n<h4>Key features :</h4>\n<ul>\n<li>Unlimited number of tickets</li>\n<li>Unlimited number of agents and agent roles</li>\n<li>Unlimited number of customers</li>\n<li>Unlimited tags, categories, and custom statuses</li>\n<li>Dashboard for agents</li>\n<li>Activity logs for administrators</li>\n<li>Advanced custom filter and search functionality</li>\n<li>Saved filters for customers and agents</li>\n<li>Shortcodes for Agent Portal/Customer Portal</li>\n<li>Private notes for internal communication of agents</li>\n<li>Agents can create a ticket on the customer&#8217;s behalf</li>\n<li>Agent Collision to avoid repetitive messages and confusion</li>\n<li>16+ Custom field types</li>\n<li>User Registration</li>\n<li>Ticket fields for additional information about ticket</li>\n<li>Agent-only fields to keep internal data of the ticket</li>\n<li>Customer fields to store information about the customer across the tickets</li>\n<li>Guest tickets (disabled by default)</li>\n<li>Guest can also see their ticket list using OTP Login (One Time Password)</li>\n<li>Rich-text editor (customizable)</li>\n<li>Email notifications</li>\n<li>Working hours, exceptions, and holidays for support agent</li>\n<li>Google reCaptcha integration</li>\n<li>GDPR Compatibility with data retention and deletion feature</li>\n<li>Terms &amp; Conditions checkbox in the ticket form</li>\n<li>Macros or placeholders for ticket fields</li>\n<li>Unlimited File Attachment to ticket and reply. Manage allowed file types.</li>\n<li>Rest APIs Support</li>\n<li>Customizable Appearance to match up with your theme</li>\n<li>Auto delete closed tickets</li>\n</ul>\n<h4>Premium Add-Ons :</h4>\n<ul>\n<li><a href=\"https://supportcandy.net/email-piping/\" rel=\"nofollow ugc\">Email Piping</a> &#8211; The Email Piping extension in SupportCandy revolutionizes WordPress customer support by enabling users to create and respond to tickets directly from their email inboxes. This streamlines communication, eliminating the need for repeated website visits. With three piping methods, including Basic IMAP, Gmail and Microsoft Exchange.</li>\n<li><a href=\"https://supportcandy.net/woocommerce-integration/\" rel=\"nofollow ugc\">WooCommerce Integration</a> &#8211; The WooCommerce integration transforms customer support by seamlessly linking WooCommerce functionalities with the WordPress helpdesk plugin. Customers can effortlessly select orders and products within the ticket form, enhancing the assistance-seeking process. Agents gain a comprehensive view of customer order details, including order history and total spent, directly within the ticket. Add a support tab on the My Account page and a help button for orders.</li>\n<li><a href=\"https://supportcandy.net/canned-reply/\" rel=\"nofollow ugc\">Canned Reply</a> &#8211; The Canned Reply extension streamlines customer support in the WordPress helpdesk plugin by enabling agents to save and quickly access frequently used responses. Agents can effortlessly store and organize multiple replies, utilizing macros for added versatility. With a simple click, agents can retrieve canned responses, eliminating the need to remember information each time and significantly saving time. The extension also allows administrators to create public canned responses for universal accessibility.</li>\n<li><a href=\"https://supportcandy.net/assign-agent-rules/\" rel=\"nofollow ugc\">Assign Agent Rules</a> &#8211; Assign Agent Rules extension simplifies agent assignment in the WordPress helpdesk plugin by automating the process based on predefined rules. Administrators set conditions and agents/agent groups for automatic assignment, eliminating the need for tedious manual assignments. When customers create tickets, the system matches conditions and assigns agents accordingly.</li>\n<li><a href=\"https://supportcandy.net/sla/\" rel=\"nofollow ugc\">SLA (Service Lavel Agreement)</a> &#8211; The SLA extension in SupportCandy&#8217;s helpdesk plugin ensures timely responses and resolutions for various ticket types within the WordPress ticketing system. It automates SLA calculations using pre-set policies, allowing administrators to effortlessly uphold commitments. Calculate the due date based on rules for tickets to match. The remaining time is shown in the ticket list if added SLA field to the ticket list and individual ticket.</li>\n<li><a href=\"https://supportcandy.net/satisfaction-survey/\" rel=\"nofollow ugc\">Satisfaction Survey</a> &#8211; Satisfaction Survey extension for the WordPress helpdesk plugin streamlines customer feedback collection and user ratings for each closed ticket. Administrators can set up survey emails with customizable rating options. Customers receive these surveys after a specified number of days from closing the ticket, providing valuable insights.</li>\n<li><a href=\"https://supportcandy.net/automatic-close-tickets/\" rel=\"nofollow ugc\">Automatic Close Tickets</a> &#8211; Automatic Close Tickets extension automates the closure of inactive tickets in the WordPress ticketing system after a set period. Administrators can customize the closure criteria, including the number of days of inactivity and specific ticket statuses. The extension also facilitates customer engagement by sending warning emails before automatically closing tickets, ensuring a streamlined and organized workflow. This feature is valuable for efficiently managing and closing abandoned tickets while enhancing overall customer interaction within the helpdesk system.</li>\n<li><a href=\"https://supportcandy.net/usergroups/\" rel=\"nofollow ugc\">Usergroup</a> &#8211; Allow a group of users to access each other&#8217;s tickets.</li>\n<li><a href=\"https://supportcandy.net/agentgroups/\" rel=\"nofollow ugc\">Agentgoup</a> &#8211; Agentgroups extension streamlines ticket management by allowing the creation of agent groups or teams within the WordPress helpdesk plugin. Supervisors oversee ticket assignments within these groups, ensuring an efficient workflow. Tickets can be assigned to agentgroups, and supervisors manage assignments to group members.</li>\n<li><a href=\"https://supportcandy.net/schedule-tickets/\" rel=\"nofollow ugc\">Schedule Tickets</a> &#8211; Schedule Tickets allow administrators to effortlessly schedule recurring tickets for routine tasks. The system then automatically generates these tickets at the defined times, providing a streamlined approach to essential and repetitive processes. With versatile recurrence periods, customizable scheduling options, and the ability to set start and end dates, SupportCandy ensures comprehensive support for diverse ticketing needs.</li>\n<li><a href=\"https://supportcandy.net/knowledgebase-integrations-2/\" rel=\"nofollow ugc\">Knowledgebase Integrations</a> &#8211; Knowledgebase Integrations extend the capabilities of the WordPress helpdesk plugin, offering seamless integration with popular knowledge base tools. This powerful add-on enhances customer support by enabling agents to access and incorporate knowledge base content directly into their responses. By integrating with well-known plugins such as BetterDocs, Knowledgebase by UnboundStudio, and others, SupportCandy ensures a unified and efficient support system that empowers agents to leverage comprehensive documentation for swift issue resolution.</li>\n<li><a href=\"https://supportcandy.net/faq-integrations/\" rel=\"nofollow ugc\">FAQ Integrations</a> &#8211; SupportCandy integrates with popular FAQ plugins like Ultimate FAQ and Arconix FAQ, enhancing its helpdesk capabilities for efficient customer support.</li>\n<li><a href=\"https://supportcandy.net/export-tickets/\" rel=\"nofollow ugc\">Export Tickets</a> &#8211; Export tickets to CSV format so you can use it for various purposes such as generating reports.</li>\n<li><a href=\"https://supportcandy.net/reports/\" rel=\"nofollow ugc\">Reports</a> &#8211; Reports extension is an essential tool for WordPress helpdesk, offering auto-generated reports for Ticket Statistics, Response Delays, Ticket Closing Delays, and more. These reports provide a quick and detailed overview of your customer support, helping you measure and enhance efficiency over different timeframes. With customizable filters, you can focus on specific aspects, such as satisfaction survey ratings and custom fields. This extension ensures that you can make informed decisions, optimize support processes, and monitor business performance effectively.</li>\n<li><a href=\"https://supportcandy.net/timer/\" rel=\"nofollow ugc\">Timer</a> &#8211; Timer extension simplifies time tracking in the ticketing system. Agents can log time effortlessly, enhancing task efficiency. With customizable features, including auto-start for new tickets, the extension provides transparency for customers through a dedicated widget. Streamlining time tracking, SupportCandy&#8217;s Timer ensures a seamless support experience.</li>\n<li><a href=\"https://supportcandy.net/print-ticket/\" rel=\"nofollow ugc\">Print Ticket</a> &#8211; Print Ticket extension adds a print feature to individual tickets, allowing users to generate PDFs for a tangible record. Customize print pages with header, footer, and body templates, and enable/disable functionality as needed.</li>\n<li><a href=\"https://supportcandy.net/edd-integration/\" rel=\"nofollow ugc\">EDD Integration</a> &#8211; Easy Digital Downloads (EDD) integration with SupportCandy enhances the ticketing system, allowing customers to select orders and products directly within the ticket form. Agents can seamlessly view customer orders within the ticket, providing a comprehensive support experience. With added custom fields for EDD Product and EDD Order, this integration streamlines the process, empowering agents to access and manage order details efficiently.</li>\n<li><a href=\"https://supportcandy.net/gravity-forms-2/\" rel=\"nofollow ugc\">Gravity Forms Integration</a> &#8211; Integrate Gravity Forms with SupportCandy to create multiple ticket forms effortlessly, providing versatile options beyond the default setup. Customize forms as needed, allowing customers to submit tickets seamlessly, while automated mappings ensure a smooth transition of field values into SupportCandy. This integration enhances the flexibility and functionality of your customer support.</li>\n<li><a href=\"https://supportcandy.net/private-credentials/\" rel=\"nofollow ugc\">Private Credentials</a> &#8211; The Private Credentials extension in SupportCandy allows customers to securely share sensitive information within tickets, enhancing privacy. Encrypted storage ensures secure handling, with agents having controlled permissions for viewing, modifying, or automatically deleting credentials after ticket closure.</li>\n<li><a href=\"https://supportcandy.net/downloads/slack-integration/\" rel=\"nofollow ugc\">Slack Integration</a> &#8211; Get instant notifications to your Slack Channel and respond directly from Slack thread reply.</li>\n<li><a href=\"https://supportcandy.net/downloads/workflows/\" rel=\"nofollow ugc\">Workflows</a> &#8211; Workflows extension revolutionizes ticket management within the WordPress helpdesk plugin, offering a powerful automation solution. By leveraging triggers, conditions, and actions, users can automate critical aspects like ticket assignments and status updates. Whether through Automatic or Manual Workflow, SupportCandy provides a customizable solution to streamline support processes, enhancing efficiency and customer satisfaction. This extension unlocks unparalleled efficiency and productivity, transforming the way support workflows are managed.</li>\n<li><a href=\"https://supportcandy.net/downloads/productivity-suite/\" rel=\"nofollow ugc\">Productivity Suite</a> &#8211; Enhance your support team’s efficiency with the SupportCandy Productivity Suite, a powerful add-on designed to streamline ticket management and boost productivity.</li>\n<li><a href=\"https://supportcandy.net/downloads/lms-integration/\" rel=\"nofollow ugc\">LMS Integrations</a> &#8211; Effortlessly integrate popular LMS (Learning Management System) plugins into SupportCandy with the LMS Integration add-on. This integration enhances the support process by allowing customers to specify a particular course or their course when creating a ticket. Agents can seamlessly access customer course details directly within the ticket, providing a more streamlined and efficient support experience. The supported LMS plugins include LifterLMS, Tutor LMS, and LearnPress LMS.</li>\n<li><a href=\"https://supportcandy.net/downloads/email-marketing-tools-integration/\" rel=\"nofollow ugc\">Email Marketing Tools Integration</a> &#8211; Elevate customer engagement by effortlessly connecting SupportCandy with leading email marketing tools like MailChimp,GetResponse and Brevo. Subscribe users during registration or ticket creation, and personalize interactions with subscriber tags.</li>\n<li><a href=\"https://supportcandy.net/downloads/webhooks/\" rel=\"nofollow ugc\">Webhooks</a> &#8211; Webhooks deliver real-time notifications, ensuring you stay informed during critical support events, from new ticket creation to closures and agent assignments.</li>\n</ul>\n<h4>Examples areas of use :</h4>\n<ul>\n<li>Helpdesk</li>\n<li>Technical Support</li>\n<li>Trouble Ticket</li>\n<li>Customer Relations</li>\n<li>Software Release Lifecycle Management</li>\n<li>Service Request Management</li>\n<li>Company, Hotel or Real Estate Service-Desk</li>\n<li>To-Do List Management</li>\n</ul>\n<h4>Available Translations :</h4>\n<p>Available in 20+ languages. Also compatible with popular translation plugins like WPML, Polylang, Loco Translate, etc.<br />\n* Arabic<br />\n* French (France)<br />\n* German (Germany)<br />\n* Dutch (Netherlands)<br />\n* Italian (Italy)<br />\n* Portuguese (Portugal)<br />\n* Spanish (Spain)<br />\n* Chinese (China)<br />\n* Chinese (Traditional)<br />\n* Russian<br />\n* Hebrew<br />\n* Greek<br />\n* Portuguese (Brazil)<br />\n* Turkish<br />\n* Swedish<br />\n* Hungerian<br />\n* Polish<br />\n* Persian<br />\n* Dutch (Belgium)<br />\n* Japanese<br />\n* Moroccan Arabic<br />\n* Czech</p>\n<p>If you are a translator, you can get free access to all premium add-ons for a year in exchange for translating them into your language if it is not available already. We will renew the Premium subscription next year if you continue contributing to the translation. If interested, don&#8217;t hesitate to contact us via our <a href=\"https://supportcandy.net/support-ticket/\" rel=\"nofollow ugc\">support page</a>.</p>\n",
        "installation": "<h4>Using The WordPress Dashboard</h4>\n<ol>\n<li>Navigate to the &#8216;Add New&#8217; in the plugins dashboard</li>\n<li>Search for SupportCandy</li>\n<li>Click &#8216;Install Now&#8217;</li>\n<li>Activate the plugin on the plugin dashboard</li>\n</ol>\n<h4>Uploading in WordPress Dashboard</h4>\n<ol>\n<li>Download <code>supportcandy.zip</code> from this page</li>\n<li>Navigate to the &#8216;Add New&#8217; in the plugins dashboard</li>\n<li>Navigate to the &#8216;Upload&#8217; area</li>\n<li>Select <code>supportcandy.zip</code> from your computer</li>\n<li>Click &#8216;Install Now&#8217;</li>\n<li>Activate the plugin in the Plugin dashboard</li>\n</ol>\n<h4>Using FTP</h4>\n<ol>\n<li>Download <code>supportcandy.zip</code> from this page</li>\n<li>Extract the <code>supportcandy</code> directory to your computer</li>\n<li>Upload the <code>supportcandy</code> directory to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin in the Plugin dashboard</li>\n</ol>\n<p>This plugin is almost plug and play! Please <a href=\"https://supportcandy.net/docs-category/getting-started/\" rel=\"nofollow ugc\">follow this</a> getting started guide for basic installation instructions.</p>\n",
        "faq": "\n<dt id='is%20it%20necessary%20to%20purchase%20the%20pro%20version%20of%20supportcandy%3F'>\nIs it necessary to purchase the pro version of SupportCandy?\n</h4>\n<p>\n<p>No, it is not necessary. The free version of SupportCandy provides essential features such as email notifications, unlimited agents, customers, and tickets. It includes custom categories, statuses, and priorities. The Pro version, while not mandatory, offers additional benefits like automation to streamline processes, automated assignment of agents, and advanced reporting. It is available at a competitive price within the market segment, providing added functionality for those seeking more advanced features.</p>\n</p>\n<dt id='what%20makes%20supportcandy%20helpdesk%20stand%20out%20among%20wordpress%20support%20plugins%3F'>\nWhat makes SupportCandy Helpdesk stand out among WordPress support plugins?\n</h4>\n<p>\n<p>SupportCandy Helpdesk stands out for its longevity, versatility, and feature-rich design. It offers a complete helpdesk and customer support ticket system, providing a self-hosted solution with no constraints on tickets, agents, or data.</p>\n</p>\n<dt id='can%20i%20customize%20the%20appearance%20of%20the%20helpdesk%20to%20match%20my%20wordpress%20theme%3F'>\nCan I customize the appearance of the helpdesk to match my WordPress theme?\n</h4>\n<p>\n<p>Absolutely! SupportCandy Helpdesk offers customizable appearance options, allowing you to seamlessly integrate the helpdesk with your WordPress theme for a cohesive and professional look.</p>\n</p>\n<dt id='how%20does%20the%20plugin%20handle%20ticket%20assignments%20and%20agent%20permissions%3F'>\nHow does the plugin handle ticket assignments and agent permissions?\n</h4>\n<p>\n<p>You have full control over ticket assignments and agent permissions. Assign multiple agents and tags to tickets, set specific permission levels based on agent roles, and utilize advanced search functionality for efficient management.</p>\n</p>\n<dt id='does%20the%20free%20version%20include%20essential%20features%20for%20online%20businesses%3F'>\nDoes the free version include essential features for online businesses?\n</h4>\n<p>\n<p>Yes, the free version offers unlimited tickets, support agents, customers, and various essential features like custom filters, advanced search, private notes, and GDPR compatibility, making it a comprehensive solution for online businesses.</p>\n</p>\n<dt id='what%20premium%20add-ons%20are%20available%20to%20enhance%20productivity%3F'>\nWhat premium add-ons are available to enhance productivity?\n</h4>\n<p>\n<p>Premium add-ons include Email Piping, WooCommerce Integration, Workflows, SLA management, Canned Reply, Satisfaction Survey, and more. These additions streamline processes, automate tasks, and boost overall productivity.</p>\n</p>\n<dt id='how%20does%20the%20plugin%20handle%20gdpr%20compliance%20and%20data%20retention%3F'>\nHow does the plugin handle GDPR compliance and data retention?\n</h4>\n<p>\n<p>The plugin is fully GDPR compatible, featuring data retention and deletion options.</p>\n</p>\n<dt id='is%20there%20a%20way%20to%20automate%20ticket%20closure%20and%20reminders%20for%20inactive%20tickets%3F'>\nIs there a way to automate ticket closure and reminders for inactive tickets?\n</h4>\n<p>\n<p>Yes, the Automatic Close Tickets premium add-on allows you to set a timeframe for ticket closure after a period of inactivity. It also sends warning/reminder emails before closing the ticket.</p>\n</p>\n<dt id='can%20i%20generate%20detailed%20reports%20on%20ticket%20statistics%20and%20customer%20interactions%3F'>\nCan I generate detailed reports on ticket statistics and customer interactions?\n</h4>\n<p>\n<p>Yes, the Reports add-on provides a graphical overview of your tickets and useful statistics. Generate reports for default and custom fields, offering valuable insights into your support desk&#8217;s performance.</p>\n</p>\n<dt id='how%20does%20the%20plugin%20handle%20file%20attachments%20and%20secure%20information%20within%20tickets%3F'>\nHow does the plugin handle file attachments and secure information within tickets?\n</h4>\n<p>\n<p>SupportCandy Helpdesk allows unlimited file attachments to tickets and replies, with customizable file type permissions. The Private Credentials add-on further enables users to provide sensitive information within a ticket, ensuring secure and encrypted storage.</p>\n</p>\n\n",
        "changelog": "<h4>3.2.9 (August 12, 2024)</h4>\n<ul>\n<li>Fix: Enhanced attachment security to prevent potential vulnerabilities</li>\n<li>Fix: Improved compatibility with PHP 8.2</li>\n</ul>\n<h4>3.2.8 (July 03, 2024)</h4>\n<ul>\n<li>New: Dashboard widget to show number of tickets created by day of week</li>\n<li>New: Filter added for customer list</li>\n<li>Fix: Validation for Assignee field not working in create ticket form</li>\n<li>Fix: File upload not working on some servers</li>\n<li>Fix: Unable to create duplicate ticket </li>\n<li>Fix: Can&#8217;t create a new ticket from a thread</li>\n<li>New: Productivity Suite add-on (Premium)</li>\n</ul>\n<h4>3.2.7 (April 23, 2024)</h4>\n<ul>\n<li>New: Dyanamic filters added for date created and date updated</li>\n<li>New: New condition &#8220;Last reply source&#8221; added</li>\n<li>New: Appreance setting for &#8220;Reply &amp; Close&#8221; button</li>\n<li>New: Setting to disable &#8220;Reply &amp; Close&#8221; button</li>\n<li>New: Filter added for recent activity logs</li>\n<li>New: Wating for visibility conditions</li>\n<li>New: New macro {ticket_url_plain} added</li>\n<li>New: Term and condtions, gdpr setting added for registration</li>\n<li>New: Toggle button addde for ticket widgets </li>\n<li>Fix: Not showing correct live agents in agent collision</li>\n<li>Fix: Unable to download attachments of duplicate tickets</li>\n<li>Fix: Showing notice on PHP 8.1</li>\n<li>Fix: Ticket list pagination not showing correct results</li>\n<li>Fix: Unable to download attachments on some servers</li>\n<li>Fix: Translation improvments</li>\n</ul>\n<h4>3.2.6 (February 22, 2024)</h4>\n<ul>\n<li>New: Added Auto-refresh setting for dashboard</li>\n<li>New: Introduced a customizable option to set number custom field as integer or float</li>\n<li>Fix: Datepicker not working on polish sites</li>\n<li>Fix: Dashboard improvements and fixes</li>\n<li>Fix: Bulk assign agent not working</li>\n<li>Fix: Working hours setting not loading</li>\n<li>Fix: Blank links showing in admin menu</li>\n<li>Fix: Delete and replace category, priority and status not working</li>\n</ul>\n<h4>3.2.5 (February 9, 2024)</h4>\n<ul>\n<li>Fix: Unable to upload some attachments after v3.2.4</li>\n<li>Fix: Wrong ticket url on dashboard</li>\n</ul>\n<h4>3.2.4 (February 6, 2024)</h4>\n<ul>\n<li>New: Dashboard feature added</li>\n<li>New: Recent Activities feature for administrators</li>\n<li>New: UI improvements for Customer Profile, My Account and Agent Profile</li>\n<li>Fix: Vulnerability fix</li>\n<li>Fix: Email notifications does not support RTL</li>\n<li>FiX: Does not change ticket status after a reply added from API</li>\n<li>Fix: Removed H1 tag from model header</li>\n<li>Fix: Tags are not working in email piping rules</li>\n</ul>\n<p><a href=\"https://supportcandy.net/changelog/\" rel=\"nofollow ugc\">See changelog for all versions</a>.</p>\n"
    },
    "short_description": "Enhance your WordPress site with our helpdesk and support ticket system. Manage customer support, tickets, and email tickets efficiently.",
    "description": "<p><em>THE SIMPLE, SECURE AND FEATURE-RICH SUPPORT TICKETING SYSTEM PLUGIN FOR YOUR WORDPRESS SITE.</em></p>\n<p>SupportCandy adds to your WordPress site the features of a complete help desk and customer support ticket system. It is one of the oldest helpdesk &amp; customer support ticketing plugin available for WordPress.</p>\n<p>We stand as a remarkably versatile and feature-packed help desk and ticket management plugin. Elevate your customer support game by effortlessly handling and resolving customer queries directly from the comfort of your WordPress dashboard.</p>\n<p>SupportCandy Helpdesk is the ultimate solution for all your helpdesk and support ticketing needs within WordPress, featuring features comparable to those offered by top-tier SaaS solutions such as Zendesk, Help Scout, or Freshdesk.</p>\n<div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/858235638\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n<p><a href=\"https://supportcandy.net/docs-category/getting-started/\" rel=\"nofollow ugc\">Follow this</a> getting started guide and be ready to support your customers like never before within a few minutes!</p>\n<p><a href=\"https://supportcandy.net/\" rel=\"nofollow ugc\">Click here</a> to visit our official website.</p>\n<p><em>YOUR WORDPRESS-BASED SELF-HOSTED CUSTOMER SUPPORT SOLUTION BACKED BY UNPARALLEL TECHNICAL SUPPORT</em></p>\n<p>While we prioritize technical support for our paid users, we are committed to assisting each and every customer promptly. Our dedication ensures that all users receive the assistance they need as quickly as possible. Moreover, we offer best-in-class customer support and maximum features in our free version, setting us apart from others in the industry.</p>\n<p>In addition to ticket management, you can assign multiple specific permission levels to agents and customers. Gain access to detailed reports concerning your customers, agents, and the overall productivity of your customer support desk. By navigating through the ticket view, you can gain a comprehensive 360-degree perspective of your customers, including their past tickets, purchase history, membership levels, and more. Armed with this wealth of customer data alongside their queries, you can accomplish much more.</p>\n<p>SupportCandy is a self-hosted support ticket plugin offers limitless tickets, support agents, users, tags, and more. There are no constraints, as you maintain ownership of your system and data.</p>\n<h4>Key features :</h4>\n<ul>\n<li>Unlimited number of tickets</li>\n<li>Unlimited number of agents and agent roles</li>\n<li>Unlimited number of customers</li>\n<li>Unlimited tags, categories, and custom statuses</li>\n<li>Dashboard for agents</li>\n<li>Activity logs for administrators</li>\n<li>Advanced custom filter and search functionality</li>\n<li>Saved filters for customers and agents</li>\n<li>Shortcodes for Agent Portal/Customer Portal</li>\n<li>Private notes for internal communication of agents</li>\n<li>Agents can create a ticket on the customer&#8217;s behalf</li>\n<li>Agent Collision to avoid repetitive messages and confusion</li>\n<li>16+ Custom field types</li>\n<li>User Registration</li>\n<li>Ticket fields for additional information about ticket</li>\n<li>Agent-only fields to keep internal data of the ticket</li>\n<li>Customer fields to store information about the customer across the tickets</li>\n<li>Guest tickets (disabled by default)</li>\n<li>Guest can also see their ticket list using OTP Login (One Time Password)</li>\n<li>Rich-text editor (customizable)</li>\n<li>Email notifications</li>\n<li>Working hours, exceptions, and holidays for support agent</li>\n<li>Google reCaptcha integration</li>\n<li>GDPR Compatibility with data retention and deletion feature</li>\n<li>Terms &amp; Conditions checkbox in the ticket form</li>\n<li>Macros or placeholders for ticket fields</li>\n<li>Unlimited File Attachment to ticket and reply. Manage allowed file types.</li>\n<li>Rest APIs Support</li>\n<li>Customizable Appearance to match up with your theme</li>\n<li>Auto delete closed tickets</li>\n</ul>\n<h4>Premium Add-Ons :</h4>\n<ul>\n<li><a href=\"https://supportcandy.net/email-piping/\" rel=\"nofollow ugc\">Email Piping</a> &#8211; The Email Piping extension in SupportCandy revolutionizes WordPress customer support by enabling users to create and respond to tickets directly from their email inboxes. This streamlines communication, eliminating the need for repeated website visits. With three piping methods, including Basic IMAP, Gmail and Microsoft Exchange.</li>\n<li><a href=\"https://supportcandy.net/woocommerce-integration/\" rel=\"nofollow ugc\">WooCommerce Integration</a> &#8211; The WooCommerce integration transforms customer support by seamlessly linking WooCommerce functionalities with the WordPress helpdesk plugin. Customers can effortlessly select orders and products within the ticket form, enhancing the assistance-seeking process. Agents gain a comprehensive view of customer order details, including order history and total spent, directly within the ticket. Add a support tab on the My Account page and a help button for orders.</li>\n<li><a href=\"https://supportcandy.net/canned-reply/\" rel=\"nofollow ugc\">Canned Reply</a> &#8211; The Canned Reply extension streamlines customer support in the WordPress helpdesk plugin by enabling agents to save and quickly access frequently used responses. Agents can effortlessly store and organize multiple replies, utilizing macros for added versatility. With a simple click, agents can retrieve canned responses, eliminating the need to remember information each time and significantly saving time. The extension also allows administrators to create public canned responses for universal accessibility.</li>\n<li><a href=\"https://supportcandy.net/assign-agent-rules/\" rel=\"nofollow ugc\">Assign Agent Rules</a> &#8211; Assign Agent Rules extension simplifies agent assignment in the WordPress helpdesk plugin by automating the process based on predefined rules. Administrators set conditions and agents/agent groups for automatic assignment, eliminating the need for tedious manual assignments. When customers create tickets, the system matches conditions and assigns agents accordingly.</li>\n<li><a href=\"https://supportcandy.net/sla/\" rel=\"nofollow ugc\">SLA (Service Lavel Agreement)</a> &#8211; The SLA extension in SupportCandy&#8217;s helpdesk plugin ensures timely responses and resolutions for various ticket types within the WordPress ticketing system. It automates SLA calculations using pre-set policies, allowing administrators to effortlessly uphold commitments. Calculate the due date based on rules for tickets to match. The remaining time is shown in the ticket list if added SLA field to the ticket list and individual ticket.</li>\n<li><a href=\"https://supportcandy.net/satisfaction-survey/\" rel=\"nofollow ugc\">Satisfaction Survey</a> &#8211; Satisfaction Survey extension for the WordPress helpdesk plugin streamlines customer feedback collection and user ratings for each closed ticket. Administrators can set up survey emails with customizable rating options. Customers receive these surveys after a specified number of days from closing the ticket, providing valuable insights.</li>\n<li><a href=\"https://supportcandy.net/automatic-close-tickets/\" rel=\"nofollow ugc\">Automatic Close Tickets</a> &#8211; Automatic Close Tickets extension automates the closure of inactive tickets in the WordPress ticketing system after a set period. Administrators can customize the closure criteria, including the number of days of inactivity and specific ticket statuses. The extension also facilitates customer engagement by sending warning emails before automatically closing tickets, ensuring a streamlined and organized workflow. This feature is valuable for efficiently managing and closing abandoned tickets while enhancing overall customer interaction within the helpdesk system.</li>\n<li><a href=\"https://supportcandy.net/usergroups/\" rel=\"nofollow ugc\">Usergroup</a> &#8211; Allow a group of users to access each other&#8217;s tickets.</li>\n<li><a href=\"https://supportcandy.net/agentgroups/\" rel=\"nofollow ugc\">Agentgoup</a> &#8211; Agentgroups extension streamlines ticket management by allowing the creation of agent groups or teams within the WordPress helpdesk plugin. Supervisors oversee ticket assignments within these groups, ensuring an efficient workflow. Tickets can be assigned to agentgroups, and supervisors manage assignments to group members.</li>\n<li><a href=\"https://supportcandy.net/schedule-tickets/\" rel=\"nofollow ugc\">Schedule Tickets</a> &#8211; Schedule Tickets allow administrators to effortlessly schedule recurring tickets for routine tasks. The system then automatically generates these tickets at the defined times, providing a streamlined approach to essential and repetitive processes. With versatile recurrence periods, customizable scheduling options, and the ability to set start and end dates, SupportCandy ensures comprehensive support for diverse ticketing needs.</li>\n<li><a href=\"https://supportcandy.net/knowledgebase-integrations-2/\" rel=\"nofollow ugc\">Knowledgebase Integrations</a> &#8211; Knowledgebase Integrations extend the capabilities of the WordPress helpdesk plugin, offering seamless integration with popular knowledge base tools. This powerful add-on enhances customer support by enabling agents to access and incorporate knowledge base content directly into their responses. By integrating with well-known plugins such as BetterDocs, Knowledgebase by UnboundStudio, and others, SupportCandy ensures a unified and efficient support system that empowers agents to leverage comprehensive documentation for swift issue resolution.</li>\n<li><a href=\"https://supportcandy.net/faq-integrations/\" rel=\"nofollow ugc\">FAQ Integrations</a> &#8211; SupportCandy integrates with popular FAQ plugins like Ultimate FAQ and Arconix FAQ, enhancing its helpdesk capabilities for efficient customer support.</li>\n<li><a href=\"https://supportcandy.net/export-tickets/\" rel=\"nofollow ugc\">Export Tickets</a> &#8211; Export tickets to CSV format so you can use it for various purposes such as generating reports.</li>\n<li><a href=\"https://supportcandy.net/reports/\" rel=\"nofollow ugc\">Reports</a> &#8211; Reports extension is an essential tool for WordPress helpdesk, offering auto-generated reports for Ticket Statistics, Response Delays, Ticket Closing Delays, and more. These reports provide a quick and detailed overview of your customer support, helping you measure and enhance efficiency over different timeframes. With customizable filters, you can focus on specific aspects, such as satisfaction survey ratings and custom fields. This extension ensures that you can make informed decisions, optimize support processes, and monitor business performance effectively.</li>\n<li><a href=\"https://supportcandy.net/timer/\" rel=\"nofollow ugc\">Timer</a> &#8211; Timer extension simplifies time tracking in the ticketing system. Agents can log time effortlessly, enhancing task efficiency. With customizable features, including auto-start for new tickets, the extension provides transparency for customers through a dedicated widget. Streamlining time tracking, SupportCandy&#8217;s Timer ensures a seamless support experience.</li>\n<li><a href=\"https://supportcandy.net/print-ticket/\" rel=\"nofollow ugc\">Print Ticket</a> &#8211; Print Ticket extension adds a print feature to individual tickets, allowing users to generate PDFs for a tangible record. Customize print pages with header, footer, and body templates, and enable/disable functionality as needed.</li>\n<li><a href=\"https://supportcandy.net/edd-integration/\" rel=\"nofollow ugc\">EDD Integration</a> &#8211; Easy Digital Downloads (EDD) integration with SupportCandy enhances the ticketing system, allowing customers to select orders and products directly within the ticket form. Agents can seamlessly view customer orders within the ticket, providing a comprehensive support experience. With added custom fields for EDD Product and EDD Order, this integration streamlines the process, empowering agents to access and manage order details efficiently.</li>\n<li><a href=\"https://supportcandy.net/gravity-forms-2/\" rel=\"nofollow ugc\">Gravity Forms Integration</a> &#8211; Integrate Gravity Forms with SupportCandy to create multiple ticket forms effortlessly, providing versatile options beyond the default setup. Customize forms as needed, allowing customers to submit tickets seamlessly, while automated mappings ensure a smooth transition of field values into SupportCandy. This integration enhances the flexibility and functionality of your customer support.</li>\n<li><a href=\"https://supportcandy.net/private-credentials/\" rel=\"nofollow ugc\">Private Credentials</a> &#8211; The Private Credentials extension in SupportCandy allows customers to securely share sensitive information within tickets, enhancing privacy. Encrypted storage ensures secure handling, with agents having controlled permissions for viewing, modifying, or automatically deleting credentials after ticket closure.</li>\n<li><a href=\"https://supportcandy.net/downloads/slack-integration/\" rel=\"nofollow ugc\">Slack Integration</a> &#8211; Get instant notifications to your Slack Channel and respond directly from Slack thread reply.</li>\n<li><a href=\"https://supportcandy.net/downloads/workflows/\" rel=\"nofollow ugc\">Workflows</a> &#8211; Workflows extension revolutionizes ticket management within the WordPress helpdesk plugin, offering a powerful automation solution. By leveraging triggers, conditions, and actions, users can automate critical aspects like ticket assignments and status updates. Whether through Automatic or Manual Workflow, SupportCandy provides a customizable solution to streamline support processes, enhancing efficiency and customer satisfaction. This extension unlocks unparalleled efficiency and productivity, transforming the way support workflows are managed.</li>\n<li><a href=\"https://supportcandy.net/downloads/productivity-suite/\" rel=\"nofollow ugc\">Productivity Suite</a> &#8211; Enhance your support team’s efficiency with the SupportCandy Productivity Suite, a powerful add-on designed to streamline ticket management and boost productivity.</li>\n<li><a href=\"https://supportcandy.net/downloads/lms-integration/\" rel=\"nofollow ugc\">LMS Integrations</a> &#8211; Effortlessly integrate popular LMS (Learning Management System) plugins into SupportCandy with the LMS Integration add-on. This integration enhances the support process by allowing customers to specify a particular course or their course when creating a ticket. Agents can seamlessly access customer course details directly within the ticket, providing a more streamlined and efficient support experience. The supported LMS plugins include LifterLMS, Tutor LMS, and LearnPress LMS.</li>\n<li><a href=\"https://supportcandy.net/downloads/email-marketing-tools-integration/\" rel=\"nofollow ugc\">Email Marketing Tools Integration</a> &#8211; Elevate customer engagement by effortlessly connecting SupportCandy with leading email marketing tools like MailChimp,GetResponse and Brevo. Subscribe users during registration or ticket creation, and personalize interactions with subscriber tags.</li>\n<li><a href=\"https://supportcandy.net/downloads/webhooks/\" rel=\"nofollow ugc\">Webhooks</a> &#8211; Webhooks deliver real-time notifications, ensuring you stay informed during critical support events, from new ticket creation to closures and agent assignments.</li>\n</ul>\n<h4>Examples areas of use :</h4>\n<ul>\n<li>Helpdesk</li>\n<li>Technical Support</li>\n<li>Trouble Ticket</li>\n<li>Customer Relations</li>\n<li>Software Release Lifecycle Management</li>\n<li>Service Request Management</li>\n<li>Company, Hotel or Real Estate Service-Desk</li>\n<li>To-Do List Management</li>\n</ul>\n<h4>Available Translations :</h4>\n<p>Available in 20+ languages. Also compatible with popular translation plugins like WPML, Polylang, Loco Translate, etc.<br />\n* Arabic<br />\n* French (France)<br />\n* German (Germany)<br />\n* Dutch (Netherlands)<br />\n* Italian (Italy)<br />\n* Portuguese (Portugal)<br />\n* Spanish (Spain)<br />\n* Chinese (China)<br />\n* Chinese (Traditional)<br />\n* Russian<br />\n* Hebrew<br />\n* Greek<br />\n* Portuguese (Brazil)<br />\n* Turkish<br />\n* Swedish<br />\n* Hungerian<br />\n* Polish<br />\n* Persian<br />\n* Dutch (Belgium)<br />\n* Japanese<br />\n* Moroccan Arabic<br />\n* Czech</p>\n<p>If you are a translator, you can get free access to all premium add-ons for a year in exchange for translating them into your language if it is not available already. We will renew the Premium subscription next year if you continue contributing to the translation. If interested, don&#8217;t hesitate to contact us via our <a href=\"https://supportcandy.net/support-ticket/\" rel=\"nofollow ugc\">support page</a>.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/supportcandy.3.2.9.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-1.png?rev=3031986",
            "caption": "Dashboard"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-2.png?rev=3031986",
            "caption": "Ticket list"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-3.png?rev=3031986",
            "caption": "Create ticket form"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-4.png?rev=3031986",
            "caption": "Individual ticket"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-5.png?rev=3031986",
            "caption": "My Profile"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-6.png?rev=3031986",
            "caption": "Agent Profile"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-7.png?rev=3031986",
            "caption": "Customer Profile"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-8.png?rev=3031986",
            "caption": "Recent Activaties"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-9.png?rev=3031986",
            "caption": "SupportCandy shortcode"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-10.png?rev=3031986",
            "caption": "Create Ticket shortcode"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-11.png?rev=3031986",
            "caption": "Open existing ticket shortcode"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-12.png?rev=3031986",
            "caption": "Customer feedback listing (Premium)"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-13.png?rev=3031986",
            "caption": "Report - Ticket statistics (Premium)"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-14.png?rev=3031986",
            "caption": "Report - Response delay (Premium)"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-15.png?rev=3031986",
            "caption": "Report - Ticket closing delay (Premium)"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-16.png?rev=3031986",
            "caption": "Report - Communication gap (Premium)"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-17.png?rev=3031986",
            "caption": "Report - Category (Premium)"
        },
        {
            "src": "https://ps.w.org/supportcandy/assets/screenshot-18.png?rev=3031986",
            "caption": "Report - Rating (Premium)"
        }
    ],
    "tags": {
        "customer-support": "customer support",
        "helpdesk": "helpdesk",
        "support": "support",
        "ticket": "ticket",
        "ticketing-system": "ticketing system"
    },
    "stable_tag": "3.2.9",
    "versions": {
        "2.3.1": "https://downloads.wordpress.org/plugin/supportcandy.2.3.1.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/supportcandy.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/supportcandy.3.0.1.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/supportcandy.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/supportcandy.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/supportcandy.3.0.4.zip",
        "3.0.5": "https://downloads.wordpress.org/plugin/supportcandy.3.0.5.zip",
        "3.0.6": "https://downloads.wordpress.org/plugin/supportcandy.3.0.6.zip",
        "3.0.7": "https://downloads.wordpress.org/plugin/supportcandy.3.0.7.zip",
        "3.0.8": "https://downloads.wordpress.org/plugin/supportcandy.3.0.8.zip",
        "3.0.9": "https://downloads.wordpress.org/plugin/supportcandy.3.0.9.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/supportcandy.3.1.0.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/supportcandy.3.1.1.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/supportcandy.3.1.2.zip",
        "3.1.3": "https://downloads.wordpress.org/plugin/supportcandy.3.1.3.zip",
        "3.1.4": "https://downloads.wordpress.org/plugin/supportcandy.3.1.4.zip",
        "3.1.5": "https://downloads.wordpress.org/plugin/supportcandy.3.1.5.zip",
        "3.1.6": "https://downloads.wordpress.org/plugin/supportcandy.3.1.6.zip",
        "3.1.7": "https://downloads.wordpress.org/plugin/supportcandy.3.1.7.zip",
        "3.1.8": "https://downloads.wordpress.org/plugin/supportcandy.3.1.8.zip",
        "3.1.9": "https://downloads.wordpress.org/plugin/supportcandy.3.1.9.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/supportcandy.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/supportcandy.3.2.1.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/supportcandy.3.2.2.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/supportcandy.3.2.3.zip",
        "3.2.4": "https://downloads.wordpress.org/plugin/supportcandy.3.2.4.zip",
        "3.2.5": "https://downloads.wordpress.org/plugin/supportcandy.3.2.5.zip",
        "3.2.6": "https://downloads.wordpress.org/plugin/supportcandy.3.2.6.zip",
        "3.2.7": "https://downloads.wordpress.org/plugin/supportcandy.3.2.7.zip",
        "3.2.8": "https://downloads.wordpress.org/plugin/supportcandy.3.2.8.zip",
        "3.2.9": "https://downloads.wordpress.org/plugin/supportcandy.3.2.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/supportcandy.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/supportcandy/assets/banner-772x250.png?rev=2763565",
        "high": "https://ps.w.org/supportcandy/assets/banner-1544x500.png?rev=2763565"
    },
    "icons": {
        "1x": "https://ps.w.org/supportcandy/assets/icon.svg?rev=2763565",
        "svg": "https://ps.w.org/supportcandy/assets/icon.svg?rev=2763565"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "supportcandy",
            "language": "ary",
            "version": "3.2.9",
            "updated": "2023-10-26 12:00:25",
            "package": "http://downloads.wordpress.org/translation/plugin/supportcandy/3.2.9/ary.zip"
        },
        {
            "type": "plugin",
            "slug": "supportcandy",
            "language": "cs_CZ",
            "version": "3.2.9",
            "updated": "2023-11-03 13:35:46",
            "package": "http://downloads.wordpress.org/translation/plugin/supportcandy/3.2.9/cs_CZ.zip"
        },
        {
            "type": "plugin",
            "slug": "supportcandy",
            "language": "en_AU",
            "version": "3.2.9",
            "updated": "2023-06-13 12:13:37",
            "package": "http://downloads.wordpress.org/translation/plugin/supportcandy/3.2.9/en_AU.zip"
        },
        {
            "type": "plugin",
            "slug": "supportcandy",
            "language": "ja",
            "version": "3.2.9",
            "updated": "2023-09-28 07:14:12",
            "package": "http://downloads.wordpress.org/translation/plugin/supportcandy/3.2.9/ja.zip"
        },
        {
            "type": "plugin",
            "slug": "supportcandy",
            "language": "ckb",
            "version": "3.2.9",
            "updated": "2024-08-02 00:44:00",
            "package": "http://downloads.wordpress.org/translation/plugin/supportcandy/3.2.9/ckb.zip"
        },
        {
            "type": "plugin",
            "slug": "supportcandy",
            "language": "ro_RO",
            "version": "3.2.9",
            "updated": "2024-03-19 18:48:45",
            "package": "http://downloads.wordpress.org/translation/plugin/supportcandy/3.2.9/ro_RO.zip"
        },
        {
            "type": "plugin",
            "slug": "supportcandy",
            "language": "ru_RU",
            "version": "3.2.9",
            "updated": "2024-02-20 07:20:26",
            "package": "http://downloads.wordpress.org/translation/plugin/supportcandy/3.2.9/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "supportcandy",
            "language": "zh_CN",
            "version": "3.2.9",
            "updated": "2022-07-21 08:41:25",
            "package": "http://downloads.wordpress.org/translation/plugin/supportcandy/3.2.9/zh_CN.zip"
        }
    ]
}