{
    "name": "HuCommerce | Magyar WooCommerce kiegészítések",
    "slug": "surbma-magyar-woocommerce",
    "version": "2024.3.0",
    "author": "<a href=\"https://www.hucommerce.hu/\">HuCommerce.hu</a>",
    "author_profile": "https://profiles.wordpress.org/surbma/",
    "contributors": {
        "surbma": {
            "profile": "https://profiles.wordpress.org/surbma/",
            "avatar": "https://secure.gravatar.com/avatar/c2c7e691f75759e242ad268e0db85d0a?s=96&d=monsterid&r=g",
            "display_name": "Surbma"
        },
        "xnagyg": {
            "profile": "https://profiles.wordpress.org/xnagyg/",
            "avatar": "https://secure.gravatar.com/avatar/29e47dd8393415dbb56bf6b4e65d0a4d?s=96&d=monsterid&r=g",
            "display_name": "xnagyg"
        }
    },
    "requires": "5.3",
    "tested": "6.6.1",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 29,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 29,
    "support_url": "https://wordpress.org/support/plugin/surbma-magyar-woocommerce/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 10000,
    "downloaded": 149632,
    "last_updated": "2024-08-07 23:03:00",
    "added": "2017-10-11",
    "homepage": "https://www.hucommerce.hu/",
    "sections": {
        "description": "<p>A WooCommerce a világ és most már Magyarország legnépszerűbb webáruház platformja is. A HuCommerce kiegészítővel könnyebben és gyorsabban indíthatod a webáruházad, mert a legtöbb fontos funkciót és fejlesztést egy gombnyomással helyettesítheted.</p>\n<p>A HuCommerce bővítmény ingyenes változata most már évek óta a magyar WooCommerce webáruház tulajdonosok kedvenc kiegészítője. Több, mint 10000 webáruházban megtalálható és a letöltések száma folyamatosan nő.</p>\n<p>Azon dolgozunk, hogy folyamatosan hasznos funkciókkal bővítsük ezt a nagyszerű WooCommerce kiegészítőt. Kérlek, támogasd a fejlesztést és a HuCommerce közösséget azzal, hogy megvásárolod a Pro verziót! Ezzel fedezni tudjuk a fejlesztési költségeket és több időt tudunk arra fordítani, hogy a HuCommerce bővítmény még jobb legyen és még több hasznod legyen belőle.</p>\n<p>A HuCommerce ingyenes verziója rengeteg olyan apró, hasznos vagy akár jogilag kötelező funkciót tartalmaz, ami hiányzik a WooCommerce bővítményből. Többek között rendbe teszi a vezetéknév és keresztnév sorrendjét és az adószám mezőt is hozzáadja a pénztárhoz, de folyamatosan bővül hasonló praktikus, hasznos vagy kötelező funkciókkal.</p>\n<p>A HuCommerce Pro előfizetés éves díja egy kezdő magyar fejlesztő pár órás munkadíja, miközben neked napokat vagy akár hónapokat spórol meg fejlesztési és kutatási oldalon. Ez a kiegészítő a leghasznosabb és nélkülözhetetlen funkciókkal egészíti ki a webáruházad. A fizetős konstrukció biztosítja, hogy folyamatosan bővüljön újabb hasznos funkciókkal.</p>\n<p>A funkciók folyamatosan bővülnek, de mindenki megírhatja a véleményét, ötletét, hogyan tudjuk egyre jobbá tenni ezt a bővítményt.</p>\n<p><strong>Hasznos linkek:</strong></p>\n<ul>\n<li><a href=\"https://www.hucommerce.hu/bovitmenyek/hucommerce/\" rel=\"nofollow ugc\">Bővebben a HuCommerce Pro bővítményről <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span></a></li>\n<li><a href=\"https://www.hucommerce.hu/modulok/\" rel=\"nofollow ugc\">Bővebben a HuCommerce modulokról <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span></a></li>\n<li><a href=\"https://www.hucommerce.hu/tudasbazis/\" rel=\"nofollow ugc\">HuCommerce tudásbázis <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span></a></li>\n</ul>\n<p><strong>Ügyfélszolgálat és támogatás:</strong></p>\n<ul>\n<li><a href=\"https://wordpress.org/support/plugin/surbma-magyar-woocommerce/\" rel=\"ugc\">WordPress.org fórum</a></li>\n<li><a href=\"https://www.facebook.com/groups/HuCommerce.hu/\" rel=\"nofollow ugc\">HuCommerce Facebook csoport <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span></a></li>\n<li>A HuCommerce Pro ügyfelek számára email és live chat csatornákon is biztosítjuk az ügyfélszolgálati ügyek intézését és a támogatást a bővítményhez.</li>\n</ul>\n<h3>HuCommerce (ingyenes)</h3>\n<p>Több, mint 10000 webáruház tulajdonos választása Magyarországon. Rengeteg hasznos funkció, kötelező választás minden magyar WooCommerce webáruházhoz.</p>\n<p><strong>HuCommerce ingyenes funkciói:</strong></p>\n<ul>\n<li>Vezetéknév és keresztnév rendbetétele (WooCommerce 4.4 verzió fölött is)</li>\n<li>Adószám bekérése vásárlásnál</li>\n<li>Megye mező elrejtése</li>\n<li>Város automatikus kitöltése az irányítószám alapján</li>\n<li>Pénztár oldal módosítások</li>\n<li>Kupon mező módosítások</li>\n<li>Plusz/minusz mennyiségi gombok a termékekhez</li>\n<li>Automatikus frissítés a Kosár oldalon</li>\n<li>Egy termék vásárlásonként</li>\n<li>Kosár átirányítása a Pénztár oldalra</li>\n<li>Vásárlás folytatása gomb megjelenítése a Kosár és/vagy a Pénztár oldalakon</li>\n<li>Belépés és regisztráció utáni átirányítás</li>\n<li>Szállítási módok elrejtése</li>\n<li>Egyedi “Kosárba teszem” gombok</li>\n<li>Termék extra beállítások</li>\n<li>SMTP szolgáltatás beállítása</li>\n<li>Katalógus mód</li>\n<li>Fordítási hiányosságok javítása</li>\n<li>WPML és Polylang kompatibilitás</li>\n<li>Alap ügyfélszolgálat és támogatás</li>\n<li>További funkciók hamarosan…</li>\n</ul>\n<h3>HuCommerce Pro (fizetős)</h3>\n<p>A HuCommerce kibővített kiadása, további hasznos és folyamatosan bővülő funkciókkal. Kérlek, támogasd a fejlesztést és a HuCommerce közösséget azzal, hogy megvásárolod a Pro verziót! Ezzel fedezni tudjuk a fejlesztési költségeket és több időt tudunk arra fordítani, hogy a HuCommerce bővítmény még jobb legyen és még több hasznod legyen belőle.</p>\n<p><strong>HuCommerce Pro további funkciói:</strong></p>\n<ul>\n<li>Pénztár mezők ellenőrzése</li>\n<li>Ingyenes szállítás értesítés</li>\n<li>Kosár ürítése gomb</li>\n<li>Termék ár történet (új Fogyasztóvédelemi rendelet)</li>\n<li>Termék ár kiegészítések</li>\n<li>Jogi megfelelés (Fogyasztóvédelem, GDPR, ePrivacy, stb.)</li>\n<li>Fizetési módok korlátozása</li>\n<li>Globális adatok, amiket shortcode-dal lehet bárhol megjeleníteni</li>\n<li>Kiemelt ügyfélszolgálat és támogatás</li>\n<li>További funkciók hamarosan…</li>\n</ul>\n<h3>HuCommerce kiemelt moduljai és rövid leírása:</h3>\n<h4>Vezetéknév és keresztnév rendbetétele (WooCommerce 4.4 verzió fölött is)</h4>\n<p>A keresztnév és vezetéknév sorrendjének a megfordítása, ha a webáruház magyar nyelvre van állítva. Mindezt úgy, hogy reszponzív nézetben is jó legyen és a CRM, számlázó programok is tudják értelmezni.</p>\n<p>A megjelenítés kompatibilis a WPML bővítménnyel, így többnyelvű webáruháznál is jó sorrendben jelenik meg a név magyar nyelven.</p>\n<p>A név sorrendje a megrendelés visszaigazolásánál, a vásárló fiókjában és az értesítő levelekben is jól jelenik meg.</p>\n<h4>Adószám bekérése vásárlásnál</h4>\n<p>A Pénztár oldalon a Cégnév mező alatt már Adószámot is be lehet kérni. Az Adószám mező csak akkor jelenik meg, ha a Cégnév mezőbe lett írva. Az adószám ebben az esetben kötelező mező. Az adószám a rendelésen kívül az adott felhasználó profil adatainál is elmentésre kerül. Az adószám megjelenik mind a visszaigazoláson, mind a rendelés szerkesztésénél, valamint az értesítő levelekben is.</p>\n<p>Maszkolás és validálás is beállítható az Adószám mezőhöz és placeholder megjelenítése is bekapcsolható, ami azoknál a sablonoknál nagyon jól jön, amiknél nem jelennek meg a mezők címkéi.</p>\n<h4>Pénztár mezők ellenőrzése</h4>\n<p>Beállítható, hogy a Pénztár oldalon a Számlázási adatoknál az Adószám, Irányítószám és Telefonszám mezőket, a Szállítási adatoknál pedig az Irányítószámot maszkolja, azaz formai szempontból validálja, illetve a megadott beviteli értéket ellenőrizze. Így a következő értékek lesznek érvényben:</p>\n<ul>\n<li>Számlázási Adószám: 00000000-0-00 (13 karakter), 00000000000 (11 szám), HU00000000 (HU előtag és 8 szám)</li>\n<li>Számlázási és Szállítási Irányítószám: 0000 (4 karakter)</li>\n<li>Számlázási Telefonszám: +36000000000 (11-12 karakter)</li>\n</ul>\n<h4>Város automatikus kitöltése az irányítószám alapján</h4>\n<p>A Pénztár oldalon az irányítószám mező kitöltése után automatikusan megjeleníti a várost. Ha már manuálisan lett módosítva a város, akkor nem módosítja az irányítószám alapján.</p>\n<h4>Fordítási hiányosságok javítása</h4>\n<p>Ideiglenes fordítási hiányosságok javítása a WooCommerce bővítményhez és a legnépszerűbb sablonokhoz (Divi, Storefront), amíg a hivatalos fordításban esetleg nem jelenik meg vagy nem frissíti a rendszer. Én hivatalos szerkesztője is vagyok a magyar WooCommerce fordítási csapatának, ezért ott sokmindent megcsinálok, de néha szükség van erre a kis trükkre.</p>\n<h4>Jogi megfelelés (Fogyasztóvédelem, GDPR, ePrivacy, stb.)</h4>\n<p>Lehetőség van az Általános Szerződési Feltételek és az Adatkezelési tájékoztató aktív cselekvésen alapuló elfogadtatására, azaz ki kell pipálnia a vásárlónak ezek elfogadását, mielőtt a rendelést leadhatná. Az adatok a rendeléseknél kerülnek elmentésre és a rendelés szerkesztése oldalon megjelenik az elfogadott státusz. Ebben az esetben a vásárló profil adatainál nem kerül elmentésre az elfogadás, így azt bejelentkezve is minden vásárlás alkalmával el kell fogadnia.</p>\n<p>Opcionális a két mező használata, így ha valakinek csak az egyik elfogadtatására és megerősítésére van szüksége, akkor egyik vagy másik kikapcsolható.</p>\n<p>További két extra mező is hozzáadható, amihez teljesen szabadon lehet szöveget, linket megadni. Ezekre további jogi megfelelés céljából lehet szükség, ha az adott webáruház megköveteli ezt. Amennyiben bármelyik mező aktiválva lett, azok mindenképpen kötelezőek.</p>\n<p>A Pénztár oldalon a Megrendelés gomb fölött és/vagy alatt közvetlenül elhelyezhető jogi szöveg, ami esetleg fontos vagy kötelező eleme a vásárlási folyamatnak. Ilyen például a távollévők közötti szerződéshez szükséges tudomásulvétel vagy a &#8220;fizetési kötelezettséggel járó megrendelés&#8221; kötelező megjelenítése a megrendelés során.</p>\n<p>A regisztrációs űrlapnál is kérhető az Adatkezelési Tájékoztató kötelező elfogadtatása. Ez az adat már elmentésre kerül a felhasználó profil adatainál. Külön beállítható, hogy a felhasználó IP címét is elmentse a rendszer. A regisztrációs adatokat (elfogadás ténye, regisztráció dátuma, IP cím) mind az admin felületen, mind pedig a felhasználó fiókadatainál megjeleníti, de ezek a mezők nem módosíthatók sem a felhasználók, sem az adminisztrátorok részéről.</p>\n<blockquote>\n<p><strong>FIGYELEM!</strong> A webáruház jogi megfelelése az aktuális törvényeknek és adatvédelmi rendeleteknek minden esetben a webáruház tulajdonosának a felelőssége. Ez az opció nem mentesít senkit sem az alól, hogy a megfelelést felülvizsgáltassa szakértővel vagy jogásszal. A fejlesztők nem vállalnak semmilyen felelősséget a webáruház jogi megfeleléséért.</p>\n</blockquote>\n<h4>Termék ár történet (új Fogyasztóvédelemi rendelet: 4/2009. (I. 30.) NFGM-SZMM együttes rendelet 2/A. §)</h4>\n<p>Ez a modul nincs minden körülmény között tesztelve és nem tudja 100%-ban teljesíteni a funkcionális és/vagy jogi igényeket, feltételeket. Ezért a használata esetén fokozott figyelmet igényel.</p>\n<blockquote>\n<p><strong>FIGYELEM!</strong> A HuCommerce ügyfélszolgálatára beküldött visszajelzések és javaslatok jelentősen gyorsítják a modul fejlesztését, ezért szívesen várjuk az ilyen témájú megkereséseket. Köszönjük!</p>\n</blockquote>\n<p>Az Európai Unió területén, így Magyarországon is 2022. május 28-tól egységes szabályok vonatkoznak az árcsökkentésre.</p>\n<p>Az új szabályozás célja annak megakadályozása, hogy a kereskedők megtévesztő árcsökkentéseket alkalmazzanak azzal, hogy az akciók előtt megemeljék a korábbi árat és ezáltal megtévesszék a fogyasztókat az árengedmény mértékével kapcsolatban.</p>\n<blockquote>\n<p>A 93/13/EGK tanácsi irányelvnek, valamint a 98/6/EK, a 2005/29/EK és a 2011/83/EU európai parlamenti és tanácsi irányelvnek az uniós fogyasztóvédelmi szabályok hatékonyabb végrehajtása és korszerűsítése tekintetében történő módosításáról szóló, 2019. november 27-i (EU) 2019/2161 európai parlamenti és tanácsi irányelv érintett rendelkezései a termékek eladási ára és egységára, továbbá a szolgáltatások díja feltüntetésének részletes szabályairól szóló 4/2009. (I. 30.) NFGM-SZMM együttes rendelet (a továbbiakban: Árrendelet) 2/A. §-ában kerültek átültetésére.</p>\n</blockquote>\n<p>Ez a modul biztosítja a rendeletnek való megfelelést. A termékhez kapcsolódó árak folyamatos mentésével és annak statisztikai megjelenítésével egy átfogó képet ad a webáruház tulajdonosnak az árváltozás és az aktuális kedvezmény rendelet alapján történő meghatározásáról. A modul minden termékhez létrehoz egy adatlapot, ahol táblázatban és vonal diagramon is mutatja az adatokat. A teljes adatbázis itt JSON és CSV formátumban kimásolható.</p>\n<p>A termék végoldalon pedig automatikusan létrehozott és számolt vagy manuálisan megadott szöveg is megadható, ami biztosítja a látogatók megfelelő információval való ellátását. Ezáltal tud megfelelni a webáruház a Fogyasztóvédelmi elvárásoknak.</p>\n<h4>Pénztár oldal módosítások</h4>\n<p>Céges számlázási adatok feltételes megjelenítése. Ebben az esetben egy checkbox jelenik meg és ha a látogató bepipálja, akkor jelennek csak meg a céges számlázás mezői, mint például a Cégnév és Adószám.</p>\n<p>A Cégnév és Adószám mezők feltételes megjelenítése csak akkor, ha a számlázási cím Magyarország. Minden más ország esetében elrejti ezeket a mezőket.</p>\n<p>A Cégnév és Adószám, az Irányítószám és Város, valamint a Telefonszám és Email cím mezőket nagy monitoron be lehet állítani, hogy egymás mellé kerüljenek. Az Irányítószám és Város mezők az Ország mező alatt jelennek meg közvetlenül, hogy logikusabb legyen a megjelenési sorrend.</p>\n<p>Az Ország és a Rendelés jegyzetek mezőket akár ki is lehet kapcsolni, ha ezek a mezők nem relevánsak a te webáruházadnál. Ha az Ország mezőt elrejted, akkor a Bolt beállításainál kiválasztott ország lesz alapértelmezettként beállítva megrendelésnél.</p>\n<h4>Plusz/mínusz mennyiségi gombok a termékekhez</h4>\n<p>A WooCommerce alapból csak egy szám típusú mezőt használ a termékek mennyiségénél, de ez felhasználói szemmel nézve nem elég. Ez a funkció a mennyiségi mező elé és után betesz egy plusz/minusz gombot, amivel a felhasználók könnyedén tudják változtatni a mennyiséget mind a termék végoldalon, mind pedig a kosár összegzés oldalán.</p>\n<h4>Automatikus frissítés a Kosár oldalon</h4>\n<p>A Kosár oldalon a termékek mennyiségének a módosításakor nincs szükség a &#8220;Kosár frissítése&#8221; gomb megnyomására a darabszám módosítása után, mert így automatikusan frissül a Kosár tartalma.</p>\n<h4>Egy termék vásárlásonként</h4>\n<p>A modul bekapcsolásával a látogatók egy adott vásárlási folyamatban csak egy terméket tudnak a kosárba tenni és megvásárolni. További vásárláshoz újabb rendelést kell leadniuk.</p>\n<h4>Kosár átirányítása a Pénztár oldalra</h4>\n<p>A modul lehetővé teszi, hogy a Kosár oldal automatikusan a Pénztár oldalra legyen irányítva, ezzel is gyorsítva a vásárlási folyamatot. Mindegy, hogy melyik oldalt használod Kosár oldalként vagy Pénztár oldalként, az átirányítás mindig működni fog.</p>\n<h4>Vásárlás folytatása gomb megjelenítése a Kosár és/vagy a Pénztár oldalakon</h4>\n<p>A Kosár és a Pénztár oldalakon megjeleníthető egy plusz Vásárlás folytatása gomb, ami az üzlet oldalra viszi a látogatókat, hogy esetleg még tovább válogassanak a termékek között. Sokszor csak kíváncsiságból kattintanak a látogatók a Kosár gombra, de még nem fejezték be a vásárlásukat.</p>\n<p>A gombok pozíciója mind a Kosár, mind a Pénztár oldalon beállítható, valamint van lehetőség egyedi üzenet megjelenítésére is bizonyos pozíciókban.</p>\n<h4>Belépés és regisztráció utáni átirányítás</h4>\n<p>Beállítható, hogy a látogatók a belépés és regisztráció után a meghatározott oldalra legyenek automatikusan átirányítva. A belépéshez és regisztrációhoz külön-külön állítható be a cél URL. A Pénztár oldalon nem veszi figyelembe az egyedi beállítást, hogy ott ne zavarja a vásárlás befejezését.</p>\n<h4>Ingyenes szállítás értesítés</h4>\n<p>A termék listaoldalakon, illetve a Kosár és Pénztár oldalakon jeleníthető meg az értesítés, hogy mennyi vásárlási összeg hiányzik még az ingyenes szállításhoz. A szöveg módosítható és többnyelvűsíthető.</p>\n<h4>Szállítási módok elrejtése</h4>\n<p>Ingyenes szállítás esetén ezzel a modullal elrejtheted az összes nem releváns szállítási módot. Lehetőséged van a személyes átvétel és a “pont” szállítási módok megtartására is.</p>\n<h4>Egyedi &#8220;Kosárba teszem&#8221; gombok</h4>\n<p>Lehetőséged van teljesen egyedi szövegek megadására a “Kosárba teszem” szöveg helyett. Sőt a különböző termék típusok (egyszerű, előfizetés, tagság, stb.) esetén különböző szövegeket is megadhatsz.</p>\n<h4>Kosár ürítése gomb</h4>\n<p>A Kosár és Pénztár oldalakon elhelyezhető gombbal a vásárló egy kattintásra tudja törölni az összes kosárban lévő terméket. A gomb csak akkor jelenik meg, ha minimum 2 termék van a kosárban. A véletlen törlés elkerülése végett a teljes törlést meg kell erősítenie a vásárlónak.</p>\n<h4>Termék ár kiegészítések</h4>\n<p>A Termékek árához lehet beállítani elő- és utótagokat. Előtag lehet például a &#8220;Csak ma&#8221;, &#8220;Nettó&#8221; stb., utótag pedig lehet a &#8220;/ pár&#8221;, &#8220;/ kg&#8221;, &#8220;(darabár)&#8221; vagy bármi, ami az adott termék árára jellemző. Az előtagot és utótagot a HuCommerce beállításainál globálisan lehet beállítani, azaz az ott megadott értékek minden terméknél meg fognak jelenni. Ezt a globális beállítást minden terméknél egyesével felül lehet írni, ahol egyedi elő- és utótagok is megadhatók vagy éppen letilthatók adott terméknél. Az előtagokat és utótagokat külön lehet meghatározni a gyüjtő (archívum) oldalakhoz és a termék végoldalakhoz.</p>\n<h4>Termék extra beállítások</h4>\n<p>Új lehetőségekkel bővülnek a Termékekhez kapcsolódó beállítások. Ez a funkció folyamatosan fog bővülni.</p>\n<p><strong>Jelenleg ezek a lehetőségek lettek beépítve:</strong></p>\n<ul>\n<li>Kosárba tesz gomb – A termék lista oldalakon az egyes termékekhez hozzá lehet adni a Kosárba tesz gombot.</li>\n<li>Termék alcím hozzáadása – Egyedi alcímek adhatók a Termékekhez, melyek a listaoldalon és a Termék végoldalon is megjelennek. Az alcím a cím heading HTML kódjába lesz illesztve külön, szemantikus megjelöléssel. Ezt fontos figyelembe venni keresőoptimalizálási (SEO) szempontból is!</li>\n<li>Kapcsolódó termékek kikapcsolása a termék végoldalakon</li>\n<li>Termék lista oldal: termékek számának beállítása oldalanként</li>\n<li>Termék lista oldal: oszlopok számának beállítása</li>\n<li>Upsell termékek száma a termék végoldalakon</li>\n<li>Upsell termékek száma soronként a termék végoldalakon</li>\n<li>Kapcsolódó termékek száma a termék végoldalakon</li>\n<li>Kapcsolódó termékek száma soronként a termék végoldalakon</li>\n</ul>\n<h4>Fizetési módok korlátozása</h4>\n<p>Minden vásárlónál külön állíthatod be, hogy milyen fizetési módot választhat a Pénztár oldalon. Így könnyedén kikapcsolhatsz egy-egy fizetési módot mondjuk azoknál a vásárlóknál, akiknél rendszeres volt az utánvétes rendelés esetén a nem fizetés és elállás. De bármilyen más okból is kikapcsolhatsz bizonyos fizetési módokat adott vásárlóknál.</p>\n<h4>SMTP szolgáltatás beállítása</h4>\n<p>Minden webáruházban fontos a kommunikáció az érdeklődővel és vásárlóval mind a vásárlás előtt, mind pedig a megrendelés leadása után. Ezért nagyon fontos, hogy a levelek kézbesítése biztonságos és megbízható legyen. Ezt a külső SMTP szolgáltatók tudják biztosítani, mint például a Mailgun vagy Sendgrid.</p>\n<p>A HuCommerce Pro SMTP beállításával összekapcsolhatod a webáruházad levelezését az SMTP szolgáltatóval.</p>\n<h4>Katalógus mód</h4>\n<p>Ezzel a modullal az értékesítéshez kapcsolódó funkciók és oldalak kapcsolhatók ki. Tehát a termékeket nem lehet kosárba tenni, nincs Pénztár oldal vagy fiók kezelés. A weboldal és a WooCommerce így katalógusként használható.</p>\n",
        "installation": "<h3>Automatikus telepítés</h3>\n<ol>\n<li>A &#8220;Bővítmények -&gt; Új hozzáadása&#8221; menüpont alatt keress rá a <em>HuCommerce | Magyar WooCommerce kiegészítések</em> bővítményre.</li>\n<li>A bővítmény dobozában kattints a &#8220;Telepítés most&#8221; gombra.</li>\n<li>Telepítés után ugyanebben a dobozban kattints a &#8220;Bekapcsol&#8221; gombra, hogy aktiváld a <em>HuCommerce | Magyar WooCommerce kiegészítések</em> bővítményt.</li>\n<li>A &#8220;WooCommerce -&gt; HuCommerce&#8221; menüpont alatt állítsd be, hogy melyik modult szeretnéd használni.</li>\n<li>Ennyi az egész. 🙂</li>\n</ol>\n<h3>Manuális telepítés az admin felületen</h3>\n<ol>\n<li>Töltsd le a bővítményt: <a href=\"https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.zip\" rel=\"nofollow ugc\">HuCommerce | Magyar WooCommerce kiegészítések</a></li>\n<li>Töltsd fel a <code>surbma-magyar-woocommerce.zip</code> fájlt a &#8220;Bővítmények -&gt; Új hozzáadása&#8221; menüpont alatt a &#8220;Bővítmény feltöltése&#8221; gombra kattintva.</li>\n<li>Aktiváld a <em>HuCommerce | Magyar WooCommerce kiegészítések</em> bővítményt a feltöltés után.</li>\n<li>A &#8220;WooCommerce -&gt; HuCommerce&#8221; menüpont alatt állítsd be, hogy melyik modult szeretnéd használni.</li>\n<li>Ennyi az egész. 🙂</li>\n</ol>\n<h3>Manuális telepítés FTP használatával</h3>\n<ol>\n<li>Töltsd le a bővítményt: <a href=\"https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.zip\" rel=\"nofollow ugc\">HuCommerce | Magyar WooCommerce kiegészítések</a></li>\n<li>Tömörítsd ki a zip fájlt a számítógépeden.</li>\n<li>Töltsd fel a <code>surbma-magyar-woocommerce</code> mappát a <code>/wp-content/plugins/</code> mappába.</li>\n<li>Aktiváld a <em>HuCommerce | Magyar WooCommerce kiegészítések</em> bővítményt a &#8220;Bővítmények&#8221; menüpont alatt a WordPress admin felületen.</li>\n<li>A &#8220;WooCommerce -&gt; HuCommerce&#8221; menüpont alatt állítsd be, hogy melyik modult szeretnéd használni.</li>\n<li>Ennyi az egész. 🙂</li>\n</ol>\n",
        "faq": "\n<dt id='hol%20tal%C3%A1lom%20a%20b%C5%91v%C3%ADtm%C3%A9ny%20be%C3%A1ll%C3%ADt%C3%A1sait%3F'>\nHol találom a bővítmény beállításait?\n</h4>\n<p>\n<p>A <em>HuCommerce | Magyar WooCommerce kiegészítések</em> bővítmény beállításait a &#8220;WooCommerce -&gt; HuCommerce&#8221; menüpont alatt éred el.</p>\n</p>\n<dt id='nem%20cser%C3%A9l%C5%91dtek%20meg%20a%20nevek%20a%20p%C3%A9nzt%C3%A1r%20oldalon.'>\nNem cserélődtek meg a nevek a Pénztár oldalon.\n</h4>\n<p>\n<p>Először töröld a szerver oldali és a böngésző gyorsítótárát és frissítsd az oldalt! Győződj meg róla, hogy esetleg más bővítmény nem okoz-e konfliktust! Ha a fordítást módosítottad, az is lehet probléma. Illetve a sablonok is tartalmazhatnak olyan egyedi kódokat, amivel ez a funkció felülírható.</p>\n<p>Figyelem! A nevek cseréje csak akkor történik meg, ha magyar nyelvre van állítva a webáruház.</p>\n</p>\n\n",
        "changelog": "<h4>2024.3.0</h4>\n<p><strong>Kiadás dátuma: 2024-08-08</strong></p>\n<p>JOGI MEGFELELÉS</p>\n<ul>\n<li>A WooCommerce saját Adatkezelési tájékoztató és Általános szerződési feltételek mezőinek az elrejtése a Pénztár oldalon, ha a Jogi megfelelés modul aktív.</li>\n<li>Új szöveg mező a Pénztár oldalon, ami a jogi szakasz elnevezése alatt jelenik meg. Ez használható egy rövid jogi szöveg megjelenítésére.</li>\n</ul>\n<h4>2024.2.0</h4>\n<p><strong>Kiadás dátuma: 2024-08-06</strong></p>\n<p>FORDÍTÁSOK PRÉMIUM BŐVÍTMÉNYEKHEZ ÉS SABLONOKHOZ</p>\n<ul>\n<li>Új Pro modul, ami magyar fordításokat ad a legnépszerűbb prémium bővítményekhez és sablonokhoz.</li>\n</ul>\n<p>FORDÍTÁSI HIÁNYOSSÁGOK JAVÍTÁSA</p>\n<ul>\n<li>A Storefront fordítás javításának a törlése, mert már nincs rá szükség.</li>\n</ul>\n<p>EGYÉB</p>\n<ul>\n<li>Kód optimalizálás.</li>\n<li>Leírás és címkék módosítása, hogy megfeleljen a WordPress.org irányelveinek.</li>\n<li>Változási napló rövidítése, hogy megfeleljen a WordPress.org irányelveinek.</li>\n<li>Kompatibilitás ellenőrzése a WordPress 6.6 verzióval.</li>\n<li>Kompatibilitás ellenőrzése a WooCommerce 9.1 verzióval.</li>\n</ul>\n<p>JAVÍTÁS</p>\n<ul>\n<li>Licensz oldal javítása üres vagy hibás licensz kulcs megadása esetén.</li>\n</ul>\n<h4>2024.1.0</h4>\n<p><strong>Kiadás dátuma: 2024-06-11</strong></p>\n<p>TERMÉK ÁR TÖRTÉNET</p>\n<ul>\n<li>Egy feltétel optimalizálása, hogy semmiképpen se lehessen végzetes hiba.</li>\n</ul>\n<p>EGYÉB</p>\n<ul>\n<li>Maszkolás újra bevezetése a licensz kulcshoz.</li>\n<li>Kompatibilitás ellenőrzése a WordPress 6.5 verzióval.</li>\n<li>Kompatibilitás ellenőrzése a WooCommerce 8.9 verzióval.</li>\n</ul>\n<h4>2023.3.1</h4>\n<p><strong>Kiadás dátuma: 2024-02-12</strong></p>\n<p>JAVÍTÁS</p>\n<ul>\n<li>A Plusz/mínusz mennyiségi gombok modulnál egy karakter hiba javítása.</li>\n</ul>\n<h4>2023.3.0</h4>\n<p><strong>Kiadás dátuma: 2023-12-31</strong></p>\n<p>FIZETÉSI MÓDOK KORLÁTOZÁSA</p>\n<ul>\n<li>Új Pro modul, amivel korlátozni lehet minden egyes felhasználónál az elérhető fizetési módokat.</li>\n</ul>\n<h4>2023.2.5</h4>\n<p><strong>Kiadás dátuma: 2023-11-30</strong></p>\n<p>JAVÍTÁS</p>\n<ul>\n<li>A Plusz/mínusz mennyiségi gombok modul ellenőrzésének a javítása a Kosár oldalon.</li>\n</ul>\n<h4>2023.2.4</h4>\n<p><strong>Kiadás dátuma: 2023-11-29</strong></p>\n<p>JAVÍTÁS</p>\n<ul>\n<li>A Plusz/mínusz mennyiségi gombok modul ellenőrzésének a kibővítése a Kosár oldalon.</li>\n</ul>\n<h4>2023.2.3</h4>\n<p><strong>Kiadás dátuma: 2023-11-29</strong></p>\n<p>JAVÍTÁS</p>\n<ul>\n<li>A Plusz/mínusz mennyiségi gombok modul javítása a Kosár oldalon.</li>\n</ul>\n<h4>2023.2.2</h4>\n<p><strong>Kiadás dátuma: 2023-11-28</strong></p>\n<p>JAVÍTÁS</p>\n<ul>\n<li>A Plusz/mínusz mennyiségi gombok modul javítása, hogy 1 darabos rendelésnél ne jelenjenek meg.</li>\n</ul>\n<p>EGYÉB</p>\n<ul>\n<li>Kompatibilitás ellenőrzése a WooCommerce 8.3 verzióval.</li>\n</ul>\n<h4>2023.2.1</h4>\n<p><strong>Kiadás dátuma: 2023-11-08</strong></p>\n<p>Kisebb javítások és a kódok optimalizálása. Nincs új funkció, a frissítés biztonságos és mindenképpen ajánlott.</p>\n<p>ADÓSZÁM MEGJELENÍTÉSE</p>\n<ul>\n<li>Kód optimalizálás.</li>\n</ul>\n<p>PÉNZTÁR OLDAL MÓDOSÍTÁSOK</p>\n<ul>\n<li>JavaScript kódok sorrendjének módosítása.</li>\n<li>Kód optimalizálás.</li>\n<li>Cégnév és Adószám mezők elrejtése opció javítása a Céges számlázási adatok feltételes megjelenítése esetén.</li>\n</ul>\n<p>EGYÉB</p>\n<ul>\n<li>Fordítások javítása az admin felületen.</li>\n<li>Bővítmény leírás javítása.</li>\n<li>Kompatibilitás ellenőrzése a WordPress 6.4 verzióval.</li>\n</ul>\n<h4>2023.2.0</h4>\n<p><strong>Kiadás dátuma: 2023-11-06</strong></p>\n<p>Újabb nagy kiadás több új funkcióval és rengeteg javítással. Új ingyenes modullal bővült a kínálat, amivel a katalógus mód aktiválható, ha az értékesítéshez kapcsolódó funkciókat ki szeretnéd kapcsolni. A Pénztár oldalon pedig egy új opcióval a Cégnév és Adószám mezőket elrejtheted a nem magyarországi számlázási cím esetén.</p>\n<p>Figyelem! A HuCommerce Kosár és Pénztár oldalakhoz kapcsolódó moduljai közül nem mind kompatibilis az új blokkokkal.</p>\n<ul>\n<li>Új modul: Katalógus mód</li>\n</ul>\n<p>LICENSZ KEZELÉS</p>\n<ul>\n<li>Az API kulcs kezelésének a módosítása.</li>\n<li>Kódok optimalizálása.</li>\n</ul>\n<p>PÉNZTÁR OLDAL MÓDOSÍTÁSOK</p>\n<ul>\n<li>Új opció: Cégnév és Adószám mezők elrejtése, ha a számlázási ország nem Magyarország</li>\n</ul>\n<p>TERMÉK ÁR TÖRTÉNET</p>\n<ul>\n<li>Kód optimalizálása.</li>\n<li>Hibaüzenet hozzáadása a termék azonosító hiánya esetén.</li>\n</ul>\n<p>EGYÉB</p>\n<ul>\n<li>HuCommerce beállítások megjelenésének a finomításai.</li>\n<li>Hiányzó fordítások hozzáadása.</li>\n<li>Megjelenítés igazítása a Licensz kezelés oldalon.</li>\n<li>Ikon módosítása az admin felületen.</li>\n<li>HS Beacon kiegészítése további adatokkal.</li>\n<li>CPS SDK frissítése a 8.14.0 verzióra.</li>\n<li>WooCommerce inkompatibilitás meghatározása: Kosár és Pénztár blokkok.</li>\n</ul>\n<h4>2023.1.0</h4>\n<p><strong>Kiadás dátuma: 2023-07-24</strong></p>\n<p>Ez egy nagy kiadás lett, rengeteg kisebb és nagyobb módosítással. A legfontosabb változás, hogy most már HPOS/COT kompatibilis lett a HuCommerce is. Az admin felületen új főmenüpontot kapott a bővítmény, így a beállítások és az egyéb menüpontok könnyebben elérhetők. A kezelő felület is teljesen megváltozott, új, modernebb megjelenést kapott, amivel a kezelés is egyszerűbb lesz. Vannak új opciók is a modulokhoz, most új modul nem került bele ebbe a verzióba. A fókusz a kódok optimalizálásán és az új fejlesztések előkészítésén volt. Kérlek olvasd el a részleteket is, biztosan találsz számodra is hasznos funkciót, változtatást.</p>\n<p>PÉNZTÁR OLDAL MÓDOSÍTÁSOK</p>\n<ul>\n<li>Új opció: egyedi Megrendelés gomb szöveg megadása.</li>\n</ul>\n<p>TERMÉK ÁR KIEGÉSZÍTÉSEK</p>\n<ul>\n<li><a href=\"https://woocommerce.com/document/high-performance-order-storage/\" rel=\"nofollow ugc\">HPOS/COT</a> kompatibilitás bevezetése.</li>\n</ul>\n<p>JOGI MEGFELELÉS</p>\n<ul>\n<li><a href=\"https://woocommerce.com/document/high-performance-order-storage/\" rel=\"nofollow ugc\">HPOS/COT</a> kompatibilitás bevezetése.</li>\n</ul>\n<p>ADÓSZÁM MEGJELENÍTÉSE</p>\n<ul>\n<li>Kódok átrendezése logikailag.</li>\n<li>Minden kódhoz leírás hozzáadása vagy módosítása.</li>\n</ul>\n<p>SZÁLLÍTÁSI MÓDOK ELREJTÉSE</p>\n<ul>\n<li>Új opciót kapott a Szállítási módok elrejtése, amivel ez a funkció kikapcsolható, mivel van már más funkció is a modulhoz.</li>\n<li>Új funkció: szállítási módok elrejtése a kosár oldalon.</li>\n</ul>\n<p>TERMÉK ÁR TÖRTÉNET</p>\n<ul>\n<li>Shortcode paraméter értékének ellenőrzése és hibás adat esetén visszajelzés kiírása.</li>\n<li>Shortcode logika átírása, hogy variálható termékek esetén is működjön.</li>\n<li>Variálható termék esetén külön wrapper, hogy a dinamikus megjelenést specifikusabban lehessen célozni.</li>\n<li>A termék végoldalakon megjelenítendő kódok módosítása, hogy azok kódolással felülírhatók legyenek, ha egyedi megjelenítésre van esetleg szükség.</li>\n<li>A kód indent-álása a helyes szintaxis miatt.</li>\n<li>A kódban a változók elnevezésének az egységesítése.</li>\n<li>A &#8220;Termék ár történet&#8221; log-olása kikapcsolt modul esetén is az ingyenes változatban is.</li>\n<li>Kód dokumentálásának a javításai.</li>\n<li>iThemes Security bővítmény PHP Execution beállításának a felülírása, hogy a product-price-history-display.php fájl futtatható legyen.</li>\n<li>Termék ár történet mentése első alkalommal, amikor egy terméket szerkesztünk.</li>\n<li>Részletes statisztika link megjelenítésének a beállítása globálisan és termékenként is, akár variációnként is.</li>\n<li>Külön szövegek megadása akkor, ha az aktuális kedvezményes ár a legalacsonyabb ár.</li>\n<li>Logika optimalizálása a termék azonosító meghatározására.</li>\n<li>Logika optimalizálása az akció meghatározására.</li>\n<li>Kód optimalizálása a feltételek jobb alkalmazásával.</li>\n<li>Aktuális kedvezmény számítása és használata.</li>\n<li>A részletes statisztika oldalon új feltétel megadása, hogy csak megfelelő jogosultsággal lehessen törlési műveletet végrehajtani.</li>\n<li>Kis módosítás a szövegezésben.</li>\n</ul>\n<p>MEZŐK ÉRTÉKÉNEK ELLENŐRZÉSE</p>\n<ul>\n<li>A “Szállítás másik címre” opció ellenőrzése, hogy egyáltalán létezik-e?</li>\n</ul>\n<p>TERMÉK MÓDOSÍTÁSOK</p>\n<ul>\n<li>Új opció: Kép nagyítás kikapcsolása.</li>\n</ul>\n<p>LICENSZ KEZELÉS</p>\n<ul>\n<li>Whitelist bevezetése a saját és a Prémium WordPress weboldalakhoz.</li>\n<li>A whitelist feltétel kibővítése, hogy lehessen szabályozni fejlesztésnél.</li>\n<li>Kódok sorrendjének módosítása az optimális működés érdekében.</li>\n<li>Új logika bevezetése a sikertelen lekérés esetén, hogy maradjon az előző státusz, amíg sikeres nem lesz a licensz státusz lekérése.</li>\n<li>A Licensz kezeléshez kapcsolódó manuális műveletek csak a Licensz kezelés oldalon futnak le.</li>\n<li>A globális változók értékeinek meghatározása új logikával.</li>\n<li>Kódok általános optimalizálása.</li>\n<li>Az API kezelés link módosítása, hogy egyből az API kulcsok kezelésére mutasson.</li>\n</ul>\n<p>EGYÉB</p>\n<ul>\n<li>Ügyfélszolgálati link módosítása Pro előfizetőknél, hogy a Help Scout Beacon-t nyissa meg közvetlenül.</li>\n<li>A HuCommerce új főmenüpontba költözött és az egyes menüpontok almenüpontként közvetlenül is elérhetőek.</li>\n<li>A teljes admin UI átdolgozása.</li>\n<li>Új HuCommerce logó.</li>\n<li>Az egyes menüpontok külön oldalra kerültek.</li>\n<li>Egységes kinézet a listázásokhoz, elemekhez.</li>\n<li>A modulokhoz szűrők bevezetése.</li>\n<li>Modul beállítások feltételes megjelenítése.</li>\n<li>Ideiglenesen a Hírek és Ajánlatok menüpontok törlése.</li>\n<li>Ajánlatok és Hírek loop-ok törlése az admin Vezérlőpult alól.</li>\n<li><a href=\"https://woocommerce.com/document/high-performance-order-storage/\" rel=\"nofollow ugc\">HPOS/COT</a> kompatibilitás.</li>\n<li>Új &#8220;HuCommerce Pro megvásárlása&#8221; gomb a HuCommerce beállítások oldalon a navigációnál.</li>\n<li>A hucommerce.hu oldalra mutató linkek javítása.</li>\n<li>A Beacon kód generálása dinamikus lett.</li>\n<li>Különböző feltételek megadása az egyes Beacon-ökhöz.</li>\n<li>Changelog szintaxis módosítása.</li>\n<li>Kompatibilitás ellenőrzése a WordPress 6.3 verzióval.</li>\n<li>Kompatibilitás ellenőrzése a WooCommerce 8.0 verzióval.</li>\n<li>CPS SDK frissítése a 8.13.0 verzióra.</li>\n</ul>\n<p><a href=\"https://www.hucommerce.hu/changelog/\" rel=\"nofollow ugc\">HuCommerce teljes változási napló <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span></a></p>\n"
    },
    "short_description": "Hasznos javítások a magyar WooCommerce webáruházakhoz.",
    "description": "<p>A WooCommerce a világ és most már Magyarország legnépszerűbb webáruház platformja is. A HuCommerce kiegészítővel könnyebben és gyorsabban indíthatod a webáruházad, mert a legtöbb fontos funkciót és fejlesztést egy gombnyomással helyettesítheted.</p>\n<p>A HuCommerce bővítmény ingyenes változata most már évek óta a magyar WooCommerce webáruház tulajdonosok kedvenc kiegészítője. Több, mint 10000 webáruházban megtalálható és a letöltések száma folyamatosan nő.</p>\n<p>Azon dolgozunk, hogy folyamatosan hasznos funkciókkal bővítsük ezt a nagyszerű WooCommerce kiegészítőt. Kérlek, támogasd a fejlesztést és a HuCommerce közösséget azzal, hogy megvásárolod a Pro verziót! Ezzel fedezni tudjuk a fejlesztési költségeket és több időt tudunk arra fordítani, hogy a HuCommerce bővítmény még jobb legyen és még több hasznod legyen belőle.</p>\n<p>A HuCommerce ingyenes verziója rengeteg olyan apró, hasznos vagy akár jogilag kötelező funkciót tartalmaz, ami hiányzik a WooCommerce bővítményből. Többek között rendbe teszi a vezetéknév és keresztnév sorrendjét és az adószám mezőt is hozzáadja a pénztárhoz, de folyamatosan bővül hasonló praktikus, hasznos vagy kötelező funkciókkal.</p>\n<p>A HuCommerce Pro előfizetés éves díja egy kezdő magyar fejlesztő pár órás munkadíja, miközben neked napokat vagy akár hónapokat spórol meg fejlesztési és kutatási oldalon. Ez a kiegészítő a leghasznosabb és nélkülözhetetlen funkciókkal egészíti ki a webáruházad. A fizetős konstrukció biztosítja, hogy folyamatosan bővüljön újabb hasznos funkciókkal.</p>\n<p>A funkciók folyamatosan bővülnek, de mindenki megírhatja a véleményét, ötletét, hogyan tudjuk egyre jobbá tenni ezt a bővítményt.</p>\n<p><strong>Hasznos linkek:</strong></p>\n<ul>\n<li><a href=\"https://www.hucommerce.hu/bovitmenyek/hucommerce/\" rel=\"nofollow ugc\">Bővebben a HuCommerce Pro bővítményről <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span></a></li>\n<li><a href=\"https://www.hucommerce.hu/modulok/\" rel=\"nofollow ugc\">Bővebben a HuCommerce modulokról <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span></a></li>\n<li><a href=\"https://www.hucommerce.hu/tudasbazis/\" rel=\"nofollow ugc\">HuCommerce tudásbázis <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span></a></li>\n</ul>\n<p><strong>Ügyfélszolgálat és támogatás:</strong></p>\n<ul>\n<li><a href=\"https://wordpress.org/support/plugin/surbma-magyar-woocommerce/\" rel=\"ugc\">WordPress.org fórum</a></li>\n<li><a href=\"https://www.facebook.com/groups/HuCommerce.hu/\" rel=\"nofollow ugc\">HuCommerce Facebook csoport <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span></a></li>\n<li>A HuCommerce Pro ügyfelek számára email és live chat csatornákon is biztosítjuk az ügyfélszolgálati ügyek intézését és a támogatást a bővítményhez.</li>\n</ul>\n<h3>HuCommerce (ingyenes)</h3>\n<p>Több, mint 10000 webáruház tulajdonos választása Magyarországon. Rengeteg hasznos funkció, kötelező választás minden magyar WooCommerce webáruházhoz.</p>\n<p><strong>HuCommerce ingyenes funkciói:</strong></p>\n<ul>\n<li>Vezetéknév és keresztnév rendbetétele (WooCommerce 4.4 verzió fölött is)</li>\n<li>Adószám bekérése vásárlásnál</li>\n<li>Megye mező elrejtése</li>\n<li>Város automatikus kitöltése az irányítószám alapján</li>\n<li>Pénztár oldal módosítások</li>\n<li>Kupon mező módosítások</li>\n<li>Plusz/minusz mennyiségi gombok a termékekhez</li>\n<li>Automatikus frissítés a Kosár oldalon</li>\n<li>Egy termék vásárlásonként</li>\n<li>Kosár átirányítása a Pénztár oldalra</li>\n<li>Vásárlás folytatása gomb megjelenítése a Kosár és/vagy a Pénztár oldalakon</li>\n<li>Belépés és regisztráció utáni átirányítás</li>\n<li>Szállítási módok elrejtése</li>\n<li>Egyedi “Kosárba teszem” gombok</li>\n<li>Termék extra beállítások</li>\n<li>SMTP szolgáltatás beállítása</li>\n<li>Katalógus mód</li>\n<li>Fordítási hiányosságok javítása</li>\n<li>WPML és Polylang kompatibilitás</li>\n<li>Alap ügyfélszolgálat és támogatás</li>\n<li>További funkciók hamarosan…</li>\n</ul>\n<h3>HuCommerce Pro (fizetős)</h3>\n<p>A HuCommerce kibővített kiadása, további hasznos és folyamatosan bővülő funkciókkal. Kérlek, támogasd a fejlesztést és a HuCommerce közösséget azzal, hogy megvásárolod a Pro verziót! Ezzel fedezni tudjuk a fejlesztési költségeket és több időt tudunk arra fordítani, hogy a HuCommerce bővítmény még jobb legyen és még több hasznod legyen belőle.</p>\n<p><strong>HuCommerce Pro további funkciói:</strong></p>\n<ul>\n<li>Pénztár mezők ellenőrzése</li>\n<li>Ingyenes szállítás értesítés</li>\n<li>Kosár ürítése gomb</li>\n<li>Termék ár történet (új Fogyasztóvédelemi rendelet)</li>\n<li>Termék ár kiegészítések</li>\n<li>Jogi megfelelés (Fogyasztóvédelem, GDPR, ePrivacy, stb.)</li>\n<li>Fizetési módok korlátozása</li>\n<li>Globális adatok, amiket shortcode-dal lehet bárhol megjeleníteni</li>\n<li>Kiemelt ügyfélszolgálat és támogatás</li>\n<li>További funkciók hamarosan…</li>\n</ul>\n<h3>HuCommerce kiemelt moduljai és rövid leírása:</h3>\n<h4>Vezetéknév és keresztnév rendbetétele (WooCommerce 4.4 verzió fölött is)</h4>\n<p>A keresztnév és vezetéknév sorrendjének a megfordítása, ha a webáruház magyar nyelvre van állítva. Mindezt úgy, hogy reszponzív nézetben is jó legyen és a CRM, számlázó programok is tudják értelmezni.</p>\n<p>A megjelenítés kompatibilis a WPML bővítménnyel, így többnyelvű webáruháznál is jó sorrendben jelenik meg a név magyar nyelven.</p>\n<p>A név sorrendje a megrendelés visszaigazolásánál, a vásárló fiókjában és az értesítő levelekben is jól jelenik meg.</p>\n<h4>Adószám bekérése vásárlásnál</h4>\n<p>A Pénztár oldalon a Cégnév mező alatt már Adószámot is be lehet kérni. Az Adószám mező csak akkor jelenik meg, ha a Cégnév mezőbe lett írva. Az adószám ebben az esetben kötelező mező. Az adószám a rendelésen kívül az adott felhasználó profil adatainál is elmentésre kerül. Az adószám megjelenik mind a visszaigazoláson, mind a rendelés szerkesztésénél, valamint az értesítő levelekben is.</p>\n<p>Maszkolás és validálás is beállítható az Adószám mezőhöz és placeholder megjelenítése is bekapcsolható, ami azoknál a sablonoknál nagyon jól jön, amiknél nem jelennek meg a mezők címkéi.</p>\n<h4>Pénztár mezők ellenőrzése</h4>\n<p>Beállítható, hogy a Pénztár oldalon a Számlázási adatoknál az Adószám, Irányítószám és Telefonszám mezőket, a Szállítási adatoknál pedig az Irányítószámot maszkolja, azaz formai szempontból validálja, illetve a megadott beviteli értéket ellenőrizze. Így a következő értékek lesznek érvényben:</p>\n<ul>\n<li>Számlázási Adószám: 00000000-0-00 (13 karakter), 00000000000 (11 szám), HU00000000 (HU előtag és 8 szám)</li>\n<li>Számlázási és Szállítási Irányítószám: 0000 (4 karakter)</li>\n<li>Számlázási Telefonszám: +36000000000 (11-12 karakter)</li>\n</ul>\n<h4>Város automatikus kitöltése az irányítószám alapján</h4>\n<p>A Pénztár oldalon az irányítószám mező kitöltése után automatikusan megjeleníti a várost. Ha már manuálisan lett módosítva a város, akkor nem módosítja az irányítószám alapján.</p>\n<h4>Fordítási hiányosságok javítása</h4>\n<p>Ideiglenes fordítási hiányosságok javítása a WooCommerce bővítményhez és a legnépszerűbb sablonokhoz (Divi, Storefront), amíg a hivatalos fordításban esetleg nem jelenik meg vagy nem frissíti a rendszer. Én hivatalos szerkesztője is vagyok a magyar WooCommerce fordítási csapatának, ezért ott sokmindent megcsinálok, de néha szükség van erre a kis trükkre.</p>\n<h4>Jogi megfelelés (Fogyasztóvédelem, GDPR, ePrivacy, stb.)</h4>\n<p>Lehetőség van az Általános Szerződési Feltételek és az Adatkezelési tájékoztató aktív cselekvésen alapuló elfogadtatására, azaz ki kell pipálnia a vásárlónak ezek elfogadását, mielőtt a rendelést leadhatná. Az adatok a rendeléseknél kerülnek elmentésre és a rendelés szerkesztése oldalon megjelenik az elfogadott státusz. Ebben az esetben a vásárló profil adatainál nem kerül elmentésre az elfogadás, így azt bejelentkezve is minden vásárlás alkalmával el kell fogadnia.</p>\n<p>Opcionális a két mező használata, így ha valakinek csak az egyik elfogadtatására és megerősítésére van szüksége, akkor egyik vagy másik kikapcsolható.</p>\n<p>További két extra mező is hozzáadható, amihez teljesen szabadon lehet szöveget, linket megadni. Ezekre további jogi megfelelés céljából lehet szükség, ha az adott webáruház megköveteli ezt. Amennyiben bármelyik mező aktiválva lett, azok mindenképpen kötelezőek.</p>\n<p>A Pénztár oldalon a Megrendelés gomb fölött és/vagy alatt közvetlenül elhelyezhető jogi szöveg, ami esetleg fontos vagy kötelező eleme a vásárlási folyamatnak. Ilyen például a távollévők közötti szerződéshez szükséges tudomásulvétel vagy a &#8220;fizetési kötelezettséggel járó megrendelés&#8221; kötelező megjelenítése a megrendelés során.</p>\n<p>A regisztrációs űrlapnál is kérhető az Adatkezelési Tájékoztató kötelező elfogadtatása. Ez az adat már elmentésre kerül a felhasználó profil adatainál. Külön beállítható, hogy a felhasználó IP címét is elmentse a rendszer. A regisztrációs adatokat (elfogadás ténye, regisztráció dátuma, IP cím) mind az admin felületen, mind pedig a felhasználó fiókadatainál megjeleníti, de ezek a mezők nem módosíthatók sem a felhasználók, sem az adminisztrátorok részéről.</p>\n<blockquote>\n<p><strong>FIGYELEM!</strong> A webáruház jogi megfelelése az aktuális törvényeknek és adatvédelmi rendeleteknek minden esetben a webáruház tulajdonosának a felelőssége. Ez az opció nem mentesít senkit sem az alól, hogy a megfelelést felülvizsgáltassa szakértővel vagy jogásszal. A fejlesztők nem vállalnak semmilyen felelősséget a webáruház jogi megfeleléséért.</p>\n</blockquote>\n<h4>Termék ár történet (új Fogyasztóvédelemi rendelet: 4/2009. (I. 30.) NFGM-SZMM együttes rendelet 2/A. §)</h4>\n<p>Ez a modul nincs minden körülmény között tesztelve és nem tudja 100%-ban teljesíteni a funkcionális és/vagy jogi igényeket, feltételeket. Ezért a használata esetén fokozott figyelmet igényel.</p>\n<blockquote>\n<p><strong>FIGYELEM!</strong> A HuCommerce ügyfélszolgálatára beküldött visszajelzések és javaslatok jelentősen gyorsítják a modul fejlesztését, ezért szívesen várjuk az ilyen témájú megkereséseket. Köszönjük!</p>\n</blockquote>\n<p>Az Európai Unió területén, így Magyarországon is 2022. május 28-tól egységes szabályok vonatkoznak az árcsökkentésre.</p>\n<p>Az új szabályozás célja annak megakadályozása, hogy a kereskedők megtévesztő árcsökkentéseket alkalmazzanak azzal, hogy az akciók előtt megemeljék a korábbi árat és ezáltal megtévesszék a fogyasztókat az árengedmény mértékével kapcsolatban.</p>\n<blockquote>\n<p>A 93/13/EGK tanácsi irányelvnek, valamint a 98/6/EK, a 2005/29/EK és a 2011/83/EU európai parlamenti és tanácsi irányelvnek az uniós fogyasztóvédelmi szabályok hatékonyabb végrehajtása és korszerűsítése tekintetében történő módosításáról szóló, 2019. november 27-i (EU) 2019/2161 európai parlamenti és tanácsi irányelv érintett rendelkezései a termékek eladási ára és egységára, továbbá a szolgáltatások díja feltüntetésének részletes szabályairól szóló 4/2009. (I. 30.) NFGM-SZMM együttes rendelet (a továbbiakban: Árrendelet) 2/A. §-ában kerültek átültetésére.</p>\n</blockquote>\n<p>Ez a modul biztosítja a rendeletnek való megfelelést. A termékhez kapcsolódó árak folyamatos mentésével és annak statisztikai megjelenítésével egy átfogó képet ad a webáruház tulajdonosnak az árváltozás és az aktuális kedvezmény rendelet alapján történő meghatározásáról. A modul minden termékhez létrehoz egy adatlapot, ahol táblázatban és vonal diagramon is mutatja az adatokat. A teljes adatbázis itt JSON és CSV formátumban kimásolható.</p>\n<p>A termék végoldalon pedig automatikusan létrehozott és számolt vagy manuálisan megadott szöveg is megadható, ami biztosítja a látogatók megfelelő információval való ellátását. Ezáltal tud megfelelni a webáruház a Fogyasztóvédelmi elvárásoknak.</p>\n<h4>Pénztár oldal módosítások</h4>\n<p>Céges számlázási adatok feltételes megjelenítése. Ebben az esetben egy checkbox jelenik meg és ha a látogató bepipálja, akkor jelennek csak meg a céges számlázás mezői, mint például a Cégnév és Adószám.</p>\n<p>A Cégnév és Adószám mezők feltételes megjelenítése csak akkor, ha a számlázási cím Magyarország. Minden más ország esetében elrejti ezeket a mezőket.</p>\n<p>A Cégnév és Adószám, az Irányítószám és Város, valamint a Telefonszám és Email cím mezőket nagy monitoron be lehet állítani, hogy egymás mellé kerüljenek. Az Irányítószám és Város mezők az Ország mező alatt jelennek meg közvetlenül, hogy logikusabb legyen a megjelenési sorrend.</p>\n<p>Az Ország és a Rendelés jegyzetek mezőket akár ki is lehet kapcsolni, ha ezek a mezők nem relevánsak a te webáruházadnál. Ha az Ország mezőt elrejted, akkor a Bolt beállításainál kiválasztott ország lesz alapértelmezettként beállítva megrendelésnél.</p>\n<h4>Plusz/mínusz mennyiségi gombok a termékekhez</h4>\n<p>A WooCommerce alapból csak egy szám típusú mezőt használ a termékek mennyiségénél, de ez felhasználói szemmel nézve nem elég. Ez a funkció a mennyiségi mező elé és után betesz egy plusz/minusz gombot, amivel a felhasználók könnyedén tudják változtatni a mennyiséget mind a termék végoldalon, mind pedig a kosár összegzés oldalán.</p>\n<h4>Automatikus frissítés a Kosár oldalon</h4>\n<p>A Kosár oldalon a termékek mennyiségének a módosításakor nincs szükség a &#8220;Kosár frissítése&#8221; gomb megnyomására a darabszám módosítása után, mert így automatikusan frissül a Kosár tartalma.</p>\n<h4>Egy termék vásárlásonként</h4>\n<p>A modul bekapcsolásával a látogatók egy adott vásárlási folyamatban csak egy terméket tudnak a kosárba tenni és megvásárolni. További vásárláshoz újabb rendelést kell leadniuk.</p>\n<h4>Kosár átirányítása a Pénztár oldalra</h4>\n<p>A modul lehetővé teszi, hogy a Kosár oldal automatikusan a Pénztár oldalra legyen irányítva, ezzel is gyorsítva a vásárlási folyamatot. Mindegy, hogy melyik oldalt használod Kosár oldalként vagy Pénztár oldalként, az átirányítás mindig működni fog.</p>\n<h4>Vásárlás folytatása gomb megjelenítése a Kosár és/vagy a Pénztár oldalakon</h4>\n<p>A Kosár és a Pénztár oldalakon megjeleníthető egy plusz Vásárlás folytatása gomb, ami az üzlet oldalra viszi a látogatókat, hogy esetleg még tovább válogassanak a termékek között. Sokszor csak kíváncsiságból kattintanak a látogatók a Kosár gombra, de még nem fejezték be a vásárlásukat.</p>\n<p>A gombok pozíciója mind a Kosár, mind a Pénztár oldalon beállítható, valamint van lehetőség egyedi üzenet megjelenítésére is bizonyos pozíciókban.</p>\n<h4>Belépés és regisztráció utáni átirányítás</h4>\n<p>Beállítható, hogy a látogatók a belépés és regisztráció után a meghatározott oldalra legyenek automatikusan átirányítva. A belépéshez és regisztrációhoz külön-külön állítható be a cél URL. A Pénztár oldalon nem veszi figyelembe az egyedi beállítást, hogy ott ne zavarja a vásárlás befejezését.</p>\n<h4>Ingyenes szállítás értesítés</h4>\n<p>A termék listaoldalakon, illetve a Kosár és Pénztár oldalakon jeleníthető meg az értesítés, hogy mennyi vásárlási összeg hiányzik még az ingyenes szállításhoz. A szöveg módosítható és többnyelvűsíthető.</p>\n<h4>Szállítási módok elrejtése</h4>\n<p>Ingyenes szállítás esetén ezzel a modullal elrejtheted az összes nem releváns szállítási módot. Lehetőséged van a személyes átvétel és a “pont” szállítási módok megtartására is.</p>\n<h4>Egyedi &#8220;Kosárba teszem&#8221; gombok</h4>\n<p>Lehetőséged van teljesen egyedi szövegek megadására a “Kosárba teszem” szöveg helyett. Sőt a különböző termék típusok (egyszerű, előfizetés, tagság, stb.) esetén különböző szövegeket is megadhatsz.</p>\n<h4>Kosár ürítése gomb</h4>\n<p>A Kosár és Pénztár oldalakon elhelyezhető gombbal a vásárló egy kattintásra tudja törölni az összes kosárban lévő terméket. A gomb csak akkor jelenik meg, ha minimum 2 termék van a kosárban. A véletlen törlés elkerülése végett a teljes törlést meg kell erősítenie a vásárlónak.</p>\n<h4>Termék ár kiegészítések</h4>\n<p>A Termékek árához lehet beállítani elő- és utótagokat. Előtag lehet például a &#8220;Csak ma&#8221;, &#8220;Nettó&#8221; stb., utótag pedig lehet a &#8220;/ pár&#8221;, &#8220;/ kg&#8221;, &#8220;(darabár)&#8221; vagy bármi, ami az adott termék árára jellemző. Az előtagot és utótagot a HuCommerce beállításainál globálisan lehet beállítani, azaz az ott megadott értékek minden terméknél meg fognak jelenni. Ezt a globális beállítást minden terméknél egyesével felül lehet írni, ahol egyedi elő- és utótagok is megadhatók vagy éppen letilthatók adott terméknél. Az előtagokat és utótagokat külön lehet meghatározni a gyüjtő (archívum) oldalakhoz és a termék végoldalakhoz.</p>\n<h4>Termék extra beállítások</h4>\n<p>Új lehetőségekkel bővülnek a Termékekhez kapcsolódó beállítások. Ez a funkció folyamatosan fog bővülni.</p>\n<p><strong>Jelenleg ezek a lehetőségek lettek beépítve:</strong></p>\n<ul>\n<li>Kosárba tesz gomb – A termék lista oldalakon az egyes termékekhez hozzá lehet adni a Kosárba tesz gombot.</li>\n<li>Termék alcím hozzáadása – Egyedi alcímek adhatók a Termékekhez, melyek a listaoldalon és a Termék végoldalon is megjelennek. Az alcím a cím heading HTML kódjába lesz illesztve külön, szemantikus megjelöléssel. Ezt fontos figyelembe venni keresőoptimalizálási (SEO) szempontból is!</li>\n<li>Kapcsolódó termékek kikapcsolása a termék végoldalakon</li>\n<li>Termék lista oldal: termékek számának beállítása oldalanként</li>\n<li>Termék lista oldal: oszlopok számának beállítása</li>\n<li>Upsell termékek száma a termék végoldalakon</li>\n<li>Upsell termékek száma soronként a termék végoldalakon</li>\n<li>Kapcsolódó termékek száma a termék végoldalakon</li>\n<li>Kapcsolódó termékek száma soronként a termék végoldalakon</li>\n</ul>\n<h4>Fizetési módok korlátozása</h4>\n<p>Minden vásárlónál külön állíthatod be, hogy milyen fizetési módot választhat a Pénztár oldalon. Így könnyedén kikapcsolhatsz egy-egy fizetési módot mondjuk azoknál a vásárlóknál, akiknél rendszeres volt az utánvétes rendelés esetén a nem fizetés és elállás. De bármilyen más okból is kikapcsolhatsz bizonyos fizetési módokat adott vásárlóknál.</p>\n<h4>SMTP szolgáltatás beállítása</h4>\n<p>Minden webáruházban fontos a kommunikáció az érdeklődővel és vásárlóval mind a vásárlás előtt, mind pedig a megrendelés leadása után. Ezért nagyon fontos, hogy a levelek kézbesítése biztonságos és megbízható legyen. Ezt a külső SMTP szolgáltatók tudják biztosítani, mint például a Mailgun vagy Sendgrid.</p>\n<p>A HuCommerce Pro SMTP beállításával összekapcsolhatod a webáruházad levelezését az SMTP szolgáltatóval.</p>\n<h4>Katalógus mód</h4>\n<p>Ezzel a modullal az értékesítéshez kapcsolódó funkciók és oldalak kapcsolhatók ki. Tehát a termékeket nem lehet kosárba tenni, nincs Pénztár oldal vagy fiók kezelés. A weboldal és a WooCommerce így katalógusként használható.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2024.3.0.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "hungarian": "hungarian",
        "magyar": "magyar",
        "magyarorszag": "magyarország",
        "webaruhaz": "webáruház",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "2024.3.0",
    "versions": {
        "1.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.1.1.zip",
        "10.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.10.0.zip",
        "10.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.10.1.zip",
        "11.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.11.0.zip",
        "11.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.11.1.zip",
        "11.2": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.11.2.zip",
        "11.3": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.11.3.zip",
        "12.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.12.0.zip",
        "13.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.13.0.zip",
        "14.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.14.0.zip",
        "14.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.14.1.zip",
        "14.2": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.14.2.zip",
        "14.3": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.14.3.zip",
        "14.4": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.14.4.zip",
        "15.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.15.1.zip",
        "16.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.16.0.zip",
        "17.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.17.0.zip",
        "18.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.18.0.zip",
        "18.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.18.1.zip",
        "18.2": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.18.2.zip",
        "18.3": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.18.3.zip",
        "18.4": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.18.4.zip",
        "18.5": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.18.5.zip",
        "18.7": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.18.7.zip",
        "19.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.19.0.zip",
        "19.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.19.1.zip",
        "2.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2.0.zip",
        "20.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.20.0.zip",
        "2022.0.3": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.0.3.zip",
        "2022.1.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.1.0.zip",
        "2022.1.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.1.1.zip",
        "2022.1.3": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.1.3.zip",
        "2022.1.5": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.1.5.zip",
        "2022.2.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.2.0.zip",
        "2022.2.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.2.1.zip",
        "2022.3.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.3.0.zip",
        "2022.3.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.3.1.zip",
        "2022.3.2": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.3.2.zip",
        "2022.3.4": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.3.4.zip",
        "2022.3.5": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.3.5.zip",
        "2022.4.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.4.0.zip",
        "2022.4.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2022.4.1.zip",
        "2023.1.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2023.1.0.zip",
        "2023.2.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2023.2.0.zip",
        "2023.2.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2023.2.1.zip",
        "2023.2.2": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2023.2.2.zip",
        "2023.2.3": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2023.2.3.zip",
        "2023.2.4": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2023.2.4.zip",
        "2023.2.5": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2023.2.5.zip",
        "2023.3.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2023.3.0.zip",
        "2023.3.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2023.3.1.zip",
        "2024.1.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2024.1.0.zip",
        "2024.2.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2024.2.0.zip",
        "2024.3.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.2024.3.0.zip",
        "21.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.21.0.zip",
        "21.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.21.1.zip",
        "21.2": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.21.2.zip",
        "21.3": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.21.3.zip",
        "21.4": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.21.4.zip",
        "21.5": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.21.5.zip",
        "21.6": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.21.6.zip",
        "22.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.22.0.zip",
        "22.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.22.1.zip",
        "23.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.23.0.zip",
        "23.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.23.1.zip",
        "23.10": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.23.10.zip",
        "23.11": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.23.11.zip",
        "23.2": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.23.2.zip",
        "23.3": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.23.3.zip",
        "23.4": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.23.4.zip",
        "23.5": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.23.5.zip",
        "23.6": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.23.6.zip",
        "23.7": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.23.7.zip",
        "23.8": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.23.8.zip",
        "23.9": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.23.9.zip",
        "24.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.24.0.zip",
        "25.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.25.0.zip",
        "26.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.26.0.zip",
        "26.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.26.1.zip",
        "26.2": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.26.2.zip",
        "26.3": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.26.3.zip",
        "26.4": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.26.4.zip",
        "26.5": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.26.5.zip",
        "26.6": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.26.6.zip",
        "26.7": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.26.7.zip",
        "27.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.27.0.zip",
        "27.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.27.1.zip",
        "27.2": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.27.2.zip",
        "28.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.28.0.zip",
        "29.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.29.0.zip",
        "29.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.29.1.zip",
        "29.2": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.29.2.zip",
        "29.3": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.29.3.zip",
        "29.4": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.29.4.zip",
        "29.5": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.29.5.zip",
        "29.6": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.29.6.zip",
        "3.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.3.0.zip",
        "30.0.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.30.0.0.zip",
        "30.0.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.30.0.1.zip",
        "30.1.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.30.1.0.zip",
        "30.2.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.30.2.0.zip",
        "30.3.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.30.3.0.zip",
        "4.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.4.0.zip",
        "4.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.4.1.zip",
        "4.2": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.4.2.zip",
        "4.3": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.4.3.zip",
        "4.4": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.4.4.zip",
        "4.5": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.4.5.zip",
        "5.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.5.0.zip",
        "5.2": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.5.2.zip",
        "6.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.6.0.zip",
        "7.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.7.0.zip",
        "7.1": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.7.1.zip",
        "8.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.8.0.zip",
        "9.0": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.9.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/surbma-magyar-woocommerce.zip"
    },
    "business_model": "commercial",
    "repository_url": "",
    "commercial_support_url": "https://www.hucommerce.hu/ugyfelszolgalat/",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/surbma-magyar-woocommerce/assets/banner-772x250.jpg?rev=2541312",
        "high": "https://ps.w.org/surbma-magyar-woocommerce/assets/banner-1544x500.jpg?rev=2541312"
    },
    "icons": {
        "1x": "https://ps.w.org/surbma-magyar-woocommerce/assets/icon-128x128.jpg?rev=2541312",
        "2x": "https://ps.w.org/surbma-magyar-woocommerce/assets/icon-256x256.jpg?rev=2541312"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "surbma-magyar-woocommerce",
            "language": "hu_HU",
            "version": "2024.3.0",
            "updated": "2024-08-06 20:35:01",
            "package": "https://downloads.wordpress.org/translation/plugin/surbma-magyar-woocommerce/2024.3.0/hu_HU.zip"
        }
    ]
}