{
    "name": "Swatchly – WooCommerce Variation Swatches for Products (product attributes: Image swatch, Color swatches, Label swatches)",
    "slug": "swatchly",
    "version": "1.3.3",
    "author": "<a href=\"https://hasthemes.com\">HasThemes</a>",
    "author_profile": "https://profiles.wordpress.org/hasthemes/",
    "contributors": {
        "hasthemes": {
            "profile": "https://profiles.wordpress.org/hasthemes/",
            "avatar": "https://secure.gravatar.com/avatar/22ee3e159ea3ed29d8be77abc7b039a0?s=96&d=monsterid&r=g",
            "display_name": "HasThemes"
        },
        "tarekht": {
            "profile": "https://profiles.wordpress.org/tarekht/",
            "avatar": "https://secure.gravatar.com/avatar/781d3e5bf0e40ed19369ba7c50b173c0?s=96&d=monsterid&r=g",
            "display_name": "Tarek Aziz"
        },
        "aslamhasib": {
            "profile": "https://profiles.wordpress.org/aslamhasib/",
            "avatar": "https://secure.gravatar.com/avatar/1edee2d43268eb35c68a09a01f77c90f?s=96&d=monsterid&r=g",
            "display_name": "Aslam Hasib"
        },
        "alberuni-azad": {
            "profile": "https://profiles.wordpress.org/alberuni-azad/",
            "avatar": "https://secure.gravatar.com/avatar/983041284e9b988f3cdabace6dce1f5f?s=96&d=monsterid&r=g",
            "display_name": "Alberuni Azad."
        },
        "zenaulislam": {
            "profile": "https://profiles.wordpress.org/zenaulislam/",
            "avatar": "https://secure.gravatar.com/avatar/c69c192ed037f0ecb74348a2bd06bdda?s=96&d=monsterid&r=g",
            "display_name": "Zenaul Islam"
        }
    },
    "requires": "4.0",
    "tested": "6.6.1",
    "requires_php": "5.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 88,
    "ratings": {
        "5": 15,
        "4": 0,
        "3": 0,
        "2": 1,
        "1": 2
    },
    "num_ratings": 18,
    "support_url": "https://wordpress.org/support/plugin/swatchly/",
    "support_threads": 2,
    "support_threads_resolved": 1,
    "active_installs": 6000,
    "downloaded": 90334,
    "last_updated": "2024-09-01 11:38:00",
    "added": "2021-06-10",
    "homepage": "https://plugindemo.hasthemes.com/swatchly/",
    "sections": {
        "description": "<p>Are you getting frustrated with WooCommerce’s current way of presenting the product attributes for your products? Well, This plugin allows you to turn the WooCommerce product variation&#8217;s select options into more user-friendly swatches. Such as color swatch, button swatch &amp; image swatch. That means you no longer need to rely on the default dropdown options when it comes to selecting product variations. With the help of this plugin, the customers will have the opportunity to observe the products they need more visually than the default dropdown options shown in WooCommerce.</p>\n<p>This exceptional WordPress plugin is designed for all store owners that want their customers to find what they’re searching for quickly. Get rid of dropdown type determination and go with one that rocks!</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://hasthemes.com/docs/swatchly/how-to-use-swatchly/\" rel=\"nofollow ugc\">Documentation</a> | <a href=\"https://hasthemes.com/plugins/swatchly-product-variation-swatches-for-woocommerce-products/\" rel=\"nofollow ugc\">Purchase Pro</a> | <a href=\"https://hasthemes.com/contact-us\" rel=\"nofollow ugc\">Support</a> 👈</p>\n<h3>🏆 Main Features:</h3>\n<ol>\n<li>Enable Swatches for Shop / Product List / Product details pages</li>\n<li>3 different Swatch types (label, color, image, radio[pro])</li>\n<li>Supports multi-colored Swatch</li>\n<li>3 different Swatch Shapes Style (Squared, Rounded, Circle)</li>\n<li>Swatches Alignment (Left, Center, Right)</li>\n<li>Auto convert variation dropdowns to label/button type Swatch</li>\n<li>Set Swatch width, height &amp; font size</li>\n<li>Define global settings for single product / product list page separately</li>\n<li>Override Swatch settings for each product individually</li>\n<li>Option to reset individual product swatch settings into default</li>\n<li>Disabled Attribute Type (Cross Sign, Blur with Cross, Blur Only, Hide)</li>\n<li>Enable/Disable tooltip</li>\n<li>2 different tooltip types (text, image)</li>\n<li>Option to change tooltip image size</li>\n<li>Option to change default Ajax variation threshold</li>\n<li>Option to generate URL based on selected variation attributes.</li>\n<li>Swatch Preview Column for Admin</li>\n<li>Enable/Disable Shape inset</li>\n<li>Shape Inset size</li>\n<li>Deselect On Click</li>\n<li>Show selected option name on single product page</li>\n<li>Set image size for image type swatches</li>\n<li>Variation Label Separator</li>\n<li>Responsive for mobile device</li>\n<li>Shortcode support</li>\n<li>Support Quick View</li>\n<li>Ordering support for the swatches</li>\n</ol>\n<h3>🏆Shop Page Features</h3>\n<ol>\n<li>Enable/Disable Swatches for Shop page</li>\n<li>Control Swatches Position (Before Title, After Title, Before Price, After Price, Before Cart, After Cart)</li>\n<li>Swatches can be positioned into a custom hook</li>\n<li>Shortcode support</li>\n<li>Product Thumbnail Selector</li>\n<li>Enable Ajax Add to Cart button for shop page</li>\n<li>Show/Hide Clear Link for shop page</li>\n<li>Show/Hide Swatches label for shop page</li>\n</ol>\n<h3>🏆Premium Features</h3>\n<ol>\n<li>Auto convert variation dropdowns to image Swatch</li>\n<li>Auto convert variation dropdowns to image Swatch for individual product</li>\n<li>Disable showing Out of Stock variation from Swatch items</li>\n<li>Option to select an attribute as a special/featured attribute</li>\n<li>Enable catalog mode, both (global / custom) attribute support</li>\n<li>Ajax Add to Cart feature for Shop page</li>\n<li>Custom Add to Cart Text</li>\n<li>Enable/Disable Swatch Limit for shop page</li>\n<li>Number of Swatch to Show</li>\n<li>Option to add PHP condition to enable/disable swatches for the product listing pages</li>\n</ol>\n<h3>👉 <a href=\"https://hasthemes.com/plugins/swatchly-product-variation-swatches-for-woocommerce-products/\" rel=\"nofollow ugc\">Purchase Swatchly Pro</a></h3>\n<h3>Video Tutorial:</h3>\n<h4>How to Configure Swatches For Variable Products</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ZTpV8JFugbc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>🚀 Key Feature Comes with Swatchly &#8211; Variation Swatches For WooCommerce Plugin 🚀</h3>\n<h3>🏆 Enable Swatches for Shop / Product List / Product details pages</h3>\n<p>The plugin comes with the feature to enable swatches for the shop, product list, and product detail pages. Swatchly &#8211; WooCommerce Variation Swatches is a WooCommerce plugin that allows you to add color, image, and label swatches to your WooCommerce variations. With this plugin, you can enable swatches for the shop, product list, and product detail pages. This plugin is easy to use and is fully compatible with WooCommerce. WooCommerce Variation Swatches is the perfect plugin for WooCommerce stores that sell products with multiple variations.</p>\n<p>👉 <a href=\"https://hasthemes.com/wp/swatchly/preview/\" rel=\"nofollow ugc\">Shop Demo</a> | <a href=\"https://hasthemes.com/wp/swatchly/preview/\" rel=\"nofollow ugc\">Product List</a> | <a href=\"https://hasthemes.com/wp/swatchly/preview/\" rel=\"nofollow ugc\">Product Details</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Auto convert variation dropdowns to label/button type Swatch</h3>\n<p>The plugin has an auto-convert feature that will help you automatically convert the WooCommerce product variation’s dropdowns to label/button type swatches. This WooCommerce Variation Swatches plugin is a great way to automatically convert your product variation select dropdowns to button swatches. Once installed, the plugin will do the work for you, making it easy to keep your product variations consistent and easy to navigate. In addition, the plugin offers a variety of customization options, so you can make sure the button swatches match your product and brand. Whether you&#8217;re looking for a simple way to improve the look of your product variations or want more control over how they&#8217;re displayed, WooCommerce Variation Swatches is a great option.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Allow color swatches for Variable product attribute variations.</h3>\n<p>Swatchly WooCommerce Variation Swatches is the best plugin that can help you add color swatches to your WooCommerce product attributes. This will enable you to show colors for each attribute value. For example, if you have a product with different color variations, you can use WooCommerce Variation Swatches to display the colors in a user-friendly way. Color swatches are much easier to select than the traditional dropdown menu, and they can also help to visually differentiate your products. If you want to add more life to your WooCommerce store, enabling color swatches for variable product attributes is a great way to do it.</p>\n<p>👉 <a href=\"https://hasthemes.com/wp/swatchly/preview/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Enable Image Swatches For Variable Product Attribute Variations</h3>\n<p>WooCommerce is a great platform for selling online, but one of its drawbacks is that displaying variations of a product can be difficult and unappealing. The WooCommerce Variation Swatches plugin helps to solve this problem by allowing you to display image swatches for variable product attributes. This makes it easy for customers to see what each variation looks like, and it can help to increase sales. In addition, the plugin is easy to use and customize, so you can make it match the look and feel of your site. Whether you&#8217;re selling products with many variations or just a few, the WooCommerce Variation Swatches plugin is a great way to display them.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/product/short-sleeve-classic-plaid-shirt/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 3 different Swatch types (label, color, image)</h3>\n<p>This WooCommerce variation swatches plugin offers 3 different types of swatches. They are label swatches, color swatches, and image swatches. Swatchly WooCommerce Variation Swatches plugin offers 3 different types of swatches. They are label swatches, color swatches, and image swatches. Label swatches are Text-based labels that can be used for products with multiple variations, such as size or color. Color swatches display a color chip for each variation, making it easy for customers to see what colors are available. Image swatches display thumbnail images of each variation, allowing customers to see a preview of what they&#8217;re buying. WooCommerce Variation Swatches make it easy to find the perfect type of swatch for your product. With so many options available, you&#8217;re sure to find the perfect way to showcase your products.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/product/mens-35mm-classic-jean-belt/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Supports multi-colored Swatch</h3>\n<p>The plugin supports multi-colored swatches. That means you will be able to create a swatch with multiple colors. Swatchly &#8211; WooCommerce Variation Swatches is a great plugin for creating different swatches for products. With this plugin, you can create swatches with multiple colors. This is a great feature for WooCommerce sites that want to offer products in different colors. The plugin is easy to use and color swatches can be created in minutes. WooCommerce Variation Swatches is a must-have plugin for any WooCommerce site that wants to offer products with different colors.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/product/rb3025-classic-aviator-sunglasses/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 3 different Swatch Shapes Style (Squared, Rounded, Circle)</h3>\n<p>The plugin comes with 3 different swatch shape styles. They are squared, rounded, and circular. WooCommerce Variation Swatches is a plugin that comes with three different swatch shape styles. They are squared, rounded, and circular. Depending on the look you are going for on your WooCommerce site, you can choose which style of swatch will work best. If you want a more modern look, the squared or rounded swatches may be better. If you want a more classic look, the circular swatches may be better. No matter what look you are going for, WooCommerce Variation Swatches has you covered.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/product/short-sleeve-classic-plaid-shirt/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Swatches Alignment (Left, Center, Right)</h3>\n<p>This feature allows you to align the swatches to the left, center, or right. The WooCommerce Variation Swatches plugin allows you to quickly and easily change the alignment of your swatches. With just a few clicks, you can align the swatches to the left, center, or right. This simple but powerful plugin is a great way to improve the appearance of your WooCommerce store. In addition to aligning swatches, the WooCommerce Variation Swatches plugin also allows you to change the color and size of swatches. With this plugin, you have complete control over the appearance of your WooCommerce store. Whether you want to make a minor adjustment or completely change the look of your store, the WooCommerce Variation Swatches plugin is a great choice.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/product/under-armour-t-shirt/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Set Swatch width, height &amp; font size</h3>\n<p>You will be able to set the width, height, and font size of the swatches from the backend.</p>\n<h3>🏆 Define global settings for a single product/product list page separately</h3>\n<p>The plugin comes with the feature to define global settings for the single product or product list pages separately. WooCommerce Variation Swatches is a plugin that allows you to define global settings for the single product or product list pages separately. The plugin comes with an extensive WooCommerce customization panel which allows you to manage products, variations, attributes, and categories. WooCommerce Variation Swatches also allow you to assign color, image, or label swatches to your products. As a result, you can provide customers with a better shopping experience by helping them quickly identify the products they are looking for. WooCommerce Variation Swatches is an essential tool for any WooCommerce store owner who wants to provide their customers with a seamless shopping experience.</p>\n<h3>🏆 Override Swatch settings for each product individually</h3>\n<p>The plugin also allows you to override the swatch settings for each product individually. The WooCommerce Variation Swatches plugin gives you the ability to override the swatch settings for each product individually. This means that you can choose which swatches are displayed for each product, and change the order in which they are displayed. You can also choose to display swatches on the product page or not. This flexibility allows you to customize the look of your store to match your products.</p>\n<h3>🏆 Option to reset individual product swatch settings into default</h3>\n<p>The plugin comes with an option to reset the individual product’s swatch settings into the default. WooCommerce Variation Swatches plugin is the best option to WooCommerce store owners who want more flexibility and visibility for their customers while choosing the products. The WooCommerce Variation Swatches plugin comes with an option to reset the individual product’s swatch settings into the default. This will be really useful when there are too many products having different customizations. The WooCommerce Variation Swatches plugin will help you manage your products easily and efficiently. You can use this plugin to create beautiful product variations, color swatches, image swatches, and label swatches. The WooCommerce Variation Swatches plugin is flexible and easy to use, which makes it the perfect solution for WooCommerce store owners who want to improve their store’s usability and customer experience.</p>\n<h3>🏆 Disabled Attribute Type (Cross Sign, Blur with Cross, Blur Only, Hide)</h3>\n<p>The plugin allows you to show disabled attribute types.</p>\n<h3>🏆 Enable/Disable tooltip</h3>\n<p>The plugin comes with an option to enable or disable the tooltip.</p>\n<h3>🏆 Tooltip Type (Info, Text, Image)</h3>\n<p>There are 3 types of tooltips available. They are Info, Text, and Image.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Tooltip Position (Top Right, Top Center, Top Left, Bottom Right, Bottom Center, Bottom Left)</h3>\n<p>The plugin offers 6 different tooltip positions. They are top right, top center, top left, bottom right, bottom center, and bottom left. You can find this option under Swatchly <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Settings.</p>\n<h3>🏆 Allow customers to purchase variable products without selecting any attributes</h3>\n<p>The plugin comes with an option to allow customers to purchase variable products without selecting any attributes. ==</p>\n<h3>🏆 Option to show/hide selected attribute label on the frontend</h3>\n<p>The plugin has an option to show or hide the selected attribute label on the front end. ==</p>\n<h3>🏆 Variation URL</h3>\n<p>Generate a URL dynamically based on the attributes selected for variations.</p>\n<h3>🏆 Import/Export</h3>\n<p>It comes with an import/export feature for the plugin&#8217;s global settings.</p>\n<h3>🏆 Design options for Swatch</h3>\n<ol>\n<li>Swatch Text Color</li>\n<li>Swatch Text Font Size</li>\n<li>Swatch Text Line Height</li>\n<li>Swatch Background Color</li>\n<li>Swatch Border Size</li>\n<li>Swatch Border Color</li>\n<li>Swatch Border Type</li>\n<li>Swatch Item Margin</li>\n<li>Swatch Item Padding</li>\n<li>Swatches Wrapper Margin</li>\n<li>Swatches Wrapper Padding</li>\n</ol>\n<h3>🏆 Design options for Tooltip</h3>\n<ol>\n<li>Tooltip Width</li>\n<li>Tooltip Maximum Width</li>\n<li>Tooltip Background Color</li>\n<li>Tooltip Border Size</li>\n<li>Tooltip Border Color</li>\n<li>Tooltip Border Type</li>\n<li>Tooltip Spacing</li>\n<li>Tooltip Text Color</li>\n<li>Tooltip Text Font Size</li>\n<li>Tooltip Text Line Height</li>\n<li>Tooltip Text Padding</li>\n<li>Tooltip Arrow Color</li>\n<li>Tooltip Arrow Size</li>\n<li>Tooltip Arrow Spacing</li>\n<li>Tooltip Image Border Size</li>\n<li>Tooltip Image Border Color</li>\n</ol>\n<h3>Need Help?</h3>\n<p>Is there any feature that you want to get in this plugin?<br />\nNeeds assistance to use this plugin?<br />\nFeel free to <a href=\"https://hasthemes.com/contact-us/\" rel=\"nofollow ugc\">Contact us</a></p>\n",
        "installation": "<p>This section describes how to install the &#8220;Swatchly&#8221; plugin and get it working.</p>\n<h4>1) Install</h4>\n<p>i. Go to the WordPress Dashboard &#8220;Add New Plugin&#8221; section.</p>\n<p>ii. Search For &#8220;Swatchly&#8221;.</p>\n<p>iii. Install, then Activate it.</p>\n<h4>OR:</h4>\n<p>i. Unzip (if it is zipped) and Upload <code>swatchly</code> folder to the <code>/wp-content/plugins/</code> directory</p>\n<p>ii. Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</p>\n<h4>2) Configure</h4>\n<p>i. After install and activate the plugin you will get a notice to install WooCommerce Plugin ( If already have it then do not show any notice. ).</p>\n<p>ii. A new menu called &#8220;Swatchly&#8221; will be appear in your dashboard below the &#8220;Products&#8221; menu</p>\n<p>iv. Use the options &amp; configure as your need and that&#8217;s all!</p>\n",
        "changelog": "<h4>Version: 1.3.3 -Date: 01 September 2024</h4>\n<ul>\n<li>Improved: Coding standards in some areas.</li>\n<li>Compatibility with WooCommerce latest version.</li>\n</ul>\n<h4>Version: 1.3.2 -Date: 03 August 2024</h4>\n<ul>\n<li>Updated: 3rd party libraries for latest PHP version compatibility.</li>\n</ul>\n<h4>Version: 1.3.1 -Date: 11 July 2024</h4>\n<ul>\n<li>Fixed: Encoding issue in product variation dropdown.</li>\n</ul>\n<h4>Version: 1.3.0 -Date: 10 July 2024</h4>\n<ul>\n<li>Fixed: Issue duplicate form field id in the same form.</li>\n</ul>\n<h4>Version: 1.2.9 -Date: 24 June 2024</h4>\n<ul>\n<li>Fixed: Escaping issues have been resolved in multiple areas.</li>\n<li>Updated: Language translation .pot file</li>\n</ul>\n<h4>Version: 1.2.8 -Date: 13 May 2024</h4>\n<ul>\n<li>Fixed: Escaping issues have been resolved in multiple areas.</li>\n</ul>\n<h4>Version: 1.2.7 -Date: 18 Apr 2024</h4>\n<ul>\n<li>Tweak: Loading banner in the post/page editor has been removed</li>\n</ul>\n<h4>Version: 1.2.6 -Date: 17 Apr 2024</h4>\n<ul>\n<li>Added: Compatibility for ShopLentor universal product slider</li>\n<li>Added: Option to generate URL based on selected variation attributes for product details page.</li>\n<li>Improved: Removed dependency on JS for Diagnostic data notice dismiss issue</li>\n<li>Fixed: Product image doesn&#8217;t change issue in product loop while use single product add to cart function</li>\n</ul>\n<h4>Version: 1.2.5 -Date: 19 Feb 2024</h4>\n<ul>\n<li>Added: Option to generate URL based on selected variation attributes.</li>\n<li>Updated: Language translation .pot file</li>\n</ul>\n<h4>Version: 1.2.4 -Date: 18 Dec 2023</h4>\n<ul>\n<li>Updated: Language translation .pot file</li>\n<li>Tweak: Opt-in message to provide non-sensitive diagnostic data and usage information to improve the plugin</li>\n</ul>\n<h4>Version: 1.2.3 -Date: 14 Nov 2023</h4>\n<ul>\n<li>Fixed: Console error issue with the Barn2 plugin</li>\n</ul>\n<h4>Version: 1.2.2 -Date: 13 Sep 2023</h4>\n<ul>\n<li>Added: Compatibility with Barn2 Product Filters Plugin.</li>\n</ul>\n<h4>Version: 1.2.1 -Date: 10 Apr 2023</h4>\n<ul>\n<li>Added: Security nonce verification for recommended plugins</li>\n</ul>\n<h4>Version: 1.2.0 -Date: 04 Apr 2023</h4>\n<ul>\n<li>Added: 2 new action hooks</li>\n<li>Added: YITH infinite scroll support</li>\n</ul>\n<h4>Version: 1.1.9 -Date: 19 Jan 2023</h4>\n<ul>\n<li>Fixed: Swatches doesn&#8217;t show in elementor preview mode</li>\n</ul>\n<h4>Version: 1.1.8 -Date: 06 Oct 2022</h4>\n<ul>\n<li>Fixed: Product loop gallery navigation doesn&#8217;t change after variation update</li>\n<li>Updated: Readme file</li>\n</ul>\n<h4>Version: 1.1.7 -Date: 11 Aug 2022</h4>\n<ul>\n<li>Tweak: Compatibility for Elementor&#8217;s related products</li>\n<li>Fixed: Related product&#8217;s Alignment issue</li>\n</ul>\n<h4>Version: 1.1.6 -Date: 17 Jul 2022</h4>\n<ul>\n<li>Tweak: Added product type condition to avoid generating error</li>\n<li>Fixed: get_current_screen Undefined function issue</li>\n<li>Fixed: Tooltip override issue</li>\n<li>Fixed: Codestar file not found issue</li>\n<li>Added: Full Compatibility with the infinite scroll support</li>\n<li>Added: Compatibility for the WooLentor&#8217;s universal product quick view &amp; position</li>\n<li>Added: Compatibility for the Astra theme</li>\n</ul>\n<h4>Version: 1.1.5 -Date: 29 May 2022</h4>\n<ul>\n<li>Fixed: Show selected variation name issue </li>\n<li>Fixed: Shortcode notice was shown on products loaded via ajax</li>\n<li>Added: Compatibility for the &#8220;Urna&#8221; theme ajax loading issue on shop page</li>\n<li>Added: Compatibility for the &#8220;jet smart filters&#8221; plugin</li>\n<li>Added: Compatibility for the &#8220;Airi&#8221; theme infinite scroll &amp; all major infinite scroll</li>\n</ul>\n<h4>Version: 1.1.4 -Date: 28 Apr 2022</h4>\n<ul>\n<li>Improved: Global Settings</li>\n<li>Updated: Pot file</li>\n</ul>\n<h4>Version: 1.1.3 -Date: 23 Mar 2022</h4>\n<ul>\n<li>Fixed: swatchly_pl_swatches shortcode error while using it outside it&#8217;s scope</li>\n</ul>\n<h4>Version: 1.1.2 -Date: 12 Mar 2022</h4>\n<ul>\n<li>Fixed: Duplicate variation JS file on single product page</li>\n<li>Changed: Demo link</li>\n</ul>\n<h4>Version: 1.1.1 -Date: 26 Feb 2022</h4>\n<ul>\n<li>Added Compatibility: For the &#8220;annasta WooCommerce Product Filters&#8221; plugin</li>\n</ul>\n<h4>Version: 1.1.0 -Date: 14 Feb 2022</h4>\n<ul>\n<li>Fixed: e.indexOf is not a function JS error</li>\n</ul>\n<h4>Version: 1.0.9 -Date: 8 Jan 2022</h4>\n<ul>\n<li>Recommended extensions added in admin</li>\n<li>Hello elementor theme support</li>\n<li>Updated pot file</li>\n</ul>\n<h4>Version: 1.0.7 -Date: 1 Nov 2021</h4>\n<ul>\n<li>Fixed: Tooltip image size override issue</li>\n<li>Fixed: Tooltip options were overridden even if the the swatch type is = select/inherit at product level</li>\n<li>Fixed: Event preventDefault for the product loop</li>\n<li>Improved: Global settings</li>\n</ul>\n<h4>Version: 1.0.6 -Date: 9 Oct 2021</h4>\n<ul>\n<li>Fixed: Attribute slug show instead of the the label</li>\n<li>Fixed: Ordering support for the swatches</li>\n<li>Fixed: Tooltip image size value override</li>\n<li>Added: swatchly_return_default_select filter to return default select programmatically</li>\n<li>Added: swatchly_exclude_variation filter to exclude variation programmatically</li>\n<li>Added: Tooltip image size global option</li>\n<li>Added: Catalog mode help text</li>\n<li>Improved: Undefined array key warning</li>\n<li>Improved: Variable naming into the code</li>\n<li>Improved: Some global options</li>\n</ul>\n<h4>Version: 1.0.5 -Date: 4 Oct 2021</h4>\n<ul>\n<li>Updated: Language file</li>\n<li>Fixed: Version name parameter with enqueue CSS/JS</li>\n</ul>\n<h4>Version: 1.0.4 -Date: 13 Sep 2021</h4>\n<ul>\n<li>Fixed: Single product variation form&#8217;s table tr,td CSS apply for only swatchly tr,td. Conflict fixed for pricing tier plugins.</li>\n<li>Fixed: Swatches does not show for out of stock products in the product loop </li>\n<li>Added: Show &#8220;out of stock&#8221; status when a variation combination chosen from product loop</li>\n<li>Improved: Typo of plugin settings options</li>\n</ul>\n<h4>Version: 1.0.3 -Date: 4 Sep 2021</h4>\n<ul>\n<li>Fixed: Notice conflict with whols plugin</li>\n<li>Added: Support link to the description after intro</li>\n<li>Fixed: Menu position conflict problem</li>\n</ul>\n<h4>Version: 1.0.2 -Date: 1 Aug 2021</h4>\n<ul>\n<li>Fixed: Pro notice width</li>\n<li>Fixed: &#8220;Remove Image&#8221; button of product Meta Box</li>\n</ul>\n<h4>Version: 1.0.1 -Date: 29 Jun 2021</h4>\n<ul>\n<li>Added quick view support</li>\n<li>General settings indicator improved</li>\n<li>Added Ajax variation threshold</li>\n<li>Preview admin column warning fix</li>\n<li>Added &#8220;reset to default swatch settings&#8221; option for product Meta Box</li>\n</ul>\n<h4>Version: 1.0.0</h4>\n<ul>\n<li>Initial Release</li>\n</ul>\n"
    },
    "short_description": "Product Variation Swatches For WooCommerce Products.",
    "description": "<p>Are you getting frustrated with WooCommerce’s current way of presenting the product attributes for your products? Well, This plugin allows you to turn the WooCommerce product variation&#8217;s select options into more user-friendly swatches. Such as color swatch, button swatch &amp; image swatch. That means you no longer need to rely on the default dropdown options when it comes to selecting product variations. With the help of this plugin, the customers will have the opportunity to observe the products they need more visually than the default dropdown options shown in WooCommerce.</p>\n<p>This exceptional WordPress plugin is designed for all store owners that want their customers to find what they’re searching for quickly. Get rid of dropdown type determination and go with one that rocks!</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://hasthemes.com/docs/swatchly/how-to-use-swatchly/\" rel=\"nofollow ugc\">Documentation</a> | <a href=\"https://hasthemes.com/plugins/swatchly-product-variation-swatches-for-woocommerce-products/\" rel=\"nofollow ugc\">Purchase Pro</a> | <a href=\"https://hasthemes.com/contact-us\" rel=\"nofollow ugc\">Support</a> 👈</p>\n<h3>🏆 Main Features:</h3>\n<ol>\n<li>Enable Swatches for Shop / Product List / Product details pages</li>\n<li>3 different Swatch types (label, color, image, radio[pro])</li>\n<li>Supports multi-colored Swatch</li>\n<li>3 different Swatch Shapes Style (Squared, Rounded, Circle)</li>\n<li>Swatches Alignment (Left, Center, Right)</li>\n<li>Auto convert variation dropdowns to label/button type Swatch</li>\n<li>Set Swatch width, height &amp; font size</li>\n<li>Define global settings for single product / product list page separately</li>\n<li>Override Swatch settings for each product individually</li>\n<li>Option to reset individual product swatch settings into default</li>\n<li>Disabled Attribute Type (Cross Sign, Blur with Cross, Blur Only, Hide)</li>\n<li>Enable/Disable tooltip</li>\n<li>2 different tooltip types (text, image)</li>\n<li>Option to change tooltip image size</li>\n<li>Option to change default Ajax variation threshold</li>\n<li>Option to generate URL based on selected variation attributes.</li>\n<li>Swatch Preview Column for Admin</li>\n<li>Enable/Disable Shape inset</li>\n<li>Shape Inset size</li>\n<li>Deselect On Click</li>\n<li>Show selected option name on single product page</li>\n<li>Set image size for image type swatches</li>\n<li>Variation Label Separator</li>\n<li>Responsive for mobile device</li>\n<li>Shortcode support</li>\n<li>Support Quick View</li>\n<li>Ordering support for the swatches</li>\n</ol>\n<h3>🏆Shop Page Features</h3>\n<ol>\n<li>Enable/Disable Swatches for Shop page</li>\n<li>Control Swatches Position (Before Title, After Title, Before Price, After Price, Before Cart, After Cart)</li>\n<li>Swatches can be positioned into a custom hook</li>\n<li>Shortcode support</li>\n<li>Product Thumbnail Selector</li>\n<li>Enable Ajax Add to Cart button for shop page</li>\n<li>Show/Hide Clear Link for shop page</li>\n<li>Show/Hide Swatches label for shop page</li>\n</ol>\n<h3>🏆Premium Features</h3>\n<ol>\n<li>Auto convert variation dropdowns to image Swatch</li>\n<li>Auto convert variation dropdowns to image Swatch for individual product</li>\n<li>Disable showing Out of Stock variation from Swatch items</li>\n<li>Option to select an attribute as a special/featured attribute</li>\n<li>Enable catalog mode, both (global / custom) attribute support</li>\n<li>Ajax Add to Cart feature for Shop page</li>\n<li>Custom Add to Cart Text</li>\n<li>Enable/Disable Swatch Limit for shop page</li>\n<li>Number of Swatch to Show</li>\n<li>Option to add PHP condition to enable/disable swatches for the product listing pages</li>\n</ol>\n<h3>👉 <a href=\"https://hasthemes.com/plugins/swatchly-product-variation-swatches-for-woocommerce-products/\" rel=\"nofollow ugc\">Purchase Swatchly Pro</a></h3>\n<h3>Video Tutorial:</h3>\n<h4>How to Configure Swatches For Variable Products</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ZTpV8JFugbc?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>🚀 Key Feature Comes with Swatchly &#8211; Variation Swatches For WooCommerce Plugin 🚀</h3>\n<h3>🏆 Enable Swatches for Shop / Product List / Product details pages</h3>\n<p>The plugin comes with the feature to enable swatches for the shop, product list, and product detail pages. Swatchly &#8211; WooCommerce Variation Swatches is a WooCommerce plugin that allows you to add color, image, and label swatches to your WooCommerce variations. With this plugin, you can enable swatches for the shop, product list, and product detail pages. This plugin is easy to use and is fully compatible with WooCommerce. WooCommerce Variation Swatches is the perfect plugin for WooCommerce stores that sell products with multiple variations.</p>\n<p>👉 <a href=\"https://hasthemes.com/wp/swatchly/preview/\" rel=\"nofollow ugc\">Shop Demo</a> | <a href=\"https://hasthemes.com/wp/swatchly/preview/\" rel=\"nofollow ugc\">Product List</a> | <a href=\"https://hasthemes.com/wp/swatchly/preview/\" rel=\"nofollow ugc\">Product Details</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Auto convert variation dropdowns to label/button type Swatch</h3>\n<p>The plugin has an auto-convert feature that will help you automatically convert the WooCommerce product variation’s dropdowns to label/button type swatches. This WooCommerce Variation Swatches plugin is a great way to automatically convert your product variation select dropdowns to button swatches. Once installed, the plugin will do the work for you, making it easy to keep your product variations consistent and easy to navigate. In addition, the plugin offers a variety of customization options, so you can make sure the button swatches match your product and brand. Whether you&#8217;re looking for a simple way to improve the look of your product variations or want more control over how they&#8217;re displayed, WooCommerce Variation Swatches is a great option.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Allow color swatches for Variable product attribute variations.</h3>\n<p>Swatchly WooCommerce Variation Swatches is the best plugin that can help you add color swatches to your WooCommerce product attributes. This will enable you to show colors for each attribute value. For example, if you have a product with different color variations, you can use WooCommerce Variation Swatches to display the colors in a user-friendly way. Color swatches are much easier to select than the traditional dropdown menu, and they can also help to visually differentiate your products. If you want to add more life to your WooCommerce store, enabling color swatches for variable product attributes is a great way to do it.</p>\n<p>👉 <a href=\"https://hasthemes.com/wp/swatchly/preview/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Enable Image Swatches For Variable Product Attribute Variations</h3>\n<p>WooCommerce is a great platform for selling online, but one of its drawbacks is that displaying variations of a product can be difficult and unappealing. The WooCommerce Variation Swatches plugin helps to solve this problem by allowing you to display image swatches for variable product attributes. This makes it easy for customers to see what each variation looks like, and it can help to increase sales. In addition, the plugin is easy to use and customize, so you can make it match the look and feel of your site. Whether you&#8217;re selling products with many variations or just a few, the WooCommerce Variation Swatches plugin is a great way to display them.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/product/short-sleeve-classic-plaid-shirt/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 3 different Swatch types (label, color, image)</h3>\n<p>This WooCommerce variation swatches plugin offers 3 different types of swatches. They are label swatches, color swatches, and image swatches. Swatchly WooCommerce Variation Swatches plugin offers 3 different types of swatches. They are label swatches, color swatches, and image swatches. Label swatches are Text-based labels that can be used for products with multiple variations, such as size or color. Color swatches display a color chip for each variation, making it easy for customers to see what colors are available. Image swatches display thumbnail images of each variation, allowing customers to see a preview of what they&#8217;re buying. WooCommerce Variation Swatches make it easy to find the perfect type of swatch for your product. With so many options available, you&#8217;re sure to find the perfect way to showcase your products.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/product/mens-35mm-classic-jean-belt/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Supports multi-colored Swatch</h3>\n<p>The plugin supports multi-colored swatches. That means you will be able to create a swatch with multiple colors. Swatchly &#8211; WooCommerce Variation Swatches is a great plugin for creating different swatches for products. With this plugin, you can create swatches with multiple colors. This is a great feature for WooCommerce sites that want to offer products in different colors. The plugin is easy to use and color swatches can be created in minutes. WooCommerce Variation Swatches is a must-have plugin for any WooCommerce site that wants to offer products with different colors.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/product/rb3025-classic-aviator-sunglasses/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 3 different Swatch Shapes Style (Squared, Rounded, Circle)</h3>\n<p>The plugin comes with 3 different swatch shape styles. They are squared, rounded, and circular. WooCommerce Variation Swatches is a plugin that comes with three different swatch shape styles. They are squared, rounded, and circular. Depending on the look you are going for on your WooCommerce site, you can choose which style of swatch will work best. If you want a more modern look, the squared or rounded swatches may be better. If you want a more classic look, the circular swatches may be better. No matter what look you are going for, WooCommerce Variation Swatches has you covered.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/product/short-sleeve-classic-plaid-shirt/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Swatches Alignment (Left, Center, Right)</h3>\n<p>This feature allows you to align the swatches to the left, center, or right. The WooCommerce Variation Swatches plugin allows you to quickly and easily change the alignment of your swatches. With just a few clicks, you can align the swatches to the left, center, or right. This simple but powerful plugin is a great way to improve the appearance of your WooCommerce store. In addition to aligning swatches, the WooCommerce Variation Swatches plugin also allows you to change the color and size of swatches. With this plugin, you have complete control over the appearance of your WooCommerce store. Whether you want to make a minor adjustment or completely change the look of your store, the WooCommerce Variation Swatches plugin is a great choice.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/product/under-armour-t-shirt/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Set Swatch width, height &amp; font size</h3>\n<p>You will be able to set the width, height, and font size of the swatches from the backend.</p>\n<h3>🏆 Define global settings for a single product/product list page separately</h3>\n<p>The plugin comes with the feature to define global settings for the single product or product list pages separately. WooCommerce Variation Swatches is a plugin that allows you to define global settings for the single product or product list pages separately. The plugin comes with an extensive WooCommerce customization panel which allows you to manage products, variations, attributes, and categories. WooCommerce Variation Swatches also allow you to assign color, image, or label swatches to your products. As a result, you can provide customers with a better shopping experience by helping them quickly identify the products they are looking for. WooCommerce Variation Swatches is an essential tool for any WooCommerce store owner who wants to provide their customers with a seamless shopping experience.</p>\n<h3>🏆 Override Swatch settings for each product individually</h3>\n<p>The plugin also allows you to override the swatch settings for each product individually. The WooCommerce Variation Swatches plugin gives you the ability to override the swatch settings for each product individually. This means that you can choose which swatches are displayed for each product, and change the order in which they are displayed. You can also choose to display swatches on the product page or not. This flexibility allows you to customize the look of your store to match your products.</p>\n<h3>🏆 Option to reset individual product swatch settings into default</h3>\n<p>The plugin comes with an option to reset the individual product’s swatch settings into the default. WooCommerce Variation Swatches plugin is the best option to WooCommerce store owners who want more flexibility and visibility for their customers while choosing the products. The WooCommerce Variation Swatches plugin comes with an option to reset the individual product’s swatch settings into the default. This will be really useful when there are too many products having different customizations. The WooCommerce Variation Swatches plugin will help you manage your products easily and efficiently. You can use this plugin to create beautiful product variations, color swatches, image swatches, and label swatches. The WooCommerce Variation Swatches plugin is flexible and easy to use, which makes it the perfect solution for WooCommerce store owners who want to improve their store’s usability and customer experience.</p>\n<h3>🏆 Disabled Attribute Type (Cross Sign, Blur with Cross, Blur Only, Hide)</h3>\n<p>The plugin allows you to show disabled attribute types.</p>\n<h3>🏆 Enable/Disable tooltip</h3>\n<p>The plugin comes with an option to enable or disable the tooltip.</p>\n<h3>🏆 Tooltip Type (Info, Text, Image)</h3>\n<p>There are 3 types of tooltips available. They are Info, Text, and Image.</p>\n<p>👉 <a href=\"https://theplugindemo.com/swatchly/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/swatchly/documentation/\" rel=\"nofollow ugc\">Documentation</a></p>\n<h3>🏆 Tooltip Position (Top Right, Top Center, Top Left, Bottom Right, Bottom Center, Bottom Left)</h3>\n<p>The plugin offers 6 different tooltip positions. They are top right, top center, top left, bottom right, bottom center, and bottom left. You can find this option under Swatchly <span aria-hidden=\"true\" class=\"wp-exclude-emoji\">→</span> Settings.</p>\n<h3>🏆 Allow customers to purchase variable products without selecting any attributes</h3>\n<p>The plugin comes with an option to allow customers to purchase variable products without selecting any attributes. ==</p>\n<h3>🏆 Option to show/hide selected attribute label on the frontend</h3>\n<p>The plugin has an option to show or hide the selected attribute label on the front end. ==</p>\n<h3>🏆 Variation URL</h3>\n<p>Generate a URL dynamically based on the attributes selected for variations.</p>\n<h3>🏆 Import/Export</h3>\n<p>It comes with an import/export feature for the plugin&#8217;s global settings.</p>\n<h3>🏆 Design options for Swatch</h3>\n<ol>\n<li>Swatch Text Color</li>\n<li>Swatch Text Font Size</li>\n<li>Swatch Text Line Height</li>\n<li>Swatch Background Color</li>\n<li>Swatch Border Size</li>\n<li>Swatch Border Color</li>\n<li>Swatch Border Type</li>\n<li>Swatch Item Margin</li>\n<li>Swatch Item Padding</li>\n<li>Swatches Wrapper Margin</li>\n<li>Swatches Wrapper Padding</li>\n</ol>\n<h3>🏆 Design options for Tooltip</h3>\n<ol>\n<li>Tooltip Width</li>\n<li>Tooltip Maximum Width</li>\n<li>Tooltip Background Color</li>\n<li>Tooltip Border Size</li>\n<li>Tooltip Border Color</li>\n<li>Tooltip Border Type</li>\n<li>Tooltip Spacing</li>\n<li>Tooltip Text Color</li>\n<li>Tooltip Text Font Size</li>\n<li>Tooltip Text Line Height</li>\n<li>Tooltip Text Padding</li>\n<li>Tooltip Arrow Color</li>\n<li>Tooltip Arrow Size</li>\n<li>Tooltip Arrow Spacing</li>\n<li>Tooltip Image Border Size</li>\n<li>Tooltip Image Border Color</li>\n</ol>\n<h3>Need Help?</h3>\n<p>Is there any feature that you want to get in this plugin?<br />\nNeeds assistance to use this plugin?<br />\nFeel free to <a href=\"https://hasthemes.com/contact-us/\" rel=\"nofollow ugc\">Contact us</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/swatchly.1.3.3.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-1.png?rev=2893238",
            "caption": "Quickly Navigate to the Settings page of the plugin"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-2.png?rev=2893238",
            "caption": "General settings global"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-3.png?rev=2893238",
            "caption": "Color, Label &amp; image types swatches are showing on the product details page"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-4.png?rev=2893238",
            "caption": "The swatched are showing for the Shop/Product details page"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-5.png?rev=2893238",
            "caption": "General settings for product details page"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-6.png?rev=2893238",
            "caption": "General settings for shop page"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-7.png?rev=3037737",
            "caption": "Product list.png"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-8.png?rev=2893238",
            "caption": "Design for swatch"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-9.png?rev=2893238",
            "caption": "Design for tooltip"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-10.png?rev=2893238",
            "caption": "Design for tooltip text"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-11.png?rev=2893238",
            "caption": "Design for tooltip arrow"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-12.png?rev=2893238",
            "caption": "Design for tooltip image"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-13.png?rev=2893238",
            "caption": "Other settings"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-14.png?rev=2893238",
            "caption": "Color type attribute options"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-15.png?rev=2893238",
            "caption": "Image type attribute options"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-16.png?rev=2893238",
            "caption": "Product level options 1"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-17.png?rev=2893238",
            "caption": "Color type swatch options product level"
        },
        {
            "src": "https://ps.w.org/swatchly/assets/screenshot-18.png?rev=2893238",
            "caption": "Image type swatch options product level"
        }
    ],
    "tags": {
        "color-swatch": "color swatch",
        "product-attributes": "product attributes",
        "variation-swatches": "variation swatches",
        "woocommerce-attributes": "woocommerce attributes",
        "woocommerce-variation": "woocommerce variation"
    },
    "stable_tag": "1.3.3",
    "versions": {
        "1.0.5": "https://downloads.wordpress.org/plugin/swatchly.1.0.5.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/swatchly.1.0.7.zip",
        "1.0.9": "https://downloads.wordpress.org/plugin/swatchly.1.0.9.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/swatchly.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/swatchly.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/swatchly.1.1.2.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/swatchly.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/swatchly.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/swatchly.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/swatchly.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/swatchly.1.1.8.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/swatchly.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/swatchly.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/swatchly.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/swatchly.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/swatchly.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/swatchly.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/swatchly.1.2.6.zip",
        "1.2.7": "https://downloads.wordpress.org/plugin/swatchly.1.2.7.zip",
        "1.2.8": "https://downloads.wordpress.org/plugin/swatchly.1.2.8.zip",
        "1.2.9": "https://downloads.wordpress.org/plugin/swatchly.1.2.9.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/swatchly.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/swatchly.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/swatchly.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/swatchly.1.3.3.zip",
        "trunk": "https://downloads.wordpress.org/plugin/swatchly.zip"
    },
    "business_model": "commercial",
    "repository_url": "",
    "commercial_support_url": "https://portal.hasthemes.com/contact/",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/swatchly/assets/banner-772x250.jpg?rev=2893238",
        "high": "https://ps.w.org/swatchly/assets/banner-1544x500.jpg?rev=2893238"
    },
    "icons": {
        "1x": "https://ps.w.org/swatchly/assets/icon-128x128.png?rev=2893238",
        "2x": "https://ps.w.org/swatchly/assets/icon-256x256.png?rev=2893238"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 88,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}