{
    "name": "Tagembed: Embed Twitter Feed, Google Reviews, YouTube Videos, TikTok, RSS Feed &amp; More Social Media Feeds",
    "slug": "tagembed-widget",
    "version": "6.0",
    "author": "<a href=\"https://tagembed.com/\">Tagembed</a>",
    "author_profile": "https://profiles.wordpress.org/tagembed/",
    "contributors": {
        "tagembed": {
            "profile": "https://profiles.wordpress.org/tagembed/",
            "avatar": "https://secure.gravatar.com/avatar/08747b26698b3afe1c3174b9c3058e7a?s=96&d=monsterid&r=g",
            "display_name": "Tagembed"
        }
    },
    "requires": "3.0",
    "tested": "6.5.5",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 80,
    "ratings": {
        "5": 36,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 12
    },
    "num_ratings": 48,
    "support_url": "https://wordpress.org/support/plugin/tagembed-widget/",
    "support_threads": 4,
    "support_threads_resolved": 0,
    "active_installs": 8000,
    "downloaded": 126099,
    "last_updated": "2024-07-25 1:21pm GMT",
    "added": "2020-12-01",
    "homepage": "https://tagembed.com/",
    "sections": {
        "description": "<h4>Collect. Curate. Embed.</h4>\n<p>Tagembed &#8211; The best social media &amp; review plugin to collect reviews (like <strong>Google reviews</strong>), stories, social media feeds (like <strong>Instagram Feed</strong>), photos, &amp; embed them on any website. Automatically!</p>\n<h4>Top Social Media Feed Network:</h4>\n<ul>\n<li>Instagram Feed (Hashtag, Mention, handle, stories, reels)</li>\n<li>Facebook Feed (Page, Handle, Album, Review, Page Mention)</li>\n<li>TikTok Feed (Handle, Hashtag)</li>\n<li>YouTube Feed (Shorts, playlist channels)</li>\n<li>Twitter Feed (Hashtag, handle, mention)</li>\n<li>Linkedin feed (Company Page URL, Profile URL, Post URL)</li>\n</ul>\n<h4>Top Review Feed Network:</h4>\n<ul>\n<li>Google reviews</li>\n<li>Facebook review feed</li>\n<li>Airbnb</li>\n<li>Yelp</li>\n</ul>\n<p>Showcasing social media feed &amp; reviews on your site is a simple yet powerful strategy to boost customer confidence, ultimately leading to increased sales!</p>\n<h3>4 Simple Step Process to Use Tagembed Social Media Plugin</h3>\n<ul>\n<li><strong>Collect:</strong> Select your favorite source (like Instagram feed, Facebook Feed, Google reviews etc)</li>\n<li><strong>Customize:</strong> Select the theme &amp; layout as per your brand appearance</li>\n<li><strong>Moderate:</strong> Choose the post you want to embed.</li>\n<li><strong>Publish:</strong> Copy the short code <strong>[tagembed widgetid XXXXX]</strong> and paste on your WordPress editor.</li>\n</ul>\n<h4>Powerful Plugin to Embed social media feed like pro</h4>\n<p>Create and customize your Instagram feed plugin and showcase stunning Instagram widget on your website. Check the video tutorial:<br />\nhttps://www.youtube.com/watch?v=svEiOzrvMQg</p>\n<h3>Why Tagembed is the Best Plugin to embed social Media Content</h3>\n<ul>\n<li>**Once installed, you can embed the widget in 3 mins on your website.</li>\n<li>**Quick to set up as possible, with just a few clicks.</li>\n<li><strong>Multiple Sources</strong>: Embed (like Instagram feed, Facebook feed, Google reviews etc) into a single widget.</li>\n<li><strong>Real time update</strong>: Display post instantly as they come on your social account.</li>\n<li><strong>SEO friendly</strong>: Our widgets ensure optimal speed and performance by caching social media and loading it only when needed, keeping your page lightning-fast.</li>\n<li><strong>Boost your Google Rating by collecting fresh Google Reviews using a **&#8221;Review Us on Google&#8221;</strong> button.</li>\n<li><strong>Unlimited Widgets</strong> – Showcase your reviews from various sources in one place. Combine your Google reviews, Facebook reviews, &amp; other business reviews into a single widget.</li>\n<li><strong>Embed Anywhere</strong>: We support Elementor, Gutenberg block, WordPress widget etc.</li>\n</ul>\n<h3>EASY DESIGN TOOLS</h3>\n<ul>\n<li><strong>Quickly customize your website to make it stand out — **no coding needed</strong>.</li>\n<li><strong>Pre-built templates</strong> to embed Google reviews, Instagram reels, or Instagram feed widgets etc. To get started easily.</li>\n<li><strong>Inherit Theme</strong>: Automatically fetch the color  font of your website.</li>\n<li><strong>Gallery &amp; Slideshow layouts</strong> Image galleries, carousel slider, &amp; slideshows for WP sites.</li>\n<li><strong>Zero Code</strong>: We provide short code to embed the widget. No need for technical knowledge.</li>\n<li><strong>CTA</strong>: Add different CTA buttons to posts to increase sales.</li>\n<li><strong>Customization</strong>: Edit title, size, &amp; color; adjust image size and padding etc.</li>\n<li><strong>Banner</strong>: Add ready to use or add your own banner on your widget to collect reviews &amp; grow community.</li>\n<li><strong>Custom CSS</strong> to add elements of your choices.</li>\n<li><strong>Custom Post</strong> to add photo, video &amp; text of your choice.</li>\n</ul>\n<h3>Featured Reviews</h3>\n<p>★★★★★ “Tagembed has the features we needed that other competitors did not provide. Mainly the LinkedIn feeds which are something that was needed. The support on this plugin/app has been great!”<br />\n★★★★★ “Tagembed has been a game-changer in this aspect, particularly with its Twitter feed embedding capabilities. Ease of Use:Right from the start, impresses with its user-friendly interface.”<br />\n★★★★★ I can confidently say that it is the perfect Facebook &amp; Instagram tool for displaying instagram feed &amp; Facebook feed on my website.</p>\n<h3>Pricing:</h3>\n<p>We give 14-days free trial. So that the user can explore every feature before buying.</p>\n<p>Lite Plan: <strong>Forever Free</strong> includes</p>\n<ul>\n<li>1 Feed (like Instagram Feed, Facebook feed)</li>\n<li>500 Views/Month</li>\n<li>48 Hours Update Time</li>\n<li>Tagembed Branding</li>\n</ul>\n<p><strong>Premium Version</strong><br />\n* More Feed with multiple sources.<br />\n* No branding<br />\n* Instant update time<br />\n* Unlimited views on your widget<br />\n<strong>Note:</strong> One feed equals to one source E.g. Hashtag, Handle etc. counts as one feed.</p>\n<h3>Why should you embed social media feed on websites?</h3>\n<ul>\n<li><strong>Increased Engagement:</strong> Embedding social media feeds encourages interaction &amp; boosts engagement with your audience.</li>\n<li><strong>Fresh Content:</strong> It keeps website updated with the latest posts &amp; content from your social media profiles.</li>\n<li><strong>Social Proof:</strong> Displaying on your site provides social proof &amp; builds credibility.</li>\n<li><strong>Brand Visibility:</strong> Expanding your social media presence to your website increases brand visibility.</li>\n<li><strong>Enhanced User Experience:</strong> Visitors can easily access your social media content without leaving your website, improving their experience.</li>\n<li><strong>Cross-Promotion:</strong> It allows you to cross-promote social media channels and website, driving traffic between them.</li>\n<li><strong>Diverse Content:</strong> Incorporating different types of content from various social media platforms adds diversity to your website.</li>\n<li><strong>Community Building:</strong> Increase followers by showcasing UGC &amp; interactions.</li>\n<li><strong>SEO Benefits:</strong> Fresh &amp; relevant content from social media can positively impact website&#8217;s SEO.</li>\n<li><strong>Real-Time Updates:</strong> Keep your audience informed with real-time updates from social media channels.</li>\n</ul>\n<h3>Social Media Feeds:</h3>\n<ul>\n<li><strong>Instagram Feed:</strong> Showcase Instagram photos from hashtags, handles, mentions, stories, reels, &amp; more on your WordPress website.</li>\n<li><strong>Facebook Feed:</strong> Add Custom Facebook Feed directly on your website from Facebook page.</li>\n<li><strong>TikTok Feed:</strong> Display interactive &amp; responsive TikTok feeds widget on your website for free</li>\n<li><strong>YouTube Feed:</strong> Showcase YouTube channel feeds, including Shorts, Playlists, &amp; Videos, to encourage visitors to spend more time on your site and boost engagement.</li>\n<li><strong>Twitter Feed:</strong> Embed tweets from a hashtag or account in your Twitter widget &amp; display them on your website.</li>\n<li><strong>LinkedIn feed:</strong> Automatically embed linkedin widget (company’s posts, images, &amp; videos).</li>\n<li><strong>RSS Widget:</strong> Embed RSS feed using rss aggregator  to showcase the most striking and relevant news.</li>\n<li><strong>Slack feed:</strong> Enhance internal communication by embedding a creative Slack widget display on your website.</li>\n<li><strong>Pinterest feed:</strong> Boost engagement and amplify sales by embedding posts from multiple Pinterest boards on your website.</li>\n<li><strong>Vimeo Widget:</strong> Showcase your video collection on your website with Tagembed’s Vimeo Widget.</li>\n<li><strong>Flickr Widget:</strong> Increase followers, drive conversions, and boost engagement by embedding a Flickr gallery widget on your website.</li>\n</ul>\n<h3>How to Embed Instagram feed on WordPress?</h3>\n<ul>\n<li>Click on &#8220;Add Feed&#8221; &amp; select &#8220;Instagram&#8221; or &#8220;Instagram Business&#8221; to collect Instagram feeds.</li>\n<li>Choose your Instagram feed filter connection type, such as Instagram handle, hashtag, mention, profile, stories, Reels, IGTV, etc., to fetch Instagram feeds according to your preference.</li>\n<li>Select a pre-built theme (like photos, gallery). Personalize the Instagram feed style &amp; filter settings</li>\n<li>Click on the Display tab Section to preview the Instagram Feed &amp; Copy ShortCode to <a href=\"https://tagembed.com/blog/embed-instagram-feed-on-wordpress/\" rel=\"nofollow ugc\">Embed Instagram Feed on WordPress</a>.</li>\n<li>Paste the shortcode on your desired page or post &amp; update it to <a href=\"https://tagembed.com/blog/embed-instagram-feed-on-website-for-free/\" rel=\"nofollow ugc\">embed Instagram feed</a> Widget successfully.</li>\n</ul>\n<h3>How to Embed Instagram hashtag feed?</h3>\n<ul>\n<li>Click on Add Feed &amp; select network as Instagram Business to collect Instagram Hashtag Feed.</li>\n<li>Select your Instagram Feed &amp; choose Hastag as a source type to collect Instagram Hashtag as per your preference.</li>\n<li>Choose Theme (Recommended – Story Theme), Then personalize Instagram feed style using card style settings &amp; filter Instagram feed to display only relevant &amp; genuine Instagram Feed on WordPress website.</li>\n<li>Click on the Display tab Section to preview the Instagram Feed or Instagram Hashtag Feed &amp; then Copy ShortCode to <a href=\"https://tagembed.com/blog/embed-instagram-hashtag-feed-on-website/\" rel=\"nofollow ugc\">Embed Instagram Hashtag Feed</a> on WordPress.</li>\n<li>Paste the shortcode on your desired page or post &amp; update it to embed Instagram Hashtag Widget successfully.</li>\n</ul>\n<h3>How to Embed Instagram Reel</h3>\n<ul>\n<li>In &#8220;Add Feed&#8221; and select &#8220;Instagram&#8221; and choose “Reel” as a source.</li>\n<li>Now Choose Theme (like Story Theme) and customize and moderate your Instagram feed.</li>\n<li>Click on the Display tab and preview the Instagram Reel widget &amp; Copy code to <a href=\"https://tagembed.com/blog/embed-instagram-reels-on-website/\" rel=\"nofollow ugc\">Embed Instagram Reels</a> on WordPress.</li>\n<li>Paste the shortcode on your desired page or post &amp; update it to embed Instagram Reels Widget successfully.</li>\n</ul>\n<h3>How to embed Facebook feed on website?</h3>\n<ul>\n<li>Go to Add Feed &amp; select network as Facebook to collect Facebook feeds.</li>\n<li>Select your Facebook feed filter connection type from: Facebook Page, Facebook Page Reviews, Facebook Album etc to fetch Facebook feeds as per your preference.</li>\n<li>Now Choose Theme (like Story Theme) and customize and moderate your Facebook Feed.</li>\n<li>Click on the Display tab Section to preview the Facebook Feed &amp; Copy Shortcode to <a href=\"https://tagembed.com/blog/embed-facebook-feed-on-wordpress-website/\" rel=\"nofollow ugc\">Embed Facebook Feed on WordPress</a>.</li>\n<li>Paste the shortcode on your desired page or post &amp; update it to embed Facebook Feed Widget successfully.</li>\n</ul>\n<h3>How to embed TikTok feed on your website?</h3>\n<ul>\n<li>Choose TikTok as a source</li>\n<li>Now enter TikTok feed type &amp; click on “Create Feed” button</li>\n<li>All the posts will be fetched &amp; displayed in the moderation section.</li>\n<li>Choose the theme like photo gallery, video slider or photo slider</li>\n<li>Now choose the post you want to display on your TikTok feed.</li>\n<li>Click on Display &amp; copy the short code</li>\n<li>Paste it on the backend of the website where you want to display the TikTok widget.</li>\n</ul>\n<h3>How to embed a youtube feed on your website?</h3>\n<ul>\n<li>Select network as YouTube to collect YouTube Videos.</li>\n<li>Select your YouTube feed filter connection type from: YouTube Channel, YouTube Playlist, YouTube Shorts etc. to fetch YouTube Videos as per your preference.</li>\n<li>Choose a theme, personalize the YouTube Gallery Widget style, and filter YouTube videos to display on your  website.</li>\n<li>Click on the Display tab Section to preview the YouTube Gallery &amp; Copy ShortCode to Embed YouTube Video Gallery on WordPress.</li>\n<li>Paste the code on your desired page or post &amp; update it to <a href=\"https://tagembed.com/blog/embed-youtube-videos-on-website/\" rel=\"nofollow ugc\">embed YouTube Video Gallery</a> successfully.</li>\n</ul>\n<h3>How to add a twitter feed on a website?</h3>\n<ul>\n<li>Click on Add Feed &amp; select network as Twitter to collect Twitter feeds.</li>\n<li>Select your Twitter feed filter connection type from: Twitter handle, Twitter hashtag, Twitter List, Twitter Favorites, Twitter Advanced (Query), etc. to fetch Twitter feeds as per your preference.</li>\n<li>Choose Theme from 10+ Layouts, Personalize Twitter feed style &amp; filter Twitter feeds as per your requirement to display only relevant &amp; genuine Twitter Feed on WordPress website.</li>\n<li>Click on the Display tab and preview the Twitter Feed &amp; Copy shortcode to <a href=\"https://tagembed.com/blog/add-twitter-feeds-on-wordpress/\" rel=\"nofollow ugc\">Embed Twitter Feed on WordPress</a>.</li>\n<li>Paste the code on your desired page or post &amp; update it to get it updated on <a href=\"https://tagembed.com/twitter-widget/\" rel=\"nofollow ugc\">Twitter Widget</a> &amp; then embed Twitter Feed Widget successfully.</li>\n</ul>\n<h3>How to feed a LinkedIn feed on your WordPress website?</h3>\n<ul>\n<li>Choose LinkedIn to collect LinkedIn Feeds.</li>\n<li>Select your LinkedIn feed filter connection type from: LinkedIn Company Page URL, LinkedIn Post URL, LinkedIn Profile to fetch LinkedIn Posts as per your preference.</li>\n<li>Select the theme and customize it. Moderate the post you want to display.</li>\n<li>Click on the Display tab &amp; preview the LinkedIn Posts &amp; Copy Shortcode to <a href=\"https://tagembed.com/support/embed-linkedin-feeds-on-wordpress/\" rel=\"nofollow ugc\">Embed LinkedIn Feed on WordPress</a>.</li>\n<li>Paste the code on your desired page or post &amp; update it to embed LinkedIn Feed Widget successfully.</li>\n</ul>\n<p><strong>Note:</strong> Company Page URL, Profile &amp; Hashtag – For LinkedIn Widget users this method is only available with the <strong>Plus Plan</strong>.</p>\n<h3>Review Feeds:</h3>\n<ul>\n<li><strong>Google Reviews:</strong> Easily embed Google reviews into your WordPress site to boost SEO, build trust, &amp; boost sales.</li>\n<li><strong>Facebook Review feed:</strong> Show your reviews &amp; rating from Facebook on your pages and increase sales.</li>\n<li><strong>Airbnb:</strong> Include Airbnb widget on your website to multiple sales &amp; build trust.</li>\n<li><strong>Yelp:</strong> The Yelp Reviews widget allows you to embed your clients&#8217; reviews and build trust.</li>\n<li><strong>Amazon Reviews</strong> <a href=\"https://tagembed.com/blog/embed-amazon-reviews-on-website/\" rel=\"nofollow ugc\">Embed Amazon reviews</a> detailed reviews with the author&#8217;s name, photo, &amp; a link to your Amazon widget.</li>\n<li><strong>Tripadvisor feed:</strong> <a href=\"https://tagembed.com/blog/embed-tripadvisor-reviews-on-website/\" rel=\"nofollow ugc\">Add genuine Tripadvisor reviews</a> that paint a vivid picture of exceptional hospitality, creating an emotional connection that resonates with website visitors.</li>\n<li><strong>Aliexpress Reviews:</strong> Create your AliExpress Reviews widget now! Use our easy configurator to <a href=\"https://tagembed.com/blog/embed-aliexpress-reviews-on-website/\" rel=\"nofollow ugc\">embed AliExpress reviews</a> on your website in just minutes.</li>\n<li><strong>Etsy Reviews:</strong> Prove the genuineness of your brand and build a reputation in the market by exhibiting reviews using Etsy review widget.</li>\n<li><strong>All-in-one-review widget:</strong> Add multiple reviews sites on single review widget (For ex: Add Google review, Facebook feed reviews in one widget)</li>\n</ul>\n<h3>How to embed Google reviews on WordPress website?</h3>\n<ul>\n<li>Click on &#8220;Add Feed&#8221; and select &#8220;Google Review&#8221; to collect user reviews from Google.</li>\n<li>Choose your Google Reviews feed filter connection type, such as &#8220;My Places&#8221; or &#8220;Places,&#8221; to fetch Google Reviews.</li>\n<li>Select a theme like review carousel. Personalize the Google Review Widget&#8217;s style and filter settings to display only relevant Google Reviews.</li>\n<li>Click on the Display tab to preview the Google Reviews. Copy the shortcode provided to <a href=\"https://tagembed.com/blog/embed-google-reviews-on-wordpress/\" rel=\"nofollow ugc\">embed Google Reviews on WordPress</a></li>\n<li>Paste the code into your desired page or post and update it to successfully embed the <a href=\"https://tagembed.com/google-review-widget/\" rel=\"nofollow ugc\">Google Review Widget</a>.</li>\n</ul>\n<p>Note: For free plan users, the Google Review Widget will not automatically update with new reviews.</p>\n<h3>How to embed Facebook reviews feed on websites?</h3>\n<ul>\n<li>Choose Facebook as the platform to collect feeds.</li>\n<li>Select the type of Facebook feed you want to collect, such as Facebook Reviews, Facebook Album, Facebook Mentions, Facebook Profile, Facebook Page, etc.</li>\n<li>Choose a display theme (like slider, grid, etc.) and personalize the style and filter settings to display only relevant Facebook feeds on your WordPress website.</li>\n<li>Click on the Display tab to preview the Facebook feed or Facebook Reviews feed. Copy the shortcode provided to <a href=\"https://tagembed.com/blog/embed-facebook-reviews-on-wordpress/\" rel=\"nofollow ugc\">Embed FB Reviews on WordPress.</a></li>\n<li>Paste the code into your desired page or post and update it to successfully embed the <a href=\"https://tagembed.com/facebook-review-widget/\" rel=\"nofollow ugc\">Facebook Reviews Widget</a></li>\n</ul>\n<h3>We have Multiple themes to choose from:</h3>\n<ul>\n<li>Slider</li>\n<li>Grid</li>\n<li>Classic Carousel</li>\n<li>Horizontal Carousel</li>\n<li>Story</li>\n<li>Vivid</li>\n<li>List View</li>\n<li>Single Post</li>\n<li>Gallery Theme</li>\n<li>Classic Theme</li>\n</ul>\n<h3>Our Support:</h3>\n<p>We&#8217;re known for quick, helpful support. With 24/5 customer service, we promptly resolve any issues to meet customer expectations.<br />\nCheck topics or ask a new question here: <a href=\"https://wordpress.org/support/plugin/tagembed-widget/\" rel=\"ugc\">Support Forum</a><br />\nIf you still can’t find the answer, feel free to email us <strong>support@tagemebd.com</strong><br />\n&#8220;★★★★★ As mentioned, Fantastic support. They took the time &amp; went the extra mile to assist me &amp; set me in the right direction on the implementation of the plugin.<br />\nTagembed is a best alternative to smash balloon, WPZoom social feed widget, Feed Them Social – Photo Galleries, 10websocial, spotlight social feeds, feedzy RSS Aggregator, Social Feed Gallery, Easy Social Feed – social photos gallery, Social Slider Feed, BlossomThemes Social Feed etc.<br />\nTo find out more about who we are &amp; what we do, here are some useful links:<br />\n<a href=\"https://tagembed.com/\" rel=\"nofollow ugc\">Tagembed official website</a><br />\n<a href=\"https://tagembed.com/blog\" rel=\"nofollow ugc\">Blogs</a><br />\n<a href=\"https://tagembed.com/inspiration-gallery/\" rel=\"nofollow ugc\">Inspiration Gallery</a><br />\nYou can read our <a href=\"https://tagembed.com/terms-of-service/\" rel=\"nofollow ugc\">Terms of Service</a> &amp; <a href=\"https://tagembed.com/privacy-policy/\" rel=\"nofollow ugc\">Privacy Policy</a> here.</p>\n",
        "installation": "<p>Installation is free, quick, and easy. Set up Tagembed in minutes.</p>\n<p><strong>Method 1: From the Plugin directory</strong></p>\n<ul>\n<li>Go to the Plugins page in your WordPress site’s dashboard.</li>\n<li>Click on the “Add New” button.</li>\n<li>Search for “Tagembed”.</li>\n<li>Click on the “Install” button next to it, then click “Activate”.</li>\n<li>Choose the network you want to collect content from example – Instagram Feed</li>\n<li>Customize the Widget using different theme and layout options</li>\n<li>Copy the short code and paste it where you want to display Instagram widget</li>\n</ul>\n<p><strong>Method 2: Upload the Zip File</strong></p>\n<ul>\n<li>Download the Tagembed Zip file.\n<ul>\n<li>Upload the file in the /wp-content/plugins directory of your WordPress website.</li>\n</ul>\n</li>\n<li>Activate the plugin.</li>\n<li>Choose the network (Eg:“Google Reviews”) and get started.</li>\n</ul>\n<p><strong>Step by Step guide to Add Instagram Feed on WordPress Website:</strong></p>\n<ul>\n<li>Select Instagram as your network.</li>\n<li>Now choose your Instagram Feed type from Instagram Handle, Instagram Hashtag, Instagram Stories, Instagram Reels, Instagram Mentions and click on “Create Feed”.</li>\n<li>Now authorize your Instagram account to collect posts from Instagram.</li>\n<li>Your Instagram feed will be now collected to Tagembed plugin.</li>\n<li>You can now proceed to customize Instagram Feed by using different themes &amp; layout options. Then choose relevant Instagram Feed from moderation panel so that you don&#8217;t showcase irrelevant Instagram feed.</li>\n<li>Finally, go to the embed tab &amp; copy the Instagram feed WordPress embed code.</li>\n<li>Paste the embed code in the backend of the page or posts you would like to display the Instagram Feed in.</li>\n<li>Save the changes made &amp; you&#8217;re done.</li>\n<li>Your Instagram Feed is now live on your website.</li>\n</ul>\n<p>Step by Step Guide with Screen Shots: <a href=\"https://tagembed.com/support/social-media-feed-plugin-for-wordpress/\" rel=\"nofollow ugc\">Installation Guide: Social Media Feed Plugin For WordPress</a></p>\n<p>Video Guide For <a href=\"https://www.youtube.com/watch?v=svEiOzrvMQg\" rel=\"nofollow ugc\">WordPress Instagram Feed</a><br />\nVideo Guide For <a href=\"https://www.youtube.com/watch?v=LqcWxNsDRss\" rel=\"nofollow ugc\">WordPress Facebook Feed</a><br />\nVideo Guide For <a href=\"https://www.youtube.com/watch?v=LFLhfJ1ffYw\" rel=\"nofollow ugc\">WordPress Google Reviews</a></p>\n",
        "faq": "\n<dt id='what%20is%20the%20need%20for%20a%20social%20media%20feeds%20plugin%3F'>\nWhat is the need for a social media feeds plugin?\n</h4>\n<p>\n<p>Social Media feeds Plugin give a fresh &amp; neoteric look to your website. It also boosts user engagement &amp; increases conversions. User-generated content is trusted by everyone over any marketing campaign. Your brand culminates in the process of being admired by your target audience.</p>\n</p>\n<dt id='is%20this%20plugin%20free%3F'>\nIs this plugin free?\n</h4>\n<p>\n<p>Yes, the Tagembed social media feeds plugin also provides a free plan with 5 social networks. Also, there are higher plans available in the social media aggregator plugin with enhanced features &amp; more social networks to make the best use of the plugin. Hence, make integration more smooth &amp; fluid.</p>\n</p>\n<dt id='will%20the%20steps%20require%20any%20coding%20skills%3F'>\nWill the steps require any coding skills?\n</h4>\n<p>\n<p>No. Tagembed is an advanced social media widget WordPress Plugin unlike any. Hence, embedding social media feeds using Tagembed social media aggregator plugin is entirely code-free.</p>\n</p>\n<dt id='can%20i%20display%20multiple%20instagram%20feeds%20on%20my%20site%20or%20on%20the%20same%20page%3F'>\nCan I display multiple Instagram feeds on my site or on the same page?\n</h4>\n<p>\n<p>Yes, you can. Our built-in feed creation tool allows you to display multiple Instagram feeds on your site or on the same page.</p>\n</p>\n<dt id='can%20i%20display%20feeds%20from%20multiple%20facebook%20pages%3F'>\nCan I display feeds from multiple Facebook pages?\n</h4>\n<p>\n<p>Absolutely! Create as many feeds as you like from different Facebook pages. Just click &#8220;Add New&#8221; to create a new feed and embed it anywhere on your site.</p>\n</p>\n<dt id='how%20do%20i%20connect%20my%20instagram%20account%3F'>\nHow do I connect my Instagram account?\n</h4>\n<p>\n<p>Connecting your Instagram account is easy with WP Social Ninja. You have multiple configuration options to choose from, allowing you to select the most convenient one.</p>\n</p>\n<dt id='instagram%20feed%20not%20loading.%20how%20to%20fix%20it%3F'>\nInstagram feed not loading. How to fix it?\n</h4>\n<p>\n<p>There could be several reasons your feed isn&#8217;t loading. Check out our detailed guide linked here for troubleshooting steps.</p>\n</p>\n<dt id='how%20do%20i%20customize%20my%20facebook%20feed%3F'>\nHow do I customize my Facebook feed?\n</h4>\n<p>\n<p>Tagembed provides fully customizable template options, enabling you to personalize and style your Facebook feed and posts.</p>\n</p>\n<dt id='can%20i%20hand-pick%20specific%20posts%20to%20hide%20or%20show%20in%20my%20instagram%20feed%3F'>\nCan I hand-pick specific posts to hide or show in my Instagram feed?\n</h4>\n<p>\n<p>Yes, you can. Use the filter options in the editor panel to hide or show specific Instagram photos or posts by selecting particular keywords or hashtags.</p>\n</p>\n<dt id='can%20i%20display%20multiple%20youtube%20feeds%20on%20my%20site%20or%20on%20the%20same%20page%3F'>\nCan I display multiple YouTube feeds on my site or on the same page?\n</h4>\n<p>\n<p>Definitely! You can display multiple YouTube feeds from your YouTube channel on your site or on the same page.</p>\n</p>\n<dt id='what%20is%20the%20easiest%20way%20to%20collect%20google%20reviews%3F'>\nWhat is the easiest way to collect Google reviews?\n</h4>\n<p>\n<p>To collect more Google reviews, simply add reviews us button on the banner of the google review widget and use review hub feature on your widget.</p>\n</p>\n<dt id='do%20i%20need%20to%20provide%20the%20api%20to%20embed%20google%20reviews%3F'>\nDo I Need to Provide the API to embed Google reviews?\n</h4>\n<p>\n<p>No, we don’t ask for Google API, you just need to enter your location and your reviews will fetch.</p>\n</p>\n\n",
        "changelog": "<h4>6.0</h4>\n<ul>\n<li>Performance and Security Enhancement.</li>\n</ul>\n<h4>5.9</h4>\n<ul>\n<li>Performance and Security Enhancement.</li>\n</ul>\n<h4>5.8</h4>\n<ul>\n<li>Bug Fixes &amp; some changes in code.</li>\n</ul>\n<h4>5.7</h4>\n<ul>\n<li>Merged Instagram and Instagram Business</li>\n</ul>\n<h4>5.6</h4>\n<ul>\n<li>Adding clarity to understand how users interactive with our plugin to improve userflow.</li>\n</ul>\n<h4>5.5</h4>\n<ul>\n<li>Bug Fixes &amp; some changes in code.</li>\n</ul>\n<h4>5.4</h4>\n<ul>\n<li>Bug Fixes &amp; some changes in code.</li>\n</ul>\n<h4>5.3</h4>\n<ul>\n<li>Bug Fixes &amp; some changes in code.</li>\n</ul>\n<h4>5.2</h4>\n<ul>\n<li>Users need to signup now instead of auto account creation.</li>\n</ul>\n<h4>5.1</h4>\n<ul>\n<li>New: Inherit feature &#8211; to automatically align your website font style &amp; colors with widget.</li>\n</ul>\n<h4>5.0</h4>\n<ul>\n<li>New: Major chnages in the chat support widget for our users.</li>\n</ul>\n<h4>4.9</h4>\n<ul>\n<li>Bugs Fix for Instagram Feed, Facebook Feed, Twitter Feed, Google Reviews, Rss Feed, YouTube Gallery, &amp; more.</li>\n</ul>\n<h4>4.8</h4>\n<ul>\n<li>Fix Security Nounce &#8211; for Instagram Feed, Facebook Feed, Twitter Feed, Google Reviews, Rss Feed, YouTube Gallery, &amp; more.</li>\n</ul>\n<h4>4.7</h4>\n<ul>\n<li>New: Instagram Handle Feed &#8211; Now you can collect public Instagram Profile posts &amp; then embed Instagram Handle Feed on website.</li>\n<li>New: Facebook Page Feed &#8211; Now you can collect public Facebook Page posts &amp; then embed Facebook Page Feed on website.</li>\n<li>New: Vivid Theme &#8211; Introducing New Vivid Theme to showcase your social media feed in colorful variations.</li>\n<li>Fix: Bugs fixed. Now social media feeds will load faster than before on website.</li>\n</ul>\n<h4>4.6</h4>\n<ul>\n<li>New: We have come up with some major networks &amp; features dedicatedly for our WordPress plugin users.</li>\n<li>New: Airbnb Experiences Review &#8211; We are introducing a new connection method for our WordPress users where they can collect Airbnb reviews using a new connection type &#8220;Airbnb Experiences&#8221;.</li>\n<li>New: Slack Widget &#8211; Now you can showcase your slack feed to your website or screen using WordPress social media feed plugin.</li>\n<li>New: Vimeo Widget &#8211; Collect, curate, &amp; embed vimeo video on your WordPress website.</li>\n<li>New: Amazon Reviews &#8211; Introducing a new network Amazon Review widget for website. Now you can showcase your Amazon Product Reviews on your website to build trust among your potential users to make a decision directly from your website.</li>\n<li>New: Tripadvisor Review Widget &#8211; For all the travel advisors we are introducing a new network Tripadvisor review widget. Now you can showcase the reviews from Tripadvisor to your website for recommending better tour ideas with genuine users&#8217; experiences.</li>\n<li>New: Aliexpress Review Widget &#8211; Aggregate reviews from your Aliexpress product page &amp; embed Aliexpress review directly to your website.</li>\n<li>Fix: We have updated the moderation panel. Earlier your expired feeds like Instagram Feed, Facebook Feed, Twitter Feed, YouTube Videos, Linkedin Feed, Vimeo Videos. Slack Feed, RSS feed etc couldn&#8217;t be updated automatically. This fix will now automatically refresh your expired feeds.</li>\n<li>New: Introducing Analytics 2.0 for all the WordPress plugin users so that you can track the performance of your embedded widget.</li>\n</ul>\n<h4>4.5</h4>\n<ul>\n<li>Fix: Account management issue &#8211; After updating plugin when user is trying to access their feeds. With the new fix they will remain login still after updating the plugin.</li>\n</ul>\n<h4>4.4</h4>\n<ul>\n<li>New: Due to Twitter API update on 9th of Feb 2023 we have removed the twitter feed from free plan.</li>\n<li>Fix: Cache issue with widgets like Instagram Feed, YouTube Gallery, Facebook Page, Instagram Gallery or Instagram page feed, Review Widget, Twitter Feed &amp; more.</li>\n<li>New: Soon introducing a new way to collect reviews for your businesses using Tagembed review widget where the review plugin users will be able to grab more reviews from their clients.</li>\n<li>Fix: Some minor bug fixes for Instagram Feed, YouTube Gallery, Facebook Page, Instagram page feed, Review Widget, Twitter Feed, Instagram Gallery &amp; more.</li>\n<li>Fix: Grid Theme fix for feed widgets where the collected feed was not loading properly.</li>\n</ul>\n<h4>4.3</h4>\n<ul>\n<li>New: New Networks such as Tiktok Videos, LinkedIn Hashtag, Flickr Feed, VK Album &amp; Instagram Stories are now added to the Tagembed social media WordPress Plugin so that user can create Tiktok Videos, Linkedln Hashtag, Flickr Feed, VK Album &amp; Instagram Stories directly from the plugin itself.</li>\n<li>New: Analytics &#8211; Now review the performance of your embedded UGC gallery or social media feed widget to understand the impact of your social widget on your website.</li>\n<li>Fix: Speed optimization for fast loading of Instagram Feed, Twitter Feed, Google Reviews, RSS Feed, YouTube video, Google News RSS Feed, Facebook Page Feed, Instagram slider &amp; more.</li>\n<li>Fix: Optimization for themes like Instagram slider, Instagram carousel, Instagram Grid, Instagram Gallery, Instagram Wall, Instagram Story Themes &amp; etc.</li>\n<li>Fix: Optimization for themes like Facebook slider, Facebook carousel, Facebook Grid, Facebook Gallery, Facebook Wall, Facebook Page, Facebook Story Themes &amp; etc.</li>\n<li>New: Update new user flow to create feed faster.</li>\n</ul>\n<h4>4.2</h4>\n<ul>\n<li>New: Show More Feature &#8211; We have introduced a new show more feature under the footer settings that you can customize with your own preferred language. Making your native visitors easy to access &amp; explore.</li>\n<li>New: Trim Content &#8211; Now you can trim content as per your requirement for captions, making the feed look beautiful.</li>\n<li>Fix: Fixed Private Post Expiry Issues</li>\n</ul>\n<h4>4.1</h4>\n<ul>\n<li>Fix: Now easily embed on Elementor, Vamtam etc themes using Iframe Code or Short Code.</li>\n<li>New: Introducing full-flash JS Code so that you can easily embed widget on your website for making the social media widget plugin SEO friendly.</li>\n<li>Fix: Fixed Tagembed Block Issue for wordpress themes. Tagembed block was not visible when users try to embed Instagram Feed, mastodon feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Video, RSS Feed, Instagram Slider, Facebook Page, Twitter Widget, social media wall, Instagram Gallery, Insta widget etc.</li>\n</ul>\n<h4>4.0</h4>\n<ul>\n<li>New: Introducing Lite Code (JS Code Beta).</li>\n</ul>\n<h4>3.10</h4>\n<ul>\n<li>Fix: Tested &amp; fixed issue for Social Media Plugin.</li>\n</ul>\n<h4>3.9</h4>\n<ul>\n<li>Fix: Tested &amp; fixed issue for Social Media Plugin.</li>\n</ul>\n<h4>3.8</h4>\n<ul>\n<li>Fix: Tested &amp; fixed issue for Social Media Plugin.</li>\n</ul>\n<h4>3.7</h4>\n<ul>\n<li>Fix: JS code is now loaded from a local file shipped within the plugin rather than an external CDN for use with the customizer in the admin area. So all files will be loaded from within the plugin.</li>\n</ul>\n<h4>3.6</h4>\n<ul>\n<li>Fix: Fixed Reconnecting &#8211; An account now results in deleting the original connection in the database &amp; adding a new one. This will prevent issues with some systems caching. No More Updating Issues with Facebook, Instagram, Twitter, Youtube, Google Reviews, RSS Aggregator &amp; more.</li>\n</ul>\n<h4>3.5</h4>\n<ul>\n<li>Fix: Tested &amp; fixed for a third party plugin that was causing issue will creating Instagram Feed, Facebook Feed, Google Reviews, Twitter Feed, YouTube Channel Video, FB Page, RSS Feed using Tagembed Social Media WordPress Plugin.</li>\n<li>Fix: Tested &amp; fixed for the WordPress media library that was causing image alignment issue when user is creating feed.</li>\n<li>Fix: Fixed Issue with the plugin auto-upadte icon that keeps on rotating even though the plugin is up-to-date.</li>\n<li>Fix: Now when you add Fb Page, Fb feed, Fb album, Insta feed, Insta Hashtag, Twitter Feed, Google Reviews &amp; more on your widget it will be displayed in a new refreshed view with some technical glitches fixed.</li>\n</ul>\n<h4>3.4.1</h4>\n<ul>\n<li>Fix: We have tested &amp; made fix for the new WordPress version 6.1 for all of our social feed such as Instagram Feed, Facebook Feed, Twitter Feed, Linkedin Feed, YouTube Video, Pinterest Feed, Yelp Reviews, Airbnb Reviews, Google Reviews, &amp; more.</li>\n</ul>\n<h4>3.4</h4>\n<ul>\n<li>Fix: API update for Instagram Reels. Now you can collect Instagram Reels feed by just connecting your Instagram Handle Account &amp; in a few seconds Instagram Reels will appear. Earlier there was a bug that doesn&#8217;t allow every user to collect Instagram Reels &amp; would fail to fetch Instagram Reels.</li>\n<li>New: Earlier when you wanted to embed Instagram Feed, Twitter Feed, Facebook Feed, Linkedin Feed, Pinterest Feed, RSS Feed, YouTube Videos, Google Reviews etc you need to copy the shortcode that was easy but some also needed HTML code or iFrame code that could allow more possibility to embed Instagram Feed, Twitter Feed, Facebook Feed, Linkedin Feed, Pinterest Feed, RSS Feed, YouTube Videos, Google Reviews. With this update we have included HTML code &amp; iFrame Code for all users.</li>\n<li>New: Linkedin Profile &#8211; Now you can collect Linkedin Feed using new method that is Linkedin Profile that allows you to collect Linkedin Feed from your personal Linkedin Profile in just a click.</li>\n</ul>\n<h4>3.3</h4>\n<ul>\n<li>New: Introducing new social media feed source, Tumblr. Now you can collect Tumblr Feed, customize &amp; curate theme &amp; then embed Tumblr Feed on WordPress.</li>\n<li>New: Introducing new social media feed source, Yelp. Now you can collect Yelp Review Feed, customize &amp; curate theme &amp; then embed Yelp Reviews on WordPress website in just a few clicks.</li>\n<li>New: Introducing new social media feed source, Capterra. Now you can collect Capterra Review Feed, customize &amp; curate theme &amp; then embed Capterra Reviews on WordPress website in just a few clicks.</li>\n<li>New: Introducing new social media feed source, Etsy. Now you can collect Etsy Review Feed, customize &amp; curate theme &amp; then embed Etsy Reviews on WordPress website in just a few clicks.</li>\n<li>Update: Custom CSS issues fix. Earlier when you collect Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews &amp; YouTube Videos, the Custom CSS wouldn&#8217;t be applied in it but now with the issue fix you can easily collect Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Videos &amp; add your custom CSS code to make it more astonishing.</li>\n<li>Update: Facebook Carousel Post issue fix. Earlier when you collect Facebook Feed, the Facebook Post with multiple Facebook images in it wouldn&#8217;t be displayed as one but now with this update you view multiple Facebook Posts in one as a Facebook Carousel.</li>\n<li>Update: Linkedin Carousel Post issue fix.   * Update: Instagram Carousel Post issue fix.  * Update: Instagram Slider Post issue fix. Earlier when you collect Instagram Feed, the Instagram Post wouldn&#8217;t be displayed as a Instagram Slider due to the missing Instagram Slider button but now with this update you display Instagram Slider precisely in a Slider.</li>\n<li>Update: Twitter Carousel Post issue fix. Earlier when you collect Twitter Feed, the Twitter Post with multiple Twitter images in it wouldn&#8217;t be displayed as one but now with this update you view multiple Twitter Posts in one as a Twitter Carousel.</li>\n<li>New: Card Style customization update.\n<ul>\n<li>Content Alignment &#8211; Align your card&#8217;s content in three different style (Left, Right, Center) for Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews &amp; YouTube Videos etc.</li>\n<li>Trim Content &#8211; Trim the content of your widget to a certain character so that the feed doesn&#8217;t look absurd.</li>\n<li>Aspect Ratio &#8211; Set aspect ratio as per your post ratio to match the aesthetic of your post style &amp; website.</li>\n<li>Theme Mode &#8211; Make your card more interactive &amp; less-straining with the latest trends. Dark &amp; Light Mode is now available for all social media feeds</li>\n<li>Card Curve &#8211; Flaunt the view of your card with 3 different edge styles of curvness based on your website block theme. Hence widget will look ashtonishing with square, or round edges.</li>\n</ul>\n</li>\n<li>NOTE: Tested Instagram Feed, Facebook feed, Twitter Feed, Instagram Slider, YouTube video, Pinterest Feed, Facebook Page feed, YouTube Gallery, News RSS Feed &amp; all other.</li>\n</ul>\n<h4>3.2</h4>\n<ul>\n<li>New: Now choose your personalized card style  according to your website requirement.</li>\n<li>New: Introducing extra customization option into the plugin so that widget look astonishing &amp; also blends perfectly with your website.</li>\n<li>FIX: Alignment of the profile info was not calibrated properly. Now, profile information for widget will be displayed in proper alignment.</li>\n<li>FIX: Twitter Feed, Facebook feed, Youtube Video, Instagram Feed: Small bugs fixes for Twitter Feed, Facebook feed, YouTube Video &amp; Instagram Feed.</li>\n<li>FIX: Instagram Feed, Twitter feed, Facebook feed, Facebook reviews, youtube video caching for faster delivery.</li>\n<li>NOTE: Tested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed &amp; all other with WordPress Version 6.0</li>\n</ul>\n<h4>3.1</h4>\n<ul>\n<li>New: Now choose what happens when you click when you Embed Instagram Feed, Embed Facebook Feed, Embed Twitter Feed, Embed Google Reviews, Embed YouTube Video, Embed RSS Feed etc. Want to redirect them to the specific social platform or open pop-up or no action, based on your requirement.</li>\n<li>New: Introducing custom CSS option into the plugin. Now make custom style of your widget so that your widget, look astonishing &amp; also blends perfectly with your website theme.</li>\n<li>FIX: Twitter Feed: Alignment of the profile info was not calibrated properly. Now, profile information for your Twitter Feed will be displayed in proper alignment.</li>\n<li>FIX: Youtube Video, Instagram Feed: Small bugs fix for YouTube Shorts &amp; Instagram Feed.</li>\n<li>FIX: Instagram Feed caching.</li>\n</ul>\n<h4>3.0</h4>\n<ul>\n<li>New: Now choose your custom layout from the customize tab. You can set your desired number of rows &amp; columns for your widget directly from the plugin. Earlier there was no such option.</li>\n<li>New: Make your personalized card style using the new card settings option under the customize tab. You can set to display or hide author details, content, font style &amp; many more directly from the plugin.</li>\n<li>FIX: Instagram Feed: Alignment of the profile info was not calibrated properly. Now, profile information for your Instagram Feed will be displayed in proper alignment.</li>\n<li>FIX: Twitter Feed: Small bugs fix for Twitter Hashtag Feed.</li>\n<li>FIX: YouTube Feed caching.</li>\n<li>NOTE: Tested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed &amp; all other with WordPress Version 5.9.3</li>\n</ul>\n<h4>2.9</h4>\n<p>Bugs Fix for Linkedin Feed, Instagram Feed, Facebook Feed, Twitter Feed, Youtube Gallery, &amp; Google Reviews. Also, now users can add several Linkedin posts using Linkedin Widget directly from the Tagembed Social Media Feed WordPress Plugin to WordPress site.</p>\n<h4>2.8</h4>\n<p>Introducing more ways to embed Instagram Feed on WordPress website such as: Instagram TV or IGTV, Instagram Reels, Instagram Stories, Instagram Mentions, &amp; Instagram Tagged Feeds into your Instagram Widget, directly using Tagembed Social Media Feed WordPress Plugin.<br />\n  Minor Bugs Fix for Facebook Feed, Twitter Feed, Youtube Gallery, Google Reviews &amp; Linkedin Feed.<br />\n  Earlier there was a bug which wouldn&#8217;t let user to collect all of the latest Facebook Feed, Twitter Feed, Youtube Gallery, Google Reviews &amp; Linkedin Feed. Now, with the new update not only users will be able to collect Instagram Feed using different method but also all of the latest social feeds from Facebook Feed, Twitter Feed, Youtube Gallery, Google Reviews &amp; Linkedin Feed will be collected in the Facebook Widget, Twitter Widget, YouTube Widget, Google Review Widget &amp; Linkedin Widget, repectively.<br />\n  Tested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed &amp; all other with current wordpress version.</p>\n<h4>2.7</h4>\n<p>Fixed PHP warnings &amp; notices &amp; tested upto wordpress 2.9 version.<br />\n  Fixed bugs for Instagram Slider, Facebook Feed, Youtube Gallery,  Twitter Feed, Instagram Stories, Google Reviews &amp; Pinterest.<br />\n        Instagram feed: Now connect Instgaram account easily.<br />\n        Tested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed &amp; all other with current wordpress version.</p>\n<h4>2.6</h4>\n<ul>\n<li>Fixed Bugs for Facebook Feed, Facebook Widget, Instagram Feed &amp; Instagram Widget &amp; Improved Design for Twitter Feed, Twitter Widget, YouTube Video &amp; YouTube Gallery.</li>\n</ul>\n<h4>2.5</h4>\n<ul>\n<li>Now Display LinkedIn Feeds in Linkedin Widget, Youtube Videos &amp; Youtube Shorts in YouTube Gallery &amp; embed on website.</li>\n</ul>\n<h4>2.4</h4>\n<ul>\n<li>Introducing New Features to Display social media Feeds according to your need.</li>\n<li>Earlier Instagram Feed, YouTube Videos, Twitter Feed, Facebook feed cannot be pinned to top or highlighted. Now you Pin the post to the top, or Highlight Instagram Feed, Twitter Feed, YouTube Video, Facebook Feed.</li>\n</ul>\n<h4>2.3</h4>\n<ul>\n<li>Fixed Bugs for Instagram Feeds &amp; Improved Design for Instagram Feed display. Earlier Instagram Feed pop-up was not responsive &amp; Instagram pop-up used to shrink automatically. Now Instagram pop-up is responsive &amp; Instagram feed featured pop-up is not shrinking.<br />\nFixed Twitter Feed Bugs &amp; Improved Social Media Widget Design.<br />\nFix &#8211; Instagram API updated: Instagram connection method update for more smooth connection of Instagram with the plugin to collect Instagram Feed.<br />\nFix &#8211; Facebook cache optimize, now your collected Facebook feed will view more promising then before after you embed Facebook feed on website.<br />\nNew &#8211; Instagram IGTV: Introducing Instagram IGTV as a connection method to collect Instagram feed from Instagram as a Instagram IGTV method. Now embed Instagram TV video on your website.</li>\n</ul>\n<h4>2.2</h4>\n<p>Fixed Facebook Feed, YouTube Gallery, Instagram Feed Bugs &amp; Improved Facebook Widget Design.<br />\n  New &#8211; Instagram Stories: Introducing Instagram Stories in Instagram connection method so that you can embed Instagram Stories on your website from your Instagram Handle. Just enter your Instagram Handle &amp; get all of your Instagram Stories in the Instagram Widget.<br />\n  New &#8211; Twitter Hashtag: Introducing Twitter Hashtag in Twitter connection method so that you can embed Twitter hashtag on your website from your Twitter. Just enter your trending Twitter hashtag &amp; get all of your Twitter Hashtag feed in the Twitter Widget.<br />\n  New &#8211; Facebook Handle: Introducing Facebook Handle in Facebook connection method so that you can embed Facebook Feed on your website from your Facebook Profile. Just connect your Facebook feed &amp; get all of your Facebook feed in the Facebook Widget.<br />\n  New &#8211; New Gallery Theme for Instagram Feed, YouTube Video, Twitter Feed, Facebook feed, pinterest feed.<br />\n  New &#8211; New Classic carousel theme for Google Review, Trustpilot reviews, Tripadvisor reviews, etsy reviews, airbnb reviews, yelp reviews, facebook reviews, Instagram Feed, YouTube Video, Twitter Feed, Facebook feed, pinterest feed &amp; more.<br />\n  Fix &#8211; Cache optimized for Google Review, airbnb reviews, yelp reviews, facebook reviews, Instagram Feed, YouTube Video, Twitter Feed, Facebook feed, pinterest feed.</p>\n<h4>2.1</h4>\n<p>Added Powerful Filter Section. Choose the best social media feeds to display on your website. You can filter your collected Instagram Feed, Facebook Feed, Twitter Feed, YouTube Video &amp; etc social media feeds based on the feed Post type such as images, videos, text. You can also public or private collected social media feeds.<br />\n  New &#8211; Instagram Reels: Introducing Instagram Reels conection method. Now you can add Instagram Feed to your Instagram Widget &amp; finally embed Instagram Feed from Instagram Reels connnection method. Just enter the Instagram Handle name into the Instagram Reels section &amp; all of your Instagram Reels video will be collected in the Instagram widget.<br />\n  Fix &#8211; YouTube Channel access token refresh: Now embed YouTube channel videos that is playable on a pop-up or can be redirected to YouTube.<br />\n  Fix &#8211; Facebook Feed Access token refresh: Facebook Feed connection will not fail like it was before for Facebook Page.<br />\n  New &#8211; YouTube Shorts: Introducing YouTube Shorts in YouTube connection method so that you can embed YouTube Shorts on your website from your YouTube Channel.</p>\n<h4>1.9</h4>\n<p>Fixed Bugs for Instagram Hashtag Feed &amp; Improved Design for Twitter Hashtag Feed. Now you can add Instagram Feed from any Instagram Hashtag to your Instagram Widget. Also Twitter Feed got new design, when you collect Twitter Hashtag Feed it was showing some glitches in design but now Twitter feed is stable.<br />\n  New &#8211; Twitter Hashtags: Introducing Twitter Hashtags, Now you can add Twitter Hashtag Feed to your Twitter Widget &amp; finally embed Twitter Feed from Twitter Hashtag connnection method.<br />\n  New &#8211; YouTube Channel: Introducing YouTube Channel connection method. Now you can add YouTube Channel Video Feed to your YouTube Widget &amp; finally embed YouTube Feed from YouTube Channel connnection method.<br />\n  Fix &#8211; Instagram Access Token: Instagram Hashtag Access Token Refresh fix.<br />\n  Fix &#8211; Instagram Access Token: Instagram Handle Access Token Refresh fix.<br />\n  Fix &#8211; Instagram Access Token: Instagram Business Account Access Token Refresh fix from Facebook.</p>\n<h4>1.8</h4>\n<p>Easily Manage your plans within WordPress Dashboard. Now you can subscribe to Tagembed Plans for accessing extra social networks on the dashboard itself.<br />\n  New &#8211; Introducing Classic Card Theme. It is slighty round from edges &amp; makes a perfect view for your widget.<br />\n  Fix &#8211; Access Token Refresh issue resolved for Instagram. Now Instagram access token get validate successfully for Instagram Handle.<br />\n  New &#8211; Introducing Instagram Hashtags, Now you can add Instagram Hashtag Feed to your Instagram Widget &amp; finally embed Instagram Feed from Instagram Hashtag connnection method.<br />\n  New &#8211; Introducing Twitter Mentions, Now you can add Twitter Mention Feed to your Twitter Widget &amp; finally embed Twitter Feed from Twitter Mention connnection method.</p>\n<h4>1.7</h4>\n<p>New &#8211; Instagram Tagged: Introducing Instagram tagged connection type to collect Instagram Tag posts on your Instagram Widget. Finally, you can embed Instagram feed with Instagram Tag posts to your wordpress website.<br />\n  Fix &#8211; Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews &#8211; layouts.<br />\n  New &#8211; Twitter favorites: Introducing Twitter favorites: Now you can collect Twitter Feed using Twitter Favorite connection method to your Twitter widget &amp; embed twitter feed on website.</p>\n<h4>1.6</h4>\n<p>Making the world&#8217;s easiest Social media feeds plugin for wordpress. Now create &amp; manage social media feeds directly from your wordpress dashboard &amp; chat directly to our experts for any support.<br />\n  Fix &#8211; Access Token Refresh for Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews.<br />\n  Fix &#8211; Access Token Refresh for 2nd feed created in a widget for all Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews.<br />\n  Fix &#8211; Cache Issue resolved of 2nd widget if created using Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews.</p>\n<h4>1.5</h4>\n<p>Fix &#8211; Bugs Fixes for YouTube video &amp; YouTube playlist: Now you can create YouTube Gallery using new themes &amp; layouts. Also YouTube video can be added in YouTube Gallery from any playlist.<br />\n  Fix &#8211; Bugs Fixes for Instagram Feed, Twitter Feed, Facebook Feed, YouTube Playlist, Google Reviews.<br />\n  New &#8211; Introducing custom posts feature to add custom Instagram Feed, custom Facebook Feed, custom Twitter Feed, custom Google Reviews Feed, custom Pinterest Feed, custom YouTube Feed, etc.<br />\n  Fix &#8211; Miscellaneous styling for Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews.</p>\n<h4>1.4</h4>\n<p>Fix &#8211; Bugs Fixes for Youtube channel video: Earlier when collecting Youtube Videos, YouTube Channel wasn&#8217;t properly added. Now after fix you can add youtube video &amp; create a Youtube Gallery using any YouTube Channel.<br />\n  Fix &#8211; Bugs Fixes for Instagram Feed, Twitter Feed, Facebook Feed, YouTube Themes &amp; Layouts.<br />\n  Fix &#8211; Cache optimized for Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Feed.<br />\n  New &#8211; Introducing Modern Card Theme for theme<br />\n  New &#8211; Introducing option to upload profile picture.</p>\n<h4>1.3</h4>\n<p>Fix &#8211; Fixed Instagram Feed Bugs &amp; Improved Facebook Feed, Google Reviews Design.<br />\n  Fix &#8211; Layout loading is fixed. Now your widget will display in the proper alignment.<br />\n  New &#8211; Introducing Instagram Mentions to collect content for your Instagram feed.</p>\n<h4>1.2</h4>\n<p>New &#8211; Improved Design for the better view of the Instagram Feed, Twitter Feed, Google Review &amp; Facebook Feed in Plugin.<br />\n  New &#8211; Now you can collect Instagram Feed &amp; filter Instagram Feed as per your requirements. Not only that but you can also add Instagram Feed to your Instagram Widget &amp; switch between different themes &amp; layouts to make your Instagram Feed best suit your website.<br />\n  New &#8211; Collect Twitter Feed &amp; filter Twitter Feed as per your requirements. Not only that but you can also add Twitter Feed to your Twitter Widget &amp; choose between different themes &amp; layouts to make your Twitter Feed best suit your website style.<br />\n  Fix &#8211; Cache problem is fixed now that will allow you to load your Instagram Feed, Facebook Feed, Twitter Feed, YouTube Feed, Google Review Feed faster on your website.</p>\n<h4>1.1</h4>\n<p>Fix &#8211; Fixed Bugs for Linkedin Post, Instagram Feed &amp; Facebook Feed also Improved Design for the better view of the plugin.</p>\n<h4>1.0</h4>\n<ul>\n<li>First Release &#8211; This is the first release of Tagembed Social Media Feeds WordPress Plugin. If you find any issues, please contact us on <a href=\"https://tagembed.com/contact-us/\" rel=\"nofollow ugc\">tagembed.com</a></li>\n</ul>\n"
    },
    "short_description": "Collect &amp; Embed Instagram Feed, Embed Facebook Feed, Embed YouTube Videos, Embed Twitter Feed, Google Reviews &amp; 15+ Social Media Feed on website.",
    "description": "<h4>Collect. Curate. Embed.</h4>\n<p>Tagembed &#8211; The best social media &amp; review plugin to collect reviews (like <strong>Google reviews</strong>), stories, social media feeds (like <strong>Instagram Feed</strong>), photos, &amp; embed them on any website. Automatically!</p>\n<h4>Top Social Media Feed Network:</h4>\n<ul>\n<li>Instagram Feed (Hashtag, Mention, handle, stories, reels)</li>\n<li>Facebook Feed (Page, Handle, Album, Review, Page Mention)</li>\n<li>TikTok Feed (Handle, Hashtag)</li>\n<li>YouTube Feed (Shorts, playlist channels)</li>\n<li>Twitter Feed (Hashtag, handle, mention)</li>\n<li>Linkedin feed (Company Page URL, Profile URL, Post URL)</li>\n</ul>\n<h4>Top Review Feed Network:</h4>\n<ul>\n<li>Google reviews</li>\n<li>Facebook review feed</li>\n<li>Airbnb</li>\n<li>Yelp</li>\n</ul>\n<p>Showcasing social media feed &amp; reviews on your site is a simple yet powerful strategy to boost customer confidence, ultimately leading to increased sales!</p>\n<h3>4 Simple Step Process to Use Tagembed Social Media Plugin</h3>\n<ul>\n<li><strong>Collect:</strong> Select your favorite source (like Instagram feed, Facebook Feed, Google reviews etc)</li>\n<li><strong>Customize:</strong> Select the theme &amp; layout as per your brand appearance</li>\n<li><strong>Moderate:</strong> Choose the post you want to embed.</li>\n<li><strong>Publish:</strong> Copy the short code <strong>[tagembed widgetid XXXXX]</strong> and paste on your WordPress editor.</li>\n</ul>\n<h4>Powerful Plugin to Embed social media feed like pro</h4>\n<p>Create and customize your Instagram feed plugin and showcase stunning Instagram widget on your website. Check the video tutorial:<br />\nhttps://www.youtube.com/watch?v=svEiOzrvMQg</p>\n<h3>Why Tagembed is the Best Plugin to embed social Media Content</h3>\n<ul>\n<li>**Once installed, you can embed the widget in 3 mins on your website.</li>\n<li>**Quick to set up as possible, with just a few clicks.</li>\n<li><strong>Multiple Sources</strong>: Embed (like Instagram feed, Facebook feed, Google reviews etc) into a single widget.</li>\n<li><strong>Real time update</strong>: Display post instantly as they come on your social account.</li>\n<li><strong>SEO friendly</strong>: Our widgets ensure optimal speed and performance by caching social media and loading it only when needed, keeping your page lightning-fast.</li>\n<li><strong>Boost your Google Rating by collecting fresh Google Reviews using a **&#8221;Review Us on Google&#8221;</strong> button.</li>\n<li><strong>Unlimited Widgets</strong> – Showcase your reviews from various sources in one place. Combine your Google reviews, Facebook reviews, &amp; other business reviews into a single widget.</li>\n<li><strong>Embed Anywhere</strong>: We support Elementor, Gutenberg block, WordPress widget etc.</li>\n</ul>\n<h3>EASY DESIGN TOOLS</h3>\n<ul>\n<li><strong>Quickly customize your website to make it stand out — **no coding needed</strong>.</li>\n<li><strong>Pre-built templates</strong> to embed Google reviews, Instagram reels, or Instagram feed widgets etc. To get started easily.</li>\n<li><strong>Inherit Theme</strong>: Automatically fetch the color  font of your website.</li>\n<li><strong>Gallery &amp; Slideshow layouts</strong> Image galleries, carousel slider, &amp; slideshows for WP sites.</li>\n<li><strong>Zero Code</strong>: We provide short code to embed the widget. No need for technical knowledge.</li>\n<li><strong>CTA</strong>: Add different CTA buttons to posts to increase sales.</li>\n<li><strong>Customization</strong>: Edit title, size, &amp; color; adjust image size and padding etc.</li>\n<li><strong>Banner</strong>: Add ready to use or add your own banner on your widget to collect reviews &amp; grow community.</li>\n<li><strong>Custom CSS</strong> to add elements of your choices.</li>\n<li><strong>Custom Post</strong> to add photo, video &amp; text of your choice.</li>\n</ul>\n<h3>Featured Reviews</h3>\n<p>★★★★★ “Tagembed has the features we needed that other competitors did not provide. Mainly the LinkedIn feeds which are something that was needed. The support on this plugin/app has been great!”<br />\n★★★★★ “Tagembed has been a game-changer in this aspect, particularly with its Twitter feed embedding capabilities. Ease of Use:Right from the start, impresses with its user-friendly interface.”<br />\n★★★★★ I can confidently say that it is the perfect Facebook &amp; Instagram tool for displaying instagram feed &amp; Facebook feed on my website.</p>\n<h3>Pricing:</h3>\n<p>We give 14-days free trial. So that the user can explore every feature before buying.</p>\n<p>Lite Plan: <strong>Forever Free</strong> includes</p>\n<ul>\n<li>1 Feed (like Instagram Feed, Facebook feed)</li>\n<li>500 Views/Month</li>\n<li>48 Hours Update Time</li>\n<li>Tagembed Branding</li>\n</ul>\n<p><strong>Premium Version</strong><br />\n* More Feed with multiple sources.<br />\n* No branding<br />\n* Instant update time<br />\n* Unlimited views on your widget<br />\n<strong>Note:</strong> One feed equals to one source E.g. Hashtag, Handle etc. counts as one feed.</p>\n<h3>Why should you embed social media feed on websites?</h3>\n<ul>\n<li><strong>Increased Engagement:</strong> Embedding social media feeds encourages interaction &amp; boosts engagement with your audience.</li>\n<li><strong>Fresh Content:</strong> It keeps website updated with the latest posts &amp; content from your social media profiles.</li>\n<li><strong>Social Proof:</strong> Displaying on your site provides social proof &amp; builds credibility.</li>\n<li><strong>Brand Visibility:</strong> Expanding your social media presence to your website increases brand visibility.</li>\n<li><strong>Enhanced User Experience:</strong> Visitors can easily access your social media content without leaving your website, improving their experience.</li>\n<li><strong>Cross-Promotion:</strong> It allows you to cross-promote social media channels and website, driving traffic between them.</li>\n<li><strong>Diverse Content:</strong> Incorporating different types of content from various social media platforms adds diversity to your website.</li>\n<li><strong>Community Building:</strong> Increase followers by showcasing UGC &amp; interactions.</li>\n<li><strong>SEO Benefits:</strong> Fresh &amp; relevant content from social media can positively impact website&#8217;s SEO.</li>\n<li><strong>Real-Time Updates:</strong> Keep your audience informed with real-time updates from social media channels.</li>\n</ul>\n<h3>Social Media Feeds:</h3>\n<ul>\n<li><strong>Instagram Feed:</strong> Showcase Instagram photos from hashtags, handles, mentions, stories, reels, &amp; more on your WordPress website.</li>\n<li><strong>Facebook Feed:</strong> Add Custom Facebook Feed directly on your website from Facebook page.</li>\n<li><strong>TikTok Feed:</strong> Display interactive &amp; responsive TikTok feeds widget on your website for free</li>\n<li><strong>YouTube Feed:</strong> Showcase YouTube channel feeds, including Shorts, Playlists, &amp; Videos, to encourage visitors to spend more time on your site and boost engagement.</li>\n<li><strong>Twitter Feed:</strong> Embed tweets from a hashtag or account in your Twitter widget &amp; display them on your website.</li>\n<li><strong>LinkedIn feed:</strong> Automatically embed linkedin widget (company’s posts, images, &amp; videos).</li>\n<li><strong>RSS Widget:</strong> Embed RSS feed using rss aggregator  to showcase the most striking and relevant news.</li>\n<li><strong>Slack feed:</strong> Enhance internal communication by embedding a creative Slack widget display on your website.</li>\n<li><strong>Pinterest feed:</strong> Boost engagement and amplify sales by embedding posts from multiple Pinterest boards on your website.</li>\n<li><strong>Vimeo Widget:</strong> Showcase your video collection on your website with Tagembed’s Vimeo Widget.</li>\n<li><strong>Flickr Widget:</strong> Increase followers, drive conversions, and boost engagement by embedding a Flickr gallery widget on your website.</li>\n</ul>\n<h3>How to Embed Instagram feed on WordPress?</h3>\n<ul>\n<li>Click on &#8220;Add Feed&#8221; &amp; select &#8220;Instagram&#8221; or &#8220;Instagram Business&#8221; to collect Instagram feeds.</li>\n<li>Choose your Instagram feed filter connection type, such as Instagram handle, hashtag, mention, profile, stories, Reels, IGTV, etc., to fetch Instagram feeds according to your preference.</li>\n<li>Select a pre-built theme (like photos, gallery). Personalize the Instagram feed style &amp; filter settings</li>\n<li>Click on the Display tab Section to preview the Instagram Feed &amp; Copy ShortCode to <a href=\"https://tagembed.com/blog/embed-instagram-feed-on-wordpress/\" rel=\"nofollow ugc\">Embed Instagram Feed on WordPress</a>.</li>\n<li>Paste the shortcode on your desired page or post &amp; update it to <a href=\"https://tagembed.com/blog/embed-instagram-feed-on-website-for-free/\" rel=\"nofollow ugc\">embed Instagram feed</a> Widget successfully.</li>\n</ul>\n<h3>How to Embed Instagram hashtag feed?</h3>\n<ul>\n<li>Click on Add Feed &amp; select network as Instagram Business to collect Instagram Hashtag Feed.</li>\n<li>Select your Instagram Feed &amp; choose Hastag as a source type to collect Instagram Hashtag as per your preference.</li>\n<li>Choose Theme (Recommended – Story Theme), Then personalize Instagram feed style using card style settings &amp; filter Instagram feed to display only relevant &amp; genuine Instagram Feed on WordPress website.</li>\n<li>Click on the Display tab Section to preview the Instagram Feed or Instagram Hashtag Feed &amp; then Copy ShortCode to <a href=\"https://tagembed.com/blog/embed-instagram-hashtag-feed-on-website/\" rel=\"nofollow ugc\">Embed Instagram Hashtag Feed</a> on WordPress.</li>\n<li>Paste the shortcode on your desired page or post &amp; update it to embed Instagram Hashtag Widget successfully.</li>\n</ul>\n<h3>How to Embed Instagram Reel</h3>\n<ul>\n<li>In &#8220;Add Feed&#8221; and select &#8220;Instagram&#8221; and choose “Reel” as a source.</li>\n<li>Now Choose Theme (like Story Theme) and customize and moderate your Instagram feed.</li>\n<li>Click on the Display tab and preview the Instagram Reel widget &amp; Copy code to <a href=\"https://tagembed.com/blog/embed-instagram-reels-on-website/\" rel=\"nofollow ugc\">Embed Instagram Reels</a> on WordPress.</li>\n<li>Paste the shortcode on your desired page or post &amp; update it to embed Instagram Reels Widget successfully.</li>\n</ul>\n<h3>How to embed Facebook feed on website?</h3>\n<ul>\n<li>Go to Add Feed &amp; select network as Facebook to collect Facebook feeds.</li>\n<li>Select your Facebook feed filter connection type from: Facebook Page, Facebook Page Reviews, Facebook Album etc to fetch Facebook feeds as per your preference.</li>\n<li>Now Choose Theme (like Story Theme) and customize and moderate your Facebook Feed.</li>\n<li>Click on the Display tab Section to preview the Facebook Feed &amp; Copy Shortcode to <a href=\"https://tagembed.com/blog/embed-facebook-feed-on-wordpress-website/\" rel=\"nofollow ugc\">Embed Facebook Feed on WordPress</a>.</li>\n<li>Paste the shortcode on your desired page or post &amp; update it to embed Facebook Feed Widget successfully.</li>\n</ul>\n<h3>How to embed TikTok feed on your website?</h3>\n<ul>\n<li>Choose TikTok as a source</li>\n<li>Now enter TikTok feed type &amp; click on “Create Feed” button</li>\n<li>All the posts will be fetched &amp; displayed in the moderation section.</li>\n<li>Choose the theme like photo gallery, video slider or photo slider</li>\n<li>Now choose the post you want to display on your TikTok feed.</li>\n<li>Click on Display &amp; copy the short code</li>\n<li>Paste it on the backend of the website where you want to display the TikTok widget.</li>\n</ul>\n<h3>How to embed a youtube feed on your website?</h3>\n<ul>\n<li>Select network as YouTube to collect YouTube Videos.</li>\n<li>Select your YouTube feed filter connection type from: YouTube Channel, YouTube Playlist, YouTube Shorts etc. to fetch YouTube Videos as per your preference.</li>\n<li>Choose a theme, personalize the YouTube Gallery Widget style, and filter YouTube videos to display on your  website.</li>\n<li>Click on the Display tab Section to preview the YouTube Gallery &amp; Copy ShortCode to Embed YouTube Video Gallery on WordPress.</li>\n<li>Paste the code on your desired page or post &amp; update it to <a href=\"https://tagembed.com/blog/embed-youtube-videos-on-website/\" rel=\"nofollow ugc\">embed YouTube Video Gallery</a> successfully.</li>\n</ul>\n<h3>How to add a twitter feed on a website?</h3>\n<ul>\n<li>Click on Add Feed &amp; select network as Twitter to collect Twitter feeds.</li>\n<li>Select your Twitter feed filter connection type from: Twitter handle, Twitter hashtag, Twitter List, Twitter Favorites, Twitter Advanced (Query), etc. to fetch Twitter feeds as per your preference.</li>\n<li>Choose Theme from 10+ Layouts, Personalize Twitter feed style &amp; filter Twitter feeds as per your requirement to display only relevant &amp; genuine Twitter Feed on WordPress website.</li>\n<li>Click on the Display tab and preview the Twitter Feed &amp; Copy shortcode to <a href=\"https://tagembed.com/blog/add-twitter-feeds-on-wordpress/\" rel=\"nofollow ugc\">Embed Twitter Feed on WordPress</a>.</li>\n<li>Paste the code on your desired page or post &amp; update it to get it updated on <a href=\"https://tagembed.com/twitter-widget/\" rel=\"nofollow ugc\">Twitter Widget</a> &amp; then embed Twitter Feed Widget successfully.</li>\n</ul>\n<h3>How to feed a LinkedIn feed on your WordPress website?</h3>\n<ul>\n<li>Choose LinkedIn to collect LinkedIn Feeds.</li>\n<li>Select your LinkedIn feed filter connection type from: LinkedIn Company Page URL, LinkedIn Post URL, LinkedIn Profile to fetch LinkedIn Posts as per your preference.</li>\n<li>Select the theme and customize it. Moderate the post you want to display.</li>\n<li>Click on the Display tab &amp; preview the LinkedIn Posts &amp; Copy Shortcode to <a href=\"https://tagembed.com/support/embed-linkedin-feeds-on-wordpress/\" rel=\"nofollow ugc\">Embed LinkedIn Feed on WordPress</a>.</li>\n<li>Paste the code on your desired page or post &amp; update it to embed LinkedIn Feed Widget successfully.</li>\n</ul>\n<p><strong>Note:</strong> Company Page URL, Profile &amp; Hashtag – For LinkedIn Widget users this method is only available with the <strong>Plus Plan</strong>.</p>\n<h3>Review Feeds:</h3>\n<ul>\n<li><strong>Google Reviews:</strong> Easily embed Google reviews into your WordPress site to boost SEO, build trust, &amp; boost sales.</li>\n<li><strong>Facebook Review feed:</strong> Show your reviews &amp; rating from Facebook on your pages and increase sales.</li>\n<li><strong>Airbnb:</strong> Include Airbnb widget on your website to multiple sales &amp; build trust.</li>\n<li><strong>Yelp:</strong> The Yelp Reviews widget allows you to embed your clients&#8217; reviews and build trust.</li>\n<li><strong>Amazon Reviews</strong> <a href=\"https://tagembed.com/blog/embed-amazon-reviews-on-website/\" rel=\"nofollow ugc\">Embed Amazon reviews</a> detailed reviews with the author&#8217;s name, photo, &amp; a link to your Amazon widget.</li>\n<li><strong>Tripadvisor feed:</strong> <a href=\"https://tagembed.com/blog/embed-tripadvisor-reviews-on-website/\" rel=\"nofollow ugc\">Add genuine Tripadvisor reviews</a> that paint a vivid picture of exceptional hospitality, creating an emotional connection that resonates with website visitors.</li>\n<li><strong>Aliexpress Reviews:</strong> Create your AliExpress Reviews widget now! Use our easy configurator to <a href=\"https://tagembed.com/blog/embed-aliexpress-reviews-on-website/\" rel=\"nofollow ugc\">embed AliExpress reviews</a> on your website in just minutes.</li>\n<li><strong>Etsy Reviews:</strong> Prove the genuineness of your brand and build a reputation in the market by exhibiting reviews using Etsy review widget.</li>\n<li><strong>All-in-one-review widget:</strong> Add multiple reviews sites on single review widget (For ex: Add Google review, Facebook feed reviews in one widget)</li>\n</ul>\n<h3>How to embed Google reviews on WordPress website?</h3>\n<ul>\n<li>Click on &#8220;Add Feed&#8221; and select &#8220;Google Review&#8221; to collect user reviews from Google.</li>\n<li>Choose your Google Reviews feed filter connection type, such as &#8220;My Places&#8221; or &#8220;Places,&#8221; to fetch Google Reviews.</li>\n<li>Select a theme like review carousel. Personalize the Google Review Widget&#8217;s style and filter settings to display only relevant Google Reviews.</li>\n<li>Click on the Display tab to preview the Google Reviews. Copy the shortcode provided to <a href=\"https://tagembed.com/blog/embed-google-reviews-on-wordpress/\" rel=\"nofollow ugc\">embed Google Reviews on WordPress</a></li>\n<li>Paste the code into your desired page or post and update it to successfully embed the <a href=\"https://tagembed.com/google-review-widget/\" rel=\"nofollow ugc\">Google Review Widget</a>.</li>\n</ul>\n<p>Note: For free plan users, the Google Review Widget will not automatically update with new reviews.</p>\n<h3>How to embed Facebook reviews feed on websites?</h3>\n<ul>\n<li>Choose Facebook as the platform to collect feeds.</li>\n<li>Select the type of Facebook feed you want to collect, such as Facebook Reviews, Facebook Album, Facebook Mentions, Facebook Profile, Facebook Page, etc.</li>\n<li>Choose a display theme (like slider, grid, etc.) and personalize the style and filter settings to display only relevant Facebook feeds on your WordPress website.</li>\n<li>Click on the Display tab to preview the Facebook feed or Facebook Reviews feed. Copy the shortcode provided to <a href=\"https://tagembed.com/blog/embed-facebook-reviews-on-wordpress/\" rel=\"nofollow ugc\">Embed FB Reviews on WordPress.</a></li>\n<li>Paste the code into your desired page or post and update it to successfully embed the <a href=\"https://tagembed.com/facebook-review-widget/\" rel=\"nofollow ugc\">Facebook Reviews Widget</a></li>\n</ul>\n<h3>We have Multiple themes to choose from:</h3>\n<ul>\n<li>Slider</li>\n<li>Grid</li>\n<li>Classic Carousel</li>\n<li>Horizontal Carousel</li>\n<li>Story</li>\n<li>Vivid</li>\n<li>List View</li>\n<li>Single Post</li>\n<li>Gallery Theme</li>\n<li>Classic Theme</li>\n</ul>\n<h3>Our Support:</h3>\n<p>We&#8217;re known for quick, helpful support. With 24/5 customer service, we promptly resolve any issues to meet customer expectations.<br />\nCheck topics or ask a new question here: <a href=\"https://wordpress.org/support/plugin/tagembed-widget/\" rel=\"ugc\">Support Forum</a><br />\nIf you still can’t find the answer, feel free to email us <strong>support@tagemebd.com</strong><br />\n&#8220;★★★★★ As mentioned, Fantastic support. They took the time &amp; went the extra mile to assist me &amp; set me in the right direction on the implementation of the plugin.<br />\nTagembed is a best alternative to smash balloon, WPZoom social feed widget, Feed Them Social – Photo Galleries, 10websocial, spotlight social feeds, feedzy RSS Aggregator, Social Feed Gallery, Easy Social Feed – social photos gallery, Social Slider Feed, BlossomThemes Social Feed etc.<br />\nTo find out more about who we are &amp; what we do, here are some useful links:<br />\n<a href=\"https://tagembed.com/\" rel=\"nofollow ugc\">Tagembed official website</a><br />\n<a href=\"https://tagembed.com/blog\" rel=\"nofollow ugc\">Blogs</a><br />\n<a href=\"https://tagembed.com/inspiration-gallery/\" rel=\"nofollow ugc\">Inspiration Gallery</a><br />\nYou can read our <a href=\"https://tagembed.com/terms-of-service/\" rel=\"nofollow ugc\">Terms of Service</a> &amp; <a href=\"https://tagembed.com/privacy-policy/\" rel=\"nofollow ugc\">Privacy Policy</a> here.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/tagembed-widget.6.0.zip",
    "upgrade_notice": {
        "6.0": "<ul>\n<li>Performance and Security Enhancement.</li>\n</ul>",
        "5.9": "<ul>\n<li>Performance and Security Enhancement.</li>\n</ul>",
        "5.8": "<ul>\n<li>Bug Fixes &amp; some changes in code.</li>\n</ul>",
        "5.7": "<ul>\n<li>Merged Instagram and Instagram Business</li>\n</ul>",
        "5.6": "<ul>\n<li>Adding clarity to understand how users interactive with our plugin to improve userflow.</li>\n</ul>",
        "5.5": "<ul>\n<li>Bug Fixes &amp; some changes in code.</li>\n</ul>",
        "5.4": "<ul>\n<li>Bug Fixes &amp; some changes in code.</li>\n</ul>",
        "5.3": "<ul>\n<li>Bug Fixes &amp; some changes in code.</li>\n</ul>",
        "5.2": "<p>*Users need to signup now instead of auto account creation.</p>",
        "5.1": "<ul>\n<li>New: Inherit feature - to automatically align your website font style &amp; colors with widget.</li>\n</ul>",
        "5.0": "<ul>\n<li>New: Major chnages in the chat support widget for our users.</li>\n</ul>",
        "4.9": "<ul>\n<li>Bugs Fix for Instagram Feed, Facebook Feed, Twitter Feed, Google Reviews, Rss Feed, YouTube Gallery, &amp; more.</li>\n</ul>",
        "4.8": "<ul>\n<li>Fix Security Nounce - for Instagram Feed, Facebook Feed, Twitter Feed, Google Reviews, Rss Feed, YouTube Gallery, &amp; more.</li>\n</ul>",
        "4.7": "<ul>\n<li>New: Instagram Handle Feed - Now you can collect public Instagram Profile posts &amp; then embed Instagram Handle Feed on website.\n\n<ul>\n<li>New: Facebook Page Feed - Now you can collect public Facebook Page posts &amp; then embed Facebook Page Feed on website.</li>\n<li>New: Vivid Theme - Introducing New Vivid Theme to showcase your social media feed in colorful variations.</li>\n<li>Fix: Bugs fixed. Now social media feeds will load faster than before on website.</li>\n</ul></li>\n</ul>",
        "4.6": "<ul>\n<li>New: We have come up with some major networks &amp; features dedicatedly for our WordPress plugin users.\n\n<ul>\n<li>New: Airbnb Experiences Review - We are introducing a new connection method for our WordPress users where they can collect Airbnb reviews using a new connection type &quot;Airbnb Experiences&quot;.</li>\n<li>New: Slack Widget - Now you can showcase your slack feed to your website or screen using WordPress social media feed plugin.</li>\n<li>New: Vimeo Widget - Collect, curate, &amp; embed vimeo video on your WordPress website.</li>\n<li>New: Amazon Reviews - Introducing a new network Amazon Review widget for website. Now you can showcase your Amazon Product Reviews on your website to build trust among your potential users to make a decision directly from your website.</li>\n<li>New: Tripadvisor Review Widget - For all the travel advisors we are introducing a new network Tripadvisor review widget. Now you can showcase the reviews from Tripadvisor to your website for recommending better tour ideas with genuine users&#039; experiences.</li>\n<li>New: Aliexpress Review Widget - Aggregate reviews from your Aliexpress product page &amp; embed Aliexpress review directly to your website.</li>\n<li>Fix: We have updated the moderation panel. Earlier your expired feeds like Instagram Feed, Facebook Feed, Twitter Feed, YouTube Videos, Linkedin Feed, Vimeo Videos. Slack Feed, RSS feed etc couldn&#039;t be updated automatically. This fix will now automatically refresh your expired feeds.</li>\n<li>New: Introducing Analytics 2.0 for all the WordPress plugin users so that you can track the performance of your embedded widget.</li>\n</ul></li>\n</ul>",
        "4.5": "<ul>\n<li>Fix: Account management issue - After updating plugin when user is trying to access their feeds. With the new fix they will remain login still after updating the plugin.</li>\n</ul>",
        "4.4": "<ul>\n<li>New: Due to Twitter API update on 9th of Feb 2023 we have removed the twitter feed from free plan.\n\n<ul>\n<li>Fix: Cache issue with widgets like Instagram Feed, YouTube Gallery, Facebook Page, Instagram Gallery or Instagram page feed, Review Widget, Twitter Feed &amp; more.</li>\n<li>New: Soon introducing a new way to collect reviews for your businesses using Tagembed review widget where the review plugin users will be able to grab more reviews from their clients.</li>\n<li>Fix: Some minor bug fixes for Instagram Feed, YouTube Gallery, Facebook Page, Instagram page feed, Review Widget, Twitter Feed, Instagram Gallery &amp; more.</li>\n<li>Fix: Grid Theme fix for feed widgets where the collected feed was not loading properly.</li>\n</ul></li>\n</ul>",
        "4.3": "<ul>\n<li>New: New Networks such as Tiktok Videos, LinkedIn Hashtag, Flickr Feed, VK Album &amp; Instagram Stories are now added to the Tagembed social media WordPress Plugin so that user can create Tiktok Videos, Linkedln Hashtag, Flickr Feed, VK Album &amp; Instagram Stories directly from the plugin itself.\n\n<ul>\n<li>New: Analytics - Now review the performance of your embedded UGC gallery or social media feed widget to understand the impact of your social widget on your website.</li>\n<li>Fix: Speed optimization for fast loading of Instagram Feed, Twitter Feed, Google Reviews, RSS Feed, YouTube video, Google News RSS Feed, Facebook Page Feed, Instagram slider &amp; more.</li>\n<li>Fix: Optimization for themes like Instagram slider, Instagram carousel, Instagram Grid, Instagram Gallery, Instagram Wall, Instagram Story Themes &amp; etc.</li>\n<li>Fix: Optimization for themes like Facebook slider, Facebook carousel, Facebook Grid, Facebook Gallery, Facebook Wall, Facebook Page, Facebook Story Themes &amp; etc.</li>\n<li>New: Update new user flow to create feed faster.</li>\n</ul></li>\n</ul>",
        "4.2": "<ul>\n<li>New: Show More Feature - We have introduced a new show more feature under the footer settings that you can customize with your own preferred language. Making your native visitors easy to access &amp; explore.\n\n<ul>\n<li>New: Trim Content - Now you can trim content as per your requirement for captions, making the feed look beautiful.</li>\n<li>Fix: Fixed Private Post Expiry Issues</li>\n</ul></li>\n</ul>",
        "4.1": "<ul>\n<li>Fix: Now easily embed on Elementor, Vamtam etc themes using Iframe Code or Short Code.\n\n<ul>\n<li>New: Introducing full-flash JS Code so that you can easily embed widget on your website for making the social media widget plugin SEO friendly.</li>\n<li>Fix: Fixed Tagembed Block Issue for wordpress themes. Tagembed block was not visible when users try to embed Instagram Feed, mastodon feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Video, RSS Feed, Instagram Slider, Facebook Page, Twitter Widget, social media wall, Instagram Gallery, Insta widget etc.</li>\n</ul></li>\n</ul>",
        "4.0": "<ul>\n<li>New: Introducing Lite Code (JS Code Beta).</li>\n</ul>",
        "3.10": "<ul>\n<li>Fix: Tested &amp; fixed issue for Social Media Plugin.</li>\n</ul>",
        "3.9": "<ul>\n<li>Fix: Tested &amp; fixed issue for Social Media Plugin.</li>\n</ul>",
        "3.8": "<ul>\n<li>Fix: Tested &amp; fixed issue for Social Media Plugin.</li>\n</ul>",
        "3.7": "<ul>\n<li>Fix: JS code is now loaded from a local file shipped within the plugin rather than an external CDN for use with the customizer in the admin area. So all files will be loaded from within the plugin.</li>\n</ul>",
        "3.6": "<ul>\n<li>Fix: Fixed Reconnecting - An account now results in deleting the original connection in the database &amp; adding a new one. This will prevent issues with some systems caching. No More Updating Issues with Facebook, Instagram, Twitter, Youtube, Google Reviews, RSS Aggregator &amp; more.</li>\n</ul>",
        "3.5": "<ul>\n<li>Fix: Tested &amp; fixed for a third party plugin that was causing issue will creating Instagram Feed, Facebook Feed, Google Reviews, Twitter Feed, YouTube Channel Video, FB Page, RSS Feed using Tagembed Social Media WordPress Plugin.\n\n<ul>\n<li>Fix: Tested &amp; fixed for the WordPress media library that was causing image alignment issue when user is creating feed.</li>\n<li>Fix: Fixed Issue with the plugin auto-upadte icon that keeps on rotating even though the plugin is up-to-date.</li>\n<li>Fix: Now when you add Fb Page, Fb feed, Fb album, Insta feed, Insta Hashtag, Twitter Feed, Google Reviews &amp; more on your widget it will be displayed in a new refreshed view with some technical glitches fixed.</li>\n</ul></li>\n</ul>",
        "3.4.1": "<ul>\n<li>Fix: We have tested &amp; made fix for the new WordPress version 6.1 for all of our social feed such as Instagram Feed, Facebook Feed, Twitter Feed, Linkedin Feed, YouTube Video, Pinterest Feed, Yelp Reviews, Airbnb Reviews, Google Reviews, &amp; more.</li>\n</ul>",
        "3.4": "<ul>\n<li>Fix: API update for Instagram Reels. Now you can collect Instagram Reels feed by just connecting your Instagram Handle Account &amp; in a few seconds Instagram Reels will appear. Earlier there was a bug that doesn&#039;t allow every user to collect Instagram Reels &amp; would fail to fetch Instagram Reels.\n\n<ul>\n<li>New: Earlier when you wanted to embed Instagram Feed, Twitter Feed, Facebook Feed, Linkedin Feed, Pinterest Feed, RSS Feed, YouTube Videos, Google Reviews etc you need to copy the shortcode that was easy but some also needed HTML code or iFrame code that could allow more possibility to embed Instagram Feed, Twitter Feed, Facebook Feed, Linkedin Feed, Pinterest Feed, RSS Feed, YouTube Videos, Google Reviews. With this update we have included HTML code &amp; iFrame Code for all users.</li>\n<li>New: Linkedin Profile - Now you can collect Linkedin Feed using new method that is Linkedin Profile that allows you to collect Linkedin Feed from your personal Linkedin Profile in just a click.</li>\n</ul></li>\n</ul>",
        "3.3": "<ul>\n<li>New: Introducing new social media feed source, Tumblr. Now you can collect Tumblr Feed, customize &amp; curate theme &amp; then embed Tumblr Feed on WordPress.\n\n<ul>\n<li>New: Introducing new social media feed source, Yelp. Now you can collect Yelp Review Feed, customize &amp; curate theme &amp; then embed Yelp Reviews on WordPress website in just a few clicks.</li>\n<li>New: Introducing new social media feed source, Capterra. Now you can collect Capterra Review Feed, customize &amp; curate theme &amp; then embed Capterra Reviews on WordPress website in just a few clicks.</li>\n<li>New: Introducing new social media feed source, Etsy. Now you can collect Etsy Review Feed, customize &amp; curate theme &amp; then embed Etsy Reviews on WordPress website in just a few clicks.</li>\n<li>Update: Custom CSS issues fix. Earlier when you collect Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews &amp; YouTube Videos, the Custom CSS wouldn&#039;t be applied in it but now with the issue fix you can easily collect Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Videos &amp; add your custom CSS code to make it more astonishing.</li>\n<li>Update: Facebook Carousel Post issue fix. Earlier when you collect Facebook Feed, the Facebook Post with multiple Facebook images in it wouldn&#039;t be displayed as one but now with this update you view multiple Facebook Posts in one as a Facebook Carousel.</li>\n<li>Update: Linkedin Carousel Post issue fix.   * Update: Instagram Carousel Post issue fix.  * Update: Instagram Slider Post issue fix. Earlier when you collect Instagram Feed, the Instagram Post wouldn&#039;t be displayed as a Instagram Slider due to the missing Instagram Slider button but now with this update you display Instagram Slider precisely in a Slider.</li>\n<li>Update: Twitter Carousel Post issue fix. Earlier when you collect Twitter Feed, the Twitter Post with multiple Twitter images in it wouldn&#039;t be displayed as one but now with this update you view multiple Twitter Posts in one as a Twitter Carousel.</li>\n<li>New: Card Style customization update.</li>\n</ul></li>\n<li>Content Alignment - Align your card&#039;s content in three different style (Left, Right, Center) for Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews &amp; YouTube Videos etc.</li>\n<li>Trim Content - Trim the content of your widget to a certain character so that the feed doesn&#039;t look absurd.</li>\n<li>Aspect Ratio - Set aspect ratio as per your post ratio to match the aesthetic of your post style &amp; website.</li>\n<li>Theme Mode - Make your card more interactive &amp; less-straining with the latest trends. Dark &amp; Light Mode is now available for all social media feeds</li>\n<li>Card Curve - Flaunt the view of your card with 3 different edge styles of curvness based on your website block theme. Hence widget will look ashtonishing with square, or round edges.\n\n<ul>\n<li>NOTE: Tested Instagram Feed, Facebook feed, Twitter Feed, Instagram Slider, YouTube video, Pinterest Feed, Facebook Page feed, YouTube Gallery, News RSS Feed &amp; all other.</li>\n</ul></li>\n</ul>",
        "3.2": "<ul>\n<li>New: Now choose your personalized card style  according to your website requirement.\n\n<ul>\n<li>New: Introducing extra customization option into the plugin so that widget look astonishing &amp; also blends perfectly with your website.</li>\n<li>FIX: Alignment of the profile info was not calibrated properly. Now, profile information for widget will be displayed in proper alignment.</li>\n<li>FIX: Twitter Feed, Facebook feed, Youtube Video, Instagram Feed: Small bugs fixes for Twitter Feed, Facebook feed, YouTube Video &amp; Instagram Feed.</li>\n<li>FIX: Instagram Feed, Twitter feed, Facebook feed, Facebook reviews, youtube video caching for faster delivery.</li>\n<li>NOTE: Tested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed &amp; all other with WordPress Version 6.0</li>\n</ul></li>\n</ul>",
        "3.1": "<ul>\n<li>New: Now choose what happens when you click when you Embed Instagram Feed, Embed Facebook Feed, Embed Twitter Feed, Embed Google Reviews, Embed YouTube Video, Embed RSS Feed etc. Want to redirect them to the specific social platform or open pop-up or no action, based on your requirement.\n\n<ul>\n<li>New: Introducing custom CSS option into the plugin. Now make custom style of your widget so that your widget, look astonishing &amp; also blends perfectly with your website theme.</li>\n<li>FIX: Twitter Feed: Alignment of the profile info was not calibrated properly. Now, profile information for your Twitter Feed will be displayed in proper alignment.</li>\n<li>FIX: Youtube Video, Instagram Feed: Small bugs fix for YouTube Shorts &amp; Instagram Feed.</li>\n<li>FIX: Instagram Feed caching.</li>\n</ul></li>\n</ul>",
        "3.0": "<ul>\n<li>New: Now choose your custom layout from the customize tab. You can set your desired number of rows &amp; columns for your widget directly from the plugin. Earlier there was no such option.\n\n<ul>\n<li>New: Make your personalized card style using the new card settings option under the customize tab. You can set to display or hide author details, content, font style &amp; many more directly from the plugin.</li>\n<li>FIX: Instagram Feed: Alignment of the profile info was not calibrated properly. Now, profile information for your Instagram Feed will be displayed in proper alignment.</li>\n<li>FIX: Twitter Feed: Small bugs fix for Twitter Hashtag Feed.</li>\n<li>FIX: YouTube Feed caching.</li>\n<li>NOTE: Tested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed &amp; all other with WordPress Version 5.9.3</li>\n</ul></li>\n</ul>",
        "2.9": "<p>Bugs Fix for Linkedin Feed, Instagram Feed, Facebook Feed, Twitter Feed, Youtube Gallery, &amp; Google Reviews. Also, now users can add several Linkedin posts using Linkedin Widget directly from the Tagembed Social Media Feed WordPress Plugin to WordPress site.</p>",
        "2.8": "<p>Introducing more ways to embed Instagram Feed on WordPress website such as: Instagram TV or IGTV, Instagram Reels, Instagram Stories, Instagram Mentions, &amp; Instagram Tagged Feeds into your Instagram Widget, directly using Tagembed Social Media Feed WordPress Plugin.\n  Minor Bugs Fix for Facebook Feed, Twitter Feed, Youtube Gallery, Google Reviews &amp; Linkedin Feed.\n  Earlier there was a bug which wouldn&#039;t let user to collect all of the latest Facebook Feed, Twitter Feed, Youtube Gallery, Google Reviews &amp; Linkedin Feed. Now, with the new update not only users will be able to collect Instagram Feed using different method but also all of the latest social feeds from Facebook Feed, Twitter Feed, Youtube Gallery, Google Reviews &amp; Linkedin Feed will be collected in the Facebook Widget, Twitter Widget, YouTube Widget, Google Review Widget &amp; Linkedin Widget, repectively.\n  Tested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed &amp; all other with current wordpress version.</p>",
        "2.7": "<p>Fixed PHP warnings &amp; notices &amp; tested upto wordpress 2.9 version.\n  Fixed bugs for Instagram Slider, Facebook Feed, Youtube Gallery,  Twitter Feed, Instagram Stories, Google Reviews &amp; Pinterest.\nInstagram feed: Now connect Instgaram account easily.\nTested Instagram Feed, Facebook feed, Twitter Feed, YouTube video, Pinterest Feed &amp; all other with current wordpress version.</p>",
        "2.6": "<ul>\n<li>Fixed Bugs for Facebook Feed, Facebook Widget, Instagram Feed &amp; Instagram Widget &amp; Improved Design for Twitter Feed, Twitter Widget, YouTube Video &amp; YouTube Gallery.</li>\n</ul>",
        "2.5": "<ul>\n<li>Now Display LinkedIn Feeds in Linkedin Widget, Youtube Videos &amp; Youtube Shorts in YouTube Gallery &amp; embed on website.</li>\n</ul>",
        "2.4": "<ul>\n<li>Introducing New Features to Display social media Feeds according to your need.\n\n<ul>\n<li>Earlier Instagram Feed, YouTube Videos, Twitter Feed, Facebook feed cannot be pinned to top or highlighted. Now you Pin the post to the top, or Highlight Instagram Feed, Twitter Feed, YouTube Video, Facebook Feed.</li>\n</ul></li>\n</ul>",
        "2.3": "<ul>\n<li>Fixed Bugs for Instagram Feeds &amp; Improved Design for Instagram Feed display. Earlier Instagram Feed pop-up was not responsive &amp; Instagram pop-up used to shrink automatically. Now Instagram pop-up is responsive &amp; Instagram feed featured pop-up is not shrinking.\nFixed Twitter Feed Bugs &amp; Improved Social Media Widget Design.\nFix - Instagram API updated: Instagram connection method update for more smooth connection of Instagram with the plugin to collect Instagram Feed.\nFix - Facebook cache optimize, now your collected Facebook feed will view more promising then before after you embed Facebook feed on website.\nNew - Instagram IGTV: Introducing Instagram IGTV as a connection method to collect Instagram feed from Instagram as a Instagram IGTV method. Now embed Instagram TV video on your website.</li>\n</ul>",
        "2.2": "<p>Fixed Facebook Feed, YouTube Gallery, Instagram Feed Bugs &amp; Improved Facebook Widget Design.\n  New - Instagram Stories: Introducing Instagram Stories in Instagram connection method so that you can embed Instagram Stories on your website from your Instagram Handle. Just enter your Instagram Handle &amp; get all of your Instagram Stories in the Instagram Widget.\n  New - Twitter Hashtag: Introducing Twitter Hashtag in Twitter connection method so that you can embed Twitter hashtag on your website from your Twitter. Just enter your trending Twitter hashtag &amp; get all of your Twitter Hashtag feed in the Twitter Widget.\n  New - Facebook Handle: Introducing Facebook Handle in Facebook connection method so that you can embed Facebook Feed on your website from your Facebook Profile. Just connect your Facebook feed &amp; get all of your Facebook feed in the Facebook Widget.\n  New - New Gallery Theme for Instagram Feed, YouTube Video, Twitter Feed, Facebook feed, pinterest feed.\n  New - New Classic carousel theme for Google Review, Trustpilot reviews, Tripadvisor reviews, etsy reviews, airbnb reviews, yelp reviews, facebook reviews, Instagram Feed, YouTube Video, Twitter Feed, Facebook feed, pinterest feed &amp; more.\n  Fix - Cache optimized for Google Review, airbnb reviews, yelp reviews, facebook reviews, Instagram Feed, YouTube Video, Twitter Feed, Facebook feed, pinterest feed.</p>",
        "2.1": "<p>Added Powerful Filter Section. Choose the best social media feeds to display on your website. You can filter your collected Instagram Feed, Facebook Feed, Twitter Feed, YouTube Video &amp; etc social media feeds based on the feed Post type such as images, videos, text. You can also public or private collected social media feeds.\n  New - Instagram Reels: Introducing Instagram Reels conection method. Now you can add Instagram Feed to your Instagram Widget &amp; finally embed Instagram Feed from Instagram Reels connnection method. Just enter the Instagram Handle name into the Instagram Reels section &amp; all of your Instagram Reels video will be collected in the Instagram widget.\n  Fix - YouTube Channel access token refresh: Now embed YouTube channel videos that is playable on a pop-up or can be redirected to YouTube.\n  Fix - Facebook Feed Access token refresh: Facebook Feed connection will not fail like it was before for Facebook Page.\n  New - YouTube Shorts: Introducing YouTube Shorts in YouTube connection method so that you can embed YouTube Shorts on your website from your YouTube Channel.</p>",
        "1.9": "<p>Fixed Bugs for Instagram Hashtag Feed &amp; Improved Design for Twitter Hashtag Feed. Now you can add Instagram Feed from any Instagram Hashtag to your Instagram Widget. Also Twitter Feed got new design, when you collect Twitter Hashtag Feed it was showing some glitches in design but now Twitter feed is stable.\n  New - Twitter Hashtags: Introducing Twitter Hashtags, Now you can add Twitter Hashtag Feed to your Twitter Widget &amp; finally embed Twitter Feed from Twitter Hashtag connnection method.\n  New - YouTube Channel: Introducing YouTube Channel connection method. Now you can add YouTube Channel Video Feed to your YouTube Widget &amp; finally embed YouTube Feed from YouTube Channel connnection method.\n  Fix - Instagram Access Token: Instagram Hashtag Access Token Refresh fix.\n  Fix - Instagram Access Token: Instagram Handle Access Token Refresh fix.\n  Fix - Instagram Access Token: Instagram Business Account Access Token Refresh fix from Facebook.</p>",
        "1.8": "<p>Easily Manage your plans within Wordpress Dashboard. Now you can subscribe to Tagembed Plans for accessing extra social networks on the dashboard itself.\n  New - Introducing Classic Card Theme. It is slighty round from edges &amp; makes a perfect view for your widget.\n  Fix - Access Token Refresh issue resolved for Instagram. Now Instagram access token get validate successfully for Instagram Handle.\n  New - Introducing Instagram Hashtags, Now you can add Instagram Hashtag Feed to your Instagram Widget &amp; finally embed Instagram Feed from Instagram Hashtag connnection method.\n  New - Introducing Twitter Mentions, Now you can add Twitter Mention Feed to your Twitter Widget &amp; finally embed Twitter Feed from Twitter Mention connnection method.</p>",
        "1.7": "<p>New - Instagram Tagged: Introducing Instagram tagged connection type to collect Instagram Tag posts on your Instagram Widget. Finally, you can embed Instagram feed with Instagram Tag posts to your wordpress website.\n  Fix - Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews - layouts.\n  New - Twitter favorites: Introducing Twitter favorites: Now you can collect Twitter Feed using Twitter Favorite connection method to your Twitter widget &amp; embed twitter feed on website.</p>",
        "1.6": "<p>Making the world&#039;s easiest Social media feeds plugin for wordpress. Now create &amp; manage social media feeds directly from your wordpress dashboard &amp; chat directly to our experts for any support.\n  Fix - Access Token Refresh for Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews.\n  Fix - Access Token Refresh for 2nd feed created in a widget for all Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews.\n  Fix - Cache Issue resolved of 2nd widget if created using Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews.</p>",
        "1.5": "<p>Fix - Bugs Fixes for YouTube video &amp; YouTube playlist: Now you can create YouTube Gallery using new themes &amp; layouts. Also YouTube video can be added in YouTube Gallery from any playlist.\n  Fix - Bugs Fixes for Instagram Feed, Twitter Feed, Facebook Feed, YouTube Playlist, Google Reviews.\n  New - Introducing custom posts feature to add custom Instagram Feed, custom Facebook Feed, custom Twitter Feed, custom Google Reviews Feed, custom Pinterest Feed, custom YouTube Feed, etc.\n  Fix - Miscellaneous styling for Instagram Feed, Facebook feed, Twitter feed, YouTube feed, Google Reviews.</p>",
        "1.4": "<p>Fix - Bugs Fixes for Youtube channel video: Earlier when collecting Youtube Videos, YouTube Channel wasn&#039;t properly added. Now after fix you can add youtube video &amp; create a Youtube Gallery using any YouTube Channel.\n  Fix - Bugs Fixes for Instagram Feed, Twitter Feed, Facebook Feed, YouTube Themes &amp; Layouts.\n  Fix - Cache optimized for Instagram Feed, Twitter Feed, Facebook Feed, Google Reviews, YouTube Feed.\n  New - Introducing Modern Card Theme for theme\n  New - Introducing option to upload profile picture.</p>",
        "1.3": "<p>Fix - Fixed Instagram Feed Bugs &amp; Improved Facebook Feed, Google Reviews Design.\n  Fix - Layout loading is fixed. Now your widget will display in the proper alignment.\n  New - Introducing Instagram Mentions to collect content for your Instagram feed.</p>",
        "1.2": "<p>New - Improved Design for the better view of the Instagram Feed, Twitter Feed, Google Review &amp; Facebook Feed in Plugin.\n  New - Now you can collect Instagram Feed &amp; filter Instagram Feed as per your requirements. Not only that but you can also add Instagram Feed to your Instagram Widget &amp; switch between different themes &amp; layouts to make your Instagram Feed best suit your website.\n  New - Collect Twitter Feed &amp; filter Twitter Feed as per your requirements. Not only that but you can also add Twitter Feed to your Twitter Widget &amp; choose between different themes &amp; layouts to make your Twitter Feed best suit your website style.\n  Fix - Cache problem is fixed now that will allow you to load your Instagram Feed, Facebook Feed, Twitter Feed, YouTube Feed, Google Review Feed faster on your website.</p>",
        "1.1": "<p>Fix - Fixed Bugs for Linkedin Post, Instagram Feed &amp; Facebook Feed also Improved Design for the better view of the plugin.</p>",
        "1.0": "<ul>\n<li>First Release - This is the first release of Tagembed Social Media Feeds WordPress Plugin. If you find any issues, please contact us on <a href=\"https://tagembed.com/contact-us/\">tagembed.com</a></li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/tagembed-widget/assets/screenshot-1.png?rev=3040127",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/tagembed-widget/assets/screenshot-2.png?rev=3040127",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/tagembed-widget/assets/screenshot-3.png?rev=3040127",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/tagembed-widget/assets/screenshot-4.png?rev=3040127",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/tagembed-widget/assets/screenshot-5.png?rev=3040127",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/tagembed-widget/assets/screenshot-6.png?rev=3040127",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/tagembed-widget/assets/screenshot-7.png?rev=3040127",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/tagembed-widget/assets/screenshot-8.png?rev=3040127",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/tagembed-widget/assets/screenshot-9.png?rev=3040127",
            "caption": ""
        }
    ],
    "tags": {
        "facebook": "facebook",
        "google-reviews": "Google Reviews",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "twitter": "twitter"
    },
    "stable_tag": "6.0",
    "versions": {
        "3.10": "https://downloads.wordpress.org/plugin/tagembed-widget.3.10.zip",
        "3.9": "https://downloads.wordpress.org/plugin/tagembed-widget.3.9.zip",
        "4.0": "https://downloads.wordpress.org/plugin/tagembed-widget.4.0.zip",
        "4.1": "https://downloads.wordpress.org/plugin/tagembed-widget.4.1.zip",
        "4.2": "https://downloads.wordpress.org/plugin/tagembed-widget.4.2.zip",
        "4.3": "https://downloads.wordpress.org/plugin/tagembed-widget.4.3.zip",
        "4.4": "https://downloads.wordpress.org/plugin/tagembed-widget.4.4.zip",
        "4.5": "https://downloads.wordpress.org/plugin/tagembed-widget.4.5.zip",
        "4.6": "https://downloads.wordpress.org/plugin/tagembed-widget.4.6.zip",
        "4.7": "https://downloads.wordpress.org/plugin/tagembed-widget.4.7.zip",
        "4.8": "https://downloads.wordpress.org/plugin/tagembed-widget.4.8.zip",
        "4.9": "https://downloads.wordpress.org/plugin/tagembed-widget.4.9.zip",
        "5.0": "https://downloads.wordpress.org/plugin/tagembed-widget.5.0.zip",
        "5.1": "https://downloads.wordpress.org/plugin/tagembed-widget.5.1.zip",
        "5.2": "https://downloads.wordpress.org/plugin/tagembed-widget.5.2.zip",
        "5.3": "https://downloads.wordpress.org/plugin/tagembed-widget.5.3.zip",
        "5.4": "https://downloads.wordpress.org/plugin/tagembed-widget.5.4.zip",
        "5.5": "https://downloads.wordpress.org/plugin/tagembed-widget.5.5.zip",
        "5.6": "https://downloads.wordpress.org/plugin/tagembed-widget.5.6.zip",
        "5.7": "https://downloads.wordpress.org/plugin/tagembed-widget.5.7.zip",
        "5.8": "https://downloads.wordpress.org/plugin/tagembed-widget.5.8.zip",
        "5.9": "https://downloads.wordpress.org/plugin/tagembed-widget.5.9.zip",
        "6.0": "https://downloads.wordpress.org/plugin/tagembed-widget.6.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/tagembed-widget.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://tagembed.com/",
    "banners": {
        "low": "https://ps.w.org/tagembed-widget/assets/banner-772x250.jpg?rev=2832110",
        "high": "https://ps.w.org/tagembed-widget/assets/banner-1544x500.jpg?rev=2832110"
    },
    "icons": {
        "1x": "https://ps.w.org/tagembed-widget/assets/icon-256x256.png?rev=2832110",
        "2x": "https://ps.w.org/tagembed-widget/assets/icon-256x256.png?rev=2832110"
    },
    "blocks": {
        "tagembed-block/tagembed": {
            "name": "tagembed-block/tagembed",
            "title": "Tagembed Widget"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 80,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}