{
    "name": "Triggerbee",
    "slug": "triggerbee",
    "version": "2.0",
    "author": "Triggerbee",
    "author_profile": "https://profiles.wordpress.org/triggerbee/",
    "contributors": {
        "triggerbee": {
            "profile": "https://profiles.wordpress.org/triggerbee/",
            "avatar": "https://secure.gravatar.com/avatar/94a515f375673a1f93a0b2d170ebd2f8?s=96&d=monsterid&r=g",
            "display_name": "triggerbee"
        }
    },
    "requires": "4.6",
    "tested": "6.3.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/triggerbee/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 30,
    "downloaded": 2734,
    "last_updated": "2023-09-25 12:24:00",
    "added": "2018-03-19",
    "homepage": "https://triggerbee.com/",
    "sections": {
        "description": "<p>🐝 Create personalized popups, sign-up forms, and surveys with Triggerbee &#8211; no code needed. Just design, publish, and grow your business! 🚀</p>\n<h3>Get Up To 300% More Members and Subscribers By Improving Your Customer Experience</h3>\n<p><a href=\"https://triggerbee.com/?utm_source=wordpress&amp;utm_medium=website&amp;utm_campaign=plugin\" rel=\"nofollow ugc\">Triggerbee</a> is a personalization platform that allows you to communicate with your visitors based on their personal preferences. Imagine only giving out discount codes to the customers most likely to buy, and guiding them through a tailored journey that keeps them engaged and coming back for more. Triggerbee empowers you and your team to create extraordinary customer experiences that boost your customer lifetime value without having to ramp up ad spend or wait weeks just to make a small change on your website. It&#8217;s just that easy!</p>\n<p>Triggerbee lets you build beautiful popups and campaigns within minutes, to give you more email subscribers, increase sales, and grow your business. Unlike other popup tools, Triggerbee also allows you to select when, where, and who should see the campaign &#8211; giving the right message, to the right recipient, at the right time and avoiding any unnecessary interruptions. </p>\n<p>Integrate with your CRM to follow your customers online interactions, build segments based on website behavior and target them with different messages depending on where they are in the customer journey.</p>\n<blockquote><p>&#8220;The conversion rate for the campaign reached 8.62%. We increased the number of pages per session by 23.01% and the average session length by 14.47% compared to the previous period.&#8221;<br />\n    &#8211; Valter Arnborg, eCommerce Manager @ Flowlife</p></blockquote>\n<h3>Triggerbee App</h3>\n<p>Triggerbee is a software platform and requires a Triggerbee account. If you already have an account, simply activate the plugin and you&#8217;re good to go. If not, <a href=\"https://www.triggerbee.com?utm_source=wordpress&amp;utm_medium=website&amp;utm_campaign=plugin\" rel=\"nofollow ugc\">you can sign up here</a> for your free trial! We offer a range of pricing plans, and all of them start off with a free trial period with everything included. You&#8217;ll be collecting new subscribers within a couple of minutes after signing up! </p>\n<blockquote><p>&#8220;Triggerbee is my favorite tool! It has helped us to build a larger fanclub, increase engagement among visitors and allowed us to get more visits from newsletters to the website.<br />\n    &#8211; Erica Terranova, Growth Marketing Lead @ All things Commerce</p></blockquote>\n<p>Get to know your visitors and segment them on behavior- and customer data</p>\n<p>Track and identify individual customers and their visit behavior on your website. Build customer profiles progressively to identify your visitors and sync data with your CRM. Triggerbee will let you know where your visitors are coming from, what they are doing, what they are interested in &#8211; and who they are. </p>\n<p>Combine the data you have in your CRM with first-party data from Triggerbee to create audiences you have never before been able to reach on your website. </p>\n<ul>\n<li><strong>All new and unidentified visitors</strong> &#8211; Greet your new visitors with a welcome offer to nudge them into that first purchase</li>\n<li><strong>Returning Customers</strong> &#8211; Welcome returning customers back and ask them if they liked their last purchase, or if they wish to add information to their profile </li>\n<li><strong>Visitors that left their cart</strong> &#8211; Convert leaving visitors into customers with an Exit Intent offer</li>\n<li><strong>Logged-out Members</strong> &#8211; Remind logged-out members to log in to access their personal offers</li>\n<li><strong>Visitors interested in women&#8217;s clothing</strong> &#8211; Promote your current offers in women&#8217;s clothing to the visitors that are most likely to buy something in that category</li>\n<li><strong>Members with unused discount codes</strong> &#8211; Remind members with unused discounts or offers to use them when visiting your website</li>\n<li><strong>Members with upcoming birthdays</strong> &#8211; Congratulate your members with upcoming birthdays with a special offer or a simple &#8220;happy birthday&#8221; message</li>\n<li><strong>Influencer Greeting</strong> &#8211; For visitors coming to your website through an Influencer UTM-link, greet them with a personal hello from that influencer to create an omnichannel feeling</li>\n<li>.. and many more!</li>\n</ul>\n<blockquote><p>&#8220;Triggerbee collects behaviour- and zero-party data about your customers, which is a game-changer in terms of who we can target on our website.&#8221; &#8211; Flowliferiggerbee is not just about popups, it&#8217;s much more than that. From personalizing based on behaviour to data enrichment in our other systems, which other competitors didn&#8217;t have.&#8221;<br />\n    &#8211; Flowlife</p></blockquote>\n<h3>Easily create relevant and eye-catching campaigns</h3>\n<p>Create and publish personalized offers, surveys, and forms directly to your website with our no-code editor. Browse from hundreds of templates, or build your own to fit your needs. All campaigns come in a variety of styles, layouts, and features. </p>\n<ul>\n<li><strong>Acquisition Campaigns for new visitors</strong> &#8211; Acquiring new subscribers or members is the most profitable we can do as an eCommerce. Triggerbee allows you to create signup forms or promote membership through overlays and/or embedded campaigns, making it possible to capture as many new leads as possible while still being discreet when needed.</li>\n<li><strong>Pre-launches &amp; Raffles</strong> &#8211; An effective alternative to offering discount codes upon signup is offering pre-access to an upcoming release or conducting competitions or raffles. </li>\n<li><strong>Increase Login Rates</strong> &#8211; By combining data from the CRM and the Triggerbee website data, it is possible to display messages on-site to push or guide visitors to achieve desired outcomes. For instance, it is possible to promote members (CRM data) that are logged out (Triggerbee data) to log in to utilize their promotions and offers</li>\n<li><strong>Remind about unused offers and discounts</strong> &#8211; All of your customers might not see that newsletter or text message you sent about their discount. Instead, remind them when they are on your website and closer to that purchase</li>\n<li><strong>Promote current campaigns and offers</strong> &#8211; Promote ongoing campaigns onsite through embedded top panels or in bigger popups to maximize sales during the campaign period. Also, perfect timing to add a deadline component for that extra FOMO feeling. </li>\n<li><strong>Data enrichment for returning members</strong> &#8211; For returning visitors, Triggerbee can display a different message to enrich the member profile, by asking for their phone number, birthday, or favorite brand for instance. This approach will allow you to collect zero-party data, which is extremely powerful in further communication and segmentation.</li>\n<li><strong>Create Omni channel campaigns with UTM-targeting</strong> &#8211; For returning visitors, Triggerbee can display a different message to enrich the member profile, by asking for their phone number, birthday, or favorite brand for instance. This approach will allow you to collect zero-party data, which is extremely powerful in further communication and segmentation.</li>\n<li><strong>Gamification</strong> &#8211; prolong your marketing efforts in social media on your website by targeting visitors coming from specific UTM tags. </li>\n<li><strong>Guides</strong> &#8211; If higher engagement is important to your brand, gamification might be something to look into! Allow visitors to search for hidden eggs for easter, or spin the wheel to surprise them with a discount. Perfect for raising engagement while being creative and fun. </li>\n<li><strong>Rescue abandoned carts</strong> &#8211; An exit intent is triggered when a visitor tries to leave a website, usually when they have something in their cart already. Exit Intent campaigns can be used to offer discounts, coupons, or free shipping in order to entice the visitor to stay on the site and make a purchase. They can also be used to capture email addresses for future marketing efforts.</li>\n<li><strong>Birthday Campaigns</strong> &#8211; Congratulate your members with upcoming birthdays, with a discount code or just a simple Happy Birthday! Who doesn&#8217;t love that? </li>\n<li><strong>Questionnaires</strong> &#8211; With Triggerbee Surveys and multi-step Forms, it is possible to create feedback forms, questionnaires, and contact forms within minutes.</li>\n<li><strong>Back in Stock</strong> &#8211; If you have a smaller collection of products and sometimes run out of stock, you can allow visitors to be reminded when that product is back Triggerbee will collect a list of emails for that particular product for you to email when it&#8217;s back in stock</li>\n<li><strong>Take care of returning non-purchasers</strong> &#8211; To get new visitors to complete that first purchase is an obstacle we all need to get past. A great way of targeting that obstacle is by offering returning visitors something a little extra, like a discount or free delivery. This is especially powerful in combination with targeting interest profiles or UTM sources. </li>\n<li><strong>Referral Marketing</strong> &#8211; Allow visitors to recommend your brand or specific products to their friends. </li>\n<li>And much more!</li>\n</ul>\n<blockquote><p>&#8220;Triggerbee has allowed us to capture new club members and email subscribers, but also to increase the use of bonuschecks and personal offers. I like the simplicity of creating and designing campaigns in Triggerbee, and have recieved helpful advice and support from my contact person.&#8221;<br />\n    -Tiina Tauru, Online visual merchandiser @ Kicks</p></blockquote>\n<h3>Survey loyalty and customer satisfaction</h3>\n<p>Conducting <a href=\"https://help.triggerbee.com/article/526-surveys\" rel=\"nofollow ugc\">Surveys</a> directly on the website based on behavior or audience is an easy and effective way of getting to know your customers. This allows you to improve the purchase experience and decrease any thresholds. Triggerbee allows you to build and design your surveys freely with both survey- and form elements and will present the results in a dashboard. All data that is collected via Triggerbee Forms or Surveys can easily be sent to your CRM or email tool.</p>\n<ul>\n<li><strong>NPS</strong> &#8211; The Net Promoter Score is a score that measures the willingness of customers to recommend a company&#8217;s products or services to others. It is an indicator of users&#8217; overall satisfaction with your product or service and the users&#8217; loyalty to your brand. Triggerbee has a specific NPS Dashboard which will display your NPS score in real-time and historically.</li>\n<li><strong>CSAT</strong> &#8211; CSAT is used to measure how satisfied the customer is with a product, service, meeting, or your company&#8217;s service. It is a metric that is perfect for finding out what your customer thinks about a specific part of your offer. The CSAT is usually measured on a five-point scale with smileys, stars, or numbers. For the CSAT, Triggerbee has a specific dashboard that displays your CSAT score in real-time and historically.</li>\n<li><strong>Pre- and post-purchase Surveys</strong> &#8211; Other types of surveys that are common for eCommerce are about evaluating why a purchase wasn&#8217;t completed, how the visitor found the website, feedback on new designs, etc. Here are a few examples!</li>\n</ul>\n<h3>Not a big fan of popups? Try embedded content!</h3>\n<p>When thinking about onsite messaging, most of us tend to think about popups. While the old classic popup is a great conversion tool, it is not always the best approach for your brand. Introducing &#8211; <a href=\"https://help.triggerbee.com/article/505-embedded-campaigns\" rel=\"nofollow ugc\">Embedded Content</a>. With Triggerbee, you can inject your campaigns into your website, instead of having them laying on top of it. Either add content or replace current content depending on who is visiting your website. Cool, huh? </p>\n<p>Simply design your campaign as you wish, and select where in your HTML to render the campaign, and we will fix the rest! This is perfect for Newsletter Forms in the footer, signup- or survey forms on specific landing pages, promotions on the PDP, and discrete top panels with your current site-wide offers. </p>\n<blockquote><p>&#8220;Recruiting new members has become easier, and helped with the increase of redeeming personal offers. We are able to remind customers about their bonus checks, thus driving conversion rates within purchases as well.&#8221;<br />\n    &#8211; KICKS Marketing team </p></blockquote>\n<h3>Detailed targeting to help you reach exactly the right people at the right time</h3>\n<p>Not only does Triggerbee allow targeting based on who your visitors are, but we also target our campaigns based on where they are coming from, what they are doing, and in what order they are doing it. For instance, you can display a campaign on a specific URL for all visitors that have visited your site 3+ times in a specific geolocation, when they have something in their cart. All of this is done directly in our UI. Amazing to say the least!</p>\n<p>All Triggerbee campaigns come with this advanced website targeting and behavior-based personalization, making them highly effective for improving your subscription- and member signups as well as your sales.</p>\n<h4>Audience and website Targeting </h4>\n<ul>\n<li><strong>CRM Targeting</strong> &#8211; reuse your already existing segments from your CRM on the website. Target those newcomers, soon-to-be churns, birthday girls, and loyal customers with targeted messages.</li>\n<li><strong>Identification level</strong> &#8211; Triggerbee has built-in audiences for all unidentified and all identified visitors, making it easy to quickly target the right audience.</li>\n<li><strong>Geolocation</strong> &#8211; target visitors in specific countries or regions</li>\n<li><strong>Interest Profiles</strong> &#8211; target visitors based on what URL category they have shown interest in, eg. women&#8217;s clothing, dresses, shoes, etc. </li>\n<li><strong>Page Targeting</strong> &#8211; target specific pages on your website</li>\n<li><strong>Events</strong> &#8211; target visitors that have or have not performed certain events, such as completed purchases, logged in, reviewed products, etc. </li>\n<li><strong>UTM targeting</strong> &#8211; target visitors coming from specific UTM tags or queries</li>\n<li><strong>Number of visits</strong> &#8211; target all new visitors, or returning visitors with a specific number of previous visits</li>\n<li><strong>Days and hours of the week</strong> &#8211; display your campaign on specific days of the week (eg. only Mondays), or specific hours of the day (eg. only working hours or during the night)</li>\n<li><strong>Campaign activity</strong> &#8211; build campaign chains by targeting visitors that have (or have not) previously interacted with a specific campaign </li>\n<li><strong>Desktop/Mobile</strong> &#8211; display your campaign on all devices, or only desktop/mobile. </li>\n<li><strong>NPS and CSAT votes</strong> &#8211; follow-up on your visitors that has given a specific vote in a NPS or CSAT campaign</li>\n<li><strong>Javascript</strong> &#8211; to customize your targeting even more, you can use javascript expressions to pin-point visitors with something in their cart, a specific cart value, logged-in users, etc. The sky&#8217;s the limit with javascript! </li>\n</ul>\n<h4>Triggers</h4>\n<ul>\n<li><strong>Exit Intent</strong> &#8211; trigger your campaign when your visitors are about to leave the website, catching them before they go!</li>\n<li><strong>Scroll</strong> &#8211; trigger your campaign when a visitor has scrolled a certain percentage, perfect for those long category- or article pages.</li>\n<li><strong>Inactivity</strong> &#8211; trigger your campaign when a visitor has been inactive for X seconds</li>\n<li><strong>After X pageviews</strong> &#8211; trigger your campaign when the visitor has done at least X pageviews</li>\n<li><strong>After X seconds</strong> &#8211; trigger your campaign when the visitor has spent X seconds on your website</li>\n<li><strong>Manual</strong> &#8211; trigger your campaign via javascript, eg. when clicking a button or your page.</li>\n</ul>\n<blockquote><p>&#8220;We have more signups and higher conversion rate since starting with Triggerbee. Signups have increased between 50 &#8211; 300% depending on placement, offer, and targeting.&#8221;<br />\n    &#8211; Simon Hallberg, E-commerce Manager @ CLN Athletics</p></blockquote>\n<h3>Other Powerful Campaign Features</h3>\n<ul>\n<li><strong>Stay on brand</strong> &#8211; Upload your own font files and apply them to any text in the editor with just a couple of clicks. Add your colors so you never have to copy and paste a hex code ever again. </li>\n<li><strong>Mobile friendly</strong> &#8211; All of Triggerbee&#8217;s campaign templates are responsive and will fit perfectly on mobile devices. And when building your own, we offer a variety of mobile-friendly adjustments to fit your needs. </li>\n<li><strong>AI-Assisted Copywriting</strong> &#8211; Beesly is an AI assistant built on Open AI&#8217;s GPT-model, and will help you write full campaign copy in seconds. Use Beesly for inspiration, to find new marketing angles, or ideas for your next A/B test.</li>\n<li><strong>A/B-testing</strong> &#8211; Test your offers, content, CTA&#8217;s, and other elements to find a winning combination or your next home run. Just set up the test, make some changes, and measure the results when the test is over.</li>\n<li><strong>Deadline</strong> &#8211; Who doesn&#8217;t get that FOMO feeling when seeing a clock tick down to when the sale ends? With the Triggerbee deadline component, that&#8217;s just what you get! Count down to a specific time of day, or a specific date to give your visitors that sense of FOMO. </li>\n<li><strong>Discount Codes</strong> &#8211; Triggerbee has a discount-code element, which makes it easier than ever for your visitors to use the discount code provided. Simply click to copy and they are ready to go!</li>\n<li><strong>Animations</strong> &#8211; Capture your visitor&#8217;s attention with animated popups and buttons.</li>\n<li><strong>Made for non-coders, but still developer friendly</strong> &#8211; Triggerbee is highly hackable, so you&#8217;re not limited by the (big) library of default building blocks. Send events to your analytics platform, or create a first-party cookie when a customer signs up in a form. Just add a little bit of javascript and the possibilities are endless. </li>\n</ul>\n<blockquote><p>&#8220;In just 2 months, we captured 10,000+ new email subscribers. We have been able to A/B-test and analyze results in an easy way, and the average order value is 53% higher for customers that have used the code in Triggerbee&#8217;s campaigns.&#8221;<br />\n    -Erika Skalman, E-com Sales Manager @ K-rauta</p></blockquote>\n<h3>Email marketing and CRM Integrations</h3>\n<p>Triggerbee pulls data in from your CRM and email software and sends new data back, so you can work with consistent data across your owned channels. Triggerbee automatically logs clicks, conversions, page views, and much more, but you can also send both built-in and custom events to your CRM, as well as to your GA4 account. <a href=\"https://help.triggerbee.com/article/482-integrations-overview\" rel=\"nofollow ugc\">Read more about all of our integrations here.</a></p>\n<ul>\n<li><strong>Rule</strong> &#8211; Deliver customized digital communication throughout the whole customer journey with the help of Rule.</li>\n<li><strong>Custobar</strong> &#8211; Custobar is a customer data and marketing automation platform that combines online and offline data into a single, actionable customer 360° view.</li>\n<li><strong>Voyado</strong> &#8211; Voyado is a loyalty- and CRM platform for eCommerce and retailers.</li>\n<li><strong>Mailchimp</strong> &#8211; Mailchimp is an all-in-one Marketing Platform for small businesses</li>\n<li><strong>Klaviyo</strong> &#8211; Klaviyo lets you deliver personalized experiences across email and other owned channels.</li>\n<li><strong>Emarsys</strong> &#8211; The Emarsys platform helps marketers to deliver personalized experiences across multiple channels.</li>\n<li><strong>Apsis One</strong> &#8211; Apsis One is a marketing platform with tools to manage and build great customer experiences</li>\n<li><strong>Apsis Pro</strong> &#8211; APSIS Pro is a marketing automation platform featuring a suite of email tools.</li>\n<li><strong>Sift Lab</strong> &#8211; Sift Lab helps eCommerce businesses gather, analyze and act on their data in owned channels.</li>\n<li><strong>Webhooks</strong> &#8211; Triggerbee can send a batch of data from the visit to a webhook of your chosing.</li>\n<li><strong>Zapier</strong> &#8211; The Triggerbee integration to Zapier allows you to connect with 5000+ apps outside the Triggerbee native integrations. Triggerbee will send data to Zapier, and Zapier will take it from there.</li>\n<li><strong>WooCommerce</strong> &#8211; With the WordPress plugin, you&#8217;ll also have access to our WooCommerce addon which will automatically add some eCommerce events and also identifiy customers coming to your site. </li>\n</ul>\n<blockquote><p>&#8220;Triggerbee is not just about popups, it&#8217;s much more than that. From personalizing based on behaviour to data enrichment in our other systems, which other competitors didn&#8217;t have.&#8221;<br />\n    -Patrik Karlsson, E-commerce Manager @ Hatstore </p></blockquote>\n",
        "installation": "<ol>\n<li>From your WordPress dashboard, click on plugins and select &#8220;Add new&#8221;</li>\n<li>Search for &#8220;Triggerbee&#8221;</li>\n<li>Click on &#8220;Install&#8221; and then activate the plugin</li>\n<li>From your WordPress dashboard, click on &#8220;Settings&#8221; and choose &#8220;Triggerbee&#8221;</li>\n<li>Open a new tab, log in to your Triggerbee account, and find your Site-ID (ex. 123456). Copy it and go back to the WordPress tab.</li>\n<li>Paste your Site-ID in the text field, and click on &#8220;Start Tracking&#8221;. </li>\n<li>Go grab a cup of coffee and observe as your visitors start rolling in.</li>\n</ol>\n",
        "faq": "\n<dt id='who%20should%20use%20triggerbee%3F'>\nWho should use Triggerbee?\n</h4>\n<p>\n<p>It&#8217;s perfect for eCommerce sites, retailers, marketing agencies, B2C brands, and basically anyone who wants to be more personal on their website and grow their lists and sales.</p>\n</p>\n<dt id='do%20i%20need%20coding%20skills%20to%20use%20triggerbee%3F'>\nDo I need coding skills to use Triggerbee?\n</h4>\n<p>\n<p>No &#8211; Triggerbee is super simple and easy for anyone to use. Simply install the plugin and you&#8217;re ready to go with our WYSIWYG editor.</p>\n</p>\n<dt id='what%20types%20of%20popups%20can%20i%20build%20with%20triggerbee%3F'>\nWhat types of popups can I build with Triggerbee?\n</h4>\n<p>\n<p>All of them! But to mention a few: Sign up forms, competitions and raffles, member promotions, post-purchase surveys, NPS, CSAT, and exit intent campaigns.</p>\n</p>\n<dt id='can%20i%20customize%20the%20look%20and%20feel%20of%20the%20popups%3F'>\nCan I customize the look and feel of the popups?\n</h4>\n<p>\n<p>Yes! You can customize your design as you wish, both for content and copy. You can add your brand fonts and colors as well.</p>\n</p>\n<dt id='can%20i%20integrate%20it%20with%20my%20crm%20or%20email%20tool%3F'>\nCan I integrate it with my CRM or email tool?\n</h4>\n<p>\n<p>Yes! Triggerbee has a bunch of ready-to-go integrations for CRM and email tools, to quickly allow you to create new subscribers and sync website data to your CRM.</p>\n</p>\n<dt id='will%20it%20slow%20down%20my%20website%3F'>\nWill it slow down my website?\n</h4>\n<p>\n<p>No, the Triggerbee plugin is a small script and will not put any extra load on your website.</p>\n</p>\n<dt id='what%20happens%20after%20my%20free%20trial%3F'>\nWhat happens after my free trial?\n</h4>\n<p>\n<p>Nothing &#8211; if you don&#8217;t want to prolong your account, it will just be canceled after your trial period.</p>\n</p>\n<dt id='what%20about%20support%3F'>\nWhat about support?\n</h4>\n<p>\n<p>We have an award-winning team of Customer Success Managers and Support Agents, so you&#8217;ll get all the support you need before you can blink!</p>\n</p>\n\n",
        "changelog": "<h4>2.0</h4>\n<ul>\n<li>Completely new Interface to match Triggerbee app</li>\n<li>Woocommerce Addon added which allows you to automatically track eCom events in Triggerbee, and also identify emails of your customers</li>\n<li>Added new description, screenshots, FAQ and installation instructions</li>\n</ul>\n<h4>1.0</h4>\n<ul>\n<li>Possibility to add triggerbee tracking to wordpress website</li>\n<li>Possibility to map Contact Form 7 forms to Triggerbee</li>\n</ul>\n"
    },
    "short_description": "🐝 Create personalized popups, sign-up forms, and surveys with Triggerbee - no code needed. Just design, publish, and grow your business! 🚀",
    "description": "<p>🐝 Create personalized popups, sign-up forms, and surveys with Triggerbee &#8211; no code needed. Just design, publish, and grow your business! 🚀</p>\n<h3>Get Up To 300% More Members and Subscribers By Improving Your Customer Experience</h3>\n<p><a href=\"https://triggerbee.com/?utm_source=wordpress&amp;utm_medium=website&amp;utm_campaign=plugin\" rel=\"nofollow ugc\">Triggerbee</a> is a personalization platform that allows you to communicate with your visitors based on their personal preferences. Imagine only giving out discount codes to the customers most likely to buy, and guiding them through a tailored journey that keeps them engaged and coming back for more. Triggerbee empowers you and your team to create extraordinary customer experiences that boost your customer lifetime value without having to ramp up ad spend or wait weeks just to make a small change on your website. It&#8217;s just that easy!</p>\n<p>Triggerbee lets you build beautiful popups and campaigns within minutes, to give you more email subscribers, increase sales, and grow your business. Unlike other popup tools, Triggerbee also allows you to select when, where, and who should see the campaign &#8211; giving the right message, to the right recipient, at the right time and avoiding any unnecessary interruptions. </p>\n<p>Integrate with your CRM to follow your customers online interactions, build segments based on website behavior and target them with different messages depending on where they are in the customer journey.</p>\n<blockquote><p>&#8220;The conversion rate for the campaign reached 8.62%. We increased the number of pages per session by 23.01% and the average session length by 14.47% compared to the previous period.&#8221;<br />\n    &#8211; Valter Arnborg, eCommerce Manager @ Flowlife</p></blockquote>\n<h3>Triggerbee App</h3>\n<p>Triggerbee is a software platform and requires a Triggerbee account. If you already have an account, simply activate the plugin and you&#8217;re good to go. If not, <a href=\"https://www.triggerbee.com?utm_source=wordpress&amp;utm_medium=website&amp;utm_campaign=plugin\" rel=\"nofollow ugc\">you can sign up here</a> for your free trial! We offer a range of pricing plans, and all of them start off with a free trial period with everything included. You&#8217;ll be collecting new subscribers within a couple of minutes after signing up! </p>\n<blockquote><p>&#8220;Triggerbee is my favorite tool! It has helped us to build a larger fanclub, increase engagement among visitors and allowed us to get more visits from newsletters to the website.<br />\n    &#8211; Erica Terranova, Growth Marketing Lead @ All things Commerce</p></blockquote>\n<p>Get to know your visitors and segment them on behavior- and customer data</p>\n<p>Track and identify individual customers and their visit behavior on your website. Build customer profiles progressively to identify your visitors and sync data with your CRM. Triggerbee will let you know where your visitors are coming from, what they are doing, what they are interested in &#8211; and who they are. </p>\n<p>Combine the data you have in your CRM with first-party data from Triggerbee to create audiences you have never before been able to reach on your website. </p>\n<ul>\n<li><strong>All new and unidentified visitors</strong> &#8211; Greet your new visitors with a welcome offer to nudge them into that first purchase</li>\n<li><strong>Returning Customers</strong> &#8211; Welcome returning customers back and ask them if they liked their last purchase, or if they wish to add information to their profile </li>\n<li><strong>Visitors that left their cart</strong> &#8211; Convert leaving visitors into customers with an Exit Intent offer</li>\n<li><strong>Logged-out Members</strong> &#8211; Remind logged-out members to log in to access their personal offers</li>\n<li><strong>Visitors interested in women&#8217;s clothing</strong> &#8211; Promote your current offers in women&#8217;s clothing to the visitors that are most likely to buy something in that category</li>\n<li><strong>Members with unused discount codes</strong> &#8211; Remind members with unused discounts or offers to use them when visiting your website</li>\n<li><strong>Members with upcoming birthdays</strong> &#8211; Congratulate your members with upcoming birthdays with a special offer or a simple &#8220;happy birthday&#8221; message</li>\n<li><strong>Influencer Greeting</strong> &#8211; For visitors coming to your website through an Influencer UTM-link, greet them with a personal hello from that influencer to create an omnichannel feeling</li>\n<li>.. and many more!</li>\n</ul>\n<blockquote><p>&#8220;Triggerbee collects behaviour- and zero-party data about your customers, which is a game-changer in terms of who we can target on our website.&#8221; &#8211; Flowliferiggerbee is not just about popups, it&#8217;s much more than that. From personalizing based on behaviour to data enrichment in our other systems, which other competitors didn&#8217;t have.&#8221;<br />\n    &#8211; Flowlife</p></blockquote>\n<h3>Easily create relevant and eye-catching campaigns</h3>\n<p>Create and publish personalized offers, surveys, and forms directly to your website with our no-code editor. Browse from hundreds of templates, or build your own to fit your needs. All campaigns come in a variety of styles, layouts, and features. </p>\n<ul>\n<li><strong>Acquisition Campaigns for new visitors</strong> &#8211; Acquiring new subscribers or members is the most profitable we can do as an eCommerce. Triggerbee allows you to create signup forms or promote membership through overlays and/or embedded campaigns, making it possible to capture as many new leads as possible while still being discreet when needed.</li>\n<li><strong>Pre-launches &amp; Raffles</strong> &#8211; An effective alternative to offering discount codes upon signup is offering pre-access to an upcoming release or conducting competitions or raffles. </li>\n<li><strong>Increase Login Rates</strong> &#8211; By combining data from the CRM and the Triggerbee website data, it is possible to display messages on-site to push or guide visitors to achieve desired outcomes. For instance, it is possible to promote members (CRM data) that are logged out (Triggerbee data) to log in to utilize their promotions and offers</li>\n<li><strong>Remind about unused offers and discounts</strong> &#8211; All of your customers might not see that newsletter or text message you sent about their discount. Instead, remind them when they are on your website and closer to that purchase</li>\n<li><strong>Promote current campaigns and offers</strong> &#8211; Promote ongoing campaigns onsite through embedded top panels or in bigger popups to maximize sales during the campaign period. Also, perfect timing to add a deadline component for that extra FOMO feeling. </li>\n<li><strong>Data enrichment for returning members</strong> &#8211; For returning visitors, Triggerbee can display a different message to enrich the member profile, by asking for their phone number, birthday, or favorite brand for instance. This approach will allow you to collect zero-party data, which is extremely powerful in further communication and segmentation.</li>\n<li><strong>Create Omni channel campaigns with UTM-targeting</strong> &#8211; For returning visitors, Triggerbee can display a different message to enrich the member profile, by asking for their phone number, birthday, or favorite brand for instance. This approach will allow you to collect zero-party data, which is extremely powerful in further communication and segmentation.</li>\n<li><strong>Gamification</strong> &#8211; prolong your marketing efforts in social media on your website by targeting visitors coming from specific UTM tags. </li>\n<li><strong>Guides</strong> &#8211; If higher engagement is important to your brand, gamification might be something to look into! Allow visitors to search for hidden eggs for easter, or spin the wheel to surprise them with a discount. Perfect for raising engagement while being creative and fun. </li>\n<li><strong>Rescue abandoned carts</strong> &#8211; An exit intent is triggered when a visitor tries to leave a website, usually when they have something in their cart already. Exit Intent campaigns can be used to offer discounts, coupons, or free shipping in order to entice the visitor to stay on the site and make a purchase. They can also be used to capture email addresses for future marketing efforts.</li>\n<li><strong>Birthday Campaigns</strong> &#8211; Congratulate your members with upcoming birthdays, with a discount code or just a simple Happy Birthday! Who doesn&#8217;t love that? </li>\n<li><strong>Questionnaires</strong> &#8211; With Triggerbee Surveys and multi-step Forms, it is possible to create feedback forms, questionnaires, and contact forms within minutes.</li>\n<li><strong>Back in Stock</strong> &#8211; If you have a smaller collection of products and sometimes run out of stock, you can allow visitors to be reminded when that product is back Triggerbee will collect a list of emails for that particular product for you to email when it&#8217;s back in stock</li>\n<li><strong>Take care of returning non-purchasers</strong> &#8211; To get new visitors to complete that first purchase is an obstacle we all need to get past. A great way of targeting that obstacle is by offering returning visitors something a little extra, like a discount or free delivery. This is especially powerful in combination with targeting interest profiles or UTM sources. </li>\n<li><strong>Referral Marketing</strong> &#8211; Allow visitors to recommend your brand or specific products to their friends. </li>\n<li>And much more!</li>\n</ul>\n<blockquote><p>&#8220;Triggerbee has allowed us to capture new club members and email subscribers, but also to increase the use of bonuschecks and personal offers. I like the simplicity of creating and designing campaigns in Triggerbee, and have recieved helpful advice and support from my contact person.&#8221;<br />\n    -Tiina Tauru, Online visual merchandiser @ Kicks</p></blockquote>\n<h3>Survey loyalty and customer satisfaction</h3>\n<p>Conducting <a href=\"https://help.triggerbee.com/article/526-surveys\" rel=\"nofollow ugc\">Surveys</a> directly on the website based on behavior or audience is an easy and effective way of getting to know your customers. This allows you to improve the purchase experience and decrease any thresholds. Triggerbee allows you to build and design your surveys freely with both survey- and form elements and will present the results in a dashboard. All data that is collected via Triggerbee Forms or Surveys can easily be sent to your CRM or email tool.</p>\n<ul>\n<li><strong>NPS</strong> &#8211; The Net Promoter Score is a score that measures the willingness of customers to recommend a company&#8217;s products or services to others. It is an indicator of users&#8217; overall satisfaction with your product or service and the users&#8217; loyalty to your brand. Triggerbee has a specific NPS Dashboard which will display your NPS score in real-time and historically.</li>\n<li><strong>CSAT</strong> &#8211; CSAT is used to measure how satisfied the customer is with a product, service, meeting, or your company&#8217;s service. It is a metric that is perfect for finding out what your customer thinks about a specific part of your offer. The CSAT is usually measured on a five-point scale with smileys, stars, or numbers. For the CSAT, Triggerbee has a specific dashboard that displays your CSAT score in real-time and historically.</li>\n<li><strong>Pre- and post-purchase Surveys</strong> &#8211; Other types of surveys that are common for eCommerce are about evaluating why a purchase wasn&#8217;t completed, how the visitor found the website, feedback on new designs, etc. Here are a few examples!</li>\n</ul>\n<h3>Not a big fan of popups? Try embedded content!</h3>\n<p>When thinking about onsite messaging, most of us tend to think about popups. While the old classic popup is a great conversion tool, it is not always the best approach for your brand. Introducing &#8211; <a href=\"https://help.triggerbee.com/article/505-embedded-campaigns\" rel=\"nofollow ugc\">Embedded Content</a>. With Triggerbee, you can inject your campaigns into your website, instead of having them laying on top of it. Either add content or replace current content depending on who is visiting your website. Cool, huh? </p>\n<p>Simply design your campaign as you wish, and select where in your HTML to render the campaign, and we will fix the rest! This is perfect for Newsletter Forms in the footer, signup- or survey forms on specific landing pages, promotions on the PDP, and discrete top panels with your current site-wide offers. </p>\n<blockquote><p>&#8220;Recruiting new members has become easier, and helped with the increase of redeeming personal offers. We are able to remind customers about their bonus checks, thus driving conversion rates within purchases as well.&#8221;<br />\n    &#8211; KICKS Marketing team </p></blockquote>\n<h3>Detailed targeting to help you reach exactly the right people at the right time</h3>\n<p>Not only does Triggerbee allow targeting based on who your visitors are, but we also target our campaigns based on where they are coming from, what they are doing, and in what order they are doing it. For instance, you can display a campaign on a specific URL for all visitors that have visited your site 3+ times in a specific geolocation, when they have something in their cart. All of this is done directly in our UI. Amazing to say the least!</p>\n<p>All Triggerbee campaigns come with this advanced website targeting and behavior-based personalization, making them highly effective for improving your subscription- and member signups as well as your sales.</p>\n<h4>Audience and website Targeting </h4>\n<ul>\n<li><strong>CRM Targeting</strong> &#8211; reuse your already existing segments from your CRM on the website. Target those newcomers, soon-to-be churns, birthday girls, and loyal customers with targeted messages.</li>\n<li><strong>Identification level</strong> &#8211; Triggerbee has built-in audiences for all unidentified and all identified visitors, making it easy to quickly target the right audience.</li>\n<li><strong>Geolocation</strong> &#8211; target visitors in specific countries or regions</li>\n<li><strong>Interest Profiles</strong> &#8211; target visitors based on what URL category they have shown interest in, eg. women&#8217;s clothing, dresses, shoes, etc. </li>\n<li><strong>Page Targeting</strong> &#8211; target specific pages on your website</li>\n<li><strong>Events</strong> &#8211; target visitors that have or have not performed certain events, such as completed purchases, logged in, reviewed products, etc. </li>\n<li><strong>UTM targeting</strong> &#8211; target visitors coming from specific UTM tags or queries</li>\n<li><strong>Number of visits</strong> &#8211; target all new visitors, or returning visitors with a specific number of previous visits</li>\n<li><strong>Days and hours of the week</strong> &#8211; display your campaign on specific days of the week (eg. only Mondays), or specific hours of the day (eg. only working hours or during the night)</li>\n<li><strong>Campaign activity</strong> &#8211; build campaign chains by targeting visitors that have (or have not) previously interacted with a specific campaign </li>\n<li><strong>Desktop/Mobile</strong> &#8211; display your campaign on all devices, or only desktop/mobile. </li>\n<li><strong>NPS and CSAT votes</strong> &#8211; follow-up on your visitors that has given a specific vote in a NPS or CSAT campaign</li>\n<li><strong>Javascript</strong> &#8211; to customize your targeting even more, you can use javascript expressions to pin-point visitors with something in their cart, a specific cart value, logged-in users, etc. The sky&#8217;s the limit with javascript! </li>\n</ul>\n<h4>Triggers</h4>\n<ul>\n<li><strong>Exit Intent</strong> &#8211; trigger your campaign when your visitors are about to leave the website, catching them before they go!</li>\n<li><strong>Scroll</strong> &#8211; trigger your campaign when a visitor has scrolled a certain percentage, perfect for those long category- or article pages.</li>\n<li><strong>Inactivity</strong> &#8211; trigger your campaign when a visitor has been inactive for X seconds</li>\n<li><strong>After X pageviews</strong> &#8211; trigger your campaign when the visitor has done at least X pageviews</li>\n<li><strong>After X seconds</strong> &#8211; trigger your campaign when the visitor has spent X seconds on your website</li>\n<li><strong>Manual</strong> &#8211; trigger your campaign via javascript, eg. when clicking a button or your page.</li>\n</ul>\n<blockquote><p>&#8220;We have more signups and higher conversion rate since starting with Triggerbee. Signups have increased between 50 &#8211; 300% depending on placement, offer, and targeting.&#8221;<br />\n    &#8211; Simon Hallberg, E-commerce Manager @ CLN Athletics</p></blockquote>\n<h3>Other Powerful Campaign Features</h3>\n<ul>\n<li><strong>Stay on brand</strong> &#8211; Upload your own font files and apply them to any text in the editor with just a couple of clicks. Add your colors so you never have to copy and paste a hex code ever again. </li>\n<li><strong>Mobile friendly</strong> &#8211; All of Triggerbee&#8217;s campaign templates are responsive and will fit perfectly on mobile devices. And when building your own, we offer a variety of mobile-friendly adjustments to fit your needs. </li>\n<li><strong>AI-Assisted Copywriting</strong> &#8211; Beesly is an AI assistant built on Open AI&#8217;s GPT-model, and will help you write full campaign copy in seconds. Use Beesly for inspiration, to find new marketing angles, or ideas for your next A/B test.</li>\n<li><strong>A/B-testing</strong> &#8211; Test your offers, content, CTA&#8217;s, and other elements to find a winning combination or your next home run. Just set up the test, make some changes, and measure the results when the test is over.</li>\n<li><strong>Deadline</strong> &#8211; Who doesn&#8217;t get that FOMO feeling when seeing a clock tick down to when the sale ends? With the Triggerbee deadline component, that&#8217;s just what you get! Count down to a specific time of day, or a specific date to give your visitors that sense of FOMO. </li>\n<li><strong>Discount Codes</strong> &#8211; Triggerbee has a discount-code element, which makes it easier than ever for your visitors to use the discount code provided. Simply click to copy and they are ready to go!</li>\n<li><strong>Animations</strong> &#8211; Capture your visitor&#8217;s attention with animated popups and buttons.</li>\n<li><strong>Made for non-coders, but still developer friendly</strong> &#8211; Triggerbee is highly hackable, so you&#8217;re not limited by the (big) library of default building blocks. Send events to your analytics platform, or create a first-party cookie when a customer signs up in a form. Just add a little bit of javascript and the possibilities are endless. </li>\n</ul>\n<blockquote><p>&#8220;In just 2 months, we captured 10,000+ new email subscribers. We have been able to A/B-test and analyze results in an easy way, and the average order value is 53% higher for customers that have used the code in Triggerbee&#8217;s campaigns.&#8221;<br />\n    -Erika Skalman, E-com Sales Manager @ K-rauta</p></blockquote>\n<h3>Email marketing and CRM Integrations</h3>\n<p>Triggerbee pulls data in from your CRM and email software and sends new data back, so you can work with consistent data across your owned channels. Triggerbee automatically logs clicks, conversions, page views, and much more, but you can also send both built-in and custom events to your CRM, as well as to your GA4 account. <a href=\"https://help.triggerbee.com/article/482-integrations-overview\" rel=\"nofollow ugc\">Read more about all of our integrations here.</a></p>\n<ul>\n<li><strong>Rule</strong> &#8211; Deliver customized digital communication throughout the whole customer journey with the help of Rule.</li>\n<li><strong>Custobar</strong> &#8211; Custobar is a customer data and marketing automation platform that combines online and offline data into a single, actionable customer 360° view.</li>\n<li><strong>Voyado</strong> &#8211; Voyado is a loyalty- and CRM platform for eCommerce and retailers.</li>\n<li><strong>Mailchimp</strong> &#8211; Mailchimp is an all-in-one Marketing Platform for small businesses</li>\n<li><strong>Klaviyo</strong> &#8211; Klaviyo lets you deliver personalized experiences across email and other owned channels.</li>\n<li><strong>Emarsys</strong> &#8211; The Emarsys platform helps marketers to deliver personalized experiences across multiple channels.</li>\n<li><strong>Apsis One</strong> &#8211; Apsis One is a marketing platform with tools to manage and build great customer experiences</li>\n<li><strong>Apsis Pro</strong> &#8211; APSIS Pro is a marketing automation platform featuring a suite of email tools.</li>\n<li><strong>Sift Lab</strong> &#8211; Sift Lab helps eCommerce businesses gather, analyze and act on their data in owned channels.</li>\n<li><strong>Webhooks</strong> &#8211; Triggerbee can send a batch of data from the visit to a webhook of your chosing.</li>\n<li><strong>Zapier</strong> &#8211; The Triggerbee integration to Zapier allows you to connect with 5000+ apps outside the Triggerbee native integrations. Triggerbee will send data to Zapier, and Zapier will take it from there.</li>\n<li><strong>WooCommerce</strong> &#8211; With the WordPress plugin, you&#8217;ll also have access to our WooCommerce addon which will automatically add some eCommerce events and also identifiy customers coming to your site. </li>\n</ul>\n<blockquote><p>&#8220;Triggerbee is not just about popups, it&#8217;s much more than that. From personalizing based on behaviour to data enrichment in our other systems, which other competitors didn&#8217;t have.&#8221;<br />\n    -Patrik Karlsson, E-commerce Manager @ Hatstore </p></blockquote>\n",
    "download_link": "https://downloads.wordpress.org/plugin/triggerbee.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/triggerbee/assets/screenshot-1.png?rev=2971276",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/triggerbee/assets/screenshot-2.png?rev=2971276",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/triggerbee/assets/screenshot-3.png?rev=2971276",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/triggerbee/assets/screenshot-4.png?rev=2971276",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/triggerbee/assets/screenshot-5.png?rev=2971276",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/triggerbee/assets/screenshot-6.png?rev=2971276",
            "caption": ""
        }
    ],
    "tags": {
        "newsletter": "newsletter",
        "popups": "popups",
        "signup-forms": "signup forms",
        "surveys": "surveys",
        "triggerbee": "Triggerbee"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/triggerbee.1.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/triggerbee.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/triggerbee.1.0.2.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/triggerbee.1.0.7.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/triggerbee/assets/banner-772x250.png?rev=2971310",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/triggerbee/assets/icon-256x256.png?rev=2971276",
        "2x": "https://ps.w.org/triggerbee/assets/icon-256x256.png?rev=2971276"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}