{
    "name": "UPS Shipping and UPS Access Point™: Official Plugin",
    "slug": "ups-eu-woocommerce",
    "version": "3.8.0",
    "author": "<a href=\"https://www.ups.com/pl/en/services/technology-integration/ecommerce-plugins.page\">UPS</a>",
    "author_profile": "https://profiles.wordpress.org/officialups/",
    "contributors": {
        "officialups": {
            "profile": "https://profiles.wordpress.org/officialups/",
            "avatar": "https://secure.gravatar.com/avatar/52c4a3c04a7e8f5bbf327aa25f7e7713?s=96&d=monsterid&r=g",
            "display_name": "UPS"
        }
    },
    "requires": "4.9.8",
    "tested": "6.1.7",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 44,
    "ratings": {
        "5": 6,
        "4": 1,
        "3": 2,
        "2": 2,
        "1": 17
    },
    "num_ratings": 28,
    "support_url": "https://wordpress.org/support/plugin/ups-eu-woocommerce/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 800,
    "downloaded": 47679,
    "last_updated": "2023-04-11 14:35:00",
    "added": "2019-05-16",
    "homepage": "",
    "sections": {
        "description": "<p>IMPORTANT NOTE: This plugin is currently available for merchants in POLAND, FRANCE, UNITED KINGDOM, GERMANY, ITALY, SPAIN, NETHERLANDS, BELGIUM, AUSTRIA, CZECHREPUBLIC, DENMARK, FINLAND, GREECE, HUNGARY, IRELAND, LUXEMBOURG, PORTUGAL, ROMANIA, SLOVENIA, SWEDEN, NORWAY, SWITZERLAND, ICELAND, JERSEY, TURKEY . It will be available for merchants in other countries soon. At this time, please only install this extension if you are in the above mentioned countries.</p>\n<p>What this product does for you:<br />\n* Available for free.<br />\n* Easy to configure in 6 easy steps.<br />\n* Gives your customers access to an expansive UPS Access Point network throughout Europe and North America and delivery services to home/office/commercial addresses.<br />\n* Adds speed and convenience by allowing merchants to offer a wide range of delivery options in terms of speed (next day, 2 day, etc.) and multiple delivery location options (pick up at a convenient UPS Access Point location or delivery to your customers’ home/office address).<br />\n* Improves your online cart conversions. Learn more how you can do this here: https://www.ups.com/assets/resources/media/en_GB/six-steps-to-improve-your-online-cart-conversions.pdf</p>\n<p>What are the features of this product:</p>\n<p>Front Office:<br />\n* Simple &amp; easy map interface for your customers to select UPS Access Point as per their preference.<br />\n* User-friendly interface for your customers to switch from Access Point delivery to home delivery.<br />\n* Real time UPS shipping rate or flat rates for each available service (as per merchant’s back office settings).<br />\n* Supports multiple currencies in the checkout (when WooCommerce Currency Switcher v1.2.1 or above is used).</p>\n<p>Back Office:<br />\n* Range of options to set up delivery rates that your customers will see (for example: free shipping, real time shipping rates, or flat rates as per basket value thresholds).<br />\n* Possibility to open a UPS account directly in the module itself, if you do not have one.<br />\n* Easy PDF label generation.<br />\n* Real time tracking information.<br />\n* Ability to export open orders so that you can process them in other applications for more complex needs.</p>\n<p>Account:<br />\nA UPS Account is required to enable UPS shipping.</p>\n<p>However, this official UPS module, unlike other shipping modules that enable UPS shipping, does not require you to have a valid UPS Account prior to the module installation!<br />\n* If you have a valid UPS Account number: You can directly configure it for this extension by entering your account details (such as account number, invoice amount, number and currency) in extension configuration. No need to involve any UPS Account Manager or Technical Helpline. UPS APIs will do the account verification in the background and, if successful, you can start shipping right away.<br />\n* If you do not have a UPS account: You can directly and easily create one in the extension configuration without calling or waiting for any UPS representative. You can manage your invoices directly on the UPS Billing Center on ups.com after the account has been opened in the module.</p>\n<h3>Installation Support:</h3>\n<p>For installation instructions please visit<br />\nhttps://support.ecommerce.help/hc/en-us/sections/4405591774481-Official-Extension-for-WooCommerce</p>\n<p>For technical issues please visit<br />\nhttps://ecommerce.help/product/ups-plugins</p>\n<p>and open up a support case. Our support team will take care of your issue.</p>\n<p>=Telephone Support=<br />\nUnited Kingdom: +44 808 258 0323<br />\nBelgium:  +32 78 48 49 16<br />\nFrance: +33 805 11 96 92<br />\nGermany: +49 32 221097485<br />\nItaly: +39 800 725 920<br />\nNetherlands: +31 85 107 0232<br />\nPoland: +48 22 103 24 55<br />\nSpain: +34 518 90 05 99<br />\nAustria: +49 32 221097485<br />\nCzechrepublic: +49 32 221097485<br />\nDenmark: +49 32 221097485<br />\nFinland: +49 32 221097485<br />\nGreece: +49 32 221097485<br />\nHungary: +49 32 221097485<br />\nIreland: +49 32 221097485<br />\nLuxembourg: +49 32 221097485<br />\nPortugal: +49 32 221097485<br />\nRomania: +49 32 221097485<br />\nSlovenia: +49 32 221097485<br />\nSweden: +49 32 221097485<br />\nNorway: +49 32 221097485<br />\nSwitzerland: +49 32 221097485<br />\nIceland: +49 32 221097485<br />\nJersey: +49 32 221097485<br />\nTurkey: +49 32 221097485</p>\n",
        "installation": "<p>Please keep in mind the following before you start installing and configuring the UPS Shipping and UPS Access Point™: Official Plugin for WooCommerce:<br />\n1.  Please ensure your webstore is SSL enabled to ensure data-in-transit encryption. Or else, you will be unable to accept UPS Terms &amp; Conditions and proceed further.<br />\n2.  After accepting the UPS Terms &amp; Conditions, please ensure that you complete the configuration of the extension within 24 hours to avoid getting any errors during the configuration process. In case you resume the configuration after 24 hours and get errors, please uninstall the extension, clear webstore cache and then re-install the extension.<br />\n3.  If you have an existing UPS account number, while registering yourself on the Account page, please use the exact registered pickup address (which might be different from your invoice billing address) associated with this account number. Please note that the format of the postal code or zip code should exactly match the one provided in the registered pickup address. If you have any difficulties understanding which address to use, please contact your local UPS sales representative or call the support phone number provided on the “About” page.<br />\n4.  Please make sure Maintenance Mode off.<br />\n5.  Following UPS addresses should be whitelisted:</p>\n<ul>\na.https://fa-ecpanalytics-prd.azurewebsites.net<br />\nb.https://fa-ecpdashboard-prd.azurewebsites.net<br />\nc.https://fa-ecpintegration-prd.azurewebsites.net<br />\nd.https://fa-ecptools-prd.azurewebsites.net<br />\ne.https://wa-ecpreporting-prd.azurewebsites.net<br />\nf.https://onlinetools.ups.com/\n</ul>\n<h4>Installing and activating the UPS Shipping plugin in the Back Office:</h4>\n<ol>\n<li>Download the plugin file</li>\n<li>Login to WordPress back office system: Simply go to your browser URL space bar that appears on top, type www.yourwebsitename.com/WP-ADMIN and press, \\&#8221;Enter\\&#8221; key.</li>\n<li>Once you are in the back office system, go to the plugin page, and click on “Add New” =&gt; ”Upload Plugin” =&gt; ”Install”.</li>\n<li>After installation is completed, click on “Activate Plugin” to complete the activation of the plugin in the back office</li>\n</ol>\n<h4>Activating the UPS Shipping plugin in the Front office:</h4>\n<ol>\n<li>Click on “WooCommerce” -&gt; ”Setting” -&gt; ”Shipping” -&gt; “Add shipping zone”.</li>\n<li>On the “Shipping zone” page, specify the Zone name, zone region and then click on “Add Shipping method”</li>\n<li>When you click on \\&#8221;Add shipping method\\&#8221;, the system will show a popup box with a drop down list. Select \\&#8221;UPS Shipping\\&#8221; from the drop down list and click on “Save change”.</li>\n</ol>\n<h4>Configuring the UPS Shipping plugin:</h4>\n<p>After installing the plugin for the first time, the merchant needs to go through the Configuration section of the plugin. Please see below instructions on how merchants can configure the plugin before putting it into use in the e-commerce site.<br />\n1. Select country</p>\n<ul>\na. Select the country from which your packages are shipped.<br />\nb. Click ‘Continue’ to go to next screen.\n</ul>\n<p>\n2. Accepting Terms &amp; Conditions</p>\n<ul>\na.  User needs to read through the UPS terms and conditions and the plugin usage agreement, then confirm that the user agreed to them. The user cannot proceed to the next steps if these terms and conditions are not agreed to.<br />\nb.  Click ‘Continue’ to go to next screen.\n</ul>\n<p>\n3.  Account</p>\n<ul>\na.  This screen allows merchants to configure their account to use UPS Shipping service. The merchant needs to fill out the required personal information to start using the plugin as instructed in the screen.<br />\nb.  After filling out personal information, user selects one of the three options that best describes them and fill in the required information:<br />\n  i.    User has a UPS account with an invoice occurred in the last 90 days.<br />\n  ii.   User has a UPS account without an invoice occurred in the last 90 days.<br />\n  iii.  User does not have a UPS account.<br />\nc.  Any incorrect information will result in incorrect configuration. All information has to be entered correctly by the merchant in order to activate the plugin. If the merchant is unsure, they can contact UPS help desk for information prior to activation.\n</ul>\n<p>\n4.  Shipping Services</p>\n<ul>\na.  Various shipping services information, which are available for the particular area would be displayed here. Merchant can select which one is suitable for his e-shoppers.<br />\nb.  This shipping service list is automatically loaded from UPS database, depending on the country that the user chose in the first screen.\n</ul>\n<p>\n5.  Collect on Delivery (COD)</p>\n<ul>\na.  UPS Shipping Plugin automatically detects whether user’s WooCommerce website has installed the COD module, and displays that status in the ‘COD Option’ section.<br />\nb.  If user wishes to use COD service, he could go to WooCommerce’s market place to install the COD module by WooCommerce and activate that module.<br />\nc.  If user wishes to disable COD service in UPS Shipping Plugin, he could deactivate the COD module of WooCommerce. UPS Shipping Plugin will automatically update accordingly.<br />\nd.  Click &#8216;Next&#8217; to go to the next screen.\n</ul>\n<p>\n6.  Package Dimensions</p>\n<ul>\na.  The user can decide if they want rates calculated and displayed based on:<br />\n    I.  Basic – (The number of items in the order determines package size) – This option is best when you sell a single product type and the size of the package for shipping only changes based on the number of products in the customer’s order<br />\n             -  Enter at least one default package size for 1 item in the order<br />\n             -  Enter additional default package sizes based on the number of the items in the order that force a larger average package size<br />\n             -  The package size entered for the highest number of items in the order will apply for all orders equal to or greater than that number of items<br />\n             -  In the screenshot Default Package Configuration &#8211; Basic, an order of 1-2 items will rate based on a 12 x 12 x 12 package at 3 lbs, an order of 3-4 items will rate based on a 20 x 20 x 12 package at 6 lbs and every order with 5 or more items will rate based on a 24 x 24 x 24 package at 10 lbs<br />\n    II. Advanced – (Weights and dimensions of products in your customers order, determine the package size) – This option is best when you sell different products ranging in size and weights and the size of package changes based on which and how many products are in the customer’s order<br />\n             -  To use this option, you must enter product weights in the product settings of your shop.<br />\n             -  If you DO NOT enter product dimensions for each product in your product settings and wish to show rates based on order weight only, the select “No” for “Include product dimensions in rating”<br />\n             -  If you DO enter product dimensions for each product in your product settings and want more accurate rates with dimensions considered, the select “Yes” for “Include product dimensions in rating”<br />\n             -  Enter the sizes of the packages you use to fulfill orders.  Note, the plugin will create a custom package size if your customer order is larger than the packages you enter<br />\n             -  Enter at least 1 “Back up” rate and service.  This will ensure the consumer receives a rate if there’s a rating error cause by products missing weights, weights being greater than UPS limits, incorrect units of measure, etc.<br />\n             -  Note, units of weight must be entered in pounds and inches (U.S.) or kilograms and centimeters (Europe). Entering ounces or grams will result in an error and the “Back up” rate showing<br />\n             -  In the screenshot Default Package Configuration &#8211; Advanced, the user has entered 3 package sizes for their orders, elected to include product dimensions in rating and will show “Back up” rate of $15.55 for UPS Ground to the consumer if there is a rating error<br />\nb.  Click ‘Next’ to go to the next screen.\n</ul>\n<p>\n7.  Checkout Shipping Rate</p>\n<ul>\na.  User can define the delivery rates offered for the e-shoppers here.<br />\nb.  The shipping services that user selected in the Shipping Service screen will be automatically loaded to this screen.<br />\nc.  User can configure the rates for each shipping service separately. Each shipping service can be configured with two rating options:<br />\n  i.    Flat rates: all the orders will be categorized based on order value. If that value is smaller than a defined Order Value Threshold, the corresponding Delivery Rates will be applied. The order with the value higher than the highest Order Value Threshold will enjoy free shipping (Delivery Rate = 0).<br />\n  ii.   Real time shipping rates: the delivery rates are calculated based on shipping rates quoted by UPS. User can configure to charge e-shoppers any percentage of that quotation.<br />\nd.  Click ‘Save’ to save the delivery rates configuration.<br />\ne.  Click ‘Next’ to go to the next screen.\n</ul>\n<p>\n8.  Complete Configuration</p>\n<ul>\na.  This screen shows additional guidance for user to experience UPS’s services.<br />\nb.  User can also search for UPS Access Point and print COD and Pickup Registration form.<br />\nc.  Click ‘Complete Configuration’ to complete the configuration step.\n</ul></p>\n",
        "changelog": "<p>Version 3.8.0:<br />\n. Support UPS Express 12:00 service in Germany.</p>\n<p>Version 3.7.3:<br />\n. French translation issue fixed.</p>\n<p>Version 3.7.2:<br />\n. Checkout Language issue fixed.<br />\n. Support FOX Currency.</p>\n<p>Version 3.7.1:<br />\n. Minor bug fix..</p>\n<p>Version 3.7.0:<br />\n. Fixed single country issue at checkout.</p>\n<p>Version 3.6.9:<br />\n. Minor bug fix..</p>\n<p>Version 3.6.8:<br />\n. Minor bug fix..</p>\n<p>Version 3.6.7:<br />\n. Minor bug fix..</p>\n<p>Version 3.6.6:<br />\n. Total calculation issue fixed.</p>\n<p>Version 3.6.5:<br />\n. Translation issue fixed.</p>\n<p>Version 3.6.4:<br />\n. Minor improvements.</p>\n<p>Version 3.6.3:<br />\n. Minor bug fix.</p>\n<p>Version 3.6.2:<br />\n. Minor bug fix.</p>\n<p>Version 3.6.1:<br />\n. Fixed minor bug in timeintransit.</p>\n<p>Version 3.6.0:<br />\n. Minor improvements.</p>\n<p>Version 3.5.1:<br />\n. Bug fixed in USD currency.</p>\n<p>Version 3.5.0:<br />\n. Minor bug fixes in Edit order page shipping services list.</p>\n<p>Version 3.4.10:<br />\n. Minor bug fixes in checkout page date.</p>\n<p>Version 3.4.9:<br />\n. Minor bug fixes in shipment manager Exports orders.</p>\n<p>Version 3.4.8:<br />\n. Minor bug fixes in shipment manager.</p>\n<p>Version 3.4.7:<br />\n. Minor bug fixes.</p>\n<p>Version 3.4.6:<br />\n. Minor bug fixes.</p>\n<p>Version 3.4.5:<br />\n. Minor bug fixes.</p>\n<p>Version 3.4.4:<br />\n. Fixed php8.1 issues.</p>\n<p>Version 3.4.3:<br />\n. Minor bug fixes.</p>\n<p>Version 3.4.2:<br />\n. Minor bug fixes in AP address.</p>\n<p>Version 3.4.1:<br />\n. Minor bug fixes in order status changes.</p>\n<p>Version 3.4.0:<br />\n. Minor bug fixes.</p>\n<p>Version 3.3.11:<br />\n. Minor bug fixes.</p>\n<p>Version 3.3.10:<br />\n. Minor bug fixes.</p>\n<p>Version 3.3.9:<br />\n. Minor bug fixes in UI.</p>\n<p>Version 3.3.8:<br />\n. Minor bug fixes.</p>\n<p>Version 3.3.7:<br />\n. Minor improvements.</p>\n<p>Version 3.3.6:<br />\n. Minor improvements.</p>\n<p>Version 3.3.5:<br />\n. Fixed weight and dimension length issue.</p>\n<p>Version 3.3.4:<br />\n. Fixed tax issues.</p>\n<p>Version 3.3.3:<br />\n. Added fix for lower weight value and tax.</p>\n<p>Version 3.3.2:<br />\n. Minor bug fixes.</p>\n<p>Version 3.3.1:<br />\n. Minor bug fixes.</p>\n<p>Version 3.3.0:<br />\n. The module supports PHP 8.0.</p>\n<p>Version 3.2.2:<br />\n. Minor bug fixed on tax calculation and order status.</p>\n<p>Version 3.2.1:<br />\n. Minor bug fixes.</p>\n<p>Version 3.2.0:<br />\n. The module supports shipping tax.</p>\n<p>Version 3.1.0:<br />\n. Updated required 25 EU countries.<br />\n. Updated developer key .</p>\n<p>Version 3.0.1:<br />\n. Bug Fix on packing products of orders with basic packing entry for old orders.<br />\n. Added three Europe countries.</p>\n<p>Version 3.0.0:<br />\n. The module supports all European countries.</p>\n<p>Version 2.6.4:<br />\n. Minor Bug Fix on Language code while fetching License Text.</p>\n<p>Version 2.6.3:<br />\n. Fixed minor issues in UPS shipping rates.</p>\n<p>Version 2.6.2:<br />\n. Fixed minor issues in UPS shipping rates for countries that do not have a ZIP code and minor bug fix in account page.</p>\n<p>Version 2.6.1:<br />\n. Fixed minor issues in old customer enable AccessPoint as shipping address.</p>\n<p>Version 2.6.0:<br />\n. Ability for merchants to set up Country based flat shipping rates based on weight and order value.</p>\n<p>Version 2.5.1:<br />\n. Auto old order import and minor bug fixes in shipment Manager.</p>\n<p>Version 2.5.0:<br />\n. Added option to generate label for old orders.</p>\n<p>Version 2.4.4:<br />\n. Improved account registration process.</p>\n<p>Version 2.4.3:<br />\n. Fixed minor issues in box packing.</p>\n<p>Version 2.4.2:<br />\n. Fixed packing items into individual instead of box packing, if didn&#8217;t saved settings after update.</p>\n<p>Version 2.4.1:<br />\n. Minor bug fixes.</p>\n<p>Version 2.4.0:<br />\n. Improved packing algorithm.</p>\n<p>Version 2.3.1:<br />\n. Added option to set AP address as Ship to address.</p>\n<p>Version 2.3.0:<br />\n. Revamped Account linking and some minor bug fix.</p>\n<p>Version 2.2.13:<br />\n. Fixed negotiated rates issue in order page.</p>\n<p>Version 2.2.12:<br />\n. Added AP service check and pre-flight check.</p>\n<p>Version 2.2.11:<br />\n. Minor bug fix.</p>\n<p>Version 2.2.10:<br />\n. Calculate Shipping Cost option is introduced in the order details screen<br />\n. Reset Username and password option is introduced.</p>\n<p>Version 2.2.9:<br />\n. Added new support telephone numbers.</p>\n<p>Version 2.2.8:<br />\n. Added option to register with UPS username and password.<br />\n. Fixed package weight issue with basic packing on label creation.<br />\n. Fixed UPS shipping cost update on non-UPS orders.</p>\n<p>Version 2.2.7:<br />\n. Added shipment creation option on woocommerce order page.</p>\n<p>Version 2.2.6:<br />\n. Fixed Itemized charge adding issue with negotiated rates.</p>\n<p>Version 2.2.5:<br />\n. Added the Download log button and fixed a minor bug.</p>\n<p>Version 2.2.4:<br />\n. Minor bug fixes</p>\n<p>Version 2.2.3:<br />\n. Bug fix on settings not saved for Package Dimensions Advanced selected if Shipping service =&gt; Deliver to consignee address is enabled<br />\n. headers already sent error fixed.</p>\n<p>Version 2.2.2:<br />\n. Bug fix on PHP warnings.<br />\n. Calculate after the discount applied option is implemented.<br />\n. Bug fix on AccessPoint checkout process.<br />\n. Bug fix on Custom prefix table fetch.<br />\n. Improvement on AccessPoint checkout process.</p>\n<p>Version 2.2.1:<br />\n. Minor fix related to UPS version.</p>\n<p>Version 2.2.0:<br />\n. Price is not updated after changing the Country value.<br />\n. Price is not updated after changing the State value.<br />\n. Price is not updated while changing the postal code value.<br />\n. When &#8216;Ship to a different address?&#8217; checkbox is ON, it is not taking the right address for updating price.<br />\n. Within &#8216;Ship To&#8217; section of Checkout, multiple flows where Price is not updated based on changes in value.<br />\n. UI collapses in certain sections within Checkout Screen.<br />\n. Use of deprecated javascript and jquery functions that was causing a majority of issues within plugins.<br />\n. Map not loading in Access Point selection section.<br />\n. When choosing different shipping price from the options available, main shipping cost not getting updated.<br />\n. Search the address feature is not working.<br />\n. Customer company name not getting printed on shipping label.  Was developed as a new feature improvement.<br />\n. Improved CSS for Rate section neatness.<br />\n. Tested Upto Latest version of WooCommerce &amp; WordPress Versions.</p>\n"
    },
    "short_description": "Free and official UPS Shipping and UPS Access Point™: Official Plugin developed for WooCommerce which gives access to various UPS shipping services.",
    "description": "<p>IMPORTANT NOTE: This plugin is currently available for merchants in POLAND, FRANCE, UNITED KINGDOM, GERMANY, ITALY, SPAIN, NETHERLANDS, BELGIUM, AUSTRIA, CZECHREPUBLIC, DENMARK, FINLAND, GREECE, HUNGARY, IRELAND, LUXEMBOURG, PORTUGAL, ROMANIA, SLOVENIA, SWEDEN, NORWAY, SWITZERLAND, ICELAND, JERSEY, TURKEY . It will be available for merchants in other countries soon. At this time, please only install this extension if you are in the above mentioned countries.</p>\n<p>What this product does for you:<br />\n* Available for free.<br />\n* Easy to configure in 6 easy steps.<br />\n* Gives your customers access to an expansive UPS Access Point network throughout Europe and North America and delivery services to home/office/commercial addresses.<br />\n* Adds speed and convenience by allowing merchants to offer a wide range of delivery options in terms of speed (next day, 2 day, etc.) and multiple delivery location options (pick up at a convenient UPS Access Point location or delivery to your customers’ home/office address).<br />\n* Improves your online cart conversions. Learn more how you can do this here: https://www.ups.com/assets/resources/media/en_GB/six-steps-to-improve-your-online-cart-conversions.pdf</p>\n<p>What are the features of this product:</p>\n<p>Front Office:<br />\n* Simple &amp; easy map interface for your customers to select UPS Access Point as per their preference.<br />\n* User-friendly interface for your customers to switch from Access Point delivery to home delivery.<br />\n* Real time UPS shipping rate or flat rates for each available service (as per merchant’s back office settings).<br />\n* Supports multiple currencies in the checkout (when WooCommerce Currency Switcher v1.2.1 or above is used).</p>\n<p>Back Office:<br />\n* Range of options to set up delivery rates that your customers will see (for example: free shipping, real time shipping rates, or flat rates as per basket value thresholds).<br />\n* Possibility to open a UPS account directly in the module itself, if you do not have one.<br />\n* Easy PDF label generation.<br />\n* Real time tracking information.<br />\n* Ability to export open orders so that you can process them in other applications for more complex needs.</p>\n<p>Account:<br />\nA UPS Account is required to enable UPS shipping.</p>\n<p>However, this official UPS module, unlike other shipping modules that enable UPS shipping, does not require you to have a valid UPS Account prior to the module installation!<br />\n* If you have a valid UPS Account number: You can directly configure it for this extension by entering your account details (such as account number, invoice amount, number and currency) in extension configuration. No need to involve any UPS Account Manager or Technical Helpline. UPS APIs will do the account verification in the background and, if successful, you can start shipping right away.<br />\n* If you do not have a UPS account: You can directly and easily create one in the extension configuration without calling or waiting for any UPS representative. You can manage your invoices directly on the UPS Billing Center on ups.com after the account has been opened in the module.</p>\n<h3>Installation Support:</h3>\n<p>For installation instructions please visit<br />\nhttps://support.ecommerce.help/hc/en-us/sections/4405591774481-Official-Extension-for-WooCommerce</p>\n<p>For technical issues please visit<br />\nhttps://ecommerce.help/product/ups-plugins</p>\n<p>and open up a support case. Our support team will take care of your issue.</p>\n<p>=Telephone Support=<br />\nUnited Kingdom: +44 808 258 0323<br />\nBelgium:  +32 78 48 49 16<br />\nFrance: +33 805 11 96 92<br />\nGermany: +49 32 221097485<br />\nItaly: +39 800 725 920<br />\nNetherlands: +31 85 107 0232<br />\nPoland: +48 22 103 24 55<br />\nSpain: +34 518 90 05 99<br />\nAustria: +49 32 221097485<br />\nCzechrepublic: +49 32 221097485<br />\nDenmark: +49 32 221097485<br />\nFinland: +49 32 221097485<br />\nGreece: +49 32 221097485<br />\nHungary: +49 32 221097485<br />\nIreland: +49 32 221097485<br />\nLuxembourg: +49 32 221097485<br />\nPortugal: +49 32 221097485<br />\nRomania: +49 32 221097485<br />\nSlovenia: +49 32 221097485<br />\nSweden: +49 32 221097485<br />\nNorway: +49 32 221097485<br />\nSwitzerland: +49 32 221097485<br />\nIceland: +49 32 221097485<br />\nJersey: +49 32 221097485<br />\nTurkey: +49 32 221097485</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.8.0.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/ups-eu-woocommerce/assets/screenshot-1.png?rev=2089247",
            "caption": "E-shopper checkout page after configuring UPS Shipping module"
        },
        {
            "src": "https://ps.w.org/ups-eu-woocommerce/assets/screenshot-2.png?rev=2089247",
            "caption": "Merchant back office Account page"
        },
        {
            "src": "https://ps.w.org/ups-eu-woocommerce/assets/screenshot-3.png?rev=2089247",
            "caption": "Merchant back office Shipping Services page"
        },
        {
            "src": "https://ps.w.org/ups-eu-woocommerce/assets/screenshot-4.png?rev=2329089",
            "caption": "Default Package Configuration - Basic"
        },
        {
            "src": "https://ps.w.org/ups-eu-woocommerce/assets/screenshot-5.png?rev=2329089",
            "caption": "Default Package Configuration - Advanced"
        }
    ],
    "tags": [],
    "stable_tag": "3.8.0",
    "versions": {
        "1.0.3": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.1.0.6.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.0.1.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.0.4.zip",
        "2.0.5": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.0.5.zip",
        "2.0.6": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.0.6.zip",
        "2.0.7": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.0.7.zip",
        "2.0.8": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.0.8.zip",
        "2.0.9": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.0.9.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.1.2.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.1.3.zip",
        "2.1.4": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.1.4.zip",
        "2.1.5": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.1.5.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.1.zip",
        "2.2.10": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.10.zip",
        "2.2.11": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.11.zip",
        "2.2.12": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.12.zip",
        "2.2.13": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.13.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.2.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.3.zip",
        "2.2.4": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.4.zip",
        "2.2.5": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.5.zip",
        "2.2.6": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.6.zip",
        "2.2.7": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.7.zip",
        "2.2.8": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.8.zip",
        "2.2.9": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.2.9.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.3.0.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.3.1.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.4.0.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.4.1.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.4.2.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.4.3.zip",
        "2.4.4": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.4.4.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.5.0.zip",
        "2.5.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.5.1.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.6.0.zip",
        "2.6.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.6.1.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.6.2.zip",
        "2.6.3": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.6.3.zip",
        "2.6.4": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.2.6.4.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.0.1.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.1.0.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.2.1.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.2.2.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.3.0.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.3.1.zip",
        "3.3.10": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.3.10.zip",
        "3.3.11": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.3.11.zip",
        "3.3.2": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.3.2.zip",
        "3.3.3": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.3.3.zip",
        "3.3.4": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.3.4.zip",
        "3.3.5": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.3.5.zip",
        "3.3.6": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.3.6.zip",
        "3.3.7": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.3.7.zip",
        "3.3.8": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.3.8.zip",
        "3.3.9": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.3.9.zip",
        "3.4.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.4.0.zip",
        "3.4.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.4.1.zip",
        "3.4.10": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.4.10.zip",
        "3.4.2": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.4.2.zip",
        "3.4.3": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.4.3.zip",
        "3.4.4": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.4.4.zip",
        "3.4.5": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.4.5.zip",
        "3.4.6": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.4.6.zip",
        "3.4.7": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.4.7.zip",
        "3.4.8": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.4.8.zip",
        "3.4.9": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.4.9.zip",
        "3.5.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.5.0.zip",
        "3.5.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.5.1.zip",
        "3.6.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.6.0.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.6.1.zip",
        "3.6.2": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.6.2.zip",
        "3.6.3": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.6.3.zip",
        "3.6.4": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.6.4.zip",
        "3.6.5": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.6.5.zip",
        "3.6.6": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.6.6.zip",
        "3.6.7": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.6.7.zip",
        "3.6.8": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.6.8.zip",
        "3.6.9": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.6.9.zip",
        "3.7.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.7.0.zip",
        "3.7.1": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.7.1.zip",
        "3.7.2": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.7.2.zip",
        "3.7.3": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.7.3.zip",
        "3.8.0": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.3.8.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/ups-eu-woocommerce.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/ups-eu-woocommerce/assets/banner-772x250.jpg?rev=2089247",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/ups-eu-woocommerce/assets/icon-256x256.jpg?rev=2089247",
        "2x": "https://ps.w.org/ups-eu-woocommerce/assets/icon-256x256.jpg?rev=2089247"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 44,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}