{
    "name": "Visualizer: Tables and Charts Manager for WordPress",
    "slug": "visualizer",
    "version": "3.11.5",
    "author": "<a href=\"http://themeisle.com\">Themeisle</a>",
    "author_profile": "https://profiles.wordpress.org/themeisle/",
    "contributors": {
        "codeinwp": {
            "profile": "https://profiles.wordpress.org/codeinwp/",
            "avatar": "https://secure.gravatar.com/avatar/b8b3191b5558075386508b64bf46c780?s=96&d=monsterid&r=g",
            "display_name": "Codeinwp"
        },
        "themeisle": {
            "profile": "https://profiles.wordpress.org/themeisle/",
            "avatar": "https://secure.gravatar.com/avatar/650787f8a8f0b21a43a20a367c0e75f2?s=96&d=monsterid&r=g",
            "display_name": "Themeisle"
        },
        "marius2012": {
            "profile": "https://profiles.wordpress.org/marius2012/",
            "avatar": "https://secure.gravatar.com/avatar/97a1190479b80c0a8860d70dd57dbeb6?s=96&d=monsterid&r=g",
            "display_name": "selu"
        },
        "marius_codeinwp": {
            "profile": "https://profiles.wordpress.org/marius_codeinwp/",
            "avatar": "https://secure.gravatar.com/avatar/0e510e392a33472ac5d760c2fb11739e?s=96&d=monsterid&r=g",
            "display_name": "MariusG"
        },
        "hardeepasrani": {
            "profile": "https://profiles.wordpress.org/hardeepasrani/",
            "avatar": "https://secure.gravatar.com/avatar/33cc57ef37124a38cf019747c0880172?s=96&d=monsterid&r=g",
            "display_name": "Hardeep Asrani"
        },
        "rozroz": {
            "profile": "https://profiles.wordpress.org/rozroz/",
            "avatar": "https://secure.gravatar.com/avatar/73166e05504c64b6080584ebfba5ba36?s=96&d=monsterid&r=g",
            "display_name": "contactashish13"
        },
        "madalin_themeisle": {
            "profile": "https://profiles.wordpress.org/madalin_themeisle/",
            "avatar": "https://secure.gravatar.com/avatar/dc731368836a7e30e5b34c9cf2ec3a63?s=96&d=monsterid&r=g",
            "display_name": "Madalin"
        }
    },
    "requires": "5.2",
    "tested": "6.6.1",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 88,
    "ratings": {
        "5": 170,
        "4": 18,
        "3": 8,
        "2": 6,
        "1": 21
    },
    "num_ratings": 223,
    "support_url": "https://wordpress.org/support/plugin/visualizer/",
    "support_threads": 3,
    "support_threads_resolved": 3,
    "active_installs": 30000,
    "downloaded": 1758734,
    "last_updated": "2024-07-26 11:06:00",
    "added": "2013-07-21",
    "homepage": "https://themeisle.com/plugins/visualizer-charts-and-graphs/",
    "sections": {
        "description": "<p><a href=\"https://themeisle.com/plugins/visualizer-charts-and-graphs/?utm_source=wpadmin&amp;utm_medium=readme&amp;utm_campaign=description\" rel=\"nofollow ugc\">Visualizer: Tables and Charts Manager for WordPress</a> is a powerful and easy to use plugin used to create, manage and embed interactive, responsive charts &amp; tables into your WordPress posts and pages.</p>\n<p>The plugin leverages the Google Visualization API, DataTables.net, and ChartJS libraries to deliver responsive and animated charts, graphs, and tables, ensuring excellent cross-browser compatibility and a seamless mobile experience. You can fully customize all aspects of the charts and tables to suit your needs. For enhanced data management features, including importing from Excel, CSV, Google Sheets, and more, consider exploring the <a href=\"https://themeisle.com/plugins/visualizer-charts-and-graphs/upgrade/?utm_source=wpadmin&amp;utm_medium=readme&amp;utm_campaign=pro-cta\" rel=\"nofollow ugc\">PRO version</a>.</p>\n<h3>🔗 HELPFUL LINKS</h3>\n<ul>\n<li>Want to see Visualizer in action before installing? <a href=\"https://demo.themeisle.com/visualizer/\" rel=\"nofollow ugc\">View Visualizer Demo</a> [You can also try Live Preview button above]</li>\n<li>Need any help with setup? <a href=\"https://docs.themeisle.com/collection/1560-visualizer-charts-and-graphs\" rel=\"nofollow ugc\">Check Documentation</a></li>\n<li>Don’t like reading? <a href=\"https://youtube.com/playlist?list=PLmRasCVwuvpT0Gu1myGW-Dyt2oh-BPuci&amp;si=S3o4BIyo3AYNh95w\" rel=\"nofollow ugc\">Check Youtube Playlist</a></li>\n<li>Interested in Visualizer Pro? <a href=\"https://themeisle.com/plugins/visualizer-charts-and-graphs/upgrade/?utm_source=wpadmin&amp;utm_medium=readme&amp;utm_campaign=pro-cta\" rel=\"nofollow ugc\">Know more about Visualizer PRO</a></li>\n</ul>\n<h3>Why You’ll Love Visualizer</h3>\n<ul>\n<li>\n<p><strong>Diverse Chart Options:</strong> Begin with essential chart types like line, pie, bar, and table in the free version. Elevate your data presentation with advanced chart types such as scatter, area, and geo available in the Pro version. The free version offers a comprehensive range of options that are perfect for various visualization needs.</p>\n</li>\n<li>\n<p><strong>Manual Data Entry:</strong> Input data manually for quick visualization tasks. This method provides ultimate control over the content and structure of your charts, making it simple to tailor data presentation directly within the plugin interface.</p>\n</li>\n<li>\n<p><strong>Ultimate Responsiveness:</strong> Crafted using HTML5/SVG technology, Visualizer charts ensure flawless functionality across all devices. This commitment to responsiveness guarantees that your data is not only accessible but also optimally displayed on desktops, tablets, and smartphones, enhancing user interaction and engagement.</p>\n</li>\n<li>\n<p><strong>Data Table Capabilities:</strong> In addition to our responsive charts and graphs, you can also add responsive tables to your posts and pages and customize them to your liking. Visualizer Pro lets you enhance them with features such as sorting capabilities, pagination, and search functions. From pricing tables to product tables, the possibilities are vast and customizable to meet any data presentation need.</p>\n</li>\n<li>\n<p><strong>Seamless Integration and Compatibility:</strong> Whether you&#8217;re using the Gutenberg editor or other page builders, Visualizer integrates effortlessly into your WordPress environment. This seamless compatibility allows for straightforward chart insertion and management.</p>\n</li>\n<li>\n<p><strong>Flexible and Customizable:</strong> Make the charts and tables truly your own. Visualizer offers an extensive set of configuration options to perfectly match the look and feel of your website. Utilize Google Chart Tools with their default settings for simplicity, or dive into customization if your site’s style requires a unique approach. Every chart and table exposes numerous options that customize its appearance and functionality, ensuring your visualizations integrate seamlessly into your pages.</p>\n</li>\n</ul>\n<p>These versatile data handling capabilities ensure that Visualizer Free is equipped to meet a wide range of data visualization requirements right out of the box. Perfect for bloggers, educators, small businesses, and more, Visualizer helps you turn raw data into compelling, interactive charts that engage and inform your audience.</p>\n<p><em>The above descriptions were partially taken from the Google Visualization API site</em></p>\n<h3>CHECK OUT A QUICK OVERVIEW OF VISUALIZER</h3>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/hQO_evnb_tQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>✨ YOU SHOULD USE VISUALIZER IF:</h3>\n<ul>\n<li>\n<p><strong>You Own a Personal or Small Business Website:</strong> You need a straightforward, powerful tool to enhance your website&#8217;s visual appeal with interactive charts and tables. Visualizer makes complex data understandable and engaging.</p>\n</li>\n<li>\n<p><strong>You Run an Educational or Financial Institution:</strong> For organizations that require regular reporting and data display, Visualizer offers comprehensive options for creating dynamic and informative charts and tables. This helps in better data analysis and presentation, aiding in decision-making and reporting.</p>\n</li>\n<li>\n<p><strong>You Aim to Enhance SEO and User Engagement:</strong> Using Visualizer’s interactive and responsive charts can significantly improve user engagement, keeping visitors on your site longer, which can positively impact your SEO rankings.</p>\n</li>\n<li>\n<p><strong>You are a Non-Profit Organizations:</strong> Non-profits can use Visualizer to display the impact of their initiatives through data. Create pie charts to show the distribution of spending or line charts to track donation trends over time, which can be powerful visuals for fundraising campaigns and annual reports.</p>\n</li>\n<li>\n<p><strong>You are Financial Advisors and Economists:</strong> Visualizer allows for detailed financial reporting and economic analyses with advanced chart types like candlestick and radar charts. These tools can be used to depict stock performances, economic cycles, or budget allocations, providing clients with clear insights into financial matters.</p>\n</li>\n<li>\n<p><strong>Regardless of Industry:</strong> With over 30,000 happy active users and 160+ 5-star ratings, Visualizer has been employed across a broad range of industries, including healthcare, marketing, education, and finance, demonstrating its versatility and effectiveness in any field.</p>\n</li>\n</ul>\n<p><strong>Types of charts you can create with Visualizer:</strong> Visualizer WordPress graph and charts plugin provides a variety of charts that are optimized to address your WordPress data visualization needs. In the free version, it has line charts, bar charts, pie charts, table charts. These charts are based on pure HTML5/SVG technology (adopting VML for old IE versions), so no extra plugins are required. Adding these charts to your page can be done in a few simple steps.</p>\n<ul>\n<li><strong>Table:</strong> Tables are extremely useful tools for displaying organized data. We use the datatable library to offer you endless customization options for any table needs you might have. <a href=\"https://demo.themeisle.com/visualizer/table-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Pie Chart:</strong> Pie charts are simple visualizations that allow you to easily illustrate the proportion of your data to your users. <a href=\"https://demo.themeisle.com/visualizer/pie-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Line Chart:</strong> You can display a series of data points connected with line segments using the line chart. <a href=\"https://demo.themeisle.com/visualizer/line-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Bar Chart:</strong> You can show grouped data with bars proportional to the values they represent using the bar chart. <a href=\"https://demo.themeisle.com/visualizer/bar-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Area Chart [PRO]:</strong> You can visually display quantitative data using the area chart. <a href=\"https://demo.themeisle.com/visualizer/area-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Geo Chart [PRO]:</strong> You can display a map of countries, continents, or regions with areas identified by the values you specify. <a href=\"https://demo.themeisle.com/visualizer/geo-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Column Chart [PRO]:</strong> You can use a column chart to show comparisons among different categories. <a href=\"https://demo.themeisle.com/visualizer/column-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Bubble Chart [PRO]:</strong> A bubble chart is a type of chart that displays three dimensions of data. Bubble charts can be considered a variation of the scatter plot, where data points are replaced with bubbles. <a href=\"https://demo.themeisle.com/visualizer/bubble-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Scatter Chart [PRO]:</strong> You can display values in Cartesian coordinates using the scatter chart. <a href=\"https://demo.themeisle.com/visualizer/scatter-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Gauge Chart [PRO]:</strong> You can build different gauge charts to indicate metrics like speed, performance, progress, or similar measures. <a href=\"https://demo.themeisle.com/visualizer/gauge-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Candlestick Chart [PRO]:</strong> A candlestick chart is a style of financial chart used to describe price movements of a security, derivative, or currency. <a href=\"https://demo.themeisle.com/visualizer/candlestick-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Timeline Chart [PRO]:</strong> You can group time-based values using the timeline chart. <a href=\"https://demo.themeisle.com/visualizer/timeline-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Combo Chart [PRO]:</strong> You can combine data series using different types of charts with the combo chart. <a href=\"https://demo.themeisle.com/visualizer/combo-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Polar Area Chart [PRO]:</strong> Polar charts are data visualizations best used for displaying multivariate observations with an arbitrary number of variables in the form of a two-dimensional chart. <a href=\"https://demo.themeisle.com/visualizer/polar-area-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Radar/Spider Chart [PRO]:</strong> A radar chart is a graphical method of displaying multivariate data in the form of a two-dimensional chart of three or more quantitative variables represented on axes starting from the same point. <a href=\"https://demo.themeisle.com/visualizer/radar-spider-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n</ul>\n<p><strong>🤝 ELEVATE YOUR DATA WITH VISUALIZER PREMIUM FEATURES</strong></p>\n<p>If you’re already benefiting from Visualizer, why not take your website to the next level with more powerful tools to enhance your data visualization capabilities and keep your audience engaged longer?</p>\n<ul>\n<li>\n<p><strong>Advanced Data Synchronization:</strong> Automatically sync your data sources to ensure your charts are always current without manual input.<br />\n<strong>USE CASE:</strong> 🔍 Sarah, a market analyst, leverages Advanced Data Synchronization to streamline her workflow. She sets her data sources to auto-update, ensuring her market trend charts are always accurate, saving her hours each week and enhancing her reports&#8217; credibility.</p>\n</li>\n<li>\n<p><strong>Multi-Language Support:</strong> Automatically translate your charts and data presentations into multiple languages, broadening your audience reach.<br />\n<strong>USE CASE:</strong> 🌍 Elena, who manages a multilingual educational platform, uses Multi-Language Support to provide data visualizations in several languages, effectively increasing her site&#8217;s global usability and accessibility.</p>\n</li>\n<li>\n<p><strong>Advanced User Permissions:</strong> Control who can view or edit your charts, perfect for teams needing to manage access at various levels.<br />\n<strong>USE CASE:</strong> 🛠️ Rachel, a project manager, configures user permissions to ensure that only relevant team members can edit financial forecasts, maintaining data integrity and security.</p>\n</li>\n<li>\n<p><strong>Import Data from Files:</strong> Upload CSV files directly into Visualizer. This feature is ideal for those who prepare data in spreadsheet tools like Microsoft Excel or Google Sheets, allowing for quick and easy data visualization.</p>\n</li>\n<li>\n<p><strong>Import Data from URLs:</strong> Keep your charts updated by importing data dynamically from external sources in CSV or JSON formats via URLs. This powerful feature is essential for displaying real-time or frequently updated data, reducing the need for manual updates.</p>\n</li>\n<li>\n<p><strong>Import from Other Charts:</strong> Seamlessly integrate data from other charts into new visualizations, facilitating easy data consolidation and comparison.</p>\n</li>\n<li>\n<p><strong>Import from WordPress:</strong> Directly pull data from your WordPress posts, pages, or custom post types to create dynamic charts that automatically update as your content changes.<br />\n<strong>USE CASE:</strong> ✍️ Benjamin, a digital marketing manager, uses this feature to track engagement across blog posts in real-time. He creates charts that update automatically with views and social shares, helping him quickly adjust content strategies based on what resonates with audiences.</p>\n</li>\n<li>\n<p><strong>Import from Database:</strong> Connect directly to your database to fetch data, ensuring your visualizations reflect the most up-to-date information available.</p>\n</li>\n<li>\n<p><strong>Data Filter:</strong> Apply filters to your data within Visualizer, enabling viewers to interact with and explore data in a more focused manner.<br />\n<strong>USE CASE:</strong> 🕵️‍♂️ Tom, a market researcher, implements data filters on his demographic analysis charts, allowing users to select specific variables such as age and income, thereby drilling down into personalized data insights.</p>\n</li>\n<li>\n<p><strong>Priority Support:</strong> Have access to our dedicated support team to help you resolve any technical issues swiftly, ensuring your visualizations are always performing optimally.</p>\n</li>\n</ul>\n<p>Unlock these premium features and more with Visualizer PRO!</p>\n<p><strong>Still have questions?</strong> Ask your pre-sales questions <a href=\"https://themeisle.com/contact/?utm_source=wpadmin&amp;utm_medium=readme&amp;utm_campaign=pre-sales\" rel=\"nofollow ugc\">here</a>, and we will get back to you promptly. Or, purchase with confidence and try it for yourself—we offer <strong>a 30-day no-questions-asked 100% money-back guarantee</strong>.</p>\n<p><strong>WE’RE HERE FOR YOU, AND WE TAKE ALL FEEDBACK SERIOUSLY</strong></p>\n<ul>\n<li>\n<p><strong>📚 Knowledge Base:</strong> We’ve created a complete documentation library and we’re still constantly updating with new tutorials.</p>\n</li>\n<li>\n<p><strong>📽️ Youtube Tutorials:</strong> Don’t like reading? We’ve created some YouTube tutorials to help you get started with the Visualizer plugin step by step.</p>\n</li>\n<li>\n<p><strong>🦸 Support Forum:</strong> We offer support to free version users here and try to reply within one business day.</p>\n</li>\n<li>\n<p><strong>🌟 Premium Support:</strong> We offer priority support for Plus license customers and live chat support for Infinite license customers.</p>\n</li>\n</ul>\n<p>If you have any feedback or feature suggestions for the Visualizer plugin, don’t hesitate to tell us. We read all feedback and ideas.</p>\n<p><strong>You’re in good hands</strong></p>\n<p>Visualizer is one of many great products by Themeisle. Join over 30,000+ Visualizer active users and half of a million Themeisle users from all over the world.</p>\n<p><strong>See what real users talk about us:</strong></p>\n<ul>\n<li>\n<p><a href=\"https://wordpress.org/support/topic/visualizer-is-amazing/\" rel=\"ugc\"><em>Visualizer is amazing!</em></a> &#8211; &#8220;Just what I was looking for to make my information available and looks pleasing!&#8221;</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/support/topic/great-plugin-for-bloggers-4/\" rel=\"ugc\"><em>Great Plugin for Bloggers</em></a> &#8211; &#8220;It’s a great plugin for new bloggers like me. It&#8217;s working seamlessly on my website. I am using this plugin for the last couple of weeks and I am loving it.&#8221;</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/support/topic/works-well-and-devs-are-responsive/\" rel=\"ugc\"><em>Works Well and Devs are Responsive</em></a> &#8211; &#8220;We are using it on a rather complicated multisite install. After much research, we went with this plugin for our editors&#8217; needs.&#8221;</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/support/topic/the-best-one-ive-found-2/\" rel=\"ugc\"><em>The Best One I’ve Found</em></a> &#8211; &#8220;After trying a couple of options, this was the one that worked the best.&#8221;</p>\n</li>\n</ul>\n",
        "installation": "<ol>\n<li>Upload the files to the <code>/wp-content/plugins/visualizer/</code> directory.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress.</li>\n</ol>\n",
        "faq": "\n<dt id='shortcode%20does%20not%20turn%20into%20graph'>\nShortcode does not turn into graph\n</h4>\n<p>\n<p>Pay attention that to turn your shortcodes into graphs, your theme has to have <code>&lt;?php wp_footer(); ?&gt;</code> call at the bottom of <strong>footer.php</strong> file.</p>\n</p>\n<dt id='is%20there%20any%20documentation%20available%20for%20this%20plugin%3F'>\nIs there any documentation available for this plugin?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/428-visualizer-charts-and-graphs-documentation\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/428-visualizer-charts-and-graphs-documentation</a></p>\n</p>\n<dt id='how%20to%20format%20chart%20series%20values%3F'>\nHow to format chart series values?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/672-how-to-format-series-values\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/672-how-to-format-series-values</a></p>\n</p>\n<dt id='how%20to%20create%20charts%20from%20your%20wordpress%20posts%3F'>\nHow to create charts from your WordPress posts?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/673-how-to-create-charts-from-your-wordpress-posts\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/673-how-to-create-charts-from-your-wordpress-posts</a></p>\n</p>\n<dt id='how%20to%20automatically%20sync%20charts%20with%20online%20files%3F'>\nHow to automatically sync charts with online files?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/674-how-to-automatically-sync-charts-with-online-files\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/674-how-to-automatically-sync-charts-with-online-files</a></p>\n</p>\n<dt id='how%20can%20i%20create%2Fadd%20a%20chart%3F'>\nHow can I create/add a chart?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/597-create-chart\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/597-create-chart</a></p>\n</p>\n<dt id='how%20can%20i%20edit%20a%20chart%3F'>\nHow can I edit a chart?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/602-how-can-i-edit-a-chart\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/602-how-can-i-edit-a-chart</a></p>\n</p>\n<dt id='how%20can%20i%20delete%20a%20chart%3F'>\nHow can I delete a chart?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/600-delete-chart\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/600-delete-chart</a></p>\n</p>\n<dt id='how%20can%20i%20clone%20a%20chart%3F'>\nHow can I clone a chart?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/598-clone-chart\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/598-clone-chart</a></p>\n</p>\n<dt id='how%20can%20i%20highlight%20a%20single%20bar%3F'>\nHow can I highlight a single bar?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/603-how-can-i-highlight-a-single-bar\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/603-how-can-i-highlight-a-single-bar</a></p>\n</p>\n<dt id='how%20can%20i%20populate%20chart%20series%20and%20data%20dynamically%3F'>\nHow can I populate chart series and data dynamically?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/605-how-can-i-populate-chart-series-and-data-dynamically\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/605-how-can-i-populate-chart-series-and-data-dynamically</a></p>\n</p>\n<dt id='how%20can%20i%20populate%20data%20from%20google%20spreadsheet%3F'>\nHow can I populate data from Google Spreadsheet?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/607-how-can-i-populate-data-from-google-spreadsheet\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/607-how-can-i-populate-data-from-google-spreadsheet</a></p>\n</p>\n<dt id='how%20can%20i%20import%20content%20from%20another%20chart%3F'>\nHow can I import content from another chart?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/609-how-can-i-import-content-from-another-chart\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/609-how-can-i-import-content-from-another-chart</a></p>\n</p>\n<dt id='how%20to%20export%20a%20chart%3F'>\nHow to export a chart?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/608-how-to-export-a-chart\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/608-how-to-export-a-chart</a></p>\n</p>\n<dt id='how%20can%20i%20edit%20the%20data%20manually%3F'>\nHow can I edit the data manually?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/610-how-can-i-edit-the-data-manually\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/610-how-can-i-edit-the-data-manually</a></p>\n</p>\n<dt id='how%20to%20enable%20frontend%20action%20buttons%3F'>\nHow to enable frontend action buttons?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/675-how-to-enable-frontend-action-buttons\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/675-how-to-enable-frontend-action-buttons</a></p>\n</p>\n<dt id='how%20to%20use%20google%20visualization%20variables%3F'>\nHow to use Google Visualization variables?\n</h4>\n<p>\n<p><a href=\"http://docs.themeisle.com/article/691-how-to-use-google-visualization-variables\" rel=\"nofollow ugc\">http://docs.themeisle.com/article/691-how-to-use-google-visualization-variables</a></p>\n</p>\n\n",
        "changelog": "<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.11.4...v3.11.5\" rel=\"nofollow ugc\">Version 3.11.5</a> (2024-07-17)</p>\n<ul>\n<li>Updated promotional links and buttons</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.11.3...v3.11.4\" rel=\"nofollow ugc\">Version 3.11.4</a> (2024-07-09)</p>\n<ul>\n<li>Fixed broken link in the Map settings of the Geo Chart</li>\n<li>Fixed the default cron job sync time for data synchronization [PRO]</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.11.2...v3.11.3\" rel=\"nofollow ugc\">Version 3.11.3</a> (2024-05-27)</p>\n<ul>\n<li>Fixed the rendering of Visualizer widgets in the Customizer</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.11.1...v3.11.2\" rel=\"nofollow ugc\">Version 3.11.2</a> (2024-05-23)</p>\n<ul>\n<li>Fixed Visualizer block widget not loading</li>\n<li>Improved the popup rendering</li>\n<li>Enhanced security</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.11.0...v3.11.1\" rel=\"nofollow ugc\">Version 3.11.1</a> (2024-05-14)</p>\n<ul>\n<li>Fixed the permissions of the plans</li>\n</ul>\n<h4><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.15...v3.11.0\" rel=\"nofollow ugc\">Version 3.11.0</a> (2024-05-13)</h4>\n<h4>Enhancements</h4>\n<ul>\n<li>Added a manual data edit feature to the free version of the plugin</li>\n<li>Improved the flow of chart creation</li>\n<li>Added a chart information panel: backend chart title &amp; quick shortcode access</li>\n<li>Line and Pie charts from the ChartJS library are now available for free users, along with library selection and relative images</li>\n<li>Improved wording in onboarding</li>\n<li>Improved workflow for creating charts via the Visualizer Gutenberg block</li>\n<li>Moved chart library selection to the top of the page and showing charts from the available library only</li>\n<li>Unified chart edition (removed duplicated chart settings in block editor)</li>\n<li>Added optional feature usage data</li>\n<li>Enhanced security</li>\n<li>Improved the UI of the database query option (visible database prefix, sample query, autocompleting table names) [PRO]</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.14...v3.10.15\" rel=\"nofollow ugc\">Version 3.10.15</a> (2024-05-10)</p>\n<ul>\n<li>Updated internal dependencies</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.13...v3.10.14\" rel=\"nofollow ugc\">Version 3.10.14</a> (2024-05-10)</p>\n<ul>\n<li>Updated internal dependencies</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.12...v3.10.13\" rel=\"nofollow ugc\">Version 3.10.13</a> (2024-04-17)</p>\n<h3>Fixes</h3>\n<ul>\n<li><strong>Updated internal dependencies:</strong> Enhanced performance and security.</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.11...v3.10.12\" rel=\"nofollow ugc\">Version 3.10.12</a> (2024-04-15)</p>\n<h3>Fixes</h3>\n<ul>\n<li><strong>Updated internal dependencies:</strong> Enhanced performance and security.</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.10...v3.10.11\" rel=\"nofollow ugc\">Version 3.10.11</a> (2024-04-01)</p>\n<h3>Fixes</h3>\n<ul>\n<li>Updated internal dependencies</li>\n<li>Improved E2E testing</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.9...v3.10.10\" rel=\"nofollow ugc\">Version 3.10.10</a> (2024-03-28)</p>\n<h3>Fixes</h3>\n<ul>\n<li>Fixed blueprint schema for Live Preview</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.8...v3.10.9\" rel=\"nofollow ugc\">Version 3.10.9</a> (2024-03-27)</p>\n<h3>Fixes</h3>\n<ul>\n<li>Visualizer live preview fixed</li>\n<li>Updated internal dependencies</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.7...v3.10.8\" rel=\"nofollow ugc\">Version 3.10.8</a> (2024-03-14)</p>\n<h3>Bug Fixes</h3>\n<ul>\n<li>Fix Google chart rendering condition for Classic Plugin</li>\n<li>Changes the speed and position of the loading bar</li>\n</ul>\n<h3>Improvements</h3>\n<ul>\n<li>Add a Live Preview button for the plugin page on wordpress.org</li>\n<li>Added NPS survey</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.6...v3.10.7\" rel=\"nofollow ugc\">Version 3.10.7</a> (2024-02-06)</p>\n<h3>Fixes</h3>\n<ul>\n<li>Rendering charts that are under tabs/hidden containers</li>\n<li>Updated dependencies</li>\n<li>Updated CTA buttons</li>\n<li>Updated UTM campaign links</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.5...v3.10.6\" rel=\"nofollow ugc\">Version 3.10.6</a> (2024-01-18)</p>\n<h3>Fixes</h3>\n<ul>\n<li>Enhanced security</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.4...v3.10.5\" rel=\"nofollow ugc\">Version 3.10.5</a> (2023-12-19)</p>\n<h3>Improvements</h3>\n<ul>\n<li><strong>Added chart responsive support</strong></li>\n<li><strong>SDK Updates</strong></li>\n</ul>\n<h3>Bug Fixes</h3>\n<ul>\n<li><strong>Fixed chart data filter issue</strong></li>\n<li><strong>Fixed animation issue fusion builder</strong></li>\n<li><strong>Fixed live import issue with Gutenberg block</strong></li>\n<li><strong>Fixed tooltip text rendering issue in ChartJS</strong></li>\n<li><strong>Fixed onboarding chart import issue</strong></li>\n<li><strong>Removed PHP deprecated function</strong></li>\n<li><strong>Fixed compatibility issue with WP VIP</strong></li>\n<li><strong>Fixed PHP 8.1 deprecated error</strong></li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.3...v3.10.4\" rel=\"nofollow ugc\">Version 3.10.4</a> (2023-08-17)</p>\n<ul>\n<li>Updated dependencies</li>\n<li>Updated WordPress version required to 5.2 or higher</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.2...v3.10.3\" rel=\"nofollow ugc\">Version 3.10.3</a> (2023-06-13)</p>\n<ul>\n<li>Removed branding label</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.1...v3.10.2\" rel=\"nofollow ugc\">Version 3.10.2</a> (2023-06-05)</p>\n<ul>\n<li>Added About Us page integration</li>\n<li>Updated dependencies</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.10.0...v3.10.1\" rel=\"nofollow ugc\">Version 3.10.1</a> (2023-05-24)</p>\n<ul>\n<li>Fixed data tables horizontal scrolling issue</li>\n<li>Added legend position default label text</li>\n<li>Added tooltip default label text</li>\n<li>Fixed Gutenberg block error</li>\n<li>Fixed table chart rendering issue in Gutenberg block</li>\n<li>Fixed compatibility issue with the FSE editor</li>\n<li>Fixed compatibility issue with WP 5.6</li>\n<li>Fixed console error when importing charts from others</li>\n<li>Fixed pagination enable/disable issue</li>\n<li>Fixed editor rows limitation issue</li>\n</ul>\n<h4><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.9.7...v3.10.0\" rel=\"nofollow ugc\">Version 3.10.0</a> (2023-04-04)</h4>\n<ul>\n<li>Added a setup wizard onboarding page</li>\n<li>Fixed empty chart issue</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.9.6...v3.9.7\" rel=\"nofollow ugc\">Version 3.9.7</a> (2023-03-30)</p>\n<ul>\n<li>Improved chart actions icons</li>\n<li>Updated WordPress core tested up to version</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.9.5...v3.9.6\" rel=\"nofollow ugc\">Version 3.9.6</a> (2023-03-20)</p>\n<ul>\n<li>Fixed custom format issue in ChartJS</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.9.4...v3.9.5\" rel=\"nofollow ugc\">Version 3.9.5</a> (2023-01-30)</p>\n<ul>\n<li>Improved security by escaping shortcode attribute before render</li>\n<li>Compatibility with PHP 8.2</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.9.3...v3.9.4\" rel=\"nofollow ugc\">Version 3.9.4</a> (2023-01-12)</p>\n<ul>\n<li>Fixed the lock of PRO features bypass</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.9.2...v3.9.3\" rel=\"nofollow ugc\">Version 3.9.3</a> (2023-01-05)</p>\n<ul>\n<li>Fixed the chart refresh problem when importing from CSV <a href=\"https://github.com/Codeinwp/visualizer/issues/970\" rel=\"nofollow ugc\">#970</a></li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.9.1...v3.9.2\" rel=\"nofollow ugc\">Version 3.9.2</a> (2022-12-21)</p>\n<ul>\n<li>Fixed Geo chart [PRO] flickering issue</li>\n<li>Added disable legend option for ChartJS chart</li>\n<li>Enhanced security</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.9.0...v3.9.1\" rel=\"nofollow ugc\">Version 3.9.1</a> (2022-11-17)</p>\n<ul>\n<li>Fixed PHP error when Polylang plugin is activated <a href=\"https://github.com/Codeinwp/visualizer/issues/960\" rel=\"nofollow ugc\">#960</a></li>\n</ul>\n<h4><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.8.1...v3.9.0\" rel=\"nofollow ugc\">Version 3.9.0</a> (2022-11-10)</h4>\n<ul>\n<li>Fixed table chart decimal number issue Decimal Numbers are ignored and not displayed <a href=\"https://github.com/Codeinwp/visualizer/issues/955\" rel=\"nofollow ugc\">#955</a></li>\n<li>Fix the scrollbar issue that happens on WP 6.1 version [WP 6.1] Chart permissions selector is not scrollable <a href=\"https://github.com/Codeinwp/visualizer/issues/950\" rel=\"nofollow ugc\">#950</a></li>\n<li>Fix PHP Warning Warning when copy (frontend action) is enabled <a href=\"https://github.com/Codeinwp/visualizer/issues/949\" rel=\"nofollow ugc\">#949</a></li>\n<li>Compatibility with the WPML translation plugin for translating charts [PRO feature] add support for string translations <a href=\"https://github.com/Codeinwp/visualizer/issues/731\" rel=\"nofollow ugc\">#731</a></li>\n<li>Integration with Woocommerce Data endpoints for creating charts [PRO feature]</li>\n<li>Show new features on chart library page</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.8.0...v3.8.1\" rel=\"nofollow ugc\">Version 3.8.1</a> (2022-10-12)</p>\n<ul>\n<li>Change copy shortcode icon to clone a chart We can change copy Short Code icon <a href=\"https://github.com/Codeinwp/visualizer/issues/945\" rel=\"nofollow ugc\">#945</a></li>\n<li>Fix temp file creation issue on instawp selecting the line chart is not working on instawp <a href=\"https://github.com/Codeinwp/visualizer/issues/940\" rel=\"nofollow ugc\">#940</a></li>\n<li>Fix control Type error</li>\n<li>Fixed simple editor scrolling issue</li>\n<li>Fix filter broken layout</li>\n<li>Fix chartJs javascript error when rendering multiple charts</li>\n</ul>\n<h4><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.7.12...v3.8.0\" rel=\"nofollow ugc\">Version 3.8.0</a> (2022-09-21)</h4>\n<ul>\n<li>Add data filter support for the charts</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.7.11...v3.7.12\" rel=\"nofollow ugc\">Version 3.7.12</a> (2022-09-07)</p>\n<ul>\n<li>Fixed compatibility issue with some themes and plugins <a href=\"https://github.com/Codeinwp/visualizer/issues/933\" rel=\"nofollow ugc\">#933</a></li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.7.10...v3.7.11\" rel=\"nofollow ugc\">Version 3.7.11</a> (2022-08-30)</p>\n<ul>\n<li>Fix update axis baseline color <a href=\"https://github.com/Codeinwp/visualizer/issues/925\" rel=\"nofollow ugc\">#925</a></li>\n<li>Update more features images <a href=\"https://github.com/Codeinwp/visualizer/issues/926\" rel=\"nofollow ugc\">#926</a></li>\n<li>Fix update minor grid line field <a href=\"https://github.com/Codeinwp/visualizer/issues/924\" rel=\"nofollow ugc\">#924</a></li>\n<li>Add new filter for container attributes <a href=\"https://github.com/Codeinwp/visualizer/issues/922\" rel=\"nofollow ugc\">#922</a></li>\n<li>Fix axis data format issue <a href=\"https://github.com/Codeinwp/visualizer/issues/920\" rel=\"nofollow ugc\">#920</a></li>\n<li>Chart unique title <a href=\"https://github.com/Codeinwp/visualizer/issues/915\" rel=\"nofollow ugc\">#915</a></li>\n<li>Fix block back button issue <a href=\"https://github.com/Codeinwp/visualizer/issues/930\" rel=\"nofollow ugc\">#930</a></li>\n<li>Userguide broken documentation link <a href=\"https://github.com/Codeinwp/visualizer/issues/918\" rel=\"nofollow ugc\">#918</a></li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.7.9...v3.7.10\" rel=\"nofollow ugc\">Version 3.7.10</a> (2022-07-05)</p>\n<ul>\n<li>Fix watermark/copyright opacity wrong value <a href=\"https://github.com/Codeinwp/visualizer/issues/910\" rel=\"nofollow ugc\">#910</a></li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.7.8...v3.7.9\" rel=\"nofollow ugc\">Version 3.7.9</a> (2022-06-22)</p>\n<ul>\n<li>Fix branding bad HTML</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.7.7...v3.7.8\" rel=\"nofollow ugc\">Version 3.7.8</a> (2022-06-21)</p>\n<ul>\n<li>Add the description field in the pie chart</li>\n<li>Fix Label other is not visible on the pie chart</li>\n<li>Fix the pagination issue in the chart library</li>\n<li>Update dependencies</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.7.6...v3.7.7\" rel=\"nofollow ugc\">Version 3.7.7</a> (2022-05-31)</p>\n<ul>\n<li>Harden security by enforcing escaped urls.</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.7.5...v3.7.6\" rel=\"nofollow ugc\">Version 3.7.6</a> (2022-05-26)</p>\n<ul>\n<li>Fix PHP 8.0 or above compatibility issue</li>\n<li>Fix the space missing between the id and class attributes of the charts</li>\n<li>Fix compatibility issue with Ultimate Coupons for WooCommerce Free plugin</li>\n<li>Fix charts placed in accordion (tabs) that do not load properly</li>\n<li>Fix conflict with translation plugins</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.7.4...v3.7.5\" rel=\"nofollow ugc\">Version 3.7.5</a> (2022-03-17)</p>\n<ul>\n<li>Fix display long hAxis text issue</li>\n<li>Improve features discoverability.</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.7.3...v3.7.4\" rel=\"nofollow ugc\">Version 3.7.4</a> (2022-02-07)</p>\n<ul>\n<li>Fix multiple lazy load charts issue</li>\n<li>Tested up to WordPress 5.9 version</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.7.2...v3.7.3\" rel=\"nofollow ugc\">Version 3.7.3</a> (2022-01-19)</p>\n<ul>\n<li>Fix multiple charts lazy rendering issue</li>\n<li>Upgrade jQuery UI core library CDN</li>\n<li>Fix console error when rendering multiple charts</li>\n<li>Keep only Line / Pie / bar / Table charts in free version</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.7.1...v3.7.2\" rel=\"nofollow ugc\">Version 3.7.2</a> (2021-12-20)</p>\n<ul>\n<li>Add latest chartJS library support in the bar chart</li>\n<li>Fix horizontal axis showing date format in Bar chart</li>\n<li>Fix orientation rotate issue in mobile</li>\n<li>CSS performance improvements</li>\n<li>Improve JS performance</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.7.0...v3.7.1\" rel=\"nofollow ugc\">Version 3.7.1</a> (2021-11-17)</p>\n<ul>\n<li>[Feat] Allow charts to render in dashboard areas via 3rd party plugins like Dashboard Widgets Suite</li>\n<li>[Fix] Changing Line Chart series style to dot on some series changes the order of tooltip information</li>\n<li>[Fix] Problem with X-Axis of Line chart on Safari if date/datetime is used as values</li>\n<li>[Fix] Multiple Visualizer charts causing rendering issues (blank page)</li>\n<li>[Fix] Charts are not resizing on landscape view on mobile</li>\n<li>[Fix] Notices/Warnings appear on the front-end if the user is not logged in for some charts</li>\n<li>[Fix] Radar/Spider Chart Tooltip in PRO does not show the data value</li>\n</ul>\n<h4><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.6.1...v3.7.0\" rel=\"nofollow ugc\">Version 3.7.0</a> (2021-10-07)</h4>\n<h4>Features</h4>\n<ul>\n<li>Add option to enable/disable save the chart image</li>\n<li>Enhanced caching</li>\n</ul>\n<h4>Fixes</h4>\n<ul>\n<li>Fix undefined variable errors when using Gutenberg blocks</li>\n<li>Fix broken chart in iOS and Safari</li>\n<li>Fix custom refresh time support for DB chart</li>\n<li>Fix table placed inside accordion cannot be scrolled down (refreshes all the time)</li>\n<li>Fix pagination doesn&#8217;t work in the library</li>\n<li>Fix HTML entities in JSON break Visualizer Table Chart</li>\n<li>Fix string type columns affect the target of the formatting applied to a number column</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.6.0...v3.6.1\" rel=\"nofollow ugc\">Version 3.6.1</a> (2021-08-04)</p>\n<ul>\n<li>Fix broken dropdown style issue</li>\n<li>Add block support in widget area</li>\n<li>Add wp alpha color picker support</li>\n<li>Fix broken chart layout issue when add long title</li>\n</ul>\n<h4><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.5.1...v3.6.0\" rel=\"nofollow ugc\">Version 3.6.0</a> (2021-07-08)</h4>\n<h3>Features</h3>\n<ul>\n<li>Adds option to render chart as image</li>\n<li>Automatically render chart as image on AMP</li>\n</ul>\n<h3>Fixes</h3>\n<ul>\n<li>[Chart Type: TABLE] When adding a blank header, the last column of the table disappears</li>\n<li>Styling is not applied to Chart Area for Table Chart ( Margin, Width, Height)</li>\n<li>Improve compatibility with Site Kit by Google</li>\n<li>Loading icon doesn&#8217;t disappear until you edit the chart again [Line Chart]</li>\n<li>Broken chart if used inside an accordion (expand/collapse)</li>\n</ul>\n<p><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.5.0...v3.5.1\" rel=\"nofollow ugc\">Version 3.5.1</a> (2021-05-25)</p>\n<ul>\n<li>Fix compatibility with 3rd party plugins which use the same js library as Visualizer <a href=\"https://github.com/Codeinwp/visualizer/issues/801\" rel=\"nofollow ugc\">#801</a></li>\n<li>Fix fatal error when a new chart is created on PHP 8 <a href=\"https://github.com/Codeinwp/visualizer/issues/795\" rel=\"nofollow ugc\">#795</a></li>\n<li>Chart doesn&#8217;t get refreshed automatically when the JSON endpoint is used as the data source</li>\n</ul>\n<h4>Features:</h4>\n<ul>\n<li>Adds option to add schema.org Dataset for license and creator <a href=\"https://github.com/Codeinwp/visualizer/issues/794\" rel=\"nofollow ugc\">#794</a></li>\n</ul>\n<h4><a href=\"https://github.com/Codeinwp/visualizer/compare/v3.4.11...v3.5.0\" rel=\"nofollow ugc\">Version 3.5.0</a> (2021-04-28)</h4>\n<h4>Fixes</h4>\n<ul>\n<li>Permissions tab disappears after a user modifies a chart&#8217;s data</li>\n<li>Conflict with Edit Flow plugin</li>\n<li>Improve compatibility with Ninja Forms</li>\n<li>Fix for color for Minor Grid Lines not working</li>\n</ul>\n<h4>Features</h4>\n<ul>\n<li>Add support for key:value header to access JSON endpoints</li>\n<li>Option to download CSV data of the chart without the row with series type</li>\n</ul>\n<h4>3.4.11 &#8211; 2021-02-16</h4>\n<p>[Feat] Tested up to WP 5.6</p>\n<h4>3.4.10 &#8211; 2020-12-09</h4>\n<ul>\n<li>[Fix] Compatibility with Composer 2.0</li>\n</ul>\n<h4>3.4.9 &#8211; 2020-11-26</h4>\n<ul>\n<li>[Fix] Pie chart slices offset problem in the Gutenberg editor</li>\n<li>[Fix] Warning is thrown when remote file is used as source</li>\n<li>[Fix] Bubble chart legend position not working in the Gutenberg editor</li>\n</ul>\n<h4>3.4.8 &#8211; 2020-09-29</h4>\n<ul>\n<li>[Fix] Option to edit charts imported from JSON</li>\n</ul>\n<h4>3.4.7 &#8211; 2020-09-21</h4>\n<ul>\n<li>\n<ul>\n<li>[Fix] Import from JSON: Reordering columns only reorders the label, not the associated data</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>[Fix] numberFormat option doesn&#8217;t apply in Bar charts when using annotations</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>[Fix] Google GEO chart is not rendering if 3rd data column is added</li>\n</ul>\n</li>\n</ul>\n<h4>3.4.6 &#8211; 2020-08-11</h4>\n<ul>\n<li>\n<ul>\n<li>[Feat] Show chart ID in the chart library</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>[Fix] Compatibility with WP 5.5</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>[Fix] Google charts: Series number format not applying in the Gutenberg editor</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>[Fix] Google Table chart does not display chart if boolean values are specified</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>[Fix] Duplicated enque for jsapi loader</li>\n</ul>\n</li>\n</ul>\n<h4>3.4.5 &#8211; 2020-07-08</h4>\n<ul>\n<li>[Feat] New Google Table Charts</li>\n<li>[Feat] Option for lazy loading Google Charts</li>\n<li>[Feat] Option to easily copy chart shortcode code</li>\n<li>[Fix] Remove Inside the Chart option for the legend position for Google Pie charts</li>\n</ul>\n<h4>3.4.4 &#8211; 2020-06-16</h4>\n<ul>\n<li>[Feat] Option to download charts as .png images</li>\n<li>[Fix] Make UI more intuitive when a chart is missing in the editor</li>\n<li>[Fix] Clicking Copy chart shows the Copied message multiple times</li>\n<li>[Fix] Conflict with Modern Events Calendar plugin</li>\n<li>[Fix] Chart size ( width and height ) options not working for ChartJS charts</li>\n<li>[Fix] Resizing the window causes annotation-based charts to throw an error</li>\n<li>[Fix] Remove Inside the Chart option as legend position for Google Pie charts</li>\n<li>[Fix] Clicking Advanced Options panel breaks Bubble chart</li>\n<li>[Fix] Missing posts revisions on chart update</li>\n</ul>\n<h4>3.4.3 &#8211; 2020-05-04</h4>\n<ul>\n<li>[Feat] Improved chart creation UX</li>\n<li>[Feat] New option to control the number of charts per page in the Charts Library</li>\n<li>[Feat] New option for filtering/ordering charts in the Charts Library</li>\n<li>[Feat] Support for custom codes for the boolean data type in Table charts</li>\n<li>[Fix] Support for displaying apostrophes in charts</li>\n<li>[Fix] Visualizer button layout in the Classic block</li>\n<li>[Fix] Bulk activation of plugin aborts activation of subsequent plugins</li>\n</ul>\n<h4>3.4.2 &#8211; 2020-02-17</h4>\n<ul>\n<li>New Cypress tests for the Gutenberg block</li>\n</ul>\n<h4>3.4.1 &#8211; 2020-02-14</h4>\n<ul>\n<li>[Fix] Insert chart button in the classic block</li>\n<li>[Fix for Pro version] Import from chart did not work</li>\n</ul>\n<h4>3.4.0 &#8211; 2020-02-13</h4>\n<ul>\n<li>[Feat] Support for authentication for JSON import</li>\n<li>[Feat] New chart type: Bubble</li>\n<li>[Feat] Combine one-time import and schedule import into a single control for an online .csv file import</li>\n<li>[Feat] Add support for annotations and other roles</li>\n<li>[Feat] For every chart show the last updated date and any error that exists</li>\n<li>[Feat] Tested up to WP 5.3</li>\n<li>[Fix] When new data is imported using csv/url, the manual editor still show old data</li>\n<li>[Fix] Having SCRIPT_DEBUG on causes issues in real time update of charts</li>\n<li>[Fix] Table chart: Error appears when trying to import from JSON</li>\n<li>[Fix] PHP Fatal error: Uncaught Error: Cannot unset string offsets</li>\n<li>[Fix] Long responsive table can overflow on smaller screens</li>\n</ul>\n<h4>3.3.4 &#8211; 2019-11-15</h4>\n<ul>\n<li>Fix issue with table chart not loading in the block editor</li>\n</ul>\n<h4>3.3.3 &#8211; 2019-11-12</h4>\n<ul>\n<li>Tested upto WordPress 5.3</li>\n</ul>\n<h4>3.3.2 &#8211; 2019-10-03</h4>\n<ul>\n<li>Add support for Dataset schema</li>\n<li>Horizontal Axis formatting should apply to tooltips</li>\n</ul>\n<h3>3.3.1 &#8211; 2019-09-28</h3>\n<ul>\n<li>Increase minimum requirement to PHP 5.6</li>\n<li>Fixed issue with loading customization.js on multisites</li>\n<li>Fixed issue with manually editing a remotely loaded chart</li>\n<li>Fixed issues with cloning</li>\n<li>Fixed issues with ChartJS assigning default colors</li>\n<li>Fix security issues in block editor</li>\n</ul>\n<h3>3.3.0 &#8211; 2019-08-14</h3>\n<ul>\n<li>Add support for ChartJS</li>\n<li>Add alpha color picker for supported charts</li>\n<li>Fix issue with some options of DataTable</li>\n<li>Include DataTable charts in block editor</li>\n<li>Fix issue with import from JSON not working with some sources</li>\n<li>Add menu and onboarding page</li>\n<li>Fix issue with frontend action checkboxes</li>\n<li>Improve UX in advanced settings</li>\n</ul>\n<h3>3.2.1 &#8211; 2019-05-05</h3>\n<ul>\n<li>Fix issue with async loading of scripts</li>\n</ul>\n<h3>3.2.0 &#8211; 2019-05-03</h3>\n<ul>\n<li>Add support for charts in AMP requests</li>\n<li>Add support to show charts from JSON/REST endpoints</li>\n<li>Fix loading of Google Visualization javascript files</li>\n<li>Add simple editors for editing chart data</li>\n<li>Tested up to WP 5.2</li>\n</ul>\n<h3>3.1.3 &#8211; 2019-02-24</h3>\n<ul>\n<li>Fix issue with changing column settings of the last column in table chart</li>\n<li>Add support for query language to get subset of data from Google Spreadsheet</li>\n<li>Fix conflict with jquery 3.3.x</li>\n<li>Migrated PHPExcel to PhpSpreadsheet</li>\n<li>Front end action &#8216;print&#8217; should print the chart and fall back to printing the data</li>\n<li>Fix issue with table chart not showing in IE</li>\n<li>Fix issue with multiple instances of same chart not showing</li>\n<li>Fix issue with date type column does not work with Combo charts</li>\n<li>Tested with WP 5.1</li>\n</ul>\n<h3>3.1.2 &#8211; 2018-12-06</h3>\n<ul>\n<li>Fix bug &#8220;Warning: A non-numeric value encountered&#8221;</li>\n<li>Tested with WP 5.0</li>\n</ul>\n<h3>3.1.1 &#8211; 2018-12-05</h3>\n<ul>\n<li>Fix issue with Gutenberg support</li>\n<li>Fix issue with loading new Table chart</li>\n<li>Fix options that don&#8217;t work correctly with some charts</li>\n</ul>\n<h3>3.1.0 &#8211; 2018-12-03</h3>\n<ul>\n<li>Add Table chart</li>\n<li>Fix date format in sample files</li>\n</ul>\n<h3>3.0.12 &#8211; 2018-10-11</h3>\n<ul>\n<li>Added filter to enable users to change schedule of charts.</li>\n<li>Fixed bug with line chart with timeofday column.</li>\n<li>Fixed bug with scheduled charts that sometimes did not show updated data.</li>\n<li>Javascript can be customized on a per user basis that will not be wiped out on update.</li>\n</ul>\n<h3>3.0.11 &#8211; 2018-08-15</h3>\n<ul>\n<li>Fixed issue with the Series Settings options for the Table Chart</li>\n<li>Fixed issue with chart showing &#8220;Table has no columns&#8221; with remote sources</li>\n</ul>\n<h3>3.0.10 &#8211; 2018-07-20</h3>\n<ul>\n<li>Fixed problem with chart reverting to the default values</li>\n<li>Fixed problem with Boolean column type</li>\n<li>Fixed problem with the Geo chart type not saving colors options</li>\n</ul>\n<h3>3.0.9 &#8211; 2018-07-12</h3>\n<ul>\n<li>New chart title option for the back-end of the charts that don&#8217;t allow a title on the front-end</li>\n<li>Store the png images of the charts in a global array that can be used in JS</li>\n<li>Added options for charts animations</li>\n</ul>\n<h3>3.0.8 &#8211; 2018-06-27</h3>\n<ul>\n<li>Added revision support for the chart post type</li>\n<li>Added both % and Value to the Pie Slice</li>\n<li>Use the blog locale for Visualizer&#8217;s options</li>\n<li>Fixed issue with data being fetched from the remote source every single time the chart was shown</li>\n<li>Fixed issue with scheduled charts not being updated if one of the scheduled charts is deleted</li>\n</ul>\n<h3>3.0.7 &#8211; 2018-03-26</h3>\n<ul>\n<li>Adds insert button in chart library.</li>\n<li>Remove frontend assets where they are not needed.</li>\n<li>Improve non-English charts compatibility.</li>\n<li>Adds a filter to change charts locale.</li>\n</ul>\n<h3>3.0.6 &#8211; 2018-02-27</h3>\n<ul>\n<li>Fix UTF-8 support while saving the data.</li>\n<li>Improve editing experience.</li>\n<li>Improves compatibility with Premium version.</li>\n<li>Adds chart button into TinyMCE editor.</li>\n</ul>\n<h3>3.0.5 &#8211; 2018-01-05</h3>\n<ul>\n<li>Fix chart rendering bug in firefox.</li>\n<li>Fix review notification.</li>\n</ul>\n<h3>3.0.4 &#8211; 2017-11-27</h3>\n<ul>\n<li>Fix for review message notification.</li>\n</ul>\n<h3>3.0.3 &#8211; 2017-11-16</h3>\n<ul>\n<li>Adds compatibility with WordPress 4.9.</li>\n</ul>\n<h3>3.0.2 &#8211; 2017-10-10</h3>\n<ul>\n<li>Fix dependency for composer dependencies.</li>\n</ul>\n<h3>3.0.1 &#8211; 2017-10-06</h3>\n<ul>\n<li>Improved compatibility with various theme and plugins.</li>\n<li>Fix for chart type selection when creation from media popup.</li>\n</ul>\n<h3>3.0.0 &#8211; 2017-09-05</h3>\n<ul>\n<li>Adds support manual configuration according to Google Visualization API.</li>\n<li>Improves compatibility with more features from the pro version.</li>\n</ul>\n<h3>2.2.0 &#8211; 2017-08-16</h3>\n<ul>\n<li>Added custom number format for pie chart.</li>\n<li>Added frontend actions buttons ( Print, Export to CSV, Export to Excel, Copy)</li>\n</ul>\n<h3>2.1.9 &#8211; 2017-07-10</h3>\n<ul>\n<li>Fixed display error with hex color.</li>\n</ul>\n<h3>2.1.8 &#8211; 2017-07-03</h3>\n<ul>\n<li>Added chart title into library.</li>\n<li>Fixed SDK issues with dashboard widget.</li>\n</ul>\n<h3>2.1.7</h3>\n<ul>\n<li>Updated sdk loading logic.</li>\n</ul>\n<h3>2.1.4</h3>\n<ul>\n<li>Fixed issues with non-latin chars on CSV files to import.</li>\n</ul>\n<h3>2.1.2</h3>\n<ul>\n<li>Fixed priority issue with wp_enqueue_media</li>\n<li>Added latest version of sdk</li>\n</ul>\n<h3>2.1.1</h3>\n<ul>\n<li>Fixed charts bliking on some themes.</li>\n</ul>\n<h3>2.1.0</h3>\n<ul>\n<li>Fixed geomap issue with apikey.</li>\n<li>Fixed responsive issues on tabbed interface and page builders.</li>\n<li>Added compatibility with premium import from posts/page feature.</li>\n</ul>\n<h3>2.0.4</h3>\n<ul>\n<li>Fixed resize issue in the library page.</li>\n</ul>\n<h3>2.0.0</h3>\n<ul>\n<li>Improved design and layout to support multiple datasources.</li>\n<li>Added new integrations in the Pro version.</li>\n<li>Added opt-in for tracking.</li>\n</ul>\n<h3>1.7.6</h3>\n<ul>\n<li>Fixed issue when using the same shortcode multiple times on the same page.</li>\n</ul>\n<h3>1.7.5</h3>\n<ul>\n<li>Removed footer banner upsell</li>\n<li>Fixed series settings issue</li>\n<li>Fixed issue with comas being used in numbers</li>\n</ul>\n<h3>1.7.2</h3>\n<ul>\n<li>Improved charts responsive system</li>\n</ul>\n<h3>1.7.1</h3>\n<ul>\n<li>Fixed grid lines error links</li>\n</ul>\n<h3>1.7.0</h3>\n<ul>\n<li>Fixed responsive issues</li>\n<li>Fixed issues with zero margin values</li>\n<li>Fixed import issue</li>\n</ul>\n<h3>1.6.6</h3>\n<ul>\n<li>Fixed charts resizing on tabbed content</li>\n</ul>\n<h3>1.6.5</h3>\n<ul>\n<li>Fixed responsive issue</li>\n<li>Fixed no axis text color for line and bar charts</li>\n</ul>\n<h3>1.6.0</h3>\n<ul>\n<li>Fixed security issue when importing charts</li>\n<li>Removed pointer for the pro version</li>\n<li>Fixed charts import from media library</li>\n<li>Added support to show legend on the left side</li>\n</ul>\n<h3>1.5.6</h3>\n<ul>\n<li>Added support for 3 more chart types</li>\n<li>Fixed issue with charts not saving</li>\n</ul>\n<h3>1.5.5</h3>\n<ul>\n<li>Added export for charts</li>\n<li>Enable default value for focus target. Fixed issue with hover which was not working on some machines.</li>\n</ul>\n<h3>1.5.4</h3>\n<ul>\n<li>Added free search text over graphs</li>\n</ul>\n<h3>1.5.2</h3>\n<ul>\n<li>Added step2 and 3 into step 1</li>\n</ul>\n<h3>1.5.1</h3>\n<ul>\n<li>Fixed bug with from web button</li>\n</ul>\n<h3>1.5</h3>\n<ul>\n<li>Added support for live editor</li>\n<li>Added support for importing data from other charts</li>\n<li>Added filter for chart settings</li>\n<li>Fixed bug when zero was not working on the charts</li>\n</ul>\n<h3>1.4.2.3</h3>\n<ul>\n<li>Implemented ability to edit horizontal and vertical axis number format for bar and column charts</li>\n</ul>\n<h3>1.4.2.2</h3>\n<ul>\n<li>Added ability to pass a class for chart wrapper div</li>\n<li>Added proper label for custom post type</li>\n</ul>\n<h3>1.4.2.1</h3>\n<ul>\n<li>Fixed issue with download_url function which not exists at front end</li>\n<li>Added functionality which prevents direct access to the plugin folder</li>\n</ul>\n<h3>1.4.2</h3>\n<ul>\n<li>Fixed remote CSV uploading issue when allow_url_fopen option is disabled in php.ini</li>\n<li>Replaced flattr image on widget and added donate link to plugin meta data</li>\n<li>Added notification message at library page when allow_url_fopen option is disabled</li>\n</ul>\n<h3>1.4.1.1</h3>\n<ul>\n<li>Removed CSV parser escape constant to prevent warnings which appears when PHP 5.2.x or less is used</li>\n</ul>\n<h3>1.4.1</h3>\n<ul>\n<li>Fixed issue which prevents the plugin working on SSL backend</li>\n<li>Fixed issue with CSV file uploading in IE and other browsers</li>\n<li>Fixed issue with empty series, which appears due to leading space in a source file</li>\n<li>Added ability to define custom delimiter, enclosure and escape variables for CSV parsing</li>\n</ul>\n<h3>1.4</h3>\n<ul>\n<li>Implemented aggregation target and selection mode options for candlestick chart</li>\n<li>Implemented focus target and data opacity for columnar chars</li>\n<li>Implemented data opacity and interpolate nulls settings for line chart</li>\n<li>Implemented ability to edit tooltip settings</li>\n<li>Implemented new settings for linear charts like selection mode and aggregation target</li>\n<li>Implemented area and point opacity settings for area chart</li>\n<li>Implemented new settings for pie chart like pie hole, start angle and slice offset</li>\n<li>Implemented ability to select a color for chart title and legend items</li>\n<li>Fixed number formatting settings for linear charts, from now it works only for axis labels</li>\n<li>Reworked general settings section by moving title and font settings into separate groups</li>\n</ul>\n<h3>1.3.0.2</h3>\n<ul>\n<li>Replaced links to github wiki</li>\n</ul>\n<h3>1.3.0.1</h3>\n<ul>\n<li>Added Flattr button</li>\n</ul>\n<h3>1.3.0</h3>\n<ul>\n<li>Implemented ability to set number and date formatters</li>\n<li>Implemented ability to select transparent background for a chart</li>\n<li>Fixed JS bugs which appear when post type editor support is disabled</li>\n<li>Fixed issue with NULL values for numeric series</li>\n<li>Fixed invalid charts rendering at &#8220;Add Media&#8221; library</li>\n<li>Fixed compatibility issue with another Google API related plugins</li>\n<li>Added &#8220;rate the plugin&#8221; box</li>\n</ul>\n<h3>1.2.0</h3>\n<ul>\n<li>Implemented minor grid lines settings.</li>\n<li>Implemented view window settings.</li>\n<li>Horizontal and vertical axes settings were split into separate groups.</li>\n</ul>\n<h3>1.1.4</h3>\n<ul>\n<li>Bug with float values has been fixed.</li>\n</ul>\n<h3>1.1.3</h3>\n<ul>\n<li>Issue with &#8220;fseek warning&#8221; for Google Spreadsheet document source, was fixed.</li>\n</ul>\n<h3>1.1.2</h3>\n<ul>\n<li>Compatibility issues with WordPress version 3.6 has been fixed.</li>\n</ul>\n<h3>1.1.1</h3>\n<ul>\n<li>Active type tab in the charts library was fixed.</li>\n<li>Library styles were updated.</li>\n</ul>\n<h3>1.1.0</h3>\n<ul>\n<li>Auto population was added for remote CSV file source.</li>\n<li>Ability to hook chart series and data was implemented.</li>\n<li>Ability to upload CSV files from web was implemented.</li>\n</ul>\n<h3>1.0.1</h3>\n<ul>\n<li>The bug with CSV file uploading was fixed.</li>\n</ul>\n<h3>1.0.0</h3>\n<ul>\n<li>The first version of what wil be the best wp charts plugin.</li>\n</ul>\n"
    },
    "short_description": "A simple yet powerful WordPress chart plugin to effortlessly create and embed responsive charts &amp; tables into your site, supporting multiple data  &hellip;",
    "description": "<p><a href=\"https://themeisle.com/plugins/visualizer-charts-and-graphs/?utm_source=wpadmin&amp;utm_medium=readme&amp;utm_campaign=description\" rel=\"nofollow ugc\">Visualizer: Tables and Charts Manager for WordPress</a> is a powerful and easy to use plugin used to create, manage and embed interactive, responsive charts &amp; tables into your WordPress posts and pages.</p>\n<p>The plugin leverages the Google Visualization API, DataTables.net, and ChartJS libraries to deliver responsive and animated charts, graphs, and tables, ensuring excellent cross-browser compatibility and a seamless mobile experience. You can fully customize all aspects of the charts and tables to suit your needs. For enhanced data management features, including importing from Excel, CSV, Google Sheets, and more, consider exploring the <a href=\"https://themeisle.com/plugins/visualizer-charts-and-graphs/upgrade/?utm_source=wpadmin&amp;utm_medium=readme&amp;utm_campaign=pro-cta\" rel=\"nofollow ugc\">PRO version</a>.</p>\n<h3>🔗 HELPFUL LINKS</h3>\n<ul>\n<li>Want to see Visualizer in action before installing? <a href=\"https://demo.themeisle.com/visualizer/\" rel=\"nofollow ugc\">View Visualizer Demo</a> [You can also try Live Preview button above]</li>\n<li>Need any help with setup? <a href=\"https://docs.themeisle.com/collection/1560-visualizer-charts-and-graphs\" rel=\"nofollow ugc\">Check Documentation</a></li>\n<li>Don’t like reading? <a href=\"https://youtube.com/playlist?list=PLmRasCVwuvpT0Gu1myGW-Dyt2oh-BPuci&amp;si=S3o4BIyo3AYNh95w\" rel=\"nofollow ugc\">Check Youtube Playlist</a></li>\n<li>Interested in Visualizer Pro? <a href=\"https://themeisle.com/plugins/visualizer-charts-and-graphs/upgrade/?utm_source=wpadmin&amp;utm_medium=readme&amp;utm_campaign=pro-cta\" rel=\"nofollow ugc\">Know more about Visualizer PRO</a></li>\n</ul>\n<h3>Why You’ll Love Visualizer</h3>\n<ul>\n<li>\n<p><strong>Diverse Chart Options:</strong> Begin with essential chart types like line, pie, bar, and table in the free version. Elevate your data presentation with advanced chart types such as scatter, area, and geo available in the Pro version. The free version offers a comprehensive range of options that are perfect for various visualization needs.</p>\n</li>\n<li>\n<p><strong>Manual Data Entry:</strong> Input data manually for quick visualization tasks. This method provides ultimate control over the content and structure of your charts, making it simple to tailor data presentation directly within the plugin interface.</p>\n</li>\n<li>\n<p><strong>Ultimate Responsiveness:</strong> Crafted using HTML5/SVG technology, Visualizer charts ensure flawless functionality across all devices. This commitment to responsiveness guarantees that your data is not only accessible but also optimally displayed on desktops, tablets, and smartphones, enhancing user interaction and engagement.</p>\n</li>\n<li>\n<p><strong>Data Table Capabilities:</strong> In addition to our responsive charts and graphs, you can also add responsive tables to your posts and pages and customize them to your liking. Visualizer Pro lets you enhance them with features such as sorting capabilities, pagination, and search functions. From pricing tables to product tables, the possibilities are vast and customizable to meet any data presentation need.</p>\n</li>\n<li>\n<p><strong>Seamless Integration and Compatibility:</strong> Whether you&#8217;re using the Gutenberg editor or other page builders, Visualizer integrates effortlessly into your WordPress environment. This seamless compatibility allows for straightforward chart insertion and management.</p>\n</li>\n<li>\n<p><strong>Flexible and Customizable:</strong> Make the charts and tables truly your own. Visualizer offers an extensive set of configuration options to perfectly match the look and feel of your website. Utilize Google Chart Tools with their default settings for simplicity, or dive into customization if your site’s style requires a unique approach. Every chart and table exposes numerous options that customize its appearance and functionality, ensuring your visualizations integrate seamlessly into your pages.</p>\n</li>\n</ul>\n<p>These versatile data handling capabilities ensure that Visualizer Free is equipped to meet a wide range of data visualization requirements right out of the box. Perfect for bloggers, educators, small businesses, and more, Visualizer helps you turn raw data into compelling, interactive charts that engage and inform your audience.</p>\n<p><em>The above descriptions were partially taken from the Google Visualization API site</em></p>\n<h3>CHECK OUT A QUICK OVERVIEW OF VISUALIZER</h3>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/hQO_evnb_tQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>✨ YOU SHOULD USE VISUALIZER IF:</h3>\n<ul>\n<li>\n<p><strong>You Own a Personal or Small Business Website:</strong> You need a straightforward, powerful tool to enhance your website&#8217;s visual appeal with interactive charts and tables. Visualizer makes complex data understandable and engaging.</p>\n</li>\n<li>\n<p><strong>You Run an Educational or Financial Institution:</strong> For organizations that require regular reporting and data display, Visualizer offers comprehensive options for creating dynamic and informative charts and tables. This helps in better data analysis and presentation, aiding in decision-making and reporting.</p>\n</li>\n<li>\n<p><strong>You Aim to Enhance SEO and User Engagement:</strong> Using Visualizer’s interactive and responsive charts can significantly improve user engagement, keeping visitors on your site longer, which can positively impact your SEO rankings.</p>\n</li>\n<li>\n<p><strong>You are a Non-Profit Organizations:</strong> Non-profits can use Visualizer to display the impact of their initiatives through data. Create pie charts to show the distribution of spending or line charts to track donation trends over time, which can be powerful visuals for fundraising campaigns and annual reports.</p>\n</li>\n<li>\n<p><strong>You are Financial Advisors and Economists:</strong> Visualizer allows for detailed financial reporting and economic analyses with advanced chart types like candlestick and radar charts. These tools can be used to depict stock performances, economic cycles, or budget allocations, providing clients with clear insights into financial matters.</p>\n</li>\n<li>\n<p><strong>Regardless of Industry:</strong> With over 30,000 happy active users and 160+ 5-star ratings, Visualizer has been employed across a broad range of industries, including healthcare, marketing, education, and finance, demonstrating its versatility and effectiveness in any field.</p>\n</li>\n</ul>\n<p><strong>Types of charts you can create with Visualizer:</strong> Visualizer WordPress graph and charts plugin provides a variety of charts that are optimized to address your WordPress data visualization needs. In the free version, it has line charts, bar charts, pie charts, table charts. These charts are based on pure HTML5/SVG technology (adopting VML for old IE versions), so no extra plugins are required. Adding these charts to your page can be done in a few simple steps.</p>\n<ul>\n<li><strong>Table:</strong> Tables are extremely useful tools for displaying organized data. We use the datatable library to offer you endless customization options for any table needs you might have. <a href=\"https://demo.themeisle.com/visualizer/table-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Pie Chart:</strong> Pie charts are simple visualizations that allow you to easily illustrate the proportion of your data to your users. <a href=\"https://demo.themeisle.com/visualizer/pie-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Line Chart:</strong> You can display a series of data points connected with line segments using the line chart. <a href=\"https://demo.themeisle.com/visualizer/line-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Bar Chart:</strong> You can show grouped data with bars proportional to the values they represent using the bar chart. <a href=\"https://demo.themeisle.com/visualizer/bar-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Area Chart [PRO]:</strong> You can visually display quantitative data using the area chart. <a href=\"https://demo.themeisle.com/visualizer/area-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Geo Chart [PRO]:</strong> You can display a map of countries, continents, or regions with areas identified by the values you specify. <a href=\"https://demo.themeisle.com/visualizer/geo-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Column Chart [PRO]:</strong> You can use a column chart to show comparisons among different categories. <a href=\"https://demo.themeisle.com/visualizer/column-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Bubble Chart [PRO]:</strong> A bubble chart is a type of chart that displays three dimensions of data. Bubble charts can be considered a variation of the scatter plot, where data points are replaced with bubbles. <a href=\"https://demo.themeisle.com/visualizer/bubble-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Scatter Chart [PRO]:</strong> You can display values in Cartesian coordinates using the scatter chart. <a href=\"https://demo.themeisle.com/visualizer/scatter-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Gauge Chart [PRO]:</strong> You can build different gauge charts to indicate metrics like speed, performance, progress, or similar measures. <a href=\"https://demo.themeisle.com/visualizer/gauge-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Candlestick Chart [PRO]:</strong> A candlestick chart is a style of financial chart used to describe price movements of a security, derivative, or currency. <a href=\"https://demo.themeisle.com/visualizer/candlestick-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Timeline Chart [PRO]:</strong> You can group time-based values using the timeline chart. <a href=\"https://demo.themeisle.com/visualizer/timeline-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Combo Chart [PRO]:</strong> You can combine data series using different types of charts with the combo chart. <a href=\"https://demo.themeisle.com/visualizer/combo-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Polar Area Chart [PRO]:</strong> Polar charts are data visualizations best used for displaying multivariate observations with an arbitrary number of variables in the form of a two-dimensional chart. <a href=\"https://demo.themeisle.com/visualizer/polar-area-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n<li><strong>Radar/Spider Chart [PRO]:</strong> A radar chart is a graphical method of displaying multivariate data in the form of a two-dimensional chart of three or more quantitative variables represented on axes starting from the same point. <a href=\"https://demo.themeisle.com/visualizer/radar-spider-chart/\" rel=\"nofollow ugc\">Click here to see demo</a>.</li>\n</ul>\n<p><strong>🤝 ELEVATE YOUR DATA WITH VISUALIZER PREMIUM FEATURES</strong></p>\n<p>If you’re already benefiting from Visualizer, why not take your website to the next level with more powerful tools to enhance your data visualization capabilities and keep your audience engaged longer?</p>\n<ul>\n<li>\n<p><strong>Advanced Data Synchronization:</strong> Automatically sync your data sources to ensure your charts are always current without manual input.<br />\n<strong>USE CASE:</strong> 🔍 Sarah, a market analyst, leverages Advanced Data Synchronization to streamline her workflow. She sets her data sources to auto-update, ensuring her market trend charts are always accurate, saving her hours each week and enhancing her reports&#8217; credibility.</p>\n</li>\n<li>\n<p><strong>Multi-Language Support:</strong> Automatically translate your charts and data presentations into multiple languages, broadening your audience reach.<br />\n<strong>USE CASE:</strong> 🌍 Elena, who manages a multilingual educational platform, uses Multi-Language Support to provide data visualizations in several languages, effectively increasing her site&#8217;s global usability and accessibility.</p>\n</li>\n<li>\n<p><strong>Advanced User Permissions:</strong> Control who can view or edit your charts, perfect for teams needing to manage access at various levels.<br />\n<strong>USE CASE:</strong> 🛠️ Rachel, a project manager, configures user permissions to ensure that only relevant team members can edit financial forecasts, maintaining data integrity and security.</p>\n</li>\n<li>\n<p><strong>Import Data from Files:</strong> Upload CSV files directly into Visualizer. This feature is ideal for those who prepare data in spreadsheet tools like Microsoft Excel or Google Sheets, allowing for quick and easy data visualization.</p>\n</li>\n<li>\n<p><strong>Import Data from URLs:</strong> Keep your charts updated by importing data dynamically from external sources in CSV or JSON formats via URLs. This powerful feature is essential for displaying real-time or frequently updated data, reducing the need for manual updates.</p>\n</li>\n<li>\n<p><strong>Import from Other Charts:</strong> Seamlessly integrate data from other charts into new visualizations, facilitating easy data consolidation and comparison.</p>\n</li>\n<li>\n<p><strong>Import from WordPress:</strong> Directly pull data from your WordPress posts, pages, or custom post types to create dynamic charts that automatically update as your content changes.<br />\n<strong>USE CASE:</strong> ✍️ Benjamin, a digital marketing manager, uses this feature to track engagement across blog posts in real-time. He creates charts that update automatically with views and social shares, helping him quickly adjust content strategies based on what resonates with audiences.</p>\n</li>\n<li>\n<p><strong>Import from Database:</strong> Connect directly to your database to fetch data, ensuring your visualizations reflect the most up-to-date information available.</p>\n</li>\n<li>\n<p><strong>Data Filter:</strong> Apply filters to your data within Visualizer, enabling viewers to interact with and explore data in a more focused manner.<br />\n<strong>USE CASE:</strong> 🕵️‍♂️ Tom, a market researcher, implements data filters on his demographic analysis charts, allowing users to select specific variables such as age and income, thereby drilling down into personalized data insights.</p>\n</li>\n<li>\n<p><strong>Priority Support:</strong> Have access to our dedicated support team to help you resolve any technical issues swiftly, ensuring your visualizations are always performing optimally.</p>\n</li>\n</ul>\n<p>Unlock these premium features and more with Visualizer PRO!</p>\n<p><strong>Still have questions?</strong> Ask your pre-sales questions <a href=\"https://themeisle.com/contact/?utm_source=wpadmin&amp;utm_medium=readme&amp;utm_campaign=pre-sales\" rel=\"nofollow ugc\">here</a>, and we will get back to you promptly. Or, purchase with confidence and try it for yourself—we offer <strong>a 30-day no-questions-asked 100% money-back guarantee</strong>.</p>\n<p><strong>WE’RE HERE FOR YOU, AND WE TAKE ALL FEEDBACK SERIOUSLY</strong></p>\n<ul>\n<li>\n<p><strong>📚 Knowledge Base:</strong> We’ve created a complete documentation library and we’re still constantly updating with new tutorials.</p>\n</li>\n<li>\n<p><strong>📽️ Youtube Tutorials:</strong> Don’t like reading? We’ve created some YouTube tutorials to help you get started with the Visualizer plugin step by step.</p>\n</li>\n<li>\n<p><strong>🦸 Support Forum:</strong> We offer support to free version users here and try to reply within one business day.</p>\n</li>\n<li>\n<p><strong>🌟 Premium Support:</strong> We offer priority support for Plus license customers and live chat support for Infinite license customers.</p>\n</li>\n</ul>\n<p>If you have any feedback or feature suggestions for the Visualizer plugin, don’t hesitate to tell us. We read all feedback and ideas.</p>\n<p><strong>You’re in good hands</strong></p>\n<p>Visualizer is one of many great products by Themeisle. Join over 30,000+ Visualizer active users and half of a million Themeisle users from all over the world.</p>\n<p><strong>See what real users talk about us:</strong></p>\n<ul>\n<li>\n<p><a href=\"https://wordpress.org/support/topic/visualizer-is-amazing/\" rel=\"ugc\"><em>Visualizer is amazing!</em></a> &#8211; &#8220;Just what I was looking for to make my information available and looks pleasing!&#8221;</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/support/topic/great-plugin-for-bloggers-4/\" rel=\"ugc\"><em>Great Plugin for Bloggers</em></a> &#8211; &#8220;It’s a great plugin for new bloggers like me. It&#8217;s working seamlessly on my website. I am using this plugin for the last couple of weeks and I am loving it.&#8221;</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/support/topic/works-well-and-devs-are-responsive/\" rel=\"ugc\"><em>Works Well and Devs are Responsive</em></a> &#8211; &#8220;We are using it on a rather complicated multisite install. After much research, we went with this plugin for our editors&#8217; needs.&#8221;</p>\n</li>\n<li>\n<p><a href=\"https://wordpress.org/support/topic/the-best-one-ive-found-2/\" rel=\"ugc\"><em>The Best One I’ve Found</em></a> &#8211; &#8220;After trying a couple of options, this was the one that worked the best.&#8221;</p>\n</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/visualizer.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/visualizer/assets/screenshot-1.gif?rev=3015999",
            "caption": "Charts Selection"
        },
        {
            "src": "https://ps.w.org/visualizer/assets/screenshot-2.gif?rev=3015999",
            "caption": "Quick Actions"
        },
        {
            "src": "https://ps.w.org/visualizer/assets/screenshot-3.gif?rev=3015999",
            "caption": "Import Options"
        },
        {
            "src": "https://ps.w.org/visualizer/assets/screenshot-4.gif?rev=3015999",
            "caption": "Bar Chart"
        },
        {
            "src": "https://ps.w.org/visualizer/assets/screenshot-5.gif?rev=3015999",
            "caption": "Bar Chart Settings"
        },
        {
            "src": "https://ps.w.org/visualizer/assets/screenshot-6.gif?rev=3015999",
            "caption": "Line Chart Settings"
        },
        {
            "src": "https://ps.w.org/visualizer/assets/screenshot-7.jpg?rev=3015999",
            "caption": "Block editor - Chart Library"
        }
    ],
    "tags": {
        "charts": "charts",
        "graphs": "graphs",
        "pie": "Pie",
        "tables": "tables",
        "visualization": "visualization"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/visualizer.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/visualizer.1.0.1.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/visualizer.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/visualizer.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/visualizer.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/visualizer.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/visualizer.1.1.4.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/visualizer.1.2.0.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/visualizer.1.3.0.zip",
        "1.3.0.1": "https://downloads.wordpress.org/plugin/visualizer.1.3.0.1.zip",
        "1.3.0.2": "https://downloads.wordpress.org/plugin/visualizer.1.3.0.2.zip",
        "1.4": "https://downloads.wordpress.org/plugin/visualizer.1.4.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/visualizer.1.4.1.zip",
        "1.4.1.1": "https://downloads.wordpress.org/plugin/visualizer.1.4.1.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/visualizer.1.4.2.zip",
        "1.4.2.1": "https://downloads.wordpress.org/plugin/visualizer.1.4.2.1.zip",
        "1.4.2.2": "https://downloads.wordpress.org/plugin/visualizer.1.4.2.2.zip",
        "1.4.2.3": "https://downloads.wordpress.org/plugin/visualizer.1.4.2.3.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/visualizer.1.5.3.zip",
        "1.5.5": "https://downloads.wordpress.org/plugin/visualizer.1.5.5.zip",
        "1.5.6": "https://downloads.wordpress.org/plugin/visualizer.1.5.6.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/visualizer.1.6.0.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/visualizer.1.6.5.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/visualizer.1.6.6.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/visualizer.1.7.0.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/visualizer.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/visualizer.1.7.2.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/visualizer.1.7.5.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/visualizer.1.7.6.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/visualizer.2.0.0.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/visualizer.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/visualizer.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/visualizer.2.0.4.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/visualizer.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/visualizer.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/visualizer.2.1.2.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/visualizer.2.1.3.zip",
        "2.1.4": "https://downloads.wordpress.org/plugin/visualizer.2.1.4.zip",
        "2.1.5": "https://downloads.wordpress.org/plugin/visualizer.2.1.5.zip",
        "2.1.6": "https://downloads.wordpress.org/plugin/visualizer.2.1.6.zip",
        "2.1.7": "https://downloads.wordpress.org/plugin/visualizer.2.1.7.zip",
        "2.1.8": "https://downloads.wordpress.org/plugin/visualizer.2.1.8.zip",
        "2.1.9": "https://downloads.wordpress.org/plugin/visualizer.2.1.9.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/visualizer.2.2.0.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/visualizer.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/visualizer.3.0.1.zip",
        "3.0.10": "https://downloads.wordpress.org/plugin/visualizer.3.0.10.zip",
        "3.0.11": "https://downloads.wordpress.org/plugin/visualizer.3.0.11.zip",
        "3.0.12": "https://downloads.wordpress.org/plugin/visualizer.3.0.12.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/visualizer.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/visualizer.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/visualizer.3.0.4.zip",
        "3.0.5": "https://downloads.wordpress.org/plugin/visualizer.3.0.5.zip",
        "3.0.6": "https://downloads.wordpress.org/plugin/visualizer.3.0.6.zip",
        "3.0.7": "https://downloads.wordpress.org/plugin/visualizer.3.0.7.zip",
        "3.0.8": "https://downloads.wordpress.org/plugin/visualizer.3.0.8.zip",
        "3.0.9": "https://downloads.wordpress.org/plugin/visualizer.3.0.9.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/visualizer.3.1.0.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/visualizer.3.1.1.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/visualizer.3.1.2.zip",
        "3.1.3": "https://downloads.wordpress.org/plugin/visualizer.3.1.3.zip",
        "3.10.0": "https://downloads.wordpress.org/plugin/visualizer.3.10.0.zip",
        "3.10.1": "https://downloads.wordpress.org/plugin/visualizer.3.10.1.zip",
        "3.10.10": "https://downloads.wordpress.org/plugin/visualizer.3.10.10.zip",
        "3.10.11": "https://downloads.wordpress.org/plugin/visualizer.3.10.11.zip",
        "3.10.12": "https://downloads.wordpress.org/plugin/visualizer.3.10.12.zip",
        "3.10.13": "https://downloads.wordpress.org/plugin/visualizer.3.10.13.zip",
        "3.10.14": "https://downloads.wordpress.org/plugin/visualizer.3.10.14.zip",
        "3.10.15": "https://downloads.wordpress.org/plugin/visualizer.3.10.15.zip",
        "3.10.2": "https://downloads.wordpress.org/plugin/visualizer.3.10.2.zip",
        "3.10.3": "https://downloads.wordpress.org/plugin/visualizer.3.10.3.zip",
        "3.10.4": "https://downloads.wordpress.org/plugin/visualizer.3.10.4.zip",
        "3.10.5": "https://downloads.wordpress.org/plugin/visualizer.3.10.5.zip",
        "3.10.6": "https://downloads.wordpress.org/plugin/visualizer.3.10.6.zip",
        "3.10.7": "https://downloads.wordpress.org/plugin/visualizer.3.10.7.zip",
        "3.10.8": "https://downloads.wordpress.org/plugin/visualizer.3.10.8.zip",
        "3.10.9": "https://downloads.wordpress.org/plugin/visualizer.3.10.9.zip",
        "3.11.0": "https://downloads.wordpress.org/plugin/visualizer.3.11.0.zip",
        "3.11.1": "https://downloads.wordpress.org/plugin/visualizer.3.11.1.zip",
        "3.11.2": "https://downloads.wordpress.org/plugin/visualizer.3.11.2.zip",
        "3.11.3": "https://downloads.wordpress.org/plugin/visualizer.3.11.3.zip",
        "3.11.4": "https://downloads.wordpress.org/plugin/visualizer.3.11.4.zip",
        "3.11.5": "https://downloads.wordpress.org/plugin/visualizer.3.11.5.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/visualizer.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/visualizer.3.2.1.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/visualizer.3.3.0.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/visualizer.3.3.1.zip",
        "3.3.2": "https://downloads.wordpress.org/plugin/visualizer.3.3.2.zip",
        "3.3.3": "https://downloads.wordpress.org/plugin/visualizer.3.3.3.zip",
        "3.3.4": "https://downloads.wordpress.org/plugin/visualizer.3.3.4.zip",
        "3.4.0": "https://downloads.wordpress.org/plugin/visualizer.3.4.0.zip",
        "3.4.1": "https://downloads.wordpress.org/plugin/visualizer.3.4.1.zip",
        "3.4.10": "https://downloads.wordpress.org/plugin/visualizer.3.4.10.zip",
        "3.4.11": "https://downloads.wordpress.org/plugin/visualizer.3.4.11.zip",
        "3.4.2": "https://downloads.wordpress.org/plugin/visualizer.3.4.2.zip",
        "3.4.3": "https://downloads.wordpress.org/plugin/visualizer.3.4.3.zip",
        "3.4.4": "https://downloads.wordpress.org/plugin/visualizer.3.4.4.zip",
        "3.4.5": "https://downloads.wordpress.org/plugin/visualizer.3.4.5.zip",
        "3.4.6": "https://downloads.wordpress.org/plugin/visualizer.3.4.6.zip",
        "3.4.7": "https://downloads.wordpress.org/plugin/visualizer.3.4.7.zip",
        "3.4.8": "https://downloads.wordpress.org/plugin/visualizer.3.4.8.zip",
        "3.4.9": "https://downloads.wordpress.org/plugin/visualizer.3.4.9.zip",
        "3.5.0": "https://downloads.wordpress.org/plugin/visualizer.3.5.0.zip",
        "3.5.1": "https://downloads.wordpress.org/plugin/visualizer.3.5.1.zip",
        "3.6.0": "https://downloads.wordpress.org/plugin/visualizer.3.6.0.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/visualizer.3.6.1.zip",
        "3.7.0": "https://downloads.wordpress.org/plugin/visualizer.3.7.0.zip",
        "3.7.1": "https://downloads.wordpress.org/plugin/visualizer.3.7.1.zip",
        "3.7.10": "https://downloads.wordpress.org/plugin/visualizer.3.7.10.zip",
        "3.7.11": "https://downloads.wordpress.org/plugin/visualizer.3.7.11.zip",
        "3.7.12": "https://downloads.wordpress.org/plugin/visualizer.3.7.12.zip",
        "3.7.2": "https://downloads.wordpress.org/plugin/visualizer.3.7.2.zip",
        "3.7.3": "https://downloads.wordpress.org/plugin/visualizer.3.7.3.zip",
        "3.7.4": "https://downloads.wordpress.org/plugin/visualizer.3.7.4.zip",
        "3.7.5": "https://downloads.wordpress.org/plugin/visualizer.3.7.5.zip",
        "3.7.6": "https://downloads.wordpress.org/plugin/visualizer.3.7.6.zip",
        "3.7.7": "https://downloads.wordpress.org/plugin/visualizer.3.7.7.zip",
        "3.7.8": "https://downloads.wordpress.org/plugin/visualizer.3.7.8.zip",
        "3.7.9": "https://downloads.wordpress.org/plugin/visualizer.3.7.9.zip",
        "3.8.0": "https://downloads.wordpress.org/plugin/visualizer.3.8.0.zip",
        "3.8.1": "https://downloads.wordpress.org/plugin/visualizer.3.8.1.zip",
        "3.9.0": "https://downloads.wordpress.org/plugin/visualizer.3.9.0.zip",
        "3.9.1": "https://downloads.wordpress.org/plugin/visualizer.3.9.1.zip",
        "3.9.2": "https://downloads.wordpress.org/plugin/visualizer.3.9.2.zip",
        "3.9.3": "https://downloads.wordpress.org/plugin/visualizer.3.9.3.zip",
        "3.9.4": "https://downloads.wordpress.org/plugin/visualizer.3.9.4.zip",
        "3.9.5": "https://downloads.wordpress.org/plugin/visualizer.3.9.5.zip",
        "3.9.6": "https://downloads.wordpress.org/plugin/visualizer.3.9.6.zip",
        "3.9.7": "https://downloads.wordpress.org/plugin/visualizer.3.9.7.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/visualizer/assets/banner-772x250.png?rev=3017853",
        "high": "https://ps.w.org/visualizer/assets/banner-1544x500.png?rev=3017853"
    },
    "icons": {
        "1x": "https://ps.w.org/visualizer/assets/icon-128x128.gif?rev=3084574",
        "2x": "https://ps.w.org/visualizer/assets/icon-256x256.gif?rev=3084574"
    },
    "blocks": {
        "visualizer/chart": {
            "name": "visualizer/chart",
            "title": "Visualizer Chart"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 88,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/visualizer/blueprint.json?rev=3125880"
        }
    ],
    "preview_link": "https://wordpress.org/plugins/visualizer/?preview=1",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "visualizer",
            "language": "en_GB",
            "version": "3.11.5",
            "updated": "2018-04-28 20:02:06",
            "package": "http://downloads.wordpress.org/translation/plugin/visualizer/3.11.5/en_GB.zip"
        },
        {
            "type": "plugin",
            "slug": "visualizer",
            "language": "fr_FR",
            "version": "3.11.5",
            "updated": "2019-11-01 08:24:02",
            "package": "http://downloads.wordpress.org/translation/plugin/visualizer/3.11.5/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "visualizer",
            "language": "fr_BE",
            "version": "3.11.5",
            "updated": "2019-11-01 08:25:02",
            "package": "http://downloads.wordpress.org/translation/plugin/visualizer/3.11.5/fr_BE.zip"
        },
        {
            "type": "plugin",
            "slug": "visualizer",
            "language": "ru_RU",
            "version": "3.11.5",
            "updated": "2021-12-18 14:49:45",
            "package": "http://downloads.wordpress.org/translation/plugin/visualizer/3.11.5/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "visualizer",
            "language": "zh_CN",
            "version": "3.11.5",
            "updated": "2021-07-16 02:44:08",
            "package": "http://downloads.wordpress.org/translation/plugin/visualizer/3.11.5/zh_CN.zip"
        }
    ]
}