{
    "name": "WC Nova Poshta Shipping &#8211; Integration of Nova Poshta delivery service for WooCommerce",
    "slug": "wc-ukr-shipping",
    "version": "1.12.4",
    "author": "kirillbdev",
    "author_profile": "https://profiles.wordpress.org/kirillbdev/",
    "contributors": {
        "kirillbdev": {
            "profile": "https://profiles.wordpress.org/kirillbdev/",
            "avatar": "https://secure.gravatar.com/avatar/6774138ae6580dcf412ecb5e1078a1e1?s=96&d=monsterid&r=g",
            "display_name": "kirillbdev"
        }
    },
    "requires": false,
    "tested": "6.5.5",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 94,
    "ratings": {
        "5": 35,
        "4": 1,
        "3": 1,
        "2": 2,
        "1": 1
    },
    "num_ratings": 40,
    "support_url": "https://wordpress.org/support/plugin/wc-ukr-shipping/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 6000,
    "downloaded": 69960,
    "last_updated": "2024-06-29 11:49:00",
    "added": "2019-06-06",
    "homepage": "https://kirillbdev.pro/wc-ukr-shipping/",
    "sections": {
        "description": "<p><strong>Simple and comfortable plugin for connect Nova Poshta delivery service to your WooCommerce store.</strong></p>\n<p><a href=\"https://kirillbdev.pro/docs/wcus-base-setup/\" rel=\"nofollow ugc\">Documentation</a><br />\n<a href=\"https://kirillbdev.pro/wc-ukr-shipping-pro/\" rel=\"nofollow ugc\">PRO version</a></p>\n<h3>Installation and setup tutorial</h3>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/IFW0B75s54o?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Features</h3>\n<ul>\n<li>Simple and intuitive setup</li>\n<li>Ability to select Nova Poshta warehouse or poshtomat on checkout page</li>\n<li>Ability to setup fixed shipping cost</li>\n<li>Integration with popular plugins for localization: WPML and Polylang</li>\n<li>Support latest versions of WordPress and WooCommerce</li>\n<li>Support WooCommerce geo zones</li>\n</ul>\n<h3>PRO version</h3>\n<p>WC Ukraine Shipping PRO has additional premium features that helps you to optimize work with your clients</p>\n<ul>\n<li>Full address shipping integration (using Nova Poshta address API)</li>\n<li>Automatic calculation of shipping costs (via Nova Poshta API)</li>\n<li>Shipping costs calculation based on order total</li>\n<li>Ability to separate cost calculation for address shipping</li>\n<li>Ability to generate TTN for all types: W2W, W2D, D2W, D2D</li>\n<li>Ability to mass generation of TTN in one click</li>\n<li>Print TTN of all types: A4, 85&#215;85, 100&#215;100 (zebra)</li>\n<li>Automatic email notifications after generating TTN</li>\n<li>Automatic sms notifications after generating TTN (need extra addon)</li>\n<li>Cloud features (Tracking, Performance address API)</li>\n<li>[Automation] No-code business-processes constructor</li>\n<li>Premium support</li>\n</ul>\n<p><a href=\"https://kirillbdev.pro/wc-ukr-shipping-pro/\" rel=\"nofollow ugc\">Buy PRO version</a></p>\n",
        "installation": "<h4>Minimum Requirements</h4>\n<ul>\n<li>PHP 7.4 or greater is recommended</li>\n<li>MySQL 5.7 or greater is recommended</li>\n</ul>\n<h4>Automatic installation</h4>\n<p>Automatic installation is the easiest option as WordPress handles the file transfers itself and you don’t need to leave your web browser. To do an automatic install of WooCommerce, log in to your WordPress dashboard, navigate to the Plugins menu and click Add New.</p>\n<p>In the search field type “WC Ukr Shipping” and click Search Plugins. Once you’ve found it you can view details about it such as the point release, rating and description. Most importantly of course, you can install it by simply clicking “Install Now”.</p>\n<h4>Manual installation</h4>\n<p>The manual installation method involves downloading this plugin and uploading it to your webserver via your favourite FTP application. The WordPress codex contains instructions on how to do this here.</p>\n<h4>Updating</h4>\n<p>Automatic updates should work like a charm; as always though, ensure you backup your site just in case.</p>\n",
        "changelog": "<h4>Version 1.12.4 / (29.06.2024)</h4>\n<ul>\n<li>[Fix] Removed extra slashes when saving shipping address.</li>\n<li>Checked compatibility with latest WordPress and WooCommerce versions.</li>\n</ul>\n<h4>Version 1.12.3 / (26.04.2024)</h4>\n<ul>\n<li>Divided search of warehouses and poshtomats.</li>\n<li>[New UI] Saving Nova Poshta area when order placed.</li>\n<li>Some localization improvements.</li>\n<li>Checked compatibility with latest WordPress and WooCommerce versions.</li>\n</ul>\n<h4>Version 1.12.2 / (02.03.2024)</h4>\n<ul>\n<li>[Fix] Broken ukrainian localization.</li>\n<li>[Feature] Trimming spaces for search cities/warehouses query.</li>\n<li>Checked compatibility with latest WordPress and WooCommerce versions.</li>\n</ul>\n<h4>Version 1.12.1 / (19.10.2023)</h4>\n<ul>\n<li>Added HPOS support.</li>\n</ul>\n<h4>Version 1.12.0 / (09.07.2023)</h4>\n<ul>\n<li>Improved warehouse data loading performance.</li>\n<li>[Checkout old] Removed country check as required condition for show shipping fields.</li>\n<li>Checked compatibility with latest WordPress and WooCommerce versions.</li>\n</ul>\n<h4>Version 1.11.3 / (25.09.2022)</h4>\n<ul>\n<li>Improved integration with migration plugins.</li>\n<li>Improved plugin localization.</li>\n</ul>\n<h4>Version 1.11.2 / (07.06.2022)</h4>\n<ul>\n<li>Remove old files from vcs.</li>\n</ul>\n<h4>Version 1.11.1 / (07.06.2022)</h4>\n<ul>\n<li>Плановые улучшения кодовой базы.</li>\n<li>Плановые улучшения производительности.</li>\n</ul>\n<h4>Version 1.11.0 / (08.04.2022)</h4>\n<ul>\n<li>Минимальная версия PHP увеличена до 7.4</li>\n<li>Новый UI теперь включен по-умолчанию для всех новых магазинов.</li>\n<li>Улучшено описание некоторых настроек.</li>\n<li>Проведены мелкие улучшения производительности.</li>\n</ul>\n<h4>Version 1.10.0 / (12.12.2021)</h4>\n<ul>\n<li>Плановые улучшения и переработки кодовой базы.</li>\n</ul>\n<h4>Version 1.9.1 / (29.09.2021)</h4>\n<ul>\n<li>Мелкие исправления.</li>\n</ul>\n<h4>Version 1.9.0 / (29.09.2021)</h4>\n<ul>\n<li>Обновлен модуль загрузки отделений (аналогичен PRO версии).</li>\n<li>Восстановлена опция сохранения последнего отделения (работает только с новым UI).</li>\n<li>Улучшена синхронизация данных на странице оформления заказа (новый UI).</li>\n<li>Улучшения архитектуры и кодовой базы.</li>\n</ul>\n<h4>Version 1.8.2 / (01.08.2021)</h4>\n<ul>\n<li>Backend UI rework.</li>\n</ul>\n<h4>Version 1.8.1 / (01.08.2021)</h4>\n<ul>\n<li>Улучшена отзывчивость нового UI на мобильных устройствах.</li>\n<li>Увеличен базовый таймаут запросов к API Новой Почты до 15 секунд.</li>\n<li>Интеграция работы опции &#8220;Включить блок Адресной доставки&#8221; для нового UI.</li>\n</ul>\n<h4>Version 1.8.0 / (16.06.2021)</h4>\n<ul>\n<li>Внедрен новый UI для страницы оформления заказа (включается во вкладке Общие). Подробное описание его работы: https://kirillbdev.pro/wcus-pro-new-ui-110/</li>\n<li>Добавлена новая вкладка Доставка для страницы настроек (для более логического разделения настроек).</li>\n<li>Добавлен фильтр wcus_checkout_i18n (будет описан в документации).</li>\n<li>Core update.</li>\n</ul>\n<h4>Version 1.7.7 / (17.05.2021)</h4>\n<ul>\n<li>Исправлена ошибка при загрузке областей на странице оформления заказа.</li>\n</ul>\n<h4>Version 1.7.6 / (16.05.2021)</h4>\n<ul>\n<li>Core update.</li>\n</ul>\n<h4>Version 1.7.5 / (07.05.2021)</h4>\n<ul>\n<li>Основная логика была вынесена в отдельное ядро (которое также используется для PRO версии).</li>\n<li>Добавлен фильтр wcus_checkout_validation_active. С помощью него можно отключить валидацию полей плагина на странице оформления заказа.</li>\n<li>Добавлен фильтр wcus_dynamic_shipping_label (будет описан в документации).</li>\n<li>Теперь для корректной работы плагина требуется PHP не ниже версии 7.0.</li>\n<li>Улучшения безопасности и производительности.</li>\n</ul>\n<h4>Version 1.7.4 / (05.02.2021)</h4>\n<ul>\n<li>Исправлена ошибка сохранения адреса доставки на украинском языке, даже если в настройках выбран русский.</li>\n<li>Добавлена опция &#8220;Показывать почтоматы&#8221; (включена по-умолчанию).</li>\n<li>Добавлен фильтр wcus_get_areas.</li>\n<li>Улучшения локализации админ-части.</li>\n<li>Общие улучшения производительности.</li>\n</ul>\n<h4>Version 1.7.3 / (24.12.2020)</h4>\n<ul>\n<li>Исправлены некоторые несовместимости с PHP8.</li>\n<li>Добавлен фильтр: wcus_http_post_timeout. Позволяет увеличить таймаут опроса API при загрузке отделений.</li>\n</ul>\n<h4>Version 1.7.2 / (11.12.2020)</h4>\n<ul>\n<li>Исправлен некорректный вывод названия доставки, если оно содержит кавычки.</li>\n<li>Добавлен вывод стоимости доставки на странице корзины.</li>\n<li>Исправлены некоторые ошибки несовместимости с плагином Saphali Woocommerce.</li>\n<li>Добавлена локализация сообщения о незаполненных данных Новой Почты.</li>\n</ul>\n<h4>Version 1.7.1 / (29.09.2020)</h4>\n<ul>\n<li>Исравлен баг, когда плагин при любом выбранном методе доставки добавлял свою стоимость к итоговой сумме заказа.</li>\n</ul>\n<h4>Version 1.7.0 / (06.09.2020)</h4>\n<ul>\n<li>Глобальные работы по оптимизации кода (улучшения скорости работы, удаление старого и ненужного кода).</li>\n<li>Полная смена логики сохранения заказа (по аналогии с PRO версией).</li>\n<li>Новые возможности для расширения расчета стоимости доставки (по аналогии с PRO версией).</li>\n<li>Убрана настройка &#8220;Сохранять последнее отделение пользователя&#8221; (в связи с подготовкой нового функционала).</li>\n<li>Убрана кнопка &#8220;Наш сайт&#8221; с верней панели настроек.</li>\n<li>Новая, улучшенная обработка ошибок, которые могут возникать при первоначальных настройках плагина (вывод ошибок API, ошибок доступности API).</li>\n</ul>\n<h4>Version 1.6.3 / (09.05.2020)</h4>\n<ul>\n<li>Корректировка вывода верстки на странице оформления заказа.</li>\n</ul>\n<h4>Version 1.6.2 / (09.05.2020)</h4>\n<ul>\n<li>Небольшие исправления подгрузки переводов.</li>\n</ul>\n<h4>Version 1.6.1 / (09.05.2020)</h4>\n<ul>\n<li>Интеграция локализации отделений (русский и украинский) с плагином Polylang.</li>\n<li>Внедрена опция &#8220;Использовать новые UI компоненты&#8221;. По-умолчанию эта опция включена. Опция должна решить частую проблему несовместимости с плагином WooCommerce Checkout Manager.</li>\n<li>Блок выбора отделения доставки теперь функционирует как для billing секции, так и для shipping (доставка по другому адресу) секции. Следовательно, теперь плагин пишет данные адреса заказа в одну из этих секций.</li>\n<li>Исправлены некоторые мелкие баги, а также проведен плановый рефакторинг кодовой базы.</li>\n</ul>\n<h4>Version 1.6.0 / (22.04.2020)</h4>\n<ul>\n<li>Исправлена ошибка монопольной установки отделения Новой Почты, даже, если для заказа выбран другой способ доставки.</li>\n<li>Теперь поле произвольного адреса не убирает выбор области и города (соответственно, для адресной доставки эти поля теперь необходимы к заполнению).</li>\n<li>Сохранение последнего отделения доставки для пользователя теперь можно опционально отключить в настройках плагина.</li>\n<li>Добавлена CSRF защита на странице оформления заказа.</li>\n<li>Добавлены базовы файлы переводов для 3-х языков (русский, украинский, английский). Домен локализации: wc-ukr-shipping-l10n</li>\n<li>Добавлена настройка выбора типа переводов, которые будет использовать плагин (из mo файлов или из вкладки &#8220;Переводы&#8221;). Соответственно, улучшилась интеграция с плагинами переводов типа WPML, Polylang. Если ваш сайт не имеет языковых версий, то значение данной настройки можно оставить без изменений. Если же у вас несколько языковых версий, то установите значение опции в &#8220;из mo файлов&#8221;. Это даст возможность получить переводы для 3-х базовых языков. Также, с помощью соответствующих плагинов (например WPML String Translations), вы сможете изменять данные переводы (домен локализации плагина: wc-ukr-shipping-l10n).</li>\n<li>Добавлен перевод для пустого результата поиска в полях выбора области / города / отделения (ранее был &#8220;No results found&#8221;).</li>\n<li>Добавлена автоматическая интеграция языка отделений (русский, украинский) с плагином WPML.</li>\n</ul>\n<h4>Version 1.5.2 / (09.01.2020)</h4>\n<ul>\n<li>Исправлена ошибка, при которой в поле выбора области дублировались все значения.</li>\n<li>Улучшен алгоритм сортировки результатов при поиске города. Теперь, при вводе в поле поиска, например, строки &#8220;Кие&#8221;, первым в списке городов будет доступен Киев (как наиболее подходящий под запрос), а уже после &#8211; все прилегающие пгт и села Киевской области.</li>\n<li>Также улучшен алгоритм сортировки результатов при поиске отделений. Почти любое отделение теперь можно найти, введя нужную цифру.</li>\n<li>Данные улучшения также внедрены в Premium версию.</li>\n</ul>\n<h4>Version 1.5.1 / (06.01.2020)</h4>\n<ul>\n<li>Добавлена новая опция на странице настроек &#8220;Позиция блока на странице оформления заказа&#8221;. Опция позволяет задать позицию блока выбора отделения в основной (по-умолчанию) или дополнительной секции. Положение блока в дополнительной секции актуально для тем, в которых поля оформления заказа расположены в две колонки. Таким образом данная опция придаст вашей странице оформления заказа более красивый вид.</li>\n<li>Проделана мелкая работа над UI страниц настроек.</li>\n<li>Проделана работа над функционалом, позволяющая более качественно интегрировать данные бесплатной версии плагина с Premium, при переходе на Premium.</li>\n</ul>\n<h4>Version 1.5.0 / (04.01.2020)</h4>\n<ul>\n<li>Исправлена ошибка вызова несуществующей функции.</li>\n<li>Исправлена ошибка, когда удалялись все данные из базы отделений при деактивации плагина.</li>\n<li>Удаление ненужного функционала, а также некоторые мелкие исправления кода.</li>\n<li>Теперь выбор отделения доставки сохраняется за пользователем.<br />\nДля авторизованых клиентов срок хранения выбора &#8211; вечность, для гостей &#8211; в пределаж жизни сессии WooCommerce.</li>\n<li>PRO версия доступна для покупки.</li>\n</ul>\n<h4>Version 1.4.5 / (19.10.2019)</h4>\n<ul>\n<li>Исправлена ошибка парсинга js скриптов в браузере Internet Explorer.</li>\n<li>Пункт настроек в меню админ-панели теперь имеет стандартные стили WordPress.</li>\n<li>Информация про адрес доставки теперь также записывается в данные о плательщике (billing_state, billing_city, billing_address_1).</li>\n</ul>\n<h4>Version 1.4.4 / (16.10.2019)</h4>\n<ul>\n<li>Исправлена ошибка локализации отделений.</li>\n</ul>\n<h4>Version 1.4.3 / (10.10.2019)</h4>\n<ul>\n<li>Временный отказ от REST Api в пользу обычного ajax.</li>\n<li>Переделана страница настроек плагина.</li>\n<li>Польностью переделана локализация. Более подробнее вы можете прочитать в документации.</li>\n<li>Страница настроек теперь вынесена из меню WooCommerce и расположена в главном меню WordPress (как раньше).</li>\n<li>Исправлены мелкие некритичные ошибки.</li>\n</ul>\n<h4>Version 1.4.2 / (27.08.2019)</h4>\n<ul>\n<li>Фикс. проверки на несуществующий параметр в REST ответе.</li>\n<li>Функционал корректного удаления плагина.</li>\n</ul>\n<h4>Version 1.4.1 / (25.08.2019)</h4>\n<ul>\n<li>Перенос функционала сокрытия стандартных полей (город, область, почтовый индекс и адрес) на front-end.</li>\n</ul>\n<h4>Version 1.4.0 / (24.08.2019)</h4>\n<ul>\n<li>Исправлен редкий баг, когда инициализация UI для полей Новой Почты (select 2) происходила раньше, чем будут загружены области доставки.</li>\n<li>Теперь плагин будет работать даже с выключенным REST Api (тип работы, rest или wp-ajax, определяется автоматически при анализе возможностей сайта).</li>\n<li>Теперь плагин по-умолчанию скрывает стандартные billing поля (город, область, почтовый индекс и адрес). Для того, чтобы отменить данную функцию, Вам необходимо передать значение false в фильтр wc_ukr_shipping_prevent_disable_default_fields.</li>\n<li>Добавлена ссылка на страницу настроек в разделе плагинов.</li>\n<li>Удалены донаты в связи со скорым выпуском PRO версии.</li>\n</ul>\n<h4>Version 1.3.0 / (26.07.2019)</h4>\n<ul>\n<li>Русифицированы георгафические области при выборе русского языка в настройках.</li>\n<li>Введен базовый модуль репортов для отправки анонимной статистики (работает только, если включена соответствующая настройка в опциях плагина).</li>\n<li>Страница настроек плагина была перенесена и теперь стала подпунктом меню Woo Commerce.</li>\n</ul>\n<h4>Version 1.2.0 / (24.06.2019)</h4>\n<ul>\n<li>Исправлена ошибка, когда при выборе другого способа доставки, не выводился блок &#8220;Доставка по другому адресу&#8221; (Shipping Fields).</li>\n<li>Теперь плагин работает даже если вы скрыли или удалили поле страна (billing_country), используя сторонний плагин или код.<br />\nСтоит заметить, что плагин все также работает только с зоной UA.</li>\n<li>Теперь каждое строковое поле, которое нельзя изменить через страницу настроек (например, &#8220;выберите область&#8221;), выводится через функцию __().<br />\nДанное изменение позволяет вам изменить эти поля с помощью одного из известных плагинов локализации, например WPML.</li>\n</ul>\n<h4>Version 1.1.2 / (19.06.2019)</h4>\n<ul>\n<li>Исправлена ошибка, когда пропадала область доставки при изменении заказа из админ-панели.</li>\n</ul>\n<h4>Version 1.1.1 / (19.06.2019)</h4>\n<ul>\n<li>Исправлена ошибка запросов на несуществующие REST точки из front-end, если сайт находится не в корневом каталоге сервера (спасибо пользователю @myideasforsite).</li>\n<li>Добавлена опция сокрытия блока адресной доставки.</li>\n<li>Добавлена сортировка отделений по номерам во front-end (выполните миграцию в настройках, затем обновите информацию об отделениях).</li>\n</ul>\n<h4>Version 1.1.0 / (16.06.2019)</h4>\n<ul>\n<li>Добавлена порционная загзука городов и отделений, для снятия ограничений по оперативной памяти хостинга.<br />\nТеперь плагин работает даже на хостингах с 64МБ ОЗУ.</li>\n<li>Создан абсолютно новый интерфейс настроек плагина. Все опции теперь вынесены в одну удобную форму.<br />\nНастройки теперь расположены по адресу yoursite.com/wp-admin/admin.php?page=wc_ukr_shipping_options</li>\n<li>Добавлен функционал миграций версий для безопасного обновления структур данных плагина до актуальной версии.<br />\nФункционал доступен на странице настроек.</li>\n<li>Теперь вам нужен API ключ для обновления данных Новой Почты. Настройка также находится по адресу yoursite.com/wp-admin/admin.php?page=wc_ukr_shipping_options</li>\n<li>Добавлена опция выбора языка, на котором будут подтягиватся данные о городах и отделениях Новой Почты.<br />\nДля работы настройки вам понадобится мигрировать данные до актуальной версии и обновить данные об отделениях Новой Почты. Все опции доступны на странице настроек.</li>\n<li>Добавлена опция выбора цвета спинера загрузки во front-end</li>\n<li>Добавлена опция смены названия метода во front-end, а также опция смены названия для поля &#8220;Адресная доставка&#8221;</li>\n</ul>\n<h4>Version 1.0.2 / (07.06.2019)</h4>\n<ul>\n<li>Исправлена ошибка некорректной кодировки для таблиц плагина</li>\n<li>Добавлен WP Rest Api</li>\n<li>Исправление 500 ошибки сервера у некоторых пользователей на странице оформления заказа</li>\n</ul>\n<h4>Version 1.0.1 / (07.06.2019)</h4>\n<ul>\n<li>Исправлена ошибка, когда скрипты плагина подтягивались на все страницы сайта.</li>\n<li>Добавлена проверка на внутренние ошибки сервера при выборе адреса доставки с выводом их на экран.</li>\n<li>Добавлено версионирование скриптов.</li>\n</ul>\n<h4>Version 1.0.0 / (03.06.2019)</h4>\n<ul>\n<li>Initial</li>\n</ul>\n"
    },
    "short_description": "Simple and comfortable plugin for connect Nova Poshta delivery service to your WooCommerce store.",
    "description": "<p><strong>Simple and comfortable plugin for connect Nova Poshta delivery service to your WooCommerce store.</strong></p>\n<p><a href=\"https://kirillbdev.pro/docs/wcus-base-setup/\" rel=\"nofollow ugc\">Documentation</a><br />\n<a href=\"https://kirillbdev.pro/wc-ukr-shipping-pro/\" rel=\"nofollow ugc\">PRO version</a></p>\n<h3>Installation and setup tutorial</h3>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/IFW0B75s54o?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Features</h3>\n<ul>\n<li>Simple and intuitive setup</li>\n<li>Ability to select Nova Poshta warehouse or poshtomat on checkout page</li>\n<li>Ability to setup fixed shipping cost</li>\n<li>Integration with popular plugins for localization: WPML and Polylang</li>\n<li>Support latest versions of WordPress and WooCommerce</li>\n<li>Support WooCommerce geo zones</li>\n</ul>\n<h3>PRO version</h3>\n<p>WC Ukraine Shipping PRO has additional premium features that helps you to optimize work with your clients</p>\n<ul>\n<li>Full address shipping integration (using Nova Poshta address API)</li>\n<li>Automatic calculation of shipping costs (via Nova Poshta API)</li>\n<li>Shipping costs calculation based on order total</li>\n<li>Ability to separate cost calculation for address shipping</li>\n<li>Ability to generate TTN for all types: W2W, W2D, D2W, D2D</li>\n<li>Ability to mass generation of TTN in one click</li>\n<li>Print TTN of all types: A4, 85&#215;85, 100&#215;100 (zebra)</li>\n<li>Automatic email notifications after generating TTN</li>\n<li>Automatic sms notifications after generating TTN (need extra addon)</li>\n<li>Cloud features (Tracking, Performance address API)</li>\n<li>[Automation] No-code business-processes constructor</li>\n<li>Premium support</li>\n</ul>\n<p><a href=\"https://kirillbdev.pro/wc-ukr-shipping-pro/\" rel=\"nofollow ugc\">Buy PRO version</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.12.4.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/wc-ukr-shipping/assets/screenshot-1.jpg?rev=2376192",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wc-ukr-shipping/assets/screenshot-2.jpg?rev=2376192",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wc-ukr-shipping/assets/screenshot-3.jpg?rev=2376192",
            "caption": ""
        }
    ],
    "tags": {
        "%d0%bd%d0%be%d0%b2%d0%b0-%d0%bf%d0%be%d1%88%d1%82%d0%b0": "Нова пошта",
        "%d0%b4%d0%be%d1%81%d1%82%d0%b0%d0%b2%d0%ba%d0%b0": "доставка",
        "nova-poshta": "nova poshta",
        "shipping": "shipping",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "1.12.4",
    "versions": {
        "1.10.0": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.10.0.zip",
        "1.11.0": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.11.0.zip",
        "1.11.1": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.11.1.zip",
        "1.11.2": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.11.2.zip",
        "1.11.3": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.11.3.zip",
        "1.12.0": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.12.0.zip",
        "1.12.1": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.12.1.zip",
        "1.12.2": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.12.2.zip",
        "1.12.3": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.12.3.zip",
        "1.12.4": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.12.4.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.6.3.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.7.0.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.7.2.zip",
        "1.7.3": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.7.3.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.7.4.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.7.5.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.7.6.zip",
        "1.7.7": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.7.7.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.8.0.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.8.1.zip",
        "1.8.2": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.8.2.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.9.0.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.1.9.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wc-ukr-shipping.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/wc-ukr-shipping/assets/icon-128x128.png?rev=2101507"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 94,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "wc-ukr-shipping",
            "language": "ru_RU",
            "version": "1.12.2",
            "updated": "2024-03-03 07:41:01",
            "package": "https://downloads.wordpress.org/translation/plugin/wc-ukr-shipping/1.12.2/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "wc-ukr-shipping",
            "language": "uk",
            "version": "1.12.2",
            "updated": "2024-02-28 13:08:45",
            "package": "https://downloads.wordpress.org/translation/plugin/wc-ukr-shipping/1.12.2/uk.zip"
        }
    ]
}