{
    "name": "wcEazy &#8211; Supercharge your WooCommerce Store",
    "slug": "wceazy",
    "version": "1.1.6",
    "author": "<a href=\"https://wceazy.com\">wcEazy</a>",
    "author_profile": "https://profiles.wordpress.org/wceazy/",
    "contributors": {
        "wceazy": {
            "profile": "https://profiles.wordpress.org/wceazy/",
            "avatar": "https://secure.gravatar.com/avatar/dd6228efcd64f2fb47e38d9045f9a287?s=96&d=monsterid&r=g",
            "display_name": "wcEazy"
        },
        "wpcommerz": {
            "profile": "https://profiles.wordpress.org/wpcommerz/",
            "avatar": "https://secure.gravatar.com/avatar/0d257d47d55fd7f137d293a63119cdc8?s=96&d=monsterid&r=g",
            "display_name": "WPCommerz"
        },
        "darklup": {
            "profile": "https://profiles.wordpress.org/darklup/",
            "avatar": "https://secure.gravatar.com/avatar/126fb9bb4bde45a5bba791bbe283e320?s=96&d=monsterid&r=g",
            "display_name": "darklup"
        },
        "shahinsalehiin": {
            "profile": "https://profiles.wordpress.org/shahinsalehiin/",
            "avatar": "https://secure.gravatar.com/avatar/026c3ff9692786734529f20a45e1c853?s=96&d=monsterid&r=g",
            "display_name": "Shahin Salehiin"
        },
        "devmahbub": {
            "profile": "https://profiles.wordpress.org/devmahbub/",
            "avatar": "https://secure.gravatar.com/avatar/c667fc1bda82f7d2c717e063192a5bf0?s=96&d=monsterid&r=g",
            "display_name": "Mahbubur Rahman"
        },
        "nftushar": {
            "profile": "https://profiles.wordpress.org/nftushar/",
            "avatar": "https://secure.gravatar.com/avatar/ed27477c29893297bd4241732153937a?s=96&d=monsterid&r=g",
            "display_name": "NF Tushar"
        }
    },
    "requires": "5.1",
    "tested": "6.4.5",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 6,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 6,
    "support_url": "https://wordpress.org/support/plugin/wceazy/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 30,
    "downloaded": 5177,
    "last_updated": "2024-02-03 09:43:00",
    "added": "2022-06-21",
    "homepage": "https://wceazy.com",
    "sections": {
        "description": "<p>wcEazy provides multiple WooCommerce extensions in a single package you&#8217;ll ever require. The most convenient WordPress plugin wcEazy provides enormous modules. This single plugin serves multi purpose to create a perfect WooCommerce site.</p>\n<p>With wcEazy, an all-in-one WooCommerce plugin, you can increase your sales with a wide variety of features. It simplifies the overall customizing way of a WooCommerce site. In addition, no coding related knowledge is required to access this plugin. It comes up with an easy setup and user friendly accessing process.</p>\n<p>Dozens of WordPress WooCommerce plugins are no longer necessary!<br />\nWith just one plugin, you can improve the flexibility of your WooCommerce website.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/i83B2qCVe2Q?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>👁️ <a href=\"https://wceazy.com/\" rel=\"nofollow ugc\">Demo</a> | 🚀 <a href=\"https://wceazy.com/pricing/\" rel=\"nofollow ugc\">Get Pro</a> | 👨‍💻 <a href=\"https://wceazy.com/support/\" rel=\"nofollow ugc\">Get Support</a></p>\n<h3>wcEazy comes with the following features:</h3>\n<ol>\n<li><strong>Enrich with features:</strong> This tremendous plugin is enriched with a lot of features and functionalities. It will help you to provide your customer a flawless experience. You will have proper control on this plugin from your site’s backend portion.\n</li>\n<li><strong>Does not require any coding:</strong> To activate and access the WordPress plugin wcEazy, it is not necessary to have any coding knowledge. Its set up and customizing process are very much user friendly.\n</li>\n<li><strong>Saves cost and time:</strong> Installing one plugin you will get services of different plugins at a time as it provides huge features that can serve all WooCommerce related purposes. This amazing plugin increases your store’s sales and saves your money and time by creating the most flexible WooCommerce site in the most user friendly way.\n    </li>\n<li><strong>Translation:</strong> Now, wcEazy is fully compatible with translation. Any can convert the plugin content into their native language. We have already provided translation files for some languages like Chinese, Bangla, French (France), Japanese, Russian, and Spanish (Spain); more are coming.\n    </li>\n</ol>\n<h3>Modules of WordPress plugin wcEazy</h3>\n<ol>\n<li><strong>Auto Apply Coupon:</strong> Enabling this module you will let your customers enjoy the term of automatically applying coupons by just clicking on the Apply Coupon button. It helps to remove the hassle of entering a coupon code for a coupon.</li>\n<li><strong>BOGO Deal:</strong> Create attractive BOGO deals for your WooCommerce store to catch your customers attention and encourage them to stay in your store and buy products more and more.</li>\n<li><strong>Coupon Generator:</strong> Promote your WooCommerce site generating similar coupons in big quantities with wcEazy. Using this plugin you are allowed to Generate similar types of coupons for clients.</li>\n<li><strong>Floating Cart:</strong> wcEazy provides a floating Cart for WooCommerce that is used to add a sticky cart button with product information, title and image, product count etc.</li>\n<li><strong>One Click Checkout:</strong> It allows users to create a special page using One Click Checkout for WooCommerce website where customers can select products, checkout, and pay all on the same page.</li>\n<li><strong>PDF Invoice and Packing Slips:</strong> Depending on the order state, PDF Invoice &amp; Packing Slip for WooCommerce generates PDF invoices and sends them to your clients by attaching them to the order email. A PDF invoice contains product purchasing details that are used to track and record purpose. You can access the PDF invoice as a file format, print or save it to keep a record.</li>\n<li><strong>Product Sticky Bar:</strong> Initiate your WooCommerce site with product sticky bar  is a useful addon for boosting conversion rates on WooCommerce sites. Every product page contains a sticky bar with an Add to Cart button as well as other product-related information including a product thumbnail, title, rating, and price.</li>\n<li><strong>URL Coupon:</strong> Generate unique URLs to any coupon in your e-commerce store. Adding a URL to any coupon, you can apply a coupon code automatically just by clicking a link.</li>\n<li><strong>Free Shipping Bar:</strong> A floating banner that displays at the top or bottom of your website and informs visitors that you provide free shipping or other offers is known as a free shipping bar. It&#8217;s an excellent approach to encourage customers to complete the checkout process.</li>\n<li><strong>Address Book:</strong> A custom account page menu that gives your customers the option to store multiple billing and shipping addresses and retrieve them on checkout. Addresses can be updated and modified quickly and easily in /my-account/, or saved as part of the checkout process.</li>\n<li><strong>Product Filter:</strong> Easy way to implement a custom shop page like grid of products into any page using shortcode. Including advanced filtering option to let your customers get the right thing they want. Filtering products via product name, price, rating, category and stock status is now no more depended to theme.</li>\n</ol>\n<p>\n<strong>These are the modules with various features and functions. Lets learn more about each of the modules and features.</strong><br />\n</p>\n<h3>Auto Apply Coupon</h3>\n<ol>\n<li><strong>Per Page View:</strong> Select the required amount of coupon that you want to show on each page.\n</li>\n<li><strong>Bulk Actions:</strong> Allows you to add or remove coupons from the list.\n</li>\n<li><strong>Show Coupon Type (Pro):</strong> Filter coupons according to your selected coupon type like percentage discount, fixed cart discount or fixed product discount. </li>\n</ol>\n<h3>BOGO Deal</h3>\n<ol>\n<li><strong>Unlimited Add Rule:</strong> Add unlimited rules for BOGO deal.</li>\n<li><strong>Discount Type:</strong> Select the discount type between percentage discount and fixed discount.\n</li>\n<li><strong>Discount Amount:</strong> Allows you to fix the discount amount that you want to provide.\n</li>\n<li><strong>Products to Buy:</strong> Select the products and the amount that should be bought for getting a discount.\n</li>\n<li><strong>Products to Gift:</strong> Select the products and its amount that are provided as gifts for discount.\n</li>\n</ol>\n<h3>Coupon Generator</h3>\n<ol>\n<li><strong>Prefix (Pro):</strong> Enter prefix for coupons that you want to generate.\n</li>\n<li><strong>Number of Coupons:</strong> You can generate a lot of coupons as you need just by entering the amount of coupons.\n</li>\n<li><strong>Coupon Type (Pro):</strong> Enter the type of coupons. Such as the coupon type can be characters, numbers or both characters and numbers.\n</li>\n<li><strong>Coupon Character length:</strong> Select the coupons’ character length upto 20.\n</li>\n<li><strong>Discount type:</strong> Choose the discount type for generating coupons. </li>\n<li><strong>Allow Free Shipping:</strong> When a free shipping method is enabled in your shipping zone and is set to require &#8220;a valid free shipping coupon” then this feature grants free shipping.\n</li>\n<li><strong>Coupon Expiry Date:</strong> You can set a validity date for coupons.\n</li>\n<li><strong>Usage Restriction:</strong> Minimum spend, Maximum spend, Individual use only, Exclude sale items</li>\n</ol>\n<h3>Floating Cart</h3>\n<ol>\n<li><strong>Auto Open Floating Cart: </strong> Allows the floating cart to open automatically.\n</li>\n<li><strong>Cart Item Order: </strong> You can organize the carts’ items in ascending or descending order.</li>\n<li><strong>Basket Count:</strong> Display the total number of items or products on the floating cart.\n</li>\n<li><strong>URL of Empty Cart Button:</strong> You can insert the URL of cart button for redirection.\n</li>\n<li><strong>Select Don’t Show Pages:</strong> Allows you to select the pages where you don’t want to display the Floating Cart.\n</li>\n<li><strong>Show Notifications:</strong> Enable the required switch to show notifications.\n</li>\n<li><strong>Show Basket Icon:</strong> You can show a basket icon on the floating cart portion that will be displayed in the Cart Header.\n</li>\n<li><strong>Show Close Icon:</strong> In the Cart Header portion, it is possible to show the Close Icon if you need it.</li>\n<li><strong>Notification Duration:</strong> You are allowed to fix the duration of notification in milliseconds.\n</li>\n<li><strong>Show Product Image: </strong> Enable the required option for showing product image in Cart Body.\n</li>\n<li><strong>Show Product Name:</strong> Product name can be shown in the Cart Body section.\n</li>\n<li><strong>Show Product Unit Price: </strong> Allows to show product unit price individually when you access this feature.\n</li>\n<li><strong>Show Product Price Total:</strong>  Turn On the feature to show product price in total.</li>\n<li><strong>Link to Single Product:</strong>  You are allowed to link every single product.</li>\n<li><strong>Delete Item From Cart:</strong>  ‘Delete Item’ option with a Delete Icon can be shown beside each product.</li>\n<li><strong>Allowed Quantity Update:</strong>  Allows updating quantity of products.</li>\n<li><strong>Show Subtotal:</strong>  You can represent the total purchasing amount of products through Subtotal in the Cart Footer section.</li>\n<li><strong>Show Discount:</strong>  Access the feature to show a discount on the Cart Footer portion.</li>\n<li><strong>Show Shipping Amount:</strong>  Shipping amount can be shown in the footer enabling the feature. </li>\n<li><strong>Show Cart Total:</strong>  This feature displays the Cart total in the Cart Footer.</li>\n<li><strong>Show Apply Coupon:</strong>  Allows to apply available coupons in the floating cart footer section.</li>\n<li><strong></strong></li>\n<li><strong>Heading Title:</strong>  Set your cart heading title.</li>\n<li><strong>Continue Shopping Button:</strong>  Modify your cart’s ‘continue shopping button’ text.</li>\n<li><strong>View Cart Button:</strong>  Set your cart&#8217;s ‘view cart button’ text.</li>\n<li><strong>Checkout Button:</strong>  Set your cart&#8217;s ‘checkout’ button’ text.</li>\n<li><strong>Empty Cart Message:</strong>  Provide your ‘empty cart’ message.</li>\n<li><strong>Back to Shop Button:</strong>  Set your ‘back to shop button’ text, when the cart is empty.</li>\n<li><strong>Subtotal Text:</strong>  Modify the text Subtotal if you want.</li>\n<li><strong>Free Shipping Message:</strong>  Set a free shipping message for your customers. </li>\n<li><strong></strong></li>\n<li><strong>Continue Shopping Button Url (Pro):</strong>  Redirect ‘Continue Shopping Button’ URL to your required page.</li>\n<li><strong>View Cart Button Url (Pro):</strong>  Set the redirection page for View Cart Button URL.</li>\n<li><strong>View Checkout Button Url (Pro):</strong>  Redirect URL for View Checkout button to a page that you want to show when clicking on this button.</li>\n<li><strong>Cart Width(px):</strong>  Set your cart width in px.</li>\n<li><strong>Cart Open From:</strong>   Select the position from where the floating cart will be opened.</li>\n<li><strong>Button Font Size:</strong>  Choose your all button font size in px.</li>\n<li><strong>Button Font Color (Pro):</strong>  Font Color of every button can be customizable.</li>\n<li><strong>Button Background (Pro):</strong>  Pick your desired button background color.</li>\n<li><strong>Button Hover Font Color (Pro):</strong>  Select suitable color for button hover font color. </li>\n<li><strong>Button Hover Background (Pro):</strong>  Select a perfect color for button hover background.</li>\n<li><strong>Button Border Color (Pro):</strong>  Button border color is also properly customizable.</li>\n<li><strong>Button Border Hover Color (Pro):</strong>  Allows to choose the color of button border hover.</li>\n<li><strong>Button Border Radius (Pro):</strong>  Fix the buttons border radius in px. </li>\n<li><strong></strong></li>\n<li><strong>Cross Icon Size(px):</strong>  Set the cross icon size that is located in the Cart Header.</li>\n<li><strong>Heading Basket Icon Size(px):</strong>  You can resize the basket icon in the Header portion.</li>\n<li><strong>Heading Font Size(px):</strong>  Set your cart header font size in px.</li>\n<li><strong>Heading Font Color (Pro):</strong>   Heading font color is totally customizable.</li>\n<li><strong>Heading Background Color (Pro):</strong>  Pick your desired heading background color.</li>\n<li><strong>Delete Icon:</strong>  There are some different Delete icons. You choose any of them and locate it in the cart section where the product deleting option is available. But with the free version you have only one icon to access. </li>\n<li><strong>Position Fixed:</strong>  Fix the position of the footer.\n</li>\n<li><strong>Padding:</strong>  Allows to set footers’ padding in px.\n</li>\n<li><strong>Enable Basket:</strong>  You can enable showing the basket in the floating cart for three conditions:  always show, always hide and hide when the cart is empty.\n</li>\n<li><strong>Shape of Basket:</strong>  You can pick a round or square shape for the basket icon.\n</li>\n<li><strong>Basket Icon Size:</strong>  Set the Basket Icon size in px.\n</li>\n<li><strong>Show Count:</strong>  You can show product count on the basket.\n</li>\n<li><strong>Basket Icon:</strong>  Select suitable Basket Icon for your WooCommerce store\n</li>\n<li><strong>Basket Position:</strong>  You can fix the basket position according to your need.\n</li>\n<li><strong>Basket Offset(vertical):</strong>  Set your basket vertical offset in px.\n</li>\n<li><strong>Basket Offset(horizontal):</strong>  Set your basket horizontal offset in px.\n</li>\n<li><strong>Basket Count Position:</strong>  Pick your Basket Count position among top left, top right and bottom left.\n</li>\n<li><strong>Basket Icon Color (Pro):</strong>  Select the suitable color for Basket Icon.\n</li>\n<li><strong>Basket Background Color (Pro):</strong>  Pick Basket Background color of your choice.\n</li>\n<li><strong>Basket Count Color (Pro):</strong>  Basket Count color can also be customizable for your convenience.\n</li>\n<li><strong>Basket Count Background Color(Pro):</strong>  Pick Basket Count background color that matches with the Basket Count color.\n</li>\n</ol>\n<h3>One Click Checkout</h3>\n<ol>\n<li><strong>Disable Cart Page:</strong>  Disable cart page so that the cart page will be redirected to the checkout page.\n    </li>\n<li><strong>Enable Single Page Checkout:</strong>  Enable single page checkout so that the checkout page and cart page show in a single page.\n    </li>\n<li><strong>Allow redirect when adding to cart.:</strong>  After clicking add to cart button customer will be directly redirect to Checkout page.\n    </li>\n<li><strong>Turn off the &#8220;Keep Shopping&#8221; button.:</strong>  WooCommerce shows a continue shopping button after a product is added to cart, with this option you can disable that link so users remain on the checkout page.\n    </li>\n<li><strong>Quickly add item to shopping cart with Ajax. (Pro):</strong>  Turn ON and access Quickly add item to shopping cart with Ajax..\n    </li>\n<li><strong>Alter the &#8220;Add to Cart&#8221; button text.:</strong>  Change the button text of add to cart button. This feature will Add to cart button text, select options button text, Read more button text.\n    </li>\n<li><strong>Buy Now Button on Product Page:</strong>  Turn on if you want the buy now button on the product page.\n    </li>\n<li><strong>Buy Now Button Label on Product Page (Pro):</strong>  Set buy now button label (on product page).\n    </li>\n<li><strong>Redirect to Page on Product Page (Pro):</strong>   Redirect page to that button that you want to.\n    </li>\n<li><strong>Position Of the Button on Product Page (Pro):</strong>  Set the position of the button.\n    </li>\n<li><strong>Buy Now Button Width on Product Page:</strong>  Set Buy now button width on product page (PX).\n    </li>\n<li><strong>Buy Now Button Margin Top on Product Page:</strong>  Set buy now button margin top (PX).\n    </li>\n<li><strong>Buy Now Button Margin Bottom on Product Page:</strong>  Set Buy now button margin bottom (PX).\n    </li>\n<li><strong>Buy Now Button Margin Left on Product Page:</strong>  Set Buy now button margin left (PX).\n    </li>\n<li><strong>Buy Now Button Margin Right on Product Page:</strong>  Set Buy now button margin right (PX).\n    </li>\n<li><strong>Buy Now Button on Product Archive Page:</strong>  Enable the feature if you want the buy now button on the product archive page.\n    </li>\n<li><strong>Buy Now Button Label on Product Archive Page (Pro):</strong>  Insert Buy now button label\n    </li>\n<li><strong>Redirect to Page on Product Archive Page (Pro):</strong>  Select the page that you want to redirect after clicking on this button.\n    </li>\n<li><strong>Position of the Button on Product Archive Page (Pro):</strong>  Fix the position of the button on the product archive page.\n    </li>\n<li><strong>Buy Now Button Width on Product Archive Page:</strong>  Set Buy now button width on product archive page (PX)\n    </li>\n<li><strong>Buy Now Button Margin Top on Product Archive Page:</strong>  Set Buy now button margin top (PX)\n    </li>\n<li><strong>Buy Now Button Margin Bottom on Product Archive Page:</strong>  Set Buy now button margin bottom (PX)\n    </li>\n<li><strong>Buy Now Button Margin Left on Product Archive Page:</strong>  Set Buy now button margin left (PX)\n    </li>\n<li><strong>Buy Now Button Margin Right on Product Archive Page:</strong>  Set Buy now button margin right (PX)\n    </li>\n<li><strong>Buy Now Button’s Font Color:</strong>  You can pick any if your desired font color for the Buy Now button.\n    </li>\n<li><strong>Buy Now Button’sBackground Color:</strong>  Select button’s background color\n    </li>\n<li><strong>Buy Now Button’s Hover Font Color (Pro):</strong>  Select Color for button’s hover font.\n    </li>\n<li><strong>Buy Now Button’s Hover Background Color (Pro):</strong>  Set button hover background color\n    </li>\n<li><strong>Buy Now Button’s Padding Top-Bottom (Pro):</strong>  Fix Buy now button padding top &amp; bottom (PX)\n    </li>\n<li><strong>Buy Now Button’s Padding Left-Right (Pro):</strong>  Set Buy now button padding left &amp; right (PX)\n    </li>\n<li><strong>Buy Now Button’s Border Radius (Pro):</strong>  Set Buy now button border radius (PX) according to your need.\n    </li>\n<li><strong>Remove the Order Comment :</strong>  Enable if you want to remove ‘Order Comment’.\n    </li>\n<li><strong>Remove Coupon Form:</strong>  With this feature you can remove coupon form from one page checkout.\n    </li>\n<li><strong>Remove Policy Text (Pro):</strong>  You are also allowed to remove the policy text portion from the checkout page.\n    </li>\n<li><strong>Remove Terms &amp; Condition:</strong>  Terms &amp; Conditions can also be removed from the one page checkout if needed.\n    </li>\n<li><strong>Remove Billing Fields (Pro):</strong>  Want to remove some billing fields? This feature will provide you the chance to pick some fields that you want to remove from the page.\n    </li>\n<li><strong>Remove Shipping Fields (Pro):</strong>  Choose which information you want to delete from the &#8216;Shipping Section.&#8217;.</li>\n</ol>\n<h3>PDF Invoice and Packing Slips</h3>\n<ol>\n<li><strong>Deactivate Invoice:</strong> Allows you to deactivate invoice.</li>\n<li><strong>Deactivate Shipping Label:</strong> With this feature you can also disable the Shipping Label.</li>\n<li><strong>Shop Info:</strong> The shop name, address, logo, Tax ID, Footer Info can be totally editable. This Shop details will be attached in Shipping form, invoice and other documents.</li>\n<li><strong>Shop Address(Sender Details):</strong> Sender details like Sender Address,City, Postal Code, Country/State, Contact Number are edited using this feature.\n</li>\n<li><strong>View the PDF:</strong> You can decide whether you want to open the pdf in a new window or download it directly. </li>\n<li><strong>Show Tax:</strong> You can show the Tax in the invoice or slips.</li>\n<li><strong>Invoice Turn off:</strong> Allows to select Order statuses which an invoice should not be generated.</li>\n<li><strong>Invoice Attach to:</strong> Select the terms for that you want to attach the invoice.</li>\n<li><strong>Invoice Number Format (Pro):</strong> </li>\n<li><strong></strong> This feature provides you the flexibility to choose the number format for invoice number.</li>\n<li><strong>Order Number as Invoice Number:</strong> Enable the feature if you want to arrange in a particular order by providing a start number for generating the invoice number.</li>\n<li><strong>Invoice Prefix (Pro):</strong>  Select the invoice number prefix.</li>\n<li><strong>Invoice Surfex (Pro): </strong> Select the surfex of the invoice number.</li>\n<li><strong>Customize Invoice:</strong>  Document Title, Shop Logo, Invoice Number, Order Number, Invoice Date, Order Date, From Address, Billing Address, Shipping Address, Email, Phone Number, Payment, Received Stamp, Payment Method, Customer Note, Footer are customizable to create a proper invoice layout.</li>\n<li><strong>Label Tailoring:</strong> Shop Logo, From Address, To Address, Order Number, Weight, Ship, Date, Email, Phone Number are adjustable with this feature to create a perfect layout for shipping labels.</li>\n</ol>\n<h3>Product Sticky Bar</h3>\n<ol>\n<li><strong>Enable Sticky Bar:</strong> Enabling this feature a product sticky bar will always stick around the product description page for customers convenience.</li>\n<li><strong>Show on Desktop:</strong> Turn ON the feature if you show a sticky bar only for desktop users. </li>\n<li><strong>Show on Mobile:</strong> Turn ON the feature if you show a sticky bar only for mobile users.</li>\n<li><strong>Sticky Bar Position:</strong> Select Top or bottom to show the sticky bar</li>\n<li><strong>Show Only After Scroll:</strong> Show sticky bar when user scrolls down in product page.</li>\n<li><strong>Scroll Pixels:</strong>Show Bar after user scroll given pixels on the product page, Only work when the &#8220;Scroll Pixels&#8221; option is enabled.</li>\n<li><strong>Show Product Review:</strong>Allows you to show product review on sticky bar.</li>\n<li><strong>Show Product Review Count:</strong> Allows you to show product reviews on sticky bar.</li>\n<li><strong>Turn off (Pro):</strong> Select the products that you do not want to show the sticky bar.</li>\n<li><strong>Enable Update Product Qty:</strong> Allows to show update product quantity on sticky bar.</li>\n<li><strong>Show Product Image:</strong>Enable the feature if you want show product image on sticky bar.</li>\n<li><strong>Show Stock Status:</strong>Using this feature show stock quantity on sticky bar.</li>\n<li><strong>Hide Sticky Bar( Product Out of Stock ):</strong> Enable it if you do not show sticky bar when product out of stock.</li>\n<li><strong>Sticky Bar&#8217;s Height:</strong> Set sticky bar height in pixel(Ex.150) &#8211; Default 100px.</li>\n<li><strong>Product Image Shape:</strong>Select Product image shape between round and square.</li>\n<li><strong>Product Title Color  (Pro):</strong>Select Color for product title.</li>\n<li><strong>Product Rating Color  (Pro):</strong>Allows you to pick any color for Product Rating.</li>\n<li><strong>Product Rating Count Color (Pro):</strong> Allows you to pick any color for Product Rating Count.</li>\n<li><strong>Product Price Color (Pro):</strong> You can select Product price color as you want.</li>\n<li><strong>Button Font Size:</strong>Set sticky bar product price font size(Ex. 16).</li>\n<li><strong>Button Background Color  (Pro):</strong> Select Color for button background.</li>\n<li><strong>Button Font Color (Pro):</strong>Select button font Color.</li>\n<li><strong>Button Font Size:</strong>Set sticky bar add to cart button font size.</li>\n<li><strong>Button Border Color  (Pro):</strong> Select Color for button border color.</li>\n<li><strong>Button Border Width:</strong>Set sticky bar add to cart button border width.</li>\n<li><strong>Button Background Hover Color  (Pro):</strong>Select button background hover Color.</li>\n<li><strong>Button Border Hover Color  (Pro):</strong>Select button border hover Color.</li>\n<li><strong>Button Hover Font Color  (Pro):</strong>Select button hover font Color.</li>\n<li><strong>Button Padding Left-Right  (Pro):</strong> Set sticky bar add to cart button left-right padding.</li>\n<li><strong>Button Padding Top-Bottom  (Pro):</strong>Set sticky bar add to cart button top-bottom padding.</li>\n</ol>\n<h3>URL Coupon</h3>\n<ol>\n<li><strong>Per Page View:</strong> Select the amount of coupons that you want to show on each page.</li>\n<li><strong>Show Coupon Type (Pro):</strong> Choose your required coupon type for URL coupon. </li>\n<li><strong>Active Coupon URL: </strong> Enable coupon URL functionality for this coupon by activating the feature. </li>\n<li><strong>Force Apply:</strong> Apply the feature of Force Appy and it will remove all other coupons and only apply the current coupon on cart items. </li>\n<li><strong>Coupon URL:</strong> Using this feature you can copy the url of a coupon. </li>\n<li><strong>Override URL Code:</strong> You can easily override a coupon’s url as you need. The changes you have made will show in the field of Coupon URL. </li>\n<li><strong>Redirect To URL:</strong> Using this feature you can redirect a page with the coupon url. That means on a customer click the coupon url will redirect to the page. </li>\n<li><strong>Success Message:</strong> Leave a success message on applying the URL Coupon. </li>\n</ol>\n<h3>Free Shipping Bar</h3>\n<ol>\n<li><strong>Enable Shipping Bar:</strong> Allows to enable the Shipping bar.</li>\n<li><strong>Display in Desktop:</strong> This feature is to enable the shipping bar only for desktop screens. </li>\n<li><strong>Display in Mobile:</strong> When enabling this feature the Shipping bar will be displayed in mobile screens. </li>\n<li><strong>Select Shipping Zone:</strong> Allows you to select a shipping zone. </li>\n<li><strong>Detect IP:</strong>The person that accesses your website will automatically apply to the free Shipping Zone using their IP if you enable Detect IP. </li>\n<li><strong>Exclude Pages:</strong> Provide the scope to exclude the pages where you do&#8217;t want to show the Free Shipping Bar. </li>\n<li><strong>Leave out items. (Pro):</strong> Accessing this feature you can exclude particular pages for which you don’t want to show the free Shipping Bar. </li>\n<li><strong>Cart Total:</strong> Enable the feature to show the free shipping notification in the cart page subtotal area. </li>\n<li><strong>Choose spot on cart page.:</strong> Allows to select position of the free shipping notification in the cart page. </li>\n<li><strong>Display in Total Cost Area:</strong> It permits to show the free shipping notification in the checkout subtotal area. </li>\n<li><strong>Inside Progress Bar Text:</strong> Accessing this feature you can enter the text of cart &amp; checkout page free shipping progress bar. </li>\n<li><strong>Progress Bar&#8217;s Background (Pro):</strong> Customize the color of Free Shipping Bar&#8217;s which is shown in cart &amp; checkout page. </li>\n<li><strong>System Announce:</strong> Using the feature you have to provide a message about minimum order amount for free shipping. </li>\n<li><strong>Purchased Message (Pro):</strong> After purchasing products this feature will show your customers a purchase message according to a customer’s cart total, minimum order and missing amount. </li>\n<li><strong>Success Message:</strong> Allows  to Write a success message and use the shortcode {checkout_page} to redirect the checkout page. </li>\n<li><strong>Initial Delay Time (Pro):</strong> Add an initial delay time in millisecond. The Free Shipping Bar will appear according to your setting time. </li>\n<li><strong>Allow Disappear Time (Pro):</strong>The feature allows time to disappear the shipping bar.</li>\n<li><strong>Set Disappear Time (Pro):</strong> When you allow disappear time, you need to  Set initial delay time to disappear the Free Shipping Bar. </li>\n<li><strong>Shipping Bar Position:</strong> This feature lets you select a position between top and bottom of the free shipping bar. </li>\n<li><strong>Progress Bar Layout (Pro):</strong> The feature provides three different layouts. You have to select a layout according to your choice. </li>\n<li><strong>Background Color (Pro):</strong> Accessing the feature you flexibly pick a color for the background of the shipping bar according to your requirements that can match with your site’s overall color. </li>\n<li><strong>Inner Bar Background Color (Pro):</strong> Set your free shipping bar inner background color. </li>\n<li><strong>Text Color (Pro):</strong> With this feature you can pick any color for the shipping bar’s text color. </li>\n<li><strong>Link Color:</strong> Set your free shipping bar link color. </li>\n<li><strong>Font Size:</strong> Font size can be modified with Font Size. </li>\n<li><strong>Text Align:</strong> Set your free shipping bar text align among left, cent and right accessing this feature. </li>\n<li><strong>Shipping Bar Close Icon:</strong> Some close icons are available here. Select your  required one for the free shipping bar close icon. </li>\n<li><strong>Close Icon Color (Pro):</strong> Set your free shipping bar close icon color using the feature. </li>\n<li><strong>Close Icon Size:</strong> You can set here free shipping bar close icon size. </li>\n<li><strong>Enable Progress Bar:</strong> Show progress bar with free shipping bar. </li>\n<li><strong>Progress Bar Background (Pro):</strong> Allows to set your progress bar background color. </li>\n<li><strong>Current Progress Background (Pro):</strong> Set your free shipping bar current progress background color. </li>\n<li><strong>Progress Text Color (Pro):</strong> Free shipping bar progress text color is 100% customizable. </li>\n<li><strong>Progress Bar Font Size:</strong> Set your free shipping bar progress font size using the feature. </li>\n<li><strong>Current Progress Background (Pro):</strong> Set your free shipping bar current progress background color. </li>\n<li><strong>Current Progress Background (Pro):</strong> Set your free shipping bar current progress background color. </li>\n<li><strong>Current Progress Background (Pro):</strong> Set your free shipping bar current progress background color. </li>\n<li><strong>Current Progress Background (Pro):</strong> Set your free shipping bar current progress background color. </li>\n</ol>\n<h3>Address Book</h3>\n<ol>\n<li><strong>My Account Billing Address Book:</strong> Allows to enable address book for billing on customers account page.</li>\n<li><strong>My Account Shipping Address Book:</strong> Allows to enable address book for shipping on customers account page.</li>\n<li><strong>Enable Billing Address on Checkout:</strong> Allows to enable address field selection for billing on checkout page.</li>\n<li><strong>Enable Shipping Address on Checkout:</strong> Allows to enable address field selection for shipping on checkout page.</li>\n<li><strong>Address Field Label:</strong> Allows to Change the label text for the address field on the checkout page.</li>\n<li><strong>Menu Title:</strong> Allows to set the account page menu title for Address Book.</li>\n<li><strong>Billing Address Book Headline:</strong> Allows to set the headline text of billing address book.</li>\n<li><strong>Shipping Address Book Headline:</strong> Allows to set the headline text of shipping address book.</li>\n<li><strong>Add Billing Address Button Text (Pro):</strong> Allows to set the button text of add new billing address.</li>\n<li><strong>Add Shipping Address Button Text (Pro):</strong> Allows to set the button text of add new shipping address.</li>\n<li><strong>Billing Address Book Empty Message (Pro):</strong> Allows to set the empty message text of billing address book.</li>\n<li><strong>Shipping Address Book Empty Message (Pro):</strong> Allows to set the empty message text of shipping address book.</li>\n<li><strong>Address Edit Link Text (Pro):</strong> Allows to set the address edit link text.</li>\n<li><strong>Address Delete Link Text (Pro):</strong> Allows to set the address delete link text.</li>\n<li><strong>Address Make Primary Link Text (Pro):</strong> Allows to set the address make primary link text.</li>\n<li><strong>Add Button Background Color (Pro):</strong> Allows to set the add new button background color.</li>\n<li><strong>Add Button Text Color (Pro):</strong> Allows to set the add new button text color.</li>\n<li><strong>Address Card Background Color (Pro):</strong> Allows to set the background color of address card.</li>\n<li><strong>Address Text Color (Pro):</strong> Allows to set the text color of address inside address card.</li>\n<li><strong>Card Bottom Color (Pro):</strong> Allows to set the footer background color of address card.</li>\n</ol>\n<h3>Product Filter</h3>\n<ol>\n<li><strong>Show Search Filter:</strong> Allows to show search filter in sidebar.</li>\n<li><strong>Show Price Filter:</strong> Allows to show price filter in sidebar.</li>\n<li><strong>Show Rating Filter:</strong> Allows to show rating filter in sidebar.</li>\n<li><strong>Show Category Filter:</strong> Allows to show category filter in sidebar.</li>\n<li><strong>Show Stock Status Filter:</strong> Allows to show stock status filter in sidebar.</li>\n<li><strong>Filter Sidebar Position:</strong> Allows to show the filtering in left or right side of products grid.</li>\n<li><strong>Max Product Per Page:</strong> Allows to set maximum number of products can be showed in a page.</li>\n<li><strong>&#8220;Add to Cart&#8221; Button Text:</strong> Allows to customize &#8220;Add to Cart&#8221; Button Text.</li>\n<li><strong>Action Button Background Color (Pro):</strong> Allows to set background color of Add to Cart button.</li>\n<li><strong>Action Button Font Color (Pro):</strong> Allows to set font color of Add to Cart button.</li>\n<li><strong>Product Loader Color (Pro):</strong> Allows to set the color of product loader animation.</li>\n<li><strong>Search Filter Label Text:</strong> Allows to set the Search Filter Label text.</li>\n<li><strong>Search Filter Placeholder Text:</strong> Allows to set the Search Field input placeholder text.</li>\n<li><strong>Search Filter Input Field Border Color (Pro):</strong> Allows to set border color of input field of the search filter.</li>\n<li><strong>Search Filter Input Field Background Color (Pro):</strong> Allows to set background color of input field of the search filter.</li>\n<li><strong>Search Filter Input Field Text Color (Pro):</strong> Allows to set text color of input field of the search filter.</li>\n<li><strong>Price Filter Label Text:</strong> Allows to set the Price Filter Label text.</li>\n<li><strong>Price Filter Input Field Border Color (Pro):</strong> Allows to set border color of input field of the Price filter.</li>\n<li><strong>Price Filter Input Field Background Color (Pro):</strong> Allows to set background color of input field of the Price filter.</li>\n<li><strong>Price Filter Input Field Text Color (Pro):</strong> Allows to set text color of input field of the Price filter.</li>\n<li><strong>Rating Filter Label Text:</strong> Allows to set the Rating Filter Label text.</li>\n<li><strong>Rating Filter Show 5 to 0 Star Rating:</strong> Allows to show the 5 to 0 star rating filter respectively.</li>\n<li><strong>Category Filter Label Text:</strong> Allows to set the Category Filter Label text.</li>\n<li><strong>Category Filter Checkbox Design (Pro):</strong> Allows to customize the checkbox design of category.</li>\n</ol>\n<h3>Get Started with wcEazy</h3>\n<p>When you are working on your WooCommerce store and want to make it full of functions and flexibilities then WordPress plugin wcEazy can be the great solution for you. You will get all kinds of support from one plugin. So, hurry up and grab the most wonderful and workable plugin that is highly recommended for you.\n</p>\n<p>Replace all of your complex and time consuming WooCommerce plugins with a single plugin that does everything they do and more!</p>\n<h3>Privacy Policy</h3>\n<p>wcEazy I Supercharge your WooCommerce Store uses <a href=\"https://appsero.com\" rel=\"nofollow ugc\">Appsero</a> SDK to collect some telemetry data upon user&#8217;s confirmation. This helps us to troubleshoot problems faster &amp; make product improvements.</p>\n<p>Appsero SDK <strong>does not gather any data by default.</strong> The SDK only starts gathering basic telemetry data <strong>when a user allows it via the admin notice</strong>. We collect the data to ensure a great user experience for all our users.</p>\n<p>Integrating Appsero SDK <strong>DOES NOT IMMEDIATELY</strong> start gathering data, <strong>without confirmation from users in any case.</strong></p>\n<p>Learn more about how <a href=\"https://appsero.com/privacy-policy/\" rel=\"nofollow ugc\">Appsero collects and uses this data</a>.</p>\n",
        "installation": "<p><strong>The easy way.</strong></p>\n<p>Go to your WordPress Dashboard. Navigate to Plugins &gt; Add New and then search for &#8220;wcEazy&#8221;. Click on Install and then Activate the Plugin.</p>\n<p>That&#8217;s it, wcEazy Plugin is now activated on your site!</p>\n<p><strong>The hard way..</strong></p>\n<p>Download &#8220;wcEazy WordPress Plugin&#8221;  and then extract the zip file and just drop the contents in the wp-content/plugins/ directory of your WordPress installation and then activate the Plugin from Plugins page.</p>\n",
        "faq": "\n<dt id='1.%20how%20to%20install%20wceazy%20for%20woocommerce%20website%20%28%20free%20version%29%3F'>\n1. How to install wcEazy for WooCommerce website ( free version)?\n</h4>\n<p>\n<p>Installation of wcEazy in your WordPress website’s dashboard is the easiest way. You can easily install wcEazy in your WordPress website’s  Dashboard. Follow the given steps to add wcEazy in your site.<br />\nFirst of all log in to your site’s Dashboard.</p>\n<ol>\n<li>In the left panel click on Plugins tab then click Add New.</li>\n<li>In the search bar, search for wcEazy. The plugin will appear at the top of the list.</li>\n<li>Install the wcEazy by clicking on Install Now.</li>\n<li>After completing installation, Activate wcEazy.</li>\n</ol>\n<p>Adding wcEazy is done. Now in the left panel of your Dashboard you can see the tab of wcEazy.</p>\n</p>\n<dt id='2.%20how%20to%20unlock%20the%20locked%20features%3F'>\n2. How to unlock the locked features?\n</h4>\n<p>\n<p>To unlock the locked features you need to install the paid version of wcEazy. Install the paid wcEazy and enjoy all of its amazing features.</p>\n</p>\n<dt id='3.%20do%20i%20need%20to%20acquire%20any%20coding%20knowledge%20to%20use%20wceazy%3F'>\n3. Do I need to acquire any coding knowledge to use wcEazy?\n</h4>\n<p>\n<p>No, you don’t have to gather any coding knowledge. Just install the plugin, it is very much user friendly and provides proper direction to access all its features.</p>\n</p>\n<dt id='4.%20does%20the%20plugin%20provide%20necessary%20information%20to%20help%3F'>\n4. Does the plugin provide necessary information to help?\n</h4>\n<p>\n<p>Yes, the plugin provides documentation. You can go through the documentation if you need any help or instruction to use this plugin. All module and feature related details are given in the documentation.</p>\n</p>\n<dt id='5.%20why%20should%20i%20grab%20the%20paid%20version%20of%20wceazy%3F'>\n5. Why should I grab the paid version of wcEazy?\n</h4>\n<p>\n<p>When you are using the free version, you can feel the necessity of having such an efficient plugin like wcEazy in your WooCommerce site. And you will be more interested to explore all locked features as all modules and features are very much supportive for a WooCommerce site.<br />\nThe most important thing is this plugin is a single package of 50+ solutions. So you don’t have to buy individual plugins to serve your purpose as wcEazy is an all one solution with multiple modules and features. For this reason paid wcEazy is highly recommended for you.</p>\n</p>\n\n",
        "changelog": "<h4>1.1.6</h4>\n<ol>\n<li>Added: 100% translation ready</li>\n<li>Added: Provide translation for Chinese, Bangla, French (France), Japanese, Russian, German and Spanish (Spain).</li>\n<li>Fixed: Document link issue</li>\n</ol>\n<h4>1.1.5</h4>\n<ol>\n<li>Change documentation link </li>\n<li>Add doc link in quick links </li>\n<li>Update readme file with pro/demo/YT link</li>\n<li>Improved: Performance of the plugin has been improved.</li>\n<li>Fixed: Minor CSS fixed.</li>\n</ol>\n<h4>1.1.4</h4>\n<ol>\n<li>Improved: Performance of the plugin has been improved.</li>\n<li>Fixed: Minor CSS fixed.</li>\n</ol>\n<h4>1.1.3</h4>\n<ol>\n<li>Added: Added Order Cancel Pro module placeholder</li>\n<li>Improved: CSS Update.</li>\n<li>Fixed: Several minor issues have been fixed.</li>\n</ol>\n<h4>1.1.2</h4>\n<ol>\n<li>Fixed: Shipping Bar Responsive Issue</li>\n<li>Improved: CSS Update.</li>\n</ol>\n<h4>1.1.1</h4>\n<ol>\n<li>Fixed: Small issue fix</li>\n<li>Improved: Performance of the plugin has been improved.</li>\n</ol>\n<h4>1.1.0</h4>\n<ol>\n<li>Fixed: Product Sticky Bar responsiveness issue on mobile device has been solved</li>\n<li>Fixed: Free Shipping Bar large decimal points issue has been solved</li>\n</ol>\n<h4>1.0.9</h4>\n<ol>\n<li>Added: New Product Filter Module has been added</li>\n</ol>\n<h4>1.0.8</h4>\n<ol>\n<li>Updated: Floating Cart Basket Item Count update on Ajax Add to Cart.</li>\n<li>Updated: Floating Cart Item count update on Ajax Add to Cart.</li>\n<li>Fixed: Responsive Issue on large screen.</li>\n</ol>\n<h4>1.0.7</h4>\n<ol>\n<li>Added: Address Book Module to allow store multiple billing and shipping addresses and retrieve them on checkout.</li>\n</ol>\n<h4>1.0.6</h4>\n<ol>\n<li>Updated: Loader added while module status is being changed to avoid UI conflict.</li>\n</ol>\n<h4>1.0.5</h4>\n<ol>\n<li>Updated: Code efficiency increased to improve memory consumption.</li>\n<li>Updated: Recoded for lower plugin size and fast loading.</li>\n<li>Added: More customization feature added in several modules.</li>\n</ol>\n<h4>1.0.4</h4>\n<ol>\n<li>Fix: Responsive issues for free shipping bar.</li>\n<li>Fixed: Invoice Number Issue for pdf invoice &amp; packing slip module.</li>\n</ol>\n<h4>1.0.3</h4>\n<ol>\n<li>Fix: Free Shipping Bar module&#8217;s css issues.</li>\n<li>Added: Select Shipping Zone Note for Free Shipping Bar module.</li>\n</ol>\n<h4>1.0.2</h4>\n<ol>\n<li>New module added : Free Shipping Bar.</li>\n<li>Fix: PDF Invoice &amp; Shipping Slip module&#8217;s undefined call to member function issues.</li>\n</ol>\n<h4>1.0.1</h4>\n<p>This is initial Release for wcEazy</p>\n"
    },
    "short_description": "wcEazy provides multiple WooCommerce extensions in a single package you&#039;ll ever require. The most convenient WordPress plugin wcEazy provides eno &hellip;",
    "description": "<p>wcEazy provides multiple WooCommerce extensions in a single package you&#8217;ll ever require. The most convenient WordPress plugin wcEazy provides enormous modules. This single plugin serves multi purpose to create a perfect WooCommerce site.</p>\n<p>With wcEazy, an all-in-one WooCommerce plugin, you can increase your sales with a wide variety of features. It simplifies the overall customizing way of a WooCommerce site. In addition, no coding related knowledge is required to access this plugin. It comes up with an easy setup and user friendly accessing process.</p>\n<p>Dozens of WordPress WooCommerce plugins are no longer necessary!<br />\nWith just one plugin, you can improve the flexibility of your WooCommerce website.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/i83B2qCVe2Q?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>👁️ <a href=\"https://wceazy.com/\" rel=\"nofollow ugc\">Demo</a> | 🚀 <a href=\"https://wceazy.com/pricing/\" rel=\"nofollow ugc\">Get Pro</a> | 👨‍💻 <a href=\"https://wceazy.com/support/\" rel=\"nofollow ugc\">Get Support</a></p>\n<h3>wcEazy comes with the following features:</h3>\n<ol>\n<li><strong>Enrich with features:</strong> This tremendous plugin is enriched with a lot of features and functionalities. It will help you to provide your customer a flawless experience. You will have proper control on this plugin from your site’s backend portion.\n</li>\n<li><strong>Does not require any coding:</strong> To activate and access the WordPress plugin wcEazy, it is not necessary to have any coding knowledge. Its set up and customizing process are very much user friendly.\n</li>\n<li><strong>Saves cost and time:</strong> Installing one plugin you will get services of different plugins at a time as it provides huge features that can serve all WooCommerce related purposes. This amazing plugin increases your store’s sales and saves your money and time by creating the most flexible WooCommerce site in the most user friendly way.\n    </li>\n<li><strong>Translation:</strong> Now, wcEazy is fully compatible with translation. Any can convert the plugin content into their native language. We have already provided translation files for some languages like Chinese, Bangla, French (France), Japanese, Russian, and Spanish (Spain); more are coming.\n    </li>\n</ol>\n<h3>Modules of WordPress plugin wcEazy</h3>\n<ol>\n<li><strong>Auto Apply Coupon:</strong> Enabling this module you will let your customers enjoy the term of automatically applying coupons by just clicking on the Apply Coupon button. It helps to remove the hassle of entering a coupon code for a coupon.</li>\n<li><strong>BOGO Deal:</strong> Create attractive BOGO deals for your WooCommerce store to catch your customers attention and encourage them to stay in your store and buy products more and more.</li>\n<li><strong>Coupon Generator:</strong> Promote your WooCommerce site generating similar coupons in big quantities with wcEazy. Using this plugin you are allowed to Generate similar types of coupons for clients.</li>\n<li><strong>Floating Cart:</strong> wcEazy provides a floating Cart for WooCommerce that is used to add a sticky cart button with product information, title and image, product count etc.</li>\n<li><strong>One Click Checkout:</strong> It allows users to create a special page using One Click Checkout for WooCommerce website where customers can select products, checkout, and pay all on the same page.</li>\n<li><strong>PDF Invoice and Packing Slips:</strong> Depending on the order state, PDF Invoice &amp; Packing Slip for WooCommerce generates PDF invoices and sends them to your clients by attaching them to the order email. A PDF invoice contains product purchasing details that are used to track and record purpose. You can access the PDF invoice as a file format, print or save it to keep a record.</li>\n<li><strong>Product Sticky Bar:</strong> Initiate your WooCommerce site with product sticky bar  is a useful addon for boosting conversion rates on WooCommerce sites. Every product page contains a sticky bar with an Add to Cart button as well as other product-related information including a product thumbnail, title, rating, and price.</li>\n<li><strong>URL Coupon:</strong> Generate unique URLs to any coupon in your e-commerce store. Adding a URL to any coupon, you can apply a coupon code automatically just by clicking a link.</li>\n<li><strong>Free Shipping Bar:</strong> A floating banner that displays at the top or bottom of your website and informs visitors that you provide free shipping or other offers is known as a free shipping bar. It&#8217;s an excellent approach to encourage customers to complete the checkout process.</li>\n<li><strong>Address Book:</strong> A custom account page menu that gives your customers the option to store multiple billing and shipping addresses and retrieve them on checkout. Addresses can be updated and modified quickly and easily in /my-account/, or saved as part of the checkout process.</li>\n<li><strong>Product Filter:</strong> Easy way to implement a custom shop page like grid of products into any page using shortcode. Including advanced filtering option to let your customers get the right thing they want. Filtering products via product name, price, rating, category and stock status is now no more depended to theme.</li>\n</ol>\n<p>\n<strong>These are the modules with various features and functions. Lets learn more about each of the modules and features.</strong><br />\n</p>\n<h3>Auto Apply Coupon</h3>\n<ol>\n<li><strong>Per Page View:</strong> Select the required amount of coupon that you want to show on each page.\n</li>\n<li><strong>Bulk Actions:</strong> Allows you to add or remove coupons from the list.\n</li>\n<li><strong>Show Coupon Type (Pro):</strong> Filter coupons according to your selected coupon type like percentage discount, fixed cart discount or fixed product discount. </li>\n</ol>\n<h3>BOGO Deal</h3>\n<ol>\n<li><strong>Unlimited Add Rule:</strong> Add unlimited rules for BOGO deal.</li>\n<li><strong>Discount Type:</strong> Select the discount type between percentage discount and fixed discount.\n</li>\n<li><strong>Discount Amount:</strong> Allows you to fix the discount amount that you want to provide.\n</li>\n<li><strong>Products to Buy:</strong> Select the products and the amount that should be bought for getting a discount.\n</li>\n<li><strong>Products to Gift:</strong> Select the products and its amount that are provided as gifts for discount.\n</li>\n</ol>\n<h3>Coupon Generator</h3>\n<ol>\n<li><strong>Prefix (Pro):</strong> Enter prefix for coupons that you want to generate.\n</li>\n<li><strong>Number of Coupons:</strong> You can generate a lot of coupons as you need just by entering the amount of coupons.\n</li>\n<li><strong>Coupon Type (Pro):</strong> Enter the type of coupons. Such as the coupon type can be characters, numbers or both characters and numbers.\n</li>\n<li><strong>Coupon Character length:</strong> Select the coupons’ character length upto 20.\n</li>\n<li><strong>Discount type:</strong> Choose the discount type for generating coupons. </li>\n<li><strong>Allow Free Shipping:</strong> When a free shipping method is enabled in your shipping zone and is set to require &#8220;a valid free shipping coupon” then this feature grants free shipping.\n</li>\n<li><strong>Coupon Expiry Date:</strong> You can set a validity date for coupons.\n</li>\n<li><strong>Usage Restriction:</strong> Minimum spend, Maximum spend, Individual use only, Exclude sale items</li>\n</ol>\n<h3>Floating Cart</h3>\n<ol>\n<li><strong>Auto Open Floating Cart: </strong> Allows the floating cart to open automatically.\n</li>\n<li><strong>Cart Item Order: </strong> You can organize the carts’ items in ascending or descending order.</li>\n<li><strong>Basket Count:</strong> Display the total number of items or products on the floating cart.\n</li>\n<li><strong>URL of Empty Cart Button:</strong> You can insert the URL of cart button for redirection.\n</li>\n<li><strong>Select Don’t Show Pages:</strong> Allows you to select the pages where you don’t want to display the Floating Cart.\n</li>\n<li><strong>Show Notifications:</strong> Enable the required switch to show notifications.\n</li>\n<li><strong>Show Basket Icon:</strong> You can show a basket icon on the floating cart portion that will be displayed in the Cart Header.\n</li>\n<li><strong>Show Close Icon:</strong> In the Cart Header portion, it is possible to show the Close Icon if you need it.</li>\n<li><strong>Notification Duration:</strong> You are allowed to fix the duration of notification in milliseconds.\n</li>\n<li><strong>Show Product Image: </strong> Enable the required option for showing product image in Cart Body.\n</li>\n<li><strong>Show Product Name:</strong> Product name can be shown in the Cart Body section.\n</li>\n<li><strong>Show Product Unit Price: </strong> Allows to show product unit price individually when you access this feature.\n</li>\n<li><strong>Show Product Price Total:</strong>  Turn On the feature to show product price in total.</li>\n<li><strong>Link to Single Product:</strong>  You are allowed to link every single product.</li>\n<li><strong>Delete Item From Cart:</strong>  ‘Delete Item’ option with a Delete Icon can be shown beside each product.</li>\n<li><strong>Allowed Quantity Update:</strong>  Allows updating quantity of products.</li>\n<li><strong>Show Subtotal:</strong>  You can represent the total purchasing amount of products through Subtotal in the Cart Footer section.</li>\n<li><strong>Show Discount:</strong>  Access the feature to show a discount on the Cart Footer portion.</li>\n<li><strong>Show Shipping Amount:</strong>  Shipping amount can be shown in the footer enabling the feature. </li>\n<li><strong>Show Cart Total:</strong>  This feature displays the Cart total in the Cart Footer.</li>\n<li><strong>Show Apply Coupon:</strong>  Allows to apply available coupons in the floating cart footer section.</li>\n<li><strong></strong></li>\n<li><strong>Heading Title:</strong>  Set your cart heading title.</li>\n<li><strong>Continue Shopping Button:</strong>  Modify your cart’s ‘continue shopping button’ text.</li>\n<li><strong>View Cart Button:</strong>  Set your cart&#8217;s ‘view cart button’ text.</li>\n<li><strong>Checkout Button:</strong>  Set your cart&#8217;s ‘checkout’ button’ text.</li>\n<li><strong>Empty Cart Message:</strong>  Provide your ‘empty cart’ message.</li>\n<li><strong>Back to Shop Button:</strong>  Set your ‘back to shop button’ text, when the cart is empty.</li>\n<li><strong>Subtotal Text:</strong>  Modify the text Subtotal if you want.</li>\n<li><strong>Free Shipping Message:</strong>  Set a free shipping message for your customers. </li>\n<li><strong></strong></li>\n<li><strong>Continue Shopping Button Url (Pro):</strong>  Redirect ‘Continue Shopping Button’ URL to your required page.</li>\n<li><strong>View Cart Button Url (Pro):</strong>  Set the redirection page for View Cart Button URL.</li>\n<li><strong>View Checkout Button Url (Pro):</strong>  Redirect URL for View Checkout button to a page that you want to show when clicking on this button.</li>\n<li><strong>Cart Width(px):</strong>  Set your cart width in px.</li>\n<li><strong>Cart Open From:</strong>   Select the position from where the floating cart will be opened.</li>\n<li><strong>Button Font Size:</strong>  Choose your all button font size in px.</li>\n<li><strong>Button Font Color (Pro):</strong>  Font Color of every button can be customizable.</li>\n<li><strong>Button Background (Pro):</strong>  Pick your desired button background color.</li>\n<li><strong>Button Hover Font Color (Pro):</strong>  Select suitable color for button hover font color. </li>\n<li><strong>Button Hover Background (Pro):</strong>  Select a perfect color for button hover background.</li>\n<li><strong>Button Border Color (Pro):</strong>  Button border color is also properly customizable.</li>\n<li><strong>Button Border Hover Color (Pro):</strong>  Allows to choose the color of button border hover.</li>\n<li><strong>Button Border Radius (Pro):</strong>  Fix the buttons border radius in px. </li>\n<li><strong></strong></li>\n<li><strong>Cross Icon Size(px):</strong>  Set the cross icon size that is located in the Cart Header.</li>\n<li><strong>Heading Basket Icon Size(px):</strong>  You can resize the basket icon in the Header portion.</li>\n<li><strong>Heading Font Size(px):</strong>  Set your cart header font size in px.</li>\n<li><strong>Heading Font Color (Pro):</strong>   Heading font color is totally customizable.</li>\n<li><strong>Heading Background Color (Pro):</strong>  Pick your desired heading background color.</li>\n<li><strong>Delete Icon:</strong>  There are some different Delete icons. You choose any of them and locate it in the cart section where the product deleting option is available. But with the free version you have only one icon to access. </li>\n<li><strong>Position Fixed:</strong>  Fix the position of the footer.\n</li>\n<li><strong>Padding:</strong>  Allows to set footers’ padding in px.\n</li>\n<li><strong>Enable Basket:</strong>  You can enable showing the basket in the floating cart for three conditions:  always show, always hide and hide when the cart is empty.\n</li>\n<li><strong>Shape of Basket:</strong>  You can pick a round or square shape for the basket icon.\n</li>\n<li><strong>Basket Icon Size:</strong>  Set the Basket Icon size in px.\n</li>\n<li><strong>Show Count:</strong>  You can show product count on the basket.\n</li>\n<li><strong>Basket Icon:</strong>  Select suitable Basket Icon for your WooCommerce store\n</li>\n<li><strong>Basket Position:</strong>  You can fix the basket position according to your need.\n</li>\n<li><strong>Basket Offset(vertical):</strong>  Set your basket vertical offset in px.\n</li>\n<li><strong>Basket Offset(horizontal):</strong>  Set your basket horizontal offset in px.\n</li>\n<li><strong>Basket Count Position:</strong>  Pick your Basket Count position among top left, top right and bottom left.\n</li>\n<li><strong>Basket Icon Color (Pro):</strong>  Select the suitable color for Basket Icon.\n</li>\n<li><strong>Basket Background Color (Pro):</strong>  Pick Basket Background color of your choice.\n</li>\n<li><strong>Basket Count Color (Pro):</strong>  Basket Count color can also be customizable for your convenience.\n</li>\n<li><strong>Basket Count Background Color(Pro):</strong>  Pick Basket Count background color that matches with the Basket Count color.\n</li>\n</ol>\n<h3>One Click Checkout</h3>\n<ol>\n<li><strong>Disable Cart Page:</strong>  Disable cart page so that the cart page will be redirected to the checkout page.\n    </li>\n<li><strong>Enable Single Page Checkout:</strong>  Enable single page checkout so that the checkout page and cart page show in a single page.\n    </li>\n<li><strong>Allow redirect when adding to cart.:</strong>  After clicking add to cart button customer will be directly redirect to Checkout page.\n    </li>\n<li><strong>Turn off the &#8220;Keep Shopping&#8221; button.:</strong>  WooCommerce shows a continue shopping button after a product is added to cart, with this option you can disable that link so users remain on the checkout page.\n    </li>\n<li><strong>Quickly add item to shopping cart with Ajax. (Pro):</strong>  Turn ON and access Quickly add item to shopping cart with Ajax..\n    </li>\n<li><strong>Alter the &#8220;Add to Cart&#8221; button text.:</strong>  Change the button text of add to cart button. This feature will Add to cart button text, select options button text, Read more button text.\n    </li>\n<li><strong>Buy Now Button on Product Page:</strong>  Turn on if you want the buy now button on the product page.\n    </li>\n<li><strong>Buy Now Button Label on Product Page (Pro):</strong>  Set buy now button label (on product page).\n    </li>\n<li><strong>Redirect to Page on Product Page (Pro):</strong>   Redirect page to that button that you want to.\n    </li>\n<li><strong>Position Of the Button on Product Page (Pro):</strong>  Set the position of the button.\n    </li>\n<li><strong>Buy Now Button Width on Product Page:</strong>  Set Buy now button width on product page (PX).\n    </li>\n<li><strong>Buy Now Button Margin Top on Product Page:</strong>  Set buy now button margin top (PX).\n    </li>\n<li><strong>Buy Now Button Margin Bottom on Product Page:</strong>  Set Buy now button margin bottom (PX).\n    </li>\n<li><strong>Buy Now Button Margin Left on Product Page:</strong>  Set Buy now button margin left (PX).\n    </li>\n<li><strong>Buy Now Button Margin Right on Product Page:</strong>  Set Buy now button margin right (PX).\n    </li>\n<li><strong>Buy Now Button on Product Archive Page:</strong>  Enable the feature if you want the buy now button on the product archive page.\n    </li>\n<li><strong>Buy Now Button Label on Product Archive Page (Pro):</strong>  Insert Buy now button label\n    </li>\n<li><strong>Redirect to Page on Product Archive Page (Pro):</strong>  Select the page that you want to redirect after clicking on this button.\n    </li>\n<li><strong>Position of the Button on Product Archive Page (Pro):</strong>  Fix the position of the button on the product archive page.\n    </li>\n<li><strong>Buy Now Button Width on Product Archive Page:</strong>  Set Buy now button width on product archive page (PX)\n    </li>\n<li><strong>Buy Now Button Margin Top on Product Archive Page:</strong>  Set Buy now button margin top (PX)\n    </li>\n<li><strong>Buy Now Button Margin Bottom on Product Archive Page:</strong>  Set Buy now button margin bottom (PX)\n    </li>\n<li><strong>Buy Now Button Margin Left on Product Archive Page:</strong>  Set Buy now button margin left (PX)\n    </li>\n<li><strong>Buy Now Button Margin Right on Product Archive Page:</strong>  Set Buy now button margin right (PX)\n    </li>\n<li><strong>Buy Now Button’s Font Color:</strong>  You can pick any if your desired font color for the Buy Now button.\n    </li>\n<li><strong>Buy Now Button’sBackground Color:</strong>  Select button’s background color\n    </li>\n<li><strong>Buy Now Button’s Hover Font Color (Pro):</strong>  Select Color for button’s hover font.\n    </li>\n<li><strong>Buy Now Button’s Hover Background Color (Pro):</strong>  Set button hover background color\n    </li>\n<li><strong>Buy Now Button’s Padding Top-Bottom (Pro):</strong>  Fix Buy now button padding top &amp; bottom (PX)\n    </li>\n<li><strong>Buy Now Button’s Padding Left-Right (Pro):</strong>  Set Buy now button padding left &amp; right (PX)\n    </li>\n<li><strong>Buy Now Button’s Border Radius (Pro):</strong>  Set Buy now button border radius (PX) according to your need.\n    </li>\n<li><strong>Remove the Order Comment :</strong>  Enable if you want to remove ‘Order Comment’.\n    </li>\n<li><strong>Remove Coupon Form:</strong>  With this feature you can remove coupon form from one page checkout.\n    </li>\n<li><strong>Remove Policy Text (Pro):</strong>  You are also allowed to remove the policy text portion from the checkout page.\n    </li>\n<li><strong>Remove Terms &amp; Condition:</strong>  Terms &amp; Conditions can also be removed from the one page checkout if needed.\n    </li>\n<li><strong>Remove Billing Fields (Pro):</strong>  Want to remove some billing fields? This feature will provide you the chance to pick some fields that you want to remove from the page.\n    </li>\n<li><strong>Remove Shipping Fields (Pro):</strong>  Choose which information you want to delete from the &#8216;Shipping Section.&#8217;.</li>\n</ol>\n<h3>PDF Invoice and Packing Slips</h3>\n<ol>\n<li><strong>Deactivate Invoice:</strong> Allows you to deactivate invoice.</li>\n<li><strong>Deactivate Shipping Label:</strong> With this feature you can also disable the Shipping Label.</li>\n<li><strong>Shop Info:</strong> The shop name, address, logo, Tax ID, Footer Info can be totally editable. This Shop details will be attached in Shipping form, invoice and other documents.</li>\n<li><strong>Shop Address(Sender Details):</strong> Sender details like Sender Address,City, Postal Code, Country/State, Contact Number are edited using this feature.\n</li>\n<li><strong>View the PDF:</strong> You can decide whether you want to open the pdf in a new window or download it directly. </li>\n<li><strong>Show Tax:</strong> You can show the Tax in the invoice or slips.</li>\n<li><strong>Invoice Turn off:</strong> Allows to select Order statuses which an invoice should not be generated.</li>\n<li><strong>Invoice Attach to:</strong> Select the terms for that you want to attach the invoice.</li>\n<li><strong>Invoice Number Format (Pro):</strong> </li>\n<li><strong></strong> This feature provides you the flexibility to choose the number format for invoice number.</li>\n<li><strong>Order Number as Invoice Number:</strong> Enable the feature if you want to arrange in a particular order by providing a start number for generating the invoice number.</li>\n<li><strong>Invoice Prefix (Pro):</strong>  Select the invoice number prefix.</li>\n<li><strong>Invoice Surfex (Pro): </strong> Select the surfex of the invoice number.</li>\n<li><strong>Customize Invoice:</strong>  Document Title, Shop Logo, Invoice Number, Order Number, Invoice Date, Order Date, From Address, Billing Address, Shipping Address, Email, Phone Number, Payment, Received Stamp, Payment Method, Customer Note, Footer are customizable to create a proper invoice layout.</li>\n<li><strong>Label Tailoring:</strong> Shop Logo, From Address, To Address, Order Number, Weight, Ship, Date, Email, Phone Number are adjustable with this feature to create a perfect layout for shipping labels.</li>\n</ol>\n<h3>Product Sticky Bar</h3>\n<ol>\n<li><strong>Enable Sticky Bar:</strong> Enabling this feature a product sticky bar will always stick around the product description page for customers convenience.</li>\n<li><strong>Show on Desktop:</strong> Turn ON the feature if you show a sticky bar only for desktop users. </li>\n<li><strong>Show on Mobile:</strong> Turn ON the feature if you show a sticky bar only for mobile users.</li>\n<li><strong>Sticky Bar Position:</strong> Select Top or bottom to show the sticky bar</li>\n<li><strong>Show Only After Scroll:</strong> Show sticky bar when user scrolls down in product page.</li>\n<li><strong>Scroll Pixels:</strong>Show Bar after user scroll given pixels on the product page, Only work when the &#8220;Scroll Pixels&#8221; option is enabled.</li>\n<li><strong>Show Product Review:</strong>Allows you to show product review on sticky bar.</li>\n<li><strong>Show Product Review Count:</strong> Allows you to show product reviews on sticky bar.</li>\n<li><strong>Turn off (Pro):</strong> Select the products that you do not want to show the sticky bar.</li>\n<li><strong>Enable Update Product Qty:</strong> Allows to show update product quantity on sticky bar.</li>\n<li><strong>Show Product Image:</strong>Enable the feature if you want show product image on sticky bar.</li>\n<li><strong>Show Stock Status:</strong>Using this feature show stock quantity on sticky bar.</li>\n<li><strong>Hide Sticky Bar( Product Out of Stock ):</strong> Enable it if you do not show sticky bar when product out of stock.</li>\n<li><strong>Sticky Bar&#8217;s Height:</strong> Set sticky bar height in pixel(Ex.150) &#8211; Default 100px.</li>\n<li><strong>Product Image Shape:</strong>Select Product image shape between round and square.</li>\n<li><strong>Product Title Color  (Pro):</strong>Select Color for product title.</li>\n<li><strong>Product Rating Color  (Pro):</strong>Allows you to pick any color for Product Rating.</li>\n<li><strong>Product Rating Count Color (Pro):</strong> Allows you to pick any color for Product Rating Count.</li>\n<li><strong>Product Price Color (Pro):</strong> You can select Product price color as you want.</li>\n<li><strong>Button Font Size:</strong>Set sticky bar product price font size(Ex. 16).</li>\n<li><strong>Button Background Color  (Pro):</strong> Select Color for button background.</li>\n<li><strong>Button Font Color (Pro):</strong>Select button font Color.</li>\n<li><strong>Button Font Size:</strong>Set sticky bar add to cart button font size.</li>\n<li><strong>Button Border Color  (Pro):</strong> Select Color for button border color.</li>\n<li><strong>Button Border Width:</strong>Set sticky bar add to cart button border width.</li>\n<li><strong>Button Background Hover Color  (Pro):</strong>Select button background hover Color.</li>\n<li><strong>Button Border Hover Color  (Pro):</strong>Select button border hover Color.</li>\n<li><strong>Button Hover Font Color  (Pro):</strong>Select button hover font Color.</li>\n<li><strong>Button Padding Left-Right  (Pro):</strong> Set sticky bar add to cart button left-right padding.</li>\n<li><strong>Button Padding Top-Bottom  (Pro):</strong>Set sticky bar add to cart button top-bottom padding.</li>\n</ol>\n<h3>URL Coupon</h3>\n<ol>\n<li><strong>Per Page View:</strong> Select the amount of coupons that you want to show on each page.</li>\n<li><strong>Show Coupon Type (Pro):</strong> Choose your required coupon type for URL coupon. </li>\n<li><strong>Active Coupon URL: </strong> Enable coupon URL functionality for this coupon by activating the feature. </li>\n<li><strong>Force Apply:</strong> Apply the feature of Force Appy and it will remove all other coupons and only apply the current coupon on cart items. </li>\n<li><strong>Coupon URL:</strong> Using this feature you can copy the url of a coupon. </li>\n<li><strong>Override URL Code:</strong> You can easily override a coupon’s url as you need. The changes you have made will show in the field of Coupon URL. </li>\n<li><strong>Redirect To URL:</strong> Using this feature you can redirect a page with the coupon url. That means on a customer click the coupon url will redirect to the page. </li>\n<li><strong>Success Message:</strong> Leave a success message on applying the URL Coupon. </li>\n</ol>\n<h3>Free Shipping Bar</h3>\n<ol>\n<li><strong>Enable Shipping Bar:</strong> Allows to enable the Shipping bar.</li>\n<li><strong>Display in Desktop:</strong> This feature is to enable the shipping bar only for desktop screens. </li>\n<li><strong>Display in Mobile:</strong> When enabling this feature the Shipping bar will be displayed in mobile screens. </li>\n<li><strong>Select Shipping Zone:</strong> Allows you to select a shipping zone. </li>\n<li><strong>Detect IP:</strong>The person that accesses your website will automatically apply to the free Shipping Zone using their IP if you enable Detect IP. </li>\n<li><strong>Exclude Pages:</strong> Provide the scope to exclude the pages where you do&#8217;t want to show the Free Shipping Bar. </li>\n<li><strong>Leave out items. (Pro):</strong> Accessing this feature you can exclude particular pages for which you don’t want to show the free Shipping Bar. </li>\n<li><strong>Cart Total:</strong> Enable the feature to show the free shipping notification in the cart page subtotal area. </li>\n<li><strong>Choose spot on cart page.:</strong> Allows to select position of the free shipping notification in the cart page. </li>\n<li><strong>Display in Total Cost Area:</strong> It permits to show the free shipping notification in the checkout subtotal area. </li>\n<li><strong>Inside Progress Bar Text:</strong> Accessing this feature you can enter the text of cart &amp; checkout page free shipping progress bar. </li>\n<li><strong>Progress Bar&#8217;s Background (Pro):</strong> Customize the color of Free Shipping Bar&#8217;s which is shown in cart &amp; checkout page. </li>\n<li><strong>System Announce:</strong> Using the feature you have to provide a message about minimum order amount for free shipping. </li>\n<li><strong>Purchased Message (Pro):</strong> After purchasing products this feature will show your customers a purchase message according to a customer’s cart total, minimum order and missing amount. </li>\n<li><strong>Success Message:</strong> Allows  to Write a success message and use the shortcode {checkout_page} to redirect the checkout page. </li>\n<li><strong>Initial Delay Time (Pro):</strong> Add an initial delay time in millisecond. The Free Shipping Bar will appear according to your setting time. </li>\n<li><strong>Allow Disappear Time (Pro):</strong>The feature allows time to disappear the shipping bar.</li>\n<li><strong>Set Disappear Time (Pro):</strong> When you allow disappear time, you need to  Set initial delay time to disappear the Free Shipping Bar. </li>\n<li><strong>Shipping Bar Position:</strong> This feature lets you select a position between top and bottom of the free shipping bar. </li>\n<li><strong>Progress Bar Layout (Pro):</strong> The feature provides three different layouts. You have to select a layout according to your choice. </li>\n<li><strong>Background Color (Pro):</strong> Accessing the feature you flexibly pick a color for the background of the shipping bar according to your requirements that can match with your site’s overall color. </li>\n<li><strong>Inner Bar Background Color (Pro):</strong> Set your free shipping bar inner background color. </li>\n<li><strong>Text Color (Pro):</strong> With this feature you can pick any color for the shipping bar’s text color. </li>\n<li><strong>Link Color:</strong> Set your free shipping bar link color. </li>\n<li><strong>Font Size:</strong> Font size can be modified with Font Size. </li>\n<li><strong>Text Align:</strong> Set your free shipping bar text align among left, cent and right accessing this feature. </li>\n<li><strong>Shipping Bar Close Icon:</strong> Some close icons are available here. Select your  required one for the free shipping bar close icon. </li>\n<li><strong>Close Icon Color (Pro):</strong> Set your free shipping bar close icon color using the feature. </li>\n<li><strong>Close Icon Size:</strong> You can set here free shipping bar close icon size. </li>\n<li><strong>Enable Progress Bar:</strong> Show progress bar with free shipping bar. </li>\n<li><strong>Progress Bar Background (Pro):</strong> Allows to set your progress bar background color. </li>\n<li><strong>Current Progress Background (Pro):</strong> Set your free shipping bar current progress background color. </li>\n<li><strong>Progress Text Color (Pro):</strong> Free shipping bar progress text color is 100% customizable. </li>\n<li><strong>Progress Bar Font Size:</strong> Set your free shipping bar progress font size using the feature. </li>\n<li><strong>Current Progress Background (Pro):</strong> Set your free shipping bar current progress background color. </li>\n<li><strong>Current Progress Background (Pro):</strong> Set your free shipping bar current progress background color. </li>\n<li><strong>Current Progress Background (Pro):</strong> Set your free shipping bar current progress background color. </li>\n<li><strong>Current Progress Background (Pro):</strong> Set your free shipping bar current progress background color. </li>\n</ol>\n<h3>Address Book</h3>\n<ol>\n<li><strong>My Account Billing Address Book:</strong> Allows to enable address book for billing on customers account page.</li>\n<li><strong>My Account Shipping Address Book:</strong> Allows to enable address book for shipping on customers account page.</li>\n<li><strong>Enable Billing Address on Checkout:</strong> Allows to enable address field selection for billing on checkout page.</li>\n<li><strong>Enable Shipping Address on Checkout:</strong> Allows to enable address field selection for shipping on checkout page.</li>\n<li><strong>Address Field Label:</strong> Allows to Change the label text for the address field on the checkout page.</li>\n<li><strong>Menu Title:</strong> Allows to set the account page menu title for Address Book.</li>\n<li><strong>Billing Address Book Headline:</strong> Allows to set the headline text of billing address book.</li>\n<li><strong>Shipping Address Book Headline:</strong> Allows to set the headline text of shipping address book.</li>\n<li><strong>Add Billing Address Button Text (Pro):</strong> Allows to set the button text of add new billing address.</li>\n<li><strong>Add Shipping Address Button Text (Pro):</strong> Allows to set the button text of add new shipping address.</li>\n<li><strong>Billing Address Book Empty Message (Pro):</strong> Allows to set the empty message text of billing address book.</li>\n<li><strong>Shipping Address Book Empty Message (Pro):</strong> Allows to set the empty message text of shipping address book.</li>\n<li><strong>Address Edit Link Text (Pro):</strong> Allows to set the address edit link text.</li>\n<li><strong>Address Delete Link Text (Pro):</strong> Allows to set the address delete link text.</li>\n<li><strong>Address Make Primary Link Text (Pro):</strong> Allows to set the address make primary link text.</li>\n<li><strong>Add Button Background Color (Pro):</strong> Allows to set the add new button background color.</li>\n<li><strong>Add Button Text Color (Pro):</strong> Allows to set the add new button text color.</li>\n<li><strong>Address Card Background Color (Pro):</strong> Allows to set the background color of address card.</li>\n<li><strong>Address Text Color (Pro):</strong> Allows to set the text color of address inside address card.</li>\n<li><strong>Card Bottom Color (Pro):</strong> Allows to set the footer background color of address card.</li>\n</ol>\n<h3>Product Filter</h3>\n<ol>\n<li><strong>Show Search Filter:</strong> Allows to show search filter in sidebar.</li>\n<li><strong>Show Price Filter:</strong> Allows to show price filter in sidebar.</li>\n<li><strong>Show Rating Filter:</strong> Allows to show rating filter in sidebar.</li>\n<li><strong>Show Category Filter:</strong> Allows to show category filter in sidebar.</li>\n<li><strong>Show Stock Status Filter:</strong> Allows to show stock status filter in sidebar.</li>\n<li><strong>Filter Sidebar Position:</strong> Allows to show the filtering in left or right side of products grid.</li>\n<li><strong>Max Product Per Page:</strong> Allows to set maximum number of products can be showed in a page.</li>\n<li><strong>&#8220;Add to Cart&#8221; Button Text:</strong> Allows to customize &#8220;Add to Cart&#8221; Button Text.</li>\n<li><strong>Action Button Background Color (Pro):</strong> Allows to set background color of Add to Cart button.</li>\n<li><strong>Action Button Font Color (Pro):</strong> Allows to set font color of Add to Cart button.</li>\n<li><strong>Product Loader Color (Pro):</strong> Allows to set the color of product loader animation.</li>\n<li><strong>Search Filter Label Text:</strong> Allows to set the Search Filter Label text.</li>\n<li><strong>Search Filter Placeholder Text:</strong> Allows to set the Search Field input placeholder text.</li>\n<li><strong>Search Filter Input Field Border Color (Pro):</strong> Allows to set border color of input field of the search filter.</li>\n<li><strong>Search Filter Input Field Background Color (Pro):</strong> Allows to set background color of input field of the search filter.</li>\n<li><strong>Search Filter Input Field Text Color (Pro):</strong> Allows to set text color of input field of the search filter.</li>\n<li><strong>Price Filter Label Text:</strong> Allows to set the Price Filter Label text.</li>\n<li><strong>Price Filter Input Field Border Color (Pro):</strong> Allows to set border color of input field of the Price filter.</li>\n<li><strong>Price Filter Input Field Background Color (Pro):</strong> Allows to set background color of input field of the Price filter.</li>\n<li><strong>Price Filter Input Field Text Color (Pro):</strong> Allows to set text color of input field of the Price filter.</li>\n<li><strong>Rating Filter Label Text:</strong> Allows to set the Rating Filter Label text.</li>\n<li><strong>Rating Filter Show 5 to 0 Star Rating:</strong> Allows to show the 5 to 0 star rating filter respectively.</li>\n<li><strong>Category Filter Label Text:</strong> Allows to set the Category Filter Label text.</li>\n<li><strong>Category Filter Checkbox Design (Pro):</strong> Allows to customize the checkbox design of category.</li>\n</ol>\n<h3>Get Started with wcEazy</h3>\n<p>When you are working on your WooCommerce store and want to make it full of functions and flexibilities then WordPress plugin wcEazy can be the great solution for you. You will get all kinds of support from one plugin. So, hurry up and grab the most wonderful and workable plugin that is highly recommended for you.\n</p>\n<p>Replace all of your complex and time consuming WooCommerce plugins with a single plugin that does everything they do and more!</p>\n<h3>Privacy Policy</h3>\n<p>wcEazy I Supercharge your WooCommerce Store uses <a href=\"https://appsero.com\" rel=\"nofollow ugc\">Appsero</a> SDK to collect some telemetry data upon user&#8217;s confirmation. This helps us to troubleshoot problems faster &amp; make product improvements.</p>\n<p>Appsero SDK <strong>does not gather any data by default.</strong> The SDK only starts gathering basic telemetry data <strong>when a user allows it via the admin notice</strong>. We collect the data to ensure a great user experience for all our users.</p>\n<p>Integrating Appsero SDK <strong>DOES NOT IMMEDIATELY</strong> start gathering data, <strong>without confirmation from users in any case.</strong></p>\n<p>Learn more about how <a href=\"https://appsero.com/privacy-policy/\" rel=\"nofollow ugc\">Appsero collects and uses this data</a>.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wceazy.1.1.6.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/wceazy/assets/screenshot-1.png?rev=2745709",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wceazy/assets/screenshot-2.png?rev=2745709",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wceazy/assets/screenshot-3.png?rev=2745709",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wceazy/assets/screenshot-4.png?rev=2745709",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wceazy/assets/screenshot-5.png?rev=2745709",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wceazy/assets/screenshot-6.png?rev=2745709",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wceazy/assets/screenshot-7.png?rev=2745709",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wceazy/assets/screenshot-8.png?rev=2745709",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wceazy/assets/screenshot-9.png?rev=2745709",
            "caption": ""
        }
    ],
    "tags": {
        "bogo-deal": "bogo deal",
        "bulk-coupon-generator": "bulk coupon generator",
        "floating-cart": "floating cart",
        "url-coupon": "url coupon",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "1.1.6",
    "versions": {
        "1.0.1": "https://downloads.wordpress.org/plugin/wceazy.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/wceazy.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/wceazy.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/wceazy.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/wceazy.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/wceazy.1.0.6.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/wceazy.1.0.7.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/wceazy.1.0.8.zip",
        "1.0.9": "https://downloads.wordpress.org/plugin/wceazy.1.0.9.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/wceazy.1.1.0.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/wceazy.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/wceazy.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/wceazy.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/wceazy.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/wceazy.1.1.6.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wceazy.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://wceazy.com",
    "banners": {
        "low": "https://ps.w.org/wceazy/assets/banner-772x250.png?rev=3006735",
        "high": "https://ps.w.org/wceazy/assets/banner-1544x500.png?rev=3006735"
    },
    "icons": {
        "1x": "https://ps.w.org/wceazy/assets/icon-128x128.png?rev=2745709",
        "2x": "https://ps.w.org/wceazy/assets/icon-256x256.png?rev=2745709"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}