{
    "name": "weForms &#8211; Easy Drag &amp; Drop Contact Form Builder For WordPress",
    "slug": "weforms",
    "version": "1.6.25",
    "author": "<a href=\"https://weformspro.com/\">weForms</a>",
    "author_profile": "https://profiles.wordpress.org/boldgrid/",
    "contributors": {
        "tareq1988": {
            "profile": "https://profiles.wordpress.org/tareq1988/",
            "avatar": "https://secure.gravatar.com/avatar/8584491809f902b86fae495a5830be83?s=96&d=monsterid&r=g",
            "display_name": "Tareq Hasan"
        },
        "nizamuddinbabu": {
            "profile": "https://profiles.wordpress.org/nizamuddinbabu/",
            "avatar": "https://secure.gravatar.com/avatar/b6018868e8b1f67c865e71ea212b9f96?s=96&d=monsterid&r=g",
            "display_name": "Nizam Uddin"
        },
        "boldgrid": {
            "profile": "https://profiles.wordpress.org/boldgrid/",
            "avatar": "https://secure.gravatar.com/avatar/a72e18767febdc7280e2e20712319ded?s=96&d=monsterid&r=g",
            "display_name": "BoldGrid"
        },
        "joemoto": {
            "profile": "https://profiles.wordpress.org/joemoto/",
            "avatar": "https://secure.gravatar.com/avatar/11f9fe08f86f11795b0809ae004a13e1?s=96&d=monsterid&r=g",
            "display_name": "Joe Cartonia"
        },
        "jamesros161": {
            "profile": "https://profiles.wordpress.org/jamesros161/",
            "avatar": "https://secure.gravatar.com/avatar/062136d92116ab00fc7a9e0f976e872c?s=96&d=monsterid&r=g",
            "display_name": "James Rosado"
        },
        "avonville1": {
            "profile": "https://profiles.wordpress.org/avonville1/",
            "avatar": "https://secure.gravatar.com/avatar/a5021de50ac35233033fa34b58834074?s=96&d=monsterid&r=g",
            "display_name": "avonville1"
        }
    },
    "requires": "5.0",
    "tested": "6.6.1",
    "requires_php": "7.2",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 90,
    "ratings": {
        "5": 91,
        "4": 5,
        "3": 3,
        "2": 4,
        "1": 8
    },
    "num_ratings": 111,
    "support_url": "https://wordpress.org/support/plugin/weforms/",
    "support_threads": 4,
    "support_threads_resolved": 4,
    "active_installs": 20000,
    "downloaded": 755385,
    "last_updated": "2024-07-16 17:52:00",
    "added": "2017-08-01",
    "homepage": "https://weformspro.com/",
    "sections": {
        "description": "<h4>weForms- The Best Contact Form Builder plugin for WordPress</h4>\n<p>One of the most important features of a WordPress form plugin is the ability to quickly and easily create a form. That’s why we built our product to be the easiest form builder available.</p>\n<p>weForms enables you to create WordPress forms in a matter of minutes. With numerous templates and an easy to use drag and drop interface, your form can go from concept to reality instantly. Live preview functions allow you to see what your users will see with a click of a button.</p>\n<p>Beyond the functionality of building the form itself, weForms boasts more than 20 custom fields. These range from address fields to multi-select boxes. All of the fields can help you build forms to collect various types of user information for things such as a support ticket, event registration, or job application. You can also see all of your users’ submissions right inside your WordPress dashboard for added convenience.</p>\n<p>weForms is an all-in-one form builder created for every skill level of user. Its minimalistic design is not only modern but also super fast and user-friendly. Everything works on a single page. Stop wasting time trying to find a developer to build a form, knock it out yourself in a matter of minutes!</p>\n<h4>Quick Overview of weForms</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/4uYi0833Kjw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>Key Features</h4>\n<ul>\n<li><strong>Unlimited Forms:</strong> Create as many forms as you want and collect all the data you need</li>\n<li><strong>Predefined and Customizable Templates:</strong> Save time using our unique &amp; customizable form templates</li>\n<li><strong>Drag &amp; Drop Builder:</strong> Build the form of your dream with its fully featured drag &amp; drop form editing option</li>\n<li><strong>Real-time Live Preview:</strong> Instantly preview your work in real-time</li>\n<li><strong>Expiry Time:</strong> Set a form expiration date to automate your forms showing on a schedule</li>\n<li><strong>Entry Restrictions:</strong> Limit the number of entries for each individual form by setting the maximum form submission limit. Perfect for event registration!</li>\n<li><strong>One Page Submission:</strong> Form submission occurs without a page refresh using AJAX, making submissions instant</li>\n<li><strong>Field Customization Options:</strong> Customize the form fields available with tons of options to best fit your needs.</li>\n<li><strong>Form Redirection:</strong> Upon form submission easily redirect your users to any page of your choice</li>\n<li><strong>Form Submission Notification:</strong> Use our built-in email notifications to never miss a beat when your users submit a form on your website</li>\n<li><strong>Manage Form Submissions:</strong> Manage the submission of forms to collect data without the hassle of backend coding</li>\n<li><strong>Import or Export Forms:</strong> Use the quick form exporting and importing option that lets you start from where you left off or save your data offline</li>\n<li><strong>Mobile-friendly forms:</strong> weForms is mobile-friendly and responsive, making it easy for your users to submit forms via computer, mobile phone, or tablet</li>\n<li><strong>Mail support:</strong> Get complete mail support feature in the form of customize mails and HTML email template</li>\n<li><strong>Email submission data:</strong> Connect your forms to several of our integrated email services to get form submission data in emails</li>\n<li><strong>Anti-spam &amp; reCaptcha:</strong> Get rid of spam entries with reCaptcha or through our other integrated partners, like Human Presence to eliminate spam messages and registrations with WordPress forms</li>\n<li><strong>Slack Integrations:</strong> Get notified through your Slack account whenever any user submits a form using weForms</li>\n<li><strong>Column Field:</strong> Build your form the way you want by adding any field into our column field. Resize them the way you need them to create a dynamic form for your website</li>\n</ul>\n<h4>KEY ATTRIBUTES &#8211; WEFORMS STANDS OUT FROM THE CROWD!</h4>\n<h4>DRAG &amp; DROP FORM BUILDER WITH LIVE FORM PREVIEW</h4>\n<p>With weForms smooth drag and drop form builder, create any type of form you need within minutes. You aren’t required to know a single line of code to create a powerful form with the help of our intuitive drag &amp; drop form building feature. Simply drag &amp; drop the fields you want to add from the panel of the available form fields. Instantly live preview the form that you have created in the frontend.</p>\n<h4>MOBILE RESPONSIVE FORMS FOR ALL OF YOUR DEVICES</h4>\n<p>Having a responsive contact form on your WordPress is a must for a user-friendly experience. weForms ensures that your created forms are all well-responsive even on all mobile devices. This will help you increase form conversion rates and customer satisfaction.</p>\n<h4>PRE-DEFINED FORM TEMPLATES FOR QUICK ACCESS</h4>\n<p>In a lot of cases, you might not need to build a form from scratch. A simple form with some predefined fields would fit all of your needs. With weForms, you get a variety of pre-built form templates that fit a multitude of use cases, helping you to capture leads easier and faster.</p>\n<p>weForms predefined form templates include: Registration forms, Application forms, Payment forms, Reservations forms, Poll and Feedback forms, Request forms, and Event Registration forms.</p>\n<h4>ADD WEFORMS WORDPRESS CONTACT FORMS USING GUTENBERG</h4>\n<p>Easily add your forms in the WordPress editor with the weForms block. When users want to publish forms on a page, they can simply select it from the drop-down present in the dedicated weForms block for Gutenberg. The entire form automatically renders within the editor as well as on page. It’s much easier than manually copying and pasting shortcodes! This saves you a ton of time and clicks, but for those who prefer shortcodes, you can still add forms to your pages with other page builders too.</p>\n<h4>SUPER FAST, SUPERCHARGED WEBSITE FORMS</h4>\n<p>When it comes to the speed of submitting a form from the frontend or in the backend, weForms does the job faster than any other form builder. Regardless if it is sent via computer, phone, or tablet, you can rest assured it will be quick!</p>\n<h4>THE ONLY LIMITATION IS YOUR IMAGINATION</h4>\n<p>Taking a form from concept to reality is a walk in the park with weForms. Quickly design any type of form you can think of using our easy to use builder with plenty of field options &amp; a beautiful drag and drop user interface.</p>\n<p>Instantly preview the form you built and make changes right away. Improve the quality and standard of your form-building process with weForms.</p>\n<h4>CUSTOM FIELDS TO MAKE THE MOST OF YOUR CONTACT FORMS</h4>\n<p>While building a form with weForms custom field, anyone, even those without any prior coding knowledge are able to create great forms. From check-box to image upload fields, or radio button to the signature field, weForms provides you with every great form field. This also includes the column field option to make your forms look great and flow beautifully.</p>\n<h4>EXTEND &amp; CUSTOMIZE YOUR CONTACT FORMS WITHOUT A HITCH</h4>\n<p>As an advanced user, you might want your form to look or perform in a certain way. This is where the customization capabilities of weForms will come in handy. With its custom CSS, HTML blocks, and section dividers, users are able to customize their forms exactly the way they like. weForms also has heaps of filters and hooks that help developers easily extend a contact forms functionality.</p>\n<h4>EASY FORM IMPORT &amp; EXPORT FACILITY</h4>\n<p>Moving from a different form provider? Easily import your forms in a JSON format or from built-in form import tools. Looking to export out your form or the submissions? We have you covered with both form submissions exports as well as a JSON export of the form itself.</p>\n<h4>FORM ENTRY RESTRICTIONS, SCHEDULING, AND EXPIRATION TIMES</h4>\n<p>Have full control over your forms and when they can be used! Create exclusive campaigns by allowing only a limited number of entries, controlling user access, and adding a start and expiration date. Form with an expiration date will automatically disappear after the time you want.</p>\n<h4>CUSTOMIZABLE EMAIL NOTIFICATIONS FOR ADMINS</h4>\n<p>Stay alert with every submission. Create multiple custom notifications on each form with advanced mail forwarding and quickly create templates with hooks.</p>\n<h4>FORM REDIRECTION PAGE OR CUSTOM URL</h4>\n<p>When a user completes a form, you can redirect them with a custom link or to a page to guide the user through your desired workflow. It’s very useful when you want to direct the visitor’s attention to additional pages, or just creatively customize your submission received messaging.</p>\n<h4>OTHER NOTABLE WEFORMS ATTRIBUTES INCLUDE</h4>\n<ul>\n<li>ReCaptcha and Human Presence Anti-Spam integrations to ensure an extra layer of security for forms.<br />\n*The ability to sync email form data with numerous email integrations</li>\n<li>Multi-step and Multi-part Forms to break up the submission process for your users.</li>\n<li>Geolocation &amp; SMS notifications to help improve your response times and data.</li>\n<li>Much, much more.</li>\n</ul>\n<h4>DON’T JUST TAKE OUR WORD FOR IT, HERE IS WHAT SOME OF THE BIGGEST NAMES IN THE COMMUNITY HAVE TO SAY</h4>\n<blockquote>\n<p>weForms is both easy and super fast, even the completely new users can build beautiful WordPress forms without any hassle. &#8211; WP Arena</p>\n<p>The free version offers a host of useful and advanced features that are not available in many existing alternatives. &#8211; Cloudways</p>\n<p>We tried to do some experimentation with weForms and to our utter delight, it looks like we can build all types of contact forms using it! &#8211; WPBlog</p>\n</blockquote>\n<h4>MODULES &amp; INTEGRATIONS FOR WEFORMS</h4>\n<p>Email Marketing Integrations<br />\n* <a href=\"https://weformspro.com/docs/integrations/mailchimp/\" rel=\"nofollow ugc\">MailChimp:</a> This integration makes the already powerful form builder your ultimate lead generation source for one of the best email marketing tools available.<br />\n* <a href=\"https://weformspro.com/docs/integrations/aweber/\" rel=\"nofollow ugc\">AWeber:</a> Connect weForms with AWeber mail lists to reach submitters via email campaigns. Easily grow your contact base and do more with emails.<br />\n* <a href=\"https://weformspro.com/docs/integrations/constant-contact/\" rel=\"nofollow ugc\">Constant Contact:</a> Make your email marketing powerful and simple using Constant Contact integration for weForms.<br />\n* <a href=\"https://weformspro.com/docs/integrations/campaign-monitor-integration/\" rel=\"nofollow ugc\">Campaign Monitor:</a> Boost your email marketing by integrating weForms with Campaign Monitor. Quickly generate more leads by syncing your mail lists with those who post form submissions.<br />\n* <a href=\"https://weformspro.com/docs/integrations/getresponse/\" rel=\"nofollow ugc\">GetResponse:</a>Supercharge your email marketing to boost your business by integrating it with weForms.<br />\n* <a href=\"https://weformspro.com/docs/integrations/mailpoet/\" rel=\"nofollow ugc\">MailPoet:</a>  It provides you the experience of using the best WordPress Newsletter plugin with the best Form Builder weForms.<br />\n* <a href=\"https://weformspro.com/docs/integrations/convertkit/\" rel=\"nofollow ugc\">ConvertKit:</a> Quickly boost your business by generating more leads, syncing the mail lists with submissions by integrating them with weForms.</p>\n<p>Payment Integrations<br />\n* <a href=\"https://weformspro.com/docs/integrations/payment/\" rel=\"nofollow ugc\">Paypal:</a> Collect PayPal payments with your forms easily by integrating it with weForms.<br />\n* <a href=\"https://weformspro.com/docs/modules/payment-stripe/\" rel=\"nofollow ugc\">Stripe:</a> Collect credit card payments safely and quickly by integrating Stripe with your forms</p>\n<p>Productivity Tool Integrations and Modules<br />\n* <a href=\"https://weformspro.com/docs/integrations/google-analytics/\" rel=\"nofollow ugc\">Google Analytics:</a> Provides a powerful &amp; complete marketing analytics solution for businesses of all sizes using forms.<br />\n* <a href=\"https://weformspro.com/docs/integrations/zapier/\" rel=\"nofollow ugc\">Zapier:</a> The easiest and most popular automated workflow management system on the internet integrates with the fastest form builder.<br />\n* <a href=\"https://weformspro.com/docs/integrations/google-sheets/\" rel=\"nofollow ugc\">Google Sheets:</a> This integration for weForms will give you the ease of managing submitted information in the familiar Google Sheets environment.<br />\n* <a href=\"https://weformspro.com/docs/integrations/trello/\" rel=\"nofollow ugc\">Trello:</a> Instantly create task cards from your form submissions by enabling this module.<br />\n* <a href=\"https://weformspro.com/docs/modules/calculation/\" rel=\"nofollow ugc\">Calculation:</a> Enable your form to have calculation capabilities with your numeric fields<br />\n* <a href=\"https://weformspro.com/docs/integrations/pdf-form-submission/\" rel=\"nofollow ugc\">PDF Form Submission:</a> Enable this module to get a better printable PDF version of all your collected submission forms.<br />\n* <a href=\"https://weformspro.com/docs/integrations/quiz/\" rel=\"nofollow ugc\">Quiz:</a> Create simple yet engaging quiz forms and keep your audiences hooked getting a lot of shares by enabling this module.<br />\n* <a href=\"https://weformspro.com/docs/integrations/slack/\" rel=\"nofollow ugc\">Slack:</a> Notify your team instantly in Slack when someone submits an entry to your forms created with weForms enabling this free integration.<br />\n* <a href=\"https://weformspro.com/docs/integrations/sms-notification/\" rel=\"nofollow ugc\">SMS Notification:</a> Enable the module to get a notification through SMS every time a form submission occurs.<br />\n* <a href=\"https://weformspro.com/docs/form-field-types/file-upload/\" rel=\"nofollow ugc\">File Upload:</a> Allow users to attach files of whatever type you specify to streamline application processes, add images and more.</p>\n<p>CRM Integrations<br />\n* <a href=\"https://weformspro.com/docs/integrations/salesforce/\" rel=\"nofollow ugc\">Salesforce:</a> Integrate with weForms to instantly enhance your user list building more customers and more interactions.<br />\n* <a href=\"https://weformspro.com/docs/integrations/wp-erp/\" rel=\"nofollow ugc\">WP ERP:</a> Integrate your forms with WordPress CRM contact lists &amp; instantly get tons of new leads who you can convert as subscribers or customers.<br />\n* <a href=\"https://weformspro.com/docs/integrations/hubspot-integration/\" rel=\"nofollow ugc\">HubSpot:</a> Get more opportunities to make deals at your fingertips by integrating HubSpot with weForms and instantly enhance your contact list.<br />\n* <a href=\"https://weformspro.com/docs/integrations/zoho/\" rel=\"nofollow ugc\">Zoho:</a> Enabling it gets you better sales-qualified lead generation. Simply connect it once, pass data instantly &amp; start tracing form subscribers from your CRM as they move through the sales funnel.</p>\n<h4>WEFORMS PRO FEATURES ARE AWESOME!</h4>\n<p>Need more features? Then you might want to upgrade to one of our weForms Pro versions. This amazing contact form builder for WordPress has 4 convenient and affordable plans to strengthen your form building and lead capture functionalities.</p>\n<h4>THE FOUR PRO PLANS:</h4>\n<ul>\n<li><a href=\"https://weformspro.com/pricing/\" rel=\"nofollow ugc\">Personal</a></li>\n<li><a href=\"https://weformspro.com/pricing/\" rel=\"nofollow ugc\">Business</a></li>\n<li><a href=\"https://weformspro.com/pricing/\" rel=\"nofollow ugc\">Professional</a></li>\n<li><a href=\"https://weformspro.com/pricing/\" rel=\"nofollow ugc\">Developer</a></li>\n</ul>\n<h4>These tailored plans consists of some highly essential &amp; cutting-edge PRO features and integrations that include:</h4>\n<ul>\n<li>Advanced fields</li>\n<li>Conditional logic</li>\n<li>Multistep form</li>\n<li>Webhooks</li>\n<li>Country List Field</li>\n<li>File uploader</li>\n<li>PDF form submissions</li>\n<li>Geolocation tracking</li>\n<li>SMS notification</li>\n<li><strong>Email Marketing Integrations</strong>\n<ul>\n<li>MailChimp</li>\n<li>MailPoet</li>\n<li>AWeber</li>\n<li>Constant Contact</li>\n<li>Campaign Monitor</li>\n<li>Get Response</li>\n<li>Convert Kit</li>\n</ul>\n</li>\n<li><strong>Productivity Tool Integration</strong>\n<ul>\n<li>Google Analytics</li>\n<li>Zapier</li>\n<li>Trello</li>\n</ul>\n</li>\n<li><strong>Payment Integration</strong>\n<ul>\n<li>Paypal</li>\n<li>Stripe</li>\n</ul>\n</li>\n<li><strong>CRM Integration</strong>\n<ul>\n<li>Salesforce</li>\n<li>Zoho</li>\n<li>Hubspot</li>\n</ul>\n</li>\n</ul>\n<p>Learn more about our <a href=\"https://weformspro.com/pricing/\" rel=\"nofollow ugc\">weForms Pro Features</a> now!</p>\n",
        "installation": "<p>This section describes how to install the plugin and get it working.</p>\n<p>e.g.</p>\n<ol>\n<li>Upload the plugin files to the <code>/wp-content/plugins/weforms</code> directory, or install the plugin through the WordPress plugins screen directly.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; screen in WordPress</li>\n<li>Use the <code>weForms</code> -&gt; <code>Settings</code> screen to configure the plugin</li>\n<li>(Make your instructions match the desired user flow for activating and installing your plugin. Include any steps that might be needed for explanatory purposes)</li>\n</ol>\n",
        "faq": "\n<dt id='can%20i%20translate%20weforms'>\nCan I Translate weForms\n</h4>\n<p>\n<p>Yes, you can customize the plugins language using poedit with the provided pot file.</p>\n</p>\n<dt id='is%20weforms%20responsive%3F'>\nIs weForms Responsive?\n</h4>\n<p>\n<p>Contact form created by weForms is mobile responsive and looks beautiful in any device.</p>\n</p>\n<dt id='are%20my%20forms%20protected%20from%20spam%3F'>\nAre my forms protected from spam?\n</h4>\n<p>\n<p>We have built-in integration with reCaptcha. So your forms are protected from the evil bots.</p>\n</p>\n<dt id='can%20i%20set%20notifications%20on%20each%20form%20submission%3F'>\nCan I set notifications on each form submission?\n</h4>\n<p>\n<p>You can set as many email notifications as possible with weForms.</p>\n</p>\n<dt id='i%20am%20not%20technical%2C%20can%20i%20use%20weforms%3F'>\nI am not technical, can I use weForms?\n</h4>\n<p>\n<p>weForms is the most beginner friendly and fastest WordPress contact form plugin available and getting started is so easy!</p>\n</p>\n\n",
        "changelog": "<h4>Version 1.6.25 ( 15 July, 2024 )</h4>\n<ul>\n<li>Update: Removed Polyfill.io from the plugin.</li>\n</ul>\n<h4>Version 1.6.24 ( 05 July, 2024 )</h4>\n<ul>\n<li>Fix: Updates remote url for pollyfill.io to secured CloudFlare URL.</li>\n</ul>\n<h4>Version 1.6.23 ( 19 March, 2024 )</h4>\n<ul>\n<li>Fix: Adds wpdb-&gt;prepare to fix SQL injection vulnerabilities.</li>\n</ul>\n<h4>Version 1.6.22 ( 07 March, 2024 )</h4>\n<ul>\n<li>Fix: Fixes sanitization of referrer for entries and notifications.</li>\n</ul>\n<h4>Version 1.6.21 ( 01 February, 2024 )</h4>\n<ul>\n<li>Fix: Fixes access control issue with login required form submissions.</li>\n</ul>\n<h4>Version 1.6.20 ( 12 December, 2023 )</h4>\n<ul>\n<li>Fix: Fixes invalid nonce message when exporting entries from entry table.</li>\n</ul>\n<h4>Version 1.6.19 ( 08 November, 2023 )</h4>\n<ul>\n<li>Fix: Fixes Role and Nonce verification for entry exporting.</li>\n</ul>\n<h4>Version 1.6.18 ( 19 September, 2023 )</h4>\n<ul>\n<li>Fix: Fixes security issue with possible XSS in form builder settings.</li>\n<li>Fix: Fixes deprecation notice for abstract fields.</li>\n<li>Update: Bump ua-parser-js from 1.0.2 to 1.0.33.</li>\n<li>Update: Bump browser-sync from 2.27.11 to 2.28.1.</li>\n<li>Update: Bump browser-sync-ui from 2.1.1 to 2.1.2.</li>\n<li>Update: Bump socket.io-parser from 4.2.2 to 4.2.3.</li>\n</ul>\n<h4>Version 1.6.17 ( 28 February, 2023 )</h4>\n<ul>\n<li><strong>Fix:</strong> Array Key &#8220;name&#8221; doesnt exist for custom html field.</li>\n<li><strong>Fix:</strong> Fixes contrast for form white text error messages.</li>\n<li><strong>Fix:</strong> New lines being removed in textarea field.</li>\n</ul>\n<h4>Version 1.6.16 ( 12 December, 2022 )</h4>\n<ul>\n<li><strong>Fix:</strong> Empty field entries ending form entries view script.</li>\n<li><strong>Fix:</strong> Missing html tag on textarea field.</li>\n</ul>\n<h4>Version 1.6.15 (20 October, 2022)</h4>\n<ul>\n<li><strong>Added:</strong> Validation for entry fields on submit.</li>\n<li><strong>Fix:</strong> New lines being stripped in text area entries.</li>\n<li><strong>Fix:</strong> wptexturize running even when disabled.</li>\n<li><strong>Fix:</strong> Refreshing submitted form creating multiple entries.</li>\n<li><strong>Fix:</strong> Fields Section disappearing at certain Zoom levels.</li>\n</ul>\n<h4>Version 1.6.14 (29 June, 2022)</h4>\n<ul>\n<li><strong>Update:</strong> Bumped grunt version to 1.5.3.</li>\n<li><strong>Update:</strong> Bumped simple-get version to 3.1.1.</li>\n<li><strong>Update:</strong> Bumped minimist version to 1.2.6.</li>\n<li><strong>Update:</strong> Bumped follow-redirects version to 1.14.8.</li>\n<li><strong>Update:</strong> Updated default submit button text.</li>\n<li><strong>Update:</strong> Updated fields compatbility with Crio Theme for &#8220;use theme CSS&#8221;.</li>\n<li><strong>Fix:</strong> Fixed CSS compatbility issues with &#8220;use theme CSS&#8221; feature.</li>\n</ul>\n<h4>Version 1.6.13 (02 March, 2022)</h4>\n<ul>\n<li><strong>Fix:</strong> Fixes placeholders being blank on the frontend.</li>\n<li><strong>Fix:</strong> Fixes issue setting multiple field tag in notification body.</li>\n<li><strong>Fix:</strong> Fixes and adds logic for support url in help section.</li>\n</ul>\n<h4>Version 1.6.12 (26 January, 2022)</h4>\n<ul>\n<li><strong>Fix:</strong> Fixes form previews when using block based themes.</li>\n</ul>\n<h4>Version 1.6.11 (05 January, 2022)</h4>\n<ul>\n<li><strong>Fix:</strong> Fixes fatal error in translator.</li>\n</ul>\n<h4>Version 1.6.10 (05 January, 2022)</h4>\n<ul>\n<li><strong>Update:</strong> Axios from 0.21.1 to 0.21.2.</li>\n<li><strong>Update:</strong> Set-value from 3.0.2 to 4.0.1.</li>\n<li><strong>Update:</strong> Added data-sytle to all fields.</li>\n<li><strong>Fix:</strong> Enforce date format from datepicker.</li>\n<li><strong>Fix:</strong> Changed entry after submission to form setting from global setting.</li>\n<li><strong>Fix:</strong> Removed id from entry table view.</li>\n<li><strong>Fix:</strong> Entry details show option and value selected.</li>\n<li><strong>Improvement:</strong> Address fields in notifications now accepts value: tags for selection fields</li>\n</ul>\n<h4>Version 1.6.9 (15 September, 2021)</h4>\n<ul>\n<li><strong>Fix:</strong> PHP 8.0 Emogrifier updates</li>\n<li><strong>Fix:</strong> Transaction page link updated to weforms site</li>\n<li><strong>Fix:</strong> Entry Field Names update on form save when changed</li>\n<li><strong>Fix:</strong> Using Vue.js minified file for production</li>\n<li><strong>Fix:</strong> Google Maps integration provides address in notification</li>\n<li><strong>Update:</strong> Field Authentication updates</li>\n<li><strong>Update:</strong> Dependancy updates</li>\n<li><strong>Impovement:</strong> Sprout Invoices integration multiple line items and payment options</li>\n</ul>\n<h4>Version 1.6.8 (10 June, 2021)</h4>\n<ul>\n<li><strong>Fix:</strong> weSerialize not extended</li>\n</ul>\n<h4>Version 1.6.7 (26 April, 2021)</h4>\n<ul>\n<li><strong>Fix:</strong> PHP 8.0 form submission issues fixes and removal of admin notice callback</li>\n<li><strong>Fix:</strong> Transaction table id matching entry id and addition of entry after submission fixes</li>\n<li><strong>Fix:</strong> Added weSerialize wapper for backward compatbility with weSerialize</li>\n<li><strong>Fix:</strong> Admin notice form import fixes</li>\n</ul>\n<h4>Version 1.6.6 (13 April, 2021)</h4>\n<ul>\n<li><strong>Fix:</strong> Front End report link fixes</li>\n<li><strong>Fix:</strong> Signature Displays in Entries</li>\n<li><strong>Update:</strong> jQuery updates for Columns</li>\n</ul>\n<h4>Version 1.6.5 (18 February, 2021)</h4>\n<ul>\n<li><strong>Fix:</strong> Updated admin notices to better conform to WordPress design standards, and configured them to only show on WeForms pages.</li>\n<li><strong>Update:</strong> Removed FortressDB admin notice.</li>\n<li><strong>Update:</strong> Updated axios dependancy</li>\n</ul>\n<h4>Version 1.6.4 (23 December, 2020)</h4>\n<ul>\n<li><strong>Fix:</strong> Added spreadsheet functione escaping to prevent CSV exploits. [#50] (https://github.com/BoldGrid/weforms/pull/50)</li>\n<li><strong>Update:</strong> Update Node Packages</li>\n</ul>\n<h4>Version 1.6.3 (11 November, 2020)</h4>\n<ul>\n<li><strong>Update:</strong> Sprout Invoices Integration</li>\n</ul>\n<h4>Version 1.6.2 (11 November, 2020)</h4>\n<ul>\n<li><strong>Update:</strong> Sprout Invoices Integration</li>\n</ul>\n<h4>Version 1.6.1 (11 November, 2020)</h4>\n<ul>\n<li><strong>Update:</strong> Sprout Invoices Integration</li>\n</ul>\n<h4>Version 1.6.0 (11 November, 2020)</h4>\n<ul>\n<li><strong>Update:</strong> Sprout Invoices Integration</li>\n</ul>\n<h4>Version 1.5.5 (29 October, 2020)</h4>\n<ul>\n<li><strong>Fix:</strong> Quick Vulnerability Fix</li>\n</ul>\n<h4>Version 1.5.4 (29 October, 2020)</h4>\n<ul>\n<li><strong>Fix:</strong> Quick Vulnerability Fix</li>\n</ul>\n<h4>Version 1.5.3 (20 October, 2020)</h4>\n<ul>\n<li><strong>Fix:</strong> Fixed bug causing a blank screen to appear for some users</li>\n</ul>\n<h4>Version 1.5.2 (13 October, 2020)</h4>\n<ul>\n<li><strong>Fix:</strong> Fixed JS Issues.</li>\n<li><strong>Fix:</strong> Email Header Formatting.</li>\n<li><strong>Update:</strong> Added Fortress DB Integration.</li>\n</ul>\n<h4>Version 1.5.1 (1 September, 2020)</h4>\n<ul>\n<li><strong>Fix:</strong> Fixed Fortress DB tab.</li>\n</ul>\n<h4>Version 1.5.0 (1 September, 2020)</h4>\n<ul>\n<li><strong>Update:</strong> Added Fortress DB and Conditional Banner.</li>\n<li><strong>Update:</strong> Removed Diagnostic Pop Up.</li>\n<li><strong>Fix:</strong> JSON import issue fixed.</li>\n<li><strong>Fix:</strong> Double Column not working, issue fixed.</li>\n<li><strong>Fix:</strong> File Upload issue fixed.</li>\n<li><strong>Fix:</strong> Signature field issue fixed.</li>\n</ul>\n<h4>Version 1.4.9 (30 June, 2020)</h4>\n<ul>\n<li><strong>Update:</strong> Added a privacy page.</li>\n</ul>\n<h4>Version 1.4.8 (30 March, 2020)</h4>\n<ul>\n<li><strong>Fix:</strong> Fixed escaping of select options when adding a form to a page.</li>\n<li><strong>Fix:</strong> Fixed Email notification formatting issue.</li>\n<li><strong>Fix:</strong> Fixed column field resize issue.</li>\n<li><strong>Fix:</strong> Fixes Array to string conversion warning with address field.</li>\n<li><strong>Fix:</strong> Replace an instance of non-existant.</li>\n<li><strong>Fix:</strong> Conflict with kingcomposer.</li>\n<li><strong>Fix:</strong> Recaptcha token expire.</li>\n</ul>\n<h4>Version 1.4.7 (10 March, 2020)</h4>\n<p><strong>Update:</strong> Links now point to new https://weformspro.com/</p>\n<h4>Version 1.4.6 (20 February, 2020)</h4>\n<ul>\n<li><strong>Fix:</strong> image upload field issue</li>\n<li><strong>Fix:</strong> widget not rendering properyly</li>\n<li><strong>Fix:</strong> HTML Tags are not rendering the HTML format for the Radio or Checkbox Field</li>\n<li><strong>Fix:</strong> submit issue with image and recaptcha.</li>\n</ul>\n<h4>Version 1.4.5 (31 January, 2020)</h4>\n<ul>\n<li><strong>Feature:</strong> Added Recaptcha v3 support</li>\n<li><strong>Fix:</strong> Fixed Some regressions after phpcs fixes</li>\n</ul>\n<h4>Version 1.4.4 (14 January, 2020)</h4>\n<ul>\n<li><strong>Improvement:</strong> Imporve Code Quality</li>\n</ul>\n<h4>Version 1.4.3 (10 January, 2020)</h4>\n<ul>\n<li><strong>Fix:</strong>  Field display issue in form entries page</li>\n<li><strong>Fix:</strong>  Hidden Field not working properly in builder</li>\n<li><strong>Fix:</strong>  Some Column field issue</li>\n<li><strong>Fix:</strong>  Sanitize and Escape data before saving and rendering</li>\n<li><strong>Improvement:</strong> Add privacy policy in readme</li>\n</ul>\n<h4>Version 1.4.2 (18 November, 2019)</h4>\n<ul>\n<li><strong>Fix:</strong> Fixed Form was not showing immediately after duplicating.</li>\n<li><strong>Fix:</strong> Fixed some column field issues. Closes #172</li>\n<li><strong>Fix:</strong> Fixed a csv export issue. closes #175</li>\n</ul>\n<h4>Version 1.4.1 (24 September, 2019)</h4>\n<ul>\n<li><strong>New:</strong> Added Rest api</li>\n<li><strong>Fix:</strong> Full name shows instead of first name in the email notification</li>\n<li><strong>Fix:</strong> Dynamic value population &#8211; not saving value</li>\n</ul>\n<h4>Version 1.4.0 (17 June, 2019)</h4>\n<ul>\n<li><strong>Feature:</strong> Added GDPR Export and Delete Requests Forms.</li>\n<li><strong>Fix:</strong> Multistep form: scroll to the top of the form when click on Next &amp; Previous buttons.</li>\n</ul>\n<h4>Version 1.3.9 (10 May, 2019)</h4>\n<ul>\n<li><strong>Fix:</strong> Updated plugin description for WordPress.org</li>\n</ul>\n<h4>Version 1.3.8 (11 April, 2019)</h4>\n<ul>\n<li><strong>Feature:</strong> Added column field: Now, creating multi-column in a single row is super easy with weForms Column field. Just drag the column field in the builder area, configure columns number, column space and add any fields you want inside that Column field.</li>\n<li><strong>Enhancement:</strong> Allow dynamic value population for hidden field.</li>\n<li><strong>Fix:</strong> Address field country full name not showing in the entries &amp; PDF.</li>\n</ul>\n<h4>Version 1.3.7 (14 February, 2019)</h4>\n<ul>\n<li><strong>Improvement:</strong> New design for form integrations tab.</li>\n<li><strong>Improvement:</strong> Replace single checkbox with switch button.</li>\n<li><strong>Fix:</strong> When duplicating a contact form, showing error <code>schedule_form of undefined</code>.</li>\n</ul>\n<h4>Version 1.3.6 (17 January, 2019)</h4>\n<ul>\n<li><strong>Fix:</strong> Changed get countries function name as the same function exists in the professional version and there was a possibility to get an error.</li>\n</ul>\n<h4>Version 1.3.5 (16 January, 2019)</h4>\n<ul>\n<li><strong>Feature:</strong> As per user suggestion, we have added a status column for the form listing table. By this, the admin will be able to see whether the form is &#8216;Open&#8217; or &#8216;Close&#8217;. In addition to that, the admin will also be able to view or show the reasons behind keeping a form open or close according to the 3 form submission restrictions (scheduling form, requiring login and limiting submission entries) from the form settings.</li>\n<li><strong>Feature:</strong> As per client suggestion, we have added a &#8220;Created by&#8221; column on form listing table. This will allow the admin to know the creator of a form, their gravatar image and the date on which the form was created.</li>\n<li><strong>Fix:</strong> Import description and settings from WP Forms.</li>\n<li><strong>Fix:</strong> When viewing the entries, country short-name was displayed. With this release, we have changed the short-name to the full name. For example, Now it shows Canada instead of just showing CA.</li>\n<li><strong>Fix:</strong> Improved submit button design for the form builder.</li>\n<li><strong>Fix:</strong> Deleting form entries didn&#8217;t remove the media/file from the media library permanently. But now it does.</li>\n<li><strong>Fix:</strong> Gutenberg block was not loading on edit post/page which has been fixed.</li>\n<li><strong>Fix:</strong> On activating the WP User Frontend, the reCaptcha field of weForms did not work which has been fixed.</li>\n</ul>\n<h4>Version 1.3.4 (22 November, 2018)</h4>\n<ul>\n<li><strong>Fix:</strong> Undefined name field</li>\n<li><strong>Fix:</strong> Shortcode popup form width fix</li>\n</ul>\n<h4>Version 1.3.3 (12 November, 2018)</h4>\n<ul>\n<li><strong>New:</strong> Design phone field</li>\n<li><strong>Fix:</strong> Default input style issue of form builder</li>\n</ul>\n<h4>Version 1.3.2 (23 October, 2018)</h4>\n<ul>\n<li><strong>Fix:</strong> Calendar not showing on date field</li>\n<li><strong>New:</strong> Use theme CSS option in form display settings</li>\n</ul>\n<h4>Version 1.3.1 (18 August, 2018)</h4>\n<ul>\n<li><strong>New:</strong> Added custom classes to make two or three columns form</li>\n<li><strong>Fix:</strong> Sanitized name field</li>\n</ul>\n<h4>Version 1.3.0 (09 August, 2018)</h4>\n<ul>\n<li><strong>Fix:</strong> Form preview link fixed where site_url and home_url is different</li>\n<li><strong>Fix:</strong> WPUF builder not loading properly is resolved</li>\n</ul>\n<h4>Version 1.2.9 (11 July, 2018)</h4>\n<ul>\n<li><strong>New:</strong> Integrate Dokan vendor contact form</li>\n<li><strong>New:</strong> Added Form select media button weforms</li>\n<li><strong>New:</strong> Added no-conflict mode to resolve Backend JS conflicts with other plugins</li>\n<li><strong>New:</strong> Added Privacy Suggestion for GDPR</li>\n<li><strong>Fix:</strong> Resolved conditional logic not working for custom_html and section_break</li>\n<li><strong>Fix:</strong> Load weForms specific frontend css</li>\n<li><strong>Fix:</strong> php 5.4 compatbility for bulk delete entry</li>\n<li><strong>Fix:</strong> Fixed no buffer to delete warning</li>\n</ul>\n<h4>Version 1.2.8 (09 May, 2018)</h4>\n<ul>\n<li><strong>New:</strong> Show submitted form data in message after form submission</li>\n<li><strong>New:</strong> Added device option in form entry data</li>\n<li><strong>Improved:</strong> Nocaptcha recaptcha wasn&#8217;t working if allow_url_fopen was disabled, now it will.</li>\n</ul>\n<h4>Version 1.2.7 (22 April, 2018)</h4>\n<ul>\n<li><strong>New:</strong> Added weForms Guten block for Gutenberg</li>\n<li><strong>Fix:</strong> Fixed Pagination issue in form entries</li>\n<li><strong>Improved:</strong> Fixed entry data meta remains in database after deleting an entry</li>\n</ul>\n<h4>Version 1.2.6 (22 March, 2018)</h4>\n<ul>\n<li><strong>Improved:</strong> Added Missing text-domains</li>\n<li><strong>Fix:</strong> Admin Notices from Form Builder Pages are removed.</li>\n<li><strong>Fix:</strong> JavaScript conflicts with WP User Frontend are fixed.</li>\n<li><strong>Fix:</strong> Form entries with UTF-8 charset were not exporting properly.</li>\n</ul>\n<h4>Version 1.2.5 (19 February, 2018)</h4>\n<ul>\n<li><strong>New:</strong> Added more starter form templates for use like Donation Form, Online Booking Form, Conference Proposal etc.</li>\n<li><strong>Improved:</strong> Added dark theme support for recaptcha.</li>\n<li><strong>Fix:</strong> Google map entry display template fixed.</li>\n</ul>\n<h4>Version 1.2.4 (28 December, 2017)</h4>\n<ul>\n<li><strong>Improved:</strong> External libraries extracted to a separate JavaScript file. This is going to reduce the requests count and improve loading time. Also now we are loading the minified version of all JavaScript file for production sites.</li>\n<li><strong>Fix:</strong> ReCaptcha validation was giving a 400 error. Fixed that bug.</li>\n<li><strong>Fix:</strong> Fixed undefined index error on field duplicate checking.</li>\n<li><strong>Improved:</strong> Now we are loading upgrades on admin side only.</li>\n</ul>\n<h4>Version 1.2.3 (16 December, 2017)</h4>\n<ul>\n<li><strong>Improved:</strong> Now we are loading the shortcode for ajax requests as well, required for the integration of page builders.</li>\n</ul>\n<h4>Version 1.2.2 (19 November, 2017)</h4>\n<ul>\n<li><strong>New</strong>: Now you can set up the form in a way, so Email and Name fields value can be auto-populated from user&#8217;s WordPress profile when the user is logged. And those fields will get hidden on front-end.</li>\n<li><strong>New</strong>: We&#8217;ve added trash functionality for entries. When you delete an entry, that will move to trash. And later you can delete those permanently or restore if you need.</li>\n<li><strong>New</strong>: To help debug the integrations API error messages, we’ve added a custom error logging function and a log viewer. Can be found on <code>WP-Admin &gt; weFroms &gt; Tools &gt; Logs</code></li>\n<li><strong>Improved</strong>: Sometimes, we need to show dynamic default or placeholder text on fields. Merge tag support for default and placeholder attribute added.</li>\n<li><strong>Improved</strong>: When you edited a form and leaving the builder without saving, we&#8217;ve added a little warning to let you know, if you leave your changes are going to be discarded.</li>\n<li><strong>Improved</strong>: To help you find the right form template easily, We&#8217;ve re-categorized the form templates.</li>\n</ul>\n<h4>Version 1.2.1 (8 November, 2017)</h4>\n<ul>\n<li><strong>New</strong>: We’ve added a rich text editor for notification email template editing area. It’s going to help you write better HTML email with less effort.</li>\n<li><strong>Improved</strong>: Now you can decide if you would like to hide or show the empty fields on Entry Page. We’ve added a checkbox to toggle that.</li>\n<li><strong>Improved</strong>: We’ve added a little filter on {all_fields} shortcode. When sending email notification it’s going to exclude all the empty fields. So it becomes more readable.</li>\n<li><strong>Fix</strong>: There was some issue with CSV exporting. We fixed that.</li>\n</ul>\n<h4>Version 1.2.0 (30 October, 2017)</h4>\n<ul>\n<li><strong>New</strong>: We added a lot&#8217;s of ready to use form templates. So you can just select the form template you need and your form will be ready.</li>\n<li><strong>New</strong>: Added an Entries page in admin menu. Now you can access the form entries directly without going through few clicks.</li>\n<li><strong>New</strong>: MailPoet Integration added from premium version. We thought to give it away for free.</li>\n<li><strong>New</strong>: Date / Time field added from premium version. As it&#8217;s a very commonly used field, it provides a lot more value in the free version.</li>\n<li><strong>New</strong>: Pop-up/Modal form option added. Can be used through shortcode like <code>[weforms id=\"ID\" modal='true' button='Open Form']</code>.</li>\n<li><strong>New</strong>: Dynamic field population added. Field options or default values can be pre-populated by hooks or query string.</li>\n<li><strong>New</strong>: Unique entry checking for fields like email, phone, text, number, URL added. Now, you can prevent duplicate submissions if you want.</li>\n<li><strong>Improved</strong>: Settings page re-designed. New settings page is more user friendly and easy to use.</li>\n<li><strong>Fix</strong>: Previously created forms sometimes failed work with new features. We added a new filter, now all new features are going to work smoothly  even with old forms.</li>\n<li><strong>Fix</strong>: There was a small issue on showing validation error message on front-end. We&#8217;ve Fixed that.</li>\n</ul>\n<h4>Version 1.1.1 (3 October, 2017)</h4>\n<ul>\n<li><strong>Fix</strong>: Fatal error on completely new installation. As default form creation format has been changed, it was giving a fatal error.</li>\n</ul>\n<h4>Version 1.1.0 (2 October, 2017)</h4>\n<ul>\n<li><strong>New:</strong> Added WP ERP integration. You can subscribe a user to a contact group in ERP when submitting a form.</li>\n<li><strong>New:</strong> Form sharing. You can share a form without inserting the shortcode to a page. A hashed URL will be provided for privacy.</li>\n<li><strong>Improved</strong>: Removed WP User Frontend dependency. Now you can use weForms without requiring WPUF.</li>\n<li><strong>Improved</strong>: Core API rewrites. Now it&#8217;s easier to manage the internals with more OOP code improvements.</li>\n<li><strong>Improved</strong>: Every fields are now a separate class, and managed via a field manager class. Creating a new form field is way more easier than previous.</li>\n<li><strong>Improved</strong>: Importer&#8217;s are managed by a separate importer manager class.</li>\n<li><strong>Improved</strong>: The form templates are now more simpler to create. The modal template popup has been redesigned by grouping the templates and now shows a form preview image.</li>\n<li><strong>Improved</strong>: Added autocomplete attributes to field attributes so form fills can detect the fields and auto-populate with related content.</li>\n<li><strong>Fix</strong>: reCaptcha validtion wasn&#8217;t working.</li>\n</ul>\n<h4>v1.0.4 (5 September, 2017)</h4>\n<ul>\n<li>[fix] Wrong reference of static $separator used.</li>\n</ul>\n<h4>v1.0.3 (30 August, 2017)</h4>\n<ul>\n<li>[new] Gravity Forms Importer</li>\n<li>[new] Caldera Forms Importer</li>\n<li>[new] Ninja Forms Importer</li>\n<li>[new] WP Forms Forms Importer</li>\n<li>[new] Frontend Form Preview</li>\n<li>[new] Add form credit settings</li>\n<li>[fix] Notification mail shows level with Underscore between all words</li>\n<li>[fix] New columns added on entries listing page</li>\n</ul>\n<h4>v1.0.2 (24 August, 2017)</h4>\n<ul>\n<li>[improved] Affiliate link tracking for plugin install</li>\n</ul>\n<h4>v1.0.1 (23 August, 2017)</h4>\n<ul>\n<li>[improved] Added missing integration icons</li>\n<li>[fix] Email content type fixed</li>\n</ul>\n<h4>v1.0.0 (19 August, 2017)</h4>\n<ul>\n<li>[new] Added reCaptcha support</li>\n<li>[new] Emailer class added for hookable email gateway support</li>\n<li>[new] Added support for google map in rendering entries</li>\n<li>[new] Added help page and premium contents</li>\n<li>[improved] Sync settings between weforms and wpuf map and recaptcha</li>\n<li>[improved] Routes moved to localize script, better hookability</li>\n<li>[fix] Form status checking in rendering</li>\n<li>[fix] Image and file upload and rendering issue fixed</li>\n</ul>\n<h4>v1.0.0-beta.3 (6 August, 2017)</h4>\n<ul>\n<li>[fix] Fatal error on creating a new form</li>\n<li>[inhancement] Hide WPUF page installation and tracking prompt</li>\n</ul>\n<h4>v1.0.0-beta.2 (5 August, 2017)</h4>\n<ul>\n<li>[fix] Padding in email template. Looks better now.</li>\n<li>[fix] Support name in “From Name” email notification. Fixes #16</li>\n<li>[fix] Remove recaptcha “type” from settings page</li>\n<li>[fix] Other fields were not coming in export entries csv file</li>\n<li>[new] Import Contact form 7 forms into weForms 😎</li>\n<li>[new] Create a default form upon installation</li>\n</ul>\n<h4>v1.0.0-beta.1 (1 August, 2017)</h4>\n<ul>\n<li>First beta version</li>\n</ul>\n"
    },
    "short_description": "The easiest &amp; fastest Contact Form on WordPress. Multiple templates, drag-&amp;-drop live builder, submission listing, reCaptcha &amp; more!",
    "description": "<h4>weForms- The Best Contact Form Builder plugin for WordPress</h4>\n<p>One of the most important features of a WordPress form plugin is the ability to quickly and easily create a form. That’s why we built our product to be the easiest form builder available.</p>\n<p>weForms enables you to create WordPress forms in a matter of minutes. With numerous templates and an easy to use drag and drop interface, your form can go from concept to reality instantly. Live preview functions allow you to see what your users will see with a click of a button.</p>\n<p>Beyond the functionality of building the form itself, weForms boasts more than 20 custom fields. These range from address fields to multi-select boxes. All of the fields can help you build forms to collect various types of user information for things such as a support ticket, event registration, or job application. You can also see all of your users’ submissions right inside your WordPress dashboard for added convenience.</p>\n<p>weForms is an all-in-one form builder created for every skill level of user. Its minimalistic design is not only modern but also super fast and user-friendly. Everything works on a single page. Stop wasting time trying to find a developer to build a form, knock it out yourself in a matter of minutes!</p>\n<h4>Quick Overview of weForms</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/4uYi0833Kjw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>Key Features</h4>\n<ul>\n<li><strong>Unlimited Forms:</strong> Create as many forms as you want and collect all the data you need</li>\n<li><strong>Predefined and Customizable Templates:</strong> Save time using our unique &amp; customizable form templates</li>\n<li><strong>Drag &amp; Drop Builder:</strong> Build the form of your dream with its fully featured drag &amp; drop form editing option</li>\n<li><strong>Real-time Live Preview:</strong> Instantly preview your work in real-time</li>\n<li><strong>Expiry Time:</strong> Set a form expiration date to automate your forms showing on a schedule</li>\n<li><strong>Entry Restrictions:</strong> Limit the number of entries for each individual form by setting the maximum form submission limit. Perfect for event registration!</li>\n<li><strong>One Page Submission:</strong> Form submission occurs without a page refresh using AJAX, making submissions instant</li>\n<li><strong>Field Customization Options:</strong> Customize the form fields available with tons of options to best fit your needs.</li>\n<li><strong>Form Redirection:</strong> Upon form submission easily redirect your users to any page of your choice</li>\n<li><strong>Form Submission Notification:</strong> Use our built-in email notifications to never miss a beat when your users submit a form on your website</li>\n<li><strong>Manage Form Submissions:</strong> Manage the submission of forms to collect data without the hassle of backend coding</li>\n<li><strong>Import or Export Forms:</strong> Use the quick form exporting and importing option that lets you start from where you left off or save your data offline</li>\n<li><strong>Mobile-friendly forms:</strong> weForms is mobile-friendly and responsive, making it easy for your users to submit forms via computer, mobile phone, or tablet</li>\n<li><strong>Mail support:</strong> Get complete mail support feature in the form of customize mails and HTML email template</li>\n<li><strong>Email submission data:</strong> Connect your forms to several of our integrated email services to get form submission data in emails</li>\n<li><strong>Anti-spam &amp; reCaptcha:</strong> Get rid of spam entries with reCaptcha or through our other integrated partners, like Human Presence to eliminate spam messages and registrations with WordPress forms</li>\n<li><strong>Slack Integrations:</strong> Get notified through your Slack account whenever any user submits a form using weForms</li>\n<li><strong>Column Field:</strong> Build your form the way you want by adding any field into our column field. Resize them the way you need them to create a dynamic form for your website</li>\n</ul>\n<h4>KEY ATTRIBUTES &#8211; WEFORMS STANDS OUT FROM THE CROWD!</h4>\n<h4>DRAG &amp; DROP FORM BUILDER WITH LIVE FORM PREVIEW</h4>\n<p>With weForms smooth drag and drop form builder, create any type of form you need within minutes. You aren’t required to know a single line of code to create a powerful form with the help of our intuitive drag &amp; drop form building feature. Simply drag &amp; drop the fields you want to add from the panel of the available form fields. Instantly live preview the form that you have created in the frontend.</p>\n<h4>MOBILE RESPONSIVE FORMS FOR ALL OF YOUR DEVICES</h4>\n<p>Having a responsive contact form on your WordPress is a must for a user-friendly experience. weForms ensures that your created forms are all well-responsive even on all mobile devices. This will help you increase form conversion rates and customer satisfaction.</p>\n<h4>PRE-DEFINED FORM TEMPLATES FOR QUICK ACCESS</h4>\n<p>In a lot of cases, you might not need to build a form from scratch. A simple form with some predefined fields would fit all of your needs. With weForms, you get a variety of pre-built form templates that fit a multitude of use cases, helping you to capture leads easier and faster.</p>\n<p>weForms predefined form templates include: Registration forms, Application forms, Payment forms, Reservations forms, Poll and Feedback forms, Request forms, and Event Registration forms.</p>\n<h4>ADD WEFORMS WORDPRESS CONTACT FORMS USING GUTENBERG</h4>\n<p>Easily add your forms in the WordPress editor with the weForms block. When users want to publish forms on a page, they can simply select it from the drop-down present in the dedicated weForms block for Gutenberg. The entire form automatically renders within the editor as well as on page. It’s much easier than manually copying and pasting shortcodes! This saves you a ton of time and clicks, but for those who prefer shortcodes, you can still add forms to your pages with other page builders too.</p>\n<h4>SUPER FAST, SUPERCHARGED WEBSITE FORMS</h4>\n<p>When it comes to the speed of submitting a form from the frontend or in the backend, weForms does the job faster than any other form builder. Regardless if it is sent via computer, phone, or tablet, you can rest assured it will be quick!</p>\n<h4>THE ONLY LIMITATION IS YOUR IMAGINATION</h4>\n<p>Taking a form from concept to reality is a walk in the park with weForms. Quickly design any type of form you can think of using our easy to use builder with plenty of field options &amp; a beautiful drag and drop user interface.</p>\n<p>Instantly preview the form you built and make changes right away. Improve the quality and standard of your form-building process with weForms.</p>\n<h4>CUSTOM FIELDS TO MAKE THE MOST OF YOUR CONTACT FORMS</h4>\n<p>While building a form with weForms custom field, anyone, even those without any prior coding knowledge are able to create great forms. From check-box to image upload fields, or radio button to the signature field, weForms provides you with every great form field. This also includes the column field option to make your forms look great and flow beautifully.</p>\n<h4>EXTEND &amp; CUSTOMIZE YOUR CONTACT FORMS WITHOUT A HITCH</h4>\n<p>As an advanced user, you might want your form to look or perform in a certain way. This is where the customization capabilities of weForms will come in handy. With its custom CSS, HTML blocks, and section dividers, users are able to customize their forms exactly the way they like. weForms also has heaps of filters and hooks that help developers easily extend a contact forms functionality.</p>\n<h4>EASY FORM IMPORT &amp; EXPORT FACILITY</h4>\n<p>Moving from a different form provider? Easily import your forms in a JSON format or from built-in form import tools. Looking to export out your form or the submissions? We have you covered with both form submissions exports as well as a JSON export of the form itself.</p>\n<h4>FORM ENTRY RESTRICTIONS, SCHEDULING, AND EXPIRATION TIMES</h4>\n<p>Have full control over your forms and when they can be used! Create exclusive campaigns by allowing only a limited number of entries, controlling user access, and adding a start and expiration date. Form with an expiration date will automatically disappear after the time you want.</p>\n<h4>CUSTOMIZABLE EMAIL NOTIFICATIONS FOR ADMINS</h4>\n<p>Stay alert with every submission. Create multiple custom notifications on each form with advanced mail forwarding and quickly create templates with hooks.</p>\n<h4>FORM REDIRECTION PAGE OR CUSTOM URL</h4>\n<p>When a user completes a form, you can redirect them with a custom link or to a page to guide the user through your desired workflow. It’s very useful when you want to direct the visitor’s attention to additional pages, or just creatively customize your submission received messaging.</p>\n<h4>OTHER NOTABLE WEFORMS ATTRIBUTES INCLUDE</h4>\n<ul>\n<li>ReCaptcha and Human Presence Anti-Spam integrations to ensure an extra layer of security for forms.<br />\n*The ability to sync email form data with numerous email integrations</li>\n<li>Multi-step and Multi-part Forms to break up the submission process for your users.</li>\n<li>Geolocation &amp; SMS notifications to help improve your response times and data.</li>\n<li>Much, much more.</li>\n</ul>\n<h4>DON’T JUST TAKE OUR WORD FOR IT, HERE IS WHAT SOME OF THE BIGGEST NAMES IN THE COMMUNITY HAVE TO SAY</h4>\n<blockquote>\n<p>weForms is both easy and super fast, even the completely new users can build beautiful WordPress forms without any hassle. &#8211; WP Arena</p>\n<p>The free version offers a host of useful and advanced features that are not available in many existing alternatives. &#8211; Cloudways</p>\n<p>We tried to do some experimentation with weForms and to our utter delight, it looks like we can build all types of contact forms using it! &#8211; WPBlog</p>\n</blockquote>\n<h4>MODULES &amp; INTEGRATIONS FOR WEFORMS</h4>\n<p>Email Marketing Integrations<br />\n* <a href=\"https://weformspro.com/docs/integrations/mailchimp/\" rel=\"nofollow ugc\">MailChimp:</a> This integration makes the already powerful form builder your ultimate lead generation source for one of the best email marketing tools available.<br />\n* <a href=\"https://weformspro.com/docs/integrations/aweber/\" rel=\"nofollow ugc\">AWeber:</a> Connect weForms with AWeber mail lists to reach submitters via email campaigns. Easily grow your contact base and do more with emails.<br />\n* <a href=\"https://weformspro.com/docs/integrations/constant-contact/\" rel=\"nofollow ugc\">Constant Contact:</a> Make your email marketing powerful and simple using Constant Contact integration for weForms.<br />\n* <a href=\"https://weformspro.com/docs/integrations/campaign-monitor-integration/\" rel=\"nofollow ugc\">Campaign Monitor:</a> Boost your email marketing by integrating weForms with Campaign Monitor. Quickly generate more leads by syncing your mail lists with those who post form submissions.<br />\n* <a href=\"https://weformspro.com/docs/integrations/getresponse/\" rel=\"nofollow ugc\">GetResponse:</a>Supercharge your email marketing to boost your business by integrating it with weForms.<br />\n* <a href=\"https://weformspro.com/docs/integrations/mailpoet/\" rel=\"nofollow ugc\">MailPoet:</a>  It provides you the experience of using the best WordPress Newsletter plugin with the best Form Builder weForms.<br />\n* <a href=\"https://weformspro.com/docs/integrations/convertkit/\" rel=\"nofollow ugc\">ConvertKit:</a> Quickly boost your business by generating more leads, syncing the mail lists with submissions by integrating them with weForms.</p>\n<p>Payment Integrations<br />\n* <a href=\"https://weformspro.com/docs/integrations/payment/\" rel=\"nofollow ugc\">Paypal:</a> Collect PayPal payments with your forms easily by integrating it with weForms.<br />\n* <a href=\"https://weformspro.com/docs/modules/payment-stripe/\" rel=\"nofollow ugc\">Stripe:</a> Collect credit card payments safely and quickly by integrating Stripe with your forms</p>\n<p>Productivity Tool Integrations and Modules<br />\n* <a href=\"https://weformspro.com/docs/integrations/google-analytics/\" rel=\"nofollow ugc\">Google Analytics:</a> Provides a powerful &amp; complete marketing analytics solution for businesses of all sizes using forms.<br />\n* <a href=\"https://weformspro.com/docs/integrations/zapier/\" rel=\"nofollow ugc\">Zapier:</a> The easiest and most popular automated workflow management system on the internet integrates with the fastest form builder.<br />\n* <a href=\"https://weformspro.com/docs/integrations/google-sheets/\" rel=\"nofollow ugc\">Google Sheets:</a> This integration for weForms will give you the ease of managing submitted information in the familiar Google Sheets environment.<br />\n* <a href=\"https://weformspro.com/docs/integrations/trello/\" rel=\"nofollow ugc\">Trello:</a> Instantly create task cards from your form submissions by enabling this module.<br />\n* <a href=\"https://weformspro.com/docs/modules/calculation/\" rel=\"nofollow ugc\">Calculation:</a> Enable your form to have calculation capabilities with your numeric fields<br />\n* <a href=\"https://weformspro.com/docs/integrations/pdf-form-submission/\" rel=\"nofollow ugc\">PDF Form Submission:</a> Enable this module to get a better printable PDF version of all your collected submission forms.<br />\n* <a href=\"https://weformspro.com/docs/integrations/quiz/\" rel=\"nofollow ugc\">Quiz:</a> Create simple yet engaging quiz forms and keep your audiences hooked getting a lot of shares by enabling this module.<br />\n* <a href=\"https://weformspro.com/docs/integrations/slack/\" rel=\"nofollow ugc\">Slack:</a> Notify your team instantly in Slack when someone submits an entry to your forms created with weForms enabling this free integration.<br />\n* <a href=\"https://weformspro.com/docs/integrations/sms-notification/\" rel=\"nofollow ugc\">SMS Notification:</a> Enable the module to get a notification through SMS every time a form submission occurs.<br />\n* <a href=\"https://weformspro.com/docs/form-field-types/file-upload/\" rel=\"nofollow ugc\">File Upload:</a> Allow users to attach files of whatever type you specify to streamline application processes, add images and more.</p>\n<p>CRM Integrations<br />\n* <a href=\"https://weformspro.com/docs/integrations/salesforce/\" rel=\"nofollow ugc\">Salesforce:</a> Integrate with weForms to instantly enhance your user list building more customers and more interactions.<br />\n* <a href=\"https://weformspro.com/docs/integrations/wp-erp/\" rel=\"nofollow ugc\">WP ERP:</a> Integrate your forms with WordPress CRM contact lists &amp; instantly get tons of new leads who you can convert as subscribers or customers.<br />\n* <a href=\"https://weformspro.com/docs/integrations/hubspot-integration/\" rel=\"nofollow ugc\">HubSpot:</a> Get more opportunities to make deals at your fingertips by integrating HubSpot with weForms and instantly enhance your contact list.<br />\n* <a href=\"https://weformspro.com/docs/integrations/zoho/\" rel=\"nofollow ugc\">Zoho:</a> Enabling it gets you better sales-qualified lead generation. Simply connect it once, pass data instantly &amp; start tracing form subscribers from your CRM as they move through the sales funnel.</p>\n<h4>WEFORMS PRO FEATURES ARE AWESOME!</h4>\n<p>Need more features? Then you might want to upgrade to one of our weForms Pro versions. This amazing contact form builder for WordPress has 4 convenient and affordable plans to strengthen your form building and lead capture functionalities.</p>\n<h4>THE FOUR PRO PLANS:</h4>\n<ul>\n<li><a href=\"https://weformspro.com/pricing/\" rel=\"nofollow ugc\">Personal</a></li>\n<li><a href=\"https://weformspro.com/pricing/\" rel=\"nofollow ugc\">Business</a></li>\n<li><a href=\"https://weformspro.com/pricing/\" rel=\"nofollow ugc\">Professional</a></li>\n<li><a href=\"https://weformspro.com/pricing/\" rel=\"nofollow ugc\">Developer</a></li>\n</ul>\n<h4>These tailored plans consists of some highly essential &amp; cutting-edge PRO features and integrations that include:</h4>\n<ul>\n<li>Advanced fields</li>\n<li>Conditional logic</li>\n<li>Multistep form</li>\n<li>Webhooks</li>\n<li>Country List Field</li>\n<li>File uploader</li>\n<li>PDF form submissions</li>\n<li>Geolocation tracking</li>\n<li>SMS notification</li>\n<li><strong>Email Marketing Integrations</strong>\n<ul>\n<li>MailChimp</li>\n<li>MailPoet</li>\n<li>AWeber</li>\n<li>Constant Contact</li>\n<li>Campaign Monitor</li>\n<li>Get Response</li>\n<li>Convert Kit</li>\n</ul>\n</li>\n<li><strong>Productivity Tool Integration</strong>\n<ul>\n<li>Google Analytics</li>\n<li>Zapier</li>\n<li>Trello</li>\n</ul>\n</li>\n<li><strong>Payment Integration</strong>\n<ul>\n<li>Paypal</li>\n<li>Stripe</li>\n</ul>\n</li>\n<li><strong>CRM Integration</strong>\n<ul>\n<li>Salesforce</li>\n<li>Zoho</li>\n<li>Hubspot</li>\n</ul>\n</li>\n</ul>\n<p>Learn more about our <a href=\"https://weformspro.com/pricing/\" rel=\"nofollow ugc\">weForms Pro Features</a> now!</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/weforms.1.6.25.zip",
    "upgrade_notice": {
        "": "<p>Nothing here right now</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-1.gif?rev=1721119",
            "caption": "How it works"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-2.png?rev=1721119",
            "caption": "The form listings"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-3.png?rev=1721119",
            "caption": "Create form from a range of pre-defined templates"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-4.png?rev=1721119",
            "caption": "A single contact form with it's builder view"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-5.png?rev=1721119",
            "caption": "Edit the field properties on the right side and see the changes instantly"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-6.png?rev=1721119",
            "caption": "Form settings"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-7.png?rev=1721119",
            "caption": "Submission restriction settings of a form"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-8.png?rev=1721119",
            "caption": "Form display settings"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-9.png?rev=1721119",
            "caption": "Create and send unlimited email notifications to various destinations"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-10.png?rev=1721119",
            "caption": "Email notification settings"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-11.png?rev=1721119",
            "caption": "Free slack integration and various premium integrations"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-12.png?rev=1721119",
            "caption": "Export the forms, as well as the form entries (CSV)."
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-13.png?rev=1721119",
            "caption": "Import forms, also import forms from various other plugins"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-14.png?rev=1721119",
            "caption": "The help page"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-15.png?rev=1721119",
            "caption": "Plugin settings"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-16.png?rev=1721119",
            "caption": "A simple contact form displayed on the site"
        },
        {
            "src": "https://ps.w.org/weforms/assets/screenshot-17.png?rev=1721119",
            "caption": "Event registration form displayed on the site"
        }
    ],
    "tags": {
        "contact-form": "contact form",
        "contact-form-plugin": "contact form plugin",
        "custom-form": "custom form",
        "form-builder": "form builder",
        "forms": "forms"
    },
    "stable_tag": "1.6.25",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/weforms.1.0.0.zip",
        "1.0.0-beta.3": "https://downloads.wordpress.org/plugin/weforms.1.0.0-beta.3.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/weforms.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/weforms.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/weforms.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/weforms.1.0.4.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/weforms.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/weforms.1.1.1.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/weforms.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/weforms.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/weforms.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/weforms.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/weforms.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/weforms.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/weforms.1.2.6.zip",
        "1.2.7": "https://downloads.wordpress.org/plugin/weforms.1.2.7.zip",
        "1.2.8": "https://downloads.wordpress.org/plugin/weforms.1.2.8.zip",
        "1.2.9": "https://downloads.wordpress.org/plugin/weforms.1.2.9.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/weforms.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/weforms.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/weforms.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/weforms.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/weforms.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/weforms.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/weforms.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/weforms.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/weforms.1.3.8.zip",
        "1.3.9": "https://downloads.wordpress.org/plugin/weforms.1.3.9.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/weforms.1.4.0.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/weforms.1.4.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/weforms.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/weforms.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/weforms.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/weforms.1.4.5.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/weforms.1.4.6.zip",
        "1.4.7": "https://downloads.wordpress.org/plugin/weforms.1.4.7.zip",
        "1.4.8": "https://downloads.wordpress.org/plugin/weforms.1.4.8.zip",
        "1.4.9": "https://downloads.wordpress.org/plugin/weforms.1.4.9.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/weforms.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/weforms.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/weforms.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/weforms.1.5.3.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/weforms.1.5.4.zip",
        "1.5.5": "https://downloads.wordpress.org/plugin/weforms.1.5.5.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/weforms.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/weforms.1.6.1.zip",
        "1.6.10": "https://downloads.wordpress.org/plugin/weforms.1.6.10.zip",
        "1.6.11": "https://downloads.wordpress.org/plugin/weforms.1.6.11.zip",
        "1.6.12": "https://downloads.wordpress.org/plugin/weforms.1.6.12.zip",
        "1.6.13": "https://downloads.wordpress.org/plugin/weforms.1.6.13.zip",
        "1.6.14": "https://downloads.wordpress.org/plugin/weforms.1.6.14.zip",
        "1.6.15": "https://downloads.wordpress.org/plugin/weforms.1.6.15.zip",
        "1.6.16": "https://downloads.wordpress.org/plugin/weforms.1.6.16.zip",
        "1.6.17": "https://downloads.wordpress.org/plugin/weforms.1.6.17.zip",
        "1.6.18": "https://downloads.wordpress.org/plugin/weforms.1.6.18.zip",
        "1.6.19": "https://downloads.wordpress.org/plugin/weforms.1.6.19.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/weforms.1.6.2.zip",
        "1.6.20": "https://downloads.wordpress.org/plugin/weforms.1.6.20.zip",
        "1.6.21": "https://downloads.wordpress.org/plugin/weforms.1.6.21.zip",
        "1.6.22": "https://downloads.wordpress.org/plugin/weforms.1.6.22.zip",
        "1.6.23": "https://downloads.wordpress.org/plugin/weforms.1.6.23.zip",
        "1.6.24": "https://downloads.wordpress.org/plugin/weforms.1.6.24.zip",
        "1.6.25": "https://downloads.wordpress.org/plugin/weforms.1.6.25.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/weforms.1.6.3.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/weforms.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/weforms.1.6.5.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/weforms.1.6.6.zip",
        "1.6.7": "https://downloads.wordpress.org/plugin/weforms.1.6.7.zip",
        "1.6.8": "https://downloads.wordpress.org/plugin/weforms.1.6.8.zip",
        "1.6.9": "https://downloads.wordpress.org/plugin/weforms.1.6.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/weforms.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/weforms/assets/banner-772x250.png?rev=2243402",
        "high": "https://ps.w.org/weforms/assets/banner-1544x500.png?rev=2243402"
    },
    "icons": {
        "1x": "https://ps.w.org/weforms/assets/icon-128x128.png?rev=1978687",
        "2x": "https://ps.w.org/weforms/assets/icon-256x256.png?rev=1978687"
    },
    "blocks": {
        "weforms/form": {
            "name": "weforms/form",
            "title": "weForms"
        }
    },
    "block_assets": [],
    "author_block_count": "1",
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "weforms",
            "language": "zh_CN",
            "version": "1.6.25",
            "updated": "2021-03-23 07:21:55",
            "package": "https://downloads.wordpress.org/translation/plugin/weforms/1.6.25/zh_CN.zip"
        }
    ]
}