{
    "name": "WhereUsed",
    "slug": "where-used",
    "version": "1.4.0",
    "author": "<a href=\"https://whereused.com/\">WhereUsed</a>",
    "author_profile": "https://profiles.wordpress.org/stevenayers63/",
    "contributors": {
        "stevenayers63": {
            "profile": "https://profiles.wordpress.org/stevenayers63/",
            "avatar": "https://secure.gravatar.com/avatar/5ca36dd1e33b8145a2c89d15e211ac43?s=96&d=monsterid&r=g",
            "display_name": "Steven Ayers"
        },
        "jdorner": {
            "profile": "https://profiles.wordpress.org/jdorner/",
            "avatar": "https://secure.gravatar.com/avatar/09356460a16f7fd4b957ef00d5ccad3b?s=96&d=monsterid&r=g",
            "display_name": "John Dorner"
        }
    },
    "requires": "5.3",
    "tested": "6.2.6",
    "requires_php": "7.4.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 1,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 1,
    "support_url": "https://wordpress.org/support/plugin/where-used/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 40,
    "downloaded": 1824,
    "last_updated": "2023-07-28 18:42:00",
    "added": "2022-07-13",
    "homepage": "https://wordpress.org/plugins/where-used/",
    "sections": {
        "description": "<p>Where used? This plugin helps you find usage of attachments, posts, links, blocks and more in all post types, taxonomy terms, post meta, user meta, and menus. This plugin is multisite compatible!</p>\n<h4>Items That Will Be Detected</h4>\n<ul>\n<li>images, attachments</li>\n<li>links</li>\n<li>Gutenberg custom blocks or reusable blocks</li>\n<li>iframes</li>\n<li>Shortcodes (coming soon)</li>\n</ul>\n<h4>Areas Where It Searches For The Items</h4>\n<ul>\n<li>posts, post meta (even custom post types)</li>\n<li>taxonomy terms, term meta</li>\n<li>users, user meta</li>\n<li>WordPress menus</li>\n<li>Redirection rules (if Redirection plugin is installed)</li>\n</ul>\n<h4>Discover Problems</h4>\n<ul>\n<li>Broken links ( 404 errors hurt SEO ranking)</li>\n<li>Redirects referenced (301, 302 etc.)</li>\n<li>Unused reusable blocks</li>\n</ul>\n<h4>Prevent You From Causing Problems</h4>\n<ul>\n<li>Know where something is referenced before you delete it and create broken links or broken functionality on your site</li>\n<li>Find where a reusable block is used before you delete the reusable block</li>\n<li>Find out where blocks are used before you uninstall a plugin that has custom blocks</li>\n<li>Know when the slug of your page has been accidentally redirected due to regex matching via Redirection plugin</li>\n</ul>\n<h3>IMPORTANT: This Plugin DOES NOT</h3>\n<ul>\n<li>Does not search theme&#8217;s code or any plugin&#8217;s code for hardcoded references</li>\n<li>Does not detect references or backlinks located on websites beyond the scope of your WordPress install.</li>\n<li>Does not search custom database tables</li>\n<li>WARNING: Does not find every existence of usage due to mentioned lines above and possibly some unforeseen scenarios. Please always be cautious when deleting posts and attachments. This plugin does it&#8217;s best to help you be more confident in deleting unused content and maintaining existing content.</li>\n</ul>\n<h3>Compatible With</h3>\n<ul>\n<li>Multisite Installations</li>\n<li><a href=\"https://roots.io/bedrock/\" rel=\"nofollow ugc\">Bedrock</a></li>\n<li><a href=\"https://wordpress.org/plugins/fix-alt-text/\" rel=\"ugc\">Fix Alt Text</a></li>\n<li><a href=\"https://wordpress.org/plugins/redirection/\" rel=\"ugc\">Redirection</a></li>\n<li><a href=\"https://wordpress.org/plugins/advanced-custom-fields/\" rel=\"ugc\">Advanced Custom Fields &#8211; ACF</a></li>\n<li><a href=\"https://github.com/humanmade/network-media-library\" rel=\"nofollow ugc\">Network Media Library</a></li>\n</ul>\n<h3>Recommended Plugins To Install</h3>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/redirection/\" rel=\"ugc\">Redirection</a> &#8211; WhereUsed is more powerful as a tool with the Redirection plugin. Certain features of WhereUsed are not available unless Redirection is installed.</li>\n<li><a href=\"https://wordpress.org/plugins/fix-alt-text/\" rel=\"ugc\">Fix Alt Text</a> &#8211; Like WhereUsed? You&#8217;ll love our other plugin, Fix Alt Text, which will help you manage your image alt text easier for better website SEO and accessibility.</li>\n</ul>\n<h3>Quick Setup Guides</h3>\n<h4>Single Site Setup</h4>\n<ol>\n<li>Install the WhereUsed plugin per instructions above and then activate it.</li>\n<li>Modify settings as need to ensure your entire site gets scanned properly. Adjust settings here: Admin &gt; Tools &gt; WhereUsed &gt; Settings</li>\n<li>Do an initial full scan on the bottom right of the Dashboard here: Admin &gt; Tools &gt; WhereUsed</li>\n<li>Once the scan is complete, you can review the Dashboard to discover detected broken links and redirects.</li>\n</ol>\n<h4>Multisite Setup</h4>\n<ol>\n<li>Install the WhereUsed plugin per the instructions above and activate the plugin for the entire network or go to each site individually in the network and activate the plugin.</li>\n<li>All sites will default to using the network settings (for convenience). This can be disabled on a per site basis in the network settings area. WP Admin &gt; Network Settings &gt; Settings &gt; WhereUsed</li>\n<li>Each site will need to be scanned so that all references are detected</li>\n<li>Multiple scans (full scan on each site) are prevented from running simultaneously to protect the server from getting too overwhelmed at one time.</li>\n<li>Once all scans have been run, you will be able to see all references on each site and all references between each site.</li>\n</ol>\n",
        "installation": "<ol>\n<li>\n<p>Navigate to the Plugin management area:</p>\n<ul>\n<li>Single Site: WP Admin &gt; Plugins</li>\n<li>Multisite: WP Admin &gt; Network Admin &gt; Plugins</li>\n</ul>\n</li>\n<li>\n<p>Click &#8220;Add New&#8221; button at the top of the Plugins page. A new page will load displaying an Upload button at the top and an area to search for plugins.</p>\n</li>\n<li>You can either manually upload a zip file of WhereUsed, or you can search for the plugin in the WordPress repository by searching for &#8220;WhereUsed&#8221;.</li>\n<li>Once you have installed the plugin, continue to the Quick Setup Guides below:</li>\n</ol>\n",
        "changelog": "<h4>Versions Key (Major.Minor.Patch)</h4>\n<ul>\n<li>Major &#8211; 1.x.x increase involves major changes to the visual or functional aspects of the plugin, or removing functionality that has been previously deprecated. (higher risk of breaking changes)</li>\n<li>Minor &#8211; x.1.x increase introduces new features, improvements to existing features, or introduces deprecations. (low risk of breaking changes)</li>\n<li>Patch &#8211; x.x.1 increase is a bug fix, security fix, or minor improvement and does not introduce new features. (non-breaking changes)</li>\n</ul>\n<h4>Upcoming Features</h4>\n<ul>\n<li>Detect shortcode usage</li>\n<li>Notify user of deprecated block usage</li>\n<li>Inline Link Editing</li>\n<li>Inline Anchor Text Editing</li>\n</ul>\n<h4>Version 1.4.0</h4>\n<p><em>Release Date &#8211; 28 Jul 2023</em></p>\n<ul>\n<li>Bug fix: custom db tables were not being removed when the plugin was deleted from the site.</li>\n<li>Bug Fix: custom db tables were not being created in various scenarios</li>\n<li>Bug Fix: Admin meta boxes displaying references were being shown on post types that were not getting scanned.</li>\n<li>Bug Fix: Cache entries in the options table were not being removed on deactivate or uninstallation of the plugin.</li>\n<li>Bug Fix: The status code updates on saving a post were running twice.</li>\n<li>Improvement: Updated the saving post process to separate the discovery scan and the status code update scan. Status update scan for the post is now queued and runs in the background to remove the saving delay.</li>\n<li>Improvement: Converted Helpers Library to be under the plugin&#8217;s namespace to prevent conflicts with other plugins using the same dependency</li>\n</ul>\n<h4>Version 1.3.4</h4>\n<p><em>Release Date &#8211; 13 Jul 2023</em></p>\n<ul>\n<li>Minor Improvement: Removed some code that was migrated into the Helpers Library</li>\n<li>Minor Improvement: Updated Helpers Library 1.5.0</li>\n</ul>\n<h4>Version 1.3.3</h4>\n<p><em>Release Date &#8211; 31 May 2023</em></p>\n<ul>\n<li>Bug Fix: When a redirect is updated, the reference is removed from the references table and not added back</li>\n<li>Bug Fix: When a post is saved, duplicate redirect rule references were getting created.</li>\n<li>Bug Fix: When you save a user or a term, the status codes cache is not removed from the database when the process is finished</li>\n<li>Bug Fix: The status code caching was using inconsistent making conventions which could lead to orphaned data in the options table</li>\n<li>Minor Improvement: Tested up to: 6.2.2</li>\n<li>Minor Improvement: Updated Helpers Library 1.4.1</li>\n</ul>\n<h4>Version 1.3.2</h4>\n<p><em>Release Date &#8211; 17 May 2023</em></p>\n<ul>\n<li>Bug Fix: After sending a post to the trash, references associated with the post still appear in References table</li>\n<li>Bug Fix: Attachment references were not getting removed from references table when deleted.</li>\n<li>Bug Fix: Blocks within blocks were not being detected accurately</li>\n<li>Minor Improvement: Added additional core blocks to ignore recording as references during a scan</li>\n</ul>\n<h4>Version 1.3.1</h4>\n<p><em>Release Date &#8211; 14 Apr 2023</em></p>\n<ul>\n<li>Bug Fix: When sanitizing URLs with spaces as %20 were being removed causing the URL to be incorrect.</li>\n<li>Security: Improved sanitation of data</li>\n<li>Minor Improvement: Updated Helpers Library 1.4.0</li>\n</ul>\n<h4>Version 1.3.0</h4>\n<p><em>Release Date &#8211; 05 Apr 2023</em></p>\n<ul>\n<li>Deprecation: Remove weekly cron frequency option in settings. All existing settings using weekly frequency will contiue to work as before.</li>\n<li>Bug Fix: Deprecated PHP notice &#8211; PHP 8.2 deprecated sending null to trim()</li>\n<li>Bug Fix: False positive: warning message appears requiring full scan needed when a status check scan pushes the latest full scan out of the history log due to a scan retention limitations.</li>\n<li>Bug Fix: PHP Fatal error occurred if mbstring non-default extension was not installed. Fallback implemented.</li>\n<li>Minor Improvement: Changed the default status check cron frequency value from weekly to monthly.</li>\n<li>Minor Improvement: Updated Helpers Library 1.3.7</li>\n<li>Minor Improvement: Tested up to: 6.2.0</li>\n</ul>\n<h4>Version 1.2.6</h4>\n<p><em>Release Date &#8211; 10 Mar 2023</em></p>\n<ul>\n<li>Bug Fix: The plugin directory constant values were incorrect if site_url() and admin_url() do not have the same HTTP protocol.</li>\n<li>Bug Fix: Prevent update of plugin if it is under local git control</li>\n<li>Minor Improvement: Updated Helpers Library 1.3.6</li>\n</ul>\n<h4>Version 1.2.5</h4>\n<p><em>Release Date &#8211; 9 Mar 2023</em></p>\n<ul>\n<li>Bug Fix: Fixed fatal error related to multisite installations. Issue occurs when a previous blog has been deleted and a new blog is created. The new blog&#8217;s IDs increments and no longer matches the assumed corresponding index within the full array of blogs.</li>\n<li>Bug Fix: The database tables were not getting created on plugin activation for a multisite.</li>\n<li>Minor Improvement: Updated Helpers Library 1.3.5</li>\n</ul>\n<h4>Version 1.2.4</h4>\n<p><em>Release Date &#8211; 29 Nov 2022</em></p>\n<ul>\n<li>Bug Fix: Scan duration details should not display 0 days, 0 hours, etc.</li>\n<li>Bug Fix: Scan stats &#8220;Total Posts Scanned&#8221; should say &#8220;Total Unique URLs Checked&#8221; for a check status scan</li>\n<li>Bug Fix: Scan is showing a message that a scan is needed when it is actually not</li>\n<li>Bug Fix: When cancelling a status-check, the action was marking a full scan as needed</li>\n<li>Bug Fix: Relative anchor URLs starting with a # were getting assigned the incorrect base URL</li>\n<li>Minor Improvement: Tested up to: 6.1.1</li>\n</ul>\n<h4>Version 1.2.3</h4>\n<p><em>Release Date &#8211; 09 Nov 2022</em></p>\n<ul>\n<li>Bug Fix: Migration script wasn&#8217;t single site compatible</li>\n<li>Bug Fix: Content that required authentication could not be scanned on single site installs. Worked on multisite.</li>\n<li>Bug Fix: When scan menus option changed in settings, the user was not being notified that a new scan was needed.</li>\n<li>Bug Fix: Some changes to network settings in a multisite were not notifying sites that they needed a new scan.</li>\n<li>Bug Fix: Headers sent prematurely when displaying admin notice if updating plugin while another plugin is using an older version of Helpers Library</li>\n<li>Bug Fix: Scans involving thousands of users, posts, or terms would run out of memory due to $wpdb caching</li>\n<li>Bug Fix: There was a rare possibility that a post gets queued and then the post is deleted before the background scan processes it, which could cause the progress bar to stall on the dashboard.</li>\n<li>Bug Fix: When a post was deleted, posts referencing that now deleted post were not getting rescanned.</li>\n<li>Bug Fix: Checking if the Redirection plugin was active and caching it was resulting in an incorrect value when switching blogs in multisite setup</li>\n<li>Bug Fix: Non URLs were not being removed from queue during status check cron, which would hang the scan</li>\n<li>Bug Fix: User could access unused attachment data when a full scan had not completed, giving incorrect information</li>\n<li>Bug Fix: User and WP Cron could start a status check even though a full scan had not completed</li>\n<li>Minor Improvement: Added warning message at the top of the Unused Attachments Table</li>\n<li>Minor Improvement: Updated Helpers Library dependency</li>\n<li>Minor Improvement: removed unused notify network sites setting and logic associated with it. In a multisite setup, all sites with the plugin active will get notified</li>\n<li>Minor Improvement: Tested up to: 6.1.0</li>\n</ul>\n<h4>Version 1.2.1</h4>\n<p><em>Release Date &#8211; 27 Oct 2022</em></p>\n<ul>\n<li>Bug Fix: Scans could not access pages that required user to be logged in to view</li>\n<li>Security: Removed usernames from the scan users queue file</li>\n</ul>\n<h4>Version 1.2.0</h4>\n<p><em>Release Date &#8211; 26 Oct 2022</em></p>\n<ul>\n<li>New Feature: Filter &#8220;whereused_excluded_post_types&#8221; has been added to allow modification of post types excluded from scans</li>\n<li>New Feature: Filter &#8220;whereused_excluded_taxonomies&#8221; has been added to allow modification of post types excluded from scans</li>\n<li>Improvement: Debug logging is more efficient</li>\n<li>Improvement: Scan was revised to now handle very large databases and use less resources</li>\n<li>Improvement: Updated recommended taxonomies and post types to scan. Please review your settings.</li>\n<li>Bug Fix: The plugin was initializing on the init hook, but activation hooks do not work on the init hook and were causing loading issues when plugin was activated.</li>\n<li>Bug Fix: Uninstall script fixed</li>\n<li>Bug Fix: Scan would run out of memory when trying to queue 400K posts</li>\n<li>Bug Fix: Post was not getting rescanned after it has been updated</li>\n<li>Security: Minor XSS Escaping within a user protected area</li>\n</ul>\n<h4>Version 1.1.7</h4>\n<p><em>Release Date &#8211; 20 Oct 2022</em></p>\n<ul>\n<li>Minor Improvement: Load debug logging sooner</li>\n<li>Bug Fix: Migration was not running to update the DB for better performance.</li>\n<li>Bug Fix: Referencing some incorrect constant variables</li>\n</ul>\n<h4>Version 1.1.6</h4>\n<p><em>Release Date &#8211; 18 Oct 2022</em></p>\n<ul>\n<li>Bug Fix: Could not start a new scan if a previous scan was interrupted by deactivating the plugin or some other unexpected action.</li>\n</ul>\n<h4>Version 1.1.5</h4>\n<p><em>Release Date &#8211; 18 Oct 2022</em></p>\n<ul>\n<li>Bug Fix: Uninstalling WhereUsed caused an error.</li>\n<li>Bug Fix: Migration script failed.</li>\n<li>Bug Fix: Fix error due to calling undefined class Admin</li>\n<li>Bug Fix: Fix error related to scope when calling Menu class</li>\n</ul>\n<h4>Version 1.1.0</h4>\n<p><em>Release Date &#8211; 18 Oct 2022</em></p>\n<ul>\n<li>New Feature: Debug area for troubleshooting scan issues. Debug mode must be turned on in settings before it will appear.</li>\n<li>New Feature: Added hook whereused_scan_meta to allow 3rd-party code to associate a custom field that contain a post ID to a post</li>\n<li>New Feature: Added hook whereused_scan_block to allow 3rd-party code to handle the scanning of a custom block</li>\n<li>New Feature: Filter &#8220;whereused_ignored_blocks&#8221; has been added to replace &#8220;WhereUsed/ignored_blocks&#8221;</li>\n<li>Improvement: DB tuned for better performance at scale</li>\n<li>Improvement: Updated Helpers_Library 1.1.0 dependency</li>\n<li>Improvement: Refactored admin template header and footer display logic</li>\n<li>Improvement: Updated logic in how we store scan history</li>\n<li>Improvement: Updated the scan progress bar to show what is being scanned and simplified status</li>\n<li>Minor Improvement: Added links to documentation on the dashboard</li>\n<li>Minor Improvement: Added links to documentation throughout the code</li>\n<li>Minor Improvement: Tested up to: 6.0.3</li>\n<li>Bug Fix: Admin notices were not displayed on an AJAX request.</li>\n<li>Bug Fix: Status Check was failing to fully run.</li>\n<li>Bug Fix: The Network Settings tab was not visible on the Settings page when accessed via AJAX and the tab was always visible if the settings page was access directly first</li>\n<li>Bug Fix: wp-admin references were hardcoded throughout the plugin making it incompatible with <a href=\"https://roots.io/bedrock/\" rel=\"nofollow ugc\">Bedrock</a></li>\n<li>Bug Fix: Redirection column was not visible when the plugin Redirection was not installed even though 301s were detected and needed to show destination.</li>\n<li>Deprecated: Filter &#8220;WhereUsed/detected_block&#8221;</li>\n<li>Deprecated: Filter &#8220;WhereUsed/ignored_blocks&#8221;</li>\n<li>Note: Increased Minimum WP Version to 5.3</li>\n</ul>\n<h4>Version 1.0.6</h4>\n<p><em>Release Date &#8211; 02 Sept 2022</em></p>\n<ul>\n<li>Minor Improvement: Added Notification to the user if a scan halted due to running out of memory</li>\n<li>Bug Fix: Status scan was running out of memory</li>\n<li>Bug Fix: Any notifications beyond 621 count cannot be marked as read</li>\n</ul>\n<h4>Version 1.0.5</h4>\n<p><em>Release Date &#8211; 1 Sept 2022</em></p>\n<ul>\n<li>Minor Improvement: Updated link to GPL license</li>\n<li>Bug Fix: Status check cron is running multiple times instead of once when scheduled due to caching</li>\n<li>Bug Fix: Status code scan scheduled cron shows all options in setting by default when saved as &#8220;No&#8221;</li>\n</ul>\n<h4>Version 1.0.4</h4>\n<p><em>Release Date &#8211; 1 Sept 2022</em></p>\n<ul>\n<li>Bug Fix: Removed double slashes in logo src as well as JS src</li>\n<li>Bug Fix: The taxonomy terms were not being rescanned after a term was updated</li>\n<li>Bug Fix: The taxonomy terms references were not getting removed from the scan index db table when the term was deleted</li>\n<li>Bug Fix: The user was not rescanned after the user profile was updated</li>\n<li>Bug Fix: The user references were not getting removed from the scan index db table when the user was deleted</li>\n</ul>\n<h4>Version 1.0.3</h4>\n<p><em>Release Date &#8211; 15 Jul 2022</em></p>\n<ul>\n<li>Bug Fix: In a multisite setup using Network Media Library plugin, attachments references detected as a featured image are missing title and additional information.</li>\n<li>Bug Fix: Turned off SSL verify when getting status codes for links so that it works on local environment URLs when snakeoil wildcard self-signed SSLs are used</li>\n<li>Bug Fix: Network settings were getting created in a single site environment</li>\n<li>Bug Fix: User could change scan settings during a running scan and cause the scan to lock up.</li>\n<li>Bug Fix: In a multisite setup, the user could not easily navigate to the network settings from the local site settings</li>\n<li>Security: Fixed an unescaped URL to prevent highly unlikely XSS</li>\n</ul>\n<h4>Version 1.0.2</h4>\n<p><em>Release Date &#8211; 13 Jul 2022</em></p>\n<ul>\n<li>Improvement: Converted CURL requests to use WP http-api</li>\n<li>Improvement: Updated ChartJS to version 3.8</li>\n<li>Minor Improvement: Updated plugin description that is visible in the plugin management area</li>\n<li>Bug Fix: The &#8220;References To This&#8221; link in the row actions in the table was incorrect.</li>\n<li>Security: Implemented some xss escaping</li>\n</ul>\n<h4>Version 1.0.1</h4>\n<p><em>Release Date &#8211; 12 Jul 2022</em></p>\n<ul>\n<li>Improvement: Added links to the settings and dashboard on the plugins management pages</li>\n<li>Minor Improvement: Updated license to GPLv3</li>\n<li>Minor Improvement: Increased minimum WordPress version to 5.1</li>\n</ul>\n<h4>Version 1.0.0</h4>\n<p><em>Release Date &#8211; 12 Jul 2022</em></p>\n<ul>\n<li>Initial Release</li>\n</ul>\n"
    },
    "short_description": "Where used? This plugin helps you find usage of attachments, posts, links, blocks and more in all post types, taxonomy terms, post meta, user meta, an &hellip;",
    "description": "<p>Where used? This plugin helps you find usage of attachments, posts, links, blocks and more in all post types, taxonomy terms, post meta, user meta, and menus. This plugin is multisite compatible!</p>\n<h4>Items That Will Be Detected</h4>\n<ul>\n<li>images, attachments</li>\n<li>links</li>\n<li>Gutenberg custom blocks or reusable blocks</li>\n<li>iframes</li>\n<li>Shortcodes (coming soon)</li>\n</ul>\n<h4>Areas Where It Searches For The Items</h4>\n<ul>\n<li>posts, post meta (even custom post types)</li>\n<li>taxonomy terms, term meta</li>\n<li>users, user meta</li>\n<li>WordPress menus</li>\n<li>Redirection rules (if Redirection plugin is installed)</li>\n</ul>\n<h4>Discover Problems</h4>\n<ul>\n<li>Broken links ( 404 errors hurt SEO ranking)</li>\n<li>Redirects referenced (301, 302 etc.)</li>\n<li>Unused reusable blocks</li>\n</ul>\n<h4>Prevent You From Causing Problems</h4>\n<ul>\n<li>Know where something is referenced before you delete it and create broken links or broken functionality on your site</li>\n<li>Find where a reusable block is used before you delete the reusable block</li>\n<li>Find out where blocks are used before you uninstall a plugin that has custom blocks</li>\n<li>Know when the slug of your page has been accidentally redirected due to regex matching via Redirection plugin</li>\n</ul>\n<h3>IMPORTANT: This Plugin DOES NOT</h3>\n<ul>\n<li>Does not search theme&#8217;s code or any plugin&#8217;s code for hardcoded references</li>\n<li>Does not detect references or backlinks located on websites beyond the scope of your WordPress install.</li>\n<li>Does not search custom database tables</li>\n<li>WARNING: Does not find every existence of usage due to mentioned lines above and possibly some unforeseen scenarios. Please always be cautious when deleting posts and attachments. This plugin does it&#8217;s best to help you be more confident in deleting unused content and maintaining existing content.</li>\n</ul>\n<h3>Compatible With</h3>\n<ul>\n<li>Multisite Installations</li>\n<li><a href=\"https://roots.io/bedrock/\" rel=\"nofollow ugc\">Bedrock</a></li>\n<li><a href=\"https://wordpress.org/plugins/fix-alt-text/\" rel=\"ugc\">Fix Alt Text</a></li>\n<li><a href=\"https://wordpress.org/plugins/redirection/\" rel=\"ugc\">Redirection</a></li>\n<li><a href=\"https://wordpress.org/plugins/advanced-custom-fields/\" rel=\"ugc\">Advanced Custom Fields &#8211; ACF</a></li>\n<li><a href=\"https://github.com/humanmade/network-media-library\" rel=\"nofollow ugc\">Network Media Library</a></li>\n</ul>\n<h3>Recommended Plugins To Install</h3>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/redirection/\" rel=\"ugc\">Redirection</a> &#8211; WhereUsed is more powerful as a tool with the Redirection plugin. Certain features of WhereUsed are not available unless Redirection is installed.</li>\n<li><a href=\"https://wordpress.org/plugins/fix-alt-text/\" rel=\"ugc\">Fix Alt Text</a> &#8211; Like WhereUsed? You&#8217;ll love our other plugin, Fix Alt Text, which will help you manage your image alt text easier for better website SEO and accessibility.</li>\n</ul>\n<h3>Quick Setup Guides</h3>\n<h4>Single Site Setup</h4>\n<ol>\n<li>Install the WhereUsed plugin per instructions above and then activate it.</li>\n<li>Modify settings as need to ensure your entire site gets scanned properly. Adjust settings here: Admin &gt; Tools &gt; WhereUsed &gt; Settings</li>\n<li>Do an initial full scan on the bottom right of the Dashboard here: Admin &gt; Tools &gt; WhereUsed</li>\n<li>Once the scan is complete, you can review the Dashboard to discover detected broken links and redirects.</li>\n</ol>\n<h4>Multisite Setup</h4>\n<ol>\n<li>Install the WhereUsed plugin per the instructions above and activate the plugin for the entire network or go to each site individually in the network and activate the plugin.</li>\n<li>All sites will default to using the network settings (for convenience). This can be disabled on a per site basis in the network settings area. WP Admin &gt; Network Settings &gt; Settings &gt; WhereUsed</li>\n<li>Each site will need to be scanned so that all references are detected</li>\n<li>Multiple scans (full scan on each site) are prevented from running simultaneously to protect the server from getting too overwhelmed at one time.</li>\n<li>Once all scans have been run, you will be able to see all references on each site and all references between each site.</li>\n</ol>\n",
    "download_link": "https://downloads.wordpress.org/plugin/where-used.1.4.0.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/where-used/trunk/screenshot-1.png?rev=2944769",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/where-used/trunk/screenshot-2.png?rev=2944769",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/where-used/trunk/screenshot-3.png?rev=2944769",
            "caption": ""
        }
    ],
    "tags": {
        "broken-images": "broken images",
        "broken-links": "broken links",
        "redirect": "redirect",
        "seo": "seo",
        "where-used": "where used"
    },
    "stable_tag": "1.4.0",
    "versions": {
        "1.0.2": "https://downloads.wordpress.org/plugin/where-used.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/where-used.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/where-used.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/where-used.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/where-used.1.0.6.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/where-used.1.1.0.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/where-used.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/where-used.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/where-used.1.1.7.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/where-used.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/where-used.1.2.1.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/where-used.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/where-used.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/where-used.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/where-used.1.2.6.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/where-used.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/where-used.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/where-used.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/where-used.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/where-used.1.3.4.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/where-used.1.4.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/where-used.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/where-used/assets/icon.svg?rev=2758679",
        "svg": "https://ps.w.org/where-used/assets/icon.svg?rev=2758679"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}