{
    "name": "Whols &#8211; Wholesale Prices and B2B Store Solution for WooCommerce",
    "slug": "whols",
    "version": "1.3.7",
    "author": "<a href=\"https://hasthemes.com\">HasThemes</a>",
    "author_profile": "https://profiles.wordpress.org/htplugins/",
    "contributors": {
        "htplugins": {
            "profile": "https://profiles.wordpress.org/htplugins/",
            "avatar": "https://secure.gravatar.com/avatar/c7c8a9cf1910e24386e077013ccbd260?s=96&d=monsterid&r=g",
            "display_name": "HT Plugins"
        },
        "alberuni-azad": {
            "profile": "https://profiles.wordpress.org/alberuni-azad/",
            "avatar": "https://secure.gravatar.com/avatar/983041284e9b988f3cdabace6dce1f5f?s=96&d=monsterid&r=g",
            "display_name": "Alberuni Azad."
        },
        "aslamhasib": {
            "profile": "https://profiles.wordpress.org/aslamhasib/",
            "avatar": "https://secure.gravatar.com/avatar/1edee2d43268eb35c68a09a01f77c90f?s=96&d=monsterid&r=g",
            "display_name": "Aslam Hasib"
        },
        "zenaulislam": {
            "profile": "https://profiles.wordpress.org/zenaulislam/",
            "avatar": "https://secure.gravatar.com/avatar/c69c192ed037f0ecb74348a2bd06bdda?s=96&d=monsterid&r=g",
            "display_name": "Zenaul Islam"
        },
        "tarekht": {
            "profile": "https://profiles.wordpress.org/tarekht/",
            "avatar": "https://secure.gravatar.com/avatar/781d3e5bf0e40ed19369ba7c50b173c0?s=96&d=monsterid&r=g",
            "display_name": "Tarek Aziz"
        }
    },
    "requires": "4.0",
    "tested": "6.6.1",
    "requires_php": "5.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 9,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 9,
    "support_url": "https://wordpress.org/support/plugin/whols/",
    "support_threads": 1,
    "support_threads_resolved": 1,
    "active_installs": 1000,
    "downloaded": 37676,
    "last_updated": "2024-08-22 11:25:00",
    "added": "2021-02-13",
    "homepage": "https://wpwhols.com/",
    "sections": {
        "description": "<p>Whols &#8211; WooCommerce Wholesale plugin is a powerful solution for WooCommerce B2B Store. It is a b2b WordPress plugin that helps you turn your WooCommerce store into a fully functioning B2B or B2B + B2C hybrid store. WooCommerce Wholesale plugin comes with all the features and functionalities you need to run a successful WooCommerce B2B store. Easily manage your products, pricing, orders, and shipping with WooCommerce Wholesale plugin.</p>\n<p>WooCommerce Wholesale plugin is a powerful solution for WooCommerce B2B Store. It is a b2b WordPress plugin that helps you turn your WooCommerce store (wholesale products WooCommerce) into a fully functioning B2B or B2B + B2C hybrid store. WooCommerce Wholesale plugin comes with all the features and functionalities you need to run a successful WooCommerce B2B store, like Bulk Buyer Discount etc.. Easily manage your products, pricing, orders, and shipping with WooCommerce Wholesale plugin. It is the best alternative for Wholesale Suite and B2BKing. Try WooCommerce Wholesale plugin today and see how easy it is to run a successful WooCommerce B2B store.</p>\n<p>Whols is an outstanding WordPress plugin for WooCommerce that allows store owners to set wholesale prices WooCommerce (wholesale WooCommerce) for the products of their online stores. This plugin enables you to show special wholesale prices to the wholesaler. Users can easily request to become a wholesale customer by filling out a simple online registration form. Once the registration is complete, the owner of the store will be able to review the request and approve the request either manually or automatically.</p>\n<p>Whols plugin reduces the hassle to create multiple stores for both the consumers and the wholesalers. By utilizing the functionality of this amazing plugin, you can easily maintain both the consumers and the wholesalers from a single store.</p>\n<p><a href=\"https://theplugindemo.com/whols/demo/create-sandbox/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/whols/doc/free/\" rel=\"nofollow ugc\">Documentation</a> | <a href=\"https://wpwhols.com/pricing/\" rel=\"nofollow ugc\">Purchase Pro</a> | <a href=\"https://hasthemes.com/contact-us/\" rel=\"nofollow ugc\">Contact Us</a></p>\n<h3>Whols &#8211; WooCommerce Wholesale Prices and WooCommerce B2B Store Plugin Free Features:</h3>\n<ul>\n<li>Admin can assign a wholesaler registration form (New)</li>\n<li>Wholesaler registration form shortcode can also be cused instead of assigning a page</li>\n<li>Customize registration form fields without coding / Visually (New )</li>\n<li>Ability to adding custom / additional field into the registration form using filter hook</li>\n<li>Customer can request to become a wholesale customer</li>\n<li>Admin can manage the wholesaler request manually OR Auto approve can be set</li>\n<li>Asign wholesale role for existing customers</li>\n<li>Apply wholesale prices globally</li>\n<li>Add flat/percent amount price on wholesale products</li>\n<li>Easily set wholesale prices on Simple or Variable products</li>\n<li>Add wholesale prices to each variation of a variable products</li>\n<li>Option to enable minimum product to buy</li>\n<li>Shows wholesale pricing info on shop page as well as product detail page</li>\n<li>Show/Hide the retailer price from wholesale customers</li>\n<li>Customers having wholesale role assigned can buy products at wholesale price</li>\n<li>Customize the text on the frontend labels (Retailer Price Text, Wholesaler Price Text &amp; Save Amount Text Label)</li>\n<li>Display the amount that the customer will save after purchase</li>\n<li>Allow free shipping for wholesalers</li>\n<li>Disable coupon codes for wholesale customers so only retailers can use them</li>\n<li>Hide wholesale prices for guest user</li>\n<li>Hide &#8220;Wholesale Only&#8221; Products From Other Customers</li>\n<li>Hide General Products From Wholesalers</li>\n<li>Wholesale prices are only visible to customers with “Wholesaler” role</li>\n<li>Registration successful message customization</li>\n<li>Redirect to specific page after completed registration</li>\n<li>Redirect to specific page when customer login as a wholesaler</li>\n<li>Hide price for guest users (Login to see price)</li>\n<li>Email Notification (Registration)</li>\n<li>Design Customizations</li>\n<li>Exclude Tax for Wholesale users</li>\n<li>Easy to use backend interface</li>\n<li>Compatible with WPML</li>\n<li>Compatible with Polylang</li>\n<li>No coding required</li>\n</ul>\n<h3>Whols Premium Features:</h3>\n<p>✓ Registered form fields manager,editor<br />\n✓ Ability to adding custom / additional field into the registration form Visually / Without coding<br />\n✓ Option to use the WooCommerce billing fields into the Wholesaler registration form<br />\n✓ Create &amp; manage unlimited user role<br />\n✓ Wholesaler request management (Approve / Reject)<br />\n✓ Give different pricing to different wholesaler role<br />\n✓ Payment methods (gateway) control<br />\n✓ Different prices for different users<br />\n✓ Category wise product price set<br />\n✓ Category wise product price set for different roles<br />\n✓ Restrict wholesale store access<br />\n✓ Set default wholesaler role for wholesale registration<br />\n✓ Enable website access restriction (Entire Website / Only Shop)<br />\n✓ Whole can access the Entire Website / Shop (Loged In Users/Loged In Users With Wholesale Role)<br />\n✓ Role wise disable payment method<br />\n✓ Role wise enable free shipping<br />\n✓ Email Notification (Registration, Wholesaler Approve &amp; Rejection)</p>\n<h3>Video Overview:</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/OArnKMljqWs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Video Tutorial:</h3>\n<h4>How to install Whols plugin and complete the basic setup</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/4tUrWsNz3TE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>How to add a wholesaler registration form &amp; approve role for wholesaler</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8eI5k3xgok4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>How to set wholesale prices for different categories</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/inzemTs1SCY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>How to hide wholesale prices for guest users</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/aywuQpKFdF4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>How to Enable Free Shipping For Wholesale Customers</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/e4P9nCNGDJQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>How To Set Different Price For Different Wholesale Customers</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/cDw4GGuHYyw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Feature Details:</h3>\n<h4>Wholesaler registration form shortcode</h4>\n<p>The Wholesaler Registration Form shortcode allows you to add a form to your WooCommerce wholesale site. This form is dedicated to B2B customers who want to register for an account. The shortcode provides an easy way for customers to fill out their information and submit it for approval. The wholesaler registration form includes fields for the customer&#8217;s name, company, email, phone number, and website. It also has a field for the customer&#8217;s desired username and password. After the customer submits the form, they will receive an email about their registration. Once their account is confirmed, they will be able to log in and eligible for buying wholesale products. By using the Wholesaler Registration Form shortcode, you can make it easy for B2B customers to create an account on your wholesale site.</p>\n<h4>Ability to add custom / additional field into the registration form</h4>\n<p>Whols WooCommerce Wholesale plugin provides the ability to add custom / additional fields to the registration form. This helps to ensure that all essential information is captured when a new wholesale customer registers on your site. This flexibility ensures that you can capture all the information you need from your wholesale customers, without making the registration process overly complex.</p>\n<h4>Customers can request to become a wholesale customer</h4>\n<p>WooCommerce Wholesale is a great way to get started with wholesaling. Customers can create an account and then browse through the products available. Once they find a product they&#8217;re interested in, they can contact you and request to become a wholesale customer. And because WooCommerce is such a popular platform, you&#8217;ll be able to easily find buyers who are willing to work with you. So if you&#8217;re interested in starting a wholesale business, WooCommerce Wholesale is a great option.</p>\n<h4>Admin can manage the wholesaler request manually OR Auto approve can be set</h4>\n<p>WooCommerce Wholesale is a powerful plugin that allows admins to manage wholesale requests manually or set them to auto-approve. This can be a great time-saver for busy admins, and it ensures that all wholesale requests are handled in a timely and professional manner.</p>\n<h4>Assign wholesale role for existing customers</h4>\n<p>This WooCommerce Wholesale is a great way to assign existing customers a wholesale role. By doing this, you&#8217;ll be able to give them access to special pricing, products, and ordering features that are only available to wholesalers. Once you&#8217;ve done this, they&#8217;ll be able to log in and access all of the features that are available to WooCommerce wholesalers. So if you&#8217;re looking for a way to give your existing customers access to special pricing and ordering features, Whols WooCommerce Wholesale is the perfect solution.</p>\n<h4>Apply wholesale prices globally</h4>\n<p>Whols WooCommerce Wholesale plugin is a great way to get started with selling online. It&#8217;s an easy, fast, and secure way to set up an online store. And because WooCommerce is built on WordPress, it&#8217;s easy to scale as your business grows. WooCommerce Wholesale makes it easy to apply wholesale prices globally. Simply install WooCommerce and Whols WooCommerce Wholesale plugin, add your products, and set your prices. That&#8217;s it! Whols WooCommerce Wholesale takes care of the rest. With WooCommerce Wholesale, you can sell online with confidence knowing that your prices are fair and competitive. So why wait? Get started today! Whols WooCommerce Wholesale &#8211; Apply wholesale prices globally!</p>\n<h4>Add flat/percent amount price on wholesale products</h4>\n<p>Whols WooCommerce Wholesale plugin will add a flat or percent amount price to wholesale products. You can either set up WooCommerce Wholesale to charge a flat rate for all wholesale products, or you can add a percent markup over the cost of the product. WooCommerce Wholesale is a powerful tool that gives you the ability to easily add price markups to your wholesale products. With WooCommerce Wholesale, there is no need to manually adjust prices for each product; WooCommerce Wholesale does the work for you. With WooCommerce Wholesale, you can focus on running your business, not on adjusting prices.</p>\n<h4>Easily set wholesale prices on Simple or Variable products</h4>\n<p>WooCommerce Wholesale is a great way to sell products at wholesale prices. It allows you to easily set wholesale prices on Simple or Variable products. You can also use WooCommerce Wholesale to manage your inventory, set minimum order quantities, and offer discounts to your wholesale customers. WooCommerce Wholesale is a powerful tool that can help you increase sales and grow your business.</p>\n<h4>Add wholesale prices to each variation of a variable products</h4>\n<p>Whols WooCommerce Wholesale plugin offers the ability to add wholesale prices to each variation of a variable product. This ensures that your wholesale customers always see the correct pricing for their orders, and it makes it easy for you to manage your inventory. WooCommerce Wholesale makes it easy to manage your inventory and ensure that your wholesale customers always see the correct pricing.</p>\n<h4>Option to enable minimum product to buy</h4>\n<p>WooCommerce Wholesale is a great way to sell products in bulk. One of the great features of WooCommerce Wholesale is the ability to enable a minimum product to buy. This setting is located in the settings area. By default, the minimum product to buy is set to 1. This means that customers can only buy 1 of each product. However, you can change this setting to any number you like. For example, you could set the minimum product to buy to 10. This would mean that customers would need to buy 10 of each product. WooCommerce Wholesale is a great way to sell products in bulk. The ability to enable a minimum product to buy is a great feature that can help you sell more products.</p>\n<h4>Shows wholesale pricing info on shop page as well as product detail page</h4>\n<p>If you&#8217;re running a WooCommerce store, you might be interested in WooCommerce Wholesale, which allows you to show wholesale pricing information on your shop page as well as your product detail page. This can be a great way to attract new customers and get them interested in buying from you. Whols WooCommerce Wholesale plugin is easy to set up and use, and it&#8217;s a great way to take advantage of WooCommerce&#8217;s powerful features. If you&#8217;re looking for a way to show wholesale pricing information on your WooCommerce store, this WooCommerce Wholesale plugin is a great option.</p>\n<h4>Show/Hide the retailer price from wholesale customers</h4>\n<p>WooCommerce Wholesale is a great way to sell products at a discounted price to wholesale customers. By default, WooCommerce will show the regular retail price to all customers, regardless of whether they are wholesale customers or not. However, you can choose to hide the retail price from wholesale customers if you wish. To do this, simply go to the Whols WooCommerce Wholesale Settings page and check the box next to &#8220;Hide retail pricing from wholesale customers.&#8221; Once you have done this, wholesale customers will only see the discounted price when they are logged in to their account. This is a great way to ensure that only wholesale customers are able to see the discounted prices.</p>\n<h4>Customers having wholesale role assigned can buy products at wholesale price</h4>\n<p>WooCommerce Wholesale customers can buy products at wholesale price if they have the WooCommerce Wholesale role assigned. WooCommerce Wholesale is an eCommerce plugin for WordPress that allows customers to buy products at wholesale prices. The WooCommerce Wholesale plugin is available for free from the WordPress Plugin Directory. WooCommerce Wholesale customers can also buy products from WooCommerce Wholesale dealers. WooCommerce Wholesale dealers are businesses that sell WooCommerce Wholesale products to WooCommerce Wholesale customers.</p>\n<h4>Customize the text on the frontend labels (Retailer Price Text, Wholesaler Price Text &amp; Save Amount Text Label)</h4>\n<p>WooCommerce Wholesale allows you to customize the text on the frontend labels for Retailer Price, Wholesaler Price, and Save Amount. This can be useful if you want to change the wording to better suit your specific products or target audience. For example, you could change the Retailer Price label to &#8220;MSRP&#8221; or &#8220;Recommended Retail Price&#8221; to make it clearer to customers what the price represents. Alternatively, you could change the Wholesaler Price label to &#8220;Bulk Price&#8221; or &#8220;Discounted Price&#8221; to emphasize the savings that are available. Whatever text you choose, WooCommerce Wholesale makes it easy to update the frontend labels to match your desired branding.</p>\n<h4>Display the amount that the customer will save after the purchase</h4>\n<p>Whole WooCommerce Wholesale plugin will display the amount that the customer will save after the purchase in the WooCommerce Cart and Checkout pages. The customer will see the WooCommerce Wholesale &#8220;Your Savings&#8221; message and the total savings amount. The WooCommerce Wholesale message and savings amount will be displayed in the same format as other WooCommerce messages. Whole WooCommerce Wholesale plugin is a great way to increase customer loyalty and satisfaction.</p>\n<h4>Allow free shipping for wholesalers</h4>\n<p>Whole WooCommerce Wholesale plugin offers a suite of powerful tools to help you run your wholesale business. With WooCommerce Wholesale, you can offer free shipping to your wholesale customers. This can help you attract new customers and encourage existing customers to place larger orders. Whols WooCommerce Wholesale plugin also offers discounts and bulk pricing options, so you can offer your wholesale customers even more savings. By offering free shipping and other benefits, WooCommerce Wholesale makes it easy to build a successful wholesale business.</p>\n<h4>Disable coupon codes for wholesale customers so only retailers can use them</h4>\n<p>Whols WooCommerce Wholesale is a great plugin for WooCommerce that allows you to set up a wholesale store. One of the features of the plugin is the ability to create coupon codes that can be used by wholesale customers. However, there is an option to disable this feature so that only retail customers can use the coupon codes. This can be useful if you want to restrict the use of coupons to only retail customers. By disabling the coupons for wholesale customers, you can help ensure  &hellip;</p>\n",
        "installation": "<p>This section describes how to install the &#8220;Whols&#8221; plugin and get it working.</p>\n<h4>1) Install</h4>\n<p>i. Go to the WordPress Dashboard &#8220;Add New Plugin&#8221; section.</p>\n<p>ii. Search For &#8220;Whols&#8221;.</p>\n<p>iii. Install, then Activate it.</p>\n<h4>OR:</h4>\n<p>i. Unzip (if it is zipped) and Upload <code>whols</code> folder to the <code>/wp-content/plugins/</code> directory</p>\n<p>ii. Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</p>\n<h4>2) Configure</h4>\n<p>i. After install and activate the plugin you will get a notice to install WooCommerce Plugin ( If allready have it then do not show any notice. ).</p>\n<p>ii. A new menu called &#8220;Whols&#8221; will be appear in your dashboard below the &#8220;Products&#8221; menu</p>\n<p>iv. Use the options &amp; configure as your need and that&#8217;s all!</p>\n",
        "faq": "\n<dt id='if%20a%20b2c%20site%20adds%20whols%2C%20will%20it%20negatively%20impact%20its%20current%20customers%3F'>\nIf a B2C site adds Whols, will it negatively impact its current customers?\n</h4>\n<p>\n<p>No, not at all. You can offer separate pricing to your wholesale customers without affecting the retail prices of your products.</p>\n</p>\n<dt id='how%20much%20do%20whols%20cost%3F'>\nHow much do Whols cost?\n</h4>\n<p>\n<p>Whols is a free WooCommerce plugin. However, if you need more features, we offer a premium version, which can be checked on our website <a href=\"https://wpwhols.com/\" rel=\"nofollow ugc\">wpwhols.com</a></p>\n</p>\n<dt id='can%20it%20support%20sites%20that%20are%20both%20b2b%20and%20b2c%3F'>\nCan it support sites that are both B2B and B2C?\n</h4>\n<p>\n<p>Yes, Whols is perfect for both types of businesses. You can offer separate pricing to your wholesale customers without affecting the retail prices of your products.</p>\n</p>\n<dt id='what%20if%20i%20need%20help%3F'>\nWhat if I need help?\n</h4>\n<p>\n<p>We offer excellent support for all our users. You can contact us through our website or directly through the plugin&#8217;s support forum. We&#8217;ll be more than happy to help you out!</p>\n</p>\n<dt id='can%20i%20hide%20prices%20for%20logged%20out%20users%3F'>\nCan I hide prices for logged out users?\n</h4>\n<p>\n<p>Yes, you can hide prices for logged out users if you wish. Whols gives you full control over who sees your wholesale prices.</p>\n</p>\n<dt id='do%20i%20need%20to%20create%20a%20separate%20account%20for%20my%20wholesale%20customers%3F'>\nDo I need to create a separate account for my wholesale customers?\n</h4>\n<p>\n<p>No, you don&#8217;t need to create separate accounts for your wholesale customers. They can use the same account they use for your retail store. However, if you want, you can create separate accounts for them.</p>\n</p>\n<dt id='can%20i%20offer%20discounts%20to%20my%20wholesale%20customers%3F'>\nCan I offer discounts to my wholesale customers?\n</h4>\n<p>\n<p>Yes, you can offer discounts to your wholesale customers. Whols gives you full control over your pricing, so you can offer discounts as you see fit.</p>\n</p>\n<dt id='can%20i%20set%20a%20minimum%20order%3F'>\nCan I set a minimum order?\n</h4>\n<p>\n<p>Yes, you can set a minimum order amount in Whols. This is a great way to ensure that your wholesale customers are serious about buying from you.</p>\n</p>\n<dt id='can%20i%20offer%20different%20shipping%20rates%20for%20my%20wholesale%20customers%3F'>\nCan I offer different shipping rates for my wholesale customers?\n</h4>\n<p>\n<p>Yes, you can offer different shipping rates for your wholesale customers. Whols gives you full control over your shipping</p>\n</p>\n<dt id='can%20i%20set%20customer-specific%20pricing%3F'>\nCan I set customer-specific pricing?\n</h4>\n<p>\n<p>Yes, you can set customer-specific pricing in Whols. This is a great way to offer discounts to your best customers.</p>\n</p>\n<dt id='do%20i%20need%20to%20install%20any%20other%20plugins%3F'>\nDo I need to install any other plugins?\n</h4>\n<p>\n<p>No, you don&#8217;t need to install any other plugins. Whols is a complete solution for setting up a WooCommerce wholesale store. However, if you need additional features, we offer a premium version of the plugin.</p>\n</p>\n<dt id='i%27m%20having%20problems%20with%20the%20plugin.%20what%20can%20i%20do%3F'>\nI&#8217;m having problems with the plugin. What can I do?\n</h4>\n<p>\n<p>If you&#8217;re having problems with the plugin, first check the documentation. If you can&#8217;t find a solution there, contact us and we&#8217;ll be happy to help you out.</p>\n</p>\n<dt id='can%20i%20hide%20some%20products%20completely%20for%20some%20users%3F'>\nCan I hide some products completely for some users?\n</h4>\n<p>\n<p>Yes, you can hide products completely for certain users. This is a great way to keep your catalog tidy and organized.</p>\n</p>\n<dt id='does%20the%20plugin%20conflict%20with%20other%20woocommerce%20plugins%3F'>\nDoes the plugin conflict with other WooCommerce Plugins?\n</h4>\n<p>\n<p>No, We have run a compatibility test with the most popular WooCommerce plugins and found that it does not conflict. However, if you stiill encounter any difficulty, feel free to contact us. We checked the compatibility with a number of popular plugins like: WooCommerce Stripe Payment Gateway, WooCommerce PayPal Payments, WooCommerce Payments, WooCommerce PDF Invoices &amp; Packing Slips, WooCommerce Shipping &amp; Tax, Mailchimp for WooCommerce, Facebook for WooCommerce, WooCommerce Google Analytics Integration, Variation Swatches for WooCommerce, Customer Reviews for WooCommerce, Payment Plugins for Stripe WooCommerce, WooCommerce ShipStation Integration, Booster for WooCommerce, Checkout Field Editor (Checkout Manager) for WooCommerce, Advanced Shipment Tracking for WooCommerce, Royal Elementor Addons (Header Footer Builder, Popups, Post Grid, Woocommerce Product Grid, Slider, Parallax Image, Free Elementor Widgets &amp; Elementor Templates. Elementor WooCommerce Builder), Premium Addons for Elementor (Blog Post Grid, Mega Menu Builder, WooCommerce Products Grid, Carousel, Free Elementor Templates), TI WooCommerce Wishlist, FiboSearch – Ajax Search for WooCommerce, WooCommerce Cart Abandonment Recovery, WooCommerce Checkout &amp; Funnel Builder by CartFlows – Create High Converting Stores For WooCommerce, Checkout Field Manager (Checkout Manager) for WooCommerce, Advanced Order Export For WooCommerce, WooCommerce Blocks, WooCommerce Admin, YITH WooCommerce Wishlist, Table Rate Shipping Method for WooCommerce by Flexible Shipping, Variation Swatches for WooCommerce by CartFlows, Product Import Export for WooCommerce, WOOF – Products Filter for WooCommerce, Kadence WooCommerce Email Designer, Creative Mail – Easier WordPress &amp; WooCommerce Email Marketing, Pixel Manager for WooCommerce – Track Google Analytics, Google Ads, Facebook and more, Mollie Payments for WooCommerce, WooCommerce PayPal Checkout Payment Gateway.</p>\n</p>\n<dt id='my%20question%20isn%27t%20listed%20here.%20where%20can%20i%20get%20help%3F'>\nMy question isn&#8217;t listed here. Where can I get help?\n</h4>\n<p>\n<p>If you can&#8217;t find an answer to your question here, contact us and we&#8217;ll be happy to help you out.</p>\n</p>\n\n",
        "changelog": "<h4>Version: 1.3.7 -Date: 22 Aug 2024</h4>\n<ul>\n<li>Fixed: Price ranges for variable products showed the dummy maximum price</li>\n</ul>\n<h4>Version: 1.3.6 -Date: 11 Aug 2024</h4>\n<ul>\n<li>Added: Compatibility with Fibosearch plugin</li>\n<li>Updated: 3rd party libraries for latest PHP version compatibility</li>\n</ul>\n<h4>Version: 1.3.5 -Date: 14 Jul 2024</h4>\n<ul>\n<li>Fixed: Variation price issue in the admin Column</li>\n<li>Compatibility: Test With latest WordPress version</li>\n</ul>\n<h4>Version: 1.3.4 -Date: 13 Jun 2024</h4>\n<ul>\n<li>Fixed: undefined property of ID into the_content hook issue</li>\n</ul>\n<h4>Version: 1.3.3 -Date: 09 Jun 2024</h4>\n<ul>\n<li>Fixed: undefined array key issue for minimum quantity</li>\n</ul>\n<h4>Version: 1.3.2 -Date: 28 May 2024</h4>\n<ul>\n<li>Fixed: Registration form submission doesn&#8217;t work with FSE theme</li>\n</ul>\n<h4>Version: 1.3.1 &#8211;Date:  24 Mar 2024</h4>\n<ul>\n<li>Added: Data from the registration form can be viewed from the approve/reject wholesaler screen</li>\n<li>Tweak: Redirect to the plugins settings after activate the plugin</li>\n<li>Tweak: Product visibility settings improved</li>\n</ul>\n<h4>Version: 1.3.0 &#8211;Date:  18 Jan 2024</h4>\n<ul>\n<li>Fixed: Variation product&#8217;s price doesn&#8217;t update on cart page while qty is set to 0/1</li>\n</ul>\n<h4>Version: 1.2.9 &#8211;Date:  14 Dec 2023</h4>\n<ul>\n<li>Added: Compatibility with WPML and Polylang</li>\n</ul>\n<h4>Version: 1.2.8 &#8211;Date:  6 Nov 2023</h4>\n<ul>\n<li>Tweak: wholesale_priced meta key name changed to _wholesale_priced</li>\n<li>Added: whols_show_wholesale_status_in_item_data filter hook </li>\n</ul>\n<h4>Version: 1.2.7 &#8211;Date:  19 Jun 2023</h4>\n<ul>\n<li>Fixed: Fatal error issue on the cart page</li>\n</ul>\n<h4>Version: 1.2.6 &#8211;Date: 29 Apr 2023</h4>\n<ul>\n<li>Added: Option to change minimum quantity notice text</li>\n</ul>\n<h4>Version: 1.2.5 &#8211;Date: 22 Mar 2023</h4>\n<ul>\n<li>Fixed: Decimal pricing issue when product has a price less than 1</li>\n</ul>\n<h4>Version: 1.2.4 &#8211;Date: 12 Mar 2023</h4>\n<ul>\n<li>Tweak: Added scroll to notice for registration form</li>\n<li>Fixed: Warning on wholesaler request page</li>\n<li>Added: wpautop support for sending emails</li>\n</ul>\n<h4>Version: 1.2.3 &#8211;Date: 13 Dec 2022</h4>\n<ul>\n<li>Fixed: Admin Column price were showing wrong for percentage price.</li>\n<li>Fixed: Wholesaler price were shwoing 00 for free product or the product that doesn&#8217;t have any price.</li>\n<li>Fixed: Conflict with Justtables plugin.</li>\n<li>Fixed: Notice showing issue while updating default wholesale role.</li>\n<li>Added: Test mode feature.</li>\n<li>Added: Option to customize thank you message for wholesalers.</li>\n<li>Added: Show wholesale_priced meta in order edit / details page.</li>\n</ul>\n<h4>Version: 1.2.2 &#8211;Date:  02 Nov 2022</h4>\n<ul>\n<li>Fixed: Undefined variable $fields</li>\n<li>Fixed: Price shows 0 for variable product while price value is empty from the global pricing.</li>\n</ul>\n<h4>Version: 1.2.1 &#8211;Date: 10 Oct 2022</h4>\n<ul>\n<li>Added: Option to assign wholesale registration form</li>\n<li>Added: Registration page state label into the page list table</li>\n<li>Added: The registration form shortcode conditionally into the assigned page</li>\n<li>Added: Wholesale price column</li>\n<li>Added: Registration fields manager</li>\n</ul>\n<h4>Version: 1.2.0 &#8211;Date: 18 Sep 2022</h4>\n<ul>\n<li>Tweak: Whholesale label show on cart page for variation product</li>\n<li>Added: filter hide whols_hide_price_for_guest_users</li>\n<li>Tweak: Compatibility with WooCommerce&#8217;s tax display settings for simple product</li>\n</ul>\n<h4>Version: 1.1.9 &#8211;Date: 10 Sep 2022</h4>\n<ul>\n<li>Tweak: Removed some unused variables</li>\n<li>Updated: The language file &amp; Pro notice text</li>\n<li>Fixed: php 7.4 user metabox warning</li>\n</ul>\n<h4>Version: 1.1.8 &#8211;Date: 16 Jul 2022</h4>\n<ul>\n<li>Tweak: Compatibility with the WooCommerce&#8217;s price decimal settings</li>\n<li>Improved: is_wholesaler function</li>\n<li>Fixed: Price display issue</li>\n<li>Updated: The language file</li>\n<li>Added: Quick recommended plugin</li>\n</ul>\n<h4>Version: 1.1.7 &#8211;Date: 9 May 2022</h4>\n<ul>\n<li>Added: Filter hook whols_label_upto</li>\n<li>Added: Filter hook whols_disable_del_tag</li>\n<li>Fixed: Discount range show 0% for Multiple role</li>\n</ul>\n<h4>Version: 1.1.6 &#8211;Date: 9 Apr 2022</h4>\n<ul>\n<li>Fixed: Variable product price decimal issue</li>\n<li>Fixed: When min &amp; max both price is same for variable product, don&#8217;t show the price range</li>\n</ul>\n<h4>Version: 1.1.5 &#8211;Date: 12 Mar 2022</h4>\n<ul>\n<li>Added: Checkbox field support for registration form</li>\n<li>Added: Filter hook to manage capabilities</li>\n</ul>\n<h4>Version: 1.1.4 &#8211;Date: 13 Feb 2022</h4>\n<ul>\n<li>Improved: Registration form input fields</li>\n<li>Fixed: Warning on product metabox</li>\n<li>Fixed: Showing price decimal properly</li>\n<li>Added: Wholesale label on cart page</li>\n<li>Fixed: Pricing issue</li>\n</ul>\n<h4>Version: 1.1.3 &#8211;Date: 12 Jan 2022</h4>\n<ul>\n<li>Introduced: whols_registration_fields filter hook</li>\n<li>Added: Additional field support for registration form</li>\n</ul>\n<h4>Version: 1.1.2 &#8211;Date: 27 Nov 2021</h4>\n<ul>\n<li>Fixed: Decimal pricing for variation product</li>\n</ul>\n<h4>Version: 1.1.1 &#8211;Date: 24 Nov 2021</h4>\n<ul>\n<li>Fixed: Price doesn&#8217;t show in decimal format problem</li>\n</ul>\n<h4>Version: 1.1.0 &#8211;Date: 4 Oct 2021</h4>\n<ul>\n<li>Improved: Enqueueing CSS/JS files considering caching problem </li>\n</ul>\n<h4>Version: 1.0.9 &#8211;Date: 13 Sep 2021</h4>\n<ul>\n<li>Fixed: Plugin does not activate when whols plugin is active</li>\n<li>Added: hook_suffix to load the extension manager js file conditionally</li>\n</ul>\n<h4>Version: 1.0.8 &#8211;Date: 28 Aug 2021</h4>\n<ul>\n<li>Fixed: Wholesaler Price Custom Label option doesn&#8217;t work properly</li>\n<li>Fixed: Wholesaler Price design options doesn&#8217;t work properly</li>\n</ul>\n<h4>Version: 1.0.7 &#8211;Date: 1 Aug 2021</h4>\n<ul>\n<li>Fixed: is wholesale function condition fixed</li>\n</ul>\n<h4>Version: 1.0.6 &#8211;Date: 24 Jul 2021</h4>\n<ul>\n<li>Fixed: Role assigning problem</li>\n<li>Fixed: User count column</li>\n<li>Added: Option to disable the wholesale feature</li>\n<li>Fixed: Some other minor issues</li>\n</ul>\n<h4>Version: 1.0.4 &#8211;Date: 26 may 2021</h4>\n<ul>\n<li>Added: Pending user count notification into the Whols menu</li>\n<li>Added: Delete wholesaler request when an user deleted manually</li>\n<li>Fixed: Price color does not change issue</li>\n<li>Fixed: Metabox offset warning</li>\n</ul>\n<h4>Version: 1.0.0</h4>\n<ul>\n<li>Initial Release</li>\n</ul>\n"
    },
    "short_description": "WooCommerce Wholesale plugin for WooCommerce wholesale pricing. It is a b2b plugin for WooCommerce. WooCommerce B2B or B2B + B2C hybrid Store Solution",
    "description": "<p>Whols &#8211; WooCommerce Wholesale plugin is a powerful solution for WooCommerce B2B Store. It is a b2b WordPress plugin that helps you turn your WooCommerce store into a fully functioning B2B or B2B + B2C hybrid store. WooCommerce Wholesale plugin comes with all the features and functionalities you need to run a successful WooCommerce B2B store. Easily manage your products, pricing, orders, and shipping with WooCommerce Wholesale plugin.</p>\n<p>WooCommerce Wholesale plugin is a powerful solution for WooCommerce B2B Store. It is a b2b WordPress plugin that helps you turn your WooCommerce store (wholesale products WooCommerce) into a fully functioning B2B or B2B + B2C hybrid store. WooCommerce Wholesale plugin comes with all the features and functionalities you need to run a successful WooCommerce B2B store, like Bulk Buyer Discount etc.. Easily manage your products, pricing, orders, and shipping with WooCommerce Wholesale plugin. It is the best alternative for Wholesale Suite and B2BKing. Try WooCommerce Wholesale plugin today and see how easy it is to run a successful WooCommerce B2B store.</p>\n<p>Whols is an outstanding WordPress plugin for WooCommerce that allows store owners to set wholesale prices WooCommerce (wholesale WooCommerce) for the products of their online stores. This plugin enables you to show special wholesale prices to the wholesaler. Users can easily request to become a wholesale customer by filling out a simple online registration form. Once the registration is complete, the owner of the store will be able to review the request and approve the request either manually or automatically.</p>\n<p>Whols plugin reduces the hassle to create multiple stores for both the consumers and the wholesalers. By utilizing the functionality of this amazing plugin, you can easily maintain both the consumers and the wholesalers from a single store.</p>\n<p><a href=\"https://theplugindemo.com/whols/demo/create-sandbox/\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://theplugindemo.com/whols/doc/free/\" rel=\"nofollow ugc\">Documentation</a> | <a href=\"https://wpwhols.com/pricing/\" rel=\"nofollow ugc\">Purchase Pro</a> | <a href=\"https://hasthemes.com/contact-us/\" rel=\"nofollow ugc\">Contact Us</a></p>\n<h3>Whols &#8211; WooCommerce Wholesale Prices and WooCommerce B2B Store Plugin Free Features:</h3>\n<ul>\n<li>Admin can assign a wholesaler registration form (New)</li>\n<li>Wholesaler registration form shortcode can also be cused instead of assigning a page</li>\n<li>Customize registration form fields without coding / Visually (New )</li>\n<li>Ability to adding custom / additional field into the registration form using filter hook</li>\n<li>Customer can request to become a wholesale customer</li>\n<li>Admin can manage the wholesaler request manually OR Auto approve can be set</li>\n<li>Asign wholesale role for existing customers</li>\n<li>Apply wholesale prices globally</li>\n<li>Add flat/percent amount price on wholesale products</li>\n<li>Easily set wholesale prices on Simple or Variable products</li>\n<li>Add wholesale prices to each variation of a variable products</li>\n<li>Option to enable minimum product to buy</li>\n<li>Shows wholesale pricing info on shop page as well as product detail page</li>\n<li>Show/Hide the retailer price from wholesale customers</li>\n<li>Customers having wholesale role assigned can buy products at wholesale price</li>\n<li>Customize the text on the frontend labels (Retailer Price Text, Wholesaler Price Text &amp; Save Amount Text Label)</li>\n<li>Display the amount that the customer will save after purchase</li>\n<li>Allow free shipping for wholesalers</li>\n<li>Disable coupon codes for wholesale customers so only retailers can use them</li>\n<li>Hide wholesale prices for guest user</li>\n<li>Hide &#8220;Wholesale Only&#8221; Products From Other Customers</li>\n<li>Hide General Products From Wholesalers</li>\n<li>Wholesale prices are only visible to customers with “Wholesaler” role</li>\n<li>Registration successful message customization</li>\n<li>Redirect to specific page after completed registration</li>\n<li>Redirect to specific page when customer login as a wholesaler</li>\n<li>Hide price for guest users (Login to see price)</li>\n<li>Email Notification (Registration)</li>\n<li>Design Customizations</li>\n<li>Exclude Tax for Wholesale users</li>\n<li>Easy to use backend interface</li>\n<li>Compatible with WPML</li>\n<li>Compatible with Polylang</li>\n<li>No coding required</li>\n</ul>\n<h3>Whols Premium Features:</h3>\n<p>✓ Registered form fields manager,editor<br />\n✓ Ability to adding custom / additional field into the registration form Visually / Without coding<br />\n✓ Option to use the WooCommerce billing fields into the Wholesaler registration form<br />\n✓ Create &amp; manage unlimited user role<br />\n✓ Wholesaler request management (Approve / Reject)<br />\n✓ Give different pricing to different wholesaler role<br />\n✓ Payment methods (gateway) control<br />\n✓ Different prices for different users<br />\n✓ Category wise product price set<br />\n✓ Category wise product price set for different roles<br />\n✓ Restrict wholesale store access<br />\n✓ Set default wholesaler role for wholesale registration<br />\n✓ Enable website access restriction (Entire Website / Only Shop)<br />\n✓ Whole can access the Entire Website / Shop (Loged In Users/Loged In Users With Wholesale Role)<br />\n✓ Role wise disable payment method<br />\n✓ Role wise enable free shipping<br />\n✓ Email Notification (Registration, Wholesaler Approve &amp; Rejection)</p>\n<h3>Video Overview:</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/OArnKMljqWs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Video Tutorial:</h3>\n<h4>How to install Whols plugin and complete the basic setup</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/4tUrWsNz3TE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>How to add a wholesaler registration form &amp; approve role for wholesaler</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8eI5k3xgok4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>How to set wholesale prices for different categories</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/inzemTs1SCY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>How to hide wholesale prices for guest users</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/aywuQpKFdF4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>How to Enable Free Shipping For Wholesale Customers</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/e4P9nCNGDJQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h4>How To Set Different Price For Different Wholesale Customers</h4>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/cDw4GGuHYyw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Feature Details:</h3>\n<h4>Wholesaler registration form shortcode</h4>\n<p>The Wholesaler Registration Form shortcode allows you to add a form to your WooCommerce wholesale site. This form is dedicated to B2B customers who want to register for an account. The shortcode provides an easy way for customers to fill out their information and submit it for approval. The wholesaler registration form includes fields for the customer&#8217;s name, company, email, phone number, and website. It also has a field for the customer&#8217;s desired username and password. After the customer submits the form, they will receive an email about their registration. Once their account is confirmed, they will be able to log in and eligible for buying wholesale products. By using the Wholesaler Registration Form shortcode, you can make it easy for B2B customers to create an account on your wholesale site.</p>\n<h4>Ability to add custom / additional field into the registration form</h4>\n<p>Whols WooCommerce Wholesale plugin provides the ability to add custom / additional fields to the registration form. This helps to ensure that all essential information is captured when a new wholesale customer registers on your site. This flexibility ensures that you can capture all the information you need from your wholesale customers, without making the registration process overly complex.</p>\n<h4>Customers can request to become a wholesale customer</h4>\n<p>WooCommerce Wholesale is a great way to get started with wholesaling. Customers can create an account and then browse through the products available. Once they find a product they&#8217;re interested in, they can contact you and request to become a wholesale customer. And because WooCommerce is such a popular platform, you&#8217;ll be able to easily find buyers who are willing to work with you. So if you&#8217;re interested in starting a wholesale business, WooCommerce Wholesale is a great option.</p>\n<h4>Admin can manage the wholesaler request manually OR Auto approve can be set</h4>\n<p>WooCommerce Wholesale is a powerful plugin that allows admins to manage wholesale requests manually or set them to auto-approve. This can be a great time-saver for busy admins, and it ensures that all wholesale requests are handled in a timely and professional manner.</p>\n<h4>Assign wholesale role for existing customers</h4>\n<p>This WooCommerce Wholesale is a great way to assign existing customers a wholesale role. By doing this, you&#8217;ll be able to give them access to special pricing, products, and ordering features that are only available to wholesalers. Once you&#8217;ve done this, they&#8217;ll be able to log in and access all of the features that are available to WooCommerce wholesalers. So if you&#8217;re looking for a way to give your existing customers access to special pricing and ordering features, Whols WooCommerce Wholesale is the perfect solution.</p>\n<h4>Apply wholesale prices globally</h4>\n<p>Whols WooCommerce Wholesale plugin is a great way to get started with selling online. It&#8217;s an easy, fast, and secure way to set up an online store. And because WooCommerce is built on WordPress, it&#8217;s easy to scale as your business grows. WooCommerce Wholesale makes it easy to apply wholesale prices globally. Simply install WooCommerce and Whols WooCommerce Wholesale plugin, add your products, and set your prices. That&#8217;s it! Whols WooCommerce Wholesale takes care of the rest. With WooCommerce Wholesale, you can sell online with confidence knowing that your prices are fair and competitive. So why wait? Get started today! Whols WooCommerce Wholesale &#8211; Apply wholesale prices globally!</p>\n<h4>Add flat/percent amount price on wholesale products</h4>\n<p>Whols WooCommerce Wholesale plugin will add a flat or percent amount price to wholesale products. You can either set up WooCommerce Wholesale to charge a flat rate for all wholesale products, or you can add a percent markup over the cost of the product. WooCommerce Wholesale is a powerful tool that gives you the ability to easily add price markups to your wholesale products. With WooCommerce Wholesale, there is no need to manually adjust prices for each product; WooCommerce Wholesale does the work for you. With WooCommerce Wholesale, you can focus on running your business, not on adjusting prices.</p>\n<h4>Easily set wholesale prices on Simple or Variable products</h4>\n<p>WooCommerce Wholesale is a great way to sell products at wholesale prices. It allows you to easily set wholesale prices on Simple or Variable products. You can also use WooCommerce Wholesale to manage your inventory, set minimum order quantities, and offer discounts to your wholesale customers. WooCommerce Wholesale is a powerful tool that can help you increase sales and grow your business.</p>\n<h4>Add wholesale prices to each variation of a variable products</h4>\n<p>Whols WooCommerce Wholesale plugin offers the ability to add wholesale prices to each variation of a variable product. This ensures that your wholesale customers always see the correct pricing for their orders, and it makes it easy for you to manage your inventory. WooCommerce Wholesale makes it easy to manage your inventory and ensure that your wholesale customers always see the correct pricing.</p>\n<h4>Option to enable minimum product to buy</h4>\n<p>WooCommerce Wholesale is a great way to sell products in bulk. One of the great features of WooCommerce Wholesale is the ability to enable a minimum product to buy. This setting is located in the settings area. By default, the minimum product to buy is set to 1. This means that customers can only buy 1 of each product. However, you can change this setting to any number you like. For example, you could set the minimum product to buy to 10. This would mean that customers would need to buy 10 of each product. WooCommerce Wholesale is a great way to sell products in bulk. The ability to enable a minimum product to buy is a great feature that can help you sell more products.</p>\n<h4>Shows wholesale pricing info on shop page as well as product detail page</h4>\n<p>If you&#8217;re running a WooCommerce store, you might be interested in WooCommerce Wholesale, which allows you to show wholesale pricing information on your shop page as well as your product detail page. This can be a great way to attract new customers and get them interested in buying from you. Whols WooCommerce Wholesale plugin is easy to set up and use, and it&#8217;s a great way to take advantage of WooCommerce&#8217;s powerful features. If you&#8217;re looking for a way to show wholesale pricing information on your WooCommerce store, this WooCommerce Wholesale plugin is a great option.</p>\n<h4>Show/Hide the retailer price from wholesale customers</h4>\n<p>WooCommerce Wholesale is a great way to sell products at a discounted price to wholesale customers. By default, WooCommerce will show the regular retail price to all customers, regardless of whether they are wholesale customers or not. However, you can choose to hide the retail price from wholesale customers if you wish. To do this, simply go to the Whols WooCommerce Wholesale Settings page and check the box next to &#8220;Hide retail pricing from wholesale customers.&#8221; Once you have done this, wholesale customers will only see the discounted price when they are logged in to their account. This is a great way to ensure that only wholesale customers are able to see the discounted prices.</p>\n<h4>Customers having wholesale role assigned can buy products at wholesale price</h4>\n<p>WooCommerce Wholesale customers can buy products at wholesale price if they have the WooCommerce Wholesale role assigned. WooCommerce Wholesale is an eCommerce plugin for WordPress that allows customers to buy products at wholesale prices. The WooCommerce Wholesale plugin is available for free from the WordPress Plugin Directory. WooCommerce Wholesale customers can also buy products from WooCommerce Wholesale dealers. WooCommerce Wholesale dealers are businesses that sell WooCommerce Wholesale products to WooCommerce Wholesale customers.</p>\n<h4>Customize the text on the frontend labels (Retailer Price Text, Wholesaler Price Text &amp; Save Amount Text Label)</h4>\n<p>WooCommerce Wholesale allows you to customize the text on the frontend labels for Retailer Price, Wholesaler Price, and Save Amount. This can be useful if you want to change the wording to better suit your specific products or target audience. For example, you could change the Retailer Price label to &#8220;MSRP&#8221; or &#8220;Recommended Retail Price&#8221; to make it clearer to customers what the price represents. Alternatively, you could change the Wholesaler Price label to &#8220;Bulk Price&#8221; or &#8220;Discounted Price&#8221; to emphasize the savings that are available. Whatever text you choose, WooCommerce Wholesale makes it easy to update the frontend labels to match your desired branding.</p>\n<h4>Display the amount that the customer will save after the purchase</h4>\n<p>Whole WooCommerce Wholesale plugin will display the amount that the customer will save after the purchase in the WooCommerce Cart and Checkout pages. The customer will see the WooCommerce Wholesale &#8220;Your Savings&#8221; message and the total savings amount. The WooCommerce Wholesale message and savings amount will be displayed in the same format as other WooCommerce messages. Whole WooCommerce Wholesale plugin is a great way to increase customer loyalty and satisfaction.</p>\n<h4>Allow free shipping for wholesalers</h4>\n<p>Whole WooCommerce Wholesale plugin offers a suite of powerful tools to help you run your wholesale business. With WooCommerce Wholesale, you can offer free shipping to your wholesale customers. This can help you attract new customers and encourage existing customers to place larger orders. Whols WooCommerce Wholesale plugin also offers discounts and bulk pricing options, so you can offer your wholesale customers even more savings. By offering free shipping and other benefits, WooCommerce Wholesale makes it easy to build a successful wholesale business.</p>\n<h4>Disable coupon codes for wholesale customers so only retailers can use them</h4>\n<p>Whols WooCommerce Wholesale is a great plugin for WooCommerce that allows you to set up a wholesale store. One of the features of the plugin is the ability to create coupon codes that can be used by wholesale customers. However, there is an option to disable this feature so that only retail customers can use the coupon codes. This can be useful if you want to restrict the use of coupons to only retail customers. By disabling the coupons for wholesale customers, you can help ensure  &hellip;</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/whols.1.3.7.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/whols/assets/screenshot-1.jpg?rev=2878591",
            "caption": "Navigate Settings Quickly After Activating the plugin"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-2.jpg?rev=2878591",
            "caption": "Wholesaler Registration Form Shortcode"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-3.jpg?rev=2878591",
            "caption": "Wholesaler Registration Form Frontend"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-4.jpg?rev=2878591",
            "caption": "Registered Wholesale User Pending for Approval"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-5.jpg?rev=2878591",
            "caption": "Approve Wholesaler Request"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-6.jpg?rev=2878591",
            "caption": "General Settings"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-7.jpg?rev=2878591",
            "caption": "General Settings"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-8.jpg?rev=2878591",
            "caption": "Product Visibility Settings"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-9.jpg?rev=2878591",
            "caption": "Registration &amp; Login Settings"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-10.jpg?rev=2878591",
            "caption": "Registration &amp; Login Settings"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-11.jpg?rev=2878591",
            "caption": "Guest Access Restriction Settings"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-12.jpg?rev=2878591",
            "caption": "Other Settings"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-13.jpg?rev=2878591",
            "caption": "Product Level Settings"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-14.jpg?rev=2878591",
            "caption": "Wholesale pricing options"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-15.jpg?rev=2878591",
            "caption": "Wholesale price is now showing in the Frontnd"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-16.jpg?rev=2878591",
            "caption": "Wholesale price is now showing in the product details page"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-17.jpg?rev=2878591",
            "caption": "Wholesale pricing options For: Variable Product"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-18.jpg?rev=2878591",
            "caption": "Wholesale pricing options showing in the product details page For: Variable Product"
        },
        {
            "src": "https://ps.w.org/whols/assets/screenshot-19.jpg?rev=2878591",
            "caption": "Product Category Settings"
        }
    ],
    "tags": {
        "wholesale-plugin": "wholesale plugin",
        "wholesale-prices": "wholesale prices",
        "wholesale-pricing": "wholesale pricing",
        "woocommerce-b2b": "woocommerce b2b",
        "woocommerce-wholesale": "woocommerce wholesale"
    },
    "stable_tag": "1.3.7",
    "versions": {
        "1.1.2": "https://downloads.wordpress.org/plugin/whols.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/whols.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/whols.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/whols.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/whols.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/whols.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/whols.1.1.8.zip",
        "1.1.9": "https://downloads.wordpress.org/plugin/whols.1.1.9.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/whols.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/whols.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/whols.1.2.2.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/whols.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/whols.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/whols.1.2.6.zip",
        "1.2.7": "https://downloads.wordpress.org/plugin/whols.1.2.7.zip",
        "1.2.8": "https://downloads.wordpress.org/plugin/whols.1.2.8.zip",
        "1.2.9": "https://downloads.wordpress.org/plugin/whols.1.2.9.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/whols.1.3.0.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/whols.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/whols.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/whols.1.3.3.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/whols.1.3.4.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/whols.1.3.5.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/whols.1.3.6.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/whols.1.3.7.zip",
        "trunk": "https://downloads.wordpress.org/plugin/whols.zip"
    },
    "business_model": "commercial",
    "repository_url": "",
    "commercial_support_url": "https://wpwhols.com/contact-us/",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/whols/assets/banner-772x250.jpg?rev=2878591",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/whols/assets/icon-128x128.jpg?rev=2878591"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}