{
    "name": "All-in-One Addons for Elementor &#8211; WidgetKit",
    "slug": "widgetkit-for-elementor",
    "version": "2.5.1",
    "author": "<a href=\"https://themesgrove.com\">Themesgrove</a>",
    "author_profile": "https://profiles.wordpress.org/themesgrove/",
    "contributors": {
        "themesgrove": {
            "profile": "https://profiles.wordpress.org/themesgrove/",
            "avatar": "https://secure.gravatar.com/avatar/80149065c53d3f92ed87e7073411dda3?s=96&d=monsterid&r=g",
            "display_name": "ThemesGrove"
        },
        "parvezvai": {
            "profile": "https://profiles.wordpress.org/parvezvai/",
            "avatar": "https://secure.gravatar.com/avatar/8c9aaae8b39d1036f844f218caf3995e?s=96&d=monsterid&r=g",
            "display_name": "Parvez Akther"
        },
        "themexpert": {
            "profile": "https://profiles.wordpress.org/themexpert/",
            "avatar": "https://secure.gravatar.com/avatar/d64eab510a4787f2df95eddfc228975f?s=96&d=monsterid&r=g",
            "display_name": "ThemeXpert"
        }
    },
    "requires": "5.0",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 90,
    "ratings": {
        "5": 31,
        "4": 1,
        "3": 0,
        "2": 0,
        "1": 4
    },
    "num_ratings": 36,
    "support_url": "https://wordpress.org/support/plugin/widgetkit-for-elementor/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 10000,
    "downloaded": 508445,
    "last_updated": "2024-06-24 12:03pm GMT",
    "added": "2018-02-19",
    "homepage": "https://themesgrove.com/widgetkit-for-elementor/",
    "sections": {
        "description": "<p>If <a href=\"https://wordpress.org/plugins/elementor/\" rel=\"ugc\">Elementor page builder</a> elements are not enough, try WidgetKit Addon and boost your page building experience. More than 55+ creative elements come with WidgetKit. You will be able to come out from the boundary of ordinary design and do something creative.</p>\n<p>Merge WidgetKit with Elementor and take the experience of ultimate page building. Build any layout in the shortest time, doesn’t matter whether the layout is simple or complex. If you can think it, you can build it with WidgetKit.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/7sh13OCwZ4A?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><a href=\"https://wordpress.org/plugins/elementor/\" rel=\"ugc\">Elementor</a> is a great tool for building websites, but without proper addons, it might take more time and money. Even sometimes you do not get your preferred layouts and sections in spite of using premium addons.</p>\n<p>We aim to enhance your experience, it does not matter whether you are a developer or a designer. Our goal is to give you the perfect tool that is built for WordPress professionals.</p>\n<p>You can only decide to use WidgetKit after viewing it by yourself.</p>\n<h3><a href=\"http://widgetkit.themesgrove.com/\" rel=\"nofollow ugc\">Check Live Demo</a></h3>\n<h3>Some of the best WP themes built with WidgetKit</h3>\n<blockquote>\n<p><a href=\"https://1.envato.market/0OjO\" rel=\"nofollow ugc\">Education WordPress Theme</a> with all major LMS eg: LifterLMS, LearnDash, Sensei supported.<br />\n  <a href=\"https://1.envato.market/my0QZ\" rel=\"nofollow ugc\">Tour &amp; Travel Agency WordPress Theme</a> with booking, packaging and page builder.<br />\n  Best <a href=\"https://1.envato.market/q6BPO\" rel=\"nofollow ugc\">Games &amp; Movie Review WP Themes</a> with review, rating, IMDB integration<br />\n  <a href=\"https://1.envato.market/QdWkz\" rel=\"nofollow ugc\">Event WordPress Theme</a> for tech, music, festivals and social events.</p>\n</blockquote>\n<p><strong>Entirely Customizable</strong><br />\nEvery element of WidgetKit comes with necessary control options, which allows you to discover more possibilities with an element. You can bring your imagination to reality with WidgetKit elements.</p>\n<p><strong>Easy to do Complicate Design Without Coding</strong><br />\nIt doesn’t matter what you have imagined in your mind. As long as you are using Widgetkit, you will be able to design every complicated design easily without any sort of coding, all by yourself.</p>\n<p><strong><a href=\"https://widgetkit.themesgrove.com\" rel=\"nofollow ugc\">29+ Premium Layouts</a></strong><br />\nWith WidgetKit you get 29+ premium layouts that lets you build an entire page within minutes. Just choose a premium layout and insert it, its that simple. You will get a full native feel when you use this.</p>\n<p><strong>LearnDash Templates (New)</strong><br />\nGive a whole new look to your Learndash pages with Learndash templates of Widgetkit for Elementor. Currently, there are four new templates that come with WidgetKit, but soon more layouts will be added.</p>\n<p><strong>Template Library (New)</strong><br />\nWe have brought the brand new template library available for both WidgetKit Pro and Free versions. From now on, preview or import your favorite templates on your page with one click.</p>\n<p><strong>Device Responsive</strong><br />\nWidgetkit is entirely device responsive. Your sections built with WidgetKit will always look the same on every device.</p>\n<p><strong>Uncompromisable Performance</strong><br />\nWidgetkit is developed with professional experienced developers. Therefore no messy codes or extra resources are loaded to slow down your site.</p>\n<p><strong><a href=\"https://widgetkit.themesgrove.com/lottie-animations/\" rel=\"nofollow ugc\">Lottifiles Animation (New)</a></strong><br />\nWidgetKit has brought the brand new Lottie animation element, which lets you make your site attractive with lots of animations. Use the link or JSON files from the lottiefiles and make elegant sections with cool animations instantly. Check out this video and do it yourself now.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/roC1bZMJrWo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><strong>Woocommerce Integration &amp; Elements</strong><br />\nWidgetKit is not limited to general elements but it also allows you to customize your web store built with WooCommerce. There are four dedicated elements Woo Products, Woo Product Carousel, Woo Categories, Woo Recent Product. With these elements, you can highlight and manage your product more effectively and thus boost your sales.</p>\n<p><strong>Lms Integration &amp; Elements</strong><br />\nIf you are creating an education site you can make it more lucrative with WidgetKit. It doesn’t matter if you are using an LMS as WidgetKit provides integration and elements for popular 3 lms’s – LearnDash, Sensei &amp; LearnPress. Be free and customize your site according to your own will with WidgetKit.</p>\n<p><strong>Dedicated Support</strong><br />\nWidgetkit team is always ready to aid you in your queries and problem regarding widgetkit. Ask your questions in the email support, we will try to reply and solve your problem asap.</p>\n<h3><a href=\"http://widgetkit.themesgrove.com/\" rel=\"nofollow ugc\">Check Live Demo</a></h3>\n<h3>28+ Free Elements And Counting</h3>\n<ol>\n<li><a href=\"https://widgetkit.themesgrove.com/animated-headline\" rel=\"nofollow ugc\">Animated Headline</a> &#8211; Create elegant headlines with the help of Animated Headline element. Your selected text will animate in different ways with and visitors will be attracted easily.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/button\" rel=\"nofollow ugc\">Button + Modal</a> &#8211; The trend of old button and modal is over, WidgetKit offers 10 elegant buttons &amp; hover effect that completely changes the look of your site.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Blog Carousel</a> &#8211; Set your blog in the carousel style with this element. Swipe to the next blog by clicking the arrows.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Blog Hover Animation</a> &#8211; Stylish blog section specially built to catch the eyesight of the users. Try the hover effects and apply the one you like.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Blog Image</a> &#8211; Blog image element comes with a typical blogging style with text on one side and image on others.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Click to Tweet</a> &#8211; A simple twitter button with lots of customization options.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/contact-form/\" rel=\"nofollow ugc\">Contact Form</a> &#8211; Forms are needed in every aspect and therefore WidgetKit brings Contact Form element. Now you don’t need to run for several plugins, make any kind of forms with WidgetKit.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/content-carousel/\" rel=\"nofollow ugc\">Content Carousel</a> &#8211; Give wings to your content with the content carousel element of WidgetKit. Show content from the center, keep it standstill or autoplay it. You have the control to do everything.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/countdown\" rel=\"nofollow ugc\">Countdown</a> &#8211; Add a countdown to your special occasions or events but make it special with Widgetkit. Style the way you want, then make it more exciting with a countdown to the end.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/filterable-portfolio\" rel=\"nofollow ugc\">Filterable Portfolio</a> &#8211; Put life to your portfolio items with this element of WidgetKit. Play with different styles and customizations than show it to your visitors.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/gallery/\" rel=\"nofollow ugc\">Gallery</a> &#8211; Does the gallery showcase images in only one way? Think again. With gallery element of WidgetKit showcase your images in many ways. All you have to do is turn on your creative mind.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/image-box\" rel=\"nofollow ugc\">Hover Image</a> &#8211; Add different hover effect on images that intelligently show your credibility. Choose from five different hover effects and let glow your image.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/info-box\" rel=\"nofollow ugc\">Info Box</a> &#8211; Organize and show your site’s info smartly with Info box element of WidgetKit. Give your preferred info with the icon, link, text, and your info box will be ready.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/image-compare/\" rel=\"nofollow ugc\">Image Compare</a> &#8211; Are you a designer or photo editor who often needs to showcase their elegant works in a before-after form in a slider? This is a perfect element for this type of work.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/pricing\" rel=\"nofollow ugc\">Pricing Single</a> &#8211; Regular pricing table with a touch of professional that portraits your pricing table and highlights your features.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/pricing\" rel=\"nofollow ugc\">Pricing Icon</a> &#8211; The standard pricing table modified with gorgeous icons, choose your desired one, and make it more attractive.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/pricing\" rel=\"nofollow ugc\">Pricing Tabs</a> &#8211; Arrange multiple pricing tables, just under one single one tab. Manage all tabs smartly and save your space.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Pros &amp; Cons</a> &#8211; Comparison always has an impact on your sales. With the Pros &amp; Cons element, you can show a comparison of your product and also show the good sides along with bad ones.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/slider\" rel=\"nofollow ugc\">Slider Animation</a> &#8211; The regular slider element with collapsable animation that meets all the minimum requirements for every user. Use it in every regular site or as per your needs.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/slider\" rel=\"nofollow ugc\">Slider Content</a> &#8211; This element comes with a regular slider, in addition, it has a content layout that allows you to highlight your content intelligently.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/slider\" rel=\"nofollow ugc\">Slider Box</a> &#8211; Slider box animation element lets you define your slider a little bit differently with box style. It’s a unique style that catches the focus of visitors easily.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/social-share/\" rel=\"nofollow ugc\">Social Share Animation</a> &#8211; Do you like people to share your posts? Well, then use the social share animation element. This element comes with lucrative animation that makes sharing more attractive to viewers.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/social-share/\" rel=\"nofollow ugc\">Social Share Collapse</a> &#8211; Highlight your portfolio section with a stylish social share collapse element that comes with collapsible social share buttons.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/testimonial\" rel=\"nofollow ugc\">Testimonial</a> &#8211; Create magnificent testimonials with uniques looks with WidgetKit’s testimonial element. Set your testimonials then enable the autoplay and let the social proofing work.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/team\" rel=\"nofollow ugc\">Team</a> &#8211; A perfect element to introduce your team to your visitors. Showcase your team members with various styles using images, texts, social links, etc.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/tilt-box\" rel=\"nofollow ugc\">Tilt Box</a> &#8211; Give a smooth 3D effect to your images with the tilt box element of WidgetKit. It will steal the sight of your visitor and force them to glare at it.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Video Popup</a> &#8211; Place your youtube, Vimeo video links, and make them pop up on the screen. Or set the autoplay option, the visitor will find it more interesting.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/lottie-animations\" rel=\"nofollow ugc\">Lottie Animation</a> &#8211; Make your site more attractive with lots of elegant animations from Lottie files. With the Lottie Animation element use the JSON link and your animation will be ready instantly.</li>\n</ol>\n<h3>(27+) More Elements for <a href=\"https://themesgrove.com/widgetkit-for-elementor/\" rel=\"nofollow ugc\">Pro Version</a></h3>\n<ol>\n<li><a href=\"https://widgetkit.themesgrove.com/post-tab/\" rel=\"nofollow ugc\">Post Tab</a> &#8211; Design got no ending. Check out the post tab element demo and know for yourself how you can organize and showcase your posts.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/post-carousel/\" rel=\"nofollow ugc\">Post Carousel</a> &#8211; Engage with more visitors with the help of Post carousel element. Visitors don’t need to scroll through posts, the post will automatically slide one after the other.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/smart-list-2/\" rel=\"nofollow ugc\">Smart List</a> &#8211; Show your posts smartly in a list with help of Smart list element of WidgetKit. A list is not only up to down, rather it can be shown in many ways. Try it with smart list element.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/grid-slider/\" rel=\"nofollow ugc\">Grid Slider</a> &#8211; Showcase your posts in grid style along with slider. Grid slider enables you to show many post at one place in a gridbox slider.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/headline-slider/\" rel=\"nofollow ugc\">Headline Slider</a> &#8211; Most of the time we read the headlines, therefore WidgetKit brought Headline slider. Let your visitor read the headlines and choose his desired topic.</li>\n<p><strong>Elements For WooCommerce </strong></p>\n<li><a href=\"https://widgetkit.themesgrove.com/woo-products/\" rel=\"nofollow ugc\">Woo Products</a> &#8211; Showcase your woocommerce products elegantly with Woo Products element of WidgetKit. Catch their attraction first then convert them to your client.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/woo-product-carousel/\" rel=\"nofollow ugc\">Woo Product Carousel</a> &#8211; Products need to be organized in a better way in order to get more sales. Organize and showcase your products in the way your clients like with Woo Product Carousel element.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/woo-category/\" rel=\"nofollow ugc\">Woo Categories</a> &#8211; Highlight your product categories in a unique way with this element. All you have to do is set the products and select the categories.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Woo Recent Product</a> &#8211; New products always catch the eyesight of clients rather than old products. Showcase your recent product attractively with Woo recent product element of WidgetKit.</li>\n<p><strong>Elements For LearnPress LMS</strong></p>\n<li><a href=\"https://widgetkit.themesgrove.com/learnpress-course-list/\" rel=\"nofollow ugc\">Learnpress Course list</a> &#8211; LearnPress Course List element organize your LearnPress courses in a list order so that your viewer can easily find out their desired courses not to click anywhere.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/learnpress-course-tab/\" rel=\"nofollow ugc\">Learnpress Course Tab</a> &#8211; LearnPress Course Tab allows you to display all your LearnPress courses in a tabbed order and it loads its data on demand. You can also showcase your course with carousel style.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learnpress Categories</a> &#8211; Organize your courses, category wise with help of Learnpress categories element. Only selecting the categories is enough, rest will be managed by element.</li>\n<p><strong>Elements For Sensei LMS</strong></p>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Sensei Course List</a> &#8211; Bring all your sensei courses under one list with the help of this element. Your visitor will find their preferred course easily and will be able to enroll.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Sensei Course Tab</a> &#8211; Save some space and show more courses conveniently with the Sensei course tab element of Widgetkit.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Sensei Categories</a> &#8211; Another Sensei element that showcases your courses category wise. If you thinking about showcasing your courses, choose this element.</li>\n<p><strong>Elements For LearnDash LMS</strong></p>\n<li><a href=\"https://widgetkit.themesgrove.com/learndash-course-list/\" rel=\"nofollow ugc\">Learndash Course List</a> &#8211; Organize all your courses in a list order with Learndash course list element, so that your viewer can easily find out their desired course.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/learndash-course-tab/\" rel=\"nofollow ugc\">Learndash Course Tab</a> &#8211; Showing all courses in a place may not look good. For solving this problem Learndash course tab is introduced, so that you can showcase many courses in tabbed order.</li>\n<p><strong>More Elements For LearnDash LMS</strong></p>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Banner</a> &#8211; Highlight the banner of your Learndash course and attract more learners with help of Learndash course banner element of WidgetKit.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Certificate</a> &#8211; What’s the point if there is no proof of learning? Give this proof through certification and do it easily with Learndash course certificate element.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Enrollment</a> &#8211; Make the enrollment process easy and help more students to enroll in your course with the Learndash course enrollment element. Give details of the period, course fee and any other details you like in one field.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Course Meta Info</a> &#8211; Let your learners know what type, of course, he is going to learn. This helps him to get more determined. Do it easily with Course meta info element.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Progress</a> &#8211; Let your learners know about their progress. Learndash course progress element lets you show the progress of every student.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Resource</a> &#8211; With Learndash course resource element let your learners know about the course resources. Such as the number of lessons, quizzes, skill level, etc.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Tab Content</a> &#8211; Show your important contents of course in tabbed order with the learndash course tab content element.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Related Course</a> &#8211; Show related courses in an elegant manner with the learndash related course element. This will help your learners to choose more relevant courses.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Curriculum</a> &#8211; Make the course curriculum interesting with Learndash course curriculum element. Show al the course content at one place with this element.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Instructor</a> &#8211; Smartly represent your course instructors with the help of learndash course instructor element. </li>\n</ol>\n<h3>Documentation and Support</h3>\n<p>Widgetkit team is always ready to aid you in your queries and problems regarding widgetkit.</p>\n<ul>\n<li>For tutorials and documentation go to our <a href=\"https://themesgrove.com/support/widgetkit/\" rel=\"nofollow ugc\">support</a> page. </li>\n<li>If you have any questions, you can contact us through mail </li>\n<li>To know about more information, features, FAQs check our website at <a href=\"https://themesgrove.com/widgetkit-for-elementor/\" rel=\"nofollow ugc\">https://themesgrove.com/widgetkit-for-elementor/</a></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/OMNPazwUJN8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Love Widgetkit?</h3>\n<ul>\n<li>Join our <a href=\"https://www.facebook.com/groups/widgetkitcommunity/\" rel=\"nofollow ugc\">Facebook Group</a>.</li>\n<li>Check out tutorials from our <a href=\"https://www.youtube.com/channel/UCgX3XEMBg3MyGzqfD7J384w\" rel=\"nofollow ugc\">Youtube Channel</a>. </li>\n<li>Rate us on <a href=\"https://wordpress.org/support/plugin/widgetkit-for-elementor/reviews/?rate=5#new-post\" rel=\"ugc\">WordPress</a>.</li>\n</ul>\n<h3>Now What?</h3>\n<p>If you like WidgetKit plugin, then consider checking out our other WordPress products:</p>\n<ul>\n<li><a href=\"https://themesgrove.com/free-one-page-responsive-wordpress-theme/\" rel=\"nofollow ugc\">Switch</a> &#8211; Best free onepage business theme for WordPress, that lets you do more.</li>\n<li><a href=\"https://themesgrove.com/wp-onepager/\" rel=\"nofollow ugc\">WPOnepager</a> &#8211; Easiest landing page builder that really lets you do it in minutes.</li>\n</ul>\n",
        "installation": "<ol>\n<li>Upload <code>widgetkit-for-elementor.zip</code> folder to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "faq": "\n<dt id='is%20widgetkit%20compatible%20with%20any%20wordpress%20themes%3F'>\nIs WidgetKit compatible with any WordPress themes?\n</h4>\n<p>\n<p>Yes of course! WidgetKit will work with any WordPress themes.</p>\n</p>\n<dt id='is%20widgetkit%20fully%20free%3F'>\nIs WidgetKit fully free?\n</h4>\n<p>\n<p>Yes! WidgetKit is absolutely free and provided to you by Themesgrove. There is no hidden charge if you wish you can give a small donation.</p>\n</p>\n<dt id='as%20a%20theme%20developer%2C%20how%20can%20widgetkit%20help%20me%3F'>\nAs a theme developer, how can WidgetKit help me?\n</h4>\n<p>\n<p>Widgetkit turns your theme functions to widgets and replaces code with a visual builder to reduce development time.</p>\n</p>\n<dt id='what%20are%20the%20requirements%20to%20use%20widgetkit%3F'>\nWhat are the requirements to use Widgetkit?\n</h4>\n<p>\n<p>Minimum Requirements<br />\nWordPress version 4.0 or greater.<br />\nElementor version 1.5 or greater.<br />\nPHP version 5.4 or greater.</p>\n</p>\n<dt id='recommended%20requirements'>\nRecommended Requirements\n</h4>\n<p>\n<p>The latest version of WordPress.<br />\nThe latest version of Elementor.<br />\nPHP 5.4 or greater.</p>\n</p>\n\n",
        "changelog": "<h4>2.5.1</h4>\n<p>Fix – Vulnerability and Security issues.</p>\n<h4>2.5.0</h4>\n<p>Fix – Security issues.</p>\n<h4>2.4.8</h4>\n<p>Improve – Advanced Tab element.</p>\n<h4>2.4.7</h4>\n<p>Fix – Mailchimp API security issues.</p>\n<h4>2.4.6</h4>\n<p>Fix – Minor issues.</p>\n<h4>2.4.4</h4>\n<p>Fix – Removed unnecessary files.</p>\n<h4>2.4.3</h4>\n<p>Fix – Minor issues.</p>\n<h4>2.4.2</h4>\n<p>Fix – LearnDash course edit issue.</p>\n<h4>2.4.0</h4>\n<p>New – Advanced Tab element.</p>\n<h4>2.3.19</h4>\n<p>Fix – dist folder missing issue.</p>\n<h4>2.3.18</h4>\n<p>Fix – PHP fatal error.</p>\n<h4>2.3.17</h4>\n<p>Fix – Elementor latest version compatibility issues.</p>\n<h4>2.3.16.1</h4>\n<p>Fix – LearnDash Template Import issue.</p>\n<h4>2.3.15</h4>\n<p>Fix – LearnDash Course visibility issue.</p>\n<h4>2.3.14</h4>\n<p>Fix &#8211; Tutor LMS key and panel added.</p>\n<h4>2.3.13</h4>\n<p>Fix &#8211; Namespace issue in testimonial element.</p>\n<h4>2.3.12</h4>\n<p>Fix &#8211; Live editing issue.<br />\nFix &#8211; Content Carousel responsive issue.</p>\n<h4>2.3.11</h4>\n<p>Fix &#8211; Elementor\\Scheme_Typography Deprecation error fixed.<br />\nFix &#8211; Elementor\\Scheme_Color Deprecation error fixed.</p>\n<h4>2.3.10</h4>\n<p>Fix &#8211; Elementor compatible tag added for Content Carousel element.<br />\nFix &#8211; Elementor compatible tag added for Slider Animation element.<br />\nFix &#8211; Elementor compatible tag added for Slider Content element.<br />\nFix &#8211; Elementor compatible tag added for Slider Box element.<br />\nFix &#8211; Elementor compatible tag added for Team element.<br />\nFix &#8211; Elementor compatible tag added for Testimonial element.<br />\nUpdate &#8211; Slider Content Style issue.</p>\n<h4>2.3.9</h4>\n<p>New &#8211; Mailchimp element.<br />\nUpdate &#8211; Testimonial element.</p>\n<h4>2.3.8</h4>\n<p>Update &#8211; Image size option added in Content Carousel Element.<br />\nUpdate &#8211; Image size option added in Testimonial Element.<br />\nUpdate &#8211; Image size option added in Team Element.</p>\n<h4>2.3.7.4</h4>\n<p>Fix &#8211; Body padding issue for wk contact form element.<br />\nFix &#8211; Thank you notice always visibility in dashboard.<br />\nFix &#8211; Update Testimonial layout 4 image alignment issue.<br />\nFix &#8211; Filterable porfolio padding issue.<br />\nFix &#8211; Title spacing issue fixed for Testimonial element.<br />\nFix &#8211; Placeholder image added for Testimonial element.<br />\nFix &#8211; Quote color updated for Testimonial element.</p>\n<h4>2.3.7.3</h4>\n<p>Fix &#8211; widgetkit template library page style issue in dashboard.</p>\n<h4>2.3.7.2</h4>\n<p>Fix &#8211; Fix slug conflict with wishlist member plugin.</p>\n<h4>2.3.7.1</h4>\n<p>Update &#8211; Nonce verification added for security measurements.<br />\nUpdate &#8211; Check remote call response for changelog data before store it.</p>\n<h4>2.3.7</h4>\n<p>Update &#8211; dynamic option added for contact element<br />\nUpdate &#8211; demo link option  added for full image in filterable portfolio element</p>\n<h4>2.3.6</h4>\n<p>Update &#8211; Optimize resourse loading issue.</p>\n<h4>2.3.5</h4>\n<p>New – Search Element.<br />\nNew – Site Social Element.<br />\nUpdate &#8211; Add Responsive config for Content Carousel Element.</p>\n<h4>2.3.4</h4>\n<p>Fix – Fix button markup if there is no button text for slider content widget.<br />\nFix – Fix Font Awesome Icon not loading in slider content element.</p>\n<h4>2.3.3</h4>\n<p>Fix – Fix Pricing Tab Element selected tab.<br />\nFix – Fix Filterable Portfolio Element word spacing.</p>\n<h4>2.3.2</h4>\n<p>New – Lottie Animation Widget.<br />\nNew – Lottie Animation Library Integration.</p>\n<h4>2.3.1</h4>\n<p>Update – Padding and border-radius option for the testimonial.<br />\nFix – Gallery tag issue.<br />\nFix – Fix session conflict with other plugins.<br />\nFix – Fix conflict with Easy Digital Download plugin.</p>\n<h4>2.3</h4>\n<p>New – Video element added<br />\nUpdate &#8211; URL option added in Team Element<br />\nUpdate &#8211; URL option added in Tilt box Element<br />\nUpdate &#8211; Responsive style in Gallery Element<br />\nUpdate &#8211; Border Radius option added in Content Carousel<br />\nUpdate &#8211; Countdown element<br />\nFix &#8211; Session issue while active the plugin<br />\nFix &#8211; Site health warning</p>\n<h4>2.2.1</h4>\n<p>New – Changelog Tab added in Dashboard<br />\nImprovement &#8211; Demo link updated in the dashboard</p>\n<h4>2.2.0</h4>\n<p>New – Tilt Box Element<br />\nNew – Image Compare Element<br />\nNew – Contact Form Element<br />\nFix – Element disable enable issue in Widgetkit Dashboard<br />\nFix – Conflict with weDocs plugin.<br />\nImprovement &#8211; Animation Headline element spacing</p>\n<h4>2.1.1</h4>\n<p>Improvement – 1 new layout option for the Gallery element.<br />\nImprovement – Added discount option to Pricing Single element.<br />\nImprovement – Responsive update to Testimonial element.</p>\n<h4>2.1</h4>\n<ul>\n<li>New &#8211; Gallery Element.</li>\n<li>Update &#8211; Pros &amp; Cons Element.</li>\n<li>Update &#8211; Filterable Portfolio element.</li>\n<li>Update &#8211; Pricing Single element.</li>\n<li>Update &#8211; Team element.</li>\n<li>Update &#8211; Feature Icon box element.</li>\n<li>Update &#8211; Hover Image element.</li>\n<li>Update &#8211; Slider Animation element.</li>\n<li>Update &#8211; Blog Carousel element.</li>\n<li>Update &#8211; Blog Image element.</li>\n</ul>\n<h4>2.0</h4>\n<ul>\n<li>New &#8211; Content Carousel element.</li>\n<li>New &#8211; Team element.</li>\n<li>New &#8211; Testimonial element.</li>\n<li>Update &#8211; Dashboard</li>\n<li>Update &#8211; Pricing Element.</li>\n<li>Update &#8211; Button + Modal Element. </li>\n<li>Update &#8211; Pros &amp; Const Element. </li>\n<li>Update &#8211; Slider Element.</li>\n<li>Update &#8211; Portfolio Element.</li>\n<li>Fix &#8211; WooCommerce Integration error</li>\n</ul>\n<h4>1.5.8</h4>\n<ul>\n<li>New &#8211; Theme integration added for OceanWP, Astra.</li>\n<li>New &#8211; Alignment option added in Filter Portfolio Element.</li>\n<li>New &#8211; New icon field set added for Featured Image Element</li>\n<li>Update &#8211; Dashboard</li>\n<li>Update &#8211; Carousel Style update in Testimonial Single Element.</li>\n<li>Update &#8211; Carousel Style update in Blog Carousel Element. </li>\n<li>Update &#8211; Default config and style updated in Blog Image Element. </li>\n<li>Update &#8211; Post Carousel Element Style updated.</li>\n<li>Update &#8211; Typography Style updated in Social Share Element.</li>\n<li>Fix &#8211; Undefined variable issue in Pricing Icon Element.</li>\n<li>Fix &#8211; Typography updated in Frontend Builder mode. </li>\n</ul>\n<h4>1.5.7.1</h4>\n<ul>\n<li>Update &#8211; Add missing elements</li>\n</ul>\n<h4>1.5.7</h4>\n<ul>\n<li>New &#8211; Dashboard UI Update</li>\n</ul>\n<h4>1.5.6</h4>\n<ul>\n<li>New &#8211; Click to Tweet Element</li>\n</ul>\n<h4>1.5.5</h4>\n<ul>\n<li>New &#8211; Pros and Cons Element</li>\n<li>Fixed &#8211; Spacing issue of Slider Animation </li>\n<li>Update &#8211; Code structure</li>\n</ul>\n<h4>1.5.4</h4>\n<ul>\n<li>Fixed &#8211; Bug</li>\n</ul>\n<h4>1.5.3</h4>\n<ul>\n<li>Improved – Team round element</li>\n<li>Improved – Hover image element</li>\n<li>Fixed &#8211; Bug</li>\n</ul>\n<h4>1.5.2</h4>\n<ul>\n<li>Improved – Hover image element </li>\n<li>Fixed &#8211; Bug</li>\n</ul>\n<h4>1.5.1</h4>\n<ul>\n<li>Improved – Testimonial Elements</li>\n<li>Fixed &#8211; Bug</li>\n</ul>\n<h4>1.5.0</h4>\n<ul>\n<li>Improved – Slider Elements</li>\n<li>Improved &#8211; Post Carousel</li>\n<li>Improved – Text Animation Element</li>\n<li>Fixed &#8211; Bug</li>\n</ul>\n<h4>1.3.0</h4>\n<ul>\n<li>Improved – Slider Elements</li>\n<li>New Option &#8211; Slider Data Pause True/False</li>\n<li>Improved – Portfolio Elements</li>\n<li>Improved – Team Elements</li>\n<li>Fixed &#8211; Bug</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>Fixed &#8211; Bug</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Improved – Portfolio Elements</li>\n<li>Improved – Team Elements</li>\n<li>Improved – Slider Elements</li>\n<li>Improved – Feature Box Elements</li>\n<li>Improved – Hover Image Elements</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Improved – Team Elements</li>\n<li>Improved – Pricing Element</li>\n<li>Improved – Blog Elements</li>\n<li>Improved – Testimonial Elements</li>\n<li>Fixed &#8211; Bug</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Improved – Slider Element</li>\n<li>Improved – Pricing Element</li>\n<li>Improved – Feature and Icon box Element</li>\n<li>Improved – Countdown Element</li>\n<li>Improved – Animation Effect for Blog Section</li>\n<li>Improved – Blog Hover Animation Element</li>\n<li>Fixed &#8211; Bug</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Improved – Countdown Element</li>\n<li>Improved – Animation Effect for Blog Section</li>\n<li>Improved – Blog Hover Animation Element</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>New Option    &#8211; Element Enable/Disable Option from Dashboard</li>\n<li>Update  &#8211; Button Hover Effect Option</li>\n<li>Fixed   &#8211; Bug</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Fixed &#8211; Bug</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>New Element &#8211; Image Box with Hover Effect  </li>\n<li>Fixed &#8211; Bug</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>New Element &#8211; Title Animation </li>\n<li>New Element &#8211; Countdown </li>\n<li>Fixed &#8211; Bug</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Fixed &#8211; Bug</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Fixed &#8211; Responsive issue</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Public Release</li>\n</ul>\n"
    },
    "short_description": "Everything you need to create a stunning website with Elementor, WooCommerce, LearnDash, LearnPress, and more. Growing collection of premium quality e &hellip;",
    "description": "<p>If <a href=\"https://wordpress.org/plugins/elementor/\" rel=\"ugc\">Elementor page builder</a> elements are not enough, try WidgetKit Addon and boost your page building experience. More than 55+ creative elements come with WidgetKit. You will be able to come out from the boundary of ordinary design and do something creative.</p>\n<p>Merge WidgetKit with Elementor and take the experience of ultimate page building. Build any layout in the shortest time, doesn’t matter whether the layout is simple or complex. If you can think it, you can build it with WidgetKit.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/7sh13OCwZ4A?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><a href=\"https://wordpress.org/plugins/elementor/\" rel=\"ugc\">Elementor</a> is a great tool for building websites, but without proper addons, it might take more time and money. Even sometimes you do not get your preferred layouts and sections in spite of using premium addons.</p>\n<p>We aim to enhance your experience, it does not matter whether you are a developer or a designer. Our goal is to give you the perfect tool that is built for WordPress professionals.</p>\n<p>You can only decide to use WidgetKit after viewing it by yourself.</p>\n<h3><a href=\"http://widgetkit.themesgrove.com/\" rel=\"nofollow ugc\">Check Live Demo</a></h3>\n<h3>Some of the best WP themes built with WidgetKit</h3>\n<blockquote>\n<p><a href=\"https://1.envato.market/0OjO\" rel=\"nofollow ugc\">Education WordPress Theme</a> with all major LMS eg: LifterLMS, LearnDash, Sensei supported.<br />\n  <a href=\"https://1.envato.market/my0QZ\" rel=\"nofollow ugc\">Tour &amp; Travel Agency WordPress Theme</a> with booking, packaging and page builder.<br />\n  Best <a href=\"https://1.envato.market/q6BPO\" rel=\"nofollow ugc\">Games &amp; Movie Review WP Themes</a> with review, rating, IMDB integration<br />\n  <a href=\"https://1.envato.market/QdWkz\" rel=\"nofollow ugc\">Event WordPress Theme</a> for tech, music, festivals and social events.</p>\n</blockquote>\n<p><strong>Entirely Customizable</strong><br />\nEvery element of WidgetKit comes with necessary control options, which allows you to discover more possibilities with an element. You can bring your imagination to reality with WidgetKit elements.</p>\n<p><strong>Easy to do Complicate Design Without Coding</strong><br />\nIt doesn’t matter what you have imagined in your mind. As long as you are using Widgetkit, you will be able to design every complicated design easily without any sort of coding, all by yourself.</p>\n<p><strong><a href=\"https://widgetkit.themesgrove.com\" rel=\"nofollow ugc\">29+ Premium Layouts</a></strong><br />\nWith WidgetKit you get 29+ premium layouts that lets you build an entire page within minutes. Just choose a premium layout and insert it, its that simple. You will get a full native feel when you use this.</p>\n<p><strong>LearnDash Templates (New)</strong><br />\nGive a whole new look to your Learndash pages with Learndash templates of Widgetkit for Elementor. Currently, there are four new templates that come with WidgetKit, but soon more layouts will be added.</p>\n<p><strong>Template Library (New)</strong><br />\nWe have brought the brand new template library available for both WidgetKit Pro and Free versions. From now on, preview or import your favorite templates on your page with one click.</p>\n<p><strong>Device Responsive</strong><br />\nWidgetkit is entirely device responsive. Your sections built with WidgetKit will always look the same on every device.</p>\n<p><strong>Uncompromisable Performance</strong><br />\nWidgetkit is developed with professional experienced developers. Therefore no messy codes or extra resources are loaded to slow down your site.</p>\n<p><strong><a href=\"https://widgetkit.themesgrove.com/lottie-animations/\" rel=\"nofollow ugc\">Lottifiles Animation (New)</a></strong><br />\nWidgetKit has brought the brand new Lottie animation element, which lets you make your site attractive with lots of animations. Use the link or JSON files from the lottiefiles and make elegant sections with cool animations instantly. Check out this video and do it yourself now.</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/roC1bZMJrWo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><strong>Woocommerce Integration &amp; Elements</strong><br />\nWidgetKit is not limited to general elements but it also allows you to customize your web store built with WooCommerce. There are four dedicated elements Woo Products, Woo Product Carousel, Woo Categories, Woo Recent Product. With these elements, you can highlight and manage your product more effectively and thus boost your sales.</p>\n<p><strong>Lms Integration &amp; Elements</strong><br />\nIf you are creating an education site you can make it more lucrative with WidgetKit. It doesn’t matter if you are using an LMS as WidgetKit provides integration and elements for popular 3 lms’s – LearnDash, Sensei &amp; LearnPress. Be free and customize your site according to your own will with WidgetKit.</p>\n<p><strong>Dedicated Support</strong><br />\nWidgetkit team is always ready to aid you in your queries and problem regarding widgetkit. Ask your questions in the email support, we will try to reply and solve your problem asap.</p>\n<h3><a href=\"http://widgetkit.themesgrove.com/\" rel=\"nofollow ugc\">Check Live Demo</a></h3>\n<h3>28+ Free Elements And Counting</h3>\n<ol>\n<li><a href=\"https://widgetkit.themesgrove.com/animated-headline\" rel=\"nofollow ugc\">Animated Headline</a> &#8211; Create elegant headlines with the help of Animated Headline element. Your selected text will animate in different ways with and visitors will be attracted easily.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/button\" rel=\"nofollow ugc\">Button + Modal</a> &#8211; The trend of old button and modal is over, WidgetKit offers 10 elegant buttons &amp; hover effect that completely changes the look of your site.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Blog Carousel</a> &#8211; Set your blog in the carousel style with this element. Swipe to the next blog by clicking the arrows.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Blog Hover Animation</a> &#8211; Stylish blog section specially built to catch the eyesight of the users. Try the hover effects and apply the one you like.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Blog Image</a> &#8211; Blog image element comes with a typical blogging style with text on one side and image on others.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Click to Tweet</a> &#8211; A simple twitter button with lots of customization options.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/contact-form/\" rel=\"nofollow ugc\">Contact Form</a> &#8211; Forms are needed in every aspect and therefore WidgetKit brings Contact Form element. Now you don’t need to run for several plugins, make any kind of forms with WidgetKit.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/content-carousel/\" rel=\"nofollow ugc\">Content Carousel</a> &#8211; Give wings to your content with the content carousel element of WidgetKit. Show content from the center, keep it standstill or autoplay it. You have the control to do everything.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/countdown\" rel=\"nofollow ugc\">Countdown</a> &#8211; Add a countdown to your special occasions or events but make it special with Widgetkit. Style the way you want, then make it more exciting with a countdown to the end.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/filterable-portfolio\" rel=\"nofollow ugc\">Filterable Portfolio</a> &#8211; Put life to your portfolio items with this element of WidgetKit. Play with different styles and customizations than show it to your visitors.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/gallery/\" rel=\"nofollow ugc\">Gallery</a> &#8211; Does the gallery showcase images in only one way? Think again. With gallery element of WidgetKit showcase your images in many ways. All you have to do is turn on your creative mind.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/image-box\" rel=\"nofollow ugc\">Hover Image</a> &#8211; Add different hover effect on images that intelligently show your credibility. Choose from five different hover effects and let glow your image.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/info-box\" rel=\"nofollow ugc\">Info Box</a> &#8211; Organize and show your site’s info smartly with Info box element of WidgetKit. Give your preferred info with the icon, link, text, and your info box will be ready.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/image-compare/\" rel=\"nofollow ugc\">Image Compare</a> &#8211; Are you a designer or photo editor who often needs to showcase their elegant works in a before-after form in a slider? This is a perfect element for this type of work.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/pricing\" rel=\"nofollow ugc\">Pricing Single</a> &#8211; Regular pricing table with a touch of professional that portraits your pricing table and highlights your features.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/pricing\" rel=\"nofollow ugc\">Pricing Icon</a> &#8211; The standard pricing table modified with gorgeous icons, choose your desired one, and make it more attractive.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/pricing\" rel=\"nofollow ugc\">Pricing Tabs</a> &#8211; Arrange multiple pricing tables, just under one single one tab. Manage all tabs smartly and save your space.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Pros &amp; Cons</a> &#8211; Comparison always has an impact on your sales. With the Pros &amp; Cons element, you can show a comparison of your product and also show the good sides along with bad ones.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/slider\" rel=\"nofollow ugc\">Slider Animation</a> &#8211; The regular slider element with collapsable animation that meets all the minimum requirements for every user. Use it in every regular site or as per your needs.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/slider\" rel=\"nofollow ugc\">Slider Content</a> &#8211; This element comes with a regular slider, in addition, it has a content layout that allows you to highlight your content intelligently.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/slider\" rel=\"nofollow ugc\">Slider Box</a> &#8211; Slider box animation element lets you define your slider a little bit differently with box style. It’s a unique style that catches the focus of visitors easily.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/social-share/\" rel=\"nofollow ugc\">Social Share Animation</a> &#8211; Do you like people to share your posts? Well, then use the social share animation element. This element comes with lucrative animation that makes sharing more attractive to viewers.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/social-share/\" rel=\"nofollow ugc\">Social Share Collapse</a> &#8211; Highlight your portfolio section with a stylish social share collapse element that comes with collapsible social share buttons.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/testimonial\" rel=\"nofollow ugc\">Testimonial</a> &#8211; Create magnificent testimonials with uniques looks with WidgetKit’s testimonial element. Set your testimonials then enable the autoplay and let the social proofing work.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/team\" rel=\"nofollow ugc\">Team</a> &#8211; A perfect element to introduce your team to your visitors. Showcase your team members with various styles using images, texts, social links, etc.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/tilt-box\" rel=\"nofollow ugc\">Tilt Box</a> &#8211; Give a smooth 3D effect to your images with the tilt box element of WidgetKit. It will steal the sight of your visitor and force them to glare at it.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Video Popup</a> &#8211; Place your youtube, Vimeo video links, and make them pop up on the screen. Or set the autoplay option, the visitor will find it more interesting.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/lottie-animations\" rel=\"nofollow ugc\">Lottie Animation</a> &#8211; Make your site more attractive with lots of elegant animations from Lottie files. With the Lottie Animation element use the JSON link and your animation will be ready instantly.</li>\n</ol>\n<h3>(27+) More Elements for <a href=\"https://themesgrove.com/widgetkit-for-elementor/\" rel=\"nofollow ugc\">Pro Version</a></h3>\n<ol>\n<li><a href=\"https://widgetkit.themesgrove.com/post-tab/\" rel=\"nofollow ugc\">Post Tab</a> &#8211; Design got no ending. Check out the post tab element demo and know for yourself how you can organize and showcase your posts.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/post-carousel/\" rel=\"nofollow ugc\">Post Carousel</a> &#8211; Engage with more visitors with the help of Post carousel element. Visitors don’t need to scroll through posts, the post will automatically slide one after the other.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/smart-list-2/\" rel=\"nofollow ugc\">Smart List</a> &#8211; Show your posts smartly in a list with help of Smart list element of WidgetKit. A list is not only up to down, rather it can be shown in many ways. Try it with smart list element.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/grid-slider/\" rel=\"nofollow ugc\">Grid Slider</a> &#8211; Showcase your posts in grid style along with slider. Grid slider enables you to show many post at one place in a gridbox slider.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/headline-slider/\" rel=\"nofollow ugc\">Headline Slider</a> &#8211; Most of the time we read the headlines, therefore WidgetKit brought Headline slider. Let your visitor read the headlines and choose his desired topic.</li>\n<p><strong>Elements For WooCommerce </strong></p>\n<li><a href=\"https://widgetkit.themesgrove.com/woo-products/\" rel=\"nofollow ugc\">Woo Products</a> &#8211; Showcase your woocommerce products elegantly with Woo Products element of WidgetKit. Catch their attraction first then convert them to your client.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/woo-product-carousel/\" rel=\"nofollow ugc\">Woo Product Carousel</a> &#8211; Products need to be organized in a better way in order to get more sales. Organize and showcase your products in the way your clients like with Woo Product Carousel element.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/woo-category/\" rel=\"nofollow ugc\">Woo Categories</a> &#8211; Highlight your product categories in a unique way with this element. All you have to do is set the products and select the categories.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Woo Recent Product</a> &#8211; New products always catch the eyesight of clients rather than old products. Showcase your recent product attractively with Woo recent product element of WidgetKit.</li>\n<p><strong>Elements For LearnPress LMS</strong></p>\n<li><a href=\"https://widgetkit.themesgrove.com/learnpress-course-list/\" rel=\"nofollow ugc\">Learnpress Course list</a> &#8211; LearnPress Course List element organize your LearnPress courses in a list order so that your viewer can easily find out their desired courses not to click anywhere.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/learnpress-course-tab/\" rel=\"nofollow ugc\">Learnpress Course Tab</a> &#8211; LearnPress Course Tab allows you to display all your LearnPress courses in a tabbed order and it loads its data on demand. You can also showcase your course with carousel style.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learnpress Categories</a> &#8211; Organize your courses, category wise with help of Learnpress categories element. Only selecting the categories is enough, rest will be managed by element.</li>\n<p><strong>Elements For Sensei LMS</strong></p>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Sensei Course List</a> &#8211; Bring all your sensei courses under one list with the help of this element. Your visitor will find their preferred course easily and will be able to enroll.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Sensei Course Tab</a> &#8211; Save some space and show more courses conveniently with the Sensei course tab element of Widgetkit.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Sensei Categories</a> &#8211; Another Sensei element that showcases your courses category wise. If you thinking about showcasing your courses, choose this element.</li>\n<p><strong>Elements For LearnDash LMS</strong></p>\n<li><a href=\"https://widgetkit.themesgrove.com/learndash-course-list/\" rel=\"nofollow ugc\">Learndash Course List</a> &#8211; Organize all your courses in a list order with Learndash course list element, so that your viewer can easily find out their desired course.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/learndash-course-tab/\" rel=\"nofollow ugc\">Learndash Course Tab</a> &#8211; Showing all courses in a place may not look good. For solving this problem Learndash course tab is introduced, so that you can showcase many courses in tabbed order.</li>\n<p><strong>More Elements For LearnDash LMS</strong></p>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Banner</a> &#8211; Highlight the banner of your Learndash course and attract more learners with help of Learndash course banner element of WidgetKit.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Certificate</a> &#8211; What’s the point if there is no proof of learning? Give this proof through certification and do it easily with Learndash course certificate element.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Enrollment</a> &#8211; Make the enrollment process easy and help more students to enroll in your course with the Learndash course enrollment element. Give details of the period, course fee and any other details you like in one field.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Course Meta Info</a> &#8211; Let your learners know what type, of course, he is going to learn. This helps him to get more determined. Do it easily with Course meta info element.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Progress</a> &#8211; Let your learners know about their progress. Learndash course progress element lets you show the progress of every student.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Resource</a> &#8211; With Learndash course resource element let your learners know about the course resources. Such as the number of lessons, quizzes, skill level, etc.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Tab Content</a> &#8211; Show your important contents of course in tabbed order with the learndash course tab content element.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Related Course</a> &#8211; Show related courses in an elegant manner with the learndash related course element. This will help your learners to choose more relevant courses.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Curriculum</a> &#8211; Make the course curriculum interesting with Learndash course curriculum element. Show al the course content at one place with this element.</li>\n<li><a href=\"https://widgetkit.themesgrove.com/#\" rel=\"nofollow ugc\">Learndash Course Instructor</a> &#8211; Smartly represent your course instructors with the help of learndash course instructor element. </li>\n</ol>\n<h3>Documentation and Support</h3>\n<p>Widgetkit team is always ready to aid you in your queries and problems regarding widgetkit.</p>\n<ul>\n<li>For tutorials and documentation go to our <a href=\"https://themesgrove.com/support/widgetkit/\" rel=\"nofollow ugc\">support</a> page. </li>\n<li>If you have any questions, you can contact us through mail </li>\n<li>To know about more information, features, FAQs check our website at <a href=\"https://themesgrove.com/widgetkit-for-elementor/\" rel=\"nofollow ugc\">https://themesgrove.com/widgetkit-for-elementor/</a></li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/OMNPazwUJN8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<h3>Love Widgetkit?</h3>\n<ul>\n<li>Join our <a href=\"https://www.facebook.com/groups/widgetkitcommunity/\" rel=\"nofollow ugc\">Facebook Group</a>.</li>\n<li>Check out tutorials from our <a href=\"https://www.youtube.com/channel/UCgX3XEMBg3MyGzqfD7J384w\" rel=\"nofollow ugc\">Youtube Channel</a>. </li>\n<li>Rate us on <a href=\"https://wordpress.org/support/plugin/widgetkit-for-elementor/reviews/?rate=5#new-post\" rel=\"ugc\">WordPress</a>.</li>\n</ul>\n<h3>Now What?</h3>\n<p>If you like WidgetKit plugin, then consider checking out our other WordPress products:</p>\n<ul>\n<li><a href=\"https://themesgrove.com/free-one-page-responsive-wordpress-theme/\" rel=\"nofollow ugc\">Switch</a> &#8211; Best free onepage business theme for WordPress, that lets you do more.</li>\n<li><a href=\"https://themesgrove.com/wp-onepager/\" rel=\"nofollow ugc\">WPOnepager</a> &#8211; Easiest landing page builder that really lets you do it in minutes.</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.5.1.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/widgetkit-for-elementor/assets/screenshot-1.png?rev=2142437",
            "caption": "Recent Posts"
        },
        {
            "src": "https://ps.w.org/widgetkit-for-elementor/assets/screenshot-2.png?rev=2142437",
            "caption": "Slider"
        },
        {
            "src": "https://ps.w.org/widgetkit-for-elementor/assets/screenshot-3.png?rev=2142437",
            "caption": "Team Elements"
        },
        {
            "src": "https://ps.w.org/widgetkit-for-elementor/assets/screenshot-4.png?rev=2142437",
            "caption": "Pricing Table"
        },
        {
            "src": "https://ps.w.org/widgetkit-for-elementor/assets/screenshot-5.png?rev=2142437",
            "caption": "Featured Image and Icon box"
        }
    ],
    "tags": {
        "add-ons": "add-ons",
        "elementor": "elementor",
        "elementor-addons": "elementor addons",
        "elementor-widgets": "elementor widgets",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "2.5.1",
    "versions": {
        "1.0.2": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.0.5.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.1.2.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.2.0.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.2.2.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.3.0.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.5.3.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.5.4.zip",
        "1.5.5": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.5.5.zip",
        "1.5.6": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.5.6.zip",
        "1.5.7": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.5.7.zip",
        "1.5.7.1": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.5.7.1.zip",
        "1.5.8": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.1.5.8.zip",
        "2.0": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.0.zip",
        "2.1": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.1.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.1.1.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.2.1.zip",
        "2.3": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.1.zip",
        "2.3.10": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.10.zip",
        "2.3.11": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.11.zip",
        "2.3.12": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.12.zip",
        "2.3.13": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.13.zip",
        "2.3.14": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.14.zip",
        "2.3.14.1": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.14.1.zip",
        "2.3.15": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.15.zip",
        "2.3.16": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.16.zip",
        "2.3.16.1": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.16.1.zip",
        "2.3.17": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.17.zip",
        "2.3.18": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.18.zip",
        "2.3.19": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.19.zip",
        "2.3.2": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.2.zip",
        "2.3.3": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.3.zip",
        "2.3.4": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.4.zip",
        "2.3.5": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.5.zip",
        "2.3.6": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.6.zip",
        "2.3.7": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.7.zip",
        "2.3.7.1": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.7.1.zip",
        "2.3.7.2": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.7.2.zip",
        "2.3.7.3": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.7.3.zip",
        "2.3.7.4": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.7.4.zip",
        "2.3.8": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.8.zip",
        "2.3.9": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.3.9.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.4.0.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.4.1.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.4.2.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.4.3.zip",
        "2.4.4": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.4.4.zip",
        "2.4.5": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.4.5.zip",
        "2.4.6": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.4.6.zip",
        "2.4.7": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.4.7.zip",
        "2.4.8": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.4.8.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.5.0.zip",
        "2.5.1": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.2.5.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/widgetkit-for-elementor.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://themesgrove.com/",
    "banners": {
        "low": "https://ps.w.org/widgetkit-for-elementor/assets/banner-772x250.jpg?rev=2158618",
        "high": "https://ps.w.org/widgetkit-for-elementor/assets/banner-1544x500.jpg?rev=2158618"
    },
    "icons": {
        "1x": "https://ps.w.org/widgetkit-for-elementor/assets/icon-128x128.png?rev=2158618",
        "2x": "https://ps.w.org/widgetkit-for-elementor/assets/icon-256x256.png?rev=2158618"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 90,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}