{
    "name": "Lucky Wheel for WooCommerce &#8211; Spin a Sale",
    "slug": "woo-lucky-wheel",
    "version": "1.1.4",
    "author": "<a href=\"http://villatheme.com\">VillaTheme</a>",
    "author_profile": "https://profiles.wordpress.org/villatheme/",
    "contributors": {
        "villatheme": {
            "profile": "https://profiles.wordpress.org/villatheme/",
            "avatar": "https://secure.gravatar.com/avatar/973d0ef458adb8a3c527f196b9529909?s=96&d=monsterid&r=g",
            "display_name": "VillaTheme"
        },
        "mrt3vn": {
            "profile": "https://profiles.wordpress.org/mrt3vn/",
            "avatar": "https://secure.gravatar.com/avatar/cb8ecbc2ffe02a20ea2f5d1da26d3a22?s=96&d=monsterid&r=g",
            "display_name": "Andy Ha"
        }
    },
    "requires": "5.0",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [
        "woocommerce"
    ],
    "compatibility": [],
    "rating": 90,
    "ratings": {
        "5": 15,
        "4": 2,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 19,
    "support_url": "https://wordpress.org/support/plugin/woo-lucky-wheel/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 74650,
    "last_updated": "2024-07-03 04:52:00",
    "added": "2018-03-21",
    "homepage": "",
    "sections": {
        "description": "<p>Lucky wheel spin and win attract customers to subscribe through spinning the lucky wheel and gain prize. Lucky wheel spin and win will encourage customers to come back your website to purchase, increase traffic and improve sales and revenue.</p>\n<p>WooCommerce Lucky Wheel is a WooCommerce extension that helps you to convert your site traffic into customers or at least, an email subscriber. It takes you a lot of work and money to have traffic to your store, so don’t waste it. Lucky wheel spin and win offers visitor entering their email address to spin the lucky wheel. Then the plugin will send a discount coupon to the subscribed email address. The subscribed email addresses from lucky wheel spin and win will be saved in back-end.</p>\n<blockquote>\n<p><a href=\"http://new2new.com/?item=woocommerce-lucky-wheel\" title=\"Demo Lucky Wheel for WooCommerce\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"http://docs.villatheme.com/?item=woocommerce-lucky-wheel\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/qXBNY\" rel=\"nofollow ugc\">Premium version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<p>&#9658; <strong>You can learn how to set Lucky wheel spin and win seeing this video guide</strong>:</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ISib_bJsqug?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<ul>\n<li>\n<p>Allowing customers to subscribe emails through lucky wheel spin and win for discount coupons.</p>\n</li>\n<li>\n<p>Auto-generate unique coupons with selected options.</p>\n</li>\n<li>\n<p>Send coupon code to the email address that is required to spin the wheel.</p>\n</li>\n</ul>\n<h3>IMPORTANT NOTICE:</h3>\n<ul>\n<li>\n<p>The plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use the plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES:</h3>\n<p>&#9658; <strong>LUCKY WHEEL POP-UP</strong></p>\n<p>WooCommerce Lucky Wheel displays a Lucky Wheel pop-up when users visit your website. Allowing them subscribing emails and spin to win prizes.</p>\n<ul>\n<li>\n<p><strong>6 Wheel Slices</strong>: Free to add/remove wheel slices, can be up to 6 slices for the free version.</p>\n</li>\n<li>\n<p><strong>Wheel label</strong>: Add a custom label for each wheel slide.</p>\n</li>\n<li>\n<p><strong>Winning probability</strong>: Select the winning probability of each slide.</p>\n</li>\n<li>\n<p><strong>Pop-up Intent</strong>: Select to let customers open the Wheel by click on the wheel pop-up or let the wheel appears automatically.</p>\n</li>\n<li>\n<p><strong>Lucky Wheel icon</strong>: A small lucky wheel icon, allow visitors to open the Luck Wheel pop-up.</p>\n</li>\n<li>\n<p><strong>Spinning Time</strong>: select how many time an email address can be used to spin the wheel.</p>\n</li>\n<li>\n<p><strong>Pop-up position</strong>: Select where the Wheel pop-up appears on front-end, there are 6 positions to be selected Top left, Top right, Bottom left, Bottom right, Middle left, Middle right.</p>\n</li>\n<li>\n<p><strong>Wheel Description</strong>: Display the description of the wheel. This will be displayed in front-end.</p>\n</li>\n<li>\n<p><strong>Custom fields</strong>: You can add up to 2 fields to your Lucky Wheel pop-up, including email, name.</p>\n</li>\n<li>\n<p><strong>Hide pop-up</strong>: Hide the wheel pop-up on front-end, this option should enable only when you selected the automatically display on the Intent option.</p>\n</li>\n<li>\n<p><strong>Initial showing time</strong>: Select an initial showing time when the pop-up is hidden.</p>\n</li>\n<li>\n<p><strong>Delay Between Each Spin Of An Email</strong>: Select the delay time between each spin of an email</p>\n</li>\n<li>\n<p><strong>Show pop-up after a successful spin</strong>: Select a delay time for the pop-up to reappear after a successful spin.</p>\n</li>\n<li>\n<p><strong>Assign pages</strong>: Select to display the pop-up only on Home, Blog or Shop page.</p>\n</li>\n<li>\n<p><strong>Conditional Tags</strong>: Using WordPress conditional tags to configure which pages where the wheel pop-up will appear.</p>\n</li>\n</ul>\n<h3>DESIGN LUCKY WHEEL SPIN AND WIN :</h3>\n<ul>\n<li>\n<p><strong>Preview</strong>: The plugin allows you to preview the wheel in your backend.</p>\n</li>\n<li>\n<p><strong>Coupon value type</strong>: Select a coupon value type for each piece, there are 6 options for you to select: Non (win nothing), Existing coupon, percentage discount, fixed product discount, fixed cart discount.</p>\n</li>\n<li>\n<p><strong>Label</strong>: Type in a label for each wheel piece, this label will be displayed on the front-end.</p>\n</li>\n<li>\n<p><strong>Value</strong>: If the wheel piece value type is “Existing coupon” then you need to paste the coupon code into this field.<br />\nIf the wheel piece value is “Non” then you can leave this field empty. If the wheel piece value is another discount<br />\ntype, then you will need to put in the amount of the discount. The plugin will automatically generate coupons with that amount.</p>\n</li>\n<li>\n<p><strong>Valued-coupon Slices Label</strong>: Enter the valued coupon piece label using the shortcode {coupon_amount}</p>\n</li>\n<li>\n<p><strong>Winning probability</strong>: Configure the winning probability of each piece (as percentages), all piece winning probability total must be 100%.</p>\n</li>\n<li>\n<p><strong>Piece background color</strong>: Pick up a background color for each piece.</p>\n</li>\n<li>\n<p><strong>Auto color</strong>: Let the plugin automatically pick-up piece colors.</p>\n</li>\n<li>\n<p><strong>Clone piece</strong>: Clone a piece with the same values for all options</p>\n</li>\n<li>\n<p><strong>Remove piece</strong>: Allow you to completely delete a piece.</p>\n</li>\n<li>\n<p><strong>Wheel description</strong>: Write a Wheel description describe the wheel to your customer using an HTML form, you can add pictures to the description.</p>\n</li>\n<li>\n<p><strong>Background</strong>: Upload a photo or pick up a color to use as the wheel window background.</p>\n</li>\n<li>\n<p><strong>Spin button text</strong>: Type in the text the spin now button SPIN NOW, TRY YOUR LUCK&#8230;)</p>\n</li>\n<li>\n<p><strong>Spin button color</strong>: Design the wheel button with text and background color.</p>\n</li>\n<li>\n<p><strong>Pointer Color</strong>: Select a color for the wheel pointer.</p>\n</li>\n<li>\n<p><strong>Wheel center color</strong>: Select a color for the wheel center area.</p>\n</li>\n<li>\n<p><strong>Not to display again</strong>: Enable option to let customer hide the wheel for a time.</p>\n</li>\n<li>\n<p><strong>Automatically hide wheel after finish spinning</strong>: After a successful spin the wheel will be hidden</p>\n</li>\n<li>\n<p><strong>EMAILS</strong>: A congratulation email will be sent if a customer winning a prize be spinning the wheel.  The email will be sent to the email address that the customer has just typed in.</p>\n</li>\n<li>\n<p><strong>Winning email</strong>: Configure the email with Subject, Heading, and content. You can use shortcodes to configure the email content.</p>\n</li>\n<li>\n<p><strong>Front-end message</strong>: There are two cases of messages that will be displayed on front-end. A message for the case that a customer wins something. Another for the case that a customer hit the piece with “non” value type.</p>\n</li>\n<li>\n<p><strong>Shortcodes</strong>: Shortcodes are available for you to display values to front-end, use these shortcodes to design front-end message and emails</p>\n</li>\n<li>\n<p><strong>Available shortcodes</strong>:</p>\n<p>{customer_name}: display the customer name.<br />\n{coupon_code}: The coupon code, it can be an existing coupon or coupons that are generated by the plugin.<br />\n{coupon_label}: The label of the piece that customer hit be spinning the wheel.<br />\n{date_expires}: The expires date of the coupon.<br />\n{checkout}: Display a “checkout” text that links to the checkout page.<br />\n{customer_email}: The email address that won the prize.</p>\n</li>\n<li>\n<p><strong>COUPON</strong>: Select an existing or let the plugin automaticallly generate coupons with the same option like in<br />\nWooCommerce system.</p>\n</li>\n</ul>\n<h3>GENERATE AND SEND COUPON</h3>\n<ul>\n<li>\n<p>**WooCommerce Lucky Wheel generates unique coupons with given values.</p>\n</li>\n<li>\n<p><strong>Existing coupons</strong>: select a WooCommerce coupon to use as the prize for each slide.</p>\n</li>\n<li>\n<p><strong>Unique coupons</strong>: Create a unique lucky wheel coupon like the way to generate WooCommerce Coupons. You can add a suffix title for this unique coupon to distinguish it from other coupon types.</p>\n</li>\n<li>\n<p><strong>Front-end message</strong>: the plugin allows you to create and display different messages when customers win a prize or do not win. Use shortcodes to display necessary information in your message. {coupon_label}: the label of coupon that customers win.{checkout}: “Checkout” with a link to the checkout page. {customer_name}: customers’ name if they enter. {customer_email}: the email that customers enter to spin. {coupon_code}: coupon code/customs value will be sent to the customer.</p>\n</li>\n<li>\n<p><strong>Coupon email</strong>: coupons will be sent to the winner automatically. The plugin provides shortcodes to display information:{customer_name}: customer’s name.{coupon_code}: coupon code.{date_expires}: the expiry date of the coupon.{coupon_label}: the label of the wheel slide that the visitor hit when spinning the wheel.{featured_products}: display a list of featured products.{shop_now}: display a “Shop Now” button in the email, redirect to your shop page.</p>\n</li>\n</ul>\n<h3>COLLECT EMAIL FROM LUCKY WHEEL SPIN AND WIN:</h3>\n<p>Subscribed emails from lucky wheel spin and win will be saved to your database. You can export to have CSV files of email addresses.</p>\n<ul>\n<li>\n<p><strong>Save Emails</strong>: you can view subscribed emails in the plugin’s backend with email addresses, subscribed time, customer name, phone number, spun time, coupons, wheel slide label of the last spin.</p>\n</li>\n<li>\n<p><strong>Export CSV file</strong>: select a date range and export subscribed email at that time into a CSV file.</p>\n</li>\n<li>\n<p><strong>Report</strong>: the report feature allows you to check the quantity of subscribed emails, spins, given coupons at a specific time.</p>\n</li>\n</ul>\n<h3>PRO VERSION:</h3>\n<ul>\n<li>\n<p><strong>More slices</strong>: Can add up to 20 slices</p>\n</li>\n<li>\n<p><strong>Multilingual support</strong>: All text fields on frontend(except wheel labels) and coupon emails are available in multi languages if WPML or Polylang is active on your site.</p>\n</li>\n<li>\n<p><strong>Shortcode</strong>: You can use shortcode [woocommerce_lucky_wheel] to display wheel on a specific page without popup</p>\n</li>\n<li>\n<p><strong>Admin notification</strong>: Able to send email to admin or to a specific address whenever a customer win a prize.</p>\n</li>\n<li>\n<p><strong>More trigger to show wheel</strong>: Scroll, exit</p>\n</li>\n<li>\n<p><strong>Email API</strong>: Mailchimp, ActiveCampaign and SendGrid integrated</p>\n</li>\n<li>\n<p><strong>Shortcode {featured_products}, button {shop_now} and suggested products for emails</strong>:  With customizable title, url, color, background color and font size</p>\n</li>\n<li>\n<p><strong>Wheel center background image</strong>: This the best position to put your logo.</p>\n</li>\n<li>\n<p><strong>Wheel Border Color</strong>: Select a wheel border color.</p>\n</li>\n<li>\n<p><strong>Wheel Border Dot Color</strong>: Select a dot color, dots will appear win the wheel border.</p>\n</li>\n<li>\n<p><strong>Wheel Spinning Duration</strong>: Select the time the wheel spin before stop and display the result.</p>\n</li>\n<li>\n<p><strong>Pointer Position</strong>: Select the wheel pointer position center, top, right or bottom</p>\n</li>\n<li>\n<p><strong>Background effect</strong>: Snow effect</p>\n</li>\n<li>\n<p><strong>Change wheel size</strong>:</p>\n</li>\n<li>\n<p><strong>Custom field</strong>: More field to add mobile</p>\n</li>\n<li>\n<p><strong>Text color</strong>: Able to set text color for each slice</p>\n</li>\n<li>\n<p><strong>Spin duration</strong>: Can be set from 3s to 15s</p>\n</li>\n<li>\n<p><strong>Premium support</strong>: We response to all support topics within 24 hours on weekday (a bit longer over weekend)</p>\n</li>\n</ul>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Customers can order and pay before it&#8217;s intended release date to guarantee a copy.</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-lucky-wheel\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com/extensions/woocommerce-lucky-wheel/\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-lucky-wheel\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
        "installation": "<ol>\n<li>Unzip the download package</li>\n<li>Upload <code>woo-lucky-wheel</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "changelog": "<p>/<strong>1.1.4 &#8211; 2024.07.03</strong>/<br />\n&#8211; Fixed: Style pointer<br />\n– Updated: Compatible WC 9.0.2 and  WP 6.5.5<br />\n&#8211; Updated: Security update<br />\n&#8211; Updated: Update support file</p>\n<p>/<strong>1.1.3 &#8211; 2024.04.13</strong>/<br />\n– Added: do_shortcode email content<br />\n– Updated: Compatible WC 8.7 and  WP 6.5.2<br />\n&#8211; Fixed: Display GDPR</p>\n<p>/<strong>1.1.2 &#8211; 2023.11.09</strong>/<br />\n– Updated: Compatible with HPOS &#8211; WC 8.2.2 and  WP 6.4.1<br />\n&#8211; Fixed: Get lists Mailchimp API</p>\n<p>/<strong>1.1.1 &#8211; 2023.09.22</strong>/<br />\n– Updated: Compatible with HPOS &#8211; WC 8.0.3 and  WP 6.3.0</p>\n<p>/<strong>1.1.0 &#8211; 2023.07.15</strong>/<br />\n– Updated: Compatible with HPOS &#8211; WC 7.8.0 and  WP 6.2.2<br />\n&#8211; Updated: Update support file</p>\n<p>/<strong>1.0.18 &#8211; 2023.02.28</strong>/<br />\n&#8211; Fixed: fix domain file name</p>\n<p>/<strong>1.0.17 &#8211; 2023.02.23</strong>/<br />\n&#8211; Updated: Update support file<br />\n– Updated: Compatible with WC 7.4.0 and WP6.1<br />\n– Updated: Language file</p>\n<p>/<strong>1.0.16 &#8211; 2022.06.02</strong>/<br />\n&#8211; Updated: Allow to set coupon value = 0</p>\n<p>/<strong>1.0.15 &#8211; 2022.05.21</strong>/<br />\n&#8211; Updated: Compatible WooCommerce 6.5.0 and WP6.0<br />\n&#8211; Updated: Update support file</p>\n<p>/<strong>1.0.14 &#8211; 2022.05.02</strong>/<br />\n&#8211; Fixed: Fixed mobile detect</p>\n<p>/<strong>1.0.13 &#8211; 2022.04.28</strong>/<br />\n&#8211; Fixed: Not showing the background image of the popup<br />\n&#8211; Updated: Compatible WooCommerce 6.4.0</p>\n<p>/<strong>1.0.12 &#8211; 2022.04.11</strong>/<br />\n&#8211; Updated: Security update</p>\n<p>/<strong>1.0.11 &#8211; 2022.04.07</strong>/<br />\n&#8211; Updated: Security update</p>\n<p>/**1.0.10 &#8211; 2022.03.29 **/<br />\n&#8211; Updated: Update support file</p>\n<p>/**1.0.9 &#8211; 2022.03.21 **/<br />\n&#8211; Updated: Compatible WP 5.9 and WooCommerce 6.3.0<br />\n&#8211; Updated: Update support file<br />\n&#8211; Fixed: The display error on the backend</p>\n<p>/**1.0.8.3 &#8211; 2021.12.26 **/<br />\n&#8211; Updated: Compatible WooCommerce 6.0.0</p>\n<p>/**1.0.8.2 &#8211; 2021.08.16 **/<br />\n&#8211; Updated: Compatible with WP 5.8 and WooCommerce 5.5<br />\n&#8211; Updated: Update support file</p>\n<p>/**1.0.8.1 &#8211; 2021.06.18 **/<br />\n&#8211; Updated: Update support file</p>\n<p>/**1.0.8 &#8211; 2021.06.01 **/<br />\n&#8211; Update: Dashboard notices</p>\n<p>/<strong>v1.0.7.9 &#8211; 2021.03.12</strong>/<br />\n&#8211; Updated: Remove default font-size of {coupon_code}</p>\n<p>/<strong>v1.0.7.8 &#8211; 2020.08.14</strong>/<br />\n&#8211; Updated: Compatible with WP 5.5 and WC4.3</p>\n<p>/<strong>v1.0.7.7 &#8211; 2020.06.16</strong>/<br />\n&#8211; Added: Some hooks for integration purpose woo_lucky_wheel_get_email_before_validating_email, woo_lucky_wheel_get_email, woo_lucky_wheel_get_email_response<br />\n&#8211; Updated: Compatible and WooCommerce 4.2</p>\n<p>/<strong>v1.0.7.6 &#8211; 2020.04.23</strong>/<br />\n&#8211; Updated: Class support</p>\n<p>/<strong>v1.0.7.5 &#8211; 2020.03.23</strong>/<br />\n&#8211; Updated: Compatible with WP 5.4 and WC4.0<br />\n&#8211; Updated: Class support</p>\n<p>/<strong>v1.0.7.4 &#8211; 2019.11.16</strong>/<br />\n&#8211; Updated: Compatible WP 5.3 and WooCommerce 3.8</p>\n<p>/<strong>v1.0.7.3 &#8211; 2019.10.09</strong>/<br />\n&#8211; Updated: Premium URL</p>\n<p><strong>v1.0.7.2 &#8211; 2019.08.16</strong><br />\n&#8211; Fixed: Currency symbol on wheel label does not displays space<br />\n&#8211; Changed: Wheel spins with css</p>\n<p><strong>v1.0.7.1 &#8211; 2019.05.10</strong><br />\n&#8211; Updated: Change plugin name<br />\n&#8211; Updated: Change premium version url</p>\n<p><strong>v1.0.7 &#8211; 2019.03.30</strong><br />\n&#8211; Fixed: Error when updating WooCommerce<br />\n&#8211; Updated: Able to dismiss ask-for-review message permanently</p>\n<p><strong>v1.0.6 &#8211; 2019.03.20</strong><br />\n&#8211; Fixed: Can not save settings when installing new in previous version<br />\n&#8211; Fixed: Warning message when save settings<br />\n&#8211; Updated: Make clicking &#8220;no thanks&#8221; have the same setting with &#8220;If customers close and not spin, show popup again after&#8221; option</p>\n<p><strong>v1.0.5 &#8211; 2019.01.14</strong><br />\n&#8211; Fixed: Option Show only on Homepage, Blog page and Shop page<br />\n&#8211; Fixed: Blurry text on mobile<br />\n&#8211; Added: Mailchimp API<br />\n&#8211; Added: Unique coupon include/exclude products/categories<br />\n&#8211; Added: Custom css field<br />\n&#8211; Added: Option to show full wheel on desktop<br />\n&#8211; Added: Preview emails<br />\n&#8211; Added: Preview wheel<br />\n&#8211; Added: Ajax endpoint<br />\n&#8211; Updated: Shorten coupon code<br />\n&#8211; Updated: All wheel slices labels is editable<br />\n&#8211; Updated: Optimize getting data<br />\n&#8211; Updated: Class support</p>\n<p><strong>v1.0.4.5 &#8211; 2018.11.21</strong><br />\n&#8211; Updated: Class support</p>\n<p><strong>v1.0.4.4 &#8211; 2018.11.10</strong><br />\n&#8211; Updated: Class support</p>\n<p><strong>v1.0.4.3 &#8211; 2018.10.17</strong><br />\n&#8211; Updated: Class support</p>\n<p><strong>v1.0.4.2 &#8211; 2018.10.15</strong><br />\n&#8211; Fixed: Class support</p>\n<p><strong>v1.0.4.1 &#8211; 2018.09.19</strong><br />\n&#8211; Fixed: Coupon select</p>\n<p><strong>v1.0.4 &#8211; 2018.09.08</strong><br />\n&#8211; Fixed: Ajax search product<br />\n&#8211; Fixed: Some texts not translated<br />\n&#8211; Added: Slices text color option<br />\n&#8211; Added: Option to set time to show popup again when customers close and do not spin<br />\n&#8211; Added: GDPR checkbox</p>\n<p><strong>v1.0.3.1 &#8211; 2018.05.11</strong><br />\n&#8211; Updated: Class support</p>\n<p><strong>v1.0.3 &#8211; 2018.04.26</strong><br />\n&#8211; Added: Select Google fonts<br />\n&#8211; Added: Class woocommerce-lucky-wheel-popup-icon to embed in elsewhere<br />\n&#8211; Fixed: Responsive on mobile</p>\n<p><strong>v1.0.2.1 &#8211; 2018.04.11</strong><br />\n&#8211; Fixed: Class support<br />\n&#8211; Updated: Remove CSS, JS</p>\n<p><strong>v1.0.2-2018.04.04</strong><br />\n&#8211; Added: Existing coupon<br />\n&#8211; Changed: Spinning speed<br />\n&#8211; Changed: Wheel settings(back end)</p>\n<p><strong>v1.0.1-2018.03.27</strong><br />\n&#8211; Added: Automatically show wheel<br />\n&#8211; Added: Auto generate slices color<br />\n&#8211; Added: Custom award type<br />\n&#8211; Added: Villatheme support</p>\n<p><strong>v1.0.0-2018.03.09</strong><br />\n&#8211; First release.</p>\n"
    },
    "short_description": "Collect customer&#039;s emails by spinning the lucky wheel game to get discount coupons.",
    "description": "<p>Lucky wheel spin and win attract customers to subscribe through spinning the lucky wheel and gain prize. Lucky wheel spin and win will encourage customers to come back your website to purchase, increase traffic and improve sales and revenue.</p>\n<p>WooCommerce Lucky Wheel is a WooCommerce extension that helps you to convert your site traffic into customers or at least, an email subscriber. It takes you a lot of work and money to have traffic to your store, so don’t waste it. Lucky wheel spin and win offers visitor entering their email address to spin the lucky wheel. Then the plugin will send a discount coupon to the subscribed email address. The subscribed email addresses from lucky wheel spin and win will be saved in back-end.</p>\n<blockquote>\n<p><a href=\"http://new2new.com/?item=woocommerce-lucky-wheel\" title=\"Demo Lucky Wheel for WooCommerce\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"http://docs.villatheme.com/?item=woocommerce-lucky-wheel\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/qXBNY\" rel=\"nofollow ugc\">Premium version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<p>&#9658; <strong>You can learn how to set Lucky wheel spin and win seeing this video guide</strong>:</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ISib_bJsqug?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<ul>\n<li>\n<p>Allowing customers to subscribe emails through lucky wheel spin and win for discount coupons.</p>\n</li>\n<li>\n<p>Auto-generate unique coupons with selected options.</p>\n</li>\n<li>\n<p>Send coupon code to the email address that is required to spin the wheel.</p>\n</li>\n</ul>\n<h3>IMPORTANT NOTICE:</h3>\n<ul>\n<li>\n<p>The plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use the plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES:</h3>\n<p>&#9658; <strong>LUCKY WHEEL POP-UP</strong></p>\n<p>WooCommerce Lucky Wheel displays a Lucky Wheel pop-up when users visit your website. Allowing them subscribing emails and spin to win prizes.</p>\n<ul>\n<li>\n<p><strong>6 Wheel Slices</strong>: Free to add/remove wheel slices, can be up to 6 slices for the free version.</p>\n</li>\n<li>\n<p><strong>Wheel label</strong>: Add a custom label for each wheel slide.</p>\n</li>\n<li>\n<p><strong>Winning probability</strong>: Select the winning probability of each slide.</p>\n</li>\n<li>\n<p><strong>Pop-up Intent</strong>: Select to let customers open the Wheel by click on the wheel pop-up or let the wheel appears automatically.</p>\n</li>\n<li>\n<p><strong>Lucky Wheel icon</strong>: A small lucky wheel icon, allow visitors to open the Luck Wheel pop-up.</p>\n</li>\n<li>\n<p><strong>Spinning Time</strong>: select how many time an email address can be used to spin the wheel.</p>\n</li>\n<li>\n<p><strong>Pop-up position</strong>: Select where the Wheel pop-up appears on front-end, there are 6 positions to be selected Top left, Top right, Bottom left, Bottom right, Middle left, Middle right.</p>\n</li>\n<li>\n<p><strong>Wheel Description</strong>: Display the description of the wheel. This will be displayed in front-end.</p>\n</li>\n<li>\n<p><strong>Custom fields</strong>: You can add up to 2 fields to your Lucky Wheel pop-up, including email, name.</p>\n</li>\n<li>\n<p><strong>Hide pop-up</strong>: Hide the wheel pop-up on front-end, this option should enable only when you selected the automatically display on the Intent option.</p>\n</li>\n<li>\n<p><strong>Initial showing time</strong>: Select an initial showing time when the pop-up is hidden.</p>\n</li>\n<li>\n<p><strong>Delay Between Each Spin Of An Email</strong>: Select the delay time between each spin of an email</p>\n</li>\n<li>\n<p><strong>Show pop-up after a successful spin</strong>: Select a delay time for the pop-up to reappear after a successful spin.</p>\n</li>\n<li>\n<p><strong>Assign pages</strong>: Select to display the pop-up only on Home, Blog or Shop page.</p>\n</li>\n<li>\n<p><strong>Conditional Tags</strong>: Using WordPress conditional tags to configure which pages where the wheel pop-up will appear.</p>\n</li>\n</ul>\n<h3>DESIGN LUCKY WHEEL SPIN AND WIN :</h3>\n<ul>\n<li>\n<p><strong>Preview</strong>: The plugin allows you to preview the wheel in your backend.</p>\n</li>\n<li>\n<p><strong>Coupon value type</strong>: Select a coupon value type for each piece, there are 6 options for you to select: Non (win nothing), Existing coupon, percentage discount, fixed product discount, fixed cart discount.</p>\n</li>\n<li>\n<p><strong>Label</strong>: Type in a label for each wheel piece, this label will be displayed on the front-end.</p>\n</li>\n<li>\n<p><strong>Value</strong>: If the wheel piece value type is “Existing coupon” then you need to paste the coupon code into this field.<br />\nIf the wheel piece value is “Non” then you can leave this field empty. If the wheel piece value is another discount<br />\ntype, then you will need to put in the amount of the discount. The plugin will automatically generate coupons with that amount.</p>\n</li>\n<li>\n<p><strong>Valued-coupon Slices Label</strong>: Enter the valued coupon piece label using the shortcode {coupon_amount}</p>\n</li>\n<li>\n<p><strong>Winning probability</strong>: Configure the winning probability of each piece (as percentages), all piece winning probability total must be 100%.</p>\n</li>\n<li>\n<p><strong>Piece background color</strong>: Pick up a background color for each piece.</p>\n</li>\n<li>\n<p><strong>Auto color</strong>: Let the plugin automatically pick-up piece colors.</p>\n</li>\n<li>\n<p><strong>Clone piece</strong>: Clone a piece with the same values for all options</p>\n</li>\n<li>\n<p><strong>Remove piece</strong>: Allow you to completely delete a piece.</p>\n</li>\n<li>\n<p><strong>Wheel description</strong>: Write a Wheel description describe the wheel to your customer using an HTML form, you can add pictures to the description.</p>\n</li>\n<li>\n<p><strong>Background</strong>: Upload a photo or pick up a color to use as the wheel window background.</p>\n</li>\n<li>\n<p><strong>Spin button text</strong>: Type in the text the spin now button SPIN NOW, TRY YOUR LUCK&#8230;)</p>\n</li>\n<li>\n<p><strong>Spin button color</strong>: Design the wheel button with text and background color.</p>\n</li>\n<li>\n<p><strong>Pointer Color</strong>: Select a color for the wheel pointer.</p>\n</li>\n<li>\n<p><strong>Wheel center color</strong>: Select a color for the wheel center area.</p>\n</li>\n<li>\n<p><strong>Not to display again</strong>: Enable option to let customer hide the wheel for a time.</p>\n</li>\n<li>\n<p><strong>Automatically hide wheel after finish spinning</strong>: After a successful spin the wheel will be hidden</p>\n</li>\n<li>\n<p><strong>EMAILS</strong>: A congratulation email will be sent if a customer winning a prize be spinning the wheel.  The email will be sent to the email address that the customer has just typed in.</p>\n</li>\n<li>\n<p><strong>Winning email</strong>: Configure the email with Subject, Heading, and content. You can use shortcodes to configure the email content.</p>\n</li>\n<li>\n<p><strong>Front-end message</strong>: There are two cases of messages that will be displayed on front-end. A message for the case that a customer wins something. Another for the case that a customer hit the piece with “non” value type.</p>\n</li>\n<li>\n<p><strong>Shortcodes</strong>: Shortcodes are available for you to display values to front-end, use these shortcodes to design front-end message and emails</p>\n</li>\n<li>\n<p><strong>Available shortcodes</strong>:</p>\n<p>{customer_name}: display the customer name.<br />\n{coupon_code}: The coupon code, it can be an existing coupon or coupons that are generated by the plugin.<br />\n{coupon_label}: The label of the piece that customer hit be spinning the wheel.<br />\n{date_expires}: The expires date of the coupon.<br />\n{checkout}: Display a “checkout” text that links to the checkout page.<br />\n{customer_email}: The email address that won the prize.</p>\n</li>\n<li>\n<p><strong>COUPON</strong>: Select an existing or let the plugin automaticallly generate coupons with the same option like in<br />\nWooCommerce system.</p>\n</li>\n</ul>\n<h3>GENERATE AND SEND COUPON</h3>\n<ul>\n<li>\n<p>**WooCommerce Lucky Wheel generates unique coupons with given values.</p>\n</li>\n<li>\n<p><strong>Existing coupons</strong>: select a WooCommerce coupon to use as the prize for each slide.</p>\n</li>\n<li>\n<p><strong>Unique coupons</strong>: Create a unique lucky wheel coupon like the way to generate WooCommerce Coupons. You can add a suffix title for this unique coupon to distinguish it from other coupon types.</p>\n</li>\n<li>\n<p><strong>Front-end message</strong>: the plugin allows you to create and display different messages when customers win a prize or do not win. Use shortcodes to display necessary information in your message. {coupon_label}: the label of coupon that customers win.{checkout}: “Checkout” with a link to the checkout page. {customer_name}: customers’ name if they enter. {customer_email}: the email that customers enter to spin. {coupon_code}: coupon code/customs value will be sent to the customer.</p>\n</li>\n<li>\n<p><strong>Coupon email</strong>: coupons will be sent to the winner automatically. The plugin provides shortcodes to display information:{customer_name}: customer’s name.{coupon_code}: coupon code.{date_expires}: the expiry date of the coupon.{coupon_label}: the label of the wheel slide that the visitor hit when spinning the wheel.{featured_products}: display a list of featured products.{shop_now}: display a “Shop Now” button in the email, redirect to your shop page.</p>\n</li>\n</ul>\n<h3>COLLECT EMAIL FROM LUCKY WHEEL SPIN AND WIN:</h3>\n<p>Subscribed emails from lucky wheel spin and win will be saved to your database. You can export to have CSV files of email addresses.</p>\n<ul>\n<li>\n<p><strong>Save Emails</strong>: you can view subscribed emails in the plugin’s backend with email addresses, subscribed time, customer name, phone number, spun time, coupons, wheel slide label of the last spin.</p>\n</li>\n<li>\n<p><strong>Export CSV file</strong>: select a date range and export subscribed email at that time into a CSV file.</p>\n</li>\n<li>\n<p><strong>Report</strong>: the report feature allows you to check the quantity of subscribed emails, spins, given coupons at a specific time.</p>\n</li>\n</ul>\n<h3>PRO VERSION:</h3>\n<ul>\n<li>\n<p><strong>More slices</strong>: Can add up to 20 slices</p>\n</li>\n<li>\n<p><strong>Multilingual support</strong>: All text fields on frontend(except wheel labels) and coupon emails are available in multi languages if WPML or Polylang is active on your site.</p>\n</li>\n<li>\n<p><strong>Shortcode</strong>: You can use shortcode [woocommerce_lucky_wheel] to display wheel on a specific page without popup</p>\n</li>\n<li>\n<p><strong>Admin notification</strong>: Able to send email to admin or to a specific address whenever a customer win a prize.</p>\n</li>\n<li>\n<p><strong>More trigger to show wheel</strong>: Scroll, exit</p>\n</li>\n<li>\n<p><strong>Email API</strong>: Mailchimp, ActiveCampaign and SendGrid integrated</p>\n</li>\n<li>\n<p><strong>Shortcode {featured_products}, button {shop_now} and suggested products for emails</strong>:  With customizable title, url, color, background color and font size</p>\n</li>\n<li>\n<p><strong>Wheel center background image</strong>: This the best position to put your logo.</p>\n</li>\n<li>\n<p><strong>Wheel Border Color</strong>: Select a wheel border color.</p>\n</li>\n<li>\n<p><strong>Wheel Border Dot Color</strong>: Select a dot color, dots will appear win the wheel border.</p>\n</li>\n<li>\n<p><strong>Wheel Spinning Duration</strong>: Select the time the wheel spin before stop and display the result.</p>\n</li>\n<li>\n<p><strong>Pointer Position</strong>: Select the wheel pointer position center, top, right or bottom</p>\n</li>\n<li>\n<p><strong>Background effect</strong>: Snow effect</p>\n</li>\n<li>\n<p><strong>Change wheel size</strong>:</p>\n</li>\n<li>\n<p><strong>Custom field</strong>: More field to add mobile</p>\n</li>\n<li>\n<p><strong>Text color</strong>: Able to set text color for each slice</p>\n</li>\n<li>\n<p><strong>Spin duration</strong>: Can be set from 3s to 15s</p>\n</li>\n<li>\n<p><strong>Premium support</strong>: We response to all support topics within 24 hours on weekday (a bit longer over weekend)</p>\n</li>\n</ul>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Customers can order and pay before it&#8217;s intended release date to guarantee a copy.</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-lucky-wheel\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com/extensions/woocommerce-lucky-wheel/\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-lucky-wheel\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/woo-lucky-wheel.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/woo-lucky-wheel/assets/screenshot-1.jpg?rev=2501110",
            "caption": "Subscribe email on popup"
        }
    ],
    "tags": {
        "fortune-wheel": "fortune wheel",
        "lucky-wheel": "lucky wheel",
        "mailchimp": "mailchimp",
        "wheelio-for-woocommerce": "wheelio for woocommerce",
        "woocommerce-fortune-wheel": "woocommerce fortune wheel"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.villatheme.com/donate",
    "banners": {
        "low": "https://ps.w.org/woo-lucky-wheel/assets/banner-772x250.jpg?rev=3080878",
        "high": "https://ps.w.org/woo-lucky-wheel/assets/banner-1544x500.jpg?rev=3080878"
    },
    "icons": {
        "1x": "https://ps.w.org/woo-lucky-wheel/assets/icon-128x128.gif?rev=3080878"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 90,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "woo-lucky-wheel",
            "language": "vi",
            "version": "1.1.4",
            "updated": "2022-12-10 08:48:59",
            "package": "https://downloads.wordpress.org/translation/plugin/woo-lucky-wheel/1.1.4/vi.zip"
        }
    ]
}