{
    "name": "Orders Tracking for WooCommerce",
    "slug": "woo-orders-tracking",
    "version": "1.2.11",
    "author": "<a href=\"https://villatheme.com\">VillaTheme</a>",
    "author_profile": "https://profiles.wordpress.org/villatheme/",
    "contributors": {
        "villatheme": {
            "profile": "https://profiles.wordpress.org/villatheme/",
            "avatar": "https://secure.gravatar.com/avatar/973d0ef458adb8a3c527f196b9529909?s=96&d=monsterid&r=g",
            "display_name": "VillaTheme"
        },
        "mrt3vn": {
            "profile": "https://profiles.wordpress.org/mrt3vn/",
            "avatar": "https://secure.gravatar.com/avatar/cb8ecbc2ffe02a20ea2f5d1da26d3a22?s=96&d=monsterid&r=g",
            "display_name": "Andy Ha"
        }
    },
    "requires": "5.0.0",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [
        "woocommerce"
    ],
    "compatibility": [],
    "rating": 90,
    "ratings": {
        "5": 48,
        "4": 3,
        "3": 0,
        "2": 3,
        "1": 4
    },
    "num_ratings": 58,
    "support_url": "https://wordpress.org/support/plugin/woo-orders-tracking/",
    "support_threads": 2,
    "support_threads_resolved": 1,
    "active_installs": 10000,
    "downloaded": 303577,
    "last_updated": "2024-05-09 01:58:00",
    "added": "2019-05-07",
    "homepage": "https://villatheme.com/extensions/woocommerce-orders-tracking",
    "sections": {
        "description": "<p>Orders Tracking for WooCommerce is an essential plugin for tracking orders of WooCommerce. This plugin allows shop owners to add, edit, import, export the orders tracking numbers and tracking URLs of every item of an order. Then the plugin can send the orders tracking emails, SMS, add the tracking information to PayPal transactions with orders tracking information and tracking URLs.  This plugin also integrates the order tracking information with other tracking services. With the advantages of tracking orders, the shop owners can manage tracking orders easily and inform their customers about the orders journey. Likewise, customers will feel secure and comfortable in tracking their orders.</p>\n<p><a href=\"http://new2new.com/?item=woo-orders-tracking\" title=\"Demo Orders Tracking for WooCommerce\" rel=\"nofollow ugc\">Try the Demo</a> |<a href=\"http://docs.villatheme.com/woo-orders-tracking\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/6ZPBE\" title=\"Premium Version\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/6uJ9I3sIpNA?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>IMPORTANT NOTICE:</h3>\n<ul>\n<li>\n<p>The plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use the plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES:</h3>\n<p>&#9658; Shipping Carriers in Orders Tracking for WooCommerce<br />\nThe plugin integrates more than 80 common shipping carriers all over the world. And you still can add your custom shipping carrier if it is necessary.</p>\n<ul>\n<li>\n<p><strong>More than 80 carriers integrated</strong>: The plugin allows you to select the carriers you want to use.</p>\n</li>\n<li>\n<p><strong>Add custom shipping carriers</strong>: If your desired carrier is not support by default, you can easily add a custom carrier yourself and you can add as many custom carriers as you want.</p>\n</li>\n<li>\n<p><strong>Automatically generate tracking URL</strong>: Then when adding a tracking number, you just need to select the carrier and fill in the tracking number. Orders Tracking for WooCommerce will auto-generate a tracking URL.</p>\n</li>\n<li>\n<p><strong>Enable/disable any carriers</strong>: You can choose to only enable carriers that you use</p>\n</li>\n</ul>\n<p>&#9658; The orders tracking information emails.</p>\n<ul>\n<li>\n<p><strong>Send tracking emails</strong>: you can select to send a tracking email to the customer when adding a tracking number to their orders.</p>\n</li>\n<li>\n<p><strong>Edit the tracking email</strong>: You are able to change the tracking email subject, heading, and content. The plugin provides shortcodes that display customer name, order ID and shipping information in emails.</p>\n</li>\n<li>\n<p><strong>Tracking of all items</strong>: Able to include tracking of all order items instead of only changed item in email</p>\n</li>\n</ul>\n<p>&#9658; WooCommerce Emails in Orders Tracking for WooCommerce</p>\n<ul>\n<li>\n<p>Including the tracking information in the WooCommerce orders emails when the orders have changed the status.</p>\n</li>\n<li>\n<p>Besides default order statuses of WooCommerce, custom order statuses created by other plugins(such as WooCommerce Order Status Manager plugin and WooCommerce Order Status &amp; Actions Manager plugin) are also supported</p>\n</li>\n<li>\n<p>Customizing the positions of the tracking information in the WooCommerce emails.</p>\n</li>\n</ul>\n<p>&#9658; PayPal feature in Orders Tracking for WooCommerce</p>\n<ul>\n<li>\n<p><strong>Automatically add shipping information</strong>: Shipping information includes carrier names and tracking number will be added to your PayPal transaction automatically.</p>\n</li>\n<li>\n<p><strong>PayPal Sandbox supported</strong>: The plugin provides a sandbox option that allows you to test the feature with a PayPal Sandbox account before using it with your live account.</p>\n</li>\n</ul>\n<p>&#9658; Tracking service</p>\n<ul>\n<li>Orders Tracking for WooCommerce supports TrackingMore API. Track info of your tracking numbers will be synced to your TrackingMore account and display on your tracking page when your customers track their orders.</li>\n</ul>\n<p>&#9658; Tracking Page in Orders Tracking for WooCommerce<br />\nThe tracking page option allows your customer to check the shipping information on your site (instead of going to the shipping carrier site). This option works with Tracking Service only.</p>\n<ul>\n<li>\n<p><strong>Create a tracking page</strong>: when the plugin is installed. A tracking page will automatically be added to your page (check it at Dashboard/ Pages/ Track Order).</p>\n</li>\n<li>\n<p><strong>Design the tracking page</strong>: The page has two templates and multiple design options for you to change its front-end. You can easily customize the tracking page using WordPress customize.</p>\n</li>\n<li>\n<p><strong>Shortcode</strong>: When you set a page as the tracking page, tracking form and track info will be appended to the end of the page content. If you need to change that, just use [vi_wot_form_track_order] shortcode when customizing the page content.</p>\n</li>\n</ul>\n<p>&#9658; Adding Tracking numbers to WooCommerce Orders<br />\nOrders Tracking for WooCommerce plugin allows you to add tracking numbers to each product. The tracking number can be added manually to the WooCommerce/Orders page, or you can bulk-adding using a CSV file.</p>\n<p>&#9658;Export orders and Import tracking number using CSV file:<br />\nThe plugin provides an option to bulk import tracking number using CSV files. You can select orders and export them as a CSV file, add tracking numbers to the exported file. Then import the CSV file in the plugin backend. Tracking numbers will be added to your WooCommerce orders and PayPal transactions.</p>\n<ul>\n<li>\n<p><strong>Order filters</strong>: filters help you to select the orders you want to export by created date, paid date, completed date, status, billing address, shipping address, payment method, and the shipping method.</p>\n</li>\n<li>\n<p><strong>Export fields</strong>: select the order fields you want to export. Included Order ID, Order Item ID, Product ID, Variation ID, Product Name, Product Price, Quantity and Product SKU…</p>\n</li>\n<li>\n<p><strong>Import tracking number using CSV files</strong>: after editing the exported order file and add tracking numbers. You can import it in the plugin backend. Tracking numbers will be automatically added to your WooCommerce orders.</p>\n</li>\n</ul>\n<p>&#9658; Manually add the Tracking numbers to WooCommerce Orders</p>\n<ul>\n<li>\n<p><strong>Add tracking information for each line item</strong>: Tracking number, Tracking carrier, Shipping carrier, Change order status, sending email to the customer(if tracking info changes) and Adding tracking number to PayPal option.</p>\n</li>\n<li>\n<p><strong>Bulk add tracking number</strong>: You can add bulk tracking numbers for orders that have many different items.</p>\n</li>\n</ul>\n<p>&#9658; Order details<br />\nTracking numbers are displayed in orders list/order details on customers&#8217; My account page which makes it easier for customers to track their orders while logging in to their accounts</p>\n<h3>PRO VERSION</h3>\n<ul>\n<li>\n<p><strong>All features from the free version</strong></p>\n</li>\n<li>\n<p><strong>Manage Tracking By</strong>(NEW): If your orders only have 1 tracking number each at a time, you can choose to manage tracking by order only. This way, tracking number and carrier are saved to order post metas so that you can use these post meta keys to add integration with other plugins such as an email designer plugin, an SMS plugin&#8230;</p>\n</li>\n<li>\n<p><strong>Edit Tracking in Order List</strong>(NEW): This makes it easier, quicker and more convenient to edit tracking numbers of different orders on a single screen. A lot of time can be saved.</p>\n</li>\n<li>\n<p><strong>Track Per Item Quantity</strong>(NEW): There will be a tracking number field for each purchased quantity of an order item. Helpful when the same item in an order can have different tracking numbers at a time.</p>\n</li>\n<li>\n<p><strong>REST API</strong>(NEW): The pro version supports REST API to set and get tracking numbers which makes it easy to integrate with an ERP service</p>\n</li>\n<li>\n<p><strong>Manage User Roles</strong>(NEW): It&#8217;s possible to grant Shop manager access to specific settings of the plugin</p>\n</li>\n<li>\n<p><strong>Support More PayPal plugins</strong>: While the free version only supports PayPal standard and PayPal Express checkout, the pro version supports the new WooCommerce PayPal Payments plugin and a lot of other PayPal plugins from other authors</p>\n</li>\n<li>\n<p><strong>Default track info</strong>: No more &#8220;tracking info not available&#8221; message by adding default track info when ever a new order is placed. This helps reduce a lot of support emails from your customers asking about their packets.</p>\n</li>\n<li>\n<p><strong>Input fields</strong>: You can track with email and/or order ID and/or tracking number</p>\n</li>\n<li>\n<p><strong>Webhooks</strong>: Support webhooks to automatically update new tracking data as well as send email to customers when shipment status changes</p>\n</li>\n<li>\n<p><strong>Schedule</strong>: Schedule a time to sync tracking data of existing orders</p>\n</li>\n<li>\n<p><strong>Change order status</strong>: Automatically change order status when shipment statuses of all tracking numbers of an order change to delivered</p>\n</li>\n<li>\n<p><strong>Manage tracking in email</strong>:</p>\n</li>\n<li>\n<p>Able to use display name of carriers instead of real name, good for dropshipping</p>\n</li>\n<li>\n<p>Able to customize tracking in email with multilingual supported</p>\n</li>\n</ul>\n<p>&#9658; SMS</p>\n<ul>\n<li>\n<p>The SMS option allows you to inform your customers by SMS with a tracking URL when the orders tracking information has changed.</p>\n</li>\n<li>\n<p>There are 3 SMS Provider options for you to choose including Twilio, Nexmo and Plivo.</p>\n</li>\n</ul>\n<p>&#9658; Tracking service</p>\n<ul>\n<li>\n<p><strong>More tracking services supported</strong>: Besides TrackingMore the premium version supports 17Track, EasyPost, Aftership and TrackTry. The plugin will get the shipping information from these tracking services and transfer it to your customers.</p>\n</li>\n<li>\n<p><strong>TrackingMore, EasyPost, Aftership, 17Track, TrackTry</strong>: These options require a valid API to work. Orders Tracking for WooCommerce will automatically get tracking information from these tracking services.</p>\n</li>\n<li>\n<p><strong>Translate timeline</strong>: Using Google Cloud Translation API to translate timeline to a specific language</p>\n</li>\n<li>\n<p><strong>Google reCAPTCHA</strong>: This option helps you protect your website from spam and abuse.</p>\n</li>\n<li>\n<p><strong>Map order status when importing tracking from CSV</strong></p>\n</li>\n<li>\n<p><strong>Compatible with our ALD &#8211; AliExpress Dropshipping and Fulfillment for WooCommerce plugin</strong>: When you sync AliExpress orders, if tracking numbers are available, they can be automatically added to PayPal, synced with your currently used tracking service and email/SMS notification will be sent to your customers</p>\n</li>\n<li>\n<p><strong>Compatible with our WooCommerce Email Template Customizer plugin</strong>: You can easily customize tracking emails sent to your customers to bring them the most satisfaction while waiting for their packages to be delivered</p>\n</li>\n<li>\n<p><strong>Integrate with Dianxiaomi ERP</strong>: Tracking numbers managed by Dianxiaomi can be synced with our plugin so that your customers can still track their orders and receive updated tracking information via our plugin</p>\n<ul>\n<li>\n<p><strong>6 or 12 months of Premium support depending on the type of license you purchase</strong></p>\n</li>\n<li>\n<p><strong>Lifetime update</strong></p>\n</li>\n</ul>\n</li>\n</ul>\n<p><a href=\"https://1.envato.market/6ZPBE\" rel=\"nofollow ugc\">GET PRO VERSION</a> or <a href=\"https://1.envato.market/6ZPBE\" rel=\"nofollow ugc\">https://codecanyon.net/item/woocommerce-orders-tracking/26062993</a></p>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designer\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: Replace plaintext WordPress emails with more beautiful and professional templates</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">COREEM – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE &#8211; WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size chart for your products</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution &#8211; Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your “Thank You” page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/woo-orders-tracking\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
        "installation": "<ol>\n<li>Unzip the download package</li>\n<li>Upload <code>woo-orders-tracking</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "changelog": "<p>/<strong>1.2.11 &#8211; 2024.05.09</strong>/<br />\n– Updated: Use WC log to save the plugin log<br />\n– Updated: Including the custom JS/CSS via wp_enqueue<br />\n– Fixed: Validating and sanitizing the input of tracking number for shortcode</p>\n<p>/<strong>1.2.10 &#8211; 2024.05.02</strong>/<br />\n– Updated: Validating and sanitizing the input of tracking number for shortcode<br />\n– Updated: Update support class</p>\n<p>/<strong>1.2.9 &#8211; 2024.04.16</strong>/<br />\n– Fixed: Can not choose “Before Order Email” on track info position</p>\n<p>/<strong>1.2.8 &#8211; 2024.04.13</strong>/<br />\n– Updated: Compatible with WP 6.5 and  WC 8.7<br />\n– Updated: Update support class</p>\n<p>/<strong>1.2.7 &#8211; 2023.10.06</strong>/<br />\n– Fixed: Miss data field in export orders</p>\n<p>/<strong>1.2.6 &#8211; 2023.08.12</strong>/<br />\n– Updated: Do not show the information uploaded on the URL while importing the tracking number.</p>\n<p>/<strong>1.2.5 &#8211; 2023.08.04</strong>/<br />\n&#8211; Updated: Compatibility check  WC 7.9<br />\n&#8211; Updated: VillaTheme_Support</p>\n<p>/<strong>1.2.4 &#8211; 2023.05.15</strong>/<br />\n– Fixed: Miss data field in export orders</p>\n<p>/<strong>1.2.3 &#8211; 2023.04.12</strong>/<br />\n– Updated: Compatible with &#8216;High-Performance order storage (COT)&#8217;</p>\n<p>/<strong>1.2.1 &#8211; 2022.10.06</strong>/<br />\n&#8211; Fixed: Edit carriers<br />\n&#8211; Fixed: Link to settings from other pages<br />\n&#8211; Updated: Show tracking info inside [woocommerce_order_tracking] shortcode of WooCommerce<br />\n&#8211; Added: Vietnamese + Italian translations</p>\n<p>/<strong>1.2.0 &#8211; 2022.07.22</strong>/<br />\n&#8211; Optimized: Tracking service<br />\n&#8211; Added: (Export orders)Ability to save filter settings<br />\n&#8211; Added: (Customize)Track button color, background color<br />\n&#8211; Added: (Carriers)Ability to enable/disable a carrier, set slug when creating a custom carrier<br />\n&#8211; Added: (Email)Option to send tracking of whole order<br />\n&#8211; Added: (WooCommerce Email)Option to put tracking info before order table; compatible with custom order status plugin<br />\n&#8211; Added: [vi_wot_form_track_order] shortcode<br />\n&#8211; Added: (WooCommerce Orders)Ability to refresh track info<br />\n&#8211; Added: (My account)Tracking column<br />\n&#8211; Added: (Import csv)Map order status</p>\n<p>/<strong>1.1.16 &#8211; 2022.05.13</strong>/<br />\n&#8211; Fixed: PHP error below settings page in some cases</p>\n<p>/<strong>1.1.15 &#8211; 2022.04.22</strong>/<br />\n&#8211; Fixed: Sanitize, escape data<br />\n&#8211; Fixed: Save filter settings<br />\n&#8211; Updated: VillaTheme_Support</p>\n<p>/<strong>1.1.14 &#8211; 2022.03.29</strong>/<br />\n&#8211; Updated: VillaTheme_Support</p>\n<p>/<strong>1.1.13 &#8211; 2022.03.21</strong>/<br />\n&#8211; Updated: VillaTheme_Support</p>\n<p>/<strong>1.1.12 &#8211; 2022.01.15</strong>/<br />\n&#8211; Fixed: Deprecated is_ajax in WC6.1</p>\n<p>/<strong>1.1.11 &#8211; 2022.01.12</strong>/<br />\n&#8211; Updated: VillaTheme_Support</p>\n<p>/<strong>1.1.10 &#8211; 2021.12.14</strong>/<br />\n&#8211; Fixed: Patched XSS vulnerability</p>\n<p>/<strong>1.1.9 &#8211; 2021.11.17</strong>/<br />\n&#8211; Fixed: Tracking URL of Fedex and Portugal Post &#8211; CTT</p>\n<p>/<strong>1.1.8.7 &#8211; 2021.09.09</strong>/<br />\n&#8211; Fixed: Move the call of VI_WOO_ORDERS_TRACKING_DATA::shipping_carriers() to hook instead of the construct function of class VI_WOO_ORDERS_TRACKING_ADMIN_ORDERS_EDIT_TRACKING</p>\n<p>/<strong>1.1.8.6 &#8211; 2021.08.10</strong>/<br />\n&#8211; Updated: Compatible with WP5.8 and WC5.5<br />\n&#8211; Updated: Class VillaTheme_Support</p>\n<p>/<strong>1.1.8.5 &#8211; 2020.12.10</strong>/<br />\n&#8211; Fixed: Can not select shipping carrier since WP5.6<br />\n&#8211; Updated: Compatible with WP5.6 and WC4.8</p>\n<p>/<strong>1.1.8.4 &#8211; 2020.08.15</strong>/<br />\n&#8211; Fixed: Conditional tag for my account page<br />\n&#8211; Fixed: Exported fields not saved<br />\n&#8211; Updated: Compatible with WP5.5 and WC4.3</p>\n<p>/<strong>1.1.8.3 &#8211; 2020.05.09</strong>/<br />\n&#8211; Fixed: Error on admin orders page<br />\n&#8211; Updated: Compatible with WC4.1</p>\n<p>/<strong>1.1.8.2 &#8211; 2020.04.23</strong>/<br />\n&#8211; Fixed: Date filter for exporting orders when site language is not English<br />\n&#8211; Fixed: Add tracking to PayPal after importing via CSV<br />\n&#8211; Updated: Class support</p>\n<p>/<strong>1.1.8.1 &#8211; 2020.03.25</strong>/<br />\n&#8211; Updated: Introduce premium version</p>\n<p>/<strong>1.1.8 &#8211; 2020.03.23</strong>/<br />\n&#8211; Changed: Admin menu icon<br />\n&#8211; Updated: Compatible with WP5.4 and WC4.0<br />\n&#8211; Updated: Class support</p>\n<p>/<strong>1.1.7 &#8211; 2020.03.05</strong>/<br />\n&#8211; Fixed: Can not save tracking with custom carrier in the 1.1.6 update</p>\n<p>/<strong>1.1.6 &#8211; 2020.02.21</strong>/<br />\n&#8211; Fixed: Tracking included in WooCommerce emails when order status changes<br />\n&#8211; Fixed: Error when placing new order<br />\n&#8211; Added: Placeholder for {postal_code} in tracking url<br />\n&#8211; Added: Support &#8220;Digital delivery&#8221; carrier<br />\n&#8211; Updated: Select which order status to set to instead of just changing to completed when editing tracking</p>\n<p>/<strong>1.1.5 &#8211; 2019.12.16</strong>/<br />\n&#8211; Fixed: PayPal access token not renew</p>\n<p>/<strong>1.1.4 &#8211; 2019.12.13</strong>/<br />\n&#8211; Fixed: TrackingMore form shortcode</p>\n<p>/<strong>1.1.3 &#8211; 2019.12.11</strong>/<br />\n&#8211; Fixed: Wrong TrackingMore carrier slug</p>\n<p>/<strong>1.1.2 &#8211; 2019.12.07</strong>/<br />\n&#8211; Updated: Adding tracking numbers to TrackingMore when importing trackings<br />\n&#8211; Added: TrackingMore tracking form shortcode<br />\n&#8211; Added: Compatibility with Dropshipping and Fulfillment for AliExpress and WooCommerce by VillaTheme</p>\n<p>/<strong>1.1.1 &#8211; 2019.11.16</strong>/<br />\n&#8211; Updated: Compatible with WP 5.3 and WooCommerce 3.8</p>\n<p>/<strong>1.1.0 &#8211; 2019.11.09</strong>/<br />\n&#8211; Fixed: Import CSV<br />\n&#8211; Fixed: Save tracking<br />\n&#8211; Fixed: Edit tracking<br />\n&#8211; Fixed: Query to export orders<br />\n&#8211; Optimized: UI/UX and performance</p>\n<p>/<strong>1.0.14 &#8211; 2019.10.18</strong>/<br />\n&#8211; Fixed: error when importing</p>\n<p>/<strong>1.0.13 &#8211; 2019.10.18</strong>/<br />\n&#8211; Fixed: error when importing</p>\n<p>/<strong>1.0.12 &#8211; 2019.10.18</strong>/<br />\n&#8211; Fixed: error time out when importing<br />\n&#8211; added: include tracking information to WooCommecre order email</p>\n<p>/<strong>1.0.9 &#8211; 2019.10.11</strong>/<br />\n&#8211; Fixed: error when importing</p>\n<p>/<strong>1.0.8 &#8211; 2019.10.11</strong>/<br />\n&#8211; Fixed: error when add tracking number to PayPal</p>\n<p>/<strong>1.0.6 &#8211; 2019.10.05</strong>/<br />\n&#8211; Fixed: error when add tracking in order detail</p>\n<p>/<strong>1.0.5 &#8211; 2019.09.25</strong>/<br />\n&#8211; Fixed: error when add tracking number to PayPal</p>\n<p>/<strong>1.0.4 &#8211; 2019.09.24</strong>/<br />\n&#8211; Fixed: Can&#8217;t save PayPal client id &amp; secret</p>\n<p>/<strong>1.0.3 &#8211; 2019.09.24</strong>/<br />\n&#8211; Fixed: Slow down admin orders page</p>\n<p>/<strong>1.0.2 &#8211; 2019.09.12</strong>/<br />\n&#8211; Fixed: mapping<br />\n&#8211; added: add list define shipping carriers<br />\n&#8211; added: export orders tracking number<br />\n&#8211; added: track shipment with the 3rd party service<br />\n&#8211; added: add tracking number to PayPal</p>\n<p>/<strong>1.0.1 &#8211; 2019.05.17</strong>/<br />\n&#8211; Fixed: Translate<br />\n&#8211; Updated: Skip if tracking does not change when importing</p>\n"
    },
    "short_description": "Easily import/manage your tracking numbers, add tracking numbers to PayPal and send email notifications to customers.",
    "description": "<p>Orders Tracking for WooCommerce is an essential plugin for tracking orders of WooCommerce. This plugin allows shop owners to add, edit, import, export the orders tracking numbers and tracking URLs of every item of an order. Then the plugin can send the orders tracking emails, SMS, add the tracking information to PayPal transactions with orders tracking information and tracking URLs.  This plugin also integrates the order tracking information with other tracking services. With the advantages of tracking orders, the shop owners can manage tracking orders easily and inform their customers about the orders journey. Likewise, customers will feel secure and comfortable in tracking their orders.</p>\n<p><a href=\"http://new2new.com/?item=woo-orders-tracking\" title=\"Demo Orders Tracking for WooCommerce\" rel=\"nofollow ugc\">Try the Demo</a> |<a href=\"http://docs.villatheme.com/woo-orders-tracking\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/6ZPBE\" title=\"Premium Version\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/6uJ9I3sIpNA?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>IMPORTANT NOTICE:</h3>\n<ul>\n<li>\n<p>The plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use the plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES:</h3>\n<p>&#9658; Shipping Carriers in Orders Tracking for WooCommerce<br />\nThe plugin integrates more than 80 common shipping carriers all over the world. And you still can add your custom shipping carrier if it is necessary.</p>\n<ul>\n<li>\n<p><strong>More than 80 carriers integrated</strong>: The plugin allows you to select the carriers you want to use.</p>\n</li>\n<li>\n<p><strong>Add custom shipping carriers</strong>: If your desired carrier is not support by default, you can easily add a custom carrier yourself and you can add as many custom carriers as you want.</p>\n</li>\n<li>\n<p><strong>Automatically generate tracking URL</strong>: Then when adding a tracking number, you just need to select the carrier and fill in the tracking number. Orders Tracking for WooCommerce will auto-generate a tracking URL.</p>\n</li>\n<li>\n<p><strong>Enable/disable any carriers</strong>: You can choose to only enable carriers that you use</p>\n</li>\n</ul>\n<p>&#9658; The orders tracking information emails.</p>\n<ul>\n<li>\n<p><strong>Send tracking emails</strong>: you can select to send a tracking email to the customer when adding a tracking number to their orders.</p>\n</li>\n<li>\n<p><strong>Edit the tracking email</strong>: You are able to change the tracking email subject, heading, and content. The plugin provides shortcodes that display customer name, order ID and shipping information in emails.</p>\n</li>\n<li>\n<p><strong>Tracking of all items</strong>: Able to include tracking of all order items instead of only changed item in email</p>\n</li>\n</ul>\n<p>&#9658; WooCommerce Emails in Orders Tracking for WooCommerce</p>\n<ul>\n<li>\n<p>Including the tracking information in the WooCommerce orders emails when the orders have changed the status.</p>\n</li>\n<li>\n<p>Besides default order statuses of WooCommerce, custom order statuses created by other plugins(such as WooCommerce Order Status Manager plugin and WooCommerce Order Status &amp; Actions Manager plugin) are also supported</p>\n</li>\n<li>\n<p>Customizing the positions of the tracking information in the WooCommerce emails.</p>\n</li>\n</ul>\n<p>&#9658; PayPal feature in Orders Tracking for WooCommerce</p>\n<ul>\n<li>\n<p><strong>Automatically add shipping information</strong>: Shipping information includes carrier names and tracking number will be added to your PayPal transaction automatically.</p>\n</li>\n<li>\n<p><strong>PayPal Sandbox supported</strong>: The plugin provides a sandbox option that allows you to test the feature with a PayPal Sandbox account before using it with your live account.</p>\n</li>\n</ul>\n<p>&#9658; Tracking service</p>\n<ul>\n<li>Orders Tracking for WooCommerce supports TrackingMore API. Track info of your tracking numbers will be synced to your TrackingMore account and display on your tracking page when your customers track their orders.</li>\n</ul>\n<p>&#9658; Tracking Page in Orders Tracking for WooCommerce<br />\nThe tracking page option allows your customer to check the shipping information on your site (instead of going to the shipping carrier site). This option works with Tracking Service only.</p>\n<ul>\n<li>\n<p><strong>Create a tracking page</strong>: when the plugin is installed. A tracking page will automatically be added to your page (check it at Dashboard/ Pages/ Track Order).</p>\n</li>\n<li>\n<p><strong>Design the tracking page</strong>: The page has two templates and multiple design options for you to change its front-end. You can easily customize the tracking page using WordPress customize.</p>\n</li>\n<li>\n<p><strong>Shortcode</strong>: When you set a page as the tracking page, tracking form and track info will be appended to the end of the page content. If you need to change that, just use [vi_wot_form_track_order] shortcode when customizing the page content.</p>\n</li>\n</ul>\n<p>&#9658; Adding Tracking numbers to WooCommerce Orders<br />\nOrders Tracking for WooCommerce plugin allows you to add tracking numbers to each product. The tracking number can be added manually to the WooCommerce/Orders page, or you can bulk-adding using a CSV file.</p>\n<p>&#9658;Export orders and Import tracking number using CSV file:<br />\nThe plugin provides an option to bulk import tracking number using CSV files. You can select orders and export them as a CSV file, add tracking numbers to the exported file. Then import the CSV file in the plugin backend. Tracking numbers will be added to your WooCommerce orders and PayPal transactions.</p>\n<ul>\n<li>\n<p><strong>Order filters</strong>: filters help you to select the orders you want to export by created date, paid date, completed date, status, billing address, shipping address, payment method, and the shipping method.</p>\n</li>\n<li>\n<p><strong>Export fields</strong>: select the order fields you want to export. Included Order ID, Order Item ID, Product ID, Variation ID, Product Name, Product Price, Quantity and Product SKU…</p>\n</li>\n<li>\n<p><strong>Import tracking number using CSV files</strong>: after editing the exported order file and add tracking numbers. You can import it in the plugin backend. Tracking numbers will be automatically added to your WooCommerce orders.</p>\n</li>\n</ul>\n<p>&#9658; Manually add the Tracking numbers to WooCommerce Orders</p>\n<ul>\n<li>\n<p><strong>Add tracking information for each line item</strong>: Tracking number, Tracking carrier, Shipping carrier, Change order status, sending email to the customer(if tracking info changes) and Adding tracking number to PayPal option.</p>\n</li>\n<li>\n<p><strong>Bulk add tracking number</strong>: You can add bulk tracking numbers for orders that have many different items.</p>\n</li>\n</ul>\n<p>&#9658; Order details<br />\nTracking numbers are displayed in orders list/order details on customers&#8217; My account page which makes it easier for customers to track their orders while logging in to their accounts</p>\n<h3>PRO VERSION</h3>\n<ul>\n<li>\n<p><strong>All features from the free version</strong></p>\n</li>\n<li>\n<p><strong>Manage Tracking By</strong>(NEW): If your orders only have 1 tracking number each at a time, you can choose to manage tracking by order only. This way, tracking number and carrier are saved to order post metas so that you can use these post meta keys to add integration with other plugins such as an email designer plugin, an SMS plugin&#8230;</p>\n</li>\n<li>\n<p><strong>Edit Tracking in Order List</strong>(NEW): This makes it easier, quicker and more convenient to edit tracking numbers of different orders on a single screen. A lot of time can be saved.</p>\n</li>\n<li>\n<p><strong>Track Per Item Quantity</strong>(NEW): There will be a tracking number field for each purchased quantity of an order item. Helpful when the same item in an order can have different tracking numbers at a time.</p>\n</li>\n<li>\n<p><strong>REST API</strong>(NEW): The pro version supports REST API to set and get tracking numbers which makes it easy to integrate with an ERP service</p>\n</li>\n<li>\n<p><strong>Manage User Roles</strong>(NEW): It&#8217;s possible to grant Shop manager access to specific settings of the plugin</p>\n</li>\n<li>\n<p><strong>Support More PayPal plugins</strong>: While the free version only supports PayPal standard and PayPal Express checkout, the pro version supports the new WooCommerce PayPal Payments plugin and a lot of other PayPal plugins from other authors</p>\n</li>\n<li>\n<p><strong>Default track info</strong>: No more &#8220;tracking info not available&#8221; message by adding default track info when ever a new order is placed. This helps reduce a lot of support emails from your customers asking about their packets.</p>\n</li>\n<li>\n<p><strong>Input fields</strong>: You can track with email and/or order ID and/or tracking number</p>\n</li>\n<li>\n<p><strong>Webhooks</strong>: Support webhooks to automatically update new tracking data as well as send email to customers when shipment status changes</p>\n</li>\n<li>\n<p><strong>Schedule</strong>: Schedule a time to sync tracking data of existing orders</p>\n</li>\n<li>\n<p><strong>Change order status</strong>: Automatically change order status when shipment statuses of all tracking numbers of an order change to delivered</p>\n</li>\n<li>\n<p><strong>Manage tracking in email</strong>:</p>\n</li>\n<li>\n<p>Able to use display name of carriers instead of real name, good for dropshipping</p>\n</li>\n<li>\n<p>Able to customize tracking in email with multilingual supported</p>\n</li>\n</ul>\n<p>&#9658; SMS</p>\n<ul>\n<li>\n<p>The SMS option allows you to inform your customers by SMS with a tracking URL when the orders tracking information has changed.</p>\n</li>\n<li>\n<p>There are 3 SMS Provider options for you to choose including Twilio, Nexmo and Plivo.</p>\n</li>\n</ul>\n<p>&#9658; Tracking service</p>\n<ul>\n<li>\n<p><strong>More tracking services supported</strong>: Besides TrackingMore the premium version supports 17Track, EasyPost, Aftership and TrackTry. The plugin will get the shipping information from these tracking services and transfer it to your customers.</p>\n</li>\n<li>\n<p><strong>TrackingMore, EasyPost, Aftership, 17Track, TrackTry</strong>: These options require a valid API to work. Orders Tracking for WooCommerce will automatically get tracking information from these tracking services.</p>\n</li>\n<li>\n<p><strong>Translate timeline</strong>: Using Google Cloud Translation API to translate timeline to a specific language</p>\n</li>\n<li>\n<p><strong>Google reCAPTCHA</strong>: This option helps you protect your website from spam and abuse.</p>\n</li>\n<li>\n<p><strong>Map order status when importing tracking from CSV</strong></p>\n</li>\n<li>\n<p><strong>Compatible with our ALD &#8211; AliExpress Dropshipping and Fulfillment for WooCommerce plugin</strong>: When you sync AliExpress orders, if tracking numbers are available, they can be automatically added to PayPal, synced with your currently used tracking service and email/SMS notification will be sent to your customers</p>\n</li>\n<li>\n<p><strong>Compatible with our WooCommerce Email Template Customizer plugin</strong>: You can easily customize tracking emails sent to your customers to bring them the most satisfaction while waiting for their packages to be delivered</p>\n</li>\n<li>\n<p><strong>Integrate with Dianxiaomi ERP</strong>: Tracking numbers managed by Dianxiaomi can be synced with our plugin so that your customers can still track their orders and receive updated tracking information via our plugin</p>\n<ul>\n<li>\n<p><strong>6 or 12 months of Premium support depending on the type of license you purchase</strong></p>\n</li>\n<li>\n<p><strong>Lifetime update</strong></p>\n</li>\n</ul>\n</li>\n</ul>\n<p><a href=\"https://1.envato.market/6ZPBE\" rel=\"nofollow ugc\">GET PRO VERSION</a> or <a href=\"https://1.envato.market/6ZPBE\" rel=\"nofollow ugc\">https://codecanyon.net/item/woocommerce-orders-tracking/26062993</a></p>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designer\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: Replace plaintext WordPress emails with more beautiful and professional templates</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">COREEM – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE &#8211; WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size chart for your products</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution &#8211; Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your “Thank You” page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/woo-orders-tracking\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/woo-orders-tracking.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/woo-orders-tracking/assets/screenshot-1.jpg?rev=2587022",
            "caption": "Order Tracking Page"
        },
        {
            "src": "https://ps.w.org/woo-orders-tracking/assets/screenshot-2.jpg?rev=2587022",
            "caption": "Push tracking number to PayPal"
        }
    ],
    "tags": {
        "advanced-shipment-tracking-for-woocommerce": "advanced shipment tracking for woocommerce",
        "orders-tracking-for-woocommerce": "orders tracking for woocommerce",
        "woocommerce-order-tracking-plugin": "woocommerce order tracking plugin",
        "woocommerce-shipment-tracking": "woocommerce shipment tracking",
        "woocommerce-tracking-number": "woocommerce tracking number"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.1.10": "https://downloads.wordpress.org/plugin/woo-orders-tracking.1.1.10.zip",
        "1.1.14": "https://downloads.wordpress.org/plugin/woo-orders-tracking.1.1.14.zip",
        "1.1.16": "https://downloads.wordpress.org/plugin/woo-orders-tracking.1.1.16.zip",
        "1.1.8.7": "https://downloads.wordpress.org/plugin/woo-orders-tracking.1.1.8.7.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/woo-orders-tracking.1.2.0.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.villatheme.com/donate",
    "banners": {
        "low": "https://ps.w.org/woo-orders-tracking/assets/banner-772x250.jpg?rev=3080899",
        "high": "https://ps.w.org/woo-orders-tracking/assets/banner-1544x500.jpg?rev=3080899"
    },
    "icons": {
        "1x": "https://ps.w.org/woo-orders-tracking/assets/icon-128x128.gif?rev=3080899",
        "2x": "https://ps.w.org/woo-orders-tracking/assets/icon-256x256.gif?rev=3080899"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 90,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/woo-orders-tracking/blueprint.json?rev=3083652"
        }
    ],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "woo-orders-tracking",
            "language": "vi",
            "version": "1.2.11",
            "updated": "2022-11-30 04:41:46",
            "package": "http://downloads.wordpress.org/translation/plugin/woo-orders-tracking/1.2.11/vi.zip"
        }
    ]
}