{
    "name": "Boost Sales for WooCommerce &#8211; Set up Up-Sells &amp; Cross-Sells Popups &amp; Auto Apply Coupon",
    "slug": "woo-boost-sales",
    "version": "1.2.12",
    "author": "<a href=\"http://villatheme.com\">VillaTheme</a>",
    "author_profile": "https://profiles.wordpress.org/villatheme/",
    "contributors": {
        "villatheme": {
            "profile": "https://profiles.wordpress.org/villatheme/",
            "avatar": "https://secure.gravatar.com/avatar/973d0ef458adb8a3c527f196b9529909?s=96&d=monsterid&r=g",
            "display_name": "VillaTheme"
        },
        "mrt3vn": {
            "profile": "https://profiles.wordpress.org/mrt3vn/",
            "avatar": "https://secure.gravatar.com/avatar/cb8ecbc2ffe02a20ea2f5d1da26d3a22?s=96&d=monsterid&r=g",
            "display_name": "Andy Ha"
        }
    },
    "requires": "5.0.0",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [
        "woocommerce"
    ],
    "compatibility": [],
    "rating": 68,
    "ratings": {
        "5": 4,
        "4": 0,
        "3": 3,
        "2": 0,
        "1": 2
    },
    "num_ratings": 9,
    "support_url": "https://wordpress.org/support/plugin/woo-boost-sales/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 400,
    "downloaded": 29347,
    "last_updated": "2024-06-27 8:04am GMT",
    "added": "2017-05-19",
    "homepage": "https://villatheme.com/extensions/woocommerce-boost-sales/",
    "sections": {
        "description": "<p>WooCommerce Cross Sell and Upsell is a straightforward and effective sales strategy. WooCommerce Cross Sell and Upsell is a popular marketing technique. The technique used in WooCommerce Cross Sell and Upsell is wisely suggesting or recommending products, stimulating customer purchases, and assisting shop owners in increasing sales. Grasping these demands of online businessmen, VillaTheme developed a special tool for WooCommerce Cross Sell and Upsell that promises to create WooCommerce Cross Sell and Upsell quickly, effectively, and optimally. Let’s find out about this plugin.</p>\n<p>Boost Sales for WooCommerce stimulates the purchase of customers by up-selling, cross-selling. Increase revenue as well as profitability for your website, stores. Boost Sales for WooCommerce allows you to add WooCommerce Cross Sell and Upsell products in an independent system of WooCommerce.</p>\n<p>Up-selling is the practice in which a business tries to persuade customers to purchase a higher-end product, an upgrade, or an additional item in order to make a more rewarding sale. For instance, a salesperson may influence a customer into purchasing the newest version of an item, rather than the less-expensive current model, by pointing out its additional features.</p>\n<p>A similar marketing technique is cross-selling, where the salesperson suggests the purchase of additional products for sale. For example, he might say “Would you like some ice cream to go with that cake?” It is beneficial for businesses to use both techniques in order to boost revenue and provide a valued consumer experience. However, research has shown that upselling is generally more effective than cross-selling.</p>\n<blockquote>\n<p><a href=\"http://new2new.com/?item=woocommerce-boost-sales\" title=\"Demo Boost Sales for WooCommerce\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"http://docs.villatheme.com/?item=woocommerce-boost-sales\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/yQBL3\" title=\"Pro Version\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/BIGvxvdJ31k?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>UP-SELL</h3>\n<ul>\n<li>\n<p><strong>Display up-sells pop-up</strong>: Display a WooCommerce upsell pop up which introduces up-sell products when customers hit the Add to Cart button. Up-sells products are similar products but give you more profit.</p>\n</li>\n<li>\n<p><strong>Sync data with WooCommerce</strong>: If you have created WooCommerce upsell product before, the plugin allows you to sync and use these products to Boost Sales for WooCommerce.</p>\n</li>\n<li>\n<p><strong>Add up-sell products to each product</strong>: Configure which products will appear on the up-sell pop-up of each product.</p>\n</li>\n<li>\n<p><strong>Show all products in the category</strong>: Display all products in the category of the product customers just add to cart in up-sell pop-up.</p>\n</li>\n<li>\n<p><strong>Sort by</strong>: allows you to select the order of up-sell products on up-sell pop-up. By price, by name, random.</p>\n</li>\n<li>\n<p><strong>Hide Out Of Stock Products</strong>: out-of-stocks products will be automatically hidden on up-sell pop-up.</p>\n</li>\n</ul>\n<h3>CROSS-SELL</h3>\n<ul>\n<li>\n<p><strong>Product Bundles</strong>: Creating product bundles then selling at discounted prices.</p>\n</li>\n<li>\n<p><strong>Show Cross-sells popup</strong>: Display cross-sell pop-up with a bundled product that includes the product that customers are going to buy.</p>\n</li>\n<li>\n<p><strong>Customize the message</strong>: Customize the cross-sell pop-up message (Hang on we have this offer just for you)</p>\n</li>\n<li>\n<p><strong>Bundle name</strong>: By default, the bundle will be named “Bundle of …” you are able to change this name.</p>\n</li>\n<li>\n<p><strong>Sync Cross-Sell from WooCommerce</strong>: sync cross-sell bundles from WooCommerce cross-sell.</p>\n</li>\n</ul>\n<h3>FREQUENTLY BOUGHT TOGETHER</h3>\n<ul>\n<li>\n<p>This allows to display upselling products on page, under the add-to-cart button on single product page with an extra button to add both main product and upselling products to cart in just one click</p>\n</li>\n<li>\n<p><strong>Shortcode</strong>: Frequently Bought Together shortcode is used to display Frequently Bought Together products of a product and insert every you want.</p>\n</li>\n</ul>\n<h3>PREMIUM VERSION FEATURES</h3>\n<p>The premium version has all the options of the free version</p>\n<p>&#9658; <strong>UP-SELL</strong></p>\n<ul>\n<li>\n<p><strong>Bulk add up-sell</strong>: allows you to add up-sell for multiple products at once.</p>\n</li>\n<li>\n<p><strong>Hide on Single Product Page</strong>: this option allows you to hide the up-sell pop-up on single product pages. The pop-up will appear only on shop/category pages.</p>\n</li>\n<li>\n<p><strong>Hide Products Added to Cart</strong>: the products which already in your cart will not be displayed on up-sell pop-up.</p>\n</li>\n<li>\n<p><strong>Go to cart page</strong>: automatically redirect to cart page when an up-sell product is added to cart.</p>\n</li>\n<li>\n<p><strong>Recently Viewed Products</strong>: the plugin will automatically display recent viewed product on up-sell product.</p>\n</li>\n<li>\n<p><strong>Only Subcategory</strong>: with the display products in the lowest subcategory level on up-sell pop-up. This option works with the option “Up-sell product in same categories” enabled.</p>\n</li>\n<li>\n<p><strong>Upsell by tags</strong>: Upsell products which have the same tags as the main product</p>\n</li>\n<li>\n<p><strong>Exclude products to enable upsell</strong>: the plugin will not display up-sell pop-up on these products.</p>\n</li>\n<li>\n<p><strong>Exclude products that display in upselling popup</strong>: the plugin will not display these products on up-sell pop-up.</p>\n</li>\n<li>\n<p><strong>Hide view more button</strong>: select if you want to display the view more button on up-sell product. The button allows the customer to go up-sell product page.</p>\n</li>\n<li>\n<p><strong>AJAX Add To Cart</strong>: the plugin works with AJAX add to cart button of WooCommerce.</p>\n</li>\n<li>\n<p><strong>Ajax add to cart for product on up-sell popup</strong>: Do not redirect page when customers add upselling products to their cart.</p>\n</li>\n<li>\n<p><strong>Show if empty</strong>: Show upsell popup even if there&#8217;s no upsells, just tell customers which products they have just added to cart</p>\n</li>\n<li>\n<p><strong>Different templates and add-to-cart style between desktop and mobile</strong></p>\n</li>\n</ul>\n<p>&#9658; <strong>CROSS-SELL</strong></p>\n<ul>\n<li>\n<p><strong>Dynamic price &amp; discount</strong>: This makes bundle price more flexible, especially if your bundle contains variable products whose variations have different prices. Discount can be applied or not.</p>\n</li>\n<li>\n<p><strong>Display in the product page</strong>: the cross-sell bundle will be displayed in products instead of a pop-up. You can choose to display under add to cart button, above description tab, under the description tab.</p>\n</li>\n<li>\n<p><strong>Show on Product Page</strong>: choose if you want to display the cross-sell on the single product page.</p>\n</li>\n<li>\n<p><strong>Show on Cart page</strong>: choose if you want to display the cross-sell on the cart page.</p>\n</li>\n<li>\n<p><strong>Show on Checkout page</strong>: choose if you want to display the cross-sell on the checkout page.</p>\n</li>\n<li>\n<p><strong>Description</strong>: change the description of the cross-sell bundle.</p>\n</li>\n<li>\n<p><strong>Name</strong>: change the cross-sell bundle name.</p>\n</li>\n<li>\n<p><strong>Override products</strong>: when a bundle is added to cart, a bundle item added individually before can be automatically removed.</p>\n</li>\n<li>\n<p><strong>Ajax adds to cart for bundle</strong>: add the bundle to cart without reloading the page.</p>\n</li>\n<li>\n<p><strong>Hide out-of-stock products</strong>: if a product in the bundle is out-of-stock, the bundle will not be displayed.</p>\n</li>\n<li>\n<p><strong>Recalculate bundle price</strong>: set price rules, then the plugin will automatically calculate a bundle price according price rules when you create a bundle</p>\n</li>\n<li>\n<p><strong>More templates and able to choose different templates between desktop and mobile</strong></p>\n</li>\n<li>\n<p><strong>Customizable color to match with your theme</strong></p>\n</li>\n</ul>\n<p>&#9658; <strong>FREQUENTLY BOUGHT TOGETHER</strong></p>\n<ul>\n<li>\n<p><strong>More options for product source</strong>: Beside upsells, you can choose cross-sells, Woo upsells/crossells or any of those source based on different products</p>\n</li>\n<li>\n<p><strong>More styles</strong>: Horizontal style is available</p>\n</li>\n<li>\n<p><strong>Add bundle to cart</strong>: If you choose cross-sells as source for frequently bought together, a bundle can be added to cart instead of adding products individually</p>\n</li>\n</ul>\n<p>&#9658; <strong>DISCOUNT BAR</strong></p>\n<ul>\n<li>\n<p><strong>Discount progress bar</strong>: The discount progress bar displays how much customers need to spend to get the discount. (Base on the discount coupon of WooCommerce system).</p>\n</li>\n<li>\n<p><strong>How much more</strong>: Support users know how much they need to spend more to achieve the discount.</p>\n</li>\n<li>\n<p><strong>Sync data with WooCommerce</strong>: The plugin sync data with WooCommerce. You can select the coupon created in the WooCommerce system to display on the discount progress bar.</p>\n</li>\n<li>\n<p><strong>Thanks to customers</strong>: When a customer achieves a minimum for the discount, a THANK YOU message will display to congrats them.</p>\n</li>\n<li>\n<p><strong>Customize discount progress bar</strong>: You can customize the position, color, background, description, and messages of the progress bar.</p>\n</li>\n<li>\n<p><strong>Automatically direct to the checkout page</strong>: Allow automatically redirect to the checkout page after reaching the discount.</p>\n</li>\n</ul>\n<p>&#9658; <strong>MULTILINGUAL SUPPORT</strong></p>\n<ul>\n<li>\n<p>All input strings are translatable to all languages created by WPML/Polylang</p>\n</li>\n<li>\n<p>Able to sync configured upsells from the site&#8217;s default language to others</p>\n</li>\n<li>\n<p>GET PRO VERSION <a href=\"https://1.envato.market/yQBL3\" rel=\"nofollow ugc\">https://codecanyon.net/item/woocommerce-boost-sales/19668456</a></p>\n</li>\n</ul>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designer\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: Replace plaintext WordPress emails with more beautiful and professional templates</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">COREEM – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE &#8211; WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution &#8211; Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your “Thank You” page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/woocommerce-boost-sales/\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"http://villatheme.com\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/woocommerce-boost-sales/\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"http://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
        "installation": "<ol>\n<li>Unzip the download package</li>\n<li>Upload <code>woo-boost-sales</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "changelog": "<p>/<strong>1.2.12 &#8211; 2024.06.27</strong>/<br />\n– Updated: Compatible with WC 8.9</p>\n<p>/<strong>1.2.11 &#8211; 2024.04.13</strong>/<br />\n– Updated: Compatible with WP 6.5 and  WC 8.7<br />\n– Updated: Update support class</p>\n<p>/**1.2.10 – 2023.07.10*/<br />\n– Updated: Check compatible notice</p>\n<p>/**1.2.9 – 2023.07.03*/<br />\n– Updated: Compatible with WooCommerce HPOS(COT)</p>\n<p>/**1.2.8 &#8211; 2022.11.02*/<br />\n&#8211; Updated: Compatibility check with WP 6.1 and WC 7</p>\n<p>/**1.2.7 &#8211; 2022.08.08*/<br />\n&#8211; Fixed: Changing variation from Frequently bought together affects the main product image on product details page<br />\n&#8211; Fixed: Sanitize, escape data<br />\n&#8211; Updated: VillaTheme_Support</p>\n<p>/**1.2.6 &#8211; 2022.05.30*/<br />\n&#8211; Updated: VillaTheme_Support<br />\n&#8211; Updated: Compatible with WP 6.0</p>\n<p>/**1.2.5 &#8211; 2022.04.21*/<br />\n&#8211; Fixed: Compatibility issue with Ajax add to cart plugin<br />\n&#8211; Fixed: Sanitize, escape data<br />\n&#8211; Fixed: Sanitize attribute value correctly<br />\n&#8211; Fixed: Some issues with non-latin attribute name/value<br />\n&#8211; Fixed: Upsells not showing after adding a variable product to cart on product list via WooCommerce Cart All In One plugin<br />\n&#8211; Fixed: Upsells not showing after adding a product to cart on product list on single product page<br />\n&#8211; Updated: VillaTheme_Support</p>\n<p>/**1.2.4 &#8211; 2022.03.29*/<br />\n&#8211; Updated: VillaTheme_Support</p>\n<p>/**1.2.3 &#8211; 2022.03.21*/<br />\n&#8211; Fixed: Action of add-to-cart form of upsells popup in some cases<br />\n&#8211; Updated: VillaTheme_Support</p>\n<p>/**1.2.2 &#8211; 2022.01.15*/<br />\n&#8211; Fixed: Deprecated is_ajax in WC6.1</p>\n<p>/**1.2.1 &#8211; 2022.01.10*/<br />\n&#8211; Updated: VillaTheme_Support<br />\n&#8211; Updated: Prevent bundle item quantity from being changed via cart update</p>\n<p>/**1.2.0 &#8211; 2021.11.12*/<br />\n&#8211; Added: Frequently bought together<br />\n&#8211; Added: Support of overriding templates<br />\n&#8211; Added: Display saved amount of bundle in cart/checkout<br />\n&#8211; Updated: Replace &#8220;woocommerce&#8221; with &#8220;woo&#8221; in slugs of all pages of the plugin to match with other VillaTheme plugins on wordpress.org<br />\n&#8211; Updated: Unlock several features of up-sells and cross-sells</p>\n<p>/**1.1.7.10 &#8211; 2021.08.05*/<br />\n&#8211; Updated: Class VillaTheme_Support<br />\n&#8211; Updated: Compatible with WP 5.8 and WC 5.5</p>\n<p>/**1.1.7.9 &#8211; 2020.08.14*/<br />\n&#8211; Updated: Compatible with WP 5.5 and WC4.3<br />\n&#8211; Improved: Product Upsells/Crosssell management page</p>\n<p>/**1.1.7.8 &#8211; 2020.04.23*/<br />\n&#8211; Updated: Class support</p>\n<p>/**1.1.7.7 &#8211; 2020.03.23*/<br />\n&#8211; Updated: Compatible with WP 5.4 and WC4.0<br />\n&#8211; Updated: Class support</p>\n<p>/**1.1.7.6 &#8211; 2020.02.06*/<br />\n&#8211; Fixed: Missing string translation for &#8220;View more&#8221;, &#8220;Frequently bought with {name_product}&#8221;</p>\n<p>/**1.1.7.4 &#8211; 2019.11.16*/<br />\n&#8211; Updated: Compatible with WP 5.3 and WooCommerce 3.8</p>\n<p>/**1.1.7.3 &#8211; 2019.10.07*/<br />\n&#8211; Updated: Premium URL</p>\n<p>/**1.1.7.2 &#8211; 2019.05.10*/<br />\n&#8211; Updated: Change plugin name<br />\n&#8211; Updated: Change premium version url</p>\n<p>/**1.1.7.1 &#8211; 2019.04.03*/<br />\n&#8211; Updated: Make admin notices dismissible</p>\n<p>/<strong>1.1.7 &#8211; 2019.02.25</strong>/<br />\n&#8211; Fixed: Tab JS in backend<br />\n&#8211; Updated: Class support</p>\n<p>/**1.1.6.3 – 2018.11.10 **/<br />\n&#8211; Updated: Class support</p>\n<p>/**1.1.6.2 – 2018.10.17 **/<br />\n&#8211; Removed: Upgrade notice<br />\n&#8211; updated: Class support</p>\n<p>/**1.1.6.1 – 2018.10.15 **/<br />\n&#8211; Removed: Upgrade Notice</p>\n<p>/**1.1.6 – 2018.05.18 **/<br />\n&#8211; Fixed: Button flex on Mobile<br />\n&#8211; Fixed: Add first cross-sell product<br />\n&#8211; Fixed: Thumb and Title on upsells</p>\n<p>/**1.1.5.1 – 2018.05.11 **/<br />\n&#8211; Fixed: Class Support<br />\n&#8211; Fixed: Overflow of overlay</p>\n<p>/**1.1.5 – 2018.05.04 **/<br />\n&#8211; Fixed: Ajax JS load upsells</p>\n<p>/**1.1.3.1 – 2018.04.11 **/<br />\n&#8211; Updated: Class support</p>\n<p>/**1.1.3 – 2018.03.26 **/<br />\n&#8211; Added: Upsells with special products<br />\n&#8211; Changed: Icon and banner</p>\n<p>/**1.1.2 – 2018.03.23 **/<br />\n&#8211; Fixed: JS add to cart on archive page<br />\n&#8211; Fixed: Max price of product variation on upsell popup</p>\n<p>/**1.1.1 – 2018.03.06 **/<br />\n&#8211; Fixed: Upsell enable option<br />\n&#8211; Fixed: Description option<br />\n&#8211; Fixed: Class support</p>\n<p>/**1.1.0 – 2018.03.03 **/<br />\n&#8211; Changed: The same with premium version</p>\n<p>/<strong>1.0.2.3 – 2017.09.26</strong>/<br />\n&#8211; Fixed: Unbind body JS</p>\n<p>/<strong>1.0.2.2 – 2017.08.07</strong>/<br />\n&#8211; Fixed: Limit product display on popup cross-sells and beautify</p>\n<p>/<strong>1.0.2.1 – 2017.07.08</strong>/<br />\n&#8211; Fixed: Only display list product publish on up-sells and cross-sells page.</p>\n<p>/<strong>1.0.2 – 2017.06.12</strong>/<br />\n&#8211; Updated: Add cross-sells product directly on cross sell page and automatic generate product Bundle<br />\n&#8211; Fixed: Reset post query<br />\n&#8211; Fixed: Exactly cross-sells product price on cart page</p>\n<p>/**1.0.1 &#8211; 2017.05.24 **/<br />\n&#8211; Fixed: Active pro version</p>\n"
    },
    "short_description": "Boost Sales for WooCommerce with dynamic upsell popups, cross-sell bundles, and &#039;Frequently Bought Together&#039; suggestions",
    "description": "<p>WooCommerce Cross Sell and Upsell is a straightforward and effective sales strategy. WooCommerce Cross Sell and Upsell is a popular marketing technique. The technique used in WooCommerce Cross Sell and Upsell is wisely suggesting or recommending products, stimulating customer purchases, and assisting shop owners in increasing sales. Grasping these demands of online businessmen, VillaTheme developed a special tool for WooCommerce Cross Sell and Upsell that promises to create WooCommerce Cross Sell and Upsell quickly, effectively, and optimally. Let’s find out about this plugin.</p>\n<p>Boost Sales for WooCommerce stimulates the purchase of customers by up-selling, cross-selling. Increase revenue as well as profitability for your website, stores. Boost Sales for WooCommerce allows you to add WooCommerce Cross Sell and Upsell products in an independent system of WooCommerce.</p>\n<p>Up-selling is the practice in which a business tries to persuade customers to purchase a higher-end product, an upgrade, or an additional item in order to make a more rewarding sale. For instance, a salesperson may influence a customer into purchasing the newest version of an item, rather than the less-expensive current model, by pointing out its additional features.</p>\n<p>A similar marketing technique is cross-selling, where the salesperson suggests the purchase of additional products for sale. For example, he might say “Would you like some ice cream to go with that cake?” It is beneficial for businesses to use both techniques in order to boost revenue and provide a valued consumer experience. However, research has shown that upselling is generally more effective than cross-selling.</p>\n<blockquote>\n<p><a href=\"http://new2new.com/?item=woocommerce-boost-sales\" title=\"Demo Boost Sales for WooCommerce\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"http://docs.villatheme.com/?item=woocommerce-boost-sales\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/yQBL3\" title=\"Pro Version\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/BIGvxvdJ31k?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>UP-SELL</h3>\n<ul>\n<li>\n<p><strong>Display up-sells pop-up</strong>: Display a WooCommerce upsell pop up which introduces up-sell products when customers hit the Add to Cart button. Up-sells products are similar products but give you more profit.</p>\n</li>\n<li>\n<p><strong>Sync data with WooCommerce</strong>: If you have created WooCommerce upsell product before, the plugin allows you to sync and use these products to Boost Sales for WooCommerce.</p>\n</li>\n<li>\n<p><strong>Add up-sell products to each product</strong>: Configure which products will appear on the up-sell pop-up of each product.</p>\n</li>\n<li>\n<p><strong>Show all products in the category</strong>: Display all products in the category of the product customers just add to cart in up-sell pop-up.</p>\n</li>\n<li>\n<p><strong>Sort by</strong>: allows you to select the order of up-sell products on up-sell pop-up. By price, by name, random.</p>\n</li>\n<li>\n<p><strong>Hide Out Of Stock Products</strong>: out-of-stocks products will be automatically hidden on up-sell pop-up.</p>\n</li>\n</ul>\n<h3>CROSS-SELL</h3>\n<ul>\n<li>\n<p><strong>Product Bundles</strong>: Creating product bundles then selling at discounted prices.</p>\n</li>\n<li>\n<p><strong>Show Cross-sells popup</strong>: Display cross-sell pop-up with a bundled product that includes the product that customers are going to buy.</p>\n</li>\n<li>\n<p><strong>Customize the message</strong>: Customize the cross-sell pop-up message (Hang on we have this offer just for you)</p>\n</li>\n<li>\n<p><strong>Bundle name</strong>: By default, the bundle will be named “Bundle of …” you are able to change this name.</p>\n</li>\n<li>\n<p><strong>Sync Cross-Sell from WooCommerce</strong>: sync cross-sell bundles from WooCommerce cross-sell.</p>\n</li>\n</ul>\n<h3>FREQUENTLY BOUGHT TOGETHER</h3>\n<ul>\n<li>\n<p>This allows to display upselling products on page, under the add-to-cart button on single product page with an extra button to add both main product and upselling products to cart in just one click</p>\n</li>\n<li>\n<p><strong>Shortcode</strong>: Frequently Bought Together shortcode is used to display Frequently Bought Together products of a product and insert every you want.</p>\n</li>\n</ul>\n<h3>PREMIUM VERSION FEATURES</h3>\n<p>The premium version has all the options of the free version</p>\n<p>&#9658; <strong>UP-SELL</strong></p>\n<ul>\n<li>\n<p><strong>Bulk add up-sell</strong>: allows you to add up-sell for multiple products at once.</p>\n</li>\n<li>\n<p><strong>Hide on Single Product Page</strong>: this option allows you to hide the up-sell pop-up on single product pages. The pop-up will appear only on shop/category pages.</p>\n</li>\n<li>\n<p><strong>Hide Products Added to Cart</strong>: the products which already in your cart will not be displayed on up-sell pop-up.</p>\n</li>\n<li>\n<p><strong>Go to cart page</strong>: automatically redirect to cart page when an up-sell product is added to cart.</p>\n</li>\n<li>\n<p><strong>Recently Viewed Products</strong>: the plugin will automatically display recent viewed product on up-sell product.</p>\n</li>\n<li>\n<p><strong>Only Subcategory</strong>: with the display products in the lowest subcategory level on up-sell pop-up. This option works with the option “Up-sell product in same categories” enabled.</p>\n</li>\n<li>\n<p><strong>Upsell by tags</strong>: Upsell products which have the same tags as the main product</p>\n</li>\n<li>\n<p><strong>Exclude products to enable upsell</strong>: the plugin will not display up-sell pop-up on these products.</p>\n</li>\n<li>\n<p><strong>Exclude products that display in upselling popup</strong>: the plugin will not display these products on up-sell pop-up.</p>\n</li>\n<li>\n<p><strong>Hide view more button</strong>: select if you want to display the view more button on up-sell product. The button allows the customer to go up-sell product page.</p>\n</li>\n<li>\n<p><strong>AJAX Add To Cart</strong>: the plugin works with AJAX add to cart button of WooCommerce.</p>\n</li>\n<li>\n<p><strong>Ajax add to cart for product on up-sell popup</strong>: Do not redirect page when customers add upselling products to their cart.</p>\n</li>\n<li>\n<p><strong>Show if empty</strong>: Show upsell popup even if there&#8217;s no upsells, just tell customers which products they have just added to cart</p>\n</li>\n<li>\n<p><strong>Different templates and add-to-cart style between desktop and mobile</strong></p>\n</li>\n</ul>\n<p>&#9658; <strong>CROSS-SELL</strong></p>\n<ul>\n<li>\n<p><strong>Dynamic price &amp; discount</strong>: This makes bundle price more flexible, especially if your bundle contains variable products whose variations have different prices. Discount can be applied or not.</p>\n</li>\n<li>\n<p><strong>Display in the product page</strong>: the cross-sell bundle will be displayed in products instead of a pop-up. You can choose to display under add to cart button, above description tab, under the description tab.</p>\n</li>\n<li>\n<p><strong>Show on Product Page</strong>: choose if you want to display the cross-sell on the single product page.</p>\n</li>\n<li>\n<p><strong>Show on Cart page</strong>: choose if you want to display the cross-sell on the cart page.</p>\n</li>\n<li>\n<p><strong>Show on Checkout page</strong>: choose if you want to display the cross-sell on the checkout page.</p>\n</li>\n<li>\n<p><strong>Description</strong>: change the description of the cross-sell bundle.</p>\n</li>\n<li>\n<p><strong>Name</strong>: change the cross-sell bundle name.</p>\n</li>\n<li>\n<p><strong>Override products</strong>: when a bundle is added to cart, a bundle item added individually before can be automatically removed.</p>\n</li>\n<li>\n<p><strong>Ajax adds to cart for bundle</strong>: add the bundle to cart without reloading the page.</p>\n</li>\n<li>\n<p><strong>Hide out-of-stock products</strong>: if a product in the bundle is out-of-stock, the bundle will not be displayed.</p>\n</li>\n<li>\n<p><strong>Recalculate bundle price</strong>: set price rules, then the plugin will automatically calculate a bundle price according price rules when you create a bundle</p>\n</li>\n<li>\n<p><strong>More templates and able to choose different templates between desktop and mobile</strong></p>\n</li>\n<li>\n<p><strong>Customizable color to match with your theme</strong></p>\n</li>\n</ul>\n<p>&#9658; <strong>FREQUENTLY BOUGHT TOGETHER</strong></p>\n<ul>\n<li>\n<p><strong>More options for product source</strong>: Beside upsells, you can choose cross-sells, Woo upsells/crossells or any of those source based on different products</p>\n</li>\n<li>\n<p><strong>More styles</strong>: Horizontal style is available</p>\n</li>\n<li>\n<p><strong>Add bundle to cart</strong>: If you choose cross-sells as source for frequently bought together, a bundle can be added to cart instead of adding products individually</p>\n</li>\n</ul>\n<p>&#9658; <strong>DISCOUNT BAR</strong></p>\n<ul>\n<li>\n<p><strong>Discount progress bar</strong>: The discount progress bar displays how much customers need to spend to get the discount. (Base on the discount coupon of WooCommerce system).</p>\n</li>\n<li>\n<p><strong>How much more</strong>: Support users know how much they need to spend more to achieve the discount.</p>\n</li>\n<li>\n<p><strong>Sync data with WooCommerce</strong>: The plugin sync data with WooCommerce. You can select the coupon created in the WooCommerce system to display on the discount progress bar.</p>\n</li>\n<li>\n<p><strong>Thanks to customers</strong>: When a customer achieves a minimum for the discount, a THANK YOU message will display to congrats them.</p>\n</li>\n<li>\n<p><strong>Customize discount progress bar</strong>: You can customize the position, color, background, description, and messages of the progress bar.</p>\n</li>\n<li>\n<p><strong>Automatically direct to the checkout page</strong>: Allow automatically redirect to the checkout page after reaching the discount.</p>\n</li>\n</ul>\n<p>&#9658; <strong>MULTILINGUAL SUPPORT</strong></p>\n<ul>\n<li>\n<p>All input strings are translatable to all languages created by WPML/Polylang</p>\n</li>\n<li>\n<p>Able to sync configured upsells from the site&#8217;s default language to others</p>\n</li>\n<li>\n<p>GET PRO VERSION <a href=\"https://1.envato.market/yQBL3\" rel=\"nofollow ugc\">https://codecanyon.net/item/woocommerce-boost-sales/19668456</a></p>\n</li>\n</ul>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designer\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: Replace plaintext WordPress emails with more beautiful and professional templates</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">COREEM – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE &#8211; WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution &#8211; Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your “Thank You” page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/woocommerce-boost-sales/\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"http://villatheme.com\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/woocommerce-boost-sales/\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"http://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/woo-boost-sales.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/woo-boost-sales/assets/screenshot-1.png?rev=1835208",
            "caption": "Cross sells"
        },
        {
            "src": "https://ps.w.org/woo-boost-sales/assets/screenshot-2.png?rev=1835208",
            "caption": "Upsells"
        }
    ],
    "tags": {
        "add-to-cart-popup-woocommerce": "add to cart popup woocommerce",
        "woocommerce-add-to-cart-popup": "woocommerce add to cart popup",
        "woocommerce-boost-sales": "woocommerce boost sales",
        "woocommerce-cross-sell": "woocommerce cross sell",
        "woocommerce-popup-after-add-to-cart": "woocommerce popup after add to cart"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.1.7.10": "https://downloads.wordpress.org/plugin/woo-boost-sales.1.1.7.10.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/woo-boost-sales.1.2.0.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/woo-boost-sales.1.2.4.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://www.villatheme.com/donate",
    "banners": {
        "low": "https://ps.w.org/woo-boost-sales/assets/banner-772x250.jpg?rev=3080862",
        "high": "https://ps.w.org/woo-boost-sales/assets/banner-1544x500.jpg?rev=3080862"
    },
    "icons": {
        "1x": "https://ps.w.org/woo-boost-sales/assets/icon-128x128.gif?rev=3080862",
        "2x": "https://ps.w.org/woo-boost-sales/assets/icon-256x256.gif?rev=3080862"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 68,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/woo-boost-sales/blueprint.json?rev=3108468"
        }
    ],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "woo-boost-sales",
            "language": "vi",
            "version": "1.2.12",
            "updated": "2022-11-30 07:09:28",
            "package": "http://downloads.wordpress.org/translation/plugin/woo-boost-sales/1.2.12/vi.zip"
        }
    ]
}