{
    "name": "Abandoned Cart Recovery for WooCommerce",
    "slug": "woo-abandoned-cart-recovery",
    "version": "1.1.4",
    "author": "<a href=\"https://villatheme.com\">VillaTheme</a>",
    "author_profile": "https://profiles.wordpress.org/villatheme/",
    "contributors": {
        "villatheme": {
            "profile": "https://profiles.wordpress.org/villatheme/",
            "avatar": "https://secure.gravatar.com/avatar/973d0ef458adb8a3c527f196b9529909?s=96&d=monsterid&r=g",
            "display_name": "VillaTheme"
        },
        "mrt3vn": {
            "profile": "https://profiles.wordpress.org/mrt3vn/",
            "avatar": "https://secure.gravatar.com/avatar/cb8ecbc2ffe02a20ea2f5d1da26d3a22?s=96&d=monsterid&r=g",
            "display_name": "Andy Ha"
        }
    },
    "requires": "5.0",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [
        "woocommerce"
    ],
    "compatibility": [],
    "rating": 90,
    "ratings": {
        "5": 23,
        "4": 1,
        "3": 1,
        "2": 0,
        "1": 3
    },
    "num_ratings": 28,
    "support_url": "https://wordpress.org/support/plugin/woo-abandoned-cart-recovery/",
    "support_threads": 2,
    "support_threads_resolved": 1,
    "active_installs": 6000,
    "downloaded": 154090,
    "last_updated": "2024-06-13 9:31am GMT",
    "added": "2019-05-11",
    "homepage": "https://villatheme.com/extensions/woo-abandoned-cart-recovery/",
    "sections": {
        "description": "<p>What is WooCommerce Abandoned Cart Recovery? WooCommerce Abandoned Cart Recovery is a WooCommerce extension that helps you to recover unfinished orders in your store.  When a customer adds a product to the cart but does not complete check out. After a scheduled time, the cart will be marked as “abandoned”. WooCommerce Abandoned Cart Recovery will start to send cart recovery emails or Facebook messages to the customer, remind him/her to complete the order.</p>\n<blockquote>\n<p><a href=\"https://new2new.com/?item=woocommerce-abandoned-cart-recovery\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"http://docs.villatheme.com/?item=woocommerce-abandoned-cart-recovery\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/roBbv\" title=\"Pro Version\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/JV-NP6SfhEg?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>IMPORTANT NOTICE:</h3>\n<ul>\n<li>\n<p>The plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use the plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES:</h3>\n<p>&#9658; <strong>Capture WooCommerce Abandoned Cart</strong>: When a user adds a product to the cart but does not check out. After a selected time, the cart will be marked as “abandoned”. WooCommerce Abandoned Cart Recovery will capture the cart information include: add to cart date, customer email address, added to cart items, cart total, cart status, and IP address. Then using this information to contact the customer, offer a discount, and request him/her to complete check out.</p>\n<ul>\n<li>\n<p><strong>Track member cart</strong>: track the abandoned cart of logged-in users on your site.</p>\n</li>\n<li>\n<p><strong>Abandoned Cart time for Members</strong>: set the time from when a member has the last action with his cart till when the cart is marked as abandoned.</p>\n</li>\n<li>\n<p><strong>Track guest cart</strong>: track abandoned cart of guests on your site.</p>\n</li>\n<li>\n<p><strong>Abandoned Cart time for Guest</strong>: set the time from when a guest user has the last action with the cart till when the cart is marked as abandoned.</p>\n</li>\n<li>\n<p><strong>Abandoned Table</strong>: abandoned carts will be saved in the plugin back-end. And you can check the records at any time. The records provide information about time, username, email, item quantity, cart total price, items list, status, reminder logs, customer IP, and country.</p>\n</li>\n<li>\n<p><strong>Cart status</strong>: abandoned cart has 2 statuses abandoned and recovered.</p>\n</li>\n<li>\n<p><strong>Reminder logs</strong>: the reminder logs option allows you to check the email and FB message sent abandoned cart owner.</p>\n</li>\n<li>\n<p><strong>Exclude</strong>: exclude the username of persons who you don’t want to track their cart.</p>\n</li>\n<li>\n<p><strong>Capture email</strong>: Capture email address after customer entering their email at checkout page.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Send Recovery Emails in WooCommerce Abandoned Cart Recovery</strong>: The plugin sends recovery for abandoned carts and abandoned orders. When a cart or an order is marked as abandoned, the plugin will send a recovery email to the email address that the customer filled in the request email popup. Ask them to finish checking out the cart and offer coupons if it is necessary.</p>\n<ul>\n<li>\n<p><strong>Send recovery email to guests/members</strong>: choose if you want to send recovery cart email to guests and logged-in users.</p>\n</li>\n<li>\n<p><strong>Email templates</strong>: you can create many email templates and schedule to send them at different times.</p>\n</li>\n<li>\n<p><strong>Send email rules</strong> set up to send different recovery emails at different times.</p>\n</li>\n<li>\n<p><strong>Reply-to address</strong> set up a reply to email address. If customers reply to the recovery email, the reply email will come to this address. By default, it is the admin address.</p>\n</li>\n<li>\n<p><strong>Offer coupon</strong> you are able to send coupons along with recovery emails. With each email templates, you can choose to send an existing coupon. Or let the plugin generate unique coupons with given values. You can set up the generated coupon will all WooCommerce coupon options.</p>\n</li>\n<li>\n<p><strong>Send email manually</strong>: in the abandoned cart list, you can select some abandoned carts and an email template. And then send recovery emails to select abandoned cart owners.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Notify to admin</strong>: Admin is notified by email when an order is recovered.</p>\n<p>&#9658; <strong>Reports</strong>: The plugin provides 3 types of reports for you to check the abandoned carts. Select the suitable report type and a time range to view the report of the abandoned cart in that time.</p>\n<h3>PRO VERSION:</h3>\n<p>&#9658; <strong>Request email pop-up in WooCommerce Abandoned Cart Recovery</strong>: A pop-up will appear when customers click add to cart for the first time, requesting them to fill in an email address to complete the add to cart action. After getting an email the pop-up will not reappear and users can add products to the cart normally. And the email address will be automatically filled in the checkout form when the customer goes to the checkout page.</p>\n<ul>\n<li>\n<p><strong>Appear on</strong>: Choose pages where you want the request email pop-up to appear. Single product pages, shop page, cart page.</p>\n</li>\n<li>\n<p><strong>Required email</strong>: choose if you want to require an email address to add products. If this option is turned off, customers can close the request email pop-up to add products to the cart.</p>\n</li>\n<li>\n<p><strong>Dismiss time</strong>: set a time for the pop-up to reappear after a customer closes it.</p>\n</li>\n<li>\n<p><strong>Redirect after add to cart</strong>: when customers fill in an email and add the product to the cart. You can choose to redirect them to the cart or check out page.</p>\n</li>\n<li>\n<p><strong>2 templates</strong>: the pop-up has 2 built-in templates for you to change the front-end layout.</p>\n</li>\n<li>\n<p><strong>Change front-end text</strong>: you are able to change the text message on the pop-up.</p>\n</li>\n<li>\n<p><strong>Change pop-up color</strong>: all pop-up text, background, add to cart button colors can be changed in the plugin backend.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Send Recovery Emails</strong>:  Unlimited send email</p>\n<ul>\n<li><strong>Send recovery email with abandoned orders</strong>: you can set the plugin to send recovery emails to owners of failed, canceled, on hold, or pending payment orders.</li>\n</ul>\n<p>&#9658; <strong>Send Facebook Messages in WooCommerce Abandoned Cart Recovery</strong>: The plugin will display a “Send to Message” tickbox under the add to cart button on single product pages. If customers tick on this box before adding the product to the cart. The cart will be recorded and the plugin will send a recovery message to the customer on Facebook message. Recovery messages include text and a link to the checkout page. If customers click on the link, they will be redirected to the checkout page with their abandoned cart. This option requires a Facebook fan page and a Facebook app to work.</p>\n<ul>\n<li>\n<p><strong>Accept Facebook message to add to cart</strong>: a “Send to Messenger” tickbox will appear under the add to cart button on the product page. The plugin will send recovery cart messages to the customer’s facebook if he/she doesn’t complete checkout.</p>\n</li>\n<li>\n<p><strong>Set up Facebook messages</strong>: you can set up many messages with different texts.</p>\n</li>\n<li>\n<p><strong>Send message rules</strong>: schedule to send different messages at different times.</p>\n</li>\n<li>\n<p><strong>Language</strong>: choose the language which you want to display the “Send to Facebook” tickbox on the front-end.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Send SMS in WooCommerce Abandoned Cart Recovery</strong>: You can send SMS messages to customers who have abandoned carts. When a customer fills in their telephone number on the checkout page but does not complete checkout. The plugin will send recovery SMS messages with a link to the checkout page to the phone number.</p>\n<ul>\n<li>\n<p><strong>3 SMS providers</strong>: the plugin support 3 SMS provider Twilio, Nexmo, Plivo.</p>\n</li>\n<li>\n<p><strong>Send SMS for abandoned carts</strong>: the plugin will send recovery SMS when customers filled phone numbers on the checkout page.</p>\n</li>\n<li>\n<p><strong>Send SMS for abandoned orders</strong>: the plugin will send recovery SMS when an order is created but be marked as failed, pending payment, canceled, or on hold.</p>\n</li>\n<li>\n<p><strong>Create multiple messages</strong>: you can create multiple messages to send for abandoned cart and abandoned orders</p>\n</li>\n<li>\n<p><strong>Sending rules</strong>: schedule to send different messages at different times.</p>\n</li>\n<li>\n<p><strong>Shortcodes</strong>: the plugin provides a shortcode to display the customer name and link to the checkout page in the SMS.</p>\n</li>\n<li>\n<p><strong>Bit.ly config</strong>: the plugin use the bit.ly link to shorten the checkout link. You need to register for a bit.ly API and get an Access token.</p>\n</li>\n<li>\n<p><strong>Abandoned Order status</strong>: This allows you to choose which orders will be sent recovery SMS based on status. You can choose from the list: failed, pending payment, canceled, or on hold orders.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Report in WooCommerce Abandoned Cart Recovery</strong>: The plugin provides 4 types of reports for you to check the abandoned carts. Select the suitable report type and a time range to view the report of the abandoned cart in that time.</p>\n<p>&#9658; **Auto update**** During the support period, you are able to auto-update the plugin from your Dashboard.</p>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Product size Chart for WooCommerce customize and design the size chart of specific products or categories.</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons.</p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-abandoned-cart-recovery/\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"http://villatheme.com\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-abandoned-cart-recovery/\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"http://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
        "installation": "<ol>\n<li>Unzip the download package</li>\n<li>Upload <code>woo-abandoned-cart</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "changelog": "<p>/**1.1.4 &#8211; 2024.06.13 **/<br />\n&#8211; Updated: Translate text and sanitize output fields</p>\n<p>/**1.1.3 &#8211; 2024.04.13 **/<br />\n&#8211; Fixed: Save Guest postal code not correct</p>\n<p>/**1.1.2 &#8211; 2024.01.15 **/<br />\n&#8211; Updated: Add an option to Notification recover cart to custom email address</p>\n<p>/**1.1.1 &#8211; 2023.11.27 **/<br />\n&#8211; Update: Compatible with WP 6.4 and WC 8.3</p>\n<p>/**1.1.0 &#8211; 2023.09.05 **/<br />\n&#8211; Updated: Compatible with High-Performance order storage (COT)</p>\n<p>/**1.0.10 &#8211; 2023.05.08 **/<br />\n&#8211; Update: Compatible with WP 6.2 and WC 7.5</p>\n<p>/**1.0.9 &#8211; 2022.11.17 **/<br />\n&#8211; Updated: GDPR notice on checkout page</p>\n<p>/**1.0.8 &#8211; 2022.08.13 **/<br />\n&#8211; Fixed: Currency display on abandoned table incorrect<br />\n&#8211; Updated: Change checkout button block in email template to work with Outlook mail<br />\n&#8211; Updated: Update support file</p>\n<p>/**1.0.7 &#8211; 2022.06.29 **/<br />\n&#8211; Updated: Add filter &#8216;wacv_cart_item&#8217; to edit item of email<br />\n&#8211; Updated: Add a link to see the details of the IP address on the abandoned cart<br />\n&#8211; Fixed: Error when input blank email on checkout<br />\n&#8211; Fixed: Error with generate coupon</p>\n<p>/**1.0.6 &#8211; 2022.05.12 **/<br />\n&#8211; Updated: Update support file<br />\n&#8211; Fixed: Email templates sometimes cause errors with cart block<br />\n&#8211; Fixed: Error with invalid coupons<br />\n&#8211; Fixed: Error with test email</p>\n<p>/**1.0.5 &#8211; 2022.03.21 **/<br />\n&#8211; Updated: Compatible with WooCommerce 6.3 and WP 5.9<br />\n&#8211; Updated: Updated support<br />\n&#8211; Updated: Compatible with WPML<br />\n&#8211; Updated: Compatible with Polylang</p>\n<p>/**1.0.4.8 &#8211; 2022.01.08 **/<br />\n&#8211; Fixed: Filter member in abandoned cart<br />\n&#8211; Fixed: Price tax in report table</p>\n<p>/**1.0.4.7 &#8211; 2021.12.21 **/<br />\n&#8211; Fixed: Price sort in report table<br />\n&#8211; Updated: An option to remove the product link in the product detail in the abandoned emails</p>\n<p>/**1.0.4.6 &#8211; 2021.08.04 **/<br />\n&#8211; Fixed: Remove expired records</p>\n<p>/**1.0.4.5 &#8211; 2021.07.20 **/<br />\n&#8211; Updated: Report recovered cart</p>\n<p>/**1.0.4.4 &#8211; 2021.06.25 **/<br />\n&#8211; Fixed: Escaped variable, textdomain in translate function</p>\n<p>/**1.0.4.3 &#8211; 2021.06.22 **/<br />\n&#8211; Fixed: Escaped variable, update chartjs, define file location</p>\n<p>/**1.0.4.1 &#8211; 2021.06.18 **/<br />\n&#8211; Fixed: Check nonce</p>\n<p>/**1.0.4 &#8211; 2021.06.01 **/<br />\n&#8211; Update: Dashboard notices</p>\n<p>/**1.0.3.9 &#8211; 2021.04.16 **/<br />\n&#8211; Fixed: Bug with Funnel Builder</p>\n<p>/**1.0.3.8 &#8211; 2021.02.18 **/<br />\n&#8211; Update: Add option redirect to cart or checkout page when use recover link</p>\n<p>/**1.0.3.7 &#8211; 2020.12.18 **/<br />\n&#8211; Fixed: Modify column in database</p>\n<p>/**1.0.3.6 &#8211; 2020.12.17 **/<br />\n&#8211; Fixed: Query error</p>\n<p>/**1.0.3.5 &#8211; 2020.12.12 **/<br />\n&#8211; Fixed: Compatible with WooCommerce Coupon Box &amp; WooCommerce Lucky Wheel</p>\n<p>/**1.0.3.4 &#8211; 2020.12.09 **/<br />\n&#8211; Fixed: Report page</p>\n<p>/**1.0.3.2 &#8211; 2020.10.09 **/<br />\n&#8211; Fixed: save abandoned cart method</p>\n<p>/**1.0.3.1 &#8211; 2020.08.31 **/<br />\n&#8211; Fixed: Send email reminder after checkout</p>\n<p>/**1.0.3 &#8211; 2020.06.22 **/<br />\n&#8211; Fixed: Email header option</p>\n<p>/**1.0.2.9 &#8211; 2020.05.21 **/<br />\n&#8211; Fixed: Encode checkout button url</p>\n<p>/**1.0.2.8 &#8211; 2020.04.23 **/<br />\n&#8211; Update: Support file<br />\n&#8211; Update: Detect AspiegelBot spam bot</p>\n<p>/**1.0.2.7 &#8211; 2020.04.02 **/<br />\n&#8211; Update: Support file</p>\n<p>/**1.0.2.6 &#8211; 2020.03.17 **/<br />\n&#8211; Update: Add .pot file to translate</p>\n<p>/**1.0.2.5 &#8211; 2020.03.14 **/<br />\n&#8211; Fixed: Capture with user logged in</p>\n<p>/**1.0.2.4 &#8211; 2020.01.08 **/<br />\n&#8211; Update: Display coupon code</p>\n<p>/**1.0.2.3 &#8211; 2019.11.16 **/<br />\n&#8211; Update: Compatible with WP 5.3</p>\n<p>/**1.0.2.2 &#8211; 2019.10.16 **/<br />\n&#8211; Fixed: Recover link</p>\n<p>/**1.0.2.1 &#8211; 2019.10.07 **/<br />\n&#8211; Updated: Update read me</p>\n<p>/**1.0.2 &#8211; 2019.10.01 **/<br />\n&#8211; Updated: Update email template</p>\n<p>/<strong>1.0.1.2 &#8211; 2019.08.01</strong>/<br />\n&#8211; Fixed: Readme file</p>\n<p>/<strong>1.0.1.1 &#8211; 2019.07.31</strong>/<br />\n&#8211; Fixed: New Pro feature</p>\n<p>/<strong>1.0.1 &#8211; 2019.07.29</strong>/<br />\n&#8211; Updated: New email template<br />\n&#8211; Added: Link premium version</p>\n<p>/<strong>1.0.0.3 &#8211; 2019.06.05</strong>/<br />\n-Fixed: assign email template</p>\n<p>/<strong>1.0.0.2 &#8211; 2019.05.29</strong>/<br />\n-Fixed: Load support file</p>\n<p>/<strong>1.0.0.1 &#8211; 2019.05.22</strong>/<br />\n-Fixed: Custom email template</p>\n<p>/<strong>1.0.0 &#8211; 2019.05.10</strong>/<br />\n&#8211; First release</p>\n"
    },
    "short_description": "A simple, effective solution to capture abandoned carts and auto-send reminders. Track logs and generate reports on carts, emails, and more",
    "description": "<p>What is WooCommerce Abandoned Cart Recovery? WooCommerce Abandoned Cart Recovery is a WooCommerce extension that helps you to recover unfinished orders in your store.  When a customer adds a product to the cart but does not complete check out. After a scheduled time, the cart will be marked as “abandoned”. WooCommerce Abandoned Cart Recovery will start to send cart recovery emails or Facebook messages to the customer, remind him/her to complete the order.</p>\n<blockquote>\n<p><a href=\"https://new2new.com/?item=woocommerce-abandoned-cart-recovery\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"http://docs.villatheme.com/?item=woocommerce-abandoned-cart-recovery\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/roBbv\" title=\"Pro Version\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/JV-NP6SfhEg?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>IMPORTANT NOTICE:</h3>\n<ul>\n<li>\n<p>The plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use the plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES:</h3>\n<p>&#9658; <strong>Capture WooCommerce Abandoned Cart</strong>: When a user adds a product to the cart but does not check out. After a selected time, the cart will be marked as “abandoned”. WooCommerce Abandoned Cart Recovery will capture the cart information include: add to cart date, customer email address, added to cart items, cart total, cart status, and IP address. Then using this information to contact the customer, offer a discount, and request him/her to complete check out.</p>\n<ul>\n<li>\n<p><strong>Track member cart</strong>: track the abandoned cart of logged-in users on your site.</p>\n</li>\n<li>\n<p><strong>Abandoned Cart time for Members</strong>: set the time from when a member has the last action with his cart till when the cart is marked as abandoned.</p>\n</li>\n<li>\n<p><strong>Track guest cart</strong>: track abandoned cart of guests on your site.</p>\n</li>\n<li>\n<p><strong>Abandoned Cart time for Guest</strong>: set the time from when a guest user has the last action with the cart till when the cart is marked as abandoned.</p>\n</li>\n<li>\n<p><strong>Abandoned Table</strong>: abandoned carts will be saved in the plugin back-end. And you can check the records at any time. The records provide information about time, username, email, item quantity, cart total price, items list, status, reminder logs, customer IP, and country.</p>\n</li>\n<li>\n<p><strong>Cart status</strong>: abandoned cart has 2 statuses abandoned and recovered.</p>\n</li>\n<li>\n<p><strong>Reminder logs</strong>: the reminder logs option allows you to check the email and FB message sent abandoned cart owner.</p>\n</li>\n<li>\n<p><strong>Exclude</strong>: exclude the username of persons who you don’t want to track their cart.</p>\n</li>\n<li>\n<p><strong>Capture email</strong>: Capture email address after customer entering their email at checkout page.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Send Recovery Emails in WooCommerce Abandoned Cart Recovery</strong>: The plugin sends recovery for abandoned carts and abandoned orders. When a cart or an order is marked as abandoned, the plugin will send a recovery email to the email address that the customer filled in the request email popup. Ask them to finish checking out the cart and offer coupons if it is necessary.</p>\n<ul>\n<li>\n<p><strong>Send recovery email to guests/members</strong>: choose if you want to send recovery cart email to guests and logged-in users.</p>\n</li>\n<li>\n<p><strong>Email templates</strong>: you can create many email templates and schedule to send them at different times.</p>\n</li>\n<li>\n<p><strong>Send email rules</strong> set up to send different recovery emails at different times.</p>\n</li>\n<li>\n<p><strong>Reply-to address</strong> set up a reply to email address. If customers reply to the recovery email, the reply email will come to this address. By default, it is the admin address.</p>\n</li>\n<li>\n<p><strong>Offer coupon</strong> you are able to send coupons along with recovery emails. With each email templates, you can choose to send an existing coupon. Or let the plugin generate unique coupons with given values. You can set up the generated coupon will all WooCommerce coupon options.</p>\n</li>\n<li>\n<p><strong>Send email manually</strong>: in the abandoned cart list, you can select some abandoned carts and an email template. And then send recovery emails to select abandoned cart owners.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Notify to admin</strong>: Admin is notified by email when an order is recovered.</p>\n<p>&#9658; <strong>Reports</strong>: The plugin provides 3 types of reports for you to check the abandoned carts. Select the suitable report type and a time range to view the report of the abandoned cart in that time.</p>\n<h3>PRO VERSION:</h3>\n<p>&#9658; <strong>Request email pop-up in WooCommerce Abandoned Cart Recovery</strong>: A pop-up will appear when customers click add to cart for the first time, requesting them to fill in an email address to complete the add to cart action. After getting an email the pop-up will not reappear and users can add products to the cart normally. And the email address will be automatically filled in the checkout form when the customer goes to the checkout page.</p>\n<ul>\n<li>\n<p><strong>Appear on</strong>: Choose pages where you want the request email pop-up to appear. Single product pages, shop page, cart page.</p>\n</li>\n<li>\n<p><strong>Required email</strong>: choose if you want to require an email address to add products. If this option is turned off, customers can close the request email pop-up to add products to the cart.</p>\n</li>\n<li>\n<p><strong>Dismiss time</strong>: set a time for the pop-up to reappear after a customer closes it.</p>\n</li>\n<li>\n<p><strong>Redirect after add to cart</strong>: when customers fill in an email and add the product to the cart. You can choose to redirect them to the cart or check out page.</p>\n</li>\n<li>\n<p><strong>2 templates</strong>: the pop-up has 2 built-in templates for you to change the front-end layout.</p>\n</li>\n<li>\n<p><strong>Change front-end text</strong>: you are able to change the text message on the pop-up.</p>\n</li>\n<li>\n<p><strong>Change pop-up color</strong>: all pop-up text, background, add to cart button colors can be changed in the plugin backend.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Send Recovery Emails</strong>:  Unlimited send email</p>\n<ul>\n<li><strong>Send recovery email with abandoned orders</strong>: you can set the plugin to send recovery emails to owners of failed, canceled, on hold, or pending payment orders.</li>\n</ul>\n<p>&#9658; <strong>Send Facebook Messages in WooCommerce Abandoned Cart Recovery</strong>: The plugin will display a “Send to Message” tickbox under the add to cart button on single product pages. If customers tick on this box before adding the product to the cart. The cart will be recorded and the plugin will send a recovery message to the customer on Facebook message. Recovery messages include text and a link to the checkout page. If customers click on the link, they will be redirected to the checkout page with their abandoned cart. This option requires a Facebook fan page and a Facebook app to work.</p>\n<ul>\n<li>\n<p><strong>Accept Facebook message to add to cart</strong>: a “Send to Messenger” tickbox will appear under the add to cart button on the product page. The plugin will send recovery cart messages to the customer’s facebook if he/she doesn’t complete checkout.</p>\n</li>\n<li>\n<p><strong>Set up Facebook messages</strong>: you can set up many messages with different texts.</p>\n</li>\n<li>\n<p><strong>Send message rules</strong>: schedule to send different messages at different times.</p>\n</li>\n<li>\n<p><strong>Language</strong>: choose the language which you want to display the “Send to Facebook” tickbox on the front-end.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Send SMS in WooCommerce Abandoned Cart Recovery</strong>: You can send SMS messages to customers who have abandoned carts. When a customer fills in their telephone number on the checkout page but does not complete checkout. The plugin will send recovery SMS messages with a link to the checkout page to the phone number.</p>\n<ul>\n<li>\n<p><strong>3 SMS providers</strong>: the plugin support 3 SMS provider Twilio, Nexmo, Plivo.</p>\n</li>\n<li>\n<p><strong>Send SMS for abandoned carts</strong>: the plugin will send recovery SMS when customers filled phone numbers on the checkout page.</p>\n</li>\n<li>\n<p><strong>Send SMS for abandoned orders</strong>: the plugin will send recovery SMS when an order is created but be marked as failed, pending payment, canceled, or on hold.</p>\n</li>\n<li>\n<p><strong>Create multiple messages</strong>: you can create multiple messages to send for abandoned cart and abandoned orders</p>\n</li>\n<li>\n<p><strong>Sending rules</strong>: schedule to send different messages at different times.</p>\n</li>\n<li>\n<p><strong>Shortcodes</strong>: the plugin provides a shortcode to display the customer name and link to the checkout page in the SMS.</p>\n</li>\n<li>\n<p><strong>Bit.ly config</strong>: the plugin use the bit.ly link to shorten the checkout link. You need to register for a bit.ly API and get an Access token.</p>\n</li>\n<li>\n<p><strong>Abandoned Order status</strong>: This allows you to choose which orders will be sent recovery SMS based on status. You can choose from the list: failed, pending payment, canceled, or on hold orders.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Report in WooCommerce Abandoned Cart Recovery</strong>: The plugin provides 4 types of reports for you to check the abandoned carts. Select the suitable report type and a time range to view the report of the abandoned cart in that time.</p>\n<p>&#9658; **Auto update**** During the support period, you are able to auto-update the plugin from your Dashboard.</p>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Product size Chart for WooCommerce customize and design the size chart of specific products or categories.</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons.</p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-abandoned-cart-recovery/\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"http://villatheme.com\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-abandoned-cart-recovery/\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"http://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/woo-abandoned-cart-recovery.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/woo-abandoned-cart-recovery/assets/screenshot-1.jpg?rev=2092702",
            "caption": "Abandoned reports"
        },
        {
            "src": "https://ps.w.org/woo-abandoned-cart-recovery/assets/screenshot-2.jpg?rev=2648619",
            "caption": "Plugin settings"
        },
        {
            "src": "https://ps.w.org/woo-abandoned-cart-recovery/assets/screenshot-3.jpg?rev=2648619",
            "caption": "Abandoned carts list"
        }
    ],
    "tags": {
        "abandoned-cart-pro-for-woocommerce": "abandoned cart pro for woocommerce",
        "woocommerce": "woocommerce",
        "woocommerce-abandoned-cart": "woocommerce abandoned cart",
        "woocommerce-abandoned-cart-email": "woocommerce abandoned cart email",
        "woocommerce-abandoned-cart-recovery": "WooCommerce abandoned cart recovery"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.villatheme.com/donate",
    "banners": {
        "low": "https://ps.w.org/woo-abandoned-cart-recovery/assets/banner-772x250.jpg?rev=3081786",
        "high": "https://ps.w.org/woo-abandoned-cart-recovery/assets/banner-1544x500.jpg?rev=3081786"
    },
    "icons": {
        "1x": "https://ps.w.org/woo-abandoned-cart-recovery/assets/icon-128x128.gif?rev=3081786",
        "2x": "https://ps.w.org/woo-abandoned-cart-recovery/assets/icon-256x256.gif?rev=3081786"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 90,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/woo-abandoned-cart-recovery/blueprint.json?rev=3102202"
        }
    ],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "woo-abandoned-cart-recovery",
            "language": "vi",
            "version": "1.1.4",
            "updated": "2022-11-30 07:39:04",
            "package": "http://downloads.wordpress.org/translation/plugin/woo-abandoned-cart-recovery/1.1.4/vi.zip"
        }
    ]
}