{
    "name": "Delivery &amp; Pickup Date Time for WooCommerce",
    "slug": "woo-delivery",
    "version": "1.3.67",
    "author": "<a href=\"https://coderockz.com\">CodeRockz</a>",
    "author_profile": "https://profiles.wordpress.org/shoroar/",
    "contributors": {
        "shoroar": {
            "profile": "https://profiles.wordpress.org/shoroar/",
            "avatar": "https://secure.gravatar.com/avatar/ad24879bc91ec51778252fc246858ca2?s=96&d=monsterid&r=g",
            "display_name": "coderockz"
        }
    },
    "requires": "4.0.1",
    "tested": "6.5.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 243,
        "4": 2,
        "3": 2,
        "2": 2,
        "1": 1
    },
    "num_ratings": 250,
    "support_url": "https://wordpress.org/support/plugin/woo-delivery/",
    "support_threads": 1,
    "support_threads_resolved": 1,
    "active_installs": 6000,
    "downloaded": 457324,
    "last_updated": "2024-05-15 06:34:00",
    "added": "2019-09-12",
    "homepage": "",
    "sections": {
        "description": "<p><strong>Delivery &amp; Pickup Date Time for WooCommerce</strong> is a WooCommerce plugin extension that gives the facility of selecting delivery/pickup date and time at order checkout page. If want, store admin can create a list of pickup location for customers and if any customer want to take his/her order products from a selected pickup location. Also customers can give special instructions about his/her order via the plugin. The Store admin can also control the delivery/pickup date, time from the individual order page. Store admin can change the delivery/pickup date and time if needed and can also notify the user via email. It&#8217;s fairly easy to set up the plugin that you don&#8217;t have to take any hassle. Moreover, you don&#8217;t need to worry about the styling because the plugin compatible with your theme styling.</p>\n<blockquote>\n<h4>Free version only has the basic setup of delivery/pickup date and time.</h4>\n<p></p>\n<h4><a href=\"https://coderockz.com/downloads/woocommerce-delivery-date-time-wordpress-plugin/\" rel=\"nofollow ugc\">Premium Version</a> has many more additional awesome features that you can&#8217;t imagine</h4>\n<p></p>\n<h4>To see live demo of Premium Version <a href=\"https://coderockz.com/downloads/woocommerce-delivery-date-time-wordpress-plugin/\" rel=\"nofollow ugc\">click here</a> and go to the live demo tab for the details</h4>\n<p>\n</p></blockquote>\n<h3>Support</h3>\n<p>To make your journey with us more easier &amp; error free, We’ve a dedicated team. So, if you use our plugin or facing any problem feel free to contact with us by going to our <a href=\"https://coderockz.com/support/\" rel=\"nofollow ugc\">support page</a>.</p>\n<h3>PRO Version Features</h3>\n<p><strong>Time Zone Based Delivery Information:</strong> Delivery information like date, time set based on the selected timezone.</p>\n<p><strong>Advance Settings Option for Date &amp; Time:</strong> You can enable or disable the date and time field in the checkout page. Also, you can make them mandatory or optional. You can choose your desired date or time format. The weekend option is also available. You can also control maximum delivery/pickup per day or maximum (delivery+ pickup) per day.</p>\n<p><strong>Home Delivery or Self Pickup:</strong> You can use only delivery or only pickup but we have an option that if you want you can give customers the opportunity that he can select what he wants. If he wants home delivery than he has to enter the delivery date and delivery time. And if he wants self pickup than he has to enter the pickup date and from where he picks up his ordered products. <strong>WooCommerce shipping methods are automatically changed based on your selection. Also the plugin Dynamically Enable/Disable Delivery/Pickup Based on WooCommerce Shipping.</strong></p>\n<p><strong>Hide Plugin Module For Specific Shipping Method:</strong> If your website is giving shipping via local courier or postal service then you may want to hide the plugin module because there is no time frame when the product arrive to your customer via local courier or postal service.</p>\n<p><strong>Custom Delivery/Pickup Timeslot:</strong> You can make a custom delivery/pickup timeslot as you want. For an example, you can make 2 timeslots like 2:00PM &#8211; 4:00PM and 6:00PM &#8211; 7:00PM. Also you can control in which weekdays the timeslot appears. You can also disable a timeslot for a specific product/category, your woocommerce shipping zone/state/postcode. Also you can control a timeslot&#8217;s maximum delivery/pickup, time slot fee, disable timeslot for the current day, disable timeslot at a specific time, or enable timeslot only for specific dates etc.</p>\n<p><strong>Time slot with single time:</strong> You can also make a timeslot with single time along with a time range.</p>\n<p><strong>One Tab To Control All Deliveries:</strong> The plugin has an advanced Delivery Reports tab from where you can control all of your deliveries includes showing billing address, shipping address, ordered product details, etc. Also, you can make an order completed or delivered. You don&#8217;t need to take hassle because <strong>orders are sorted in ascending order automatically based on delivery date and time in Delivery Reports.</strong></p>\n<p><strong>Report of Product Quantity:</strong> It&#8217;s a useful feature for those how need to know how much product quantity he needs to prepare for delivery or pickup for a specific day.</p>\n<p><strong>Delivery Reports As Excel Sheet(xlsx format):</strong> You can now download the delivery reports as an excel sheet. You get all the necessary information like order id, order status, delivery details, delivery status, billing address, shipping address, order details, order total, customer note, etc.</p>\n<p><strong>Ability to Sort Order By Delivery Details in WooCommerce Orders Page:</strong> You can now sort your orders on the woocommerce orders listing page by delivery details.</p>\n<p><strong>Delivery Calendar:</strong> This is the most exciting feature of this plugin. You can now see the delivery/pickup order in a calendar view. Also, you can also see the product quantity in the calendar view.</p>\n<p><strong>Sync to Google Calendar:</strong> You can add the order information to your Google calendar as an event when an order is placed and the process is automated. You don&#8217;t have to do anything except the settings. You can also give the opportunity to your customer to add his placed order information to his Google calendar also.</p>\n<p><strong>Delivery Tips Option:</strong> Now you can give an option of delivery tips for the delivery boys to your customer. You can either set a predefined tips dropdown value or a input field where the customer put any amount as tips.</p>\n<p><strong>Restrict Delivery Option Based on Cart Amount:</strong> Now you can hide the delivery option until the cart amount reaches a certain amount.</p>\n<p><strong>Restrict Pickup Option Based on Cart Amount:</strong> Now you can hide the pickup option until the cart amount reaches a certain amount.</p>\n<p><strong>Restrict Delivery/Pickup Option Based on Category/Product:</strong> Now you can hide the delivery or pickup option if the cart has a specific category&#8217;s product or a specific product.</p>\n<p><strong>Restrict Free Shipping Based on Cart Amount:</strong> Now you can hide the free shipping method until the cart amount reaches a certain amount. You can also hide/show free shipping only for today or some specific dates or any weekdays.</p>\n<p><strong>Enable/disable Free Shipping only for current date delivery:</strong> Now you can enable/disable the free shipping method for current day delivery.</p>\n<p><strong>Enable/disable Free Shipping for specific weekday delivery:</strong> Now you can enable/disable the free shipping method for specific weekday delivery.</p>\n<p><strong>Disable Delivery or Pickup for Specific days:</strong> If you want you can disable Delivery or Self Pickup for specific days.</p>\n<p><strong>Individual Pickup Time:</strong> You can control your pickup time individually. No more same delivery time and pickup time.</p>\n<p><strong>Calendar Language:</strong> You can select your desired language for the date selection calendar so that your customer select the date more easily.</p>\n<p><strong>Off Days:</strong> This is a highlighted feature of this plugin. You can specify the off-days so the customer can&#8217;t select those days for delivery or pickup individually.</p>\n<p><strong>Advanced Off Days:</strong> This is another highlighted feature of this plugin. You can specify the weekdays or weekends for a specific category, product, shipping zone, state, postcode and shipping method. Also, you can set specific date as offdays for any category and shipping zone.</p>\n<p><strong>Next Month Off for Certain Category:</strong> Sometime you need to off all the delivery date&#8217;s for the next months for a specific category. Customer can only choose the delivery/pickup date from the current month and for this we have that feature.</p>\n<p><strong>Next Week/Current week Off for Certain Category:</strong> Sometime you need to off all the delivery date&#8217;s for the next week or current week for a specific category. Customer can only choose the delivery/pickup date from the current week(next week off)/ next week(current week off).</p>\n<p><strong>Category wise Specific dates and weekdays Offdays:</strong> You can set specific dates or weekdays as offdays for a specific category. The most important thing is, you can set this separately for delivery and pickup.</p>\n<p><strong>Shipping zone wise Specific dates and weekdays Offdays:</strong> You can set specific dates or weekdays as offdays for a shipping zone. The most important thing is, you can set this separately for delivery and pickup.</p>\n<p><strong>Special Open Days:</strong> Sometimes a special day like Christmas is fallen in an weekend but you still want to open this day. For this, we have this feature. Also, you can special open days for a specific category and if you want to open only the special days for a specific category, it is also possible. You can set up the special open days individually for delivery or pickup. Also can add processing delay if needed.</p>\n<p><strong>Store Closing Time:</strong> You can give a specific time as store closing time. After the time no one can select the current day. If you want to set further days off after this specific closing time, you can do that also. For example:</p>\n<ol>\n<li>\n<p>Earliest delivery date is tomorrow. Also after 5:00 PM of the current day, want to disable tomorrow. The next available date is the day after tomorrow.</p>\n</li>\n<li>\n<p>Want to disable the current date as to delivery after 12:00 PM</p>\n</li>\n</ol>\n<p><strong>Laundry Service:</strong> The store which has laundry service need both pickup and delivery at a time. You can offer this with our plugin. You can set how much time delay from pickup to delivery if sameday will select for both delivery and pickup. Also you can make any number of day delay from pickup to delivery. Moreover, the delay of day can make categorywise also.</p>\n<p><strong>Different store closing time for different weekday:</strong> You can give a specific time as store closing time for a specific weekday. After the time no one can select the specific day from the calendar.</p>\n<p><strong>Show/Hide Custom Time Slot for Shipping Zone/State/PostCode:</strong> You can hide/show a time slot for specific days, shipping zone, shipping state or postcode.</p>\n<p><strong>Show/Hide Custom Time Slot based on Cart Products/Categories:</strong> You can also show or hide custom timeslot based on cart products and categories.</p>\n<p><strong>Show/Hide Custom Pickup Slot based on Pickup Location:</strong> You can also show or hide custom pickup slot based on pickup location.</p>\n<p><strong>Processing Days Management:</strong> Sometimes, your store has some products that are not delivered instantly. You need some days for processing those products. You can easily handle the situation with this plugin. So you don&#8217;t need to worry because our plugin automatically disables days based on your product processing days. You can either specify your processing days by category or product-wise or weekday wise or shipping zone wise. Also, you can exclude specific products or categories from processing days. The most important part is, you can set different processing days for delivery and pickup.</p>\n<p><strong>Processing Time Management:</strong> Sometimes, your store has some products that are not delivered instantly. You need some times for processing those products. You can easily handle the situation with this plugin. So you don&#8217;t need to worry because our plugin automatically disables timeslot based on your product processing time. You can either specify your processing time by category or product-wise or weekday wise. Also, you can exclude specific products or categories from processing time. This feature is super useful for restaurants and cafes. The most important part is, you can set different processing time for delivery and pickup.</p>\n<p><strong>Delivery Fee:</strong> Another advanced feature of this plugin is fee management. You can specify a fee for each time slot you made. Also, you can specify a fee for Delivery dates like for same-day delivery, for next day delivery, and other day delivery.</p>\n<p><strong>Weekday wise Delivery Fee:</strong> You can specify a fee for a specific weekday.</p>\n<p><strong>Delivery Fee/Shipping Method within X Minutes/Hours:</strong> Now you can specify a shipping method only for next available x hours/minutes. The shipping methods is only applicable when customers select the special type of timeslot like Express Delivery($x) or Delivery within X hours/ minutes for $x. Also you can give a specific delivery fee for the next X hours/ minutes.</p>\n<p><strong>Shipping Method for first X days:</strong> Now you can specify a shipping method only for next available X days.</p>\n<p><strong>Pickup Location With Lot of Control:</strong> You can specify a pickup location from where your customer takes his order products. You can control how many pickup per location, disable a weekday for a specific pickup location, disable pickup location for specific category or product. You can enable or disable the feature at any time.</p>\n<p><strong>Hide plugin module based on Category/Product:</strong> If you want you can completely hide the plugin module for a specific category or product.</p>\n<p><strong>Hide Plugin Module For Specific User Role:</strong> If you want you can completely hide the plugin module for a specific User role.</p>\n<p><strong>Additional Field for Special Instructions:</strong> Enabling this field will be helpful when any customer wants to provide guidelines about the order.</p>\n<p><strong>WooCommerce App Support Using Order Note:</strong> The plugin adds delivery information in order note. The feature is super handy because the WooCommerce app doesn&#8217;t allow any custom information. So if you control your order using the WooCommerce app, you don&#8217;t need to worry about Delivery details.</p>\n<p><strong>Filtering and Bulk Action Functionality on WooCommerce Order page:</strong> You can filter your orders according to the delivery/pickup date on the WooCommerce order page. Also, you can complete delivery/pickup completed in bulk from the WooCommerce order page.</p>\n<p><strong>Other Settings:</strong> You can choose where you want to show the date-time field at checkout page for your customer. Also can give access to your shop manager, can change loading animation, background color and a lot of other features.</p>\n",
        "installation": "<p>Before installing the plugin please make sure that</p>\n<ol>\n<li>Your php version is 5.4 or greater</li>\n<li>WordPress version is 4.0 or greater</li>\n<li>WooCommerce version is 3.0 or greater</li>\n</ol>\n<p>This section describes how to install the plugin and get it working.</p>\n<p>e.g.</p>\n<ol>\n<li>Upload <code>woo-delivery.zip</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n<li>Select &#8216;Woo Delivery&#8217; from admin menu and setup the necessary settings</li>\n<li>Done!</li>\n</ol>\n",
        "changelog": "<h4>1.3.67</h4>\n<ul>\n<li>Fixed: Plugin is showing for variable downloadable products.</li>\n</ul>\n<h4>1.3.66</h4>\n<ul>\n<li>Fixed: Validation is not working for some payment plugin.</li>\n</ul>\n<h4>1.3.65</h4>\n<ul>\n<li>Fixed: Compatibility issue with Divi builder made checkout page is fixed.</li>\n</ul>\n<h4>1.3.64</h4>\n<ul>\n<li>Tweak: Unnecessary files are deleted.</li>\n</ul>\n<h4>1.3.63</h4>\n<ul>\n<li>fixed: Dropdown is showing at the bottom of the page.</li>\n</ul>\n<h4>1.3.62</h4>\n<ul>\n<li>Tweak: Compatability check with WC 8.2</li>\n</ul>\n<h4>1.3.61</h4>\n<ul>\n<li>Tweak: Compatability check with WordPress 6.3</li>\n</ul>\n<h4>1.3.60</h4>\n<ul>\n<li>Tweak: Make the plugin compatible with Woocommerce HPOS.</li>\n</ul>\n<h4>1.3.59</h4>\n<ul>\n<li>fixed: Delivery details is not showing on My Accounts &gt; Orders page.</li>\n</ul>\n<h4>1.3.58</h4>\n<ul>\n<li>Tweak: Change the default meta box heading in single order page.</li>\n</ul>\n<h4>1.3.57</h4>\n<ul>\n<li>Tweak: Update the plugin description.</li>\n</ul>\n<h4>1.3.56</h4>\n<ul>\n<li>Tweak: Compatability check with WC 7.8</li>\n</ul>\n<h4>1.3.55</h4>\n<ul>\n<li>Fixed: PHP warning v8 fixed.</li>\n</ul>\n<h4>1.3.54</h4>\n<ul>\n<li>Tweak: Update pro verion features on README.txt.</li>\n</ul>\n<h4>1.3.53</h4>\n<ul>\n<li>Tweak: Compatability check with WC 7.7</li>\n</ul>\n<h4>1.3.52</h4>\n<ul>\n<li>Tweak: Compatability check with WordPress 6.2</li>\n</ul>\n<h4>1.3.51</h4>\n<ul>\n<li>Tweak: Compatability check with WC 7.6</li>\n</ul>\n<h4>1.3.50</h4>\n<ul>\n<li>Tweak: Update pro verion features on plugin settings page.</li>\n</ul>\n<h4>1.3.49</h4>\n<ul>\n<li>Tweak: Update the comparison of plugin feature between PRO and free version.</li>\n</ul>\n<h4>1.3.48</h4>\n<ul>\n<li>Tweak: Compatability check with WC 7.4</li>\n</ul>\n<h4>1.3.47</h4>\n<ul>\n<li>fixed: Flatsome parent theme check when enqueue script for flatsome theme</li>\n</ul>\n<h4>1.3.46</h4>\n<ul>\n<li>Tweak: Compatability check with WordPress 6.1</li>\n</ul>\n<h4>1.3.45</h4>\n<ul>\n<li>Fixed: Fix compatibility issue with Rental Products by 99w.</li>\n</ul>\n<h4>1.3.44</h4>\n<ul>\n<li>Tweak: Compatability check with WC 7.2</li>\n</ul>\n<h4>1.3.43</h4>\n<ul>\n<li>Fixed: Salient theme compatibility issue fixed.</li>\n</ul>\n<h4>1.3.42</h4>\n<ul>\n<li>Fixed: Plugin module is not showing on single order page.</li>\n</ul>\n<h4>1.3.41</h4>\n<ul>\n<li>Tweak: Update pro verion features on plugin settings page.</li>\n</ul>\n<h4>1.3.40</h4>\n<ul>\n<li>Tweak: Update pro verion features on plugin settings page.</li>\n</ul>\n<h4>1.3.39</h4>\n<ul>\n<li>Tweak: Remove redundant code.</li>\n</ul>\n<h4>1.3.38</h4>\n<ul>\n<li>Added: Changing WooCommerce Shipping Methods Based on Delivery/Pickup.</li>\n</ul>\n<h4>1.3.37</h4>\n<ul>\n<li>Tweak: Update the plugin description.</li>\n</ul>\n<h4>1.3.36</h4>\n<ul>\n<li>Tweak: Update pro verion features on plugin settings page.</li>\n</ul>\n<h4>1.3.35</h4>\n<ul>\n<li>Tweak: Compatability check with WC 6.8</li>\n</ul>\n<h4>1.3.34</h4>\n<ul>\n<li>Fixed: Fixed jquery dependency for some theme.</li>\n</ul>\n<h4>1.3.33</h4>\n<ul>\n<li>Tweak: Compatability check with WC 6.7</li>\n</ul>\n<h4>1.3.32</h4>\n<ul>\n<li>Fixed: Pickup/delivery date is showing wrong when update and both delivery and pickup date exists.</li>\n</ul>\n<h4>1.3.31</h4>\n<ul>\n<li>Tweak: Compatability issue check with WordPress v6.0</li>\n</ul>\n<h4>1.3.30</h4>\n<ul>\n<li>Tweak: Change plugin description.</li>\n</ul>\n<h4>1.3.29</h4>\n<ul>\n<li>Tweak: Compatability check with WC 6.4</li>\n</ul>\n<h4>1.3.28</h4>\n<ul>\n<li>Tweak: Update the feature list.</li>\n</ul>\n<h4>1.3.27</h4>\n<ul>\n<li>Tweak: Compatability issue with WordPress v5.9</li>\n</ul>\n<h4>1.3.26</h4>\n<ul>\n<li>Fixed: Warning on plugin settings page on PHP v8 fixed.</li>\n</ul>\n<h4>1.3.25</h4>\n<ul>\n<li>Tweak: Change pro plugin specification description..</li>\n</ul>\n<h4>1.3.24</h4>\n<ul>\n<li>Added: Delivery informaion to cloudprinter plugin added.</li>\n</ul>\n<h4>1.3.23</h4>\n<ul>\n<li>Added: Add nl translation for settings page.</li>\n</ul>\n<h4>1.3.22</h4>\n<ul>\n<li>Added: Modify the features list and update the README.txt.</li>\n</ul>\n<h4>1.3.21</h4>\n<ul>\n<li>Tweak: Compatability issue with WC 6.0</li>\n</ul>\n<h4>1.3.20</h4>\n<ul>\n<li>Fixed: Uncaught Error: Call to undefined method Coderockz_Woo_Delivery_Helper :: weekday_conversion_to_locale () for invoice plugin.</li>\n</ul>\n<h4>1.3.19</h4>\n<ul>\n<li>Fixed: Deprecated warning for PHP 8 fixed.</li>\n</ul>\n<h4>1.3.18</h4>\n<ul>\n<li>Added: Modify the features list.</li>\n</ul>\n<h4>1.3.17</h4>\n<ul>\n<li>Tweak: Compatability issue with WC 5.8.2</li>\n</ul>\n<h4>1.3.16</h4>\n<ul>\n<li>Added: Delivery informaion to packing slip added.</li>\n</ul>\n<h4>1.3.15</h4>\n<ul>\n<li>Fixed: Plugin deactivation button not working.</li>\n</ul>\n<h4>1.3.14</h4>\n<ul>\n<li>Tweak: Add new description for delivery tips option.</li>\n</ul>\n<h4>1.3.13</h4>\n<ul>\n<li>Fixed: Auto select date is not working for some timezone</li>\n</ul>\n<h4>1.3.12</h4>\n<ul>\n<li>Tweak: Compatability with WC 5.8</li>\n</ul>\n<h4>1.3.11</h4>\n<ul>\n<li>Tweak: Remove the deactivation popup.</li>\n</ul>\n<h4>1.3.10</h4>\n<ul>\n<li>Tweak: Increase the cookie time for delivery option.</li>\n</ul>\n<h4>1.3.9</h4>\n<ul>\n<li>Tweak: Compatability with WC 5.7</li>\n</ul>\n<h4>1.3.8</h4>\n<ul>\n<li>Fixed: Divi theme compatibility code will execute when only Divi theme is activated.</li>\n</ul>\n<h4>1.3.7</h4>\n<ul>\n<li>Fixed: Compatibility issue with Divi theme new version fixed.</li>\n</ul>\n<h4>1.3.6</h4>\n<ul>\n<li>Fixed: Previous date is selectable in order page metabox fixed.</li>\n</ul>\n<h4>1.3.5</h4>\n<ul>\n<li>Fixed: Fatal error – undefined function is_plugin_active() fixed.</li>\n</ul>\n<h4>1.3.4</h4>\n<ul>\n<li>Fixed: Compatibility issue with Divi theme fixed.</li>\n</ul>\n<h4>1.3.3</h4>\n<ul>\n<li>Fixed: Compatibility issue with plugin WooCommerce Checkout Manager by Quadlayer fixed.</li>\n</ul>\n<h4>1.3.2</h4>\n<ul>\n<li>Fixed: Previous day is selectable for some timezone.</li>\n</ul>\n<h4>1.3.1</h4>\n<ul>\n<li>Added: Add new plugin Feature</li>\n</ul>\n<h4>1.2.99</h4>\n<ul>\n<li>Tweak: Compatability with WC 5.5</li>\n</ul>\n<h4>1.2.98</h4>\n<ul>\n<li>Tweak: Added new feature list.</li>\n</ul>\n<h4>1.2.97</h4>\n<ul>\n<li>Tweak: Compatability with WordPress 5.8</li>\n</ul>\n<h4>1.2.96</h4>\n<ul>\n<li>Fixed: Wrong text domain detect for different language.</li>\n</ul>\n<h4>1.2.95</h4>\n<ul>\n<li>Tweak: Change the label or limit notice from localization tab.</li>\n</ul>\n<h4>1.2.94</h4>\n<ul>\n<li>Tweak: Update the README.txt file</li>\n</ul>\n<h4>1.2.93</h4>\n<ul>\n<li>Added: Add new plugin Feature</li>\n</ul>\n<h4>1.2.92</h4>\n<ul>\n<li>Tweak: Compatability with WC 5.4</li>\n</ul>\n<h4>1.2.91</h4>\n<ul>\n<li>Fixed: Auto select first available time is not working on IOS Safari web browser.</li>\n</ul>\n<h4>1.2.90</h4>\n<ul>\n<li>Tweak: Remove unused option name from the data.</li>\n</ul>\n<h4>1.2.89</h4>\n<ul>\n<li>Tweak: Remove redundant code from the admin file.</li>\n</ul>\n<h4>1.2.88</h4>\n<ul>\n<li>Tweak: Compatability with WC v5.3</li>\n</ul>\n<h4>1.2.87</h4>\n<ul>\n<li>Tweak: Remove unnecessary methods from the public file.</li>\n</ul>\n<h4>1.2.86</h4>\n<ul>\n<li>Tweak: Option settings combine in a specific variable.</li>\n</ul>\n<h4>1.2.85</h4>\n<ul>\n<li>Tweak: Reduce the size of off days field.</li>\n</ul>\n<h4>1.2.84</h4>\n<ul>\n<li>Tweak: Remove redundant code from public file.</li>\n</ul>\n<h4>1.2.83</h4>\n<ul>\n<li>Fixed: Compatibility issue with Jetpack site accelerator feature.</li>\n</ul>\n<h4>1.2.82</h4>\n<ul>\n<li>Fixed: Compatibility issue with WC v5.2 fixed.</li>\n</ul>\n<h4>1.2.81</h4>\n<ul>\n<li>Tweak: Change the default loading background color and animation.</li>\n</ul>\n<h4>1.2.80</h4>\n<ul>\n<li>Tweak: New way to implement weekend for delivery.</li>\n</ul>\n<h4>1.2.79</h4>\n<ul>\n<li>Fixed: Auto select delivery time is not working properly for safari browser.</li>\n</ul>\n<h4>1.2.78</h4>\n<ul>\n<li>Tweak: Remove the order type from order confirmation page and emails.</li>\n</ul>\n<h4>1.2.77</h4>\n<ul>\n<li>Tweak: Compatability with WC v5.1 &amp; WP v5.7</li>\n</ul>\n<h4>1.2.76</h4>\n<ul>\n<li>Added: Heading of the plugin module added.</li>\n</ul>\n<h4>1.2.75</h4>\n<ul>\n<li>Tweak: Compatability with WC 5.0</li>\n</ul>\n<h4>1.2.74</h4>\n<ul>\n<li>Added: Custom CSS box added.</li>\n</ul>\n<h4>1.2.73</h4>\n<ul>\n<li>Added: New position added.</li>\n</ul>\n<h4>1.2.72</h4>\n<ul>\n<li>Tweak: Not removing the settings after delete.</li>\n</ul>\n<h4>1.2.71</h4>\n<ul>\n<li>Tweak: Compatability with WC 4.9</li>\n</ul>\n<h4>1.2.70</h4>\n<ul>\n<li>Tweak: Remove delivery date format label from admin settings.</li>\n</ul>\n<h4>1.2.69</h4>\n<ul>\n<li>Tweak: New feature added.</li>\n</ul>\n<h4>1.2.68</h4>\n<ul>\n<li>Fixed: CSS bug fixed.</li>\n</ul>\n<h4>1.2.67</h4>\n<ul>\n<li>Fixed: Make every possible text WPML compatible.</li>\n</ul>\n<h4>1.2.66</h4>\n<ul>\n<li>Tweak: Date and time format calculate when they are available.</li>\n</ul>\n<h4>1.2.65</h4>\n<ul>\n<li>Fixed: Timeslot overflow the current window.</li>\n</ul>\n<h4>1.2.64</h4>\n<ul>\n<li>Fixed: Metabox data changing issue fixed.</li>\n</ul>\n<h4>1.2.63</h4>\n<ul>\n<li>Tweak: Repositioning the pickup date field.</li>\n</ul>\n<h4>1.2.62</h4>\n<ul>\n<li>Fixed: Overflow issue fixed for some themes.</li>\n</ul>\n<h4>1.2.61</h4>\n<ul>\n<li>Fixed: Delivery/Pickup time field has no max height.</li>\n</ul>\n<h4>1.2.60</h4>\n<ul>\n<li>Fixed: Theme compatibility issue fixed.</li>\n</ul>\n<h4>1.2.59</h4>\n<p>Fixed: Checkout page is not loaded after updating the latest WP v5.6 for some themes.</p>\n<h4>1.2.58</h4>\n<p>*Tweak: Make compatible with WordPress v5.6.</p>\n<h4>1.2.57</h4>\n<ul>\n<li>Fixed: CSS bug fixed.</li>\n</ul>\n<h4>1.2.56</h4>\n<ul>\n<li>Fixed: Calendar CSS bug fixed for some theme.</li>\n</ul>\n<h4>1.2.55</h4>\n<ul>\n<li>Added: New feature added.</li>\n<li>Checked: Check compatibility with WooCommerce v4.7.</li>\n</ul>\n<h4>1.2.54</h4>\n<ul>\n<li>Added: Order type localization text option added.</li>\n</ul>\n<h4>1.2.53</h4>\n<ul>\n<li>Added: New Features added.</li>\n</ul>\n<h4>1.2.52</h4>\n<ul>\n<li>Added: WC v4.6.1 tested.</li>\n</ul>\n<h4>1.2.51</h4>\n<ul>\n<li>Added: New features added.</li>\n</ul>\n<h4>1.2.50</h4>\n<ul>\n<li>Tweak: Load the js and CSS one and only on checkout page.</li>\n</ul>\n<h4>1.2.49</h4>\n<ul>\n<li>Fixed: Timeslot is not checking correctly while placing order if there is any remaining timeslot.</li>\n</ul>\n<h4>1.2.48</h4>\n<ul>\n<li>Added: New Feature Added.</li>\n</ul>\n<h4>1.2.47</h4>\n<ul>\n<li>Added: Live Demo of Pro version added.</li>\n</ul>\n<h4>1.2.46</h4>\n<ul>\n<li>Checked: Check compatibility with WordPress v5.5.1 and WooCommerce v4.5.2.</li>\n</ul>\n<h4>1.2.45</h4>\n<ul>\n<li>Tweak: Change the class name of column for avoiding conflict.</li>\n</ul>\n<h4>1.2.44</h4>\n<ul>\n<li>Fixed: Trying to access array offset on value of type null fixed.</li>\n</ul>\n<h4>1.2.43</h4>\n<ul>\n<li>Added: Real time checking added for passed time.</li>\n</ul>\n<h4>1.2.42</h4>\n<ul>\n<li>Fixed: Remove the order type if delivery option is disabled.</li>\n</ul>\n<h4>1.2.41</h4>\n<ul>\n<li>Tweak: Improve the UI.</li>\n</ul>\n<h4>1.2.40</h4>\n<ul>\n<li>Fixed: Not getting the required file.</li>\n</ul>\n<h4>1.2.39</h4>\n<ul>\n<li>Added: Individual pickup date added.</li>\n<li>Added: Individual pickup time added.</li>\n<li>Added: Option for choose from delivery or pickup added.</li>\n</ul>\n<h4>1.2.38</h4>\n<ul>\n<li>Fixed: Timezone select field css bug fixed.</li>\n</ul>\n<h4>1.2.37</h4>\n<ul>\n<li>Tweak: New features added.</li>\n</ul>\n<h4>1.2.36</h4>\n<ul>\n<li>Tweak: Improve the UI.</li>\n</ul>\n<h4>1.2.35</h4>\n<ul>\n<li>Fixed: Undefined variable for Allow Delivery in the Next for the very first time.</li>\n</ul>\n<h4>1.2.34</h4>\n<ul>\n<li>Fixed: Undefined variable onlyDeliveryTime fixed.</li>\n<li>Tweak: Change the format of saving delivery date and time.</li>\n</ul>\n<h4>1.2.33</h4>\n<ul>\n<li>Fixed: Make compatible with flatsome theme.</li>\n</ul>\n<h4>1.2.32</h4>\n<p>Added: Delivery type with each order added.</p>\n<h4>1.2.31</h4>\n<p>Tweak: Change the loading spinner.</p>\n<h4>1.2.30</h4>\n<p>Tweak: Update the calendar script.</p>\n<h4>1.2.29</h4>\n<p>Tweak: select2 replaced by selectWoo.</p>\n<h4>1.2.28</h4>\n<p>Fixed: Delivery date is not getting the full width for some theme.<br />\nFixed: Undefined index: onlyDeliveryTime notice fixed.</p>\n<h4>1.2.27</h4>\n<ul>\n<li>Fixed: Delivery date is not getting the full width for some theme.</li>\n</ul>\n<h4>1.2.26</h4>\n<ul>\n<li>Tested: Compatible with WooCommerce version 4.3.</li>\n</ul>\n<h4>1.2.25</h4>\n<ul>\n<li>Added: Make all the available color same in the calendar.</li>\n</ul>\n<h4>1.2.24</h4>\n<ul>\n<li>Added: New pot file added.</li>\n</ul>\n<h4>1.2.23</h4>\n<ul>\n<li>Added: Feature description changed.</li>\n</ul>\n<h4>1.2.22</h4>\n<ul>\n<li>Added: Make compatible with WooCommerce 4.2.</li>\n</ul>\n<h4>1.2.21</h4>\n<ul>\n<li>Added: Week starts from Sunday is not working.</li>\n</ul>\n<h4>1.2.20</h4>\n<ul>\n<li>Added: Feature description Added.</li>\n</ul>\n<h4>1.2.19</h4>\n<ul>\n<li>Fixed: Delivery starts and ends time 12:00AM is not properly saved.</li>\n<li>Fixed: Problem of maximum order limit fixed.</li>\n</ul>\n<h4>1.2.18</h4>\n<ul>\n<li>Tweak: Add extra layer to check maximum order per timeslot.</li>\n</ul>\n<h4>1.2.17</h4>\n<ul>\n<li>Tweak: Delivery section not loaded until full page load.</li>\n</ul>\n<h4>1.2.16</h4>\n<ul>\n<li>Fixed: Save timestamp in wrong format fixed.</li>\n</ul>\n<h4>1.2.15</h4>\n<ul>\n<li>Fixed: Save timestamp in wrong format fixed.</li>\n</ul>\n<h4>1.2.14</h4>\n<ul>\n<li>Fixed: Field Position between your order and payment section is not working.</li>\n</ul>\n<h4>1.2.13</h4>\n<ul>\n<li>Fixed: Off days is not working for the next month of 31th.</li>\n<li>Fixed: Calendar under Delivery time field for some themes.</li>\n</ul>\n<h4>1.2.12</h4>\n<ul>\n<li>Fixed: Delivery Date is not working for some timezone.</li>\n</ul>\n<h4>1.2.11</h4>\n<ul>\n<li>Fixed: Order created time not showing correctly in single order page fixed.</li>\n</ul>\n<h4>1.2.10</h4>\n<ul>\n<li>Fixed: Calendar Month is not visible for some themes.</li>\n<li>Fixed: New way to implement current time.</li>\n<li>Fixed: Red border from delivery time field removed.</li>\n</ul>\n<h4>1.2.9</h4>\n<ul>\n<li>Fixed: Checkout page unresponsiveness issue fixed.</li>\n</ul>\n<h4>1.2.8</h4>\n<ul>\n<li>Added: More places added for locate the Delivery Field in checkout page.</li>\n<li>Fixed: Checkout page crush problem fixed.</li>\n</ul>\n<h4>1.2.7</h4>\n<ul>\n<li>Tweak: Load external CSS and JS file only for checkout page.</li>\n</ul>\n<h4>1.2.6</h4>\n<ul>\n<li>Fixed: Delivery Days not working only for Sunday fixed.</li>\n</ul>\n<h4>1.2.5</h4>\n<ul>\n<li>Fixed: Undefined index notice for some input field fixed.</li>\n</ul>\n<h4>1.2.4</h4>\n<ul>\n<li>Fixed: Time Slot Ends At is not showing if given 12:00PM after time.</li>\n</ul>\n<h4>1.2.3</h4>\n<ul>\n<li>Fixed: Localization Settings is not saved.</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>Added: Localization Settings added for plugin text.</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Fixed: Time Slot Ends At 12:00AM is not working.</li>\n</ul>\n<h4>1.1.10</h4>\n<ul>\n<li>Added: Update the PRO feature list.</li>\n</ul>\n<h4>1.1.9</h4>\n<ul>\n<li>Tested: Compatible with WordPress version 5.4.</li>\n</ul>\n<h4>1.1.8</h4>\n<ul>\n<li>Fixed: Timeslot ends time can&#8217;t after timeslot starts time.</li>\n<li>Fixed: Timeslot ends time 24:00 is not appearing correctly fixed.</li>\n<li>Fixed: Timeslot ends time 24:00 inserted as 00:00 fixed.</li>\n</ul>\n<h4>1.1.7</h4>\n<ul>\n<li>Fixed: Timeslot is not disabled that has already passed if auto select 1st available date is enable.</li>\n</ul>\n<h4>1.1.6</h4>\n<ul>\n<li>Fixed: Delivery time settings is not working independently fixed.</li>\n</ul>\n<h4>1.1.5</h4>\n<ul>\n<li>Fixed: Default time is not working fixed.</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Added: Option for selecting first available time automatically.</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Added: Disable the timeslot that already passed away when date is not selected or date field is not used.</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Fixed: Minor Bug Fixed.</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Fixed: Calendar bug fixed.</li>\n</ul>\n<h4>1.0.10</h4>\n<ul>\n<li>Tweak: Load scripts and styles only for specific page.</li>\n</ul>\n<h4>1.0.9</h4>\n<ul>\n<li>Added: Option for selecting first available date automatically.</li>\n</ul>\n<h4>1.0.8</h4>\n<ul>\n<li>Update: Update the Calender script.</li>\n</ul>\n<h4>1.0.7</h4>\n<ul>\n<li>Added: Option for enabling or disabling Delivery date &amp; time if cart&#8217;s products are downloadable or virtual.</li>\n</ul>\n<h4>1.0.6</h4>\n<ul>\n<li>Fixed: After selecting Delivery Date, Delivery time field not showing properly for some Themes fixed.</li>\n</ul>\n<h4>1.0.5</h4>\n<ul>\n<li>Fixed: Delivery date &amp; time is always required if cart&#8217;s products are downloadable or virtual.</li>\n</ul>\n<h4>1.0.4</h4>\n<ul>\n<li>Added: Delivery date &amp; time is not showing if cart&#8217;s products are downloadable or virtual.</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Fixed: Last delivery time slot not showing correctly fixed.</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Fixed: Delivery time slot not showing correctly, if there is any fractional time slot fixed.</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Fixed: Delivery time format always in 12 hours format fixed.</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>First Release.</li>\n</ul>\n"
    },
    "short_description": "Gives the facility of selecting delivery/pickup date and time at order checkout page.",
    "description": "<p><strong>Delivery &amp; Pickup Date Time for WooCommerce</strong> is a WooCommerce plugin extension that gives the facility of selecting delivery/pickup date and time at order checkout page. If want, store admin can create a list of pickup location for customers and if any customer want to take his/her order products from a selected pickup location. Also customers can give special instructions about his/her order via the plugin. The Store admin can also control the delivery/pickup date, time from the individual order page. Store admin can change the delivery/pickup date and time if needed and can also notify the user via email. It&#8217;s fairly easy to set up the plugin that you don&#8217;t have to take any hassle. Moreover, you don&#8217;t need to worry about the styling because the plugin compatible with your theme styling.</p>\n<blockquote>\n<h4>Free version only has the basic setup of delivery/pickup date and time.</h4>\n<p></p>\n<h4><a href=\"https://coderockz.com/downloads/woocommerce-delivery-date-time-wordpress-plugin/\" rel=\"nofollow ugc\">Premium Version</a> has many more additional awesome features that you can&#8217;t imagine</h4>\n<p></p>\n<h4>To see live demo of Premium Version <a href=\"https://coderockz.com/downloads/woocommerce-delivery-date-time-wordpress-plugin/\" rel=\"nofollow ugc\">click here</a> and go to the live demo tab for the details</h4>\n<p>\n</p></blockquote>\n<h3>Support</h3>\n<p>To make your journey with us more easier &amp; error free, We’ve a dedicated team. So, if you use our plugin or facing any problem feel free to contact with us by going to our <a href=\"https://coderockz.com/support/\" rel=\"nofollow ugc\">support page</a>.</p>\n<h3>PRO Version Features</h3>\n<p><strong>Time Zone Based Delivery Information:</strong> Delivery information like date, time set based on the selected timezone.</p>\n<p><strong>Advance Settings Option for Date &amp; Time:</strong> You can enable or disable the date and time field in the checkout page. Also, you can make them mandatory or optional. You can choose your desired date or time format. The weekend option is also available. You can also control maximum delivery/pickup per day or maximum (delivery+ pickup) per day.</p>\n<p><strong>Home Delivery or Self Pickup:</strong> You can use only delivery or only pickup but we have an option that if you want you can give customers the opportunity that he can select what he wants. If he wants home delivery than he has to enter the delivery date and delivery time. And if he wants self pickup than he has to enter the pickup date and from where he picks up his ordered products. <strong>WooCommerce shipping methods are automatically changed based on your selection. Also the plugin Dynamically Enable/Disable Delivery/Pickup Based on WooCommerce Shipping.</strong></p>\n<p><strong>Hide Plugin Module For Specific Shipping Method:</strong> If your website is giving shipping via local courier or postal service then you may want to hide the plugin module because there is no time frame when the product arrive to your customer via local courier or postal service.</p>\n<p><strong>Custom Delivery/Pickup Timeslot:</strong> You can make a custom delivery/pickup timeslot as you want. For an example, you can make 2 timeslots like 2:00PM &#8211; 4:00PM and 6:00PM &#8211; 7:00PM. Also you can control in which weekdays the timeslot appears. You can also disable a timeslot for a specific product/category, your woocommerce shipping zone/state/postcode. Also you can control a timeslot&#8217;s maximum delivery/pickup, time slot fee, disable timeslot for the current day, disable timeslot at a specific time, or enable timeslot only for specific dates etc.</p>\n<p><strong>Time slot with single time:</strong> You can also make a timeslot with single time along with a time range.</p>\n<p><strong>One Tab To Control All Deliveries:</strong> The plugin has an advanced Delivery Reports tab from where you can control all of your deliveries includes showing billing address, shipping address, ordered product details, etc. Also, you can make an order completed or delivered. You don&#8217;t need to take hassle because <strong>orders are sorted in ascending order automatically based on delivery date and time in Delivery Reports.</strong></p>\n<p><strong>Report of Product Quantity:</strong> It&#8217;s a useful feature for those how need to know how much product quantity he needs to prepare for delivery or pickup for a specific day.</p>\n<p><strong>Delivery Reports As Excel Sheet(xlsx format):</strong> You can now download the delivery reports as an excel sheet. You get all the necessary information like order id, order status, delivery details, delivery status, billing address, shipping address, order details, order total, customer note, etc.</p>\n<p><strong>Ability to Sort Order By Delivery Details in WooCommerce Orders Page:</strong> You can now sort your orders on the woocommerce orders listing page by delivery details.</p>\n<p><strong>Delivery Calendar:</strong> This is the most exciting feature of this plugin. You can now see the delivery/pickup order in a calendar view. Also, you can also see the product quantity in the calendar view.</p>\n<p><strong>Sync to Google Calendar:</strong> You can add the order information to your Google calendar as an event when an order is placed and the process is automated. You don&#8217;t have to do anything except the settings. You can also give the opportunity to your customer to add his placed order information to his Google calendar also.</p>\n<p><strong>Delivery Tips Option:</strong> Now you can give an option of delivery tips for the delivery boys to your customer. You can either set a predefined tips dropdown value or a input field where the customer put any amount as tips.</p>\n<p><strong>Restrict Delivery Option Based on Cart Amount:</strong> Now you can hide the delivery option until the cart amount reaches a certain amount.</p>\n<p><strong>Restrict Pickup Option Based on Cart Amount:</strong> Now you can hide the pickup option until the cart amount reaches a certain amount.</p>\n<p><strong>Restrict Delivery/Pickup Option Based on Category/Product:</strong> Now you can hide the delivery or pickup option if the cart has a specific category&#8217;s product or a specific product.</p>\n<p><strong>Restrict Free Shipping Based on Cart Amount:</strong> Now you can hide the free shipping method until the cart amount reaches a certain amount. You can also hide/show free shipping only for today or some specific dates or any weekdays.</p>\n<p><strong>Enable/disable Free Shipping only for current date delivery:</strong> Now you can enable/disable the free shipping method for current day delivery.</p>\n<p><strong>Enable/disable Free Shipping for specific weekday delivery:</strong> Now you can enable/disable the free shipping method for specific weekday delivery.</p>\n<p><strong>Disable Delivery or Pickup for Specific days:</strong> If you want you can disable Delivery or Self Pickup for specific days.</p>\n<p><strong>Individual Pickup Time:</strong> You can control your pickup time individually. No more same delivery time and pickup time.</p>\n<p><strong>Calendar Language:</strong> You can select your desired language for the date selection calendar so that your customer select the date more easily.</p>\n<p><strong>Off Days:</strong> This is a highlighted feature of this plugin. You can specify the off-days so the customer can&#8217;t select those days for delivery or pickup individually.</p>\n<p><strong>Advanced Off Days:</strong> This is another highlighted feature of this plugin. You can specify the weekdays or weekends for a specific category, product, shipping zone, state, postcode and shipping method. Also, you can set specific date as offdays for any category and shipping zone.</p>\n<p><strong>Next Month Off for Certain Category:</strong> Sometime you need to off all the delivery date&#8217;s for the next months for a specific category. Customer can only choose the delivery/pickup date from the current month and for this we have that feature.</p>\n<p><strong>Next Week/Current week Off for Certain Category:</strong> Sometime you need to off all the delivery date&#8217;s for the next week or current week for a specific category. Customer can only choose the delivery/pickup date from the current week(next week off)/ next week(current week off).</p>\n<p><strong>Category wise Specific dates and weekdays Offdays:</strong> You can set specific dates or weekdays as offdays for a specific category. The most important thing is, you can set this separately for delivery and pickup.</p>\n<p><strong>Shipping zone wise Specific dates and weekdays Offdays:</strong> You can set specific dates or weekdays as offdays for a shipping zone. The most important thing is, you can set this separately for delivery and pickup.</p>\n<p><strong>Special Open Days:</strong> Sometimes a special day like Christmas is fallen in an weekend but you still want to open this day. For this, we have this feature. Also, you can special open days for a specific category and if you want to open only the special days for a specific category, it is also possible. You can set up the special open days individually for delivery or pickup. Also can add processing delay if needed.</p>\n<p><strong>Store Closing Time:</strong> You can give a specific time as store closing time. After the time no one can select the current day. If you want to set further days off after this specific closing time, you can do that also. For example:</p>\n<ol>\n<li>\n<p>Earliest delivery date is tomorrow. Also after 5:00 PM of the current day, want to disable tomorrow. The next available date is the day after tomorrow.</p>\n</li>\n<li>\n<p>Want to disable the current date as to delivery after 12:00 PM</p>\n</li>\n</ol>\n<p><strong>Laundry Service:</strong> The store which has laundry service need both pickup and delivery at a time. You can offer this with our plugin. You can set how much time delay from pickup to delivery if sameday will select for both delivery and pickup. Also you can make any number of day delay from pickup to delivery. Moreover, the delay of day can make categorywise also.</p>\n<p><strong>Different store closing time for different weekday:</strong> You can give a specific time as store closing time for a specific weekday. After the time no one can select the specific day from the calendar.</p>\n<p><strong>Show/Hide Custom Time Slot for Shipping Zone/State/PostCode:</strong> You can hide/show a time slot for specific days, shipping zone, shipping state or postcode.</p>\n<p><strong>Show/Hide Custom Time Slot based on Cart Products/Categories:</strong> You can also show or hide custom timeslot based on cart products and categories.</p>\n<p><strong>Show/Hide Custom Pickup Slot based on Pickup Location:</strong> You can also show or hide custom pickup slot based on pickup location.</p>\n<p><strong>Processing Days Management:</strong> Sometimes, your store has some products that are not delivered instantly. You need some days for processing those products. You can easily handle the situation with this plugin. So you don&#8217;t need to worry because our plugin automatically disables days based on your product processing days. You can either specify your processing days by category or product-wise or weekday wise or shipping zone wise. Also, you can exclude specific products or categories from processing days. The most important part is, you can set different processing days for delivery and pickup.</p>\n<p><strong>Processing Time Management:</strong> Sometimes, your store has some products that are not delivered instantly. You need some times for processing those products. You can easily handle the situation with this plugin. So you don&#8217;t need to worry because our plugin automatically disables timeslot based on your product processing time. You can either specify your processing time by category or product-wise or weekday wise. Also, you can exclude specific products or categories from processing time. This feature is super useful for restaurants and cafes. The most important part is, you can set different processing time for delivery and pickup.</p>\n<p><strong>Delivery Fee:</strong> Another advanced feature of this plugin is fee management. You can specify a fee for each time slot you made. Also, you can specify a fee for Delivery dates like for same-day delivery, for next day delivery, and other day delivery.</p>\n<p><strong>Weekday wise Delivery Fee:</strong> You can specify a fee for a specific weekday.</p>\n<p><strong>Delivery Fee/Shipping Method within X Minutes/Hours:</strong> Now you can specify a shipping method only for next available x hours/minutes. The shipping methods is only applicable when customers select the special type of timeslot like Express Delivery($x) or Delivery within X hours/ minutes for $x. Also you can give a specific delivery fee for the next X hours/ minutes.</p>\n<p><strong>Shipping Method for first X days:</strong> Now you can specify a shipping method only for next available X days.</p>\n<p><strong>Pickup Location With Lot of Control:</strong> You can specify a pickup location from where your customer takes his order products. You can control how many pickup per location, disable a weekday for a specific pickup location, disable pickup location for specific category or product. You can enable or disable the feature at any time.</p>\n<p><strong>Hide plugin module based on Category/Product:</strong> If you want you can completely hide the plugin module for a specific category or product.</p>\n<p><strong>Hide Plugin Module For Specific User Role:</strong> If you want you can completely hide the plugin module for a specific User role.</p>\n<p><strong>Additional Field for Special Instructions:</strong> Enabling this field will be helpful when any customer wants to provide guidelines about the order.</p>\n<p><strong>WooCommerce App Support Using Order Note:</strong> The plugin adds delivery information in order note. The feature is super handy because the WooCommerce app doesn&#8217;t allow any custom information. So if you control your order using the WooCommerce app, you don&#8217;t need to worry about Delivery details.</p>\n<p><strong>Filtering and Bulk Action Functionality on WooCommerce Order page:</strong> You can filter your orders according to the delivery/pickup date on the WooCommerce order page. Also, you can complete delivery/pickup completed in bulk from the WooCommerce order page.</p>\n<p><strong>Other Settings:</strong> You can choose where you want to show the date-time field at checkout page for your customer. Also can give access to your shop manager, can change loading animation, background color and a lot of other features.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.67.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-1.png?rev=2381712",
            "caption": "<p>Timezone Settings</p>"
        },
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-2.png?rev=2381712",
            "caption": "<p>Order Type Settings</p>"
        },
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-3.png?rev=2381712",
            "caption": "<p>Delivery Date Settings</p>"
        },
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-4.png?rev=2381712",
            "caption": "<p>Pickup Date Settings</p>"
        },
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-5.png?rev=2381712",
            "caption": "<p>Offdays Settings</p>"
        },
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-6.png?rev=2381712",
            "caption": "<p>Delivery Time Settings</p>"
        },
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-7.png?rev=2381712",
            "caption": "<p>Pickup Time Settings</p>"
        },
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-8.png?rev=2381712",
            "caption": "<p>Localization Settings</p>"
        },
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-9.png?rev=2381712",
            "caption": "<p>Other Settings</p>"
        },
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-10.png?rev=2381712",
            "caption": "<p>Order Page Metabox</p>"
        },
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-11.png?rev=2381712",
            "caption": "<p>Checkout Page Delivery Date Field View</p>"
        },
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-12.png?rev=2381712",
            "caption": "<p>Checkout Page Delivery Time Field View</p>"
        },
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-13.png?rev=2381712",
            "caption": "<p>Checkout Page Pickup Date Field View</p>"
        },
        {
            "src": "https://ps.w.org/woo-delivery/assets/screenshot-14.png?rev=2381712",
            "caption": "<p>Checkout Page Pickup Time Field View</p>"
        }
    ],
    "tags": {
        "delivery-date": "delivery date",
        "pickup-date": "pickup date",
        "woocommerce": "woocommerce",
        "woocommerce-delivery-date": "woocommerce delivery date",
        "woocommerce-pickup-date": "WooCommerce Pickup Date"
    },
    "stable_tag": "1.3.67",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/woo-delivery.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/woo-delivery.1.0.1.zip",
        "1.0.10": "https://downloads.wordpress.org/plugin/woo-delivery.1.0.10.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/woo-delivery.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/woo-delivery.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/woo-delivery.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/woo-delivery.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/woo-delivery.1.0.6.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/woo-delivery.1.0.7.zip",
        "1.0.8": "https://downloads.wordpress.org/plugin/woo-delivery.1.0.8.zip",
        "1.0.9": "https://downloads.wordpress.org/plugin/woo-delivery.1.0.9.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/woo-delivery.1.1.1.zip",
        "1.1.10": "https://downloads.wordpress.org/plugin/woo-delivery.1.1.10.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/woo-delivery.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/woo-delivery.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/woo-delivery.1.1.4.zip",
        "1.1.5": "https://downloads.wordpress.org/plugin/woo-delivery.1.1.5.zip",
        "1.1.6": "https://downloads.wordpress.org/plugin/woo-delivery.1.1.6.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/woo-delivery.1.1.7.zip",
        "1.1.8": "https://downloads.wordpress.org/plugin/woo-delivery.1.1.8.zip",
        "1.1.9": "https://downloads.wordpress.org/plugin/woo-delivery.1.1.9.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.1.zip",
        "1.2.10": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.10.zip",
        "1.2.11": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.11.zip",
        "1.2.12": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.12.zip",
        "1.2.13": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.13.zip",
        "1.2.14": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.14.zip",
        "1.2.15": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.15.zip",
        "1.2.16": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.16.zip",
        "1.2.17": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.17.zip",
        "1.2.18": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.18.zip",
        "1.2.19": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.19.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.2.zip",
        "1.2.20": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.20.zip",
        "1.2.21": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.21.zip",
        "1.2.22": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.22.zip",
        "1.2.23": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.23.zip",
        "1.2.24": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.24.zip",
        "1.2.25": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.25.zip",
        "1.2.26": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.26.zip",
        "1.2.27": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.27.zip",
        "1.2.28": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.28.zip",
        "1.2.29": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.29.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.3.zip",
        "1.2.30": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.30.zip",
        "1.2.31": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.31.zip",
        "1.2.32": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.32.zip",
        "1.2.33": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.33.zip",
        "1.2.34": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.34.zip",
        "1.2.35": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.35.zip",
        "1.2.36": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.36.zip",
        "1.2.37": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.37.zip",
        "1.2.38": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.38.zip",
        "1.2.39": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.39.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.4.zip",
        "1.2.40": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.40.zip",
        "1.2.41": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.41.zip",
        "1.2.42": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.42.zip",
        "1.2.43": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.43.zip",
        "1.2.44": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.44.zip",
        "1.2.45": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.45.zip",
        "1.2.46": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.46.zip",
        "1.2.47": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.47.zip",
        "1.2.48": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.48.zip",
        "1.2.49": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.49.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.5.zip",
        "1.2.50": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.50.zip",
        "1.2.51": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.51.zip",
        "1.2.52": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.52.zip",
        "1.2.53": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.53.zip",
        "1.2.54": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.54.zip",
        "1.2.55": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.55.zip",
        "1.2.56": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.56.zip",
        "1.2.57": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.57.zip",
        "1.2.58": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.58.zip",
        "1.2.59": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.59.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.6.zip",
        "1.2.60": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.60.zip",
        "1.2.61": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.61.zip",
        "1.2.62": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.62.zip",
        "1.2.63": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.63.zip",
        "1.2.64": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.64.zip",
        "1.2.65": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.65.zip",
        "1.2.66": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.66.zip",
        "1.2.67": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.67.zip",
        "1.2.68": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.68.zip",
        "1.2.69": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.69.zip",
        "1.2.7": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.7.zip",
        "1.2.70": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.70.zip",
        "1.2.71": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.71.zip",
        "1.2.72": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.72.zip",
        "1.2.73": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.73.zip",
        "1.2.74": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.74.zip",
        "1.2.75": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.75.zip",
        "1.2.76": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.76.zip",
        "1.2.77": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.77.zip",
        "1.2.78": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.78.zip",
        "1.2.79": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.79.zip",
        "1.2.8": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.8.zip",
        "1.2.80": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.80.zip",
        "1.2.81": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.81.zip",
        "1.2.82": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.82.zip",
        "1.2.83": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.83.zip",
        "1.2.84": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.84.zip",
        "1.2.85": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.85.zip",
        "1.2.86": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.86.zip",
        "1.2.87": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.87.zip",
        "1.2.88": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.88.zip",
        "1.2.89": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.89.zip",
        "1.2.9": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.9.zip",
        "1.2.90": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.90.zip",
        "1.2.91": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.91.zip",
        "1.2.92": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.92.zip",
        "1.2.93": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.93.zip",
        "1.2.94": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.94.zip",
        "1.2.95": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.95.zip",
        "1.2.96": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.96.zip",
        "1.2.97": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.97.zip",
        "1.2.98": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.98.zip",
        "1.2.99": "https://downloads.wordpress.org/plugin/woo-delivery.1.2.99.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.1.zip",
        "1.3.10": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.10.zip",
        "1.3.11": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.11.zip",
        "1.3.12": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.12.zip",
        "1.3.13": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.13.zip",
        "1.3.14": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.14.zip",
        "1.3.15": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.15.zip",
        "1.3.16": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.16.zip",
        "1.3.17": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.17.zip",
        "1.3.18": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.18.zip",
        "1.3.19": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.19.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.2.zip",
        "1.3.20": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.20.zip",
        "1.3.21": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.21.zip",
        "1.3.22": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.22.zip",
        "1.3.23": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.23.zip",
        "1.3.24": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.24.zip",
        "1.3.25": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.25.zip",
        "1.3.26": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.26.zip",
        "1.3.27": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.27.zip",
        "1.3.28": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.28.zip",
        "1.3.29": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.29.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.3.zip",
        "1.3.30": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.30.zip",
        "1.3.31": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.31.zip",
        "1.3.32": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.32.zip",
        "1.3.33": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.33.zip",
        "1.3.34": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.34.zip",
        "1.3.35": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.35.zip",
        "1.3.36": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.36.zip",
        "1.3.37": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.37.zip",
        "1.3.38": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.38.zip",
        "1.3.39": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.39.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.4.zip",
        "1.3.40": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.40.zip",
        "1.3.41": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.41.zip",
        "1.3.42": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.42.zip",
        "1.3.43": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.43.zip",
        "1.3.44": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.44.zip",
        "1.3.45": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.45.zip",
        "1.3.46": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.46.zip",
        "1.3.47": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.47.zip",
        "1.3.48": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.48.zip",
        "1.3.49": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.49.zip",
        "1.3.5": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.5.zip",
        "1.3.50": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.50.zip",
        "1.3.51": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.51.zip",
        "1.3.52": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.52.zip",
        "1.3.53": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.53.zip",
        "1.3.54": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.54.zip",
        "1.3.55": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.55.zip",
        "1.3.56": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.56.zip",
        "1.3.57": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.57.zip",
        "1.3.58": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.58.zip",
        "1.3.59": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.59.zip",
        "1.3.6": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.6.zip",
        "1.3.60": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.60.zip",
        "1.3.61": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.61.zip",
        "1.3.62": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.62.zip",
        "1.3.63": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.63.zip",
        "1.3.64": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.64.zip",
        "1.3.65": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.65.zip",
        "1.3.66": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.66.zip",
        "1.3.67": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.67.zip",
        "1.3.7": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.7.zip",
        "1.3.8": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.8.zip",
        "1.3.9": "https://downloads.wordpress.org/plugin/woo-delivery.1.3.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/woo-delivery.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://coderockz.com",
    "banners": {
        "low": "https://ps.w.org/woo-delivery/assets/banner-772x250.png?rev=2421326",
        "high": "https://ps.w.org/woo-delivery/assets/banner-1544x500.png?rev=2421326"
    },
    "icons": {
        "1x": "https://ps.w.org/woo-delivery/assets/icon-128x128.png?rev=2421326",
        "2x": "https://ps.w.org/woo-delivery/assets/icon-256x256.png?rev=2421326"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "woo-delivery",
            "language": "fr_FR",
            "version": "1.3.67",
            "updated": "2022-01-31 10:09:45",
            "package": "http://downloads.wordpress.org/translation/plugin/woo-delivery/1.3.67/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "woo-delivery",
            "language": "hr",
            "version": "1.3.67",
            "updated": "2024-01-18 19:53:07",
            "package": "http://downloads.wordpress.org/translation/plugin/woo-delivery/1.3.67/hr.zip"
        },
        {
            "type": "plugin",
            "slug": "woo-delivery",
            "language": "nl_NL",
            "version": "1.3.67",
            "updated": "2022-01-23 12:09:11",
            "package": "http://downloads.wordpress.org/translation/plugin/woo-delivery/1.3.67/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "woo-delivery",
            "language": "ru_RU",
            "version": "1.3.67",
            "updated": "2023-10-21 14:37:47",
            "package": "http://downloads.wordpress.org/translation/plugin/woo-delivery/1.3.67/ru_RU.zip"
        }
    ]
}