{
    "name": "ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce",
    "slug": "woo-alidropship",
    "version": "2.1.0",
    "author": "<a href=\"http://villatheme.com\">VillaTheme(villatheme.com)</a>",
    "author_profile": "https://profiles.wordpress.org/villatheme/",
    "contributors": {
        "villatheme": {
            "profile": "https://profiles.wordpress.org/villatheme/",
            "avatar": "https://secure.gravatar.com/avatar/973d0ef458adb8a3c527f196b9529909?s=96&d=monsterid&r=g",
            "display_name": "VillaTheme"
        },
        "mrt3vn": {
            "profile": "https://profiles.wordpress.org/mrt3vn/",
            "avatar": "https://secure.gravatar.com/avatar/cb8ecbc2ffe02a20ea2f5d1da26d3a22?s=96&d=monsterid&r=g",
            "display_name": "Andy Ha"
        }
    },
    "requires": "5.0.0",
    "tested": "6.6.1",
    "requires_php": "7.0",
    "requires_plugins": [
        "woocommerce"
    ],
    "compatibility": [],
    "rating": 78,
    "ratings": {
        "5": 89,
        "4": 3,
        "3": 2,
        "2": 5,
        "1": 32
    },
    "num_ratings": 131,
    "support_url": "https://wordpress.org/support/plugin/woo-alidropship/",
    "support_threads": 11,
    "support_threads_resolved": 3,
    "active_installs": 10000,
    "downloaded": 458901,
    "last_updated": "2024-08-31 07:57:00",
    "added": "2019-12-04",
    "homepage": "https://villatheme.com/extensions/aliexpress-dropshipping-and-fulfillment-for-woocommerce/",
    "sections": {
        "description": "<p>ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce allows shop owners to import products from AliExpress to their own WooCommerce store. That helps shop owners easily possess and run their own business on the E-Commerce site with a wide range of products from AliExpress and earn more money from online business.</p>\n<p>Now this plugin is Top 1 the best free AliExpress Dropshipping plugin for WooCommerce.</p>\n<blockquote>\n<p><a href=\"https://new2new.com/?item=aliexpress-dropshipping-and-fulfillment-for-woocommerce\" title=\"Demo ALD - Dropshipping and Fulfillment for AliExpress and WooCommerce\" rel=\"nofollow ugc\">View Demo</a> | <a href=\"http://docs.villatheme.com/?item=aliexpress-dropshipping-and-fulfillment-for-woocommerce\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/PeXrM\" title=\"Premium Version\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://downloads.villatheme.com/?download=alidropship-extension\" rel=\"nofollow ugc\">Download extension</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<h3>Preview ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/dc-8CmQ3ZQs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>How to install and use the plugin</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/eCt8sJVsBXk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Install WooCommerce AliExpress Dropshipping Extension from Chrome Web Store</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/eO_C_b4ZQmo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Install WooCommerce AliExpress Dropshipping Extension manually</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/AZxnEFfEGfo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>Your site need use SSL certificates to connect with chrome extension</p>\n</li>\n<li>\n<p>Your permalink structure must NOT be &#8220;Plain&#8221;</p>\n</li>\n<li>\n<p>We make no guarantees about the raw information imported from AliExpress provided by our plugin and will not be held liable if it is not accurate, complete, or up to date, or if it does not otherwise satisfy your specific needs. All risks regarding to raw information and the material may not be excepted and will not be our responsibility.</p>\n</li>\n<li>\n<p>There may be instances when information provided through the plugin contains typographical mistakes, inaccuracies, or omissions come from AliExpress such as product descriptions, promotions, offers, pricing, shipping fee, availability, and delivery timeframes. Apart from official laws require, we make no commitment to correct, update, alter, or clarify such material.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES</h3>\n<p>&#9658; <strong>Import Products</strong>:</p>\n<p>This plugin allows you to import products from AliExpress to MULTIPLE WooCommerce stores at a time.</p>\n<p>Since version 1.0.3, you can authenticate your extension using WooCommerce REST API authentication(recommended) to reduce errors. When authenticating, you have to turn off Coming Soon, Under Construction &amp; Maintenance Mode.</p>\n<p>Connecting with extension using secret key is still available but it may be deprecated in an update in the near future.</p>\n<ul>\n<li>\n<p><strong>Import from single product page</strong></p>\n</li>\n<li>\n<p><strong>Import from category page</strong></p>\n</li>\n</ul>\n<p>&#9658; <strong>Configure rules for all imported products</strong>:</p>\n<p>You can set general rules for all imported products in the product setting.</p>\n<ul>\n<li>\n<p><strong>Global product attributes</strong>: You can choose to import attributes as global or custom attributes(newly added in 1.0.4)</p>\n</li>\n<li>\n<p><strong>Products Status</strong>: Choose a product status for all imported products from AliExpress. Product status can be: Publish, Pending or Draft.</p>\n</li>\n<li>\n<p><strong>Catalog visibility</strong>: This setting determines which shop pages products will be listed on.</p>\n</li>\n<li>\n<p><strong>Product description</strong>: Customizing product description after adding products to the import list.</p>\n</li>\n<li>\n<p><strong>Select product images</strong>: Enable it, the first image will be selected as the product image and other images (except images from the product description) are selected in the gallery when adding the product to the import list.</p>\n</li>\n<li>\n<p><strong>Images from description</strong>: Image from product description can be downloaded to your server so that you can use other plugins to edit them to suit your store</p>\n</li>\n<li>\n<p><strong>Default categories</strong>: Categories which will be selected by default for products in Import list</p>\n</li>\n<li>\n<p><strong>Default product tags</strong>: Fill in the tag titles.</p>\n</li>\n<li>\n<p><strong>Product variations are visible on the product page</strong>: Enable to make variations of imported products visible on the product page</p>\n</li>\n<li>\n<p><strong>Manage stock</strong>: Enable to manage stock and import product inventory. if you disable this option, the product stock status will be set &#8220;Instock&#8221; and product inventory will not be imported.</p>\n</li>\n<li>\n<p><strong>Hide ship from</strong>: Enable to hide attribute ship from China.</p>\n</li>\n<li>\n<p><strong>Find and Replace</strong>: Search for strings in product title and description and replace found strings with respective values.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Set up rules for the price of all products</strong>:</p>\n<ul>\n<li>\n<p><strong>The Product Price setting</strong>: Allows you to set the price rules for all imported products.</p>\n</li>\n<li>\n<p><strong>Import products currency exchange rate</strong>: Allows you to set the exchange rate to convert the imported product-currency into an expected respective currency in your store.</p>\n</li>\n<li>\n<p><strong>Show shipping option</strong>: Shipping cost can now be added to product cost. You can choose shipping country and shipping company before importing products.</p>\n</li>\n<li>\n<p><strong>Rules for pretty price</strong>: You can automatically setup product prices based on your rules so that prices will be in pretty format before importing such as 23.67=&gt;23.99, &#8230;</p>\n</li>\n</ul>\n<p>For example, the currency on AliExpress is USD. However, I want to convert it into VND on my Woo store, therefore I set the current exchange rate is 23000</p>\n<p>If this field sets the value as 1, it means that there is no change in currency (USD as default)</p>\n<ul>\n<li>\n<p><strong>Price from</strong>: In this field, you will set the price rules for multi quantity ranges. You can set a quantity range respectively with an action type.</p>\n</li>\n<li>\n<p><strong>Action</strong>: An action is set respectively with a quantity range. They can be: Increase by a fixed amount; Increase by percentage (%); Set to (a specific value)</p>\n</li>\n<li>\n<p><strong>Sale price</strong>: Set a rule for sale price. Note: Set -1 if there is no sale price</p>\n</li>\n<li>\n<p><strong>Regular price</strong>: Set a rule for regular price.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Install rules for all products after fulfilling the order payment</strong>:</p>\n<p>This Setting allows you to set the general rules for all products after fulfilling the order payment.</p>\n<ul>\n<li>\n<p><strong>Carrier company</strong>: Select a default carrier company for all products from AliExpress in your WooCommerce store.</p>\n</li>\n<li>\n<p><strong>AliExpress Order notes</strong>: This note will add after an order is fulfilled with Chrome extension.</p>\n</li>\n<li>\n<p><strong>Show action</strong>: Order status to show a fulfilled action. You can set these statuses: Pending payment, On hold, Completed, Canceled, Refunded, Failed</p>\n</li>\n</ul>\n<p>&#9658; <strong>Configure simple product attributes</strong>:</p>\n<p>The products now are in the Import list where you can config product sku, price, edit attributes, select product images, variations&#8230; before pushing to WooCommerce store</p>\n<ul>\n<li>\n<p><strong>Import all</strong>: Enable to import all products entirely on your Woo store.</p>\n</li>\n<li>\n<p><strong>Search product</strong>: Search for a product on the import list.</p>\n</li>\n<li>\n<p><strong>Product</strong>: Display the imported product attributes.</p>\n</li>\n<li>\n<p><strong>Product Attributes</strong>: You can edit product attributes name, values, remove unwanted attributes before importing</p>\n</li>\n<li>\n<p><strong>Description</strong>: Copy product description on AliExpress or you can edit it.</p>\n</li>\n<li>\n<p><strong>Variations</strong>: This setting allows you to customize and manage the variable products.</p>\n</li>\n<li>\n<p><strong>Gallery</strong>: Copy gallery on AliExpress or you can select one on your Woo store.</p>\n</li>\n<li>\n<p><strong>View product on AliExpress</strong>: Allow your to access AliExpress directly.</p>\n</li>\n<li>\n<p><strong>Import and Override</strong>: Select to import and override the product on your Woo store</p>\n</li>\n</ul>\n<p>&#9658; <strong>Manage the imported product list</strong>:</p>\n<p>You can manage briefly the product attributes in the Imported setting.</p>\n<ul>\n<li>\n<p><strong>Product Title</strong>: Name of the product in your store.</p>\n</li>\n<li>\n<p><strong>Sku</strong>: Stock keeping unit of the product in your store</p>\n</li>\n<li>\n<p><strong>Cost</strong>: Price of the product on AliExpress</p>\n</li>\n<li>\n<p><strong>WooCommerce Price</strong>: Price of the product on your store</p>\n</li>\n<li>\n<p><strong>Delete</strong>: Delete the product on the imported list</p>\n</li>\n<li>\n<p><strong>Override</strong>: Override an alternative product on the initial one.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Manage sold orders of the imported products</strong>:</p>\n<p>You can distinguish between AliExpress orders with your initial store orders and manage them in the Order Setting in WooCommerce.</p>\n<p>&#9658; <strong>Orders Tracking for WooCommerce</strong>: Compatible with Orders Tracking for WooCommerce so you can easily manage tracking data</p>\n<p>&#9658; <strong>Variations Swatches</strong>: Compatible with Product Variations Swatches for WooCommerce. This makes product variations of your store beautiful and easy for customers to select just like AliExpress</p>\n<h3>PRO VERSION</h3>\n<ul>\n<li>\n<p><strong>All features from the free version</strong>: All your settings/imported products/fulfilled orders are remained after upgrading</p>\n</li>\n<li>\n<p><strong>Import product video</strong>: You can import product video and display video on a separate tab on single product page or use shortcode to display video in product description/short description &#8230;</p>\n</li>\n<li>\n<p><strong>Migration</strong>: If you are using anther AliExpress dropshipping plugin and want to migrate those products to use with our plugin, this feature will help you do the job quickly.</p>\n</li>\n<li>\n<p><strong>Frontend shipping</strong>: Instead of importing product including specific shipping cost, you can allow customers to select shipping company correctly based on their country just like shopping on AliExpress. Shipping companies can be masked to hide the fact that you are running a dropshipping business</p>\n</li>\n<li>\n<p><strong>AliExpress orders</strong>: A separated page to manage all your AliExpress orders where you can bulk fulfill orders or fulfill orders with extension</p>\n</li>\n<li>\n<p><strong>Bulk orders</strong>: Besides the ability to fulfill AliExpress orders one by one with the chrome extension, you can bulk fulfill your orders rapidly. This will save you tons of time.</p>\n</li>\n<li>\n<p><strong>Auto fulfill</strong>: This helps automatically fulfil AliExpress orders whenever someone purchases something on your site</p>\n</li>\n<li>\n<p><strong>Price and quantity sync</strong>: Product price and quantity can now be synced with AliExpress automatically using cron. If a product is out of stock/change price or is offline, you will receive email notification. You can also check the progress in the log file.</p>\n</li>\n<li>\n<p><strong>Tracking number sync</strong>: Similar to products, tracking number sync is automated. You don&#8217;t need to login to your AliExpress account only to check if tracking number is available for some orders then wait for them to sync.</p>\n</li>\n<li>\n<p><strong>Update exchange rate automatically</strong>: Schedule the plugin to update exchange rate daily at a specific time</p>\n</li>\n<li>\n<p><strong>Split variations into respective products</strong>: A lot of AliExpress products have too many variations(more than a hundred), you can use this feature to split those products into smaller ones for easier management</p>\n</li>\n<li>\n<p><strong>Product attribute mapping</strong>: Attributes of AliExpress product are usually in strangled terms and not user friendly so you will need to modify them before importing, this feature helps you save a lot of time from doing that boring task.</p>\n</li>\n<li>\n<p><strong>Marketplace</strong>: The premium version is made compatible with Dokan plugin. Vendors can import AliExpress products and have their own Import list, Imported and settings page within the vendor dashboard.</p>\n</li>\n<li>\n<p><strong>Premium support</strong>: With each purchase, you will have 6 or 12 months of premium support from VillaTheme.</p>\n</li>\n<li>\n<p><strong>Lifetime update</strong>:</p>\n</li>\n</ul>\n<p><a href=\"https://1.envato.market/PeXrM\" rel=\"nofollow ugc\">GET PRO VERSION</a> or <a href=\"https://1.envato.market/PeXrM\" rel=\"nofollow ugc\">https://codecanyon.net/item/aliexpress-dropshipping-and-fulfillment-for-woocommerce/29457839</a></p>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designer\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: Replace plaintext WordPress emails with more beautiful and professional templates</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">COREEM – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE &#8211; WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your “Thank You” page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/?item=aliexpress-dropshipping-and-fulfillment-for-woocommerce\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com/extensions/aliexpress-dropshipping-and-fulfillment-for-woocommerce/\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/?item=aliexpress-dropshipping-and-fulfillment-for-woocommerce\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports/forum/plugins/aliexpress-dropshipping-and-fulfillment-for-woocommerce/\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
        "installation": "<ol>\n<li>Unzip the download package</li>\n<li>Upload <code>woo-alidropship</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "changelog": "<p>/<strong>2.1.0 &#8211; 2024.08.31</strong>/<br />\n&#8211; Updated: Import AliExpress product in &#8216;Find product to import&#8217; with API<br />\n&#8211; Updated: Remove the old API and use the new API to get AliExpress product information<br />\n&#8211; Updated: Only override the existing products from AliExpress based on their product IDs. The overrode must be added to the import list.<br />\n&#8211; Updated: The shipping cost will be only calculated based on when the product is added to the import list</p>\n<p>/<strong>2.0.5 &#8211; 2024.07.25</strong>/<br />\n– Updated: Filter while getting ALD data</p>\n<p>/<strong>2.0.4 &#8211; 2024.07.23</strong>/<br />\n– Updated: Compatible with WP 6.6 and  WC 9.1</p>\n<p>/<strong>2.0.3 &#8211; 2024.06.01</strong>/<br />\n– Updated: Import AliExpress product data from AliExpress&#8217;s new design<br />\n– Updated: Only use the new table after migrated data<br />\n– Updated: Update support class</p>\n<p>/<strong>2.0.2 &#8211; 2024.04.13</strong>/<br />\n– Fixed: Can not filter orders on the Woo orders tab<br />\n– Updated: Compatible with WP 6.5 and  WC 8.7<br />\n– Updated: Update support class</p>\n<p>/**2.0.1 – 2023.12.27*/<br />\n&#8211; Fixed: Import AliExpress product characteristics and description from Aliexpress.ru</p>\n<p>/**2.0.0 – 2023.09.25*/<br />\n– Updated: Move Ali product to new table<br />\n– Fixed: Description 404</p>\n<p>/**1.1.4 – 2023.09.23*/<br />\n– Fixed: Duplicate class</p>\n<p>/**1.1.3 – 2023.09.20*/<br />\n– Fixed: Missing class</p>\n<p>/**1.1.2 – 2023.09.19*/<br />\n– Fixed: Get shipping from AliExpress when import product</p>\n<p>/**1.1.1 – 2023.08.10*/<br />\n– Fixed: Missing item count at admin menu<br />\n– Added: Find Ali product to import from Import list</p>\n<p>/**1.0.30 – 2023.08.01*/<br />\n&#8211; Fixed: Parse data from Ali</p>\n<p>/**1.0.28 – 2023.07.29*/<br />\n– Updated: Import data from RU changed</p>\n<p>/**1.0.27 – 2023.07.03*/<br />\n– Updated: Compatible with WooCommerce HPOS(COT)</p>\n<p>/**1.0.26 – 2023.04.14*/<br />\n&#8211; Fixed: Get shipping infomation</p>\n<p>/**1.0.25 – 2023.02.24*/<br />\n&#8211; Updated: Import product data with Ship to Australia</p>\n<p>/**1.0.24 – 2023.01.12*/<br />\n&#8211; Fixed: &#8220;Connect the Extension&#8221; button always shows on settings page even the current store is connected<br />\n&#8211; Updated: Prevent &#8220;find and replace&#8221; feature from changing image urls in product description<br />\n&#8211; Updated: Show imported status of products on AliExpress products list when the chrome extension only connects to 1 store</p>\n<p>/**1.0.23 – 2022.12.28*/<br />\n– Fixed: get_product_variations method force to return array</p>\n<p>/**1.0.22 &#8211; 2022.12.13*/<br />\n&#8211; Updated: Ajax nonce and capability check<br />\n&#8211; Improved: Possible to search subcategories</p>\n<p>/**1.0.21 &#8211; 2022.11.26*/<br />\n&#8211; Fixed: Script of ThemeHunk MegaMenu Plus plugin causing error on ALD settings page<br />\n&#8211; Added: Options to set order meta field to get billing/shipping number and neighborhood from<br />\n&#8211; Updated: Prevent &#8220;Write posts or pages in plain-text Markdown syntax&#8221; option of Jetpack plugin from wrapping product description with pre and code tags</p>\n<p>/**1.0.20 &#8211; 2022.11.02*/<br />\n&#8211; Updated: Compatibility check with WP 6.1 and WC 7<br />\n&#8211; Fixed: Unexpected &#8216;)&#8217; error thrown in PHP5</p>\n<p>/**1.0.19 &#8211; 2022.10.15*/<br />\n&#8211; Fixed: Unable to import products from aliexpress.ru due to new changes from AliExpress</p>\n<p>/**1.0.18 &#8211; 2022.09.28*/<br />\n&#8211; Fixed: Some types of images from product description are unable to import<br />\n&#8211; Updated: Use get_option( &#8216;woocommerce_currency&#8217; ) instead of get_woocommerce_currency() to avoid conflict with WOOCS plugin<br />\n&#8211; Optimized: Make it possible to connect the chrome extension from wp admin of a WordPress site that installs ALD plugin<br />\n&#8211; Optimized: Setup wizard<br />\n&#8211; Added: Vietnamese translation</p>\n<p>/**1.0.17 &#8211; 2022.07.22*/<br />\n&#8211; Updated: VillaTheme_Support<br />\n&#8211; Updated: Data sanitization/escaping check<br />\n&#8211; Added: Ability to import in RUB as AliExpress now does not allow changing currency when Ship-to country is set to Russian Federation</p>\n<p>/**1.0.16 &#8211; 2022.05.06*/<br />\n&#8211; Fixed: Unable to import due to different designs of some products from https://pt.aliexpress.com/</p>\n<p>/**1.0.15 &#8211; 2022.04.20*/<br />\n&#8211; Fixed: Incorrect price of some products from some sellers due to recent changes from AliExpress<br />\n&#8211; Fixed: Sanitize, escape data<br />\n&#8211; Updated: Support Class</p>\n<p>/**1.0.14 &#8211; 2022.03.29*/<br />\n&#8211; Updated: Support Class</p>\n<p>/**1.0.13 &#8211; 2022.03.21*/<br />\n&#8211; Added: Button to sync AliExpress orders from WordPress dashboard(orders and Ali Order page) to make it work with new changes on AliExpress/My orders page<br />\n&#8211; Updated: Support Class</p>\n<p>/**1.0.12 &#8211; 2022.02.12*/<br />\n&#8211; Fixed: Unable to import products from aliexpress.ru</p>\n<p>/**1.0.11 &#8211; 2022.01.22*/<br />\n&#8211; Fixed: Undefined index: message_not_active</p>\n<p>/**1.0.10 &#8211; 2022.01.11*/<br />\n&#8211; Updated: VillaTheme_Support<br />\n&#8211; Added: Warning of possible wrong price due to AliExpress&#8217;s New user bonus discount when importing products</p>\n<p>/**1.0.9 &#8211; 2021.12.08*/<br />\n&#8211; Added: Option to use AliExpress cdn links for product featured image, gallery images and variation image. EXMAGE – WordPress Image Links plugin is required</p>\n<p>/**1.0.8.3 &#8211; 2021.11.19*/<br />\n&#8211; Fixed: Simple product is always out-of-stock if the &#8220;Manage stock&#8221; option in the plugin settings is turned off</p>\n<p>/**1.0.8.2 &#8211; 2021.09.11*/<br />\n&#8211; Fixed: Shipping cost imported in wrong currency for some products from some suppliers</p>\n<p>/**1.0.8.1 &#8211; 2021.09.01*/<br />\n&#8211; Fixed: Original AliExpress variation can not be saved correctly for some products</p>\n<p>/**1.0.8 &#8211; 2021.08.20*/<br />\n&#8211; Fixed: Fulfill states for some countries<br />\n&#8211; Optimized: Categories are now displayed as tree<br />\n&#8211; Updated: Change plugin name from &#8220;Dropshipping and Fulfillment for AliExpress and WooCommerce&#8221; to &#8220;ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce&#8221;<br />\n&#8211; Added: Ability to keep Woo product when overriding products<br />\n&#8211; Added: Ability to manually select mapping variations of imported products<br />\n&#8211; Added: Ability to choose a WooCommerce product to map to when importing to make it possible to migrate products imported by other plugins/apps<br />\n&#8211; Added: Support RUT number for fulfilling orders of Chilean customers</p>\n<p>/**1.0.7.1 &#8211; 2021.08.02*/<br />\n&#8211; Optimized: Only send data of selected variations when importing product to reduce error with max_input_vars when a product has too many variations</p>\n<p>/**1.0.7 &#8211; 2021.07.28*/<br />\n&#8211; Added: Option to set shipping class<br />\n&#8211; Added: Compatibility with WP 5.8 and WC 5.5<br />\n&#8211; Optimized: Background processing notices</p>\n<p>/**1.0.6 &#8211; 2021.06.12*/<br />\n&#8211; Added: Option to use a custom order meta field as CPF for customers from Brazil<br />\n&#8211; Added: Option to override customer phone with default phone number<br />\n&#8211; Optimized: Setup wizard</p>\n<p>/**1.0.5 &#8211; 2021.03.06*/<br />\n&#8211; Fixed: Fulfilling issue with some states<br />\n&#8211; Changed: Price rules UI<br />\n&#8211; Added: Bulk edit products in Import list: tags, categories, status, visibility<br />\n&#8211; Added: Compatibility with WP 5.7 and WC 5.0</p>\n<p>/**1.0.4.5 &#8211; 2021.01.27*/<br />\n&#8211; Fixed: Can not fulfil orders when state/county is empty<br />\n&#8211; Fixed: Attribute value is now case-sensitive when editing in Import list<br />\n&#8211; Changed: Bulk Set price button only works for selected variations in Import list<br />\n&#8211; Changed: Do not use background process to import product description anymore</p>\n<p>/**1.0.4.4 &#8211; 2020.12.17*/<br />\n&#8211; Fixed: Can not import correct attributes when attribute name is in Non-Latin languages<br />\n&#8211; Added: Ability to remove a product attribute<br />\n&#8211; Added: Button to empty Import list<br />\n&#8211; Added: Compatibility with WP 5.6 and WC 4.8</p>\n<p>/**1.0.4.3 &#8211; 2020.11.28*/<br />\n&#8211; Fixed: Product description not importing</p>\n<p>/**1.0.4.2 &#8211; 2020.11.25*/<br />\n&#8211; Fixed: Wrong price source if users import a product while viewing it in other currencies but USD<br />\n&#8211; Added: Change variation images<br />\n&#8211; Added: Link to pro</p>\n<p>/**1.0.4.1 &#8211; 2020.11.14*/<br />\n&#8211; Added: Automatically revoke API after removing a domain from list</p>\n<p>/**1.0.4 &#8211; 2020.09.24*/<br />\n&#8211; Added: Option to import product attributes as global attributes<br />\n&#8211; Added: Ability to edit product attribute in Import list<br />\n&#8211; Added: Notice when product images are still being processed<br />\n&#8211; Changed: Load all categories to select instead of Ajax search in Import list</p>\n<p>/**1.0.3.3 &#8211; 2020.09.23*/<br />\n&#8211; Added: Option &#8220;Add shipping cost after price rules&#8221;<br />\n&#8211; Added: Warning message when overriding a product</p>\n<p>/**1.0.3.2 &#8211; 2020.09.05*/<br />\n&#8211; Fixed: False alert when saving settings<br />\n&#8211; Fixed: Wrong product cost in import list when using shipping<br />\n&#8211; Optimized: Product list pagination</p>\n<p>/**1.0.3.1 &#8211; 2020.08.19*/<br />\n&#8211; Fixed: Can not change Number of items per page on Imported products page<br />\n&#8211; Fixed: Wrong link of Get tracking button on Edit order page</p>\n<p>/**1.0.3 &#8211; 2020.08.08*/<br />\n&#8211; Fixed: Price rules<br />\n&#8211; Added: Compatibility with WP 5.5 and WC 4.3<br />\n&#8211; Added: Authenticate extension using WooCommerce REST API authentication<br />\n&#8211; Added: Option to download images in product description<br />\n&#8211; Added: Rule to change price format<br />\n&#8211; Added: Option to add shipping cost before importing<br />\n&#8211; Added: Load variations tab dynamically if Show shipping option is enabled or if a product has 10 variations and more</p>\n<p>/**1.0.2.1 &#8211; 2020.07.07*/<br />\n&#8211; Fixed: Convert price to float incorrectly because price uses comma as thousand separator<br />\n&#8211; Optimized: Save image url to avoid downloading duplicated images<br />\n&#8211; Added: Filter failed images by product</p>\n<p>/**1.0.2 &#8211; 2020.07.01*/<br />\n&#8211; Fixed: Some simple products can not be added to cart when fulfilling AliExpress orders<br />\n&#8211; Added: Option to import product with 1 variations as simple product<br />\n&#8211; Added: Option to Disable background process<br />\n&#8211; Updated: UX<br />\n&#8211; Updated: Import product directly instead of using background processing</p>\n<p>/**1.0.1.2 &#8211; 2020.05.09*/<br />\n&#8211; Fixed: Option Import ship from<br />\n&#8211; Updated: Compatible with WC4.1</p>\n<p>/**1.0.1.1 &#8211; 2020.04.23*/<br />\n&#8211; Fixed: Conflict using accordion with other plugins<br />\n&#8211; Updated: Class support</p>\n<p>/**1.0.1 &#8211; 2020.04.10*/<br />\n&#8211; Fixed: Can not save plugin settings<br />\n&#8211; Fixed: Some attributes imported incorrectly</p>\n<p>/**1.0.0.5 &#8211; 2020.03.23*/<br />\n&#8211; Updated: Compatible with WP 5.4 and WC4.0<br />\n&#8211; Updated: Class support</p>\n<p>/**1.0.0.4 &#8211; 2020.02.25*/<br />\n&#8211; Added: Ability to Import/Export plugin settings between sites</p>\n<p>/**1.0.0.3 &#8211; 2020.02.20*/<br />\n&#8211; Fixed: Default variation not set when not importing the whole variations of a product<br />\n&#8211; Updated: Change plugin menu title<br />\n&#8211; Added: Error product images count</p>\n<p>/**1.0.0.2 &#8211; 2020.01.20*/<br />\n&#8211; Fixed: Fatal error when activating plugin if WooCommerce is not active<br />\n&#8211; Fixed: Warning message on import list page when regular price or sale price of price rules is empty<br />\n&#8211; Updated: Move product html request to extension<br />\n&#8211; Updated: Change Carrier company follow on AliExpress and set default cainiao URL in tracking URL<br />\n&#8211; Updated: Update correct attribute name<br />\n&#8211; Added: Cancel overriding product</p>\n<p>/**1.0.0.1 &#8211; 2019.12.30*/<br />\n&#8211; Update: Extension link on Google Chrome Store</p>\n<p>/<strong>1.0.0 &#8211; 2019.12.03</strong>/<br />\n~ The first released</p>\n"
    },
    "short_description": "Transfer data from AliExpress products to WooCommerce effortlessly and fulfill WooCommerce orders to AliExpress automatically.",
    "description": "<p>ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce allows shop owners to import products from AliExpress to their own WooCommerce store. That helps shop owners easily possess and run their own business on the E-Commerce site with a wide range of products from AliExpress and earn more money from online business.</p>\n<p>Now this plugin is Top 1 the best free AliExpress Dropshipping plugin for WooCommerce.</p>\n<blockquote>\n<p><a href=\"https://new2new.com/?item=aliexpress-dropshipping-and-fulfillment-for-woocommerce\" title=\"Demo ALD - Dropshipping and Fulfillment for AliExpress and WooCommerce\" rel=\"nofollow ugc\">View Demo</a> | <a href=\"http://docs.villatheme.com/?item=aliexpress-dropshipping-and-fulfillment-for-woocommerce\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/PeXrM\" title=\"Premium Version\" rel=\"nofollow ugc\">Pro Version</a> | <a href=\"https://downloads.villatheme.com/?download=alidropship-extension\" rel=\"nofollow ugc\">Download extension</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<h3>Preview ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/dc-8CmQ3ZQs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>How to install and use the plugin</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/eCt8sJVsBXk?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Install WooCommerce AliExpress Dropshipping Extension from Chrome Web Store</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/eO_C_b4ZQmo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Install WooCommerce AliExpress Dropshipping Extension manually</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/AZxnEFfEGfo?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>Your site need use SSL certificates to connect with chrome extension</p>\n</li>\n<li>\n<p>Your permalink structure must NOT be &#8220;Plain&#8221;</p>\n</li>\n<li>\n<p>We make no guarantees about the raw information imported from AliExpress provided by our plugin and will not be held liable if it is not accurate, complete, or up to date, or if it does not otherwise satisfy your specific needs. All risks regarding to raw information and the material may not be excepted and will not be our responsibility.</p>\n</li>\n<li>\n<p>There may be instances when information provided through the plugin contains typographical mistakes, inaccuracies, or omissions come from AliExpress such as product descriptions, promotions, offers, pricing, shipping fee, availability, and delivery timeframes. Apart from official laws require, we make no commitment to correct, update, alter, or clarify such material.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES</h3>\n<p>&#9658; <strong>Import Products</strong>:</p>\n<p>This plugin allows you to import products from AliExpress to MULTIPLE WooCommerce stores at a time.</p>\n<p>Since version 1.0.3, you can authenticate your extension using WooCommerce REST API authentication(recommended) to reduce errors. When authenticating, you have to turn off Coming Soon, Under Construction &amp; Maintenance Mode.</p>\n<p>Connecting with extension using secret key is still available but it may be deprecated in an update in the near future.</p>\n<ul>\n<li>\n<p><strong>Import from single product page</strong></p>\n</li>\n<li>\n<p><strong>Import from category page</strong></p>\n</li>\n</ul>\n<p>&#9658; <strong>Configure rules for all imported products</strong>:</p>\n<p>You can set general rules for all imported products in the product setting.</p>\n<ul>\n<li>\n<p><strong>Global product attributes</strong>: You can choose to import attributes as global or custom attributes(newly added in 1.0.4)</p>\n</li>\n<li>\n<p><strong>Products Status</strong>: Choose a product status for all imported products from AliExpress. Product status can be: Publish, Pending or Draft.</p>\n</li>\n<li>\n<p><strong>Catalog visibility</strong>: This setting determines which shop pages products will be listed on.</p>\n</li>\n<li>\n<p><strong>Product description</strong>: Customizing product description after adding products to the import list.</p>\n</li>\n<li>\n<p><strong>Select product images</strong>: Enable it, the first image will be selected as the product image and other images (except images from the product description) are selected in the gallery when adding the product to the import list.</p>\n</li>\n<li>\n<p><strong>Images from description</strong>: Image from product description can be downloaded to your server so that you can use other plugins to edit them to suit your store</p>\n</li>\n<li>\n<p><strong>Default categories</strong>: Categories which will be selected by default for products in Import list</p>\n</li>\n<li>\n<p><strong>Default product tags</strong>: Fill in the tag titles.</p>\n</li>\n<li>\n<p><strong>Product variations are visible on the product page</strong>: Enable to make variations of imported products visible on the product page</p>\n</li>\n<li>\n<p><strong>Manage stock</strong>: Enable to manage stock and import product inventory. if you disable this option, the product stock status will be set &#8220;Instock&#8221; and product inventory will not be imported.</p>\n</li>\n<li>\n<p><strong>Hide ship from</strong>: Enable to hide attribute ship from China.</p>\n</li>\n<li>\n<p><strong>Find and Replace</strong>: Search for strings in product title and description and replace found strings with respective values.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Set up rules for the price of all products</strong>:</p>\n<ul>\n<li>\n<p><strong>The Product Price setting</strong>: Allows you to set the price rules for all imported products.</p>\n</li>\n<li>\n<p><strong>Import products currency exchange rate</strong>: Allows you to set the exchange rate to convert the imported product-currency into an expected respective currency in your store.</p>\n</li>\n<li>\n<p><strong>Show shipping option</strong>: Shipping cost can now be added to product cost. You can choose shipping country and shipping company before importing products.</p>\n</li>\n<li>\n<p><strong>Rules for pretty price</strong>: You can automatically setup product prices based on your rules so that prices will be in pretty format before importing such as 23.67=&gt;23.99, &#8230;</p>\n</li>\n</ul>\n<p>For example, the currency on AliExpress is USD. However, I want to convert it into VND on my Woo store, therefore I set the current exchange rate is 23000</p>\n<p>If this field sets the value as 1, it means that there is no change in currency (USD as default)</p>\n<ul>\n<li>\n<p><strong>Price from</strong>: In this field, you will set the price rules for multi quantity ranges. You can set a quantity range respectively with an action type.</p>\n</li>\n<li>\n<p><strong>Action</strong>: An action is set respectively with a quantity range. They can be: Increase by a fixed amount; Increase by percentage (%); Set to (a specific value)</p>\n</li>\n<li>\n<p><strong>Sale price</strong>: Set a rule for sale price. Note: Set -1 if there is no sale price</p>\n</li>\n<li>\n<p><strong>Regular price</strong>: Set a rule for regular price.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Install rules for all products after fulfilling the order payment</strong>:</p>\n<p>This Setting allows you to set the general rules for all products after fulfilling the order payment.</p>\n<ul>\n<li>\n<p><strong>Carrier company</strong>: Select a default carrier company for all products from AliExpress in your WooCommerce store.</p>\n</li>\n<li>\n<p><strong>AliExpress Order notes</strong>: This note will add after an order is fulfilled with Chrome extension.</p>\n</li>\n<li>\n<p><strong>Show action</strong>: Order status to show a fulfilled action. You can set these statuses: Pending payment, On hold, Completed, Canceled, Refunded, Failed</p>\n</li>\n</ul>\n<p>&#9658; <strong>Configure simple product attributes</strong>:</p>\n<p>The products now are in the Import list where you can config product sku, price, edit attributes, select product images, variations&#8230; before pushing to WooCommerce store</p>\n<ul>\n<li>\n<p><strong>Import all</strong>: Enable to import all products entirely on your Woo store.</p>\n</li>\n<li>\n<p><strong>Search product</strong>: Search for a product on the import list.</p>\n</li>\n<li>\n<p><strong>Product</strong>: Display the imported product attributes.</p>\n</li>\n<li>\n<p><strong>Product Attributes</strong>: You can edit product attributes name, values, remove unwanted attributes before importing</p>\n</li>\n<li>\n<p><strong>Description</strong>: Copy product description on AliExpress or you can edit it.</p>\n</li>\n<li>\n<p><strong>Variations</strong>: This setting allows you to customize and manage the variable products.</p>\n</li>\n<li>\n<p><strong>Gallery</strong>: Copy gallery on AliExpress or you can select one on your Woo store.</p>\n</li>\n<li>\n<p><strong>View product on AliExpress</strong>: Allow your to access AliExpress directly.</p>\n</li>\n<li>\n<p><strong>Import and Override</strong>: Select to import and override the product on your Woo store</p>\n</li>\n</ul>\n<p>&#9658; <strong>Manage the imported product list</strong>:</p>\n<p>You can manage briefly the product attributes in the Imported setting.</p>\n<ul>\n<li>\n<p><strong>Product Title</strong>: Name of the product in your store.</p>\n</li>\n<li>\n<p><strong>Sku</strong>: Stock keeping unit of the product in your store</p>\n</li>\n<li>\n<p><strong>Cost</strong>: Price of the product on AliExpress</p>\n</li>\n<li>\n<p><strong>WooCommerce Price</strong>: Price of the product on your store</p>\n</li>\n<li>\n<p><strong>Delete</strong>: Delete the product on the imported list</p>\n</li>\n<li>\n<p><strong>Override</strong>: Override an alternative product on the initial one.</p>\n</li>\n</ul>\n<p>&#9658; <strong>Manage sold orders of the imported products</strong>:</p>\n<p>You can distinguish between AliExpress orders with your initial store orders and manage them in the Order Setting in WooCommerce.</p>\n<p>&#9658; <strong>Orders Tracking for WooCommerce</strong>: Compatible with Orders Tracking for WooCommerce so you can easily manage tracking data</p>\n<p>&#9658; <strong>Variations Swatches</strong>: Compatible with Product Variations Swatches for WooCommerce. This makes product variations of your store beautiful and easy for customers to select just like AliExpress</p>\n<h3>PRO VERSION</h3>\n<ul>\n<li>\n<p><strong>All features from the free version</strong>: All your settings/imported products/fulfilled orders are remained after upgrading</p>\n</li>\n<li>\n<p><strong>Import product video</strong>: You can import product video and display video on a separate tab on single product page or use shortcode to display video in product description/short description &#8230;</p>\n</li>\n<li>\n<p><strong>Migration</strong>: If you are using anther AliExpress dropshipping plugin and want to migrate those products to use with our plugin, this feature will help you do the job quickly.</p>\n</li>\n<li>\n<p><strong>Frontend shipping</strong>: Instead of importing product including specific shipping cost, you can allow customers to select shipping company correctly based on their country just like shopping on AliExpress. Shipping companies can be masked to hide the fact that you are running a dropshipping business</p>\n</li>\n<li>\n<p><strong>AliExpress orders</strong>: A separated page to manage all your AliExpress orders where you can bulk fulfill orders or fulfill orders with extension</p>\n</li>\n<li>\n<p><strong>Bulk orders</strong>: Besides the ability to fulfill AliExpress orders one by one with the chrome extension, you can bulk fulfill your orders rapidly. This will save you tons of time.</p>\n</li>\n<li>\n<p><strong>Auto fulfill</strong>: This helps automatically fulfil AliExpress orders whenever someone purchases something on your site</p>\n</li>\n<li>\n<p><strong>Price and quantity sync</strong>: Product price and quantity can now be synced with AliExpress automatically using cron. If a product is out of stock/change price or is offline, you will receive email notification. You can also check the progress in the log file.</p>\n</li>\n<li>\n<p><strong>Tracking number sync</strong>: Similar to products, tracking number sync is automated. You don&#8217;t need to login to your AliExpress account only to check if tracking number is available for some orders then wait for them to sync.</p>\n</li>\n<li>\n<p><strong>Update exchange rate automatically</strong>: Schedule the plugin to update exchange rate daily at a specific time</p>\n</li>\n<li>\n<p><strong>Split variations into respective products</strong>: A lot of AliExpress products have too many variations(more than a hundred), you can use this feature to split those products into smaller ones for easier management</p>\n</li>\n<li>\n<p><strong>Product attribute mapping</strong>: Attributes of AliExpress product are usually in strangled terms and not user friendly so you will need to modify them before importing, this feature helps you save a lot of time from doing that boring task.</p>\n</li>\n<li>\n<p><strong>Marketplace</strong>: The premium version is made compatible with Dokan plugin. Vendors can import AliExpress products and have their own Import list, Imported and settings page within the vendor dashboard.</p>\n</li>\n<li>\n<p><strong>Premium support</strong>: With each purchase, you will have 6 or 12 months of premium support from VillaTheme.</p>\n</li>\n<li>\n<p><strong>Lifetime update</strong>:</p>\n</li>\n</ul>\n<p><a href=\"https://1.envato.market/PeXrM\" rel=\"nofollow ugc\">GET PRO VERSION</a> or <a href=\"https://1.envato.market/PeXrM\" rel=\"nofollow ugc\">https://codecanyon.net/item/aliexpress-dropshipping-and-fulfillment-for-woocommerce/29457839</a></p>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designer\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: Replace plaintext WordPress emails with more beautiful and professional templates</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">COREEM – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE &#8211; WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a>: Offer product suggestions and smart order bumps on checkout page</p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a>: All cart features you need in one simple plugin</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your “Thank You” page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/?item=aliexpress-dropshipping-and-fulfillment-for-woocommerce\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com/extensions/aliexpress-dropshipping-and-fulfillment-for-woocommerce/\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/?item=aliexpress-dropshipping-and-fulfillment-for-woocommerce\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports/forum/plugins/aliexpress-dropshipping-and-fulfillment-for-woocommerce/\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/woo-alidropship.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/woo-alidropship/assets/screenshot-1.png?rev=2207502",
            "caption": "Import products on a AliExpress category page using Chrome extension"
        },
        {
            "src": "https://ps.w.org/woo-alidropship/assets/screenshot-2.png?rev=2207502",
            "caption": "Import products on a AliExpress single product page using Chrome extension"
        },
        {
            "src": "https://ps.w.org/woo-alidropship/assets/screenshot-3.png?rev=2207502",
            "caption": "Product default settings when adding products to import list"
        },
        {
            "src": "https://ps.w.org/woo-alidropship/assets/screenshot-4.png?rev=2207502",
            "caption": "Product Price rules"
        },
        {
            "src": "https://ps.w.org/woo-alidropship/assets/screenshot-5.png?rev=2207502",
            "caption": "AliExpress orders fulfilment settings"
        },
        {
            "src": "https://ps.w.org/woo-alidropship/assets/screenshot-6.png?rev=2207502",
            "caption": "Import list overview"
        },
        {
            "src": "https://ps.w.org/woo-alidropship/assets/screenshot-7.png?rev=2207502",
            "caption": "Modify product variations before importing to WooCommerce products"
        },
        {
            "src": "https://ps.w.org/woo-alidropship/assets/screenshot-8.png?rev=2207502",
            "caption": "Imported products list"
        },
        {
            "src": "https://ps.w.org/woo-alidropship/assets/screenshot-9.png?rev=2425557",
            "caption": "Comparison table for the free and the premium version"
        }
    ],
    "tags": {
        "alidropship": "alidropship",
        "alidropship-woo": "alidropship woo",
        "aliexpress-dropshipping": "aliexpress dropshipping",
        "aliexpress-dropshipping-plugin": "aliexpress dropshipping plugin",
        "dropship": "dropship"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://www.villatheme.com/donate",
    "banners": {
        "low": "https://ps.w.org/woo-alidropship/assets/banner-772x250.jpg?rev=3080898",
        "high": "https://ps.w.org/woo-alidropship/assets/banner-1544x500.jpg?rev=3080898"
    },
    "icons": {
        "1x": "https://ps.w.org/woo-alidropship/assets/icon-128x128.gif?rev=3080898"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 78,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/woo-alidropship/blueprint.json?rev=3144584"
        }
    ],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "woo-alidropship",
            "language": "vi",
            "version": "2.0.5",
            "updated": "2022-11-30 04:31:33",
            "package": "https://downloads.wordpress.org/translation/plugin/woo-alidropship/2.0.5/vi.zip"
        }
    ]
}