{
    "name": "Photo Reviews for WooCommerce",
    "slug": "woo-photo-reviews",
    "version": "1.2.12",
    "author": "<a href=\"http://villatheme.com\">VillaTheme</a>",
    "author_profile": "https://profiles.wordpress.org/villatheme/",
    "contributors": {
        "villatheme": {
            "profile": "https://profiles.wordpress.org/villatheme/",
            "avatar": "https://secure.gravatar.com/avatar/973d0ef458adb8a3c527f196b9529909?s=96&d=monsterid&r=g",
            "display_name": "VillaTheme"
        },
        "mrt3vn": {
            "profile": "https://profiles.wordpress.org/mrt3vn/",
            "avatar": "https://secure.gravatar.com/avatar/cb8ecbc2ffe02a20ea2f5d1da26d3a22?s=96&d=monsterid&r=g",
            "display_name": "Andy Ha"
        }
    },
    "requires": "5.0",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [
        "woocommerce"
    ],
    "compatibility": [],
    "rating": 94,
    "ratings": {
        "5": 64,
        "4": 4,
        "3": 3,
        "2": 0,
        "1": 4
    },
    "num_ratings": 75,
    "support_url": "https://wordpress.org/support/plugin/woo-photo-reviews/",
    "support_threads": 6,
    "support_threads_resolved": 3,
    "active_installs": 20000,
    "downloaded": 374525,
    "last_updated": "2024-07-02 10:20:00",
    "added": "2017-11-23",
    "homepage": "https://villatheme.com/extensions/woocommerce-photo-reviews/",
    "sections": {
        "description": "<p>Photo Reviews for WooCommerce is an ultimate review plugin for WooCommerce which helps you send review reminder emails, allows customers to post reviews include product pictures and send thank you emails with WooCommerce coupons to customers.</p>\n<ul>\n<li>\n<p>Send review reminder emails asking customers to review their purchased products.</p>\n</li>\n<li>\n<p>Allows customers posting reviews include product pictures.</p>\n</li>\n<li>\n<p>Send thank you email with a coupon code when a customer review is published.</p>\n</li>\n</ul>\n<blockquote>\n<p><a href=\"http://new2new.com/?item=woocommerce-photo-reviews\" title=\"Demo Photo Reviews for WooCommerce\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"http://docs.villatheme.com/?item=woocommerce-photo-reviews\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a>| <a href=\"https://1.envato.market/L3WrM\" title=\"Premium Version\" rel=\"nofollow ugc\">Premium Version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8LYHI4rAiLs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>IMPORTANT NOTICE</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES</h3>\n<p>&#9658; <strong>PHOTO REVIEWS</strong>:The plugin WooCommerce Photo Reviews allows your customers to post pictures along with their product review. This feature will help you to create a social proof of your product and increase conversion rate.</p>\n<ul>\n<li>\n<p><strong>Photo review</strong>: The plugin allows customers to attach pictures to reviews and display that pictures along with the review on the front-end.</p>\n</li>\n<li>\n<p><strong>Maximum picture size</strong>: Set a maximum picture size that customers can attach to their reviews.</p>\n</li>\n<li>\n<p><strong>Photos required</strong>: Reviews must include a picture to be uploaded.</p>\n</li>\n<li>\n<p><strong>Display by time</strong>: Select to display the newest or oldest review first on front-end.</p>\n</li>\n<li>\n<p><strong>Overall rating &amp; Rating count</strong>: Show the average rating, total number of reviews and the number of each rating in an intuitive and friendly way</p>\n</li>\n<li>\n<p><strong>Review Filter</strong>: Filter reviews by rating, contain pictures or verified buyers</p>\n</li>\n<li>\n<p><strong>GDPR compliance</strong>: The plugin will display a message and a checkbox at the review form that allows customers to agree to share the review on your page.</p>\n</li>\n<li>\n<p><strong>Edit reviews</strong>: Admin can edit review text, change review images&#8230;</p>\n</li>\n</ul>\n<p>&#9658; <strong>REVIEW REMINDER</strong>:After a scheduled time from when an order is marked as complete. The plugin will send a review reminder email to the customer, asking to review the product. To encourage the customer to take pictures of the product and leave a review, the plugin will offer them a discount coupon. The plugin only sends a review reminder if a customer has never reviewed the item before.</p>\n<ul>\n<li>\n<p><strong>Review reminder email</strong>: Send emails to customers who purchased products, offering them coupons to encourage them posting review</p>\n</li>\n<li>\n<p><strong>Configure review reminder email</strong>: Configure the review reminder email sending to customers using shortcode {customer_name}</p>\n</li>\n</ul>\n<p>&#9658; <strong>COUPON FOR REVIEW</strong>:The plugin will generate coupons and send to review authors. This prize will encourage customers to post reviews and it also increases your profit when they use the coupon.</p>\n<ul>\n<li>\n<p><strong>Send coupon email</strong>: the plugin will send an email coupon whenever a review which qualifies the requirement is published.</p>\n</li>\n<li>\n<p><strong>Use existing coupons</strong>: you select to send existing WooCommerce coupons as a prize.</p>\n</li>\n<li>\n<p><strong>Auto-generate coupons</strong>: set up the plugin to generate unique coupons and send it along with the coupon emails. You can set up the plugin to generate coupons with all WooCommerce Coupon settings.</p>\n</li>\n<li>\n<p><strong>Photos required</strong>: you can select to send coupons to authors of reviews include photos only.</p>\n</li>\n<li>\n<p><strong>Minimum rating required</strong>: set a minimum rating review can get a coupon.</p>\n</li>\n<li>\n<p><strong>Verified owners required</strong>: the only reviews from the verified owner can get a coupon.</p>\n</li>\n<li>\n<p><strong>Configure coupon email</strong>: configure the coupon email sending to customers using shortcode {customer_name} {coupon_code}  {date_expires}</p>\n</li>\n</ul>\n<p>&#9658; <strong>FRONT-END DESIGNS</strong>:The plugin provides such many design option for you to change the review module to fit with your website interface.</p>\n<ul>\n<li>\n<p><strong>Front-end style</strong>: there are 2 front-end styles for you to select. The Grid style and the default style.</p>\n</li>\n<li>\n<p><strong>Background-color</strong>: helps you to change the background color of the review section.</p>\n</li>\n<li>\n<p><strong>Text color</strong>: you can change the review text.</p>\n</li>\n<li>\n<p><strong>Review date</strong>: you can choose to display the review date on front-end.</p>\n</li>\n<li>\n<p><strong>Review Rating Count</strong>: display overall rating on the front-end.</p>\n</li>\n<li>\n<p><strong>Full-size images</strong>: allows customers to display review image full size.</p>\n</li>\n<li>\n<p><strong>Custom CSS</strong>: you can add your CSS code to change the front-end design as you want.</p>\n</li>\n</ul>\n<h3>PREMIUM VERSION</h3>\n<p>&#9658; <strong>AJAX PAGINATION AND FILTER</strong>: Do not reload page when users want to view other review page or select a filter. When this function is on, you can also select default filters which are selected when your customers visit product or reviews page</p>\n<p>&#9658; <strong>REVIEW TITLE</strong>: Users now can add title for their reviews like when you review a plugin on WordPress.org</p>\n<p>&#9658; <strong>REVIEW IMAGE FOLDER</strong>: Now you can put images from reviews uploaded by your users to a folder and reviews imported from AliExpress to a different folder for later modification</p>\n<p>&#9658; <strong>POPUP TYPE</strong>: You can make only review images clickable or disable popup for masonry style. With normal style, lightbox effect can be applied to review images</p>\n<p>&#9658; <strong>IMPORT ALIEXPRESS REVIEWS</strong>:The plugin allows you to import reviews from AliExpress by using AliExpress product IDs. Import using product ID: Using an AliExpress product ID to import reviews from that products to a selected WooCommerce product.</p>\n<ul>\n<li>\n<p><strong>Phrases filter</strong>: This helps you automatically replace unwanted letters/words/phrases within review author name and review content before reviews are imported to your store</p>\n</li>\n<li>\n<p><strong>Selected Ratings</strong>: Choose which review ratings will be imported</p>\n</li>\n<li>\n<p><strong>Included pictures</strong>: Select to import only reviews that include pictures</p>\n</li>\n<li>\n<p><strong>Translate to English</strong>: AliExpress has a feature to translate reviews into English. This option of WooCommerce Photo Review allows you to select to import translated reviews of import original reviews.</p>\n</li>\n<li>\n<p><strong>Mark imported review as Verified owner</strong>: The imported reviews will be marked with a &#8220;Verified owner&#8221; badge, that means the reviews come from people who purchased.</p>\n</li>\n<li>\n<p><strong>Download picture</strong>: If you select the download picture option, review pictures will be download to your website database. If not, the plugin will use the AliExpress pictures (with URLs to AliExpress.com) to display review pictures.</p>\n</li>\n<li>\n<p><strong>Country</strong>: Select to import reviews from specific countries</p>\n</li>\n<li>\n<p><strong>Number of reviews</strong>: Select how many reviews will be imported. A product on AliExpress.com can have thousands of reviews and you may not want to import all of those reviews. So this option will help you to set a limit on reviews will be imported.</p>\n</li>\n</ul>\n<p>&#9658; <strong>IMPORT/EXPORT REVIEWS</strong>:The plugin allows you to import/export reviews using CSV files</p>\n<ul>\n<li>\n<p><strong>Export review</strong>: the plugin allows you to export existing reviews to a CSV file. The exported file includes author, author email, comment date, comment content, rating, review image links, user ID&#8230;</p>\n</li>\n<li>\n<p><strong>Date</strong>: you can select a time range to export reviews.</p>\n</li>\n<li>\n<p><strong>Products</strong>: Select the products which you want to export reviews.</p>\n</li>\n<li>\n<p><strong>Categories</strong>: select the categories which you want to export reviews from.</p>\n</li>\n<li>\n<p><strong>Rating</strong>: select the review rating you want to export. For example, you want to export only 4-stars and 5-stars reviews.</p>\n</li>\n<li>\n<p><strong>Comment status</strong>: select comment status of review you want to export. For example, you want to export only approved reviews.</p>\n</li>\n<li>\n<p><strong>Import review</strong>: you can import review using CSV files as well. The import review CSV has the same structure as the export CSV file.</p>\n</li>\n</ul>\n<p>&#9658; <strong>OPTIONAL FIELDS</strong>:With this option, you can create multiple optional fields and set values for those fields. Then customers can select these value when they leave a review. The optional fields option help to provide more information about the product.</p>\n<ul>\n<li>\n<p><strong>Create optional fields</strong>: you can create multiple fields and set the values of each field. For example, you can create a color field, and set values are Blue, Black, Red, etc.</p>\n</li>\n<li>\n<p><strong>Select field value</strong>: when a customer leaves a review, they can select a value of the field which you created. For example, a customer reviews a shirt and he can select the size is &#8220;XL&#8221;.</p>\n</li>\n<li>\n<p><strong>Create fields from variations</strong>: the plugin will automatically create fields and values from your product variations.</p>\n</li>\n</ul>\n<p>&#9658; <strong>SHORTCODES</strong>:The plugin provides 3 shortcodes. A shortcode to allows you to displays product reviews at anywhere you want. And the other shortcode which displays a review form, allows customers to leave a review about their purchased products.</p>\n<ul>\n<li>\n<p><strong>Product rating shortcode is used to display rating of a product</strong>:</p>\n<p>[wc_photo_reviews_rating_html]</p>\n</li>\n<li>\n<p><strong>The shortcode to display reviews</strong>:</p>\n</li>\n</ul>\n<p>[wc_photo_reviews_shortcode comments_per_page=&#8221;10&#8243; cols=&#8221;4&#8243; cols_gap=&#8221;&#8221; products=&#8221;&#8221; grid_bg_color=&#8221;&#8221; grid_item_bg_color=&#8221;&#8221; text_color=&#8221;&#8221; star_color=&#8221;&#8221; product_cat=&#8221;&#8221; order=&#8221;&#8221; orderby=&#8221;comment_date_gmt&#8221; show_product=&#8221;on&#8221; filter=&#8221;on&#8221; pagination=&#8221;on&#8221; pagination_position=&#8221;&#8221; conditional_tag=&#8221;&#8221; custom_css=&#8221;&#8221; ratings=&#8221;&#8221; mobile=&#8221;&#8221; style=&#8221;masonry&#8221; overall_rating=&#8221;off&#8221; rating_count=&#8221;off&#8221; only_images=&#8221;off&#8221;]</p>\n<p>&#8211;<strong>comments_per_page</strong>: number of comments per page. comments_per_page=&#8221;10&#8243;</p>\n<p>&#8211;<strong>cols</strong>: number of grid columns. Example:  cols=&#8221;5&#8243;</p>\n<p>&#8211;<strong>cols_gap</strong>: gap between grid columns(px). Example:cols_gap=&#8221;30&#8243;</p>\n<p>&#8211;<strong>products</strong>: display reviews of which products, enter product IDs. Example:  products=&#8221;99,100&#8243;</p>\n<p>&#8211;<strong>grid_bg_color</strong>: grid background color. Example:  grid_bg_color=&#8221;#000000&#8243;</p>\n<p>&#8211;<strong>grid_item_bg_color</strong>: grid item background color. Example: grid_item_bg_color=&#8221;#3c3c3c&#8221;</p>\n<p>&#8211;<strong>text_color</strong>: reviews text color. Example: text_color=&#8221;#ffffff&#8221;</p>\n<p>&#8211;<strong>star_color</strong>: rating stars color. Example: star_color=&#8221;yellow&#8221;</p>\n<p>&#8211;<strong>product_cat</strong>: display reviews of products in which category. Example:product_cat=&#8221;men&#8221;</p>\n<p>&#8211;<strong>order</strong>: sort reviews ASC or DESC. Example: order=&#8221;asc&#8221;</p>\n<p>&#8211;<strong>orderby</strong>: select how you would like to sort reviews. &#8220;comment_agent&#8221;, &#8220;comment_approved&#8221;, &#8220;comment_author&#8221;, &#8220;comment_author_email&#8221;, &#8220;comment_author_IP&#8221;, &#8220;comment_author_url&#8221;, &#8220;comment_content&#8221;, &#8220;comment_date&#8221;, &#8220;comment_date_gmt&#8221;, &#8220;comment_ID&#8221;, &#8220;comment_karma&#8221;, &#8220;comment_parent&#8221;, &#8220;comment_post_ID&#8221;, &#8220;comment_type&#8221;, &#8220;user_id&#8221;, &#8220;comment__in&#8221;, &#8220;meta_value&#8221;, &#8220;meta_value_num&#8221;. Example:orderby=&#8221;comment_date_gmt&#8221;</p>\n<p>&#8211;<strong>show_product</strong>: show product summary on Mansory popup, ON/OFF. Example: show_product=&#8221;on&#8221;</p>\n<p>&#8211;<strong>filter</strong>: show filter bar, ON/OFF. Example:filter=&#8221;on&#8221;</p>\n<p>&#8211;<strong>pagination</strong>: turn pagination ON/OFF. Example:pagination=&#8221;on&#8221;</p>\n<p>&#8211;<strong>pagination_ajax</strong>: turn ajax pagination ON/OFF. Example: pagination_ajax=&#8221;on&#8221;</p>\n<p>&#8211;<strong>pagination_position</strong>: select left/right/center. Example: pagination_position=&#8221;center&#8221;</p>\n<p>&#8211;<strong>conditional_tag</strong>: enter conditional tags to select pages you want to display the review. In case you paste the shortcode in an area which appears on many pages, use this option to select which pages you want the shortcode to run. Example: conditional_tag=&#8221;is_page(35)&#8221;</p>\n<p>&#8211;<strong>custom_css</strong>: allows you to add your custom CSS code.</p>\n<p>&#8211;<strong>ratings</strong>: select which rating you want to display. Example: display only 4 and 5 stars reviews, ratings=&#8221;4,5&#8243;</p>\n<p>&#8211;<strong>mobile</strong>: ON/OFF, select if you want the shortcode to run on mobile devices. Example: mobile=&#8221;on&#8221;</p>\n<p>&#8211;<strong>style</strong>: select the front-end style mansory/normal. Example: style=&#8221;masonry&#8221;</p>\n<p>&#8211;<strong>overall_rating</strong>: ON/OFF select if you want to display the overall rating. Example: overall_rating=&#8221;on&#8221;</p>\n<p>&#8211;<strong>rating_count</strong>: ON/OFF select if you want to display the rating count module. Example:rating_count=&#8221;on&#8221;</p>\n<p>&#8211;<strong>only_images</strong>: ON/OFF select if you want to display only reviews which have images. Example: only_images=&#8221;on&#8221;</p>\n<ul>\n<li><strong>The shortcode to display the review form</strong>:</li>\n</ul>\n<p>[woocommerce_photo_reviews_form] This shortcode helps you to display a review form. There are 3 ways to use it.</p>\n<p>&#8211;<strong>Display in single product pages</strong>: Paste the shortcode [woocommerce_photo_reviews_form] into product description to display a review form for that product on front-end.</p>\n<p>&#8211;<strong>Add product ID</strong>: Add a product ID into the shortcode [woocommerce_photo_reviews_form product_id=&#8221;&#8221;] by adding the product ID you can create a review form for a specific product and display it on any page.</p>\n<p>&#9658; <strong>COUPON FOR REVIEW</strong>:</p>\n<ul>\n<li>\n<p><strong>Registered-account email is required</strong>: only send coupons if the author&#8217;s email is registered an account</p>\n</li>\n<li>\n<p><strong>Required products</strong>: only selected products review can get a coupon.</p>\n</li>\n<li>\n<p><strong>Exclude products to give coupon</strong>: select products that reviews on these products will not receive a coupon</p>\n</li>\n<li>\n<p><strong>Required categories</strong>: only selected categories review can get a coupon.</p>\n</li>\n<li>\n<p><strong>Exclude categories to give coupon</strong>: select categories that reviews on products in that categories will not receive a coupon.</p>\n</li>\n<li>\n<p><strong>Coupon code prefix</strong>: select a prefix for coupons created by WooCommerce Photo Reviews.</p>\n</li>\n</ul>\n<p>&#9658; <strong>REVIEW REMINDER</strong>:</p>\n<ul>\n<li>\n<p><strong>Auto-login</strong>: When customers click on the link in their Review Reminder Email, they will be automatically login to their account on your site.</p>\n</li>\n<li>\n<p><strong>Products Restriction</strong>: Select which products will review reminder works.</p>\n</li>\n<li>\n<p><strong>Cancel/send reminders</strong>: If for some reasons you don&#8217;t want to send review reminders which were scheduled before, just go to admin orders page and look for order you want to cancel reminder and select cancel reminder from bulk actions. You can also send review reminders immediately or send reminders for orders that were completed before this plugin is active on your site.</p>\n</li>\n<li>\n<p><strong>REVIEW NOW button</strong>: Include a review now button with the link lead to the single product page. You can customize button color, background color, title, link&#8230;</p>\n</li>\n<li>\n<p><strong>Create a review page</strong>: Use the shortcode [woocommerce_photo_reviews_form] to create a review page, then add the review page in the Review Reminder tab. Customers who click on the Review now button in Review Reminder email will be redirected to this page. And they can review the product so easily.</p>\n</li>\n<li>\n<p><strong>Exclude products/categories</strong>: select which products/categories will receive a review reminder email.</p>\n</li>\n<li>\n<p><strong>Exclude non-coupon given products</strong>: enable this if you mean to offer a coupon for reviews in review reminder. The plugin will not send a review reminder email with non-coupon given products.</p>\n</li>\n</ul>\n<p>&#9658; <strong>ADD REVIEW MANUALLY</strong>:WooCommerce Photo Reviews provides a review form, allows Admin to add review manually.</p>\n<p>&#9658; <strong>MULTILINGUAL SUPPORT</strong>:If WPML or Polylang is active on your site, you will be able to send reviews reminder or coupon emails in your customers language</p>\n<p>&#9658; <strong>HELPFUL BUTTONS</strong>:Customers can up-vote or down-vote reviews to show if those reviews are helpful to them or not</p>\n<ul>\n<li><a href=\"https://1.envato.market/L3WrM\" rel=\"nofollow ugc\">GET PRO VERSION</a> or <a href=\"https://1.envato.market/L3WrM\" rel=\"nofollow ugc\">https://codecanyon.net/item/woocommerce-photo-reviews/21245349</a></li>\n</ul>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a></p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a></p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a></p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a></p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a></p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a></p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a></p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a></p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a></p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a></p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a></p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a></p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a></p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a></p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a></p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a></p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a></p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a></p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a></p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-photo-reviews\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-photo-reviews\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
        "installation": "<ol>\n<li>Unzip the download package</li>\n<li>Upload <code>woo-photo-reviews</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "changelog": "<p>/<strong>1.2.12 &#8211; 2024.07.02</strong>/<br />\n– Updated: Compatible with WC 9.0</p>\n<p>/<strong>1.2.11 &#8211; 2024.04.13</strong>/<br />\n– Updated: Compatible with WP 6.5 and WC 8.7<br />\n– Updated: Update support class</p>\n<p>/<strong>1.2.10 &#8211; 2023.01.06</strong>/<br />\n– Fixed: Compatible with &#8216;High-Performance order storage (COT)&#8217;<br />\n&#8211; Updated: Use wp_is_mobile to detect mobile<br />\n&#8211; Updated: Update support class</p>\n<p>/<strong>1.2.9 &#8211; 2023.04.12</strong>/<br />\n– Updated: Compatible with &#8216;High-Performance order storage (COT)&#8217;</p>\n<p>/<strong>1.2.8 &#8211; 2023.02.21</strong>/<br />\n&#8211; Updated: Update support class</p>\n<p>/<strong>1.2.7 &#8211; 2023.01.04</strong>/<br />\n&#8211; Added: Filter to change email&#8217;s content for email coupons &amp; email reminder</p>\n<p>/<strong>1.2.6 &#8211; 2022.12.05</strong>/<br />\n&#8211; Fixed: Can not save settings</p>\n<p>/<strong>1.2.5 &#8211; 2022.12.03</strong>/<br />\n&#8211; Added: Option upload file via ajax<br />\n&#8211; Added: Validate review content, customer information and restrict numbers of reviews without reloading the page</p>\n<p>/<strong>1.2.4 &#8211; 2022.11.17</strong>/<br />\n&#8211; Updated: Update support class</p>\n<p>/<strong>1.2.3 &#8211; 2022.10.07</strong>/<br />\n&#8211; Fixed: Display big review images content on the normal template<br />\n&#8211; Fixed: Display Rating Count &amp; Overall Rating<br />\n&#8211; Added: Vietnamese translation</p>\n<p>/<strong>1.2.2 &#8211; 2022.08.27</strong>/<br />\n&#8211; Updated: Update support class<br />\n– Updated: Compatible with WC 6.8</p>\n<p>/<strong>1.2.1 &#8211; 2022.05.30</strong>/<br />\n&#8211; Updated: Support upload image .webp<br />\n&#8211; Updated: Display error message when customer add review via WC notice<br />\n&#8211; Updated: Update support class<br />\n– Updated: Compatible with WC 6.5 and WP 6.0</p>\n<p>/<strong>1.2.0 &#8211; 2022.05.02</strong>/<br />\n&#8211; Fixed: Warning notice a non-numeric value</p>\n<p>/<strong>1.1.9 &#8211; 2022.04.20</strong>/<br />\n&#8211; Updated: Update support class</p>\n<p>/<strong>1.1.8 &#8211; 2022.03.29</strong>/<br />\n&#8211; Updated: Update support class</p>\n<p>/<strong>1.1.7 &#8211; 2022.03.21</strong>/<br />\n&#8211; Updated: Support class</p>\n<p>/<strong>1.1.6 &#8211; 2022.01.15</strong>/<br />\n&#8211; Updated: Compatibility with WC 6.1</p>\n<p>/<strong>1.1.5 &#8211; 2022.01.11</strong>/<br />\n&#8211; Updated: support class</p>\n<p>/<strong>v1.1.4.3 &#8211; 2021.07.31</strong>/<br />\n&#8211; Update: support class</p>\n<p>/<strong>v1.1.4.2 &#8211; 2021.06.29</strong>/<br />\n&#8211; Fixed: Remove redundant characters in class name</p>\n<p>/<strong>v1.1.4.1 &#8211; 2021.06.29</strong>/<br />\n&#8211; Update: support class</p>\n<p>/<strong>v1.1.4.0 &#8211; 2021.06.02</strong>/<br />\n&#8211; Update: support class</p>\n<p>/<strong>v1.1.3.9 &#8211; 2021.05.25</strong>/<br />\n&#8211; updated: allow customer to submit comments if disabled &#8216;Comment author must fill out name and email&#8217;</p>\n<p>/<strong>v1.1.3.8 &#8211; 2021.04.08</strong>/<br />\n&#8211; Updated: Compatible with Antispam Bee plugin of pluginkollektiv</p>\n<p>/<strong>v1.1.3.7 &#8211; 2020.09.18</strong>/<br />\n&#8211; Fixed: Wrong page after customers leave a review<br />\n&#8211; Added: Option to change star color<br />\n&#8211; Updated: Compatible with WC4.5</p>\n<p>/<strong>v1.1.3.6 &#8211; 2020.08.15</strong>/<br />\n&#8211; Updated: Compatible with WP5.5 and WC4.3</p>\n<p>/<strong>v1.1.3.5 &#8211; 2020.04.29</strong>/<br />\n&#8211; Fixed: Ajax search products/coupons/categories issue happened with several users</p>\n<p>/<strong>v1.1.3.4 &#8211; 2020.04.23</strong>/<br />\n&#8211; Updated: Class support</p>\n<p>/<strong>v1.1.3.3 &#8211; 2020.03.23</strong>/<br />\n&#8211; Updated: Compatible with WP5.4 and WC4.0<br />\n&#8211; Updated: Class support</p>\n<p>/<strong>v1.1.3.2 &#8211; 2019.11.16</strong>/<br />\n&#8211; Updated: Compatible with WP 5.3 and WooCommerce 3.8</p>\n<p>/<strong>v1.1.3.1 &#8211; 2019.10.07</strong>/<br />\n&#8211; Updated: Premium link</p>\n<p>/<strong>v1.1.3 &#8211; 2019.07.25</strong>/<br />\n&#8211; Fixed: Filter not showing on some themes<br />\n&#8211; Updated: Masonry layout<br />\n&#8211; Added: Warning message when submitting reviews<br />\n&#8211; Added: Click to view full image on masonry popup<br />\n&#8211; Added: Review date for masonry layout</p>\n<p>/<strong>v1.1.2.3 &#8211; 2019.05.09</strong>/<br />\n&#8211; Updated: Change plugin name<br />\n&#8211; Updated: Change premium version url</p>\n<p>/<strong>v1.1.2.2 &#8211; 2019.04.04</strong>/<br />\n&#8211; Updated: Make admin notices dismissible<br />\n&#8211; Updated: Add rel=&#8221;nofollow&#8221; to filter button anchor for SEO purpose</p>\n<p>/<strong>v1.1.2.1 &#8211; 2019.01.17</strong>/<br />\n&#8211; Fixed: Warning message in version v1.1.2<br />\n&#8211; Fixed: Coupon not sent when turning on Verified owner is required</p>\n<p>/<strong>v1.1.2 &#8211; 2019.01.12</strong>/<br />\n&#8211; Fixed: Some text not translated<br />\n&#8211; Updated: Class support<br />\n&#8211; Updated: Only send review reminder with products in the order that the customer did not review<br />\n&#8211; Updated: How coupon is given: Option to not give coupon for emails that do not have an account; an user/email can only receive one coupon for his/her review on a product no matter how many times he/she reviews that product<br />\n&#8211; Added: Unique coupon settings: exclude products, include/exclude categories<br />\n&#8211; Added: Able to change Reviews anchor link<br />\n&#8211; Added: Preview emails<br />\n&#8211; Added: Filter for review images name when uploading<br />\n&#8211; Added: Images rotation for normal Front-end style</p>\n<p>/<strong>v1.1.1 &#8211; 2018.11.21</strong>/<br />\n&#8211; Updated: Class support</p>\n<p>/<strong>v1.0.9.9 &#8211; 2018.10.17</strong>/<br />\n&#8211; Updated: Class support<br />\n&#8211; Updated: Shorten unique coupon code<br />\n&#8211; Fixed: Product images and price in review reminder</p>\n<p>/<strong>v1.0.9.8 &#8211; 2018.07.21</strong>/<br />\n&#8211; Fixed: Filter button</p>\n<p>/<strong>v1.0.9.7 &#8211; 2018.07.20</strong>/<br />\n&#8211; Fixed: Translate<br />\n&#8211; Added: RTL support<br />\n&#8211; Optimized: Filter buttons</p>\n<p>/<strong>v1.0.9.6 &#8211; 2018.07.19</strong>/<br />\n&#8211; Fixed: Star rating css</p>\n<p>/<strong>v1.0.9.5 &#8211; 2018.07.18</strong>/<br />\n&#8211; Fixed: Filter buttons<br />\n&#8211; Fixed: Tab history of the plugin settings page<br />\n&#8211; Updated: Ability to enable/disable each filter button<br />\n&#8211; Added: Shortcodes {site_title}, {order_id}, {date_create}, {date_complete} for review reminder email</p>\n<p>/<strong>v1.0.9.4 &#8211; 2018.05.22</strong>/<br />\n&#8211; Added: GDPR policy checkbox<br />\n&#8211; Added: Overall rating</p>\n<p>/<strong>v1.0.9.3 &#8211; 2018.05.11</strong>/<br />\n&#8211; Updated: Class Support</p>\n<p>/<strong>v1.0.9.2 &#8211; 2018.04.13</strong>/<br />\n&#8211; Fixed: Error The security check failed! on blog comments</p>\n<p>/<strong>v1.0.9.1 &#8211; 2018.04.11</strong>/<br />\n&#8211; Fixed: Class support</p>\n<p>/<strong>v1.0.9 &#8211; 2018.03.19</strong>/<br />\n&#8211; Fixed: Masonry popup<br />\n&#8211; Optimized: Photos uploaded, reduce unnecessary photos sizes</p>\n<p>/<strong>v1.0.8 &#8211; 2018.02.07</strong>/<br />\n&#8211; Fixed: Coupon expiry date</p>\n<p>/<strong>v1.0.7 &#8211; 2018.02.06</strong>/<br />\n&#8211; Fixed: unique coupon settings</p>\n<p>/<strong>v1.0.6-2018.1.26</strong>/<br />\n&#8211; updated: display photos and rating in comments list in backend</p>\n<p>/<strong>v1.0.5-2018.1.25</strong>/<br />\n&#8211; changed: coupon expiry date</p>\n<p>/<strong>v1.0.4-2018.1.23</strong>/<br />\n&#8211; changed: backend<br />\n&#8211; updated: more features<br />\n&#8211; added: update pro version option<br />\n&#8211; optimized: get option</p>\n<p>/<strong>v1.0.3-2018.1.3</strong>/<br />\n&#8211; changed: redesign backend<br />\n&#8211; Fixed: new-line not preserved in email content</p>\n<p>/<strong>v1.0.2-2017.11.28</strong>/<br />\n&#8211; Fixed: star rating displays incorrectly<br />\n&#8211; Fixed: lightbox not close when click outside review</p>\n<p>/<strong>v1.0.1-2017.11.25</strong>/<br />\n&#8211; Fixed: images thumbnail size.<br />\n&#8211; changed: Woocommerce default reviews with photos option</p>\n"
    },
    "short_description": "Let customers attach photos to reviews, enhanced with filterable grids and overall ratings. Auto-send review reminders and coupon emails",
    "description": "<p>Photo Reviews for WooCommerce is an ultimate review plugin for WooCommerce which helps you send review reminder emails, allows customers to post reviews include product pictures and send thank you emails with WooCommerce coupons to customers.</p>\n<ul>\n<li>\n<p>Send review reminder emails asking customers to review their purchased products.</p>\n</li>\n<li>\n<p>Allows customers posting reviews include product pictures.</p>\n</li>\n<li>\n<p>Send thank you email with a coupon code when a customer review is published.</p>\n</li>\n</ul>\n<blockquote>\n<p><a href=\"http://new2new.com/?item=woocommerce-photo-reviews\" title=\"Demo Photo Reviews for WooCommerce\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"http://docs.villatheme.com/?item=woocommerce-photo-reviews\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a>| <a href=\"https://1.envato.market/L3WrM\" title=\"Premium Version\" rel=\"nofollow ugc\">Premium Version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n</blockquote>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/8LYHI4rAiLs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>IMPORTANT NOTICE</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>FEATURES</h3>\n<p>&#9658; <strong>PHOTO REVIEWS</strong>:The plugin WooCommerce Photo Reviews allows your customers to post pictures along with their product review. This feature will help you to create a social proof of your product and increase conversion rate.</p>\n<ul>\n<li>\n<p><strong>Photo review</strong>: The plugin allows customers to attach pictures to reviews and display that pictures along with the review on the front-end.</p>\n</li>\n<li>\n<p><strong>Maximum picture size</strong>: Set a maximum picture size that customers can attach to their reviews.</p>\n</li>\n<li>\n<p><strong>Photos required</strong>: Reviews must include a picture to be uploaded.</p>\n</li>\n<li>\n<p><strong>Display by time</strong>: Select to display the newest or oldest review first on front-end.</p>\n</li>\n<li>\n<p><strong>Overall rating &amp; Rating count</strong>: Show the average rating, total number of reviews and the number of each rating in an intuitive and friendly way</p>\n</li>\n<li>\n<p><strong>Review Filter</strong>: Filter reviews by rating, contain pictures or verified buyers</p>\n</li>\n<li>\n<p><strong>GDPR compliance</strong>: The plugin will display a message and a checkbox at the review form that allows customers to agree to share the review on your page.</p>\n</li>\n<li>\n<p><strong>Edit reviews</strong>: Admin can edit review text, change review images&#8230;</p>\n</li>\n</ul>\n<p>&#9658; <strong>REVIEW REMINDER</strong>:After a scheduled time from when an order is marked as complete. The plugin will send a review reminder email to the customer, asking to review the product. To encourage the customer to take pictures of the product and leave a review, the plugin will offer them a discount coupon. The plugin only sends a review reminder if a customer has never reviewed the item before.</p>\n<ul>\n<li>\n<p><strong>Review reminder email</strong>: Send emails to customers who purchased products, offering them coupons to encourage them posting review</p>\n</li>\n<li>\n<p><strong>Configure review reminder email</strong>: Configure the review reminder email sending to customers using shortcode {customer_name}</p>\n</li>\n</ul>\n<p>&#9658; <strong>COUPON FOR REVIEW</strong>:The plugin will generate coupons and send to review authors. This prize will encourage customers to post reviews and it also increases your profit when they use the coupon.</p>\n<ul>\n<li>\n<p><strong>Send coupon email</strong>: the plugin will send an email coupon whenever a review which qualifies the requirement is published.</p>\n</li>\n<li>\n<p><strong>Use existing coupons</strong>: you select to send existing WooCommerce coupons as a prize.</p>\n</li>\n<li>\n<p><strong>Auto-generate coupons</strong>: set up the plugin to generate unique coupons and send it along with the coupon emails. You can set up the plugin to generate coupons with all WooCommerce Coupon settings.</p>\n</li>\n<li>\n<p><strong>Photos required</strong>: you can select to send coupons to authors of reviews include photos only.</p>\n</li>\n<li>\n<p><strong>Minimum rating required</strong>: set a minimum rating review can get a coupon.</p>\n</li>\n<li>\n<p><strong>Verified owners required</strong>: the only reviews from the verified owner can get a coupon.</p>\n</li>\n<li>\n<p><strong>Configure coupon email</strong>: configure the coupon email sending to customers using shortcode {customer_name} {coupon_code}  {date_expires}</p>\n</li>\n</ul>\n<p>&#9658; <strong>FRONT-END DESIGNS</strong>:The plugin provides such many design option for you to change the review module to fit with your website interface.</p>\n<ul>\n<li>\n<p><strong>Front-end style</strong>: there are 2 front-end styles for you to select. The Grid style and the default style.</p>\n</li>\n<li>\n<p><strong>Background-color</strong>: helps you to change the background color of the review section.</p>\n</li>\n<li>\n<p><strong>Text color</strong>: you can change the review text.</p>\n</li>\n<li>\n<p><strong>Review date</strong>: you can choose to display the review date on front-end.</p>\n</li>\n<li>\n<p><strong>Review Rating Count</strong>: display overall rating on the front-end.</p>\n</li>\n<li>\n<p><strong>Full-size images</strong>: allows customers to display review image full size.</p>\n</li>\n<li>\n<p><strong>Custom CSS</strong>: you can add your CSS code to change the front-end design as you want.</p>\n</li>\n</ul>\n<h3>PREMIUM VERSION</h3>\n<p>&#9658; <strong>AJAX PAGINATION AND FILTER</strong>: Do not reload page when users want to view other review page or select a filter. When this function is on, you can also select default filters which are selected when your customers visit product or reviews page</p>\n<p>&#9658; <strong>REVIEW TITLE</strong>: Users now can add title for their reviews like when you review a plugin on WordPress.org</p>\n<p>&#9658; <strong>REVIEW IMAGE FOLDER</strong>: Now you can put images from reviews uploaded by your users to a folder and reviews imported from AliExpress to a different folder for later modification</p>\n<p>&#9658; <strong>POPUP TYPE</strong>: You can make only review images clickable or disable popup for masonry style. With normal style, lightbox effect can be applied to review images</p>\n<p>&#9658; <strong>IMPORT ALIEXPRESS REVIEWS</strong>:The plugin allows you to import reviews from AliExpress by using AliExpress product IDs. Import using product ID: Using an AliExpress product ID to import reviews from that products to a selected WooCommerce product.</p>\n<ul>\n<li>\n<p><strong>Phrases filter</strong>: This helps you automatically replace unwanted letters/words/phrases within review author name and review content before reviews are imported to your store</p>\n</li>\n<li>\n<p><strong>Selected Ratings</strong>: Choose which review ratings will be imported</p>\n</li>\n<li>\n<p><strong>Included pictures</strong>: Select to import only reviews that include pictures</p>\n</li>\n<li>\n<p><strong>Translate to English</strong>: AliExpress has a feature to translate reviews into English. This option of WooCommerce Photo Review allows you to select to import translated reviews of import original reviews.</p>\n</li>\n<li>\n<p><strong>Mark imported review as Verified owner</strong>: The imported reviews will be marked with a &#8220;Verified owner&#8221; badge, that means the reviews come from people who purchased.</p>\n</li>\n<li>\n<p><strong>Download picture</strong>: If you select the download picture option, review pictures will be download to your website database. If not, the plugin will use the AliExpress pictures (with URLs to AliExpress.com) to display review pictures.</p>\n</li>\n<li>\n<p><strong>Country</strong>: Select to import reviews from specific countries</p>\n</li>\n<li>\n<p><strong>Number of reviews</strong>: Select how many reviews will be imported. A product on AliExpress.com can have thousands of reviews and you may not want to import all of those reviews. So this option will help you to set a limit on reviews will be imported.</p>\n</li>\n</ul>\n<p>&#9658; <strong>IMPORT/EXPORT REVIEWS</strong>:The plugin allows you to import/export reviews using CSV files</p>\n<ul>\n<li>\n<p><strong>Export review</strong>: the plugin allows you to export existing reviews to a CSV file. The exported file includes author, author email, comment date, comment content, rating, review image links, user ID&#8230;</p>\n</li>\n<li>\n<p><strong>Date</strong>: you can select a time range to export reviews.</p>\n</li>\n<li>\n<p><strong>Products</strong>: Select the products which you want to export reviews.</p>\n</li>\n<li>\n<p><strong>Categories</strong>: select the categories which you want to export reviews from.</p>\n</li>\n<li>\n<p><strong>Rating</strong>: select the review rating you want to export. For example, you want to export only 4-stars and 5-stars reviews.</p>\n</li>\n<li>\n<p><strong>Comment status</strong>: select comment status of review you want to export. For example, you want to export only approved reviews.</p>\n</li>\n<li>\n<p><strong>Import review</strong>: you can import review using CSV files as well. The import review CSV has the same structure as the export CSV file.</p>\n</li>\n</ul>\n<p>&#9658; <strong>OPTIONAL FIELDS</strong>:With this option, you can create multiple optional fields and set values for those fields. Then customers can select these value when they leave a review. The optional fields option help to provide more information about the product.</p>\n<ul>\n<li>\n<p><strong>Create optional fields</strong>: you can create multiple fields and set the values of each field. For example, you can create a color field, and set values are Blue, Black, Red, etc.</p>\n</li>\n<li>\n<p><strong>Select field value</strong>: when a customer leaves a review, they can select a value of the field which you created. For example, a customer reviews a shirt and he can select the size is &#8220;XL&#8221;.</p>\n</li>\n<li>\n<p><strong>Create fields from variations</strong>: the plugin will automatically create fields and values from your product variations.</p>\n</li>\n</ul>\n<p>&#9658; <strong>SHORTCODES</strong>:The plugin provides 3 shortcodes. A shortcode to allows you to displays product reviews at anywhere you want. And the other shortcode which displays a review form, allows customers to leave a review about their purchased products.</p>\n<ul>\n<li>\n<p><strong>Product rating shortcode is used to display rating of a product</strong>:</p>\n<p>[wc_photo_reviews_rating_html]</p>\n</li>\n<li>\n<p><strong>The shortcode to display reviews</strong>:</p>\n</li>\n</ul>\n<p>[wc_photo_reviews_shortcode comments_per_page=&#8221;10&#8243; cols=&#8221;4&#8243; cols_gap=&#8221;&#8221; products=&#8221;&#8221; grid_bg_color=&#8221;&#8221; grid_item_bg_color=&#8221;&#8221; text_color=&#8221;&#8221; star_color=&#8221;&#8221; product_cat=&#8221;&#8221; order=&#8221;&#8221; orderby=&#8221;comment_date_gmt&#8221; show_product=&#8221;on&#8221; filter=&#8221;on&#8221; pagination=&#8221;on&#8221; pagination_position=&#8221;&#8221; conditional_tag=&#8221;&#8221; custom_css=&#8221;&#8221; ratings=&#8221;&#8221; mobile=&#8221;&#8221; style=&#8221;masonry&#8221; overall_rating=&#8221;off&#8221; rating_count=&#8221;off&#8221; only_images=&#8221;off&#8221;]</p>\n<p>&#8211;<strong>comments_per_page</strong>: number of comments per page. comments_per_page=&#8221;10&#8243;</p>\n<p>&#8211;<strong>cols</strong>: number of grid columns. Example:  cols=&#8221;5&#8243;</p>\n<p>&#8211;<strong>cols_gap</strong>: gap between grid columns(px). Example:cols_gap=&#8221;30&#8243;</p>\n<p>&#8211;<strong>products</strong>: display reviews of which products, enter product IDs. Example:  products=&#8221;99,100&#8243;</p>\n<p>&#8211;<strong>grid_bg_color</strong>: grid background color. Example:  grid_bg_color=&#8221;#000000&#8243;</p>\n<p>&#8211;<strong>grid_item_bg_color</strong>: grid item background color. Example: grid_item_bg_color=&#8221;#3c3c3c&#8221;</p>\n<p>&#8211;<strong>text_color</strong>: reviews text color. Example: text_color=&#8221;#ffffff&#8221;</p>\n<p>&#8211;<strong>star_color</strong>: rating stars color. Example: star_color=&#8221;yellow&#8221;</p>\n<p>&#8211;<strong>product_cat</strong>: display reviews of products in which category. Example:product_cat=&#8221;men&#8221;</p>\n<p>&#8211;<strong>order</strong>: sort reviews ASC or DESC. Example: order=&#8221;asc&#8221;</p>\n<p>&#8211;<strong>orderby</strong>: select how you would like to sort reviews. &#8220;comment_agent&#8221;, &#8220;comment_approved&#8221;, &#8220;comment_author&#8221;, &#8220;comment_author_email&#8221;, &#8220;comment_author_IP&#8221;, &#8220;comment_author_url&#8221;, &#8220;comment_content&#8221;, &#8220;comment_date&#8221;, &#8220;comment_date_gmt&#8221;, &#8220;comment_ID&#8221;, &#8220;comment_karma&#8221;, &#8220;comment_parent&#8221;, &#8220;comment_post_ID&#8221;, &#8220;comment_type&#8221;, &#8220;user_id&#8221;, &#8220;comment__in&#8221;, &#8220;meta_value&#8221;, &#8220;meta_value_num&#8221;. Example:orderby=&#8221;comment_date_gmt&#8221;</p>\n<p>&#8211;<strong>show_product</strong>: show product summary on Mansory popup, ON/OFF. Example: show_product=&#8221;on&#8221;</p>\n<p>&#8211;<strong>filter</strong>: show filter bar, ON/OFF. Example:filter=&#8221;on&#8221;</p>\n<p>&#8211;<strong>pagination</strong>: turn pagination ON/OFF. Example:pagination=&#8221;on&#8221;</p>\n<p>&#8211;<strong>pagination_ajax</strong>: turn ajax pagination ON/OFF. Example: pagination_ajax=&#8221;on&#8221;</p>\n<p>&#8211;<strong>pagination_position</strong>: select left/right/center. Example: pagination_position=&#8221;center&#8221;</p>\n<p>&#8211;<strong>conditional_tag</strong>: enter conditional tags to select pages you want to display the review. In case you paste the shortcode in an area which appears on many pages, use this option to select which pages you want the shortcode to run. Example: conditional_tag=&#8221;is_page(35)&#8221;</p>\n<p>&#8211;<strong>custom_css</strong>: allows you to add your custom CSS code.</p>\n<p>&#8211;<strong>ratings</strong>: select which rating you want to display. Example: display only 4 and 5 stars reviews, ratings=&#8221;4,5&#8243;</p>\n<p>&#8211;<strong>mobile</strong>: ON/OFF, select if you want the shortcode to run on mobile devices. Example: mobile=&#8221;on&#8221;</p>\n<p>&#8211;<strong>style</strong>: select the front-end style mansory/normal. Example: style=&#8221;masonry&#8221;</p>\n<p>&#8211;<strong>overall_rating</strong>: ON/OFF select if you want to display the overall rating. Example: overall_rating=&#8221;on&#8221;</p>\n<p>&#8211;<strong>rating_count</strong>: ON/OFF select if you want to display the rating count module. Example:rating_count=&#8221;on&#8221;</p>\n<p>&#8211;<strong>only_images</strong>: ON/OFF select if you want to display only reviews which have images. Example: only_images=&#8221;on&#8221;</p>\n<ul>\n<li><strong>The shortcode to display the review form</strong>:</li>\n</ul>\n<p>[woocommerce_photo_reviews_form] This shortcode helps you to display a review form. There are 3 ways to use it.</p>\n<p>&#8211;<strong>Display in single product pages</strong>: Paste the shortcode [woocommerce_photo_reviews_form] into product description to display a review form for that product on front-end.</p>\n<p>&#8211;<strong>Add product ID</strong>: Add a product ID into the shortcode [woocommerce_photo_reviews_form product_id=&#8221;&#8221;] by adding the product ID you can create a review form for a specific product and display it on any page.</p>\n<p>&#9658; <strong>COUPON FOR REVIEW</strong>:</p>\n<ul>\n<li>\n<p><strong>Registered-account email is required</strong>: only send coupons if the author&#8217;s email is registered an account</p>\n</li>\n<li>\n<p><strong>Required products</strong>: only selected products review can get a coupon.</p>\n</li>\n<li>\n<p><strong>Exclude products to give coupon</strong>: select products that reviews on these products will not receive a coupon</p>\n</li>\n<li>\n<p><strong>Required categories</strong>: only selected categories review can get a coupon.</p>\n</li>\n<li>\n<p><strong>Exclude categories to give coupon</strong>: select categories that reviews on products in that categories will not receive a coupon.</p>\n</li>\n<li>\n<p><strong>Coupon code prefix</strong>: select a prefix for coupons created by WooCommerce Photo Reviews.</p>\n</li>\n</ul>\n<p>&#9658; <strong>REVIEW REMINDER</strong>:</p>\n<ul>\n<li>\n<p><strong>Auto-login</strong>: When customers click on the link in their Review Reminder Email, they will be automatically login to their account on your site.</p>\n</li>\n<li>\n<p><strong>Products Restriction</strong>: Select which products will review reminder works.</p>\n</li>\n<li>\n<p><strong>Cancel/send reminders</strong>: If for some reasons you don&#8217;t want to send review reminders which were scheduled before, just go to admin orders page and look for order you want to cancel reminder and select cancel reminder from bulk actions. You can also send review reminders immediately or send reminders for orders that were completed before this plugin is active on your site.</p>\n</li>\n<li>\n<p><strong>REVIEW NOW button</strong>: Include a review now button with the link lead to the single product page. You can customize button color, background color, title, link&#8230;</p>\n</li>\n<li>\n<p><strong>Create a review page</strong>: Use the shortcode [woocommerce_photo_reviews_form] to create a review page, then add the review page in the Review Reminder tab. Customers who click on the Review now button in Review Reminder email will be redirected to this page. And they can review the product so easily.</p>\n</li>\n<li>\n<p><strong>Exclude products/categories</strong>: select which products/categories will receive a review reminder email.</p>\n</li>\n<li>\n<p><strong>Exclude non-coupon given products</strong>: enable this if you mean to offer a coupon for reviews in review reminder. The plugin will not send a review reminder email with non-coupon given products.</p>\n</li>\n</ul>\n<p>&#9658; <strong>ADD REVIEW MANUALLY</strong>:WooCommerce Photo Reviews provides a review form, allows Admin to add review manually.</p>\n<p>&#9658; <strong>MULTILINGUAL SUPPORT</strong>:If WPML or Polylang is active on your site, you will be able to send reviews reminder or coupon emails in your customers language</p>\n<p>&#9658; <strong>HELPFUL BUTTONS</strong>:Customers can up-vote or down-vote reviews to show if those reviews are helpful to them or not</p>\n<ul>\n<li><a href=\"https://1.envato.market/L3WrM\" rel=\"nofollow ugc\">GET PRO VERSION</a> or <a href=\"https://1.envato.market/L3WrM\" rel=\"nofollow ugc\">https://codecanyon.net/item/woocommerce-photo-reviews/21245349</a></li>\n</ul>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a></p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a></p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a></p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a></p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a></p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a></p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a></p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a></p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a></p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a></p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a></p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a></p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a></p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a></p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-checkout-upsell-funnel\" rel=\"nofollow ugc\">Checkout Upsell Funnel for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-cart-all-in-one\" rel=\"nofollow ugc\">Cart All In One For WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a></p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a></p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a></p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a></p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a></p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a></p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a></p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-photo-reviews\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-photo-reviews\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/woo-photo-reviews.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/woo-photo-reviews/assets/screenshot-1.png?rev=1846768",
            "caption": "Photo reviews"
        },
        {
            "src": "https://ps.w.org/woo-photo-reviews/assets/screenshot-2.png?rev=1810945",
            "caption": "Images and rating of comments for admin to moderate"
        }
    ],
    "tags": {
        "coupon": "coupon",
        "customer-reviews": "customer reviews",
        "product-reviews-image": "product reviews image",
        "review-reminder": "review reminder",
        "woocommerce-reviews": "woocommerce reviews"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.villatheme.com/donate",
    "banners": {
        "low": "https://ps.w.org/woo-photo-reviews/assets/banner-772x250.jpg?rev=3080882",
        "high": "https://ps.w.org/woo-photo-reviews/assets/banner-1544x500.jpg?rev=3080882"
    },
    "icons": {
        "1x": "https://ps.w.org/woo-photo-reviews/assets/icon-128x128.gif?rev=3080882",
        "2x": "https://ps.w.org/woo-photo-reviews/assets/icon-256x256.gif?rev=3080882"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 94,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/woo-photo-reviews/blueprint.json?rev=3111045"
        }
    ],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "woo-photo-reviews",
            "language": "es_ES",
            "version": "1.2.12",
            "updated": "2023-12-20 19:01:57",
            "package": "http://downloads.wordpress.org/translation/plugin/woo-photo-reviews/1.2.12/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "woo-photo-reviews",
            "language": "ru_RU",
            "version": "1.2.12",
            "updated": "2021-09-28 07:34:47",
            "package": "http://downloads.wordpress.org/translation/plugin/woo-photo-reviews/1.2.12/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "woo-photo-reviews",
            "language": "vi",
            "version": "1.2.12",
            "updated": "2022-11-30 07:27:07",
            "package": "http://downloads.wordpress.org/translation/plugin/woo-photo-reviews/1.2.12/vi.zip"
        }
    ]
}