{
    "name": "WooCommerce Affiliate Plugin &#8211; Coupon Affiliates",
    "slug": "woo-coupon-usage",
    "version": "5.15.1",
    "author": "<a href=\"https://couponaffiliates.com/\">Elliot Sowersby, RelyWP</a>",
    "author_profile": "https://profiles.wordpress.org/elliotvs/",
    "contributors": {
        "elliotvs": {
            "profile": "https://profiles.wordpress.org/elliotvs/",
            "avatar": "https://secure.gravatar.com/avatar/fead2c2ce89f4655b6fcaa552a764ff7?s=96&d=monsterid&r=g",
            "display_name": "Elliot Sowersby"
        },
        "freemius": {
            "profile": "https://profiles.wordpress.org/freemius/",
            "avatar": "https://secure.gravatar.com/avatar/3ac33da92186a78937b307bdd9e906ee?s=96&d=monsterid&r=g",
            "display_name": "Freemius"
        },
        "couponaffiliates": {
            "profile": "https://profiles.wordpress.org/couponaffiliates/",
            "avatar": "https://secure.gravatar.com/avatar/04f837bff196ff54888a494217a39775?s=96&d=monsterid&r=g",
            "display_name": "Coupon Affiliates"
        },
        "relywp": {
            "profile": "https://profiles.wordpress.org/relywp/",
            "avatar": "https://secure.gravatar.com/avatar/7fec5e7e39973b8e414065cadd6f2c37?s=96&d=monsterid&r=g",
            "display_name": "RelyWP"
        }
    },
    "requires": "4.7",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [
        "woocommerce"
    ],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 65,
        "4": 1,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 67,
    "support_url": "https://wordpress.org/support/plugin/woo-coupon-usage/",
    "support_threads": 26,
    "support_threads_resolved": 23,
    "active_installs": 5000,
    "downloaded": 219607,
    "last_updated": "2024-08-30 14:24:00",
    "added": "2015-08-18",
    "homepage": "https://couponaffiliates.com",
    "sections": {
        "description": "<p>Coupon Affiliates allows you to easily create an advanced coupon-based affiliate program for WooCommerce, to grow traffic and increase sales.</p>\n<p>With this plugin you can give your affiliates access to a user-friendly affiliate dashboard for their coupons, to view coupon usage statistics, recent orders, commission earned, referral URLs and more.</p>\n<p><strong>Why is Coupon Affiliates the best WooCommerce affiliate plugin?</strong></p>\n<ul>\n<li><strong>Unique</strong> &#8211; The only plugin that is built specifically for creating a &#8220;coupon based&#8221; affiliate program for WooCommerce.</li>\n<li><strong>Quick &amp; Easy to Use</strong> &#8211; Get your affiliate program setup quickly and easily! The plugin is easy to use for you and your affiliates.</li>\n<li><strong>User Friendly</strong> &#8211; The affiliate dashboard is user friendly, visually pleasing, and includes lots of features your affiliates will love.</li>\n<li><strong>Transparency</strong> &#8211; Build trust with your affiliates, by giving them transparent access to the important statistics they want to see, in real-time, directly on their WooCommerce affiliate dashboard.</li>\n<li><strong>Lots of Customisations</strong> &#8211; The plugin comes with plenty of useful settings to make the affiliate program work exactly how you want.</li>\n<li><strong>Friendly Support</strong> &#8211; UK-based support is available to both our free and paid users, regarding setup, customisations and more.</li>\n<li><strong>Built for WooCommerce</strong> &#8211; This affiliate plugin is developed exclusively for WooCommerce, the best eCommerce platform.</li>\n<li><strong>Easy Migration</strong> &#8211; Migration from other affiliates plugins is super simple, since the plugin will display the full order history for each affiliate coupon (even orders created before installing the plugin).</li>\n<li><strong>Frequent Updates</strong> &#8211; We are always working on adding new awesome features to Coupon Affiliates. Got a suggestion? Let us know!</li>\n</ul>\n<h3>🎉 Plugin Features</h3>\n<p><strong>&#8212; Affiliate Dashboard &#8212;</strong></p>\n<ul>\n<li>On the affiliate dashboard, you and your affiliates can view detailed statistics for their referral coupon, including total usage, recent order details, referral URL generator, conversions statistics, and lots more.</li>\n</ul>\n<p><strong>&#8212; Accurate Commission Tracking &#8212;</strong></p>\n<ul>\n<li>\n<p>Affiliates can see the total commission earned via their coupon, and for each individual order in the recent orders list.</p>\n</li>\n<li>\n<p>There are 3 types of commission amounts, including fixed commission “per product”, “per order”, and a &#8220;percentage&#8221; of the total order. You can even set all 3 for more flexible commission calculations!</p>\n</li>\n</ul>\n<p><strong>&#8212; Recent Orders List &#8212;</strong></p>\n<ul>\n<li>\n<p>Affiliates can view a recent order list for their coupon, with general info such as date, order subtotal, discount, total, products purchased, commission earned etc. A monthly orders/commission summary is also included in the PRO version.</p>\n</li>\n<li>\n<p>This can be filtered by date or order status, and also shows combined totals for all orders within the date range selected.</p>\n</li>\n</ul>\n<p><strong>&#8212; Affiliate Referral URLs &#8212;</strong></p>\n<ul>\n<li>\n<p>Affiliates can generate a referral URL via the affiliate tool which automatically applies the coupon at checkout for visitors using their link.</p>\n</li>\n<li>\n<p>They can also view total clicks, usage, and conversion rate for their referral URL on the affiliate dashboard, along with a detailed log of all of their individual clicks.</p>\n</li>\n<li>\n<p>If required, you can enable an option to track conversions via the referral URL even if coupon was not used. If enabled, if someone visits the site via the referral URL and places an order without using the coupon code, it will still be tracked and award the affiliate.</p>\n</li>\n</ul>\n<p><strong>&#8212; Assign Users to Coupons &#8212;</strong></p>\n<ul>\n<li>\n<p>Assign/link user accounts to coupon codes, to give them direct private access to their affiliate dashboard for each coupon.</p>\n</li>\n<li>\n<p>A login form will be displayed on the affiliate dashboard page for logged out users, along with the affiliate registration form.</p>\n</li>\n</ul>\n<p><strong>&#8212; Affiliate Registration System &#8212;</strong></p>\n<ul>\n<li>\n<p>Display a customisable affiliate registration form on your website to allow users to apply as an affiliate. <a href=\"https://couponaffiliates.com/docs/affiliate-registration\" rel=\"nofollow ugc\">Learn More.</a></p>\n</li>\n<li>\n<p>You can easily manage and approve all your affiliate applications in the WordPress admin area.</p>\n</li>\n<li>\n<p>The system will automatically generate the affiliate coupons, assign the users to it, and send them a customisable welcome email.</p>\n</li>\n</ul>\n<p><strong>&#8212; Email Notifications &#8212;</strong></p>\n<ul>\n<li>Automatically send email notifications to affiliates when their coupon code is used, to let them know they have earned new commission. You can also customise the emails with your own message.</li>\n</ul>\n<p><strong>&#8212; Fraud Prevention &#8212;</strong></p>\n<ul>\n<li>Fraud prevention is an important part of any affiliate program. We have implemented several powerful features and options to help stop fraudulent sales! <a href=\"https://couponaffiliates.com/docs/affiliate-fraud-prevention\" rel=\"nofollow ugc\">Learn more.</a></li>\n</ul>\n<p><strong>&#8212; WooCommerce Subscriptions &#8212;</strong></p>\n<ul>\n<li>Coupon Affiliates includes free integration with the official &#8220;WooCommerce Subscriptions&#8221; plugin. This means you can offer affiliates referring commission for subscription renewals, or optionally toggle this off to only reward commission for the first order.</li>\n</ul>\n<p><strong>&#8212; Multi-Currency Support &#8212;</strong></p>\n<ul>\n<li>\n<p>With Coupon Affiliates, you can enable multi-currency support and easily set conversion rates for all your store currencies.</p>\n</li>\n<li>\n<p>This will then automatically convert the order totals, total stats, and commission earned, in the affiliate dashboard to your base store currency, no matter which currency each of the orders were made in.</p>\n</li>\n</ul>\n<h3>🎨 Admin Management &amp; Customisation</h3>\n<p>Coupon Affiliates makes it easy to manage and customise your affiliate program, with a large variety of useful features and tools.</p>\n<p><strong>&#8212; Admin Dashboard &#8212;</strong></p>\n<ul>\n<li>The admin dashboard shows a summary of statistics for your affiliate program, including a 7 day report of the total referrals, and commission earned by affiliates. It will also show the 5 latest referrals, activity logs, url clicks, newest coupons, and more.</li>\n</ul>\n<p><strong>&#8212; Admin Tools &#8212;</strong></p>\n<ul>\n<li>A variety of admin tools are available to make manging your affiliate program even easier. This includes tools to bulk generate new coupons, assign users to coupons, bulk edit coupons, bulk assign affiliates to orders, and more.</li>\n</ul>\n<p><strong>&#8212; Admin Reports &amp; Analytics &#8212;</strong></p>\n<ul>\n<li>\n<p>Get access to admin reports for the past 2 weeks. Reports allow you to see the overall WooCommerce coupon usage stats, and sales for all coupons, and each individual coupon, on a single page.</p>\n</li>\n<li>\n<p>With the Pro version get access to unlimited date range on the admin reports, export to CSV, and access to date comparison features, to compare analytics between 2 sets of dates.</p>\n</li>\n</ul>\n<p><strong>&#8212; Coupons List &amp; Dashboard Links &#8212;</strong></p>\n<ul>\n<li>In the WooCommerce coupons list, a new column will show a unique link to view the affiliate dashboard for that coupon yourself, or you can share this link with a user. Here you can also see a brief affiliate overview for each coupon, including the assigned affiliate. </li>\n</ul>\n<p><strong>&#8212; Plugin Customisation &amp; Settings &#8212;</strong></p>\n<ul>\n<li>A large variety of settings are available to modify all the plugins features, and affiliate dashboard, to meet your specific requirements.</li>\n</ul>\n<p><strong>&#8212; Orders Affiliate Info &#8212;</strong></p>\n<ul>\n<li>A new column will be added to the orders list, as well as a meta box widget in single orders. This will show coupon code used, affiliate user, commission for that order, and a link to the affiliate dashboard.</li>\n</ul>\n<p><strong>&#8212; Coupon Marketing Campaigns &amp; More &#8212;</strong></p>\n<ul>\n<li>The plugin can also be used for your coupon marketing campaigns, so you can view sales, usage statistics, etc for each of your coupons. Will also work great for influencer marketing, a refer a friend program, or managing an ambassador program.</li>\n</ul>\n<h3>🔥 Getting Started</h3>\n<p><strong>&#8212; Ready to increase sales with your new affiliate program? &#8212;</strong></p>\n<p>Setup your own affiliate WooCommerce system in minutes. Then launch your coupon affiliate marketing program to help increase your sales!</p>\n<p>To get started, simply add the shortcode [couponaffiliates] to a new page. This will assign it as the dashboard parent for generating the unique dashboard page links, which you can share with affiliates.</p>\n<p>Upon installation, a small setup wizard will help you get started and automatically generate the affiliate dashboard page for you.</p>\n<p><strong>&#8212; Migrating from another Affiliates Plugin? &#8212;</strong></p>\n<p>Migration of affiliate data to Coupon Affiliates is super simple, since for the most part it uses the existing data that&#8217;s stored by WooCommerce.</p>\n<p>Once you install the plugin, it will look back at the full order history for each coupon, even those created before the installation, and display the stats &amp; commission for these on the coupon affiliate dashboard. All you&#8217;ll need to do is assign your affiliate users to coupon codes, configure the settings, then you&#8217;re good to go!</p>\n<h3>⚡ Want more advanced features?</h3>\n<p>Coupon Affiliates PRO is a paid upgrade which provides a whole bunch of exciting addons and extra features to take your coupon affiliate system to the next level. This includes:</p>\n<ul>\n<li><a href=\"https://couponaffiliates.com/docs/pro-multi-level-affiliates\" rel=\"nofollow ugc\">Multi-Level Affiliates</a> (MLM) &#8211; Your users can become super-affiliates and invite other affiliates to be a part of their multi-level affiliate network. They will then earn extra commission from all their referrals.</li>\n<li><a href=\"https://couponaffiliates.com/docs/admin-reports-analytics\" rel=\"nofollow ugc\">Admin Reports &amp; Analytics (Advanced Filters)</a> &#8211; Access to the advanced filter options (unlimited date range &amp; comparisons) for the Admin Reports &amp; Analytics.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-affiliate-reports\" rel=\"nofollow ugc\">Affiliate Email Reports</a> &#8211; Automatically send an email report (and PDF) to affiliates every week/month with a summary of their recent commission and referral stats.</li>\n<li><a href=\"https://couponaffiliates.com/docs/affiliate-registration\" rel=\"nofollow ugc\">Advanced Registration Features</a> &#8211; Enable some more advanced affiliate registration features such as custom form fields, dynamic code generator, auto accept, auto registration, and more.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-creatives\" rel=\"nofollow ugc\">Creatives</a> &#8211; Display a creatives section with downloadable banners. Includes preview, download, and copy code buttons.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-bonuses\" rel=\"nofollow ugc\">Performance Bonuses</a> &#8211; Give your affiliates bonuses when they reach certain goals, such as some bonus commission once they reach a certain amount of sales.</li>\n<li><a href=\"https://couponaffiliates.com/docs/commission-tracking-and-payouts\" rel=\"nofollow ugc\">Commission Payout Tracking</a> &#8211; Affiliates can keep track of total UNPAID commission. Admins can view requested commission payouts from affiliates, and track/manage pending, complete and cancelled payouts.</li>\n<li><a href=\"https://couponaffiliates.com/docs/commission-tracking-and-payouts\" rel=\"nofollow ugc\">Commission Payout Requests</a> &#8211; Affiliates can request payouts for their pending commission. You can set a payment threshold for commission, and set a delay before commission can be claimed.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-stripe-payouts\" rel=\"nofollow ugc\">Stripe Payouts</a> &#8211; Automatically pay your affiliates in one-click with Stripe!</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-paypal-payouts\" rel=\"nofollow ugc\">PayPal Payouts</a> &#8211; Automatically pay your affiliates in one-click with PayPal Payouts!</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-store-credit\" rel=\"nofollow ugc\">Store Credit Payouts</a> &#8211; Automatically pay your affiliates into a wallet, in one-click, with Store Credit Payouts! Addons are available to integrate with wallet plugins such as TeraWallet or YITH Account Funds.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-monthly-summary-table\" rel=\"nofollow ugc\">Monthly Summary Table</a> &#8211; Show a table with a summary of monthly orders, and total statistics for that coupon for each month in the past 12 months (can be filtered to other months / previous years).</li>\n<li><a href=\"https://couponaffiliates.com/docs/line-graphs\" rel=\"nofollow ugc\">Line Graphs</a> &#8211; Line graphs on the &#8220;Statistics&#8221; tab to show commission earned, on a day by day bases, for past 90 days, 30 days, or 7 days.</li>\n<li><a href=\"https://couponaffiliates.com/docs/export-to-excel\" rel=\"nofollow ugc\">Export to Excel</a> &#8211; Enable a button on coupon pages to export an Excel (CSV) file with a 12 months summary of the individual coupons usage statistics for each month, or the recent orders table.</li>\n<li><a href=\"https://couponaffiliates.com/docs/flexible-commission-settings\" rel=\"nofollow ugc\">Custom Coupon Commission</a> &#8211; Set custom flexible commission amounts for individual coupons.</li>\n<li><a href=\"https://couponaffiliates.com/docs/flexible-commission-settings\" rel=\"nofollow ugc\">Custom Product Commission</a> &#8211; Set custom flexible commission amounts for individual products.</li>\n<li><a href=\"https://couponaffiliates.com/docs/flexible-commission-settings\" rel=\"nofollow ugc\">Custom User Role Commission</a> &#8211; Set custom flexible commission amounts for individual user roles.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-campaigns\" rel=\"nofollow ugc\">Campaigns (Referral URL)</a> &#8211; Allow your affiliates to create referral &#8220;campaigns&#8221; and then create custom URLs to track clicks/conversions per campaign.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-direct-link-tracking\" rel=\"nofollow ugc\">Direct Link Tracking (Referral URL)</a> &#8211; Affiliates can link directly to your website via their website without needing an affiliate link.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-social-sharing\" rel=\"nofollow ugc\">Social Sharing (Referral URL)</a> &#8211; Add social sharing buttons to the referral URL tab, so affiliates can instantly share their generated referral link.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-short-url\" rel=\"nofollow ugc\">Short URL Generator (Referral URL)</a> &#8211; Add a button to the referral URL tab, to allow affiliate users to generate a short URL for their referral link automatically.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-qr-codes\" rel=\"nofollow ugc\">QR Code Generator (Referral URL)</a> &#8211; Add a button to the referral URL tab, to allow affiliate users to automatically generate a QR code for their referral link.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-monthly-summary-table\" rel=\"nofollow ugc\">Monthly Summary Table</a> &#8211; Show a table with a summary of monthly orders, and total statistics for that coupon for each month in the past 12 months (can be filtered to other months / previous years).</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-lifetime-commission\" rel=\"nofollow ugc\">Lifetime Commission</a> &#8211; Option to enable &#8220;Lifetime Commission&#8221; functionality for affiliate referrals, so your affiliates get commission for every future sale by the customers they refer, even if they don&#8217;t use the coupon again.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-affiliate-landing-pages\" rel=\"nofollow ugc\">Affiliate Landing Pages</a> &#8211; Ability to link a landing page to an affiliate coupon, which will then work the same as a referral URL.</li>\n<li><a href=\"https://couponaffiliates.com/docs/subscriptions\" rel=\"nofollow ugc\">Subscriptions: Renewal Limit</a> &#8211; With the WooCommerce subscriptions plugin installed, optionally set a &#8220;limit&#8221; on how many renewals are rewarded. For example, you can set this to reward commission on the first 3 months.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-automated-conversion-rates\" rel=\"nofollow ugc\">Automated Conversion Rates</a> &#8211; Automatically update the multi-currency conversion rates every 12 hours via the Exchangerates API.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-custom-tabs\" rel=\"nofollow ugc\">Custom Dashboard Tabs</a> &#8211; Create your own tabs, to display custom sections and content on the affiliate dashboard.</li>\n<li>and <a href=\"https://couponaffiliates.com/roadmap\" rel=\"nofollow ugc\">more great features</a> coming soon&#8230;</li>\n</ul>\n<p>Learn more about Pro and upgrade at <a href=\"https://couponaffiliates.com\" rel=\"nofollow ugc\">www.couponaffiliates.com</a></p>\n<p><a href=\"https://couponaffiliates.com\" rel=\"nofollow ugc\">UPGRADE TO PRO</a></p>\n<h3>⚙️ Integrations</h3>\n<p>Coupon Affiliates was built exclusively as a WooCommerce Affiliate Plugin, however it can also be integrated with other popular eCommerce plugins such as LifterLMS, LearnDash, TutorLMS, MemberPress, and Paid Memberships Pro. <a href=\"https://couponaffiliates.com/docs-category/integrations\" rel=\"nofollow ugc\">Click here</a> to learn more. It also integrates well with other coupon plugins such as Smart Coupons, and Advanced Coupons.</p>\n<h3>📅 Roadmap</h3>\n<p>Want to know what new features we&#8217;re working on releasing in the future? Check out our <a href=\"https://couponaffiliates.com/roadmap\" rel=\"nofollow ugc\">roadmap</a>.</p>\n<h3>👍 Suggestions and Support</h3>\n<p>If you have any suggestions for additional functionality, need any help, or have found a bug, please <a href=\"https://couponaffiliates.com/contact\" rel=\"nofollow ugc\">get in touch</a>!</p>\n",
        "installation": "<ol>\n<li>Upload the &#8216;woo-coupon-usage&#8217; plugin to the &#8216;/wp-content/plugins/&#8217; directory.</li>\n<li>Activate the affiliate plugin through the &#8216;Plugins&#8217; menu in WordPress.</li>\n<li>Insert shortcode [couponaffiliates] into a page, to create the affiliate dashboard.</li>\n<li>Modify additional plugin settings found in WordPress admin under menu item &#8220;Coupon Affiliates&#8221;. View the &#8220;How To Use&#8221; tab for more instructions.</li>\n<li>Optional: Upgrade to the Pro version via &#8220;Coupon Affiliates&#8221; &gt; &#8220;Upgrade&#8221; on the admin menu for more advanced features.</li>\n</ol>\n",
        "faq": "\n<dt id='what%20is%20a%20%22coupon-based%22%20affiliate%20program%3F'>\nWhat is a &#8220;coupon-based&#8221; affiliate program?\n</h4>\n<p>\n<p>Coupon Affiliates enhances affiliate marketing by integrating coupons as a core feature. Unlike traditional affiliate systems that rely primarily on referral links, this plugin allows affiliates to share their unique coupon codes. These codes not only track sales for commission purposes but also offer customers immediate discounts or special offers, enriching the purchasing experience. However, the Coupon Affiliates system still maintains the flexibility of referral links; affiliates can share URLs that automatically apply their coupon at checkout, and even if a coupon isnt used, you can still make the link alone track referrals, ensuring affiliates receive credit for every sale referred​​.</p>\n</p>\n<dt id='will%20there%20be%20more%20features%20added%20in%20the%20future%3F'>\nWill there be more features added in the future?\n</h4>\n<p>\n<p>Yes! New features are added frequently, most of which are based on feedback. So if you have any suggestions to help improve the coupon affiliates plugin, please get in touch!</p>\n</p>\n<dt id='will%20this%20work%20with%20my%20existing%20coupons%20and%20orders%3F'>\nWill this work with my existing coupons and orders?\n</h4>\n<p>\n<p>Yes, once you install the plugin it will look back at the full order history for each coupon, even those created before the installation, and display the stats for these on the coupon affiliate dashboard too.</p>\n</p>\n<dt id='how%20do%20the%20affiliate%20referral%20urls%20work%3F'>\nHow do the affiliate referral URLs work?\n</h4>\n<p>\n<p>A referral URL is automatically generated for the affiliate, and can be found on their dashboard. This link can then be shared by the affiliate. Anyone that visits the website using that link, will have the coupon code automatically applied to their account on checkout. Clicks are also tracked, and any sales made via the coupon are tracked as conversions.</p>\n</p>\n<dt id='can%20i%20assign%20affiliate%20users%20to%20coupons%3F'>\nCan I assign affiliate users to coupons?\n</h4>\n<p>\n<p>Yes, you can assign affiliate users to coupons, which will give them direct access to their affiliates dashboard page, without needing to use a unique link. <a href=\"https://couponaffiliates.com/docs/assign-users-to-coupons\" rel=\"nofollow ugc\">Click here</a> to learn more.</p>\n</p>\n<dt id='what%20kind%20of%20coupon%20usage%20statistics%20are%20shown%3F'>\nWhat kind of coupon usage statistics are shown?\n</h4>\n<p>\n<p>On the coupon affiliate dashboard, you (and your affiliates) will be able to see a variety of statistics including total uses, discount type, orders total, amount saved, commission earned, and more. You will also be able to see a recent order table (with general info such as date, order total, discount, products, commission etc), and with the pro version you can see a monthly orders/commission summary table for the past 12 months.</p>\n</p>\n<dt id='gdpr%20%26%20privacy'>\nGDPR &amp; Privacy\n</h4>\n<p>\n<p>All data used and created by the Coupon Affiliates plugin is stored on your own website. We don&#8217;t track or collect ANY of your affiliate program data ourselves. You can <strong>optionally</strong> opt-in to share some basic usage data which helps us with providing support, fixing bugs, and improving the plugin, and can also opt-out at any time.</p>\n</p>\n<dt id='do%20you%20provide%20support%3F'>\nDo you provide support?\n</h4>\n<p>\n<p>Yes. If you need any help setting up the affiliate plugin, please free to <a href=\"https://wordpress.org/support/plugin/woo-coupon-usage/#new-topic-0\" rel=\"ugc\">get in touch</a> and we&#8217;ll be happy to help!</p>\n</p>\n<dt id='how%20can%20i%20report%20issues%2Fbugs%20with%20the%20plugin%3F'>\nHow can I report issues/bugs with the plugin?\n</h4>\n<p>\n<p>You can report feature bugs by creating a <a href=\"https://wordpress.org/support/plugin/woo-coupon-usage/#new-topic-0\" rel=\"ugc\">support ticket</a>. Please provide as much information as possible to make it easier for us to find a solution for you.</p>\n</p>\n<dt id='how%20can%20i%20report%20security%20bugs%3F'>\nHow can I report security bugs?\n</h4>\n<p>\n<p>You can report security bugs through the Patchstack Vulnerability Disclosure Program. The Patchstack team help validate, triage and handle any security vulnerabilities. <a href=\"https://patchstack.com/database/vdp/woo-coupon-usage\" rel=\"nofollow ugc\">Report a security vulnerability.</a></p>\n</p>\n\n",
        "changelog": "<h4>Version 5.15.1 &#8211; 29th August 2024</h4>\n<ul>\n<li>Tweak: (PRO) Improved the performance of the admin WooCommerce orders page which was being affected in some cases by the plugin.</li>\n<li>Tweak: Changed the names and titles for the &#8220;Coupons&#8221; and &#8220;Orders&#8221; pages under the &#8220;Coupon Affiliates&#8221; admin menu.</li>\n<li>Tweak: Only show &#8220;If you are having issues&#8221; message on admin reports if a potential issue is detected.</li>\n<li>Fix: A speculative fix to the affiliate registration form not working in some cases where security plugins were stopping user registrations and forcing strong passwords.</li>\n<li>Fix: Fixed an issue on the free version, in some cases displaying the following error message on the affiliate dashboard: &#8220;wcusage_run_tab_page_stats_graph_update is not defined&#8221;</li>\n<li>Fix: (PRO) Fixed a possible PHP error with the performance bonuses when the &#8220;User Restrictions&#8221; user role option was enabled.</li>\n<li>Other: Updated translations.</li>\n</ul>\n<h4>Version 5.15.0 &#8211; 20th August 2024</h4>\n<ul>\n<li>New: (PRO) Added a leaderboards feature that lets you display a leaderboard of your top affiliates using a shortcode: [couponaffiliates-leaderboard]. You can set the number of affiliates to display, and the time period to show the stats for (all, month, or year).</li>\n<li>Tweak: Removed the &#8220;Orders&#8221; section from the setup wizard.</li>\n</ul>\n<h4>Version 5.14.6.1 &#8211; 14th August 2024</h4>\n<ul>\n<li>Tweak: (PRO) Clear the &#8220;wcu_store_credit_in_cart&#8221; user meta when an order is placed by the user.</li>\n<li>Fix: (PRO) Fixed an issue with applying store credit on cart (with the built-in credit system) not showing the correct amount in some cases.</li>\n</ul>\n<h4>Version 5.14.6 &#8211; 12th August 2024</h4>\n<ul>\n<li>Tweak: (PRO) Increased the maximum number of &#8220;Template Coupons&#8221; that can be set with the &#8220;Multiple Templates&#8221; feature to 10.</li>\n<li>Fix: Fixed some HTML formatting issues on the affiliate dashboard in some cases.</li>\n<li>Fix: (PRO) Fixed an issue with the dynamic code generator not working properly with custom text in the template in some cases.</li>\n<li>Fix: (PRO) Fixed an issue with the responsive navigation when both the normal and MLA dashboard shortcodes are used on the same page.</li>\n<li>Fix: (PRO) Fixed an issue with applying store credit on cart (with the built-in credit system) not showing the correct amount when the store has inclusive tax enabled.</li>\n<li>Fix: (PRO) Fixed an issue with the payout request button if the available credit was exactly the same as the minimum payout amount.</li>\n<li>Other: Updated to Freemius SDK 2.7.4</li>\n</ul>\n<h4>Version 5.14.5 &#8211; 5th August 2024</h4>\n<ul>\n<li>Fix: Fixed an issue where in some cases applying a coupon manually on checkout would not automatically refresh the cart totals until the page is manually refreshed.</li>\n<li>Fix: (PRO) Fixed an issue with applying store credit on cart (with the built-in credit system) not showing the correct amount when the store has inclusive tax enabled.</li>\n<li>Other: Tested with WordPress 6.6.1</li>\n</ul>\n<h4>Version 5.14.4 &#8211; 31st July 2024</h4>\n<ul>\n<li>Fix: (PRO) Fixed an issue with performance bonuses on the affiliate dashboard, not showing the correct price format for EUR and some other currency formats.</li>\n<li>Fix: (PRO) Fixed the responsive navigation on the multi-level affiliate dashboard for mobile.</li>\n</ul>\n<h4>Version 5.14.3 &#8211; 18th July 2024</h4>\n<ul>\n<li>Tweak: As an admin, when viewing the affiliate dashboard for another users coupon, it now shows their username in the header, and their account details in the settings tab, with a link to edit that user.</li>\n<li>Tweak: (PRO) As an admin, when viewing the affiliate dashboard for another users coupon, you can now view and edit that affiliate users payouts settings.</li>\n<li>Tweak: (PRO) Made some small changes to the commission line charts.</li>\n<li>Fix: (PRO) Fixed a small issue with the performance bonus options since the last update.</li>\n<li>Fix: Fixed an issue with unlinking affiliates from coupons on the &#8220;Affiliate Users&#8221; admin page.</li>\n<li>Fix: (PRO) Fixed an issue with the new mobile navigation dropdown not working for custom tabs (since 5.14.0).</li>\n<li>Fix: (PRO) Fixed an issue with the commission line graph not loading when the &#8220;Show Commission Earnings summary with toggles&#8221; option is disabled.</li>\n<li>Fix: Fixed an issue with the option to allow users to join the affiliate program on checkout not working in some cases.</li>\n<li>Fix: Fixed an issue with the &#8220;{listproducts}&#8221; merge tag not working for the &#8220;New Order Referral&#8221; email notifications.</li>\n<li>Dev: Added some extra classess to certain elements on the affiliate dashboard to allow for easier custom styling.</li>\n<li>Other: Added &#8220;WooCommerce&#8221; as a &#8220;Required Plugin&#8221; in the plugin header comment.</li>\n<li>Other: Tested with WordPress 6.6.0</li>\n<li>Other: Tested with WooCommerce 9.1.2</li>\n</ul>\n<h4>Version 5.14.2 &#8211; 15th July 2024</h4>\n<ul>\n<li>New: Added a &#8220;Newly Created&#8221; trigger to the performance bonuses which now allows you to give a welcome bonus to new affiliates.</li>\n<li>Tweak: Added an option to set a prefix for the coupon code shown in the header of the affiliate dashboard.</li>\n<li>Tweak: Added a login link to the message shown when the affiliate registration form is submitted but the username or email already exists.</li>\n<li>Tweak: (PRO) Edited the number fields for the MLA tier commission rates to be incrementing by decimals to allow for decimal values.</li>\n<li>Fix: Fixed an issue with the referral URL links not working properly when the sites permalink structure is set to &#8220;Plain&#8221;.</li>\n<li>Fix: (PRO) Fixed an issue with the MLA invite links not working properly when the sites permalink structure is set to &#8220;Plain&#8221;.</li>\n<li>Fix: Fixed an issue with the &#8220;Coupon Referral Orders&#8221; admin page sometimes being a little slow since 5.14.0.</li>\n<li>Fix: (PRO) Fixed an issue with the affiliate registration checkbox custom field, when set to required.</li>\n<li>Fix: Fixed some admin pages that were giving the following PHP warning: Function wpdb::prepare was called incorrectly.</li>\n<li>Fix: Fixed a PHP warning sometimes showing when submitting the affiliate registration form.</li>\n<li>Fix: Fixed some PHP warnings in the admin area (&#8220;preg_replace(): Passing null to parameter&#8221;).</li>\n<li>Other: Updated to Freemius SDK 2.7.2</li>\n</ul>\n<h4>Version 5.14.1 &#8211; 29th June 2024</h4>\n<ul>\n<li>Fix: Fixed a few small styling issues on the affiliate dashboard since the last update.</li>\n</ul>\n<h4>Version 5.14.0 &#8211; 28th June 2024</h4>\n<ul>\n<li>Improvement: Updated the affiliate dashboard navigation on mobile to be more user-friendly. It now uses a dropdown menu for the tabs.</li>\n<li>Improvement: Made several small styling and layout tweaks to the affiliate dashboard on mobile.</li>\n<li>Fix: Fixed an issue with the affiliate registration system when multiple templates are enabled.</li>\n<li>Fix: Fixed an issue with the total items and pagination on the &#8220;Coupon Referral Orders&#8221; admin page.</li>\n<li>Fix: (PRO) Fixed an issue with the &#8220;Commission Priority&#8221; option not defaulting automatically to the &#8220;Product&#8221; option, even though it was showing as selected.</li>\n<li>Other: Tested with WordPress 6.5.5</li>\n<li>Other: Tested with WooCommerce 9.0.2</li>\n</ul>\n<h4>Version 5.13.1 &#8211; 12th June 2024</h4>\n<ul>\n<li>Improvement: Added an option to choose which order status the &#8220;New Order Referral&#8221; email is sent for, rather than being limited to &#8220;Completed&#8221; orders.</li>\n<li>Improvement: Added new &#8220;Affiliate Information&#8221; to the admin new order emails.</li>\n<li>Tweak: Added shortcode to display payouts section: [couponaffiliates-payouts]</li>\n<li>Fix: Fixed an issue with the &#8220;Disable registration form for existing affiliate users&#8221; setting.</li>\n<li>Fix: (PRO) Fixed an issue with the auto accept affiliate registrations option when multiple templates is disabled.</li>\n<li>Fix: (PRO) Fixed an issue with commission still showing in the monthly summary products list with &#8220;Enable Commission Calculations &amp; Statistics&#8221; disabled.</li>\n<li>Other: Tested with WordPress 6.5.4</li>\n<li>Other: Tested with WooCommerce 8.9.3</li>\n</ul>\n<h4>Version 5.13.0 &#8211; 25th April 2024</h4>\n<ul>\n<li>New: (PRO) Added new mailing list integrations to automatically add affiliate users to your mailing list.</li>\n<li>Tweak: Added [couponaffiliates_store_credit_apply] shortcode to display field to apply store credit to cart. Can be used on the checkout if WooCommerce block checkout is enabled.</li>\n<li>Tweak: Updated the &#8220;Coupon Referral Orders&#8221; page to properly show 20 orders per page. Previously it would hide non-coupon orders but still count them in the pagination.</li>\n<li>Fix: (PRO) Fixed an issue with the template coupon &#8220;multiple templates&#8221; when manually adding a new affiliate user.</li>\n<li>Fix: (PRO) Fixed an issue with the &#8220;Copy Code&#8221; button on the &#8220;Creatives&#8221; tab sometimes including a diplicate &#8220;https&#8221; in the referral URL.</li>\n</ul>\n<h4>Version 5.12.17 &#8211; 16th April 2024</h4>\n<ul>\n<li>Tweak: Made some small tweaks to the mobile responsive design of the affiliate dashboard.</li>\n<li>Tweak: When &#8220;Hide the &#8220;all-time&#8221; stats on statistics tab and line graph&#8221; is enabled, it will no longer waste time calculating the all-time stats on first load of the affiliate dashboard.</li>\n<li>Tweak: (PRO) Updated the QR Code generator used for the dynamic creatives to use a local library (chillerlan/php-qrcode) instead of the Google Charts API.</li>\n<li>Tweak: (PRO) Updated the email PDF reports to display in the correct WooCommerce currency format.</li>\n<li>Tweak: (PRO) Made a few changes to the &#8220;Delay Commission (Number of Days)&#8221; code to make it more reliable and faster in certain cases.</li>\n<li>Fix: Fixed an issue with the all-time stats not updating in some cases for new coupons.</li>\n<li>Fix: (PRO) Fixed an issue with the &#8220;Make the invoice upload option required&#8221; setting when disabled still requiring the invoice upload.</li>\n<li>Other: Tested with WordPress 6.5.2</li>\n<li>Other: Updated to Freemius SDK 2.7.0</li>\n</ul>\n<h4>Version 5.12.16 &#8211; 4th April 2024</h4>\n<ul>\n<li>Fix: (PRO) Fixed an issue with the &#8220;template&#8221; attribute on the [couponaffiliates-register] shortcode not working in some cases.</li>\n<li>Fix: Fixed a text/HTML formatting issue on the single order page for some websites.</li>\n<li>Other: Tested with WordPress 6.5.0</li>\n</ul>\n<h4>Version 5.12.15 &#8211; 22nd March 2024</h4>\n<ul>\n<li>Tweak: (PRO) Small tweak to the MLA referral email to not send in certain cases.</li>\n<li>Fix: Fixed a text/HTML formatting issue on the Statistics tab of the affiliate dashboard in some cases, since the 5.12.9 update.</li>\n</ul>\n<h4>Version 5.12.14 &#8211; 20th March 2024</h4>\n<ul>\n<li>Fix: Fixed an &#8220;Array to string conversion&#8221; PHP error on the settings page for some of the dropdown options, since the 5.12.9 update.</li>\n</ul>\n<h4>Version 5.12.13 &#8211; 20th March 2024</h4>\n<ul>\n<li>Fix: Fixed an issue on the edit coupon page, with no longer being able to select an affiliate user from the dropdown.</li>\n<li>Fix: (PRO) Fixed a PHP warning on the &#8220;Product Rates&#8221; tab on the affiliate dashboard.</li>\n<li>Other: Tested with WooCommerce 8.7.0</li>\n</ul>\n<h4>Version 5.12.12 &#8211; 14th March 2024</h4>\n<ul>\n<li>Tweak: Made a few small security enhancements to some SQL calls in the plugin for future proofing.</li>\n</ul>\n<h4>Version 5.12.11 &#8211; 12th March 2024</h4>\n<ul>\n<li>Fix: Fixed a few more text/HTML formatting issues since the 5.12.9 update.</li>\n<li>Fix (PRO): Fixed a PHP warning when editing users with MLA enabled.</li>\n</ul>\n<h4>Version 5.12.10 &#8211; 8th March 2024</h4>\n<ul>\n<li>Fix: Fixed a few text/HTML formatting issues since the last update.</li>\n</ul>\n<h4>Version 5.12.9 &#8211; 7th March 2024</h4>\n<ul>\n<li>Tweak: Made a variety of small code tweaks and improvements to the plugin, including some additional &#8220;escaping&#8221; of data.</li>\n<li>Other: Tested with WordPress 6.4.3</li>\n</ul>\n<h4>Version 5.12.8 &#8211; 7th March 2024</h4>\n<ul>\n<li>Improvement: Added new &#8220;template&#8221; attribute to the [couponaffiliates-register] shortcode to allow you to set the default template coupon (if you have multiple templates). This will hide the field and auto-select that coupon when users register with that form. Example usage: [couponaffiliates-register template=&#8221;my-template-coupon&#8221;]</li>\n<li>Fix: Fixed the password reset link included in the new affiliate user account email in some cases not working.</li>\n<li>Fix: Fixed a PHP error on the settings page for some sites on older versions of WooCommerce.</li>\n<li>Fix: Fixed an issue with copying the referral URLs on the admin &#8220;Coupons&#8221; and &#8220;Affiliate Users&#8221; pages.</li>\n<li>Fix: Fixed a security bug reported by Patchstack.</li>\n</ul>\n<h4>Version 5.12.7 &#8211; 24th January 2024</h4>\n<ul>\n<li>Fix: Fixed an issue with the &#8220;Coupon Affiliate&#8221; meta box not showing any more on the single orders pages for some websites.</li>\n<li>Fix: Fixed an error on the &#8220;Coupon Affiliate Users&#8221; admin page in some cases.</li>\n</ul>\n<h4>Version 5.12.6 &#8211; 19th January 2024</h4>\n<ul>\n<li>Tweak: Small change to the &#8220;Coupon Orders&#8221; page query to improve performance and HPOS compatibilty.</li>\n<li>Fix: Fixed an error on the &#8220;Coupons&#8221; admin page in some cases.</li>\n</ul>\n<h4>Version 5.12.5 &#8211; 19th January 2024</h4>\n<ul>\n<li>Tweak: Small tweaks to the new QR code generator.</li>\n<li>Fix: Fixed the &#8220;Name&#8221; column on the &#8220;Recent Orders&#8221; tab of the affiliate dashboard, sometimes being blank in certain cases.</li>\n<li>Fix: Fixed some PHP errors that some users were experiencing on the coupons and coupon orders pages.</li>\n<li>Other: Tested with WooCommerce 8.5.1</li>\n</ul>\n<h4>Version 5.12.4 &#8211; 15th January 2024</h4>\n<ul>\n<li>New: (PRO) Added a color picker under the QR code generator, to allow affiliates to change the color of the QR code.</li>\n<li>Tweak: (PRO) Update the QR code generator to no longer use the Google Charts API, and instead use a local QR code generator library with no dependencies.</li>\n<li>Tweak: Made a few small optimisations to the code run when referral links are clicked. When the &#8220;Enable Click History Logs&#8221; option is disabled, it will no longer log the clicks in the database.</li>\n<li>Fix: Fixed an issue with admin reports &#8220;only show coupons assigned to an affiliate user&#8221; option not working when disabled, to show coupons without an affiliate user assigned in the reports.</li>\n<li>Fix: Fixed the &#8220;Name&#8221; column on the &#8220;Recent Orders&#8221; tab of the affiliate dashboard, sometimes being blank in certain cases. It will now show the username or &#8220;Guest&#8221; if name is empty.</li>\n<li>Other: Updated to Freemius SDK 2.6.2</li>\n</ul>\n<h4>Version 5.12.3 &#8211; 22nd December 2023</h4>\n<ul>\n<li>Improvement: Admin reports will now load faster, especially when the &#8220;only show coupons assigned to an affiliate user&#8221; option is selected.</li>\n<li>Improvement: On the Coupon Affiliate Users page, hovering over the username will now show a tooltip with all the affiliate user details that were submitted on the registration form.</li>\n<li>Tweak: When the &#8220;Hide commission statistics for non-affiliate coupons&#8221; option is enabled, it will not give &#8220;unpaid commission&#8221; to coupons that do not have an affiliate user assigned to it.</li>\n<li>Tweak: Made a few small tweaks/improvements to the code for setting the cookies when a referral link is clicked.</li>\n<li>Fix: Fixed a few small bugs with admin reports.</li>\n<li>Fix: Removed HTML tags from the notification emails if the {commission} merge tag is used.</li>\n<li>Dev: Added some extra hooks for when affiliate registrations are created, accepted, and declined.</li>\n</ul>\n<h4>Version 5.12.2 &#8211; 14th December 2023</h4>\n<ul>\n<li>New: (PRO) Added a &#8220;Quarterly&#8221; option to the &#8220;Scheduled Payout Requests&#8221; and &#8220;Affiliate Email Reports&#8221; features.</li>\n<li>Tweak: On the affiliate dashboard, if the discount is 0% and free shipping is enabled, it will now say &#8220;Free Shipping&#8221; in the &#8220;Discount&#8221; box on the &#8220;Statistics&#8221; tab.</li>\n<li>Tweak: Prevent duplicate affiliate registration submissions from the same user within a short time period.</li>\n<li>Tweak: No longer send the admin &#8220;New Affiliate Application&#8221; email when the affiliate user was added by an admin.</li>\n<li>Tweak: (PRO) Updated styling on the download qr code button to match the other buttons.</li>\n<li>Tweak: Improved inconsistent spacing of certain content/sections on affiliate dashboard on certain themes.</li>\n<li>Fix: Fixed the &#8220;Generate Dashboard Page&#8221; button on the setup wizard not working in certain cases.</li>\n<li>Other: Added Freemius multi-site support.</li>\n<li>Other: Tested with WooCommerce 8.4.0</li>\n</ul>\n<h4>Version 5.12.1 &#8211; 12th December 2023</h4>\n<ul>\n<li>Tweak: Improved the speed/performance of loading the affiliate data on the WooCommerce orders page in some cases.</li>\n<li>Tweak: On the &#8220;Product Commission Rates&#8221; table, the &#8220;Commission Rate&#8221; column will no longer show 0% if there is no percentage commission whilst there is a fixed commission.</li>\n<li>Fix: (PRO) Fixed issue with the store credit option sometimes not showing on the cart for certain themes.</li>\n</ul>\n<h4>Version 5.12.0 &#8211; 7th December 2023</h4>\n<ul>\n<li>New: Added a new &#8220;Referred Order Cancelled&#8221; email notification, which is sent to the affiliate when an order is cancelled, refunded, or failed. This can be enabled in the &#8220;Emails&#8221; settings tab.</li>\n<li>New: On the &#8220;Coupon Affiliate Users&#8221; admin page, the tooltip shown when hovering over the coupon code, will now show the default referral link for the affilaite coupon, along with a copy button.</li>\n<li>New: On the &#8220;Coupons&#8221; admin page for the plugin, there is now a new &#8220;Default Referral Link&#8221; column, which shows the default referral link for the coupon, along with a copy button.</li>\n<li>New: Added some new options to customise the affiliate dashboard tabs styling in the &#8220;Design&#8221; settings tab. There is now a new &#8220;full width&#8221; style available, along with the option to select a custom border radius and padding.</li>\n<li>New: Added an option to set a custom &#8220;Preferred Coupon Code&#8221; field label on the affiliate registration form.</li>\n<li>Improvement: You can now easily include the default referral link in the &#8220;Affiliate Application Accepted&#8221; email by using the {referralurl}</li>\n<li>Tweak: (PRO) Hidden the &#8220;MLA&#8221; dashboard link on the WordPress users page if MLA is set to invite only, and the user does not have access.</li>\n<li>Tweak: (PRO) If MLA Dashboard is set to &#8220;Invite Only&#8221;, admins can now still view view the MLA Dashboard for any user if they themselves are not approved.</li>\n<li>Tweak: (PRO) Added the &#8220;pointer&#8221; cursor style to the export buttons on the affiliate dashboard.</li>\n<li>Tweak: Moved the &#8220;Affiliate&#8221; link on the &#8220;My Account&#8221; page to before the logout link.</li>\n<li>Tweak: A few small improvements to the plugins &#8220;Coupons&#8221; admin page.</li>\n<li>Fix: (PRO) Fixed a PHP warning when MLA is enabled but the MLA dashboard page has not been selected in the settings.</li>\n<li>Fix: (PRO) Fixed the &#8220;Unpaid Commission&#8221; and &#8220;Pending Payouts&#8221; fields when editing a coupon, to allow you to enter decimal values.</li>\n<li>Fix: (PRO) The store credit balance amount shown on the affiliate dashboard &#8220;payouts settings&#8221; is now formatted to show as a currency value.</li>\n<li>Dev: Added a filter to programmatically change the page ID for the affiliate dashboard option, and MLA dashboard option.</li>\n<li>Other: Added translations for &#8220;Italian&#8221;.</li>\n<li>Other: Tested with WordPress 6.4.2</li>\n<li>Other: Updated to Freemius SDK 2.6.1</li>\n</ul>\n<h4>Version 5.11.2 &#8211; 28th November 2023</h4>\n<ul>\n<li>Fix: Fixed &#8220;DONOTCACHEPAGE constant is already defined&#8221; PHP error in certain cases.</li>\n<li>Other: Tested with WooCommerce 8.3.1</li>\n</ul>\n<h4>Version 5.11.1 &#8211; 18th November 2023</h4>\n<ul>\n<li>Tweak: Now show an error message on the affiliate dashboard if jQuery is not loaded, and ajax loading is enabled in the settings.</li>\n<li>Fix: Added a fix for a conflict with the &#8220;FlyingPress&#8221; plugin, which was causing the affiliate dashboard to not load in certain cases.</li>\n<li>Fix: Added a fix for conflicts with several other caching plugins, by defining DONOTCACHEPAGE constant on the affiliate dashboard page.</li>\n</ul>\n<h4>Version 5.11.0 &#8211; 15th November 2023</h4>\n<ul>\n<li>New: (PRO) Added a new admin &#8220;Create Payout Request&#8221; page, to allow you to manually submit payout requests for affiliates that have &#8220;unpaid commission&#8221; available.</li>\n<li>Tweak: Updated the referral link &#8220;Default Page&#8221; setting to always check the domain matches the site URL.</li>\n<li>Tweak: Made a few styling changes to the plugins admin pages.</li>\n<li>Tweak: Made a few tweaks to the setup wizard, and also removed the &#8220;Style&#8221; step.</li>\n<li>Other: Added translations for &#8220;Portuguese (Portugal)&#8221;.</li>\n</ul>\n<h4>Version 5.10.2 &#8211; 11th November 2023</h4>\n<ul>\n<li>Tweak: Made a few tweaks to the settings page and setup wizard.</li>\n<li>Tweak: Edited the labels for the &#8220;Commission Amounts&#8221; settings to be more clear. </li>\n<li>Fix: Fixed an issue with the affiliate registration form captcha not working with allow_url_fopen disabled.</li>\n<li>Fix: Fixed an issue with the affiliate registration form auto-login not working when Simple Cloudflare Turnstile plugin is enabled.</li>\n<li>Other: Updated translations.</li>\n</ul>\n<h4>Version 5.10.1 &#8211; 10th November 2023</h4>\n<ul>\n<li>Tweak: Increased the maximum file size for PDF invoice uploads to 400KB.</li>\n<li>Tweak: Made a few small changes to the admin settings page.</li>\n<li>Tweak: Made a few small changes to the setup wizard, with some new information on the final step.</li>\n<li>Tweak: Added a simple new option to Show or Hide the &#8220;Recent Orders&#8221; tab on the affiliate dashboard.</li>\n<li>Fix: Fixed a PHP error in certain occasions when generating admin reports.</li>\n<li>Fix: Fixed some events not showing in the Activity Log in certain cases.</li>\n<li>Fix: Fixed an issue with PDF invoice uploads not working in certain cases.</li>\n<li>Fix: Show the &#8220;percent_per_product&#8221; discount type as a percentage on the affiliate dashboard.</li>\n<li>Other: Updated to Freemius SDK 2.6.0</li>\n<li>Other: Tested with WordPress 6.4.1</li>\n</ul>\n<h4>Version 5.10.0 &#8211; 25th October 2023</h4>\n<ul>\n<li>New: (PRO) Added new &#8220;Performance Rewards &amp; Bonuses&#8221; module. This allows you to reward your affiliates with bonuses and rewards, based on their performance. <a href=\"https://couponaffiliates.com/docs/pro-bonuses\" rel=\"nofollow ugc\">Learn More</a>.</li>\n<li>Improvement: (PRO) Added 2 new &#8220;Extra Field&#8221; options for the &#8220;Bank Transfer&#8221; payout method. Also made the &#8220;Bank Transfer&#8221; details fields required on the affiliate dashboard settings tab, so they can not be left blank.</li>\n<li>Improvement: Added some bulk actions to the admin &#8220;Affiliate Users&#8221; list page, to allow you to bulk delete users and their coupons, or bulk unassign users from coupons.</li>\n<li>Improvement: Added an &#8220;Actions&#8221; column to the plugins admin &#8220;Coupons&#8221; list page, with links to edit or delete the coupon.</li>\n<li>Tweak: (PRO) Changed the &#8220;Unpaid Commission&#8221; and &#8220;Pending Payments&#8221; fields when editing a coupon to number fields to prevent invalid values being entered.</li>\n<li>Tweak: (PRO) Removed the &#8220;Coupon Code&#8221; field on the &#8220;Add New Affiliate&#8221; when the &#8220;Dynamic Code Generator&#8221; is enabled. Made the field required when it is shown.</li>\n<li>Tweak: Modified the &#8220;Add New Affiliate&#8221; form to redirect to the &#8220;Affiliate Users&#8221; list page. It now also shows a &#8220;Custom Message&#8221; field to include a custom message in the email sent to the user. The checkbox to automatically accept has also been removed, and it will now always automatically accept the user.</li>\n<li>Tweak: Made a few CSS tweaks/fixes to the affiliate dashboard on mobile.</li>\n<li>Tweak: Switched the admin CSS styles to use the &#8220;wp_enqueue_style&#8221; function.</li>\n<li>Tweak: Automatically unassign user ID from coupons if a user is deleted.</li>\n<li>Tweak: Improved query for admin coupons list page, to no longer show coupons when the affiliate user has been deleted.</li>\n<li>Tweak: The &#8220;Activity Log&#8221; will now only show &#8220;new order referral&#8221; logs when the order used a coupon that has an affiliate user assigned to it.</li>\n<li>Fix: Fixed a PHP error in some cases when generating admin reports, causing the report to fail and show 0 for all values.</li>\n<li>Fix: Added compatibility with the Wordfence login reCAPTCHA when submitting the affiliate registration form.</li>\n<li>Fix: Fixed issue with affiliate registration form not submitting correctly when a CAPTCHA plugin is being used for login security.</li>\n<li>Fix: The Turnstile and reCAPTCHA scripts are now enqueued using the &#8220;wp_enqueue_script&#8221; function, and should no longer conflict with the &#8220;Simple Cloudflare Turnstile&#8221; plugin.</li>\n<li>Fix: Fixed a PHP warning in certain occasions when updating a user in the admin area.</li>\n<li>Fix: Fixed an error on the admin &#8220;Referral Visits&#8221; page when clicking &#8220;View all visits for this referrer&#8221; link, if site is on a subdirectory.</li>\n<li>Fix: Fixed a few instances where /wp-admin was being used instead of admin_url() causing issues on sites which are not installed in the root directory or using a custom /wp-admin path.</li>\n<li>Fix: Fixed an issue with the admin manual &#8220;add new affiliate&#8221; form when the &#8220;Use the email address as username&#8221; option was enabled.</li>\n<li>Fix: Fixed a rare PHP error occuring in some cases when manually adding a new affiliate user, in certain cases.</li>\n<li>Fix: Fixed a few other PHP warnings.</li>\n<li>Other: Tested with WordPress 6.4.0</li>\n</ul>\n"
    },
    "short_description": "Easily build a coupon based affiliate program for WooCommerce, track commission, and display coupon statistics on a user-friendly affiliate dashboard.",
    "description": "<p>Coupon Affiliates allows you to easily create an advanced coupon-based affiliate program for WooCommerce, to grow traffic and increase sales.</p>\n<p>With this plugin you can give your affiliates access to a user-friendly affiliate dashboard for their coupons, to view coupon usage statistics, recent orders, commission earned, referral URLs and more.</p>\n<p><strong>Why is Coupon Affiliates the best WooCommerce affiliate plugin?</strong></p>\n<ul>\n<li><strong>Unique</strong> &#8211; The only plugin that is built specifically for creating a &#8220;coupon based&#8221; affiliate program for WooCommerce.</li>\n<li><strong>Quick &amp; Easy to Use</strong> &#8211; Get your affiliate program setup quickly and easily! The plugin is easy to use for you and your affiliates.</li>\n<li><strong>User Friendly</strong> &#8211; The affiliate dashboard is user friendly, visually pleasing, and includes lots of features your affiliates will love.</li>\n<li><strong>Transparency</strong> &#8211; Build trust with your affiliates, by giving them transparent access to the important statistics they want to see, in real-time, directly on their WooCommerce affiliate dashboard.</li>\n<li><strong>Lots of Customisations</strong> &#8211; The plugin comes with plenty of useful settings to make the affiliate program work exactly how you want.</li>\n<li><strong>Friendly Support</strong> &#8211; UK-based support is available to both our free and paid users, regarding setup, customisations and more.</li>\n<li><strong>Built for WooCommerce</strong> &#8211; This affiliate plugin is developed exclusively for WooCommerce, the best eCommerce platform.</li>\n<li><strong>Easy Migration</strong> &#8211; Migration from other affiliates plugins is super simple, since the plugin will display the full order history for each affiliate coupon (even orders created before installing the plugin).</li>\n<li><strong>Frequent Updates</strong> &#8211; We are always working on adding new awesome features to Coupon Affiliates. Got a suggestion? Let us know!</li>\n</ul>\n<h3>🎉 Plugin Features</h3>\n<p><strong>&#8212; Affiliate Dashboard &#8212;</strong></p>\n<ul>\n<li>On the affiliate dashboard, you and your affiliates can view detailed statistics for their referral coupon, including total usage, recent order details, referral URL generator, conversions statistics, and lots more.</li>\n</ul>\n<p><strong>&#8212; Accurate Commission Tracking &#8212;</strong></p>\n<ul>\n<li>\n<p>Affiliates can see the total commission earned via their coupon, and for each individual order in the recent orders list.</p>\n</li>\n<li>\n<p>There are 3 types of commission amounts, including fixed commission “per product”, “per order”, and a &#8220;percentage&#8221; of the total order. You can even set all 3 for more flexible commission calculations!</p>\n</li>\n</ul>\n<p><strong>&#8212; Recent Orders List &#8212;</strong></p>\n<ul>\n<li>\n<p>Affiliates can view a recent order list for their coupon, with general info such as date, order subtotal, discount, total, products purchased, commission earned etc. A monthly orders/commission summary is also included in the PRO version.</p>\n</li>\n<li>\n<p>This can be filtered by date or order status, and also shows combined totals for all orders within the date range selected.</p>\n</li>\n</ul>\n<p><strong>&#8212; Affiliate Referral URLs &#8212;</strong></p>\n<ul>\n<li>\n<p>Affiliates can generate a referral URL via the affiliate tool which automatically applies the coupon at checkout for visitors using their link.</p>\n</li>\n<li>\n<p>They can also view total clicks, usage, and conversion rate for their referral URL on the affiliate dashboard, along with a detailed log of all of their individual clicks.</p>\n</li>\n<li>\n<p>If required, you can enable an option to track conversions via the referral URL even if coupon was not used. If enabled, if someone visits the site via the referral URL and places an order without using the coupon code, it will still be tracked and award the affiliate.</p>\n</li>\n</ul>\n<p><strong>&#8212; Assign Users to Coupons &#8212;</strong></p>\n<ul>\n<li>\n<p>Assign/link user accounts to coupon codes, to give them direct private access to their affiliate dashboard for each coupon.</p>\n</li>\n<li>\n<p>A login form will be displayed on the affiliate dashboard page for logged out users, along with the affiliate registration form.</p>\n</li>\n</ul>\n<p><strong>&#8212; Affiliate Registration System &#8212;</strong></p>\n<ul>\n<li>\n<p>Display a customisable affiliate registration form on your website to allow users to apply as an affiliate. <a href=\"https://couponaffiliates.com/docs/affiliate-registration\" rel=\"nofollow ugc\">Learn More.</a></p>\n</li>\n<li>\n<p>You can easily manage and approve all your affiliate applications in the WordPress admin area.</p>\n</li>\n<li>\n<p>The system will automatically generate the affiliate coupons, assign the users to it, and send them a customisable welcome email.</p>\n</li>\n</ul>\n<p><strong>&#8212; Email Notifications &#8212;</strong></p>\n<ul>\n<li>Automatically send email notifications to affiliates when their coupon code is used, to let them know they have earned new commission. You can also customise the emails with your own message.</li>\n</ul>\n<p><strong>&#8212; Fraud Prevention &#8212;</strong></p>\n<ul>\n<li>Fraud prevention is an important part of any affiliate program. We have implemented several powerful features and options to help stop fraudulent sales! <a href=\"https://couponaffiliates.com/docs/affiliate-fraud-prevention\" rel=\"nofollow ugc\">Learn more.</a></li>\n</ul>\n<p><strong>&#8212; WooCommerce Subscriptions &#8212;</strong></p>\n<ul>\n<li>Coupon Affiliates includes free integration with the official &#8220;WooCommerce Subscriptions&#8221; plugin. This means you can offer affiliates referring commission for subscription renewals, or optionally toggle this off to only reward commission for the first order.</li>\n</ul>\n<p><strong>&#8212; Multi-Currency Support &#8212;</strong></p>\n<ul>\n<li>\n<p>With Coupon Affiliates, you can enable multi-currency support and easily set conversion rates for all your store currencies.</p>\n</li>\n<li>\n<p>This will then automatically convert the order totals, total stats, and commission earned, in the affiliate dashboard to your base store currency, no matter which currency each of the orders were made in.</p>\n</li>\n</ul>\n<h3>🎨 Admin Management &amp; Customisation</h3>\n<p>Coupon Affiliates makes it easy to manage and customise your affiliate program, with a large variety of useful features and tools.</p>\n<p><strong>&#8212; Admin Dashboard &#8212;</strong></p>\n<ul>\n<li>The admin dashboard shows a summary of statistics for your affiliate program, including a 7 day report of the total referrals, and commission earned by affiliates. It will also show the 5 latest referrals, activity logs, url clicks, newest coupons, and more.</li>\n</ul>\n<p><strong>&#8212; Admin Tools &#8212;</strong></p>\n<ul>\n<li>A variety of admin tools are available to make manging your affiliate program even easier. This includes tools to bulk generate new coupons, assign users to coupons, bulk edit coupons, bulk assign affiliates to orders, and more.</li>\n</ul>\n<p><strong>&#8212; Admin Reports &amp; Analytics &#8212;</strong></p>\n<ul>\n<li>\n<p>Get access to admin reports for the past 2 weeks. Reports allow you to see the overall WooCommerce coupon usage stats, and sales for all coupons, and each individual coupon, on a single page.</p>\n</li>\n<li>\n<p>With the Pro version get access to unlimited date range on the admin reports, export to CSV, and access to date comparison features, to compare analytics between 2 sets of dates.</p>\n</li>\n</ul>\n<p><strong>&#8212; Coupons List &amp; Dashboard Links &#8212;</strong></p>\n<ul>\n<li>In the WooCommerce coupons list, a new column will show a unique link to view the affiliate dashboard for that coupon yourself, or you can share this link with a user. Here you can also see a brief affiliate overview for each coupon, including the assigned affiliate. </li>\n</ul>\n<p><strong>&#8212; Plugin Customisation &amp; Settings &#8212;</strong></p>\n<ul>\n<li>A large variety of settings are available to modify all the plugins features, and affiliate dashboard, to meet your specific requirements.</li>\n</ul>\n<p><strong>&#8212; Orders Affiliate Info &#8212;</strong></p>\n<ul>\n<li>A new column will be added to the orders list, as well as a meta box widget in single orders. This will show coupon code used, affiliate user, commission for that order, and a link to the affiliate dashboard.</li>\n</ul>\n<p><strong>&#8212; Coupon Marketing Campaigns &amp; More &#8212;</strong></p>\n<ul>\n<li>The plugin can also be used for your coupon marketing campaigns, so you can view sales, usage statistics, etc for each of your coupons. Will also work great for influencer marketing, a refer a friend program, or managing an ambassador program.</li>\n</ul>\n<h3>🔥 Getting Started</h3>\n<p><strong>&#8212; Ready to increase sales with your new affiliate program? &#8212;</strong></p>\n<p>Setup your own affiliate WooCommerce system in minutes. Then launch your coupon affiliate marketing program to help increase your sales!</p>\n<p>To get started, simply add the shortcode [couponaffiliates] to a new page. This will assign it as the dashboard parent for generating the unique dashboard page links, which you can share with affiliates.</p>\n<p>Upon installation, a small setup wizard will help you get started and automatically generate the affiliate dashboard page for you.</p>\n<p><strong>&#8212; Migrating from another Affiliates Plugin? &#8212;</strong></p>\n<p>Migration of affiliate data to Coupon Affiliates is super simple, since for the most part it uses the existing data that&#8217;s stored by WooCommerce.</p>\n<p>Once you install the plugin, it will look back at the full order history for each coupon, even those created before the installation, and display the stats &amp; commission for these on the coupon affiliate dashboard. All you&#8217;ll need to do is assign your affiliate users to coupon codes, configure the settings, then you&#8217;re good to go!</p>\n<h3>⚡ Want more advanced features?</h3>\n<p>Coupon Affiliates PRO is a paid upgrade which provides a whole bunch of exciting addons and extra features to take your coupon affiliate system to the next level. This includes:</p>\n<ul>\n<li><a href=\"https://couponaffiliates.com/docs/pro-multi-level-affiliates\" rel=\"nofollow ugc\">Multi-Level Affiliates</a> (MLM) &#8211; Your users can become super-affiliates and invite other affiliates to be a part of their multi-level affiliate network. They will then earn extra commission from all their referrals.</li>\n<li><a href=\"https://couponaffiliates.com/docs/admin-reports-analytics\" rel=\"nofollow ugc\">Admin Reports &amp; Analytics (Advanced Filters)</a> &#8211; Access to the advanced filter options (unlimited date range &amp; comparisons) for the Admin Reports &amp; Analytics.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-affiliate-reports\" rel=\"nofollow ugc\">Affiliate Email Reports</a> &#8211; Automatically send an email report (and PDF) to affiliates every week/month with a summary of their recent commission and referral stats.</li>\n<li><a href=\"https://couponaffiliates.com/docs/affiliate-registration\" rel=\"nofollow ugc\">Advanced Registration Features</a> &#8211; Enable some more advanced affiliate registration features such as custom form fields, dynamic code generator, auto accept, auto registration, and more.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-creatives\" rel=\"nofollow ugc\">Creatives</a> &#8211; Display a creatives section with downloadable banners. Includes preview, download, and copy code buttons.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-bonuses\" rel=\"nofollow ugc\">Performance Bonuses</a> &#8211; Give your affiliates bonuses when they reach certain goals, such as some bonus commission once they reach a certain amount of sales.</li>\n<li><a href=\"https://couponaffiliates.com/docs/commission-tracking-and-payouts\" rel=\"nofollow ugc\">Commission Payout Tracking</a> &#8211; Affiliates can keep track of total UNPAID commission. Admins can view requested commission payouts from affiliates, and track/manage pending, complete and cancelled payouts.</li>\n<li><a href=\"https://couponaffiliates.com/docs/commission-tracking-and-payouts\" rel=\"nofollow ugc\">Commission Payout Requests</a> &#8211; Affiliates can request payouts for their pending commission. You can set a payment threshold for commission, and set a delay before commission can be claimed.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-stripe-payouts\" rel=\"nofollow ugc\">Stripe Payouts</a> &#8211; Automatically pay your affiliates in one-click with Stripe!</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-paypal-payouts\" rel=\"nofollow ugc\">PayPal Payouts</a> &#8211; Automatically pay your affiliates in one-click with PayPal Payouts!</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-store-credit\" rel=\"nofollow ugc\">Store Credit Payouts</a> &#8211; Automatically pay your affiliates into a wallet, in one-click, with Store Credit Payouts! Addons are available to integrate with wallet plugins such as TeraWallet or YITH Account Funds.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-monthly-summary-table\" rel=\"nofollow ugc\">Monthly Summary Table</a> &#8211; Show a table with a summary of monthly orders, and total statistics for that coupon for each month in the past 12 months (can be filtered to other months / previous years).</li>\n<li><a href=\"https://couponaffiliates.com/docs/line-graphs\" rel=\"nofollow ugc\">Line Graphs</a> &#8211; Line graphs on the &#8220;Statistics&#8221; tab to show commission earned, on a day by day bases, for past 90 days, 30 days, or 7 days.</li>\n<li><a href=\"https://couponaffiliates.com/docs/export-to-excel\" rel=\"nofollow ugc\">Export to Excel</a> &#8211; Enable a button on coupon pages to export an Excel (CSV) file with a 12 months summary of the individual coupons usage statistics for each month, or the recent orders table.</li>\n<li><a href=\"https://couponaffiliates.com/docs/flexible-commission-settings\" rel=\"nofollow ugc\">Custom Coupon Commission</a> &#8211; Set custom flexible commission amounts for individual coupons.</li>\n<li><a href=\"https://couponaffiliates.com/docs/flexible-commission-settings\" rel=\"nofollow ugc\">Custom Product Commission</a> &#8211; Set custom flexible commission amounts for individual products.</li>\n<li><a href=\"https://couponaffiliates.com/docs/flexible-commission-settings\" rel=\"nofollow ugc\">Custom User Role Commission</a> &#8211; Set custom flexible commission amounts for individual user roles.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-campaigns\" rel=\"nofollow ugc\">Campaigns (Referral URL)</a> &#8211; Allow your affiliates to create referral &#8220;campaigns&#8221; and then create custom URLs to track clicks/conversions per campaign.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-direct-link-tracking\" rel=\"nofollow ugc\">Direct Link Tracking (Referral URL)</a> &#8211; Affiliates can link directly to your website via their website without needing an affiliate link.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-social-sharing\" rel=\"nofollow ugc\">Social Sharing (Referral URL)</a> &#8211; Add social sharing buttons to the referral URL tab, so affiliates can instantly share their generated referral link.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-short-url\" rel=\"nofollow ugc\">Short URL Generator (Referral URL)</a> &#8211; Add a button to the referral URL tab, to allow affiliate users to generate a short URL for their referral link automatically.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-qr-codes\" rel=\"nofollow ugc\">QR Code Generator (Referral URL)</a> &#8211; Add a button to the referral URL tab, to allow affiliate users to automatically generate a QR code for their referral link.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-monthly-summary-table\" rel=\"nofollow ugc\">Monthly Summary Table</a> &#8211; Show a table with a summary of monthly orders, and total statistics for that coupon for each month in the past 12 months (can be filtered to other months / previous years).</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-lifetime-commission\" rel=\"nofollow ugc\">Lifetime Commission</a> &#8211; Option to enable &#8220;Lifetime Commission&#8221; functionality for affiliate referrals, so your affiliates get commission for every future sale by the customers they refer, even if they don&#8217;t use the coupon again.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-affiliate-landing-pages\" rel=\"nofollow ugc\">Affiliate Landing Pages</a> &#8211; Ability to link a landing page to an affiliate coupon, which will then work the same as a referral URL.</li>\n<li><a href=\"https://couponaffiliates.com/docs/subscriptions\" rel=\"nofollow ugc\">Subscriptions: Renewal Limit</a> &#8211; With the WooCommerce subscriptions plugin installed, optionally set a &#8220;limit&#8221; on how many renewals are rewarded. For example, you can set this to reward commission on the first 3 months.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-automated-conversion-rates\" rel=\"nofollow ugc\">Automated Conversion Rates</a> &#8211; Automatically update the multi-currency conversion rates every 12 hours via the Exchangerates API.</li>\n<li><a href=\"https://couponaffiliates.com/docs/pro-custom-tabs\" rel=\"nofollow ugc\">Custom Dashboard Tabs</a> &#8211; Create your own tabs, to display custom sections and content on the affiliate dashboard.</li>\n<li>and <a href=\"https://couponaffiliates.com/roadmap\" rel=\"nofollow ugc\">more great features</a> coming soon&#8230;</li>\n</ul>\n<p>Learn more about Pro and upgrade at <a href=\"https://couponaffiliates.com\" rel=\"nofollow ugc\">www.couponaffiliates.com</a></p>\n<p><a href=\"https://couponaffiliates.com\" rel=\"nofollow ugc\">UPGRADE TO PRO</a></p>\n<h3>⚙️ Integrations</h3>\n<p>Coupon Affiliates was built exclusively as a WooCommerce Affiliate Plugin, however it can also be integrated with other popular eCommerce plugins such as LifterLMS, LearnDash, TutorLMS, MemberPress, and Paid Memberships Pro. <a href=\"https://couponaffiliates.com/docs-category/integrations\" rel=\"nofollow ugc\">Click here</a> to learn more. It also integrates well with other coupon plugins such as Smart Coupons, and Advanced Coupons.</p>\n<h3>📅 Roadmap</h3>\n<p>Want to know what new features we&#8217;re working on releasing in the future? Check out our <a href=\"https://couponaffiliates.com/roadmap\" rel=\"nofollow ugc\">roadmap</a>.</p>\n<h3>👍 Suggestions and Support</h3>\n<p>If you have any suggestions for additional functionality, need any help, or have found a bug, please <a href=\"https://couponaffiliates.com/contact\" rel=\"nofollow ugc\">get in touch</a>!</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.15.1.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/woo-coupon-usage/assets/screenshot-1.png?rev=2782398",
            "caption": "Example of \"Statistics\" tab on affiliate dashboard."
        },
        {
            "src": "https://ps.w.org/woo-coupon-usage/assets/screenshot-2.png?rev=2782399",
            "caption": "Example of \"Recent Orders\" (Referrals) tab on affiliate dashboard."
        },
        {
            "src": "https://ps.w.org/woo-coupon-usage/assets/screenshot-3.png?rev=2782479",
            "caption": "Example \"Referral URL\" tab on affiliate coupon dashboard page."
        },
        {
            "src": "https://ps.w.org/woo-coupon-usage/assets/screenshot-4.png?rev=2782483",
            "caption": "Example admin list of WooCommerce coupons and their unique links."
        },
        {
            "src": "https://ps.w.org/woo-coupon-usage/assets/screenshot-5.png?rev=2621653",
            "caption": "Example of admin reports &amp; analytics."
        },
        {
            "src": "https://ps.w.org/woo-coupon-usage/assets/screenshot-6.png?rev=2782486",
            "caption": "Example of plugin settings page in WordPress admin."
        },
        {
            "src": "https://ps.w.org/woo-coupon-usage/assets/screenshot-7.png?rev=2782410",
            "caption": "Pro Feature: Example of 'Monthly Summary' section."
        },
        {
            "src": "https://ps.w.org/woo-coupon-usage/assets/screenshot-8.png?rev=2782404",
            "caption": "Pro Feature: Example of the extra PRO features in the 'Referral URL' tab (campaigns, social sharing, short URLs, QR codes)."
        },
        {
            "src": "https://ps.w.org/woo-coupon-usage/assets/screenshot-9.png?rev=2782410",
            "caption": "Pro Feature: Example of Affiliate commission payouts requests and logs."
        },
        {
            "src": "https://ps.w.org/woo-coupon-usage/assets/screenshot-10.png?rev=2782411",
            "caption": "Pro Feature: Example of 'Creatives' tab on affiliate dashboard."
        },
        {
            "src": "https://ps.w.org/woo-coupon-usage/assets/screenshot-11.png?rev=2782416",
            "caption": "Pro Feature: Example of Admin commission payouts management area."
        }
    ],
    "tags": {
        "affiliate": "affiliate",
        "affiliate-program": "affiliate program",
        "affiliates": "affiliates",
        "affiliates-woocommerce": "affiliates woocommerce",
        "woocommerce-affiliate": "woocommerce affiliate"
    },
    "stable_tag": "5.15.1",
    "versions": {
        "5.0.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.0.0.zip",
        "5.0.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.0.1.zip",
        "5.1.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.1.0.zip",
        "5.1.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.1.1.zip",
        "5.1.2": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.1.2.zip",
        "5.10.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.10.0.zip",
        "5.10.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.10.1.zip",
        "5.10.2": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.10.2.zip",
        "5.11.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.11.0.zip",
        "5.11.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.11.1.zip",
        "5.11.2": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.11.2.zip",
        "5.12.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.0.zip",
        "5.12.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.1.zip",
        "5.12.10": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.10.zip",
        "5.12.11": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.11.zip",
        "5.12.12": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.12.zip",
        "5.12.13": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.13.zip",
        "5.12.14": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.14.zip",
        "5.12.15": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.15.zip",
        "5.12.16": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.16.zip",
        "5.12.2": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.2.zip",
        "5.12.3": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.3.zip",
        "5.12.4": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.4.zip",
        "5.12.5": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.5.zip",
        "5.12.6": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.6.zip",
        "5.12.7": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.7.zip",
        "5.12.8": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.8.zip",
        "5.12.9": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.12.9.zip",
        "5.13.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.13.0.zip",
        "5.13.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.13.1.zip",
        "5.14.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.14.0.zip",
        "5.14.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.14.1.zip",
        "5.14.2": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.14.2.zip",
        "5.14.3": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.14.3.zip",
        "5.14.4": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.14.4.zip",
        "5.14.5": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.14.5.zip",
        "5.14.6": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.14.6.zip",
        "5.15.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.15.0.zip",
        "5.15.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.15.1.zip",
        "5.2.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.2.0.zip",
        "5.2.0.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.2.0.1.zip",
        "5.3.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.3.0.zip",
        "5.3.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.3.1.zip",
        "5.4.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.4.0.zip",
        "5.4.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.4.1.zip",
        "5.4.2": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.4.2.zip",
        "5.4.5": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.4.5.zip",
        "5.4.6": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.4.6.zip",
        "5.4.7": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.4.7.zip",
        "5.5.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.5.0.zip",
        "5.5.0.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.5.0.1.zip",
        "5.5.0.2": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.5.0.2.zip",
        "5.5.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.5.1.zip",
        "5.5.1.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.5.1.1.zip",
        "5.5.1.2": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.5.1.2.zip",
        "5.5.1.3": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.5.1.3.zip",
        "5.6.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.6.0.zip",
        "5.7.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.7.0.zip",
        "5.7.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.7.1.zip",
        "5.8.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.8.0.zip",
        "5.9.0": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.9.0.zip",
        "5.9.1": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.9.1.zip",
        "5.9.2": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.9.2.zip",
        "5.9.3": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.9.3.zip",
        "5.9.4": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.9.4.zip",
        "5.9.5": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.9.5.zip",
        "5.9.6": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.9.6.zip",
        "5.9.7": "https://downloads.wordpress.org/plugin/woo-coupon-usage.5.9.7.zip",
        "trunk": "https://downloads.wordpress.org/plugin/woo-coupon-usage.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://couponaffiliates.com",
    "banners": {
        "low": "https://ps.w.org/woo-coupon-usage/assets/banner-772x250.png?rev=2539488",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/woo-coupon-usage/assets/icon-128x128.png?rev=2544984"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "woo-coupon-usage",
            "language": "pt_BR",
            "version": "5.15.1",
            "updated": "2024-06-12 22:11:51",
            "package": "https://downloads.wordpress.org/translation/plugin/woo-coupon-usage/5.15.1/pt_BR.zip"
        }
    ]
}