{
    "name": "WooCommerce Fortnox Hub",
    "slug": "woo-fortnox-hub",
    "version": "5.6.9",
    "author": "<a href=\"https://bjorntech.com?utm_source=wp-fortnox&utm_medium=plugin&utm_campaign=product\">BjornTech</a>",
    "author_profile": "https://profiles.wordpress.org/bjorntech/",
    "contributors": {
        "bjorntech": {
            "profile": "https://profiles.wordpress.org/bjorntech/",
            "avatar": "https://secure.gravatar.com/avatar/09e95eca3f328f3ed5e19e1c5ffbb500?s=96&d=monsterid&r=g",
            "display_name": "bjorntech"
        }
    },
    "requires": "4.9",
    "tested": "6.5.5",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 6,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 6,
    "support_url": "https://wordpress.org/support/plugin/woo-fortnox-hub/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 200,
    "downloaded": 15259,
    "last_updated": "2024-05-29 09:29:00",
    "added": "2019-06-16",
    "homepage": "https://www.bjorntech.com/fortnox-hub?utm_source=wp-fortnox&utm_medium=plugin&utm_campaign=product",
    "sections": {
        "description": "<p>This plugin integrates WooCommerce with Fortnox. Automating your accounting and inventory.</p>\n<p>It can create a Fortnox Invoice or Order based on a WooCommerce Order.</p>\n<p>Customer data will be stored in the Fortnox customer database and will be automatically updated if changed in a new order.</p>\n<p>Invoices can automatically be set to paid based on the payment method used in the WooCommerce order.</p>\n<p>The plugin can create internal invoices and voucher to automate the handling of payouts for a number of payment gateways.</p>\n<ul>\n<li>Klarna</li>\n<li>Stripe</li>\n<li>Nets</li>\n<li>Clearhaus</li>\n<li>Swish, if you are using the BjornTech Swish plugin (https://wordpress.org/plugins/woo-swish-e-commerce)</li>\n<li>Zettle, if you are using the BjornTech Zettle plugin (https://wordpress.org/plugins/woo-zettle-integration/)</li>\n</ul>\n<h3>Requirements</h3>\n<p>The following licenses from Fortnox are required in order for the basic functionality of the plugin to work:</p>\n<ul>\n<li>Bookkeeping</li>\n<li>Invoicing</li>\n<li>Integration</li>\n</ul>\n<p>The plugin supports a number of different plugins and external services &#8211; these include:<br />\n&#8211; Turnr</p>\n",
        "installation": "<p>You can find detailed installation and configuration instructions <a href=\"https://bjorntech.com/sv/kom-igang-med-fortnox-hub?utm_source=wp-fortnox&amp;utm_medium=plugin&amp;utm_campaign=product\" rel=\"nofollow ugc\">here</a></p>\n",
        "changelog": "<h4>5.6.9</h4>\n<ul>\n<li>Fix: Some valid organisation numbers are getting caught in the organisation number filter</li>\n</ul>\n<h4>5.6.8</h4>\n<ul>\n<li>Working with WooCommerce 8.9 and WordPress 6.5</li>\n<li>New: Added the option to show the total stock in WooCommerce of all selected stockplaces in Fortnox Lager</li>\n<li>New: Added option to delete WooCommerce products via Fortnox</li>\n<li>New: Added setting to save product posts when products are updated from Fortnox</li>\n<li>Fix: Better handling of zero total orders</li>\n<li>Fix: Virtual variable parent products not syncing</li>\n<li>Fix: Malformed organisation numbers sometimes not matching with existing Fortnox customers</li>\n<li>Fix: YITH Gift Cards sometimes not being applied in invoices properly </li>\n<li>Fix; Zettle Gift card purchases not being applied to invoices properly</li>\n<li>Fix: Coupons added to invoices with too many fields active</li>\n</ul>\n<h4>5.6.7</h4>\n<ul>\n<li>Working with WooCommerce 8.6</li>\n<li>New: Added option to show the total stock of all stockplaces in Fortnox Warehouse as the product stock in WooCommerce</li>\n<li>New: Fortnox Hub will automatically filter out inactive cost centers and finished projects when displaying them in WooCommerce</li>\n<li>Fix: Cancelled invoices sometimes not being processed correctly by the invoice status action section of the plugin</li>\n<li>Fix: Manual payout handling in the plugin could accidentally overlap</li>\n<li>Dev: Fortnox V2 API will now to a higher extent communicate directly with Fortnox</li>\n<li>Dev: Added more filters to invoice status action handler</li>\n<li>Dev: Updated log handler</li>\n</ul>\n<h4>5.6.6</h4>\n<ul>\n<li>Working with WordPress 6.4 and WooCommerce 8.5</li>\n<li>New: Added possibility to connect Projects and Costplaces to WooCommerce products</li>\n<li>New: Added option to force the VAT included option on Fortnox customer cards to be either true or false</li>\n<li>New: Added option for Fortnox Hub to take subcategories into account when using the category filter under Products to Fortnox</li>\n<li>New: Added support for Zettle Gift cards</li>\n<li>New: Added option to not sync orders that have 0 order value</li>\n<li>New: Added function to allow you to sync for VAT numbers on orders in the order list view</li>\n<li>New: Added possibility to control what invoice templates are used when invoices are created from Fortnox orders</li>\n<li>New: Added option to allow end users to download their invoices in the WooCommerce User area view</li>\n<li>New: Added option to send requests via headers in the Fortnox Hub V2 API (a temporary fix until the entire solution is out of beta)</li>\n<li>New: Added option to add an order reference from Svea checkout to Fortnox orders and invoices</li>\n<li>New: Added option to sync default stockplaces from Fortnox to WooCommerce</li>\n<li>Fix: Partial refunds not synced to Fortnox properly if only a Fortnox order has been created</li>\n<li>Fix: Klarna payouts not processed correctly when payout only contains refunds</li>\n<li>Fix: Primary stockplace not properly added to order or invoice when using Fortnox Lager</li>\n<li>Fix: Website sometimes crashing when using the option in the plugin to send a merchant reference to Klarna</li>\n<li>Fix: Prices with decimals not synced to Fortnox properly when using B2BKing pricelists</li>\n<li>Fix: Book and pay associated invoices for Stripe Payouts not working when using the detailed invoice option</li>\n<li>Dev: Disable remaining Paypal settings</li>\n<li>Dev: Removed possibility for user to change their refresh token in the options view</li>\n<li>Dev: Added the connectfiles scope to Fortnox Hub for future development of functions</li>\n</ul>\n<h4>5.6.5</h4>\n<ul>\n<li>Working with WooCommerce 8.2</li>\n<li>New: Added option to determine if a customer is a company solely based on if an organisation number is supplied or not</li>\n<li>New: Added option to sync variable products directly to Fortnox instead of only variants</li>\n<li>New: Added option to prioritize article accounts over general purchase accounts</li>\n<li>New: Added option to allow you to sync customers over to Fortnox without VAT number</li>\n<li>New: Added option to better handle custom order numbers</li>\n<li>New: Added an option to create invoices based on date when order was paid instead of date when order was created</li>\n<li>New: Added functionality to activate Fortnox Hub via Fortnox</li>\n<li>Fix: Zettle payout invoices sometimes not created</li>\n<li>Fix: Fortnox article lookups handled wrong when Fortnox is down</li>\n<li>Fix: Credit invoice dates not reflecting time when invoice happened</li>\n<li>Fix: Fortnox Cron jobs sometimes being registered more than once</li>\n<li>Fix: Logs not showing the time when the error happened</li>\n<li>Fix: If getmypid() is disabled an error came up</li>\n<li>Dev: Added inbox scope</li>\n<li>Dev: Added more customer filters</li>\n<li>Dev: Introduced Composer to the plugin</li>\n<li>Dev: You can now turn on support for Fortnox Hub API v2</li>\n</ul>\n<h4>5.6.4</h4>\n<ul>\n<li>Working with WooCommerce 8.0 and WordPress 6.3</li>\n<li>New: You can now search for Fortnox order and invoice numbers in the search field in the order view</li>\n<li>New: There is now a new meta box in the single order view where you can see the Fortnox order number, invoice number and OCR</li>\n<li>New: Added option for stricter matching of invoices between Fortnox and Fortnox Hub &#8211; useful if using Fortnox Orders and running with multiple stores</li>\n<li>Fix: Shipping with no price (free shipping) got article numbers and account numbers even though it was not needed</li>\n<li>Fix: Invoice created through an Order in Fortnox was not picked up correctly by Fortnox Hub</li>\n<li>Dev: Added some compatibility changes so that less warnings are thrown in wp logs</li>\n</ul>\n<h4>5.6.3</h4>\n<ul>\n<li>Fix: Credit invoices not created properly</li>\n</ul>\n<h4>5.6.2</h4>\n<ul>\n<li>WC High-Performance Order Storage compatibility declaration</li>\n</ul>\n<h4>5.6.1</h4>\n<ul>\n<li>Working with WooCommerce 7.9</li>\n<li>Fix: Due to an unannounced change in the Fortnox API &#8211; currency rate always became 1 during invoice creation</li>\n<li>Fix: Due to a change in the API &#8211; the Fortnox warehouse functions related to primary stockplace stopped working</li>\n</ul>\n<h4>5.6.0</h4>\n<ul>\n<li>Working with WooCommerce 7.7 and WordPress 6.2</li>\n<li>New: Added support for Fortnox fakturaservice</li>\n<li>New: Added the possibility to create simple invoices for Klarna payouts</li>\n<li>New: Added the possibility to create credit invoices when booking and setting invoices to paid when payouts are handled</li>\n<li>New: Added the possibility to use the fee square on invoices instead of declaring fees on invoice rows</li>\n<li>New: Added more possibilities to control when invoices and orders are set to WarehouseReady</li>\n<li>New: Added support for Fraktjakt Shipping Zones</li>\n<li>Fix: Articles sometimes containing weird characters when synced from WooCommerce to Fortnox</li>\n<li>Fix: Errors happening when opening the Products from Fortnox section in the plugin when using the WooCommerce Price Based on Country plugin</li>\n<li>Fix: Fortnox invoices containing multiple gift cards looks strange as all gift cards are added to the same invoice row</li>\n<li>Fix: Fortnox Hub not successfully authenticating against Clearhaus</li>\n<li>Dev: Added a new option to switch to using normal transients instead of site transients</li>\n<li>Dev: Added more payout filters</li>\n<li>Dev: Added invoice filters</li>\n</ul>\n<h4>5.5.3</h4>\n<ul>\n<li>Working with WooCommerce 7.3</li>\n<li>New: Added new Warehouse functions if using Fortnox Lager &#8211; including being able to use a primary stock location</li>\n<li>New Added a new option for decoupling a WooCommerce order from a Fortnox invoice/order if needed</li>\n<li>New: Added a new function for not overwriting cost place on the customer at every update</li>\n<li>Fix: Not possible to create more than one refund order when the original invoice used OCR</li>\n<li>Fix: Fortnox Hub not respecting the VAT setting for only using the local store VAT</li>\n<li>Dev: Enabled support for the new Zettle finance API for payouts</li>\n</ul>\n<h4>5.5.2</h4>\n<ul>\n<li>Working with WooCommerce 7.2</li>\n<li>New: Added possibility to create more than one credit invoice per WooCommerce order</li>\n<li>New: Added support for Turnr</li>\n<li>Fix: Fortnox Hub sometimes not recognizing that a payment has been created in Fortnox for an invoice</li>\n<li>Fix: Some translations in the Fortnox specific parts of the WooCommerce product view were not applied</li>\n</ul>\n<h4>5.5.1</h4>\n<ul>\n<li>Working with WooCommerce 7.1</li>\n<li>New: Added option to prevent multiple invoice emails being sent to clients when email is faulty</li>\n<li>New: Added option to only use WooCommerce order billing details when creating a Fortnox invoice/order instead of using details from customer card</li>\n<li>New: Added option to only use WooCommerce order delivery details when creating a Fortnox invoice/order instead of using details from customer card</li>\n</ul>\n<h4>5.5.0</h4>\n<ul>\n<li>Working with WooCommerce 7.0 and WordPress 6.1</li>\n<li>New: Added the possibility to exclude fees from Stripe payouts</li>\n<li>New: Added the possibility to generate invoices from Clearhaus payouts</li>\n<li>New: Added the possibility for not setting Fortnox orders specifically as delivery done</li>\n<li>New: Added the option to have separate email reply-to, subject and body values for each payment method</li>\n<li>New: Added the option to ignore inactive customers in Fortnox when searching for customers</li>\n<li>New: Added support for the YITH WooCommerce EU VAT plugin to transfer VAT numbers to Fortnox</li>\n<li>Fix: Requests to Fortnox sometimes timing out</li>\n<li>Dev: Added more filters to Clearhaus payout module</li>\n</ul>\n<h4>5.4.3</h4>\n<ul>\n<li>Fix: Zettle payouts sometimes not correctly syncing currency</li>\n</ul>\n<h4>5.4.2</h4>\n<ul>\n<li>Working with WooCommerce 6.9</li>\n<li>New: Added the possibility to add coupon codes used in the WooCommerce order to invoice</li>\n<li>Fix: Credit invoices sometimes not getting automatically bookkeeped</li>\n<li>Fix: Credit invoice paid date incorrectly set to original invoice date</li>\n<li>Fix: Klarna payout settings missing fee account settings</li>\n<li>Dev: Added more filters to Clearhaus payout module</li>\n</ul>\n<h4>5.4.1</h4>\n<ul>\n<li>Fix: Fortnox Getting started message keeps reappearing</li>\n<li>Fix: Rest of the World shipping zone not displaying</li>\n<li>Fix: Warehouse scope not added with Oauth</li>\n</ul>\n<h4>5.4.0</h4>\n<ul>\n<li>Working with WooCommerce 6.7 and WordPress 6.0</li>\n<li>New: Added the possibility to customize which invoices that should be bookkeeped &#8211; based on payment method</li>\n<li>New: Added setting to set invoice/order language in Fortnox</li>\n<li>New: Added more filters</li>\n<li>New: Added possibility to not update email on invoice if customer exists</li>\n<li>Fix: Sale price picked when using pricelists instead of regular price if sale price exist</li>\n<li>Fix: Refund rows on invoice sometimes showing random item descriptions</li>\n<li>Fix: Zettle payout date not always accurate</li>\n<li>Fix: Klarna payouts invoices not always being created</li>\n<li>Fix: Clearhouse payouts using test credentials in production with certain PHP versions</li>\n<li>Fix: Improved connection to Fortnox</li>\n</ul>\n<h4>5.3.0</h4>\n<ul>\n<li>Working with WooCommerce 6.4</li>\n<li>New: Added possibility to generate payouts as voucher instead of invoice.</li>\n<li>New: Added possibility to generate payouts without details of the underlying payments.</li>\n<li>New: Support for Payment Plugins for Stripe WooCommerce when creating payout for Stripe.</li>\n<li>New: Support for creating invoices directly instead of orders when default is to create orders</li>\n<li>New: Support for setting warehouse ready on orders and invoices.</li>\n<li>New: Added support for Nets, Svea and Clearhaus for payouts.</li>\n<li>New: Added filter for Stripe secret key.</li>\n<li>New: Added support for dynamic payment methods such as Briqpay</li>\n<li>Fix: Changed to correct country code for South Korea.</li>\n</ul>\n<h4>5.2.3</h4>\n<ul>\n<li>Working with WooCommerce 6.3</li>\n</ul>\n<h4>5.2.2</h4>\n<ul>\n<li>Working with WordPress 5.9</li>\n<li>Fix: Stockchange from Fortnox did not trigger low-/outof-stock emails.</li>\n<li>Fix: Order numbers are now printed instead of order id in Error messages. </li>\n<li>Fix: Faulty description of Fortnox e-mail body.</li>\n</ul>\n<h4>5.2.1</h4>\n<ul>\n<li>Working with WooCommerce 6.1</li>\n<li>Fix: Option to clean previosly entered VAT numbers using the xxxxxxnnnn format not allowed by Fortnox any longer.</li>\n<li>Fix: Order processing can now be stopped if organization number is missing.</li>\n<li>Fix: Changed to correct country code for Russia.</li>\n<li>Fix: Added current customer to the &#8216;fortnox_customer_data_before_processing&#8217; filter.</li>\n</ul>\n<h4>5.2.0</h4>\n<ul>\n<li>Support for new Fortnox OAuth flow</li>\n</ul>\n<h4>5.1.4</h4>\n<ul>\n<li>Fix: partial credits failed when the credit includes the shipping row</li>\n<li>Fix: API_BLANK was not set as constant, causing the plugin to fail when loading in some environments.</li>\n</ul>\n<h4>5.1.3</h4>\n<ul>\n<li>Working with WooCommerce 6.0</li>\n<li>Fix: If one of the adress field was empty in a new order and at the same time had content on a Fortnox customer card, the card data was faulty added to the Order/Invoice.</li>\n<li>Fix: Stocklevel was faulty changed on a product in Fortnox when an order item including the product was removed from a order manually in order admin.</li>\n</ul>\n<h4>5.1.2</h4>\n<ul>\n<li>Fix: Rows in partial credits was not updated correctly in Fortnox causing credit invoice to be blank.</li>\n<li>Fix: Handle stock was always set when an article was updated from Fortnox, causing an update loop in some cases.</li>\n<li>Fix: Version number of javascript used in bulk edit was not correctly set.</li>\n</ul>\n<h4>5.1.1</h4>\n<ul>\n<li>Fix: PW Giftcard error caused orders/invoices not to sync</li>\n</ul>\n<h4>5.1.0</h4>\n<ul>\n<li>Working with WooCommerce 5.9</li>\n<li>New: Added possibility to quick edit Fortnox fields in Products view</li>\n<li>New: Added extended options for article handling</li>\n<li>Fix: Unable to sync certain country codes</li>\n</ul>\n<h4>5.0.2</h4>\n<ul>\n<li>Fix: Clearing invoice rows on partially credit invoices to avoid mix of data due to Fortnox new way of handling rows when updating.</li>\n</ul>\n<h4>5.0.1</h4>\n<ul>\n<li>Fix: get_country() called in wrong context.</li>\n</ul>\n<h4>5.0.0</h4>\n<ul>\n<li>Working with WooCommerce 5.8</li>\n<li>The plugin now requires PHP 7.3</li>\n<li>New: Added possibility to trigger invoice action on invoice setting to paid.</li>\n<li>New: Added advanced setting to delete invoice payments accidently mapped to e-commerce order from bank import.</li>\n<li>New: Added acvanced setting to configure the system to not use external references in Fortnox when checking if invoice was already synced.</li>\n<li>New: Added the possibility to set accounts for fees.</li>\n<li>Fix: Wrong context was used getting prices.</li>\n<li>Fix: Order/Invoice was not created in a correct way when a PW Gift card was used as payment.</li>\n<li>Fix: Prices from WooCommerce was taken in &#8216;view&#8217; context. Causing problems when using other plugins that do change the display of prices.</li>\n<li>Fix: $organization number not declared caused warning message in the system log.</li>\n<li>Fix: Lenght was not checked when updating Description on products, causing updates to fail if the description was longer than 50 characters.f</li>\n<li>Fix: Paypal credit invoices caused the invoice status checker to crash.</li>\n<li>Fix: Zettle payout invoices did not include all payments when using WEEKLY payouts.</li>\n<li>Fix: Changed id for Klarna payment gateway from &#8216;klarna&#8217; to &#8216;klarna_payments&#8217;</li>\n</ul>\n<h4>4.9.2</h4>\n<ul>\n<li>Tested with WordPress 5.8 and WooCommerce 5.5</li>\n<li>Fix: Allowed to set/get standard prices when using B2B-King.</li>\n<li>New: Added filter when finding existing customer in Fortnox.</li>\n</ul>\n<h4>4.9.1</h4>\n<ul>\n<li>Fix: re-added the possibility to access the legacy print template setting.</li>\n<li>Fix: If OSS is configured VAT exemption on validated customer is not booked correctly.</li>\n</ul>\n<h4>4.9.0</h4>\n<ul>\n<li>Fix: If an Invoice payment was created but not booked the Invoice check function wrongly handled the Invoice as already paid.</li>\n<li>Fix: When manual syncing a cancelled order the cancel-process for Order/Invoice was not performed.</li>\n<li>Fix: The automatic invoice check failed to run in some cases.</li>\n<li>Fix: Shipping amounts were rounded in the wrong way in Fortnox Order/Invoices if decimails in the webshop was set to 0.</li>\n<li>Fix: If using 0 decimals in WooCommerce the plugin did still use the non-rounded number when creating order/invoices.</li>\n<li>Fix: Moved the OSS settings from Advanced to Account settings.</li>\n<li>Fix: Refunds did crash because of missing country on refund order.</li>\n<li>Fix: Fortnox Order/Invoice was not set to be reversed VAT if using WooCommerce EU VAT Assistance.</li>\n</ul>\n<h4>4.8.2</h4>\n<ul>\n<li>Fix: A Fortnox Invoice should be credited rather than cancelled if the creating Woo order was paid.</li>\n<li>Fix: VAT account was not selected correctly if country-info was missing on the order.</li>\n<li>Fix: Order item name on existing article was overwritten by WooCommerce Name.</li>\n<li>Fix: Order fails to sync if the order is refunded, paid with Stripe and the order currency differs from the Stripe payout currency.</li>\n</ul>\n<h4>4.8.1</h4>\n<ul>\n<li>Fix: Product updates failed when the advanced setting to update account on Fortnox products where enabled.</li>\n</ul>\n<h4>4.8.0</h4>\n<ul>\n<li>New: Added the possibility to prevent syncing for orders paid with a specific payment method.</li>\n<li>Fix: When bulk-syncing the orders where synced in reversed order.</li>\n<li>Fix: Previous settings in shipping was not converted to the new structure causing shipping field on the order/invoice to be empty.</li>\n<li>Fix: In some cases a manual sync of a refunded order did not cancel the Order/Invoice in Fortnox.</li>\n</ul>\n<h4>4.7.2</h4>\n<ul>\n<li>Fix: Sales account was incorrectly set to Fortnox Default instead of the account set in the plugin. Please do check account on bookings made from installing 4.7.0</li>\n</ul>\n<h4>4.7.1</h4>\n<ul>\n<li>Fix: Refunds where the initial Fortnox Order/Invoice was not booked/printed did not cancel the Order/Invoice as expected.</li>\n<li>Fix: Price on free Shipping was set to &#8220;null&#8221; instead of 0, causing Order not to sync.</li>\n</ul>\n<h4>4.7.0</h4>\n<ul>\n<li>Working with WooCommerce 5.3</li>\n<li>New: Added the possibility to add an adminstration fee on created orders/invoices. Can also be set to 0 to avoid standard Fee in Fortnox. See advanced settings.</li>\n<li>New: Added an advanced setting to force the Action scheduler to process the queue if running on a system where CRON is not running.</li>\n<li>Fix: A partial refund on an Invoice using the ACCRUAL accounting method fails if the original invoice was not booked</li>\n<li>Fix: Checking also for zettle as well as izettle to identify Zettle orders since the service changed name.</li>\n<li>Fix: Shipping settings did not handle shipping zones in a correct way.</li>\n<li>Fix: Orders with no customer identifier (mail or orgnaisation number) causes multiple customers to be created.</li>\n<li>Fix: Unschedule of action sometimes fails because of a bug in the Action scheduler. Removed unshedule actions temporary.</li>\n<li>Fix: Removed the full daily update from Fortnox since it is no longer needed.</li>\n<li>Fix: If an account was specified on an article Fortnox did not use the account on a order/invoice row.</li>\n<li>Fix: Emailing of invoices to customers from Fortnox failed sometimes.</li>\n<li>Fix: Full refund of an invoice failed if accouting method was CASH and the invoice was paid.</li>\n<li>New</li>\n</ul>\n<h4>4.6.3</h4>\n<ul>\n<li>Fix: If an account number is changed in settings and order/invoices where updated the VAT was not re-calculated on order/invoice rows</li>\n<li>Fix: Full refunds of an invoice if using &#8216;CASH&#8217; as accounting method failed.</li>\n<li>Fix: Partial refunds when failed if an order was setup to create Fortnox Order.</li>\n<li>Fix: When using the advanced setting &#8220;Queue admin requests&#8221; the plugin did fail to check invoice statuses.</li>\n<li>Fix: Metatdata on products where not saved correctly in some cases.</li>\n<li>Fix: No account number was set on shipping row with 0 tax, causing processing error in Fortnox.</li>\n</ul>\n<h4>4.6.2</h4>\n<ul>\n<li>Fix: Account number on sales was set to 0 when using the PW Giftcards plugin.</li>\n</ul>\n<h4>4.6.1</h4>\n<ul>\n<li>Fix: Category selections did not contain emtpy categories.</li>\n<li>Fix: Print handling crashes when checking refund invoices.</li>\n</ul>\n<h4>4.6.0</h4>\n<ul>\n<li>New: Added product unit names as cached information in order to increase performance.</li>\n<li>New: Added the possibility to configure products to be set as &#8220;housework&#8221; products in Fortnox orders/invoices. Enable this function in the advanced settings page.</li>\n<li>New: Added the possibility to use any metadata as organisation number.</li>\n<li>New: Added the possibility to use the WooCommerce order number as Order/Invoice number.</li>\n<li>New: Added support WC Product Price Based on Country makes it possible to link Fortnox-pricelists to a pricing zone.</li>\n<li>New: Added the possibility to select to sync only articles with the &#8220;Webshop article&#8221; set.</li>\n<li>New: Added the possibility to set product status and category on product being created from Fortnox.</li>\n<li>New: Added support for PW Giftcards</li>\n<li>Fix: Product unit names was only checked for duplicates by Unit name instead of Unit name + Unit code.</li>\n<li>Fix: Date for invoice &amp; article-sync was not cleared when changing automatic options.</li>\n</ul>\n<h4>4.5.0</h4>\n<ul>\n<li>New: Added the possibility to set print template per payment method.</li>\n<li>New: Added the possibility to select sending of invoice to customer per payment method.</li>\n<li>Fix: Purhcase prices was updated in Fortnox also when not configured to do so.</li>\n<li>Fix: Shipping Article number used for Shipping was not saved correctly in settings.</li>\n<li>Fix: Selection of order status for creation was empty after 4.4.0</li>\n</ul>\n<h4>4.4.0</h4>\n<ul>\n<li>New: Added the possibility to use the Fortnox Freight field on Order/Invioce for Shipping costs.</li>\n<li>New: Added the possibility to select if customer order note should be copied from an Order to an Invoice automatically.</li>\n<li>New: Added support for &#8220;Admin columns pro&#8221;.</li>\n<li>New: Added support for price sync to and from &#8220;WooCommerce Wholesale Prices&#8221; &amp; &#8220;WooCommerce Wholesale Prices pro&#8221;.</li>\n<li>New: Using &#8216;SE&#8217; as country if no country is set on WooCommerce order.</li>\n<li>New: Added possiblity to put delivery details on the Invoice/Order only without update of the customer card in Fortnox.</li>\n<li>New: Added the possiblity to bulk sync WooCommerce orders to Fortnox.</li>\n<li>New: Added the possibility to sync stocklevel to Fortnox when pressing sync button in product list.</li>\n<li>New: Added Manufacurer, Manufacturer article, Stock-place, Unit and Barcode as extra fields on a WooCommerce product and the possibility to sync the fields to and from Fortnox.</li>\n<li>New: Added the possibility to automatically create WooCommerce simple product from a Fortnox article when it is created in Fortnox.</li>\n<li>New: Using mapped products in WooCommerce when doing a full sync rather than asking Fortnox for all article.</li>\n<li>New: Probibiting automatic updating to Fortnox when a product is updated from Fortnox, preventing endless loops in updates.</li>\n<li>Fix: Always set Discount to 0 in order rows to aviod errors if an existing Fortnox customer have a Invoice discount registred.</li>\n<li>Fix: Added the possibility to configure to use the Shipping field on Fortnox Order/Invoice instead of adding shipping as an item.</li>\n<li>Fix: If shipping cost was 0 the shipping row was wrongly created with an account number for the 0% VAT.</li>\n</ul>\n"
    },
    "short_description": "Integrates WooCommerce with Fortnox",
    "description": "<p>This plugin integrates WooCommerce with Fortnox. Automating your accounting and inventory.</p>\n<p>It can create a Fortnox Invoice or Order based on a WooCommerce Order.</p>\n<p>Customer data will be stored in the Fortnox customer database and will be automatically updated if changed in a new order.</p>\n<p>Invoices can automatically be set to paid based on the payment method used in the WooCommerce order.</p>\n<p>The plugin can create internal invoices and voucher to automate the handling of payouts for a number of payment gateways.</p>\n<ul>\n<li>Klarna</li>\n<li>Stripe</li>\n<li>Nets</li>\n<li>Clearhaus</li>\n<li>Swish, if you are using the BjornTech Swish plugin (https://wordpress.org/plugins/woo-swish-e-commerce)</li>\n<li>Zettle, if you are using the BjornTech Zettle plugin (https://wordpress.org/plugins/woo-zettle-integration/)</li>\n</ul>\n<h3>Requirements</h3>\n<p>The following licenses from Fortnox are required in order for the basic functionality of the plugin to work:</p>\n<ul>\n<li>Bookkeeping</li>\n<li>Invoicing</li>\n<li>Integration</li>\n</ul>\n<p>The plugin supports a number of different plugins and external services &#8211; these include:<br />\n&#8211; Turnr</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.6.9.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "accounting": "Accounting",
        "fortnox": "fortnox",
        "hub": "hub",
        "integration": "integration",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "5.6.9",
    "versions": {
        "3.5.2": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.3.5.2.zip",
        "3.6.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.3.6.0.zip",
        "3.7.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.3.7.0.zip",
        "3.7.1": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.3.7.1.zip",
        "4.0.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.0.0.zip",
        "4.1.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.1.0.zip",
        "4.1.1": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.1.1.zip",
        "4.2.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.2.0.zip",
        "4.3.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.3.0.zip",
        "4.3.1": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.3.1.zip",
        "4.4.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.4.0.zip",
        "4.5.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.5.0.zip",
        "4.6.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.6.0.zip",
        "4.6.1": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.6.1.zip",
        "4.6.2": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.6.2.zip",
        "4.6.3": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.6.3.zip",
        "4.7.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.7.0.zip",
        "4.7.1": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.7.1.zip",
        "4.7.2": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.7.2.zip",
        "4.8.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.8.0.zip",
        "4.8.1": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.8.1.zip",
        "4.8.2": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.8.2.zip",
        "4.9.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.9.0.zip",
        "4.9.1": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.9.1.zip",
        "4.9.2": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.4.9.2.zip",
        "5.0.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.0.0.zip",
        "5.0.1": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.0.1.zip",
        "5.1.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.1.0.zip",
        "5.1.1": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.1.1.zip",
        "5.1.2": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.1.2.zip",
        "5.1.3": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.1.3.zip",
        "5.1.4": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.1.4.zip",
        "5.2.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.2.0.zip",
        "5.2.1": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.2.1.zip",
        "5.2.2": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.2.2.zip",
        "5.2.3": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.2.3.zip",
        "5.3.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.3.0.zip",
        "5.4.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.4.0.zip",
        "5.4.1": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.4.1.zip",
        "5.4.2": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.4.2.zip",
        "5.4.3": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.4.3.zip",
        "5.5.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.5.0.zip",
        "5.5.1": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.5.1.zip",
        "5.5.2": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.5.2.zip",
        "5.5.3": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.5.3.zip",
        "5.6.0": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.6.0.zip",
        "5.6.1": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.6.1.zip",
        "5.6.2": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.6.2.zip",
        "5.6.3": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.6.3.zip",
        "5.6.4": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.6.4.zip",
        "5.6.5": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.6.5.zip",
        "5.6.6": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.6.6.zip",
        "5.6.7": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.6.7.zip",
        "5.6.8": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.6.8.zip",
        "5.6.9": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.5.6.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/woo-fortnox-hub.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/woo-fortnox-hub/assets/icon.svg?rev=2174477",
        "svg": "https://ps.w.org/woo-fortnox-hub/assets/icon.svg?rev=2174477"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "woo-fortnox-hub",
            "language": "sv_SE",
            "version": "5.6.9",
            "updated": "2024-02-06 12:31:40",
            "package": "https://downloads.wordpress.org/translation/plugin/woo-fortnox-hub/5.6.9/sv_SE.zip"
        }
    ]
}