{
    "name": "Cart All In One For WooCommerce",
    "slug": "woo-cart-all-in-one",
    "version": "1.1.15",
    "author": "<a href=\"https://villatheme.com\">VillaTheme</a>",
    "author_profile": "https://profiles.wordpress.org/villatheme/",
    "contributors": {
        "villatheme": {
            "profile": "https://profiles.wordpress.org/villatheme/",
            "avatar": "https://secure.gravatar.com/avatar/973d0ef458adb8a3c527f196b9529909?s=96&d=monsterid&r=g",
            "display_name": "VillaTheme"
        },
        "mrt3vn": {
            "profile": "https://profiles.wordpress.org/mrt3vn/",
            "avatar": "https://secure.gravatar.com/avatar/cb8ecbc2ffe02a20ea2f5d1da26d3a22?s=96&d=monsterid&r=g",
            "display_name": "Andy Ha"
        }
    },
    "requires": "5.0",
    "tested": "6.5.5",
    "requires_php": "7.0",
    "requires_plugins": [
        "woocommerce"
    ],
    "compatibility": [],
    "rating": 92,
    "ratings": {
        "5": 42,
        "4": 5,
        "3": 0,
        "2": 0,
        "1": 4
    },
    "num_ratings": 51,
    "support_url": "https://wordpress.org/support/plugin/woo-cart-all-in-one/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 9000,
    "downloaded": 169515,
    "last_updated": "2024-04-26 02:10:00",
    "added": "2019-06-18",
    "homepage": "https://villatheme.com/extensions/woocommerce-cart-all-in-one/",
    "sections": {
        "description": "<p>One Click Checkout WooCommerce and boost your sales with WooCommerce Cart All in One plugin is intended to help customers fulfill their orders with a single click. One Click Checkout WooCommerce saves customers time by checking out directly on the sidebar cart, bypassing the cart page. Customers are not distracted in the ordering process. When a customer registers, One Click Checkout WooCommerce saves all of their important and relevant information. This also aids in the elimination of repetitive manual data entry. You will be surprised at how sales and revenues increase to take advantage of this plugin using the one Click Checkout WooCommerce technique.<br />\nWooCommerce Cart All In One Plugin is a powerful extension that helps to innovate the functions of the Cart on the WooCommerce Store. The plugin also provides users with many useful tools to design all the elements relating such as Sidebar Cart, Menu Cart, Sticky Add To Cart button, Checkout on Sidebar Cart, one click checkout WooCommerce, which will make your WooCommerce Store work more effectively.</p>\n<p><a href=\"http://new2new.com/?item=woocommerce-cart-all-in-one\" title=\"Demo Cart All In One For WooCommerce\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"http://docs.villatheme.com/?item=woocommerce-cart-all-in-one\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/bW20B\" rel=\"nofollow ugc\">Premium version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n<h3>Preview WooCommerce Cart All In One</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/HBWQaLhPpBU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>How to install and use the plugin</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/81bdzp_FsLs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>To handle WP’s Conditional Tags, this plugin uses eval() which is very dangerous because it allows execution of arbitrary PHP code. Therefore, please only fill this field with proper conditional tags which are validated and/or provided by trusted developers.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>THE PLUGIN FEATURES</h3>\n<p>&#9658; <strong>SIDEBAR CART:</strong> Display Sidebar cart pop-up with all features of the cart page. Customers can add coupons, select quantity, remove items</p>\n<ul>\n<li>\n<p><strong>Sidebar cart icon:</strong> display a small sidebar cart icon at the corner of the screen. Let the customer know how many products they have in their cart. And allow them to open the sidebar car pop-up.</p>\n</li>\n<li>\n<p><strong>Sidebar cart pop-up:</strong> the sidebar cart pop-up appear when a customer adds a product to the cart or click on the sidebar cart icon. The pop-up allows them to view their cart, use coupons or go to the check-out page directly.</p>\n</li>\n<li>\n<p><strong>Product information:</strong>  the sidebar cart pop-up displays the information about products in the customer’s cart including product name, product image, price, quantity.</p>\n</li>\n<li>\n<p><strong>Change quantity:</strong> customers can change the quantity of each product directly in their cart.</p>\n</li>\n<li>\n<p><strong>Remove Product:</strong> a remove button appear next to each product name, allowing the customer to remove that product from their cart.</p>\n</li>\n<li>\n<p><strong>Cart Subtotal:</strong>  display the subtotal amount, this amount does not include tax, shipping… and be the same as the subtotal amount on your cart page.</p>\n</li>\n<li>\n<p><strong>Cart total:</strong>  display the cart total amount.</p>\n</li>\n<li>\n<p><strong>Update Cart button:</strong>  when customers change quantity product in their cart, the update button allows them to update the cart total amount.</p>\n</li>\n<li>\n<p><strong>Use Coupon:</strong>  Coupons can be applied on the sidebar cart pop-up. If the coupon is added successfully, the cart total amount will be reduced and the plugin will display a successful message. If the coupon can not be used, the plugin will display an unsuccessful message with the reason.</p>\n</li>\n<li>\n<p><strong>Checkout:</strong>   a checkout button allows customers to go directly to the checkout page if they decide to purchase your items.</p>\n</li>\n<li>\n<p><strong>View Cart:</strong>   go to the cart page directly with the View Cart button.</p>\n</li>\n<li>\n<p><strong>Related products:</strong>   the related product option allows to display of related products at the bottom of the sidebar cart. You can choose to display the best-selling products, recently viewed products, or top-rated products.</p>\n</li>\n<li>\n<p><strong>Assign page:</strong>  choosing the pages which display the sidebar cart.</p>\n</li>\n</ul>\n<p>&#9658; <strong>MENU CART:</strong> The plugin adds a cart icon to the menus. It allows the customer to view the cart by hovering their mouse on the menu bar.</p>\n<ul>\n<li>\n<p><strong>Menu Cart icon:</strong> the plugin will display a cart icon on selected menus. The icon will display the number of items in the cart.</p>\n</li>\n<li>\n<p><strong>Dropdown cart:</strong> display cart dropdown when customers hover their mouse over the menu cart icon.</p>\n</li>\n</ul>\n<p>&#9658; <strong>AJAX ADD TO CART:</strong> The AJAX Add to Cart option allows customers to add products to the cart from single product pages or quick view pop-ups without reloading the page. Besides that, the user can choose the products which are not to be applied to ajax add to the cart.</p>\n<p>&#9658; <strong>ADD TO CART FOR VARIABLE PRODUCT:</strong> The plugin offers a custom Add to Cart button for the variable product. The customers can select variations and add the product to the cart in archive pages without going to the single product page.</p>\n<ul>\n<li>\n<p><strong>Select option pop-up:</strong> in archive pages, when a customer clicks on the add to cart button of a variable product, a pop-up will appear allowing them to select the product variations. With the variation, pop-up customers can select product variations, quantity and then add the product to the cart.</p>\n</li>\n<li>\n<p><strong>Change the add to cart button label:</strong> change the label of the add to cart button to “select options” or any text you want. This option applies to variable products only.</p>\n</li>\n</ul>\n<p>&#9658; <strong>DESIGN:</strong> The plugin allows you to design the front-end of the sidebar cart,  menu cart to match your website. The designs can be visible in the settings area before publishing.</p>\n<ul>\n<li>\n<p><strong>Sidebar Cart:</strong></p>\n</li>\n<li>\n<p>2 styles: there are 2 sidebar cart style full height and pop-up.</p>\n</li>\n<li>\n<p>4 position: you can put the sidebar cart in 4 positions.</p>\n</li>\n<li>\n<p>8 styles of Sidebar trigger Event</p>\n</li>\n<li>\n<p>12 loading type and change the color loading bar</p>\n</li>\n<li>\n<p>Automatically open sidebar cart when adding products to the cart.</p>\n</li>\n<li>\n<p>Add to cart animation: display an animation of the product “fly” to cart when clicking the add to cart button.</p>\n</li>\n<li>\n<p>Open the sidebar cart when adding products to the cart.</p>\n</li>\n<li>\n<p>Header: change background change, title, title color, apply coupon button color in the header area.</p>\n</li>\n<li>\n<p>Product list: background color, product image radius, product title color, remove icon color. Change the title color when hovering the mouse on the product.</p>\n</li>\n<li>\n<p>Footer: change the background color, checkout button text, checkout button color, view cart button text, view cart button color, cart total text color in the footer area.</p>\n</li>\n<li>\n<p><strong>Sidebar Cart icon:</strong></p>\n</li>\n<li>\n<p>5 front-end styles: The styles of sidebar icons are designed creatively to have more choices for users.</p>\n</li>\n<li>\n<p>45 cart icons: There are many cart icon types from simple to eye-catching to suitable with many styles.</p>\n</li>\n<li>\n<p>Customize the size of cart icon: Change the Sidebar cart icon size with the adjusting ruler.</p>\n</li>\n<li>\n<p>Customize the position of cart icon: Choose the positions for sidebar cart icon on the site by the Sidebar Cart Horizontal and Sidebar Cart Vertical.</p>\n</li>\n<li>\n<p>Shadow for box: Create the box-shadow to make it more impressed</p>\n</li>\n<li>\n<p>Color Settings: Easily to set the color of sidebar cart icon, background,  product counter, Border Radius. The users can choose the colors from the color picker or enter the color hex.</p>\n</li>\n<li>\n<p><strong>Menu Cart:</strong></p>\n</li>\n<li>\n<p>Navigation page: choose to redirect to the cart page or checkout page when clicking on the menu cart icon.</p>\n</li>\n<li>\n<p>Show content: display the content of the cart when hover mouse on the menu cart icon.</p>\n</li>\n<li>\n<p>45 cart icons for you to select.</p>\n</li>\n<li>\n<p>Change the color of the cart icon and cart hover color.</p>\n</li>\n<li>\n<p>Cart icon text: choose to display product quantity, total price, or both quantity and total price on the cart menu.</p>\n</li>\n<li>\n<p>Choose to show the subtotal or total price on menu cart</p>\n</li>\n<li>\n<p>Change the text color of the menu cart.</p>\n</li>\n</ul>\n<h3>PREMIUM FEATURES</h3>\n<p>All features from the free version.</p>\n<p>&#9658; <strong>Sticky Add To Cart Button:</strong> The plugin can display the Sticky add to Cart on single pages which helps to increase the rate of adding products to the cart from customers because Customers can add products without scrolling the bar to find the add to cart button.  Moreover, there are options for excluding products or categories from showing the Sticky add to Cart.</p>\n<ul>\n<li>\n<p><strong>Select Product to Preview:</strong> Help user design sticky add to Cart button easily and effectively</p>\n</li>\n<li>\n<p><strong>Templates:</strong> There are four templates of sticky add to cart button to choose</p>\n</li>\n<li>\n<p><strong>Positions:</strong> Set the positions for sticky add to Cart button.</p>\n</li>\n<li>\n<p><strong>Display of Product ratings and Product Quantity.</strong></p>\n</li>\n<li>\n<p><strong>Set up the colors by color picker of text, background, icon…</strong></p>\n</li>\n<li>\n<p><strong>Adjust the Border radius, image width, size of buttons…</strong></p>\n</li>\n</ul>\n<p>&#9658; <strong>Recently Viewed Products:</strong> The plugin has an option for adding recently views products to the WooCommerce stores to remind customers about what they are interested in and helps them to buy the items they want quickly. Recently viewed products can add to the single product page or anywhere with the shortcode.</p>\n<p>&#9658; <strong>Checkout area on Sidebar Cart – One click checkout WooCommerce:</strong> With the plugin, Checkout steps are integrated into Sidebar Cart. Customers can checkout directly on the sidebar cart without going to the checkout page. This feature will encourage the customers to complete their orders quickly and boost your sales.</p>\n<ul>\n<li>\n<p><strong>Customize the steps of checkout:</strong> The plugin can convert all checkout steps to the sidebar Cart. It helps the Customer to save time to one click checkout WooCommerce without going to the check-out page.</p>\n</li>\n<li>\n<p><strong>Change the title of steps:</strong> Change the title of check-out steps to be suitable for the site.</p>\n</li>\n<li>\n<p><strong>Choose the icons available on checkout area on sidebar Cart:</strong> There are many available icons with different style to choose</p>\n</li>\n<li>\n<p><strong>Set up the color for background, icon, button and border-radius:</strong> The picker color and radius adjusting rules help to design the checkout out area easily and quickly.</p>\n</li>\n</ul>\n<h3>And much more things are waiting for you discover</h3>\n<p><a href=\"https://1.envato.market/bW20B\" rel=\"nofollow ugc\">GET PRO VERSION</a> or <a href=\"https://1.envato.market/bW20B\" rel=\"nofollow ugc\">https://codecanyon.net/item/woocommerce-cart-all-in-one/30184317</a></p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-cart-all-in-one\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com/extensions/woocommerce-cart-all-in-one/\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-cart-all-in-one\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Product size Chart for WooCommerce customize and design the size chart of specific products or categories.</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n",
        "installation": "<ol>\n<li>Unzip the download package</li>\n<li>Upload <code>woo-cart-all-in-one</code> to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n",
        "changelog": "<p>/<strong>1.1.15 &#8211; 2024.04.26</strong>/<br />\n– Updated: Delete the old description for the &#8216;Assign page&#8217; and add the link of the WC condition tag</p>\n<p>/<strong>1.1.14 &#8211; 2024.04.13</strong>/<br />\n– Updated: Compatible with WP 6.5 and  WC 8.7<br />\n– Updated: Update support class</p>\n<p>/<strong>1.1.13 – 2023.08.04</strong>/<br />\n– Updated: Compatible Storefront menu<br />\n– Updated: Compatible Elementor v:3.15<br />\n– Updated: Update support class</p>\n<p>/<strong>1.1.12 – 2023.04.12</strong>/<br />\n– Updated: Compatible with &#8216;High-Performance order storage (COT)&#8217;</p>\n<p>/<strong>1.1.11 – 2022.12.15</strong>/<br />\n&#8211; Updated: Show on cart &amp; checkout page<br />\n– Fixed: Add missing nonce</p>\n<p>/<strong>1.1.10 – 2022.10.17</strong>/<br />\n– Updated: Update support class</p>\n<p>/<strong>1.1.9 – 2022.05.30</strong>/<br />\n– Updated: Compatible with WP 6.0<br />\n– Updated: Update support class</p>\n<p>/<strong>1.1.8 &#8211; 2022.05.19</strong>/<br />\n&#8211; Updated: Update support class</p>\n<p>/<strong>1.1.7 &#8211; 2022.04.20</strong>/<br />\n&#8211; Updated: Update support class</p>\n<p>/<strong>1.1.6 &#8211; 2022.03.29</strong>/<br />\n&#8211; Updated: Update support class</p>\n<p>/<strong>1.1.5 &#8211; 2022.03.21</strong>/<br />\n&#8211; Updated: support class</p>\n<p>/<strong>1.1.4 &#8211; 2022.01.10</strong>/<br />\n&#8211; Updated: support class</p>\n<p>/<strong>1.1.3 &#8211; 2021.11.15</strong>/<br />\n&#8211; Fixed: Can not translate &#8216;Coupon code&#8217; in the sidebar cart</p>\n<p>/<strong>1.1.2 &#8211; 2021.10.26</strong>/<br />\n&#8211; Added: New display style for the sidebar cart icon</p>\n<p>/<strong>1.1.1.0 &#8211; 2021.10.07</strong>/<br />\n&#8211; Fixed: Can not get list applied coupons</p>\n<p>/<strong>1.1.0.9 &#8211; 2021.07.31</strong>/<br />\n&#8211; Updated: support class</p>\n<p>/<strong>1.1.0.8 &#8211; 2021.06.26</strong>/<br />\n&#8211; Updated: Allow to change enable/disable special feature on the customizer<br />\n&#8211; Updated: support class<br />\n&#8211; Added: Option enable/disable show the product title link on Sidebar Cart List Products</p>\n<p>/<strong>1.1.0.7 &#8211; 2021.06.03</strong>/<br />\n&#8211; Fixed: Can not display the product plus slide</p>\n<p>/<strong>1.1.0.6 &#8211; 2021.06.02</strong>/<br />\n&#8211; Updated: Support class</p>\n<p>/<strong>1.1.0.5 &#8211; 2021.05.11</strong>/<br />\n&#8211; Fixed: refresh page after add to cart ajax on single product</p>\n<p>/<strong>1.1.0.4 &#8211; 2021.05.04</strong>/<br />\n&#8211; Fixed: Sidebar cart icon don&#8217;t show if horizontal/vertical is 0<br />\n&#8211; Fixed: fly product image to cart on single page</p>\n<p>/<strong>1.1.0.3 &#8211; 2021.04.09</strong>/<br />\n&#8211; Fixed: Ajax add to cart</p>\n<p>/<strong>1.1.0.2 &#8211; 2021.04.09</strong>/<br />\n&#8211; Added: Display style of products price on Sidebar Cart List Products<br />\n&#8211; Updated: Display style of variation pop-up<br />\n&#8211; Fixed: Find variation on variation pop-up<br />\n&#8211; Fixed: Style of loading icon</p>\n<p>/<strong>1.1.0.1 &#8211; 2021.03.01</strong>/<br />\n&#8211; Fixed: Change variation on variation pop-up<br />\n&#8211; Fixed: Update cart after adding product without refresh page<br />\n&#8211; Updated: Change product image size on the product plus slide<br />\n&#8211; Updated: Change time to show message popup</p>\n<p>/<strong>1.1.0 &#8211; 2021.01.26</strong>/<br />\n&#8211; Added: Link to pro<br />\n&#8211; Added: Exclude products which are not applied ajax add to cart<br />\n&#8211; Added: Hide the notification of adding products to cart successfully after adding to cart by Ajax<br />\n&#8211; Added: Set text of cart total on Sidebar Cart Footer<br />\n&#8211; Added: Quantity border color on Sidebar Cart List Products<br />\n&#8211; Added: Quantity border radius on Sidebar Cart List Products<br />\n&#8211; Added: Font size of Trash Icon on Sidebar Cart List Products<br />\n&#8211; fixed: Slide of Product Plus on Sidebar Cart Footer<br />\n&#8211; fixed: Menu cart doesn&#8217;t show<br />\n&#8211; fixed: Responsible on mobile if the address bar is visible<br />\n&#8211; Updated: Remove all &#8216;Sidebar Trigger Event Style&#8217; and add 8 others<br />\n&#8211; Updated: Shake cart when add products to cart.<br />\n&#8211; Updated: New style of product quantity on Sidebar Cart<br />\n&#8211; Updated: Assign pages to show Sidebar Cart<br />\n&#8211; Updated: Link to documentation</p>\n<p>/<strong>1.0.9.1 &#8211; 2020.04.23</strong>/<br />\n&#8211; Update: support class</p>\n<p>/<em>1.0.9 &#8211; 2020.04.11</em>/<br />\n&#8211; fixed: Menu cart style<br />\n– Updated: Compatible with WP 5.4 and WC4.0</p>\n<p>/<em>1.0.8.3 &#8211; 2020.03.23</em>/<br />\n&#8211; updated: declare text domain</p>\n<p>/<em>1.0.8.2 &#8211; 2020.03.16</em>/<br />\n&#8211; updated: declare text domain</p>\n<p>/<em>1.0.8.1 &#8211; 2020.02.10</em>/<br />\n&#8211; fixed: Subtotals not visible in cart</p>\n<p>/<em>1.0.8 &#8211; 2020.01.30</em>/<br />\n&#8211; fixed: Add variation to cart with popup<br />\n&#8211; added: Hide popup after add variation to cart</p>\n<p>/<em>1.0.7 &#8211; 2019.12.30</em>/<br />\n&#8211; fixed: Disabling variation popup<br />\n&#8211; fixed: Changing variation “add to cart”<br />\n&#8211; fixed: able to add items to cart When Ajax add to cart is enabled<br />\n&#8211; fixed: add variation to cart When Ajax add to cart is enabled<br />\n&#8211; fixed: Fly to cart doesn’t work when adding the first item to cart<br />\n&#8211; fixed: Not calculating shipping in the final price when “total” is selected<br />\n&#8211; added: Show meta data of cart item<br />\n&#8211; added: Reduce size of sidebar cart icon</p>\n<p>/<em>1.0.6 &#8211; 2019.11.16</em>/<br />\n&#8211; Updated: Sanitize input data</p>\n<p>/<em>1.0.0  &#8211; 2019.</em>/<br />\n&#8211; Release version 1.0.0</p>\n"
    },
    "short_description": "Cart All In One For WooCommerce helps your customers view cart effortlessly.",
    "description": "<p>One Click Checkout WooCommerce and boost your sales with WooCommerce Cart All in One plugin is intended to help customers fulfill their orders with a single click. One Click Checkout WooCommerce saves customers time by checking out directly on the sidebar cart, bypassing the cart page. Customers are not distracted in the ordering process. When a customer registers, One Click Checkout WooCommerce saves all of their important and relevant information. This also aids in the elimination of repetitive manual data entry. You will be surprised at how sales and revenues increase to take advantage of this plugin using the one Click Checkout WooCommerce technique.<br />\nWooCommerce Cart All In One Plugin is a powerful extension that helps to innovate the functions of the Cart on the WooCommerce Store. The plugin also provides users with many useful tools to design all the elements relating such as Sidebar Cart, Menu Cart, Sticky Add To Cart button, Checkout on Sidebar Cart, one click checkout WooCommerce, which will make your WooCommerce Store work more effectively.</p>\n<p><a href=\"http://new2new.com/?item=woocommerce-cart-all-in-one\" title=\"Demo Cart All In One For WooCommerce\" rel=\"nofollow ugc\">Try the Demo</a> | <a href=\"http://docs.villatheme.com/?item=woocommerce-cart-all-in-one\" title=\"Documents\" rel=\"nofollow ugc\">Documents</a> | <a href=\"https://1.envato.market/bW20B\" rel=\"nofollow ugc\">Premium version</a> | <a href=\"https://www.facebook.com/groups/villatheme\" title=\"VillaTheme\" rel=\"nofollow ugc\">Facebook group</a></p>\n<h3>Preview WooCommerce Cart All In One</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/HBWQaLhPpBU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>How to install and use the plugin</h3>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/81bdzp_FsLs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Important Notice:</h3>\n<ul>\n<li>\n<p>Plugin works based on WooCommerce plugin.</p>\n</li>\n<li>\n<p>To handle WP’s Conditional Tags, this plugin uses eval() which is very dangerous because it allows execution of arbitrary PHP code. Therefore, please only fill this field with proper conditional tags which are validated and/or provided by trusted developers.</p>\n</li>\n<li>\n<p>It is released on WordPress.org and you can use plugin as free to build themes for sale.</p>\n</li>\n</ul>\n<h3>THE PLUGIN FEATURES</h3>\n<p>&#9658; <strong>SIDEBAR CART:</strong> Display Sidebar cart pop-up with all features of the cart page. Customers can add coupons, select quantity, remove items</p>\n<ul>\n<li>\n<p><strong>Sidebar cart icon:</strong> display a small sidebar cart icon at the corner of the screen. Let the customer know how many products they have in their cart. And allow them to open the sidebar car pop-up.</p>\n</li>\n<li>\n<p><strong>Sidebar cart pop-up:</strong> the sidebar cart pop-up appear when a customer adds a product to the cart or click on the sidebar cart icon. The pop-up allows them to view their cart, use coupons or go to the check-out page directly.</p>\n</li>\n<li>\n<p><strong>Product information:</strong>  the sidebar cart pop-up displays the information about products in the customer’s cart including product name, product image, price, quantity.</p>\n</li>\n<li>\n<p><strong>Change quantity:</strong> customers can change the quantity of each product directly in their cart.</p>\n</li>\n<li>\n<p><strong>Remove Product:</strong> a remove button appear next to each product name, allowing the customer to remove that product from their cart.</p>\n</li>\n<li>\n<p><strong>Cart Subtotal:</strong>  display the subtotal amount, this amount does not include tax, shipping… and be the same as the subtotal amount on your cart page.</p>\n</li>\n<li>\n<p><strong>Cart total:</strong>  display the cart total amount.</p>\n</li>\n<li>\n<p><strong>Update Cart button:</strong>  when customers change quantity product in their cart, the update button allows them to update the cart total amount.</p>\n</li>\n<li>\n<p><strong>Use Coupon:</strong>  Coupons can be applied on the sidebar cart pop-up. If the coupon is added successfully, the cart total amount will be reduced and the plugin will display a successful message. If the coupon can not be used, the plugin will display an unsuccessful message with the reason.</p>\n</li>\n<li>\n<p><strong>Checkout:</strong>   a checkout button allows customers to go directly to the checkout page if they decide to purchase your items.</p>\n</li>\n<li>\n<p><strong>View Cart:</strong>   go to the cart page directly with the View Cart button.</p>\n</li>\n<li>\n<p><strong>Related products:</strong>   the related product option allows to display of related products at the bottom of the sidebar cart. You can choose to display the best-selling products, recently viewed products, or top-rated products.</p>\n</li>\n<li>\n<p><strong>Assign page:</strong>  choosing the pages which display the sidebar cart.</p>\n</li>\n</ul>\n<p>&#9658; <strong>MENU CART:</strong> The plugin adds a cart icon to the menus. It allows the customer to view the cart by hovering their mouse on the menu bar.</p>\n<ul>\n<li>\n<p><strong>Menu Cart icon:</strong> the plugin will display a cart icon on selected menus. The icon will display the number of items in the cart.</p>\n</li>\n<li>\n<p><strong>Dropdown cart:</strong> display cart dropdown when customers hover their mouse over the menu cart icon.</p>\n</li>\n</ul>\n<p>&#9658; <strong>AJAX ADD TO CART:</strong> The AJAX Add to Cart option allows customers to add products to the cart from single product pages or quick view pop-ups without reloading the page. Besides that, the user can choose the products which are not to be applied to ajax add to the cart.</p>\n<p>&#9658; <strong>ADD TO CART FOR VARIABLE PRODUCT:</strong> The plugin offers a custom Add to Cart button for the variable product. The customers can select variations and add the product to the cart in archive pages without going to the single product page.</p>\n<ul>\n<li>\n<p><strong>Select option pop-up:</strong> in archive pages, when a customer clicks on the add to cart button of a variable product, a pop-up will appear allowing them to select the product variations. With the variation, pop-up customers can select product variations, quantity and then add the product to the cart.</p>\n</li>\n<li>\n<p><strong>Change the add to cart button label:</strong> change the label of the add to cart button to “select options” or any text you want. This option applies to variable products only.</p>\n</li>\n</ul>\n<p>&#9658; <strong>DESIGN:</strong> The plugin allows you to design the front-end of the sidebar cart,  menu cart to match your website. The designs can be visible in the settings area before publishing.</p>\n<ul>\n<li>\n<p><strong>Sidebar Cart:</strong></p>\n</li>\n<li>\n<p>2 styles: there are 2 sidebar cart style full height and pop-up.</p>\n</li>\n<li>\n<p>4 position: you can put the sidebar cart in 4 positions.</p>\n</li>\n<li>\n<p>8 styles of Sidebar trigger Event</p>\n</li>\n<li>\n<p>12 loading type and change the color loading bar</p>\n</li>\n<li>\n<p>Automatically open sidebar cart when adding products to the cart.</p>\n</li>\n<li>\n<p>Add to cart animation: display an animation of the product “fly” to cart when clicking the add to cart button.</p>\n</li>\n<li>\n<p>Open the sidebar cart when adding products to the cart.</p>\n</li>\n<li>\n<p>Header: change background change, title, title color, apply coupon button color in the header area.</p>\n</li>\n<li>\n<p>Product list: background color, product image radius, product title color, remove icon color. Change the title color when hovering the mouse on the product.</p>\n</li>\n<li>\n<p>Footer: change the background color, checkout button text, checkout button color, view cart button text, view cart button color, cart total text color in the footer area.</p>\n</li>\n<li>\n<p><strong>Sidebar Cart icon:</strong></p>\n</li>\n<li>\n<p>5 front-end styles: The styles of sidebar icons are designed creatively to have more choices for users.</p>\n</li>\n<li>\n<p>45 cart icons: There are many cart icon types from simple to eye-catching to suitable with many styles.</p>\n</li>\n<li>\n<p>Customize the size of cart icon: Change the Sidebar cart icon size with the adjusting ruler.</p>\n</li>\n<li>\n<p>Customize the position of cart icon: Choose the positions for sidebar cart icon on the site by the Sidebar Cart Horizontal and Sidebar Cart Vertical.</p>\n</li>\n<li>\n<p>Shadow for box: Create the box-shadow to make it more impressed</p>\n</li>\n<li>\n<p>Color Settings: Easily to set the color of sidebar cart icon, background,  product counter, Border Radius. The users can choose the colors from the color picker or enter the color hex.</p>\n</li>\n<li>\n<p><strong>Menu Cart:</strong></p>\n</li>\n<li>\n<p>Navigation page: choose to redirect to the cart page or checkout page when clicking on the menu cart icon.</p>\n</li>\n<li>\n<p>Show content: display the content of the cart when hover mouse on the menu cart icon.</p>\n</li>\n<li>\n<p>45 cart icons for you to select.</p>\n</li>\n<li>\n<p>Change the color of the cart icon and cart hover color.</p>\n</li>\n<li>\n<p>Cart icon text: choose to display product quantity, total price, or both quantity and total price on the cart menu.</p>\n</li>\n<li>\n<p>Choose to show the subtotal or total price on menu cart</p>\n</li>\n<li>\n<p>Change the text color of the menu cart.</p>\n</li>\n</ul>\n<h3>PREMIUM FEATURES</h3>\n<p>All features from the free version.</p>\n<p>&#9658; <strong>Sticky Add To Cart Button:</strong> The plugin can display the Sticky add to Cart on single pages which helps to increase the rate of adding products to the cart from customers because Customers can add products without scrolling the bar to find the add to cart button.  Moreover, there are options for excluding products or categories from showing the Sticky add to Cart.</p>\n<ul>\n<li>\n<p><strong>Select Product to Preview:</strong> Help user design sticky add to Cart button easily and effectively</p>\n</li>\n<li>\n<p><strong>Templates:</strong> There are four templates of sticky add to cart button to choose</p>\n</li>\n<li>\n<p><strong>Positions:</strong> Set the positions for sticky add to Cart button.</p>\n</li>\n<li>\n<p><strong>Display of Product ratings and Product Quantity.</strong></p>\n</li>\n<li>\n<p><strong>Set up the colors by color picker of text, background, icon…</strong></p>\n</li>\n<li>\n<p><strong>Adjust the Border radius, image width, size of buttons…</strong></p>\n</li>\n</ul>\n<p>&#9658; <strong>Recently Viewed Products:</strong> The plugin has an option for adding recently views products to the WooCommerce stores to remind customers about what they are interested in and helps them to buy the items they want quickly. Recently viewed products can add to the single product page or anywhere with the shortcode.</p>\n<p>&#9658; <strong>Checkout area on Sidebar Cart – One click checkout WooCommerce:</strong> With the plugin, Checkout steps are integrated into Sidebar Cart. Customers can checkout directly on the sidebar cart without going to the checkout page. This feature will encourage the customers to complete their orders quickly and boost your sales.</p>\n<ul>\n<li>\n<p><strong>Customize the steps of checkout:</strong> The plugin can convert all checkout steps to the sidebar Cart. It helps the Customer to save time to one click checkout WooCommerce without going to the check-out page.</p>\n</li>\n<li>\n<p><strong>Change the title of steps:</strong> Change the title of check-out steps to be suitable for the site.</p>\n</li>\n<li>\n<p><strong>Choose the icons available on checkout area on sidebar Cart:</strong> There are many available icons with different style to choose</p>\n</li>\n<li>\n<p><strong>Set up the color for background, icon, button and border-radius:</strong> The picker color and radius adjusting rules help to design the checkout out area easily and quickly.</p>\n</li>\n</ul>\n<h3>And much more things are waiting for you discover</h3>\n<p><a href=\"https://1.envato.market/bW20B\" rel=\"nofollow ugc\">GET PRO VERSION</a> or <a href=\"https://1.envato.market/bW20B\" rel=\"nofollow ugc\">https://codecanyon.net/item/woocommerce-cart-all-in-one/30184317</a></p>\n<h3>Documentation</h3>\n<ul>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-cart-all-in-one\" rel=\"nofollow ugc\">Getting Started</a></li>\n</ul>\n<h3>Plugin Links</h3>\n<ul>\n<li><a href=\"https://villatheme.com/extensions/woocommerce-cart-all-in-one/\" rel=\"nofollow ugc\">Project Page</a></li>\n<li><a href=\"http://docs.villatheme.com/?item=woocommerce-cart-all-in-one\" rel=\"nofollow ugc\">Documentation</a></li>\n<li><a href=\"https://villatheme.com/supports\" rel=\"nofollow ugc\">Report Bugs/Issues</a></li>\n</ul>\n<h3>MAY BE YOU NEED</h3>\n<p><a href=\"https://bit.ly/subre-product-subscription-for-woo\" rel=\"nofollow ugc\">SUBRE – Product Subscription for WooCommerce</a>: Convert WooCommerce simple products(physical or downloadable/virtual) to subscription products and allow recurring payments</p>\n<p><a href=\"https://bit.ly/clear-autoptimize-cache-automatically\" rel=\"nofollow ugc\">Clear Autoptimize Cache Automatically</a>: Clear Autoptimize cache automatically by cache amount or by time interval</p>\n<p><a href=\"https://bit.ly/fewc-extra-checkout-fields-for-woocommerce\" rel=\"nofollow ugc\">FEWC – WooCommerce Extra Checkout Fields</a>: Manage checkout fields using WordPress Customizer</p>\n<p><a href=\"https://bit.ly/epow-custom-product-options-for-woocommerce\" rel=\"nofollow ugc\">EPOW – Custom Product Options for WooCommerce</a>: Add extra options for products using frontend form builder</p>\n<p><a href=\"https://bit.ly/chinads\" rel=\"nofollow ugc\">ChinaDS – Taobao Dropshipping for WooCommerce</a>: Another Taobao dropshipping solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/9mail-wp-email-templates-designers\" rel=\"nofollow ugc\">9MAIL – WordPress Email Templates Designer</a>: A useful tool for creating and customizing WordPress emails</p>\n<p><a href=\"https://bit.ly/epoi-wordpress-points-and-rewards\" rel=\"nofollow ugc\">EPOI – WP Points and Rewards</a>: Points and Rewards system for a WordPress website</p>\n<p><a href=\"https://bit.ly/webpos-point-of-sale-for-woocommerce\" rel=\"nofollow ugc\">WebPOS – Point of Sale for WooCommerce</a>: Point of Sale solution for WooCommerce stores</p>\n<p><a href=\"https://bit.ly/jagif\" rel=\"nofollow ugc\">Jagif – WooCommerce Free Gift</a>: Giving gifts to your customers can never be more easier</p>\n<p><a href=\"http://bit.ly/woo-coupon-reminder\" rel=\"nofollow ugc\">Coreem – Coupon Reminder for WooCommerce</a>: Send emails to customers to remind them of their coupons, especially ones which are about to expire</p>\n<p><a href=\"https://bit.ly/compe-woo-compare-products\" rel=\"nofollow ugc\">COMPE – WooCommerce Compare Products</a>: Help your customers compare two or more products to find out the right one they need</p>\n<p><a href=\"https://bit.ly/w2s-migrate-woo-to-shopify\" rel=\"nofollow ugc\">W2S – Migrate WooCommerce to Shopify</a>: Migrate WooCommerce products to Shopify easily via the official Shopify REST Admin API</p>\n<p><a href=\"https://bit.ly/redis-woo-dynamic-pricing-and-discounts\" rel=\"nofollow ugc\">REDIS &#8211; WooCommerce Dynamic Pricing and Discounts</a>: Create flexible pricing rules for products</p>\n<p><a href=\"https://bit.ly/exmage\" rel=\"nofollow ugc\">EXMAGE – WordPress Image Links</a>: Save storage by using external image URLs</p>\n<p><a href=\"https://bit.ly/pofily-woo-product-filters\" rel=\"nofollow ugc\">Pofily – WooCommerce Product Filters</a>: Advanced filters for WooCommerce</p>\n<p><a href=\"https://bit.ly/bopo-woo-product-bundle-builder\" rel=\"nofollow ugc\">Bopo – Woo Product Bundle Builder</a>: Let the plugin provide your customers with a very flexible and convenient way to purchase bundles</p>\n<p><a href=\"https://bit.ly/wpbulky\" rel=\"nofollow ugc\">WPBulky – WordPress Bulk Edit Post Types</a>: Save time editing posts/pages/attachment&#8230; and other custom post types except for ones created by WooCommerce(product, shop_order and shop_coupon)</p>\n<p><a href=\"http://bit.ly/bulk-edit-products-for-woo\" rel=\"nofollow ugc\">Bulky &#8211; Bulk Edit Products for WooCommerce</a>: Quickly and easily edit your products in bulk. This plugin will save you tons of time editing products.</p>\n<p><a href=\"http://bit.ly/catna-woo-name-your-price-and-offers\" rel=\"nofollow ugc\">Catna – Woo Name Your Price and Offers</a>: Name Your Price and Offers</p>\n<p><a href=\"http://bit.ly/product-size-chart-for-woo\" rel=\"nofollow ugc\">Product Size Chart For WooCommerce</a>: A simple but flexible solution to create size charts for your products</p>\n<p><a href=\"http://bit.ly/woocommerce-product-pre-orders\" rel=\"nofollow ugc\">Product Pre-Orders for WooCommerce</a>: Product size Chart for WooCommerce customize and design the size chart of specific products or categories.</p>\n<p><a href=\"http://bit.ly/woo-email-template-customizer\" rel=\"nofollow ugc\">Email Template Customizer for WooCommerce</a>: Customize WooCommerce emails to make them more beautiful and professional after only several mouse clicks</p>\n<p><a href=\"http://bit.ly/woo-aliexpress-dropshipping\" rel=\"nofollow ugc\">ALD &#8211; Dropshipping and Fulfillment for AliExpress and WooCommerce</a>: Free dropshipping solution – Transfer data from AliExpress products to WooCommerce effortlessly and fulfill AliExpress orders automatically</p>\n<p><a href=\"http://bit.ly/product-variations-swatches-for-woocommerce\" rel=\"nofollow ugc\">Product Variations Swatches for WooCommerce</a>: Professional and beautiful colors, buttons, images, variation images and radio variations swatches</p>\n<p><a href=\"http://bit.ly/woo-orders-tracking\" rel=\"nofollow ugc\">Orders Tracking for WooCommerce</a>: Import orders tracking number and send tracking info to customers</p>\n<p><a href=\"http://bit.ly/woo-abandoned-cart-recovery\" rel=\"nofollow ugc\">Abandoned Cart Recovery For WooCommerce</a>: Capture abandoned carts &amp; send reminder emails to customers.</p>\n<p><a href=\"http://bit.ly/import-shopify-to-woocommerce\" rel=\"nofollow ugc\">Import Shopify to WooCommerce</a>: Import Shopify to WooCommerce plugin help you import all products from your Shopify store to WooCommerce</p>\n<p><a href=\"http://bit.ly/woo-customer-coupons\" rel=\"nofollow ugc\">Customer Coupons for WooCommerce</a>: Display coupons on your website</p>\n<p><a href=\"http://bit.ly/woo-virtual-reviews\" rel=\"nofollow ugc\">Virtual Reviews for WooCommerce</a>: Virtual Reviews for WooCommerce helps generate virtual reviews, display canned reviews for newly created store</p>\n<p><a href=\"http://bit.ly/woo-thank-you-page-customizer\" rel=\"nofollow ugc\">Thank You Page Customizer for WooCommerce</a>: Customize your Thank You page and give coupons to customers after a successful order</p>\n<p><a href=\"http://bit.ly/sales-countdown-timer\" rel=\"nofollow ugc\">Sales Countdown Timer</a>: Create a sense of urgency with a countdown to the beginning or end of sales, store launch or other events</p>\n<p><a href=\"https://wordpress.org/plugins/woo-suggestion-engine/\" rel=\"ugc\">Suggestion Engine for WooCommerce</a>: The easiest way helps you sell more products by search engine and suggested product form your WooCommerce store.</p>\n<p><a href=\"http://bit.ly/eu-cookies-bar\" rel=\"nofollow ugc\">EU Cookies Bar</a>: A very simple plugin which helps your website comply with Cookie Law</p>\n<p><a href=\"http://bit.ly/woo-lucky-wheel\" rel=\"nofollow ugc\">Lucky Wheel for WooCommerce</a>: Offer customers to spin for coupons by entering their emails.</p>\n<p><a href=\"http://bit.ly/wp-lucky-wheel\" rel=\"nofollow ugc\">WordPress Lucky Wheel</a>: WordPress Lucky Wheel gives you the best solution to get emails address from visitors of your WordPress website</p>\n<p><a href=\"http://bit.ly/woo-advanced-product-information\" rel=\"nofollow ugc\">Advanced Product Information for WooCommerce</a>: Display more intuitive information of products such as sale countdown, sale badges, who recently bought products, rank of products in their categories, available payment methods&#8230;</p>\n<p><a href=\"http://bit.ly/woo-lookbook\" rel=\"nofollow ugc\">LookBook for WooCommerce</a>: Create beautiful Lookbooks, Shoppable with Product Tags</p>\n<p><a href=\"http://bit.ly/woo-photo-reviews\" rel=\"nofollow ugc\">Photo Reviews for WooCommerce</a>: Allow posting reviews include product pictures, review reminder, review for coupons.</p>\n<p><a href=\"http://bit.ly/woo-product-builder\" rel=\"nofollow ugc\">Product Builder for WooCommerce</a>: Allows your customers to build a full product set from small parts step by step. The plugin works base on WooCommerce with many useful features like compatible, email completed product, attributes filters.</p>\n<p><a href=\"http://bit.ly/woo-boost-sales\" rel=\"nofollow ugc\">Boost Sales for WooCommerce</a>: Increase profit on every single order with Up-selling and Cross-selling</p>\n<p><a href=\"http://bit.ly/woo-free-shipping-bar\" rel=\"nofollow ugc\">Free Shipping Bar for WooCommerce</a>: Use free shipping as a marketing tool, encourage customers to pay more for free shipping.</p>\n<p><a href=\"http://bit.ly/woo-notification\" rel=\"nofollow ugc\">Notification for WooCommerce</a>: Social Proof Marketing plugin. Live recent order on the front-end of your site.</p>\n<p><a href=\"http://bit.ly/woo-multi-currency\" rel=\"nofollow ugc\">CURCY – Multi Currency for WooCommerce</a>: Switches to different currencies easily and accepts payment with only one currency or all currencies.</p>\n<p><a href=\"http://bit.ly/woo-coupon-box-free\" rel=\"nofollow ugc\">Coupon Box for WooCommerce</a>: Subscribe emails for discount coupons</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/woo-cart-all-in-one.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/woo-cart-all-in-one/assets/screenshot-1.jpg?rev=2462758",
            "caption": "Sidebar cart"
        },
        {
            "src": "https://ps.w.org/woo-cart-all-in-one/assets/screenshot-2.jpg?rev=2462758",
            "caption": "Checkout area on Sidebar Cart"
        }
    ],
    "tags": {
        "cart-all-in-one-for-woocommerce": "Cart All In One For Woocommerce",
        "wc-cart": "wc cart",
        "wc-mini-cart": "wc mini cart",
        "wc-sticky-cart": "wc sticky cart",
        "woocommerce-mini-cart": "woocommerce mini cart"
    },
    "stable_tag": "trunk",
    "versions": [],
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://www.villatheme.com/donate",
    "banners": {
        "low": "https://ps.w.org/woo-cart-all-in-one/assets/banner-772x250.jpg?rev=3080861",
        "high": "https://ps.w.org/woo-cart-all-in-one/assets/banner-1544x500.jpg?rev=3080861"
    },
    "icons": {
        "1x": "https://ps.w.org/woo-cart-all-in-one/assets/icon-128x128.gif?rev=3080861",
        "2x": "https://ps.w.org/woo-cart-all-in-one/assets/icon-256x256.gif?rev=3080861"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 92,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/woo-cart-all-in-one/blueprint.json?rev=3080861"
        }
    ],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "woo-cart-all-in-one",
            "language": "ru_RU",
            "version": "1.1.15",
            "updated": "2023-05-25 13:46:21",
            "package": "http://downloads.wordpress.org/translation/plugin/woo-cart-all-in-one/1.1.15/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "woo-cart-all-in-one",
            "language": "vi",
            "version": "1.1.15",
            "updated": "2022-11-30 07:31:32",
            "package": "http://downloads.wordpress.org/translation/plugin/woo-cart-all-in-one/1.1.15/vi.zip"
        }
    ]
}