{
    "name": "WooCommerce payment plugin &#8211; Novalnet AG",
    "slug": "woocommerce-novalnet-gateway",
    "version": "12.8.0",
    "author": "<a href=\"https://www.novalnet.de\">Novalnet AG</a>",
    "author_profile": "https://profiles.wordpress.org/novalnet/",
    "contributors": {
        "novalnet": {
            "profile": "https://profiles.wordpress.org/novalnet/",
            "avatar": "https://secure.gravatar.com/avatar/af1ddcf954f6b2090fcb338c523e809f?s=96&d=monsterid&r=g",
            "display_name": "Novalnet AG"
        }
    },
    "requires": "5.0.0",
    "tested": "6.5.5",
    "requires_php": false,
    "requires_plugins": [
        "woocommerce"
    ],
    "compatibility": [],
    "rating": 86,
    "ratings": {
        "5": 3,
        "4": 0,
        "3": 0,
        "2": 1,
        "1": 0
    },
    "num_ratings": 4,
    "support_url": "https://wordpress.org/support/plugin/woocommerce-novalnet-gateway/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 112589,
    "last_updated": "2024-09-03 13:29:00",
    "added": "2013-05-13",
    "homepage": "https://www.novalnet.de/modul/woocommerce",
    "sections": {
        "description": "<h4>(German)</h4>\n<p>(English Description down below)</p>\n<p>Das Novalnet Payment-Plugin für Woocommerce bietet Ihnen eine Vielzahl an hilfreichen Features, die das tägliche Arbeiten mit dem Woocommerce-Shopsystem vereinfachen.</p>\n<p>Wählen Sie aus den weltweit beliebtesten über 100 lokalen und internationalen Zahlungsmethoden die für Sie passenden aus, vom Rechnungskauf über SEPA-Lastschrift bis hin zur Kreditkarte.</p>\n<p>Kreditkartenzahlungen sind zusätzlich durch das 3D-Secure-Verfahren abgesichert, um Ihnen als Shop-Betreiber noch mehr Sicherheit zu bieten. Damit gehört das Plugin der Novalnet AG zu einem der populärsten Extensions im Bereich Payment.</p>\n<p>Das Plugin automatisiert den gesamten Transaktionsvorgang vom Checkout bis zum Forderungsmanagement und Inkasso. Darüber hinaus sichert es die Transaktionen ab und hilft Ihnen als Unternehmen dabei, Ihren Umsatz durch die folgenden Vorteile langfristig zu steigern:</p>\n<ul>\n<li><a href=\"https://www.novalnet.de/zahlungsabwicklung/\" title=\"über 100 lokal und international nachgefragte Zahlungsarten\" rel=\"nofollow ugc\">über 100 lokal und international nachgefragte Zahlungsarten</a> bereits integriert</li>\n<li>umfangreiches <a href=\"https://www.novalnet.de/risikomanagement/\" title=\"Risikomanagement\" rel=\"nofollow ugc\">Risikomanagement</a> zur Minimierung von Zahlungsausfällen durch mehr als 60 im Hintergrund arbeitende Betrugspräventionsmodule</li>\n<li>Für Zahlungsausfälle frei einstellbares, optional kostenloses Forderungsmanagement inkl. verschiedener Mahnstufen</li>\n<li>Automatisierte Rechnungsstellung für Ihre Endkunden</li>\n<li>umfangreiches und kostenloses Debitorenmanagement mit diversen Exportmöglichkeiten für Buchhaltungsprogramme </li>\n<li>Realtime-Monitoring, das Ihren Checkoutprozess in Bezug auf Kaufabbrüche überwacht, und Reporting </li>\n<li>Ihre Gelder sind durch Treuhandkonten zu 100 % u.a. vor einer Insolvenz geschützt</li>\n<li>Kostenfreier technischer Support bei Einbindung und Betrieb des Zahlungs-Plugins</li>\n<li>Attraktive und flexible Auszahlungsmodalitäten</li>\n<li>Optionale Mitgliederverwaltung</li>\n<li>Spezielles Endkundenportal für Rückfragen zur Transaktion</li>\n</ul>\n<p>Einfache SEPA-Lastschrift-Lösung. Sie müssen kein separates Bankkonto eröffnen</p>\n<h4>VERMEIDEN SIE MEHRERE VERTRÄGE UND VERSTECKTE KOSTEN</h4>\n<p>Mehrere Verträge für die Zahlungsabwicklung mit verschiedenen Dienstleistern wie Banken, Kreditkarten-Acquirern, Anbietern von Betrugspräventionen, Inkassounternehmen etc. und mit unterschiedlichen Laufzeiten und Gebühren sind mit Nutzung des Plugins Vergangenheit.</p>\n<p>Die Novalnet-Plattform sorgt dafür, dass Ihre Zahlungen in WooCommerce reibungslos abgewickelt werden, erstellt automatisch Ihre Rechnungen, verschickt pünktlich Mahnungen und verarbeitet auch On-hold-Transaktionen und wiederkehrende Zahlungen.</p>\n<p>Ihre über WooCommerce generierten Transaktionen sind durch ein Höchstmaß an Sicherheit geschützt. Dazu wird die Novalnet AG jedes Jahr in einem umfangreichen Sicherheits-Audit nach dem Payment Card Industry Data Security Standard (PCI DSS) auf dem höchsten Level 1 geprüft und zertifiziert.</p>\n<p>Die vielfach automatisierten Abläufe sorgen dafür, dass Sie Kosten sparen und sich auf Ihren Verkaufserfolg konzentrieren können.</p>\n<h4>WICHTIGSTE FUNKTIONEN</h4>\n<ul>\n<li>Einfache Integration in Ihren Bestellprozess – es wird keine externe Seite für die Zahlung aufgerufen</li>\n<li>Responsive Zahlungsseiten</li>\n<li>Sichere SSL-verschlüsselte Gateways</li>\n<li>Klare Echtzeit-Übersicht und Überwachung des Zahlungsstatus sowie automatisierte E-Mail-Benachrichtigungsfunktion für Zahlungsstatusreports</li>\n<li>Automatisierte Berichte und verschiedene Exportfunktionen für Ihre Buchhaltung in XML, SOAP, CSV, MT940 u.v.m. </li>\n<li>Kreditkartenzahlungen <a href=\"https://www.novalnet.de/service/3d-secure-infos/\" title=\"mit 3D-Secure\" rel=\"nofollow ugc\">mit 3D-Secure</a></li>\n<li><a href=\"https://www.novalnet.de/pci-dss-zertifizierung/\" title=\"PCI-DSS-konform\" rel=\"nofollow ugc\">PCI-DSS-konform</a>, keine aufwändige und teure Zertifizierung notwendig</li>\n</ul>\n<h4>MIT DEM PLUGIN KÖNNEN SIE VIELES DIREKT ÜBER DIE WOOCOMMERCE-EINSTELLUNGEN VERWALTEN</h4>\n<ul>\n<li>Einfache Konfigurationsmöglichkeit für alle Zahlungsarten</li>\n<li>Einfache Möglichkeit zum Bestätigen und Stornieren von On-Hold-Transaktionen</li>\n<li>Einfaches Durchführen von Rückerstattungen aus der Shop-Administration heraus</li>\n<li>Flexible <a href=\"https://www.novalnet.de/abonnementverwaltung/\" title=\"Abonnementverwaltung\" rel=\"nofollow ugc\">Abonnementverwaltung</a> für wiederkehrende Zahlungen</li>\n<li>Flexibles Affiliate-Management für Partnerprogramm-Betreiber</li>\n<li>Sehr einfaches Konfigurieren des Risikomanagements</li>\n<li>Einstellen komfortabler Statusmeldungen, z.B. für Zahlungseingänge bei Kauf auf Rechnung und Vorkasse</li>\n<li>Bequeme E-Mail-Benachrichtigungsfunktion über Statusmeldungen der Zahlungen</li>\n<li>Übersichtliches Status-Management für Chargebacks sowie SEPA-Rücklastschriften</li>\n<li>Vorhalten von Bestelldaten bei Kaufabbrüchen</li>\n</ul>\n<h4>LASSEN SIE IHRE KUNDEN ZAHLEN, WIE SIE MÖCHTEN</h4>\n<ul>\n<li><a href=\"https://www.novalnet.de/zahlungsart-kreditkarte/\" title=\"Kreditkarte\" rel=\"nofollow ugc\">Kreditkarte</a>: Visa, Mastercard, American Express, JCB, UnionPay, Diners Club, Discover</li>\n<li>Debitkarte: Maestro, Carte Bleue, CartaSi, Postepay, PostFinance, dankort</li>\n<li>Online-Überweisung: Sofortüberweisung, Onlineüberweisung eps, iDEAL, giropay, Przelewy24, Alipay, WeChat Pay, Trustly &amp; Blik etc.</li>\n<li>Wallet: Apple Pay, Google Pay, Payconiq, MB Way, PayPal &amp; TWINT.</li>\n<li>Vorkasse, Kauf auf Rechnung, Kauf auf Rechnung mit Zahlungsgarantie</li>\n<li><a href=\"https://www.novalnet.de/sepa-lastschrift/\" title=\"SEPA-Lastschrift\" rel=\"nofollow ugc\">SEPA-Lastschrift</a>, Lastschrift ACH</li>\n<li>Barzahlen/viacash</li>\n<li>Ratenzahlung</li>\n<li>Direct Carrier Billing (Zahlen per Handyrechnung)</li>\n<li>Kauf auf  Rechnung und <a href=\"https://www.novalnet.de/lastschrift-mit-zahlungsgarantie/\" title=\"SEPA-Lastschrift sind auch mit Zahlungsgarantie\" rel=\"nofollow ugc\">SEPA-Lastschrift sind auch mit Zahlungsgarantie</a> möglich.</li>\n</ul>\n<h4>GEHEN SIE AUF NUMMER SICHER</h4>\n<p>Die intelligente Novalnet-Betrugsprävention ist abhängig von Zahlungsart, Produktpalette und Warenkorbgröße. Durch zahlreiche, unabhängig zuschaltbare Fraudmodule verringert sich Ihre Zahlungsausfallquote spürbar.</p>\n<h4>SIE HABEN FRAGEN?</h4>\n<p>Kontaktieren Sie uns per E-Mail an <a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> oder telefonisch unter +49 89 9230683-20.</p>\n<p>Weitere Informationen über Novalnet und zur Kompatibilität des Novalnet-Payment-Plugins finden Sie weiter unten.</p>\n<h4>(English)</h4>\n<h4>ACCEPT, MANAGE &amp; COLLECT PAYMENTS &#8211; WOOCOMMERCE</h4>\n<p>The WooCommerce Payment Plugin from Novalnet allows you to accept, manage and collect payments. It is designed to optimize your payment processing, enrich customer experiences and improve conversion rates.<br />\nHundreds of e-commerce businesses across the world use this plugin to:</p>\n<ul>\n<li>Accept 100+ international &amp; local payment methods</li>\n<li>Add new payment methods any time</li>\n<li>Manage payments, subscriptions &amp; members </li>\n<li>Secure transactions with proven risk management</li>\n<li>Avoid own <a href=\"https://www.novalnet.com/pci-dss-certification/\" title=\"PCI DSS certification\" rel=\"nofollow ugc\">PCI DSS certification</a> </li>\n<li>Automate customer communication related to payments</li>\n<li>Provide payment support for end customers</li>\n<li>Follow transactions in real time</li>\n<li>Automate reporting for bookkeeping &amp; other departments etc.</li>\n</ul>\n<h4>WIDE PAYMENT PORTFOLIO FOR YOUR ONLINE SHOP</h4>\n<p>The WooCommerce Novalnet Payment Plugin enables access to <a href=\"https://www.novalnet.com/paymentsolution/payment-processing/\" title=\"international and local payment methods\" rel=\"nofollow ugc\">international and local payment methods</a> that can be easily integrated to your checkout process already today. Your payment portfolio remains up to date and follows both global and local payment trends across the world.</p>\n<p>Novalnet’s WooCommerce Payment Plugin supports:</p>\n<ul>\n<li>\n<p><a href=\"https://www.novalnet.com/payment-processing/credit-card/\" title=\"Credit cards\" rel=\"nofollow ugc\">Credit cards</a> (3DSecure also available): Visa, Mastercard, American Express, JCB, UnionPay, Diners Club,  Discover etc.</p>\n</li>\n<li>\n<p>Debit cards: Maestro, Visa, Carte Bleue, CartaSi, Postepay, PostFinance, dankort etc.</p>\n</li>\n<li>\n<p>Online bank transfers: Sofort, Online bank transfer, eps, iDEAL, giropay, Przelewy24, PostFinance Card, PostFinance E-Finance, Bancontact, Alipay, WeChat Pay, Trustly &amp; Blik etc.</p>\n</li>\n<li>\n<p>E-wallets:  <a href=\"https://www.novalnet.com/payment-processing/paypal/\" title=\"PayPal\" rel=\"nofollow ugc\">PayPal</a>, Apple Pay, Google Pay, Payconiq, MB Way &amp; TWINT.</p>\n</li>\n<li>\n<p>Prepayment, Invoice, <a href=\"https://www.novalnet.com/solutions/payment-processing/sepa-direct-debit/\" title=\"Direct Debit SEPA\" rel=\"nofollow ugc\">Direct Debit SEPA</a>, Direct Debit ACH, <a href=\"https://www.novalnet.com/solutions/payment-processing/barzahlen/\" title=\"Barzahlen\" rel=\"nofollow ugc\">Barzahlen/viacash</a> &amp; Multibanco.</p>\n</li>\n<li>\n<p>Direct Debit SEPA with payment guarantee, Invoice with payment guarantee, Instalment by Invoice &amp; Instalment by Direct Debit SEPA</p>\n</li>\n</ul>\n<p>More information about each payment method can be found on our <a href=\"https://www.novalnet.com/payment/\" title=\"website\" rel=\"nofollow ugc\">website</a>. If you have any additional inquiries, please do not hesitate to contact us at <a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> or +49 89 9230683-20.</p>\n<h4>ADVANCED PAYMENT EXPERIENCES FOR YOUR CUSTOMERS</h4>\n<p>Novalnet Payment Gateway for WooCommerce ensures that your WooCommerce offers seamless payment experiences. It provides optimized customer communications and auto-fill of payment details for future purchases. Set up email notifications and reminders for payment status updates and offer valuable customer support through Novalnet platform.</p>\n<h4>DIGITALIZATION &amp; REAL-TIME MONITORING</h4>\n<p>Novalnet’s WooCommerce Payment Plugin integrates your shop with one payment platform that covers all payment methods and services at once. Save costs, manual effort and time with the following WooCommerce Payment Plugin features.</p>\n<h4>KEY FEATURES</h4>\n<ul>\n<li>Easy configuration of all international &amp; local payment methods</li>\n<li>Unified monitoring, reporting, and payouts for all payment methods</li>\n<li>Easy to install &amp; configure without technical understanding</li>\n<li>Plug &amp; Play &#8211; no extra plugins/scripts needed to process transactions </li>\n<li>No PCI DSS certification required when using our payment module</li>\n<li>60+ risk &amp; payment fraud detection modules to prevent defaults in real time</li>\n<li>Secure SSL- encoded gateways</li>\n<li>One-click shopping supported for Credit/Debit Cards, Direct Debit SEPA, Direct Debit SEPA with payment guarantee &amp; Instalment by Direct Debit SEPA</li>\n<li>Zero amount authorization supported for Credit/Debit Cards, Direct Debit SEPA, Apple Pay &amp; Google Pay</li>\n<li>Custom CSS configuration for Credit/Debit Card iframe</li>\n<li>Automated invoice generation</li>\n<li>Easy confirmation/cancellation of on-hold transactions for Direct Debit SEPA, Direct Debit SEPA with payment guarantee, Instalment payment for Direct Debit SEPA, Credit/Debit Card, Invoice, Invoice with payment guarantee, Instalment payment for Invoice, Prepayment, PayPal, Apple Pay &amp; Google Pay</li>\n<li>Refund option for Credit/Debit Cards, Direct Debit SEPA, Direct Debit ACH, Direct Debit SEPA with payment guarantee, Instalment by Direct Debit SEPA, Invoice, Invoice with payment guarantee, Instalment by Invoice, Prepayment, Barzahlen/viacash, Sofort, iDEAL, eps, giropay, PayPal, MB Way, Przelewy24, PostFinance Card, PostFinance E-Finance, Bancontact, Apple Pay, Google Pay, Online bank transfer, Alipay, WeChat pay, Trustly, Blik, Payconiq &amp; TWINT.</li>\n<li>Automated e-mail notifications for staying up to date on the payment status</li>\n<li>Clear overview of payment status from checkout to receivables</li>\n<li>Secure end customer portal for payment inquiries </li>\n<li>Fully-automated debt collection</li>\n<li>Multilevel claims management with integrated handover to collection and various export functions for the accounting</li>\n<li>Affiliate solution supporting frictionless onboarding, split payments &amp; currency conversion </li>\n<li>Automated bookkeeping report in XML, SOAP, CSV, MT940</li>\n<li>Free technical support upon integration</li>\n<li>Dynamic subscription management for recurring payments</li>\n<li>Subscription management (suspend, reactivate, cancel, change payment method, change next cycle date, change subscription amount)</li>\n<li>Automatic order creation when subscriptions are renewed</li>\n<li>Transaction amount update option for Direct Debit SEPA, Direct Debit ACH Invoice, Prepayment &amp; Barzahlen/viacash</li>\n<li>Order creation process handled for shop admin</li>\n<li>Responsive templates</li>\n</ul>\n<h4>PCI COMPLIANT RISK MANAGEMENT &amp; FRAUD PREVENTION</h4>\n<p>Novalnet provides all its merchants secure payment processing in a PCI DSS Level 1 compliant manner. More than <a href=\"https://www.novalnet.com/fraud-prevention/\" title=\"60 fraud prevention modules\" rel=\"nofollow ugc\">60 fraud prevention modules</a> are integrated to ensure machine learning fraud prevention and optimal risk minimization in real-time.</p>\n<h4>AVOID MULTIPLE CONTRACTS &amp; HIDDEN COSTS</h4>\n<p>This free WooCommerce Payment Plugin integrates your e-commerce business with Novalnet’s all-in-one payment platform to grow revenue. The integration and services are customizable based on individual customer needs. Novalnet’s prizing depends on your business model and chosen payment methods.</p>\n<p>Please contact us for more information:<a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> or +49 89 9230683-20.</p>\n<h4>ABOUT NOVALNET AG</h4>\n<p><a href=\"https://www.novalnet.de/\" title=\"Novalnet\" rel=\"nofollow ugc\">Novalnet</a> is a financial service institution offering payment solutions world-wide. We support customers all the way from setting up payment types and intelligent fraud prevention modules, to legitimate and reliable receivables and claims management. Operating in the market as a full payment service provider since 2007, we enable maximal reliability and client focus to all customers in every area of payment processing. Novalnet AG is a licensed payment institute which is regulated by the Federal Financial Supervisory Authority (BaFin).</p>\n<h4>PLUGIN COMPATIBILITY</h4>\n<p>To process Novalnet payments through this WooCommerce Payment Plugin, a <a href=\"https://www.novalnet.de/kontakt\" title=\"Novalnet account\" rel=\"nofollow ugc\">Novalnet account</a> is needed.</p>\n<ul>\n<li>Compatible with WordPress/WooCommerce plugins</li>\n<li>Works with WooCommerce Subscription plugin</li>\n<li>Works with WordPress Multi-Site</li>\n<li>Supports Sequential Order Numbers Pro Plugin (Custom Order Numbers for WooCommerce)</li>\n<li>Supports Debug Log feature  </li>\n</ul>\n<h4>REFERENCE</h4>\n<p>Please check out our ssl certified <a href=\"https://woocommerce.novalnet.de/\" title=\"Demo Store\" rel=\"nofollow ugc\">Demo Store</a></p>\n<h3>Arbitrary section</h3>\n<h4>Connect to WooCommerce:</h4>\n<ol>\n<li>\n<p>Switch back to the WordPress admin area.</p>\n</li>\n<li>\n<p>Click on &#8220;WooCommerce&#8221; in the menu on the left and click directly on the sublevel tab &#8220;Settings&#8221; tab there.</p>\n</li>\n<li>\n<p>Inside the &#8220;Novalnet Global Configuration&#8221; tab you will have the Novalnet merchant global configuration. It will follow the below mentioned structure</p>\n<ul>\n<li>\n<p><strong>Product activation key</strong> Kindly enter the exact key from Novalnet admin area</p>\n</li>\n<li>\n<p><strong>Payment access key</strong> Kindly enter the exact key from Novalnet admin area</p>\n</li>\n<li>\n<p><strong>Select Tariff ID</strong> Kindly select the tariff from the list</p>\n</li>\n<li>\n<p><strong>Subscription Tariff ID</strong> Kindly select the subscription tariff from the list</p>\n</li>\n<li>\n<p><strong>Display payment method logo</strong> Option to display the payment logo for all payments. Logo will be displayed at the checkout</p>\n</li>\n<li>\n<p><strong>Subscription Management</strong> Subscription settings</p>\n</li>\n<li>\n<p><strong>Notification / Webhook URL</strong> Notification / Webhook URL settings</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Please click on the “Checkout” tab in order to configure your Novalnet payment interface properly. Inside the “Checkout” tab you will have the individual payment (eg. Direct Debit SEPA) configuration. The payment configuration is structured as follows:</p>\n<ul>\n<li>\n<p><strong>Enable payment method</strong> Option to enable respective payment. Payment will be displayed at the checkout</p>\n</li>\n<li>\n<p><strong>Enable test mode</strong> Option for the respective payment mode to be in live or test mode</p>\n</li>\n<li>\n<p><strong>Title</strong> The freely configurable description entered here is displayed when your customers select the respective payment type</p>\n</li>\n<li>\n<p><strong>Description</strong> The freely configurable description entered here is displayed when your customers select the respective payment type</p>\n</li>\n<li>\n<p><strong>One-click shopping</strong> One click shopping for One-click shopping supported for Credit/Debit Cards, Direct Debit SEPA, Direct Debit ACH, Direct Debit SEPA with payment guarantee &amp; Instalment by Direct Debit SEPA.</p>\n</li>\n</ul>\n</li>\n</ol>\n<p>Now, just the following steps have to be executed for going live:</p>\n<h4>TRANSLATIONS</h4>\n<ul>\n<li>English</li>\n<li>German</li>\n</ul>\n<h4>GO-LIVE:</h4>\n<p>Now execute the following steps to go live and start your sales:</p>\n<ul>\n<li>Install the WooCommerce Payment Plugin by Novalnet directly from the WordPress repository </li>\n<li>Find the detailed information in the Installation Guide (incl. in the package) </li>\n<li>Configure Product Activation Key and Payment Access Key in the shop admin panel</li>\n<li>Activate &amp; configure the preferred payment types in your shop admin panel </li>\n<li>You are ready to go!</li>\n</ul>\n<p>Please contact <a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> / 0049-89-923 068 320 for any technical issues or questions.</p>\n<h4>DISTRIBUTION</h4>\n<p>This plugin enables the integration between WooCommerce and Novalnet payments. The plugin is free and released under the GNU General Public License. If you have found this script useful, please let also others know about it! Recommendations as well as comments in the merchant forum will be appreciated!</p>\n",
        "installation": "<h4>Compatibility</h4>\n<p>Novalnet payment plugin compatible for WooCommerce 4.0.0-9.2.3 and compatible for subscription 2.0.0-6.6.1.</p>\n<h4>Automatic Installation:</h4>\n<ul>\n<li>Go to Plugins &gt; “Add New”.</li>\n<li>Download the WooCommerce payment plugin &#8211; Novalnet from WordPress repository and Click &#8220;Install Now&#8221; to install the plugin. A popup window will ask you to confirm your wish to install the plugin 12.8.0.</li>\n</ul>\n<h4>Note:</h4>\n<p>If this is the first time you&#8217;ve installed a WordPress plugin, you may need to enter the FTP login credential information. If you&#8217;ve installed the plugin before, it will still have the login information. This information is available through your web server host.</p>\n<ul>\n<li>Click “Proceed” to continue the installation. The resulting installation screen will list the installation as successful or note any problems during the install.</li>\n<li>If successful, click &#8220;Activate Plugin&#8221; to activate it, or “Return to Plugin Installer” for further actions.</li>\n</ul>\n<h4>Manual Installation:</h4>\n<ul>\n<li>Download WooCommerce payment plugin &#8211; Novalnet to your desktop. (If downloaded as a zip archive, extract the plugin folder to your desktop.)</li>\n<li>Copy the plugin folder and paste into root/wp-content/plugins/ directory.</li>\n<li>Go to Plugins (Novalnet payment plugin &#8211; WooCommerce) screen and find the “Novalnet payment plugin &#8211; WooCommerce” in the list.</li>\n<li>Click “Activate Plugin” to activate it.</li>\n<li>Check the details in the readme file for customization and further instructions.</li>\n</ul>\n<h4>Now you can get your Product activation key from the Novalnet Admin Portal:</h4>\n<p>For this, kindly login into the Novalnet Admin Portal:</p>\n<ol>\n<li>Go to http://www.novalnet.com and click on &#8220;Login&#8221; (top right). You will be redirected to Novalnet Admin Portal login form.</li>\n<li>Inside the Novalnet Admin Portal, choose the tab &#8220;Projects&#8221; and click on the respective project in the list.</li>\n<li>Click on the tab &#8220;API credentials&#8221;.</li>\n<li>You can find the Product activation key, Payment access key and enter the keys in Novalnet global configuration. Click on the &#8220;Save changes&#8221; button to configure and save the merchant details.</li>\n</ol>\n<h4>Now you have all required details to finish setting up your WooCommerce webshop!</h4>\n",
        "faq": "\n<dt id='do%20i%20require%20an%20novalnet%20merchant%20account%20before%20i%20can%20use%20the%20woocommerce%20novalnet%20payment%20plugin%3F'>\nDo I require an Novalnet merchant account before I can use the WooCommerce Novalnet payment plugin?\n</h4>\n<p>\n<p>Yes, in order to use this plugin and access all popular online payment methods within your WooCommerce webshop you must require valid and approved Novalnet account. please contact our sales team <strong>sales@novalnet.de / 0049-89-923 068 320</strong></p>\n</p>\n<dt id='where%20merchant%20can%20find%20product%20activation%20key%3F'>\nWhere merchant can find product activation key?\n</h4>\n<p>\n<p>To get the Product Activation Key, please go to <a href=\"https://admin.novalnet.de/\" title=\"Novalnet admin portal\" rel=\"nofollow ugc\">Novalnet admin portal</a> &#8211; Projects: Project Information &#8211; API credentials: API Signature (Product activation key).</p>\n</p>\n<dt id='how%20to%20configure%20server%20ip%2C%20vendor%20script%20url%20%26%20paypal%20api%3F'>\nHow to configure server IP, vendor script URL &amp; Paypal API?\n</h4>\n<p>\n<p><strong>IP Address Configuration</strong></p>\n<p>For all API access (Auto configuration with Product Activation Key, loading Credit Card iframe, Transaction API access, Transaction status enquiry, and update), it is required to configure a server IP address in Novalnet administration portal.</p>\n<p>To configure an IP address, please go to <a href=\"https://admin.novalnet.de/\" title=\"Novalnet admin portal\" rel=\"nofollow ugc\">Novalnet admin portal</a> &#8211; Account &#8211; Global configuration &#8211; Payment Request IP&#8217;s &#8211; Update Payment Request IP.</p>\n<p><strong>Notification &amp; Webhook URL Configuration</strong></p>\n<p>Notification &amp; Webhook URL is required to keep the merchant’s database/system up-to-date and synchronized with Novalnet transaction status. It is mandatory to configure the Vendor Script URL in Novalnet administration portal.</p>\n<p>Novalnet system (via asynchronous) will transmit the information on each transaction and its status to the merchant’s system.</p>\n<p>To configure Vendor Script URL, please go to <a href=\"https://admin.novalnet.de/\" title=\"Novalnet admin portal\" rel=\"nofollow ugc\">Novalnet admin portal</a> &#8211; Projects: Project Information &#8211; API credentials &#8211; Vendor script URL / Notification &amp; Webhook URL.</p>\n<p><strong>PayPal API Configuration</strong></p>\n<p>To configure PayPal API details, please go to <a href=\"https://admin.novalnet.de/\" title=\"Novalnet admin portal\" rel=\"nofollow ugc\">Novalnet admin portal</a> &#8211; Projects: Project Information &#8211; Payment Methods: PayPal &#8211; Configure.</p>\n</p>\n<dt id='does%20this%20plugin%20work%20with%20other%20webshop%20plugins%3F'>\nDoes this plugin work with other Webshop Plugins?\n</h4>\n<p>\n<p>This online payment plugin only works with the WooCommerce webshop. Are you looking for other online payment modules for webshop software? Please Find the complete overview of our webshop modules on our website. https://www.novalnet.de</p>\n</p>\n\n",
        "changelog": "<h4>12.8.0</h4>\n<ul>\n<li>[New] Implemented TWINT payment</li>\n<li>[Fix] Order status is now correctly updated to reflect successful transactions made on the second attempt via PayPal payment</li>\n<li>[Enhanced] API/Webhook Response is normalized in the payment plugin for Instalment Payments</li>\n</ul>\n<h4>12.7.0</h4>\n<ul>\n<li>[New] Implemented Direct Debit ACH, Blik, MB Way and Payconiq payments</li>\n<li>[Fix] Payment plugin has been updated to handle the &#8220;Refunded&#8221; order status specifically for overpaid amounts</li>\n<li>[Fix] Incorrect order statuses occurring when multiple orders are placed using the same browser session</li>\n<li>[Enhanced] Optimized the Callback/Webhook process for fetching Dynamic IP</li>\n<li>[Enhanced] Plugin name in the header comment is required to meet WordPress standards</li>\n</ul>\n<h4>12.6.4</h4>\n<ul>\n<li>[Fix] Display of PayPal and Guarantee payments for free trial subscription with signup fee</li>\n<li>[Fix] Instalment Payments are now handled for WooCommerce Block Checkout</li>\n<li>[Enhanced] Offering Instalment payments to B2B customers in Switzerland</li>\n<li>[Enhanced] Extension of Instalment Payment cycles till 36 cycles</li>\n<li>[Enhanced] Minification of CSS and JavaScript files for enhanced performance</li>\n</ul>\n<h4>12.6.3</h4>\n<ul>\n<li>[Fix] Return URLs integrated with payment requests during tokenization for Credit Card and Debit Card payments</li>\n<li>[Fix] Order numbers are included in the callback event email for accurate transaction mapping</li>\n<li>[Fix] Apple Pay transactions are restricted to countries other than the non-shipping country</li>\n<li>[Enhanced] Built-in Sub-Resource Integrity (SRI) integrated for JavaScript files to improve security for preventing unauthorized modifications</li>\n<li>[Removed] Restricted PayPal payment method for the Zero amount transactions</li>\n</ul>\n<h4>12.6.2</h4>\n<ul>\n<li>[Fix] Plugin optimized for High-Performance Order Storage (HPOS) for WooCommerce</li>\n<li>[Fix] Notifying shop admin about wallet payment transactions via Germanized Plugin</li>\n<li>[Fix] Plugin made compatible to work for block-based cart/checkout</li>\n</ul>\n<h4>12.6.1</h4>\n<ul>\n<li>[Fix] Customer Order notes are not displayed in the order confirmation email </li>\n<li>[Enhanced] Subscription renewal order was created for failed transactions with the ACTIVE_WITH_COLLECTION webhook parameter</li>\n</ul>\n<h4>12.6.0</h4>\n<ul>\n<li>[New] Implemented Zero amount authorization for the payments Credit/Debit Cards, Direct Debit SEPA, Apple Pay &amp; Google Pay</li>\n<li>[Removed] Payment due date configuration for Direct Debit SEPA With Payment Guarantee</li>\n</ul>\n<h4>12.5.6</h4>\n<ul>\n<li>[Fix] Adapted Credit/Debit Cards iframe for proper loading while using the WPML plugin</li>\n<li>[Fix] Restricted duplicate order creation with same TID during communication failure</li>\n<li>[Fix] Exact date information shown on the subscription notes during the &#8220;Pay for the order&#8221; process</li>\n<li>[Enhanced] Payment description updated while changing the subscription payment method</li>\n<li>[Enhanced] For IBAN-specific countries, the BIC field required for the Gibraltar country for the payments like Direct Debit SEPA, Direct Debit SEPA with payment guarantee and Instalment by Direct Debit SEPA</li>\n</ul>\n<h4>12.5.5</h4>\n<ul>\n<li>[Fix] Plugin made compatible for WooCommerce version 7.5.1 </li>\n<li>[Fix] Handled Guest users under the ‘Pay for order’ process</li>\n<li>[Fix] Amount mismatch handled for WordPress Multilingual functionality</li>\n</ul>\n<h4>12.5.4</h4>\n<ul>\n<li>[Fix]  Subscription free trial interval remains unchanged when payment zone is updated</li>\n<li>[Fix] Subscription renewal orders placed successfully after migrating from other payment provider</li>\n</ul>\n<h4>12.5.3</h4>\n<ul>\n<li>[Fix]  Subscription change payment method update from Shop default payment to Novalnet payment</li>\n<li>[Removed] Button Theme configuration for Google Pay payment</li>\n</ul>\n<h4>12.5.2</h4>\n<ul>\n<li>[Fix] Double bookings restricted for subscription transactions during subscription cycle date update</li>\n</ul>\n<h4>12.5.1</h4>\n<ul>\n<li>[Fix] Quick cancellation of digital subscription products handled through &#8216;Cancel Now&#8217; button</li>\n<li>[Fix] Subscription cancellation restricted to free trial products and recurring zero amount transactions</li>\n<li>[Enhanced] For failed subscription renewal, status update is handled through Callback/webhook</li>\n</ul>\n<h4>12.5.0</h4>\n<ul>\n<li>[New] Implemented shop-based subscription</li>\n<li>[Enhanced] Invoice payment name is updated for German translation</li>\n<li>[Removed] One-click shopping for PayPal payment</li>\n</ul>\n<h4>12.4.0</h4>\n<ul>\n<li>[New] Implemented Google Pay, Trustly, WeChat Pay and Alipay payments</li>\n<li>[New] Apple Pay and Google Pay payments are now supported for the Subscription process</li>\n<li>[New] Updated cart details to PayPal</li>\n<li>[New] Callback/webhook events for payment reminders and submission to the collection agency has been added</li>\n<li>[Enhanced] For IBAN-specific countries, the BIC field displayed for payment like Direct Debit SEPA, Direct Debit SEPA with payment guarantee and Instalment by Direct Debit SEPA</li>\n</ul>\n<p>= 12.3.1</p>\n<p>*[Fix] Adjusted Java script for loading Credit/Debit Card form</p>\n<h4>12.3.0</h4>\n<ul>\n<li>[New] Implemented Online bank transfer payment</li>\n<li>[New] Added &#8220;state&#8221; parameter in the payment request</li>\n</ul>\n<h4>12.2.0</h4>\n<ul>\n<li>[New] Implemented Apple Pay payment</li>\n<li>[Fix] Shop admin receives the order confirmation email even after integrating with Germanized Plugin</li>\n<li>[Enhanced] Updated payment logo for sofort payment</li>\n</ul>\n<h4>12.1.0</h4>\n<ul>\n<li>[New] Order creation process handled from the shop admin panel</li>\n</ul>\n<h4>12.0.11</h4>\n<ul>\n<li>[Fix] Adjusted payment plugin, when changing subscription product into normal product</li>\n</ul>\n<h4>12.0.10</h4>\n<ul>\n<li>[Fix] Adjusted the payment plugin for multistep checkout page to support Germanized pro plugin</li>\n<li>[Fix] Adjusted the instalment cycle amount in order confirmation e-mail for end-customers</li>\n</ul>\n<h4>12.0.9</h4>\n<ul>\n<li>[Fix] Default Hold stock duration is extended for pending orders to avoid order cancellation</li>\n<li>[Fix] Order amount rounded to 2 decimal factors while sending to the Novalnet server</li>\n</ul>\n<h4>12.0.8</h4>\n<ul>\n<li>[Fix] Payment redirection is optimized for successful transactions when previous transactions failed for the same order</li>\n</ul>\n<h4>12.0.7</h4>\n<ul>\n<li>[Fix] Optimized payment enabling in the payment method page</li>\n<li>[Enhanced] Credit/Debit Cards payment method description</li>\n<li>[Enhanced] Optimized the payment plugin for Virtual and Downloadable products</li>\n<li>[Enhanced] For every recurring subscription orders the parent order number is used as reference transactions</li>\n</ul>\n<h4>12.0.6</h4>\n<ul>\n<li>[New] Subscription reactivation handled, when Subscription order is &#8216;Cancelled&#8217;</li>\n<li>[Fix] Error logs from Przelewy24 payment</li>\n<li>[Fix] Adjusted the payment plugin for Cron execution error</li>\n<li>[Fix] Refund process for PayPal payment</li>\n<li>[Fix] Exact order numbers are fetched and updated for the subscription renewal orders</li>\n<li>[Enhanced] Instalment summary template for Instalment by Direct Debit SEPA and Instalment by Invoice</li>\n</ul>\n<h4>12.0.5</h4>\n<ul>\n<li>[Fix] HTML Tag in &#8220;Customer provided note&#8221; for WooCommerce 5.0.0 compatibility </li>\n</ul>\n<h4>12.0.4</h4>\n<ul>\n<li>[Fix] Notice error during wp-cron execution </li>\n<li>[Fix] Webhook: Transaction update status reflected as a transaction refund for instalment payments</li>\n<li>[Fix] Invoice &amp; Direct Debit SEPA payment methods are disabled during the subscription change payment method when payment guaranteed conditions are met </li>\n<li>[Fix] Change payment option hidden in shop front-end when the minimum order amount is configured for subscription payments</li>\n<li>[Enhanced] Added NovalnetUtility.js in the checkout page</li>\n<li>[Enhanced] Webhook: Transaction refund updated for the corresponding instalment cycles</li>\n<li>[Enhanced] Subscription change payment method in back-end has been optimized for the Credit/Debit payment</li>\n<li>[Enhanced] Updated new transaction details in the subscription notes section for subscription change payment method</li>\n</ul>\n<h4>12.0.3</h4>\n<ul>\n<li>[Fix] Amount mismatched during Credit Card authentication process  </li>\n</ul>\n<h4>12.0.2</h4>\n<ul>\n<li>[Fix] Optimized IP condition check for the parameter transaction.system_ip  </li>\n<li>[Fix] Payment plugin has been adjusted for the guest users during signup process in the checkout page</li>\n<li>[Fix] Payment plugin has been adjusted for 32 bit operating system  </li>\n<li>[Fix] Subscription reactive and cancelled handled for the expired subscriptions</li>\n<li>[Fix] Callback execution has been optimized to execute without the order number</li>\n<li>[Enhanced] Adjusted validation in the checkout page for date of birth field</li>\n<li>[Enhanced] Payment confirmation mail for end-customer designed with a new email template</li>\n</ul>\n<h4>12.0.1</h4>\n<ul>\n<li>[Fix] Installment renewal summary update  </li>\n<li>[Fix] Extended the support for the customized order number</li>\n<li>[Enhanced] Added new parameter: customer.tel</li>\n</ul>\n<h4>12.0.0</h4>\n<ul>\n<li>Major version release: Entire restructure &amp; optimization of the older version with usability, additional features, and customizations.  </li>\n</ul>\n<h4>11.3.5</h4>\n<ul>\n<li>[Fix] Chrome Samesite Cookies     </li>\n</ul>\n<h4>11.3.4</h4>\n<ul>\n<li>[New] Customized date of birth field in checkout page</li>\n<li>[Fix] Compatibility for WooCommerce 3.9.1     </li>\n</ul>\n<h4>11.3.3</h4>\n<ul>\n<li>[New] German text has been added for date of birth text field</li>\n<li>[New] In the checkout page, instalments cycle information has been displayed for the end customer</li>\n<li>[Enhanced] Credit Card iframe has been optimized</li>\n<li>[Enhanced] Vendor script has been optimized        </li>\n</ul>\n<h4>11.3.2</h4>\n<ul>\n<li>[New] Update shipping address to PayPal</li>\n<li>[Removed] Instalments cycle information removed for the end customer</li>\n</ul>\n<h4>11.3.1</h4>\n<ul>\n<li>[Fix] Subscription woocommerce_scheduled_subscription_end_of_prepaid_term type action has been unscheduled for the reactivated subscription</li>\n<li>[Fix] Novalnet Merchant Administration Portal link has been updated in the backend order notes</li>\n<li>[Fix] Order status issue for Przelewy24 payment based on the external plugin for customizing the order number</li>\n<li>[Enhanced] Adjusted the Novalnet payment plugin based on the woocommerce subscription plugin</li>\n</ul>\n<h4>11.3.0</h4>\n<ul>\n<li>[New] Implemented instalment payment for Direct Debit SEPA and Invoice</li>\n<li>[Enhanced] Adjusted the payment module for IPV6 condition </li>\n<li>[Enhanced] Implemented new encryption method for redirect payments </li>\n<li>[Enhanced] Auto configuration call perform via cURL method </li>\n<li>[Enhanced] Callback has been optimized as per the new testcase </li>\n<li>[Removed] Payment reference configuration for Invoice / prepayment </li>\n<li>[Removed] Transaction reference in payments</li>\n</ul>\n<h4>11.2.16</h4>\n<ul>\n<li>[Fix] Adjusted validation in the checkout page for company field</li>\n<li>[Fix] Issue in displaying the Guaranteed Direct Debit SEPA payment in checkout page</li>\n<li>[Fix] Issue in subscription change payment method for Direct Debit SEPA</li>\n</ul>\n<h4>11.2.15</h4>\n<ul>\n<li>[Fix] Issue with checkout process on account creation</li>\n<li>[Fix] Adjusted Java script for loading Credit Card form</li>\n<li>[Enhanced] New language adopted for Deutsch(sie)</li>\n<li>[Enhanced] Novalnet bank details will be displayed in invoice for on-hold transactions in Invoice, Invoice with payment guarantee and Prepayment</li>\n</ul>\n<h4>11.2.14</h4>\n<ul>\n<li>[Enhanced] Novalnet payment plugin has been optimized for checkout template</li>\n</ul>\n<h4>11.2.13</h4>\n<ul>\n<li>[Fix] Compatible issue for WooCommerce 3.6.1</li>\n</ul>\n<h4>11.2.12</h4>\n<ul>\n<li>[Fix] Updated the multistep checkout page working for the Germanized pro plugin</li>\n<li>[Enhanced] Subscription cancellation option for end user with merchant control</li>\n<li>[Enhanced] Novalnet payment plugin has been optimized as per new test case</li>\n</ul>\n<h4>11.2.11</h4>\n<ul>\n<li>[Fix] Updated the subscription change payment method working in the vendor script</li>\n<li>[Fix] Updated the multistep checkout page working for the Germanized pro plugin</li>\n</ul>\n<h4>11.2.10</h4>\n<ul>\n<li>[Fix] Unified processing and checking of session</li>\n<li>[Fix] Handling of communication failure for payments with payment guarantee</li>\n<li>[Enhanced] Enhanced synchronization between shop and Novalnet system</li>\n</ul>\n<h4>11.2.9</h4>\n<ul>\n<li>[Fix] Compatible issue for WordPress 5</li>\n<li>[Enhanced] Guaranteed payment minimum amount reduced to 9.99 EUR</li>\n<li>[Removed] Autofill for payment data</li>\n<li>[Removed] BIC field for Direct Debit SEPA</li>\n</ul>\n<h4>11.2.8</h4>\n<ul>\n<li>[Enhanced] Guaranteed payment pending status has been implemented</li>\n<li>[Enhanced] Callback has been optimized as per the new testcase</li>\n</ul>\n<h4>11.2.7</h4>\n<ul>\n<li>[Fix] Adjusted payment module to restrict the double transaction in custom theme</li>\n</ul>\n<h4>11.2.6</h4>\n<ul>\n<li>[New] Custom checkout overlay for Barzahlen</li>\n<li>[New] Force 3D secure process has been implemented as per predefined filters and settings in the Novalnet admin portal</li>\n<li>[Enhanced] Due date update notification in the shop, on activation of transaction for Invoice, Invoice with payment guarantee and Prepayment</li>\n<li>[Enhanced] On-hold transaction configuration has been implemented for Credit Card, Direct Debit SEPA, Direct Debit SEPA with payment guarantee, Invoice, Invoice with payment guarantee and PayPal</li>\n<li>[Enhanced] Optimized IP condition check for remote address</li>\n</ul>\n<h4>11.2.5</h4>\n<ul>\n<li>[Enhanced] Optimized vendor script validation for handling communication failure transaction</li>\n</ul>\n<h4>11.2.4</h4>\n<ul>\n<li>[Fixed] Fetching the order amount from the cart instead of session, to make it compatible for the WooCommerce version (above 3.2.0)</li>\n<li>[Enhanced] Dynamic IP control applied through domain instead of static IP in vendor script. Actual IP of Novalnet will be extracted in real time from the domain</li>\n</ul>\n<h4>11.2.3</h4>\n<ul>\n<li>[New] Implemented Barzahlen payment method </li>\n<li>[Enhanced] Optimized vendor script validation </li>\n<li>[Removed] Enable debug mode configuration in Merchant script management</li>\n</ul>\n<h4>11.2.2</h4>\n<ul>\n<li>[Fixed] Optimized Credit Card and Direct Debit SEPA script</li>\n<li>[Enhanced] Adjusted opacity for form payments</li>\n<li>[Enhanced] Merchant Administration Portal link has been updated in shop admin</li>\n<li>[Enhanced] Date of birth field format has been updated </li>\n<li>[Removed] Refund with account details from shop admin</li>\n</ul>\n<h4>11.2.1</h4>\n<ul>\n<li>[Fix] Custom order note not displaying</li>\n<li>[Fix] Next charging date shouldn&#8217;t display for last recurring</li>\n<li>[Fix] IP address issue for windows running IIS v6</li>\n<li>[Enhanced] Optimized subscription configuration settings</li>\n<li>[Compatible] Tested with WordPress version upto 4.8.1, WooCommerce version upto 3.1.2 and Subscription version upto 2.2.11</li>\n</ul>\n<h4>11.2.0</h4>\n<ul>\n<li>[Compatible] Tested with WooCommerce version upto 3.0.7 and Subscription version upto 2.2.6.</li>\n</ul>\n<h4>11.1.1</h4>\n<ul>\n<li>[New] Implemented Novalnet updates page.</li>\n<li>[Enhanced] Updated payment logo for Credit Card and Invoice payment.</li>\n<li>[Enhanced] Added new parameter in all API calls.</li>\n<li>[Fix] Restriction of email notification to the end customer on callback execution.</li>\n<li>[Fix] Issue with single iteration Subscription product (Eg: price per month for 1 month).</li>\n<li>[Compatible] Tested with WordPress version 4.7.3 and Subscription version 2.1.4.</li>\n</ul>\n<h4>11.1.0</h4>\n<ul>\n<li>Novalnet Merchant API configuration has been globally implemented.</li>\n<li>On-hold transaction configuration (For Credit Card, Direct Debit SEPA, Invoice and PayPal).</li>\n<li>Merchant script notification mail configuration.</li>\n<li>Merchant can set up their Referrer ID.</li>\n<li>Auto-fill for payment data (Direct Debit SEPA).</li>\n<li>Fraud prevention through PIN by Callback/SMS. (For Direct Debit SEPA and Invoice).</li>\n<li>Subscription management.</li>\n<li>Order and transaction management.</li>\n<li>VOID &amp; CAPTURE option for on-hold transaction payments (Direct Debit SEPA, Credit Card, Invoice, Prepayment and PayPal).</li>\n<li>Refund option for Credit Card, Direct Debit SEPA, Invoice, Prepayment, Instant Bank Transfer, iDEAL, PayPal, eps, giropay  and Przelewy24.</li>\n<li>Transaction amount update option (For Direct Debit SEPA, Invoice and Prepayment).</li>\n<li>Due date change option for Prepayment and Invoice payment.</li>\n<li>Affiliate management system.</li>\n<li>Auto configuration of vendor credentials.</li>\n<li>Zero amount booking for Direct Debit SEPA, Credit Card and PayPal.</li>\n<li>One click shopping for Direct Debit SEPA, Credit Card and PayPal.</li>\n<li>Credit Card iframe updated.</li>\n<li>Customized CSS settings for Credit Card iframe form.</li>\n<li>Implemented Direct Debit SEPA with payment guarantee, Invoice with payment guarantee, giropay and Przelewy24 payments.</li>\n<li>Edit option in Direct Debit SEPA, Credit Card and PayPal for registered customers.</li>\n<li>Direct Debit SEPA overlay removed.</li>\n<li>Notify URL configuration in shop backend.</li>\n<li>Logo control has been implemented in global configuration.</li>\n<li>Responsive templates has been implemented.</li>\n<li>New booking with payment reference.</li>\n</ul>\n<h4>10.3.1</h4>\n<ul>\n<li>Compatibility has been checked for latest Woocommerce version 2.3.8 &#8211; 2.6.x and subscription version 2.0.x.</li>\n<li>Novalnet payment module has been optimized as per new testcase.</li>\n</ul>\n<h4>10.3.0</h4>\n<ul>\n<li>Credit Card Iframe implemented.</li>\n<li>Implemented giropay payment.</li>\n<li>Compatibility has been checked for latest Woocommerce version 2.3.8 &#8211; 2.5.x and subscription version 2.0.x.</li>\n<li>Novalnet payment modules has been optimized as per new testcase</li>\n<li>Direct Debit SEPA overlay and Credit Card Type removed.</li>\n<li>External plugin compatibility has been checked.</li>\n<li>Compatibility has been checked for latest Woocommerce version 2.3.8 &#8211; 2.4.x and subscription version 2.0.x.</li>\n</ul>\n<h4>10.1.1</h4>\n<ul>\n<li>Compatibility has been checked for WooCommerce version upto 2.4.6.</li>\n</ul>\n<h4>10.1.0</h4>\n<ul>\n<li>External plugin compatibility has been checked.</li>\n<li>Payment reference has been implemented.</li>\n</ul>\n<h4>10.0.0</h4>\n<ul>\n<li>First Release</li>\n</ul>\n"
    },
    "short_description": "Novalnet payment plugin provides all popular online payment methods for your WooCommerce webshop.",
    "description": "<h4>(German)</h4>\n<p>(English Description down below)</p>\n<p>Das Novalnet Payment-Plugin für Woocommerce bietet Ihnen eine Vielzahl an hilfreichen Features, die das tägliche Arbeiten mit dem Woocommerce-Shopsystem vereinfachen.</p>\n<p>Wählen Sie aus den weltweit beliebtesten über 100 lokalen und internationalen Zahlungsmethoden die für Sie passenden aus, vom Rechnungskauf über SEPA-Lastschrift bis hin zur Kreditkarte.</p>\n<p>Kreditkartenzahlungen sind zusätzlich durch das 3D-Secure-Verfahren abgesichert, um Ihnen als Shop-Betreiber noch mehr Sicherheit zu bieten. Damit gehört das Plugin der Novalnet AG zu einem der populärsten Extensions im Bereich Payment.</p>\n<p>Das Plugin automatisiert den gesamten Transaktionsvorgang vom Checkout bis zum Forderungsmanagement und Inkasso. Darüber hinaus sichert es die Transaktionen ab und hilft Ihnen als Unternehmen dabei, Ihren Umsatz durch die folgenden Vorteile langfristig zu steigern:</p>\n<ul>\n<li><a href=\"https://www.novalnet.de/zahlungsabwicklung/\" title=\"über 100 lokal und international nachgefragte Zahlungsarten\" rel=\"nofollow ugc\">über 100 lokal und international nachgefragte Zahlungsarten</a> bereits integriert</li>\n<li>umfangreiches <a href=\"https://www.novalnet.de/risikomanagement/\" title=\"Risikomanagement\" rel=\"nofollow ugc\">Risikomanagement</a> zur Minimierung von Zahlungsausfällen durch mehr als 60 im Hintergrund arbeitende Betrugspräventionsmodule</li>\n<li>Für Zahlungsausfälle frei einstellbares, optional kostenloses Forderungsmanagement inkl. verschiedener Mahnstufen</li>\n<li>Automatisierte Rechnungsstellung für Ihre Endkunden</li>\n<li>umfangreiches und kostenloses Debitorenmanagement mit diversen Exportmöglichkeiten für Buchhaltungsprogramme </li>\n<li>Realtime-Monitoring, das Ihren Checkoutprozess in Bezug auf Kaufabbrüche überwacht, und Reporting </li>\n<li>Ihre Gelder sind durch Treuhandkonten zu 100 % u.a. vor einer Insolvenz geschützt</li>\n<li>Kostenfreier technischer Support bei Einbindung und Betrieb des Zahlungs-Plugins</li>\n<li>Attraktive und flexible Auszahlungsmodalitäten</li>\n<li>Optionale Mitgliederverwaltung</li>\n<li>Spezielles Endkundenportal für Rückfragen zur Transaktion</li>\n</ul>\n<p>Einfache SEPA-Lastschrift-Lösung. Sie müssen kein separates Bankkonto eröffnen</p>\n<h4>VERMEIDEN SIE MEHRERE VERTRÄGE UND VERSTECKTE KOSTEN</h4>\n<p>Mehrere Verträge für die Zahlungsabwicklung mit verschiedenen Dienstleistern wie Banken, Kreditkarten-Acquirern, Anbietern von Betrugspräventionen, Inkassounternehmen etc. und mit unterschiedlichen Laufzeiten und Gebühren sind mit Nutzung des Plugins Vergangenheit.</p>\n<p>Die Novalnet-Plattform sorgt dafür, dass Ihre Zahlungen in WooCommerce reibungslos abgewickelt werden, erstellt automatisch Ihre Rechnungen, verschickt pünktlich Mahnungen und verarbeitet auch On-hold-Transaktionen und wiederkehrende Zahlungen.</p>\n<p>Ihre über WooCommerce generierten Transaktionen sind durch ein Höchstmaß an Sicherheit geschützt. Dazu wird die Novalnet AG jedes Jahr in einem umfangreichen Sicherheits-Audit nach dem Payment Card Industry Data Security Standard (PCI DSS) auf dem höchsten Level 1 geprüft und zertifiziert.</p>\n<p>Die vielfach automatisierten Abläufe sorgen dafür, dass Sie Kosten sparen und sich auf Ihren Verkaufserfolg konzentrieren können.</p>\n<h4>WICHTIGSTE FUNKTIONEN</h4>\n<ul>\n<li>Einfache Integration in Ihren Bestellprozess – es wird keine externe Seite für die Zahlung aufgerufen</li>\n<li>Responsive Zahlungsseiten</li>\n<li>Sichere SSL-verschlüsselte Gateways</li>\n<li>Klare Echtzeit-Übersicht und Überwachung des Zahlungsstatus sowie automatisierte E-Mail-Benachrichtigungsfunktion für Zahlungsstatusreports</li>\n<li>Automatisierte Berichte und verschiedene Exportfunktionen für Ihre Buchhaltung in XML, SOAP, CSV, MT940 u.v.m. </li>\n<li>Kreditkartenzahlungen <a href=\"https://www.novalnet.de/service/3d-secure-infos/\" title=\"mit 3D-Secure\" rel=\"nofollow ugc\">mit 3D-Secure</a></li>\n<li><a href=\"https://www.novalnet.de/pci-dss-zertifizierung/\" title=\"PCI-DSS-konform\" rel=\"nofollow ugc\">PCI-DSS-konform</a>, keine aufwändige und teure Zertifizierung notwendig</li>\n</ul>\n<h4>MIT DEM PLUGIN KÖNNEN SIE VIELES DIREKT ÜBER DIE WOOCOMMERCE-EINSTELLUNGEN VERWALTEN</h4>\n<ul>\n<li>Einfache Konfigurationsmöglichkeit für alle Zahlungsarten</li>\n<li>Einfache Möglichkeit zum Bestätigen und Stornieren von On-Hold-Transaktionen</li>\n<li>Einfaches Durchführen von Rückerstattungen aus der Shop-Administration heraus</li>\n<li>Flexible <a href=\"https://www.novalnet.de/abonnementverwaltung/\" title=\"Abonnementverwaltung\" rel=\"nofollow ugc\">Abonnementverwaltung</a> für wiederkehrende Zahlungen</li>\n<li>Flexibles Affiliate-Management für Partnerprogramm-Betreiber</li>\n<li>Sehr einfaches Konfigurieren des Risikomanagements</li>\n<li>Einstellen komfortabler Statusmeldungen, z.B. für Zahlungseingänge bei Kauf auf Rechnung und Vorkasse</li>\n<li>Bequeme E-Mail-Benachrichtigungsfunktion über Statusmeldungen der Zahlungen</li>\n<li>Übersichtliches Status-Management für Chargebacks sowie SEPA-Rücklastschriften</li>\n<li>Vorhalten von Bestelldaten bei Kaufabbrüchen</li>\n</ul>\n<h4>LASSEN SIE IHRE KUNDEN ZAHLEN, WIE SIE MÖCHTEN</h4>\n<ul>\n<li><a href=\"https://www.novalnet.de/zahlungsart-kreditkarte/\" title=\"Kreditkarte\" rel=\"nofollow ugc\">Kreditkarte</a>: Visa, Mastercard, American Express, JCB, UnionPay, Diners Club, Discover</li>\n<li>Debitkarte: Maestro, Carte Bleue, CartaSi, Postepay, PostFinance, dankort</li>\n<li>Online-Überweisung: Sofortüberweisung, Onlineüberweisung eps, iDEAL, giropay, Przelewy24, Alipay, WeChat Pay, Trustly &amp; Blik etc.</li>\n<li>Wallet: Apple Pay, Google Pay, Payconiq, MB Way, PayPal &amp; TWINT.</li>\n<li>Vorkasse, Kauf auf Rechnung, Kauf auf Rechnung mit Zahlungsgarantie</li>\n<li><a href=\"https://www.novalnet.de/sepa-lastschrift/\" title=\"SEPA-Lastschrift\" rel=\"nofollow ugc\">SEPA-Lastschrift</a>, Lastschrift ACH</li>\n<li>Barzahlen/viacash</li>\n<li>Ratenzahlung</li>\n<li>Direct Carrier Billing (Zahlen per Handyrechnung)</li>\n<li>Kauf auf  Rechnung und <a href=\"https://www.novalnet.de/lastschrift-mit-zahlungsgarantie/\" title=\"SEPA-Lastschrift sind auch mit Zahlungsgarantie\" rel=\"nofollow ugc\">SEPA-Lastschrift sind auch mit Zahlungsgarantie</a> möglich.</li>\n</ul>\n<h4>GEHEN SIE AUF NUMMER SICHER</h4>\n<p>Die intelligente Novalnet-Betrugsprävention ist abhängig von Zahlungsart, Produktpalette und Warenkorbgröße. Durch zahlreiche, unabhängig zuschaltbare Fraudmodule verringert sich Ihre Zahlungsausfallquote spürbar.</p>\n<h4>SIE HABEN FRAGEN?</h4>\n<p>Kontaktieren Sie uns per E-Mail an <a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> oder telefonisch unter +49 89 9230683-20.</p>\n<p>Weitere Informationen über Novalnet und zur Kompatibilität des Novalnet-Payment-Plugins finden Sie weiter unten.</p>\n<h4>(English)</h4>\n<h4>ACCEPT, MANAGE &amp; COLLECT PAYMENTS &#8211; WOOCOMMERCE</h4>\n<p>The WooCommerce Payment Plugin from Novalnet allows you to accept, manage and collect payments. It is designed to optimize your payment processing, enrich customer experiences and improve conversion rates.<br />\nHundreds of e-commerce businesses across the world use this plugin to:</p>\n<ul>\n<li>Accept 100+ international &amp; local payment methods</li>\n<li>Add new payment methods any time</li>\n<li>Manage payments, subscriptions &amp; members </li>\n<li>Secure transactions with proven risk management</li>\n<li>Avoid own <a href=\"https://www.novalnet.com/pci-dss-certification/\" title=\"PCI DSS certification\" rel=\"nofollow ugc\">PCI DSS certification</a> </li>\n<li>Automate customer communication related to payments</li>\n<li>Provide payment support for end customers</li>\n<li>Follow transactions in real time</li>\n<li>Automate reporting for bookkeeping &amp; other departments etc.</li>\n</ul>\n<h4>WIDE PAYMENT PORTFOLIO FOR YOUR ONLINE SHOP</h4>\n<p>The WooCommerce Novalnet Payment Plugin enables access to <a href=\"https://www.novalnet.com/paymentsolution/payment-processing/\" title=\"international and local payment methods\" rel=\"nofollow ugc\">international and local payment methods</a> that can be easily integrated to your checkout process already today. Your payment portfolio remains up to date and follows both global and local payment trends across the world.</p>\n<p>Novalnet’s WooCommerce Payment Plugin supports:</p>\n<ul>\n<li>\n<p><a href=\"https://www.novalnet.com/payment-processing/credit-card/\" title=\"Credit cards\" rel=\"nofollow ugc\">Credit cards</a> (3DSecure also available): Visa, Mastercard, American Express, JCB, UnionPay, Diners Club,  Discover etc.</p>\n</li>\n<li>\n<p>Debit cards: Maestro, Visa, Carte Bleue, CartaSi, Postepay, PostFinance, dankort etc.</p>\n</li>\n<li>\n<p>Online bank transfers: Sofort, Online bank transfer, eps, iDEAL, giropay, Przelewy24, PostFinance Card, PostFinance E-Finance, Bancontact, Alipay, WeChat Pay, Trustly &amp; Blik etc.</p>\n</li>\n<li>\n<p>E-wallets:  <a href=\"https://www.novalnet.com/payment-processing/paypal/\" title=\"PayPal\" rel=\"nofollow ugc\">PayPal</a>, Apple Pay, Google Pay, Payconiq, MB Way &amp; TWINT.</p>\n</li>\n<li>\n<p>Prepayment, Invoice, <a href=\"https://www.novalnet.com/solutions/payment-processing/sepa-direct-debit/\" title=\"Direct Debit SEPA\" rel=\"nofollow ugc\">Direct Debit SEPA</a>, Direct Debit ACH, <a href=\"https://www.novalnet.com/solutions/payment-processing/barzahlen/\" title=\"Barzahlen\" rel=\"nofollow ugc\">Barzahlen/viacash</a> &amp; Multibanco.</p>\n</li>\n<li>\n<p>Direct Debit SEPA with payment guarantee, Invoice with payment guarantee, Instalment by Invoice &amp; Instalment by Direct Debit SEPA</p>\n</li>\n</ul>\n<p>More information about each payment method can be found on our <a href=\"https://www.novalnet.com/payment/\" title=\"website\" rel=\"nofollow ugc\">website</a>. If you have any additional inquiries, please do not hesitate to contact us at <a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> or +49 89 9230683-20.</p>\n<h4>ADVANCED PAYMENT EXPERIENCES FOR YOUR CUSTOMERS</h4>\n<p>Novalnet Payment Gateway for WooCommerce ensures that your WooCommerce offers seamless payment experiences. It provides optimized customer communications and auto-fill of payment details for future purchases. Set up email notifications and reminders for payment status updates and offer valuable customer support through Novalnet platform.</p>\n<h4>DIGITALIZATION &amp; REAL-TIME MONITORING</h4>\n<p>Novalnet’s WooCommerce Payment Plugin integrates your shop with one payment platform that covers all payment methods and services at once. Save costs, manual effort and time with the following WooCommerce Payment Plugin features.</p>\n<h4>KEY FEATURES</h4>\n<ul>\n<li>Easy configuration of all international &amp; local payment methods</li>\n<li>Unified monitoring, reporting, and payouts for all payment methods</li>\n<li>Easy to install &amp; configure without technical understanding</li>\n<li>Plug &amp; Play &#8211; no extra plugins/scripts needed to process transactions </li>\n<li>No PCI DSS certification required when using our payment module</li>\n<li>60+ risk &amp; payment fraud detection modules to prevent defaults in real time</li>\n<li>Secure SSL- encoded gateways</li>\n<li>One-click shopping supported for Credit/Debit Cards, Direct Debit SEPA, Direct Debit SEPA with payment guarantee &amp; Instalment by Direct Debit SEPA</li>\n<li>Zero amount authorization supported for Credit/Debit Cards, Direct Debit SEPA, Apple Pay &amp; Google Pay</li>\n<li>Custom CSS configuration for Credit/Debit Card iframe</li>\n<li>Automated invoice generation</li>\n<li>Easy confirmation/cancellation of on-hold transactions for Direct Debit SEPA, Direct Debit SEPA with payment guarantee, Instalment payment for Direct Debit SEPA, Credit/Debit Card, Invoice, Invoice with payment guarantee, Instalment payment for Invoice, Prepayment, PayPal, Apple Pay &amp; Google Pay</li>\n<li>Refund option for Credit/Debit Cards, Direct Debit SEPA, Direct Debit ACH, Direct Debit SEPA with payment guarantee, Instalment by Direct Debit SEPA, Invoice, Invoice with payment guarantee, Instalment by Invoice, Prepayment, Barzahlen/viacash, Sofort, iDEAL, eps, giropay, PayPal, MB Way, Przelewy24, PostFinance Card, PostFinance E-Finance, Bancontact, Apple Pay, Google Pay, Online bank transfer, Alipay, WeChat pay, Trustly, Blik, Payconiq &amp; TWINT.</li>\n<li>Automated e-mail notifications for staying up to date on the payment status</li>\n<li>Clear overview of payment status from checkout to receivables</li>\n<li>Secure end customer portal for payment inquiries </li>\n<li>Fully-automated debt collection</li>\n<li>Multilevel claims management with integrated handover to collection and various export functions for the accounting</li>\n<li>Affiliate solution supporting frictionless onboarding, split payments &amp; currency conversion </li>\n<li>Automated bookkeeping report in XML, SOAP, CSV, MT940</li>\n<li>Free technical support upon integration</li>\n<li>Dynamic subscription management for recurring payments</li>\n<li>Subscription management (suspend, reactivate, cancel, change payment method, change next cycle date, change subscription amount)</li>\n<li>Automatic order creation when subscriptions are renewed</li>\n<li>Transaction amount update option for Direct Debit SEPA, Direct Debit ACH Invoice, Prepayment &amp; Barzahlen/viacash</li>\n<li>Order creation process handled for shop admin</li>\n<li>Responsive templates</li>\n</ul>\n<h4>PCI COMPLIANT RISK MANAGEMENT &amp; FRAUD PREVENTION</h4>\n<p>Novalnet provides all its merchants secure payment processing in a PCI DSS Level 1 compliant manner. More than <a href=\"https://www.novalnet.com/fraud-prevention/\" title=\"60 fraud prevention modules\" rel=\"nofollow ugc\">60 fraud prevention modules</a> are integrated to ensure machine learning fraud prevention and optimal risk minimization in real-time.</p>\n<h4>AVOID MULTIPLE CONTRACTS &amp; HIDDEN COSTS</h4>\n<p>This free WooCommerce Payment Plugin integrates your e-commerce business with Novalnet’s all-in-one payment platform to grow revenue. The integration and services are customizable based on individual customer needs. Novalnet’s prizing depends on your business model and chosen payment methods.</p>\n<p>Please contact us for more information:<a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> or +49 89 9230683-20.</p>\n<h4>ABOUT NOVALNET AG</h4>\n<p><a href=\"https://www.novalnet.de/\" title=\"Novalnet\" rel=\"nofollow ugc\">Novalnet</a> is a financial service institution offering payment solutions world-wide. We support customers all the way from setting up payment types and intelligent fraud prevention modules, to legitimate and reliable receivables and claims management. Operating in the market as a full payment service provider since 2007, we enable maximal reliability and client focus to all customers in every area of payment processing. Novalnet AG is a licensed payment institute which is regulated by the Federal Financial Supervisory Authority (BaFin).</p>\n<h4>PLUGIN COMPATIBILITY</h4>\n<p>To process Novalnet payments through this WooCommerce Payment Plugin, a <a href=\"https://www.novalnet.de/kontakt\" title=\"Novalnet account\" rel=\"nofollow ugc\">Novalnet account</a> is needed.</p>\n<ul>\n<li>Compatible with WordPress/WooCommerce plugins</li>\n<li>Works with WooCommerce Subscription plugin</li>\n<li>Works with WordPress Multi-Site</li>\n<li>Supports Sequential Order Numbers Pro Plugin (Custom Order Numbers for WooCommerce)</li>\n<li>Supports Debug Log feature  </li>\n</ul>\n<h4>REFERENCE</h4>\n<p>Please check out our ssl certified <a href=\"https://woocommerce.novalnet.de/\" title=\"Demo Store\" rel=\"nofollow ugc\">Demo Store</a></p>\n<h3>Arbitrary section</h3>\n<h4>Connect to WooCommerce:</h4>\n<ol>\n<li>\n<p>Switch back to the WordPress admin area.</p>\n</li>\n<li>\n<p>Click on &#8220;WooCommerce&#8221; in the menu on the left and click directly on the sublevel tab &#8220;Settings&#8221; tab there.</p>\n</li>\n<li>\n<p>Inside the &#8220;Novalnet Global Configuration&#8221; tab you will have the Novalnet merchant global configuration. It will follow the below mentioned structure</p>\n<ul>\n<li>\n<p><strong>Product activation key</strong> Kindly enter the exact key from Novalnet admin area</p>\n</li>\n<li>\n<p><strong>Payment access key</strong> Kindly enter the exact key from Novalnet admin area</p>\n</li>\n<li>\n<p><strong>Select Tariff ID</strong> Kindly select the tariff from the list</p>\n</li>\n<li>\n<p><strong>Subscription Tariff ID</strong> Kindly select the subscription tariff from the list</p>\n</li>\n<li>\n<p><strong>Display payment method logo</strong> Option to display the payment logo for all payments. Logo will be displayed at the checkout</p>\n</li>\n<li>\n<p><strong>Subscription Management</strong> Subscription settings</p>\n</li>\n<li>\n<p><strong>Notification / Webhook URL</strong> Notification / Webhook URL settings</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Please click on the “Checkout” tab in order to configure your Novalnet payment interface properly. Inside the “Checkout” tab you will have the individual payment (eg. Direct Debit SEPA) configuration. The payment configuration is structured as follows:</p>\n<ul>\n<li>\n<p><strong>Enable payment method</strong> Option to enable respective payment. Payment will be displayed at the checkout</p>\n</li>\n<li>\n<p><strong>Enable test mode</strong> Option for the respective payment mode to be in live or test mode</p>\n</li>\n<li>\n<p><strong>Title</strong> The freely configurable description entered here is displayed when your customers select the respective payment type</p>\n</li>\n<li>\n<p><strong>Description</strong> The freely configurable description entered here is displayed when your customers select the respective payment type</p>\n</li>\n<li>\n<p><strong>One-click shopping</strong> One click shopping for One-click shopping supported for Credit/Debit Cards, Direct Debit SEPA, Direct Debit ACH, Direct Debit SEPA with payment guarantee &amp; Instalment by Direct Debit SEPA.</p>\n</li>\n</ul>\n</li>\n</ol>\n<p>Now, just the following steps have to be executed for going live:</p>\n<h4>TRANSLATIONS</h4>\n<ul>\n<li>English</li>\n<li>German</li>\n</ul>\n<h4>GO-LIVE:</h4>\n<p>Now execute the following steps to go live and start your sales:</p>\n<ul>\n<li>Install the WooCommerce Payment Plugin by Novalnet directly from the WordPress repository </li>\n<li>Find the detailed information in the Installation Guide (incl. in the package) </li>\n<li>Configure Product Activation Key and Payment Access Key in the shop admin panel</li>\n<li>Activate &amp; configure the preferred payment types in your shop admin panel </li>\n<li>You are ready to go!</li>\n</ul>\n<p>Please contact <a href=\"mailto:&#115;&#097;&#x6c;&#x65;&#x73;&#x40;&#x6e;&#111;&#118;&#097;&#108;&#110;&#x65;&#x74;&#x2e;&#x64;&#x65;&#047;\" title=\"sales@novalnet.de\" rel=\"nofollow ugc\">sales@novalnet.de</a> / 0049-89-923 068 320 for any technical issues or questions.</p>\n<h4>DISTRIBUTION</h4>\n<p>This plugin enables the integration between WooCommerce and Novalnet payments. The plugin is free and released under the GNU General Public License. If you have found this script useful, please let also others know about it! Recommendations as well as comments in the merchant forum will be appreciated!</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.zip",
    "upgrade_notice": {
        "12.1.0": "<ul>\n<li>[New] Order creation process handled from the shop admin panel</li>\n</ul>",
        "12.0.11": "<ul>\n<li>[Fix] Adjusted payment plugin, when changing subscription product into normal product</li>\n</ul>",
        "12.0.10": "<ul>\n<li>[Fix] Adjusted the payment plugin for multistep checkout page to support Germanized pro plugin\n\n<ul>\n<li>[Fix] Adjusted the instalment cycle amount in order confirmation e-mail for end-customers</li>\n</ul></li>\n</ul>",
        "12.0.9": "<ul>\n<li>[Fix] Default Hold stock duration is extended for pending orders to avoid order cancellation\n\n<ul>\n<li>[Fix] Order amount rounded to 2 decimal factors while sending to the Novalnet server</li>\n</ul></li>\n</ul>",
        "12.0.8": "<ul>\n<li>[Fix] Payment redirection is optimized for successful transactions when previous transactions failed for the same order</li>\n</ul>",
        "12.0.7": "<ul>\n<li>[Fix] Optimized payment enabling in the payment method page\n\n<ul>\n<li>[Enhanced] Credit/Debit Cards payment method description</li>\n<li>[Enhanced] Optimized the payment plugin for Virtual and Downloadable products</li>\n<li>[Enhanced] For every recurring subscription orders the parent order number is used as reference transactions</li>\n</ul></li>\n</ul>",
        "12.0.6": "<ul>\n<li>[New] Subscription reactivation handled, when Subscription order is &#039;Cancelled&#039;\n\n<ul>\n<li>[Fix] Error logs from Przelewy24 payment</li>\n<li>[Fix] Adjusted the payment plugin for Cron execution error</li>\n<li>[Fix] Refund process for PayPal payment</li>\n<li>[Fix] Exact order numbers are fetched and updated for the subscription renewal orders</li>\n<li>[Enhanced] Instalment summary template for Instalment by Direct Debit SEPA and Instalment by Invoice</li>\n</ul></li>\n</ul>",
        "12.0.5": "<ul>\n<li>[Fix] HTML Tag in &quot;Customer provided note&quot; for WooCommerce 5.0.0 compatibility</li>\n</ul>",
        "12.0.4": "<ul>\n<li>[Fix] Notice error during wp-cron execution \n\n<ul>\n<li>[Fix] Webhook: Transaction update status reflected as a transaction refund for instalment payments</li>\n<li>[Fix] Invoice &amp; Direct Debit SEPA payment methods are disabled during the subscription change payment method when payment guaranteed conditions are met </li>\n<li>[Fix] Change payment option hidden in shop front-end when the minimum order amount is configured for subscription payments</li>\n<li>[Enhanced] Added NovalnetUtility.js in the checkout page</li>\n<li>[Enhanced] Webhook: Transaction refund updated for the corresponding instalment cycles</li>\n<li>[Enhanced] Subscription change payment method in back-end has been optimized for the Credit/Debit payment</li>\n<li>[Enhanced] Updated new transaction details in the subscription notes section for subscription change payment method</li>\n</ul></li>\n</ul>",
        "12.0.3": "<ul>\n<li>[Fix] Amount mismatched during Credit Card authentication process</li>\n</ul>",
        "12.0.2": "<ul>\n<li>[Fix] Optimized IP condition check for the parameter transaction.system_ip<br />\n\n<ul>\n<li>[Fix] Payment plugin has been adjusted for the guest users during signup process in the checkout page</li>\n<li>[Fix] Payment plugin has been adjusted for 32 bit operating system  </li>\n<li>[Fix] Subscription reactive and cancelled handled for the expired subscriptions</li>\n<li>[Fix] Callback execution has been optimized to execute without the order number</li>\n<li>[Enhanced] Adjusted validation in the checkout page for date of birth field</li>\n<li>[Enhanced] Payment confirmation mail for end-customer designed with a new email template</li>\n</ul></li>\n</ul>",
        "12.0.1": "<ul>\n<li>[Fix] Installment renewal summary update<br />\n\n<ul>\n<li>[Fix] Extended the support for the customized order number</li>\n<li>[Enhanced] Added new parameter: customer.tel</li>\n</ul></li>\n</ul>",
        "12.0.0": "<ul>\n<li>Major version release: Entire restructure &amp; optimization of the older version with usability, additional features, and customizations.</li>\n</ul>",
        "11.3.5": "<ul>\n<li>[Fix] Chrome Samesite Cookies</li>\n</ul>",
        "11.3.4": "<ul>\n<li>[New] Customized date of birth field in checkout page\n\n<ul>\n<li>[Fix] Compatibility for WooCommerce 3.9.1</li>\n</ul></li>\n</ul>",
        "11.3.3": "<ul>\n<li>[New] German text has been added for date of birth text field\n\n<ul>\n<li>[New] In the checkout page, instalments cycle information has been displayed for the end customer</li>\n<li>[Enhanced] Credit Card iframe has been optimized</li>\n<li>[Enhanced] Vendor script has been optimized</li>\n</ul></li>\n</ul>",
        "11.3.2": "<ul>\n<li>[New] Update shipping address to PayPal\n\n<ul>\n<li>[Removed] Instalments cycle information removed for the end customer</li>\n</ul></li>\n</ul>",
        "11.3.1": "<ul>\n<li>[Fix] Subscription woocommerce_scheduled_subscription_end_of_prepaid_term type action has been unscheduled for the reactivated subscription\n\n<ul>\n<li>[Fix] Novalnet Merchant Administration Portal link has been updated in the backend order notes</li>\n<li>[Fix] Order status issue for Przelewy24 payment based on the external plugin for customizing the order number</li>\n<li>[Enhanced] Adjusted the Novalnet payment plugin based on the woocommerce subscription plugin</li>\n</ul></li>\n</ul>",
        "11.3.0": "<ul>\n<li>[New] Implemented instalment payment for Direct Debit SEPA and Invoice\n\n<ul>\n<li>[Enhanced] Adjusted the payment module for IPV6 condition </li>\n<li>[Enhanced] Implemented new encryption method for redirect payments </li>\n<li>[Enhanced] Auto configuration call perform via cURL method </li>\n<li>[Enhanced] Callback has been optimized as per the new testcase </li>\n<li>[Removed] Payment reference configuration for Invoice / prepayment </li>\n<li>[Removed] Transaction reference in payments</li>\n</ul></li>\n</ul>",
        "11.2.16": "<ul>\n<li>[Fix] Adjusted validation in the checkout page for company field\n\n<ul>\n<li>[Fix] Issue in displaying the Guaranteed Direct Debit SEPA payment in checkout page</li>\n<li>[Fix] Issue in subscription change payment method for Direct Debit SEPA</li>\n</ul></li>\n</ul>",
        "11.2.15": "<ul>\n<li>[Fix] Issue with checkout process on account creation\n\n<ul>\n<li>[Fix] Adjusted Java script for loading Credit Card form</li>\n<li>[Enhanced] New language adopted for Deutsch(sie)</li>\n<li>[Enhanced] Novalnet bank details will be displayed in invoice for on-hold transactions in Invoice, Invoice with payment guarantee and Prepayment</li>\n</ul></li>\n</ul>",
        "11.2.14": "<ul>\n<li>[Enhanced] Novalnet payment plugin has been optimized for checkout template</li>\n</ul>",
        "11.2.13": "<ul>\n<li>[Fix] Compatible issue for WooCommerce 3.6.1</li>\n</ul>",
        "11.2.12": "<ul>\n<li>[Fix] Updated the multistep checkout page working for the Germanized pro plugin\n\n<ul>\n<li>[Enhanced] Subscription cancellation option for end user with merchant control</li>\n<li>[Enhanced] Novalnet payment plugin has been optimized as per new test case</li>\n</ul></li>\n</ul>",
        "11.2.11": "<ul>\n<li>[Fix] Updated the subscription change payment method working in the vendor script\n\n<ul>\n<li>[Fix] Updated the multistep checkout page working for the Germanized pro plugin</li>\n</ul></li>\n</ul>",
        "11.2.10": "<ul>\n<li>[Fix] Unified processing and checking of session\n\n<ul>\n<li>[Fix] Handling of communication failure for payments with payment guarantee</li>\n<li>[Enhanced] Enhanced synchronization between shop and Novalnet system</li>\n</ul></li>\n</ul>",
        "11.2.9": "<ul>\n<li>[Fix] Compatible issue for WordPress 5\n\n<ul>\n<li>[Enhanced] Guaranteed payment minimum amount reduced to 9.99 EUR</li>\n<li>[Removed] Autofill for payment data</li>\n<li>[Removed] BIC field for Direct Debit SEPA</li>\n</ul></li>\n</ul>",
        "11.2.8": "<ul>\n<li>[Enhanced] Guaranteed payment pending status has been implemented\n\n<ul>\n<li>[Enhanced] Callback has been optimized as per the new testcase</li>\n</ul></li>\n</ul>",
        "11.2.7": "<ul>\n<li>[Fix] Adjusted payment module to restrict the double transaction in custom theme</li>\n</ul>",
        "11.2.6": "<ul>\n<li>[New] Custom checkout overlay for Barzahlen\n\n<ul>\n<li>[New] Force 3D secure process has been implemented as per predefined filters and settings in the Novalnet admin portal</li>\n<li>[Enhanced] Due date update notification in the shop, on activation of transaction for Invoice, Invoice with payment guarantee and Prepayment</li>\n<li>[Enhanced] On-hold transaction configuration has been implemented for Credit Card, Direct Debit SEPA, Direct Debit SEPA with payment guarantee, Invoice, Invoice with payment guarantee and PayPal</li>\n<li>[Enhanced] Optimized IP condition check for remote address</li>\n</ul></li>\n</ul>",
        "11.2.5": "<ul>\n<li>[Enhanced] Optimized vendor script validation for handling communication failure transaction</li>\n</ul>",
        "11.2.4": "<ul>\n<li>[Fixed] Fetching the order amount from the cart instead of session, to make it compatible for the WooCommerce version (above 3.2.0)\n\n<ul>\n<li>[Enhanced] Dynamic IP control applied through domain instead of static IP in vendor script. Actual IP of Novalnet will be extracted in real time from the domain</li>\n</ul></li>\n</ul>",
        "11.2.3": "<ul>\n<li>[New] Implemented Barzahlen payment method \n\n<ul>\n<li>[Enhanced] Optimized vendor script validation </li>\n<li>[Removed] Enable debug mode configuration in Merchant script management</li>\n</ul></li>\n</ul>",
        "11.2.2": "<ul>\n<li>[Fixed] Optimized Credit Card and Direct Debit SEPA script\n\n<ul>\n<li>[Enhanced] Adjusted opacity for form payments</li>\n<li>[Enhanced] Merchant Administration Portal link has been updated in shop admin</li>\n<li>[Enhanced] Date of birth field format has been updated </li>\n<li>[Removed] Refund with account details from shop admin</li>\n</ul></li>\n</ul>",
        "11.2.1": "<ul>\n<li>[Fix] Custom order note not displaying\n\n<ul>\n<li>[Fix] Next charging date shouldn&#039;t display for last recurring</li>\n<li>[Fix] IP address issue for windows running IIS v6</li>\n<li>[Enhanced] Optimized subscription configuration settings</li>\n<li>[Compatible] Tested with WordPress version upto 4.8.1, WooCommerce version upto 3.1.2 and Subscription version upto 2.2.11</li>\n</ul></li>\n</ul>",
        "11.2.0": "<ul>\n<li>[Compatible] Tested with WooCommerce version upto 3.0.7 and Subscription version upto 2.2.6.</li>\n</ul>",
        "11.1.1": "<ul>\n<li>[New] Implemented Novalnet updates page.\n\n<ul>\n<li>[Enhanced] Updated payment logo for Credit Card and Invoice payment.</li>\n<li>[Enhanced] Added new parameter in all API calls.</li>\n<li>[Fix] Restriction of email notification to the end customer on callback execution.</li>\n<li>[Fix] Issue with single iteration Subscription product (Eg: price per month for 1 month).</li>\n<li>[Compatible] Tested with WordPress version 4.7.3 and Subscription version 2.1.4.</li>\n</ul></li>\n</ul>",
        "11.1.0": "<ul>\n<li>Novalnet Merchant API configuration has been globally implemented.\n\n<ul>\n<li>o On-hold transaction configuration (For Credit Card, Direct Debit SEPA, Invoice and PayPal).</li>\n<li>o Merchant script notification mail configuration.</li>\n<li>o Merchant can set up their Referrer ID.</li>\n<li>Auto-fill for payment data (Direct Debit SEPA).</li>\n<li>Fraud prevention through PIN by Callback/SMS. (For Direct Debit SEPA and Invoice).</li>\n<li>Subscription management.</li>\n<li>Order and transaction management.</li>\n<li>Implemented &quot;Extension&quot; features</li>\n<li>o VOID &amp; CAPTURE option for on-hold transaction payments (Direct Debit SEPA, Credit Card, Invoice, Prepayment and PayPal).</li>\n<li>o Refund option for Credit Card, Direct Debit SEPA, Invoice, Prepayment, Instant Bank Transfer, iDEAL, PayPal, eps, giropay and Przelewy24.</li>\n<li>o Transaction amount update option (For Direct Debit SEPA, Invoice and Prepayment).</li>\n<li>o Due date change option for Prepayment and Invoice payment.</li>\n<li>Affiliate management system.</li>\n<li>Auto configuration of vendor credentials.</li>\n<li>Zero amount booking for Direct Debit SEPA, Credit Card and PayPal.</li>\n<li>One click shopping for Direct Debit SEPA, Credit Card and PayPal.</li>\n<li>Credit Card iframe updated.</li>\n<li>Customized CSS settings for Credit Card iframe form.</li>\n<li>Implemented Direct Debit SEPA with payment guarantee, Invoice with payment guarantee, giropay and Przelewy24 payments.</li>\n<li>Edit option in Direct Debit SEPA, Credit Card and PayPal for registered customers.</li>\n<li>Direct Debit SEPA overlay removed.</li>\n<li>Notify URL configuration in shop backend.</li>\n<li>Logo control has been implemented in global configuration.</li>\n<li>Responsive templates has been implemented.</li>\n<li>New booking with payment reference.</li>\n</ul></li>\n</ul>",
        "10.3.1": "<ul>\n<li>Compatibility has been checked for latest Woocommerce version 2.3.8 - 2.6.x and subscription version 2.0.x.\n\n<ul>\n<li>Novalnet payment module has been optimized as per new testcase.</li>\n</ul></li>\n</ul>",
        "10.3.0": "<ul>\n<li>Implemented giropay and Credit Card Iframe payment.\n\n<ul>\n<li>Compatibility has been checked for latest Woocommerce version 2.3.8 - 2.5.x and subscription version 2.0.x.</li>\n<li>Novalnet payment modules has been optimized as per new testcase</li>\n<li>Direct Debit SEPA overlay and Credit Card Type removed.</li>\n</ul></li>\n</ul>",
        "10.1.1": "<ul>\n<li>Compatibility has been checked for WooCommerce version upto 2.4.6.</li>\n</ul>",
        "10.1.0": "<ul>\n<li>External plugin compatibility has been checked.\n\n<ul>\n<li>Payment reference has been implemented.</li>\n</ul></li>\n</ul>",
        "10.0.0": "<ul>\n<li>First Release</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/woocommerce-novalnet-gateway/assets/screenshot-1.png?rev=2428610",
            "caption": "Novalnet logo"
        },
        {
            "src": "https://ps.w.org/woocommerce-novalnet-gateway/assets/screenshot-2.png?rev=2428610",
            "caption": "Novalnet merchant global configuration"
        },
        {
            "src": "https://ps.w.org/woocommerce-novalnet-gateway/assets/screenshot-3.png?rev=2736980",
            "caption": "Novalnet payment methods list"
        },
        {
            "src": "https://ps.w.org/woocommerce-novalnet-gateway/assets/screenshot-4.png?rev=2428610",
            "caption": "Novalnet individual payment (Direct Debit SEPA) configuration"
        },
        {
            "src": "https://ps.w.org/woocommerce-novalnet-gateway/assets/screenshot-5.png?rev=2428610",
            "caption": "Novalnet payments are displayed in the checkout"
        }
    ],
    "tags": {
        "credit-cards": "Credit Cards",
        "novalnet-payment": "Novalnet payment",
        "payment-gateway": "payment gateway",
        "payments": "payments"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.4": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.1.0.5.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.1.1.1.zip",
        "1.1.7": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.1.1.7.zip",
        "10.0.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.10.0.0.zip",
        "10.1.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.10.1.0.zip",
        "10.1.1": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.10.1.1.zip",
        "10.3.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.10.3.0.zip",
        "10.3.1": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.10.3.1.zip",
        "11.1.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.1.0.zip",
        "11.1.1": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.1.1.zip",
        "11.2.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.0.zip",
        "11.2.1": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.1.zip",
        "11.2.10": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.10.zip",
        "11.2.11": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.11.zip",
        "11.2.12": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.12.zip",
        "11.2.13": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.13.zip",
        "11.2.14": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.14.zip",
        "11.2.15": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.15.zip",
        "11.2.16": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.16.zip",
        "11.2.2": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.2.zip",
        "11.2.3": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.3.zip",
        "11.2.4": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.4.zip",
        "11.2.5": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.5.zip",
        "11.2.6": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.6.zip",
        "11.2.7": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.7.zip",
        "11.2.8": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.8.zip",
        "11.2.9": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.2.9.zip",
        "11.3.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.3.0.zip",
        "11.3.1": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.3.1.zip",
        "11.3.2": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.3.2.zip",
        "11.3.3": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.3.3.zip",
        "11.3.4": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.3.4.zip",
        "11.3.5": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.11.3.5.zip",
        "12.0.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.0.0.zip",
        "12.0.1": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.0.1.zip",
        "12.0.10": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.0.10.zip",
        "12.0.11": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.0.11.zip",
        "12.0.2": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.0.2.zip",
        "12.0.3": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.0.3.zip",
        "12.0.4": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.0.4.zip",
        "12.0.5": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.0.5.zip",
        "12.0.6": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.0.6.zip",
        "12.0.7": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.0.7.zip",
        "12.0.8": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.0.8.zip",
        "12.0.9": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.0.9.zip",
        "12.1.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.1.0.zip",
        "12.2.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.2.0.zip",
        "12.3.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.3.0.zip",
        "12.3.1": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.3.1.zip",
        "12.4.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.4.0.zip",
        "12.5.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.5.0.zip",
        "12.5.1": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.5.1.zip",
        "12.5.3": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.5.3.zip",
        "12.5.4": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.5.4.zip",
        "12.5.5": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.5.5.zip",
        "12.5.6": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.5.6.zip",
        "12.5.7": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.5.7.zip",
        "12.6.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.6.0.zip",
        "12.6.1": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.6.1.zip",
        "12.6.2": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.6.2.zip",
        "12.6.3": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.6.3.zip",
        "12.6.4": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.6.4.zip",
        "12.7.0": "https://downloads.wordpress.org/plugin/woocommerce-novalnet-gateway.12.7.0.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.novalnet.de",
    "banners": {
        "low": "https://ps.w.org/woocommerce-novalnet-gateway/assets/banner-772x250.jpg?rev=2028402",
        "high": "https://ps.w.org/woocommerce-novalnet-gateway/assets/banner-1544x500.jpg?rev=2028402"
    },
    "icons": {
        "1x": "https://ps.w.org/woocommerce-novalnet-gateway/assets/icon-128x128.png?rev=1636784",
        "2x": "https://ps.w.org/woocommerce-novalnet-gateway/assets/icon-256x256.png?rev=1636784"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 86,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "woocommerce-novalnet-gateway",
            "language": "de_DE",
            "version": "12.8.0",
            "updated": "2024-08-30 07:16:15",
            "package": "https://downloads.wordpress.org/translation/plugin/woocommerce-novalnet-gateway/12.8.0/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "woocommerce-novalnet-gateway",
            "language": "de_DE_formal",
            "version": "12.8.0",
            "updated": "2023-08-18 12:24:36",
            "package": "https://downloads.wordpress.org/translation/plugin/woocommerce-novalnet-gateway/12.8.0/de_DE_formal.zip"
        }
    ]
}