{
    "name": "ShopLentor – WooCommerce Builder for Elementor &amp; Gutenberg +12 Modules – All in One Solution (formerly WooLentor)",
    "slug": "woolentor-addons",
    "version": "2.9.6",
    "author": "<a href=\"https://hasthemes.com/plugins/woolentor-pro/\">HasThemes</a>",
    "author_profile": "https://profiles.wordpress.org/devitemsllc/",
    "contributors": {
        "hasthemes": {
            "profile": "https://profiles.wordpress.org/hasthemes/",
            "avatar": "https://secure.gravatar.com/avatar/22ee3e159ea3ed29d8be77abc7b039a0?s=96&d=monsterid&r=g",
            "display_name": "HasThemes"
        },
        "htplugins": {
            "profile": "https://profiles.wordpress.org/htplugins/",
            "avatar": "https://secure.gravatar.com/avatar/c7c8a9cf1910e24386e077013ccbd260?s=96&d=monsterid&r=g",
            "display_name": "HT Plugins"
        },
        "devitemsllc": {
            "profile": "https://profiles.wordpress.org/devitemsllc/",
            "avatar": "https://secure.gravatar.com/avatar/fecac6a0b50c5cd5bb319d4d8de9b1ac?s=96&d=monsterid&r=g",
            "display_name": "HasTech"
        },
        "zenaulislam": {
            "profile": "https://profiles.wordpress.org/zenaulislam/",
            "avatar": "https://secure.gravatar.com/avatar/c69c192ed037f0ecb74348a2bd06bdda?s=96&d=monsterid&r=g",
            "display_name": "Zenaul Islam"
        },
        "tarekht": {
            "profile": "https://profiles.wordpress.org/tarekht/",
            "avatar": "https://secure.gravatar.com/avatar/781d3e5bf0e40ed19369ba7c50b173c0?s=96&d=monsterid&r=g",
            "display_name": "Tarek Aziz"
        },
        "aslamhasib": {
            "profile": "https://profiles.wordpress.org/aslamhasib/",
            "avatar": "https://secure.gravatar.com/avatar/1edee2d43268eb35c68a09a01f77c90f?s=96&d=monsterid&r=g",
            "display_name": "Aslam Hasib"
        }
    },
    "requires": "4.7",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 88,
    "ratings": {
        "5": 182,
        "4": 5,
        "3": 6,
        "2": 3,
        "1": 26
    },
    "num_ratings": 222,
    "support_url": "https://wordpress.org/support/plugin/woolentor-addons/",
    "support_threads": 12,
    "support_threads_resolved": 9,
    "active_installs": 100000,
    "downloaded": 3807845,
    "last_updated": "2024-09-01 09:11:00",
    "added": "2018-08-09",
    "homepage": "https://woolentor.com/",
    "sections": {
        "description": "<p>If you own a WooCommerce website, you&#8217;ll almost certainly want to use these capabilities: Woo Builder (Elementor WooCommerce Builder), WooCommerce Templates, WooCommerce Widgets, Elementor Widgets, product compare or Products Comparison table, WooCommerce order notifications, WooCommerce slider addons (Woo sliders), Woo recently viewed products widget, Sold out count, Elementor Addons, Woocommerce variation swatches module, Elementor Templates, WooCommerce Product Addons, WooCommerce products blocks, WooCommerce Gutenberg Blocks, custom product archive builder, WooCommerce product quick view, out of stock label customization, count sold product, flash sale countdown, Woo wishlist, etc.</p>\n<p>By using ShopLentor &#8211; Elementor WooCommerce Builder, you will get all in one plugin.</p>\n<p>Have you ever searched for a WooCommerce Addons plugin for Elementor Page Builder or WooCommerce template builder for an online store that does not look ordinary like most of the stores out there? ShopLentor is an all-in-one solution that will not only give you complete control over the WooCommerce page designs but also provide you with several features.</p>\n<p>The plugin comes with a powerful WooCommerce page builder for Elementor, allowing you to effortlessly design all WooCommerce pages from scratch using the Elementor page builder. As a result, you no longer have to rely on the default page designs of WooCommerce.</p>\n<p>ShopLentor gives you the flexibility to design a custom Shop and Product details page using the free version of the plugin. The rest of the pages are also customizable with the pro version. Furthermore, ShopLentor &#8211; Elementor WooCommerce builder offers a plethora of Elementor widgets with extensive customization options that you can leverage for creating your store as per your needs.</p>\n<p>Apart from a large number of Elementor WooCommerce widgets, there are plenty of useful functionalities available in the form of modules. For example, product comparison, woo wishlist, quick view, Shopify style checkout, flash sale countdown, and so on. The main purpose of these modules is to offer the users as many options as users would need to enhance their website further. That way, they don&#8217;t have to look for another third-party plugin just for a single feature.</p>\n<p><a href=\"https://woolentor.com/?utm_source=wprepo&amp;utm_medium=freeplugin&amp;utm_campaign=demo\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://woolentor.com/documentation/?utm_source=wprepo&amp;utm_medium=freeplugin&amp;utm_campaign=doc\" rel=\"nofollow ugc\">Documentation</a> | <a href=\"https://woolentor.com/pricing/?utm_source=wprepo&amp;utm_medium=freeplugin&amp;utm_campaign=purchasepro\" rel=\"nofollow ugc\">Purchase Pro</a></p>\n<h3>Elementor WooCommerce Woo Builder Includes</h3>\n<p>🛍️ WooCommerce Elementor Widgets / Elementor WooCommerce Widgets<br />\n🛍️ Single Product Page Builder<br />\n🛍️ Custom Product Template Builder for Individual Product (Pro)<br />\n🛍️ Shop / Archive Page Builder<br />\n🛍️ Individual Archive Page Builder (Pro)<br />\n🛍️ Cart / Checkout / My account / WooCommerce custom thank you page Builder (Pro)</p>\n<p>You can see the plugin demo here 👉 <a href=\"https://woolentor.com/?utm_source=wprepo&amp;utm_medium=freeplugin&amp;utm_campaign=demo\" rel=\"nofollow ugc\">Live Demo</a></p>\n<h3>❤️ Free Features:</h3>\n<ul>\n<li>WooCommerce Template Builder</li>\n<li>Elementor WooCommerce Builder</li>\n<li>WooCommerce Widgets</li>\n<li>Woocommerce Product Grid</li>\n<li>Woocommerce Responsive Grid</li>\n<li>WooCommerce Product List</li>\n<li>WooCommerce Product Sort</li>\n<li>WooCommerce Slider Layout</li>\n<li>Shopify Style Checkout Page / Shopify-like Checkout</li>\n<li>Woocommerce Product Slider Addons / Woo Sliders Widget</li>\n<li>WooCommerce Testimonial Widget</li>\n<li>WooCommerce Featured Product Slider</li>\n<li>WooCommerce Featured Slider</li>\n<li>Promotional Product Slider</li>\n<li>WooCommerce Gutenberg Blocks / Gutenberg WooCommerce blocks</li>\n<li>Recently Viewed Products / Woo Recently Viewed Products Widget</li>\n<li>Woocommerce Product Compare / Products Comparison Table</li>\n<li>Quick View WooCommerce / WooCommerce Quickview</li>\n<li>Woocommerce Product Wishlist / Woo Wishlist</li>\n<li>Woocommerce Product Tab</li>\n<li>Grid and List View WooCommerce</li>\n<li>Action Buttons in different Positions</li>\n<li>Customize WooCommerce Buttons Color</li>\n<li>Sales Countdown WooCommerce Addon / Discount Schedule Counter</li>\n<li>WooCommerce Image Gallery</li>\n<li>Enable / Disable WooCommerce Product Gallery</li>\n<li>WooCommerce Product Gallery Carousel</li>\n<li>Unlimited Color and Font Variations</li>\n<li>WooCommerce Slider or Woo Sliders Control Options</li>\n<li>WooCommerce Variation Swatches Module / Variation Switcher</li>\n<li>Woocommerce Live Sales Notifications (Real)</li>\n<li>Woocommerce Sales Notification (Custom)</li>\n<li>Rename labels / WooCommerce Text / WooCommerce add custom text.</li>\n<li>WooCommerce Upsell Widget</li>\n<li>WooCommerce Cross-sell Widget</li>\n<li>WooCommerce Related Products Widget (Custom Related Products Layout, Disable / Remove / Hide Related Products)</li>\n<li>WooCommerce Category Carousel / WooCommerce Category Showcase / WooCommerce Product Category Slider</li>\n<li>WooCommerce Category and Product List</li>\n<li>Call for Price Button for WooCommerce</li>\n<li>Suggest Price / Suggest Product Price</li>\n<li>Special Day Offer Banner / Banner Widget</li>\n<li>Product QR Code / WooCommerce QR Widget</li>\n<li>WooCommerce Marker / WooCommerce Hotspot</li>\n<li>Archive page with Pagination</li>\n<li>Product Share Widget</li>\n<li>Multi-language Support</li>\n<li>Works with Free Elementor and WooCommerce</li>\n<li>Custom WooCommerce Product Template Builder</li>\n<li>Product Grid (Curvy)</li>\n<li>Product Accordion Listing / Responsive Accordion</li>\n<li>Product Image Accordion / WooCommerce Accordion</li>\n<li>WooCommerce Shop Page Builder</li>\n<li>AJAX Search Widget</li>\n<li>WordPress post or WooCommerce Product Duplicator</li>\n<li>Single product AJAX Add to Cart (In Product Detail Page)</li>\n<li>Horizontal WooCommerce Product Filter <a href=\"https://woolentor.com/demo/horizontal-filter/\" rel=\"nofollow ugc\">Demo</a></li>\n<li>Vertical WooCommerce Product Filter <a href=\"https://woolentor.com/demo/filter-vertical/\" rel=\"nofollow ugc\">Demo</a></li>\n<li>WooCommerce Template Library (Basic)</li>\n<li>Product Reviews widget for WooCommerce</li>\n</ul>\n<h3>🔥 Premium Features:</h3>\n<p>✅ 125+ WooCommerce Elementor Widgets / Elementor WooCommerce Widgets<br />\n✅ 26 WooCommerce Modules<br />\n✅ 62 WordPress Gutenberg Blocks / WoCommerce Gutenberg Blocks<br />\n✅ Custom WooCommerce Product Template Builder for Individual Product<br />\n✅ Individual Archive Page Builder / WooCommerce Template Builder<br />\n✅ WooCommerce Checkout Field Editor / Checkout Field Manager<br />\n✅ Custom Cart Page Builder / WooCommerce Template Builder<br />\n✅ Custom Checkout Page Builder / WooCommerce Template Builder<br />\n✅ Custom My Account Page Builder / WooCommerce Template Builder<br />\n✅ Custom Thank you Page for WooCommerce<br />\n✅ WooCommerce Partial Payment<br />\n✅ WooCommerce Multi step checkout<br />\n✅ Order Confirmations Widget<br />\n✅ Product Variation Swatches for WooCommerce<br />\n✅ Product Size Chart / Size Chart WooCommerce Module<br />\n✅ WooCommerce Progress Bar / WooCommerce Stock Progress<br />\n✅ Related Products Slider for WooCommerce<br />\n✅ WooCommerce Upsell Products / Upsells Carousel<br />\n✅ WooCommerce Pre Order Module / Pre-order for WooCommerce<br />\n✅ Side Mini Cart / WooCommerce Minicart / Cart Drawer<br />\n✅ Redirect to Checkout Page (Direct Checkout)<br />\n✅ Social Share Product / Social Share Buttons / Quick Share<br />\n✅ GTM Conversion Tracking (Google Tag Manager) with Data layer<br />\n✅ Sticky Add to Cart<br />\n✅ Template Library<br />\n✅ 15 Product Custom Template Layouts (Deafult + Invidual)<br />\n✅ WooCommerce Template Builder (Advanced)<br />\n✅ Access to our Premium Udemy Course for WooCommerce (On Request)<br />\n✅ Zoom / Skype / TeamViewer Support<br />\n✅ Free Store Setup / (Maximum 2)<br />\n✅ Phone Call Support<br />\n✅ Premium Support</p>\n<p><strong><a href=\"https://woolentor.com/doc/build-a-custom-checkout-page-template/\" rel=\"nofollow ugc\">WooCommerce Checkout Page Customization and Field Editor (Pro)</a></strong><br />\nShopLentor Pro (Elementor WooCommerce Builder) allows you to customize the checkout page to reduce the bounce rate and increase the conversion rate. Sometimes, a custom checkout page is necessary for an eCommerce store or online storefront. ShopLentor Pro (Elementor WooCommerce Builder) makes it easy by providing several WooCommerce custom checkout options.</p>\n<p>Besides creating a custom checkout page, ShopLentor allows removing or editing existing checkout page fields (billing and shopping fields). You can also add custom checkout page field like WooCommerce phone field or WooCommerce checkout phone.</p>\n<p>By creating a custom Elementor WooCommerce Checkout page template according to your needs, you can get rid of the default Checkout page layout of WooCommerce. To help you achieve this, ShopLentor – Elementor WooCommerce Addon offers loads of Elementor WooCommerce builder widgets (Woo builder) specifically designed to create a custom Elementor WooCommerce Checkout page design.</p>\n<p>If you want to improve customer experience through the checkout page of your store, you can utilize these WP WooCommerce checkout widgets or Elementor WooCommerce checkout widgets that enable you to do things like WooCommerce checkout customization, customize WooCommerce checkout page, customize checkout WooCommerce, Elementor WooCommerce checkout customization, etc.</p>\n<p>Furthermore, the plugin comes with several beautifully designed pre-built Elementor WooCommerce checkout templates or WooCommerce templates for checkout that will allow you to create a custom checkout page within a minute.</p>\n<p><strong><a href=\"https://hasthemes.com/how-to-build-a-custom-product-template-using-woolentor-plugin/\" rel=\"nofollow ugc\">Customize WooCommerce Single Product Template</a></strong><br />\nShopLentor (Elementor WooCommerce Builder) allows you to create a custom single product template. With all the powerful WooCommerce product addons or Woo addons available in ShopLentor, creating a unique design for your WooCommerce product page is a breeze.</p>\n<p>The free version has the option to create a common product page template layout throughout the entire store, and the pro version allows you to create different WooCommerce single templates for various WooCommerce single product pages individually.</p>\n<p>With all the WooCommerce extra product addons or Elementor WooCommerce widgets offered by ShopLentor (Elementor WooCommerce Builder), you can easily manage the WooCommerce single product page or WooCommerce single templates. In addition, these WooCommerce extra product addons, or WooCommerce product addons, are compatible with other popular Elementor WooCommerce plugins.</p>\n<p>ShopLentor (Elementor WooCommerce Builder) lets you assign a separate Elementor template for each of your WooCommerce products from the WooCommerce product settings. For example, in the product setting WooCommerce screen, you will find a dropdown option where you can choose a custom template for the details page of that specific WooCommerce product.</p>\n<h3>⭐ Available Widgets:</h3>\n<p><strong>General Widgets</strong></p>\n<p><strong><a href=\"https://woolentor.com/demo/product-tabs\" rel=\"nofollow ugc\">Product Tabs</a></strong> – Display your WooCommerce products in a tabbed format based on different categories. With the help of this Elementor WooCommerce product tabs widget, WooCommerce category tabs widget, or Woo product tabs widget you can dynamically list your WooCommerce products category wise in various WooCommerce category tabs. It even allows you to choose which WooCommerce product categories you want to display as tabs.</p>\n<p>Furthermore, you can filter what type of WooCommerce products to showcase under a single WooCommerce product category or multiple WooCommerce product categories. For example, WooCommerce category recent products.</p>\n<p>Since the Elementor WooCommerce widget for product tabs (woo product tabs) allows you to display recent products while at the same time supporting category based products, you can effortlessly showcase your newest WooCommerce products or WooCommerce recent products in your online storefront. In addition, WooCommerce category recent products can be handy to show products for specific categories or all WooCommerce categories.</p>\n<p>You can even control the number of products that are displayed. So, whether you&#8217;re launching a new product line or simply want to keep your customers informed about your latest WooCommerce products or WooCommerce recent products, WooCommerce category recent products is a great way to do it.</p>\n<p>Other noteworthy features of this Elementor WooCommerce widget include controlling the WooCommerce product layout, the number of WooCommerce products to show, the WooCommerce category list, the customization of WooCommerce product ordering, etc.</p>\n<p><strong><a href=\"https://woolentor.com/demo/product-grid\" rel=\"nofollow ugc\">Product Grid</a></strong> – Display your WooCommerce products within a WooCommerce responsive grid layout with the WooCommerce product grid widget. This Elementor WooCommerce builder widget (Woo builder) offers 5 different WooCommerce grid layouts to showcase your WooCommerce products in a responsive grid for WooCommerce store with its WooCommerce widget responsive settings. Meaning the WooCommerce product grid widget will adjust to fit any screen size.</p>\n<p>A key feature of this Elementor WooCommerce widget is its WooCommerce responsive grid, which displays your WooCommerce products in a WooCommerce grid layout or responsive grid for WooCommerce while ensuring that your WooCommerce website adapts to the screen size of the customer&#8217;s device. You can rest assured that with the WooCommerce responsive grid system, your WooCommerce products are always displayed in an optimal way, regardless of what device your customers use. The WooCommerce responsive grid or responsive grid for WooCommerce is a significant selling point for WooCommerce, as it helps businesses reach a wider audience. You can even use this WooCommerce widget to control how many columns you want to display on each device.</p>\n<p>By using a responsive grid for WooCommerce, you can ensure that your customers will be able to see your WooCommerce products no matter what device they&#8217;re using. The WooCommerce product grid or Elementor grid widget can be of tremendous help if you want to showcase your WooCommerce products in a WooCommerce grid layout or responsive grid for WooCommerce. With this Elementor WooCommerce widget, you can enjoy the flexibility to exhibit your WooCommerce products in a grid view or WooCommerce grid layout.</p>\n<p>Furthermore, the Elementor grid widget allows you to control the number of columns, gutter width, and breakpoints. A grid view is a type of WooCommerce product display that arranges items in a WooCommerce grid layout or a responsive grid for WooCommerce instead of displaying them in a single column. The grid view products or grid products make it easy for visitors to scroll through the WooCommerce products and find their desired ones.</p>\n<p>Apart from choosing and configuring a WooCommerce product layout, you can control which WooCommerce products to display and how to display them in a WooCommerce product grid or WooCommerce grid layout based on multiple query settings such as product type, product categories, product order, number of products, and so on. Meaning that you can also leverage this Elementor WooCommerce product grid widget like a WooCommerce category product widget to display products based on categories. This WooCommerce category product widget is handy when it comes to getting the ability to control which category based products to display.</p>\n<p>Since the Elementor WooCommerce widget enables store owners to display their WooCommerce products in a responsive grid for WooCommerce stores, rest assured that the WooCommerce products will look great no matter which device visitors use to browse the store. If you prefer using the WooCommerce grid, WooCommerce grid layout, or WooCommerce responsive grid, this WooCommerce product grid widget will be tremendously helpful.</p>\n<p>ShopLentor&#8217;s product grid widget lets you showcase WooCommerce products in a WooCommerce grid layout. WooCommerce product grids are commonly used to display WooCommerce products on your online storefront. With this WooCommerce product grid widget or display product widget you can present your WooCommerce products on the WooCommerce shop and archive pages.</p>\n<p>Aside from displaying WooCommerce products in a responsive grid for WooCommerce, this product grid widget offers a wide range of customization options so that you can control many aspects of this widget, such as the number of columns, the number of WooCommerce products, WooCommerce product order, and so on. If you want your WooCommerce product display to be visually appealing, so it captures potential customers&#8217; attention, you should try out the WooCommerce product grid widget. This WooCommerce product grid widget is perfect for an online storefront that wants to display their WooCommerce products in a more organized and visually appealing way.</p>\n<p>In this Elementor WooCommerce widget, there are a few different WooCommerce product layout or product layouts for WooCommerce options available for store owners to choose from. Some of the most popular WooCommerce product layouts or product layouts for WooCommerce include the grid layout, the list layout, and the carousel layout.</p>\n<p>Each WooCommerce product layout has its own advantages and disadvantages, so it&#8217;s important to choose the right WooCommerce product layout for your online store based on your WooCommerce products and your customer&#8217;s needs.</p>\n<p>A WooCommerce product slider or Woo slider is a great way to showcase your WooCommerce products on your website. With a WooCommerce product slider or Woo slider, you can easily display your WooCommerce products in a stylish and eye-catching way. In addition, customers can scroll through your WooCommerce products in a WooCommerce product slider or Woo slider.</p>\n<p>Furthermore, the Woo slider is easy to use and comes with many customization options. That means you can control the WooCommerce slider or eCommerce slider and configure the WooCommerce widget product slider as per your needs. If you&#8217;re looking for a way to improve the look and feel of your online storefront and make it more user-friendly, then a WooCommerce product  &hellip;</p>\n",
        "installation": "<p>This section describes how to install the ShopLentor &#8211; WooCommerce Addons for Elementor Page Builder plugin and get it working.</p>\n<h4>1) Install</h4>\n<ol>\n<li>Go to the WordPress Dashboard &#8220;Add New Plugin&#8221; section.</li>\n<li>Search For &#8220;ShopLentor&#8221;.</li>\n<li>Install, then Activate it.</li>\n</ol>\n<h4>OR:</h4>\n<ol>\n<li>Unzip (if it is zipped) and Upload <code>woolentor-addons</code> folder to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n</ol>\n<h4>2) Configure</h4>\n<ol>\n<li>After install and activate the plugin you will get a notice to install Elementor Plugin ( If allready install it then do not show notice. ).</li>\n<li>To install the plugin click on the &#8220;Button&#8221; Install Elementor.</li>\n<li>‘SHOPLENTOR’ Category will be appear in Elementor page Editor</li>\n<li>Create new Product slider or product tab and relax!</li>\n</ol>\n",
        "faq": "\n<dt id='can%20i%20use%20shoplentor%20without%20woocommerce%3F'>\nCan I use ShopLentor without WooCommerce?\n</h4>\n<p>\n<p>No, ShopLentor is a plugin for WooCommerce and cannot be used without it. You need to use WooCommerce with ShopLentor for your online store.</p>\n</p>\n<dt id='what%20are%20the%20minimum%20requirements%20for%20using%20shoplentor%3F'>\nWhat are the minimum requirements for using ShopLentor?\n</h4>\n<p>\n<p>ShopLentor has been tested with the most up-to-date versions of both WordPress and WooCommerce.</p>\n</p>\n<dt id='how%20can%20i%20redirect%20to%20checkout%20page%20in%20woocommerce%3F'>\nHow can I redirect to checkout page in WooCommerce?\n</h4>\n<p>\n<p>Yes, you can set up a redirect to the checkout page in WooCommerce to skip the cart page. To do this, please follow these steps:</p>\n<ol>\n<li>\n<p>Go to Dashboard &gt; ShopLentor &gt; Modules.</p>\n</li>\n<li>\n<p>Enable Redirect to Checkout on Add to Cart.</p>\n</li>\n<li>\n<p>Visit the Shop/Store and click the add to cart button.</p>\n</li>\n</ol>\n<p>You can follow this <a href=\"https://woolentor.com/doc/redirect-to-checkout/\" rel=\"nofollow ugc\">doc</a>.</p>\n</p>\n<dt id='how%20do%20i%20create%20a%20multi-step%20checkout%20in%20woocommerce%3F'>\nHow do I create a multi-step checkout in WooCommerce?\n</h4>\n<p>\n<p>ShopLentor Pro provides an easy way to create a multi-step checkout. You can follow this <a href=\"https://woolentor.com/doc/woocommerce-multi-step-checkout/\" rel=\"nofollow ugc\">online documentation</a> to create a multi-step checkout in WooCommerce.</p>\n<ol>\n<li>\n<p>Go to Dashboard &gt; ShopLentor &gt; Modules.</p>\n</li>\n<li>\n<p>Enable Multi-Step Checkout.</p>\n</li>\n<li>\n<p>From ShopLentor Template Builder &gt; Add New Template</p>\n</li>\n<li>\n<p>Select the template type “Checkout”</p>\n</li>\n<li>\n<p>Drag WL: Multi-Step Checkout widget and Edit the template</p>\n</li>\n</ol>\n</p>\n<dt id='how%20do%20i%20add%20a%20wishlist%20in%20woocommerce%3F'>\nHow do I add a wishlist in WooCommerce?\n</h4>\n<p>\n<p>ShopLentor provides a module for Wishlist, using that module you can easily add a wishlist to the WooCommerce product and archive page. You can follow the <a href=\"https://woolentor.com/doc/wishlist-for-woocommerce/\" rel=\"nofollow ugc\">documentation here</a>:</p>\n<ol>\n<li>\n<p>Go to Dashboard &gt; ShopLentor &gt; Modules.</p>\n</li>\n<li>\n<p>Enable Wishlist.</p>\n</li>\n<li>\n<p>ShopLentor &gt; Wishlist</p>\n</li>\n<li>\n<p>Make necessary setting</p>\n</li>\n</ol>\n</p>\n<dt id='how%20do%20i%20compare%20products%20in%20woocommerce%3F'>\nHow do I compare products in WooCommerce?\n</h4>\n<p>\n<p>Yes, you can use the WooCommerce Product Compare plugin to compare products in WooCommerce. You can follow the steps below:</p>\n<ol>\n<li>\n<p>Install and activate the ShopLentor plugin.</p>\n</li>\n<li>\n<p>Go to Dashboard &gt; ShopLentor &gt; Modules and enable the Product Compare module.</p>\n</li>\n<li>\n<p>Enable the Compare module</p>\n</li>\n<li>\n<p>Go to ShopLentor &gt; Compare</p>\n</li>\n<li>\n<p>Compare Settings</p>\n</li>\n</ol>\n<p>You can check <a href=\"https://woolentor.com/doc/woocommerce-product-compare/\" rel=\"nofollow ugc\">full docs here</a></p>\n</p>\n<dt id='how%20do%20i%20add%20a%20flash%20sale%20countdown%20timer%20in%20woocommerce%3F'>\nHow do I add a flash sale countdown timer in WooCommerce?\n</h4>\n<p>\n<p>Yes, you can use the <a href=\"https://woolentor.com/doc/enable-sales-countdown-timer-in-woocommerce/\" rel=\"nofollow ugc\">WooCommerce Product Flash sale Countdown</a> module to add pre schedule or on schedule sale discount countdown timer in WooCommerce. You can follow the steps below:</p>\n<ol>\n<li>\n<p>Install and activate the ShopLentor plugin.</p>\n</li>\n<li>\n<p>Go to Dashboard &gt; ShopLentor &gt; Modules.</p>\n</li>\n<li>\n<p>Enable the Countdown module.</p>\n</li>\n</ol>\n<p>WooCommerce Sales countdown can boost your sales. If you are looking for a countdown plugin for WooCommerce, then you can use ShopLentor for your online store. ShopLentor has an Elementor countdown addon or sales countdown WooCommerce addon which helps to display sale countdown timer WooCommerce for any special days offers like Christmas countdown, Black Friday countdown, etc.</p>\n</p>\n<dt id='how%20to%20enable%20backorder%20in%20woocommerce%3F'>\nHow to enable backorder in WooCommerce?\n</h4>\n<p>\n<p>You can enable backorder in WooCommerce using ShopLentor&#8217;s backorder module. Follow the following steps:</p>\n<p>Step 1: Enable the Backorder module</p>\n<p>Step 2: Go to Product Edit Page</p>\n<p>Step 3: Setup Backorder for the product</p>\n<p>You can check the full online documentation about &#8220;How to enable backorder in WooCommerce?&#8221; <a href=\"https://woolentor.com/doc/how-to-enable-woocommerce-backorder/\" rel=\"nofollow ugc\">from this link</a>.</p>\n</p>\n<dt id='how%20to%20make%20woocommerce%20checkout%20look%20like%20shopify%3F'>\nHow to make WooCommerce checkout look like Shopify?\n</h4>\n<p>\n<p>ShopLentor provides a module to customize the default WooCommerce checkout design to look like Shopify. You can follow these steps:</p>\n<ol>\n<li>\n<p>Install and activate the ShopLentor plugin</p>\n</li>\n<li>\n<p>Go to Dashboard &gt; ShopLentor &gt; Modules</p>\n</li>\n<li>\n<p>Enable the Shopify Style Checkout</p>\n</li>\n</ol>\n</p>\n<dt id='what%20is%20ajax%20search%20for%20woocommerce%3F'>\nWhat is AJAX search for WooCommerce?\n</h4>\n<p>\n<p>WooCommerce Ajax Search makes it quick and easy to search for items in your online store without having to reload the page. WooCommerce search content or results are displayed in real-time, allowing users to see them immediately.</p>\n</p>\n<dt id='how%20do%20i%20add%20ajax%20search%20in%20woocommerce%3F'>\nHow do I add AJAX search in WooCommerce?\n</h4>\n<p>\n<p>ShopLentor comes with the Ajax Live Product search, WooCommerce search products, or WooCommerce search form module. It helps your customers to find their desired products quickly and easily from your WooCommerce store without full-text searching through an advanced search widget. ShopLentor&#8217;s ajax search form enables category wise search widget or  WooCommerce search taxonomy search bar. The benefits of using this WooCommerce fast search/Woo ajax search module are &#8211; Ajax shopping experience, visual product search/product image search, ajax search suggestion, etc.</p>\n<p>You can follow these steps:</p>\n<ol>\n<li>\n<p>Install and activate the ShopLentor plugin</p>\n</li>\n<li>\n<p>Go to Dashboard &gt; ShopLentor &gt; Modules.</p>\n</li>\n<li>\n<p>Enable Ajax Search Widget.</p>\n</li>\n<li>\n<p>Edit the page template from the ShopLentor &gt; Template Builder.</p>\n</li>\n<li>\n<p>Drag and drop the ajax product search widget.</p>\n</li>\n</ol>\n</p>\n<dt id='how%20to%20add%20ajax%20add%20to%20cart%20on%20woocommerce%20product%20page%3F'>\nHow to add Ajax Add to cart on WooCommerce product Page?\n</h4>\n<p>\n<p>ShopLentor has a module for ajax based cart or quick add to cart. You can use the ShopLentor Ajax add to cart module for adding ajax add to cart functionality on WooCommerce product page. You can follow these steps:</p>\n<ol>\n<li>\n<p>Install and activate the ShopLentor plugin.</p>\n</li>\n<li>\n<p>Go to Dashboard &gt; ShopLentor &gt; Modules.</p>\n</li>\n<li>\n<p>Enable Ajax Add To Cart Module.</p>\n</li>\n</ol>\n</p>\n<dt id='how%20to%20add%20a%20custom%20field%20in%20woocommerce%20checkout%3F'>\nHow to add a custom field in WooCommerce checkout?\n</h4>\n<p>\n<p>ShopLentor Pro has a module for WooCommerce checkout field editor. You can use the WooCommerce checkout fields manager module to add custom fields/WooCommerce additional fields/WooCommerce extra checkout fields, hide checkout fields, and remove billing fields on the WooCommerce checkout page or Elementor WooCommerce checkout template. You can follow these steps:</p>\n<ol>\n<li>\n<p>Install and activate the ShopLentor plugin.</p>\n</li>\n<li>\n<p>Go to Dashboard &gt; ShopLentor &gt; Modules.</p>\n</li>\n<li>\n<p>Enable Checkout Field Manager Module.</p>\n</li>\n<li>\n<p>Modify Checkout fields.</p>\n</li>\n<li>\n<p>Add new fields if required.</p>\n</li>\n<li>\n<p>Save changes.</p>\n</li>\n</ol>\n</p>\n<dt id='how%20do%20i%20add%20a%20product%20size%20chart%20in%20woocommerce%3F'>\nHow do I add a Product size chart in WooCommerce?\n</h4>\n<p>\n<p>ShopLentor pro has the size chart WooCommerce module. You can use the WooCommerce size guide module to add a size chart on the product page. You can follow these steps:</p>\n<ol>\n<li>\n<p>Install and activate the ShopLentor plugin.</p>\n</li>\n<li>\n<p>Go to Dashboard &gt; ShopLentor &gt; Modules.</p>\n</li>\n<li>\n<p>Enable WooCommerce Size Chart Module.</p>\n</li>\n<li>\n<p>Go to ShopLentor &gt; Size Charts</p>\n</li>\n<li>\n<p>Add a New Size chart.</p>\n</li>\n<li>\n<p>Choose Product and Save.</p>\n</li>\n</ol>\n</p>\n<dt id='how%20to%20edit%20labels%20in%20woocommerce%3F'>\nHow to edit labels in WooCommerce?\n</h4>\n<p>\n<p>ShopLentor has a module for WooCommerce label customization. You can use the WooCommerce custom product label module to edit/change labels on product label, WooCommerce add to cart button label, out of stock label,  categories/Archive page labels, and tags pages of the WooCommerce store. You can follow these steps:</p>\n<ol>\n<li>\n<p>Install and activate the ShopLentor plugin.</p>\n</li>\n<li>\n<p>Go to Dashboard &gt; ShopLentor &gt; Modules.</p>\n</li>\n<li>\n<p>Enable WooCommerce rename Label Module.</p>\n</li>\n<li>\n<p>Edit the labels.</p>\n</li>\n<li>\n<p>Save changes.</p>\n</li>\n</ol>\n</p>\n<dt id='how%20to%20show%20best%20selling%20products%20by%20category%3F'>\nHow to show best selling products by category?\n</h4>\n<p>\n<p>You can show best selling products using the Universal Widget of ShopLentor. This widget can be used as a WooCommerce best selling product widget WooCommerce. Where you can show best selling products by category. To do this, follow these steps</p>\n<ol>\n<li>Edit a page where you want to add the best selling products.</li>\n<li>Drag the Universal Widget.</li>\n<li>Choose options to show the best sell products.</li>\n</ol>\n</p>\n<dt id='how%20to%20show%20featured%20products%20in%20woocommerce%3F'>\nHow to show featured products in WooCommerce?\n</h4>\n<p>\n<p>ShopLentor comes with the Universal Layout widget to show WooCommerce featured products. you can use the WooCommerce featured product query to show featured products in different ways on your store. You can follow these steps:</p>\n<ol>\n<li>\n<p>Install and activate the ShopLentor plugin.</p>\n</li>\n<li>\n<p>Edit a Page where you want to add the featured WooCommerce Products.</p>\n</li>\n<li>\n<p>Drag the Universal Layout Widget.</p>\n</li>\n<li>\n<p>Filter By &gt; Featured Products</p>\n</li>\n<li>\n<p>To Show Featured product by category name, add categories.</p>\n</li>\n</ol>\n</p>\n<dt id='how%20does%20shoplentor%20compare%20with%20other%20woocommerce%20elementor%20addons%3F'>\nHow does ShopLentor compare with other WooCommerce Elementor Addons?\n</h4>\n<p>\n<p>Although ShopLentor and other WooCommerce Elementor Addons like ShopEngine or JetWidgets are also focused on making the entire WooCommerce website building experience easier with the Elementor page builder, ShopLentor WooCommerce addon offers some remarkable features while some of its competitors don&#8217;t. To name a few, Shopify Style Checkout, MultiStep Checkout for WooCommerce, custom WooCommerce Checkout Fields Editor, Email Customizer, Email Automation, GTM Conversion Tracking, and several others.</p>\n</p>\n<dt id='can%20i%20use%20shoplentor%20along%20with%20any%20other%20plugins%20that%20are%20powered%20by%20elementor%20%26%20woocommerce%3F'>\nCan I use ShopLentor along with any other plugins that are powered by Elementor &amp; WooCommerce?\n</h4>\n<p>\n<p>ShopLentor is meticulously crafted with all the standards and best practices of both Elementor and WooCommerce. So, it is not likely to create any conflicts with other Elementor and WooCommerce plugins. On top of that, we have tested the ShopLentor plugin with several popular Elementor plugins or Elementor Addons and WooCommerce-based plugins. While doing so, we made sure that they worked perfectly with ShopLentor. Some of them are Master Addons, PowerPack Addons, Exclusive Addons, ElementsKit, Livemesh Addons, WooCommerce Shipping, WooCommerce PDF Invoices, YITH WooCommerce Wishlist, YITH WooCommerce Compare, Product Labels For Woocommerce (Sale Badges), Mailchimp for WooCommerce Integration, YayMail – WooCommerce Email Customizer, Wholesale Suite, Booster for WooCommerce, ShopReady, JetWidgets, CoDesigner and so on.</p>\n</p>\n<dt id='is%20it%20possible%20to%20add%20woocommerce%20extra%20checkout%20fields%20with%20shoplentor%3F'>\nIs it possible to add WooCommerce extra checkout fields with ShopLentor?\n</h4>\n<p>\n<p>Yes, of course. ShopLentor&#8217;s Checkout Field Manager or Checkout Field Editor module allows users to add or remove WooCommerce custom fields checkout or WooCommerce checkout fields. Besides, users can also customize existing WooCommerce checkout fields as per their needs.</p>\n</p>\n<dt id='can%20i%20use%20any%20third-party%20woocommerce%20newsletter%20plugin%20with%20shoplentor%3F'>\nCan I use any third-party WooCommerce newsletter plugin with ShopLentor?\n</h4>\n<p>\n<p>As you may already know, ShopLentor is designed by following all the best practices and standards of WooCommerce, so we can assure you that it will be compatible with a third-party WooCommerce advanced newsletter plugin, WooCommerce newsletter subscription plugin, or WooCommerce Mailchimp integration plugin.</p>\n<p>If you run into any issues, feel free to contact us through our support website.</p>\n</p>\n<dt id='does%20shoplentor%20support%20woocommerce%20digital%20product%20sales%20and%20deliver%20digital%20files%20to%20customers%3F'>\nDoes ShopLentor support WooCommerce digital product sales and deliver digital files to customers?\n</h4>\n<p>\n<p>Yes, ShopLentor can handle WooCommerce digital products or WooCommerd downloadable products (e.g. sell digital print, Ebook, etc.) without any issues. In case you want to integrate any specific functionality on your digital products store that WooCommerce doesn&#8217;t offer by default, you may need to use third-party plugins.</p>\n</p>\n<dt id='how%20much%20does%20shoplentor%20impact%20woocommerce%20speed%20or%20page%20speed%3F'>\nHow much does ShopLentor impact WooCommerce speed or page speed?\n</h4>\n<p>\n<p>With great pleasure, we&#8217;d like to inform you that our team runs several tests before releasing any major ShopLentor update to ensure that it doesn&#8217;t affect a website&#8217;s performance in terms of WooCommerce speed or page speed 🚀</p>\n<p>Aside from that, ShopLentor allows users to enable or disable specific Elementor WooCommerce widgets and modules as per their needs to speed up Elementor WooCommerce widgets&#8217; performance 💪</p>\n<p>Another noteworthy fact is that no heavy PHP rendering is required to render any of ShopLentor&#8217;s widgets and modules from the server side. Therefore, it is unlikely that the plugin will have a detrimental impact on the speed of a website.</p>\n</p>\n\n",
        "changelog": "<h4>Version: 2.9.6 &#8211; Date: 1-09-2024</h4>\n<ul>\n<li>Added : Quick View Module.</li>\n<li>Added : Suggest Price Form submission handle from Ajax for better user experience. </li>\n<li>Solved : Shipping Method cost calculate issue in Shopify Style checkout Module.</li>\n<li>Solved : Order overview table width issue with Shopify Style checkout Module.</li>\n<li>Solved : Single Product Ajax Add to cart data passing issue.</li>\n<li>Solved : Backorder Meta key showing issue.</li>\n<li>Solved : Empty data fetching issue.</li>\n<li>Solved : Variation Swatch module product fetching issue with Gutenberg block theme.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.9.5 &#8211; Date: 12-08-2024</h4>\n<ul>\n<li>Solved : WooCommerce Deprecated notice issue with Sales Notification Module.</li>\n<li>Solved : Template Library data showing issue.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.9.4 &#8211; Date: 29-07-2024</h4>\n<ul>\n<li>Added : Product title added in suggest Price Email Header.</li>\n<li>Added : Product Flash Sale Gutenberg block.</li>\n<li>Solved : Compare Table empty string undefined issue.</li>\n<li>Solved : Popup Builder Setting menu Support for Elementor Top bar Pannel.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.9.3 &#8211; Date: 08-07-2024</h4>\n<ul>\n<li>Added : Enabling option to show the stock status of variable product in Add to cart Addon.</li>\n<li>Added : Variable product stock status showing support to WL: Product Stock addon.</li>\n<li>Added : Wishlist counter Gutenberg Block.</li>\n<li>Added : Ever Compare Table Gutenberg Block.</li>\n<li>Added : Ajax Pagination for WishSuite table.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.9.2 &#8211; Date: 24-06-2024</h4>\n<ul>\n<li>Added : WishList Table Gutenberg Block.</li>\n<li>Solved : Number field data validation in horizontal product filter.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.9.1 &#8211; Date: 10-06-2024</h4>\n<ul>\n<li>Solved : Horizontal Product filter Price range rendering issue.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.9.0 &#8211; Date: 02-06-2024</h4>\n<ul>\n<li>Added : Product Tags Gutenberg Block.</li>\n<li>Added : Product Video Gallery Gutenberg Block.</li>\n<li>Added : Tab Menu alignment, Border radius, Title style, Price style, Action Button Border radius, Slider Control Style and Badge Customise option in Product tab Block.</li>\n<li>Added : Pagination Style option in product grid Block.</li>\n<li>Added : Increase style option for content and single item option in Recently View Product Block.</li>\n<li>Added : Style option for Action button and content in Special Day Offer Block.</li>\n<li>Added : Style option for Header and content in FAQ Block.</li>\n<li>Added : Image, Button and Content style option in Promo Banner Block.</li>\n<li>Added : Image Marker style option and Data real time update in Image Marker Block.</li>\n<li>Added : Slider Control Style option for Brand Logo Block. </li>\n<li>Added : Increase Style option for Product Curvy Block.</li>\n<li>Added : Increase Style option for Archive Title Block.</li>\n<li>Added Content Style, Image Style and Real Time data update option in Customer Review Block.</li>\n<li>Solved : Ajax add to cart button doesn&#8217;t work when variations selected by default.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.8.9 &#8211; Date: 19-05-2024</h4>\n<ul>\n<li>Added : Product Horizontal Filter Gutenberg Block.</li>\n<li>Added : Product Categories Gutenberg Block.</li>\n<li>Added : Product SKU Gutenberg Block.</li>\n<li>Added : Product Suggest Price Gutenberg Block.</li>\n<li>Added : Product call for price Gutenberg Block.</li>\n<li>Fixes: Minor Issues.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.8.8 &#8211; Date: 02-05-2024</h4>\n<ul>\n<li>Added : Option To Hide or Show Buyer Name in Sale Notification Module.</li>\n<li>Added : Product Fiter Gutenberg Block.</li>\n<li>Added : Archive Catalog Ordering Gutenberg Block.</li>\n<li>Added : Archive Result Count.</li>\n<li>Solved : Ajax Search Widget style issue.</li>\n<li>Solved : Product price color issue in Product curvy widget.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.8.6 &#8211; Date: 17-04-2024</h4>\n<ul>\n<li>Solved : Product class conflict issue with WoodMart theme.</li>\n<li>Solved : QR Code Height and Width issue in product QR code addon.</li>\n<li>Solved :  Swatchly variation image change issue in Universal product layout addon.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.8.5 &#8211; Date: 04-04-2024</h4>\n<ul>\n<li>Solved : Product QR Code Size rending issue.</li>\n</ul>\n<h4>Version: 2.8.4 &#8211; Date: 01-04-2024</h4>\n<ul>\n<li>Solved : Tag selection issue in recently view product addon.</li>\n<li>Solved : Currency list showing issue in module setting.</li>\n<li>Solved : Minor Issues.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.8.3 &#8211; Date: 19-03-2024</h4>\n<ul>\n<li>Solved : PHP 8.2 Version Compatibility in Variation swatch module.</li>\n<li>Solved : Image change issue with Variation swatch module.</li>\n<li>Solved : Spacing issue with archive default layout in Mobile device.</li>\n<li>Solved : Promotional Widget showing issue in Elementor Editor mode.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.8.2 &#8211; Date: 04-03-2024</h4>\n<ul>\n<li>Solved : Wishlist button class rendering issue.</li>\n<li>Solved : Product id fetching issue in compare button shortcode.</li>\n<li>Soled : Single Product default image show with FSE Theme. </li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.8.1 &#8211; Date: 18-02-2024</h4>\n<ul>\n<li>Added : Currency Switcher Block for Gutenberg.</li>\n<li>Solved : Editor mode background image showing issue in Image marker block.</li>\n<li>Solved : Null value passing warning issue in variation swatch module.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.7.9 &#8211; Date: 04-02-2024</h4>\n<ul>\n<li>Added :  Support to all block in Full Site editing screen.</li>\n<li>Added : Same Hight grid option in Recently view product addon.</li>\n<li>Solved : Required field validation issue with Shopify like checkout module.</li>\n<li>Solved : Default currency set issue in Multi Currency Switcher module.</li>\n<li>Solved : Hidden product display issue with Ajax search Module.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.7.8 &#8211; Date: 21-01-2024</h4>\n<ul>\n<li>Added : Multi Currency Module.</li>\n<li>Added : Elementor Widget for Multi Currency Switcher.</li>\n<li>Added :  Exclude Out Of Stock product option in Product tab addon.</li>\n<li>Solved : Single product template render issue with Dokan.</li>\n<li>Solved : Minor Issues.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.7.7 &#8211; Date: 31-12-2023</h4>\n<ul>\n<li>Solved : Header and Footer showing issue with Full site editing.</li>\n<li>Solved : Product image showing issue in single product template.</li>\n<li>Solved : Minor issue.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.7.6 &#8211; Date: 18-12-2023</h4>\n<ul>\n<li>Solved : Template content render issue with default template.</li>\n<li>Solved : The Multi-Select field style in the Option Panel conflicts with a third-party plugin.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.7.5 &#8211; Date: 04-12-2023</h4>\n<ul>\n<li>Solved : Template Build issue with default template.</li>\n<li>Solved : Product title render issue in shopify like checkout page module.</li>\n<li>Solved : Sales notification showing verification issue.</li>\n<li>Solved : Minor issues.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.7.4 &#8211; Date: 27-11-2023</h4>\n<ul>\n<li>Added : Option for slider infinite loop control in universal product widget.</li>\n<li>Added : Variation product showing issue in Flash sale countdown widget.</li>\n<li>Solved : Dynamic variable creation issue.</li>\n<li>Improve : Template Building functionality.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.7.3 &#8211; Date: 11-11-2023</h4>\n<ul>\n<li>Added : Popup Close Gutenberg block for Popup Builder module.</li>\n<li>Added : Testimonial Gutenberg block.</li>\n<li>Compatibility : Latest WordPress and WooCommerce version.</li>\n</ul>\n<h4>Version: 2.7.2 &#8211; Date: 30-10-2023</h4>\n<ul>\n<li>Added : Background color option add in all Gutenberg block.</li>\n<li>Added : Tab Menu style option in Gutenberg Product Tab block.</li>\n<li>Added: Option to set popup close button position</li>\n<li>Tweak: Dependency for the redirect url</li>\n<li>Fixed Popup settings were working for the free version if pro version is deactivated</li>\n<li>Improved : Admin notice UI.</li>\n<li>Compatibility : Latest WordPress Version.</li>\n</ul>\n<h4>Version: 2.7.1 &#8211; Date: 11-10-2023</h4>\n<ul>\n<li>Added: Compatibility with HPOS.</li>\n<li>Added : Align option has been added in shop archive layout default block.</li>\n<li>Solved : Conditions repeater field generation issue in Popup builder module.</li>\n<li>Solved : Close button trigger doesn&#8217;t work issue in Popup builder module.</li>\n<li>Compatibility : Sale Notification and display first order data in editor mode compatible with high performance order storage.</li>\n</ul>\n<h4>Version: 2.7.0 &#8211; Date: 25-09-2023</h4>\n<ul>\n<li>Added: Popup builder template import option and template display in template library and Gutenberg editor mode.</li>\n<li>Added: Option to add in category grid widget show category &gt; subcategory for shop page.</li>\n<li>Added: Min width option for filter item in horizontal Filter addon.</li>\n<li>Added: Close popup trigger button addon for Elementor in popup builder module.</li>\n<li>Added : Cookie support with the Close button trigger addon in popup builder module.</li>\n<li>Added : Option to disable close button in popup builder module.</li>\n<li>Solved: Border radius issue in WL : Product image addon.</li>\n<li>Tweak : wlpb_module_popup_open and wlpb_popup_closed JS trigger added in popup builder module.</li>\n<li>Tweak : reflect the Popup width / height / and positions changes support for elementor editor in popup builder module.</li>\n</ul>\n<h4>Version: 2.6.9 &#8211; Date: 09-09-2023</h4>\n<ul>\n<li>Added: Introduced a link to the Popup Builder module for easy access when creating popups in popup builder Module.</li>\n<li>Added: Options for Open/Close Animation in popup builder Module.</li>\n<li>Option to set the frequency of popup display by specifying the number of days and close count in popup builder Module.</li>\n<li>Added: The Entire Site condition option by default in popup builder Module.</li>\n<li>Solved : Elementor deprecated warning issue.</li>\n<li>Solved : Inactivity Time option is now functioning properly in popup builder Module.</li>\n<li>Solved : Resolved a popup query issue related to the setup_postdata function in popup builder Module.</li>\n<li>Solved : Demo template data showing issue in elementor mode.</li>\n<li>Solved: Increment and decrement button showing issue if product quantity is less then 1 or equal.</li>\n</ul>\n<h4>Version: 2.6.8 &#8211; Date: 27-08-2023</h4>\n<ul>\n<li>Added : Popup template import functionality has been added.</li>\n<li>Solved : Demo template showing issue in template add screen with popup builder module.</li>\n<li>Solved : Product current query issue for shop page.</li>\n<li>Solved : Gutenbarge block editor some field style issue.</li>\n</ul>\n<h4>Version: 2.6.7 &#8211; Date: 21-08-2023</h4>\n<ul>\n<li>Added : Product Meta Data show in Shopify like checkout module.</li>\n<li>Added : Sort By product filter label change option in product Vertical and Horizontal product filter addon.</li>\n<li>Added : QuickView close if click on outside and cross icon.</li>\n<li>Added : Popup Builder Module.</li>\n<li>Solved : Product ordering issue in default archive addon.</li>\n<li>Compatibility : Compatibility with latest WooCommerce and Elementor Version.</li>\n</ul>\n<h4>Version: 2.6.6 &#8211; Date: 31-07-2023</h4>\n<ul>\n<li>Solved : HTML Tag name spelling issue in shopify like module.</li>\n<li>Solved : Sample template showing issue has been solved.</li>\n<li>Solved : External product redirect issue from QuickView popup.</li>\n<li>Solved : External product add to cart button issue with single product ajax add to cart module.</li>\n<li>Solved : Dimension field style issue for Gutenberg.</li>\n<li>Compatibility : With latest WooComemrce and Latest WordPress version.</li>\n</ul>\n<h4>Version: 2.6.5 &#8211; Date: 08-07-2023</h4>\n<ul>\n<li>Compatibility : Wishlist button Compatibility with WC FSE blocks.</li>\n<li>Compatibility : With latest WooComemrce and Latest Elelementor version.</li>\n</ul>\n<h4>Version: 2.6.4 &#8211; Date: 25-06-2023</h4>\n<ul>\n<li>Solved : Product show issue with product filter addon.</li>\n<li>Solved: Footer menu doesn’t showing issue with shopify like checkout page.</li>\n<li>Solved : Variation Swatch render issue with QuickCart.</li>\n<li>Compatibility : With latest WooComemrce and Latest Elelementor version.</li>\n</ul>\n<h4>Version: 2.6.3 &#8211; Date: 28-05-2023</h4>\n<ul>\n<li>Added : Option to show back order product available date and send it to client email address after order completion.</li>\n<li>Solved : Backorder field hide and showing issue in product edit screen.</li>\n</ul>\n<h4>Version: 2.6.2 &#8211; Date: 14-05-2023</h4>\n<ul>\n<li>Solved : Post duplicate issue has been solved in post duplicator module.</li>\n<li>Compatibility : With latest WooComemrce and Latest Elelementor version.</li>\n</ul>\n<h4>Version: 2.6.1 &#8211; Date: 30-04-2023</h4>\n<ul>\n<li>Added : Two filter for third party Wishlist plugin compatibility.</li>\n<li>Solved : Add to cart button style issue in QuickView template.</li>\n<li>Compatibility : With latest WooComemrce and Latest Elelementor version.</li>\n</ul>\n<h4>Version: 2.6.0 &#8211; Date: 18-04-2023</h4>\n<ul>\n<li>Added : Gutenberg template list show in template manager popup.</li>\n<li>Improved : Template sample data store process.</li>\n<li>Solved : Added to cart button showing issue in cart page.</li>\n<li>Solved : Gutenbarge block tab menu icon overlapping issue.</li>\n<li>Solved : Quantity increase / decrease issue with multiple add to cart button.</li>\n</ul>\n<h4>Version: 2.5.9 &#8211; Date: 12-04-2023</h4>\n<ul>\n<li>Added : Option to add existing page selection or custom url for Shopify like checkout page module logo.</li>\n<li>Solved : PHP warning issue in Wishlist Module.</li>\n<li>Solved : Prepare query placeholder issue in Wishlist Module.</li>\n</ul>\n<h4>Version: 2.5.8 &#8211; Date: 28-03-2023</h4>\n<ul>\n<li>Added : Gutenberg Template library</li>\n<li>Added : Pagination option in Wishlist table.</li>\n<li>Added :  Product Limit Option in Wishlist Module.</li>\n<li>Solved : Wishlist Product counter item showing issue.</li>\n<li>Solved : Compare Button Text showing issue in add to cart addon.</li>\n<li>Solved : Widget Script Dependency issue.</li>\n</ul>\n<h4>Version: 2.5.7 &#8211; Date: 13-03-2023</h4>\n<ul>\n<li>Added : Background color option in promo banner block.</li>\n<li>Added : Title, Subtitle banner area Dimension control option in promo banner block.</li>\n<li>Solved : Product adding issue with Compare table listing mode.</li>\n<li>Compatibility : With latest WooComemrce and Latest Elelementor version.</li>\n</ul>\n<h4>Version: 2.5.6 &#8211; Date: 26-02-2023</h4>\n<ul>\n<li>Added : Content Alignment option in Product rating block.</li>\n<li>Added : Price Alignment option in Product Price block.</li>\n<li>Added : Alignment option in Product stock block.</li>\n<li>Added : Alignment option in Product Meta block.</li>\n<li>Solved : Border CSS generate issue in product add to cart block.</li>\n<li>Solved : CSS Generate issue in editor mode for product tabs block.</li>\n<li>Solved : Toggle control component style issue in Related product addon.</li>\n<li>Solved : Cart and Shipping step navigation hide issue for mobile device in Shopify like checkout module.</li>\n</ul>\n<h4>Version: 2.5.5 &#8211; Date: 04-02-2023</h4>\n<ul>\n<li>Added : 4 Style has been added in single product add to cart block.</li>\n<li>Added : WishList and Compare Button control option added in single product add to cart block.</li>\n<li>Solved : Template Container Width issue in Elementor Editor.</li>\n<li>Solved : Template Container width Metabox render issue.</li>\n<li>Solved : Has been solved missed return value from add to cart filter in backorder module.</li>\n<li>Solved : PHP Undefined Function issue if WooCommerce is Deactivate.</li>\n<li>Compatibility : Universal Product Layout compatibility with kadence theme.</li>\n</ul>\n<h4>Version: 2.5.4 &#8211; Date: 23-01-2023</h4>\n<ul>\n<li>Added : Category description showing option has been added in WL Category Grid</li>\n<li>Added : Show city, Show state, Show Country option has been added in sales notification module.</li>\n<li>Added : Purchased by and price label change option has been added in sales notification module.</li>\n<li>Added : Cross Icon color option in Product Filter addon.</li>\n<li>Tweak : HTML tags allow in Archive Title Addon and Block.</li>\n<li>Tweak : Template builder Custom Meta box move to Gutenberg Meta Box Control.</li>\n<li>Compatibility : Polylag and WPML Support in wishlist and compare Module.</li>\n<li>Solved : Class Attribute adding issue form advance settings of the block  &#8220;Additional CSS class(es)&#8221;</li>\n<li>Solved : Tab Alignment Issue in WL Product Tab addon.</li>\n<li>Solved : Wishlist Product Limit issue in wishlist table.</li>\n<li>Solved : Compare Product Limit issue in compare table.</li>\n</ul>\n<h4>Version: 2.5.3 &#8211; Date: 08-1-2023</h4>\n<ul>\n<li>Added : Hidden item showing option in Universal Product layout.</li>\n<li>Added : Out Of Stock item hide / show option in Universal Product layout.</li>\n<li>Added : Recently Viewed Product Gutenberg Block.</li>\n<li>Solved : Number of item showing issue in category grid block.</li>\n</ul>\n<h4>Version: 2.5.2 &#8211; Date: 27-12-2022</h4>\n<ul>\n<li>Added : Title background Color change option has been added in category grid addon.</li>\n<li>Added : Aria Label attribute added in all quick-view anchor tag.</li>\n<li>Solved :  Template data Import issue has been fixed. </li>\n<li>Solved : Template Builder Wide fetching issue.</li>\n<li>Solved : Custom payment Button showing issue in cart page with WooCommerce Stripe Gateway plugin. </li>\n<li>Solved : All Category showing issue in category grid block.</li>\n<li>Compatibility with the latest WooCommerce version.</li>\n<li>Compatibility With latest Elementor Version.</li>\n</ul>\n<h4>Version: 2.5.1 &#8211; Date: 06-12-2022</h4>\n<ul>\n<li>Added :  WooLentor Builder Template Import option from template library.</li>\n<li>Added : Parent Category Showing option in Category grid addon.</li>\n<li>Added : Parent Category Showing option in Category List addon.</li>\n<li>Solved : Lighthouse validation issue in (Universal Product, Product Filter and Product Filter module)</li>\n<li>Solved : Add to cart product duplicate entity issue with single product Ajax add to cart module.</li>\n<li>Compatibility With latest Elementor Version.</li>\n</ul>\n<h4>Version: 2.5.0 &#8211; Date: 27-11-2022</h4>\n<ul>\n<li>Added :  Single product Review Form Block.</li>\n<li>Added : Slider option has been added in Brand logo block.</li>\n<li>Improved : Sample Template import process and default title random generate change to template title.</li>\n<li>Improved : Elementor dependency has been added in template import process.</li>\n<li>Improved : Sample template name show in template edit manager popup.</li>\n<li>Solved : Gutenberg Block ColorPalette reset button showing issue.</li>\n<li>Solved : Add to cart icon showing issue has been foxed in Product Tab block.</li>\n<li>Compatibility with the latest WooCommerce version.</li>\n</ul>\n<h4>Version: 2.4.9 &#8211; Date: 17-11-2022</h4>\n<ul>\n<li>Solved : Template sample data import issue.</li>\n<li>Changed : Menu name and menu slug.</li>\n</ul>\n<h4>Version: 2.4.8 &#8211; Date: 13-11-2022</h4>\n<ul>\n<li>Solved : Single product add to cart issue with single product add to cart module.</li>\n<li>Solved : Currency separate fetching issue in Filter addons.</li>\n<li>Solved : Product Filter non taxonomy select warning.</li>\n<li>Compatible: Multi Language supported.</li>\n<li>Compatibility with the latest WooCommerce version.</li>\n<li>Compatibility with the latest WordPress version.</li>\n</ul>\n<h4>Version: 2.4.7 &#8211; Date: 06-11-2022</h4>\n<ul>\n<li>Solved : Issue in showing recommended extensions for php7.</li>\n<li>Solved : Issue with the display of wishlist and compare icon in product grid block.</li>\n<li>Solved : Anchor tag link validation issue in QuickView button.</li>\n<li>Solved : Width control issue in the horizontal filter addon element.</li>\n<li>Solved : Redirection issue of the filter addon in the Elementor editor mode.</li>\n<li>Solved : Compatibility issue of the &#8220;Single Product Ajax Add to Cart&#8221; module with third-party plugin.</li>\n<li>Solved : Issue with the overriding of outdated templates.</li>\n<li>Compatibility with the latest WooCommerce version.</li>\n<li>Compatibility with the latest WordPress version.</li>\n</ul>\n<h4>Version: 2.4.6 &#8211; Date: 17-10-2022</h4>\n<ul>\n<li>Added :  Hooks  for custom validation.</li>\n<li>Improved : Gutenberg blocks style option.</li>\n<li>Solved : Compatibility issue with PHP 7.2 in Variation swatches module.</li>\n<li>Solved : An activation issue with slick slider  in Universal layout addon.</li>\n<li>Compatibility with the latest WooCommerce version.</li>\n</ul>\n<h4>Version: 2.4.5 &#8211; Date: 20-09-2022</h4>\n<ul>\n<li>Added : Ordering option in Category grid / List addons.</li>\n<li>Improved : No limit to showcase products using category grid addon.</li>\n<li>Improved : The functionality of Gutenberg blocks.</li>\n<li>Improved : View pre-built templates in a popup.</li>\n<li>Solved : Latest Product showing issue in Archive default addon.</li>\n<li>Solved : Sample data showing issue in Elementor editor mode.</li>\n<li>Solved : Style rendering issue of the Add to cart button </li>\n<li>Solved : Block Short-code rendering issue in template content.</li>\n<li>Compatibility with the German Market Plugin.</li>\n<li>Compatibility with the latest WooCommerce version.</li>\n</ul>\n<h4>Version: 2.4.4 &#8211; Date: 23-08-2022</h4>\n<ul>\n<li>Improved : Specific page wise blocks register.</li>\n<li>Compatibility with latest WordPress version.</li>\n<li>Compatibility with latest WooCommerce version.</li>\n</ul>\n<h4>Version: 2.4.3 &#8211; Date: 10-08-2022</h4>\n<ul>\n<li>Added : Alignment Option add in Product rating addon.</li>\n<li>Added : Font Size and dimension control option for Add to cart action buttons.</li>\n<li>Added : Product data tab menu area style option in Product data tab addon.</li>\n<li>Added : Margin and Padding option in Product description addon.</li>\n<li>Solved : Unnecessary content showing issue in shopify style checkout  footer for flatsome theme.</li>\n<li>Solved : FOUC Issue in all carousel.</li>\n<li>Compatibility with latest WooCommerce version.</li>\n<li>Compatibility with latest WordPress version.</li>\n</ul>\n<h4>Version: 2.4.2 &#8211; Date: 24-07-2022</h4>\n<ul>\n<li>Tweak : The compatibility of the Variation Swatches module with Astra theme.</li>\n<li>Compatibility with latest WooCommerce version.</li>\n<li>Compatibility with latest WordPress version.</li>\n</ul>\n<h4>Version: 2.4.0 &#8211; Date: 04-07-2022</h4>\n<ul>\n<li>Added : Options to show Phone Number and Company fields in the Shopify Style Checkout module.</li>\n<li>Added : Variation Swatches Module.</li>\n<li>Added : Options to control the Quantity field and 4 layouts for the Add to Cart button.</li>\n<li>Added : Gutenberg blocks for the Shop, Archive, and Product pages.</li>\n<li>Tweak : The compatibility of the Shopify Style Checkout module with WooFunnels&#8217; Order Bump feature.</li>\n<li>Solved : A display issue with the share button when no products are available to compare.</li>\n</ul>\n<h4>Version: 2.3.2 &#8211; Date: 20-06-2022</h4>\n<ul>\n<li>Added : Support to display currency position with space in product filter widgets.</li>\n<li>Added : Style option in wishlist table addon.</li>\n<li>Tweak : Wishlist and Compare menu position change.</li>\n<li>Solved : Shopify style checkout module compatibility with ShopLentor Pro checkout field manager module.</li>\n<li>Solved : Tab labels change issue in Shopify Style Checkout page.</li>\n<li>Solved : Repeater item adding issue in module setting.</li>\n<li>Solved : PHP Warning issue, if ShopLentor Pro is deactivated from FTP / cPanel.</li>\n<li>Solved : Wishlist counter PHP warning.</li>\n<li>Solved : Client say color change issue in WL Testimonial Widget.</li>\n</ul>\n<h4>Version: 2.3.1 &#8211; Date: 04-06-2022</h4>\n<ul>\n<li>Tweak : Elementor Dependency Notice added in Template Builder.</li>\n<li>Solved : Module setting reset problem with switcher element.</li>\n<li>Solved : Shipping Method showing issue in Shopify Style Checkout page.</li>\n</ul>\n<h4>Version: 2.3.0 &#8211; Date: 25-05-2022</h4>\n<ul>\n<li>Added : Module Settings Reset button.</li>\n<li>Compatibility : With Latest WordPress Version.</li>\n</ul>\n<h4>Version: 2.2.9 &#8211; Date: 22-05-2022</h4>\n<ul>\n<li>Improved : Dashboard Elements Panel UI.</li>\n<li>Tweak : jQuery UI library has been removed from template library.</li>\n<li>Tweak : Pending product has been excluded from AJAX search module.</li>\n<li>Solved : Unnecessary Content showing issue in Shopify Style Checkout page.</li>\n<li>Solved :  Wishlist Icon Overlapping issue, if icon position is set Top On Image.</li>\n<li>Solved : iframe dimension issue in Product Video gallery addon.</li>\n<li>Solved : Compatibility with BuddyBoos Theme.</li>\n</ul>\n<h4>Version: 2.2.8 &#8211; Date: 15-05-2022</h4>\n<ul>\n<li>Solved : Product showing issue with product filter addon in category page.</li>\n<li>Solved : Video thumbnails overlapping issue in Video Gallery Addon.</li>\n<li>Compatibility With latest WooCommerce version.</li>\n</ul>\n<h4>Version: 2.2.7 &#8211; Date: 08-05-2022</h4>\n<ul>\n<li>Added : Add to cart button style option in Wishlist table.</li>\n<li>Solved : Wishlist Button icon show server permission issue.</li>\n<li>Solved : Wishlist table heading showing issue in mobile device.</li>\n<li>Solved : Compare Button icon show server permission issue.</li>\n<li>Solved : Compatibility  with FiboSearch plugin.</li>\n<li>Solved : Action Button Line Height issue in Univarsel Layout Addon.</li>\n</ul>\n<h4>Version: 2.2.6 &#8211; Date: 25-04-2022</h4>\n<ul>\n<li>Added : Quantity Field Hide option in WL: Add to cart button.</li>\n<li>Solved : Undefine offset Issue in Gutenberg blocks style.</li>\n<li>Solved : Currency symbol position issue in product filter addon.</li>\n<li>Solved : Compatibility With Lumise Product Designer.</li>\n</ul>\n<h4>Version: 2.2.5 &#8211; Date: 17-04-2022</h4>\n<ul>\n<li>Added : Category Dropdown Field in AJAX search form.</li>\n<li>Solved : Product showing issue with custom pagination.</li>\n<li>Solved : Product right space issue in archive default addon.</li>\n</ul>\n<h4>Version: 2.2.4 &#8211; Date: 05-04-2022</h4>\n<ul>\n<li>Added : Recently Viewed products addon.</li>\n<li>Solved : Product Column set issue in archive custom addon.</li>\n<li>Solved : Wishlist counter fatal error.</li>\n<li>Solved : Horizontal product filter Alignment issue for mobile device.</li>\n<li>Solved : Event showing issue in WL : Product Flash Sale addon.</li>\n<li>Solved : Phone Number validation issue in Shopify style checkout Module.</li>\n<li>Solved : Add to cart button text showing issue in Product Accordion addon.</li>\n<li>Tweak: Removed register_widget_type and widgets_registered deprecated method.</li>\n</ul>\n<h4>Version: 2.2.3 &#8211; Date: 20-03-2022</h4>\n<ul>\n<li>Added : Product SKU addon.</li>\n<li>Added : Product tags addon.</li>\n<li>Added : Product Categories addon.</li>\n<li>Added : Archive Result Count addon.</li>\n<li>Added : Archive Catalog Ordering addon.</li>\n<li>Added : Hide cart and shipping step option in shopify style checkout module.</li>\n<li>Added : Buttons and step label change option in shopify style checkout module.</li>\n<li>Solved : Product limit set option in product tab addon.</li>\n<li>Solved : Product filter wise product showing issue in archive default addon.</li>\n<li>Solved : Ratting showing issue if Inline Font Icons is enable.</li>\n</ul>\n<h4>Version: 2.2.1 &#8211; Date: 07-03-2022</h4>\n<ul>\n<li>Added : Spinner in shopify style checkout page.</li>\n<li>Solved : Warning issue in Archive title addon.</li>\n<li>Solved : Default address field select style issue in shopify style checkout page.</li>\n</ul>\n<h4>Version: 2.2.1 &#8211; Date: 06-03-2022</h4>\n<ul>\n<li>Added : Archive title addon.</li>\n<li>Added : Breadcrumbs addon.</li>\n<li>Solved : Product curvy style issue.</li>\n<li>Solved : Multiple Add to cart button issue in universal layout.</li>\n<li>Solved : Single product style issue for Blocksy and Woostify theme.</li>\n</ul>\n<h4>Version: 2.2.0 &#8211; Date: 20-02-2022</h4>\n<ul>\n<li>Solved : Shopify style checkout page conflict issue with redux  template.</li>\n<li>Solved : Wishlist and compare dashboard menu syntax issue.</li>\n<li>Solved: Template library showing issue.</li>\n<li>Solved : Sale Notification style issue in shopify style checkout page.</li>\n</ul>\n<h4>Version: 2.1.9 &#8211; Date: 12-02-2022</h4>\n<ul>\n<li>Added : Wishlist Counter addon.</li>\n<li>Added : Out of stock badge color option in Universal layout addons.</li>\n<li>Fixed : Checkout page shipping calculate issue in shopify style checkout page.</li>\n<li>Fixed : Extra li element generate issue in shopify style checkout page.</li>\n<li>Fixed: Solved a title styling issue in the default Archive addon for OceanWP theme.</li>\n</ul>\n<h4>Version: 2.1.8 &#8211; Date: 02-02-2022</h4>\n<ul>\n<li>Added : Backorder Module.</li>\n<li>Fixed : Print notices issue in editor mode.</li>\n</ul>\n<h4>Version: 2.1.7 &#8211; Date: 2022-01-24</h4>\n<ul>\n<li>Added : Wishlist and compare module.</li>\n<li>Added : Flash Sale Addon.</li>\n<li>Solved : Shopify style checkout page shipping method empty message issue.</li>\n<li>Solved : Repeater field select2 style issue.</li>\n<li>Solved : Product showing issue in Module popup.</li>\n<li>Solved : Same Height box content area issue.</li>\n</ul>\n<h4>Version: 2.1.6 &#8211; Date: 2022-01-15</h4>\n<ul>\n<li>Improved : Gutenberg Asset load on frontend site.</li>\n<li>Solved : FlashSale Empty deals warning issue.</li>\n<li>Solved : Shopify Style checkout page field override issue.</li>\n<li>Solved : Translate issue in Shopify style checkout page.</li>\n<li>Solved : Shopify checkout page account creation issue.</li>\n<li>Solved : AJAX function deprecation issue.</li>\n<li>Solved : Rating color change issue.</li>\n</ul>\n<h4>Version: 2.1.5 &#8211; Date: 2022-01-03</h4>\n<ul>\n<li>Solved : Gutenberg Blocks Console Error issue.</li>\n</ul>\n"
    },
    "short_description": "Elementor WooCommerce Builder Addons, Quick View, Wishlist, Products Compare, Product Filter, Variation Swatches, Woo builder are functionalities that &hellip;",
    "description": "<p>If you own a WooCommerce website, you&#8217;ll almost certainly want to use these capabilities: Woo Builder (Elementor WooCommerce Builder), WooCommerce Templates, WooCommerce Widgets, Elementor Widgets, product compare or Products Comparison table, WooCommerce order notifications, WooCommerce slider addons (Woo sliders), Woo recently viewed products widget, Sold out count, Elementor Addons, Woocommerce variation swatches module, Elementor Templates, WooCommerce Product Addons, WooCommerce products blocks, WooCommerce Gutenberg Blocks, custom product archive builder, WooCommerce product quick view, out of stock label customization, count sold product, flash sale countdown, Woo wishlist, etc.</p>\n<p>By using ShopLentor &#8211; Elementor WooCommerce Builder, you will get all in one plugin.</p>\n<p>Have you ever searched for a WooCommerce Addons plugin for Elementor Page Builder or WooCommerce template builder for an online store that does not look ordinary like most of the stores out there? ShopLentor is an all-in-one solution that will not only give you complete control over the WooCommerce page designs but also provide you with several features.</p>\n<p>The plugin comes with a powerful WooCommerce page builder for Elementor, allowing you to effortlessly design all WooCommerce pages from scratch using the Elementor page builder. As a result, you no longer have to rely on the default page designs of WooCommerce.</p>\n<p>ShopLentor gives you the flexibility to design a custom Shop and Product details page using the free version of the plugin. The rest of the pages are also customizable with the pro version. Furthermore, ShopLentor &#8211; Elementor WooCommerce builder offers a plethora of Elementor widgets with extensive customization options that you can leverage for creating your store as per your needs.</p>\n<p>Apart from a large number of Elementor WooCommerce widgets, there are plenty of useful functionalities available in the form of modules. For example, product comparison, woo wishlist, quick view, Shopify style checkout, flash sale countdown, and so on. The main purpose of these modules is to offer the users as many options as users would need to enhance their website further. That way, they don&#8217;t have to look for another third-party plugin just for a single feature.</p>\n<p><a href=\"https://woolentor.com/?utm_source=wprepo&amp;utm_medium=freeplugin&amp;utm_campaign=demo\" rel=\"nofollow ugc\">Live Demo</a> | <a href=\"https://woolentor.com/documentation/?utm_source=wprepo&amp;utm_medium=freeplugin&amp;utm_campaign=doc\" rel=\"nofollow ugc\">Documentation</a> | <a href=\"https://woolentor.com/pricing/?utm_source=wprepo&amp;utm_medium=freeplugin&amp;utm_campaign=purchasepro\" rel=\"nofollow ugc\">Purchase Pro</a></p>\n<h3>Elementor WooCommerce Woo Builder Includes</h3>\n<p>🛍️ WooCommerce Elementor Widgets / Elementor WooCommerce Widgets<br />\n🛍️ Single Product Page Builder<br />\n🛍️ Custom Product Template Builder for Individual Product (Pro)<br />\n🛍️ Shop / Archive Page Builder<br />\n🛍️ Individual Archive Page Builder (Pro)<br />\n🛍️ Cart / Checkout / My account / WooCommerce custom thank you page Builder (Pro)</p>\n<p>You can see the plugin demo here 👉 <a href=\"https://woolentor.com/?utm_source=wprepo&amp;utm_medium=freeplugin&amp;utm_campaign=demo\" rel=\"nofollow ugc\">Live Demo</a></p>\n<h3>❤️ Free Features:</h3>\n<ul>\n<li>WooCommerce Template Builder</li>\n<li>Elementor WooCommerce Builder</li>\n<li>WooCommerce Widgets</li>\n<li>Woocommerce Product Grid</li>\n<li>Woocommerce Responsive Grid</li>\n<li>WooCommerce Product List</li>\n<li>WooCommerce Product Sort</li>\n<li>WooCommerce Slider Layout</li>\n<li>Shopify Style Checkout Page / Shopify-like Checkout</li>\n<li>Woocommerce Product Slider Addons / Woo Sliders Widget</li>\n<li>WooCommerce Testimonial Widget</li>\n<li>WooCommerce Featured Product Slider</li>\n<li>WooCommerce Featured Slider</li>\n<li>Promotional Product Slider</li>\n<li>WooCommerce Gutenberg Blocks / Gutenberg WooCommerce blocks</li>\n<li>Recently Viewed Products / Woo Recently Viewed Products Widget</li>\n<li>Woocommerce Product Compare / Products Comparison Table</li>\n<li>Quick View WooCommerce / WooCommerce Quickview</li>\n<li>Woocommerce Product Wishlist / Woo Wishlist</li>\n<li>Woocommerce Product Tab</li>\n<li>Grid and List View WooCommerce</li>\n<li>Action Buttons in different Positions</li>\n<li>Customize WooCommerce Buttons Color</li>\n<li>Sales Countdown WooCommerce Addon / Discount Schedule Counter</li>\n<li>WooCommerce Image Gallery</li>\n<li>Enable / Disable WooCommerce Product Gallery</li>\n<li>WooCommerce Product Gallery Carousel</li>\n<li>Unlimited Color and Font Variations</li>\n<li>WooCommerce Slider or Woo Sliders Control Options</li>\n<li>WooCommerce Variation Swatches Module / Variation Switcher</li>\n<li>Woocommerce Live Sales Notifications (Real)</li>\n<li>Woocommerce Sales Notification (Custom)</li>\n<li>Rename labels / WooCommerce Text / WooCommerce add custom text.</li>\n<li>WooCommerce Upsell Widget</li>\n<li>WooCommerce Cross-sell Widget</li>\n<li>WooCommerce Related Products Widget (Custom Related Products Layout, Disable / Remove / Hide Related Products)</li>\n<li>WooCommerce Category Carousel / WooCommerce Category Showcase / WooCommerce Product Category Slider</li>\n<li>WooCommerce Category and Product List</li>\n<li>Call for Price Button for WooCommerce</li>\n<li>Suggest Price / Suggest Product Price</li>\n<li>Special Day Offer Banner / Banner Widget</li>\n<li>Product QR Code / WooCommerce QR Widget</li>\n<li>WooCommerce Marker / WooCommerce Hotspot</li>\n<li>Archive page with Pagination</li>\n<li>Product Share Widget</li>\n<li>Multi-language Support</li>\n<li>Works with Free Elementor and WooCommerce</li>\n<li>Custom WooCommerce Product Template Builder</li>\n<li>Product Grid (Curvy)</li>\n<li>Product Accordion Listing / Responsive Accordion</li>\n<li>Product Image Accordion / WooCommerce Accordion</li>\n<li>WooCommerce Shop Page Builder</li>\n<li>AJAX Search Widget</li>\n<li>WordPress post or WooCommerce Product Duplicator</li>\n<li>Single product AJAX Add to Cart (In Product Detail Page)</li>\n<li>Horizontal WooCommerce Product Filter <a href=\"https://woolentor.com/demo/horizontal-filter/\" rel=\"nofollow ugc\">Demo</a></li>\n<li>Vertical WooCommerce Product Filter <a href=\"https://woolentor.com/demo/filter-vertical/\" rel=\"nofollow ugc\">Demo</a></li>\n<li>WooCommerce Template Library (Basic)</li>\n<li>Product Reviews widget for WooCommerce</li>\n</ul>\n<h3>🔥 Premium Features:</h3>\n<p>✅ 125+ WooCommerce Elementor Widgets / Elementor WooCommerce Widgets<br />\n✅ 26 WooCommerce Modules<br />\n✅ 62 WordPress Gutenberg Blocks / WoCommerce Gutenberg Blocks<br />\n✅ Custom WooCommerce Product Template Builder for Individual Product<br />\n✅ Individual Archive Page Builder / WooCommerce Template Builder<br />\n✅ WooCommerce Checkout Field Editor / Checkout Field Manager<br />\n✅ Custom Cart Page Builder / WooCommerce Template Builder<br />\n✅ Custom Checkout Page Builder / WooCommerce Template Builder<br />\n✅ Custom My Account Page Builder / WooCommerce Template Builder<br />\n✅ Custom Thank you Page for WooCommerce<br />\n✅ WooCommerce Partial Payment<br />\n✅ WooCommerce Multi step checkout<br />\n✅ Order Confirmations Widget<br />\n✅ Product Variation Swatches for WooCommerce<br />\n✅ Product Size Chart / Size Chart WooCommerce Module<br />\n✅ WooCommerce Progress Bar / WooCommerce Stock Progress<br />\n✅ Related Products Slider for WooCommerce<br />\n✅ WooCommerce Upsell Products / Upsells Carousel<br />\n✅ WooCommerce Pre Order Module / Pre-order for WooCommerce<br />\n✅ Side Mini Cart / WooCommerce Minicart / Cart Drawer<br />\n✅ Redirect to Checkout Page (Direct Checkout)<br />\n✅ Social Share Product / Social Share Buttons / Quick Share<br />\n✅ GTM Conversion Tracking (Google Tag Manager) with Data layer<br />\n✅ Sticky Add to Cart<br />\n✅ Template Library<br />\n✅ 15 Product Custom Template Layouts (Deafult + Invidual)<br />\n✅ WooCommerce Template Builder (Advanced)<br />\n✅ Access to our Premium Udemy Course for WooCommerce (On Request)<br />\n✅ Zoom / Skype / TeamViewer Support<br />\n✅ Free Store Setup / (Maximum 2)<br />\n✅ Phone Call Support<br />\n✅ Premium Support</p>\n<p><strong><a href=\"https://woolentor.com/doc/build-a-custom-checkout-page-template/\" rel=\"nofollow ugc\">WooCommerce Checkout Page Customization and Field Editor (Pro)</a></strong><br />\nShopLentor Pro (Elementor WooCommerce Builder) allows you to customize the checkout page to reduce the bounce rate and increase the conversion rate. Sometimes, a custom checkout page is necessary for an eCommerce store or online storefront. ShopLentor Pro (Elementor WooCommerce Builder) makes it easy by providing several WooCommerce custom checkout options.</p>\n<p>Besides creating a custom checkout page, ShopLentor allows removing or editing existing checkout page fields (billing and shopping fields). You can also add custom checkout page field like WooCommerce phone field or WooCommerce checkout phone.</p>\n<p>By creating a custom Elementor WooCommerce Checkout page template according to your needs, you can get rid of the default Checkout page layout of WooCommerce. To help you achieve this, ShopLentor – Elementor WooCommerce Addon offers loads of Elementor WooCommerce builder widgets (Woo builder) specifically designed to create a custom Elementor WooCommerce Checkout page design.</p>\n<p>If you want to improve customer experience through the checkout page of your store, you can utilize these WP WooCommerce checkout widgets or Elementor WooCommerce checkout widgets that enable you to do things like WooCommerce checkout customization, customize WooCommerce checkout page, customize checkout WooCommerce, Elementor WooCommerce checkout customization, etc.</p>\n<p>Furthermore, the plugin comes with several beautifully designed pre-built Elementor WooCommerce checkout templates or WooCommerce templates for checkout that will allow you to create a custom checkout page within a minute.</p>\n<p><strong><a href=\"https://hasthemes.com/how-to-build-a-custom-product-template-using-woolentor-plugin/\" rel=\"nofollow ugc\">Customize WooCommerce Single Product Template</a></strong><br />\nShopLentor (Elementor WooCommerce Builder) allows you to create a custom single product template. With all the powerful WooCommerce product addons or Woo addons available in ShopLentor, creating a unique design for your WooCommerce product page is a breeze.</p>\n<p>The free version has the option to create a common product page template layout throughout the entire store, and the pro version allows you to create different WooCommerce single templates for various WooCommerce single product pages individually.</p>\n<p>With all the WooCommerce extra product addons or Elementor WooCommerce widgets offered by ShopLentor (Elementor WooCommerce Builder), you can easily manage the WooCommerce single product page or WooCommerce single templates. In addition, these WooCommerce extra product addons, or WooCommerce product addons, are compatible with other popular Elementor WooCommerce plugins.</p>\n<p>ShopLentor (Elementor WooCommerce Builder) lets you assign a separate Elementor template for each of your WooCommerce products from the WooCommerce product settings. For example, in the product setting WooCommerce screen, you will find a dropdown option where you can choose a custom template for the details page of that specific WooCommerce product.</p>\n<h3>⭐ Available Widgets:</h3>\n<p><strong>General Widgets</strong></p>\n<p><strong><a href=\"https://woolentor.com/demo/product-tabs\" rel=\"nofollow ugc\">Product Tabs</a></strong> – Display your WooCommerce products in a tabbed format based on different categories. With the help of this Elementor WooCommerce product tabs widget, WooCommerce category tabs widget, or Woo product tabs widget you can dynamically list your WooCommerce products category wise in various WooCommerce category tabs. It even allows you to choose which WooCommerce product categories you want to display as tabs.</p>\n<p>Furthermore, you can filter what type of WooCommerce products to showcase under a single WooCommerce product category or multiple WooCommerce product categories. For example, WooCommerce category recent products.</p>\n<p>Since the Elementor WooCommerce widget for product tabs (woo product tabs) allows you to display recent products while at the same time supporting category based products, you can effortlessly showcase your newest WooCommerce products or WooCommerce recent products in your online storefront. In addition, WooCommerce category recent products can be handy to show products for specific categories or all WooCommerce categories.</p>\n<p>You can even control the number of products that are displayed. So, whether you&#8217;re launching a new product line or simply want to keep your customers informed about your latest WooCommerce products or WooCommerce recent products, WooCommerce category recent products is a great way to do it.</p>\n<p>Other noteworthy features of this Elementor WooCommerce widget include controlling the WooCommerce product layout, the number of WooCommerce products to show, the WooCommerce category list, the customization of WooCommerce product ordering, etc.</p>\n<p><strong><a href=\"https://woolentor.com/demo/product-grid\" rel=\"nofollow ugc\">Product Grid</a></strong> – Display your WooCommerce products within a WooCommerce responsive grid layout with the WooCommerce product grid widget. This Elementor WooCommerce builder widget (Woo builder) offers 5 different WooCommerce grid layouts to showcase your WooCommerce products in a responsive grid for WooCommerce store with its WooCommerce widget responsive settings. Meaning the WooCommerce product grid widget will adjust to fit any screen size.</p>\n<p>A key feature of this Elementor WooCommerce widget is its WooCommerce responsive grid, which displays your WooCommerce products in a WooCommerce grid layout or responsive grid for WooCommerce while ensuring that your WooCommerce website adapts to the screen size of the customer&#8217;s device. You can rest assured that with the WooCommerce responsive grid system, your WooCommerce products are always displayed in an optimal way, regardless of what device your customers use. The WooCommerce responsive grid or responsive grid for WooCommerce is a significant selling point for WooCommerce, as it helps businesses reach a wider audience. You can even use this WooCommerce widget to control how many columns you want to display on each device.</p>\n<p>By using a responsive grid for WooCommerce, you can ensure that your customers will be able to see your WooCommerce products no matter what device they&#8217;re using. The WooCommerce product grid or Elementor grid widget can be of tremendous help if you want to showcase your WooCommerce products in a WooCommerce grid layout or responsive grid for WooCommerce. With this Elementor WooCommerce widget, you can enjoy the flexibility to exhibit your WooCommerce products in a grid view or WooCommerce grid layout.</p>\n<p>Furthermore, the Elementor grid widget allows you to control the number of columns, gutter width, and breakpoints. A grid view is a type of WooCommerce product display that arranges items in a WooCommerce grid layout or a responsive grid for WooCommerce instead of displaying them in a single column. The grid view products or grid products make it easy for visitors to scroll through the WooCommerce products and find their desired ones.</p>\n<p>Apart from choosing and configuring a WooCommerce product layout, you can control which WooCommerce products to display and how to display them in a WooCommerce product grid or WooCommerce grid layout based on multiple query settings such as product type, product categories, product order, number of products, and so on. Meaning that you can also leverage this Elementor WooCommerce product grid widget like a WooCommerce category product widget to display products based on categories. This WooCommerce category product widget is handy when it comes to getting the ability to control which category based products to display.</p>\n<p>Since the Elementor WooCommerce widget enables store owners to display their WooCommerce products in a responsive grid for WooCommerce stores, rest assured that the WooCommerce products will look great no matter which device visitors use to browse the store. If you prefer using the WooCommerce grid, WooCommerce grid layout, or WooCommerce responsive grid, this WooCommerce product grid widget will be tremendously helpful.</p>\n<p>ShopLentor&#8217;s product grid widget lets you showcase WooCommerce products in a WooCommerce grid layout. WooCommerce product grids are commonly used to display WooCommerce products on your online storefront. With this WooCommerce product grid widget or display product widget you can present your WooCommerce products on the WooCommerce shop and archive pages.</p>\n<p>Aside from displaying WooCommerce products in a responsive grid for WooCommerce, this product grid widget offers a wide range of customization options so that you can control many aspects of this widget, such as the number of columns, the number of WooCommerce products, WooCommerce product order, and so on. If you want your WooCommerce product display to be visually appealing, so it captures potential customers&#8217; attention, you should try out the WooCommerce product grid widget. This WooCommerce product grid widget is perfect for an online storefront that wants to display their WooCommerce products in a more organized and visually appealing way.</p>\n<p>In this Elementor WooCommerce widget, there are a few different WooCommerce product layout or product layouts for WooCommerce options available for store owners to choose from. Some of the most popular WooCommerce product layouts or product layouts for WooCommerce include the grid layout, the list layout, and the carousel layout.</p>\n<p>Each WooCommerce product layout has its own advantages and disadvantages, so it&#8217;s important to choose the right WooCommerce product layout for your online store based on your WooCommerce products and your customer&#8217;s needs.</p>\n<p>A WooCommerce product slider or Woo slider is a great way to showcase your WooCommerce products on your website. With a WooCommerce product slider or Woo slider, you can easily display your WooCommerce products in a stylish and eye-catching way. In addition, customers can scroll through your WooCommerce products in a WooCommerce product slider or Woo slider.</p>\n<p>Furthermore, the Woo slider is easy to use and comes with many customization options. That means you can control the WooCommerce slider or eCommerce slider and configure the WooCommerce widget product slider as per your needs. If you&#8217;re looking for a way to improve the look and feel of your online storefront and make it more user-friendly, then a WooCommerce product  &hellip;</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/woolentor-addons.2.9.6.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-1.jpg?rev=3011160",
            "caption": "Custom Product Page Builder"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-2.jpg?rev=3011160",
            "caption": "Custom Cart Page Builder"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-3.jpg?rev=3011160",
            "caption": "Custom Checkout Page Builder"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-4.jpg?rev=3011160",
            "caption": "Checkout Page Field Editor"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-5.jpg?rev=3011160",
            "caption": "Custom My Account Page"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-6.jpg?rev=3011160",
            "caption": "Woo Wishlist"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-7.jpg?rev=3011160",
            "caption": "Product Compare Table"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-8.jpg?rev=3011160",
            "caption": "Product Quick View"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-9.jpg?rev=3011160",
            "caption": "Horizontal Product Filter"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-10.jpg?rev=3011160",
            "caption": "Vertical Product Filter"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-11.jpg?rev=3011160",
            "caption": "Sales Notification"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-12.jpg?rev=3011160",
            "caption": "Universal Product Layout"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-13.jpg?rev=3011160",
            "caption": "Product Slider - Style 1"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-14.jpg?rev=3011160",
            "caption": "Product Slider - Style 2"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-15.jpg?rev=3011160",
            "caption": "Product Slider - Style 3"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-16.jpg?rev=3011160",
            "caption": "Product Tab - Style 1"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-17.jpg?rev=3011160",
            "caption": "Product Tab - Style 2"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-18.jpg?rev=3011160",
            "caption": "Product Tab - Style 3"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-19.jpg?rev=3011160",
            "caption": "Template Library"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-20.jpg?rev=3011160",
            "caption": "Widgets Control Panel"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-21.jpg?rev=3011160",
            "caption": "WC Template Settings"
        },
        {
            "src": "https://ps.w.org/woolentor-addons/assets/screenshot-22.jpg?rev=3011160",
            "caption": "Module Settings"
        }
    ],
    "tags": {
        "elementor": "elementor",
        "woocommerce": "woocommerce",
        "woocommerce-builder": "WooCommerce Builder",
        "woocommerce-elementor": "woocommerce elementor",
        "woocommerce-product": "WooCommerce product"
    },
    "stable_tag": "2.9.6",
    "versions": {
        "1.5.0": "https://downloads.wordpress.org/plugin/woolentor-addons.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/woolentor-addons.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/woolentor-addons.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/woolentor-addons.1.5.3.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/woolentor-addons.1.5.4.zip",
        "1.5.6": "https://downloads.wordpress.org/plugin/woolentor-addons.1.5.6.zip",
        "1.5.7": "https://downloads.wordpress.org/plugin/woolentor-addons.1.5.7.zip",
        "1.5.8": "https://downloads.wordpress.org/plugin/woolentor-addons.1.5.8.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/woolentor-addons.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/woolentor-addons.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/woolentor-addons.1.6.3.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/woolentor-addons.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/woolentor-addons.1.6.5.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/woolentor-addons.1.6.6.zip",
        "1.6.7": "https://downloads.wordpress.org/plugin/woolentor-addons.1.6.7.zip",
        "1.6.8": "https://downloads.wordpress.org/plugin/woolentor-addons.1.6.8.zip",
        "1.6.9": "https://downloads.wordpress.org/plugin/woolentor-addons.1.6.9.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/woolentor-addons.1.7.0.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/woolentor-addons.1.7.2.zip",
        "1.7.3": "https://downloads.wordpress.org/plugin/woolentor-addons.1.7.3.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/woolentor-addons.1.7.4.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/woolentor-addons.1.7.5.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/woolentor-addons.1.7.6.zip",
        "1.7.7": "https://downloads.wordpress.org/plugin/woolentor-addons.1.7.7.zip",
        "1.7.8": "https://downloads.wordpress.org/plugin/woolentor-addons.1.7.8.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/woolentor-addons.1.8.0.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/woolentor-addons.1.8.1.zip",
        "1.8.2": "https://downloads.wordpress.org/plugin/woolentor-addons.1.8.2.zip",
        "1.8.3": "https://downloads.wordpress.org/plugin/woolentor-addons.1.8.3.zip",
        "1.8.4": "https://downloads.wordpress.org/plugin/woolentor-addons.1.8.4.zip",
        "1.8.5": "https://downloads.wordpress.org/plugin/woolentor-addons.1.8.5.zip",
        "1.8.6": "https://downloads.wordpress.org/plugin/woolentor-addons.1.8.6.zip",
        "1.8.7": "https://downloads.wordpress.org/plugin/woolentor-addons.1.8.7.zip",
        "1.8.8": "https://downloads.wordpress.org/plugin/woolentor-addons.1.8.8.zip",
        "1.8.9": "https://downloads.wordpress.org/plugin/woolentor-addons.1.8.9.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/woolentor-addons.1.9.0.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/woolentor-addons.1.9.1.zip",
        "1.9.2": "https://downloads.wordpress.org/plugin/woolentor-addons.1.9.2.zip",
        "1.9.3": "https://downloads.wordpress.org/plugin/woolentor-addons.1.9.3.zip",
        "1.9.5": "https://downloads.wordpress.org/plugin/woolentor-addons.1.9.5.zip",
        "1.9.6": "https://downloads.wordpress.org/plugin/woolentor-addons.1.9.6.zip",
        "1.9.7": "https://downloads.wordpress.org/plugin/woolentor-addons.1.9.7.zip",
        "1.9.8": "https://downloads.wordpress.org/plugin/woolentor-addons.1.9.8.zip",
        "1.9.9": "https://downloads.wordpress.org/plugin/woolentor-addons.1.9.9.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/woolentor-addons.2.0.0.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/woolentor-addons.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/woolentor-addons.2.1.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/woolentor-addons.2.1.2.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/woolentor-addons.2.1.3.zip",
        "2.1.5": "https://downloads.wordpress.org/plugin/woolentor-addons.2.1.5.zip",
        "2.1.6": "https://downloads.wordpress.org/plugin/woolentor-addons.2.1.6.zip",
        "2.1.7": "https://downloads.wordpress.org/plugin/woolentor-addons.2.1.7.zip",
        "2.1.8": "https://downloads.wordpress.org/plugin/woolentor-addons.2.1.8.zip",
        "2.1.9": "https://downloads.wordpress.org/plugin/woolentor-addons.2.1.9.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/woolentor-addons.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/woolentor-addons.2.2.1.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/woolentor-addons.2.2.2.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/woolentor-addons.2.2.3.zip",
        "2.2.4": "https://downloads.wordpress.org/plugin/woolentor-addons.2.2.4.zip",
        "2.2.5": "https://downloads.wordpress.org/plugin/woolentor-addons.2.2.5.zip",
        "2.2.6": "https://downloads.wordpress.org/plugin/woolentor-addons.2.2.6.zip",
        "2.2.7": "https://downloads.wordpress.org/plugin/woolentor-addons.2.2.7.zip",
        "2.2.8": "https://downloads.wordpress.org/plugin/woolentor-addons.2.2.8.zip",
        "2.2.9": "https://downloads.wordpress.org/plugin/woolentor-addons.2.2.9.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/woolentor-addons.2.3.0.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/woolentor-addons.2.3.1.zip",
        "2.3.2": "https://downloads.wordpress.org/plugin/woolentor-addons.2.3.2.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/woolentor-addons.2.4.1.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/woolentor-addons.2.4.2.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/woolentor-addons.2.4.3.zip",
        "2.4.4": "https://downloads.wordpress.org/plugin/woolentor-addons.2.4.4.zip",
        "2.4.5": "https://downloads.wordpress.org/plugin/woolentor-addons.2.4.5.zip",
        "2.4.6": "https://downloads.wordpress.org/plugin/woolentor-addons.2.4.6.zip",
        "2.4.7": "https://downloads.wordpress.org/plugin/woolentor-addons.2.4.7.zip",
        "2.4.8": "https://downloads.wordpress.org/plugin/woolentor-addons.2.4.8.zip",
        "2.4.9": "https://downloads.wordpress.org/plugin/woolentor-addons.2.4.9.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/woolentor-addons.2.5.0.zip",
        "2.5.1": "https://downloads.wordpress.org/plugin/woolentor-addons.2.5.1.zip",
        "2.5.2": "https://downloads.wordpress.org/plugin/woolentor-addons.2.5.2.zip",
        "2.5.3": "https://downloads.wordpress.org/plugin/woolentor-addons.2.5.3.zip",
        "2.5.4": "https://downloads.wordpress.org/plugin/woolentor-addons.2.5.4.zip",
        "2.5.5": "https://downloads.wordpress.org/plugin/woolentor-addons.2.5.5.zip",
        "2.5.6": "https://downloads.wordpress.org/plugin/woolentor-addons.2.5.6.zip",
        "2.5.7": "https://downloads.wordpress.org/plugin/woolentor-addons.2.5.7.zip",
        "2.5.8": "https://downloads.wordpress.org/plugin/woolentor-addons.2.5.8.zip",
        "2.5.9": "https://downloads.wordpress.org/plugin/woolentor-addons.2.5.9.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/woolentor-addons.2.6.0.zip",
        "2.6.1": "https://downloads.wordpress.org/plugin/woolentor-addons.2.6.1.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/woolentor-addons.2.6.2.zip",
        "2.6.3": "https://downloads.wordpress.org/plugin/woolentor-addons.2.6.3.zip",
        "2.6.4": "https://downloads.wordpress.org/plugin/woolentor-addons.2.6.4.zip",
        "2.6.5": "https://downloads.wordpress.org/plugin/woolentor-addons.2.6.5.zip",
        "2.6.6": "https://downloads.wordpress.org/plugin/woolentor-addons.2.6.6.zip",
        "2.6.7": "https://downloads.wordpress.org/plugin/woolentor-addons.2.6.7.zip",
        "2.6.8": "https://downloads.wordpress.org/plugin/woolentor-addons.2.6.8.zip",
        "2.6.9": "https://downloads.wordpress.org/plugin/woolentor-addons.2.6.9.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/woolentor-addons.2.7.0.zip",
        "2.7.1": "https://downloads.wordpress.org/plugin/woolentor-addons.2.7.1.zip",
        "2.7.2": "https://downloads.wordpress.org/plugin/woolentor-addons.2.7.2.zip",
        "2.7.3": "https://downloads.wordpress.org/plugin/woolentor-addons.2.7.3.zip",
        "2.7.4": "https://downloads.wordpress.org/plugin/woolentor-addons.2.7.4.zip",
        "2.7.5": "https://downloads.wordpress.org/plugin/woolentor-addons.2.7.5.zip",
        "2.7.6": "https://downloads.wordpress.org/plugin/woolentor-addons.2.7.6.zip",
        "2.7.7": "https://downloads.wordpress.org/plugin/woolentor-addons.2.7.7.zip",
        "2.7.8": "https://downloads.wordpress.org/plugin/woolentor-addons.2.7.8.zip",
        "2.7.9": "https://downloads.wordpress.org/plugin/woolentor-addons.2.7.9.zip",
        "2.8.0": "https://downloads.wordpress.org/plugin/woolentor-addons.2.8.0.zip",
        "2.8.1": "https://downloads.wordpress.org/plugin/woolentor-addons.2.8.1.zip",
        "2.8.2": "https://downloads.wordpress.org/plugin/woolentor-addons.2.8.2.zip",
        "2.8.3": "https://downloads.wordpress.org/plugin/woolentor-addons.2.8.3.zip",
        "2.8.4": "https://downloads.wordpress.org/plugin/woolentor-addons.2.8.4.zip",
        "2.8.5": "https://downloads.wordpress.org/plugin/woolentor-addons.2.8.5.zip",
        "2.8.6": "https://downloads.wordpress.org/plugin/woolentor-addons.2.8.6.zip",
        "2.8.7": "https://downloads.wordpress.org/plugin/woolentor-addons.2.8.7.zip",
        "2.8.8": "https://downloads.wordpress.org/plugin/woolentor-addons.2.8.8.zip",
        "2.8.9": "https://downloads.wordpress.org/plugin/woolentor-addons.2.8.9.zip",
        "2.9.0": "https://downloads.wordpress.org/plugin/woolentor-addons.2.9.0.zip",
        "2.9.1": "https://downloads.wordpress.org/plugin/woolentor-addons.2.9.1.zip",
        "2.9.2": "https://downloads.wordpress.org/plugin/woolentor-addons.2.9.2.zip",
        "2.9.3": "https://downloads.wordpress.org/plugin/woolentor-addons.2.9.3.zip",
        "2.9.4": "https://downloads.wordpress.org/plugin/woolentor-addons.2.9.4.zip",
        "2.9.5": "https://downloads.wordpress.org/plugin/woolentor-addons.2.9.5.zip",
        "2.9.6": "https://downloads.wordpress.org/plugin/woolentor-addons.2.9.6.zip",
        "trunk": "https://downloads.wordpress.org/plugin/woolentor-addons.zip"
    },
    "business_model": "commercial",
    "repository_url": "",
    "commercial_support_url": "https://woolentor.com/contact/",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/woolentor-addons/assets/banner-772x250.jpg?rev=3011160",
        "high": "https://ps.w.org/woolentor-addons/assets/banner-1544x500.jpg?rev=3011160"
    },
    "icons": {
        "1x": "https://ps.w.org/woolentor-addons/assets/icon-128x128.png?rev=3011160",
        "2x": "https://ps.w.org/woolentor-addons/assets/icon-256x256.png?rev=3011160"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 88,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "woolentor-addons",
            "language": "en_AU",
            "version": "2.9.5",
            "updated": "2023-04-18 03:53:20",
            "package": "https://downloads.wordpress.org/translation/plugin/woolentor-addons/2.9.5/en_AU.zip"
        },
        {
            "type": "plugin",
            "slug": "woolentor-addons",
            "language": "nl_NL_formal",
            "version": "2.9.5",
            "updated": "2024-08-15 18:36:00",
            "package": "https://downloads.wordpress.org/translation/plugin/woolentor-addons/2.9.5/nl_NL_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "woolentor-addons",
            "language": "nl_NL",
            "version": "2.9.5",
            "updated": "2024-08-12 16:18:57",
            "package": "https://downloads.wordpress.org/translation/plugin/woolentor-addons/2.9.5/nl_NL.zip"
        }
    ]
}