{
    "name": "ChatBot for Woocommerce &#8211; WoowBot",
    "slug": "woowbot-woocommerce-chatbot",
    "version": "3.7.6",
    "author": "<a href=\"https://woowbot.pro/\">ChatBot - WoowBot</a>",
    "author_profile": "https://profiles.wordpress.org/quantumcloud/",
    "contributors": {
        "quantumcloud": {
            "profile": "https://profiles.wordpress.org/quantumcloud/",
            "avatar": "https://secure.gravatar.com/avatar/97d6007ecaef11f5d151452d87e5c479?s=96&d=monsterid&r=g",
            "display_name": "QuantumCloud"
        }
    },
    "requires": "4.9",
    "tested": "6.6.2",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 96,
    "ratings": {
        "5": 18,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 19,
    "support_url": "https://wordpress.org/support/plugin/woowbot-woocommerce-chatbot/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 900,
    "last_updated": "2024-09-24 08:03:00",
    "added": "2017-07-12",
    "homepage": "https://wordpress.org/plugins/woowbot-woocommerce-chatbot/",
    "sections": {
        "description": "<h4>What is ChatBot for WooCommerce &#8211; WoowBot?</h4>\n<p><strong>ChatBot for WooCommerce</strong> &#8211; WoowBot is a SIMPLE&gt; and <strong>Native</strong> WordPress eCommerce ChatBot with zero configuration or bot training required. This plug n&#8217; play chatbot or conversational, eCommerce shopbot does not require any 3rd party service integration. Use this eCommerce ChatBot for automated customer service.</p>\n<p>This is a <strong>simple eCommerce ChatBot</strong> that lets your woocommerce shoppers search and find the right product quickly. If the shopper does not find the product they are searching for, they can email the shop admin directly from the ChatBot window. Use ChatBot for increasing sales in eCommerce websites.</p>\n<blockquote>\n<p>🚀 <a href=\"https://woowbot.pro/free-support/\" rel=\"nofollow ugc\">Support, Bug Report, Feature Requests</a> | <strong> for Advanced AI Features Upgrade to <a href=\"https://woowbot.pro/\" rel=\"nofollow ugc\">ChatBot for WooCommerce &#8211; WoowBot Pro</a> Now!</strong> | <a href=\"https://woowbot.pro/\" rel=\"nofollow ugc\">Pro Version Demo with OpenAI and other Advanced Features</a></p>\n</blockquote>\n<p>This shopping bot helps shoppers find the products they are looking for easily and increase store sales through conversational chatbot experience and increases your customer conversion rates!</p>\n<p>You can make this plug n’ play ChatBot to work with <strong>any language</strong> with very little effort. Just change the languages from the ChatBot Dashboard. Grab the best ChatBot for eCommerce websites now!</p>\n<p><strong>A pro version </strong>of the ChatBot plugin is available with tons of advanced features that can provide automated customer support and can be integrated with <strong>OpenAI (ChatGPT)</strong> or <strong>Google&#8217;s Dialogflow </strong>. Use AI ChatBot for product recommendations in eCommerce and provide automated customer support.</p>\n<blockquote>\n<p>🚀  Don&#8217;t have WooCommerce and Looking for a ChatBot plugin for WordPress? Try our <a href=\"https://wordpress.org/plugins/chatbot/\" rel=\"ugc\">ChatBot for WordPress</a> WPBot plugin!</p>\n</blockquote>\n<h4>Next Generation Conversational Commerce for WooCommerce</h4>\n<p>Conversational commerce is the future of eCommerce. Enter WoowBot: a new way of customer interaction that allows brands to connect with their customers on a personal level with shopbots while creating a more natural interaction that mimics the physical world. 24/7/365, the WoowBot ChatBot can provide live chat support to your shoppers and provide product search services, order status (pro feature) or support(pro feature). Increase customer satisfaction, reduce costs to scale and improve ability to engage customers.</p>\n<h4>What Can this ChatBot do?</h4>\n<p>WooWBot is the first of its kind chatbot <strong>WooCommerce</strong>.</p>\n<p>With the ChatBot Pro version, shoppers can converse fluidly with the Bot – thanks to the Integration with <strong>OpenAi (ChatGPT)</strong> or Google‘s Artificial Intelligence and Natural Language Processing (AI and NLP) from Dialogflow, Search and Add products to the cart directly from the chat interface and get Support.</p>\n<h4>WoowBot ChatBot Free vs Pro Version</h4>\n<p>WoowBot free version is a great Chat Bot tool for a small online store that does not require the advanced features of the pro version bot. The free version features list:</p>\n<ul>\n<li>One template</li>\n<li>Chat and search for products</li>\n<li>Search using WooCommerce standard search function that uses title and description</li>\n<li>Display products found and link to the product page</li>\n<li>Adjust location of the button</li>\n<li>Upload Custom Chat Icon</li>\n<li>Language center to modify bot responses (in any language)</li>\n<li>Custom CSS box</li>\n<li>MO/Port included for translation of multi language in back end</li>\n</ul>\n<h4>WoowBot Pro Feature Highlights</h4>\n<p><strong>Artificial Intelligence and NLP </strong></p>\n<p>WoowBot Pro is an Intelligent ChatBot &#8211; Powered by AI. Integrate with <strong>OpenAI (ChatGPT)</strong> or <strong>Google’s DialogFlow</strong>.</p>\n<p><strong>OpenAI (ChatGPT) for ChatBot WoowBot Pro</strong></p>\n<p><strong>OpenAI ChatGPT</strong> latest models are supported. OpenAI’s API provides access to ChatGPT for a wide variety of natural language tasks. You can limit OpenAI responses based on keywords inclusion or exclusion to reduce token cost. The premium version also supports ChatGPT fine tuning and GPT Assistants. The GPT Assistants API allows you to build AI assistants within your own applications. A GPT Assistant has instructions and can leverage models, tools, and knowledge to respond to user queries. With WoowBot Professional and Master licenses use the Assistants you develop on the OpenAI playground trained with your own website data and/or upload your own PDF documents to answer from.</p>\n<p><strong>Onsite Retargeting, Exit Intent</strong></p>\n<p>Recover up to 25% of Abandoning Visitors with Onsite Retargeting. WoowBot detects exiting Visitors and displays a targeted offer to your visitor determined by you. Up to 25% of retargeted visitors will respond to your message and turn into customers. Targeted offers can be a coupon code, free ebook etc.<br />\nIn-Chat Support and Contact</p>\n<p>The Onsite Retargeting helps your Conversion rate optimization by showing special offers and coupons on Exit Intent, time interval or page scroll-down inside the ChatBot window. Track Customer Conversions with statistics to find out if shoppers are abandoning carts without completing orders. Get more sales!</p>\n<p><strong>Reduce Shopping Cart Abandonment</strong><br />\nIn addition to exit intent and remarketing offers, WoowBot can remind users to complete the checkout process when shoppers have products in the cart but they are not completing the order for some reason. Many shoppers add products to the cart but leave the site from other pages, after continuing to browse, before or after they reached the cart page.</p>\n<p>If a user leaves the site and later comes back – WoowBot will remind the shopper with a custom message to complete the order!</p>\n<p>All of these will translate into a much higher rate of customer conversion by reducing the potentials for Abandoned Cart.</p>\n<p><strong>In-Chat Support and Contact</strong></p>\n<p>WoowBot pro provides support directly from the Chat window. You can add commonly asked questions (FAQ) and answers in the backend that WoowBot will display when user goes to support area. If the shopper does not find answers to his question in the FAQ, he can opt to send a email to site admin or leave feedback!</p>\n<p><strong>Schedule the ChatBot to Work with other Live Chat Service</strong></p>\n<p>You can schedule WoowBot Pro to run only when you are not available for Live chat with other services – outside of your normal office hours. The Onsite Retargeting helps your Conversion rate optimization by showing your special offers and coupons on Exit Intent, time interval or page scroll down inside the chatbot window. Get rid of those other Exit Intent popups with a chatbot that talks directly with the shopper. Reduce Abandoned Cart by showing timely messages with the Chat Bot!</p>\n<p>Here is a list of the WoowBot pro version feature highlights:</p>\n<h4>WoowBot Pro Plugin Feature Highlights</h4>\n<p><strong>WooCommerce Specific Features</strong></p>\n<ul>\n<li>Woocommerce <strong>Product</strong> Search in Chat window</li>\n<li>Product display order by and sorting options</li>\n<li>Option to Show Only <strong>Parent</strong> Categories with or without Sub Category list.</li>\n<li>Option to display <strong>order status</strong> with or without logging in</li>\n<li>Show or hide <strong>cart</strong> item number with ChatBot icon</li>\n<li>Option to <strong>exclude out of stock products</strong> from search results</li>\n<li>Option to Enable/Disable Product <strong>Search</strong>, <strong>Featured</strong> Products, on <strong>Sale</strong> Products, <strong>Order</strong> <strong>Status</strong> buttons at start menu</li>\n<li>Show <strong>recently viewed</strong> products for easy reference to the shopper</li>\n<li>Show <strong>featured products</strong> until shopper has viewed other products</li>\n<li><strong>Quick Cart</strong> view</li>\n<li>Display <strong>product details in-chat</strong> – complete with images, add to cart option and support for multiple images</li>\n<li>Option to open product details in single page instead of Bot window</li>\n<li>Onsite R<strong>etargeting</strong> and R<strong>emarketing</strong> to increase customer conversion rate and increase sales!</li>\n<li>Show R<strong>etargeting</strong> messages for customer on <strong>Exit Intent</strong>, After <strong>Scrolling</strong> Down on page “X” Percent, Or after <strong>“X” seconds</strong>.</li>\n<li>Show R<strong>etargeting</strong> message for customers to <strong>complete</strong> the <strong>checkout</strong> if idle for a set time</li>\n<li>Customer <strong>Conversion Reporting</strong> with Charts and Graphs</li>\n<li>Shopper <strong>Conversion Statistics</strong> by Day, Week, Month and Custom Date Range</li>\n</ul>\n<p><strong>Interactions</strong></p>\n<ul>\n<li>Create simple <strong>text responses</strong> easily from your WordPress backend.</li>\n<li>Create <strong>FAQ area</strong> with multiple questions and answers with Categories (supports html)</li>\n<li>Send <strong>eMail</strong>, <strong>Call Me Back</strong> &amp; <strong>Feedback</strong> Collection</li>\n<li>Collect <strong>User eMail </strong>for <strong>newsletter Subscription</strong></li>\n<li>Automatically supports images (jpgs, animated gifs) and <strong>Youtube Videos</strong> from WPBot Language Settings Responses</li>\n<li>Add <strong>video in Support area</strong> just by pasting Youtube link</li>\n<li>Option to <strong>Skip Greeting</strong> and Asking Name and eMail</li>\n<li>Option to show the ChatBot for Logged in users only</li>\n<li><strong>Skip</strong> Greetings and <strong>Trigger an Intent</strong> (like a Custom Form)</li>\n<li>Option to enable/disable<strong> asking for eMail</strong> address after asking name</li>\n<li>Enable <strong>Asking for Phone Number</strong></li>\n<li><strong>Quick Help for commands</strong> that can be used in-chat</li>\n<li><strong>Keyboard shortcuts</strong> (Ctrl+B to open bot, Esc to close)</li>\n</ul>\n<p><strong>OpenAI ChatGPT Integration</strong><br />\n* Integrate with OpenAI so the WPBot can answer any questions<br />\n* OpenAI Content Writer and AI Content Generatror<br />\n* Open AI Image Generator<br />\n* Train and Fine Tune OpenAI<br />\n* Fine tune with your Website data (pages, posts and custom post types)<br />\n* GPT Assistant support. Upload your PDF, MSWord or other documents to train ChatGPT to respond from<br />\n* Generate and Upload website contents as JSON file to your GPT Assistant for AI training</p>\n<p><strong>DialogFlow Integration</strong></p>\n<ul>\n<li>Full integration with Google Artificial Intelligence, Machine Learning or <strong>AI Engine DialogFlow</strong></li>\n<li>Supports <strong>DialogFlow ES &#8211; Essential</strong> and <strong>DialogFlow CX</strong></li>\n<li>Use DialogFlow CX as <strong>visual workflow builder</strong> to create conversations that are easier to design, <strong>enhance</strong>, and maintain.</li>\n<li>Supports <strong>Follow Up Intents</strong> and step by step Question Answers through Dialogflow custom Intents</li>\n<li>Supports <strong>Rich Message Response &amp; Card Responses</strong> from Dialogflow as FaceBook messenger app</li>\n<li><strong>Automatically</strong> supports images (jpgs, <strong>animated gifs</strong>) and Youtube Videos from DialogFlow Intent Responses</li>\n<li>Advanced <strong>Name Recognition with DialogFlow<br />\n</strong></li>\n<li><strong>Sample DialogFlow Agent </strong>for <strong>quick import</strong></li>\n</ul>\n<p><strong>Customization Options</strong></p>\n<ul>\n<li>Enable <strong>Extended Home</strong> Interface to present different interactive options to users</li>\n<li><strong>Enable</strong> or disable <strong>Different Sections</strong> and <strong>Buttons</strong> to show on the <strong>Extended Home</strong> interface</li>\n<li>Option to<strong> choose on which pages WPBot </strong>should <strong>load</strong></li>\n<li>Option to <strong>disable WPBot on Mobile Devices</strong></li>\n<li>Option to <strong>Auto Open WPBot Window For First Time</strong> Page Load</li>\n<li>Upload<strong> custom WPBot</strong> icon</li>\n<li>Upload custom <strong>Agent icon</strong></li>\n<li>Customize <strong>primary colors to match your site</strong></li>\n<li>Customize bot <strong>response</strong> time</li>\n<li>Option to Keep ChatBot window open when browsing</li>\n<li><strong>Hide/Show</strong> <strong>Icons </strong>at the bottom of WPBot window<strong><br />\n</strong></li>\n</ul>\n<p><strong>User Conversions &amp; Retargeting</strong></p>\n<ul>\n<li>Onsite<strong> retargeting and remarketing</strong> to increase customer conversion rate.</li>\n<li>Show <strong>retargeting</strong> messages for customer on <strong>Exit Intent, After Scrolling Down “X” Percent, Or after “X” seconds.</strong></li>\n<li>Create <strong>different Reargeting messages</strong> for different pages</li>\n<li>Collect <strong>User eMail </strong>for <strong>newsletter Subscription</strong></li>\n<li><strong>Prompt User </strong>for <strong>eMail subscription </strong>with <strong>Retargeting Message</strong></li>\n<li>Export <strong>eMail Addresses as CSV</strong></li>\n<li>Out of focus <strong>Browser tab flashing</strong> with custom message</li>\n</ul>\n<p><strong>Notification Builder</strong></p>\n<ul>\n<li>Add<strong> multiple site notifications</strong> to show above the WPBot icon</li>\n<li>Select an <strong>Intent</strong> for Click Action</li>\n<li><strong>Show or Hide</strong> Opening Notifications</li>\n<li><strong>Add links</strong> to any Intent in the Notification area so user can directly browse to the useful parts</li>\n<li>Set <strong>Interval</strong> between notifications.</li>\n</ul>\n<p><strong>Start Menu</strong></p>\n<ul>\n<li>Manage the <strong>Start Menu </strong>buttons with <strong>Drag and Drop</strong></li>\n<li>Option to <strong>Enable/Disable</strong> all ready intents like Site Search, Call Me, eMail, FAQ, newsletter subscription etc.</li>\n<li><strong>Rearrange</strong> the Start Menu Items</li>\n<li>Add Custom Menu Button with <strong>Link</strong></li>\n<li>Option to set after how many failed attempt to show Start Menu</li>\n</ul>\n<p><strong>Interactive Forms</strong><br />\nExtend the Start Menu with the <strong>powerful Conversational Forms</strong>. It is a visual,<strong> drag and drop</strong> form builder. Conversations or forms can be <strong>eMailed</strong> to you and <strong>saved in the database (pro feature)</strong>. You can create:</p>\n<ul>\n<li>Conditional <strong>Menu Driven Conversations</strong></li>\n<li>Standard Contact Forms</li>\n<li>Job <strong>Application Forms</strong></li>\n<li><strong>Lead Capture</strong> Forms</li>\n<li>Various types of <strong>Calculators</strong></li>\n<li>Feedback <strong>Survey</strong> Forms etc.</li>\n</ul>\n<p><strong>Language Support</strong></p>\n<ul>\n<li>Works with <strong>any language</strong> (multiple language support is available with WPBot Pro Master license).</li>\n<li><strong>Advanced Language Center t</strong>o edit and change every WPBot responses, System languages, stop words and info messages!</li>\n<li><strong>Stop Words</strong> dictionary included and editable by admin. Bot will automatically exclude stop words from search criteria and chat commands</li>\n<li>Add <strong>multiple variations</strong> of <strong>WPBot responses</strong> for each node. They will be used randomly and give an appearance of more human like responses.</li>\n<li>mo/pot file included so you can translate backend to any language</li>\n<li><strong>RTL support</strong></li>\n<li><strong>Multi Language support. Multilingual chatbot for international customers </strong> </li>\n</ul>\n<p><strong>ChatBot Embedding Features</strong></p>\n<ul>\n<li><strong>Embed code to use the WPBot</strong> on any other website including static HTML website</li>\n<li><strong>Widget Shortcode</strong> with the possibility to <strong>Load specific Intent</strong> (<strong>forms</strong> etc.) on a page or post.</li>\n<li>Shortcode for <strong>Click to Chat</strong> Button with the possibility to <strong>Load specific Intent</strong> (<strong>forms</strong> etc.) on a page or post</li>\n<li><strong>Shortcode for WPBot on a Page or post</strong> (without floating icon)</li>\n</ul>\n<p><strong>Button Integrations</strong></p>\n<ul>\n<li>Full Integration with<strong> FaceBook Messenger for Customer Live Chat </strong>as a floating button<strong><br />\n</strong></li>\n<li>Light Integration with <strong>Skype, WhatsApp, Viber, Web Link &amp; Phone Call</strong></li>\n<li><strong>Integrate with 3rd party Live Chat services</strong> that provides a stand alone chat page link like Tawk.to</li>\n</ul>\n<p><strong>Misc. ChatBot Features</strong></p>\n<ul>\n<li><strong>Persistent chat history</strong> over user session on website</li>\n<li>Option to <strong>Disable persistent chat history</strong> (Chat history is reset in every page)</li>\n<li>Remember chat history in browser local storage and <strong>greet returning users</strong></li>\n<li>Option to Open pages in new or same window from search results</li>\n<li><strong>GDPR</strong> compliance (message with link to Privacy page)</li>\n<li><strong>Unsubscibe</strong> Command</li>\n<li><strong>Schedule day and time when WPBot will run</strong>. Make WPBot work with other Live chat software.</li>\n<li>Plugin <strong>Auto Upgrades from WordPress backend</strong></li>\n<li><strong>Priority Support</strong></li>\n</ul>\n<blockquote>\n<p>🚀 <a href=\"https://woowbot.pro/free-support/\" rel=\"nofollow ugc\">Support, Bug Report, Feature Requests</a> | <strong> for Advanced Features Upgrade to <a href=\"https://woowbot.pro/\" rel=\"nofollow ugc\">ChatBot for WooCommerce &#8211; WoowBot Pro</a> Now!</strong> | <a href=\"https://woowbot.pro/\" rel=\"nofollow ugc\">Pro Version Demo with OpenAI and other Advanced Features</a></p>\n</blockquote>\n<h4>Support, Bug Fix, Feature Request</h4>\n<ul>\n<li>\n<p>We welcome your feedback and new feature requests for this WooCommerce chatbot! *<br />\nLet us know if you face any problem or need help with WooBot woocommerce chatbot.</p>\n</li>\n<li>\n<p><a href=\"https://www.quantumcloud.com/products/support/\" rel=\"nofollow ugc\">Plugin Support Page</a> *</p>\n</li>\n</ul>\n<h3>Use</h3>\n<ol>\n<li>Simply Activating the ChatBot Plugin will start showing WooWBot in the front end</li>\n<li>Go to the WooWBot Panel to adjust the ChatBot Settings</li>\n</ol>\n",
        "installation": "<ol>\n<li>Download the plugin zip file. Extract and upload in your wp-content/plugins folder.</li>\n<li>From the wp-admin panel go to plugins and activate &#8220;WooWBot WooCommerce Chatbot&#8221;</li>\n<li>You are done.</li>\n</ol>\n",
        "faq": "\n<dt id='how%20can%20i%20upgrade%20from%20free%20version%20of%20woowbot%20to%20the%20pro%20version%3F'>\nHow can I upgrade from free version of WoowBot to the Pro version?\n</h4>\n<p>\n<ol>\n<li>Download the latest pro version of the plugin from our website</li>\n<li>Log in to your WordPress admin area and go to the Plugins management page.</li>\n<li>Deactivate and Delete the old version of the plugin</li>\n<li>Upload and Activate the latest pro version of the plugin</li>\n<li>You are done.</li>\n</ol>\n</p>\n<dt id='does%20the%20chatbot%20support%20openai%3F'>\nDoes the ChatBot support OpenAI?\n</h4>\n<p>\n<p>OpenAI is now supported with all WoowBot Pro ChatBot packages. For advanced OpenAI features like fine tuning and GPT Assistants OpenAI Pro module is required (available with WoowBot pro Professional and Master licenses).</p>\n</p>\n<dt id='is%20my%20language%20supported%3F'>\nIs my language supported?\n</h4>\n<p>\n<p>The ChatBot can work with ANY language. Just change the language texts from the WPBot Settings-&gt;Language Center to your preferred one. Multi language is supported with the WpBot Pro version and an addon.</p>\n</p>\n<dt id='does%20this%20chatbot%20support%20multi%20language%3F'>\nDoes this ChatBot support multi language?\n</h4>\n<p>\n<p>MultiLanguage is supported with the WoowBot Pro versions. For a multilingual ChatBot for international eCommerce grab the Master License from woowbot.pro website.</p>\n</p>\n\n",
        "changelog": "<h4>3.7.6</h4>\n<p>Updated UI</p>\n<h4>3.7.5</h4>\n<p>Updated UI</p>\n<h4>3.7.4</h4>\n<p>Fixed a CSS issue in admin</p>\n<h4>3.7.3</h4>\n<p>End Sale</p>\n<h4>3.7.2</h4>\n<p>Updated admin UI</p>\n<h4>3.7.1</h4>\n<p>Labor day sale</p>\n<h4>3.7.0</h4>\n<p>Updated support link</p>\n<h4>3.6.9</h4>\n<p>Updated a function name to avoid conflict</p>\n<h4>3.6.8</h4>\n<p>Updated Support section</p>\n<h4>3.6.7</h4>\n<p>Updated tips</p>\n<h4>3.6.6</h4>\n<p>Removed Bargain Bot</p>\n<h4>3.6.5</h4>\n<p>End sale</p>\n<h4>3.6.4</h4>\n<p>Updated links</p>\n<h4>3.6.3</h4>\n<p>4th of July Sale</p>\n<h4>3.6.2</h4>\n<p>Updated UI front and back end</p>\n<h4>3.6.1</h4>\n<p>Fixed email length issue</p>\n<p>Refactored and improved some code</p>\n<h4>3.5.7</h4>\n<p>Fixed some CSS issue</p>\n<p>Refactored and improved some code</p>\n<h4>3.5.6</h4>\n<p>Remove sale banner</p>\n<h4>3.5.5</h4>\n<p>Eid sale for ChatBot</p>\n<h4>3.5.4</h4>\n<p>Removed New year Sale</p>\n<h4>3.5.3</h4>\n<p>New year Sale</p>\n<h4>3.5.2</h4>\n<p>Christmas Sale</p>\n<h4>3.5.1</h4>\n<p>Removed BF Sale</p>\n<h4>3.5.0</h4>\n<p>BF Sale</p>\n<h4>3.4.9</h4>\n<p>BF Sale</p>\n<h4>3.4.8</h4>\n<p>Removed Halloween sale</p>\n<h4>3.4.7</h4>\n<p>Bargain Bot Intro</p>\n<h4>3.4.6</h4>\n<p>Halloween sale</p>\n<h4>3.4.5</h4>\n<p>Fixed custom icon issue</p>\n<h4>3.4.4</h4>\n<p>Fixed broken image if custom image is selected but not uploaded</p>\n<h4>3.4.3</h4>\n<p>Fixed user response icon</p>\n<h4>3.4.2</h4>\n<p>Fixed Language center slash issue</p>\n<h4>3.4.1</h4>\n<p>Fixed Language center</p>\n<h4>3.4.0</h4>\n<p>Added icon</p>\n<h4>3.3.9</h4>\n<p>Fixed CSS for mobile</p>\n<h4>3.3.8</h4>\n<p>Fixed custom icon upload issue</p>\n<h4>3.3.7</h4>\n<p>Added more language options for BargainBot</p>\n<h4>3.3.6</h4>\n<p>Improved BargainBot compatibility</p>\n<h4>3.3.5</h4>\n<p>Fixed Bargain Bot Email for Admin Email</p>\n<h4>3.3.4</h4>\n<p>Fixed agent image path</p>\n<h4>3.3.3</h4>\n<p>Removed Admin notice</p>\n<h4>3.3.2</h4>\n<p>Added Admin notice</p>\n<h4>3.3.1</h4>\n<p>Removed Admin notice</p>\n<h4>3.3.0</h4>\n<p>Improved Admin notice</p>\n<h4>3.2.9</h4>\n<p>Admin notice</p>\n<h4>3.2.8</h4>\n<p>Button update</p>\n<h4>3.2.7</h4>\n<p>Added page control options</p>\n<h4>3.2.6</h4>\n<p>Added more language option</p>\n<h4>3.2.5</h4>\n<p>Fixed email send and broken feature</p>\n<h4>3.2.4</h4>\n<p>Added option to change the Agent icon</p>\n<h4>3.2.3</h4>\n<p>Added more language options</p>\n<h4>3.2.2</h4>\n<p>Added translation option for email thank you message</p>\n<h4>3.2.1</h4>\n<p>Added email feature</p>\n<p>Improved front and backend designs</p>\n<h4>3.2.0</h4>\n<p>Remove jQuery and jQuery UI Library Files</p>\n<p>Remove Stripshalshes from post parameter and using sanitize_text_field</p>\n<h4>3.1.9</h4>\n<p>Replace Bootstrap beta with 4.6.0</p>\n<p>Removed old files</p>\n<p>Improved coding</p>\n<h4>3.1.8</h4>\n<p>Update BootStrap Latest Version on Admin</p>\n<p>Fix Conflict with Astra Theme</p>\n<p>Refactor Code</p>\n<h4>3.1.7</h4>\n<p>Removed the word Woocommerce and logo from plugin name and banner as per WordPress team&#8217;s feedback.</p>\n<h4>3.1.6</h4>\n<p>WP 5.6</p>\n<h4>3.1.5</h4>\n<p>Improved the deactivation module</p>\n<h4>3.1.4</h4>\n<p>admin some css issue fixed.</p>\n<p>frontend responsive issue fixed.</p>\n<p>close button added.</p>\n<h4>3.1.2</h4>\n<p>Fixed repeat greetings</p>\n<h4>3.1.1</h4>\n<p>Added option to change the background image</p>\n<h4>3.1.0</h4>\n<p>Improved UI</p>\n<p>Stop asking name after the 1st time</p>\n<h4>3.0.0</h4>\n<p>Improved deactivation module</p>\n<h4>2.9.0</h4>\n<p>After category bot says carry is typeing.. issue fixed.</p>\n<p>Mobile close button added.</p>\n<h4>2.6.2</h4>\n<p>Improved front end UX</p>\n<p>Bargain Bot addon decimal support</p>\n<h4>2.6.1</h4>\n<p>Improved UX</p>\n<h4>2.6.0</h4>\n<p>Compatible with Bargain Bot</p>\n<p>Improved UI</p>\n<p>Improved admin area</p>\n<h4>2.5.0</h4>\n<p>Cleaned up UX</p>\n<h4>2.4.0</h4>\n<p>Introducing addons</p>\n<h4>2.3.0</h4>\n<p>Added more language options</p>\n<h4>2.1.0</h4>\n<p>Fixed JS execution from bot window</p>\n<h4>2.0.0</h4>\n<p>Improved support area</p>\n<h4>1.9.0</h4>\n<p>Added option to Disable WoowBot to Load on Mobile Device</p>\n<h4>1.8.0</h4>\n<p>Custom Icon Style issue fixed.</p>\n<p>Product status in Search result fixed.</p>\n<h4>1.7.0</h4>\n<p>Making sure all previous settings and langagues stay after update.</p>\n<p>Mobile view improved.</p>\n<h4>1.6.0</h4>\n<p>Product properties should not be accessed directly issue in log file fixed.</p>\n<h4>1.5.0</h4>\n<p>Control panel UI Polishing</p>\n<p>Moved to Own Submenu</p>\n<p>Upgrade to Pro notice</p>\n<h4>1.4.0</h4>\n<p>Multilingual feature enabled with mo/pot file</p>\n<p>Pro Version upgrade notification added</p>\n<p>Moved WoowBot to main menu</p>\n<h4>1.3.0</h4>\n<p>In Mobile WoowBot Icon Position will change according to the settings</p>\n<p>Categories duplication issue fixed</p>\n<p>Some langagues updated.</p>\n<h4>1.2.0</h4>\n<p>Fixed some search bug for mobile browsers</p>\n<h4>1.1.0</h4>\n<p>Fixed bug on window resize<br />\nDefault options related issue fixed. version:1.1.0</p>\n<h4>1.0.0</h4>\n<p>Updated icons<br />\nFixed some PHP and JS issues</p>\n<h4>0.9.0</h4>\n<p>*Inception</p>\n"
    },
    "short_description": "ChatBot for WooCommerce. Simple &amp; native WooCommerce ChatBot helps shoppers find products easily &amp; Increase Sales! AI, ChatGPT available with Pro",
    "description": "<h4>What is ChatBot for WooCommerce &#8211; WoowBot?</h4>\n<p><strong>ChatBot for WooCommerce</strong> &#8211; WoowBot is a SIMPLE&gt; and <strong>Native</strong> WordPress eCommerce ChatBot with zero configuration or bot training required. This plug n&#8217; play chatbot or conversational, eCommerce shopbot does not require any 3rd party service integration. Use this eCommerce ChatBot for automated customer service.</p>\n<p>This is a <strong>simple eCommerce ChatBot</strong> that lets your woocommerce shoppers search and find the right product quickly. If the shopper does not find the product they are searching for, they can email the shop admin directly from the ChatBot window. Use ChatBot for increasing sales in eCommerce websites.</p>\n<blockquote>\n<p>🚀 <a href=\"https://woowbot.pro/free-support/\" rel=\"nofollow ugc\">Support, Bug Report, Feature Requests</a> | <strong> for Advanced AI Features Upgrade to <a href=\"https://woowbot.pro/\" rel=\"nofollow ugc\">ChatBot for WooCommerce &#8211; WoowBot Pro</a> Now!</strong> | <a href=\"https://woowbot.pro/\" rel=\"nofollow ugc\">Pro Version Demo with OpenAI and other Advanced Features</a></p>\n</blockquote>\n<p>This shopping bot helps shoppers find the products they are looking for easily and increase store sales through conversational chatbot experience and increases your customer conversion rates!</p>\n<p>You can make this plug n’ play ChatBot to work with <strong>any language</strong> with very little effort. Just change the languages from the ChatBot Dashboard. Grab the best ChatBot for eCommerce websites now!</p>\n<p><strong>A pro version </strong>of the ChatBot plugin is available with tons of advanced features that can provide automated customer support and can be integrated with <strong>OpenAI (ChatGPT)</strong> or <strong>Google&#8217;s Dialogflow </strong>. Use AI ChatBot for product recommendations in eCommerce and provide automated customer support.</p>\n<blockquote>\n<p>🚀  Don&#8217;t have WooCommerce and Looking for a ChatBot plugin for WordPress? Try our <a href=\"https://wordpress.org/plugins/chatbot/\" rel=\"ugc\">ChatBot for WordPress</a> WPBot plugin!</p>\n</blockquote>\n<h4>Next Generation Conversational Commerce for WooCommerce</h4>\n<p>Conversational commerce is the future of eCommerce. Enter WoowBot: a new way of customer interaction that allows brands to connect with their customers on a personal level with shopbots while creating a more natural interaction that mimics the physical world. 24/7/365, the WoowBot ChatBot can provide live chat support to your shoppers and provide product search services, order status (pro feature) or support(pro feature). Increase customer satisfaction, reduce costs to scale and improve ability to engage customers.</p>\n<h4>What Can this ChatBot do?</h4>\n<p>WooWBot is the first of its kind chatbot <strong>WooCommerce</strong>.</p>\n<p>With the ChatBot Pro version, shoppers can converse fluidly with the Bot – thanks to the Integration with <strong>OpenAi (ChatGPT)</strong> or Google‘s Artificial Intelligence and Natural Language Processing (AI and NLP) from Dialogflow, Search and Add products to the cart directly from the chat interface and get Support.</p>\n<h4>WoowBot ChatBot Free vs Pro Version</h4>\n<p>WoowBot free version is a great Chat Bot tool for a small online store that does not require the advanced features of the pro version bot. The free version features list:</p>\n<ul>\n<li>One template</li>\n<li>Chat and search for products</li>\n<li>Search using WooCommerce standard search function that uses title and description</li>\n<li>Display products found and link to the product page</li>\n<li>Adjust location of the button</li>\n<li>Upload Custom Chat Icon</li>\n<li>Language center to modify bot responses (in any language)</li>\n<li>Custom CSS box</li>\n<li>MO/Port included for translation of multi language in back end</li>\n</ul>\n<h4>WoowBot Pro Feature Highlights</h4>\n<p><strong>Artificial Intelligence and NLP </strong></p>\n<p>WoowBot Pro is an Intelligent ChatBot &#8211; Powered by AI. Integrate with <strong>OpenAI (ChatGPT)</strong> or <strong>Google’s DialogFlow</strong>.</p>\n<p><strong>OpenAI (ChatGPT) for ChatBot WoowBot Pro</strong></p>\n<p><strong>OpenAI ChatGPT</strong> latest models are supported. OpenAI’s API provides access to ChatGPT for a wide variety of natural language tasks. You can limit OpenAI responses based on keywords inclusion or exclusion to reduce token cost. The premium version also supports ChatGPT fine tuning and GPT Assistants. The GPT Assistants API allows you to build AI assistants within your own applications. A GPT Assistant has instructions and can leverage models, tools, and knowledge to respond to user queries. With WoowBot Professional and Master licenses use the Assistants you develop on the OpenAI playground trained with your own website data and/or upload your own PDF documents to answer from.</p>\n<p><strong>Onsite Retargeting, Exit Intent</strong></p>\n<p>Recover up to 25% of Abandoning Visitors with Onsite Retargeting. WoowBot detects exiting Visitors and displays a targeted offer to your visitor determined by you. Up to 25% of retargeted visitors will respond to your message and turn into customers. Targeted offers can be a coupon code, free ebook etc.<br />\nIn-Chat Support and Contact</p>\n<p>The Onsite Retargeting helps your Conversion rate optimization by showing special offers and coupons on Exit Intent, time interval or page scroll-down inside the ChatBot window. Track Customer Conversions with statistics to find out if shoppers are abandoning carts without completing orders. Get more sales!</p>\n<p><strong>Reduce Shopping Cart Abandonment</strong><br />\nIn addition to exit intent and remarketing offers, WoowBot can remind users to complete the checkout process when shoppers have products in the cart but they are not completing the order for some reason. Many shoppers add products to the cart but leave the site from other pages, after continuing to browse, before or after they reached the cart page.</p>\n<p>If a user leaves the site and later comes back – WoowBot will remind the shopper with a custom message to complete the order!</p>\n<p>All of these will translate into a much higher rate of customer conversion by reducing the potentials for Abandoned Cart.</p>\n<p><strong>In-Chat Support and Contact</strong></p>\n<p>WoowBot pro provides support directly from the Chat window. You can add commonly asked questions (FAQ) and answers in the backend that WoowBot will display when user goes to support area. If the shopper does not find answers to his question in the FAQ, he can opt to send a email to site admin or leave feedback!</p>\n<p><strong>Schedule the ChatBot to Work with other Live Chat Service</strong></p>\n<p>You can schedule WoowBot Pro to run only when you are not available for Live chat with other services – outside of your normal office hours. The Onsite Retargeting helps your Conversion rate optimization by showing your special offers and coupons on Exit Intent, time interval or page scroll down inside the chatbot window. Get rid of those other Exit Intent popups with a chatbot that talks directly with the shopper. Reduce Abandoned Cart by showing timely messages with the Chat Bot!</p>\n<p>Here is a list of the WoowBot pro version feature highlights:</p>\n<h4>WoowBot Pro Plugin Feature Highlights</h4>\n<p><strong>WooCommerce Specific Features</strong></p>\n<ul>\n<li>Woocommerce <strong>Product</strong> Search in Chat window</li>\n<li>Product display order by and sorting options</li>\n<li>Option to Show Only <strong>Parent</strong> Categories with or without Sub Category list.</li>\n<li>Option to display <strong>order status</strong> with or without logging in</li>\n<li>Show or hide <strong>cart</strong> item number with ChatBot icon</li>\n<li>Option to <strong>exclude out of stock products</strong> from search results</li>\n<li>Option to Enable/Disable Product <strong>Search</strong>, <strong>Featured</strong> Products, on <strong>Sale</strong> Products, <strong>Order</strong> <strong>Status</strong> buttons at start menu</li>\n<li>Show <strong>recently viewed</strong> products for easy reference to the shopper</li>\n<li>Show <strong>featured products</strong> until shopper has viewed other products</li>\n<li><strong>Quick Cart</strong> view</li>\n<li>Display <strong>product details in-chat</strong> – complete with images, add to cart option and support for multiple images</li>\n<li>Option to open product details in single page instead of Bot window</li>\n<li>Onsite R<strong>etargeting</strong> and R<strong>emarketing</strong> to increase customer conversion rate and increase sales!</li>\n<li>Show R<strong>etargeting</strong> messages for customer on <strong>Exit Intent</strong>, After <strong>Scrolling</strong> Down on page “X” Percent, Or after <strong>“X” seconds</strong>.</li>\n<li>Show R<strong>etargeting</strong> message for customers to <strong>complete</strong> the <strong>checkout</strong> if idle for a set time</li>\n<li>Customer <strong>Conversion Reporting</strong> with Charts and Graphs</li>\n<li>Shopper <strong>Conversion Statistics</strong> by Day, Week, Month and Custom Date Range</li>\n</ul>\n<p><strong>Interactions</strong></p>\n<ul>\n<li>Create simple <strong>text responses</strong> easily from your WordPress backend.</li>\n<li>Create <strong>FAQ area</strong> with multiple questions and answers with Categories (supports html)</li>\n<li>Send <strong>eMail</strong>, <strong>Call Me Back</strong> &amp; <strong>Feedback</strong> Collection</li>\n<li>Collect <strong>User eMail </strong>for <strong>newsletter Subscription</strong></li>\n<li>Automatically supports images (jpgs, animated gifs) and <strong>Youtube Videos</strong> from WPBot Language Settings Responses</li>\n<li>Add <strong>video in Support area</strong> just by pasting Youtube link</li>\n<li>Option to <strong>Skip Greeting</strong> and Asking Name and eMail</li>\n<li>Option to show the ChatBot for Logged in users only</li>\n<li><strong>Skip</strong> Greetings and <strong>Trigger an Intent</strong> (like a Custom Form)</li>\n<li>Option to enable/disable<strong> asking for eMail</strong> address after asking name</li>\n<li>Enable <strong>Asking for Phone Number</strong></li>\n<li><strong>Quick Help for commands</strong> that can be used in-chat</li>\n<li><strong>Keyboard shortcuts</strong> (Ctrl+B to open bot, Esc to close)</li>\n</ul>\n<p><strong>OpenAI ChatGPT Integration</strong><br />\n* Integrate with OpenAI so the WPBot can answer any questions<br />\n* OpenAI Content Writer and AI Content Generatror<br />\n* Open AI Image Generator<br />\n* Train and Fine Tune OpenAI<br />\n* Fine tune with your Website data (pages, posts and custom post types)<br />\n* GPT Assistant support. Upload your PDF, MSWord or other documents to train ChatGPT to respond from<br />\n* Generate and Upload website contents as JSON file to your GPT Assistant for AI training</p>\n<p><strong>DialogFlow Integration</strong></p>\n<ul>\n<li>Full integration with Google Artificial Intelligence, Machine Learning or <strong>AI Engine DialogFlow</strong></li>\n<li>Supports <strong>DialogFlow ES &#8211; Essential</strong> and <strong>DialogFlow CX</strong></li>\n<li>Use DialogFlow CX as <strong>visual workflow builder</strong> to create conversations that are easier to design, <strong>enhance</strong>, and maintain.</li>\n<li>Supports <strong>Follow Up Intents</strong> and step by step Question Answers through Dialogflow custom Intents</li>\n<li>Supports <strong>Rich Message Response &amp; Card Responses</strong> from Dialogflow as FaceBook messenger app</li>\n<li><strong>Automatically</strong> supports images (jpgs, <strong>animated gifs</strong>) and Youtube Videos from DialogFlow Intent Responses</li>\n<li>Advanced <strong>Name Recognition with DialogFlow<br />\n</strong></li>\n<li><strong>Sample DialogFlow Agent </strong>for <strong>quick import</strong></li>\n</ul>\n<p><strong>Customization Options</strong></p>\n<ul>\n<li>Enable <strong>Extended Home</strong> Interface to present different interactive options to users</li>\n<li><strong>Enable</strong> or disable <strong>Different Sections</strong> and <strong>Buttons</strong> to show on the <strong>Extended Home</strong> interface</li>\n<li>Option to<strong> choose on which pages WPBot </strong>should <strong>load</strong></li>\n<li>Option to <strong>disable WPBot on Mobile Devices</strong></li>\n<li>Option to <strong>Auto Open WPBot Window For First Time</strong> Page Load</li>\n<li>Upload<strong> custom WPBot</strong> icon</li>\n<li>Upload custom <strong>Agent icon</strong></li>\n<li>Customize <strong>primary colors to match your site</strong></li>\n<li>Customize bot <strong>response</strong> time</li>\n<li>Option to Keep ChatBot window open when browsing</li>\n<li><strong>Hide/Show</strong> <strong>Icons </strong>at the bottom of WPBot window<strong><br />\n</strong></li>\n</ul>\n<p><strong>User Conversions &amp; Retargeting</strong></p>\n<ul>\n<li>Onsite<strong> retargeting and remarketing</strong> to increase customer conversion rate.</li>\n<li>Show <strong>retargeting</strong> messages for customer on <strong>Exit Intent, After Scrolling Down “X” Percent, Or after “X” seconds.</strong></li>\n<li>Create <strong>different Reargeting messages</strong> for different pages</li>\n<li>Collect <strong>User eMail </strong>for <strong>newsletter Subscription</strong></li>\n<li><strong>Prompt User </strong>for <strong>eMail subscription </strong>with <strong>Retargeting Message</strong></li>\n<li>Export <strong>eMail Addresses as CSV</strong></li>\n<li>Out of focus <strong>Browser tab flashing</strong> with custom message</li>\n</ul>\n<p><strong>Notification Builder</strong></p>\n<ul>\n<li>Add<strong> multiple site notifications</strong> to show above the WPBot icon</li>\n<li>Select an <strong>Intent</strong> for Click Action</li>\n<li><strong>Show or Hide</strong> Opening Notifications</li>\n<li><strong>Add links</strong> to any Intent in the Notification area so user can directly browse to the useful parts</li>\n<li>Set <strong>Interval</strong> between notifications.</li>\n</ul>\n<p><strong>Start Menu</strong></p>\n<ul>\n<li>Manage the <strong>Start Menu </strong>buttons with <strong>Drag and Drop</strong></li>\n<li>Option to <strong>Enable/Disable</strong> all ready intents like Site Search, Call Me, eMail, FAQ, newsletter subscription etc.</li>\n<li><strong>Rearrange</strong> the Start Menu Items</li>\n<li>Add Custom Menu Button with <strong>Link</strong></li>\n<li>Option to set after how many failed attempt to show Start Menu</li>\n</ul>\n<p><strong>Interactive Forms</strong><br />\nExtend the Start Menu with the <strong>powerful Conversational Forms</strong>. It is a visual,<strong> drag and drop</strong> form builder. Conversations or forms can be <strong>eMailed</strong> to you and <strong>saved in the database (pro feature)</strong>. You can create:</p>\n<ul>\n<li>Conditional <strong>Menu Driven Conversations</strong></li>\n<li>Standard Contact Forms</li>\n<li>Job <strong>Application Forms</strong></li>\n<li><strong>Lead Capture</strong> Forms</li>\n<li>Various types of <strong>Calculators</strong></li>\n<li>Feedback <strong>Survey</strong> Forms etc.</li>\n</ul>\n<p><strong>Language Support</strong></p>\n<ul>\n<li>Works with <strong>any language</strong> (multiple language support is available with WPBot Pro Master license).</li>\n<li><strong>Advanced Language Center t</strong>o edit and change every WPBot responses, System languages, stop words and info messages!</li>\n<li><strong>Stop Words</strong> dictionary included and editable by admin. Bot will automatically exclude stop words from search criteria and chat commands</li>\n<li>Add <strong>multiple variations</strong> of <strong>WPBot responses</strong> for each node. They will be used randomly and give an appearance of more human like responses.</li>\n<li>mo/pot file included so you can translate backend to any language</li>\n<li><strong>RTL support</strong></li>\n<li><strong>Multi Language support. Multilingual chatbot for international customers </strong> </li>\n</ul>\n<p><strong>ChatBot Embedding Features</strong></p>\n<ul>\n<li><strong>Embed code to use the WPBot</strong> on any other website including static HTML website</li>\n<li><strong>Widget Shortcode</strong> with the possibility to <strong>Load specific Intent</strong> (<strong>forms</strong> etc.) on a page or post.</li>\n<li>Shortcode for <strong>Click to Chat</strong> Button with the possibility to <strong>Load specific Intent</strong> (<strong>forms</strong> etc.) on a page or post</li>\n<li><strong>Shortcode for WPBot on a Page or post</strong> (without floating icon)</li>\n</ul>\n<p><strong>Button Integrations</strong></p>\n<ul>\n<li>Full Integration with<strong> FaceBook Messenger for Customer Live Chat </strong>as a floating button<strong><br />\n</strong></li>\n<li>Light Integration with <strong>Skype, WhatsApp, Viber, Web Link &amp; Phone Call</strong></li>\n<li><strong>Integrate with 3rd party Live Chat services</strong> that provides a stand alone chat page link like Tawk.to</li>\n</ul>\n<p><strong>Misc. ChatBot Features</strong></p>\n<ul>\n<li><strong>Persistent chat history</strong> over user session on website</li>\n<li>Option to <strong>Disable persistent chat history</strong> (Chat history is reset in every page)</li>\n<li>Remember chat history in browser local storage and <strong>greet returning users</strong></li>\n<li>Option to Open pages in new or same window from search results</li>\n<li><strong>GDPR</strong> compliance (message with link to Privacy page)</li>\n<li><strong>Unsubscibe</strong> Command</li>\n<li><strong>Schedule day and time when WPBot will run</strong>. Make WPBot work with other Live chat software.</li>\n<li>Plugin <strong>Auto Upgrades from WordPress backend</strong></li>\n<li><strong>Priority Support</strong></li>\n</ul>\n<blockquote>\n<p>🚀 <a href=\"https://woowbot.pro/free-support/\" rel=\"nofollow ugc\">Support, Bug Report, Feature Requests</a> | <strong> for Advanced Features Upgrade to <a href=\"https://woowbot.pro/\" rel=\"nofollow ugc\">ChatBot for WooCommerce &#8211; WoowBot Pro</a> Now!</strong> | <a href=\"https://woowbot.pro/\" rel=\"nofollow ugc\">Pro Version Demo with OpenAI and other Advanced Features</a></p>\n</blockquote>\n<h4>Support, Bug Fix, Feature Request</h4>\n<ul>\n<li>\n<p>We welcome your feedback and new feature requests for this WooCommerce chatbot! *<br />\nLet us know if you face any problem or need help with WooBot woocommerce chatbot.</p>\n</li>\n<li>\n<p><a href=\"https://www.quantumcloud.com/products/support/\" rel=\"nofollow ugc\">Plugin Support Page</a> *</p>\n</li>\n</ul>\n<h3>Use</h3>\n<ol>\n<li>Simply Activating the ChatBot Plugin will start showing WooWBot in the front end</li>\n<li>Go to the WooWBot Panel to adjust the ChatBot Settings</li>\n</ol>\n",
    "download_link": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.7.6.zip",
    "upgrade_notice": {
        "1.0.0": "<p>Updated icons\nFixed some PHP and JS issues</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/woowbot-woocommerce-chatbot/assets/screenshot-1.jpg?rev=1695221",
            "caption": "Woocommerce chatbot hard at work"
        },
        {
            "src": "https://ps.w.org/woowbot-woocommerce-chatbot/assets/screenshot-2.jpg?rev=1695221",
            "caption": "Woocommerce chatbot hard at work"
        },
        {
            "src": "https://ps.w.org/woowbot-woocommerce-chatbot/assets/screenshot-3.jpg?rev=1695221",
            "caption": "Woocommerce chatbot HUD"
        },
        {
            "src": "https://ps.w.org/woowbot-woocommerce-chatbot/assets/screenshot-4.jpg?rev=1695221",
            "caption": "Woocommerce chatbot HUD for Icon"
        },
        {
            "src": "https://ps.w.org/woowbot-woocommerce-chatbot/assets/screenshot-5.jpg?rev=1695221",
            "caption": "Woocommerce chatbot HUD for Language Management"
        }
    ],
    "tags": {
        "bot": "bot",
        "chatbot": "chatbot",
        "live-chat": "live chat",
        "woocommerce": "woocommerce",
        "woocommerce-chatbot": "woocommerce chatbot"
    },
    "stable_tag": "3.7.6",
    "versions": {
        "1.1.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.1.1.0.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.1.2.0.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.1.3.0.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.1.4.0.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.1.5.0.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.1.6.0.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.1.7.0.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.1.8.0.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.1.9.0.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.2.0.0.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.2.1.0.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.2.2.0.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.2.3.0.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.2.4.0.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.2.5.0.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.2.6.0.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.2.7.0.zip",
        "2.8.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.2.8.0.zip",
        "2.9.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.2.9.0.zip",
        "3,2,7": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3,2,7.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.0.0.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.1.0.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.1.1.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.1.2.zip",
        "3.1.4": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.1.4.zip",
        "3.1.5": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.1.5.zip",
        "3.1.6": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.1.6.zip",
        "3.1.7": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.1.7.zip",
        "3.1.8": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.1.8.zip",
        "3.1.9": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.1.9.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.2.1.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.2.2.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.2.3.zip",
        "3.2.4": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.2.4.zip",
        "3.2.5": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.2.5.zip",
        "3.2.6": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.2.6.zip",
        "3.2.8": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.2.8.zip",
        "3.2.9": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.2.9.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.3.0.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.3.1.zip",
        "3.3.2": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.3.2.zip",
        "3.3.3": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.3.3.zip",
        "3.3.4": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.3.4.zip",
        "3.3.5": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.3.5.zip",
        "3.3.6": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.3.6.zip",
        "3.3.7": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.3.7.zip",
        "3.3.8": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.3.8.zip",
        "3.3.9": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.3.9.zip",
        "3.4.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.4.0.zip",
        "3.4.1": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.4.1.zip",
        "3.4.2": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.4.2.zip",
        "3.4.3": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.4.3.zip",
        "3.4.4": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.4.4.zip",
        "3.4.5": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.4.5.zip",
        "3.4.6": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.4.6.zip",
        "3.4.7": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.4.7.zip",
        "3.4.8": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.4.8.zip",
        "3.4.9": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.4.9.zip",
        "3.5.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.5.0.zip",
        "3.5.1": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.5.1.zip",
        "3.5.2": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.5.2.zip",
        "3.5.3": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.5.3.zip",
        "3.5.4": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.5.4.zip",
        "3.5.5": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.5.5.zip",
        "3.5.6": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.5.6.zip",
        "3.5.7": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.5.7.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.6.1.zip",
        "3.6.2": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.6.2.zip",
        "3.6.3": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.6.3.zip",
        "3.6.4": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.6.4.zip",
        "3.6.5": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.6.5.zip",
        "3.6.6": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.6.6.zip",
        "3.6.7": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.6.7.zip",
        "3.6.8": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.6.8.zip",
        "3.6.9": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.6.9.zip",
        "3.7.0": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.7.0.zip",
        "3.7.1": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.7.1.zip",
        "3.7.2": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.7.2.zip",
        "3.7.3": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.7.3.zip",
        "3.7.4": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.7.4.zip",
        "3.7.5": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.7.5.zip",
        "3.7.6": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.3.7.6.zip",
        "trunk": "https://downloads.wordpress.org/plugin/woowbot-woocommerce-chatbot.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://woowbot.pro/",
    "banners": {
        "low": "https://ps.w.org/woowbot-woocommerce-chatbot/assets/banner-772x250.jpg?rev=2468715",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/woowbot-woocommerce-chatbot/assets/icon-256x256.png?rev=2468715",
        "2x": "https://ps.w.org/woowbot-woocommerce-chatbot/assets/icon-256x256.png?rev=2468715"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 96,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "woowbot-woocommerce-chatbot",
            "language": "es_MX",
            "version": "3.7.2",
            "updated": "2020-08-20 18:13:47",
            "package": "https://downloads.wordpress.org/translation/plugin/woowbot-woocommerce-chatbot/3.7.2/es_MX.zip"
        }
    ]
}