{
    "name": "WordPress Tooltips",
    "slug": "wordpress-tooltips",
    "version": "9.8.9",
    "author": "<a href=\"https://tooltips.org/wordpress-tooltip-plugin/wordpress-tooltips-demo/\">Tomas | Docs | FAQ | Premium Support</a>",
    "author_profile": "https://profiles.wordpress.org/zhuyi/",
    "contributors": {
        "zhuyi": {
            "profile": "https://profiles.wordpress.org/zhuyi/",
            "avatar": "https://secure.gravatar.com/avatar/c2502dd42ba516b8bfb3c66f6e110110?s=96&d=monsterid&r=g",
            "display_name": "Tomas"
        }
    },
    "requires": "3.8",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 76,
    "ratings": {
        "5": 43,
        "4": 4,
        "3": 2,
        "2": 1,
        "1": 18
    },
    "num_ratings": 68,
    "support_url": "https://wordpress.org/support/plugin/wordpress-tooltips/",
    "support_threads": 1,
    "support_threads_resolved": 0,
    "active_installs": 6000,
    "downloaded": 475944,
    "last_updated": "2024-08-05 1:18pm GMT",
    "added": "2011-08-28",
    "homepage": "https://tooltips.org/features-of-wordpress-tooltips-plugin/",
    "sections": {
        "description": "<p>Responsive WordPress Tooltips:<br />\nTooltips are small popup boxes that display additional information such as text, video, audio, images, Google Maps, QR codes, links, Wikipedia, Youtube, Soundcloud, PDFs, GIFs, SVGs&#8230;and more. These tooltips will appear when users hover over an element on your pages. The element could be a word in your post, an image on your page, post title, post tag, a search form input box, a word in a menu item, a widget in your sidebar, a label in a contact form, a word in a WooCommerce description or WooCommerce additional information tab, ACF tooltips, a word in a comment, fields in a pricing table, WordPress buttons, or multimedia content for an image or gallery&#8230; and so on.</p>\n<p>👉 <a href=\"https://tooltips.org/wordpress-tooltip-plugin/wordpress-tooltip-plugin-document/wordpress-tooltips-video-tutorials/\" rel=\"nofollow ugc\">Tooltip Video Tutorials</a> | <a href=\"https://tooltips.org/wordpress-tooltip-plugin/wordpress-tooltips-demo/\" rel=\"nofollow ugc\">Tooltip Demos</a> | <a href=\"https://tooltips.org/wordpress-tooltip-plugin/wordpress-tooltip-plugin-document/\" rel=\"nofollow ugc\">Tooltip Document</a> | <a href=\"https://tooltips.org/contact-us/\" rel=\"nofollow ugc\">Tooltip Support</a></p>\n<p>WordPress Tooltip</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/3PFnHXl1h34?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>WordPress Glossary</p>\n<div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/239822819\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n<p>When a user hovers over an item with the pointer, a tooltip box will appear. You can add text, images, videos, radio buttons, audio players, social links, and more to the tooltip box. Tooltips can be added to various elements such as post titles, post content, post excerpts, post tags, WordPress archives, WordPress menu items, galleries, and so on.<br />\nWordPress Tooltip also supports a glossary feature &#8211; simply insert the shortcode [glossary] in any page or post. A screenshot can be found at this link &#8212; https://ps.w.org/wordpress-tooltips/assets/screenshot-6.png.</p>\n<p>WordPress Tooltip is a simple, quick, lightweight, and powerful jQuery tooltip solution that is very user-friendly. You can easily add any HTML content using the standard WordPress WYSIWYG editor. For example, you can add a PDF, video player, audio player, image, social link, payment QR code, and more.</p>\n<p>You can easily and quickly manage all tooltip keywords and content centrally in one admin panel. Simply input the keyword in the title field and the video/radio/text/image/links in the WordPress Tooltip WYSIWYG editor. The WordPress Tooltip plugin will detect your tooltip keywords in the frontend elements such as post content, post title, post tags, menu item&#8230; and more, and automatically apply the tooltip effect to the tooltip terms.</p>\n<p>In general, you do not need a tooltip shortcode because the WordPress Tooltips plugin will automatically add tooltip effects for tooltip terms. However, you can use tooltip and glossary shortcodes like this:<br />\nShortcode [tooltips]:</p>\n<p>[tooltips keyword=&#8221;wordpress tooltips&#8221; content=&#8221;WordPress Tooltips is a rich-featured WordPress tooltip plugin.&#8221;]<br />\nor<br />\n[tooltips content=&#8221;WordPress Tooltips is a rich-featured WordPress tooltip plugin&#8221;]wordpress tooltips[/tooltips]</p>\n<p>Shortcode [tooltip_by_id]:<br />\n[tooltip_by_id tooltip_id=&#8217;222&#8242;]<br />\n&#8216;222&#8217; is the post ID of the tooltip, which you can find in the WYSIWYG tooltips editor. Using this method, you can edit multimedia content in the WordPress Tooltip WYSIWYG editor, and insert tooltip effects with multimedia into the page builder (Gutenberg, Elementor, Beaver, Visual Composer&#8230;), WordPress posts, or other compatible plugins (WooCommerce, WPForms&#8230;) through the [tooltip_by_id] shortcode.</p>\n<p>Shortcode [glossary] and [tooltiplist] &#8212; you can insert these shortcode into any wordpress post to build a glossary quickly</p>\n<p>For more details, please check <a href='https://tooltips.org/how-to-use-wordpress-tooltip-shortcode-tooltips-to-add-tooltips-manually/' rel=\"nofollow ugc\">document of wordpress tooltip shortcode</a></p>\n<p>For gallery users, such as NextGen, you do not need to do anything. Our WordPress Tooltip plugin will automatically detect the NextGen descriptions and display them as tooltips when users hover over the NextGen gallery images. Additionally, our plugin supports many other gallery/slideshow plugins. You can configure tooltip management options in the Tooltips Global Settings panel.</p>\n<p>WordPress Tooltips also support many other amazing plugins. Users have told us that they are adding WordPress Tooltip effects to Elementor page builder, TablePress, WPForms, pricing table, Contact Form 7, WooCommerce, ACF tooltip&#8230; and more 🙂</p>\n<h4>Live Demo of WordPress Tooltips Pro:</h4>\n<li><a href='http://tooltips.org/wordpress-image-tooltips-demo/' rel=\"nofollow ugc\">WordPress Image Tooltip Demo</a></li>\n<li><a href='http://tooltips.org/wordpress-audio-tooltips-demo/' rel=\"nofollow ugc\">WordPress Audio Tooltip Demo</a></li>\n<li><a href='http://tooltips.org/wordpress-video-tooltips-demo/' rel=\"nofollow ugc\">WordPress Video Tooltip Demo</a></li>\n<li><a href='https://tooltips.org/how-to-customize-the-style-for-each-tooltip-with-wordpress-tooltips-pro/' rel=\"nofollow ugc\">Customize Different Style For Each Tooltip</a></li>\n<li><a href='https://tooltips.org/contact-us/' rel=\"nofollow ugc\">Tooltip For Each Form Fields Demo, Just Hover Over Form Fields</a></li>\n<li><a href='http://tooltips.org/wordpress-image-tooltips-demo/' rel=\"nofollow ugc\">Tooltip To Menu Item Demo, Check &#8220;Try Demo&#8221; Menu Item</a></li>\n<li><a href='https://tooltips.org/product/show-tooltips-in-woocommerce-products/' rel=\"nofollow ugc\">Tooltip in WooCommerce Product Demo</a></li>\n<li><a href='https://tooltips.org/how-to-add-multimedia-tooltip-to-an-image-using-tooltip-shortcode/' rel=\"nofollow ugc\">Use Video / Video / Image As Tooltip For An Image</a></li>\n<li><a href='http://tooltips.org/add-wordpress-tooltips-in-wordpress-post-title-demo/' rel=\"nofollow ugc\">WordPress Add Tooltip To Post Title Demo</a></li>\n<li><a href='http://tooltips.org/add-wordpress-tooltips-in-wordpress-post-tag/' rel=\"nofollow ugc\">WordPress Add Tooltip To Post Tag Demo</a></li>\n<li><a href='https://tooltips.org/wordpress-glossary-demo/' rel=\"nofollow ugc\">WordPress Glossary Demo</a></li>\n<li><a href='https://tooltips.org/add-tooltips-for-table/' rel=\"nofollow ugc\">Add Tooltip In Table Demo</a></li>\n<li><a href='https://tooltips.org/tooltips-for-pricing-table/' rel=\"nofollow ugc\">Add Tooltip In Pricing Table Demo</a></li>\n<li><a href='https://tooltips.org/tooltips-for-button/' rel=\"nofollow ugc\">Add Tooltip In Button Demo</a></li>\n<li><a href='https://tooltips.org/bullet-screen/' rel=\"nofollow ugc\">Bullet Screen Demo</a></li>\n<li><a href='https://tooltips.org/qr-code-tooltip/' rel=\"nofollow ugc\">QR Code Tooltip</a></li>\n<p>Our WordPress Tooltip plugin has a tooltip customization API, which enables it to integrate seamlessly with other themes, plugins, and platforms, enhancing the functionality of our WordPress Tooltip plugin.</p>\n<blockquote>\n<h4>There are more amazing features in our WordPress Tooltip plugin, for example:</h4>\n<ul>\n<li>4 preset tooltip color schemes: Yellow, Light, Dark, Green. You can easily select tooltip color schemes with just one click in the tooltip settings panel in the admin area.</li>\n<li>The WordPress Tooltip plugin will automatically add tooltip effects to posts by default. It also supports manual insertion of tooltips in posts using shortcode.</li>\n<li>Responsive tooltips &#8211; our WordPress Tooltip plugin is fully compatible with mobile devices.</li>\n<li>Various options to show tooltip animation effects.</li>\n<li>Options to enable/disable tooltips for images.</li>\n<li>Options to enable/disable tooltips for excerpts.</li>\n<li>Options to enable/disable tooltips in post tags.</li>\n<li>Option to enable/disable the &#8220;Tooltip Close Button.&#8221;</li>\n<li>Option to set up tooltip z-index value using a range slider.</li>\n<li>Option to set up tooltip Hook Priority value using a range slider. This allows WordPress tooltips to enhance the functionality of other WordPress plugins and display content generated by other plugins (following the WP the_content API) in the tooltip popup window.</li>\n<li>Tooltip Keyword Matching Mode option: You can choose to show tooltips for the first matching tooltip term on the page or apply the tooltip effect to all matching keywords on the same page.</li>\n<li>WordPress Tooltip will automatically detect tooltip position to ensure that tooltips do not go off the screen. For example, if the tooltip word is located at the top of the page and part of the tooltip content exceeds the screen, our tooltip will be displayed at the bottom center of the tooltip word with truncated or off-screen content.</li>\n<li>Tooltip Synonyms: You can enter all synonyms in the tooltip editor at once, and our tooltip plugin will detect these synonyms and add the same tooltip content for each synonym.</li>\n<li>When the mouse hovers over the tooltip terms, a highlighted color with a transition effect will be displayed on the tooltip terms.</li>\n<li>Display Tooltip in only one single category: You can set up the tooltip to show only in one category from a category dropdown menu, or display the tooltip site-wide. The tooltip shortcode is not limited, so there is still a chance to customize it manually.</li>\n<li>Options to disable specific tooltip effects in HTML tags, such as h1, h2, h3, a, p, and more. This allows you to disable tooltips in widgets, links, and other elements.</li>\n<li>Options to enable/disable tooltips throughout the entire site.</li>\n<li>Options to move the WordPress tooltip inline JavaScript code to the footer, increasing the page speed of WordPress pages.</li>\n<li>Drag the tooltip widget to appear in the sidebar, where all tooltips will be listed.</li>\n<li>Support for tooltip categories.</li>\n<li>Support for category archive tooltips.</li>\n<li>Create tooltips manually using the shortcode [tooltips] &#8211; this allows you to add any tooltips that are not in the content of the post or in the WordPress database. It is easy to use: [tooltips keyword=&#8221;wordpress&#8221; content=&#8221;WordPress is a great system&#8221;]. Additionally, you can use an img tag to manually add images to the tooltip content.</li>\n<li>Built-in Tooltip Global Settings.</li>\n<li>Easily create a tooltip list page with the shortcode [tooltipslist].</li>\n<li>Easily create a glossary page with the shortcode [glossary].</li>\n<li>Options to enable/disable images in the glossary page.</li>\n<li>Options to enable a glossary index page that adds links for each tooltip term to improve SEO ranking. By default, the glossary index page is shown at http://yourdomain.com/glossary, but you can choose to disable it.</li>\n<li>Options to select the glossary index page &#8211; by default, it is &#8220;glossary,&#8221; but you can select any WordPress page as your glossary index page from a dropdown menu listing all pages.</li>\n<li>Options to enable/disable tooltips on the glossary index page and glossary term pages.</li>\n<li>Glossary index page, SEO friendly: Our plugin generates a powerful glossary index page by default at http://yourdomain.com/glossary/, which supports page navigation and helps improve SEO ranking. You can enable/disable tooltip links in the tooltip popup box to further enhance SEO ranking.</li>\n<li>Multi-language support for Glossary/Directory/List: English, Swedish, German, French, Finnish, Spanish, and more. You can choose your language in the optional settings.</li>\n<li>Options in the glossary index page to display or hide digital superscripts in the navigation bar.</li>\n<li>Option to hide images in the glossary list page.</li>\n<li>Option to show or hide numbers in the glossary navigation bar &#8211; by default, the navigation bar displays letters and numbers to help users navigate the glossary, and you can choose to show or hide numbers in the settings panel.</li>\n<li>Option to disable WordPress tooltips on the WordPress glossary page.</li>\n<li>Option to make the WordPress glossary searchable or not.</li>\n<li>Option to automatically link tooltip terms to the tooltip page.</li>\n<li>Tooltip glossary language addon to assist in translating glossary words from English to your native language.</li>\n<li>Tooltip Contact Form 7 addon to add tooltip effects for Contact Form 7 labels.</li>\n<li>Option to disable tooltips on mobile devices.</li>\n<li>Option to enable/disable accessing tooltips using the tab key to support Web Content Accessibility Guidelines 2.0 (WCAG 2.0).</li>\n<li>Compatibility with various themes, such as Enfold, Divi, and more. For advanced themes, we offer tooltip addons, such as the Tooltip for OceanWP Theme addon.</li>\n<li>Create an unlimited number of tooltips as needed.</li>\n<li>Support for multiple tooltips on a single page.</li>\n<li>Support the creation of a member directory via the shortcode [member_directory], with options to enable specific user roles to show in the user member directory, and the option to bulk remove users from the member directory.<br />\n  <a href=\"https://tooltips.org/how-to-create-a-member-directory-via-wordpress-tooltip/\" rel=\"nofollow ugc\">Member directory documentation</a></li>\n<li>Support the creation of a post directory via the shortcode [postdirectory], with options to limit the total number of posts in the post directory, and to only display posts with a specified post category ID or name.<br />\n  <a href=\"https://tooltips.org/how-to-limit-the-total-number-of-posts-in-post-directory-using-the-shortcode-how-to-display-only-the-posts-with-a-specified-post-category-id-how-to-display-only-the-posts-with-a-specified-post-categ/\" rel=\"nofollow ugc\">Post directory documentation</a>  </li>\n<li>Admin-friendly &#8211; we have added guided tips for each setting option. When you hover over the question mark next to a setting option, a text description will be displayed to explain the usage of that setting option.</li>\n<li>Super easy implementation</li>\n<li>Minified CSS and JavaScript codes to speed up the loading time of WordPress glossary pages.</li>\n<li>Knowledge Base menu item to help you understand how to use WordPress tooltips quickly.</li>\n<li>Support for translating the WordPress tooltips plugin content and launching localized versions. .po files can be found in the languages folder.</li>\n<li>and more&#8230;</li>\n</ul>\n</blockquote>\n<p>Just take a minute to test it out, and you&#8217;ll see how easy and user-friendly our plugin is. We welcome your comments and requests for new features at:<br />\n<a href='https://tooltips.org/features-of-wordpress-tooltips-plugin/' rel=\"nofollow ugc\">WordPress Tooltips Features</a> 🙂<br />\nLooking for more amazing features? Want to customize a beautiful style for your tooltips? Get <a href='http://tooltips.org' rel=\"nofollow ugc\">WordPress Tooltips Pro</a> now.</p>\n<h4>More Features of WordPress Tooltips Pro:</h4>\n<blockquote>\n<h4>Pro and Pro Plus Version Features</h4>\n<p>[Pro Version Detailed Feature List](<a href='https://tooltips.org/features-of-wordpress-tooltips-plugin/' rel=\"nofollow ugc\">WordPress Tooltips Features</a>)</p>\n<p>&#9989;&nbsp; * New, <strong>Use OpenAI write wordpress posts and tooltips automatically</strong>, OpenAI will generate high-level content for you automatically.<br />\n  &#9989;&nbsp; * Build pretty tooltip quickly, <strong>Fine-grained custom tooltips style</strong>, just a few click to custom tooltips style in panel: font family, font color, background color, border color, opacity, width, position, shadow, tooltips underline style, animation effects, margin, padding, title, close button&#8230;, more than 30 customization options help you build awesome tooltips.<br />\n  &#9989;&nbsp; * Custom unique pretty style for each tooltip, each tooltip can have their own &#8220;Tooltip Box Background&#8221;,&#8221;Tooltip Box Width&#8221;, &#8220;Tooltip Font Color&#8221;,&#8221;Tooltip Text Align&#8221;, &#8220;Tooltip Box Padding&#8221;, &#8220;Tooltip Class Name&#8221;, &#8220;Tooltip Border Radius&#8221;, &#8220;Border Width&#8221;, &#8220;Tooltip Border Color&#8221;, &#8220;Tooltips Border Bottom&#8221;, &#8220;Tooltip Underline Color&#8221;, &#8220;Tooltips Shadow&#8221;, &#8220;Tooltip Font Size&#8221;, &#8220;Tooltips Line Height&#8221;, &#8220;Tooltip Term Color&#8221;, &#8220;Tooltips Popup Animation&#8221;, &#8220;Title Background Color&#8221;, &#8220;Tooltip Title Font Size&#8221;, &#8220;Title Font Color&#8221;, &#8220;Close Button Background&#8221;,&#8221;Close Button Radius&#8221;, &#8220;Close Button Font Color&#8221;&#8230; and more.<br />\n  &#9989;&nbsp; * Easily add any HTML content via wordpress standard WYSWYG editor, Support unlimited number of tooltips and tooltips categories<br />\n  &#9989;&nbsp; <a href=\"https://tooltips.org/features-of-wordpress-tooltips-plugin/\" rel=\"nofollow ugc\">Build a colorful and varied and graceful tooltips site super easy and fast</a><br />\n  &#9989;&nbsp; * Responsive, Mobile devices friendly: wordpress tooltips works well on Android, iOS,Tablet and other mobile devices.<br />\n  &#9989;&nbsp; * Show rich media content in tooltip box: video, audio/song, image/photo, advertising, links/text, google map, QR code&#8230;, also you can insert shortcode in tooltip to expand more amazing features via 3rd plugins<br />\n  &#9989;&nbsp; * Support <strong>show tooltips in many famouse wordpress plugins</strong>, for example show tooltips on WooCommerce shop, show tooltips in contact form 7 fields, tooltips in Pricing Tables, tooltips in Tables, ACF Tooltip support show tooltips for ACF ( Advanced Custom Fields ) fields in front end, support tooltips in HTML5 Responsive FAQ, tooltips in Buttons, tooltips in Buddypress activity, tooltips in bbPress forum, works well with Visual Composer(VC), tooltips for NinjaForms, tooltips for woocommerce and tooltips for a few 3rd woocommerce plugins &#8230;<br />\n  &#9989;&nbsp; * Image Tooltips: <a href=\"https://tooltips.org/wordpress-image-tooltips-demo/\" rel=\"nofollow ugc\">image tooltip</a> support add tooltip effect to slideshow / gallery plugins, in back end, you setup image / gallery / slideshow  keyword matching mode, for example next-gen gallery mode or ALT attribute mode or Title attribute mode or REL attribute mode&#8230; and so on<br />\n  &#9989;&nbsp; * Video tooltip &amp; Audio tooltip: in tooltips editor, you can insert <a href=\"https://tooltips.org/wordpress-video-tooltips-demo/\" rel=\"nofollow ugc\">videos tooltip</a> directory, a more easier method is use &#8216;Insert video into tooltips&#8217; metabox, you can insert youtube video by ID, insert video by URLs, set up video height, width&#8230; and so on<br />\n  &#9989;&nbsp; * Menu tooltips:You can add tooltips into menu items, sub menu items, <a href=\"http://tooltips.org\" rel=\"nofollow ugc\">please check our menu on </a>.<br />\n  &#9989;&nbsp; * Form Tooltips: support <a href=\"https://tooltips.org/hire-us/\" rel=\"nofollow ugc\">Tooltips for Forms</a>, You Can add tooltip for each form elements, please check <a href=\"https://tooltips.org/contact-us/\" rel=\"nofollow ugc\">form tooltips demo</a>, when hover over any forms fields, you will get notes about that form field in tooltip popup box, and each tooltip popup box has their unique style<br />\n  &#9989;&nbsp; * WooCommerce tooltips: opt to add <a href=\"https://tooltips.org/product/show-tooltips-in-woocommerce-products/\" rel=\"nofollow ugc\">WooCommerce tooltip</a> effect on WooCommerce product page, WooCommerce shop page, woocommerce product title, WooCommerce product attribute tab&#8230; and so on automatically, also support some woocommerce 3rd plugins for example, &#8220;Product Specifications for WooCommerce&#8221;, &#8220;WooCommerce Product Bundles&#8221;&#8230; and more. Also with advanced woocommerce tooltip addon, support one click to enable  &hellip;</p>\n</blockquote>\n",
        "installation": "<p>1:Upload the WordPress Tooltips plugin to your blog<br />\n2:Activate it<br />\n3:edit keyword and content in tooltips menu, it is very easy, If you want to add/edit/delete tooltips, please log in admin panel, Under &#8220;Tooltips&#8221; Menu, You can editor/delete all existed tooltips in &#8220;All Tooltips&#8221; Sub Menu, also you can add new tooltip in &#8220;Add New&#8221; sub menu.<br />\nwe will use the title of the post as the keyword of your tooltips, and use the content of the post as the content of your tooltips, for example: If you use &#8220;wordpress&#8221; as post title, and use &#8220;we love wordpress&#8221; as the<br />\npost content, when users view your post, they will find the word &#8220;wordpress&#8221; with a dotted line under it, and when user move over the word &#8220;wordpress&#8221;, the tooltip box will popup and show the tooltip content &#8220;we love wordpress&#8221;<br />\n4: You can setting your tooltips in Tooltips Global Settings page at admin area, for example you can choose &#8221; Add tooltips to all matching keyword in the same page &#8221; or &#8221; Add tooltips to the first matching keyword in the same page&#8221; and so on<br />\n5: If you want to show glossary / list, just insert shortcode [tooltipslist] into your page or post.<br />\n1, 2, 3, 4, 5: You&#8217;re done!</p>\n",
        "faq": "<p>FAQs can be found here: https://tooltips.org/features-of-wordpress-tooltips-plugin/</p>\n",
        "changelog": "<h4>Version 9.8.9</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/support-for-display-glossary-term-exactly-as-entered-in-the-title-column-of-the-glossary-in-wordpress-tooltips-free-plugin-9-8-9/\" rel=\"nofollow ugc\">New option &#8220;Glossary Term Capitalization&#8221; in Glossary Settings Panel, Instructions on how to use can be found at here</a></p>\n</blockquote>\n<h4>Version 9.8.3</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/supports-batch-import-of-video-tooltips-and-audio-tooltips-wordpress-tooltips-free-9-8-3-released/\" rel=\"nofollow ugc\">Supports batch import of video tooltips and audio tooltips, detailed document can be found at here</a></p>\n</blockquote>\n<h4>Version 9.7.9</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/enhanced-functionality-to-enable-disable-specific-user-roles-display-in-user-member-directory-with-support-from-wordpress-tooltips-pro-plus-30-9-8-wordpress-tooltips-pro-20-1-4-wordpress-tooltips-fr/\" rel=\"nofollow ugc\">Enhanced Functionality to Enable/Disable Specific User Roles Display in User Member Directory</a></p>\n</blockquote>\n<h4>Version 9.7.1</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/enhanced-functionality-to-enable-disable-specific-user-roles-display-in-user-member-directory-with-support-from-wordpress-tooltips-pro-plus-30-9-8-wordpress-tooltips-pro-20-1-4-wordpress-tooltips-fr/\" rel=\"nofollow ugc\">Enhanced Functionality to Enable/Disable Specific User Roles Display in User Member Directory</a></p>\n</blockquote>\n<h4>Version 9.6.9</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/fixed-the-issue-of-double-tooltip-display-in-the-tooltip_by_id-shortcode-in-wordpress-tooltips-free-version-9-6-9/\" rel=\"nofollow ugc\">Fixed the issue of double tooltip display in the tooltip_by_id shortcode</a></p>\n</blockquote>\n<h4>Version 9.6.5</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/resigned-the-custom-language-option-in-glossary-settings-panel-wordpress-tooltips-pro-plus-30-0-8-tooltips-pro-19-9-8-tooltips-free-9-6-5-released/\" rel=\"nofollow ugc\">Resesige the custom language option in glossary settings panel</a></p>\n</blockquote>\n<h4>Version 9.6.1</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/support-for-more-member-directory-functions-wordpress-tooltips-free-plugin-9-6-1-released/\" rel=\"nofollow ugc\">Support the exclusion of specific user IDs from the member directory</a></p>\n</blockquote>\n<h4>Version 9.5.9</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/how-to-display-only-the-users-in-a-specified-user-id-list-in-the-member-directory-wordpress-tooltip-tooltips-pro-plus-28-9-8-released/\" rel=\"nofollow ugc\">Support for filtering users by including only those whose IDS are invluced in the &#8220;include&#8221; patameter list</a><br />\n  <a href=\"https://tooltips.org/wordpress-tooltips-free-9-5-9-released/\" rel=\"nofollow ugc\">Followed wordpress security standard to use esc_ functions / sanitize / wp_kses / wpdb&#8230; etc to enhance code security</a></p>\n</blockquote>\n<h4>Version 9.5.3</h4>\n<p>Followed wordpress security standard to use check_admin_referer and wp_nonce_field to enhance code security</p>\n<h4>Version 9.4.9</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/how-to-display-only-specified-wordpress-users-in-the-members-directory-according-to-their-user-roles-wordpress-tooltip-tooltips-pro-plus-28-8-8-released/\" rel=\"nofollow ugc\">How to display only specified wordpress users in the members directory according to their user roles?</a></p>\n</blockquote>\n<h4>Version 9.4.5</h4>\n<p>Follow wordpress code security standards to enhance code security</p>\n<h4>Version 9.4.3</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/support-job-board-directory-wordpress-tooltips-free-9-4-3-released/\" rel=\"nofollow ugc\">Support job directory for WP Job Manager</a></p>\n</blockquote>\n<h4>Version 9.3.9</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/how-to-solve-the-problem-of-spacial-characters-on-import-when-importing-wordpress-tooltip-term-wordpress-tooltips-pro-plus-27-3-8-tooltips-pro-19-4-6-tooltips-free-9-3-9-released/\" rel=\"nofollow ugc\">How to solve the problem of spacial characters on import when importing wordpress tooltip term</a></p>\n</blockquote>\n<h4>Version 9.3.5</h4>\n<p>Use our own developed excerpt_more function in the Woocommerce product directory to avoid potential plugin conflicts, and use our own function to generate excerpt for woocommerce products.</p>\n<h4>Version 9.3.1</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/enhanced-the-robustness-of-the-program-to-prevent-unexpected-output-from-occurring-wordpress-tooltips-pro-plus-26-6-8-tooltips-pro-19-1-6-tooltips-free-9-3-1-released/\" rel=\"nofollow ugc\">Enhanced the robustness of the program to prevent unexpected output from occurring</a></p>\n</blockquote>\n<h4>Version 9.2.9</h4>\n<p>fixed a bug: when tooltip keyword have a php regular expression metacharacters &#8216;/&#8217;, it will break the regular expression and cannot return content, in new version 9.2.9, we fixed this and we tested all 21 php regular expression metacharacters to ensure this kind of problem will not happen again</p>\n<h4>Version 9.2.3</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/fixed-a-bug-with-a-special-character-wordpress-tooltips-pro-plus-26-0-8-pro-19-0-6-free-9-2-3-released/\" rel=\"nofollow ugc\">Fix a bug related to special characters, detailed document can be found at here</a></p>\n</blockquote>\n<h4>Version 9.1.7</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/support-woocommerce-product-directory-wordpress-tooltips-free-9-1-7-released/\" rel=\"nofollow ugc\">Support Woocommerce Product Directory, detailed document can be found at here</a></p>\n</blockquote>\n<h4>Version 9.1.5</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/fixed-the-error-that-occurred-when-displaying-tooltips-on-a-special-character-wordpress-tooltips-plus-25-5-8-pro-18-7-6-free-9-1-5/\" rel=\"nofollow ugc\">Fixed the error that occurred when displaying tooltips on a special character</a></p>\n</blockquote>\n<h4>Version 9.0.9</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/how-to-limit-the-number-of-wordpress-tooltips-on-a-page/\" rel=\"nofollow ugc\">Detailed document explaining how to limit the number of- wordpress tooltips on a page, with link on Keyword Matching Mode option, detailed document can be found at here</a></p>\n</blockquote>\n<h4>Version 9.0.7</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/how-to-customize-wordpress-tooltip-z-index-value-via-one-click/\" rel=\"nofollow ugc\">Detailed document explaining z-index adjustments and how to customize it, with link on z-index option, detailed document can be found at here</a></p>\n</blockquote>\n<h4>Version 9.0.5</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/how-to-adjust-the-font-size-of-the-text-inside-wordpress-tooltip-pop-up-windows/\" rel=\"nofollow ugc\">new document links for how to set up tooltip font size in global settings panel, detailed document can be found at here</a></p>\n</blockquote>\n<h4>Version 9.0.3</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/we-re-developed-wordpress-tooltip-module-to-support-add-detailed-tip-with-document-links-for-each-wordpress-tooltip-options-to-help-users-understand-how-to-use-wordpress-tooltip-plugin-easier-and-fas/\" rel=\"nofollow ugc\">Support add detailed tip with document links for each wordpress tooltip options, to help users understand how to use wordpress tooltip plugin easier and faster, detailed document can be found at here</a></p>\n</blockquote>\n<h4>Version 8.9.5</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/how-to-enable-access-tooltip-with-tab-key-supported-by-wordpress-tooltip-free-8-9-5-tooltips-pro-plus-23-7-8-tooltips-pro-16-7-6/\" rel=\"nofollow ugc\">New option to Enable / Disable access tooltip with tab key to support Web Content Accessibility Guidelines 2.0, detailed document can be found at here</a></p>\n</blockquote>\n<h4>Version 8.9.1</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/how-to-link-tooltip-terms-to-tooltip-page-automatically-supported-by-wordperss-tooltip-free-8-9-1-wordpress-tooltips-pro-17-3-6-improved-tooltip-link-function-in-wordpress-tooltips-pro-plus-23-2-8/\" rel=\"nofollow ugc\">New option to link tooltip terms to tooltip  / glossary page automatically, this will help improve SEO rank and prepare for the support tab index of WordPress tooltips, detailed document can be found at here</a></p>\n</blockquote>\n<h4>Version 8.8.5</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/how-to-limit-the-total-number-of-posts-in-post-directory-using-the-shortcode-how-to-display-only-the-posts-with-a-specified-post-category-id-how-to-display-only-the-posts-with-a-specified-post-categ/\" rel=\"nofollow ugc\">post directory support select posts from category id, category name, support limit post numbers in directory, detailed document can be found at here</a></p>\n</blockquote>\n<h4>Version 8.7.9</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/how-to-limit-the-total-number-of-posts-in-post-directory-using-the-shortcode-how-to-display-only-the-posts-with-a-specified-post-category-id-how-to-display-only-the-posts-with-a-specified-post-categ/\" rel=\"nofollow ugc\">post directory support select posts from category id, category name, support limit post numbers in directory, detailed document can be found at here</a></p>\n</blockquote>\n<h4>Version 8.7.5</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/how-to-enable-disable-tooltips-for-max-buttons-in-wordpress-wordpress-tooltips-pro-plus-22-3-8-and-pro-16-9-2-and-free-8-7-5-released/\" rel=\"nofollow ugc\">WordPress tooltips 8.7.5 &#8212; How to Enable / Disable Tooltips for Max Buttons in WordPress?</a></p>\n</blockquote>\n<h4>Version 8.7.1</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/how-to-bulk-remove-user-from-member-directory-in-wordpress-tooltip-plugin-supported-by-tooltip-pro-plus-21-9-8-and-tooltips-pro-16-8-6/\" rel=\"nofollow ugc\">Bulk remove / hide users from member directory in wordpress tooltip plugin, description can be found at here</a></p>\n</blockquote>\n<h4>Version 8.6.9</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/wordpress-tooltips-pro-plus-21-7-8-and-wordpress-tooltips-pro-16-8-2-and-wordpress-tooltip-free-8-6-9-released/\" rel=\"nofollow ugc\">Enhanced the robustness of the program, description can be found at here</a></p>\n</blockquote>\n<h4>Version 8.6.3</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/wordpress-tooltips-free-8-6-3-released/\" rel=\"nofollow ugc\">Updated tooltip core javascript functions to improve UI in front-end, description can be found at here</a></p>\n</blockquote>\n<h4>Version 8.5.9</h4>\n<blockquote>\n<p><a href=\"https://tooltips.org/wordpress-tooltips-free-8-6-3-released/\" rel=\"nofollow ugc\">New contact form tooltip addon to add tooltips effect for contact form 7 plugin, detailed document can be found at here</a></p>\n</blockquote>\n<h4>Version 8.5.5</h4>\n<p>two features to help wordpress tooltip glossary users and 25% discount code for this anniversary celebration</p>\n<h4>Version 8.4.5</h4>\n<p>Please check our detailed document at: Better wordpress member directory</p>\n<h4>Version 8.3.9</h4>\n<p>Please check our detailed document at: WordPress Tooltips Free 8.3.9 Released</p>\n<h4>Version 8.3.5</h4>\n<p>Based on users’ feedback, we added new shortcode parameter to allow users to set only the posts in the specified category  in post directory, and how to use excerpt as content in post directory, please check our detailed document at: How to only list posts of specified category in post directory?</p>\n<h4>Version 8.3.3</h4>\n<p>support wordpress post directory, improved the UI of directory settings panel , and we are developing an AI module to generate wordpress tooltip content automatically for all users, if you have any suggestion about the AIGC feature, please don’t hesitate to contact us, please check detailed document at: WordPress tooltips plugin 19.2.8 Released , this might have a few details of pro version too 🙂</p>\n<h4>Version 8.2.7</h4>\n<p>Please check detailed document at: WordPress Tooltips Free Plugin 8.2.7 Released</p>\n<h4>Version 8.2.5</h4>\n<p>Please check our document at: wordpress tooltips free 8.2.5 released</p>\n<h4>Version 8.2.3</h4>\n<p>Please check our document at: WordPress Tooltips Free 8.2.3 Released</p>\n<h4>Version 8.1.9</h4>\n<p>Start support crate directory  via functionality of wordpress tooltip glossary. How to Create a Member Directory Via WordPress Tooltip?</p>\n<h4>Version 8.1.5</h4>\n<p>Improved wordpress tooltip shortcode, please check more details via: WordPress Tooltips Free Plugin 8.1.5, Improved WordPress Tooltips Shortcode</p>\n<h4>Version 8.1.3</h4>\n<p>Try to Support Display Tooltip in ShortCode</p>\n<h4>Version 8.1.1</h4>\n<p>Opt to help wordpress glossary user to build a pure glossary site</p>\n<h4>Version 8.0.9</h4>\n<p>Start Support Bullets Screen on WordPress Tooltip Term</p>\n<h4>Version 8.0.1</h4>\n<p>WordPress Tooltip Free Plugin 8.0.1 Released</p>\n<h4>Version 7.9.9</h4>\n<p>Start to Support WordPress Block Theme</p>\n<h4>Version 7.9.5</h4>\n<p>Avoid Show 2 Overlapping Tooltips in One Tooltip Term, WordPress Tooltips Free 7.9.5 Released</p>\n<h4>Version 7.9.3</h4>\n<p>This is an important version, include 61 changes, please check our detailed document at our site: WordPress Tooltips Free Plugin 7.9.3 Releases</p>\n<h4>Version 7.8.7</h4>\n<p>Please check our detailed document at: WordPress Tooltips Free Plugin 7.8.7 Releases</p>\n<h4>Version 7.8.3</h4>\n<p>Solved javascript conflicts between wordpress tooltips free and ninja form — wordpress tooltips free plugin</p>\n<h4>Version 7.7.9</h4>\n<p>How to hide count number of glossary items? WordPress Tooltips plugin free 7.8.1 released</p>\n<h4>Version 7.7.9</h4>\n<p>Limited time discount 10percentdiscount during the labor day holiday until 05-07</p>\n<h4>Version 7.7.7</h4>\n<p>New option to custom glossary term in glossary page, fixed a bug</p>\n<h4>Version 7.7.5</h4>\n<p>An amazing user wrote to us, in “Glossary Settings” panel, the option “Hidden Image in Glossary List” should be  “Hide Image in Glossary List”, we fixed this in the version 7.7.5</p>\n<h4>Version 7.7.3</h4>\n<p>New option to support jquery-migrate</p>\n<h4>Version 7.7.1</h4>\n<p>Increase the Page Loading Speed of the WordPress Pages</p>\n<h4>Version 7.6.9</h4>\n<p>Support Move WordPress Tooltips Jacascript Code to the WordPress Footer</p>\n<h4>Version 7.6.7</h4>\n<p>Please check details at WordPress Tooltips Free Plugin 7.6.7 Released</p>\n<h4>Version 7.6.5</h4>\n<p>Support Custom Glossary Navigation Bar Font Size</p>\n<h4>Version 7.6.3</h4>\n<p>Please check WordPress Tooltips Free Plugin 7.6.3 Released</p>\n<h4>Version 7.6.1</h4>\n<p>new feature: How to Bulk Remove Glossary Terms From Glossary Directory?</p>\n<h4>Version 7.5.7</h4>\n<p>1: New option to help wordpress tooltip users customize font size of wordpress tooltip content, please check detailed document at: How to custom wordpress tooltip content font size?</p>\n<p>2: Improved codes of disable tooltip in mobile functions</p>\n<h4>Version 7.5.3</h4>\n<p>How to Disable Tooltips for Selected CSS Classes and IDS? You can Disable Tooltips for Any Element in Your WordPress Post</p>\n<h4>Version 7.5.1</h4>\n<p>1 WordPress tooltip custom post type suppport excerpt now , if you open tooltip editor, you will find a new excerpt metabox at the bottom of the tooltip editor<br />\n2 In Glossary Settings panel, in then “Glossary Excerpt or Full Content” option, if opt to use Glossary Excerpt in glossary pages, we will display excerpt which you custom in excerpt metabox in the tooltip editor</p>\n<p>Please check our detailed document with screenshot  at WordPress Tooltip Glossary Plugin 14.5.4, How to use Tooltip Custom Excerpt in WordPress Glossary Table, it is wrote for wordpress tooltip pro version, but changes is the same of wordpress tooltip free version</p>\n<p>=Version 7.4.7 =</p>\n<p>WordPress Glossary Support Click the Glossary Term Name to Go to That Glossary Term’s Individual Page</p>\n<h4>Version 7.4.3</h4>\n<p>Improved Compatibility of WordPress Glosary with WordPress Themes, the document is for the pro version 14.4.6, but the feature of new change is the same with wordpress tooltip free plugin 7.4.3</p>\n<h4>Version 7.4.1</h4>\n<p>Improved Tooltips for Slovakian / French</p>\n<h4>Version 7.3.9</h4>\n<p>WordPress Tooltips Free 7.3.9, Opt to Display Glossary Excerpt or Glossary Full Content</p>\n<h4>Version 7.3.7</h4>\n<p>New shortcode  [tooltip_by_id] to use multimedia tooltip easier, please check our detailed document at WordPress Tooltip Free 7.3.7 Released, Tooltip Shortcode tooltip_by_id</p>\n<h4>Version 7.3.5</h4>\n<p>Please check our detailed document at: WordPress Tooltip Free Plugin 7.3.5 Released</p>\n<h4>Version 7.3.3</h4>\n<p>Please check our detailed document at: WordPress Tooltip Free Plugin 7.3.3 Released</p>\n<h4>Version 7.3.1</h4>\n<p>Please check our detailed document at: WordPress Tooltips Free Plugin 7.3.1 Released</p>\n<h4>Version 7.2.9</h4>\n<p>Please check our detailed document at: WordPress Tooltips Free 7.2.9 Released</p>\n<h4>Version 7.2.7</h4>\n<p>Re-upload admin tip css file for tooltips plugin 7.2.5</p>\n<h4>Version 7.2.5</h4>\n<p>Support tooltips for category archive title</p>\n<h4>Version 7.2.3</h4>\n<p>Move the Background Inline Css to admin.css</p>\n<h4>Version 7.2.1</h4>\n<p>Admin can Decide WordPress Glossary searchable or Not, thanks 🙂</p>\n<h4>Version 7.1.9</h4>\n<p>Please check detailed document at WordPress Tooltip Free Version 7.1.9 Released, thanks 🙂</p>\n<h4>Version 7.1.3</h4>\n<p>1 In WordPress plugins settings panel, fixed demos link under “Tooltips” plugin</p>\n<p>2 Support wordpress 5.5</p>\n<p>3: Added pro features link too</p>\n<p>Detailed Document can be found at here</p>\n<h4>Version 7.0.9</h4>\n<p>Followed wordpress check_admin_referer to enahnce security of the wordpress tooltips language addon</p>\n<h4>Version 7.0.7</h4>\n<p>Added “How to Import WordPress Tooltips From CSV” in knowledge base, for help users build import tooltips from csv in one time, because we received  a few tickets about how to import tooltip,  and we found some users did not follow format in our sample.csv which caused errors, in our detailed video tutorial, we prepared detailed video / image / text for users. 🙂</p>\n<h4>Version 7.0.5</h4>\n<p>Allow tooltip admin to import tooltips from excel csv file, so admin do not need to use a lot of time to enter tooltip terms manually one by one, please check detailed step by step document with video and image at how to import wordpress tooltip from excel csv file so admin do not need to enter tooltip terms manually one by one, please note, our document might have a little features of pro version 🙂</p>\n<h4>Version 6.9.3</h4>\n<p>1: Support disable tooltips on mobile devices, you will find new option disable tooltips on mobile devices in wordpress tooltip global settings panel, also you can check detailed document of disable tooltips on mobile devices at here</p>\n<p>2: Fixed a messed up item style in global settings panel</p>\n<p>3: In tooltips code, move a few duplocated hard code inlide css code into a css class to speed up page load speed</p>\n<h4>Version 6.8.3</h4>\n<p>Minify wordpress glossary css file ( directory.min.css) and js file ( directory.min.js) to speed up glossary pages</p>\n<p>Fixed typo word</p>\n<p>Support wordpress 5.4.2</p>\n<h4>Version 6.7.9</h4>\n<p>Fixed a php warning in “Glossary Settings” setting panel -&gt; “Hidden Image in Glossary List” option box</p>\n<h4>Version 6.7.7</h4>\n<p>In wordpress tooltip “How To Use WordPress Tooltips” knowledge base panel, added “How to Enable / Disable WordPress Tooltips in WordPress Glossary Page?”, you can find detailed step by step document at How to Enable / Disable WordPress Tooltips in WordPress Glossary Page?</p>\n<h4>Version 6.7.5</h4>\n<p>use wordpress sanitize function to enhance security of “Tooltips Addon Settings” panel</p>\n<h4>Version 6.7.3</h4>\n<p>1: Fixed a php notice of cannot find the postid</p>\n<p>2: Changed the function to avoid name conflicts with wordpress tooltips pro versions</p>\n<h4>Version 6.6.9</h4>\n<p>New option in glossary settings panel, to enable or disable wordpress tooltips show in glossary index page or glossary terms pages, please read our step by step document at How to Enable or Disable WordPress Tooltips in WordPress Glossary Index Page or Glossary Term Pages?</p>\n<p>Re-structure glossary global settings module for add more glossary features</p>\n<p>Added more features description in read me document</p>\n<h4>Version 6.5.9</h4>\n<p>Improved glossary navigation bar, when users click any letter in glossary navigation bar, the page will not scroll down or scroll up, the page will stay in place. Improved glossary templates.</p>\n<p>Check glossary demo</p>\n<p>You might need to clean site cache and your browser cache</p>\n<h4>Version 6.5.7</h4>\n<p>In glossary navigation bar, added anchor for each alphabet, so when users click any letter in glossary navigation bar, we just show glossary items for that alphabet, and stay in place, do not need to scroll down to the alphabet again.  🙂<br />\nYou might need to clean site cache and your browser cache 🙂</p>\n<p>Please check detailed description in this document ,  although it is tooltip pro plugin, but it solved the same problem 🙂</p>\n<h4>Version 6.5.5</h4>\n<p>New option to Enable / Disable Tooltips in entire site, please check guide, the guide is write for wordpress tooltip pro version, but it is the same function and description for the wordpress tooltip free version 🙂</p>\n<h4>Version 6.5.1</h4>\n<p>Fixed the wordpress tooltip conflicts with the Ocean WP theme navigation bar</p>\n<h4>Version 6.4.9</h4>\n<p>Based on user’s suggestion, we should manage all glossary options in one settings panel, we have moved “Hidden Image in Glossary List” from “Tooltips Global Settings” panel to “Glossary Settings” panel</p>\n<h4>Version 6.4.7</h4>\n<p>Based on wordpress translate team member’s suggestion:</p>\n<p>1: removed most of tags from readme.txt, now just have 5 keword existed in readme.txt</p>\n<p>2: because our readme.txt is 65k, we be requested to remove change log from readme.txt</p>\n<p>3: changed stable tag section in readme.txt for help translator find the correct version</p>\n<p>4: changed the tested up section in readme.txt</p>\n<h4>Version 6.4.5</h4>\n<p>New option box “Significant Display of Digital Superscripts on Navigation Bar” in “Glossary Settings” panel<br />\nYou can opt to “Significant Display of Digital Superscripts on Navigation Bar” or just show Digital Superscripts with normal mode<br />\nBy default, we will “Significant Display of Digital Superscripts on Navigation Bar”<br />\nRe-write readme</p>\n<h4>Version 6.4.1</h4>\n<p>Added guide of how to use glossary shortcode in knowledge base menu</p>\n<h4>Version 6.3.9</h4>\n<p>Fixed typo in admin option box tips<br />\nUpdated readme</p>\n<h4>Version 6.3.7</h4>\n<p>Updated Proper Shortcode Usage of [tooltips]], for help new users understand how to use tooltips shortcode more easier.<br />\nWhen the user uses the wrong method to call the shortcode [[tooltips]], we will have an tip to tell users:<br />\nit can be used like this:<br />\n[[tooltips keyword=&#8217;wordpress&#8217; content = &#8216;hello, wp&#8217;]]<br />\nor like this:<br />\n[[tooltips content = &#8216;hello, wp&#8217;]]wordpress[[/tooltips]</p>\n<h4>Version 6.3.5</h4>\n<p>Update Tooltips version option field<br />\nShorten the length of the readme<br />\nWill move these description to Tooltip Knowledge Base menu</p>\n<h4>Version 6.3.3</h4>\n<p>Redeveloped shortcode function to let [tooltips]] support enclosing shortcodes<br />\nThat means you can use [[tooltips]] like this way too:<br />\n[[tooltips content=&#8217;we all love wordpress&#8217;]]wordpress[[/tooltips]<br />\nAlso our shortcode still support self-closing shortcode like this:<br />\n[tooltips keyword=&#8217;wordpress&#8217; content=&#8217;we all love wordpress&#8217;]]<br />\nYou can find our demo about tooltip enclosing shortcode at:<br />\ndemo<br />\nand you can find how to use tooltip shortcode at:<br />\ndemo</p>\n<h4>Version 6.3.1</h4>\n<p>Added FAQ page in wordpress tooltip knowledge base menu item<br />\nUpdated readme</p>\n<h4>Version 6.2.9</h4>\n<p>Enhanced regular expression syntax in wordpress tooltip plugin</p>\n<h4>Version 6.2.5</h4>\n<p>New addons to support tooltip for OceanWP theme<br />\nJust login wordpress admin area, then click tooltips menu item, then click addons sub menu item<br />\nYou will open Tooltips Addon Settings panel, in here you will find “Tooltips for OceanWP Theme” option box<br />\nJust enable “Tooltips for OceanWP Theme” option<br />\nTooltip will support OceanWP Theme</p>\n<p>Fixed an css problem on tooltip admin area</p>\n<h4>Version 6.2.1</h4>\n<p>Improve wordpress tooltip program robustness, avoid confusion in extreme situations</p>\n<p>Removed unused tag</p>\n<p>Opt to give us a gray “tooltip support” credit link (https://tooltips.org/contact-us) at the bottom of tooltip popup window, help user to find and contact us if there are any problem.<br />\nBy default, the option is disabled, in tooltip popup box have no credit link, Only when you enabled credit link option in optional settings panel, the gray “tooltip support” credit link will be shown at the bottom of tooltip popup window</p>\n<h4>Version 6.1.7</h4>\n<p>Fixed bug of wordpress tooltip widget</p>\n<p>Enhance plugin security</p>\n<h4>Version 6.1.3</h4>\n<p>Added French language for glossary navigation bar, please go wordpress admin area -&gt; “tooltips” menu item -&gt; “glossary settings” sub menu item -&gt; “Language” option, you will find you can select French as glossary language</p>\n<p>In front end, if you use [[glossary]] to build your glossary page, you will find on glossary navigation bar, the laugnage from English changed to French</p>\n<h4>Version 6.0.9</h4>\n<p>Added GERMAN language for glossary navigation bar, please go wordpress admin area -&gt; “tooltips” menu item -&gt; “glossary settings” sub menu item -&gt; “Language” option, you will find you can select German as glossary language</p>\n<p>In front end, if you use [[glossary]] to build your glossary page, you will find on glossary navigation bar, the laugnage from English changed to GERMAN</p>\n<h4>Version 6.0.7</h4>\n<p>Added SWEDISH language for glossary navigation bar, please go wordpress admin area -&gt; “tooltips” menu item -&gt; “glossary settings” sub menu item -&gt; “Language” option, you will find you can select Swedish as glossary language</p>\n<p>In front end, if you use [[glossary]] to build your glossary page, you will find on glossary navigation bar, the laugnage from English changed to Finnish</p>\n<h4>Version 6.0.5</h4>\n<p>Added FINNISH language for glossary navigation bar, please go wordpress admin area -&gt; “tooltips” menu item -&gt; “glossary settings” sub menu item -&gt; “Language” option, you will find you can select Finnish as glossary language</p>\n<p>In front end, if you use [[glossary]] to build your glossary page, you will find on glossary navigation bar, the laugnage from English changed to Finnish</p>\n<p>Removed unnecessary comments</p>\n<h4>Version 6.0.1</h4>\n<p>Based on users requested, added Spanish language for glossary navigation bar, please go wordpress admin area -&gt; “tooltips” menu item -&gt; “glossary settings” sub menu item -&gt; “Language” option, you will find you can select Spanish as glossary language<br />\nIn front end, if you use [[glossary]] to build your glossary page, you will find on glossary navigation bar, the laugnage from English changed to Spanish</p>\n<h4>Version 5.9.9</h4>\n<p>Based on users requests, updated knowledge base:</p>\n<p>Added new knowledge item: How to Use Language Addon to Custom Language of Your Glossary<br />\nadded video tutorial: how to add your first tooltip</p>\n<p>Fixed the error link on language addon notice bar</p>\n<p>In language addons panel, added the tip and link of ‘How to Use Language Addon to Custom Language of Your Glossary’ in ‘Knowledge Base’, for help users to use language more easier</p>\n<h4>Version 5.9.5</h4>\n<p>Added tooltip addons framework, support add 3rd addons for wordpress tooltip plugin to extend functionality of wordpress tooltip<br />\nYou will find a new “Addons” menu, in which you will find a tooltips language customization addon<br />\nOnce you enabled Tooltips language customization addon, you will find new “Language” sub menu item in tooltips menu<br />\nIf you click language sub menu item, you will open Language settings panel, you can custom the word “ALL” on Navigation Bar, we will add more language customize feature in next versions<br />\nIn Glossary Settings panel, you will find a new “Language” option, in which you can select to enable custom language feature or just keep your language<br />\nUpgraded jQuery Directory to support custom language for glossary</p>\n<h4>Version 5.8.5</h4>\n<p>Allow users to delete glossary page which generated by wordpress tooltips automatically<br />\nIn Knowledge Base, added ‘How to Enable / Disable Tooltip Glossary Index Page’<br />\nIn Knowledge Base, added ‘How to Select My Own Glossary Index Page, How to Delete Default Glossary Index Page’<br />\nIn Knowledge Base, added ‘How to Upgrade to the WordPress Tooltips Pro’</p>\n<h4>Version 5.7.7</h4>\n<p>Fix the bug of debug code</p>\n<h4>Version 5.7.5</h4>\n<p>If your site have no glossary page yet, wordpress tooltip plugin will create a glossary index page automatcially, so you do no need create it manually.<br />\nYou can still change your glossary page via “Glossary Index Page” option in “Glossary Settings” settings panel</p>\n<h4>Version 5.7.1</h4>\n<p>Added new “Glossary Settings” sub menu in admin area<br />\nIf you click “Glossary Settings” sub menu, you will find:</p>\n<p>1 Option: Enable Glossary Index Page</p>\n<p>You can enable or disable wordpress Glossary index page.<br />\nBy default, we will show glossary index page and each glossary term have their own links for improve SEO rank, you will find glossary index page at http://yourdomain.com/glossary, but you can disable this glossary index page and hidden links for each glossary terms by select “Disable glossary index page”</p>\n<p>2 Option: Glossary Index Page</p>\n<p>By default, the glossay index page will be “glossary”, but you can select one wordpress page as your “Glossary index page”, from a selectbox which listed all pages.</p>\n<h4>Version 5.6.1</h4>\n<p>We added Knowledge Base sub menu item in admin area, based on users requested, Knowledge Base include:<br />\nHow to Install WordPress Tooltip<br />\nHow to Add / Edit / Delete WordPress Tooltip<br />\nHow WordPress Tooltips Works<br />\nWordpress Tooltips Plugin Settings<br />\nHow to use [[tooltips]] shortcode<br />\nHow to use [[tooltipslist]] shortcode<br />\nWordpress Tooltip Keyword Matching Mode<br />\nHow to enable or disable wordpress tooltips on images<br />\nWordpress Tooltips For Image Setting<br />\nHow to Use “REL” As Image Tooltip Content via WordPress GutenBerg Editor<br />\nHow to Get Support and Demos</p>\n<h4>Version 5.5.9.1</h4>\n<p>Changes in 5.5.9.1<br />\nFixed php warning in some php version</p>\n<p>Features in 5.5.9<br />\nBased on users requests, 3 new features in wordpress tooltips 5.5.9</p>\n<ul>\n<li>\n<p>New option to disable specific tooltips effect in html tags, for example, h1, h2, h3, a, p…. and more, so you can disable tooltips in widget, or disable tooltips in links… and so on</p>\n</li>\n<li>\n<p>Improved “update now” button, changed to a more pretty style for “update now” buttons</p>\n</li>\n<li>\n<p>Improved wordpress tooltips synonyms, you can enter all synonyms in tooltips editor in one time, and our tooltips plugin will detect all these synonyms and add same tooltips content for these synonyms automatically<br />\nIn wordpress tooltips standard editor, you can find synonyms setting meta box at top right of the editor.<br />\nIn general you should enter tooltips synonyms in “Synonyms of the keyword” metabox, like this format:<br />\nformat #1<br />\nsample|example|check<br />\nand it will works well<br />\nbut some users saying they like make it more prerry, they want enter synonyms like this:<br />\nformat #2<br />\nsample | example | check<br />\nOur plugin did not support format #2, so sometimes maybe some synonyms was not works well, because added these SpacE, I re-developed to support this format, now if you use format #2, it will works well always too.</p>\n</li>\n</ul>\n<h4>Version 5.5.9</h4>\n<p>Based on users requests, 3 new features in wordpress tooltips 5.5.9</p>\n<ul>\n<li>\n<p>New option to disable specific tooltips effect in html tags, for example, h1, h2, h3, a, p…. and more, so you can disable tooltips in widget, or disable tooltips in links… and so on</p>\n</li>\n<li>\n<p>Improved “update now” button, changed to a more pretty style for “update now” buttons</p>\n</li>\n<li>\n<p>Improved wordpress tooltips synonyms, you can enter all synonyms in tooltips editor in one time, and our tooltips plugin will detect all these synonyms and add same tooltips content for these synonyms automatically<br />\nIn wordpress tooltips standard editor, you can find synonyms setting meta box at top right of the editor.<br />\nIn general you should enter tooltips synonyms in “Synonyms of the keyword” metabox, like this format:<br />\nformat #1<br />\nsample|example|check<br />\nand it will works well<br />\nbut some users saying they like make it more prerry, they want enter synonyms like this:<br />\nformat #2<br />\nsample | example | check<br />\nOur plugin did not support format #2, so sometimes maybe some synonyms was not works well, because added these SpacE, I re-developed to support this format, now if you use format #2, it will works well always too.</p>\n</li>\n</ul>\n<h4>Version 5.5.3</h4>\n<p>Fixed bug of big number tooltips<br />\nTag tooltips support custom tooltip Hook Priority Value too</p>\n<h4>Version 5.4.9</h4>\n<p>shortcode [[tooltipslist]] support wordpress 5.0.3</p>\n<p>shortcode [[glossary]] support wordpress 5.0.3</p>\n<p>New option to setting Tooltip z-index Value, in tooltips global settings panel, you will find a new range slider to setting z-index Value:<br />\nSome plugins or themes have a very high z-index value, it caused the tooltip hidden behind their flyout, you can increase tooltips z-index to solve this kind of problem.</p>\n<p>New optionto setting tooltip Hook Priority Value,in tooltips global settings panel, you will find a new range slider to setting tooltip Hook Priority Value:<br />\nIf you want tooltips can support functionality of other wordpress plugins better, and show content which generated by other plugins in tooltips popup window, you need let other plugins(which followed WP the_content API) run first. You can try to change tooltip hook priority in here, heigher value means lower tooltip hook priority and that means let more WP plugins run first, if there are any plugin conflicts, you can just try to change tooltip hook priority lower or higher, then check result in the front end.</p>\n<h4>Version 5.4.3</h4>\n<p>New option to setting Tooltip z-index Value, in tooltips global settings panel, you will find a new range slider to setting z-index Value:<br />\nSome plugins or themes have a very high z-index value, it caused the tooltip hidden behind their flyout, you can increase tooltips z-index to solve this kind of problem.</p>\n<p>New optionto setting tooltip Hook Priority Value,in tooltips global settings panel, you will find a new range slider to setting tooltip Hook Priority Value:<br />\nIf you want tooltips can support functionality of other wordpress plugins better, and show content which generated by other plugins in tooltips popup window, you need let other plugins(which followed WP the_content API) run first. You can try to change tooltip hook priority in here, heigher value means lower tooltip hook priority and that means let more WP plugins run first, if there are any plugin conflicts, you can just try to change tooltip hook priority lower or higher, then check result in the front end.</p>\n<h4>Version 5.3.7</h4>\n<p>Do not add tooltips effect in glossary page<br />\nFIxed bug of shortcode tooltipslist and do not add tooltips effect in content of tooltip popup box</p>\n<h4>Version 5.3.5</h4>\n<p>Support load other plugins’ shortcodes in wordpress tooltips. In wordpress tooltips editor, you can insert shortcodes that come from other plugins, we will run these shortcodes first, then add content which generated by these 3rd plugins’ shortcodes in our wordpress tooltips popup content.</p>\n<p>Support image caption style better</p>\n<p>Support show content of 3rd plugins’ shortcode in [[glossary]] shortcode</p>\n<p>Support show content of 3rd plugins’ shortcode in [[tooltipslist]] shortcode</p>\n<p>fix bug in tooltipslist shortcode and glossary shortcode</p>\n<h4>Version 5.2.5</h4>\n<p>Avoid conflict with image caption</p>\n<h4>Version 5.2.3</h4>\n<p>Improved compatibility, support “Pro” theme, Elementor page builder and so on</p>\n<h4>Version 5.2.1</h4>\n<p>Added new option “Tooltip Close Button” in “Tooltips Global Settings” Panel”, If you enabled the option, we will Show wordpress tooltip close button in tooltip popup window, it is helpful for user to close tooltip window in some mobile device</p>\n<h4>Version 5.1.9</h4>\n<p>Based on user’s request, improved glossary style for the glossary shortcode [[glossary]]</p>\n<h4>Version 5.1.7</h4>\n<p>Fix the conflicts — if a customized theme or plugin which add the_content function in 404.php</p>\n<h4>Version 5.1.5</h4>\n<p>Added 3 preset tooltips color schemes: Light, Dark, Green.<br />\nIn tooltips settings panel in admin, support one click to select tooltips color schemes<br />\nSome other small tweaks</p>\n<h4>Version 5.0.7</h4>\n<p>Based on user requests, in tooltips global settings panel, support RTL(right-to-left) languages.</p>\n<h4>Version 5.0.5</h4>\n<p>Added tooltips popup animation effect, when user’s mouse hover tooltip term, we will show animation effect on tooltip popup box<br />\nIn backend, you can enable or disable tooltips animation effect at “Tooltips Global Settings” panel</p>\n<h4>Version 5.0.1</h4>\n<p>In tooltips Global settings menu, added option to hidden image in glossary page, one click to display / hide images in glossary page<br />\nRedevelop admin setting panel tooltip, the position of each admin tooltips will adsorb to related tooltip setting panel title automatically, no mess again<br />\nOptimized code, removed 80% css class of admin tooltip, and removed related inline css codes.<br />\nIn Tooltips Settings Panel, added tooltips logo image<br />\nOnly show tooltips metabox in tooltips editor, will not show these metabox in other post type again</p>\n<h4>Version 4.9.1</h4>\n<p>When mouse hover a tooltips terms, our wordpress tooltips plugin will highlight the text of this tooltips terms</p>\n<h4>Version 4.8.9</h4>\n<p>1: Add new shortcode [[glossary]], show all glossary with table model<br />\n2: improve style of directory / glossady page<br />\n3: add new features for jquery directory js file</p>\n<h4>Version 4.8.1</h4>\n<p>&hellip;</p>\n"
    },
    "short_description": "Add custom tooltip automatically for post&#039;s content/title/tag/excerpt/gallery/menu, easily add image / video / audio / social/link tooltips",
    "description": "<p>Responsive WordPress Tooltips:<br />\nTooltips are small popup boxes that display additional information such as text, video, audio, images, Google Maps, QR codes, links, Wikipedia, Youtube, Soundcloud, PDFs, GIFs, SVGs&#8230;and more. These tooltips will appear when users hover over an element on your pages. The element could be a word in your post, an image on your page, post title, post tag, a search form input box, a word in a menu item, a widget in your sidebar, a label in a contact form, a word in a WooCommerce description or WooCommerce additional information tab, ACF tooltips, a word in a comment, fields in a pricing table, WordPress buttons, or multimedia content for an image or gallery&#8230; and so on.</p>\n<p>👉 <a href=\"https://tooltips.org/wordpress-tooltip-plugin/wordpress-tooltip-plugin-document/wordpress-tooltips-video-tutorials/\" rel=\"nofollow ugc\">Tooltip Video Tutorials</a> | <a href=\"https://tooltips.org/wordpress-tooltip-plugin/wordpress-tooltips-demo/\" rel=\"nofollow ugc\">Tooltip Demos</a> | <a href=\"https://tooltips.org/wordpress-tooltip-plugin/wordpress-tooltip-plugin-document/\" rel=\"nofollow ugc\">Tooltip Document</a> | <a href=\"https://tooltips.org/contact-us/\" rel=\"nofollow ugc\">Tooltip Support</a></p>\n<p>WordPress Tooltip</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/3PFnHXl1h34?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>WordPress Glossary</p>\n<div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/239822819\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n<p>When a user hovers over an item with the pointer, a tooltip box will appear. You can add text, images, videos, radio buttons, audio players, social links, and more to the tooltip box. Tooltips can be added to various elements such as post titles, post content, post excerpts, post tags, WordPress archives, WordPress menu items, galleries, and so on.<br />\nWordPress Tooltip also supports a glossary feature &#8211; simply insert the shortcode [glossary] in any page or post. A screenshot can be found at this link &#8212; https://ps.w.org/wordpress-tooltips/assets/screenshot-6.png.</p>\n<p>WordPress Tooltip is a simple, quick, lightweight, and powerful jQuery tooltip solution that is very user-friendly. You can easily add any HTML content using the standard WordPress WYSIWYG editor. For example, you can add a PDF, video player, audio player, image, social link, payment QR code, and more.</p>\n<p>You can easily and quickly manage all tooltip keywords and content centrally in one admin panel. Simply input the keyword in the title field and the video/radio/text/image/links in the WordPress Tooltip WYSIWYG editor. The WordPress Tooltip plugin will detect your tooltip keywords in the frontend elements such as post content, post title, post tags, menu item&#8230; and more, and automatically apply the tooltip effect to the tooltip terms.</p>\n<p>In general, you do not need a tooltip shortcode because the WordPress Tooltips plugin will automatically add tooltip effects for tooltip terms. However, you can use tooltip and glossary shortcodes like this:<br />\nShortcode [tooltips]:</p>\n<p>[tooltips keyword=&#8221;wordpress tooltips&#8221; content=&#8221;WordPress Tooltips is a rich-featured WordPress tooltip plugin.&#8221;]<br />\nor<br />\n[tooltips content=&#8221;WordPress Tooltips is a rich-featured WordPress tooltip plugin&#8221;]wordpress tooltips[/tooltips]</p>\n<p>Shortcode [tooltip_by_id]:<br />\n[tooltip_by_id tooltip_id=&#8217;222&#8242;]<br />\n&#8216;222&#8217; is the post ID of the tooltip, which you can find in the WYSIWYG tooltips editor. Using this method, you can edit multimedia content in the WordPress Tooltip WYSIWYG editor, and insert tooltip effects with multimedia into the page builder (Gutenberg, Elementor, Beaver, Visual Composer&#8230;), WordPress posts, or other compatible plugins (WooCommerce, WPForms&#8230;) through the [tooltip_by_id] shortcode.</p>\n<p>Shortcode [glossary] and [tooltiplist] &#8212; you can insert these shortcode into any wordpress post to build a glossary quickly</p>\n<p>For more details, please check <a href='https://tooltips.org/how-to-use-wordpress-tooltip-shortcode-tooltips-to-add-tooltips-manually/' rel=\"nofollow ugc\">document of wordpress tooltip shortcode</a></p>\n<p>For gallery users, such as NextGen, you do not need to do anything. Our WordPress Tooltip plugin will automatically detect the NextGen descriptions and display them as tooltips when users hover over the NextGen gallery images. Additionally, our plugin supports many other gallery/slideshow plugins. You can configure tooltip management options in the Tooltips Global Settings panel.</p>\n<p>WordPress Tooltips also support many other amazing plugins. Users have told us that they are adding WordPress Tooltip effects to Elementor page builder, TablePress, WPForms, pricing table, Contact Form 7, WooCommerce, ACF tooltip&#8230; and more 🙂</p>\n<h4>Live Demo of WordPress Tooltips Pro:</h4>\n<li><a href='http://tooltips.org/wordpress-image-tooltips-demo/' rel=\"nofollow ugc\">WordPress Image Tooltip Demo</a></li>\n<li><a href='http://tooltips.org/wordpress-audio-tooltips-demo/' rel=\"nofollow ugc\">WordPress Audio Tooltip Demo</a></li>\n<li><a href='http://tooltips.org/wordpress-video-tooltips-demo/' rel=\"nofollow ugc\">WordPress Video Tooltip Demo</a></li>\n<li><a href='https://tooltips.org/how-to-customize-the-style-for-each-tooltip-with-wordpress-tooltips-pro/' rel=\"nofollow ugc\">Customize Different Style For Each Tooltip</a></li>\n<li><a href='https://tooltips.org/contact-us/' rel=\"nofollow ugc\">Tooltip For Each Form Fields Demo, Just Hover Over Form Fields</a></li>\n<li><a href='http://tooltips.org/wordpress-image-tooltips-demo/' rel=\"nofollow ugc\">Tooltip To Menu Item Demo, Check &#8220;Try Demo&#8221; Menu Item</a></li>\n<li><a href='https://tooltips.org/product/show-tooltips-in-woocommerce-products/' rel=\"nofollow ugc\">Tooltip in WooCommerce Product Demo</a></li>\n<li><a href='https://tooltips.org/how-to-add-multimedia-tooltip-to-an-image-using-tooltip-shortcode/' rel=\"nofollow ugc\">Use Video / Video / Image As Tooltip For An Image</a></li>\n<li><a href='http://tooltips.org/add-wordpress-tooltips-in-wordpress-post-title-demo/' rel=\"nofollow ugc\">WordPress Add Tooltip To Post Title Demo</a></li>\n<li><a href='http://tooltips.org/add-wordpress-tooltips-in-wordpress-post-tag/' rel=\"nofollow ugc\">WordPress Add Tooltip To Post Tag Demo</a></li>\n<li><a href='https://tooltips.org/wordpress-glossary-demo/' rel=\"nofollow ugc\">WordPress Glossary Demo</a></li>\n<li><a href='https://tooltips.org/add-tooltips-for-table/' rel=\"nofollow ugc\">Add Tooltip In Table Demo</a></li>\n<li><a href='https://tooltips.org/tooltips-for-pricing-table/' rel=\"nofollow ugc\">Add Tooltip In Pricing Table Demo</a></li>\n<li><a href='https://tooltips.org/tooltips-for-button/' rel=\"nofollow ugc\">Add Tooltip In Button Demo</a></li>\n<li><a href='https://tooltips.org/bullet-screen/' rel=\"nofollow ugc\">Bullet Screen Demo</a></li>\n<li><a href='https://tooltips.org/qr-code-tooltip/' rel=\"nofollow ugc\">QR Code Tooltip</a></li>\n<p>Our WordPress Tooltip plugin has a tooltip customization API, which enables it to integrate seamlessly with other themes, plugins, and platforms, enhancing the functionality of our WordPress Tooltip plugin.</p>\n<blockquote>\n<h4>There are more amazing features in our WordPress Tooltip plugin, for example:</h4>\n<ul>\n<li>4 preset tooltip color schemes: Yellow, Light, Dark, Green. You can easily select tooltip color schemes with just one click in the tooltip settings panel in the admin area.</li>\n<li>The WordPress Tooltip plugin will automatically add tooltip effects to posts by default. It also supports manual insertion of tooltips in posts using shortcode.</li>\n<li>Responsive tooltips &#8211; our WordPress Tooltip plugin is fully compatible with mobile devices.</li>\n<li>Various options to show tooltip animation effects.</li>\n<li>Options to enable/disable tooltips for images.</li>\n<li>Options to enable/disable tooltips for excerpts.</li>\n<li>Options to enable/disable tooltips in post tags.</li>\n<li>Option to enable/disable the &#8220;Tooltip Close Button.&#8221;</li>\n<li>Option to set up tooltip z-index value using a range slider.</li>\n<li>Option to set up tooltip Hook Priority value using a range slider. This allows WordPress tooltips to enhance the functionality of other WordPress plugins and display content generated by other plugins (following the WP the_content API) in the tooltip popup window.</li>\n<li>Tooltip Keyword Matching Mode option: You can choose to show tooltips for the first matching tooltip term on the page or apply the tooltip effect to all matching keywords on the same page.</li>\n<li>WordPress Tooltip will automatically detect tooltip position to ensure that tooltips do not go off the screen. For example, if the tooltip word is located at the top of the page and part of the tooltip content exceeds the screen, our tooltip will be displayed at the bottom center of the tooltip word with truncated or off-screen content.</li>\n<li>Tooltip Synonyms: You can enter all synonyms in the tooltip editor at once, and our tooltip plugin will detect these synonyms and add the same tooltip content for each synonym.</li>\n<li>When the mouse hovers over the tooltip terms, a highlighted color with a transition effect will be displayed on the tooltip terms.</li>\n<li>Display Tooltip in only one single category: You can set up the tooltip to show only in one category from a category dropdown menu, or display the tooltip site-wide. The tooltip shortcode is not limited, so there is still a chance to customize it manually.</li>\n<li>Options to disable specific tooltip effects in HTML tags, such as h1, h2, h3, a, p, and more. This allows you to disable tooltips in widgets, links, and other elements.</li>\n<li>Options to enable/disable tooltips throughout the entire site.</li>\n<li>Options to move the WordPress tooltip inline JavaScript code to the footer, increasing the page speed of WordPress pages.</li>\n<li>Drag the tooltip widget to appear in the sidebar, where all tooltips will be listed.</li>\n<li>Support for tooltip categories.</li>\n<li>Support for category archive tooltips.</li>\n<li>Create tooltips manually using the shortcode [tooltips] &#8211; this allows you to add any tooltips that are not in the content of the post or in the WordPress database. It is easy to use: [tooltips keyword=&#8221;wordpress&#8221; content=&#8221;WordPress is a great system&#8221;]. Additionally, you can use an img tag to manually add images to the tooltip content.</li>\n<li>Built-in Tooltip Global Settings.</li>\n<li>Easily create a tooltip list page with the shortcode [tooltipslist].</li>\n<li>Easily create a glossary page with the shortcode [glossary].</li>\n<li>Options to enable/disable images in the glossary page.</li>\n<li>Options to enable a glossary index page that adds links for each tooltip term to improve SEO ranking. By default, the glossary index page is shown at http://yourdomain.com/glossary, but you can choose to disable it.</li>\n<li>Options to select the glossary index page &#8211; by default, it is &#8220;glossary,&#8221; but you can select any WordPress page as your glossary index page from a dropdown menu listing all pages.</li>\n<li>Options to enable/disable tooltips on the glossary index page and glossary term pages.</li>\n<li>Glossary index page, SEO friendly: Our plugin generates a powerful glossary index page by default at http://yourdomain.com/glossary/, which supports page navigation and helps improve SEO ranking. You can enable/disable tooltip links in the tooltip popup box to further enhance SEO ranking.</li>\n<li>Multi-language support for Glossary/Directory/List: English, Swedish, German, French, Finnish, Spanish, and more. You can choose your language in the optional settings.</li>\n<li>Options in the glossary index page to display or hide digital superscripts in the navigation bar.</li>\n<li>Option to hide images in the glossary list page.</li>\n<li>Option to show or hide numbers in the glossary navigation bar &#8211; by default, the navigation bar displays letters and numbers to help users navigate the glossary, and you can choose to show or hide numbers in the settings panel.</li>\n<li>Option to disable WordPress tooltips on the WordPress glossary page.</li>\n<li>Option to make the WordPress glossary searchable or not.</li>\n<li>Option to automatically link tooltip terms to the tooltip page.</li>\n<li>Tooltip glossary language addon to assist in translating glossary words from English to your native language.</li>\n<li>Tooltip Contact Form 7 addon to add tooltip effects for Contact Form 7 labels.</li>\n<li>Option to disable tooltips on mobile devices.</li>\n<li>Option to enable/disable accessing tooltips using the tab key to support Web Content Accessibility Guidelines 2.0 (WCAG 2.0).</li>\n<li>Compatibility with various themes, such as Enfold, Divi, and more. For advanced themes, we offer tooltip addons, such as the Tooltip for OceanWP Theme addon.</li>\n<li>Create an unlimited number of tooltips as needed.</li>\n<li>Support for multiple tooltips on a single page.</li>\n<li>Support the creation of a member directory via the shortcode [member_directory], with options to enable specific user roles to show in the user member directory, and the option to bulk remove users from the member directory.<br />\n  <a href=\"https://tooltips.org/how-to-create-a-member-directory-via-wordpress-tooltip/\" rel=\"nofollow ugc\">Member directory documentation</a></li>\n<li>Support the creation of a post directory via the shortcode [postdirectory], with options to limit the total number of posts in the post directory, and to only display posts with a specified post category ID or name.<br />\n  <a href=\"https://tooltips.org/how-to-limit-the-total-number-of-posts-in-post-directory-using-the-shortcode-how-to-display-only-the-posts-with-a-specified-post-category-id-how-to-display-only-the-posts-with-a-specified-post-categ/\" rel=\"nofollow ugc\">Post directory documentation</a>  </li>\n<li>Admin-friendly &#8211; we have added guided tips for each setting option. When you hover over the question mark next to a setting option, a text description will be displayed to explain the usage of that setting option.</li>\n<li>Super easy implementation</li>\n<li>Minified CSS and JavaScript codes to speed up the loading time of WordPress glossary pages.</li>\n<li>Knowledge Base menu item to help you understand how to use WordPress tooltips quickly.</li>\n<li>Support for translating the WordPress tooltips plugin content and launching localized versions. .po files can be found in the languages folder.</li>\n<li>and more&#8230;</li>\n</ul>\n</blockquote>\n<p>Just take a minute to test it out, and you&#8217;ll see how easy and user-friendly our plugin is. We welcome your comments and requests for new features at:<br />\n<a href='https://tooltips.org/features-of-wordpress-tooltips-plugin/' rel=\"nofollow ugc\">WordPress Tooltips Features</a> 🙂<br />\nLooking for more amazing features? Want to customize a beautiful style for your tooltips? Get <a href='http://tooltips.org' rel=\"nofollow ugc\">WordPress Tooltips Pro</a> now.</p>\n<h4>More Features of WordPress Tooltips Pro:</h4>\n<blockquote>\n<h4>Pro and Pro Plus Version Features</h4>\n<p>[Pro Version Detailed Feature List](<a href='https://tooltips.org/features-of-wordpress-tooltips-plugin/' rel=\"nofollow ugc\">WordPress Tooltips Features</a>)</p>\n<p>&#9989;&nbsp; * New, <strong>Use OpenAI write wordpress posts and tooltips automatically</strong>, OpenAI will generate high-level content for you automatically.<br />\n  &#9989;&nbsp; * Build pretty tooltip quickly, <strong>Fine-grained custom tooltips style</strong>, just a few click to custom tooltips style in panel: font family, font color, background color, border color, opacity, width, position, shadow, tooltips underline style, animation effects, margin, padding, title, close button&#8230;, more than 30 customization options help you build awesome tooltips.<br />\n  &#9989;&nbsp; * Custom unique pretty style for each tooltip, each tooltip can have their own &#8220;Tooltip Box Background&#8221;,&#8221;Tooltip Box Width&#8221;, &#8220;Tooltip Font Color&#8221;,&#8221;Tooltip Text Align&#8221;, &#8220;Tooltip Box Padding&#8221;, &#8220;Tooltip Class Name&#8221;, &#8220;Tooltip Border Radius&#8221;, &#8220;Border Width&#8221;, &#8220;Tooltip Border Color&#8221;, &#8220;Tooltips Border Bottom&#8221;, &#8220;Tooltip Underline Color&#8221;, &#8220;Tooltips Shadow&#8221;, &#8220;Tooltip Font Size&#8221;, &#8220;Tooltips Line Height&#8221;, &#8220;Tooltip Term Color&#8221;, &#8220;Tooltips Popup Animation&#8221;, &#8220;Title Background Color&#8221;, &#8220;Tooltip Title Font Size&#8221;, &#8220;Title Font Color&#8221;, &#8220;Close Button Background&#8221;,&#8221;Close Button Radius&#8221;, &#8220;Close Button Font Color&#8221;&#8230; and more.<br />\n  &#9989;&nbsp; * Easily add any HTML content via wordpress standard WYSWYG editor, Support unlimited number of tooltips and tooltips categories<br />\n  &#9989;&nbsp; <a href=\"https://tooltips.org/features-of-wordpress-tooltips-plugin/\" rel=\"nofollow ugc\">Build a colorful and varied and graceful tooltips site super easy and fast</a><br />\n  &#9989;&nbsp; * Responsive, Mobile devices friendly: wordpress tooltips works well on Android, iOS,Tablet and other mobile devices.<br />\n  &#9989;&nbsp; * Show rich media content in tooltip box: video, audio/song, image/photo, advertising, links/text, google map, QR code&#8230;, also you can insert shortcode in tooltip to expand more amazing features via 3rd plugins<br />\n  &#9989;&nbsp; * Support <strong>show tooltips in many famouse wordpress plugins</strong>, for example show tooltips on WooCommerce shop, show tooltips in contact form 7 fields, tooltips in Pricing Tables, tooltips in Tables, ACF Tooltip support show tooltips for ACF ( Advanced Custom Fields ) fields in front end, support tooltips in HTML5 Responsive FAQ, tooltips in Buttons, tooltips in Buddypress activity, tooltips in bbPress forum, works well with Visual Composer(VC), tooltips for NinjaForms, tooltips for woocommerce and tooltips for a few 3rd woocommerce plugins &#8230;<br />\n  &#9989;&nbsp; * Image Tooltips: <a href=\"https://tooltips.org/wordpress-image-tooltips-demo/\" rel=\"nofollow ugc\">image tooltip</a> support add tooltip effect to slideshow / gallery plugins, in back end, you setup image / gallery / slideshow  keyword matching mode, for example next-gen gallery mode or ALT attribute mode or Title attribute mode or REL attribute mode&#8230; and so on<br />\n  &#9989;&nbsp; * Video tooltip &amp; Audio tooltip: in tooltips editor, you can insert <a href=\"https://tooltips.org/wordpress-video-tooltips-demo/\" rel=\"nofollow ugc\">videos tooltip</a> directory, a more easier method is use &#8216;Insert video into tooltips&#8217; metabox, you can insert youtube video by ID, insert video by URLs, set up video height, width&#8230; and so on<br />\n  &#9989;&nbsp; * Menu tooltips:You can add tooltips into menu items, sub menu items, <a href=\"http://tooltips.org\" rel=\"nofollow ugc\">please check our menu on </a>.<br />\n  &#9989;&nbsp; * Form Tooltips: support <a href=\"https://tooltips.org/hire-us/\" rel=\"nofollow ugc\">Tooltips for Forms</a>, You Can add tooltip for each form elements, please check <a href=\"https://tooltips.org/contact-us/\" rel=\"nofollow ugc\">form tooltips demo</a>, when hover over any forms fields, you will get notes about that form field in tooltip popup box, and each tooltip popup box has their unique style<br />\n  &#9989;&nbsp; * WooCommerce tooltips: opt to add <a href=\"https://tooltips.org/product/show-tooltips-in-woocommerce-products/\" rel=\"nofollow ugc\">WooCommerce tooltip</a> effect on WooCommerce product page, WooCommerce shop page, woocommerce product title, WooCommerce product attribute tab&#8230; and so on automatically, also support some woocommerce 3rd plugins for example, &#8220;Product Specifications for WooCommerce&#8221;, &#8220;WooCommerce Product Bundles&#8221;&#8230; and more. Also with advanced woocommerce tooltip addon, support one click to enable  &hellip;</p>\n</blockquote>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wordpress-tooltips.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-1.png?rev=1673156",
            "caption": "Image Tooltips, our WordPress Tooltip content can be video, audio/song, image, advertising, links/text."
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-2.png?rev=1673156",
            "caption": "Text Tooltips, Tooltip content with text and links"
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-3.png?rev=1673156",
            "caption": "Easy To Add New Tooltips In Back End"
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-4.png?rev=1673156",
            "caption": "Global Setting In Back End"
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-5.png?rev=841233",
            "caption": "Tooltips Edit/Delete/Update Panel In Back End"
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-6.png?rev=1133101",
            "caption": "Shortcode [tooltipslist] Suport Glossary."
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-7.png?rev=1541625",
            "caption": "Tooltips Widget On Sidebar"
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-8.png?rev=1536384",
            "caption": "Tooltips pro style setting options panel"
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-9.png?rev=1541625",
            "caption": "Add tooltips widget in back end"
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-10.png?rev=1541625",
            "caption": "Tooltips Categories in back end"
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-11.png?rev=1541625",
            "caption": "Users hit count for each tooltips"
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-12.png?rev=1673156",
            "caption": "Support WooCommerce product, also you can use Wordpress Tooltip to promote your products, such as embed an product link in the tooltip."
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-13.png?rev=1673156",
            "caption": "Plain text tooltip"
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-14.png?rev=1673156",
            "caption": "Color picker, our tooltips plugin is easy to customize pretty tooltip style, just a few clicks."
        },
        {
            "src": "https://ps.w.org/wordpress-tooltips/assets/screenshot-15.png?rev=1673156",
            "caption": "Video Tooltips"
        }
    ],
    "tags": {
        "dictionary": "dictionary",
        "glossary": "glossary",
        "knowledge-base": "knowledge base",
        "tooltip": "tooltip",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "trunk",
    "versions": {
        "1.0.2": "https://downloads.wordpress.org/plugin/wordpress-tooltips.1.0.2.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/wordpress-tooltips.1.0.4.zip",
        "1.0.5": "https://downloads.wordpress.org/plugin/wordpress-tooltips.1.0.5.zip",
        "1.0.6": "https://downloads.wordpress.org/plugin/wordpress-tooltips.1.0.6.zip",
        "1.0.7": "https://downloads.wordpress.org/plugin/wordpress-tooltips.1.0.7.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/wordpress-tooltips.3.1.1.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://paypal.me/sunpayment",
    "banners": {
        "low": "https://ps.w.org/wordpress-tooltips/assets/banner-772x250.png?rev=1158570",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/wordpress-tooltips/assets/icon-128x128.png?rev=1158570"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 76,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "wordpress-tooltips",
            "language": "es_VE",
            "version": "9.8.9",
            "updated": "2022-07-03 01:10:26",
            "package": "http://downloads.wordpress.org/translation/plugin/wordpress-tooltips/9.8.9/es_VE.zip"
        },
        {
            "type": "plugin",
            "slug": "wordpress-tooltips",
            "language": "es_ES",
            "version": "9.8.9",
            "updated": "2023-09-12 11:07:40",
            "package": "http://downloads.wordpress.org/translation/plugin/wordpress-tooltips/9.8.9/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "wordpress-tooltips",
            "language": "es_CO",
            "version": "9.8.9",
            "updated": "2022-07-03 01:11:43",
            "package": "http://downloads.wordpress.org/translation/plugin/wordpress-tooltips/9.8.9/es_CO.zip"
        },
        {
            "type": "plugin",
            "slug": "wordpress-tooltips",
            "language": "fa_IR",
            "version": "9.8.9",
            "updated": "2021-06-15 05:26:57",
            "package": "http://downloads.wordpress.org/translation/plugin/wordpress-tooltips/9.8.9/fa_IR.zip"
        }
    ]
}