{
    "name": "WP Biographia",
    "slug": "wp-biographia",
    "version": "4.0.0",
    "author": "<a href=\"http://www.garygale.com/\">Gary Gale & Travis Smith</a>",
    "author_profile": "https://profiles.wordpress.org/vicchi/",
    "contributors": {
        "vicchi": {
            "profile": "https://profiles.wordpress.org/vicchi/",
            "avatar": "https://secure.gravatar.com/avatar/d300ed1dcec487e20c8600570abeffab?s=96&d=monsterid&r=g",
            "display_name": "vicchi"
        },
        "wpsmith": {
            "profile": "https://profiles.wordpress.org/wpsmith/",
            "avatar": "https://secure.gravatar.com/avatar/7e673cdf99e6d7448f3cbaf1424c999c?s=96&d=monsterid&r=g",
            "display_name": "Travis Smith"
        }
    },
    "requires": "5.0",
    "tested": "5.6.14",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 22,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 22,
    "support_url": "https://wordpress.org/support/plugin/wp-biographia/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 900,
    "downloaded": 71383,
    "last_updated": "2020-12-30 10:23am GMT",
    "added": "2011-08-03",
    "homepage": "https://www.vicchi.org/wp-biographia/",
    "sections": {
        "description": "<p>This plugin allows you to add a customisable biography to posts, to RSS feeds, to pages, to archives and to each post on your blog&#8217;s landing page as well as via a widget in your sidebar. It integrates out of the box with the information that can be provided in each user&#8217;s profile and supports custom post types. Display of the Biography Box can be hidden on a global or per user basis for posts, pages and custom post types as well as on a per category basis.</p>\n<p>Settings and options include:</p>\n<ol>\n<li>Choose when to display a Biography Box; on the front page, in archives, on individual posts, pages, or any other custom post type and in RSS feeds.</li>\n<li>Choose the border style and background colour of the Biography Box</li>\n<li>Choose the amount of user profile information displayed in the Biography Box</li>\n<li>Choose the avatar image size</li>\n<li>Choose to display the Biography Box at the top or the bottom of content (universally)</li>\n<li>Choose to hide the display of the Biography Box for pages, posts and posts/pages on a per user basis</li>\n<li>Choose whether to display the Biography Box in the sidebar of your blog.</li>\n</ol>\n<p>The plugin expands and enhances the Contact Info section of your user profile, adding support for Twitter, Facebook, LinkedIn, Google+, Delicious, Flickr, Picasa, Vimeo, YouTube and Reddit profile links as well as Yahoo! Messenger, AIM, Windows Live Messenger and Jabber/Google Talk instant messaging profiles. Your Contact Info links can then be displayed as part of the Biography Box, either as plain text links or as icon links. Further contact links can easily be added to the Biography Box by using the <code>wp_biographia_contact_info</code> and <code>wp_biographia_link_items</code> filters.</p>\n<p>The position of the Biography Box can be controlled by the plugin&#8217;s supported settings and options, or manually via the plugin&#8217;s shortcode (<code>[wp_biographia]</code>) (see the <em>Shortcode Support And Usage</em> section for more information) or via template tags in your theme&#8217;s template files (see the <em>Template Tags</em> section for more information).</p>\n<p>The position and content of the Biography Box, including adding support for new contact links, changing the content of the Biography Box when displayed via the shortcode, the format of the contact links and the overall format of the Biography Box can be modified by the plugin&#8217;s filters. See the <em>Filter Support And Usage</em> section for more information.</p>\n<p>The plugin also supports displaying a reduced version of the Biography Box via a sidebar widget and provides a shorter, more terse, biography in the user&#8217;s Profile to prevent the full length biography text taking up too much space on the sidebar.</p>\n<h3>Shortcode Support And Usage</h3>\n<p>WP Biographia supports a single shortcode, <code>[wp_biographia]</code>. Adding this shortcode to the content of a post or page or into a theme template as content, expands the shortcode and replaces it with a Biography Box.</p>\n<p>The shortcode also supports multiple <em>attributes</em> which allow you to customise the way in which the shortcode is expanded into the Biography Box:</p>\n<ul>\n<li>the <code>mode</code> attribute</li>\n<li>the <code>user</code> attribute</li>\n<li>the <code>author</code> attribute <em>(deprecated)</em></li>\n<li>the <code>role</code> attribute</li>\n<li>the <code>order</code> attribute</li>\n<li>the <code>prefix</code> attribute</li>\n<li>the <code>name</code> attribute</li>\n<li>the <code>type</code> attribute</li>\n</ul>\n<h4>The &#8220;mode&#8221; Attribute</h4>\n<p>In <code>raw</code> mode, which is the default (specified as <code>[wp_biographia mode=\"raw\"]</code> or simply as <code>[wp_biographia]</code>), the plugin inserts the Biography Box in <em>you&#8217;ve asked for it, you&#8217;ve got it</em> mode.</p>\n<p>Or to put it another way, the plugin will honour the settings that you specify under <em>Dashboard / Settings/ WP Biographia</em> for <em>Biography Box Style Settings</em> and for <em>Biography Box Content Settings</em> but will ignore the <em>Biography Box Display Settings</em> and <em>Biography Box Per User Settings</em>.</p>\n<p>In <code>configured</code> mode, specified as <code>[wp_biographia mode=\"configured\"]</code>, the plugin inserts the Biography Box and will honour all the settings under <em>Dashboard / Settings / WP Biographia</em> with the exception of <em>Display On Front Page</em>, <em>Display On Individual Post</em>, <em>Display On Post Archives</em> and <em>Display On Individual Pages</em>, as well as their equivalents for any custom post types you may have created.</p>\n<p>The thinking behind this is that you probably want to honour post or page exclusions and per user exclusions, but by using the shortcode in your posts, you want to be in control of how and where the Biography Box is displayed.</p>\n<h4>The &#8220;user&#8221; Attribute</h4>\n<p>If the <code>user</code> attribute is omitted, which is the default, the shortcode assumes it&#8217;s being used within the <a href=\"https://codex.wordpress.org/The_Loop\" rel=\"nofollow ugc\">WordPress Loop</a> and will display the Biography Box once for the current post&#8217;s, page&#8217;s or custom post type&#8217;s user.</p>\n<p>Specifying a user&#8217;s login name as the <code>user</code> attribute overrides this behaviour and allows multi-user sites to use the plugin to create a <em>contributors</em> page, where you use the shortcode as <code>[wp_biographia user=\"login-name\"]</code> once for each of your site&#8217;s users that you want to appear, replacing <code>\"login-name\"</code> with a valid login name for one of your users.</p>\n<p>You call also use the <code>user</code> attribute in <em>wildcard</em> mode, specifying the user&#8217;s login name as <code>*</code> as <code>[wp_biographia user=\"*\"]</code>; this will then loop over all of the users that have logins on your site, displaying the Biography Box once for each user, ordered alphabetically by login name.</p>\n<p>Specifying an invalid login name (<code>[wp_biographia user=\"idontexist\"]</code>) will result in no Biography Box being displayed. Specifying an empty login name (<code>[wp_biographia user=\"\"]</code>) will cause the <code>user</code> attribute to be ignored and may result in undefined behaviour, such as a partially populated Biography Box being displayed as the shortcode is being used outside of the Loop and thus no user information is made available to the plugin by WordPress.</p>\n<h4>The &#8220;author&#8221; Attribute</h4>\n<p>The <code>author</code> attribute is now deprecated in favour of the <code>user</code> attribute introduced in v3.2.0 of the plugin. If the <code>author</code> attribute is used and no <code>user</code> attribute is present, the <code>author</code> attribute will act in the same way as the <code>user</code> attribute, described above. If both the <code>user</code> and <code>author</code> attributes are present, the <code>author</code> attribute will be ignored in favour of the <code>user</code> attribute.</p>\n<p>In other words, if you use the shortcode and supply both the <code>author</code> and <code>user</code> attributes, such as <code>[wp_biographia author=\"foo\" user=\"bar\"]</code>, the Biography Box will be displayed for the user <code>bar</code>, not the user <code>foo</code>. Likewise, <code>[wp_biographia user=\"*\" author=\"foo\"]</code> will display the Biography Box in <em>wildcard</em> mode, not for the user <code>foo</code>.</p>\n<p>Support for the <code>author</code> attribute will be likely be removed in a future release of the plugin to avoid confusion over the <code>author</code> and <code>user</code> attributes.</p>\n<h4>The &#8220;role&#8221; Attribute</h4>\n<p>Valid only when used in conjunction with the <code>user</code> attribute in <em>wildcard</em> mode, the <code>role</code> attribute allows you to filter the users that have user accounts on your blog according to their <a href=\"https://codex.wordpress.org/Roles_and_Capabilities\" rel=\"nofollow ugc\">WordPress Role</a>. The <code>role</code> attribute takes one or more comma separated arguments which define the WordPress role(s); at the time of writing, these can be one of:</p>\n<ul>\n<li><code>administrator</code></li>\n<li><code>editor</code></li>\n<li><code>author</code></li>\n<li><code>contributor</code></li>\n<li><code>subscriber</code></li>\n</ul>\n<p>For example, if you want to display the Biography Box for all users of your blog who have a role of <code>author</code> you can use the <code>role</code> attribute plus the <code>author</code> attribute in <em>wildcard</em> mode to do this, along the lines of <code>[wp_biographia user=\"*\" role=\"author\"]</code>. If you want to display the Biography Box for all users with a role of <code>author</code> or <code>contributor</code>, you can specify both roles, along the lines of <code>[wp_biographia user=\"*\" role=\"author,contributor\"]</code>.</p>\n<p>Specifying an invalid role (<code>[wp_biographia user=\"*\" role=\"foo\"])</code> will result in no Biography Box being displayed. Specifying the <code>role</code> attribute without the <code>user</code> attribute in <em>wildcard</em> mode will have no effect.</p>\n<h4>The &#8220;order&#8221; Attribute</h4>\n<p>Valid only when used in conjunction with the <code>user</code> attribute in <em>wildcard</em> mode, the <code>order</code> attribute allows you to specify the display order for the users that have user accounts on your blog. The <code>order</code> attribute takes a single argument which defines the sorting order; at the time of writing, this can be one of:</p>\n<ul>\n<li><code>account-name</code> <em>(the default)</em></li>\n<li><code>first-name</code></li>\n<li><code>last-name</code></li>\n<li><code>nickname</code></li>\n<li><code>display-name</code></li>\n<li><code>login-id</code></li>\n</ul>\n<p>For example, if you want to display the Biography Box for all users of your blog ordered according to their last name you can use the <code>order</code> attribute plus the <code>author</code> attribute in <em>wildcard</em> mode to do this, along the lines of <code>[wp_biographia user=\"*\" order=\"last-name\"]</code>.</p>\n<p>Specifying an invalid role (<code>[wp_biographia user=\"*\" order=\"foo\"])</code> will result in the default account name sort order being used. Specifying the <code>order</code> attribute without the <code>user</code> attribute in <em>wildcard</em> mode will have no effect.</p>\n<p>It&#8217;s important to note that the in order to successfully sort by <code>first-name</code> or by <code>last-name</code>, the <em>First Name</em> and/or <em>Last Name</em> fields must be populated in each user&#8217;s Profile; by default, these fields are not populated during the creation of a user&#8217;s WordPress account. The sorting of the user accounts when the <code>order</code> attribute is specified uses <a href=\"http://sourcefrog.net/projects/natsort/\" rel=\"nofollow ugc\"><em>natural order string comparison</em></a>, which means than an empty <em>First Name</em> or <em>Last Name</em> will appear <strong>before</strong> a <em>First Name</em> or <em>Last Name</em> which actually contains a value. If your WordPress site doesn&#8217;t have these name fields populated in your user&#8217;s Profiles, you may not see the sorting results you expect.</p>\n<h4>The &#8220;prefix&#8221; Attribute</h4>\n<p>If the <code>prefix</code> attribute is omitted, which is the default, the Biography Box will be displayed with <em>Biography Prefix</em> text configured in <em>Settings/ WP Biographuia / Biography Box Content Settings</em> before the user&#8217;s name. This can be overridden by using the <code>prefix</code> attribute, along the lines of <code>[wp_biographia prefix=\"All About\"]</code>.</p>\n<h4>The &#8220;name&#8221; Attribute</h4>\n<p>If the <code>name</code> attribute is omitted, which is the default, the Biography Box will be displayed with the user&#8217;s name as configured by <em>User&#8217;s Name</em> in <em>Settings / WP Biographia /Biography Box Content Settings</em>. This can be overriden by supplying one of the following for the <code>name</code> attribute&#8217;s argument:</p>\n<ul>\n<li><code>account-name</code></li>\n<li><code>first-last-name</code></li>\n<li><code>nickname</code></li>\n<li><code>display-name</code></li>\n<li><code>none</code></li>\n</ul>\n<h4>The &#8220;type&#8221; Attribute</h4>\n<p>If the <code>type</code> attribute is omitted, which is the default, the Biography Box will be displayed with the user&#8217;s full biography text, taken from the <em>Biographical Info</em> field in the user&#8217;s profile. If the <code>type</code> attribute is specified with a value of <code>full</code>, this is equivalent to the default behaviour. If the <code>type</code> attribute is specified with a value of <code>excerpt</code>, the <em>Biographical Excerpt</em> field in the user&#8217;s profile will be used instead, providing the user has filled out this field in their profile. Specifying an invalid <code>type</code> attribute value (<code>[wp_biographia type=\"foo\"]</code>) will result in the default behaviour of the full biography being used.</p>\n<h3>Filter Support And Usage</h3>\n<p>WP Biographia supports multiple filters, which are described in more detail below. The plugin&#8217;s filters allow you to:</p>\n<ul>\n<li>change the default set of installation settings and options at plugin activation time</li>\n<li>modify and/or enhance the set of contact information fields the plugin adds to the user&#8217;s profile</li>\n<li>modify and/or enhance the contact links that are added to the Biography Box by the plugin</li>\n<li>modify the position of the Biography Box to before or after the post content returned by <code>the_content()</code> and/or <code>the_excerpt()</code></li>\n<li>hide the display of the Biography Box entirely under user-defined circumstances</li>\n<li>modify and/or enhance the Biography Box that is produced by the <code>[wp_biographia]</code> shortcode</li>\n<li>modify and/or enhance the format and content of the contact links that are added to the Biography Box by the plugin</li>\n<li>modify and/or enhance the Biography Box that is produced for an RSS feed</li>\n<li>modify and/or enhance the entirety of the Biography Box</li>\n</ul>\n<h4>wp_biographia_default_settings</h4>\n<p>Applied to the default set of plugin settings and options. Note that this filter is called once, upon plugin activation, when there are no WP Biographia settings/options existing in the database.</p>\n<p><em>Example:</em> Add the date and time that the plugin was first activated</p>\n<pre><code>add_filter ('wp_biographia_default_settings', 'add_activation_timestamp');\n\nfunction add_activation_timestamp ($options) {\n    // options = array (option name =&gt; option value)\n    $options['plugin_activation_timestamp'] = date (DATE_ATOM);\n\n    return $options;\n}\n</code></pre>\n<h4>wp_biographia_contact_info</h4>\n<p>Applied to the default set of contact information fields that are added to an user&#8217;s profile by the plugin. Note that in order to add and display a new contact link to the Biography Box, the contact link must be added to the value returned by the <code>wp_biographia_link_items</code> filter as well as the value returned by this filter.</p>\n<p><em>Example:</em> Add Pinterest as a supported contact information field</p>\n<pre><code>add_filter ('wp_biographia_contact_info', 'add_pinterest_support');\n\nfunction add_pinterest_support ($contacts) {\n    // contacts = array (field =&gt; array (field =&gt; field-name, contactmethod =&gt; description))\n    $contacts['pinterest'] = array (\n        'field' =&gt; 'pinterest',\n        'contactmethod' =&gt; __('Pinterest')\n    );\n\n    return $contacts;\n}\n</code></pre>\n<h4>wp_biographia_link_items</h4>\n<p>Applied to the default set of contact links that are added to the Biography Box by the plugin. Note that in order to add and display a new contact link, the contact information field must be added to the value returned by the <code>wp_biographia_contact_info</code> filter as well as the value returned by this filter. Note that <code>$icon_dir_url</code> will by default contain the URL of the images directory within the plugin directory, which will look something like <code>/wp-content/plugins/wp-biographia/images/</code> (the trailing slash is important). If an alternate icon directory has been specified in the plugin&#8217;s settings and options, then <code>$icon_dir_url</code> will contain this alternate, configured, directory URL. If the icon you want to add for a new contact link doesn&#8217;t reside in the directory URL mentioned previously, you&#8217;ll need to set <code>$icon_dir_url</code> to point to your own custom location.</p>\n<p><em>Example:</em> Add Pinterest as a supported contact link in the Biography Box</p>\n<pre><code>add_filter ('wp_biographia_link_items', 'add_pinterest_link', 2);\n\nfunction add_pinterest_link ($links, $icon_dir_url) {\n    // links = array (field =&gt; array (link_title =&gt; title, link_text =&gt; text, link_icon =&gt; URL)\n    $links['pinterest'] = array (\n        'link_title' =&gt; __('Pinterest'),\n        'link_text' =&gt; __('Pinterest'),\n        'link_icon' =&gt; $icon_dir_url . 'pinterest.png'\n        );\n\n        return $links;\n}\n</code></pre>\n<h4>wp_biographia_pattern</h4>\n<p>Applied to the format string used to position the Biography Box before the post content or after the post content that is returned by <code>the_content()</code> and/or <code>the_excerpt()</code>.</p>\n<p><em>Example:</em> Insert a header between post content and Biography Box</p>\n<pre><code>add_filter ('wp_biographia_pattern', 'insert_biography_header');\n\nfunction insert_biography_header ($pattern) {\n    return '%1$s&lt;p class=\"biography-header\"&gt;About The User&lt;/p&gt;%2$s';\n}\n</code></pre>\n<h4>wp_biographia_pre</h4>\n<p>Allows display of the Biography Box to be hidden under user-defined circumstances. This only affects the display of the Biography Box that is configured via the plugin&#8217;s admin screen or via the shortcode in configured mode.</p>\n<p><em>Example:</em> Hide the Biography Box</p>\n<pre><code>add_filter ('wp_biographia_pre', 'hide_biography_box');\n\nfunction hide_biography_box ($flag) {\n    return true;\n}\n</code></pre>\n<h4>wp_biographia_shortcode</h4>\n<p>Applied to the current instance of the Biography Box that is produced via the <code>[wp_biographia]</code> shortcode.</p>\n<p><em>Example:</em> Apply shortcode specific CSS to the Biography Box</p>\n<pre><code>add_filter ('wp_biographia_links', 'add_shortcode_css', 10, 2);\n\nfunction add_shortcode_css ($content, $params) {\n    // params = array (mode =&gt; shortcode-mode, user =&gt; author-id, prefix =&gt; prefix-string,\n                        name =&gt; name-option)\n\n    return '&lt;div class=\"custom-shortcode-css\"&gt;' . $content . '&lt;/div&gt;';\n}\n</code></pre>\n<h4>wp_biographia_content_title</h4>\n<p>Applied to the title of the Biography Box.</p>\n<p><em>Example:</em> Override the name prefix for all uses of the Biography Box.</p>\n<pre><code>add_filter ('wp_biographia_content_title', 'override_name_prefix', 10, 3);\nfunction override_name_prefix ($content, $name_prefix, $formatted_name) {\n    return 'This is ' . $formatted_name;\n}\n</code></pre>\n<h4>wp_biographia_links</h4>\n<p>Applied to the formatted set of contact links for the current instance of the Biography Box.</p>\n<p><em>Example:</em> Replace the default text link separator character (the pipe symbol &#8220;|&#8221;) with a dash (&#8220;-&#8220;).</p>\n<pre><code>add_filter ('wp_biographia_links', 'replace_link_separator', 10, 3);\n\nfunction replace_link_separator ($content, $links, $params) {\n    // links = array (link-item)\n    // params = array (glue =&gt; separator-string, class =&gt; link-item-css-class-name,\n    //                  prefix =&gt; links-prefix-html, postfix =&gt; links-postfix-html)\n\n    return str_replace ($params['glue'], ' - ', $content);\n}\n</code></pre>\n<p><em>Example:</em> Wrap the formatted content links in an additional HTML div.</p>\n<pre><code>add_filter ('wp_biographia_links', 'wrap_links', 10, 3);\n\nfunction wrap_links ($content, $links, $params) {\n    // links = array (link-item)\n    // params = array (glue =&gt; separator-string, class =&gt; link-item-css-class-name,\n    //                  prefix =&gt; links-prefix-html, postfix =&gt; links-postfix-html)\n\n    $new_prefix = '&lt;div class=\"custom-link-class\"&gt;' . $params['prefix'];\n    $new_postfix = $params['postfix'] . '&lt;/div&gt;';\n\n    return $new_prefix . implode ($params['glue'], $links) . $new_postfix;\n}\n</code></pre>\n<h4>wp_biographia_link_item</h4>\n<p>Applied to each active contact link, in the order in which they are processed by the plugin.</p>\n<p><em>Example:</em> Force all links that point to the current site to open in a new window.</p>\n<pre><code>add_filter ('wp_biographia_link_item', 'filter_link_item', 10, 2);\n\nfunction filter_link_item ($content, $params) {\n    // $params = array (\n    //      'type' =&gt; 'link type (icon|text)',\n    //      'format' =&gt; 'link format string',\n    //      'meta' =&gt; 'additional anchor attributes',\n    //      'title' =&gt; 'link title',\n    //      'url' =&gt; 'link URL',\n    //      'body' =&gt; 'link body text',\n    //      'link-class' =&gt; 'link CSS class name',\n    //      'item-class' =&gt; 'link item CSS class name (icons only)'\n    //  );\n\n    $site_url = site_url ();\n    $pos = strpos ($params['url'], $site_url);\n    if ($pos !== false) {\n        $params['meta'] = 'target=\"_blank\"';\n    }\n\n    if ($params['type'] === 'icon') {\n        $content = sprintf ($params['format'], $params['url'], $params['meta'], $params['title'], $params['link-class'], $params['body'], $params['item-class']);\n    }\n\n    else {\n        $content = sprintf ($params['format'], $params['url'], $params['meta'], $params['title'], $params['link-class'], $params['body']);\n    }\n\n    return $content;\n}\n</code></pre>\n<h4>wp_biographia_feed</h4>\n<p>Applied to the current instance of the Biography Box that is produced via the site&#8217;s RSS feed.</p>\n<p><em>Example:</em> Apply RSS feed specific CSS to the Biography Box</p>\n<pre><code>add_filter ('wp_biographia_feed', 'add_feed_css');\n\nfunction add_feed_css ($content) {\n    return '&lt;div class=\"custom-feed-css\"&gt;' . $content . '&lt;/div&gt;';\n}\n</code></pre>\n<h4>wp_biographia_biography_box</h4>\n<p>Applied to the entire content of the current instance of the Biography Box.</p>\n<p><em>Example:</em> Remove all WP Biographia CSS classes commencing <code>wp-biographia-</code> and replace them with custom CSS classes that adhere to the plugin&#8217;s CSS class naming convention.</p>\n<pre><code>add_filter ('wp_biographia_biography_box', 'replace_css_classes', 10, 2);\n\nfunction replace_css_classes ($biography, $items) {\n    $new_content = array ();\n\n    foreach ($items as $item) {\n        $new_content[] = str_replace ('wp-biographia-', 'custom-', $item);\n    }\n\n    return implode ('', $new_content);\n}&lt;h3&gt;Template Tags&lt;/h3&gt;\n</code></pre>\n<p>WP Biographia supports two <a href=\"https://codex.wordpress.org/Template_Tags\" rel=\"nofollow ugc\">template tags</a> that can be used in your theme&#8217;s template files. These are described in more detail below; for a full description of the use of each tag&#8217;s argument, see the <em>Shortcode Support And Usage</em> section. The plugin&#8217;s tags allow you to:</p>\n<ul>\n<li>produce the Biography Box and assign the HTML for the Biography Box to a string.</li>\n<li>produce the Biography Box and echo the results immediately.</li>\n</ul>\n<h4>wpb_get_biography_box</h4>\n<p><em>Description:</em> Retrieves the Biography Box. This template tags renders the Biography Box and returns it to the caller as a string. To display the Biography Box immediately, use the <code>wpb_the_biography_box</code> template tag.</p>\n<p><em>Usage:</em></p>\n<pre><code>&lt;?php $biography_box = wpb_get_biography_box ($mode, $user, $prefix, $name, $role, $type, $order); ?&gt;\n</code></pre>\n<p><em>Parameters:</em></p>\n<ul>\n<li><code>$mode</code> &#8211; (string) (<em>optional</em>) Override the Biography Box mode (<code>raw</code>|<code>configured</code>). Default: <code>raw</code>.</li>\n<li><code>$user</code> &#8211; (string) (<em>optional</em>) Override the source user (<code>login-name</code>|<code>*</code>). Default: the current user&#8217;s login name.</li>\n<li><code>$prefix</code> &#8211; (string) (<em>optional</em>) Override the Biography Box title prefix. Default: use the plugin&#8217;s settings.</li>\n<li><code>$name</code> &#8211; (string) (<em>optional</em>) Override the selected user&#8217;s name format (<code>account-name</code>|<code>first-last-name</code>|<code>nickname</code>|<code>display-name</code>|<code>none</code>). Default: use the plugin&#8217;s settings.</li>\n<li><code>$role</code> &#8211; (string) (<em>optional</em>) Override the selected user&#8217;s role when used in <em>wildcard mode</em>. Specify one or more of the following, as a comma separated list (<code>administrator</code>|<code>editor</code>|<code>author</code>|<code>contributor</code>|<code>subscriber</code>). Default: none.</li>\n<li><code>$type</code> &#8211; (string) (<em>optional</em>) Override the type of the biography text (<code>full</code>|<code>excerpt</code>). Default: use the plugin&#8217;s settings.</li>\n<li><code>$order</code> &#8211; (string) (<em>optional</em>) Override the sort order when used in <em>wildcard mode</em> (<code>account-name</code>|<code>first-name</code>|<code>last-name</code>|<code>nickname</code>|<code>display-name</code>|<code>login-id</code>). Default: <code>account-name</code>.</li>\n</ul>\n<h4>wpb_the_biography_box</h4>\n<p><em>Description:</em> Displays the Biography Box. This template tags renders the Biography Box and displays it immediately. To get the current Biography Box as a string, use the <code>wpb_get_biography_box</code> template tag.</p>\n<p><em>Usage:</em></p>\n<pre><code>&lt;?php wpb_the_biography_box ($mode, $user, $prefix, $name, $role, $type, $order); ?&gt;\n</code></pre>\n<p><em>Parameters:</em></p>\n<ul>\n<li><code>$mode</code> &#8211; (string) (<em>optional</em>) Override the Biography Box mode (<code>raw</code>|<code>configured</code>). Default: <code>raw</code>.</li>\n<li><code>$user</code> &#8211; (string) (<em>optional</em>) Override the source user (<code>login-name</code>|<code>*</code>). Default: the current user&#8217;s login name.</li>\n<li><code>$prefix</code> &#8211; (string) (<em>optional</em>) Override the Biography Box title prefix. Default: use the plugin&#8217;s settings.</li>\n<li><code>$name</code> &#8211; (string) (<em>optional</em>) Override the selected user&#8217;s name format (<code>account-name</code>|<code>first-last-name</code>|<code>nickname</code>|<code>display-name</code>|<code>none</code>). Default: use the plugin&#8217;s settings.</li>\n<li><code>$role</code> &#8211; (string) (<em>optional</em>) Override the selected user&#8217;s role when used in <em>wildcard mode</em>. Specify one or more of the following, as a comma separated list (<code>administrator</code>|<code>editor</code>|<code>author</code>|<code>contributor</code>|<code>subscriber</code>). Default: none.</li>\n<li><code>$type</code> &#8211; (string) (<em>optional</em>) Override the type of the biography text (<code>full</code>|<code>excerpt</code>). Default: use the plugin&#8217;s settings.</li>\n<li><code>$order</code> &#8211; (string) (<em>optional</em>) Override the sort order when used in <em>wildcard mode</em> (<code>account-name</code>|<code>first-name</code>|<code>last-name</code>|<code>nickname</code>|<code>display-name</code>|<code>login-id</code>). Default: <code>account-name</code>.</li>\n</ul>\n",
        "installation": "<ol>\n<li>You can install WP Biographia automatically from the WordPress admin panel. From the Dashboard, navigate to the <em>Plugins / Add New</em> page and search for <em>&#8220;WP Biographia&#8221;</em> and click on the <em>&#8220;Install Now&#8221;</em> link.</li>\n<li>Or you can install WP Biographia manually. Download the plugin Zip archive and uncompress it. Copy or upload the <code>wp-biographia</code> folder to the <code>wp-content/plugins</code> folder on your web server.</li>\n<li>Activate the plugin. From the Dashboard, navigate to Plugins and click on the <em>&#8220;Activate&#8221;</em> link under the entry for WP Biographia.</li>\n<li>Enhance your WordPress user profile. From the Dashboard, navigate to Users and click on the &#8220;Edit&#8221; link under your profile.</li>\n<li>Edit your WordPress user profile. Add your biography to the <em>&#8220;Biographical Info&#8221;</em> text box. WP Biographia also adds to the list of Contact Info you can associate with your profile, adding support for Twitter, Facebook, LinkedIn and Google+ and other contact profiles. Click on the <em>&#8220;Update Profile&#8221;</em> link to save your changes.</li>\n<li>Customise and configure what information WP Biographia displays; From the Dashboard, navigate to the <em>Settings / WP Biographia</em> page or click on the <em>&#8220;Settings&#8221;</em> link from the Plugins page on the Dashboard.</li>\n<li>You can can control display settings, style settings and content settings for the Biography Box.</li>\n<li>Click on the <em>&#8220;Save Changes&#8221;</em> button to preserve your chosen settings and options.</li>\n<li>If you enable the display of the post user&#8217;s image, make sure avatar support is turned on; from the Dashboard, navigate to <em>Settings / Discussion</em> and ensure that <em>Show Avatars</em> is enabled. Don&#8217;t forget to save your changes.</li>\n<li>Users with the <code>manage_options</code> capability can edit their profile via <em>Users / Your Profile</em> from the Dashboard to hide the display of the Biography Box on posts and/or on pages and also the profiles of other users via the <em>Users / All Users / Edit</em> from the Dashboard.</li>\n<li>Hiding of the display of the Biography Box on posts and/or on pages can also be configured from the Dashboard; navigate to <em>Settings / WP Biographia / Biography Box Display Settings</em> and click on the <em>Exclusions</em> tab.</li>\n</ol>\n",
        "faq": "\n<h4>\nHow do I get help or support for this plugin?\n</h4>\n<p>\n<p>In short, very easily. But before you read any further, take a look at <a href=\"https://www.vicchi.org/2012/03/31/asking-for-wordpress-plugin-help-and-support-without-tears/\" rel=\"nofollow ugc\">Asking For WordPress Plugin Help And Support Without Tears</a> before firing off a question. In order of preference, you can ask a question on the <a href=\"https://wordpress.org/support/plugin/wp-biographia\" rel=\"ugc\">WordPress support forum</a>; this is by far the best way so that other users can follow the conversation. You can ask me a question on Twitter; I&#8217;m <a href=\"http://twitter.com/vicchi\" rel=\"nofollow ugc\">@vicchi</a>. Or you can drop me an email instead. I can&#8217;t promise to answer your question but I do promise to answer and do my best to help.</p>\n</p>\n<h4>\nIs there a web site for this plugin?\n</h4>\n<p>\n<p>Absolutely. Go to the <a href=\"https://www.vicchi.org/wp-biographia/\" rel=\"nofollow ugc\">WP Biographia home page</a> for the latest information. There&#8217;s also the official <a href=\"https://wordpress.org/extend/plugins/wp-biographia/\" rel=\"ugc\">WordPress plugin repository page</a> and the <a href=\"http://vicchi.github.com/wp-biographia/\" rel=\"nofollow ugc\">source for the plugin is on GitHub</a> as well.</p>\n</p>\n<h4>\nI&#8217;ve configured WP Biographia to display the user&#8217;s image but it&#8217;s not working; what&#8217;s happening here?\n</h4>\n<p>\n<p>User profile pictures, or avatars, are part of the WordPress core but enabling them isn&#8217;t done at the level of the user profile, instead it&#8217;s part of the way in which comments are configured. If you enable the display of the post user’s image, make sure avatar support is turned on; from the Dashboard, navigate to <em>Settings / Discussion</em> and ensure that <em>Show Avatars</em> is enabled. WordPress uses the email address that is part of your user&#8217;s profile to look up the right avatar image from <a href=\"http://gravatar.com/\" rel=\"nofollow ugc\">gravatar.com</a>, so you need to ensure that you&#8217;re using the same email address on your site as well as for your avatar.</p>\n</p>\n<h4>\nI want to upload my user&#8217;s images, host them on my web server and not use Gravatars; how do I do this?\n</h4>\n<p>\n<p>WP Biographia uses the <code>get_avatar</code> <a href=\"https://codex.wordpress.org/Pluggable_Functions\" rel=\"nofollow ugc\">pluggable function</a> to output the user&#8217;s avatar image. Theoretically, any plugin that supports locally hosted avatar images and which overrides the default WordPress implementation of <code>get_avatar</code> should be able to be used. In practice, whether this approach will work for you or not depends on the combination of the theme you&#8217;re using and the interactions that the other plugins that you&#8217;re using has with the WordPress core and with your theme. The <a href=\"https://wordpress.org/extend/plugins/simple-local-avatars/\" rel=\"ugc\">Simple Local Avatars</a> plugin plugs <code>get_avatar</code> and cooperates nicely with WP Biographia, at least in my local testing environment; your mileage may vary.</p>\n</p>\n<h4>\nI&#8217;ve configured WP Biographia to show my website/Twitter/Facebook/etc links but I don&#8217;t see them in the Biography Box; where do I define these links?\n</h4>\n<p>\n<p>WP Biographia adds a number of social media and web link fields to your WordPress user profile; from the Dashboard, navigate to <em>Users / Your Profile</em> and enter the links you want displayed to the fields in the Contact Info section.</p>\n</p>\n<h4>\nI&#8217;ve installed and configured WP Biographia and now I see not one but two differing Biography Boxes; what&#8217;s going on?\n</h4>\n<p>\n<p>There&#8217;s probably one of two things going on here. Firstly, you&#8217;ve already got another plugin that makes a Biography Box installed and active and this plugin, as well as WP Biographia, are doing their job properly. Secondly, the theme you&#8217;re using hard codes a Biography Box into the theme templates. Both the TwentyTen and TwentyEleven themes supplied as part of a standard WordPress install do this.</p>\n</p>\n<h4>\nI only want to show the Biography Box for certain users and not for others; can I do this?\n</h4>\n<p>\n<p>WP Biographia allows you to hide the Biography Box from being displayed on a per user basis. You can hide for posts only, for pages only or for both posts and pages. There&#8217;s two ways of configuring this. If your user has the <code>manage_options</code> capability, you can choose the degree of hiding, if any, from your user profile or for any other user&#8217;s profile; from the Dashboard, navigate to Users and check the <em>Hide From Posts</em> and/or <em>Hide From Pages</em> checkbox options. You can also configure this easily from the plugin&#8217;s Settings And Options; from the Dashboard, navigate to the <em>Settings / WP Biographia</em> page, click on the <em>Exclusions</em> tab and under <em>User Hiding Settings</em>, add and/or remove the users to fit your model of who should have the Biography Box displayed.</p>\n</p>\n<h4>\nI want to show the Biography Box for all users but only for certain categories; can I do this?\n</h4>\n<p>\n<p>From the Dashboard, navigate to the <em>Settings / WP Biographia</em> page, click on the <em>Exclusions</em> tab and under <em>Category Exclusion Settings</em>, add and/or remove the categories to fit your model of when the Biography Box should be displayed.</p>\n</p>\n<h4>\nHow do I add HTML to the Biographical Info section of a user&#8217;s profile?\n</h4>\n<p>\n<p>In previous releases of the plugin, I&#8217;ve recommended that you add this code to your theme&#8217;s <code>functions.php</code> file:</p>\n<pre><code>remove_filter('pre_user_description', 'wp_filter_kses');\n</code></pre>\n<p>But as <a href=\"https://wordpress.org/support/profile/munman\" rel=\"ugc\">WebEndev</a> helpfully pointed out on the <a href=\"https://wordpress.org/support/topic/plugin-wp-biographia-biographical-info-formatting-issue-avatar-exclude-posts?replies=7#post-2562773\" rel=\"ugc\">WordPress forums</a>, this allows <em>all</em> HTML to be added to the Biography Info section of a user&#8217;s profile, which may be going <em>too</em> far. The following code, in your theme&#8217;s <code>functions.php</code>, will allow line breaks to be honoured but filter out any HTML tags and attributes which are not allowed by the <code>$allowedposttags</code> WordPress global.</p>\n<pre><code>remove_filter('pre_user_description', 'wp_filter_kses');\nadd_filter('pre_user_description', 'wp_filter_post_kses');\nadd_filter('pre_user_description', 'wptexturize');\nadd_filter('pre_user_description', 'wpautop');\nadd_filter('pre_user_description', 'convert_chars');\nadd_filter('pre_user_description', 'balanceTags', 50);\n</code></pre>\n</p>\n<h4>\nHow do I remove the bio on pages using page templates?\n</h4>\n<p>\n<p>Add this code to your theme&#8217;s <code>functions.php</code> file:</p>\n<pre><code>add_action ('wp_head', 'remove_user_box_page_template');\n\nfunction remove_user_box_page_template() {\n  if (is_page_template ('page_blog.php'))\n        add_filter ('wp_biographia_pattern' , 'content_only_pattern');\n}\n\nfunction content_only_pattern($pattern) {\n    return '%1s';\n}\n</code></pre>\n</p>\n<h4>\nI want to use my own icon set for my user&#8217;s contact links; how do I do this?\n</h4>\n<p>\n<p>Firstly select the icon set you want to use. You&#8217;ll need to ensure that the icon files are in <code>.png</code> format and are named to match the icon set that WP Biographia ships with; take a look in <code>wp-biographia/images</code> to see the naming convention. Upload your icon set to your web server and note the URL (not the local path) to where your icons will live. Navigate to <em>Settings / WP Biographia</em> and click on the <em>Content</em> tab, ensure that the <em>Use Alternate Icon Set</em> option is checked and the URL to your alternate icons is specified in the <em>Alternate Icon Set URL</em> text box. By default, WP Biographia sizes the contact link icons at 32&#215;32 pixels; you can override this in your local CSS file by redefining the <code>.wp-biographia-item-icon</code> CSS class (see <code>wp-biographia/css/wp-biographia.css</code>).</p>\n<p>You can also override the icon file name and source URL on a per contact link basis via the <code>$icon_url_dir</code> parameter via the <code>wp_biographia_link_items</code> filter.</p>\n<p>So to recap, the plugin uses its own default set of icons, followed by the <em>Alternate Icon Set URL</em> to allow you to point to an entire alternate set of icons, if the supplied ones aren&#8217;t to your liking, followed by link specific overrides via the <code>wp_biographia_link_items</code> filter. The order of precedence looks something like &#8230;</p>\n<ol>\n<li>the plugin&#8217;s icon set &#8211; for all icons &#8211; typically this is <code>/wp-content/plugins/wp-biographia/images</code>.</li>\n<li>the alternate icon set &#8211; for all icons (even added via the filter, if no override takes place on <code>$icon_url_dir</code>)</li>\n<li>an override of the icon set URL for the single contact method you&#8217;re adding via <code>wp_biographia_link_items</code> (assuming it&#8217;s also added via <code>wp_biographia_contact_info</code>)</li>\n</ol>\n<p>See the <em>Filter Support And Usage</em> section for more information on the plugin&#8217;s filters.</p>\n</p>\n<h4>\nI want to change the CSS used to format the Biography Box; how do I do this?\n</h4>\n<p>\n<p>The HTML and CSS classes that the plugin emits follows a consistent structure and naming convention. See <a href=\"https://www.vicchi.org/2012/04/05/hacking-wp-biographias-appearance-with-css/\" rel=\"nofollow ugc\">Hacking WP Biographia’s Appearance With CSS</a> for more information.</p>\n</p>\n<h4>\nI&#8217;ve changed the Biography Box CSS but my changes aren&#8217;t showing up; what&#8217;s happening?\n</h4>\n<p>\n<p>WP Biographia uses <em>minified</em> CSS files to improve the speed at which a page loads. If you make changes to the plugin&#8217;s CSS in <code>/wp-content/plugins/wp-biographia/css/wp-biographia.css</code> the plugin will still load the minified version in <code>/wp-content/plugins/wp-biographia/css/wp-biographia.min.css</code>. So if you make any site specific changes to the plugin&#8217;s CSS, which isn&#8217;t recommended (see <a href=\"https://www.vicchi.org/2012/04/05/hacking-wp-biographias-appearance-with-css/\" rel=\"nofollow ugc\">Hacking WP Biographia’s Appearance With CSS</a>), you&#8217;ll need to ensure you (re)minify the master CSS to get the changes to be picked up by the plugin.</p>\n</p>\n<h4>\nWP Biographia doesn&#8217;t support social network FOO; can you add this to the next version?\n</h4>\n<p>\n<p><em>Yes</em>. But also <em>no</em>. One of the wonderful things about today&#8217;s web is the vast amount of ways we have to interact with each other. I can&#8217;t keep up. No, really. In practical terms, this would mean that the plugin&#8217;s settings and options panels would soon get out of hand, plus the overhead of adding, testing and releasing a new version of the plugin would get out of hand before the settings and options do. But &#8230; see the next FAQ for the answer.</p>\n</p>\n<h4>\nWP Biographia doesn&#8217;t support social network or contact method BAR; how can I add this?\n</h4>\n<p>\n<p>With the cunning use of the filters that WP Biographia supports, you can add support for as many social networks and/or contact methods as you like. You&#8217;ll need to do two things for each link you want to add to the plugin.</p>\n<ol>\n<li>In your theme&#8217;s <code>functions.php</code> add support for the new link to the user&#8217;s profile by way of the <code>wp_biographia_contact_info</code> filter.</li>\n<li>Still in your theme&#8217;s <code>functions.php</code> add support for the new link to be displayed, with an icon if you wish, via the <code>wp_biographia_link_items</code> filter.</li>\n</ol>\n<p>See the <em>Filter Support And Usage</em> section for a working example of these two filters to add support for a new contact link.</p>\n</p>\n<h4>\nThe &#8220;More Posts&#8221; link in the Biography Box links to my site&#8217;s landing page and not an author&#8217;s archive page; what&#8217;s happening?\n</h4>\n<p>\n<p>If you&#8217;re using an SEO plugin, this might be optimising out the <em>More Posts</em> link. Specifically, <a href=\"https://wordpress.org/extend/plugins/wordpress-seo/\" rel=\"ugc\">Yoast&#8217;s WordPress SEO</a> plugin has this side effect as this plugin allows you to enable/disable author archive pages. Thankfully, the SEO plugin has a setting called <em>Disable Author Archives</em> that, if disabled, allows WP Biographia to successfully link to an author&#8217;s archive page.</p>\n</p>\n<h4>\nThe Biography Box is showing up in places it shouldn&#8217;t; such as the footer or within widgets in the sidebar; why is this happening and how can I stop this?\n</h4>\n<p>\n<p><em>Why is this happening?</em> Some themes or plugins use the WordPress <code>the_content</code> and/or <code>the_excerpt</code> filters as part of a secondary query to select posts or pages to show as content in the theme&#8217;s sidebars, footers or as part of a plugin&#8217;s widget. As WP Biographia also uses these filters to add the Biography Box, this means that the Biography Box can sometimes show up unexpectedly, in places where it shouldn&#8217;t be.</p>\n<p><em>How can I stop this?</em> You can lock the plugin to run only in the context of the main WordPress Loop; in other words, WP Biographia will run when selecting posts or pages to be displayed on your site&#8217;s landing page, archive pages or any other template, but not when run in the context of a secondary query loop in a sidebar or footer. From the Dashboard, navigate to <em>Settings</em> / <em>WP Biographia</em> / <em>Admin</em> / <em>Content And Excerpt Settings</em> and ensure that the <em>Lock Display Of The Biography Box To The Main Loop</em> setting is checked.</p>\n</p>\n<h4>\nMy site features guest posts; can I override my contributor account&#8217;s biography for each of my guest authors?\n</h4>\n<p>\n<p>Yes. Firstly you&#8217;ll need to enable <em>post specific overrides</em> in the plugin. From the Dashboard, navigate to <em>Settings</em> / <em>WP Biographia</em> / <em>Admin</em> / <em>Biography Box Override Settings</em> and ensure that the <em>Enable Post Specific Overrides</em> setting is checked.</p>\n<p>Now edit a post or a page. In the Biography Box Post Options meta-box (for posts), or the Biography Box Page Options meta-box (for pages), you&#8217;ll find that four new settings are now visible.</p>\n<ul>\n<li><em>Override Biography Text For This Post</em> &#8211; checking this setting will show a text box, pre-populated with the currently logged in user&#8217;s biography, which can be overriden. If you want to revert to the currently logged in user&#8217;s biography, clicking on the <em>Reload Default Profile Biography</em> will reset your changes.</li>\n<li><em>Override Biography Title For This Post</em> &#8211; checking this setting will show a text box that can be used to override the default Biography Box title.</li>\n<li><em>Suppress Avatar For This Post</em> &#8211; checking this setting will stop the post or page&#8217;s author&#8217;s avatar from being displayed as part of the Biography Box.</li>\n<li><em>Suppress Contact Links For This Post</em> &#8211; checking this setting will stop the contact links being displayed as part of the Biography Box.</li>\n</ul>\n<p>All of the above settings are post or page specific; in other words they will only override the post or page that is currently being edited.</p>\n<p>The thinking behind these settings is that if you have guest posts, you&#8217;ll probably have one or more accounts with a <em>contributor</em> role. That account&#8217;s biography text, avatar or contact links won&#8217;t make much sense in the context of a guest post, so you can override them or suppress them in a way which does not impact the Biography Boxes produced for other users on your site.</p>\n</p>\n<h4>\nWP Biographia isn&#8217;t available in my language; can I submit a translation?\n</h4>\n<p>\n<p>WordPress and this plugin use the gettext tools to support internationalisation. The source file containing each string that needs to be translated ships with the plugin in <code>wp-biographia/lang/src/wp-biographia.po</code>. See the <a href=\"https://codex.wordpress.org/I18n_for_WordPress_Developers\" rel=\"nofollow ugc\">I18n for WordPress Developers</a> page for more information or get in touch for help and hand-holding.</p>\n</p>\n<h4>\nThis plugin looks very much like the WP About Author; what&#8217;s the connection?\n</h4>\n<p>\n<p>Version 1 of WP Biographia was inspired by and based on the <a href=\"https://wordpress.org/extend/plugins/wp-about-author/\" rel=\"ugc\">WP About Author</a> plugin by <a href=\"http://www.jonbishop.com/\" rel=\"nofollow ugc\">Jon Bishop</a>. Thanks and kudos must go to Jon for writing a well structured, working WordPress plugin released under a software license that enables other plugins such as this one to be written or derived in the first place. Jon&#8217;s written <a href=\"https://profiles.wordpress.org/users/JonBishop/\" rel=\"nofollow ugc\">other WordPress plugins</a> as well; you should take a look.</p>\n</p>\n<h4>\nI want to amend/hack/augment this plugin; can I do the same?\n</h4>\n<p>\n<p>Totally; like the original plugin by Jon, this plugin is licensed under the GNU General Public License v2 (GPLV2). See http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt for the full license terms.</p>\n</p>\n<h4>\nWhere does the name WP Biographia come from?\n</h4>\n<p>\n<p>WP Biographia is named after the etymology of the modern English word biography. The word first appeared in the 1680s, probably from the latin biographia which itself derived from the Greek bio, meaning &#8220;life&#8221; and graphia, meaning &#8220;record&#8221; or &#8220;account&#8221; which derived from graphein, &#8220;to write&#8221;.</p>\n</p>\n\n",
        "changelog": "<p>The current version is 4.0.0 b1 (2018.12.20)</p>\n<h4>4.0.0 b1</h4>\n<ul>\n<li>Released 2018.12.20</li>\n<li>Fixed: Updated plugin widget to use the correct base class constructor.</li>\n<li>Added: Support for Instagram and GitHub profile links.</li>\n<li>Added: New updated icon set.</li>\n<li>Other: Updated plugin to support WordPress 5.0 (Bebo Valdés) including the Gutenberg editor.</li>\n<li>Other: Remove support for obsoleted services; Google+, Delicious, Picasa, Yahoo! IM, AIM, MSN Messenger and Jabber.</li>\n<li>Other: Changed default biographt box background color to white.</li>\n<li>Other: Refactored plugin directory layout to reflect WordPress best practice (https://developer.wordpress.org/plugins/the-basics/best-practices/)</li>\n</ul>\n<h4>3.3.2</h4>\n<ul>\n<li>Released 2013.10.25</li>\n<li>Fixed: After upgrading to WordPress 3.7, all posts are considered to be excluded by category due to an apparent change in WP 3.7&#8217;s handling of categories (exposed via the plugin&#8217;s use of in_category). The plugin now checks for a non empty set of category exclusions before checking<br />\nthe post for a category.</li>\n</ul>\n<h4>3.3.1</h4>\n<ul>\n<li>Released 2012.12.18</li>\n<li>Fixed: Ensure the non-minified versions of the plugin&#8217;s CSS and JS files are enqueued if <code>WP_DEBUG</code> or <code>WPBIOGRAPHIA_DEBUG</code> are defined and set to <code>true</code>.</li>\n<li>Other: Updated and tested to ensure compatibility with WordPress v3.5 &#8220;Elvin Jones&#8221;.</li>\n</ul>\n<h4>3.3</h4>\n<ul>\n<li>Released 2012.10.25</li>\n<li>Added: <code>wp_biographia_content_title</code> filter; allow the Biography Boxes&#8217;s title to be changed.</li>\n<li>Added: Support for sites using the Simple Local Avatars plugin. If installed/active use the <code>simple_local_avatars</code> filter to fixup the avatar&#8217;s CSS; hook into both <code>simple_local_avatars</code> and <code>get_avatars</code> to support site with mixed Gravatars and locally hosted avatars.</li>\n<li>Added: Support for the shortcode&#8217;s <code>order</code> attribute; allow custom sort orders when in wildcard mode.</li>\n<li>Added: Support for post specific Biography Box overrides.</li>\n<li>Added: Two new template tags: <code>wpb_get_biography_box</code> and <code>wpb_the_biography_box</code>.</li>\n<li>Added: Multiple, comma separated, roles can now be specified for the shortcode and template tags.</li>\n<li>Added: Support for enabling/disabling contact links in the user&#8217;s profile, in the <em>Admin</em> and <em>Display</em> tabs and when rendering the Biography Box.</li>\n<li>Added: 5px spacing between contact link icons to support custom icon sets with no border.</li>\n<li>Added: The contact links in a user&#8217;s profile are now validated to check that they are valid URLs; an admin error message is now displayed if a link is deemed to be invalid.</li>\n<li>Added: Support for displaying the full or excerpt biography text.</li>\n<li>Added: The display of the Biography Box can now be locked to the main WordPress Loop to prevent it being displayed in the sidebar or when <code>the_content</code> or <code>the_excerpt</code> are used as part of themes or other plugins.</li>\n<li>Added: The colour of the Biography Box border can now be selected from the plugin&#8217;s <em>Style</em> tab.</li>\n<li>Added: <code>wp_biographia_link_item</code> filter; allow the constituent elements of each contact link to be overriden.</li>\n<li>Added: The visibility of all user profile Biography Options (biography excerpt, hide on posts, hide on pages) are now controlled by the Admin User Profile Settings.</li>\n<li>Fixed: The dismissed pointers flag is now removed for each user when the plugin is uninstalled.</li>\n<li>Fixed: The Biography Box is now styled correctly when no avatar image is present.</li>\n<li>Fixed: Shortcode and template tag roles are now validated against <code>$wp_roles</code> and not against a hard-coded roles list.</li>\n<li>Fixed: Bug which hid the <em>Display On Individual Pages</em> setting on the <em>Display</em> tab when <em>Display On All Post Archives</em> was checked.</li>\n<li>Fixed: The contact links in the Biography Box now align with the left hand edge of the biography text.</li>\n<li>Other: Moved all support source files into the <code>includes</code> directory.</li>\n<li>Other: Ensure plugin source files are being invoked within the context of the plugin itself, otherwise die.</li>\n<li>Other: The non-minified versions of the plugin&#8217;s CSS and JS files and now enqueued if <code>WP_DEBUG</code> is set to <code>true</code> or if <code>WPBIOGRAPHIA_DEBUG</code> is defined.</li>\n<li>Other: Cleaned up wording for the biography section of a user&#8217;s profile; repurposed the <em>shorter biography</em> text box to be the <em>biography excerpt</em> for use by the shortcode, template tags, widget and biography selection settings.</li>\n</ul>\n<h4>3.2.1</h4>\n<ul>\n<li>Released 2012.07.31</li>\n<li>Added: Stopped other themes and/or plugins overriding the size of the contact links icons via the !important CSS specifier.</li>\n<li>Fixed: Fixed bug that caused the Biography Box to be duplicated in some RSS feeds.</li>\n</ul>\n<h4>3.2</h4>\n<ul>\n<li>Released 2012.07.23</li>\n<li>Added: Support for synchronising the use of <code>wpautop</code> via the <code>the_content</code> and <code>the_excerpt</code> filters to ensure these filters fire before the Biography Box is produced when the plugin&#8217;s filter priority is less than the default filter priority to avoid formatting issues for contact links.</li>\n<li>Added: Support for WordPress Pointers to display &#8220;what&#8217;s new&#8221; information post install or upgrade and to provide a &#8220;guided tour&#8221; of the plugin&#8217;s settings and options.</li>\n<li>Added: Support for displaying the Biography Box as a widget.</li>\n<li>Added: Support for a shorter biography to the user&#8217;s profile to be used in conjunction with the Biography Box widget.</li>\n<li>Added: Support to display the Biography Box for all types of archive page; author, category, date and tag.</li>\n<li>Added: Custom meta boxes to the post/page/custom-post creation/editing screens to hide the Biography Box, making it easier to define the Admin screen&#8217;s Exclusion settings.</li>\n<li>Added: Support for the shortcode&#8217;s <code>user</code> attribute; deprecating support for the <code>author</code> attribute.</li>\n<li>Added: Increased the width of text and select boxes for the Admin and Exclusion admin tabs to allow for longer category names and longer lists of post IDs to be displayed.</li>\n<li>Added: Wrap the plugin&#8217;s avatars (if present) in plugin specific CSS code to prevent theme specific CSS bleeding into the Biography Box.</li>\n<li>Fixed: The layout of the Biography Box for feeds now ignore displaying contact links as icons and formats them as plain text.</li>\n<li>Fixed: Example use of the <code>wp_biographia_feed</code> filter in <code>readme.txt</code>.</li>\n<li>Fixed: Bug where the <code>wp_biographia_feed</code> filter was never called in the context of a feed.</li>\n<li>Fixed: Formatting of HTML for the Biography Box post/page hiding options in the user&#8217;s profile.</li>\n<li>Fixed: Use the term &#8220;hide&#8221; consistently across the plugin and documentation; previous versions used &#8220;hide&#8221; and &#8220;suppress&#8221; interchangeably.</li>\n<li>Fixed: Use the term &#8220;user&#8221; consistently across the plugin and documentation; previous versions used &#8220;author&#8221; and &#8220;user&#8221; interchangeably.</li>\n<li>Fixed: Bug where the last page of a multiply paged post was not correctly detected, resulting in the Biography Box being displayed for all pages.</li>\n</ul>\n<h4>3.1</h4>\n<ul>\n<li>Released 2012.05.03</li>\n<li>Added: Support for shortcode <code>role</code> attribute to further filter display of users when the shortcode is used in <em>wildcard</em> mode.</li>\n<li>Added: The <em>Colophon</em> tab in the admin settings screen now displays a dump of the plugin&#8217;s setting and options without the need to extract that information from the database via MySQL or phpMyAdmin.</li>\n<li>Added: New <em>Admin</em> tab in the admin settings screen. This allows a suitably permissioned administrator to hide the Biography Box settings from a user&#8217;s profile according to the user&#8217;s role and to automatically hide display of the Biography Box for newly created users according to that user&#8217;s role.</li>\n<li>Added: Introductory help text to each post-box in each tab in the admin settings screen.</li>\n<li>Added: The filter priorities for both <code>the_content</code> and <code>the_excerpt</code> can now be individually defined to cope with priority clashes with other themes and plugins which use these filters.</li>\n<li>Fixed: Bug where the <code>wp_biographia_category_exclusions</code> setting was not defined in the database upon plugin upgrade, causing an <em>undefined index</em> notice message when the PHP error reporting level is set to <code>E_NOTICE</code>.</li>\n<li>Fixed: Bug in settings initialisation; post_exclusions, global_post_exclusions and page_exclusions are now pre-defined and initialised correctly on both install and upgrade.</li>\n</ul>\n<h4>3.0.1</h4>\n<ul>\n<li>Released 2012.04.20</li>\n<li>Fixed: Bug in plugin initialisation that incorrectly named the Vimeo content display option.</li>\n<li>Fixed: Bug that caused a post&#8217;s user not to be refreshed in the front page and archive pages.</li>\n<li>Fixed: Bug that caused a post&#8217;s user to be determined as the user of the enclosing page where a custom Loop is being used.</li>\n</ul>\n<h4>3.0</h4>\n<ul>\n<li>Released 2012.04.11</li>\n<li>Summary: A substantial rewrite of the plugin&#8217;s structure with a reworked tabbed admin interface and substantial customisation options via the WordPress filter mechanism.</li>\n<li>Added: Filter wp_biographia_default_settings</li>\n<li>Added: Filter wp_biographia_contact_info</li>\n<li>Added: Filter wp_biographia_link_items</li>\n<li>Added: Filter wp_biographia_pre</li>\n<li>Added: Filter wp_biographia_shortcode</li>\n<li>Added: Filter wp_biographia_links</li>\n<li>Added: Filter wp_biographia_feed</li>\n<li>Added: Filter wp_biographia_biography_box</li>\n<li>Added: Support for the enclosing form of the wp_biographia shortcode in addition to the self-closing form.</li>\n<li>Added: Support for resetting the plugin&#8217;s settings/options to their initial default values from within the admin screen.</li>\n<li>Added: Support for hiding display of the Biography Box from posts, archives and the front page by category.</li>\n<li>Added: Tabbed settings/options in the admin screen.</li>\n<li>Fixed: Bug that caused an empty contact link to be displayed when an user&#8217;s profile has an empty corresponding contact field.</li>\n<li>Fixed: CSS bug that prevented WP Touch from working in non-restricted mode.</li>\n<li>Fixed: Bug that caused extended contact links in an user&#8217;s profile to be persisted after plugin uninstallation.</li>\n</ul>\n<h4>2.4.4</h4>\n<ul>\n<li>Released 2012.02.22</li>\n<li>Fixed bug where Vimeo contact link setting was not persisted across settings changes.</li>\n<li>Fix bug where &#8220;More Posts&#8221; link linked to the current page URL.</li>\n<li>Minor CSS tweak.</li>\n</ul>\n<h4>2.4.3</h4>\n<ul>\n<li>Released 2012.02.17</li>\n<li>Fixed bug where page exclusion settings were not persisted to the back-end database configuration settings.</li>\n</ul>\n<h4>2.4.2</h4>\n<ul>\n<li>Released 2012.02.16</li>\n<li>Correct version number in plugin header.</li>\n</ul>\n<h4>2.4.1</h4>\n<ul>\n<li>Released 2012.02.16</li>\n<li>Fixed regression bug in v2.4 where a contact link items displayed as an empty link if enabled in WP Biographia but if the corresponding link in the user&#8217;s profile was empty.</li>\n<li>Fixed regression bug in v2.4 where the user profile Biography Box settings text was not properly displayed.</li>\n<li>Tweak v2.4 CSS to clear up styling issues and to align list item styling with best practice.</li>\n</ul>\n<h4>2.4</h4>\n<ul>\n<li>Released 2012.02.16</li>\n<li>Add internationalisation support; add Spanish and Turkish language files.</li>\n<li>Add configuration setting to control the user&#8217;s name in the Biography Box as a link to &#8220;More Posts By This User&#8221;.</li>\n<li>Add support for displaying the user&#8217;s contact links as icons as well as plain text links.</li>\n<li>Add support for using an alternate link icon set.</li>\n</ul>\n<h4>2.3</h4>\n<ul>\n<li>Released 2012.01.26</li>\n<li>Hide the display of the &#8220;More Posts&#8221; link in the Biography Box (if configured) if the user has no posts.</li>\n<li>Add <code>author</code>, <code>prefix</code> and <code>name</code> short code attribute support.</li>\n<li>Add support for global (across single, archive and front page templates) post exclusions in built-in post types and custom post types.</li>\n<li>Tightened wording in admin screen around post exclusions.</li>\n</ul>\n<h4>2.2</h4>\n<ul>\n<li>Released 2012.01.17</li>\n<li>Add enhanced short code support (<code>raw</code> and <code>configured</code> modes)</li>\n<li>Add support for displaying the Biography Box on archive pages that use excerpts</li>\n<li>Enhance contact information and Biography Box links to support Delicious, Flickr, Picasa, Vimeo, YouTube and Reddit</li>\n<li>Fixed bug that caused the Biography Box to be displayed for every page of a multiple page post</li>\n<li>Fixed bugs in avatar image size handling; non-default avatar image size was not persisted across settings changes; avatar image container div was not resized to new non-default avatar image size</li>\n<li>Migrate use of wp_print_styles to wp_enqueue_scripts; see (http://wpdevel.wordpress.com/2011/12/12/use-wp_enqueue_scripts-not-wp_print_styles-to-enqueue-scripts-and-styles-for-the-frontend/)</li>\n<li>Made terminology and control ordering for custom post types consistent in admin pages</li>\n</ul>\n<h4>2.1.1</h4>\n<ul>\n<li>Released 2011.12.21</li>\n<li>Fixed bug in per user hiding due to debug code being left in the release</li>\n</ul>\n<h4>2.1</h4>\n<ul>\n<li>Released 2011.12.20</li>\n<li>Add ability to hide the Biography Box from being displayed on posts, on pages and on posts and pages on a per user basis</li>\n<li>Add settings link to Settings / WP Biographia admin page from the plugin&#8217;s entry on the Dashboard / Plugins page</li>\n<li>Add checks for avatar display in the Biography Box being requested with avatar support not enabled in the Settings / Discussions admin page</li>\n<li>Add Help &amp; Support sidebar box to Settings / WP Biographia admin page</li>\n<li>Handle upgrades to configuration settings gracefully; fixed bug that didn&#8217;t persist unused/unchanged configuration settings</li>\n<li>Cleaned up the wording for the Settings / WP Biographia admin page and made terminology consistent across all configurable options</li>\n<li>Tweaked admin CSS to introduce padding between the settings container and sidebar container that changed in WordPress 3.3</li>\n</ul>\n<h4>2.0</h4>\n<ul>\n<li>Released 2011.11.18</li>\n<li>Added the ability to set image size</li>\n<li>Added a simple shortcode</li>\n<li>Added Custom Post Types support with the ability to exclude based on post IDs</li>\n<li>Added ability to set the bio at the top or the bottom</li>\n<li>Added a filter to short circuit for further customization</li>\n<li>Added ability to include the post user&#8217;s email link</li>\n<li>Refactored plugin file locations in line with WordPress plugin development recommendations</li>\n<li>Fixed CSS issue for gravatar</li>\n</ul>\n<h4>1.0</h4>\n<ul>\n<li>Released 2011.08.03</li>\n<li>First version of WP Biographia released</li>\n</ul>\n"
    },
    "short_description": "Add and display a customisable user biography to the front page, single post types, archives and RSS feeds as well as via a widget in your sidebar.",
    "description": "<p>This plugin allows you to add a customisable biography to posts, to RSS feeds, to pages, to archives and to each post on your blog&#8217;s landing page as well as via a widget in your sidebar. It integrates out of the box with the information that can be provided in each user&#8217;s profile and supports custom post types. Display of the Biography Box can be hidden on a global or per user basis for posts, pages and custom post types as well as on a per category basis.</p>\n<p>Settings and options include:</p>\n<ol>\n<li>Choose when to display a Biography Box; on the front page, in archives, on individual posts, pages, or any other custom post type and in RSS feeds.</li>\n<li>Choose the border style and background colour of the Biography Box</li>\n<li>Choose the amount of user profile information displayed in the Biography Box</li>\n<li>Choose the avatar image size</li>\n<li>Choose to display the Biography Box at the top or the bottom of content (universally)</li>\n<li>Choose to hide the display of the Biography Box for pages, posts and posts/pages on a per user basis</li>\n<li>Choose whether to display the Biography Box in the sidebar of your blog.</li>\n</ol>\n<p>The plugin expands and enhances the Contact Info section of your user profile, adding support for Twitter, Facebook, LinkedIn, Google+, Delicious, Flickr, Picasa, Vimeo, YouTube and Reddit profile links as well as Yahoo! Messenger, AIM, Windows Live Messenger and Jabber/Google Talk instant messaging profiles. Your Contact Info links can then be displayed as part of the Biography Box, either as plain text links or as icon links. Further contact links can easily be added to the Biography Box by using the <code>wp_biographia_contact_info</code> and <code>wp_biographia_link_items</code> filters.</p>\n<p>The position of the Biography Box can be controlled by the plugin&#8217;s supported settings and options, or manually via the plugin&#8217;s shortcode (<code>[wp_biographia]</code>) (see the <em>Shortcode Support And Usage</em> section for more information) or via template tags in your theme&#8217;s template files (see the <em>Template Tags</em> section for more information).</p>\n<p>The position and content of the Biography Box, including adding support for new contact links, changing the content of the Biography Box when displayed via the shortcode, the format of the contact links and the overall format of the Biography Box can be modified by the plugin&#8217;s filters. See the <em>Filter Support And Usage</em> section for more information.</p>\n<p>The plugin also supports displaying a reduced version of the Biography Box via a sidebar widget and provides a shorter, more terse, biography in the user&#8217;s Profile to prevent the full length biography text taking up too much space on the sidebar.</p>\n<h3>Shortcode Support And Usage</h3>\n<p>WP Biographia supports a single shortcode, <code>[wp_biographia]</code>. Adding this shortcode to the content of a post or page or into a theme template as content, expands the shortcode and replaces it with a Biography Box.</p>\n<p>The shortcode also supports multiple <em>attributes</em> which allow you to customise the way in which the shortcode is expanded into the Biography Box:</p>\n<ul>\n<li>the <code>mode</code> attribute</li>\n<li>the <code>user</code> attribute</li>\n<li>the <code>author</code> attribute <em>(deprecated)</em></li>\n<li>the <code>role</code> attribute</li>\n<li>the <code>order</code> attribute</li>\n<li>the <code>prefix</code> attribute</li>\n<li>the <code>name</code> attribute</li>\n<li>the <code>type</code> attribute</li>\n</ul>\n<h4>The &#8220;mode&#8221; Attribute</h4>\n<p>In <code>raw</code> mode, which is the default (specified as <code>[wp_biographia mode=\"raw\"]</code> or simply as <code>[wp_biographia]</code>), the plugin inserts the Biography Box in <em>you&#8217;ve asked for it, you&#8217;ve got it</em> mode.</p>\n<p>Or to put it another way, the plugin will honour the settings that you specify under <em>Dashboard / Settings/ WP Biographia</em> for <em>Biography Box Style Settings</em> and for <em>Biography Box Content Settings</em> but will ignore the <em>Biography Box Display Settings</em> and <em>Biography Box Per User Settings</em>.</p>\n<p>In <code>configured</code> mode, specified as <code>[wp_biographia mode=\"configured\"]</code>, the plugin inserts the Biography Box and will honour all the settings under <em>Dashboard / Settings / WP Biographia</em> with the exception of <em>Display On Front Page</em>, <em>Display On Individual Post</em>, <em>Display On Post Archives</em> and <em>Display On Individual Pages</em>, as well as their equivalents for any custom post types you may have created.</p>\n<p>The thinking behind this is that you probably want to honour post or page exclusions and per user exclusions, but by using the shortcode in your posts, you want to be in control of how and where the Biography Box is displayed.</p>\n<h4>The &#8220;user&#8221; Attribute</h4>\n<p>If the <code>user</code> attribute is omitted, which is the default, the shortcode assumes it&#8217;s being used within the <a href=\"https://codex.wordpress.org/The_Loop\" rel=\"nofollow ugc\">WordPress Loop</a> and will display the Biography Box once for the current post&#8217;s, page&#8217;s or custom post type&#8217;s user.</p>\n<p>Specifying a user&#8217;s login name as the <code>user</code> attribute overrides this behaviour and allows multi-user sites to use the plugin to create a <em>contributors</em> page, where you use the shortcode as <code>[wp_biographia user=\"login-name\"]</code> once for each of your site&#8217;s users that you want to appear, replacing <code>\"login-name\"</code> with a valid login name for one of your users.</p>\n<p>You call also use the <code>user</code> attribute in <em>wildcard</em> mode, specifying the user&#8217;s login name as <code>*</code> as <code>[wp_biographia user=\"*\"]</code>; this will then loop over all of the users that have logins on your site, displaying the Biography Box once for each user, ordered alphabetically by login name.</p>\n<p>Specifying an invalid login name (<code>[wp_biographia user=\"idontexist\"]</code>) will result in no Biography Box being displayed. Specifying an empty login name (<code>[wp_biographia user=\"\"]</code>) will cause the <code>user</code> attribute to be ignored and may result in undefined behaviour, such as a partially populated Biography Box being displayed as the shortcode is being used outside of the Loop and thus no user information is made available to the plugin by WordPress.</p>\n<h4>The &#8220;author&#8221; Attribute</h4>\n<p>The <code>author</code> attribute is now deprecated in favour of the <code>user</code> attribute introduced in v3.2.0 of the plugin. If the <code>author</code> attribute is used and no <code>user</code> attribute is present, the <code>author</code> attribute will act in the same way as the <code>user</code> attribute, described above. If both the <code>user</code> and <code>author</code> attributes are present, the <code>author</code> attribute will be ignored in favour of the <code>user</code> attribute.</p>\n<p>In other words, if you use the shortcode and supply both the <code>author</code> and <code>user</code> attributes, such as <code>[wp_biographia author=\"foo\" user=\"bar\"]</code>, the Biography Box will be displayed for the user <code>bar</code>, not the user <code>foo</code>. Likewise, <code>[wp_biographia user=\"*\" author=\"foo\"]</code> will display the Biography Box in <em>wildcard</em> mode, not for the user <code>foo</code>.</p>\n<p>Support for the <code>author</code> attribute will be likely be removed in a future release of the plugin to avoid confusion over the <code>author</code> and <code>user</code> attributes.</p>\n<h4>The &#8220;role&#8221; Attribute</h4>\n<p>Valid only when used in conjunction with the <code>user</code> attribute in <em>wildcard</em> mode, the <code>role</code> attribute allows you to filter the users that have user accounts on your blog according to their <a href=\"https://codex.wordpress.org/Roles_and_Capabilities\" rel=\"nofollow ugc\">WordPress Role</a>. The <code>role</code> attribute takes one or more comma separated arguments which define the WordPress role(s); at the time of writing, these can be one of:</p>\n<ul>\n<li><code>administrator</code></li>\n<li><code>editor</code></li>\n<li><code>author</code></li>\n<li><code>contributor</code></li>\n<li><code>subscriber</code></li>\n</ul>\n<p>For example, if you want to display the Biography Box for all users of your blog who have a role of <code>author</code> you can use the <code>role</code> attribute plus the <code>author</code> attribute in <em>wildcard</em> mode to do this, along the lines of <code>[wp_biographia user=\"*\" role=\"author\"]</code>. If you want to display the Biography Box for all users with a role of <code>author</code> or <code>contributor</code>, you can specify both roles, along the lines of <code>[wp_biographia user=\"*\" role=\"author,contributor\"]</code>.</p>\n<p>Specifying an invalid role (<code>[wp_biographia user=\"*\" role=\"foo\"])</code> will result in no Biography Box being displayed. Specifying the <code>role</code> attribute without the <code>user</code> attribute in <em>wildcard</em> mode will have no effect.</p>\n<h4>The &#8220;order&#8221; Attribute</h4>\n<p>Valid only when used in conjunction with the <code>user</code> attribute in <em>wildcard</em> mode, the <code>order</code> attribute allows you to specify the display order for the users that have user accounts on your blog. The <code>order</code> attribute takes a single argument which defines the sorting order; at the time of writing, this can be one of:</p>\n<ul>\n<li><code>account-name</code> <em>(the default)</em></li>\n<li><code>first-name</code></li>\n<li><code>last-name</code></li>\n<li><code>nickname</code></li>\n<li><code>display-name</code></li>\n<li><code>login-id</code></li>\n</ul>\n<p>For example, if you want to display the Biography Box for all users of your blog ordered according to their last name you can use the <code>order</code> attribute plus the <code>author</code> attribute in <em>wildcard</em> mode to do this, along the lines of <code>[wp_biographia user=\"*\" order=\"last-name\"]</code>.</p>\n<p>Specifying an invalid role (<code>[wp_biographia user=\"*\" order=\"foo\"])</code> will result in the default account name sort order being used. Specifying the <code>order</code> attribute without the <code>user</code> attribute in <em>wildcard</em> mode will have no effect.</p>\n<p>It&#8217;s important to note that the in order to successfully sort by <code>first-name</code> or by <code>last-name</code>, the <em>First Name</em> and/or <em>Last Name</em> fields must be populated in each user&#8217;s Profile; by default, these fields are not populated during the creation of a user&#8217;s WordPress account. The sorting of the user accounts when the <code>order</code> attribute is specified uses <a href=\"http://sourcefrog.net/projects/natsort/\" rel=\"nofollow ugc\"><em>natural order string comparison</em></a>, which means than an empty <em>First Name</em> or <em>Last Name</em> will appear <strong>before</strong> a <em>First Name</em> or <em>Last Name</em> which actually contains a value. If your WordPress site doesn&#8217;t have these name fields populated in your user&#8217;s Profiles, you may not see the sorting results you expect.</p>\n<h4>The &#8220;prefix&#8221; Attribute</h4>\n<p>If the <code>prefix</code> attribute is omitted, which is the default, the Biography Box will be displayed with <em>Biography Prefix</em> text configured in <em>Settings/ WP Biographuia / Biography Box Content Settings</em> before the user&#8217;s name. This can be overridden by using the <code>prefix</code> attribute, along the lines of <code>[wp_biographia prefix=\"All About\"]</code>.</p>\n<h4>The &#8220;name&#8221; Attribute</h4>\n<p>If the <code>name</code> attribute is omitted, which is the default, the Biography Box will be displayed with the user&#8217;s name as configured by <em>User&#8217;s Name</em> in <em>Settings / WP Biographia /Biography Box Content Settings</em>. This can be overriden by supplying one of the following for the <code>name</code> attribute&#8217;s argument:</p>\n<ul>\n<li><code>account-name</code></li>\n<li><code>first-last-name</code></li>\n<li><code>nickname</code></li>\n<li><code>display-name</code></li>\n<li><code>none</code></li>\n</ul>\n<h4>The &#8220;type&#8221; Attribute</h4>\n<p>If the <code>type</code> attribute is omitted, which is the default, the Biography Box will be displayed with the user&#8217;s full biography text, taken from the <em>Biographical Info</em> field in the user&#8217;s profile. If the <code>type</code> attribute is specified with a value of <code>full</code>, this is equivalent to the default behaviour. If the <code>type</code> attribute is specified with a value of <code>excerpt</code>, the <em>Biographical Excerpt</em> field in the user&#8217;s profile will be used instead, providing the user has filled out this field in their profile. Specifying an invalid <code>type</code> attribute value (<code>[wp_biographia type=\"foo\"]</code>) will result in the default behaviour of the full biography being used.</p>\n<h3>Filter Support And Usage</h3>\n<p>WP Biographia supports multiple filters, which are described in more detail below. The plugin&#8217;s filters allow you to:</p>\n<ul>\n<li>change the default set of installation settings and options at plugin activation time</li>\n<li>modify and/or enhance the set of contact information fields the plugin adds to the user&#8217;s profile</li>\n<li>modify and/or enhance the contact links that are added to the Biography Box by the plugin</li>\n<li>modify the position of the Biography Box to before or after the post content returned by <code>the_content()</code> and/or <code>the_excerpt()</code></li>\n<li>hide the display of the Biography Box entirely under user-defined circumstances</li>\n<li>modify and/or enhance the Biography Box that is produced by the <code>[wp_biographia]</code> shortcode</li>\n<li>modify and/or enhance the format and content of the contact links that are added to the Biography Box by the plugin</li>\n<li>modify and/or enhance the Biography Box that is produced for an RSS feed</li>\n<li>modify and/or enhance the entirety of the Biography Box</li>\n</ul>\n<h4>wp_biographia_default_settings</h4>\n<p>Applied to the default set of plugin settings and options. Note that this filter is called once, upon plugin activation, when there are no WP Biographia settings/options existing in the database.</p>\n<p><em>Example:</em> Add the date and time that the plugin was first activated</p>\n<pre><code>add_filter ('wp_biographia_default_settings', 'add_activation_timestamp');\n\nfunction add_activation_timestamp ($options) {\n    // options = array (option name =&gt; option value)\n    $options['plugin_activation_timestamp'] = date (DATE_ATOM);\n\n    return $options;\n}\n</code></pre>\n<h4>wp_biographia_contact_info</h4>\n<p>Applied to the default set of contact information fields that are added to an user&#8217;s profile by the plugin. Note that in order to add and display a new contact link to the Biography Box, the contact link must be added to the value returned by the <code>wp_biographia_link_items</code> filter as well as the value returned by this filter.</p>\n<p><em>Example:</em> Add Pinterest as a supported contact information field</p>\n<pre><code>add_filter ('wp_biographia_contact_info', 'add_pinterest_support');\n\nfunction add_pinterest_support ($contacts) {\n    // contacts = array (field =&gt; array (field =&gt; field-name, contactmethod =&gt; description))\n    $contacts['pinterest'] = array (\n        'field' =&gt; 'pinterest',\n        'contactmethod' =&gt; __('Pinterest')\n    );\n\n    return $contacts;\n}\n</code></pre>\n<h4>wp_biographia_link_items</h4>\n<p>Applied to the default set of contact links that are added to the Biography Box by the plugin. Note that in order to add and display a new contact link, the contact information field must be added to the value returned by the <code>wp_biographia_contact_info</code> filter as well as the value returned by this filter. Note that <code>$icon_dir_url</code> will by default contain the URL of the images directory within the plugin directory, which will look something like <code>/wp-content/plugins/wp-biographia/images/</code> (the trailing slash is important). If an alternate icon directory has been specified in the plugin&#8217;s settings and options, then <code>$icon_dir_url</code> will contain this alternate, configured, directory URL. If the icon you want to add for a new contact link doesn&#8217;t reside in the directory URL mentioned previously, you&#8217;ll need to set <code>$icon_dir_url</code> to point to your own custom location.</p>\n<p><em>Example:</em> Add Pinterest as a supported contact link in the Biography Box</p>\n<pre><code>add_filter ('wp_biographia_link_items', 'add_pinterest_link', 2);\n\nfunction add_pinterest_link ($links, $icon_dir_url) {\n    // links = array (field =&gt; array (link_title =&gt; title, link_text =&gt; text, link_icon =&gt; URL)\n    $links['pinterest'] = array (\n        'link_title' =&gt; __('Pinterest'),\n        'link_text' =&gt; __('Pinterest'),\n        'link_icon' =&gt; $icon_dir_url . 'pinterest.png'\n        );\n\n        return $links;\n}\n</code></pre>\n<h4>wp_biographia_pattern</h4>\n<p>Applied to the format string used to position the Biography Box before the post content or after the post content that is returned by <code>the_content()</code> and/or <code>the_excerpt()</code>.</p>\n<p><em>Example:</em> Insert a header between post content and Biography Box</p>\n<pre><code>add_filter ('wp_biographia_pattern', 'insert_biography_header');\n\nfunction insert_biography_header ($pattern) {\n    return '%1$s&lt;p class=\"biography-header\"&gt;About The User&lt;/p&gt;%2$s';\n}\n</code></pre>\n<h4>wp_biographia_pre</h4>\n<p>Allows display of the Biography Box to be hidden under user-defined circumstances. This only affects the display of the Biography Box that is configured via the plugin&#8217;s admin screen or via the shortcode in configured mode.</p>\n<p><em>Example:</em> Hide the Biography Box</p>\n<pre><code>add_filter ('wp_biographia_pre', 'hide_biography_box');\n\nfunction hide_biography_box ($flag) {\n    return true;\n}\n</code></pre>\n<h4>wp_biographia_shortcode</h4>\n<p>Applied to the current instance of the Biography Box that is produced via the <code>[wp_biographia]</code> shortcode.</p>\n<p><em>Example:</em> Apply shortcode specific CSS to the Biography Box</p>\n<pre><code>add_filter ('wp_biographia_links', 'add_shortcode_css', 10, 2);\n\nfunction add_shortcode_css ($content, $params) {\n    // params = array (mode =&gt; shortcode-mode, user =&gt; author-id, prefix =&gt; prefix-string,\n                        name =&gt; name-option)\n\n    return '&lt;div class=\"custom-shortcode-css\"&gt;' . $content . '&lt;/div&gt;';\n}\n</code></pre>\n<h4>wp_biographia_content_title</h4>\n<p>Applied to the title of the Biography Box.</p>\n<p><em>Example:</em> Override the name prefix for all uses of the Biography Box.</p>\n<pre><code>add_filter ('wp_biographia_content_title', 'override_name_prefix', 10, 3);\nfunction override_name_prefix ($content, $name_prefix, $formatted_name) {\n    return 'This is ' . $formatted_name;\n}\n</code></pre>\n<h4>wp_biographia_links</h4>\n<p>Applied to the formatted set of contact links for the current instance of the Biography Box.</p>\n<p><em>Example:</em> Replace the default text link separator character (the pipe symbol &#8220;|&#8221;) with a dash (&#8220;-&#8220;).</p>\n<pre><code>add_filter ('wp_biographia_links', 'replace_link_separator', 10, 3);\n\nfunction replace_link_separator ($content, $links, $params) {\n    // links = array (link-item)\n    // params = array (glue =&gt; separator-string, class =&gt; link-item-css-class-name,\n    //                  prefix =&gt; links-prefix-html, postfix =&gt; links-postfix-html)\n\n    return str_replace ($params['glue'], ' - ', $content);\n}\n</code></pre>\n<p><em>Example:</em> Wrap the formatted content links in an additional HTML div.</p>\n<pre><code>add_filter ('wp_biographia_links', 'wrap_links', 10, 3);\n\nfunction wrap_links ($content, $links, $params) {\n    // links = array (link-item)\n    // params = array (glue =&gt; separator-string, class =&gt; link-item-css-class-name,\n    //                  prefix =&gt; links-prefix-html, postfix =&gt; links-postfix-html)\n\n    $new_prefix = '&lt;div class=\"custom-link-class\"&gt;' . $params['prefix'];\n    $new_postfix = $params['postfix'] . '&lt;/div&gt;';\n\n    return $new_prefix . implode ($params['glue'], $links) . $new_postfix;\n}\n</code></pre>\n<h4>wp_biographia_link_item</h4>\n<p>Applied to each active contact link, in the order in which they are processed by the plugin.</p>\n<p><em>Example:</em> Force all links that point to the current site to open in a new window.</p>\n<pre><code>add_filter ('wp_biographia_link_item', 'filter_link_item', 10, 2);\n\nfunction filter_link_item ($content, $params) {\n    // $params = array (\n    //      'type' =&gt; 'link type (icon|text)',\n    //      'format' =&gt; 'link format string',\n    //      'meta' =&gt; 'additional anchor attributes',\n    //      'title' =&gt; 'link title',\n    //      'url' =&gt; 'link URL',\n    //      'body' =&gt; 'link body text',\n    //      'link-class' =&gt; 'link CSS class name',\n    //      'item-class' =&gt; 'link item CSS class name (icons only)'\n    //  );\n\n    $site_url = site_url ();\n    $pos = strpos ($params['url'], $site_url);\n    if ($pos !== false) {\n        $params['meta'] = 'target=\"_blank\"';\n    }\n\n    if ($params['type'] === 'icon') {\n        $content = sprintf ($params['format'], $params['url'], $params['meta'], $params['title'], $params['link-class'], $params['body'], $params['item-class']);\n    }\n\n    else {\n        $content = sprintf ($params['format'], $params['url'], $params['meta'], $params['title'], $params['link-class'], $params['body']);\n    }\n\n    return $content;\n}\n</code></pre>\n<h4>wp_biographia_feed</h4>\n<p>Applied to the current instance of the Biography Box that is produced via the site&#8217;s RSS feed.</p>\n<p><em>Example:</em> Apply RSS feed specific CSS to the Biography Box</p>\n<pre><code>add_filter ('wp_biographia_feed', 'add_feed_css');\n\nfunction add_feed_css ($content) {\n    return '&lt;div class=\"custom-feed-css\"&gt;' . $content . '&lt;/div&gt;';\n}\n</code></pre>\n<h4>wp_biographia_biography_box</h4>\n<p>Applied to the entire content of the current instance of the Biography Box.</p>\n<p><em>Example:</em> Remove all WP Biographia CSS classes commencing <code>wp-biographia-</code> and replace them with custom CSS classes that adhere to the plugin&#8217;s CSS class naming convention.</p>\n<pre><code>add_filter ('wp_biographia_biography_box', 'replace_css_classes', 10, 2);\n\nfunction replace_css_classes ($biography, $items) {\n    $new_content = array ();\n\n    foreach ($items as $item) {\n        $new_content[] = str_replace ('wp-biographia-', 'custom-', $item);\n    }\n\n    return implode ('', $new_content);\n}&lt;h3&gt;Template Tags&lt;/h3&gt;\n</code></pre>\n<p>WP Biographia supports two <a href=\"https://codex.wordpress.org/Template_Tags\" rel=\"nofollow ugc\">template tags</a> that can be used in your theme&#8217;s template files. These are described in more detail below; for a full description of the use of each tag&#8217;s argument, see the <em>Shortcode Support And Usage</em> section. The plugin&#8217;s tags allow you to:</p>\n<ul>\n<li>produce the Biography Box and assign the HTML for the Biography Box to a string.</li>\n<li>produce the Biography Box and echo the results immediately.</li>\n</ul>\n<h4>wpb_get_biography_box</h4>\n<p><em>Description:</em> Retrieves the Biography Box. This template tags renders the Biography Box and returns it to the caller as a string. To display the Biography Box immediately, use the <code>wpb_the_biography_box</code> template tag.</p>\n<p><em>Usage:</em></p>\n<pre><code>&lt;?php $biography_box = wpb_get_biography_box ($mode, $user, $prefix, $name, $role, $type, $order); ?&gt;\n</code></pre>\n<p><em>Parameters:</em></p>\n<ul>\n<li><code>$mode</code> &#8211; (string) (<em>optional</em>) Override the Biography Box mode (<code>raw</code>|<code>configured</code>). Default: <code>raw</code>.</li>\n<li><code>$user</code> &#8211; (string) (<em>optional</em>) Override the source user (<code>login-name</code>|<code>*</code>). Default: the current user&#8217;s login name.</li>\n<li><code>$prefix</code> &#8211; (string) (<em>optional</em>) Override the Biography Box title prefix. Default: use the plugin&#8217;s settings.</li>\n<li><code>$name</code> &#8211; (string) (<em>optional</em>) Override the selected user&#8217;s name format (<code>account-name</code>|<code>first-last-name</code>|<code>nickname</code>|<code>display-name</code>|<code>none</code>). Default: use the plugin&#8217;s settings.</li>\n<li><code>$role</code> &#8211; (string) (<em>optional</em>) Override the selected user&#8217;s role when used in <em>wildcard mode</em>. Specify one or more of the following, as a comma separated list (<code>administrator</code>|<code>editor</code>|<code>author</code>|<code>contributor</code>|<code>subscriber</code>). Default: none.</li>\n<li><code>$type</code> &#8211; (string) (<em>optional</em>) Override the type of the biography text (<code>full</code>|<code>excerpt</code>). Default: use the plugin&#8217;s settings.</li>\n<li><code>$order</code> &#8211; (string) (<em>optional</em>) Override the sort order when used in <em>wildcard mode</em> (<code>account-name</code>|<code>first-name</code>|<code>last-name</code>|<code>nickname</code>|<code>display-name</code>|<code>login-id</code>). Default: <code>account-name</code>.</li>\n</ul>\n<h4>wpb_the_biography_box</h4>\n<p><em>Description:</em> Displays the Biography Box. This template tags renders the Biography Box and displays it immediately. To get the current Biography Box as a string, use the <code>wpb_get_biography_box</code> template tag.</p>\n<p><em>Usage:</em></p>\n<pre><code>&lt;?php wpb_the_biography_box ($mode, $user, $prefix, $name, $role, $type, $order); ?&gt;\n</code></pre>\n<p><em>Parameters:</em></p>\n<ul>\n<li><code>$mode</code> &#8211; (string) (<em>optional</em>) Override the Biography Box mode (<code>raw</code>|<code>configured</code>). Default: <code>raw</code>.</li>\n<li><code>$user</code> &#8211; (string) (<em>optional</em>) Override the source user (<code>login-name</code>|<code>*</code>). Default: the current user&#8217;s login name.</li>\n<li><code>$prefix</code> &#8211; (string) (<em>optional</em>) Override the Biography Box title prefix. Default: use the plugin&#8217;s settings.</li>\n<li><code>$name</code> &#8211; (string) (<em>optional</em>) Override the selected user&#8217;s name format (<code>account-name</code>|<code>first-last-name</code>|<code>nickname</code>|<code>display-name</code>|<code>none</code>). Default: use the plugin&#8217;s settings.</li>\n<li><code>$role</code> &#8211; (string) (<em>optional</em>) Override the selected user&#8217;s role when used in <em>wildcard mode</em>. Specify one or more of the following, as a comma separated list (<code>administrator</code>|<code>editor</code>|<code>author</code>|<code>contributor</code>|<code>subscriber</code>). Default: none.</li>\n<li><code>$type</code> &#8211; (string) (<em>optional</em>) Override the type of the biography text (<code>full</code>|<code>excerpt</code>). Default: use the plugin&#8217;s settings.</li>\n<li><code>$order</code> &#8211; (string) (<em>optional</em>) Override the sort order when used in <em>wildcard mode</em> (<code>account-name</code>|<code>first-name</code>|<code>last-name</code>|<code>nickname</code>|<code>display-name</code>|<code>login-id</code>). Default: <code>account-name</code>.</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wp-biographia.4.0.0.zip",
    "upgrade_notice": {
        "3.3.2": "<p>This version now supports changes in category behaviour introduced in WordPress v3.7 and which meant every post was considered to be excluded by category.</p>",
        "3.3.1": "<p>This version ensures the minified versions of the plugin&#039;s CSS/JS files are loaded if in a production environment and supports WordPress v3.5.</p>",
        "3.3": "<p>This version fixes 5 bugs and adds 13 new features including new filters, template tags and per post overrides to support guest authors.</p>",
        "3.2.1": "<p>This version fixes an issue for RSS feeds where the Biography Box could be duplicated and locks the size of the contact link icons, if used.</p>",
        "3.2": "<p>This version adds support for the Biography Box as a widget and to select display of the Biography Box for all archive types (author, category, date), plus bug fixes.</p>",
        "3.1": "<p>This version adds a new <em>Admin</em> tab to the settings screen, the ability to set the content and excerpt filter priorities and support for the shortcode <code>role</code> attribute This is the 13th version of WP Biographia.</p>",
        "3.0.1": "<p>This version fixes several bugs that affected the correct user being associated with the Biography Box on front/archive pages and when called from within a custom Loop. This is 12th version of WP Biographia.</p>",
        "3.0": "<p>This is the 11th version of WP Biographia and is a major rewrite of the plugin&#039;s structure and functionality to use a PHP class. This version fixes several bugs as well as adding support for additional filters and a restructure of the admin settings/options screen to use a tabbed interface.</p>",
        "2.4.4": "<p>This is the 10th version of WP Biographia and is a bug fix release; fixed bugs in persisting Vimeo contact links settings, in &quot;More Posts Link&quot; incorrectly linking to the current page/post URL and minor CSS tweaks.</p>",
        "2.4.3": "<p>This is the 9th version of WP Biographia and is a bug fix release; fixed bug where page exclusion settings were not persisted to the back-end database configuration settings.</p>",
        "2.4.2": "<p>This is the 8th version of WP Biographia and is a bug fix release, clearing up several regression bugs that appeared in v2.4.</p>",
        "2.4.1": "<p>This is the 8th version of WP Biographia and is a bug fix release, clearing up several regression bugs that appeared in v2.4.</p>",
        "2.4": "<p>This is the 7th version of WP Biographia; adds internationalisation support plus Spanish and Turkish translations; adds support for displaying the user&#039;s contact links as icons and for using an alternate icon set.</p>",
        "2.3": "<p>This is the 6th version of WP Biographia; adds support for global post exclusions, enhanced shortcode options and hiding of the &quot;More Posts&quot; link if the user has no posts.</p>",
        "2.2": "<ul>\n<li>This is the fifth version of WP Biographia; adds support for enhanced shortcode usage, excerpt support on archive pages and additional social media profiles and links as well as several bug fixes.</li>\n</ul>",
        "2.1.1": "<ul>\n<li>This is the fourth version of WP Biographia which fixes a fatal bug in v2.1; please upgrade to this version and skip v2.0.</li>\n</ul>",
        "2.1": "<ul>\n<li>This is the third version of WP Biographia; adds support for per user hiding of displaying the Biography Box on posts, on pages and on posts and pages, plus bug fixes and minor UI changes.</li>\n</ul>",
        "2.0": "<ul>\n<li>This is the second version of WP Biographia and incorporates new features and bug fixes as well as some under-the-hood plumbing changes; in particular the plugin file locations have changed to reflect WordPress plugin development recommendations</li>\n</ul>",
        "1.0": "<ul>\n<li>This is the first version of WP Biographia</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-1.jpg?rev=2447869",
            "caption": "Settings and Options: Display Tab"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-2.jpg?rev=2447869",
            "caption": "Settings and Options: Admin Tab - New User Settings"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-3.jpg?rev=2447869",
            "caption": "Settings and Options: Admin Tab - User Profile Settings"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-4.jpg?rev=2447869",
            "caption": "Settings and Options: Admin Tab - Content and Excerpt Settings"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-5.jpg?rev=2447869",
            "caption": "Settings and Options: Admin Tab - Biography Box Override Settings"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-6.jpg?rev=2447869",
            "caption": "Settings and Options: Exclusions Tab - Post, Page and Custom Post Type Exclusion and Category Exclusion Settings"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-7.jpg?rev=2447869",
            "caption": "Settings and Options: Exclusions Tab - User Hiding Settings"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-8.jpg?rev=2447869",
            "caption": "Settings and Options: Style Tab"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-9.jpg?rev=2447869",
            "caption": "Settings and Options: Content Tab"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-10.jpg?rev=2447869",
            "caption": "Settings and Options: Content Tab, continued"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-11.jpg?rev=2447869",
            "caption": "Settings and Options: Defaults Tab"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-12.jpg?rev=2447869",
            "caption": "Settings and Options: Colophon Tab - Colophon"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-13.jpg?rev=2447869",
            "caption": "Settings and Options: Colophon Tab - Plugin Configuration Settings"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-14.jpg?rev=2447869",
            "caption": "Post Install and Upgrade: What's New Pointer"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-15.jpg?rev=2447869",
            "caption": "Plugin Tour Pointer: Display Tab"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-16.jpg?rev=2447869",
            "caption": "Plugin Tour Pointer: Admin Tab"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-17.jpg?rev=2447869",
            "caption": "Plugin Tour Pointer: Exclusions Tab"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-18.jpg?rev=2447869",
            "caption": "Plugin Tour Pointer: Style Tab"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-19.jpg?rev=2447869",
            "caption": "Plugin Tour Pointer: Content Tab"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-20.jpg?rev=2447869",
            "caption": "Plugin Tour Pointer: Defaults Tab"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-21.jpg?rev=2447869",
            "caption": "Plugin Tour Pointer: Colophon Tab"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-22.jpg?rev=2447869",
            "caption": "Settings and Options: Contact link verification in a user's profile"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-23.jpg?rev=2447869",
            "caption": "Edit Post: Biography Box Post Options meta-box"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-24.jpg?rev=2447869",
            "caption": "Sample Biography Box; Contact links shown as text"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-25.jpg?rev=2447869",
            "caption": "Sample Biography Box; Contact links shown as icons"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-26.jpg?rev=2447869",
            "caption": "Widget Settings and Options"
        },
        {
            "src": "https://ps.w.org/wp-biographia/trunk/screenshot-27.jpg?rev=2447869",
            "caption": "Sample Widget Output"
        }
    ],
    "tags": {
        "bio": "bio",
        "biographia": "biographia",
        "biography": "biography",
        "wp-biographia": "WP Biographia"
    },
    "stable_tag": "4.0.0",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/wp-biographia.1.0.0.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/wp-biographia.2.0.0.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/wp-biographia.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/wp-biographia.2.1.1.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/wp-biographia.2.2.0.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/wp-biographia.2.3.0.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/wp-biographia.2.4.0.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/wp-biographia.2.4.1.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/wp-biographia.2.4.2.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/wp-biographia.2.4.3.zip",
        "2.4.4": "https://downloads.wordpress.org/plugin/wp-biographia.2.4.4.zip",
        "3.0": "https://downloads.wordpress.org/plugin/wp-biographia.3.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/wp-biographia.3.0.1.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/wp-biographia.3.1.0.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/wp-biographia.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/wp-biographia.3.2.1.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/wp-biographia.3.3.0.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/wp-biographia.3.3.1.zip",
        "3.3.2": "https://downloads.wordpress.org/plugin/wp-biographia.3.3.2.zip",
        "4.0.0": "https://downloads.wordpress.org/plugin/wp-biographia.4.0.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wp-biographia.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://www.vicchi.org/codeage/donate/",
    "banners": {
        "low": "https://ps.w.org/wp-biographia/assets/banner-772x250.png?rev=486951",
        "high": false
    },
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/wp-biographia_f0f0f0.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}