{
    "name": "WP BASE Booking of Appointments, Services and Events",
    "slug": "wp-base-booking-of-appointments-services-and-events",
    "version": "4.7.0",
    "author": "<a href=\"https://wp-base.com\">Hakan Ozevin </a>",
    "author_profile": "https://profiles.wordpress.org/puckrobin/",
    "contributors": {
        "puckrobin": {
            "profile": "https://profiles.wordpress.org/puckrobin/",
            "avatar": "https://secure.gravatar.com/avatar/cf2a3b83f3a24d8b1db410e396599474?s=96&d=monsterid&r=g",
            "display_name": "Hakan Ozevin"
        }
    },
    "requires": "4.4.0",
    "tested": "6.6.1",
    "requires_php": "5.5.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 28,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 29,
    "support_url": "https://wordpress.org/support/plugin/wp-base-booking-of-appointments-services-and-events/",
    "support_threads": 2,
    "support_threads_resolved": 2,
    "active_installs": 300,
    "downloaded": 35574,
    "last_updated": "2024-08-24 2:38am GMT",
    "added": "2018-07-08",
    "homepage": "https://wp-base.com",
    "sections": {
        "description": "<p>WP BASE Booking of Appointments, Services and Events is a complete appointment booking e-commerce solution that allows business owners with or without service providers accept hourly or daily appointment reservations from front end and manage or manually create appointments from admin side.<br />\nIt is easily extendable with addons and highly customizable with settings, shortcodes and filter/action hooks if required. Various free and premium extensions, including addons for integration with WooCommerce, Google Calendar, PayPal, Stripe, Twilio, WPML, BuddyPress, Appointments+ are available.<br />\nVisit our <a href=\"https://demo.wp-base.com\" rel=\"nofollow ugc\">demo website</a> for examples and learn more at <a href=\"https://wp-base.com\" rel=\"nofollow ugc\">WP BASE.com</a>.</p>\n<h4>Documentation</h4>\n<ul>\n<li>Developer and user instructions can be found in our <a href=\"https://wp-base.com/knowledge-base/\" rel=\"nofollow ugc\">Knowledge Base</a></li>\n</ul>\n<h4>Unique Features</h4>\n<ul>\n<li>Your clients can pick service, provider, time slot, fill booking form, modify any selection and confirm booking on the same page. During the whole booking process, everything is in your client&#8217;s viewport.</li>\n<li>Loads its css and javascript files only to the pages it is used. It does not pollute whole website.</li>\n<li>WP BASE can be used in post content, inserted to templates, sidebar widgets and even to popups.</li>\n<li>Unprecedented working hour setting procedure allows even irregular work schedules easy to set.</li>\n<li>Extremely sound software and database design allows hundreds of locations, services, providers each having own complex schedules to be used without having significant effect on page load speed.</li>\n<li>With optional addons, it can be used as a <a href=\"https://wp-base.com/downloads/multi-vendor-marketplace/\" rel=\"nofollow ugc\">Multi Vendor Marketplace</a> with <a href=\"https://wpgeodirectory.com/?ref=298\" rel=\"nofollow ugc\">GeoDirectory</a> support, it can integrate with <a href=\"https://wp-base.com/downloads/woocommerce/\" rel=\"nofollow ugc\">Woocommerce</a>, <a href=\"https://wp-base.com/downloads/google-calendar/\" rel=\"nofollow ugc\">Google Calendar</a>, <a href=\"https://wp-base.com/downloads/buddypress/\" rel=\"nofollow ugc\">BuddyPress</a> with <a href=\"https://www.buddyboss.com/ref/835/\" rel=\"nofollow ugc\">BuddyBoss</a> support, <a href=\"https://wp-base.com/downloads/easy-digital-downloads-integration/\" rel=\"nofollow ugc\">Easy Digital Downloads</a>, <a href=\"https://wp-base.com/downloads/online-meetings/\" rel=\"nofollow ugc\">Zoom</a> and several other third party platforms.</li>\n<li>With addons it can use <a href=\"https://wp-base.com/downloads/payment-gateway-paypal-standard/\" rel=\"nofollow ugc\">PayPal</a>, <a href=\"https://wp-base.com/downloads/payment-gateway-stripe/\" rel=\"nofollow ugc\">Stripe</a>, <a href=\"https://wp-base.com/downloads/payment-gateway-authorizenet-aim/\" rel=\"nofollow ugc\">authorize.net AIM</a> as payment gateways, send SMS notifications with <a href=\"https://wp-base.com/downloads/sms/\" rel=\"nofollow ugc\">Twilio</a>.</li>\n<li>As far as we know, there is no similar product in the market which can achieve all the above.</li>\n</ul>\n<h4>General Features</h4>\n<ul>\n<li>Designed for <strong>maximum conversion rate</strong>: No steps, no page refreshes. Booking is as easy as 1 click. Also Flex Steps booking method is selectable for smaller footprint</li>\n<li>Uses ajax: Client stays on the same page even after changing service or date</li>\n<li>Intuitive: On page load, automatically shows your current availability for your popular service. Client can further browse through other dates and services.</li>\n<li>Responsive: Automatic adaption to different page and screen widths</li>\n<li>Mobile device support: Automatic detection of mobile phone connection and switching to appropriate display</li>\n<li>Easy Setup: With just one click and a single shortcode you can create a fully functional booking page and start accepting bookings immediately</li>\n<li>Flexible: Several booking methods (weekly, monthly, in table view) and themes to select from</li>\n<li>Multi site support: Automatic creation of database tables for existing and new subsites in Multi Site Installation</li>\n<li>Scalable: Can be extended to thousands of services and providers. Many addons to choose from.</li>\n</ul>\n<h4>Services</h4>\n<ul>\n<li>Unlimited number of services can be defined</li>\n<li>Service durations can be set from 5 minutes to 30 days</li>\n<li>Services can be custom sorted</li>\n<li>For each service description and featured image can be defined to be displayed in tooltip</li>\n<li>Services can be assigned to any unique member of the website</li>\n<li>Services can have any capacity with or without assigned providers allowing more than one booking/client per slot</li>\n</ul>\n<h4>Working Hours</h4>\n<ul>\n<li>Working hours are configured using a <strong>unique, simple, intuitive graphical interface</strong></li>\n<li>Any combination of working hours for each week day up from 5 minutes intervals can be easily entered</li>\n<li>Even irregular schedules can be set in just seconds</li>\n<li>Services can have own working hours making them usable without service providers</li>\n<li>No need to define break hours: If not picked as a working time, a slot is automatically assigned as a break time</li>\n<li>Multiple working hour tables for services, service providers can be opened, displayed and saved at the same time</li>\n<li>Copy/paste of working hours from one service to another or to several services</li>\n</ul>\n<h4>Listing of Bookings on the Front End</h4>\n<ul>\n<li>Client can view own bookings, plus admin can view any other client&#8217;s or all bookings</li>\n<li>Display according to status, start and end dates</li>\n<li>Dynamic search, filtering and sorting of the booking list</li>\n<li>Selectable and custom sortable columns</li>\n<li>Different selectable columns for mobile devices to use screen efficiently</li>\n<li>Cancellation of bookings by the client using confirmation email or button on the website with adjustable limit time</li>\n</ul>\n<h4>Booking and Editing on the Admin Side</h4>\n<ul>\n<li>Manual Booking by admin on behalf of a client, e.g. appointments accepted over phone or email</li>\n<li>Manual booking can be selected to respect the same availability conditions as the front end</li>\n<li>Fast manual booking for repeat customers by Rebook button with selecting first available time</li>\n<li>Filtering of bookings by month, service and balance (negative/positive)</li>\n<li>Search over booking ids, user names, emails, booking note and any of the client fields</li>\n<li>Selecting and editing multiple bookings by a single or multiple admins</li>\n<li>Bulk status change of selected bookings possible</li>\n</ul>\n<h4>Emails</h4>\n<ul>\n<li>Automatic email sending with separate custom templates for confirmation, pending, cancellation, completion states</li>\n<li>Sending of test emails to check configuration</li>\n<li>Multiple email addresses can be defined for multiple admins</li>\n<li>Automatic and manual sending of notification emails for each appointment status</li>\n<li>Possibility to use all booking and user variables in the templates</li>\n<li>Possibility to use list of bookings shortcode in the email templates, i.e. inform user about their past, future or all bookings</li>\n</ul>\n<h4>Look and Feel</h4>\n<ul>\n<li>Configurable confirmation and pending message popup with HTML support</li>\n<li>Configurable Terms &amp; Conditions popup on front end. If enabled, client cannot apply without confirming terms</li>\n<li>Booking in list/table view or weekly or monthly calendars, selectable within the shortcode and auto switching for mobile devices</li>\n<li>Selection from 12 included jQuery UI standard themes to match your WordPress theme</li>\n<li>Custom jQuery UI theme or css file can be created to override existing styles and saved against being overwritten by plugin updates</li>\n</ul>\n<h4>Help System</h4>\n<ul>\n<li>Inline settings help inside the plugin</li>\n<li>Further documentation available at <a href=\"https://wp-base.com/knowledge-base/\" rel=\"nofollow ugc\">WP BASE.com</a></li>\n</ul>\n<h4>Localization</h4>\n<ul>\n<li>Automatic adaptation to time and date formats, start day of the week settings of WordPress</li>\n<li>All front end messages and texts can be easily customized or translated on admin side <strong>without any additional tool</strong></li>\n<li>Ready for translation for other (admin side) texts</li>\n<li>Support for RTL and calendars starting on Saturday, Sunday and Monday</li>\n</ul>\n<h4>Performance</h4>\n<ul>\n<li>Integrated Native Object Caching</li>\n<li>Lazy Load function for fast page loading</li>\n<li>Compatible to major caching plugins</li>\n<li>Free from PHP sessions. No front end cookie writing (cookies are set with ajax). Thus graceful to server side caching</li>\n<li>Scalable to virtually unlimited bookings, services and providers</li>\n</ul>\n<h4>Developer Friendly</h4>\n<ul>\n<li>Integrated Custom Functions tab which can be used to add own php codes without the need for modifying php files</li>\n<li>About 300 WordPress hooks for further customization (With addons more than 1200)</li>\n<li>Automatic recognition of shortcodes in page templates</li>\n<li>Functions to read/add/edit/delete bookings, services, providers</li>\n<li>Debug mode to help locate errors</li>\n</ul>\n<h4>Other Features</h4>\n<ul>\n<li>Automatic removal of unconfirmed (pending) bookings after a preset time</li>\n<li>Client can cancel own bookings using link in email, or their account, if allowed so</li>\n<li>Client can confirm own booking using link in email, e.g. to verify their email address</li>\n<li>Admin side schedules display bookings in weekly and monthly views. Free slots are clickable to add a new booking</li>\n<li>Clients can be automatically registered as WordPress users upon submission and notified about their registration</li>\n<li>Account page that displays user submitted values and booking list is automatically created for clients</li>\n<li>Admin toolbar submenu to access plugin created pages</li>\n<li>JavaScript and css files are only loaded on plugin related pages both on front end and admin side, to reduce conflicts</li>\n<li>Compatible with major page builders and caching plugins</li>\n<li>Admin side graphical reports for bookings and revenue</li>\n</ul>\n<h4>With Advanced Features Premium Addon</h4>\n<ul>\n<li><a href=\"https://wp-base.com/downloads/advanced-features/\" rel=\"nofollow ugc\">Advanced Features Addon</a> is a must use for professional websites. It extends functionality and display of your website in several ways.</li>\n<li>Additional booking View &#8220;Flex View&#8221; which combines advantages of all other views into one</li>\n<li>Classic sidebar widgets can be used for booking</li>\n<li>GDPR compliance from WP 4.9.6 (Erase and export user data upon user request)</li>\n<li>Timezone support: Automatically dedect client timezone to let them display available time slots in their own timezones</li>\n<li>Possibility to define Trial Services for which clients can make booking for limited number of times</li>\n</ul>\n<h4>With Service Providers Premium Addon</h4>\n<ul>\n<li><a href=\"https://wp-base.com/downloads/service-providers/\" rel=\"nofollow ugc\">Service Providers Addon</a> allows assigning members of your website as staff who will provide your services.</li>\n<li>Unlimited number of service providers can be defined</li>\n<li>Providers can be assigned to one or more services</li>\n<li>Providers can view their assignments on their account page</li>\n<li>Providers can be randomly assigned to an appointment if client does not have a preference</li>\n<li>Providers can create/edit/delete own services, confirm/edit own bookings, manage own working hours and holidays if set so</li>\n<li>First provider, then service can be picked on front end</li>\n</ul>\n<h4>Free Addons incorporated into the core from V4.0</h4>\n<ul>\n<li><a href=\"https://wp-base.com/downloads/easy-digital-downloads-integration/\" rel=\"nofollow ugc\">Easy Digital Downloads Integration</a>: WP BASE services can be sold as digital products (downloads) of EDD alone, with other services or with other downloads.</li>\n<li><a href=\"https://wp-base.com/downloads/export-import/\" rel=\"nofollow ugc\">Export &amp; Import</a>: Allows export and import of WP BASE settings and database tables to/from another site/subsite. Includes import option from <a href=\"https://github.com/wpmudev/appointments\" rel=\"nofollow ugc\">Appointments by WPMU DEV</a>.</li>\n<li><a href=\"https://wp-base.com/downloads/extended-service-features-categories/\" rel=\"nofollow ugc\">Extended Service Features &amp; Categories Addon</a> allows several website settings to be applied per service. It also adds category support to services.</li>\n<li><a href=\"https://wp-base.com/downloads/front-end-edit/\" rel=\"nofollow ugc\">Front End Edit</a>: Allows client edit their bookings, reschedule appointments, modify user fields on the front end. Admins or any user with selected capability, e.g. editors, can also edit others&#8217; bookings using the same interface.</li>\n<li><a href=\"https://wp-base.com/downloads/front-end-booking-management/\" rel=\"nofollow ugc\">Front End Booking Management</a>: Allows admin or any user with selected capability add and edit all bookings and submitted user fields on the front end.</li>\n<li><a href=\"https://wp-base.com/downloads/limited-availability/\" rel=\"nofollow ugc\">Limited Availability</a>: Availability of each service can be easily set on a full calendar making them suitable for event or Airbnb type rental bookings.</li>\n<li><a href=\"https://wp-base.com/downloads/manual-payments/\" rel=\"nofollow ugc\">Manual Payments</a>: Allows adding and editing records for offline (bank transfer, cheque, cash) payments.</li>\n<li><a href=\"https://wp-base.com/downloads/shopping-cart/\" rel=\"nofollow ugc\">Shopping Cart</a>: Allows clients book multiple appointments in a single checkout. Minimum and maximum number of appointments per booking is selectable. Can be used to book on different pages and make a single checkout on any page.</li>\n<li><a href=\"https://wp-base.com/downloads/quotas/\" rel=\"nofollow ugc\">Quotas</a>: Different quotas (maximum number of future or completed bookings) can be set per service. Different quotas can be defined per week days, weekend days and holidays, per week and per month.</li>\n<li><a href=\"https://wp-base.com/knowledge-base/test-bookings/\" rel=\"nofollow ugc\">Test Bookings</a>: Given number of partly or fully random test bookings can be created for test purposes.</li>\n</ul>\n<h4>Premium Addons</h4>\n<ul>\n<li><a href=\"https://wp-base.com/downloads/buddypress/\" rel=\"nofollow ugc\">BuddyPress</a>: Adds settings, list of bookings and calendars on BuddyPress front end user pages.</li>\n<li><a href=\"https://wp-base.com/downloads/coupons/\" rel=\"nofollow ugc\">Coupons</a>: Applies discount over total payable amount upon submission of coupon code. Start and end dates, maximum usage, applicable services and/or providers can be selected.</li>\n<li><a href=\"https://wp-base.com/downloads/custom-variable-pricing/\" rel=\"nofollow ugc\">Custom Pricing</a>: Payment and down payment amounts can be formulated depending on any variable, for example to apply special price for happy hours</li>\n<li><a href=\"https://wp-base.com/downloads/credits/\" rel=\"nofollow ugc\">Credits</a>: Adds a deposit system to your website that allows your clients to purchase credit points and then redeem it at a later point for your services.</li>\n<li><a href=\"https://wp-base.com/downloads/extras/\" rel=\"nofollow ugc\">Extras</a>: Allows adding unlimited number of &#8220;extras&#8221; which can be used to offer selectable additional service options to the client. Extras can be applied to locations, services and service providers.</li>\n<li><a href=\"https://eb.wp-base.com/\" rel=\"nofollow ugc\">Event Bookings</a>: Any post/page/custom post can be easily configured to be bookable as event</li>\n<li><a href=\"https://wp-base.com/downloads/google-calendar/\" rel=\"nofollow ugc\">Google Calendar</a>: Integrates Google Calendar with WP BASE. Any new booking can be added to GCal as a new event and any new event entered in GCal can be added as a new booking in WP BASE. Updates in case of editing and cancellation are automatic.</li>\n<li><a href=\"https://wp-base.com/downloads/group-bookings/\" rel=\"nofollow ugc\">Group Bookings</a>: Allows client book for more than one person with a single booking. Client can provide a list of participants who can also receive emails. Person Types are supported</li>\n<li><a href=\"https://wp-base.com/downloads/locations/\" rel=\"nofollow ugc\">Locations</a>: Services can be assigned to one or more location. This feature can also be used to group services and limit their availability depending on capacity, e.g. multiple doctors using a single examination room</li>\n<li><a href=\"https://wp-base.com/downloads/multi-language/\" rel=\"nofollow ugc\">Multi Language</a>: Allows booking selections and variables to be displayed in preferred language of the visitor</li>\n<li><a href=\"https://wp-base.com/downloads/multi-vendor-marketplace/\" rel=\"nofollow ugc\">Multi Vendor Marketplace</a>: Providers can register to the website, sell their services and manage their bookings</li>\n<li><a href=\"https://wp-base.com/downloads/online-meetings/\" rel=\"nofollow ugc\">Online Meetings (Zoom &amp; Jitsi &amp; Agora)</a>: Allows integration with Zoom, Jitsi and Agora video/audio conferencing system</li>\n<li><a href=\"https://wp-base.com/downloads/packages/\" rel=\"nofollow ugc\">Packages</a>: Allows admin combine two or more services as jobs of a package and sell them as a single service. Time delays between service jobs can be set.</li>\n<li>Payment Gateways: 2checkout, <a href=\"https://wp-base.com/downloads/payment-gateway-authorizenet-aim/\" rel=\"nofollow ugc\">authorize.net AIM</a>, Paymill, <a href=\"https://wp-base.com/downloads/payment-gateway-paypal-standard/\" rel=\"nofollow ugc\">Paypal</a>, Simplify by Mastercard, <a href=\"https://wp-base.com/downloads/payment-gateway-stripe/\" rel=\"nofollow ugc\">Stripe</a> support available.</li>\n<li><a href=\"https://wp-base.com/downloads/pdf-attachments/\" rel=\"nofollow ugc\">PDF Attachments</a>: Allows dynamically creating PDF files with booking details and attach them to emails</li>\n<li><a href=\"https://wp-base.com/downloads/recurring-appointments/\" rel=\"nofollow ugc\">Recurring Appointments</a>: Allows clients select recurring appointments on the front end with selectable recurring frequencies daily, every other day, weekly, biweekly and monthly.</li>\n<li><a href=\"https://wp-base.com/downloads/reminder-follow-up-emails/\" rel=\"nofollow ugc\">Reminder &amp; Follow-up emails</a>: Sends automatic reminder emails to clients before appointment time and to clients whose bookings have negative balance and below a set amount</li>\n<li><a href=\"https://wp-base.com/downloads/seasonal-working-hours/\" rel=\"nofollow ugc\">Seasonal Working Hours</a>: Allows weekly &#8220;alternative&#8221; schedules to be defined and assigned to services and service providers, making it possible to create working hour settings changing every week within the year, e.g. for shift work</li>\n<li><a href=\"https://wp-base.com/downloads/sms/\" rel=\"nofollow ugc\">SMS</a>: Sends SMS messages as confirmation, pending, cancellation, completion and reminder using Twilio service. Different message templates for different groups (client, provider, admin) can be used.</li>\n<li><a href=\"https://wp-base.com/downloads/user-defined-fields/\" rel=\"nofollow ugc\">User Defined Fields</a>: Allows admin add unlimited number of fields in the confirmation form. Text, textarea, option/select and checkbox fields are supported. User defined select/option functions can be added.</li>\n<li><a href=\"https://wp-base.com/downloads/variable-durations/\" rel=\"nofollow ugc\">Variable Durations</a>: Allows service durations to be variable based on date, time and/or provider. Also allows clients pick desired duration for configured services within set limits</li>\n<li><a href=\"https://wp-base.com/downloads/waiting-list/\" rel=\"nofollow ugc\">Waiting List</a>: Allows clients to apply for a waiting list when desired time slot is full. When there is an opening in the service, clients in the waiting list are informed by email.</li>\n<li><a href=\"https://wp-base.com/downloads/woocommerce/\" rel=\"nofollow ugc\">Woocommerce Integration</a>: Integrates WP BASE with WooCommerce and allows selling of services as Woocommerce products</li>\n<li><a href=\"https://wp-base.com/downloads/wp-base-developer-package/\" rel=\"nofollow ugc\">WP BASE Developer Package</a>: includes all current and future addons usable in multiple client websites</li>\n</ul>\n",
        "faq": "\n<dt id='how%20to%20start%20using%20it%3F'>\nHow to start using it?\n</h4>\n<p>\n<p>Either insert [app_book] shortcode to any WordPress post/page or use Quick Start function on plugin settings page.</p>\n</p>\n<dt id='is%20wp%20base%20responsive%3F'>\nIs WP BASE responsive?\n</h4>\n<p>\n<p>Yes. It will automatically adapt to any screen size. Additionally you may set special views for mobile devices.</p>\n</p>\n<dt id='is%20wp%20base%20multi%20site%20compatible%3F'>\nIs WP BASE multi site compatible?\n</h4>\n<p>\n<p>Yes. WP BASE will run independently on each subsite of a WordPress network.</p>\n</p>\n<dt id='does%20this%20plugin%20work%20with%20any%20theme%3F'>\nDoes this plugin work with any theme?\n</h4>\n<p>\n<p>Yes. WP BASE will work on any properly coded theme including page builders like Divi, WP Bakery, Elementor, etc. For a list of tested page builder plugins please see our <a href=\"https://wp-base.com/knowledge-base/compatibility/\" rel=\"nofollow ugc\">Knowledge Base</a>.</p>\n</p>\n<dt id='does%20this%20plugin%20work%20with%20caching%20plugins%3F'>\nDoes this plugin work with caching plugins?\n</h4>\n<p>\n<p>Yes. It will work with all popular caching plugins, without disabling their caching capability. For a list of compatible plugins please see our <a href=\"https://wp-base.com/knowledge-base/compatibility/\" rel=\"nofollow ugc\">Knowledge Base</a>.</p>\n</p>\n<dt id='i%20need%20a%20booking%20system%2C%20but%20i%20don%27t%20want%20to%20waste%20too%20much%20time%20to%20see%20if%20this%20plugin%20works%20for%20me.%20can%20i%20make%20a%20quick%20test%3F'>\nI need a booking system, but I don&#8217;t want to waste too much time to see if this plugin works for me. Can I make a quick test?\n</h4>\n<p>\n<p>Yes, indeed. We are aware that time is money. Just follow <a href=\"https://wp-base.com/knowledge-base/quick-start/\" rel=\"nofollow ugc\">Quick Start</a> instructions. In a few minutes you can actually make a booking and decide if WP BASE is for you.</p>\n</p>\n<dt id='how%20many%20services%20and%20bookings%20can%20i%20have%3F'>\nHow many services and bookings can I have?\n</h4>\n<p>\n<p>Unlimited. WP BASE is exceptionally scalable. It can be used for a single service, as well as thousands of services without significant impact on page speed.</p>\n</p>\n<dt id='how%20many%20calendars%20can%20i%20have%3F'>\nHow many calendars can I have?\n</h4>\n<p>\n<p>Unlimited. WP BASE can create dynamic calendars that have service selection menu and update with service selection, and it can also create those with a fixed service. In both cases there is no limit.</p>\n</p>\n<dt id='are%20there%20any%20considerations%20for%20uninstall%3F'>\nAre there any considerations for uninstall?\n</h4>\n<p>\n<p>If you installed WP BASE on a single site WordPress and you do not have any bookings, WP BASE will completely delete all its tables and settings during uninstall. If you have bookings or installed the plugin on a multi site, please see our <a href=\"https://wp-base.com/knowledge-base/uninstalling/\" rel=\"nofollow ugc\">Knowledge Base</a>.</p>\n</p>\n<dt id='is%20this%20demo%20of%20a%20pro%20version%3F'>\nIs this Demo of a Pro version?\n</h4>\n<p>\n<p>With unlimited services, unrestricted bookings, email sending feature, WP BASE Core is a fully functional booking system which is sufficient for most of <em>individual</em> booking needs. However, if your business requires more, we do have Premium (and also free) <a href=\"https://wp-base.com/addons/\" rel=\"nofollow ugc\">addons</a>. WP BASE Core which you can download from wordpress.org, will always stay free.</p>\n</p>\n\n",
        "changelog": "<h4>V4.7.0 August 24, 2024</h4>\n<ul>\n<li>Fix: Limited availability dates do not always work for services with duration 2+ days</li>\n<li>Fix: At account page, calendars are updated at first load</li>\n<li>Changes and fixes related to premium addons:</li>\n<li>New: 1 month to 12 months booking duration can be selected in Selectable Durations</li>\n<li>Tweak/Fix: Old confirmation form is not working for Event Bookings. Replaced with the new Checkout form</li>\n<li>Fix: When editing an admin booking record, checking/unchecking send email check box affects other UDF check boxes</li>\n<li>Fix: PHP8 error when a non logged in user makes a booking and UDF addon enabled</li>\n<li>Fix: Event Bookings selected guest number drops down to 1 when payment method selected</li>\n</ul>\n<h4>V4.6.0 August 04, 2024</h4>\n<ul>\n<li>New: Confirmation Form now uses the same markup and styling of Flex Steps Checkout</li>\n<li>Change: Remember Me field retired</li>\n<li>Change: Several settings about confirmation form layout and css retired</li>\n<li>Change: Theme Builder Compatibility setting retired. Now compatibility is always on</li>\n<li>Change: Lazy Load, Use Cache settings retired</li>\n<li>Fix: When service duration is exactly 7 days, service availabilities are incorrect</li>\n<li>Fix: Deprecated messages in PHP8.3.9</li>\n<li>Changes and fixes related to premium addons:</li>\n<li>Fix: Wrong escaping of paginate links in Coupons, Custom Pricing, Extras, Locations, Seasonal Working Hours, UDF</li>\n</ul>\n<h4>V4.5.0 June 29, 2024</h4>\n<ul>\n<li>New: Booking lasting longer than 24 hours are displayed on a monthly calendar on admin schedules and provider/owner account</li>\n<li>Tweak: WordPress V6.6 tested for compatibility</li>\n<li>Tweak: Flex Steps now support Shopping Cart</li>\n<li>Fix: Permanently Delete Selected Records button is not working</li>\n<li>Changes and fixes related to premium addons:</li>\n<li>Fix: Provider Free bookings should show in service owner&#8217;s account under manage bookings and should be counted in the dashboard</li>\n<li>Fix: PM button should show for Provider Free bookings</li>\n<li>Fix: WooCommerce Order ID is not displayed in admin bookings in HPOS if compatibility mode deactivated</li>\n</ul>\n<h4>V4.4.0 June 04, 2024</h4>\n<ul>\n<li>New: &#8220;Flex Steps&#8221; booking process</li>\n<li>Changes and fixes related to premium addons:</li>\n<li>Tweak: Admin can upload provider and vendor avatar</li>\n<li>Tweak: Admin can enter description for provider</li>\n<li>Fix: Only one of Location, Service or Worker (top prior one) is allowed to use slider</li>\n<li>Fix: Provider display name cannot be changed on admin Providers page</li>\n<li>Fix: When Multi Language is activated, after payment with Credits client is redirected to a non-existing page</li>\n<li>Fix: When Recurring Appointments + Selectable Durations are used at the same time, booking end times are not correct</li>\n<li>Fix: Editing Recurring Appointments children gives unexpected results</li>\n</ul>\n<h4>V4.3.0 April 10, 2024</h4>\n<ul>\n<li>Tweak: When a non logged in user enters email of an existing member during checkout, now login is handled better</li>\n<li>Fix: When slide count is entered as zero, slide should have fixed width</li>\n<li>Fix: If service image file is deleted, it is not possible to replace image with another one on Services page</li>\n<li>Changes and fixes related to premium addons:</li>\n<li>New: Integration with Better Messages: Now vendors and clients can write each other at meeting and waiting room pages. Users can send message to vendor at their bio pages</li>\n<li>New: Each service can be selected to have Online Meeting or not</li>\n<li>New: New shortcode [app_vendor_meta] which prints vendor info on bio page</li>\n<li>New: Trial services can be set to be free of charge</li>\n<li>New: UsersWP forms or lightboxes can be used as login and register methods</li>\n<li>Tweak: Clearer hints for adding a slot to waiting list</li>\n<li>Change: When Multi Vendor addon is active and there are vendors defined, [app_book] is regarded as [app_book worker=auto]</li>\n<li>Fix: When Zoom API token is expired, it may not be possible to regenerate it</li>\n<li>Fix: Services in vendor pages does not obey default sort order</li>\n</ul>\n<h4>V4.2.0 February 26, 2024</h4>\n<ul>\n<li>New: List of Bookings can be printed</li>\n<li>Tweak: WP6.5 compatibility</li>\n<li>Fix: Flexslider conflicts with WooCommerce default theme Storefront</li>\n<li>Fix: When slider is active, category opt_group should not be on</li>\n<li>Changes and fixes related to premium addons:</li>\n<li>New: Credit history and Commissions list can be printed</li>\n</ul>\n<h4>V4.1.0 February 6, 2024</h4>\n<ul>\n<li>Change: On user profile settings, only vendors can set WP fields (name, email, first name, last name ), for the rest users these fields are readonly</li>\n<li>Tweak: Better sync with WP fields in Vendors, Clients and user profile</li>\n<li>Fix: Flexslider height can be excessive if slider image aspect ratio &gt; 1</li>\n<li>Fix: Flexslider does not load correctly in Astra theme</li>\n<li>Changes and fixes related to premium addons:</li>\n<li>New: &#8220;Provider Free&#8221; services in Multi Vendor</li>\n<li>Tweak: Service lock: When vendor/provider is editing a service, record is locked and admin can know who is editing. He can then take over</li>\n<li>Fix: BuddyPress group &#8220;Book Us&#8221; page always chooses services for Group 1</li>\n<li>Fix: Not possible to use Jitsi and Agora at the same website</li>\n<li>Fix: After vendors edit a service, they lose ownership</li>\n<li>Fix: Preferred Language selection at profile is not reflected to displayed language</li>\n<li>Fix: Services owned, but not provided by vendor cannot be displayed at the front end</li>\n<li>Fix: When BuddyPress Groups/Locations connected, locations aren&#8217;t supposed to be selected by menu</li>\n<li>Fix: Registration form cannot be submitted</li>\n<li>Fix: Previously declined or suspended vendors should not apply to be vendor again</li>\n</ul>\n<h4>V4.0.1 January 12, 2024</h4>\n<ul>\n<li>Change: For daily services, if Limited Availability is enabled service working hours are no more needed</li>\n<li>Fix: If a price is not entered as download price previously, EDD bookings become free downloads</li>\n<li>Changes and fixes related to premium addons:</li>\n<li>Tweak: Credit records can be individually deleted</li>\n<li>Tweak: Note can be written when adding a credit record</li>\n<li>Tweak: PERSON_TYPES placeholder can be used in email templates</li>\n<li>Tweak: Multi Language support for person type labels and template</li>\n<li>Change: For daily services, if Limited Availability is enabled service working hours are no more needed</li>\n<li>Fix: When Group Bookings is used for a Package service, person types are not displayed on the front end</li>\n</ul>\n<h4>V4.0.0 December 23, 2023</h4>\n<ul>\n<li>New: Free addons are now delivered with WP BASE Core</li>\n<li>New: &#8220;Limited Availability&#8221; addon</li>\n<li>New: New setting &#8220;Show End Date Based on Venue Bookings&#8221; at Display Settings</li>\n<li>Change: Front End Edit and Front End Booking Management are now free addons</li>\n<li>Change: Sidebar widgets are no more loaded by default</li>\n<li>Changes and fixes related to addons:</li>\n<li>New: Person Types in Group Bookings</li>\n<li>New: Ultimate Member and UsersWP support in Multi Vendor</li>\n<li>New: &#8220;Flexible Price&#8221; feature for services in Multi Vendor Marketplace</li>\n<li>New: Support for WooCommerce checkout page that is created with WooCommerce Blocks</li>\n<li>Tweak: JWT settings in Online Meetings &#8211; Zoom have been completely removed</li>\n<li>Fix: PHP8.1+ error at time slot selection from Multi Vendor Marketplace when &#8220;Vendor can Set Own Price&#8221; is set as fixed, and min/max prices are set as zero and vendor did not enter any price yet</li>\n<li>Fix: In WP BASE DEV, repeated &#8220;FeaturesUtil::declare_compatibility … is not a known WordPress plugin&#8221; WooCommerce log messages</li>\n<li>Fix: PHP error in BuddyPress when Group component is deactivated and WooCommerce cart is selected as payment method</li>\n<li>Fix: Vendors cannot make booking in BuddyPress + WooCommerce configuration due to change in V3.9.7.2</li>\n</ul>\n<h4>V3.9.7 November 2, 2023</h4>\n<ul>\n<li>Tweak: WordPress V6.4 compatibility (z-index issue on checkboxes on admin side)</li>\n<li>Changes and fixes related to addons:</li>\n<li>Tweak: &#8220;Book Us&#8221; field of BuddyPress is now translatable</li>\n<li>Tweak: Better handling of category display at confirmation form </li>\n<li>Tweak: Category name is now displayed at admin booking record</li>\n<li>Tweak: Better UI for Group Bookings, Limits, Quotas, Packages, Variable Durations, Recurring App. service settings</li>\n<li>Fix: PHP error in category utility function get_services_by_category</li>\n<li>Fix: Missing MEETING email placeholder for Jitsi Meet</li>\n<li>Fix: When there are services with different durations in the cart, total duration is not displayed correctly</li>\n<li>Fix: Internal services cannot be selected for services provided in admin Providers and Vendors</li>\n</ul>\n<h4>V3.9.6 October 9, 2023</h4>\n<ul>\n<li>Changes and fixes related to addons:</li>\n<li>New: Completely new UI to handle service providers on admin side</li>\n<li>Tweak: WooCommerce HPOS compatibility</li>\n<li>Change: Account page is determined by post content now, instead of the_posts filter</li>\n<li>Fix: Extras are not being saved</li>\n<li>Fix: PHP8.2 deprecated notices in Multi Language</li>\n<li>Fix: PHP warning message in Online Meetings</li>\n<li>Fix: Pax availability is set according to Group Bookings even in services that are not enabled for Group Bookings</li>\n<li>Fix: Group Bookings number of pax is not correctly evaluated when Memcached option of SG Optimizer plugin is enabled</li>\n</ul>\n<h4>V3.9.5 September 15, 2023</h4>\n<ul>\n<li>Fix: When 31st day of a month is start day of the week, in monthly calendar it can only be viewed in the next month</li>\n<li>Fix: Wrong &#8220;client added&#8221; message on Clients page</li>\n<li>Fix: GeoDirectory plugin prevents day selection in monthly calendar</li>\n<li>Changes and fixes related to addons:</li>\n<li>Tweak: WooCommerce addon refactored</li>\n<li>Tweak: No need to set capability of user who can view BuddyPress group management tab contents</li>\n<li>Tweak: Credits column is now displayed in clients table</li>\n<li>Change: FEBM, BuddyPress and account page is no more using styles of WP admin, eliminating possible css conflict with the current theme</li>\n<li>Change: Multi Language flag icons were moved from WP BASE core to multi-language directory</li>\n<li>Fix: If vendor tries to submit a second GeoDirectory listing unrelated to bio page CPT, they receive &#8220;you are already vendor&#8221; message and submission denied</li>\n<li>Fix: Bulk status change does not work in Manage Bookings at the front end</li>\n<li>Fix: Completed bookings of previous year are accounted in current year&#8217;s weekly quota</li>\n</ul>\n<h4>V3.9.4 July 26, 2023</h4>\n<ul>\n<li>New: PHP8.2 compatibility (except SMS and PDF addons)</li>\n<li>Fix: In Firefox, when editing clients, vendors, commissions, if there is an entry error during save, no error message is displayed and page silently refreshes instead</li>\n<li>Changes and fixes related to addons:</li>\n<li>New: Google Calendar event color can be set for each service</li>\n<li>New: For BuddyPress groups, new settings for Book Us tab creation</li>\n<li>New: BuddyPress notifications have links to related booking tabs</li>\n<li>Tweak: Now notification email and SMS message is sent if a booking is paid with WC but saved as pending (not saved as paid)</li>\n<li>Tweak: In Online Meetings &#8211; Zoom, manually entered meeting details can be received to WP BASE</li>\n<li>Tweak: On front end manage bookings, vendors can only filter services that they have booking for</li>\n<li>Change: Default value for $startat parameter of &#8220;services_owned_by/get_services_owned_by&#8221; methods has been changed to -1 (No page limit)</li>\n<li>Fix: Child bookings of a package are not cancelled if parent booking is cancelled at List of Bookings</li>\n<li>Fix: In Online Meetings, if a saved booking is edited, its Zoom meeting details are lost on WP side</li>\n</ul>\n<h4>V3.9.3 June 4, 2023</h4>\n<ul>\n<li>Changes and fixes related to addons:</li>\n<li>New: Server-to-server Oauth authentication option for Online Meetings &#8211; Zoom</li>\n<li>Change: Update URI at plugin headers for WP BASE Dev</li>\n<li>Fix: PHP error in SMS addon while saving SMS reminder log</li>\n</ul>\n<h4>V3.9.2 May 16, 2023</h4>\n<ul>\n<li>New: New setting Theme Builder Compatibility</li>\n<li>Change: Pages to Preload setting has retired as page caching is no more used</li>\n<li>Tweak: Also Reset Custom Texts selection in Reset function</li>\n<li>Fix: When shortcode is used on a template, using quotes in some of the custom texts prevents calendar functioning correctly</li>\n<li>Fix: qTip viewport error due to incompability of qTip2 with jQuery V3</li>\n<li>Changes and fixes related to addons:</li>\n<li>New: Event authors can also receive commission</li>\n<li>New BuddyPress email placeholders BP_CLIENT_BOOKINGS_URL, BP_BOOKINGS_URL, BP_BOOK_ME_URL</li>\n<li>Tweak: Commissions are also displayed at the account page</li>\n<li>Tweak: [app_book_event] shortcode now works on any template</li>\n<li>Tweak: Event Bookings can be edited at the front end with GeoDirectory author actions</li>\n<li>Fix: Event attendees cannot be printed</li>\n<li>Fix: With &#8220;Separate Working Hour Schedule for every Location&#8221; enabled, provider working hours for the location is not taken into account to determine if it is working day</li>\n</ul>\n<h4>V3.9.1 March 17, 2023</h4>\n<ul>\n<li>Tweak: Better handling of behavior on non-single pages</li>\n<li>Tweak: Consistent tooltip styling throughout admin</li>\n<li>Tweak: jQuery Multiselect is integrated in common-scripts.js</li>\n<li>Fix: Number of Bookings at Clients table show only value of the current week instead of all time</li>\n<li>Fix: In debug mode, all assets may not be loaded</li>\n<li>Fix: TinyMce shortcode insert/edit tool can now be used with Classic Editor plugin</li>\n<li>Changes and fixes related to addons:</li>\n<li>New: Providers can be allowed to use their own Stripe accounts to collect payments for their own bookings</li>\n<li>Tweak: Google Calendar is now fully compatible with PHP8.1 without PHP deprecated notices</li>\n<li>Tweak: Fields for unused addons are no more displayed at admin booking records, reducing crowding</li>\n<li>Fix: If booking is made inside DST for a date outside DST and vice versa, created Google Calendar event may be shifted</li>\n<li>Fix: If [app_book] shortcode is inserted outside post content, e.g. in an Elementor or similar page builder template, Stripe script cannot be called</li>\n</ul>\n<h4>V3.9.0 January 31, 2023</h4>\n<ul>\n<li>New: &#8220;Clients&#8221; admin menu item</li>\n<li>New: Number of pending bookings is now displayed in admin bar</li>\n<li>Tweak: Reset only email templates option on Tools &gt; Reset</li>\n<li>Tweak: Account tabs are now translatable in Custom Texts</li>\n<li>Tweak: When Table Start and Table End values are not set or set incorrectly, working hour tables show full day now</li>\n<li>Tweak: Minor changes on admin menu and admin toolbar</li>\n<li>Fix: Default options may not be set during initial installation</li>\n<li>Fix: Link to admin booking record includes type variable instead of status</li>\n<li>Fix: When date format is d/m/Y, bookings cannot be edited on admin bookings since V3.8.8.1</li>\n<li>Changes and fixes related to addons:</li>\n<li>New: Seasonal Schedules have owners now. Only owner or admin can use a custom schedule</li>\n<li>New: Vendors admin page now displays vendor images</li>\n<li>Tweak: Admin SEO title for Coupons</li>\n<li>Tweak: WooCommerce and WC Coupon support for WP BASE Packages</li>\n<li>Tweak: Better display of commissions by user role</li>\n<li>Change: Add New Custom Schedule button for Provider removed</li>\n<li>Fix: Vendor display name cannot be modified in Vendors page</li>\n<li>Fix: Vendor GeoDirectory category may not be assigned correctly</li>\n<li>Fix: Incorrect price for a service with Packages + Recurring Appointments</li>\n<li>Fix: Roles wpb_worker and wpb_client are removed after WP BASE Free version deleted but WP BASE Dev active</li>\n<li>Fix: Bookings of a Package is not correctly marked as package</li>\n<li>Fix: When using Packages + Recurring Appointments in a single service, bookings are not created as expected</li>\n<li>Fix: Uppercase or mixed case coupon codes are not matched</li>\n<li>Fix: After saving Seasonal Schedules at the front end, page not found warning is encountered due to conflict of &#8220;year&#8221; variable with WordPress core</li>\n<li>Fix: PHP notice in Event Bookings</li>\n<li>Fix: PHP notice in Timezones</li>\n<li>Fix: PHP error in BuddyPress when Social Groups is not activated but &#8220;Integrate Locations with Groups&#8221; WP BASE setting is selected</li>\n<li>Fix: PHP notice in Multi Vendor GeoDirectory integration after saving profile settings</li>\n</ul>\n<h4>For older logs see changelog.txt file in plugin folder</h4>\n"
    },
    "short_description": "The most feature rich and flexible appointment and service booking platform that allows business owners accept hourly or daily reservations.",
    "description": "<p>WP BASE Booking of Appointments, Services and Events is a complete appointment booking e-commerce solution that allows business owners with or without service providers accept hourly or daily appointment reservations from front end and manage or manually create appointments from admin side.<br />\nIt is easily extendable with addons and highly customizable with settings, shortcodes and filter/action hooks if required. Various free and premium extensions, including addons for integration with WooCommerce, Google Calendar, PayPal, Stripe, Twilio, WPML, BuddyPress, Appointments+ are available.<br />\nVisit our <a href=\"https://demo.wp-base.com\" rel=\"nofollow ugc\">demo website</a> for examples and learn more at <a href=\"https://wp-base.com\" rel=\"nofollow ugc\">WP BASE.com</a>.</p>\n<h4>Documentation</h4>\n<ul>\n<li>Developer and user instructions can be found in our <a href=\"https://wp-base.com/knowledge-base/\" rel=\"nofollow ugc\">Knowledge Base</a></li>\n</ul>\n<h4>Unique Features</h4>\n<ul>\n<li>Your clients can pick service, provider, time slot, fill booking form, modify any selection and confirm booking on the same page. During the whole booking process, everything is in your client&#8217;s viewport.</li>\n<li>Loads its css and javascript files only to the pages it is used. It does not pollute whole website.</li>\n<li>WP BASE can be used in post content, inserted to templates, sidebar widgets and even to popups.</li>\n<li>Unprecedented working hour setting procedure allows even irregular work schedules easy to set.</li>\n<li>Extremely sound software and database design allows hundreds of locations, services, providers each having own complex schedules to be used without having significant effect on page load speed.</li>\n<li>With optional addons, it can be used as a <a href=\"https://wp-base.com/downloads/multi-vendor-marketplace/\" rel=\"nofollow ugc\">Multi Vendor Marketplace</a> with <a href=\"https://wpgeodirectory.com/?ref=298\" rel=\"nofollow ugc\">GeoDirectory</a> support, it can integrate with <a href=\"https://wp-base.com/downloads/woocommerce/\" rel=\"nofollow ugc\">Woocommerce</a>, <a href=\"https://wp-base.com/downloads/google-calendar/\" rel=\"nofollow ugc\">Google Calendar</a>, <a href=\"https://wp-base.com/downloads/buddypress/\" rel=\"nofollow ugc\">BuddyPress</a> with <a href=\"https://www.buddyboss.com/ref/835/\" rel=\"nofollow ugc\">BuddyBoss</a> support, <a href=\"https://wp-base.com/downloads/easy-digital-downloads-integration/\" rel=\"nofollow ugc\">Easy Digital Downloads</a>, <a href=\"https://wp-base.com/downloads/online-meetings/\" rel=\"nofollow ugc\">Zoom</a> and several other third party platforms.</li>\n<li>With addons it can use <a href=\"https://wp-base.com/downloads/payment-gateway-paypal-standard/\" rel=\"nofollow ugc\">PayPal</a>, <a href=\"https://wp-base.com/downloads/payment-gateway-stripe/\" rel=\"nofollow ugc\">Stripe</a>, <a href=\"https://wp-base.com/downloads/payment-gateway-authorizenet-aim/\" rel=\"nofollow ugc\">authorize.net AIM</a> as payment gateways, send SMS notifications with <a href=\"https://wp-base.com/downloads/sms/\" rel=\"nofollow ugc\">Twilio</a>.</li>\n<li>As far as we know, there is no similar product in the market which can achieve all the above.</li>\n</ul>\n<h4>General Features</h4>\n<ul>\n<li>Designed for <strong>maximum conversion rate</strong>: No steps, no page refreshes. Booking is as easy as 1 click. Also Flex Steps booking method is selectable for smaller footprint</li>\n<li>Uses ajax: Client stays on the same page even after changing service or date</li>\n<li>Intuitive: On page load, automatically shows your current availability for your popular service. Client can further browse through other dates and services.</li>\n<li>Responsive: Automatic adaption to different page and screen widths</li>\n<li>Mobile device support: Automatic detection of mobile phone connection and switching to appropriate display</li>\n<li>Easy Setup: With just one click and a single shortcode you can create a fully functional booking page and start accepting bookings immediately</li>\n<li>Flexible: Several booking methods (weekly, monthly, in table view) and themes to select from</li>\n<li>Multi site support: Automatic creation of database tables for existing and new subsites in Multi Site Installation</li>\n<li>Scalable: Can be extended to thousands of services and providers. Many addons to choose from.</li>\n</ul>\n<h4>Services</h4>\n<ul>\n<li>Unlimited number of services can be defined</li>\n<li>Service durations can be set from 5 minutes to 30 days</li>\n<li>Services can be custom sorted</li>\n<li>For each service description and featured image can be defined to be displayed in tooltip</li>\n<li>Services can be assigned to any unique member of the website</li>\n<li>Services can have any capacity with or without assigned providers allowing more than one booking/client per slot</li>\n</ul>\n<h4>Working Hours</h4>\n<ul>\n<li>Working hours are configured using a <strong>unique, simple, intuitive graphical interface</strong></li>\n<li>Any combination of working hours for each week day up from 5 minutes intervals can be easily entered</li>\n<li>Even irregular schedules can be set in just seconds</li>\n<li>Services can have own working hours making them usable without service providers</li>\n<li>No need to define break hours: If not picked as a working time, a slot is automatically assigned as a break time</li>\n<li>Multiple working hour tables for services, service providers can be opened, displayed and saved at the same time</li>\n<li>Copy/paste of working hours from one service to another or to several services</li>\n</ul>\n<h4>Listing of Bookings on the Front End</h4>\n<ul>\n<li>Client can view own bookings, plus admin can view any other client&#8217;s or all bookings</li>\n<li>Display according to status, start and end dates</li>\n<li>Dynamic search, filtering and sorting of the booking list</li>\n<li>Selectable and custom sortable columns</li>\n<li>Different selectable columns for mobile devices to use screen efficiently</li>\n<li>Cancellation of bookings by the client using confirmation email or button on the website with adjustable limit time</li>\n</ul>\n<h4>Booking and Editing on the Admin Side</h4>\n<ul>\n<li>Manual Booking by admin on behalf of a client, e.g. appointments accepted over phone or email</li>\n<li>Manual booking can be selected to respect the same availability conditions as the front end</li>\n<li>Fast manual booking for repeat customers by Rebook button with selecting first available time</li>\n<li>Filtering of bookings by month, service and balance (negative/positive)</li>\n<li>Search over booking ids, user names, emails, booking note and any of the client fields</li>\n<li>Selecting and editing multiple bookings by a single or multiple admins</li>\n<li>Bulk status change of selected bookings possible</li>\n</ul>\n<h4>Emails</h4>\n<ul>\n<li>Automatic email sending with separate custom templates for confirmation, pending, cancellation, completion states</li>\n<li>Sending of test emails to check configuration</li>\n<li>Multiple email addresses can be defined for multiple admins</li>\n<li>Automatic and manual sending of notification emails for each appointment status</li>\n<li>Possibility to use all booking and user variables in the templates</li>\n<li>Possibility to use list of bookings shortcode in the email templates, i.e. inform user about their past, future or all bookings</li>\n</ul>\n<h4>Look and Feel</h4>\n<ul>\n<li>Configurable confirmation and pending message popup with HTML support</li>\n<li>Configurable Terms &amp; Conditions popup on front end. If enabled, client cannot apply without confirming terms</li>\n<li>Booking in list/table view or weekly or monthly calendars, selectable within the shortcode and auto switching for mobile devices</li>\n<li>Selection from 12 included jQuery UI standard themes to match your WordPress theme</li>\n<li>Custom jQuery UI theme or css file can be created to override existing styles and saved against being overwritten by plugin updates</li>\n</ul>\n<h4>Help System</h4>\n<ul>\n<li>Inline settings help inside the plugin</li>\n<li>Further documentation available at <a href=\"https://wp-base.com/knowledge-base/\" rel=\"nofollow ugc\">WP BASE.com</a></li>\n</ul>\n<h4>Localization</h4>\n<ul>\n<li>Automatic adaptation to time and date formats, start day of the week settings of WordPress</li>\n<li>All front end messages and texts can be easily customized or translated on admin side <strong>without any additional tool</strong></li>\n<li>Ready for translation for other (admin side) texts</li>\n<li>Support for RTL and calendars starting on Saturday, Sunday and Monday</li>\n</ul>\n<h4>Performance</h4>\n<ul>\n<li>Integrated Native Object Caching</li>\n<li>Lazy Load function for fast page loading</li>\n<li>Compatible to major caching plugins</li>\n<li>Free from PHP sessions. No front end cookie writing (cookies are set with ajax). Thus graceful to server side caching</li>\n<li>Scalable to virtually unlimited bookings, services and providers</li>\n</ul>\n<h4>Developer Friendly</h4>\n<ul>\n<li>Integrated Custom Functions tab which can be used to add own php codes without the need for modifying php files</li>\n<li>About 300 WordPress hooks for further customization (With addons more than 1200)</li>\n<li>Automatic recognition of shortcodes in page templates</li>\n<li>Functions to read/add/edit/delete bookings, services, providers</li>\n<li>Debug mode to help locate errors</li>\n</ul>\n<h4>Other Features</h4>\n<ul>\n<li>Automatic removal of unconfirmed (pending) bookings after a preset time</li>\n<li>Client can cancel own bookings using link in email, or their account, if allowed so</li>\n<li>Client can confirm own booking using link in email, e.g. to verify their email address</li>\n<li>Admin side schedules display bookings in weekly and monthly views. Free slots are clickable to add a new booking</li>\n<li>Clients can be automatically registered as WordPress users upon submission and notified about their registration</li>\n<li>Account page that displays user submitted values and booking list is automatically created for clients</li>\n<li>Admin toolbar submenu to access plugin created pages</li>\n<li>JavaScript and css files are only loaded on plugin related pages both on front end and admin side, to reduce conflicts</li>\n<li>Compatible with major page builders and caching plugins</li>\n<li>Admin side graphical reports for bookings and revenue</li>\n</ul>\n<h4>With Advanced Features Premium Addon</h4>\n<ul>\n<li><a href=\"https://wp-base.com/downloads/advanced-features/\" rel=\"nofollow ugc\">Advanced Features Addon</a> is a must use for professional websites. It extends functionality and display of your website in several ways.</li>\n<li>Additional booking View &#8220;Flex View&#8221; which combines advantages of all other views into one</li>\n<li>Classic sidebar widgets can be used for booking</li>\n<li>GDPR compliance from WP 4.9.6 (Erase and export user data upon user request)</li>\n<li>Timezone support: Automatically dedect client timezone to let them display available time slots in their own timezones</li>\n<li>Possibility to define Trial Services for which clients can make booking for limited number of times</li>\n</ul>\n<h4>With Service Providers Premium Addon</h4>\n<ul>\n<li><a href=\"https://wp-base.com/downloads/service-providers/\" rel=\"nofollow ugc\">Service Providers Addon</a> allows assigning members of your website as staff who will provide your services.</li>\n<li>Unlimited number of service providers can be defined</li>\n<li>Providers can be assigned to one or more services</li>\n<li>Providers can view their assignments on their account page</li>\n<li>Providers can be randomly assigned to an appointment if client does not have a preference</li>\n<li>Providers can create/edit/delete own services, confirm/edit own bookings, manage own working hours and holidays if set so</li>\n<li>First provider, then service can be picked on front end</li>\n</ul>\n<h4>Free Addons incorporated into the core from V4.0</h4>\n<ul>\n<li><a href=\"https://wp-base.com/downloads/easy-digital-downloads-integration/\" rel=\"nofollow ugc\">Easy Digital Downloads Integration</a>: WP BASE services can be sold as digital products (downloads) of EDD alone, with other services or with other downloads.</li>\n<li><a href=\"https://wp-base.com/downloads/export-import/\" rel=\"nofollow ugc\">Export &amp; Import</a>: Allows export and import of WP BASE settings and database tables to/from another site/subsite. Includes import option from <a href=\"https://github.com/wpmudev/appointments\" rel=\"nofollow ugc\">Appointments by WPMU DEV</a>.</li>\n<li><a href=\"https://wp-base.com/downloads/extended-service-features-categories/\" rel=\"nofollow ugc\">Extended Service Features &amp; Categories Addon</a> allows several website settings to be applied per service. It also adds category support to services.</li>\n<li><a href=\"https://wp-base.com/downloads/front-end-edit/\" rel=\"nofollow ugc\">Front End Edit</a>: Allows client edit their bookings, reschedule appointments, modify user fields on the front end. Admins or any user with selected capability, e.g. editors, can also edit others&#8217; bookings using the same interface.</li>\n<li><a href=\"https://wp-base.com/downloads/front-end-booking-management/\" rel=\"nofollow ugc\">Front End Booking Management</a>: Allows admin or any user with selected capability add and edit all bookings and submitted user fields on the front end.</li>\n<li><a href=\"https://wp-base.com/downloads/limited-availability/\" rel=\"nofollow ugc\">Limited Availability</a>: Availability of each service can be easily set on a full calendar making them suitable for event or Airbnb type rental bookings.</li>\n<li><a href=\"https://wp-base.com/downloads/manual-payments/\" rel=\"nofollow ugc\">Manual Payments</a>: Allows adding and editing records for offline (bank transfer, cheque, cash) payments.</li>\n<li><a href=\"https://wp-base.com/downloads/shopping-cart/\" rel=\"nofollow ugc\">Shopping Cart</a>: Allows clients book multiple appointments in a single checkout. Minimum and maximum number of appointments per booking is selectable. Can be used to book on different pages and make a single checkout on any page.</li>\n<li><a href=\"https://wp-base.com/downloads/quotas/\" rel=\"nofollow ugc\">Quotas</a>: Different quotas (maximum number of future or completed bookings) can be set per service. Different quotas can be defined per week days, weekend days and holidays, per week and per month.</li>\n<li><a href=\"https://wp-base.com/knowledge-base/test-bookings/\" rel=\"nofollow ugc\">Test Bookings</a>: Given number of partly or fully random test bookings can be created for test purposes.</li>\n</ul>\n<h4>Premium Addons</h4>\n<ul>\n<li><a href=\"https://wp-base.com/downloads/buddypress/\" rel=\"nofollow ugc\">BuddyPress</a>: Adds settings, list of bookings and calendars on BuddyPress front end user pages.</li>\n<li><a href=\"https://wp-base.com/downloads/coupons/\" rel=\"nofollow ugc\">Coupons</a>: Applies discount over total payable amount upon submission of coupon code. Start and end dates, maximum usage, applicable services and/or providers can be selected.</li>\n<li><a href=\"https://wp-base.com/downloads/custom-variable-pricing/\" rel=\"nofollow ugc\">Custom Pricing</a>: Payment and down payment amounts can be formulated depending on any variable, for example to apply special price for happy hours</li>\n<li><a href=\"https://wp-base.com/downloads/credits/\" rel=\"nofollow ugc\">Credits</a>: Adds a deposit system to your website that allows your clients to purchase credit points and then redeem it at a later point for your services.</li>\n<li><a href=\"https://wp-base.com/downloads/extras/\" rel=\"nofollow ugc\">Extras</a>: Allows adding unlimited number of &#8220;extras&#8221; which can be used to offer selectable additional service options to the client. Extras can be applied to locations, services and service providers.</li>\n<li><a href=\"https://eb.wp-base.com/\" rel=\"nofollow ugc\">Event Bookings</a>: Any post/page/custom post can be easily configured to be bookable as event</li>\n<li><a href=\"https://wp-base.com/downloads/google-calendar/\" rel=\"nofollow ugc\">Google Calendar</a>: Integrates Google Calendar with WP BASE. Any new booking can be added to GCal as a new event and any new event entered in GCal can be added as a new booking in WP BASE. Updates in case of editing and cancellation are automatic.</li>\n<li><a href=\"https://wp-base.com/downloads/group-bookings/\" rel=\"nofollow ugc\">Group Bookings</a>: Allows client book for more than one person with a single booking. Client can provide a list of participants who can also receive emails. Person Types are supported</li>\n<li><a href=\"https://wp-base.com/downloads/locations/\" rel=\"nofollow ugc\">Locations</a>: Services can be assigned to one or more location. This feature can also be used to group services and limit their availability depending on capacity, e.g. multiple doctors using a single examination room</li>\n<li><a href=\"https://wp-base.com/downloads/multi-language/\" rel=\"nofollow ugc\">Multi Language</a>: Allows booking selections and variables to be displayed in preferred language of the visitor</li>\n<li><a href=\"https://wp-base.com/downloads/multi-vendor-marketplace/\" rel=\"nofollow ugc\">Multi Vendor Marketplace</a>: Providers can register to the website, sell their services and manage their bookings</li>\n<li><a href=\"https://wp-base.com/downloads/online-meetings/\" rel=\"nofollow ugc\">Online Meetings (Zoom &amp; Jitsi &amp; Agora)</a>: Allows integration with Zoom, Jitsi and Agora video/audio conferencing system</li>\n<li><a href=\"https://wp-base.com/downloads/packages/\" rel=\"nofollow ugc\">Packages</a>: Allows admin combine two or more services as jobs of a package and sell them as a single service. Time delays between service jobs can be set.</li>\n<li>Payment Gateways: 2checkout, <a href=\"https://wp-base.com/downloads/payment-gateway-authorizenet-aim/\" rel=\"nofollow ugc\">authorize.net AIM</a>, Paymill, <a href=\"https://wp-base.com/downloads/payment-gateway-paypal-standard/\" rel=\"nofollow ugc\">Paypal</a>, Simplify by Mastercard, <a href=\"https://wp-base.com/downloads/payment-gateway-stripe/\" rel=\"nofollow ugc\">Stripe</a> support available.</li>\n<li><a href=\"https://wp-base.com/downloads/pdf-attachments/\" rel=\"nofollow ugc\">PDF Attachments</a>: Allows dynamically creating PDF files with booking details and attach them to emails</li>\n<li><a href=\"https://wp-base.com/downloads/recurring-appointments/\" rel=\"nofollow ugc\">Recurring Appointments</a>: Allows clients select recurring appointments on the front end with selectable recurring frequencies daily, every other day, weekly, biweekly and monthly.</li>\n<li><a href=\"https://wp-base.com/downloads/reminder-follow-up-emails/\" rel=\"nofollow ugc\">Reminder &amp; Follow-up emails</a>: Sends automatic reminder emails to clients before appointment time and to clients whose bookings have negative balance and below a set amount</li>\n<li><a href=\"https://wp-base.com/downloads/seasonal-working-hours/\" rel=\"nofollow ugc\">Seasonal Working Hours</a>: Allows weekly &#8220;alternative&#8221; schedules to be defined and assigned to services and service providers, making it possible to create working hour settings changing every week within the year, e.g. for shift work</li>\n<li><a href=\"https://wp-base.com/downloads/sms/\" rel=\"nofollow ugc\">SMS</a>: Sends SMS messages as confirmation, pending, cancellation, completion and reminder using Twilio service. Different message templates for different groups (client, provider, admin) can be used.</li>\n<li><a href=\"https://wp-base.com/downloads/user-defined-fields/\" rel=\"nofollow ugc\">User Defined Fields</a>: Allows admin add unlimited number of fields in the confirmation form. Text, textarea, option/select and checkbox fields are supported. User defined select/option functions can be added.</li>\n<li><a href=\"https://wp-base.com/downloads/variable-durations/\" rel=\"nofollow ugc\">Variable Durations</a>: Allows service durations to be variable based on date, time and/or provider. Also allows clients pick desired duration for configured services within set limits</li>\n<li><a href=\"https://wp-base.com/downloads/waiting-list/\" rel=\"nofollow ugc\">Waiting List</a>: Allows clients to apply for a waiting list when desired time slot is full. When there is an opening in the service, clients in the waiting list are informed by email.</li>\n<li><a href=\"https://wp-base.com/downloads/woocommerce/\" rel=\"nofollow ugc\">Woocommerce Integration</a>: Integrates WP BASE with WooCommerce and allows selling of services as Woocommerce products</li>\n<li><a href=\"https://wp-base.com/downloads/wp-base-developer-package/\" rel=\"nofollow ugc\">WP BASE Developer Package</a>: includes all current and future addons usable in multiple client websites</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.4.7.0.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-1.png?rev=3068911",
            "caption": "Book Me tab in BuddyPress profile"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-2.jpg?rev=1957267",
            "caption": "Weekly Calendar booking view with slider"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-3.jpg?rev=1957267",
            "caption": "Book in Table view with slider"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-4.png?rev=3068911",
            "caption": "Front End List of Bookings"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-5.png?rev=3068911",
            "caption": "Admin Dashboard"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-6.png?rev=3068911",
            "caption": "Admin Bookings"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-7.png?rev=3068911",
            "caption": "Service settings"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-8.png?rev=1905861",
            "caption": "Working Hour settings showing copy/paste feature"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-9.png?rev=1905861",
            "caption": "Holiday settings with multiple days selection"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-10.png?rev=3068911",
            "caption": "Edit service"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-11.png?rev=1905861",
            "caption": "Custom Functions feature to add own PHP codes"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-12.png?rev=1905861",
            "caption": "Custom Texts feature to localize front end messages and texts"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-13.png?rev=1905861",
            "caption": "email settings and template editor"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-14.png?rev=3068911",
            "caption": "Edit client"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-15.png?rev=3068911",
            "caption": "Account page"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-16.png?rev=1905861",
            "caption": "Shortcode help page"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-17.png?rev=2012481",
            "caption": "Monthly Calendar booking view"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-18.png?rev=1957267",
            "caption": "Weekly Calendar booking view"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-19.png?rev=1957267",
            "caption": "Book in Table view"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-20.png?rev=2149495",
            "caption": "Admin Dashboard"
        },
        {
            "src": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/screenshot-21.png?rev=3097709",
            "caption": "Flex Steps booking method"
        }
    ],
    "tags": {
        "appointment-booking": "appointment booking",
        "booking-calendar": "booking calendar",
        "buddypress": "buddypress",
        "multi-vendor": "multi vendor",
        "service-booking": "service booking"
    },
    "stable_tag": "4.7.0",
    "versions": {
        "3.0.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.0.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.0.1.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.1.0.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.2.1.zip",
        "3.2.1.1": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.2.1.1.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.2.2.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.2.3.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.3.0.zip",
        "3.4.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.4.0.zip",
        "3.4.1": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.4.1.zip",
        "3.4.2": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.4.2.zip",
        "3.4.3": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.4.3.zip",
        "3.4.4": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.4.4.zip",
        "3.4.5": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.4.5.zip",
        "3.4.6": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.4.6.zip",
        "3.5.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.5.0.zip",
        "3.5.1": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.5.1.zip",
        "3.5.2": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.5.2.zip",
        "3.5.2.2": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.5.2.2.zip",
        "3.5.2.4": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.5.2.4.zip",
        "3.5.3": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.5.3.zip",
        "3.5.4": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.5.4.zip",
        "3.5.5": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.5.5.zip",
        "3.5.6": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.5.6.zip",
        "3.5.7": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.5.7.zip",
        "3.5.8": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.5.8.zip",
        "3.5.9": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.5.9.zip",
        "3.6.1": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.6.1.zip",
        "3.6.1.1": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.6.1.1.zip",
        "3.6.2": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.6.2.zip",
        "3.6.3": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.6.3.zip",
        "3.6.4": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.6.4.zip",
        "3.6.5": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.6.5.zip",
        "3.6.6": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.6.6.zip",
        "3.6.7": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.6.7.zip",
        "3.6.8": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.6.8.zip",
        "3.6.9": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.6.9.zip",
        "3.7.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.7.0.zip",
        "3.7.1": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.7.1.zip",
        "3.7.2": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.7.2.zip",
        "3.7.3": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.7.3.zip",
        "3.7.4": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.7.4.zip",
        "3.7.5": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.7.5.zip",
        "3.7.6": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.7.6.zip",
        "3.7.7": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.7.7.zip",
        "3.7.8": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.7.8.zip",
        "3.7.9": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.7.9.zip",
        "3.8.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.8.0.zip",
        "3.8.1": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.8.1.zip",
        "3.8.10": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.8.10.zip",
        "3.8.2": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.8.2.zip",
        "3.8.3": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.8.3.zip",
        "3.8.4": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.8.4.zip",
        "3.8.5": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.8.5.zip",
        "3.8.6": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.8.6.zip",
        "3.8.7": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.8.7.zip",
        "3.8.8": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.8.8.zip",
        "3.8.9": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.8.9.zip",
        "3.9.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.9.0.zip",
        "3.9.1": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.9.1.zip",
        "3.9.2": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.9.2.zip",
        "3.9.3": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.9.3.zip",
        "3.9.4": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.9.4.zip",
        "3.9.5": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.9.5.zip",
        "3.9.6": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.9.6.zip",
        "3.9.7": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.3.9.7.zip",
        "4.0.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.4.0.0.zip",
        "4.0.1": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.4.0.1.zip",
        "4.1.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.4.1.0.zip",
        "4.2.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.4.2.0.zip",
        "4.3.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.4.3.0.zip",
        "4.4.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.4.4.0.zip",
        "4.5.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.4.5.0.zip",
        "4.6.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.4.6.0.zip",
        "4.7.0": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.4.7.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wp-base-booking-of-appointments-services-and-events.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/banner-772x250.png?rev=3068911",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/wp-base-booking-of-appointments-services-and-events/assets/icon-128x128.png?rev=1905861"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}