{
    "name": "WP-Chatbot for Messenger",
    "slug": "wp-chatbot",
    "version": "4.9",
    "author": "<a href=\"https://mobilemonkey.com/wp-chatbot/\">MobileMonkey</a>",
    "author_profile": "https://profiles.wordpress.org/larrykim/",
    "contributors": {
        "larrykim": {
            "profile": "https://profiles.wordpress.org/larrykim/",
            "avatar": "https://secure.gravatar.com/avatar/726b072fb960528d3eba1954450fa8ae?s=96&d=monsterid&r=g",
            "display_name": "larrykim"
        },
        "yankovski": {
            "profile": "https://profiles.wordpress.org/yankovski/",
            "avatar": "https://secure.gravatar.com/avatar/8ddd0147ae7a6829a63feda310649de5?s=96&d=monsterid&r=g",
            "display_name": "yankovski"
        }
    },
    "requires": "4.6",
    "tested": "6.3.5",
    "requires_php": "5.6",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 78,
    "ratings": {
        "5": 38,
        "4": 0,
        "3": 1,
        "2": 1,
        "1": 13
    },
    "num_ratings": 53,
    "support_url": "https://wordpress.org/support/plugin/wp-chatbot/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 5000,
    "downloaded": 416765,
    "last_updated": "2023-10-13 14:25:00",
    "added": "2017-12-06",
    "homepage": "https://mobilemonkey.com/wp-chatbot/",
    "sections": {
        "description": "<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/339614063\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p>WP-Chatbot adds an OmniChat™ chat widget to your website. OmniChat by MobileMonkey is patent-pending technology for creating a single chatbot that works in multiple messaging platforms. The OmniChat widget is the fastest and simplest way to add live chat to your WordPress website, convert more leads and engage your customers, even after they’ve left your website.</p>\n<ul>\n<li>One-click installation for WordPress</li>\n<li>Live chat with visitors 24/7, even while you sleep</li>\n<li>Single inbox for all incoming messages, seamlessly integrated Facebook Messenger and native web chat conversations</li>\n<li>Zero-hassle integration with powerful chatbot features</li>\n<li>100% integration with your Facebook Business Page and Facebook Messenger</li>\n</ul>\n<h3>WP-Chatbot’s Explosive Results and Huge Fans</h3>\n<p>WP-Chatbot is the most popular and powerful chatbot in the WordPress ecosystem, powering up tens of thousands of websites with live chat and web chat capabilities. Here are just a few of WP-Chatbot’s fans:</p>\n<ul>\n<li>Entrepreneur named MobileMonkey the best chatbot platform (2017)</li>\n<li>MarTech Breakthrough Awards awarded MobileMonkey the Best Marketing Bot Platform (2019)</li>\n<li>It is the world’s fastest growing official Facebook messenger marketing solutions provider partner (2019)</li>\n<li>Neil Patel selected it as his chatbot of choice (2019)</li>\n<li>Brian Dean of Backlinko endorsed it (2019)</li>\n</ul>\n<h3>Quick facts about the WP-Chatbot</h3>\n<ul>\n<li>Chatbot conversations built in WP-Chatbot work for users signed into Facebook Messenger, or not! </li>\n<li>WP-Chatbot translates chatbot conversations to native web chat if it detects a website visitor is not signed into Facebook Messenger. </li>\n<li>Integrates with your Facebook Business page easily and quickly.</li>\n<li>Conversations from both Facebook Messenger chat and native web chat are seamlessly integrated in a unified inbox.</li>\n<li>Provides live chat functionality to any WordPress website.</li>\n<li>Works on any device, any size, anywhere in the world.</li>\n<li>Compatible with all versions of WordPress.</li>\n<li>Uses chatbot technology to provide constant and instant support, even if no customer service staff are available.</li>\n<li>hats conducted within Facebook messenger can be continued at any time in Messenger, even if users aren’t on your website.</li>\n<li>It is compatible with hundreds of plugins, themes, and ecommerce platforms including WooCommerce.</li>\n<li>It is compatible with MobileMonkey&#8217;s full-featured marketing and customer service chatbot platform with advanced automation, lead generation, and live chat capabilities.</li>\n</ul>\n<h3>OMNICHAT™ CHATBOT TECHNOLOGY HELPS WORDPRESS SITE OWNERS CHAT WITH CUSTOMERS IN THE MESSAGING APPS THEY ALREADY USE</h3>\n<p>WP-Chatbot features MobileMonkey OmniChat technology, a break-through in chat marketing automation that makes chatbots accessible to all businesses and all customers, on many popular chat interfaces.</p>\n<p>Where a WordPress site owner would have to build separate chatbots that work on Facebook Messenger or webchat, intead, build one bot conversation that works on many of the chat applications customers are already using.</p>\n<p>Conversations are all viewable to the site owner in a single, streamlined inbox. Unify your WordPress website customer chats and make it super convenient for site visitors to choose the messaging app that they want to use. That&#8217;s the power of WP-Chatbot OmniChat.</p>\n<h3>[FACEBOOK OFFICIAL] MobileMonkey is the world’s fastest growing official Facebook messenger marketing solutions provider partner</h3>\n<p>In 2019, MobileMonkey, which owns and develops WP-Chatbot was recognized as the world’s fastest growing official Facebook Messenger marketing solutions provider partner.</p>\n<p>The reason for MobileMonkey’s meteoric growth is due in large part to the popularity of the Messenger live chat plug in.</p>\n<p>WP-Chatbot does far more than simply integrate chat on your homepage. It opens up an entirely new marketing channel complete with drip campaigns, chat blasts, RSS feeds, Messenger ads, analytics tracking, and more.</p>\n<p>Chat marketing is the hottest marketing channel available to marketers today. By using WP-Chatbot and MobileMonkey, you are gaining cutting-edge advantage of an enormously powerful tool that promises massive results for years to come. It is the world’s fastest growing official Facebook Messenger marketing solutions provider partner (2019)</p>\n<h3>Advantages of using WP-Chatbot on your website</h3>\n<p>Using a chat bot on your website opens up a new and powerful marketing channel. You can begin building a contact list, and engage these potential customers with ease and power.</p>\n<ul>\n<li>OmniChat adapts to web visitors, serving no-login-required web chat or Facebook Messenger chat depending on the visitor</li>\n<li>Facebook Messenger chat gives businesses access to instant lead capture for more than 1.3 billion Facebook Messenger users worldwide.</li>\n<li>Ability to chat with customers who do not have a Facebook Messenger account using native web chat.</li>\n<li>24/7 interaction with customers. Chat with and interact with customers while you sleep.</li>\n<li>Integration with the fastest-growing messaging platform in the world.</li>\n<li>A single, unified inbox for website chats, Facebook page chats, or other entry points.</li>\n<li>Keep contacts forever. Chat history is persistent regardless of when and how your users messaged you.</li>\n<li>Teamwide access to all chats in multiple messaging apps. Your entire team including support personnel from around the world can access the conversations.</li>\n<li>Available mobile app allows business owners to respond to chats while on-the-go.</li>\n<li>Seamless integration with other powerful chat bot tools. WP-Chatbot is fully integrated with the MobileMonkey chatbot builder.</li>\n</ul>\n<h3>Customize the plugin according to your exact preferences</h3>\n<p>WP-Chatbot is designed to look and feel exactly how you want it. Here’s the level of customization that you gain when using WP-Chatbot.</p>\n<ul>\n<li>Customize shape, location and color with a color picker or hex code</li>\n<li>Create a custom greeting for logged-in users when they see the chatbot</li>\n<li>Create a different greeting for users who are logged in to Messenger and those who are not Facebook Messenger users</li>\n<li>Select the pages on your WordPres site where you want the chat to be located</li>\n<li>Add chat to any or all pages on your website</li>\n<li>Choose the language to use for chat</li>\n<li>Hide the chatbot based on post type, post ID, categories, or device type</li>\n<li>Add your branding with the display photo in the chat window</li>\n<li>Create custom dialogue flows or menus to help users navigate and get the information they need</li>\n<li>Enable or disable Facebook analytics</li>\n<li>Create a chatbot dialogue or use natural language processing (NLP)</li>\n</ul>\n<h3>Supercharge your marketing with a single plugin</h3>\n<p>WP-Chatbot is the ultimate small-but-mighty in the world of WordPress plugins. It’s more than just a chat feature. It’s a method of dramatically improving the number of hot and highly engaged leads for your business.</p>\n<p>Without a Messenger or native web chatbot on your website, leads are slipping through your fingers night and day. With an OmniChat chatbot, you are securing leads night and day. Ordinary live chat plugins don’t compare with the power and potential of an OmniChat chatbot plugin. Why? Because such plugins do not retain the contacts from across chat platforms in a unified inbox.</p>\n<p>By simply installing this chatbot plugin on your WordPress site, you are effectively gaining more leads, more engagement, and more return on your marketing investment — totally free.</p>\n<h3>FAQs:  WP-Chatbot Plugin Questions and Answers</h3>\n<p><strong>What can the WP-Chatbot do?</strong></p>\n<p>The main purpose of the WP-Chatbot is to allow users to have a live chat experience directly on your website. Users can start chatting on any page of your website. The chat is persistent, meaning that if they start a Messenger chat from your website, that chat thread is also available on their mobile device or the desktop version of Facebook Messenger. Chats don’t end when a user leaves your website. They’ve just begun.</p>\n<p><strong>Is that all?</strong></p>\n<p>No. That’s the main purpose of the WP-Chatbot. By using MobileMonkey, a chatbot builder, you can engage with the user long after their first interaction. Using advanced Facebook Messenger chatbots (easy to make, with no coding involved), you can send drip campaigns, segment users, send chat blasts, and more.</p>\n<p><strong>What if no one is available to answer a user’s chat?</strong></p>\n<p>Instead of relying on live support to answer chats, you can set up a chatbot that dialogues with customers using natural language processing (NLP) and artificial intelligence (AI), or you can create a custom sequence that guides users through various menus and options to get exactly what they need. If you want, you can also set a message that informs users when they should check back for a live chat with a real person.</p>\n<p><strong>Will WP-Chatbot work with any WordPress website?</strong></p>\n<p>Yes, WP-Chatbot is designed to work with any website built on WordPress v. 4.6 or higher. It has been tested up to WordPress version 5.5.1.</p>\n<p><strong>What else do I need in order to start using WP-Chatbot?</strong></p>\n<p>When you start using WP-Chatbot, you should have the following:<br />\n&#8211; A Facebook Business Page<br />\n&#8211; Your Facebook Page ID<br />\nIn the setup process, you’ll also need to add your website to the whitelisted pages section within Facebook.</p>\n<p><strong>Is WP-Chatbot compliant with GDPR?</strong></p>\n<p>Yes. Consent, a requisite component of GDPR, takes place when the user clicks the button to “continue as [name].” It’s important that any chatbot dialogues you create should inform subscribers how they can unsubscribe at any time. For example, you can tell users “Just type STOP at any time to unsubscribe.” If you are using MobileMonkey, then MobileMonkey will automatically handle the unsubscribe request. If the contact wishes to have their data deleted from MobileMonkey, they can always send a message via Messenger or via email to make the request,. Once the page owner receives the deletion request, they can easily honor the request by using the delete contact action in MobileMokey.</p>\n<p><strong>Does WP-Chatbot come with any analytics?</strong></p>\n<p>If you have a Facebook Developer account, you can view WP-Chatbot analytics if desired. If you do not have a Facebook Developer account, you can easily create one.</p>\n<p><strong>Can WP-Chatbot increase leads?</strong></p>\n<p>Yes. In fact, that’s the main reason that most website creators and marketers add the plugin. It is a powerful way to grow an active and engaged contact list from your website traffic. Rather than visitors simply stopping in and checking out your site, they are intentionally engaging with your brand in a way that secures them a spot on your contact list.</p>\n<p><strong>Will the WP-Chatbot plugin also improve conversions?</strong></p>\n<p>The answer is most likely yes, but it just depends on the nature of your business, what you consider a conversion, and other factors. Data indicates that users who are able to live chat with a business are worth 4.5 times as customers who don’t chat, and their average order size is 10% larger than non-chatting users.</p>\n<p><strong>Is the WP-Chatbot just for customer support?</strong></p>\n<p>The WP-Chatbot is, of course, a marvelous customer support tool, but it has many other uses in marketing. Most users of WP-Chatbot are also MobileMonkey users.</p>\n<p><strong>How does the chat process work from a user perspective?</strong></p>\n<p>The widget is usually persistently positioned at the lower corner of a website. You can customize the greeting message. One popular greeting is “Hi! How can we help you?” If the user is logged in, they will click the button that reads “Continue as [Name].” Instantly, they receive a message with an invitation to continue the conversation. They can continue with the chat on the website, or in the case that they are a Facebook Messenger user, they can use the Facebook Messenger app to continue.</p>\n<p><strong>Who owns WP-Chatbot?</strong></p>\n<p>WP-Chatbot is owned by MobileMonkey, a chat marketing app and chatbot builder that creates chatbots for Facebook Messenger, native web chat, SMS and more. LarryKim, the founder of MobileMonkey is a three-time winner of the most influential PPC marketer, a number one columnist on Search Engine Land and Search Engine Journal. He founded Wordstream, grew it to one of the world’s leading search marketing firms, and later sold it for $150m. Larry immediately founded MobileMonkey, recognizing chat marketing as one of the hottest marketing tactics available.</p>\n<p><strong>Do any famous people use or endorse WP-Chatbot?</strong></p>\n<p>Yes. Some of the world’s leading marketers and publications are active users of WP-Chatbot or its parent company, MobileMonkey. Here are some of them:</p>\n<p>– Neil Patel, a Forbes top 10 marketer, founder of Quicksprout and Neil Patel Digital<br />\n– Mari Smith, Facebook designated “Small Business and Facebook Marketing Expert”<br />\n– Olga Andrienko, Head of Global Marketing at SEMrush<br />\n– Brian Dean, founder of Backlinko and globally recognized SEO and marketer<br />\n– Cat Howell, CEO of Eight Loop Social and Creator of the Academy<br />\n– Sean Ellis, founder of Growth Hackers<br />\n– Andrea Vahl, Speaker, trainer and consultant, author of Facebook Ads Made Easy<br />\n– Daniel Gilbert, CEO of Brainlabs– Dennis Yu, CTO of BlitzMetrics<br />\n– Mandy Mcewen, CEO of Mod Girl Marketing<br />\n– Vasil Azarov, Founder of Growth Marketing Conference</p>\n<p><strong>What brands have featured WP-Chatbot or MobileMonkey?</strong></p>\n<p>Facebook has named MobileMonkey the fastest growing Messenger partner, due in part to the explosive growth of WP-Chatbot. Many brands and organizations are reviewing MobileMonkey, discussing the advantages of Messenger and chat marketing tools like MobileMonkey, and providing chat marketing strategies and tactics, fueled by MobileMonkey chatbots. Here are some of the publications that MobileMonkey has been seen on.</p>\n<ul>\n<li>Forbes</li>\n<li>Inc.</li>\n<li>Venture Beat</li>\n<li>Wordstream</li>\n<li>Search Engine Journal</li>\n<li>Entrepreneur</li>\n</ul>\n<p><strong>What companies use WP-Chatbot or MobileMonkey?</strong></p>\n<p>There are thousands of small businesses, entrepreneurs, in-house marketers, and freelancers using WP-Chatbot every day. The widget has more than 20,000 active installs and is growing by the dozens on a daily basis. Here are some more happy users:</p>\n<ul>\n<li>UNICEF</li>\n<li>Toyota</li>\n<li>Century 21</li>\n<li>Sofamania</li>\n<li>Hush Puppies</li>\n<li>Big Guys Pizza</li>\n<li>Veterans United Home Loans</li>\n<li>VMWare</li>\n<li>DocsApp</li>\n<li>Outdoorsy</li>\n<li>Search Engine Journal</li>\n</ul>\n<p><strong>Does the chatbot plugin require any coding?</strong></p>\n<p>No. Not at all. In fact, you can even create advanced and high-impact chatbot sequences on MobileMonkey without any coding.</p>\n<p><strong>Is the chat history deleted or can I save them?</strong></p>\n<p>All chats are automatically stored in your MobileMonkey inbox (in the web app or mobile app), where they are stored indefinitely or until a user unsubscribes from your list. There’s no need to manually save chats. The user also retains a persistent record of their chat history with you if the chat is conducted in Facebook Messenger.</p>\n<p><strong>Can I see information about contacts who opt-in to the chat?</strong></p>\n<p>If they&#8217;re chatting with you through Facebook Messenger, yes. In fact, when a visitor on your site chats with you as a logged in Facebook Messenger user, you can see their name as well as a good deal of information that they have chosen to share publicly on their Facebook profile. This may include their language, where they&#8217;re located, and more.</p>\n<p><strong>Can anyone on your business’s support team or customer service team chat with users?</strong></p>\n<p>Yes. Anyone who has a page role on your Business Page (Admin, Editor, Moderator) can chat. Even if the chat is bot-driven, a human can step in at any time to chat with the site visitor.</p>\n<p><strong>How do users start a chat?</strong></p>\n<p>o start chatting from your website, a user clicks the chat graphic on the widget, wherever it is positioned on the page. If the user is already logged into Facebook or Facebook Messenger on their browser or mobile device, the widget can display the button message “Continue as [Name].” If the user is not logged in to Facebook Messenger, the button will greet the visitor as you tell it to for native web chat users.</p>\n<p><strong>Does WP-Chatbot provide support?</strong></p>\n<p>Yes. WP-Chatbot has a large support forum with fast response and top-rated support.</p>\n<p><strong>Is WP-Chatbot similar to ManyChat?</strong></p>\n<p>ManyChat is a chatbot builder, but is not a WordPress plugin. WP-Chatbot makes it easy for website visitors to chat with you on Facebook Messenger as well as outside of Messenger, which is really handy because not every site visitor is logged into Facebook. For maximum chatbot power, WP-Chatbot seamlessly integrates with MobileMonkey, a robust and full-featured chatbot builder. MobileMonkey is where you can harness the full power of chat marketing, creating drip sequences, lead magnets, chat blasts, and more.</p>\n<p><strong>How is WP-Chatbot different from other WordPress chatbot plugins?</strong></p>\n<p>Many plugins simply open a link to a Facebook page. WP-Chatbot integrates the chat on your website with no new tabs or links being required to continue the chat. Another distinguishing feature is WP-Chatbot’s ease of use. Installing the plugin to your site and connecting it to your Facebook Business page is simple and requires only a few minutes.</p>\n<p><strong>How is WP-Chatbot different from Tidio Live Chat?</strong></p>\n<p>Tidio Live Chat is a great chatbot for communicating with customers on your website. it is not connected with Facebook or Facebook Messenger. WP-Chatbot has the same chat functionality as Tidio Live Chat, allows businesses to connect with customers using  Messenger as the messaging platform. This has lead generation benefits as customers can receive follow-up messaging from the business. And customers are likely to use Messenger as a chat forum because it’s safe and familiar. Tidio is a fitting WordPress chabot plugin if you don’t want to integrate with Facebook Messenger.</p>\n<p><strong>Is WP-Chatbot similar to Collect.chat?</strong></p>\n<p>Collect.chat is a chatbot plugin that allows you to chat with customers on your website. Like other chatbots including Tidio, Collect.chat is a native chat application without integration to Facebook Messenger. While Colllect.chat provides useful chat functionality, it is limited in what it can offer for retaining chat users for. WP-Chatbot features native website chat and Facebook Messenger chat at the same time.</p>\n<p><strong>Does WP-Chatbot have the same level of power as the IBM Watson Assistant?</strong></p>\n<p>IBM Watson is a chatbot plugin that uses IBM’s data and information to create an intelligent chatbot. It is not a website widget chatbot, so it’s not possible to continue marketing to chatbot users on Facebook. Additionally, in order to gain the full functionality of IBM Watson, it is necessary to purchase IBM Cloud usage.</p>\n<p><strong>Are there are WordPress chatbot plugins that are similar to WP-Chatbot?</strong></p>\n<p>There are currently dozens of WordPress chatbot plugins including Cliengo, Clientity, Acobot, My Chatbot, HubSpot, Instabot, Chatbot Botnation, Chatfuel, ArtiBot, Bot Libre, GoBot, and Botsify. Most of these chatbots do not integrate with Facebook Messenger. And not one of them offers OmniChat™, the patent-pending technology that makes one chat marketing flow work in multiple messaging apps. Alternative WordPress chatbot plugins typically offer a single limited feature, for example, to improve an onsite shopping experience or to send newsletters.</p>\n<p><strong>Does WP-Chatbot work in other countries or with other languages?</strong></p>\n<p>Yes, WP-Chatbot supports all Facebook languages, which is currently 142 different languages.</p>\n<p><strong>Does WP-Chatbot work in real time?</strong></p>\n<p>Yes, WP-Chatbot transmits messages in real time within Facebook Messenger as well as native web chat.</p>\n<p><strong>What industries is WP-Chatbot helpful for?</strong></p>\n<p>Any industry is a perfect case use for website chatting. WP-Chatbot is highly flexible, meaning that you can customize it for any industry, any vertical, any business type, and any audience (B2B or B2C). Here are some business types that have found the WP-Chatbot to be very useful:</p>\n<ul>\n<li>Chatbots for small businesses</li>\n<li>Chatbots for restaurants</li>\n<li>Chatbots for agencies</li>\n<li>Chatbots for doctor’s offices</li>\n<li>Chatbots for influencers</li>\n<li>Chatbots for consultants</li>\n<li>Chatbots for personal trainers</li>\n<li>Chatbots for personal coaches</li>\n<li>Chatbots for MLM sales</li>\n<li>Chatbots for brick-and-mortar shops</li>\n<li>Chatbots for ecommerce</li>\n<li>Chatbots for selling online courses</li>\n<li>Chatbots for entrepreneurs</li>\n<li>Chatbots for digital marketers</li>\n<li>Chatbots for designers</li>\n<li>Chatbots for freelancers</li>\n</ul>\n<h3>WP-Chatbot and MobileMonkey: What else can you do with the chatbot?</h3>\n<p>Integrating the plugin to your website and Facebook page is only the first step. Once you’ve done that, the marketing possibilities are endless. You can do each one of these actions using the chatbot building platform, MobileMonkey.</p>\n<p><strong>Customers who engage with you are contacts for life.</strong></p>\n<p>One of the main advantages of WP-Chatbot over ordinary chatbot plugins is the chatbot integration with Facebook Messenger. When site visitors are logged into Facebook Messenger and start a conversation with your bot or live agent, users can access this chat and chat history on their phone or their desktop, not just on your website. In addition, they remain on your contact list until they choose to unsubscribe.</p>\n<p><strong>Grow your contact list.</strong></p>\n<p>WP-Chatbot makes it easy and effortless to amass a huge contact list of messaging contacts. The power of chatbots goes beyond a single interaction on your website. The real power begins once you’ve gained that contact.</p>\n<p><strong>Send contacts chat blasts.</strong></p>\n<p>A chat blast is a message that you can send to your entire chat mailing list. A single blast can reach thousands of potential customers with any variety of marketing messages. Within the Facebook Messenger platform, you can expect to get 80% open rates and 40% clickthrough rates within sixty minutes!</p>\n<p><strong>Create an RSS integration that sends new content to your mailing list.</strong></p>\n<p>Another powerful feature of Facebook Messenger marketing is the ability to connect your Messenger contact list with an RSS feed. Every time you publish something to the feed, it will send your mailing list a link to the content along with a custom message. All it takes is a quick thirty-second integration using MobileMonkey, and you’re set forever.</p>\n<p><strong>Market to your messaging contact list using a drip campaign.</strong></p>\n<p>A drip campaign is a powerful way to methodically coax your users to conversion. Perhaps you want them to schedule a consultation, attend a webinar, or download a resource. Whatever it is you want them to do, you can create a drip campaign in MobileMonkey that allows you to achieve that. The drip campaign sends the user a series of messages in a live and interactive way. You can easily amass hundreds of conversions in a few minutes using a strategic drip campaign on Facebook Messenger or other messaging platform.</p>\n<p><strong>Combine the power of your chatbot plugin with your Facebook Business page.</strong></p>\n<p>Once you install your chatbot plugin and begin building a lead list, you can also build your lead list using Facebook. To do so, create click-to-Messenger ads on Facebook. When users convert on the ad, they are added to your Messenger mailing list. Click-to-Messenger ads are less expensive and more effective than conventional Facebook display ads. Plus, the user is consenting to allow you to message them again.</p>\n<p><strong>You have access to a huge audience.</strong></p>\n<p>Facebook’s messaging applications including WhatsApp and Instagram are the largest in the world, by far. 11% of the world’s total population uses one of Facebook’s messaging apps. With access to an audience this large, you are sure to increase your marketing reach and power.</p>\n<p><strong>Answer FAQs.</strong></p>\n<p>One great thing about chatbots is that they can be programmed to answer the questions that users are likely to ask. Setting this up in MobileMonkey is easy, and doesn’t require any coding.</p>\n<p><strong>Qualify leads.</strong></p>\n<p>Not everyone who starts chatting on your website will turn out to be a valuable lead. A chatbot can help qualify leads by guiding them through a series of questions. Even a certain contact isn’t a lead right now, they might turn into one later. You can invite them to join a Facebook group, retain them in your contact list, or simply message them from time to time to keep them engaged.</p>\n<p><strong>Notify the sales team about hot leads.</strong></p>\n<p>When a potential lead does qualify themselves through a chatbot dialogue, you can easily alert your sales team about it. They can step in for a live chat with the potential lead and close the deal.</p>\n<p><strong>Allow contacts to set appointments.</strong></p>\n<p>Does your business use appointment setting? Whether you operate a dentist office, gym, or restaurant, users can make reservations, schedule appointments, make changes to their reservation, check the status of their appointment, get directions, and more.</p>\n<h3>Technical Facts about the Chatbot Plugin</h3>\n<ul>\n<li>Number of active installations:  20,000. Historic installations:  315,000</li>\n<li>Version of WordPress: 4.6 or higher</li>\n<li>Version of WordPress tested up to:  Version 5.5.1</li>\n</ul>\n<h3>Contributors and Developers</h3>\n<p>“WP-Chatbot for Messenger is open source software. The following people have contributed to this plugin.</p>\n<p><a href=\"https://profiles.wordpress.org/larrykim/\" rel=\"nofollow ugc\">larrykim</a>     <a href=\"https://profiles.wordpress.org/yankovski/\" rel=\"nofollow ugc\">yankovski</a></p>\n<h3>Five Star Reviews of WP-Chatbot</h3>\n<p>WP-Chatbot has exclusively five-star reviews. Check out some of the recent reviews by users of WP-Chatbot.</p>\n<p>⭐️⭐️⭐️⭐️⭐️Really, It is the best chatbot plugin out there. The plugin works so smooth and has some advanced features also. <strong>(@rahulbiswal)</strong></p>\n<p><strong>Incredible plugin!</strong>⭐️⭐️⭐️⭐️⭐️<br />\nSimple to install, and easy to configure! This plugin is a gem for marketers! <strong>(@kristelcuenta)</strong></p>\n<p><strong>So easy</strong>⭐️⭐️⭐️⭐️⭐️<br />\nI’ve been procrastinating on site chat because I figured it would be a pain, but it turns out it’s a lot easier than I thought. In my industry it takes 12-18 touches to turn someone into a buyer, so every new channel I can set up is gold.  <strong>(@formido)</strong></p>\n<p><strong>Works as expected!</strong>⭐️⭐️⭐️⭐️⭐️<br />\nGreat plugin, functions properly, easy to set up and looks great! Support is responsive as well. Would recommend! <strong>(@jordanho)</strong></p>\n<p><strong>If 6 stars were available I would give them.</strong>⭐️⭐️⭐️⭐️⭐️<br />\nI’ve just discovered WP-Chatbot a few days ago. It’s insanely useful. In fact, it helps me connect with my Facebook users directly from my website. As users love chatbots even more than emails, I think I’ll never uninstall this plugin. Thanks for having created it. <strong>(@giuseppedeepakbenti)</strong></p>\n<p><strong>Great Plugin for Chat Support.</strong>⭐️⭐️⭐️⭐️⭐️<br />\nI love this plugin, it really works with no problems with the new WordPress version. <strong>(@jhsandy)</strong></p>\n<p><strong>Works perfectly with 5.1.1.</strong>⭐️⭐️⭐️⭐️⭐️<br />\nI have not experienced any problems with WP 5.1.1 thank you for a great plug-in. <strong>(@jweaver214)</strong></p>\n<p><strong>Easy to set up</strong>⭐️⭐️⭐️⭐️⭐️<br />\nEasy to use and set up. <strong>(@lancememan)</strong></p>\n<p><strong>Nice Plugin</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThis plugin is very easy to implement. Very straight forward and support is very responsive. <strong>(@ladykatherynstark)</strong></p>\n<p><strong>Best Chatbot Plugin</strong>⭐️⭐️⭐️⭐️⭐️<br />\nBest plugin, easy to setup, easy to use and great support. <strong>(@gmatters)</strong></p>\n<p><strong>Incredible Support</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThe educational support and low bar of entry available for this Facebook chatbot builder are unmatched. Larry, Virginia, and the rest of the Mobile Monkey team have done a phenomenal job getting marketers acclimated with one of the most efficient ways to market your business online now. Thank you for such an incredible contribution to the digital entrepreneur community! <strong>(@notifyneal)</strong></p>\n<p><strong>Great Plugin for Chatbot</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThis is a great plugin for Chatbot. Doesn’t impact pagespeed and is simple to set up. A very useful plugin to chat with current and new customers off of your WordPress website. <strong>(@rez311)</strong></p>\n<p><strong>Great job!</strong>⭐️⭐️⭐️⭐️⭐️<br />\nJust plug and play to have a working FB chatbot &#8211; cool! <strong>(@benpines)</strong></p>\n<p><strong>Best chatbot plugin</strong>⭐️⭐️⭐️⭐️⭐️<br />\nInstall was super easy and I’m already seeing results. Love it! WP-Chatbot really helps you grow your business, I already started connecting with my visitors and messaging them directly to get them back. <strong>(@maxcr)</strong></p>\n<p><strong>Finally Messenger chat that’s easy</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThis one works simply by putting almost all settings inside WordPress. (The only part that’s left out is connecting to Facebook. And even the button to initiate that is inside of WordPress.) <strong>(@andrewwarner)</strong></p>\n<p><strong>Great plugin</strong>⭐️⭐️⭐️⭐️⭐️<br />\nI started using this today. Works great so far! <strong>(@backlinko)</strong></p>\n<p><strong>Installed and Working</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThe plugin is installed and works as advertised. I’m happy :-). <strong>(@brianjjaxn)</strong></p>\n<p><strong>What was needed</strong>⭐️⭐️⭐️⭐️⭐️<br />\nVery handy plugin that fully performs its functions. I am pleased <strong>(@holysheepcoder)</strong></p>\n<p><strong>Best Facebook Chat Plugin</strong>⭐️⭐️⭐️⭐️⭐️<br />\nPerfectly streamlined for both mobile &amp; desktop users. Most WordPress Facebook chat plugins just opens a link to the facebook page. This plugin has full API capabilities and it is completely inline. Best Facebook Chat plugin with no question. <strong>(@avdigiovanniv)</strong></p>\n<p><strong>Amazing</strong>⭐️⭐️⭐️⭐️⭐️<br />\nStraightforward. Works! <strong>(@aleknovkovski)</strong></p>\n<p><strong>Excellent service and plugin</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThese developers are truly passionate about this project. They’re responsive and efficient in resolving issues &#8211; Would definitely recommend using this plugin. <strong>(@dimsumdesigns)</strong></p>\n<p><strong>Good plugin, good support</strong>⭐️⭐️⭐️⭐️⭐️<br />\nPlugin working perfectly now. Had some great support from the developer! <strong>(@macr0ni)</strong></p>\n<p><strong>Excellent plugin, great support!!</strong>⭐️⭐️⭐️⭐️⭐️<br />\nEvery website needs to be reachable to its customers, you need this plugin! <strong>(@rgenck)</strong></p>\n<p><strong>Simple and effective!</strong>⭐️⭐️⭐️⭐️⭐️<br />\nGreat job, thanks! <strong>(@wstrzalkowska)</strong></p>\n<p><strong>Super Impressed and Super Easy 2 setup</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThis is simply the best plugin for quick chat directly connected to your Facebook page chat. If you’re using facebook bot for the chat this is perfect! Thank you guys for your amazing work! Keep it up! So happy that I found your plugin! <strong>(@cristianuibar)</strong></p>\n<p><strong>Better than premium support!</strong>⭐️⭐️⭐️⭐️⭐️<br />\nI honestly use a lot of premium plugins and use their support. I have to admit that for a free plugin, your support is as good, if not better, than other companies’ premium support!! Thanks!!! <strong>(@boulosblack)</strong></p>\n<p><strong>Best WP Messenger app</strong>⭐️⭐️⭐️⭐️⭐️<br />\nthis is a great app. Easy to install even if due do another widget I had a problem. They have a great and quick support and now everything is working great. <strong>(@mralet)</strong></p>\n<p><strong>Excellent plugin, very easy setup</strong>⭐️⭐️⭐️⭐️⭐️<br />\nAn amazing plugin that works well and is very easy to set up. <strong>(@thethandon)</strong></p>\n<p><strong>It works perfectly</strong>⭐️⭐️⭐️⭐️⭐️<br />\nit is very helpful! Good job!<strong>(@duynguyen)</strong></p>\n<h3>List of Compatible Chatbot Integrations</h3>\n<p>WP-Chatbot is extremely flexible, versatile, and compatible. Because it works seamlessly with MobileMonkey, an integration powerhouse, any webhook or Zapier connection works. Here is a sample of popular chatbot integrations.</p>\n<ul>\n<li>AWeber</li>\n<li>ActiveCampaign</li>\n<li>AgileCRM</li>\n<li>Autopilot</li>\n<li>Capsule</li>\n<li>ConvertKit</li>\n<li>Copper</li>\n<li>Customerly</li>\n<li>Drift</li>\n<li>Drip</li>\n<li>Flexie</li>\n<li>Gist</li>\n<li>Groundhogg</li>\n<li>HubSpot</li>\n<li>Infusionsoft</li>\n<li>Intercom</li>\n<li>Kartra</li>\n<li>MailChimp</li>\n<li>MailerLite</li>\n<li>Mailjet</li>\n<li>Maropost</li>\n<li>Mautic</li>\n<li>NationBuilder</li>\n<li>Ontraport</li>\n<li>Platform.ly</li>\n<li>Salesflare</li>\n<li>Salesforce</li>\n<li>SendinBlue</li>\n<li>Shopify</li>\n<li>Sendlane</li>\n<li>Tubular</li>\n<li>UserEngage</li>\n<li>Zoho</li>\n<li>Drift</li>\n<li>Intercom</li>\n<li>Freshdesk</li>\n<li>Woocommerce</li>\n</ul>\n<h3>Solutions: Using MobileMonkey, WP-Chatbot works with all of the following chatbot integration categories:</h3>\n<ul>\n<li>Accounting</li>\n<li>Ads and Analytics</li>\n<li>Amazon Web Services (AWS)</li>\n<li>Analytics</li>\n<li>App Builder</li>\n<li>Appointment setting</li>\n<li>Bookmarks</li>\n<li>Calendar</li>\n<li>Call Tracking</li>\n<li>Contacts</li>\n<li>Customer Appreciation</li>\n<li>Customer Relationship Management (CRM)</li>\n<li>Customer Support</li>\n<li>Dashboards</li>\n<li>Databases</li>\n<li>Developer Tools</li>\n<li>Devices</li>\n<li>Documents</li>\n<li>Drip Emails</li>\n<li>Ecommerce</li>\n<li>Education</li>\n<li>Email</li>\n<li>Email Newsletters</li>\n<li>Event Management</li>\n<li>FAQ</li>\n<li>Facebook</li>\n<li>Fax</li>\n<li>Files</li>\n<li>Fitness &amp; Entertainment</li>\n<li>Forms</li>\n<li>Fundraising</li>\n<li>Gaming</li>\n<li>Google</li>\n<li>Human Resources (HR)</li>\n<li>Management Tools</li>\n<li>Marketing Automation</li>\n<li>Microsoft</li>\n<li>Net Promoter Score</li>\n<li>News</li>\n<li>Notes</li>\n<li>Notifications</li>\n<li>Payment Processing</li>\n<li>Phone &amp; SMS</li>\n<li>Printing</li>\n<li>Product Management</li>\n<li>Project Management</li>\n<li>Proposals &amp; Invoices</li>\n<li>Real Estate</li>\n<li>Reports</li>\n<li>Reminders</li>\n<li>Scheduling</li>\n<li>Server Monitoring</li>\n<li>Signatures</li>\n<li>Social Media</li>\n<li>Social Media Management</li>\n<li>Spreadsheets</li>\n<li>Surveys</li>\n<li>Team Chat</li>\n<li>Team Collaboration</li>\n<li>Time Tracking</li>\n<li>To-do Lists</li>\n<li>Transactional Email</li>\n<li>Video Calls</li>\n<li>Video, Audio, &amp; Images</li>\n<li>Webinars</li>\n<li>Websites</li>\n<li>WordPress</li>\n<li>Zapier</li>\n<li>Zoho</li>\n</ul>\n",
        "installation": "<h4>From Dashboard ( WordPress admin )</h4>\n<ul>\n<li>Plugins &gt; Add New</li>\n<li>Search for <code>wp chatbot</code></li>\n<li>Click on <strong>Install Now</strong> and then <strong>Activate</strong>.</li>\n</ul>\n<h4>using FTP or similar</h4>\n<ul>\n<li>Unzip downloaded &#8220;wp-chatbot&#8221; file and</li>\n<li>Upload <code>wp-chatbot</code> folder to the <code>/wp-content/plugins/</code> directory.</li>\n<li>Activate the plugin via the &#8220;Plugins&#8221; menu in WordPress Admin.</li>\n</ul>\n",
        "changelog": "<h4>4.9</h4>\n<p>Updated Billing to comply with Can-Spam</p>\n<h4>4.8</h4>\n<p>Compatibility with latest version of WordPress &amp; PHP<br />\nSecurity fixes, bug fixes and usability improvements</p>\n<h4>4.7</h4>\n<p>Compatibility with latest version of WordPress<br />\nBug fixes and usability improvements</p>\n<h4>4.6.3</h4>\n<p>Compatibility with latest version of WordPress</p>\n<h4>4.6.2</h4>\n<p>Usability improvements &amp; updated links<br />\nBug fixes and stability</p>\n<h4>4.6.1</h4>\n<p>Updated experience for existing MobileMonkey users<br />\nBug fixes and stability</p>\n<h4>4.6</h4>\n<p>Introduced Chatbot Settings feature<br />\nBug fixes and stability</p>\n<h4>4.5</h4>\n<p>Bug fixes and stability</p>\n<h4>4.4</h4>\n<p>Bug fixes and stability</p>\n<h4>4.3</h4>\n<p>Enhance usability on notifications</p>\n<h4>4.2</h4>\n<p>Introduce new Q&amp;A feature</p>\n<h4>4.1.4</h4>\n<p>Added the ability to use Lead Qualifier</p>\n<h4>4.1.3</h4>\n<p>Added Pro features</p>\n<h4>4.1.2</h4>\n<p>New Horizontal Tab Design &amp; Removing chat-widget on page disconnecting</p>\n<h4>4.0.8</h4>\n<p>Contacts page + new look &amp; feel</p>\n<h4>4.0.1</h4>\n<p>Stability and bug fixes</p>\n<h4>4.0</h4>\n<p>Facebook integration.<br />\nAllow for easier deployment by connecting to Facebook and selecting a page for messaging.</p>\n<h4>silent release</h4>\n<p>Customer Chat supports for safari 12, so removed alternative Support</p>\n<h4>3.7</h4>\n<p>alpha feature &#8211; load sdk after page load (page speed matters)</p>\n<h4>silent release</h4>\n<p>browser feature &#8211; admin page user interface</p>\n<h4>3.5</h4>\n<p>&#8220;Message Us&#8221; button for Safari 12<br />\nSDK updated to 3.2</p>\n<h4>3.1</h4>\n<p>Admin page &#8211; Material Design<br />\nenable/disable &#8211; autologevents<br />\nFB SDK updated to 3.1<br />\nShow / Hide based on Device for Shortcode<br />\nDeprecated minimized is deleted</p>\n<h4>2.2</h4>\n<p>FB SDK updated to 3.0<br />\nGreetings Dialog Display<br />\nGreetings Dialog Delay</p>\n<h4>silent release</h4>\n<p>Facebook SDK updated to v2.12</p>\n<h4>2.1</h4>\n<p>change messenger theme color<br />\nchange greetings text for the logged in user<br />\nchange greetings text for the logged out user</p>\n<h4>2.0</h4>\n<ul>\n<li>can add ref</li>\n<li>set chat window minimized or not</li>\n</ul>\n<h4>1.3.0</h4>\n<ul>\n<li>can change Language for Messenger</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Shortcode &#8211; beta</li>\n<li>Hide Messenger based on Devices</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Hide messenger based on page type ( now &#8211; check to hide )</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>show / hide messenger based on page types</li>\n<li>Hide messenger based on post id, category name.</li>\n</ul>\n<h4>1.0.0</h4>\n<ul>\n<li>Initial release.</li>\n</ul>\n"
    },
    "short_description": "WP-Chatbot is the fastest, simplest way to add live chat to your website. Convert hot leads and engage your customers using the Messenger chat widget.",
    "description": "<p><div class=\"embed-vimeo\" style=\"text-align: center;\"><iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/339614063\" width=\"750\" height=\"422\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n</p>\n<p>WP-Chatbot adds an OmniChat™ chat widget to your website. OmniChat by MobileMonkey is patent-pending technology for creating a single chatbot that works in multiple messaging platforms. The OmniChat widget is the fastest and simplest way to add live chat to your WordPress website, convert more leads and engage your customers, even after they’ve left your website.</p>\n<ul>\n<li>One-click installation for WordPress</li>\n<li>Live chat with visitors 24/7, even while you sleep</li>\n<li>Single inbox for all incoming messages, seamlessly integrated Facebook Messenger and native web chat conversations</li>\n<li>Zero-hassle integration with powerful chatbot features</li>\n<li>100% integration with your Facebook Business Page and Facebook Messenger</li>\n</ul>\n<h3>WP-Chatbot’s Explosive Results and Huge Fans</h3>\n<p>WP-Chatbot is the most popular and powerful chatbot in the WordPress ecosystem, powering up tens of thousands of websites with live chat and web chat capabilities. Here are just a few of WP-Chatbot’s fans:</p>\n<ul>\n<li>Entrepreneur named MobileMonkey the best chatbot platform (2017)</li>\n<li>MarTech Breakthrough Awards awarded MobileMonkey the Best Marketing Bot Platform (2019)</li>\n<li>It is the world’s fastest growing official Facebook messenger marketing solutions provider partner (2019)</li>\n<li>Neil Patel selected it as his chatbot of choice (2019)</li>\n<li>Brian Dean of Backlinko endorsed it (2019)</li>\n</ul>\n<h3>Quick facts about the WP-Chatbot</h3>\n<ul>\n<li>Chatbot conversations built in WP-Chatbot work for users signed into Facebook Messenger, or not! </li>\n<li>WP-Chatbot translates chatbot conversations to native web chat if it detects a website visitor is not signed into Facebook Messenger. </li>\n<li>Integrates with your Facebook Business page easily and quickly.</li>\n<li>Conversations from both Facebook Messenger chat and native web chat are seamlessly integrated in a unified inbox.</li>\n<li>Provides live chat functionality to any WordPress website.</li>\n<li>Works on any device, any size, anywhere in the world.</li>\n<li>Compatible with all versions of WordPress.</li>\n<li>Uses chatbot technology to provide constant and instant support, even if no customer service staff are available.</li>\n<li>hats conducted within Facebook messenger can be continued at any time in Messenger, even if users aren’t on your website.</li>\n<li>It is compatible with hundreds of plugins, themes, and ecommerce platforms including WooCommerce.</li>\n<li>It is compatible with MobileMonkey&#8217;s full-featured marketing and customer service chatbot platform with advanced automation, lead generation, and live chat capabilities.</li>\n</ul>\n<h3>OMNICHAT™ CHATBOT TECHNOLOGY HELPS WORDPRESS SITE OWNERS CHAT WITH CUSTOMERS IN THE MESSAGING APPS THEY ALREADY USE</h3>\n<p>WP-Chatbot features MobileMonkey OmniChat technology, a break-through in chat marketing automation that makes chatbots accessible to all businesses and all customers, on many popular chat interfaces.</p>\n<p>Where a WordPress site owner would have to build separate chatbots that work on Facebook Messenger or webchat, intead, build one bot conversation that works on many of the chat applications customers are already using.</p>\n<p>Conversations are all viewable to the site owner in a single, streamlined inbox. Unify your WordPress website customer chats and make it super convenient for site visitors to choose the messaging app that they want to use. That&#8217;s the power of WP-Chatbot OmniChat.</p>\n<h3>[FACEBOOK OFFICIAL] MobileMonkey is the world’s fastest growing official Facebook messenger marketing solutions provider partner</h3>\n<p>In 2019, MobileMonkey, which owns and develops WP-Chatbot was recognized as the world’s fastest growing official Facebook Messenger marketing solutions provider partner.</p>\n<p>The reason for MobileMonkey’s meteoric growth is due in large part to the popularity of the Messenger live chat plug in.</p>\n<p>WP-Chatbot does far more than simply integrate chat on your homepage. It opens up an entirely new marketing channel complete with drip campaigns, chat blasts, RSS feeds, Messenger ads, analytics tracking, and more.</p>\n<p>Chat marketing is the hottest marketing channel available to marketers today. By using WP-Chatbot and MobileMonkey, you are gaining cutting-edge advantage of an enormously powerful tool that promises massive results for years to come. It is the world’s fastest growing official Facebook Messenger marketing solutions provider partner (2019)</p>\n<h3>Advantages of using WP-Chatbot on your website</h3>\n<p>Using a chat bot on your website opens up a new and powerful marketing channel. You can begin building a contact list, and engage these potential customers with ease and power.</p>\n<ul>\n<li>OmniChat adapts to web visitors, serving no-login-required web chat or Facebook Messenger chat depending on the visitor</li>\n<li>Facebook Messenger chat gives businesses access to instant lead capture for more than 1.3 billion Facebook Messenger users worldwide.</li>\n<li>Ability to chat with customers who do not have a Facebook Messenger account using native web chat.</li>\n<li>24/7 interaction with customers. Chat with and interact with customers while you sleep.</li>\n<li>Integration with the fastest-growing messaging platform in the world.</li>\n<li>A single, unified inbox for website chats, Facebook page chats, or other entry points.</li>\n<li>Keep contacts forever. Chat history is persistent regardless of when and how your users messaged you.</li>\n<li>Teamwide access to all chats in multiple messaging apps. Your entire team including support personnel from around the world can access the conversations.</li>\n<li>Available mobile app allows business owners to respond to chats while on-the-go.</li>\n<li>Seamless integration with other powerful chat bot tools. WP-Chatbot is fully integrated with the MobileMonkey chatbot builder.</li>\n</ul>\n<h3>Customize the plugin according to your exact preferences</h3>\n<p>WP-Chatbot is designed to look and feel exactly how you want it. Here’s the level of customization that you gain when using WP-Chatbot.</p>\n<ul>\n<li>Customize shape, location and color with a color picker or hex code</li>\n<li>Create a custom greeting for logged-in users when they see the chatbot</li>\n<li>Create a different greeting for users who are logged in to Messenger and those who are not Facebook Messenger users</li>\n<li>Select the pages on your WordPres site where you want the chat to be located</li>\n<li>Add chat to any or all pages on your website</li>\n<li>Choose the language to use for chat</li>\n<li>Hide the chatbot based on post type, post ID, categories, or device type</li>\n<li>Add your branding with the display photo in the chat window</li>\n<li>Create custom dialogue flows or menus to help users navigate and get the information they need</li>\n<li>Enable or disable Facebook analytics</li>\n<li>Create a chatbot dialogue or use natural language processing (NLP)</li>\n</ul>\n<h3>Supercharge your marketing with a single plugin</h3>\n<p>WP-Chatbot is the ultimate small-but-mighty in the world of WordPress plugins. It’s more than just a chat feature. It’s a method of dramatically improving the number of hot and highly engaged leads for your business.</p>\n<p>Without a Messenger or native web chatbot on your website, leads are slipping through your fingers night and day. With an OmniChat chatbot, you are securing leads night and day. Ordinary live chat plugins don’t compare with the power and potential of an OmniChat chatbot plugin. Why? Because such plugins do not retain the contacts from across chat platforms in a unified inbox.</p>\n<p>By simply installing this chatbot plugin on your WordPress site, you are effectively gaining more leads, more engagement, and more return on your marketing investment — totally free.</p>\n<h3>FAQs:  WP-Chatbot Plugin Questions and Answers</h3>\n<p><strong>What can the WP-Chatbot do?</strong></p>\n<p>The main purpose of the WP-Chatbot is to allow users to have a live chat experience directly on your website. Users can start chatting on any page of your website. The chat is persistent, meaning that if they start a Messenger chat from your website, that chat thread is also available on their mobile device or the desktop version of Facebook Messenger. Chats don’t end when a user leaves your website. They’ve just begun.</p>\n<p><strong>Is that all?</strong></p>\n<p>No. That’s the main purpose of the WP-Chatbot. By using MobileMonkey, a chatbot builder, you can engage with the user long after their first interaction. Using advanced Facebook Messenger chatbots (easy to make, with no coding involved), you can send drip campaigns, segment users, send chat blasts, and more.</p>\n<p><strong>What if no one is available to answer a user’s chat?</strong></p>\n<p>Instead of relying on live support to answer chats, you can set up a chatbot that dialogues with customers using natural language processing (NLP) and artificial intelligence (AI), or you can create a custom sequence that guides users through various menus and options to get exactly what they need. If you want, you can also set a message that informs users when they should check back for a live chat with a real person.</p>\n<p><strong>Will WP-Chatbot work with any WordPress website?</strong></p>\n<p>Yes, WP-Chatbot is designed to work with any website built on WordPress v. 4.6 or higher. It has been tested up to WordPress version 5.5.1.</p>\n<p><strong>What else do I need in order to start using WP-Chatbot?</strong></p>\n<p>When you start using WP-Chatbot, you should have the following:<br />\n&#8211; A Facebook Business Page<br />\n&#8211; Your Facebook Page ID<br />\nIn the setup process, you’ll also need to add your website to the whitelisted pages section within Facebook.</p>\n<p><strong>Is WP-Chatbot compliant with GDPR?</strong></p>\n<p>Yes. Consent, a requisite component of GDPR, takes place when the user clicks the button to “continue as [name].” It’s important that any chatbot dialogues you create should inform subscribers how they can unsubscribe at any time. For example, you can tell users “Just type STOP at any time to unsubscribe.” If you are using MobileMonkey, then MobileMonkey will automatically handle the unsubscribe request. If the contact wishes to have their data deleted from MobileMonkey, they can always send a message via Messenger or via email to make the request,. Once the page owner receives the deletion request, they can easily honor the request by using the delete contact action in MobileMokey.</p>\n<p><strong>Does WP-Chatbot come with any analytics?</strong></p>\n<p>If you have a Facebook Developer account, you can view WP-Chatbot analytics if desired. If you do not have a Facebook Developer account, you can easily create one.</p>\n<p><strong>Can WP-Chatbot increase leads?</strong></p>\n<p>Yes. In fact, that’s the main reason that most website creators and marketers add the plugin. It is a powerful way to grow an active and engaged contact list from your website traffic. Rather than visitors simply stopping in and checking out your site, they are intentionally engaging with your brand in a way that secures them a spot on your contact list.</p>\n<p><strong>Will the WP-Chatbot plugin also improve conversions?</strong></p>\n<p>The answer is most likely yes, but it just depends on the nature of your business, what you consider a conversion, and other factors. Data indicates that users who are able to live chat with a business are worth 4.5 times as customers who don’t chat, and their average order size is 10% larger than non-chatting users.</p>\n<p><strong>Is the WP-Chatbot just for customer support?</strong></p>\n<p>The WP-Chatbot is, of course, a marvelous customer support tool, but it has many other uses in marketing. Most users of WP-Chatbot are also MobileMonkey users.</p>\n<p><strong>How does the chat process work from a user perspective?</strong></p>\n<p>The widget is usually persistently positioned at the lower corner of a website. You can customize the greeting message. One popular greeting is “Hi! How can we help you?” If the user is logged in, they will click the button that reads “Continue as [Name].” Instantly, they receive a message with an invitation to continue the conversation. They can continue with the chat on the website, or in the case that they are a Facebook Messenger user, they can use the Facebook Messenger app to continue.</p>\n<p><strong>Who owns WP-Chatbot?</strong></p>\n<p>WP-Chatbot is owned by MobileMonkey, a chat marketing app and chatbot builder that creates chatbots for Facebook Messenger, native web chat, SMS and more. LarryKim, the founder of MobileMonkey is a three-time winner of the most influential PPC marketer, a number one columnist on Search Engine Land and Search Engine Journal. He founded Wordstream, grew it to one of the world’s leading search marketing firms, and later sold it for $150m. Larry immediately founded MobileMonkey, recognizing chat marketing as one of the hottest marketing tactics available.</p>\n<p><strong>Do any famous people use or endorse WP-Chatbot?</strong></p>\n<p>Yes. Some of the world’s leading marketers and publications are active users of WP-Chatbot or its parent company, MobileMonkey. Here are some of them:</p>\n<p>– Neil Patel, a Forbes top 10 marketer, founder of Quicksprout and Neil Patel Digital<br />\n– Mari Smith, Facebook designated “Small Business and Facebook Marketing Expert”<br />\n– Olga Andrienko, Head of Global Marketing at SEMrush<br />\n– Brian Dean, founder of Backlinko and globally recognized SEO and marketer<br />\n– Cat Howell, CEO of Eight Loop Social and Creator of the Academy<br />\n– Sean Ellis, founder of Growth Hackers<br />\n– Andrea Vahl, Speaker, trainer and consultant, author of Facebook Ads Made Easy<br />\n– Daniel Gilbert, CEO of Brainlabs– Dennis Yu, CTO of BlitzMetrics<br />\n– Mandy Mcewen, CEO of Mod Girl Marketing<br />\n– Vasil Azarov, Founder of Growth Marketing Conference</p>\n<p><strong>What brands have featured WP-Chatbot or MobileMonkey?</strong></p>\n<p>Facebook has named MobileMonkey the fastest growing Messenger partner, due in part to the explosive growth of WP-Chatbot. Many brands and organizations are reviewing MobileMonkey, discussing the advantages of Messenger and chat marketing tools like MobileMonkey, and providing chat marketing strategies and tactics, fueled by MobileMonkey chatbots. Here are some of the publications that MobileMonkey has been seen on.</p>\n<ul>\n<li>Forbes</li>\n<li>Inc.</li>\n<li>Venture Beat</li>\n<li>Wordstream</li>\n<li>Search Engine Journal</li>\n<li>Entrepreneur</li>\n</ul>\n<p><strong>What companies use WP-Chatbot or MobileMonkey?</strong></p>\n<p>There are thousands of small businesses, entrepreneurs, in-house marketers, and freelancers using WP-Chatbot every day. The widget has more than 20,000 active installs and is growing by the dozens on a daily basis. Here are some more happy users:</p>\n<ul>\n<li>UNICEF</li>\n<li>Toyota</li>\n<li>Century 21</li>\n<li>Sofamania</li>\n<li>Hush Puppies</li>\n<li>Big Guys Pizza</li>\n<li>Veterans United Home Loans</li>\n<li>VMWare</li>\n<li>DocsApp</li>\n<li>Outdoorsy</li>\n<li>Search Engine Journal</li>\n</ul>\n<p><strong>Does the chatbot plugin require any coding?</strong></p>\n<p>No. Not at all. In fact, you can even create advanced and high-impact chatbot sequences on MobileMonkey without any coding.</p>\n<p><strong>Is the chat history deleted or can I save them?</strong></p>\n<p>All chats are automatically stored in your MobileMonkey inbox (in the web app or mobile app), where they are stored indefinitely or until a user unsubscribes from your list. There’s no need to manually save chats. The user also retains a persistent record of their chat history with you if the chat is conducted in Facebook Messenger.</p>\n<p><strong>Can I see information about contacts who opt-in to the chat?</strong></p>\n<p>If they&#8217;re chatting with you through Facebook Messenger, yes. In fact, when a visitor on your site chats with you as a logged in Facebook Messenger user, you can see their name as well as a good deal of information that they have chosen to share publicly on their Facebook profile. This may include their language, where they&#8217;re located, and more.</p>\n<p><strong>Can anyone on your business’s support team or customer service team chat with users?</strong></p>\n<p>Yes. Anyone who has a page role on your Business Page (Admin, Editor, Moderator) can chat. Even if the chat is bot-driven, a human can step in at any time to chat with the site visitor.</p>\n<p><strong>How do users start a chat?</strong></p>\n<p>o start chatting from your website, a user clicks the chat graphic on the widget, wherever it is positioned on the page. If the user is already logged into Facebook or Facebook Messenger on their browser or mobile device, the widget can display the button message “Continue as [Name].” If the user is not logged in to Facebook Messenger, the button will greet the visitor as you tell it to for native web chat users.</p>\n<p><strong>Does WP-Chatbot provide support?</strong></p>\n<p>Yes. WP-Chatbot has a large support forum with fast response and top-rated support.</p>\n<p><strong>Is WP-Chatbot similar to ManyChat?</strong></p>\n<p>ManyChat is a chatbot builder, but is not a WordPress plugin. WP-Chatbot makes it easy for website visitors to chat with you on Facebook Messenger as well as outside of Messenger, which is really handy because not every site visitor is logged into Facebook. For maximum chatbot power, WP-Chatbot seamlessly integrates with MobileMonkey, a robust and full-featured chatbot builder. MobileMonkey is where you can harness the full power of chat marketing, creating drip sequences, lead magnets, chat blasts, and more.</p>\n<p><strong>How is WP-Chatbot different from other WordPress chatbot plugins?</strong></p>\n<p>Many plugins simply open a link to a Facebook page. WP-Chatbot integrates the chat on your website with no new tabs or links being required to continue the chat. Another distinguishing feature is WP-Chatbot’s ease of use. Installing the plugin to your site and connecting it to your Facebook Business page is simple and requires only a few minutes.</p>\n<p><strong>How is WP-Chatbot different from Tidio Live Chat?</strong></p>\n<p>Tidio Live Chat is a great chatbot for communicating with customers on your website. it is not connected with Facebook or Facebook Messenger. WP-Chatbot has the same chat functionality as Tidio Live Chat, allows businesses to connect with customers using  Messenger as the messaging platform. This has lead generation benefits as customers can receive follow-up messaging from the business. And customers are likely to use Messenger as a chat forum because it’s safe and familiar. Tidio is a fitting WordPress chabot plugin if you don’t want to integrate with Facebook Messenger.</p>\n<p><strong>Is WP-Chatbot similar to Collect.chat?</strong></p>\n<p>Collect.chat is a chatbot plugin that allows you to chat with customers on your website. Like other chatbots including Tidio, Collect.chat is a native chat application without integration to Facebook Messenger. While Colllect.chat provides useful chat functionality, it is limited in what it can offer for retaining chat users for. WP-Chatbot features native website chat and Facebook Messenger chat at the same time.</p>\n<p><strong>Does WP-Chatbot have the same level of power as the IBM Watson Assistant?</strong></p>\n<p>IBM Watson is a chatbot plugin that uses IBM’s data and information to create an intelligent chatbot. It is not a website widget chatbot, so it’s not possible to continue marketing to chatbot users on Facebook. Additionally, in order to gain the full functionality of IBM Watson, it is necessary to purchase IBM Cloud usage.</p>\n<p><strong>Are there are WordPress chatbot plugins that are similar to WP-Chatbot?</strong></p>\n<p>There are currently dozens of WordPress chatbot plugins including Cliengo, Clientity, Acobot, My Chatbot, HubSpot, Instabot, Chatbot Botnation, Chatfuel, ArtiBot, Bot Libre, GoBot, and Botsify. Most of these chatbots do not integrate with Facebook Messenger. And not one of them offers OmniChat™, the patent-pending technology that makes one chat marketing flow work in multiple messaging apps. Alternative WordPress chatbot plugins typically offer a single limited feature, for example, to improve an onsite shopping experience or to send newsletters.</p>\n<p><strong>Does WP-Chatbot work in other countries or with other languages?</strong></p>\n<p>Yes, WP-Chatbot supports all Facebook languages, which is currently 142 different languages.</p>\n<p><strong>Does WP-Chatbot work in real time?</strong></p>\n<p>Yes, WP-Chatbot transmits messages in real time within Facebook Messenger as well as native web chat.</p>\n<p><strong>What industries is WP-Chatbot helpful for?</strong></p>\n<p>Any industry is a perfect case use for website chatting. WP-Chatbot is highly flexible, meaning that you can customize it for any industry, any vertical, any business type, and any audience (B2B or B2C). Here are some business types that have found the WP-Chatbot to be very useful:</p>\n<ul>\n<li>Chatbots for small businesses</li>\n<li>Chatbots for restaurants</li>\n<li>Chatbots for agencies</li>\n<li>Chatbots for doctor’s offices</li>\n<li>Chatbots for influencers</li>\n<li>Chatbots for consultants</li>\n<li>Chatbots for personal trainers</li>\n<li>Chatbots for personal coaches</li>\n<li>Chatbots for MLM sales</li>\n<li>Chatbots for brick-and-mortar shops</li>\n<li>Chatbots for ecommerce</li>\n<li>Chatbots for selling online courses</li>\n<li>Chatbots for entrepreneurs</li>\n<li>Chatbots for digital marketers</li>\n<li>Chatbots for designers</li>\n<li>Chatbots for freelancers</li>\n</ul>\n<h3>WP-Chatbot and MobileMonkey: What else can you do with the chatbot?</h3>\n<p>Integrating the plugin to your website and Facebook page is only the first step. Once you’ve done that, the marketing possibilities are endless. You can do each one of these actions using the chatbot building platform, MobileMonkey.</p>\n<p><strong>Customers who engage with you are contacts for life.</strong></p>\n<p>One of the main advantages of WP-Chatbot over ordinary chatbot plugins is the chatbot integration with Facebook Messenger. When site visitors are logged into Facebook Messenger and start a conversation with your bot or live agent, users can access this chat and chat history on their phone or their desktop, not just on your website. In addition, they remain on your contact list until they choose to unsubscribe.</p>\n<p><strong>Grow your contact list.</strong></p>\n<p>WP-Chatbot makes it easy and effortless to amass a huge contact list of messaging contacts. The power of chatbots goes beyond a single interaction on your website. The real power begins once you’ve gained that contact.</p>\n<p><strong>Send contacts chat blasts.</strong></p>\n<p>A chat blast is a message that you can send to your entire chat mailing list. A single blast can reach thousands of potential customers with any variety of marketing messages. Within the Facebook Messenger platform, you can expect to get 80% open rates and 40% clickthrough rates within sixty minutes!</p>\n<p><strong>Create an RSS integration that sends new content to your mailing list.</strong></p>\n<p>Another powerful feature of Facebook Messenger marketing is the ability to connect your Messenger contact list with an RSS feed. Every time you publish something to the feed, it will send your mailing list a link to the content along with a custom message. All it takes is a quick thirty-second integration using MobileMonkey, and you’re set forever.</p>\n<p><strong>Market to your messaging contact list using a drip campaign.</strong></p>\n<p>A drip campaign is a powerful way to methodically coax your users to conversion. Perhaps you want them to schedule a consultation, attend a webinar, or download a resource. Whatever it is you want them to do, you can create a drip campaign in MobileMonkey that allows you to achieve that. The drip campaign sends the user a series of messages in a live and interactive way. You can easily amass hundreds of conversions in a few minutes using a strategic drip campaign on Facebook Messenger or other messaging platform.</p>\n<p><strong>Combine the power of your chatbot plugin with your Facebook Business page.</strong></p>\n<p>Once you install your chatbot plugin and begin building a lead list, you can also build your lead list using Facebook. To do so, create click-to-Messenger ads on Facebook. When users convert on the ad, they are added to your Messenger mailing list. Click-to-Messenger ads are less expensive and more effective than conventional Facebook display ads. Plus, the user is consenting to allow you to message them again.</p>\n<p><strong>You have access to a huge audience.</strong></p>\n<p>Facebook’s messaging applications including WhatsApp and Instagram are the largest in the world, by far. 11% of the world’s total population uses one of Facebook’s messaging apps. With access to an audience this large, you are sure to increase your marketing reach and power.</p>\n<p><strong>Answer FAQs.</strong></p>\n<p>One great thing about chatbots is that they can be programmed to answer the questions that users are likely to ask. Setting this up in MobileMonkey is easy, and doesn’t require any coding.</p>\n<p><strong>Qualify leads.</strong></p>\n<p>Not everyone who starts chatting on your website will turn out to be a valuable lead. A chatbot can help qualify leads by guiding them through a series of questions. Even a certain contact isn’t a lead right now, they might turn into one later. You can invite them to join a Facebook group, retain them in your contact list, or simply message them from time to time to keep them engaged.</p>\n<p><strong>Notify the sales team about hot leads.</strong></p>\n<p>When a potential lead does qualify themselves through a chatbot dialogue, you can easily alert your sales team about it. They can step in for a live chat with the potential lead and close the deal.</p>\n<p><strong>Allow contacts to set appointments.</strong></p>\n<p>Does your business use appointment setting? Whether you operate a dentist office, gym, or restaurant, users can make reservations, schedule appointments, make changes to their reservation, check the status of their appointment, get directions, and more.</p>\n<h3>Technical Facts about the Chatbot Plugin</h3>\n<ul>\n<li>Number of active installations:  20,000. Historic installations:  315,000</li>\n<li>Version of WordPress: 4.6 or higher</li>\n<li>Version of WordPress tested up to:  Version 5.5.1</li>\n</ul>\n<h3>Contributors and Developers</h3>\n<p>“WP-Chatbot for Messenger is open source software. The following people have contributed to this plugin.</p>\n<p><a href=\"https://profiles.wordpress.org/larrykim/\" rel=\"nofollow ugc\">larrykim</a>     <a href=\"https://profiles.wordpress.org/yankovski/\" rel=\"nofollow ugc\">yankovski</a></p>\n<h3>Five Star Reviews of WP-Chatbot</h3>\n<p>WP-Chatbot has exclusively five-star reviews. Check out some of the recent reviews by users of WP-Chatbot.</p>\n<p>⭐️⭐️⭐️⭐️⭐️Really, It is the best chatbot plugin out there. The plugin works so smooth and has some advanced features also. <strong>(@rahulbiswal)</strong></p>\n<p><strong>Incredible plugin!</strong>⭐️⭐️⭐️⭐️⭐️<br />\nSimple to install, and easy to configure! This plugin is a gem for marketers! <strong>(@kristelcuenta)</strong></p>\n<p><strong>So easy</strong>⭐️⭐️⭐️⭐️⭐️<br />\nI’ve been procrastinating on site chat because I figured it would be a pain, but it turns out it’s a lot easier than I thought. In my industry it takes 12-18 touches to turn someone into a buyer, so every new channel I can set up is gold.  <strong>(@formido)</strong></p>\n<p><strong>Works as expected!</strong>⭐️⭐️⭐️⭐️⭐️<br />\nGreat plugin, functions properly, easy to set up and looks great! Support is responsive as well. Would recommend! <strong>(@jordanho)</strong></p>\n<p><strong>If 6 stars were available I would give them.</strong>⭐️⭐️⭐️⭐️⭐️<br />\nI’ve just discovered WP-Chatbot a few days ago. It’s insanely useful. In fact, it helps me connect with my Facebook users directly from my website. As users love chatbots even more than emails, I think I’ll never uninstall this plugin. Thanks for having created it. <strong>(@giuseppedeepakbenti)</strong></p>\n<p><strong>Great Plugin for Chat Support.</strong>⭐️⭐️⭐️⭐️⭐️<br />\nI love this plugin, it really works with no problems with the new WordPress version. <strong>(@jhsandy)</strong></p>\n<p><strong>Works perfectly with 5.1.1.</strong>⭐️⭐️⭐️⭐️⭐️<br />\nI have not experienced any problems with WP 5.1.1 thank you for a great plug-in. <strong>(@jweaver214)</strong></p>\n<p><strong>Easy to set up</strong>⭐️⭐️⭐️⭐️⭐️<br />\nEasy to use and set up. <strong>(@lancememan)</strong></p>\n<p><strong>Nice Plugin</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThis plugin is very easy to implement. Very straight forward and support is very responsive. <strong>(@ladykatherynstark)</strong></p>\n<p><strong>Best Chatbot Plugin</strong>⭐️⭐️⭐️⭐️⭐️<br />\nBest plugin, easy to setup, easy to use and great support. <strong>(@gmatters)</strong></p>\n<p><strong>Incredible Support</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThe educational support and low bar of entry available for this Facebook chatbot builder are unmatched. Larry, Virginia, and the rest of the Mobile Monkey team have done a phenomenal job getting marketers acclimated with one of the most efficient ways to market your business online now. Thank you for such an incredible contribution to the digital entrepreneur community! <strong>(@notifyneal)</strong></p>\n<p><strong>Great Plugin for Chatbot</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThis is a great plugin for Chatbot. Doesn’t impact pagespeed and is simple to set up. A very useful plugin to chat with current and new customers off of your WordPress website. <strong>(@rez311)</strong></p>\n<p><strong>Great job!</strong>⭐️⭐️⭐️⭐️⭐️<br />\nJust plug and play to have a working FB chatbot &#8211; cool! <strong>(@benpines)</strong></p>\n<p><strong>Best chatbot plugin</strong>⭐️⭐️⭐️⭐️⭐️<br />\nInstall was super easy and I’m already seeing results. Love it! WP-Chatbot really helps you grow your business, I already started connecting with my visitors and messaging them directly to get them back. <strong>(@maxcr)</strong></p>\n<p><strong>Finally Messenger chat that’s easy</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThis one works simply by putting almost all settings inside WordPress. (The only part that’s left out is connecting to Facebook. And even the button to initiate that is inside of WordPress.) <strong>(@andrewwarner)</strong></p>\n<p><strong>Great plugin</strong>⭐️⭐️⭐️⭐️⭐️<br />\nI started using this today. Works great so far! <strong>(@backlinko)</strong></p>\n<p><strong>Installed and Working</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThe plugin is installed and works as advertised. I’m happy :-). <strong>(@brianjjaxn)</strong></p>\n<p><strong>What was needed</strong>⭐️⭐️⭐️⭐️⭐️<br />\nVery handy plugin that fully performs its functions. I am pleased <strong>(@holysheepcoder)</strong></p>\n<p><strong>Best Facebook Chat Plugin</strong>⭐️⭐️⭐️⭐️⭐️<br />\nPerfectly streamlined for both mobile &amp; desktop users. Most WordPress Facebook chat plugins just opens a link to the facebook page. This plugin has full API capabilities and it is completely inline. Best Facebook Chat plugin with no question. <strong>(@avdigiovanniv)</strong></p>\n<p><strong>Amazing</strong>⭐️⭐️⭐️⭐️⭐️<br />\nStraightforward. Works! <strong>(@aleknovkovski)</strong></p>\n<p><strong>Excellent service and plugin</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThese developers are truly passionate about this project. They’re responsive and efficient in resolving issues &#8211; Would definitely recommend using this plugin. <strong>(@dimsumdesigns)</strong></p>\n<p><strong>Good plugin, good support</strong>⭐️⭐️⭐️⭐️⭐️<br />\nPlugin working perfectly now. Had some great support from the developer! <strong>(@macr0ni)</strong></p>\n<p><strong>Excellent plugin, great support!!</strong>⭐️⭐️⭐️⭐️⭐️<br />\nEvery website needs to be reachable to its customers, you need this plugin! <strong>(@rgenck)</strong></p>\n<p><strong>Simple and effective!</strong>⭐️⭐️⭐️⭐️⭐️<br />\nGreat job, thanks! <strong>(@wstrzalkowska)</strong></p>\n<p><strong>Super Impressed and Super Easy 2 setup</strong>⭐️⭐️⭐️⭐️⭐️<br />\nThis is simply the best plugin for quick chat directly connected to your Facebook page chat. If you’re using facebook bot for the chat this is perfect! Thank you guys for your amazing work! Keep it up! So happy that I found your plugin! <strong>(@cristianuibar)</strong></p>\n<p><strong>Better than premium support!</strong>⭐️⭐️⭐️⭐️⭐️<br />\nI honestly use a lot of premium plugins and use their support. I have to admit that for a free plugin, your support is as good, if not better, than other companies’ premium support!! Thanks!!! <strong>(@boulosblack)</strong></p>\n<p><strong>Best WP Messenger app</strong>⭐️⭐️⭐️⭐️⭐️<br />\nthis is a great app. Easy to install even if due do another widget I had a problem. They have a great and quick support and now everything is working great. <strong>(@mralet)</strong></p>\n<p><strong>Excellent plugin, very easy setup</strong>⭐️⭐️⭐️⭐️⭐️<br />\nAn amazing plugin that works well and is very easy to set up. <strong>(@thethandon)</strong></p>\n<p><strong>It works perfectly</strong>⭐️⭐️⭐️⭐️⭐️<br />\nit is very helpful! Good job!<strong>(@duynguyen)</strong></p>\n<h3>List of Compatible Chatbot Integrations</h3>\n<p>WP-Chatbot is extremely flexible, versatile, and compatible. Because it works seamlessly with MobileMonkey, an integration powerhouse, any webhook or Zapier connection works. Here is a sample of popular chatbot integrations.</p>\n<ul>\n<li>AWeber</li>\n<li>ActiveCampaign</li>\n<li>AgileCRM</li>\n<li>Autopilot</li>\n<li>Capsule</li>\n<li>ConvertKit</li>\n<li>Copper</li>\n<li>Customerly</li>\n<li>Drift</li>\n<li>Drip</li>\n<li>Flexie</li>\n<li>Gist</li>\n<li>Groundhogg</li>\n<li>HubSpot</li>\n<li>Infusionsoft</li>\n<li>Intercom</li>\n<li>Kartra</li>\n<li>MailChimp</li>\n<li>MailerLite</li>\n<li>Mailjet</li>\n<li>Maropost</li>\n<li>Mautic</li>\n<li>NationBuilder</li>\n<li>Ontraport</li>\n<li>Platform.ly</li>\n<li>Salesflare</li>\n<li>Salesforce</li>\n<li>SendinBlue</li>\n<li>Shopify</li>\n<li>Sendlane</li>\n<li>Tubular</li>\n<li>UserEngage</li>\n<li>Zoho</li>\n<li>Drift</li>\n<li>Intercom</li>\n<li>Freshdesk</li>\n<li>Woocommerce</li>\n</ul>\n<h3>Solutions: Using MobileMonkey, WP-Chatbot works with all of the following chatbot integration categories:</h3>\n<ul>\n<li>Accounting</li>\n<li>Ads and Analytics</li>\n<li>Amazon Web Services (AWS)</li>\n<li>Analytics</li>\n<li>App Builder</li>\n<li>Appointment setting</li>\n<li>Bookmarks</li>\n<li>Calendar</li>\n<li>Call Tracking</li>\n<li>Contacts</li>\n<li>Customer Appreciation</li>\n<li>Customer Relationship Management (CRM)</li>\n<li>Customer Support</li>\n<li>Dashboards</li>\n<li>Databases</li>\n<li>Developer Tools</li>\n<li>Devices</li>\n<li>Documents</li>\n<li>Drip Emails</li>\n<li>Ecommerce</li>\n<li>Education</li>\n<li>Email</li>\n<li>Email Newsletters</li>\n<li>Event Management</li>\n<li>FAQ</li>\n<li>Facebook</li>\n<li>Fax</li>\n<li>Files</li>\n<li>Fitness &amp; Entertainment</li>\n<li>Forms</li>\n<li>Fundraising</li>\n<li>Gaming</li>\n<li>Google</li>\n<li>Human Resources (HR)</li>\n<li>Management Tools</li>\n<li>Marketing Automation</li>\n<li>Microsoft</li>\n<li>Net Promoter Score</li>\n<li>News</li>\n<li>Notes</li>\n<li>Notifications</li>\n<li>Payment Processing</li>\n<li>Phone &amp; SMS</li>\n<li>Printing</li>\n<li>Product Management</li>\n<li>Project Management</li>\n<li>Proposals &amp; Invoices</li>\n<li>Real Estate</li>\n<li>Reports</li>\n<li>Reminders</li>\n<li>Scheduling</li>\n<li>Server Monitoring</li>\n<li>Signatures</li>\n<li>Social Media</li>\n<li>Social Media Management</li>\n<li>Spreadsheets</li>\n<li>Surveys</li>\n<li>Team Chat</li>\n<li>Team Collaboration</li>\n<li>Time Tracking</li>\n<li>To-do Lists</li>\n<li>Transactional Email</li>\n<li>Video Calls</li>\n<li>Video, Audio, &amp; Images</li>\n<li>Webinars</li>\n<li>Websites</li>\n<li>WordPress</li>\n<li>Zapier</li>\n<li>Zoho</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wp-chatbot.4.9.zip",
    "upgrade_notice": {
        "From Dashboard ( WordPress Admin )": "<ul>\n<li>If a plugin new version is released - you will see an &#039;update now&#039; link at wp-admin -&gt; plugins</li>\n<li>Click on &#039;Update Now&#039;</li>\n</ul>",
        "Using FTP or similar": "<ul>\n<li>Delete the existing wp-chatbot folder - your settings will not be lost.</li>\n<li>Unzip downloaded &quot;wp-chatbot&quot; file and</li>\n<li>Upload <code>wp-chatbot</code> folder to the <code>/wp-content/plugins/</code> directory.</li>\n<li>Activate the plugin via the &quot;Plugins&quot; menu in WordPress Admin.</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/wp-chatbot/assets/screenshot-1.png?rev=2292955",
            "caption": "Demo"
        },
        {
            "src": "https://ps.w.org/wp-chatbot/assets/screenshot-2.png?rev=2292955",
            "caption": "Plugin Settings: Chatbot Setup"
        },
        {
            "src": "https://ps.w.org/wp-chatbot/assets/screenshot-3.png?rev=2292955",
            "caption": "Plugin Settings: Customize Widget"
        },
        {
            "src": "https://ps.w.org/wp-chatbot/assets/screenshot-4.png?rev=2292955",
            "caption": "View your Leads"
        }
    ],
    "tags": {
        "chatbot": "chatbot",
        "customer-chat": "customer chat",
        "facebook-messenger": "facebook messenger",
        "free-live-chat": "free live chat",
        "live-support": "live support"
    },
    "stable_tag": "4.9",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/wp-chatbot.1.0.0.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/wp-chatbot.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/wp-chatbot.1.1.1.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/wp-chatbot.1.2.0.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/wp-chatbot.1.3.0.zip",
        "2.0": "https://downloads.wordpress.org/plugin/wp-chatbot.2.0.zip",
        "2.1": "https://downloads.wordpress.org/plugin/wp-chatbot.2.1.zip",
        "2.2": "https://downloads.wordpress.org/plugin/wp-chatbot.2.2.zip",
        "3.0": "https://downloads.wordpress.org/plugin/wp-chatbot.3.0.zip",
        "3.5": "https://downloads.wordpress.org/plugin/wp-chatbot.3.5.zip",
        "3.7": "https://downloads.wordpress.org/plugin/wp-chatbot.3.7.zip",
        "4.0.1": "https://downloads.wordpress.org/plugin/wp-chatbot.4.0.1.zip",
        "4.0.8": "https://downloads.wordpress.org/plugin/wp-chatbot.4.0.8.zip",
        "4.0.9": "https://downloads.wordpress.org/plugin/wp-chatbot.4.0.9.zip",
        "4.1.2": "https://downloads.wordpress.org/plugin/wp-chatbot.4.1.2.zip",
        "4.1.3": "https://downloads.wordpress.org/plugin/wp-chatbot.4.1.3.zip",
        "4.1.4": "https://downloads.wordpress.org/plugin/wp-chatbot.4.1.4.zip",
        "4.1.5": "https://downloads.wordpress.org/plugin/wp-chatbot.4.1.5.zip",
        "4.2": "https://downloads.wordpress.org/plugin/wp-chatbot.4.2.zip",
        "4.3": "https://downloads.wordpress.org/plugin/wp-chatbot.4.3.zip",
        "4.4": "https://downloads.wordpress.org/plugin/wp-chatbot.4.4.zip",
        "4.5": "https://downloads.wordpress.org/plugin/wp-chatbot.4.5.zip",
        "4.6": "https://downloads.wordpress.org/plugin/wp-chatbot.4.6.zip",
        "4.6.1": "https://downloads.wordpress.org/plugin/wp-chatbot.4.6.1.zip",
        "4.6.2": "https://downloads.wordpress.org/plugin/wp-chatbot.4.6.2.zip",
        "4.6.3": "https://downloads.wordpress.org/plugin/wp-chatbot.4.6.3.zip",
        "4.7": "https://downloads.wordpress.org/plugin/wp-chatbot.4.7.zip",
        "4.8": "https://downloads.wordpress.org/plugin/wp-chatbot.4.8.zip",
        "4.9": "https://downloads.wordpress.org/plugin/wp-chatbot.4.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wp-chatbot.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/wp-chatbot/assets/banner-772x250.png?rev=2292955",
        "high": "https://ps.w.org/wp-chatbot/assets/banner-1544x500.png?rev=2292955"
    },
    "icons": {
        "1x": "https://ps.w.org/wp-chatbot/assets/icon-128x128.png?rev=2012199"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 78,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "wp-chatbot",
            "language": "sv_SE",
            "version": "4.9",
            "updated": "2023-03-04 12:52:38",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-chatbot/4.9/sv_SE.zip"
        }
    ]
}