{
    "name": "WP Forms Signature Contract Add-On",
    "slug": "wp-forms-signature-contract-add-on",
    "version": "1.8.1",
    "author": "<a href=\"http://aprv.me/wpForms\">ApproveMe.com</a>",
    "author_profile": "https://profiles.wordpress.org/approveme/",
    "contributors": {
        "approveme": {
            "profile": "https://profiles.wordpress.org/approveme/",
            "avatar": "https://secure.gravatar.com/avatar/620cf850230b2d03a2cf5763c9727998?s=96&d=monsterid&r=g",
            "display_name": "approveme"
        }
    },
    "requires": "4.5",
    "tested": "6.5.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 88,
    "ratings": {
        "5": 4,
        "4": 0,
        "3": 0,
        "2": 1,
        "1": 0
    },
    "num_ratings": 5,
    "support_url": "https://wordpress.org/support/plugin/wp-forms-signature-contract-add-on/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 45634,
    "last_updated": "2024-05-21 4:39pm GMT",
    "added": "2016-12-28",
    "homepage": "http://aprv.me/2lIyMBx",
    "sections": {
        "description": "<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">Try WPForms Signature Demo Here</a></strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ih0C9W4ql0I?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><em>Please note you will need the following plugins installed to completely automate the process of collection of contracts using WP Forms and WP e-signature.</em><br />\n1. <a href=\"https://wordpress.org/plugins/wpforms-lite/\" rel=\"ugc\">WPForms</a><br />\n2. <a href=\"http://aprv.me/2lIyMBx\" rel=\"nofollow ugc\">WP e-signature</a> (Elite Or Lifetime license)<br />\n3. <a href=\"https://aprv.me/2lIyMBx\" rel=\"nofollow ugc\">Stand Alone Document</a> (comes with above licenses)</p>\n<p>*An Elite Or Lifetime license license is required and can be purchased at <a href=\"https://www.approveme.com/wpforms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">www.approveme.com</a></p>\n<p><strong>What would you do if you discover the contracts you used in running your online business were not legally binding?</strong></p>\n<h4>WPForms Digital Signature Add-On</h4>\n<p>Imagine being in a courtroom with an estranged client who’s claiming that they never agreed to your contract.  You pull up the contract and after a brief review, the judge announces that the e-signature used in the contract was not legally valid.  He then asks if you have anything else to support your case.</p>\n<p>Hopefully it will never come to to this, but if it did, what would you do?</p>\n<p>Well, there’s not much you could do.</p>\n<p><strong>The electronic document industry has very strict rules and regulations for legal contracts, invoices, employee agreements and any other legally binding document you may use in your business.</strong></p>\n<p><strong>WP Forms is a terrific WordPress Form Plugin!</strong> It is quite possibly one of the best ways to automate any number of tasks using a WordPress website (and of course their renowned contact forms plugin). However, <em>signing legally binding contracts is NOT WPForms primary focus</em> (it is however ApproveMe’s WP e-signature sole focus). We have invested many years building a system that adheres to the strictest <a href=\"http://aprv.me/2lIEKSE\" rel=\"nofollow ugc\">UETA and ESIGN</a> nationwide and foreign document signing regulations.</p>\n<p><em>This Signature Pad Plugin fills the gap between a WordPress Form plugin and an e-signature solution that is compliant with the UETA/ESIGN guidelines.</em></p>\n<p>Digital security is crucial to your business.  You need to protect yourself from anything that could call your forms into question.</p>\n<p><strong>The ApproveMe WP E-Signature Plugin turns your WordPress site into a court recognized document signing app.</strong></p>\n<p>If you’re a WP Forms user, you know how powerful their plugin can be to help automate a number of tasks on your website.  HOWEVER, signing legally binding contracts is NOT their primary focus.  That’s where we come in.</p>\n<p>The WP Forms Digital Signature Add-On ensures that every contact form, contract, or invoice submitted with the WP Form plugin is 100% UETA/ESIGN compliant.</p>\n<p>No more second-guessing the legality of your contracts or needing to use a third-party signing service.</p>\n<p>We’ve invested years into building a system that adheres the strictest nationwide and foreign document signing regulations while allowing you to control your user experience.</p>\n<p>You get a 100% legally compliant signature on file to protect you and the customer, without having to worry about users getting distracted or being unsecure on third party sites.</p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">Click Here to Try WP Forms Signature Demo</a></strong></p>\n<p><strong>How this e-signature &amp; WordPress Contract Plugin is different than a typical WPForms WordPress signature pad addon</strong><br />\nMost signature pad plugins simply record signature details and submit the data to a web server where it is converted to a PNG or JPEG file.  This graphic file then gets saved on your FTP server.</p>\n<p>This image file of your client’s hand-written legal signature — the same one used to buy houses, sign up for credit cards, and obtain business loans — is easily accessible to any FTP intruders.</p>\n<p>Here’s the problem:</p>\n<p>Most of these plugins are not legally binding (much less UETA/ESIGN compliant) as they fail to address the countless laws and regulations that guide the document signing industry.</p>\n<p>If the legality of your contract were to ever come into question, you wouldn’t have much to stand alone.  And if fraud or identity theft were ever an issue, you would have a tough time proving your case with a signature that the courts don’t recognize.  Why risk it?</p>\n<p><strong>ApproveMe’s brand new signature add-on found at <a href=\"http://aprv.me/2lIyMBx\" rel=\"nofollow ugc\">ApproveMe.com</a> it is the connection point between a WordPress forms plugin and having a UETA / ESIGN compliant WordPress contract plugin that runs on your WordPress site.</strong></p>\n<p><strong>Check out the video clip above to find out ways to save time and money by fully automating legal contracts for your website design, digital photography, freelance or consulting business making use of our WP Forms Digital Signature Add-On.</strong></p>\n<p>=MORE ON HOW THIS UETA/ESIGN COMPLIANT WORDPRESS FORM SIGNATURE PLUGIN WORKS=</p>\n<p>**<a href=\"http://aprv.me/2lIyMBx\" rel=\"nofollow ugc\">ApproveMe’s Signature Add-On for WP Forms</a> generates a UETA/ESIGN compliant court recognized contract with (optional) details/field values inserted anywhere you want them inserted in the contract.  These dynamic field values are taken from the submitted form of your end user.</p>\n<p>Your form submitter can either draw or type their legal  signature using their mouse, trackpad, tablet or smartphone.  All of this magic happens the instant an end user submits a WP Form by either emailing a signer specific invitation to their contract or immediately redirecting the end users.**</p>\n<p>Another highly popular use case is pre-filling contract data that might change from contract to contract. Say for instance, you are a Web Design agency and you have a standard contract you send out that varies ever so slightly every time you bring on a new client. Maybe you have optional packages available that need to be noted in your contract. But creating a new contract from scratch is incredibly time consuming.</p>\n<p>With this WP Forms Signature Add-On + ApproveMe’s WP e-signature (license) you can create a WP Form with the fields and sections of the contract that vary and add an additional field for the “Signers Name” + “Signers Email.”</p>\n<p>Your WPForm would look something like:</p>\n<p>DROPDOWN FIELD 1  = Dropdown of available packages<br />\nPARAGRAPH FIELD 2 = Classes or terms that vary from contract to contract<br />\nTEXT FIELD 2 = SIGNERS FULL NAME<br />\nTEXT FIELD 3 = SIGNERS EMAIL ADDRESS</p>\n<p>You would insert these WP Field values in your WP e-signature contract in the proper places or paragraphs that pertain to this information.</p>\n<p>You would choose the option “Email this contract whenever this form is submitted.”</p>\n<p>Now, whenever you fill out this WPForm, your contract will be automatically generated with the custom terms from your WP Form submission and then a signer invitation email will be sent to the signer email address that was given in the WP Form submission.</p>\n<p><em>Additional benefits of ApproveMe’s WP eSign Plugin and this for WP Forms Signature Add-On is that you are able to instantly create a legal contract for your clients to sign depending on their form information from a WPForm.</em></p>\n<p><strong>And that’s just the beginning. When a client signs…</strong></p>\n<p><em>… both you and the client will instantly get a PDF of the contract that they signed (e-signature automation at its finest).</em></p>\n<p><em>…registering or sending your client to a third-party website to sign your legal contracts is not required (all signatures take place on your WordPress website… so the experience is on your site and not someone else’s)</em></p>\n<p><em>… you’ll have a 100% legally compliant electronic signature on file to protect you AND the customer (according to UETA/ESIGN guidelines).</em></p>\n<h3>WP Forms Digital Signature add-on and WordPress Signature turns your site &amp; WordPress Form into a court recognized document signing application (but without the monthly fees… and with unlimited amount of users).</h3>\n<ul>\n<li>Ideal for anyone who wants to automate signature collection on proposals, quotes, timesheets, service terms agreements, new client legal contracts, waiver forms and much more using a WordPress form! *</li>\n</ul>\n<p>Immediately redirect your site visitors to sign a legally binding contract after submitting a WordPress Form that was created using WP Forms.</p>\n<p>“I agree to terms” checkboxes have the legal standing of a limp handshake. <strong>Do the smart thing. Don’t get caught in a courtroom with a document that’s not legally binding.</strong></p>\n<p><strong>The Powerful Features of ApproveMe’s Digital Signature Add-On for WP Forms:</strong></p>\n<p><strong>ADDON FEATURES THAT YOU CAN CUSTOMIZE</strong><br />\nWP e-signature offers an incredibly in depth e-signature add-on collection with several easy to customize <a href=\"http://aprv.me/2lIyMBx\" rel=\"nofollow ugc\">WP Forms e-signature automations</a> and <a href=\"https://www.approveme.com/esign-integrations?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">third-party integrations</a> to even further improve your personalized document signing requirements.</p>\n<p>=The WordPress contract plugin operates on every leading PC and web browsers for smart phones. For example Chrome, FireFox, Opera, Safari, Android, iOS, and WebOS.=</p>\n<p><em>Besides being user friendly, ApproveMe’s WP Forms WordPress Signature Plugin is able to instantly enter details which was posted from a WP Form into a UETA/ESIGN compliant and courtroom accepted contract form utilizing your own WordPress website.</em></p>\n<p>Therefore if you have a dropdown list of options in your WP Form named “Web Design Package” and you provide various products (different price points for each) it is possible to easily produce a legal contract which includes the package features of an order in the written agreement which is then sent to the end-user of your WP Form.</p>\n<p><strong>Instantly Trigger Contracts To Be Sent</strong> As soon as a client inputs data into and submits a WP form (that is connected to a WP e-signature contract using this add-on) it is possible to instantly generate a Contract to be delivered either by email or by redirecting the signer to the contract immediately as the “thank you page.”</p>\n<p><strong>Connect WP Forms Digital Signature With WP e-signature</strong> This WP Forms Add-On will blend the powerful automation attributes of WP forms with the e-signature features and peace of mind offered with WP e-signature.</p>\n<p><strong>Include WP Form Field Values Inside A WP e-signature Contract</strong>  With WP e-signature’s WP Forms Electronic Signature Add-On, you are able to input submitted form information into a legal contract that is activated immediately as soon as a client submits a WP Form.</p>\n<p><strong>Redirect a User to a Electronic Signature Contract after Submitting a WP Form</strong>  After a user successfully submits a WP Form they can be immediately be rerouted to the contract of your choosing by using this E Signature add-on.</p>\n<p><strong>Sends your Client a Contract Via Email Once they Complete a WP Form</strong> After correctly submitting the WP Form, there is the option to email the form submitter a contract (or perhaps a different customer if the additional customer&#8217;s email and name was in the recently completed WP form).</p>\n<p><strong>Signing Reminder Emails triggered by your Contact Form</strong> In the event that a customer has not yet electrically signed the contract which you were requesting them to sign after sending in your WP form, it is possible to instantly trigger signing reminder emails where you can choose the trigger date, the frequency of reminder emails, and the expiration date of the signing reminder emails.</p>\n<p>=<strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">Try a Free WP Forms Signature Demo</a></strong>=</p>\n<h4>e-signature WordPress Contract Plugin Features</h4>\n<p>Whether you&#8217;re operating a wedding photography business a membership based website, or a just a small web design agency in need of clients signing your website terms of service WP Digital e-signature has you covered. You can read all about ‘WP Digital e-signature’ features on the <a href=\"https://www.approveme.com/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">ApproveMe website</a>.</p>\n<h4>UETA/ESIGN Compliance &amp; WPForms</h4>\n<p>Our plugin is 100% compliant and kept up to date with the most current rules and regulations regarding electronic signatures and legally binding contracts.  Rest easy knowing that your documents will stand up in any court.*</p>\n<h4>Encrypted Data Storage</h4>\n<p>Rather than storing data on a vulnerable FTP server like other wordpress signature plugins, we encrypt and store your data in strategic (and different) locations in your database.  Signatures, custom input fields, document data, audit trail events — everything is secured.</p>\n<p>If someone were to even attempt to unencrypt your data, the entire document would terminate.  We pride ourselves in security and invest heavily (certainly more so than any other WordPress plugin) to protect our users and their clients.</p>\n<h4>Unique Signer Invitations</h4>\n<p>Signed PDF documents are only available for download when 1) the document sender is logged in and 2) when the signer uses their unique signer invitation URL.  This prevents any unauthorized person from viewing or downloading a copy of your contract.</p>\n<h4>Responsive Design</h4>\n<p>Let your clients sign on the go.  Our customizable WordPress contract plugin operates on every leading desktop and mobile browser for Android &amp; iOS devices including Chrome, FireFox, Opera, and Safari.</p>\n<h4>Instant Trigger Contracts</h4>\n<p>We make it easy to move your clients down the funnel.  In addition to sending contracts via email, now you can redirect a signer immediately to your contract after submitting their data in a WP Form.  This helps prevent any distraction to make sure your contract gets taken care of right away.</p>\n<h4>Dynamic Form Fields</h4>\n<p>Automatically include user information submitted through your WP form into your contract, even when using more complex forms.</p>\n<h4>Signing Reminder Emails for WordPress Signature</h4>\n<p>If your client has not yet signed, send automatic reminder emails to make sure they do.  Choose the trigger date, frequency, and expiration dates to make sure your contracts get signed.</p>\n<h4>Zero Monthly Fees Per User + Unlimited Users</h4>\n<p>Let everyone on your team use the plugin, and create as many contracts as you want.  No limits or hidden fees, ever.</p>\n<p><strong>Secure your contracts and rest easy.  <a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">click here for a demo</a></strong></p>\n<h3>Need Customer Support for ApproveMe’s WP ESign?</h3>\n<p>In an effort to provide better service and to prevent support tickets getting lost in the black hole of the internet, we aim to supply top notch support services through our website.</p>\n<p><strong>There is no support offered on the wordpress.org forum.</strong></p>\n<p>Log into your account to start a support ticket <a href=\"https://www.approveme.com/support/\" rel=\"nofollow ugc\">www.approveme.com/support</a> and we will immediately help solve any problems you may have.</p>\n<p>Do you have a non-support related question about ApproveMe’s WP e-signature?  Please feel free to contact us with with any pre-sale questions at our <a href=\"https://www.approveme.com/letschat/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">contact form page</a>.</p>\n<p>Here’s a resource we created to help you understand the importance of contract security:</p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p>To see WP Forms to WP e-signature in action see the demo video below:<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ih0C9W4ql0I?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">Try WP Forms + WP e-signature Demo Here</a></strong></p>\n<h3>Additional Info</h3>\n<h3>Additional important PDF capabilities and workflows for WP Forms Signature Add-On</h3>\n<ul>\n<li>Fully automate the signature collection procedure for your individual or small company</li>\n<li>Download a copy of the signed document from your website as a PDF</li>\n<li>Sync your Dropbox account with a Signed PDF </li>\n<li>Email yourself and the signer a copy of the PDF which is UETA/ESIGN compliant</li>\n</ul>\n<p><strong>Your own WordPress website stores and encrypts all documents (not a random third party site)</strong></p>\n<p>Find out more details about document security of the WP e-signature here: <a href=\"http://aprv.me/2lf4HbX\" rel=\"nofollow ugc\">Security UETA/ESIGN Protection</a></p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p><em>An active WP e-signature license is necessary for the WP Forms Signature plugin to function. To get yours, you can simply buy a copy at (www.approveme.com)</em></p>\n<p><strong>Zero Monthly Expenses • UETA &amp; ESIGN Compliant • Legally Binding • 100% Money Back Guarantee</strong></p>\n<h3>WORDPRESS CONTRACT PLUGIN INSTALLATION COMPLETE!</h3>\n<p>Every signed document could be saved as a PDF, placed in an email, instantly synced to a Dropbox account and much more! You choose exactly how you want it to work!</p>\n<p>*An up  &hellip;</p>\n",
        "installation": "<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ih0C9W4ql0I?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>How WPForms Digital Signature Pad Add-On by WP e-signature Works:</h3>\n<p><em>The plugin for WPForms is very simple to setup. With an active ApproveMe license, you can instantly produce a legally binding (court accepted) contract utilizing completed WP Forms data and require your WP Forms submitter to add their signature on your WWP E-Signature generated contract.</em></p>\n<p>This plugin is amazing for Freelancers, Web Designers, Photographers and Small Business owners who want to simplify their contract generation process.</p>\n<h3>Get started by following these simple WP Forms WordPress E-Signature Plugin setup steps</h3>\n<p><strong>Step 1:</strong><br />\nApproveMe&#8217;s WP E Signature requires a few more plugins/add-ons to help you release the full power and automate WP Forms as well as Digital Signatures that are legally binding. The following plugins are required:</p>\n<ol>\n<li><a href=\"https://wordpress.org/plugins/wpforms-lite/\" rel=\"ugc\">WPForms Lite</a></li>\n<li><a href=\"http://aprv.me/2lIyMBx\" rel=\"nofollow ugc\">WP E Signature</a> (Elite Or Lifetime license)</li>\n<li><a href=\"https://www.approveme.com/wpesign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">e-signature Add-ons Pack</a> (comes with your license above)</li>\n<li>[Signature Add-On by ApproveMe](this plugin)</li>\n</ol>\n<p>*A Elite Or Lifetime license is required and can be purchased at <a href=\"https://www.approveme.com/wpforms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">www.approveme.com</a></p>\n<p><strong>Step 2:</strong><br />\n<em>Input your ApproveMe license</em><br />\nAfter you’ve purchased a license from ApproveMe, you must input your new license key to launch upgrades and access technical support.</p>\n<p>Log into your account to download your license key <a href=\"http://aprv.me/2leZLUs\" rel=\"nofollow ugc\">ApproveMe account</a> here (your password is included in the receipt emailed to you)</p>\n<p><strong>Step 3:</strong><br />\n<em>Set up a blank WordPress page</em><br />\nOnce the WP e-signature plugins and add-ons have been installed and your configurations are saved, you must set up a blank WordPress webpage for every Stand Alone Document (or contract) you will be producing/sending to your form submitters.</p>\n<p>Discover more about Stand Alone Documents by visiting this <a href=\"https://wpe.approveme.com/article/156-basic-document-vs-stand-alone-document?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">helpful article</a></p>\n<p><strong>Step 4:</strong><br />\n<em>Set up a Stand Alone Document</em><br />\nUsing your new blank WordPress page, you will then need to produce a Stand Alone Document and then connect the WordPress page to our Stand Alone Document.</p>\n<p>Find out more about Stand Alone Documents by visiting <a href=\"https://wpe.approveme.com/article/137-stand-alone-documents-add-on?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">documentation page</a> for this add-on.</p>\n<p><strong>Step 5:</strong><br />\n<em>(optional) Input WPForms User Details into a Contract</em></p>\n<p>This step will be different depending on the desired outcome you want. Approve Me&#8217;s Digital Signature is triggered once a WP Form is submitted. This add-on gives you the power to incorporate WP Form user info (which was inputted from the customer once the form was submitted) into a brand new contract form which will either be emailed to the customer or shown to the customer after they submit the form.</p>\n<p><strong>How to use WP Forms to add form fields details into a contract</strong></p>\n<p>Go to the Signer Input Fields/Custom Fields symbol and choose &#8220;WP Form Data&#8221;.</p>\n<p>Choose the WP Form that you’ve already made (and want to link with your contract form) using the drop down option list.</p>\n<p>Pick the field info you want to include in your new contract.</p>\n<p>A shortcode is created using this data. Don’t worry — your customer will only see the real field value when signing your contract.</p>\n<p>This is an example of the auto-generated shortcode which will get placed in the document you are producing when you select your desired field value from your WP Form.</p>\n<p>[esig wpformid=&#8221;3&#8243; field_id=&#8221;1&#8243; ]</p>\n<p>You can easily transfer the shortcode to any place in your contract form.  It will show the customer’s provided info anywhere the shortcode is found.</p>\n<p><strong>Step 6:</strong><br />\n<em>Select your document preferences and save settings</em></p>\n<p>When you have inserted all of your required contract text and have linked your preferred WP Forms field data to your Stand Alone Document, you’re ready to choose your document settings.</p>\n<p>Note: Before you can post your contract form, you also have to link your Stand Alone Document with the blank WordPress webpage you made previously for your contract. Do this by looking for and choosing the webpage from the &#8220;Display on this page&#8221; drop down option list found under the &#8220;Document Options&#8221; area. We decided NOT to include this page in your nav menu since it will be connected to a WP Form and will not work properly unless it has the field values of that submitted WP Form.</p>\n<p><strong>Step 7:</strong><br />\n<em>Almost there… (halfway done)</em><br />\nOnce you&#8217;ve published your Stand Alone Document, you’re halfway done. In the next step you have to pick your &#8220;trigger&#8221; and &#8220;action&#8221; selections for this document in WP Forms.</p>\n<p>Select LET&#8217;S GO NOW! to establish those final WP Forms preferences.</p>\n<p><strong>Step 8:</strong><br />\n<em>Finalize creating the WP Form workflow/trigger</em></p>\n<p>We’re coming to the end!  Now all you need to do is select your contract and your preferred actions once the workflow is activated.</p>\n<p>Go to the “Forms&#8221; tab located in the WordPress control panel.</p>\n<p>Select the form you attached to the Stand Alone Document.</p>\n<p>Choose the &#8220;e-signature&#8221; choice within the contact form options and specify the remaining options.</p>\n<p>Now You&#8217;re done!</p>\n<p>To see a live demo of the WP Forms to WP e-signature by visiting:<br />\n<a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">Try WP Forms + WP e-signature Demo Here</a></p>\n",
        "faq": "\n<dt id='can%20i%20collect%20legally%20binding%20court%20recognized%20digital%20signature%20from%20my%20wordpress%20website%20when%20someone%20submits%20a%20wordpress%20form%3F'>\nCan I collect legally binding court recognized Digital Signature from my WordPress website when someone submits a WordPress Form?\n</h4>\n<p>\n<p>With the WP Forms Digital Signature Add-on by ApproveMe, along with a <a href=\"https://www.approveme.com/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">WP e-signature</a> license you can easily collect <a href=\"https://www.approveme.com/ueta-and-esign-act?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">UETA/ESIGN compliant</a> signatures from your visitors or website customers after they submit a WP Form on your website.</p>\n<p><strong>You can even pass details from the submitted WP Form into your document using this WordPress contract plugin.</strong></p>\n</p>\n<dt id='are%20digital%20signature%20and%20e-signature%20legal%3F'>\nAre Digital Signature and e-signature Legal?\n</h4>\n<p>\n<p>Yes, electronic digital signatures are legally binding in the United States and many countries around the world.  <strong>United States</strong> in the US there are two digital signature Acts that established the legality of digital signatures in the US – the <a href=\"https://en.wikipedia.org/wiki/Electronic_Signatures_in_Global_and_National_Commerce_Act\" rel=\"nofollow ugc\">Electronic Signatures in Global and National Commerce Act</a> (ESIGN, 2000) and the <a href=\"https://en.wikipedia.org/wiki/Uniform_Electronic_Transactions_Act\" rel=\"nofollow ugc\">Uniform Electronic Transactions Act</a> (UETA, 1999). Both the ESIGN and UETA establish that electronic records and signatures carry the same weight and legal effect as traditional paper documents and handwritten signatures, they say “A document or signature cannot be denied legal effect or enforceability solely because it is in electronic form.” <em>The ApproveMe WP E-Signature plugin is UETA/ESIGN compliant.</em></p>\n<p><strong>United Kingdom</strong><br />\nIn the UK, similar legislation to the ESIGN Act in the USA was likewise settled in 2000, and is known as the UK Electronic Communication Act.</p>\n<p><strong>European Union</strong><br />\nThe appropriation of the European Directive 1999/93/EC of 13 December 1999 established a the utilization of electronic marks on electronic and digital contracts inside of the European Union (EU). Thirty European nations (EU-27, Croatia, Turkey and Liechtenstein) have officially adopted Directive 1999/93/EC. To that end Electronic and Digital marks are effectively being used in Europe, and <strong>ApproveMe’s compliant WP E-Signature plugin is legitimately acceptable and enforceable within the European Union when it is properly configured.</strong>  One of the best ways to ensure your document is EU compliant is to utilize our “Send Custom Contract Invitation via Email” feature.  So when a user submits your WordPress Form they will be emailed a custom email invitation to sign their unique contract.</p>\n</p>\n<dt id='will%20i%20need%20to%20renew%20my%20approveme%20wp%20e-signature%20license%3F'>\nWill I Need to Renew my ApproveMe WP E-Signature License?\n</h4>\n<p>\n<p>Yes you will. Each license key is valid for one calendar year from the purchase date. An active license key is needed for access to automatic/critical updates, plugin support and access to our growing <a href=\"https://www.approveme.com/wpesign-features/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">e-signature add-on library</a>.</p>\n</p>\n<dt id='where%20can%20i%20find%20my%20approveme%20wp%20esign%20license%20key%3F'>\nWhere Can I Find My ApproveMe WP esign License Key?\n</h4>\n<p>\n<p>If you’ve already purchased a license key and need to retrieve the license number, you can do that on the <a href=\"https://www.approveme.com/profile/\" rel=\"nofollow ugc\">support site here</a> or follow <a href=\"https://wpe.approveme.com/article/141-install-and-activate-plugins-extensions?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">these detailed steps</a>. Once you’ve successfully logged into the support site (using the credentials emailed to you at the time of purchase), your active license key(s) will be listed at the bottom of the page.</p>\n</p>\n<dt id='what%20do%20i%20get%20with%20my%20approveme%20wordpress%20signature%20license'>\nWhat do I get with my ApproveMe WordPress Signature license\n</h4>\n<p>\n<p>Your license grants you access to all of our support resources, documentation, product downloads and basic and advanced add-ons like Stand Alone Documents, Document Templates, Unlimited Sender Roles and others, (which are required for this WP Forms WP E-Signature Plugin) for one calendar year from your purchase date.</p>\n<p><a href=\"https://www.approveme.com/wpforms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">You can get an elite license here</a></p>\n</p>\n<dt id='how%20much%20does%20it%20cost%20to%20renew%20my%20license%3F'>\nHow much does it cost to renew my license?\n</h4>\n<p>\n<p>The Lifetime Plan does not have a renewal cost.  It is a one-time payment for the WP e-signature plugin.  However all other plans have an annual renewal.  Our goal has always been to pull the price back as much as we possibly can so small businesses and freelancers could sign documents electronically using their WordPress website (and save alot of money in the process). Not only is our WordPress signature plugin the most powerful of its kind, it’s also the most affordable.  Not to throw anyone under the bus, but look at what our competitors charge every single year:</p>\n<p>Adobe charges $1,080 / yr (per 3 users)<br />\nDocusign charges $1,440 / yr (per 3 users)</p>\n<p>Not charing for renewals would actually hurt the product as we would not be able to invest as heavily as we currently do back into it&#8230;</p>\n</p>\n<dt id='what%20do%20i%20get%20for%20renewing%20my%20license%3F'>\nWhat do I get for renewing my license?\n</h4>\n<p>\n<p>Renewing your license provides an additional year of support and software updates. This provides peace of mind knowing you can turn to us for WP Electronic Signature related support and assistance. You’ll also continue receiving software updates to ensure WordPress compatibility (and security) as well as great new features and enhancements! Also (depending on your license) as we release new basic and premium add-ons you will be able download these at anytime.</p>\n</p>\n<dt id='where%20do%20i%20go%20for%20help%20on%20additional%20pre-sale%20questions%3F'>\nWhere do I go for help on additional pre-sale questions?\n</h4>\n<p>\n<p>Please feel free to contact us at anytime with any additional questions you might have at our <a href=\"https://www.approveme.com/letschat/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">contact form page</a>.</p>\n</p>\n\n",
        "changelog": "<p>Version 1.8.1<br />\nFIX: Some minor bugs</p>\n<p>Version 1.8.0<br />\nADDED : PHP 8.2 compatibility<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.9<br />\nADDED: Php 8.1 support<br />\nFIX: Private pages missing from form settings document dropdown<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.8<br />\nFIX: Signer name field issue<br />\nFIX: Some minor issues</p>\n<p>Version 1.7.7<br />\nFIX: Select field issue<br />\nFIX: Some minor issues</p>\n<p>Version 1.7.6<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.4<br />\nFIX: Iframe issue<br />\nFIX: Cache display issue<br />\nFIX: Other form data display issue<br />\nFIX: Some minor bugs</p>\n<p>Version 1.7.0<br />\nFIX: Display underline issue</p>\n<p>Version 1.6.9<br />\nFIX: Some minor bugs.</p>\n<p>Version 1.6.8<br />\nADDED : Rating widget<br />\nFIX: Some minor bugs.</p>\n<p>Version 1.6.7<br />\nADDED : Plugin name changed<br />\nFIX: Some minor bugs.</p>\n<p>Version 1.6.6<br />\nADDED : New license information added.</p>\n<p>Version 1.6.5<br />\nFIX: Field value display underline issue</p>\n<p>Version 1.6.4<br />\nADDED : WPForms all fields shortcodes insert option</p>\n<p>Version 1.6.2<br />\nFIX: Some minor bugs.</p>\n<p>Version 1.5.7.5<br />\nFIX: Blank reminder settings issue<br />\nFIX: WP Rocket plugin conflict<br />\nFIX: Some other minor bugs.</p>\n<p>Version 1.5.7.0 &#8211; February 02, 2021<br />\nFIX : Two e-signature screens for the WP Forms add-on<br />\nFIX: WPform core plugin plugin notice display issue</p>\n<p>Version 1.5.6.9 &#8211; February 01, 2021<br />\nADDED : New landing page added after activating plugin</p>\n<p>Version 1.5.6.5 &#8211; November 10, 2020<br />\nFIX: Warning message display on &#8220;View&#8221; page<br />\nFIX: Submission missing in wpform agreement.<br />\nFIX: Some minor bugs.</p>\n<p>Version 1.5.6.0 &#8211; September 1, 2020<br />\nFIX:  Icon display issue.<br />\nFIX : Agreement title display issue<br />\nFIX : some minor bugs</p>\n<p>Version 1.5.5.8 &#8211; June 2, 2020<br />\nADDED: Support snippet in about page.</p>\n<p>Version 1.5.5.3 &#8211; January 14, 2020<br />\nFIX: some minor bugs.<br />\nFIX: tb popup display issue.</p>\n<p>Version 1.5.3.8 &#8211; August 29, 2018<br />\nFIX: Notice message display on signing document when we add a field<br />\nFIX: Displaying incorrect label name for &#8220;Section Divider&#8221; &amp; &#8220;Hiddden&#8221; Field when we insert wpform int oa stand alone document.<br />\nFIX: Address label name issue fixed</p>\n<p>Version 1.5.3.6 &#8211; June 25, 2018<br />\nFIX: Demo video Showing incorrect content for WP Forms Signature Contract</p>\n<p>Version 1.5.3.4 &#8211; April 19, 2018<br />\nADDED: Checkmark for all form integration<br />\nADDED: Multiple field value adding into document title</p>\n<p>Version 1.5.2.0 &#8211; October 9, 2017<br />\nFIX: Display type issue has bee fixed<br />\nFIX: Dropdown label value display issue fixed<br />\nADDED: WPForms Pre-Check added when creating new document</p>\n<p>Version 1.5.1 &#8211; August 10, 2017<br />\nFIX: Need to store data in e-signature with form integration<br />\nFIX: Display incomplete &#8220;State&#8221; name with address field<br />\nFIX: &#8220;Checkbox Field&#8221; is not working<br />\nFIX: Notice message display after submit form<br />\nFIX: Html tag striped from document title replae with field</p>\n<p>March 7, 2017 &#8211; Version 1.5.0<br />\nIMPROVEMENT: Updated About/Getting Started Page<br />\nFIX: Getting Error Signer Invite Emails not sent messages when using form<br />\nADDED: add multiple agreement support</p>\n<p>December 28, 2016 &#8211; Live version released on WordPress.org</p>\n"
    },
    "short_description": "Instantly produce a legally binding PDF WordPress contract from a WP Forms contact form submission. Digital Signature Pad. Proposal.",
    "description": "<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">Try WPForms Signature Demo Here</a></strong></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ih0C9W4ql0I?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><em>Please note you will need the following plugins installed to completely automate the process of collection of contracts using WP Forms and WP e-signature.</em><br />\n1. <a href=\"https://wordpress.org/plugins/wpforms-lite/\" rel=\"ugc\">WPForms</a><br />\n2. <a href=\"http://aprv.me/2lIyMBx\" rel=\"nofollow ugc\">WP e-signature</a> (Elite Or Lifetime license)<br />\n3. <a href=\"https://aprv.me/2lIyMBx\" rel=\"nofollow ugc\">Stand Alone Document</a> (comes with above licenses)</p>\n<p>*An Elite Or Lifetime license license is required and can be purchased at <a href=\"https://www.approveme.com/wpforms-special-pricing/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">www.approveme.com</a></p>\n<p><strong>What would you do if you discover the contracts you used in running your online business were not legally binding?</strong></p>\n<h4>WPForms Digital Signature Add-On</h4>\n<p>Imagine being in a courtroom with an estranged client who’s claiming that they never agreed to your contract.  You pull up the contract and after a brief review, the judge announces that the e-signature used in the contract was not legally valid.  He then asks if you have anything else to support your case.</p>\n<p>Hopefully it will never come to to this, but if it did, what would you do?</p>\n<p>Well, there’s not much you could do.</p>\n<p><strong>The electronic document industry has very strict rules and regulations for legal contracts, invoices, employee agreements and any other legally binding document you may use in your business.</strong></p>\n<p><strong>WP Forms is a terrific WordPress Form Plugin!</strong> It is quite possibly one of the best ways to automate any number of tasks using a WordPress website (and of course their renowned contact forms plugin). However, <em>signing legally binding contracts is NOT WPForms primary focus</em> (it is however ApproveMe’s WP e-signature sole focus). We have invested many years building a system that adheres to the strictest <a href=\"http://aprv.me/2lIEKSE\" rel=\"nofollow ugc\">UETA and ESIGN</a> nationwide and foreign document signing regulations.</p>\n<p><em>This Signature Pad Plugin fills the gap between a WordPress Form plugin and an e-signature solution that is compliant with the UETA/ESIGN guidelines.</em></p>\n<p>Digital security is crucial to your business.  You need to protect yourself from anything that could call your forms into question.</p>\n<p><strong>The ApproveMe WP E-Signature Plugin turns your WordPress site into a court recognized document signing app.</strong></p>\n<p>If you’re a WP Forms user, you know how powerful their plugin can be to help automate a number of tasks on your website.  HOWEVER, signing legally binding contracts is NOT their primary focus.  That’s where we come in.</p>\n<p>The WP Forms Digital Signature Add-On ensures that every contact form, contract, or invoice submitted with the WP Form plugin is 100% UETA/ESIGN compliant.</p>\n<p>No more second-guessing the legality of your contracts or needing to use a third-party signing service.</p>\n<p>We’ve invested years into building a system that adheres the strictest nationwide and foreign document signing regulations while allowing you to control your user experience.</p>\n<p>You get a 100% legally compliant signature on file to protect you and the customer, without having to worry about users getting distracted or being unsecure on third party sites.</p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">Click Here to Try WP Forms Signature Demo</a></strong></p>\n<p><strong>How this e-signature &amp; WordPress Contract Plugin is different than a typical WPForms WordPress signature pad addon</strong><br />\nMost signature pad plugins simply record signature details and submit the data to a web server where it is converted to a PNG or JPEG file.  This graphic file then gets saved on your FTP server.</p>\n<p>This image file of your client’s hand-written legal signature — the same one used to buy houses, sign up for credit cards, and obtain business loans — is easily accessible to any FTP intruders.</p>\n<p>Here’s the problem:</p>\n<p>Most of these plugins are not legally binding (much less UETA/ESIGN compliant) as they fail to address the countless laws and regulations that guide the document signing industry.</p>\n<p>If the legality of your contract were to ever come into question, you wouldn’t have much to stand alone.  And if fraud or identity theft were ever an issue, you would have a tough time proving your case with a signature that the courts don’t recognize.  Why risk it?</p>\n<p><strong>ApproveMe’s brand new signature add-on found at <a href=\"http://aprv.me/2lIyMBx\" rel=\"nofollow ugc\">ApproveMe.com</a> it is the connection point between a WordPress forms plugin and having a UETA / ESIGN compliant WordPress contract plugin that runs on your WordPress site.</strong></p>\n<p><strong>Check out the video clip above to find out ways to save time and money by fully automating legal contracts for your website design, digital photography, freelance or consulting business making use of our WP Forms Digital Signature Add-On.</strong></p>\n<p>=MORE ON HOW THIS UETA/ESIGN COMPLIANT WORDPRESS FORM SIGNATURE PLUGIN WORKS=</p>\n<p>**<a href=\"http://aprv.me/2lIyMBx\" rel=\"nofollow ugc\">ApproveMe’s Signature Add-On for WP Forms</a> generates a UETA/ESIGN compliant court recognized contract with (optional) details/field values inserted anywhere you want them inserted in the contract.  These dynamic field values are taken from the submitted form of your end user.</p>\n<p>Your form submitter can either draw or type their legal  signature using their mouse, trackpad, tablet or smartphone.  All of this magic happens the instant an end user submits a WP Form by either emailing a signer specific invitation to their contract or immediately redirecting the end users.**</p>\n<p>Another highly popular use case is pre-filling contract data that might change from contract to contract. Say for instance, you are a Web Design agency and you have a standard contract you send out that varies ever so slightly every time you bring on a new client. Maybe you have optional packages available that need to be noted in your contract. But creating a new contract from scratch is incredibly time consuming.</p>\n<p>With this WP Forms Signature Add-On + ApproveMe’s WP e-signature (license) you can create a WP Form with the fields and sections of the contract that vary and add an additional field for the “Signers Name” + “Signers Email.”</p>\n<p>Your WPForm would look something like:</p>\n<p>DROPDOWN FIELD 1  = Dropdown of available packages<br />\nPARAGRAPH FIELD 2 = Classes or terms that vary from contract to contract<br />\nTEXT FIELD 2 = SIGNERS FULL NAME<br />\nTEXT FIELD 3 = SIGNERS EMAIL ADDRESS</p>\n<p>You would insert these WP Field values in your WP e-signature contract in the proper places or paragraphs that pertain to this information.</p>\n<p>You would choose the option “Email this contract whenever this form is submitted.”</p>\n<p>Now, whenever you fill out this WPForm, your contract will be automatically generated with the custom terms from your WP Form submission and then a signer invitation email will be sent to the signer email address that was given in the WP Form submission.</p>\n<p><em>Additional benefits of ApproveMe’s WP eSign Plugin and this for WP Forms Signature Add-On is that you are able to instantly create a legal contract for your clients to sign depending on their form information from a WPForm.</em></p>\n<p><strong>And that’s just the beginning. When a client signs…</strong></p>\n<p><em>… both you and the client will instantly get a PDF of the contract that they signed (e-signature automation at its finest).</em></p>\n<p><em>…registering or sending your client to a third-party website to sign your legal contracts is not required (all signatures take place on your WordPress website… so the experience is on your site and not someone else’s)</em></p>\n<p><em>… you’ll have a 100% legally compliant electronic signature on file to protect you AND the customer (according to UETA/ESIGN guidelines).</em></p>\n<h3>WP Forms Digital Signature add-on and WordPress Signature turns your site &amp; WordPress Form into a court recognized document signing application (but without the monthly fees… and with unlimited amount of users).</h3>\n<ul>\n<li>Ideal for anyone who wants to automate signature collection on proposals, quotes, timesheets, service terms agreements, new client legal contracts, waiver forms and much more using a WordPress form! *</li>\n</ul>\n<p>Immediately redirect your site visitors to sign a legally binding contract after submitting a WordPress Form that was created using WP Forms.</p>\n<p>“I agree to terms” checkboxes have the legal standing of a limp handshake. <strong>Do the smart thing. Don’t get caught in a courtroom with a document that’s not legally binding.</strong></p>\n<p><strong>The Powerful Features of ApproveMe’s Digital Signature Add-On for WP Forms:</strong></p>\n<p><strong>ADDON FEATURES THAT YOU CAN CUSTOMIZE</strong><br />\nWP e-signature offers an incredibly in depth e-signature add-on collection with several easy to customize <a href=\"http://aprv.me/2lIyMBx\" rel=\"nofollow ugc\">WP Forms e-signature automations</a> and <a href=\"https://www.approveme.com/esign-integrations?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">third-party integrations</a> to even further improve your personalized document signing requirements.</p>\n<p>=The WordPress contract plugin operates on every leading PC and web browsers for smart phones. For example Chrome, FireFox, Opera, Safari, Android, iOS, and WebOS.=</p>\n<p><em>Besides being user friendly, ApproveMe’s WP Forms WordPress Signature Plugin is able to instantly enter details which was posted from a WP Form into a UETA/ESIGN compliant and courtroom accepted contract form utilizing your own WordPress website.</em></p>\n<p>Therefore if you have a dropdown list of options in your WP Form named “Web Design Package” and you provide various products (different price points for each) it is possible to easily produce a legal contract which includes the package features of an order in the written agreement which is then sent to the end-user of your WP Form.</p>\n<p><strong>Instantly Trigger Contracts To Be Sent</strong> As soon as a client inputs data into and submits a WP form (that is connected to a WP e-signature contract using this add-on) it is possible to instantly generate a Contract to be delivered either by email or by redirecting the signer to the contract immediately as the “thank you page.”</p>\n<p><strong>Connect WP Forms Digital Signature With WP e-signature</strong> This WP Forms Add-On will blend the powerful automation attributes of WP forms with the e-signature features and peace of mind offered with WP e-signature.</p>\n<p><strong>Include WP Form Field Values Inside A WP e-signature Contract</strong>  With WP e-signature’s WP Forms Electronic Signature Add-On, you are able to input submitted form information into a legal contract that is activated immediately as soon as a client submits a WP Form.</p>\n<p><strong>Redirect a User to a Electronic Signature Contract after Submitting a WP Form</strong>  After a user successfully submits a WP Form they can be immediately be rerouted to the contract of your choosing by using this E Signature add-on.</p>\n<p><strong>Sends your Client a Contract Via Email Once they Complete a WP Form</strong> After correctly submitting the WP Form, there is the option to email the form submitter a contract (or perhaps a different customer if the additional customer&#8217;s email and name was in the recently completed WP form).</p>\n<p><strong>Signing Reminder Emails triggered by your Contact Form</strong> In the event that a customer has not yet electrically signed the contract which you were requesting them to sign after sending in your WP form, it is possible to instantly trigger signing reminder emails where you can choose the trigger date, the frequency of reminder emails, and the expiration date of the signing reminder emails.</p>\n<p>=<strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">Try a Free WP Forms Signature Demo</a></strong>=</p>\n<h4>e-signature WordPress Contract Plugin Features</h4>\n<p>Whether you&#8217;re operating a wedding photography business a membership based website, or a just a small web design agency in need of clients signing your website terms of service WP Digital e-signature has you covered. You can read all about ‘WP Digital e-signature’ features on the <a href=\"https://www.approveme.com/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">ApproveMe website</a>.</p>\n<h4>UETA/ESIGN Compliance &amp; WPForms</h4>\n<p>Our plugin is 100% compliant and kept up to date with the most current rules and regulations regarding electronic signatures and legally binding contracts.  Rest easy knowing that your documents will stand up in any court.*</p>\n<h4>Encrypted Data Storage</h4>\n<p>Rather than storing data on a vulnerable FTP server like other wordpress signature plugins, we encrypt and store your data in strategic (and different) locations in your database.  Signatures, custom input fields, document data, audit trail events — everything is secured.</p>\n<p>If someone were to even attempt to unencrypt your data, the entire document would terminate.  We pride ourselves in security and invest heavily (certainly more so than any other WordPress plugin) to protect our users and their clients.</p>\n<h4>Unique Signer Invitations</h4>\n<p>Signed PDF documents are only available for download when 1) the document sender is logged in and 2) when the signer uses their unique signer invitation URL.  This prevents any unauthorized person from viewing or downloading a copy of your contract.</p>\n<h4>Responsive Design</h4>\n<p>Let your clients sign on the go.  Our customizable WordPress contract plugin operates on every leading desktop and mobile browser for Android &amp; iOS devices including Chrome, FireFox, Opera, and Safari.</p>\n<h4>Instant Trigger Contracts</h4>\n<p>We make it easy to move your clients down the funnel.  In addition to sending contracts via email, now you can redirect a signer immediately to your contract after submitting their data in a WP Form.  This helps prevent any distraction to make sure your contract gets taken care of right away.</p>\n<h4>Dynamic Form Fields</h4>\n<p>Automatically include user information submitted through your WP form into your contract, even when using more complex forms.</p>\n<h4>Signing Reminder Emails for WordPress Signature</h4>\n<p>If your client has not yet signed, send automatic reminder emails to make sure they do.  Choose the trigger date, frequency, and expiration dates to make sure your contracts get signed.</p>\n<h4>Zero Monthly Fees Per User + Unlimited Users</h4>\n<p>Let everyone on your team use the plugin, and create as many contracts as you want.  No limits or hidden fees, ever.</p>\n<p><strong>Secure your contracts and rest easy.  <a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">click here for a demo</a></strong></p>\n<h3>Need Customer Support for ApproveMe’s WP ESign?</h3>\n<p>In an effort to provide better service and to prevent support tickets getting lost in the black hole of the internet, we aim to supply top notch support services through our website.</p>\n<p><strong>There is no support offered on the wordpress.org forum.</strong></p>\n<p>Log into your account to start a support ticket <a href=\"https://www.approveme.com/support/\" rel=\"nofollow ugc\">www.approveme.com/support</a> and we will immediately help solve any problems you may have.</p>\n<p>Do you have a non-support related question about ApproveMe’s WP e-signature?  Please feel free to contact us with with any pre-sale questions at our <a href=\"https://www.approveme.com/letschat/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">contact form page</a>.</p>\n<p>Here’s a resource we created to help you understand the importance of contract security:</p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p>To see WP Forms to WP e-signature in action see the demo video below:<br />\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/ih0C9W4ql0I?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><strong><a href=\"http://www.secure.approveme.com/demo/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">Try WP Forms + WP e-signature Demo Here</a></strong></p>\n<h3>Additional Info</h3>\n<h3>Additional important PDF capabilities and workflows for WP Forms Signature Add-On</h3>\n<ul>\n<li>Fully automate the signature collection procedure for your individual or small company</li>\n<li>Download a copy of the signed document from your website as a PDF</li>\n<li>Sync your Dropbox account with a Signed PDF </li>\n<li>Email yourself and the signer a copy of the PDF which is UETA/ESIGN compliant</li>\n</ul>\n<p><strong>Your own WordPress website stores and encrypts all documents (not a random third party site)</strong></p>\n<p>Find out more details about document security of the WP e-signature here: <a href=\"http://aprv.me/2lf4HbX\" rel=\"nofollow ugc\">Security UETA/ESIGN Protection</a></p>\n<p>Free ebook:<br />\n<a href=\"https://www.approveme.com/free-ebook-digital-e-signature-is-it-legal/?utm_source=wprepo&amp;utm_medium=link&amp;utm_campaign=wpforms\" rel=\"nofollow ugc\">7 Ways to Protect Your Company from Contracts That Aren’t Binding</a></p>\n<p><em>An active WP e-signature license is necessary for the WP Forms Signature plugin to function. To get yours, you can simply buy a copy at (www.approveme.com)</em></p>\n<p><strong>Zero Monthly Expenses • UETA &amp; ESIGN Compliant • Legally Binding • 100% Money Back Guarantee</strong></p>\n<h3>WORDPRESS CONTRACT PLUGIN INSTALLATION COMPLETE!</h3>\n<p>Every signed document could be saved as a PDF, placed in an email, instantly synced to a Dropbox account and much more! You choose exactly how you want it to work!</p>\n<p>*An up  &hellip;</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.8.1.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-1.png?rev=1710534",
            "caption": "<p><strong>Add New Document:</strong> Once you’ve installed the WP e-signature, you will need to draft up a new “Stand Alone Document”</p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-2.jpg?rev=1710534",
            "caption": "<p><strong>WPForms Data</strong> If you click the Signer Input Fields icon you will see the option “WP Forms Data.” Click this to connect a WP Form to this contract.</p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-3.png?rev=1710534",
            "caption": "<p><strong>Select Your WP Forms:</strong> If you already have your WP Form created you can easily insert dynamic field data (from the WP Form that is being submitted/triggering this contract) by selecting the WP Form.</p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-4.png?rev=1710534",
            "caption": "<p><strong>Choose Your WP Forms Fields:</strong> After selecting your WP Form you will see the available field options from this particular WP Form. You can easily insert data from your WP Form anywhere in this new contract.</p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-5.png?rev=1710534",
            "caption": "<p><strong>Document Signing Options (optional):</strong> The powerful WP e-signature tool by ApproveMe features plenty of customizable options including: Signing reminder Emails, Attach PDF to emails, Dropbox Sync, Auto Register WordPress Users, and TONS more. To read all about the available add-on features (which come with the license) please see: <a href=\"http://aprv.me/2lNRp2C\">https://www.approveme.com/esign-integrations</a></p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-6.png?rev=1710534",
            "caption": "<p><strong>Connect Your Document to a Page:</strong>Once you’re satisfied with your contract, you will need to select a BLANK WordPress page to attach this document to.</p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-7.png?rev=1710534",
            "caption": "<p><strong>Click “LET’S GO NOW”:</strong>After you have published your contract, you just need to connect your Stand Alone Document to your WP Form. This is pretty straight forward. Just click the button “LET’S GO NOW!” to be redirected to the actions/trigger tab for your specific WP Form.</p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-8.png?rev=1710534",
            "caption": "<p><strong>Define Your Signing Logic:</strong> This is the page (inside of WP Forms) that needs to be customized. Please choose the Signer’s Full Name and the Signer’s Email address along with any other additional e-signature settings you’d like to include with your contract.</p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-9.png?rev=1710534",
            "caption": "<p><strong>User Submits a WP Forms</strong> Once a user submits the WP Form that you connected to your WP e-signature contract, they will either be immediately redirected to the contract or emailed an unique invitation to sign their contract.  All submitted details from WP Forms will be included.</p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-10.png?rev=1710534",
            "caption": "<p><strong>Review &amp; eSign:</strong> Your users will review the contract before finalizing the contract with their signature.</p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-11.png?rev=1710534",
            "caption": "<p><strong>Select a Digital Signature:</strong>Signers can choose a typed or digital signature</p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-12.png?rev=1710534",
            "caption": "<p><strong>Agree &amp; eSign:</strong> With their e-signature, the customers agree to the terms of the document.</p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-13.png?rev=1710534",
            "caption": "<p><strong>View Signed Document Email:</strong>Signers will be sent an email that includes the link to the document (and a PDF version of the contract if you opted for this method).</p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-14.png?rev=1710534",
            "caption": "<p><strong>Save as PDF:</strong>Customers can either view, print or download their signed document from the website. To do this, they need to click “View Signed Document” in the email that was sent to them upon signing. (With the “Attach as PDF” add-on installed, you can also automatically include the signed contract as a PDF attachment in this email.)</p>"
        },
        {
            "src": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/screenshot-15.png?rev=1710534",
            "caption": "<p><strong>WordPress Audit Trail e-signature Certificate:</strong>  Proving signer intent is a very important component to signing electronic documents. Every contract that is signed using WP e-signature includes a detailed Signature Certificate. You can <a href=\"http://aprv.me/2kveV3E\">read all about the security of this report here</a>.</p>"
        }
    ],
    "tags": {
        "contract": "contract",
        "proposal": "proposal",
        "wp-form": "wp form",
        "wp-forms": "WP Forms",
        "wpforms": "WPForms"
    },
    "stable_tag": "1.8.1",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.0.0.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.1.zip",
        "1.5.2.0": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.2.0.zip",
        "1.5.3.4": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.3.4.zip",
        "1.5.3.6": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.3.6.zip",
        "1.5.3.8": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.3.8.zip",
        "1.5.4.5": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.4.5.zip",
        "1.5.4.9": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.4.9.zip",
        "1.5.5.3": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.5.3.zip",
        "1.5.5.8": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.5.8.zip",
        "1.5.6.0": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.6.0.zip",
        "1.5.6.5": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.6.5.zip",
        "1.5.6.9": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.6.9.zip",
        "1.5.6.9.1": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.6.9.1.zip",
        "1.5.7.0": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.7.0.zip",
        "1.5.7.5": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.5.7.5.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.6.2.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.6.5.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.6.6.zip",
        "1.6.7": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.6.7.zip",
        "1.6.8": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.6.8.zip",
        "1.6.9": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.6.9.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.7.0.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.7.4.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.7.6.zip",
        "1.7.7": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.7.7.zip",
        "1.7.8": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.7.8.zip",
        "1.7.9": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.7.9.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.8.0.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.1.8.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wp-forms-signature-contract-add-on.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/banner-772x250.png?rev=1571411",
        "high": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/banner-1544x500.png?rev=1571411"
    },
    "icons": {
        "1x": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/icon-128x128.png?rev=1571411",
        "2x": "https://ps.w.org/wp-forms-signature-contract-add-on/assets/icon-256x256.png?rev=1571411"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 88,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}