{
    "name": "WP Supersized",
    "slug": "wp-supersized",
    "version": "3.1.6",
    "author": "Benoit De Boeck",
    "author_profile": "https://profiles.wordpress.org/worldinmyeyes/",
    "contributors": {
        "worldinmyeyes": {
            "profile": "https://profiles.wordpress.org/worldinmyeyes/",
            "avatar": "https://secure.gravatar.com/avatar/c54bf2985bff4f5355ba7e22cc37e503?s=96&d=monsterid&r=g",
            "display_name": "Benoit De Boeck"
        }
    },
    "requires": "3.1",
    "tested": "3.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 82,
    "ratings": {
        "5": 17,
        "4": 3,
        "3": 0,
        "2": 0,
        "1": 5
    },
    "num_ratings": 25,
    "support_url": "https://wordpress.org/support/plugin/wp-supersized/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 1000,
    "downloaded": 91377,
    "last_updated": "2013-08-24 16:14:00",
    "added": "2011-07-02",
    "homepage": "http://www.worldinmyeyes.be/2265/wp-supersized-wordpress-plugin/",
    "sections": {
        "description": "<p>WP Supersized allows you to display a resizable full screen background slideshow on pages/posts of your choice.<br />\nAfter activation you will find a new WP Supersized section in your Settings where you can manage the plugin options.<br />\nA WP Supersized panel will also be available in the post/page editor to select the source of images used by the plugin individually for the current post/page.</p>\n<p><em>Users may use images from NextGEN Gallery, the WordPress Media Gallery, Flickr, Picasa, Smugmug, their own choice of directory within the wp-content folder, or a list of slides defined in an xml file (for advanded users).</em></p>\n<p>WP Supersized integrates the Supersized jquery extension in the pages/posts of your choice. I am not the developer of the original Supersized jquery extension itself, <a href=\"http://buildinternet.com/project/supersized/\" title=\"Supersized webpage\" rel=\"nofollow ugc\">Supersized</a> was written by <a href=\"http://vivalasam.com/\" title=\"Sam Dunn\" rel=\"nofollow ugc\">Sam Dunn</a>. My plugin only integrates it into your theme and gives you easy access to many options for displaying this resizeable slideshow background where you want on your website or blog.</p>\n<p>So, what exactly does WP Supersized do?</p>\n<ul>\n<li>Cycles Images/backgrounds via slideshow with transitions and preloading (use it as background or as slideshow)</li>\n<li>Resizes images to fill browser while maintaining image dimension ratio</li>\n<li>Navigation controls with keyboard support</li>\n<li>Integration with NextGEN Gallery and with the WordPress Media Gallery &#8211; choose images from NextGEN galleries or attached to post/page</li>\n<li>Integration with Flickr &#8211; pull photos by user, set, tag, or group</li>\n<li>Integration with Picasa &#8211; pull photos by album, user,or tag</li>\n<li>Integration with Smugmug &#8211; pull photos by keyword, user, gallery, category</li>\n<li>Accepts jpg, gif, and png images</li>\n<li>Simple selection of your images source for each page/post separately (also options for advanced users, using an XML file)</li>\n<li>HTML and links can be used within the images captions (when using WP Media Gallery, NextGEN Gallery, or an XML file as source of images).</li>\n</ul>\n<p>You can see an example of Supersized in use in a WordPress page on the <a href=\"http://www.worldinmyeyes.be/2265/\" title=\"WP Supersized page\" rel=\"nofollow ugc\">WP Supersized page</a> or on my <a href=\"http://www.worldinmyeyes.be/about-2/\" title=\"About page\" rel=\"nofollow ugc\">About page</a>.<br />\nFor more details about Supersized itself and its development, check <a href=\"http://www.buildinternet.com/project/supersized/\" title=\"the Supersized website\" rel=\"nofollow ugc\">Supersized</a>.</p>\n<p>WP Supersized allows you to display Supersized on the pages/posts that you want in your current theme. Many options are available to choose where and how it will be displayed.</p>\n<h4>Options</h4>\n<p>There is a number of available options, shown below with their default values. <em>Not every option is functional in the Single image mode</em>.<br />\nWP Supersized also adds an additional option tab in the page/post editor for easy selection of the source of images for each post/page individually. A source selected on an individual page/post will override the general options choice. When no value has been set for these options yet, they use the general options.</p>\n<p><em>Functionality</em></p>\n<ul>\n<li><em>Type of background</em></li>\n</ul>\n<p>Determines which type of slideshow will be used.</p>\n<p>Slideshow: The images that you have uploaded to your <code>/wp-content/supersized-slides/</code> directory or the ones attached to the post/page through the WordPress Media Gallery (have a look at the FAQ to find out how this works) will be shown.</p>\n<p>Single image: A single image will be used (the first one found in the slides folder if you have more than one). Slideshow controls will not appear in this mode.</p>\n<p>Flickr images: Images will be pulled from Flickr (by user, set, group, or tags see the Flickr options below). If you choose this, please be aware that not all Components options and none of the Supersized Shutter theme specific options will be available with the current version of Supersized.</p>\n<ul>\n<li><em>Autoplay on/off</em></li>\n</ul>\n<p>Determines whether the slideshow begins playing automatically when the page is loaded.</p>\n<ul>\n<li><em>Start on slide #</em></li>\n</ul>\n<p>The slide the slideshow starts on (default is 1). Slides are sorted in alphabetical order of their filename.<br />\nIn the Single image mode, it controls which image is loaded, 0 causes a random image to be loaded each time (assuming that you have several images in the <code>/wp-content/supersized-slides/</code> directory).</p>\n<ul>\n<li><em>Random slides</em></li>\n</ul>\n<p>When on, slides are shown in a random order and the starting slide number will be disregarded. Default is off.</p>\n<ul>\n<li><em>Slide interval</em></li>\n</ul>\n<p>Time between slide changes in milliseconds. The default is 3 seconds.</p>\n<ul>\n<li><em>Transition</em></li>\n</ul>\n<p>Controls which effect is used to transition between slides. Options are as follows:</p>\n<pre><code>No transition effect\nFade effect (Default)\nSlide in from top\nSlide in from right\nSlide in from bottom\nSlide in from left\nCarousel from right to left\nCarousel from left to right\n</code></pre>\n<ul>\n<li><em>Speed of transition</em></li>\n</ul>\n<p>The time transitions take in milliseconds (default is 500 milliseconds).</p>\n<ul>\n<li><em>New window</em></li>\n</ul>\n<p>Whether or not slide links open in a new window (default is on).</p>\n<ul>\n<li><em>Pause on hover</em></li>\n</ul>\n<p>Pauses the slideshow when the current image is hovered over. If navigation is enabled, the pause button will become active to show paused state. Disabled by default.</p>\n<ul>\n<li><em>Stop loop</em></li>\n</ul>\n<p>Pauses the slideshow upon reaching the last slide (default is off).</p>\n<ul>\n<li><em>Keyboard navigation</em></li>\n</ul>\n<p>Keyboard navigation (default is on).<br />\nSpacebar pauses, Up/Right go to next slide, and Down/Left go to previous slide.</p>\n<ul>\n<li><em>Performance</em></li>\n</ul>\n<p>Uses image rendering options in Firefox and Internet Explorer to adjust image quality. This can speed up/slow down transitions. Webkit does not yet support these options.</p>\n<pre><code>Normal - No adjustments\nHybrid Speed/Quality - Lowers image quality during transitions and restores after completed (Default)\nOptimizes image quality\nOptimizes transition speed - Faster transition speed, lower image quality\n</code></pre>\n<ul>\n<li><em>Image protection</em></li>\n</ul>\n<p>Disables right clicking and image dragging using Javascript (default is off).</p>\n<ul>\n<li><em>Background URL</em></li>\n</ul>\n<p>Type here the URL of the link you want to access when clicking on the background image (www.example.com). The same link will be used for all images. Leave this field empty if your do not want any link to be used. Default is empty.</p>\n<p><em>Display</em></p>\n<ul>\n<li><em>Select the page(s) where Supersized should be used</em></li>\n</ul>\n<p>Choose where you want to apply Supersized. These are the most general options. More precise selections are possible below.</p>\n<pre><code>Everywhere (except admin pages)\nAll pages (except homepage)\nHomepage (of your blog)\nFront page (landing page)\nError page (404)\nSearch results page\nAll posts (not pages)\nSticky post\nCategory archive\nTag archive\nDate archive\nAny archive\n</code></pre>\n<p>From version 2.0, the option <code>Only on posts/pages with custom field SupersizedDir</code> has been removed. Any page/post that has an image source other than <code>none</code> will display Supersized.<br />\nIf you select All posts, All pages, or Everywhere, posts/pages with an image source other than <code>none</code> will show images from the corresponding folder while all others will show the default directory images.<br />\nIn each of these options, unless a specific image source was defined in the page/post, the default slides directory will be used.</p>\n<ul>\n<li><em>Select the page template(s) where Supersized should be used</em></li>\n</ul>\n<p>This option lists all available custom templates in the current theme. You may select one or several of them.<br />\nThe list is empty if your current theme does not use any custom template.<br />\nPlease reset the options when you change theme to make sure that the list is updated.</p>\n<ul>\n<li><em>Post ID where Supersized will be used</em></li>\n</ul>\n<p>Type here a comma-separated list of the post IDs where you want Supersized to appear.<br />\nDon&#8217;t forget to deselect <code>All posts</code> or <code>Sticky post</code> above.<br />\nYou can find your post IDs in the Posts admin menu by hovering on the name of the post. The ID will be displayed at the bottom of your browser. Alternatively, you can use the <a href=\"https://wordpress.org/extend/plugins/wp-show-ids/\" title=\"WP Show IDs ( simple, yet elegant )\" rel=\"ugc\">WP Show IDs</a> plugin.</p>\n<ul>\n<li><em>Page ID where Supersized will be used</em></li>\n</ul>\n<p>Type here a comma-separated list of the page IDs where you want Supersized to appear.<br />\nDon&#8217;t forget to deselect <code>All pages</code>, <code>Homepage</code>, <code>Front page</code>, or <code>Error page</code> above.<br />\nYou can find your page IDs in the Pages admin menu by hovering on the name of the page. The ID will be displayed at the bottom of your browser. Alternatively, you can use the <a href=\"https://wordpress.org/extend/plugins/wp-show-ids/\" title=\"WP Show IDs ( simple, yet elegant )\" rel=\"ugc\">WP Show IDs</a> plugin.</p>\n<ul>\n<li><em>Category ID for the posts/pages where Supersized will be used</em></li>\n</ul>\n<p>Type here a comma-separated list of the category IDs where you want Supersized to appear.<br />\nYou can find your Category IDs in the Posts &gt; Categories admin menu by hovering on the name of the category. The ID will be displayed at the bottom of your browser. Alternatively, you can use the <a href=\"https://wordpress.org/extend/plugins/wp-show-ids/\" title=\"WP Show IDs ( simple, yet elegant )\" rel=\"ugc\">WP Show IDs</a> plugin.</p>\n<ul>\n<li><em>Tag ID for the posts/pages where Supersized will be used</em></li>\n</ul>\n<p>Type here a comma-separated list of the tag IDs where you want Supersized to appear.<br />\nYou can find your Tag IDs in the Posts &gt; Post Tags admin menu by hovering on the name of the tag. The ID will be displayed at the bottom of your browser. Alternatively, you can use the <a href=\"https://wordpress.org/extend/plugins/wp-show-ids/\" title=\"WP Show IDs ( simple, yet elegant )\" rel=\"ugc\">WP Show IDs</a> plugin.</p>\n<p><em>Slides source</em></p>\n<ul>\n<li><em>Default slides directory</em></li>\n</ul>\n<p>Select here the slides directory that will be used by default (default is supersized-slides if it exists). Only folders are shown by the selector. Some folders such as <code>plugins</code>, <code>themes</code>, <code>cache</code>, and a few others are not shown by the selector.<br />\nThe images from the selected directory will be displayed by Supersized unless you use a custom directory in each post/page.<br />\nPlease put your images folders (default or custom) for Supersized in your <code>wp-content</code> directory. You may create folders within folders, e.g. <code>/wp-content/supersized-slides/slidesforpost###/</code>.<br />\n<em>If you have been using the <code>SupersizedDir</code> custom field in your pages/posts, it is still used but is now shown and selected with a selector. You do not need to fill the custom field yourself anymore.</em><br />\nWP Supersized will look first for a custom images source that you would have set up for the current page/post. If not found, it will then use the default directory selected here (do not forget to create it and fill it with images!). If none of these can be found, the default Supersized images will be shown.</p>\n<ul>\n<li><em>Debugging mode on/off</em></li>\n</ul>\n<p>When on, WP Supersized will generate comments in the source of the web page (in the slides list) with some variables and arrays values, useful to find out the origin of file path problems. If you have problems with displaying your images, send me these comments from the source of the page and I will be able to help you more easily.<br />\nThis is not necessary for normal operation. Use only if you have trouble with displaying your images.<br />\n(default is off)</p>\n<p><em>Size and position</em></p>\n<ul>\n<li><em>Minimum width allowed, Minimum height allowed</em></li>\n</ul>\n<p>Minimum dimensions the image is allowed to be. If either is met, the image won&#8217;t size down further (default is 0).</p>\n<ul>\n<li><em>Center the background vertically</em></li>\n</ul>\n<p>Centers image vertically. When turned off, the images resize/display from the top of the page (default is on).</p>\n<ul>\n<li><em>Center the background horizontally</em></li>\n</ul>\n<p>Centers image horizontally. When turned off, the images resize/display from the left of the page (default is on).</p>\n<ul>\n<li><em>Always fit</em></li>\n</ul>\n<p>Prevents the image from ever being cropped. Ignores minimum width and height. (default is off).</p>\n<ul>\n<li><em>Fit portrait</em></li>\n</ul>\n<p>Prevents the image from being cropped by locking it at 100% height (default is on).<br />\nThis will usually cause vertical images to not cover the window entirely.</p>\n<ul>\n<li><em>Fit landscape</em></li>\n</ul>\n<p>Prevents the image from being cropped by locking it at 100% width (default is off).<br />\nThis will usually cause horizontal images to not cover the window entirely.</p>\n<p><em>Components</em></p>\n<p><strong>The following options are not taken into account when in Single image mode.</strong></p>\n<ul>\n<li><em>Navigation arrows</em></li>\n</ul>\n<p>Displays arrows for navigation (default is on).</p>\n<ul>\n<li><em>Slideshow controls</em></li>\n</ul>\n<p>Turns the navigation on/off (default is on).<br />\nWhen turned off, the whole Supersized footer is hidden and the navigation controls are hidden. You may still display the captions (if the <code>Slides captions</code> option is on) even when this option is turned off. This allows the use of html in captions without the Supersized footer being displayed.<br />\nWhen turned off, the controls will not be visible but the keyboard navigation will still be available (unless you disable it in the corresponding option).<br />\nFor custom navigation buttons, replace the images in your <code>/wp-content/plugins/wp-supersized/img/</code> folder.</p>\n<ul>\n<li><em>Thumbnail navigation</em></li>\n</ul>\n<p>Toggles forward/backward thumbnail navigation (default is off). When on, thumbnails from the next/previous posts are generated and can be clicked to navigate. If there is no thumbnail available for the slide, it will simply scale down the full size image, which can slow performance.<br />\nFor both Thumbnail navigation and Thumbnail links in thumbnail tray, thumbnail files must be present in a <code>thumbs/</code> directory within the corresponding slides folder, each thumbnails having the same name (+ suffix) as its corresponding image, i.e. the slide <code>image_1.jpg</code> in <code>wp-content/supersized-slides</code> and its thumbnail <code>image_1-1.jpg</code> in <code>wp/content/supersized-slides/thumbs</code>.<br />\nThumbnails must be 150 px high to avoid resizing by Supersized.</p>\n<ul>\n<li><em>Thumbnail suffix</em></li>\n</ul>\n<p>The suffix to use for recognizing the thumbnails. Default is -1.</p>\n<ul>\n<li><em>Thumbnail tray</em></li>\n</ul>\n<p>Thumbnail tray appears at the bottom of the screen when clicked on bottom right arrow (default is on).<br />\nIf you select this option and do not select the next one, there will be no thumbnail in the tray which is not really useful.<br />\nSee the <code>Thumbnail navigation</code> option above for details about thumbnails.</p>\n<ul>\n<li>\n<p><em>Thumbnail links in thumbnail tray</em></p>\n<p>Generates a list of thumb links in the thumbnail tray that jumps to the corresponding slide. If there is no thumbnail available for the slide, it will simply scale down the full size image, which can slow performance (default is on)</p>\n</li>\n<li>\n<p><em>Slide links</em></p>\n<p>None<br />\nNumbers<br />\nSlide title<br />\nEmpty (default)</p>\n</li>\n</ul>\n<p>Shows a list of the slides in the navigation bar &#8211; Better to leave it on <code>Empty</code> or <code>None</code> for now, as there are still some issues with how Supersized is displaying this.</p>\n<ul>\n<li><em>Slide numbers</em></li>\n</ul>\n<p>Enables/Disables the slide counter (default is on).</p>\n<ul>\n<li><em>Slide caption</em></li>\n</ul>\n<p>Enables/Disables slide captions (default is on).<br />\nAccording to the source of images, captions are extracted from:</p>\n<ul>\n<li>The <code>IPTC caption</code> field of the jpg image file for default or custom folders</li>\n<li>The <code>caption field</code> of the image for WP Gallery images.</li>\n<li>The <code>description field</code> of the image for NextGEN gallery images.</li>\n<li>\n<p>The <code>title field</code> of the corresponding image in the xml file.</p>\n</li>\n<li>\n<p><em>Progress bar</em></p>\n</li>\n</ul>\n<p>Enables/Disables the progress bar shown at the bottom of the screen (default is on).</p>\n<ul>\n<li><em>Fluid thumbnail bar</em></li>\n</ul>\n<p>Enables/Disables the fluid move of the thumbnail bar to the left or right based on mouse location (default is off).</p>\n<p><em>Flickr</em></p>\n<p><strong>The following options are specific to the Flickr mode.</strong></p>\n<ul>\n<li><em>Flickr Source</em></li>\n</ul>\n<p>Tells Supersized which of the options to pull the images from.</p>\n<p>Set: pulls images from a set.</p>\n<p>User: pulls images from a user.</p>\n<p>Group: pulls images from a group (default).</p>\n<p>Tags: pulls images by tags.</p>\n<ul>\n<li><em>Set</em></li>\n</ul>\n<p>You must provide the ID number of the desired set (located in the URL).</p>\n<ul>\n<li><em>User</em></li>\n</ul>\n<p>You must provide the ID number of the desired user (<a href=\"http://idgettr.com/\" title=\"idgettr.com\" rel=\"nofollow ugc\">idgettr.com</a>).</p>\n<ul>\n<li><em>Group</em></li>\n</ul>\n<p>You must provide the ID number of the desired group (<a href=\"http://idgettr.com/\" title=\"idgettr.com\" rel=\"nofollow ugc\">idgettr.com</a>)</p>\n<ul>\n<li><em>Tags</em></li>\n</ul>\n<p>You must provide the desired tag(s)</p>\n<ul>\n<li><em>How many pictures to pull</em></li>\n</ul>\n<p>Between 1-500 (default is 100).</p>\n<ul>\n<li><em>Flickr Size</em></li>\n</ul>\n<p>The image size to pull &#8211; t,s,m,z,b (smallest to largest, default is z).<br />\nDetails on <a href=\"http://www.flickr.com/services/api/misc.urls.html\" title=\"flickr.com\" rel=\"nofollow ugc\">flickr.com</a></p>\n<ul>\n<li><em>Sort Images By</em></li>\n</ul>\n<p>Sort images by date posted, date taken, or interestingness (Default is Date posted).</p>\n<ul>\n<li><em>Sort Direction</em></li>\n</ul>\n<p>Select the sort direction (Default is Descending).</p>\n<ul>\n<li><em>Flickr API key</em></li>\n</ul>\n<p>You need this in order for this to work. You need to get your own at <a href=\"http://www.flickr.com/services/apps/create/\" title=\"flickr.com\" rel=\"nofollow ugc\">flickr.com</a></p>\n<p><em>Picasa</em></p>\n<p><strong>The following options are specific to the Picasa mode.</strong></p>\n<ul>\n<li><em>Picasa Source</em></li>\n</ul>\n<p>Tells Supersized which of the options to pull the images from.</p>\n<p>Album : pulls images from a Picasa album (default).</p>\n<p>User: pulls images from a user.</p>\n<p>Tags: pulls images by tag.</p>\n<ul>\n<li><em>Album</em></li>\n</ul>\n<p>You must provide the ID of the desired album. It can be found in the URL of the link to this album.</p>\n<ul>\n<li><em>User</em></li>\n</ul>\n<p>You must provide the ID number of the desired user (either you Picasa user name or the long number in the URL to your profile).</p>\n<ul>\n<li><em>Tags</em></li>\n</ul>\n<p>You must provide the desired tag(s). You may combine several tags (comma- or &#8220;+&#8221;-separated = AND, &#8220;|&#8221;-separated = OR).</p>\n<ul>\n<li><em>How many pictures to pull</em></li>\n</ul>\n<p>Between 1-500 (default is 100).</p>\n<ul>\n<li><em>Picasa Image Size</em></li>\n</ul>\n<p>The image size to pull &#8211; 512, 640, 720, 800, 1024, 1280, 1440, 1600. The Picasa API will return the largest size available if your selection is larger than the original.</p>\n<ul>\n<li><em>Sort Images By</em></li>\n</ul>\n<p>Sort images by date published or date updated (none uses default Picasa order) (Default is Date published).</p>\n<ul>\n<li><em>Sort Direction</em></li>\n</ul>\n<p>Select the sort direction (Default is Descending).</p>\n<ul>\n<li><em>Picasa Author key</em></li>\n</ul>\n<p>You need this in order for private albums to work. It can be found in the URL of the link to a private album (each album has a different author key)</p>\n<p><em>Smugmug</em></p>\n<p><strong>The following options are specific to the Smugmug mode.</strong></p>\n<ul>\n<li><em>Smugmug Source</em></li>\n</ul>\n<p>Tells Supersized which of the options to pull the images from.</p>\n<p>Keyword: pulls images by keyword.</p>\n<p>User: pulls images from a user.</p>\n<p>Gallery: pulls images from a gallery.</p>\n<p>Category: pulls images by category.</p>\n<ul>\n<li><em>Keyword</em></li>\n</ul>\n<p>Comma-separated Smugmug keywords (they are combined).</p>\n<ul>\n<li><em>User</em></li>\n</ul>\n<p>You must provide the nickname of the desired user. You may combine it with keyword(s).</p>\n<ul>\n<li><em>Gallery</em></li>\n</ul>\n<p>You must provide the ID of the desired gallery</p>\n<ul>\n<li><em>Category</em></li>\n</ul>\n<p>You must provide the desired category.</p>\n<ul>\n<li><em>How many pictures to pull</em></li>\n</ul>\n<p>Between 1-100 (default is 100). This is currently the maximum allowed by the Google Feed API used by the plugin to get the images.</p>\n<ul>\n<li><em>Smugmug Size</em></li>\n</ul>\n<p>The image size to pull &#8211; Tiny, Thumb, Small, Medium, Large, XLarge, X2Large, X3Large, Original.<br />\nDetails on <a href=\"http://help.smugmug.com/customer/portal/articles/93250\" title=\"smugmug.com\" rel=\"nofollow ugc\">help.smugmug.com</a></p>\n<ul>\n<li><em>Sort Images By</em></li>\n</ul>\n<p>Sort images by date published or date updated (none uses default Smugmug order) (Default is Date posted).</p>\n<ul>\n<li><em>Sort Direction</em></li>\n</ul>\n<p>Select the sort direction (Default is Descending).</p>\n<ul>\n<li><em>Update</em></li>\n</ul>\n<p>Click here and your options will updated!</p>\n<ul>\n<li><em>Reset</em></li>\n</ul>\n<p>To reset all WP Supersized options.<br />\n<em>Required when you change theme.</em></p>\n<h4>Thanks</h4>\n<p>A big Thank You to Sam Dunn for developing the Supersized jquery extension.</p>\n<p>Thanks to the many developers who make so much information available for those (like me) who need to learn from more experienced people.</p>\n<p>Special thanks to Joke and Sandro who helped me finding the solution to a bug present in the plugin when WordPress is installed in its own folder.</p>\n<p>Thanks to the generous donators who encourage me to develop my plugin further (and start working on new ones!) by <a href=\"http://www.worldinmyeyes.be/donate/\" title=\"Donate\" rel=\"nofollow ugc\">making a donation</a>.</p>\n",
        "installation": "<ol>\n<li>Download the WP Supersized zip file and unzip it.</li>\n<li>Upload the WP Supersized folder to your <code>/wp-content/plugins/</code> directory. Alternatively, use the WordPress plugin install in <code>Plugins &gt;&gt; Add New &gt;&gt; Upload</code> to upload and install the zip file.</li>\n<li>Activate the plugin through the <code>Plugins</code> menu in WordPress.</li>\n<li>If you wish to use your own folder containing images, create a <code>supersized-slides</code> directory within your wp-content directory. This will be the default folder where images should be uploaded for WP Supersized.</li>\n<li>If you prefer not to use a folder as described in steps 4, you may use the images attached to a post/page with the WordPress Media Gallery or NextGEN Gallery, or images from Flickr, Picasa, or Smugmug instead.</li>\n<li>Go to the <code>Settings &gt;&gt; WP Supersized</code> menu and modify the options as desired. The source of images can also be defined independently for each post/page in the post/page editor.</li>\n</ol>\n",
        "faq": "\n<h4>Installation Instructions</h4>\n<p>\n<ol>\n<li>Download the WP Supersized zip file and unzip it.</li>\n<li>Upload the WP Supersized folder to your <code>/wp-content/plugins/</code> directory. Alternatively, use the WordPress plugin install in <code>Plugins &gt;&gt; Add New &gt;&gt; Upload</code> to upload and install the zip file.</li>\n<li>Activate the plugin through the <code>Plugins</code> menu in WordPress.</li>\n<li>If you wish to use your own folder containing images, create a <code>supersized-slides</code> directory within your wp-content directory. This will be the default folder where images should be uploaded for WP Supersized.</li>\n<li>If you prefer not to use a folder as described in steps 4, you may use the images attached to a post/page with the WordPress Media Gallery or NextGEN Gallery, or images from Flickr, Picasa, or Smugmug instead.</li>\n<li>Go to the <code>Settings &gt;&gt; WP Supersized</code> menu and modify the options as desired. The source of images can also be defined independently for each post/page in the post/page editor.</li>\n</ol>\n</p>\n<h4>How do I display WordPress Media Library images with Supersized ?</h4>\n<p>\n<p>Simply attach images from the WordPress Media Library to your new post or page. You do not need to insert them in the post/page, only attach them.<br />\nThe images will be shown by Supersized in the menu order. So moving them up or down the list in the Media Gallery menu will have the effect of changing their order when displayed by WP Supersized.<br />\nWP Supersized will use the caption defined in the Media Gallery. If it is not present, it will use the image title (filename).<br />\nTo let WP Supersized know that it should display the images from the Media Gallery, select WP Gallery in the Supersized meta box (below the editor) in the page/post editor.<br />\nIf you have used the <code>SupersizedDir</code> custom field before, do not worry, your data is not lost; it is simply shown in an easier way. You do not need to fill in the custom field yourself anymore.<br />\nPosts or pages using the Media Gallery images will all use the options defined in the plugin admin.</p>\n</p>\n<h4>How do I display NextGEN Gallery images with Supersized ?</h4>\n<p>\n<p>Simply use NextGEN Gallery as you would normally to define galleries.<br />\nThe images will be shown by Supersized in the order that you chose in NextGEN. So moving them up or down the list in the NextGEN Gallery menu will have the effect of changing their order when displayed by WP Supersized.<br />\nFor the caption, WP Supersized will use the Description field that you defined in your NextGEN gallery. If it is not present, it will use the image Alt&amp;Title field, also defined in NextGEN.<br />\nTo let WP Supersized know that it should display the images from the NextGEN Gallery, select NextGEN Gallery in the Supersized meta box (below the editor) in the page/post editor.<br />\nTo select the NextGEN gallery that you want to use on this page/post, choose it in the WP Supersized panel or in the plugin options.<br />\nPosts or pages using the NextGEN Gallery images will all use the options defined in the plugin options.</p>\n</p>\n<h4>What should I do to use a different images folder for each post/page ?</h4>\n<p>\n<p>There are several ways to do it:</p>\n<ul>\n<li>Use the WP Media Gallery (see above)</li>\n<li>Use the NextGEN Gallery (see above)</li>\n<li>Use an XML file (see below) to define your list of images</li>\n</ul>\n<p>Alternatively, you may create folders containing images for specific pages/folders:<br />\n1. Create a folder that will contain your images in your wp-content folder, e.g. the folder <code>/wp-content/images_for_post_1</code> will contain the images for a particular post. It is also possible to create folders inside folders, e.g. <code>/wp-content/images/images_for_page_x</code>.<br />\n2. Once the folder(s) created, add the desired images there.<br />\n3. In the post/page editor, select the folder that you want to use from the list displayed in the Supersized meta box below the editing window (only folders are displayed).</p>\n</p>\n<h4>How do I set up different options on each page/post for choosing how to display Supersized and which images it uses ?</h4>\n<p>\n<p>From version 2.0, WP Supersized allows advanced users to choose almost all options <em>separately for each page/post</em>, including:</p>\n<ul>\n<li>Almost all options available in the plugin options.</li>\n<li>The list of slides to use (URL).</li>\n<li>The list of thumbnails to use (URL).</li>\n<li>The caption (title) to use for each slide. HTML and links can also be used within this caption.</li>\n<li>The link (URL) where the user will be directed when clicking on the image background (individually for each image).</li>\n</ul>\n<p>Details of how to use the XML file can be found in the <code>example.xml</code> file provided in the WP Supersized plugin folder. Simply make a copy of this file in your <code>wp-content</code> directory or another location within this directory, rename it, and edit it as you wish.</p>\n<p>To use an XML file, go to the page/post editor and select the option in the page/post Supersized meta box below the editing window. You also need to enter the path inside the <code>wp-content</code> directory and the name of the XML file in the <code>XML file</code> field.<br />\n<em>IMPORTANT: if you use xml files for defining your images, two slides field names must be renamed from version 3.0: <code>slide-link</code> to <code>slide_link</code> and <code>slide-thumb</code> to <code>slide_thumb</code> in the xml files</em>.</p>\n<p>For example, if you want to use an xml file containing specific options and/or slides for a particular page/post, let&#8217;s suppose that you have copied the <code>example.xml</code> file and created a file called <code>my_slides_list_and_options.xml</code> in directory <code>wp-content/my_wpsupersized_slides_definitions</code> (choose the names as you wish).<br />\nYou would then need to enter <code>my_wpsupersized_slides_definitions/my_slides_list_and_options.xml</code> in the Supersized meta box below the editing window.<br />\nThat&#8217;s all, WP Supersized will now use your own definitions of the slides/options on this particular page/post.</p>\n<p>WP Supersized will use default options (as defined in the plugin admin) for any options not defined in the XML files.<br />\nSimilarly, if you do not define any slides within your XML file, the default directory slides (usually in the <code>supersized-slides</code> directory) will be used.</p>\n</p>\n<h4>WP Supersized is installed and activated, my slides folder contains images, and I have set up the options to show Supersized. Why is the Supersized slideshow still not visible ?</h4>\n<p>\n<p>In order to see the slideshow, you must make sure that the background of the current page/post is at least partly transparent or leaves some transparent space around it.<br />\nIf you want your page/post to appear over a semi-transparent background that lets the Supersized slideshow visible, you should modify the css of your template(s).<br />\nHere is a useful <a href=\"http://perishablepress.com/press/2009/01/27/cross-browser-transparency-via-css/\" title=\"cross-browser transparent background\" rel=\"nofollow ugc\">link showing the css</a> needed for a cross-browser transparent background.</p>\n</p>\n<h4>How can I have links in the captions of the images ?</h4>\n<p>\n<p>This is not available for the default or custom folders as captions for images from these are extracted from the IPTC caption field of the file.<br />\nYou have several possibilities to have links in the captions:</p>\n<ul>\n<li>If you use the WP gallery, you can simply type html code (including links) in the <code>caption field</code> of the images. It will then be displayed automatically by WP Supersized.</li>\n<li>If you use the NextGEN gallery, same principle but you need to type it in the <code>description field</code>.</li>\n<li>The last way to do it is to use an xml file (as explained in the FAQ and in the example.xml file). There, you can put html code in the <code>title field</code></li>\n</ul>\n</p>\n<h4>Why does Supersized not work with Internet Explorer 6 ?</h4>\n<p>\n<p>Sam Dunn has made the choice not to support IE6 anymore. If you are still using IE6, you should seriously think about upgrading!</p>\n</p>\n<h4>Supersized does not resize the images correctly in Internet Explorer</h4>\n<p>\n<p>Although it seems to appear only sporadically, this was a known bug of Supersized 3.1.x. The latest version of Supersized (from 3.2.4) used in this plugin should solve this issue but is not yet available for the flickr mode.</p>\n</p>\n<h4>Why are images not resized to full screen on iPads or some Android tablets ?</h4>\n<p>\n<p>It has been reported that Supersized images are not resized correctly on iPad and Android tablets. As far as I know, this is mostly due to the way they are handling images and their interpretation of some css. There is currently no clear solution for this.</p>\n</p>\n<h4>What are the image formats that can be used with Supersized ?</h4>\n<p>\n<p>Since version 1.2 of WP Supersized, the following formats are recognized: jpg, jpeg, gif, png.</p>\n</p>\n<h4>Why are only default images or an image indicating an error displayed when my WordPress installation has its own folder ?</h4>\n<p>\n<p>If you see an image indicating an error, it should point you to one of the possible causes for this problem.<br />\nFirst of all, make sure to update to the latest version of the plugin.<br />\nIf the issue is still present, there is probably a problem with file access permissions on your server. This has mostly been observed when running servers based on Windows. Try changing access rights to your image folder to solve this.<br />\nIt could also be that your provider has disabled the glob() function in php. Some providers seem to have done this to avoid a security issue with glob() in versions of php earlier than 5.2.4. It is not necessary anymore from php version 5.2.4 and higher so there should be no reason to leave the glob() function disabled. If you are in this case, contact your provider and ask them to enable the glob() function. Thanks to Sandro for finding out about this.</p>\n</p>\n<h4>Where is the SupersizedDir custom field ?</h4>\n<p>\n<p><em>THIS IS NOT NEEDED ANYMORE FROM VERSION 3.0 BUT IS LEFT HERE FOR YOUR INFORMATION</em></p>\n<p>At the bottom of the page/post you are creating/editing, you should see a box called Custom Field. If it is not visible, go to Screen Options (top right of the page) and check Custom Field.<br />\nIn the Custom Field box, enter the new Custom Field name <em>SupersizedDir</em> (next time, it will appear automatically in the list of Custom Field names).<br />\nAccording to what you want to do, you can then give it a value that is the name of the folder to use for this particular post/page, or the value <code>wp-gallery</code> to use the WordPress Media Gallery, or (for advanced users) the location of an xml file containing all slides, titles, links, and options for this particular page/post.</p>\n</p>\n\n",
        "changelog": "<h4>3.1.6</h4>\n<ul>\n<li>Bug fix: metabox content rewritten in the page/post editing screen to work with the new version of jQuery that shipped with WordPress 3.6.</li>\n<li>Updated the jQuery UI style to the latest available (v1.10.3).</li>\n</ul>\n<h4>3.1.5</h4>\n<ul>\n<li>Added the option Always fill screen in Size and position, to allow the image to always fill the screen (image is cropped). This possibility had disappeared when the new Size and position button was introduced in v.3.1.2.</li>\n</ul>\n<h4>3.1.4</h4>\n<ul>\n<li>Bug fix (tested): corrected several errors in the automatic options conversion routine that were still preventing the plugin to work correctly.<br />\nThis bug fix will only work on new updates from versions before v.3.1.2.<br />\nIf you were faced with problems when updating to v.3.1.2 or v.3.1.3, the solution is to take a note of your current options and then to reset the options and enter your own options again. Sorry for the inconvenience.</li>\n</ul>\n<h4>3.1.3</h4>\n<ul>\n<li>Bug fix: added more checks in the automatic options conversion routine to avoid the issue of losing the options when updating. This bug fix will only work on new updates from versions earlier than v.3.1.2.<br />\nIf you were faced with the problem when updating to v.3.1.2, the solution is to take a note of your current options and then to reset the options and enter your own options again. Sorry for the inconvenience.</li>\n</ul>\n<h4>3.1.2</h4>\n<ul>\n<li>Bug fix: fixed a small syntax error in jquery code used by the plugin that was causing problems with the display of the backend metabox in WP 3.5.</li>\n<li>Bug fix: the options selected through an xml file should now work as advertised.</li>\n<li>Bug fix: the thumb tray will now appear only when the corresponding option (Thumbnail tray) is selected, even if the option for showing the tray at startup is selected.</li>\n<li>Bug fix: modified the Flickr, Picasa, and Smugmug code used by the plugin to avoid the disappearance of the navigation arrows when a long caption is displayed.</li>\n<li>Bug fix: the Fit always option should now work also with Flickr, Picasa, and Smugmug images.</li>\n<li>Modified the Size and position option: Fit always, Fit portrait, and Fit landscape are now mutually exclusive. There was no point in selecting both Fit portrait and Fit landscape at the same time to do what Fit always does anyway.</li>\n<li>Added support for displaying the Supersized source meta box in custom post types (thanks to <a href=\"https://wordpress.org/support/profile/jonasvorwerk\" title=\"JonasVorwerk\" rel=\"ugc\">JonasVorwerk</a>).</li>\n<li>Added enhanced jquery animate to remove flickering on iPad and iPhone (<a href=\"http://playground.benbarnett.net/jquery-animate-enhanced/\" title=\"jquery.animate-enhanced plugin\" rel=\"nofollow ugc\">jquery.animate-enhanced plugin</a>).</li>\n<li>Added more details for the use of some options in the admin.</li>\n<li>Added an automatic option updater to set the right format for the on/off options.</li>\n<li>Updated the example.xml file with the missing options for Picasa, and Smugmug.</li>\n<li>Cleaned up some code.</li>\n<li>Tested up to WP 3.5.</li>\n</ul>\n<h4>3.1.1</h4>\n<ul>\n<li>Bug fix: moved a few lines in their correct position in the code. This small mistake was generating warnings about invalid arguments passed to the implode() function.</li>\n<li>Bug fix: added a few additional checks in the admin to avoid warnings about invalid arguments passed to the implode() function.</li>\n<li>Bug fix: rewrote the install() function to remove errors introduced in version 3.1.</li>\n<li>Eliminated a few php notices (undefined index).</li>\n<li>Cleaned up some html in the admin of the plugin.</li>\n</ul>\n<h4>3.1</h4>\n<ul>\n<li>Added support for the use of images from Picasa and Smugmug.</li>\n<li>Added the ability to sort Flickr images (thanks to <a href=\"https://github.com/mendhak\" title=\"mendhak\" rel=\"nofollow ugc\">mendhak</a>).</li>\n<li>Now with easy individual selection of source (WP Media Gallery, NextGen Gallery, Flickr, Picasa, Smugmug, custom dir, or XML file) for each page/post.</li>\n<li>Bug fix: Removed a trailing slash in the function listing the folders and files. This was causing an open_basedir restriction error in php versions older than 5.2.2.</li>\n<li>Bug fix: The image source selected within a post/page is now used even when the Flickr or Single modes are defined as default in the plugin options.</li>\n<li>Bug fix: The debugging mode will not break the page anymore. Debugging info now appears correctly as a comment in the page source.</li>\n<li>Bug fix for square photos in Flickr module (thanks to <a href=\"https://github.com/matt-richardson\" title=\"Matt Richardson\" rel=\"nofollow ugc\">Matt Richardson</a>).</li>\n<li>Added a jquery.easing.compatibility.js file to help solving issues that appeared for some users (thanks to <a href=\"http://twanneman.nl/\" rel=\"nofollow ugc\">Twanneman</a> &#8220;Twanneman&#8221;).</li>\n<li>Improved: Navigation arrows will not be displayed anymore when there is only one image to show. Thanks to <a href=\"https://wordpress.org/support/profile/artemkolotilkin\" title=\"Artem\" rel=\"ugc\">Artem</a> and <a href=\"https://wordpress.org/support/profile/glark\" title=\"Glark\" rel=\"ugc\">Glark</a> for noticing this issue and hacking a solution while I was updating the plugin.</li>\n<li>Modified the plugin files structure to improve modularity.</li>\n<li>Cleaned up the code of the install function.</li>\n<li>Updated the readme.</li>\n</ul>\n<h4>3.0.2</h4>\n<ul>\n<li>Added an option to display the thumbtray at startup to avoid having to click on the button to show it.</li>\n<li>Bug fix: added typecasting to the array_merge() function.</li>\n<li>Improvement: now also checking that the NextGEN Gallery plugin is active (on top of checking for its presence).</li>\n<li>Updated the readme.</li>\n</ul>\n<h4>3.0.1</h4>\n<ul>\n<li>Bug fix: the plugin should now work as expected on some configurations where the backend was screwed up due to a wrong function call.</li>\n<li>Bug fix: re-enabled the previous glob() function (on top of the new one) to allow for different configurations, some of them missing their images.</li>\n</ul>\n<h4>3.0</h4>\n<ul>\n<li>Added support for the use of images from NextGEN galleries.</li>\n<li>Added a panel in post/page editor to allow the selection of the images source &#8211; <em>no need to type your selection in a custom field anymore</em>.</li>\n<li>Redesigned the options panel, using tabs to reduce clutter.</li>\n<li>Added a folder selector to the options page for easy selection of the default folder or NextGEN gallery.</li>\n<li>Added the ability to have captions displayed even if the rest of the Supersized footer is off (allows displaying html from image caption even with the footer option off).</li>\n<li>Added checks for the existence and read permissions for image folders and NextGEN or WP Media gallery images &#8211; displays an informative error image if an error is detected.</li>\n<li>Updated with the latest versions of Supersized (3.2.7) and its Shutter theme (1.2).</li>\n<li>Improved: the glob() function should now work better for users with some servers that do not support the BRACE option. Thanks to Jan for suggesting this.</li>\n<li>Improved: replaced the url by the absolute path for reading xml files to avoid possible problems with some hosts. Thanks to <a href=\"https://wordpress.org/support/profile/aware/\" title=\"Aaron\" rel=\"ugc\">Aaron Ware</a> for suggesting this.</li>\n<li>Improved: automatic removal of slashes in the default dir and custom dir paths.</li>\n<li>Bug fix: archive, tag, category, or date pages should now correctly display the default images.</li>\n<li>Bug fix: the plugin should now work correctly with xml files containing no images: default images are shown instead (as advertised!).</li>\n<li>Bug fix: the plugin should now work correctly with IE when using WP Gallery images. Thanks to <a href=\"https://profiles.wordpress.org/users/lumpysimon/\" title=\"Simon\" rel=\"nofollow ugc\">Simon</a> for spotting this bug.</li>\n<li>Updated the readme.</li>\n<li>Removed the xmlLib library. The plugin now uses standard SimpleXML functions. <em>IMPORTANT: if you use xml files for defining your images, two slides field names must be renamed: <code>slide-link</code> to <code>slide_link</code> and <code>slide-thumb</code> to <code>slide_thumb</code> in the xml files</em>.</li>\n</ul>\n<h4>2.0</h4>\n<ul>\n<li>Added the ability to use the WordPress Media Gallery images attached to pages/posts as source of images.</li>\n<li>Added the ability to use an xml file to define all images, titles, links, and options for each post/page separately.</li>\n<li>Added the ability to use HTML and links in the caption of the images (only when using the xml file).</li>\n<li>Behaviour change: slight modification to allow an image to be displayed even when there is only one in the chosen folder and in slideshow mode.</li>\n<li>Behaviour change: removed the option <code>Only on posts/pages with custom field SupersizedDir</code>. Any post/page that has a custom field SupersizedDir filled in will use Supersized.</li>\n<li>Bug fix: the navigation controls are now working as expected in the Flickr mode.</li>\n</ul>\n<h4>1.5.1</h4>\n<ul>\n<li>Bug fix: WP Supersized now works correctly with WPML-translated pages/posts (caution: not tested if you use a different domain per language).</li>\n<li>Added a donation link in the plugin admin.</li>\n</ul>\n<h4>1.5</h4>\n<ul>\n<li>Bug fix: modified the way the plugin finds the slides folder so that it finally works with non-standard WordPress installations (e.g. when WordPress has its own folder). Special thanks to Joke and Sandro who helped me finding the solution to this bug by testing several beta versions on their system.</li>\n<li>Bug fix: the play/pause buttons behave correctly again (a previously corrected bug had been reintroduced when updating to Supersized 3.2.6).</li>\n</ul>\n<h4>1.4</h4>\n<ul>\n<li>Updated with the latest version of Supersized (3.2.6).</li>\n</ul>\n<h4>1.3</h4>\n<ul>\n<li>Added the option to output a few comments in the source of the web page to help in debugging the problems that some users have with the file path to their images folders.</li>\n<li>Bug fix: filenames are now always sorted alphabetically in the slides list output.</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>Bug fix: fixed a bug in the Single image mode that prevented the image to be displayed.</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Bug fix: fixed a bug that caused an error when there was no thumbs folder.</li>\n</ul>\n<h4>1.2</h4>\n<ul>\n<li>Updated with the latest version of Supersized (3.2.5).</li>\n<li>Bug fix: fixed a bug that prevented images to be displayed correctly when in Tag or Category results page.</li>\n<li>Bug fix: fixed a bug that prevented Supersized to be used in subcategories of a chosen category.</li>\n<li>Bug fix: WP Supersized should now take into account the location of the wp-content folder also in non-standard WordPress installations.</li>\n<li>Added the ability to use gif and png image formats in addition to jpg (can now also be jpeg).</li>\n<li>Added the options to use Supersized everywhere, on Search results page only, on Date archives, or on Any archive.</li>\n<li>Added the option to have a URL of your choice when clicked on the background image (one for all images), or none.</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Updated with the latest modified Supersized Flickr engine, including the option to choose images by tags.</li>\n<li>Bug fix: the Flickr slideshow broken with the previous update now works again.</li>\n</ul>\n<h4>1.1</h4>\n<ul>\n<li>Updated with the latest version of Supersized (3.2.4).</li>\n<li>The <code>slides</code> folder must now be renamed <code>supersized-slides</code> and be placed in the <code>/wp-content</code> directory instead of the <code>/wp-content/plugins/wp-supersized</code> directory. This allows updates without losing your images.</li>\n<li>Added the ability to choose any folder within the <code>/wp-content</code> folder as a default slides folder.</li>\n<li>Added the ability to select a different slides folder for each page/post through the custom field <code>SupersizedDir</code>.</li>\n<li>Added more options for selecting the pages/posts where Supersized will be used: Category archive, Tag archive, Category ID, Tag ID.</li>\n<li>Bug fix: Random image now works as expected in Single image mode.</li>\n<li>Bug fix: the loader image (progress.gif) now loads and displays correctly. </li>\n<li>Added new Supersized options.</li>\n<li>Admin page ready for translation (.pot file available). Anyone interested in translating WP Supersized in his/her own language ?</li>\n<li>Added French translation. </li>\n<li>Removed the Supersized logo option (not present in the original Supersized example anymore).</li>\n</ul>\n<h4>1.0</h4>\n<ul>\n<li>The very first version.</li>\n</ul>\n"
    },
    "short_description": "Full screen background slideshow in any page/post, with images from WP Media Gallery, NextGEN Gallery, Flickr, Picasa, Smugmug, folder, or XML file",
    "description": "<p>WP Supersized allows you to display a resizable full screen background slideshow on pages/posts of your choice.<br />\nAfter activation you will find a new WP Supersized section in your Settings where you can manage the plugin options.<br />\nA WP Supersized panel will also be available in the post/page editor to select the source of images used by the plugin individually for the current post/page.</p>\n<p><em>Users may use images from NextGEN Gallery, the WordPress Media Gallery, Flickr, Picasa, Smugmug, their own choice of directory within the wp-content folder, or a list of slides defined in an xml file (for advanded users).</em></p>\n<p>WP Supersized integrates the Supersized jquery extension in the pages/posts of your choice. I am not the developer of the original Supersized jquery extension itself, <a href=\"http://buildinternet.com/project/supersized/\" title=\"Supersized webpage\" rel=\"nofollow ugc\">Supersized</a> was written by <a href=\"http://vivalasam.com/\" title=\"Sam Dunn\" rel=\"nofollow ugc\">Sam Dunn</a>. My plugin only integrates it into your theme and gives you easy access to many options for displaying this resizeable slideshow background where you want on your website or blog.</p>\n<p>So, what exactly does WP Supersized do?</p>\n<ul>\n<li>Cycles Images/backgrounds via slideshow with transitions and preloading (use it as background or as slideshow)</li>\n<li>Resizes images to fill browser while maintaining image dimension ratio</li>\n<li>Navigation controls with keyboard support</li>\n<li>Integration with NextGEN Gallery and with the WordPress Media Gallery &#8211; choose images from NextGEN galleries or attached to post/page</li>\n<li>Integration with Flickr &#8211; pull photos by user, set, tag, or group</li>\n<li>Integration with Picasa &#8211; pull photos by album, user,or tag</li>\n<li>Integration with Smugmug &#8211; pull photos by keyword, user, gallery, category</li>\n<li>Accepts jpg, gif, and png images</li>\n<li>Simple selection of your images source for each page/post separately (also options for advanced users, using an XML file)</li>\n<li>HTML and links can be used within the images captions (when using WP Media Gallery, NextGEN Gallery, or an XML file as source of images).</li>\n</ul>\n<p>You can see an example of Supersized in use in a WordPress page on the <a href=\"http://www.worldinmyeyes.be/2265/\" title=\"WP Supersized page\" rel=\"nofollow ugc\">WP Supersized page</a> or on my <a href=\"http://www.worldinmyeyes.be/about-2/\" title=\"About page\" rel=\"nofollow ugc\">About page</a>.<br />\nFor more details about Supersized itself and its development, check <a href=\"http://www.buildinternet.com/project/supersized/\" title=\"the Supersized website\" rel=\"nofollow ugc\">Supersized</a>.</p>\n<p>WP Supersized allows you to display Supersized on the pages/posts that you want in your current theme. Many options are available to choose where and how it will be displayed.</p>\n<h4>Options</h4>\n<p>There is a number of available options, shown below with their default values. <em>Not every option is functional in the Single image mode</em>.<br />\nWP Supersized also adds an additional option tab in the page/post editor for easy selection of the source of images for each post/page individually. A source selected on an individual page/post will override the general options choice. When no value has been set for these options yet, they use the general options.</p>\n<p><em>Functionality</em></p>\n<ul>\n<li><em>Type of background</em></li>\n</ul>\n<p>Determines which type of slideshow will be used.</p>\n<p>Slideshow: The images that you have uploaded to your <code>/wp-content/supersized-slides/</code> directory or the ones attached to the post/page through the WordPress Media Gallery (have a look at the FAQ to find out how this works) will be shown.</p>\n<p>Single image: A single image will be used (the first one found in the slides folder if you have more than one). Slideshow controls will not appear in this mode.</p>\n<p>Flickr images: Images will be pulled from Flickr (by user, set, group, or tags see the Flickr options below). If you choose this, please be aware that not all Components options and none of the Supersized Shutter theme specific options will be available with the current version of Supersized.</p>\n<ul>\n<li><em>Autoplay on/off</em></li>\n</ul>\n<p>Determines whether the slideshow begins playing automatically when the page is loaded.</p>\n<ul>\n<li><em>Start on slide #</em></li>\n</ul>\n<p>The slide the slideshow starts on (default is 1). Slides are sorted in alphabetical order of their filename.<br />\nIn the Single image mode, it controls which image is loaded, 0 causes a random image to be loaded each time (assuming that you have several images in the <code>/wp-content/supersized-slides/</code> directory).</p>\n<ul>\n<li><em>Random slides</em></li>\n</ul>\n<p>When on, slides are shown in a random order and the starting slide number will be disregarded. Default is off.</p>\n<ul>\n<li><em>Slide interval</em></li>\n</ul>\n<p>Time between slide changes in milliseconds. The default is 3 seconds.</p>\n<ul>\n<li><em>Transition</em></li>\n</ul>\n<p>Controls which effect is used to transition between slides. Options are as follows:</p>\n<pre><code>No transition effect\nFade effect (Default)\nSlide in from top\nSlide in from right\nSlide in from bottom\nSlide in from left\nCarousel from right to left\nCarousel from left to right\n</code></pre>\n<ul>\n<li><em>Speed of transition</em></li>\n</ul>\n<p>The time transitions take in milliseconds (default is 500 milliseconds).</p>\n<ul>\n<li><em>New window</em></li>\n</ul>\n<p>Whether or not slide links open in a new window (default is on).</p>\n<ul>\n<li><em>Pause on hover</em></li>\n</ul>\n<p>Pauses the slideshow when the current image is hovered over. If navigation is enabled, the pause button will become active to show paused state. Disabled by default.</p>\n<ul>\n<li><em>Stop loop</em></li>\n</ul>\n<p>Pauses the slideshow upon reaching the last slide (default is off).</p>\n<ul>\n<li><em>Keyboard navigation</em></li>\n</ul>\n<p>Keyboard navigation (default is on).<br />\nSpacebar pauses, Up/Right go to next slide, and Down/Left go to previous slide.</p>\n<ul>\n<li><em>Performance</em></li>\n</ul>\n<p>Uses image rendering options in Firefox and Internet Explorer to adjust image quality. This can speed up/slow down transitions. Webkit does not yet support these options.</p>\n<pre><code>Normal - No adjustments\nHybrid Speed/Quality - Lowers image quality during transitions and restores after completed (Default)\nOptimizes image quality\nOptimizes transition speed - Faster transition speed, lower image quality\n</code></pre>\n<ul>\n<li><em>Image protection</em></li>\n</ul>\n<p>Disables right clicking and image dragging using Javascript (default is off).</p>\n<ul>\n<li><em>Background URL</em></li>\n</ul>\n<p>Type here the URL of the link you want to access when clicking on the background image (www.example.com). The same link will be used for all images. Leave this field empty if your do not want any link to be used. Default is empty.</p>\n<p><em>Display</em></p>\n<ul>\n<li><em>Select the page(s) where Supersized should be used</em></li>\n</ul>\n<p>Choose where you want to apply Supersized. These are the most general options. More precise selections are possible below.</p>\n<pre><code>Everywhere (except admin pages)\nAll pages (except homepage)\nHomepage (of your blog)\nFront page (landing page)\nError page (404)\nSearch results page\nAll posts (not pages)\nSticky post\nCategory archive\nTag archive\nDate archive\nAny archive\n</code></pre>\n<p>From version 2.0, the option <code>Only on posts/pages with custom field SupersizedDir</code> has been removed. Any page/post that has an image source other than <code>none</code> will display Supersized.<br />\nIf you select All posts, All pages, or Everywhere, posts/pages with an image source other than <code>none</code> will show images from the corresponding folder while all others will show the default directory images.<br />\nIn each of these options, unless a specific image source was defined in the page/post, the default slides directory will be used.</p>\n<ul>\n<li><em>Select the page template(s) where Supersized should be used</em></li>\n</ul>\n<p>This option lists all available custom templates in the current theme. You may select one or several of them.<br />\nThe list is empty if your current theme does not use any custom template.<br />\nPlease reset the options when you change theme to make sure that the list is updated.</p>\n<ul>\n<li><em>Post ID where Supersized will be used</em></li>\n</ul>\n<p>Type here a comma-separated list of the post IDs where you want Supersized to appear.<br />\nDon&#8217;t forget to deselect <code>All posts</code> or <code>Sticky post</code> above.<br />\nYou can find your post IDs in the Posts admin menu by hovering on the name of the post. The ID will be displayed at the bottom of your browser. Alternatively, you can use the <a href=\"https://wordpress.org/extend/plugins/wp-show-ids/\" title=\"WP Show IDs ( simple, yet elegant )\" rel=\"ugc\">WP Show IDs</a> plugin.</p>\n<ul>\n<li><em>Page ID where Supersized will be used</em></li>\n</ul>\n<p>Type here a comma-separated list of the page IDs where you want Supersized to appear.<br />\nDon&#8217;t forget to deselect <code>All pages</code>, <code>Homepage</code>, <code>Front page</code>, or <code>Error page</code> above.<br />\nYou can find your page IDs in the Pages admin menu by hovering on the name of the page. The ID will be displayed at the bottom of your browser. Alternatively, you can use the <a href=\"https://wordpress.org/extend/plugins/wp-show-ids/\" title=\"WP Show IDs ( simple, yet elegant )\" rel=\"ugc\">WP Show IDs</a> plugin.</p>\n<ul>\n<li><em>Category ID for the posts/pages where Supersized will be used</em></li>\n</ul>\n<p>Type here a comma-separated list of the category IDs where you want Supersized to appear.<br />\nYou can find your Category IDs in the Posts &gt; Categories admin menu by hovering on the name of the category. The ID will be displayed at the bottom of your browser. Alternatively, you can use the <a href=\"https://wordpress.org/extend/plugins/wp-show-ids/\" title=\"WP Show IDs ( simple, yet elegant )\" rel=\"ugc\">WP Show IDs</a> plugin.</p>\n<ul>\n<li><em>Tag ID for the posts/pages where Supersized will be used</em></li>\n</ul>\n<p>Type here a comma-separated list of the tag IDs where you want Supersized to appear.<br />\nYou can find your Tag IDs in the Posts &gt; Post Tags admin menu by hovering on the name of the tag. The ID will be displayed at the bottom of your browser. Alternatively, you can use the <a href=\"https://wordpress.org/extend/plugins/wp-show-ids/\" title=\"WP Show IDs ( simple, yet elegant )\" rel=\"ugc\">WP Show IDs</a> plugin.</p>\n<p><em>Slides source</em></p>\n<ul>\n<li><em>Default slides directory</em></li>\n</ul>\n<p>Select here the slides directory that will be used by default (default is supersized-slides if it exists). Only folders are shown by the selector. Some folders such as <code>plugins</code>, <code>themes</code>, <code>cache</code>, and a few others are not shown by the selector.<br />\nThe images from the selected directory will be displayed by Supersized unless you use a custom directory in each post/page.<br />\nPlease put your images folders (default or custom) for Supersized in your <code>wp-content</code> directory. You may create folders within folders, e.g. <code>/wp-content/supersized-slides/slidesforpost###/</code>.<br />\n<em>If you have been using the <code>SupersizedDir</code> custom field in your pages/posts, it is still used but is now shown and selected with a selector. You do not need to fill the custom field yourself anymore.</em><br />\nWP Supersized will look first for a custom images source that you would have set up for the current page/post. If not found, it will then use the default directory selected here (do not forget to create it and fill it with images!). If none of these can be found, the default Supersized images will be shown.</p>\n<ul>\n<li><em>Debugging mode on/off</em></li>\n</ul>\n<p>When on, WP Supersized will generate comments in the source of the web page (in the slides list) with some variables and arrays values, useful to find out the origin of file path problems. If you have problems with displaying your images, send me these comments from the source of the page and I will be able to help you more easily.<br />\nThis is not necessary for normal operation. Use only if you have trouble with displaying your images.<br />\n(default is off)</p>\n<p><em>Size and position</em></p>\n<ul>\n<li><em>Minimum width allowed, Minimum height allowed</em></li>\n</ul>\n<p>Minimum dimensions the image is allowed to be. If either is met, the image won&#8217;t size down further (default is 0).</p>\n<ul>\n<li><em>Center the background vertically</em></li>\n</ul>\n<p>Centers image vertically. When turned off, the images resize/display from the top of the page (default is on).</p>\n<ul>\n<li><em>Center the background horizontally</em></li>\n</ul>\n<p>Centers image horizontally. When turned off, the images resize/display from the left of the page (default is on).</p>\n<ul>\n<li><em>Always fit</em></li>\n</ul>\n<p>Prevents the image from ever being cropped. Ignores minimum width and height. (default is off).</p>\n<ul>\n<li><em>Fit portrait</em></li>\n</ul>\n<p>Prevents the image from being cropped by locking it at 100% height (default is on).<br />\nThis will usually cause vertical images to not cover the window entirely.</p>\n<ul>\n<li><em>Fit landscape</em></li>\n</ul>\n<p>Prevents the image from being cropped by locking it at 100% width (default is off).<br />\nThis will usually cause horizontal images to not cover the window entirely.</p>\n<p><em>Components</em></p>\n<p><strong>The following options are not taken into account when in Single image mode.</strong></p>\n<ul>\n<li><em>Navigation arrows</em></li>\n</ul>\n<p>Displays arrows for navigation (default is on).</p>\n<ul>\n<li><em>Slideshow controls</em></li>\n</ul>\n<p>Turns the navigation on/off (default is on).<br />\nWhen turned off, the whole Supersized footer is hidden and the navigation controls are hidden. You may still display the captions (if the <code>Slides captions</code> option is on) even when this option is turned off. This allows the use of html in captions without the Supersized footer being displayed.<br />\nWhen turned off, the controls will not be visible but the keyboard navigation will still be available (unless you disable it in the corresponding option).<br />\nFor custom navigation buttons, replace the images in your <code>/wp-content/plugins/wp-supersized/img/</code> folder.</p>\n<ul>\n<li><em>Thumbnail navigation</em></li>\n</ul>\n<p>Toggles forward/backward thumbnail navigation (default is off). When on, thumbnails from the next/previous posts are generated and can be clicked to navigate. If there is no thumbnail available for the slide, it will simply scale down the full size image, which can slow performance.<br />\nFor both Thumbnail navigation and Thumbnail links in thumbnail tray, thumbnail files must be present in a <code>thumbs/</code> directory within the corresponding slides folder, each thumbnails having the same name (+ suffix) as its corresponding image, i.e. the slide <code>image_1.jpg</code> in <code>wp-content/supersized-slides</code> and its thumbnail <code>image_1-1.jpg</code> in <code>wp/content/supersized-slides/thumbs</code>.<br />\nThumbnails must be 150 px high to avoid resizing by Supersized.</p>\n<ul>\n<li><em>Thumbnail suffix</em></li>\n</ul>\n<p>The suffix to use for recognizing the thumbnails. Default is -1.</p>\n<ul>\n<li><em>Thumbnail tray</em></li>\n</ul>\n<p>Thumbnail tray appears at the bottom of the screen when clicked on bottom right arrow (default is on).<br />\nIf you select this option and do not select the next one, there will be no thumbnail in the tray which is not really useful.<br />\nSee the <code>Thumbnail navigation</code> option above for details about thumbnails.</p>\n<ul>\n<li>\n<p><em>Thumbnail links in thumbnail tray</em></p>\n<p>Generates a list of thumb links in the thumbnail tray that jumps to the corresponding slide. If there is no thumbnail available for the slide, it will simply scale down the full size image, which can slow performance (default is on)</p>\n</li>\n<li>\n<p><em>Slide links</em></p>\n<p>None<br />\nNumbers<br />\nSlide title<br />\nEmpty (default)</p>\n</li>\n</ul>\n<p>Shows a list of the slides in the navigation bar &#8211; Better to leave it on <code>Empty</code> or <code>None</code> for now, as there are still some issues with how Supersized is displaying this.</p>\n<ul>\n<li><em>Slide numbers</em></li>\n</ul>\n<p>Enables/Disables the slide counter (default is on).</p>\n<ul>\n<li><em>Slide caption</em></li>\n</ul>\n<p>Enables/Disables slide captions (default is on).<br />\nAccording to the source of images, captions are extracted from:</p>\n<ul>\n<li>The <code>IPTC caption</code> field of the jpg image file for default or custom folders</li>\n<li>The <code>caption field</code> of the image for WP Gallery images.</li>\n<li>The <code>description field</code> of the image for NextGEN gallery images.</li>\n<li>\n<p>The <code>title field</code> of the corresponding image in the xml file.</p>\n</li>\n<li>\n<p><em>Progress bar</em></p>\n</li>\n</ul>\n<p>Enables/Disables the progress bar shown at the bottom of the screen (default is on).</p>\n<ul>\n<li><em>Fluid thumbnail bar</em></li>\n</ul>\n<p>Enables/Disables the fluid move of the thumbnail bar to the left or right based on mouse location (default is off).</p>\n<p><em>Flickr</em></p>\n<p><strong>The following options are specific to the Flickr mode.</strong></p>\n<ul>\n<li><em>Flickr Source</em></li>\n</ul>\n<p>Tells Supersized which of the options to pull the images from.</p>\n<p>Set: pulls images from a set.</p>\n<p>User: pulls images from a user.</p>\n<p>Group: pulls images from a group (default).</p>\n<p>Tags: pulls images by tags.</p>\n<ul>\n<li><em>Set</em></li>\n</ul>\n<p>You must provide the ID number of the desired set (located in the URL).</p>\n<ul>\n<li><em>User</em></li>\n</ul>\n<p>You must provide the ID number of the desired user (<a href=\"http://idgettr.com/\" title=\"idgettr.com\" rel=\"nofollow ugc\">idgettr.com</a>).</p>\n<ul>\n<li><em>Group</em></li>\n</ul>\n<p>You must provide the ID number of the desired group (<a href=\"http://idgettr.com/\" title=\"idgettr.com\" rel=\"nofollow ugc\">idgettr.com</a>)</p>\n<ul>\n<li><em>Tags</em></li>\n</ul>\n<p>You must provide the desired tag(s)</p>\n<ul>\n<li><em>How many pictures to pull</em></li>\n</ul>\n<p>Between 1-500 (default is 100).</p>\n<ul>\n<li><em>Flickr Size</em></li>\n</ul>\n<p>The image size to pull &#8211; t,s,m,z,b (smallest to largest, default is z).<br />\nDetails on <a href=\"http://www.flickr.com/services/api/misc.urls.html\" title=\"flickr.com\" rel=\"nofollow ugc\">flickr.com</a></p>\n<ul>\n<li><em>Sort Images By</em></li>\n</ul>\n<p>Sort images by date posted, date taken, or interestingness (Default is Date posted).</p>\n<ul>\n<li><em>Sort Direction</em></li>\n</ul>\n<p>Select the sort direction (Default is Descending).</p>\n<ul>\n<li><em>Flickr API key</em></li>\n</ul>\n<p>You need this in order for this to work. You need to get your own at <a href=\"http://www.flickr.com/services/apps/create/\" title=\"flickr.com\" rel=\"nofollow ugc\">flickr.com</a></p>\n<p><em>Picasa</em></p>\n<p><strong>The following options are specific to the Picasa mode.</strong></p>\n<ul>\n<li><em>Picasa Source</em></li>\n</ul>\n<p>Tells Supersized which of the options to pull the images from.</p>\n<p>Album : pulls images from a Picasa album (default).</p>\n<p>User: pulls images from a user.</p>\n<p>Tags: pulls images by tag.</p>\n<ul>\n<li><em>Album</em></li>\n</ul>\n<p>You must provide the ID of the desired album. It can be found in the URL of the link to this album.</p>\n<ul>\n<li><em>User</em></li>\n</ul>\n<p>You must provide the ID number of the desired user (either you Picasa user name or the long number in the URL to your profile).</p>\n<ul>\n<li><em>Tags</em></li>\n</ul>\n<p>You must provide the desired tag(s). You may combine several tags (comma- or &#8220;+&#8221;-separated = AND, &#8220;|&#8221;-separated = OR).</p>\n<ul>\n<li><em>How many pictures to pull</em></li>\n</ul>\n<p>Between 1-500 (default is 100).</p>\n<ul>\n<li><em>Picasa Image Size</em></li>\n</ul>\n<p>The image size to pull &#8211; 512, 640, 720, 800, 1024, 1280, 1440, 1600. The Picasa API will return the largest size available if your selection is larger than the original.</p>\n<ul>\n<li><em>Sort Images By</em></li>\n</ul>\n<p>Sort images by date published or date updated (none uses default Picasa order) (Default is Date published).</p>\n<ul>\n<li><em>Sort Direction</em></li>\n</ul>\n<p>Select the sort direction (Default is Descending).</p>\n<ul>\n<li><em>Picasa Author key</em></li>\n</ul>\n<p>You need this in order for private albums to work. It can be found in the URL of the link to a private album (each album has a different author key)</p>\n<p><em>Smugmug</em></p>\n<p><strong>The following options are specific to the Smugmug mode.</strong></p>\n<ul>\n<li><em>Smugmug Source</em></li>\n</ul>\n<p>Tells Supersized which of the options to pull the images from.</p>\n<p>Keyword: pulls images by keyword.</p>\n<p>User: pulls images from a user.</p>\n<p>Gallery: pulls images from a gallery.</p>\n<p>Category: pulls images by category.</p>\n<ul>\n<li><em>Keyword</em></li>\n</ul>\n<p>Comma-separated Smugmug keywords (they are combined).</p>\n<ul>\n<li><em>User</em></li>\n</ul>\n<p>You must provide the nickname of the desired user. You may combine it with keyword(s).</p>\n<ul>\n<li><em>Gallery</em></li>\n</ul>\n<p>You must provide the ID of the desired gallery</p>\n<ul>\n<li><em>Category</em></li>\n</ul>\n<p>You must provide the desired category.</p>\n<ul>\n<li><em>How many pictures to pull</em></li>\n</ul>\n<p>Between 1-100 (default is 100). This is currently the maximum allowed by the Google Feed API used by the plugin to get the images.</p>\n<ul>\n<li><em>Smugmug Size</em></li>\n</ul>\n<p>The image size to pull &#8211; Tiny, Thumb, Small, Medium, Large, XLarge, X2Large, X3Large, Original.<br />\nDetails on <a href=\"http://help.smugmug.com/customer/portal/articles/93250\" title=\"smugmug.com\" rel=\"nofollow ugc\">help.smugmug.com</a></p>\n<ul>\n<li><em>Sort Images By</em></li>\n</ul>\n<p>Sort images by date published or date updated (none uses default Smugmug order) (Default is Date posted).</p>\n<ul>\n<li><em>Sort Direction</em></li>\n</ul>\n<p>Select the sort direction (Default is Descending).</p>\n<ul>\n<li><em>Update</em></li>\n</ul>\n<p>Click here and your options will updated!</p>\n<ul>\n<li><em>Reset</em></li>\n</ul>\n<p>To reset all WP Supersized options.<br />\n<em>Required when you change theme.</em></p>\n<h4>Thanks</h4>\n<p>A big Thank You to Sam Dunn for developing the Supersized jquery extension.</p>\n<p>Thanks to the many developers who make so much information available for those (like me) who need to learn from more experienced people.</p>\n<p>Special thanks to Joke and Sandro who helped me finding the solution to a bug present in the plugin when WordPress is installed in its own folder.</p>\n<p>Thanks to the generous donators who encourage me to develop my plugin further (and start working on new ones!) by <a href=\"http://www.worldinmyeyes.be/donate/\" title=\"Donate\" rel=\"nofollow ugc\">making a donation</a>.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wp-supersized.3.1.6.zip",
    "upgrade_notice": {
        "": "<p>Bug fix: the WP Supersized option panel in the page/post editor is functional again.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/wp-supersized/trunk/screenshot-1.png?rev=1777296",
            "caption": "Page/post specific options - You may choose the source of images for each post/page independently."
        },
        {
            "src": "https://ps.w.org/wp-supersized/trunk/screenshot-2.png?rev=1777296",
            "caption": "General options/Functionality - Define the behaviour of Supersized."
        },
        {
            "src": "https://ps.w.org/wp-supersized/trunk/screenshot-3.png?rev=1777296",
            "caption": "General options/Display - Choose where Supersized will be displayed."
        },
        {
            "src": "https://ps.w.org/wp-supersized/trunk/screenshot-4.png?rev=1777296",
            "caption": "General options/Slides source - Choose which images source should be used as default."
        },
        {
            "src": "https://ps.w.org/wp-supersized/trunk/screenshot-5.png?rev=1777296",
            "caption": "General options/Size and position - Choose how the images will be displayed."
        },
        {
            "src": "https://ps.w.org/wp-supersized/trunk/screenshot-6.png?rev=1777296",
            "caption": "General options/Components - Fine-tune the navigation controls for Supersized."
        },
        {
            "src": "https://ps.w.org/wp-supersized/trunk/screenshot-7.png?rev=1777296",
            "caption": "General options/Flickr - Enter here the details of your Flickr account and the choice of Flickr images."
        },
        {
            "src": "https://ps.w.org/wp-supersized/trunk/screenshot-8.png?rev=1777296",
            "caption": "General options/Picasa - Enter here the details of your Picasa account and the choice of Picasa images."
        },
        {
            "src": "https://ps.w.org/wp-supersized/trunk/screenshot-9.png?rev=1777296",
            "caption": "General options/Smugmug - Enter here the details of your Smugmug account and the choice of Smugmug images."
        },
        {
            "src": "https://ps.w.org/wp-supersized/trunk/screenshot-10.png?rev=1777296",
            "caption": "Example of selection of images in the post editor (individual selection for each post/page)."
        }
    ],
    "tags": {
        "background": "background",
        "flickr": "flickr",
        "full-screen": "full screen",
        "slideshow": "slideshow",
        "supersized": "supersized"
    },
    "stable_tag": "3.1.6",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/wp-supersized.1.0.zip",
        "1.1": "https://downloads.wordpress.org/plugin/wp-supersized.1.1.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/wp-supersized.1.1.1.zip",
        "1.2": "https://downloads.wordpress.org/plugin/wp-supersized.1.2.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/wp-supersized.1.2.1.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/wp-supersized.1.2.2.zip",
        "1.3": "https://downloads.wordpress.org/plugin/wp-supersized.1.3.zip",
        "1.4": "https://downloads.wordpress.org/plugin/wp-supersized.1.4.zip",
        "1.5": "https://downloads.wordpress.org/plugin/wp-supersized.1.5.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/wp-supersized.1.5.1.zip",
        "2.0": "https://downloads.wordpress.org/plugin/wp-supersized.2.0.zip",
        "3.0": "https://downloads.wordpress.org/plugin/wp-supersized.3.0.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/wp-supersized.3.0.1.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/wp-supersized.3.0.2.zip",
        "3.1": "https://downloads.wordpress.org/plugin/wp-supersized.3.1.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/wp-supersized.3.1.1.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/wp-supersized.3.1.2.zip",
        "3.1.3": "https://downloads.wordpress.org/plugin/wp-supersized.3.1.3.zip",
        "3.1.4": "https://downloads.wordpress.org/plugin/wp-supersized.3.1.4.zip",
        "3.1.5": "https://downloads.wordpress.org/plugin/wp-supersized.3.1.5.zip",
        "3.1.6": "https://downloads.wordpress.org/plugin/wp-supersized.3.1.6.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wp-supersized.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "http://www.worldinmyeyes.be/donate/",
    "banners": [],
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/wp-supersized.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 82,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}