{
    "name": "WP Super Cache",
    "slug": "wp-super-cache",
    "version": "1.12.4",
    "author": "<a href=\"https://automattic.com/\">Automattic</a>",
    "author_profile": "https://profiles.wordpress.org/automattic/",
    "contributors": {
        "donncha": {
            "profile": "https://profiles.wordpress.org/donncha/",
            "avatar": "https://secure.gravatar.com/avatar/16948ebfefe9542f4e75dc58be4a9d1b?s=96&d=monsterid&r=g",
            "display_name": "Donncha O Caoimh (a11n)"
        },
        "automattic": {
            "profile": "https://profiles.wordpress.org/automattic/",
            "avatar": "https://secure.gravatar.com/avatar/687b3bf96c41800814e3b93766444283?s=96&d=monsterid&r=g",
            "display_name": "Automattic"
        },
        "adnan007": {
            "profile": "https://profiles.wordpress.org/adnan007/",
            "avatar": "https://secure.gravatar.com/avatar/e73c18d1192111e4a6883b1463813b0d?s=96&d=monsterid&r=g",
            "display_name": "Adnan Haque (a11n)"
        },
        "dilirity": {
            "profile": "https://profiles.wordpress.org/dilirity/",
            "avatar": "https://secure.gravatar.com/avatar/64c49aafa246ed957e88f225ecc93ffe?s=96&d=monsterid&r=g",
            "display_name": "Pete (a11n)"
        },
        "mikemayhem3030": {
            "profile": "https://profiles.wordpress.org/mikemayhem3030/",
            "avatar": "https://secure.gravatar.com/avatar/427debf090520b242b69675de741951e?s=96&d=monsterid&r=g",
            "display_name": "Mike Stott"
        },
        "pyronaur": {
            "profile": "https://profiles.wordpress.org/pyronaur/",
            "avatar": "https://secure.gravatar.com/avatar/03b0a5aba0811bbf0d5840058d35ea6c?s=96&d=monsterid&r=g",
            "display_name": "pyronaur (a11n)"
        },
        "thingalon": {
            "profile": "https://profiles.wordpress.org/thingalon/",
            "avatar": "https://secure.gravatar.com/avatar/36ab4d50de93d5c87c06ce192eae6ae7?s=96&d=monsterid&r=g",
            "display_name": "Mark (a11n)"
        }
    },
    "requires": "6.5",
    "tested": "6.6.1",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 86,
    "ratings": {
        "5": 984,
        "4": 107,
        "3": 47,
        "2": 23,
        "1": 173
    },
    "num_ratings": 1334,
    "support_url": "https://wordpress.org/support/plugin/wp-super-cache/",
    "support_threads": 26,
    "support_threads_resolved": 19,
    "active_installs": 1000000,
    "downloaded": 54592214,
    "last_updated": "2024-07-17 17:05:00",
    "added": "2007-11-05",
    "homepage": "https://wordpress.org/plugins/wp-super-cache/",
    "sections": {
        "description": "<p>This plugin generates static html files from your dynamic WordPress blog.  After a html file is generated your webserver will serve that file instead of processing the comparatively heavier and more expensive WordPress PHP scripts.</p>\n<p>The static html files will be served to the vast majority of your users:</p>\n<ul>\n<li>Users who are not logged in.</li>\n<li>Users who have not left a comment on your blog.</li>\n<li>Or users who have not viewed a password protected post.</li>\n</ul>\n<p>99% of your visitors will be served static html files. One cached file can be served thousands of times. Other visitors will be served custom cached files tailored to their visit. If they are logged in, or have left comments those details will be displayed and cached for them.</p>\n<p>The plugin serves cached files in 3 ways (ranked by speed):</p>\n<ol>\n<li>Expert. The fastest method is by using Apache mod_rewrite (or whatever similar module your web server supports) to serve &#8220;supercached&#8221; static html files. This completely bypasses PHP and is extremely quick. If your server is hit by a deluge of traffic it is more likely to cope as the requests are &#8220;lighter&#8221;. This does require the Apache mod_rewrite module (which is probably installed if you have custom permalinks) and a modification of your .htaccess file which is risky and may take down your site if modified incorrectly.</li>\n<li>Simple. Supercached static files can be served by PHP and this is the recommended way of using the plugin. The plugin will serve a &#8220;supercached&#8221; file if it exists and it&#8217;s almost as fast as the mod_rewrite method. It&#8217;s easier to configure as the .htaccess file doesn&#8217;t need to be changed. You still need a custom permalink. You can keep portions of your page dynamic in this caching mode.</li>\n<li>WP-Cache caching. This is mainly used to cache pages for known users, URLs with parameters and feeds. Known users are logged in users, visitors who leave comments or those who should be shown custom per-user data. It&#8217;s the most flexible caching method and slightly slower. WP-Cache caching will also cache visits by unknown users if supercaching is disabled. You can have dynamic parts to your page in this mode too. This mode is always enabled but you can disable caching for known users, URLs with parameters, or feeds separately. Set the constant &#8220;DISABLE_SUPERCACHE&#8221; to 1 in your wp-config.php if you want to only use WP-Cache caching.</li>\n</ol>\n<p>If you&#8217;re not comfortable with editing PHP files then use simple mode. It&#8217;s easy to set up and very fast.</p>\n<h3>Recommended Settings</h3>\n<ol>\n<li>Simple caching.</li>\n<li>Compress pages.</li>\n<li>Don&#8217;t cache pages for known users.</li>\n<li>Cache rebuild.</li>\n<li>CDN support.</li>\n<li>Extra homepage checks.</li>\n</ol>\n<p>Garbage collection is the act of cleaning up cache files that are out of date and stale. There&#8217;s no correct value for the expiry time but a good starting point is 1800 seconds.</p>\n<p>Consider deleting the contents of the &#8220;Rejected User Agents&#8221; text box and allow search engines to cache files for you.</p>\n<p>Preload as many posts as you can and enable &#8220;Preload Mode&#8221;. Garbage collection of old cached files will be disabled. If you don&#8217;t care about sidebar widgets updating often set the preload interval to 2880 minutes (2 days) so all your posts aren&#8217;t recached very often. When the preload occurs the cache files for the post being refreshed is deleted and then regenerated. Afterwards a garbage collection of all old files is performed to clean out stale cache files.<br />\nEven with preload mode enabled cached files will still be deleted when posts are modified or comments made.</p>\n<h3>Development</h3>\n<ul>\n<li>Active development of this plugin is handled <a href=\"https://github.com/Automattic/wp-super-cache\" rel=\"nofollow ugc\">on GitHub</a>.</li>\n<li>Translation of the plugin into different languages is on the <a href=\"https://translate.wordpress.org/projects/wp-plugins/wp-super-cache\" rel=\"nofollow ugc\">translation page</a>.</li>\n</ul>\n<h3>Documentation</h3>\n<p>If you need more information than the following, you can have a look at <a href=\"https://github.com/Automattic/wp-super-cache/wiki\" rel=\"nofollow ugc\">the wiki</a> or the <a href=\"https://odd.blog/wp-super-cache-developers/\" rel=\"nofollow ugc\">Developer documentation</a>.</p>\n<h4>Preloading</h4>\n<p>You can generate cached files for the posts, categories and tags of your site by preloading. Preloading will visit each page of your site generating a cached page as it goes along, just like any other visitor to the site. Due to the sequential nature of this function, it can take some time to preload a complete site if there are many posts.<br />\nTo make preloading more effective it can be useful to disable garbage collection so that older cache files are not deleted. This is done by enabling &#8220;Preload Mode&#8221; in the settings. Be aware however, that pages will go out of date eventually but that updates by submitting comments or editing posts will clear portions of the cache.</p>\n<h4>Garbage Collection</h4>\n<p>Your cache directory fills up over time, which takes up space on your server. If space is limited or billed by capacity, or if you worry that the cached pages of your site will go stale then garbage collection has to be done. Garbage collection happens on a regular basis and deletes old files in the cache directory. On the advanced settings page you can specify:<br />\n1. Cache timeout. How long cache files are considered fresh for. After this time they are stale and can be deleted.<br />\n2. Scheduler. Setup how often garbage collection should be done.<br />\n3. Notification emails. You can be informed on garbage collection job progress.<br />\nThere&#8217;s no right or wrong settings for garbage collection. It depends on your own site.<br />\nIf your site gets regular updates, or comments then set the timeout to 1800 seconds, and set the timer to 600 seconds.<br />\nIf your site is mostly static you can disable garbage collection by entering 0 as the timeout, or use a really large timeout value.</p>\n<p>The cache directory, usually wp-content/cache/ is only for temporary files. Do not ever put important files or symlinks to important files or directories in that directory. They will be deleted if the plugin has write access to them.</p>\n<h4>CDN</h4>\n<p>A Content Delivery Network (CDN) is usually a network of computers situated around the world that will serve the content of your website faster by using servers close to you. Static files like images, Javascript and CSS files can be served through these networks to speed up how fast your site loads. You can also create a &#8220;poor man&#8217;s CDN&#8221; by using a sub domain of your domain to serve static files too.</p>\n<p><a href=\"https://wordpress.org/plugins/ossdl-cdn-off-linker/\" rel=\"ugc\">OSSDL CDN off-linker</a> has been integrated into WP Super Cache to provide basic CDN support. It works by rewriting the URLs of files (excluding .php files) in wp-content and wp-includes on your server so they point at a different hostname. Many CDNs support <a href=\"https://www.google.com/search?hl=en&amp;q=%22origin+pull%22\" rel=\"nofollow ugc\">origin pull</a>. This means the CDN will download the file automatically from your server when it&#8217;s first requested, and will continue to serve it for a configurable length of time before downloading it again from your server.</p>\n<p>Configure this on the &#8220;CDN&#8221; tab of the plugin settings page. This is an advanced technique and requires a basic understanding of how your webserver or CDNs work. Please be sure to clear the file cache after you configure the CDN.</p>\n<h4>REST API</h4>\n<p>There are now REST API endpoints for accessing the settings of this plugin. You&#8217;ll need to be authenticated as an admin user with permission to view the settings page to use it. This has not been documented yet but you can find all the code that deals with this in the &#8220;rest&#8221; directory.</p>\n<h4>Custom Caching</h4>\n<p>It is now possible to hook into the caching process using the add_cacheaction() function.</p>\n<p>Three hooks are available:</p>\n<ol>\n<li>&#8216;wp_cache_get_cookies_values&#8217; &#8211; modify the key used by WP Cache.</li>\n<li>&#8216;add_cacheaction&#8217; &#8211; runs in phase2. Allows a plugin to add WordPress hooks.</li>\n<li>&#8216;cache_admin_page&#8217; &#8211; runs in the admin page. Use it to modify that page, perhaps by adding new configuration options.</li>\n</ol>\n<p>There is one regular WordPress filter too. Use the &#8220;do_createsupercache&#8221; filter<br />\nto customize the checks made before caching. The filter accepts one parameter.<br />\nThe output of WP-Cache&#8217;s wp_cache_get_cookies_values() function.</p>\n<p>WP Super Cache has its own plugin system. This code is loaded when WP Super Cache loads and can be used to change how caching is done. This is before most of WordPress loads so some functionality will not be available. Plugins can be located anywhere that PHP can load them. Add your own plugin either:</p>\n<ul>\n<li>by putting your plugin in the wp-content/plugins/wp-super-cache-plugins directory, or</li>\n<li>by calling wpsc_add_plugin( $name ) where $name is the full filename and path to the plugin. You only need to call that function once to add it. Use wpsc_delete_plugin( $name ) to remove it from the list of loaded plugins.</li>\n</ul>\n<p>The cookies WP Super Cache uses to identify &#8220;known users&#8221; can be modified now by adding the names of those cookies to a list in the plugin configuration. Use wpsc_add_cookie( $name ) to add a new cookie, and wpsc_delete_cookie( $name ) to remove it. The cookie names also modify the mod_rewrite rules used by the plugin but I recommend using Simple mode caching to avoid complications with updating the .htaccess file.<br />\nThe cookie name and value are used to differenciate users so you can have one cookie, but different values for each type of user on your site for example. They&#8217;ll be served different cache files.</p>\n<p>See <a href=\"https://github.com/Automattic/wp-super-cache/blob/4cda5c0f2218e40e118232b5bf22d227fb3206b7/plugins/searchengine.php\" rel=\"nofollow ugc\">plugins/searchengine.php</a> as an example I use for my <a href=\"https://odd.blog/no-adverts-for-friends/\" rel=\"nofollow ugc\">No Adverts for Friends</a> plugin.</p>\n<h3>Troubleshooting</h3>\n<p>If things don&#8217;t work when you installed the plugin here are a few things to check:</p>\n<ol>\n<li>Is wp-content writable by the web server?</li>\n<li>Is there a wp-content/wp-cache-config.php ? If not, copy the file wp-super-cache/wp-cache-config-sample.php to wp-content/wp-cache-config.php and make sure WPCACHEHOME points at the right place.</li>\n<li>Is there a wp-content/advanced-cache.php ? If not, then you must copy wp-super-cache/advanced-cache.php into wp-content/. You must edit the file and change the path so it points at the wp-super-cache folder.</li>\n<li>If pages are not cached at all, remove wp-content/advanced-cache.php and recreate it, following the advice above.</li>\n<li>\n<p>Make sure the following line is in wp-config.php and it is ABOVE the &#8220;require_once(ABSPATH.&#8217;wp-settings.php&#8217;);&#8221; line:</p>\n<pre><code>define( 'WP_CACHE', true );\n</code></pre>\n</li>\n<li>Try the Settings-&gt;WP Super Cache page again and enable cache.</li>\n<li>Look in wp-content/cache/supercache/. Are there directories and files there?</li>\n<li>Anything in your php error_log?</li>\n<li>If your browser keeps asking you to save the file after the super cache is installed you must disable Super Cache compression. Go to the Settings-&gt;WP Super Cache page and disable it there.</li>\n<li>The plugin does not work very well when PHP&#8217;s safe mode is active. This must be disabled by your administrator.</li>\n<li>If pages are randomly super cached and sometimes not, your blog can probably be viewed with and without the &#8220;www&#8221; prefix on the URL. You should choose one way and install the <a href=\"http://txfx.net/code/wordpress/enforce-www-preference/\" rel=\"nofollow ugc\">Enforce www preference</a> plugin if you are using an old WordPress install. The latest versions redirect themselves (you should always be running the latest version of WordPress anyway!)</li>\n<li>Private Server users at Dreamhost should edit wp-content/wp-cache-config.php and set the cache dir to &#8220;/tmp/&#8221; if they are getting errors about increasing CPU usage. See this <a href=\"https://wordpress.org/support/topic/145895?replies=42\" rel=\"ugc\">discussion</a> for more.</li>\n<li>File locking errors such as &#8220;failed to acquire key 0x152b: Permission denied in&#8230;&#8221; or &#8220;Page not cached by WP Super Cache. Could not get mutex lock.&#8221; are a sign that you may have to use file locking. Edit wp-content/wp-cache-config.php and uncomment &#8220;$use_flock = true&#8221; or set $sem_id to a different value. You can also disable file locking from the Admin screen as a last resort.</li>\n<li>Make sure cache/wp_cache_mutex.lock is writable by the web server if using coarse file locking.</li>\n<li>The cache folder cannot be put on an NFS or Samba or NAS share. It has to be on a local disk. File locking and deleting expired files will not work properly unless the cache folder is on the local machine.</li>\n<li>\n<p>Garbage collection of old cache files won&#8217;t work if WordPress can&#8217;t find wp-cron.php. If your hostname resolves to 127.0.0.1 it could be preventing the garbage collection from working. Check your access_logs for wp-cron.php entries. Do they return a 404 (file not found) or 200 code? If it&#8217;s 404 or you don&#8217;t see wp-cron.php anywhere WordPress may be looking for that script in the wrong place. You should speak to your server administator to correct this or edit /etc/hosts on Unix servers and remove the following line. Your hostname must resolve to the external IP address other servers on the network/Internet use. See http://yoast.com/wp-cron-issues/ for more. A line like &#8220;127.0.0.1 localhost localhost.localdomain&#8221; is ok.</p>\n<pre><code>127.0.0.1 example.com\n</code></pre>\n</li>\n<li>If old pages are being served to your visitors via the supercache, you may be missing Apache modules (or their equivalents if you don&#8217;t use Apache). 3 modules are required: mod_mime, mod_headers and mod_expires. The last two are especially important for making sure browsers load new versions of existing pages on your site.</li>\n<li>The error message, &#8220;WP Super Cache is installed but broken. The path to wp-cache-phase1.php in wp-content/advanced-cache.php must be fixed!&#8221; appears at the end of every page. Open the file wp-content/advanced-cache.php in your favourite editor. Is the path to wp-cache-phase1.php correct? This file will normally be in wp-content/plugins/wp-super-cache/. If it is not correct the caching engine will not load.</li>\n<li>Caching doesn&#8217;t work. The timestamp on my blog keeps changing when I reload. Check that the path in your .htaccess rules matches where the supercache directory is. You may have to hardcode it. Try disabling supercache mode.</li>\n<li>\n<p>If supercache cache files are generated but not served, check the permissions on all your wp-content/cache/supercache folders (and each of wp-content cache and supercache folders) and wp-content/cache/.htaccess. If your PHP runs as a different user to Apache and permissions are strict Apache may not be able to read the PHP generated cache files. To fix you must add the following line to your wp-config.php (Add it above the WP_CACHE define.) Then clear your cache.</p>\n<pre><code>umask( 0022 );\n</code></pre>\n</li>\n<li>\n<p>If you see garbage in your browser after enabling compression in the plugin, compression may already be enabled in your web server. In Apache you must disable mod_deflate, or in PHP zlib compression may be enabled. You can disable that in three ways. If you have root access, edit your php.ini and find the zlib.output_compression setting and make sure it&#8217;s &#8220;Off&#8221; or add this line to your .htaccess:</p>\n<pre><code>php_flag zlib.output_compression off\n</code></pre>\n<p>If that doesn&#8217;t work, add this line to your wp-config.php:</p>\n<pre><code>ini_set('zlib.output_compression', 0);\n</code></pre>\n</li>\n<li>The &#8220;white screen of death&#8221; or a blank page  when you visit your site is almost always caused by a PHP error but <a href=\"http://www.johnberns.com/2010/03/19/wp-super-cache-blank-page-problem-fixed/\" rel=\"nofollow ugc\">it may also be caused by APC</a>. Disable that PHP extension if you have trouble and replace with eAccelerator or Xcache.</li>\n<li>After uninstalling, your permalinks may break if you remove the WordPress mod_rewrite rules too. Regenerate those rules by visiting the Settings-&gt;Permalink page and saving that form again.</li>\n<li>If your blog refuses to load make sure your wp-config.php is correct. Are you missing an opening or closing PHP tag?</li>\n<li>Your front  &hellip;</li>\n</ol>\n",
        "installation": "<p>Install like any other plugin, directly from your plugins page but make sure you have custom permalinks enabled. Go to the plugin settings page at Settings-&gt;WP Super Cache and enable caching.</p>\n<h3>How to uninstall WP Super Cache</h3>\n<p>Almost all you have to do is deactivate the plugin on the plugins page. The plugin should clean up most of the files it created and modified, but it doesn&#8217;t as yet remove the mod_rewrite rules from the .htaccess file. Look for the section in that file marked by SuperCache BEGIN and END tags. The plugin doesn&#8217;t remove those because some people add the WordPress rules in that block too.</p>\n<p>To manually uninstall:</p>\n<ol>\n<li>Turn off caching on the plugin settings page and clear the cache.</li>\n<li>Deactivate the plugin on the plugins page.</li>\n<li>Remove the WP_CACHE define from wp-config.php. It looks like <code>define( 'WP_CACHE', true );</code></li>\n<li>Remove the Super Cache mod_rewrite rules from your .htaccess file.</li>\n<li>Remove the files wp-content/advanced-cache.php and wp-content/wp-cache-config.php</li>\n<li>Remove the directory wp-content/cache/</li>\n<li>Remove the directory wp-super-cache from your plugins directory.</li>\n</ol>\n<h3>If all else fails and your site is broken</h3>\n<ol>\n<li>Remove the WP_CACHE define from wp-config.php. It looks like <code>define( 'WP_CACHE', true );</code></li>\n<li>Remove the rules (see above) that the plugin wrote to the .htaccess file in your root directory.</li>\n<li>Delete the wp-super-cache folder in the plugins folder.</li>\n<li>Optionally delete advanced-cache.php, wp-cache-config.php and the cache folder in wp-content/.</li>\n</ol>\n",
        "faq": "\n<dt id='how%20do%20i%20know%20my%20blog%20is%20being%20cached%3F'>\nHow do I know my blog is being cached?\n</h4>\n<p>\n<p>Go to Settings -&gt; WP Super Cache and look for the &#8220;Cache Tester&#8221; form on the easy settings page. Click &#8220;Test Cache&#8221; and the plugin will request the front page of the site twice, comparing a timestamp on each to make sure they match.</p>\n<p>If you want to do it manually, enable debugging in the plugin settings page and load the log file in a new browser tab. Then view your blog while logged in and logged out. You should see activity in the log. View the source of any page on your site. When a page is first created, you&#8217;ll see the text &#8220;Dynamic page generated in XXXX seconds.&#8221; and &#8220;Cached page generated by WP-Super-Cache on YYYY-MM-DD HH:MM:SS&#8221; at the end of the source code. On reload, a cached page will show the same timestamp so wait a few seconds before checking.<br />\nIf Supercaching is disabled and you have compression enabled, the text &#8220;Compression = gzip&#8221; will be added. If compression is disabled and the page is served as a static html file, the text &#8220;super cache&#8221; will be added. The only other way to check if your cached file was served by PHP script or from the static cache is by looking at the HTTP headers. PHP cached pages will have the header &#8220;WP-Super-Cache: Served supercache file from PHP&#8221;. WPCache cached files will have the header, &#8220;WP-Super-Cache: Served WPCache cache file&#8221;. You should also check your cache directory in wp-content/cache/supercache/hostname/ for static cache files.<br />\nIf the plugin rules are missing from your .htaccess file, the plugin will attempt to serve the super cached page if it&#8217;s found. The header &#8220;WP-Super-Cache: Served supercache file from PHP&#8221; if this happens.<br />\nThe pagespeed module for Apache may cause problems when testing. Disable it if you notice any problems running the cache tester.</p>\n</p>\n<dt id='how%20do%20i%20disable%20supercaching%3F'>\nHow do I disable Supercaching?\n</h4>\n<p>\n<p>If you only want to use the WP-Cache engine then edit your wp-config.php or create an mu-plugin that sets the constant &#8216;DISABLE_SUPERCACHE&#8217; to 1.</p>\n</p>\n<dt id='wp-cache%20vs%20supercache%20files'>\nWP-Cache vs Supercache files\n</h4>\n<p>\n<p>All cache files are stored in wp-content/cache/supercache/HOSTNAME/ where HOSTNANE is your domain name. The files are stored in directories matching your site&#8217;s permalink structure. Supercache files are index.html or some variant of that, depending on what type of visitor hit the blog. Other files are named wp-cache-XXXXXXXXXXXXXXXXX.php. Associated meta filesnames start with &#8220;meta&#8221;. Those files contain information about the cached file. These files are generated by the &#8220;WPCache caching&#8221; engine in the plugin.</p>\n</p>\n<dt id='will%20comments%20and%20other%20dynamic%20parts%20of%20my%20blog%20update%20immediately%3F'>\nWill comments and other dynamic parts of my blog update immediately?\n</h4>\n<p>\n<p>Comments will show as soon as they are moderated, depending on the comment policy of the blog owner. Other dynamic elements on a page may not update unless they are written in Javascript, Flash, Java or another client side browser language. The plugin really produces static html pages. No PHP is executed when those pages are served. &#8220;Popularity Contest&#8221; is one such plugin that will not work.</p>\n</p>\n<dt id='will%20the%20super%20cache%20compression%20slow%20down%20my%20server%3F'>\nWill the Super Cache compression slow down my server?\n</h4>\n<p>\n<p>No, it will do the opposite. Super Cache files are compressed and stored that way so the heavy compression is done only once. These files are generally much smaller and are sent to a visitor&#8217;s browser much more quickly than uncompressed html. As a result, your server spends less time talking over the network which saves CPU time and bandwidth, and can also serve the next request much more quickly.</p>\n</p>\n<dt id='how%20do%20i%20make%20certain%20parts%20of%20the%20page%20stay%20dynamic%3F'>\nHow do I make certain parts of the page stay dynamic?\n</h4>\n<p>\n<p>Note: this functionality is disabled by default. You will have to enable it on the Advanced Settings page.</p>\n<p>There are 2 ways of doing this. You can use Javascript to draw the part of the page you want to keep dynamic. That&#8217;s what Google Adsense and many widgets from external sites do and is the recommended way. Or you can use a WP Super Cache filter to do the job but you can&#8217;t use mod_rewrite mode caching. You have to use the &#8220;simple&#8221; delivery method or disable supercaching.</p>\n<p>WP Super Cache 1.4 introduced a cacheaction filter called wpsc_cachedata. The cached page to be displayed goes through this filter and allows modification of the page. If the page contains a placeholder tag the filter can be used to replace that tag with your dynamically generated html.<br />\nThe function that hooks on to the wpsc_cachedata filter should be put in a file in the WP Super Cache plugins folder unless you use the late_init feature. An example plugin is included. Edit <a href=\"http://svn.wp-plugins.org/wp-super-cache/trunk/plugins/dynamic-cache-test.php\" rel=\"nofollow ugc\">dynamic-cache-test.php</a> to see the example code.<br />\nThere are two example functions there. There&#8217;s a simple function that replaces a string (or tag) you define when the cached page is served. The other example function uses an output buffer to generate the dynamic content. Due to a limitation in how PHP works the output buffer code MUST run before the wpsc_cachedata filter is hit, at least for when a page is cached. It doesn&#8217;t matter when serving cached pages. See <a href=\"https://odd.blog/y/6j\" rel=\"nofollow ugc\">this post</a> for a more technical and longer explanation.<br />\nTo execute WordPress functions you must enable the &#8216;Late init&#8217; feature on the advanced settings page.</p>\n</p>\n<dt id='how%20do%20i%20delay%20serving%20the%20cache%20until%20the%20%22init%22%20action%20fires%3F'>\nHow do I delay serving the cache until the &#8220;init&#8221; action fires?\n</h4>\n<p>\n<p>Cached files are served before almost all of WordPress is loaded. While that&#8217;s great for performance it&#8217;s a pain when you want to extend the plugin using a core part of WordPress. Enable &#8216;Late init&#8217; mode on the Advanced settings page and cached files will be served when &#8220;init&#8221; fires. WordPress and it&#8217;s plugins will be loaded now.</p>\n</p>\n<dt id='why%20don%27t%20wp%20useronline%2C%20popularity%20contest%2C%20wp%20postratings%20or%20plugin%20x%20not%20work%20or%20update%20on%20my%20blog%20now%3F'>\nWhy don&#8217;t WP UserOnline, Popularity Contest, WP Postratings or plugin X not work or update on my blog now?\n</h4>\n<p>\n<p>This plugin caches entire pages but some plugins think they can run PHP code every time a page loads. To fix this, the plugin needs to use Javascript/AJAX methods or the wpsc_cachedata filter described in the previous answer to update or display dynamic information.</p>\n</p>\n<dt id='why%20do%20my%20wp%20super%20cache%20plugins%20disappear%20when%20i%20upgrade%20the%20plugin%3F'>\nWhy do my WP Super Cache plugins disappear when I upgrade the plugin?\n</h4>\n<p>\n<p>WordPress deletes the plugin folder when it updates a plugin. This is the same with WP Super Cache so any modified files in wp-super-cache/plugins/ will be deleted. You can put your custom plugins in a different directory in a number of ways. You can define the variable $wp_cache_plugins_dir in wp-config.php or wp-content/wp-cache-config.php and point it at a directory outside of the wp-super-cache folder. The plugin will look there for it&#8217;s plugins. Or if you distribute a plugin that needs to load early you can use the function <code>wpsc_add_plugin( $filename )</code> to add a new plugin wherever it may be. Use <code>wpsc_delete_plugin( $filename )</code> to remove the plugin file. See <a href=\"https://github.com/Automattic/wp-super-cache/pull/574/\" rel=\"nofollow ugc\">#574</a> or <a href=\"https://odd.blog/2017/10/25/writing-wp-super-cache-plugins/\" rel=\"nofollow ugc\">this post</a> on writing WP Super Cache plugins.</p>\n</p>\n<dt id='what%20does%20the%20cache%20rebuild%20feature%20do%3F'>\nWhat does the Cache Rebuild feature do?\n</h4>\n<p>\n<p>When a visitor leaves a comment the cached file for that page is deleted and the next visitor recreates the cached page. A page takes time to load so what happens if it receives 100 visitors during this time? There won&#8217;t be a cached page so WordPress will serve a fresh page for each user and the plugin will try to create a cached page for each of those 100 visitors causing a huge load on your server. This feature stops this happening. The cached page is not cleared when a comment is left. It is marked for rebuilding instead. The next visitor within the next 10 seconds will regenerate the cached page while the old page is served to the other 99 visitors. The page is eventually loaded by the first visitor and the cached page updated. See <a href=\"https://odd.blog/2009/01/23/wp-super-cache-089/\" rel=\"nofollow ugc\">this post</a> for more.</p>\n</p>\n<dt id='why%20doesn%27t%20the%20plugin%20cache%20requests%20by%20search%20engine%20bots%20by%20default%3F'>\nWhy doesn&#8217;t the plugin cache requests by search engine bots by default?\n</h4>\n<p>\n<p>Those bots usually only visit each page once and if the page is not popular there&#8217;s no point creating a cache file that will sit idle on your server. However you can allow these visits to be cached by removing the list of bots from &#8220;Rejected User Agents&#8221; on the Advanced settings page.</p>\n</p>\n<dt id='a%20category%20page%20is%20showing%20instead%20of%20my%20homepage'>\nA category page is showing instead of my homepage\n</h4>\n<p>\n<p>A tiny proportion of websites will have problems with the following configuration:</p>\n<ol>\n<li>Uses a static page for the front page.</li>\n<li>Uses /%category%/%postname%/ permalink structure.</li>\n</ol>\n<p>Sometimes a category page is cached as the homepage of the site instead of the static page. I can&#8217;t <a href=\"https://wordpress.org/support/topic/237415/page/2?replies=38\" rel=\"ugc\">replicate the problem</a> but a simple solution is to use the &#8220;Simple&#8221; mode. You can also enable &#8220;Extra homepage checks&#8221; on the Advanced Settings page.</p>\n</p>\n<dt id='why%20do%20i%20get%20warnings%20about%20caching%20from%20http%3A%2F%2Fismyblogworking.com%2F'>\nWhy do I get warnings about caching from http://ismyblogworking.com/\n</h4>\n<p>\n<p>&#8220;Your blog doesn&#8217;t support client caching (no 304 response to If-modified-since).&#8221;<br />\n&#8220;Your feed doesn&#8217;t support caching (no 304 response to If-modified-since)&#8221;</p>\n<p>Supercache doesn&#8217;t support 304 header checks in Expert mode but does support it in Simple mode. This is caching done by your browser, not the server. It is a check your browser does to ask the server if an updated version of the current page is available. If not, it doesn&#8217;t download the old version again. The page is still cached by your server, just not by your visitors&#8217; browsers.<br />\nTry the Cacheability Engine at http://www.ircache.net/cgi-bin/cacheability.py or https://redbot.org/ for further analysis.</p>\n</p>\n<dt id='how%20should%20i%20best%20use%20the%20utm_source%20tracking%20tools%20in%20google%20analytics%20with%20this%20plugin%3F'>\nHow should I best use the utm_source tracking tools in Google Analytics with this plugin?\n</h4>\n<p>\n<p>That tracking adds a query string to each url linked from various sources like Twitter and feedreaders. Unfortunately it stops pages being supercached. See <a href=\"https://odd.blog/remove-unused-utmsource-urls/#comment-672813\" rel=\"nofollow ugc\">Joost&#8217;s comment here</a> for how to turn it into an anchor tag which can be supercached.</p>\n</p>\n<dt id='the%20plugin%20complains%20that%20wp-content%20is%20writable%21%20htdocs%20is%20writable%21'>\nThe plugin complains that wp-content is writable! htdocs is writable!\n</h4>\n<p>\n<p>It&#8217;s not good when the web server can write to these directories but sometimes shared hosting accounts are set up in this way to make administration easier. Use <code>chmod 755 directory</code> to fix the permissions or find the permissions section of your ftp client. This <a href=\"https://www.google.com/search?sourceid=chrome&amp;ie=UTF-8&amp;q=ftp+fix+directory+permissions+755\" rel=\"nofollow ugc\">Google search</a> will lead you to more information on this topic and there&#8217;s also <a href=\"https://codex.wordpress.org/Changing_File_Permissions\" rel=\"nofollow ugc\">this codex page</a> too. Unfortunately some hosts require that those directories be writable. If that&#8217;s the case just ignore this warning.</p>\n</p>\n<dt id='how%20do%20i%20delete%20the%20wp_cache%20define%20from%20wp-config.php%3F'>\nHow do I delete the WP_CACHE define from wp-config.php?\n</h4>\n<p>\n<p>Load your desktop ftp client and connect to your site. Navigate to the root (or the directory below it) of your site where you&#8217;ll find wp-config.php. Download that file and edit it in a text editor. Delete the line <code>define( 'WP_CACHE', true );</code> and save the file. Now upload it, overwriting the wp-config.php on your server.</p>\n</p>\n<dt id='how%20do%20i%20delete%20the%20super%20cache%20rules%20from%20the%20.htaccess%20file%3F'>\nHow do I delete the Super Cache rules from the .htaccess file?\n</h4>\n<p>\n<p>Load your desktop ftp client and connect to your site. You may need to enable &#8220;Show hidden files&#8221; in the preferences of the ftp client. Navigate to the root of your site where you&#8217;ll find the .htaccess file. Download that file and edit it in a text editor. Delete the lines between &#8220;# BEGIN WPSuperCache&#8221; and &#8220;# END WPSuperCache&#8221; and save the file. Now upload it, overwriting the .htaccess file on your server.</p>\n</p>\n<dt id='how%20do%20i%20change%20file%20permissions%3F'>\nHow do I change file permissions?\n</h4>\n<p>\n<p>This <a href=\"https://codex.wordpress.org/Changing_File_Permissions\" rel=\"nofollow ugc\">page</a> on the WordPress Codex explains everything you need to know about file permissions on your server and various ways of changing them.</p>\n</p>\n<dt id='why%20do%20i%20get%20load%20spikes%20when%20new%20posts%20are%20made%3F'>\nWhy do I get load spikes when new posts are made?\n</h4>\n<p>\n<p>You may have the &#8220;clear all cached files when new posts are made&#8221; option set. Clearing those files can take time plus your visitors will now be visiting uncached pages. Are you using Google Analytics campaign tracking with utm_source in the url? Those pages aren&#8217;t cached. See the question, &#8220;How should I best use the utm_source tracking tools in Google Analytics with this plugin&#8221; above for how to use them properly.<br />\nCached pages have to be refreshed when posts are made. Perhaps your server just isn&#8217;t up to the job of serving the amount of traffic you get. Enable the &#8220;cache rebuild&#8221; feature as that may help.</p>\n</p>\n<dt id='how%20many%20pages%20can%20i%20cache%3F'>\nHow many pages can I cache?\n</h4>\n<p>\n<p>The only real limit are limits defined by your server. For example, EXT2 and EXT3 allow a maximum of 31,999 sub directories so if you have a flat permalink structure (like /%POSTNAME%/) and more than 32,000 posts you may run into problems. Likewise, if you run a multisite network and have more than 31,999 sites (blogs) you won&#8217;t be able to cache all of them. Realistically if you had that many active sites you wouldn&#8217;t be running on one server.</p>\n</p>\n<dt id='i%20can%20see%20that%20the%20www%20version%20of%20my%20site%20is%20cached%20separately.%20how%20do%20i%20stop%20that%3F'>\nI can see that the www version of my site is cached separately. How do I stop that?\n</h4>\n<p>\n<p>WordPress should redirect to the canonical URL of your site but if it doesn&#8217;t, add this to your .htaccess above the Supercache and WordPress rules. Change example.com to your own hostname.<br />\n    RewriteCond %{HTTP_HOST} www.example.com$ [NC]<br />\n    RewriteRule ^(.*)$ https://example.com/$1 [L,R=301]</p>\n</p>\n<dt id='how%20do%20i%20serve%20cached%20mobile%20pages%20to%20clients%20on%20small%20screens%20like%20phones%20and%20tablets%3F'>\nHow do I serve cached mobile pages to clients on small screens like phones and tablets?\n</h4>\n<p>\n<p>Your theme is probably responsive which means it resizes the page to suit whatever device is displaying the page. If it&#8217;s not responsive, you&#8217;ll have to use a separate mobile plugin to render a page formatted for those visitors. The following plugins have been tested but YMMV depending on mobile client. You&#8217;ll have to enable mobile browser support as well on the Advanced settings page.</p>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/jetpack/\" rel=\"ugc\">Jetpack&#8217;s Mobile Theme Module</a></li>\n<li><a href=\"https://wordpress.org/plugins/wptouch/\" rel=\"ugc\">WPTouch</a></li>\n<li><a href=\"https://wordpress.org/plugins/wordpress-mobile-edition/\" rel=\"ugc\">WordPress Mobile Edition</a></li>\n<li><a href=\"https://wordpress.org/plugins/wordpress-mobile-pack/\" rel=\"ugc\">WordPress Mobile Pack</a> (can&#8217;t have &#8220;Don&#8217;t cache pages for known users.&#8221; enabled)</li>\n</ul>\n</p>\n\n",
        "changelog": "<h3>1.12.4 &#8211; 2024-07-17</h3>\n<h4>Removed</h4>\n<ul>\n<li>General: update WordPress version requirements to WordPress 6.5.</li>\n</ul>\n<h4>Fixed</h4>\n<ul>\n<li>Fixed problem with is_utf8_charset missing in WP 6.6</li>\n</ul>\n<p><a href=\"https://github.com/Automattic/jetpack/blob/trunk/projects/plugins/super-cache/CHANGELOG.md#changelog\" rel=\"nofollow ugc\">See the previous changelogs here</a></p>\n"
    },
    "short_description": "A very fast caching engine for WordPress that produces static html files.",
    "description": "<p>This plugin generates static html files from your dynamic WordPress blog.  After a html file is generated your webserver will serve that file instead of processing the comparatively heavier and more expensive WordPress PHP scripts.</p>\n<p>The static html files will be served to the vast majority of your users:</p>\n<ul>\n<li>Users who are not logged in.</li>\n<li>Users who have not left a comment on your blog.</li>\n<li>Or users who have not viewed a password protected post.</li>\n</ul>\n<p>99% of your visitors will be served static html files. One cached file can be served thousands of times. Other visitors will be served custom cached files tailored to their visit. If they are logged in, or have left comments those details will be displayed and cached for them.</p>\n<p>The plugin serves cached files in 3 ways (ranked by speed):</p>\n<ol>\n<li>Expert. The fastest method is by using Apache mod_rewrite (or whatever similar module your web server supports) to serve &#8220;supercached&#8221; static html files. This completely bypasses PHP and is extremely quick. If your server is hit by a deluge of traffic it is more likely to cope as the requests are &#8220;lighter&#8221;. This does require the Apache mod_rewrite module (which is probably installed if you have custom permalinks) and a modification of your .htaccess file which is risky and may take down your site if modified incorrectly.</li>\n<li>Simple. Supercached static files can be served by PHP and this is the recommended way of using the plugin. The plugin will serve a &#8220;supercached&#8221; file if it exists and it&#8217;s almost as fast as the mod_rewrite method. It&#8217;s easier to configure as the .htaccess file doesn&#8217;t need to be changed. You still need a custom permalink. You can keep portions of your page dynamic in this caching mode.</li>\n<li>WP-Cache caching. This is mainly used to cache pages for known users, URLs with parameters and feeds. Known users are logged in users, visitors who leave comments or those who should be shown custom per-user data. It&#8217;s the most flexible caching method and slightly slower. WP-Cache caching will also cache visits by unknown users if supercaching is disabled. You can have dynamic parts to your page in this mode too. This mode is always enabled but you can disable caching for known users, URLs with parameters, or feeds separately. Set the constant &#8220;DISABLE_SUPERCACHE&#8221; to 1 in your wp-config.php if you want to only use WP-Cache caching.</li>\n</ol>\n<p>If you&#8217;re not comfortable with editing PHP files then use simple mode. It&#8217;s easy to set up and very fast.</p>\n<h3>Recommended Settings</h3>\n<ol>\n<li>Simple caching.</li>\n<li>Compress pages.</li>\n<li>Don&#8217;t cache pages for known users.</li>\n<li>Cache rebuild.</li>\n<li>CDN support.</li>\n<li>Extra homepage checks.</li>\n</ol>\n<p>Garbage collection is the act of cleaning up cache files that are out of date and stale. There&#8217;s no correct value for the expiry time but a good starting point is 1800 seconds.</p>\n<p>Consider deleting the contents of the &#8220;Rejected User Agents&#8221; text box and allow search engines to cache files for you.</p>\n<p>Preload as many posts as you can and enable &#8220;Preload Mode&#8221;. Garbage collection of old cached files will be disabled. If you don&#8217;t care about sidebar widgets updating often set the preload interval to 2880 minutes (2 days) so all your posts aren&#8217;t recached very often. When the preload occurs the cache files for the post being refreshed is deleted and then regenerated. Afterwards a garbage collection of all old files is performed to clean out stale cache files.<br />\nEven with preload mode enabled cached files will still be deleted when posts are modified or comments made.</p>\n<h3>Development</h3>\n<ul>\n<li>Active development of this plugin is handled <a href=\"https://github.com/Automattic/wp-super-cache\" rel=\"nofollow ugc\">on GitHub</a>.</li>\n<li>Translation of the plugin into different languages is on the <a href=\"https://translate.wordpress.org/projects/wp-plugins/wp-super-cache\" rel=\"nofollow ugc\">translation page</a>.</li>\n</ul>\n<h3>Documentation</h3>\n<p>If you need more information than the following, you can have a look at <a href=\"https://github.com/Automattic/wp-super-cache/wiki\" rel=\"nofollow ugc\">the wiki</a> or the <a href=\"https://odd.blog/wp-super-cache-developers/\" rel=\"nofollow ugc\">Developer documentation</a>.</p>\n<h4>Preloading</h4>\n<p>You can generate cached files for the posts, categories and tags of your site by preloading. Preloading will visit each page of your site generating a cached page as it goes along, just like any other visitor to the site. Due to the sequential nature of this function, it can take some time to preload a complete site if there are many posts.<br />\nTo make preloading more effective it can be useful to disable garbage collection so that older cache files are not deleted. This is done by enabling &#8220;Preload Mode&#8221; in the settings. Be aware however, that pages will go out of date eventually but that updates by submitting comments or editing posts will clear portions of the cache.</p>\n<h4>Garbage Collection</h4>\n<p>Your cache directory fills up over time, which takes up space on your server. If space is limited or billed by capacity, or if you worry that the cached pages of your site will go stale then garbage collection has to be done. Garbage collection happens on a regular basis and deletes old files in the cache directory. On the advanced settings page you can specify:<br />\n1. Cache timeout. How long cache files are considered fresh for. After this time they are stale and can be deleted.<br />\n2. Scheduler. Setup how often garbage collection should be done.<br />\n3. Notification emails. You can be informed on garbage collection job progress.<br />\nThere&#8217;s no right or wrong settings for garbage collection. It depends on your own site.<br />\nIf your site gets regular updates, or comments then set the timeout to 1800 seconds, and set the timer to 600 seconds.<br />\nIf your site is mostly static you can disable garbage collection by entering 0 as the timeout, or use a really large timeout value.</p>\n<p>The cache directory, usually wp-content/cache/ is only for temporary files. Do not ever put important files or symlinks to important files or directories in that directory. They will be deleted if the plugin has write access to them.</p>\n<h4>CDN</h4>\n<p>A Content Delivery Network (CDN) is usually a network of computers situated around the world that will serve the content of your website faster by using servers close to you. Static files like images, Javascript and CSS files can be served through these networks to speed up how fast your site loads. You can also create a &#8220;poor man&#8217;s CDN&#8221; by using a sub domain of your domain to serve static files too.</p>\n<p><a href=\"https://wordpress.org/plugins/ossdl-cdn-off-linker/\" rel=\"ugc\">OSSDL CDN off-linker</a> has been integrated into WP Super Cache to provide basic CDN support. It works by rewriting the URLs of files (excluding .php files) in wp-content and wp-includes on your server so they point at a different hostname. Many CDNs support <a href=\"https://www.google.com/search?hl=en&amp;q=%22origin+pull%22\" rel=\"nofollow ugc\">origin pull</a>. This means the CDN will download the file automatically from your server when it&#8217;s first requested, and will continue to serve it for a configurable length of time before downloading it again from your server.</p>\n<p>Configure this on the &#8220;CDN&#8221; tab of the plugin settings page. This is an advanced technique and requires a basic understanding of how your webserver or CDNs work. Please be sure to clear the file cache after you configure the CDN.</p>\n<h4>REST API</h4>\n<p>There are now REST API endpoints for accessing the settings of this plugin. You&#8217;ll need to be authenticated as an admin user with permission to view the settings page to use it. This has not been documented yet but you can find all the code that deals with this in the &#8220;rest&#8221; directory.</p>\n<h4>Custom Caching</h4>\n<p>It is now possible to hook into the caching process using the add_cacheaction() function.</p>\n<p>Three hooks are available:</p>\n<ol>\n<li>&#8216;wp_cache_get_cookies_values&#8217; &#8211; modify the key used by WP Cache.</li>\n<li>&#8216;add_cacheaction&#8217; &#8211; runs in phase2. Allows a plugin to add WordPress hooks.</li>\n<li>&#8216;cache_admin_page&#8217; &#8211; runs in the admin page. Use it to modify that page, perhaps by adding new configuration options.</li>\n</ol>\n<p>There is one regular WordPress filter too. Use the &#8220;do_createsupercache&#8221; filter<br />\nto customize the checks made before caching. The filter accepts one parameter.<br />\nThe output of WP-Cache&#8217;s wp_cache_get_cookies_values() function.</p>\n<p>WP Super Cache has its own plugin system. This code is loaded when WP Super Cache loads and can be used to change how caching is done. This is before most of WordPress loads so some functionality will not be available. Plugins can be located anywhere that PHP can load them. Add your own plugin either:</p>\n<ul>\n<li>by putting your plugin in the wp-content/plugins/wp-super-cache-plugins directory, or</li>\n<li>by calling wpsc_add_plugin( $name ) where $name is the full filename and path to the plugin. You only need to call that function once to add it. Use wpsc_delete_plugin( $name ) to remove it from the list of loaded plugins.</li>\n</ul>\n<p>The cookies WP Super Cache uses to identify &#8220;known users&#8221; can be modified now by adding the names of those cookies to a list in the plugin configuration. Use wpsc_add_cookie( $name ) to add a new cookie, and wpsc_delete_cookie( $name ) to remove it. The cookie names also modify the mod_rewrite rules used by the plugin but I recommend using Simple mode caching to avoid complications with updating the .htaccess file.<br />\nThe cookie name and value are used to differenciate users so you can have one cookie, but different values for each type of user on your site for example. They&#8217;ll be served different cache files.</p>\n<p>See <a href=\"https://github.com/Automattic/wp-super-cache/blob/4cda5c0f2218e40e118232b5bf22d227fb3206b7/plugins/searchengine.php\" rel=\"nofollow ugc\">plugins/searchengine.php</a> as an example I use for my <a href=\"https://odd.blog/no-adverts-for-friends/\" rel=\"nofollow ugc\">No Adverts for Friends</a> plugin.</p>\n<h3>Troubleshooting</h3>\n<p>If things don&#8217;t work when you installed the plugin here are a few things to check:</p>\n<ol>\n<li>Is wp-content writable by the web server?</li>\n<li>Is there a wp-content/wp-cache-config.php ? If not, copy the file wp-super-cache/wp-cache-config-sample.php to wp-content/wp-cache-config.php and make sure WPCACHEHOME points at the right place.</li>\n<li>Is there a wp-content/advanced-cache.php ? If not, then you must copy wp-super-cache/advanced-cache.php into wp-content/. You must edit the file and change the path so it points at the wp-super-cache folder.</li>\n<li>If pages are not cached at all, remove wp-content/advanced-cache.php and recreate it, following the advice above.</li>\n<li>\n<p>Make sure the following line is in wp-config.php and it is ABOVE the &#8220;require_once(ABSPATH.&#8217;wp-settings.php&#8217;);&#8221; line:</p>\n<pre><code>define( 'WP_CACHE', true );\n</code></pre>\n</li>\n<li>Try the Settings-&gt;WP Super Cache page again and enable cache.</li>\n<li>Look in wp-content/cache/supercache/. Are there directories and files there?</li>\n<li>Anything in your php error_log?</li>\n<li>If your browser keeps asking you to save the file after the super cache is installed you must disable Super Cache compression. Go to the Settings-&gt;WP Super Cache page and disable it there.</li>\n<li>The plugin does not work very well when PHP&#8217;s safe mode is active. This must be disabled by your administrator.</li>\n<li>If pages are randomly super cached and sometimes not, your blog can probably be viewed with and without the &#8220;www&#8221; prefix on the URL. You should choose one way and install the <a href=\"http://txfx.net/code/wordpress/enforce-www-preference/\" rel=\"nofollow ugc\">Enforce www preference</a> plugin if you are using an old WordPress install. The latest versions redirect themselves (you should always be running the latest version of WordPress anyway!)</li>\n<li>Private Server users at Dreamhost should edit wp-content/wp-cache-config.php and set the cache dir to &#8220;/tmp/&#8221; if they are getting errors about increasing CPU usage. See this <a href=\"https://wordpress.org/support/topic/145895?replies=42\" rel=\"ugc\">discussion</a> for more.</li>\n<li>File locking errors such as &#8220;failed to acquire key 0x152b: Permission denied in&#8230;&#8221; or &#8220;Page not cached by WP Super Cache. Could not get mutex lock.&#8221; are a sign that you may have to use file locking. Edit wp-content/wp-cache-config.php and uncomment &#8220;$use_flock = true&#8221; or set $sem_id to a different value. You can also disable file locking from the Admin screen as a last resort.</li>\n<li>Make sure cache/wp_cache_mutex.lock is writable by the web server if using coarse file locking.</li>\n<li>The cache folder cannot be put on an NFS or Samba or NAS share. It has to be on a local disk. File locking and deleting expired files will not work properly unless the cache folder is on the local machine.</li>\n<li>\n<p>Garbage collection of old cache files won&#8217;t work if WordPress can&#8217;t find wp-cron.php. If your hostname resolves to 127.0.0.1 it could be preventing the garbage collection from working. Check your access_logs for wp-cron.php entries. Do they return a 404 (file not found) or 200 code? If it&#8217;s 404 or you don&#8217;t see wp-cron.php anywhere WordPress may be looking for that script in the wrong place. You should speak to your server administator to correct this or edit /etc/hosts on Unix servers and remove the following line. Your hostname must resolve to the external IP address other servers on the network/Internet use. See http://yoast.com/wp-cron-issues/ for more. A line like &#8220;127.0.0.1 localhost localhost.localdomain&#8221; is ok.</p>\n<pre><code>127.0.0.1 example.com\n</code></pre>\n</li>\n<li>If old pages are being served to your visitors via the supercache, you may be missing Apache modules (or their equivalents if you don&#8217;t use Apache). 3 modules are required: mod_mime, mod_headers and mod_expires. The last two are especially important for making sure browsers load new versions of existing pages on your site.</li>\n<li>The error message, &#8220;WP Super Cache is installed but broken. The path to wp-cache-phase1.php in wp-content/advanced-cache.php must be fixed!&#8221; appears at the end of every page. Open the file wp-content/advanced-cache.php in your favourite editor. Is the path to wp-cache-phase1.php correct? This file will normally be in wp-content/plugins/wp-super-cache/. If it is not correct the caching engine will not load.</li>\n<li>Caching doesn&#8217;t work. The timestamp on my blog keeps changing when I reload. Check that the path in your .htaccess rules matches where the supercache directory is. You may have to hardcode it. Try disabling supercache mode.</li>\n<li>\n<p>If supercache cache files are generated but not served, check the permissions on all your wp-content/cache/supercache folders (and each of wp-content cache and supercache folders) and wp-content/cache/.htaccess. If your PHP runs as a different user to Apache and permissions are strict Apache may not be able to read the PHP generated cache files. To fix you must add the following line to your wp-config.php (Add it above the WP_CACHE define.) Then clear your cache.</p>\n<pre><code>umask( 0022 );\n</code></pre>\n</li>\n<li>\n<p>If you see garbage in your browser after enabling compression in the plugin, compression may already be enabled in your web server. In Apache you must disable mod_deflate, or in PHP zlib compression may be enabled. You can disable that in three ways. If you have root access, edit your php.ini and find the zlib.output_compression setting and make sure it&#8217;s &#8220;Off&#8221; or add this line to your .htaccess:</p>\n<pre><code>php_flag zlib.output_compression off\n</code></pre>\n<p>If that doesn&#8217;t work, add this line to your wp-config.php:</p>\n<pre><code>ini_set('zlib.output_compression', 0);\n</code></pre>\n</li>\n<li>The &#8220;white screen of death&#8221; or a blank page  when you visit your site is almost always caused by a PHP error but <a href=\"http://www.johnberns.com/2010/03/19/wp-super-cache-blank-page-problem-fixed/\" rel=\"nofollow ugc\">it may also be caused by APC</a>. Disable that PHP extension if you have trouble and replace with eAccelerator or Xcache.</li>\n<li>After uninstalling, your permalinks may break if you remove the WordPress mod_rewrite rules too. Regenerate those rules by visiting the Settings-&gt;Permalink page and saving that form again.</li>\n<li>If your blog refuses to load make sure your wp-config.php is correct. Are you missing an opening or closing PHP tag?</li>\n<li>Your front  &hellip;</li>\n</ol>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wp-super-cache.1.12.4.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "cache": "cache",
        "caching": "caching",
        "performance": "performance",
        "wp-cache": "WP Cache",
        "wp-super-cache": "WP Super Cache"
    },
    "stable_tag": "1.12.4",
    "versions": {
        "0.1": "https://downloads.wordpress.org/plugin/wp-super-cache.0.1.zip",
        "0.2": "https://downloads.wordpress.org/plugin/wp-super-cache.0.2.zip",
        "0.3": "https://downloads.wordpress.org/plugin/wp-super-cache.0.3.zip",
        "0.3.1": "https://downloads.wordpress.org/plugin/wp-super-cache.0.3.1.zip",
        "0.4": "https://downloads.wordpress.org/plugin/wp-super-cache.0.4.zip",
        "0.5": "https://downloads.wordpress.org/plugin/wp-super-cache.0.5.zip",
        "0.5.1": "https://downloads.wordpress.org/plugin/wp-super-cache.0.5.1.zip",
        "0.5.2": "https://downloads.wordpress.org/plugin/wp-super-cache.0.5.2.zip",
        "0.5.3": "https://downloads.wordpress.org/plugin/wp-super-cache.0.5.3.zip",
        "0.6.2": "https://downloads.wordpress.org/plugin/wp-super-cache.0.6.2.zip",
        "0.6.3": "https://downloads.wordpress.org/plugin/wp-super-cache.0.6.3.zip",
        "0.6.4": "https://downloads.wordpress.org/plugin/wp-super-cache.0.6.4.zip",
        "0.6.5": "https://downloads.wordpress.org/plugin/wp-super-cache.0.6.5.zip",
        "0.6.6": "https://downloads.wordpress.org/plugin/wp-super-cache.0.6.6.zip",
        "0.6.7": "https://downloads.wordpress.org/plugin/wp-super-cache.0.6.7.zip",
        "0.6.8": "https://downloads.wordpress.org/plugin/wp-super-cache.0.6.8.zip",
        "0.7": "https://downloads.wordpress.org/plugin/wp-super-cache.0.7.zip",
        "0.7.1": "https://downloads.wordpress.org/plugin/wp-super-cache.0.7.1.zip",
        "0.8": "https://downloads.wordpress.org/plugin/wp-super-cache.0.8.zip",
        "0.8.1": "https://downloads.wordpress.org/plugin/wp-super-cache.0.8.1.zip",
        "0.8.2": "https://downloads.wordpress.org/plugin/wp-super-cache.0.8.2.zip",
        "0.8.3": "https://downloads.wordpress.org/plugin/wp-super-cache.0.8.3.zip",
        "0.8.4": "https://downloads.wordpress.org/plugin/wp-super-cache.0.8.4.zip",
        "0.8.5": "https://downloads.wordpress.org/plugin/wp-super-cache.0.8.5.zip",
        "0.8.6": "https://downloads.wordpress.org/plugin/wp-super-cache.0.8.6.zip",
        "0.8.7": "https://downloads.wordpress.org/plugin/wp-super-cache.0.8.7.zip",
        "0.8.8": "https://downloads.wordpress.org/plugin/wp-super-cache.0.8.8.zip",
        "0.8.9": "https://downloads.wordpress.org/plugin/wp-super-cache.0.8.9.zip",
        "0.9": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.zip",
        "0.9.1": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.1.zip",
        "0.9.2": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.2.zip",
        "0.9.3": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.3.zip",
        "0.9.3.1": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.3.1.zip",
        "0.9.4": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.4.zip",
        "0.9.4.1": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.4.1.zip",
        "0.9.4.2": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.4.2.zip",
        "0.9.4.3": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.4.3.zip",
        "0.9.5": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.5.zip",
        "0.9.6": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.6.zip",
        "0.9.6.1": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.6.1.zip",
        "0.9.7": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.7.zip",
        "0.9.8": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.8.zip",
        "0.9.9": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.9.zip",
        "0.9.9.1": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.9.1.zip",
        "0.9.9.2": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.9.2.zip",
        "0.9.9.3": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.9.3.zip",
        "0.9.9.4": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.9.4.zip",
        "0.9.9.5": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.9.5.zip",
        "0.9.9.6": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.9.6.zip",
        "0.9.9.7": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.9.7.zip",
        "0.9.9.8": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.9.8.zip",
        "0.9.9.9": "https://downloads.wordpress.org/plugin/wp-super-cache.0.9.9.9.zip",
        "1.0": "https://downloads.wordpress.org/plugin/wp-super-cache.1.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/wp-super-cache.1.0.1.zip",
        "1.1": "https://downloads.wordpress.org/plugin/wp-super-cache.1.1.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/wp-super-cache.1.1.1.zip",
        "1.10.0": "https://downloads.wordpress.org/plugin/wp-super-cache.1.10.0.zip",
        "1.10.0-beta": "https://downloads.wordpress.org/plugin/wp-super-cache.1.10.0-beta.zip",
        "1.11.0": "https://downloads.wordpress.org/plugin/wp-super-cache.1.11.0.zip",
        "1.12.0": "https://downloads.wordpress.org/plugin/wp-super-cache.1.12.0.zip",
        "1.12.1": "https://downloads.wordpress.org/plugin/wp-super-cache.1.12.1.zip",
        "1.12.2": "https://downloads.wordpress.org/plugin/wp-super-cache.1.12.2.zip",
        "1.12.3": "https://downloads.wordpress.org/plugin/wp-super-cache.1.12.3.zip",
        "1.12.4": "https://downloads.wordpress.org/plugin/wp-super-cache.1.12.4.zip",
        "1.2": "https://downloads.wordpress.org/plugin/wp-super-cache.1.2.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/wp-super-cache.1.2.1.zip",
        "1.3": "https://downloads.wordpress.org/plugin/wp-super-cache.1.3.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/wp-super-cache.1.3.1.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/wp-super-cache.1.3.2.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/wp-super-cache.1.3.3.zip",
        "1.4": "https://downloads.wordpress.org/plugin/wp-super-cache.1.4.zip",
        "1.4.1": "https://downloads.wordpress.org/plugin/wp-super-cache.1.4.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/wp-super-cache.1.4.2.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/wp-super-cache.1.4.3.zip",
        "1.4.4": "https://downloads.wordpress.org/plugin/wp-super-cache.1.4.4.zip",
        "1.4.5": "https://downloads.wordpress.org/plugin/wp-super-cache.1.4.5.zip",
        "1.4.6": "https://downloads.wordpress.org/plugin/wp-super-cache.1.4.6.zip",
        "1.4.7": "https://downloads.wordpress.org/plugin/wp-super-cache.1.4.7.zip",
        "1.4.8": "https://downloads.wordpress.org/plugin/wp-super-cache.1.4.8.zip",
        "1.4.9": "https://downloads.wordpress.org/plugin/wp-super-cache.1.4.9.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/wp-super-cache.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/wp-super-cache.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/wp-super-cache.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/wp-super-cache.1.5.3.zip",
        "1.5.4": "https://downloads.wordpress.org/plugin/wp-super-cache.1.5.4.zip",
        "1.5.5": "https://downloads.wordpress.org/plugin/wp-super-cache.1.5.5.zip",
        "1.5.6": "https://downloads.wordpress.org/plugin/wp-super-cache.1.5.6.zip",
        "1.5.7": "https://downloads.wordpress.org/plugin/wp-super-cache.1.5.7.zip",
        "1.5.7.1": "https://downloads.wordpress.org/plugin/wp-super-cache.1.5.7.1.zip",
        "1.5.8": "https://downloads.wordpress.org/plugin/wp-super-cache.1.5.8.zip",
        "1.5.9": "https://downloads.wordpress.org/plugin/wp-super-cache.1.5.9.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/wp-super-cache.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/wp-super-cache.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/wp-super-cache.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/wp-super-cache.1.6.3.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/wp-super-cache.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/wp-super-cache.1.6.5.zip",
        "1.6.6": "https://downloads.wordpress.org/plugin/wp-super-cache.1.6.6.zip",
        "1.6.7": "https://downloads.wordpress.org/plugin/wp-super-cache.1.6.7.zip",
        "1.6.8": "https://downloads.wordpress.org/plugin/wp-super-cache.1.6.8.zip",
        "1.6.9": "https://downloads.wordpress.org/plugin/wp-super-cache.1.6.9.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/wp-super-cache.1.7.0.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/wp-super-cache.1.7.1.zip",
        "1.7.2": "https://downloads.wordpress.org/plugin/wp-super-cache.1.7.2.zip",
        "1.7.3": "https://downloads.wordpress.org/plugin/wp-super-cache.1.7.3.zip",
        "1.7.4": "https://downloads.wordpress.org/plugin/wp-super-cache.1.7.4.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/wp-super-cache.1.7.5.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/wp-super-cache.1.7.6.zip",
        "1.7.7": "https://downloads.wordpress.org/plugin/wp-super-cache.1.7.7.zip",
        "1.7.8": "https://downloads.wordpress.org/plugin/wp-super-cache.1.7.8.zip",
        "1.7.9": "https://downloads.wordpress.org/plugin/wp-super-cache.1.7.9.zip",
        "1.8": "https://downloads.wordpress.org/plugin/wp-super-cache.1.8.zip",
        "1.9": "https://downloads.wordpress.org/plugin/wp-super-cache.1.9.zip",
        "1.9.1": "https://downloads.wordpress.org/plugin/wp-super-cache.1.9.1.zip",
        "1.9.2": "https://downloads.wordpress.org/plugin/wp-super-cache.1.9.2.zip",
        "1.9.2-beta": "https://downloads.wordpress.org/plugin/wp-super-cache.1.9.2-beta.zip",
        "1.9.2-beta2": "https://downloads.wordpress.org/plugin/wp-super-cache.1.9.2-beta2.zip",
        "1.9.2-beta3": "https://downloads.wordpress.org/plugin/wp-super-cache.1.9.2-beta3.zip",
        "1.9.3": "https://downloads.wordpress.org/plugin/wp-super-cache.1.9.3.zip",
        "1.9.3-beta": "https://downloads.wordpress.org/plugin/wp-super-cache.1.9.3-beta.zip",
        "1.9.4": "https://downloads.wordpress.org/plugin/wp-super-cache.1.9.4.zip",
        "1.9.4-beta": "https://downloads.wordpress.org/plugin/wp-super-cache.1.9.4-beta.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wp-super-cache.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/wp-super-cache/assets/banner-772x250.png?rev=1082414",
        "high": "https://ps.w.org/wp-super-cache/assets/banner-1544x500.png?rev=1082414"
    },
    "icons": {
        "1x": "https://ps.w.org/wp-super-cache/assets/icon-128x128.png?rev=1095422",
        "2x": "https://ps.w.org/wp-super-cache/assets/icon-256x256.png?rev=1095422"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": "6",
    "author_block_rating": 93.68421052631601,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "bs_BA",
            "version": "1.12.4",
            "updated": "2023-05-31 19:14:00",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/bs_BA.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "ca",
            "version": "1.12.4",
            "updated": "2023-10-16 13:35:10",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/ca.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "de_DE",
            "version": "1.12.4",
            "updated": "2024-08-22 21:25:54",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/de_DE.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "en_AU",
            "version": "1.12.4",
            "updated": "2024-06-28 03:09:24",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/en_AU.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "en_CA",
            "version": "1.12.4",
            "updated": "2024-06-28 03:11:05",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/en_CA.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "en_ZA",
            "version": "1.12.4",
            "updated": "2023-05-31 19:14:35",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/en_ZA.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "en_GB",
            "version": "1.12.4",
            "updated": "2024-03-11 15:04:07",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/en_GB.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "en_NZ",
            "version": "1.12.4",
            "updated": "2024-06-28 03:10:15",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/en_NZ.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "es_CO",
            "version": "1.12.4",
            "updated": "2023-05-31 19:14:31",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/es_CO.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "es_ES",
            "version": "1.12.4",
            "updated": "2024-06-27 15:27:24",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/es_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "es_MX",
            "version": "1.12.4",
            "updated": "2024-02-01 17:01:41",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/es_MX.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "es_EC",
            "version": "1.12.4",
            "updated": "2023-05-31 19:14:38",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/es_EC.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "es_CL",
            "version": "1.12.4",
            "updated": "2024-06-19 17:07:32",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/es_CL.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "es_AR",
            "version": "1.12.4",
            "updated": "2024-05-08 07:29:31",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/es_AR.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "es_VE",
            "version": "1.12.4",
            "updated": "2023-08-26 12:29:15",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/es_VE.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "fa_IR",
            "version": "1.12.4",
            "updated": "2023-01-12 05:07:53",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/fa_IR.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "fr_BE",
            "version": "1.12.4",
            "updated": "2023-05-31 19:14:21",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/fr_BE.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "fr_FR",
            "version": "1.12.4",
            "updated": "2023-12-07 21:08:32",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/fr_FR.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "gl_ES",
            "version": "1.12.4",
            "updated": "2024-06-27 14:55:32",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/gl_ES.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "hr",
            "version": "1.12.4",
            "updated": "2020-01-30 13:59:13",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/hr.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "it_IT",
            "version": "1.12.4",
            "updated": "2023-05-31 19:15:21",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/it_IT.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "ja",
            "version": "1.12.4",
            "updated": "2023-09-21 14:37:05",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/ja.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "ko_KR",
            "version": "1.12.4",
            "updated": "2024-07-02 05:56:15",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/ko_KR.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "nl_NL",
            "version": "1.12.4",
            "updated": "2024-06-27 18:05:29",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/nl_NL.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "nl_BE",
            "version": "1.12.4",
            "updated": "2024-07-11 11:43:22",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/nl_BE.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "nl_NL_formal",
            "version": "1.12.4",
            "updated": "2024-07-01 11:58:56",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/nl_NL_formal.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "pt_BR",
            "version": "1.12.4",
            "updated": "2023-05-31 19:16:01",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/pt_BR.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "ro_RO",
            "version": "1.12.4",
            "updated": "2024-07-14 08:34:08",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/ro_RO.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "ru_RU",
            "version": "1.12.4",
            "updated": "2024-05-13 09:57:08",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/ru_RU.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "sv_SE",
            "version": "1.12.4",
            "updated": "2024-06-28 06:49:56",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/sv_SE.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "uk",
            "version": "1.12.4",
            "updated": "2024-07-07 20:13:47",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/uk.zip"
        },
        {
            "type": "plugin",
            "slug": "wp-super-cache",
            "language": "zh_CN",
            "version": "1.12.4",
            "updated": "2023-10-25 10:46:34",
            "package": "http://downloads.wordpress.org/translation/plugin/wp-super-cache/1.12.4/zh_CN.zip"
        }
    ]
}