{
    "name": "WPChef",
    "slug": "wpchef",
    "version": "2.1.2",
    "author": "<a href=\"https://wpchef.org\">WPChef</a>",
    "author_profile": "https://profiles.wordpress.org/wpchefgadget/",
    "contributors": {
        "wpchefgadget": {
            "profile": "https://profiles.wordpress.org/wpchefgadget/",
            "avatar": "https://secure.gravatar.com/avatar/f52ab0225e628240d99cbdb3e94da9b0?s=96&d=monsterid&r=g",
            "display_name": "WPChef"
        }
    },
    "requires": "4.2",
    "tested": "4.9.26",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/wpchef/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 50,
    "downloaded": 1245,
    "last_updated": "2018-04-17 5:15pm GMT",
    "added": "2018-04-06",
    "homepage": "",
    "sections": {
        "description": "<p>WPChef&#8217;s &#8220;Recipes&#8221; are a new concept in WordPress automation.</p>\n<p>A recipe is a predefined set of plugins, settings, content pieces and other WordPress items that can be deployed in minutes. The WPChef plugin provides an easy visual way of creating, installing, and sharing recipes.</p>\n<p><strong>Scenario 1</strong><br />\nSay you had a fully configured WordPress site with a number of plugins, a theme, menu items, pages, and a specific configuration of settings. A new site you want to develop would benefit from the same configuration. Using WPChef you can create a recipe with the configuration from the first site and apply it to the new site. The new site is now set up and ready to go in minutes, not hours or days. Setting up new sites in this way can save hours of development time and money. You can share your recipes with others, or even sell them.</p>\n<p><strong>Scenario 2</strong><br />\nSay you&#8217;ve just started your new WordPress blog and you&#8217;re not sure what plugins you need. With WPChef you can simply pick a recommended recipe from the WPChef recipes directory and apply it to your site. An example would be the &#8220;Bare Minimum&#8221; recipe that will supercharge your site with a set of essential plugins every WP site is recommended to have &#8211; from a handy WYSIWYG widget editor to an easy to use SEO plugin. You can explore the recipes directory and find the perfect recipe for your needs.</p>\n<p>The potential is endless &#8211; you can configure sites for particular niches, sell your recipes, configure special recipes for your clients, and cut hours of development from your deployment process.</p>\n<h3>WPChef In Detail</h3>\n<p>WPChef consists of 3 parts:</p>\n<ul>\n<li>Recipes</li>\n<li>WPChef plugin</li>\n<li>WPChef.org directory</li>\n</ul>\n<h4>Recipes</h4>\n<p>WPChef works through recipes. A recipe is a small file in JSON format. It contains a list of plugins, themes, options and actions that can be applied to a WordPress site one after another, fast and in an automated manner. By activating a recipe all of its components (we call them &#8220;ingredients&#8221;) get installed. During the activation process a user has full control over which ingredients should be installed and which not. Here&#8217;s a more detailed description of ingredients:<br />\n* <strong>Plugins</strong>: A recipe can install any number of WordPress plugins specified in a recipe. Only plugins from the oficial WordPress.org directory are allowed. Each plugin inside a recipe is represented by its slug. I.e. a recipe is not a package with plugins archived inside it but a text reference to known WordPress plugins. This makes a recipe very compact in size (bytes and kilobytes). Upon recipe installation WPChef connects to WordPress.org and attempts to install a plugin specified by its slug, just like with a native WordPress plugins installation process. After a plugin is installed, recipe installation moves to the next step.<br />\n* <strong>Themes</strong>: Themes are handled a similar way to plugins. Only themes from WordPress.org are allowed. After a theme is installed, it gets activated right away which means that the current theme on the site will be deactivated. If there are a number of themes specified in a recipe, all of them will be installed, but only the last one will be activated since only one theme can be active at a time.<br />\n* <strong>Options</strong>: Options are WordPress settings. They can be core settings, plugin settings and theme settings. If a recipe sets a new option value and this option is already present on the site, it will be overwritten with that new value. A backup of the current value will be created in case a recipe needs to be rolled back. WPChef supports options of complex structure like nested arrays as well as plain strings and booleans. During recipe installation every option can be manually edited or skipped. Here is an example of how setting options can be helpful: Let&#8217;s say your recipe installs a SEO plugin with turned off sitemap functionality by default. By specifying an option that is responsible for the sitemap functionality in this plugin the recipe can automatically activate the sitemap during recipe installation.<br />\n* <strong>Actions</strong>: It is common after a new WordPress site installation for standard one-time operations to be completed, like creating a page or a menu item, registering a test user, and so on. In WPChef these one-time operations are called &#8220;Actions&#8221;. You can specify when an action should be run &#8211; either on recipe activation or deactivation. In both cases it will only run once. For example, you can create a house cleaning recipe that will deactivate all obsolete plugins that you don&#8217;t need anymore, and this will be done via Actions during recipe activation.<br />\nRecipes are managed by the WPChef plugin and hosted at WPChef directory or as local files.</p>\n<h4>WPChef Plugin</h4>\n<p>The WPChef plugin is the core of the system. It provides all needed functionality to operate Recipes:<br />\n* <strong>Recipe creation</strong>: The WPChef plugin provides an easy visual way to create recipes via its built-in recipe architect. All types of ingredients can be created and configured from here. You can also specify what order they will be installed during recipe activation in the future.  Aside from ingredients, you can specify a name of the recipe, a short description and other meta information, including the required PHP version to safely run all ingredients of the recipe. After a recipe is created, it can be applied to the site right away which makes it easy to test.<br />\n* <strong>Recipe installation, removal and updates</strong>: The WPChef plugin provides a way to install recipes that any WordPress user is familiar with because it is similar to how WordPress plugins are installed. You click the &#8220;Add Recipe&#8221; link in the menu to get to the recipes search page where you can find a recipe that fits your needs. The list of recipes is pulled from the WPChef directory on wpchef.org, where all recipes are hosted. Before picking a recipe you can read what the recipe is about, who created it, what ingredient it contains, what rating it has, and how new it is. By clicking the &#8220;Activate&#8221; button a popup window with ready-to-start installation process appears. Here you can see what ingredients will be installed and turn off any of them. The options can also be edited. You can also specify if a recipe should be automatically updated in the future or not. Clicking the &#8220;Activate&#8221; button in this window will start the installation process. It is visual and you can see what happens through all stages. After a recipe is installed, you will get a success message. Now you can see all your installed recipes on a separate page which is very similar to the Plugins page. At any time a recipe can be deactivated. This will roll back the site to its previous state by deactivating all installed (by the recipe) plugins and restoring all changed (by the recipe) options to their backed up values. Deactivation of a recipe is a visual user-controlled process just like the activation.<br />\n* <strong>Uploading a recipe to the recipes directory</strong>: WPChef allows you to publish recipes made by you to the wpchef.org recipes directory. In order to do that you need to create a private account at wpchef.org and connect it with your WPChef instance. It can be done right from the WPChef plugin settings page. By clicking the &#8220;Connect&#8221; button there you are prompted to establish a connection with wpchef.org. You are asked to enter your email address and create a password to complete registration at wpchef.org and then your WPChef plugin will get linked with your private wpchef.org account. This is done via OAuth 2.0 protocol over a secure https connection. Initially a recipe uploaded to wpchef.org is made private. Only its author can use that private recipe and they will not be available to other users. The author of the recipe also may request publishing their recipes in the public wpchef.org directory. Our moderators will validate the recipe and publish it or will explain how it should be adjusted to be allowed to become public. Creating an account at wpchef.org is optional and is only needed to operate with private recipes or publish your own recipes. If this is not your plan there&#8217;s no need to create an account &#8211; the plugin will work without one.</p>\n<h4>WPChef.org Directory</h4>\n<p>The WPChef Directory is located at wpchef.org. Its main functions are:<br />\n* <strong>Host public recipes that are available to any WPChef plugin user</strong>. Recipes are organized into a directory with navigation by categories. The WPChef plugin queries the directory in order to show available recipes on the &#8220;Add Recipe&#8221; plugin&#8217;s page and search through them. During a recipe installation it gets downloaded from the directory and stored locally on your WordPress site. When an updated version of a recipe is added on wpchef.org, the WPChef plugin will download it as well as automatically update it if this option is turned on. The WPChef plugin will check for new versions twice a day.<br />\n* <strong>Host private recipes</strong>. The private recipes are available to their authorized owners only. They are stored at wpchef.org in private user accounts and are available for personal use only.<br />\n* wpchef.org provides a support forum for recipe users, documentation and a way to contact the WPChef team.</p>\n<h4>Site Management</h4>\n<p>WPChef provides a simple site management system at wpchef.org that allows you to manage all your WPChef installations from a single place. The management system allows you to see what recipes, plugins and themes are installed on your sites and their versions. The management system is secure and provides the option via the settings page to opt out on an installation basis should the user want a specific installation to be unavailable for site management.</p>\n<h4>Legal Information</h4>\n<p>The WPChef plugin doesn&#8217;t send any personal information to wpchef.org. When a user decides to create a private account at wpchef.org, they are asked to enter a registration email and create a password. This information is not being pulled automatically from the site where the plugin is installed and it has to be entered manually. If you choose to manage your sites via the WPChef Site Management system, a list of installed plugins, themes and recipes will be sent to wpchef.org. During API queries to wpchef.org the site&#8217;s URL is being sent as well. WPChef uses it to create authorization tokens when a user decides to link the plugin with the wpchef.org private account. We value the privaсy of users and do everything we can to protect it.</p>\n",
        "changelog": "<h4>2.1.2</h4>\n<ul>\n<li>Implemented a simple site management system.</li>\n<li>Some hooks added for the future ability of adding new custom ingredients.</li>\n<li>Refactoring done.</li>\n</ul>\n<h4>2.0.1</h4>\n<ul>\n<li>Initial release.</li>\n</ul>\n"
    },
    "short_description": "Quickly set up a preconfigured WordPress site or expand an existing one using a recipe which is a set of plugins, options, themes and content pieces.",
    "description": "<p>WPChef&#8217;s &#8220;Recipes&#8221; are a new concept in WordPress automation.</p>\n<p>A recipe is a predefined set of plugins, settings, content pieces and other WordPress items that can be deployed in minutes. The WPChef plugin provides an easy visual way of creating, installing, and sharing recipes.</p>\n<p><strong>Scenario 1</strong><br />\nSay you had a fully configured WordPress site with a number of plugins, a theme, menu items, pages, and a specific configuration of settings. A new site you want to develop would benefit from the same configuration. Using WPChef you can create a recipe with the configuration from the first site and apply it to the new site. The new site is now set up and ready to go in minutes, not hours or days. Setting up new sites in this way can save hours of development time and money. You can share your recipes with others, or even sell them.</p>\n<p><strong>Scenario 2</strong><br />\nSay you&#8217;ve just started your new WordPress blog and you&#8217;re not sure what plugins you need. With WPChef you can simply pick a recommended recipe from the WPChef recipes directory and apply it to your site. An example would be the &#8220;Bare Minimum&#8221; recipe that will supercharge your site with a set of essential plugins every WP site is recommended to have &#8211; from a handy WYSIWYG widget editor to an easy to use SEO plugin. You can explore the recipes directory and find the perfect recipe for your needs.</p>\n<p>The potential is endless &#8211; you can configure sites for particular niches, sell your recipes, configure special recipes for your clients, and cut hours of development from your deployment process.</p>\n<h3>WPChef In Detail</h3>\n<p>WPChef consists of 3 parts:</p>\n<ul>\n<li>Recipes</li>\n<li>WPChef plugin</li>\n<li>WPChef.org directory</li>\n</ul>\n<h4>Recipes</h4>\n<p>WPChef works through recipes. A recipe is a small file in JSON format. It contains a list of plugins, themes, options and actions that can be applied to a WordPress site one after another, fast and in an automated manner. By activating a recipe all of its components (we call them &#8220;ingredients&#8221;) get installed. During the activation process a user has full control over which ingredients should be installed and which not. Here&#8217;s a more detailed description of ingredients:<br />\n* <strong>Plugins</strong>: A recipe can install any number of WordPress plugins specified in a recipe. Only plugins from the oficial WordPress.org directory are allowed. Each plugin inside a recipe is represented by its slug. I.e. a recipe is not a package with plugins archived inside it but a text reference to known WordPress plugins. This makes a recipe very compact in size (bytes and kilobytes). Upon recipe installation WPChef connects to WordPress.org and attempts to install a plugin specified by its slug, just like with a native WordPress plugins installation process. After a plugin is installed, recipe installation moves to the next step.<br />\n* <strong>Themes</strong>: Themes are handled a similar way to plugins. Only themes from WordPress.org are allowed. After a theme is installed, it gets activated right away which means that the current theme on the site will be deactivated. If there are a number of themes specified in a recipe, all of them will be installed, but only the last one will be activated since only one theme can be active at a time.<br />\n* <strong>Options</strong>: Options are WordPress settings. They can be core settings, plugin settings and theme settings. If a recipe sets a new option value and this option is already present on the site, it will be overwritten with that new value. A backup of the current value will be created in case a recipe needs to be rolled back. WPChef supports options of complex structure like nested arrays as well as plain strings and booleans. During recipe installation every option can be manually edited or skipped. Here is an example of how setting options can be helpful: Let&#8217;s say your recipe installs a SEO plugin with turned off sitemap functionality by default. By specifying an option that is responsible for the sitemap functionality in this plugin the recipe can automatically activate the sitemap during recipe installation.<br />\n* <strong>Actions</strong>: It is common after a new WordPress site installation for standard one-time operations to be completed, like creating a page or a menu item, registering a test user, and so on. In WPChef these one-time operations are called &#8220;Actions&#8221;. You can specify when an action should be run &#8211; either on recipe activation or deactivation. In both cases it will only run once. For example, you can create a house cleaning recipe that will deactivate all obsolete plugins that you don&#8217;t need anymore, and this will be done via Actions during recipe activation.<br />\nRecipes are managed by the WPChef plugin and hosted at WPChef directory or as local files.</p>\n<h4>WPChef Plugin</h4>\n<p>The WPChef plugin is the core of the system. It provides all needed functionality to operate Recipes:<br />\n* <strong>Recipe creation</strong>: The WPChef plugin provides an easy visual way to create recipes via its built-in recipe architect. All types of ingredients can be created and configured from here. You can also specify what order they will be installed during recipe activation in the future.  Aside from ingredients, you can specify a name of the recipe, a short description and other meta information, including the required PHP version to safely run all ingredients of the recipe. After a recipe is created, it can be applied to the site right away which makes it easy to test.<br />\n* <strong>Recipe installation, removal and updates</strong>: The WPChef plugin provides a way to install recipes that any WordPress user is familiar with because it is similar to how WordPress plugins are installed. You click the &#8220;Add Recipe&#8221; link in the menu to get to the recipes search page where you can find a recipe that fits your needs. The list of recipes is pulled from the WPChef directory on wpchef.org, where all recipes are hosted. Before picking a recipe you can read what the recipe is about, who created it, what ingredient it contains, what rating it has, and how new it is. By clicking the &#8220;Activate&#8221; button a popup window with ready-to-start installation process appears. Here you can see what ingredients will be installed and turn off any of them. The options can also be edited. You can also specify if a recipe should be automatically updated in the future or not. Clicking the &#8220;Activate&#8221; button in this window will start the installation process. It is visual and you can see what happens through all stages. After a recipe is installed, you will get a success message. Now you can see all your installed recipes on a separate page which is very similar to the Plugins page. At any time a recipe can be deactivated. This will roll back the site to its previous state by deactivating all installed (by the recipe) plugins and restoring all changed (by the recipe) options to their backed up values. Deactivation of a recipe is a visual user-controlled process just like the activation.<br />\n* <strong>Uploading a recipe to the recipes directory</strong>: WPChef allows you to publish recipes made by you to the wpchef.org recipes directory. In order to do that you need to create a private account at wpchef.org and connect it with your WPChef instance. It can be done right from the WPChef plugin settings page. By clicking the &#8220;Connect&#8221; button there you are prompted to establish a connection with wpchef.org. You are asked to enter your email address and create a password to complete registration at wpchef.org and then your WPChef plugin will get linked with your private wpchef.org account. This is done via OAuth 2.0 protocol over a secure https connection. Initially a recipe uploaded to wpchef.org is made private. Only its author can use that private recipe and they will not be available to other users. The author of the recipe also may request publishing their recipes in the public wpchef.org directory. Our moderators will validate the recipe and publish it or will explain how it should be adjusted to be allowed to become public. Creating an account at wpchef.org is optional and is only needed to operate with private recipes or publish your own recipes. If this is not your plan there&#8217;s no need to create an account &#8211; the plugin will work without one.</p>\n<h4>WPChef.org Directory</h4>\n<p>The WPChef Directory is located at wpchef.org. Its main functions are:<br />\n* <strong>Host public recipes that are available to any WPChef plugin user</strong>. Recipes are organized into a directory with navigation by categories. The WPChef plugin queries the directory in order to show available recipes on the &#8220;Add Recipe&#8221; plugin&#8217;s page and search through them. During a recipe installation it gets downloaded from the directory and stored locally on your WordPress site. When an updated version of a recipe is added on wpchef.org, the WPChef plugin will download it as well as automatically update it if this option is turned on. The WPChef plugin will check for new versions twice a day.<br />\n* <strong>Host private recipes</strong>. The private recipes are available to their authorized owners only. They are stored at wpchef.org in private user accounts and are available for personal use only.<br />\n* wpchef.org provides a support forum for recipe users, documentation and a way to contact the WPChef team.</p>\n<h4>Site Management</h4>\n<p>WPChef provides a simple site management system at wpchef.org that allows you to manage all your WPChef installations from a single place. The management system allows you to see what recipes, plugins and themes are installed on your sites and their versions. The management system is secure and provides the option via the settings page to opt out on an installation basis should the user want a specific installation to be unavailable for site management.</p>\n<h4>Legal Information</h4>\n<p>The WPChef plugin doesn&#8217;t send any personal information to wpchef.org. When a user decides to create a private account at wpchef.org, they are asked to enter a registration email and create a password. This information is not being pulled automatically from the site where the plugin is installed and it has to be entered manually. If you choose to manage your sites via the WPChef Site Management system, a list of installed plugins, themes and recipes will be sent to wpchef.org. During API queries to wpchef.org the site&#8217;s URL is being sent as well. WPChef uses it to create authorization tokens when a user decides to link the plugin with the wpchef.org private account. We value the privaсy of users and do everything we can to protect it.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wpchef.2.1.2.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": [],
    "stable_tag": "2.1.2",
    "versions": {
        "2.0.1": "https://downloads.wordpress.org/plugin/wpchef.2.0.1.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/wpchef.2.1.2.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wpchef.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/wpchef/assets/icon-128x128.png?rev=1854203",
        "2x": "https://ps.w.org/wpchef/assets/icon-256x256.png?rev=1854203"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}