{
    "name": "wpDirAuth",
    "slug": "wpdirauth",
    "version": "1.10.7",
    "author": "<a href=\"http://www.gilzow.com/\">Paul Gilzow</a>",
    "author_profile": "https://profiles.wordpress.org/gilzow/",
    "contributors": {
        "gilzow": {
            "profile": "https://profiles.wordpress.org/gilzow/",
            "avatar": "https://secure.gravatar.com/avatar/b836d5429d6b43f820c8e867f4246d72?s=96&d=monsterid&r=g",
            "display_name": "Paul Gilzow"
        },
        "stephdau": {
            "profile": "https://profiles.wordpress.org/stephdau/",
            "avatar": "https://secure.gravatar.com/avatar/5b8d74a711e183850bd70ccdd440d15e?s=96&d=monsterid&r=g",
            "display_name": "Stephane Daury (stephdau)"
        },
        "apokalyptik": {
            "profile": "https://profiles.wordpress.org/apokalyptik/",
            "avatar": "https://secure.gravatar.com/avatar/60b40db1e3946a29262eda6c78f33124?s=96&d=monsterid&r=g",
            "display_name": "apokalyptik"
        }
    },
    "requires": "2.2",
    "tested": "6.3.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 94,
    "ratings": {
        "5": 11,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 12,
    "support_url": "https://wordpress.org/support/plugin/wpdirauth/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 800,
    "downloaded": 44729,
    "last_updated": "2023-08-18 20:10:00",
    "added": "2007-08-29",
    "homepage": "http://wpdirauth.gilzow.com/",
    "sections": {
        "description": "<p>Please see the Changelog (Development tab above) for recent updates/changes.</p>\n<p>wpDirAuth shifts authentication from the local WordPress instance to a central directory (LDAP) server(s).</p>\n<p>wpDirAuth allows users of central directory (LDAP) servers to login to authorized WordPress instances without having to register. The plugin creates a new account for each directory user on first login so that they have full access to preferences and functions, as any WP user would. Activating the plugin will not restrict you to using directory authentication and you will still be able to both create new WP-only users as well as turn on public registration in WordPress. You can also assign any privilege levels to your directory users, and the those users will be referred to their institutional password policy whenever they would normally able to update their WP passwords (on the profile screen, in user edit, etc).</p>\n<h4>LDAP/LDAPS</h4>\n<p>Authentication should work with most LDAP enabled directory services, such as OpenLDAP, Apache Directory, Microsoft Active Directory, Novell eDirectory, Sun Java System Directory Server, and more. wpDirAuth supports LDAP and LDAPS (SSL) connectivity and can force SSL for WordPress authentication if it is available on the Web server. It also supports server connection pools, for pseudo load balancing and fault tolerance, or multiple source directory authentication. Because the key used to locate a user&#8217;s profile in the LDAP server is not always the same, depending on your LDAP server type and institutional choices, you can define your own through the wpDirAuth administration tool. When logging in as a directory user, the WP &#8220;remember me&#8221; feature is downgraded from 6 months for regular WP users to only 1 hour, so that institutional passwords are not overly endangered when accessing WP from public terminals.</p>\n<h4>Branding &amp; Notifications</h4>\n<p>You can define notifications addressed to your directory users in key WordPress areas, such as the login screen and the profile edit screen. Since these admin-editable values support HTML (admin, coders, beware of xss!), you can point your directory users to central support information related to functions such as changing their institutional password, a WordPress usage related policy, etc. There is also a simple and optional terms of services concept, only implemented for directory users, which will simply record a one-time acceptance date when agreed upon. Note that agreeing to the TOS has no effect on the user&#8217;s level of access in the system, fact which could change in future version if there is a demand for it, or through direct code contribution to that effect.</p>\n<h3>Using wpDirAuth</h3>\n<p>Once installed and activated, you will be able to administer your directory settings through the dedicated plugin configuration tool found under the <code>wpDirAuth</code> menu found in the WordPress <code>Settings</code> admin section. Directory Authenticated users can now be pre-added to your wordpress system and granted roles by going to the <code>Add Dir Auth User</code> menu found in the WordPress <code>Users</code> admin section. Contextual help for this section is available for this section within WordPress&#8217; built-in help menu. See the inline help found in the tool for more information on the settings. There is a secondary activation toggle, so you can install and activate the plugin, check out the options panel, but not immediately accept directory authentication, or even simply turn the feature on or off at any time.</p>\n<h3>Help and Support</h3>\n<p>Please post questions, request for help to the WordPress plugins forum or email <a href=\"mailto:&#119;&#x70;&#100;i&#x72;&#097;&#x75;&#116;&#x68;&#064;&#x67;&#105;&#x6c;&#122;&#111;&#x77;&#046;&#x63;&#111;&#x6d;\" rel=\"nofollow ugc\">&#119;&#x70;&#100;i&#x72;&#097;&#x75;&#116;&#x68;&#064;&#x67;&#105;&#x6c;&#122;&#111;&#x77;&#046;&#x63;&#111;&#x6d;</a>. Please be sure to include &#8216;wpdirauth&#8217; in the subject line.</p>\n<h3>TO-DO&#8217;s</h3>\n<ul>\n<li>Internationalization</li>\n<li>Refactor to a class</li>\n<li>More action/filter hooks</li>\n</ul>\n<h3>Source and Development</h3>\n<p>wpDirAuth welcomes friendly contributors wanting to lend a hand, be it in the form of code through SVN patches, user support, platform portability testing, security consulting, localization help, etc. The [current] goal is to keep the plugin self-contained (ie: no 3rd-party lib) for easier security maintenance, while keeping the code clean and extensible. Focus is on security, features, security, and let&#8217;s not forget, security. Unit tests will hopefully be developed and constant security audit performed. Recurring quality patch contributions will lead to commit privileges to the project source repository. Please post questions/requests for help to the wordpress forums and/or email <a href=\"mailto:&#119;&#x70;&#100;i&#x72;&#097;&#x75;&#116;&#x68;&#064;&#x67;&#105;&#x6c;&#122;&#111;&#x77;&#046;&#x63;&#111;&#x6d;\" rel=\"nofollow ugc\">&#119;&#x70;&#100;i&#x72;&#097;&#x75;&#116;&#x68;&#064;&#x67;&#105;&#x6c;&#122;&#111;&#x77;&#046;&#x63;&#111;&#x6d;</a></p>\n<h3>License</h3>\n<p><a href=\"http://www.gnu.org/licenses/gpl.html\" rel=\"nofollow ugc\">General Public License</a><br />\nCopyrights are listed in chronological order, by contributions.<br />\nwpDirAuth: WordPress Directory Authentication, original author<br />\nCopyright (c) 2007 Stephane Daury &#8211; http://stephane.daury.org/<br />\nwpDirAuth and wpLDAP Patch Contributions<br />\nCopyright (c) 2007 PKR Internet, LLC &#8211; http://www.pkrinternet.com/</p>\n<p>wpDirAuth Patch Contributions<br />\nCopyright (c) 2007 Todd Beverly<br />\nwpLDAP: WordPress LDAP Authentication<br />\nCopyright (c) 2007 Ashay Suresh Manjure &#8211; http://ashay.org/<br />\nwpDirAuth Patch Contribution and current maintainer<br />\nCopyright (c) 2010-2017 Paul Gilzow &#8211; http://gilzow.com/<br />\nwpDirAuth is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation.<br />\nwpDirAuth is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.<br />\nYou should have received a copy of the GNU General Public License along with this program. If not, see <a href=\"http://www.gnu.org/licenses/\" rel=\"nofollow ugc\">http://www.gnu.org/licenses/</a>.</p>\n<h3>Project History</h3>\n<p>Originally started from a patched version of wpLDAP (1.02+patch), wpDirAuth has<br />\nsince then been heavily overhauled and features have been modified and added.<br />\nIn other words, a classic case of <code>pimp my lib'</code> (hopefully for the better).<br />\n* Current: wpDirAuth: <a href=\"http://wpdirauth.gilzow.com/\" rel=\"nofollow ugc\">http://wpdirauth.gilzow.com/</a><br />\n* Original: wpLDAP: <a href=\"https://wordpress.org/plugins/wpldap/\" rel=\"ugc\">https://wordpress.org/plugins/wpldap/</a><br />\n* wpLDAP Patch: <a href=\"https://web.archive.org/web/20100731020249/http://www.pkrinternet.com/~rbulling/private/wpLDAP-1.02-ssl.patch\" rel=\"nofollow ugc\">https://web.archive.org/web/20100731020249/http://www.pkrinternet.com/~rbulling/private/wpLDAP-1.02-ssl.patch</a></p>\n",
        "installation": "<p>Installing should be a piece of cake and take fewer than ten minutes, provided you know your directory server(s) information, and that your blog is allowed to connect and bind to it/them. Please refer to your friendly neighbourhood LDAP sysadmin for more information. Or use a LDAP browser (e.g. Apache Directory Studio) to test/research what your specific connections settings need to be.</p>\n<ol>\n<li>Upload the <code>wpDirAuth</code> directory to the <code>/wp-content/plugins/</code> directory.</li>\n<li>Login to your WordPress instance as an admin user.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress.</li>\n<li>Go to the <code>wpDirAuth</code> menu found in the WordPress <code>Settings</code> section.</li>\n<li>Enter your directory server(s) information, Bind DN + password and set your preferences.<br />\nYou should now be able to login as a directory user.</li>\n</ol>\n",
        "changelog": "<h4>1.10.7</h4>\n<ul>\n<li>Bug fix: Corrects an issue with parameter order with implode() for users on PHP v8.0 and above. Apologies for two updates in one day. Big shoutout to https://www.forumsys.com/ for providing a publicly accessible LDAP instance for testing purposes.</li>\n</ul>\n<h4>1.10.6</h4>\n<ul>\n<li>Bug Fix: Reset Password button was showing up in ad-authenticated users&#8217; profile due to a removed global variable, that was removed starting at WordPress v6. Huge shout-out to user @silsbyc for assisting me in troubleshooting this one.</li>\n</ul>\n<h4>1.10.5</h4>\n<ul>\n<li>Bug Fix: LDAP properties for first/last name were reversed. Credit to @mradojevic for catching that.</li>\n</ul>\n<h4>1.10.4</h4>\n<ul>\n<li>Bug Fix: In multisite, when adding a user from the network admin panel, generated email would always link to https instead of the adhering to the option Require SSL Login.</li>\n</ul>\n<h4>1.10.3.</h4>\n<ul>\n<li>minor bug fix. Was missing user id when removing old password</li>\n</ul>\n<h4>1.10.2</h4>\n<ul>\n<li>fix bug where array of properties passed to ldap_search was in the wrong format.</li>\n</ul>\n<h4>1.10.1</h4>\n<ul>\n<li>Added filter <code>wpdirauth_ldap_user_keys</code></li>\n<li>removed call to deprecated function <code>force_ssl_login()</code></li>\n</ul>\n<h4>1.9.4</h4>\n<ul>\n<li>Correction to fix incompatibility with a couple of other plugins</li>\n</ul>\n<h4>1.9.3</h4>\n<ul>\n<li>Action/Filter hooks now available. Documentation: http://www.gilzow.com/_wpdirauth/hooks/</li>\n<li>Cookie time-out. The authentication cookie&#8217;s time-out can now be set in the settings panel. Time entered shoudl be in hours. Default is still one hour.</li>\n<li>Added PHP 5.2.X support (broken in previous versions), but this will likely be the last version that supports PHP versions less than 5.3</li>\n<li>CSS Changes in the settings area</li>\n<li>Fixed bug from 1.8.1 that allowed certain AD-authed users to still authenticate when directory authentication was disabled</li>\n</ul>\n<h4>1.8.1</h4>\n<ul>\n<li>I had forgotten that wp-login.php, for some odd reason, triggers the login/authenticate functions/filters when a user arrives to the page via GET method, even when the action parameter isn&#8217;t set. This was causing wpDirAuth to generate a WP_Error object when a user initially visited the page. If you were using another plugin that records login failures (e.g. anti Brute Force) this would result in two failed attempts for every single actual failed attempt.  Or if you are monitoring for failed attempts (e.g. Sucuri, iThemes Security) then you would receive false warnings of a failed login attempt using an &#8220;Unknown&#8221; username.</li>\n<li>Fix more typos</li>\n<li>Clean up the README cuz goodness it was a mess</li>\n</ul>\n<h4>1.8.0</h4>\n<ul>\n<li>wpDirAuth now uses the <code>authenticate</code> filter hook instead of overriding wp_authenticate() in pluggable.php.  This should increase its compatibility with other plugins that hook <code>authenticate</code>. HOWEVER, if you have another plugin that overrides wp_authenticate and doesn&#8217;t apply the <code>authenticate</code> filter, wpDirAuth will not work.</li>\n<li>Changed the Settings menu name from <code>Directory Auth.</code> to <code>wpDirAuth</code></li>\n<li>Removed a possible XSS / Redirection vulnerability if SSL Required was set to  true in wpDirAuth, the user visited the non-ssl&#8217;ed version of a site <em>and</em> an attacker injected/spoofed the HTTP_HOST header.</li>\n<li>Prevent direct file access</li>\n<li>Fixed a couple of typos</li>\n<li>Updated license to GPLv2 or later</li>\n<li>Changed the Safe Mode error messages to better explain the issues</li>\n</ul>\n<h4>1.7.17</h4>\n<ul>\n<li>bugfix &#8211; a local user account on systems using PHP version &lt; 5.3.9 would fail authentication, even if correct password was used. Many thanks to @tommcgee for helping me track this one down.</li>\n</ul>\n<h4>1.7.16</h4>\n<ul>\n<li>minor bugfixes that were causing PHP warning errors in specific situations.</li>\n</ul>\n<h4>1.7.15</h4>\n<ul>\n<li>let&#8217;s try this again. filter wpdirauth_filterquery will pass THREE parameters: current AD filter, the account filter as set in the wpDirAuth settings and the username of the person attempting to authenticate. Callback function must pass back a valid AD filter.</li>\n</ul>\n<h4>1.7.14</h4>\n<ul>\n<li>Why no 1.7.13? Because I&#8217;m superstitious.</li>\n<li>Added hookable filter wpdirauth_filterquery. Will pass 2 parameters: the current AD filter and the username of the person attempting to authenticate. Callback function must pass back a valid AD filter.</li>\n<li>v4.4.2 of wordpress changed some of the roles &amp; caps. Role create_users no longer allows admins who do not posses super-admin privilege in a multisite to see the wpDirAuth add user menu item when in a site.  changed the cap to add_users, but will continue to research</li>\n</ul>\n<h4>1.7.12</h4>\n<p>missed an instance of split (deprecated php function).</p>\n<h4>1.7.11</h4>\n<p>Adding stripslashes_deep because wordpress.</p>\n<h4>1.7.10</h4>\n<p>Bug fixes and minor clean-up</p>\n<h4>1.7.9</h4>\n<ul>\n<li>The plugin no longer automatically creates accounts for directory-authenticated users who log into the site.  You can enable this behavior in the plugin settings, but it is no longer the default behavior.</li>\n<li>Not sure why but I never set the plugin up to block Directory-Authenticated users from attempting to use the wordpress builtin password reset tool.  It can&#8217;t actually change the password, but it definitely caused confusion among users.  wpDirAuth now blocks directory-authenticated users from using the password reset tool.</li>\n<li>Removed a bunch of deprecated function calls.</li>\n<li>Cleaned up some of the debugging messages.</li>\n</ul>\n<h4>1.7.6</h4>\n<p>Corrected situation where a new authenticated user logging into a child site in a multisite network was added to the parent site, instead of the child site where they initiated the login. Also, somewhere along the way, I reintroduced a bug that when using authentication groups, the plugin would fail to redirect a successfully logged in user.</p>\n<h4>1.7.5</h4>\n<ul>\n<li>PLEASE NOTE Beta testers of the 1.7.X branch prior to version 1.7.5, you will need to deactivate wpdirauth before you updgrade to this latest version. Once you have installed and network activated the plugin, it will copy your options from their previous location to the sitemeta table. You will only need to do this once. This will also work for anyone who was using the 1.6.X branch or older and plans on using it in MULTISITE mode.</li>\n<li>MULTISITE support, bug fixes, security enhancements</li>\n</ul>\n<h4>1.6.1</h4>\n<ul>\n<li>Corrected a bug that would prevent user profiles from successfully being found. Thanks go to jgiangrande for identifying the problem area.</li>\n</ul>\n<h4>1.6.0</h4>\n<ul>\n<li>Added <code>Add Dir Auth User</code> to Admin User menu. Now able to pre-add Directory Authenticated users and assign roles where previously users would have to log in first, and then have an admin change their role.</li>\n</ul>\n<h4>1.5.2</h4>\n<ul>\n<li>Added ability to limit logins to specific AD groups. Fixed a bug that produced an incorrect filter when using a single Authentication Group</li>\n</ul>\n<h4>1.5.1</h4>\n<ul>\n<li>Remove default password nag for wpdirauth accounts</li>\n</ul>\n"
    },
    "short_description": "WordPress directory authentication plugin through LDAP and LDAPS (SSL).",
    "description": "<p>Please see the Changelog (Development tab above) for recent updates/changes.</p>\n<p>wpDirAuth shifts authentication from the local WordPress instance to a central directory (LDAP) server(s).</p>\n<p>wpDirAuth allows users of central directory (LDAP) servers to login to authorized WordPress instances without having to register. The plugin creates a new account for each directory user on first login so that they have full access to preferences and functions, as any WP user would. Activating the plugin will not restrict you to using directory authentication and you will still be able to both create new WP-only users as well as turn on public registration in WordPress. You can also assign any privilege levels to your directory users, and the those users will be referred to their institutional password policy whenever they would normally able to update their WP passwords (on the profile screen, in user edit, etc).</p>\n<h4>LDAP/LDAPS</h4>\n<p>Authentication should work with most LDAP enabled directory services, such as OpenLDAP, Apache Directory, Microsoft Active Directory, Novell eDirectory, Sun Java System Directory Server, and more. wpDirAuth supports LDAP and LDAPS (SSL) connectivity and can force SSL for WordPress authentication if it is available on the Web server. It also supports server connection pools, for pseudo load balancing and fault tolerance, or multiple source directory authentication. Because the key used to locate a user&#8217;s profile in the LDAP server is not always the same, depending on your LDAP server type and institutional choices, you can define your own through the wpDirAuth administration tool. When logging in as a directory user, the WP &#8220;remember me&#8221; feature is downgraded from 6 months for regular WP users to only 1 hour, so that institutional passwords are not overly endangered when accessing WP from public terminals.</p>\n<h4>Branding &amp; Notifications</h4>\n<p>You can define notifications addressed to your directory users in key WordPress areas, such as the login screen and the profile edit screen. Since these admin-editable values support HTML (admin, coders, beware of xss!), you can point your directory users to central support information related to functions such as changing their institutional password, a WordPress usage related policy, etc. There is also a simple and optional terms of services concept, only implemented for directory users, which will simply record a one-time acceptance date when agreed upon. Note that agreeing to the TOS has no effect on the user&#8217;s level of access in the system, fact which could change in future version if there is a demand for it, or through direct code contribution to that effect.</p>\n<h3>Using wpDirAuth</h3>\n<p>Once installed and activated, you will be able to administer your directory settings through the dedicated plugin configuration tool found under the <code>wpDirAuth</code> menu found in the WordPress <code>Settings</code> admin section. Directory Authenticated users can now be pre-added to your wordpress system and granted roles by going to the <code>Add Dir Auth User</code> menu found in the WordPress <code>Users</code> admin section. Contextual help for this section is available for this section within WordPress&#8217; built-in help menu. See the inline help found in the tool for more information on the settings. There is a secondary activation toggle, so you can install and activate the plugin, check out the options panel, but not immediately accept directory authentication, or even simply turn the feature on or off at any time.</p>\n<h3>Help and Support</h3>\n<p>Please post questions, request for help to the WordPress plugins forum or email <a href=\"mailto:&#119;&#x70;&#100;i&#x72;&#097;&#x75;&#116;&#x68;&#064;&#x67;&#105;&#x6c;&#122;&#111;&#x77;&#046;&#x63;&#111;&#x6d;\" rel=\"nofollow ugc\">&#119;&#x70;&#100;i&#x72;&#097;&#x75;&#116;&#x68;&#064;&#x67;&#105;&#x6c;&#122;&#111;&#x77;&#046;&#x63;&#111;&#x6d;</a>. Please be sure to include &#8216;wpdirauth&#8217; in the subject line.</p>\n<h3>TO-DO&#8217;s</h3>\n<ul>\n<li>Internationalization</li>\n<li>Refactor to a class</li>\n<li>More action/filter hooks</li>\n</ul>\n<h3>Source and Development</h3>\n<p>wpDirAuth welcomes friendly contributors wanting to lend a hand, be it in the form of code through SVN patches, user support, platform portability testing, security consulting, localization help, etc. The [current] goal is to keep the plugin self-contained (ie: no 3rd-party lib) for easier security maintenance, while keeping the code clean and extensible. Focus is on security, features, security, and let&#8217;s not forget, security. Unit tests will hopefully be developed and constant security audit performed. Recurring quality patch contributions will lead to commit privileges to the project source repository. Please post questions/requests for help to the wordpress forums and/or email <a href=\"mailto:&#119;&#x70;&#100;i&#x72;&#097;&#x75;&#116;&#x68;&#064;&#x67;&#105;&#x6c;&#122;&#111;&#x77;&#046;&#x63;&#111;&#x6d;\" rel=\"nofollow ugc\">&#119;&#x70;&#100;i&#x72;&#097;&#x75;&#116;&#x68;&#064;&#x67;&#105;&#x6c;&#122;&#111;&#x77;&#046;&#x63;&#111;&#x6d;</a></p>\n<h3>License</h3>\n<p><a href=\"http://www.gnu.org/licenses/gpl.html\" rel=\"nofollow ugc\">General Public License</a><br />\nCopyrights are listed in chronological order, by contributions.<br />\nwpDirAuth: WordPress Directory Authentication, original author<br />\nCopyright (c) 2007 Stephane Daury &#8211; http://stephane.daury.org/<br />\nwpDirAuth and wpLDAP Patch Contributions<br />\nCopyright (c) 2007 PKR Internet, LLC &#8211; http://www.pkrinternet.com/</p>\n<p>wpDirAuth Patch Contributions<br />\nCopyright (c) 2007 Todd Beverly<br />\nwpLDAP: WordPress LDAP Authentication<br />\nCopyright (c) 2007 Ashay Suresh Manjure &#8211; http://ashay.org/<br />\nwpDirAuth Patch Contribution and current maintainer<br />\nCopyright (c) 2010-2017 Paul Gilzow &#8211; http://gilzow.com/<br />\nwpDirAuth is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation.<br />\nwpDirAuth is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.<br />\nYou should have received a copy of the GNU General Public License along with this program. If not, see <a href=\"http://www.gnu.org/licenses/\" rel=\"nofollow ugc\">http://www.gnu.org/licenses/</a>.</p>\n<h3>Project History</h3>\n<p>Originally started from a patched version of wpLDAP (1.02+patch), wpDirAuth has<br />\nsince then been heavily overhauled and features have been modified and added.<br />\nIn other words, a classic case of <code>pimp my lib'</code> (hopefully for the better).<br />\n* Current: wpDirAuth: <a href=\"http://wpdirauth.gilzow.com/\" rel=\"nofollow ugc\">http://wpdirauth.gilzow.com/</a><br />\n* Original: wpLDAP: <a href=\"https://wordpress.org/plugins/wpldap/\" rel=\"ugc\">https://wordpress.org/plugins/wpldap/</a><br />\n* wpLDAP Patch: <a href=\"https://web.archive.org/web/20100731020249/http://www.pkrinternet.com/~rbulling/private/wpLDAP-1.02-ssl.patch\" rel=\"nofollow ugc\">https://web.archive.org/web/20100731020249/http://www.pkrinternet.com/~rbulling/private/wpLDAP-1.02-ssl.patch</a></p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wpdirauth.1.10.7.zip",
    "upgrade_notice": [],
    "screenshots": [],
    "tags": {
        "authentication": "authentication",
        "directory": "directory",
        "ldap": "ldap",
        "ldaps": "ldaps",
        "login": "login"
    },
    "stable_tag": "1.10.7",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/wpdirauth.1.0.zip",
        "1.1": "https://downloads.wordpress.org/plugin/wpdirauth.1.1.zip",
        "1.10.1": "https://downloads.wordpress.org/plugin/wpdirauth.1.10.1.zip",
        "1.10.2": "https://downloads.wordpress.org/plugin/wpdirauth.1.10.2.zip",
        "1.10.4": "https://downloads.wordpress.org/plugin/wpdirauth.1.10.4.zip",
        "1.10.5": "https://downloads.wordpress.org/plugin/wpdirauth.1.10.5.zip",
        "1.10.6": "https://downloads.wordpress.org/plugin/wpdirauth.1.10.6.zip",
        "1.10.7": "https://downloads.wordpress.org/plugin/wpdirauth.1.10.7.zip",
        "1.2": "https://downloads.wordpress.org/plugin/wpdirauth.1.2.zip",
        "1.5": "https://downloads.wordpress.org/plugin/wpdirauth.1.5.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/wpdirauth.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/wpdirauth.1.5.2.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/wpdirauth.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/wpdirauth.1.6.1.zip",
        "1.7.12": "https://downloads.wordpress.org/plugin/wpdirauth.1.7.12.zip",
        "1.7.14": "https://downloads.wordpress.org/plugin/wpdirauth.1.7.14.zip",
        "1.7.15": "https://downloads.wordpress.org/plugin/wpdirauth.1.7.15.zip",
        "1.7.16": "https://downloads.wordpress.org/plugin/wpdirauth.1.7.16.zip",
        "1.7.17": "https://downloads.wordpress.org/plugin/wpdirauth.1.7.17.zip",
        "1.7.5": "https://downloads.wordpress.org/plugin/wpdirauth.1.7.5.zip",
        "1.7.6": "https://downloads.wordpress.org/plugin/wpdirauth.1.7.6.zip",
        "1.7.9": "https://downloads.wordpress.org/plugin/wpdirauth.1.7.9.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/wpdirauth.1.8.0.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/wpdirauth.1.8.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wpdirauth.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/wpdirauth.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 94,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}