{
    "name": "WPEForm Lite &#8211; Drag and Drop Live Form Builder for Contact, Payment &amp; Quiz Forms",
    "slug": "wpeform-lite",
    "version": "1.6.5",
    "author": "<a href=\"https://www.wpeform.io\">WPEForm</a>",
    "author_profile": "https://profiles.wordpress.org/swashata/",
    "contributors": {
        "swashata": {
            "profile": "https://profiles.wordpress.org/swashata/",
            "avatar": "https://secure.gravatar.com/avatar/c783843f11ceb5c2be620d483021da2b?s=96&d=monsterid&r=g",
            "display_name": "Swashata Ghosh"
        },
        "wpeform": {
            "profile": "https://profiles.wordpress.org/wpeform/",
            "avatar": "https://secure.gravatar.com/avatar/153658f561049369eccb4c17338481f9?s=96&d=monsterid&r=g",
            "display_name": "WPEForm"
        },
        "freemius": {
            "profile": "https://profiles.wordpress.org/freemius/",
            "avatar": "https://secure.gravatar.com/avatar/3ac33da92186a78937b307bdd9e906ee?s=96&d=monsterid&r=g",
            "display_name": "Freemius"
        }
    },
    "requires": "5.4",
    "tested": "6.3.5",
    "requires_php": "7.1",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 100,
    "ratings": {
        "5": 1,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 1,
    "support_url": "https://wordpress.org/support/plugin/wpeform-lite/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 30,
    "downloaded": 1961,
    "last_updated": "2023-07-06 3:22pm GMT",
    "added": "2021-07-23",
    "homepage": "https://www.wpeform.io",
    "sections": {
        "description": "<h4>WordPress Contact, Payment &amp; Quiz Form Builder Plugin</h4>\n<p>WPEForm is a Live, No-Code, Drag-N-Drop Form Builder for quizzes, payment estimations, personality tests, surveys, contacts, lead generations and user feedback of all kinds.</p>\n<p>Exclusively written for WordPress <strong>the goal is to help you get started in 10 minutes</strong>.</p>\n<p>With WPEForm, you create a form with our intuitive and a truly No-Code Form Builder.</p>\n<ol>\n<li>You drag and drop your favorite form elements with our best in class Form Builder.</li>\n<li>Publish it on your website with Gutenberg Blocks or Shortcodes or new Block Widgets or the Landing page.</li>\n<li>Collect data from your users.</li>\n</ol>\n<p><a href=\"https://www.wpeform.io/examples/?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" title=\"Examples - WPEForm - WordPress Form Builder\" rel=\"friend nofollow ugc\">Examples</a> | <a href=\"https://www.wpeform.io/docs/?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" title=\"Knowledge Base - WPEForm - WordPress Form Builder\" rel=\"friend nofollow ugc\">Documentation</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/yyiNcolvO6Y?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>The best features of our form builder includes</p>\n<ul>\n<li>100% <strong>Mobile and Container responsive</strong>. No matter what device or what area of your theme, forms <em>will</em> look good. The grid of the form responds to the width of the container it is placed in.</li>\n<li>With latest shadow dom technology, your forms will look the same, no matter what the theme. If you want, you can turn this feature off.</li>\n<li>View <strong>your submissions from WordPress admin</strong>, right from the free plan. That&#8217;s right, we don&#8217;t block viewing submissions behind a paywall. Apart from email notifications, you always have the option to view it from the admin area.</li>\n<li>Keep your <a href=\"https://www.wpeform.io/docs/getting-started/form-builder/#adding-editors-to-form?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" rel=\"nofollow ugc\">forms private</a> in WordPress and share with only the WordPress users you trust.</li>\n<li>Very <strong>modern form builder</strong>, built with TypeScript/React and a GraphQL API.</li>\n<li>You can <strong>edit form submissions</strong> from admin. You can even let (with limitations) submitting users edit their submissions.</li>\n<li>Comes with <strong>many color schemes</strong>. If you don&#8217;t like them, you can always create your own with our handy color picker.</li>\n<li>All form elements&#8217; label, description, title etc are <strong>rich text based</strong>. Change colors, format text, insert images, videos, there is absolutely no limitations.</li>\n<li><strong>Multi paged forms</strong> are treated as first-class citizens. Large forms should be split into multiple pages and WPEForm makes it easier than ever.</li>\n<li><strong>Personality tests</strong> with multi tiered outcomes. You can create buzz feed like quizzes without hiring a developer.</li>\n<li><a href=\"https://prod.wpeform.io/wp-eform/form/starter-purchase-product-with-addons/24/\" rel=\"nofollow ugc\"><strong>Automatic landing pages</strong> like this</a> all from your WordPress site starting with WPEForm Lite.</li>\n<li><a href=\"https://www.wpeform.io/docs/advanced-topics/headless-mode/\" rel=\"nofollow ugc\"><strong>Headless mode</strong></a>, create your forms in WordPress, publish them on your CDN deployed static sites, like Gatsby, Nextjs etc (totally free).</li>\n</ul>\n<p><strong>Premium Version</strong></p>\n<blockquote>\n<p>This is the lite and free version of WPEForm. It gives you all features you need for contact forms and quizzes. For more advanced usage, do check our <a href=\"https://www.wpeform.io?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" title=\"WPEForm - WordPress Form Builder\" rel=\"friend nofollow ugc\">Premium versions</a>. You will like all the more form elements, integrations, newsletter and payment functionalities.</p>\n</blockquote>\n<p>We understand that <strong>a form is like a mini application</strong>. It needs to be interactive, responsive and fast. Our whole product is centered around these ideas.</p>\n<h3>Live Form Builder with Drag and Drop</h3>\n<p>Our form builder is the first of its kind for WordPress. It built on top of a <strong>GraphQL API</strong> with <strong>TypeScript/React</strong>. We want the form builder to be super fast and intuitive, giving you the best possible User Experience (UX). You spend more time building your forms, not fighting the Form Builder.</p>\n<ul>\n<li>Add any number of pages or tabs to the form.</li>\n<li>Add any number of elements to the page.</li>\n<li>Align form elements in columns of custom sizes on different breakpoints.</li>\n<li>Easily access form settings from sidebars.</li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/HsCKUSvxcj4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>In the video above, we see a full tutorial to create <a href=\"https://prod.wpeform.io/wp-eform/form/starter-exhibition-event-feedback-form/12/\" rel=\"nofollow ugc\">this form</a> in under 8 minutes. Install now and see for yourself. Our whole powerful form builder is available from the <strong>FREE</strong> plan. We didn&#8217;t put any performance features behind paywall.</p>\n<h3>Pre Built Form Templates</h3>\n<p>We have included many form templates to help you get started right away. You do not always need to start from scratch. Most of the form templates are available right inside the New Form Wizard. More templates can be viewed and downloaded from our <a href=\"https://www.wpeform.io/examples/?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" title=\"Examples - WPEForm - WordPress Form Builder\" rel=\"friend nofollow ugc\">Examples page</a>.</p>\n<h3>Tier based Personality Quizzes</h3>\n<p>You can have any number of Score Tiers, like personality scores. All WPEForm elements can have scores assigned to them. Depending on the choice of the user you can add any score to any of the tiers.</p>\n<p>This gives you 100% flexibility on how scores are calculated. See <a href=\"https://prod.wpeform.io/wp-eform/form/free-personality-quiz/9/\" rel=\"nofollow ugc\">this form</a> for an example.</p>\n<p>All the above comes <strong>FREE</strong> with WPEForm. With <strong>STARTER</strong> plan you can put timers per page (or overall), record submission time and show graphs of different tiers of submissions. See <a href=\"https://prod.wpeform.io/wp-eform/system/summary/?mode=preview&amp;token=8d6d80fd3547dc2b3de94c4039f73051\" rel=\"nofollow ugc\">this example</a>.</p>\n<h3>Browse Form Entries</h3>\n<p>With WPEForm Lite (and of course premium) you always get to see list of submissions made by your users. Whenever someone submits the form, it gets saved in your WordPress database and shows up in WPEForm administrative area.</p>\n<p>Just go to WPEForm / Submissions and see all entries and leads. You can view or edit the entries or delete them.</p>\n<h3>Form Landing Pages optimized for distraction free Conversion</h3>\n<p>Right from our free plan, you get standalone, landing pages. Just click on the Preview button and copy the URL. See <a href=\"https://prod.wpeform.io/wp-eform/form/starter-purchase-product-with-addons/24/\" rel=\"nofollow ugc\">this form</a> as an example. With the upcoming professional version, you will be able to customize more of the landing page, without writing any code. Just like google forms or typeforms, but right inside your very own WordPress.</p>\n<h3>25+ Form Elements to choose from</h3>\n<p>WPEForm comes with all the form elements you could think of and more. We are in active development of form elements, so you will almost never run out of options. And if you do, we humbly ask that you let us know and we will do our best to bring it to the next version.</p>\n<p>The <strong>FREE</strong> version of WPEForm comes with basic sets of form elements, namely<br />\nRadio, Checkbox, Dropdown, Text, TextArea, a few design elements like Heading, Question Group, Article and the Captcha security element. These should be enough for anyone just starting out with contact forms.</p>\n<p>As your requirements grow, you can upgrade WPEForm to one of the paid plans and gain access to more form elements. Right now, we&#8217;ve released the <strong>STARTER</strong> plan which has the following extra elements (on top of everything available from the <strong>FREE</strong> version): Toggle, Math output, Slider, Range, Rating, Matrix Choice, Matrix Input, DateTime, Slider Group, Range Group, Rating Group, Math Group, Sortable, Stacked Group and Address.</p>\n<p>Stay tuned as we release more form elements tailored to solve your problems.</p>\n<h3>Truly responsive form design</h3>\n<p>WPEForm forms are truly responsive. They respect the size of the container you put them in. This is very helpful when you place the forms in narrow widgets or footers or popups. They just look good and work.</p>\n<p>An example to attention to detail would be our <strong>Dropdown Element</strong>. It is available from <strong>FREE</strong> plan and very unique. When viewed from mobile it shows a pop-up type dropdown near the thumb of your user. When viewed from desktop, it shows a regular dropdown.</p>\n<p>You also get many form themes which would work with any WordPress theme out there (more on this later). If you do not like our color schemes, you can always make your own.</p>\n<p>Lastly in the <strong>STARTER</strong> plan, there&#8217;s a <strong>Dark Mode</strong> feature. When enabled, the form will response to the visitor&#8217;s preference and turn on dark mode for itself.</p>\n<h3>100% Conflict free with any themes or plugins</h3>\n<p>We are using latest Web Technologies with WPEForm. The goal is to give a form that looks the same no matter which WordPress theme you are using. For this we&#8217;ve leveraged the <a href=\"https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_shadow_DOM\" rel=\"nofollow ugc\">Shadow DOM</a> API. It just ensures that CSS coming from your theme or any other plugin doesn&#8217;t interfere with WPEForm and vice-versa.</p>\n<p>As long as your website doesn&#8217;t produce any JavaScript error on the page our forms are guaranteed to work.</p>\n<p>By the way, if you want your theme to override WPEForm styles, you can turn this feature off from Site Settings of WPEForm.</p>\n<h3>Best in class administration</h3>\n<p>WPEForm comes with exhaustive administration features. We&#8217;ve included everything you need to administrate the submissions. If you think something is missing, then do let us know and we will do our best to add it.</p>\n<ul>\n<li>View and Edit submissions from WordPress admin.</li>\n<li>Get notified and notify your users when someone submits a form.</li>\n<li>Categorize forms for easy access and filter.</li>\n</ul>\n<p>and much more. Install now to see them in action.</p>\n<h3>Share forms with multiple users</h3>\n<p>By default a form is scoped to the WordPress user who created it. In the default configuration</p>\n<ol>\n<li>Administrators and Editors can create forms.</li>\n<li>Editors can view only the forms they have created and their submissions.</li>\n<li>Administrators and editors can share the form with other admins and editors.</li>\n<li>Shared forms give privilege to view/edit form and submissions.</li>\n</ol>\n<p>This works great for a network of form authors. In future we will add capabilities editor so that you can choose who exactly can create forms regardless of their WordPress role.</p>\n<h3>Powerful Conditional Logic System</h3>\n<p>Any form builder is useless without logical steps. WPEForm treats conditional logic as first-class citizen. With our system you can</p>\n<ol>\n<li>Show or hide individual form elements or groups or pages;</li>\n<li>Set value of other elements;</li>\n</ol>\n<p>Depending on the value (or values) of the source element.</p>\n<p>The logical system is split into two things:</p>\n<ol>\n<li>Events &#8211; You choose combination (with <em>AND</em> or <em>OR</em> operators) of events.</li>\n<li>Consequences &#8211; If the event was successful, you fire up consequences.</li>\n</ol>\n<h3>Headless Form Mode</h3>\n<p>This is the very first in WordPress. Our Forms are basically react app with a GraphQL API. So we&#8217;ve made a way, you can run WPEForm in headless mode. Just add one config in your <code>wp-config.php</code> and we are good to go. Some use cases includes:</p>\n<ol>\n<li>Make your forms in your WordPress site and render on your static sites.</li>\n<li>Use your own form library and communicate with the GraphQL API to send submissions.</li>\n<li>Render forms on your React applications, GatsbyJS site or Next.js sites.</li>\n</ol>\n<p>The possibilities are endless and we are just getting started. Be sure to read our <a href=\"https://www.wpeform.io/docs/advanced-topics/headless-mode/\" rel=\"nofollow ugc\">documentation website</a> to learn how you can setup headless mode and start using forms in your react applications today.</p>\n<p>This feature is totally opt-in and is disable by default. You do not have to worry about security concerns because by default the GraphQL API is hardened with a nonce verification. If you do enable headless mode, it will run with anonymous user when sending submissions. We&#8217;ve made sure the API is super secure, with 100s of automated tests. But of course we are also human. Should something bad happens, we will be prompt to patch it.</p>\n<h3>FREE PLAN FEATURES</h3>\n<h4>Starter form elements pack</h4>\n<p>Starter form elements pack includes Checkbox, Button, Group, Row, Column, Dropdown, Heading, Radio, Captcha, Text, TextArea, Slider.</p>\n<h4>Starter form themes pack</h4>\n<p>Starter form themes comes with great colors from Material UI. We&#8217;ve also included the two themes, Vivid Blue and Teal from our premium theme pack. No themes support dark mode in the <strong>FREE</strong> version.</p>\n<h4>Customizable Theme</h4>\n<p>You can set primary color, text color and background color and the system will create a beautiful form theme for you. This feature is included in the <strong>FREE</strong> version so that you can always match your form with your website.</p>\n<h4>Conditional logics and outcomes</h4>\n<p>The full features of conditional logic, events and consequences are available from the <strong>FREE</strong> plan. No feature is behind a paywall here.</p>\n<h4>Outcome and tier based quizzes</h4>\n<p>Add as many types of outcomes you want. There is no limit. However the graphs and designation part of the summary table is only available from the starter plan.</p>\n<h4>Submission summary and notifications</h4>\n<p>After submitting a form, your users would get a notification with a link to the summary page. Of course you can change the notification from the WPEForm Form settings. Here&#8217;s an example of <a href=\"https://prod.wpeform.io/wp-eform/system/user-email/?token=8d6d80fd3547dc2b3de94c4039f73051\" rel=\"nofollow ugc\">email sent to user</a>. Similar email is sent to administrator of the form with more links to administrate the submission.</p>\n<h4>User portal page</h4>\n<p>Central page to access ones own submissions. Please see the screenshot.</p>\n<h4>Form categories</h4>\n<p>Create and assign categories to forms. Available from Free version.</p>\n<h4>Shared form editors.</h4>\n<p>Share forms with your editors as explained above. The full functionality is available from free version.</p>\n<h3>STARTER PLAN FEATURES</h3>\n<p>Starter plan includes all the features from the <strong>FREE</strong> plan and more.</p>\n<h4>PDF downloads</h4>\n<p>PDF download submissions for both administrator and users. Email attachment is coming soon.</p>\n<h4>Extended form elements</h4>\n<p>Extended form elements includes &#8211; Toggle, Math output, Range, Rating, Matrix Choice, Matrix Input, DateTime, Slider Group, Range Group, Rating Group, Math Group, Sortable, Stacked Group.</p>\n<h4>Numeric calculations</h4>\n<p>Assign numeric value to almost any form element and use the Math Output element with valid numeric formula to show estimate.</p>\n<h4>Extended form themes pack</h4>\n<p>Many premium form themes based on the color schemes of Refactoring UI book. More themes on the way.</p>\n<h4>Dark form themes pack</h4>\n<p>Make your forms stand out by automatically responding to user&#8217;s color preference. When turned on, the forms will turn Dark if user prefers a dark color scheme. This is best used with WordPress themes that support dark mode. You can also keep the dark mode always on, if that&#8217;s your preference.</p>\n<h4>Form timer and stopwatch</h4>\n<p>Have page wise or overall form timer for restricted quizzes. Also record the form submission time with a stopwatch.</p>\n<h4>Graphs for quiz outcomes.</h4>\n<p>When you have multiple outcomes or tiers in your quiz setup, a radar graph will show up in the summary page. It will also include data-table for different outcomes along with designations you&#8217;ve set.</p>\n<h3>PROFESSIONAL AND BUSINESS FEATURE</h3>\n<p>We are currently working on the professional and business plans of WPEForm. Please see our Roadmap for more information.</p>\n<h3>Roadmap</h3>\n<p>We are just getting warmed up with the initial release of WPEForm. We have tons of features in our todo list. Here are some of the important upcoming features.</p>\n<ul>\n<li><strong>FREE</strong> &#8211; Make translation easier. We need to modify the tooling on the source.</li>\n<li><strong>STARTER</strong> &#8211; PDF attachment of submission in admin and user email.</li>\n<li><strong>STARTER</strong> &#8211; Modify the output of summary page.</li>\n<li><strong>STARTER</strong> &#8211; Custom dataset for MCQ elements.</li>\n<li><strong>PRO</strong> &#8211; All pro features, especially payments and integrations.</li>\n<li><strong>BUSINESS</strong> &#8211; All business features, especially WordPress core integration, like guest blogging, login forms, registration forms, profile update forms etc.</li>\n</ul>\n<p>and more. Follow me on <a href=\"https://twitter.com/swashata/\" rel=\"nofollow ugc\">Twitter</a> for updates and React/TypeScript tips.</p>\n",
        "installation": "<p>You install WPEForm like any other WordPress plugin.</p>\n<ol>\n<li>Go to yourwebsite/wp-admin &gt; Plugins &gt; Add New.</li>\n<li>Search for <code>WPEForm Form Builder</code>.</li>\n<li>Install and Activate the plugin.</li>\n</ol>\n<p>Alternately you can download from here and upload onto your website.</p>\n<p>After installation</p>\n<ol>\n<li>Go to WPEForm &gt; Dashboard.</li>\n<li>Click on <strong>New Form</strong> button.</li>\n</ol>\n<p>More information on installation can be found in our <a href=\"https://www.wpeform.io/docs/?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" rel=\"nofollow ugc\">Documentation</a> website.</p>\n",
        "faq": "\n<dt id='where%20can%20i%20find%20documentation%3F'>\nWhere can I find documentation?\n</h4>\n<p>\n<p>Updated version of documentation can always be found at <a href=\"https://www.wpeform.io/docs/?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" rel=\"nofollow ugc\">WPEForm Knowledge-base</a></p>\n</p>\n<dt id='is%20this%20wpeform%20translation%20ready%3F'>\nIs this WPEForm translation ready?\n</h4>\n<p>\n<p>Yes, both server side and client side assets are translation ready. All po, mo and json files should go inside the <code>languages</code> directory. We have included sample po, mo and json files from where you can copy and start translating. Detailed instruction can be found in <a href=\"https://www.wpeform.io/docs/advanced-topics/translate-wpeform-your-language/\" rel=\"nofollow ugc\">our documentation website</a>.</p>\n</p>\n<dt id='why%20should%20i%20choose%20wpeform%3F'>\nWhy should I choose WPEForm?\n</h4>\n<p>\n<p>You <em>may</em> choose WPEForm if:</p>\n<ul>\n<li>You are a business owner, looking to create high converting forms.</li>\n<li>You are a developer, looking to create beautiful forms for your clients.</li>\n<li>You have a personal blog, where you want a good looking form.</li>\n<li>You are a photographer, looking to collect feedbacks from your viewers and customers.</li>\n<li>You are a designer, looking for a way your clients can get in touch with you.</li>\n<li>You need a cost estimation and quotation form for your agency.</li>\n<li>You need a health record form to keep track of your patients or clients.</li>\n</ul>\n<p>you get the idea. If our drag and drop form builder cannot solve your requirements, let us know and we will make sure it does.</p>\n</p>\n<dt id='what%20types%20of%20forms%20can%20i%20create%20with%20wpeform%3F'>\nWhat types of Forms can I create with WPEForm?\n</h4>\n<p>\n<p>Basically every kinds of forms can be made with WPEForm.</p>\n<ul>\n<li>Contact forms.</li>\n<li>Website survey and feedback forms.</li>\n<li>Business and operations forms.</li>\n<li>Payment forms.</li>\n<li>Cost estimator forms.</li>\n<li>Event management and booking forms.</li>\n<li>Employee request forms.</li>\n</ul>\n<p>Do visit our <a href=\"https://www.wpeform.io/examples/?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" rel=\"nofollow ugc\">examples page</a> for more form templates.</p>\n</p>\n<dt id='do%20i%20need%20to%20know%20coding%3F'>\nDo I need to know coding?\n</h4>\n<p>\n<p>Not at all. The primary goal of WPEForm is to help you create forms, without needing to write any code. With WPEForm you have access to a live, drag and drop form builder. Just visualize and build your forms. Very much like the new and excellent block editor WordPress offers.</p>\n</p>\n<dt id='can%20i%20import%2Fexport%20forms%20between%20my%20sites'>\nCan I import/export forms between my sites\n</h4>\n<p>\n<p>Yes. Right from admin dashboard, you get the option to export your form as a <code>json</code> file. Then on the new form wizard, you get another option to import from the json file. It is that easy.</p>\n</p>\n<dt id='i%20am%20stuck%2C%20where%20can%20i%20get%20support%3F'>\nI am stuck, where can I get support?\n</h4>\n<p>\n<p>Please visit our <a href=\"https://www.wpeform.io/contact/?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" rel=\"nofollow ugc\">support page</a>.</p>\n</p>\n<dt id='what%20is%20this%20graphql%20thing%20wpeform%20is%20built%20with%3F'>\nWhat is this GraphQL thing WPEForm is built with?\n</h4>\n<p>\n<p>I am very glad you asked this question. Traditionally many plugins are built where the server would send the HTML needed to render a plugin&#8217;s output. This technique is very well suited for SEO related contents, like your blog posts. But, rendering forms with this technique can severely slow down the server. <strong>A form is like a mini application</strong>. It needs to be interactive, fast and very responsive.</p>\n<p>A better suited way is to let the server deal only with the form data (very similar to the json file you get when you download an export code of a form). Let the client, i.e, your users browser render the form. This approach is sometimes called JAMStack. Where we deal with JavaScript, API and Markup. This is very new and very hot. Personally I wanted to bring this to WordPress. I also made a tooling <a href=\"https://wpack.io\" rel=\"nofollow ugc\">wpack.io</a> to make this easier for WordPress developer.</p>\n<p>So I choose GraphQL to deal with the API part and React to render forms and manage application. This way, the server remains very fast. It does not have to do anything with application logic, just the very important business logic. The client also remains fast, because with GraphQL API, it just gets the data it needs, and not a single byte more.</p>\n<p>With this API based development approach, we now can offer you, for the first time in WordPress, headless forms. Make your forms in your WordPress Admin. Then use our client library to render your forms on static websites, like Gatsby, nextjs, or basically anywhere.</p>\n</p>\n<dt id='where%20can%20i%20find%20the%20source%20code%3F'>\nWhere can I find the source code?\n</h4>\n<p>\n<p>The human readable PHP source code is available in this repository. The JavaScript code can be found at <a href=\"https://www.npmjs.com/package/@wpeform/react\" rel=\"nofollow ugc\">@wpeform/react</a> npm repository. We will very soon separate all our components and put it on GitHub for other open source usage.</p>\n</p>\n\n",
        "changelog": "<h4>v1.6.5 (2023-07-06)</h4>\n<ul>\n<li>DEPS: Upgrade freemius SDK.</li>\n<li>DEPS: Update tested up to for WordPress.</li>\n</ul>\n<h4>v1.6.4 (2022-11-04)</h4>\n<ul>\n<li>REFACTOR: Major refactoring of the main Submission Handler to better handle internal state with small classes. This helps in opening up the system to add more complex features.</li>\n<li>DEPS: Update Freemius SDK to v2.4.5.</li>\n<li>DEPS: Update all JS dependencies to latest semver.</li>\n<li>UPDATE: (TS) Update and use new APIs of zustand state management library.</li>\n</ul>\n<h4>v1.6.3 (2022-03-04)</h4>\n<ul>\n<li>FIX: Security update.</li>\n</ul>\n<h4>v1.6.2 (2022-02-11)</h4>\n<ul>\n<li>CHORE: WordPress 5.9 compatibility check.</li>\n</ul>\n<h4>v1.6.1 (2021-11-09)</h4>\n<ul>\n<li>FIX: Invalid default address being generated in <code>localhost</code> environment.</li>\n</ul>\n<h4>v1.6.0 (2021-09-10)</h4>\n<ul>\n<li>FEAT: New WP Dashboard widget for quick stats.</li>\n<li>FEAT: Update freemius SDK to latest 2.4.2 stable.</li>\n<li>FEAT: New setup script for headless forms.</li>\n<li>FEAT: Form view properly increases in headless mode.</li>\n<li>FEAT: Use prism react renderer in admin side for better perf.</li>\n<li>FIX: Button appearance in admin notices.</li>\n<li>FIX: Settings HTML leaking into shortcode generator page.</li>\n</ul>\n<p><strong>Premium</strong></p>\n<ul>\n<li>FIX: Trial version not allowing premium features.</li>\n</ul>\n<h4>v1.5.3 (2021-08-14)</h4>\n<ul>\n<li>FIX: Weird appearance in fontawesome icon picker.</li>\n<li>FIX: Move to menu appearance issue in form builder.</li>\n</ul>\n<h4>v1.5.2 (2021-08-12)</h4>\n<ul>\n<li>FIX: Use proper cache control in form and submission GraphQL Queries.</li>\n<li>CHORE: Plugin file header tags for WP 5.8 requirements.</li>\n</ul>\n<h4>v1.5.1 (2021-08-11)</h4>\n<ul>\n<li>FIX: Add cache control to preflight check in headless mode.</li>\n</ul>\n<h4>v1.5.0 (2021-08-11)</h4>\n<ul>\n<li>FEAT: Override dark mode feature for headless forms.</li>\n<li>FEAT: Use a spinner type control for Slider free input.</li>\n<li>FEAT: Properly support floating point in sliders and ranges.</li>\n<li>FEAT: Better admin side configuration validation system.</li>\n<li>FIX: Use proper mobile keyboard for different input masks.</li>\n<li>FIX: Error message overflow issue on sliders with custom marks.</li>\n</ul>\n<h4>v1.4.0 (2021-08-06)</h4>\n<ul>\n<li>FEAT: Better documentation on headless mode. Check our website.</li>\n<li>FIX: Regression: declarative shadow dom not working on browsers other than chrome.</li>\n<li>FIX: Some styling issues on safari browser.</li>\n</ul>\n<h4>v1.3.0 (2021-08-05)</h4>\n<p><strong>NOTICE</strong>: After updating to version 1.3.0, please edit your forms and do a force save. This will regenerate the skeletons and will make sure there is no <strong>FOUT</strong> (Flash of Unstyled Text) when loading the form. I am very sorry for the inconvenience. Also if you are using a default theme other than vividBlue, please go to WPEForm &gt; Settings and Update the settings.</p>\n<ul>\n<li>FEAT: Headless Form Mode: Render your forms you made in WordPress to React Applications. Totally opt-in and available in all versions (including free).</li>\n<li>FEAT: Better hydration of form, user portal and summary skeleton. This removes FOUT in page loads.</li>\n<li>FEAT: Use a better implementation of shadow dom (leveraging React 17 event system) to increase performance and decrease asset size.</li>\n<li>FEAT: Lazy load sentry sdk for less impact on the app.</li>\n<li>FEAT: New option to disable admin side asset sandboxing. Enable this if something in WordPress admin breaks.</li>\n<li>FEAT: New option to prefer the Standalone admin pages by default.</li>\n<li>FEAT: Add style related data in <em>forms</em> graphql query for rendering in third-party applications.</li>\n<li>FEAT: Better default style for buttons.</li>\n<li>FEAT: Use better technique for intersection observer for better performance.</li>\n<li>FEAT: Use JavaScript version of FontAwesome for better legibility and lesser asset size.</li>\n<li>FIX: Page button appearance in regular view.</li>\n<li>FIX: Consider custom plugin directory name when sandboxing (opt-in now) assets.</li>\n</ul>\n<h4>v1.2.0 (2021-07-31)</h4>\n<ul>\n<li>FEAT: Make plugin fully translation ready.</li>\n<li>FEAT: Improve form builder performance.</li>\n<li>FEAT: Improve form validation appearance.</li>\n<li>FEAT: Consistency in form loading skeleton.</li>\n<li>FIX: Proper React hydration of forms with or without shadow dom.</li>\n<li>FIX: Update JS and PHP dependencies.</li>\n<li>FIX: Form builder nested element having weird height on bottom.</li>\n<li>FIX: Some element appearance issue in WP Admin.</li>\n</ul>\n<h4>v1.1.1 (2021-07-27)</h4>\n<ul>\n<li>FIX: font icon picker appearance issue in form builder.</li>\n<li>FIX: WordPress plugin repository picking wrong block names.</li>\n<li>FIX: Make naming in blocks more consistent.</li>\n</ul>\n<h4>v1.1.0 (2021-07-27)</h4>\n<ul>\n<li>FEAT: Make block registration more complaint.</li>\n<li>FIX: <code>editorScript</code> and <code>editorStyle</code> in block registration.</li>\n</ul>\n<h4>v1.0.4 (2021-07-26)</h4>\n<ul>\n<li>FIX: Fontawesome not showing up in Gutenberg Block Editor in some cases.</li>\n</ul>\n<h4>v1.0.3 (2021-07-25)</h4>\n<ul>\n<li>FIX: Text and textarea race condition with set element touched.</li>\n<li>FIX: Unnecessary shipping of font files in repository.</li>\n<li>FIX: Old generation of skeleton html in build process.</li>\n</ul>\n<h4>v1.0.2 (2021-07-23)</h4>\n<ul>\n<li>FIX: Make sure register_block_type exists before calling.</li>\n</ul>\n<h4>v1.0.1 (2021-07-22)</h4>\n<ul>\n<li>Initial release.</li>\n</ul>\n"
    },
    "short_description": "Drag and Drop Live Form Builder with landing page, cost estimation, quizzes, personality tests, surveys, data collection and user feedback of all kind",
    "description": "<h4>WordPress Contact, Payment &amp; Quiz Form Builder Plugin</h4>\n<p>WPEForm is a Live, No-Code, Drag-N-Drop Form Builder for quizzes, payment estimations, personality tests, surveys, contacts, lead generations and user feedback of all kinds.</p>\n<p>Exclusively written for WordPress <strong>the goal is to help you get started in 10 minutes</strong>.</p>\n<p>With WPEForm, you create a form with our intuitive and a truly No-Code Form Builder.</p>\n<ol>\n<li>You drag and drop your favorite form elements with our best in class Form Builder.</li>\n<li>Publish it on your website with Gutenberg Blocks or Shortcodes or new Block Widgets or the Landing page.</li>\n<li>Collect data from your users.</li>\n</ol>\n<p><a href=\"https://www.wpeform.io/examples/?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" title=\"Examples - WPEForm - WordPress Form Builder\" rel=\"friend nofollow ugc\">Examples</a> | <a href=\"https://www.wpeform.io/docs/?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" title=\"Knowledge Base - WPEForm - WordPress Form Builder\" rel=\"friend nofollow ugc\">Documentation</a></p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/yyiNcolvO6Y?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>The best features of our form builder includes</p>\n<ul>\n<li>100% <strong>Mobile and Container responsive</strong>. No matter what device or what area of your theme, forms <em>will</em> look good. The grid of the form responds to the width of the container it is placed in.</li>\n<li>With latest shadow dom technology, your forms will look the same, no matter what the theme. If you want, you can turn this feature off.</li>\n<li>View <strong>your submissions from WordPress admin</strong>, right from the free plan. That&#8217;s right, we don&#8217;t block viewing submissions behind a paywall. Apart from email notifications, you always have the option to view it from the admin area.</li>\n<li>Keep your <a href=\"https://www.wpeform.io/docs/getting-started/form-builder/#adding-editors-to-form?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" rel=\"nofollow ugc\">forms private</a> in WordPress and share with only the WordPress users you trust.</li>\n<li>Very <strong>modern form builder</strong>, built with TypeScript/React and a GraphQL API.</li>\n<li>You can <strong>edit form submissions</strong> from admin. You can even let (with limitations) submitting users edit their submissions.</li>\n<li>Comes with <strong>many color schemes</strong>. If you don&#8217;t like them, you can always create your own with our handy color picker.</li>\n<li>All form elements&#8217; label, description, title etc are <strong>rich text based</strong>. Change colors, format text, insert images, videos, there is absolutely no limitations.</li>\n<li><strong>Multi paged forms</strong> are treated as first-class citizens. Large forms should be split into multiple pages and WPEForm makes it easier than ever.</li>\n<li><strong>Personality tests</strong> with multi tiered outcomes. You can create buzz feed like quizzes without hiring a developer.</li>\n<li><a href=\"https://prod.wpeform.io/wp-eform/form/starter-purchase-product-with-addons/24/\" rel=\"nofollow ugc\"><strong>Automatic landing pages</strong> like this</a> all from your WordPress site starting with WPEForm Lite.</li>\n<li><a href=\"https://www.wpeform.io/docs/advanced-topics/headless-mode/\" rel=\"nofollow ugc\"><strong>Headless mode</strong></a>, create your forms in WordPress, publish them on your CDN deployed static sites, like Gatsby, Nextjs etc (totally free).</li>\n</ul>\n<p><strong>Premium Version</strong></p>\n<blockquote>\n<p>This is the lite and free version of WPEForm. It gives you all features you need for contact forms and quizzes. For more advanced usage, do check our <a href=\"https://www.wpeform.io?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" title=\"WPEForm - WordPress Form Builder\" rel=\"friend nofollow ugc\">Premium versions</a>. You will like all the more form elements, integrations, newsletter and payment functionalities.</p>\n</blockquote>\n<p>We understand that <strong>a form is like a mini application</strong>. It needs to be interactive, responsive and fast. Our whole product is centered around these ideas.</p>\n<h3>Live Form Builder with Drag and Drop</h3>\n<p>Our form builder is the first of its kind for WordPress. It built on top of a <strong>GraphQL API</strong> with <strong>TypeScript/React</strong>. We want the form builder to be super fast and intuitive, giving you the best possible User Experience (UX). You spend more time building your forms, not fighting the Form Builder.</p>\n<ul>\n<li>Add any number of pages or tabs to the form.</li>\n<li>Add any number of elements to the page.</li>\n<li>Align form elements in columns of custom sizes on different breakpoints.</li>\n<li>Easily access form settings from sidebars.</li>\n</ul>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/HsCKUSvxcj4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>In the video above, we see a full tutorial to create <a href=\"https://prod.wpeform.io/wp-eform/form/starter-exhibition-event-feedback-form/12/\" rel=\"nofollow ugc\">this form</a> in under 8 minutes. Install now and see for yourself. Our whole powerful form builder is available from the <strong>FREE</strong> plan. We didn&#8217;t put any performance features behind paywall.</p>\n<h3>Pre Built Form Templates</h3>\n<p>We have included many form templates to help you get started right away. You do not always need to start from scratch. Most of the form templates are available right inside the New Form Wizard. More templates can be viewed and downloaded from our <a href=\"https://www.wpeform.io/examples/?utm_source=wporg&amp;utm_medium=link&amp;utm_campaign=lite\" title=\"Examples - WPEForm - WordPress Form Builder\" rel=\"friend nofollow ugc\">Examples page</a>.</p>\n<h3>Tier based Personality Quizzes</h3>\n<p>You can have any number of Score Tiers, like personality scores. All WPEForm elements can have scores assigned to them. Depending on the choice of the user you can add any score to any of the tiers.</p>\n<p>This gives you 100% flexibility on how scores are calculated. See <a href=\"https://prod.wpeform.io/wp-eform/form/free-personality-quiz/9/\" rel=\"nofollow ugc\">this form</a> for an example.</p>\n<p>All the above comes <strong>FREE</strong> with WPEForm. With <strong>STARTER</strong> plan you can put timers per page (or overall), record submission time and show graphs of different tiers of submissions. See <a href=\"https://prod.wpeform.io/wp-eform/system/summary/?mode=preview&amp;token=8d6d80fd3547dc2b3de94c4039f73051\" rel=\"nofollow ugc\">this example</a>.</p>\n<h3>Browse Form Entries</h3>\n<p>With WPEForm Lite (and of course premium) you always get to see list of submissions made by your users. Whenever someone submits the form, it gets saved in your WordPress database and shows up in WPEForm administrative area.</p>\n<p>Just go to WPEForm / Submissions and see all entries and leads. You can view or edit the entries or delete them.</p>\n<h3>Form Landing Pages optimized for distraction free Conversion</h3>\n<p>Right from our free plan, you get standalone, landing pages. Just click on the Preview button and copy the URL. See <a href=\"https://prod.wpeform.io/wp-eform/form/starter-purchase-product-with-addons/24/\" rel=\"nofollow ugc\">this form</a> as an example. With the upcoming professional version, you will be able to customize more of the landing page, without writing any code. Just like google forms or typeforms, but right inside your very own WordPress.</p>\n<h3>25+ Form Elements to choose from</h3>\n<p>WPEForm comes with all the form elements you could think of and more. We are in active development of form elements, so you will almost never run out of options. And if you do, we humbly ask that you let us know and we will do our best to bring it to the next version.</p>\n<p>The <strong>FREE</strong> version of WPEForm comes with basic sets of form elements, namely<br />\nRadio, Checkbox, Dropdown, Text, TextArea, a few design elements like Heading, Question Group, Article and the Captcha security element. These should be enough for anyone just starting out with contact forms.</p>\n<p>As your requirements grow, you can upgrade WPEForm to one of the paid plans and gain access to more form elements. Right now, we&#8217;ve released the <strong>STARTER</strong> plan which has the following extra elements (on top of everything available from the <strong>FREE</strong> version): Toggle, Math output, Slider, Range, Rating, Matrix Choice, Matrix Input, DateTime, Slider Group, Range Group, Rating Group, Math Group, Sortable, Stacked Group and Address.</p>\n<p>Stay tuned as we release more form elements tailored to solve your problems.</p>\n<h3>Truly responsive form design</h3>\n<p>WPEForm forms are truly responsive. They respect the size of the container you put them in. This is very helpful when you place the forms in narrow widgets or footers or popups. They just look good and work.</p>\n<p>An example to attention to detail would be our <strong>Dropdown Element</strong>. It is available from <strong>FREE</strong> plan and very unique. When viewed from mobile it shows a pop-up type dropdown near the thumb of your user. When viewed from desktop, it shows a regular dropdown.</p>\n<p>You also get many form themes which would work with any WordPress theme out there (more on this later). If you do not like our color schemes, you can always make your own.</p>\n<p>Lastly in the <strong>STARTER</strong> plan, there&#8217;s a <strong>Dark Mode</strong> feature. When enabled, the form will response to the visitor&#8217;s preference and turn on dark mode for itself.</p>\n<h3>100% Conflict free with any themes or plugins</h3>\n<p>We are using latest Web Technologies with WPEForm. The goal is to give a form that looks the same no matter which WordPress theme you are using. For this we&#8217;ve leveraged the <a href=\"https://developer.mozilla.org/en-US/docs/Web/Web_Components/Using_shadow_DOM\" rel=\"nofollow ugc\">Shadow DOM</a> API. It just ensures that CSS coming from your theme or any other plugin doesn&#8217;t interfere with WPEForm and vice-versa.</p>\n<p>As long as your website doesn&#8217;t produce any JavaScript error on the page our forms are guaranteed to work.</p>\n<p>By the way, if you want your theme to override WPEForm styles, you can turn this feature off from Site Settings of WPEForm.</p>\n<h3>Best in class administration</h3>\n<p>WPEForm comes with exhaustive administration features. We&#8217;ve included everything you need to administrate the submissions. If you think something is missing, then do let us know and we will do our best to add it.</p>\n<ul>\n<li>View and Edit submissions from WordPress admin.</li>\n<li>Get notified and notify your users when someone submits a form.</li>\n<li>Categorize forms for easy access and filter.</li>\n</ul>\n<p>and much more. Install now to see them in action.</p>\n<h3>Share forms with multiple users</h3>\n<p>By default a form is scoped to the WordPress user who created it. In the default configuration</p>\n<ol>\n<li>Administrators and Editors can create forms.</li>\n<li>Editors can view only the forms they have created and their submissions.</li>\n<li>Administrators and editors can share the form with other admins and editors.</li>\n<li>Shared forms give privilege to view/edit form and submissions.</li>\n</ol>\n<p>This works great for a network of form authors. In future we will add capabilities editor so that you can choose who exactly can create forms regardless of their WordPress role.</p>\n<h3>Powerful Conditional Logic System</h3>\n<p>Any form builder is useless without logical steps. WPEForm treats conditional logic as first-class citizen. With our system you can</p>\n<ol>\n<li>Show or hide individual form elements or groups or pages;</li>\n<li>Set value of other elements;</li>\n</ol>\n<p>Depending on the value (or values) of the source element.</p>\n<p>The logical system is split into two things:</p>\n<ol>\n<li>Events &#8211; You choose combination (with <em>AND</em> or <em>OR</em> operators) of events.</li>\n<li>Consequences &#8211; If the event was successful, you fire up consequences.</li>\n</ol>\n<h3>Headless Form Mode</h3>\n<p>This is the very first in WordPress. Our Forms are basically react app with a GraphQL API. So we&#8217;ve made a way, you can run WPEForm in headless mode. Just add one config in your <code>wp-config.php</code> and we are good to go. Some use cases includes:</p>\n<ol>\n<li>Make your forms in your WordPress site and render on your static sites.</li>\n<li>Use your own form library and communicate with the GraphQL API to send submissions.</li>\n<li>Render forms on your React applications, GatsbyJS site or Next.js sites.</li>\n</ol>\n<p>The possibilities are endless and we are just getting started. Be sure to read our <a href=\"https://www.wpeform.io/docs/advanced-topics/headless-mode/\" rel=\"nofollow ugc\">documentation website</a> to learn how you can setup headless mode and start using forms in your react applications today.</p>\n<p>This feature is totally opt-in and is disable by default. You do not have to worry about security concerns because by default the GraphQL API is hardened with a nonce verification. If you do enable headless mode, it will run with anonymous user when sending submissions. We&#8217;ve made sure the API is super secure, with 100s of automated tests. But of course we are also human. Should something bad happens, we will be prompt to patch it.</p>\n<h3>FREE PLAN FEATURES</h3>\n<h4>Starter form elements pack</h4>\n<p>Starter form elements pack includes Checkbox, Button, Group, Row, Column, Dropdown, Heading, Radio, Captcha, Text, TextArea, Slider.</p>\n<h4>Starter form themes pack</h4>\n<p>Starter form themes comes with great colors from Material UI. We&#8217;ve also included the two themes, Vivid Blue and Teal from our premium theme pack. No themes support dark mode in the <strong>FREE</strong> version.</p>\n<h4>Customizable Theme</h4>\n<p>You can set primary color, text color and background color and the system will create a beautiful form theme for you. This feature is included in the <strong>FREE</strong> version so that you can always match your form with your website.</p>\n<h4>Conditional logics and outcomes</h4>\n<p>The full features of conditional logic, events and consequences are available from the <strong>FREE</strong> plan. No feature is behind a paywall here.</p>\n<h4>Outcome and tier based quizzes</h4>\n<p>Add as many types of outcomes you want. There is no limit. However the graphs and designation part of the summary table is only available from the starter plan.</p>\n<h4>Submission summary and notifications</h4>\n<p>After submitting a form, your users would get a notification with a link to the summary page. Of course you can change the notification from the WPEForm Form settings. Here&#8217;s an example of <a href=\"https://prod.wpeform.io/wp-eform/system/user-email/?token=8d6d80fd3547dc2b3de94c4039f73051\" rel=\"nofollow ugc\">email sent to user</a>. Similar email is sent to administrator of the form with more links to administrate the submission.</p>\n<h4>User portal page</h4>\n<p>Central page to access ones own submissions. Please see the screenshot.</p>\n<h4>Form categories</h4>\n<p>Create and assign categories to forms. Available from Free version.</p>\n<h4>Shared form editors.</h4>\n<p>Share forms with your editors as explained above. The full functionality is available from free version.</p>\n<h3>STARTER PLAN FEATURES</h3>\n<p>Starter plan includes all the features from the <strong>FREE</strong> plan and more.</p>\n<h4>PDF downloads</h4>\n<p>PDF download submissions for both administrator and users. Email attachment is coming soon.</p>\n<h4>Extended form elements</h4>\n<p>Extended form elements includes &#8211; Toggle, Math output, Range, Rating, Matrix Choice, Matrix Input, DateTime, Slider Group, Range Group, Rating Group, Math Group, Sortable, Stacked Group.</p>\n<h4>Numeric calculations</h4>\n<p>Assign numeric value to almost any form element and use the Math Output element with valid numeric formula to show estimate.</p>\n<h4>Extended form themes pack</h4>\n<p>Many premium form themes based on the color schemes of Refactoring UI book. More themes on the way.</p>\n<h4>Dark form themes pack</h4>\n<p>Make your forms stand out by automatically responding to user&#8217;s color preference. When turned on, the forms will turn Dark if user prefers a dark color scheme. This is best used with WordPress themes that support dark mode. You can also keep the dark mode always on, if that&#8217;s your preference.</p>\n<h4>Form timer and stopwatch</h4>\n<p>Have page wise or overall form timer for restricted quizzes. Also record the form submission time with a stopwatch.</p>\n<h4>Graphs for quiz outcomes.</h4>\n<p>When you have multiple outcomes or tiers in your quiz setup, a radar graph will show up in the summary page. It will also include data-table for different outcomes along with designations you&#8217;ve set.</p>\n<h3>PROFESSIONAL AND BUSINESS FEATURE</h3>\n<p>We are currently working on the professional and business plans of WPEForm. Please see our Roadmap for more information.</p>\n<h3>Roadmap</h3>\n<p>We are just getting warmed up with the initial release of WPEForm. We have tons of features in our todo list. Here are some of the important upcoming features.</p>\n<ul>\n<li><strong>FREE</strong> &#8211; Make translation easier. We need to modify the tooling on the source.</li>\n<li><strong>STARTER</strong> &#8211; PDF attachment of submission in admin and user email.</li>\n<li><strong>STARTER</strong> &#8211; Modify the output of summary page.</li>\n<li><strong>STARTER</strong> &#8211; Custom dataset for MCQ elements.</li>\n<li><strong>PRO</strong> &#8211; All pro features, especially payments and integrations.</li>\n<li><strong>BUSINESS</strong> &#8211; All business features, especially WordPress core integration, like guest blogging, login forms, registration forms, profile update forms etc.</li>\n</ul>\n<p>and more. Follow me on <a href=\"https://twitter.com/swashata/\" rel=\"nofollow ugc\">Twitter</a> for updates and React/TypeScript tips.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wpeform-lite.1.6.5.zip",
    "upgrade_notice": {
        "": "<p>After updating to version 1.3.0, please edit your forms and do a force save. This will regenerate the skeletons and will make sure there is no <strong>FOUT</strong> (Flash of Unstyled Text) when loading the form. I am very sorry for the inconvenience. Also if you are using a default theme other than vividBlue, please go to WPEForm &gt; Settings and Update the settings.</p>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/wpeform-lite/assets/screenshot-1.png?rev=2570462",
            "caption": "The form builder in action."
        },
        {
            "src": "https://ps.w.org/wpeform-lite/assets/screenshot-2.png?rev=2570462",
            "caption": "The form in a standalone page."
        },
        {
            "src": "https://ps.w.org/wpeform-lite/assets/screenshot-3.png?rev=2570462",
            "caption": "The form embedded in a WordPress Post/Page with Gutenberg Block or Shortcode."
        },
        {
            "src": "https://ps.w.org/wpeform-lite/assets/screenshot-4.png?rev=2570462",
            "caption": "User portal page from where your users can access their submissions."
        },
        {
            "src": "https://ps.w.org/wpeform-lite/assets/screenshot-5.png?rev=2570462",
            "caption": "Summary page from which your users can view submission summary."
        },
        {
            "src": "https://ps.w.org/wpeform-lite/assets/screenshot-6.png?rev=2570462",
            "caption": "Admin notification email after form submission."
        },
        {
            "src": "https://ps.w.org/wpeform-lite/assets/screenshot-7.png?rev=2570462",
            "caption": "User notification email after form submission."
        },
        {
            "src": "https://ps.w.org/wpeform-lite/assets/screenshot-8.png?rev=2570462",
            "caption": "A cost estimator form demo."
        },
        {
            "src": "https://ps.w.org/wpeform-lite/assets/screenshot-9.png?rev=2570462",
            "caption": "Admin dashboard."
        },
        {
            "src": "https://ps.w.org/wpeform-lite/assets/screenshot-10.png?rev=2570462",
            "caption": "All submissions from WPEForm admin."
        },
        {
            "src": "https://ps.w.org/wpeform-lite/assets/screenshot-11.png?rev=2570462",
            "caption": "All forms from WPEForm admin."
        },
        {
            "src": "https://ps.w.org/wpeform-lite/assets/screenshot-12.png?rev=2570462",
            "caption": "Site settings from WPEForm admin."
        }
    ],
    "tags": {
        "drag-and-drop-form": "drag and drop form",
        "live-form-builder": "live form builder",
        "payment-form": "payment form",
        "personality-quiz": "personality quiz",
        "survey": "survey"
    },
    "stable_tag": "1.6.5",
    "versions": {
        "1.0.1": "https://downloads.wordpress.org/plugin/wpeform-lite.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/wpeform-lite.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/wpeform-lite.1.0.3.zip",
        "1.0.4": "https://downloads.wordpress.org/plugin/wpeform-lite.1.0.4.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/wpeform-lite.1.1.0.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/wpeform-lite.1.1.1.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/wpeform-lite.1.2.0.zip",
        "1.3.0": "https://downloads.wordpress.org/plugin/wpeform-lite.1.3.0.zip",
        "1.4.0": "https://downloads.wordpress.org/plugin/wpeform-lite.1.4.0.zip",
        "1.5.0": "https://downloads.wordpress.org/plugin/wpeform-lite.1.5.0.zip",
        "1.5.1": "https://downloads.wordpress.org/plugin/wpeform-lite.1.5.1.zip",
        "1.5.2": "https://downloads.wordpress.org/plugin/wpeform-lite.1.5.2.zip",
        "1.5.3": "https://downloads.wordpress.org/plugin/wpeform-lite.1.5.3.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/wpeform-lite.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/wpeform-lite.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/wpeform-lite.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/wpeform-lite.1.6.3.zip",
        "1.6.4": "https://downloads.wordpress.org/plugin/wpeform-lite.1.6.4.zip",
        "1.6.5": "https://downloads.wordpress.org/plugin/wpeform-lite.1.6.5.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wpeform-lite.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/wpeform-lite/assets/banner-772x250.png?rev=2575653",
        "high": "https://ps.w.org/wpeform-lite/assets/banner-1544x500.png?rev=2575653"
    },
    "icons": {
        "1x": "https://ps.w.org/wpeform-lite/assets/icon.svg?rev=2570462",
        "svg": "https://ps.w.org/wpeform-lite/assets/icon.svg?rev=2570462"
    },
    "blocks": {
        "wp-eform/form": {
            "name": "wp-eform/form",
            "title": "WPEForm Lite - Drag and Drop Live Form Builder for Contact, Payment &amp; Quiz Forms"
        },
        "wp-eform/user-portal": {
            "name": "wp-eform/user-portal",
            "title": "WPEForm Lite - Drag and Drop Live Form Builder for Contact, Payment &amp; Quiz Forms"
        },
        "wp-eform/summary": {
            "name": "wp-eform/summary",
            "title": "WPEForm Lite - Drag and Drop Live Form Builder for Contact, Payment &amp; Quiz Forms"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 100,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}