{
    "name": "Easiest Funnel Builder For WordPress &amp; WooCommerce by WPFunnels",
    "slug": "wpfunnels",
    "version": "3.4.12",
    "author": "<a href=\"https://getwpfunnels.com\">WPFunnels Team</a>",
    "author_profile": "https://profiles.wordpress.org/getwpfunnels/",
    "contributors": {
        "coderexltd": {
            "profile": "https://profiles.wordpress.org/coderexltd/",
            "avatar": "https://secure.gravatar.com/avatar/e6cbc180ce54221e6a168032a5f23cad?s=96&d=monsterid&r=g",
            "display_name": "CODE REX"
        },
        "getwpfunnels": {
            "profile": "https://profiles.wordpress.org/getwpfunnels/",
            "avatar": "https://secure.gravatar.com/avatar/41e7175c5b84ca1ca90185ff39205cd1?s=96&d=monsterid&r=g",
            "display_name": "WPFunnels"
        },
        "coderexco": {
            "profile": "https://profiles.wordpress.org/coderexco/",
            "avatar": "https://secure.gravatar.com/avatar/7b27b7c1f04dd2320895867a89ed8de5?s=96&d=monsterid&r=g",
            "display_name": "Lincoln Islam"
        }
    },
    "requires": "6.1",
    "tested": "6.6.1",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 102,
        "4": 3,
        "3": 0,
        "2": 0,
        "1": 1
    },
    "num_ratings": 106,
    "support_url": "https://wordpress.org/support/plugin/wpfunnels/",
    "support_threads": 13,
    "support_threads_resolved": 10,
    "active_installs": 7000,
    "downloaded": 317895,
    "last_updated": "2024-08-21 08:17:00",
    "added": "2021-02-26",
    "homepage": "https://getwpfunnels.com",
    "sections": {
        "description": "<p>👥 Lead Generator 💰 Sales Funnel Builder 🛍️ eCommerce Funnel Builder 🎓 Course Funnel Builder</p>\n<p>Create high-converting lead funnels and sales funnels within WordPress using the easiest visual funnel builder – WPFunnels.</p>\n<h3>The Easiest Funnel Builder To Generate Leads &amp; Sales In WordPress</h3>\n<p>Craft high-converting landing pages along with opt-in forms to generate leads.</p>\n<p>✅ Well-designed landing pages<br />\n✅ Built-in opt in form.<br />\n✅ Easily send leads to Mail Mint<br />\n✅ Active lead nurturing &amp; conversion<br />\n(with help from Mail Mint)</p>\n<p>Start growing and converting your leads on autopilot.</p>\n<h3>The Best Sales Funnel Builder To Increase Revenue</h3>\n<p>Use a visual canvas to plan a complete sales funnel journey and use exclusive features which include:</p>\n<p>✅ Pre-built templates &amp; custom landing pages<br />\n✅ Order bumps and optimized checkout pages<br />\n✅ One click upsell offers after checkout<br />\n✅ WooCommerce checkout customizer<br />\n✅ Conditional offers &amp; funnel steps<br />\n✅ Detailed funnel analytics<br />\nand many more.</p>\n<p>Craft a sales funnel journey that is built to boost your revenue with high AOV.</p>\n<p>Whether you want to create a WooCommerce sales funnel, sales funnels to offer services, or course funnels, WPFunnels will make it easy for you.</p>\n<p>💥 💥 💥</p>\n<p><a href=\"https://getwpfunnels.com/resources/\" rel=\"nofollow ugc\"> 👉 Documentation</a> | 👉 <a href=\"https://www.youtube.com/channel/UCIDB7eo-kCAVXRG4xKG-GCQ/playlists\" rel=\"nofollow ugc\">Video Tutorials</a> | 👉 <a href=\"https://www.facebook.com/groups/wpfunnels/\" rel=\"nofollow ugc\">Join our Facebook Community</a></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/GrzIRl5jfBE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Launch Your Funnel In Minutes Using Pre-build Templates!</h3>\n<p>WPFunnels comes with tons of pre built sales funnel templates for several niches, which you can import with just a click.</p>\n<p>This means you can start using sales funnels immediately without wasting any time.</p>\n<p>WPFunnels is currently the easiest funnel builder for WordPress &amp; WooCommerce.</p>\n<p>It comes with a user-friendly interface to help you create complete sales funnels easily, on your own, within minutes.</p>\n<p>The visual canvas lets you visually plan, design, and build your funnel flows easily – you have complete control over your funnel!</p>\n<h3>💥 Why Use WPFunnels 💥</h3>\n<p>WPFunnels is created for digital creators (such as online coaches, educators, course creators, etc.), entrepreneurs, and marketers like yourself to increase your leads and online sales revenue using sales funnels.</p>\n<p>Use this reliable WordPress funnel builder to automate your sales process and stay in control of every stage of the buyer’s journey.</p>\n<p>Currently, WPFunnels is the easiest funnel builder for WordPress &amp; WooCommerce, coming with a user-friendly interface to help you create complete sales funnels easily, on your own, within minutes.</p>\n<p>You will have access to tons of pre-built sales funnel templates for several niches, which you can import with just a click. This means you can start using sales funnels immediately without wasting any time.</p>\n<p>Plus, the visual canvas lets you visually plan, design, and build your funnel flows easily without getting confused or overwhelmed with complex UI. You have complete control over your funnel from a single place without leaving your WordPress dashboard.</p>\n<p>It&#8217;s really easy to get started:</p>\n<ol>\n<li>Plan Your Lead Funnel or Sales Funnel Journey On A Visual Canvas</li>\n<li>Design Your Funnel Steps Using Your Preferred Page Builder</li>\n<li>Set Up Email Automation To Nurture Leads And Convert Customers (with the help of Mail Mint)</li>\n<li>Launch Your Campaign And Reach Your Target Audience</li>\n<li>Start Getting Leads &amp; Sales On Autopilot.</li>\n</ol>\n<p>You will get everything you need, whether you wish to collect leads or want to run a sales campaign:</p>\n<ul>\n<li>Opt-in form to collect leads,</li>\n<li>Exclusive discounts for promotions,</li>\n<li>Replace the WooCommerce checkout page,</li>\n<li>Make order bump offers during checkout,</li>\n<li>Use post-purchase offers (one click upsell &amp; downsell),</li>\n</ul>\n<p>Guide your leads and prospects through an engaging funnel journey (email automation^, discount, order bump, upsell, or downsell) and trigger them to purchase more than what they had initially intended.</p>\n<p><em> ^Email automation can be used on the visual funnel canvas if you have Mail Mint.</em></p>\n<h3>🌟 A Complete Funnel Building Solution Within WordPress 🌟</h3>\n<p>No need to use multiple tools to create or track your funnels.</p>\n<p><strong>Use a single funnel builder to plan, design, and execute complete sales funnels, without leaving your WordPress dashboard.</strong></p>\n<ul>\n<li>A visual funnel canvas for funnel mapping &amp; planning</li>\n<li>All the basic funnel steps needed (Landing, Checkout, Thank You)</li>\n<li>Pre Made Funnel Templates for every step</li>\n<li>Gutenberg, Elementor, Divi, Bricks, or Oxygen Page Builder Support</li>\n<li>Make Order bump offers at the WooCommerce checkout</li>\n<li>Trigger One Click Upsell and Downsell offers offers after WooCommerce checkout (Pro)</li>\n<li>Conditional redirection to control the buyer’s journey</li>\n<li>Exclusive discounts for your funnel offers only</li>\n<li>Detailed analytics of every funnel step (Pro)</li>\n<li>Conditional eCommerce Funnels for your WooCommerce store (Pro)</li>\n<li>Opt-in Form for lead generation</li>\n<li>Direct integration with Mail Mint to collect &amp; manage leads</li>\n<li>Flawless Email Marketing Automation On The Funnel Canvas (requires Mail Mint) (Pro)</li>\n<li>Create Course Funnels along with WooCommerce (Tutor LMS, LearnDash)</li>\n<li>Integration with CRM Tools &#8211; Fluent CRM &amp; many more (Pro)</li>\n<li>Webhooks support for sending data to external tools (Pro)</li>\n<li>Create Funnels for LearnDash Courses Directly (without WooCommerce) (Pro)</li>\n<li>Support for Cash On Delivery, Check Payments, Direct Bank Transfer &#8211; BACS, and default WooCommerce Payments.</li>\n<li>Major Payment processing support for one click upsell – Stripe, PayPal, Mollie, Authorize.net, Square, Sumit, PayFast &amp; More!</li>\n<li>Any payment gateway support for post-purchase upsells. (Pro)</li>\n<li>A/B split testing (Pro)</li>\n</ul>\n<p>You get to control everything from planning your funnel to launching a live campaign in 1 place &#8211; no complexity.</p>\n<p>Can&#8217;t find what you are looking for or have a feature request? <a href=\"https://getwpfunnels.com/ideas/\" rel=\"nofollow ugc\">👤 Let us know!</a></p>\n<h3>🌟 A Funnel Builder For EVERY Business In EVERY Niche 🌟</h3>\n<p>This plugin is made for any online business whether you are a:</p>\n<p>✅ Marketing Coach ✅ Life Coach ✅ Business Coach ✅ Fitness Trainer ✅ Yoga Instructor<br />\n✅ Business Consultant ✅ Course Creators ✅ eCommerce Shop ✅ Software Firm ✅Counselor<br />\n✅ Marketing Strategist ✅ Affiliate Marketer ✅ Educational Portal ✅ Marketing Agency<br />\n✅ Financial Coach ✅ Marketing Consultant ✅ Yoga Instructor ✅ Advertising Agency</p>\n<p>And many more&#8230;</p>\n<p>Create highly converting sales funnels no matter what business you are in using WPFunnels.</p>\n<h3>🌟 Maximize Your Leads And Online Sales No Matter What Product You Offer 🌟</h3>\n<p>WPFunnels is a unique funnel builder that is suitable for generating leads and increasing sales for any products you offer.</p>\n<ul>\n<li>Sell Online Courses</li>\n<li>Sign More Online Subscriptions</li>\n<li>Promote Webinar Registrations</li>\n<li>Conduct Lead Generation</li>\n<li>Sell WooCommerce Products</li>\n<li>Increase eBooks Sales</li>\n<li>Sell Supplement Products</li>\n<li>Market Event Tickets</li>\n<li>Offer Exclusive Services</li>\n</ul>\n<p>The plugin is simply the right choice to help you reach your business and marketing goals.</p>\n<h3>🌟 Create Fully Functional Funnels In Just 15 Minutes 🌟</h3>\n<p>WPFunnels comes with tons of pre-built funnel templates that are specialized in different niches.</p>\n<p>All you need to do is choose a template, improve the content, and launch your sales funnel campaign.</p>\n<p>In fact, you can complete the whole process in as low as 15 minutes</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/jltW4529ui0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>It is a funnel builder that is made for both tech-savvy and non-tech marketers who want to boost their revenue.</p>\n<p>Besides, you may always get help from our reliable support team whenever required.</p>\n<h4>Spend An Additional 15 minutes and you will have email automation set up for your funnels as well</h4>\n<p>If you have Mail Mint Pro along with WPFunnels, then while staying on the canvas, you can define automation workflows based on visitor actions in every funnel step.</p>\n<p>You may add them to lists &amp; tags, run nurture email campaigns, and even send out promotional emails to sell more products or drive conversions.</p>\n<p>WPFunnels and Mail Mint are a brilliant combination to help you create a fully automated sales funnel.</p>\n<h3>🌟 A Simplified Funnel Builder To Save Your Time And Effort 🌟</h3>\n<p>One of the main purposes of creating WPFunnels was to make your life easier when creating sales funnels.</p>\n<p>The plugin is designed in a way so that you can build sales funnels without any complications.</p>\n<p>It’s a reliable funnel builder that is specialized to</p>\n<ul>\n<li>Reduce the time required to build funnels</li>\n<li>Exclude all unnecessary steps and simplify the process</li>\n<li>Enhance funnel planning with a visual representation</li>\n<li>Ensure the whole process is possible within WordPress</li>\n<li>Make your efforts meaningful and productive</li>\n<li>Launch your funnel campaigns ASAP.</li>\n</ul>\n<p>Your time and effort will not be wasted; Your leads and sales will grow without any hassle.</p>\n<p>In fact, WPFunnels is a great alternative to WordPress solutions such as Carflows or FunnelKit, and a cost-effective <a href=\"https://getwpfunnels.com/clickfunnels-alternative/?utm_source=repo&amp;utm_medium=repo&amp;utm_campaign=clickfunnels_alternative&amp;utm_id=clickfunnels_alternative\" rel=\"nofollow ugc\">alternative to ClickFunnels</a> in WordPress. You will love how simplified the plugin is, especially if you are a digital creator or online educator.</p>\n<h3>🌟 Level Up Your eCommerce Sales Using WooCommerce Sales Funnel 🌟</h3>\n<p>Last few months, we worked on the pain points you might have when building a WordPress sales funnel or WooCommerce sales funnel. And so, we planned to come up with the best possible version.</p>\n<p>Since WPFunnels 3.0, you now have a revamped visual canvas for hassle-free funnel building, distraction-free conditional step configuration, and improved A/B testing for better optimization.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/OrDQg-XcOLY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Boost Your Sales Process With Exclusive Features Of WPFunnels</h3>\n<p>Check out the amazing features you get with WP Funnels to help you boost sales.</p>\n<p><strong>⭐ Visual Funnel Canvas To Build Funnels Easily ⭐</strong></p>\n<p>Plan your funnels without any hassle. Use a visual funnel builder to plan and organize your funnel steps.</p>\n<p>You have full control over funnel navigation and planning &#8211; add the steps you want to use, add the necessary steps, use conditional flows, and configure the whole funnel right from the canvas.</p>\n<blockquote>\n<p><a href=\"https://getwpfunnels.com/funnel-mapping/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-canvas&amp;utm_id=wpf2024\" rel=\"nofollow ugc\">Map your funnels with the visual funnel canvas</a> and jumpstart your funnel process in minutes.</p>\n</blockquote>\n<p><strong>⭐ Pre-made Sales Funnel Templates To Start Selling Immediately ⭐</strong></p>\n<p>Design your funnel from scratch or choose from dozens of niche-specific funnel templates that are optimized for high conversion. Get a complete funnel with just a click and start selling immediately.</p>\n<blockquote>\n<p>It’s a simplified funnel builder, specialized to make your funnel building process easier than ever with <a href=\"https://getwpfunnels.com/pre-made-sales-funnel-templates/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-sales-funnel-templates&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">pre-made funnel templates</a>.</p>\n</blockquote>\n<p><strong>⭐ Gutenberg, Elementor, Divi, Bricks &amp; Oxygen Page Builder Integration ⭐</strong></p>\n<p>The plugin comes with exclusive Gutenberg blocks, Elementor widgets, Divi modules &amp; Oxygen elements for every funnel step to help you customize your funnel pages with full control.</p>\n<blockquote>\n<p>Design every step of the funnel <a href=\"https://getwpfunnels.com/design-funnel-pages-with-the-best-page-builders/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-page-builders&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">using your favorite page builders</a>.</p>\n</blockquote>\n<p><strong>⭐ Shortcodes For WPFunnels Blocks ⭐</strong></p>\n<p>Design your funnel pages with many page builders using Shortcodes.</p>\n<blockquote>\n<p><a href=\"https://getwpfunnels.com/docs/wpfunnels-shortcodes/how-use-shortcodes-to-make-your-funnel-functional/\" rel=\"nofollow ugc\">Use dedicated Shortcodes</a> for your sales funnel components for a hand full of page builders.</p>\n</blockquote>\n<p><strong>⭐ Custom Checkout Page For Every Funnel ⭐</strong></p>\n<p>Make your checkout process distraction-free with <a href=\"https://getwpfunnels.com/optimized-custom-checkout-page-for-sales-funnel/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-custom-checkout-page&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">custom checkout pages</a> and increase conversion.</p>\n<p>Create a seamless checkout experience for your customers and optimize checkout via checkout optimizer with different checkout layouts, steps, and checkout fields.</p>\n<p>You can easily replace the basic WooCommerce Checkout Page with different checkout templates without any hassle.</p>\n<p><strong>⭐ Order Bump Offers At The WooCommerce Checkout ⭐</strong></p>\n<p>Add an attractive <a href=\"https://getwpfunnels.com/guide-to-woocommerce-funnels-using-global-funnels/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=blog-global-funnels&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">order bump offer</a> during the checkout and increase your sales revenue.</p>\n<blockquote>\n<p>Create your own <a href=\"https://getwpfunnels.com/woocommerce-order-bump/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-orderbump&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">order bump</a> offers and <a href=\"https://getwpfunnels.com/docs/sales-funnel-offers-to-boost-sales/order-bump-offer-at-the-checkout/\" rel=\"nofollow ugc\">design them easily</a>. Place them anywhere on the checkout page as you like.</p>\n</blockquote>\n<p><strong>⭐ Fully Functional With WooCommerce ⭐</strong></p>\n<p>Easily integrate with WooCommerce to implement sales funnels to your WooCommerce products and increase sales.</p>\n<p>Not only that, you can easily replace your current WooCommerce checkout module with different checkout templates, replaceable fields and many more!</p>\n<p>You can create funnels for WooCommerce Subscription products, WooCommerce Chained Products, Tutor LMS course products, etc.</p>\n<blockquote>\n<p><a href=\"https://getwpfunnels.com/global-dynamic-woocommerce-funnels/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-global-funnels&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">Use Global Funnel for WooCommerce (Pro)</a>: Set Conditional Offers for your WooCommerce store based on conditions such as category, product quantity, cart total, product popularity, and many more. Then make dynamic offers to your buyers for higher conversion.</p>\n</blockquote>\n<p><strong>⭐ WPFunnels Opt-in Form Integration With Mail Mint Lead Generation &amp; Management (Free) ⭐</strong></p>\n<p>Use WPFunnels to create lead generation funnels and configure it to directly send the leads to Mail Mint&#8217;s lists &amp; tags. <a href=\"https://getwpfunnels.com/docs/lead-generation-funnel/wpfunnels-opt-in-form-to-mail-mint/?utm_source=wp-repo&amp;utm_medium=descr&amp;utm_campaign=21may24-lead\" rel=\"nofollow ugc\">Learn More</a></p>\n<p>And then set up quick email automation workflows to nurture and convert your leads.</p>\n<p><strong>⭐ Post-purchase Upsells with Any Payment Gateways In Your Funnels (Pro) ⭐</strong></p>\n<p>No more restrictions in offering post-purchase upsells. Unlike most other tools, with WPFunnels, you will be able to make post-purchase upsell offers no matter what payment gateway you use such as Razorpay, MBWay, EUPago, Marcado Pago, etc.</p>\n<p>Take a look:</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/FajRJY9UVXM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><strong>⭐ One click Upsell And Downsell Offers (Pro) ⭐</strong></p>\n<p>For selected payment gateways such as Paypal, Stripe (and many more, you can trigger one-time offers or any exclusive offers as <a href=\"https://getwpfunnels.com/one-click-upsell-downsell-offer/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-upsell-downsell&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">upsell or downsell after checkout</a>, to attract your buyers to purchase even more and leverage the buyer&#8217;s intent to your advantage. These offers can be accepted with just one click, making it highly effective to increase AOV.</p>\n<p><strong>⭐ Mail Mint Integration for Flawless Email Marketing Automation (Pro)⭐</strong></p>\n<p>Use Mail Mint to create simple email campaigns &amp; segmented email series with strategic time delays.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/y2X4bDZzmsU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>On WPFunnels visual canvas, connect those email campaigns with any steps of your sales funnel or lead funnel journey.</p>\n<p>Based on the actions of your users, these email campaigns will activate automatically.</p>\n<p>👉 <a href=\"https://getwpfunnels.com/visual-funnel-building/?utm_source=wpf-repo-description&amp;utm_medium=wpf-repo-cta&amp;utm_campaign=complete-funnel-feature-page&amp;utm_id=wpf-repo-2023\" rel=\"nofollow ugc\">Your Complete Visual Funnel Solution</a></p>\n<p>So, create your sales funnel journey &amp; automate email marketing in a single visual canvas.</p>\n<p>📂 <a href=\"https://getwpfunnels.com/single-visual-canvas-for-funnels-and-email/?utm_source=wordpress&amp;utm_medium=wpfdesc&amp;utm_campaign=mmandwpflaunch\" rel=\"nofollow ugc\">Learn More</a></p>\n<p><strong>⭐ Opt-in Form To Collect Leads ⭐</strong></p>\n<p>Use the simple <a href=\"https://getwpfunnels.com/lead-generation/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-lead-gen&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">built-in Opt-in form to collect leads</a>, which is not dependent on WooCommerce.</p>\n<p><strong>⭐ Webhooks Support To Send Data (Pro) ⭐</strong></p>\n<p><a href=\"https://getwpfunnels.com/docs/wpfunnels-webhooks-support/\" rel=\"nofollow ugc\">WPFunnels Webhooks</a> allows you to send data to major automation tools and most email clients based on user actions in your sales funnel.</p>\n<p><strong>⭐ Checkoutify &#8211; Checkout Customizer Addon For Easy Customization (Pro) ⭐</strong></p>\n<p>Checkoutify is the game-changing WooCommerce Checkout Customizer that puts you in control.</p>\n<p>Effortlessly design cleaner and more efficient checkouts with advanced customization options.</p>\n<p>✅ Boost sales by strategically placing your checkout form where it matters most.<br />\n✅ Tailor your checkout sections effortlessly with separate widgets and layouts.<br />\n✅ Embed your checkout forms anywhere using shortcodes for increased flexibility.<br />\n✅ Increase average order value with strategic order bump placement.</p>\n<p>[https://youtu.be/nqtO4qYkUJQ?si=m82XHtl9BrBKIguA]</p>\n<p><strong>⭐ Integration With Major Automation &amp; CRM Tools (Pro) ⭐</strong></p>\n<p><a href=\"https://getwpfunnels.com/integration-with-crm-and-automation-tools/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-crm-integration&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">Send data to major automation &amp; CRM tools</a> such as Mail Mint, MailPoet, ActiveCampaign, MailChimp, FluentCRM, Constant Contact, AWeber, Sendinblue, MailerLite, GetResponse, Encharge, HubSpot and other email clients based on user actions in your sales funnel.</p>\n<blockquote>\n<p>Integrate with the most popular automation tool Zapier and send data to your favorite tools.</p>\n</blockquote>\n<p><strong>⭐ Course Funnels Using LearnDash And WPFunnels (Pro) ⭐</strong></p>\n<p>For the first time in WordPress, you can create course funnels in WordPress without using WooCommerce! Plan a funnel journey and offer courses in your sales funnel as order bump, upsell and downsell, by using WPFunnels and LearnDash. (No WooCommerce needed.)</p>\n<p><strong>⭐ Custom Step For Advanced Funnel Building (Pro) ⭐</strong></p>\n<p>Create additional custom pages between the landing and the checkout to craft powerful Hybrid Funnels, Squeeze Funnels, Affiliate Marketing Bridge Funnels, etc.</p>\n<blockquote>\n<p>Use <a href=\"https://getwpfunnels.com/custom-step-for-advanced-funnel-building/?utm_source=wpf-repo-content&amp;utm_medium=custom-step-cta&amp;utm_campaign=custom-step-announcement&amp;utm_id=wpf-repo2023/\" rel=\"nofollow ugc\">Custom Step</a> to have more control over your sales funnels.</p>\n</blockquote>\n<p>**⭐ Experience A/B Split  &hellip;</p>\n",
        "installation": "<ol>\n<li>Upload the WP Funnels to the <code>/wp-content/plugins/</code> directory</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress</li>\n<li>Follow the setup wizard to configure the plugin for use</li>\n</ol>\n",
        "faq": "\n<dt id='1.%20what%20makes%20wp%20funnels%20unique%20from%20other%20funnel%20builders%3F'>\n1. What makes WP Funnels unique from other funnel builders?\n</h4>\n<p>\n<p>It is the only WordPress funnel builder where you can visually design your funnel flows on a canvas &#8211; you have complete control over your funnel!</p>\n<p>No need to use multiple tools to create or track your funnels.</p>\n<p>You get to control everything from planning your funnel to launching a live sales campaign in 1 place.</p>\n<ul>\n<li>A visual canvas for funnel mapping</li>\n<li>All the typical steps needed (Landing, Checkout, Thank You)</li>\n<li>Order bump offer at the checkout</li>\n<li>Upsell and Downsell offers after checkout (Pro)</li>\n<li>Full analytics of every funnel step (Pro)</li>\n<li>A/B testing of every step</li>\n<li>Major payment processing support</li>\n<li>Integration with major automation tools (Pro)</li>\n</ul>\n</p>\n<dt id='2.%20what%20is%20a%20sales%20funnel%3F'>\n2. What is a Sales Funnel?\n</h4>\n<p>\n<p>A sales funnel is a process that takes a visitor on a journey to turn him/her into a lead and then from lead to a sale, eventually making him/her buy more from your site.</p>\n<p>A simple sales funnel usually has 3 sections:</p>\n<ol>\n<li>Offer Landing Page</li>\n<li>Checkout Page</li>\n<li>Thank You Page</li>\n</ol>\n<p>But you can add more steps to turn it into a converting sales funnel and generate more profit.</p>\n<p>For example, a simple funnel with a lucrative checkout offer would include:</p>\n<ol>\n<li>Sales Landing Page</li>\n<li>Checkout Page with Order bump</li>\n<li>Thank You Page</li>\n</ol>\n</p>\n<dt id='3.%20why%20do%20i%20need%20a%20sales%20funnel%20builder%20plugin%3F'>\n3. Why do I need a sales funnel builder plugin?\n</h4>\n<p>\n<p>Sales funnels have proven to help online businesses increase conversion rates and revenue.</p>\n<p>But it is often difficult to create an engaging sales funnel that functions properly.</p>\n<p>And most SaaS funnel builders are either too complicated or expensive.</p>\n<p>The purpose of WPFunnels is to help you create complete sales funnels within WordPress without any complications.</p>\n<p>You can create a fully functioning sales funnel in as little as 15 mins using this plugin and you won&#8217;t have to worry about spending tons of money every month.</p>\n<p>With this reliable sales funnel builder, you will be able to make sure your leads are converted into highly profitable buyers.</p>\n</p>\n<dt id='4.%20who%20can%20use%20wpfunnels%3F'>\n4. Who can use WPFunnels?\n</h4>\n<p>\n<p>For any product or service you offer, you can use sales funnels to increase your conversion.</p>\n<p>And in WordPress, WPFunnels is among the few plugins that can give an easy solution to help you create sales funnels that work.</p>\n<p>That being said, the most common businesses using sales funnels are:</p>\n<ul>\n<li>Digital Marketer</li>\n<li>Marketing Strategist</li>\n<li>Marketing Coach</li>\n<li>Fitness Trainers</li>\n<li>Gym Equipment Shop</li>\n<li>Health Supplement Seller</li>\n<li>Legal Advisor</li>\n<li>Online Coach</li>\n<li>Educational Portal</li>\n<li>Counselor</li>\n<li>Software Firm</li>\n<li>Marketing Agency</li>\n<li>eCommerce Shop</li>\n</ul>\n<p>However, it is not limited to these niches. Any business can benefit from using sales funnels.</p>\n</p>\n<dt id='5.%20what%20type%20of%20funnels%20can%20i%20create%20using%20wp%20funnels%3F'>\n5. What type of funnels can I create using WP Funnels?\n</h4>\n<p>\n<p>With WP Funnels, we have plans to turn it into a plugin that lets you add all the necessary steps to create any type of funnel for any purpose.</p>\n<p>For now, you will be able to create the basics &#8211; landing page, checkout page, and thank you page &#8211; and you will be able to add order bumps to your checkout pages. Plus, you will get a few pre-built templates to save you some time.</p>\n<p>Over time, we will include more and more features. Right now, you can create:</p>\n<ul>\n<li>Opt-in Lead Generation Funnel</li>\n<li>Subscription funnels</li>\n<li>Sales Funnels For Specific Products</li>\n<li>Dynamic Funnels for WooCommerce store</li>\n<li>Course Funnel</li>\n<li>Free Webinar Funnel</li>\n<li>Paid Webinar Funnel</li>\n<li>Product Launch Funnel</li>\n<li>Tripwire Funnel</li>\n<li>Squeeze Page Funnel</li>\n<li>Simple Video Sales Funnel</li>\n<li>Hero Funnel To Get Social Followers</li>\n<li>Affiliate Sales Funnel</li>\n<li>Free Consultation Funnel</li>\n<li>Cross-sell Funnel</li>\n<li>Product sales and conversion funnels</li>\n<li>Checkout sales funnels</li>\n<li>Replaceable WooCommerce Checkout</li>\n<li>Membership Sales Funnel (coming soon)</li>\n<li>Lead Magnet Funnels</li>\n<li>Survey Funnel (coming soon)</li>\n<li>Mixture of multiple sales funnels &#8211; Hybrid funnels</li>\n</ul>\n</p>\n<dt id='6.%20how%20long%20does%20it%20take%20to%20create%20a%20sales%20funnel%20using%20wp%20funnels%3F'>\n6. How long does it take to create a sales funnel using WP Funnels?\n</h4>\n<p>\n<p>WP Funnels is designed to make it easy for you to create a sales funnel.</p>\n<p>The plugin comes with niche-specific templates which you can tweak and create actionable funnels in as low as 15 minutes.</p>\n<p>Creating funnel steps only takes a few minutes. And you can use your favorite Page builder (such as Elementor) to design the pages of each step.</p>\n<p>Plus, you will get actionable guides to help you all the way.</p>\n</p>\n<dt id='7.%20do%20i%20need%20any%20coding%20and%20designing%20skills%3F'>\n7. Do I need any coding and designing skills?\n</h4>\n<p>\n<p>No. WP funnels come with different types of templates that meet the design and structure requirements to sell different types of products and courses.</p>\n<p>So you can simply choose a template and update the content without worrying about the design and codes.</p>\n</p>\n<dt id='8.%20what%20are%20the%20basic%20requirements%20for%20wp%20funnels%20to%20work%3F'>\n8. What are the basic requirements for WP Funnels to work?\n</h4>\n<p>\n<p>You will simply need WooCommerce and WP Funnels installed.</p>\n<p>Then, depending on your requirements, you can choose your own page builder to design the pages. We recommend using Elementor.</p>\n<p>These are enough to start creating funnels.</p>\n</p>\n<dt id='9.%20what%20page%20builders%20do%20wp%20funnels%20support%3F'>\n9. What Page builders do WP Funnels support?\n</h4>\n<p>\n<p>Currently, WPFunnels works well with Gutenberg, Elementor, Bricks, Divi, and Oxygen builder. We’re looking to support more page builders soon.</p>\n<p>You will get to add important page elements such as the Next Step button, Checkout form, etc when designing your pages.</p>\n<p>If you use Gutenberg, Elementor, Oxygen, Bricks, or Divi, you will get their respective blocks, widgets, and modules for funnel creation.</p>\n<p>Meanwhile, you may use our <a>shortcodes</a> for other page builders.</p>\n</p>\n<dt id='10.%20i%20can%27t%20find%20a%20certain%20funnel%20feature%20that%20i%20need'>\n10. I can&#8217;t find a certain funnel feature that I need\n</h4>\n<p>\n<p>If you can&#8217;t find a certain feature that you think is available in the plugin, you can open a thread and mention the feature.</p>\n<p>And if there is a feature that is not available in the plugin but you think will be helpful for building funnels, you can <a href=\"https://getwpfunnels.com/ideas/\" rel=\"nofollow ugc\">let us know here.</a></p>\n</p>\n<dt id='10.%20how%20can%20i%20report%20security%20bugs%3F'>\n10. How can I report security bugs?\n</h4>\n<p>\n<p>You can report security bugs through the Patchstack Vulnerability Disclosure Program.</p>\n<p>The Patchstack team help validate, triage and handle any security vulnerabilities. <a href=\"https://patchstack.com/database/vdp/wpfunnels\" rel=\"nofollow ugc\">Report a security vulnerability.</a></p>\n</p>\n\n",
        "changelog": "<h4>3.4.12 (2024-08-21)</h4>\n<ul>\n<li>Enhancement : Setup wizard UI</li>\n<li>BugFix : Resolved payment section issue on checkout</li>\n</ul>\n<h4>3.4.11 (2024-08-20)</h4>\n<ul>\n<li>BugFix : Resolved multi-step checkout issue</li>\n</ul>\n<h4>3.4.10 (2024-08-19)</h4>\n<ul>\n<li>Enhancement : Setup wizard UI</li>\n<li>Enhancement : Update step icons and step connector</li>\n<li>Compatibility : Added compatibility with Google Site Kit plugin</li>\n<li>Compatibility : Added compatibility with Elementor form </li>\n<li>Compatibility : Allow to use pop-up order bump as pre-purchase upsell for pro users</li>\n</ul>\n<h4>3.4.9 (2024-08-08)</h4>\n<ul>\n<li>New : Integrated Elementor form with WPFunnels</li>\n<li>Enhancement : Reduced API calling on funnel canvas to improve performance</li>\n<li>Compatibility : Added compatibility with Drip Integration</li>\n<li>BugFix : Resolved console error on canvas</li>\n</ul>\n<h4>3.4.8 (2024-07-29)</h4>\n<ul>\n<li>Enhancement : Added filter hook on checkout discount</li>\n<li>Enhancement : Added a functionality to validate Google Map API Key before applying</li>\n<li>Compatibility : Made compatible with Astra Pro plugin</li>\n<li>Compatibility : Added compatibility with Astra child themes</li>\n<li>BugFix : Resolved checkout design issue</li>\n</ul>\n<h4>3.4.7 (2024-07-11)</h4>\n<ul>\n<li>Enhancement : Removed Qubely dependency for templates</li>\n</ul>\n<h4>3.4.6 (2024-07-05)</h4>\n<ul>\n<li>BugFix : Resolved settings js enqueuing issue</li>\n</ul>\n<h4>3.4.5 (2024-07-05)</h4>\n<ul>\n<li>New : Add optin settings on settings panel</li>\n<li>Enhancement : Improved general and permalink settings page design</li>\n</ul>\n<h4>3.4.4 (2024-07-01)</h4>\n<ul>\n<li>BugFix : Resolved course saving issue on checkout step drawer</li>\n</ul>\n<h4>3.4.3 (2024-06-28)</h4>\n<ul>\n<li>BugFix : Resolved conflict with WP Rocket</li>\n</ul>\n<h4>3.4.2 (2024-06-28)</h4>\n<ul>\n<li>Compatibility : Added compatibility with latest WPFunnels Pro Integrations Addon for Pabbly Connect and Email Marketing</li>\n<li>Compatibility : Added compatibility with latest Mail Mint Pro</li>\n</ul>\n<h4>3.4.1 (2024-06-26)</h4>\n<ul>\n<li>New : Added custom script support</li>\n<li>New : Added bricks child themes support for templates</li>\n<li>Compatibility : Allowed to add step in the middle of the step</li>\n<li>Enhancement : Update Pro modal with pricing</li>\n<li>BugFix : Resolved template sync issue on setup wizard</li>\n<li>BugFix : Resolved IP blocking issue for getting templates</li>\n<li>BugFix : Resolved product changing issue on checkout</li>\n<li>BugFix : Resolved step positioning issue on funnel canvas</li>\n</ul>\n<h4>3.4.0 (2024-06-13)</h4>\n<ul>\n<li>New : Added Bricks templates</li>\n<li>New : Introduced full-width setup wizard</li>\n<li>New : Integrated with Google Autocomplete</li>\n<li>New : Added compatibility with Product Addons for WooCommerce – Product Options with Custom Fields</li>\n<li>Enhancement : Updated the notice and tooltip messages</li>\n<li>BugFix : Resolved the contact status issue </li>\n<li>BugFix : Resolve PHP dedicated warnings</li>\n<li>BugFix : Resolved template layout issue for lead funnel</li>\n</ul>\n<h4>3.3.1 (2024-06-06)</h4>\n<ul>\n<li>BugFix : Resolved spelling issue on pro modal</li>\n</ul>\n<h4>3.3.0 (2024-05-29)</h4>\n<ul>\n<li>BugFix : Resolved orderbump discount issue</li>\n</ul>\n<h4>3.2.2 (2024-05-29)</h4>\n<ul>\n<li>New : Added template layout for scratch funnel</li>\n<li>New : Added bundle product support for checkout</li>\n<li>New : Added composite product support for checkout</li>\n<li>Enhancement : Auto sync template after changing the funnel type</li>\n<li>Enhancement : Added toaster notification for all the confirmation message</li>\n<li>Enhancement : Updated trash icon</li>\n<li>BugFix : Resolved template filter issue on funnel template showcase</li>\n<li>BugFix : Resolved orderbump replace settings issue</li>\n</ul>\n<h4>3.2.1 (2024-05-21)</h4>\n<ul>\n<li>Enhancement : Added a modal to show the pro features</li>\n</ul>\n<h4>3.2.0 (2024-05-21)</h4>\n<ul>\n<li>New : Opt-in form integration with Mail Mint</li>\n<li>Bug Fix : Resolved duplicate discount on funnel checkout </li>\n</ul>\n<h4>3.1.10 (2024-05-18)</h4>\n<ul>\n<li>Bug Fix : Resolved Php error</li>\n</ul>\n<h4>3.1.9 (2024-05-17)</h4>\n<ul>\n<li>Bug Fix : Resolved file missing issue</li>\n</ul>\n<h4>3.1.8 (2024-05-17)</h4>\n<ul>\n<li>New : Allowed to disable payment gateways for a specific funnel checkout</li>\n<li>New : Added create product option on step drawer </li>\n<li>New : Added trash module for funnel</li>\n<li>Enhancement : Improved Order bump UI</li>\n<li>Enhancement : Disallowed to update step slug with duplicate value</li>\n<li>Enhancement : Re-arranged settings menu</li>\n<li>Enhancement : Optimized checkout performance</li>\n<li>Bug Fix : Resolved order bump style issue on frontend</li>\n<li>Bug Fix : Resolved step importing issue in funnel canvas</li>\n</ul>\n<h4>3.1.7 (2024-05-06)</h4>\n<ul>\n<li>Enhancement : Improved discount application on funnel checkout</li>\n<li>Compatibility : Compatible with updated A/B testing</li>\n<li>Bug Fix : Resolved order bump issue with price in Checkout page</li>\n</ul>\n<h4>3.1.6 (2024-05-03)</h4>\n<ul>\n<li>Enhancement : Update checkout fields value after keyup</li>\n<li>Enhancement : Added confirmation message when stating or resuming the A/B testing.</li>\n<li>Bug Fix : Resolved style issue on template showcase page </li>\n</ul>\n<h4>3.1.5 (2024-04-30)</h4>\n<ul>\n<li>Bug Fix : Resolved style issue on funnel listing page </li>\n<li>Bug Fix : Resolved php warning on settings page</li>\n</ul>\n<h4>3.1.4 (2024-04-25)</h4>\n<ul>\n<li>New : Allowed to clear funnel data on plugin uninstall</li>\n<li>Enhancement : Enhanced the template showcase by creating new template menu </li>\n<li>Compatibility : Compatible with GBF Skip cart feature</li>\n<li>Compatibility : Compatible with latest WooCommerce </li>\n<li>Bug Fix : Resolved discount calculation issue on step&#8217;s drawer</li>\n</ul>\n<h4>3.1.3 (2024-04-18)</h4>\n<ul>\n<li>Compatibility : Extra theme for divi templates</li>\n<li>Compatibility : Checkoutify orderbump with wpfunnels step&#8217;s condition </li>\n<li>Bug Fix : Resolved static email address issue for sending test email from WPFunnels with Mail Mint automation</li>\n<li>Bug Fix : Resolved carry data issue from opt-in to checkout</li>\n</ul>\n<h4>3.1.2 (2024-04-16)</h4>\n<ul>\n<li>Enhancement : Added a filter hook for updating product price</li>\n</ul>\n<h4>3.1.1 (2024-04-05)</h4>\n<ul>\n<li>Compatibility : Compatible with WordPress 6.5</li>\n</ul>\n<h4>3.1.0 (2024-04-04)</h4>\n<ul>\n<li>New : Integrated Bricks with WPFunnels</li>\n<li>New : Made whole canvas translatable</li>\n<li>New : Added edit funnel option in frontend for administrator</li>\n<li>Enhancement : Enhanced the performance of calculating discount in step&#8217;s drawer </li>\n<li>Enhancement : Enhanced experience for unsupported page builders</li>\n<li>Compatibility : Compatible with time-bound discount</li>\n<li>Bug fix : Resolved &#8216;invalid payment gateway&#8217; issue in funnel checkout</li>\n<li>Bug fix : Resolved pricing issue in funnel checkout</li>\n<li>Bug fix : Resolved rendering issue for 2-step checkout with shortcode</li>\n</ul>\n<h4>3.0.14 (2024-03-29)</h4>\n<ul>\n<li>Enhancement : Update setup wizard video</li>\n</ul>\n<h4>3.0.13 (2024-03-20)</h4>\n<ul>\n<li>Compatibility : Compatible with bricks theme</li>\n<li>Bug Fix: Resolved redirecting issue after optin submission with shortcode</li>\n<li>Bug Fix: Resolved multiple optin form showing issue in a step</li>\n</ul>\n<h4>3.0.12 (2024-03-15)</h4>\n<ul>\n<li>Bug Fix: Resolved coupon issue in funnel checkout</li>\n</ul>\n<h4>3.0.11 (2024-03-14)</h4>\n<ul>\n<li>Compatibility: Compatible with quantity selector in funnel checkout</li>\n</ul>\n<h4>3.0.10 (2024-03-13)</h4>\n<ul>\n<li>Bux Fix: Removed multiple Add Step node from a funnel canvas</li>\n<li>Bux Fix: Resolved funnel duplication issue</li>\n<li>Bux Fix: Resolved add next step issue in conditional drawer</li>\n</ul>\n<h4>3.0.9 (2024-03-06)</h4>\n<ul>\n<li>Improvement : Restricted the import of the &#8216;Thank You&#8217; step to the middle of the funnel on the canvas for streamlined user journeys</li>\n<li>Improvement : Restricted the import of checkout steps for lead funnels to focus on lead generation efficiency.</li>\n<li>Improvement : Implemented real-time updates for funnel link in the canvas.</li>\n<li>Bux Fix: Resolved an issue affecting the conditional enablement of landing and custom steps</li>\n<li>Bux Fix: Addressed import conflicts between A/B testing variations and main steps</li>\n<li>Bux Fix: Fixed a loading issue in the step drawer for custom steps</li>\n</ul>\n<h4>3.0.8 (2024-02-29)</h4>\n<ul>\n<li>Improvement : Enhanced setup wizard.</li>\n<li>Bux Fix: Resolved loader issue in step drawer</li>\n</ul>\n<h4>3.0.7 (2024-02-15)</h4>\n<ul>\n<li>Improvement : Allow copying of A/B testing URL for each step.</li>\n<li>Improvement: Enhanced Order Bump action in the funnel checkout</li>\n<li>Bug Fix: Resolved Cross Site Scripting (XSS) issue on settings page</li>\n</ul>\n<h4>3.0.6 (2024-02-01)</h4>\n<ul>\n<li>Bug Fix: Resolved PHP error in funnel checkout</li>\n</ul>\n<h4>3.0.5 (2024-01-24)</h4>\n<ul>\n<li>New: Support for Mail Mint lead form as a funnel opt-in form</li>\n<li>Compatibility: Compatible funnel checkout discount with taxes</li>\n</ul>\n<h4>3.0.4 (2024-01-22)</h4>\n<ul>\n<li>Bug Fix: Resolved step view link issue in funnel canvas</li>\n</ul>\n<h4>3.0.3 (2024-01-17)</h4>\n<ul>\n<li>Bug Fix: Resolved funnel importing issue</li>\n</ul>\n<h4>3.0.2 (2024-01-15)</h4>\n<ul>\n<li>Bug Fix: Resolved migration issue with old UI</li>\n</ul>\n<h4>3.0.1 (2024-01-11)</h4>\n<ul>\n<li>Bug Fix: Resolved coupon issue in funnel checkout</li>\n</ul>\n<h4>3.0.0 (2024-01-11)</h4>\n<ul>\n<li>New: Implemented new UI for WPFunnels canvas</li>\n<li>Bug Fix: Resolved session expire issue in funnel checkout</li>\n</ul>\n<h4>2.8.20 (2024-01-02)</h4>\n<ul>\n<li>Bug Fix: Resolved critical error on email builder</li>\n</ul>\n<h4>2.8.18 (2023-12-22)</h4>\n<ul>\n<li>Bug Fix: Resolved issue with update step slug</li>\n</ul>\n<h4>2.8.17 (2023-12-07)</h4>\n<ul>\n<li>Bug Fix: Resolved product duplication issue in global funnel checkout</li>\n</ul>\n<h4>2.8.16 (2023-11-23)</h4>\n<ul>\n<li>Bug Fix: Resolved PHP warning </li>\n</ul>\n<h4>2.8.15 (2023-11-15)</h4>\n<ul>\n<li>Bug Fix: Resolved stat issue for custom step</li>\n<li>Bug Fix: Resolved anlytics issue for opt-in submission count</li>\n</ul>\n<h4>2.8.14 (2023-11-08)</h4>\n<ul>\n<li>Improvement: Added condition step option for lead funnel</li>\n<li>Improvement: Added event tracking option for all types of funnel</li>\n<li>Bug Fix: Resolved order bump color customization issue</li>\n<li>Bug Fix: Resolved discount issue on regular price in funnel checkout page</li>\n</ul>\n<h4>2.8.13 (2023-11-02)</h4>\n<ul>\n<li>Bug Fix: Critical error caused by the beta version</li>\n</ul>\n<h4>2.8.12 (2023-10-31)</h4>\n<ul>\n<li>Bug Fix: Resolved file size issue</li>\n</ul>\n<h4>2.8.11 (2023-10-31)</h4>\n<ul>\n<li>Bug Fix: Resolved style issue in steup wizard</li>\n<li>Bug Fix: Resolved product block issue in email builder </li>\n</ul>\n<h4>2.8.10 (2023-10-17)</h4>\n<ul>\n<li>Improvement: Added an animation for order bump style 2 </li>\n<li>Bug Fix: Resolved integrations icon issue</li>\n<li>Bug Fix: Resolved php warning</li>\n</ul>\n<h4>2.8.9 (2023-10-04)</h4>\n<ul>\n<li>Bug Fix: Resolved js file enqueuing issue</li>\n</ul>\n<h4>2.8.8 (2023-10-04)</h4>\n<ul>\n<li>Bug Fix: Resolved color picker issue in orderbump</li>\n</ul>\n<h4>2.8.7 (2023-09-21)</h4>\n<ul>\n<li>Improvement: Remove all notice from email builder</li>\n<li>Compatibility: Compatible with Polylang Pro</li>\n</ul>\n<h4>2.8.6 (2023-08-31)</h4>\n<ul>\n<li>Improvement: Auto apply coupon settings in checkout</li>\n<li>Bug Fix: Resolved optin submission issue.</li>\n</ul>\n<h4>2.8.5 (2023-08-24)</h4>\n<ul>\n<li>Bug Fix: Resolved checkout price total updating issue on order bump checkout</li>\n<li>Bug Fix: Resolved CFE options disappearing issue on clicking the update button</li>\n</ul>\n<h4>2.8.4 (2023-08-18)</h4>\n<ul>\n<li>Bug Fix: Resolved opt-in rendering issue</li>\n</ul>\n<h4>2.8.3 (2023-08-17)</h4>\n<ul>\n<li>Bug Fix: Resolved opt-in submission issue</li>\n</ul>\n<h4>2.8.2 (2023-08-16)</h4>\n<ul>\n<li>Improvement: RLT support for funnel template showcase page</li>\n<li>Bug Fix: Resolved orderbump condition issue in conditional step</li>\n</ul>\n<h4>2.8.1 (2023-08-07)</h4>\n<ul>\n<li>Improvement: Restructured optin form rendering methods for Elementor</li>\n<li>Improvement: Restructured optin form rendering methods for Divi</li>\n<li>Compatibility: WooCommerce HPOS compatibility with upsell/downsell and analytics</li>\n<li>Bug Fix: Resolved coupon issue in funnel checkout</li>\n</ul>\n<h4>2.8.0 (2023-07-25)</h4>\n<ul>\n<li>New: Added bulk delete functionality in funnel listing page</li>\n<li>Improvement: Enhanced the UI/UX of funnel listing page</li>\n<li>Improvement: Performance improvement in funnel checkout</li>\n<li>Compatibility: Funnel checkout compatibility with WooCommerce HPOS</li>\n<li>Bug Fix: Payment section is not loading in funnel checkout</li>\n<li>Bug Fix: Session expire issue in checkout</li>\n<li>Bug Fix: Resolved template loading issue</li>\n</ul>\n<h4>2.7.19 (2023-07-17)</h4>\n<ul>\n<li>Improvement: Redesigned funnel and step template showcase</li>\n<li>Improvement: Redesigned funnel import modal</li>\n<li>Improvement: Configured state field requirement based on selected country</li>\n<li>Improvement: Reduced loading time of site dashboard</li>\n<li>Improvement: Carried opt-in data to another opt-in</li>\n<li>Compatibility: Ensured design compatibility with GeneratePress Theme and WooCommerce Payment Gateway</li>\n<li>Bug Fix: Resolved popup order bump design issue</li>\n<li>Bug Fix: Corrected wrong information displayed on setup wizard</li>\n</ul>\n<h4>2.7.18 (2023-07-13)</h4>\n<ul>\n<li>Bug Fix: Resolved redirecting issue </li>\n</ul>\n<h4>2.7.17 (2023-07-13)</h4>\n<ul>\n<li>Bug Fix: Update security patch</li>\n</ul>\n<h4>2.7.16 (2023-07-10)</h4>\n<ul>\n<li>Improvement: Security checks to prevent IDOR attacks on Thank you, Upsell and Downsell pages</li>\n<li>Compatibility: Compatibility with the twenty twenty three theme with WPFunnels checkout</li>\n<li>Bug Fix: Resolved order bump settings saving issue</li>\n</ul>\n<h4>2.7.15 (2023-07-07)</h4>\n<ul>\n<li>Improvement: Removed deprecated methods of PHP </li>\n<li>Bug Fix: Resolved design of payment section in funnel checkout</li>\n</ul>\n<h4>2.7.14 (2023-07-06)</h4>\n<ul>\n<li>Bug Fix: Resolved PHP warning &#8220;Undefined variable $coupon_codes&#8221;</li>\n</ul>\n<h4>2.7.13 (2023-07-06)</h4>\n<ul>\n<li>HotFix: Resolved PHP memory exhaustion issue</li>\n</ul>\n<h4>2.7.12 (2023-06-20)</h4>\n<ul>\n<li>Bug Fix: Resolved issue when deleting a single Integration in canvas</li>\n<li>Bug Fix: Update Step URL on Funnel Name Change</li>\n</ul>\n<h4>2.7.11 (2023-06-15)</h4>\n<ul>\n<li>HotFix : Resolve fetal error of checkout module </li>\n</ul>\n<h4>2.7.10 (2023-06-15)</h4>\n<ul>\n<li>Improvement : Option to change opt-in form button text in Gutenberg</li>\n<li>Improvement : Restrict ThankYou Page data for public view</li>\n<li>Bug Fix : Order bump price preview issue on the canvas</li>\n<li>Bug Fix : Step URL is not getting updated after updating the step&#8217;s slug</li>\n</ul>\n<h4>2.7.9 (2023-05-31)</h4>\n<ul>\n<li>New: Added Auto-apply Coupon option at the funnel checkout</li>\n<li>Bug Fix: Resolved discount issue for variable product</li>\n<li>Bug Fix: Added WooCommerce account creation option in the checkout process</li>\n</ul>\n<h4>2.7.8 (2023-05-24)</h4>\n<ul>\n<li>Improvement: Removed the action scheduler for enhanced performance</li>\n<li>Bug Fix: Addressed the issue where optin form style-3 and style-4 appeared the same in both Gutenberg and Divi editors</li>\n</ul>\n<h4>2.7.7 (2023-05-15)</h4>\n<ul>\n<li>New: Option to change the price color of Order bump</li>\n<li>New: &#8220;Click to expand&#8221; feature for opt-in form</li>\n<li>Compatibility: Compatibility with Electro extension plugin</li>\n<li>Bug Fix: Media duplication issue after duplicating a funnel</li>\n<li>Bug Fix: After duplicating a funnel the view now button doesn&#8217;t work in the duplicated funnel</li>\n<li>Bug Fix: Checkout step&#8217;s caching issue in the settings drawer</li>\n</ul>\n<h4>2.7.6 (2023-05-04)</h4>\n<ul>\n<li>Improvement: Restructured the backend of the discount feature in the checkout step.</li>\n<li>Improvement: Added typography in the opt-in form for the Gutenberg page builder.</li>\n<li>Bug Fix: Couldn’t change background color in the opt-in form button for the Oxygen and Gutenburg for some scenarios.</li>\n<li>Bug Fix: Changed icon for the UTM parameter in the settings inside a funnel.</li>\n<li>Bug Fix: Scrolling issue in the canvas with multiple Mail Mint automation steps</li>\n<li>Improvement: Opt-in form case sensitivity support</li>\n<li>New: Added customization option for radio button in Checkout payment section </li>\n</ul>\n<h4>2.7.5 (2023-04-25)</h4>\n<ul>\n<li>Bug Fix: Optin form submission</li>\n<li>Bug Fix: Wrong text in Funnel canvas automation</li>\n</ul>\n<h4>2.7.4 (2023-04-17)</h4>\n<ul>\n<li>Improvement: Compatibility with Flatsome Theme</li>\n<li>Bug Fix: Template import issue</li>\n<li>Bug Fix: Optin Form &#8211; carry data issue </li>\n</ul>\n<h4>2.7.3 (2023-03-29)</h4>\n<ul>\n<li>Improvement: File type restriction for import funnel</li>\n<li>Improvement: Warning message for invalid file type in Import funnel modal </li>\n<li>Bug Fix: Next Step button alignment</li>\n<li>Bug Fix: Spelling mistake &#8216;start&#8217;</li>\n</ul>\n<h4>2.7.2 (2023-03-28)</h4>\n<ul>\n<li>Improvement: Order bump discount restructure</li>\n<li>Improvement: Improved Default Notification Text that appears After Optin Form Submission</li>\n<li>Improvement: Optimize funnel steps&#8217; priorities</li>\n<li>Improvement: Increase number in the funnel listing page</li>\n<li>Improvement: &#8220;Shipping&#8221; string translation support</li>\n<li>Bug Fix: Warning on funnel dashboard after installing the plugin</li>\n<li>Bug Fix: Admin Email is not auto-filled on Optin Form block in Gutenberg</li>\n<li>Bug Fix: Clicking on WPFunnels menu causes Critical Error on site</li>\n<li>Bug Fix: Can&#8217;t access funnel from Overview page when Elementor Pro is active</li>\n</ul>\n<h4>2.7.1 (2023-02-24)</h4>\n<ul>\n<li>Bug Fix: Issue with Oxygen element register</li>\n<li>Bug Fix: A/B Testing step design conflict</li>\n</ul>\n<h4>2.7.0 (2023-02-22)</h4>\n<ul>\n<li>New: Mail Mint Automation integration with WPFunnels Visual Canvas</li>\n<li>Improvement: New and optimized steps connector</li>\n<li>Improvement: Refined functionality with the latest version of Elementor (v3.50)</li>\n<li>Improvement: Add Phone data to Contact Info (Subscribe as user from form submission)</li>\n<li>Improvement: Reset discount data after removing offer product (Checkout &amp; Order bump)</li>\n<li>Improvement: Translation for “Price” on the checkout form</li>\n<li>Bug Fix: Oxygen Uncaught TypeError</li>\n<li>Bug Fix: Cookies handling for conditional control</li>\n<li>Bug Fix: Payfast payment gateway error during payment</li>\n</ul>\n<h4>2.6.9 (2023-01-11)</h4>\n<ul>\n<li>HotFix: Security Patch</li>\n</ul>\n<h4>2.6.8 (2023-01-10)</h4>\n<ul>\n<li>Bug Fix: Flat discount not removed when replacing checkout product with order bump</li>\n<li>Bug Fix: Unsupported funnel templates are loaded even if WooCommerce or LearnDash are not installed.</li>\n</ul>\n<h4>2.6.7 (2022-12-23)</h4>\n<ul>\n<li>Bug Fix: Divi module rendering confict</li>\n</ul>\n<h4>2.6.6 (2022-12-22)</h4>\n<ul>\n<li>Improvement:  Better compatibility with A/B Testing</li>\n<li>Bug Fix: Issue between order bump &#8220;replace order&#8221; and &#8220;quantity selection&#8221; at the checkout</li>\n<li>Bug Fix: Can&#8217;t review all steps of a funnel when creating a funnel</li>\n</ul>\n<h4>2.6.5 (2022-12-15)</h4>\n<ul>\n<li>HotFix: Security Patch</li>\n</ul>\n<h4>2.6.4 (2022-11-28)</h4>\n<ul>\n<li>HotFix: Analytics compatibility</li>\n</ul>\n<h4>2.6.3 (2022-11-28)</h4>\n<ul>\n<li>Improvement: Improved content on WPFunnels dashboard events tray.</li>\n<li>Improvement: Better error handling when orders are placed from funnels.</li>\n<li>Improvement: Removed dependency on virtual for Cash on delivery.</li>\n</ul>\n<h4>2.6.2 (2022-11-15)</h4>\n<ul>\n<li>New: WPFunnels Events tray on dashboard</li>\n<li>New: A/B Split testing support</li>\n<li>Improvement: New loader style for funnel types</li>\n<li>Improvement: Re-load when updating funnel name</li>\n<li>Bug Fix: Replace option on order bump only replacing 1st product</li>\n</ul>\n<h4>2.6.1 (2022-10-28)</h4>\n<ul>\n<li>Improvement: Improved UI Content</li>\n<li>Improvement: WPFunnels updated notices</li>\n<li>Improvement: Deleting an event log takes the user to a new tab</li>\n<li>Bug Fix: Stripe – American Express card is calculating the fees incorrectly</li>\n<li>Bug Fix: Create a Subscriber not working – opt-in form</li>\n<li>Bug Fix: Thank you Step disabled for Lead Gen type funnel</li>\n</ul>\n<h4>2.6.0 (2022-10-17)</h4>\n<ul>\n<li>New: WPFunnels Event Log</li>\n<li>New: Condition for Conditional Step &#8211; Opt-in Form Submitted</li>\n<li>New: Custom Step Support (with Pro)</li>\n<li>Improvement: Better template syncing</li>\n<li>Improvement: Loader for Next Step button &amp; Optin button</li>\n<li>Improvement: Updated UI on the canvas</li>\n</ul>\n<h4>2.5.8 (2022-10-11)</h4>\n<ul>\n<li>Bug Fix: Error when activating WPFunnels</li>\n</ul>\n<h4>2.5.7 (2022-10-11)</h4>\n<ul>\n<li>New: Next step button type &#8211; URL Path</li>\n<li>New: Next step button type &#8211; Another Funnel</li>\n<li>Improvement: Better processing time for the plugin functionalities</li>\n<li>Bug Fix:  Mercadopago payment doesn&#8217;t work on funnel checkout</li>\n<li>Bug Fix: Templates not changing when the builder is changed</li>\n<li>Bug Fix: The order is not set to processing after checkout</li>\n<li>Bug Fix: Conflict with Slim Seo plugin</li>\n</ul>\n<h4>2.5.6 (2022-10-06)</h4>\n<ul>\n<li>New: Option to change placeholder text for opt-in form fields</li>\n<li>Improvement: Create separate class for re-capcha</li>\n<li>Improvement: RTL Support for order bump</li>\n<li>Improvement: Add website, submitted on Opt-in, to WordPress user data</li>\n<li>Improvement: Discount support for subscription products at the checkout</li>\n<li>Improvement: Auto-reload when changing from Woo to LMS type funnel and vice versa</li>\n<li>Improvement: Improve Divi element labels for translation</li>\n<li>Improvement: Update plugin functionality and performance</li>\n</ul>\n<h4>2.5.5 (2022-09-28)</h4>\n<ul>\n<li>New: Re-captcha (v3) support for Opt-in form</li>\n<li>New: Two-step checkout template for Checkout page</li>\n<li>New: Compatibility with Tutor Starter theme</li>\n<li>Improvement: Mark every opt-in field as required individually</li>\n<li>Improvement: Optimized shortcodes (Next Step Button, Optin, Checkout &amp; Order Details) for unsupported builders</li>\n<li>Bug Fix: Setup Wizard issue &#8211; choosing Lead Gen does not save the funnel type as Lead Gen</li>\n<li>Bug Fix: RTL design issues at the checkout</li>\n<li>Bug Fix: Shop owner/admin not receiving the order confirmation email.</li>\n<li>Bug Fix: Funnel preview issue in Elementor If Pixel Enabled when WooCommerce is Deactivated</li>\n</ul>\n<h4>2.5.4 (2022-09-20)</h4>\n<ul>\n<li>Bug Fix: Converting WooCommerce Funnel to LMS Funnel Breaks UI</li>\n</ul>\n<h4>2.5.3 (2022-09-14)</h4>\n<ul>\n<li>New: Opt-in Form Field &#8211; Website URL</li>\n<li>New: Opt-in Form Field &#8211; Message (Text Area)</li>\n<li>New: Allow users to change field labels for an opt-in form</li>\n<li>New: Auto-fill fields in checkout form from opt-in form submission</li>\n<li>New: Paypal Split Payments Support</li>\n<li>Bug Fix: Checkout form design issues on Gutenberg &amp; Oxygen builder</li>\n</ul>\n<h4>2.5.2 (2022-09-05)</h4>\n<ul>\n<li>New: 4 New Orderbump Styles</li>\n<li>Improvement: Remove customizable options for order bump from checkout widget settings</li>\n<li>Improvement: Multi-step Checkout widget style enhancement — Add option to change color for Navigation, title, and buttons</li>\n<li>Improvement: Divi Custom Header/Footer support</li>\n<li>Improvement: Set order status to ‘Complete’ if all products in the checkout are downloadable/virtual products</li>\n<li>Improvement: Make the Oxygen Template site compatible with Lead Generation</li>\n<li>Improvement: Upsell order not tracked with AffiliateWP</li>\n<li>Bug Fix: Replacing Orders with Upsell/Downsell does not refund shipping or taxes</li>\n<li>Bug Fix: Cancelled Orderbump or Upsell order keeps the taxes</li>\n<li>Bug Fix: Tax issue – If shipping is taxable, then in funnels, shipping tax does not work</li>\n<li>Bug Fix: Tax issues – If the product price is inclusive of tax, then the wrong price is shown in Global Funnels Thank You page</li>\n<li>Bug Fix: Session Expired On Checkout Page For RTL</li>\n<li>Bug Fix: Replacing any orders with Upsell/Downsell shows wrong price at Thank You page</li>\n<li>Bug Fix: Critical error when funnel checkout product is removed from the website (trash)</li>\n<li>Bug Fix: Duplicate funnel issue with Elementor</li>\n</ul>\n<h4>2.5.1 (2022-08-30)</h4>\n<ul>\n<li>New: Compatibility With Express Checkout Layout (Similar to Shopify)</li>\n<li>Bug Fix: Remove Elementor Deprecated Functions from WPFunnels</li>\n<li>Bug Fix: PHP notices in Order bump</li>\n<li>Bug Fix: Critical Error when activating WPFunnels if site has older version PHP</li>\n</ul>\n<h4>2.5.0 (2022-08-17)</h4>\n<ul>\n<li>New: Lead Generation Funnels using WPFunnels</li>\n<li>New: Remove dependency on WooCommerce &amp; LearnDash to install and use WPFunnels</li>\n<li>New: Custom Color Option For Texts On Order bump</li>\n<li>New: Option To Skip Offer For Out Of Stock Products</li>\n<li>Improvement: Show the Total Order Price On Top Ff Thank you page</li>\n<li>Improvement: Cancel subscriptions when order is refunded.</li>\n<li>Bug Fix: Removed restriction on changing cart for product types created by unsupported plugins</li>\n<li>Bug Fix: Rejecting order bump (with discount), when main product is same leaves, the lower price in cart</li>\n<li>Bug Fix: Country/Region field type issue &#8211; dropdown missing</li>\n</ul>\n<h4>2.4.22 (2022-08-12)</h4>\n<ul>\n<li>Bug Fix: PHP notice while doing checkout</li>\n</ul>\n<h4>2.4.21 (2022-08-11)</h4>\n<ul>\n<li>New: 2 New Order bump Styles</li>\n<li>Improvement: WYSIWYG editor for description in Order bump</li>\n<li>Bug Fix: Product quantity multiplying on every add/remove of order bump</li>\n<li>Bug Fix: Remove :before selector &#8220;Add new condition&#8221; icon</li>\n<li>Bug Fix: Rejecting order bump (with discount) when main product is same leaves the lower price in cart</li>\n</ul>\n<h4>2.4.20 (2022-08-04)</h4>\n<ul>\n<li>New: Background Color for Order bump</li>\n<li>Improved: Remove Extra Step On Integration Tab</li>\n</ul>\n<h4>2.4.19 (2022-07-28)</h4>\n<ul>\n<li>Bug Fix: Coupon not working</li>\n<li>Bug Fix: Oderbump rejection not working</li>\n</ul>\n<h4>2.4.18 (2022-07-27)</h4>\n<ul>\n<li>New: 2 More Orderbump Styles</li>\n<li>New: Conditional Steps Control Option &#8211; &#8216;Billing country is&#8217;</li>\n<li>New: Conditional Steps Control Option &#8211; &#8216;Shipping country is&#8217;</li>\n<li>Improved: Change Funnel status icon</li>\n<li>Bug Fix: Discount price issue when amount is more than 3 digits</li>\n</ul>\n<h4>2.4.17 (2022-07-22)</h4>\n<ul>\n<li>Improved: Oxygen builder template import url updated</li>\n</ul>\n<h4>2.4.16 (2022-07-21)</h4>\n<ul>\n<li>New: Option to Draft Funnel at the Funnel Overview page</li>\n<li>New: Send Optin Sign Up Data To Multiple Admin Emails</li>\n<li>New: Allow Product Title Customization For Order bump</li>\n<li>Improved: If funnel has no thank you step, after checkout redirect to default WooCommerce Thank You</li>\n<li>Improved: Dynamic Order bump fields based on template</li>\n</ul>\n<h4>2.4.15 (2022-07-18)</h4>\n<ul>\n<li>New: Woostify theme checkout layouts support</li>\n<li>Improved: Reduced API calls on canvas</li>\n<li>Bug Fix: Divi modules not getting style when dropped</li>\n<li>Bug Fix: Session Expired at the checkout Issue</li>\n</ul>\n<h4>2.4.14 (2022-07-06)</h4>\n<ul>\n<li>Improved: Improve Replace Main Order Compatibility with Global Funnels</li>\n<li>Bug Fix: In WooCoomerce, adding the same product to the cart lists them as separate products while WPFunnels is active,</li>\n<li>Bug Fix: &#8216;Sold individually&#8217; feature for WooCommerce products not working while WPFunnels is active</li>\n</ul>\n<h4>2.4.13 (2022-07-04)</h4>\n<ul>\n<li>New: Flatsome Theme support</li>\n<li>Improved: Improve Bank Details Section Design at the Thank you page for Direct Bank Transfer</li>\n<li>Improved: Optimized functionality with new Global Funnels conditions</li>\n<li>Improved: Optimized functionality with new LMS Addon update</li>\n</ul>\n<h4>2.4.12 (2022-06-28)</h4>\n<ul>\n<li>Fixed: Error due to WooCommerce shipping dependency</li>\n<li>Improvement: Improved compatibility with Global Funnels</li>\n<li>Improvement: Optimized Template Syncing during funnel creation</li>\n</ul>\n<h4>2.4.11 (2022-06-24)</h4>\n<ul>\n<li>New: Compatibility with WPFunnels Integrations Add On</li>\n<li>Fixed: Quantity Selector not working when Order bump and main product in cart is the same.</li>\n<li>Fixed: Can&#8217;t find WPFunnels Elementor widgets</li>\n<li>Improvement: Compatibility with new Global Funnels Conditions</li>\n<li>Improvement: Multisite plugin compatibility</li>\n<li>Improvement: Cookies durability management</li>\n<li>Improvement: Checkout module design improvement (Divi)</li>\n</ul>\n<h4>2.4.10 (2022-06-15)</h4>\n<ul>\n<li>Improvement: Improved Functionality with Global Funnels</li>\n</ul>\n<h4>2.4.9 (2022-06-09)</h4>\n<ul>\n<li>New: Woostify theme support</li>\n<li>New: Show funnel creation meta (Woo or LMS)</li>\n<li>Fixed: Deprecated Functions In Elementor</li>\n<li>Fixed: Duplicating funnels breaking style</li>\n<li>Fixed: Order status not changing to processing</li>\n</ul>\n<h4>2.4.8 (2022-06-03)</h4>\n<ul>\n<li>Improvement: Improvement on Template dashboard </li>\n</ul>\n<h4>2.4.7 (2022-06-02)</h4>\n<ul>\n<li>Compatibility:  WordPress 6.0 Compatibility</li>\n<li>New: 3 Exclusive Order Bump Styles</li>\n<li>New: Translation Support</li>\n<li>New: Blocksy Theme Compatibility</li>\n<li>Improvement: Opt-in Admin Email Time Set To WordPress Time</li>\n<li>Improvement: Faster Templates Sync</li>\n<li>Improvement: WPF LMS Addon Compatibility</li>\n</ul>\n<h4>2.4.6 (2022-05-23)</h4>\n<ul>\n<li>Fixed: Tax Calculation Mismatch</li>\n<li>Fixed: Discount value mismatch at the Thank You Page</li>\n</ul>\n<h4>2.4.5 (2022-04-27)</h4>\n<ul>\n<li>Improved: Changes In Settings Tab</li>\n</ul>\n<h4>2.4.4 (2022-04-13)</h4>\n<ul>\n<li>Fixed: Multiple Optin support in Landing</li>\n<li>Fixed: Conflict with Woodmart Theme</li>\n</ul>\n<h4>2.4.3 (2022-04-08)</h4>\n<ul>\n<li>Fixed: Issue with discount on checkout page</li>\n<li>Fixed: Order bump render issue in checkout shortcode</li>\n<li>Fixed: Order bump auto-creation for Gutenberg</li>\n</ul>\n<h4>2.4.2 (2022-04-08)</h4>\n<ul>\n<li>Fixed: Order bump issue in elementor edit mode  </li>\n</ul>\n<h4>2.4.1 (2022-04-06)</h4>\n<ul>\n<li>Fixed: Order bump warning while saving data</li>\n</ul>\n<h4>2.4.0 (2022-03-31)</h4>\n<ul>\n<li>New: LearnDash WooCommerce Add-on Compatibility</li>\n</ul>\n<h4>2.3.9 (2022-03-31)</h4>\n<ul>\n<li>Fixed: Elementor conflict with order bump</li>\n</ul>\n<h4>2.3.8 (2022-03-30)</h4>\n<ul>\n<li>New: Basic RTL Support</li>\n<li>Improved: New Order Bump UI</li>\n<li>Fixed: Style issue with Oxygen Builder</li>\n</ul>\n<h4>2.3.7 (2022-03-24)</h4>\n<ul>\n<li>Added: Variable product support</li>\n</ul>\n<h4>2.3.6 (2022-03-18)</h4>\n<ul>\n<li>Added: Exclusive Discount on Main Product</li>\n<li>Added: Register User As Subscriber After Optin</li>\n<li>Added: Restrict Theme Style in Funnel Step Pages</li>\n<li>Improvement: Compatibility With Cart Lift At Checkout</li>\n<li>Improvement: WYSIWYG editor for Terms and condition in Optin</li>\n<li>Improvement: Global Funnels Addon Version Check With Updated Features</li>\n<li>Fixed: Elementor checkout backend preview</li>\n<li>Fixed: Error when Oxygen version is v3.2 or below</li>\n</ul>\n<h4>2.3.5 (2022-03-04)</h4>\n<ul>\n<li>Fixed: Elementor checkout backend preview</li>\n<li>Fixed: Duplicating a funnel changes it to Gutenberg</li>\n</ul>\n<h4>2.3.4 (2022-03-01)</h4>\n<ul>\n<li>Fixed: Divi timeout issue</li>\n</ul>\n<h4>2.3.3 (2022-02-18)</h4>\n<ul>\n<li>Enhancement: Optimize Webhook Events</li>\n</ul>\n<h4>2.3.2 (2022-02-16)</h4>\n<ul>\n<li>Fixed: Templates Site Link Fixed</li>\n</ul>\n<h4>2.3.1 (2022-02-16)</h4>\n<ul>\n<li>Added: WPFunnels Webhooks Addon Compatibility</li>\n<li>Improved: License Page Style Improvement</li>\n</ul>\n<h4>2.3.0 (2022-02-15)</h4>\n<ul>\n<li>New: Oxygen Builder Support</li>\n<li>New: Oxygen Elements &#8211; Next Step Button, Checkout, Order Details, Opt-in Form</li>\n<li>New: Roll Back Option</li>\n</ul>\n<h4>2.2.7 (2022-02-11)</h4>\n<ul>\n<li>Added: Option to remove WPFunnels Transient Cache</li>\n<li>Fixed: Multiple Elementor Save Templates Menu when WPFunnels Active</li>\n<li>Fixed: Deactivating license from User Account not working</li>\n<li>Fixed: Order bump products with more than 1 quantity don&#8217;t reflect in the backend</li>\n</ul>\n<h4>2.2.6 (2022-02-09)</h4>\n<ul>\n<li>Added: Phone field in Opt-in form</li>\n<li>Improvement: Divi Theme Compatibility</li>\n<li>Bug Fix: Gutenberg Next Step Button Transparent color issue</li>\n</ul>\n<h4>2.2.5 (2022-02-03)</h4>\n<ul>\n<li>Added: Auto collect product short description for order bump</li>\n<li>Added: Add logo of page builder used beside Funnel Name in Overview</li>\n<li>Added: Click to copy step link from step link settings</li>\n<li>Improvement: Do not allow to add product variation if it is out of stock</li>\n<li>Fixed: Can not change order bump image</li>\n<li>Fixed: Conflict with Elementor &#8211; v3.1.4 and Elementor Pro v3.1.1</li>\n<li>Fixed: Divi Checkout page design issue &#8211; extra space beside Coupon option</li>\n</ul>\n<h4>2.2.4 (2022-01-28)</h4>\n<ul>\n<li>Fixed: Conflict with Elementor Global Settings</li>\n<li>Fixed: Issue with Next Step Button Rendering</li>\n<li>Fixed: Conflict with 2022 theme</li>\n</ul>\n<h4>2.2.3 (2022-01-26)</h4>\n<ul>\n<li>Fixed: Divi builder issue when editing in front end</li>\n<li>Fixed: Conflict when SEO tool used with Elementor</li>\n<li>Fixed: Payment gateway not working for $0 product + Order bump</li>\n</ul>\n<h4>2.2.2 (2022-01-20)</h4>\n<ul>\n<li>Improvement: Variation should display variation product image</li>\n<li>Fixed: Out of stock product can be added as OB</li>\n<li>Fixed: Multiple product variations showing &#8220;Size is a required field&#8221;</li>\n<li>Fixed: Multiple connectors allowed when toggling global funnels or saving funnel title</li>\n</ul>\n<h4>2.2.1 (2022-01-18)</h4>\n<ul>\n<li>Fixed: Issue with variable products order details error</li>\n<li>Fixed: Missing Divi builder warning although builder is active</li>\n</ul>\n<h4>2.2.0 (2022-01-14)</h4>\n<ul>\n<li>Added: Divi builder &amp; Theme support</li>\n<li>Added: WPF Divi Modules (Next Step Button, Opt-in, Checkout, Order details)</li>\n<li>Added: WPF Shortcodes (Next Step Button, Opt-in, Checkout, Order details)</li>\n<li>Added: Show Order bump added or not on the visual canvas</li>\n<li>Compatibility Check: WooCommerce v6.1.0</li>\n<li>Improvement: Improved UI with meaningful tooltips</li>\n<li>Improvement: Template style and design optimization</li>\n<li>Improvement: Optimize templates for mobile responsiveness</li>\n<li>Improvement: Improved Conditional Step control</li>\n<li>Improvement: Improved WPF Elementor widgets to avoid conflict with other Elementor Addons</li>\n<li>Improvement: Improved discount application</li>\n<li>Improvement: WooCommerce action scheduler older version support</li>\n<li>Improvement: Improved steps slug control</li>\n<li>Improvement: Order bump variation pricing display optimization</li>\n<li>Fixed: Deleting Conditional Step showing No Product Added Label</li>\n<li>Fixed: Settings tab slug conflict with other plugins</li>\n<li>Fixed: Duplicated funnel&#8217;s checkout being replaced with WooCommerce checkout</li>\n<li>Fixed: Duplicated funnel not taking set conditions</li>\n<li>Fixed: Duplicated funnel not taking all events for CRM integration</li>\n<li>Fixed: USD (or currency) not showing when order bump is added</li>\n<li>Fixed: Order bump issue when the same product is assigned as Main offer and order bump</li>\n</ul>\n<h4>2.1.20 (2022-01-04)</h4>\n<ul>\n<li>Fixed: Conflict with WooCommerce German Market plugin hooks</li>\n</ul>\n<h4>2.1.19 (2022-01-04)</h4>\n<ul>\n<li>Fixed: Issue with variable product in the Checkout step </li>\n</ul>\n<h4>2.1.18 (2021-12-31)</h4>\n<ul>\n<li>Fixed: Compatibility with global funnel</li>\n</ul>\n<h4>2.1.17 (2021-12-31)</h4>\n<ul>\n<li>Fixed: Allow customers to log into an  &hellip;</li>\n</ul>\n"
    },
    "short_description": "WPFunnels - funnel building made easy. Craft lead generation funnels, sales funnels, or eCommerce funnels easily within WordPress with a visualized ap &hellip;",
    "description": "<p>👥 Lead Generator 💰 Sales Funnel Builder 🛍️ eCommerce Funnel Builder 🎓 Course Funnel Builder</p>\n<p>Create high-converting lead funnels and sales funnels within WordPress using the easiest visual funnel builder – WPFunnels.</p>\n<h3>The Easiest Funnel Builder To Generate Leads &amp; Sales In WordPress</h3>\n<p>Craft high-converting landing pages along with opt-in forms to generate leads.</p>\n<p>✅ Well-designed landing pages<br />\n✅ Built-in opt in form.<br />\n✅ Easily send leads to Mail Mint<br />\n✅ Active lead nurturing &amp; conversion<br />\n(with help from Mail Mint)</p>\n<p>Start growing and converting your leads on autopilot.</p>\n<h3>The Best Sales Funnel Builder To Increase Revenue</h3>\n<p>Use a visual canvas to plan a complete sales funnel journey and use exclusive features which include:</p>\n<p>✅ Pre-built templates &amp; custom landing pages<br />\n✅ Order bumps and optimized checkout pages<br />\n✅ One click upsell offers after checkout<br />\n✅ WooCommerce checkout customizer<br />\n✅ Conditional offers &amp; funnel steps<br />\n✅ Detailed funnel analytics<br />\nand many more.</p>\n<p>Craft a sales funnel journey that is built to boost your revenue with high AOV.</p>\n<p>Whether you want to create a WooCommerce sales funnel, sales funnels to offer services, or course funnels, WPFunnels will make it easy for you.</p>\n<p>💥 💥 💥</p>\n<p><a href=\"https://getwpfunnels.com/resources/\" rel=\"nofollow ugc\"> 👉 Documentation</a> | 👉 <a href=\"https://www.youtube.com/channel/UCIDB7eo-kCAVXRG4xKG-GCQ/playlists\" rel=\"nofollow ugc\">Video Tutorials</a> | 👉 <a href=\"https://www.facebook.com/groups/wpfunnels/\" rel=\"nofollow ugc\">Join our Facebook Community</a></p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/GrzIRl5jfBE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Launch Your Funnel In Minutes Using Pre-build Templates!</h3>\n<p>WPFunnels comes with tons of pre built sales funnel templates for several niches, which you can import with just a click.</p>\n<p>This means you can start using sales funnels immediately without wasting any time.</p>\n<p>WPFunnels is currently the easiest funnel builder for WordPress &amp; WooCommerce.</p>\n<p>It comes with a user-friendly interface to help you create complete sales funnels easily, on your own, within minutes.</p>\n<p>The visual canvas lets you visually plan, design, and build your funnel flows easily – you have complete control over your funnel!</p>\n<h3>💥 Why Use WPFunnels 💥</h3>\n<p>WPFunnels is created for digital creators (such as online coaches, educators, course creators, etc.), entrepreneurs, and marketers like yourself to increase your leads and online sales revenue using sales funnels.</p>\n<p>Use this reliable WordPress funnel builder to automate your sales process and stay in control of every stage of the buyer’s journey.</p>\n<p>Currently, WPFunnels is the easiest funnel builder for WordPress &amp; WooCommerce, coming with a user-friendly interface to help you create complete sales funnels easily, on your own, within minutes.</p>\n<p>You will have access to tons of pre-built sales funnel templates for several niches, which you can import with just a click. This means you can start using sales funnels immediately without wasting any time.</p>\n<p>Plus, the visual canvas lets you visually plan, design, and build your funnel flows easily without getting confused or overwhelmed with complex UI. You have complete control over your funnel from a single place without leaving your WordPress dashboard.</p>\n<p>It&#8217;s really easy to get started:</p>\n<ol>\n<li>Plan Your Lead Funnel or Sales Funnel Journey On A Visual Canvas</li>\n<li>Design Your Funnel Steps Using Your Preferred Page Builder</li>\n<li>Set Up Email Automation To Nurture Leads And Convert Customers (with the help of Mail Mint)</li>\n<li>Launch Your Campaign And Reach Your Target Audience</li>\n<li>Start Getting Leads &amp; Sales On Autopilot.</li>\n</ol>\n<p>You will get everything you need, whether you wish to collect leads or want to run a sales campaign:</p>\n<ul>\n<li>Opt-in form to collect leads,</li>\n<li>Exclusive discounts for promotions,</li>\n<li>Replace the WooCommerce checkout page,</li>\n<li>Make order bump offers during checkout,</li>\n<li>Use post-purchase offers (one click upsell &amp; downsell),</li>\n</ul>\n<p>Guide your leads and prospects through an engaging funnel journey (email automation^, discount, order bump, upsell, or downsell) and trigger them to purchase more than what they had initially intended.</p>\n<p><em> ^Email automation can be used on the visual funnel canvas if you have Mail Mint.</em></p>\n<h3>🌟 A Complete Funnel Building Solution Within WordPress 🌟</h3>\n<p>No need to use multiple tools to create or track your funnels.</p>\n<p><strong>Use a single funnel builder to plan, design, and execute complete sales funnels, without leaving your WordPress dashboard.</strong></p>\n<ul>\n<li>A visual funnel canvas for funnel mapping &amp; planning</li>\n<li>All the basic funnel steps needed (Landing, Checkout, Thank You)</li>\n<li>Pre Made Funnel Templates for every step</li>\n<li>Gutenberg, Elementor, Divi, Bricks, or Oxygen Page Builder Support</li>\n<li>Make Order bump offers at the WooCommerce checkout</li>\n<li>Trigger One Click Upsell and Downsell offers offers after WooCommerce checkout (Pro)</li>\n<li>Conditional redirection to control the buyer’s journey</li>\n<li>Exclusive discounts for your funnel offers only</li>\n<li>Detailed analytics of every funnel step (Pro)</li>\n<li>Conditional eCommerce Funnels for your WooCommerce store (Pro)</li>\n<li>Opt-in Form for lead generation</li>\n<li>Direct integration with Mail Mint to collect &amp; manage leads</li>\n<li>Flawless Email Marketing Automation On The Funnel Canvas (requires Mail Mint) (Pro)</li>\n<li>Create Course Funnels along with WooCommerce (Tutor LMS, LearnDash)</li>\n<li>Integration with CRM Tools &#8211; Fluent CRM &amp; many more (Pro)</li>\n<li>Webhooks support for sending data to external tools (Pro)</li>\n<li>Create Funnels for LearnDash Courses Directly (without WooCommerce) (Pro)</li>\n<li>Support for Cash On Delivery, Check Payments, Direct Bank Transfer &#8211; BACS, and default WooCommerce Payments.</li>\n<li>Major Payment processing support for one click upsell – Stripe, PayPal, Mollie, Authorize.net, Square, Sumit, PayFast &amp; More!</li>\n<li>Any payment gateway support for post-purchase upsells. (Pro)</li>\n<li>A/B split testing (Pro)</li>\n</ul>\n<p>You get to control everything from planning your funnel to launching a live campaign in 1 place &#8211; no complexity.</p>\n<p>Can&#8217;t find what you are looking for or have a feature request? <a href=\"https://getwpfunnels.com/ideas/\" rel=\"nofollow ugc\">👤 Let us know!</a></p>\n<h3>🌟 A Funnel Builder For EVERY Business In EVERY Niche 🌟</h3>\n<p>This plugin is made for any online business whether you are a:</p>\n<p>✅ Marketing Coach ✅ Life Coach ✅ Business Coach ✅ Fitness Trainer ✅ Yoga Instructor<br />\n✅ Business Consultant ✅ Course Creators ✅ eCommerce Shop ✅ Software Firm ✅Counselor<br />\n✅ Marketing Strategist ✅ Affiliate Marketer ✅ Educational Portal ✅ Marketing Agency<br />\n✅ Financial Coach ✅ Marketing Consultant ✅ Yoga Instructor ✅ Advertising Agency</p>\n<p>And many more&#8230;</p>\n<p>Create highly converting sales funnels no matter what business you are in using WPFunnels.</p>\n<h3>🌟 Maximize Your Leads And Online Sales No Matter What Product You Offer 🌟</h3>\n<p>WPFunnels is a unique funnel builder that is suitable for generating leads and increasing sales for any products you offer.</p>\n<ul>\n<li>Sell Online Courses</li>\n<li>Sign More Online Subscriptions</li>\n<li>Promote Webinar Registrations</li>\n<li>Conduct Lead Generation</li>\n<li>Sell WooCommerce Products</li>\n<li>Increase eBooks Sales</li>\n<li>Sell Supplement Products</li>\n<li>Market Event Tickets</li>\n<li>Offer Exclusive Services</li>\n</ul>\n<p>The plugin is simply the right choice to help you reach your business and marketing goals.</p>\n<h3>🌟 Create Fully Functional Funnels In Just 15 Minutes 🌟</h3>\n<p>WPFunnels comes with tons of pre-built funnel templates that are specialized in different niches.</p>\n<p>All you need to do is choose a template, improve the content, and launch your sales funnel campaign.</p>\n<p>In fact, you can complete the whole process in as low as 15 minutes</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/jltW4529ui0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>It is a funnel builder that is made for both tech-savvy and non-tech marketers who want to boost their revenue.</p>\n<p>Besides, you may always get help from our reliable support team whenever required.</p>\n<h4>Spend An Additional 15 minutes and you will have email automation set up for your funnels as well</h4>\n<p>If you have Mail Mint Pro along with WPFunnels, then while staying on the canvas, you can define automation workflows based on visitor actions in every funnel step.</p>\n<p>You may add them to lists &amp; tags, run nurture email campaigns, and even send out promotional emails to sell more products or drive conversions.</p>\n<p>WPFunnels and Mail Mint are a brilliant combination to help you create a fully automated sales funnel.</p>\n<h3>🌟 A Simplified Funnel Builder To Save Your Time And Effort 🌟</h3>\n<p>One of the main purposes of creating WPFunnels was to make your life easier when creating sales funnels.</p>\n<p>The plugin is designed in a way so that you can build sales funnels without any complications.</p>\n<p>It’s a reliable funnel builder that is specialized to</p>\n<ul>\n<li>Reduce the time required to build funnels</li>\n<li>Exclude all unnecessary steps and simplify the process</li>\n<li>Enhance funnel planning with a visual representation</li>\n<li>Ensure the whole process is possible within WordPress</li>\n<li>Make your efforts meaningful and productive</li>\n<li>Launch your funnel campaigns ASAP.</li>\n</ul>\n<p>Your time and effort will not be wasted; Your leads and sales will grow without any hassle.</p>\n<p>In fact, WPFunnels is a great alternative to WordPress solutions such as Carflows or FunnelKit, and a cost-effective <a href=\"https://getwpfunnels.com/clickfunnels-alternative/?utm_source=repo&amp;utm_medium=repo&amp;utm_campaign=clickfunnels_alternative&amp;utm_id=clickfunnels_alternative\" rel=\"nofollow ugc\">alternative to ClickFunnels</a> in WordPress. You will love how simplified the plugin is, especially if you are a digital creator or online educator.</p>\n<h3>🌟 Level Up Your eCommerce Sales Using WooCommerce Sales Funnel 🌟</h3>\n<p>Last few months, we worked on the pain points you might have when building a WordPress sales funnel or WooCommerce sales funnel. And so, we planned to come up with the best possible version.</p>\n<p>Since WPFunnels 3.0, you now have a revamped visual canvas for hassle-free funnel building, distraction-free conditional step configuration, and improved A/B testing for better optimization.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/OrDQg-XcOLY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Boost Your Sales Process With Exclusive Features Of WPFunnels</h3>\n<p>Check out the amazing features you get with WP Funnels to help you boost sales.</p>\n<p><strong>⭐ Visual Funnel Canvas To Build Funnels Easily ⭐</strong></p>\n<p>Plan your funnels without any hassle. Use a visual funnel builder to plan and organize your funnel steps.</p>\n<p>You have full control over funnel navigation and planning &#8211; add the steps you want to use, add the necessary steps, use conditional flows, and configure the whole funnel right from the canvas.</p>\n<blockquote>\n<p><a href=\"https://getwpfunnels.com/funnel-mapping/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-canvas&amp;utm_id=wpf2024\" rel=\"nofollow ugc\">Map your funnels with the visual funnel canvas</a> and jumpstart your funnel process in minutes.</p>\n</blockquote>\n<p><strong>⭐ Pre-made Sales Funnel Templates To Start Selling Immediately ⭐</strong></p>\n<p>Design your funnel from scratch or choose from dozens of niche-specific funnel templates that are optimized for high conversion. Get a complete funnel with just a click and start selling immediately.</p>\n<blockquote>\n<p>It’s a simplified funnel builder, specialized to make your funnel building process easier than ever with <a href=\"https://getwpfunnels.com/pre-made-sales-funnel-templates/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-sales-funnel-templates&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">pre-made funnel templates</a>.</p>\n</blockquote>\n<p><strong>⭐ Gutenberg, Elementor, Divi, Bricks &amp; Oxygen Page Builder Integration ⭐</strong></p>\n<p>The plugin comes with exclusive Gutenberg blocks, Elementor widgets, Divi modules &amp; Oxygen elements for every funnel step to help you customize your funnel pages with full control.</p>\n<blockquote>\n<p>Design every step of the funnel <a href=\"https://getwpfunnels.com/design-funnel-pages-with-the-best-page-builders/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-page-builders&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">using your favorite page builders</a>.</p>\n</blockquote>\n<p><strong>⭐ Shortcodes For WPFunnels Blocks ⭐</strong></p>\n<p>Design your funnel pages with many page builders using Shortcodes.</p>\n<blockquote>\n<p><a href=\"https://getwpfunnels.com/docs/wpfunnels-shortcodes/how-use-shortcodes-to-make-your-funnel-functional/\" rel=\"nofollow ugc\">Use dedicated Shortcodes</a> for your sales funnel components for a hand full of page builders.</p>\n</blockquote>\n<p><strong>⭐ Custom Checkout Page For Every Funnel ⭐</strong></p>\n<p>Make your checkout process distraction-free with <a href=\"https://getwpfunnels.com/optimized-custom-checkout-page-for-sales-funnel/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-custom-checkout-page&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">custom checkout pages</a> and increase conversion.</p>\n<p>Create a seamless checkout experience for your customers and optimize checkout via checkout optimizer with different checkout layouts, steps, and checkout fields.</p>\n<p>You can easily replace the basic WooCommerce Checkout Page with different checkout templates without any hassle.</p>\n<p><strong>⭐ Order Bump Offers At The WooCommerce Checkout ⭐</strong></p>\n<p>Add an attractive <a href=\"https://getwpfunnels.com/guide-to-woocommerce-funnels-using-global-funnels/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=blog-global-funnels&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">order bump offer</a> during the checkout and increase your sales revenue.</p>\n<blockquote>\n<p>Create your own <a href=\"https://getwpfunnels.com/woocommerce-order-bump/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-orderbump&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">order bump</a> offers and <a href=\"https://getwpfunnels.com/docs/sales-funnel-offers-to-boost-sales/order-bump-offer-at-the-checkout/\" rel=\"nofollow ugc\">design them easily</a>. Place them anywhere on the checkout page as you like.</p>\n</blockquote>\n<p><strong>⭐ Fully Functional With WooCommerce ⭐</strong></p>\n<p>Easily integrate with WooCommerce to implement sales funnels to your WooCommerce products and increase sales.</p>\n<p>Not only that, you can easily replace your current WooCommerce checkout module with different checkout templates, replaceable fields and many more!</p>\n<p>You can create funnels for WooCommerce Subscription products, WooCommerce Chained Products, Tutor LMS course products, etc.</p>\n<blockquote>\n<p><a href=\"https://getwpfunnels.com/global-dynamic-woocommerce-funnels/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-global-funnels&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">Use Global Funnel for WooCommerce (Pro)</a>: Set Conditional Offers for your WooCommerce store based on conditions such as category, product quantity, cart total, product popularity, and many more. Then make dynamic offers to your buyers for higher conversion.</p>\n</blockquote>\n<p><strong>⭐ WPFunnels Opt-in Form Integration With Mail Mint Lead Generation &amp; Management (Free) ⭐</strong></p>\n<p>Use WPFunnels to create lead generation funnels and configure it to directly send the leads to Mail Mint&#8217;s lists &amp; tags. <a href=\"https://getwpfunnels.com/docs/lead-generation-funnel/wpfunnels-opt-in-form-to-mail-mint/?utm_source=wp-repo&amp;utm_medium=descr&amp;utm_campaign=21may24-lead\" rel=\"nofollow ugc\">Learn More</a></p>\n<p>And then set up quick email automation workflows to nurture and convert your leads.</p>\n<p><strong>⭐ Post-purchase Upsells with Any Payment Gateways In Your Funnels (Pro) ⭐</strong></p>\n<p>No more restrictions in offering post-purchase upsells. Unlike most other tools, with WPFunnels, you will be able to make post-purchase upsell offers no matter what payment gateway you use such as Razorpay, MBWay, EUPago, Marcado Pago, etc.</p>\n<p>Take a look:</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/FajRJY9UVXM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p><strong>⭐ One click Upsell And Downsell Offers (Pro) ⭐</strong></p>\n<p>For selected payment gateways such as Paypal, Stripe (and many more, you can trigger one-time offers or any exclusive offers as <a href=\"https://getwpfunnels.com/one-click-upsell-downsell-offer/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-upsell-downsell&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">upsell or downsell after checkout</a>, to attract your buyers to purchase even more and leverage the buyer&#8217;s intent to your advantage. These offers can be accepted with just one click, making it highly effective to increase AOV.</p>\n<p><strong>⭐ Mail Mint Integration for Flawless Email Marketing Automation (Pro)⭐</strong></p>\n<p>Use Mail Mint to create simple email campaigns &amp; segmented email series with strategic time delays.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/y2X4bDZzmsU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<p>On WPFunnels visual canvas, connect those email campaigns with any steps of your sales funnel or lead funnel journey.</p>\n<p>Based on the actions of your users, these email campaigns will activate automatically.</p>\n<p>👉 <a href=\"https://getwpfunnels.com/visual-funnel-building/?utm_source=wpf-repo-description&amp;utm_medium=wpf-repo-cta&amp;utm_campaign=complete-funnel-feature-page&amp;utm_id=wpf-repo-2023\" rel=\"nofollow ugc\">Your Complete Visual Funnel Solution</a></p>\n<p>So, create your sales funnel journey &amp; automate email marketing in a single visual canvas.</p>\n<p>📂 <a href=\"https://getwpfunnels.com/single-visual-canvas-for-funnels-and-email/?utm_source=wordpress&amp;utm_medium=wpfdesc&amp;utm_campaign=mmandwpflaunch\" rel=\"nofollow ugc\">Learn More</a></p>\n<p><strong>⭐ Opt-in Form To Collect Leads ⭐</strong></p>\n<p>Use the simple <a href=\"https://getwpfunnels.com/lead-generation/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-lead-gen&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">built-in Opt-in form to collect leads</a>, which is not dependent on WooCommerce.</p>\n<p><strong>⭐ Webhooks Support To Send Data (Pro) ⭐</strong></p>\n<p><a href=\"https://getwpfunnels.com/docs/wpfunnels-webhooks-support/\" rel=\"nofollow ugc\">WPFunnels Webhooks</a> allows you to send data to major automation tools and most email clients based on user actions in your sales funnel.</p>\n<p><strong>⭐ Checkoutify &#8211; Checkout Customizer Addon For Easy Customization (Pro) ⭐</strong></p>\n<p>Checkoutify is the game-changing WooCommerce Checkout Customizer that puts you in control.</p>\n<p>Effortlessly design cleaner and more efficient checkouts with advanced customization options.</p>\n<p>✅ Boost sales by strategically placing your checkout form where it matters most.<br />\n✅ Tailor your checkout sections effortlessly with separate widgets and layouts.<br />\n✅ Embed your checkout forms anywhere using shortcodes for increased flexibility.<br />\n✅ Increase average order value with strategic order bump placement.</p>\n<p>[https://youtu.be/nqtO4qYkUJQ?si=m82XHtl9BrBKIguA]</p>\n<p><strong>⭐ Integration With Major Automation &amp; CRM Tools (Pro) ⭐</strong></p>\n<p><a href=\"https://getwpfunnels.com/integration-with-crm-and-automation-tools/?utm_source=wpf-repo&amp;utm_medium=repo-content&amp;utm_campaign=fpage-crm-integration&amp;utm_id=wpf2022/\" rel=\"nofollow ugc\">Send data to major automation &amp; CRM tools</a> such as Mail Mint, MailPoet, ActiveCampaign, MailChimp, FluentCRM, Constant Contact, AWeber, Sendinblue, MailerLite, GetResponse, Encharge, HubSpot and other email clients based on user actions in your sales funnel.</p>\n<blockquote>\n<p>Integrate with the most popular automation tool Zapier and send data to your favorite tools.</p>\n</blockquote>\n<p><strong>⭐ Course Funnels Using LearnDash And WPFunnels (Pro) ⭐</strong></p>\n<p>For the first time in WordPress, you can create course funnels in WordPress without using WooCommerce! Plan a funnel journey and offer courses in your sales funnel as order bump, upsell and downsell, by using WPFunnels and LearnDash. (No WooCommerce needed.)</p>\n<p><strong>⭐ Custom Step For Advanced Funnel Building (Pro) ⭐</strong></p>\n<p>Create additional custom pages between the landing and the checkout to craft powerful Hybrid Funnels, Squeeze Funnels, Affiliate Marketing Bridge Funnels, etc.</p>\n<blockquote>\n<p>Use <a href=\"https://getwpfunnels.com/custom-step-for-advanced-funnel-building/?utm_source=wpf-repo-content&amp;utm_medium=custom-step-cta&amp;utm_campaign=custom-step-announcement&amp;utm_id=wpf-repo2023/\" rel=\"nofollow ugc\">Custom Step</a> to have more control over your sales funnels.</p>\n</blockquote>\n<p>**⭐ Experience A/B Split  &hellip;</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.12.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/wpfunnels/assets/screenshot-1.jpg?rev=3020350",
            "caption": "Create Your First Funnel"
        },
        {
            "src": "https://ps.w.org/wpfunnels/assets/screenshot-2.jpg?rev=3020350",
            "caption": "Import Preferred Funnel Template Or Start From Scratch"
        },
        {
            "src": "https://ps.w.org/wpfunnels/assets/screenshot-3.jpg?rev=3020350",
            "caption": "Add Your First Funnel step"
        },
        {
            "src": "https://ps.w.org/wpfunnels/assets/screenshot-4.jpg?rev=3020350",
            "caption": "Add Upsell Step"
        },
        {
            "src": "https://ps.w.org/wpfunnels/assets/screenshot-5.jpg?rev=3020350",
            "caption": "Add Conditional Actions"
        },
        {
            "src": "https://ps.w.org/wpfunnels/assets/screenshot-6.jpg?rev=3020350",
            "caption": "Set Up Conditional Statements &amp; Add Steps From The Same Tab"
        },
        {
            "src": "https://ps.w.org/wpfunnels/assets/screenshot-7.jpg?rev=3020350",
            "caption": "Create Your Funnel Journey"
        },
        {
            "src": "https://ps.w.org/wpfunnels/assets/screenshot-8.jpg?rev=3020350",
            "caption": "Run A/B Testing In A Clean UI"
        },
        {
            "src": "https://ps.w.org/wpfunnels/assets/screenshot-9.jpg?rev=3020350",
            "caption": "Add Order Bump Offers Easily"
        },
        {
            "src": "https://ps.w.org/wpfunnels/assets/screenshot-10.jpg?rev=3020350",
            "caption": "Add as many Funnel steps as you want for a complete user journey"
        },
        {
            "src": "https://ps.w.org/wpfunnels/assets/screenshot-11.jpg?rev=3020350",
            "caption": "All Your Funnels In One Place"
        }
    ],
    "tags": {
        "funnel-builder": "Funnel Builder",
        "lead-generation": "lead generation",
        "order-bump": "order bump",
        "sales-funnels": "sales funnels",
        "woocommerce": "woocommerce"
    },
    "stable_tag": "3.4.12",
    "versions": {
        "1.0.0": "https://downloads.wordpress.org/plugin/wpfunnels.1.0.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/wpfunnels.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/wpfunnels.1.0.2.zip",
        "2.0.0": "https://downloads.wordpress.org/plugin/wpfunnels.2.0.0.zip",
        "2.0.1": "https://downloads.wordpress.org/plugin/wpfunnels.2.0.1.zip",
        "2.0.2": "https://downloads.wordpress.org/plugin/wpfunnels.2.0.2.zip",
        "2.0.3": "https://downloads.wordpress.org/plugin/wpfunnels.2.0.3.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/wpfunnels.2.0.4.zip",
        "2.1.0": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.0.zip",
        "2.1.1": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.1.zip",
        "2.1.10": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.10.zip",
        "2.1.11": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.11.zip",
        "2.1.12": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.12.zip",
        "2.1.13": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.13.zip",
        "2.1.14": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.14.zip",
        "2.1.15": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.15.zip",
        "2.1.16": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.16.zip",
        "2.1.17": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.17.zip",
        "2.1.18": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.18.zip",
        "2.1.19": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.19.zip",
        "2.1.2": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.2.zip",
        "2.1.20": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.20.zip",
        "2.1.3": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.3.zip",
        "2.1.4": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.4.zip",
        "2.1.5": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.5.zip",
        "2.1.6": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.6.zip",
        "2.1.7": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.7.zip",
        "2.1.8": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.8.zip",
        "2.1.9": "https://downloads.wordpress.org/plugin/wpfunnels.2.1.9.zip",
        "2.2.0": "https://downloads.wordpress.org/plugin/wpfunnels.2.2.0.zip",
        "2.2.1": "https://downloads.wordpress.org/plugin/wpfunnels.2.2.1.zip",
        "2.2.2": "https://downloads.wordpress.org/plugin/wpfunnels.2.2.2.zip",
        "2.2.3": "https://downloads.wordpress.org/plugin/wpfunnels.2.2.3.zip",
        "2.2.4": "https://downloads.wordpress.org/plugin/wpfunnels.2.2.4.zip",
        "2.2.5": "https://downloads.wordpress.org/plugin/wpfunnels.2.2.5.zip",
        "2.2.6": "https://downloads.wordpress.org/plugin/wpfunnels.2.2.6.zip",
        "2.2.7": "https://downloads.wordpress.org/plugin/wpfunnels.2.2.7.zip",
        "2.3.0": "https://downloads.wordpress.org/plugin/wpfunnels.2.3.0.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/wpfunnels.2.3.1.zip",
        "2.3.2": "https://downloads.wordpress.org/plugin/wpfunnels.2.3.2.zip",
        "2.3.3": "https://downloads.wordpress.org/plugin/wpfunnels.2.3.3.zip",
        "2.3.4": "https://downloads.wordpress.org/plugin/wpfunnels.2.3.4.zip",
        "2.3.5": "https://downloads.wordpress.org/plugin/wpfunnels.2.3.5.zip",
        "2.3.6": "https://downloads.wordpress.org/plugin/wpfunnels.2.3.6.zip",
        "2.3.7": "https://downloads.wordpress.org/plugin/wpfunnels.2.3.7.zip",
        "2.3.8": "https://downloads.wordpress.org/plugin/wpfunnels.2.3.8.zip",
        "2.3.9": "https://downloads.wordpress.org/plugin/wpfunnels.2.3.9.zip",
        "2.4.0": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.0.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.1.zip",
        "2.4.10": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.10.zip",
        "2.4.11": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.11.zip",
        "2.4.12": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.12.zip",
        "2.4.13": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.13.zip",
        "2.4.14": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.14.zip",
        "2.4.15": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.15.zip",
        "2.4.16": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.16.zip",
        "2.4.17": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.17.zip",
        "2.4.18": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.18.zip",
        "2.4.19": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.19.zip",
        "2.4.2": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.2.zip",
        "2.4.20": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.20.zip",
        "2.4.21": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.21.zip",
        "2.4.22": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.22.zip",
        "2.4.3": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.3.zip",
        "2.4.4": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.4.zip",
        "2.4.5": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.5.zip",
        "2.4.6": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.6.zip",
        "2.4.7": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.7.zip",
        "2.4.8": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.8.zip",
        "2.4.9": "https://downloads.wordpress.org/plugin/wpfunnels.2.4.9.zip",
        "2.5.0": "https://downloads.wordpress.org/plugin/wpfunnels.2.5.0.zip",
        "2.5.1": "https://downloads.wordpress.org/plugin/wpfunnels.2.5.1.zip",
        "2.5.2": "https://downloads.wordpress.org/plugin/wpfunnels.2.5.2.zip",
        "2.5.3": "https://downloads.wordpress.org/plugin/wpfunnels.2.5.3.zip",
        "2.5.4": "https://downloads.wordpress.org/plugin/wpfunnels.2.5.4.zip",
        "2.5.5": "https://downloads.wordpress.org/plugin/wpfunnels.2.5.5.zip",
        "2.5.6": "https://downloads.wordpress.org/plugin/wpfunnels.2.5.6.zip",
        "2.5.7": "https://downloads.wordpress.org/plugin/wpfunnels.2.5.7.zip",
        "2.5.8": "https://downloads.wordpress.org/plugin/wpfunnels.2.5.8.zip",
        "2.6.0": "https://downloads.wordpress.org/plugin/wpfunnels.2.6.0.zip",
        "2.6.1": "https://downloads.wordpress.org/plugin/wpfunnels.2.6.1.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/wpfunnels.2.6.2.zip",
        "2.6.3": "https://downloads.wordpress.org/plugin/wpfunnels.2.6.3.zip",
        "2.6.4": "https://downloads.wordpress.org/plugin/wpfunnels.2.6.4.zip",
        "2.6.5": "https://downloads.wordpress.org/plugin/wpfunnels.2.6.5.zip",
        "2.6.6": "https://downloads.wordpress.org/plugin/wpfunnels.2.6.6.zip",
        "2.6.7": "https://downloads.wordpress.org/plugin/wpfunnels.2.6.7.zip",
        "2.6.8": "https://downloads.wordpress.org/plugin/wpfunnels.2.6.8.zip",
        "2.6.9": "https://downloads.wordpress.org/plugin/wpfunnels.2.6.9.zip",
        "2.7.0": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.0.zip",
        "2.7.1": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.1.zip",
        "2.7.10": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.10.zip",
        "2.7.11": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.11.zip",
        "2.7.12": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.12.zip",
        "2.7.13": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.13.zip",
        "2.7.14": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.14.zip",
        "2.7.15": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.15.zip",
        "2.7.16": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.16.zip",
        "2.7.17": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.17.zip",
        "2.7.18": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.18.zip",
        "2.7.19": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.19.zip",
        "2.7.2": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.2.zip",
        "2.7.3": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.3.zip",
        "2.7.4": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.4.zip",
        "2.7.5": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.5.zip",
        "2.7.6": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.6.zip",
        "2.7.7": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.7.zip",
        "2.7.8": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.8.zip",
        "2.7.9": "https://downloads.wordpress.org/plugin/wpfunnels.2.7.9.zip",
        "2.8.0": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.0.zip",
        "2.8.1": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.1.zip",
        "2.8.10": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.10.zip",
        "2.8.11": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.11.zip",
        "2.8.12": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.12.zip",
        "2.8.12-beta": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.12-beta.zip",
        "2.8.13": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.13.zip",
        "2.8.14": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.14.zip",
        "2.8.15": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.15.zip",
        "2.8.16": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.16.zip",
        "2.8.17": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.17.zip",
        "2.8.18": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.18.zip",
        "2.8.19": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.19.zip",
        "2.8.2": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.2.zip",
        "2.8.20": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.20.zip",
        "2.8.3": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.3.zip",
        "2.8.4": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.4.zip",
        "2.8.5": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.5.zip",
        "2.8.6": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.6.zip",
        "2.8.7": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.7.zip",
        "2.8.8": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.8.zip",
        "2.8.9": "https://downloads.wordpress.org/plugin/wpfunnels.2.8.9.zip",
        "3.0.0": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.0.zip",
        "3.0.0-beta.1": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.0-beta.1.zip",
        "3.0.0-beta.2": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.0-beta.2.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.1.zip",
        "3.0.10": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.10.zip",
        "3.0.11": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.11.zip",
        "3.0.12": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.12.zip",
        "3.0.13": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.13.zip",
        "3.0.14": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.14.zip",
        "3.0.2": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.2.zip",
        "3.0.3": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.3.zip",
        "3.0.4": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.4.zip",
        "3.0.5": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.5.zip",
        "3.0.6": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.6.zip",
        "3.0.7": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.7.zip",
        "3.0.8": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.8.zip",
        "3.0.9": "https://downloads.wordpress.org/plugin/wpfunnels.3.0.9.zip",
        "3.1.0": "https://downloads.wordpress.org/plugin/wpfunnels.3.1.0.zip",
        "3.1.1": "https://downloads.wordpress.org/plugin/wpfunnels.3.1.1.zip",
        "3.1.10": "https://downloads.wordpress.org/plugin/wpfunnels.3.1.10.zip",
        "3.1.2": "https://downloads.wordpress.org/plugin/wpfunnels.3.1.2.zip",
        "3.1.3": "https://downloads.wordpress.org/plugin/wpfunnels.3.1.3.zip",
        "3.1.4": "https://downloads.wordpress.org/plugin/wpfunnels.3.1.4.zip",
        "3.1.5": "https://downloads.wordpress.org/plugin/wpfunnels.3.1.5.zip",
        "3.1.6": "https://downloads.wordpress.org/plugin/wpfunnels.3.1.6.zip",
        "3.1.7": "https://downloads.wordpress.org/plugin/wpfunnels.3.1.7.zip",
        "3.1.8": "https://downloads.wordpress.org/plugin/wpfunnels.3.1.8.zip",
        "3.1.9": "https://downloads.wordpress.org/plugin/wpfunnels.3.1.9.zip",
        "3.2.0": "https://downloads.wordpress.org/plugin/wpfunnels.3.2.0.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/wpfunnels.3.2.1.zip",
        "3.2.2": "https://downloads.wordpress.org/plugin/wpfunnels.3.2.2.zip",
        "3.2.3": "https://downloads.wordpress.org/plugin/wpfunnels.3.2.3.zip",
        "3.3.0": "https://downloads.wordpress.org/plugin/wpfunnels.3.3.0.zip",
        "3.3.1": "https://downloads.wordpress.org/plugin/wpfunnels.3.3.1.zip",
        "3.4.0": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.0.zip",
        "3.4.1": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.1.zip",
        "3.4.10": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.10.zip",
        "3.4.11": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.11.zip",
        "3.4.12": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.12.zip",
        "3.4.2": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.2.zip",
        "3.4.3": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.3.zip",
        "3.4.4": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.4.zip",
        "3.4.5": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.5.zip",
        "3.4.6": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.6.zip",
        "3.4.7": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.7.zip",
        "3.4.8": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.8.zip",
        "3.4.9": "https://downloads.wordpress.org/plugin/wpfunnels.3.4.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wpfunnels.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "https://getwpfunnels.com/",
    "banners": {
        "low": "https://ps.w.org/wpfunnels/assets/banner-772X250.png?rev=3027333",
        "high": "https://ps.w.org/wpfunnels/assets/banner-1544X500.png?rev=3027333"
    },
    "icons": {
        "1x": "https://ps.w.org/wpfunnels/assets/icon-128x128.gif?rev=2987573",
        "2x": "https://ps.w.org/wpfunnels/assets/icon-256x256.gif?rev=2987573"
    },
    "blocks": {
        "wpfunnels/next-step-button": {
            "name": "wpfunnels/next-step-button",
            "title": "WPFunnels Next Step"
        },
        "wpfunnels/checkout-form": {
            "name": "wpfunnels/checkout-form",
            "title": "WPFunnels Checkout"
        },
        "wpfunnels/optin-form": {
            "name": "wpfunnels/optin-form",
            "title": "WPFunnels Optin Form"
        },
        "wpfunnels/lms-checkout": {
            "name": "wpfunnels/lms-checkout",
            "title": "WPFunnels LMS Checkout"
        },
        "wpfunnels/lms-order-details": {
            "name": "wpfunnels/lms-order-details",
            "title": "WPFunnels LMS Order Details"
        },
        "wpfunnels/order-details": {
            "name": "wpfunnels/order-details",
            "title": "WPFunnels Order Details"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 98,
    "blueprints": [
        {
            "filename": "blueprint.json",
            "url": "https://wordpress.org/plugins/wp-json/plugins/v1/plugin/wpfunnels/blueprint.json?rev=3138785"
        }
    ],
    "preview_link": "https://wordpress.org/plugins/wpfunnels/?preview=1",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "wpfunnels",
            "language": "pt_BR",
            "version": "3.4.12",
            "updated": "2024-08-26 04:28:42",
            "package": "http://downloads.wordpress.org/translation/plugin/wpfunnels/3.4.12/pt_BR.zip"
        },
        {
            "type": "plugin",
            "slug": "wpfunnels",
            "language": "ru_RU",
            "version": "3.4.12",
            "updated": "2023-10-01 11:51:43",
            "package": "http://downloads.wordpress.org/translation/plugin/wpfunnels/3.4.12/ru_RU.zip"
        }
    ]
}