{
    "name": "WPO365 | MICROSOFT 365 GRAPH MAILER",
    "slug": "wpo365-msgraphmailer",
    "version": "2.36",
    "author": "<a href=\"https://www.wpo365.com\">marco@wpo365.com</a>",
    "author_profile": "https://profiles.wordpress.org/wpo365/",
    "contributors": {
        "wpo365": {
            "profile": "https://profiles.wordpress.org/wpo365/",
            "avatar": "https://secure.gravatar.com/avatar/6e8dec28391f0fac8ce6726e112256fc?s=96&d=monsterid&r=g",
            "display_name": "Marco van Wieren"
        }
    },
    "requires": "5.0",
    "tested": "6.6.2",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 98,
    "ratings": {
        "5": 18,
        "4": 0,
        "3": 1,
        "2": 0,
        "1": 0
    },
    "num_ratings": 19,
    "support_url": "https://wordpress.org/support/plugin/wpo365-msgraphmailer/",
    "support_threads": 3,
    "support_threads_resolved": 3,
    "active_installs": 7000,
    "last_updated": "2024-09-26 13:12:00",
    "added": "2022-02-04",
    "homepage": "https://wordpress.org/plugins/wpo365-msgraphmailer",
    "sections": {
        "description": "<p><strong>WPO365 | MS GRAPH MAILER</strong> provides you with a modern, reliable and efficient way to send WordPress transactional emails from one of your Microsoft 365 / Exchange Online / Mail enabled accounts.</p>\n<p>The plugin re-configures your WordPress website to send emails using the <strong>Microsoft Graph API</strong> instead of &#8211; for example &#8211; SMTP. Sending WordPress emails using the <strong>Microsoft Graph API</strong> has become the only available alternative after Microsoft has disabled basic authentication (username and password) over the SMTP protocol.</p>\n<h4>DELIVERY</h4>\n<ul>\n<li>Send WordPress transactional emails from one of your <strong>Microsoft 365 Exchange Online / Mail enabled accounts</strong> using Microsoft Graph instead of &#8211; for example &#8211; SMTP.</li>\n<li>Choose between delegated (send mail as a user) and application-level (send mail as any user) type permissions.</li>\n</ul>\n<h4>SEND AS HTML</h4>\n<ul>\n<li>Send emails formatted as <strong>HTML</strong>.</li>\n</ul>\n<h4>SAVE TO SENT ITEMS</h4>\n<ul>\n<li>Emails sent will be saved in the account&#8217;s mailbox in the <strong>Sent Items</strong> folder, further helping to track (successful) mail delivery.</li>\n</ul>\n<h4>ATTACHMENTS</h4>\n<ul>\n<li>Send files from your WordPress website as <em>attachments</em>. </li>\n</ul>\n<h4>CONFIGURATION / TEST EMAIL DELIVERY</h4>\n<ul>\n<li>Easy configuration with detailed step-by-step <a href=\"https://docs.wpo365.com/article/141-send-email-using-microsoft-graph-mailer\" rel=\"nofollow ugc\">Getting started</a> guide and video.</li>\n<li>Send <em>test email</em> to recipients incl. CC, BCC and attachment.</li>\n</ul>\n<p><iframe loading=\"lazy\" title=\"WPO365 | Configure WordPress to send emails using Microsoft Graph\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/1CK7Fl8f8iA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></p>\n<p><strong>ADD FUNCTIONALITY WITH PREMIUM EXTENSIONS</strong></p>\n<p>The following features can be unlocked with the <a href=\"https://www.wpo365.com/downloads/wpo365-mail/\" rel=\"nofollow ugc\">WPO365 | MAIL</a> extension.</p>\n<h4>Auto-Retry</h4>\n<ul>\n<li><strong>Log every email</strong> sent from your WordPress website, review errors and (automatically) try to send unsuccessfully <strong>sent mails again</strong>.</li>\n</ul>\n<h4>LARGE ATTACHMENTS</h4>\n<ul>\n<li>Add support to send WordPress emails with <strong>attachments larger than 3 MB</strong> using Microsoft Graph.</li>\n</ul>\n<h4>SEND AS / SEND ON BEHALF OF</h4>\n<ul>\n<li>Send email <strong>as / on behalf of</strong> another user or distribution list.</li>\n</ul>\n<h4>SHARED MAILBOX</h4>\n<ul>\n<li>Send email from <strong>Microsoft 365 Shared Mailbox</strong>.</li>\n</ul>\n<h4>STAGING MODE</h4>\n<ul>\n<li><strong>Mail Staging Mode</strong> is useful for debugging and staging environments. WordPress emails will be logged and saved in the database instead of being sent.</li>\n</ul>\n<h4>DYNAMIC SEND-FROM</h4>\n<ul>\n<li>Allow forms to <strong>override &#8220;From&#8221;</strong> address e.g allow Contact Form 7 to dynamically configure the account used to send the email from (requires application-level Mail.Send permissions).</li>\n</ul>\n<h4>MAIL THROTTLE</h4>\n<ul>\n<li><strong>Throttle</strong> the number of emails sent from your website per minute.</li>\n</ul>\n<h4>WP-CONFIG FOR AAD SECRETS</h4>\n<ul>\n<li>Further improve overall security by choosing to store Azure Active Directory secrets in your WordPress WP-Config.php (on disk) and have those secrets removed from the database.</li>\n</ul>\n<h4>SEND AS BCC</h4>\n<ul>\n<li>Send emails <strong>as BCC</strong> instead and prevent reply-to-all mail pollution.</li>\n</ul>\n<h4>REPLY-TO</h4>\n<ul>\n<li>Configure a <strong>default reply-to</strong> mail address if this should differ from the account&#8217;s mail address that is used to send WordPress transactional emails from.</li>\n</ul>\n<h3>Prerequisites</h3>\n<ul>\n<li>We have tested our plugin with WordPress &gt;= 5.0 and PHP &gt;= 5.6.40.</li>\n<li>You need to be an Entra ID Tenant Administrator to configure both Azure Active Directory and the plugin.</li>\n</ul>\n<h3>Support</h3>\n<p>We will go to great length trying to support you if the plugin doesn&#8217;t work as expected. Go to our <a href=\"https://www.wpo365.com/how-to-get-support/\" rel=\"nofollow ugc\">Support Page</a> to get in touch with us. We haven&#8217;t been able to test our plugin in all endless possible WordPress configurations and versions so we are keen to hear from you and happy to learn!</p>\n<h3>Feedback</h3>\n<p>We are keen to hear from you so share your feedback with us on <a href=\"https://www.linkedin.com/company/downloads-by-van-wieren\" rel=\"nofollow ugc\">LinkedIn</a> and help us get better!</p>\n<h3>Open Source</h3>\n<p>When you&#8217;re a developer and interested in the code you should have a look at our repo over at <a href=\"https://plugins.svn.wordpress.org/wpo365-msgraphmailer/\" rel=\"nofollow ugc\">WordPress</a>.</p>\n",
        "installation": "<p>Please refer to <a href=\"https://docs.wpo365.com/article/141-send-email-using-microsoft-graph-mailer\" rel=\"nofollow ugc\">these <strong>Getting started</strong> articles</a> for detailed installation and configuration instructions.</p>\n",
        "changelog": "<h4>v2.35</h4>\n<ul>\n<li>Fix: Non-specific technical improvements.</li>\n</ul>\n<h4>v2.34</h4>\n<ul>\n<li>Improvement: The HelpScout beacon on the plugin&#8217;s configuration pages would be blocked from loading &#8211; for example when using Microsoft Edge &#8211; and has therefore been replaced with a new help button that opens the WPO365 Contact Form instead.</li>\n<li>Fix: The default value for the redirect URL now again corresponds to the site&#8217;s home URL.</li>\n<li>Fix: Some WP Cron Jobs that rely on a custom cron schedule &#8220;wpo-every-minute&#8221; e.g. Auto-Retry for sending emails and User Sync Monitor to ensure user synchronization keeps running, should no longer be removed when the custom schedule is not found. [PREMIUM]</li>\n<li>Fix: Mail Log Viewer will show no results if a filter e.g. Errors returns no results. [PREMIUM]</li>\n</ul>\n<h4>v2.33</h4>\n<ul>\n<li>Support for new <a href=\"https://www.wpo365.com/news/its-not-just-a-change-its-a-leap-forward\" rel=\"nofollow ugc\">WPO365 feature bundles</a>.</li>\n</ul>\n<h4>v2.32</h4>\n<ul>\n<li>Improvement: The Mail Audit Log Viewer has been updated to show nr. of attempts and time of last attempt for a better general understanding of the send-status of the email in question. [PREMIUM]</li>\n<li>Improvement: The Debug Log entries now display timestamps in the WordPress timezone (see WP Admin &gt; Settings &gt; General &gt; Timezone).</li>\n<li>Improvement: The Mail Audit Log entries now display timestamps in the WordPress timezone (see WP Admin &gt; Settings &gt; General &gt; Timezone). [PREMIUM]</li>\n<li>Improvement: The WPO365 Insights entries now display timestamps in the WordPress timezone (see WP Admin &gt; Settings &gt; General &gt; Timezone).</li>\n<li>Improvement: A small icon on the plugin&#8217;s Mail configuration page will show the status of the &#8220;Resending failed emails automatically&#8221; feature. [PREMIUM]</li>\n<li>Improvement: The Microsoft Graph Mailer for WordPress will not be instantiated if no authorization information can be found.</li>\n<li>Improvement: The Mail Authorization Status Popup will now appear only after 4 seconds and will no longer show if authorization is under way.</li>\n<li>Fix: WordPress no longer shows that an update for a premium addon or bundle is available when the latest version is already installed. [PREMIUM]</li>\n<li>Fix: The recently added Mail Audit Log Retention Policy (to clean up entries older than 90 days) no longer fails if an older version of WPO365 | MICROSOFT GRAPH MAILER or WPO365 | LOGIN would be installed in combination with the latest version of the WPO365 | MAIL addon. [PREMIUM]</li>\n<li>Fix: The WPO365 configuration pages will now show the correct values for Entra ID / AAD related options retrieved from wp-config.php (instead of from the database). [PREMIUM]</li>\n<li>Fix: The Mail Audit Log will now create a new table at the correct &#8220;level&#8221; in case WordPress Multisite would be activated and WPO365&#8217;s default support mode for WPMU (= Shared) is configured. [PREMIUM]</li>\n<li>Fix: The Redirect URI for the WPO365 Microsoft Graph Mailer no longer indicates an error for the Redirect URI migrated from &#8220;Mail Integration for Office 365 / Outlook&#8221; plugin.</li>\n</ul>\n<h4>v2.31</h4>\n<ul>\n<li>Breaking Change (Microsoft Graph Mailer): WPO365 <a href=\"https://docs.wpo365.com/article/217-mail-log-retention\" rel=\"nofollow ugc\">retains <strong>mail log</strong> entries</a> that are less than approximately 90 days old and deletes entries that exceed the configured number of days. [PREMIUM]</li>\n<li>Improvement: In an attempt to better understand errors that involve <em>cURL</em>, administrators can now enable <a href=\"https://docs.wpo365.com/article/214-enable-curl-verbose\" rel=\"nofollow ugc\">verbose logging for cURL</a>. [ALL]</li>\n<li>Fix: The premium WPO365 | MAIL option to resend failed emails automatically can now be started when the premium addon is used in combination with WPO365 | MICROSOFT GRAPH MAILER. [MICROSOFT GRAPH MAILER]</li>\n</ul>\n<h4>v2.30</h4>\n<ul>\n<li>Fix: By fixing a caching issue, WPO365 should &#8211; after this update &#8211; no longer show a notification that &#8220;There is a new version of [&#8230;] available [&#8230;]&#8221; for WPO365 premium addons and bundles, after those were updated to the lastest version. [ALL PREMIUM ADDONS / BUNDLES]</li>\n</ul>\n<h4>v2.29</h4>\n<ul>\n<li>Fix: &#8220;Strict Mode&#8221; for the Redirect URI can now also be enabled for the WPO365 | MICROSOFT GRAPH MAILER plugin (so it will only try process an Oauth response / payload detected at the exact URL which must be a path below the site&#8217;s home address e.g. /oidc-auth/).</li>\n<li>Fix: The plugin will not try and process an Oauth response / payload if both features SSO and MICROSOFT GRAPH MAILER are disabled or if SSO is disabled but MICROSOFT GRAPH MAILER is enabled and but the administrator did not start an attempt to authorize an account to send emails from.</li>\n<li>Fix: WPO365 Health Messages are now correctly displayed on the corresponding panel for the MICROSOFT GRAPH MAILER plugin.</li>\n</ul>\n<h4>v2.28</h4>\n<ul>\n<li>Breaking Change: To support devOps workflows and site replication scenarios, WPO365 now automatically detects named constants in your website&#8217;s wp-config.php file that either configure an <a href=\"https://tutorials.wpo365.com/courses/wp-config-php-single-identity-provider-idp/\" rel=\"nofollow ugc\">single Identity Provider (IdP)</a> or any of the <a href=\"https://tutorials.wpo365.com/courses/wp-config-php-configuration-w-o-idps/\" rel=\"nofollow ugc\">WPO365 settings</a> that are not directly related to an IdP. As a result, the option <strong>Use WP-Config.php for AAD secrets</strong> has been renamed to <a href=\"https://docs.wpo365.com/article/137-use-wp-config-for-aad-secrets\" rel=\"nofollow ugc\">Obfuscate AAD options</a>. [ANY PREMIUM ADDON / BUNDLE]</li>\n<li>Feature (preview): Now administrators can enable <strong>WPO365 Insights</strong> and aggregate various events into straightforward management dashboards. These dashboards are designed to offer valuable insights, such as tracking the count of users who have authenticated successfully or unsuccessfully, monitoring emails that have been sent successfully or unsuccessfully, and overseeing the synchronization status of users, whether through SCIM, WPO365 User synchronization, or during their initial sign-in. See the new <a href=\"https://www.wpo365.com/feature/wpo365-insights/\" rel=\"nofollow ugc\">online guide</a> for further details. [MICROSOFT GRAPH MAILER, ANY PREMIUM ADDON / BUNDLE]</li>\n<li>Improvement: <strong>WPO365 Health Messages</strong> will no longer be displayed on a default WordPress notification banner, but instead a dismissable panel will slide over the configuration app. [MICROSOFT GRAPH MAILER]</li>\n<li>Improvement: When deleting a WPO365 configuration, several caches e.g. for access tokens and certificates, are cleaned as well. [MICROSOFT GRAPH MAILER]</li>\n</ul>\n<h4>v2.27</h4>\n<ul>\n<li>Fix: The plugin attempted to process any POST request with parameter &#8220;error&#8221;, mistakenly assuming that it would be an authentication-error sent by Microsoft. [LOGIN, MICROSOFT GRAPH MAILER]</li>\n</ul>\n<h4>v2.26</h4>\n<ul>\n<li>Fix: Updated parts of the PHP Security Library v3 to improve compatibility with older PHP versions.</li>\n</ul>\n<h4>v2.25</h4>\n<ul>\n<li>Fix: Fixed &#8220;Fatal error: Cannot use ::class with dynamic class name&#8221; for 2 files in PHP Security Library v3.</li>\n</ul>\n<h4>v2.24</h4>\n<ul>\n<li>Improvement: The default response mode &#8211; for new installations &#8211; when requesting an (OIDC) authorization code has been updated to &#8220;query&#8221;. This will help preserve the code, especially if the administrator has configured a 3rd party multi-factor authentication provider such as Duo. Existing installations are not affected, however, and the response mode remains &#8220;form_post&#8221;. See the <a href=\"https://docs.wpo365.com/article/208-select-oidc-response-mode\" rel=\"nofollow ugc\">updated documentation</a> for details.</li>\n<li>Improvement: Admins configuring the Microsoft Graph Mailer portion of WPO365 can now select an option to skip all checks. Checking this option instructs the Microsoft Graph Mailer to skip the check whether the default &#8220;from&#8221; email address is registered for the corresponding account and whether the &#8220;from&#8221; email address specified by a plugin has a different email-domain compared to the default &#8220;from&#8221; email address used to submit email message to Microsoft Graph.</li>\n<li>Fix: The PHP Secure Communications library has been updated and the plugin now uses version 3.0 (to verify an ID token&#8217;s signature). [LOGIN, MICROSOFT GRAPH MAILER]</li>\n</ul>\n<h4>v2.23</h4>\n<ul>\n<li>Breaking Change: Sending WordPress email using Microsoft Graph now always will use the Azure AD configuration from the plugin&#8217;s Mail configuration page. [LOGIN]</li>\n<li>Tested up to 6.4. [ALL]</li>\n</ul>\n<h4>v2.21</h4>\n<ul>\n<li>Feature: WPO365 can now send a daily notification to the administation email address if one of the application / client secrets is about to expire in the next 30 days. Consult <a href=\"https://www.wpo365.com/article/client-secret-expiration-notification/\" rel=\"nofollow ugc\">this article</a> for details. [LOGIN, MICROSOFT GRAPH MAILER]</li>\n<li>Fix: The plugin&#8217;s updater will now display a notification when a newer version of a premium addon is available.</li>\n</ul>\n<h4>v2.20</h4>\n<ul>\n<li>Feature: <strong>(Auto-) Retry sending failed emails</strong> using Microsoft Graph. See the <a href=\"https://docs.wpo365.com/article/183-resending-failed-emails-automatically\" rel=\"nofollow ugc\">online documentation</a> for details. [MAIL]</li>\n<li>Feature: <strong>Throttle nr. of emails send per minute</strong> using Microsoft Graph. See the <a href=\"https://docs.wpo365.com/article/182-throttle-the-number-of-emails-sent-per-minute\" rel=\"nofollow ugc\">online documentation</a> for details. [MAIL]</li>\n<li>Improvement: The WPO365 | MAIL premium addon now also unlocks the option to use WP-Config.php to override (some) config options. Now administrators can &#8211; for example on their staging environment &#8211; enable mail-staging mode, simply by adding a global constant to the WP-Config.php file. See the <a href=\"https://docs.wpo365.com/article/171-mail-staging-mode\" rel=\"nofollow ugc\">updated documentation</a>. [MAIL]</li>\n<li>Fix: Tested with PHP 8.2. [ALL]</li>\n</ul>\n<h4>v2.19</h4>\n<ul>\n<li>Fix: The plugin update checker did not always return the expected result. [LOGIN, MS GRAPH MAILER]</li>\n</ul>\n<h4>v2.18</h4>\n<ul>\n<li>Fix: Various modifications to <strong>Microsoft Graph Mailer</strong> configurator should make it easier and more intuitive to configure it.</li>\n<li>Fix: In an attempt to prevent the error &#8220;cURL error 28: Operation timed out after 15001 milliseconds with 0 bytes received&#8221; when integrating with Microsoft Graph, the use of the Expect: header has been disabled by default.</li>\n<li>Fix: [PREMIUM] The Log Viewer &#8211; to view and optionally resend emails sent using the Microsoft Graph Mailer &#8211; now calculates the last inserted logged item ID using MAX() instead of looking up the AUTO INCREMENT value, which may not be up-to-date.</li>\n<li>Fix: [PREMIUM] If the license key can not be verified, it will not be deleted. The corresponding error is logged as an error.</li>\n</ul>\n<h4>v2.17</h4>\n<ul>\n<li>Fix: The built-in Microsoft Graph Mailer for WordPress will now exclude any custom headers that do not start with x- or X-, to prevent Microsoft Graph from not sending the message and reporting the following error instead: &#8220;The internet message header name [&#8230;] should start with &#8216;x-&#8216; or &#8216;X-&#8216;.&#8221;. [LOGIN, MICROSOFT GRAPH MAILER]</li>\n</ul>\n<h4>v2.16</h4>\n<ul>\n<li>Improvement: The WPO365 | MICROSOFT GRAPH MAILER plugin can now also log remotely to ApplicationInsights, allowing administrators to configure <strong>Azure&#8217;s Monitoring / Alerts</strong> feature e.g. to send an SMS whenever an exception is logged. </li>\n<li>Fix: The Microsoft Graph Mailer for WordPress no longer &#8220;unauthorizes&#8221; itself, after it fails to retrieve an access token. Instead, WPO365 Health Messages are created and administrators should regularly check for errors.</li>\n<li>Fix: Refactored the flow when sending emails from a different account than the one submitting the request to send an email to Microsoft Graph (= the default &#8220;From&#8221; account) to improve consistency, even when the alternative sending-from account is a Shared Mailbox, a Distribution List or Group or normal User Mailbox. [PREMIUM]</li>\n</ul>\n<h4>v2.15</h4>\n<ul>\n<li>Feature: Administrators can now enable <strong>Mail Staging Mode</strong>. If enabled, the WPO365 plugin will not send emails using Microsoft Graph anymore but instead will write them to the central <em>Mail Log</em>. This makes especially sense for a staging environment. [PREMIUM]</li>\n<li>Improvement: The WPO365 plugin will now handle forms (e.g. Contact Form 7) that propose to send emails from a different account than the &#8220;default from&#8221; mail account, after it handles any other option (e.g Shared Mailbox or Send as / Send on behalf of). The proposed &#8220;alternative from&#8221; therefore always prevail. It can also be any type of mailbox e.g. User Mailbox, Shared Mailbox or Distributionlist. But it&#8217;s up to the adminstrator to ensure that the &#8220;default from&#8221; mail account is a either a member (e.g. of the Shared Mailbox) or has sufficient permissions to send emails as / on behalf of an alternative account (e.g. the Distributionlist). [PREMIUM]</li>\n<li>Fix: The initial OpenID Connect authorization request will now always include https://graph.microsoft.com/User.Read.</li>\n<li>Fix: A public property $ErrorInfo has been added to the PHPMailer object to support integration with Gravity Forms.</li>\n<li>Fix: The plugin now better understands &#8211; in the context of WordPress Multisite installations &#8211; whether the configuration must be retrieved / stored at site or at network level.</li>\n</ul>\n<h4>v2.14</h4>\n<ul>\n<li>Fix: ID Token validation now also validates audiences that are defined using an Application ID URI instead of the Application ID (e.g. this is the case for Microsoft Teams). [LOGIN, MICROSOFT GRAPH MAILER]</li>\n<li>Fix: The plugin does no longer rely on the HTTP_HOST key of the global $_SERVER variable, which &#8211; if not initialized &#8211; may cause a critical error on the website. [LOGIN, MICROSOFT GRAPH MAILER]</li>\n<li>Fix: The link to launch the Mail Log Viewer would return &#8220;false&#8221; for FireFox users. [MAIL]</li>\n</ul>\n<h4>v2.13</h4>\n<ul>\n<li>Improvement: The Microsoft Graph Mailer for WordPress will notify the administrator in the form of a WPO365 Health Message when another plugin with mail-sending capabilities is detected.</li>\n<li>Fix: An alternative system for nonces has been introduced to work around the fact that some browsers would not send the WordPress auth cookie along with HTTP 302 redirect requests, causing WordPress nonce verification to fail unexpectedly, in which case the plugin would then log the warning &#8220;Could not successfully validate oidc nonce with value xyz&#8221;.</li>\n</ul>\n<h4>v2.12</h4>\n<ul>\n<li>Fix: The recently added <em>ID token verification</em> did not take the mail-authorization flow into account.</li>\n<li>Improvement: Administrators can now re-configure the WPO365 | LOGIN plugin to skip the <em>ID token verification</em> altogether, on the plugin&#8217;s <em>Miscellaneous</em> configuration page (but this is not recommended for production environments).</li>\n</ul>\n<h4>v2.11</h4>\n<ul>\n<li>Fix: Various issues with the builtin license and update checker for premium extensions and bundles.</li>\n</ul>\n<h4>v2.10</h4>\n<ul>\n<li>Fix: License check for WPO365 | MAIL extension would show &#8220;unknown error occurred&#8221; for valid licenses.</li>\n<li>Fix: Update check for WPO365 | MAIL extension now better aligned with the recently updated license management service.</li>\n</ul>\n<h4>v2.9</h4>\n<ul>\n<li>Fix: The <em>Allow forms to override &#8220;From&#8221; address</em> was only enabled for application-level <em>Mail.Send</em> permissions.</li>\n<li>Fix: Overriding the &#8220;From&#8221; address was sometimes ignored.</li>\n<li>Fix: Sending from a Shared Mailbox was sometimes ignored.</li>\n</ul>\n<h4>v2.8</h4>\n<h4>v2.7</h4>\n<ul>\n<li>Fix: The mail authorization may falsely indicate that the plugin is not authorized to send emails using Microsoft Graph due to how the plugin compared permissions.</li>\n</ul>\n<h4>v2.6</h4>\n<ul>\n<li>Feature: Websites that are using the [Mail Integration for Office 365/Outlook](https://wordpress.org/plugins/mail-integration-365/] are now urged to switch to <a href=\"https://wordpress.org/plugins/wpo365-msgraphmailer/\" rel=\"ugc\">WPO365 | MICROSOFT GRAPH MAILER</a> or configure the builtin Microsoft Graph mail function of the WPO365 | LOGIN plugin. Consult the <a href=\"https://docs.wpo365.com/article/165-migrate-from-mail-integration-for-office-365-outlook-to-wpo365-microsoft-graph-mailer\" rel=\"nofollow ugc\">online migration guide</a> for further details. [ALL]</li>\n</ul>\n<h4>v2.5</h4>\n<ul>\n<li>Feature: The (premium version of the) Microsoft Graph Mailer can now send attachments larger than 3 MB.</li>\n<li>Feature: The (premium version of the) Microsoft Graph Mailer can now send emails from a Shared Mailbox.</li>\n<li>Improvement: Some parts of the source code have been updated to improve compatibility with PHP 8.1.</li>\n</ul>\n<h4>v2.4</h4>\n<ul>\n<li>Fix: Mail authorization would fail with the error &#8220;Could not retrieve a tenant and application specific JSON Web Key Set and thus the JWT token cannot be verified successfully&#8221;.</li>\n</ul>\n<h4>v2.3</h4>\n<ul>\n<li>Fix: The delegated mail authorization feature would &#8211; under circumstances &#8211; fail to get the mail specific tenant ID and as a result an attempt to refresh the access token may fail.</li>\n</ul>\n<h4>v2.2</h4>\n<ul>\n<li>Fix: The Redirect URL field for the mail authorization is no longer greyed out and can be changed by administrators. [LOGIN]</li>\n</ul>\n<h4>2.1</h4>\n<ul>\n<li>Fix: Added missing files.</li>\n</ul>\n<h4>2.0</h4>\n<ul>\n<li>Change: Sending WordPress emails using Microsoft Graph can now also be configured with <strong>delegated</strong> permissions. Administrators are urged to review the <a href=\"https://docs.wpo365.com/article/141-send-email-using-microsoft-graph-mailer\" rel=\"nofollow ugc\">documentation</a> and to update their configuration. [LOGIN, MICROSOFT GRAPH MAILER]</li>\n<li>Feature: Azure Active Directory secrets can now be stored in the website&#8217;s <strong>WP-Config.php</strong> and removed from the database. [MAIL]</li>\n</ul>\n<h4>1.8</h4>\n<ul>\n<li>Fix: If the plugin is configured to send WordPress emails using Microsoft Graph then it will now always replace the &#8220;from&#8221; email address if WordPress tries to sent emails from &#8220;wordpress@[sitename]&#8221;. WordPress will propose this email address is no email is set by the plugin sending the email (e.g. Contact Form 7). This email may pass checks as a valid email address but in reality this email address most likely does not exist. The option to fix the &#8220;localhost&#8221; issue has been removed since this fix improves the behavior for all hosts (incl. localhost). [ALL]</li>\n</ul>\n<h4>1.7</h4>\n<ul>\n<li>Improvement: When specified in &#8211; for example &#8211; an email form the &#8220;From&#8221; address will be used to send the email from (instead of the configured &#8220;From&#8221; address and if the address specified in the form appears to be valid). This behavior is a premium feature and not enabled by default.</li>\n</ul>\n<h4>1.6</h4>\n<ul>\n<li>Change: Sending mail as HTML is no longer a premium feature.</li>\n<li>Change: Saving a sent mail in the Sent Items folder is no longer a premium feature.</li>\n<li>Improvement: The Graph Mailer components have been refactored for improved logging / auditing.</li>\n<li>Fix: Sending a test email with attachment is now supported by all versions.</li>\n<li>Fix: The plugin will not try and send attachments larger than 3 Mb (the prevent the mail being refused by the Microsoft Graph API).</li>\n</ul>\n<h4>1.5</h4>\n<ul>\n<li>Fix: Several issues related to PHP 8.x have been fixed.</li>\n</ul>\n<h4>1.4</h4>\n<ul>\n<li>Updated README.txt</li>\n</ul>\n<h4>1.3</h4>\n<ul>\n<li>Improvement: The plugin will now honor a reply-to email address defined &#8220;externally&#8221; e.g. when using Contact Form 7.</li>\n<li>Fix: Activating the plugin would case a critical error due to a class-loading error.</li>\n</ul>\n<h4>1.2</h4>\n<ul>\n<li>Fix: Compatibility update.</li>\n</ul>\n<h4>1.1</h4>\n<ul>\n<li>Fix: Some minor code issues were fixed after review.</li>\n</ul>\n<h4>1.0</h4>\n<ul>\n<li>Initial version.</li>\n</ul>\n"
    },
    "short_description": "Send WordPress emails from a M365 / Exchange Online Mailbox using Microsoft Graph, leveraging OAuth for authentication which is more secure than SMTP",
    "description": "<p><strong>WPO365 | MS GRAPH MAILER</strong> provides you with a modern, reliable and efficient way to send WordPress transactional emails from one of your Microsoft 365 / Exchange Online / Mail enabled accounts.</p>\n<p>The plugin re-configures your WordPress website to send emails using the <strong>Microsoft Graph API</strong> instead of &#8211; for example &#8211; SMTP. Sending WordPress emails using the <strong>Microsoft Graph API</strong> has become the only available alternative after Microsoft has disabled basic authentication (username and password) over the SMTP protocol.</p>\n<h4>DELIVERY</h4>\n<ul>\n<li>Send WordPress transactional emails from one of your <strong>Microsoft 365 Exchange Online / Mail enabled accounts</strong> using Microsoft Graph instead of &#8211; for example &#8211; SMTP.</li>\n<li>Choose between delegated (send mail as a user) and application-level (send mail as any user) type permissions.</li>\n</ul>\n<h4>SEND AS HTML</h4>\n<ul>\n<li>Send emails formatted as <strong>HTML</strong>.</li>\n</ul>\n<h4>SAVE TO SENT ITEMS</h4>\n<ul>\n<li>Emails sent will be saved in the account&#8217;s mailbox in the <strong>Sent Items</strong> folder, further helping to track (successful) mail delivery.</li>\n</ul>\n<h4>ATTACHMENTS</h4>\n<ul>\n<li>Send files from your WordPress website as <em>attachments</em>. </li>\n</ul>\n<h4>CONFIGURATION / TEST EMAIL DELIVERY</h4>\n<ul>\n<li>Easy configuration with detailed step-by-step <a href=\"https://docs.wpo365.com/article/141-send-email-using-microsoft-graph-mailer\" rel=\"nofollow ugc\">Getting started</a> guide and video.</li>\n<li>Send <em>test email</em> to recipients incl. CC, BCC and attachment.</li>\n</ul>\n<p><iframe loading=\"lazy\" title=\"WPO365 | Configure WordPress to send emails using Microsoft Graph\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/1CK7Fl8f8iA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></p>\n<p><strong>ADD FUNCTIONALITY WITH PREMIUM EXTENSIONS</strong></p>\n<p>The following features can be unlocked with the <a href=\"https://www.wpo365.com/downloads/wpo365-mail/\" rel=\"nofollow ugc\">WPO365 | MAIL</a> extension.</p>\n<h4>Auto-Retry</h4>\n<ul>\n<li><strong>Log every email</strong> sent from your WordPress website, review errors and (automatically) try to send unsuccessfully <strong>sent mails again</strong>.</li>\n</ul>\n<h4>LARGE ATTACHMENTS</h4>\n<ul>\n<li>Add support to send WordPress emails with <strong>attachments larger than 3 MB</strong> using Microsoft Graph.</li>\n</ul>\n<h4>SEND AS / SEND ON BEHALF OF</h4>\n<ul>\n<li>Send email <strong>as / on behalf of</strong> another user or distribution list.</li>\n</ul>\n<h4>SHARED MAILBOX</h4>\n<ul>\n<li>Send email from <strong>Microsoft 365 Shared Mailbox</strong>.</li>\n</ul>\n<h4>STAGING MODE</h4>\n<ul>\n<li><strong>Mail Staging Mode</strong> is useful for debugging and staging environments. WordPress emails will be logged and saved in the database instead of being sent.</li>\n</ul>\n<h4>DYNAMIC SEND-FROM</h4>\n<ul>\n<li>Allow forms to <strong>override &#8220;From&#8221;</strong> address e.g allow Contact Form 7 to dynamically configure the account used to send the email from (requires application-level Mail.Send permissions).</li>\n</ul>\n<h4>MAIL THROTTLE</h4>\n<ul>\n<li><strong>Throttle</strong> the number of emails sent from your website per minute.</li>\n</ul>\n<h4>WP-CONFIG FOR AAD SECRETS</h4>\n<ul>\n<li>Further improve overall security by choosing to store Azure Active Directory secrets in your WordPress WP-Config.php (on disk) and have those secrets removed from the database.</li>\n</ul>\n<h4>SEND AS BCC</h4>\n<ul>\n<li>Send emails <strong>as BCC</strong> instead and prevent reply-to-all mail pollution.</li>\n</ul>\n<h4>REPLY-TO</h4>\n<ul>\n<li>Configure a <strong>default reply-to</strong> mail address if this should differ from the account&#8217;s mail address that is used to send WordPress transactional emails from.</li>\n</ul>\n<h3>Prerequisites</h3>\n<ul>\n<li>We have tested our plugin with WordPress &gt;= 5.0 and PHP &gt;= 5.6.40.</li>\n<li>You need to be an Entra ID Tenant Administrator to configure both Azure Active Directory and the plugin.</li>\n</ul>\n<h3>Support</h3>\n<p>We will go to great length trying to support you if the plugin doesn&#8217;t work as expected. Go to our <a href=\"https://www.wpo365.com/how-to-get-support/\" rel=\"nofollow ugc\">Support Page</a> to get in touch with us. We haven&#8217;t been able to test our plugin in all endless possible WordPress configurations and versions so we are keen to hear from you and happy to learn!</p>\n<h3>Feedback</h3>\n<p>We are keen to hear from you so share your feedback with us on <a href=\"https://www.linkedin.com/company/downloads-by-van-wieren\" rel=\"nofollow ugc\">LinkedIn</a> and help us get better!</p>\n<h3>Open Source</h3>\n<p>When you&#8217;re a developer and interested in the code you should have a look at our repo over at <a href=\"https://plugins.svn.wordpress.org/wpo365-msgraphmailer/\" rel=\"nofollow ugc\">WordPress</a>.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.36.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/wpo365-msgraphmailer/assets/screenshot-1.png?rev=2873874",
            "caption": "Configuration page"
        },
        {
            "src": "https://ps.w.org/wpo365-msgraphmailer/assets/screenshot-2.png?rev=2873874",
            "caption": "Mail audit log"
        }
    ],
    "tags": {
        "email": "email",
        "microsoft": "microsoft",
        "phpmailer": "phpmailer",
        "smtp": "smtp",
        "wp_mail": "wp_mail"
    },
    "stable_tag": "2.36",
    "versions": {
        "2.10": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.10.zip",
        "2.11": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.11.zip",
        "2.12": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.12.zip",
        "2.13": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.13.zip",
        "2.14": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.14.zip",
        "2.15": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.15.zip",
        "2.16": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.16.zip",
        "2.17": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.17.zip",
        "2.18": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.18.zip",
        "2.19": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.19.zip",
        "2.20": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.20.zip",
        "2.21": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.21.zip",
        "2.23": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.23.zip",
        "2.24": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.24.zip",
        "2.25": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.25.zip",
        "2.26": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.26.zip",
        "2.27": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.27.zip",
        "2.28": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.28.zip",
        "2.29": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.29.zip",
        "2.3": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.3.zip",
        "2.30": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.30.zip",
        "2.31": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.31.zip",
        "2.32": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.32.zip",
        "2.33": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.33.zip",
        "2.34": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.34.zip",
        "2.35": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.35.zip",
        "2.36": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.36.zip",
        "2.4": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.4.zip",
        "2.5": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.5.zip",
        "2.6": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.6.zip",
        "2.7": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.7.zip",
        "2.8": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.8.zip",
        "2.9": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.2.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wpo365-msgraphmailer.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/wpo365-msgraphmailer/assets/icon-128x128.png?rev=2683315",
        "2x": "https://ps.w.org/wpo365-msgraphmailer/assets/icon-256x256.png?rev=2683315"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 98,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}