{
    "name": "WunderAutomation",
    "slug": "wunderautomation",
    "version": "1.9.0",
    "author": "<a href=\"https://wundermatics.com/about\">Wundermatics</a>",
    "author_profile": "https://profiles.wordpress.org/wundermatics/",
    "contributors": {
        "wundermatics": {
            "profile": "https://profiles.wordpress.org/wundermatics/",
            "avatar": "https://secure.gravatar.com/avatar/b86919e21f4cc0dd65eb3fce038f023d?s=96&d=monsterid&r=g",
            "display_name": "wundermatics"
        }
    },
    "requires": "5.3",
    "tested": "5.9.10",
    "requires_php": "7.0",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 80,
    "ratings": {
        "5": 6,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 2
    },
    "num_ratings": 8,
    "support_url": "https://wordpress.org/support/plugin/wunderautomation/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 400,
    "downloaded": 12513,
    "last_updated": "2022-05-15 9:13pm GMT",
    "added": "2019-11-15",
    "homepage": "https://www.wundermatics.com/wunderautomation/",
    "sections": {
        "description": "<p>WunderAutomation brings automation features similar to IFTTT or Zapier to your WordPress site so that you can create simple and powerful automations without writing code. This enables anyone (not just coders) to customize WordPress to suit your needs. Human Friendly.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/qyKyDJOq2VI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Overview</h3>\n<p>Among many other things, our users use WunderAutomation to:</p>\n<ul>\n<li>Send reminders to users who created an account but never logged in</li>\n<li>Send follow up emails to users who buy specific products and ask for a review or suggest similar products</li>\n<li>Send emails to users 30 days after the last purchase of a specific product to remind them to restock</li>\n<li>Send notifications to internal email groups, SMS or Slack channels when orders are paid, cancelled or fail</li>\n<li>Send out a personalized WooCommerce coupon to users once they have placed a certain number of orders or have spent a certain amount on the site</li>\n</ul>\n<p>In short, WunderAutomation lets users create <a href=\"https://www.wundermatics.com/docs/workflows/?utm_source=readme&amp;utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">workflows</a> that automate common WordPress tasks. A <a href=\"https://www.wundermatics.com/docs/workflows/?utm_source=readme&amp;utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">workflow</a> consists of a <a href=\"https://www.wundermatics.com/docs/triggers/\" rel=\"nofollow ugc\">trigger</a>, and one or many steps. A trigger is what kicks of the workflow can be almost anything, for example a new WooCommerce order, a user login or an incoming webhook. Each step is either a <a href=\"https://www.wundermatics.com/docs/filters/\" rel=\"nofollow ugc\">filter</a> that determines the workflow should continue or an <a href=\"https://www.wundermatics.com/docs/actions/\" rel=\"nofollow ugc\">action</a> that does some work.</p>\n<p>You can filter a workflow based on almost anything like WooCommerce order total, the customers email address. Or the WordPress user login count, or a parameter in an incoming webhook. Multiple filters can be combined using logical AND/OR expressions. When all the filters pass, the actions are carried out, you can update WordPress posts or WooCommerce orders, add custom fields, create new users or posts, add or remove taxonomy terms (tags), send emails or run a REST request to an external service.</p>\n<p>There are endless ways to combine triggers, filters and actions so you can add almost any custom functionality to your WordPress site.</p>\n<h3>WooCommerce</h3>\n<p>WunderAutomation supports WooCommerce out of the box so it can trigger on WooCommerce events such as receiving a new order and perform actions like adding an order note or changing the order status.</p>\n<p>From version 1.9.0 we also support the popular WooCommerce PDF Invoices &amp; Packing Slips plugin so that you can use invoice numbers, date and notes into a workflow.</p>\n<h3>Advanced Custom Fields</h3>\n<p>WunderAutomation also supports Advanced Custom Fields (free and Pro versions) out of the box. ACF fields are accessible both in filters and action parameters so that you can take full advantage of the customizations you&#8217;ve made using ACF. A popular use case is to combine ACF and WunderAutomation to create <a href=\"https://www.wundermatics.com/2020/01/08/delivery-tracking-notifications-from-woocommerce/\" rel=\"nofollow ugc\">customized delivery notifications</a>.</p>\n<h3>Bulk handling</h3>\n<p>You can also handle objects (users, posts, orders and comments) in bulk using WunderAutomation, we call this Re-Triggers. A re-trigger runs periodically, ie every morning at 8AM and finds all objects that fit a certain criteria. For instance all posts with post type = &#8220;post&#8221; that was created in the past 30 days.</p>\n<p>These objects are then sent to a workflow that where you can handle them individually, for instance to disable comments if the post is older than X days and belongs to a certain category.</p>\n<h3>Webhooks</h3>\n<p>WunderAutomation can handle both incoming webhooks for triggering a workflow and sending out webhooks to external services. Incoming webhooks can be authenticated using Basic Auth, HTTP header tokens or HMAC signed payload (that Github uses). Webhooks makes it easy to use WunderAutomation in combination with <a href=\"https://zapier.com/\" rel=\"nofollow ugc\">Zapier</a>, you can both start a zap using a WunderAutomation workflow and you can use Zapier to start a workflow.</p>\n<h3>Related objects</h3>\n<p>As of version 1.7 WunderAutomation supports adding related objects to a Workflow using the new &#8220;Add object&#8221; action. This enables more even advanced workflows where you can access all properties on objects that are related to the page/post/order that triggered the workflow. This is useful in situations where you are setting up relationships between custom post types, ie &#8220;city&#8221; and &#8220;country&#8221;. Using &#8220;Add object&#8221; you can use the parent &#8220;country&#8221; object in filters and parameters when a &#8220;city&#8221; post have been updated.</p>\n<h3>WunderAutomation Pro</h3>\n<p>Out of the box, WunderAutomation has great support for WordPress core, WooCommerce and Advanced Custom Fields. With WunderAutomation Pro you also get access to a number of additional integrations with popular plugins and services.</p>\n<p>See <a href=\"https://www.wundermatics.com/wunderautomation-pro/?utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">https://www.wundermatics.com/wunderautomation-pro/</a> for more information.</p>\n<ul>\n<li>MailChimp</li>\n<li>MailPoet</li>\n<li>BuddyPress</li>\n<li>Slack</li>\n<li>Telegram</li>\n<li>Twilio (SMS gateway)</li>\n<li>WPForms and WPForms lite</li>\n<li>Contact Form 7</li>\n</ul>\n<p>WunderAutomation Pro also comes with more advanced Re-trigger scheduling and some additional WooCommerce parameters and filters.</p>\n<h3>Built in functionality</h3>\n<p>Also see: <a href=\"https://www.wundermatics.com/docs/built-in-triggers/?utm_source=readme&amp;utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">built in triggers</a></p>\n<p>Triggers</p>\n<p>Triggers are used to start a workflow</p>\n<ul>\n<li><strong>Webhook</strong>; Starts a workflow in response to an inbound webhook (i.e from Zapier).</li>\n<li><strong>User</strong>; Created, Login, Profile updated, Role changed.</li>\n<li><strong>Post</strong>: Created, Pending, Published, Privatized (published as private), Saved, Status changed and trashed.</li>\n<li><strong>Order</strong> (WooCommerce): Created, OnHold, Paid, Processing, Completed, Pending, Refunded, Saved, Cancelled</li>\n<li><strong>Comment</strong>: Submitted, Approved, Status changed, WooCommerce order note submitted</li>\n</ul>\n<p>Filters:</p>\n<p>Also see: <a href=\"https://www.wundermatics.com/docs/built-in-filters/?utm_source=readme&amp;utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">built in filters</a><br />\nFilters can be used to filter out triggered events so that only certain events actually leads to an action being performed.</p>\n<ul>\n<li><strong>User</strong>: Email, Role</li>\n<li><strong>Post</strong>: Title, Content, Tags, Categories, Owner, Status, Type</li>\n<li><strong>Order</strong>: Billing city, Billing country, Billing state, Downloadable products, Virtual products, Payment method, Producs, Product categories, Producs tags, Shipping city, Shipping country, Shipping state, Order total</li>\n<li><strong>Customer</strong>: Previous Order count, Previous order total</li>\n<li><strong>Comment</strong>: Author email, Author name, Content, Status, Type</li>\n</ul>\n<p>Actions</p>\n<p>Also see: <a href=\"https://www.wundermatics.com/docs/built-in-actions/?utm_source=readme&amp;utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">built in actions</a><br />\nActions are things a workflow can do / change / update as a result of a trigger</p>\n<ul>\n<li>Add / update custom field</li>\n<li>Change user role</li>\n<li>Create post</li>\n<li>Create user</li>\n<li>Change post / comment status</li>\n<li>Add / remove taxonomy term (tag or comment)</li>\n<li>Write a line to a log file</li>\n<li>Send plain text, HTML or WooCommerece email</li>\n<li>Run a http request to a remote REST API</li>\n<li>Run a webhook call (i.e to Zapier)</li>\n<li>Add WooCommerce order note</li>\n</ul>\n<p>Parameters</p>\n<p>Also see: <a href=\"https://www.wundermatics.com/docs/built-in-parameters/?utm_source=readme&amp;utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">built in parameters</a><br />\nParameters are used to customize an action with content from the object (post, order, user) that triggered it.</p>\n<ul>\n<li><strong>User</strong>: Id, First name, Last name, Email, Nickname, Role, Last login date</li>\n<li><strong>Post</strong>: Id, Title, Content, Slug, Admin url, public url, date, modified date, Comment count, custom fields</li>\n<li><strong>Order</strong>: Id, Status, SubTotal, Total excl. tax, Total tax, Stripe fee, Paypal fee, Payment method, Customer email, Shipping and billing address fields, order key</li>\n<li><strong>General</strong>: Siteurl, date, blogname, remote IP</li>\n</ul>\n<p>WunderAutomation also supports both incoming and outgoing Webhooks which is ideal for integrating your workflows with Zapier. This gives you access to thousands of integrations via their service.</p>\n<h3>Logging</h3>\n<p>WunderAutomation logs everything it does and in the interest of being human friendly, it also comes with a searchable log viewer. This makes it easy to keep track of what triggers that has fired, if the filters passed OK or not and if the actions was carried out or not.</p>\n",
        "installation": "<h3>Install from within WordPress</h3>\n<p>Visit the plugins page within your dashboard and select ‘Add New’<br />\nSearch for ‘WunderAutomation’<br />\nClick &#8216;Install&#8217; and wait until the button caption changes to &#8216;Activate&#8217;<br />\nClick &#8216;Activate&#8217;</p>\n<h3>Install manually</h3>\n<p>Download the zip file<br />\nUpload the wunderautomation folder from the zip to the /wp-content/plugins/ directory on your server<br />\nNavigate to the Plugins page in WordPress admin and locate the WunderAutomation plugin<br />\nClick &#8216;Activate&#8217;</p>\n",
        "changelog": "<h4>1.9.0</h4>\n<ul>\n<li>Feature: New action to add rows to a text (log) file.</li>\n<li>Feature: New action to add debug info to PHP error log.</li>\n<li>Feature: Support for WooCommerce PDF Invoices &amp; Packing Slips (filters and parameters).</li>\n<li>Feature: New parameter type Term, allows outputting any taxonomy term(s) as a parameter.</li>\n<li>Feature: Adds customer_note and shipping_phone as WooCommerce order parameters.</li>\n<li>Fixes: Issue with setting owner via login name for Create Post action.</li>\n<li>PRO: Adds support for BuddyPress and BuddyBoss.</li>\n<li>PRO: Fix issue with MailPoet triggers firing multiple times.</li>\n</ul>\n<h4>1.8.1</h4>\n<ul>\n<li>Fixes: Issues with editing re-triggers</li>\n<li>Fixes: UI support for setting post parent in Create Post action</li>\n<li>Feature: UI support for detecting post meta only updates in Save Post trigger</li>\n</ul>\n<h4>1.8.0</h4>\n<ul>\n<li>Feature: Importing and exporting workflows via Settings &gt;&gt; Tools</li>\n<li>Feature: WooCommerce integration supports order numbers (i.e. Sequential Order Number for WooCommerce)</li>\n<li>Post saved trigger improved so it&#8217;s optionally possible to also detect changes in post meta</li>\n</ul>\n<h4>1.7.1</h4>\n<ul>\n<li>Fixes fatal error when using log level DEBUG</li>\n<li>Fixes broken Ajax product lookup</li>\n</ul>\n<h4>1.7.0</h4>\n<ul>\n<li>Feature: Re-triggers for enabling bulk handling</li>\n<li>Adds date related filters and parameters for all objects</li>\n<li>Adds PUT method to Webhook and Rest API actions</li>\n<li>Adds new general date related filters based on Workflow runtime date/time</li>\n<li>Adds support tab to settings page, with ticket creation</li>\n<li>Stores last login date/time for all users to enable user.lastlogin filter and parameter</li>\n<li>Adds &#8220;pluck&#8221; parameter modifier to return part of a delimited string</li>\n<li>Adds transform Ω modifier to return a string in upper or lower case</li>\n<li>Adds &#8220;Add object&#8221; action to enable working with related posts etc.</li>\n<li>Fixes issue with mixed dropdown labels for some many-to-many filter operators</li>\n<li>Fixes UI bug that messed up rendering of complex filters with multiple groups</li>\n</ul>\n<h4>1.6.3</h4>\n<ul>\n<li>Fixes: Run once ignored and workflow runs multiple time for same order</li>\n<li>Fixes: Updating meta data fails in some workflows</li>\n<li>Fixes: Delay acting on webhooks until after all other plugins has initialized</li>\n<li>Fixes: Adds option to make an order status change manual via checkbox in UI</li>\n<li>Fixes: Setting log level to debug can trigger PHP fatal error in some cases</li>\n<li>Fixes: Order notes always set to private notes</li>\n</ul>\n<h4>1.6.2</h4>\n<ul>\n<li>Fixes: Filters not evaluated correctly in some cases</li>\n<li>Fixes: Workflow version not updated correctly when creating new workflows after upgrade</li>\n</ul>\n<h4>1.6.1</h4>\n<ul>\n<li>Emergency fix, various UI bugs in some browsers</li>\n</ul>\n<h4>1.6.0</h4>\n<ul>\n<li>WARNING: When you upgrade to this version you also MUST upgrade all WunderAutomation add-ons at the same time. Make sure to check that you have entered correct license information for any addons in order to enable automatic updates.</li>\n<li>Introducing steps instead of separate filters and actions</li>\n<li>Improved object handling</li>\n<li>Consistent support for Advanced custom fields for posts, order, users and comments</li>\n<li>Adds order_key parameter to WooCommerce order objects</li>\n<li>Internal: Upgraded to Vue3 and Tailwind</li>\n</ul>\n<h4>1.5.11</h4>\n<ul>\n<li>Emergency fix. Wrong version of critical file shipped causing the workflow editor to stop working.</li>\n</ul>\n<h4>1.5.10</h4>\n<ul>\n<li>Fix: Resolver internal method now correctly calls filters and actions for 3rd party plugins</li>\n<li>Fix: More sensible defaults for the email From address when using the Email sending actions</li>\n<li>Fix: Performance improvements</li>\n<li>Fix: Adds &#8220;length&#8221; as a new attribute to control WooCommerce coupon string length (not in UI)</li>\n<li>UX: Email from address field now has link to docs page to provide help</li>\n<li>Internal: Added PHP8 to all test suites</li>\n</ul>\n<h4>1.5.9</h4>\n<ul>\n<li>IMPORTANT: This is one of the last releases with support for PHP 5.6. Please ensure your site runs the PHP version recommended by WordPress (7.4 or later)</li>\n<li>Bugfix: Fixes PHP error notice from Logger.php if no settings exists</li>\n<li>All email actions has a From-field to allow overriding the default WordPress email from address</li>\n</ul>\n<h4>1.5.8</h4>\n<ul>\n<li>IMPORTANT: This is one of the last releases with support for PHP 5.6. Please ensure your site runs PHP 7.0 or later</li>\n<li>Bugfix: Order total filter always returned false</li>\n<li>UI: Add button to remove filters provided by an uninstalled plugin</li>\n</ul>\n<h4>1.5.7</h4>\n<ul>\n<li>Email actions (plan, HTML and WooCommerce) now supports sending to all users with a WordPress role</li>\n<li>New parameters for outputting WooCommerce order details, summary and meta data in either plain text or HTML</li>\n<li>UX improvement: Actions can be reordered</li>\n<li>UX improvement: Objects created dynamically (new user, new post) can be accessed in the parameter editor and in subsequent actions</li>\n<li>Fixed issues with parameter grouping</li>\n<li>Actions create user/post emits &#8220;newuser&#8221; and &#8220;newpost&#8221; to the object context to allow manipulating using subsequent actions.</li>\n</ul>\n<h4>1.5.6</h4>\n<ul>\n<li>Improves webhook action to let users choose between single or multiple line input (input vs textarea)</li>\n<li>Improved onboarding experience</li>\n</ul>\n<h4>1.5.5</h4>\n<ul>\n<li>Adds re-evaluate option to filters. Allows re-evaluation of a filter when the workflow is run delayed</li>\n<li>New action: Create user &#8211; crete new WordPress users, set role, password, email etc.</li>\n<li>New action: Cancel delayed workflow</li>\n<li>Improved handling for using parameters in action. Parameter editor now has an Insert button that inserts the placeholder in the last text field</li>\n<li>Updates create coupon parameter to allow setting a whitelist of allowed billing email addresses</li>\n<li>Bugfix: Parameter filtering doesn&#8217;t confuse mc-webhook with webhook</li>\n<li>Bugfix: Missing resources fo</li>\n</ul>\n<h4>1.5.4</h4>\n<ul>\n<li>Emergency fix. PHP class for Webhook action went missing &#8211; Many thanks to Mr Jb VERCRUYSSE for reporting this issue promptly</li>\n</ul>\n<h4>1.5.3</h4>\n<ul>\n<li>Adds filters and parameters for working with total order count and sum for current customer (WooCommerce)</li>\n<li>Internal: Adds class to recognize country regardless of language</li>\n<li>Bugfix: Clean up inconsistent naming for webhooks</li>\n</ul>\n<h4>1.5.2</h4>\n<ul>\n<li>Adds filter and parameter for working with remote the IP of the request initiator (ip filtering for webhooks and forms)</li>\n<li>WooCommerce order triggers now also provides a user object representing the WordPress user who placed the order</li>\n<li>Adds filter IsGuest to determine if an order is placed by a logged in user or a guest</li>\n</ul>\n<h4>1.5.1</h4>\n<ul>\n<li>Adds support for &#8220;Run once&#8221;. Optionally ensures that a specific workflow can only be executed once for the same object</li>\n<li>Adds an option to the Change Role action so that it&#8217;s possible to change role the current user</li>\n<li>Adds option to set a users role to &#8220;No role&#8221;</li>\n<li>Fixes a bug with extra characters some dropdown values</li>\n</ul>\n<h4>1.5.0</h4>\n<ul>\n<li>Adds Webhook trigger for receiving data via a webhook call to WordPress</li>\n<li>Adds filters and parameters for working with data from webhook trigger</li>\n<li>Adds Webhook action for structured remote API calls</li>\n<li>Adds content type selector and additional authenticatiom methods to REST API action</li>\n<li>Adds option parameter to get values from the WordPress options table (date format, blog name, etc.)</li>\n<li>Adds filters and parameters for currently logged in user</li>\n<li>Adds filters and parameters for WooCommerce order creation method (admin, checkout or rest-api)</li>\n<li>Adds filter to identify order notes as system notes or order status changed notes</li>\n<li>Adds JSONPath parameter parsing for some filters and parameters</li>\n</ul>\n<h4>1.4.3</h4>\n<ul>\n<li>Adds Order note (WooCommerce) trigger to specifically trigger on order notes</li>\n<li>Adds parameters for Order Shipping method and Shipping zone (WooCommerce)</li>\n<li>Adds filters for Order Shipping method and Shipping zone (WooCommerce)</li>\n<li>Adds a Comment content filter</li>\n<li>Adds new parameter modifier for date parameters to add/sub time from the returned date</li>\n</ul>\n<h4>1.4.2</h4>\n<ul>\n<li>Emergency fix for Vue error in Workflow editor</li>\n</ul>\n<h4>1.4.1</h4>\n<ul>\n<li>Adds order status filter</li>\n<li>Fixes issues with sending WooCommerce emails from certain triggers (User login) that runs before WordPress is fully initialized</li>\n<li>Fixes issue with filters in the workflow listing</li>\n<li>UI improvements to make it easier to find relevant documentation</li>\n</ul>\n<h4>1.4.0</h4>\n<ul>\n<li>Adds new actions for sending HTML emails.</li>\n<li>Adds parameter type for creating confirmation links</li>\n<li>Adds trigger type for detecting clicks on confirmation links</li>\n<li>Workflows can be grouped into categories for easier navigation of related workflows</li>\n<li>Fix: Change custom field action did not take formulas into account for numerical values</li>\n<li>Fix: Issue with no or wrong user being associated with a workflow triggered by a post trigger</li>\n</ul>\n<h4>1.3.3</h4>\n<ul>\n<li>Adds new action: Create post</li>\n<li>Adds new filters: Referer post id and Referer url</li>\n<li>Adds new parameters: Referer post id and referer url</li>\n<li>Internal &#8211; better handling of names and captions for some filters and parameters</li>\n<li>Internal &#8211; Adds post types and statuses to shared state object in Vue</li>\n</ul>\n<h4>1.3.2</h4>\n<ul>\n<li>Adds filters for customer order count (completed and total)</li>\n<li>Adds parameter for generating WooCommerce coupons</li>\n<li>Fixes formatting issues with generated placeholders for parameters</li>\n</ul>\n<h4>1.3.1</h4>\n<ul>\n<li>Fixes issue with js/css not loading when creating new workflow</li>\n<li>Bump the &#8220;tested to&#8221; version to 5.4</li>\n</ul>\n<h4>1.3.0</h4>\n<ul>\n<li>Feature: Experimental support for delayed workflows. Ability to delay an action to minutes, hours or days after the event occured.</li>\n<li>Improved phone number formatting for using phone numbers with remote APIs</li>\n<li>Fixes bug with assigning correct owner/author when a workflow is triggered by a post</li>\n<li>Adds promotional page for addons available at Wundermatics.com</li>\n<li>Fixes issue where the WunderAutomation scripts would load on all pages in the admin area</li>\n</ul>\n<h4>1.2.0</h4>\n<ul>\n<li>Adds reply-to, cc and bcc parameters to Send email action</li>\n<li>Adds line break handling to email action</li>\n<li>Adds support for Advanced Custom Fields as filter and parameters</li>\n<li>Adds Billing Email, Billing Company and Shipping Company as filters for WooCommerce Orders</li>\n</ul>\n<h4>1.1.0</h4>\n<ul>\n<li>Adds parameter &#8220;Date&#8221; to WooCommerce orders to return order created date</li>\n<li>Adds parameter &#8220;PaidDate&#8221; to WooCommerce orders to return order paid date</li>\n<li>Adds default date format to the settings screen.</li>\n<li>Adds option to format phone number parameter in e.164 standard (compact with international prefix, suitable for API usage in ie Twilio)</li>\n<li>Adds option to URL encode any parameter</li>\n<li>Where applicable, adds option to return parameter value as either key or label. I.e returning &#8220;France&#8221; instead of &#8220;FR&#8221;</li>\n<li>Adds extra rows to parameter test page to display both key value and label for parameters that supports being returned as a label</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Adds data type field to custom fields action</li>\n<li>Adds trigger Saved (posts)</li>\n<li>Adds filter Initiator</li>\n<li>Fixes issue with field name when custom field parameter</li>\n<li>Fixes issue with parameter test page on non english sites</li>\n</ul>\n"
    },
    "short_description": "WordPress and WooCommerce task automation. Without code.",
    "description": "<p>WunderAutomation brings automation features similar to IFTTT or Zapier to your WordPress site so that you can create simple and powerful automations without writing code. This enables anyone (not just coders) to customize WordPress to suit your needs. Human Friendly.</p>\n<span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/qyKyDJOq2VI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span>\n<h3>Overview</h3>\n<p>Among many other things, our users use WunderAutomation to:</p>\n<ul>\n<li>Send reminders to users who created an account but never logged in</li>\n<li>Send follow up emails to users who buy specific products and ask for a review or suggest similar products</li>\n<li>Send emails to users 30 days after the last purchase of a specific product to remind them to restock</li>\n<li>Send notifications to internal email groups, SMS or Slack channels when orders are paid, cancelled or fail</li>\n<li>Send out a personalized WooCommerce coupon to users once they have placed a certain number of orders or have spent a certain amount on the site</li>\n</ul>\n<p>In short, WunderAutomation lets users create <a href=\"https://www.wundermatics.com/docs/workflows/?utm_source=readme&amp;utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">workflows</a> that automate common WordPress tasks. A <a href=\"https://www.wundermatics.com/docs/workflows/?utm_source=readme&amp;utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">workflow</a> consists of a <a href=\"https://www.wundermatics.com/docs/triggers/\" rel=\"nofollow ugc\">trigger</a>, and one or many steps. A trigger is what kicks of the workflow can be almost anything, for example a new WooCommerce order, a user login or an incoming webhook. Each step is either a <a href=\"https://www.wundermatics.com/docs/filters/\" rel=\"nofollow ugc\">filter</a> that determines the workflow should continue or an <a href=\"https://www.wundermatics.com/docs/actions/\" rel=\"nofollow ugc\">action</a> that does some work.</p>\n<p>You can filter a workflow based on almost anything like WooCommerce order total, the customers email address. Or the WordPress user login count, or a parameter in an incoming webhook. Multiple filters can be combined using logical AND/OR expressions. When all the filters pass, the actions are carried out, you can update WordPress posts or WooCommerce orders, add custom fields, create new users or posts, add or remove taxonomy terms (tags), send emails or run a REST request to an external service.</p>\n<p>There are endless ways to combine triggers, filters and actions so you can add almost any custom functionality to your WordPress site.</p>\n<h3>WooCommerce</h3>\n<p>WunderAutomation supports WooCommerce out of the box so it can trigger on WooCommerce events such as receiving a new order and perform actions like adding an order note or changing the order status.</p>\n<p>From version 1.9.0 we also support the popular WooCommerce PDF Invoices &amp; Packing Slips plugin so that you can use invoice numbers, date and notes into a workflow.</p>\n<h3>Advanced Custom Fields</h3>\n<p>WunderAutomation also supports Advanced Custom Fields (free and Pro versions) out of the box. ACF fields are accessible both in filters and action parameters so that you can take full advantage of the customizations you&#8217;ve made using ACF. A popular use case is to combine ACF and WunderAutomation to create <a href=\"https://www.wundermatics.com/2020/01/08/delivery-tracking-notifications-from-woocommerce/\" rel=\"nofollow ugc\">customized delivery notifications</a>.</p>\n<h3>Bulk handling</h3>\n<p>You can also handle objects (users, posts, orders and comments) in bulk using WunderAutomation, we call this Re-Triggers. A re-trigger runs periodically, ie every morning at 8AM and finds all objects that fit a certain criteria. For instance all posts with post type = &#8220;post&#8221; that was created in the past 30 days.</p>\n<p>These objects are then sent to a workflow that where you can handle them individually, for instance to disable comments if the post is older than X days and belongs to a certain category.</p>\n<h3>Webhooks</h3>\n<p>WunderAutomation can handle both incoming webhooks for triggering a workflow and sending out webhooks to external services. Incoming webhooks can be authenticated using Basic Auth, HTTP header tokens or HMAC signed payload (that Github uses). Webhooks makes it easy to use WunderAutomation in combination with <a href=\"https://zapier.com/\" rel=\"nofollow ugc\">Zapier</a>, you can both start a zap using a WunderAutomation workflow and you can use Zapier to start a workflow.</p>\n<h3>Related objects</h3>\n<p>As of version 1.7 WunderAutomation supports adding related objects to a Workflow using the new &#8220;Add object&#8221; action. This enables more even advanced workflows where you can access all properties on objects that are related to the page/post/order that triggered the workflow. This is useful in situations where you are setting up relationships between custom post types, ie &#8220;city&#8221; and &#8220;country&#8221;. Using &#8220;Add object&#8221; you can use the parent &#8220;country&#8221; object in filters and parameters when a &#8220;city&#8221; post have been updated.</p>\n<h3>WunderAutomation Pro</h3>\n<p>Out of the box, WunderAutomation has great support for WordPress core, WooCommerce and Advanced Custom Fields. With WunderAutomation Pro you also get access to a number of additional integrations with popular plugins and services.</p>\n<p>See <a href=\"https://www.wundermatics.com/wunderautomation-pro/?utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">https://www.wundermatics.com/wunderautomation-pro/</a> for more information.</p>\n<ul>\n<li>MailChimp</li>\n<li>MailPoet</li>\n<li>BuddyPress</li>\n<li>Slack</li>\n<li>Telegram</li>\n<li>Twilio (SMS gateway)</li>\n<li>WPForms and WPForms lite</li>\n<li>Contact Form 7</li>\n</ul>\n<p>WunderAutomation Pro also comes with more advanced Re-trigger scheduling and some additional WooCommerce parameters and filters.</p>\n<h3>Built in functionality</h3>\n<p>Also see: <a href=\"https://www.wundermatics.com/docs/built-in-triggers/?utm_source=readme&amp;utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">built in triggers</a></p>\n<p>Triggers</p>\n<p>Triggers are used to start a workflow</p>\n<ul>\n<li><strong>Webhook</strong>; Starts a workflow in response to an inbound webhook (i.e from Zapier).</li>\n<li><strong>User</strong>; Created, Login, Profile updated, Role changed.</li>\n<li><strong>Post</strong>: Created, Pending, Published, Privatized (published as private), Saved, Status changed and trashed.</li>\n<li><strong>Order</strong> (WooCommerce): Created, OnHold, Paid, Processing, Completed, Pending, Refunded, Saved, Cancelled</li>\n<li><strong>Comment</strong>: Submitted, Approved, Status changed, WooCommerce order note submitted</li>\n</ul>\n<p>Filters:</p>\n<p>Also see: <a href=\"https://www.wundermatics.com/docs/built-in-filters/?utm_source=readme&amp;utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">built in filters</a><br />\nFilters can be used to filter out triggered events so that only certain events actually leads to an action being performed.</p>\n<ul>\n<li><strong>User</strong>: Email, Role</li>\n<li><strong>Post</strong>: Title, Content, Tags, Categories, Owner, Status, Type</li>\n<li><strong>Order</strong>: Billing city, Billing country, Billing state, Downloadable products, Virtual products, Payment method, Producs, Product categories, Producs tags, Shipping city, Shipping country, Shipping state, Order total</li>\n<li><strong>Customer</strong>: Previous Order count, Previous order total</li>\n<li><strong>Comment</strong>: Author email, Author name, Content, Status, Type</li>\n</ul>\n<p>Actions</p>\n<p>Also see: <a href=\"https://www.wundermatics.com/docs/built-in-actions/?utm_source=readme&amp;utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">built in actions</a><br />\nActions are things a workflow can do / change / update as a result of a trigger</p>\n<ul>\n<li>Add / update custom field</li>\n<li>Change user role</li>\n<li>Create post</li>\n<li>Create user</li>\n<li>Change post / comment status</li>\n<li>Add / remove taxonomy term (tag or comment)</li>\n<li>Write a line to a log file</li>\n<li>Send plain text, HTML or WooCommerece email</li>\n<li>Run a http request to a remote REST API</li>\n<li>Run a webhook call (i.e to Zapier)</li>\n<li>Add WooCommerce order note</li>\n</ul>\n<p>Parameters</p>\n<p>Also see: <a href=\"https://www.wundermatics.com/docs/built-in-parameters/?utm_source=readme&amp;utm_medium=readme&amp;utm_campaign=potential_users\" rel=\"nofollow ugc\">built in parameters</a><br />\nParameters are used to customize an action with content from the object (post, order, user) that triggered it.</p>\n<ul>\n<li><strong>User</strong>: Id, First name, Last name, Email, Nickname, Role, Last login date</li>\n<li><strong>Post</strong>: Id, Title, Content, Slug, Admin url, public url, date, modified date, Comment count, custom fields</li>\n<li><strong>Order</strong>: Id, Status, SubTotal, Total excl. tax, Total tax, Stripe fee, Paypal fee, Payment method, Customer email, Shipping and billing address fields, order key</li>\n<li><strong>General</strong>: Siteurl, date, blogname, remote IP</li>\n</ul>\n<p>WunderAutomation also supports both incoming and outgoing Webhooks which is ideal for integrating your workflows with Zapier. This gives you access to thousands of integrations via their service.</p>\n<h3>Logging</h3>\n<p>WunderAutomation logs everything it does and in the interest of being human friendly, it also comes with a searchable log viewer. This makes it easy to keep track of what triggers that has fired, if the filters passed OK or not and if the actions was carried out or not.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/wunderautomation.1.9.0.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/wunderautomation/assets/screenshot-1.png?rev=2194889",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wunderautomation/assets/screenshot-2.png?rev=2194889",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wunderautomation/assets/screenshot-3.png?rev=2194889",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wunderautomation/assets/screenshot-4.png?rev=2194889",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wunderautomation/assets/screenshot-5.png?rev=2344727",
            "caption": ""
        },
        {
            "src": "https://ps.w.org/wunderautomation/assets/screenshot-6.png?rev=2344727",
            "caption": ""
        }
    ],
    "tags": {
        "automate": "automate",
        "automation": "automation",
        "ifttt": "ifttt",
        "nocode": "nocode",
        "zapier": "zapier"
    },
    "stable_tag": "1.9.0",
    "versions": {
        "1.0.1": "https://downloads.wordpress.org/plugin/wunderautomation.1.0.1.zip",
        "1.1.0": "https://downloads.wordpress.org/plugin/wunderautomation.1.1.0.zip",
        "1.2.0": "https://downloads.wordpress.org/plugin/wunderautomation.1.2.0.zip",
        "1.3.3": "https://downloads.wordpress.org/plugin/wunderautomation.1.3.3.zip",
        "1.4.3": "https://downloads.wordpress.org/plugin/wunderautomation.1.4.3.zip",
        "1.5.11": "https://downloads.wordpress.org/plugin/wunderautomation.1.5.11.zip",
        "1.6.0": "https://downloads.wordpress.org/plugin/wunderautomation.1.6.0.zip",
        "1.6.1": "https://downloads.wordpress.org/plugin/wunderautomation.1.6.1.zip",
        "1.6.2": "https://downloads.wordpress.org/plugin/wunderautomation.1.6.2.zip",
        "1.6.3": "https://downloads.wordpress.org/plugin/wunderautomation.1.6.3.zip",
        "1.7.0": "https://downloads.wordpress.org/plugin/wunderautomation.1.7.0.zip",
        "1.7.1": "https://downloads.wordpress.org/plugin/wunderautomation.1.7.1.zip",
        "1.8.0": "https://downloads.wordpress.org/plugin/wunderautomation.1.8.0.zip",
        "1.8.1": "https://downloads.wordpress.org/plugin/wunderautomation.1.8.1.zip",
        "1.9.0": "https://downloads.wordpress.org/plugin/wunderautomation.1.9.0.zip",
        "trunk": "https://downloads.wordpress.org/plugin/wunderautomation.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/wunderautomation/assets/banner-772x250.png?rev=2193744",
        "high": false
    },
    "icons": {
        "1x": "https://ps.w.org/wunderautomation/assets/icon-256x256.png?rev=2193744",
        "2x": "https://ps.w.org/wunderautomation/assets/icon-256x256.png?rev=2193744"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 80,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}