{
    "name": "Yes-co ORES",
    "slug": "yes-co-ores-wordpress-plugin",
    "version": "1.3.84",
    "author": "<a href=\"https://www.yes-co.nl\">Yes-co</a>",
    "author_profile": "https://profiles.wordpress.org/kees-brandenburg/",
    "contributors": {
        "yesco": {
            "profile": "https://profiles.wordpress.org/yesco/",
            "avatar": "https://secure.gravatar.com/avatar/9296d51ae18eab1f779ab7e5c482ec28?s=96&d=monsterid&r=g",
            "display_name": "Yes-co"
        }
    },
    "requires": "3.1",
    "tested": "6.4.5",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 0,
    "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "num_ratings": 0,
    "support_url": "https://wordpress.org/support/plugin/yes-co-ores-wordpress-plugin/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 20,
    "downloaded": 8133,
    "last_updated": "2024-03-13 08:21:00",
    "added": "2011-03-10",
    "homepage": "https://www.yes-co.nl/aansluitmogelijkheden/wordpress-plugin/",
    "sections": {
        "description": "<h4>Yes-co Open Real Estate System WordPress Plugin</h4>\n<p>WordPress, voted the world&#8217;s most powerful website and blogging system, has now been made suitable for brokers and developers.<br />\nThis plugin is only available in dutch.</p>\n<h4>NL</h4>\n<p><strong>Woningen publiceren op je WordPress website</strong></p>\n<p>Yes-co ontwikkelde de Yes-co ORES WordPress plugin waardoor woning- en BOG-aanbod direct naar je WordPress website gepubliceerd kan worden.<br />\nOf je nu NVM-, VBO-, VastgoedPro- of onafhankelijk makelaar bent, je aanbod staat met 1 druk op de knop op je WordPress-blog</p>\n<p><strong>WordPress &amp; makelaar 2.0</strong></p>\n<p>Een WordPress website blog is zonder twijfel de slimst beschikbare technologie. Je combineert op deze manier een Website, Blog en Social media mogelijkheden. Kortom alle instrumenten die de moderne makelaar nodig heeft om zich te kunnen profileren, in 1 slim systeem.</p>\n<p><strong>De Yes-co ORES WordPress plugin is geschikt voor:</strong></p>\n<ul>\n<li>Makelaarswebsite</li>\n<li>Object website (een blog voor 1 woning, kan nu eenvoudig ..)</li>\n</ul>\n<p><strong>Over het Yes-co Open Real Estate Systeem</strong></p>\n<p>Als jij het belangrijk vindt om op jouw manier, met volledige vrijheid te werken, dan zit je bij Yes-co goed!<br />\nJe krijgt namelijk  een volledig en uitgebreid crm-systeem waarmee je je objecten &amp; relaties makkelijk kan beheren en vermarkten, voor een vast &amp; laag maandbedrag. Toch nog iets extra&#8217;s nodig?<br />\nDan beslis jij zelf, welk van de volledig geïntegreerde extra functionaliteiten, je wanneer gebruikt. En gebruik je ze niet? Dan betaal je ze ook niet! Zo bepaal je zelf  hoe Yes-co jouw bedrijf ondersteunt!<br />\nMeer weten? <a href=\"https://www.yes-co.nl/#demo-aanvragen\" title=\"Vraag een demo aan\" rel=\"nofollow ugc\">Vraag een demo aan</a>.</p>\n<h4>EN</h4>\n<p><strong>Homes publishing blog</strong></p>\n<p>Yes-co developed the Yes-co ORES WordPress plugin, which enables the publication of residential and commercial real estate directly from your Yes-co system to WordPress.<br />\nWhether you are a NVM-, VBO- or VastgoedPro-member or an independent broker, your portfolio is published to your WordPress-blog with just one click.</p>\n<p><strong>WordPress &amp; Broker 2.0</strong></p>\n<p>A WordPress website blog is without a doubt the smartest technology available. This way you can combine your Website, Blog and Social Media channels. In short: all the tools needed for a modern broker to present themselves, within one clever system.</p>\n<p><strong>The Yes-co ORES WordPress plugin is suitable for:</strong></p>\n<ul>\n<li>Real estate websites</li>\n<li>Property website (a blog for a house can now be realised easily)</li>\n</ul>\n<p><strong>About Yes-co Open Real Estate System</strong><br />\nIf you find it important to work in your own way, with complete freedom, then Yes-co is the right place for you!<br />\nYou get a complete and extensive CRM system with which you can easily manage and market your objects &amp; relations, for a fixed &amp; low monthly fee. Still need something extra?<br />\nThen you decide which of the fully integrated extra functionalities you use and when. If you don&#8217;t use it? Then you don&#8217;t pay for it either!<br />\nThis way you decide how Yes-co supports your company!<br />\nDo you want to know more? <a href=\"https://www.yes-co.nl/#demo-aanvragen\" title=\"Request a demo\" rel=\"nofollow ugc\">Request a demo</a>.</p>\n",
        "installation": "<h4>Dutch</h4>\n<ul>\n<li>Ga na of je hosting alle <a href=\"https://dev.yes-co.com/wordpress/#requirements-hosting\" title=\"Hosting requirements\" rel=\"nofollow ugc\">requirements</a> ondersteund</li>\n<li>Installeer de Yes-co ORES plugin vanuit je wordpress admin</li>\n<li>Activeer de Yes-co ORES plugin</li>\n<li>Installeer het <a href=\"https://dev.yes-co.com/files/yesco_ores_theme_1.5.3.zip\" title=\"Download het Yes-co ORES voorbeeld thema\" rel=\"nofollow ugc\">Yes-co ORES voorbeeld thema</a> of creëer je eigen thema (Zie de <a href=\"https://dev.yes-co.com/wordpress/\" title=\"Yes-co ORES technische documentatie\" rel=\"nofollow ugc\">technische documentatie</a> ).</li>\n<li>Als je iemand inhuurt voor het maken van een eigen wordpress thema, zorg er dan voor dat deze persoon de juiste <a href=\"https://dev.yes-co.com/wordpress/#requirements-creator\" title=\"Benodigde vaardigheden\" rel=\"nofollow ugc\">vaardigheden</a> bezit.</li>\n<li>Activeer het &#8220;WordPress Blog&#8221; marketing kanaal in de App Market van je Yes-co Open Real Estate Systeem. Na het activeren wordt je doorgestuurd naar de instellingen, vul hier de url van je wordpress blog in.</li>\n<li>Kopieër de code in het instellingen scherm en plak deze in het &#8220;Activatiecode&#8221; veld in de Yes-co ORES instellingen pagina van je WordPress blog. Klik op de &#8220;Koppeling toevoegen&#8221; knop om de activerings code toe te voegen.</li>\n<li>Klik op de &#8220;Koppeling controleren&#8221; knop in het instellingen scherm van het &#8220;WordPress Blog&#8221; marketing kanaal in de App Market van je Yes-co Open Real Estate Systeem.</li>\n</ul>\n<p>Publicaties van je Yes-co Open Real Estate Systeem naar je WordPress blog zijn nu geactiveerd.</p>\n<h4>English</h4>\n<ul>\n<li>Make sure your hosting supports the <a href=\"https://dev.yes-co.com/wordpress/#requirements-hosting\" title=\"Hosting requirements\" rel=\"nofollow ugc\">requirements</a></li>\n<li>Install the Yes-co ORES plugin from your wordpress admin</li>\n<li>Activate the Yes-co ORES plugin</li>\n<li>Install the <a href=\"https://dev.yes-co.com/files/yesco_ores_theme_1.5.3.zip\" title=\"Download the Yes-co ORES example theme\" rel=\"nofollow ugc\">Yes-co ORES example theme</a> or create your own theme (check out the <a href=\"https://dev.yes-co.com/wordpress/\" title=\"Yes-co ORES technical documentation\" rel=\"nofollow ugc\">technical documentation</a> ).</li>\n<li>If you hire someone to create a custom theme, make sure this person has the right <a href=\"https://dev.yes-co.com/wordpress/#requirements-creator\" title=\"Skills\" rel=\"nofollow ugc\">skills</a></li>\n<li>Activate the &#8220;WordPress Blog&#8221; marketing channel in the App Market of your Yes-co Open Real Estate System. After the activation you will be redirected to the settings. Fill out the URL of your WordPress blog.</li>\n<li>Copy the code in the settings screen and paste it to the &#8220;Activatiecode&#8221; field on the Yes-co ORES settings page of your WordPress blog. Click on the &#8220;Koppeling toevoegen&#8221; button to add the activation code.</li>\n<li>Click on the &#8220;Koppeling controleren&#8221; button on the settings screen of the &#8220;WordPress Blog&#8221; marketing channel in the App Market of your Yes-co Open Real Estate System.</li>\n</ul>\n<p>Publications from your Yes-co Open Real Estate System to your WordPress blog are now enabled.</p>\n",
        "changelog": "<h4>1.3.84</h4>\n<ul>\n<li>Fixed: When no service costs are set, use the contribution owners association divided by 12</li>\n</ul>\n<h4>1.3.83</h4>\n<ul>\n<li>Fixed: reading 3mcp feed in synchronization.</li>\n</ul>\n<h4>1.3.82</h4>\n<ul>\n<li>Added: support to search on energie label (for houses, not yet in search widget)</li>\n</ul>\n<h4>1.3.81</h4>\n<ul>\n<li>Added: option to run synchronisation through cli for only one system link</li>\n<li>Added: option to disable normal synchronisation for one system link</li>\n</ul>\n<h4>1.3.80</h4>\n<ul>\n<li>Fixed: when manually editing the open house times through the WPadmin, store the times in the correct timezone (living)</li>\n</ul>\n<h4>1.3.79</h4>\n<ul>\n<li>Changed: set sold/rented state label with uppercase first letter during sync (BOG/living objects)</li>\n<li>Fixed: field title &#8216;BergingType&#8217; to &#8216;Type berging&#8217; (living)</li>\n<li>Fixed: field title &#8216;WarmWater&#8217; to &#8216;Warm water&#8217; (living)</li>\n<li>Fixed: field title &#8216;CvKetelBouwjaar&#8217; to &#8216;Bouwjaar C.V.&#8217; (living)</li>\n<li>Fixed: field title &#8216;KeukenVernieuwd&#8217; to &#8216;Keuken vernieuwd&#8217; (living)</li>\n</ul>\n<h4>1.3.78</h4>\n<ul>\n<li>Added: support for living &#8216;BouwType&#8217; field</li>\n<li>Fixed: living &#8216;Aanvaarding&#8217; field when set to &#8216;per datum&#8217;</li>\n<li>Fixed: &#8216;Verkocht&#8217; / &#8216;Verhuurd&#8217; state when no price is set</li>\n</ul>\n<h4>1.3.77</h4>\n<ul>\n<li>Added: support for WOZ value of houses</li>\n</ul>\n<h4>1.3.76</h4>\n<ul>\n<li>Changed: More time to download images from feed before getting a timeout.</li>\n</ul>\n<h4>1.3.75</h4>\n<ul>\n<li>Added: support for BOG projects</li>\n</ul>\n<h4>1.3.74</h4>\n<ul>\n<li>Added: support for BOG energy label</li>\n</ul>\n<h4>1.3.73</h4>\n<ul>\n<li>Added: Active/Sold categories to living/bog objects</li>\n<li>Added: option in recent objects widget to only show objects in a specific category</li>\n<li>Changed: better translation of several stuff to english</li>\n</ul>\n<h4>1.3.72</h4>\n<ul>\n<li>Added: .htaccess to disallow access to includes folder</li>\n<li>Added: index.php files to folders, so no directory index is shown (For severs that have directory indexing enabled)</li>\n</ul>\n<h4>1.3.71</h4>\n<ul>\n<li>Added: support for version object spec</li>\n</ul>\n<h4>1.3.70</h4>\n<ul>\n<li>Changed: removed the SVZ solutions google maps implementation (and use the plain Google Maps Javascript API instead)</li>\n<li>Changed: call response forms API over https</li>\n<li>Changed: added support to clear the cache of the Cache Enabler plugin when synchronizing new/updated objects</li>\n<li>Fixed: synchronisation of the BOG build year</li>\n<li>Fixed: do not synchronize the collegual text of BOG objects</li>\n<li>Added: syncrhinisation of the BOG building name</li>\n</ul>\n<h4>1.3.69</h4>\n<ul>\n<li>Fixed: price &#8216;op aanvraag&#8217; for a min/max rental price (BOG)</li>\n</ul>\n<h4>1.3.68</h4>\n<ul>\n<li>Fixed: updating order of object images in synchronization when only the order has changed</li>\n</ul>\n<h4>1.3.67</h4>\n<ul>\n<li>Added: support for detecting floorplans from floorplan.com so they can be retrieved using yog_retrieveEmbedMovies()</li>\n</ul>\n<h4>1.3.66</h4>\n<ul>\n<li>Added: ability to use OpenStreetMap instead of Google Maps (only when map is generated through yog_retrieveDynamicMap function)</li>\n<li>Changed: use manage_options capabilty to edit plugin settings instead of edit_plugins</li>\n</ul>\n<h4>1.3.65</h4>\n<ul>\n<li>Changed: object state will no longer be set to &#8216;Verkocht&#8217; or &#8216;Verhuurd&#8217; when no reservation (till) date has been set</li>\n</ul>\n<h4>1.3.64</h4>\n<ul>\n<li>Added: support for matterport links</li>\n<li>Added: possibility to rename system links</li>\n</ul>\n<h4>1.3.63</h4>\n<ul>\n<li>Added: synchronisation for extra BOG fields (Praktijkruimte/Leisure/Maatschappelijk vastgoed/Garagebox/Verhard buitenterrein)</li>\n<li>Changed: removed support for 3mcp versions 1.5 and 1.4 (only supporting 3mcp 1.6)</li>\n</ul>\n<h4>1.3.62</h4>\n<ul>\n<li>Added: option to set sortorder to relations</li>\n</ul>\n<h4>1.3.61</h4>\n<ul>\n<li>Added: checkbox at relations in WPadmin to make sure they are not deleted during synchronisation</li>\n</ul>\n<h4>1.3.60</h4>\n<ul>\n<li>Changed: better MijnHuiszaken widget implementation</li>\n<li>Fixed: error in synchronisation for wordpress versions before 5.3 when no timezone was set</li>\n</ul>\n<h4>1.3.59</h4>\n<ul>\n<li>Fixed: error with determination of timezone for wordpress versions before 5.3</li>\n</ul>\n<h4>1.3.58</h4>\n<ul>\n<li>Fixed: Notices in Yes-co ORES settings</li>\n<li>Changed: Added even more sync debug information</li>\n</ul>\n<h4>1.3.57</h4>\n<ul>\n<li>Fixed: Storing of edit system link;</li>\n<li>Added: Extra information returned in check url callback;</li>\n</ul>\n<h4>1.3.56</h4>\n<ul>\n<li>Fixed: Several E_NOTICES in synchronisation</li>\n<li>Added: New synchronisation tab in admin containing sync options and several status indications</li>\n<li>Changed: last-sync option seperated for each feed</li>\n<li>Added: Bog overview shows date published</li>\n<li>Fixed: If sync is running through cron job and runs for hours.. it will update the syn-running flag more often</li>\n<li>Changed: Menu in yes-co ores is rendered different</li>\n</ul>\n<h4>1.3.55</h4>\n<ul>\n<li>Fixed: Sync issue when allow_url_fopen was off</li>\n<li>Added: Setting for meta fields that should not be deleted when synchronizing an object. This can be usefull when using a third-party plugin that adds meta fields to the Yes-co ORES objects.</li>\n<li>Added: extra check if objects already exist when synchronizing</li>\n</ul>\n<h4>1.3.54</h4>\n<ul>\n<li>Added: support to search on (predefined) alternative city names (like &#8216;s-Gravenhage/Den Haag)</li>\n</ul>\n<h4>1.3.53</h4>\n<ul>\n<li>Changed: Contact form now supports showing in English</li>\n</ul>\n<h4>1.3.52</h4>\n<ul>\n<li>Fixed: notice</li>\n<li>Added: search on BOG rental price can now be configured to search on price per month / price per year (prices are calculated based on the set price)</li>\n<li>Added: yog_retrieveDateTimeSpec function to retieve \\DateTime object of OpenHuisVan / OpenHuisTot. This should be used to retrieve the open house date instead of yog_retrieveSpecs / yog_retrieveSpec to avoid timezone problems (causing a wrong time to be displayed).</li>\n<li>Fixed: search on places with a apostrophe in the name</li>\n</ul>\n<h4>1.3.51</h4>\n<ul>\n<li>Fixed: synchronisation of older projects (that are not synced yet)</li>\n<li>Added: check if used 3mcp version is not older then the 3mcp version used at the previous sync</li>\n</ul>\n<h4>1.3.50</h4>\n<ul>\n<li>Fixed: fatal error when loading multiple google maps</li>\n<li>Fixed: error on retrieving dossier item links from 3mcp</li>\n</ul>\n<h4>1.3.49</h4>\n<ul>\n<li>Added: (calculated) rental price per year for wonen/bog</li>\n<li>Changed: use thickbox for system link remove warning</li>\n<li>Added: yog_recent_objects_widget_before_content hook for recent objects</li>\n<li>Added: seperate housenumber / addition meta data for wonen/bog</li>\n<li>Changed: the &#8216;Oppervlakte&#8217; meta data of a &#8216;Bedrijfsruimte&#8217; BOG object now contains the total surface (&#8216;Bedrijfshal&#8217; + &#8216;Kantoorruimte&#8217;), instead of the &#8216;Bedrijfshal&#8217; surface.</li>\n</ul>\n<h4>1.3.48</h4>\n<ul>\n<li>Added: options to group objects in recent objects widget</li>\n<li>Added: option to set custom 3mcp credentials</li>\n<li>Fixed: minor notices</li>\n<li>Fixed: retrieve of BOG rental price</li>\n</ul>\n<h4>1.3.47</h4>\n<ul>\n<li>Fixed: Removed usage of hard coded wp-content</li>\n<li>Fixed: Use of sanitizing functions extended even more</li>\n<li>Changed: no longer use the depricated add_object_page function</li>\n</ul>\n<h4>1.3.46</h4>\n<ul>\n<li>Changed: Use wordpress native HTTP API to read objects from 3mcp feed</li>\n<li>Changed: external libraries are now included in the plugin instead of externally loaded</li>\n<li>Changed: use of WP CLI for synchronization through CLI, instead of custom CLI script. If scripts/synchronized.php is used for the synchronization, you should move to WP CLI. To install WP CLI, check: https://make.wordpress.org/cli/handbook/installing/. After WP CLI is installed you can run synchronization through the command &#8220;wp yog synchronize&#8221;.</li>\n<li>Changed: better handling of timezone differences during synchronization</li>\n<li>Fixed: Use jQuery UI touch punch library included in WordPress itself, instead of loading own version</li>\n<li>Fixed: Better prefixing of constants</li>\n<li>Fixed: Use of sanitizing functions extended</li>\n</ul>\n<h4>1.3.45</h4>\n<ul>\n<li>Added: option to disable sync of english text</li>\n<li>Added: options to sync extra texts / english texts as seperate meta data</li>\n<li>Added: define custom area/neighbourhood labels</li>\n<li>Added: option to switch the html style of several components (such as widgets) from basic (default) to bootstrap 4.</li>\n<li>Added: option to place Open Graph information about objects in the HEAD. (If you use another plugin to do so, turning this option on can conflict with the other plugin)</li>\n<li>Added: You can now control the quality wordpress uses for the resized images of objects.</li>\n<li>Added: MijnHuiszaken settings</li>\n<li>Added: Support for 3mcp 1.6 (when future upgrade to 3mcp 1.6 is done)</li>\n<li>Added: extra information about a relation is synced</li>\n<li>Added: Shortcode for MijnHuiszaken register url;</li>\n<li>Added: Public function &#8220;yog_retrieveEmployees&#8221; to retrieve all employees for an employee page for example;</li>\n<li>Added: AVG checkmark for response forms;</li>\n<li>Added: Shortcode for employees with an appendable class [yog-employees-bar style=&#8221;small-right&#8221;];</li>\n<li>Added: Option to generate widgets with bootstrap4 style code for themes to use;</li>\n<li>Changed: The plugin settings in the WP admin are spread over several tabs.</li>\n<li>Changed: by default, only office/employee relations are synced. If you want to sync all linked relations you can change this in the plugin settings (in the WP admin)</li>\n<li>Changed: When a linked system is deleted from the plugin settings, the corresponding objects are deleted as well.</li>\n<li>Fixed: Authenticated Persistent Cross-Site Scripting (XSS) Vulnerability</li>\n</ul>\n<h4>1.3.44</h4>\n<ul>\n<li>Fixed: synchronisation of multiple collections when one collection has not been set up properly</li>\n</ul>\n<h4>1.3.43</h4>\n<ul>\n<li>Changed: make sure the post date is not set in the future when synchronising objects</li>\n</ul>\n<h4>1.3.42</h4>\n<ul>\n<li>Fixed: loading of jquery-ui stylesheet (used for the sliders in search form)</li>\n</ul>\n<h4>1.3.41</h4>\n<ul>\n<li>Changed: Youtube/vimeo embed url&#8217;s are now always over https (instead of http)</li>\n</ul>\n<h4>1.3.40</h4>\n<ul>\n<li>Fixed: Determine of city order for NBpr/BBpr in synchronisation</li>\n</ul>\n<h4>1.3.39</h4>\n<ul>\n<li>Fixed: BOG Bouwgrond/Bouwhoogte is provided in cm, so should be devided by 100 before displaying in cm</li>\n</ul>\n<h4>1.3.38</h4>\n<ul>\n<li>Added: option to order objects by city/street</li>\n</ul>\n<h4>1.3.37</h4>\n<ul>\n<li>Changed: Updated SvzMaps to version 0.7.5 changing to ssl support and imporved interaction in the maps on mobile devices;</li>\n<li>Changed: When retrieving the state of an object, take the reservation date into account (&#8220;verkocht onder voorbehoud&#8221; or &#8220;verkocht&#8221;) without having to publish the object again.</li>\n</ul>\n<h4>1.3.36</h4>\n<ul>\n<li>Added: include used charset in contact form widget</li>\n</ul>\n<h4>1.3.35</h4>\n<ul>\n<li>Added: &#8216;Belegging&#8217; category for BOG objects</li>\n</ul>\n<h4>1.3.34</h4>\n<ul>\n<li>Fixed: when using the &#8220;Yes-co Object Koppelingen&#8221; widget, a div element was not closed properly.</li>\n</ul>\n<h4>1.3.33</h4>\n<ul>\n<li>Changed: optimized checking if synchronisation of an object is needed</li>\n</ul>\n<h4>1.3.32</h4>\n<ul>\n<li>Added: support for use of Type search parameter</li>\n<li>Added: support for use of Oppervlakte_min / Oppervlakte_max search parameter for BOG</li>\n<li>Changed: Recent objects widget not respects the &#8216;Individuele objecten gekoppeld aan een NBty/BBty niet tonen in overzichten&#8217; setting</li>\n<li>Added: filter/hooks to extend the recent objects widget</li>\n<li>Changed: optimized loading of css/js files. If you are using the Yes-co example theme, please update it to the <a href=\"https://www.yes-co.nl/downloads/yesco_ores_theme_1.5.1.zip\" title=\"latest version\" rel=\"nofollow ugc\">latest version</a> before updating the plugin!</li>\n</ul>\n<h4>1.3.31</h4>\n<ul>\n<li>Changed: Updated SvzMaps to version 0.7.2 supporting google maps api;</li>\n<li>Added: Ability to set an api key for the google maps api;</li>\n</ul>\n<h4>1.3.30</h4>\n<ul>\n<li>Fixed: Dojo loaded through https in case website runs on SSL</li>\n</ul>\n<h4>1.3.29</h4>\n<ul>\n<li>Fixed: synchronization of images for php versions &lt; 5.3 (eof since 6 Jan 2011, so should not be used. But some customers still use it)</li>\n<li>Added: warning when php version &lt; 5.5 is used (php 5.4 and lower is eof)</li>\n</ul>\n<h4>1.3.28</h4>\n<ul>\n<li>Added: option to select used size of synchronized images</li>\n<li>Added: option to hide NBvk/NBvk/BBvk/BBvh objects linked to an NBty/BBty in the category overviews</li>\n<li>Added: option to select the used roles in the linked relations widget</li>\n</ul>\n<h4>1.3.27</h4>\n<ul>\n<li>Fixed: display of dossier items when several mime-types are used</li>\n</ul>\n<h4>1.3.26</h4>\n<ul>\n<li>Added: option to use CLI script for synchronisation, instead of the normal callback</li>\n</ul>\n<h4>1.3.25</h4>\n<ul>\n<li>Changed: Address search now on the object_type param instead of the object param, allowing searching in Nieuwbouw project names and full street names including numbers</li>\n</ul>\n<h4>1.3.24</h4>\n<ul>\n<li>Changed: Updated SvzMaps to version 0.7.0 supporting google places api / disabling of dragging on touch devices / disabling of scrollwheel / fix for sensor message in console / support for vw, vh, % width and height units / dojo 1.10.4 support;</li>\n</ul>\n<h4>1.3.23</h4>\n<ul>\n<li>Added: Possibility to customize tekst produced by ajax filter change number of projects using constants YOG_SEARCH_MSG_FOUND_POSTS_0 YOG_SEARCH_MSG_FOUND_POSTS_1 YOG_SEARCH_MSG_FOUND_POSTS_2 using sprintf first parameter is number of projects / second type of objects, for example define(&#8216;YOG_SEARCH_MSG_FOUND_POSTS_2&#8217;, &#8216;%s woningen&#8217;);</li>\n</ul>\n<h4>1.3.22</h4>\n<ul>\n<li>Fixed: Synchronization errors caused when a post dlm is returned in the future;</li>\n<li>Fixed: Retrieve post dlm cast of a timestamp to a timestamp causing a random date in the far future;</li>\n</ul>\n<h4>1.3.21</h4>\n<ul>\n<li>Changed: Adding missing $postId variabele in yog_retrieveMainImage causing issues when not using the_loop</li>\n</ul>\n<h4>1.3.20</h4>\n<ul>\n<li>Changed: synchronisation optimizations</li>\n</ul>\n<h4>1.3.19</h4>\n<ul>\n<li>Changed: kadastrale kaart in no longer synchronized</li>\n</ul>\n<h4>1.3.18</h4>\n<ul>\n<li>Fixed: Price search using the sliders</li>\n</ul>\n<h4>1.3.17</h4>\n<ul>\n<li>Added: sort option &#8216;surface&#8217; to BOG search widget</li>\n<li>Added: search option surface max to BOG search widget</li>\n</ul>\n<h4>1.3.16</h4>\n<ul>\n<li>Changed: Sliders in searchfilters now have more clearification of the values contained (price euro sign / and m2 / m3 suffixes) just like the dropdown versions</li>\n<li>Changed: Sliders numbers are now being formatted</li>\n<li>Fixed: Touch support for the slider elements;</li>\n<li>Changed: In case a project has a price of EUR 1,- or EUR 99.999.999 it now shows as “op aanvraag”;</li>\n</ul>\n<h4>1.3.15</h4>\n<ul>\n<li>Fixed: issue when synchronizing images with image/pjpeg mime-type</li>\n<li>Changed: better check if synchronisation is already running.</li>\n</ul>\n<h4>1.3.14</h4>\n<ul>\n<li>Fixed: issue with search widgets</li>\n</ul>\n<h4>1.3.13</h4>\n<ul>\n<li>Added: search on price condition / min. surface to BOG search widget</li>\n<li>Added: address search widget</li>\n</ul>\n<h4>1.3.12</h4>\n<ul>\n<li>Fixed: synchronisation of objects without an address</li>\n</ul>\n<h4>1.3.11</h4>\n<ul>\n<li>Fixed: check on template files when using child theme</li>\n</ul>\n<h4>1.3.10</h4>\n<ul>\n<li>Added: option to use custom category taxanomy for objects</li>\n<li>Added: option to ignore extra texts</li>\n<li>Added: option to order objects by price, date or title (only within custom category taxanomy, or with search widget)</li>\n<li>Added: objets shortcode (for example: [yog-objects type=&#8221;huis&#8221; num=&#8221;5&#8243;])</li>\n</ul>\n<h4>1.3.9</h4>\n<ul>\n<li>Fixed: Issue with map loading info window details;</li>\n</ul>\n<h4>1.3.8</h4>\n<ul>\n<li>Fixed: Defer loading of the dojo library and removing define from the DOM before including the Dojo define;</li>\n<li>Changed: Dojo library only loaded when needed and not on all pages;</li>\n</ul>\n<h4>1.3.7</h4>\n<ul>\n<li>Added: Option to defer load the dojo library (in case of some jquery situation enqueing the dojo library causes problems)</li>\n</ul>\n<h4>1.3.6</h4>\n<ul>\n<li>Fixed: use of contact form widget inside the loop</li>\n</ul>\n<h4>1.3.5</h4>\n<ul>\n<li>Added: option to use selects instead of range for search widgets</li>\n</ul>\n<h4>1.3.4</h4>\n<ul>\n<li>Added: support for tags/roles/external js loading in Yes-co Contact Form widget</li>\n<li>Fixed: searching of NBpr objects with NBpr search widget</li>\n</ul>\n<h4>1.3.3</h4>\n<ul>\n<li>Added: Support for inline labels in Yes-co Contact Forms;</li>\n<li>Added: Support for embedding a Yes-co Contact Form in pages or posts using a shortcode;</li>\n</ul>\n<h4>1.3.2</h4>\n<ul>\n<li>Fixed: number of child objects shown</li>\n</ul>\n<h4>1.3.1</h4>\n<ul>\n<li>Changed: several minor synchronisation code optimalizations</li>\n</ul>\n<h4>1.3</h4>\n<ul>\n<li>Fixed: support for wordpress version 4.0</li>\n<li>Added: support for tags</li>\n<li>Added: support for BBpr/BBty (when future upgrade to 3mcp 1.4 is done)</li>\n<li>Changed: serveral code optimalizations</li>\n</ul>\n<h4>1.2.11</h4>\n<ul>\n<li>Added: support for both Yes-co 3mcp 1.3 and 1.4 (for future upgrade to 3mcp 1.4)</li>\n<li>Changed: BOG status determined based upon the General/ObjectStatus</li>\n<li>Changed: rewrote open house fields to html5 fields and fixed the store of it (when changed through WPadmin)</li>\n</ul>\n<h4>1.2.10</h4>\n<ul>\n<li>Fixed: embed url for youtube movies (so youtube uses HTML5 player instead of flash when possible)</li>\n</ul>\n<h4>1.2.9</h4>\n<ul>\n<li>Fixed: Open house time now displayed correctly for the timezone set in wp-admin</li>\n</ul>\n<h4>1.2.8</h4>\n<ul>\n<li>Changed: Embed code for YouTube now supports HTML5 display for iOS and other non flash devices/browsers;</li>\n</ul>\n<h4>1.2.7</h4>\n<ul>\n<li>Changed: Upgraded dojo from 1.8.3 to 1.9.3;</li>\n<li>Fixed: Issue caused by the map when using WordPress 3.9 or higher in combination with Bootstrap;</li>\n<li>Fixed: Issue with the info window on the maps;</li>\n</ul>\n<h4>1.2.6</h4>\n<ul>\n<li>Fixed: number of found objects of search form widgets when used on page without objects</li>\n</ul>\n<h4>1.2.5</h4>\n<ul>\n<li>Fixed: project upload folders are now also removed when project is revoked</li>\n<li>Fixed: Fatal error on WordPress 3.7</li>\n</ul>\n<h4>1.2.4</h4>\n<ul>\n<li>Fixed: Synchronization between Yes-co system and WordPress for WordPress 3.6.1</li>\n<li>Added: Technical documentation</li>\n</ul>\n<h4>1.2.3</h4>\n<ul>\n<li>Changed: Upgraded dojo from 1.5.0 to 1.8.3;</li>\n<li>Changed: Updated SvzMaps to version 0.6.2 using AMD Module system;</li>\n<li>Added: Widget to render a map with post types;</li>\n<li>Added: Shortcode to render a map within a post or page;</li>\n<li>Added: Ability to select the location of an object using a map;</li>\n<li>Added: Ability to generate a shortcode to use in a page or post using a map;</li>\n<li>Added: Support to add a location to the Relation objects;</li>\n<li>Fixed: Kantooruimte renamed to Kantoorruimte;</li>\n<li>Fixed: E_NOTICE for openhuis;</li>\n<li>Changed: Wonenobject now shows the Bijzonderheden as a readonly field;</li>\n<li>Fixed: Foto slider navigation to the right fixed for Firefox;</li>\n<li>Fixed: Sliders now work on touch based devices;</li>\n<li>Added: Theme&#8217;s can now influence the registration of categories when synchronizing projects by adding a function &#8220;yog_plugin_register_new_categories&#8221; and &#8220;yog_plugin_get_categories&#8221;;</li>\n</ul>\n<h4>1.2.2</h4>\n<ul>\n<li>Fixed: Objects without a price can now still be found through the Yes-co search widget</li>\n<li>Fixed: BOG rental price replacement is now also used by yog_retrievePrices</li>\n</ul>\n<h4>1.2.1</h4>\n<ul>\n<li>Fixed: synchronization when synchronization is done through CURL</li>\n<li>Fixed: display of max price of construction projects</li>\n<li>Fixed: template checks now display the correct template filename</li>\n</ul>\n<h4>1.2</h4>\n<ul>\n<li>Added: support for construction projects</li>\n</ul>\n<h4>1.1.4</h4>\n<ul>\n<li>Fixed: BOG taxes translation when taxes are not charged</li>\n</ul>\n<h4>1.1.3</h4>\n<ul>\n<li>Changed: added version number to js / css files to prevent loading old file from cache</li>\n<li>Fixed: yog_retrieveNormalImages would return max images</li>\n</ul>\n<h4>1.1.2</h4>\n<ul>\n<li>Added: options what to show with the &#8220;Yes-co Object Koppelingen&#8221; widget</li>\n<li>Added: functions to show only images with type &#8216;Plattegrond&#8217;</li>\n<li>Added: Price replacement to &#8216;Wonen&#8217; objects</li>\n<li>Changed: &#8216;verkoop&#8217; and/or &#8216;verhuur&#8217; category is now also based on the scenario (if no price is set)</li>\n<li>Fixed: Price replacement is shown instead of the price (when set)</li>\n</ul>\n<h4>1.1.1</h4>\n<ul>\n<li>Fixed: activation of plugin in Yes-co App Market</li>\n<li>Fixed: upload directory check</li>\n<li>Added: option to show custom posts on archive pages</li>\n<li>Added: on activation callback</li>\n</ul>\n<h4>1.1</h4>\n<ul>\n<li>Rewrote entire plugin</li>\n<li>Added BOG support</li>\n<li>More user friendly WP-admin interface</li>\n</ul>\n<h4>1.0.3</h4>\n<ul>\n<li>Fixed: when using multiple &#8220;Yes-co Contact formulier&#8221; widgets on the same page, only the posted widget will display the send message</li>\n</ul>\n<h4>1.0.2</h4>\n<ul>\n<li>Fixed: synchronization of object images on a mu like installation</li>\n</ul>\n<h4>1.0.1</h4>\n<ul>\n<li>Fixed: search widget in wordpress 3.1</li>\n</ul>\n<h4>1.0</h4>\n<ul>\n<li>Initial version</li>\n</ul>\n"
    },
    "short_description": "Directly post real estate objects from your Yes-co system to your wordpress blog with the Yes-co Open Real Estate System (Yes-co ORES) Plugin.",
    "description": "<h4>Yes-co Open Real Estate System WordPress Plugin</h4>\n<p>WordPress, voted the world&#8217;s most powerful website and blogging system, has now been made suitable for brokers and developers.<br />\nThis plugin is only available in dutch.</p>\n<h4>NL</h4>\n<p><strong>Woningen publiceren op je WordPress website</strong></p>\n<p>Yes-co ontwikkelde de Yes-co ORES WordPress plugin waardoor woning- en BOG-aanbod direct naar je WordPress website gepubliceerd kan worden.<br />\nOf je nu NVM-, VBO-, VastgoedPro- of onafhankelijk makelaar bent, je aanbod staat met 1 druk op de knop op je WordPress-blog</p>\n<p><strong>WordPress &amp; makelaar 2.0</strong></p>\n<p>Een WordPress website blog is zonder twijfel de slimst beschikbare technologie. Je combineert op deze manier een Website, Blog en Social media mogelijkheden. Kortom alle instrumenten die de moderne makelaar nodig heeft om zich te kunnen profileren, in 1 slim systeem.</p>\n<p><strong>De Yes-co ORES WordPress plugin is geschikt voor:</strong></p>\n<ul>\n<li>Makelaarswebsite</li>\n<li>Object website (een blog voor 1 woning, kan nu eenvoudig ..)</li>\n</ul>\n<p><strong>Over het Yes-co Open Real Estate Systeem</strong></p>\n<p>Als jij het belangrijk vindt om op jouw manier, met volledige vrijheid te werken, dan zit je bij Yes-co goed!<br />\nJe krijgt namelijk  een volledig en uitgebreid crm-systeem waarmee je je objecten &amp; relaties makkelijk kan beheren en vermarkten, voor een vast &amp; laag maandbedrag. Toch nog iets extra&#8217;s nodig?<br />\nDan beslis jij zelf, welk van de volledig geïntegreerde extra functionaliteiten, je wanneer gebruikt. En gebruik je ze niet? Dan betaal je ze ook niet! Zo bepaal je zelf  hoe Yes-co jouw bedrijf ondersteunt!<br />\nMeer weten? <a href=\"https://www.yes-co.nl/#demo-aanvragen\" title=\"Vraag een demo aan\" rel=\"nofollow ugc\">Vraag een demo aan</a>.</p>\n<h4>EN</h4>\n<p><strong>Homes publishing blog</strong></p>\n<p>Yes-co developed the Yes-co ORES WordPress plugin, which enables the publication of residential and commercial real estate directly from your Yes-co system to WordPress.<br />\nWhether you are a NVM-, VBO- or VastgoedPro-member or an independent broker, your portfolio is published to your WordPress-blog with just one click.</p>\n<p><strong>WordPress &amp; Broker 2.0</strong></p>\n<p>A WordPress website blog is without a doubt the smartest technology available. This way you can combine your Website, Blog and Social Media channels. In short: all the tools needed for a modern broker to present themselves, within one clever system.</p>\n<p><strong>The Yes-co ORES WordPress plugin is suitable for:</strong></p>\n<ul>\n<li>Real estate websites</li>\n<li>Property website (a blog for a house can now be realised easily)</li>\n</ul>\n<p><strong>About Yes-co Open Real Estate System</strong><br />\nIf you find it important to work in your own way, with complete freedom, then Yes-co is the right place for you!<br />\nYou get a complete and extensive CRM system with which you can easily manage and market your objects &amp; relations, for a fixed &amp; low monthly fee. Still need something extra?<br />\nThen you decide which of the fully integrated extra functionalities you use and when. If you don&#8217;t use it? Then you don&#8217;t pay for it either!<br />\nThis way you decide how Yes-co supports your company!<br />\nDo you want to know more? <a href=\"https://www.yes-co.nl/#demo-aanvragen\" title=\"Request a demo\" rel=\"nofollow ugc\">Request a demo</a>.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.84.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/yes-co-ores-wordpress-plugin/assets/screenshot-1.png?rev=781946",
            "caption": "Activate publications to your Wordpress blog in your Yes-co ORES"
        },
        {
            "src": "https://ps.w.org/yes-co-ores-wordpress-plugin/assets/screenshot-2.jpg?rev=781947",
            "caption": "Project dashboard Yes-co ORES"
        },
        {
            "src": "https://ps.w.org/yes-co-ores-wordpress-plugin/assets/screenshot-3.jpg?rev=781950",
            "caption": "Publish a project to your Wordpress blog"
        },
        {
            "src": "https://ps.w.org/yes-co-ores-wordpress-plugin/assets/screenshot-4.jpg?rev=781951",
            "caption": "Overview of projects on the Wordpress blog"
        },
        {
            "src": "https://ps.w.org/yes-co-ores-wordpress-plugin/assets/screenshot-5.jpg?rev=781953",
            "caption": "Project details on the Wordpress blog"
        },
        {
            "src": "https://ps.w.org/yes-co-ores-wordpress-plugin/assets/screenshot-6.png?rev=781954",
            "caption": "Overview of projects on the Wordpress Admin"
        }
    ],
    "tags": {
        "project": "project",
        "projecten": "projecten",
        "projects": "projects",
        "yes-co": "yes-co",
        "yesco": "yesco"
    },
    "stable_tag": "1.3.84",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.0.zip",
        "1.0.1": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.0.1.zip",
        "1.0.2": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.0.2.zip",
        "1.0.3": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.0.3.zip",
        "1.1": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.1.zip",
        "1.1.1": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.1.1.zip",
        "1.1.2": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.1.2.zip",
        "1.1.3": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.1.3.zip",
        "1.1.4": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.1.4.zip",
        "1.2": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.2.zip",
        "1.2.1": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.2.1.zip",
        "1.2.11": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.2.11.zip",
        "1.2.2": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.2.2.zip",
        "1.2.3": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.2.3.zip",
        "1.2.4": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.2.4.zip",
        "1.2.5": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.2.5.zip",
        "1.2.6": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.2.6.zip",
        "1.3": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.1.zip",
        "1.3.10": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.10.zip",
        "1.3.11": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.11.zip",
        "1.3.12": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.12.zip",
        "1.3.13": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.13.zip",
        "1.3.16": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.16.zip",
        "1.3.17": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.17.zip",
        "1.3.19": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.19.zip",
        "1.3.2": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.2.zip",
        "1.3.20": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.20.zip",
        "1.3.23": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.23.zip",
        "1.3.24": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.24.zip",
        "1.3.25": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.25.zip",
        "1.3.27": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.27.zip",
        "1.3.28": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.28.zip",
        "1.3.30": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.30.zip",
        "1.3.31": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.31.zip",
        "1.3.32": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.32.zip",
        "1.3.34": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.34.zip",
        "1.3.36": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.36.zip",
        "1.3.4": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.4.zip",
        "1.3.44": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.44.zip",
        "1.3.45": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.45.zip",
        "1.3.46": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.46.zip",
        "1.3.47": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.47.zip",
        "1.3.50": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.50.zip",
        "1.3.51": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.51.zip",
        "1.3.53": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.53.zip",
        "1.3.54": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.54.zip",
        "1.3.59": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.59.zip",
        "1.3.60": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.60.zip",
        "1.3.69": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.69.zip",
        "1.3.70": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.70.zip",
        "1.3.74": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.74.zip",
        "1.3.84": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.84.zip",
        "1.3.9": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.1.3.9.zip",
        "trunk": "https://downloads.wordpress.org/plugin/yes-co-ores-wordpress-plugin.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "default": "https://s.w.org/plugins/geopattern-icon/yes-co-ores-wordpress-plugin.svg"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 0,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}