{
    "name": "YouTube Embed",
    "slug": "youtube-embed",
    "version": "5.3.1",
    "author": "<a href=\"https://wordpress.org/support/users/squared/\">YouTube Embed</a>",
    "author_profile": "https://profiles.wordpress.org/squared/",
    "contributors": {
        "dartiss": {
            "profile": "https://profiles.wordpress.org/dartiss/",
            "avatar": "https://secure.gravatar.com/avatar/2cbdbce479741babc9018aaa1a4cec67?s=96&d=monsterid&r=g",
            "display_name": "David Artiss"
        },
        "squared": {
            "profile": "https://profiles.wordpress.org/squared/",
            "avatar": "https://secure.gravatar.com/avatar/507d9e2bf68160edceb3ae67b0d8fa2a?s=96&d=monsterid&r=g",
            "display_name": "YouTube Embed Plugin Support"
        }
    },
    "requires": "4.6",
    "tested": "6.4.5",
    "requires_php": "7.4",
    "requires_plugins": [],
    "compatibility": [],
    "rating": 84,
    "ratings": {
        "5": 19,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 5
    },
    "num_ratings": 24,
    "support_url": "https://wordpress.org/support/plugin/youtube-embed/",
    "support_threads": 0,
    "support_threads_resolved": 0,
    "active_installs": 10000,
    "downloaded": 748537,
    "last_updated": "2024-01-15 13:50:00",
    "added": "2010-01-13",
    "homepage": "https://wordpress.org/plugins/youtube-embed/",
    "sections": {
        "description": "<p>YouTube Embed is an incredibly fast, simple, yet powerful, method of embedding YouTube videos into your WordPress site.</p>\n<p><strong>NOTE: This plugin supports the ability to insert the standard YouTube embed and playlist players. However, if you need to embed a YouTube facade, livestream, or gallery, we recommend the <a href=\"https://www.embedplus.com/\" rel=\"nofollow ugc\">EmbedPlus.com</a> plugin that&#8217;s freely available <a href=\"https://wordpress.org/plugins/youtube-embed-plus/\" rel=\"ugc\">here</a>.  It&#8217;s been around for many years and is highly trusted.</strong></p>\n<p>Key features include&#8230;</p>\n<ul>\n<li>Build your own playlists and play them back however you want</li>\n<li>Automatically generate playlists based on user name</li>\n<li>Create multiple profiles &#8211; use them for different videos to get the exact style that you want</li>\n<li>Dynamic video sizing for responsive sites</li>\n<li>Housekept caching keeps the code generation nimble and your database tables slimline</li>\n<li>Google compatible metadata is added to the video output based on data provided by the YouTube API &#8211; great for SEO!</li>\n<li>Support for Do Not Track</li>\n<li>Compatible with <a href=\"http://yoast.com/wordpress/video-seo/\" title=\"Video SEO for WordPress\" rel=\"nofollow ugc\">Video SEO for WordPress</a>, <a href=\"https://wordpress.org/plugins/a3-lazy-load/\" title=\"a3 lazy load\" rel=\"ugc\">a3 lazy load</a> and <a href=\"https://wordpress.org/plugins/video-overlay-ads/\" title=\"WordPress Video Overlay Ads\" rel=\"ugc\">WordPress Video Overlay Ads</a> and many more. In the case of Video SEO and WordPress Video Overlay Ads, their options will even appear under the YouTube Embed menu for total simplicity!</li>\n<li>Use <a href=\"https://www.turnoffthelights.com/\" title=\"Turn Off The Lights\" rel=\"nofollow ugc\">Turn Off The Lights</a>? This plugin works with it beautifully.</li>\n<li><a href=\"https://github.com/davidjbradshaw/iframe-resizer\" title=\"iFrame Resizer\" rel=\"nofollow ugc\">iFrame Resizer</a> and <a href=\"https://github.com/davatron5000/FitVids.js\" title=\"FitVids.js\" rel=\"nofollow ugc\">FitVids.js</a> supported to improve content resizing</li>\n<li>Works &#8220;out of the box&#8221; with 4K, 60FPS and Chromecast &#8211; stream your embedded videos to your TV!</li>\n<li>And much, much more!</li>\n</ul>\n<p>👉 Please visit the <a href=\"https://github.com/squaredcode/youtube-embe\" title=\"Github\" rel=\"nofollow ugc\">Github page</a> for the latest code development, planned enhancements and known issues 👈</p>\n<h3>🚦 Getting Started</h3>\n<p>How easy is it to use? The fine people at <a href=\"https://www.webucator.com\" title=\"Webucator\" rel=\"nofollow ugc\">Webucator</a> have put together an excellent video showing you how to get started with it..</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Wc7cvpQS-xQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>To add a video to a post or page simply use the shortcode <code>[youtube]video[/youtube]</code>, where <code>video</code> is the ID or URL of the YouTube video. Alternatively, you can add one (or more) widgets to your sidebar.</p>\n<p>If you&#8217;re not sure what the video ID is, please head to the FAQ section where it&#8217;s explained in greater detail!</p>\n<p>Within the administration area, click on the Settings menu option and then YouTube Embed to view and edit the generic settings for the plugin. Also under the YouTube Embed menu (see screenshot 1) you can click on the Profiles sub-menu to set the default options which define the output of your videos. Any videos you display (unless overridden by parameters &#8211; more on that later) will use the settings from the Profiles screen.</p>\n<p>Although this document contains a lot of information more is provided on the various administration pages. Whilst on the administration pages, click on the &#8220;Help&#8221; button in the top right for some useful tips and links. If anything isn&#8217;t covered and you&#8217;re unsure of what it does please ask <a href=\"https://wordpress.org/support/plugin/youtube-embed\" title=\"WordPress Plugins Forum\" rel=\"ugc\">on the forum</a>.</p>\n<h3>🔑 Creating an API Key</h3>\n<p>At the top of the <code>YouTube Embed Settings</code> administration screen is an option to specify an API key. This is optional but many of the features of this plugin &#8211; including accurate video information being added to the metadata &#8211; will not be available without it. Thankfully an API key is easy to get and is free.</p>\n<ol>\n<li>Head to the <a href=\"https://console.developers.google.com/cloud-resource-manager\" title=\"Developers Console\" rel=\"nofollow ugc\">YouTube Developers Console</a></li>\n<li>Click on CREATE PROJECT</li>\n<li>Once created, head into it</li>\n<li>In the APIs box, click on &#8220;Go to APIs overview&#8221;</li>\n<li>Click on &#8220;ENABLE APIS AND SERVICES&#8221; at the top of the screen</li>\n<li>You can now choose your API &#8211; click on YouTube Data API v3</li>\n<li>Click the &#8220;ENABLE&#8221; button</li>\n<li>Click on &#8220;CREATE CREDENTIALS&#8221;</li>\n<li>On the drop-downs, choose the API we selected before, &#8220;Web browser and &#8220;Public data&#8221;</li>\n<li>You will now be presented with your API key</li>\n</ol>\n<p>The API key can now be pasted into the settings in WP Admin.</p>\n<h3>Further embedding options</h3>\n<p>A basic shortcode will embed your video using your default profile settings. However, you may wish to override some of these options on a video-by-video basis &#8211; this is done via parameters added to the shortcode.</p>\n<p>e.g. <code>[youtube width=300 height=200]Z_sCoHGIpU0[/youtube]</code></p>\n<p>Which options are available depends upon the users&#8217;s set-up (for example, whether they have Flash installed or not). You can specify any of the parameters but they may be ignored. Please see the Profile screen in Administration for further details on any restrictions which may exist.</p>\n<ul>\n<li><strong>annotation</strong> &#8211; yes or no, this determines if annotations are shown</li>\n<li><strong>autoplay</strong> &#8211; yes or no, should the video automatically start playing?</li>\n<li><strong>cc</strong> &#8211; yes or no, decided whether closed captions are displayed. If you don&#8217;t specify anything then the user&#8217;s default will be used.</li>\n<li><strong>cc_lang</strong> &#8211; Closed captions language. Select a <a href=\"http://www.loc.gov/standards/iso639-2/php/code_list.php&quot;\" rel=\"nofollow ugc\">ISO 639-1 two-letter language code</a> or leave blank for the default</li>\n<li><strong>color</strong> &#8211; white or red, the color of the progress bar (see the FAQ about having a white progress bar with the light theme)</li>\n<li><strong>controls</strong> &#8211; 0, 1 or 2, this decides whether the controls should display and when the Flash will load. A value of 0 will not show the controls but 1 or 2 will. A value of 2 will load Flash once the user initiates playback &#8211; otherwise it&#8217;s loaded straight away.</li>\n<li><strong>disablekb</strong> &#8211; yes or no, switch off keyboard controls</li>\n<li><strong>fullscreen</strong> &#8211; yes or no, this will add the fullscreen button to the toolbar</li>\n<li><strong>height</strong> &#8211; the video height, in pixels</li>\n<li><strong>language</strong> &#8211; The interface language. The parameter value is an <a href=\"http://www.loc.gov/standards/iso639-2/php/code_list.php&quot;\" rel=\"nofollow ugc\">ISO 639-1 two-letter language code</a> or a fully specified locale. Leave blank for the default</li>\n<li><strong>list</strong> &#8211; if you&#8217;ve specified your own list, use this to select the way the videos should be output. Should be <code>random</code> (display videos in a random order), <code>single</code> (show just one video, randomly picked from the list) or <code>order</code> (show each video in the original order &#8211; this is the default)</li>\n<li><strong>loop</strong> &#8211; yes or no, whether to start the video again once it ends</li>\n<li><strong>modest</strong> &#8211; reduce the branding on the video</li>\n<li><strong>playsinline</strong> &#8211; whether videos play inline or fullscreen in an HTML5 player on iOS.</li>\n<li><strong>profile</strong> &#8211; specify a different default profile (see section on Profiles for further details)</li>\n<li><strong>ratio</strong> &#8211; allows you to define a window ratio &#8211; specify just a height or width and the ratio will calculate the missing dimension. Uses the format x:x, e.g. 4:3, 16:9</li>\n<li><strong>related</strong> &#8211; yes or no, show related videos</li>\n<li><strong>responsive</strong> &#8211; whether to use responsive output or not. When switched on the video will resize when your site does (i.e. responsive). If a video width is supplied this will be the maximum width, otherwise full width will be assumed. Height is ignored and will be worked out automatically.</li>\n<li><strong>start</strong> &#8211; a number of seconds from where to start the video playing</li>\n<li><strong>stop</strong> &#8211; this stops the video at a specific time, given in seconds</li>\n<li><strong>style</strong> &#8211; apply CSS elements directly to the video output</li>\n<li><strong>template</strong> &#8211; specify a template (see section on Templates for further details)</li>\n<li><strong>user</strong> &#8211; yes or no, create a playlist based on a user&#8217;s uploads. The search word should be specified instead of a video ID. See &#8220;Automatically Generate Playlists&#8221; option for more details</li>\n<li><strong>width</strong> &#8211; the video width, in pixels</li>\n</ul>\n<h3>Alternative Shortcodes</h3>\n<p>Within Administration, selecting Settings -&gt; YouTube Embed will provide a list of generic options. One option is named <code>Alternative Shortcode</code> and allows you to specify another shortcode that will work exactly the same as the standard shortcode of <code>[youtube]]</code>.</p>\n<p>There are 2 reasons why you might want to do this&#8230;</p>\n<ol>\n<li>If migrating from another plugin, it may use a different shortcode</li>\n<li>If another plugin uses the same shortcode (e.g. Jetpack) this will allow you to specify and use an alternative</li>\n</ol>\n<p>The new shortcode can also have its own default profile assigned to it (see the Profiles section for more details on this).</p>\n<h3>Widgets</h3>\n<p>Widgets can be easily added. In Administration simply click on the Widgets option under the Appearance menu. YouTube Embed will be one of the listed widgets. Drag it to the appropriate sidebar on the right hand side and then choose your video options &#8211; any that aren&#8217;t specified are taken from your supplied profile. It&#8217;s best to have a profile set-up specifically for widgets!</p>\n<p>If you wish to display an automatically generated playlist based on user name, simply change the &#8220;ID Type&#8221; appropriately and then specify the name where the video ID would normally be entered.</p>\n<p>And that&#8217;s it! You can use unlimited widgets, so you can add different videos to different sidebars.</p>\n<h3>Playlists</h3>\n<p>YouTube allows users to create their own playlists &#8211; collections of videos that can be played in sequence. These are embedded in the same way, by supplying the playlist ID.</p>\n<p>e.g. <code>[[youtube]PLVTLbc6i-h_iuhdwUfuPDLFLXG2QQnz-x[/youtube]</code></p>\n<p>An alternative to the YouTube build playlists is the build-in lists function &#8211; see the Lists section for further details.</p>\n<h3>Templates</h3>\n<p>Both in the profile and as a parameter you can specify a template. This allows you to define any CSS that you wish to &#8220;wrap&#8221; around the YouTube output.</p>\n<p>The template consists simply of your choice of HTML but with <code>%video%</code> where you wish the video to appear.</p>\n<p>e.g. <code>&lt;div align=\"center\"&gt;%video%&lt;/div&gt;</code></p>\n<p>For reasons of security, only specific HTML tags are valid &#8211; these are a, br, div, img, p span and strong. If there are any others that you&#8217;d like to have added, please let me know via the forum.</p>\n<h3>Profiles</h3>\n<p>You&#8217;ve probably already had a look at the default profile, accessible by selecting Profiles from the YouTube Embed Administration menu option. Here you can specify the default option which will apply to any embedded video.</p>\n<p>However, in the top right hand corner is a drop-down box and a button marked Change profile. Simply select an alternative profile and click the button and you can then edit the options for this alternative profile. You can even name it as well.</p>\n<p>To use this profile, simply use the parameter <code>profile=</code> followed by the profile name or number. The options for this profile will then be used.</p>\n<p>This could be useful, for instance, for having a separate profile for different parts of your site &#8211; posts, sidebar, etc &#8211; or for different video types (e.g. widescreen).</p>\n<p>By default you have 5 extra profiles &#8211; if you wish to have more (or less) this number can be changed from the YouTube Embed settings screen.</p>\n<h3>📝 Lists</h3>\n<p>Although this plugin will play standard YouTube playlists their playback options are limited. Instead you can create your own video lists. Under the YouTube Embed administration menu is a sub-menu named Lists. Select this and you will be shown a screen where you can type in a list of video IDs (or URLS). You can also provide a name for the list.</p>\n<p>When saving the list each video is validated.</p>\n<p>As with profiles you can select the list from a drop down in the top right-hand corner. You can also change the number of lists from the Options sub-menu too.</p>\n<p>To use a list, simply specify the list name or number instead of a video ID, as well as a parameter to specify how you wish the list to be played back.</p>\n<p>e.g. <code>[youtube list='order']List 1[/youtube]</code></p>\n<p>The list parameter allows to to either play each in turn, play them randomly, or have just one played (but picked randomly).</p>\n<p>An option within the general options screen allows you to change whether this parameter MUST be used. If switched on, you will gain a performance increase, otherwise the plugin has no way of knowing if you&#8217;re asking for a playlist so must verify the ID you&#8217;ve specified against all your lists.</p>\n<h3>Automatically Generated Playlists</h3>\n<p>YouTube includes options to automatically generate playlists based upon a user name.</p>\n<p>To use, simply use the <code>user</code> parameter to switch the appropriate option on. Then, instead of a video ID or URL, you should specify the user name.</p>\n<h3>📏 Third Party Resizing Scripts</h3>\n<p>Within the YouTube Embed settings screen there is an option to set a third party resizing script &#8211; either <a href=\"https://github.com/davidjbradshaw/iframe-resizer\" title=\"iFrame Resizer\" rel=\"nofollow ugc\">iFrame Resizer</a> or <a href=\"https://github.com/davatron5000/FitVids.js\" title=\"FitVids.js\" rel=\"nofollow ugc\">FitVids.js</a>. These work alongside the existing IFRAME but try and improve the output, particularly with regard to how the output is sized.</p>\n<p>There are no guarantees with these and no support of their specific functionality is provided. However, if the video output is wrong then it&#8217;s worth trying these.</p>\n<h3>🏙 Thumbnails</h3>\n<p>YouTube Embed also has the ability to return a thumbnail of a video (sorry, this doesn&#8217;t work with playlists).</p>\n<p>To use the shortcode method, insert <code>[youtube_thumb]id[/youtube_thumb]</code> into a post or page to create a thumbnail of the relevant video ID which, once clicked, will open up the appropriate YouTube page.</p>\n<p>You can specify a number of parameters&#8230;</p>\n<ul>\n<li><strong>alt</strong> &#8211; specify some <code>ALT</code> text for the thumbnail image</li>\n<li><strong>rel</strong> &#8211; specify a REL override, e.g. rel=&#8221;nofollow&#8221;</li>\n<li><strong>target</strong> &#8211; specify a TARGET override, e.g. target=&#8221;_blank&#8221;</li>\n<li><strong>width</strong> &#8211; this specifies the width of the thumbnail image</li>\n<li><strong>height</strong> &#8211; this specifies the height of the thumbnail image</li>\n<li><strong>nolink</strong> &#8211; if set to <code>true</code>, will output the thumbnail without a link to the YouTube video, allowing you to add your own</li>\n<li><strong>version</strong> &#8211; which version of the thumbnail to use. This can be <code>default</code> (120&#215;90), <code>medium</code> (320&#215;180), <code>high</code> (480&#215;360), <code>standard</code> (640&#215;480) or <code>maxres</code></li>\n<li><strong>version</strong> &#8211; which version of the thumbnail to use. This can be <code>default</code> (120&#215;90), <code>medium</code> (320&#215;180), <code>high</code> (480&#215;360), <code>standard</code> (640&#215;480) or <code>maxres</code></li>\n</ul>\n<p>e.g. <code>[youtube_thumb target=\"_blank\" alt=\"Demo video\"]id[/youtube_thumb]</code></p>\n<p>This overrides the <code>TARGET</code> and <code>ALT</code> elements of the thumbnail.</p>\n<h3>🗜 Shortened URL</h3>\n<p>You may return a short URL for any YouTube video by simply inserting <code>[youtube_url id=xx]</code> anywhere within a post. <code>xx</code> is the ID of the video.</p>\n<h3>⬇️ Downloading Videos</h3>\n<p>If you wish your users to be able to download a YouTube video or playlist then you can do this automatically.</p>\n<p>In the Profiles screen within administration there is an option to automatically show a download link. You can specify some text or HTML to display as well as CSS. If you&#8217;d prefer to do this manually then you can use the shortcode <code>download_video</code>. The content to link is specified between the open and close shortcode tags and there are 3 parameters&#8230;</p>\n<ul>\n<li><strong>id</strong> &#8211; The ID of the video or playlist. This is required.</li>\n<li><strong>target</strong> &#8211; The target of the link (e.g. <code>_blank</code>). This is optional.</li>\n<li><strong>nofollow</strong> &#8211; yes or no, use this to specify whether a <code>nofollow</code> tag should be added to the link. This is optional and by default it will be included.</li>\n</ul>\n<p>e.g. <code>[download_video id=\"Z_sCoHGIpU0\" target=\"_blank\"]Download the video[/download_video]</code></p>\n<h3>ℹ️ Video Information</h3>\n<p>The shortcode of <code>vinfo</code> can be used to output useful video information. Simple pass the video ID using the parameter of <code>id</code> and then add any text between the opening and closing shortcode. If this text contains any of the following tags then they will be replaced with the relevant video information&#8230;</p>\n<ul>\n<li>%title% &#8211; the title of the video</li>\n<li>%description% &#8211; the video description</li>\n<li>%url% &#8211; a link to the video on YouTube</li>\n<li>%shorturl% &#8211; a shorturl of the video</li>\n<li>%download% &#8211; a link to a site where the video can be downloaded</li>\n<li>%thumb_default% &#8211; URL of a thumbnail image 120&#215;90 pixels in size</li>\n<li>%thumb_medium% &#8211; URL of a thumbnail image 320&#215;180 pixels in size</li>\n<li>%thumb_high% &#8211; URL of a thumbnail image 480&#215;360 pixels in size</li>\n<li>%thumb_standard% &#8211; URL of a thumbnail image 640&#215;480 pixels in size</li>\n<li>%thumb_maxres% &#8211; URL of a thumbnail image the biggest it can be, based on the original video size</li>\n</ul>\n<p>These tags can be included in URLs as well. For example, if you added the following in the HTML view&#8230;</p>\n<pre><code>[vinfo id=\"Z_sCoHGIpU0\"]&lt;a href=\"%url%\"&gt;&lt;img src=\"%thumb_default%\"&gt;&lt;/a&gt;[/vinfo]\n</code></pre>\n<p>This would display a 120&#215;90 pixel thumbnail with a clickable link to the original video.</p>\n<h3>Other Settings</h3>\n<p>Under the Settings menu s a sub-menu named YouTube Embed. Select this and find the section named Embedding. There are 2 options here that have not been covered already&#8230;</p>\n<ol>\n<li>Add Metadata &#8211; by default, RDFa metadata is added to video output. This can be switched on or off as required (see the FAQs for more information about metadata usage).</li>\n<li>Feed &#8211; videos will not appear in feeds so use this option to decide whether you want them to be converted to links and/or thumbnails.</li>\n</ol>\n<h3>♥️ Reviews &amp; Mentions</h3>\n<ul>\n<li><a href=\"https://twitter.com/AaronWatters/status/237957701605404672?uid=16257815&amp;iid=am-130280753913455685118891763&amp;nid=4+248\" title=\"Twitter - Aaron Watters\" rel=\"nofollow ugc\">Your YouTube Plugin is fantastic-it just saved my life on this site. Thank you!</a> &#8211; Sonic Clamp</li>\n<li><a href=\"http://www.socialtimes.com/2011/03/new-technology-finds-the-most-buzzed-about-parts-of-videos-interview/\" title=\"New Technology Finds The Most Buzzed-About Parts Of Videos\" rel=\"nofollow ugc\">New Technology Finds The Most Buzzed-About Parts Of Videos</a> &#8211; SocialTimes</li>\n<li><a href=\"http://andershagstrom.se/andesch-tipsar-om-wordpress-plugins/\" title=\"Andesch tipsar om WordPress-plugins!\" rel=\"nofollow ugc\">Andesch tips on WordPress plugins!</a> &#8211; Anders</li>\n<li><a href=\"http://www.bikinginmemphis.com/2011/03/26/critical-mass/\" title=\"Critical Mass\" rel=\"nofollow ugc\">Critical Mass</a> &#8211; Biking in Memphis</li>\n</ul>\n",
        "installation": "<p>YouTube Embed can be found and installed via the Plugin menu within WordPress administration (Plugins -&gt; Add New). Alternatively, it can be downloaded from WordPress.org and installed manually&#8230;</p>\n<ol>\n<li>Upload the entire <code>youtube-embed</code> folder to your <code>wp-content/plugins/</code> directory.</li>\n<li>Activate the plugin through the &#8216;Plugins&#8217; menu in WordPress administration.</li>\n</ol>\n<p>Voila! It&#8217;s ready to go.</p>\n",
        "faq": "\n<dt id='i%27ve%20upgraded%20to%20version%204%20%28or%20above%29%20from%20an%20earlier%20version%20and%20i%20was%20using%20the%20widget%20feature%20to%20display%20videos'>\nI&#8217;ve upgraded to version 4 (or above) from an earlier version and I was using the widget feature to display videos\n</h4>\n<p>\n<p>I previously allowed some, although not all, parameters to be specified within the widget. However, as you can simply create your own profile for widgets I have removed this and, without leaving lots of redundant code behind, it was difficult to keep this backwards compatible.</p>\n<p>Therefore, if you&#8217;re upgrading you may find your widgets don&#8217;t now display correctly. The best thing to do, beforehand if you can, is to create a profile just for the widgets and assign that to each. You&#8217;ll probably find the video size is the bit most likely to cause issues. Apologies for this.</p>\n</p>\n<dt id='how%20do%20i%20find%20the%20id%20of%20a%20youtube%20video%3F'>\nHow do I find the ID of a YouTube video?\n</h4>\n<p>\n<p>If you play a YouTube video, look at the URL &#8211; it will probably look something like this &#8211; <code>http://www.youtube.com/watch?v=L5Y4qzc_JTg</code>.</p>\n<p>The video ID is the list of letters and numbers after <code>v=</code>, in this case <code>L5Y4qzc_JTg</code>.</p>\n</p>\n<dt id='the%20video%20output%20is%20overlapping%20or%20stuttering'>\nThe video output is overlapping or stuttering\n</h4>\n<p>\n<p>If you go into the Profile screen in Administration there is a &#8220;Window Mode&#8221; option. This defines how Flash output interacts with any other around it. &#8220;Window&#8221; is the default and gives good performance but may cause overlapping. If overlapping is causing an issue try &#8220;Opaque&#8221;.</p>\n</p>\n<dt id='i%27m%20getting%20an%20error%20saying%20that%20%22an%20alternative%20plugin%20is%20using%20the%20%5B%5Byoutube%5D%5D%20shortcode%22'>\nI&#8217;m getting an error saying that &#8220;an alternative plugin is using the [youtube] shortcode&#8221;\n</h4>\n<p>\n<p>As this suggests another plugin that you have installed is using the same shortcode as YouTube Embed. That means that use of the <code>youtube</code> shortcode won&#8217;t work. You have 2 possible actions to take&#8230;</p>\n<ol>\n<li>Disable the conflicting plugin. If it&#8217;s Jetpack then you can disable the Shortcode Embeds module.</li>\n<li>Leave it as it is and use the option to use a second shortcode with this plugin. Head to the YouTube Embed settings screen and you can set up a secondary shortcode. You can also switch off the nag message too from here.</li>\n</ol>\n</p>\n<dt id='the%20%22autostart%22%20feature%20is%20not%20working%20in%20ios'>\nThe &#8220;autostart&#8221; feature is not working in iOS\n</h4>\n<p>\n<p>Unfortunately, this is a restriction that has been put in place by Apple.</p>\n</p>\n<dt id='i%20can%27t%20get%20the%20video%20to%20play%20at%20a%20specific%20resolution%20by%20default'>\nI can&#8217;t get the video to play at a specific resolution by default\n</h4>\n<p>\n<p>There is no way to specify this &#8211; YouTube makes the decision on which version to play depending on a number of factors.</p>\n</p>\n<dt id='there%20are%20black%20borders%20on%20top%2Funderneath%20my%20video'>\nThere are black borders on top/underneath my video\n</h4>\n<p>\n<p>This is usually due to using a different ratio than the video was designed for. If you&#8217;re not sure which ratio to use head to its page on YouTube, click on Share and then Embed and then Show More. A video size will be shown, which you can use to work out the correct ration for the video.</p>\n</p>\n<dt id='the%20controls%20under%20the%20video%20don%27t%20display%20properly%20when%20using%20firefox'>\nThe controls under the video don&#8217;t display properly when using Firefox\n</h4>\n<p>\n<p>This is a bug in Firefox. Short term, switch on SSL in the Profiles screen and it will work. Longer term, I&#8217;ve <a href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=1223515\" title=\"Bug 1223515 - Broken images in YouTube embedded player when not using SSL\" rel=\"nofollow ugc\">raised a bug report with Mozilla</a>.</p>\n</p>\n<dt id='the%20generated%20code%20does%20not%20cleanly%20validate'>\nThe generated code does not cleanly validate\n</h4>\n<p>\n<p>No, by default it doesn&#8217;t but it works absolutely fine as it. However, if you really must cleanly validate against HTML5 or transitional XHTML then head into the YouTube Embed settings screen and you&#8217;ll find an option to &#8220;Improve Validation&#8221;. Tick this and Save and it should validate&#8230;. UNLESS you have the metadata option switched on, in which case it won&#8217;t validate still. Switch that off though and you&#8217;re 100%.</p>\n<p>One thing to note &#8211; by switching on &#8220;Improve Validation&#8221; you&#8217;ll extend the length of the URL line that&#8217;s passed to YouTube. Please see the next FAQ to understand this better.</p>\n</p>\n<dt id='i%27m%20getting%20the%20error%20%22the%20maximum%20url%20length%20has%20been%20exceeded%22%20when%20trying%20to%20view%20a%20video'>\nI&#8217;m getting the error &#8220;The maximum URL length has been exceeded&#8221; when trying to view a video\n</h4>\n<p>\n<p>When embedding a video a URL for YouTube is generated &#8211; this contains all the non-default parameters that you&#8217;ve specified and, if you&#8217;ve created a manual playlist, all of the video IDs. Unfortunately, URLs can only be 2000 characters in size. If this is exceeded you&#8217;ll get the above error message when you try and view the video.</p>\n<p>The solution is to reduce this down by reducing down your playlist or, if you have the &#8220;Improve Validation&#8221; settings switched on, switching that back off.</p>\n</p>\n<dt id='i%20have%20another%20issue%20or%20a%20request'>\nI have another issue or a request\n</h4>\n<p>\n<p>Before reporting it please bear in mind that this plugin uses the standard YouTube API. Adding extra functionality to the player itself is not possible and there are <a href=\"https://code.google.com/p/gdata-issues/issues/list?q=label:API-YouTube\" title=\"YouTube API Known Issues\" rel=\"nofollow ugc\">known issues</a> with it. I would also recommend performing a Google search for your issue too first, as this will often resolve a lot of queries.</p>\n</p>\n\n",
        "changelog": "<p>I use semantic versioning, with the first release being 1.0.</p>\n<h4>5.3.1</h4>\n<ul>\n<li>Maintenance: Update made to plugin meta</li>\n</ul>\n<h4>5.3</h4>\n<ul>\n<li>Enhancement: Added some new, shinier meta to the plugin file. It doesn&#8217;t do anything other than make me look like a slightly more competent developer. Just</li>\n<li>Maintenance: I retired the <code>showinfo</code> parameter some time ago but, like some poor cleaner, sweeping things under the bed, I left some remnants behind &#8211; I&#8217;ve now cleaned those up properly</li>\n<li>Maintenance: Google has got rid of the search option. Boo. So, I&#8217;ve removed all the options for that. Sorry, but blame those people who &#8220;do no evil&#8221;</li>\n<li>Maintenance: Removed the code that added debug output to your HTML. This way, your page output is slightly smaller. Small is mighty, don&#8217;t forget!</li>\n<li>Bug: The <code>start</code> and <code>stop</code> parameters had stopped working. I&#8217;ve fixed this oversight.</li>\n<li>Bug: Fixed some escaping I was using &#8211; I was missing a parameter but, as it turned out, it was the wrong type to use anyway. So, corrected that.</li>\n</ul>\n<h4>5.2.4</h4>\n<ul>\n<li>Enhancement: As per <a href=\"https://wordpress.org/support/topic/important-update-the-future-of-this-plugin-4/\" rel=\"ugc\">my support post</a>, I&#8217;m winding down work on this plugin. The best alternative is EmbedPlus, so I&#8217;m adding some links to the plugin to direct users to that</li>\n</ul>\n<h4>5.2.3</h4>\n<ul>\n<li>Enhancement: Compatibility with PHP 8 and above</li>\n</ul>\n<h4>5.2.2</h4>\n<ul>\n<li>Enhancement: A second attempt to fix that pesky vulnerability. Hopefully, all should now be well</li>\n</ul>\n<h4>5.2.1</h4>\n<ul>\n<li>Enhancement: Fixed a security vulnerability where the shortcode attributes not being escaped/validated. Thanks to <a href=\"https://github.com/apple502j\" rel=\"nofollow ugc\">apple502j</a> for reporting this, via <a href=\"http://wpscan.com/\" rel=\"nofollow ugc\">WPScan</a></li>\n</ul>\n<h4>5.2</h4>\n<ul>\n<li>Enhancement: What have I been doing during the pandemic? Picking through this code and resolving coding standards. Sigh. There&#8217;s a LOT. Not all are done but will be in future updates but, for now, the majority are. Based on the amount of code I&#8217;ve had to change, I&#8217;m worried I&#8217;ve broken something. But, you know, every day&#8217;s a school day and this has taught me a LOT</li>\n<li>Enhancement: Look, I know I keep moving it but the plugin settings really shouldn&#8217;t be anywhere other than under the Settings menu. So I&#8217;ve moved it back there</li>\n<li>Enhancement: Added native lazy loading to the videos. I&#8217;ll maybe look to add it to the thumbnails at a later time &#8211; does anybody want that?</li>\n<li>Enhancement: I&#8217;ve improved the cache key generation. But, what this does mean, is that updating will cause all your YouTube Embed caches to clear. All your cache are belong to us </li>\n<li>Enhancement: Clarified the API sign-up process in the README</li>\n</ul>\n<h4>5.1.1</h4>\n<ul>\n<li>Enhancement: Added extra plugin meta</li>\n<li>Bug: The URL separator was not always correct &#8211; it still seemed to work but it was sloppy</li>\n<li>Bug: Reduced the top padding on videos</li>\n<li>Bug: Single-video looping was not working due a change in how YouTube nows processes them (they now have to be single-video playlists for them to loop. Yeah, I know)</li>\n</ul>\n<h4>5.1</h4>\n<ul>\n<li>Enhancement: Now supports specifying the language for the closed captions</li>\n<li>Enhancement: Moved interface language option from the settings screen to profiles</li>\n<li>Enhancement: You can now head to the settings screen and specify your own videos to be used on the profile screen</li>\n<li>Enhancement: Added option to allow the Closed Caption language to be specified</li>\n<li>Enhancement: Removed option in profile page to view an example 3D video. That just left a standard video and a playlist so, instead of switching between them, both examples are now set out on the page (so no need to switch now)</li>\n<li>Maintenance: Removed deprecated window mode, auto-hide, HTML 5 and theme options</li>\n<li>Maintenance: Removed the plugins menu</li>\n<li>Bug: The demo videos weren&#8217;t working, so they&#8217;ve been updated</li>\n<li>Bug: Fixed an issue with the video cache, which was expiring too quickly</li>\n</ul>\n<h4>5.0.6</h4>\n<ul>\n<li>Bug: It would appear that some of the code for the editor button was still lurking in dark corners of the plugin. That&#8217;s caused those not rocking Gutenberg to see errors or, worst still, the dreaded &#8220;white screen of death&#8221;. Apologies. I&#8217;ve now hoovered out all of the muck</li>\n<li>Bug: Whilst fixing the above, I noticed the title of one of the settings was wrong, so I&#8217;ve fixed that oo</li>\n</ul>\n<h4>5.0.5</h4>\n<ul>\n<li>Maintenance: The <code>rel</code> parameter has changed and the <code>showinfo</code> has been deprecated. Have updated the plugin for these changes</li>\n<li>Maintenance: I&#8217;ve removed the editor button. It doesn&#8217;t work after WP 5.0 and I don&#8217;t wish to maintain it</li>\n<li>Maintenance: I&#8217;m now using a time constant when caching</li>\n<li>Maintenance: Added Github links to plugin meta</li>\n<li>Maintenance: Using the <code>checked</code> function for screen output</li>\n<li>Maintenance: A minor language tweak, where I was specifying something that should, ideally, be captured by translations instead</li>\n</ul>\n<h4>5.0.4</h4>\n<ul>\n<li>Maintenance: Updated this README for better presentation in the new plugin directory. Funky.</li>\n<li>Maintenance: The minimum requirements for this plugin is now WordPress 4.6 so language files could be got rid of and various other bits of change. Smooth.</li>\n<li>Maintenance: Links to artiss.blog have been fixed. Smashing.</li>\n</ul>\n<h4>5.0.3</h4>\n<ul>\n<li>Enhancement: Now allow the align parameter in the profile HTML</li>\n</ul>\n<h4>5.0.2</h4>\n<ul>\n<li>Enhancement: I now include the shortcodes code whether you&#8217;re in admin or not, as there is no performance improvement by doing otherwise</li>\n<li>Enhancement: After WordPress 4.6 you don&#8217;t need to load the text domain. So I don&#8217;t!</li>\n<li>Enhancement: Fixed XSS vulnerability by restricting which HTML tags can be used in the template field. Thanks to Tristan Madani for reporting this</li>\n</ul>\n<h4>5.0.1</h4>\n<ul>\n<li>Maintenance: Now suppressing errors when fetching of API data fails</li>\n<li>Maintenance: Updated the drop-down of video sizes in the profiles screen, based upon latest YouTube recommendations</li>\n<li>Maintenance: Two sections of the README had the same name so wasn&#8217;t displaying correctly on wordpress.org &#8211; now corrected!</li>\n<li>Maintenance: Updated the screenshots &#8211; something I should have done for 5.0 but forgot (mumbling apologies)</li>\n<li>Bug: Okay, I admit it, I was caching the videos when they were random user-generated playlists, which meant the random order was the same each time . Now I suppress caching if this is the case</li>\n<li>Bug: For reasons I&#8217;ve yet to ascertain, some people appear to have an old value left over as the API key. I&#8217;ve therefore added a check for this and will clear it down if needs be</li>\n<li>Bug: Got rid of a number of PHP errors, most of which would have caused issues with the code as well</li>\n<li>Bug: No-one spotted this one  but I did &#8211; the list and profile counts weren&#8217;t always correct. Also, the profiles count was getting a bit confused with the lists count and the list count had really no idea what it was doing generally. Basically, it&#8217;s sorted</li>\n<li>Bug: To make things easier for myself I changed the array names that held the profile and list names. But, yeah, this means they weren&#8217;t transferred from previous setups. Arse. Okay, that&#8217;s now sorted</li>\n<li>Bug: In trying to resolve that last issue I found that the code that&#8217;s supposed to run during a plugin update wasn&#8217;t. Some jiggery-pokery later, it&#8217;s been re-written and works like a dream!</li>\n</ul>\n<h4>5.0</h4>\n<ul>\n<li>Enhancement: The API is back ! The plugin can now fetch video information to add to the metadata</li>\n<li>Enhancement: Caching is back ! Now that I&#8217;m happy with the speed of the main code, I&#8217;m now happy to cache it</li>\n<li>Enhancement: Added housekeeping for the caching, because WordPress is rubbish at doing it itself &lt;grumble, don&#8217;t get me started&gt;</li>\n<li>Enhancement: A new shortcode has been added to allow you to easily output video information to your post or page using a simple templating system</li>\n<li>Enhancement: Added the new API data to the metadata but also added more elements</li>\n<li>Enhancement: Improved the video ID validation if the API is not used</li>\n<li>Enhancement: WordPress has a nasty habit of modifying the video IDs that are passed to the plugin. Most of these we&#8217;re already able to undo, but it&#8217;s now been enhanced further to work even better</li>\n<li>Enhancement: The thumbnails shortcode now uses the API and, as a result, is slimmer and works with playlists too!</li>\n<li>Enhancement: Made some minor changes towards better accessibility. It&#8217;s been pretty shoddy up until now but the next release should complete this work</li>\n<li>Maintenance: Data is passed around between functions via arrays rather than LOTS of variables, which is a much better of doing it</li>\n<li>Maintenance: Removed the old video validation process as this is now handled by the API function</li>\n<li>Maintenance: Widget changes to support the customizer in WP 4.5</li>\n<li>Maintenance: Changed the branding back. Because it&#8217;s me you want &#8211; I understand that now</li>\n<li>Maintenance: Tested for WP 4.6 and PHP 7 compatibility because, you know, it&#8217;s the future</li>\n<li>Maintenance: Re-wrote this bad boy README</li>\n<li>Bug: Fixed metadata output issues with playlists</li>\n<li>Bug: Fixed bug where lists would not display if the new performance option was switched on</li>\n<li>Bug: Fixed issue with the uninstaller</li>\n</ul>\n<p><h4>4.3.4</h4>\n</p>\n<ul>\n<li>Bug: Fixed issue with 3 hyphens in a video ID being converted to &#8212;</li>\n</ul>\n<h4>4.3.3</h4>\n<ul>\n<li>Maintenance: One of the URLs in the README is being reported as being infected by malware. I have therefore removed this URL but have changed the release number, although no code has changed, to force the new version to download to existing users</li>\n</ul>\n<h4>4.3.2</h4>\n<ul>\n<li>Bug: Correct validation of list field, which was preventing more than one video being specified</li>\n<li>Bug: Fixed the URL for the settings link in the plugin meta</li>\n</ul>\n<h4>4.3.1</h4>\n<ul>\n<li>Bug: Had removed a function (by accident, you understand) that converted the old alternative shortcode settings to a new format. The result is that the conversion didn&#8217;t take place and an array was passed as a shortcode name to WordPress Core, generating an error. The function has been added back in</li>\n</ul>\n<h4>4.3</h4>\n<ul>\n<li>Enhancement: Added new &#8220;Third Party Plugins&#8221; screen, which lists third party plugins that work alongside YouTube Embed, adding extra functionality. You can view, install and see the status of these plugins from this screen</li>\n<li>Maintenance: Moved the settings back to the YouTube Embed menu</li>\n<li>Maintenance: Renamed menus to be more specific</li>\n<li>Maintenance: Updated the function names, which were still using the out-dated &#8220;vye&#8221; prefix</li>\n</ul>\n<h4>4.2.1</h4>\n<ul>\n<li>Bug fix: Quotes were not being dealt with correctly in the template field. Now corrected.</li>\n</ul>\n<h4>4.2</h4>\n<ul>\n<li>Enhancement: Re-written the core embedding code. Redundant code removed and, for the remaining code, re-imagined to improve performance</li>\n<li>Enhancement: Massively changed how the plugin retrieves saved options and, in particular, how I populate default values. The result? Even better performance</li>\n<li>Enhancement: Reviewed and reduced the calls to fetch the options</li>\n<li>Enhancement: Added a new general option to allow you to force a list type to be specified before a list can be used. The reason? By doing this the code doesn&#8217;t have to check if the ID it a list name each time and it improves performance. For those upgrading this will be switched off by default to maintain backwards compatibility</li>\n<li>Enhancement: Admin bar options only appear if viewing the admin bar on the site (showing it whilst in the admin screens seemed rather pointless)</li>\n<li>Enhancement: If you use <a href=\"https://wordpress.org/plugins/video-overlay-ads/\" title=\"WordPress Video Overlay Ads\" rel=\"ugc\">WordPress Video Overlay Ads</a> or <a href=\"http://yoast.com/wordpress/video-seo/\" title=\"Video SEO for WordPress\" rel=\"nofollow ugc\">Video SEO for WordPress</a> then the settings menus will appear under the YouTube Embed menu</li>\n<li>Enhancement: SSL options removed as it&#8217;s now used by default, including with thumbnails and schema.org links</li>\n<li>Enhancement: Improved the RSS feed output for search or user upload requests</li>\n<li>Maintenance: Removed some deprecated elements in the code</li>\n<li>Maintenance: Updated includes so that plugin folders were not hardcoded</li>\n<li>Maintenance: Updated which functions I was using to retrieve folder names so that they are fully SSL compatible</li>\n<li>Maintenance: Removed a load of redundant functions</li>\n<li>Maintenance: Replaced a function with a PHP command but this means that the plugin is no compatible with PHP versions below 5.1</li>\n<li>Maintenance: Tidied up the list screen further</li>\n<li>Maintenance: Replaced the &#8216;dynamic&#8217; parameter with &#8216;responsive&#8217; which, as a name, is far more accurate. &#8216;dynamic&#8217; will still work, though.</li>\n<li>Maintenance: Improved admin screen validation and sanitization</li>\n</ul>\n<h4>4.1.1</h4>\n<ul>\n<li>Bug fix: Corrected settings URL in plugin meta.</li>\n<li>Bug fix: If plugin has never run before, ensure a default options array is generated.</li>\n<li>Maintenance: Removed donation options and updated branding.</li>\n</ul>\n<h4>4.1</h4>\n<ul>\n<li>Enhancement: Added &#8216;Plays inline&#8217; option for iOS devices.</li>\n<li>Enhancement: Added extra Closed Caption option to better reflect how YouTube works &#8211; either on, off, or user default.</li>\n<li>Enhancement: Added new option to force HTML5 playback (if available). This is an undocumented feature and, as such, may not actually work, depending on YouTube&#8217;s current mood. If YouTube aren&#8217;t going to support it then I&#8217;m certainly not going to so please don&#8217;t shout if it doesn&#8217;t work.</li>\n<li>Enhancement: Lovely new icons for the lists page.</li>\n<li>Enhancement: Improved the layout of the demo video on the profiles page.</li>\n<li>Enhancement: Added a count to the profiles and lists screen to indicate how many are set up. Also showed on drop-down which of the profiles/lists are not defined.</li>\n<li>Enhancement: Changes made to add compatibility with a3 lazy load.</li>\n<li>Enhancement: Removed the caching &#8211; it created the output up to 3 times quicker but when that&#8217;s 0.005 seconds it&#8217;s not worth the hassle that comes with it. I started making performance improvements to compensate then realized it was such a big change that it would be best spun off as it&#8217;s own separate update &#8211; version 4.2. Look out for it.</li>\n<li>Enhancement: Removed limitation of only being able to display up to 30 lists or profiles.</li>\n<li>Enhancement: When you can select a profile from another screen (e.g. defining a profile to an alternative shortcode) then only defined profiles will be listed.</li>\n<li>Enhancement: Added general option to specify the YouTube interface language as well as to suppress debug output in the resulting code.</li>\n<li>Enhancement: Fixed validation errors against thumbnails.</li>\n<li>Enhancement: Changed the &#8220;Frameborder&#8221; option to a more general &#8220;Improve Validation&#8221; which does, well, just that. It improves the generated markup so that it will validate better (if that&#8217;s your bag).</li>\n<li>Enhancement: Added option to use a third party script to handle content resizing. Implemented <a href=\"https://github.com/davidjbradshaw/iframe-resizer\" title=\"iFrame Resizer\" rel=\"nofollow ugc\">iFrame Resizer</a> v3.5.1 and <a href=\"https://github.com/davatron5000/FitVids.js\" title=\"FitVids.js\" rel=\"nofollow ugc\">FitVids.js</a> 1.1.</li>\n<li>Enhancement: If another plugin is using the same shortcode as this I now output a prompt in the admin area. Also added a setting to turn off this prompt just in case you&#8217;re using the secondary shortcode and are happy for this.</li>\n<li>Enhancement: Re-written code for help screens, including adding more information and additional tabs.</li>\n<li>Maintenance: Moved the settings page to, well, the Settings menu option. It makes sense.</li>\n<li>Maintenance: Removed the enable of the JS API, which is now deprecated.</li>\n<li>Maintenance: Improved the admin screen output code &#8211; had made it more WordPress standard in version 4 but got some of the code wrong.</li>\n</ul>\n<h4>4.0.2</h4>\n<ul>\n<li>Maintenance: Not really a bug, but in some circumstances I wasn&#8217;t initializing a variable used when generating the embed code. It worked fine but wasn&#8217;t best practice so fixed. Sloppy.</li>\n<li>Maintenance: Modified the default parameters so new user videos should appear with the same options as on YouTube itself. Consistent.</li>\n<li>Maintenance: I ABSOLUTELY refuse to call this a bug. But I was calling get_the_excerpt() to build some of the video meta data. For some reason, still unknown to me, other plugins were crashing as a result of it. I&#8217;ve removed it for now but am investigating the cause. Frustrating.</li>\n<li>Enhancement: WMODE is now only added to the embed URL if it&#8217;s anything other than the default. Shrinkage.</li>\n</ul>\n<h4>4.0.1</h4>\n<ul>\n<li>Maintenance: Left some debug code in by mistake. Doh. Sometimes I&#8217;d forget my own head if it wasn&#8217;t screwed on&#8230;. Apologies to those affected.</li>\n</ul>\n<h4>4.0</h4>\n<ul>\n<li>Maintenance: Removed a number of redundant/broken features. <a href=\"https://artiss.blog/youtube-embed-removed-features/\" title=\"Removed Features\" rel=\"nofollow ugc\">Learn more</a>.</li>\n<li>Maintenance: Updated download link to use KeepVid.</li>\n<li>Maintenance: Re-written admin screen to use WordPress standard method of displaying settings. Oh, and the widget settings too.</li>\n<li>Maintenance: &#8230;speaking of which, revised the options available to widgets.</li>\n<li>Maintenance: Merged many of the files where there wasn&#8217;t a huge amount of content.</li>\n<li>Maintenance: Renamed menu slugs as they were too generic and may cause clashes with other plugins or themes that are silly enough to do the same thing.</li>\n<li>Enhancement: Revised profile screen to make it clearer, via the art of the icon, which parameters are compatible with which embed type.</li>\n<li>Enhancement: If you go a bit &#8220;ape&#8221; with the parameters and manual playlists, it&#8217;s possible to exceed the URL size limit. I&#8217;ve now put a check in place to report this, if it occurs.</li>\n<li>Enhancement: Added modest branding as a parameter (before was only selectable via the profile screen).</li>\n<li>Enhancement: Improved the meta data.</li>\n<li>Bugs: Many of them. Fixed. Hoorah.</li>\n</ul>\n<h4>3.3.5</h4>\n<ul>\n<li>Maintenance: Added missing text domain, ready for automatic translation.</li>\n</ul>\n<h4>3.3.4</h4>\n<ul>\n<li>Maintenance: Updated admin screen headings for compatibility with 4.3.</li>\n<li>Maintenance: Updated demo video on profile page. Just because.</li>\n<li>Bug: Fixed (I hope) the problem with the editor button not appearing for some users. Thanks to Mark Aarhus for getting to the bottom of this for me.</li>\n<li>Enhancement: Added donation link to plugin meta. Because I&#8217;m worth it.</li>\n</ul>\n<h4>3.3.3</h4>\n<ul>\n<li>Maintenance: Now working with newer playlist IDs (README instructions changed to reflect how to do this)</li>\n<li>Maintenance: Resolved widget issues with version 4.3 of WordPress</li>\n<li>Maintenance: Eliminated XSS problem in admin profile screen</li>\n</ul>\n<h4>3.3.2</h4>\n<ul>\n<li>Bug: One of the files was corrupt in the previous release &#8211; this is now fixed. Sorry 🙁</li>\n</ul>\n<h4>3.3.1</h4>\n<ul>\n<li>Maintenance: Remove reference to Google API, as videos are now not displaying as a result of v2 being retired. Will update the plugin more fully in future release</li>\n</ul>\n<h4>3.3</h4>\n<ul>\n<li>Maintenance: Ding, dong Applian has gone. Removed Vixy branding, updated README and language files to match</li>\n<li>Maintenance: Removed those Vixy download links and restored the old method &#8211; will enhance this in a future release</li>\n<li>Maintenance: Plugin had too much baggage so it could support old versions of WordPress. Why? Updated it to only support more recent versions but have removed lots of un-needed guff as well. The result &#8211; this version is 15% slimmer than the previous version. Win!</li>\n<li>Maintenance: Spruced up the admin screens to match the new WordPress styling</li>\n<li>Bug: Resolved a number of bugs as reported by users and spotted by myself. Thanks all! More fixes to come</li>\n</ul>\n<h4>3.2.1</h4>\n<ul>\n<li>Bug: Fixed issue where playlist was appearing for single videos</li>\n<li>Maintenance: Improved Metadata standard</li>\n</ul>\n<h4>3.2</h4>\n<ul>\n<li>Bug: Prevented download bar SPAN from appearing even when switched off</li>\n<li>Bug: Fixed issue that caused playlists to not appear</li>\n<li>Enhancement: Added new shortcode for displaying video comments</li>\n<li>Enhancement: IFRAME output now includes metadata</li>\n<li>Enhancement: Editor button will now work with MCE4 editor (WP 3.9+)</li>\n<li>Enhancement: SVG icon used in admin menu for WP 3.8+</li>\n</ul>\n<h4>3.1</h4>\n<ul>\n<li>Enhancement: Allow user to specify video resolution required (experimental)</li>\n<li>Enhancement: Different languages can be specified for transcripts, other than the English default</li>\n<li>Enhancement: API enabled on scripts by default, allowing for third-party modification</li>\n<li>Enhancement: Can now add a link to YouTube under a video</li>\n<li>Maintenance: Removed adverts from administration screen</li>\n<li>Maintenance: Changed download bar default to be opt-in and re-worded option text</li>\n</ul>\n<h4>3.0.1</h4>\n<ul>\n<li>Bug: Fixed menu options shown in admin bar</li>\n<li>Maintenance: Updated links to point to instructions on Vixy.net website</li>\n<li>Enhancement: Validate download bar code to ensure it&#8217;s secure</li>\n<li>Enhancement: Passing blog language to language bar for i18n</li>\n</ul>\n<h4>3.0</h4>\n<ul>\n<li>Maintenance: Changed name, updated adverts, removed donation and sponsorship requests</li>\n<li>Maintenance: Renamed function to match new name and also removed prefix from files, which were not required</li>\n<li>Maintenance: Checked and updated all help URLs</li>\n<li>Maintenance: Removed about and instruction pages which were felt were no longer needed</li>\n<li>Maintenance: Updated icons</li>\n<li>Enhancement: Updated download links to use code from Vixy. This is now switched on by default</li>\n<li>Enhancement: Added option to provide an affiliate ID for use with the download bar &#8211; blog owners can make 30% from sales generated</li>\n<li>Enhancement: Simplified the menu access rules which has resulted in resolving a number of existing issues</li>\n<li>Bug: Fixed PHP error when allowing shortcodes in widgets</li>\n</ul>\n"
    },
    "short_description": "🎥 An incredibly fast, simple, yet powerful, method of embedding YouTube videos into your WordPress site.",
    "description": "<p>YouTube Embed is an incredibly fast, simple, yet powerful, method of embedding YouTube videos into your WordPress site.</p>\n<p><strong>NOTE: This plugin supports the ability to insert the standard YouTube embed and playlist players. However, if you need to embed a YouTube facade, livestream, or gallery, we recommend the <a href=\"https://www.embedplus.com/\" rel=\"nofollow ugc\">EmbedPlus.com</a> plugin that&#8217;s freely available <a href=\"https://wordpress.org/plugins/youtube-embed-plus/\" rel=\"ugc\">here</a>.  It&#8217;s been around for many years and is highly trusted.</strong></p>\n<p>Key features include&#8230;</p>\n<ul>\n<li>Build your own playlists and play them back however you want</li>\n<li>Automatically generate playlists based on user name</li>\n<li>Create multiple profiles &#8211; use them for different videos to get the exact style that you want</li>\n<li>Dynamic video sizing for responsive sites</li>\n<li>Housekept caching keeps the code generation nimble and your database tables slimline</li>\n<li>Google compatible metadata is added to the video output based on data provided by the YouTube API &#8211; great for SEO!</li>\n<li>Support for Do Not Track</li>\n<li>Compatible with <a href=\"http://yoast.com/wordpress/video-seo/\" title=\"Video SEO for WordPress\" rel=\"nofollow ugc\">Video SEO for WordPress</a>, <a href=\"https://wordpress.org/plugins/a3-lazy-load/\" title=\"a3 lazy load\" rel=\"ugc\">a3 lazy load</a> and <a href=\"https://wordpress.org/plugins/video-overlay-ads/\" title=\"WordPress Video Overlay Ads\" rel=\"ugc\">WordPress Video Overlay Ads</a> and many more. In the case of Video SEO and WordPress Video Overlay Ads, their options will even appear under the YouTube Embed menu for total simplicity!</li>\n<li>Use <a href=\"https://www.turnoffthelights.com/\" title=\"Turn Off The Lights\" rel=\"nofollow ugc\">Turn Off The Lights</a>? This plugin works with it beautifully.</li>\n<li><a href=\"https://github.com/davidjbradshaw/iframe-resizer\" title=\"iFrame Resizer\" rel=\"nofollow ugc\">iFrame Resizer</a> and <a href=\"https://github.com/davatron5000/FitVids.js\" title=\"FitVids.js\" rel=\"nofollow ugc\">FitVids.js</a> supported to improve content resizing</li>\n<li>Works &#8220;out of the box&#8221; with 4K, 60FPS and Chromecast &#8211; stream your embedded videos to your TV!</li>\n<li>And much, much more!</li>\n</ul>\n<p>👉 Please visit the <a href=\"https://github.com/squaredcode/youtube-embe\" title=\"Github\" rel=\"nofollow ugc\">Github page</a> for the latest code development, planned enhancements and known issues 👈</p>\n<h3>🚦 Getting Started</h3>\n<p>How easy is it to use? The fine people at <a href=\"https://www.webucator.com\" title=\"Webucator\" rel=\"nofollow ugc\">Webucator</a> have put together an excellent video showing you how to get started with it..</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/Wc7cvpQS-xQ?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p>To add a video to a post or page simply use the shortcode <code>[youtube]video[/youtube]</code>, where <code>video</code> is the ID or URL of the YouTube video. Alternatively, you can add one (or more) widgets to your sidebar.</p>\n<p>If you&#8217;re not sure what the video ID is, please head to the FAQ section where it&#8217;s explained in greater detail!</p>\n<p>Within the administration area, click on the Settings menu option and then YouTube Embed to view and edit the generic settings for the plugin. Also under the YouTube Embed menu (see screenshot 1) you can click on the Profiles sub-menu to set the default options which define the output of your videos. Any videos you display (unless overridden by parameters &#8211; more on that later) will use the settings from the Profiles screen.</p>\n<p>Although this document contains a lot of information more is provided on the various administration pages. Whilst on the administration pages, click on the &#8220;Help&#8221; button in the top right for some useful tips and links. If anything isn&#8217;t covered and you&#8217;re unsure of what it does please ask <a href=\"https://wordpress.org/support/plugin/youtube-embed\" title=\"WordPress Plugins Forum\" rel=\"ugc\">on the forum</a>.</p>\n<h3>🔑 Creating an API Key</h3>\n<p>At the top of the <code>YouTube Embed Settings</code> administration screen is an option to specify an API key. This is optional but many of the features of this plugin &#8211; including accurate video information being added to the metadata &#8211; will not be available without it. Thankfully an API key is easy to get and is free.</p>\n<ol>\n<li>Head to the <a href=\"https://console.developers.google.com/cloud-resource-manager\" title=\"Developers Console\" rel=\"nofollow ugc\">YouTube Developers Console</a></li>\n<li>Click on CREATE PROJECT</li>\n<li>Once created, head into it</li>\n<li>In the APIs box, click on &#8220;Go to APIs overview&#8221;</li>\n<li>Click on &#8220;ENABLE APIS AND SERVICES&#8221; at the top of the screen</li>\n<li>You can now choose your API &#8211; click on YouTube Data API v3</li>\n<li>Click the &#8220;ENABLE&#8221; button</li>\n<li>Click on &#8220;CREATE CREDENTIALS&#8221;</li>\n<li>On the drop-downs, choose the API we selected before, &#8220;Web browser and &#8220;Public data&#8221;</li>\n<li>You will now be presented with your API key</li>\n</ol>\n<p>The API key can now be pasted into the settings in WP Admin.</p>\n<h3>Further embedding options</h3>\n<p>A basic shortcode will embed your video using your default profile settings. However, you may wish to override some of these options on a video-by-video basis &#8211; this is done via parameters added to the shortcode.</p>\n<p>e.g. <code>[youtube width=300 height=200]Z_sCoHGIpU0[/youtube]</code></p>\n<p>Which options are available depends upon the users&#8217;s set-up (for example, whether they have Flash installed or not). You can specify any of the parameters but they may be ignored. Please see the Profile screen in Administration for further details on any restrictions which may exist.</p>\n<ul>\n<li><strong>annotation</strong> &#8211; yes or no, this determines if annotations are shown</li>\n<li><strong>autoplay</strong> &#8211; yes or no, should the video automatically start playing?</li>\n<li><strong>cc</strong> &#8211; yes or no, decided whether closed captions are displayed. If you don&#8217;t specify anything then the user&#8217;s default will be used.</li>\n<li><strong>cc_lang</strong> &#8211; Closed captions language. Select a <a href=\"http://www.loc.gov/standards/iso639-2/php/code_list.php&quot;\" rel=\"nofollow ugc\">ISO 639-1 two-letter language code</a> or leave blank for the default</li>\n<li><strong>color</strong> &#8211; white or red, the color of the progress bar (see the FAQ about having a white progress bar with the light theme)</li>\n<li><strong>controls</strong> &#8211; 0, 1 or 2, this decides whether the controls should display and when the Flash will load. A value of 0 will not show the controls but 1 or 2 will. A value of 2 will load Flash once the user initiates playback &#8211; otherwise it&#8217;s loaded straight away.</li>\n<li><strong>disablekb</strong> &#8211; yes or no, switch off keyboard controls</li>\n<li><strong>fullscreen</strong> &#8211; yes or no, this will add the fullscreen button to the toolbar</li>\n<li><strong>height</strong> &#8211; the video height, in pixels</li>\n<li><strong>language</strong> &#8211; The interface language. The parameter value is an <a href=\"http://www.loc.gov/standards/iso639-2/php/code_list.php&quot;\" rel=\"nofollow ugc\">ISO 639-1 two-letter language code</a> or a fully specified locale. Leave blank for the default</li>\n<li><strong>list</strong> &#8211; if you&#8217;ve specified your own list, use this to select the way the videos should be output. Should be <code>random</code> (display videos in a random order), <code>single</code> (show just one video, randomly picked from the list) or <code>order</code> (show each video in the original order &#8211; this is the default)</li>\n<li><strong>loop</strong> &#8211; yes or no, whether to start the video again once it ends</li>\n<li><strong>modest</strong> &#8211; reduce the branding on the video</li>\n<li><strong>playsinline</strong> &#8211; whether videos play inline or fullscreen in an HTML5 player on iOS.</li>\n<li><strong>profile</strong> &#8211; specify a different default profile (see section on Profiles for further details)</li>\n<li><strong>ratio</strong> &#8211; allows you to define a window ratio &#8211; specify just a height or width and the ratio will calculate the missing dimension. Uses the format x:x, e.g. 4:3, 16:9</li>\n<li><strong>related</strong> &#8211; yes or no, show related videos</li>\n<li><strong>responsive</strong> &#8211; whether to use responsive output or not. When switched on the video will resize when your site does (i.e. responsive). If a video width is supplied this will be the maximum width, otherwise full width will be assumed. Height is ignored and will be worked out automatically.</li>\n<li><strong>start</strong> &#8211; a number of seconds from where to start the video playing</li>\n<li><strong>stop</strong> &#8211; this stops the video at a specific time, given in seconds</li>\n<li><strong>style</strong> &#8211; apply CSS elements directly to the video output</li>\n<li><strong>template</strong> &#8211; specify a template (see section on Templates for further details)</li>\n<li><strong>user</strong> &#8211; yes or no, create a playlist based on a user&#8217;s uploads. The search word should be specified instead of a video ID. See &#8220;Automatically Generate Playlists&#8221; option for more details</li>\n<li><strong>width</strong> &#8211; the video width, in pixels</li>\n</ul>\n<h3>Alternative Shortcodes</h3>\n<p>Within Administration, selecting Settings -&gt; YouTube Embed will provide a list of generic options. One option is named <code>Alternative Shortcode</code> and allows you to specify another shortcode that will work exactly the same as the standard shortcode of <code>[youtube]]</code>.</p>\n<p>There are 2 reasons why you might want to do this&#8230;</p>\n<ol>\n<li>If migrating from another plugin, it may use a different shortcode</li>\n<li>If another plugin uses the same shortcode (e.g. Jetpack) this will allow you to specify and use an alternative</li>\n</ol>\n<p>The new shortcode can also have its own default profile assigned to it (see the Profiles section for more details on this).</p>\n<h3>Widgets</h3>\n<p>Widgets can be easily added. In Administration simply click on the Widgets option under the Appearance menu. YouTube Embed will be one of the listed widgets. Drag it to the appropriate sidebar on the right hand side and then choose your video options &#8211; any that aren&#8217;t specified are taken from your supplied profile. It&#8217;s best to have a profile set-up specifically for widgets!</p>\n<p>If you wish to display an automatically generated playlist based on user name, simply change the &#8220;ID Type&#8221; appropriately and then specify the name where the video ID would normally be entered.</p>\n<p>And that&#8217;s it! You can use unlimited widgets, so you can add different videos to different sidebars.</p>\n<h3>Playlists</h3>\n<p>YouTube allows users to create their own playlists &#8211; collections of videos that can be played in sequence. These are embedded in the same way, by supplying the playlist ID.</p>\n<p>e.g. <code>[[youtube]PLVTLbc6i-h_iuhdwUfuPDLFLXG2QQnz-x[/youtube]</code></p>\n<p>An alternative to the YouTube build playlists is the build-in lists function &#8211; see the Lists section for further details.</p>\n<h3>Templates</h3>\n<p>Both in the profile and as a parameter you can specify a template. This allows you to define any CSS that you wish to &#8220;wrap&#8221; around the YouTube output.</p>\n<p>The template consists simply of your choice of HTML but with <code>%video%</code> where you wish the video to appear.</p>\n<p>e.g. <code>&lt;div align=\"center\"&gt;%video%&lt;/div&gt;</code></p>\n<p>For reasons of security, only specific HTML tags are valid &#8211; these are a, br, div, img, p span and strong. If there are any others that you&#8217;d like to have added, please let me know via the forum.</p>\n<h3>Profiles</h3>\n<p>You&#8217;ve probably already had a look at the default profile, accessible by selecting Profiles from the YouTube Embed Administration menu option. Here you can specify the default option which will apply to any embedded video.</p>\n<p>However, in the top right hand corner is a drop-down box and a button marked Change profile. Simply select an alternative profile and click the button and you can then edit the options for this alternative profile. You can even name it as well.</p>\n<p>To use this profile, simply use the parameter <code>profile=</code> followed by the profile name or number. The options for this profile will then be used.</p>\n<p>This could be useful, for instance, for having a separate profile for different parts of your site &#8211; posts, sidebar, etc &#8211; or for different video types (e.g. widescreen).</p>\n<p>By default you have 5 extra profiles &#8211; if you wish to have more (or less) this number can be changed from the YouTube Embed settings screen.</p>\n<h3>📝 Lists</h3>\n<p>Although this plugin will play standard YouTube playlists their playback options are limited. Instead you can create your own video lists. Under the YouTube Embed administration menu is a sub-menu named Lists. Select this and you will be shown a screen where you can type in a list of video IDs (or URLS). You can also provide a name for the list.</p>\n<p>When saving the list each video is validated.</p>\n<p>As with profiles you can select the list from a drop down in the top right-hand corner. You can also change the number of lists from the Options sub-menu too.</p>\n<p>To use a list, simply specify the list name or number instead of a video ID, as well as a parameter to specify how you wish the list to be played back.</p>\n<p>e.g. <code>[youtube list='order']List 1[/youtube]</code></p>\n<p>The list parameter allows to to either play each in turn, play them randomly, or have just one played (but picked randomly).</p>\n<p>An option within the general options screen allows you to change whether this parameter MUST be used. If switched on, you will gain a performance increase, otherwise the plugin has no way of knowing if you&#8217;re asking for a playlist so must verify the ID you&#8217;ve specified against all your lists.</p>\n<h3>Automatically Generated Playlists</h3>\n<p>YouTube includes options to automatically generate playlists based upon a user name.</p>\n<p>To use, simply use the <code>user</code> parameter to switch the appropriate option on. Then, instead of a video ID or URL, you should specify the user name.</p>\n<h3>📏 Third Party Resizing Scripts</h3>\n<p>Within the YouTube Embed settings screen there is an option to set a third party resizing script &#8211; either <a href=\"https://github.com/davidjbradshaw/iframe-resizer\" title=\"iFrame Resizer\" rel=\"nofollow ugc\">iFrame Resizer</a> or <a href=\"https://github.com/davatron5000/FitVids.js\" title=\"FitVids.js\" rel=\"nofollow ugc\">FitVids.js</a>. These work alongside the existing IFRAME but try and improve the output, particularly with regard to how the output is sized.</p>\n<p>There are no guarantees with these and no support of their specific functionality is provided. However, if the video output is wrong then it&#8217;s worth trying these.</p>\n<h3>🏙 Thumbnails</h3>\n<p>YouTube Embed also has the ability to return a thumbnail of a video (sorry, this doesn&#8217;t work with playlists).</p>\n<p>To use the shortcode method, insert <code>[youtube_thumb]id[/youtube_thumb]</code> into a post or page to create a thumbnail of the relevant video ID which, once clicked, will open up the appropriate YouTube page.</p>\n<p>You can specify a number of parameters&#8230;</p>\n<ul>\n<li><strong>alt</strong> &#8211; specify some <code>ALT</code> text for the thumbnail image</li>\n<li><strong>rel</strong> &#8211; specify a REL override, e.g. rel=&#8221;nofollow&#8221;</li>\n<li><strong>target</strong> &#8211; specify a TARGET override, e.g. target=&#8221;_blank&#8221;</li>\n<li><strong>width</strong> &#8211; this specifies the width of the thumbnail image</li>\n<li><strong>height</strong> &#8211; this specifies the height of the thumbnail image</li>\n<li><strong>nolink</strong> &#8211; if set to <code>true</code>, will output the thumbnail without a link to the YouTube video, allowing you to add your own</li>\n<li><strong>version</strong> &#8211; which version of the thumbnail to use. This can be <code>default</code> (120&#215;90), <code>medium</code> (320&#215;180), <code>high</code> (480&#215;360), <code>standard</code> (640&#215;480) or <code>maxres</code></li>\n<li><strong>version</strong> &#8211; which version of the thumbnail to use. This can be <code>default</code> (120&#215;90), <code>medium</code> (320&#215;180), <code>high</code> (480&#215;360), <code>standard</code> (640&#215;480) or <code>maxres</code></li>\n</ul>\n<p>e.g. <code>[youtube_thumb target=\"_blank\" alt=\"Demo video\"]id[/youtube_thumb]</code></p>\n<p>This overrides the <code>TARGET</code> and <code>ALT</code> elements of the thumbnail.</p>\n<h3>🗜 Shortened URL</h3>\n<p>You may return a short URL for any YouTube video by simply inserting <code>[youtube_url id=xx]</code> anywhere within a post. <code>xx</code> is the ID of the video.</p>\n<h3>⬇️ Downloading Videos</h3>\n<p>If you wish your users to be able to download a YouTube video or playlist then you can do this automatically.</p>\n<p>In the Profiles screen within administration there is an option to automatically show a download link. You can specify some text or HTML to display as well as CSS. If you&#8217;d prefer to do this manually then you can use the shortcode <code>download_video</code>. The content to link is specified between the open and close shortcode tags and there are 3 parameters&#8230;</p>\n<ul>\n<li><strong>id</strong> &#8211; The ID of the video or playlist. This is required.</li>\n<li><strong>target</strong> &#8211; The target of the link (e.g. <code>_blank</code>). This is optional.</li>\n<li><strong>nofollow</strong> &#8211; yes or no, use this to specify whether a <code>nofollow</code> tag should be added to the link. This is optional and by default it will be included.</li>\n</ul>\n<p>e.g. <code>[download_video id=\"Z_sCoHGIpU0\" target=\"_blank\"]Download the video[/download_video]</code></p>\n<h3>ℹ️ Video Information</h3>\n<p>The shortcode of <code>vinfo</code> can be used to output useful video information. Simple pass the video ID using the parameter of <code>id</code> and then add any text between the opening and closing shortcode. If this text contains any of the following tags then they will be replaced with the relevant video information&#8230;</p>\n<ul>\n<li>%title% &#8211; the title of the video</li>\n<li>%description% &#8211; the video description</li>\n<li>%url% &#8211; a link to the video on YouTube</li>\n<li>%shorturl% &#8211; a shorturl of the video</li>\n<li>%download% &#8211; a link to a site where the video can be downloaded</li>\n<li>%thumb_default% &#8211; URL of a thumbnail image 120&#215;90 pixels in size</li>\n<li>%thumb_medium% &#8211; URL of a thumbnail image 320&#215;180 pixels in size</li>\n<li>%thumb_high% &#8211; URL of a thumbnail image 480&#215;360 pixels in size</li>\n<li>%thumb_standard% &#8211; URL of a thumbnail image 640&#215;480 pixels in size</li>\n<li>%thumb_maxres% &#8211; URL of a thumbnail image the biggest it can be, based on the original video size</li>\n</ul>\n<p>These tags can be included in URLs as well. For example, if you added the following in the HTML view&#8230;</p>\n<pre><code>[vinfo id=\"Z_sCoHGIpU0\"]&lt;a href=\"%url%\"&gt;&lt;img src=\"%thumb_default%\"&gt;&lt;/a&gt;[/vinfo]\n</code></pre>\n<p>This would display a 120&#215;90 pixel thumbnail with a clickable link to the original video.</p>\n<h3>Other Settings</h3>\n<p>Under the Settings menu s a sub-menu named YouTube Embed. Select this and find the section named Embedding. There are 2 options here that have not been covered already&#8230;</p>\n<ol>\n<li>Add Metadata &#8211; by default, RDFa metadata is added to video output. This can be switched on or off as required (see the FAQs for more information about metadata usage).</li>\n<li>Feed &#8211; videos will not appear in feeds so use this option to decide whether you want them to be converted to links and/or thumbnails.</li>\n</ol>\n<h3>♥️ Reviews &amp; Mentions</h3>\n<ul>\n<li><a href=\"https://twitter.com/AaronWatters/status/237957701605404672?uid=16257815&amp;iid=am-130280753913455685118891763&amp;nid=4+248\" title=\"Twitter - Aaron Watters\" rel=\"nofollow ugc\">Your YouTube Plugin is fantastic-it just saved my life on this site. Thank you!</a> &#8211; Sonic Clamp</li>\n<li><a href=\"http://www.socialtimes.com/2011/03/new-technology-finds-the-most-buzzed-about-parts-of-videos-interview/\" title=\"New Technology Finds The Most Buzzed-About Parts Of Videos\" rel=\"nofollow ugc\">New Technology Finds The Most Buzzed-About Parts Of Videos</a> &#8211; SocialTimes</li>\n<li><a href=\"http://andershagstrom.se/andesch-tipsar-om-wordpress-plugins/\" title=\"Andesch tipsar om WordPress-plugins!\" rel=\"nofollow ugc\">Andesch tips on WordPress plugins!</a> &#8211; Anders</li>\n<li><a href=\"http://www.bikinginmemphis.com/2011/03/26/critical-mass/\" title=\"Critical Mass\" rel=\"nofollow ugc\">Critical Mass</a> &#8211; Biking in Memphis</li>\n</ul>\n",
    "download_link": "https://downloads.wordpress.org/plugin/youtube-embed.5.3.1.zip",
    "upgrade_notice": {
        "5.3.1": "<ul>\n<li>Update plugin meta</li>\n</ul>"
    },
    "screenshots": [
        {
            "src": "https://ps.w.org/youtube-embed/assets/screenshot-1.png?rev=1343141",
            "caption": "YouTube Embed in the administration menu"
        },
        {
            "src": "https://ps.w.org/youtube-embed/assets/screenshot-2.png?rev=1488068",
            "caption": "The main options screen"
        },
        {
            "src": "https://ps.w.org/youtube-embed/assets/screenshot-3.png?rev=1299038",
            "caption": "The profiles screen"
        },
        {
            "src": "https://ps.w.org/youtube-embed/assets/screenshot-4.png?rev=1299037",
            "caption": "The lists screen - videos have been added and validated. The drop-down help is also shown"
        },
        {
            "src": "https://ps.w.org/youtube-embed/assets/screenshot-5.png?rev=1488067",
            "caption": "The default widget options"
        },
        {
            "src": "https://ps.w.org/youtube-embed/assets/screenshot-6.png?rev=1299033",
            "caption": "The default visual editor options with the YouTube Embed button"
        },
        {
            "src": "https://ps.w.org/youtube-embed/assets/screenshot-7.png?rev=1343142",
            "caption": "The third party plugins menu"
        }
    ],
    "tags": {
        "embed": "embed",
        "insert": "insert",
        "video": "video",
        "youtube": "youtube"
    },
    "stable_tag": "5.3.1",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/youtube-embed.1.0.zip",
        "1.1": "https://downloads.wordpress.org/plugin/youtube-embed.1.1.zip",
        "1.2": "https://downloads.wordpress.org/plugin/youtube-embed.1.2.zip",
        "1.3.1": "https://downloads.wordpress.org/plugin/youtube-embed.1.3.1.zip",
        "1.4.2": "https://downloads.wordpress.org/plugin/youtube-embed.1.4.2.zip",
        "1.5": "https://downloads.wordpress.org/plugin/youtube-embed.1.5.zip",
        "2.0.4": "https://downloads.wordpress.org/plugin/youtube-embed.2.0.4.zip",
        "2.1": "https://downloads.wordpress.org/plugin/youtube-embed.2.1.zip",
        "2.2": "https://downloads.wordpress.org/plugin/youtube-embed.2.2.zip",
        "2.3.1": "https://downloads.wordpress.org/plugin/youtube-embed.2.3.1.zip",
        "2.4.1": "https://downloads.wordpress.org/plugin/youtube-embed.2.4.1.zip",
        "2.5.6": "https://downloads.wordpress.org/plugin/youtube-embed.2.5.6.zip",
        "2.6.2": "https://downloads.wordpress.org/plugin/youtube-embed.2.6.2.zip",
        "2.7": "https://downloads.wordpress.org/plugin/youtube-embed.2.7.zip",
        "3.0.1": "https://downloads.wordpress.org/plugin/youtube-embed.3.0.1.zip",
        "3.1": "https://downloads.wordpress.org/plugin/youtube-embed.3.1.zip",
        "3.2.1": "https://downloads.wordpress.org/plugin/youtube-embed.3.2.1.zip",
        "3.3.5": "https://downloads.wordpress.org/plugin/youtube-embed.3.3.5.zip",
        "4.0.2": "https://downloads.wordpress.org/plugin/youtube-embed.4.0.2.zip",
        "4.1.1": "https://downloads.wordpress.org/plugin/youtube-embed.4.1.1.zip",
        "4.2.1": "https://downloads.wordpress.org/plugin/youtube-embed.4.2.1.zip",
        "4.3.5": "https://downloads.wordpress.org/plugin/youtube-embed.4.3.5.zip",
        "5.0.6": "https://downloads.wordpress.org/plugin/youtube-embed.5.0.6.zip",
        "5.1.1": "https://downloads.wordpress.org/plugin/youtube-embed.5.1.1.zip",
        "5.2": "https://downloads.wordpress.org/plugin/youtube-embed.5.2.zip",
        "5.2.2": "https://downloads.wordpress.org/plugin/youtube-embed.5.2.2.zip",
        "5.2.3": "https://downloads.wordpress.org/plugin/youtube-embed.5.2.3.zip",
        "5.2.4": "https://downloads.wordpress.org/plugin/youtube-embed.5.2.4.zip",
        "5.3": "https://downloads.wordpress.org/plugin/youtube-embed.5.3.zip",
        "5.3.1": "https://downloads.wordpress.org/plugin/youtube-embed.5.3.1.zip",
        "trunk": "https://downloads.wordpress.org/plugin/youtube-embed.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": [],
    "icons": {
        "1x": "https://ps.w.org/youtube-embed/assets/icon-128x128.png?rev=2955063",
        "2x": "https://ps.w.org/youtube-embed/assets/icon-256x256.png?rev=2955063"
    },
    "blocks": [],
    "block_assets": [],
    "author_block_count": 0,
    "author_block_rating": 84,
    "blueprints": [],
    "preview_link": "",
    "language_packs": [
        {
            "type": "plugin",
            "slug": "youtube-embed",
            "language": "en_GB",
            "version": "5.3.1",
            "updated": "2024-01-15 15:23:22",
            "package": "https://downloads.wordpress.org/translation/plugin/youtube-embed/5.3.1/en_GB.zip"
        },
        {
            "type": "plugin",
            "slug": "youtube-embed",
            "language": "ru_RU",
            "version": "5.3.1",
            "updated": "2023-06-05 08:52:18",
            "package": "https://downloads.wordpress.org/translation/plugin/youtube-embed/5.3.1/ru_RU.zip"
        }
    ]
}