{
    "name": "YouTube WordPress Plugin by Embed Plus",
    "slug": "youtube-embed-plus",
    "version": "14.2.1.2",
    "author": "<a href=\"https://www.embedplus.com\">Embed Plus YouTube Plugin Team</a>",
    "author_profile": "https://profiles.wordpress.org/embedplus/",
    "contributors": {
        "embedplus": {
            "profile": "https://profiles.wordpress.org/embedplus/",
            "avatar": "https://secure.gravatar.com/avatar/8377a8ea62c50f8797f1d9c2a7ee1030?s=96&d=monsterid&r=g",
            "display_name": "embedplus"
        }
    },
    "requires": "4.5",
    "tested": "6.6.1",
    "requires_php": false,
    "requires_plugins": [],
    "compatibility": [],
    "rating": 92,
    "ratings": {
        "5": 486,
        "4": 16,
        "3": 6,
        "2": 8,
        "1": 48
    },
    "num_ratings": 564,
    "support_url": "https://wordpress.org/support/plugin/youtube-embed-plus/",
    "support_threads": 5,
    "support_threads_resolved": 0,
    "active_installs": 100000,
    "downloaded": 7732712,
    "last_updated": "2024-07-16 05:01:00",
    "added": "2012-12-24",
    "homepage": "https://www.embedplus.com/dashboard/pro-easy-video-analytics.aspx?ref=plugin",
    "sections": {
        "description": "<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/QDdvXBqfrzM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><strong>YouTube WordPress Plugin</strong> to embed and customize a YouTube gallery (channel or playlist),  YouTube livestream (and premiere), YouTube short, or standard YouTube video. This YouTube WordPress plugin can be customized in a wide variety of ways. The plugin also focuses on performance with the ability to lazy load with a facade and defer JavaScript while serving minified CSS and JavaScript. Here are a few recently added features to all versions (free and Pro) of this WordPress plugin:</p>\n<ul>\n<li>YouTube gallery embeds and standard videos now support Facade Mode which improves plugin performance by loading a lighter version of the player, until it is clicked. The plugin then loads the real YouTube embed after clicking (note: for live streams, the real player is always loaded).  We have tested this feature in multiple cases with a mix of other WordPress plugins, and we found it to successfully improve your Lighthouse performance score by addressing the following recommendation: &#8220;Some third-party resources can be lazy loaded with a facade &#8211; 1 facade alternative available.&#8221; You can demo this facade feature on our <a href=\"https://youtube-wordpress-plugin.embedplus.com/\" rel=\"nofollow ugc\">YouTube Plugin WordPress</a> test site.</li>\n<li>Defer critical and non critical JavaScript &#8211; improve the initial load time of your pages by allowing this plugin&#8217;s critical and non critical Javascript code to begin execution only after a page is loaded. That reasoning is the basis for the Defer CSS Javascript (styles and code) recommendation you&#8217;ll see in various web profiling tools.  We plan to add a plugin feature that will defer critical and non critical CSS in the future.</li>\n<li>Compatible with the WordPress Gutenberg block editor (it also stays backwards-compatible with the classic editor WordPress plugin). Both the Gutenberg block selector and the Gutenberg classic block will show the YouTube wizard button. For the Gutenberg block selector, click on the (+) sign for the block editor list. The YouTube Wizard block is located under the &#8220;Embeds&#8221; category (make sure you choose &#8220;YouTube <strong>Wizard</strong>&#8220;). See more on <a href=\"https://www.embedplus.com/embed-youtube-video-gallery-livestream-wordpress-gutenberg-block-editor.aspx\" rel=\"nofollow ugc\">how to embed a YouTube video, gallery, or livestream with the WordPress Gutenberg block editor here &gt;&gt;</a> The plugin is also compatible with several popular page builders like <a href=\"https://www.youtube.com/watch?v=ldNfIGRTxDU\" rel=\"nofollow ugc\">Elementor</a>, <a href=\"https://www.youtube.com/watch?v=bPgz0jyt7TE\" rel=\"nofollow ugc\">Beaver Builder</a>, <a href=\"https://www.youtube.com/watch?v=7QNYw_g-7WM\" rel=\"nofollow ugc\">SiteOrigin</a>, and <a href=\"https://www.youtube.com/watch?v=FWBQc9XhAqM\" rel=\"nofollow ugc\">Visual Composer</a>.  For these and pretty much any other page builder with a short code widget, you can also embed your video, gallery, live stream, or premiere by creating the short code in the plugin&#8217;s wizard and then embedding the code in the page builder&#8217;s short code widget or text widget.</li>\n<li>Privacy and Consent &#8211; Improved privacy and GDPR compliance options like YouTube no cookie, YouTube API restrictions, and a customizable GDPR consent message. Note: if you have a full-blown consent plugin installed on your WordPress site, you may not need these particular features of this YouTube plugin.</li>\n<li>YouTube gallery capability: channel and playlist – The ability to make playlist and channel embeds have a gallery layout. By default, the plugin can generate a grid-based <a href=\"https://www.embedplus.com/responsive-youtube-playlist-channel-gallery-for-wordpress.aspx\" rel=\"nofollow ugc\">responsive playlist or channel gallery &gt;&gt;</a>. Your visitors can browse through pages of video thumbnails and choose from videos that are pulled from an entire YouTube channel or playlist.</li>\n<li>YouTube gallery auto continuous play &#8211; embed a playlist or channel gallery and allow it to play one video after the next without requiring viewers to click a thumbnail.</li>\n<li>YouTube Premieres &#8211; The plugin provides you the same embedding methods for YouTube live streams as it does for premiere embeds.</li>\n<li>Simultaneous playback control &#8211; you can enable/disable the ability for visitors to have separate videos running at the same time on the same page. This also works with YouTube livestream and gallery embeds that are embedded by our YouTube plugin.</li>\n<li>Improved accessibility by using title attributes for screen reader support. Hopefully this plugin can help your site pass functional accessibility evaluations (FAE).</li>\n<li>Improved AJAX WordPress theme support.</li>\n<li>Site origin information with each embed code as an extra security measure. In YouTube&#8217;s/Google&#8217;s own words, checking this option &#8220;protects against malicious third-party JavaScript being injected into your page and hijacking control of your YouTube player.&#8221; We especially recommend checking it as it adds higher security than the built-in YouTube embedding method that comes with the current version of WordPress (i.e. oembed).</li>\n<li>Easy &#8220;Insert&#8221; button for both the Visual and Text mode of the editor (for YouTube gallery and live stream embedding as well).</li>\n<li>Embed an entire YouTube channel as a (non-gallery, single embedded player) playlist.</li>\n<li>Start video settings for playlist embeds. You can now choose to start a playlist with a specific video or have the plugin automatically start with the most recently added video. <strong>Note: If you&#8217;re embedding a YouTube gallery, the order will be defined by the order of the channel or playlist on YouTube.com</strong>.</li>\n<li><a href=\"https://www.embedplus.com/mute-volume-youtube-wordpress.aspx\" rel=\"nofollow ugc\">Volume level initialization</a> &#8211; helpful when autoplay is checked. Applies to all videos embedded with this YouTube plugin.</li>\n<li>iOS playback preferences.</li>\n<li>Automatic localization/internationalization so you can set the player&#8217;s interface language from English to another.</li>\n<li>Instant HTTPS support. It can even convert past non-HTTPS videos to HTTPS.  Did you know that Google uses HTTPS/SSL support as a ranking signal for SERP?</li>\n<li>&#8220;At a Glance&#8221; direct access to your YouTube posts/pages.</li>\n<li>Shortcode support for embedding multiple videos on one line.</li>\n<li>General playlist embedding support.</li>\n<li>YouTube WordPress plugin migration support (allows you convert other YouTube plugin embeds to ours).</li>\n</ul>\n<p><strong>Click the Download button to start exploring this YouTube WordPress plugin</strong>, or take a look at some more introductory details below.</p>\n<p>This plugin helps you easily manage the growing complexity of YouTube embedding. It provides a spectrum of basic and advanced features of the YouTube embedded player and will have you posting videos in seconds after installing it.</p>\n<p>The settings page has plenty of default options that you can automatically apply to your embedded YouTube video, gallery, and/or live stream:</p>\n<ul>\n<li>Modest branding &#8211; hide YouTube logo while playing (note that the YouTube watermark is shown instead)</li>\n<li>Turn on/off all annotations by default</li>\n<li>Automatically center all your videos</li>\n<li>Automatically start playing your videos</li>\n<li>Autohide controls until hovering</li>\n<li>Loop your videos</li>\n<li>Show/hide related videos at the end</li>\n<li>Show/hide the video title and other info (YouTube/Google has deprecated this feature)</li>\n<li>Use the light theme</li>\n<li>Show/hide player controls</li>\n<li>Turn on/off closed captions by default</li>\n<li>Make your video, gallery, or live stream responsive so that it dynamically fits in all screen sizes (smart phone, PC and tablet)</li>\n</ul>\n<p>Customizations can be also made to each YouTube embed by adding more to the link as shown below. Adding these will override the above global defaults that you set:</p>\n<ul>\n<li>width &#8211; Sets the width of your player. If omitted, the default width will be the width of your theme&#8217;s content. Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;width=500&amp;height=350\"</code></li>\n<li>height &#8211; Sets the height of your player. If omitted, this will be calculated for you automatically. Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;width=500&amp;height=350\"</code></li>\n<li>autoplay &#8211; Set this to 1 to autoplay the video (or 0 to play the video once). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;autoplay=1\"</code></li>\n<li>cc_load_policy &#8211; Set this to 1 to turn on closed captioning (or 0 to leave them off). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;cc_load_policy=1\"</code></li>\n<li>iv_load_policy &#8211; Set this to 3 to turn off annotations (or 1 to show them). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;iv_load_policy=3\"</code></li>\n<li>loop &#8211; Set this to 1 to loop the video (or 0 to not loop). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;loop=1\"</code></li>\n<li>modestbranding &#8211; Set this to 1 to remove the YouTube logo while playing (or 0 to show the logo). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;modestbranding=1\"</code></li>\n<li>rel &#8211; Set this to 0 to only show related videos from the same channel as the current video (or 1 to show videos from any channel). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;rel=0\"</code></li>\n<li>showinfo &#8211; Set this to 0 to hide the video title and other info (or 1 to show it). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;showinfo=0\"</code> (YouTube/Google has deprecated this feature)</li>\n<li>fs &#8211; Set this to 0 to hide the fullscreen button (or 1 to show it). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;fs=0\"</code></li>\n</ul>\n<p>You can also start and end each individual video at particular times. Like the above, each option should begin with &#8216;&amp;&#8217;</p>\n<ul>\n<li>start &#8211; Sets the time (in seconds) to start the video. Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;width=500&amp;height=350&amp;start=20\"</code></li>\n<li>end &#8211; Sets the time (in seconds) to stop the video. Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;width=500&amp;height=350&amp;end=100\"</code></li>\n</ul>\n<blockquote>\n<p><strong>About the Pro version of the <a href=\"https://www.embedplus.com/dashboard/pro-easy-video-analytics.aspx?ref=readme\" rel=\"nofollow ugc\">YouTube WordPress Plugin</a></strong></p>\n<p>If you like this free version, you may even upgrade to a separate Pro plugin with features like:</p>\n<ul>\n<li>Full visual embedding wizard </li>\n<li><a href=\"https://www.embedplus.com/responsive-youtube-playlist-channel-gallery-for-wordpress.aspx\" rel=\"nofollow ugc\">Alternate playlist and channel gallery styling &gt;&gt;</a> (list layouts and slider layouts, popup/lightbox player, thumbnail hiding for text only paging, and more)</li>\n<li>Caching to avoid making frequent requests to YouTube.com and speed up your page loads</li>\n<li>Automatic video thumbnail images: each post or page that contains at least one video will have the thumbnail of its first video serve as its featured image</li>\n<li><a href=\"https://www.embedplus.com/defer-parsing-of-javascript-improve-gtmetrix-speed-of-page-with-youtube-embed.aspx\" rel=\"nofollow ugc\">Lazy load YouTube embeds &gt;&gt;</a> with eye-catching <a href=\"https://www.embedplus.com/add-special-effects-to-youtube-embeds-in-wordpress.aspx\" rel=\"nofollow ugc\">effects and animations</a></li>\n<li><a href=\"https://www.embedplus.com/embed-youtube-live-chat-box-with-live-stream-embed-wordpress.aspx\" rel=\"nofollow ugc\">YouTube live chat &gt;&gt;</a> Add more interaction to your site by including the YouTube live chat box as part of each live stream embed. Note that live chat can also be an option for earning money from your audience by using the Super Chat and Super Stickers feature.</li>\n<li>Automatic tagging for video SEO</li>\n<li>Automatic Open Graph tagging for Facebook</li>\n<li>Deleted video alerts (i.e., did Google remove or take down videos I previously embedded?) </li>\n<li>Mobile compatibility checking (i.e., see if your embeds have restrictions that can block your site&#8217;s mobile visitors from viewing)</li>\n<li>Alerts when visitors from different countries are blocked from viewing your embeds</li>\n<li>Priority support</li>\n</ul>\n<p>You also get access to our deleted video alerts to help avoid showing embedded videos that are later removed from YouTube.com. You even get an embedder-centric <a href=\"https://www.embedplus.com/dashboard/easy-youtube-analytics-preview.aspx?platform=sim\" rel=\"nofollow ugc\">analytics dashboard</a> that adds view tracking to each of your embeds so that you can answers questions like:</p>\n<ul>\n<li>How much are your visitors actually watching the videos you post?</li>\n<li>How does the view activity on your site compare to other sites like it?</li>\n<li>What and when are your best and worst performing YouTube embeds?</li>\n<li>How much do the producers of the YouTube videos you embed rely on <strong>your site</strong>, versus other sites and YouTube.com, for views?</li>\n<li>Are you embedding videos that are blocked in other countries?</li>\n<li>Have your visitors tried to view a page and/or gallery on your site with deleted/unavailable videos?</li>\n</ul>\n</blockquote>\n<p>See more details after installing. Enjoy!</p>\n<p><a href=\"https://www.embedplus.com/\" rel=\"nofollow ugc\">This WordPress plugin is maintained by Embed Plus for YouTube &gt;&gt;</a><br />\nThis YouTube plugin can include premium features like lazy load (with animation), alternate playlist and channel gallery styles, automatic video thumbnail support, automatic schema tagging for video SEO, mobile compatibility checking, and deleted video alerts when you <a href=\"https://www.embedplus.com/dashboard/pro-easy-video-analytics.aspx?ref=readme\" rel=\"nofollow ugc\">upgrade to PRO</a>.</p>\n",
        "installation": "<ol>\n<li>Use the WordPress plugin installer to install the plugin.  Alternatively, you can just extract the folder in our download package and upload it to your plugin directory.</li>\n<li>Access the Plugins admin menu to activate the YouTube embed plugin.</li>\n<li>Make your default settings after clicking the new YouTube menu item that shows up in your admin panel. This is where you can make global settings on the appearance of each video and gallery, as well as activate: defer JavaScript  (defer CSS coming soon), GDPR mode, user restrictions, and more.</li>\n<li>To embed videos in your post, use the wizard to embed the shortcode. Example: <code>[embedyt]https://www.youtube.com/watch?v=ABCDEFGHIJK&amp;width=400&amp;height=250[/embedyt]</code> If you don&#8217;t know exactly which video you want to embed, use the free built-in search feature to find and insert one.</li>\n<li>You can also <a href=\"https://www.embedplus.com/responsive-youtube-playlist-channel-gallery-for-wordpress.aspx\" rel=\"nofollow ugc\">embed a playlist and channel gallery with this plugin &gt;&gt;</a>.  Please install the plugin and visit the settings page for instructions.</li>\n<li>To get video SEO, an analytics dashboard and many other premium features, <a href=\"https://www.embedplus.com/dashboard/pro-easy-video-analytics.aspx?ref=readme\" rel=\"nofollow ugc\">sign up for one of the options here &gt;&gt;</a></li>\n</ol>\n<p><strong>Manual codes (adding these will override the default settings in the admin):</strong></p>\n<ul>\n<li>width &#8211; Sets the width of your player. If omitted, the default width will be the width of your theme&#8217;s content. Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;width=500&amp;height=350\"</code></li>\n<li>height &#8211; Sets the height of your player. If omitted, this will be calculated for you automatically. Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;width=500&amp;height=350\"</code></li>\n<li>autoplay &#8211; Set this to 1 to autoplay the video (or 0 to play the video once). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;autoplay=1\"</code></li>\n<li>cc_load_policy &#8211; Set this to 1 to turn on closed captioning (or 0 to leave them off). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;cc_load_policy=1\"</code></li>\n<li>iv_load_policy &#8211; Set this to 3 to turn off annotations (or 1 to show them). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;iv_load_policy=3\"</code></li>\n<li>loop &#8211; Set this to 1 to loop the video (or 0 to not loop). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;loop=1\"</code></li>\n<li>modestbranding &#8211; Set this to 1 to remove the YouTube logo while playing (or 0 to show the logo). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;modestbranding=1\"</code></li>\n<li>rel &#8211; Set this to 0 to only show related videos from the same channel as the current video (or 1 to show videos from any channel). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;rel=0\"</code></li>\n<li>showinfo &#8211; Set this to 0 to hide the video title and other info (or 1 to show it). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;showinfo=0\"</code> (YouTube/Google has deprecated this feature)</li>\n<li>fs &#8211; Set this to 0 to hide the fullscreen button (or 1 to show it). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;fs=0\"</code></li>\n</ul>\n<p>You can also start and end each individual video at particular times. Like the above, each option should begin with &#8216;&amp;&#8217;</p>\n<ul>\n<li>start &#8211; Sets the time (in seconds) to start the video. Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;width=500&amp;height=350&amp;start=20\"</code></li>\n<li>end &#8211; Sets the time (in seconds) to stop the video. Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;width=500&amp;height=350&amp;end=100\"</code></li>\n</ul>\n<p><strong>We recommend using the wizard, but if you&#8217;re manually pasting a link, always follow these rules:</strong></p>\n<ul>\n<li>Make sure the url is really on its own line by itself. Or, if you need multiple videos on the same line, make sure each URL is wrapped properly with the shortcode. Example: <code>[embedyt]https://www.youtube.com/watch?v=ABCDEFGHIJK&amp;width=400&amp;height=250[/embedyt]</code></li>\n<li>Make sure the url is not an active hyperlink (i.e., it should just be plain text). Otherwise, highlight the url and click the &#8220;unlink&#8221; button in your editor.</li>\n<li>Make sure you did <strong>not</strong> format or align the url in any way. If your url still appears in your actual post instead of a video, highlight it and click the &#8220;remove formatting&#8221; button (formatting can be invisible sometimes).</li>\n<li>Finally, there&#8217;s a slight chance your custom theme is the issue, if you have one. To know for sure, we suggest temporarily switching to one of the default WordPress themes (e.g., &#8220;Twenty Thirteen&#8221;) just to see if your video does appear. If it suddenly works, then your custom theme is the issue. You can switch back when done testing.</li>\n</ul>\n",
        "faq": "\n<dt id='how%20do%20i%20add%20this%20youtube%20plugin%20to%20wordpress%3F'>\nHow do I add this YouTube plugin to WordPress?\n</h4>\n<p>\n<p>Watch the following YouTube video which shows the process for our specific plugin:</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/9RveWWsrmuw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n</p>\n<dt id='how%20do%20i%20embed%20a%20youtube%20video%20with%20a%20facade%3F'>\nHow do I embed a YouTube video with a facade?\n</h4>\n<p>\n<p>See a demo on this <a href=\"https://youtube-wordpress-plugin.embedplus.com/youtube-embed-with-facade/\" rel=\"nofollow ugc\">YouTube WordPress Test Page</a></p>\n</p>\n<dt id='how%20do%20i%20create%20a%20youtube%20gallery%20in%20wordpress%3F'>\nHow do I create a YouTube gallery in WordPress?\n</h4>\n<p>\n<p>Here&#8217;s a video that shows the steps with our YouTube plugin, along with the full set of gallery features:</p>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/iMX5TMobCw4?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n</p>\n<dt id='why%20use%20a%20youtube%20plugin%3F'>\nWhy use a YouTube plugin?\n</h4>\n<p>\n<p>You can certainly embed YouTube videos in WordPress with oembed using the default embedder. However, a good YouTube WordPress plugin helps you easily embed and customize a video, playlist, channel, gallery, premiere, live stream, and facade.  The premium version of this plugin has additional features like embed playback analytics.</p>\n</p>\n<dt id='how%20to%20get%20a%20youtube%20api%20key%3F'>\nHow to get a YouTube API key?\n</h4>\n<p>\n<p>To embed a gallery, livestream, schema tags, and more, you&#8217;ll need to get a YouTube API key from Google. The Data API is free and comes with a decent quota, which can be extended.  See here for <a href=\"https://www.embedplus.com/how-to-create-a-youtube-api-key.aspx\" rel=\"nofollow ugc\">steps on creating a YouTube API key</a>.</p>\n<p>You can also learn plenty of other tips on the <a href=\"https://www.embedplus.com/youtube-plugin-documentation.aspx\" rel=\"nofollow ugc\">EmbedPlus How To Page</a>.</p>\n</p>\n<dt id='how%20do%20i%20embed%20a%20youtube%20livestream%20on%20wordpress%3F'>\nHow do I embed a YouTube livestream on WordPress?\n</h4>\n<p>\n<p>Assuming you already have the EmbedPlus plugin active, you can embed a YouTube stream (premiere or livestream) in a very similar manner.</p>\n<ul>\n<li>[Steps for a premiere](https://www.youtube.com/watch?v=PqroYZ1qVtY}</li>\n<li><a href=\"https://www.youtube.com/watch?v=PQ5mY2WaqcI&amp;t=218s\" rel=\"nofollow ugc\">Steps for a standard live stream</a></li>\n</ul>\n</p>\n\n",
        "changelog": "<h4>Embed Plus for YouTube WordPress Plugin 14.2.1.2</h4>\n<ul>\n<li>This update addresses issues with the <a href=\"https://www.embedplus.com/how-to-embed-a-youtube-livestream-in-wordpress.aspx\" rel=\"nofollow ugc\">channel-based automatic live stream detection/loading feature</a> for the <a href=\"https://www.embedplus.com/dashboard/pro-easy-video-analytics.aspx\" rel=\"nofollow ugc\">Pro version</a>, and provides better compatibility with PHP 8.3+ for both Free and Pro versions.</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.2.1</h4>\n<ul>\n<li>This update fixes issues with the <a href=\"https://www.embedplus.com/how-to-embed-a-youtube-livestream-in-wordpress.aspx\" rel=\"nofollow ugc\">channel-based automatic live stream detection/loading feature</a> for the <a href=\"https://www.embedplus.com/dashboard/pro-easy-video-analytics.aspx\" rel=\"nofollow ugc\">Pro version</a>, and better responsive sizing HTML validation for both Free and Pro versions.</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.2</h4>\n<ul>\n<li>This update gives guidance to YouTube&#8217;s recent API limitations on the <a href=\"https://www.embedplus.com/how-to-embed-a-youtube-livestream-in-wordpress.aspx\" rel=\"nofollow ugc\">channel-based automatic live stream detection/loading feature</a>, with a solution available to <a href=\"https://www.embedplus.com/dashboard/pro-easy-video-analytics.aspx\" rel=\"nofollow ugc\">Pro users</a></li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.1.6.3</h4>\n<ul>\n<li>Fixes a compatibility issue with Contact Forms 7</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.1.6.2</h4>\n<ul>\n<li>Updated API key instructions</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.1.6.1</h4>\n<ul>\n<li>Fixes a YouTube API referer issue that occurs on some hosts</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.1.6</h4>\n<ul>\n<li>Tested for compatibility with WordPress 6.2+</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.1.5</h4>\n<ul>\n<li>Ability to turn on/off maxresdefault image quality</li>\n<li>Prevent iframes from affecting main frame browser history</li>\n<li>Better calls to htmlspecialchars function</li>\n<li>Wizard window size fix</li>\n<li>Fix livestream fallback issue</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.1.4.1</h4>\n<ul>\n<li>Better compatibility with older browsers</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.1.4</h4>\n<ul>\n<li>Fixes issues from 14.1.3</li>\n<li>Higher quality facade images</li>\n<li>Better compatibility with Jetpack and Short Pixel lazy loaded images</li>\n<li>Fixes an issue with the Classic/TinyMCE editor</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.1.3</h4>\n<ul>\n<li>Better compatibility with Jetpack images</li>\n<li>Avoids unused javascript when not using responsive sizing</li>\n<li>Fixes obscure livestream fallback issue</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.1.2</h4>\n<ul>\n<li>Higher quality facade images</li>\n<li>Avoid unused javascript with facade mode</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.1.1</h4>\n<ul>\n<li>Better compatability with WordPress 6.0</li>\n<li>Easier channel live stream wizard</li>\n<li>Cleaner uninstalls</li>\n<li>Add intro helper video</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.1</h4>\n<ul>\n<li>Adds the live stream fallback feature to channel-based live stream embeds</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.0.1.4</h4>\n<ul>\n<li>YouTube Wizard compatibility for WordPress 5.9+</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.0.1.3</h4>\n<ul>\n<li>Patch for 14.0.1.2, JS fix for compatibility with jQuery 3.0+</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.0.1.2</h4>\n<ul>\n<li>Fix facade playlist embed issue</li>\n<li>Improve compatibility with AJAX themes</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.0.1.1</h4>\n<ul>\n<li>Patch for 14.0.1, higher resolution for facade images</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.0.1</h4>\n<ul>\n<li>Higher resolution for facade images</li>\n<li>Fix CSS issue with GDPR embeds</li>\n<li>YouTube shorts support</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 14.0</h4>\n<ul>\n<li>New facade mode for lighter and faster page loads (see Performance tab)</li>\n<li>CSS fixes</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.4.3</h4>\n<ul>\n<li>Automatically turn on default dimensions for new installations, to skip oEmbed width/height lookups. Improves performance (recommended for all users, given most YouTube videos are 16:9 ratio)</li>\n<li>Better compatibility with cookie compliance plugins that overtake the player with a placeholder</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.4.2</h4>\n<ul>\n<li>Compatible with latest jQuery updates</li>\n<li>Compatible with WordPress 5.7+</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.4.1.2</h4>\n<ul>\n<li>Allows you to specify the default language (when available) that the player will use to display closed captions</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.4.1.1</h4>\n<ul>\n<li>Prevent deprecated notice for wp_make_content_images_responsive filter</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.4.1</h4>\n<ul>\n<li>Better compatibility with WordPress 5.5</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.4</h4>\n<ul>\n<li>Better compatibility with themes that use the Gutenberg block editor and responsive sizing</li>\n<li>Fix notice on new installs</li>\n<li>Add pagebuilder tips to Wizard tab of the documentation</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.3.1</h4>\n<ul>\n<li>Fix simultaneous playback control issue</li>\n<li>Add support for premiere video embedding</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.2.3</h4>\n<ul>\n<li>Defer JavaScript for performance</li>\n<li>Compatibility between loop and hide relative videos features</li>\n<li>Simultaneous playback control</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.2.1</h4>\n<ul>\n<li>Provides more compatibility with other lazyload plugins and responsive themes</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.2.0.2</h4>\n<ul>\n<li>Fixes the &#8220;Hide related videos at the end of playback&#8221; feature (fixes issue with galleries)</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.2.0.1</h4>\n<ul>\n<li>Compatibility with legacy versions of PHP</li>\n<li>Fix Responsive sizing issue with lazyloading plugins</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.2</h4>\n<ul>\n<li>Add ability to embed a live stream from a given channel</li>\n<li>Reduction in live stream YouTube API quota usage</li>\n<li>Compatibility with other plugins having tabbed sections (e.g. Yuzo)</li>\n<li>Show YouTube API errors to admins only</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.1.2.5</h4>\n<ul>\n<li>Improve responsive sizing aspect ratio in widgets</li>\n<li>Fix issue: some users receive 403 error when saving</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.1.2.4</h4>\n<ul>\n<li>Pagination and autonext allow the current video to play</li>\n<li>Pagination on mobile fix</li>\n<li>vi deprecation announcement</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.1.2.3</h4>\n<ul>\n<li>gallery thumbnail mobile tap/scroll fix</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.1.2.2</h4>\n<ul>\n<li>Wizard open/close fix</li>\n<li>iOS gallery thumbnail click fix</li>\n<li>class-oembed deprecation fix</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.1.2.1</h4>\n<ul>\n<li>Compatibility with legacy versions of PHP</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.1.2</h4>\n<ul>\n<li>More descriptive plugin name</li>\n<li>Gallery column size and YouTube API message fixes</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.1.1</h4>\n<ul>\n<li>Fixes gallery autonext issue</li>\n<li>Fixes deprecated controls parameter</li>\n<li>Fixes &#8220;not live&#8221; content issue</li>\n<li>Remove deprecated showinfo parameter</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.1</h4>\n<ul>\n<li>Brings back the ability to hide related/suggested videos at end of playback</li>\n<li>Allows monetized sites to select multiple IAB categories</li>\n<li>Option to run shortcode in admin (compatibility tab)</li>\n<li>Lowers quota usage for live videos</li>\n<li>Fixes &#8220;missing dependencies&#8221; block editor CSS reference</li>\n<li>Fixes default dimensions issue</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.0.1</h4>\n<ul>\n<li>Clearer instructions</li>\n<li>Feature deprecation (rel, showinfo)</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 13.0</h4>\n<ul>\n<li>Compatible with the new Gutenberg block editor, and stays backwards-compatible with the classic editor</li>\n<li>Marked deprecated features</li>\n<li>Improved wizard instructions</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 12.2</h4>\n<ul>\n<li>Improved ads.txt verification management</li>\n<li>Fixed gallery box-sizing bug</li>\n<li>Remove some deprecated YouTube parameters</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 12.1</h4>\n<ul>\n<li>Improved autoplay compatibility</li>\n<li>Improved sign-up process for the new monetization feature</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 12.0.1</h4>\n<ul>\n<li>Force HTTPS for the YouTube API if the API is enabled</li>\n<li>Makes the wizard&#8217;s lightbox expand/contract responsively for different size screens</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 12.0</h4>\n<ul>\n<li>Improves the admin interface, and includes a new optional feature for users that want to monetize their sites through contextual video from vi.ai.</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.9.2</h4>\n<ul>\n<li>Makes the GDPR consent message display more compatible with other plugins (fixes content filter)</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.9.1</h4>\n<p>Improved GDPR compliance, with new Privacy section containing:<br />\n* GDPR consent mode<br />\n* YouTube no cookie<br />\n* YouTube API loading restrictions</p>\n<h4>Embed Plus for YouTube WordPress Plugin 11.8.7</h4>\n<ul>\n<li>Helps with GDPR compliance by allowing you to choose when YouTube.com&#8217;s API is loaded</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.8.6.1</h4>\n<ul>\n<li>Rollback jQuery Updater plugin compatibility</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.8.6</h4>\n<ul>\n<li>Updated YouTube API key video tutorial</li>\n<li>Improved channel wizard process</li>\n<li>Better compatibility with jQuery Updater plugin</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.8.5</h4>\n<ul>\n<li>Adds the YouTube wizard button to the new built-in WordPress text widget</li>\n<li>Fixes a Mac/iOS gallery scrolling issue</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.8.4</h4>\n<ul>\n<li>Fixes gallery AJAX issue</li>\n<li>Adds ability to hide fullscreen button</li>\n<li>Adds ability to hide private videos from galleries</li>\n<li>Changes localized script dependency to jquery</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.8.3</h4>\n<ul>\n<li>Improved compatibility with PHP 7</li>\n<li>Improved compatibility with Divi theme</li>\n<li>Improved AJAX compatibility</li>\n<li>Improved accessibility</li>\n<li>Fix gallery scrolling</li>\n<li>Fix &#8220;not live&#8221; content output</li>\n<li>Modernize and improve wizard interface (Pro)</li>\n<li>Ability to hide thumbnail images from galleries (Pro)</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.8.2</h4>\n<ul>\n<li>Fix auto-next gallery issue</li>\n<li>Make settings form more secure</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.8.1</h4>\n<ul>\n<li>Fix playlist gallery issue</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.8</h4>\n<ul>\n<li>Improved AJAX theme compatibility</li>\n<li>Ability to choose which roles can use the editor wizard</li>\n<li>Volume + autoplay fix</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.7.1</h4>\n<ul>\n<li>Remove gallery thumbnail translucency</li>\n<li>Various bug fixes for galleries and the wizard</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.7</h4>\n<ul>\n<li>Separate Free and Pro codebases</li>\n<li>Remove deprecated features</li>\n<li>Clean up code</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.6</h4>\n<ul>\n<li>Fixed issue where Free version had some remnants of Pro analytics codebase supporting features here: https://www.embedplus.com/dashboard/easy-youtube-analytics-preview.aspx?platform=sim</li>\n<li>New feature: live streaming from a channel</li>\n<li>Optimized player and gallery loading that may improve Lighthouse reports</li>\n<li>Improved compatibility with pagebuilders</li>\n<li>Improved compatibility with later versions of jQuery</li>\n<li>Removed frameborder for W3C validation</li>\n<li>Gallery pagination enhancement</li>\n<li>PHP 7 compatibility testing</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.5</h4>\n<ul>\n<li>thumbnail stacking for mobile galleries</li>\n<li>better support for ajax themes</li>\n<li>alt text to images</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.4</h4>\n<ul>\n<li>(Free) Improved subscribe button CSS and a new migration option.</li>\n<li>(Pro) Improved accessibility for popup lightbox galleries.</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.3.1</h4>\n<ul>\n<li>(Free) improved debug mode messages</li>\n<li>(Pro) autonext for popup lightbox galleries and hide clear cache button option</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.3</h4>\n<ul>\n<li>Improved responsive sizing for AJAX-based themes</li>\n<li>Popup lightbox display option for Pro galleries</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.2</h4>\n<ul>\n<li>Adds improved wizard and gallery options for Free and Pro users.</li>\n<li>Improved handling of PHP notices.</li>\n<li>Clear cache shortcut added for Pro users.</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.1</h4>\n<ul>\n<li>Automatic continuous play for playlist and channel gallery embeds.</li>\n<li>Ability to add a YouTube channel subscription link to all galleries.</li>\n<li>Ability to hide Previous/Next buttons and page numbers.</li>\n<li>Featured images can now be pulled from playlists (using the thumbnail of the first video).</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 11.0.1</h4>\n<p>Improves HTTPS support for structured data tags, and HTTPS support in Firefox.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 11.0</h4>\n<p>Improves playlist and gallery embedding functionality.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 10.9</h4>\n<p>This version offers a host of updates: compatibility fixes, higher quality featured images, selective responsive sizing, wizard enhancements, and circular shaped thumbnails.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 10.8</h4>\n<p>This update improves compatibility and adds features to Free and Pro galleries.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 10.7</h4>\n<p>Adds legacy option.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 10.6</h4>\n<p>Enhanced debugging support for galleries.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 10.5</h4>\n<p>Enhanced gallery settings for scrolling, video titles, and thumbnail styling.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 10.4</h4>\n<p>Addresses limitations some users were getting when pasting a YouTube channel and/or playlist gallery.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 10.3</h4>\n<p>Adds the ability to make playlist and channel embeds have a gallery layout. By the default, the plugin can generate a grid-based <a href=\"https://www.embedplus.com/responsive-youtube-playlist-channel-gallery-for-wordpress.aspx\" rel=\"nofollow ugc\">responsive playlist and channel gallery &gt;&gt;</a></p>\n<h4>Embed Plus for YouTube WordPress Plugin 10.2</h4>\n<p>Adds start video settings for playlist embeds. You can now choose to start a playlist with a specific video or have the plugin automatically start with the most recently added video.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 10.1</h4>\n<p>Adds the ability to automatically migrate from another plugin&#8217;s shortcode. Caching feature now allows lifetime settings. Improved compatibility with other plugins using the YouTube API.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 10.0</h4>\n<p>This update includes improved tips (Free and Pro) and adds caching to the Pro version for faster page loading.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 9.8</h4>\n<p>Upgraded code to use YouTube API v3.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 9.7</h4>\n<p>Adds improved accessibility for screen readers and video thumbnail as featured image support.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 9.5</h4>\n<p>Site origin information with each embed code as an extra security measure. In YouTube&#8217;s/Google&#8217;s own words, checking this option &#8220;protects against malicious third-party JavaScript being injected into your page and hijacking control of your YouTube player.&#8221; We especially recommend checking it as it adds higher security than the built-in YouTube embedding method that comes with the current version of WordPress (i.e. oembed).</p>\n<h4>Embed Plus for YouTube WordPress Plugin 9.4</h4>\n<p>Adds Autofit Widget option for Free and PRO users. Also adds slide from left animation to <a href=\"https://www.embedplus.com/add-special-effects-to-youtube-embeds-in-wordpress.aspx\" rel=\"nofollow ugc\">PRO effects &gt;&gt;</a></p>\n<h4>Embed Plus for YouTube WordPress Plugin 9.3</h4>\n<p>Improved volume functionality and interface updates (Free and PRO).  <a href=\"https://www.embedplus.com/add-special-effects-to-youtube-embeds-in-wordpress.aspx\" rel=\"nofollow ugc\">Special effects added to PRO version &gt;&gt;</a></p>\n<h4>Embed Plus for YouTube WordPress Plugin 9.2</h4>\n<p>HTTPS/SSL detection is now fully automatic. The manual checkbox is no longer needed.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 9.1</h4>\n<p>With this version, the plugin can now automatically detect your site&#8217;s default language and set the interface of the embedded YouTube player to match.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 9.0</h4>\n<p>Adds automatic localization/internationalization so you can set the player&#8217;s interface language from English to another.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 8.9</h4>\n<p>Allows volume level initialization.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 8.8</h4>\n<ul>\n<li>Better embedplus plugin conflict notifications.</li>\n<li>Greater emphasis on HTTPS support due to Google&#8217;s recent announcement about <a href=\"https://embedplus.com/convert-old-youtube-embeds-to-https-ssl.aspx\" rel=\"nofollow ugc\">HTTPS/SSL as an SEO/SERP signal</a>.</li>\n<li>Supports latest version of WordPress (3.9.2).</li>\n</ul>\n<h4>Embed Plus for YouTube WordPress Plugin 8.7</h4>\n<p>(PRO) Extends the plugin&#8217;s existing tagging capabilities by also adding Open Graph markup to enhance Facebook sharing/discovery of your pages.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 8.6</h4>\n<p>Expanded HTTPS/SSL support.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 8.5</h4>\n<p>This update features a new iOS related option for both Free and PRO users. PRO users additionally have the new mobile compatibility checker.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 8.4</h4>\n<p>This update features improved responsive theme support for both Free and PRO versions.  It also adds refined schema tag support to the Pro SEO feature.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 8.3</h4>\n<p>Now compatible with WordPress 3.9.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 8.2</h4>\n<p>An at a glance regex improvement (all users). Dashboard now warns you of embeds that are blocked from your visitors in other countries (PRO).</p>\n<h4>Embed Plus for YouTube WordPress Plugin 8.1</h4>\n<p>Fixes rare YouTube ID issue.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 8.0</h4>\n<p>Fixes rare ajax issue.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 7.9</h4>\n<p>YouTube searching and inserting now works in Text mode of the editor too.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 7.8</h4>\n<p>&#8220;At a Glance&#8221; direct access to YouTube posts/pages.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 7.7</h4>\n<p>Fixes black bar issue when no height/width is specified.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 7.6</h4>\n<p>Added notice about Google&#8217;s HD problem.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 7.5</h4>\n<p>Ability to embed an entire channel as a playlist embed.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 7.3</h4>\n<p>Change the color of the progress bar from red to white.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 7.2</h4>\n<p>Added music video extras to inspire your posts (PRO).</p>\n<h4>Embed Plus for YouTube WordPress Plugin 7.1</h4>\n<p>Added autohide controls feature</p>\n<h4>Embed Plus for YouTube WordPress Plugin 7.0</h4>\n<p>Shortcode support for embedding multiple videos on one line</p>\n<h4>Embed Plus for YouTube WordPress Plugin 6.4</h4>\n<p>Fixes for some users of WordPress 3.8</p>\n<h4>Embed Plus for YouTube WordPress Plugin 6.3</h4>\n<p>Removed possible e_notices.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 6.2</h4>\n<p>Given the increasing focus on privacy, the no-cookies options was added as a free option to all users.  Priority support enhancements also made.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 6.1</h4>\n<p>Easier access to general settings and dashboard.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 6.0</h4>\n<p>This version opens up the ability to view Internet video discussions to all wizard users.<br />\n<strong>Also, due to numerous users being unable to find the wizard button, we moved it up next to the &#8220;Add Media&#8221; button.</strong><br />\nFinally, we added Video SEO tags as a PRO option.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 5.1</h4>\n<p>Added ability to set default dimensions.<br />\nEnhanced compatibility with SSL sites.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 5.0</h4>\n<p>Built-in YouTube video search, viewing, and insertion right from your editor tab (for all users).<br />\nThe ability to review the latest web discussions about a video you want to embed before embedding it (PRO users).<br />\nOther minor optimizations.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 4.8</h4>\n<p>Works when pasting embed link in sidebar text widgets</p>\n<h4>Embed Plus for YouTube WordPress Plugin 4.7</h4>\n<p>Improved separation of PRO and Free features in the UI</p>\n<h4>Embed Plus for YouTube WordPress Plugin 4.6</h4>\n<p>Added optional responsive video layout to fit all screen sizes. (smart phone, PC and tablet)</p>\n<h4>Embed Plus for YouTube WordPress Plugin 4.5</h4>\n<p>Added support for playlists.<br />\nadded support for wmode.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 4.1</h4>\n<p>Fixed spacing issue. Also added ability to fall back to old spacing format.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 4.0</h4>\n<p>New features for all users: lazy loading for the flash player by default and the ability to hide player controls for a cleaner look.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 3.7</h4>\n<p>Enhanced deleted video checker for PRO users</p>\n<h4>Embed Plus for YouTube WordPress Plugin 3.5</h4>\n<p>Added ability to try to force HTML5 player to speed up page loading</p>\n<h4>Embed Plus for YouTube WordPress Plugin 3.3</h4>\n<p>HTTPS: Added secure YouTube embedding</p>\n<h4>Embed Plus for YouTube WordPress Plugin 3.2</h4>\n<p>Ensures video-specific height overrides defaults properly</p>\n<h4>Embed Plus for YouTube WordPress Plugin 3.1</h4>\n<p>Fixed obscure height problem</p>\n<h4>Embed Plus for YouTube WordPress Plugin 3.0</h4>\n<p>Added Visual YouTube Wizard for PRO users<br />\nAdded autologin to analytics for PRO users<br />\nAdded priority support form for PRO users</p>\n<h4>Embed Plus for YouTube WordPress Plugin 2.6</h4>\n<p>Compatible with WP 3.6</p>\n<h4>Embed Plus for YouTube WordPress Plugin 2.4</h4>\n<p>Added auto HD support<br />\nSupport for shorthand (i.e. <code>\"https://www.youtu.be\"</code>)<br />\nFixed editor issue</p>\n<h4>Embed Plus for YouTube WordPress Plugin 2.3</h4>\n<p>Start/end time shortcut bug fix</p>\n<h4>Embed Plus for YouTube WordPress Plugin 2.2</h4>\n<p>Minor changes</p>\n<h4>Embed Plus for YouTube WordPress Plugin 2.1</h4>\n<p>By request from several users, we&#8217;ve added easier access to the video analytics dashboard</p>\n<h4>Embed Plus for YouTube WordPress Plugin 2.0</h4>\n<p>This upgrade specifically integrates a user-friendly YouTube Analytics Dashboard to this plugin so you can learn a lot more about the videos you post.  Download it if you would like it to use your site&#8217;s YouTube-related activity to help answer questions like:</p>\n<ul>\n<li>How much are your visitors actually watching the videos you post?</li>\n<li>How does the view activity on your site compare to other sites like it?</li>\n<li>What and when are your best and worst performers?</li>\n<li>How much do the producers of the YouTube videos you embed rely on <strong>your site</strong> for views?</li>\n</ul>\n<p>We think these are all interesting questions; however, note that there&#8217;s no need to upgrade if you don&#8217;t.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 1.1</h4>\n<p>Fixed minor bug.</p>\n<h4>Embed Plus for YouTube WordPress Plugin 1.0</h4>\n<p>First release uploaded to the plugin repository.</p>\n"
    },
    "short_description": "YouTube Embed WordPress Plugin. Embed a responsive video, YouTube channel gallery, playlist gallery, YouTube livestream. Defer JavaScript",
    "description": "<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/QDdvXBqfrzM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></p>\n<p><strong>YouTube WordPress Plugin</strong> to embed and customize a YouTube gallery (channel or playlist),  YouTube livestream (and premiere), YouTube short, or standard YouTube video. This YouTube WordPress plugin can be customized in a wide variety of ways. The plugin also focuses on performance with the ability to lazy load with a facade and defer JavaScript while serving minified CSS and JavaScript. Here are a few recently added features to all versions (free and Pro) of this WordPress plugin:</p>\n<ul>\n<li>YouTube gallery embeds and standard videos now support Facade Mode which improves plugin performance by loading a lighter version of the player, until it is clicked. The plugin then loads the real YouTube embed after clicking (note: for live streams, the real player is always loaded).  We have tested this feature in multiple cases with a mix of other WordPress plugins, and we found it to successfully improve your Lighthouse performance score by addressing the following recommendation: &#8220;Some third-party resources can be lazy loaded with a facade &#8211; 1 facade alternative available.&#8221; You can demo this facade feature on our <a href=\"https://youtube-wordpress-plugin.embedplus.com/\" rel=\"nofollow ugc\">YouTube Plugin WordPress</a> test site.</li>\n<li>Defer critical and non critical JavaScript &#8211; improve the initial load time of your pages by allowing this plugin&#8217;s critical and non critical Javascript code to begin execution only after a page is loaded. That reasoning is the basis for the Defer CSS Javascript (styles and code) recommendation you&#8217;ll see in various web profiling tools.  We plan to add a plugin feature that will defer critical and non critical CSS in the future.</li>\n<li>Compatible with the WordPress Gutenberg block editor (it also stays backwards-compatible with the classic editor WordPress plugin). Both the Gutenberg block selector and the Gutenberg classic block will show the YouTube wizard button. For the Gutenberg block selector, click on the (+) sign for the block editor list. The YouTube Wizard block is located under the &#8220;Embeds&#8221; category (make sure you choose &#8220;YouTube <strong>Wizard</strong>&#8220;). See more on <a href=\"https://www.embedplus.com/embed-youtube-video-gallery-livestream-wordpress-gutenberg-block-editor.aspx\" rel=\"nofollow ugc\">how to embed a YouTube video, gallery, or livestream with the WordPress Gutenberg block editor here &gt;&gt;</a> The plugin is also compatible with several popular page builders like <a href=\"https://www.youtube.com/watch?v=ldNfIGRTxDU\" rel=\"nofollow ugc\">Elementor</a>, <a href=\"https://www.youtube.com/watch?v=bPgz0jyt7TE\" rel=\"nofollow ugc\">Beaver Builder</a>, <a href=\"https://www.youtube.com/watch?v=7QNYw_g-7WM\" rel=\"nofollow ugc\">SiteOrigin</a>, and <a href=\"https://www.youtube.com/watch?v=FWBQc9XhAqM\" rel=\"nofollow ugc\">Visual Composer</a>.  For these and pretty much any other page builder with a short code widget, you can also embed your video, gallery, live stream, or premiere by creating the short code in the plugin&#8217;s wizard and then embedding the code in the page builder&#8217;s short code widget or text widget.</li>\n<li>Privacy and Consent &#8211; Improved privacy and GDPR compliance options like YouTube no cookie, YouTube API restrictions, and a customizable GDPR consent message. Note: if you have a full-blown consent plugin installed on your WordPress site, you may not need these particular features of this YouTube plugin.</li>\n<li>YouTube gallery capability: channel and playlist – The ability to make playlist and channel embeds have a gallery layout. By default, the plugin can generate a grid-based <a href=\"https://www.embedplus.com/responsive-youtube-playlist-channel-gallery-for-wordpress.aspx\" rel=\"nofollow ugc\">responsive playlist or channel gallery &gt;&gt;</a>. Your visitors can browse through pages of video thumbnails and choose from videos that are pulled from an entire YouTube channel or playlist.</li>\n<li>YouTube gallery auto continuous play &#8211; embed a playlist or channel gallery and allow it to play one video after the next without requiring viewers to click a thumbnail.</li>\n<li>YouTube Premieres &#8211; The plugin provides you the same embedding methods for YouTube live streams as it does for premiere embeds.</li>\n<li>Simultaneous playback control &#8211; you can enable/disable the ability for visitors to have separate videos running at the same time on the same page. This also works with YouTube livestream and gallery embeds that are embedded by our YouTube plugin.</li>\n<li>Improved accessibility by using title attributes for screen reader support. Hopefully this plugin can help your site pass functional accessibility evaluations (FAE).</li>\n<li>Improved AJAX WordPress theme support.</li>\n<li>Site origin information with each embed code as an extra security measure. In YouTube&#8217;s/Google&#8217;s own words, checking this option &#8220;protects against malicious third-party JavaScript being injected into your page and hijacking control of your YouTube player.&#8221; We especially recommend checking it as it adds higher security than the built-in YouTube embedding method that comes with the current version of WordPress (i.e. oembed).</li>\n<li>Easy &#8220;Insert&#8221; button for both the Visual and Text mode of the editor (for YouTube gallery and live stream embedding as well).</li>\n<li>Embed an entire YouTube channel as a (non-gallery, single embedded player) playlist.</li>\n<li>Start video settings for playlist embeds. You can now choose to start a playlist with a specific video or have the plugin automatically start with the most recently added video. <strong>Note: If you&#8217;re embedding a YouTube gallery, the order will be defined by the order of the channel or playlist on YouTube.com</strong>.</li>\n<li><a href=\"https://www.embedplus.com/mute-volume-youtube-wordpress.aspx\" rel=\"nofollow ugc\">Volume level initialization</a> &#8211; helpful when autoplay is checked. Applies to all videos embedded with this YouTube plugin.</li>\n<li>iOS playback preferences.</li>\n<li>Automatic localization/internationalization so you can set the player&#8217;s interface language from English to another.</li>\n<li>Instant HTTPS support. It can even convert past non-HTTPS videos to HTTPS.  Did you know that Google uses HTTPS/SSL support as a ranking signal for SERP?</li>\n<li>&#8220;At a Glance&#8221; direct access to your YouTube posts/pages.</li>\n<li>Shortcode support for embedding multiple videos on one line.</li>\n<li>General playlist embedding support.</li>\n<li>YouTube WordPress plugin migration support (allows you convert other YouTube plugin embeds to ours).</li>\n</ul>\n<p><strong>Click the Download button to start exploring this YouTube WordPress plugin</strong>, or take a look at some more introductory details below.</p>\n<p>This plugin helps you easily manage the growing complexity of YouTube embedding. It provides a spectrum of basic and advanced features of the YouTube embedded player and will have you posting videos in seconds after installing it.</p>\n<p>The settings page has plenty of default options that you can automatically apply to your embedded YouTube video, gallery, and/or live stream:</p>\n<ul>\n<li>Modest branding &#8211; hide YouTube logo while playing (note that the YouTube watermark is shown instead)</li>\n<li>Turn on/off all annotations by default</li>\n<li>Automatically center all your videos</li>\n<li>Automatically start playing your videos</li>\n<li>Autohide controls until hovering</li>\n<li>Loop your videos</li>\n<li>Show/hide related videos at the end</li>\n<li>Show/hide the video title and other info (YouTube/Google has deprecated this feature)</li>\n<li>Use the light theme</li>\n<li>Show/hide player controls</li>\n<li>Turn on/off closed captions by default</li>\n<li>Make your video, gallery, or live stream responsive so that it dynamically fits in all screen sizes (smart phone, PC and tablet)</li>\n</ul>\n<p>Customizations can be also made to each YouTube embed by adding more to the link as shown below. Adding these will override the above global defaults that you set:</p>\n<ul>\n<li>width &#8211; Sets the width of your player. If omitted, the default width will be the width of your theme&#8217;s content. Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;width=500&amp;height=350\"</code></li>\n<li>height &#8211; Sets the height of your player. If omitted, this will be calculated for you automatically. Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;width=500&amp;height=350\"</code></li>\n<li>autoplay &#8211; Set this to 1 to autoplay the video (or 0 to play the video once). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;autoplay=1\"</code></li>\n<li>cc_load_policy &#8211; Set this to 1 to turn on closed captioning (or 0 to leave them off). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;cc_load_policy=1\"</code></li>\n<li>iv_load_policy &#8211; Set this to 3 to turn off annotations (or 1 to show them). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;iv_load_policy=3\"</code></li>\n<li>loop &#8211; Set this to 1 to loop the video (or 0 to not loop). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;loop=1\"</code></li>\n<li>modestbranding &#8211; Set this to 1 to remove the YouTube logo while playing (or 0 to show the logo). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;modestbranding=1\"</code></li>\n<li>rel &#8211; Set this to 0 to only show related videos from the same channel as the current video (or 1 to show videos from any channel). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;rel=0\"</code></li>\n<li>showinfo &#8211; Set this to 0 to hide the video title and other info (or 1 to show it). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;showinfo=0\"</code> (YouTube/Google has deprecated this feature)</li>\n<li>fs &#8211; Set this to 0 to hide the fullscreen button (or 1 to show it). Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;fs=0\"</code></li>\n</ul>\n<p>You can also start and end each individual video at particular times. Like the above, each option should begin with &#8216;&amp;&#8217;</p>\n<ul>\n<li>start &#8211; Sets the time (in seconds) to start the video. Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;width=500&amp;height=350&amp;start=20\"</code></li>\n<li>end &#8211; Sets the time (in seconds) to stop the video. Example: <code>\"https://www.youtube.com/watch?v=quwebVjAEJA&amp;width=500&amp;height=350&amp;end=100\"</code></li>\n</ul>\n<blockquote>\n<p><strong>About the Pro version of the <a href=\"https://www.embedplus.com/dashboard/pro-easy-video-analytics.aspx?ref=readme\" rel=\"nofollow ugc\">YouTube WordPress Plugin</a></strong></p>\n<p>If you like this free version, you may even upgrade to a separate Pro plugin with features like:</p>\n<ul>\n<li>Full visual embedding wizard </li>\n<li><a href=\"https://www.embedplus.com/responsive-youtube-playlist-channel-gallery-for-wordpress.aspx\" rel=\"nofollow ugc\">Alternate playlist and channel gallery styling &gt;&gt;</a> (list layouts and slider layouts, popup/lightbox player, thumbnail hiding for text only paging, and more)</li>\n<li>Caching to avoid making frequent requests to YouTube.com and speed up your page loads</li>\n<li>Automatic video thumbnail images: each post or page that contains at least one video will have the thumbnail of its first video serve as its featured image</li>\n<li><a href=\"https://www.embedplus.com/defer-parsing-of-javascript-improve-gtmetrix-speed-of-page-with-youtube-embed.aspx\" rel=\"nofollow ugc\">Lazy load YouTube embeds &gt;&gt;</a> with eye-catching <a href=\"https://www.embedplus.com/add-special-effects-to-youtube-embeds-in-wordpress.aspx\" rel=\"nofollow ugc\">effects and animations</a></li>\n<li><a href=\"https://www.embedplus.com/embed-youtube-live-chat-box-with-live-stream-embed-wordpress.aspx\" rel=\"nofollow ugc\">YouTube live chat &gt;&gt;</a> Add more interaction to your site by including the YouTube live chat box as part of each live stream embed. Note that live chat can also be an option for earning money from your audience by using the Super Chat and Super Stickers feature.</li>\n<li>Automatic tagging for video SEO</li>\n<li>Automatic Open Graph tagging for Facebook</li>\n<li>Deleted video alerts (i.e., did Google remove or take down videos I previously embedded?) </li>\n<li>Mobile compatibility checking (i.e., see if your embeds have restrictions that can block your site&#8217;s mobile visitors from viewing)</li>\n<li>Alerts when visitors from different countries are blocked from viewing your embeds</li>\n<li>Priority support</li>\n</ul>\n<p>You also get access to our deleted video alerts to help avoid showing embedded videos that are later removed from YouTube.com. You even get an embedder-centric <a href=\"https://www.embedplus.com/dashboard/easy-youtube-analytics-preview.aspx?platform=sim\" rel=\"nofollow ugc\">analytics dashboard</a> that adds view tracking to each of your embeds so that you can answers questions like:</p>\n<ul>\n<li>How much are your visitors actually watching the videos you post?</li>\n<li>How does the view activity on your site compare to other sites like it?</li>\n<li>What and when are your best and worst performing YouTube embeds?</li>\n<li>How much do the producers of the YouTube videos you embed rely on <strong>your site</strong>, versus other sites and YouTube.com, for views?</li>\n<li>Are you embedding videos that are blocked in other countries?</li>\n<li>Have your visitors tried to view a page and/or gallery on your site with deleted/unavailable videos?</li>\n</ul>\n</blockquote>\n<p>See more details after installing. Enjoy!</p>\n<p><a href=\"https://www.embedplus.com/\" rel=\"nofollow ugc\">This WordPress plugin is maintained by Embed Plus for YouTube &gt;&gt;</a><br />\nThis YouTube plugin can include premium features like lazy load (with animation), alternate playlist and channel gallery styles, automatic video thumbnail support, automatic schema tagging for video SEO, mobile compatibility checking, and deleted video alerts when you <a href=\"https://www.embedplus.com/dashboard/pro-easy-video-analytics.aspx?ref=readme\" rel=\"nofollow ugc\">upgrade to PRO</a>.</p>\n",
    "download_link": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.2.1.2.zip",
    "upgrade_notice": [],
    "screenshots": [
        {
            "src": "https://ps.w.org/youtube-embed-plus/trunk/screenshot-1.jpg?rev=3118837",
            "caption": "Embed Plus for YouTube WordPress Plugin Screenshot 1: Paste a YouTube link on its own line and it will become a YouTube embed on your website. Or, use the shortcode method."
        },
        {
            "src": "https://ps.w.org/youtube-embed-plus/trunk/screenshot-2.jpg?rev=3118837",
            "caption": "Embed Plus for YouTube WordPress Plugin Screenshot 2: How to get to YouTube's admin settings"
        },
        {
            "src": "https://ps.w.org/youtube-embed-plus/trunk/screenshot-3.jpg?rev=3118837",
            "caption": "Embed Plus for YouTube WordPress Plugin Screenshot 3: Visual YouTube Wizard and Search Tool"
        },
        {
            "src": "https://ps.w.org/youtube-embed-plus/trunk/screenshot-4.jpg?rev=3118837",
            "caption": "Embed Plus for YouTube WordPress Plugin Screenshot 4: Wizard Insert Search Result Screenshot"
        },
        {
            "src": "https://ps.w.org/youtube-embed-plus/trunk/screenshot-5.jpg?rev=3118837",
            "caption": "Embed Plus for YouTube WordPress Plugin Screenshot 5: Wizard Search Results Screenshot"
        },
        {
            "src": "https://ps.w.org/youtube-embed-plus/trunk/screenshot-6.jpg?rev=3118837",
            "caption": "Embed Plus for YouTube WordPress Plugin Screenshot 6: Gallery layout for a playlist or channel"
        },
        {
            "src": "https://ps.w.org/youtube-embed-plus/trunk/screenshot-7.jpg?rev=3118837",
            "caption": "Embed Plus for YouTube WordPress Plugin Screenshot 7: YouTube playlist galleries are also easily supported.  Here's the Billboard Top 25 Songs for example."
        },
        {
            "src": "https://ps.w.org/youtube-embed-plus/trunk/screenshot-8.jpg?rev=3118837",
            "caption": "Embed Plus for YouTube WordPress Plugin Screenshot 8: Localization/internationalization so you can set the player's interface language"
        },
        {
            "src": "https://ps.w.org/youtube-embed-plus/trunk/screenshot-9.jpg?rev=3118837",
            "caption": "Embed Plus for YouTube WordPress Plugin Screenshot 9: Optional YouTube channel subscription button above gallery thumbnails"
        }
    ],
    "tags": {
        "channel-gallery": "channel gallery",
        "defer-css-javascript": "defer css javascript",
        "playlist-gallery": "playlist gallery",
        "youtube-gallery": "youtube gallery",
        "youtube-wordpress-plugin": "youtube wordpress plugin"
    },
    "stable_tag": "14.2.1.2",
    "versions": {
        "1.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.1.0.zip",
        "1.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.1.1.zip",
        "10.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.10.0.zip",
        "10.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.10.1.zip",
        "10.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.10.2.zip",
        "10.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.10.3.zip",
        "10.4": "https://downloads.wordpress.org/plugin/youtube-embed-plus.10.4.zip",
        "10.5": "https://downloads.wordpress.org/plugin/youtube-embed-plus.10.5.zip",
        "10.6": "https://downloads.wordpress.org/plugin/youtube-embed-plus.10.6.zip",
        "10.7": "https://downloads.wordpress.org/plugin/youtube-embed-plus.10.7.zip",
        "10.8": "https://downloads.wordpress.org/plugin/youtube-embed-plus.10.8.zip",
        "10.9": "https://downloads.wordpress.org/plugin/youtube-embed-plus.10.9.zip",
        "11.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.0.zip",
        "11.0.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.0.1.zip",
        "11.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.1.zip",
        "11.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.2.zip",
        "11.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.3.zip",
        "11.3.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.3.1.zip",
        "11.4": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.4.zip",
        "11.5": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.5.zip",
        "11.6": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.6.zip",
        "11.7": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.7.zip",
        "11.7.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.7.1.zip",
        "11.8": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.8.zip",
        "11.8.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.8.1.zip",
        "11.8.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.8.2.zip",
        "11.8.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.8.3.zip",
        "11.8.4": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.8.4.zip",
        "11.8.5": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.8.5.zip",
        "11.8.6": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.8.6.zip",
        "11.8.6.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.8.6.1.zip",
        "11.8.7": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.8.7.zip",
        "11.9.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.9.1.zip",
        "11.9.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.11.9.2.zip",
        "12.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.12.0.zip",
        "12.0.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.12.0.1.zip",
        "12.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.12.1.zip",
        "12.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.12.2.zip",
        "13.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.0.zip",
        "13.0.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.0.1.zip",
        "13.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.1.zip",
        "13.1.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.1.1.zip",
        "13.1.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.1.2.zip",
        "13.1.2.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.1.2.1.zip",
        "13.1.2.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.1.2.2.zip",
        "13.1.2.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.1.2.3.zip",
        "13.1.2.4": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.1.2.4.zip",
        "13.1.2.5": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.1.2.5.zip",
        "13.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.2.zip",
        "13.2.0.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.2.0.1.zip",
        "13.2.0.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.2.0.2.zip",
        "13.2.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.2.1.zip",
        "13.2.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.2.3.zip",
        "13.3.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.3.1.zip",
        "13.4": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.4.zip",
        "13.4.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.4.1.zip",
        "13.4.1.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.4.1.1.zip",
        "13.4.1.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.4.1.2.zip",
        "13.4.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.4.2.zip",
        "13.4.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.13.4.3.zip",
        "14.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.0.zip",
        "14.0.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.0.1.zip",
        "14.0.1.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.0.1.1.zip",
        "14.0.1.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.0.1.2.zip",
        "14.0.1.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.0.1.3.zip",
        "14.0.1.4": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.0.1.4.zip",
        "14.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.1.zip",
        "14.1.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.1.1.zip",
        "14.1.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.1.2.zip",
        "14.1.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.1.3.zip",
        "14.1.4": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.1.4.zip",
        "14.1.4.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.1.4.1.zip",
        "14.1.5": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.1.5.zip",
        "14.1.6": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.1.6.zip",
        "14.1.6.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.1.6.1.zip",
        "14.1.6.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.1.6.2.zip",
        "14.1.6.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.1.6.3.zip",
        "14.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.2.zip",
        "14.2.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.2.1.zip",
        "14.2.1.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.14.2.1.2.zip",
        "2.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.2.0.zip",
        "2.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.2.1.zip",
        "2.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.2.2.zip",
        "2.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.2.3.zip",
        "2.4": "https://downloads.wordpress.org/plugin/youtube-embed-plus.2.4.zip",
        "2.6": "https://downloads.wordpress.org/plugin/youtube-embed-plus.2.6.zip",
        "3.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.3.0.zip",
        "3.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.3.1.zip",
        "3.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.3.2.zip",
        "3.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.3.3.zip",
        "3.5": "https://downloads.wordpress.org/plugin/youtube-embed-plus.3.5.zip",
        "3.7": "https://downloads.wordpress.org/plugin/youtube-embed-plus.3.7.zip",
        "4.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.4.0.zip",
        "4.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.4.1.zip",
        "4.5": "https://downloads.wordpress.org/plugin/youtube-embed-plus.4.5.zip",
        "4.6": "https://downloads.wordpress.org/plugin/youtube-embed-plus.4.6.zip",
        "4.7": "https://downloads.wordpress.org/plugin/youtube-embed-plus.4.7.zip",
        "4.8": "https://downloads.wordpress.org/plugin/youtube-embed-plus.4.8.zip",
        "5.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.5.0.zip",
        "5.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.5.1.zip",
        "6.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.6.0.zip",
        "6.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.6.1.zip",
        "6.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.6.2.zip",
        "6.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.6.3.zip",
        "6.4": "https://downloads.wordpress.org/plugin/youtube-embed-plus.6.4.zip",
        "7.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.7.0.zip",
        "7.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.7.1.zip",
        "7.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.7.2.zip",
        "7.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.7.3.zip",
        "7.5": "https://downloads.wordpress.org/plugin/youtube-embed-plus.7.5.zip",
        "7.6": "https://downloads.wordpress.org/plugin/youtube-embed-plus.7.6.zip",
        "7.7": "https://downloads.wordpress.org/plugin/youtube-embed-plus.7.7.zip",
        "7.8": "https://downloads.wordpress.org/plugin/youtube-embed-plus.7.8.zip",
        "7.9": "https://downloads.wordpress.org/plugin/youtube-embed-plus.7.9.zip",
        "8.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.8.0.zip",
        "8.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.8.1.zip",
        "8.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.8.2.zip",
        "8.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.8.3.zip",
        "8.4": "https://downloads.wordpress.org/plugin/youtube-embed-plus.8.4.zip",
        "8.5": "https://downloads.wordpress.org/plugin/youtube-embed-plus.8.5.zip",
        "8.6": "https://downloads.wordpress.org/plugin/youtube-embed-plus.8.6.zip",
        "8.7": "https://downloads.wordpress.org/plugin/youtube-embed-plus.8.7.zip",
        "8.8": "https://downloads.wordpress.org/plugin/youtube-embed-plus.8.8.zip",
        "8.9": "https://downloads.wordpress.org/plugin/youtube-embed-plus.8.9.zip",
        "9.0": "https://downloads.wordpress.org/plugin/youtube-embed-plus.9.0.zip",
        "9.1": "https://downloads.wordpress.org/plugin/youtube-embed-plus.9.1.zip",
        "9.2": "https://downloads.wordpress.org/plugin/youtube-embed-plus.9.2.zip",
        "9.3": "https://downloads.wordpress.org/plugin/youtube-embed-plus.9.3.zip",
        "9.4": "https://downloads.wordpress.org/plugin/youtube-embed-plus.9.4.zip",
        "9.5": "https://downloads.wordpress.org/plugin/youtube-embed-plus.9.5.zip",
        "9.7": "https://downloads.wordpress.org/plugin/youtube-embed-plus.9.7.zip",
        "9.8": "https://downloads.wordpress.org/plugin/youtube-embed-plus.9.8.zip",
        "trunk": "https://downloads.wordpress.org/plugin/youtube-embed-plus.zip"
    },
    "business_model": false,
    "repository_url": "",
    "commercial_support_url": "",
    "donate_link": "",
    "banners": {
        "low": "https://ps.w.org/youtube-embed-plus/assets/banner-772x250.png?rev=2165403",
        "high": "https://ps.w.org/youtube-embed-plus/assets/banner-1544x500.png?rev=2165457"
    },
    "icons": {
        "1x": "https://ps.w.org/youtube-embed-plus/assets/icon-128x128.png?rev=2165403",
        "2x": "https://ps.w.org/youtube-embed-plus/assets/icon-256x256.png?rev=2165403"
    },
    "blocks": {
        "epyt/youtube": {
            "name": "epyt/youtube",
            "title": "YouTube Wizard"
        },
        "epyt/vi": {
            "name": "epyt/vi",
            "title": "Video Ad"
        }
    },
    "block_assets": [],
    "author_block_count": 1,
    "author_block_rating": 92,
    "blueprints": [],
    "preview_link": "",
    "language_packs": []
}