{
    "name": "Photorush",
    "slug": "photorush",
    "version": "1.0.1",
    "preview_url": "https://wp-themes.com/photorush/",
    "author": {
        "user_nicename": "alexathemes",
        "profile": "https://profiles.wordpress.org/alexathemes/",
        "avatar": "https://secure.gravatar.com/avatar/9fc9092613986ee405c062fb87bfce68?s=96&d=monsterid&r=g",
        "display_name": "alexathemes",
        "author": "Alexathemes",
        "author_url": "https://alexathemes.net"
    },
    "screenshot_url": "https://i0.wp.com/themes.svn.wordpress.org/photorush/1.0.1/screenshot.png",
    "screenshot_count": 1,
    "screenshots": [
        "https://wp-themes.com/wp-content/themes/photorush/screenshot.png"
    ],
    "theme_url": "https://alexathemes.net/themes/free-photorush-wordpress-theme/",
    "ratings": {
        "1": 0,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 0
    },
    "rating": 0,
    "num_ratings": 0,
    "reviews_url": "https://wordpress.org/support/theme/photorush/reviews/",
    "downloaded": 610,
    "active_installs": 90,
    "last_updated": "2024-09-09",
    "last_updated_time": "2024-09-09 05:47:37",
    "creation_time": "2024-08-23 12:56:47",
    "upload_date": {
        "1.0": "2024-08-20 09:07:07",
        "1.0.1": "2024-09-09 05:47:35"
    },
    "homepage": "https://wordpress.org/themes/photorush/",
    "sections": {
        "description": "Photorush is a Full Site Editing Photography WordPress Theme, meticulously crafted for photographers and photobloggers who want to showcase their work in a visually captivating and professional manner. This theme is the perfect solution for anyone passionate about photography, offering a stunning platform to display your portfolio, share your creative journey, and even sell your photos online. With a design that prioritizes image quality and storytelling, this theme is built to help you make a lasting impression on your audience. The responsive layout ensures that your photos look incredible on any device, whether it's a desktop, tablet, or smartphone, making it easy for your visitors to enjoy your work no matter where they are. In today's competitive digital landscape, SEO-friendliness is essential, and this theme has been optimized to help you rank higher on search engines, ensuring that your website gets the visibility it deserves. Whether you're sharing your latest shoot or writing a blog post about your photography adventures, this theme is built to attract and retain visitors. Additionally, this Photography WordPress Theme is WooCommerce compatible, allowing you to effortlessly set up an online store and sell your photography services, prints, or digital downloads directly from your website. This seamless integration ensures a smooth shopping experience for your customers, all while maintaining the visual integrity of your site. The theme is fully tested with the latest WordPress versions, ensuring compatibility and smooth performance across all updates. This means you can focus on your creativity without worrying about technical glitches or outdated features. The Full Site Editing capabilities allow you to easily customize every aspect of your site, from headers to footers, without touching a single line of code. You can create a unique look that matches your personal style or brand, giving you complete control over the design and functionality of your website. Whether you're a professional photographer looking to establish a strong online presence or a passionate photoblogger wanting to share your journey with the world, this Photography WordPress Theme offers everything you need to create a stunning, user-friendly, and fully functional website. It's more than just a theme; it's a tool that empowers you to bring your vision to life and connect with your audience in meaningful ways. Get ready to elevate your photography website to new heights with this exceptional WordPress theme."
    },
    "download_link": "https://downloads.wordpress.org/theme/photorush.1.0.1.zip",
    "tags": {
        "block-patterns": "Block editor patterns",
        "blog": "Blog",
        "custom-colors": "Custom colors",
        "custom-logo": "Custom logo",
        "custom-menu": "Custom menu",
        "e-commerce": "E-commerce",
        "editor-style": "Editor style",
        "featured-images": "Featured images",
        "full-site-editing": "Block themes",
        "one-column": "One column",
        "photography": "Photography",
        "right-sidebar": "Right sidebar",
        "rtl-language-support": "RTL language support",
        "sticky-post": "Sticky post",
        "threaded-comments": "Threaded comments"
    },
    "versions": {
        "1.0": "https://downloads.wordpress.org/theme/photorush.1.0.zip",
        "1.0.1": "https://downloads.wordpress.org/theme/photorush.1.0.1.zip"
    },
    "requires": "6.1",
    "requires_php": "7.0",
    "trac_tickets": {
        "1.0": "https://themes.trac.wordpress.org/ticket/186206",
        "1.0.1": "https://themes.trac.wordpress.org/ticket/188059"
    },
    "is_commercial": true,
    "external_support_url": "",
    "is_community": false,
    "external_repository_url": ""
}